[{"title": "Kevin Systrom: Instagram | Lex Fridman Podcast #243", "id": "3pvpNKUPbIY", "quotes": [{"time": 232, "text": "It became a photo sharing app, but one that was much more about what you're doing and where you are."}, {"time": 237, "text": "And that's why when I say, I think we've replaced check in apps, it became a check in via a photo rather than saying your location and then optionally adding a photo."}, {"time": 248, "text": "When you were thinking about what people like, from where did you get a sense that this is what people like?"}, {"time": 254, "text": "You said, we sat down, we wrote some stuff down on paper."}, {"time": 258, "text": "Where is that intuition that seems fundamental to the success of an app like Instagram?"}, {"time": 266, "text": "Where does that idea, where does that list of three things come from exactly?"}, {"time": 271, "text": "Only after having studied machine learning now for a couple of years, I like, I have a... You have understood yourself?"}, {"time": 279, "text": "I've started to make connections, like we can go into this later, but obviously the connections between machine learning and the human brain, I think are stretched sometimes."}, {"time": 293, "text": "At the same time, being able to back prop and being able to look at the world, try something, figure out how you're wrong, how wrong you are, and then nudge your company in the right direction based on how wrong you are, is a fascinating concept."}, {"time": 312, "text": "And I don't, we didn't know we were doing it at the time, but that's basically what we were doing, right?"}, {"time": 317, "text": "We put it out to, call it a hundred people, and you would look at their data."}, {"time": 322, "text": "You would say, what are they sharing?"}, {"time": 325, "text": "Like what resonates, what doesn't resonate?"}, {"time": 326, "text": "We think they're gonna resonate with X, but it turns out they resonate with Y."}, {"time": 331, "text": "Okay, shift the company towards Y."}, {"time": 333, "text": "And it turns out if you do that enough quickly enough, you can get to a solution that has product market fit."}, {"time": 339, "text": "Most companies fail because they sit there and they don't, either they're learning rates too slow, they sit there and they're just, they're adamant that they're right, even though the data is telling them they're not right, or they're learning rates too high and they wildly chase different ideas and they never actually settle on one where they don't groove, right?"}, {"time": 359, "text": "And I think when we sat down and we wrote out those three ideas, what we were saying is, what are the three possible, whether they're local or global maxima in our world, right?"}, {"time": 370, "text": "That users are telling us they like because they're using the product that way."}, {"time": 374, "text": "It was clear people liked the photos because that was the thing they were doing."}, {"time": 378, "text": "And we just said, okay, like, what if we just cut out most of the other stuff and focus on that thing?"}, {"time": 385, "text": "And then it happened to be a multi billion dollar business and it's that easy by the way."}, {"time": 392, "text": "Well, nobody ever writes about neural networks that miserably failed."}, {"time": 396, "text": "So this particular neural network succeeded."}, {"time": 398, "text": "Oh, they sell all the time, right?"}, {"time": 401, "text": "But nobody writes about it."}, {"time": 401, "text": "The default state is failing."}, {"time": 404, "text": "When you said the way people are using the app, is that the loss function for this neural network or is it also self report?"}, {"time": 412, "text": "Like, do you ever ask people what they like or do you have to track exactly what they're doing, not what they're saying?"}, {"time": 420, "text": "I once made a Thanksgiving dinner, okay?"}, {"time": 423, "text": "And it was for relatives and I like to cook a lot."}, {"time": 429, "text": "And I worked really hard on picking the specific dishes and I was really proud because I had planned it out using a Gantt chart and like it was ready on time and everything was hot."}, {"time": 442, "text": "Like, I don't know if you're a big Thanksgiving guy, but like the worst thing about Thanksgiving is when the turkey is cold and some things are hot and some things, anyway."}, {"time": 449, "text": "You had a Gantt chart."}, {"time": 450, "text": "Did you actually have a chart?"}, {"time": 452, "text": "OmniPlan, fairly expensive, like Gantt chart thing that I think maybe 10 people have purchased in the world, but I'm one of them and I use it for recipe planning only around big holidays."}, {"time": 465, "text": "Do people do this kind of... Overengineering?"}, {"time": 468, "text": "It's not overengineering, it's just engineering."}, {"time": 470, "text": "It's planning."}, {"time": 471, "text": "Thanksgiving is a complicated set of events with some uncertainty with a lot of things going on."}, {"time": 477, "text": "You should be able, you should be planning it in this way."}, {"time": 479, "text": "There should be a chart."}, {"time": 480, "text": "It's not overengineering."}, {"time": 481, "text": "I mean, so what's funny is, brief aside."}, {"time": 484, "text": "Yes, it's brilliant."}, {"time": 486, "text": "I love cooking, I love food, I love coffee, and I've spent some time with some chefs who like know their stuff."}, {"time": 492, "text": "And they always just take out a piece of paper and just work backwards in rough order."}, {"time": 497, "text": "Like it's never perfect, but rough order."}, {"time": 500, "text": "It's just like, oh, that makes sense."}, {"time": 501, "text": "Why not just work backwards from the end goal, right?"}, {"time": 504, "text": "And put in some buffer time."}, {"time": 506, "text": "And so I probably over specified it a bit using a Gantt chart, but the fact that you can do it, it's what professional kitchens roughly do."}, {"time": 515, "text": "They just don't call it a Gantt chart, or at least I don't think they do."}, {"time": 518, "text": "Anyway, I was telling a story about Thanksgiving."}, {"time": 522, "text": "I'm sitting down, we have the meal, and then I got to know Ray Dalio fairly well over maybe the last year of Instagram."}, {"time": 533, "text": "And one thing that he kept saying was like, feedback is really hard to get honestly from people."}, {"time": 539, "text": "And I sat down after dinner, I said, guys, I want feedback."}, {"time": 543, "text": "What was good and what was bad?"}, {"time": 546, "text": "And what's funny is like, literally everyone just said everything was great."}, {"time": 551, "text": "And I like personally knew I had screwed up a handful of things, but no one would say it."}, {"time": 557, "text": "And can you imagine now not something as high stakes as Thanksgiving dinner, okay?"}, {"time": 562, "text": "Thanksgiving dinner, it's not that high stakes."}, {"time": 565, "text": "But you're trying to build a product and everyone knows you left your job for it and you're trying to build it out and you're trying to make something wonderful and it's yours, right?"}, {"time": 573, "text": "You designed it."}, {"time": 575, "text": "Now try asking for feedback and know that you're giving this to your friends and your family."}, {"time": 582, "text": "People have trouble giving hard feedback."}, {"time": 585, "text": "People have trouble saying, I don't like this or this isn't great, or this is how it's failed me."}, {"time": 591, "text": "In fact, you usually have two classes of people."}, {"time": 596, "text": "People who just won't say bad things, you can literally say to them, please tell me what you hate most about this and they won't do it."}, {"time": 603, "text": "They'll try, but they won't."}, {"time": 605, "text": "And then the other class of people are just negative period about everything and it's hard to parse out like what is true and what isn't."}, {"time": 614, "text": "So my rule of thumb with this is you should always ask people, but at the end of the day, it's amazing what data will tell you."}, {"time": 623, "text": "And that's why with whatever project I work on, even now, collecting data from the beginning on usage patterns, so engagement, how many days of the week do they use it?"}, {"time": 634, "text": "How many, I don't know if we were to go back to Instagram, how many impressions per day, right?"}, {"time": 639, "text": "Is that growing?"}, {"time": 640, "text": "Is that shrinking?"}, {"time": 641, "text": "And don't be like overly scientific about it, right?"}, {"time": 644, "text": "Cause maybe you have 50 beta users or something."}, {"time": 648, "text": "But what's fascinating is that data doesn't lie."}, {"time": 652, "text": "People are very defensive about their time."}, {"time": 657, "text": "They'll say, oh, I'm so busy, I'm sorry I didn't get to use the app."}, {"time": 660, "text": "Like I'm just, you know, but I don't know you were posting on Instagram the whole time."}, {"time": 667, "text": "So I don't know at the end of the day, like at Facebook there was, you know, before time spent became kind of this loaded term there."}, {"time": 675, "text": "The idea that people's currency in their lives is time."}, {"time": 681, "text": "And they only have a certain amount of time to give things, whether it's friends or family or apps or TV shows or whatever, there's no way of inventing more of it, at least not that I know of."}, {"time": 692, "text": "If they don't use it, it's because it's not great."}, {"time": 695, "text": "So the moral of the story is you can ask all you want, but you just have to look at the data."}, {"time": 701, "text": "And data doesn't lie, right?"}, {"time": 705, "text": "I mean, there's metrics, there's data can obscure the key insight if you're not careful."}, {"time": 714, "text": "So time spent in the app, that's one."}, {"time": 717, "text": "There's so many metrics you can put at this and they will give you totally different insights, especially when you're trying to create something that doesn't obviously exist yet."}, {"time": 727, "text": "So, you know, measuring maybe why you left the app or measuring special moments of happiness that will make sure you return to the app or moments of happiness that are long lasting versus like dopamine short term, all of those things."}, {"time": 746, "text": "But I think I suppose in the beginning, you can just get away with just asking the question, which features are used a lot?"}, {"time": 755, "text": "Let's do more of that."}, {"time": 757, "text": "And how hard was the decision?"}, {"time": 760, "text": "And I mean, maybe you can tell me what Instagram looked in the beginning, but how hard was it to make pictures of the first class citizen?"}, {"time": 768, "text": "That's a revolutionary idea."}, {"time": 770, "text": "Like at whatever point Instagram became this feed of photos, that's quite brilliant."}, {"time": 778, "text": "Plus, I also don't know when this happened, but they're all shaped the same."}, {"time": 786, "text": "I have to tell you why, that's the interesting part."}, {"time": 790, "text": "So a couple of things."}, {"time": 791, "text": "One is data, like you're right."}, {"time": 796, "text": "You can overinterpret data."}, {"time": 798, "text": "Like imagine trying to fly a plane by staring at, I don't know, a single metric like airspeed."}, {"time": 805, "text": "You don't know if you're going up or down."}, {"time": 807, "text": "I mean, it correlates with up or down, but you don't actually know."}, {"time": 809, "text": "It will never help you land the plane."}, {"time": 812, "text": "So don't stare at one metric."}, {"time": 813, "text": "Like it turns out you have to synthesize a bunch of metrics to know where to go."}, {"time": 817, "text": "But it doesn't lie."}, {"time": 820, "text": "Like if your airspeed is zero, unless it's not working, right?"}, {"time": 823, "text": "If it's zero, you're probably gonna fall out of the sky."}, {"time": 826, "text": "So generally you look around and you have the scan going."}, {"time": 831, "text": "And you're just asking yourself, is this working or is this not working?"}, {"time": 836, "text": "But people have trouble explaining how they actually feel."}, {"time": 842, "text": "So just, it's about synthesizing both of them."}, {"time": 845, "text": "So then Instagram, right?"}, {"time": 847, "text": "We were talking about revolutionary moment where the feed became square photos basically."}, {"time": 854, "text": "And photos first and then square photos."}, {"time": 859, "text": "It was clear to me that the biggest, so I believe the biggest companies are founded when enormous technical shifts happen."}, {"time": 870, "text": "And the biggest technical shift that happened right before Instagram was founded was the advent of a phone that didn't suck."}, {"time": 878, "text": "The iPhone, right?"}, {"time": 878, "text": "Like in retrospect, we're like, oh my God, the first iPhone that almost had, like it wasn't that good."}, {"time": 884, "text": "But compared to everything else at the time, it was amazing."}, {"time": 888, "text": "And by the way, the first phone that had an incredible camera that could like do as well as the point and shoot you might carry around was the iPhone 4."}, {"time": 901, "text": "And that was right when Instagram launched."}, {"time": 902, "text": "And we looked around and we said, what will change?"}, {"time": 905, "text": "Because everyone has a camera in their pocket."}, {"time": 908, "text": "And it was so clear to me that the world of social networks before it was based in the desktop and sitting there and having a link you could share, right?"}, {"time": 920, "text": "And that wasn't gonna be the case."}, {"time": 921, "text": "So the question is what would you share if you were out and about in the world?"}, {"time": 926, "text": "If not only did you have a camera that fit in your pocket, but by the way, that camera had a network attached to it that allowed you to share instantly."}, {"time": 934, "text": "That seemed revolutionary."}, {"time": 936, "text": "And a bunch of people saw it at the same time."}, {"time": 937, "text": "It wasn't just Instagram."}, {"time": 938, "text": "There were a bunch of competitors."}, {"time": 941, "text": "The thing we did, I think was not only, well, we focused on two things."}, {"time": 945, "text": "So we wrote down those things, we circled photos and we said, I think we should invest in this."}, {"time": 950, "text": "But then we said, what sucks about photos?"}, {"time": 952, "text": "One, they look like crap, right?"}, {"time": 955, "text": "They just, at least back then."}, {"time": 957, "text": "Now my phone takes pretty great photos, right?"}, {"time": 961, "text": "Back then they were blurry, not so great, compressed, right?"}, {"time": 966, "text": "Two, it was really slow, like really slow to upload a photo."}, {"time": 972, "text": "And I'll tell a fun story about that and explain to you why they're all the same size and square as well."}, {"time": 978, "text": "And three, man, if you wanted to share a photo on different networks, you had to go to each of the individual apps and select all of them and upload individually."}, {"time": 987, "text": "And so we were like, all right, those are the pain points."}, {"time": 990, "text": "We're gonna focus on that."}, {"time": 991, "text": "So one, instead of, because they weren't beautiful, we were like, why don't we lean into the fact that they're not beautiful?"}, {"time": 998, "text": "And I remember studying in Florence, my photography teacher gave me this Holga camera and I'm not sure everyone knows what a Holga camera is, but they're these old school plastic cameras."}, {"time": 1008, "text": "I think they're produced in China at the time."}, {"time": 1012, "text": "And I wanna say the original ones were like from the 70s or the 80s or something."}, {"time": 1015, "text": "They're supposed to be like $3 cameras for the every person."}, {"time": 1018, "text": "They took nice medium format films, large negatives, but they kind of blurred the light and they kind of like light leaked into the side."}, {"time": 1030, "text": "And there was this whole resurgence where people looked at that and said, oh my God, this is a style, right?"}, {"time": 1036, "text": "And I remember using that in Florence and just saying, well, why don't we just like lean into the fact that these photos suck and make them suck more, but in an artistic way."}, {"time": 1046, "text": "And it turns out that had product market fit."}, {"time": 1048, "text": "People really liked that."}, {"time": 1049, "text": "They were willing to share their not so great photos if they looked not so great on purpose, okay?"}, {"time": 1055, "text": "The second part."}, {"time": 1057, "text": "That's where the filters come into picture."}, {"time": 1060, "text": "So computational modification of photos to make them look extra crappy to where it becomes art."}, {"time": 1067, "text": "And I mean, add light leaks, add like an overlay filter, make them more contrasty than they should be."}, {"time": 1074, "text": "The first filter we ever produced was called X Pro 2."}, {"time": 1078, "text": "And I designed it while I was in this small little bed and breakfast room in Todos Santos, Mexico."}, {"time": 1083, "text": "I was trying to take a break from the bourbon days."}, {"time": 1086, "text": "And I remember saying to my co founder, I just need like a week to reset."}, {"time": 1091, "text": "And that was on that trip worked on the first filter because I said, you know, I think I can do this."}, {"time": 1097, "text": "And I literally iterated one by one over the RGB values in the array that was the photo and just slightly shifted."}, {"time": 1106, "text": "Basically there was a function of R, function of G, function of B that just shifted them slightly."}, {"time": 1112, "text": "It was in rocket science."}, {"time": 1114, "text": "And it turns out that actually made your photo look pretty cool."}, {"time": 1118, "text": "It just mapped from one color space to another color space."}, {"time": 1122, "text": "It was simple, but it was really slow."}, {"time": 1124, "text": "I mean, if you applied a filter, I think it used to take two or three seconds to render."}, {"time": 1130, "text": "Only eventually would I figure out how to do it on the GPU."}, {"time": 1133, "text": "And I'm not even sure it was a GPU, but it was using OpenGL."}, {"time": 1136, "text": "But anyway, I would eventually figure that out and then it would be instant, but it used to be really slow."}, {"time": 1142, "text": "By the way, anyone who's watching or listening, it's amazing what you can get away with in a startup as long as the product outcome is right for the user."}, {"time": 1154, "text": "Like you can be slow."}, {"time": 1155, "text": "You can be terrible."}, {"time": 1156, "text": "You can be, as long as you have product market fit, people will put up with a lot."}, {"time": 1162, "text": "And then the question is just about compressing, making it more performant over time so that they get that product market fit instantly."}, {"time": 1170, "text": "So fascinating because there's some things where those three seconds would make or break the app, but some things you're saying not."}, {"time": 1179, "text": "It's hard to know when, it's the problem Spotify solved for making streaming like work."}, {"time": 1188, "text": "And like delays in listening to music is a huge negative, even like slight delays."}, {"time": 1195, "text": "But here you're saying, I mean, how do you know when those three seconds are okay or are you just gonna have to try it out?"}, {"time": 1203, "text": "Because to me, my intuition would be those three seconds would kill the app."}, {"time": 1209, "text": "Like I would try to do the OpenGL thing."}, {"time": 1212, "text": "Right, so I wish I were that smart at the time."}, {"time": 1217, "text": "I wasn't, I just knew how to do what I knew how to do."}, {"time": 1221, "text": "And I decided, okay, like, why don't I just iterate over the values and change them?"}, {"time": 1227, "text": "And what's interesting is that compared to the alternatives, no one else used OpenGL."}, {"time": 1235, "text": "So everyone else was doing it the dumb way."}, {"time": 1237, "text": "And in fact, they were doing it at a high resolution."}, {"time": 1240, "text": "Now comes in the small resolution that we'll talk about in a second."}, {"time": 1245, "text": "By choosing 512 pixels by 512 pixels, which I believe it was at the time, we iterated over a lot fewer pixels than our competitors who were trying to do these enormous output like images."}, {"time": 1258, "text": "So instead of taking 20 seconds, I mean, three seconds feels pretty good, right?"}, {"time": 1263, "text": "So on a relative basis, we were winning like a lot."}, {"time": 1266, "text": "Okay, so that's answer number one."}, {"time": 1268, "text": "Answer number two is we actually focused on latency in the right places."}, {"time": 1273, "text": "So we did this really wonderful thing when you uploaded."}, {"time": 1277, "text": "So the way it would work is you'd take your phone, you'd take the photo and then you'd go to the, you'd go to the edit screen where you would caption it."}, {"time": 1288, "text": "And on that caption screen, you'd start typing and you'd think, okay, like what's a clever caption?"}, {"time": 1294, "text": "And I said to Mike, hey, when I worked on the Gmail team, you know what they did?"}, {"time": 1297, "text": "When you typed in your username or your email address, even before you've entered in your password, like the probability once you enter in your username that you're going to actually sign in is extremely high."}, {"time": 1311, "text": "So why not just start loading your account in the background?"}, {"time": 1313, "text": "Not like sending it down to the desktop, that would be a security issue, but like loaded into memory on the server, like get it ready, prepare it."}, {"time": 1323, "text": "I always thought that was so fascinating and unintuitive."}, {"time": 1326, "text": "And I was like, Mike, why don't we just do that?"}, {"time": 1328, "text": "But like, we'll just upload the photo and like assume you're going to upload the photo."}, {"time": 1334, "text": "And if you don't, forget about it, we'll delete it, right?"}, {"time": 1337, "text": "So what ended up happening was people would caption their photo, they'd press done or upload and you'd see this little progress bar just go foop."}, {"time": 1347, "text": "It was lightning fast, okay?"}, {"time": 1350, "text": "We were no faster than anyone else at the time, but by choosing 512 by 512 and doing it in the background, it almost guaranteed that it was done by the time you captioned."}, {"time": 1361, "text": "And everyone when they used it was like, how the hell is this thing so fast?"}, {"time": 1367, "text": "But we were slow, we just hid the slowness."}, {"time": 1369, "text": "It wasn't like, these things are just like, it's a shell game, you're just hiding the latency."}, {"time": 1375, "text": "That mattered to people like a lot."}, {"time": 1378, "text": "And I think that, so you were willing to put up with a slow filter if it meant you could share it immediately."}, {"time": 1384, "text": "And of course we added sharing options which let you distribute it really quickly, that was the third part."}, {"time": 1391, "text": "So latency matters, but relative to what?"}, {"time": 1394, "text": "And then there's some like tricks, you get around to just hiding the latency."}, {"time": 1400, "text": "Like I don't know if Spotify starts downloading the next song eagerly, I'm assuming they do."}, {"time": 1405, "text": "There are a bunch of ideas here that are not rocket science that really help."}, {"time": 1411, "text": "And all of that was stuff you were explicitly having a discussion about, like those designs and you were having like arguments, discussions."}, {"time": 1421, "text": "I'm not sure it was arguments, I mean, I'm not sure if you've met my co founder Mike, but he's a pretty nice guy and he's very reasonable."}, {"time": 1428, "text": "And we both just saw eye to eye and we're like, yeah, it's like, make this fast or at least seem fast, it'll be great."}, {"time": 1437, "text": "Honestly, I think the most contentious thing and he would say this too initially, was I was on an iPhone 3G, so like the not so fast one."}, {"time": 1448, "text": "And he had a brand new iPhone 4, that was cheap."}, {"time": 1452, "text": "And his feed loaded super smoothly, like when he would scroll from photo to photo, buttery smooth, right?"}, {"time": 1460, "text": "But on my phone, every time you got to a new photo, it was like, kachunk, kachunk, allocate memory, like all this stuff, right?"}, {"time": 1467, "text": "I was like, Mike, that's unacceptable."}, {"time": 1469, "text": "He's like, oh, come on, man, just like upgrade your phone."}, {"time": 1471, "text": "Basically, he didn't actually say that, he was nicer than that."}, {"time": 1475, "text": "But I could tell he wished like, I would just stop being cheap and just get a new phone."}, {"time": 1479, "text": "But what's funny is we actually sat there working on that little detail for a few days before launch."}, {"time": 1485, "text": "And that polished experience, plus the fact that uploading seemed fast for all these people who didn't have nice phones, I think meant a lot because far too often, you see teams focus not on performance, they focus on what's the cool computer science problem they can solve, right?"}, {"time": 1505, "text": "Can we scale this thing to a billion users and they've got like a hundred, right?"}, {"time": 1512, "text": "You talked about loss function, so I want to come back to that."}, {"time": 1516, "text": "Like the loss function is like, do you provide a great, happy, magical, whatever experience for the consumer?"}, {"time": 1523, "text": "And listen, if it happens to involve something complex and technical, then great."}, {"time": 1527, "text": "But it turns out, I think most of the time, those experiences are just sitting there waiting to be built with like not that complex solutions."}, {"time": 1538, "text": "But everyone is just like so stuck in their own head that they have to overengineer everything and then they forget about the easy stuff."}, {"time": 1545, "text": "I mean, also, maybe to flip the loss function there is, you're trying to minimize the number of times there's unpleasant experience, right?"}, {"time": 1554, "text": "Like the one you mentioned where when you go to the next photo, it freezes for a little bit."}, {"time": 1558, "text": "So it's almost, as opposed to maximizing pleasure, it's probably easier to minimize the number of like, the friction."}, {"time": 1566, "text": "And as we all know, you just make the pleasure negative and then minimize everything, so."}, {"time": 1573, "text": "We're mapping this all back to neural networks."}, {"time": 1574, "text": "But actually, can I say one thing on that, which is I don't know a lot about machine learning, but I feel like I've tried studying a bunch."}, {"time": 1583, "text": "That whole idea of reinforcement learning and planning out more than the greedy single experience, I think is the closest you can get to like ideal product design thinking, where you're not saying, hey, like, can we have a great experience just this one time?"}, {"time": 1603, "text": "But like, what is the right way to onboard someone?"}, {"time": 1606, "text": "What series of experiences correlate most with them hanging on long term, right?"}, {"time": 1612, "text": "So not just saying, oh, did the photo load slowly a couple of times, or did they get a great photo at the top of their feed?"}, {"time": 1620, "text": "But like, what are the things that are gonna make this person come back over the next week, over the next month?"}, {"time": 1626, "text": "And as a product designer asking yourself, okay, I wanna optimize, not just minimize bad experiences in the short run, but like, how do I get someone to engage over the next month?"}, {"time": 1637, "text": "And I'm not gonna claim at all that I thought that way at all at the time, because I certainly didn't."}, {"time": 1643, "text": "But if I were going back and giving myself any advice, it would be thinking, what are those second order effects that you can create?"}, {"time": 1650, "text": "And it turns out having your friends on the service is an enormous win."}, {"time": 1654, "text": "So starting with a very small group of people that produce content that you wanted to see, which we did, we seeded the community very well, I think."}, {"time": 1663, "text": "Ended up mattering, and so."}, {"time": 1666, "text": "Yeah, you said that community is one of the most important things."}, {"time": 1669, "text": "So it's from a metrics perspective, from maybe a philosophy perspective, building a certain kind of community within the app."}, {"time": 1677, "text": "See, I wasn't sure what exactly you meant by that when I first heard you say that."}, {"time": 1681, "text": "Maybe you can elaborate, but as I understand now, it can literally mean get your friends onto the app."}, {"time": 1689, "text": "Yeah, think of it this way."}, {"time": 1692, "text": "You can build an amazing restaurant or bar or whatever, right, but if you show up and you're the only one there, is it like, does it matter how good the food is?"}, {"time": 1704, "text": "The drinks, whatever?"}, {"time": 1705, "text": "No, these are inherently social experiences that we were working on."}, {"time": 1710, "text": "So the idea of having people there, like you needed to have that, otherwise it was just a filter out."}, {"time": 1719, "text": "But by the way, part of the genius, I'm gonna say genius, even though it wasn't really genius, was starting to be marauding as a filter app was awesome."}, {"time": 1730, "text": "The fact that you could, so we talk about single player mode a lot, which is like, can you play the game alone?"}, {"time": 1736, "text": "And Instagram, you could totally play alone."}, {"time": 1737, "text": "You could filter your photos, and a lot of people would tell me, I didn't even realize that this thing was a social network until my friend showed up."}, {"time": 1746, "text": "It totally worked as a single player game."}, {"time": 1749, "text": "And then when your friends showed up, all of a sudden it was like, oh, not only was this great alone, but now I actually have this trove of photos that people can look at and start liking, and then I can like theirs."}, {"time": 1760, "text": "And so it was this bootstrap method of how do you make the thing not suck when the restaurant is empty?"}, {"time": 1767, "text": "Yeah, but the thing is, when you say friends, we're not necessarily referring to friends in the physical space."}, {"time": 1772, "text": "So you're not bringing your physical friends with you."}, {"time": 1775, "text": "You're also making new friends."}, {"time": 1776, "text": "So you're finding new community."}, {"time": 1778, "text": "So it's not immediately obvious to me that it's almost like building any kind of community."}, {"time": 1786, "text": "And what we learned very early on was what made Instagram special and the reason why you would sign up for it versus say, just sit on Facebook and look at your friends photos."}, {"time": 1795, "text": "Of course we were live, and of course it was interesting to see what your friends were doing now."}, {"time": 1800, "text": "But the fact that you could connect with people who like took really beautiful photos in a certain style all around the world, whether they were travelers, it was the beginning of the influencer economy."}, {"time": 1811, "text": "It was these people who became professional Instagrammers way back when."}, {"time": 1816, "text": "But they took these amazing photos and some of them were photographers professionally."}, {"time": 1824, "text": "And all of a sudden you had this moment in the day when you could open up this app and sure you could see what your friends were doing, but also it was like, oh my God, that's a beautiful waterfall or oh my God, I didn't realize there was that corner of England or like really cool stuff."}, {"time": 1838, "text": "And the beauty about Instagram early on was that it was international by default."}, {"time": 1843, "text": "You didn't have to speak English to use it, right?"}, {"time": 1846, "text": "You could just look at the photos, works great."}, {"time": 1849, "text": "We did translate, we had some pretty bad translations, but we did translate the app."}, {"time": 1854, "text": "And even if our translations were pretty poor, the idea that you could just connect with other people through their images was pretty powerful."}, {"time": 1862, "text": "So how much technical difficulties there with the programming?"}, {"time": 1867, "text": "Like what programming language you were talking about?"}, {"time": 1869, "text": "What was?"}, {"time": 1869, "text": "Zero, like maybe it was hard for us, but I mean, there was nothing."}, {"time": 1876, "text": "The only thing that was complex about Instagram at the beginning technically was making it scale."}, {"time": 1883, "text": "We were just plain old Objective C for the client."}, {"time": 1887, "text": "So it was iPhone only at first?"}, {"time": 1889, "text": "iPhone only, yep."}, {"time": 1890, "text": "As an Android person, I'm deeply offended, but go ahead."}, {"time": 1894, "text": "This was 2010."}, {"time": 1895, "text": "Oh, sure, sure."}, {"time": 1897, "text": "Android's getting a lot better, right?"}, {"time": 1900, "text": "I take it back, you're right."}, {"time": 1901, "text": "If I were to do something today, I think it would be very different in terms of launch strategy, right?"}, {"time": 1906, "text": "Android's enormous too."}, {"time": 1909, "text": "But anyway, back to that moment, it was Objective C and then we were Python based, which is just like, this is before Python was really cool."}, {"time": 1920, "text": "Like now it's cool because it's all these machine learning libraries like support Python and right."}, {"time": 1925, "text": "Now it's super, now it's like cool to be Python."}, {"time": 1928, "text": "Back then it was like, oh, Google uses Python."}, {"time": 1930, "text": "Like maybe you should use Python."}, {"time": 1932, "text": "Facebook was PHP."}, {"time": 1934, "text": "Like I had worked at a small startup of some ex Googlers that used Python."}, {"time": 1939, "text": "So we used it and we used a framework called Django, still exists and people use for basically the backend."}, {"time": 1947, "text": "And then you threw a couple interesting things in there."}, {"time": 1950, "text": "I mean, we used Postgres, which was kind of fun."}, {"time": 1952, "text": "It was a little bit like Hipster database at the time, right?"}, {"time": 1954, "text": "Versus MySQL."}, {"time": 1956, "text": "MySQL, like everyone used MySQL."}, {"time": 1957, "text": "So like using Postgres was like an interesting decision."}, {"time": 1962, "text": "But we used it because it had a bunch of geo features built in because we thought we were gonna be a check and app, remember?"}, {"time": 1967, "text": "It's also super cool now."}, {"time": 1969, "text": "So you were into Python before it was cool and you were into Postgres before it was cool."}, {"time": 1973, "text": "Yeah, we were basically like, not only Hipster photo company, Hipster tech company, right?"}, {"time": 1980, "text": "We also adopted Redis early and like loved it."}, {"time": 1984, "text": "I mean, it solves so many problems for us and turns out that's still pretty cool."}, {"time": 1989, "text": "But the programming was very easy."}, {"time": 1991, "text": "It was like, sign up a user, have a feed."}, {"time": 1993, "text": "There was nothing, no machine learning at all, zero."}, {"time": 1997, "text": "Can you get some context?"}, {"time": 1998, "text": "How many users at each of these stages?"}, {"time": 2000, "text": "Are we talking about a hundred users, a thousand users?"}, {"time": 2004, "text": "So the stage I just described, I mean that technical stack lasted through probably 50 million users."}, {"time": 2012, "text": "I mean, seriously, like you can get away with a lot with a pretty basic stack."}, {"time": 2018, "text": "Like I think a lot of startups try to overengineer their solutions from the beginning to like really scale and you can get away with a lot."}, {"time": 2025, "text": "That being said, most of the first two years of Instagram was literally just trying to make that stack scale."}, {"time": 2031, "text": "And it wasn't, it was not a Python problem."}, {"time": 2034, "text": "It was like literally just like, where do we put the data?"}, {"time": 2038, "text": "Like it's all coming in too fast."}, {"time": 2039, "text": "Like how do we store it?"}, {"time": 2041, "text": "How do we make sure to be up?"}, {"time": 2042, "text": "How do we like, how do we make sure we're on the right size boxes that they have enough memory?"}, {"time": 2049, "text": "Those were the issues, but."}, {"time": 2051, "text": "Can you speak to the choices you make at that stage when you're growing so quickly?"}, {"time": 2056, "text": "Do you use something like somebody else's computer infrastructure or do you build in house?"}, {"time": 2062, "text": "I'm only laughing because we, when we launched we had a single computer that we had rented in some color space in LA."}, {"time": 2072, "text": "I don't even remember what it was called."}, {"time": 2074, "text": "Cause I thought that's what you did."}, {"time": 2075, "text": "When I worked at a company called Odio that became Twitter."}, {"time": 2078, "text": "I remember visiting our space in San Francisco."}, {"time": 2081, "text": "You walked in, you had to wear the ear things."}, {"time": 2083, "text": "It was cold and fans everywhere, right?"}, {"time": 2086, "text": "And we had to, you know, plug one out, replace one."}, {"time": 2089, "text": "And I was the intern, so I just like held things."}, {"time": 2092, "text": "But I thought to myself, oh, this is how it goes."}, {"time": 2094, "text": "And then I remember being in a VC's office."}, {"time": 2098, "text": "I think it was a benchmarks office."}, {"time": 2100, "text": "And I think we ran into another entrepreneur and they were like, oh, how are things going?"}, {"time": 2103, "text": "We're like, ah, you know, try to scale this thing."}, {"time": 2106, "text": "And they were like, well, I mean can't you just add more instances?"}, {"time": 2109, "text": "And I was like, what do you mean?"}, {"time": 2111, "text": "And they're like instances on Amazon."}, {"time": 2113, "text": "I was like, what are those?"}, {"time": 2115, "text": "And it was this moment where we realized how deep in it we were because we had no idea that AWS existed nor should we be using it."}, {"time": 2124, "text": "Anyway, that night we went back to the office and we got on AWS, but we did this really dumb thing."}, {"time": 2129, "text": "We're so sorry to people listening."}, {"time": 2132, "text": "But we brought up an instance, which was our database."}, {"time": 2138, "text": "It's gonna be a replacement for our database."}, {"time": 2140, "text": "But we had it talking over the public internet to our little box in LA that was our app server."}, {"time": 2148, "text": "That's how sophisticated we were."}, {"time": 2149, "text": "And obviously that was very, very slow."}, {"time": 2152, "text": "Didn't work at all."}, {"time": 2153, "text": "I mean, it worked, but didn't work."}, {"time": 2155, "text": "Only like later that night did we realize we had to have it all together."}, {"time": 2160, "text": "But at least like if you're listening right now and you're thinking, you know, I have no chance."}, {"time": 2164, "text": "I'm gonna start to start, but I have no chance."}, {"time": 2167, "text": "We did it and we made a bunch of really dumb mistakes initially."}, {"time": 2170, "text": "I think the question is how quickly do you learn that you're making a mistake?"}, {"time": 2173, "text": "And do you do the right thing immediately right after?"}, {"time": 2176, "text": "So you didn't pay for those mistakes by failure."}, {"time": 2180, "text": "So yeah, how quickly did you fix it?"}, {"time": 2183, "text": "I guess there's a lot of ways to sneak up to this question of how the hell do you scale the thing?"}, {"time": 2188, "text": "Other startups, if you have an idea, how do you scale the thing?"}, {"time": 2191, "text": "Is it just AWS and you try to write the kind of code that's easy to spread across a large number of instances, and then the rest is just put money into it?"}, {"time": 2205, "text": "Basically, I would say a couple of things."}, {"time": 2208, "text": "First off, don't even ask the question, just find product market fit, duct tape it together, right?"}, {"time": 2215, "text": "Like if you have to."}, {"time": 2216, "text": "I think there's a big caveat here, which I want to get to, but generally all that matters is product market fit."}, {"time": 2224, "text": "If people like your product, do not worry about when 50,000 people use your product because you will be happy that you have that problem when you get there."}, {"time": 2233, "text": "I actually can't name many startups where they go from nothing to something overnight and they can't figure out how to scale it."}, {"time": 2244, "text": "There are some, but I think nowadays, it's a, when I say a solved problem, like there are ways of solving it."}, {"time": 2253, "text": "The base case is typically that startups worry way too much about scaling way too early and forget that they actually have to make something that people like."}, {"time": 2260, "text": "That's the default mistake case."}, {"time": 2263, "text": "But what I'll say is once you start scaling, I mean, hiring quickly, people who have seen the game before and just know how to do it, it becomes a bit of like, yeah, just throw instances of the problem, right?"}, {"time": 2279, "text": "But the last thing I'll say on this that I think did save us, we were pretty rigorous about writing tests from the beginning."}, {"time": 2288, "text": "That helped us move very, very quickly when we wanted to rewrite parts of the product and know that we weren't breaking something else."}, {"time": 2297, "text": "Tests are one of those things where it's like, you go slow to go fast."}, {"time": 2300, "text": "And they suck when you have to write them because you have to figure it out."}, {"time": 2304, "text": "And there are always those ones that break when you don't want them to break and they're annoying and it feels like you spent all this time."}, {"time": 2310, "text": "But looking back, I think that like longterm optimal, even with a team of four, it allowed us to move very, very quickly because anyone could touch any part of the product and know that they weren't gonna bring down the site, or at least in general."}, {"time": 2325, "text": "At which point do you know product market fit?"}, {"time": 2328, "text": "How many users would you say?"}, {"time": 2330, "text": "Is it all it takes is like 10 people?"}, {"time": 2332, "text": "Or is it a thousand?"}, {"time": 2333, "text": "Is it 50,000?"}, {"time": 2335, "text": "I don't think it is generally a question of absolute numbers."}, {"time": 2339, "text": "I think it's a question of cohorts and I think it's a question of trends."}, {"time": 2343, "text": "So, you know, it depends how big your business is trying to be, right?"}, {"time": 2374, "text": "I don't think it's an absolute number."}, {"time": 2376, "text": "I think it is, I guess you could call it a marginal number."}, {"time": 2379, "text": "So I spent a lot of time when I work with startups asking them like, okay, have you looked at that cohort versus this cohort, whether it's your clients or whether it's people signing up for the service?"}, {"time": 2392, "text": "But a lot of people think you just have to hit some mark, like 10,000 people or 50,000 people, but really seven ish billion people in the world."}, {"time": 2401, "text": "Most people forever will not know about your product."}, {"time": 2405, "text": "There are always more people out there to sign up."}, {"time": 2407, "text": "It's just a question of how you turn on the spigot, so."}, {"time": 2411, "text": "At that stage, early stage yourself, but also by way of advice, should you worry about money at all?"}, {"time": 2418, "text": "How this thing's gonna make money?"}, {"time": 2420, "text": "Or do you just try to find product market fit and get a lot of users to enjoy using your thing?"}, {"time": 2428, "text": "I think it totally depends."}, {"time": 2430, "text": "And that's an unsatisfying answer."}, {"time": 2432, "text": "I was talking with a friend today who, he was one of our earlier investors and he was saying, hey, like, have you been doing any angel investing lately?"}, {"time": 2441, "text": "I said, not really."}, {"time": 2442, "text": "I'm just like focused on what I wanna do next."}, {"time": 2444, "text": "And he said, the number of financings have just gone bonkers."}, {"time": 2449, "text": "Like people are throwing money everywhere right now."}, {"time": 2456, "text": "And I think the question is, do you have an inkling of how you're gonna make money?"}, {"time": 2464, "text": "Or are you really just like waving your hands?"}, {"time": 2467, "text": "I would not like to be an entrepreneur in the position of, well, I have no idea how this will eventually make money."}, {"time": 2474, "text": "That's not fun."}, {"time": 2476, "text": "If you are in an area, like let's say you wanted to start a social network, right?"}, {"time": 2482, "text": "Not saying this is a good idea, but if you did, there are only a handful of ways they've made money and really only one way they've made money in the past and that's ads."}, {"time": 2491, "text": "So, if you have a service that's amenable to that and then I wouldn't worry too much about that because if you get to the scale, you can hire some smart people and figure that out."}, {"time": 2504, "text": "I do think that is really healthy for a lot of startups these days, especially the ones doing like enterprise software, slacks of the world, et cetera, to be worried about money from the beginning, but mostly as a way of winning over clients and having stickiness."}, {"time": 2525, "text": "Of course you need to be worried about money, but I'm gonna also say this again, which is it's like longterm profitability."}, {"time": 2532, "text": "If you have a roadmap to that, then that's great."}, {"time": 2535, "text": "But if you're just like, I don't know, maybe never, like we're working on this metaverse thing, I think maybe someday, I don't know."}, {"time": 2542, "text": "Like that seems harder to me."}, {"time": 2544, "text": "So you have to be as big as Facebook to like finance that bet, right?"}, {"time": 2549, "text": "Do you think it's possible, you said, you're not saying it's necessarily a good idea to launch a social network."}, {"time": 2555, "text": "Do you think it's possible today, maybe you can put yourself in those shoes, to launch a social network that achieves the scale of a Facebook or a Twitter or an Instagram, and maybe even greater scale?"}, {"time": 2576, "text": "Yeah, if I knew, I'd probably be doing it right now and not sitting here."}, {"time": 2580, "text": "So, I mean, there's a lot of ways to ask this question."}, {"time": 2583, "text": "One is create a totally new product market fit, create a new market, create something like Instagram did, which is like create something kind of new, or literally out compete Facebook at its own thing, or I'll compete Twitter at its own thing."}, {"time": 2599, "text": "The only way to compete now, if you wanna build a large social network is to look for the cracks, look for the openings."}, {"time": 2608, "text": "No one competed, I mean, no one competed with the core business of Google."}, {"time": 2613, "text": "No one competed with the core business of Microsoft."}, {"time": 2616, "text": "You don't go at the big guys doing exactly what they're doing."}, {"time": 2621, "text": "Instagram didn't win, quote unquote, because it tried to be a visual Twitter."}, {"time": 2626, "text": "Like we spotted things that either Twitter wasn't going to do or refuse to do, images and feed for the longest time, right?"}, {"time": 2635, "text": "Or that Facebook wasn't doing or not paying attention to because they were mostly desktop at the time and we were purely mobile, purely visual."}, {"time": 2645, "text": "Often there are opportunities sitting there."}, {"time": 2647, "text": "You have to figure out like, I think like there's a strategy book, I can't remember the name, but talk about moats and just like the best place to play is where your competitor literally can't pivot because structurally they're set up not to be there."}, {"time": 2666, "text": "And that's where you win."}, {"time": 2668, "text": "And what's fascinating is like, do you know how many people were like, images, Facebook does that, Twitter does that."}, {"time": 2675, "text": "I mean, how wrong were they, really wrong?"}, {"time": 2677, "text": "And these are some of the smartest people in Silicon Valley, right?"}, {"time": 2680, "text": "But now Instagram exists for a while."}, {"time": 2682, "text": "How is it that Snapchat could then exist?"}, {"time": 2687, "text": "Like plenty of people would say, well, there's Facebook, no images."}, {"time": 2690, "text": "Okay, okay, Instagram, I'll give you that one."}, {"time": 2692, "text": "But wait, now another image based social network is gonna get really big."}, {"time": 2697, "text": "And then TikTok comes along."}, {"time": 2699, "text": "Like the prior, so you asked me, is it possible?"}, {"time": 2703, "text": "The only reason I'm answering yes is because my prior is that it's happened once every, I don't know, three, four or five years consistently."}, {"time": 2713, "text": "And I can't imagine there's anything structurally that would change that."}, {"time": 2717, "text": "So that's why I answer that way."}, {"time": 2718, "text": "Not because I know how, I just, when you see a pattern, you see a pattern and there's no reason to believe that's gonna stop."}, {"time": 2725, "text": "And it's subtle too, because like you said, Snapchat and TikTok, they're all doing the same space of things, but there's something fundamentally different about like a three second video and a five second video and a 15 second video and a one minute video and a one hour video, like fundamentally different."}, {"time": 2743, "text": "Fundamentally different."}, {"time": 2745, "text": "I mean, I think one of the reasons Snapchat exists is because Instagram was so focused on posting great, beautiful manicured versions of yourself throughout time."}, {"time": 2757, "text": "And there was this enormous demand of like, hey, I really like this behavior."}, {"time": 2760, "text": "I love using Instagram, but man, I just like wish I could share something going on in my day."}, {"time": 2767, "text": "Do I really have to put it on my profile?"}, {"time": 2770, "text": "Do I really have to make it last forever?"}, {"time": 2771, "text": "Do I really, and that opened up a door, it created a market, right?"}, {"time": 2776, "text": "And then what's fascinating is Instagram had an explore page for the longest time and it was image driven, right?"}, {"time": 2783, "text": "But there's absolutely a behavior where you open up Instagram and you sit on the explore page all day."}, {"time": 2788, "text": "That is effectively TikTok, but obviously focused on videos."}, {"time": 2792, "text": "And it's not like you could just put the explore page in TikTok form and it works."}, {"time": 2797, "text": "It had to be video, it had to have music."}, {"time": 2799, "text": "These are the hard parts about product development that are very hard to predict, but they're all versions of the same thing with varying, like if you line them up in a bunch of dimensions, they're just like kind of on, they're different values of the same dimensions, which is like, I guess, easy to say in retrospect."}, {"time": 2819, "text": "But like, if I were an entrepreneur going after that area, I'd ask myself like, where's the opening?"}, {"time": 2825, "text": "What needs to exist because TikTok exists now?"}, {"time": 2828, "text": "So I wonder how much things that don't yet exist and can exist is in the space of algorithms, in the space of recommender systems."}, {"time": 2838, "text": "So in the space of how the feed is generated."}, {"time": 2841, "text": "So we kind of talk about the actual elements of the content, that's what we've been talking, the difference between photos, between short videos, longer videos."}, {"time": 2852, "text": "I wonder how much disruption is possible in the way the algorithms work."}, {"time": 2857, "text": "Because a lot of the criticism towards social media is in the way the algorithms work currently."}, {"time": 2861, "text": "And it feels like, first of all, talking about product market fit, there's certainly a hunger for social media algorithms that do something different."}, {"time": 2876, "text": "I don't think anyone, everyone said complaining, this is hurting me and this is hurting society, but I keep doing it because I'm addicted to it."}, {"time": 2887, "text": "And they say, we want something different, but we don't know what."}, {"time": 2891, "text": "It feels like just different."}, {"time": 2895, "text": "It feels like there's a hunger for that, but that's in the space of algorithms."}, {"time": 2899, "text": "I wonder if it's possible to disrupt in that space."}, {"time": 2902, "text": "Absolutely, I have this thesis that the worst part about social networks is that they're, is the people."}, {"time": 2913, "text": "It's a line that sounds funny, right?"}, {"time": 2916, "text": "Because like, that's why you call it a social network."}, {"time": 2919, "text": "But what does social networks actually do for you?"}, {"time": 2922, "text": "Like just think, like imagine you were an alien and you landed and someone says, hey, there's this site, it's a social network."}, {"time": 2929, "text": "We're not gonna tell you what it is, but just what does it do?"}, {"time": 2931, "text": "And you have to explain it to them."}, {"time": 2933, "text": "It does two things."}, {"time": 2934, "text": "One is that people you know and have social ties with distribute updates through whether it's photos or videos about their lives so that you don't have to physically be with them, but you can keep in touch with them."}, {"time": 2949, "text": "That's one, that's like a big part of Instagram."}, {"time": 2952, "text": "That's a big part of Snap."}, {"time": 2954, "text": "It is not part of TikTok at all."}, {"time": 2956, "text": "So there's another big part, which is there's all this content out in the world that's entertaining, whether you wanna watch it or you wanna read it."}, {"time": 2966, "text": "And matchmaking between content that exists in the world and people that want that content turns out to be like a really big business, right?"}, {"time": 2975, "text": "Search and discovery, which you?"}, {"time": 2977, "text": "Search and discovery, but my point is it could be video, it could be text, it could be websites, it could be, I mean, think back to like dig, right?"}, {"time": 2986, "text": "Or stumble upon or, right?"}, {"time": 2990, "text": "But like, what did those do?"}, {"time": 2991, "text": "Like they basically distributed interesting content to you, right?"}, {"time": 2997, "text": "I think the most interesting part or the future of social networks is going to be making them less social because I think people are part of the root cause of the problem."}, {"time": 3007, "text": "So for instance, often in recommender systems, we talk about two stages."}, {"time": 3011, "text": "There's a candidate generation step, which is just like of our vast trove of stuff that you might wanna see, what small subset should we pick for you, okay?"}, {"time": 3024, "text": "Typically that is grabbed from things your friends have shared, right?"}, {"time": 3028, "text": "Then there's a ranking step which says, okay, now given these 100, 200 things depends on the network, right?"}, {"time": 3034, "text": "Let's like be really good about ranking them and generally rank the things up higher that get the most engagement, right?"}, {"time": 3040, "text": "So what's the problem with that?"}, {"time": 3042, "text": "Step one is we've limited everything you could possibly see to things that your friends have chosen to share or maybe not friends, but influencers."}, {"time": 3052, "text": "What things do people generally want to share?"}, {"time": 3054, "text": "They wanna share things that are gonna get likes, that are gonna show up broadly."}, {"time": 3058, "text": "So they tend to be more emotionally driven."}, {"time": 3060, "text": "They tend to be more risque or whatever."}, {"time": 3063, "text": "So why do we have this problem?"}, {"time": 3065, "text": "It's because we show people things people have decided to share and those things self select to being the things that are most divisive."}, {"time": 3074, "text": "So how do you fix that?"}, {"time": 3075, "text": "Well, what if you just imagine for a second that why do you have to grab things from things your friends have shared?"}, {"time": 3083, "text": "Why not just like grab things?"}, {"time": 3087, "text": "And that's something I've been thinking a lot about."}, {"time": 3089, "text": "And just like, why is it that when you log onto Twitter, you're just sitting there looking at things from accounts that you've followed for whatever reason?"}, {"time": 3102, "text": "And TikTok I think has done a wonderful job here, which is like, you can literally be anyone."}, {"time": 3107, "text": "And if you produce something fascinating, it'll go viral."}, {"time": 3111, "text": "But like, you don't have to be someone that anyone knows."}, {"time": 3114, "text": "You don't have to have built up a giant following."}, {"time": 3117, "text": "You don't have to have paid for followers."}, {"time": 3120, "text": "You don't have to try to maintain those followers."}, {"time": 3121, "text": "You literally just have to produce something interesting."}, {"time": 3124, "text": "That is I think the future of social networking."}, {"time": 3127, "text": "That's the direction things will head."}, {"time": 3130, "text": "And I think what you'll find is it's far less about people manipulating distribution and far more about what is like, is this content good?"}, {"time": 3139, "text": "And good is obviously a vague definition that we could spend hours on."}, {"time": 3143, "text": "But different networks I think will decide different value functions to decide what is good and what isn't good."}, {"time": 3150, "text": "And I think that's a fascinating direction."}, {"time": 3152, "text": "So that's almost like creating an internet."}, {"time": 3153, "text": "I mean, that's what Google did for web pages that did page rank search."}, {"time": 3159, "text": "So it's discovery, you don't follow anybody on Google when you use a search engine."}, {"time": 3164, "text": "You just discover web pages."}, {"time": 3166, "text": "And so what TikTok does is saying, let's start from scratch."}, {"time": 3171, "text": "Let's like start a new internet and have people discover stuff on that new internet within a particular kind of pool of people."}, {"time": 3179, "text": "But what's so fascinating about this is like the field of information retrieval."}, {"time": 3185, "text": "Like I always talked about as I was studying this stuff, it was used the word query and document."}, {"time": 3190, "text": "So I was like, why are they saying query and documents?"}, {"time": 3192, "text": "Like they're literally imagine, like if you just stop thinking about query as like literally a search query and a query could be a person."}, {"time": 3200, "text": "I mean, a lot of the way, I'm not gonna claim to know how Instagram or Facebook machine learning works today, but if you want to find a match for a query, the query is actually the attributes of the person, their age, their gender, where they're from, maybe some kind of summarization of their interests."}, {"time": 3219, "text": "And that's a query, right?"}, {"time": 3221, "text": "And that matches against documents."}, {"time": 3223, "text": "And by the way, documents don't have to be texts."}, {"time": 3225, "text": "They can be videos, however long."}, {"time": 3228, "text": "I don't know what the limit is on TikTok these days."}, {"time": 3230, "text": "They keep changing it."}, {"time": 3231, "text": "My point is just, you've got a query, which is someone in search of something that they want to match and you've got the document and it doesn't have to be text."}, {"time": 3240, "text": "And how do you match make?"}, {"time": 3242, "text": "And that's one of these like, I mean, I've spent a lot of time thinking about this and I don't claim to have mastered it at all, but I think it's so fascinating about where that will go with new social networks."}, {"time": 3253, "text": "See, what I'm also fascinated by is metrics that are different than engagement."}, {"time": 3258, "text": "So the other thing from an alien perspective, what social networks are doing is they, they in the short term, bring out different aspects of each human being."}, {"time": 3270, "text": "So first, let me say that an algorithm or a social network for each individual can bring out the best of that person or the worst of that person, or there's a bunch of different parts to us, parts we're proud of that we are, parts we're not so proud of."}, {"time": 3290, "text": "When we look at the big picture of our lives, when we look back 30 days from now, am I proud that I said those things or not?"}, {"time": 3297, "text": "Am I proud that I felt those things?"}, {"time": 3299, "text": "Am I proud that I experienced or read those things or thought about those things?"}, {"time": 3304, "text": "Just in that kind of self reflected kind of way."}, {"time": 3308, "text": "And so coupled with that, I wonder if it's possible to have different metrics that are not just about engagement, but are about long term happiness, growth of a human being, where they look back and say, I am a better human being for having spent 100 hours on that app."}, {"time": 3326, "text": "And that feels like it's actually strongly correlated with engagement in the long term."}, {"time": 3333, "text": "In the short term, it may not be, but in long term, it's like the same kind of thing where you really fall in love with the product."}, {"time": 3340, "text": "You fall in love with an iPhone, you fall in love with a car."}, {"time": 3343, "text": "That's what makes you fall in love is like really being proud and just in a self reflected way, understanding that you're a better human being for having used the thing."}, {"time": 3355, "text": "And that's what great relationships are made from."}, {"time": 3358, "text": "It's not just like you're hot and we like being together or something like that."}, {"time": 3364, "text": "It's more like I'm a better human being because I'm with you."}, {"time": 3367, "text": "And that feels like a metric that could be optimized for by the algorithms."}, {"time": 3373, "text": "But anytime I kind of talk about this with anybody, they seem to say, yeah, okay, that's going to get out competed immediately by the engagement if it's ad driven especially."}, {"time": 3386, "text": "I don't, I mean, a lot of it's just implementation."}, {"time": 3390, "text": "I'll say a couple of things."}, {"time": 3391, "text": "One is to pull back the curtain on daily meetings inside of these large social media companies."}, {"time": 3400, "text": "A lot of what management, or at least the people that are tweaking these algorithms spend their time on are trade offs."}, {"time": 3407, "text": "And there's these things called value functions, which are like, okay, we can predict the probability that you'll click on this thing or the probability that you'll share it, or the probability that you will leave a comment on it or the probability you'll dwell on it."}, {"time": 3424, "text": "Individual actions, right?"}, {"time": 3427, "text": "And you've got this neural network that basically has a bunch of heads at the end and all of them are between zero and one and great."}, {"time": 3434, "text": "They all have values, right?"}, {"time": 3435, "text": "Or they all have probabilities."}, {"time": 3439, "text": "And then in these meetings, what they will do is say, well, how much do we value a comment versus a click versus a share versus a, and then maybe even some downstream thing, right?"}, {"time": 3451, "text": "That has nothing to do with the item there, but like driving follows or something."}, {"time": 3457, "text": "And what typically happens is they will say, well, what are our goals for this quarter at the company?"}, {"time": 3462, "text": "Oh, we wanna drive sharing up, okay."}, {"time": 3464, "text": "Well, let's turn down these metrics and turn up these metrics."}, {"time": 3468, "text": "And they blend them right into a single scalar which they're trying to optimize."}, {"time": 3475, "text": "That is really hard because invariably you think you're solving for, I don't know, something called meaningful interactions, right?"}, {"time": 3482, "text": "This was the big Facebook pivot."}, {"time": 3484, "text": "And I don't actually have any internal knowledge."}, {"time": 3486, "text": "Like I wasn't in those meetings, but at least from what we've seen over the last month or so, it seems by actually trying to optimize for meaningful interactions, it had all these side effects of optimizing for these other things."}, {"time": 3502, "text": "And I don't claim to fully understand them, but what I will say is that trade offs abound."}, {"time": 3508, "text": "And as much as you'd like to solve for one thing, if you have a network of over a billion people, you're gonna have unintended consequences either way."}, {"time": 3516, "text": "And it gets really hard."}, {"time": 3518, "text": "So what you're describing is effectively a value model that says like, can we capture, this is the thing that I spent a lot of time thinking about, like, can you capture utility in a way that like actually measures someone's happiness that isn't just a, what do they call it?"}, {"time": 3536, "text": "A surrogate problem where you say, well, kind of think like the more you use the product, the happier you are."}, {"time": 3543, "text": "That was always the argument at Facebook, by the way."}, {"time": 3544, "text": "It was like, well, people use it more, so they must be more happy."}, {"time": 3549, "text": "Turns out there are like a lot of things you use more that make you less happy in the world."}, {"time": 3552, "text": "Not talking about Facebook, just let's think about whether it's gambling or whatever, like that you can do more of, but doesn't necessarily make you happier."}, {"time": 3560, "text": "So the idea that time equals happiness, obviously you can't map utility and time together easily."}, {"time": 3567, "text": "There are a lot of edge cases."}, {"time": 3568, "text": "So when you look around the world and you say, well, what are all the ways we can model utility?"}, {"time": 3572, "text": "That is like one of the, please, if you know someone smart doing this, introduce me because I'm fascinated by it."}, {"time": 3578, "text": "And it seems really tough."}, {"time": 3580, "text": "But the idea that reinforcement learning, like everyone interesting I know in machine learning, like I was really interested in recommender systems and supervised learning."}, {"time": 3589, "text": "And the more I dug into it, I was like, oh, literally everyone smart is working on reinforcement learning."}, {"time": 3596, "text": "Like literally everyone."}, {"time": 3597, "text": "You just made people at OpenAI and DeepMind very happy, yes."}, {"time": 3600, "text": "But I mean, but what's interesting is like, it's one thing to train a game and like, I mean that paper where they just took Atari and they used a ConvNet to basically just like train simple actions, mind blowing, right?"}, {"time": 3615, "text": "Absolutely mind blowing, but it's a game, great."}, {"time": 3618, "text": "So now what if you're constructing a feed for a person, right?"}, {"time": 3624, "text": "Like how can you construct that feed in such a way that optimizes for a diversity of experience, a longterm happiness, right?"}, {"time": 3636, "text": "But that reward function, it turns out in reinforcement learning again, as I've learned, like reward design is really hard."}, {"time": 3645, "text": "And I don't know, like how do you design a scalar reward for someone's happiness over time?"}, {"time": 3651, "text": "I mean, do you have to measure dopamine levels?"}, {"time": 3653, "text": "Like, do you have to?"}, {"time": 3654, "text": "Well, you have to have a lot more signals from the human being."}, {"time": 3659, "text": "Currently it feels like there's not enough signals coming from the human being users of this algorithm."}, {"time": 3666, "text": "So for reinforcement learning to work well, you need to have a lot more data."}, {"time": 3670, "text": "Needs to have a lot of data."}, {"time": 3671, "text": "And that actually is a challenge for anyone who wants to start something, which is you don't have a lot of data."}, {"time": 3676, "text": "So how do you compete?"}, {"time": 3677, "text": "But I do think back to your original point, rethinking the algorithm, rethinking reward functions, rethinking utility, that's fascinating."}, {"time": 3688, "text": "And I think that's an open opportunity for a company that figures it out."}, {"time": 3694, "text": "I have to ask about April, 2012, when Instagram, along with its massive employee base of 13 people was sold to Facebook for $1 billion."}, {"time": 3708, "text": "What was the process like on a business level, engineering level, human level?"}, {"time": 3712, "text": "What was that process of selling to Facebook like?"}, {"time": 3716, "text": "So I want to provide some context, which is I worked in corporate development at Google, which not a lot of people know, but corporate development is effectively the group that buys companies, right?"}, {"time": 3726, "text": "You sit there and you acquire companies."}, {"time": 3728, "text": "And I had sat through so many of these meetings with entrepreneurs."}, {"time": 3732, "text": "We actually, fun fact, we never acquired a single company when I worked in corporate development."}, {"time": 3735, "text": "So I can't claim that I had like a lot of experience, but I had enough experience to understand, okay, like what prices are people getting and what's the process?"}, {"time": 3747, "text": "And as we started to grow, we were trying to keep this thing running and we were exhausted and we were 13 people."}, {"time": 3756, "text": "And I mean, we were trying to think back, it was probably 27, 37 now, so young on a relative basis, right?"}, {"time": 3768, "text": "And we're trying to keep the thing running."}, {"time": 3770, "text": "And then we go out to raise money and we're kind of like the hot startup at the time."}, {"time": 3777, "text": "And I remember going into a specific VC and saying, our terms we're looking for are, we're looking for a $500 million valuation."}, {"time": 3785, "text": "And I've never seen so many jaws drop all in unison, right?"}, {"time": 3790, "text": "And I was like, thanked and walked out the door very kindly after."}, {"time": 3794, "text": "And then I got a call the next day from someone who was connected to them."}, {"time": 3798, "text": "And they said, we just wanna let you know that like it was pretty offensive that you asked for a $500 million valuation."}, {"time": 3805, "text": "And I can't tell if that was like just negotiating or what, but it's true, like no one offered us more, right?"}, {"time": 3812, "text": "So we were..."}, {"time": 3813, "text": "So can you clarify the number again?"}, {"time": 3815, "text": "You said how many million?"}, {"time": 3817, "text": "500 million."}, {"time": 3818, "text": "500 million, yeah, half a billion."}, {"time": 3822, "text": "So in my mind, I'm anchored like, okay, well, literally no one's biting at 500 million."}, {"time": 3826, "text": "And eventually we would get Sequoia and Greylock and others together at 500 million, basically, post."}, {"time": 3834, "text": "It was 450 pre, I think we raised $50 million."}, {"time": 3836, "text": "But just like no one was used to seeing a $500 million companies then."}, {"time": 3841, "text": "Like, I don't know if it was because we were just coming out of the hangover of 2008 and things were still on recovery mode."}, {"time": 3850, "text": "But then along comes Facebook."}, {"time": 3853, "text": "And after some negotiation, we've two X to the number from a half a billion to a billion."}, {"time": 3861, "text": "Yeah, it seems pretty good."}, {"time": 3862, "text": "And I think Mark and I really saw eye to eye that this thing could be big."}, {"time": 3869, "text": "We thought we could... Their resources would help us scale it."}, {"time": 3872, "text": "And in a lot of ways it de risks."}, {"time": 3874, "text": "I mean, it de risks a lot of the employees lives for the rest of their lives, including me, including Mike, right?"}, {"time": 3881, "text": "I think I might've had like 10 grand in my bank account at the time, right?"}, {"time": 3884, "text": "Like we're working hard, we had nothing."}, {"time": 3888, "text": "So on a relative basis, it seems very high."}, {"time": 3891, "text": "And then I think the last company to exit for anywhere close to a billion was YouTube that I could think of."}, {"time": 3897, "text": "And thus began the giant long bull run of 2012 to all the way to where we are now, where I saw some stat yesterday about like how many unicorns exist and it's absurd."}, {"time": 3911, "text": "But then again, never underestimate technology and like the value it can provide."}, {"time": 3915, "text": "And man, costs have dropped and man scale has increased."}, {"time": 3919, "text": "And you can make businesses make a lot of money now."}, {"time": 3923, "text": "But on a fundamental level, I don't know, like how do you describe the decision to sell a company with 13 people for a billion dollars?"}, {"time": 3932, "text": "So first of all, like how did it take a lot of guts to sit at a table and say 500 million or 1 billion with Mark Zuckerberg?"}, {"time": 3941, "text": "It seems like a very large number with 13."}, {"time": 3944, "text": "Like, especially..."}, {"time": 3945, "text": "It doesn't seem, it is."}, {"time": 3948, "text": "They're all large numbers."}, {"time": 3949, "text": "Especially like you said before the unicorn parade."}, {"time": 3955, "text": "I like that, I'm gonna use that."}, {"time": 3956, "text": "The unicorn parade?"}, {"time": 3959, "text": "You were at the head of the unicorn parade."}, {"time": 3961, "text": "It's the, yeah, it's a massive unicorn parade."}, {"time": 3964, "text": "Okay, so no, I mean, we knew we were worth quote unquote a lot, but we didn't, I mean, there was no market for Instagram."}, {"time": 3974, "text": "I mean, it's not, you couldn't mark to market this thing in the public markets."}, {"time": 3978, "text": "You didn't quite understand what it would be worth or was worth at the time."}, {"time": 3983, "text": "So in a market, an illiquid market where you have one buyer and one seller and you're going back and forth, and well, I guess there were like VC firms who were willing to invest at a certain valuation."}, {"time": 3994, "text": "So I don't know, you just go with your gut."}, {"time": 3998, "text": "And at the end of the day, I would say the hardest part of it was not realizing, like when we sold, it was tough because like literally everywhere I go, restaurants, whatever, like for a good six months after, there was a lot of attention on the deal, a lot of attention on the product, a lot of attention, it was kind of miserable, right?"}, {"time": 4026, "text": "And you're like, wait, like I made a lot of money, but like, why is this not great?"}, {"time": 4030, "text": "And it's because it turns out, I don't know, like I don't really keep in touch with Mark, but I've got to assume his job right now is not exactly the most happy job in the world."}, {"time": 4039, "text": "It's really tough when you're on top and it's really tough when you're in the limelight."}, {"time": 4044, "text": "So the decision itself was like, oh, cool, this is great."}, {"time": 4047, "text": "How lucky are we, right?"}, {"time": 4049, "text": "So, okay, there's a million question I want to ask."}, {"time": 4050, "text": "Yeah, go, go, go."}, {"time": 4052, "text": "First of all, why is it hard to be on top?"}, {"time": 4057, "text": "Why did you not feel good?"}, {"time": 4059, "text": "Like, can you dig into that?"}, {"time": 4060, "text": "It always, I've heard like Olympic athletes say after they win gold, they get depressed."}, {"time": 4069, "text": "Is it something like that where it feels like it was kind of like a thing you were working towards?"}, {"time": 4077, "text": "Some loose definition of success."}, {"time": 4078, "text": "And this sure as heck feels like at least according to other startups, this is what success looks like."}, {"time": 4084, "text": "And now why don't I feel any better?"}, {"time": 4088, "text": "I'm still human, I still have all the same problems."}, {"time": 4090, "text": "Is that the nature?"}, {"time": 4091, "text": "Or is it just like negative attention of some kind?"}, {"time": 4096, "text": "But to be clear, there was a lot of happiness in terms of like, oh my God, this is great."}, {"time": 4100, "text": "Like we won the Super Bowl of startups, right?"}, {"time": 4105, "text": "Anyone who can get to a liquidity event of anything meaningful feels like, wow, this is what we started out to do."}, {"time": 4112, "text": "Of course we want to create great things that people love, but like we won in a big way."}, {"time": 4118, "text": "But yeah, there's this big like, oh, if we won, what's next?"}, {"time": 4123, "text": "So they call it the we have arrived syndrome, which I need to go back and look where I can quote that from."}, {"time": 4132, "text": "But I remember reading about it at the time."}, {"time": 4134, "text": "I was like, oh yeah, that's that."}, {"time": 4136, "text": "And I remember we had a product manager leave very early on when we got to Facebook."}, {"time": 4140, "text": "And he said to me, I just don't believe I can learn anything at this company anymore."}, {"time": 4145, "text": "It's like, it's hit its apex."}, {"time": 4148, "text": "We sold it great."}, {"time": 4149, "text": "I just don't have anything else to learn."}, {"time": 4152, "text": "So from 2012 all the way to the day I left in 2018, like the amount I learned and the humility with which I realized, oh, we thought we won."}, {"time": 4162, "text": "Billion dollars is cool, but like there are a hundred billion dollar companies."}, {"time": 4166, "text": "And by the way, on top of that, we had no revenue."}, {"time": 4169, "text": "We had, I mean, we had a cool product, but we didn't scale it yet."}, {"time": 4172, "text": "And there's so much to learn."}, {"time": 4174, "text": "And then competitors and how fun was it to fight Snapchat?"}, {"time": 4179, "text": "Like it was, it's like Yankees Red Sox."}, {"time": 4182, "text": "Like that's what you live for."}, {"time": 4186, "text": "You know, you win some, you lose some, but the amount you can learn through that process, what I've realized in life is that there is no, and there's always someone who has more, there's always more challenge, just at different scales."}, {"time": 4202, "text": "And it sounds like a little Buddhist, but everything is super challenging, whether you're like a small business or an enormous business."}, {"time": 4213, "text": "I say like choose the game you like to play, right?"}, {"time": 4217, "text": "You've got to imagine that if you're an amazing basketball player, you enjoy to some extent practicing basketball."}, {"time": 4222, "text": "It's gotta be something you love."}, {"time": 4224, "text": "It's gonna suck."}, {"time": 4224, "text": "It's gonna be hard."}, {"time": 4226, "text": "You're gonna have injuries, right?"}, {"time": 4227, "text": "But you gotta love it."}, {"time": 4228, "text": "And the same thing with Instagram, which is we might've sold, but it was like, great."}, {"time": 4235, "text": "There's one Super Bowl title."}, {"time": 4237, "text": "Can we win five?"}, {"time": 4238, "text": "What else can we do?"}, {"time": 4240, "text": "Now I imagine you didn't ask this, but okay, so I left."}, {"time": 4243, "text": "There's a little bit of like, what do you do next, right?"}, {"time": 4246, "text": "Like, how do you top that thing?"}, {"time": 4249, "text": "It's the wrong question."}, {"time": 4250, "text": "The question is like, when you wake up every day, what is the hardest, most interesting thing you can go work on?"}, {"time": 4256, "text": "Because like at the end of the day, we all turn into dirt, it doesn't matter, right?"}, {"time": 4260, "text": "But what does matter is like, can we really enjoy this life?"}, {"time": 4265, "text": "Not in a hedonistic way, because that's those, it's like the reinforcement learning, learning like short term versus long term objectives."}, {"time": 4273, "text": "Can you wake up every day and truly enjoy what you're doing knowing that it's gonna be painful?"}, {"time": 4282, "text": "Knowing that like, no matter what you choose, it's gonna be painful."}, {"time": 4285, "text": "Whether you sit on a beach or whether you manage a thousand people or 10,000, it's gonna be painful."}, {"time": 4291, "text": "So choose something that's fun to have pain."}, {"time": 4295, "text": "But yes, there was a lot of, we have arrived and it's a maturation process you just have to go through."}, {"time": 4304, "text": "So no matter how much success there is, how much money you make, you have to wake up the next day and choose the hard life, whatever that means next, that's fun."}, {"time": 4313, "text": "The fun slash hard life, hard life that's fun."}, {"time": 4316, "text": "I guess what I'm trying to say is slightly different, which is just that no one realizes everything's gonna be hard."}, {"time": 4325, "text": "Even chilling out is hard."}, {"time": 4327, "text": "And then you just start worrying about stupid stuff."}, {"time": 4329, "text": "Like, I don't know, like did so and so forget to paint the house today or like did the gardener come or whatever?"}, {"time": 4336, "text": "Like, or, oh, I'm so angry and my shipment of wine didn't show up and I'm sitting here on the beach without my wine."}, {"time": 4342, "text": "I don't know, I'm making shit up now, but like."}, {"time": 4344, "text": "It turns out that even chilling, AKA meditation, is hard work."}, {"time": 4347, "text": "Yeah, and at least meditation is like productive chilling where you're like actually training yourself to calm down and be, but backing up for a moment, everything's hard."}, {"time": 4357, "text": "You might as well be like playing the game you love to play."}, {"time": 4361, "text": "I just like playing and winning and I'm on the, I'm still on the, I think the first half of life, knock on wood, and I've got a lot of years and what am I gonna do, sit around?"}, {"time": 4374, "text": "And the other way of looking at this, by the way, imagine you made one movie and it was great."}, {"time": 4382, "text": "Would you just like stop making movies?"}, {"time": 4385, "text": "No, generally you're like, wow, I really like making movies, let's make another one."}, {"time": 4389, "text": "A lot of times, by the way, the second one or the third one, not that great, but the fourth one, awesome."}, {"time": 4393, "text": "And no one forgets the second, or everyone forgets the second and the third one."}, {"time": 4397, "text": "So there's just this constant process of like, can I produce and is that fun?"}, {"time": 4403, "text": "Is that exciting?"}, {"time": 4404, "text": "What else can I learn?"}, {"time": 4405, "text": "So this machine learning stuff for me has been this awesome new chapter of being like, man, that's something I didn't understand at all."}, {"time": 4413, "text": "And now I feel like I'm one 10th of the way there."}, {"time": 4417, "text": "And that feels like a big mountain to climb."}, {"time": 4420, "text": "So I distracted us from the original question."}, {"time": 4422, "text": "No, and we'll return to the machine learning cause I'd love to explore your interest there."}, {"time": 4426, "text": "But I mean, speaking of sort of challenges and hard things, is there a possible world where sitting in a room with Mark Zuckerberg with a $1 billion deal, you turn it down?"}, {"time": 4441, "text": "What does that world look like?"}, {"time": 4443, "text": "Why would you turn it down?"}, {"time": 4444, "text": "Why did you take it?"}, {"time": 4445, "text": "What was the calculation that you were making?"}, {"time": 4448, "text": "Thus enters the world of counterfactuals and not really knowing."}, {"time": 4453, "text": "And if only we could run that experiment."}, {"time": 4455, "text": "Well, the universe exists, it's just running in parallel to our own."}, {"time": 4458, "text": "Yeah, it's so fascinating, right?"}, {"time": 4463, "text": "I mean, we're talking a lot about money, but the real question was, I'm not sure you'll believe me when I say this, but could we strap our little company onto the side of a rocket ship and like get out to a lot of people really, really quickly with the support, with the talent of a place like Facebook?"}, {"time": 4485, "text": "I mean, people often ask me what I would do differently at Instagram today."}, {"time": 4489, "text": "And I say, well, I'd probably hire more carefully because we showed up just like before I knew it, we had like a hundred people on the team and 200, then 300."}, {"time": 4497, "text": "I don't know where all these people were coming from."}, {"time": 4499, "text": "I never had to recruit them."}, {"time": 4500, "text": "I never had to screen them."}, {"time": 4502, "text": "They were just like internal transfers, right?"}, {"time": 4505, "text": "So it's like relying on the Facebook hiring machine, which is quite sort of, I mean, it's an elaborate machine."}, {"time": 4511, "text": "It's great, by the way."}, {"time": 4512, "text": "They have really talented people there."}, {"time": 4515, "text": "But my point is the choice was like, take this thing, put it on the side of a rocket ship that you know is growing very quickly."}, {"time": 4525, "text": "Like I had seen what had happened when Ev sold Blogger to Google and then Google went public."}, {"time": 4530, "text": "Remember we sold before Facebook went public."}, {"time": 4534, "text": "There was a moment at which the stock price was $17, by the way, Facebook stock price was $17."}, {"time": 4540, "text": "I remember thinking, what the fuck did I just do, right?"}, {"time": 4543, "text": "Now at 320 ish, I don't know where we are today."}, {"time": 4548, "text": "But like, okay, like the best thing by the way is like when the stock is down, everyone calls you a dope."}, {"time": 4556, "text": "And then when it's up, they also call you a dope, but just for a different reason, right?"}, {"time": 4561, "text": "Like you can't win."}, {"time": 4562, "text": "Less than in there somewhere."}, {"time": 4564, "text": "So, but you know, the choice is to strap yourself to a rocket ship or to build your own."}, {"time": 4568, "text": "You know, Mr. Elon built his own literally with a rocket ship."}, {"time": 4573, "text": "That's a difficult choice because there's a world."}, {"time": 4578, "text": "Actually, I would say something different, which is Elon and others decided to sell PayPal for not that much."}, {"time": 4585, "text": "I mean, how much was it about a billion dollars?"}, {"time": 4588, "text": "I mean, it was early and, but it's worth a lot more now."}, {"time": 4591, "text": "To then build a new rocket ship."}, {"time": 4593, "text": "So this is the cool part, right?"}, {"time": 4594, "text": "If you are an entrepreneur and you own a controlling stake in the company, not only is it really hard to do something else with your life because all of the, you know, value is tied up in you as a personality attached to this company, right?"}, {"time": 4610, "text": "But if you sell it and you're getting yourself enough capital and you like have enough energy, you can do another thing or 10 other things or in Elon's case, like a bunch of other things."}, {"time": 4620, "text": "I don't know, like I lost count at this point."}, {"time": 4623, "text": "And it might've seemed silly at the time."}, {"time": 4625, "text": "And sure, like if you look back, man, PayPal is worth a lot now, right?"}, {"time": 4631, "text": "Like, do you think Elon like cares about like, are we gonna buy Pinterest or not?"}, {"time": 4635, "text": "Like, I just, he is, he created a massive capital that allowed him to do what he wants to do."}, {"time": 4644, "text": "That's more freeing than anything because when you are an entrepreneur attached to a company, you gotta stay at that company for a really long time."}, {"time": 4650, "text": "It's really hard to remove yourself."}, {"time": 4652, "text": "But I'm not sure how much he loved PayPal versus SpaceX and Tesla."}, {"time": 4657, "text": "I have a sense that you love Instagram."}, {"time": 4661, "text": "Yeah, I loved enough to like work for six years beyond the deal."}, {"time": 4664, "text": "Which is rare, which is very rare."}, {"time": 4666, "text": "You chose."}, {"time": 4667, "text": "But can I tell you why?"}, {"time": 4669, "text": "It's, please."}, {"time": 4671, "text": "There are not a lot of companies that you can be part of where the Pope's like, I would like to sign up for your product."}, {"time": 4679, "text": "Like I'm not a religious person at all."}, {"time": 4683, "text": "You go to the Vatican and you're like walking among giant columns and you're hearing the music and everything and like the Pope walks in and he wants to press the signup button on your product."}, {"time": 4692, "text": "Like it's a moment in life, okay?"}, {"time": 4695, "text": "No matter what your persuasion, okay?"}, {"time": 4699, "text": "The number of doors and experiences that that opened up was, it was incredible."}, {"time": 4703, "text": "I mean, the people I got to meet, the places I got to go, I assume maybe like a payments company is slightly different, right?"}, {"time": 4712, "text": "But that's why, like it was so fun."}, {"time": 4714, "text": "And plus I truly believed we were building such a great product and I loved, loved the game."}, {"time": 4720, "text": "It wasn't about money."}, {"time": 4721, "text": "It was about the game."}, {"time": 4723, "text": "Do you think you had the guts to say no?"}, {"time": 4726, "text": "Is that, so here's, I often think about this, like how hard is it for an entrepreneur to say no?"}, {"time": 4732, "text": "Because the peer pressure."}, {"time": 4734, "text": "So every, like basically the sea of entrepreneurs in Silicon Valley are gonna tell you, I mean, this is their dream."}, {"time": 4741, "text": "The thing you were sitting before is a dream."}, {"time": 4745, "text": "To walk away from that is really, it seems like nearly impossible."}, {"time": 4751, "text": "Because Instagram could in 10 years be, you could talk about Google."}, {"time": 4757, "text": "You could be making self driving cars and building rockets that go to Mars and compete with SpaceX."}, {"time": 4764, "text": "And so that's an interesting decision to say, am I willing to risk it?"}, {"time": 4771, "text": "And the reason I also say it's an interesting decision because it feels like per our previous discussion, if you're launching a social network company, there's going to be that meeting, whatever that number is."}, {"time": 4785, "text": "If you're successful, if you're on this rocket ship of success, there's going to be a meeting with one of the social media, social network companies that wanna buy you, whether it's Facebook or Twitter, but it could also very well be Google who seems to have like a graveyard of failed social networks."}, {"time": 4806, "text": "And it's, I mean, I don't know."}, {"time": 4808, "text": "I think about that, how difficult it is for an entrepreneur to make that decision."}, {"time": 4813, "text": "How many have successfully made that decision?"}, {"time": 4815, "text": "I guess, this is a big question."}, {"time": 4818, "text": "It's sad to me, to be honest, that too many make that decision, perhaps for the wrong reason."}, {"time": 4823, "text": "Sorry, when you say make the decision, you mean to the affirmative."}, {"time": 4826, "text": "To the affirmative, yeah."}, {"time": 4827, "text": "Got it, yeah."}, {"time": 4828, "text": "There are also companies that don't sell, right?"}, {"time": 4831, "text": "And take the PATH and say, we're gonna be independent."}, {"time": 4834, "text": "And then you've never heard of them again."}, {"time": 4837, "text": "Like I remember PATH, right?"}, {"time": 4840, "text": "Was one of our competitors early on."}, {"time": 4843, "text": "There was a big moment when they had, I can't remember what it was, like $110 million offer from Google or something."}, {"time": 4850, "text": "It might've been larger, I don't know."}, {"time": 4854, "text": "And I remember there was like this big TechCrunch article that was like, they turned it down after talking deeply about their values and everything."}, {"time": 4861, "text": "And I don't know the inner workings of Foursquare, but I'm certain there were many conversations over time where there were companies that wanted Foursquare as well."}, {"time": 4871, "text": "Recently, I mean, what other companies?"}, {"time": 4875, "text": "There's Clubhouse, right?"}, {"time": 4877, "text": "Maybe people were really interested in them too."}, {"time": 4880, "text": "Like there are plenty of moments where people say no and we just forget that those things happen."}, {"time": 4888, "text": "We only focus on the ones where like they said yes and like, wow, like what if they had stayed independent?"}, {"time": 4897, "text": "I used to think a lot about this and now I just don't because I'm like, whatever."}, {"time": 4902, "text": "Things have gone pretty well."}, {"time": 4904, "text": "I'm ready for the next game."}, {"time": 4905, "text": "I mean, think about an athlete where, I don't know, maybe they do something wrong in the World Series or whatever."}, {"time": 4914, "text": "If you let it haunt you for the rest of your career, like why not just be like, I don't know, it was a game."}, {"time": 4920, "text": "Next game, next shot, right?"}, {"time": 4922, "text": "And if you just move to that world, like at least I have a next shot, right?"}, {"time": 4927, "text": "No, that's beautiful, but I mean, just insights and it's funny you brought up Clubhouse."}, {"time": 4932, "text": "It is very true."}, {"time": 4934, "text": "It seems like Clubhouse is on the downward path and it's very possible to see a billion plus dollar deal at some stage, maybe like a year ago or half a year ago from Facebook, from Google."}, {"time": 4948, "text": "I think Facebook was flirting with that idea too."}, {"time": 4950, "text": "And I think a lot of companies probably were."}, {"time": 4954, "text": "I wish it was more public."}, {"time": 4957, "text": "There's not like a bad public story about them making the decision to walk away."}, {"time": 4963, "text": "We just don't hear about it."}, {"time": 4965, "text": "And then we get to see the results of that success or the failure, more often failure."}, {"time": 4969, "text": "So a couple of things, one is, I would not assume Clubhouse is down for the count at all."}, {"time": 4974, "text": "They're young, they have plenty of money, they're run by really smart people."}, {"time": 4979, "text": "I'd give them like a very fighting chance to figure it out."}, {"time": 4982, "text": "There are a lot of times when people call Twitter down for the count and they figure it out and they seem to be doing well, right?"}, {"time": 4988, "text": "So just backing up like, and not knowing anything about their internals, like there's a strong chance they will figure it out and that people are just down because they like being down about companies."}, {"time": 4998, "text": "They like assuming that they're gonna fail."}, {"time": 5000, "text": "So who knows, right?"}, {"time": 5001, "text": "But let's take the ones in the past where like we know how it played out."}, {"time": 5004, "text": "There are plenty of examples where people have turned down big offers and then you've just never heard from them again, but we never focus on the companies because you just forget that those were big."}, {"time": 5014, "text": "But inside your psyche, I think it's easy for someone with enough money to say money doesn't matter, which I think is like, it's bullshit."}, {"time": 5025, "text": "Of course, money matters to people, but at the moment, you just can't even grasp like the number of zeros that you're talking about."}, {"time": 5033, "text": "It just doesn't make sense, right?"}, {"time": 5036, "text": "So to think rationally in that moment is not something many people are equipped to do, especially not people where I think we had founded the company a year earlier, maybe two years earlier, like a year and a half, we were 13 people, but I will say, I still don't know if it was the right decision because I don't have that counterfactual."}, {"time": 5056, "text": "I don't know that other world."}, {"time": 5058, "text": "I'm just thankful that by and large, most people love Instagram, still do."}, {"time": 5063, "text": "By and large, people are very happy with like the time we had there and I'm proud of what we built."}, {"time": 5069, "text": "So like, I'm cool."}, {"time": 5071, "text": "Like now it's next shot, right?"}, {"time": 5075, "text": "Well, if we could just linger on this Yankees versus Red Sox, the fun of it, the competition over, I would say over the space of features."}, {"time": 5085, "text": "So there are a bunch of features, like there's photos, there's one minute videos on Instagram, there's IGTV, there's stories, there's reels, there's live."}, {"time": 5098, "text": "So that sounds like it's like a long list of too much stuff, but it's not because it feels like they're close together, but they're somehow, like what we're saying, fundamentally distinct, like each of the things I mentioned."}, {"time": 5113, "text": "Maybe can you describe the philosophies, the design philosophies behind some of these, how you were thinking about it during the historic war between Snapchat and Instagram or just in general, like this space of features that was discovered."}, {"time": 5130, "text": "There's this great book by Clay Christensen called, Competing Against Luck."}, {"time": 5136, "text": "It's like a terrible title, but within it, there's effectively an expression of this thing called jobs to be done theory."}, {"time": 5146, "text": "And it's unclear if like he came up with it or some of his colleagues, but there are a bunch of places you can find with people claiming to have come up with this jobs to be done theory."}, {"time": 5155, "text": "But the idea is if you like zoom out and you look at your product, you ask yourself, why are people hiring your product?"}, {"time": 5164, "text": "Like imagine every product in your life is effectively an employee, you know, you're CEO of your life and you hire products to be employees effectively."}, {"time": 5173, "text": "They all have roles and jobs, right?"}, {"time": 5176, "text": "Why are you hiring a product?"}, {"time": 5178, "text": "Why do you want that product to perform something in your life?"}, {"time": 5181, "text": "And like, what are the hidden reasons why you're in love with this product?"}, {"time": 5186, "text": "Instagram was about sharing your life with others visually, period, right?"}, {"time": 5191, "text": "Because you feel connected with them."}, {"time": 5194, "text": "You get to show off."}, {"time": 5195, "text": "You get to feel good and cared about, right?"}, {"time": 5198, "text": "With likes and it turns out that that will, I think forever define Instagram and any product that serves that job is going to do very well, okay?"}, {"time": 5212, "text": "Stories let's take as an example is very much serving that job."}, {"time": 5218, "text": "In fact, it serves it better than the original product because when you're large and have an enormous audience, you're worried about people seeing your stuff or you're worried about being permanent so that a college admissions person is going to see your photo of you doing something."}, {"time": 5233, "text": "And so it turns out that that is a more efficient way of performing that job than the original product was."}, {"time": 5239, "text": "The original product still has its value, but at scale, these two things together work really, really well."}, {"time": 5246, "text": "Now, I will claim that other parts of the product over time didn't perform that job as well."}, {"time": 5252, "text": "I think IGTV probably didn't, right?"}, {"time": 5255, "text": "Shopping is like completely unrelated to what I just described, but it might work."}, {"time": 5263, "text": "Products I think, products that succeed are products that all share this parent node of like this job to be done that is in common."}, {"time": 5272, "text": "And then they're just like different ways of doing it, right?"}, {"time": 5275, "text": "Apple, I think does a great job with this, right?"}, {"time": 5277, "text": "It's like managing your digital life and all the products just work together."}, {"time": 5281, "text": "They sync, they're like, it's beautiful, right?"}, {"time": 5286, "text": "Even if they require like silly specific cords to work, but they're all part of a system."}, {"time": 5292, "text": "It's when you leave that system and you start doing something weird that people start scratching their head and I think you are less successful."}, {"time": 5299, "text": "So I think one of the challenges Facebook has had throughout its life is that it has never fully, I think, appreciated the job to be done of the main product."}, {"time": 5308, "text": "And what it's done is said, ooh, there's a shiny object over there."}, {"time": 5311, "text": "That startup's getting some traction."}, {"time": 5312, "text": "Let's go copy that thing."}, {"time": 5314, "text": "And then they're confused why it doesn't work."}, {"time": 5316, "text": "Like why doesn't it work?"}, {"time": 5317, "text": "It's because the people who show up for this don't want that, it's different."}, {"time": 5322, "text": "What's the purpose of Facebook?"}, {"time": 5324, "text": "So I remember I was a very early Facebook user."}, {"time": 5327, "text": "The reason I was personally excited about Facebook is because you can, first of all, use your real name."}, {"time": 5335, "text": "Like I can exist in this world."}, {"time": 5338, "text": "It can be like formally exist."}, {"time": 5340, "text": "I like anonymity for certain things, Reddit and so on, but I want it to also exist not anonymously so that I can connect with other friends of mine nonanonymously and there's a reliable way to know that I'm real and they're real and that we're connecting."}, {"time": 5359, "text": "And it's kind of like, I liked it for the reasons that people like LinkedIn, I guess."}, {"time": 5367, "text": "But like without the form, like not everybody is dressed up and being super polite, like more like with friends."}, {"time": 5374, "text": "But then it became something much bigger than that, I suppose, there's a feed."}, {"time": 5379, "text": "It became this, I mean, it became a place to discover content, to share content that's not just about connecting directly with friends."}, {"time": 5393, "text": "I mean, it became something else."}, {"time": 5394, "text": "I don't even know what it is really."}, {"time": 5396, "text": "So you said Instagram is a place where you visually share your life."}, {"time": 5402, "text": "What is Facebook?"}, {"time": 5403, "text": "Well, let's go back to the founding of Facebook and why it worked really well initially at Harvard and then Dartmouth and Stanford and I can't remember, probably MIT, there were like a handful of schools in that first tranche, right?"}, {"time": 5417, "text": "It worked because there are communities that exist in the world that want to transact."}, {"time": 5423, "text": "And when I say transact, I don't mean commercially, I just mean they want to share, they want to coordinate, they want to communicate, they want a space for themselves."}, {"time": 5432, "text": "And Facebook at its best, I think is that."}, {"time": 5436, "text": "And if actually you look at the most popular products that Facebook has built over time, if you look at things like groups, marketplace, groups is enormous."}, {"time": 5447, "text": "And groups is effectively like everyone can found their own little Stanford or Dartmouth or MIT, right?"}, {"time": 5453, "text": "And find each other and share and communicate about something that matters deeply to them."}, {"time": 5460, "text": "That is the core of what Facebook was built around."}, {"time": 5463, "text": "And I think today is where it stands most strongly."}, {"time": 5469, "text": "Yeah, it's brilliant."}, {"time": 5469, "text": "The groups, I wish groups were done better."}, {"time": 5473, "text": "It feels like it's not a first class citizen."}, {"time": 5476, "text": "I know I may be saying something without much knowledge, but it feels like it's kind of bolted on while being used a lot."}, {"time": 5486, "text": "It feels like there needs to be a little bit more structure in terms of discovery, in terms of like."}, {"time": 5492, "text": "I mean, look at Reddit."}, {"time": 5493, "text": "Like Reddit is basically groups of public and open and a little bit crazy, right?"}, {"time": 5498, "text": "In a good way."}, {"time": 5500, "text": "But there's clear product market fit for that specific use case."}, {"time": 5504, "text": "And it doesn't have to be a college, it can be anything."}, {"time": 5507, "text": "It can be a small group, a big group, it can be group messaging."}, {"time": 5510, "text": "Facebook shines, I think, when it leans into that."}, {"time": 5513, "text": "I think when there are other companies that just seem exciting and now all of a sudden the product shifts in some fundamental way to go try to compete with that other thing, that's when I think consumers get confused."}, {"time": 5529, "text": "Even if you can be successful, like even if you can compete with that other company, even if you can figure out how to bolt it on, eventually you come back and you look at the app and you're like, I just don't know why I opened this app."}, {"time": 5540, "text": "Like why, like too many things going on."}, {"time": 5543, "text": "And that was always a worry."}, {"time": 5544, "text": "I mean, you listed all the things at Instagram and it almost gave me a heart attack, like way too many things."}, {"time": 5550, "text": "But I don't know, entrepreneurs get bored."}, {"time": 5551, "text": "They want to add things."}, {"time": 5552, "text": "They want to like, right?"}, {"time": 5555, "text": "I don't have a good answer for it, except for that I think being true to your original use case and not even original use case, but sorry, actually not use case, original job."}, {"time": 5566, "text": "There are many use cases under that job."}, {"time": 5569, "text": "Being true to that and like being really good at it over time and morphing as needs change, I think that's how to make a company last forever."}, {"time": 5579, "text": "And I mean, honestly, like my main thesis about why Facebook is in the position it is today is if they have had a series of product launches that delighted people over time, I think they'd be in a totally different world."}, {"time": 5597, "text": "So just like imagine for a moment, and by the way, Apple's entering this, but like Apple for so long, just like product after product, you couldn't wait for it."}, {"time": 5606, "text": "You stood in line for it."}, {"time": 5607, "text": "You talked about it."}, {"time": 5608, "text": "You got excited."}, {"time": 5609, "text": "Amazon makes your life so easy."}, {"time": 5611, "text": "It's like, wow, I needed this thing and it showed up at my door two days later."}, {"time": 5616, "text": "And like both of these companies, by the way, Amazon, Apple have issues, right?"}, {"time": 5621, "text": "There are labor issues, whether it's here in the US or in China, there are environmental issues."}, {"time": 5628, "text": "But like when's the last time you heard like a large chorus being like, these companies better pay for what they're doing on these things, right?"}, {"time": 5636, "text": "I think Facebook's main issue today is like, you need to produce a hit."}, {"time": 5641, "text": "If you don't produce hits, it's really hard to keep consumers on your side."}, {"time": 5646, "text": "Then people just start picking on you for a variety of reasons, whether it's right or wrong."}, {"time": 5651, "text": "I'm not even going to place a judgment right here and right now."}, {"time": 5653, "text": "I'm just going to say that it is way better to be in a world where you are producing hits and consumers love what you're doing because then they're on your side."}, {"time": 5663, "text": "And I think that's, it's the past 10 years for Facebook has been fairly hard on this dimension."}, {"time": 5669, "text": "So, and by hits, it doesn't necessarily mean financial hits."}, {"time": 5673, "text": "It feels like to me, what you're saying is something that brings joy."}, {"time": 5677, "text": "A product that brings joy to some fraction of the population."}, {"time": 5680, "text": "Yeah, I mean, TikTok isn't just literally an algorithm."}, {"time": 5685, "text": "In some ways, TikTok's content and algorithm have more sway now over the American psyche than Facebook's algorithm, right?"}, {"time": 5694, "text": "It's visual, it's video."}, {"time": 5697, "text": "By the way, it's not defined by who you follow."}, {"time": 5699, "text": "It's defined by some magical thing that, by the way, if someone wanted to tweak to show you a certain type of content for some reason, they could, right, but people love it."}, {"time": 5710, "text": "So as a CEO, let me ask you a question because leadership matters."}, {"time": 5717, "text": "This is a complicated question."}, {"time": 5719, "text": "Why is Mark Zuckerberg distrusted, disliked and sometimes even hated by many people in public?"}, {"time": 5728, "text": "Right, that is a complicated question."}, {"time": 5730, "text": "Well, the premise, I'm not sure I agree with the premise."}, {"time": 5734, "text": "And I can expand that to include even a more mysterious question for me, Bill Gates."}, {"time": 5744, "text": "What is the Bill Gates version of the question?"}, {"time": 5747, "text": "Do you think people hate Bill Gates?"}, {"time": 5749, "text": "No, distrust."}, {"time": 5752, "text": "So takeaway one, it's a checklist."}, {"time": 5756, "text": "There is, I think Mark Zuckerberg's distrust is the primary one, but there's also like a dislike, maybe hate is too strong a word, but it's just if you look at like the articles that are being written and so on, there's a dislike."}, {"time": 5773, "text": "And it makes, it's confusing to me because it's like the public picks certain individuals and they attach certain kinds of emotions to those individuals."}, {"time": 5815, "text": "And in today's world, we have issues with enormous wealth and power for a variety of reasons."}, {"time": 5822, "text": "One of which is we've been stuck inside for a year and a half, two years."}, {"time": 5827, "text": "One of which is a lot of people were really unhappy about not the last election, but the last, last election."}, {"time": 5833, "text": "And where do you take out that anger?"}, {"time": 5835, "text": "Who do you blame but the people in charge?"}, {"time": 5838, "text": "That's one example or one reason why I think a lot of people express anger or resentment or unhappiness with Mark."}, {"time": 5849, "text": "At the same time, I don't know, I pointed out to that person, I was like, well, I don't know, I think a lot of people really like Elon."}, {"time": 5858, "text": "Elon arguably, he kept his factory open here throughout COVID protocols, which arguably a lot of people would be against."}, {"time": 5867, "text": "While saying a bunch of crazy offensive things on the internet, they still."}, {"time": 5872, "text": "And basically gives the middle finger to the SEC on Twitter and I don't know, I'm like, well, there's a founder and like people kind of like him."}, {"time": 5882, "text": "So I do think that the founder and slash CEO of a company that's a social network company is like an extra level of difficulty."}, {"time": 5893, "text": "If life is a video game, you just chose the harder video game."}, {"time": 5897, "text": "So, I mean, that's why it's interesting to ask you because you were the founder and CEO of a social network."}, {"time": 5904, "text": "I challenge it because."}, {"time": 5905, "text": "Exactly, but you're one of the rare examples."}, {"time": 5910, "text": "Even Jack Dorsey's disliked, not to the degree, but it just seems harder when you're running a social media company."}, {"time": 5919, "text": "I never thought of Jack as just like, I think generally he's well respected."}, {"time": 5925, "text": "I think you're right, but he's not loved."}, {"time": 5931, "text": "And I feel like you, I mean, to me, Twitter is an incredible thing."}, {"time": 5934, "text": "Yeah, again, can I just come back to this point, which seems over simplistic, but I really do think how a product makes someone feel, they ascribe that feeling to the founder."}, {"time": 5949, "text": "So make people feel good."}, {"time": 5951, "text": "So think about it."}, {"time": 5953, "text": "Let's just go with this thesis for a second."}, {"time": 5954, "text": "Sure, I like it though."}, {"time": 5957, "text": "Amazon's pretty utilitarian, right?"}, {"time": 5959, "text": "It delivers brown boxes to your front door."}, {"time": 5961, "text": "Sure, you can have Alexa and you can have all these things, right?"}, {"time": 5965, "text": "But in general, it delivers stuff quickly to you at a reasonable price, right?"}, {"time": 5971, "text": "I think Jeff Bezos is wonderfully wealthy, thoughtful, smart guy, right?"}, {"time": 5976, "text": "But people kind of feel that way about him."}, {"time": 5978, "text": "They're like, wow, this is really big."}, {"time": 5980, "text": "We're impressed that this is really big."}, {"time": 5982, "text": "But he's doing the same space stuff Elon's doing, but they don't necessarily ascribe the same sense of wonder, right?"}, {"time": 5990, "text": "Now let's take Elon."}, {"time": 5991, "text": "And again, this is pet theory."}, {"time": 5992, "text": "I don't have much proof other than my own intuition."}, {"time": 5996, "text": "He is literally about living the future."}, {"time": 5999, "text": "Mars, it's about wonder."}, {"time": 6001, "text": "It's about going back to that feeling as a kid when you looked up to the stars and asked, is there life out there?"}, {"time": 6008, "text": "People get behind that because it's a sense of hope and excitement and innovation."}, {"time": 6013, "text": "And like, you can say whatever you want, but we ascribe that emotion to that person."}, {"time": 6018, "text": "Now, let's say you're on a social network and people make you kind of angry because they disagree with you or they say something ridiculous or they're living a FOMO type life where you're like, wow, I wish I was doing that thing."}, {"time": 6031, "text": "I think Instagram, if I were to think back, by and large, when I was there, was not about FOMO, was not about this influencer economy, although it certainly became that way closer to the end."}, {"time": 6043, "text": "It was about the sense of wonder and happiness and beautiful things in the world."}, {"time": 6047, "text": "And I don't know, I mean, like, I don't want to have a blind spot, but I don't think anyone had a strong opinion about me one way or the other."}, {"time": 6053, "text": "For the longest time, the way people explained to me, I mean, if you want to go for toxicity, you go to Facebook or Twitter."}, {"time": 6059, "text": "If you want to go to feel good about life, you go to Instagram to enjoy, celebrate life."}, {"time": 6064, "text": "And my experience been talking to people is they gave me the benefit of the doubt because of that."}, {"time": 6068, "text": "But if your experience of the product is kind of makes you angry, it's where you argue."}, {"time": 6073, "text": "I mean, a big part of Jack might be that he wasn't actually the CEO for a very long time and only became recently."}, {"time": 6079, "text": "So I'm not sure how much of the connection got made."}, {"time": 6083, "text": "But in general, I mean, if you hate, I'm just thinking about other companies that aren't tech companies."}, {"time": 6090, "text": "If you hate like what a company is doing or it makes you not feel happy."}, {"time": 6096, "text": "I don't know, like people are really angry about Comcast or whatever."}, {"time": 6099, "text": "Are they even called Comcast anymore?"}, {"time": 6100, "text": "It's like Xfinity or something, right?"}, {"time": 6102, "text": "They had to rebrand."}, {"time": 6103, "text": "They became meta, right?"}, {"time": 6104, "text": "And it's like, but my point is if it makes you angry."}, {"time": 6108, "text": "That's beautiful, yeah."}, {"time": 6110, "text": "But the thing is, this is me saying this."}, {"time": 6114, "text": "I think your thesis is very strong and correct, has elements of correctness, but I still personally put some blame on individuals."}, {"time": 6126, "text": "I think you said, Elon, looking up, there's something about Childlike Wander to him, like to his personality, his character, something about, I think more so than others where people can trust them."}, {"time": 6141, "text": "And there's, I don't know, Sondra Prachai is an example of somebody who's like, there's some kind, it's hard to put into words, but there's something about the human being where he's trustworthy."}, {"time": 6154, "text": "He's human in a way that connects to us."}, {"time": 6158, "text": "And the same with Sajid Nadella."}, {"time": 6160, "text": "I mean, some of these folks, something about us is drawn to them, even when they're flawed."}, {"time": 6168, "text": "Even like, so your thesis really holds up for Steve Jobs because I think people didn't like Steve Jobs, but he delivered products and then they fell in love every time."}, {"time": 6181, "text": "I guess you could say that the CEO, the leader is also a product."}, {"time": 6185, "text": "And if they keep delivering a product that people like by being in public and saying things that people like, that's also a way to make people happy."}, {"time": 6194, "text": "But from a social network perspective, it makes me wonder how difficult it is to explain to people why certain things happen, like to explain machine learning, to explain why certain, the woke mob effect happens or the certain kinds of like bullying happens, which is like, it's human nature combined with algorithm."}, {"time": 6220, "text": "And it's very difficult to control for how the spread of quote unquote misinformation happens."}, {"time": 6225, "text": "It's very difficult to control for that."}, {"time": 6227, "text": "And so you try to decelerate certain parts and you create more problems than you solve."}, {"time": 6233, "text": "And anything that looks at all like censorship can create huge amounts of problems as a slippery slope."}, {"time": 6238, "text": "And then you have to inject humans to oversee the machine learning algorithms."}, {"time": 6243, "text": "And anytime you inject humans into the system, it's gonna create a huge number of problems."}, {"time": 6247, "text": "And I feel like it's up to the leader to communicate that effectively, to be transparent."}, {"time": 6252, "text": "First of all, design products that don't have those problems."}, {"time": 6255, "text": "And second of all, when they have those problems, to be able to communicate with them."}, {"time": 6259, "text": "I guess that's all going to, when you run a social network company, your job is hard."}, {"time": 6265, "text": "Yeah, I will say the one element that you haven't named that I think you're getting at is just bedside manner, which Steve Jobs, I never worked for him."}, {"time": 6275, "text": "I never met him in person."}, {"time": 6278, "text": "Had an uncanny ability in public to have bedside manner."}, {"time": 6283, "text": "I mean, some of the best clips of Steve Jobs from like, I would say maybe the 80s when he's on the stage and getting questions from the audience about life."}, {"time": 6294, "text": "And he'll take this question that is like, how are you gonna compete with blah?"}, {"time": 6298, "text": "And it's super boring."}, {"time": 6299, "text": "And I don't even know the name of the company."}, {"time": 6301, "text": "And his answer is as if you just asked your grandfather, the meaning of life."}, {"time": 6307, "text": "And you sit there and you're just like, what?"}, {"time": 6310, "text": "And there's that bedside manner."}, {"time": 6313, "text": "And if you lack that, or if that's just not intuitive to you, I think that it can be a lot harder to gain the trust of people."}, {"time": 6321, "text": "And then add on top of that, missteps of companies."}, {"time": 6327, "text": "I don't know if you have any friends from the past where maybe they crossed you once, or maybe you get back together and you're friends again, but you just never really forget that thing."}, {"time": 6336, "text": "It's human nature not to forget."}, {"time": 6338, "text": "I'm Russian, you crossed me once."}, {"time": 6341, "text": "We solved the problem."}, {"time": 6343, "text": "So my point is, humans don't forget."}, {"time": 6348, "text": "And if there are times in the past where they feel like they don't trust the company or the company hasn't had their back, that is really hard to earn back, especially if you don't have that bedside manner."}, {"time": 6360, "text": "And again, I'm not attributing this specifically to Marc because I think a lot of the companies have this issue where one, you have to be trustworthy as a company and live by it and live by those actions."}, {"time": 6372, "text": "And then two, I think you need to be able to be really relatable in a way that's very difficult if you're worth what these people are."}, {"time": 6383, "text": "Jack does a pretty good job of this by being a monk."}, {"time": 6387, "text": "But I also, Jack issues attention."}, {"time": 6389, "text": "He's not out there almost on purpose."}, {"time": 6392, "text": "He's just working hard, doing square, right?"}, {"time": 6395, "text": "I literally shared a desk like this with him at Odeo."}, {"time": 6398, "text": "I mean, this normal guy who likes painting, I remember he would leave early on Wednesdays or something to go to a painting class."}, {"time": 6407, "text": "And he's creative, he's thoughtful."}, {"time": 6409, "text": "I mean, money makes people more creative and more thoughtful, extreme versions of themselves, right?"}, {"time": 6415, "text": "And this was a long, long time ago."}, {"time": 6418, "text": "You mentioned that he asked you to do some kind of JavaScript thing."}, {"time": 6422, "text": "We were working on some JavaScript together."}, {"time": 6425, "text": "That's hilarious, like pre Twitter, early Twitter days, you and Jack Dorsey are in a room together talking about JavaScript, solving some kind of menial problem."}, {"time": 6434, "text": "Terrible problems, yeah."}, {"time": 6435, "text": "I mean, not terrible, just like boring widget problem."}, {"time": 6438, "text": "I think it was the Odeo widget we were working on at the time."}, {"time": 6441, "text": "I'm surprised anyone paid me to be in the room as an intern because I didn't really provide any value."}, {"time": 6446, "text": "I'm very thankful to anyone who included me back in the day."}, {"time": 6450, "text": "It was very helpful."}, {"time": 6452, "text": "So thank you for listening."}, {"time": 6453, "text": "I mean, is there Odeo that's a precursor to Twitter?"}, {"time": 6458, "text": "First of all, did you have any anticipation that this Jack Dorsey guy could be also a head of a major social network?"}, {"time": 6466, "text": "And second, did you learn anything from the guy that, like, do you think it's a coincidence that you two were in the room together?"}, {"time": 6475, "text": "And it's the coincidence meaning like, why does the world play its game in a certain way where these two founders of social networks?"}, {"time": 6484, "text": "It's so weird, right?"}, {"time": 6485, "text": "Like, I mean, it's also weird that Mark showed up in our fraternity my sophomore year and we got to know each other then, like long before Instagram."}, {"time": 6498, "text": "It's a small world, but let me tell a fun story about Jack."}, {"time": 6505, "text": "We're at Odeo and I don't know, I think Ev was feeling like people weren't working hard enough or something."}, {"time": 6512, "text": "And I can't remember exactly what he, he created this thing where every Friday, I don't know if it was every Friday, I only remember this happening once, but he had us like a statuette, it's like of Mary."}, {"time": 6527, "text": "And in the bottom, it's hollow, right?"}, {"time": 6530, "text": "And I remember on a Friday, Ev decided he was going to let everyone vote for who had worked the hardest that week."}, {"time": 6539, "text": "We all voted, closed ballot, right?"}, {"time": 6541, "text": "We all put it in a bucket and he tallied the votes."}, {"time": 6544, "text": "And then whoever got the most votes, as I recall, got the statuette."}, {"time": 6549, "text": "And in the statuette was a thousand bucks, or I recall there was a thousand bucks in it."}, {"time": 6554, "text": "It might've been a hundred bucks, but let's call it a thousand."}, {"time": 6556, "text": "It's more exciting that way."}, {"time": 6557, "text": "It felt like a thousand, yeah."}, {"time": 6558, "text": "It did to me for sure."}, {"time": 6559, "text": "I actually got two votes."}, {"time": 6561, "text": "We were a small company, but as the intern, I got at least two votes."}, {"time": 6564, "text": "So everybody knew how many votes they got individually?"}, {"time": 6567, "text": "And I think it was one of these self accountability things."}, {"time": 6569, "text": "Anyway, I remember Jack just getting like the vast majority of votes from everyone."}, {"time": 6575, "text": "And I remember just thinking like, like I couldn't imagine he would become what he'd become and do what he would do, but I had a profound respect that the new guy who I really liked worked that hard."}, {"time": 6588, "text": "And you could see his dedication even then and that people respected him."}, {"time": 6593, "text": "That's the one story that I remember of him like working with him specifically from that summer."}, {"time": 6598, "text": "Can I take a small tangent on that?"}, {"time": 6600, "text": "There's kind of a pushback in Silicon Valley a little bit against hard work."}, {"time": 6604, "text": "Can you speak to the sort of the thing you admire to see the new guy working so hard, that thing?"}, {"time": 6611, "text": "What is the value of that thing in a company?"}, {"time": 6613, "text": "See, this is like, just to be very frank, it drives me nuts."}, {"time": 6617, "text": "Like I saw this really funny video on TikTok."}, {"time": 6621, "text": "Was it on TikTok?"}, {"time": 6622, "text": "It was like, I'm taking a break from my mental health to work on my career."}, {"time": 6626, "text": "I thought that was funny."}, {"time": 6627, "text": "Um, so I was like, oh, it is kind of phrased that way, the opposite often, right?"}, {"time": 6633, "text": "Okay, so a couple of things."}, {"time": 6635, "text": "Uh, I, uh, I have worked so hard to do the things that I did."}, {"time": 6643, "text": "Like Mike and I lost years off of our lives, staying up late, figuring things out, the stress that comes with the job."}, {"time": 6651, "text": "I have a lot more gray hair now than I did back then."}, {"time": 6654, "text": "It requires an enormous amount of work and most people aren't successful, right?"}, {"time": 6659, "text": "But even the ones that do don't skate by."}, {"time": 6664, "text": "I am okay if people choose not to work hard because I don't actually think there's anything in this world that says you have to work hard."}, {"time": 6673, "text": "But I do think that great things require a lot of hard work."}, {"time": 6676, "text": "So there's no way you can expect to change the world without working really hard."}, {"time": 6679, "text": "By the way, even changing the world, you know, the folks that I respect the most have nudged the world in like a slight direction, slight, very, very slight."}, {"time": 6690, "text": "Like even if Elon accomplishes all the things he wants to accomplish, we will have nudged the world in a slight direction, but it requires enormous amount."}, {"time": 6700, "text": "There was an interview with him where he was just like, he was interviewed, I think, at the Tesla factory and he was like, work is really hard."}, {"time": 6707, "text": "This is actually unhealthy."}, {"time": 6709, "text": "And I can't recall the exact, but he was like visibly shaken about how hard he had been working."}, {"time": 6714, "text": "And he was like, this is bad."}, {"time": 6715, "text": "And unfortunately, I think to have great outcomes, you actually do need to work at like three standard deviations above the mean, but there's nothing saying that people have to go for that."}, {"time": 6723, "text": "See, the thing is, but what I would argue, this is my personal opinion, is nobody has to do anything, first of all."}, {"time": 6730, "text": "They certainly don't have to work hard."}, {"time": 6732, "text": "But I think hard work in a company should be admired."}, {"time": 6737, "text": "And you should not feel like, you shouldn't feel good about yourself for not working hard."}, {"time": 6746, "text": "Like, so for example, I don't have to work out."}, {"time": 6750, "text": "I don't have to run."}, {"time": 6751, "text": "I hate running, but like, I certainly don't feel good if I don't run because I know for my health, like there's certain values, I guess is what I'm trying to get at."}, {"time": 6760, "text": "There's certain values that you have in life."}, {"time": 6762, "text": "It feels like there's certain values that companies should have in hard work."}, {"time": 6765, "text": "Certain values that companies should have in hard work is one of the things I think that should be admired."}, {"time": 6771, "text": "I often ask this kind of silly question, just to get a sense of people, like if I'm hiring and so on."}, {"time": 6778, "text": "I just ask if they think it's better to work hard or work smart."}, {"time": 6783, "text": "It was helpful for me to get a sense of people from that."}, {"time": 6787, "text": "Because you think like the right."}, {"time": 6788, "text": "The answer's both."}, {"time": 6792, "text": "I usually try not to give them that, but sometimes I'll say both if that's an option."}, {"time": 6796, "text": "But a lot of people kind of, a surprising number will say work smart."}, {"time": 6802, "text": "And there are usually people who don't know how to work smart."}, {"time": 6806, "text": "And they're literally just lazy."}, {"time": 6809, "text": "Not just, there's two effects behind that."}, {"time": 6812, "text": "One is laziness and the other is ego."}, {"time": 6817, "text": "When you're younger and you say it's better to work smart, it means you think you know what it means to work smart at this early stage."}, {"time": 6826, "text": "To me, people that say work hard or both, they have the humility to understand like, I'm going to have to work my ass off because I'm too dumb to know how to work smart."}, {"time": 6836, "text": "And people who are self critical in this way, in some small amount, you have to have some confidence."}, {"time": 6841, "text": "But if you have humility, that means you're going to actually eventually figure out what it means to work smart."}, {"time": 6847, "text": "And then to actually be successful, you should do both."}, {"time": 6851, "text": "So I have a very particular take on this, which is that no one's forcing you to do anything."}, {"time": 6859, "text": "All choices have consequences."}, {"time": 6862, "text": "So if you major in, I don't know, theoretical literature, I don't even know if that's a major."}, {"time": 6868, "text": "I'm just making something up."}, {"time": 6870, "text": "That's supposed to regular literature, applied literature."}, {"time": 6873, "text": "Yeah, think about like theoretical Spanish lit from the 14th century."}, {"time": 6879, "text": "Like just make up your esoteric thing."}, {"time": 6881, "text": "And then the number of people I went to Stanford with who get out in the world and they're like, wait, what, I can't find a job?"}, {"time": 6887, "text": "Like no one wants a theoretical, like there are plenty of counter examples of people who have majored in esoteric things and gone on to be very successful."}, {"time": 6894, "text": "So I just want to be clear, it's not about the major."}, {"time": 6896, "text": "But every choice you make, whether it's to have kids, like I love my children."}, {"time": 6902, "text": "It's so awesome to have two kids."}, {"time": 6904, "text": "And it is so hard to work really hard and also have kids."}, {"time": 6909, "text": "And there's a reason why certain very successful people like don't have, or not successful, but people who run very, very large companies or startups have chosen not to have kids for a while or chosen not to like prioritize them."}, {"time": 6921, "text": "Everything's a choice."}, {"time": 6922, "text": "And like I choose to prioritize my children because like I want to do that, right?"}, {"time": 6927, "text": "So everything's a choice."}, {"time": 6929, "text": "Now, once you've made that choice, I think it's important that the contract is clear, which is to say, let's imagine you were joining a new startup."}, {"time": 6940, "text": "It's important that that startup communicate that like the expectation is like, we're all working really, really hard right now."}, {"time": 6946, "text": "You don't have to join the startup."}, {"time": 6948, "text": "But like, if you do just know like you're, it's almost as if you join, I don't know, pick your like sports team."}, {"time": 6957, "text": "Like let's go back to the Yankees for a second."}, {"time": 6960, "text": "You want to join the Yankees, but you don't really want to work that hard."}, {"time": 6963, "text": "You don't really want to do batting practice or pitching practice or whatever for your position, right?"}, {"time": 6969, "text": "That to me is wacko."}, {"time": 6971, "text": "And that's actually the world that it feels like we live in in tech sometimes, where people both want to work for the Yankees because it pays a lot, but like don't actually want to work that hard."}, {"time": 6981, "text": "That I don't fully understand."}, {"time": 6983, "text": "Because if you sign up for some of these things, just sign up for it."}, {"time": 6986, "text": "But it's okay if you don't want to sign up for it."}, {"time": 6989, "text": "There's so many wonderful careers in this world that don't require 80 hours a week."}, {"time": 6993, "text": "But when I read about companies going to like four day work weeks and stuff, I just like, I chuckle because I can't get enough done with a seven day week."}, {"time": 7001, "text": "I don't know how."}, {"time": 7002, "text": "And people will say, oh, you're just not working smart."}, {"time": 7004, "text": "And it's like, no, I work pretty smart, I think in general."}, {"time": 7007, "text": "Like I wouldn't have gotten to this point if I hadn't like some amount of working smart."}, {"time": 7012, "text": "And there is balance though."}, {"time": 7013, "text": "So I used to be like a pretty big cyclist."}, {"time": 7015, "text": "I don't do it much anymore just because of kids and like prioritizing other things, right?"}, {"time": 7021, "text": "But one of the most important things to learn as a cyclist is to take a rest day."}, {"time": 7026, "text": "But to me and to cyclists, like resting is a function of optimizing for the long run."}, {"time": 7032, "text": "It's not like a thing that you do for its own merits."}, {"time": 7036, "text": "It's actually like, if you don't rest, your muscles don't recover."}, {"time": 7038, "text": "And then you're just not as, like you're not training as efficiently."}, {"time": 7041, "text": "You should probably, the successful people I've known in terms of athletes, they hate rest days, but they know they have to do it for the long term."}, {"time": 7049, "text": "They think their opposition is getting stronger and stronger and that's the feeling, but you know it's the right thing and usually you need a coach to help you."}, {"time": 7059, "text": "So, I mean, I use this thing called training peaks and it's interesting because it actually mathematically shows like where you are on the curve and all this stuff, but you have to have that rest, but it's a function of going harder for longer."}, {"time": 7072, "text": "Again, it's this reinforcement learning, like planning the aggregate and the long, but a lot of people will hide behind laziness by saying that they're trying to optimize for the long run and they're not, they're just not working very hard."}, {"time": 7083, "text": "But again, you don't have to sign up for it."}, {"time": 7085, "text": "It's totally cool."}, {"time": 7085, "text": "Like, I don't think less of people for like not working super hard."}, {"time": 7088, "text": "It's just like, don't sign up for things that require working super hard."}, {"time": 7091, "text": "And some of that requires for the leadership to have the guts, the boldness to communicate effectively at the very beginning."}, {"time": 7097, "text": "I mean, sometimes I think most of the problems arise in the fact that the leadership is kind of hesitant to communicate the socially difficult truth of what it takes to be at this company."}, {"time": 7113, "text": "So they kind of say, hey, come with us."}, {"time": 7116, "text": "There's, we have snacks, you know, but."}, {"time": 7119, "text": "Unlimited vacation and."}, {"time": 7121, "text": "You know, Ray at Bridgewater is always fascinating because, you know, people, it's been called like a cult on the outside or cultish and, but what's fascinating is like, they just don't give on their principles."}, {"time": 7132, "text": "They're like, listen, this is what it's like to work here."}, {"time": 7135, "text": "We record every meeting."}, {"time": 7137, "text": "We're like brutally honest and that's not going to feel right to everyone."}, {"time": 7140, "text": "And if it doesn't feel right to you, totally cool."}, {"time": 7143, "text": "Just go work somewhere else."}, {"time": 7144, "text": "But if you work here, you are signing up for this."}, {"time": 7148, "text": "And that's, that's been fascinating to me because it's honesty upfront."}, {"time": 7152, "text": "It's a system in which you operate."}, {"time": 7155, "text": "And if it's not for you, like no one's forcing you to work there, right?"}, {"time": 7159, "text": "I actually did."}, {"time": 7160, "text": "So I did a conversation with him and kind of got stuck in a funny moment, which is at the end I asked him, you know, to give me honest feedback of how I did on the interview."}, {"time": 7171, "text": "And I was."}, {"time": 7172, "text": "Did he?"}, {"time": 7174, "text": "He was super nice."}, {"time": 7176, "text": "He asked me, he's like, well, tell me, did you accomplish what you were hoping to accomplish?"}, {"time": 7182, "text": "I was like, that's not, that's not."}, {"time": 7185, "text": "I'm asking you as an objective observer of two people talking, how do we do today?"}, {"time": 7192, "text": "And then he's like, well, he gave me this politician answer."}, {"time": 7195, "text": "Well, I feel like we've accomplished successful communication of like ideas, which is I'd love to spread some of the ideas in that, like in principles and so on."}, {"time": 7206, "text": "I was like."}, {"time": 7207, "text": "Back to my original point, it's really hard to get."}, {"time": 7210, "text": "Even for Radalia."}, {"time": 7211, "text": "It's really hard to give feedback."}, {"time": 7213, "text": "And one of the other things I learned from him and just people in that world is like, man, humans really like to pretend like they've come to, that they've come to some kind of meeting of the minds."}, {"time": 7227, "text": "Like if there's conflict, if you and I have conflict, it's always better to meet face to face, right?"}, {"time": 7232, "text": "We're on the phone."}, {"time": 7233, "text": "Slack is not great, right?"}, {"time": 7235, "text": "Email is not great, but face to face."}, {"time": 7237, "text": "What's crazy is you and I get together and we actively try to, even if we're not actually solving the conflict, we actively try to paper over the conflict."}, {"time": 7245, "text": "Oh yeah, it didn't really bother me that much."}, {"time": 7248, "text": "Oh yeah, I'm sure you didn't mean it."}, {"time": 7250, "text": "But like, no, in our minds we're still there."}, {"time": 7254, "text": "So this is one of the things that as a leader, you always have to be digging, especially as you ascend."}, {"time": 7259, "text": "Like straight to the conflict."}, {"time": 7260, "text": "Yeah, but as you ascend, no one wants to tell you you're crazy."}, {"time": 7263, "text": "No one wants to tell you your idea is bad."}, {"time": 7266, "text": "And you can, you're like, oh, oh, I'm going to be a leader."}, {"time": 7269, "text": "And the idea is, well, I'm just going to ask people."}, {"time": 7272, "text": "No one tells you."}, {"time": 7273, "text": "So like you have to look for the markers, knowing that literally just people aren't going to tell you along the way and be paranoid."}, {"time": 7281, "text": "I mean, you asked about selling the company."}, {"time": 7284, "text": "I think one of the biggest differences between me and a lot of other entrepreneurs is like, I wasn't completely confident we could do it."}, {"time": 7290, "text": "Like we could be alone and actually be great."}, {"time": 7295, "text": "And if any entrepreneur is honest with you, they also feel that way."}, {"time": 7299, "text": "But a lot of people are like, well, I have to be cocky and just say, I can do this on my own."}, {"time": 7303, "text": "We're going to be fine."}, {"time": 7304, "text": "We're going to crush everyone."}, {"time": 7306, "text": "Some people do say that and then it's not right."}, {"time": 7309, "text": "And they, and they fail."}, {"time": 7310, "text": "But being honest in that moment with yourself, with those close to you."}, {"time": 7317, "text": "And also you talked about the personality of leaders and who resonates and who doesn't."}, {"time": 7324, "text": "It's rare that I see leaders be vulnerable, rare."}, {"time": 7329, "text": "And one thing I tried to do at Instagram, at least internally was like, say when I screwed up and like point out how I was wrong about things and point out where my judgment was off."}, {"time": 7342, "text": "Everyone thinks they have to bat a thousand, right?"}, {"time": 7347, "text": "The best quant hedge funds in the world, bat 50.001%."}, {"time": 7351, "text": "They just take a lot of bets, right?"}, {"time": 7354, "text": "Renaissance, they might, they might bat 51%, right?"}, {"time": 7357, "text": "But holy hell, like the question isn't, are you right every single time and you have to seem invincible."}, {"time": 7366, "text": "The question is how many at bats do you get?"}, {"time": 7368, "text": "And on average, are you better on average, right?"}, {"time": 7373, "text": "With enough bets and enough at bats that your aggregate can be very high."}, {"time": 7378, "text": "I mean, Steve Jobs was wrong at a lot of stuff."}, {"time": 7381, "text": "The Newton too early, right?"}, {"time": 7383, "text": "Next, not quite right."}, {"time": 7385, "text": "There was even a time where he said like, no one will ever wanna watch a video on the iPod."}, {"time": 7394, "text": "But who cares if you come around and realize your mistake and fix it."}, {"time": 7398, "text": "It becomes just like you said, harder and harder when your ego grows and the number of people around you that say positive things towards you grows."}, {"time": 7406, "text": "I actually think it's really valuable that, like let's imagine a counterfactual where Instagram became worth like $300 billion or something crazy, right?"}, {"time": 7417, "text": "I kind of like that my life is relatively normal now."}, {"time": 7420, "text": "When I say relatively, you get what I mean."}, {"time": 7421, "text": "I'm not making a claim that I live a normal life, but like I certainly don't live in a world where there are like 15 Sherpas following me, like fetching me water, like that's not how it works."}, {"time": 7432, "text": "I actually like that I have a sense of humility of like, I may not found another thing that's nearly as big so I have to work twice as hard or I have to like learn twice as much."}, {"time": 7444, "text": "I have to, we haven't talked about machine learning yet, but my favorite thing is all these like famous, you know, tech guys who have worked in the industry, pontificating about the future of machine learning and how it's gonna kill us all, right?"}, {"time": 7459, "text": "And like, I'm pretty sure they've never tried to build anything with machine learning themselves."}, {"time": 7464, "text": "Yes, so there's a nice line between people that actually build stuff with machine, like actually program something or at least understand some of those fundamentals and the people that are just saying philosophical stuff or journalists and so on."}, {"time": 7478, "text": "It's an interesting line to walk because the people who program are often not philosophers."}, {"time": 7484, "text": "Or don't have the attention, they can't write an op ed for the Wall Street Journal, like it doesn't work."}, {"time": 7489, "text": "So like, it's nice to be both a little bit, like to have elements of both."}, {"time": 7492, "text": "My point is the fact that I have to learn stuff from scratch or that I choose to are like."}, {"time": 7499, "text": "Yeah, I mean, again, I have a lot of advantages."}, {"time": 7502, "text": "I like, but my point is it's awesome to be back in a game where you have to fight."}, {"time": 7511, "text": "That is, that's fun."}, {"time": 7513, "text": "So being humble, being vulnerable, it's an important aspect of a leader and I hope it serves me well, but like, I can't fast forward 10 years to now."}, {"time": 7522, "text": "I've just, that's my game plan."}, {"time": 7524, "text": "Before I forget, I have to ask you one last thing on Instagram."}, {"time": 7528, "text": "What do you think about the whistleblower, Frances Haugen, recently coming out and saying that Facebook is aware of Instagram's harmful effect on teenage girls as per their own internal research studies on the matter?"}, {"time": 7543, "text": "What do you think about this baby of yours, Instagram being under fire now, as we've been talking about under the leadership of Facebook?"}, {"time": 7554, "text": "You know, I often question, where does the blame lie?"}, {"time": 7559, "text": "Is the blame at the people that originated the network me?"}, {"time": 7566, "text": "Is the blame at like the decision to combine the network with another network with a certain set of values?"}, {"time": 7575, "text": "Is the blame at how it gets run after I left?"}, {"time": 7580, "text": "Like, is it the driver or is it the car, right?"}, {"time": 7585, "text": "Is it that someone enabled these devices in the first place?"}, {"time": 7589, "text": "If you go to an extreme, right?"}, {"time": 7591, "text": "Or is it the users themselves, just human nature?"}, {"time": 7595, "text": "Is it just the way of human nature?"}, {"time": 7597, "text": "Sure, and like the idea that we're gonna find a mutually exclusive answer here is crazy."}, {"time": 7602, "text": "There's not one place that's a combination of a lot of these things."}, {"time": 7605, "text": "And then the question is like, is it true at all, right?"}, {"time": 7608, "text": "Like I'm not actually saying that's not true or that it's true, but there's always more nuance here."}, {"time": 7615, "text": "Do I believe that social media has an effect on young people?"}, {"time": 7620, "text": "Well, it's got it, they use it a lot."}, {"time": 7622, "text": "And I bet you there are a lot of positive effects and I bet you there are negative effects, just like any technology."}, {"time": 7627, "text": "And where I've come to in my thinking on this is that I think any technology has negative side effects."}, {"time": 7633, "text": "The question is, as a leader, what do you do about them?"}, {"time": 7636, "text": "And are you actively working on them or do you just like not really believe in them?"}, {"time": 7640, "text": "If you're a leader that sits there and says, well, we're gonna put an enormous amount of resources against this."}, {"time": 7646, "text": "We're gonna acknowledge when there are true criticisms, we're gonna be vulnerable and that we're not perfect and we're gonna go fix them and we're gonna be held accountable along the way."}, {"time": 7657, "text": "I think that people generally really respect that."}, {"time": 7661, "text": "But I think that where Facebook I think has had issues in the past is where they say things like, can't remember what Mark said about misinformation during the election."}, {"time": 7670, "text": "There was that like famous quote where he was like, it's pretty crazy to think that Facebook had anything to do with this election."}, {"time": 7675, "text": "Like that was something like that quote."}, {"time": 7677, "text": "And I don't remember what stage he was on and yeah."}, {"time": 7680, "text": "But ooh, that did not age well, right?"}, {"time": 7682, "text": "Like you have to be willing to say, well, maybe there's something there and wow, like I wanna go look into it and truly believe it in your gut."}, {"time": 7692, "text": "But if people look at you and how you act and what you say and don't believe you truly feel that way."}, {"time": 7698, "text": "It's not just the words you say, but how you say them and that people believe they actually feel the pain of having caused any suffering in the world."}, {"time": 7705, "text": "So to me, it's much more about your actions and your posture post event than it is about debugging the why."}, {"time": 7713, "text": "Cause I don't know, is it like, I don't know this research."}, {"time": 7716, "text": "It was written well after I left, right?"}, {"time": 7718, "text": "Like, is it the algorithm?"}, {"time": 7721, "text": "Is it the explore page?"}, {"time": 7722, "text": "Is it the people you might know unit connecting you to ideas that are dangerous?"}, {"time": 7727, "text": "Like I really don't know."}, {"time": 7731, "text": "So we'd have to have a much deeper, I think dive to understand where the blame lies."}, {"time": 7736, "text": "What's very unpleasant to me to consider, now, I don't know if this is true, but to consider the very fact that there might be some complicated games being played here."}, {"time": 7747, "text": "For example, as somebody, I really love psychology and I love it enough to know that the field is pretty broken in the following way."}, {"time": 7755, "text": "It's very difficult to study human beings well at scale because the questions you ask affect the results."}, {"time": 7762, "text": "You can basically get any results you want."}, {"time": 7765, "text": "And so you have an internal Facebook study that asks some question of which we don't know the full details and there's some kind of analysis, but that's just the one little tiny slice into some much bigger picture."}, {"time": 7777, "text": "And so you can have thousands of employees at Facebook."}, {"time": 7780, "text": "One of them comes out and picks whatever narrative, knowing that they become famous, coupled with the other really uncomfortable thing I see in the world, which is journalists seem to understand they get a lot of clickbait attention from saying something negative about social networks."}, {"time": 7830, "text": "And so couple that with the whistleblower and with this whole dynamic of journalism and so on, you know, with Social Dilemma being really popular, documentary, it's like, all right, my concern is there's deep flaws in human nature here in terms of things we need to deal with, like the nature of hate, of bullying, all those kinds of things."}, {"time": 7856, "text": "And then there's people who are trying to use that potentially to become famous and make money off of blaming others for causing more of the problem as opposed to helping solve the problem."}, {"time": 7868, "text": "So I don't know what to think."}, {"time": 7870, "text": "I'm not saying this is like, I'm just uncomfortable with, I guess, not knowing what to think about any of this because a bunch of folks I know that work at Facebook on the machine learning side, so Yann LeCun, I mean, they're quite upset about what's happening because there's a lot of really brilliant, good people inside Facebook that are trying to do good."}, {"time": 7890, "text": "And so like all of this press, Yann is one of them, and he has an amazing team with the machine learning researchers."}, {"time": 7895, "text": "Like he's really upset with the fact that people don't seem to understand that the portrayal does not represent the full nature of efforts that's going on at Facebook."}, {"time": 7906, "text": "So I don't know what to think about that."}, {"time": 7908, "text": "Well, you just, I think, very helpfully explained the nuance of the situation and why it's so hard to understand."}, {"time": 7916, "text": "But a couple of things."}, {"time": 7917, "text": "One is I think I have been surprised at the scale with which some product manager can do an enormous amount of harm to a very, very large company by releasing a trove of documents."}, {"time": 7939, "text": "Like I think I read a couple of them when they got published and I haven't even spent any time going deep."}, {"time": 7944, "text": "Part of it's like, I don't really feel like reliving a previous life, but wow."}, {"time": 7950, "text": "Like talk about challenging the idea of open culture and like what that does to Facebook internally."}, {"time": 7983, "text": "I mean, other companies like Apple have been quiet slash locked down, Snapchat's the same way for a reason."}, {"time": 7990, "text": "And I don't know what this does to transparency on the inside of startups that value that."}, {"time": 7996, "text": "I think that it's a seminal moment and you can say, well, you should have nothing to hide, right?"}, {"time": 8002, "text": "But to your point, you can pick out documents that show anything, right?"}, {"time": 8008, "text": "What happens to transparency inside of startups and the culture that startups or companies in the future will grow, like the startup of the future that becomes the next Facebook will be locked down and what does that do, right?"}, {"time": 8022, "text": "So that's part one."}, {"time": 8024, "text": "Part two, like I don't think that you could design a more like a well orchestrated handful of events from the like 16 minutes to releasing the documents in the way that they were released at the right time."}, {"time": 8042, "text": "That takes a lot of planning and partnership."}, {"time": 8045, "text": "And it seems like she has a partner at some firm, right?"}, {"time": 8049, "text": "That probably helped a lot with this, but man, at a personal level, if you're her, you'd have to really believe in what you are doing, really believe in it because you are personally putting your ass on the line, right?"}, {"time": 8065, "text": "Like you've got a very large company that doesn't like enemies, right?"}, {"time": 8073, "text": "It takes a lot of guts and I don't love these conspiracy theories about like, oh, she's being financed from some person or people."}, {"time": 8082, "text": "Like I don't love them because that's like the easy thing to say."}, {"time": 8085, "text": "I think the Occam's razor here is like someone thought they were doing something wrong and was like very, very courageous."}, {"time": 8094, "text": "And I don't know if courageous is the word, but like, so without getting into like, is she a martyr?"}, {"time": 8101, "text": "Is she courageous?"}, {"time": 8102, "text": "Is she right?"}, {"time": 8103, "text": "Like, let's put that aside for a second."}, {"time": 8105, "text": "Then there are the documents themselves."}, {"time": 8107, "text": "They say what they say."}, {"time": 8109, "text": "To your point, a lot of the things that like people have been worried about already in the documents or they're already been said externally."}, {"time": 8117, "text": "And I don't know, I'm just like, I'm thankful that I am focused on new things with my life."}, {"time": 8125, "text": "Well, let me just say, I just think it's a really hard problem that probably Facebook and Twitter are trying to solve."}, {"time": 8132, "text": "I'm actually just fascinated by how hard this problem is."}, {"time": 8135, "text": "There are fundamental issues at Facebook in tone and in an approach of how product gets built and the objective functions."}, {"time": 8143, "text": "And since people, organizations are not people."}, {"time": 8148, "text": "So yawn and fair, right?"}, {"time": 8150, "text": "Like there are a lot of really great people who like literally just want to push reinforcement learning forward."}, {"time": 8155, "text": "They literally just want to teach a robot to touch, feel, lift, right?"}, {"time": 8159, "text": "Like they're not thinking about political misinformation, right?"}, {"time": 8163, "text": "But there's a strong connection between what funds that research and an enormously profitable machine that has trade offs."}, {"time": 8173, "text": "And one cannot separate the two."}, {"time": 8178, "text": "You are not completely separate from the system."}, {"time": 8181, "text": "So I agree, it can feel really frustrating to feel if you're internal there, that you're working on something completely unrelated and you feel like your group's good."}, {"time": 8191, "text": "I can understand that."}, {"time": 8192, "text": "But there's some responsibility still."}, {"time": 8194, "text": "You have to acknowledge, it's like the Ray Dalio thing."}, {"time": 8196, "text": "You have to look in the mirror and see if there's problems and you have to fix those problems."}, {"time": 8203, "text": "You mentioned machine learning reinforcement quite a bit."}, {"time": 8206, "text": "I mean, to me, social networks is one of the exciting places, recommender systems where machine learning is applied."}, {"time": 8212, "text": "Where else in the world, in the space of possibilities over the next five, 10, 20 years, do you think we're going to see impact of machine learning when you try, on the philosophical level, on a technical level, what do you think?"}, {"time": 8227, "text": "Or within social networks themselves?"}, {"time": 8231, "text": "Well, I think the obvious answers are climate change."}, {"time": 8237, "text": "Think about how much fuel or just waste there is in energy consumption today because we don't plan accordingly, because we take the least efficient route or..."}, {"time": 8250, "text": "The logistics and stuff, the supply chain, all that kind of stuff."}, {"time": 8253, "text": "Yeah, I mean, listen, if we're gonna fight climate change, like one really way, one awesome way to do it is figure out how to optimize how we operate as a species and minimize the amount of energy we consume to maximize whatever economic impact we wanna have."}, {"time": 8271, "text": "Because right now those two are very much tied together."}, {"time": 8273, "text": "And I don't believe that that has to be the case."}, {"time": 8276, "text": "There's this really interesting, you've read it."}, {"time": 8280, "text": "For people who are listening, there's this really interesting paper on reinforcement learning and energy consumption inside buildings."}, {"time": 8286, "text": "It's like one of the seminal ones, right?"}, {"time": 8288, "text": "But imagine that at massive scale."}, {"time": 8291, "text": "I mean, they've done resource planning for servers for peak load using reinforcement learning."}, {"time": 8297, "text": "I don't know if that was at Google or somewhere else, but like, okay, great, you do it for servers, but what if you could do it for just capacity and general energy capacity for cities and planning for traffic?"}, {"time": 8307, "text": "And of course there's all the self driving cars and I don't know, like I'm not gonna pontificate on like crazy ideas using reinforcement learning or machine learning."}, {"time": 8320, "text": "It's just so clear to me that humans don't think quickly enough."}, {"time": 8323, "text": "So it's interesting to think about machine learning helping a little bit at scale."}, {"time": 8329, "text": "So a little bit to a large number of people that has a huge impact."}, {"time": 8333, "text": "So if you optimize, say Google Maps, something like that, trajectory planning or what a map quest first."}, {"time": 8341, "text": "Getting here, I looked and it was like, here's the most energy efficient route."}, {"time": 8344, "text": "And I was like, I'm gonna be late."}, {"time": 8345, "text": "I need to take the fastest route."}, {"time": 8347, "text": "As opposed to unrolling the map."}, {"time": 8350, "text": "Like, and then that's going to be very inefficient no matter what."}, {"time": 8353, "text": "I was definitely the other day, like part of the Epsilon of Epsilon Greedy with Waze where like I was sent on like a weird route that I could tell they're like, we just need to collect data at this road."}, {"time": 8364, "text": "Like we just, Kevin's."}, {"time": 8366, "text": "You were the ant they sent out for exploration."}, {"time": 8368, "text": "Kevin's definitely gonna be the guinea pig."}, {"time": 8370, "text": "And great, now we have."}, {"time": 8372, "text": "Did you at least feel pride?"}, {"time": 8374, "text": "Oh, going through it, I was like, oh, this is fun."}, {"time": 8376, "text": "Like now they get data about this weird shortcut."}, {"time": 8378, "text": "And actually I hit all the green lights networked."}, {"time": 8380, "text": "I'm like, this is a problem."}, {"time": 8381, "text": "Bad data."}, {"time": 8382, "text": "Bad data, they're just gonna imagine."}, {"time": 8384, "text": "I could see you slowing down and stopping at a green light just to give them the right kind of data."}, {"time": 8390, "text": "But to answer your question, like I feel like that was fairly unsatisfying and it's easy to say climate change."}, {"time": 8395, "text": "But what I would say is at Instagram, everything we applied machine learning to got better for users and it got better for the company."}, {"time": 8404, "text": "I saw the power."}, {"time": 8406, "text": "I didn't fully understand it as an executive."}, {"time": 8408, "text": "And I think that's actually one of the issues that, and when I say understand, I mean the mathematics of it."}, {"time": 8414, "text": "Like I understand what it does."}, {"time": 8415, "text": "I understand that it helps."}, {"time": 8417, "text": "But there are a lot of executives now that talk about it in the way that they talk about the internet or they talked about the internet like 10 years ago."}, {"time": 8425, "text": "They're like, we're gonna build mobile."}, {"time": 8427, "text": "And you're like, what does that mean?"}, {"time": 8427, "text": "They're like, we're just gonna do mobile."}, {"time": 8429, "text": "And you're like, okay."}, {"time": 8431, "text": "So my sense is the next generation of leaders will have grown up having had classes in reinforcement learning, supervised learning, whatever."}, {"time": 8440, "text": "And they will be able to thoughtfully apply it to their companies and the places that it is needed most."}, {"time": 8446, "text": "And that's really cool."}, {"time": 8447, "text": "Cause I mean, talk about efficiency gains."}, {"time": 8453, "text": "That's what excites me the most about it."}, {"time": 8454, "text": "Yeah, so there's, it's interesting just to get a fundamental first principles understanding of certain concepts of machine learning."}, {"time": 8461, "text": "So supervised learning from an executive perspective, supervised learning, you have to have a lot of humans label a lot of data."}, {"time": 8468, "text": "So the question there is, okay, can we gather a large amount of data that can be labeled well?"}, {"time": 8474, "text": "And that's the question Tesla asked, like can we create a data engine that keeps sending an imperfect machine learning system out there, whenever it fails, it gives us data back."}, {"time": 8485, "text": "We label it by human and we send it back and forth to this way."}, {"time": 8488, "text": "Then there's Yann LeCun's excited about the self supervised learning where you do much less human labeling and there's some kind of mechanism for the system to learn it by itself on the human generated data."}, {"time": 8502, "text": "And then there's the reinforcement learning, which is like basically allowing, it's applying the alpha zero technology that allow through self play to learn how to solve the game of Go and achieve incredible levels at the game of chess."}, {"time": 8522, "text": "Can you formulate the problem you're trying to solve in a way that's amenable to reinforcement learning?"}, {"time": 8527, "text": "And can you get the right kind of signal at scale?"}, {"time": 8529, "text": "Cause you need a lot of signal."}, {"time": 8531, "text": "And that's kind of fascinating to see which part of a social network can you convert into reinforcement learning problem."}, {"time": 8539, "text": "The fascinating thing about reinforcement learning, I think, is that we now have learned to apply neural networks to guess the Q function, basically the values for any state in action."}, {"time": 8557, "text": "And that is fascinating cause we used to just like, I don't know, have like a linear regression, like hope it worked and that was the fanciest version of it."}, {"time": 8565, "text": "But now you look at it, I'm like trying to learn this stuff and I look at it and I'm like, there are like 17 different acronyms of different ways you can try to apply this."}, {"time": 8572, "text": "No one quite agrees, like what's the best."}, {"time": 8576, "text": "Generally, if you're trying to like build a neural network, there are pretty well trodden ways of doing that."}, {"time": 8582, "text": "You use Adam, you use ReLU, like there's just like general good ideas."}, {"time": 8587, "text": "And in reinforcement learning, I feel like the consensus is like, it totally depends."}, {"time": 8593, "text": "And by the way, it's really hard to get it to converge and it's noisy and it like, so there are all these really interesting ideas around building simulators."}, {"time": 8603, "text": "You know, like for instance, in self driving, right?"}, {"time": 8605, "text": "Like you don't want to like actually have someone getting in an accident to learn that an accident is bad."}, {"time": 8611, "text": "So you start simulating accidents, simulating aggressive drivers, just simulating crazy dogs that run into the street and, wow, fascinating, right?"}, {"time": 8621, "text": "Like my mind starts racing and then the question is, okay, forget about self driving cars."}, {"time": 8625, "text": "Let's talk about social networks."}, {"time": 8629, "text": "How can you produce a better, more thoughtful experience using these types of algorithms?"}, {"time": 8635, "text": "And honestly, in talking to some of the people that work at Facebook and old Instagrammers, most people are like, yeah, we tried a lot of things, didn't quite ever make it work."}, {"time": 8645, "text": "I mean, for the longest time, Facebook ads was effectively a logistic regression, okay?"}, {"time": 8650, "text": "I don't know what it is now, but like if you look at this paper that they published back in the day, it was literally just a logistic regression."}, {"time": 8656, "text": "Made a lot of money."}, {"time": 8658, "text": "So even at these like extremely large scales, if we are not yet touching what reinforcement learning can truly do, imagine what the next 10 years looks like."}, {"time": 8669, "text": "So I really liked the use of reinforcement learning as part of the simulation, for example, like with self driving cars, it's modeling pedestrians."}, {"time": 8677, "text": "So the nice thing about reinforcement learning, it can be used to learn agents within the world."}, {"time": 8685, "text": "So they can learn to behave properly."}, {"time": 8687, "text": "Like you can teach pedestrians to, like you don't hard code the way they behave, they learn how to behave."}, {"time": 8693, "text": "In that same way, I do have a hope, was it Jack Dorsey talks about healthy conversations."}, {"time": 8698, "text": "You talked about meaningful interactions, I believe."}, {"time": 8703, "text": "Like simulating interactions."}, {"time": 8706, "text": "So you can learn how to manage that, it's fascinating."}, {"time": 8709, "text": "So where most of your algorithm development happens in virtual worlds, and then you can really learn how to design the interface, how you design a bunch of aspects of the experience in terms of how you select what's shown in the feed, all those kinds of things."}, {"time": 8726, "text": "It feels like if you can connect reinforcement learning to that, that's super exciting."}, {"time": 8730, "text": "Yep, and I think if you have a company and leadership that believe in doing the right things and can apply this technology in the right way, some really special stuff can happen."}, {"time": 8741, "text": "It is mostly likely going to be a group of people we've never heard about, start up from scratch, right?"}, {"time": 8749, "text": "And you asked if like new social networks could be built, I've got to imagine they will be."}, {"time": 8754, "text": "And whoever starts it, it might be some kids in a garage that took these classes from these people, you, right?"}, {"time": 8762, "text": "And they're building all of these things with this tech at the core."}, {"time": 8766, "text": "So I'm trying not to be someone who just like throws around reinforcement learning as a buzzword."}, {"time": 8771, "text": "I truly believe that it is the most cutting edge in what can happen in social networks."}, {"time": 8778, "text": "And I also believe it's super hard."}, {"time": 8780, "text": "Like it's super hard to make it work."}, {"time": 8782, "text": "It's super hard to do it at scale."}, {"time": 8784, "text": "It's super hard to find people that truly understand it."}, {"time": 8786, "text": "So I'm not gonna say that like, I think it'll be applied in social networks before we have true self driving."}, {"time": 8793, "text": "Yeah, we could argue about this for a long time, but yes, I agree with you."}, {"time": 8798, "text": "I think self driving is way harder than people realize."}, {"time": 8801, "text": "Let me ask you in terms of that kid in the garage or those couple of kids in the garage, what advice would you give to them if they wanna start a new social network or a business?"}, {"time": 8810, "text": "What advice would you give to somebody with a big dream and a young startup?"}, {"time": 8816, "text": "To me, you have to choose to do something that even if it fails, like it was so fun, right?"}, {"time": 8823, "text": "Like we never started Instagram knowing it was going to be big."}, {"time": 8827, "text": "We started Instagram because we loved photography."}, {"time": 8830, "text": "We loved social networks."}, {"time": 8832, "text": "I had seen what other social networks had done and I thought, hmm, maybe we did a spin on this, but like nowhere was our feet predestined."}, {"time": 8840, "text": "Like it wasn't like, it wasn't written out anywhere that everything was gonna go great."}, {"time": 8845, "text": "And I often think the counterfactual, like what if it had not gone well?"}, {"time": 8848, "text": "I would have been like, I don't know, that was fun."}, {"time": 8850, "text": "We raised some money, we learned some stuff and does it position you well for the next experience?"}, {"time": 8857, "text": "That's the advice that I would give to anyone wanting to start something today, which is like, does this meet with your ultimate goals?"}, {"time": 8865, "text": "Not wealth, not fame, none of that, because all of that, by the way, is bullshit."}, {"time": 8868, "text": "Like you can get super famous and super wealthy."}, {"time": 8872, "text": "And I think generally those are not things that, again, it's easy to say with like a lot of money that somehow like it's not good to have a lot of money."}, {"time": 8881, "text": "It's just, I think that complicates life enormously in a way that people don't fully comprehend."}, {"time": 8886, "text": "So I think it is way more interesting to shoot for, can I make something that people love, that provides value in the world, that I love building, that I love working on, right?"}, {"time": 8897, "text": "That's what I would do if I were starting from scratch."}, {"time": 8901, "text": "And by the way, like in some ways that I will do that personally, which is like choose the thing that you get up every morning and you're like, I love this, even when it's painful."}, {"time": 8913, "text": "Even when it's painful."}, {"time": 8914, "text": "What about a social network specifically?"}, {"time": 8916, "text": "If you were to imagine, put yourself in the mind of some."}, {"time": 8920, "text": "I can't compete against myself."}, {"time": 8922, "text": "I can't give out ideas."}, {"time": 8924, "text": "No, but it's like high level."}, {"time": 8925, "text": "You can focus on community."}, {"time": 8930, "text": "I said that as a half joke."}, {"time": 8934, "text": "In all honesty, I think these things are so hard to build that like ideas are a dime a dozen, but."}, {"time": 8939, "text": "You have talked about keeping it simple."}, {"time": 8942, "text": "Can I tell you?"}, {"time": 8943, "text": "Which is a liberating idea."}, {"time": 8944, "text": "My model is it's three circles and they overlap."}, {"time": 8948, "text": "One circle is what do I have experience at?"}, {"time": 8951, "text": "Slash, what am I good at?"}, {"time": 8952, "text": "I don't like saying what am I good at because it just like seems like, what do I have experience in, right?"}, {"time": 8958, "text": "What can I bring to the table?"}, {"time": 8959, "text": "What am I excited about is the other circle."}, {"time": 8962, "text": "What gets it?"}, {"time": 8962, "text": "What's just super cool, right?"}, {"time": 8964, "text": "That I want to work on because even when this is hard, I think it's so cool."}, {"time": 8970, "text": "I want to stick with it."}, {"time": 8971, "text": "And the last circle is like, what does the world need?"}, {"time": 8974, "text": "And if that circle ain't there, it doesn't matter what you work on."}, {"time": 8977, "text": "Cause there are a lot of startups that exist that just no one needs or very small markets need."}, {"time": 8983, "text": "But if you want to be successful, I think if you're like, if you're good at it, you have, sorry, if you're good at it, you're passionate about it and the world needs it."}, {"time": 8991, "text": "I mean, this sounds simple, not enough people sit down and just think about those circles and think, do these things overlap?"}, {"time": 8998, "text": "And then can I get that middle section?"}, {"time": 8999, "text": "It's small, but can I get that middle section?"}, {"time": 9002, "text": "I think a lot about that personally."}, {"time": 9005, "text": "And then you have to be really honest about the circle that you're good at and really honest about the circle that the world needs."}, {"time": 9017, "text": "And as opposed to really honest about the passion, like what do you actually love?"}, {"time": 9022, "text": "As opposed to like some kind of dream of making money, all those kinds of stuff, like literally love doing."}, {"time": 9026, "text": "I had a former engineer who decided to start a startup and I was like, are you sure you want to start a company versus like join something else?"}, {"time": 9034, "text": "Because being a coach of an NBA team and playing basketball are two very, very different things."}, {"time": 9042, "text": "And like not everyone fully understands the difference."}, {"time": 9045, "text": "I think you can kind of do it both."}, {"time": 9050, "text": "And I don't know, jury's out on that one because like they're in the middle of it now."}, {"time": 9054, "text": "But it's really important to figure out what you're good at, not be full of yourself, like truly look at your track record."}, {"time": 9063, "text": "What's the saying like, it ain't bragging if you can do it."}, {"time": 9069, "text": "But too many people are delusional and like think they're better at things than they actually are, or think there's a bigger market than there actually is."}, {"time": 9078, "text": "When you confuse your passion for things with a big market, that's really scary, right?"}, {"time": 9083, "text": "Like just because you think it's cool doesn't mean that it's a big business opportunity."}, {"time": 9087, "text": "So like, what evidence do you have?"}, {"time": 9088, "text": "Again, I'm a fairly like, I'm a strict rationalist on this."}, {"time": 9092, "text": "And like sometimes people don't like working with me because I'm pretty pragmatic about things."}, {"time": 9097, "text": "Like I'm not Elon, like I don't sit and make bold proclamations about visiting Mars."}, {"time": 9104, "text": "Like that's just not how I work."}, {"time": 9106, "text": "I'm like, okay, I want to build this really cool thing that's fairly practical and I think we could do it."}, {"time": 9110, "text": "And it's in this way."}, {"time": 9112, "text": "And what's cool though is like, that's just my sweet spot."}, {"time": 9115, "text": "I'm not like, I just, I can't with a straight face talk about the metaphors."}, {"time": 9119, "text": "I can't, I just, it's not me."}, {"time": 9121, "text": "What do you think about the Facebook renaming itself to?"}, {"time": 9125, "text": "I didn't mean that as a dig."}, {"time": 9126, "text": "I just literally mean like, I'm fairly, I like to live in the next five years."}, {"time": 9131, "text": "And like, what things can I get out in a year that people will use at scale?"}, {"time": 9135, "text": "And so it's just, again, those circles I think are different for different people, but it's important to realize that like market matters, you being good at it matters and having passion for it matters."}, {"time": 9147, "text": "Your question, sorry."}, {"time": 9149, "text": "Well, on that last, on this topic in terms of funding, is there, by way of advice, was funding in your own journey helpful, unhelpful?"}, {"time": 9164, "text": "Like is there a right time to get funding, venture funding or anything, borrow some money from your parents?"}, {"time": 9171, "text": "Like is money getting in the way?"}, {"time": 9174, "text": "Does it help?"}, {"time": 9176, "text": "Is the timing important?"}, {"time": 9177, "text": "Is there some kind of wisdom you can give there because you were exceptionally successful very quickly?"}, {"time": 9186, "text": "Funding helps as long as it's from the right people."}, {"time": 9189, "text": "That includes yourself."}, {"time": 9190, "text": "And I'll talk about myself funding myself in a second, which is like, because I can fund myself doing whatever projects I can do, I don't really have another person putting pressure on me except for myself and that creates strange dynamics, right?"}, {"time": 9204, "text": "But let's like talk about people getting funding from a venture capitalist initially."}, {"time": 9210, "text": "We raised money from Matt Kohler at Benchmark."}, {"time": 9212, "text": "He's brilliant, amazing guy, very thoughtful."}, {"time": 9216, "text": "And he was very helpful early on."}, {"time": 9219, "text": "But I have stories from entrepreneurs where they raised money from the wrong person or the wrong firm where incentives weren't aligned."}, {"time": 9226, "text": "They didn't think in the same way and bad things happened because of that."}, {"time": 9231, "text": "The boardroom was always noisy."}, {"time": 9233, "text": "There were fights, like we just never had that."}, {"time": 9235, "text": "Matt was great."}, {"time": 9237, "text": "I think like capital these days is kind of a dime a dozen, right?"}, {"time": 9241, "text": "Like as long as you're fundable, like it seems like there's money out there is what I'm hearing."}, {"time": 9248, "text": "It's really important that you are aligned and that you think of raising money as hiring someone for your team rather than taking money if capital is plentiful, right?"}, {"time": 9258, "text": "It provides a certain amount of pressure to do the right thing that I think is healthy for any startup."}, {"time": 9264, "text": "And it keeps you real and honest because they don't wanna lose their money."}, {"time": 9267, "text": "They're paid to not lose their money."}, {"time": 9269, "text": "The problem, maybe I could depersonalize it, but like I remember having lunch with Elon."}, {"time": 9275, "text": "It's only happened once."}, {"time": 9277, "text": "And I asked him, like I was trying to figure out what I was doing after Instagram, right?"}, {"time": 9282, "text": "And I asked him something about like angel investing."}, {"time": 9284, "text": "And he looked at me with a straight face."}, {"time": 9286, "text": "He was like, why the F would I do that?"}, {"time": 9288, "text": "Like, why?"}, {"time": 9288, "text": "I was like, I don't know."}, {"time": 9290, "text": "Like you're connected."}, {"time": 9291, "text": "Like seems like he's like, I only invest in myself."}, {"time": 9294, "text": "I was like, Ooh, okay."}, {"time": 9296, "text": "You know, like not the confidence."}, {"time": 9299, "text": "I was just like, what a novel idea."}, {"time": 9300, "text": "It's like, yeah, if you have money, like why not just put it against your bag and like enable you're visiting Mars or something, right?"}, {"time": 9311, "text": "Like that's awesome, great."}, {"time": 9312, "text": "But I had never really thought of it that way."}, {"time": 9314, "text": "But also with that comes an interesting dynamic where you don't actually have people who are gonna lose that money telling you, hey, don't do this or, hey, you need to face this reality."}, {"time": 9327, "text": "So you need to create other versions of that truth teller."}, {"time": 9332, "text": "And whatever I do next, that's gonna be one of the interesting challenges is how do you create that truth telling situation?"}, {"time": 9340, "text": "And that's part of why, by the way, I think someone like Jack, when you start Square, you have money, but you still, you bring on partners because I think it creates a truth telling type environment."}, {"time": 9351, "text": "I'm still trying to figure this out."}, {"time": 9352, "text": "Like it's an interesting dynamic."}, {"time": 9356, "text": "So you're thinking of perhaps launching some kind of venture where you're investing in yourself?"}, {"time": 9361, "text": "I mean, I'm 37 going on 38 next month."}, {"time": 9366, "text": "I have a long life to live."}, {"time": 9367, "text": "I'm definitely not gonna sit on the beach, right?"}, {"time": 9370, "text": "So I'm gonna do something at some point and I gotta imagine I will like help fund it, right?"}, {"time": 9378, "text": "So the other way of thinking about this is you can park your money in the SMP, and this is bad because the SMP has done wonderfully well last year, right?"}, {"time": 9386, "text": "Or you can invest in yourself."}, {"time": 9387, "text": "And if you're not gonna invest in yourself, you probably shouldn't do a startup."}, {"time": 9392, "text": "It's kind of the way of thinking about it."}, {"time": 9395, "text": "And you can invest in yourself in the way Elon does, which is basically go all in on this investment."}, {"time": 9401, "text": "Maybe that's one way to achieve accountability is like you're kind of screwed if you fail."}, {"time": 9406, "text": "Yeah, that's, yeah."}, {"time": 9409, "text": "I personally like that."}, {"time": 9410, "text": "I like burning bridges behind me so that I'm fucked if it fails."}, {"time": 9417, "text": "It's really important though."}, {"time": 9420, "text": "One of the things I think Mark said to me early on that sticks with me that I think is true."}, {"time": 9426, "text": "We were talking about people who had left like operating roles and started doing venture or something."}, {"time": 9431, "text": "He was like, a lot of people convince themselves they work really hard."}, {"time": 9434, "text": "Like they think they work really hard and they put on the show and in their minds they work really hard, but they don't work very hard."}, {"time": 9442, "text": "There is something about lighting a fire underneath you and burning bridges such that you can't turn back."}, {"time": 9448, "text": "That I think, we didn't talk about this specifically, but I think you're right."}, {"time": 9452, "text": "There is, you need to have that because there's the self delusion at a certain scale."}, {"time": 9459, "text": "Oh, I have so many board calls."}, {"time": 9460, "text": "Oh, like we have all these things to figure out."}, {"time": 9463, "text": "It's like, this is one of the hard parts about it being an operator."}, {"time": 9467, "text": "It's like, there are so many people that have made a lot of money not operating, but operating is just one of the hardest things on earth."}, {"time": 9475, "text": "It is just so effing hard."}, {"time": 9478, "text": "It is stressful."}, {"time": 9479, "text": "It is, you're dealing with real humans, not just like throwing capital in and hoping it grows."}, {"time": 9484, "text": "I'm not undermining the VC mindset."}, {"time": 9486, "text": "I think it's a wonderful thing and needed and so many wonderful VCs I've worked with."}, {"time": 9491, "text": "But yeah, like when your ass is on the line and it's your money, it's... Talk to me in 10 years, we'll see how it goes."}, {"time": 9501, "text": "Yeah, but like you were saying, that is a source."}, {"time": 9503, "text": "When you wake up in the morning and you look forward to the day full of challenges, that's also where you can find happiness."}, {"time": 9511, "text": "Let me ask you about love and friendship."}, {"time": 9513, "text": "What's the role in this heck of a difficult journey you have been on of love, of friendship?"}, {"time": 9521, "text": "What's the role of love in the human condition?"}, {"time": 9525, "text": "Well, first things first, the woman I married, my wife, Nicole, there's no way I could do what I do if we weren't together."}, {"time": 9533, "text": "She had the filter idea."}, {"time": 9536, "text": "We didn't go over that story."}, {"time": 9539, "text": "Everything is a partnership, right?"}, {"time": 9541, "text": "And to achieve great things, it's not about like someone pulling their weight in places."}, {"time": 9546, "text": "Like it's not like someone's supporting you so that you could do this other thing."}, {"time": 9551, "text": "It's literally like, Mike and I and our partnership as cofounders is fascinating because I don't think Instagram would have happened without that partnership."}, {"time": 9561, "text": "Like either him or me alone, no way."}, {"time": 9565, "text": "We pushed and pulled each other in a way that allowed us to build a better thing because of it."}, {"time": 9572, "text": "Nicole, she pushed me to work on the filters early on."}, {"time": 9575, "text": "And yes, that's exciting."}, {"time": 9576, "text": "It's a fun story, right?"}, {"time": 9578, "text": "But the truth of it is being able to like level with someone about how hard the process is and have someone see you for who you are before Instagram and know that there's a constant you throughout all of this and be able to call you when you're drifting from that, but also support you when you're trying to stick with that."}, {"time": 9598, "text": "That's, I mean, that's true friendship slash love, whatever you want to call it."}, {"time": 9604, "text": "But also it was for someone not to care."}, {"time": 9607, "text": "I remember Nicole saying, hey, like I know you're going to do this Instagram thing."}, {"time": 9610, "text": "You should, I guess it was bourbon at the time."}, {"time": 9612, "text": "You should do it because, you know, even if it doesn't work, we can move to like a smaller apartment and it'll be fine."}, {"time": 9620, "text": "Like we'll make it work."}, {"time": 9622, "text": "How beautiful is that, right?"}, {"time": 9624, "text": "That's almost like a superpower that gives you permission to fail."}, {"time": 9627, "text": "And somehow that actually leads to success."}, {"time": 9629, "text": "But also she's like the least impressed about Instagram of anyone."}, {"time": 9633, "text": "She's like, yeah, it's great."}, {"time": 9634, "text": "But like, I love you for you."}, {"time": 9636, "text": "Like, I like that you're like a decent cook."}, {"time": 9639, "text": "That's beautiful with the Gantt chart and Thanksgiving, which I still think is a brilliant effing idea."}]}]