[{"title": "Zach Bitter: Ultramarathon Running | Lex Fridman Podcast #205", "id": "0RTWSJAqTPg", "quotes": [{"time": 325, "text": "I mean, there's like a very contentious relationship there."}, {"time": 332, "text": "So he basically says, like, I refuse to be that person."}, {"time": 338, "text": "And he's almost like angry at that person."}, {"time": 338, "text": "It's almost like sometimes literally yelling at that person, the weak version of themselves."}, {"time": 342, "text": "And then there's another more sort of Sam Harris the approach, which is like, just observe the thought and let it go."}, {"time": 347, "text": "Maybe knowing that this too shall pass, like no matter what it, this moment will not last forever."}, {"time": 356, "text": "And kind of sort of accepting the natural flow of things and taking one step at a time and allowing whatever the negativity, whatever the pain you're experiencing just to pass, even if it means a death march, which one is more effective for you?"}, {"time": 372, "text": "Which one, like, would you say generally speaking to the population is more effective?"}, {"time": 378, "text": "Yeah, that's a really good question."}, {"time": 378, "text": "It's probably unique to the individual."}, {"time": 384, "text": "I wouldn't argue that, you know, David is finding success with his approach."}, {"time": 390, "text": "Some may argue it's an extreme version."}, {"time": 390, "text": "You know, Sam has obviously thought about these things and really probably, you know, I see those guys as kind of two ends of the spectrum in just the way that they kind of come across in general, where like David's like really at your kind of high energy and Sam's kind of this calming, soft presence and he's just going to slowly, methodically lay it all out there."}, {"time": 412, "text": "And I think there's value on in both of those."}, {"time": 412, "text": "I think most people are probably going to get a benefit from pulling some from each."}, {"time": 417, "text": "I mean, there's times where, where I need a kick in the ass and then it's like, have the strong Zach, tell the weak Zach to get moving."}, {"time": 428, "text": "But there's also times where, you know, it's just like, you know, a subtle voice entering my head about, you know, I don't know if I feel quite right now."}, {"time": 433, "text": "Should I maybe pull back on the pace?"}, {"time": 438, "text": "And I think that little subtle voice is best approached with a subtle positive voice where it's more like, okay, well let's think this through here for a second."}, {"time": 449, "text": "You're 40 miles into a hundred mile race."}, {"time": 449, "text": "You spent four months preparing for it."}, {"time": 453, "text": "Uh, you know, from the workouts you did that you're ready for this, there really isn't any real reason for you to slow down or to fall off your goal or your pace or, you know, reassess what you're doing."}, {"time": 464, "text": "Let's just give this another mile or two."}, {"time": 464, "text": "And then we can reassess if we need to, and in order to kind of figure out if I'm doing the right things or not."}, {"time": 470, "text": "And I think like in that situation, um, you definitely probably want to lean more towards the Sam Harris approach with that because there's really no reason to, it's almost like the same thing you see with like just training and even nutrition to a degree where like some folks, they just want to be like, kind of like drilled."}, {"time": 490, "text": "They want to be like yelled at and said, like, get going, get doing this."}, {"time": 490, "text": "And that helps and that motivates them."}, {"time": 495, "text": "That helps them stay accountable."}, {"time": 495, "text": "Other people need some softer love with it where it's like, you know, this isn't necessarily your thought, your, your fault."}, {"time": 504, "text": "You were put in this environment that kind of created an atmosphere of lethargy and lethargy and maybe poor nutritional choices and things like that."}, {"time": 509, "text": "And, and like, so, but it's, it's correctable."}, {"time": 515, "text": "So we need to, we need to step away from that and we need to kind of start heading in the direction that we know is going to bear fruit down the road."}, {"time": 519, "text": "And that person may respond better to that."}, {"time": 523, "text": "So I think both those guys have great value with their approaches."}, {"time": 528, "text": "They're just probably polar ends of that, of the spectrum."}, {"time": 528, "text": "And I think most people are probably going to benefit like anything, right?"}, {"time": 532, "text": "You get the polarizing ones and those are going to work right for the polarizing people."}, {"time": 536, "text": "But then most people are going to fit somewhere in the middle."}, {"time": 539, "text": "So they're probably going to be able to kind of pull from both of those if they're able to sit down and kind of like assess which one's going to work better in which situation."}, {"time": 543, "text": "So the quitting thing that you mentioned, the, like the final stage, which actually I get to much quicker than you seem to, which is like, why am I doing this?"}, {"time": 553, "text": "I get there with basically anything I do."}, {"time": 559, "text": "It's like, this is, this is probably the stupidest thing I've ever done is the feeling I get often."}, {"time": 566, "text": "And then immediately you have these excuses that are like, there's all these other better things you should be doing."}, {"time": 570, "text": "Or, or the other alternative of that, like you said, I'm not prepared enough for this moment."}, {"time": 577, "text": "I'll be much more prepared in two weeks for the next event."}, {"time": 577, "text": "So like, why let's try this again."}, {"time": 582, "text": "Let's start over."}, {"time": 582, "text": "Let's start over in two weeks."}, {"time": 587, "text": "How do you deal with that quit?"}, {"time": 587, "text": "Like, so maybe do you still go through that process and and by way of advice for people that are more sort of amateurish like me, how to deal with that quitting voice?"}, {"time": 601, "text": "I think a lot of times when the quitting voice kind of comes in, it, what it does is it kind of just, it comes in with the added disadvantage, I guess, in this situation of being kind of a narrow scoped view where you're looking at like, what it's doing to you in the moment or how you're feeling in the moment versus how are you feeling about the whole process?"}, {"time": 623, "text": "So one thing that I started doing in 2019, and I think, I don't think it's necessarily, I think, I think, I think this was a big reason why I had one of my best racing seasons in 2019 that I'd had to that date."}, {"time": 637, "text": "It was part of it was I started, I think, putting a little more emphasis on the big picture versus putting emphasis on like, this is one opportunity or one day of work."}, {"time": 649, "text": "And this is one, one emotional kind of flare up."}, {"time": 657, "text": "But how does that actually relate to my general broader picture?"}, {"time": 657, "text": "So when I decide to do a race or an event or something like that, it's often four, six months out ahead of time, you're planning to like kind of do a series of workouts and a flow of things where you're going through the process of getting fit, getting ready, preparing for the specifics of the day and all that stuff."}, {"time": 676, "text": "And then you get to the race itself or the event itself."}, {"time": 676, "text": "And it's very easy to look at that and think that's an isolation."}, {"time": 680, "text": "Like I'm going to run 12 hours today, or I'm going to run a hundred miles today or whatever it ends up being."}, {"time": 686, "text": "And it's a lot easier to quit when you think to yourself, I'm 40 miles into a hundred mile race."}, {"time": 691, "text": "You know, that's just a 40 mile run, which sounds kind of silly to most people, but in perspective, then we're talking about the ultra marathon running community."}, {"time": 703, "text": "You know, it's a lot easier just to say like, well, you know, I'll scrap this 40 miles and try again."}, {"time": 707, "text": "It's a lot harder to say I'm going to scrap the entire last four months, the entire reason why I was doing it, the countless hours I spent in there."}, {"time": 718, "text": "So I think I just try to reposition it of like, I'm in a bad place right now, maybe in my head or I'm not, I'm hitting a low point here, but I'm 99% of the way towards the goal I set out four months ago when I add in all the work I did leading up to that."}, {"time": 732, "text": "So I think it's important to ask yourself why, because, I mean, there are times when you're doing something and you ask yourself why, and you don't have a good reason."}, {"time": 738, "text": "And then maybe it is advantageous to step back and really reflect on that and decide, is this something I actually want to invest time and energy into?"}, {"time": 747, "text": "Because, you know, someone like yourself who is very much into a variety of different things, it can be easy probably to overextend and get, I mean, I'm a very curious person."}, {"time": 760, "text": "So there's like a hundred things I would love to do if I wasn't doing what I'm doing."}, {"time": 764, "text": "And I know how to enjoy all of them."}, {"time": 764, "text": "So at a certain point though, you have to say, okay, which one is going to be the most meaningful for me?"}, {"time": 769, "text": "And if the answer keeps coming back to saying, I guess this is still the most meaningful to me out of that a hundred things that I could otherwise be doing, then I know that I'm in it for the right reason."}, {"time": 782, "text": "Then I just need to identify some of those things like, well, why did this one take the top spot out of the hundred things that I could have picked from?"}, {"time": 787, "text": "And keeping like a list of those in your head so that when you get to that point where you start saying, why am I doing this?"}, {"time": 791, "text": "Why am I here?"}, {"time": 796, "text": "You just have those kind of ready loaded in your head to say, well, I already took inventory on that before I started this."}, {"time": 800, "text": "And I knew this voice was going to come at some point, whether it's early, middle or late."}, {"time": 803, "text": "And then you just remind yourself kind of what you were thinking when you had a little more of a level head."}, {"time": 808, "text": "Well, there's something about the thing you mentioned when you mentioned the death march."}, {"time": 812, "text": "It seems extremely valuable to just never quitting."}, {"time": 812, "text": "Like in the moment, if you decide to do something, like never quitting, even if you do go through the process and realize that it's not the wisest thing to be doing within the full context of your life."}, {"time": 833, "text": "Like once you decide to do it, it seems like never quitting prevents you from sort of having that escape clause from other things in your life."}, {"time": 840, "text": "So I've quit on a few things in my life."}, {"time": 840, "text": "And I think I still, I deeply regret that because it opened that door."}, {"time": 846, "text": "It's almost like a muscle."}, {"time": 854, "text": "So I think I'm, I don't know, maybe everyone is, but I think I'm kind of a quitter."}, {"time": 861, "text": "Like I'm really good at coming up with reasons to quit."}, {"time": 867, "text": "My mind is really good at that."}, {"time": 867, "text": "And I, it feels like I have to come up with, like really work hard to make sure that there's no quit."}, {"time": 873, "text": "That I never allow myself to quit no matter how stupid the thing I'm doing is."}, {"time": 879, "text": "I don't know if that any of that makes sense, but it just, maybe to rephrase this whole thing."}, {"time": 885, "text": "Do you think it's good to live life by the ethos of never quit?"}, {"time": 892, "text": "Yeah, that's a really interesting thing."}, {"time": 892, "text": "And I think it actually resonates with a lot of ultra marathon runners because there seems to be a trend when you have someone who's been in the sport for a long time where there's a point where they start the sport, right?"}, {"time": 903, "text": "And they're like, super excited about everything."}, {"time": 908, "text": "Everything's new."}, {"time": 908, "text": "It's very easy not to quit because you're like, Oh, this is the first time I've ever run a 50 case."}, {"time": 913, "text": "The first time I ever run a 50 miles, the first time I ever in a hundred case, first time I ever in a hundred miles and so on and so forth."}, {"time": 920, "text": "And when you're doing that for the first time, I think there's a heightened motivation to not quit because you don't want your first attempt to be a failure."}, {"time": 927, "text": "And then you get a little further along and you start reflecting on the landscape and all the opportunities that are out there and you find yourself quitting on an event."}, {"time": 938, "text": "And there does seem to be a trend where once you do that once, now all of a sudden, like you, like you described perfectly that quit pops up in your head maybe a little sooner than next time or maybe a little bit before."}, {"time": 950, "text": "And I've certainly had these experiences in my career as well."}, {"time": 954, "text": "And what happens, I think if you stick with it, again, I think it is important to assess whether you really want to be doing what you're doing."}, {"time": 961, "text": "But if you start recognizing that about yourself in a certain activity where it's like, I think I might be pulling the plug early on some of this stuff."}, {"time": 970, "text": "I think you just need to kind of get into a position where you just at that point, you need to make a decision."}, {"time": 976, "text": "Do I want to keep doing this?"}, {"time": 976, "text": "If the answer is yes, you hold yourself accountable to not quitting."}, {"time": 980, "text": "And eventually what will happen is you'll find yourself in a position where I'll use ultra marathons, for example, where you're just clicking on all cylinders for that day."}, {"time": 990, "text": "And you still get those scenarios where doubt creeps in your mind."}, {"time": 990, "text": "You have these low points, but for whatever reason, when those low points are high, you're going to find yourself in a reason when those low points come, you're able to push through them better than you would have in the past."}, {"time": 1003, "text": "And then you push through maybe two or three more than you did after you had quit the time before."}, {"time": 1008, "text": "Then it's accountability time, right?"}, {"time": 1008, "text": "Because then you have to look back at that and say, well, why did this time, was I able to be mentally more strong and kind of push through those extra opportunities to quit when I wasn't before?"}, {"time": 1022, "text": "And it can be easy to look back and say, and live kind of retroactively in the sense where you're regretting, well, why did I drop out of those races?"}, {"time": 1032, "text": "Why did I do this wrong there?"}, {"time": 1032, "text": "And I just think that's where you have to kind of catch yourself and say, no, those things happened to me in order to put me in a position where I decided, well, this time I'm not going to quit no matter what, minus my leg falling off."}, {"time": 1041, "text": "I'm not going to quit."}, {"time": 1047, "text": "And then you put yourself in a position to have that day where you push through more times than you ever have before."}, {"time": 1051, "text": "And you just redefine what you're capable of."}, {"time": 1051, "text": "And then once I think you do that, you start looking at those earlier lessons as, as lessons, you know, were they failures on paper at the time?"}, {"time": 1061, "text": "But can you pull things from them to learn as to like, well, where is your actual threshold?"}, {"time": 1067, "text": "Where is the limit actually for you?"}, {"time": 1067, "text": "And then kind of start redefining that stuff."}, {"time": 1072, "text": "Um, so I think like the never quit mentality can be good in certain situations, but I don't think it's necessarily like a, like a holistic thing where you need to be in something where it's never quit, always do more."}, {"time": 1085, "text": "Cause then you end up in a situation where you find this like margin of diminishing returns, especially when it comes to training and workouts and things like that, where there are times where often there are times where you want to actually quit a little bit before you would have to, because the stress that was required to elicit a, a growth response has already occurred."}, {"time": 1103, "text": "And then just to do more is just going to require more recovery time to get back and do it again."}, {"time": 1107, "text": "This is the tricky trade off living by the never quit mentality."}, {"time": 1113, "text": "You're not going to achieve optimal performance in your head."}, {"time": 1113, "text": "You might."}, {"time": 1119, "text": "It seems like when you look at the full arc of human history, the people who do great things are more leaning towards the never quit."}, {"time": 1125, "text": "Like, uh, I feel like at any one moment you're more in danger of quitting than you are being suboptimal."}, {"time": 1133, "text": "So like, um, in terms of advice, it just feels like never quitting is always the right advice."}, {"time": 1140, "text": "Unless you deeply know the person, maybe this is like wrestling mentality."}, {"time": 1149, "text": "I've seen too many, and because I'm annoyed with the current culture telling me to relax and, and, uh, have a work life balance and all those kinds of things, uh, which all have a deep, deep truth to them."}, {"time": 1159, "text": "But the reality is like, there's not enough people that walk up to me and like slap me and say, get your shit together."}, {"time": 1167, "text": "Like don't quit, work harder."}, {"time": 1175, "text": "I think we need to hear that more."}, {"time": 1175, "text": "I, and like, I remember that, um, from the wrestling rooms, like that when you're pushed that way, when you're forced to the very limit and you don't quit, that makes better humans."}, {"time": 1188, "text": "I think people need to get that in their life."}, {"time": 1188, "text": "I think they need to have situations where that becomes kind of the reality for them so they can see that avenue, experience that avenue, um, where I think it's maybe to the extreme as if it becomes like your entire life philosophy where like every little thing you do is never quit."}, {"time": 1208, "text": "But life is short, Zach."}, {"time": 1208, "text": "I mean, this is the problem I have."}, {"time": 1215, "text": "This is probably the programming thing too is over optimization is dangerous."}, {"time": 1221, "text": "Uh, it's like every once in a while, I mean, you're, you do this kind of stuff."}, {"time": 1228, "text": "You're not, for example, with a hundred mile run, you're, I mean, you could just be doing that for the rest of your life and do like the most optimal hundred mile run ever, but you keep taking on like new challenges and there's a lot more chaos in that."}, {"time": 1238, "text": "And there it feels like the muscle of never quit will be much more important than the optimality of your training."}, {"time": 1244, "text": "So there's probably a couple sides to me with that kind of a thing where for one, I think when we talked about the why, so like, I think the why can kind of shift a bit and it probably will if you do something long enough or evolve maybe is a better way to call it, to put it."}, {"time": 1261, "text": "And for me, like one of my my big drives and one of my big passions within ultra running is to first of all, find an event that I really, really love to train for and participate in."}, {"time": 1275, "text": "So for me, I feel like I've kind of identified that to a degree and that's kind of runnable hundred milers."}, {"time": 1278, "text": "So once I found that it became more of a driver for me to see like, well, how fast can I run a hundred miles in a very controlled environment?"}, {"time": 1291, "text": "So let's eliminate weather, let's eliminate, you know, elevation, let's eliminate like having to wait extra long to get crew or support and that sort of thing."}, {"time": 1301, "text": "And that's how you find yourself on a 400 meter track running a hundred miles."}, {"time": 1301, "text": "But for me, like the important part of that is that I can control the environment enough where if I come back year after year, I can retest myself and have a decent ability to kind of say I improved or I regressed or I stayed stagnant."}, {"time": 1318, "text": "And I think that's a big driver for me."}, {"time": 1318, "text": "But one thing I've recognized within that is if you just keep doing that, like if I could probably pick three flat runnable hundred milers a year and optimally prepare, race, recover and repeat without like burning myself out."}, {"time": 1362, "text": "So almost like happiness."}, {"time": 1362, "text": "Well, here's the example."}, {"time": 1368, "text": "Like, I mean, I love running in trails to most people would consider me a flat road track runner, runnable ultra runner."}, {"time": 1372, "text": "But I like to do trail runs too."}, {"time": 1372, "text": "So and at the end of two thousand and eighteen, I recognized that I had been kind of pushing the gas pedal on trying to run fast hundred milers for quite a while without really a break in that where it was like, OK, I did one."}, {"time": 1390, "text": "Now I'm going to take a brief off season, but then I'm going to ultimately build up and peak for another one."}, {"time": 1395, "text": "I might introduce some fun trail races in the context, but they're going to be races are going to be training races, time on feet type of stuff that are going to kind of mimic like a long run, essentially."}, {"time": 1403, "text": "And but the main focus always in the back of my mind was like getting on the track and seeing how much faster I can run a hundred miles."}, {"time": 1408, "text": "And that just kind of that energy that it takes to continually think by that, that I think the motivation to keep that stoke high enough to really meet your full potential fades if you don't step away from it for a little bit."}, {"time": 1423, "text": "So I took essentially half a year away from runnable stuff and just decided I'm going to prepare for the San Diego hundred mile, which is like a much more elevation, technical trail type of an event."}, {"time": 1435, "text": "Is that a trail run or no?"}, {"time": 1435, "text": "It's a trail hundred miler actually just kind of just outside of San Diego."}, {"time": 1442, "text": "And yeah, it goes through it goes over part of the Pacific Crest Trail and stuff."}, {"time": 1448, "text": "So it's very different than running on a runnable surface."}, {"time": 1448, "text": "So to give you some context, like I ran was I think just under 17 hours for that race, whereas on a flat surface I can run 11 hours and 19 minutes."}, {"time": 1458, "text": "So just the environment alone added an extra, you know, five plus hours to the day."}, {"time": 1464, "text": "So it's just a different experience, different skill set."}, {"time": 1470, "text": "And what it did is it allowed me to kind of step away from kind of focusing on like splits on a track, running flat stuff, like preparing for things specifically for a flat environment and start training for something that's more climbing and descending, more technical running skill sets and things like that."}, {"time": 1486, "text": "And the cool part about it was, first of all, you know, when you step away from something and after something a lot different, I mean, it's still running."}, {"time": 1495, "text": "There's still a huge advantage I had from the running I'd done in the past that was going to put me in a good position to be successful."}, {"time": 1500, "text": "But there was a much higher or a much bigger range of potential improvement for me."}, {"time": 1506, "text": "So through the like four plus months I spent preparing for that race, you know, I noticed, oh wow, I'm getting faster on this climb or I'm getting better at descending this technical trail."}, {"time": 1517, "text": "It was one of the most fun races I've run actually."}, {"time": 1517, "text": "So it was kind of a cool experience."}, {"time": 1521, "text": "I ended up taking the lead at like 93 miles."}, {"time": 1521, "text": "So you were racing, racing, like you were trying to get first."}, {"time": 1527, "text": "So it's still a race."}, {"time": 1527, "text": "So what was the enjoyable aspect of it?"}, {"time": 1531, "text": "I don't think I've recognized it so much while I was doing it actually."}, {"time": 1531, "text": "It surfaced afterwards."}, {"time": 1531, "text": "I mean, the enjoyment of the race itself is like when you find yourself in a position where you're sitting in basically second place all day long and then you take the lead at 90, I think it was like 91 or 92 miles."}, {"time": 1544, "text": "It's like, yeah, that's kind of a cool way to race."}, {"time": 1544, "text": "But afterwards I recognized a few things just about kind of pacing and you know, how to maybe pace the first half of a hundred miler versus a second half."}, {"time": 1557, "text": "I also recognized shortly thereafter once I finished or covered and decided my next event was going to be a flat runnable race that, wow, I really was way more excited to do the workouts that I needed to do to get ready to run a fast, flat hundred miler."}, {"time": 1575, "text": "And I don't think that would have been the case had I just tried to do another flat, fast hundred miler earlier or during that year and end up in a situation where like I maybe had like normalized a suboptimal like outlook on like something that I had just done so many times already."}, {"time": 1592, "text": "And I recognize that it was just every workout I did."}, {"time": 1592, "text": "I was like, I did this workout a year ago and it was not nearly this much fun."}, {"time": 1596, "text": "And our, you know, the interesting thing about these track hundreds too, is like you find yourself doing like your peaking phase where you're running your long runs, which for me are usually like, you know, around 30 miles or so, and I'll do them on back to back days."}, {"time": 1609, "text": "And you know, I try to replicate the environment I'm going to race on."}, {"time": 1614, "text": "So I'm finding myself on a 400 meter track."}, {"time": 1614, "text": "And it's like when I started doing that again, I just felt like I was super motivated to go out there Saturday and Sunday and do those back to back long runs and see the progress and then head out again the next week and do it again."}, {"time": 1626, "text": "So I had some of my more enjoyable long runs, which are going to be the most specific to the race day environment that I had in quite some time."}, {"time": 1630, "text": "And I think that was really beneficial and kind of putting me in the right spot to be able to push through barriers on race day and put me in a position where quitting was going to be much less of a likelihood, given the enjoyment I had in the months leading into the race itself."}, {"time": 1646, "text": "Yeah, even the thought of quitting."}, {"time": 1646, "text": "So you mentioned the track, you've also ran 100 miles on the treadmill, and the trail 100 mile."}, {"time": 1651, "text": "Broadly, if we zoom out, what does it take to run 100 miles?"}, {"time": 1658, "text": "For most of the world, that seems like a crazy distance to run."}, {"time": 1666, "text": "So maybe it's interesting to ask, not only is just setting the world record, but purely running, what does it take to run that far?"}, {"time": 1670, "text": "Yeah, I mean, I think people probably overestimate what it takes in terms of just getting it done."}, {"time": 1676, "text": "I think this is consistent in just running in general."}, {"time": 1682, "text": "I think the marathon was always a big one with that where people thought like, well, you have to do this training, or you just literally won't physically be able to complete a marathon."}, {"time": 1692, "text": "And then we got into an era of kind of like, running as more of an enjoyment thing versus a performance thing."}, {"time": 1697, "text": "And then you'd have people running, granted much slower."}, {"time": 1697, "text": "I think if you look at the Boston Marathon average finishing times, it goes from like, or maybe it wasn't the Boston Marathon, it might have been marathons in general, went from like three hours to five hours or something like that."}, {"time": 1709, "text": "So it's like, people, I think got past the fact that you can only do it if you're optimally prepared to, well, I can do it and maybe not meet my full potential if I'm going to like, not do much training, which I wouldn't necessarily advise."}, {"time": 1719, "text": "But I mean, I've I've talked to people who basically run 100 miles, sometimes almost off the couch."}, {"time": 1725, "text": "And it's like, it's, to me, what that says is just the human body is incredible, and what it can tolerate above and beyond what it's been exposed to, if it has to, or if it feels like it has to."}, {"time": 1738, "text": "So that's the basic sort of getting from point A, from the start to the finish."}, {"time": 1738, "text": "It's the human body and the human mind is capable of doing it without much preparation."}, {"time": 1744, "text": "But then you start to increase the goal of performance, and you try to get actually a good, like, the most out of your body that you can."}, {"time": 1756, "text": "How does that start to change then?"}, {"time": 1756, "text": "Yeah, going from fun to performance?"}, {"time": 1756, "text": "Yeah, I think once you start putting marks or goals on outside of just finishing, that's where it starts getting interesting."}, {"time": 1767, "text": "Because now you could maybe go on with multiple goals where like, if one falls off due to something that you didn't expect, then you have another one to target."}, {"time": 1771, "text": "But you can always build those up and try to think like, well, I want to run faster than last time, or I want to, you know, break a course record or an age group record or something like that."}, {"time": 1779, "text": "And that that I think is just going to be a little bit of a different mindset."}, {"time": 1786, "text": "Because now you're looking at every little thing from what do I need to do to prepare as well as what I need to do to be efficient on the day itself."}, {"time": 1795, "text": "So like transitioning aid stations and things like that, or do I want a pacer or not?"}, {"time": 1801, "text": "Or does this race allow someone to like hand me a bottle at a certain spot?"}, {"time": 1801, "text": "Or do I have to be in specific areas to get that type of stuff?"}, {"time": 1807, "text": "And it what ends up doing is it ends up bringing a lot more variables to the table."}, {"time": 1812, "text": "And I think it's interesting, because there's always going to be more variables on the day than you are able to account for."}, {"time": 1817, "text": "So at a certain degree, you have to kind of find yourself in a position where I'm going to make sure I take care of the big ones, or the ones that are like, obviously, I need to be ready for like, my fueling strategy, my hydration strategy, my pacing strategy, what workouts are going to put me in a position to physiologically have this process go as well as possible?"}, {"time": 1838, "text": "How am I going to like, you know, hold myself accountable in aid station transition, so I'm not like having a ton of non moving time versus moving time and things like that."}, {"time": 1849, "text": "So there's these like, big variables that you're aware of, and you're trying to optimize over the space of variables."}, {"time": 1854, "text": "So you get to start to play with that."}, {"time": 1854, "text": "When you're looking for performance, it's almost like moving from checkers to chess, right?"}, {"time": 1879, "text": "Or, you know, which one of these pacing strategies is going to get me to the finish line faster than the other one and that sort of stuff."}, {"time": 1884, "text": "So it gets more complicated, more interesting, and in my opinion, anyway, also, there's I mean, but there's a breaking point with that too, because, like I said, there's an endless number of variables you could account for."}, {"time": 1895, "text": "And there's a distance gets longer, that list gets longer too."}, {"time": 1900, "text": "So you find yourself in this position where, where you have to at some point say, okay, I've accounted for everything I can reasonably account for."}, {"time": 1910, "text": "Now I need to be in a mental space where when something happens that I wasn't able to account for, I'm able to respond to it with the right decision and keep going and not dwell on it."}, {"time": 1920, "text": "Because that's another thing."}, {"time": 1920, "text": "I mean, you're running slow enough when you're doing 100 miles, where if you make a mistake, you can sit there and just fixate on that mistake and say, why did I do that?"}, {"time": 1928, "text": "That cost me 10 minutes, blah, blah, blah, blah."}, {"time": 1928, "text": "When in reality, what you need to do is that happened."}, {"time": 1932, "text": "Everyone else out here is gonna have a situation like that at some point."}, {"time": 1932, "text": "Mine happened now."}, {"time": 1936, "text": "I need to figure out how I can move forward at the fastest sustainable pace and not think about what happened back there."}, {"time": 1942, "text": "And that's where I think it gets really interesting."}, {"time": 1942, "text": "What would you say it takes to set a world record in the 100 miler?"}, {"time": 1948, "text": "First of all, I think you probably have to focus on that specific event."}, {"time": 1954, "text": "I mean, there's the interesting thing about ultra running where it maybe deviates a bit from just other endurance sports is there's such a wide range."}, {"time": 1960, "text": "I mean, we talked about a little bit when I talked about the San Diego 100 versus kind of flat runnable stuff."}, {"time": 1965, "text": "So can you maybe paint a picture of what are there's a huge range of different kinds of ultra marathon events?"}, {"time": 1975, "text": "What are like, the big ones in your mind?"}, {"time": 1975, "text": "So marathon, we know the distance for a marathon."}, {"time": 1981, "text": "There's 50k, what are different kinds of there's 100 mile that in your mind, like kind of these islands where, where people gather off?"}, {"time": 1987, "text": "So there's a few that really stand out."}, {"time": 1987, "text": "I would say the three biggest ultra marathons right now, even from a historic, maybe not necessarily a historical standpoint, but in modern day ultra running is going to be the Western States 100."}, {"time": 2004, "text": "That's the biggest, most competitive 100 miler."}, {"time": 2004, "text": "It's on the trail side of things in the United States."}, {"time": 2009, "text": "Then there's ultra trail Mount Blanc, which is probably the most competitive 100 miler on the planet right now."}, {"time": 2013, "text": "In previous years, it's been debatable as whether Western States or ultra trail Mount Blanc is more competitive."}, {"time": 2017, "text": "I think in the most recent few years, you're just seeing a lot more like of the bulk of international talent on the trail side of the sport heading over that way."}, {"time": 2027, "text": "And then you have the road running side of things where the comrades marathon, which is technically 56 miles, but they call it the comrades marathon, is going to generally be the most competitive ultra marathon."}, {"time": 2036, "text": "The weird thing is the distance thing, right?"}, {"time": 2041, "text": "Cause most people in the think of endurance sports, they're thinking about precise distances, like five kilometers, 10 kilometers and all that stuff."}, {"time": 2044, "text": "And then, then you get into the ultra running world and it's like, sometimes it's the event."}, {"time": 2048, "text": "So like the Western course itself is much more important than the distance, right?"}, {"time": 2052, "text": "So the Western States 100 is actually 100.2 miles, which isn't that big of a deviation when you think about it, especially when you figure like tangents are going to probably account for more than 0.2 miles on a hundred mile race."}, {"time": 2064, "text": "But the ultra trail Mount Blanc, you know, that's listed as a hundred mile, but it's actually, I think like 104, 105 miles."}, {"time": 2069, "text": "So, you know, it's more, there's different cultures too."}, {"time": 2074, "text": "So the United States is definitely more motivated, I think, to try to get as close to the exact distance."}, {"time": 2079, "text": "You're going to hear maybe a little more grumbling."}, {"time": 2079, "text": "If someone says, I signed up for this hundred mile and it turned out to be 103 miles versus like over in Europe, they don't really care too much about the distance."}, {"time": 2087, "text": "They're more interested in like a specific route or a loop."}, {"time": 2090, "text": "Is consistency important in terms of the exact length of the, of the route?"}, {"time": 2095, "text": "So like you can compare performances from previous years, or are they a little bit more flexible?"}, {"time": 2098, "text": "Like they redefine the trail from year to year."}, {"time": 2103, "text": "I mean, it's definitely hard to compare."}, {"time": 2103, "text": "I mean, there's events that take, for example, I would say the best ultra marathoner in the world today on the men's side is Jim Walmsley."}, {"time": 2116, "text": "The reason I think Jim Walmsley is the best is because he is the most versatile and not only the most versatile, but he's arguably the best at almost everything up to a hundred miles."}, {"time": 2125, "text": "So there's a race called the Angela's crest hundred miler."}, {"time": 2125, "text": "They, the trail has drastically changed from when they originally had that event and it's a different time of year."}, {"time": 2131, "text": "So it's much warmer on that course."}, {"time": 2136, "text": "And Jim's not the kind of guy who would sit back and say like, I can't chase that record."}, {"time": 2142, "text": "But I think Angela crest, when he looks at the segments and the pacing for that one, he's like, that one is maybe not even the same event anymore."}, {"time": 2146, "text": "So you have that, you have some that are a little more controlled and a little more kind of like preserved, I guess you would say, but I think it gets really rare on the trail side."}, {"time": 2155, "text": "I mean, comrades is going to be very comparable from one year to the next because that's a road race."}, {"time": 2159, "text": "And that's where you get, you maybe get like the split in the sport from people who really want that kind of like, I want to compare myself to someone who ran this course in 1970 versus like someone who just says, I want to be competitive today."}, {"time": 2174, "text": "And you know, maybe the weather is going to be 30 degrees different from one year to the next on this course."}, {"time": 2179, "text": "But if I beat everyone on this day, then I'm the champion of that big name race, like ultra trail Montblanc or Western States, 100."}, {"time": 2186, "text": "And my legacy will be cemented because I won that big race."}, {"time": 2186, "text": "And it doesn't matter when or how the course was or what the time even was to some degree."}, {"time": 2191, "text": "When you were optimizing for trying to set the world record in the hundred miler, were you doing like analysis of maybe like what were the variables you were looking at?"}, {"time": 2203, "text": "Is it more in the realm of the actual race day, the track, what it looks like versus like the variables of the training leading up to the, to the race?"}, {"time": 2216, "text": "I mean, it evolved a bit."}, {"time": 2216, "text": "Like, I think the, as I learned more about just like, what is required to kind of really do that stuff."}, {"time": 2221, "text": "So there's some variables you can control for, you know, I try to control for as many as I can."}, {"time": 2227, "text": "The big one that kind of stands out that you can't necessarily control for is it's pretty rare where you get an event where they're just doing a hundred miles on a track."}, {"time": 2235, "text": "It's usually like a, like an event of like a series of different events where they might be like some people out there doing 50 K, some people out there doing 24 or something like the event I did at, there was six day folks out there."}, {"time": 2246, "text": "They're trying to see how far they could get in six days."}, {"time": 2248, "text": "So you have like this much wider range of pacing just due to like the distance."}, {"time": 2254, "text": "So, you know, track protocol is always like you pass on the outside."}, {"time": 2254, "text": "So if you're running one of the faster paces of the day, which when you go on up to six days, you're going to, and you're doing a hundred miles, you're probably going to be running faster than most people out there."}, {"time": 2270, "text": "Then, you know, you just end up running more because you end up running in lane two around the turns and then sometimes lane three around the turns."}, {"time": 2274, "text": "So it's down to those little details that have a big impact."}, {"time": 2277, "text": "So I had to build that into my pacing strategy."}, {"time": 2277, "text": "I also have to build into the pacing strategy, like relative nonmoving time."}, {"time": 2281, "text": "You know, I did a race just recently, it was the US track and field hundred mile road championships."}, {"time": 2288, "text": "And I did not stop once other than like, I guess I technically stopped like in the aid station for like a few seconds to like grab bottles and get myself wet."}, {"time": 2297, "text": "Cause it was like 94 degrees that day, but I didn't like stop at all during that race from like what I would say is like a long period of time where we're getting up to like a minute, but that's pretty rare."}, {"time": 2308, "text": "Even on the track, like when I ran 11 hours and 19 minutes, I think I stopped three times for maybe a total of like, I believe I have to look back for sure, but I think it was like three to four minutes or something like that."}, {"time": 2318, "text": "So you got to, you got to figure that into your pacing strategy, especially if you're chasing a specific time."}, {"time": 2326, "text": "Cause you know, if I'm pacing for, you know, at the time the world record was 1128."}, {"time": 2326, "text": "So if I'm pacing for say 1127, 30 or something like that, and I don't account for that three minutes of stoppage, then I might run the exact pace I had planned on, but then I'm a minute off of the world record."}, {"time": 2342, "text": "So 1128, we're talking about 11 hours, we're talking about a hundred miles."}, {"time": 2342, "text": "Can you mention what the world record was?"}, {"time": 2347, "text": "What kind of world record you set?"}, {"time": 2347, "text": "Can you tell your own story here of what you were able to accomplish that world record that I broke actually just recently got rebroke by a guy over in Lithuania, Alex Sorkin, phenomenal race."}, {"time": 2358, "text": "I mean, he's won the 24 hour world championships."}, {"time": 2368, "text": "He's won the Spartathlon, which is another big historic ultra marathon rates, 153 miles."}, {"time": 2372, "text": "So it's getting a little more lengthy than some of the stuff that I've traditionally done."}, {"time": 2375, "text": "He ran 1114, I believe it was 56 or 57."}, {"time": 2375, "text": "So his pace was 645 per mile."}, {"time": 2375, "text": "Mine was 647 and a half in terms of just like the pacing strategy."}, {"time": 2384, "text": "I mean, it's, it's just really cool because for me, the motivation with chasing the world record was, it was multifaceted."}, {"time": 2389, "text": "I think there was, as I kind of moved through, cause I mean, it took me almost six years from the day I decided I wanted to chase that time to the day I actually did it."}, {"time": 2402, "text": "And through that five to six years, I think I merged from just like my number one goal was to try to break the world record to my number one goal is how fast can I run this thing?"}, {"time": 2416, "text": "And then ultimately what needs to be done for a human to break 11 hours in a hundred miles."}, {"time": 2422, "text": "Cause I think that's going to be, I think that's going to happen soon."}, {"time": 2425, "text": "I think it's going to happen in the next few years."}, {"time": 2425, "text": "What pace would that be?"}, {"time": 2431, "text": "Sub 11 would be, I think like, I think it's like 635 right about per mile."}, {"time": 2431, "text": "You're moving quick, but not so quick that like you're, you're, you know, void of being able to think about everything as it's happening."}, {"time": 2443, "text": "So what's the pace in terms of, if you look for each of the one mile segments for the hundred miles, is it pretty steady six, like in order to break 11 hours, would it be pretty steady 635?"}, {"time": 2457, "text": "Does it go up and down?"}, {"time": 2457, "text": "Do you speed up at the very end?"}, {"time": 2457, "text": "Like what's, what's the pacing?"}, {"time": 2463, "text": "If you were to maybe how much variability is there in the pacing for an optimal performance here?"}, {"time": 2469, "text": "So if you're talking about someone, let's say that there was someone, well, let's just take me for example, let's say that we could just like, we had this infinite knowledge and we knew for a fact, a perfect performance for me would produce a 10 59, but I'm not going a second faster and I need to do everything right in order to run a 10 59."}, {"time": 2481, "text": "Uh, I would definitely want to either have a slight negative or slight positive split."}, {"time": 2489, "text": "So when, um, and I think there's, I think there's a, there's a range in there where like being a little bit faster the first half and the second half isn't going to necessarily change your outcome or being a little bit slower the first half and a little bit faster."}, {"time": 2507, "text": "The second half isn't going to drastically change your outcome."}, {"time": 2512, "text": "So that's what you're referring to."}, {"time": 2512, "text": "The split is you're looking at the first 50 miles and the second 50 miles."}, {"time": 2515, "text": "And you can break it down as tiny as you want."}, {"time": 2515, "text": "Like I think, uh, when you take out the outlier laps where I stopped to use the bathroom, which would have been that like three to four minute nonmoving time that I talked about before, my splits were really tight."}, {"time": 2528, "text": "Um, I had a couple that were, um, it was weird cause that, that track that I did that on was actually like 400 and some weird number, like 400 and like 38 meters or something like that."}, {"time": 2533, "text": "So I actually like ran like my numbers based on that."}, {"time": 2539, "text": "So they're there normally I'm dealing with 400 meters and then it's a little more like clean as to like what my lap splits are going to range from one event to the next."}, {"time": 2549, "text": "So we're talking about running a hundred miles on a track."}, {"time": 2552, "text": "And so that you can be really scientific about getting the, the, this, the, um, the pacing, right."}, {"time": 2560, "text": "And, uh, you're, you're running on the inside lane or is there some kind of tricks to this?"}, {"time": 2565, "text": "Like, are you alternating directions?"}, {"time": 2565, "text": "They'll switch directions at most events every four hours."}, {"time": 2571, "text": "So you'll do four hours one way and then they usually put a cone out."}, {"time": 2571, "text": "And once it hits like, like, let's say it hits four hours, you finish the lap you're on and then you do a loop around and then you start the next, your next lap."}, {"time": 2582, "text": "Would you say you take the exact same number of steps?"}, {"time": 2586, "text": "Like when you're really in the groove, when you take in the pacing, are we talking about that level of precision or is it a little bit more feel?"}, {"time": 2592, "text": "You mean like foot strike frequency?"}, {"time": 2598, "text": "Like frequency then over the distance to the lap."}, {"time": 2598, "text": "Would you say it's so precise that you're like, you get in this groove where it's like, gosh, you're making me wish I would have strapped more like a foot pod to my head."}, {"time": 2608, "text": "But like, yeah, so I think like my guess is it's pretty precise."}, {"time": 2614, "text": "Like is there a video of this?"}, {"time": 2614, "text": "I keep interrupting."}, {"time": 2614, "text": "Is there a video of this?"}, {"time": 2614, "text": "Cause I, I've actually, this is now three years ago, build a computer vision algorithm that counts foot strikes."}, {"time": 2624, "text": "For fun."}, {"time": 2624, "text": "I was trying to understand, uh, we'll talk about this later."}, {"time": 2630, "text": "We have the same definition of fun when I got my, find myself on a track for all day and you find yourself counting foot strikes."}, {"time": 2635, "text": "I was trying to understand if, if there's how much variability there's in a extreme, like elite performers within a particular race, but also across races."}, {"time": 2648, "text": "It was just interesting to me from a robotics perspective, if like how much variability there is in the human body and in the way they use legs to move quickly."}, {"time": 2654, "text": "I think my guess would be that at the individual level, it's going to be pretty precise, assuming the pacing is consistent."}, {"time": 2665, "text": "So you get, so my pacing on that day, I ran two minutes faster the second 50 miles than I did the first 50 miles."}, {"time": 2672, "text": "So my splits were very even most of the day."}, {"time": 2672, "text": "I actually ran some of my fastest miles at the end."}, {"time": 2676, "text": "Uh, so there's going to be probably a slight variance from my fastest miles to my slowest mile in like your cadence or your foot strike."}, {"time": 2682, "text": "Uh, but probably not by a huge margin, but you might have a pretty big variance from one person to the next."}, {"time": 2687, "text": "So you get someone whose gate is just a little bit different."}, {"time": 2692, "text": "So like for me, I supinate, which means I kind of come down on the outside of my foot and I'm kind of more of a mid forefoot striker."}, {"time": 2697, "text": "So that's going to kind of impact my cadence to a degree."}, {"time": 2702, "text": "Whereas you might have someone who is kind of more mid to rear their foot or heel striker and they might pronate where their foot kind of rolls in."}, {"time": 2709, "text": "Uh, so that person may have a little bit of a different cadence as well."}, {"time": 2713, "text": "So you get someone, and I think you see this in elite marathoning too, which is going to probably just be a much larger data pool, uh, much, much more probably precise from just like a number of opportunities to study this."}, {"time": 2729, "text": "And I think even their ranges from one person to the next can be, I wouldn't say drastic, but, you know, to the degree of like 10 to maybe even 20 steps per minute or something like that from one person to the next."}, {"time": 2738, "text": "But most people, the faster they go, the higher their cadence is going to be."}, {"time": 2743, "text": "The slower they go, the lower their cadence is going to be, but there's going to be probably a range of optimal lowness and I don't know, probably optimal highness too than that."}, {"time": 2754, "text": "If you can just linger on the 11 hours, the person, first of all, would you like to be the person that breaks 11 hours?"}, {"time": 2759, "text": "And second of all, the person that does break 11 hours, like what would, what would it take?"}, {"time": 2765, "text": "And third question is, is it even possible in your intuition?"}, {"time": 2770, "text": "I mean, I would def I would be lying to you if I said I didn't want to be the first person to break 11 hours and a hundred miles."}, {"time": 2775, "text": "I think that'll be, um, would be a cool like barrier to be the one to usher that in."}, {"time": 2780, "text": "But with that said, I think I'm much more motivated in seeing it done from the sense that like, I think when we're talking about records, it's something that is inevitable that it's going to get broken."}, {"time": 2793, "text": "So, I mean, we were talking about happiness before this, right?"}, {"time": 2797, "text": "So I've contemplated this in the past, um, where I was thinking to myself, like, uh, if my motivation is to break a world record or any record for that matter, course record and have that be my defining reason or my defining motivator, I probably need to do an assessment of what I'm kind of where my mind is at and where my focus is at."}, {"time": 2821, "text": "Uh, and just reflect on how I'm behaving in life because it's going to get broken, right?"}, {"time": 2821, "text": "I mean, I could run 10 50 tomorrow and in 10 years, chances are that's no longer going to be my world record anymore."}, {"time": 2836, "text": "Someone's going to run faster than that."}, {"time": 2836, "text": "So if you're living to hold on to a record versus living to try to move the sport forward, which anytime you break a world record, you're moving the sport forward, then, then you have to look at that as like, that was my contribution."}, {"time": 2852, "text": "And whether I contribute again or not is kind of besides the point."}, {"time": 2852, "text": "What you want is that your performance, your contribution brings new people into the sport who are excited, motivated, and they can make their contribution."}, {"time": 2864, "text": "And then we can ultimately see, well, how fast can someone run a controlled environment, a hundred miler."}, {"time": 2869, "text": "And that's what I really want to see."}, {"time": 2873, "text": "Uh, cause I think I've gotten so much enjoyment from the sport."}, {"time": 2873, "text": "I mean, I've gotten so much enjoyment from the sport."}, {"time": 2877, "text": "I've been able to turn it into a career."}, {"time": 2877, "text": "And I think there's, there's other people who can do the same thing and it's not necessarily going to come at the expense of my career."}, {"time": 2886, "text": "Uh, but it's going to bring more attention to the sport."}, {"time": 2886, "text": "It's going to bring more interest in the sport."}, {"time": 2890, "text": "It's going to open the sport up to people who maybe otherwise would have never thought about it, seen it, considered it."}, {"time": 2893, "text": "And to me, I think that's like a much more rewarding goal than saying I want to break this record and I want to hold it for decades or I want to die with this record."}, {"time": 2905, "text": "So I never have to see someone go faster than me."}, {"time": 2905, "text": "Well, that's the progress of human civilization was down on the shoulders of giants and we keep creating cool stuff."}, {"time": 2909, "text": "Well, and it's, it's the other thing is just like, if you're honest with yourself too, it's, uh, I mean, we're seeing this right now in the running world where, you know, new innovations come in, new technologies come in, new nutritional approaches come in."}, {"time": 2922, "text": "And then we see like the new crop of folks have advantages that the old crop didn't have."}, {"time": 2927, "text": "And it can be easy to look back on that and say like, Hey, well, um, you know, if I would have had that product or if I would have done that, I would have run this."}, {"time": 2936, "text": "But then you're getting into that negative, you know, thought process again, which I generally try to stay off of."}, {"time": 2940, "text": "It's like the caveman."}, {"time": 2940, "text": "If I had fire, I would have done right."}, {"time": 2945, "text": "But with this, look at these idiots up there with their cars."}, {"time": 2945, "text": "If I would have had a car back then, I would have been ruled the world."}, {"time": 2950, "text": "Um, let me just zoom up briefly and ask you about kind of beauty and love."}, {"time": 2958, "text": "What's the most beautiful thing about running to you?"}, {"time": 2958, "text": "Why do you love it?"}, {"time": 2964, "text": "I think, uh, there's kind of a couple of directions to look at it through our lenses, look at it through."}, {"time": 2969, "text": "There's like the, in the moment, right?"}, {"time": 2969, "text": "There's always going to be that run where, uh, you're clicking along and things just feel great."}, {"time": 2972, "text": "You get some endorphins and you get the, the, you know, the, the quote unquote runner's high and that sort of stuff."}, {"time": 2978, "text": "And that's like just like this great feeling that you can kind of tap into on the like the real, like, like in the moment type of level."}, {"time": 2987, "text": "Uh, you know, you've, my wife and I talk about this because she's a competitive ultra runner as well."}, {"time": 2993, "text": "And, um, you will, you'll, we'll have a day where, you know, we'll take a forced day off or something like that."}, {"time": 2998, "text": "And it's necessary, right?"}, {"time": 2998, "text": "It's going to allow the enjoyment to continue."}, {"time": 3002, "text": "But you get into this like routine of, I wake up in the morning, I do this run and that kind of gets my day started."}, {"time": 3008, "text": "That gets my energies up."}, {"time": 3008, "text": "I get that runner's high afterwards."}, {"time": 3012, "text": "You remove that from the equation for a rest day."}, {"time": 3012, "text": "And you just start like, oh man, I don't feel like I never got started today."}, {"time": 3017, "text": "Like, you know, it's just this weird thing."}, {"time": 3021, "text": "It's almost, I think it's, it's funny because non runners don't always like necessarily recognize it because for them it's the complete opposite."}, {"time": 3026, "text": "They're like, if I can get away from not having to run today, that's going to be a good day versus."}, {"time": 3029, "text": "But it's one of those things that I think gets more addictive the more you do it."}, {"time": 3035, "text": "So, uh, so that's purely from the running perspective."}, {"time": 3038, "text": "There's this joy of, uh, of the runner's high of the post after the run."}, {"time": 3044, "text": "You feel like you can take on the world, that kind of thing."}, {"time": 3044, "text": "And I think that's one of the drivers from just the quality of life standpoint."}, {"time": 3048, "text": "Uh, just, uh, you know, and in the moment, immediate gratification, uh, standpoint."}, {"time": 3053, "text": "But then there's like, I think the bigger picture stuff or the longer term stuff."}, {"time": 3057, "text": "And for me, that enjoyment is like just the process like of, uh, okay, I'm starting at this fitness level and I'm going to do these workouts and by doing these workouts, I'm going to see incremental progress from them."}, {"time": 3071, "text": "And then that's another kind of like, kind of short term gratification."}, {"time": 3075, "text": "That's maybe a little longer than the day to day, but, um, still like shorter than like a career or a, or a buildup for a particular race where you're saying you're seeing yourself like, okay, maybe I'm focusing on short intervals right now."}, {"time": 3088, "text": "And on week one, I covered this much distance in three minutes, but by week four, I'm covering this much distance and you can just see that progress is almost like, uh, in elementary school when you get the gold star for reading a book, it's like, did that gold star really mean anything?"}, {"time": 3102, "text": "I don't know, but I felt great when they gave it to me."}, {"time": 3102, "text": "There's something about just finding improvement and people love to see improvement, I think."}, {"time": 3108, "text": "So that's where, uh, I think you can also get some value in it saying like I started here and I got there."}, {"time": 3117, "text": "Um, and then I think there's also just like, uh, I would call this maybe more the cherry on top, which is like where you express your work, which is the race itself, where that's going to be kind of the thing that kind of like, uh, shows up on the end result and where it kind of identifies whether you did things right or wrong."}, {"time": 3133, "text": "So there's a sense which, in which training is a kind of, uh, preparation towards race day and race day being the thing where you get to be the artist."}, {"time": 3145, "text": "You get to create this, this piece of art and they might suck, it might be beautiful."}, {"time": 3179, "text": "Like in grappling, that means for me, that means like not stalling, like taking big risks and trying to dominate another person in the, in the context of grappling and, and do it, like push myself to the limit, both cardio wise and technique wise, and just play, play beautifully."}, {"time": 3198, "text": "I mean, you see this in kind of chess, there's systematic chess players and there's people that allow themselves to have those moments of genius where they take the big risk that eventually pays off or doesn't."}, {"time": 3208, "text": "And that to me is art that, I mean, there's art within running, there's art within chess, there's art within grappling."}, {"time": 3214, "text": "And you got a chance, like all the training is more like science."}, {"time": 3218, "text": "And then it feels like the competition days art."}, {"time": 3218, "text": "I think that that that's a really cool, cool way to look at."}, {"time": 3224, "text": "And I think it's when you really open up the perspective of that too, it's like even, uh, obviously, you know, having a great day, like winning the tournament or, you know, getting further than you were expected to, or beating someone who you've never beaten before or something like that."}, {"time": 3237, "text": "Uh, or in the running perspective, like achieving that goal time, uh, that sort of stuff."}, {"time": 3240, "text": "Obviously those are kind of like the ones you, if, when you're honest with yourself, you really want, and you're going to probably get the most satisfaction out of, but even when they don't go wrong, like maybe like with your grappling tournament, uh, analogy, the, you know, maybe the guy you're grappling against does a move on you and you're like, I was not prepared for that move."}, {"time": 3259, "text": "So now the enjoyment becomes, okay, back to the drawing board."}, {"time": 3263, "text": "Now I need to find out what do I do when that happens to me next time."}, {"time": 3268, "text": "And that's where the, I think the why comes in again, same thing with running."}, {"time": 3273, "text": "Like maybe I make a mistake and, you know, like eat something I didn't really want to eat or, or thought was going to work, but didn't work."}, {"time": 3279, "text": "And it costs me more time than I gained by having it or something like that."}, {"time": 3283, "text": "And then I go back to the drawing board and say, okay, well, I can't do that."}, {"time": 3286, "text": "Or if I'm going to do that, I need to be more prepared to be able to do it."}, {"time": 3290, "text": "And I love that part of the sport."}, {"time": 3290, "text": "Um, just the rearranging of things and adjusting and tinkering."}, {"time": 3296, "text": "There's some sense in which the mistakes and like the flaws give us meaning."}, {"time": 3301, "text": "Cause like if, if everything, um, if you weren't able to find mistakes and something you've done, it feels like the life would be void of meaning."}, {"time": 3307, "text": "It's a lost opportunity too."}, {"time": 3307, "text": "Like if, I mean, like when I look at even my a hundred mile race of 11, 19, I can find spots in there where I was like, Oh, you know what?"}, {"time": 3324, "text": "I could clean that up a little bit."}, {"time": 3324, "text": "Maybe if I do this differently."}, {"time": 3327, "text": "And I mean, that's going to get me, you know, a little bit faster."}, {"time": 3327, "text": "If I sat back and said, Hey, well things went great that day."}, {"time": 3333, "text": "Let's see if we can replicate it."}, {"time": 3333, "text": "Then, you know, I probably run 11, 19 again."}, {"time": 3337, "text": "So can we talk about training a little bit?"}, {"time": 3337, "text": "What does your training look like year round day to day, hour to hour, like optimal?"}, {"time": 3345, "text": "Maybe, uh, maybe you want to pick a race in the context of what you want to discuss that, but, and also people should follow you on Instagram."}, {"time": 3358, "text": "You have a lot of kind of interesting, um, like little glances into your training process and into your training thinking, which is quite fascinating."}, {"time": 3365, "text": "But if you look at an optimal training process, what does that look like?"}, {"time": 3370, "text": "So I think, uh, the, if we were looking at it from like a philosophical level or like an approach level, I think there's some things that carry over from regardless of the distance."}, {"time": 3380, "text": "So I think working on your weaknesses and things that are least specific to what you're going to do on race day, but are still going to be important things in terms of improving your ability to perform on race day or maximizing your potential, uh, with the things that are specific you do first."}, {"time": 3399, "text": "I say that, but there's a caveat with endurance sport."}, {"time": 3406, "text": "I think maybe even more specifically with things like our ultra marathons or a hundred miles where you want a really strong aerobic foundation or like a base before you really start, I think, structuring things towards a specific one."}, {"time": 3416, "text": "So for me, I think like a target for me is oftentimes like, uh, you know, getting really fit at like what my pace would be at like my aerobic threshold or what a lot of people may be called like a maximum aerobic function."}, {"time": 3430, "text": "Um, I mean, the running world is kind of weird where we have like these terminologies where there's sometimes multiple words that essentially mean the same thing, but one is from like, uh, just an actual physiological reaction and one is just like a feeling and stuff like that."}, {"time": 3441, "text": "So you mentioned time on feet versus time in optimal physiological state."}, {"time": 3445, "text": "Like how important is it just to get like running done versus like running in a particular pace that would depend on the event."}, {"time": 3460, "text": "I would say to a degree and there's contradicting ideas about like kind of how to structure it."}, {"time": 3460, "text": "I think a lot of times like, uh, you do want to like time on feet in most cases is just going to be like I'm running easy, whatever feels easy that day."}, {"time": 3472, "text": "And that can be different from one day to the next."}, {"time": 3476, "text": "Like I might feel great and you know, that produces a much faster pace than if I feel really miserable or something like that."}, {"time": 3481, "text": "Um, so that's why I think a lot of times running, well they'll, they'll do the whole perceived, perceived effort or perceived exertion."}, {"time": 3490, "text": "And there you're looking at kind of understanding the response your body has to a certain effort level and you're supposed to target a certain effort level in order to like get a certain response."}, {"time": 3502, "text": "So to maybe simplify that a little bit or make it a little clearer, like I think I focus on essentially like short intervals."}, {"time": 3507, "text": "I focus on longer intervals or tempo runs."}, {"time": 3507, "text": "Uh, I focus on, um, like race pace intensity, which is a lot of times what I'll build my long run around."}, {"time": 3515, "text": "Um, but I'll also like, those are kind of like the small pieces to the puzzle."}, {"time": 3522, "text": "Those are the options you're working with."}, {"time": 3526, "text": "Yeah, but I'm going to always try to work with those options on top of a massive aerobic base, which is going to probably be like 80% of the work."}, {"time": 3531, "text": "So how do you build that massive aerobic base?"}, {"time": 3535, "text": "Just distance?"}, {"time": 3535, "text": "Distance and essentially, so I like to call it microstressing because you're going to always start at a different spot depending on where your fitness level is at and depending on where you're at as an individual."}, {"time": 3543, "text": "I'm going to be targeting my aerobic threshold."}, {"time": 3547, "text": "I'm going to get right up to it, but not necessarily cross over it."}, {"time": 3551, "text": "Um, it's, it, you know, it's, it's been popularized as maximum aerobic function as kind of a training philosophy."}, {"time": 3556, "text": "That philosophy in itself, I think maybe is a little more like holistic where they're saying, do this basically all the time."}, {"time": 3562, "text": "And by doing so, you're going to, like, you're going to raise your aerobic potential by so much that, you know, you can kind of like race yourself into shape at that point."}, {"time": 3574, "text": "And this would be maybe more specific for like shorter distance or endurance runs where you're not going to really race yourself in the shape of a hundred milers."}, {"time": 3581, "text": "But for five Ks, you might, you might do like a huge base building phase where you're going up to that maximum aerobic function or that aerobic threshold and you're watching your pace come down at that."}, {"time": 3593, "text": "So the rule there is basically like if you're seeing improvement, that's the sign you're looking for, or which would just be your pace dropping at that heart rate or at that intensity."}, {"time": 3602, "text": "And, uh, if you're seeing that continually go down, you're heading in the right direction."}, {"time": 3606, "text": "If you start seeing it go the opposite way, you're, you're probably overreaching where you're trying to do too much of it."}, {"time": 3611, "text": "So that's kind of dictates how much the dose, I guess you'd say, when we talk about max aerobic function, we're talking about heart rate as the ultimate, as the really important metric here."}, {"time": 3619, "text": "So maintaining a particular heart rate during the run."}, {"time": 3625, "text": "Uh, is that the measure that, like, how do you know you're in the right place?"}, {"time": 3625, "text": "And then that's where it gets a little tricky because like, unless you go into a lab and get your aerobic threshold tested, it's really hard to have like an exact number on it."}, {"time": 3632, "text": "Um, you know, Dr. Phil Maffetone with the maximum function process, he'll say 180 minus your age is going to give you your."}, {"time": 3642, "text": "That's the MAF 180 formula that I thought was fascinating for, it's like, uh, in the same way E equals E equals MC squared is fascinating that there could be a formula that captures like optimal running."}, {"time": 3652, "text": "So that for people who don't know that's 180 minus your age, if you train at that heart rate, if you run at that heart rate, you're going to progress a lot."}, {"time": 3659, "text": "And here's the advantage of that."}, {"time": 3662, "text": "I think like with any of these things, you want to look at it through where are the advantages here and I need to account for those."}, {"time": 3667, "text": "And then where are the potential disadvantages and then decide for me as an individual, do these advantages outweigh the disadvantages on what's the alternative approach and is that going to produce more advantages or less?"}, {"time": 3680, "text": "So with, with maximum function, uh, here's some advantages."}, {"time": 3680, "text": "Like it is low enough intensity where you can train pretty consistently at a fairly high volume with a very low injury risk with a very low, like things that are going to maybe lower your quality of life, like muscle damage and things like that."}, {"time": 3717, "text": "So they could be like a, what they call like a fat adapted athlete."}, {"time": 3722, "text": "So you can go to your fat stores for energy if you're applying this math."}, {"time": 3728, "text": "What is it called by the way?"}, {"time": 3728, "text": "Math 180."}, {"time": 3728, "text": "Is that a good, what are your thoughts about in general for yourself and for the broader population?"}, {"time": 3734, "text": "I think the math 180 formula is about as good of a formula as you're going to find in terms of capturing as many people as you can get away with capturing with a kind of a universal thing."}, {"time": 3747, "text": "Uh, like any of these things, I mean, it's, it's more likely kind of on a bell curve where like the bulk of that 180 minus their age is probably going to be a pretty good, at least starting point to kind of figure out where that is."}, {"time": 3761, "text": "There's some other things you can like maybe use to kind of check it that I like to do."}, {"time": 3761, "text": "If I'm, let's say I just, I did 180 minus my age and I went out and I started running and it was like, I'm running along and I'm just like, my, my breathing is labored."}, {"time": 3771, "text": "I'm, you know, I'm struggling to get a sentence out without gasping for breath."}, {"time": 3776, "text": "Well, that's my body telling me I'm probably not actually at my true like math number or my true, like underneath my true aerobic threshold, like aerobic threshold and maximum function, you should be able to do that for hours and you should be able to breathe pretty efficiently and talk."}, {"time": 3790, "text": "Carry a conversation."}, {"time": 3811, "text": "I had, uh, actually when I was in, in better shape, I had trouble getting to that math number."}, {"time": 3816, "text": "I found myself like that I would be doing way too much work."}, {"time": 3823, "text": "Like it was too hard to do."}, {"time": 3823, "text": "It was too hard to get to that number."}, {"time": 3823, "text": "I was running a much lower heart rate, like 10 to 20, what do you call that beats lower."}, {"time": 3829, "text": "And that's, I was still for myself, happy with the pace."}, {"time": 3835, "text": "It was a good pace and, and I was, felt good."}, {"time": 3835, "text": "I was smiling and enjoying life and, uh, I did."}, {"time": 3841, "text": "And the moment I take myself to that, uh, level of like the, the math 180 level, that's like, that felt like a real workout."}, {"time": 3848, "text": "And it felt like I can't do that for five, 10, 15 miles."}, {"time": 3853, "text": "Like I, I started feeling it like this is a one or two mile thing."}, {"time": 3858, "text": "No, but I think his answer to that, uh, Phil Meftone's answer is maybe you're supposed to like, uh, what, maybe do some more sprints or something like that, or build up your, maybe like I'm too weak."}, {"time": 3872, "text": "Musculature wise to like, uh, yeah, like that, that's a sign that you need to work on some stuff."}, {"time": 3877, "text": "You can't just keep enjoying life."}, {"time": 3877, "text": "There's, there's two ways to look at that, I think."}, {"time": 3880, "text": "And I think you're, you're, you're right on."}, {"time": 3880, "text": "I think that what the advice from that, from that kind of a process would say is either you, you're doing too much of it."}, {"time": 3885, "text": "So it's getting too hard for where your skeletal muscle system is currently at for that particular activity."}, {"time": 3892, "text": "So like, it can be different too."}, {"time": 3914, "text": "So for you, like, you know, you're prioritizing, like, uh, uh, wrestling and mixed martial arts or not mixed martial arts, but jujitsu type stuff."}, {"time": 3918, "text": "So, uh, you know, running is maybe kind of that, that, uh, that secondary activity versus the primary activity."}, {"time": 3930, "text": "But yeah, so what they would say is probably like, maybe instead of doing that at, let's say you were doing that for like 30 miles a week or something like that, and it was getting too hard to continue there, they'd say, you know, come back to 20, get used to 20, get comfortable with 20, then let's get you up to 25 and 30 and kind of just like inch you along."}, {"time": 3950, "text": "One of the intuitions I had about the ways I was failing at running is the form was probably not great."}, {"time": 3956, "text": "Like the way to get to those 30, 40 miles is to get the form right."}, {"time": 3956, "text": "Maybe I was doing too big of steps, not so like playing with a different gate, playing with a different kind of, um, the form of your form, the economy, the efficiency."}, {"time": 3970, "text": "So that was, that was the intuition."}, {"time": 3970, "text": "Like I was doing something wrong, but I suppose that's the benefit of these kind of formulas."}, {"time": 3975, "text": "It challenges you to think like, how can I improve this kind of stuff?"}, {"time": 3979, "text": "Well, and it also, it simplifies it so much that you're forced to, right?"}, {"time": 3984, "text": "You're forced to optimize within that real strict parameter versus am I doing my short intervals right, but my long runs wrong?"}, {"time": 3989, "text": "Or am I doing my like long intervals right, but my short intervals, and then you just, it kind of complicates things when you start throwing a lot of stuff there."}, {"time": 3999, "text": "And for most people, especially when they're first getting started, you know, you're, you can't overcomplicate it or you're just going to like, you're going to do like a bunch of half right, half wrong things and then not really know where your progress or your deficits are necessarily at."}, {"time": 4012, "text": "So I do think this is an amazing approach, especially for people who are just getting into it and building that, that foundation, um, where, where I think maybe you want to deviate from that a little bit, especially when you start getting to these events that are operating well outside that intensity."}, {"time": 4028, "text": "So you take something like, um, you know, let's say it's a race that takes you in the neighborhood of around like 12 minutes or something like that, then you're going to be running significantly faster than your, your maximum function pace."}, {"time": 4043, "text": "So most of the research is going to say at some point in time, you need to get around to practicing the pace at which you're going to perform at and really fine tuning the mechanics, uh, the efficiencies, uh, how it feels, how to judge it, how to pace it at the pace you're going to try to compete at."}, {"time": 4060, "text": "So there's obviously like a large range of targets there when we're talking about the endurance world in general, where, you know, you have these shorter events, like five kilometers, and then you also have a hundred mile races, which are going to typically be quite a bit below your maximum heroic function in, especially on these trail races."}, {"time": 4074, "text": "I need to admit something."}, {"time": 4074, "text": "So I don't measure the runs at all in terms of, uh, time, uh, because I get competitive with myself."}, {"time": 4081, "text": "So I kind of decided that running for me is going to be this thing where I just go by feel."}, {"time": 4087, "text": "Is it possible to be that kind of runner and, you know, still have running as part of your life and be a good performer in running?"}, {"time": 4093, "text": "I actually think that's, that's where you want to get to."}, {"time": 4097, "text": "The problem is most people have a hard time getting to that because they'll go out and they'll run with a friend and match their pace."}, {"time": 4102, "text": "Or they'll go out and they'll say, well, I want to run this pace."}, {"time": 4107, "text": "So they'll target that pace or target a specific heart rate, which is, you know, not necessarily how they maybe feel good doing it."}, {"time": 4112, "text": "So I think like once you, I mean, obviously I think when you put a race on the calendar, if your goal is performance, it's a little harder to just say like, well, I'm going to run whatever feels good today because eventually you have to get around to doing what's specific."}, {"time": 4127, "text": "But from just a fitness standpoint, health standpoint, enjoyment standpoint, um, I think it's totally fine to go out and say, I'm going to run what feels good today."}, {"time": 4136, "text": "And you know, maybe someday you will feel like at the end of the run, I'm going to do a couple of sprints just to get some, you know, that, because it does, that one's a hard one to kind of jumpstart, but once you do it and you realize how kind of good it feels, maybe to throw in a few accelerations at the end of a run."}, {"time": 4146, "text": "And then you, you say, oh wow, that feels pretty good to do that."}, {"time": 4150, "text": "I feel a little more accomplished."}, {"time": 4153, "text": "That's a forcing function, but I like to finish runs with sprints anyway."}, {"time": 4157, "text": "Because you're already there without, right."}, {"time": 4157, "text": "You don't need to the timing."}, {"time": 4157, "text": "I'm afraid of the time becoming a drug, but the flip side of that, it's a useful tool to get you to learn the right form, the right feel, like what it feels like to have to be in good shape."}, {"time": 4172, "text": "And then you can throw out the time."}, {"time": 4172, "text": "Well, I think too with, with feel running."}, {"time": 4172, "text": "And what I mean by that is that kind of back to that perceived effort thing where like you do enough of it and you start being able to recognize, like I can go out and if you said, okay, run, you know, 60 minutes at your aerobic threshold, I could go, I could know where that is on my heart rate."}, {"time": 4191, "text": "And I could go out there and just say like, okay, I know what that feels like and go out and run that feel."}, {"time": 4194, "text": "And I'm going to hit that spot."}, {"time": 4194, "text": "Like I bet you if we looked at my heart rate data after that, it'd be right in there."}, {"time": 4199, "text": "And I wouldn't have to look at some of that's just experience."}, {"time": 4202, "text": "Someone's just understanding like when like noticing the physiological responses, when you cross over versus step a little bit too below it, uh, you can get yourself daydreaming and forget."}, {"time": 4212, "text": "I'll do this sometimes too, where I'll be tart."}, {"time": 4212, "text": "Cause I'm kind of like you too, where when I'm getting really fit, uh, especially with my foundation, like I gotta, you know, I'm moving pretty quick at my aerobic threshold."}, {"time": 4220, "text": "So like if I start daydreaming too much, I can notice, Oh, I'm drifting back a little bit."}, {"time": 4225, "text": "I looked down at my heart rate matter."}, {"time": 4225, "text": "Oh yeah, I'm 10 beats under, you know, so you do it."}, {"time": 4227, "text": "It does take a little bit of, I think just awareness."}, {"time": 4233, "text": "Um, but it's also not necessarily something where you have to be so exact that you're hitting things, you know, an exact heart rate all the time."}, {"time": 4238, "text": "There's usually a range and there's even like some fluctuations where like if you've been healthy for a year or two without any injuries and you've been fit that you can probably add five beats to your maximum aerobic function."}, {"time": 4251, "text": "If you're using that as kind of your, your target from the 180 minus your age formula."}, {"time": 4255, "text": "So let's try this, lay this out for yourself, but for others, you, you offer readymade plans for people, you know, depending on their, I think the key thing there is the distance."}, {"time": 4266, "text": "Maybe you can elaborate, but what does that plan look like?"}, {"time": 4266, "text": "Usually what are the key options as you've already kind of mentioned?"}, {"time": 4273, "text": "And how does your week look like?"}, {"time": 4273, "text": "How do a lot of people's week look like in terms of splits?"}, {"time": 4279, "text": "Are we talking about, um, you know, in terms of rest days, in terms of how often do you do speed work versus longer distance?"}, {"time": 4285, "text": "You mentioned long runs."}, {"time": 4291, "text": "Like, is there something you could say that's generally applicable about the, the structure of these plans?"}, {"time": 4298, "text": "The readymade plans, I definitely follow like a philosophy, um, and it's going to be like kind of like lockstep in that."}, {"time": 4303, "text": "Um, so for those, like there's always going to be a sacrifice when you do like a readymade plan because there's, you're removing the individual context there."}, {"time": 4312, "text": "So for folks who are like really want to get into the weeds, I usually do like a personalized coaching plan with them where we sit down and we actually look at their strengths, their weaknesses and really kind of go in from that perspective and fine tune it."}, {"time": 4320, "text": "And it also like it avoids it avoids a situation where, Oh, my readymade plan says I'm supposed to do this run today, but I don't feel great today."}, {"time": 4332, "text": "So what do I do?"}, {"time": 4332, "text": "I mean, some people are fine with that because they're, they're, they're aware enough of like the process that they can adjust it themselves."}, {"time": 4341, "text": "Other folks just need a little more support."}, {"time": 4341, "text": "So, um, that's kind of the difference there, but in terms of the structure of it, it kind of goes with an approach where ogre saying you build this foundation, you're going to spend, you know, usually anywhere between eight to 12 weeks just building up your, your aerobic foundation."}, {"time": 4353, "text": "You're going to be doing a lot of stuff that are kind of at, I call them base runs, but they're basically your maximum aerobic function or you're up to your aerobic threshold type stuff."}, {"time": 4362, "text": "And they're really going to get really fit with that."}, {"time": 4366, "text": "And once they kind of have that foundation laid, then it's time to get into the specifics of whatever distance they're doing."}, {"time": 4370, "text": "So if it, where it will differ will be like if they're doing a right now on those plans, I think I've got 5k half marathon marathon, 50k, 80 to a hundred K and then a hundred miles."}, {"time": 4379, "text": "So if they pick a 5k plan, the order of operations is going to be different than if they pick the a hundred mile plan, you're going to see some of the same workouts show up in that plan."}, {"time": 4389, "text": "It just going to be different areas of it."}, {"time": 4389, "text": "So once they're really fit at that, uh, you know, that foundational level, then, you know, if they're doing say a hundred mile plan, they might start doing some short intervals, which I would, on my plans, I usually range between 30 seconds up to four minutes."}, {"time": 4404, "text": "It's kind of that short interval range."}, {"time": 4408, "text": "Can you describe what you mean by short interval?"}, {"time": 4408, "text": "It's like a sprint and then a rest."}, {"time": 4413, "text": "So I'll use basically like, I'll use like a, basically a 12 minute time trial and that's going to kind of like dictate for them what the intensity and the pace is going to be for some of those."}, {"time": 4423, "text": "When they're under a minute, they'll push past that a little bit."}, {"time": 4423, "text": "Um, but usually when we're up to like above a minute and certainly up to four minutes, like whatever pace or intensity that they get for that kind of 12 minute time trial, where they're just seeing how far they can go in 12 minutes is going to be, um, kind of like about where they're going to target for those intervals."}, {"time": 4442, "text": "So then those intervals are going to be structured."}, {"time": 4442, "text": "Let's say we were doing two minute intervals."}, {"time": 4445, "text": "They're going to do two minutes at that intensity that they could do for 12 minutes at a time trial."}, {"time": 4449, "text": "Then they're going to do a two minute real easy jog, or maybe even walk just to kind of bounce back."}, {"time": 4454, "text": "And they're going to repeat it."}, {"time": 4454, "text": "How do you figure out how far you can go in 12 minutes?"}, {"time": 4458, "text": "Is that just a trial and error you build up to it?"}, {"time": 4458, "text": "There's formulas with, yeah, there's some newer formulas that are probably a little less, uh, um, brutal, uh, where you kind of, uh, I haven't really dove into these that that in depth yet."}, {"time": 4469, "text": "I know like, um, that you can kind of replicate it by doing like a short, a very short interval and then a slightly longer one."}, {"time": 4480, "text": "Um, and then like another one where like at the end one, that last one will kind of indicate what it is."}, {"time": 4485, "text": "Uh, and so you're doing less of it to get the same answer to the question."}, {"time": 4490, "text": "But sometimes I think when it's someone who's new, I'd rather them just do a 12 minute time trial because it's easy for them to execute in the sense that it's pretty clear."}, {"time": 4496, "text": "You do a warm up, you do some strides, maybe some dynamic stretches, and you just run as hard as you can for 12 minutes as evenly paced as you can manage."}, {"time": 4506, "text": "And, uh, I mean, if the, if it's going to produce the data I'm looking for, uh, and I mean, it's also no matter what happens, they'll produce the data."}, {"time": 4517, "text": "I mean, you can, you can screw it up."}, {"time": 4517, "text": "I guess you can go way too fast."}, {"time": 4517, "text": "Then you have this scenario where like, Oh, it looks like your, you know, your first two minutes were drastically faster than your last two."}, {"time": 4524, "text": "And then it's like, Oh, we maybe screwed that one up."}, {"time": 4524, "text": "But, um, but I mean really like you don't even need to do the time trial technically."}, {"time": 4565, "text": "And as you do a few of them, you just get to know the pacing of it a little better."}, {"time": 4568, "text": "And then you start seeing more even split."}, {"time": 4568, "text": "So like, you know, their first two minute intervals pretty close within a couple seconds of their second, or, you know, I guess we'd be looking at distance if we're doing time."}, {"time": 4576, "text": "So like you went approximately the same distance on that last one as you did the first one."}, {"time": 4579, "text": "And then we're just looking for improvement over time."}, {"time": 4583, "text": "So, you know, we might spend four, six weeks kind of focusing on improving that we're going to still include kind of foundational running volume where you're going to be running like an easy pace and enjoyable pace kind of in the interim."}, {"time": 4593, "text": "And then there's going to be some rest days and that's going to be where the levels come in."}, {"time": 4597, "text": "My like level one plans are going to be like four day a week training plans."}, {"time": 4601, "text": "Level two are going to be five day level three are going to be six day with one day off."}, {"time": 4605, "text": "Um, and you can obviously operate outside of those, those, those are just the ones that I put up for the readymade when I'm coaching people kind of personalized."}, {"time": 4613, "text": "We just, we look at like what their history is with running their schedule, all sorts of stuff."}, {"time": 4617, "text": "Cause oftentimes people get hung up on like, well, what are the elites doing?"}, {"time": 4621, "text": "What are the professionals doing?"}, {"time": 4621, "text": "What are the Olympians doing?"}, {"time": 4621, "text": "It's like, well, it's like what the Olympians are doing is they're waking up and they're living and breathing everything around this one race that they're going to do in four years."}, {"time": 4628, "text": "Or so it's like, we need to step away from that."}, {"time": 4633, "text": "If you're working, you know, 10 hours a day and you got kids and all this other stuff too."}, {"time": 4633, "text": "So, um, there's a lot of variables that make it more interesting to coach someone who's actually like not an elite athlete or someone who's a professional athlete, I should say, uh, the, but, but yeah, so they're, they're going to do that stuff."}, {"time": 4648, "text": "Those, those shorter intervals, um, for probably about like four to six weeks."}, {"time": 4653, "text": "If they're doing, if they're doing a longer race, like a hundred miles, if they were doing say a 5k, we'd start bringing those workouts in near the end of their plan."}, {"time": 4662, "text": "Cause that's going to be specific to their race pace."}, {"time": 4662, "text": "That's going to be the intensity that maybe they're doing for, you know, like a three K or a five K or something like that."}, {"time": 4665, "text": "So it's going to be more relative to what they're going to use."}, {"time": 4669, "text": "So it follows that philosophy."}, {"time": 4673, "text": "The plans follow that philosophy of weaknesses and least specific stuff early."}, {"time": 4673, "text": "And then we start phasing closer to most specific stuff and strengths as you get kind of near to the end of the plan."}, {"time": 4684, "text": "And then the distance of, or the time that you're going to spend out doing whatever event it is, is going to dictate how those kind of get ordered in there."}, {"time": 4689, "text": "I wonder if I could ask you for some sort of advice, maybe almost, uh, maybe look at me as a case study of a particular runner and runner and then see how we can plan stuff out."}, {"time": 4701, "text": "So which context to give."}, {"time": 4701, "text": "So I have been, first, let me say how much we're currently in Austin."}, {"time": 4710, "text": "I want to say how much I love Austin for many reasons."}, {"time": 4714, "text": "Uh, first and foremost, people are super kind and just like, there's so much love that I've experienced immediately when I came to the city versus many of the other cities I've been in."}, {"time": 4726, "text": "It's, uh, it's not quite as welcoming and full of kindness immediately."}, {"time": 4726, "text": "I mean, I really love, love it here in Austin."}, {"time": 4733, "text": "And because I've been going through a bunch of stressful stuff, I just kind of gave myself a chance to say, okay, I'm going to stick to a diet of carnivore, keto, but I'm going to eat as much as I want because, uh, primarily because just barbecue was part of the love I was getting here."}, {"time": 4753, "text": "And I was like, either I resist or just give in."}, {"time": 4753, "text": "And I decided to give in and actually use this as an opportunity to relax and have fun for the past three, four months, plus whiskey and so on."}, {"time": 4762, "text": "And then the training kind of all, I also let go of the training a little bit, just to relax, to really focus on the work, focus on the love I've been getting all those kinds of things."}, {"time": 4772, "text": "But now I just kind of want to set a goal for myself to get back into both competing and grappling, but also doing a, um, hanging out with David Goggins and, uh, doing a conversation with him, but almost this is my own personal kind of race that I'm looking forward to."}, {"time": 4788, "text": "And in terms of distance, that means running with David, uh, something like a marathon plus plus it's like, it's unclear what plus."}, {"time": 4797, "text": "So my goal would be to, uh, continue eating carnivore, which is a whole nother topic that I'd love to talk to you about."}, {"time": 4805, "text": "I feel great psychologically, sort of in terms of mental performance in my work when I eat carnivore and physically, I love it."}, {"time": 4814, "text": "I've never felt any kind of need for carbs to, uh, to improve performance in my running or anything else."}, {"time": 4822, "text": "Combine that with fasting, intermittent fasting, or eating once a day."}, {"time": 4826, "text": "I just, that's when I, uh, feel the best."}, {"time": 4826, "text": "I also feel best."}, {"time": 4826, "text": "And this is something you can push back on."}, {"time": 4833, "text": "I feel best when I just run every day, like no breaks ever, and usually the same way every day."}, {"time": 4840, "text": "So like, I know this is suboptimal."}, {"time": 4840, "text": "It'd be interesting to hear your opinion of just how suboptimal that is."}, {"time": 4848, "text": "Uh, so I think that actually lays out like where my mind is."}, {"time": 4853, "text": "I'm happy eating carnivore once a day."}, {"time": 4853, "text": "I like running every day."}, {"time": 4858, "text": "Uh, the goal is to run a marathon in two months ish, two months plus, and then about three months to do a bunch of competitions and grappling."}, {"time": 4866, "text": "With those parameters, I think like you actually probably would be a great candidate for maximum heroic function training strategy."}, {"time": 4875, "text": "Like you want that consistency where I'm going to do the same thing each day."}, {"time": 4875, "text": "Uh, you don't want to beat yourself up so much any one day that you can't get out and do it the next one."}, {"time": 4903, "text": "So, um, where you could maybe get creative would be if you decided that it's a hard, fast rule that you run an hour every day, seven days a week."}, {"time": 4916, "text": "But we find out that to run your maximum robot function means you probably are better off sticking to 30 minutes."}, {"time": 4922, "text": "Then what you would maybe do is you would run underneath your maximum aerobic function for the first 15 minutes in the last 15 minutes, maybe throw some of those strides in there if you want to do that at the very end."}, {"time": 4933, "text": "Uh, and then that middle 30 minutes is going to be maximum road function target."}, {"time": 4937, "text": "And then maybe after, you know, four weeks, you start noticing, you know what, this 30 minutes isn't wearing me out near as much as it used to."}, {"time": 4947, "text": "Um, I feel like I could easily push past that."}, {"time": 4947, "text": "Well, let's up that to 40 minutes."}, {"time": 4947, "text": "So that 60, you're always staying within that 60 minute parameter that keeps your, your schedule consistent, your routine consistent."}, {"time": 4955, "text": "I'm wearing a heart rate monitor to sort of as I run to monitor it."}, {"time": 4961, "text": "You could do that."}, {"time": 4961, "text": "You could go perceived effort."}, {"time": 4961, "text": "Um, I like to use them in tandem in the sense that like early on, I'll maybe look at my heart rate a little more often, especially for shorter length."}, {"time": 4972, "text": "There is heart rate can get messy the longer you go."}, {"time": 4972, "text": "So I, I end up kind of maybe stepping away from heart rate a little more than some will at a certain point because I'm ultimately I'm going to be usually training or working with someone to run like, you know, a race that's really long and they get cardiac drift, dehydration, heat and things that are going to make the heart rate super messy."}, {"time": 4992, "text": "But you're probably your ability to measure perceived effort is exceptionally good."}, {"time": 4998, "text": "Mine is actually really weak."}, {"time": 4998, "text": "Heart rate then I need to do the, still the work of connecting heart rate to the perceived effort."}, {"time": 5002, "text": "And that's exactly what I would use heart rate for then."}, {"time": 5002, "text": "And you'll get to a point probably by like in the first couple of months where you, you can still lean on heart rate if you want, but it'll be kind of one of those things where you keep looking at, you're like, Oh wow, I can guess it."}, {"time": 5016, "text": "And you play a game with yourself too."}, {"time": 5016, "text": "And you say, well, how close can I guess?"}, {"time": 5019, "text": "You'll get it."}, {"time": 5019, "text": "So like for me, what I'll do is I'll do the run and then I'll look at the heart rate afterwards and be like, Oh cool."}, {"time": 5024, "text": "I was right there."}, {"time": 5024, "text": "Or I remember feeling like I was speeding up a little bit there and their show is right there on the heart rate or."}, {"time": 5031, "text": "I also love sort of something we haven't talked about."}, {"time": 5031, "text": "I love pushups and pull ups of like body weight workouts."}, {"time": 5036, "text": "Again, it's mostly mental."}, {"time": 5036, "text": "I just enjoy the mental challenge of it."}, {"time": 5042, "text": "I also like, it makes me feel like if all I'm doing is running, it makes me feel I'm not like."}, {"time": 5050, "text": "I mean, there's some aspect to running that's not to be like hippie about it, but like, you know, you're, you're with nature, you're running in the, it's like, we're born to do this thing."}, {"time": 5060, "text": "And that same way, I feel like when I'm doing pushups and pull ups, I feel like I was born to do that kind of stuff."}, {"time": 5065, "text": "Like it's like this body weight exercise that is, body weight exercises have that way about them."}, {"time": 5070, "text": "It's, it doesn't have that dumbbell feel or doing bench press or squats, squats with weight."}, {"time": 5076, "text": "When you're just doing squats, body weight, we do pushups and pull ups, body weight, even just basic ab stuff, core stuff, body weight."}, {"time": 5087, "text": "I just love the way I feel doing that."}, {"time": 5087, "text": "So it's usually, I forgot to mention that part."}, {"time": 5092, "text": "I combine that with the running afterwards, doing some basic body weight stuff."}, {"time": 5097, "text": "And I think like you're going to get from, if we're not looking at it from like specifically, like training at a pace in order to get both the skeletal muscle adaptations, as well as the cardiovascular benefits, you're probably tapping into some of the higher intensity stuff with that body weight."}, {"time": 5113, "text": "So this, and unless you're doing, I guess no rest."}, {"time": 5113, "text": "So is it, you get pretty high heart rate from that."}, {"time": 5119, "text": "Higher than running."}, {"time": 5123, "text": "So you're checking that box there from just like a lifestyle, enjoyment, fitness, overall fitness standpoint."}, {"time": 5128, "text": "I think you want to keep your running more aerobic then because you're getting that and you're probably getting it from like your grappling workouts too, I would guess."}, {"time": 5137, "text": "So there's just not as big of a need for you from a big picture standpoint to be doubling down on that stuff with your runs as well."}, {"time": 5144, "text": "And it sounds like you prefer not to."}, {"time": 5150, "text": "So I mean, what about the distance of marathon versus a hundred miles?"}, {"time": 5157, "text": "Is that a big difference?"}, {"time": 5157, "text": "What's a good goal to work towards?"}, {"time": 5157, "text": "Is it marathon and the rest of it just takes care of itself?"}, {"time": 5163, "text": "So you want to do a marathon and then ultimately do a hundred mile after that?"}, {"time": 5168, "text": "I have no idea what the guy."}, {"time": 5168, "text": "Oh, so he's going to tell you spot on what you're doing."}, {"time": 5173, "text": "So you have to be ready for anything."}, {"time": 5173, "text": "For anything."}, {"time": 5177, "text": "My own personal goal is to feel somewhat challenged, but comfortable running a marathon."}, {"time": 5184, "text": "The longest I've ever run is 22 miles, but there's been many stretches of my life where I would regularly run."}, {"time": 5190, "text": "Like the long run would be close to 20 miles."}, {"time": 5190, "text": "And then I was comfortably running 10 miles four months ago."}, {"time": 5197, "text": "Feels like forever ago."}, {"time": 5197, "text": "Until I injured myself a little bit by running in the snow and stubbing my toe to where it was like, you don't realize how much you appreciate your toes until you stub them."}, {"time": 5209, "text": "That big toes where all that power comes off."}, {"time": 5209, "text": "And so it was surprising how long it took to heal and how essential it was and how unpleasant running, how much I hated running with it."}, {"time": 5223, "text": "And then I kept like coming, trying to get back out there to run to think, I think it's okay."}, {"time": 5227, "text": "And no, it's not okay."}, {"time": 5227, "text": "You really need to let it fully heal."}, {"time": 5227, "text": "At least that was my experience."}, {"time": 5233, "text": "I couldn't like just suck it up."}, {"time": 5233, "text": "It was making it worse every time."}, {"time": 5233, "text": "And one of those injuries that could really feel, even though it's so small, but it's essential."}, {"time": 5237, "text": "So is there any difference between the goal of marathon or a hundred miles?"}, {"time": 5243, "text": "Would you say, should I be prepping for a hundred miles if that's at all a possibility?"}, {"time": 5248, "text": "The big difference is going to be like you're dropping intensity significantly by going up to a hundred miles versus the marathon."}, {"time": 5253, "text": "So the maximum aerobic function I think is actually going to feed into that maybe a little bit better."}, {"time": 5262, "text": "It's probably gonna be a little closer."}, {"time": 5262, "text": "It all varies a bit because people will focus on specific distances and they'll get very efficient and very adapted to that."}, {"time": 5269, "text": "So it's what makes running kind of messy where you'll get, for example, the average person can hit their lactate threshold for probably about 60 minutes or something like that."}, {"time": 5284, "text": "Whereas you get these elite marathoners who've been basically spending their entire life preparing for a marathon race."}, {"time": 5288, "text": "They can push almost up to their lactate threshold and after lactate threshold for almost like two hours."}, {"time": 5298, "text": "So it gets a little messy when you start looking at it from that lens, but you're, you don't really have to worry about that too much because you're not really focusing on being the best possible hundred mile or the best possible marathon."}, {"time": 5307, "text": "Or you could be, you want enough overall fitness that you can just do either one of them without absolute misery because you did the couch to a hundred miles."}, {"time": 5316, "text": "So I think like for a hundred miles, the biggest difference I think given your context is just like the more physical things you are doing, the better prepared you're going to be for the hundred mile."}, {"time": 5327, "text": "So it's almost given your context."}, {"time": 5327, "text": "I wouldn't say irrelevant."}, {"time": 5333, "text": "You want to be doing running, but you're going to be doing that."}, {"time": 5333, "text": "Once you put it in your program, it sounds like it's going to be pretty locked in."}, {"time": 5336, "text": "If you view it this way, it's probably going to be more mentally beneficial to where, Hey, today I did my run."}, {"time": 5344, "text": "I did my body weight exercises."}, {"time": 5344, "text": "I did some grappling practice."}, {"time": 5350, "text": "You know, I spent three hours working out today."}, {"time": 5350, "text": "If you think of it like that, then you know, you're, you're moving your body, you're doing things that are active for a good chunk of the day, especially relative to most people."}, {"time": 5361, "text": "So that's going to actually be very helpful for you."}, {"time": 5367, "text": "Uh, the, the problem or the, the, the battle to get over is going to just be like the, you know, you're going to break down physically running a hundred miles and you're gonna break down physically running a marathon too."}, {"time": 5377, "text": "So like the, you might just have to push through a little more discomfort, like from a physical standpoint compared to be a few decided I'm gonna do everything I can in these next like 24 weeks to be able to run a, a full hundred, a hundred miler."}, {"time": 5394, "text": "Would you say it's physical or is it mental discomfort?"}, {"time": 5394, "text": "Like, uh, I mean, isn't everything physically uncomfortable?"}, {"time": 5400, "text": "Like what, uh, do you train for if you're training for the chaos of, uh, so it's not necessarily the hundred miles."}, {"time": 5406, "text": "It's the chaos of the unexpected, which might include a hundred miles, but it might also include a thousand pushups in my case."}, {"time": 5411, "text": "So like, you need a bit jack of all trades is what you need to be."}, {"time": 5415, "text": "But also like building up the confidence or maybe not."}, {"time": 5419, "text": "How do you survive a thousand pushups?"}, {"time": 5419, "text": "It's combination of confidence that you have to know that you can do that kind of thing."}, {"time": 5427, "text": "Not necessarily the actual number, but like doing crazy stuff."}, {"time": 5432, "text": "And the, the second is probably the base strength and endurance and also just the practicing that process of not quitting."}, {"time": 5443, "text": "I feel like that's one of the things I really need to do in the running space is like doing slightly unpleasant things where I'm yeah, practicing that, like bringing my mind back and saying, Nope, uh, I'm going to keep doing it."}, {"time": 5459, "text": "And part of the running every day has that benefit because some days you really don't want to feel, don't feel like running and doing that."}, {"time": 5464, "text": "Then you're practicing that muscle of, um, of doing it anyway."}, {"time": 5468, "text": "Um, I don't know if there's something you can say in terms of advice, how to practice the, like doing something unpleasant every day frequently."}, {"time": 5474, "text": "What I would do with that is I would try to make the unpleasant thing be different from one day to the next if you can."}, {"time": 5487, "text": "So the fear I would have with making running unpleasant every time would be, it becomes like a negative feedback loop in your physiologically potentially as well as mentally, where if the entire running process is miserable, you're going to be miserable when you step on that starting line, whether it's a marathon or a hundred miles."}, {"time": 5508, "text": "So you've trained yourself that running equals miserable."}, {"time": 5511, "text": "Well, and here's the thing."}, {"time": 5511, "text": "Like if you look at just like, here's where the literature says on paper are like the dozen workouts you should do in a training plan."}, {"time": 5521, "text": "And this is how you should structure them right down to the minute."}, {"time": 5521, "text": "And you just say, like, I'm going to give everyone this schedule and they're going to do this every time rinse and repeat."}, {"time": 5530, "text": "My biggest concern with that approach is you are potentially putting them in a position where the training is so boring and so monotonous that like if they hit a roadblock mentally, they're going to fall apart very quick because they've already exhausted themselves mentally, just trying to do the same old interval every time doing the same old workout."}, {"time": 5547, "text": "And it doesn't necessarily have to be like one specific plan in its entirety could just be like, like the, the mix of things within it."}, {"time": 5557, "text": "So like, rather than like, if I just said, do, oh, we're going to do three minute intervals, this entire short interval process or two minute intervals or four minute intervals or 62nd intervals, you know, by that sixth week, they might be so sick of that, that they're not actually maximizing their potential within that because there's no flavor there."}, {"time": 5597, "text": "Uh, so like, I think what you want to do is you want to introduce the misery."}, {"time": 5617, "text": "So if you can possibly say like, okay, on Tuesdays, the pushup workout, I'm going to go 10 pushups more than I want to."}, {"time": 5628, "text": "I'm going to get to that point where I'm like, there's no more."}, {"time": 5628, "text": "And then I'm going to do 10 more and you're going to make that one miserable."}, {"time": 5631, "text": "And then maybe on, uh, you know, Thursdays you decide to do like some of those sprints or something at the end where you do a few of them and you're like, okay, this is where I'd be comfortable to stop."}, {"time": 5641, "text": "Like, well, I'm going to do two more of them because I know I don't want to do two more of them, um, but mix that up."}, {"time": 5647, "text": "So you're not, so at least you're getting enjoyment from some of it and not just getting complete disgust from the entire process."}, {"time": 5652, "text": "There's actually quite a lot of ways that I can introduce misery into the running, get creative, including, um, you know, even just like stuff outside of the running, like taking a freezing cold showers, those kinds of things, just introducing random kind of chaos into the, into the system, um, or having conversations with people as an introvert."}, {"time": 5673, "text": "More podcasts."}, {"time": 5673, "text": "So, um, now starting, uh, the training and, uh, Zach, you've been kind enough to also kind of, um, be willing to help me out throughout this process."}, {"time": 5688, "text": "So I look forward to where that goes."}, {"time": 5688, "text": "It's kind of, uh, fascinating."}, {"time": 5688, "text": "Um, on the diet side, you're, uh, one of, one of the many things that, uh, make you fascinating is, uh, you've played with diet as well and you're, um, somewhat famous, I would say, for doing low carb or playing with low carb or meat based diets."}, {"time": 5706, "text": "Can you describe the potential, like how you're thinking about that has evolved and the potential beneficial role of a carnivore diet or keto diet or a meat based diet in training as an ultra marathon runner?"}, {"time": 5717, "text": "And I think like where a lot of times things get confusing for people here is the context of it too, where it's like, they want an answer as to what do I eat for endurance sport?"}, {"time": 5726, "text": "And it's like, well, endurance sport is quite wide ranging as we've talked about many, many times here."}, {"time": 5732, "text": "So there's going to be differences, I think, in just like what you want to maybe necessarily prioritize, uh, both for the event you're doing and the intensity that's required for it, the training that's required for that event."}, {"time": 5746, "text": "And then also the individual component too, where I think this one often gets overlooked, where we tend to say like, well, we've got all these Olympic medalists at the marathon and below distance who are, you know, eating a moderate to high carbohydrate diet."}, {"time": 5761, "text": "So everyone needs to do that if they want to reach their potential in, you know, say the three K to the marathon."}, {"time": 5766, "text": "And, you know, in a perfect world, maybe that would be true, but there's a lot of other variables that often get forgotten then that could positively or negatively impact that decision choice."}, {"time": 5777, "text": "So I think Dr. Jeff Volk has done a great job of kind of highlighting this in the sense that, you know, when he works with people, he works with people in the health sphere as well as the performance sphere."}, {"time": 5786, "text": "And, you know, he's one of the main guys at Virta health who's, uh, they've got like a 60% success rate with working with folks with the type two diabetes to, um, reverse their type two diabetes."}, {"time": 5796, "text": "Uh, and I mean, that's an astounding, when you, when you think of just any nutritional protocol, its success rate, they're all incredibly low."}, {"time": 5807, "text": "They're very, very low."}, {"time": 5807, "text": "And the big difference with his is the coaching aspect of it."}, {"time": 5807, "text": "Like the give support."}, {"time": 5812, "text": "So these people like have someone to turn to when they make a mistake, or if they're thinking about doing something differently, or they don't know what to do rather than just kind of throwing, throwing it all up in the air and quitting."}, {"time": 5820, "text": "They, they, they have a resource there."}, {"time": 5824, "text": "And that's probably a big reason why that's the success rate that they have with that, is they put those support mechanisms in place."}, {"time": 5827, "text": "That picture needs to be carried into the performance world or the running world too, where, you know, we may have just been identifying that, uh, you know, Olympic distance athletes that can tolerate a very large portion of their diet coming from carbohydrate is going to just, it's going to filter those ones towards the Olympics filter those towards interesting."}, {"time": 5851, "text": "And that doesn't mean that like, uh, if we would have taken say the gold medals in the five came, put them on a low carb diet, they'd run faster."}, {"time": 5858, "text": "They probably wouldn't, because we may have already selected that that person's thriving on carbohydrate."}, {"time": 5865, "text": "Uh, what I would be interested in is like, you have, let's say we have someone with equal talent, but got weeded out along the way potentially because for whatever reason, they just weren't able to tolerate like the, both the training and the nutrition requirements that they're being told to do."}, {"time": 5880, "text": "So the coaches can, there's a culture where the coaches would really push a carb heavy diet and that that would in itself would do the filtering process of people that are not, it would filter out the people that are not able to tolerate carbs as part of their training."}, {"time": 5896, "text": "I mean, I might be an example of this actually where, you know, you take someone where, uh, they, for whatever reason, the carbs aren't working for them."}, {"time": 5900, "text": "Like it's unsustainable for them to continue that path."}, {"time": 5904, "text": "Or if they do, they might have a shortened career, so they might be able to eke out a few really good years, but then, you know, they're not going to be the person they're like, wow, that person's 38 and they're still competing at the Olympics type of a person."}, {"time": 5910, "text": "Uh, and, you know, you, you, you put them on a low carb diet, uh, if you can control everything else, like their entire lifestyle is based around training and racing, then, uh, you know, they may still have better potential by introducing carbohydrates at a higher level."}, {"time": 5929, "text": "But if that's not going to, if that's not going to be sustainable for them as a person, then, you know, what's the point kind of at that, unless they want to be like a kind of a spark in the pan, so to speak."}, {"time": 5944, "text": "I just feel good eating meat performance wise."}, {"time": 5944, "text": "Well, I think there's that group too."}, {"time": 5949, "text": "And they may just not be the Olympians."}, {"time": 5949, "text": "And so we're not talking, I guess this conversation has several layers."}, {"time": 5955, "text": "One is for the Olympics and one is for like, what is it?"}, {"time": 5962, "text": "Active athletes that are like amateurs, whatever, whatever category I put myself into, like people that exercise regularly."}, {"time": 5968, "text": "And then, um, maybe people, and then there's people who like exercise rarely."}, {"time": 5973, "text": "So on all of those fronts, I mean, do you think it's possible to live a happy, uh, active life eating meat only or mostly meat?"}, {"time": 5988, "text": "What have you learned about this?"}, {"time": 5988, "text": "I think, uh, so for, for some context, like I followed what I would call a low carbohydrate diet for the last 10 years."}, {"time": 5996, "text": "And just like kind of the training, I periodize it to a degree where there are parts of my training where I do bring back a little more carbohydrate."}, {"time": 6001, "text": "And there's periods of my training, especially like the off season where I'm like very low and I might be like kind of in that ballpark of, uh, like, you know, ketogenic, strict ketogenic or no carbohydrates for, for periods of time."}, {"time": 6014, "text": "And what kind of food are we talking about?"}, {"time": 6014, "text": "What's a strict low carb diet?"}, {"time": 6018, "text": "I've ranged everywhere from like mostly plant based, low carb keto to like mostly animal based."}, {"time": 6023, "text": "I very rarely gone much more than like two weeks strict where it's like I'm strict carnivore or strict plant based or anything like that."}, {"time": 6030, "text": "Like we're talking probably more like 95% at the, at the peak."}, {"time": 6035, "text": "Um, in terms of any type of like, like longer lasting, uh, from my personal experience of like being like either in like the animal food camp or her, like the plant based camp kind of a, of a process."}, {"time": 6047, "text": "Um, so I've tried all of them, things that stayed consistent over the 10 years as a kind of the macro nutrient profile that I've done throughout the course."}, {"time": 6052, "text": "So one didn't win over the other in terms of meat based versus plant based."}, {"time": 6056, "text": "Oh, for me, meat based, definitely."}, {"time": 6060, "text": "What was, I mean, I was, I was my highest meat consumption in 2019 and that was by far my best racing season."}, {"time": 6064, "text": "We keep, we keep coming back to that year."}, {"time": 6064, "text": "That was a good year for many reasons, philosophically and nutritionally."}, {"time": 6068, "text": "Well in 2020 happened and now I haven't had a really good chance to, to, uh, to improve."}, {"time": 6073, "text": "Hopefully I've got some more, some more in the tank."}, {"time": 6078, "text": "There's so most athletes that compete at your level have more carbs integrated into their diets."}, {"time": 6083, "text": "So what have you learned about using meat in a high performance?"}, {"time": 6089, "text": "I think it's maybe less about the meat and it's more about like, what are you, what is it replacing?"}, {"time": 6095, "text": "So if we go, if we step away from like me specifically and just like the people that, cause I mean, we're getting to the point where I get it's anecdotes, but like, like that's what we have at the moment."}, {"time": 6107, "text": "Cause there's, I mean, there is actually a study being done on, like, I think I guess they'd call it hypercarnivore where they're like, I think above 80% of their intake from meat."}, {"time": 6115, "text": "Um, and they're looking at a few different things there, but it's so weird and I keep interrupting, but it's so weird that it sounds unhealthy, uh, hypercarnivore."}, {"time": 6121, "text": "But it makes me feel really good."}, {"time": 6127, "text": "So I, that's the individual thing, right?"}, {"time": 6127, "text": "There's countless people now who like, and I'm not saying that they could not have found another route, myself included, like in 2011, when I switched from moderate to high carbohydrate to low carbohydrate and saw some very noticeable differences in the way I felt, the way I performed in all this stuff, that doesn't mean that there wasn't another path."}, {"time": 6150, "text": "I just did not find that path."}, {"time": 6150, "text": "And the, the, the fact that I found a path that was producing the results I was looking for is really all that matters in my mind."}, {"time": 6162, "text": "You know, like I don't really care if there was a parallel path that works just as well or, you know, something like that, because ultimately we only have one shot at everything we're doing."}, {"time": 6172, "text": "So like, it'd be great if I could go back and try four or five different things."}, {"time": 6172, "text": "Well, the annoying thing is that the body adjusts to whatever the heck you're doing."}, {"time": 6175, "text": "So you can't, it's hard to do good science even on yourself."}, {"time": 6180, "text": "I've referenced my 2019 racing season a few times and it's like, it'd be silly for me to put all of the emphasis on my nutrition plan for that, because it's also comes with two decades of endurance training."}, {"time": 6189, "text": "So it's possible and it's it's possible."}, {"time": 6194, "text": "And it's very likely that a huge portion of that success was just the culmination of a lot of work over time from the training side of things."}, {"time": 6199, "text": "I just think like anytime you hyper focus on one area or pick a couple of variables and just target those, you find yourself in a position where you are, you're putting other things in the most uncharitable light possible."}, {"time": 6215, "text": "So, so then you have this situation where like, it's actually a combination of a variety of different things."}, {"time": 6220, "text": "So where are the big movers?"}, {"time": 6220, "text": "And you know, for me, nutritional shift was pretty clear that that improved my sleep and my recovery."}, {"time": 6225, "text": "And I mean, people can say, well, there's the placebo effect, which is a very real concern."}, {"time": 6231, "text": "But you know, for me personally, a 10 year placebo effect would be a quite lengthy placebo effect."}, {"time": 6236, "text": "And I do think it's individual, though I emphasize that a lot because I mean, I've worked with tons of people with this and I do see a range from person to person."}, {"time": 6247, "text": "I've worked with people who come to me and they're like strict keto and we raise up their carbohydrates a bit."}, {"time": 6253, "text": "And they're like, okay, I feel way better doing it this way."}, {"time": 6253, "text": "And I've worked with people who they come to me moderate carbohydrate, but they're interested enough."}, {"time": 6263, "text": "They want to try a lower carb."}, {"time": 6263, "text": "So we, you know, we titrate them down and I've had clients where I'm like, okay, I'm gonna give them this workout."}, {"time": 6268, "text": "And they're gonna wish they brought back a little bit of carbohydrate."}, {"time": 6272, "text": "And then they go and they nail the workout."}, {"time": 6272, "text": "And I'm just like baffled that because because they're different from me."}, {"time": 6276, "text": "And every time, you know, when you have your own personal experience, the first guttural response is, oh, if I had done it, it would have gone this way."}, {"time": 6285, "text": "Why did it go the complete opposite way for them?"}, {"time": 6285, "text": "And you kind of have to just kind of step out of your own perspective a bit and say like, okay, well they're different, you know, for whatever reason they're getting, getting along like this."}, {"time": 6293, "text": "I've had like several moments in my life where you kind of realize the body is weird and it's weirder than the average advice."}, {"time": 6298, "text": "Like one of them is how well I perform for my own standards when I fast."}, {"time": 6304, "text": "First of all, intellectually, but that's more known and understandable."}, {"time": 6312, "text": "But like physically, the fact that I could train, like not eat 20 hours, 24 hours, and then do a hard like jiu jitsu session for like two hours, like hard."}, {"time": 6326, "text": "It's incredible to me."}, {"time": 6326, "text": "Like this makes no sense."}, {"time": 6326, "text": "Cause I used to eat like many times a day."}, {"time": 6333, "text": "Of course you have to eat, like you don't want to eat too close to the training session was my thinking, but you definitely need to load up on carbs like three hours before they can, in order to have enough energy."}, {"time": 6341, "text": "The fact that I could not eat and have like incredible focus, but also athleticism, like both endurance and explosive."}, {"time": 6347, "text": "I mean, jiu jitsu is a special thing."}, {"time": 6354, "text": "It's like more like chess."}, {"time": 6354, "text": "It's not like powerlifting, no, not powerlifting, Olympic lifting, where it's like true explosiveness, but that's fascinating."}, {"time": 6358, "text": "And it makes me wonder like, what other things are there to discover about yourself?"}, {"time": 6364, "text": "The annoying thing about food is it's delicious."}, {"time": 6371, "text": "And so it's hard to do good science on yourself, like to do, you know, for two weeks or a month to do like strict no carbs."}, {"time": 6377, "text": "And then maybe next month you add 20 grams or 40 grams of carbs and see how you actually feel."}, {"time": 6385, "text": "Not like in that moment, but over a period of several weeks and then doing everything else right with based on best available science, like with electrolytes and then vitamins, but then also like remove all the humans from your life that affect you positively or negatively."}, {"time": 6401, "text": "Cause you might feel amazing because you're hanging out with cool people and then, you know, like removing basically all the variables."}, {"time": 6405, "text": "And you kind of, all of us land in a place where we find something that worked for us."}, {"time": 6411, "text": "And then we maybe use some of the placebo effect to help us out, to stick in that place."}, {"time": 6417, "text": "And then I suppose that's the way to live life."}, {"time": 6423, "text": "I guess it's impossible to find the optimal for any of us, but carnivore is an interesting new kind of caveat, a new challenge to the nutritional community, because more and more people seem to be doing well under carnivore."}, {"time": 6439, "text": "Well, the nutrition community is probably like, we just got done like dealing with the vegans and now we got this opposite end of the spectrum coming at us."}, {"time": 6444, "text": "But I think, well, I mean, what this all tells, what this all tells me is like, there is a, for one, like in our food environment, like the failure rate of any one approach at a population level is going to be incredibly high."}, {"time": 6461, "text": "I mean, it's why we have, you know, what is it like 88% of the population has some sort of like metabolic syndrome."}, {"time": 6466, "text": "And it's, it's like, you know, it's because there's an endless quantity of everything that you can get your hands on for relatively cheap."}, {"time": 6470, "text": "And I think that's, that, that presents a problem."}, {"time": 6476, "text": "If your mindset is going to be, we need this set of parameters for nutrition and everyone needs to adhere to that or you're wrong."}, {"time": 6482, "text": "And it's like, well tell that to the person who like went carnivore and cleared up some like crazy skin ailment or something like that."}, {"time": 6493, "text": "That's a weird one."}, {"time": 6493, "text": "Like where the carnivore seems to treat like, like depression, like mental stuff."}, {"time": 6499, "text": "There's all these stories."}, {"time": 6499, "text": "Again, it's anecdotes, but it's like the mental one, I think may, I'm stepping out a bit on a limb here, but I want to say like some of the research of Dominic DiAgostino and Jeff Volokh was looking at the ketogenic diet, which of carnivore diet is basically going to be a part of a ketogenic."}, {"time": 6517, "text": "I mean, you could always go like way too high on the protein, I guess, but most people that I see doing carnivore, they're cognizant enough that at least if they're doing it for therapeutic reasons, they're not going like, you know, 50% protein, 50%."}, {"time": 6534, "text": "They're more like 70, 30, 80, 20, something like that."}, {"time": 6540, "text": "And, and I think like you, you do see some, some work with like the brain."}, {"time": 6540, "text": "So the mental stuff, I know some of the, I'm not sure if this was part of the DARPA funding that, that Dr. Dominic DiAgostino had where they were looking at things like mental stuff, like post traumatic stress disorder and that sort of stuff with, with like a strict ketogenic diet."}, {"time": 6558, "text": "So I wonder if some of that, like the depression related stuff has to do with that, where now like their body is just fueling their brain differently than maybe they were in the past, but that's just, you know, wild guesses on my part."}, {"time": 6571, "text": "And I'm deviating from the conversation, but like, no, that's brilliant."}, {"time": 6576, "text": "In terms of your own story on food, can you say something?"}, {"time": 6576, "text": "I think we were kind of referring to diet broadly."}, {"time": 6582, "text": "Can you say something about how you like to fuel your like, whether it's race or great training sessions, like maybe the day before, let's go even that far during, and maybe a few hours after."}, {"time": 6598, "text": "It'll be a little different for racing than it will be for like a big workout, just because the interesting thing about ultra running is just like, you never do the race even like most endurance races, you're going to cover the distance."}, {"time": 6608, "text": "You're going to replicate the race almost up to it in training."}, {"time": 6611, "text": "Whereas with a hundred miles, you can't, you might replicate a third of it."}, {"time": 6616, "text": "So, so I'll do, I'll walk you through kind of my approach for, for like a hundred mile race."}, {"time": 6621, "text": "And I can tell you maybe what I would do differently on like a training day."}, {"time": 6621, "text": "But yeah, so for where, where the community is an agreement is that you do want to be very good at burning fat for ultra marathons."}, {"time": 6633, "text": "I mean, there's just like the intensity is low."}, {"time": 6633, "text": "If your, if your ratios are skewed very high towards carbohydrate metabolism, then you're going to have to defend your muscle glycogen through tons of carbohydrate consumption."}, {"time": 6647, "text": "And that's just going to be very hard to do over the course of an entire day, even at low intensities."}, {"time": 6652, "text": "So it's a fuel tank thing."}, {"time": 6652, "text": "I mean, it's like your, your leanest endurance athletes have way more fat than they do."}, {"time": 6656, "text": "Glycogen stores."}, {"time": 6661, "text": "When you're doing the low intensity performance, you want to be burning high levels of fat and sparing that muscle glycogen."}, {"time": 6665, "text": "What I tend to do is I want to start the race burning really high levels of fat."}, {"time": 6671, "text": "So I'm going to, I'll maybe have some carbohydrate the night before for dinner, but then I'm going to lean into the overnight fast breakfast the morning of I'm going to stay away from carbohydrates for a hundred mile or anyway."}, {"time": 6680, "text": "And I'm going to have something like something that's pretty like a high energy, low volume."}, {"time": 6685, "text": "So like I'll do like an S fuels, a life bar."}, {"time": 6693, "text": "They've got like, what's in an S fuel life bar?"}, {"time": 6693, "text": "Are we talking about carbs or we're talking about protein fat and protein?"}, {"time": 6698, "text": "Fat protein bar."}, {"time": 6698, "text": "And then they make some awesome."}, {"time": 6698, "text": "So it's, it's not as low carb."}, {"time": 6705, "text": "They make S fuels makes a whole product line."}, {"time": 6705, "text": "That's like kind of positioned for a low carb athlete."}, {"time": 6709, "text": "So they have some products on their lineup that offers some carbohydrate, which is perfect for me because I do introduce some carbohydrate on racing and some of my bigger training sessions and things, but the majority of their products are low carb."}, {"time": 6724, "text": "So like they have like, you know how you get like the powders that you put into like your drinks that are like high carbohydrate, you know, sports products."}, {"time": 6729, "text": "They make a version of that."}, {"time": 6733, "text": "That's like fat based."}, {"time": 6733, "text": "That you can mix in with water."}, {"time": 6733, "text": "So they've got like a creamer version and then a fruity flavored version."}, {"time": 6739, "text": "So you can like replicate the taste and the feel of drinking like a, like, you know, a sports drink."}, {"time": 6743, "text": "Science is awesome."}, {"time": 6743, "text": "I know it is."}, {"time": 6747, "text": "Well, and that's so much of it too, cause people are always like, well, I don't know."}, {"time": 6747, "text": "I just, I just like to have my Gatorade or whatever."}, {"time": 6750, "text": "It's like, well, you can have it now."}, {"time": 6750, "text": "It just, it won't have all that."}, {"time": 6755, "text": "So you can bring that kind of thing with you."}, {"time": 6755, "text": "So I'm leaning on a lot of those like kind of liquid calories, like those low volume, high energy fat protein stuff the morning of so that when I start the race, my body's going to be encouraged to start out burning high levels of fat."}, {"time": 6768, "text": "Once I get going probably about 45 minutes in, I'll start introducing small amounts of carbohydrate."}, {"time": 6775, "text": "So at that point, my body's been revving pretty high fat metabolism and by introducing some carbohydrate in the context of the, you know, let's say my a hundred mile, uh, personal record, you know, I'm, I'm running approximately nine miles every hour."}, {"time": 6792, "text": "So I'm probably going through about a thousand calories in an hour's time."}, {"time": 6792, "text": "Uh, I'm going to start just like defending muscle glycogen by burning super high levels of fat at the heart rate I would do for that."}, {"time": 6803, "text": "I'm probably burning somewhere between 80, 90% fat, you know, 12 hours of that you can chip away at your muscle glycogen, uh, to the point where you don't necessarily want to go zero carb."}, {"time": 6812, "text": "So I'm basically just trying to defend what I know I'm going to be burning from the carbohydrate side of that 80 to 90% fat, 10 to 20% carbohydrate by taking in like, usually, you know, I've gone as low as about 15 grams of carbohydrate per hour and as high as 40 grams."}, {"time": 6829, "text": "Um, and the reality is somewhere in between is probably the sweet spot, but 40, I can get away without any digestion issues."}, {"time": 6834, "text": "So I'm not really concerned pushing up to that during a race since I'm only concerned about performance on that day, the carbs, the problem, or is it fiber?"}, {"time": 6845, "text": "Oh, from going above 40 grams or just cause you mentioned digestion issues."}, {"time": 6845, "text": "Like one of the things for me, like one of the cool things about fatty protein protein and fat is like my stomach just feels way better."}, {"time": 6856, "text": "So like carbs introduce like bloating and just not feeling great."}, {"time": 6862, "text": "And I think the funny thing is like, if you look at the position paper for ultra marathon single day events and it's, you know, it's very limited in the sense that then it's not anyone's fault."}, {"time": 6871, "text": "It's just, we don't have a lot of great research on a hundred mile race."}, {"time": 6871, "text": "It's really hard to study what's going on when someone's running a hundred miles, but they'll say moderate carbohydrate diet is recommended, but they'll also say that it's like something like 60% of participants are going to report some sort of like digestion issue during the event."}, {"time": 6885, "text": "So then it kind of becomes an issue of, do you want to flip that coin?"}, {"time": 6889, "text": "Do you want to flip that coin and be the 40%."}, {"time": 6893, "text": "So for me, what I found is like, I can push up to 40 grams without getting any digestion issues."}, {"time": 6900, "text": "Um, do I need 40 grams?"}, {"time": 6900, "text": "Probably not, at least not based on kind of the numbers that would be like, uh, that, that I would see on, like if I went and actually got a, like a metabolic heart test or something like that."}, {"time": 6912, "text": "Um, but it's possible."}, {"time": 6912, "text": "I mean, if I had a really good race that I would get close to burning that per hour, um, most folks that are following a moderate high carbohydrate diet are going to be recommended to do like 50 to 70 grams during a single day ultra marathon events."}, {"time": 6924, "text": "And you'll see some, you know, some recommendations of up to like a hundred grams, uh, not so much for ultra marathons, but just in general, from like a performance standpoint, which I mean, it's one of those things where it's like application versus like what you can do in a lab for one hour is going to be a lot different, especially when you're stretching out distances well past that."}, {"time": 6943, "text": "And you, you, there's, there's, I'm diverting a little here, but I mean, there's like an approach of like training your gut so you can like be able to tolerate that much carbohydrate, which you can do, and you may have to, if you're going to follow a high carbohydrate diet."}, {"time": 6980, "text": "Most people who are running ultra marathons aren't going to be, you know, probably training much past 10 hours per week."}, {"time": 6984, "text": "And they're probably not going to have the, I'll call it their, a dietary budget to tolerate a hundred grams of carbohydrate consumption during their workouts and still be able to stay healthy."}, {"time": 6995, "text": "And, you know, so I think that's kind of like a, a bit of a, of a non, a non starter for the majority of people, unless we want to talk about like a tiny percentage of the 1% of top performers."}, {"time": 7011, "text": "So maybe you can talk about the training, like fueling yourself during training as well."}, {"time": 7015, "text": "Is there, and also as part of that, is it possible to train mostly fasted?"}, {"time": 7022, "text": "Because as a side comment, let me just say, I like, again, not anywhere, not even like one 10th of your level of performance, but you know, I, I try to push myself and I just feel much better when I'm fasted."}, {"time": 7035, "text": "So water and maybe some salt for longer runs for anything over like 10, 15 miles, but not no food."}, {"time": 7041, "text": "I think, I mean, I like to train on an empty stomach."}, {"time": 7041, "text": "I do most of my, my biggest training session usually in the morning."}, {"time": 7047, "text": "And it usually what will determine whether I eat something or not before that is like, how much do I need to eat that day in order to stay on top of it, to build training in the next day."}, {"time": 7053, "text": "So I'll, I'll, I'll usually do something similar to what I do before a race."}, {"time": 7058, "text": "If I need to kind of stay on top of calories for the day."}, {"time": 7058, "text": "So I'm not like at noon with like no calorie intake and like 5,000 calories to try to consume before I go to bed that night and get out and do the same thing the next day."}, {"time": 7068, "text": "But yeah, I think if I were, if I were doing what you're doing, like if that were my lifestyle, I think I would do almost all my runs fasted."}, {"time": 7080, "text": "I don't see why I would be eating a lot before it because it's like I'm just introducing something that could, especially if you're noticing, like here's what I'd say."}, {"time": 7091, "text": "If I was doing that and I was like, wow, this run sucks."}, {"time": 7091, "text": "And then I introduced something beforehand and now my run was feeling great and my progress was getting better."}, {"time": 7095, "text": "That's when I would maybe consider having something before."}, {"time": 7099, "text": "But if you're running both of those, those like self experiments, you're noticing, yeah, if I eat something before I go on this workout, the workouts less enjoyable, I'm not noticing any, any increased improvements on it."}, {"time": 7108, "text": "Again, it's a little messy."}, {"time": 7108, "text": "Like we said before, it's hard to really, you can't go back and try it a different way on that specific day."}, {"time": 7117, "text": "But I think, I think most people, if they're just like, they go at it with like no bias in the sense that they're like trying to make one work versus the other, you can get at least a good enough look at it."}, {"time": 7128, "text": "And if absolute peak performance in one activity, one very specific activity isn't your goal, then it's like, do you really care if one has a 2% performance increase that you won't even probably notice because there's other variables that will clearly overpower that 2% one way or the other."}, {"time": 7146, "text": "And there's some benefit in terms of freedom and letting go of like having to think about some of these variables."}, {"time": 7151, "text": "I see sort of fasting as even if it's like a hit on the performance, it's worth it to just not think about it."}, {"time": 7157, "text": "There's some really nice aspect to just putting on shoes, not caring like what shorts you wear or like what your outfit is, like not being optimal in every way and just not caring and just enjoying the purity of just running no matter what."}, {"time": 7175, "text": "Just enjoying the natural aspect."}]}]