[{"title": "Ryan Hall: Martial Arts and the Philosophy of Violence, Power, and Grace | Lex Fridman Podcast #125", "id": "hhEwWghH_XM", "quotes": [{"time": 367, "text": "It's not so much about the money, but the glory and a delicious taste of victory."}, {"time": 373, "text": "If you have ideas for a contest, let me know."}, {"time": 375, "text": "I was thinking of something like asking people to submit funny, inspiring photos or videos or audio of using Cash App or any of the sponsors of this podcast, really, or maybe even just funny things related to the podcast, like different weird places you might be watching or listening to me right now."}, {"time": 394, "text": "I'm pretty sure there's somebody out there right now sitting in a hot tub with some wine watching me say this."}, {"time": 401, "text": "I salute you, sir or madam."}, {"time": 404, "text": "I may be opening up some floodgates I deeply regret later, so please make sure you're wearing clothes and whatever you sent me."}, {"time": 411, "text": "There'll be no naked people in the hot tub as part of this podcast."}, {"time": 416, "text": "I have integrity and standards."}, {"time": 419, "text": "Let me know in the comments what ideas for contests you might have."}, {"time": 422, "text": "Again, if you get Cash App from the App Store or Google Play and use the code LexPodcast, you get $10, and Cash App will also donate $10 to FIRST, an organization that is helping to advance robotics and STEM education for young people around the world."}, {"time": 437, "text": "And now, here's my conversation with Ryan Hall."}, {"time": 442, "text": "Who, in your view, is the greatest warrior in history?"}, {"time": 445, "text": "Ancient or modern?"}, {"time": 447, "text": "That's a tough question, and again, I'm no historian by any measure, so I'll probably do the worst."}, {"time": 452, "text": "It's like, what are your best bands ever?"}, {"time": 454, "text": "I'm like, Metallica, and you know, so I'll pick the... Metallica just came out with a new album, by the way, with an entire orchestra."}, {"time": 462, "text": "That's important."}, {"time": 463, "text": "Metallica will always be one of the greatest."}, {"time": 467, "text": "They were a bad example."}, {"time": 467, "text": "They were a well known, yet awesome band."}, {"time": 469, "text": "Let me say it's like Nickelback or something like that."}, {"time": 470, "text": "I mean, that feels cheap because everyone makes fun of Nickelback."}, {"time": 474, "text": "I guess it depends on how you want to define warrior."}, {"time": 503, "text": "The amount of successful Olympic level competitors they have in wrestling, boxing, judo."}, {"time": 509, "text": "I mean, they're a tiny little island with no money and no people."}, {"time": 512, "text": "That's shocking."}, {"time": 513, "text": "You know, when you think about the Olympics and the United States doing well, of course we should do well."}, {"time": 517, "text": "I mean, Russia should do well."}, {"time": 519, "text": "China should do well."}, {"time": 520, "text": "India should do better than they do, honestly."}, {"time": 522, "text": "Obviously it means like they're not into it as much or at least certain sports because they have the resources people wise."}, {"time": 528, "text": "So talent's not going to be an issue."}, {"time": 529, "text": "So there's something to like where the starting point is."}, {"time": 533, "text": "Like that's the argument with like, why people say Maradona, I don't know if you're into soccer, okay."}, {"time": 540, "text": "They say Maradona is better than Messi because he basically carried the team and won the World Cup with a team that wouldn't otherwise win the World Cup."}, {"time": 549, "text": "And then Messi was only successful in Barcelona because he has like superstars, he's playing with other superstars."}, {"time": 558, "text": "Yeah, that's fair to say."}, {"time": 559, "text": "I mean, like you're not, there's a lot of factors that go into, let's say winning a soccer game."}, {"time": 563, "text": "And obviously Barcelona, particularly for various points in time had a ridiculous all star squad of world class players."}, {"time": 569, "text": "But let's say for instance, maybe they didn't have the creative players in Argentina."}, {"time": 574, "text": "They needed to get the ball up to Messi."}, {"time": 576, "text": "They didn't have like the NES and again the backing there in the midfield."}, {"time": 581, "text": "But because obviously Argentina's always had ridiculous attacking players, like even alongside Messi, but they're like the three killers up front and then a little less behind."}, {"time": 590, "text": "So it's interesting you say that depends how you define warrior because you can probably take like some of the civil rights leaders, you can go into that direction, like leaders in general."}, {"time": 600, "text": "But if we just look at like the greatest martial artists in history in that direction, do you have somebody in mind?"}, {"time": 605, "text": "I would say at least three that pop into my head and would be Hannibal, Alexander the Great, and then maybe Miyamoto Musashi, the two commanders and then one guy."}, {"time": 618, "text": "But so it's interesting."}, {"time": 621, "text": "And then again, you mentioned warriors being able to make a lot out of a little."}, {"time": 625, "text": "Musashi's famous for winning duels that were oftentimes one on one."}, {"time": 631, "text": "The Alexander and Hannibal were military commanders and one of them faced Rome."}, {"time": 636, "text": "And that was an interesting thing."}, {"time": 638, "text": "Oftentimes coming up with novel tactics, different strategies, sometimes under resourced, having to do novel and crazy things, there's skin in the game."}, {"time": 646, "text": "That's an interesting thing too."}, {"time": 647, "text": "I think a lot of times it's, if you're playing a video game, I don't think you can be a warrior because there's no skin in the game."}, {"time": 653, "text": "You get hurt, you lose, that's a bummer."}, {"time": 656, "text": "It stings a little bit, maybe it makes you feel slightly disappointed, but Musashi loses, he loses."}, {"time": 662, "text": "Hannibal loses, he loses."}, {"time": 664, "text": "Alexander loses, he loses."}, {"time": 665, "text": "And they lose, I guess the people around them lose."}, {"time": 668, "text": "So that's almost like you could use, even from a combat sports perspective, Muhammad Ali, I mean, you consider also their quality of opposition."}, {"time": 675, "text": "Musashi was fighting high quality opposition."}, {"time": 677, "text": "Obviously Hannibal and Alexander, particularly Hannibal, were fighting unbelievable opposition."}, {"time": 682, "text": "Muhammad Ali fought phenomenal opposition, but he had skin in the game both in the ring and out."}, {"time": 687, "text": "And that actually meshes with, as you mentioned, like a civil rights type of situation where you are under resourced, you're pushing the stone uphill."}, {"time": 695, "text": "And that was a neat thing I think about Muhammad Ali was how much personal conviction the man had to have in order to pull off what he was able to pull off both in and outside of the ring."}, {"time": 704, "text": "And that reminds me of, again, some of the other great leaders or great fighters throughout history."}, {"time": 708, "text": "So what do you make of the kind of very difficult idea that some of these conquerors like Alexander the Great and somebody that, if you listen to Hardcore History, oh, Dan Carlin, who apparently Elon Musk is also a big fan of, is the Genghis Khan episode."}, {"time": 727, "text": "A large percent of the world can call Genghis Khan an ancestor."}, {"time": 740, "text": "So the difficult truth is about some of these conquerors is that there's a lot of murder and rape and pillage and stealing of resources and all that kind of stuff."}, {"time": 752, "text": "And yet they're often remembered as quite honorable."}, {"time": 757, "text": "I mean, in the case of Genghis Khan, there's a lot of people who argue, if you look at historically the way it's described in full context, is he was ultimately, given the time, he was a liberator."}, {"time": 772, "text": "He was a progressive, I should say."}, {"time": 777, "text": "In terms of the violence and the atrocities he committed, he, at least in the stories, has always provided the option of not to do that."}, {"time": 787, "text": "It's only if you resist, do, so you basically have the option, do you wanna join us or do you want to die?"}, {"time": 794, "text": "And die horribly."}, {"time": 797, "text": "That's the progressive sort of, that's the Bernie Sanders of the era."}, {"time": 804, "text": "That there's so much of these great conquerors, there's so much murder that to us now would just seem insane."}, {"time": 813, "text": "It's funny you mention it."}, {"time": 814, "text": "I think that maybe it's a human nature thing that we want to, or maybe a misunderstanding thing that we want to cast all of our characters and ourselves maybe as entirely good or as entirely negative when I guess the phrase or the saying, one man's freedom fighter is another person's terrorist, is accurate."}, {"time": 835, "text": "And a lot of times I think you can understand as long as you're able to look from various people's perspective."}, {"time": 840, "text": "Like if you look at the TV show, The Wire, which was obviously widely, everybody loves The Wire."}, {"time": 846, "text": "I thought that there were everyone, I'm not saying anything that's not been said before, compelling characters from all angles, whether you like the character, dislike the character, you were able to understand the motivations of people doing various things."}, {"time": 857, "text": "Even if they did wrongly, they did rightly."}, {"time": 860, "text": "We want to cast all of the demons throughout history as completely inhuman when I think that makes it difficult for us to understand them."}, {"time": 867, "text": "And we want to look back at the people that we think of as great and entirely great."}, {"time": 873, "text": "And I think that we're experiencing the problems with this even right now, socially and politically as we're trying to look back and decide the people we thought were good or not good or people we thought were bad are now good rather than going, hey, there's good and bad to all things."}, {"time": 886, "text": "And there are, as you mentioned, the Genghis Khan thing, you don't have to fight back."}, {"time": 892, "text": "You do, I respect you for it, but then we're gonna have a conflict and then we'll see what happens."}, {"time": 896, "text": "And if you lose, you're gonna be sorry that you did because I have to make it that way."}, {"time": 899, "text": "If I want to continue utilizing this kind of MO because I need to discourage the next guy from doing what you're doing right now."}, {"time": 907, "text": "And ultimately though, I guess that's an interesting thing."}, {"time": 910, "text": "Imagine you put every single person on planet earth in a cage, crime drops, all sorts."}, {"time": 916, "text": "There are certain positives to that."}, {"time": 918, "text": "And it's just, things are as they are, it's difficult, but that is ultimately more the law of the jungle."}, {"time": 925, "text": "And I think that we're able to supersede some of that now in modern times and I think we're fortunate."}, {"time": 930, "text": "But as you mentioned, we look back and say, oh, this is horrible."}, {"time": 933, "text": "Say, no, that just is what it is."}, {"time": 935, "text": "That's how life is at a base level."}, {"time": 937, "text": "And again, if you're a lion and I'm a gazelle, I don't really like it very much, but we don't call the lion the bad guy."}, {"time": 944, "text": "We don't sanctify the gazelle or the other way around."}, {"time": 947, "text": "So it's just, it's interesting when you pull back some of the controls that we put on our behavior and in modern life, which I think are generally speaking positive, we get down to how things often are."}, {"time": 959, "text": "And at the same time, we could, modern life was built by people like Genghis Khan."}, {"time": 966, "text": "So then you get down to the ends justifying the means."}, {"time": 969, "text": "It's a tough question."}, {"time": 970, "text": "These aren't things with easy answers, or at least if they are, I certainly don't have the smarts to figure out the answers to them, but it's difficult."}, {"time": 978, "text": "I would just say people in the world are complicated and layered and depending upon which side of the line you're standing on at various times, you may like or dislike someone, but I can't remember whose idea it was, this is killing me, but it's the veil of ignorance, I guess, the philosophical idea of the veil of ignorance where I go, is sticking everyone in the cage the right thing to do?"}, {"time": 1001, "text": "Or everyone but me, and I say, well, no, why?"}, {"time": 1003, "text": "Well, it would make my life easier if I just went over and took all of your stuff as long as you couldn't stop me."}, {"time": 1007, "text": "I mean, of course that's a great idea."}, {"time": 1008, "text": "That's what everyone does in every video game."}, {"time": 1010, "text": "But in Skyrim, you steal stuff when people aren't around."}, {"time": 1013, "text": "But ultimately you go, well, this isn't the right thing to do because if I were on the other side of it, I would not appreciate it."}, {"time": 1020, "text": "It's inherently not a good thing to do."}, {"time": 1022, "text": "I'm only doing it because I think I'm gonna win."}, {"time": 1024, "text": "And that's a fine way to be, but you don't have the white hat on, I guess I would say."}, {"time": 1028, "text": "So I think without those philosophical underpinnings to rein us in, I guess, morally speaking, it's very difficult to say what's right or wrong."}, {"time": 1037, "text": "And you'd say certain actions have a reaction, almost like a physics sense."}, {"time": 1041, "text": "If you kill everyone in your way for as long as you're able to, your life will be easier."}, {"time": 1047, "text": "I mean, you're setting the table for someone doing the same to you when you're no longer the tough guy, but it is what it is."}, {"time": 1052, "text": "Yeah, if you look at like the Instagram channel, nature is metal, it hurts my heart to watch, to remind me, a comfortable descendant of ape, how vicious nature is, just unapologetically, just, I mean, there's a process to it where the bad guy always wins."}, {"time": 1078, "text": "The violence is the solution to most problems, or the flip side of that running away from violence is the solution depending on your skillset."}, {"time": 1090, "text": "And it's funny to think of us humans with our extra little piece of brain that we're somehow trying to figure out, like you said, in a philosophical way, how to supersede that, how to like move past the viciousness, the cruelty, just the cold exchange of nature."}, {"time": 1110, "text": "But perhaps it's not so, maybe that is nature, maybe that's the way of life, maybe we're trying too hard to, we're being too egotistical and thinking we're somehow separate from nature, we're somehow distant from that very thing."}, {"time": 1126, "text": "I couldn't agree with you more."}, {"time": 1127, "text": "In fact, I think actually Orson Scott Card, who's the writer of a great book called Ender's Game, this was a statement that the main character, Ender, made in the book."}, {"time": 1138, "text": "His brother was brilliant."}, {"time": 1140, "text": "His brother was like kind of sociopathic brilliant kid that ended up kicked out of the school that they were all into for Battle Commander."}, {"time": 1147, "text": "Dealing with his brother taught him that ultimately strength, courage, the ability to do violence for all the good and the bad of that is one of the fundamental most important things to be able to do in life, because if you can't cause destruction, if you can't cause pain, you will be forever subject to those who can."}, {"time": 1163, "text": "And I think that you mentioned egotism."}, {"time": 1165, "text": "I think that that's a disease that could obviously strike any of us, but it's something that we're looking at now."}, {"time": 1169, "text": "We're, I think we should be unbelievably thankful as people that live in the world that we do that we can walk down the street without having to worry that I'm like, well, don't worry that that's six foot six, 270 pound person over there is just gonna leave me alone."}, {"time": 1183, "text": "And I have a Rolex on, but whatever, I'll be fine."}, {"time": 1185, "text": "Because that person is deciding to leave me alone because we've all agreed to live in this relatively sane and or constrained society because it benefits all of us."}, {"time": 1194, "text": "And we're doing it because of a philosophical underpinning, not because nature dictates it be that way, because nature dictates it go in a very, very different direction."}, {"time": 1202, "text": "And the only person, the only thing stopping that person from doing something to me is either me, that person, or someone else that will stand in between us."}, {"time": 1210, "text": "And if I can't do it, and there's no one there to stand in between us, then the only thing stopping that person is that person."}, {"time": 1216, "text": "And I have to hope that they're either disinterested or disinclined to do that sort of thing."}, {"time": 1221, "text": "And I think that it's keeping in mind that that is the fundamental nature of the world, whether we like it or not is important."}, {"time": 1230, "text": "And I think the quest to fundamentally alter human nature is gonna be ultimately fruitless."}, {"time": 1236, "text": "And then also it's, it is a little bit egotistical."}, {"time": 1238, "text": "A lion does what a lion does."}, {"time": 1240, "text": "We can try to box it in and we can try to guide this direction, that direction."}, {"time": 1245, "text": "But nature is as it is and as it always will be unless we wanna start to constrain it significantly."}, {"time": 1252, "text": "But now I'm starting to get into individual rights who put me in charge, who says that I should be the one to make the choices constraining because many of the most awful things that have happened throughout history, one group or one person has decided to constrain others."}, {"time": 1265, "text": "And we don't like Genghis Khan doing that."}, {"time": 1268, "text": "Well, I'll do that on a little level."}, {"time": 1270, "text": "Are there gonna be benefits and beneficiaries?"}, {"time": 1272, "text": "Absolutely, but there'll be losers in that too."}, {"time": 1275, "text": "So I guess it's a dangerous game."}, {"time": 1276, "text": "It's almost like putting on the one ring."}, {"time": 1277, "text": "You remember when Frodo offered the one ring to Gandalf and Gandalf said, no, no, I would take it away."}, {"time": 1283, "text": "I would put it on."}, {"time": 1284, "text": "I would use it out of the desire to do good."}, {"time": 1286, "text": "But through me, it would wield a power so terrible you can't imagine."}, {"time": 1289, "text": "I think that's the big question for anyone that decides that's able to have reach and able to have power."}, {"time": 1296, "text": "I mean, obviously I can't speak to that, but imagine you did have national level, global level power."}, {"time": 1302, "text": "How would you use it?"}, {"time": 1303, "text": "Would you try to change the world?"}, {"time": 1305, "text": "Would you be glad that you did down the line?"}, {"time": 1308, "text": "Yeah, that's the thing we're struggling now as a society."}, {"time": 1312, "text": "Maybe it'd be nice to get your quick comment on that, which is the people who have traditionally been powerless are now seeking a fairer society, a more equal society."}, {"time": 1325, "text": "And in attaining more power justly, there's also a realization, at least from my perspective, that power corrupts everyone."}, {"time": 1338, "text": "Even if the flag you wave is that of justice, right?"}, {"time": 1346, "text": "And so, not to overuse the term, but it'd be nice if you have thoughts about the whole idea of cancel culture and the internet and Twitter and so on, where there's nuanced, difficult discussions of race, of gender, of fairness, equality, justice, all of these kinds of things."}, {"time": 1373, "text": "There's a shouting down oftentimes of nuanced discussion of kind of trying to reason through these very difficult issues, through our history, through what our future looks like."}, {"time": 1387, "text": "Do you have thoughts about the internet discourse that's going on now?"}, {"time": 1391, "text": "Is there something positive?"}, {"time": 1392, "text": "Yeah, I mean, it's an interesting thing to see."}, {"time": 1396, "text": "I guess, as you mentioned, anytime you're wielding power, whomever you are, doing so carefully is important."}, {"time": 1404, "text": "And it's very, very easy to look at the people that have power and that are using it poorly or have used it poorly and go, hey, you're the bad guy."}, {"time": 1413, "text": "And then go, well, of course, if I had power, I'll use it properly and I may intend to use it properly and maybe I will."}, {"time": 1418, "text": "But at the same time, we see a lot of times people are people are people."}, {"time": 1424, "text": "I think that a lot of the..."}, {"time": 1428, "text": "I think if you believe that human beings are all one, which I do, no matter whether you're here or there, you got two arms, two legs, a heart, a brain, we all live a similar experience."}, {"time": 1440, "text": "And obviously, with variations on a theme, but you're no less a human being."}, {"time": 1445, "text": "If you're a person I've never met from China, than some person in Virginia, we're all people."}, {"time": 1452, "text": "And I guess, ultimately, if I believe that human beings are corruptible and that power corrupts and that we're all fallible and we say and do things that either intentionally or unintentionally that we wish we'd not, I think that I have to allow for a space, I guess the word, it's almost a religious term, but I guess I would just say grace."}, {"time": 1473, "text": "And that's something that I see disappearing from discourse in the public, or maybe it wasn't there, I'm not sure, but it's interesting watching this occur on the internet because also now no longer are you and I just having a talk sitting on a bus stop, it's now in writing."}, {"time": 1488, "text": "Everything's in writing."}, {"time": 1489, "text": "The old saying, don't put that in writing."}, {"time": 1491, "text": "You're like, don't put anything in writing."}, {"time": 1492, "text": "That's how you get in trouble."}, {"time": 1493, "text": "And basically, with the degree to which everything is recorded, but recorded in tiny little bites, it's very, very easy for me to wave every last little foolish, ignorant, incorrect, or correct thing that someone has ever said or done in their face to support whatever argument that I'm trying to make about them or a situation."}, {"time": 1511, "text": "And I think that you mentioned cancel culture, as it seems to exist."}, {"time": 1516, "text": "Obviously, this is poisonous on its face."}, {"time": 1517, "text": "This is poisonous."}, {"time": 1520, "text": "It's the sort of thing that doesn't incentivize proper behavior."}, {"time": 1523, "text": "I mean, you look at, let's say one of the great monsters of history, Adolf Hitler, obviously, who's done awful, awful things, but also for anyone that's even a minor student of history, did some positive things as well."}, {"time": 1536, "text": "I don't have to embroider this person's crimes."}, {"time": 1539, "text": "I don't have to act as if there was nothing good a monster has ever done and nothing bad that a great person throughout history has ever done."}, {"time": 1547, "text": "But imagine the ghost of Adolf Hitler were to pop up and go, oh, my gosh, guys, I'm so sorry."}, {"time": 1552, "text": "I know what I've done, but I'd like to apologize and start to make it right."}, {"time": 1556, "text": "Well, I mean, you'd hope that if he popped up over here, you'd go, well, I don't really like what you've done."}, {"time": 1561, "text": "And I don't like you."}, {"time": 1562, "text": "But at the same time, I'm glad to hear that you're attempting to make this right and push in a positive direction, even if you can't make it right."}, {"time": 1568, "text": "Because otherwise, what am I doing?"}, {"time": 1569, "text": "I'm disincentivizing change for the better."}, {"time": 1572, "text": "I'm looking to wield whatever power I have in a punitive fashion, which does not encourage people to do anything other than double down on the wrongs that they've made, knowing that at least they're going to have some support from the people that support that."}, {"time": 1586, "text": "And I guess I want to, you would hopefully look at the use of the internet as a tool that can educate, and I guess I don't like the word empower, but empower people to do various things, extend their reach, but educate and learn rather than to further solidify little tribal things that exist, which I think everyone in humanity and human history is vulnerable to."}, {"time": 1607, "text": "I mean, look at the course of human history."}, {"time": 1608, "text": "It's deeply tribal."}, {"time": 1610, "text": "And the tribes or the groups that have been on top at various points in time have done a lot of times bad things to the ones that have not."}, {"time": 1617, "text": "And you'd hope that we could learn lessons from the past and rather than committing the crimes that were committed against us, recommitting them when we slide into the top position, say, I could do this now, but I'll not."}, {"time": 1632, "text": "I understand the urge to seek vengeance is strong."}, {"time": 1635, "text": "Anyone that says differently, I wouldn't trust."}, {"time": 1638, "text": "But at the same time, we have enough experience in history, enough experience in life, enough hopefully wisdom time in to go, this isn't the right answer."}, {"time": 1647, "text": "This is only going to replay the things."}, {"time": 1649, "text": "The worst parts of our history, not the best."}, {"time": 1651, "text": "And I want to encourage positive behavior."}, {"time": 1654, "text": "And if I just, again, further lash out at people, although understandably, done understandably, I'm simply just going to just perpetuate the cycle that's gone on to this point."}, {"time": 1664, "text": "So you hope that even though we're seeing a lot of turmoil societally at the moment and globally at the moment, that I guess our better angels can prevail at a certain point."}, {"time": 1673, "text": "But it's going to take a great deal of leadership."}, {"time": 1675, "text": "And I think that we're sorely missing like a Martin Luther King style character at the moment or a great leader."}, {"time": 1681, "text": "And I'm hoping that one will show up."}, {"time": 1685, "text": "And by the way, a word I don't hear often, and I think it's a beautiful one, which is grace."}, {"time": 1690, "text": "That's a really interesting word."}, {"time": 1691, "text": "I'm going to have to think about that."}, {"time": 1693, "text": "There is a religious component to it, but it's exactly right."}, {"time": 1698, "text": "You have to somehow walk the line between, you know, you mentioned Hitler."}, {"time": 1704, "text": "I've been reading The Rise and Fall of the Third Reich."}, {"time": 1708, "text": "I'm really thinking about the 1930s and what it's like to have economic."}, {"time": 1716, "text": "My concern is the economic pain that people are feeling now quietly is really a suffering that's not being heard."}, {"time": 1726, "text": "And there's echoes of that in the 20s and the 30s with the Great Depression."}, {"time": 1732, "text": "And there's a hunger for a charismatic leader."}, {"time": 1735, "text": "Like you said, there's a leader that could walk with grace, could inspire, could bring people together with sort of dreams of a better future that's positive."}, {"time": 1749, "text": "But Hitler did exactly everything that I just said, except for the word positive, which is he did give a dream to the German people who were great people, who are great people of a better future."}, {"time": 1765, "text": "It's just that a certain point that quickly turned into the better future requires literally expansion of more land."}, {"time": 1777, "text": "It started with, well, if we want to build a great Germany, we need a little bit more land."}, {"time": 1784, "text": "And so we need to kind of get Austria, then we need to kind of get France, mostly because France doesn't understand that more land is really useful."}, {"time": 1796, "text": "So we need to get rid of them."}, {"time": 1797, "text": "And look what they did to us in Versailles anyway."}, {"time": 1801, "text": "But so the Jewish, the Holocaust is a separate thing."}, {"time": 1812, "text": "I don't know what to think of it because so me being Jewish and having a lot of the echoes of the suffering is in my family or the people that are lost."}, {"time": 1824, "text": "I don't know because Hitler wrote all about it in Mein Kampf."}, {"time": 1828, "text": "So I don't know if the evil he committed was there all along."}, {"time": 1832, "text": "I mean, and that's where the question of forgiveness, I mean, Hitler is such a difficult person to talk about, but it's the question of cancer culture, who is deserving of forgiveness and who is not like the Holocaust survivors that I've read about that I've heard the interviews with."}, {"time": 1853, "text": "They've often spoken about the fact that the way for them to let go, to overcome the atrocities that they've experienced is to forgive."}, {"time": 1865, "text": "Like forgiveness is the way out for them."}, {"time": 1871, "text": "I don't know if we're even as a society ready to even contemplate an idea of forgiveness for Hitler."}, {"time": 1879, "text": "It's an interesting idea though."}, {"time": 1881, "text": "It's a good thought exercise at the very least to think about like all these people that are being canceled for doing bad things of different degrees."}, {"time": 1893, "text": "Think of like Louis CK or somebody like that for being not a good person, but like, what is the path for forgiveness?"}, {"time": 1900, "text": "And also what's a good person?"}, {"time": 1901, "text": "What is a good person?"}, {"time": 1903, "text": "If that's a sliding scale that we could all find ourselves looking at the uncomfortable end of a gun on, you know, particularly down the line."}, {"time": 1910, "text": "I mean, you hope for the best, but these definitions, I guess, like you said, are important and who's doing the canceling, who's being canceled."}, {"time": 1917, "text": "I'm not necessarily, as you said, saying that that's entirely unjustified or certainly not, it's certainly understandable."}, {"time": 1923, "text": "And particularly you mentioned like a monster, like an Adolf Hitler, but it's also interesting."}, {"time": 1927, "text": "I couldn't help but notice, like you mentioned as a society, us being able to apply forgiveness to someone who's done so much horror, but people who are personal, I mean, of course, many of us, so many people in person affected, but directly personally affected someone, a survivor of the Holocaust being able to let go on that."}, {"time": 1944, "text": "I'm nowhere near big enough a person for that sort of thing."}, {"time": 1947, "text": "But I guess that's an interesting thing, you know, being the person who was physically there, potentially able to let go, I don't know, that's unbelievably powerful."}, {"time": 1960, "text": "I guess you have to wonder sometimes, and this isn't obviously in regards to the Holocaust, but why I'm holding on to various things, have I, what is it doing for me and what is it doing to me?"}, {"time": 1971, "text": "Is it facilitative, is it not?"}, {"time": 1973, "text": "And I guess that's something else that I really want to talk about, something else that I really enjoy."}, {"time": 1977, "text": "When I was on Ultimate Fighter, they don't let you have any music or any books."}, {"time": 1982, "text": "I didn't have religious texts, so I brought a Bible and I brought a Quran and I started to read them side by side."}, {"time": 1986, "text": "And it was really interesting reading."}, {"time": 1988, "text": "The Bible's a little drier, the Quran's more interesting, at least written."}, {"time": 1991, "text": "But I think something that was consistently brought up was the way, most merciful."}, {"time": 2000, "text": "People want, I don't think any of us want justice."}, {"time": 2002, "text": "We think we want justice, but I don't think we want justice."}, {"time": 2005, "text": "This is a dangerous, dangerous, dangerous game, because maybe this person's wronged me deeply and I want justice."}, {"time": 2011, "text": "I want to balance it out, because what is justice if not a balancing of the scales?"}, {"time": 2014, "text": "And sometimes you can understand it on a societal level, I think it's fine."}, {"time": 2016, "text": "I mean, there's crime and punishment and we can go for the benefits and the drawbacks of that."}, {"time": 2021, "text": "But I think what any of us want is mercy within reason, grace, as you mentioned, because justice is a very, very, very dangerous thing and it's a valuable and important thing."}, {"time": 2031, "text": "But who gets to decide what's just, what justice is actually meted out?"}, {"time": 2035, "text": "Maybe I get to meet out justice, but it's not, I don't get my comeuppance."}, {"time": 2038, "text": "Well, that sounds great, but what happens when it's pointed back at me?"}, {"time": 2042, "text": "And I guess that comes back to the veil of ignorance, the idea that one day I will have to live in the world in which I've envisioned and the world in which I've created."}, {"time": 2051, "text": "I think that a lot of times people love the idea of they're a judge for your crimes and a lawyer for theirs."}, {"time": 2058, "text": "And I heard that the other day."}, {"time": 2059, "text": "I thought that was great."}, {"time": 2060, "text": "And I think that's a dangerous thing and hopefully it gives us all pause before rightly or wrongly, but always understandably wielding serious power."}, {"time": 2071, "text": "Justice is a kind of drug."}, {"time": 2072, "text": "So if you look at history, I've also been reading a lot about Stalin."}, {"time": 2076, "text": "I mean, all those folks really, I don't know what was inside Hitler's head actually that he's a tricky one because I think he was legitimately insane."}, {"time": 2087, "text": "Stalin was not."}, {"time": 2088, "text": "And Stalin was like, he literally thought he's doing a good thing."}, {"time": 2094, "text": "He literally thought for the entirety of the time that communism is going to bring, like that's the utopia and he's going to create a happy world."}, {"time": 2105, "text": "And in his, in his mind were ideas of justice, of fairness, of happiness, of, of yeah, human flourishing."}, {"time": 2119, "text": "And that's, that's a drug and it's somehow sadly pollutes the mind when you start thinking like that, what's good for society and believing that you have a good sense of what's good for society."}, {"time": 2132, "text": "That's intoxicating, especially when others around you are feeling the same way."}, {"time": 2136, "text": "And then you start like building up this movement and you forget that you are just like, you're, you're like barely recently evolved from an ape."}, {"time": 2146, "text": "Like you don't know what the hell you're doing."}, {"time": 2148, "text": "And then you start like killing witches or whatever."}, {"time": 2151, "text": "Like you start, you start doing."}, {"time": 2152, "text": "They did math."}, {"time": 2153, "text": "Let's be honest though."}, {"time": 2154, "text": "I mean, sometimes you got a witch has to go."}, {"time": 2156, "text": "We can all agree that a witch, a witch has to go if, if it floats or sinks, which one, I forget which one."}, {"time": 2162, "text": "Whichever one we need at the time, honestly."}, {"time": 2164, "text": "Is it floating?"}, {"time": 2165, "text": "It should have sunk."}, {"time": 2167, "text": "Yeah, but yeah, we can definitely agree that witches have to go because you brought it up."}, {"time": 2173, "text": "I tweeted recently, but also just, I'm one of the things I'm really ashamed of in my life is I haven't really read almost any of the sci fi classics."}, {"time": 2185, "text": "So like I, my whole journey through reading was through like the literary philosophers that would say like Camus, Hase, Dostoevsky, Kafka, like that place, like that's a kind of sci fi world in itself, but it's, it just, it creates a world in which the, the deepest questions about human nature can be explored."}, {"time": 2215, "text": "I didn't realize this, but the sci fi world is the same."}, {"time": 2220, "text": "It just puts it in a, it like removes it from any kind of historical context where you can explore those same ideas in like space somewhere elsewhere in a different time, a different place."}, {"time": 2230, "text": "It allows you almost like more freedom to like construct these artificial things where you can just do crazy, crazy kind of human experiments."}, {"time": 2239, "text": "So I'm now working through it."}, {"time": 2241, "text": "The books on my list are the foundation series by Isaac Asimov, Dune, Snow Crash by Neal Stephenson and Ender's Game, like you mentioned."}, {"time": 2254, "text": "That's just kind of, and then, so I posted that."}, {"time": 2257, "text": "And then of course, like Elon Musk, John Carmack, I don't know if you know him, creator of Doom and Quake."}, {"time": 2264, "text": "See, they all pitched in these nerds, these ultra nerds just started like going like these, you need to read this, that and the other."}, {"time": 2273, "text": "So I've like started working out."}, {"time": 2276, "text": "But it seems like the list I've mentioned holds up somewhat."}, {"time": 2281, "text": "Is there sci fi books or series or authors that you find are just amazing?"}, {"time": 2291, "text": "Maybe another way to ask that is like, what's the greatest sci fi book of all time?"}, {"time": 2295, "text": "Well, I'd like to start by sharing something that I'm embarrassed about is that I haven't read anything other than, you know, Orson Scott Card, J.R. Tolkien, Frank Herbert Tolkien."}, {"time": 2308, "text": "Yeah, I'm aware through Wikipedia and through surface reading of things that like a book called the Republic was written once."}, {"time": 2318, "text": "There were some other... Do you read Wikipedia?"}, {"time": 2320, "text": "You're a prolific reader of Wikipedia articles."}, {"time": 2323, "text": "Well, or occasional."}, {"time": 2325, "text": "Occasional reader."}, {"time": 2327, "text": "In between whatever else it is that I waste my time on."}, {"time": 2330, "text": "But yeah, so I also, I should say, I posted on Reddit questions for Ryan Hall and there's like a million questions, but like half of them have to do with Dune."}, {"time": 2341, "text": "But like people bring up Dune."}, {"time": 2343, "text": "I don't understand why."}, {"time": 2345, "text": "Did you mention Dune before?"}, {"time": 2346, "text": "Well, actually, we actually have a showy role actually made us a Gi, a Dune themed Gi one time, which I thought was kind of cool."}, {"time": 2352, "text": "I'll send you."}, {"time": 2352, "text": "I'll give you one."}, {"time": 2353, "text": "We got extra stuff."}, {"time": 2354, "text": "But actually, to your point, actually, this is Orson Scott Card quote, actually the writer of Ender's Game."}, {"time": 2360, "text": "Fiction, because it's not about somebody who actually lived in the real world always has the possibility of being about oneself."}, {"time": 2366, "text": "And I think that's a neat thing because I have heard other people whom I respect and very sharp people actually every now and then dig their heels and going, I don't like fiction."}, {"time": 2375, "text": "I only like nonfiction."}, {"time": 2376, "text": "It's more instructive."}, {"time": 2377, "text": "And I would go, I completely disagree with that."}, {"time": 2379, "text": "I think we have a hard enough time figuring out what happened at 711 three hours ago that, let me tell you what happened 600 years BC."}, {"time": 2387, "text": "I'm like, hey, I'm interested."}, {"time": 2388, "text": "But don't tell me this isn't a story too."}, {"time": 2390, "text": "There's factual components, I have no doubt."}, {"time": 2394, "text": "But we struggle sometimes to like, I guess what I like about fiction is that you can tell me a story."}, {"time": 2400, "text": "It's all about people."}, {"time": 2401, "text": "I mean, every now there's more and less believable things."}, {"time": 2404, "text": "And I think Dune would be an unbelievably well written, in my opinion, for to run, what do I know?"}, {"time": 2409, "text": "But I really liked doing, I'll say that well written example of human beings interacting with one another, the political component to that, the emotional, the intellectual, the relationship components, all of that."}, {"time": 2420, "text": "And I think that Dune is neat because it's a sci fi, not a sci fi novel, but only in the only in the loosest sense."}, {"time": 2426, "text": "It's really a story about religion, about group dynamics, about human potential, about belief, learning, politics, governance, ecology."}, {"time": 2440, "text": "It's the best stories remind me of history the same way history hopefully is not just a list of facts that I try to be able to recall or factoids that I try to recall, but a story that I can understand and see how the threads of time kind of came together and created certain things."}, {"time": 2459, "text": "And a lot of times, like we say, I'm like, how the heck is what's going on right now or 100 years from now or 100 years in the past happened."}, {"time": 2464, "text": "And you can look back far enough."}, {"time": 2466, "text": "If we had accurate knowledge, if we had that hypothetical perfect pool shot at the beginning of time, we would see an unbroken chain of events that led us to where we are and where we are will potentially lead us to where we're going, which is, again, why hindsight is helpful."}, {"time": 2480, "text": "But I think it's neat."}, {"time": 2480, "text": "Like, I guess I really enjoy, for instance, a book like Dune, and they're actually making a movie out of it, which I'm skeptical of, to be honest, because it's going to be difficult to bring that to the screen for a variety of reasons, but there's at least a hundred questions."}, {"time": 2493, "text": "Ask Ryan, what do you think about the new Dune movie?"}, {"time": 2496, "text": "I am not enough of an authority to have any sort of decent opinion, but I guess what I would say is so much of it goes on in the character's mind."}, {"time": 2501, "text": "Like how much of any of our days is any lived experience, as it were, is internal, but the majority, how many times are people walking around and, you know, they're like, hey, what do you see right now?"}, {"time": 2512, "text": "I'm like, oh, well, I see this picture."}, {"time": 2514, "text": "I see a wall."}, {"time": 2514, "text": "Hey, there's Lex."}, {"time": 2515, "text": "But really what I was paying attention to was what was going on inside of my head for a moment, and almost the rest of the world tuned out and kind of dimmed."}, {"time": 2523, "text": "And I guess I think that's going to be a struggle to any time you want to bring that type of a written story to a visual medium."}, {"time": 2533, "text": "I think it's going to be more difficult, but it'll be interesting."}, {"time": 2536, "text": "It's definitely one of my favorite stories, and it's honestly helped me become better at life, in my opinion, better at martial arts."}, {"time": 2544, "text": "And I think the writer, I think Frank Herbert was absolutely brilliant, whether those were all his ideas, which are not reality."}, {"time": 2549, "text": "None of us or all of our good ideas aren't ours."}, {"time": 2551, "text": "We're a combination."}, {"time": 2552, "text": "Maybe it came up with something you're a curator of other good ideas and some things you borrowed from somewhere without even realizing it."}, {"time": 2557, "text": "But I think the way the messages and the themes and the ideas that were conveyed, particularly in the original novel, are just absolutely brilliant."}, {"time": 2565, "text": "Is that to you one of the greats and the flip side of that, or another way to ask that is if somebody is new to sci fi, is that something you would recommend that is an entry point?"}, {"time": 2578, "text": "I'm not well read enough in the sci fi world."}, {"time": 2580, "text": "I haven't read a lot of Isaac Asimov or anything like that, but I'll recommend Dune."}, {"time": 2584, "text": "I'll be an obnoxious evangelist for Dune to anyone who'll listen."}, {"time": 2588, "text": "So yeah, I would strongly recommend it."}, {"time": 2590, "text": "So the other thing you mentioned, now I should probably be talking to you about much more important things, but the other thing is Skyrim."}, {"time": 2599, "text": "Do you play video games?"}, {"time": 2601, "text": "What's your favorite game?"}, {"time": 2602, "text": "What's what would you say is the greatest video game of all time?"}, {"time": 2605, "text": "Because I'm a huge fan of Elder Scrolls."}, {"time": 2607, "text": "I mean, I play a little bit at this point."}, {"time": 2610, "text": "You know, a little less finally moves into a new house."}, {"time": 2613, "text": "So you're like an adult."}, {"time": 2616, "text": "I'm like a better funded 12 year old."}, {"time": 2619, "text": "Yeah, that's yeah, that's entirely that's entirely accurate."}, {"time": 2623, "text": "Better funded 12 year old."}, {"time": 2624, "text": "But somewhat better funded 12 year old."}, {"time": 2627, "text": "Not as well funded as I wish."}, {"time": 2628, "text": "But historically, did you play video games?"}, {"time": 2630, "text": "Oh, yeah, I played as a kid."}, {"time": 2631, "text": "I was, you know, again, I've always liked playing sports and liked reading and I always enjoyed video games."}, {"time": 2636, "text": "But my favorite video game I think I've ever played was Knights of the Old Republic."}, {"time": 2640, "text": "It was a Star Wars game."}, {"time": 2641, "text": "A huge Star Wars fan until it become less so recently."}, {"time": 2646, "text": "Disney."}, {"time": 2647, "text": "You don't like the, I haven't watched it yet."}, {"time": 2649, "text": "Oh, Mandalorian."}, {"time": 2651, "text": "Oh, don't go there."}, {"time": 2651, "text": "Oh, actually, I like Mandalorian."}, {"time": 2653, "text": "That was actually pretty cool."}, {"time": 2654, "text": "Yeah, waving this off."}, {"time": 2655, "text": "Yeah, yeah, I will."}, {"time": 2657, "text": "If I could cancel one thing, I would cancel Disney Star Wars."}, {"time": 2660, "text": "I'm going to edit that part out."}, {"time": 2661, "text": "Okay, let's go to the next."}, {"time": 2663, "text": "But this is where if people are wondering if you're watching this on YouTube and like the dislike amount is like 80% it's because of that comment."}, {"time": 2671, "text": "So good job."}, {"time": 2672, "text": "Good job for making the internet hate you."}, {"time": 2674, "text": "I regret nothing."}, {"time": 2675, "text": "Now, what about Baby Yoda?"}, {"time": 2679, "text": "Yeah, I guess he's like little."}, {"time": 2681, "text": "He's got ears and he uses the force sometimes and he passes out again."}, {"time": 2684, "text": "No qualms with Baby Yoda."}, {"time": 2685, "text": "Yeah, you don't have a heart."}, {"time": 2687, "text": "Okay, let's go to Jiu Jitsu if it's okay."}, {"time": 2694, "text": "So the audience of this podcast may not know much about Jiu Jitsu or they do because it's really part of the culture now, but they don't really know much."}, {"time": 2704, "text": "They see that so many people have fallen in love with it, have been transformed through it, but they don't know much about like, what is this thing?"}, {"time": 2710, "text": "Is there a way you could sort of try to explain what is Jiu Jitsu, what is the essence of this martial art that's captured the minds and hearts of so many people in the world?"}, {"time": 2722, "text": "I think that Jiu Jitsu is a philosophy that's expressed physically and that it's the kind of development of the mental capacity and physical capacity working in unison to move efficiently and almost flowingly, unresistingly with a given situation, with a physically resisting opponent."}, {"time": 2750, "text": "Learning how to generate force on your own and how to steal force from the floor, how to steal force from the other person and move in concert with it as opposed to clash against, which if you watch two untrained people fight, it's almost entirely a clash."}, {"time": 2763, "text": "It's a runaway and clash, a runaway and clash."}, {"time": 2765, "text": "If you watch Jiu Jitsu done well, it looks like water moving around a solid structure."}, {"time": 2772, "text": "And I think that that is expressed physically."}, {"time": 2775, "text": "And I think that all of the things that anyone has really been able to do very, very well in Jiu Jitsu end up kind of exemplifying that."}, {"time": 2784, "text": "But I think that's true of martial arts in general."}, {"time": 2786, "text": "I think that a lot of times like the clashing that we see going on and working well is just the fact that it's you know, you get very, very physically powerful people every now and then they're able to get away with this."}, {"time": 2797, "text": "But I don't think that that's, and that's fantastic because ultimately it's a results driven thing."}, {"time": 2801, "text": "But I think that the essence of the martial arts is learning how to make more out of less and how to move with and be yielding, almost like real life Aikido."}, {"time": 2809, "text": "And so you think of martial arts, Jiu Jitsu as like water or flowing, so Aikido, so moving around a solid structure so Aikido, so moving around the force as opposed to sort of maybe the wrestling mindset is finding a leverage where you can apply an exceptional amount of force."}, {"time": 2835, "text": "So like, so like maximizing the application of force."}, {"time": 2838, "text": "I guess maybe that's a better way to, I'd like to marry the two ideas, you know, because I think you flow until the point at which you are the greater force at which point in time you can apply."}, {"time": 2847, "text": "But if you look at the best wrestlers and then when I say best, I don't necessarily mean most successful although of course most successful are always very very good throughout the course of history in boxing in wrestling, in Judo, they're magical."}, {"time": 2861, "text": "They disappear and reappear."}, {"time": 2863, "text": "It's like fighting a ghost that is like incorporeal when you want to find it."}, {"time": 2867, "text": "But then when you don't want it to find it when you don't want to find it, it finds you."}, {"time": 2871, "text": "And I think that we see that in the like the Bufais or societies of wrestling."}, {"time": 2876, "text": "And you know, I guess you could look at a Floyd Mayweather or Willie Pep or you know, Prunell Whitaker in boxing as brilliant examples of disappearing and reappearing."}, {"time": 2887, "text": "And when you're strong, it's almost like guerrilla warfare."}, {"time": 2890, "text": "When you're strong, I'm nowhere to be found."}, {"time": 2892, "text": "When you're weak, you can't get rid of me."}, {"time": 2894, "text": "And I think that's what we're looking for."}, {"time": 2896, "text": "Yes, the TF brothers are incredible at that."}, {"time": 2898, "text": "They just, they look like skinny Starbucks baristas and they just manhandle everybody like effortlessly."}, {"time": 2909, "text": "They look like they just kind of woke up, rolled out of bed, fighting for like the gold medal at the Olympics and just effortlessly throw, like there's a match against, I guess, Yul Romero."}, {"time": 2923, "text": "Yeah, so like, you know, if you look at like who is the guy who's like intimidating in this case and terrifying looking, it's Yul Romero, just like a physical specimen and obviously like a super accomplished wrestler."}, {"time": 2938, "text": "I think this is for the gold medal, yeah."}, {"time": 2940, "text": "In 2000."}, {"time": 2942, "text": "In 2000?"}, {"time": 2943, "text": "Yeah, Sydney."}, {"time": 2943, "text": "And then there, this is the year you all took silver."}, {"time": 2948, "text": "And what you, like, just to show you like there's a inside trip, effortless."}, {"time": 2955, "text": "Uchi, and he does it again."}, {"time": 2957, "text": "Yep, you know, it's a really creative kind of wrestling where it's organic."}, {"time": 2963, "text": "Yeah, you throw in all of these kinds of things."}, {"time": 2966, "text": "This is a mix of judo, a mix of like weird kind of moves."}, {"time": 2971, "text": "It's not like as funky as Ben Askren."}, {"time": 2974, "text": "It's just like legitimate, basic."}, {"time": 2979, "text": "Well, it's not funky for funky sake."}, {"time": 2980, "text": "And I'm not poking at Ben Askren to imply that that's what he's doing, but it's like, it's funny."}, {"time": 2985, "text": "It's like, a lot of times it's almost like Musashi talked a lot about that."}, {"time": 2988, "text": "You know, that the only goal of combat is to win is the outcome is it's outcome driven versus like flourishing, you know, cool looking movements."}, {"time": 2996, "text": "It's like, unless that had a utilitarian purpose, like what are you wasting your time with that?"}, {"time": 3000, "text": "Both in the fight and also, you know, in practice."}, {"time": 3003, "text": "But as you mentioned, it's almost like it looks like judo."}, {"time": 3006, "text": "It looks like wrestling, it looks like jujitsu."}, {"time": 3007, "text": "It's almost like, I guess the reminds me all of the martial arts is again, deeply tribal as well."}, {"time": 3012, "text": "I wanna learn Lex Fridman, martial arts."}, {"time": 3014, "text": "And then I wanna learn another, you know, I guess, transcendent person's martial arts."}, {"time": 3018, "text": "And it just happened to be the set of movements that you tended to do most of the time, thanks to your body type and your opposition and whatnot."}, {"time": 3025, "text": "But then I try to codify that and force those to work as opposed to going, I wanna understand how the body works in concert and in Congress with something else and other forces and move appropriately."}, {"time": 3036, "text": "And that's why it's like, it always struck me that the Saiki brothers are great examples of just moving like water, but they, to use Bruce Lee, which is a little trite, but again, he's brilliant."}, {"time": 3044, "text": "It's like water can flow or water can crash."}, {"time": 3047, "text": "And they would crash when they needed to crash and they would flow when they needed to flow, but they would flow for the purpose of dissipating and then crash when they would win."}, {"time": 3053, "text": "And at the right moment, then go back to flowing the second that the other person found them."}, {"time": 3057, "text": "And it's just, it's beautiful to watch, it's artistic."}, {"time": 3059, "text": "And I think that that great expression of anything physical is ultimately studied as a science, but expressed as an art."}, {"time": 3065, "text": "And I think that that's something that gets lost in jujitsu a lot of times when it gets a little bit, a little nerdy, like do this hand here, hand here."}, {"time": 3070, "text": "Like it's like the more details I have, the better when in reality, that's just not, not in my experience, how it's done."}, {"time": 3077, "text": "Might be fun exercise of saying like, what are the main positions and submissions in the art of jujitsu?"}, {"time": 3087, "text": "You don't have to be complete, that's a ridiculously, I apologize for putting you on a spot like this, but it might be a nice exercise to think through it."}, {"time": 3095, "text": "Sure, I mean, I would just say that there, you have your arms bend in various ways."}, {"time": 3099, "text": "You have key lock Americana, straight arm locks, Kimura, omoplata, omoplata is a Kimura, Kimura is an omoplata, it's just executed."}, {"time": 3105, "text": "Submissions."}, {"time": 3106, "text": "Submissions, yes."}, {"time": 3107, "text": "Breaking off your arm in all kinds of ways."}, {"time": 3109, "text": "But ultimately, the question is, let's say you were a Terminator, like a robot that I, which of course you are."}, {"time": 3116, "text": "It's like, all right, so we're being completely literal."}, {"time": 3118, "text": "But, and I couldn't harm you with any of these things."}, {"time": 3122, "text": "Would I still use these positions?"}, {"time": 3124, "text": "They create leverage, they create control, they create shapes that I can affect and that can affect me and they can be affected through other forces and other objects or structures like the ground or the wall."}, {"time": 3134, "text": "I really enjoy mixed martial arts because there's another component rather than just me and you and the floor, there's me, you, the floor, and the wall."}, {"time": 3140, "text": "And it's another player in the game that doesn't exist in a grappling context with a non enclosed, I guess, area of combat."}, {"time": 3148, "text": "But you can strangle me or choke me, what do you call it, without my arms being involved, or you can use one of my shoulders to pin one side of my, one carotid artery off and you can enclose the other."}, {"time": 3161, "text": "You can turn my knee in the exact same ways that you can turn my arm straight this way and that way."}, {"time": 3167, "text": "You can add a rotation to that or it can be directly linear against the joint."}, {"time": 3171, "text": "So I guess what I would say is the more that I've been able to understand jiu jitsu, the more that I've been, it's given me a look into how we learn language where rather than learning five bazillion adjectives, I go, I understand what an adjective is."}, {"time": 3185, "text": "And of course we are all read into some degree of vocabulary."}, {"time": 3189, "text": "I understand what an adverb does and I understand what an adverb is."}, {"time": 3192, "text": "I know what a noun is."}, {"time": 3193, "text": "I know what the component parts of a sentence are."}, {"time": 3196, "text": "I know what, you know, I guess a clause, a contraction, any of these things."}, {"time": 3199, "text": "And it allows you to be interesting and artistic with your language to the extent that you can."}, {"time": 3205, "text": "But I can't, like I can speak a degree of Spanish, but I'm not even slightly artistic in Spanish."}, {"time": 3209, "text": "I would be something, I speak like a child with a head injury."}, {"time": 3213, "text": "And anyway, the I."}, {"time": 3215, "text": "Your basic understanding of the English language allows you to then be a student of Spanish."}, {"time": 3220, "text": "100%, but I'm limited by my experience."}, {"time": 3223, "text": "I'm limited by my understanding of techniques."}, {"time": 3225, "text": "I'm limited by my understanding, almost like, let's say techniques are like these are like vocabulary."}, {"time": 3231, "text": "So even if I kind of sort of grasp the sentence structure and the thought process and the thought patterns of Spanish, which it's interesting because just even though the orientation and the organization of a language, and I've thought about this a great deal, you know, the way that I perceive the world is affected deeply by the language that I learned."}, {"time": 3247, "text": "The, you know, the, again, if I learned, I have no idea how the Chinese language structures, but I can only imagine that it would be, that it would affect, it's like a different lens."}, {"time": 3255, "text": "We're all looking at the same thing, but I have a different set of sunglasses on than you do."}, {"time": 3259, "text": "And that's very, very interesting."}, {"time": 3261, "text": "I'll use the Quran as an example."}, {"time": 3263, "text": "You know, apparently it's unbelievably poetic and in Arabic, still neat and was interesting reading in English, but I'm told by people that I trust that it just one doesn't bear a resemblance to the other."}, {"time": 3274, "text": "And I think that's a very interesting thing that you may be able to say the same thing, but in a more, I guess, in a different way, in a more artistic way that may not translate on a one for one kind of fidelity."}, {"time": 3285, "text": "But the more that we're able to understand about how the body works, the more examples of the body working this way, the body working that way, the body working that way, the more that I'm able to eventually become an artist, but it has to be studied as a science first."}, {"time": 3297, "text": "And it does start with technique collection, vocabulary collection, the same way we learn in school."}, {"time": 3302, "text": "You remember how to say quickly 17 different ways."}, {"time": 3306, "text": "And let's say I speak Spanish, I'm only, I only know three."}, {"time": 3310, "text": "So you might use quickly, you might use an adjective like quickly in Spanish, but use one of the many, many options to describe that, that I don't understand."}, {"time": 3317, "text": "And now I sit there and go like, wait, what?"}, {"time": 3320, "text": "I can't be artistic."}, {"time": 3321, "text": "I can't be as organic with the language as I'd like."}, {"time": 3323, "text": "So I believe that jujitsu a lot of times starts with the acquisition of a lot of, hey, do this, this, this drill, this technique."}, {"time": 3329, "text": "Here's an Americana, Americana to an armlock, armlock to a triangle."}, {"time": 3333, "text": "But the problem with that is oftentimes we get stuck in that phase."}, {"time": 3337, "text": "And people eventually become move collectors or sequence collectors."}, {"time": 3341, "text": "And I noticed this when I'm trying to do DVDs or I guess like an instructional series now, or even teaching in class, I don't believe in that form of learning anymore."}, {"time": 3349, "text": "Not that it's not valuable, but I don't believe, I don't understand jujitsu on that level anymore."}, {"time": 3354, "text": "So what I'm trying to do is get across the basic ideas to people and say, hey, you need to fill in the gaps with going to class all the time."}, {"time": 3361, "text": "You need to go, hey, learn this move, learn that technique, learn that technique."}, {"time": 3364, "text": "Because otherwise I'm basically just throwing at you like 75 different words that you could use, but that hasn't really taught you how to speak a language."}, {"time": 3372, "text": "Whereas if you give me a language structure, you can fill in these pieces on your own and then eventually speak organically in Lex form, which will be ultimately unique to you because otherwise you just end up being like a weird facsimile of whatever it is that I'm doing for mostly the worst I'd say, but."}, {"time": 3389, "text": "Yeah, that's what people, I mean, people comment like, is this, especially people who haven't listened to me before, is this guy drunk or high?"}, {"time": 3397, "text": "Does he, does MIT really allow slow people to be, like what's."}, {"time": 3402, "text": "Quotas."}, {"time": 3404, "text": "Quotas, yeah."}, {"time": 3405, "text": "Like what's wrong with him?"}, {"time": 3407, "text": "Is he getting sleep?"}, {"time": 3409, "text": "Does he need help?"}, {"time": 3410, "text": "So that's similar with my jiu jitsu."}, {"time": 3412, "text": "It's like, is this guy, is this guy really, whatever rank I was throughout, I remember just like, is this guy really this rank?"}, {"time": 3421, "text": "I just have a very kind of certain way of sitting and being slow and lazy looking that there was ultimately the language that I had to discover."}, {"time": 3429, "text": "And it was, it was, yeah, it was a very liberating moment."}, {"time": 3433, "text": "I think of probably a few years of getting my ass kicked, especially with Open Guard and butterfly to where you really allow yourself to take in the entirety of the language and realize that, that I'm not, I'm different."}, {"time": 3449, "text": "I'm a unique, I'm unique."}, {"time": 3451, "text": "And like, I have a very, I have a language, I have a set of techniques, a way I move my body that needs, that I'm the one to discover."}, {"time": 3461, "text": "Like it's, you can only, you can learn specific techniques and so on, but you really have to understand your own body."}, {"time": 3506, "text": "But it's, as you mentioned, I couldn't agree with you more, it's a discovery process and no one can cheat that process, which is at the same time, it's almost like imagine I wanna start writing books in second grade, unless maybe I'm like staggeringly brilliant, which I can only conceptualize someone being able to do that, but maybe a Mozart of the English language where you're out there doing it."}, {"time": 3523, "text": "But for most of us, we don't have enough knowledge, enough information, enough experience to be able to be, to express ourselves."}, {"time": 3581, "text": "Maybe about a couple things, but that's a small box that I have to be very, very careful about what I think is objective versus what's not and I have to be open to the possibility of all the things that I think are objectively correct may or may not be."}, {"time": 3621, "text": "People are looking for, hey, where do I plant my feet over here?"}, {"time": 3624, "text": "Where's the thing that I know is right?"}, {"time": 3626, "text": "And we can all agree on the following."}, {"time": 3629, "text": "And I think that we see that in martial arts."}, {"time": 3631, "text": "We're like, oh, I do this style, I do that style, I do that style."}, {"time": 3633, "text": "It's like, hey, man, we're all just pushing forward in a certain direction here, trying to do our best."}, {"time": 3637, "text": "And I understand why you feel the way you do."}, {"time": 3638, "text": "I may have felt like that at one point too, but I'm just trying to learn and understand versus I've already acquired enough knowledge, let me cross my arms and start to look who's fucking up around here."}, {"time": 3650, "text": "And I think that that's an, it's an interesting trap that I think is very human trap to fall into, but it definitely happens early on."}, {"time": 3658, "text": "It's, I mean, it's a joke in the jiu jitsu world, right?"}, {"time": 3660, "text": "Like, oh, the blue belt that knows everything."}, {"time": 3662, "text": "Well, initially it's like, what, I know nothing and I at least think I know nothing."}, {"time": 3665, "text": "Then I'd learn a little bit and I think it's a lot bit."}, {"time": 3667, "text": "And then, you know, the more you learn, the more you go like, I don't even know what I'm doing."}, {"time": 3673, "text": "We kind of talked about it a little bit, but once again, a lot of people that listen to this have never been on the mat, have never tried jiu jitsu, but are really curious about it."}, {"time": 3683, "text": "Everybody at all positions, like I think, you know, most kids are not doing jiu jitsu."}, {"time": 3687, "text": "Andrew Yang is like, they're all, you know, the world is curious."}, {"time": 3691, "text": "It's a, it's a nice, it seems to be a nice methodology by which to humble your ego, which to grow intellectually and physically."}, {"time": 3699, "text": "So people are curious about it."}, {"time": 3702, "text": "So the natural question is if they're curious about it, how would you recommend they get started?"}, {"time": 3707, "text": "Maybe like, what do you recommend the first day, week, month, year, first couple of years look like?"}, {"time": 3714, "text": "Like, how do you ease into it and make sure that it's a positive experience and you progress in the most optimal and positive way?"}, {"time": 3723, "text": "The first thing you can do is simply ask yourself why, why you want to be involved."}, {"time": 3728, "text": "You know, I remember the first day that I walked into Ronin Athletics in New York City to train under Godfather of my son now, Christian Montes, and I didn't know what I was getting myself into."}, {"time": 3739, "text": "I played baseball through high school and I wanted, I was at Manhattan College in the Bronx and I wanted to go and learn martial arts because it was always something that was interesting to me, but it was never something that I knew was accessible and it definitely wasn't really around in Northern Virginia where I grew up, whereas then you stick yourself in Manhattan and there's stuff everywhere."}, {"time": 3760, "text": "So anyway, I guess I didn't know what to expect."}, {"time": 3763, "text": "I didn't know if I was going to get beat up, if people were going to be nice, if people were not going to be nice, but what I began with was, I think, expectation management."}, {"time": 3772, "text": "And I think that that's something that I would, that'd be the first thing that I would start is almost imagining what is it that I'm getting myself into because I love the martial arts."}, {"time": 3783, "text": "The martial arts has given me everything in life and I'm so thankful I wouldn't be sitting here without that experience, that journey."}, {"time": 3791, "text": "The people that I've met, the places that I've gone, I could never, ever have ever imagined."}, {"time": 3797, "text": "And I'm just unbelievably thankful for that."}, {"time": 3799, "text": "But I think that the thing that helped me most of all was starting with going, my mom said something to me one time and she said, there's two types of people in various situations."}, {"time": 3811, "text": "There's why and there's why not."}, {"time": 3813, "text": "And it's understandable to have questions, concerns, things like that."}, {"time": 3817, "text": "But maybe sometimes it's a little bit easier when you're younger to just trust people or just say, I don't know, you know."}, {"time": 3824, "text": "But we go, hey, you wanna climb that rock?"}, {"time": 3826, "text": "I'm like, yeah, why not?"}, {"time": 3828, "text": "Hey, you wanna jump in that river?"}, {"time": 3829, "text": "Yeah, why not?"}, {"time": 3830, "text": "Versus if I have to reason my way into everything, if I have to be talked into everything, a lot of times I'll talk myself out of it."}, {"time": 3836, "text": "And I think that a lot of times this is the thinker's disease."}, {"time": 3839, "text": "You wanna figure out what's gonna happen and what you should expect to have happen before you get involved versus going, using the old Bruce Lee saying again, it's like no amount of thinking or training on the side of the river will teach you how to swim."}, {"time": 3852, "text": "You have to jump in."}, {"time": 3853, "text": "And there are risks associated with that."}, {"time": 3855, "text": "And I guess psychological are usually the biggest ones."}, {"time": 3859, "text": "That's the biggest hurdle."}, {"time": 3860, "text": "And physical."}, {"time": 3862, "text": "But the biggest thing that I guess I would suggest to anyone to say, well, why do you wanna do this?"}, {"time": 3866, "text": "You're like, well, I wanna challenge myself."}, {"time": 3868, "text": "I wanna learn, I would like to learn to fight."}, {"time": 3870, "text": "I wanted to learn to fight so that I could protect myself."}, {"time": 3872, "text": "And if anything else, other people, if only within arms reach."}, {"time": 3875, "text": "I perceived that if I had some small degree of power, I generally wouldn't use it."}, {"time": 3881, "text": "Which is why I was like, yeah, I'll give it a try."}, {"time": 3882, "text": "I'll try to be reasonable."}, {"time": 3883, "text": "And hopefully if I make a mistake, I'll apologize to people."}, {"time": 3886, "text": "But basically I said, yeah, I'd like to have that."}, {"time": 3889, "text": "And I wanna, I know this is gonna be challenging and we'll see what happens."}, {"time": 3894, "text": "And that means that getting beat up and I didn't get like hurt, but getting roughed up, getting my arm bent this way or that way, getting choked."}, {"time": 3900, "text": "I was like, well, this is all supposed to happen."}, {"time": 3901, "text": "That's no big deal."}, {"time": 3902, "text": "It would be like going and joining the army during peacetime and then going, oh, I'm just doing this for college education."}, {"time": 3908, "text": "You know, like, okay, that's cool, man."}, {"time": 3909, "text": "And then all of a sudden war breaks out and they wanna send me somewhere."}, {"time": 3912, "text": "And I'm like, whoa, whoa, whoa, whoa."}, {"time": 3913, "text": "I didn't sign up for that."}, {"time": 3915, "text": "Actually you did, whether you realize it or not."}, {"time": 3917, "text": "You may not have thought that you did, but you did."}, {"time": 3919, "text": "So getting your mind right and just going, what are my expectations for this activity?"}, {"time": 3924, "text": "What is it that I'm looking to do?"}, {"time": 3925, "text": "And of course, you know, you're going into a gym, you're going into a place that you don't know people, you probably don't know people and you don't know the coach."}, {"time": 3932, "text": "And even if you do wanna, hey, how you doing?"}, {"time": 3934, "text": "Shake your hand, type of level."}, {"time": 3935, "text": "You know, 95% of my students don't know me."}, {"time": 3938, "text": "Not really, you know, I'll try to be polite and not annoy them too much, but they don't know me and I don't know them."}, {"time": 3943, "text": "I understand if they don't trust me, I wouldn't trust, trust me either if I were them."}, {"time": 3948, "text": "But at the same time, someone has to take that leap."}, {"time": 3950, "text": "And one of the things that I've noticed as a martial arts instructor, that's the biggest struggle with dealing with adults, which is why a lot of people like to teach kids is because kids don't ask, don't argue."}, {"time": 3961, "text": "Now that also means there's all sorts of pitfalls or that sort of thing, and that can be an issue."}, {"time": 3965, "text": "But you know, I guess a lot of times people get to a point in their life, you know, in their 20s, early 30s, where now I'm a manager now, I know what I'm doing."}, {"time": 3973, "text": "No one talks to me like that."}, {"time": 3974, "text": "First it's like, hey man, you go join bootcamp, I don't care if you are Elon Musk, they're gonna tell you to shut up and do pushups."}, {"time": 3979, "text": "And that's what's great about it."}, {"time": 3981, "text": "So you are taking a leap of faith into a world that you're gonna be a tiny fish."}, {"time": 3986, "text": "And you gotta hope that the people who are guiding you in that journey are gonna have, I can't even say your best interests at heart because they don't even know you, but they'll try to do no harm."}, {"time": 3996, "text": "And they'll try to help you in the way that they would understand."}, {"time": 3999, "text": "And I guess that's, for instance, that's what I would try to do with anyone that comes into my gym."}, {"time": 4004, "text": "I would try to help them in the way that I understand they need as best I can and as safe and reasonable a way as possible, but sometimes in a way that's gonna make them uncomfortable, particularly if physical combat, and it's not something they've done before."}, {"time": 4018, "text": "If a lot of people go in without even having played, you know, contact sports, and so that can be a big jump."}, {"time": 4023, "text": "And you have to understand, if that's where you're starting from, no worries, but you're gonna have to kind of work your way to it, and it's gonna be uncomfortable, and that's okay."}, {"time": 4032, "text": "It's part of the process, and you're gonna have some bumps and bruises, and you're not gonna wanna roll with that guy in the corner because that person's rough, and they beat you up, and they're like, okay, but is this a big hurt or is it a little hurt?"}, {"time": 4041, "text": "If it's a big hurt, okay."}, {"time": 4043, "text": "If it's a little hurt, need you to center up a little bit."}, {"time": 4047, "text": "It's such an interesting balance because to find, I think one of the most important things as in anything, I think, in life is the selection of the people that you put around you."}, {"time": 4059, "text": "I mean, that's true with like getting married."}, {"time": 4062, "text": "That's true with like if you go to, if people ask me, like graduate students, like your PhD advisor can be the difference."}, {"time": 4072, "text": "It's like you spend five years with somebody, they're going to basically define more impact on you than anybody you marry, anybody you hang out with."}, {"time": 4081, "text": "It's a huge impact."}, {"time": 4082, "text": "And the same with the coach selection, which is like the school selection, is it's going to be really important about in terms of like who you select will define how happy, like the trajectory of your growth and how happy you are with the entirety of the experience."}, {"time": 4101, "text": "And yet, like the flip side of that is, especially if you have an ego, especially if you are the manager that needs to let go of some stuff, you're going to feel like shit with the best kind of coach."}, {"time": 4115, "text": "That's what you need."}, {"time": 4117, "text": "But there's a weird balance there to find."}, {"time": 4120, "text": "Like, I mean, like, and everybody needs a different thing."}, {"time": 4123, "text": "Like I'm much more, I enjoy being sort of like, it sounds weird, but like I'm, you know, from the wrestling background, I enjoy feeling like crap in the sense like the coach, like getting beat up."}, {"time": 4140, "text": "I don't actually enjoy it."}, {"time": 4141, "text": "It's not like some masochistic thing or whatever."}, {"time": 4143, "text": "It's like, it's the growth."}, {"time": 4146, "text": "Like I like the anxiety."}, {"time": 4148, "text": "I like feeling like shit when I go home, like emotionally, physically, it's like, it's growth."}, {"time": 4157, "text": "It's a sign of growth, right?"}, {"time": 4158, "text": "Like if you're not having to feel those things, you're probably in your comfort zone, which is fine, but that's not your growth zone, right?"}, {"time": 4164, "text": "And everybody has a different threshold for that."}, {"time": 4167, "text": "And I mean, the beautiful thing about jiu jitsu is like, it's also has like a yoga feel to it."}, {"time": 4174, "text": "Like you're learning about your body."}, {"time": 4176, "text": "So depending on the gym and depending on, in fact, the coaches or the people around you within the gym, you can select little groups too, kind of like the people with who you roll, like if you're a smaller person, it doesn't mean you have to go against big people."}, {"time": 4190, "text": "You can go against the people who like smoke a lot of weed and they're chill, or you can go against like that crazy red blue belt competitor who's like out to destroy everybody."}, {"time": 4199, "text": "And depending on like what your mindset is, you can kind of select that."}, {"time": 4203, "text": "It's such a fascinating journey of like, basically self discovery."}, {"time": 4210, "text": "It's, I mean, what you need may change over time, right?"}, {"time": 4212, "text": "Maybe what you needed, what you need today could change six months from now or a year from now."}, {"time": 4216, "text": "And that's something that I experienced."}, {"time": 4218, "text": "I'll use my first coach Christian, again, as a great example of someone who I really look up to and respect and someone who helped me a lot."}, {"time": 4225, "text": "Like at a time when I really needed some guidance and I needed to learn martial arts, but get into, Hensel Gracie's gym was right down the street from where Christian was teaching."}, {"time": 4233, "text": "And Christian was a blue belt at the time."}, {"time": 4235, "text": "It was, he was teaching at a place called Fight House, which was this awesome, like, you know, like 90s, early 2000s, you know, warehouse area down on Fashion Avenue in Manhattan, off of like between 7th and 8th."}, {"time": 4248, "text": "And it was like two basketball courts wide, but like there was the Sambo guys over here."}, {"time": 4252, "text": "There was the Kali guys over there."}, {"time": 4253, "text": "There was a Wing Chun over there."}, {"time": 4254, "text": "There was Jiu Jitsu in the corner."}, {"time": 4255, "text": "And Hensel's was one of the most famous academies in the world at that time, still is."}, {"time": 4259, "text": "And I just didn't know what Hensel Gracie was."}, {"time": 4262, "text": "And I mean, it's a great gym and it's a fantastic place for people to train."}, {"time": 4266, "text": "But I think what was right for me at the time was to, I stumbled into, you know, like a two person elevator up and found a place where six people trained at that time."}, {"time": 4275, "text": "And I had someone that could give me some, like in addition to martial arts advice, like personal guidance."}, {"time": 4282, "text": "And that made a big difference."}, {"time": 4283, "text": "And then when initially we would have like competitions or like intra, you know, gym competitions with the Sambo guys, we would compete, we would roll with them."}, {"time": 4291, "text": "And like, again, it was great because they were just a bunch of like Russian dudes from like Brighton Beach."}, {"time": 4295, "text": "And they would come down and then we would all fight."}, {"time": 4298, "text": "And then everyone would train and we'd all drink tea and then go home."}, {"time": 4301, "text": "And anyway, what was, it was super tough."}, {"time": 4305, "text": "And they were like, again, just a tough group of people."}, {"time": 4308, "text": "And then I remember when I decided after like four or five months, I'm like, man, I really want to try to take this seriously."}, {"time": 4314, "text": "And I told Christian about that."}, {"time": 4315, "text": "And he's like, well, hey, I think you need to do the following."}, {"time": 4316, "text": "And it was, you know, like, hey, here's, there was a guy named Jeff Ruth, who was a purple belt at the time, which was a much bigger deal than it is now, but it was 10 and always an MMA fighter, a lot of amateur box spirit, super tough dude."}, {"time": 4326, "text": "And Jeff was the best person at that time that I'd ever trained with."}, {"time": 4330, "text": "And I just got squashed."}, {"time": 4331, "text": "Christian used to beat me up too, but like Jeff would just absolutely kick the crap out of me."}, {"time": 4335, "text": "And I was like, this is awesome."}, {"time": 4336, "text": "And this was back when I was at home."}, {"time": 4338, "text": "I went home for the summer for that."}, {"time": 4339, "text": "And Chris is like, hey, I think you should stay because I told him that's what I was thinking."}, {"time": 4342, "text": "And this was a coach that, you know, when it's like when initially was exactly what I needed."}, {"time": 4347, "text": "And then he's like, well, hey, that's not what I'm doing here."}, {"time": 4349, "text": "Maybe they're going to be able to help you onto a path that's, that's kind of commensurate with what your goals are at the moment."}, {"time": 4354, "text": "And then, you know, that was an, that was an interesting thing."}, {"time": 4357, "text": "And I really got, I feel that I was fortunate to start at a place where my coach was able to transition roles and, and, and do so comfortably."}, {"time": 4366, "text": "And I think that that also was probably a factor of the fact that, you know, where he'd done some of his training prior, like there've been issues with, with the coach there."}, {"time": 4373, "text": "We're like not supporting, not having the support, you know, feeling like, hey, like I'm going to hold onto my students."}, {"time": 4378, "text": "I'm gonna hold onto my best guy or my best girl, even if I can't take them where they need to go."}, {"time": 4383, "text": "So that was an interesting thing."}, {"time": 4385, "text": "And just recognizing also though, that the people like the same way you're an individual going into a gym and you don't know what you're getting into your coach is a person too."}, {"time": 4393, "text": "And he or she, you know, they may have been doing this activity longer than you, but they're not, they're not some weird little, you know, all knowing God."}, {"time": 4400, "text": "They don't know anything."}, {"time": 4402, "text": "They may say something that pisses you off."}, {"time": 4403, "text": "They may, they may yell at you."}, {"time": 4405, "text": "They may help you."}, {"time": 4406, "text": "They may inadvertently cause you some sort of, you know, some sort of issue."}, {"time": 4411, "text": "And just being able to recognize that even though I say this to people and I've said this to people in my gym, I'm like, you know, we're in the service industry, man, but I'm not at your service."}, {"time": 4418, "text": "Like don't get it twisted."}, {"time": 4419, "text": "Like I will absolutely do my best to help people."}, {"time": 4422, "text": "I'm there to do my best as a martial arts coach, but I'm here to do my best as a martial arts coach."}, {"time": 4428, "text": "And I'll do my best and periodically I make mistakes and I own apology or two, and I'll try to give them out when I can."}, {"time": 4432, "text": "But we're not McDonald's."}, {"time": 4434, "text": "It's not, oh, you gave me a hundred bucks, so you do whatever you want in here."}, {"time": 4436, "text": "This is my house."}, {"time": 4437, "text": "This is my gym."}, {"time": 4437, "text": "This is my dojo."}, {"time": 4438, "text": "This is, this is a martial arts."}, {"time": 4439, "text": "This is not a basketball team."}, {"time": 4441, "text": "There's something beautiful about martial arts."}, {"time": 4443, "text": "Like exactly as you said is the coach, like in wrestling and at least collegiate, like high level wrestling is like, there's a dictatorship aspect to a coach that is very important to have."}, {"time": 4456, "text": "Like this, this ridiculous sometimes nature of like master and so on and bowing, all these traditions."}, {"time": 4463, "text": "There's something, it seems ridiculous from the outside perhaps, but there's something really powerful to that because that process of you said, why not, of letting go of the leap of faith requires you to believe that the coach has your best interest in mind and just give yourself over to their ideas of how, how you should grow."}, {"time": 4484, "text": "And that's an interesting thing."}, {"time": 4485, "text": "I mean, I've never been able to really see coaches I've had as human."}, {"time": 4492, "text": "They're always, you always, it's like a father figure or like this, you always put them in this position of power."}, {"time": 4499, "text": "And I think that's, I think at least for me, it's been a very, it's been a very useful way to see the coach because it allows you to not think and let go and really allow yourself to grow and emotionally deal with all the beatings."}, {"time": 4514, "text": "Well, they'll push you where past oftentimes where you would have stopped yourself, right?"}, {"time": 4518, "text": "Which is great."}, {"time": 4518, "text": "And then hopefully they know they, if they're paying attention and they're, they're still a person, they can make mistakes, but they'll push you further than you would have gone, but not so far that it's not facilitative."}, {"time": 4528, "text": "That's something that I can say, like Faraz Zahabi, the head coach at TriStar, my head coach for MMA, Kenny Florian, one of the head coaches for MMA, they've both been phenomenal influences."}, {"time": 4537, "text": "Paul Shriner, who's the one of the assistants at Marcelo Garcia's Academy, coached me in Jiu Jitsu for a long time, brilliant instructor."}, {"time": 4544, "text": "They've all been able to do that."}, {"time": 4545, "text": "And I think what's interesting about all of those guys is they're very sharp, but they're very intuitive as well."}, {"time": 4550, "text": "And I think that Faraz actually, you know, told me about some of the John Wooden said, John Wooden, the legendary UCLA basketball coach, just a simple philosophical idea."}, {"time": 4559, "text": "Just, he said, some people's life is a bowl of shit."}, {"time": 4563, "text": "It needs some whipped cream in it."}, {"time": 4564, "text": "Some people's life is a bowl of whipped cream."}, {"time": 4566, "text": "Needs a little bit of shit in it just to balance it out."}, {"time": 4568, "text": "And it's an interesting thing."}, {"time": 4569, "text": "Coaching everyone the same way doesn't work."}, {"time": 4572, "text": "You know, that's, I think the difference between a coach and an instructor."}, {"time": 4574, "text": "And a lot of times people think they want to coach, but they really want an instructor."}, {"time": 4577, "text": "I'm like, hey Lex, tell me what to do, not how to do it."}, {"time": 4580, "text": "And then other times people think they want, you know, an instructor and they really want a coach."}, {"time": 4585, "text": "I'm like, man, this guy's just giving me information."}, {"time": 4587, "text": "A coach is so much more than an instructor."}, {"time": 4588, "text": "And that's a huge leap."}, {"time": 4590, "text": "And that's something that I think that people need to understand when they're going into martial arts."}, {"time": 4593, "text": "And I understand, and I can totally grasp why they don't, because how would they know?"}, {"time": 4596, "text": "But I think about this a lot, like me giving you $150 for a month, which is not nothing, that's for sure."}, {"time": 4603, "text": "That does not, that pays for instructor really."}, {"time": 4605, "text": "Coach is a relationship that gets developed because can you imagine like just the amount of emotional investment and time thinking away from like, oh, Lex isn't here anymore."}, {"time": 4613, "text": "What can I do to help him?"}, {"time": 4614, "text": "What does he need?"}, {"time": 4615, "text": "Like that's serious."}, {"time": 4616, "text": "And that's the difference between, that's oftentimes the difference that getting over the hump in various situations."}, {"time": 4623, "text": "So it's an interesting, you know, bargain that's being made like commitment by the instructor who becomes a coach, commitment by the student."}, {"time": 4630, "text": "You know, like there's a financial transaction."}, {"time": 4632, "text": "There's a lot of things going on there, but I feel very fortunate to have had not just instructors in my time, but coaches."}, {"time": 4638, "text": "And that means sometimes we butted heads and sometimes I look back and I think I was right."}, {"time": 4642, "text": "And other times I look back on my own, no, they were definitely right."}, {"time": 4644, "text": "But there was always the trust with the exception of one time that I feel that trust was greatly betrayed that rightly or wrongly, whether mistakes, mistakes will be made, but everyone is attempting to do the right thing under no circumstances."}, {"time": 4659, "text": "Is what I intentionally do anything malicious, you know, versus, Hey, I might've done."}, {"time": 4663, "text": "I might've burnt your house down, but you can be darn sure it wasn't on purpose."}, {"time": 4666, "text": "And I think that as long as there's that mutual understanding and mutual belief of goodwill, which again, doesn't just magic up out of nowhere."}, {"time": 4674, "text": "I think that that's when then great things can happen."}, {"time": 4676, "text": "And I look at all the athletes that I know, you know, the guys and girls that I've watched become fantastic in various places, almost invariably."}, {"time": 4683, "text": "It never happened alone."}, {"time": 4685, "text": "I'm really torn about that."}, {"time": 4687, "text": "Like, maybe you can help."}, {"time": 4689, "text": "Have you seen the movie Whiplash?"}, {"time": 4692, "text": "So it's, I would say from an outsider's perspective, people should watch it."}, {"time": 4697, "text": "It's, I guess, jazz band."}, {"time": 4700, "text": "It's a movie about a drummer and the instructor."}, {"time": 4703, "text": "And he, it's a basically, I would say from the outsider's perspective, it's a toxic relationship, but he's really the coach, whatever we call him, pushes the musician, the drummer or to his limits, like to where he just feels like shit emotionally."}, {"time": 4723, "text": "It's a, it looks like a toxic relationship, but it's one that ultimately is very productive for the improvement of the musician."}, {"time": 4732, "text": "I have the same, like in my own experience, I had, I got a chance to train at a couple of places regularly."}, {"time": 4740, "text": "And so one of my coaches who is a great human being, a lot of people love him."}, {"time": 4746, "text": "But when I was a blue belt, he was pushing me a lot for competition."}, {"time": 4751, "text": "And every time I step on the mat, I was anxious and almost afraid of training because of like the places I'm going to have to go."}, {"time": 4762, "text": "And then the, I can't, I don't know what's good or bad because I think I've become a better person because of that experience."}, {"time": 4772, "text": "Like I needed that."}, {"time": 4774, "text": "And on the flip side, like the place I got my black belt from, it's Balanced Studios."}, {"time": 4780, "text": "I remember also blue belt, the coach sitting down and I was going to competition and he saw something in me where he said, you know, like, good luck, but win or lose, we always love you."}, {"time": 4798, "text": "Like, I, I really, I remember that because I really needed that at that time."}, {"time": 4802, "text": "Like I was putting so much pressure on myself."}, {"time": 4805, "text": "Like I'm not an actual professional competitor, you know, I just competed."}, {"time": 4810, "text": "Like I'm a PhD student, like, but like it was clearly having a psychological effect on me and that's what a great coach does is like, you know, it's like life is more important than Jiu Jitsu since it's bigger."}, {"time": 4823, "text": "So they find, you use Jiu Jitsu when you need it to grow as a person and when it overwhelms you, you have to pull that person out, like look at the bigger picture, always look at the bigger picture and it's fascinating and I don't know what to make of it."}, {"time": 4838, "text": "I don't think I would have it any other way is both the anxiety and the, and the love and the love."}, {"time": 4846, "text": "I think that I couldn't, that's a really interesting thing that you're describing that I guess it kind of brings me back to a lot of the other things we've been discussing is just almost like the, the reciprocal nature of everything where no pressure, that's great."}, {"time": 4860, "text": "Everyone's happy all the time."}, {"time": 4861, "text": "It's either, I mean, let's, uh, use the example of sci fi movies to see the matrix, which of course the first one was amazing and then each subsequent movie made the series worse."}, {"time": 4869, "text": "But, um, but basically, yeah, I've heard, we'll see, I was hoping for the best, but, um, but basically, uh, you know, let's say, Hey, which we started with our first initial world agent Smith says to Neo is like our first world was a utopia where everyone was happy and nothing ever went wrong."}, {"time": 4884, "text": "It's like your primitive cerebrum rejected it."}, {"time": 4887, "text": "And I think that there's obviously, I mean, what do I think, but I guess, well, I'm here, so I might as well say what I think."}, {"time": 4893, "text": "Um, I guess, uh, you know, great things are fantastic."}, {"time": 4899, "text": "A kind, gentle place is fantastic."}, {"time": 4902, "text": "And this is again, why I love dune is I think dune does such a great job of, of expressing Frank Herbert does such a great job of expressing again, the reciprocal nature of these ideas."}, {"time": 4910, "text": "You know, look at, uh, look at Sparta for instance, or at least what I understand of Sparta from the reading and also watching 300."}, {"time": 4916, "text": "Um, uh, you know, and reading the Wikipedia and reading the Wikipedia article about the movie, not the place."}, {"time": 4922, "text": "Um, but, uh, it's, um, that's a hard, brutal place."}, {"time": 4928, "text": "And that was their benefit to that."}, {"time": 4930, "text": "Like, absolutely."}, {"time": 4931, "text": "Was there drawback to that?"}, {"time": 4933, "text": "Is it sustainable?"}, {"time": 4934, "text": "I should probably think probably not."}, {"time": 4937, "text": "Um, I mean, granted it hasn't sustained, but I mean, that type of a, of a thing, it, it burns too hot almost."}, {"time": 4942, "text": "And it, uh, it, it destroys the host at a certain point."}, {"time": 4946, "text": "And, you know, I guess that, that type of unforgiving nature, but in entirely, entirely permissive has its own issues."}, {"time": 4953, "text": "And I guess coming back into your, what your description of like describing a toxic relationship is a very dangerous and tricky thing because it's almost like, uh, it's like bird's eye view."}, {"time": 4963, "text": "Me, you know, you see, let's say a husband and a wife arguing, you know, like, all right, well, sort of somebody hitting somebody."}, {"time": 4969, "text": "I need to keep myself out of this because I have no idea what I'm seeing something, but I don't know what's going on or why specifically."}, {"time": 4977, "text": "And again, short of it going to a place that, that just out of bounds, I don't know who's right here."}, {"time": 4983, "text": "I don't know who's wrong."}, {"time": 4984, "text": "And I don't know what phase of this things are in."}, {"time": 4987, "text": "So I guess long term was good for both people."}, {"time": 4992, "text": "It's dangerous for it."}, {"time": 4993, "text": "So if I want to put my finger on the scale, I can understand the desire to do them like, Hey guys, let's break it up."}, {"time": 4998, "text": "But, and that may be the right thing at the time, but at the same time, I'm not sure."}, {"time": 5001, "text": "So I think back to all of the times that."}, {"time": 5003, "text": "You know, that like you mentioned, your coach pushing you when very, very hard."}, {"time": 5007, "text": "And then other times going like, Hey, let's put it in perspective here."}, {"time": 5010, "text": "I think that's an interesting thing for high performance."}, {"time": 5013, "text": "And I think that we're seeing that again, societally, you know, now, or at least maybe that's just pops up on my internet feed periodically but coaches shouldn't be allowed to do this or yell at this person to yell at that person."}, {"time": 5023, "text": "Like, well, have you ever been go to a boxing gym?"}, {"time": 5026, "text": "It's not a commercial entity."}, {"time": 5028, "text": "Not really a real box, not LA boxing, not a USC gym, like a real place."}, {"time": 5034, "text": "You're going to see what things are like when it's entirely performance based."}, {"time": 5037, "text": "Go to wrestling room at a high level."}, {"time": 5039, "text": "You know, again, there's, there's left and right limits and there are such things obviously as abuse, of course, but, and that should never be tolerated."}, {"time": 5044, "text": "Um, but it's not a commercial entity."}, {"time": 5049, "text": "I don't need to be sweet to you if you're, if you're screwing up, if you're dropping the ball and in fact, recognizing that I'm not doing you a favor or the favor or the team a favor by, by being permissive of that type of behavior."}, {"time": 5061, "text": "I think is important."}, {"time": 5062, "text": "Everything in its context and at its time is important."}, {"time": 5065, "text": "And I guess I can think again at the times that I've been put, put, or had put on me, like a great deal of pressure to do X, Y, or Z or to succeed, um, or to push for success."}, {"time": 5075, "text": "And I can't look back fondly enough on those times."}, {"time": 5078, "text": "They were tough at the time, but without that, I'm not sitting here without that."}, {"time": 5082, "text": "I don't go from growing up in a, in a very nice family in the suburbs to fighting at the highest level in jujitsu, gi, no gi, and now in mixed martial arts, starting a career at age 27."}, {"time": 5094, "text": "You know, I don't, it just doesn't happen because people generally speaking from that background, don't get pushed hard enough physically to be able to make that transition."}, {"time": 5103, "text": "And that has benefits and it has drawbacks."}, {"time": 5107, "text": "You know, when you stare into the abyss, it stares back."}, {"time": 5109, "text": "And I think that that's an important thing to understand."}, {"time": 5112, "text": "You know, you stare long enough, you, you can become something that you don't, that you would be sorry that you did."}, {"time": 5117, "text": "You don't look enough and you don't have perspective either."}, {"time": 5120, "text": "You know, and I, I think that that's an interesting thing."}, {"time": 5122, "text": "I can speak to someone who's relative to being someone who's relatively articulate and reasonable."}, {"time": 5127, "text": "I try to be reasonable, but you know, I'll say in sparring, if people get crazy with me, they get a warning and then I'm a crack them."}, {"time": 5133, "text": "And what did they expect?"}, {"time": 5135, "text": "Oh, they hear the guy on a, on an interview, but who did they think they were meeting?"}, {"time": 5140, "text": "Cause there's also the guy in the ring and there's layers there too."}, {"time": 5143, "text": "I remember training with you."}, {"time": 5145, "text": "It was kind of funny."}, {"time": 5146, "text": "There's like, there's, well, you didn't know who I was."}, {"time": 5151, "text": "I mean, you still like, I have a really good straight ankle up by the way."}, {"time": 5157, "text": "So I don't remember what rank I was, but it might've been purple or something like that."}, {"time": 5162, "text": "And I did some, like I, you had this look on your face, which I've often seen in black belts."}, {"time": 5168, "text": "It's like, here he goes again, like here, here's him trying this thing."}, {"time": 5176, "text": "And then when I kind of annoyed you a little bit with it, now I get that it was a good at like, I, you know, I did something somewhat effective, like some, like maybe a little bit off balance."}, {"time": 5187, "text": "There's a, I just peeled off a little layer of Ryan Hall to where I was like, okay, let me, let me like, there, there's like layers underneath Mike Tyson somewhere in there."}, {"time": 5198, "text": "Like, so it was like, okay, this like new guy rolls in here."}, {"time": 5201, "text": "He thinks he can do the stupid thing."}, {"time": 5204, "text": "And then, and then you started to beat the hell out of me."}, {"time": 5206, "text": "But the, the, the point is there's layers here from the guy who was being interviewed now to like Genghis Khan, but it's, but it's all in the same body."}, {"time": 5215, "text": "But it's like, all of us are like that, right."}, {"time": 5217, "text": "In various different directions and recognizing that's okay."}, {"time": 5220, "text": "It's just, there are consequences to all every choice that we make as a consequence."}, {"time": 5223, "text": "Sometimes there's like objectively wrong or objectively right."}, {"time": 5226, "text": "But at least in my mind, that's a pretty small box."}, {"time": 5228, "text": "Everything else is just, there's a consequence to that."}, {"time": 5230, "text": "Do you like that consequence?"}, {"time": 5232, "text": "Do you not?"}, {"time": 5233, "text": "And who do I want to become?"}, {"time": 5234, "text": "What do I want to try to hone myself or anyone else into?"}, {"time": 5238, "text": "And also like, but this is something I've screwed up as a coach plenty of times."}, {"time": 5242, "text": "You know, like if someone says, if you're, if like, I come to them like Lex, I really, really want to take, you know, research very seriously."}, {"time": 5248, "text": "Like, okay, I believe you."}, {"time": 5249, "text": "Now I haven't shown you that, but I believe you like, okay."}, {"time": 5253, "text": "And now me not showing up to research or to study or not being up until three in the morning thinking about this is no longer acceptable."}, {"time": 5260, "text": "There was a time like five seconds before me making that statement that if I went to bed without reading the book that I needed to read, no worries."}, {"time": 5267, "text": "But the second that I made that statement, your expectations for me changed."}, {"time": 5271, "text": "And maybe that's something that I've screwed up a whole bunch of times in my, as a teacher."}, {"time": 5275, "text": "Cause it's an interesting thing, obviously, you know, being a, like running a martial arts school is as you're principally an athlete is sometimes I don't pay enough attention to what people are doing."}, {"time": 5284, "text": "I just go, oh, okay."}, {"time": 5285, "text": "You say X, Y, Z. I'm like, Roger that."}, {"time": 5287, "text": "I believe you."}, {"time": 5288, "text": "I will now put you in category X and whether rightly or wrongly, like maybe this person didn't understand what they were asking for, or I didn't express this or the other."}, {"time": 5296, "text": "And it just, it caused cross wires."}, {"time": 5298, "text": "And then most times you just, you hash it out."}, {"time": 5300, "text": "You have a discussion, you figure out, get to the bottom of what people are trying to do or what they want."}, {"time": 5303, "text": "But if I was paying more attention, I think I could have been a lot more effective."}, {"time": 5306, "text": "Or if I had more experience and sometimes maybe I'm not sharp enough or I don't, I'm not perceptive enough to be able to, to see what's going on."}, {"time": 5312, "text": "And maybe with years more down the line, I'll be able to have a sharper perception."}, {"time": 5316, "text": "But I think that's another one of those interesting things that some, that sometimes I would caution or not caution, but just inform a prospective martial arts student, depending upon where you're going you know, this you, both you and also your coach or other people in the room, they wear many hats."}, {"time": 5330, "text": "And sometimes there's a, I had the wrong hat on."}, {"time": 5332, "text": "You were talking to me as Lex the guy."}, {"time": 5334, "text": "I didn't realize you were talking to me."}, {"time": 5335, "text": "I thought you were talking to me as Lex the guy."}, {"time": 5336, "text": "I didn't realize you're talking to me as Lex the martial artist."}, {"time": 5338, "text": "I'm like, Oh crap."}, {"time": 5339, "text": "I was talking to the wrong person."}, {"time": 5340, "text": "So it's almost like if you had a, like I run my gym with my wife, she's a black belt."}, {"time": 5345, "text": "So she's my wife."}, {"time": 5347, "text": "She's my peers as a martial artist, uh, in Jiu Jitsu."}, {"time": 5351, "text": "He's here by the way, in judging."}, {"time": 5354, "text": "Well, all right."}, {"time": 5355, "text": "So, but, but a fellow black belt."}, {"time": 5356, "text": "And I guess like another thing, she doesn't have a microphone, so you can't hear all the trash she's talking."}, {"time": 5360, "text": "But it can be tough."}, {"time": 5361, "text": "And that's something that we've had to work through a lot."}, {"time": 5363, "text": "And it's like looking back and it's like now being where I'm at now."}, {"time": 5366, "text": "And it's easy for me to say that cause she's in the room and I don't want her to stab me, just continue to slowly poison me over time, which frankly I understand."}, {"time": 5373, "text": "Um, you know, it's, it's the sort of thing that is now way more effective than anything else I could really reasonably expect to have."}, {"time": 5380, "text": "Um, but there were times when, when both of us, you know, were justifiably annoyed at the other because of crossed wires."}, {"time": 5387, "text": "And sometimes, you know, you'll just have to scream in any way or misunderstanding anyway."}, {"time": 5390, "text": "But again, like I've, I coached some of my friends, I've coached, I've coached my friend who I've known since I was four years old."}, {"time": 5396, "text": "You know, sometimes I don't go, Hey buddy, how are you doing?"}, {"time": 5398, "text": "Sometimes it's like, what the fuck are you doing?"}, {"time": 5400, "text": "Put your hand over there."}, {"time": 5400, "text": "How many times we talked about this?"}, {"time": 5401, "text": "And then you walk away and you can see him look at you crooked and you're like, Oh crap."}, {"time": 5406, "text": "He thought I was talking to his friend."}, {"time": 5407, "text": "Well, all right, let, we need to talk this one out, hashing out and not he's wrong."}, {"time": 5411, "text": "How could he possibly think that way?"}, {"time": 5412, "text": "Like, Oh no, I totally understand that."}, {"time": 5414, "text": "But if I was 22, like doesn't need no, I'm a purple belt, some nonsense like that."}, {"time": 5418, "text": "And it's, and it doesn't come from a bad place, but it's just, I guess that comes back to society to anything."}, {"time": 5423, "text": "People only had the perspective that they have and the awareness that we have."}, {"time": 5426, "text": "And so again, going back and going, Hey guys, grace, like I don't expect, it's not fair for me to go, I fight UFC."}, {"time": 5432, "text": "Why doesn't this guy who came in as an attorney understand how hardcore this needs to be?"}, {"time": 5436, "text": "I'm like, how could he?"}, {"time": 5437, "text": "And at the same time though, if, if I'm using the language of someone that is interested in at least performance from a martial arts perspective, I understand how that could be off putting."}, {"time": 5447, "text": "Let's say for instance, someone that's like all of that would be out of bounds in their normal workplace."}, {"time": 5452, "text": "But if they think of the gym as my office, then whether they agree or disagree with what's going on, they go, okay, I hear why I see why that might happen."}, {"time": 5458, "text": "Let's talk about this."}, {"time": 5459, "text": "And we can, again, all push forward in a positive direction that benefits, I guess, everyone's journey throughout the activity."}, {"time": 5465, "text": "And on top of all that, there's moods."}, {"time": 5468, "text": "Like I, I mean, especially lately, I think two days ago, maybe yesterday, no, two days ago, I've never been that cranky in my life."}, {"time": 5481, "text": "I think, I don't know what it was, but I wanted to tell everybody how much they annoyed me."}, {"time": 5488, "text": "It was like, I was just very conscious of this feeling of like, why, why is this happening right now?"}, {"time": 5495, "text": "So I consciously decided as I usually do in those cases to not say anything to anybody."}, {"time": 5503, "text": "Well, I, you know, it's, it's yeah."}, {"time": 5507, "text": "Meditate because it's not, I tend to, I tend to then visualize what's going to happen in the next, like, how is this going to make my life better?"}, {"time": 5515, "text": "Like if I say something that mean to somebody else, I have just started a conflict that will just escalate, will continue, will add more conflict to my life."}, {"time": 5533, "text": "It will make things, I just don't like the feeling you will create."}, {"time": 5537, "text": "And so you live in enough life to know that like, it's just like with like street fighting."}, {"time": 5544, "text": "I would get into a lot of fights when I was younger, just on the street, but then you realize like, it's not like a jujitsu match or something like that."}, {"time": 5552, "text": "It's not, it'll escalate."}, {"time": 5555, "text": "It'll, it might come back at you."}, {"time": 5558, "text": "It'll like that person might find you again."}, {"time": 5560, "text": "But more importantly, the anxiety of it, of having created little enemies in this world, distorts the way you see the world."}, {"time": 5572, "text": "So I've noticed that like, if I am shitty to people on the internet, which I haven't been, I think in a long time is like, it, it somehow brings the shittiness to you more and more, it escalates like the more love you put out there, the more like the people who put love out, like surround you."}, {"time": 5591, "text": "Well, you mentioned forgiveness as well."}, {"time": 5592, "text": "Like you said, like, I guess back to the original, you know, the Holocaust survivor scenario where you're like, oh my God, like you think of the ultimate in, in like, I've never experienced one, one billionth of that level of, of pain and horror."}, {"time": 5604, "text": "And it's like, and I can't let this little thing go."}, {"time": 5608, "text": "You know, I guess that's an interesting thing."}, {"time": 5609, "text": "I think you're just making the point in your personal life, I guess the same way."}, {"time": 5614, "text": "And on the internet, it's hard."}, {"time": 5615, "text": "I've somehow gotten, I mean, you've, you've had a level of celebrity for a while."}, {"time": 5622, "text": "I've recently gotten some level of like celebrity and like these people who are just shitty for no reason come out from all, from all places, like calling me a fraud or anything else."}, {"time": 5637, "text": "It was Jay and Silent Bob, Strike Back."}, {"time": 5639, "text": "They find out a movie is going to be made about them and people were talking shit on the internet and they're like, what's the internet?"}, {"time": 5643, "text": "And then someone shows them and they're like, what?"}, {"time": 5645, "text": "And they go to a message board and they go to Hollywood to try to stop it from being made."}, {"time": 5649, "text": "And they eventually get money for their likeness and they use the money to buy plane tickets and fly around and beat the shit out of all the people that talk bad about them."}, {"time": 5656, "text": "I mean, it's I'm, I'm having trouble with it cause there's people like, yeah, there's, you know, there's posts and forums and like heated discussions about is like sweeping a fraud."}, {"time": 5667, "text": "What has he really done?"}, {"time": 5668, "text": "And there's like, and then there's people like, well, I think he's an all right guy, but I'm not sure."}, {"time": 5673, "text": "Like, like there's like literal discussions and I'm like, like nobody, like if you increase the level of celebrity, there's going to be like one of the things that hurts my heart a little bit is like some level of toxicity around Joe Rogan."}, {"time": 5688, "text": "For example, there's like communities of people that now like talk about him selling out, for example, all that kind of stuff."}, {"time": 5696, "text": "And I don't, you know, and Joe I've talked to him about it is amazing that he he says, don't read the comments."}, {"time": 5705, "text": "He legitimately doesn't read the comments."}, {"time": 5707, "text": "His heart and his soul doesn't give a damn about the comments."}, {"time": 5712, "text": "All he gives a damn about is his friends."}, {"time": 5714, "text": "Like one of the things that's really inspiring to me and that's I've had a conversation with them offline about Spotify and the removed episodes."}, {"time": 5724, "text": "People are curious."}, {"time": 5726, "text": "Um, it's, uh, it's a thing on the internet where, uh, I think you can play Taylor Swift songs on, um, but you can also now play Joe Rogan podcasts and they gave him a hundred million dollars."}, {"time": 5742, "text": "So that that's, um, you know, that's it's yeah."}, {"time": 5746, "text": "Uh, but the thing I've had a discussion with him and I made a video about it that I took down because of the toxicity is like, it's hard to put into words, but he will give away the a hundred million in a second."}, {"time": 5760, "text": "If he ever has to compromise who he is, like he doesn't, I mean, he already said, as he talked about, he's made quote unquote, fuck you money a long time ago, he doesn't need any more money."}, {"time": 5774, "text": "He doesn't care."}, {"time": 5775, "text": "It's nice to have money, whatever, but like, he'll give it away."}, {"time": 5779, "text": "So the it's nice to see when people like him at a level of celebrity level of success and financial success, don't change at all."}, {"time": 5833, "text": "And it's kind of inspiring to see that."}, {"time": 5835, "text": "And I hope people, I hope people realize how special of a human he is."}, {"time": 5841, "text": "He's inspired like people like me, like I'm just, I'm a scientist, right?"}, {"time": 5847, "text": "So he inspired somebody like me from a very different walk of life to be like kind to others, to be open minded."}, {"time": 5856, "text": "I don't know that it's a special dude."}, {"time": 5859, "text": "So like people need to support that and treasure that as opposed to as opposed to be toxic about it."}, {"time": 5867, "text": "I mean, what people really for a long time have told me that it would be awesome if Ryan Hall goes on Joe Rogan."}, {"time": 5877, "text": "I definitely think that would be an awesome thing."}, {"time": 5880, "text": "Have you listened to Joe?"}, {"time": 5882, "text": "Has he been a part of your life in some kind of way?"}, {"time": 5884, "text": "You know, well, Joe's always, I remember watching Joe on Fear Factor when I was a little kid, which is cool."}, {"time": 5889, "text": "So I've actually gotten to like, from a bird's eye view, watch his kind of just path through life."}, {"time": 5896, "text": "But one of the things that I always appreciate, and again, I barely know Joe other than to shake his hand."}, {"time": 5900, "text": "He interviewed me after the, briefly in the ring after the BJ pan fight."}, {"time": 5904, "text": "But one of the things that I've always admired about Joe is that I think he had fucking money from the start."}, {"time": 5910, "text": "I think that zero dollars is fucking money for Joe."}, {"time": 5913, "text": "I think, and that's something I respect about him a great deal because as you say, it's interesting to watch, it's like you hope that George St. Pierre is like this."}, {"time": 5922, "text": "It's really, I'm not super close to George, but we're teammates at TriStar and he's never been anything but a gentleman."}, {"time": 5927, "text": "He's one of those people that if you didn't know George was famous when you walk into the gym, you'd have no idea."}, {"time": 5932, "text": "He's not holding court, not doing it."}, {"time": 5933, "text": "He's just, you know, training and he'll help out an amateur doing this."}, {"time": 5936, "text": "If you have a question for him, he'll help me."}, {"time": 5938, "text": "Like I'm nobody, man."}, {"time": 5939, "text": "He would give me advice and train me."}, {"time": 5941, "text": "It was super cool."}, {"time": 5942, "text": "And he didn't kill me, which I really appreciated."}, {"time": 5944, "text": "He's a gentleman."}, {"time": 5945, "text": "But you know, it's like you meet someone and you go, man, it's so cool that this is the guy who's the best, that this is the guy who has been successful."}, {"time": 5953, "text": "And then you go, why are they successful?"}, {"time": 5956, "text": "Like I said, true to what they're doing."}, {"time": 5958, "text": "They haven't changed."}, {"time": 5958, "text": "They're the same as they've been."}, {"time": 5959, "text": "And I remember I got to TriStar in 2012 and George was already George St. Pierre, but I remember watching and talking to people and they're like, oh man, George is the same as he's always been."}, {"time": 5967, "text": "And it's neat."}, {"time": 5967, "text": "I see him in the gym training now and again, giving advice now."}, {"time": 5970, "text": "And it seems like Joe has always been consistent."}, {"time": 5973, "text": "And it's neat to watch someone not compromise on their values and not change who they are."}, {"time": 5978, "text": "And not, you know, periodically, like, you know, again, we all make mistakes."}, {"time": 5980, "text": "Like you have a bad day or this or that."}, {"time": 5982, "text": "And an apology needs to be issued or even my bad or this or that."}, {"time": 5985, "text": "And you're like, yeah, and they just move on that they're not afraid to be themselves and they're not afraid to be wrong."}, {"time": 5990, "text": "They're not afraid to make a mistake."}, {"time": 5991, "text": "As you mentioned, open mind and some like, so what are the correct beliefs to have about this that I know going in, everyone's going to be okay with what I'm saying, which is usually the beginning of a conversation that's going to go nowhere."}, {"time": 6001, "text": "And, uh, it's, it's neat to see, um, the things I guess that he's created on his own as a result of the authenticity that's there."}, {"time": 6010, "text": "And it reminds me of like Dave Chappelle."}, {"time": 6012, "text": "And, and again, I don't know, I've never met Dave, but it's neat to see someone that's clearly again, authentic in their own way, doing their own thing."}, {"time": 6020, "text": "And they're because of that, they're above the corporate nonsense."}, {"time": 6024, "text": "But what's funny, I think the message behind all of it is, Hey guys, we all are, I can't promise you that I'm going to have money."}, {"time": 6030, "text": "Joe couldn't promise you that he's going to have money."}, {"time": 6032, "text": "Now it ended up working out, but he was above that nonsense from the jump."}, {"time": 6038, "text": "And he just continued to be above it by never giving it any mind and just going like, yeah, I'm going to be a reasonable person."}, {"time": 6042, "text": "I'm going to try to learn."}, {"time": 6043, "text": "I'm going to try to grow."}, {"time": 6045, "text": "And, uh, if I say something annoying, you can come and talk to me about it."}, {"time": 6048, "text": "We can get to the bottom of it."}, {"time": 6049, "text": "And I'm like, if I need to say my bad, thanks, appreciate it."}, {"time": 6052, "text": "You know, I will."}, {"time": 6053, "text": "And if I don't need to, I'm like, Hey, I still appreciate the talk."}, {"time": 6055, "text": "Thanks man."}, {"time": 6056, "text": "I'll shake your hand and we'd carry on and we'd go our separate ways and hopefully I'll treat you with respect."}, {"time": 6059, "text": "You treat me with respect and that's about it."}, {"time": 6062, "text": "And I guess I think it's a lesson that it can work out no matter what you don't have to count out to like these weird powers that be."}, {"time": 6069, "text": "And whether you're at this level or at this level, but you can live your life the way that you want."}, {"time": 6074, "text": "And as you mentioned, talk to your friends, hang out, be happy."}, {"time": 6076, "text": "And it just so happens that that resonates with people."}, {"time": 6078, "text": "It actually reminds me of like, uh, speaking to MIT and being in Boston is like a good will hunting."}, {"time": 6083, "text": "You know, like, again, that's what did he really want to do?"}, {"time": 6085, "text": "He could have gone this way."}, {"time": 6086, "text": "Could have gone that way."}, {"time": 6087, "text": "And it was an interesting story, but it's like this person wants to hang out with his buddies and wants to do other things."}, {"time": 6093, "text": "And again, it happens to be brilliant and happens to be able to do all these other things, but there was."}, {"time": 6098, "text": "I guess it's like, at least in my mind, a story of authenticity as well."}, {"time": 6101, "text": "And it was both the same thing in the Robin Williams character."}, {"time": 6104, "text": "And I just think that that's a message cause watch watching things occur on the internet as they do now."}, {"time": 6110, "text": "Think so many things playing out in the public eye."}, {"time": 6112, "text": "I feel like so many private or otherwise formerly private discussions and disputes and, and, you know, interactions now become, they all have a, a, well, what is this going to say when it goes public?"}, {"time": 6122, "text": "So how can I couch what I'm saying?"}, {"time": 6124, "text": "Or how can I word this in a way that's going to get people on my side or use the right buzzwords and not use the wrong buzzwords."}, {"time": 6129, "text": "And it's just neat to see people."}, {"time": 6131, "text": "You know, in their own way, flip the bird to the head, because I just think that that's, that's just not how a human being is meant to think or interact."}, {"time": 6138, "text": "I'm curious what you think about the thing that recently has, you know, me like hosting this podcast, I sometimes think about like, who should I talk to and not in terms of like, it's the, the old Hitler question now, Hitler, I would definitely talk to because post world war II, because everyone knows he's evil."}, {"time": 6163, "text": "The question, whether you talk to Hitler in 1937, like when people who are really students of what's going on, understand that this is a very dangerous human being."}, {"time": 6177, "text": "But a large number of the part of the world are like, well, he's a leader who cares for Germany."}, {"time": 6184, "text": "So the question I have, it's interesting to me, it involves a particular person named who also lives in Austin, Texas named Alex Jones."}, {"time": 6193, "text": "I don't know if you're familiar with the guy."}, {"time": 6194, "text": "I am familiar with Mr. Jones."}, {"time": 6197, "text": "I've actually recently just listened to Infowars, like one episode of his show, I guess that he does every day."}, {"time": 6205, "text": "And it kind of reminds me of a time in college when I drank too much tequila."}, {"time": 6212, "text": "There's no turning back."}, {"time": 6213, "text": "Like, it's like, like the mistakes you make that like, it's, I mean, you don't know where you're going to wake up, you don't know who you're going to kill or not kill or steal or rob, it's unclear."}, {"time": 6229, "text": "So that, it felt like I was getting pulled into a dark place where pretty much everybody is a pedophile that's trying to control the world."}, {"time": 6240, "text": "So Bill Gates definitely is a pedophile."}, {"time": 6244, "text": "Everybody in power, anybody in power, there's a kind of a deep skepticism about power and a conspiratorial way to see the world where everything is like dark forces in all corners."}, {"time": 6257, "text": "It's like the way you feel when you're a kid, that there's a monster hiding in the closet."}, {"time": 6261, "text": "Which is also why you leap over the bed from like four feet away."}, {"time": 6264, "text": "There's a strategy."}, {"time": 6266, "text": "So, but he says that you're just being weak."}, {"time": 6268, "text": "You need to look under the bed."}, {"time": 6270, "text": "Under the bed, there's monsters and we need to be aware of them because they're growing, they're multiplying."}, {"time": 6275, "text": "You should be."}, {"time": 6276, "text": "And they're touching children."}, {"time": 6277, "text": "They're touching children."}, {"time": 6279, "text": "So it all connects."}, {"time": 6280, "text": "But the, the, I, when I listened to him and I thought about like, do I want to talk to him on this podcast, for example, when I listened to his conversation with Joe Rogan, the two times he talked on there, to me, it was somehow entertaining."}, {"time": 6299, "text": "Like it was fun to listen to."}, {"time": 6301, "text": "It's fun to listen to a madman go on for four hours because it's almost like theater."}, {"time": 6310, "text": "Like, this is what I talked to Joe about."}, {"time": 6313, "text": "When people try to censor Alex Jones, Joe says that the people who try to censor him don't give enough credit to the intelligence of human beings to like, understand like that, like what a person says on a large platform does not necessarily is not the truth."}, {"time": 6332, "text": "You can be a madman and say crazy things and people are intelligent enough to hear certain things being, when they're said like the earth is flat, they can, they can be intelligent enough not to all of a sudden start believing that the earth is flat."}, {"time": 6349, "text": "Like they, they're intelligent enough to sort of select different ideas and be able to enjoy the theater of a particular ridiculous over the top conversation without being sort of influenced to where they start believing like toxic set of beliefs."}, {"time": 6365, "text": "Now there's a lot of sort of other kinds of people, especially now with cancel culture that say, well, you don't want to give platform to crazy people that ultimately whose beliefs might lead to dangerous consequences."}, {"time": 6380, "text": "Like, and I see it very often now with conspiracy theories that go, that go like way too far."}, {"time": 6419, "text": "And yet every interview, anything you see now on Bill Gates, everyone is calling him, I believe haven't looked into it, but I believe everyone's calling him a pedophile."}, {"time": 6430, "text": "I don't know the full structure of it, but it's, it's just a very, it feels like an army of like, it feels like it's hundreds of thousands of people."}, {"time": 6438, "text": "That's what it feels like."}, {"time": 6439, "text": "It might be a much smaller percentage, but it feels like a huge number of people are calling him a pedophile."}, {"time": 6444, "text": "So that's the, that's the flip side."}, {"time": 6446, "text": "If you allow, if you give platform to conspiracy theories like that, then you start to have bigger and bigger percent of the population believe in these crazy things."}, {"time": 6455, "text": "I just, I wanted to put it out there."}, {"time": 6457, "text": "Cause I don't know what to think of that."}, {"time": 6460, "text": "If you put yourself in Joe Rogan's shoes, if you put yourself in my shoes, if you put yourself just in your own shoes, I mean, I'm even I'm in my shoes right now."}, {"time": 6469, "text": "If you're staying in your shoes, just stay in your shoes."}, {"time": 6471, "text": "Can I have your, would you talk, would you give platform to people like Alex Jones, would, would you talk to somebody like Alex Jones or, or not?"}, {"time": 6485, "text": "Uh, I, yes, I would."}, {"time": 6487, "text": "And I feel very strongly about this, honestly."}, {"time": 6489, "text": "Um, well, I think that it's, it's an interesting thing and I, I would just say a lot of times, um, I can understand, you know, very, very clearly why people would take issue with the idea of, I guess what they proceed to be amplifying this man's voice, this man's reach, um, you know, as, as a demonstrable negative."}, {"time": 6510, "text": "But I think, um, you know, when you take a step back further, uh, the, the cure is more damaging than the disease and significantly."}, {"time": 6520, "text": "So, um, I guess I think that I'm very, very wary of, I think being where you mentioned Alex Jones being wary of power and people with it, that's a lot of times there's a lot of truth and validity to crazy things that people say it's the conspiracy theories that stick are the ones that sound credible, at least quasi credible in some aspect."}, {"time": 6545, "text": "And it's almost like it seems to me like an anchor in people's mind."}, {"time": 6547, "text": "And it is also funny to me, obviously the, the Bill Gates, it's so funny to tar people with things like pedophile, racist, rapist, like, these are things that we're basically trying to pick words that no one can ever support someone who does these things."}, {"time": 6560, "text": "And that's, you know, and that changes year by year."}, {"time": 6564, "text": "Like currently pedophile is totally in as a thing to call somebody just, just as a, it used to be communist or Marxist Cleveland Browns fan, you know, like, come on, you know, actually nobody likes the Browns."}, {"time": 6578, "text": "So I'll agree with you."}, {"time": 6579, "text": "That was, that's why I picked them."}, {"time": 6580, "text": "That's the trick is you find a group of people that nobody likes."}, {"time": 6583, "text": "We're good here."}, {"time": 6584, "text": "That's the move, but, uh, yeah, that's a creepy thing though, because that is, that is the creepy thing is like, if people are always looking for groups of people are always looking for, and I find this really deeply disturbing, um, like, Hey, so who's the guy that we can all get away with?"}, {"time": 6598, "text": "You know, just treating like dirt, who's the guy that I can be a dick to?"}, {"time": 6602, "text": "I can just walk up and punch in the face and no one's going to say anything."}, {"time": 6605, "text": "And it's, even if I, you know, people do that with, whether it's literal Nazis or someone that I called a Nazi, you know, I guess what's the bigger issue, this person's ridiculous beliefs or what I'm doing."}, {"time": 6617, "text": "And you mentioned Hitler before, and obviously Mein Kampf being a, you know, like the outline for some of the things he did later and when the evil was it always there, did it, did it take root later on or flourish later on?"}, {"time": 6628, "text": "But was, was Adolf Hitler a problem because he had crazy ideas or because he did things?"}, {"time": 6635, "text": "I think it's because it's not, I think I know it's because he did things."}, {"time": 6638, "text": "Now, if I'm going to start punishing thought crime, I, I'm going to have to start punishing thought crime."}, {"time": 6644, "text": "And that's a terrifying concept."}, {"time": 6646, "text": "Even if I'm right about the certain, about the objectively correct about the things that I decide to call out of bounds, who put me in charge and made me arbiter of good taste and how long until I did it, did it, did it, did it, did it long until I decide that something else is, is out of bounds."}, {"time": 6661, "text": "It's, it's always a sliding scale or it's always a sliding standard."}, {"time": 6665, "text": "And I find that, that, you know, to be more of a concern than people doing crazy things, because I guess if you mentioned Alex Jones, you know, putting out ridiculous, ridiculous ideas, ridiculous theories, I think that most people don't look at Alex Jones as a credible person."}, {"time": 6678, "text": "Now I'm not going to pretend to be deeply read into all of his beliefs or the things that he's trying to peddle."}, {"time": 6683, "text": "Um, but there's plenty of things that are quasi mainstream that I think on with this side or that side that maybe not comparably ridiculous, but are, you know, particularly in hindsight or, you know, or we're not, or, or silly."}, {"time": 6697, "text": "And I guess, uh, the idea of, of getting a group of people together to decide what we're not going to tolerate is a very, very tricky thing."}, {"time": 6706, "text": "And I think that, you know, it reminds me of law or, you know, even, you know, religion when it gets to like, what are the things that we don't like?"}, {"time": 6714, "text": "How do we feel about rape?"}, {"time": 6716, "text": "It's like, no, under no circumstances."}, {"time": 6718, "text": "Is that an acceptable behavior murder?"}, {"time": 6720, "text": "No, that's not acceptable behavior."}, {"time": 6721, "text": "Killing, I don't know, kind of depends on the situation."}, {"time": 6725, "text": "Are you at war?"}, {"time": 6726, "text": "Were you justified?"}, {"time": 6726, "text": "Were you acting in self defense?"}, {"time": 6729, "text": "So it's not now murder is a specific type of killing the same way, you know, other things should be a specific type of something else."}, {"time": 6736, "text": "But I guess we, we draw the line of murder."}, {"time": 6737, "text": "We say, if you want to exist in our society, you can't do this."}, {"time": 6740, "text": "This cannot be done."}, {"time": 6741, "text": "And then we go theft."}, {"time": 6743, "text": "If someone said, Hey, I murdered that guy."}, {"time": 6744, "text": "Can you understand where I'm coming from?"}, {"time": 6746, "text": "I might say, yeah, I'll hear you out."}, {"time": 6747, "text": "It doesn't mean that I think you're right, but I'm like, have you ever been wronged so deeply that you could imagine that you could kill someone?"}, {"time": 6753, "text": "I'm like, no, I haven't, but I could conceptualize someone doing that."}, {"time": 6756, "text": "And I'm like, yeah, okay."}, {"time": 6757, "text": "And you still need to go, you still need to face, you know, criminal justice as we have it in our system, or at least that's how we've decided."}, {"time": 6763, "text": "Yeah, there's, it's interesting."}, {"time": 6764, "text": "You have to be able to like, there's, if you look at the history of discourse in this country, I think it's still true, but I'm not sure it's changed since 9 11 is, uh, it used to be impossible to criticize, um, a soldier."}, {"time": 6783, "text": "It was easier to criticize war."}, {"time": 6785, "text": "It was harder to criticize soldiers for allowing themselves to be the tools of war."}, {"time": 6790, "text": "I tend to be, maybe it's the Russian upbringing."}, {"time": 6793, "text": "It's the, it's the combat thing."}, {"time": 6795, "text": "I tend to romanticize war and soldiers."}, {"time": 6799, "text": "I see soldiers as heroes, but I've also heard people that not only say that soldiers are, uh, war is bad."}, {"time": 6808, "text": "They say soldiers are bad."}, {"time": 6811, "text": "What's their argument?"}, {"time": 6813, "text": "It's, it's the kind of a libertarian view that they're basically slaves to evil, right?"}, {"time": 6821, "text": "War is evil and they're, they're given, they are suspending their moral and ethical, like, as like duties as a human being to become the tools of evil."}, {"time": 6833, "text": "That's the sort of the argument."}, {"time": 6835, "text": "If you see war as evil, I mean, I think it's useful to hear that, but there's for a long part in history that was completely unacceptable."}, {"time": 6845, "text": "Same with abortion."}, {"time": 6848, "text": "If you see abortion as murder, I mean, if I classify it in that, if I put it in that, in that basket, it starts, we're living in the midst of like a genocide."}, {"time": 6865, "text": "Looked at from that perspective, could you feel how people could be deeply upset by abortion?"}, {"time": 6869, "text": "You go, of course."}, {"time": 6869, "text": "Looked at from a different perspective, you say, I don't believe it to be murder."}, {"time": 6872, "text": "That's not how I see it."}, {"time": 6874, "text": "Then you go, oh, well, if that's the genesis of your, your thought process, then you're like, yeah, okay."}, {"time": 6878, "text": "Now, now I see how we can come to a different thing, but I guess we go, well, abortion is murder period."}, {"time": 6884, "text": "Therefore, if you support it, you support murder."}, {"time": 6887, "text": "That's a convenient way for me to tar you."}, {"time": 6889, "text": "But I guess that's kind of coming back to the Alec Jones."}, {"time": 6892, "text": "I'm, I'm just a nuance."}, {"time": 6894, "text": "It's a, you have to have the nuance in these kinds of conversations and I have to be willing to have the conversation and I have to be willing to sit down."}, {"time": 6900, "text": "If I can't sit down across from like the most violently racist, angry, hypothetical internet, you know, conceived person that none of us have ever actually met in real life, but are hopefully not, you know, and go like, well, of course I believe that this person's wrong, but allow me to change, do my best."}, {"time": 6916, "text": "I'll hear them out and I'll go, no, I can go point by point and explain where this guy or this girl is wrong and hopefully bring them over to a more reasonable position where they will have better beliefs and they will like objectively better beliefs and beliefs that will, will, and they'll treat other people better."}, {"time": 6930, "text": "Why would I want to marginalize this person?"}, {"time": 6932, "text": "I might not want to talk."}, {"time": 6932, "text": "I might not want to invite them to my barbecue if they're acting like a jerk all the time, but how could I, would it not make the world a better place if I'd hear them out and they go, look, if you're going to sit down and talk with me, we're going to have to have a discussion."}, {"time": 6942, "text": "I'll hear what you have to say."}, {"time": 6944, "text": "And if I can't, if I can't explain to someone why their ridiculous belief is wrong, then I might, I must not be so confident in my position."}, {"time": 6952, "text": "And I guess that's where I come back to the Alex Jones thing."}, {"time": 6954, "text": "As you mentioned, you know, with, with Bill Gates and, and you're much more familiar with, with the specifics of all the good that he's done, but you know, again, he's been an unbelievable force for good, you know, in this world."}, {"time": 6965, "text": "You can list A, B, C, D things that the man has, has done, that his foundation has done and, you know, positive things."}, {"time": 6973, "text": "And then the other people could speculate about ridiculous, crazy levels of, of evil, but you can't produce any evidence for that sort of thing."}, {"time": 6981, "text": "Because if you could, the man will find himself in some trouble, you know?"}, {"time": 6983, "text": "And anyway, I guess what I would, would say is that why you can't force me to accept the truth the same way you could write down two plus two equals four on a piece of paper and show me how it works."}, {"time": 6993, "text": "And I could say, no, but that doesn't make it not true."}, {"time": 6996, "text": "And you've still given yourself an opportunity to present your case."}, {"time": 6998, "text": "You've presented it to me."}, {"time": 7000, "text": "And you've also, for anyone listening and watching, you know, you've been able to critically assess what's gone on, you know, or critically address back and forth, you know, kind of the, the discourse."}, {"time": 7010, "text": "And I think that you almost, you're making your case for the public."}, {"time": 7012, "text": "So I guess like, you know, when it comes to just never not engaging with these people, that seems to me to be cowardly."}, {"time": 7019, "text": "And I think that that's a, something that we're seeing in society right now, I think we're seeing a crisis of courage in society all over the place."}, {"time": 7026, "text": "And I think that's where we're seeing poor leadership."}, {"time": 7029, "text": "I think we're seeing understandable things happening everywhere, but we need stronger voices and stronger, stronger beliefs that have a conviction and are willing to engage with others, not just turning into a shouting contest and not, I didn't win because there's more of me."}, {"time": 7042, "text": "Oh, I voted, I outvoted you."}, {"time": 7043, "text": "That's nice too."}, {"time": 7044, "text": "But that's a stand in for bullets."}, {"time": 7046, "text": "That's saying I won because there's more of me."}, {"time": 7047, "text": "That doesn't mean that I'm right because plenty of horrible and unpopular now things have been very, very deeply popular in the past and would have won a popular vote."}, {"time": 7055, "text": "Does that make them right?"}, {"time": 7056, "text": "I'd say clearly not."}, {"time": 7058, "text": "So I guess you'd hope that we engage with these people and that you can do your best to bring them over to a more reasonable position if you believe that you have one."}, {"time": 7065, "text": "And if you can't, well, at least you made the effort."}, {"time": 7067, "text": "And I think that that's something where martial arts shows the value."}, {"time": 7070, "text": "It's like, do you know if you're going to go win your next fight?"}, {"time": 7072, "text": "I'm like, I have no idea."}, {"time": 7073, "text": "I will proceed forward with full effort and I will fight with dignity."}, {"time": 7078, "text": "I'll fight with honor and I'll fight with courage and I'll use everything that I have and I will play within the bounds of the game and that's that."}, {"time": 7085, "text": "And the result will be what it'll be."}, {"time": 7086, "text": "But I'll walk into and out of that ring with my head held high because I will know that I did my part."}, {"time": 7090, "text": "I did my job."}, {"time": 7091, "text": "The outcome, the specific outcome is not in my control."}, {"time": 7094, "text": "It's just strongly in my influence."}, {"time": 7096, "text": "And I think that that's something that helped me, that martial arts has taught me because other times, even when I was successful or unsuccessful, I would focus on if I won, I won, therefore I'm good."}, {"time": 7106, "text": "I lost, therefore I'm bad."}, {"time": 7107, "text": "This other guy won or lost, therefore, as opposed to evaluating their method."}, {"time": 7111, "text": "And I think it's so easy when we're taking a bird's eye view of things to not evaluate how someone's doing things."}, {"time": 7116, "text": "You're not evaluating my process."}, {"time": 7118, "text": "You're simply evaluating my outcome."}, {"time": 7119, "text": "And I could have stumbled into something very, very good or very, very bad."}, {"time": 7122, "text": "And we can look back and I think that's the value of history."}, {"time": 7124, "text": "I mean, I don't mean to get on my dang high horse, but it's like this value of history is we can see the unbroken chain or the chain of events that led us somewhere."}, {"time": 7131, "text": "And then only with the eyes of history can we truly evaluate things unless we're in the room watching it happen."}, {"time": 7137, "text": "And I guess that's, again, where we start to go most of the big, bad, scary things that have happened in history that are done particularly on an industrial scale, which implies governmental power and things like that or the equivalent, involve groups of people getting together and going, hey, we're not going to deal with that guy, giant groups of people."}, {"time": 7156, "text": "So maybe we're right this time, but maybe we're wrong next time."}, {"time": 7160, "text": "And I guess I would be back to the Gandalf putting on the one ring."}, {"time": 7162, "text": "I would be very, very hesitant, even if we thought we were in the right to simply try to try to marginalize just on general principle."}, {"time": 7170, "text": "Even people like Alex Jones, whom on their face are pretty ridiculous."}, {"time": 7173, "text": "Like you said, you should sit down with Adolf Hitler and talk to the man."}, {"time": 7176, "text": "I agree with you to play a little devil's advocate is Alex Jones might be a bad example."}, {"time": 7184, "text": "But if we look at, because he has a face, he is a human, he's a real person."}, {"time": 7188, "text": "There's also trolls on the internet for Chan."}, {"time": 7195, "text": "The worry I have with those folks is that, and there might be parallels to martial arts is they practice guerrilla warfare, meaning they don't necessarily want to arrive at the truth."}, {"time": 7209, "text": "They just always want to cut at the ankles of the powerful."}, {"time": 7213, "text": "Like they want to always break down the powerful."}, {"time": 7217, "text": "And even if they, I mean, it's, they turn everything into a game."}, {"time": 7222, "text": "So they let's see if we can make the world."}, {"time": 7226, "text": "Let's see if we can make a trend that Bill Gates is a pedophile, right?"}, {"time": 7230, "text": "They make it into a game."}, {"time": 7231, "text": "They get excited about this game."}, {"time": 7233, "text": "They see the powerful."}, {"time": 7234, "text": "Let's see if we can convince that, like, who is the most positive person we can think of."}, {"time": 7239, "text": "Let's see if we can turn them into evil."}, {"time": 7241, "text": "And they've tried that with like everybody and it seems to stick and they're good at it."}, {"time": 7247, "text": "And some would argue, whatever you think about our current president, that he has some elements of that, which is he's figured out whatever this music of social discourse that's going on, he's figured out how to always troll the mainstream flow of consciousness."}, {"time": 7267, "text": "That's the media."}, {"time": 7269, "text": "He always kind of says stuff that annoys a very large number of people."}, {"time": 7273, "text": "And he enjoys that because it's like taking the powerful, taking the way things were before."}, {"time": 7279, "text": "And he like shakes it up by saying the most inappropriate thing, almost on purpose or instinctually and so on."}, {"time": 7285, "text": "The problem I have with that is that doesn't, the powerful thing there is it brings those in power down a notch."}, {"time": 7298, "text": "That's a great thing."}, {"time": 7298, "text": "The negative thing is it doesn't push us closer to a nuanced, careful, rigorous discourse towards truth."}, {"time": 7307, "text": "It's like showing up to a party and just like starting to yell."}, {"time": 7311, "text": "It doesn't create a good conversation."}, {"time": 7314, "text": "It just makes everything into a game where truth doesn't even seem like a thing we can even hope to achieve."}, {"time": 7322, "text": "And I guess, as you mentioned, we'll come back to another movie because I don't do books and do movies."}, {"time": 7325, "text": "Some people just want to watch the world burn, right?"}, {"time": 7327, "text": "And I guess there's, that's a creepy, creepy kind of urge that some people have."}, {"time": 7333, "text": "And then also is some people you're like, hey, would you like to throw a brick through that glass window?"}, {"time": 7337, "text": "You're like, yeah, sure."}, {"time": 7339, "text": "Like, no, I'm not going to do that because I think about what's going to occur."}, {"time": 7343, "text": "Like something's going to be hurt, someone's property not going to do it versus, hey, you want to see what will happen?"}, {"time": 7347, "text": "Like, yeah, sure."}, {"time": 7348, "text": "Kids are always like, I have my son, he grabs Spider Man and drops him on the table."}, {"time": 7353, "text": "Spider Man fell."}, {"time": 7354, "text": "Spider Man didn't fall, Sean."}, {"time": 7355, "text": "Like, he dropped him, you knocked him off the table and he'll grin."}, {"time": 7359, "text": "And basically, it's an interesting thing, like you said, that these people are appealing to and also almost like the little dog factor of like people do want to watch the powerful get taken down a notch for all the good and the not good of that."}, {"time": 7375, "text": "Just plenty of people, it seems to me, that have found their way to incredibly high positions."}, {"time": 7379, "text": "Some have just found themselves there and many, many, many, many, many people, men and women of all backgrounds are brilliant and have worked hard."}, {"time": 7388, "text": "And yeah, of course, there's luck and there's luck into everything."}, {"time": 7391, "text": "LeBron James, in spite of being the best basketball player on God's green earth, is fortunate that he didn't get hit by a car."}, {"time": 7397, "text": "It's fortunate he didn't tear his knee, but thankfully, we get to see all these things."}, {"time": 7402, "text": "But I guess if people don't have any skin in the game, you never know what they're going to do."}, {"time": 7411, "text": "And I think that's the problem with the internet."}, {"time": 7413, "text": "You know, that people get to be nameless, be faceless."}, {"time": 7416, "text": "That's why guerrilla fighters are outside of the bounds of war."}, {"time": 7419, "text": "Like you don't have a uniform on."}, {"time": 7420, "text": "Like, I don't know who you're from."}, {"time": 7422, "text": "You don't get the same treatment that a soldier gets for MP."}, {"time": 7426, "text": "Well, that's crazy."}, {"time": 7427, "text": "Actually, there's reasons for this, because otherwise people are able to assail things and there's no one responsible."}, {"time": 7435, "text": "There's no way to go and say, hey, where did this come from?"}, {"time": 7437, "text": "What's the root of this?"}, {"time": 7438, "text": "How can I address this?"}, {"time": 7439, "text": "And I think that's the problem of the internet, the problem of Twitter."}, {"time": 7441, "text": "There's a problem in places like 4chan."}, {"time": 7443, "text": "I wouldn't mind seeing that type of stuff go away, if I'm frank."}, {"time": 7446, "text": "But that's not the same thing as people with a face, people who are willing to stand there and say, hi, my name is so and so."}, {"time": 7453, "text": "Even if I have ridiculous beliefs, hopefully people will hear me out."}, {"time": 7456, "text": "And then if I'm wrong, educate me."}, {"time": 7458, "text": "But I guess you hope that the real, I guess, in my mind, antidote to all of this silliness is education."}, {"time": 7465, "text": "And I think that that's something that we're critical thinking is not necessarily."}, {"time": 7470, "text": "I went to school in America, and I feel very fortunate."}, {"time": 7473, "text": "But critical thinking is not something that's focused on."}, {"time": 7476, "text": "I mean, it's tough."}, {"time": 7477, "text": "It's almost like talking about jujitsu."}, {"time": 7479, "text": "It's tough to teach critical thinking when I don't know any words."}, {"time": 7481, "text": "You have to teach me techniques."}, {"time": 7482, "text": "You can't teach me to be an artist."}, {"time": 7484, "text": "But recognize that the techniques are the beginning, not the end."}, {"time": 7487, "text": "Ultimately, it's the artistry that we are searching for, not just the science or the biro memorization."}, {"time": 7493, "text": "And I guess you'd hope that people's ability to think critically and recognize that majority rule or whoever's loudest does not mean that they're right by any stretch of the imagination."}, {"time": 7501, "text": "And we don't appeal to that."}, {"time": 7502, "text": "And we don't bow to that."}, {"time": 7504, "text": "We'll help them to help inoculate them against the ridiculous things that come out of these places, these dark places that are objectively not great."}, {"time": 7512, "text": "But I guess all circling back, even if we swatted these bad things out of existence right now, we've got to be very, very careful doing that because it's who's doing the swatting."}, {"time": 7525, "text": "This political group that's in power right now, the people that support our current president would maybe feel a certain way."}, {"time": 7530, "text": "The people that support another option would feel differently as to what exactly defines toxic."}, {"time": 7534, "text": "And I guess that's what gives me pause."}, {"time": 7539, "text": "But also the grace thing."}, {"time": 7541, "text": "I tend to believe that the technology, you said education, but the platforms we use like Twitter and Reddit and all these platforms have a role to play to teach us grace."}, {"time": 7554, "text": "Meaning they should help us incentivize the kind of behavior that is incentivized in real life."}, {"time": 7563, "text": "Like being a dick in real life is not incentivized."}, {"time": 7567, "text": "Like one on one interaction."}, {"time": 7569, "text": "Like there's cases where it is, but usually being kind to each other is incentivized."}, {"time": 7575, "text": "On the internet, it's not."}, {"time": 7576, "text": "Like you get likes for mocking people in a funny, in a humorous way."}, {"time": 7582, "text": "And it can be dark kind of mocking, depending on the community."}, {"time": 7584, "text": "You can go to the appearance."}, {"time": 7587, "text": "If somebody is a little fat or a little too skinny, you can comment on their appearance, the hair, the way the hair looks, like the appearance stuff."}, {"time": 7596, "text": "It could be on the people comment all the time on the level of eloquence of my speech."}, {"time": 7604, "text": "Go fuck yourself."}, {"time": 7606, "text": "It's creepy though watching previously, like this used to be low brow though."}, {"time": 7610, "text": "Like people doing this type of stuff, it's creepy watching like our political figures get into this type of game."}, {"time": 7616, "text": "But again, it's a little bit refreshing, right?"}, {"time": 7620, "text": "It's the, my hope with Donald Trump was, is that he would shake up the people who wear suits."}, {"time": 7629, "text": "Usually the, like if you're from DC, I remember like showing up, I actually didn't wear what I usually wear in DC cause I was like, everybody's wearing a suit and tie when I was like giving talks and stuff."}, {"time": 7642, "text": "Except for Mudge, who wears jeans and a t shirt."}, {"time": 7644, "text": "Mudge doesn't give a damn."}, {"time": 7645, "text": "Mudge is a forever renegade."}, {"time": 7648, "text": "But I don't even remember what, oh yeah."}, {"time": 7654, "text": "So my hope with Trump was that he would shake up that system to say like, to inject new ideas, to inject new energy."}, {"time": 7663, "text": "Of course, the way it turned out is different, but like there's, it turns out that you might want to have somebody who's like an Andrew Yang type character who is full of ideas that are very different and inject the energy, new energy into the system through youthful new ideas versus through the troll that like, that's very good at sort of mocking and like playing outside the rules of the game."}, {"time": 7692, "text": "But Trump did reveal powerfully, I don't know what to think of it, that it's just a game and you don't have to play by the rules."}, {"time": 7702, "text": "That's both inspiring and dark."}, {"time": 7705, "text": "Deeply depressing, right?"}, {"time": 7706, "text": "Yeah, and I don't know what to do with it."}, {"time": 7708, "text": "I don't, I mean the same, I'm not drawing parallels, not drawing parallels between our president and Adolf Hitler, but it's certainly, and there's a lot of, in history, a lot of positive and a lot of negative things happen when charismatic leaders realize they don't have to play by the rules."}, {"time": 7729, "text": "You can just flip the table."}, {"time": 7730, "text": "It's that Kevin Spacey show."}, {"time": 7735, "text": "House of Cards."}, {"time": 7735, "text": "House of Cards, where you just flip the table or whatever."}, {"time": 7738, "text": "You don't have to play by the rules of the chess game."}, {"time": 7740, "text": "You can flip the table."}, {"time": 7741, "text": "One wonders if that's always been done in private, you know?"}, {"time": 7744, "text": "I guess, because that's, I mean, even look, obviously, the United States is a republic, but we had Bush, then we had Clinton, then we had more Bush, then we had President Obama, then we were about to have another Clinton."}, {"time": 7756, "text": "That's fairly creepy."}, {"time": 7759, "text": "Even on its own."}, {"time": 7760, "text": "But now we added another, I mean, I'm sure we'll have a generation of Trumps now."}, {"time": 7766, "text": "Gee."}, {"time": 7767, "text": "I'm Russian, so I think we humans like kings still and queens."}, {"time": 7776, "text": "There's something, we're attracted to the thing we talked about, coaches."}, {"time": 7781, "text": "There's something in us that longs towards that authoritarian control."}, {"time": 7785, "text": "One of the beautiful things about America, the Second Amendment, is we also like individual freedom."}, {"time": 7793, "text": "That's one of the unique aspects at the founding of this country and still, and for me, is the beacon of hope that somehow there's the fire of freedom burns in like that Texas feel."}, {"time": 7809, "text": "That gives me hope."}, {"time": 7810, "text": "The FU energy that revolts against the power, which as we discussed, power corrupts and ultimately leads to degradation of whoever's ruling the people."}, {"time": 7825, "text": "It's interesting though."}, {"time": 7826, "text": "It seems to me, maybe I'm just, I don't know if I'm reading this properly when I see it, but it seems to me that, like you said, that flip the bird, I'm going to do me within reason."}, {"time": 7837, "text": "As long as I'm not hurting you, is idea that very much, at least in my mind, defines the American ideal or at least part of the consciousness of the United States is under attack to a certain extent."}, {"time": 7850, "text": "If only I can think to maybe a generation behind us, it's becoming more collectivist for all the good and also the not good of that."}, {"time": 7861, "text": "And it's not in terms of policy at this point, but just in terms of consciousness."}, {"time": 7868, "text": "And I wonder if that's an internet thing."}, {"time": 7870, "text": "People are more in touch with one another than they've, as far as I can tell, have ever been, or at least more than in my lifetime."}, {"time": 7876, "text": "And the rest of the world seems much closer than it did."}, {"time": 7880, "text": "Living in Virginia, California seems very far away."}, {"time": 7883, "text": "Being on the internet, it's just right there."}, {"time": 7885, "text": "I can hear about it."}, {"time": 7885, "text": "I can see it."}, {"time": 7886, "text": "I can interact with people from there."}, {"time": 7889, "text": "I remember being in Tennessee at one time and reading about events taking place in the Middle East."}, {"time": 7898, "text": "And that just seemed like a mile away."}, {"time": 7900, "text": "It seemed like an unbelievably far distance."}, {"time": 7903, "text": "And then another time when you're in DC, you just feel like, oh, you read about something happening in Paris."}, {"time": 7906, "text": "And it just feels like it's just right around the corner because DC is a seat of power where things are just occurring all the time."}, {"time": 7912, "text": "And I guess you wonder about that's where I come back to the group decisions to not listen to this person or to cancel this."}, {"time": 7923, "text": "We all, the moral majority, shall do the following as opposed to as long as you're not hurting me and as long as you're not hurting anyone else, I have to let you do, I have to let you be on general principle."}, {"time": 7934, "text": "Even if I don't like you, I'm very free to not like you."}, {"time": 7936, "text": "I'm free to speak out against you, but I'm not, it is not within my right or, and not with it."}, {"time": 7941, "text": "And it's not, I would not be right to attempt to attack you."}, {"time": 7945, "text": "And that is an interesting thing though, when we see words being redefined or words being defined, whether it's toxicity, whether it's violence, if I think that what you're saying is your speech is by itself a violence or a precursor to violence, I'm justified in doing all sorts of things."}, {"time": 7961, "text": "And that creeps me out significantly because again, even if it ends up being pointed in a good direction initially, it's only a matter of time."}, {"time": 7969, "text": "And actually that brings me to another, yeah, I got all day."}, {"time": 7974, "text": "How much are they paying you?"}, {"time": 7977, "text": "But we about say the Frank Herbert estate, not enough frankly, let's see."}, {"time": 7982, "text": "And how many books are there in Dune?"}, {"time": 7985, "text": "That's a Jen question."}, {"time": 7987, "text": "You're also a fan of Dune?"}, {"time": 7988, "text": "I read the whole series, but not a couple of the, I read all the prequels as well with the exception of a couple."}, {"time": 7996, "text": "Is there a book one for Dune?"}, {"time": 7998, "text": "Dune would be book one."}, {"time": 8000, "text": "And even the prequels, it's still all better if you start, like I read Dune and then read the original, what is it?"}, {"time": 8007, "text": "Six."}, {"time": 8007, "text": "And then I went back and started to read some of the books."}, {"time": 8009, "text": "Just like watching Star Wars, you want to start episode four or whatever?"}, {"time": 8015, "text": "That's the move and then stop at six, call it a day, watch The Mandalorian."}, {"time": 8020, "text": "Well, I thought you're not walking back here."}, {"time": 8022, "text": "No, I like The Mandalorian."}, {"time": 8023, "text": "No, it's not The Mandalorian."}, {"time": 8024, "text": "That is what I said."}, {"time": 8027, "text": "I was told that I was heartless for not liking Baby Yoda, who I... We don't talk about a couple of the movies, not including The Mandalorian."}, {"time": 8034, "text": "The Mandalorian is fine."}, {"time": 8035, "text": "It's the more recent movies that we don't like to talk about."}, {"time": 8038, "text": "Oh, the... What's his name?"}, {"time": 8040, "text": "The goofy guy."}, {"time": 8042, "text": "Ryan."}, {"time": 8044, "text": "No, the creature, the goofy creature with the... Jar Jar?"}, {"time": 8046, "text": "Yeah, Jar Jar."}, {"time": 8047, "text": "Do you ever see the Jar Jar Binks is actually like the Dark Lord of the Sith theory?"}, {"time": 8052, "text": "That fixed the whole initial trilogy where he's goofing around and making it all the way through battles."}, {"time": 8057, "text": "And when you're like, wait a minute, he oops his way, walks over to a pool, does a triple backflip, falls in, you're like, it's just bizarre that you..."}, {"time": 8064, "text": "This is the Alex Jones theory of Star Wars."}, {"time": 8067, "text": "He's actually running everything."}, {"time": 8069, "text": "He was the one that actually was like, hey, we should vote in Chancellor Palpatine, or Senator Palpatine, right before they put Jar Jar in charge."}, {"time": 8077, "text": "First off, what did they think was gonna happen?"}, {"time": 8078, "text": "And second off, I just think that'd be great."}, {"time": 8081, "text": "You're like, oops, oh man, I guess he's the emperor now."}, {"time": 8083, "text": "That would have been great."}, {"time": 8084, "text": "But actually, to the cancel and all the other stuff, again, you'd hope that it gives pause."}, {"time": 8089, "text": "And I think about this for fighting, because a lot of times..."}, {"time": 8091, "text": "I'll use this as an example, people fight fans in UFC, they love people that run out and try to murder each other."}, {"time": 8098, "text": "And it's entertaining, and it's super entertaining."}, {"time": 8101, "text": "But Floyd Mayweather doesn't resonate with people as much."}, {"time": 8105, "text": "It's like people start..."}, {"time": 8106, "text": "I remember the time when Floyd was not as popular."}, {"time": 8107, "text": "Now people think people love Floyd because he's 50 and oh Floyd."}, {"time": 8111, "text": "And oh man, and finally he had so much success that we all can't help but recognize the man's genius and greatness."}, {"time": 8116, "text": "But prior to that, oh, he's boring, he's this, he's that."}, {"time": 8119, "text": "He fights with his circumspect, he's cautious, he's pressing."}, {"time": 8123, "text": "He's intelligent, deeply intelligent."}, {"time": 8126, "text": "And when you watch people go out and try to murder each other, you can flip a coin 100 times and you could be lucky enough to get 100 heads, but it's still a coin flip."}, {"time": 8135, "text": "And I think that that's what's going on all the time is people are getting an outcome that they want, but it wasn't a well thought out situation."}, {"time": 8142, "text": "That's why you'll win by five in a row by knockout and then lose three in a row."}, {"time": 8146, "text": "And then people will go, well, what happened to that guy?"}, {"time": 8148, "text": "He used to be so great."}, {"time": 8149, "text": "And you're like, no, he's doing what he's always been doing."}, {"time": 8151, "text": "It's just, it was getting great outcomes on a coin flip prior, and it's getting negative outcomes on a coin flip now."}, {"time": 8156, "text": "But I guess what I would say is it watches, it's interesting watching, I guess, societal beliefs become such a thing that we're almost adopting on a religious level if we're not careful."}, {"time": 8168, "text": "If when I say religious level, I mean like pan life, like this is guiding all of my choices for all the good and the bad of that."}, {"time": 8175, "text": "And this is a Dune quote is, when religion and politics travel in the same cart, the writers believe that nothing can stand in their way."}, {"time": 8181, "text": "Their movements become headlong faster and faster and faster."}, {"time": 8184, "text": "They put aside all thoughts of obstacles and forget that the precipice does not show itself to the man in the blind rush until it's too late."}, {"time": 8191, "text": "And I think that that's, again, the pause."}, {"time": 8193, "text": "We go, oh man, thank goodness we have this guy that wants to rebuild Germany."}, {"time": 8196, "text": "He'll put us back where we need to be."}, {"time": 8198, "text": "And you stop questioning your own judgment, your own, you stop thinking essentially."}, {"time": 8205, "text": "I'm not allowed to question this."}, {"time": 8207, "text": "Of course this is correct."}, {"time": 8207, "text": "Of course, of course I'm right."}, {"time": 8209, "text": "I intended to do right."}, {"time": 8210, "text": "So of course my actions are correct."}, {"time": 8212, "text": "I mean, how many times have any of us intended to do something helpful and ended up doing something less?"}, {"time": 8217, "text": "And plenty of people who intend to do harm could by accident do something decent."}, {"time": 8221, "text": "And I guess it's, I'm not saying anything terribly, terribly insightful, but it's just one of those where it's hard to say in the moment."}, {"time": 8230, "text": "And that's where you hopefully caution, you would counsel some degree of caution."}, {"time": 8234, "text": "And that's what worries me with people deciding that we're all so right about this or we're all so right about that and attempting to rather than win the argument, silence the counter argument, no matter how crazy it may seem."}, {"time": 8248, "text": "Because I just think that that idea, even when it's pointed in a good direction initially, it's only a matter of time."}, {"time": 8254, "text": "You're amongst many things, a Jiu Jitsu black belt."}, {"time": 8259, "text": "One of the things that people are really curious about white belts and blue belts in Jiu Jitsu, but also people haven't tried the art is what does it take to be a Jiu Jitsu black belt?"}, {"time": 8271, "text": "I think that, you know, everyone's journey is a little bit different, but the one thing that the, it was a Calvin Coolidge quote, you know, determination, persistence is the only thing that will win in the end."}, {"time": 8283, "text": "It will always win in the end."}, {"time": 8285, "text": "Not brilliance, not toughness, not education, it's persistence."}, {"time": 8290, "text": "And I think that having the belief that no matter what happens to me, I will proceed forward and I will figure out how to make this happen, hell or high water, I think is the one thing that ties together all of the people that I've ever met that made it through whatever it was that they were going through."}, {"time": 8305, "text": "Because, you know, sometimes you can get lucky and you can have an easy time or and that luck could be you had a good situation."}, {"time": 8312, "text": "It could be, I mean, like in the obvious sense of like where you're living, where you're training, what's going on, you had a good situation, you're unbelievably athletic."}, {"time": 8319, "text": "Oh, you're going to be an astronaut, you're brilliant and an Olympic athlete, you know, like, well, that's a fantastic situation."}, {"time": 8325, "text": "You know, you won the genetic lottery and I'm sure you worked hard as well, but you also won the genetic lottery."}, {"time": 8329, "text": "It's a determination is the one thing, though, because that person could have a very easy go of it initially and then tear their knee."}, {"time": 8337, "text": "And then they're no longer the superhuman physical specimen that they were."}, {"time": 8341, "text": "The only thing that will keep them going is persistence."}, {"time": 8344, "text": "And I think that that I would just say that persistence to say I'll just put one foot in front of the other."}, {"time": 8350, "text": "And sometimes I can see the path ahead and sometimes it's beyond my vision, but I will not stop."}, {"time": 8355, "text": "I may even slow down, but I won't stop."}, {"time": 8358, "text": "And that's the only thing that I can say that I've seen tie everyone together because there's so many ways to the top of any mountain and there's so many different personalities and skills and backgrounds involved."}, {"time": 8368, "text": "But everyone, everyone carries on."}, {"time": 8371, "text": "So at the core, the foundational advice is just don't quit."}, {"time": 8375, "text": "Just keep going."}, {"time": 8376, "text": "That's the lesson of martial arts."}, {"time": 8377, "text": "I think, you know, we think it's like how to be strong or how to be how to win."}, {"time": 8382, "text": "But in reality, it's like how to persist, how to endure, because it's all of us have been beaten so many times and gotten beaten up so many times and thought about quitting."}, {"time": 8389, "text": "Have I ever thought about quitting?"}, {"time": 8391, "text": "Have I ever quit?"}, {"time": 8392, "text": "I will never, ever quit ever."}, {"time": 8395, "text": "I can say that you might not me out."}, {"time": 8396, "text": "I won't be damned if I quit."}, {"time": 8397, "text": "What's the darkest moment?"}, {"time": 8399, "text": "Is it injury related?"}, {"time": 8400, "text": "Like, is it, uh, so like, to me, like two possibilities, I've fortunately never been seriously injured, but I think that's a dark place to be like having to be out for many months, uh, for, um, as Jen was saying, like with a head injury, especially like the uncertainty that's one."}, {"time": 8422, "text": "And then the other side is if you have big ambitions as a competitor, realizing that you're not as good, like those, those doubts were like, I kind of suck."}, {"time": 8437, "text": "How am I supposed to be a world?"}, {"time": 8439, "text": "The greatest fighter of all time."}, {"time": 8441, "text": "If I, if, if like several people in the gym are kicking my ass, those are the two things that paralyze you."}, {"time": 8448, "text": "I think that everyone's darkest moment is maybe different looking from the outside for Ryan."}, {"time": 8455, "text": "I wouldn't say that he's had injuries and he's had bad ones."}, {"time": 8458, "text": "I wouldn't say that was his darkest moment."}, {"time": 8460, "text": "I think for me, I would say some of my head injury was my darkest moment."}, {"time": 8466, "text": "And I've torn my ACL twice."}, {"time": 8468, "text": "I've torn my shoulders four times."}, {"time": 8469, "text": "I've had lots of surgeries."}, {"time": 8471, "text": "For me, the orthopedic injuries were not the most difficult."}, {"time": 8477, "text": "It was the brain injury for others that might be the case for them."}, {"time": 8513, "text": "He couldn't get fights."}, {"time": 8514, "text": "He, he was having difficulties there."}, {"time": 8517, "text": "I think that that was the hardest point for him."}, {"time": 8519, "text": "Did you, did you think like with the head injury that you might not, never be able to jujitsu again?"}, {"time": 8525, "text": "I mean, I, I, mine was very, was really bad and it was just the one hit, but I had a looping memories for seven months."}, {"time": 8533, "text": "Didn't know it because when your brain's messed up, you're not even aware that you're looping."}, {"time": 8537, "text": "And so I saw two different neurologists."}, {"time": 8541, "text": "I finally, like it took a very long time."}, {"time": 8543, "text": "I didn't know if I was going to be able to have like linear thoughts or read a book."}, {"time": 8547, "text": "I didn't know at certain points if I could listen to music again, you know, without it making my head hurt."}, {"time": 8553, "text": "And so it was almost two years before I woke up in the morning without a headache."}, {"time": 8559, "text": "Just waking up before I even start my day."}, {"time": 8561, "text": "And so that's even bigger than jujitsu."}, {"time": 8564, "text": "That's just life."}, {"time": 8565, "text": "That's just, that's just hard."}, {"time": 8566, "text": "And I think that you can experience so many things."}, {"time": 8570, "text": "I've had all these injuries."}, {"time": 8573, "text": "We lost a baby when I was 15, 15 weeks."}, {"time": 8576, "text": "And we've had all these experiences and what the hardest point for me, not saying all those things weren't hard, but it's kind of like, well, did you go through these?"}, {"time": 8585, "text": "You just realize like life goes on and you have to keep working at it and you have to keep going."}, {"time": 8589, "text": "And you asked me earlier offline, did I feel depressed and not for my head injury."}, {"time": 8596, "text": "I don't think that at least in the moment I had a, any recognition of that."}, {"time": 8600, "text": "It's kind of like, but I think different people's personalities."}, {"time": 8604, "text": "I have kind of the like buckle down and just keep going."}, {"time": 8607, "text": "And sometimes it's not until lots of time later that you realize, wow, that was really hard because you're just struggling to live and function and do the things that you need to do along the way."}, {"time": 8617, "text": "Do you mind jumping on just like this part of the conversation just for a few minutes?"}, {"time": 8622, "text": "Do you mind, you know, just sitting together?"}, {"time": 8625, "text": "Oh, not at all."}, {"time": 8626, "text": "Just for a little bit, it'd be cool if we put a face to it, you know, is it okay with you?"}, {"time": 8633, "text": "Yeah, it's fine with me."}, {"time": 8634, "text": "It's fine with you."}, {"time": 8636, "text": "By the way, what was the head injury?"}, {"time": 8638, "text": "If you don't mind sharing."}, {"time": 8639, "text": "Someone had dropped their knee on the back of my head during training."}, {"time": 8642, "text": "It was a lot bigger than me."}, {"time": 8644, "text": "So one strike to the back of the head is too much for someone."}, {"time": 8649, "text": "There's a reason that's outlawed in MMA, right?"}, {"time": 8651, "text": "Someone 50 pounds heavier than you dropped their knee on the back of your head once."}, {"time": 8654, "text": "And it's the funny thing about getting hit, right?"}, {"time": 8656, "text": "You never can really be sure what's going to happen."}, {"time": 8659, "text": "I think it's actually one of the magical parts about jiu jitsu where, like, if you choke me, if we know what's going to occur, you hit someone, they might be completely unharmed."}, {"time": 8669, "text": "You might be punching Tony Ferguson in the face and you need to hit him with a sledge hammer to affect this man."}, {"time": 8674, "text": "And then other people, they could get really badly hurt, which I guess it's back to your point about street fighting and things like that and serious, serious potential, second, third order consequences of any action that we take."}, {"time": 8685, "text": "But yeah, that's a tricky thing about getting hit."}, {"time": 8688, "text": "How does it make you feel that, like the really shitty thing about injuries to me was that like you start thinking like, well, if I did this one little thing different, like this wouldn't have happened today."}, {"time": 8701, "text": "Like one moment changes your entire life."}, {"time": 8705, "text": "Is that, do you think that way or is that totally counterproductive?"}, {"time": 8709, "text": "You can't help but think that way when you've had the amount of injuries I've had, because I've had more than most people's fair share."}, {"time": 8718, "text": "As my orthopedic says, you don't want to win that."}, {"time": 8720, "text": "You don't want to win the contest of who's had the most."}, {"time": 8723, "text": "But since you have, you're building me a pool."}, {"time": 8725, "text": "Yeah, but I think you can't help but think that way sometimes, but I definitely don't think it's, I think it can be facilitated if you don't beat yourself up too much."}, {"time": 8734, "text": "Because thinking about why have I been subject to so many injuries and a lot of it comes to just almost all of mine in particular are people a lot heavier than me."}, {"time": 8747, "text": "But if I've been training martial arts 15 years, I'm obviously on the much smaller side."}, {"time": 8751, "text": "I'm a woman."}, {"time": 8752, "text": "I've done thousands and thousands of rounds with people 50 pounds plus heavier than me."}, {"time": 8757, "text": "I've been years not training with anyone less than 50 pounds, which is 50 pounds is almost half my body weight."}, {"time": 8762, "text": "And when you also add testosterone, the natural physiological advantages of men, not just are they heavier with more mass, they're faster, they're more explosive, they're stronger if they're the same size."}, {"time": 8773, "text": "And so I think that the willingness to be in that environment over and over and over again creates a lot of strength, resiliency, willingness to continue."}, {"time": 8783, "text": "But it also like in order to do that, you almost have to, for me, the way I was approaching it was like pretend like I wasn't more vulnerable and just be willing to step in and step in and step in until you make it kind of thing until you make it kind of."}, {"time": 8800, "text": "Yeah, like I'll just one day I'll be strong enough."}, {"time": 8803, "text": "And you avoided injury for most, for most of those rounds, I would enjoy the problem as Ryan points out is that like you could do thousands of rounds, but if one person that size, that strength, that hover reacts in a way that you don't expect, it doesn't it's not like an oops, it's like always major."}, {"time": 8819, "text": "Do you regret any of it?"}, {"time": 8822, "text": "I think that most no one I know has experienced the degree of injuries that I've experienced."}, {"time": 8827, "text": "And I started just at a time when 2005 is very different than now where you have the coaches have more control over what you're doing."}, {"time": 8835, "text": "They're more aware in general about a lot of the injuries."}, {"time": 8839, "text": "There's a lot more people who are hobbyists than when I started."}, {"time": 8845, "text": "They were hobbyists, but it was different kind of hobbyists, you know, than now."}, {"time": 8849, "text": "Now, our girls can train with other girls."}, {"time": 8852, "text": "They don't have to do thousands of rounds with somebody significantly more powerful than them."}, {"time": 8857, "text": "And for the drawbacks and the benefits of that, you know, as with anything."}, {"time": 8863, "text": "So I think I think that I don't think I would go back and change it."}, {"time": 8869, "text": "There were times after one of my injuries where I said to Ryan, I said, I quit, I'm done."}, {"time": 8875, "text": "I'm not doing this anymore."}, {"time": 8876, "text": "I probably said it more than once, but there was one time I was really serious in 2012."}, {"time": 8881, "text": "I was really serious."}, {"time": 8883, "text": "I tore my shoulder."}, {"time": 8884, "text": "I had I was looking at missing a big competition again in the world for my second or third year in a row after injuries."}, {"time": 8889, "text": "And I said, I'd quit my job two years before."}, {"time": 8892, "text": "And I'm like, I'm done."}, {"time": 8894, "text": "And Ryan, before that had always been, you know, keep me focused."}, {"time": 8899, "text": "And then he kind of said, OK, if you want to be done, be done."}, {"time": 8901, "text": "Just just have a good time."}, {"time": 8903, "text": "No, I'm really done."}, {"time": 8905, "text": "I don't want to train anymore."}, {"time": 8907, "text": "OK, OK. And then, you know, I think he helped facilitate a moment for me to go visit a friend, some friends, some girls that were doing a girls camp who are close to my size or some friends of mine to go train."}, {"time": 8919, "text": "And I was like, oh, wait, I do love this thing."}, {"time": 8922, "text": "It's harder for me on a daily basis, but that doesn't mean I don't love this thing."}, {"time": 8926, "text": "And it really helped change my mind."}, {"time": 8927, "text": "I started to connect with other people, travel more myself because previously he had done that, but I hadn't really done that."}, {"time": 8934, "text": "I think there was a point where when I started YouTube, it was just for fun."}, {"time": 8938, "text": "I just wanted to sport after college."}, {"time": 8940, "text": "I played sports as a kid."}, {"time": 8941, "text": "I want to just want to exercise."}, {"time": 8943, "text": "I wasn't into the martial arts."}, {"time": 8944, "text": "He used to give me a hard time about it because he was always very, how can you not care about martial arts?"}, {"time": 8948, "text": "I just want to play sports."}, {"time": 8951, "text": "And Ryan was really big into kind of the philosophy side of the martial arts aspect."}, {"time": 8956, "text": "He used to give me a hard time."}, {"time": 8957, "text": "And I think after that moment, this moment where I looked at myself and I said, do I want to keep doing this, is when I started to appreciate jiu jitsu."}, {"time": 8964, "text": "It took off some of the pressure I'd been feeling, I think, as Ryan's girlfriend."}, {"time": 8968, "text": "But I had a full time job a long time."}, {"time": 8969, "text": "It was never my goal to be a jiu jitsu world champion."}, {"time": 8973, "text": "And I think after that moment where I was like, you know, I really do like this."}, {"time": 8977, "text": "I really do want to do this."}, {"time": 8978, "text": "I had this moment like any time where you're like, I'm doing this for me."}, {"time": 8981, "text": "I'm not doing this for him."}, {"time": 8982, "text": "And I think that that was really lucky for me because how often in our lives, do we have a kind of a challenge where we have to stop and we have to say, is this really what I want?"}, {"time": 8995, "text": "How often in a relationship do you do that?"}, {"time": 8997, "text": "How often in any type of lifestyle or job do you stop and do you really ask yourself, is something really difficult happened that you look and you go, am I just doing this because it's convenient and easy?"}, {"time": 9008, "text": "Or is this what I really want to do?"}, {"time": 9009, "text": "Yeah, I've had those moments."}, {"time": 9011, "text": "Like this podcast is one of those things."}, {"time": 9013, "text": "It's like you stop and think like, I actually love this."}, {"time": 9020, "text": "And it's, I had that with jiu jitsu too."}, {"time": 9023, "text": "I don't think I had said until like brown belt that I stop."}, {"time": 9028, "text": "I mean, yeah, it's when you first face real challenges, you think like, why am I doing this?"}, {"time": 9034, "text": "I think most of my progression was why not?"}, {"time": 9038, "text": "I think that's the right, the leap of faith."}, {"time": 9040, "text": "And then at a certain point you think like, why am I doing this?"}, {"time": 9045, "text": "And if you can answer, honestly, that because I love it, it's kind of a liberating feeling."}, {"time": 9050, "text": "It's a, yeah, it's so powerful."}, {"time": 9053, "text": "It's an acceptance."}, {"time": 9054, "text": "Then you feel thankful for the opportunity to be there, right?"}, {"time": 9057, "text": "Because you love it."}, {"time": 9058, "text": "And you go, man, this is great gratitude."}, {"time": 9060, "text": "Yeah, it's ultimately gratitude."}, {"time": 9064, "text": "So Ryan said like, what is it?"}, {"time": 9066, "text": "I took over your thing."}, {"time": 9067, "text": "Yeah, nobody cares about Ryan."}, {"time": 9070, "text": "I wouldn't do that."}, {"time": 9071, "text": "I'll Photoshop him out or whatever."}, {"time": 9073, "text": "However you do that, it'd be great."}, {"time": 9074, "text": "Put Sean Connery's head."}, {"time": 9077, "text": "Just like a Dune ad over there."}, {"time": 9081, "text": "Sean Connery, I could get down on that."}, {"time": 9083, "text": "Is that the sexiest man in Sean Connery?"}, {"time": 9086, "text": "In the Dune universe?"}, {"time": 9087, "text": "That's my understanding."}, {"time": 9088, "text": "I think in any universe."}, {"time": 9091, "text": "Well, Myron Gosling, give him."}, {"time": 9092, "text": "We actually named our son after Sean Connery."}, {"time": 9099, "text": "He was in The Rock."}, {"time": 9100, "text": "That was, I love all those lame."}, {"time": 9102, "text": "Nicolas Cage."}, {"time": 9104, "text": "Connery is probably the greatest movie of all time."}, {"time": 9106, "text": "Dude, his accent in Connery was so awesome."}, {"time": 9109, "text": "I don't know where it's from."}, {"time": 9110, "text": "Alabama, I guess, or something."}, {"time": 9111, "text": "I love that they got like Steve Buscemi in there."}, {"time": 9113, "text": "Like we need Steve Buscemi in this thing."}, {"time": 9114, "text": "We got him."}, {"time": 9115, "text": "Dave Chappelle."}, {"time": 9117, "text": "He's a prisoner in there."}, {"time": 9118, "text": "Eight ball."}, {"time": 9121, "text": "Greatest movie of all time."}, {"time": 9122, "text": "Should have won an Oscar."}, {"time": 9123, "text": "Dave Chappelle also in Blue Street with Martin Lawrence."}, {"time": 9126, "text": "And then, what do you call it?"}, {"time": 9128, "text": "Robin Hood Men in Tights."}, {"time": 9129, "text": "Oh, Robin Hood Men in Tights was one of my favorites as a kid."}, {"time": 9131, "text": "Half baked."}, {"time": 9131, "text": "But yeah, that's a good."}, {"time": 9136, "text": "We just listed off some really bad 90s movies, but."}, {"time": 9139, "text": "You take that back."}, {"time": 9140, "text": "For telling our age."}, {"time": 9143, "text": "Speak yourself."}, {"time": 9144, "text": "So what, like in your view, I don't mean to, from like a smaller person, I guess."}, {"time": 9150, "text": "That's an interesting thing about Jiu Jitsu is like that small."}, {"time": 9154, "text": "I don't, I hope, hopefully it's not a bad thing."}, {"time": 9158, "text": "Elf."}, {"time": 9160, "text": "Elves are taller."}, {"time": 9161, "text": "Like with all these like bigger people, you could still enjoy the art."}, {"time": 9167, "text": "Like what does it take to get a black belt to excel, to quote unquote, master the art?"}, {"time": 9174, "text": "Gosh, everyone has such a different path."}, {"time": 9175, "text": "Ryan's promoted six, seven people."}, {"time": 9179, "text": "And I think about half of them have had kids, have families, have other careers."}, {"time": 9188, "text": "At the time, some of them competed a lot."}, {"time": 9190, "text": "Some of them have never competed or rarely competed."}, {"time": 9193, "text": "Some haven't competed in a long time."}, {"time": 9195, "text": "Some had started different places."}, {"time": 9197, "text": "Everyone's had different journeys, even in our own little group of seven."}, {"time": 9202, "text": "I think only maybe only two or three were high level competitors of that group."}, {"time": 9208, "text": "At the higher belts, right, like brown, black, maybe."}, {"time": 9212, "text": "And so it's just different for every person."}, {"time": 9215, "text": "And that's something that we try to tell our students."}, {"time": 9217, "text": "We have 400 students."}, {"time": 9219, "text": "And do we have this?"}, {"time": 9221, "text": "We don't really have anyone who's a stated other than like the coaches like Adam, but we don't have anyone who's like a stated high level competitor as a student at the moment."}, {"time": 9231, "text": "People look at our gym and go, it's lots of competitors."}, {"time": 9233, "text": "It's not lots of competitors."}, {"time": 9234, "text": "It's never been lots of competitors."}, {"time": 9237, "text": "And we've had ones and twos here and there."}, {"time": 9240, "text": "But really everybody's in it for the long term if they're in it."}, {"time": 9243, "text": "Sometimes the high level competitors are the ones that are more likely to drop off because they have a bit of success, particularly at blue or purple."}, {"time": 9250, "text": "And then they realize how hard it is at brown and black."}, {"time": 9253, "text": "And then they have a hard time continuing on that path."}, {"time": 9256, "text": "And then they can't look at themselves as a noncompetitor."}, {"time": 9258, "text": "They have a hard time continuing with Jiu Jitsu, I think."}, {"time": 9261, "text": "Whereas sometimes it's the guy who comes in as a white belt and he trains twice a week, twice a week, every week."}, {"time": 9267, "text": "And the next thing you know, he's been there for two or three years."}, {"time": 9269, "text": "Like, oh, he's a blue belt."}, {"time": 9270, "text": "He's a purple belt."}, {"time": 9271, "text": "He's a brown belt."}, {"time": 9272, "text": "And he's just consistent over a long period of time and willing to take the path."}, {"time": 9277, "text": "And no two people's path is exactly the same."}, {"time": 9280, "text": "No two people's lives are exactly the same."}, {"time": 9283, "text": "We have students who started as a white belt as a young adult with no responsibilities."}, {"time": 9290, "text": "And they train all the time."}, {"time": 9291, "text": "And then they have a job."}, {"time": 9293, "text": "Then they graduate college."}, {"time": 9294, "text": "Then they have a job."}, {"time": 9295, "text": "Then they have married."}, {"time": 9295, "text": "Then they have kids."}, {"time": 9296, "text": "Then they have different points in their careers and at different points in your life."}, {"time": 9299, "text": "Jiu Jitsu will be there for whatever way that you're willing to accept it."}, {"time": 9305, "text": "It's place, I think."}, {"time": 9306, "text": "Well, that's actually kind of back to the initial question we discussed about what makes a warrior and also what makes something or someone particularly impressive in my mind is like what they make out of what they have."}, {"time": 9320, "text": "One of my favorite movies ever is Forrest Gump."}, {"time": 9322, "text": "And it's obviously it's just if you can't because I've heard people go, Forrest Gump sucks."}, {"time": 9327, "text": "I'm like, I don't like you as a person."}, {"time": 9329, "text": "And you have no heart at all."}, {"time": 9332, "text": "But basically, it's the story of someone that tries hard."}, {"time": 9335, "text": "And it's like, yeah, but it's a funny movie."}, {"time": 9337, "text": "But it's like, you know, I guess you meet each person where they are, you know, and obviously you want everyone needs to be pushed."}, {"time": 9345, "text": "We all need to be pushed."}, {"time": 9346, "text": "We need friends and people around us that push us to be better versions of ourselves all the time."}, {"time": 9352, "text": "And as you mentioned, the people you spend all of your time around deeply impact you."}, {"time": 9357, "text": "And we have to be willing to be pushed."}, {"time": 9358, "text": "It takes a leap of faith for me to trust, for me to put some of myself in my, you know, I guess my ability, my control, my personal agency, as it were, in the hands of someone else that I trust and that I respect."}, {"time": 9372, "text": "But if I can do that, again, maybe I never become, you know, high level black belt competitor."}, {"time": 9378, "text": "But, you know, I had four of the things I was doing in my life."}, {"time": 9381, "text": "I also have a family."}, {"time": 9382, "text": "I have this, I have that, you know, what that person was able to accomplish in the martial arts relative to what they were able to put in this phenomenal, you know, other times someone could be a very successful black belt and in my mind be a bum because they could have been a lot more."}, {"time": 9393, "text": "And, you know, they could have done more."}, {"time": 9395, "text": "They could have focused more."}, {"time": 9397, "text": "And there's no shame in deciding that you don't want to do that."}, {"time": 9400, "text": "But whatever it is that you're invested in, I remember the Take It Uneasy podcast and that I loved because, you know, I'll just chill out like resting."}, {"time": 9410, "text": "It's like vacation."}, {"time": 9410, "text": "Oh, who wants to go on vacation?"}, {"time": 9411, "text": "Yeah, I'll go on vacation for a day or two."}, {"time": 9413, "text": "You want to spend three weeks on vacation?"}, {"time": 9414, "text": "Like, I kill myself."}, {"time": 9415, "text": "Like, get me out of here."}, {"time": 9415, "text": "Like, this is horrible."}, {"time": 9416, "text": "This is I'm a waste of life."}, {"time": 9418, "text": "I'm not doing anything useful."}, {"time": 9419, "text": "You're technically on vacation right now."}, {"time": 9421, "text": "Well, this is fun, though."}, {"time": 9422, "text": "It's like a one day vacation."}, {"time": 9424, "text": "But, you know, I'm sure you're thinking about jumping off of the building right now."}, {"time": 9428, "text": "But if you had to talk to me for, you know, like three days, I'm sure you'd probably shove me off the building."}, {"time": 9433, "text": "I don't blame you."}, {"time": 9434, "text": "I'll be dead."}, {"time": 9434, "text": "Five hours in."}, {"time": 9436, "text": "But, yeah, but, you know, it's like you want to be pushing towards something because otherwise what's the purpose of being here?"}, {"time": 9442, "text": "You know, it's not just a college."}, {"time": 9444, "text": "It's doing something useful, building, growing as a person, helping others do the same if that's within your power at any given time."}, {"time": 9451, "text": "But I think that's kind of the neat thing about martial arts is it can be many, many different things to many different people."}, {"time": 9456, "text": "You know, I finally, for instance, was able to get a college degree this year."}, {"time": 9460, "text": "That which I mean, it's not a big deal for most people, but for me it was a big deal because I was going back and finish."}, {"time": 9465, "text": "And I never envisioned ever going back."}, {"time": 9467, "text": "And that's a hard step to go back and finish."}, {"time": 9470, "text": "That's always heavy on you if you don't."}, {"time": 9474, "text": "I was just I was more proud of that than most things I've ever done, if I'm honest."}, {"time": 9477, "text": "You know, and it was neat and I really enjoyed it and it was the process of doing it."}, {"time": 9481, "text": "But, you know, are my academic credentials impressive?"}, {"time": 9484, "text": "Like, not in the least."}, {"time": 9486, "text": "But for me, it's like it was a big deal for me personally to take that step and to go back and do that."}, {"time": 9491, "text": "And I was I was proud of the the direction and because it would have been easy, like, do I need to do it?"}, {"time": 9496, "text": "Like, no, I'm in our business."}, {"time": 9497, "text": "I'll do OK."}, {"time": 9498, "text": "I'll keep fighting."}, {"time": 9499, "text": "But I was happy to take the time in between fights when I was when I was unbooked for an opponent to do something productive rather than just I'll just hang out."}, {"time": 9508, "text": "You know, like I can still train every single day, but I can also train and go to school."}, {"time": 9511, "text": "People go to the Olympics while going to school."}, {"time": 9513, "text": "I can I can do martial arts and go to school."}, {"time": 9517, "text": "One thing I got to ask is, you know, a bunch of women listen to this podcast if they haven't done Jiu Jitsu, I think it'd be kind of intimidating to step on the mat with a bunch of bros that like enjoy somehow killing each other."}, {"time": 9535, "text": "Like, how do you succeed in that environment to where you can learn this art, learn how to beat all those people up?"}, {"time": 9543, "text": "Oh, gosh."}, {"time": 9544, "text": "Is there any advice?"}, {"time": 9545, "text": "I mean, another way to ask that is like if any women listening to this are interested in starting Jiu Jitsu, like, is there advice for that journey?"}, {"time": 9554, "text": "Honestly, I think it's just walking in the door and starting."}, {"time": 9557, "text": "Sometimes I don't know how to respond to that because I'm not I don't view myself as typically anxious, particularly in interactions with other people or new people."}, {"time": 9569, "text": "Shy is not a word that has been used for me by if you ask my family and they joke because our son talks a lot."}, {"time": 9577, "text": "He's advanced verbally and they're always like, oh, well, let's we know where he gets that from because he just doesn't stop talking."}, {"time": 9582, "text": "He narrates everything he does."}, {"time": 9585, "text": "And so they always tease because that's like I'm known for for kind of talking a lot."}, {"time": 9592, "text": "But so I haven't been typically I'm not I don't consider myself a shy person."}, {"time": 9596, "text": "So for me, going into a new room, a new group of people is, you know, there's always that you don't really know who they are, how they're going to treat you."}, {"time": 9604, "text": "But I typically but I don't have a lot of anxiety with that."}, {"time": 9608, "text": "So I don't if that's something that's going to put something up."}, {"time": 9611, "text": "I don't really know how to to address that particular feeling."}, {"time": 9615, "text": "But in terms of all of the rooms I've been and I have popped into gyms before I knew Ryan in Florida, like I traveled for my job in Germany and Florida and in California and places where where I don't know anyone, they don't know me."}, {"time": 9629, "text": "And I have never once had anyone be anything other than than kind and solicitous and helpful and long before when I was a white belt and a blue belt and didn't know anything and I didn't know anyone."}, {"time": 9642, "text": "And I just think that it's a community of people that it's so cool that no matter where you go in the world, I walked into a gym in Prague one time where only two people spoke English and and it was just yes, weird, you know, it's weird that like part of a group and they're like, Oh, let me tell you what it's like to be part of a cult, right?"}, {"time": 9663, "text": "Yeah, but it's like a positive cult, like it for sure."}, {"time": 9667, "text": "That's what we would say as cultists."}, {"time": 9673, "text": "I mean, we do need to murder everybody who practice Aikido."}, {"time": 9677, "text": "Yeah, that's this cult deeply believes it."}, {"time": 9680, "text": "No, but there is a like if you look at different kinds of games like chess and so on, like there's a skepticism."}, {"time": 9687, "text": "I mean, there's not a brotherhood, sisterhood feeling with Jiu Jitsu."}, {"time": 9690, "text": "It's like you can roll into most places."}, {"time": 9692, "text": "Even like with Judo, like I can see the contrast like because I've trained in Judo places."}, {"time": 9698, "text": "It it's more like tribal, like you walk in and like, who is this?"}, {"time": 9706, "text": "Like there's that kind of feeling with Jiu Jitsu."}, {"time": 9709, "text": "There's less so there is a little bit with like the competitors."}, {"time": 9712, "text": "There's always like the competitors feeling each other out usually like the blue belts."}, {"time": 9716, "text": "But like outside of that, in terms of if you don't get the if you walk in with the vibes of just loving the art and just wanting to have a good time, you're like welcome."}, {"time": 9728, "text": "It's really fascinating."}, {"time": 9730, "text": "It's a really great thing."}, {"time": 9732, "text": "I think in as a woman, I think you you think you're walking into these rooms of these, you know, big, strong, tough guys."}, {"time": 9738, "text": "And if anything, I would I would say that they're almost like much more solicitous when a woman comes in there and not like they're just like hitting on you all the time."}, {"time": 9747, "text": "You know, it's just that you walk in and everyone is like, oh, cool."}, {"time": 9751, "text": "You want to do this thing that I love."}, {"time": 9753, "text": "Let me make sure you have a good experience and take care of you."}, {"time": 9756, "text": "And I think that's that's an experience that that I hope people have when they come into our gym."}, {"time": 9760, "text": "And and I've always felt when I walked into other gyms."}, {"time": 9763, "text": "And so, you know, we try our best to to make that comfortable."}, {"time": 9767, "text": "And it can be a little uncomfortable because there are when you walk into a male dominated environment, there's conversations and topics."}, {"time": 9775, "text": "There's a different style of camaraderie and joking that a lot of men will do that."}, {"time": 9780, "text": "Maybe some women are more uncomfortable with."}, {"time": 9782, "text": "I grew up with four brothers, so I kind of maybe was a little more desensitized to that."}, {"time": 9787, "text": "And I worked for the Department of Defense for a while, too."}, {"time": 9790, "text": "So before I do with the government."}, {"time": 9794, "text": "So so I did that."}, {"time": 9795, "text": "I'm already skeptical."}, {"time": 9800, "text": "Oh, you left."}, {"time": 9802, "text": "I'm not going to ask you about UFOs then, because you're not going to tell me the truth."}, {"time": 9805, "text": "No, they exist."}, {"time": 9809, "text": "No, you just freaked out a lot of people."}, {"time": 9811, "text": "OK, but yeah."}, {"time": 9814, "text": "By the way, where's where's your school?"}, {"time": 9815, "text": "Because people always ask like where?"}, {"time": 9818, "text": "Well, we're outside of Washington, D.C., in Northern Virginia, in Falls Church."}, {"time": 9822, "text": "You always want to pick like, what's the best school if I travel to this place or if I want to move to this place?"}, {"time": 9827, "text": "So that's well, I mean, obviously we're biased."}, {"time": 9829, "text": "But yeah, we're in the Washington, D.C. area."}, {"time": 9831, "text": "The best."}, {"time": 9832, "text": "OK, we just took a little break."}, {"time": 9834, "text": "Now we're back."}, {"time": 9835, "text": "Let me ask you one thing that a bunch of people are curious about."}, {"time": 9839, "text": "You're one of the innovators."}, {"time": 9841, "text": "First of all, you're one of the great innovators and philosophers and thinkers in Jiu Jitsu, right?"}, {"time": 9847, "text": "But you're also one of the innovators in terms of leg locks and the 50 50 position."}, {"time": 9853, "text": "And just like the fact that legs have something to do in Jiu Jitsu."}, {"time": 9857, "text": "The other popularizer innovator in the space is John Donoher and his whole group of guys."}, {"time": 9865, "text": "Do you have thoughts about their whole system of leg locks and their ideas about Jiu Jitsu and so on?"}, {"time": 9873, "text": "Sure, I guess, you know, obviously, you know, John and the students at HENZO have been able to do fantastic things competitively in the past number of years."}, {"time": 9880, "text": "And, you know, you mentioned innovators in the in that kind of, you know, section of Jiu Jitsu."}, {"time": 9887, "text": "I would be I'd love to bring up some guys like Dean Lister, of course, Masakazu Imanari."}, {"time": 9893, "text": "In fact, a lot of what was going on in like nineties Japan, like combat submission wrestling, there was some crazy gnarly stuff that it's just it's on grainy VHS tape, but like stuff that if people were doing now, they go, oh, my God, that's brand new."}, {"time": 9905, "text": "Like there's it's it's been I think these are things that have been around for a while in various places."}, {"time": 9911, "text": "I first learned the 50 50 position, just like the leg entanglement of it from Brandon Vera, actually, at a seminar at Lord Irwin's Martial Arts thing in 2005."}, {"time": 9920, "text": "He learned it from Dean Lister, who used it to submit Alexandria Kakareko, really, really tough Nogi guy at ADCC on there in the run that Dean made to the to the gold medal in the absolute division, which was a great performance at the time."}, {"time": 9933, "text": "First American to do that."}, {"time": 9935, "text": "And, you know, and I actually saw a video."}, {"time": 9938, "text": "I mean, first, a boss rootin actually broke."}, {"time": 9940, "text": "I think Guy Mezger's foot with a 50 50 heel hook that he actually grabbed his heel and his and his toes went and in pancreases back when they had like the man panties in the high, high boots on."}, {"time": 9951, "text": "And that was gnarly."}, {"time": 9952, "text": "Boss rootin is underappreciated."}, {"time": 9953, "text": "It's like it's like he double grab like and oh, yeah, like, you know, his leverage is leverage."}, {"time": 9958, "text": "It's that's like a toehold that, you know, that goes the other way."}, {"time": 9961, "text": "And it's like it either doesn't work or breaks in half."}, {"time": 9963, "text": "And well, he's is people don't often think of boss rootin as an innovator, but he is in a way like he, you know, talk about like Elon Musk and first principles thinking in terms of physics."}, {"time": 9976, "text": "He like just feels like he just gets the job."}, {"time": 9979, "text": "He figures out like the simplest way to get the job done of breaking things and establishing control and hurting people."}, {"time": 9985, "text": "Remember that was back in the day boss."}, {"time": 9987, "text": "If you listen to boss rootin do any like commentary for any of the the big MMA shows or any MMA show way back when anytime guys were clinches like the guys roll for a knee bar."}, {"time": 9994, "text": "He was saying that way back when and now people are doing it all the time with varying degrees of success."}, {"time": 9998, "text": "It's it's funny."}, {"time": 9999, "text": "It's like it's also tough to be, I think, like a breakaway thinker."}, {"time": 10003, "text": "I mean, you know, group think is a real thing and group inertia."}, {"time": 10006, "text": "And it's it's neat to see, you know, particularly at a time when maybe that type of stuff was less accepted."}, {"time": 10014, "text": "You know, someone going, hey, I'm going to I'm going to run off in this other direction."}, {"time": 10017, "text": "I think, you know, whoever, you know, the inventor of electricity in my mind is a lot more impressive than whomever not to say that the person down the line isn't impressive that comes up with an interesting way to use it."}, {"time": 10027, "text": "Both are cool."}, {"time": 10028, "text": "But when you think about just can you imagine we're sitting here like, yeah, people, I'm going to build an airplane."}, {"time": 10033, "text": "You're like, what are you talking about?"}, {"time": 10034, "text": "People don't fly."}, {"time": 10035, "text": "I'm like, no, I'm going to do it."}, {"time": 10036, "text": "And of course, it's not going to be as good as the airplane down the line, the iterative things that happen later on."}, {"time": 10041, "text": "But just being able to go to dream something into existence that you haven't seen before and then make it happen, like takes an unbelievable like strength of character, almost like a force of will, because you have you're you're blazing a trail that hasn't been washed away walked before."}, {"time": 10057, "text": "That's the BJ Penn factor in, you know, winning the Jiu Jitsu World Championship."}, {"time": 10061, "text": "First non Brazilian to do that was back in 2001."}, {"time": 10064, "text": "And then Rafael Lovato later on."}, {"time": 10066, "text": "It's like he's you know, both of those guys are so unbelievably impressive in my mind for the same reason, you know, because they were out there winning at a time when that wasn't a common thing."}, {"time": 10076, "text": "Not that it's easy to win now."}, {"time": 10077, "text": "It's just there's not a psychological hurdle that needs to be left."}, {"time": 10081, "text": "I remember, you know, when I was early in Jiu Jitsu, like Americans weren't winning the world championships at any belt."}, {"time": 10085, "text": "I mean, BJ, we all knew BJ Penn because BJ Penn did it."}, {"time": 10088, "text": "But it was really, really uncommon."}, {"time": 10090, "text": "Now it happens, you know, on a semi regular basis."}, {"time": 10092, "text": "Of course, the Brazilians are so strong."}, {"time": 10094, "text": "Europeans are still strong."}, {"time": 10095, "text": "But in Australians are coming on as well."}, {"time": 10098, "text": "But it's definitely kind of an interesting thing."}, {"time": 10100, "text": "So to come back to, you know, John Danaher and the Henzo team, obviously, they're doing fantastic things."}, {"time": 10106, "text": "John's had some really, really great innovation there."}, {"time": 10108, "text": "And the systematization and the methodology that they're using is great."}, {"time": 10113, "text": "And it's neat to see that it's getting out there."}, {"time": 10116, "text": "I would just also want, I would encourage people to make sure that they're catching up on their history because obviously, you know, John's a brilliant instructor and has done things for the sport that are fantastic that haven't been done before."}, {"time": 10128, "text": "But, you know, none of us exist in a vacuum."}, {"time": 10130, "text": "And I've learned things from everywhere else."}, {"time": 10131, "text": "So, you know, John would say the same, I'm sure."}, {"time": 10133, "text": "And, you know, Dean Lister would say the same."}, {"time": 10136, "text": "And it's just neat when you can kind of trace the history of all of this happening because we've had, humanity's had two arms and two legs for some time, at least as long as I've been alive."}, {"time": 10144, "text": "But you mentioned, like, airplanes."}, {"time": 10146, "text": "Do you think there's something totally new to be invented in Jiu Jitsu still?"}, {"time": 10149, "text": "Not totally new, but like the, you know, flying isn't new, but airplanes nevertheless made that much more efficient."}, {"time": 10157, "text": "Is there, like, new ideas to be discovered in Jiu Jitsu still?"}, {"time": 10162, "text": "I'd say, the reason I'd say yes is the same reason I would say I believe in alchemy, even though I don't."}, {"time": 10167, "text": "No, I'm serious."}, {"time": 10168, "text": "I've got some backing for this."}, {"time": 10170, "text": "You know, I guess I talk about this with a buddy of mine a lot, like, and facilitative versus not facilitative beliefs."}, {"time": 10178, "text": "And if I don't believe something is possible and I do no investigation towards it, I'll never find something even if it's there."}, {"time": 10185, "text": "It's almost like it's no different than me walking up on a group of people and going like, oh, man, look at these jerks."}, {"time": 10190, "text": "This is going to suck versus me going, oh, I wonder what these guys are up to."}, {"time": 10193, "text": "I'm about to have two very different conversations, even though the players in the game are no different."}, {"time": 10197, "text": "My internal constitution has changed because of how I've decided to approach the situation."}, {"time": 10202, "text": "So, although I wouldn't personally want to spend all my time trying to turn lead into gold because I don't believe that it's likely to work, only a person who's willing to spend his or her life in that pursuit will actually get to the bottom of that."}, {"time": 10214, "text": "And also, in the pursuit of that, they're likely to find other things."}, {"time": 10218, "text": "So, I think a lot of times the idea is that humanity is pushed forward by, you know, again, it's another Orson Scott Card one."}, {"time": 10223, "text": "It's like, you know, human beings are in this slog."}, {"time": 10225, "text": "It's paraphrasing, just in this slog over time."}, {"time": 10228, "text": "And then periodically, humanity gives birth to genius, like someone that invents the wheel, invents electricity, pushes us forward, you know, comes up with the idea of governance that doesn't, you know, just start and end with the point of a sword, you know."}, {"time": 10240, "text": "And, you know, these aren't common things."}, {"time": 10243, "text": "These are unbelievable advancements that, you know, just me sitting here, I didn't come up with them, but I just get the benefit of it."}, {"time": 10249, "text": "So, I guess what I would say is a lot of times these ideas are called crazy, you know, like as we discussed kind of offline."}, {"time": 10254, "text": "It's like, you know, Einstein was brilliant in his 20s and he was brilliant before that, I would suspect, but basically, you know, gets recognized later on in life."}, {"time": 10262, "text": "And of course, we all thought those were great ideas."}, {"time": 10265, "text": "The man was probably roundly mocked for giant chunks of his life."}, {"time": 10293, "text": "Whereas sitting there, you know, obsessing over the cult of our current knowledge, I think is the biggest, the biggest danger and the biggest cause of stagnation that exists anywhere."}, {"time": 10305, "text": "And it starts with believing the impossible, which is kind of interesting."}, {"time": 10308, "text": "One of the things that's really inspiring to me is to see people out there, which sadly are rare, who kind of have a combination of two things."}, {"time": 10320, "text": "One is they have a worldview that involves, that includes a lot of ideas that are crazy."}, {"time": 10327, "text": "And the second part is they're exceptionally focused and competent in bringing that, whatever the ideas in that worldview to reality."}, {"time": 10336, "text": "So there's certainly a lot of people with crazy ideas."}, {"time": 10338, "text": "You know, there's a lot of conspiracy theorists."}, {"time": 10340, "text": "They have way out there beliefs about things, but they're not doing much to like make the, like build stuff grounded."}, {"time": 10349, "text": "Like they're not engineers or whatever."}, {"time": 10351, "text": "They're just like espousing different crazy ideas."}, {"time": 10353, "text": "But that's why you get like the Elon Musk type characters."}, {"time": 10356, "text": "And the reason I bring him up a lot is because like, there's not many others to bring up."}, {"time": 10361, "text": "It's like, there's not many examples of it through history."}, {"time": 10364, "text": "The people, I mean, the guy's convinced that we're going to colonize Mars."}, {"time": 10369, "text": "And basically everybody on earth thinks that's insane."}, {"time": 10376, "text": "Everyone except the guy that's going to do it, right?"}, {"time": 10378, "text": "Except that's going to do it."}, {"time": 10379, "text": "And like, you can imagine like a couple of hundred years from now, people will, I mean, first of all, they won't, certainly won't remember the haters."}, {"time": 10390, "text": "They won't remember all the people."}, {"time": 10392, "text": "If they do remember them, they'll remember them in a sense like people were silly to think that this isn't the obvious path forward."}, {"time": 10400, "text": "Like from a perspective, that's what Elon talks about."}, {"time": 10404, "text": "Like it's obvious that we're going to expand throughout the universe."}, {"time": 10408, "text": "Like, so."}, {"time": 10409, "text": "From his perspective."}, {"time": 10411, "text": "Like, but to me it is also obvious because like either we destroy ourselves or we'll expand beyond earth."}, {"time": 10420, "text": "Like, there's not many, well, maybe it's not completely obvious."}, {"time": 10427, "text": "I guess I share that worldview."}, {"time": 10429, "text": "There's the other possibility that we humans find a sort of an inner peace where the forces of capitalism will calm down and we'll all just meditate and do yoga and Jiu Jitsu and like relax with this whole tech thing where we keep building new technologies."}, {"time": 10443, "text": "But it's cool to have those kinds of people that just believe the big ambitious, crazy dreams because that's where it starts."}, {"time": 10452, "text": "If you want to build something, you have to first believe that when you also have to believe strongly enough that you're not vulnerable and I'm speculating, but it's like, I can only imagine how many people have told Elon that what he's doing is crazy."}, {"time": 10464, "text": "So not only did he dream it up, he dreamed it up, went with it and also went with it in the face of being told that it's not going to work."}, {"time": 10472, "text": "And then anytime, and then also stepped away from the bitterness because he's done a series of really crazy, impressive things."}, {"time": 10477, "text": "And that's only those little things that I'm aware of, but, and also staying away from the bitterness of every single time you did something good."}, {"time": 10483, "text": "Initially, all I do is talk down about you."}, {"time": 10486, "text": "And then eventually I act as, of course, of course, I never apologize."}, {"time": 10490, "text": "And yet you don't let that dampen your spirits for the next innovation, which is pretty incredible to me to watch."}, {"time": 10495, "text": "Yeah, it's kind of cool."}, {"time": 10497, "text": "I mean, it's contagious to spend time with the guy because he's not, it's, Rogan has the same look to him, which is interesting about these people is like, there's like a hater shield that he's like, he doesn't even like sense them."}, {"time": 10515, "text": "It feels like, like it doesn't, he thinks to Elon it's like, it's obvious."}, {"time": 10522, "text": "I mean, he keeps calling it like first principles thinking, like physics says it's true."}, {"time": 10527, "text": "Therefore it's true."}, {"time": 10528, "text": "Like he's convinced himself that like his beliefs are grounded in the fundamental fabric of the way the universe works."}, {"time": 10535, "text": "Therefore the haters don't matter."}, {"time": 10537, "text": "And I mean, that's kind of like a system of thought."}, {"time": 10539, "text": "He developed himself through all the difficulties, through all the doubt."}, {"time": 10543, "text": "He's able to take huge risks with basically putting everything he owes on the line multiple times throughout his life."}, {"time": 10549, "text": "Amidst all the drama, amidst all the doubts, amidst all like the, he's still able to make just clear, clearheaded decisions."}, {"time": 10558, "text": "It's, I don't know what to make of it, but it's inspiring as hell."}, {"time": 10561, "text": "Well, it's, I think it's something that's funny."}, {"time": 10562, "text": "I think like, I can only imagine, you know, history will look back on him as a brilliant person, but that's not the only, there's, there's a lot of maybe not numeric, not statistically speaking, but a lot numerically on a giant planet of, you know, billions of people, a lot of brilliant people."}, {"time": 10576, "text": "Well, you know, time, place, luck, fortune, all that other stuff."}, {"time": 10579, "text": "But at the same time, that clearly isn't the only determining thing in making Elon Musk, Elon Musk."}, {"time": 10585, "text": "And obviously I don't know the guy from Adam and, but it's an interesting thing that it's not just his intellect, his belief system, his structure, how he's viewing the world."}, {"time": 10594, "text": "Like that's, did he, did he reason his way to that?"}, {"time": 10597, "text": "Did he not?"}, {"time": 10598, "text": "What other factors came in?"}, {"time": 10599, "text": "I'm really curious about that because I guess coming, it's, again, I feel really strongly about people's belief structure and, and this, the, how they view the world being more important than the engine behind it."}, {"time": 10612, "text": "You know, it makes someone resilient or not."}, {"time": 10614, "text": "It makes someone positive or not because you could have 10,000."}, {"time": 10617, "text": "I think about this for competitive stuff, you could have 10,000 things going properly and one thing going improperly."}, {"time": 10622, "text": "If you focus on the improper, you'll probably fix it at a certain point, which is good, facilitated for development in the longterm."}, {"time": 10628, "text": "But if you had to go and try to perform a task in the next five minutes and you're focusing on the negative, your confidence and your, your, your belief in the positive outcome of the future is likely to be damaged."}, {"time": 10638, "text": "Whereas you could have 25 things going wrong, but you go, man, I sure am happy to be alive."}, {"time": 10642, "text": "How fortunate I am."}, {"time": 10644, "text": "I can't, this is, I have problems to solve."}, {"time": 10646, "text": "Versus I had to list the problems and I start bitching about them."}, {"time": 10649, "text": "Both of them are technically accurate, but it's, I guess, different lenses."}, {"time": 10652, "text": "And I think that's a really neat thing to see, you know, someone, you know, exemplifying that for us."}, {"time": 10659, "text": "So maybe to look at the, the fighting world, there's a million questions I can ask here."}, {"time": 10665, "text": "Like one, you mentioned BJ Penn, you, uh, first of all, you're undefeated in the UFC and one of the fights you've had is against BJ Penn, which is, uh, kind of an incredible fight."}, {"time": 10677, "text": "You, you won performance of the night."}, {"time": 10679, "text": "What did it feel like to, uh, to face BJ Penn and to beat him definitively as you did?"}, {"time": 10687, "text": "Like, what's that whole experience like?"}, {"time": 10689, "text": "I'll be honest, I didn't know if I was going to ever be able to fight again after beating Gray Maynard in 2016."}, {"time": 10693, "text": "Um, you know, I've had a couple of periods of those."}, {"time": 10697, "text": "I was about to join the army actually in, uh, when I was 30 before the, uh, for the UFC before Jen sent me over to ultimate fighter."}, {"time": 10705, "text": "I didn't want to go cause I was like, one, they're never going to pick me."}, {"time": 10707, "text": "Two, I'd be terrible for TV."}, {"time": 10708, "text": "Three, I'll probably say something."}, {"time": 10709, "text": "I'm going to get burned to death in the streets."}, {"time": 10712, "text": "You know, I'm like, this isn't a great idea."}, {"time": 10714, "text": "And then, uh, she said, we'll go out there, see what happens, do it anyway."}, {"time": 10717, "text": "And you'll be, you'll regret it if you didn't."}, {"time": 10719, "text": "And then I ended up doing ultimate fighter."}, {"time": 10721, "text": "And then, so I fought three times on the show and then I fought, um, for the, for the finale."}, {"time": 10727, "text": "So there's four times in like five or six months, which was great."}, {"time": 10731, "text": "And then it took me a year to get another opponent."}, {"time": 10733, "text": "Um, and that was Gray Maynard."}, {"time": 10735, "text": "And then Gray was obviously very tough guy, um, managed to get a good outcome there."}, {"time": 10738, "text": "Then it took two years to fight BJ Penn."}, {"time": 10742, "text": "And that was, you know, obviously I'm training all the time every single day and that never stops, but that was, I'll be honest, like pretty deeply frustrating."}, {"time": 10749, "text": "Cause you know, as a, as a human being, as an athlete, you know, I think as an athlete, you die twice."}, {"time": 10753, "text": "Like you have an athletic peak or area and then, then you go on with the rest of your life, but it is a microcosm for the rest of your life."}, {"time": 10759, "text": "It's like, you're, you're seeing this, the sand tick away in the hourglass would drop away and you're going, man, this is, these are the years between 31, 32, 33."}, {"time": 10767, "text": "Like I'll be at my best at this time."}, {"time": 10769, "text": "My absolute best physically now, not technically I'm a lot better now than I was before."}, {"time": 10773, "text": "And I plan, but at a certain point you will, unless you're Bernard Hopkins, you will reach diminishing returns and I guess the long, the long way you can feel the clock ticking is frustrating."}, {"time": 10784, "text": "Why, why did it take two years for BJ?"}, {"time": 10786, "text": "I, I, I, that's the question people ask a lot."}, {"time": 10789, "text": "It's like, why does nobody want to fight Ryan?"}, {"time": 10792, "text": "I probably, they probably think they'll get infected by whatever this is, but I don't, I don't blame them."}, {"time": 10797, "text": "But I would mean you're a really tough opponent as bought as the bottom line."}, {"time": 10800, "text": "I'll say that I'm different."}, {"time": 10801, "text": "Maybe they perceive that the, the, the, the threat is greater than the reward."}, {"time": 10806, "text": "I'm hoping that now that we're ranked number 12, you know, in the UFC rankings that, that, that will change."}, {"time": 10811, "text": "And I know that if we're one more win and then we're in the top 10 that, you know, now, now we're, you're there."}, {"time": 10817, "text": "But what I've consistently found is that like randoms want to fight and I'm like, go away."}, {"time": 10821, "text": "I didn't come here for you."}, {"time": 10823, "text": "You know, cause if I wanted to just fight anybody, I could go down to a waffle house and yell until like DMX shows up and we can, we can fight."}, {"time": 10828, "text": "Cause he'll be at the waffle house too."}, {"time": 10829, "text": "Who am I kidding?"}, {"time": 10830, "text": "I really want to hang out with the MX."}, {"time": 10831, "text": "But you know, it's like, you want to, when I had the opportunity, oh my God, that was so cool."}, {"time": 10837, "text": "I was, I would never, I would never fight DMX."}, {"time": 10839, "text": "We'd be on the same team."}, {"time": 10841, "text": "But anyway it's, I guess I accepted fights against, I asked, they got asked about Lamas."}, {"time": 10848, "text": "I said, yes."}, {"time": 10849, "text": "I got asked about Dennis Bermudez."}, {"time": 10851, "text": "You know, like long periods of time."}, {"time": 10853, "text": "And they, at that time, well, you know, in between 2016 and 2018 I was struggling to have, have opponents who would sign up."}, {"time": 10861, "text": "And so I haven't turned down fights."}, {"time": 10864, "text": "I've just said, Hey, you know, keep the, I don't care about fighting the randoms."}, {"time": 10867, "text": "And it's, you have a successful school."}, {"time": 10870, "text": "You're like, you're running your martial artists broadly speaking."}, {"time": 10875, "text": "So it doesn't make sense to take fights that aren't like that fit a certain kind of trajectory for your career."}, {"time": 10882, "text": "And that's when, when BJ Penn, they said, well, BJ is looking for an opponent."}, {"time": 10885, "text": "I was like, I'm, I'm your guy."}, {"time": 10887, "text": "And, and I think that, you know, BJ accepted that fight because I'm another jujitsu guy."}, {"time": 10891, "text": "I don't think he, he, he perceived that I was much of a threat on the feet."}, {"time": 10895, "text": "And, you know, I was able to, it was neat to get it to compete against someone, you know, who's one of my heroes, one of the people I looked up to in MMA for the longest time."}, {"time": 10905, "text": "Were you intimidated by that?"}, {"time": 10907, "text": "No, no, I love competing."}, {"time": 10908, "text": "I don't really get nervous or scared before fights."}, {"time": 10911, "text": "I'm not afraid to get hurt."}, {"time": 10912, "text": "I'm not afraid to win."}, {"time": 10913, "text": "I'm not afraid to lose."}, {"time": 10914, "text": "It's, I, I'm just excited for the, I feel thankful for the opportunity to compete and the opportunity to, to play when it matters."}, {"time": 10921, "text": "You know, I, I just, that's the only time I'm interested in playing anymore is when it, when it matters, when the opposition is, I know that, you know, it's funny because people pick on, on a lot of some opponents, particularly after, after the fact, like if you, if you get a good outcome, well then, oh, of course, let's beat that guy."}, {"time": 10937, "text": "That guy wasn't that good."}, {"time": 10937, "text": "I'm like, well, I wasn't, that's after the fact."}, {"time": 10939, "text": "I get to say that."}, {"time": 10940, "text": "And also as the person in the ring, you know, BJ Penn has heard a lot of people in mixed martial arts cage and I could actually absolutely have been on that list."}, {"time": 10950, "text": "So it was neat to get to compete against someone that I really respect, someone that I looked up to for a long time, someone who has a great skillset."}, {"time": 10957, "text": "And also I went up in weight to fight him at his weight class."}, {"time": 10959, "text": "He didn't have to come down to mine, which is where he'd take it."}, {"time": 10962, "text": "It was lightweight."}, {"time": 10963, "text": "I'm generally a featherweight."}, {"time": 10964, "text": "I walk around at like 158 pounds."}, {"time": 10966, "text": "So what's the lightweight and featherweight?"}, {"time": 10969, "text": "Lightweight is 155 with the day before Wayne and featherweight is 145 with the day before Wayne."}, {"time": 10974, "text": "So I'm a little bit more properly sized for featherweight."}, {"time": 10977, "text": "But anyway, you know, I, so I didn't feel like obviously he was giving up a couple years of age, but I was giving up size and all this other stuff."}, {"time": 10986, "text": "And it was, you know, I was just excited to have the opportunity to step in against someone like BJ and you know, we managed to get out of there with a, with a good outcome without getting too banged up."}, {"time": 10996, "text": "But just, it was cool cause we tied up on the fence and just even the second, you know, is when you're rolling with somebody and you touch and you can feel what they're doing and you go, man, this guy's really good."}, {"time": 11005, "text": "You can feel the calm, you can feel the small minor adjustments that they're making, the subtle things that they're doing."}, {"time": 11010, "text": "And that was one of those things that was really neat and gratifying because you know, you never know."}, {"time": 11015, "text": "Sometimes people that you've heard of are a little bit less technically proficient than you thought."}, {"time": 11019, "text": "And other times you'll meet some guy that you're training like, who the hell is this guy?"}, {"time": 11021, "text": "How have I not heard of this person?"}, {"time": 11023, "text": "And BJ was exactly, as a jiu jitsu guy, what I would have thought."}, {"time": 11027, "text": "And another thing, that's another thing that bugged me about how people reacted after the fight is, you know, basically going, oh, BJ screwed up this, screwed up that."}, {"time": 11035, "text": "And I'm like, all right, yeah."}, {"time": 11040, "text": "That was, you know, one of the, and to me, I mean, as a fan of both, that was a beautiful moment as a, as a kind of passing of a torch in a sense of exceptional performance."}, {"time": 11053, "text": "Like another one that stands out to me, maybe you can comment, is I don't understand, well, maybe I do, why Conor McGregor gets as much hate as he does."}, {"time": 11064, "text": "He probably revels in it."}, {"time": 11066, "text": "But I think he doesn't get enough credit for Jose Aldo for the, for like, for basically, you know, knocking him out in the first few seconds of a fight."}, {"time": 11084, "text": "I mean, Jose is like one of the greatest fighters ever."}, {"time": 11089, "text": "Maybe some people can even put him in the top 10."}, {"time": 11092, "text": "And the, like, I don't understand why it's, doesn't get as much, like Conor McGregor doesn't get as much credit as I think he deserves for that and for Eddie Alvarez and all the fights, for some reason, whenever Conor McGregor beats somebody, well, they were not that good then."}, {"time": 11115, "text": "Like, it means like they were, they were, something was off."}, {"time": 11119, "text": "That's convenient, isn't it?"}, {"time": 11121, "text": "It's quite strange to me."}, {"time": 11123, "text": "But I mean, what are your thoughts on the, on Conor McGregor?"}, {"time": 11129, "text": "Maybe one way to ask that, I'm Russian, so I'm obviously also a Khabib fan, but I'm also a Conor fan, it seems like there's not many of us who are, like, fans of both."}, {"time": 11139, "text": "You and Artem Lobov."}, {"time": 11141, "text": "The two of us, which also is a good fight."}, {"time": 11145, "text": "Tough dude."}, {"time": 11145, "text": "Yeah, really, really tough dude."}, {"time": 11147, "text": "He's like five languages, really interesting kid."}, {"time": 11149, "text": "Oh, so, oh wow, I didn't know that side of it."}, {"time": 11152, "text": "There's a brain there."}, {"time": 11154, "text": "Well, on the Khabib versus Conor, what do you make of their first fight?"}, {"time": 11157, "text": "What do you, do you agree with me that they should fight again?"}, {"time": 11160, "text": "Because I think it would be awesome if they fought again in Moscow."}, {"time": 11164, "text": "And do you agree with me, I'm just going to put, say things that piss people off, but I believe is that Conor actually has a chance to beat Khabib."}, {"time": 11173, "text": "One, that Conor absolutely has a chance to beat Khabib."}, {"time": 11176, "text": "Conor has a chance to beat anyone that he steps into that ring with, and not just like a mathematical chance."}, {"time": 11179, "text": "You're like, oh, one of the billion, but like, you know, like he absolutely, it's funny because I won't pretend to know Conor really well, but I first met Conor in 2010 when I was teaching a seminar in, at Strait Blast Gym Ireland in Dublin."}, {"time": 11191, "text": "And that's actually where I first met all of the coaches that ended up being on Conor's team."}, {"time": 11197, "text": "You know, John Kavanaugh, Owen Roddy, Gunnar Nelson, you know, so for, I actually, I enjoyed being on Ultimate Fighter and being on Uriah Faber's team and getting to train with all the guys there."}, {"time": 11206, "text": "But at the same time, the people that I was actually, I knew better were actually the European side, all of Conor's coaches."}, {"time": 11212, "text": "And that was a neat thing because I got to, I met Conor, I didn't know who Conor, like Conor wasn't Conor at that point."}, {"time": 11218, "text": "Yeah, that was before his UFC debut."}, {"time": 11220, "text": "Oh yeah, well, well before, yeah."}, {"time": 11221, "text": "I think, I think he got in like 2014, maybe something like that."}, {"time": 11225, "text": "And anyway, but he was doing well in Cage Warriors, winning the titles there."}, {"time": 11228, "text": "I think prior to that, you know, I remember going, seeing him on the show and also then getting to see him train because I competed, I was initially slated to fight David Tamer for the Ultimate Fighter finale before getting put in to fight Artem for the title for the show."}, {"time": 11243, "text": "So I went over to Ireland to train for a couple of days and basically it was neat to watch him, watch him work."}, {"time": 11248, "text": "I mean, man is focused and trains a lot and very, very smart and very, very hardworking."}, {"time": 11253, "text": "And I think a lot of times people get stuck in the, in this, you know, and they almost want to believe that this was lucky or this, this person, you know, like they're not working that hard."}, {"time": 11265, "text": "They're just out there."}, {"time": 11265, "text": "They got there with their mouth and that's, that's just not the case."}, {"time": 11269, "text": "And you know, I don't know what it's like, you know, obviously Connors very well off right now and I don't know how hard, how seriously he's training, what he's doing."}, {"time": 11275, "text": "I can't speak to any of that, but there's no question that he has skills to be dangerous."}, {"time": 11279, "text": "And one of the funny things, obviously the Khabib fight when Khabib was a great fighter and also has the chance to beat anyone in that ring at any given time."}, {"time": 11287, "text": "But there's, there was a Conner, you know, it's a one that he can, he can put anybody away."}, {"time": 11296, "text": "And as you mentioned, I think that he doesn't get the credit for the Eddie Alvarez fight."}, {"time": 11299, "text": "He doesn't get the credit for the Jose Aldo fight."}, {"time": 11300, "text": "Cause it was almost so much of a letdown."}, {"time": 11302, "text": "I remember that happened the same weekend that I did the ultimate fighter finale."}, {"time": 11305, "text": "And you're like, all right, wait, what?"}, {"time": 11309, "text": "It almost doesn't feel like a fight happening, but we mentioned Miyamoto Musashi."}, {"time": 11312, "text": "I mean, Musashi was famous for the way he poked and prodded that people with what he was doing, whether overtly or not, it's like, Oh, we're supposed to fight to the death."}, {"time": 11319, "text": "And, uh, you know, at 3 PM tomorrow, great."}, {"time": 11321, "text": "4 PM rolls around, I'm just not there."}, {"time": 11323, "text": "Five."}, {"time": 11324, "text": "I mean, you remember all the, all the antics and nonsense that Conner was pulling prior to that, like speaking personally, that's not, it's not something I would feel comfortable doing, but it's like, everyone's different."}, {"time": 11332, "text": "And the effect that it had on, on Jose was, I mean, beyond evident."}, {"time": 11335, "text": "When was the last time Jose started the, started the fight with leaping left hand, leaping right hand, you're like, wait, what?"}, {"time": 11341, "text": "And then he was obviously, you know, living rent free and in Jose's head at that point."}, {"time": 11346, "text": "And that was a combination of psychological, you know, ability and, and, and wherewithal and then physical."}, {"time": 11352, "text": "And it reminded me of the way Muhammad Ali would, would bother people and whatnot."}, {"time": 11355, "text": "And, uh, the fact that he's a polarizing figure, um, I think makes some people not give him his due."}, {"time": 11362, "text": "And then at the same time, sometimes certain fans may be go overboard, but, uh, they remember the knee that Ben Askren got knocked out with by Masoudal."}, {"time": 11370, "text": "I mean, that was an amazing, unbelievable thing, but three inches to the right, three inches to the left, I guess, whichever side his head wasn't, could have been squarer."}, {"time": 11378, "text": "But, uh, and that fight starts with Ben Askren on top of you in the first five seconds."}, {"time": 11383, "text": "Well, Connor ran and threw a knee just like that at Khabib and Khabib got right around it."}, {"time": 11388, "text": "That could have easily gone the other way."}, {"time": 11390, "text": "Can you imagine what would have happened if after the, after coming back from boxing, um, after coming back from, from the Mayweather fight, Connor, in the first 10 seconds, it's Khabib in the first 10 seconds, it's over and you're like, he would, it would have been intolerable, but basically, like, you know, but see, here's the thing."}, {"time": 11408, "text": "Let me actually push back slightly."}, {"time": 11410, "text": "Uh, I mean, to the fans, correct me if I'm wrong, but Connor seems to cause I've competed a lot and like there's a tension."}, {"time": 11420, "text": "There's a negativity sometimes depending on the opponent and there's a respect afterwards that happens, like when you understand that there's a deep like respect and almost like love for each other."}, {"time": 11432, "text": "Like, I always seen that in Connor, like all the trash talk afterwards."}, {"time": 11437, "text": "There's a, it's, it's a subtle thing."}, {"time": 11439, "text": "You can't always see it, but there's a respect like."}, {"time": 11442, "text": "And like that, I almost on the Khabib side, I almost feel like Khabib really took it personally."}, {"time": 11451, "text": "He did, he didn't, he lost the respect for Connor."}, {"time": 11454, "text": "I thought, I thought the whole time Connor had the respect."}, {"time": 11456, "text": "So I, I, what I wanted to say is like, if Connor won that fight, like rock Khabib, I could see like, I wouldn't see trash talking."}, {"time": 11464, "text": "I could see like trash talking stop right there."}, {"time": 11467, "text": "I think so too, but at the same time, I'm sure you recall like Connor, Connor crossing some pretty personal territory, you know, both religiously and, and also familiarly with, uh, with Khabib."}, {"time": 11475, "text": "And it's, you know, I mean, I think it's the sort of thing that, I don't know, it's, it's an interesting, that's one of the reasons."}, {"time": 11481, "text": "Like you have to know the diff so obviously I know the, the, the Khabib, uh, the Dagestani people, they don't play around like that."}, {"time": 11489, "text": "They don't play around like that."}, {"time": 11491, "text": "You know, I mean, they take offense to basically, I mean, you, you don't do that."}, {"time": 11496, "text": "So, uh, so like Connor didn't, maybe he did it on purpose or maybe he wasn't even just aware of, of, uh, it was cultural differences of the box he opened."}, {"time": 11507, "text": "Like you, you can talk to Floyd Mayweather, you can, you can go anywhere with him."}, {"time": 11512, "text": "You can, you can say the most offensive things, but with, uh, with Khabib, it's, it's, yeah, hard lines, but you, uh, I mean, a lot of people ask, I know you're a featherweight, but if you were to, uh, face, it feels like Khabib was one of the hardest puzzles to solve in, in all of mixed martial arts."}, {"time": 11533, "text": "If you were to face Khabib, do you think, how would you go about solving that puzzle?"}, {"time": 11539, "text": "Like almost the question is almost from a Jiu Jitsu perspective too."}, {"time": 11543, "text": "What do you do with a guy that's exceptionally good at controlling position, especially on top, very good at wrestling and taking down and controlling position."}, {"time": 11552, "text": "Like let's say, so forget maybe striking on the ground."}, {"time": 11558, "text": "How do you solve that guy?"}, {"time": 11560, "text": "Like what do you do with your guard if you get taken down or do you create an entire system of not getting taken down or escaping is like, what, what ideas do you have for that?"}, {"time": 11570, "text": "Well, I guess I would say in my mind, fighting is a game of trading energy."}, {"time": 11573, "text": "Um, kind of, uh, you know, there's two, there's two things, there's damage and there's energy."}, {"time": 11578, "text": "So like when I say energy and being like, uh, tired, not tired, how much, how much gas you've got."}, {"time": 11583, "text": "Um, and then damage counts obviously as well."}, {"time": 11585, "text": "Um, you could be feeling, I could be feeling great and then you get to kick me in the head hard, really hard three times."}, {"time": 11590, "text": "It doesn't matter that I could get up and run a mile."}, {"time": 11592, "text": "I can't get up."}, {"time": 11593, "text": "So anyway, um, you know, I, I think what Khabib does is so well is he makes the fight look like it could be an amalgamated fight."}, {"time": 11600, "text": "Um, he does a great job of avoiding damage on the feet for the most part and really sucking the life out of people with how suffocating and oppressive is his control is."}, {"time": 11610, "text": "Um, his chain wrestling is as good as anyone we've ever seen in the UFC."}, {"time": 11614, "text": "Um, but, uh, that poses a really serious threat for people that need to maintain a certain amount of space and try to hurt them on the feed because unless they're able to inflict an adequate amount of damage, they're going to each time, let's say for instance, let's say him taking them down as a foregone conclusion at some point."}, {"time": 11631, "text": "Um, if every single time Khabib takes you down, you get right back up."}, {"time": 11635, "text": "It's not that big a deal, um, because it's actually more, we've all experienced this."}, {"time": 11638, "text": "Let's say you and I are rolling, you tap me 15 times in one round."}, {"time": 11641, "text": "Who's more tired?"}, {"time": 11642, "text": "Probably you are."}, {"time": 11645, "text": "My ass so badly that, that it's like, you're the only one working, but, um, So if you're comfortable with the up and down of it, like being taken down."}, {"time": 11653, "text": "If you're, if you don't, if you don't get hurt badly or tired on the bottom, you have a chance, but that doesn't involve just cracking him on the feet before he gets ahold of you."}, {"time": 11663, "text": "Um, That's a lot."}, {"time": 11665, "text": "That's a lot to ask."}, {"time": 11667, "text": "That's difficult to do."}, {"time": 11668, "text": "It seemed actually like Connor, it seemed like it when he was being kind of taken down or the, the take down attempts against Khabib, he seemed to be somewhat relaxed the whole thing."}, {"time": 11678, "text": "I thought he was doing well, actually."}, {"time": 11679, "text": "I think that particularly for the first round, I thought he did a very good job."}, {"time": 11682, "text": "It's just one of those things that I think like, uh, Khabib being the fights taking place in Khabib's world in large part."}, {"time": 11689, "text": "And I mean, set aside that one giant, uh, was it right hand that, that Khabib hit Connor with it, by the way, Connor reacted like an absolute champion."}, {"time": 11696, "text": "He got crushed by that overhand and then drop and his eyes went right back on Khabib."}, {"time": 11701, "text": "It was immediate positive, great response."}, {"time": 11703, "text": "So even though that was, I think that was a bit of a surprising thing, Connor reacted really, really well."}, {"time": 11707, "text": "But if you're going to be on bottom with Khabib for four rounds, that's going to be tough."}, {"time": 11711, "text": "And also Connor's a way better grappler than people like to give him credit for, but he's not the type of grappler that can do that can, that can, that's too tall of an order, but there are grapplers that could do that or at least would have a much, much better shot at, uh, being able to weather that type of a storm."}, {"time": 11726, "text": "Do you see yourself being able to be relaxed through that kind of storm?"}, {"time": 11730, "text": "Well, I guess I can remember being, being, being, being savagely beaten is very relaxing."}, {"time": 11739, "text": "The time that the timing of that answer was like, okay, that's a dumb question."}, {"time": 11745, "text": "No, that's ultimately the goal of Jiu Jitsu is to, um, be relaxed to the fire."}, {"time": 11752, "text": "And remember like every UFC fighter, I win all hypothetical matchups."}, {"time": 11759, "text": "Uh, since, uh, I'm one to ask ridiculous questions and we've been talking about sci fi and all that kind of stuff."}, {"time": 11767, "text": "Let me ask the kind of big question that everybody disagrees about, certainly with me is, uh, who are the top five greatest MMA fighters of all time and, um, um, why is Fedor number one?"}, {"time": 11780, "text": "Well, first off, Fedor is number one."}, {"time": 11783, "text": "Right there with you."}, {"time": 11786, "text": "Talk about people that just get completely underappreciated."}, {"time": 11787, "text": "He's never been in the, uh, like he's never succeeded in the UFC."}, {"time": 11790, "text": "It's not his fault."}, {"time": 11791, "text": "It came along after him at the time that, at the time that Fedor was at his height, the UFC was not where it was at for heavyweight fighting."}, {"time": 11798, "text": "I mean, not that there weren't good heavyweights there, but Fedor, Fedor was unbelievable."}, {"time": 11803, "text": "You remember, I mean, Minotaur Noguera, I was a massive fan of him."}, {"time": 11807, "text": "I still remember watching, uh, what is it pride 2004 when, when Noguera fought Cro Cop and got blasted with that left kick and dropped with like seconds left in the first round."}, {"time": 11816, "text": "Pride was great cause he had a 10 minute first round and that five minute second, which again materially alters, alters the fight big time."}, {"time": 11822, "text": "And you know, just the texture of the fight is just totally, it's borderline a different sport, you know, then, then getting a five, a pause and a five."}, {"time": 11829, "text": "But anyway, uh, similar sports, like one of those swimming things where they have nine gold medals for different types of swimming, right?"}, {"time": 11834, "text": "But still swimming."}, {"time": 11835, "text": "But anyway, um, Oh yeah."}, {"time": 11837, "text": "They would disagree."}, {"time": 11839, "text": "I don't mean, I'm not trying to."}, {"time": 11840, "text": "They specialize in that."}, {"time": 11842, "text": "It's so, it's totally true."}, {"time": 11843, "text": "10, 10 minutes is different than five minutes."}, {"time": 11845, "text": "Don't take, don't, don't, don't drown me swimmers."}, {"time": 11847, "text": "I don't swim very well."}, {"time": 11848, "text": "It's easy for me to, easy for me to downplay it, but anyway, um, uh, yeah."}, {"time": 11852, "text": "And then no, Better than, uh, John Jones, like the modern era."}, {"time": 11856, "text": "Well, I mean, I guess it's, it's tough to compete, to compare across eras."}, {"time": 11860, "text": "It would be like going and saying like, Oh man, how, how would such and such great grappler from today fare against someone from 1995?"}, {"time": 11867, "text": "I'm like, well, probably pretty well for them, depending upon who they are, what's going on."}, {"time": 11873, "text": "There's some people that would, their skill sets might transition across eras, but a lot of times not, but that's not fair."}, {"time": 11879, "text": "We get the, they'll be like comparing Spartans to modern day, you know, like army guys."}, {"time": 11884, "text": "You're like, well, who's going to win?"}, {"time": 11885, "text": "I'm like, well, did modern day army guys get modern day weapons?"}, {"time": 11887, "text": "Well, yeah, but who's the toughest ruggedest group of people at the very least?"}, {"time": 11891, "text": "So I guess it's, it's tough to say, but at least in my mind, the people that I think about for great fighters, their, their, their quality of opposition, um, their level of like lasting and like success, their level of lasting innovation."}, {"time": 11903, "text": "Like the courage that they have to demonstrate, because again, it's like being a big fish in a small pond takes no courage."}, {"time": 11908, "text": "Doesn't mean that there's nothing there, but it just requires something a little bit different."}, {"time": 11912, "text": "So Kazushi Sakuraba is one of my guys too."}, {"time": 11914, "text": "Um, BJ Penn also, I mean, BJ Penn fought Lyoto Machida."}, {"time": 11920, "text": "You know, it's, that was a time, it was a different sport."}, {"time": 11922, "text": "It was a different time in the sport where, you know, they were, some guys were, were bouncing around doing different things, but let's, so I guess the Gracie family, it's, I mean, they never had an in like, obviously Hoist was there, um, but they never, and that was a definitely a different sport."}, {"time": 11936, "text": "Weight classes being open, things like that."}, {"time": 11937, "text": "Yeah, but you have to say that Hoist is up there."}, {"time": 11939, "text": "Oh, no question."}, {"time": 11940, "text": "One of the greatest ever."}, {"time": 11941, "text": "I think so too."}, {"time": 11942, "text": "And again, I wouldn't be sitting here talking to you, um, if it weren't for him."}, {"time": 11946, "text": "So the Gracie family as a whole, but I mean, who's the better, I mean, I think Hoist would tell you himself probably that, that Hickson would have handled business back then, but they didn't put him in."}, {"time": 11956, "text": "So again, he's the greatest fighter, the greatest fighter, the greatest fighter that we saw do his business."}, {"time": 11960, "text": "So Hoist up there for sure."}, {"time": 11961, "text": "What about, so this is like, nobody seems to agree with me on this, but like this connects to soccer again and Messi."}, {"time": 11968, "text": "It seems that people value like how long you've been a champion, how many like defenses of the championship that you've had successfully."}, {"time": 11979, "text": "To me, I highly value singular moments of genius."}, {"time": 11983, "text": "So like, like, I, I don't, like, if you look at Conor McGregor, he hasn't, I guess, held, I've been a champion very long, very much."}, {"time": 11991, "text": "Well, he didn't defend either title, right?"}, {"time": 11993, "text": "He didn't defend any other, uh, either of the titles, but like, if you talk, and same with Messi, if you look at, uh, Lionel Messi, there's just moments of brilliance unlike any other in history for both Conor and Messi."}, {"time": 12007, "text": "And people don't seem to give credits like, well, how many world cups have you won?"}, {"time": 12011, "text": "But to me, like, why is it about this arbitrary world cup thing or championship thing?"}, {"time": 12015, "text": "I think it's easier for people to wrap their head around, right?"}, {"time": 12017, "text": "It's like the NFL combine."}, {"time": 12018, "text": "When was, I mean, yeah, numbers."}, {"time": 12020, "text": "It's something that, well, again, if I go and if I pick Tom Brady in the first round, you know, and it works out, they call me a genius."}, {"time": 12027, "text": "If I had to pick Tom Brady in the first round after his combine and it doesn't work out, I get fired and I'm never hired again, I have to work, work somewhere else."}, {"time": 12034, "text": "But it's like, I'm insulating myself from criticism."}, {"time": 12037, "text": "I think almost if I go by the numbers, well, he had more bench presses."}, {"time": 12040, "text": "It's like, how, how many times have the guys that are like the super studs in the, uh, in the NFL combine ever been on the greatest players in the NFL history, in NFL history, like zero or close to zero."}, {"time": 12052, "text": "And even if, even if there's some, it's certainly not a one to one correlation."}, {"time": 12056, "text": "So it's so funny though."}, {"time": 12057, "text": "I think it's just like, how many, how long, how many days did he hold the title?"}, {"time": 12059, "text": "Oh, your title reign was X times longer."}, {"time": 12062, "text": "That means nothing."}, {"time": 12063, "text": "So if we wanted to find greatest fighter ever, like you said, I think individual moments of like, like that was transcended, that was different."}, {"time": 12069, "text": "That was something else because people can win or lose for any number of different reasons."}, {"time": 12072, "text": "And that it's an interesting thing."}, {"time": 12074, "text": "Again, I don't blame Argentina, not winning the world cup on messy, you know, that's not fair."}, {"time": 12080, "text": "You know, how many times has, you know, I mean, I use the, I remember when a Trent Ilfer was the quarterback for the, uh, the Baltimore Ravens and they had such a strong defense."}, {"time": 12089, "text": "I'm not trying to pick on Trent Ilfer, but it's like they, they had such a strong defense that they were to make it."}, {"time": 12093, "text": "That was the Ray Lewis, you know, Chris McAllister era, you know, and they, they won, they won the super bowl."}, {"time": 12099, "text": "I don't think anyone is going to say that, you know, Trent Dilfer is a better quarterback than, you know, or put him in the same category as Dan Marino, but he got the W he's got the, he's got the super ring."}, {"time": 12112, "text": "How many times, let's use March Madness or super, I love it."}, {"time": 12114, "text": "Like that, that guy always makes the finals, but he just never gets it done."}, {"time": 12117, "text": "So let me get this straight, getting to the finals nine times doesn't count because you didn't win the end game."}, {"time": 12122, "text": "I'm not saying it wouldn't be better, but that guy won the game once he got over the hump."}, {"time": 12126, "text": "Well, how many other times was he in the finals?"}, {"time": 12130, "text": "It's interesting what we, yeah."}, {"time": 12131, "text": "We were obsessed with these numbers, like, um, well, cause we can't assess their method, right?"}, {"time": 12137, "text": "Well, I think most of the time, most of us can't assess the method of anything."}, {"time": 12139, "text": "I'm it's like, Oh, look at that guy do X Y swimming."}, {"time": 12141, "text": "I'm like, how do I know Michael Phelps is great."}, {"time": 12144, "text": "It was faster."}, {"time": 12145, "text": "I can't look at his technique and say anything other than, well, that's way better than anything I know how to do, but I can't say the difference between him and the next guy."}, {"time": 12152, "text": "So I guess that's, I wonder if it's like, I need a concrete identifier and a lot of times people don't like saying, I don't know."}, {"time": 12158, "text": "And most people won't put like a Ronda Rousey in the top, even 20 or 50 of, but like she changed more than, more than almost anybody else."}, {"time": 12167, "text": "She changed the martial arts history."}, {"time": 12172, "text": "I don't know if that even, I don't think I'm exaggerating that she, she made it okay for women to be fighters and that, and that changed the way we see like, she's one of the great feminists of our time in a weird kind of way that like, I don't know."}, {"time": 12193, "text": "Maybe I'm just a Ronda Rousey fan, but the, yeah, the, but she's not in the conversation because then you start converting into numbers."}, {"time": 12200, "text": "Well, how many did she win?"}, {"time": 12202, "text": "Is she among the greatest fighters or did she do the greatest things?"}, {"time": 12206, "text": "I don't, I think it's something, I mean, obviously Ronda is a great Sudoku who was competing in MMA at a time when a lot of the girls like, where did you get your skills in the Olympics or where'd you get yours?"}, {"time": 12215, "text": "High school."}, {"time": 12216, "text": "I mean, they're going to, the Olympic girls going to beat you up."}, {"time": 12218, "text": "But I guess that, that doesn't diminish her, just that accomplishment is what it is."}, {"time": 12223, "text": "I don't have to, I don't, Fedor is not diminished by the fact that he would like, if he were to fight Stephen Mayochis right now, it probably wouldn't go great or that John Jones exists."}, {"time": 12232, "text": "I don't now have to like knock Fedor's accomplishments down or say, oh, because BJ Penn or so and so let's say has a mixed record at this point that somehow invalidates the things that they've done before."}, {"time": 12242, "text": "I guess it kind of brings us back to a lot of the other people we've talked about, the fact that the brilliant people throughout history that we love or some of the monsters throughout history that we rightly revile in a lot of cases were complicated people and their legacy is more than just one thing."}, {"time": 12255, "text": "And someone doing something amazing doesn't invalid, doesn't mean they didn't do anything bad."}, {"time": 12259, "text": "And someone doing terrible things doesn't, doesn't mean that, doesn't invalidate the, the positives that they did."}, {"time": 12264, "text": "But I guess we fighting the urge to put people in one category and same with ourselves."}, {"time": 12269, "text": "I think that's why people get depressed."}, {"time": 12270, "text": "Oh, I'm good right now."}, {"time": 12272, "text": "Oh, I'm bad right now."}, {"time": 12273, "text": "Versus hey, we're all at work in progress and we're trying to do X number of things and legacy is a tough thing to figure out anyway."}, {"time": 12279, "text": "And it's all speculative."}, {"time": 12282, "text": "Last time or no on Reddit, you said that last time too, that you don't experience much fear before fights."}, {"time": 12290, "text": "I'd like to ask you a couple of Mike Tyson things, if it's okay."}, {"time": 12293, "text": "It's just interesting to me."}, {"time": 12294, "text": "Maybe I'm just weird."}, {"time": 12295, "text": "So there's a, I don't know if you've seen this clip of Tyson talking about how he feels leading up to a fight that he's kind of overtaken with fear, but as he gets closer and closer and closer to the ring, his confidence grows."}, {"time": 12312, "text": "Have you seen the clip?"}, {"time": 12316, "text": "I haven't seen it in a while."}, {"time": 12317, "text": "Here, let me play it for you."}, {"time": 12318, "text": "I think George St. Pierre said something similar to me one time."}, {"time": 12321, "text": "While I'm in the dressing room, five minutes before I come out, my gloves are laced up."}, {"time": 12327, "text": "I'm breaking my gloves down."}, {"time": 12328, "text": "I'm pushing the lever on the back of my leg, breaking the middle of the glove so my knuckle pierced through the lever."}, {"time": 12334, "text": "I feel my knuckle piercing against the tight leather gloves on the Everlast box."}, {"time": 12338, "text": "When I come out, I have supreme confidence, but I'm scared to death."}, {"time": 12342, "text": "I'm totally afraid."}, {"time": 12343, "text": "I'm afraid of everything."}, {"time": 12344, "text": "I'm afraid of losing."}, {"time": 12345, "text": "I'm afraid of being humiliated, but I'm just totally confident."}, {"time": 12348, "text": "The closer I get to the ring, the more confidence I get."}, {"time": 12350, "text": "The closer, the more confidence I get."}, {"time": 12354, "text": "All during my training, I've been afraid of this man."}, {"time": 12357, "text": "I thought this man might be capable of beating me."}, {"time": 12359, "text": "I've dreamed of him beating me, but I always stayed afraid of him."}, {"time": 12363, "text": "But the closer I get to the ring, I'm more confident."}, {"time": 12366, "text": "Once I'm in the ring, I'm a god."}, {"time": 12368, "text": "No one can beat me."}, {"time": 12369, "text": "I'm a god."}, {"time": 12370, "text": "I mean, first of all, he's cognizant of both his demons and whatever the hell ideas he has about violence."}, {"time": 12377, "text": "It's so interesting."}, {"time": 12378, "text": "Is there something about the tension that he's describing about being confident and scared that resonates with you?"}, {"time": 12387, "text": "Or do you hold to this idea that you've kind of spoken about before that you're really not afraid?"}, {"time": 12393, "text": "No, I can appreciate what he's saying."}, {"time": 12396, "text": "I think that I can speak to feeling concerned about, let's say, for instance, if you feel a certain way, I think people are a lot more like computers than we like to admit."}, {"time": 12408, "text": "And just because a lot of times I can't parse what's going on and why doesn't mean that it doesn't make sense."}, {"time": 12415, "text": "And I think that, at least in the times, if I'm concerned about a situation or about a person or about something happening prior to the fight, I'm like, there's a reason."}, {"time": 12425, "text": "There was a reason."}, {"time": 12426, "text": "I don't have to push that down and bury it."}, {"time": 12427, "text": "There's a reason."}, {"time": 12429, "text": "What have I not thought about?"}, {"time": 12430, "text": "What have I not done?"}, {"time": 12431, "text": "What am I missing?"}, {"time": 12432, "text": "Why am I feeling this way?"}, {"time": 12433, "text": "As you mentioned, for yourself prior, you'd be like, why am I feeling like this?"}, {"time": 12437, "text": "I don't do this very well in certain aspects of my life now that I mention it or now that I think about it."}, {"time": 12441, "text": "But when it comes to competing, I think I do an all right job and I'm trying to learn to be better."}, {"time": 12445, "text": "And it's going like, well, why do I, if I feel this way, there's a reason."}, {"time": 12450, "text": "Am I thinking about this the wrong way?"}, {"time": 12451, "text": "Have I not adequately prepared for something?"}, {"time": 12453, "text": "I have to address it and then maybe I'll be up for four hours that night, like extra hours thinking what have I not addressed, watching sparring, watching this, watching that."}, {"time": 12462, "text": "And then when I am thinking about things more accurately or when I've addressed what that concern was, I feel any of that concern kind of dissipate."}, {"time": 12473, "text": "And I guess if I honestly thought that, I guess when it comes to, I know I'm going to die at a certain point, obviously, I'm going to get hurt, pain happens."}, {"time": 12483, "text": "But the pain of loss would be nothing compared to the, or the pain of injury would be nothing compared to the pain of running away."}, {"time": 12492, "text": "And so I guess if I think about where's my value, it's like I feel like I'm a winner and every single time I step into that ring and fight with everything that I have, I can't promise that I'll win my next fight."}, {"time": 12503, "text": "I know that I have the skills and the tools to beat anyone in grappling or in mixed martial arts at this point."}, {"time": 12509, "text": "It's just, I know that for certain, I've trained with enough people, I've competed with enough people, I know where I stand."}, {"time": 12516, "text": "But I also know that I'm not perfect and also the better fighter, even if I perceived that I was that thing, doesn't win on the night."}, {"time": 12523, "text": "The man who fights better wins on the night."}, {"time": 12527, "text": "And if I give credence in my mind to only the person that's won has value versus going, what's your process?"}, {"time": 12534, "text": "What's your path through this?"}, {"time": 12536, "text": "How are you going about this?"}, {"time": 12537, "text": "How are you thinking about this?"}, {"time": 12538, "text": "How are you behaving?"}, {"time": 12539, "text": "Then if I can focus on the process, then I will respect my opponent and I will respect myself and I'll respect anyone that behaves with a certain level of consistency to that."}, {"time": 12552, "text": "And they could win, there's plenty of winners in history that are shitbags and there's plenty of losers that are not."}, {"time": 12558, "text": "But winning doesn't make you a bad or good person and losing doesn't make you good by default either or bad by default."}, {"time": 12565, "text": "And I think that that can be the truth socially, that can be the truth athletically and academically."}, {"time": 12570, "text": "So I guess... Is there a primal fear though, like a primal fear of getting hurt?"}, {"time": 12577, "text": "The running away and not facing the threat long term is the bigger pain than any pain you can experience in the fight."}, {"time": 12591, "text": "But what about the violence of, I mean, you don't have that on your face, but like, I don't know if you've also seen Tyson talk about, he was on Rogan recently and he was talking about, he was trying to psychoanalyze himself about why he enjoys violence so much."}, {"time": 12608, "text": "I mean, he called it orgasmic."}, {"time": 12610, "text": "I don't know if, have you seen that clip?"}, {"time": 12615, "text": "We're playing it because I can, I need to, because Trump also retweeted it, which is hilarious."}, {"time": 12620, "text": "I don't know how to contextualize that our president retweeted the clip of Tyson saying... Maybe he's just doing like, they're not, it's like, I'm going to throw him a curve ball."}, {"time": 12632, "text": "No one's going to have any idea what that is."}, {"time": 12633, "text": "But yeah, he did no explanation, just, here you go."}, {"time": 12637, "text": "Well, I think that's kind of like what you were describing."}, {"time": 12639, "text": "It's like, if I give you an answer, it has to be a good one."}, {"time": 12641, "text": "Better to just let your imagination run."}, {"time": 12645, "text": "He's like the Kubrick of our time."}, {"time": 12648, "text": "Now what's really interesting that sometimes, period, it's not real, but sometimes I struggle with the fact of why there's a possibility I can really hurt somebody."}, {"time": 12662, "text": "Like you don't want to hurt them."}, {"time": 12666, "text": "What do you mean when you struggle with the possibility that you could hurt them?"}, {"time": 12670, "text": "That is sometimes, it's orgasmic sometimes."}, {"time": 12677, "text": "Like some fights, like particular, like Tyrell Biggs or someone that you had problems with, someone that you, you had animosity towards."}, {"time": 12686, "text": "So when you finally get your hands on them."}, {"time": 12689, "text": "Hey, what does it mean when fighting gets you, gets you erect?"}, {"time": 12700, "text": "Means you're getting excited."}, {"time": 12702, "text": "So that, that's going through your mind right now."}, {"time": 12705, "text": "Well, that's how I get when I was a kid and I, you know, sometimes I get the twinkle."}, {"time": 12710, "text": "The twinkle."}, {"time": 12712, "text": "Well, that's what I'm saying."}, {"time": 12713, "text": "When you reached a state as a human being, as a champion, as a ferocious fighter, you reached a state of, of ability and of accomplishment that very few humans will ever, ever touch and feel."}, {"time": 12726, "text": "That's why I'm asking you when you're running, when you're hitting the bag, when that heart's beating again and that you know who you are, you're Mike motherfucking Tyson."}, {"time": 12735, "text": "So when you're doing all this shit again, you're still Mike Tyson."}, {"time": 12737, "text": "Those thoughts have got to be burning inside you again."}, {"time": 12740, "text": "It's got to be pretty wild."}, {"time": 12746, "text": "It's wild, but I believe it's rightfully so to be that way."}, {"time": 12751, "text": "And I used to know how to, I don't say I'm master, but I used to know how to deal with it."}, {"time": 12757, "text": "I don't let it overwhelm me."}, {"time": 12758, "text": "I mean, he goes on to try to, they don't ever, like Joe doesn't bite."}, {"time": 12765, "text": "The interesting thing about that conversation is Mike was trying to figure himself out."}, {"time": 12771, "text": "Like he's trying on the spot, like, why do I feel this way?"}, {"time": 12779, "text": "To me it was like, to me it's so real and honest to feel like pleasure from hurting somebody."}, {"time": 12790, "text": "Like that you rarely hear that."}, {"time": 12793, "text": "In this society, it's like, you rarely like talk about like you feel pleasure from winning."}, {"time": 12802, "text": "You feel pleasure from like the relief of overcoming like all the stress you had to go through."}, {"time": 12811, "text": "Pleasure from just like the specifics of the fight, the techniques you use, the maybe overcoming being down a couple of rounds, but like how often do you hear somebody say, I just enjoyed, he's not even saying because I hate the opponent."}, {"time": 12826, "text": "He's saying like, I enjoyed purely the violence of it."}, {"time": 12832, "text": "I mean, I don't know, it's honest."}, {"time": 12836, "text": "It made me ask, like, I wonder how many of us are cognizant of that."}, {"time": 12840, "text": "Let's say Mike is uncommonly seemingly honest."}, {"time": 12845, "text": "I think athletes make a full time job out of lying, you know, I think people make a full time job."}, {"time": 12850, "text": "To themselves perhaps too."}, {"time": 12851, "text": "I mean, in some, you tell yourself or you tell others what you feel you need to, or maybe whether you've, whether you even know what you feel you need to, but why should he not, I mean, again, did he, did he run up and just hit somebody that's didn't sign up for this?"}, {"time": 12866, "text": "No, they, they signed up to be there."}, {"time": 12868, "text": "Well, that's the interesting thing about Dyson is there's that weird, uh, like nonstandard behavior."}, {"time": 12876, "text": "I mean, like your fighting style is not standard."}, {"time": 12880, "text": "He's nonstandard to another degree of like, uh, who else has that in Jiu Jitsu, uh, uh, Polaris, uh, uh, has this kind of weirdness, like what's, what's in there?"}, {"time": 12895, "text": "Like there's a fear that I think, uh, most opponents would have because it's like, it's no longer about like, it takes you out of the realm of its game."}, {"time": 12906, "text": "It takes us back to the thing we were talking about, like before is it strips away that like several layers of Ryan Hall, the, the podcast, uh, guest, Ryan Hall, the Jiu Jitsu instructor, Ryan Hall, Jiu Jitsu competitor, it keeps going down to a point where like Ryan Hall, the murderer of all things that get in his way that lies underneath all of it."}, {"time": 12928, "text": "Seemingly like if we're like in this society, we put all that aside, but it makes you wonder like now as society is being tested in many ways, it makes you wonder like what's underneath there."}, {"time": 12939, "text": "Well, do we want, do we want the answer to that?"}, {"time": 12941, "text": "Cause I guess it's, what is it?"}, {"time": 12942, "text": "Uh, you seem Paul Fiction, you know, the best character in the movie and in the best scene in the movie is like, if my questions here, if you're, what do you call it?"}, {"time": 12949, "text": "If my answer is scary, you should cease asking scary questions, you know?"}, {"time": 12953, "text": "And I guess, uh, you wonder, I mean, all of us, that's something that I think it's funny we go, that's not okay, I mean, versus maybe not appropriate for situation X, Y, or Z."}, {"time": 12963, "text": "But uh, what should make any of us think, I mean, humanity is a different place now."}, {"time": 12967, "text": "And I mean, I'm not saying anything crazy out there, but humanity is a different place now than we were 5,000 years ago where all of us are descended from people who have killed things with their teeth and fingernails in order to be where we are."}, {"time": 12980, "text": "And whether it was in, whether it was an animal or it was in conflict with another person, I mean, think about the, the chances of dying by violence now are so, so slim, at least in most countries in most plays, like shockingly small, thankfully."}, {"time": 12992, "text": "But there was a period of time, like the most period of time where dying by violence was mostly how it went down."}, {"time": 12999, "text": "And I guess what would be facilitative, what would allow you to win back to Ender's game?"}, {"time": 13004, "text": "You know, what allows you, if you can't do that, you are all, you are forever subject to people who can, and that's, that's a real thing."}, {"time": 13014, "text": "And you know, we're fortunate to find ourselves in a situation where we don't, where other things matter."}, {"time": 13019, "text": "But that is a funny thing periodically where people, you'll see people kind of drawn at each other, like in videos or out in the world that clearly neither of them expect this to get serious."}, {"time": 13027, "text": "Like, I'm just going to yell at you."}, {"time": 13028, "text": "You're going to yell at me."}, {"time": 13029, "text": "And it's like this weird LARPing thing where we're both going to go on our own separate way."}, {"time": 13032, "text": "All it takes is one person to be like, well, I wasn't kidding."}, {"time": 13035, "text": "And it's like, well, you'll go to jail."}, {"time": 13036, "text": "And it's like, oh, I know you're going to go to the morgue."}, {"time": 13040, "text": "And it's, that's, but that can happen like that."}, {"time": 13042, "text": "Like society."}, {"time": 13043, "text": "I mean, obviously, anyway, you could jump across the table, stab me in the eye."}, {"time": 13046, "text": "I mean, I appreciate, I'd hope if you don't, and there will be consequences if you do, but not from, not from me, from, from the rest of society will potentially get you at a certain point, but you can decide to not play by the rules anytime you want."}, {"time": 13058, "text": "It's fascinating that, yeah, that's, we've created rules based on which we all behave, but underneath there, you know, there, there's things that doesn't, there's motivations and forces that don't play by the rules and still there nature is metal is under the surface."}, {"time": 13075, "text": "And again, I pull out my phone and I'm basically saying like, Hey, I'm going to, you're going to get caught."}, {"time": 13081, "text": "But really I'm further antagonizing you rightly or wrongly."}, {"time": 13084, "text": "Like, and that, that's an interesting thing."}, {"time": 13085, "text": "And I feel like just people need to remember any of us need to remember just for any reason, just that's, that's one step away at all, at all times you ever, I've had people say to me before, like, Oh, I don't feel safe."}, {"time": 13097, "text": "I'm like, you're not safe."}, {"time": 13098, "text": "I kill you before you get out of this room."}, {"time": 13100, "text": "Nothing you do to stop that."}, {"time": 13102, "text": "I mean, but don't worry."}, {"time": 13103, "text": "You can do the same to me, which means I'm like, Oh, Oh, thank goodness."}, {"time": 13106, "text": "Can you imagine like how many guns are there are in this country?"}, {"time": 13109, "text": "Like I mean, everywhere, I mean, seriously everywhere, but that's a heartening thought."}, {"time": 13113, "text": "Not the other way."}, {"time": 13114, "text": "Cause people usually freak out and go, Oh my God, gun violence, gun violence, gun violence is like really not a serious issue in the United States compared to what it could be."}, {"time": 13121, "text": "Because it means that, I mean, with the amount of guns and the amount of bullets that are out there that are in circulation, can you imagine if like one in every thousand was used in anger each day?"}, {"time": 13132, "text": "I mean, this would be a terrifying place to live."}, {"time": 13134, "text": "You couldn't go anywhere."}, {"time": 13135, "text": "So, I mean, although you could say, Hey, this is more than we'd like or X, Y, Z, it actually means that people are much more reasonable and sane than we're saying then, or then I, then sometimes I might, my might argue."}, {"time": 13146, "text": "So I guess what I mean is like, Oh man, I walked a seven 11 and I didn't get stabbed."}, {"time": 13149, "text": "I'm like, Oh, well that's good because not because I protected myself with my karate."}, {"time": 13153, "text": "It's basically no one decided to run over and stab me because I wasn't protecting myself."}, {"time": 13158, "text": "It's I, they, they stopped."}, {"time": 13159, "text": "So I guess we're all fortunate to live in a society that, that like you said, nature being metal doesn't become that big of an issue all the time."}, {"time": 13166, "text": "But it is funny when you get people in the ring and you go, Hey, let's peel back from Mr. Tyson, many layers of that and say, Hey, now it's okay."}, {"time": 13174, "text": "And it's cool that, I mean, that's what society is doing."}, {"time": 13177, "text": "So I've lived in Harvard square for awhile and we add extra layers of what safe means."}, {"time": 13184, "text": "Like now there's a disc discourse about safe spaces, about like ideas being violence or, or like, uh, you know, like, yeah, but ideas are minor slights against your personality being violence."}, {"time": 13199, "text": "And that's all like extra layers around the nature is metal thing that, uh, it's cool."}, {"time": 13205, "text": "That's what progress is."}, {"time": 13206, "text": "But we can't forget that like underneath it is still, it's still the, the thing that will murder at the, at the drop of, uh, in any, at any moment."}, {"time": 13217, "text": "If uh, if aroused one, one thing that I find funny though, or ironic maybe about the, uh, the, you know, words of violence, you know, offenses, violence thing is that of course that if that, the belief in that then justifies my violence, like my, and whether it may be in my, maybe not physical violence, but my response to my, my aggressive response to things."}, {"time": 13239, "text": "And I guess like, which it can be regrets of begets a further aggressive response and like a, you know, kind of a tit for tat sort of situation or, or it goes to like, well, there's 10 of me and there's one of you, so we'll get you and you can't do anything about it."}, {"time": 13251, "text": "But that's not morality."}, {"time": 13252, "text": "That's, that's just saying that's might makes right."}, {"time": 13255, "text": "So I guess again, you can understand why people do it and there are certain, there is a progress aspect to it."}, {"time": 13260, "text": "But again, I guess without proper examination, I'm effectively with my 10 friends, you know, and, and the force of the law, Mike Tyson and people, but not admitting to myself what I'm doing."}, {"time": 13271, "text": "And at least Mike Tyson again is honest."}, {"time": 13273, "text": "Are you, uh, afraid of death?"}, {"time": 13276, "text": "I mean, it's easy for me to say no, as I sit here, probably not about to die, but."}, {"time": 13281, "text": "Is this like the UFC question, can you defeat any opponent?"}, {"time": 13284, "text": "The answer is of course, yes."}, {"time": 13286, "text": "And uh, I don't have, they're not around, they're not here, are they?"}, {"time": 13290, "text": "But, uh, I mean, are you, uh, do you ponder your own mortality?"}, {"time": 13293, "text": "Maybe another context to that is you mentioned two deaths for martial artists."}, {"time": 13299, "text": "I think that's actually why, honestly, even though at a relatively young age, I think mortality is something that I'm aware of more, maybe more than the average person."}, {"time": 13306, "text": "I think probably most athletes can speak to this and anyone that's had trouble, I've managed to just slide out of a couple of near death experiences personally, you know, mostly river related, um, because I'm an idiot, but, um, I regret nothing, but, uh, yeah, but, uh, thank God we're here."}, {"time": 13322, "text": "But, um, yeah, it is an interest seeing, seeing the end and seeing going, well, what's going to happen."}, {"time": 13331, "text": "I guess I think it comes back to kind of what we're discussing about belief structure and belief system."}, {"time": 13335, "text": "I think a lot of times, if I recognize that no matter what I do, it's all going to end one day and then you go, well, why were we here?"}, {"time": 13343, "text": "What would I do?"}, {"time": 13344, "text": "Am I going to make it to 40?"}, {"time": 13347, "text": "I'd like to hope so that I had no idea that I was going to make it to the age that I am now."}, {"time": 13352, "text": "Um, am I going to make it to 80?"}, {"time": 13353, "text": "How much of that is in my control?"}, {"time": 13356, "text": "Much of it is not."}, {"time": 13357, "text": "I mean, it's so funny."}, {"time": 13358, "text": "It's an interesting, like back to the belief structure again, like locus of internal and external locus of control."}, {"time": 13364, "text": "You know, what's facilitative versus what's true."}, {"time": 13367, "text": "And you know, I think accepting personal responsibility for more than is on my control is, is probably a positive, but at the same time, recognizing that much of much is not in my control."}, {"time": 13377, "text": "I was fortunate enough to be born in the United States, fortunate enough to, you know, to not knock on wood, have, have a serious disease that I'm not aware of right now."}, {"time": 13386, "text": "Um, I didn't do any of that."}, {"time": 13388, "text": "I just showed up."}, {"time": 13389, "text": "That was really fortunate."}, {"time": 13391, "text": "And I guess that doesn't diminish the fact that I've tried to make decent choices, but it works in concert with it."}, {"time": 13398, "text": "And I, I guess, um, when I, when you go, is death what I want right now?"}, {"time": 13404, "text": "No, no, I should think not."}, {"time": 13406, "text": "And again, it's easier for me to be relatively calm about as I'm not staring it in the face, but what I would care a lot more about is, is how you live."}, {"time": 13415, "text": "That's what's in my control."}, {"time": 13417, "text": "And I can't control if, as I walk out of this building, a helicopter falls on me worrying about that."}, {"time": 13422, "text": "I can't control it."}, {"time": 13423, "text": "Maybe I, maybe I have cancer now and I don't know it and I really hope not."}, {"time": 13426, "text": "But um, there's something about meditating on the fact that it could end today outside of your control that can clarify your thinking about the, the fact that life is amazing, like just kind of, yeah, helping you enjoy this moment."}, {"time": 13441, "text": "Even if life was horrible, let's say for instance, it was, it was, you live at one of those times or places and this place is still exists in this world today that life is brutal and metal and whatever all and short and painful."}, {"time": 13454, "text": "Would you still want it?"}, {"time": 13455, "text": "And again, as I'm sitting here and not, not on fire physically, it's easy to say yes, but I would, I'm confident I still I'll plant my feet and say yes, any of, any life is amazing and beautiful and a gift and unbelievable gift, uh, that none of us have earned for the record."}]}]