[{"title": "Douglas Murray: Racism, Marxism, and the War on the West | Lex Fridman Podcast #296", "id": "EG7I6Bt_NZY", "quotes": [{"time": 359, "text": "To market."}, {"time": 360, "text": "And hence the imperial imperative."}, {"time": 364, "text": "To conquer, to expand."}, {"time": 366, "text": "Although that itself, of course, is a universal thing."}, {"time": 368, "text": "I mean, no civilization, I think, that we know of doesn't try to gain ground from its neighbors where it can."}, {"time": 377, "text": "The Western ability to go further faster certainly gave an advantage in that regard."}, {"time": 383, "text": "Do some civilizations get a bit more excited by that kind of idea than others?"}, {"time": 390, "text": "Because you could say it's the Western civilization because the technological innovation was more efficient at doing that kind of thing."}, {"time": 400, "text": "But maybe it wanted it more, too."}, {"time": 401, "text": "Well, the Ottomans wanted it an awful lot and did very terribly well for many centuries, and one shouldn't forget that, as did others."}, {"time": 413, "text": "I'd also say, by the way, and again, it's a very broad one, but it's worth throwing out there."}, {"time": 417, "text": "I think self criticism is an important attribute of the Western mind, one that, as you know, is not common everywhere."}, {"time": 427, "text": "Not all societies allow even their most vociferous critics to become rich."}, {"time": 433, "text": "So criticism is a negative sounding word."}, {"time": 435, "text": "It could be self introspection, self analysis, self reflection."}, {"time": 440, "text": "And it can be what you need."}, {"time": 443, "text": "And in the Western system, I'd argue that one of the advantages of the system of representative governance is that where there are problems in the system, you can attempt to sort them out by peaceable means."}, {"time": 458, "text": "We listen to arguments, most famously in America in the late 20th century, the civil rights movement achieved its aims by force of moral argument and dissuaded the rest of the country that it had been wrong."}, {"time": 471, "text": "That's not common in every society by any means."}, {"time": 475, "text": "So I think there are certain attributes of the Western mind that you could say are, they're not entirely unique, but they are not as commonplace elsewhere."}, {"time": 486, "text": "What about the emergence in hierarchies of asymmetry of power, most visible, most drastic in the form of slavery, for example?"}, {"time": 498, "text": "Well, I mean, everyone in the world is slavery, so I don't regard it as being a Western, a unique Western sin."}, {"time": 505, "text": "It's rather hard to think of a civilization in history that didn't have slavery of some kind."}, {"time": 509, "text": "One of the oddities of the Western ignorance of our day is that people seem to imagine that our societies in the West were the only ones who ever engaged in any vices."}, {"time": 519, "text": "Alas, this isn't true."}, {"time": 520, "text": "It's a sort of Rousseauian mistake, or at least one that's blossomed since Rousseau, that everybody else in the world was born into sort of Edenic innocence, and only we in the West had this sort of evil in us that caused us to do bad things to other people."}, {"time": 535, "text": "Slavery was engaged in by everyone in the ancient world, of course, and through most of the modern world as well."}, {"time": 541, "text": "Of course, there are 40 million slaves in the world today, so it's clearly not something that the species as a whole has a problem with."}, {"time": 549, "text": "And that's more slaves, of course, than there were in the 19th century."}, {"time": 554, "text": "And I'd say, on top of that, that the interesting thing about the Western mind as regards to slavery is that we were the civilization that did away with it."}, {"time": 563, "text": "And by the way, the founding fathers of America, who today are lambasted routinely for being acquiescent in the slave trade, engaging in it, owning slaves."}, {"time": 580, "text": "People almost don't even bother now to recognize the facts that Thomas Jefferson, George Washington, all wanted to see this trade done away with, couldn't hold the country together at the origins if they'd have made such an effort."}, {"time": 593, "text": "And believed and hoped that it would be something that would be dealt with after their time."}, {"time": 598, "text": "So the founding ideas had within them the notion that we should, as a people, get rid of this."}, {"time": 605, "text": "The opening lines of the Declaration of Independence set up the conditions under which slavery will be impossible."}, {"time": 614, "text": "All men are created equal."}, {"time": 616, "text": "Once you've put that, that's a time bomb under the whole concept of slavery."}, {"time": 622, "text": "That's ticking away, okay."}, {"time": 624, "text": "And sure enough, it detonated in the next century."}, {"time": 628, "text": "If we just step back and look at the human species, what does slavery teach you about human nature?"}, {"time": 636, "text": "The fact that slavery has appeared as a function of society throughout human history."}, {"time": 644, "text": "There are two possibilities."}, {"time": 647, "text": "One is it's what people think they can do when God's not watching."}, {"time": 654, "text": "Another is it's what they can do if they think that God allows it."}, {"time": 660, "text": "Really, really well put."}, {"time": 662, "text": "And the fact that they want to do this kind of subjugation, what does that mean?"}, {"time": 670, "text": "Well, I mean, it's pretty straightforward in a way."}, {"time": 674, "text": "There are people who get to work for free."}, {"time": 677, "text": "It's economic in nature in some sense."}, {"time": 679, "text": "Yes, but in order to do it, I mean, almost always there are some examples in the ancient world where this wasn't the case, but almost always it had to be a subjugated people or people that are regarded as different."}, {"time": 690, "text": "One of the things actually I've tried to sort of inject into the discussion through this book among other things is a recognition that there were very major questions still going on in the 18th and early 19th century that were unresolved, which were one of the reasons why slavery was not as morally repugnant to people then as it is to us now."}, {"time": 713, "text": "And that's the question of polygenesis and monogenesis."}, {"time": 718, "text": "At the time of Thomas Jefferson, the founding fathers were thinking and working."}, {"time": 723, "text": "They didn't know because nobody knew whether the human races were related or not."}, {"time": 732, "text": "There were arguments, the monogenesis argument that we were all indeed from the same racial stock."}, {"time": 740, "text": "Polygenesis argument was that we weren't."}, {"time": 743, "text": "Black Africans, Ethiopians, they're often referred to at the time because they provided some of the first slaves, were different from white Europeans, simply not related in any way."}, {"time": 755, "text": "And that makes it easier, of course."}, {"time": 757, "text": "That makes it easier to enslave people if you think they're not your brother."}, {"time": 761, "text": "Am I my brother's keeper?"}, {"time": 762, "text": "No, he's not your brother, and it's a very, it was a very troubling argument in the 18th, 19th century, also because there was a biblical question."}, {"time": 776, "text": "It threw up a theological question, which was, I mean, people were literally debating this at the time."}, {"time": 785, "text": "Was there also a black Adam and Eve?"}, {"time": 788, "text": "Was there, as it were, an Indian Adam and Eve, a Native American Adam and Eve?"}, {"time": 794, "text": "This was a serious theological debate because they didn't know the answer."}, {"time": 799, "text": "People say that Darwin solved this."}, {"time": 802, "text": "It wasn't just Darwin, of course, but by the late 19th century, the argument that we were not all related as human beings had suffered so many blows that you had to really be very, very ignorant, deliberately, willfully ignorant to ignore it by then."}, {"time": 821, "text": "So it no longer was, after Darwin, a theological question."}, {"time": 825, "text": "It became a moral question."}, {"time": 826, "text": "It was already a moral question, but it clarified, Darwin clarifies it definitely, and then you're in this, as I say, in this situation of you're not subjugating some other people."}, {"time": 835, "text": "You're subjugating your own kin, and that becomes morally unsustainable."}, {"time": 843, "text": "So given that slavery in America is part of its history, how do we incorporate into the calculus of policy today, social discourse, what we learn in school?"}, {"time": 866, "text": "We can look at slavery in America."}, {"time": 867, "text": "We can look at maybe more recent things, like in Europe, the other atrocities, the Holocaust."}, {"time": 875, "text": "How do we incorporate that in terms of how we create policy, how we treat each other, all those kinds of things?"}, {"time": 883, "text": "What is the calculus of integrating the atrocities, the injustices of the past into the way we are today?"}, {"time": 891, "text": "That's a very complex question, because it's a moral question at this point, and a moral question long after the fact."}, {"time": 901, "text": "I say at one point in the War on the West that the argument, for instance, on reparations now that goes on, and it's not a fringe argument anymore."}, {"time": 909, "text": "Some people say, oh, you're pulling up this fringe argument."}, {"time": 911, "text": "I mean, every contender for the Democratic nomination for the presidency in 2020 was willing to talk about the possibility of reparations."}, {"time": 920, "text": "Some very eager that this country, America, goes through that entirely self destructive exercise."}, {"time": 928, "text": "I say that there's a lot of problems with this, but if I could refine it down to one thing, I'd say this."}, {"time": 936, "text": "It's no longer about a wealth transfer from one group of people who did something wrong to another group of people who were wronged."}, {"time": 942, "text": "It would have been that, could have been that 200 years ago."}, {"time": 946, "text": "Today, it's not even the descendants of people who did something wrong giving money to people who were the descendants of people who were wronged."}, {"time": 953, "text": "It's a wealth transfer from people who look like people who did a wrong thing in the past to another group of people who resemble people who were wronged."}, {"time": 962, "text": "That's impossible to do, and I'm completely clear about this."}, {"time": 967, "text": "There is no way in which you could organize such a wealth transfer on moral or practical reasons."}, {"time": 977, "text": "America is filled with people who have the same skin color as us, for instance, who have no connection to the slave trade and should not be made to pay money to people who have some connection."}, {"time": 990, "text": "And then the country's also filled with ethnic minorities who have come after slavery who would not be due for any reimbursement, as it were."}, {"time": 1002, "text": "The problem with this is, though, is that there are, I'm perfectly open to the possibility that there are residual inequities that exist in American life and that the consequences of slavery could be one of the factors that result from this."}, {"time": 1021, "text": "The thing is, I don't think it's a single issue answer."}, {"time": 1028, "text": "I think it's a multidimensional issue, something like black underachievement in America."}, {"time": 1032, "text": "It's obviously a multidimensional issue."}, {"time": 1036, "text": "Much of the left and others wish to say it's not."}, {"time": 1040, "text": "It's only about racism."}, {"time": 1042, "text": "And they can't answer why Asians who've arrived more recently don't, for instance, get held down by white supremacy."}, {"time": 1050, "text": "But actually, I say white supremacy in quotes, obviously."}, {"time": 1054, "text": "But don't get held back by it, but actually flourish to the extent that Asian Americans have higher household earnings and higher household mean equity than, home equity and so on, than white Americans."}, {"time": 1070, "text": "So I don't think that on the merits the evidence is there that racism is the explanation for black, ongoing black underachievement in some sections of the black community in America."}, {"time": 1081, "text": "It's obviously a part of it."}, {"time": 1083, "text": "Could you say that even those things like fatherlessness and similar family breakdown issues are a longterm consequence of it?"}, {"time": 1096, "text": "Possibly, but it's being often said it's being awfully generous to people's ability to make bad decisions."}, {"time": 1104, "text": "For instance, how many generations after the Holocaust would you allow people to claim that everything that went wrong in the Jewish community was as a result of the Holocaust?"}, {"time": 1115, "text": "I mean, is there some kind of term limit on this?"}, {"time": 1119, "text": "I would have thought so."}, {"time": 1120, "text": "And I think most people probably think that's over."}, {"time": 1123, "text": "I think the details matter there, but it's very difficult."}, {"time": 1130, "text": "You're in deep waters, yeah."}, {"time": 1132, "text": "Oh, I enjoy swimming out in the ocean, so although I'm terrified of what's lurking underneath in the darkness."}, {"time": 1140, "text": "You're right, you're right to be."}, {"time": 1144, "text": "Okay, it's really complicated calculus with the Holocaust and with slavery."}, {"time": 1149, "text": "So the argument in America is that there's deep institutional racism against African Americans that's rooted in slavery."}, {"time": 1162, "text": "And so however that calculus turns out, that calculation, it still persists in the culture, in the institutions, in the allocation of resources, in the way that we communicate, in subtle ways, in major ways, all that kind of stuff."}, {"time": 1181, "text": "How is it possible to win or lose that argument of how much institutional racism there is that's rooted in slavery?"}, {"time": 1190, "text": "Is it a winnable?"}, {"time": 1192, "text": "It's an unquantifiable argument."}, {"time": 1195, "text": "And I'd like to apply some shortcuts to some of this, the following."}, {"time": 1201, "text": "Are, for instance, all, let's take the EVV1 that's most often cited."}, {"time": 1209, "text": "If a white person is walking down a street in America and they see a group of young black men coming towards them and it's late at night and they cross the road, is it because of slavery?"}, {"time": 1220, "text": "Is it because of institutional racism?"}, {"time": 1223, "text": "No, it's because they've made a calculus based not entirely on unfounded beliefs that given crime rates, it's possible that this group of people might be a group of people they don't want to meet late at night."}, {"time": 1243, "text": "That's an ugly fact, but as crime statistics in American cities after American cities bear out, it's not an entirely unreasonable one."}, {"time": 1255, "text": "It's not reasonable every time, obviously, obviously."}, {"time": 1259, "text": "But is it attributable to slavery?"}, {"time": 1262, "text": "That's a stretch."}, {"time": 1264, "text": "If you're in a city like Chicago where the homicide rates shot up in the last two years, albeit again, as always has to be remembered, mainly black on black gun violence and knife violence."}, {"time": 1281, "text": "Nevertheless, if you're in a city like Chicago and you make that calculus I've just suggested, the cliched one, the street late at night, there are other factors other than that."}, {"time": 1293, "text": "Factors other than a memory of slavery that kick in."}, {"time": 1299, "text": "And I'm afraid it's something which people don't want to particularly acknowledge in America for obvious reasons, because it's the ugliest damn debate in the world."}, {"time": 1307, "text": "But I was actually just writing in my column in New York Post today about a very interesting case that's sort of similar, which is the question of obesity in the US."}, {"time": 1318, "text": "As you know, America's the most overweight country in the world."}, {"time": 1323, "text": "America has, I think, 40% of the population is obese in medical ways, and the nearest next country is a long way down, that's New Zealand, at 30% of the population."}, {"time": 1334, "text": "So America's a long way ahead."}, {"time": 1336, "text": "Why during the coronavirus era when we know that obesity is the one clearest factor that's likely to lead to your hospitalization if you also get the virus?"}, {"time": 1346, "text": "Why did almost no public health information in America focus on obesity?"}, {"time": 1351, "text": "80% of the people who ended up hospitalized in America with coronavirus were obese."}, {"time": 1358, "text": "We locked the schools when there was no evidence that the coronavirus was deadly for children."}, {"time": 1363, "text": "We all wore cloth masks when there was a very little evidence that this was much use in stopping the spread of the virus."}, {"time": 1372, "text": "We had massive evidence about obesity being a problem, and we never addressed it."}, {"time": 1377, "text": "Is it just because we worried about fat people?"}, {"time": 1378, "text": "No, it's actually because about fat shaming, as it were."}, {"time": 1381, "text": "No, it's also because to a great extent it's a racial issue in America as well."}, {"time": 1385, "text": "And actually I quoted this new publication from the University of Chicago, as it happens, which makes that claim explicit, says, the reasons why people have views that are negative about obesity is because of racism and slavery."}, {"time": 1398, "text": "This is what everything is drawn back to in America."}, {"time": 1401, "text": "Anything you want to stop, you say it's because of racism, it's because of slavery."}, {"time": 1405, "text": "How about it's actually because you mind the hospitals getting clogged up, you mind people dying, you mind ethnic minorities disproportionately dying, and you'd like to say something about it."}, {"time": 1419, "text": "Once again, as in everything in America, it's cut off by some poorly educated academic saying it's about slavery."}, {"time": 1428, "text": "So we're really not, I mean, this requires a kind of form of brain surgery to perform it on a society, probably one that's not possible without killing the patient."}, {"time": 1437, "text": "And it's being done by people who are wearing mittens."}, {"time": 1444, "text": "So I'm sure that there's a few folks listening to this that are rolling their eyes and saying, here we go again, two white guys talking about the lack of institutional racism in America."}, {"time": 1460, "text": "First of all, what would you like to tell them?"}, {"time": 1467, "text": "So our African American friends who are looking at this, and I've gotten the chance to talk to a bunch of them on Clubhouse recently."}, {"time": 1475, "text": "Clubhouse is this social app."}, {"time": 1477, "text": "And I really enjoy it."}, {"time": 1478, "text": "It's an absolute zoo of an app as far as I can see it."}, {"time": 1481, "text": "I personally love it because you get to talk to, as somebody who's an introvert and doesn't socialize much, I enjoy talking to people from all walks of life."}, {"time": 1492, "text": "So it gave me a chance to first of all practice Russian and Ukrainian, so I get the chance to do that."}, {"time": 1498, "text": "Then you get a chance to talk about Israel and Palestine with people who are from that part of the world."}, {"time": 1504, "text": "And you get to hear raw emotion of people from the ground where they start screaming, they start crying, they start being calm and collected and thoughtful."}, {"time": 1516, "text": "And this is as if you walked into a bar with custom picked regular folks, in quotes, regular folks."}, {"time": 1524, "text": "Just people that have, quote unquote, lived experiences."}, {"time": 1529, "text": "Real pain, real hope, real emotions, biases, and you get to listen to them go at it."}, {"time": 1536, "text": "With no, because it's an audio app, you're not allowed to start getting into a physical fist fight."}, {"time": 1543, "text": "So even though it really sounds like people want it."}, {"time": 1546, "text": "It sounds like it's happening, yeah."}, {"time": 1547, "text": "Yeah, and so you get to really listen to that feeling."}, {"time": 1550, "text": "And for example, it allows a white guy like me from another part of the world, coming from the former Soviet Union, to go into a room with a few hundred African Americans screaming about Joe Rogan using the N word."}, {"time": 1567, "text": "And I get to really listen."}, {"time": 1569, "text": "There's very different perspectives on that in the African American community, and it's fascinating to listen."}, {"time": 1574, "text": "So I don't get access to that by excellent books and articles written and so on."}, {"time": 1580, "text": "You get that real raw emotion."}, {"time": 1582, "text": "And I'm just saying, there's a few of those folks listening to this with that real raw emotion."}, {"time": 1587, "text": "And one argument they say is you, Douglas Murray, and you, Lex Freeman, don't have the right to talk about race and racism in America."}, {"time": 1598, "text": "It is our struggle."}, {"time": 1600, "text": "You are from a privileged class of people that don't know what it's like to be a black man or woman in America walking down the street."}, {"time": 1611, "text": "Can you steel man that case?"}, {"time": 1614, "text": "First of all, fuck that."}, {"time": 1616, "text": "That's not, I think we need to define steel, steel manning."}, {"time": 1621, "text": "Okay, I know what steel manning is."}, {"time": 1624, "text": "I really resent that form of argumentation."}, {"time": 1628, "text": "I really resent it."}, {"time": 1629, "text": "I have the right to talk about whatever the hell I want, and no one's gonna stop me or try to intimidate me or tell me that I can't simply because of my skin color."}, {"time": 1638, "text": "And I think that if I said to somebody else the other way around, it would be equally reprehensible."}, {"time": 1643, "text": "If I said, shut up, you have no right to criticize anything that Douglas Murray says because you've not got my skin color."}, {"time": 1649, "text": "Okay, it's not an exact comparison, but seriously, is that a reasonable form of argument?"}, {"time": 1656, "text": "You haven't been through everything I've been through in my life, therefore you can't comment."}, {"time": 1659, "text": "No, in that case, nobody can talk about anything."}, {"time": 1663, "text": "We might as well pack up, go home, and isolate ourselves."}, {"time": 1667, "text": "Strong words, but can you try to steel man the case, not in this particular situation, but there's people that have lived through something that can comment in a very specific way, like for example, Holocaust survivors."}, {"time": 1683, "text": "There is a sense in which, maybe a basic sense of civility when a Holocaust survivor is speaking about their experience of the Holocaust, then an intellectual from a very different part of the world is simply writing about nuanced geopolitics of World War II just should not interrupt the Holocaust survivor."}, {"time": 1706, "text": "We physically interrupt them if they're telling their stories."}, {"time": 1708, "text": "No, with words, with logic and reason that the experience of the Holocaust survivor somehow fundamentally has a deeper understanding of the humanity and the injustice of the."}, {"time": 1722, "text": "First of all, again, we're in even deeper waters now, but in terms of wanting to listen to another person who has experienced something, yes, yes."}, {"time": 1732, "text": "But not endlessly, not endlessly."}, {"time": 1736, "text": "I mean, there are some people who've written about, I mean, there are people who've written about the Holocaust who didn't experience the Holocaust and have written about it better than people who did."}, {"time": 1745, "text": "It's not this idea that the lived experience to use this terrible modern jargon as if there's another type."}, {"time": 1754, "text": "This idea that the lived experience has to triumph over everything else is not always correct."}, {"time": 1760, "text": "It can be correct in some circumstances."}, {"time": 1763, "text": "If you are sitting in a room with a Holocaust survivor and somebody who'd never heard about the Holocaust and wanted to kind of shoot out their views on it, yeah, one of those people should be heard more than the other, obviously, obviously."}, {"time": 1777, "text": "If there's somebody who's experienced racism firsthand and there's somebody else who has never experienced it, then obviously you'd want to hear from the person who has experienced it firsthand, if that is the discussion underway."}, {"time": 1791, "text": "I don't think that it's the case that that is endlessly the case."}, {"time": 1795, "text": "I'm also highly reluctant to concede that there are groups of people who by dint of their skin color or anything else get to dominate the microphone."}, {"time": 1807, "text": "Now, of course, we're literally both speaking to microphones at the moment, so there's an irony to this, but let's skate over the irony."}, {"time": 1813, "text": "What I mean is people saying, you don't have the right to speak, I have the right to take the microphone from you and speak because I know best."}, {"time": 1822, "text": "Fine, if you know best, we'll argue it out and someone will win, long or short term."}, {"time": 1830, "text": "But the almost aggressive tone in which this is now leveled, I don't like the sound of, nobody's experience is completely understandable by another human being, nobody's."}, {"time": 1846, "text": "And what many people are asking us to do at the moment, us collectively is, to fall for that thing, I think it was Camille Foster who said it first, but I've adopted in recent years, is to say you must spend an inordinate amount of your life trying to understand me personally, my lived experience, everything about me."}, {"time": 1866, "text": "You should dedicate your life to trying to do that."}, {"time": 1870, "text": "Simultaneously, you'll never understand me."}, {"time": 1875, "text": "This is not an attractive invitation."}, {"time": 1877, "text": "This is an unwinnable game."}, {"time": 1880, "text": "So if somebody has a legitimate and important point to make, they should make it and they'll win through whatever their character is or whatever their race."}, {"time": 1892, "text": "And by the way, there are plenty of white people who experience racism as well."}, {"time": 1895, "text": "There are plenty of white people who do and have done, and increasingly so, which is one of the things I write about in the War on the West."}, {"time": 1902, "text": "I mean, I would argue that today in America, the only group who are actually allowed to be consistently, vilely racist against the white people."}, {"time": 1912, "text": "If you say disgusting things about black people in America in 2022, you will be over."}, {"time": 1918, "text": "You will be over."}, {"time": 1919, "text": "If you decide to talk about people's white tears, their white female tears, their white guilt, their white privilege, their white rage, and all these other pseudo pathologizing terms, you'll be just fine."}, {"time": 1932, "text": "You can be the chairman of the Joint Committee of the Staff, you can lecture at Yale University, absolutely fine, and the white people have to suck that up as if that's fine because there was racism in another direction in the past."}, {"time": 1944, "text": "So white people can have racism as well."}, {"time": 1947, "text": "Does that mean that I think that I have a right or other white people have a right to dominate the discourse by talking about their feelings of having been victims of racism?"}, {"time": 1955, "text": "No, not particularly, because what does that get us?"}, {"time": 1958, "text": "It gets us into an endless cycle of competitive victimhood."}, {"time": 1961, "text": "Am I saying that white people who've experienced violence have experienced historically anything like the violence that was perpetrated against black people in America historically?"}, {"time": 1971, "text": "Obviously not."}, {"time": 1972, "text": "But what kind of competition do we want to enter here?"}, {"time": 1978, "text": "And this is very, very important terrain now in America, because there's one other thing I have to throw in there, which is how do you work out the sincerity of the claim?"}, {"time": 1989, "text": "How do you work out the sincerity of the claim being made?"}, {"time": 1992, "text": "At one point in this latest book, I referred to a very useful bit in Nietzsche on the genealogy of morals, where, as you know, Nietzsche always has to be treated carefully, you know, when people say, I love Nietzsche, you have to say, which bits?"}, {"time": 2009, "text": "So what exactly do you love about him?"}, {"time": 2014, "text": "But, and a lot can be learned from the answer."}, {"time": 2018, "text": "But there are moments in Genealogy of Morals that were very useful for this book."}, {"time": 2022, "text": "One of them was the moment when Nietzsche uses a phrase that I've now stolen from myself, appropriated, you might say, where he refers to people who tear at wounds long since closed and then cry about the pain they feel."}, {"time": 2039, "text": "And Nietzsche says, I've never felt so much pain in my life as the pain they feel."}, {"time": 2048, "text": "Now, how do you know, how do you know whether the pain is real?"}, {"time": 2055, "text": "I'm not saying you can never know, but it's hard."}, {"time": 2060, "text": "So when somebody says, I feel that my life hasn't gone that well and it's because of something that was done to my ancestors 200 years ago, maybe they do feel that."}, {"time": 2070, "text": "Maybe they're right to feel that."}, {"time": 2072, "text": "Maybe they're using it up."}, {"time": 2074, "text": "Maybe they're using it as their reason for failure in life."}, {"time": 2077, "text": "Maybe they're using it as their reason to not even try."}, {"time": 2081, "text": "Maybe they're using it as their reason to smoke weed all day."}, {"time": 2086, "text": "And who does know?"}, {"time": 2087, "text": "How can you work that out?"}, {"time": 2089, "text": "And that's why I come back to this thing of, who are we to constantly judge in this society other people who we don't know and attribute motives to them based on racial characteristics?"}, {"time": 2103, "text": "And as you write in this part, I like your cultural appropriation of Nietzsche and at the same time, canceling Nietzsche in the same set of sentences."}, {"time": 2117, "text": "But you write in this part about evil."}, {"time": 2120, "text": "No, I didn't cancel Nietzsche."}, {"time": 2123, "text": "Can't cancel Nietzsche, I was saying treat him carefully."}, {"time": 2127, "text": "Treat him carefully, fair enough."}, {"time": 2129, "text": "But you can judge a man's character by which parts of Nietzsche he quotes."}, {"time": 2135, "text": "That's fair enough, I think."}, {"time": 2136, "text": "I think when you meet people who do man and Superman a bit too much, you're in."}, {"time": 2142, "text": "Now you're pulling in even deeper water referencing Hitler here."}, {"time": 2148, "text": "So you write in this part of the book about evil."}, {"time": 2153, "text": "Quote, what is it that drives evil?"}, {"time": 2157, "text": "Many things without doubt, but one of them is identified by several of the great philosophers is resentment."}, {"time": 2164, "text": "That sentiment is one of the greatest drivers for people who want to destroy."}, {"time": 2169, "text": "Colon, blaming someone else for having something you believe you deserve more."}, {"time": 2174, "text": "And you're saying this kind of resentment, we don't know as it surfaces whether it's genuine or if it's used to sort of play games of power to evil ends, can you speak to this?"}, {"time": 2192, "text": "Because it's such a fascinating idea that one of the biggest drivers of evil in the world is resentment."}, {"time": 2201, "text": "Because if you look at, boy, if you look at human history, if you look at Hitler, so much of the propaganda, so much of the narrative was about resentment."}, {"time": 2212, "text": "So is that surface or is it level or is that deep, the resentment that drives evil?"}, {"time": 2216, "text": "It can be any of the above."}, {"time": 2218, "text": "Let's first of all preface it, everybody has resentment."}, {"time": 2221, "text": "I use the term resentment which is sort of very similar to resentment, let's stick with resentment."}, {"time": 2229, "text": "So we don't sound too pretentious."}, {"time": 2237, "text": "Let me give you a quick example of somebody in our own day who has a form of resentment, Vladimir Putin."}, {"time": 2242, "text": "Did you see Navalny's documentary, Putin's Palace?"}, {"time": 2248, "text": "You remember the stuff about Putin as a young KGB officer in Germany?"}, {"time": 2252, "text": "Remember the stuff about Putin and his first wife's resentment of one of his KGB colleagues who had an apartment that was a few meters bigger than the Putin's apartment?"}, {"time": 2264, "text": "And by the way, I'm not saying that, you know, Vladimir Putin became the man he has become and invaded Ukraine because he didn't have an apartment he liked in Berlin or Munich or wherever he was."}, {"time": 2273, "text": "There's distinct possibility."}, {"time": 2275, "text": "My point is that resentment is a factor in all human lives and we all feel it in our lives and it's something that has to be struggled against."}, {"time": 2289, "text": "Resentment is, in political terms, can be a deadly, I mean, it's an incredibly deep thing to draw upon."}, {"time": 2296, "text": "I mean, you mentioned Hitler."}, {"time": 2298, "text": "Obviously one of the things that Hitler played on was resentment, obviously."}, {"time": 2304, "text": "Almost every revolutionary does."}, {"time": 2307, "text": "I mean, the French revolutionaries did as well."}, {"time": 2308, "text": "And not without cause."}, {"time": 2311, "text": "It's a good reason to feel that Versailles was not listening to Paris in the 1780s and feel resentment for Marie Antoinette in her palace within the palace, ignoring the bread shortages in Paris."}, {"time": 2327, "text": "So resentment is a very, it's a very understandable thing and sometimes it's justifiable and it's also deadly to the person as it is to the society."}, {"time": 2337, "text": "It's an incredibly deep, deep sentiment."}, {"time": 2339, "text": "Somebody else has got something that you should have."}, {"time": 2344, "text": "And the problem about it is that it has the potential to be endless."}, {"time": 2349, "text": "You can do it your whole life."}, {"time": 2351, "text": "And one of the ways I've sort of found myself explaining this to people is to say, it's also important to recognize that resentment is something that can cross absolutely every boundary."}, {"time": 2362, "text": "So for instance, it crosses all racial boundaries, obviously, and how it goes without saying."}, {"time": 2368, "text": "More interesting is it crosses all class boundaries and socioeconomic boundaries."}, {"time": 2373, "text": "And if I was to sort of simplify this thought, I would say, I guess that you and I and everybody watching knows or has known something or has known somebody in their lives who has almost nothing in worldly terms and is a generous person, a kindly person, a giving person, a happy person even, a cheerful person."}, {"time": 2403, "text": "And I think we probably have also, or many of us will have met people who seem to have everything and who are filled with resentment, filled with resentment."}, {"time": 2413, "text": "Somebody else has held them back from something."}, {"time": 2414, "text": "Their sister once did something, she got this and I should have got that."}, {"time": 2419, "text": "And on and on and on."}, {"time": 2422, "text": "It's a human trait."}, {"time": 2423, "text": "And one of the things that suggests to me is that we therefore have a choice in our lives about this."}, {"time": 2429, "text": "And this is something which we can do something about, not limitlessly, but for instance, I mean, there are very good reasons that some people in their lives might feel resentment."}, {"time": 2441, "text": "Let's say you're involved in a car crash and a friend fell asleep at the wheel and that's why you are spending the rest of your life in a wheelchair."}, {"time": 2450, "text": "It's a pertinent example of this in American politics at the moment."}, {"time": 2455, "text": "You would be justified in feeling resentment."}, {"time": 2458, "text": "And at some point you have to make a decision, which is, am I going to be that person or a different person?"}, {"time": 2468, "text": "But even in that case, you're saying at the individual level and at the societal level is destructive to the mind, even when you're, quote unquote, justified."}, {"time": 2475, "text": "It rots you."}, {"time": 2476, "text": "It rots you because the best you can do is to eke out your days unfulfilled."}, {"time": 2486, "text": "So the antidote, as you describe, is gratitude."}, {"time": 2491, "text": "Gratitude is the antidote to evil in a sense."}, {"time": 2495, "text": "Gratitude is the individual level and the societal level."}, {"time": 2498, "text": "Gratitude is certainly the answer to resentment."}, {"time": 2501, "text": "I quote in The War on the West, when I read it the first time a few years ago, I was absolutely floored by the brothers Karamazov."}, {"time": 2512, "text": "Not everything in it, by the way, and I won't get into it, but I have some very big structural criticisms of the novel."}, {"time": 2519, "text": "Now you're just sweet talking to me because I'm a Dostoevsky fan, but I appreciate this."}, {"time": 2526, "text": "Well, we could get into what I see as being the structural flaws in the brothers Karamazov, but anyway."}, {"time": 2530, "text": "Now I'm offended and triggered."}, {"time": 2532, "text": "Yeah, no, I mean, this is something coming out of Macbeth and saying, I didn't think it was much good."}, {"time": 2539, "text": "Yeah, there's structural flaws."}, {"time": 2540, "text": "Yeah, I thought the ending stank and the middle wasn't very good."}, {"time": 2544, "text": "No, when I read that novel, I was floored by a couple of things."}, {"time": 2550, "text": "One is, of course, at the moment where we realize the devil appears."}, {"time": 2554, "text": "The moment that Ivan says to his brother, you know he visits me, and you realize that he's talking about the devil, the whole novel goes into this totally different space."}, {"time": 2567, "text": "Anyway, it's even more than you've already realized the novel's about."}, {"time": 2571, "text": "And then when the conversation occurs between Ivan and the devil, I think he describes him as dressed in the French style of the early part of the 90th century."}, {"time": 2586, "text": "Very strange that the devil would be dressed like that, but sort of."}, {"time": 2590, "text": "And if you remember that he's sort of cross legged and rather a vain figure, but the devil mentions in passing to Ivan that he says, I don't know why, gratitude is not an instinct that's been given to me."}, {"time": 2610, "text": "Yeah, you're not allowed."}, {"time": 2612, "text": "This is not, given the role of being the devil, this is not one of the things."}, {"time": 2617, "text": "Just not one of the things."}, {"time": 2618, "text": "And you think, and of course, only a genius of Dostoevsky's stature could, I mean, a lesser genius would have made a whole novel out of that insight."}, {"time": 2627, "text": "Only Dostoevsky can just throw it away because there's such an abundance of riches that he still has to get through, the structural problems aside."}, {"time": 2635, "text": "But the, but the, but the."}, {"time": 2638, "text": "The passive aggressive, the microaggression in this conversation is palpable."}, {"time": 2644, "text": "A little knife fight."}, {"time": 2647, "text": "No, but the reason I mention this is because of course, when I saw this, this is such a brilliant insight by Dostoevsky because why would gratitude not be a sentiment that the devil was capable of?"}, {"time": 2659, "text": "The answer is of course that if the devil was capable of gratitude, he wouldn't be the devil."}, {"time": 2665, "text": "He'd be somebody else."}, {"time": 2668, "text": "He has to be incapable of gratitude."}, {"time": 2671, "text": "Do you think for Dostoevsky that was as strong of an insight as it is for you?"}, {"time": 2676, "text": "Because I think that's a really powerful idea that with gratitude, you don't get the resentment that rots you from the core."}, {"time": 2686, "text": "Yes, I think it was one of the just endless things that he saw in us."}, {"time": 2690, "text": "And the way I put it is that, I mean, I also think of it in terms of the era of deconstruction, which is one of the things I'd like us to call the era that's now ending."}, {"time": 2702, "text": "The era of deconstruction was the era that started, let's say from the 60s onwards, and was originally an academic game that then spilled out into the wider culture, which was let's take everything apart."}, {"time": 2716, "text": "Let's pull it all apart."}, {"time": 2719, "text": "There are lots of problems with it."}, {"time": 2720, "text": "One is it's quite boring."}, {"time": 2723, "text": "You don't get an awful lot from it."}, {"time": 2727, "text": "You also have the problem of what children find when they try to do this with bicycles, which is they can take it apart quite easily, but they can't put it back together."}, {"time": 2738, "text": "And the era of taking things apart as a game is one we've lived through, and it's been highly destructive, but you can do it for quite a long time."}, {"time": 2751, "text": "I'm going to look at this society, and I'm going to take it apart by showing systemic problems."}, {"time": 2756, "text": "I'm going to, at the end of that, what have you got?"}, {"time": 2761, "text": "What have you achieved?"}, {"time": 2763, "text": "We need to interrogate this."}, {"time": 2765, "text": "Okay, interrogate."}, {"time": 2766, "text": "By all means, ask questions, but interrogate as a deliberate hostility to this."}, {"time": 2771, "text": "I'm going to interrogate this thing and take it apart."}, {"time": 2773, "text": "And again, at the end of it, what have you got?"}, {"time": 2777, "text": "Whether you're interrogating a text or a piece of music or an idea or a society, fine."}, {"time": 2784, "text": "Question, endlessly question."}, {"time": 2786, "text": "Yes, interrogate assumes it's all a criminal in a cell and it's guilty, and therefore it must be taken apart."}, {"time": 2797, "text": "And that's what we've been doing for decades in the West."}, {"time": 2801, "text": "And that's resentment."}, {"time": 2803, "text": "That's one byproduct of resentment."}, {"time": 2806, "text": "You can't build the thing, but you know how to take it apart."}, {"time": 2810, "text": "Is a little bit of resentment good?"}, {"time": 2813, "text": "So you have that, I love Tom Waits, and he has a song where a little drop of, I like my Tom with a little drop of poison."}, {"time": 2823, "text": "Is it good to do that?"}, {"time": 2825, "text": "Is it good to have a little bit of poison in your drink?"}, {"time": 2828, "text": "Depends what the poison is, and it depends if you know not to have another drink."}, {"time": 2833, "text": "It might be the case, you find out, as some alcoholics do, that one was too many and 10 is not enough."}, {"time": 2841, "text": "So there's a natural, in this case, this kind of deconstruction is a slippery slope."}, {"time": 2847, "text": "It becomes an addiction, it becomes a drug, and you just can't stop."}, {"time": 2851, "text": "Well, you'd have to wean yourself off it and try to start creating again."}, {"time": 2854, "text": "You'd have to start trying to put things together again."}, {"time": 2860, "text": "Something I think might be in the throes of starting as it happens."}, {"time": 2866, "text": "Well, speaking of taking things apart and not putting them together again, the idea of critical race theory."}, {"time": 2878, "text": "Can you, to me, explain, so I'm an engineer and have not been actually paying attention much, unfortunately, to these things."}, {"time": 2887, "text": "None of the people in your field were until it comes along and smacks you in the face."}, {"time": 2891, "text": "I've had that line of thinking from MIT."}, {"time": 2897, "text": "I said, well, surely whatever you folks are busy about yelling at each other for is a thing at Harvard and Yale."}, {"time": 2906, "text": "It's not going to."}, {"time": 2908, "text": "People in the STEM subjects thought it's not coming for us."}, {"time": 2911, "text": "It can't come to us and bang."}, {"time": 2913, "text": "Well, it hasn't quite been a bang."}, {"time": 2917, "text": "Engineering is more safe than others."}, {"time": 2919, "text": "Yeah, so let's draw a line now between engineering and science."}, {"time": 2925, "text": "So I think engineering is, I'm sitting in a castle in the tallest tower with my pinky out drinking my martini saying, surely."}, {"time": 2936, "text": "The peasants below with their biology and their humanities will figure it all out."}, {"time": 2943, "text": "There's no pinky out."}, {"time": 2944, "text": "I drink vodka and I hang with the peasants."}, {"time": 2947, "text": "Okay, where is this?"}, {"time": 2948, "text": "This metaphor has gone too far."}, {"time": 2951, "text": "Can you explain to this engineer what critical race theory is?"}, {"time": 2956, "text": "Is it a term that's definable?"}, {"time": 2959, "text": "Is there a tradition?"}, {"time": 2960, "text": "Is there a history?"}, {"time": 2961, "text": "What is good about it, what is bad about it?"}, {"time": 2964, "text": "It is a tradition."}, {"time": 2965, "text": "It is a history."}, {"time": 2965, "text": "It's a school of thought."}, {"time": 2966, "text": "It started in the law roughly in the 1970s in some of the American academy."}, {"time": 2972, "text": "It spilled out."}, {"time": 2973, "text": "It always aimed to be an activist philosophy."}, {"time": 2976, "text": "People deny that now, but as I cite in The War in the West, the foundational texts say as much."}, {"time": 2983, "text": "This is an activist academic study."}, {"time": 2988, "text": "We're not just looking at the law."}, {"time": 2990, "text": "We seek to change the law."}, {"time": 2993, "text": "And it's built out into all of the other disciplines."}, {"time": 2996, "text": "I think there's a reason for that, by the way, which is it happened at the time that the humanities and others in America were increasingly weak and didn't know what to do, and they needed more games to play or new games to play."}, {"time": 3007, "text": "The psychologists got bored."}, {"time": 3009, "text": "Yeah, I mean, well, they needed tenure."}, {"time": 3012, "text": "They needed something to do."}, {"time": 3014, "text": "And I mean, it's not an original observation."}, {"time": 3016, "text": "Plenty of people have made this, but I mean, Neil Ferguson said it some time ago, for instance, that in the last 50 years in American academia, certainly in humanities departments, when somebody dies out who's a great scholar in something, that's just not replaced by somebody of equal stature."}, {"time": 3033, "text": "They're replaced by somebody who does theory or critical race theory."}, {"time": 3038, "text": "They're replaced by somebody who does the modern games."}, {"time": 3041, "text": "Somebody dies out who's a great historian of, say, I don't know, it's the one that's on my mind, Russian history or Russian literature, and they're not replaced by a similar scholar."}, {"time": 3053, "text": "In his observation and in yours, is this a recent development?"}, {"time": 3057, "text": "It's happened in the last few decades, for sure."}, {"time": 3059, "text": "And it's sped up."}, {"time": 3061, "text": "Is it because we've gotten to the bottom of some of the biggest questions of history?"}, {"time": 3064, "text": "No, it's because we're willing to forget the big questions."}, {"time": 3069, "text": "Because it's more fun to, big questions aren't as fun?"}, {"time": 3072, "text": "No, partly it's, no, I should stress that partly isn't, this is in the weeds, but partly it's a result of the hyper specialization in academia."}, {"time": 3079, "text": "You know, if you said you'd like to write your dissertation on Hobbes, if you wanted to say something central to Kant's thought or Hegel's, I mean, that's not popular."}, {"time": 3102, "text": "What's popular is to take somebody way down the line from that, because there's a feeling that that's all been done."}, {"time": 3109, "text": "So you take something way, way, way down the line from that that's much less important, and then you sort of play with that."}, {"time": 3117, "text": "And I think most people, anyone who's watching who's been in a philosophy department or anything else in recent years will know that tendency."}, {"time": 3124, "text": "By the way, there's a very practical consequence of this."}, {"time": 3126, "text": "I saw this at the end of my friend Roger Scruton's life when he would occasionally, he didn't get tenure at universities, but he would occasionally be flown in even by his enemies to teach courses in various universities in basics of philosophy, because there was no one in the department able to do it."}, {"time": 3144, "text": "Like he would go in and teach for a semester, you know, Hegel and Kant and Schopenhauer and others, because there was no one to do it, because they were all playing with the things way, way, way down the road from this."}, {"time": 3160, "text": "So that had already happened, and people were searching for new games to play, and the critical race theory stuff forced its way in, partly in the way that all of this that's now known as anti racism does, which is in a sort of bullying tone of saying if you don't follow this."}, {"time": 3178, "text": "It's the same way that all the things that are called studies, I think everything called studies in the humanities should be shut down."}, {"time": 3186, "text": "Because of the activist element."}, {"time": 3189, "text": "They're all activists, gay studies and queer studies, and nothing good has ever come from it."}, {"time": 3196, "text": "Nothing good."}, {"time": 3197, "text": "To push back, is it obvious that activism is a sign of a flaw in a discipline?"}, {"time": 3204, "text": "So isn't it?"}, {"time": 3206, "text": "It's a sign of the death of the discipline."}, {"time": 3207, "text": "It's a sign the discipline's over."}, {"time": 3209, "text": "But isn't it a good goal to have for discipline to enact change, positive change in the world?"}, {"time": 3216, "text": "Or is that for politicians to do with the findings of science, not the scientists themselves?"}, {"time": 3224, "text": "Why create an ideology and then set out to find disciplines that are weakly put together to try to back up your political ideology?"}, {"time": 3233, "text": "So ideology should not be part of science or of humanities."}, {"time": 3240, "text": "Why would you, I mean, anyone could do it."}, {"time": 3245, "text": "You could decide to go in and be wildly right wing about something and only do things that prove your right wing ideas."}, {"time": 3253, "text": "Be fantastically antiacademic, fantastically anti science."}, {"time": 3258, "text": "It's an absurd way to mix up activism and academia."}, {"time": 3265, "text": "And it's absolutely rife."}, {"time": 3266, "text": "And Critical Race Theory is one of the ones that completely polluted the academy."}, {"time": 3271, "text": "Yeah, and there's been dark moments throughout history, both during World War II with both communism and Nazism, fascism that infiltrated science and then corrupted it."}, {"time": 3285, "text": "Yes, I mean, for instance, also, let's face it, in science, as in everything else, there are dark, difficult things."}, {"time": 3293, "text": "It's much better we know about them, face up to them and try to find a way socially to deal with them than that you leave them in the hands of some activist who wants to do stuff with them."}, {"time": 3304, "text": "Some of my best friends are activists."}, {"time": 3307, "text": "I'm just kidding, okay."}, {"time": 3309, "text": "None of my best friends are activists."}, {"time": 3311, "text": "That's how it should be."}, {"time": 3313, "text": "Well, I was kidding because I don't have any friends, but okay."}, {"time": 3318, "text": "No, I'm trying to gain some pity points."}, {"time": 3322, "text": "Okay, so to return."}, {"time": 3324, "text": "You have your clubhouse friends."}, {"time": 3327, "text": "Screaming away like deranged maniacs."}, {"time": 3331, "text": "Now, I'm anti clubhouse, by the way, because the only time I heard it was at Brett Weinstein one when he did that."}, {"time": 3336, "text": "I don't know if you heard that, early in clubhouse."}, {"time": 3338, "text": "I was invited to clubhouse by various people."}, {"time": 3339, "text": "He was like, oh, this is a really great civilized way to hang out and talk with interesting people."}, {"time": 3343, "text": "And I downloaded the app and I got on one, because Brett Weinstein said, I'm doing this conversation and I listened and it was the maddest damn discussion I've ever heard."}, {"time": 3354, "text": "Was it something about biology?"}, {"time": 3355, "text": "Something about, was it during COVID times?"}, {"time": 3358, "text": "At some point, Brett said, I'm an evolutionary biologist."}, {"time": 3366, "text": "And somebody else started saying, you're a eugenicist."}, {"time": 3369, "text": "And he said, no, I'm an evolutionary biologist."}, {"time": 3372, "text": "And somebody said, that's the same thing."}, {"time": 3374, "text": "And it just went on like that."}, {"time": 3376, "text": "And Brett desperately tried to explain, that's not the same thing as being a eugenicist."}, {"time": 3381, "text": "And he lost the clubhouse room."}, {"time": 3384, "text": "They thought that was the same thing."}, {"time": 3385, "text": "He'd come, it horribly reminded me of a time some years ago when a British newspaper ran a sort of realizing that the only thing you can unite people on in sexual ethics is revulsion against pedophilia, ran an anti pedo campaign."}, {"time": 3400, "text": "And shortly after pediatricians offices were torched in North of England by a mob who hadn't read the whole sign."}, {"time": 3408, "text": "Yeah, well, to me, like I said, a little bit of poison is good for the town, so."}, {"time": 3415, "text": "Anyhow, sorry, I interrupted you with flattering you with their people on clubhouse."}, {"time": 3418, "text": "I have many, I have multiples of friends, yes."}, {"time": 3424, "text": "Okay, we didn't get to some of the ideas of critical race theory."}, {"time": 3429, "text": "What exactly is it?"}, {"time": 3431, "text": "I'm actually in part asking this question quite genuinely."}, {"time": 3434, "text": "Yeah, it's an attempt to look at everything among other things through the lens of race and to add race into things where it may not be as a way of adding, I'm trying to give the most generous estimation, to add race in as a conversation in a place where it may not have been in the conversation."}, {"time": 3456, "text": "And that means history too?"}, {"time": 3458, "text": "The history of racism."}, {"time": 3460, "text": "Yeah, yeah, yeah, all history."}, {"time": 3463, "text": "And to look at it through these particular lenses."}, {"time": 3468, "text": "I mean, there's a certain, like all these things, there's a certain logic in it."}, {"time": 3471, "text": "Like with feminist studies or something, I mean, is there a utility in looking back through undoubtedly male dominated histories and asking where the more silent female voice was?"}, {"time": 3483, "text": "Yes, very interesting."}, {"time": 3486, "text": "Not endlessly interesting."}, {"time": 3488, "text": "And can't be put exactly on the same par as, but it has a utility."}, {"time": 3496, "text": "It's that endlessly, sorry to interrupt, that endlessly part that seems to get us into trouble a lot here."}, {"time": 3501, "text": "Well, because of this thing of where do you stop?"}, {"time": 3504, "text": "And that's always, I talked about this in my last book in the manners of crowds."}, {"time": 3512, "text": "It's one of the big conundrums in activist movements and particularly in activist academia."}, {"time": 3518, "text": "Where would you stop?"}, {"time": 3519, "text": "It's not clear because you've got a job in it."}, {"time": 3522, "text": "You've got a pension in it."}, {"time": 3524, "text": "You've got, your only esteem in society is in keeping this gig going."}, {"time": 3530, "text": "I mean, is there any likelihood?"}, {"time": 3535, "text": "Have you ever, there's the old academic joke, isn't it?"}, {"time": 3538, "text": "The end of every conference, the only thing everyone agrees on is that we must have another conference like this one."}, {"time": 3545, "text": "It's the one thing they always agree on."}, {"time": 3547, "text": "This conference is so great, we must have another one."}, {"time": 3549, "text": "Well, that's a criticism you could apply to a lot of disciplines."}, {"time": 3553, "text": "Civil engineering, bridge building."}, {"time": 3555, "text": "At a certain point, do we need any more bridges?"}, {"time": 3559, "text": "Can we just fly everywhere?"}, {"time": 3563, "text": "At the very least, you need to keep the bridges up."}, {"time": 3566, "text": "Sure, and they would, critical race theory folks would probably make the same argument."}, {"time": 3570, "text": "At the very least, we need to keep the racism out."}, {"time": 3575, "text": "We have to make sure we don't descend into the racism."}, {"time": 3577, "text": "It assumes all the time that we are living on the cusp of the return of the KKK."}, {"time": 3583, "text": "Which is totally wrong."}, {"time": 3584, "text": "I mean, it's a massive."}, {"time": 3585, "text": "You say that now, until the KKK armies march in."}, {"time": 3589, "text": "We don't always, we can't always predict the future."}, {"time": 3592, "text": "We can't always predict the future, and you can always say you should be careful, but you've also gotta be careful of people who've got their timing like totally, totally wrong, or their estimation of the society they're in."}, {"time": 3607, "text": "You mean like most of society before in the 1930s, when Hitler was, I mean, so many people got Hitler wrong."}, {"time": 3617, "text": "Sure they did."}, {"time": 3618, "text": "Most people."}, {"time": 3619, "text": "So maybe it was nice to have the alarmist thinking there."}, {"time": 3624, "text": "Beware of the man with the mustache."}, {"time": 3628, "text": "If only it was that easy."}, {"time": 3631, "text": "Not always a bob facial hair."}, {"time": 3633, "text": "I always say that, I mean, what."}, {"time": 3635, "text": "Very often is."}, {"time": 3636, "text": "These two clean shaven chaps both say, one of the problems of everybody knowing a little bit about Nazism is that they think that they know where evil comes from and that it comes from like a German with a small mustache, getting people to goose step, for instance."}, {"time": 3654, "text": "And that's not correct."}, {"time": 3657, "text": "A much better understanding of it is, it can come from all number of directions and keep your antennae as good as you can."}, {"time": 3666, "text": "But once you end up in this society, which I would argue, certainly parts of America, where you're always in 1938, that's not healthy for a society either, where people are so primed and think they're so well trained because they spent a term in school learning about the Second World War and the Holocaust, think they're so well trained in Hitler spotting that they can do it all the time."}, {"time": 3692, "text": "Look at all these phrases we now have in our societies, like dog whistle."}, {"time": 3697, "text": "You know, as I always say, if you hear the whistle, you're the dog."}, {"time": 3700, "text": "But people say, that's a dog whistle, as if they're highly trained anti Nazis."}, {"time": 3707, "text": "I mean, you know, there should be some humility in it."}, {"time": 3710, "text": "We should be careful, we should be wary for sure."}, {"time": 3714, "text": "And we should also be slightly humble in our inability to spot everything."}, {"time": 3721, "text": "If not significantly humble, right, so if we can, there's something funny, if not dark, about the activity of Hitler spotting, if I just may take an aside."}, {"time": 3741, "text": "But so critical race theory, how much racism, what is racism?"}, {"time": 3748, "text": "How much of it is in our world today?"}, {"time": 3751, "text": "If we were thinking about this activity of Hitler spotting, and trying to steel man the case of if not critical race theory, but people who look for racism in our world, how much would you say?"}, {"time": 3768, "text": "Well, it's a good thing to try to define."}, {"time": 3770, "text": "I would say that racism is the belief that other people are inferior to you."}, {"time": 3777, "text": "You could say, you could see a form of it where you thought people were superior to you."}, {"time": 3782, "text": "That could also happen, but more commonly, you see a group of people as being inferior to you simply by dint of the fact that they have a different racial background."}, {"time": 3792, "text": "And that's sort of the easiest way to define racism."}, {"time": 3800, "text": "As I say, I mean, there are types of racism, mainly antisemitism actually, perhaps it's the only one, which weirdly relies on a hatred of people who a certain type of person thinks are better than them."}, {"time": 3815, "text": "And that's a particular peculiarity, one of the peculiarities of antisemitism."}, {"time": 3820, "text": "Well, antisemitism somehow does both, right?"}, {"time": 3822, "text": "Yes, one of the eternal fascinating things about antisemitism is it can do, it does everything at the same time."}, {"time": 3830, "text": "It's like a quantum racism."}, {"time": 3833, "text": "They're both superior and inferior."}, {"time": 3834, "text": "You know Vasily Grosman's Life and Fate?"}, {"time": 3839, "text": "So in the middle of Life and Fate, which a Persian friend of mine always said was one of only two great novels of the 20th century, she was a very harsh literary critic."}, {"time": 3847, "text": "What was the other one?"}, {"time": 3849, "text": "Oh, The Leopard, obviously."}, {"time": 3850, "text": "The Leopard?"}, {"time": 3851, "text": "The Leopard by Giuseppe Dallan Pedusa, yeah."}, {"time": 3854, "text": "She's definitely right on that one."}, {"time": 3856, "text": "Life and Fate is a..."}, {"time": 3857, "text": "I'm learning so much today, yes."}, {"time": 3859, "text": "Life and Fate is an extraordinary book, mainly about, well, you know, Grosman was obviously Jewish himself, but he saw almost everything that he could have done in the Second World War."}, {"time": 3876, "text": "He saw Stalingrad, he was a journalist, and he wrote firsthand accounts of Stalingrad."}, {"time": 3882, "text": "He was also the first journalist into Treblinka, and his account, which you can read in one of the collections of his journalism, his account of walking into Treblinka is just one of the most devastating, haunting pieces of journalism or prose you can read."}, {"time": 3896, "text": "Anyhow, I mention him because Grosman, in the middle of Life and Fate, which is about a 900 page novel, in the middle of it, which is about the dark axis around Stalingrad, he, well, at one point, he amazingly sort of goes into the minds of Earth Hitler and Stalin, and he says, Stalin, in his study, feels his counterpart in Berlin, and he says he feels very close to him at this moment."}, {"time": 3926, "text": "Wow, around Stalingrad, like leading up to the back."}, {"time": 3929, "text": "After Stalingrad, when the Germans are lost, he says he feels the closeness of Hitler."}, {"time": 3974, "text": "I mean, the only thing I can think of that's equally good is Gregor von Retzori, who wrote a luridly titled, but brilliant set of novellas called The Confessions of an Anti Semite, and about pre First World War anti semitism in Eastern and Central Europe."}, {"time": 4025, "text": "So I think it's the only racism that includes within it, a detestation, for the real anti semit, a detestation of people that the person may perceive to be better than them, correctly or otherwise."}, {"time": 4041, "text": "By the way, I'm embarrassed to say I have not read this one of two greatest novels of the 20th century, Life and Fate, Zhizny Sidba."}, {"time": 4087, "text": "It's interesting, I need to definitely, definitely read it."}, {"time": 4090, "text": "I think you'll really get a lot from it."}, {"time": 4093, "text": "One of the other things, sorry, I'm raffling it, but one of the other things he does is that he has this extraordinary ability to talk about the absolute highest levels of the conflict and then zoom in, it's rather like the camera work they use in things like Lord of the Rings, where he zooms down and gets one person in the midst of all this, and you get on that."}, {"time": 4112, "text": "Or puts you in the study, too."}, {"time": 4114, "text": "So I personally have read and reread the William Shires, The Rise and Fall of the Third Reich, who's another journalist who was there, but he does not do, interestingly enough, given such a large novel, kind of the definitive work, the definitive original work that goes to source materials on Hitler, he doesn't touch anti semitism really."}, {"time": 4141, "text": "Big thing to miss out."}, {"time": 4142, "text": "Well, he just says it very calmly and objectively as he does for most of the work, that this was the fact of life."}, {"time": 4152, "text": "There's a lot of cruelty throughout, but he doesn't get to."}, {"time": 4155, "text": "Well, one of the things is, of course, they lost the war because of anti semitism."}, {"time": 4159, "text": "I mean, that's one kind of important way to view it."}, {"time": 4162, "text": "It's how Andrew Roberts, another historian, said it, is that in the end, the Nazis lost the war because they were Nazis."}, {"time": 4169, "text": "It sounds almost too neat, but it's worth remembering that at the end of the war, when the Germans need to be transporting troops and they need to be transporting very basic supplies, Eichmann makes sure he gets the trains to transport the Jews right up to the end."}, {"time": 4189, "text": "Well, that's certainly a dark possibility."}, {"time": 4192, "text": "Anyhow, but to go back to racism in general."}, {"time": 4195, "text": "Racism in general, apart from anti semitism, relies on the perception that another group of people, a racial group, other than your own, are inferior to you."}, {"time": 4207, "text": "That's what I'd say is the easiest shorthand of racism."}, {"time": 4211, "text": "And of course, it's one of the stupidest things that our species is capable of."}, {"time": 4217, "text": "I mean, one of the stupidest, that you can look at a person and guess them in their entirety, in fact, because of their skin color."}, {"time": 4228, "text": "I mean, it's like, what a stupid idea that is, as well as being an evil one."}, {"time": 4232, "text": "But I would say that one of the, I think it's a dangerous thing in our era that there are bits of it coming back."}, {"time": 4243, "text": "That's why I say we do need sort of, we need our antennae working."}, {"time": 4248, "text": "We just don't need them to be overactive or underactive, you know."}, {"time": 4253, "text": "Now, the book is War in the West, but speaking of racism, racism towards different groups based on their skin color, you've said that there's a war on white people in the US."}, {"time": 4265, "text": "Would you say that's the case?"}, {"time": 4266, "text": "Would you say that there is significant racism towards white people in the United States?"}, {"time": 4273, "text": "I'd say that white people in the United States are the only people who are told that they have hereditary sin."}, {"time": 4280, "text": "And that's a big one, just to start with."}, {"time": 4282, "text": "Based strictly on the color of their skin."}, {"time": 4283, "text": "Based on their skin color."}, {"time": 4285, "text": "I mean, I would find it so repugnant if, and I hope everybody would join me in feeling this, I would feel it so repugnant if there were any school of thought in America today that had any grasp on the public attention that said that black people were born into evil because of something their ancestors had done."}, {"time": 4306, "text": "Like they had the mark of Cain upon them."}, {"time": 4309, "text": "I mean, I think it would be such a vicious way to try to demoralize a group of people and to tell them that the things they would be able to achieve in their lives are much lessened because they should spend significant portions of their lives trying to do something that they didn't do."}, {"time": 4334, "text": "And the obvious point left unsaid, but let's say it, nobody in the public square says that."}, {"time": 4343, "text": "I mean, they're the maniacs at the far fringes, but nobody in the mainstream would dare to say that, or I think even think that about any group of people other than white people."}, {"time": 4354, "text": "And does this mean that white people are more likely or does this mean that white people are more disadvantaged than black people?"}, {"time": 4362, "text": "No, and again, let's not make this a competition, but let's not get into, I just desperately urge people not to get into the idea of hereditary sin according to racial background."}, {"time": 4373, "text": "Is there something to be said about the feature aspect, sort of play devil's advocate, about the asymmetry of sort of accusations towards the majority?"}, {"time": 4386, "text": "So because white, so it's easier to attack a majority."}, {"time": 4389, "text": "It is much easier, but is there something to be said about that being a useful function of society that you always attack, that the minority has disproportionate power to attack the majority so that you can always keep the majority in check?"}, {"time": 4404, "text": "Well, it's a dangerous game to play, isn't it?"}, {"time": 4409, "text": "It's a very dangerous game to play."}, {"time": 4410, "text": "That's a good summary of entirety of human civilization."}, {"time": 4413, "text": "Oh yeah, everything is dangerous."}, {"time": 4415, "text": "But it's a very dangerous game to play that."}, {"time": 4417, "text": "I wrote about this a bit in the Madness of Crowds when I was saying like gay rights people, the ones that still exist, the ones who don't have homes to go to, who want to beat up on straight people in a way, or want to make straight people feel like they're kind of unremarkable, uncool, you know, boring straights."}, {"time": 4442, "text": "So not like the magical pixie fairy dust gays."}, {"time": 4447, "text": "That's a bad idea to push that one."}, {"time": 4450, "text": "That's a bad idea."}, {"time": 4451, "text": "And some gays push that."}, {"time": 4455, "text": "Highly unwise, given the fact that about two to 3% of the population are actually gay, although now there's like an additional 20% who think they're like two spirit or something and all that bullshit, but they're just attention seekers."}, {"time": 4470, "text": "So let's not spend too much time on that."}, {"time": 4474, "text": "But equally, as I said in the Madness of Crowds, with the feminist movement, very unwise for half of the species to say that the other half of the species isn't needed."}, {"time": 4487, "text": "And there were always third and fourth wave feminists willing to make that nuts argument."}, {"time": 4493, "text": "Not first wave feminists."}, {"time": 4494, "text": "You didn't hear it in first wave feminists."}, {"time": 4496, "text": "You didn't hear it."}, {"time": 4496, "text": "Suffragette tended not to say we like the vote and men are scum."}, {"time": 4503, "text": "It would have been hard to have won everyone over to their side."}, {"time": 4506, "text": "Not least the men they needed to win over to their side."}, {"time": 4509, "text": "But you do get third and fourth wave feminists who say like, do we need men?"}, {"time": 4514, "text": "Or men are all X."}, {"time": 4515, "text": "Again, it's a bad idea."}, {"time": 4517, "text": "It's a bad idea tactically."}, {"time": 4519, "text": "What if men, Richard Wrangham, somebody from Harvard, describes that men are the originators of violence, physical violence in society."}, {"time": 4531, "text": "And he argues that actually the world would be better off."}, {"time": 4535, "text": "No, just a very cold calculus."}, {"time": 4538, "text": "If you get rid of men, there will be a lot less violence in society is his claim."}, {"time": 4544, "text": "But who says you need to get rid of violence in society?"}, {"time": 4547, "text": "But shouldn't that at least be a discussion?"}, {"time": 4550, "text": "The pros and cons."}, {"time": 4551, "text": "Have a debate, a panel discussion, violence, pros and cons."}, {"time": 4555, "text": "Well, that's the sort of thing, if I can say so, that some weak ass academic decides to do because he thinks that his area of Boston would be nicer or whatever."}, {"time": 4566, "text": "He might decide it's useful if he was living in Kiev today to have violent men."}, {"time": 4573, "text": "I mean, it might, if New York was invaded right now, I'd need some violent men around here."}, {"time": 4582, "text": "But it wouldn't be invaded if there's no violent men."}, {"time": 4585, "text": "Well, there's also, at least there's some level of threat that you ought to exude that puts people off."}, {"time": 4595, "text": "If I was in, you know, I'm very glad that the men and women of Ukraine are capable of and more than capable of fighting for their country and for their neighbors and their families and much more."}, {"time": 4609, "text": "But it's better that there was violence ready to unleash when violence was unleashed upon them than that the whole society had been told that they should identify as non binary."}, {"time": 4623, "text": "But at least it's a conversation to have."}, {"time": 4625, "text": "Isn't there aspect to the sort of the feminist movement that is correct in challenging the..."}, {"time": 4637, "text": "Some forms of violence, domestic violence, for instance."}, {"time": 4640, "text": "Although women are capable of that as well."}, {"time": 4643, "text": "I'm learning about this."}, {"time": 4644, "text": "We're all learning about this at the moment."}, {"time": 4646, "text": "I can't help but watch the entirety of it go down in this beautiful mess that is human relations."}, {"time": 4652, "text": "But just to finish up that thought, it's very unwise for women to war against men as it would be for men to war against women."}, {"time": 4661, "text": "It's highly, highly unwise to war on a majority population."}, {"time": 4665, "text": "And in America, Britain and other Western countries, white people are still a majority."}, {"time": 4669, "text": "And so why would you tell the majority of their evil by dint of their skin color?"}, {"time": 4675, "text": "And think that that would be a good way to keep them in check."}, {"time": 4679, "text": "I mean, I'm not guilty of anything because of my skin color."}, {"time": 4682, "text": "I'm not guilty of anything."}, {"time": 4683, "text": "My ancestors didn't do anything wrong."}, {"time": 4685, "text": "And even if they had, why would I be held responsible for it?"}, {"time": 4689, "text": "So to go back to Nietzsche, is there some aspect to where, if we try to explain the forces at play here, is it the will to power playing itself out from individual human nature and from group behavior nature?"}, {"time": 4707, "text": "Is there some elements to this which is the game we play as human beings is always when we have less power, we try to find ways to gain more power."}, {"time": 4716, "text": "That's certainly one."}, {"time": 4719, "text": "The desire to grab is, let me see if I can find a quote for you on that."}, {"time": 4725, "text": "The desire to grab that which we think we're owed and to do it often in the guise of justice."}, {"time": 4736, "text": "I mean, justice is one of the great terms of our age and one of the great bogus terms of our age."}, {"time": 4743, "text": "People forever talk about their search for justice."}, {"time": 4746, "text": "It's amazing how violent they can often be in their search for justice and how many rules they're willing to break so long as they can say they're after justice and how many norms they can trample so long as they can say it's in the name of justice."}, {"time": 4758, "text": "You can burn down buildings in the name of justice."}, {"time": 4761, "text": "Well, the majority groups throughout history, including those with white skin color have done the same in the name of justice."}, {"time": 4768, "text": "We come up with all kinds of sexy terms in our propaganda machines to sell whatever atrocities we'd like to commit."}, {"time": 4776, "text": "One of the quotes from Nietzsche that I liked and I quoted in this book."}, {"time": 4781, "text": "Careful, I'm judging you harshly."}, {"time": 4783, "text": "Nietzsche says that one of the dangers of men of resentment is they'll achieve their ultimate form of revenge, which is to turn happy people into unhappy people like themselves, to shove their misery in the faces of the happy so that in due course the happy, and this is quoting Nietzsche, start to be ashamed of their happiness and perhaps say to one another, it's a disgrace to be happy."}, {"time": 4808, "text": "There is too much misery."}, {"time": 4811, "text": "This is something to be averted."}, {"time": 4812, "text": "The sick, says Nietzsche, must not make the healthy sick too or make the healthy confuse themselves with the sick."}, {"time": 4820, "text": "Well, I think that again, there's a lot of that going on."}, {"time": 4824, "text": "How could I be happy when there is unhappiness in the world?"}, {"time": 4827, "text": "Why should I not join the ranks of the unhappy?"}, {"time": 4831, "text": "I think Dostoevsky has a book about that as well."}, {"time": 4834, "text": "Knows From Underground."}, {"time": 4839, "text": "This has been very Russian, Russian focus."}, {"time": 4841, "text": "I'm very pleased with another times, but Dostoevsky and Grossman and others have come in."}, {"time": 4846, "text": "I wasn't doing this as a sort of."}, {"time": 4849, "text": "Yeah, well, it's always good to plug the greats and get to know they're still relevant."}, {"time": 4857, "text": "Do you speak Russian by the way at all?"}, {"time": 4859, "text": "Which I did."}, {"time": 4860, "text": "I'm told it's a 10 year language basically to learn from scratch as my friends who have done it."}, {"time": 4866, "text": "Well, there's the language and then there's the personality behind the language and the personality."}, {"time": 4871, "text": "I feel like you already have."}, {"time": 4872, "text": "So you just need to know the surface details."}, {"time": 4878, "text": "In fact, the silence to be silent in the Russian language is something that's already important."}, {"time": 4884, "text": "Oh, I should, if we had a moment, I'd tell you my story about Stalin's birthplace."}, {"time": 4888, "text": "Should I tell you that?"}, {"time": 4889, "text": "I once went to Gori where Stalin was born."}, {"time": 4893, "text": "Have you been?"}, {"time": 4894, "text": "I was there just after the Georgia war."}, {"time": 4896, "text": "And I went to the nomads land in South Ossetia and Abkhazia."}, {"time": 4902, "text": "And I said, I really got to go to Gori also here because the shell had landed in Gori rather weirdly from the Russian side and Gori is where Stalin was born."}, {"time": 4913, "text": "And of course, Gori is in Georgia."}, {"time": 4915, "text": "And when we had the museum of Stalin's birthplace, they'd been trying to change for some years because it had been unadulteratedly pro Stalin for years."}, {"time": 4926, "text": "And the Georgian authorities, this is in Saakashvili's time, were trying to make it into a museum of Stalinism."}, {"time": 4935, "text": "And it was really tough."}, {"time": 4937, "text": "The only place I've seen which is similar is the house in Mexico City where Trotsky was killed."}, {"time": 4943, "text": "That also is that they're not quite sure to do."}, {"time": 4945, "text": "They don't want to say he's a bad guy because they think that people won't come anyhow."}, {"time": 4950, "text": "Stalin's house in Gori had changed from the museum of Stalin to the museum of Stalinism."}, {"time": 4954, "text": "There was this large Georgian woman with a pink pencil who just had clearly been doing the tour for 50 years and just pointed all the facts."}, {"time": 4961, "text": "She did that classic thing."}, {"time": 4963, "text": "I've also saw it once in North Korea where they sort of that sort of communist thing where they say, here is, this is 147 feet high by 13 feet deep."}, {"time": 4972, "text": "They give you lots of facts."}, {"time": 4975, "text": "What does it matter?"}, {"time": 4976, "text": "They always give you facts."}, {"time": 4978, "text": "This is Stalin's suitcase."}, {"time": 4980, "text": "It is 13 inches wide by, you know, this isn't."}, {"time": 4984, "text": "Anyhow, and this woman did all of this and it was all just wildly pro, not pro Stalin, just explaining Stalin's life."}, {"time": 4990, "text": "It was just a great local boy done good."}, {"time": 4993, "text": "They didn't mention the fact he killed more Georgians per capita than anyone else."}, {"time": 4997, "text": "Local boy done good."}, {"time": 4998, "text": "And we get to the end and before being taken to the gift shop where they sell red wine with Stalin's face on it and among other things, and a lighter with Stalin on it, they took you to a little room under the stairs and they said, this is a replica of interrogation cell to show, represent horror of what happened in Stalin time."}, {"time": 5024, "text": "Now, gift shop."}, {"time": 5025, "text": "As I said, there's no, no kind of thing."}, {"time": 5028, "text": "And I took the woman aside at the end."}, {"time": 5030, "text": "I discovered she'd said this to other journalists and visited before."}, {"time": 5033, "text": "I took her aside and said, what do you think about communist Stalin?"}, {"time": 5037, "text": "And she said, let's say she'd obviously done this during communist times."}, {"time": 5043, "text": "She said, it's not my place to judge, that sort of thing."}, {"time": 5049, "text": "Which is an interesting comment in itself."}, {"time": 5050, "text": "I said, yeah, but he killed more Georgians than anyone and all that sort of thing."}, {"time": 5055, "text": "And she said, it's not my place to judge or to give my views and that sort of thing."}, {"time": 5059, "text": "And eventually I said, well, what do you feel about it?"}, {"time": 5062, "text": "And she said, it was like a hurricane, it happened."}, {"time": 5069, "text": "That's interesting because if I may mention Clubhouse once again, I got a chance to talk to a few people from Mongolia, there's a woman from Mongolia and they talked about the fact that they deeply admire Stalin, love."}, {"time": 5083, "text": "She sounded, if I may, hopefully that's not crossing line."}, {"time": 5086, "text": "I think I'm representing her correctly in saying she admired him almost like, loved him."}, {"time": 5095, "text": "Like the way people love like Jesus, like a holy figure."}, {"time": 5100, "text": "Well, isn't that still the case in large parts of Russia?"}, {"time": 5102, "text": "I mean, Stalin keeps on winning greatest Russian of all time."}, {"time": 5107, "text": "And that's perhaps, maybe there's a dip, but if we were to think about the long arc of history, perhaps that's going to go up and up and up and up."}, {"time": 5116, "text": "There's something about human memory that it just, you forget the details of the atrocities of the past and remember that."}, {"time": 5122, "text": "I mean, think of the number of people we talk about as historical heroes, Napoleon."}, {"time": 5127, "text": "I mean, British people don't talk about Napoleon as a hero, but the French, now you're, now you're on tricky ground."}, {"time": 5138, "text": "But no, but like the French, normally my Napoleon and there had many Admiral Aswit who was also an unbelievable brute and killed many people unnecessarily."}, {"time": 5149, "text": "And there are lots of figures from history that we sort of cover that over with."}, {"time": 5158, "text": "Can we mention Churchill briefly?"}, {"time": 5160, "text": "Because he is one of the, you can make a case for him being one of the great representers or great figures historically of Western civilization."}, {"time": 5172, "text": "And then there's a lot of people from, not a lot."}, {"time": 5176, "text": "I know, I have like three friends and one of them happens to be from London."}, {"time": 5181, "text": "And they say that he's not a good person."}, {"time": 5187, "text": "So listen, this friend, we did not discuss."}, {"time": 5190, "text": "I just, this is an opinion poll of the three friends, but I do know that there's quite a bit, you know."}, {"time": 5195, "text": "There's a backlash going on at the moment."}, {"time": 5197, "text": "At the moment and in general, there's a spirit like reflecting on the darker sides of some of these historical figures, like challenging history through, it's not just critical race theory."}, {"time": 5208, "text": "It's challenging history through, well, are the people we think of as heroes, what are their flaws?"}, {"time": 5219, "text": "And are they in fact villains that are convenient, sort of, we're there at the right time to accidentally do the right thing."}, {"time": 5232, "text": "Accidentally?"}, {"time": 5235, "text": "I hope this isn't the representative fair summation of your friend in London's views."}, {"time": 5241, "text": "No, she's going to be quite mad at this, but I didn't say the name, so it could be any friend."}, {"time": 5246, "text": "It could be, it's like a girlfriend in Canada."}, {"time": 5248, "text": "Well, see, I."}, {"time": 5250, "text": "You've given that away."}, {"time": 5251, "text": "Well, that's, of course I would not."}, {"time": 5254, "text": "I made that up completely."}, {"time": 5256, "text": "It's all, just like my girlfriend in Canada, she's completely a figment of my imagination."}, {"time": 5261, "text": "Nevertheless, Winston Churchill is somebody, I mean, just looking at reading The Rise and Fall of the Third Reich is an incredible figure that to me, so much of World War II is marked, leading up to the war is marked by stunning amounts of cowardice by political leaders, and it's fascinating to watch here this person clearly with a drinking and a smoking problem."}, {"time": 5291, "text": "Was he?"}, {"time": 5292, "text": "I didn't understand why that's a negative."}, {"time": 5293, "text": "No, I didn't say, you see."}, {"time": 5295, "text": "Yeah, you throw it in as if it is."}, {"time": 5297, "text": "No, well, it's called humor."}, {"time": 5299, "text": "I'll explain it to you one day what that means, but he stood."}, {"time": 5302, "text": "Explain dry humor."}, {"time": 5303, "text": "He stood up, he stood up to what we now see as evil when at the time it was not so obvious to see."}, {"time": 5316, "text": "You know, so that's just a fascinating figure of Western civilization."}, {"time": 5320, "text": "I'd love to get your comments."}, {"time": 5322, "text": "The real criticisms, I mean, smoking and drinking."}, {"time": 5325, "text": "The real criticisms of Churchill are quite easy to sum up, and I do so in the War on the West, actually."}, {"time": 5330, "text": "I say these are the things that they now use against him."}, {"time": 5334, "text": "Didn't do enough to avert the Bengal famine in 1943, for instance."}, {"time": 5337, "text": "That's been shot down by numerous historians, including Indian historians."}, {"time": 5341, "text": "In the middle of the war, in the middle of a world war, Churchill did what he could to get grain supplies diverted from Australia to Bengal."}, {"time": 5352, "text": "The famine was appalling."}, {"time": 5353, "text": "It was caused by a typhoon."}, {"time": 5355, "text": "It was not caused by Winston Churchill, and the idea that some, basically, Indian nationalist historians have pumped out in recent years, and just anti Churchill figures, that he actually wanted Indians to die is just total calumny."}, {"time": 5374, "text": "And when people claim, some people claim that, I mean, there was a few very ignorant scholars, nevertheless with some credentials, who claim that Churchill wanted the Indian population to basically be genocided."}, {"time": 5387, "text": "And it's complete nonsense, not least by the fact that during the period which in question Indian population boomed."}, {"time": 5396, "text": "So that's one of the main ones."}, {"time": 5399, "text": "Another one is that he had some views that we now had regarded as racist."}, {"time": 5403, "text": "He definitely regarded races as being of different characters, and that there were superior races, and the, as it were, the white European was a superior culture."}, {"time": 5419, "text": "He was born in Victorian England, so he had some Victorian attitudes."}, {"time": 5426, "text": "These are things in the negative side of the ledger, and as with all history, you should have a negative and a positive side of the ledger."}, {"time": 5431, "text": "Positive side of the ledger includes he almost certainly did more than any one human being to save the world from Nazism."}, {"time": 5437, "text": "So that should count as something."}, {"time": 5439, "text": "And one of the reasons I talk about Churchill in this regard is to stress that if you get, I'm not trying to stop anyone doing history at all."}, {"time": 5449, "text": "I don't think that the revisionism of recent years about Churchill or the founding fathers of America or anyone else is anything I want to stop."}, {"time": 5456, "text": "I find it interesting, find it interesting not least because it's so sloppy on occasions, but I find it interesting and it's important."}, {"time": 5462, "text": "And we should be able to see people in the round."}, {"time": 5464, "text": "But that includes recognizing the positive side of the ledger."}, {"time": 5470, "text": "And if you can't recognize that side, you're doing something else."}, {"time": 5475, "text": "You're doing something else."}, {"time": 5476, "text": "It's not history."}, {"time": 5478, "text": "It's some form of politicking of a very particular kind."}, {"time": 5483, "text": "And I think it's the same thing with the founding fathers."}, {"time": 5486, "text": "There are some people, for instance, certainly since the 90s who have pushed the Sally Hemings, Thomas Jefferson story to show that Thomas Jefferson was some kind of brute."}, {"time": 5495, "text": "As a result, we see Jefferson's statue being removed from the council chamber of the city we're sitting in last November by council members who said that Thomas Jefferson no longer represents our values."}, {"time": 5507, "text": "If you can't recognize greatness of Thomas Jefferson and that he had flaws, I mean, that's not a grownup debate."}, {"time": 5518, "text": "And weigh them and weigh them in the context of the time."}, {"time": 5521, "text": "But let me sort of throw a curveball at you then."}, {"time": 5525, "text": "What about recognizing the positive and the negative of a fellow with nice facial hair called Karl Marx?"}, {"time": 5534, "text": "I mean, I have a section in The War in the West, as you know, where I go for Karl Marx with some glee."}, {"time": 5542, "text": "So he seems to have gotten some popularity in the West recently."}, {"time": 5549, "text": "Not just recently, yeah."}, {"time": 5550, "text": "I mean, he's had a resurgence recently."}, {"time": 5552, "text": "Yes, resurgence."}, {"time": 5553, "text": "Well, that's because whenever things are seen to go wrong, people reach for other options."}, {"time": 5560, "text": "And when, for instance, it's very hard for people to accumulate capital, it's not obvious that they're gonna become capitalists."}, {"time": 5566, "text": "And so one thing that happens is people say, let's look at the Marxism thing again, see if that's a viable goer."}, {"time": 5572, "text": "And my argument would simply be, point me to one place that's worked."}, {"time": 5578, "text": "Well, the argument from the Marxists or the Marxian economists is that we've only really tried it once, the Soviets tried it, and then there's a few people that kind of tried the Soviet thing."}, {"time": 5592, "text": "Huber tried it?"}, {"time": 5593, "text": "Well, they basically, it's an offshoot of the Soviet, yes."}, {"time": 5598, "text": "They've tried it."}, {"time": 5599, "text": "They tried it in Venezuela."}, {"time": 5603, "text": "So let's just quickly say, how did all these experiments go?"}, {"time": 5608, "text": "Well, they failed in fascinating ways."}, {"time": 5611, "text": "They did, but they failed."}, {"time": 5612, "text": "Yes, they failed."}, {"time": 5613, "text": "We should stress, so grossly failed."}, {"time": 5616, "text": "So grossly failed that they threw millions and millions of people into completely thwarted lives that were much shorter than they should have been."}, {"time": 5627, "text": "Yeah, so the lesson to learn there, that you can learn several lessons."}, {"time": 5632, "text": "One is that anything that smells like Marxism is going to lead to a lot of problems."}, {"time": 5639, "text": "Now, another lesson could be, well, what is the fundamental idea that Marx had?"}, {"time": 5645, "text": "He was criticizing capitalism and the flaws of capitalism."}, {"time": 5650, "text": "So is it possible to do better than capitalism?"}, {"time": 5653, "text": "And that's, if you take that spirit, you start to wonder."}, {"time": 5656, "text": "That might actually become relevant in, I don't know, 20, 30, 50 years when the machines start doing more and more of the labor, all those kinds of things."}, {"time": 5666, "text": "You start to ask questions."}, {"time": 5667, "text": "You finally might get to Marx's dream of what the average day would look like."}, {"time": 5673, "text": "Well, there's gonna be an awful lot of literary criticism then."}, {"time": 5678, "text": "If you remember, that's what Marx said that we would be doing in the evenings, the laborer in the evening."}, {"time": 5682, "text": "Well, he didn't know Twitter was a thing, or Netflix."}, {"time": 5685, "text": "So he would change."}, {"time": 5687, "text": "Are there things we could learn from Marx plausibly, possibly?"}, {"time": 5691, "text": "I can't think of anything myself offhand."}, {"time": 5693, "text": "But to have a critique of capitalism isn't by any means a bad thing in this society."}, {"time": 5698, "text": "I'd rather that it was a critique of capitalism that showed how you improve capitalism, a critique of the free market that showed how people could get better access to the free market, how you could ensure, for instance, that young people get onto the property ladder, things like that."}, {"time": 5711, "text": "Those are constructive things."}, {"time": 5713, "text": "The people who say we must have Marxism, I mean, don't know what the hell they're talking about, because that never leads to any of those things."}, {"time": 5719, "text": "Haven't led in the past."}, {"time": 5722, "text": "It's never led in the past."}, {"time": 5723, "text": "And at some point, you've got to try to work out how many attempts you make at this damn philosophy before you realize that every attempt always leads to the same thing."}, {"time": 5734, "text": "I would say we could pretend that fascism has never been properly tried and that it was unfortunate what happened in Nazi Germany, but that wasn't real fascism."}, {"time": 5745, "text": "And Mussolini's fascism didn't go all that well, but it was a bit better."}, {"time": 5751, "text": "And maybe we could try a bit more Franco fascism."}, {"time": 5754, "text": "Nobody would have any time for this crap, nor should they."}, {"time": 5758, "text": "The people who try that are reviled, and quite rightly."}, {"time": 5762, "text": "So why do we tolerate it with the Marxism thing?"}, {"time": 5764, "text": "And it's a great mystery to me, the way that people do tolerate it."}, {"time": 5768, "text": "Always, always in this stupid way of saying, we haven't done it yet."}, {"time": 5773, "text": "And if you keep trying the same recipe, and every time it comes out as shit, it's that the recipe is shit."}, {"time": 5781, "text": "Well, sort of, I'm trying to practice here by playing devil's advocate, practice the same idea that you mentioned, which is, when you say the word Marxism, should you throw out everything, or should you ask a question, is there good ideas here?"}, {"time": 5794, "text": "And the same, it's the good, it's weighing the good and the bad, and being able to do so calmly and thoughtfully."}, {"time": 5801, "text": "You know the famous George Orwell comment on the style, in an argument with a Stalinist?"}, {"time": 5809, "text": "That's one of my favorite quotes."}, {"time": 5811, "text": "George Orwell, in the early 40s, gets into an argument with a Stalinist."}, {"time": 5815, "text": "He's also a Marxist."}, {"time": 5818, "text": "And this is after the show trials, 37."}, {"time": 5824, "text": "This is when it's very clear what Marxism in the Russian form is."}, {"time": 5860, "text": "And Orwell says, where's the omelet?"}, {"time": 5866, "text": "Oh, yeah, that's a good, that's a really good, because that's a... Look at this by this stage, okay?"}, {"time": 5872, "text": "How many... Where's my damn omelet?"}, {"time": 5874, "text": "How many just messy, big, bloody, eggy piles have the Marxists created by now in country after country?"}, {"time": 5885, "text": "Always next time they're going to produce the great omelet, but they never have, and they never will, because the whole thing is rotten from the start."}, {"time": 5894, "text": "But let me just also say one thing about, because of course Marx isn't as nice as he sounds, and that's one of the things that I try to highlight in the book is, if we're going to do this reductive thing of people in history and saying, well, they had views that were of their time, and we must therefore condemn them for them, say, fine, let's do the same thing with Marx."}, {"time": 5914, "text": "And there were things I quote in this book from Marx's letters, not least letters to Engels, and indeed in his published writings, in pieces he was writing for the American press in the 1850s, the way he has horrible views on slavery and colonialism and much more."}, {"time": 5933, "text": "But the main thing is, I mean, the horrible things he says about black people and the constant use of the N word."}, {"time": 5939, "text": "In fact, when I was doing the audio book for the war in the West, I had to decide, will I read out the quotes from Marx or not?"}, {"time": 5945, "text": "If I had read them out, I'd have been canceled because people would have just said, you've been using the N word so much in this passage."}, {"time": 5954, "text": "And I slightly thought of doing it so that I could say I was only quoting Marx to try to hit the point home."}, {"time": 5962, "text": "In the end, of course, I was sensible and decided not to, but Marx's letters are disgusting on these terms."}, {"time": 5967, "text": "Since I highlighted this in this book and some of the media picked it up and have popularized this thing I'm trying to put into the system, which is if you're gonna accuse Churchill of racism, if you're gonna accuse Jefferson of racism, Washington of racism, and so on, what about Marx?"}, {"time": 5984, "text": "The two things that Marxists have said since this came out has been, first of all, why are you saying this about Marx?"}, {"time": 5989, "text": "He was a man of his time, like everyone else."}, {"time": 5994, "text": "And the second thing they say is, we don't go to Marx for his horrible abhorrent views on race."}, {"time": 5998, "text": "So talking about mixed race people as gorillas and so on."}, {"time": 6002, "text": "We don't go to him for that."}, {"time": 6004, "text": "We go to him for his economic theories."}, {"time": 6006, "text": "I say, okay, well, we don't go to Thomas Jefferson for his views on slaves."}, {"time": 6011, "text": "We don't go to Churchill for the precise language he used that points in the 1910s about Indians."}, {"time": 6021, "text": "Or his health advice."}, {"time": 6024, "text": "Actually, I do get him for that."}, {"time": 6026, "text": "That explains so much."}, {"time": 6028, "text": "But let's have some standards on this."}, {"time": 6031, "text": "And that's why I'm very suspicious of the fact that the people don't do this with Marx because I think what they're trying, what some people are trying to do, and this may sound conspiratorial, but I really don't think it is."}, {"time": 6041, "text": "I think that some people are deliberately trying to completely clear the cultural landscape of our past in order to say there's nothing good."}, {"time": 6049, "text": "Nothing you can hold on to."}, {"time": 6051, "text": "No one you should revere."}, {"time": 6052, "text": "You've got no heroes."}, {"time": 6053, "text": "The whole thing comes down."}, {"time": 6055, "text": "Who's left standing?"}, {"time": 6056, "text": "Oh, we've also got this idea from the 20th century still about Marxism."}, {"time": 6060, "text": "Well, the 19th and 20th centuries."}, {"time": 6062, "text": "And no, no."}, {"time": 6065, "text": "You will not have the entire landscape deracinated."}, {"time": 6069, "text": "And then the worst ideas tried again."}, {"time": 6073, "text": "So basically destroy all of history and the lessons learned from history and then start from scratch."}, {"time": 6077, "text": "And then it's completely any idea can work and then you could just take whatever."}, {"time": 6082, "text": "Well, and the thing is there are always some people with pre preferred ideas."}, {"time": 6085, "text": "And I mentioned this also with the postcolonialists."}, {"time": 6112, "text": "But put that aside for a second."}, {"time": 6114, "text": "They could have said we have an indigenous culture which we will return to."}, {"time": 6118, "text": "Almost uniformly in the postcolonial era, you had figures like France Fanon, you had European intellectuals like Sartre, who said the Western powers are retreating from these countries and therefore we should institute in these countries what but Western Marxism."}, {"time": 6137, "text": "Well, it's not obvious to me that like the bad ideas will be the ones that emerge, but it's more likely the bad ideas would emerge in this kind of context when you erase history, when you erase tradition."}, {"time": 6147, "text": "When you erase history and you leave some ideas deliberately uninterrogated."}, {"time": 6153, "text": "I mean, as I say, find me one in a hundred American students who've heard of any of the communist despots of the 20th century."}, {"time": 6167, "text": "I mean, name recognition in, there was a poll done a few years ago in the UK and like name recognition among children, school children for Stalin, let alone Mao."}, {"time": 6181, "text": "I mean, Mao who kills more people than anyone, 65 million Chinese, perhaps."}, {"time": 6189, "text": "How many students in America know what Mao was, who he was, where he was, nothing."}, {"time": 6196, "text": "Or the atrocities committed."}, {"time": 6197, "text": "Where the atrocities were committed."}, {"time": 6199, "text": "And I worry about that because it means that we might have learned one of the two lessons of the 20th century."}, {"time": 6206, "text": "We think we've learned one of the two lessons of the 20th century."}, {"time": 6210, "text": "We actually haven't learned that lesson."}, {"time": 6212, "text": "We've learned a little bit of it."}, {"time": 6213, "text": "And we've not learned the other one at all."}, {"time": 6215, "text": "Because that's why we still have people in American politics and elsewhere actually talking about collectivization and things."}, {"time": 6222, "text": "As if there's no problem with that."}, {"time": 6224, "text": "And as if it's perfectly obvious."}, {"time": 6226, "text": "And they could run it and they'd know exactly where to stop."}, {"time": 6229, "text": "What are the two lessons of the 20th century?"}, {"time": 6231, "text": "Fascism and communism."}, {"time": 6236, "text": "I mean, I'm not exactly sure what exactly the lessons are."}, {"time": 6240, "text": "No, it's not clear."}, {"time": 6242, "text": "If the lessons were very clear, we'd be better at it."}, {"time": 6244, "text": "Well, one is your book broadly applied of madness of crowds."}, {"time": 6251, "text": "Well, how so?"}, {"time": 6254, "text": "Meaning like large crowds can display herd like behavior."}, {"time": 6259, "text": "Yes, be very suspicious of crowds."}, {"time": 6262, "text": "In general, I mean, you apply it in different, more to modern application."}, {"time": 6266, "text": "In a sense, but that's rooted in history, that crowds can, when humans get together, they can do some quite radically silly things."}, {"time": 6275, "text": "Elias Kaneti is very good on that, crowds and power."}, {"time": 6280, "text": "And Eric Hoffer, who is a sort of self taught, amazing, not to say autodidactic writer, the true believer and so on."}, {"time": 6289, "text": "He was extremely good on that."}, {"time": 6291, "text": "But the reason I mentioned the two things, no, I mean, we should have realized the two nightmares of the 20th century fascism and communism, that we should know how they came about."}, {"time": 6300, "text": "And we're interested in learning how one of them came about, fascism."}, {"time": 6303, "text": "And we know some of the lessons, like don't treat other people as less than you because of their race."}, {"time": 6312, "text": "But we've done some good at learning that."}, {"time": 6317, "text": "But the second one, not to do communism again, not to do socialism, I think we're way away from knowing because we don't know how it happened."}, {"time": 6329, "text": "And the little temptations are still there always."}, {"time": 6332, "text": "Look at people saying, I'm gonna expropriate your property."}, {"time": 6339, "text": "If people do things they don't like, they will get, we can't wait to take your property."}, {"time": 6342, "text": "Well, there's a sense, there's an appealing sense."}, {"time": 6345, "text": "Okay, every ideology has an appealing narrative behind it that sells the ideology."}, {"time": 6352, "text": "So for socialism, for communism is that there's a, it seems unfair that the working class does all of this work and gets only a fraction of the output."}, {"time": 6365, "text": "It just seems unfair."}, {"time": 6367, "text": "So you wanna make it."}, {"time": 6367, "text": "If they do get a fraction of the output, yes."}, {"time": 6370, "text": "Yes, and so it seems to be more fair if we increase that."}, {"time": 6376, "text": "If the workers own all of the value of their output and things that are more fair seems to be a good thing."}, {"time": 6386, "text": "I'd say, well, yeah, I mean, fairness is, I like fairness as a term."}, {"time": 6392, "text": "No, I much prefer fairness because it's a much easier thing to try to work out."}, {"time": 6396, "text": "It's quite amorphous itself as a concept, but everyone can recognize it."}, {"time": 6400, "text": "So for instance, should the boss of the company earn a million times that of the lowest paid employee?"}, {"time": 6411, "text": "Doesn't seem fair."}, {"time": 6413, "text": "Should they earn maybe five or 10 times the salary of the lowest employee?"}, {"time": 6420, "text": "Yeah, possibly, that could be fair."}, {"time": 6423, "text": "There are certain sort of multiples which are within the bounds of reasonableness."}, {"time": 6432, "text": "I think actually that's the much bigger problem in capitalism at the moment as I see it is the not untrue perception that a tiny number of people accrue a lot of the benefits and that the bit in the middle has become increasingly squeezed and is at danger always of falling all the way down to the bottom."}, {"time": 6460, "text": "I mean, I think in the snakes and ladders of American capitalism, for instance, it's a correct perception to say that the snakes go down awfully far."}, {"time": 6471, "text": "If you tread on the snake, you can plummet an awfully long way in America."}, {"time": 6476, "text": "And the deal in the game was that the ladders took you high and there's a perception, and again, it's not entirely wrong that the ladder system on the board is kind of broken."}, {"time": 6490, "text": "So what you're saying is you're a Marxist."}, {"time": 6493, "text": "I'm not saying I'm a Marxist."}, {"time": 6495, "text": "You heard that here first in the out of context blog post you're going to write about this."}, {"time": 6501, "text": "I get to that, I get back to this point."}, {"time": 6502, "text": "The way to critique capitalism, if it's gone bad, is to get better capitalists."}, {"time": 6508, "text": "Free markets where they're not fair should be made fair."}, {"time": 6511, "text": "Never decide that the answer is the thing that has never produced any human flourishing, i.e."}, {"time": 6515, "text": "Marxism."}, {"time": 6519, "text": "So as you describe in The Madness of Crowds the herd like behavior of humans that gets us into trouble, you as an individual thinker and others listening to this, how can you, because all of us are mids crowds, we're influenced by the society that's around us, by the people that's around us."}, {"time": 6539, "text": "How can we think independently?"}, {"time": 6541, "text": "How can we, if you're in the Soviet Union at the beginning of the 20th century, if you're in, I don't know, Nazi Germany at the end of the 30s or the 40s, how can you think independently?"}, {"time": 6560, "text": "Given, first of all, that it's hard to think independently, just intellectually speaking, but also that it just becomes more and more dangerous."}, {"time": 6573, "text": "So the incentive to think independently under the uncertainty that's usually involved with thinking is, I mean, it's a silly thing to say, but on Twitter there is a cost to be paid for going against the crowd on any silly thing."}, {"time": 6589, "text": "We can even talk about, what is it?"}, {"time": 6592, "text": "Will Smith slapping Chris Rock."}, {"time": 6595, "text": "There's a crowd that believes that that was unjustified."}, {"time": 6599, "text": "I forget what the crowd decided."}, {"time": 6600, "text": "But I don't."}, {"time": 6601, "text": "Crowd split on that one."}, {"time": 6602, "text": "It's safe to have one opinion either way."}, {"time": 6604, "text": "Okay, it is, right."}, {"time": 6605, "text": "But there is, you put it very nicely, that there's clearly a calculus here and that you can measure, on Twitter in particular, you can measure kind of the crowd, a sense of where the crowd lays."}, {"time": 6616, "text": "Michael Jackson."}, {"time": 6619, "text": "Well, oh boy."}, {"time": 6622, "text": "I don't want to, this is not a legal discussion."}, {"time": 6626, "text": "I don't have my lawyer present."}, {"time": 6627, "text": "I don't even have a lawyer."}, {"time": 6629, "text": "The man in question is dead."}, {"time": 6630, "text": "But I think most people who are not just diehard fans would concede that Michael Jackson had a strange relationship with children and was almost certainly a pedophile."}, {"time": 6642, "text": "Is that, was that, did the crowd agree on that?"}, {"time": 6645, "text": "No, the crowd hasn't agreed because he's too famous and we all love Thriller."}, {"time": 6649, "text": "So you said people who are not fans, I just don't."}, {"time": 6652, "text": "No, I'm a fan of Michael Jackson, but I think he was almost certainly a pedophile."}, {"time": 6656, "text": "And, but nobody wants to give up dancing to bad at weddings."}, {"time": 6661, "text": "So they just kind of added in."}, {"time": 6665, "text": "Seriously, it's a genius."}, {"time": 6667, "text": "Your law does not apply to Bill Cosby."}, {"time": 6672, "text": "Well, he wasn't, he was, of course, one of the most famous people in America."}, {"time": 6676, "text": "But maybe he wasn't regarded as talented."}, {"time": 6679, "text": "Oh, oh wow, there's depth to this calculation."}, {"time": 6682, "text": "There's a genius opt out in all cultures."}, {"time": 6687, "text": "Look at Lord Byron."}, {"time": 6688, "text": "Lord Byron shagged his sister."}, {"time": 6691, "text": "Doesn't affect his reputation."}, {"time": 6692, "text": "In fact, if anything, it kind of adds to it."}, {"time": 6694, "text": "But then again, this kind of war against the West, genius is actually makes you more likely, or no, to get canceled."}, {"time": 6703, "text": "So if you look at the genius of Thomas Jefferson, or... Well, yes, because if you haven't done anything remarkable, nobody will come looking for you passively, yeah."}, {"time": 6713, "text": "Oh, so genius can get you in trouble eventually."}, {"time": 6716, "text": "Sidle through life with nobody noticing."}, {"time": 6718, "text": "Be totally harmless and then die and hope you haven't used any carbon."}, {"time": 6725, "text": "But you were asking about how to survive the era of social media, as it were, and the crowds."}, {"time": 6733, "text": "And there's a very simple answer to that."}, {"time": 6735, "text": "Don't overrate the significance of the unreal world."}, {"time": 6742, "text": "Oh, come on, but this is still human psychology."}, {"time": 6745, "text": "Because you want to fit in."}, {"time": 6746, "text": "There's a, you want to... Why?"}, {"time": 6748, "text": "Because you like people, and you're just as a... Why not just like a small number of people and ignore the rest?"}, {"time": 6754, "text": "Yeah, that's... That's what I do."}, {"time": 6757, "text": "Well, I mean, I actually like most people, and that isn't a general thing."}, {"time": 6760, "text": "I don't have detestation for most people at all."}, {"time": 6764, "text": "Most people I kind of enjoy speaking with and being with."}, {"time": 6768, "text": "But in terms of storing your sense of self worth in absolute strangers, big mistake."}, {"time": 6774, "text": "Yeah, well, me, that's..."}, {"time": 6776, "text": "Listen, let's turn into a therapy session."}, {"time": 6778, "text": "Because for me, and I think I represent some number of population, is I'm pretty self critical."}, {"time": 6783, "text": "I'm looking for myself in the world."}, {"time": 6786, "text": "And there is a depth of connection with people on the internet."}, {"time": 6790, "text": "I mean, I have some..."}, {"time": 6791, "text": "I think there's a shallowness of it."}, {"time": 6793, "text": "It's shallow connection."}, {"time": 6794, "text": "Interesting, I..."}, {"time": 6795, "text": "Put it this way."}, {"time": 6796, "text": "If you became very ill tomorrow, would any of them help?"}, {"time": 6801, "text": "On the internet?"}, {"time": 6802, "text": "Good, that's a good test."}, {"time": 6804, "text": "Yeah, that's a good test."}, {"time": 6805, "text": "But then at the end of the day, yeah, you're right."}, {"time": 6807, "text": "Your very close friends would help, family would help."}, {"time": 6810, "text": "Yeah, and perhaps that's the only thing... You can't store significant amounts of trust, or faith, or belief, or self worth in places which will not return it to you."}, {"time": 6826, "text": "Okay, so let's talk about the more extreme case, the harsher case."}, {"time": 6830, "text": "When you talk about the things you talk about in the war on the West and madness of crowds, I mean, you're getting a lot of blowback, I'm sure."}, {"time": 6843, "text": "As for the listener, you just shrugged lightly."}, {"time": 6847, "text": "It was a zen like look on your face."}, {"time": 6850, "text": "So you don't... All you need is Sam Harris to say that you're brilliant and you're happy."}, {"time": 6856, "text": "No, no, I love Sam."}, {"time": 6861, "text": "Deeply pleased when he flatters me, but I mean, and he's nice about me, but no, I don't just rely on Sam."}, {"time": 6867, "text": "No, I mean, why would I mind?"}, {"time": 6872, "text": "I mean, maybe it's self selecting."}, {"time": 6874, "text": "If I didn't have the view I had about that, or whatever armory it is that I have on that, I wouldn't do what I did, maybe."}, {"time": 6883, "text": "I mean, have you been to some dark places psychologically because of the challenging ideas you explore?"}, {"time": 6888, "text": "So like significant self doubt, just kind of..."}, {"time": 6892, "text": "I can't say I've been unaffected by everything in my life."}, {"time": 6895, "text": "By any means, that would make me an automaton of some kind."}, {"time": 6901, "text": "There's definitely times I've got things wrong and regretted that."}, {"time": 6905, "text": "There's times I've..."}, {"time": 6910, "text": "There was a period around the time I wrote my book, The Strange Death of Europe, which was a very, very dark time."}, {"time": 6921, "text": "And it wasn't because I was having a dark time in my life, but because of the book I was writing."}, {"time": 6927, "text": "Oh, because of the places you had to go in order to write that book."}, {"time": 6932, "text": "And, well, I was contemplating the end of a civilization."}, {"time": 6935, "text": "So occasionally now I have maybe slightly too pat at this stage, but sometimes readers come up to me in the street or whatever and say, you know, I love The Strange Death of Europe."}, {"time": 6947, "text": "And will say, you know, very depressing book to read, however, I would say, well, you should have tried writing it."}, {"time": 6953, "text": "But it was because, I mean, it has chunks of it, which I'm very proud of in particular about the death of religion, the death of God, the loss of meaning and the void."}, {"time": 6971, "text": "And that's difficult stuff to write about and to grapple with."}, {"time": 6977, "text": "And there is a sort of, I haven't reread that book since it came out, but I think there are passages in it which reveal what I was thinking very clearly in the poetry of it, as it were, as well as the detail."}, {"time": 6994, "text": "But, yeah, I can't say, I'm used to saying what I think and what I see."}, {"time": 7006, "text": "And if there's any pushback I've got from that, I'm completely consoled that I'm saying what I see with my own eyes."}, {"time": 7014, "text": "That's your source of strength, is that you're always seeking the truth as best you see it."}, {"time": 7019, "text": "Well, I can't agree to go along with a lie if I've seen something with my own eyes."}, {"time": 7026, "text": "Do you ever, so speaking of Sam Harris, and I mentioned to you offline, a lot of people, I talk to a lot of smart people in my private life on this podcast, and a lot of them will reference you as their example of a very smart person."}, {"time": 7043, "text": "So given that compliment, do you ever worry that your sort of ego grows to a level where what you think is the truth is no longer the truth?"}, {"time": 7058, "text": "Is this kind of, it blinds you?"}, {"time": 7064, "text": "And also, on top of that, the fact that you stand against the crowd often, that there's part of it that appeals to you, that you like to point out the emperor has no clothes."}, {"time": 7076, "text": "I get a certain thrill from the friction."}, {"time": 7078, "text": "Yeah, that sometimes both your ego and the thrill of friction will get you to deviate from the truth and instead, just look for the friction."}, {"time": 7090, "text": "Could do, could do for sure."}, {"time": 7093, "text": "I try to keep alive to that."}, {"time": 7096, "text": "I mean, early in my career, I realized that, for instance, I didn't want to make enemies unnecessarily, any more than strictly necessary, because there was a very large number of already necessary enemies."}, {"time": 7110, "text": "And I remember once, I won't go into the details, but I already had one sort of thing I'd done that week, and then another thing came out, and I just thought, I can't, I can't do that."}, {"time": 7119, "text": "And I remember thinking, don't be the sort of person who's forever creating storms, and I tried to make sure I wasn't."}, {"time": 7127, "text": "And I think I've pretty much stuck to that."}, {"time": 7131, "text": "But to answer your question, well, the first thing is I'm as confident as I can be that I wouldn't fall into the trap you described."}, {"time": 7141, "text": "Two reasons."}, {"time": 7143, "text": "I mean, one is that I don't think of myself as a wildly intelligent person, partly because I'm very, very aware of the things I know nothing about."}, {"time": 7153, "text": "I mean, for instance, I have almost no knowledge of the details of finance or economic theory."}, {"time": 7166, "text": "I mean, the real details."}, {"time": 7168, "text": "I don't mean the big picture of the kind that we were just discussing earlier, but I have, if you put the periodic table in front of me, the periodic table in front of me, I would struggle to do more than a handful."}, {"time": 7187, "text": "I am very conscious of huge gaps in my knowledge."}, {"time": 7193, "text": "And where I have gaps or chasms, I tend to find that I have a disproportionate admiration for the people who know that stuff."}, {"time": 7201, "text": "Like I'm wildly impressed by people who understand money, really understand it, because I think, how the hell do you do that?"}, {"time": 7209, "text": "And the same thing with biologists, medics, stuff I just know very little about."}, {"time": 7217, "text": "And that's a source of humility for you, just knowing that."}, {"time": 7219, "text": "Yes, I mean, I think, well, I can get on that stuff, but I mean, Jesus, if you got me on the general knowledge."}, {"time": 7225, "text": "I would say that thing, some years ago, there's a thing in the UK called University Challenge."}, {"time": 7229, "text": "And I was asked some years ago on to, there's a sort of psych celebrity, one of former students of the universities or colleges asked to go back for the Christmas special."}, {"time": 7242, "text": "And I was asked to be one of the people from my old college to go back and compete in the sort of celebrity alumni one."}, {"time": 7249, "text": "And the only thing I actually wanted to do, it was go discover the Louis Theroux had been to my college before my time."}, {"time": 7253, "text": "And he was on, he'd agreed to be on the team."}, {"time": 7255, "text": "And I thought, well, I'd love to meet Louis Theroux, that'd be great fun."}, {"time": 7258, "text": "And anyhow, and I said, well, I really don't want to do it."}, {"time": 7261, "text": "And they said, come on, you'd be great."}, {"time": 7263, "text": "I said, I wouldn't, I'd show myself up to be a total asshole and ignoramus."}, {"time": 7267, "text": "And as it was, I sat down my flat and I watched some past episodes of University Challenge."}, {"time": 7274, "text": "I realized I'd have just sat mute for the whole half hour."}, {"time": 7280, "text": "I just couldn't, the first question was about physics."}, {"time": 7283, "text": "And the second one was about, as it was, I watched the one and I could answer the first two or three questions of the one that actually went out because they made it a bit simpler."}, {"time": 7295, "text": "But I mean, I'm terribly conscious of the, and I said to the producers, I said, I can't go on because I mean, I just couldn't answer the questions."}, {"time": 7302, "text": "These unbelievably smart students seem to be able to answer on a whole range of things."}, {"time": 7306, "text": "So I'm perfectly aware of my limitations and... You contemplate your limitations."}, {"time": 7313, "text": "Yeah, and they're forever before me, you know."}, {"time": 7316, "text": "They're not hard to find in every day."}, {"time": 7318, "text": "And then on top of that, I suppose, it's, in a way, you know that line from Rudyard Kipling's alternately brilliant and slightly nauseating poem, If?"}, {"time": 7334, "text": "You just enjoy a good poem, can you?"}, {"time": 7336, "text": "Well, no, it's not, I can enjoy a great poem."}, {"time": 7341, "text": "But I mean, a good poem."}, {"time": 7343, "text": "This is, you know, slightly off."}, {"time": 7345, "text": "But, well, it's up to you."}, {"time": 7346, "text": "This goes to your criticism of Dostoevsky."}, {"time": 7349, "text": "Take Douglas's criticism with a grain of salt, so."}, {"time": 7354, "text": "Maybe I've read it too many memorial services and things."}, {"time": 7357, "text": "But that line is a good piece of advice."}, {"time": 7361, "text": "If you can learn to meet triumph and disaster and greet these two imposters just the same."}, {"time": 7369, "text": "It's a good line."}, {"time": 7370, "text": "It's skipping off an amazing turn of line."}, {"time": 7373, "text": "But I do think that it's a very sensible thing to try to greet triumph and disaster and regard them as imposters and greet them just the same."}, {"time": 7383, "text": "And actually, anyone who knows me knows that I never, partly it's because I have a sort of belief in the old gods and that the moment that I thought that I was at the moment of triumph, the fates would hitch up their skirts and run at me at a million miles an hour."}, {"time": 7400, "text": "But it's also because, anyone who knows me knows I never have a moment when I say, that's just great."}, {"time": 7412, "text": "I feel totally fulfilled and victorious."}, {"time": 7417, "text": "I mean, it happened to me recently when the war in the West went straight to number one in the bestseller list."}, {"time": 7423, "text": "How long did that last in terms of your self satisfaction?"}, {"time": 7427, "text": "Not even for a brief moment?"}, {"time": 7431, "text": "When I first saw that it was selling, I had that moment of elation."}, {"time": 7435, "text": "I thought, good, I've done it, it's out."}, {"time": 7439, "text": "And I did have a moment of elation then, definitely."}, {"time": 7443, "text": "But it doesn't last, partly because I tell myself it mustn't last."}, {"time": 7447, "text": "Because as you said, fate hitches up its skirt."}, {"time": 7452, "text": "Is that skirts?"}, {"time": 7454, "text": "I don't, this, you brits with your poetry, even when it's nauseating."}, {"time": 7460, "text": "As of 2022, this year, what's your final analysis of the political leadership and the human mind and the human being of Donald Trump?"}, {"time": 7472, "text": "I sort of avoided this for years."}, {"time": 7474, "text": "Just talking about Trump."}, {"time": 7475, "text": "Tried to avoid talking about Trump for years."}, {"time": 7477, "text": "Same reason I tried to avoid writing about Brexit."}, {"time": 7479, "text": "Do you think that Trump, just sorry on a small tangent, do you think that Trump's story is over or are we just done with volume one?"}, {"time": 7488, "text": "The people I know who know him say that he's running."}, {"time": 7493, "text": "And I think that in general, Republicans have to, do have a choice in front of them."}, {"time": 7502, "text": "A one friend put it to me recently, said, you've got to go in with your toughest fighter."}, {"time": 7508, "text": "And I understand that instinct and I also think it's a very dangerous instinct because what if your toughest fighter is also your biggest liability?"}, {"time": 7523, "text": "What's the best way to get out the Democrat vote in 2024 than to have Donald Trump running?"}, {"time": 7528, "text": "And the people that are doing the war in the West, they're pretty tough fighters."}, {"time": 7533, "text": "And I'm cautious about this because I know every way I tread it's dangerous, but let me just be frank."}, {"time": 7541, "text": "Tread gracefully."}, {"time": 7542, "text": "I'll tread as gracefully as I can."}, {"time": 7544, "text": "My Wellington boots, my galoshes."}, {"time": 7549, "text": "Here's the thing, I think everybody knows what Trump is."}, {"time": 7554, "text": "I think we all knew for years."}, {"time": 7556, "text": "And I feel sorry for the conservatives who had to pretend that he was something he wasn't."}, {"time": 7562, "text": "I felt sorry for the ones who had to pretend that for instance he was some devout Christian or a man of faith or a man of great integrity or all of these sorts of things."}, {"time": 7576, "text": "Because in the public eye for years, it'd be obvious that wasn't the case."}, {"time": 7580, "text": "But he has something extraordinary."}, {"time": 7586, "text": "One thing is a method of communication that you've just got to say was unbelievable."}, {"time": 7592, "text": "In one fundamental way that you can't look away for some reason."}, {"time": 7596, "text": "Can't look away."}, {"time": 7596, "text": "I mean, I mean watching him clear everyone out of the way in 2016 was thrilling because those people needed clearing away."}, {"time": 7607, "text": "You know, I mean, it's just horrifying."}, {"time": 7609, "text": "What America is going to give us another Bush?"}, {"time": 7613, "text": "What's so great about this family?"}, {"time": 7617, "text": "America is going to give us another Clinton."}, {"time": 7618, "text": "We're going to get to choose any Clinton on the Bush."}, {"time": 7621, "text": "Mark Stein said, whatever, we'll just wait for the day the Clintons and the Bushes into marry and then we can really have a monarchy again."}, {"time": 7628, "text": "So I was very pleased to see him clear them away."}, {"time": 7632, "text": "I was very pleased to see him sort of raise some of the issues that needed raising."}, {"time": 7638, "text": "I thought it was a sort of breath of fresh air and I wished it wasn't him doing it."}, {"time": 7644, "text": "And then there was a question of him governing and it was just perfectly clear he didn't know how to govern."}, {"time": 7650, "text": "What he did have, however, what he does have is an incredible ability to fight."}, {"time": 7655, "text": "And some of the forces he was arraigned against were arraigned against him."}, {"time": 7658, "text": "My gosh, they would have taken down anyone else."}, {"time": 7661, "text": "I mean, they'd have probably done some similar BS against Ted Cruz if he, you know, or Marco Rubio."}, {"time": 7671, "text": "You know, they'd have said, some people admitted, they'd have accused all these people of racism and misogyny and everything else as well, just like they did Mitt Romney, just like they did John McCain."}, {"time": 7681, "text": "But Trump was the one ugly enough and bruisey enough to fight."}, {"time": 7686, "text": "And also a willingness or a lack of willingness to play sort of the civil game of politics."}, {"time": 7698, "text": "You know, at a party when politeness gets you in trouble."}, {"time": 7703, "text": "You show up and everybody's polite and you just out of momentum want to be being polite and all of a sudden you're on an island with Jeffrey Epstein and it gets you into a huge amount of trouble."}, {"time": 7714, "text": "But so Trump has these sort of extraordinary qualities, but I just, you know, look, he screwed up during his time in office because he didn't achieve as much as he should have done."}, {"time": 7724, "text": "And you could say that about every president, but I refuse to acknowledge that two years when he had both houses in the beginning, he just didn't know what levers to pull."}, {"time": 7732, "text": "You know, I mean, he was sitting in the office behind the Oval Office tweeting, watching the news."}, {"time": 7738, "text": "I'm sorry, that's not a president."}, {"time": 7740, "text": "And he couldn't fill and didn't fill positions because people knew, I mean, people who were very loyal to him, he would just, you know, he'd get them to do something loyal and then destroy them."}, {"time": 7752, "text": "And I think, and then we get onto the thing about, and here we get onto the, you know, what of course is very, very fractious terrain, but, you know, I covered the 2020 election and I was traveling all around the states and I went to Trump rally and all sorts of stuff."}, {"time": 7767, "text": "And I, I mean, I was in DC on election night and it got very ugly at one point in so called Black Lives Matter Plaza."}, {"time": 7778, "text": "When it looked like Trump might win, when Florida came in and got really, I could feel the air were very, very heated and like some Antifa people started getting into black lock and this sort of stuff."}, {"time": 7788, "text": "And I thought this town is gonna burn, you know, if Trump wins."}, {"time": 7793, "text": "And in the aftermath of the vote, I was willing to hang around in Washington for a bit and then I saw what it was gonna drag on."}, {"time": 7799, "text": "And I saw some of his people and others and people told me they had great evidence of vote rigging and all this sort of thing."}, {"time": 7805, "text": "And I'm afraid I'm one of those people who doesn't believe that the evidence that they presented is good enough to justify the claim that he won the election."}, {"time": 7814, "text": "And I, and people say, have you seen 2000 mules and have you seen, look, the evidence isn't there, that the election was won by Donald Trump."}, {"time": 7824, "text": "And I think that what he did on January the 6th was unbelievably dangerous."}, {"time": 7832, "text": "And, you know, here it is possible for us to hold two ideas in our head at the same time."}, {"time": 7837, "text": "January the 6th was not nothing, nor was it an insurrection and attempt to stage a coup."}, {"time": 7844, "text": "And there's a vanishing number of people in the US."}, {"time": 7849, "text": "It was Eric Weinstein who said that the, it's like, this is the roof that you have to walk along."}, {"time": 7856, "text": "And like the sides are very steep if you fall off either side."}, {"time": 7862, "text": "Is there some sense, given the forces that are waging war in the West, you said this feeling, perhaps because of Antifa or something else, that this town is gonna burn and maybe a continued feeling that this town is going to burn with the January 6th events."}, {"time": 7882, "text": "Are you worried about the future of the United States in the coming years because of the feeling of escalation?"}, {"time": 7893, "text": "Is that just a war of Twitter?"}, {"time": 7896, "text": "Or is there a real brewing of something?"}, {"time": 7900, "text": "Oh, it's real."}, {"time": 7901, "text": "And how, well, let me then respond to that."}, {"time": 7905, "text": "How, what is the hopeful?"}, {"time": 7907, "text": "If you 10 years from now look back at the United States and say we turned it around, what would be the reason?"}, {"time": 7918, "text": "What would be the ways, the mechanisms that we do so?"}, {"time": 7921, "text": "Tell you, since I wrote this book, there are two things in particular that I've been really pleased that a specific type of specialist has approached me on to say that things I've written about actually have more application than I realized."}, {"time": 7937, "text": "One is the gratitude issue."}, {"time": 7939, "text": "A number of people have approached me who have gone through AA, Alcoholics Anonymous."}, {"time": 7945, "text": "They sometimes say, have you ever been to AA?"}, {"time": 7947, "text": "And that's a bit of a personal question."}, {"time": 7954, "text": "But they say, but the reason they ask it is because they say, well, because if you go to drug rehabilitation or Alcoholics Anonymous, Norm Macdonald said, it doesn't sound very anonymous."}, {"time": 7965, "text": "You stand up in a room, you say your name and you tell everyone the worst things you've ever done."}, {"time": 7968, "text": "Sounds the opposite of anonymous."}, {"time": 7970, "text": "Anyhow, but they say, look, because if you go to these things, apparently you're asked to, as part of your recovery, say what you're grateful for, like list what you're grateful for."}, {"time": 7982, "text": "I didn't know that by the way, until the book was out."}, {"time": 7985, "text": "And so that turned out to have more application than I knew."}, {"time": 7988, "text": "The other thing though, is that I say that it's absolutely crucial in America that we try to find things that we agree on."}, {"time": 7994, "text": "And a couple of times since the book came out, I've been approached by people who are marriage counselors."}, {"time": 8000, "text": "But we've also said, have you ever been through marriage counseling?"}, {"time": 8002, "text": "And again, that's a very personal question."}, {"time": 8005, "text": "Stop asking me personal questions."}, {"time": 8007, "text": "No, but they said, and I said, well, why?"}, {"time": 8010, "text": "Because this is one of the things that we do in couples therapy, is try to find things you agree on."}, {"time": 8019, "text": "And I think this is very important in America."}, {"time": 8025, "text": "And it's made much harder by the fact, and I've said this many times, but forgive me if I'm repeating myself, but it's made much harder by the fact that having different opinions is very last century."}, {"time": 8037, "text": "Now we all have different facts, or at least the two sides have different facts."}, {"time": 8042, "text": "One half of the country roughly, or let's say 40%, 30%, whatever you want to put it, with a tired minority in the middle."}, {"time": 8051, "text": "One segment of the country believes that Hillary Clinton won the 2016 election and that the Russians interfered and got Donald Trump into power."}, {"time": 8059, "text": "Another half of the country believes that Donald Trump won the 2020 election."}, {"time": 8063, "text": "If you can't agree on who wins elections, it's very hard to see what you agree on as a country."}, {"time": 8067, "text": "That's one of the reasons I mind the war on American history and Western history, is one of the things you have to agree on is at least some attitude towards your past."}, {"time": 8076, "text": "You don't have to agree on everything."}, {"time": 8077, "text": "But the public square has to have public heroes who are agreed to be heroes to some extent, warts and all."}, {"time": 8085, "text": "If you don't have that, if actually you think for instance, half the country thinks the founding fathers were pretty good, the other half thinks they were absolutely rotten, racist and so on."}, {"time": 8095, "text": "If half the country basically thinks it would have been better if Columbus had taken a different turn, never found America, gone back home and said, I don't know, nothing out there, that would have been better."}, {"time": 8106, "text": "And the other half's pretty glad in the end that we've got America."}, {"time": 8113, "text": "You've got to agree on something."}, {"time": 8116, "text": "And I just see in America, I do think we've got to try to find things to agree on, like a reasonable attitude towards the past."}, {"time": 8123, "text": "That's why that matters."}, {"time": 8124, "text": "And again, I stress, I'm not trying to say that everything in the American past was good."}, {"time": 8129, "text": "God knows that wouldn't stand up to a second of scrutiny or self scrutiny."}, {"time": 8133, "text": "But nor was it all bad."}, {"time": 8135, "text": "This wasn't a country formed in sin and in an eradicable sin."}, {"time": 8140, "text": "It wasn't founded in 1619 in order to make the country wicked and incapable of escaping that wickedness."}, {"time": 8149, "text": "These are things that will matter enormously in the years ahead, because if you can't agree on anything, including who your heroes are, the whole thing is just one massive division and we'll see what I think we're already seeing, which is people basically going to states where it's more like the life they want to live."}, {"time": 8169, "text": "And some people say to me, well, that's okay."}, {"time": 8171, "text": "And the genius of the founding is that it allows for that."}, {"time": 8176, "text": "That's possible, but it's also, it eradicates part of what has been American public life, which is the ability to look at each other and discuss face to face."}, {"time": 8186, "text": "And I see things like this bomb placed under America the other week with the Supreme Court League, the draft league as being just a further example of that."}, {"time": 8197, "text": "I'm very, very worried about it in America."}, {"time": 8199, "text": "And because if America screws up everything, everything else in the world goes."}, {"time": 8205, "text": "Yeah, there's the degree to which America is still the beacon of these ideas on which the country was founded and has been able to live out in better and better forms, sort of live out the actual ideals of the founding principles versus like."}, {"time": 8223, "text": "And with the desire to improve."}, {"time": 8226, "text": "An imperfect union."}, {"time": 8228, "text": "Yeah, well, as I generally have hope that people want to sort of, in terms of gratitude, people are aware of how good it feels to be grateful."}, {"time": 8240, "text": "It's a better life psychologically."}, {"time": 8242, "text": "The resentment is a thing that destroys you from within."}, {"time": 8245, "text": "So I just feel that people will long for that and will find that."}, {"time": 8251, "text": "And that's the American way."}, {"time": 8253, "text": "Some of the division that we reveal now has to do with new technologies like social media."}, {"time": 8258, "text": "That kind of is a small kind of deviation from the path we're on because it's a new, we've got a new toy, just like nuclear weapons."}, {"time": 8267, "text": "Yeah, which are relatively new."}, {"time": 8270, "text": "But we need to find reasonable attitudes towards these things."}, {"time": 8274, "text": "And that's why I say it matters how you and my feedback on social media, because we're all going through it to some extent."}, {"time": 8282, "text": "Yeah, we're learning."}, {"time": 8283, "text": "And we're learning."}, {"time": 8283, "text": "And we've got to learn how to do this without going mad."}, {"time": 8288, "text": "I say this, it was my minimalist call to friends in this era was the main job is not to go insane."}, {"time": 8300, "text": "And yeah, like walk towards sanity."}, {"time": 8302, "text": "Because I'm sure there's a Hunter S. Thompson quote in there, like insanity on the weekends can be at least fun."}, {"time": 8310, "text": "Okay, do you have advice for young people that just put down their TikTok and are listening to this podcast in high school and college about how to have a career, how to have a life they can be proud of?"}, {"time": 8327, "text": "It's a very broad question."}, {"time": 8328, "text": "But of course, I mean, I can give specific advice to people who want to be writers and so on, but that's a bit niche, maybe."}, {"time": 8336, "text": "Well, writers will be very interesting, sorry to interrupt."}, {"time": 8338, "text": "Also how to put your ideas down on paper and think through the ideas, develop them and have the guts to go to a large audience, especially when the ideas are sort of controversial or dangerous or difficult."}, {"time": 8350, "text": "Well, the main thing to do is to read."}, {"time": 8353, "text": "When I was a schoolboy, I'd ever have a book in my pocket, the side pocket of my jacket, only side pocket, and would read."}, {"time": 8361, "text": "And that wasn't just because I was swatish in some way, but because I discovered probably at some point in my early teens, I discovered something."}, {"time": 8372, "text": "I wrote about this once."}, {"time": 8374, "text": "I discovered that books were dangerous, which was a thrilling discovery."}, {"time": 8384, "text": "I discovered that they could contain anything."}, {"time": 8387, "text": "And also people didn't know what you were reading."}, {"time": 8390, "text": "I remember I get far too young an age, I read The Doors of Perception of Aldous Huxley, and I didn't make head or tail of it probably, but I knew that it was about something really interesting and dangerous."}, {"time": 8406, "text": "And I thought constantly when I read poetry or read history, I think I was just constantly thrilled and wanted to know more."}, {"time": 8418, "text": "And if you wanna become a writer, you have to be a reader."}, {"time": 8426, "text": "You have to read the best stuff."}, {"time": 8429, "text": "And obviously people disagree or agree on what that is, and you'll find the people that really impress you."}, {"time": 8437, "text": "But I know that I just came across certain writers who just knocked me off my feet."}, {"time": 8442, "text": "And when you find those people, read everything and cling on to them and find other people like that, find other writers like that, people that are connected by history or scholarship or circles or whatever."}, {"time": 8461, "text": "For you, was it fiction or nonfiction?"}, {"time": 8463, "text": "Is there a particular books that you just remember or just give you pause?"}, {"time": 8467, "text": "Well, I remember that the first book that absolutely threw me was the Lord of the Flies of William Golding, which used to be a signed text and everyone's a bit snotty about because it's so popular."}, {"time": 8479, "text": "But I was thrown because I think it was the first adult book I read in that I had been used to the world of children's literature of everything ends up fine in the end, the lost all get found."}, {"time": 8494, "text": "And this was the first book I read where that's not the case the world turns out differently."}, {"time": 8499, "text": "And I remember for days afterwards, I was just in a state of shock."}, {"time": 8506, "text": "I couldn't believe what I'd just discovered and partly because I sort of intuited it must be true."}, {"time": 8515, "text": "And of course, that is not to say that the Lord of the Flies lots of scholarship on what children do in this situation of being on the island when they do congregate and anyhow."}, {"time": 8524, "text": "But yes, that was a sort of introduction to the adult world and it was shocking and thrilling and I wanted more of it."}, {"time": 8534, "text": "It was dangerous."}, {"time": 8535, "text": "And it was dangerous."}, {"time": 8536, "text": "And then of course, when I became interested in sex, let alone when I realized I was gay, I realized books were a very, very good way to learn about what I was."}, {"time": 8545, "text": "And that was even more dangerous in a way."}, {"time": 8548, "text": "And I thought, I mean, nobody knows what I know."}, {"time": 8553, "text": "You discovered sex, that was an invention in books?"}, {"time": 8557, "text": "No, what I mean is, nobody, no, no, no, no."}, {"time": 8559, "text": "What I mean is that one of the things that gay people have when they're growing up is that you have this terribly big secret and you don't think the world will ever know, you hope the world will never know."}, {"time": 8569, "text": "And it's been called by one psychologist, the little boy with a big secret."}, {"time": 8576, "text": "And so if you discover that other people have the same secret, there's a sort of, thank God for that."}, {"time": 8584, "text": "But I mean, that's just a version of what everybody gets in reading in a way, which is the thrill of discovery that somebody else thought something you thought only you'd thought."}, {"time": 8595, "text": "I mean, one of the greatest thrills in all of literature is when a voice comes from across the centuries and seems to leave a handprint, you know."}, {"time": 8604, "text": "And makes you feel a little bit less alone because somebody else feels, sees the world the same way, is the same way."}, {"time": 8611, "text": "That's what C.S."}, {"time": 8611, "text": "Lewis is said to have said, we read to know we're not alone."}, {"time": 8617, "text": "But we don't only read to know we're not alone, we read to become other people."}, {"time": 8622, "text": "I mean, I think I saw in books a version of the life I wanted to live and then I decided to live it."}, {"time": 8628, "text": "And I'm fortunate enough to have done so."}, {"time": 8632, "text": "I wanted to live in the world of ideas and books and debate."}, {"time": 8638, "text": "I wanted to live in the debates of my time, you know."}, {"time": 8641, "text": "And I remember when, like a lot of people, I read Auden when I was young."}, {"time": 8646, "text": "And, you know, certain lines obviously stuck with me."}, {"time": 8649, "text": "But that poem of his which everybody, you know, knows and which he hated, September the 1st, 1939, I remember certain lines in that just like whacked me."}, {"time": 8662, "text": "What's that one, you know, sitting on a dive and for a second or three, degraded and alone, at the end of a low, dishonest decade."}, {"time": 8671, "text": "Of course, there's a problem with that line, which is you kind of want to be living at the end of a low, dishonest decade as well."}, {"time": 8676, "text": "It sounds sort of cool in a way."}, {"time": 8678, "text": "You know, you're the only person who sees it."}, {"time": 8681, "text": "But, so yeah, anyhow, that's the diversion."}, {"time": 8683, "text": "But the point is, if you want to be a writer, you've got to be a reader."}, {"time": 8687, "text": "And apart from anything else, you discover the lilt of language and the things you can do."}, {"time": 8693, "text": "And I've read people who, and I still do, I think, my God, I didn't know, how did you do that?"}, {"time": 8700, "text": "In fact, books for me now, and articles and other things, fall into two categories."}, {"time": 8704, "text": "One is, I know how you did that."}, {"time": 8707, "text": "And the other is, I don't know how you did that."}, {"time": 8710, "text": "And the best feeling as a writer is when you do the second one."}, {"time": 8716, "text": "And it happens occasionally in my writing life."}, {"time": 8719, "text": "Will you almost like return to something you've written or like right after you write it?"}, {"time": 8722, "text": "No, the moment you write it."}, {"time": 8723, "text": "You wonder, how did I do that?"}, {"time": 8726, "text": "That's the most, I've never said that before."}, {"time": 8729, "text": "That's the happiest thing in writing."}, {"time": 8732, "text": "Very occasionally, it sounds, but I've occasionally finished something."}, {"time": 8737, "text": "Funny enough, it happened some years ago in a long piece I wrote about the artist, Basquiat."}, {"time": 8744, "text": "I finished the piece and I gasped."}, {"time": 8747, "text": "I didn't know, because that's also a thing with writing, is you, it's not, sometimes people say you need to write in order to know what you think."}, {"time": 8758, "text": "Sometimes that's a very bad piece of advice for some writers who don't know what they think and it's not gonna become clearer if they just start typing."}, {"time": 8769, "text": "But sometimes it is true that you, there's a thought that's just waiting there and a clarity that comes across and suddenly the sentence emerges in your brain."}, {"time": 8780, "text": "And by the time you typed it, you just go, yes."}, {"time": 8785, "text": "That's the greatest feeling as a writer."}, {"time": 8787, "text": "Almost like it came from somewhere else."}, {"time": 8789, "text": "That's what Bakunin says about what's the moment."}, {"time": 8794, "text": "It's Tom Stoppard's favorite quote about Bakunin saying what happens in the moment where the writer's pen, when he pauses, where does he go in that moment?"}, {"time": 8809, "text": "Because I think the answer to that question will help us explain consciousness and all those other weird things about the human mind."}, {"time": 8818, "text": "So that was advice for writers."}, {"time": 8819, "text": "I didn't really give any advice for people in general."}, {"time": 8822, "text": "Is that, oh, you wanna give health advice?"}, {"time": 8826, "text": "To your channel, Churchill?"}, {"time": 8827, "text": "No, I don't wanna give health advice."}, {"time": 8830, "text": "Because you implied that Churchill was one of your early guides in that aspect."}, {"time": 8835, "text": "So when you discovered your sexuality, let me ask about love."}, {"time": 8839, "text": "Far too personal of a question to ask a Brit."}, {"time": 8845, "text": "But what was that like?"}, {"time": 8848, "text": "And broadly speaking, what's the role of love in the human condition?"}, {"time": 8855, "text": "Sex and love."}, {"time": 8857, "text": "And for you personally, discovering that you were and maybe telling the world that you were gay."}, {"time": 8864, "text": "I'm very perilously personal."}, {"time": 8868, "text": "I do actually have a sort of rule that I don't talk about in my personal life."}, {"time": 8871, "text": "Rules are meant to be broken."}, {"time": 8872, "text": "Okay, well I'll break it a little bit."}, {"time": 8877, "text": "One of the ways in which growing up and realizing you're gay differs from growing up and being straight is that it's almost inevitable that your first passions will be unrequited."}, {"time": 8890, "text": "Oh wow, I never thought about that, yeah."}, {"time": 8893, "text": "Now that's not to say, there's plenty of unrequited love among young men for young women, young women for young men, plenty of that."}, {"time": 8901, "text": "But it's almost inevitable if you're gay that your first passions will be totally unrequited."}, {"time": 8910, "text": "Because the odds are that the person in question will not be gay."}, {"time": 8913, "text": "So the experience of love is mostly heartbreak."}, {"time": 8917, "text": "It's heartbreak and disappointment."}, {"time": 8920, "text": "Heartbreak can be beautiful too, it's formative."}, {"time": 8923, "text": "Well again, it comes back to the thing if you're a writer or something, that you can always do something with it."}, {"time": 8928, "text": "That's why all writers are sort of not to be trusted."}, {"time": 8933, "text": "I didn't trust you the moment you walked in here."}, {"time": 8936, "text": "No, I mean, it's a famous problem with writers because you always think, well I could use that."}, {"time": 8946, "text": "It's a dangerous thing and all writers should be aware."}, {"time": 8948, "text": "It's almost like a drug, right?"}, {"time": 8950, "text": "No, it's not like a drug."}, {"time": 8951, "text": "It's the fear that all things, even the greatest suffering could be material."}, {"time": 8959, "text": "What's the danger in that exactly?"}, {"time": 8962, "text": "That seeing the material in the human experience, you don't experience it fully?"}, {"time": 8966, "text": "You don't experience it fully and you might be using it."}, {"time": 8970, "text": "I had a friend who wrote a poem about a friend who died in a motorcycle accident in Sydney in the 60s."}, {"time": 8976, "text": "And he said he knew at the moment he was told about his friend's death."}, {"time": 8979, "text": "A tiny bit of him thought I could use this for a poem."}, {"time": 8982, "text": "And he did and the poem was wonderful."}, {"time": 8983, "text": "But there's always that slight guilt for writers of am I going to use that?"}, {"time": 8988, "text": "Anyhow, that's a diversion."}, {"time": 8990, "text": "Life is full of guilty pleasures and I think that's one of them."}, {"time": 8992, "text": "Because if you feel that guilt, really what you're doing is you're capturing that moment and you're going to impact the lives of many, many people by writing about that moment because it's going to stimulate something that resonates with those people because they had similar kinds of memories about a loss and a passion towards somebody that they had to lose."}, {"time": 9011, "text": "So yes, but there's a good sign, perhaps."}, {"time": 9015, "text": "More obvious perhaps problem is reporting from war zones or bad places and wanting to find bad stories because it's useful."}, {"time": 9024, "text": "And there is a definite guilt you get from that sort of thing."}, {"time": 9028, "text": "Like the worse the situation, the more useful."}, {"time": 9030, "text": "Anyhow, no, so that's sort of the only difference that happens from growing up being gay."}, {"time": 9036, "text": "And it means that most, certainly in my generation, most gay men came to sexual or romantic maturity later."}, {"time": 9046, "text": "And there's lots of explanations of that maybe being one of the reasons for perceived or otherwise promiscuity among gay men, which is, I think, more easily persuaded by the fact that gay men behave like men would if women were men."}, {"time": 9064, "text": "That's one explanation, but it's both a feature and a bug that you come to sexual flourishing later in life."}, {"time": 9072, "text": "That could be seen as a, in the trajectory of human life, that could be a positive or a negative."}, {"time": 9078, "text": "But what's, broadly speaking, is the role of love in the human condition, Douglas?"}, {"time": 9085, "text": "Well, it's the nearest thing we have to finding the point."}, {"time": 9090, "text": "What is the point?"}, {"time": 9093, "text": "So what's the meaning is a hard one, of course."}, {"time": 9096, "text": "Where is the meaning is slightly easier."}, {"time": 9100, "text": "And I'd say that everyone can find that."}, {"time": 9103, "text": "You gravitate towards the places you find meaning."}, {"time": 9107, "text": "Now, there's a conservative answer to this, which is quite useful, and it's certainly more useful than any others, because the conservative answer is find meaning where people have found it before, which is a very, very good answer."}, {"time": 9119, "text": "If your ancestors have found meaning in a place of worship or a particular canon of work, go there, because it's been proven by time to be able to give you the goods."}, {"time": 9136, "text": "Much more sensible than saying, hey, I don't know, discover new ways of meaning."}, {"time": 9144, "text": "But love is, love is probably the nearest thing we can have to the divine on Earth."}, {"time": 9156, "text": "And of course, the problem of what exactly, what type of love we mean is an issue."}, {"time": 9163, "text": "Well, that goes to the fact that you don't like definitions anyway."}, {"time": 9167, "text": "I do like definitions."}]}]