[{"title": "Niall Ferguson: History of Money, Power, War, and Truth | Lex Fridman Podcast #239", "id": "xF6x1ftN-H4", "quotes": [{"time": 366, "text": "And perhaps we were even worse, but it was so not career ending to be an absolutely insufferable, obnoxious undergraduate then."}, {"time": 381, "text": "Today, if people like us exist today, they must live in a state of constant anxiety that they're going to be outed for some heretical statement that they made five years ago on social media."}, {"time": 395, "text": "So part of what motivates me is the desire to give the me's of today a shot at free thinking and really, I'd call it aggressive learning, learning where you're really pushed."}, {"time": 414, "text": "And I just think that stopped happening on the major campuses because whether at Harvard where I used to teach or at Stanford where I'm now based, I sense a kind of suffocating atmosphere of self censorship that means people are afraid to take even minimal risk in class."}, {"time": 432, "text": "I mean, just take, for example, a survey that was published earlier this year that revealed this is of undergraduates in four year programs in the US."}, {"time": 443, "text": "85% of self described liberal students said they would report a professor to the university administration if he or she said something they considered offensive."}, {"time": 453, "text": "And something like 75% said they do it to a fellow undergraduate."}, {"time": 458, "text": "That's the kind of culture that's evolved in our universities."}, {"time": 461, "text": "So we need a new university in which none of that is true, in which you can speak your mind, say stupid things, get it completely wrong and live to tell the tale."}, {"time": 472, "text": "There's a lot more going on, I think, because when you start thinking about what's wrong with a modern university, many, many more things suggest themselves."}, {"time": 481, "text": "And I think there's an opportunity here to build something that's radically new in some ways and radically traditional in other ways."}, {"time": 490, "text": "For example, I have a strong preference for the tutorial system that you see at Oxford and Cambridge, which is small group teaching and highly Socratic in its structure."}, {"time": 501, "text": "I think it'd be great to bring that to the United States where it doesn't really exist."}, {"time": 505, "text": "But at the same time, I think we should be doing some very 21st century things, making sure that while people are reading and studying classic works, they're also going to be immersed in the real world of technological innovation, a world that you know very well."}, {"time": 524, "text": "And I'd love to get a synthesis of the ancient and classical, which we're gradually letting fade away with the novel and technological."}, {"time": 535, "text": "So we wanna produce people who can simultaneously talk intelligently about Adam Smith, or for that matter, Shakespeare or Proust, and have a conversation with you about where AI is going and how long it will be before I can get driven here by a self driving vehicle, allowing me to have my lunch and prepare rather than focus on the other crazy people on the road."}, {"time": 562, "text": "So that's the dream that we can create something which is partly classical and partly 21st century."}, {"time": 569, "text": "And we look around and we don't see it."}, {"time": 571, "text": "If you don't see an institution that you really think should exist, I think you have a more responsibility to create it."}, {"time": 578, "text": "So you're thinking including something bigger than just liberal education, also including science, engineering and technology."}, {"time": 586, "text": "I should also comment that I mostly stay out of politics and out of some of these aspects of liberal education that's kind of been the most controversial and difficult within the university."}, {"time": 599, "text": "But there is a kind of ripple effect of fear within that space into science and engineering and technology that I think has a nature that's difficult to describe."}, {"time": 616, "text": "It doesn't have a controversial nature."}, {"time": 617, "text": "It just has a nature of fear where you're not, you mentioned saying stupid stuff as a young 20 year old."}, {"time": 627, "text": "For example, deep learning, machine learning is really popular in the computer science now as an approach for creating artificial intelligence systems."}, {"time": 636, "text": "It is controversial in that space to say that anything against machine learning, saying, sort of exploring ideas that saying this is going to lead to a dead end."}, {"time": 649, "text": "Now, that takes some guts to do as a young 20 year old within a classroom to think like that, to raise that question in a machine learning course."}, {"time": 659, "text": "It sounds ridiculous because it's like who's going to complain about this?"}, {"time": 663, "text": "But the fear that starts in a course on history or on some course that covers society, the fear ripples and affects those students that are asking big out of the box questions about engineering, about computer science."}, {"time": 682, "text": "And there's a lot, there's like linear algebra that's not going to change, but then there's like applied linear algebra, which is machine learning."}, {"time": 690, "text": "And that's when robots and real systems touch human beings."}, {"time": 694, "text": "And that's when you have to ask yourself these difficult questions about humanity, even in the engineering and science and technology courses."}, {"time": 702, "text": "And these are not separate worlds in two senses."}, {"time": 706, "text": "I've just taken delivery of my copy of the book that Eric Schmidt and Henry Kissinger have coauthored on artificial intelligence, the central question of which is, what does this mean for us broadly?"}, {"time": 719, "text": "But they're not separate worlds in C.P."}, {"time": 719, "text": "Snow's sense of the chasm between science and arts, because on a university campus, everything is contagious from a novel coronavirus to the behaviors that are occurring in the English department."}, {"time": 738, "text": "Those behaviors, if denunciation becomes a norm, undergraduate denounces professor, teaching assistant denounces undergraduate, those behaviors are contagious and will spread inextricably first to social science and then to natural sciences."}, {"time": 752, "text": "And I think that's part of the reason why when this started to happen, when we started to get the origins of disinvitation and cancel culture, it was not just a few conservative professors in the humanities who had to worry, everybody had to worry, because eventually it was going to come even to the most apparently hard stem part of the campus."}, {"time": 778, "text": "This is something Nicholas Christakis should look at because he's very good at looking at the way in which social networks like the ones that exist in a university can spread everything."}, {"time": 788, "text": "But I think when we look back and ask, why did wokeism spread so rapidly and rapidly out of humanities into other parts of universities?"}, {"time": 797, "text": "And why did it spread across the country and beyond the United States to the other English speaking universities?"}, {"time": 803, "text": "It's because it's a contagion."}, {"time": 805, "text": "And these behaviors are contagious."}, {"time": 808, "text": "The president of a university I won't name said to me that he receives every day at least one denunciation, one call for somebody or other to be fired for something that they said."}, {"time": 823, "text": "That's the crazy kind of totalitarianism light that now exists in our universities."}, {"time": 830, "text": "And of course the people who want to downplay this say, oh, well, there only have been a hundred and something in disinvitations or, oh, there really aren't that many cases."}, {"time": 837, "text": "But the point is that the famous events, the events that get the attention are responsible for a general chilling that as you say, spreads to every part of the university and creates a very familiar culture in which people are afraid to say what they think."}, {"time": 853, "text": "Self censorship, look at the heterodox academy data on this grows and grows."}, {"time": 857, "text": "So now a majority of students will say, this is clear from the latest heterodox academy surveys, we are scared to say what we think in case we get denounced, in case we get canceled."}, {"time": 868, "text": "But that's just not the correct atmosphere for a university in a free society."}, {"time": 873, "text": "To me, what's really creepy is how many of the behaviors I see on university campuses today are reminiscent of the way that people used to behave in the Soviet Union or in the Soviet block or in Maoist China."}, {"time": 887, "text": "The sort of totalitarianism light that I think we're contending with here, which manifests itself as denunciations, people informing on superiors."}, {"time": 899, "text": "Some people using it for career advantage."}, {"time": 902, "text": "Other people reduced to helpless desperate apology to try to exonerate themselves."}, {"time": 909, "text": "People disappearing metaphorically, if not literally."}, {"time": 912, "text": "All of this is so reminiscent of the totalitarian regimes that I studied earlier in my career that it makes me feel sick."}, {"time": 920, "text": "And what makes me really feel sick is that the people doing this stuff, the people who write the letters of denunciation are apparently unaware that they're behaving exactly like people in Stalin's Soviet Union."}, {"time": 931, "text": "They don't know that."}, {"time": 932, "text": "So they clearly have, there's been a massive educational failure."}, {"time": 936, "text": "If somebody can write an anonymous or non anonymous letter of denunciation and not feel shame."}, {"time": 941, "text": "I mean, you should feel morally completely contaminated as you're doing that, but people haven't been taught the realities of totalitarianism."}, {"time": 949, "text": "For all these reasons, I think you need to try at least to create a new institution where those pathologies will be structurally excluded."}, {"time": 961, "text": "So maybe a difficult question."}, {"time": 964, "text": "Maybe you'll push back on this, but you're widely seen politically as a conservative."}, {"time": 969, "text": "Hoover Institution is politically conservative."}, {"time": 972, "text": "What is the role of politics at the University of Austin?"}, {"time": 975, "text": "Because some of the ideas, people listening to this, when they hear the ideas you're expressing, they may think there's a lean to these ideas."}, {"time": 983, "text": "There's a conservative lean to these ideas."}, {"time": 986, "text": "Is there such a lean?"}, {"time": 988, "text": "There will certainly be people who say that because the standard mode of trying to discredit any new initiative is to say, oh, this is a sinister conservative plot."}, {"time": 1001, "text": "But one of our cofounders, Heather Heying, is definitely not a conservative."}, {"time": 1009, "text": "She's as committed to the idea of academic freedom as I am."}, {"time": 1013, "text": "But I think on political issues, we probably agree on almost nothing."}, {"time": 1017, "text": "And at least I would guess."}, {"time": 1020, "text": "But politics, Max Weber made this point a long time ago, that politics really should stop at the threshold of the classroom, of the lecture hall."}, {"time": 1029, "text": "And in my career, I've always tried to make sure that when I'm teaching, it's not clear where I stand politically, though of course undergraduates insatiably curiously want to know, but it shouldn't be clear from what I say because indoctrination on a political basis is an abuse of the power of the professor, as Weber rightly said."}, {"time": 1052, "text": "So I think one of the key principles of the University of Austin will be that Weberian principle that politics is not an appropriate subject for the lecture hall, for the classroom."}, {"time": 1068, "text": "And we should pursue truth and enshrine liberty of thought."}, {"time": 1076, "text": "If that's a political issue, then I can't help you."}, {"time": 1078, "text": "I mean, if you're against freedom of thought, then we don't really have much of a discussion to have."}, {"time": 1084, "text": "And clearly there are some people who politically seem quite hostile to it."}, {"time": 1088, "text": "But my sense is that there are plenty of people on the left in academia."}, {"time": 1092, "text": "I think of that interesting partnership between Cornel West and Robbie George, which has been institutionalized in the Academic Freedom Alliance."}, {"time": 1102, "text": "It's bipartisan, this issue."}, {"time": 1103, "text": "It really, really is."}, {"time": 1105, "text": "After all, 50 years ago, it was the left that was in favor of free speech."}, {"time": 1110, "text": "The right still has an anti free speech element to it."}, {"time": 1113, "text": "Look how quickly they're out to ban critical race theory."}, {"time": 1117, "text": "Critical race theory won't be banned at the University of Texas."}, {"time": 1119, "text": "Wokism won't be banned."}, {"time": 1121, "text": "Everything will be up for discussion, but the rules of engagement will be clear."}, {"time": 1126, "text": "Chicago principles, those will be enforced."}, {"time": 1129, "text": "And if you have to give a lecture on, well, let's just take a recent example, the Dorian Abbott case."}, {"time": 1137, "text": "If you're giving a lecture on astrophysics, but it turns out that in some different venue you express skepticism about affirmative action, well, it doesn't matter."}, {"time": 1149, "text": "It's irrelevant."}, {"time": 1150, "text": "We want to know what your thoughts are on astrophysics cause that's what you're supposed to be giving a lecture on."}, {"time": 1156, "text": "That used to be understood."}, {"time": 1157, "text": "I mean, at the Oxford of the 1980s, there were communists and there were ultra Tories."}, {"time": 1162, "text": "At Cambridge, there were people who were so reactionary that they celebrated Franco's birthday, but they were also out and out communists down the road at King's College."}, {"time": 1172, "text": "The understanding was that that kind of intellectual diversity was part and parcel of university life."}, {"time": 1178, "text": "And frankly, for an undergraduate, it was great fun to cross the road and go from outright conservatism, ultra Torism to communism."}, {"time": 1187, "text": "One learns a lot that way."}, {"time": 1190, "text": "But the issue is when you're promoting or hiring or tenuring people, their politics is not relevant."}, {"time": 1199, "text": "And when it started to become relevant, and I remember this coming up at the Harvard history department late in my time there, I felt deeply, deeply uneasy that we were having conversations that amounted to, well, we can't hire X person despite their obvious academic qualifications because of some political issue."}, {"time": 1224, "text": "That's not what should happen at a healthy university."}, {"time": 1228, "text": "Some practical questions."}, {"time": 1231, "text": "Will University of Austin be a physical in person university or virtual university?"}, {"time": 1238, "text": "What are some in that aspect where the classroom is?"}, {"time": 1242, "text": "It will be a real space institution."}, {"time": 1246, "text": "There may be an online dimension to it because there clearly are a lot of things that you can do via the internet."}, {"time": 1256, "text": "But the core activity of teaching and learning I think requires real space."}, {"time": 1262, "text": "And I've thought about this a long time, debated Sebastian Thrun about this many, many years ago when he was a complete believer in, let's call it the metaversity to go with the metaverse."}, {"time": 1272, "text": "I mean, the metaversity was going to happen, wasn't it?"}, {"time": 1274, "text": "But I never really believed in the metaversity."}, {"time": 1276, "text": "I didn't do MOOCs because I just didn't think you'd, A, be able to retain the attention, B, be able to cope with the scaled grading that was involved."}, {"time": 1287, "text": "I think there's a reason universities have been around in their form for about a millennium."}, {"time": 1292, "text": "You kind of need to all be in the same place."}, {"time": 1294, "text": "So I think answer to that question definitely a campus in the Austin area."}, {"time": 1299, "text": "That's where we'll start."}, {"time": 1301, "text": "And if we can allow some of our content to be available online, great, we'll certainly do that."}, {"time": 1308, "text": "Another question is what kind of courses and programming will it offer?"}, {"time": 1312, "text": "Is that something you can speak to?"}, {"time": 1315, "text": "We think that we need to begin more like a startup than like a full service university from day one."}, {"time": 1325, "text": "So our vision is that we start with a summer school, which will offer provocatively the forbidden courses."}, {"time": 1332, "text": "We want, I think, to begin by giving a platform to the professors who've been most subject to council culture and also to give an opportunity to students who want to hear them to come."}, {"time": 1345, "text": "So we'll start with a summer school that will be somewhat in the tradition of those institutions in the interwar period that were havens for refugees."}, {"time": 1354, "text": "So we're dealing here with the internal refugees of the work era."}, {"time": 1359, "text": "We'll start there."}, {"time": 1361, "text": "It'll be an opportunity to test out some content, see what students will come and spend time in Austin to hear."}, {"time": 1371, "text": "So that's part A."}, {"time": 1372, "text": "That's the sort of, if you like, the launch product."}, {"time": 1376, "text": "And then we go straight to a master's program."}, {"time": 1380, "text": "I don't think you can go to undergraduate education right away because the established brands in undergraduate education are offering something it's impossible to compete with initially because they have the brand, Harvard, Yale, Stanford, and they offer also this peer network, which is part of the reason people want so badly to go to those places, not really the professors, it's the classmates."}, {"time": 1405, "text": "So we don't wanna compete there initially."}, {"time": 1408, "text": "Where there is, I think, room for new entrance is in a master's program."}, {"time": 1415, "text": "And the first one will be in entrepreneurship and leadership."}, {"time": 1419, "text": "Because I think there's a huge hunger amongst people who want to get into, particularly the technology world, to learn about those things."}, {"time": 1427, "text": "And they know they're not really going to learn about them at business schools."}, {"time": 1430, "text": "The people who are not going to teach them leadership and entrepreneurship are professors."}, {"time": 1435, "text": "So we want to create something that will be a little like the very successful Schwarzman program in China, which was come and spend a year in China and find out about China."}, {"time": 1447, "text": "We'll be doing the same, essentially saying, come and spend a year and find out about technology."}, {"time": 1452, "text": "And there'll be a mix of academic content."}, {"time": 1455, "text": "We want people to understand some of the first principles of what they're studying."}, {"time": 1459, "text": "There are first principles of entrepreneurship and leadership, but we also want them to spend time with people like one of our cofounders, Joe Lonsdale, who's been a hugely successful venture capitalist and learn directly from people like him."}, {"time": 1473, "text": "So that's the kind of initial offering."}, {"time": 1475, "text": "I think there are other master's programs that we will look to roll out quite quickly."}, {"time": 1479, "text": "I have a particular passion for a master's in applied history or politics in applied history."}, {"time": 1485, "text": "I'm a historian driven crazy by the tendency of academic historians to drift away from what seemed to me the important questions and certainly to drift away from addressing policy relevant questions."}, {"time": 1497, "text": "So I would love to be involved in a master's in applied history."}, {"time": 1502, "text": "And we'll build some programs like that before we get to the full liberal arts experience that we envisage for an undergraduate program."}, {"time": 1515, "text": "And that undergraduate program is an exciting one cause I think we can be innovative there too."}, {"time": 1519, "text": "I would say two years would be spent doing some very classical and difficult classical things, bridging those old divides between arts and sciences."}, {"time": 1530, "text": "But then there would also be in the second half in the junior and senior years, something somewhat more of an apprenticeship where we'll have centers, including a center for technology engineering mathematics that will be designed to help people make that transition from the theoretical to the practical."}, {"time": 1554, "text": "So that's the vision."}, {"time": 1557, "text": "And I think like any early stage idea we'll doubtless tweak it as we go along."}, {"time": 1564, "text": "We'll find things that work and things that don't work."}, {"time": 1567, "text": "But I have a very clear sense in my own mind of how this should look five years from now."}, {"time": 1574, "text": "And I don't know about you."}, {"time": 1574, "text": "I mean, I'm unusual as an academic cause I quite like starting new institutions and I've done a bit of it in my career."}, {"time": 1582, "text": "You got to kind of know what it should look like after the first four or five years to get out of bed in the morning and put up with all the kind of hassles of doing it."}, {"time": 1591, "text": "Not least the inevitable flack that we were bound to take from the educational establishment."}, {"time": 1599, "text": "And I was graciously invited to be an advisor to this University of Austin."}, {"time": 1605, "text": "And the reason I would love to help in whatever way I can is several."}, {"time": 1612, "text": "So one, I would love to see Austin, the physical location flourish intellectually and especially in the space of science and engineering."}, {"time": 1623, "text": "That's really exciting to me."}, {"time": 1625, "text": "Another reason is I am still a research scientist at MIT."}, {"time": 1629, "text": "I still love MIT and I see this effort that you're launching as a beacon that leads the way to the other elite institutions in the world."}, {"time": 1644, "text": "I think too many of my colleagues and especially in robotics kind of see, don't see robotics as a humanities problem."}, {"time": 1655, "text": "But to me, robotics and AI will define much of our world in the next century."}, {"time": 1661, "text": "And for, not to consider all the deep psychological, sociological, human problems associated with that."}, {"time": 1671, "text": "To have real open conversations, to say stupid things, to challenge the ideas that, of how companies are being run, for example."}, {"time": 1683, "text": "That is the safe space."}, {"time": 1685, "text": "It's very difficult to talk about the different questions about technology when you're employed by Facebook or Google and so on."}, {"time": 1693, "text": "The university is the place to have those conversations."}, {"time": 1697, "text": "That's right, and we're hugely excited that you want to be one of our advisors."}, {"time": 1701, "text": "We need a broad and an eclectic group of people."}, {"time": 1706, "text": "And I'm excited by the way that group has developed."}, {"time": 1711, "text": "It has some of the, some of my favorite intellectuals are there, Steve Pinker, for example, but we're also making sure that we have people with experience in academic leadership."}, {"time": 1726, "text": "And so it's a happy coalition of the willing, looking to try to build something new, which as you say, will be complimentary to the existing and established institutions."}, {"time": 1740, "text": "I think of the academic world as a network."}, {"time": 1744, "text": "I've moved from some major hubs in the network to others, but I've always felt that we do our best work, not in a silo called Oxford, but in a silo that is really a hub connected to Stanford, connected to Harvard, connected to MIT."}, {"time": 1764, "text": "One of the reasons I moved to the United States was that I sensed that there was more intellectual action in my original field of expertise, financial history."}, {"time": 1775, "text": "And that was right."}, {"time": 1777, "text": "It was a good move."}, {"time": 1779, "text": "I think I'd have stagnated if I'd stayed at Oxford."}, {"time": 1783, "text": "But at the same time, I haven't lost connection with Oxford."}, {"time": 1786, "text": "I recently went and gave a lecture there in honor of Sir Roger Scruton, one of the great conservative philosophers."}, {"time": 1792, "text": "And the burden of my lecture was the idea of the Anglosphere, which appealed a lot to Roger, will go horribly wrong if illiberal ideas that inhibit academic freedom spread all over the Anglosphere."}, {"time": 1807, "text": "And this network gets infected with these, I think, deeply damaging notions."}, {"time": 1815, "text": "So yeah, I think we're creating a new node."}, {"time": 1818, "text": "I hope it's a node that makes the network overall more resilient."}, {"time": 1823, "text": "And right now there's an urgent need for it."}, {"time": 1825, "text": "I mean, there are people whose academic careers have been terminated."}, {"time": 1830, "text": "I'll name two who are involved."}, {"time": 1832, "text": "Peter Boghossian, who was harassed out of Portland State for the reason that he was one of those intrepid figures who carried out the grievance studies hoaxes, exposing the utter charlatanry going on in many supposedly academic journals by getting phony gender studies articles published."}, {"time": 1856, "text": "This is genius."}, {"time": 1857, "text": "And of course, so put the noses out of joint of the academic establishment that he began to be subject to disciplinary actions."}, {"time": 1865, "text": "So Peter is going to be involved."}, {"time": 1867, "text": "And in a recent shocking British case, the philosopher Kathleen Stock has essentially been run off the campus of Sussex University in England for violating the increasingly complex rules about discussing transgender issues and women's rights."}, {"time": 1886, "text": "She will be one of our advisors."}, {"time": 1888, "text": "And I think also one of our founding fellows actually teaching for us in our first iteration."}, {"time": 1895, "text": "So I think we're creating a node that's badly needed."}, {"time": 1898, "text": "Those people, I mean, I remember saying this to the other founders when we first began to talk about this idea to Barry Weiss and to Panna Canellos as well as to Heather Haying."}, {"time": 1912, "text": "We need to do this urgently because there are people whose livelihoods are in fact being destroyed by these extraordinarily illiberal campaigns against them."}, {"time": 1922, "text": "And so there's no time to hang around and come up with the perfect design."}, {"time": 1927, "text": "This is an urgently needed lifeboat."}, {"time": 1930, "text": "And let's start with that."}, {"time": 1931, "text": "And then we can build something spectacular taking advantage of the fact that all of these people have, well, they now have very real skin in the game."}, {"time": 1939, "text": "They need to make this a success."}, {"time": 1941, "text": "And I'm sure they will help us make it a success."}, {"time": 1944, "text": "So you mentioned some interesting names like Heather Haying, Barry Weiss, and so on."}, {"time": 1950, "text": "Steven Pinker, somebody I really admire."}, {"time": 1952, "text": "He too was under a lot of, quite a lot of fire."}, {"time": 1955, "text": "Many reasons I admire him."}, {"time": 1957, "text": "One, because of his optimism about the future."}, {"time": 1960, "text": "And two, how little of a damn he seems to give about like walking through the fire."}, {"time": 1968, "text": "There's nobody more zen about walking through the fire than Steven Pinker."}, {"time": 1971, "text": "But anyway, you mentioned a lot of interesting names, Jonathan Haidt is also interesting there."}, {"time": 1976, "text": "Who is involved with this venture at this early days?"}, {"time": 1980, "text": "Well, one of the things that I'm excited about is that we're getting people from inside and outside the academic world."}, {"time": 1989, "text": "So we've got Arthur Brooks, who for many years ran the American Enterprise Institute very successfully, has a Harvard role now teaching."}, {"time": 2000, "text": "And so he's somebody who brings, I think, a different perspective."}, {"time": 2007, "text": "There's obviously a need to get experienced academic leaders involved, which is why I was talking to Larry Summers about whether he would join our board of advisors."}, {"time": 2023, "text": "The Chicago principals owe a debt to the former president of Chicago."}, {"time": 2030, "text": "And he's graciously agreed to be in the board of advisors."}, {"time": 2034, "text": "I could go on."}, {"time": 2034, "text": "It would become a long and tedious list."}, {"time": 2036, "text": "But my goal in trying to get this happy band to form has been to signal that it's a bipartisan endeavor."}, {"time": 2046, "text": "It is not a conservative institution that we're trying to build."}, {"time": 2049, "text": "It's an institution that's committed to academic freedom and the pursuit of truth that will mean it when it takes Robert Zimmer's Chicago principles and enshrines them in its founding charter."}, {"time": 2062, "text": "And we'll make those something other than honored in the breach, which they seem to be at some institutions."}, {"time": 2069, "text": "So the idea here is to grow this organically."}, {"time": 2073, "text": "We need, rather like the Academic Freedom Alliance that Robbie George created earlier this year, we need breadth."}, {"time": 2080, "text": "And we need to show that this is not some kind of institutionalization of the intellectual dark web, though we welcome founding members of that nebulous body."}, {"time": 2092, "text": "It's really something designed for all of academia to provide a kind of reboot that I think we all agree is needed."}, {"time": 2100, "text": "Is there a George Washington type figure?"}, {"time": 2102, "text": "Is there a president elected yet?"}, {"time": 2104, "text": "Or who's going to lead this institution?"}, {"time": 2107, "text": "Panos Kanellos, the former president of St. John's, is the president of University of Austin."}, {"time": 2112, "text": "And so he is our George Washington."}, {"time": 2115, "text": "I don't know who Alexander Hamilton is."}, {"time": 2117, "text": "I'll leave you to guess."}, {"time": 2118, "text": "It's funny you mentioned IDW, Intellectual Dark Web."}, {"time": 2121, "text": "Have you talked to your friend Sam Harris about any of this?"}, {"time": 2128, "text": "He is another person I really admire and I've talked to online and offline quite a bit for not belonging to any tribe."}, {"time": 2139, "text": "He stands boldly on his convictions when he knows they're not going to be popular."}, {"time": 2146, "text": "Like he basically gets canceled by every group."}, {"time": 2151, "text": "He doesn't shy away from controversy."}, {"time": 2154, "text": "And not for the sake of controversy itself, he is one of the best examples to me of a person who thinks freely."}, {"time": 2162, "text": "I disagree with him on quite a few things, but I deeply admire that he is what it looks like to think freely by himself."}, {"time": 2172, "text": "It feels to me like he represents a lot of the ideals of this kind of effort."}, {"time": 2176, "text": "Yes, he would be a natural fit."}, {"time": 2178, "text": "Sam, if you're listening, I hope you're in."}, {"time": 2181, "text": "I think in the course of his recent intellectual quests, he did collide with one of our founders, Heather Haying."}, {"time": 2188, "text": "So we'll have to model civil disagreements at the University of Austin."}, {"time": 2192, "text": "It's extremely important that we should all disagree about many things, but do it amicably."}, {"time": 2198, "text": "One of the things that has been lost sight of, perhaps it's all the fault of Twitter or maybe it's something more profound, is that it is possible to disagree in a civil way and still be friends."}, {"time": 2209, "text": "I certainly had friends at Oxford who were far to the left of me politically, and they are still among my best friends."}, {"time": 2216, "text": "So the University of Austin has to be a place where we can disagree vehemently, but we can then go and have a beer afterwards."}, {"time": 2226, "text": "That's, in my mind, a really important part of university life, learning the difference between the political and the personal."}, {"time": 2235, "text": "So Sam is, I think, a good example, as are you, of a certain kind of intellectual hero who has been willing to go into the cyber sphere, the metaverse, and carve out an intellectual space, the podcast, and debate everything fearlessly."}, {"time": 2262, "text": "His essay, it was really an essay on Black Lives Matter and the question of police racism, was a masterpiece of 2020."}, {"time": 2274, "text": "And so he, I think, is a model of what we believe in."}, {"time": 2281, "text": "But we can't save the world with podcasts, good though yours is, because there's a kind of solo element to this form of public intellectual activity."}, {"time": 2295, "text": "It's also there in Substack, where all our best writers now seem to be, including our founder, Barry Weiss."}, {"time": 2302, "text": "The danger with this approach is, ultimately, your subscribers are the people who already agree with you, and we are all, therefore, in danger of preaching to the choir."}, {"time": 2315, "text": "I think what makes an institution like University of Austin so attractive is that we get everybody together, at least part of the year, and we do that informal interaction at lunch, at dinner, that allows, in my experience, the best ideas to form."}, {"time": 2337, "text": "Intellectual activity isn't really a solo voyage."}, {"time": 2340, "text": "Historians often make it seem that way, but I've realized over time that I do my best work in a collaborative way, and scientists have been better at this than people in the humanities."}, {"time": 2352, "text": "But what really matters, what's magical about a good university, is that interdisciplinary, serendipitous conversation that happens on campus."}, {"time": 2361, "text": "Tom Sargent, the great Nobel Prize winning economist and I, used to have these kind of random conversations in elevators at NYU or in corridors at Stanford, and sometimes they'd be quite short conversations, but in that short, serendipitous exchange, I would have more intellectual stimulus than in many a seminar lasting an hour and a half."}, {"time": 2384, "text": "So I think we want to get the Sam Harris's and Lex Friedman's out of their darkened rooms and give them a chance to interact in a much less structured way than we've got used to."}, {"time": 2399, "text": "Again, it's that sense that sometimes you need some freewheeling, unstructured debate to get the really good ideas."}, {"time": 2407, "text": "I mean, to talk anecdotally for a moment, I look back on my Oxford undergraduate experience and I wrote a lot of essays and attended a lot of classes, but intellectually, the most important thing I did was to write an essay on the Viennese satirist Karl Kraus for an undergraduate discussion group called the Canon Club."}, {"time": 2427, "text": "And I probably put more work into that paper than I put into anything else, except maybe my final examinations, even although there was only really one senior member present, the historian Jeremy Cato, I was really just trying to impress my contemporaries."}, {"time": 2441, "text": "And that's the kind of thing we want."}, {"time": 2445, "text": "The great intellectual leaps forward, occurred, often in somewhat unstructured settings."}, {"time": 2454, "text": "I'm from Scotland, you can tell from my accent, a little at least."}, {"time": 2459, "text": "The enlightenment happened in late 18th century Scotland in a very interesting interplay between the universities, which were very important, Glasgow, Edinburgh, St Andrews, and the coffee houses and pubs of the Scottish cities where a lot of unstructured discussion often fueled by copious amounts of wine took place."}, {"time": 2484, "text": "That's what I've missed over the last few years."}, {"time": 2487, "text": "Let's just think about how hard academic social life has become."}, {"time": 2492, "text": "That we've reached the point that Amy Chewer becomes the object of a full blown investigation and media storm for inviting to Yale Law School students over to her house to talk."}, {"time": 2510, "text": "I mean, when I was at Oxford, it was regarded as a tremendous honor to be asked to go to one of our tutors homes."}, {"time": 2518, "text": "The social life of Oxford and Cambridge is one of their great strengths."}, {"time": 2521, "text": "There's a sort of requirement to sip unpleasant sherry with the dons."}, {"time": 2526, "text": "And we've kind of killed all that."}, {"time": 2528, "text": "We've killed all that in the US because nobody dares have a social interaction with an undergraduate or exchange an informal email in case the whole thing ends up on the front page of the local or student newspaper."}, {"time": 2539, "text": "So that's what we need to kind of restore, the social life of academia."}, {"time": 2545, "text": "So there's magic."}, {"time": 2546, "text": "We didn't really address this sort of explicitly."}, {"time": 2549, "text": "But there's magic to the interaction between students."}, {"time": 2553, "text": "There's magic in the interaction between faculty, the people that teach."}, {"time": 2558, "text": "And there's the magic in the interaction between the students and the faculty."}, {"time": 2561, "text": "And it's an iterative process that changes everybody involved."}, {"time": 2566, "text": "So it's like world experts in a particular discipline are changed as much as the students, as the 20 year olds with the wild ideas, each are changed and that's the magic of it."}, {"time": 2579, "text": "That applies in liberal education, that applies in the sciences too."}, {"time": 2583, "text": "That's probably maybe you can speak to this, why so much scientific innovation has happened in universities."}, {"time": 2590, "text": "There's something about the youthful energy of like young minds, graduate students, undergraduate students that inspire some of the world experts to do some of the best work of their lives."}, {"time": 2601, "text": "Well, the human brain we know is at its most dynamic when people are pretty young."}, {"time": 2607, "text": "You know this with your background in math, people don't get better at math after the age of 30."}, {"time": 2612, "text": "And this is important when you think about the intergenerational character of university."}, {"time": 2619, "text": "The older people, the professors have the experience, but they're fading intellectually from much earlier than anybody really wants to admit."}, {"time": 2630, "text": "And so you get this intellectual shot in the arm from hanging out with people who are circa 20, don't know shit, but brains are kind of like cooking."}, {"time": 2644, "text": "I look back on the career I've had in teaching, which is over 25 years at where Cambridge, Oxford, NYU, Harvard, and I have extremely strong relationships with students from those institutions because they would show up, whether it was at office hours or in tutorials and disagree with me."}, {"time": 2668, "text": "And for me, it's always been about encouraging some act of intellectual rebellion, telling people, I don't want your essay to echo my views."}, {"time": 2678, "text": "If you can find something wrong with what I wrote, great."}, {"time": 2681, "text": "Or if you can find something I missed that's new, fantastic."}, {"time": 2685, "text": "So there is definitely, as you said, a magic in that interaction across the generations."}, {"time": 2689, "text": "And it's extraordinarily difficult, I think, for an intellectual to make the same progress in a project in isolation compared with the progress that can be made in these very special communities."}, {"time": 2705, "text": "What does a university do?"}, {"time": 2707, "text": "Amongst other things, it creates a somewhat artificial environment of abnormal job security, and that's the whole idea of giving people tenure, and then a relatively high turnover, new faces each year, and an institutionalization of thought experiments and actual experiments."}, {"time": 2729, "text": "And then you get everybody living in the same kind of vicinity so that it can spill over into 3 a.m. conversation."}, {"time": 2734, "text": "Well, that always seems to me to be a pretty potent combination."}, {"time": 2739, "text": "Let's ask ourselves a counterfactual question next."}, {"time": 2741, "text": "Let's imagine that the world wars happen, but there are no universities."}, {"time": 2751, "text": "I mean, how does the Manhattan Project happen with no academia, to take just one of many examples?"}, {"time": 2758, "text": "In truth, how does Britain even stay in the war without Bletchley Park, without being able to crack the German cipher?"}, {"time": 2767, "text": "The academics are unsung, or partly sung heroes of these conflicts."}, {"time": 2774, "text": "The same is true in the Soviet Union."}, {"time": 2775, "text": "The Soviet Union was a terribly evil and repressive system, but it was good at science, and that kept it in the game, not only in World War II, it kept it in the Cold War."}, {"time": 2787, "text": "So it's clear that universities are incredibly powerful, intellectual force multipliers, and our history without them would look very different."}, {"time": 2800, "text": "Sure, some innovations would have happened without them."}, {"time": 2803, "text": "The Industrial Revolution didn't need universities."}, {"time": 2805, "text": "In fact, they played a very marginal role in the key technological breakthroughs of the Industrial Revolution in its first phase."}, {"time": 2812, "text": "But by the second Industrial Revolution in the late 19th century, German industry would not have leapt ahead of British industry if the universities had not been superior."}, {"time": 2821, "text": "And it was the fact that the Germans institutionalised scientific research in the way that they did that really produced a powerful, powerful advantage."}, {"time": 2831, "text": "The problem was that, and this is a really interesting point that Friedrich Meinlka makes in Die Deutsche Katastrophe for the German Catastrophe, the German intellectuals became technocrats, homo faber, he says."}, {"time": 2845, "text": "They knew a great deal about their speciality, but they were alienated from, broadly speaking, humanism."}, {"time": 2851, "text": "And that is his explanation, or one of his explanations for why this very scientifically advanced Germany goes down the path of hell led by Hitler."}, {"time": 2861, "text": "So when I come back and ask myself, what is it that we want to do with a new university, we wanna make sure that we don't fall into that German pit where very high levels of technical and scientific expertise are decoupled from the fundamental foundations of a free society."}, {"time": 2884, "text": "So liberal arts are there, I think, to stop the scientists making Faustian pacts."}, {"time": 2889, "text": "And that's why it's really important that people working on AI reach Shakespeare."}, {"time": 2895, "text": "I think you said that academics are unsung heroes of the 20th century."}, {"time": 2901, "text": "I think there's kind of an intellectual, a lazy intellectual desire to kind of destroy the academics, that the academics are the source of all problems in the world."}, {"time": 2914, "text": "And I personally believe that exactly as you said, we need to recognize that the university is probably where the ideas that will protect us from the catastrophes that are looming ahead of us, that's where those ideas are going to come from."}, {"time": 2932, "text": "People who work on economics can argue back and forth about John Maynard Keynes."}, {"time": 2938, "text": "But I think it's pretty clear that he was the most important economist and certainly the most influential economist of the 20th century."}, {"time": 2946, "text": "And I think his ideas are looking better today in the wake of the financial crisis than they have at any time since the 1970s."}, {"time": 2955, "text": "But imagine John Maynard Keynes without Cambridge, you can't because someone like that doesn't actually exist without the incredible hothouse that a place like Cambridge was in Keynes's life."}, {"time": 2970, "text": "He was a product of a kind of hereditary intellectual elite, it had its vices."}, {"time": 2976, "text": "But you can't help but admire the sheer power of the mind."}, {"time": 2980, "text": "I've spent a lot of my career reading Keynes and I revere that intellect, it's so, so powerful."}, {"time": 2987, "text": "But you can't have people like that if you're not prepared to have King's College Cambridge."}, {"time": 2993, "text": "And it comes with redundancy."}, {"time": 2995, "text": "I think that's the point."}, {"time": 2996, "text": "There are lots and lots of things that are very annoying about academic life that you just have to deal with."}, {"time": 3003, "text": "They're made fun of in that recent Netflix series, The Chair."}, {"time": 3007, "text": "And it is easy to make fun of academic life."}, {"time": 3010, "text": "Tom Sharp's Porterhouse Blue did it."}, {"time": 3013, "text": "It's an inherently comical subject."}, {"time": 3017, "text": "Professors at least used to be amusingly eccentric."}, {"time": 3020, "text": "But we've sort of killed off that side of academia by turning it into an increasingly doctrinaire place where eccentricity is not tolerated."}, {"time": 3033, "text": "I'll give you an illustration of this."}, {"time": 3034, "text": "I had a call this morning from a British academic who said, can you give me some advice because they're trying to decolonize the curriculum."}, {"time": 3045, "text": "This is coming from the, diversity, equity and inclusion officers."}, {"time": 3050, "text": "And it seems to me that what they're requiring of us is a fundamental violation of academic freedom because it is determining ex ante what we should study and teach."}, {"time": 3062, "text": "That's what's going on."}, {"time": 3064, "text": "And that's the thing that we really, really have to resist because that kills the university."}, {"time": 3070, "text": "That's the moment that it stops being the magical place of, being the magical place of intellectual creativity and simply becomes an adjunct of the ministry of propaganda."}, {"time": 3084, "text": "I've loved the time we've spent talking about this because it's such a hopeful message for the future of the university that I still share with you the love of the ideal of the university."}, {"time": 3097, "text": "So very practical question."}, {"time": 3099, "text": "You mentioned summer."}, {"time": 3103, "text": "Which summer are we talking about?"}, {"time": 3104, "text": "So when, I know we don't wanna put hard dates here but what year are we thinking about?"}, {"time": 3111, "text": "When is this thing launching?"}, {"time": 3112, "text": "What are your thoughts on this?"}, {"time": 3113, "text": "We are moving as fast as our resources allow."}, {"time": 3117, "text": "The goal is to offer the first of the forbidden courses next summer, summer of 2022."}, {"time": 3123, "text": "And we hope to be able to launch an initial, albeit relatively small scale master's program in the fall of next year."}, {"time": 3134, "text": "That's as fast as humanly possible."}, {"time": 3138, "text": "So yeah, we're really keen to get going."}, {"time": 3141, "text": "And I think the approach we're taking is somewhat imported from Silicon Valley."}, {"time": 3147, "text": "Think of this as a startup."}, {"time": 3149, "text": "Don't think of this as something that has to exist as a full service university on day one."}, {"time": 3153, "text": "We don't have the resources for that."}, {"time": 3155, "text": "You did billions and billions of dollars to build a university sort of as a facsimile of an existing university, but that's not what we want to do."}, {"time": 3162, "text": "I mean, copying and pasting Harvard or Yale or Stanford would be a futile thing to do."}, {"time": 3166, "text": "They would probably, you very quickly end up with the same pathologies."}, {"time": 3170, "text": "So we do have to come up with a different design."}, {"time": 3172, "text": "And one way of doing that is to grow it organically from something quite small."}, {"time": 3176, "text": "Elon Musk mentioned in his usual humorous way on Twitter that he wants to launch the Texas Institute of Technology and Science, TITS."}, {"time": 3189, "text": "Some people thought this was sexist because of the acronym, TITS."}, {"time": 3193, "text": "So first of all, I understand their viewpoint, but I also think there needs to be a place for humor on the internet, even from CEOs."}, {"time": 3201, "text": "So on this podcast, I've gotten a chance to talk to quite a few CEOs."}, {"time": 3206, "text": "And what I love to see is authenticity."}, {"time": 3209, "text": "And humor is often a sign of authenticity."}, {"time": 3213, "text": "The quirkiness that you mentioned is such a beautiful characteristic of professors and faculty in great universities is also beautiful to see as CEOs, especially founding CEOs."}, {"time": 3226, "text": "So anyway, the deeper point he was making is showing an excitement for the university as a place for big ideas in science, technology, engineering."}, {"time": 3279, "text": "So I'm actually gonna, I hope there's a serious idea behind that tweet and I'm gonna chat with him about it."}, {"time": 3288, "text": "Most of the biggest storms in teacups of my academic career have been caused by bad jokes that I've made."}, {"time": 3299, "text": "These days, if you wanna make bad jokes, being a billionaire is a great idea."}, {"time": 3308, "text": "I'm not here to defend Elon's Twitter style or sense of humor."}, {"time": 3314, "text": "He's not gonna be remembered for his tweets, I think."}, {"time": 3318, "text": "He's gonna be remembered for the astonishing companies that he's built and his contributions in a whole range of fields from SpaceX to Tesla and solar energy."}, {"time": 3331, "text": "And I very much hope that we can interest Elon in this project."}, {"time": 3336, "text": "We need not only Elon, but a whole range of his peers because this takes resources."}, {"time": 3345, "text": "Universities are not cheap things to run, especially if, as I hope, we can make as much of the tuition covered by scholarships and bursaries."}, {"time": 3357, "text": "We want to attract the best intellectual talent to this institution."}, {"time": 3364, "text": "The best intellectual talent is somewhat randomly distributed through society."}, {"time": 3368, "text": "And some of it is in the bottom quintile of the income distribution."}, {"time": 3371, "text": "And that makes it hard to get to elite education."}, {"time": 3373, "text": "So this will take resources."}, {"time": 3377, "text": "The last generation of super wealthy plutocrats, the generation of the Gilded Age of the late 19th century, did a pretty good job of funding universities."}, {"time": 3388, "text": "Now Chicago wouldn't exist, but for the money of that era."}, {"time": 3393, "text": "And so my message to not only to Elon, but to all of the peers, all of those people who made their billions out of technology over the last couple of decades is this is your time."}, {"time": 3404, "text": "I mean, and this is your opportunity to create something new."}, {"time": 3407, "text": "I can't really understand why the wealthy of our time are content to hand their money."}, {"time": 3413, "text": "I mean, think of the vast sums Mike Bloomberg recently gave to Johns Hopkins to established institutions."}, {"time": 3421, "text": "When on close inspection, those institutions don't seem to spend the money terribly well."}, {"time": 3430, "text": "And in fact, one of the mysteries of our time is the lack of due diligence that hard nosed billionaires seem to do when it comes to philanthropy."}, {"time": 3439, "text": "So I think there's an opportunity here for this generation of very talented, wealthy people to do what their counterparts did in the late 19th and early 20th century and create some new institutions."}, {"time": 3452, "text": "And they don't need to put their names on the buildings."}, {"time": 3454, "text": "They just need to do what the founders of Chicago, University of Chicago did, create something new that will endure."}, {"time": 3465, "text": "Yeah, MIT is launching a college of computing and Stephen Schwarzman has given quite a large sum of money, I think in total, a billion dollars."}, {"time": 3476, "text": "And as somebody who loves computing, as somebody who loves MIT, I want some accountability for MIT becoming a better institution."}, {"time": 3487, "text": "And this is once again, why I'm excited about University of Austin because it serves as a beacon."}, {"time": 3492, "text": "Look, you can create something new and this is what the great institutions of the future should look like."}, {"time": 3498, "text": "And Steve Schwarzman is also an innovator."}, {"time": 3502, "text": "The idea of creating a college on the Tsinghua campus and creating a kind of Rhodes program for students from the Western world to come study in China was Steve's idea."}, {"time": 3513, "text": "And I was somewhat involved, did some visiting, professing there."}, {"time": 3518, "text": "It taught me that you can create something new in that area of graduate education and quite quickly attract really strong applicants because the people who finished their four years at Harvard or Stanford know that they don't know a lot."}, {"time": 3537, "text": "And I, having taught a lot of people in that group, know how intellectually dissatisfied they often are at the end of four years."}, {"time": 3548, "text": "I mean, they may have beautifully gamed the system to graduate summa magna cum laude, but they kind of know they'll confess it after a drink or two."}, {"time": 3556, "text": "They know that they gamed the system and that intellectually it wasn't the fulfilling experience they wanted."}, {"time": 3562, "text": "And they also know that an MBA from a comparable institution would not be a massive intellectual step forward."}, {"time": 3569, "text": "So I think what we want to say is, here's something really novel, exciting, that will be intellectually very challenging."}, {"time": 3577, "text": "I do think the University of Austin has to be difficult."}, {"time": 3582, "text": "I'd like it to feel a little bit like surviving Navy SEAL training to come through this program because it will be intellectually demanding."}, {"time": 3589, "text": "That I think should be a magnet."}, {"time": 3591, "text": "So yeah, Steve, if you're listening, please join Elon in supporting this."}, {"time": 3596, "text": "And Peter Thiel, if you're listening, I know how skeptical you are about the idea of creating a new university because heaven knows, Peter and I have been discussing this idea for years and he's always said, well, no, we thought about this and it just isn't gonna work."}, {"time": 3609, "text": "But I really think we've got a responsibility to do this."}, {"time": 3615, "text": "Well, Steve's been on this podcast before."}, {"time": 3617, "text": "We've spoken a few times, so I'll send this to him."}, {"time": 3619, "text": "I hope he does actually get behind it as well."}, {"time": 3622, "text": "So I'm super excited by the ideas that we've been talking about that this effort represents and what ripple effect it has on the rest of society."}, {"time": 3633, "text": "That was a time beautifully spent."}, {"time": 3636, "text": "And I'm really grateful for the fortune of getting a chance to talk to you at this moment in history because I've been a big fan of your work and the reason I wanted to talk to you today is about all the excellent books you've written about various aspects of history through money, war, power, pandemics, all of that."}, {"time": 3660, "text": "But I'm glad that we got a chance to talk about this, which is not looking at history, it's looking at the future."}, {"time": 3667, "text": "This is a beautiful little fortuitous moment."}, {"time": 3672, "text": "I appreciate you talking about it."}, {"time": 3675, "text": "In the book, Ascent of Money, you give a history of the world through the lens of money."}, {"time": 3681, "text": "If the financial system is a evolutionary nature, much like life on earth, what is the origin of money on earth?"}, {"time": 3688, "text": "The origin of money predates coins."}, {"time": 3693, "text": "Most people kind of assume I'll talk about coins, but coins are relatively late developments."}, {"time": 3700, "text": "Back in ancient Mesopotamia, so I don't know, 5,000 years ago, there were relations between creditors and debtors."}, {"time": 3709, "text": "There are even in the simplest economy because of the way in which agriculture works."}, {"time": 3715, "text": "Hey, I need to plant these seeds, but I'm not gonna have crops for X months."}, {"time": 3721, "text": "So we have clay tablets in which simple debt transactions are inscribed."}, {"time": 3727, "text": "I remember looking at great numbers of these in the British Museum when I was writing The Ascent of Money."}, {"time": 3732, "text": "And that's really the beginning of money."}, {"time": 3735, "text": "The minute you start recording a relationship between a creditor and a debtor, you have something that is quasi money."}, {"time": 3742, "text": "And that is probably what these clay tablets mostly denoted."}, {"time": 3748, "text": "From that point on, there's a great evolutionary experiment to see what the most convenient way is to record relations between creditors and debtors."}, {"time": 3762, "text": "And what emerges in the time of the ancient Greeks are coins, metal, tokens, sometimes a valuable metal, sometimes not, usually bearing the imprint of a state or a monarch."}, {"time": 3779, "text": "And that's the sort of more familiar form of money that we still use today for very, very small transactions."}, {"time": 3787, "text": "I expect coins will all be gone by the time my youngest son is my age, but the money that I have is still there."}, {"time": 3795, "text": "My youngest son is my age, but they're a last remnant of a very, very old way of doing simple transactions."}, {"time": 3804, "text": "And when you say coins, you mean physical coins."}, {"time": 3807, "text": "I'm talking about coins have been rebranded in the digital space as well."}, {"time": 3811, "text": "Yeah, not coin based coins, actual coin coins."}, {"time": 3814, "text": "You know, the ones that jangle in your pocket and you kind of don't know quite what to do with once you have some."}, {"time": 3819, "text": "So that became an incredibly pervasive form of paying for things."}, {"time": 3827, "text": "Money's just a, it's just a crystallization of a relationship between a debtor and a creditor."}, {"time": 3832, "text": "And the coins are just very fungible."}, {"time": 3835, "text": "Whereas a clay tablet relates to a specific transaction, coins are generic and fungible."}, {"time": 3840, "text": "They can be used in any transaction."}, {"time": 3842, "text": "So that was an important evolutionary advance."}, {"time": 3845, "text": "If you think of financial history, and this was the point of the ascent of money, as an evolutionary story, there are punctuated equilibria."}, {"time": 3852, "text": "People get by with coins for a long time, despite their defects as a means of payment, such as that they can be debased, they can be clipped."}, {"time": 3863, "text": "It's very hard to avoid fake or debased money entering the system."}, {"time": 3868, "text": "But coinage is still kind of the basis of payments all the way through the Roman Empire, out the other end into the so called dark ages."}, {"time": 3876, "text": "It's still how most things are settled in cash transactions in the early 1300s."}, {"time": 3883, "text": "You don't get a big shift until after the Black Death, when there's such a need to monetize the economy because of chronic labor shortages and feudalism begins to unravel, that you just don't have a sufficient amount of coinage."}, {"time": 3898, "text": "And so you get bills of exchange."}, {"time": 3933, "text": "They're just pieces of paper."}, {"time": 3935, "text": "And the verification comes in the form of signatures."}, {"time": 3938, "text": "And you need ultimately some kind of guarantee if I write an IOU to you, bills of exchange, I mean, you don't really know me that well, we only just met."}, {"time": 3949, "text": "So you might wanna get endorsed by, I don't know, somebody really credit worthy like Elon."}, {"time": 3954, "text": "And so we actually can see in the late 14th century in Northern Italy and England and elsewhere, the evolution of a peer to peer network system of payment."}, {"time": 3966, "text": "And that's actually how world trade grows, because you just couldn't settle long oceanic transactions with coinage."}, {"time": 3974, "text": "It just wasn't practical."}, {"time": 3975, "text": "All those treasure chests full of the balloons, which were part of the way in which the Spanish empire worked really inefficient."}, {"time": 3982, "text": "So bills of exchange are an exciting part of the story."}, {"time": 3986, "text": "And they illustrate something I should have made more clear in the ascent of money, that not everything used in payment needs to be money."}, {"time": 3996, "text": "Classically, economists will tell you, oh, well, money, money has three different functions."}, {"time": 4001, "text": "It's you've heard this a zillion times, right?"}, {"time": 4003, "text": "It's a unit of account, it's a store of value, and it's a medium of exchange."}, {"time": 4009, "text": "Now, there are three or four things that are worth saying about this, and I'll just say two."}, {"time": 4013, "text": "One, it may be that those three things are a trilemma, and it's very difficult for anything to be all of them."}, {"time": 4019, "text": "This point was made by my Hoover colleague, Manny Rincon Cruz last year, and I still wish he would write this up as a paper because it's a great insight."}, {"time": 4027, "text": "The second thing that's really interesting to me is that payments don't need to be money."}, {"time": 4032, "text": "And if we go around, as economists love to do, saying, well, Bitcoin's not money because it doesn't fulfill these criteria, we're missing the point that you could build a system of payments, which I think is how we should think about crypto that isn't money, doesn't need to be money."}, {"time": 4049, "text": "It's like bills of exchange."}, {"time": 4050, "text": "It's network based verification, peer to peer transactions without third party verification."}, {"time": 4058, "text": "When it hit me the other day that we actually have this precedent for crypto, I got quite excited and thought, I wish I had written that in the Ascent of Money."}, {"time": 4066, "text": "Can you sort of from a first principles, like almost like a physics perspective, or maybe a human perspective, describe where does the value of money come from?"}, {"time": 4078, "text": "Like where is it actually, where is it?"}, {"time": 4081, "text": "So it's a sheet of paper or it's coins, but it feels like in a platonic sense, there's some kind of thing that's actually storing the value."}, {"time": 4091, "text": "As us, a bunch of ants are dancing around and so on."}, {"time": 4095, "text": "I come from a family of physicists."}, {"time": 4097, "text": "I'm the black sheep of the family."}, {"time": 4098, "text": "My mother's a physicist, my sister is."}, {"time": 4101, "text": "And so when you asked me to explain something in physics terms, I get a kind of little part of me dies because I know I'll fail."}, {"time": 4110, "text": "But in truth, it doesn't really matter what we decide money is going to be."}, {"time": 4116, "text": "And anything can record, crystallize the relationship between the creditor and the debtor."}, {"time": 4126, "text": "It could be a piece of paper, it can be a piece of metal."}, {"time": 4128, "text": "It can be nothing, can just be a digital entry."}, {"time": 4131, "text": "It's trust that we're really talking about here."}, {"time": 4136, "text": "We are not just trusting one another."}, {"time": 4139, "text": "We may not, but we are trusting the money."}, {"time": 4143, "text": "So whatever we use to represent the creditor debtor relationship, whether it's a banknote or a coin or whatever, it does depend on us both trusting it."}, {"time": 4159, "text": "And that doesn't always pertain."}, {"time": 4161, "text": "What we see in episodes of inflation, especially episodes of hyperinflation, is a crisis of trust, a crisis of confidence in the means of payments."}, {"time": 4173, "text": "And this is very traumatic for the societies to which it happens."}, {"time": 4178, "text": "By and large, human beings, particularly once you have a rule of law system of the sort that evolved in the West and then became generalized, are predisposed to trust one another."}, {"time": 4189, "text": "And the default setting is to trust money."}, {"time": 4192, "text": "Even when it depreciates at a quite steady rate as the US dollar has done pretty much uninterruptedly since the 1960s, it takes quite a big disruption for money to lose that trust."}, {"time": 4207, "text": "But I think essentially what money should be thought of as is a series of tokens that can take any form we like and can be purely digital, which represent our transactions as creditors and debtors."}, {"time": 4223, "text": "And the whole thing depends on our collective trust to work."}, {"time": 4227, "text": "I had to explain this to Stephen Colbert once in the Colbert Show, the old show that was actually funny."}, {"time": 4233, "text": "And it was a great moment when he said, so Neil, could I be money?"}, {"time": 4241, "text": "And I said, yes, we could settle a debt with a human being that was quite common in much of history, but it's not the most convenient form of money."}, {"time": 4255, "text": "Money has to be convenient."}, {"time": 4256, "text": "That's why when they worked out how to make payments with cell phones, the Chinese simply went straight there from bank accounts."}, {"time": 4264, "text": "They skipped out credit cards."}, {"time": 4266, "text": "You won't see credit cards in China, except in the hands of naive tourists."}, {"time": 4270, "text": "How much can this trust bear in terms of us humans with our human nature testing it?"}, {"time": 4278, "text": "I guess the surprising thing is the thing works."}, {"time": 4281, "text": "A bunch of self interested ants running around trading in trust."}, {"time": 4287, "text": "And it seems to work except for a bunch of moments in human history when there's hyperinflation, like you mentioned."}, {"time": 4294, "text": "And it's just kind of amazing."}, {"time": 4298, "text": "It's kind of amazing that us humans, if I were to be optimistic and sort of hopeful about human nature, it gives me a sense that people want to lean on each other."}, {"time": 4309, "text": "They want to trust."}, {"time": 4311, "text": "That's certainly, I would say probably now, a widely shared view amongst evolutionary psychologists, network scientists."}, {"time": 4320, "text": "It's one of Nicholas Christakis's argument in a recent book."}, {"time": 4325, "text": "I know economic history broadly bears this out, but you have to be cautious."}, {"time": 4332, "text": "The cases where the system works are familiar to us."}, {"time": 4338, "text": "Because those are the states and the eras that produce a lot of written records."}, {"time": 4346, "text": "But when the system of trust collapses and the monetary system collapses with it, there's generally quite a paucity of records."}, {"time": 4355, "text": "I found that when I was writing Doom."}, {"time": 4358, "text": "And so we slightly are biased in favor of the periods when trust prevailed and the system functioned."}, {"time": 4367, "text": "It's very easy to point to a great many episodes of very, very intense monetary chaos, even in the relatively recent past."}, {"time": 4375, "text": "In the wake of the First World War, multiple currencies, not just the German currency, multiple currencies were completely destroyed."}, {"time": 4383, "text": "The Russian currency, the Polish currency."}, {"time": 4385, "text": "There were currency disasters all over Central and Eastern Europe in the early 1920s."}, {"time": 4392, "text": "And that was partly because over the course of the 19th century, a system had evolved in which trust was based on gold and rules that were supposedly applied by central banks."}, {"time": 4407, "text": "That system, which produced relative price stability over the 19th century, fell apart as a result of the First World War."}, {"time": 4416, "text": "And as soon as it was gone, as soon as there was no longer a clear link between those banknotes and coins and gold, the whole thing went completely haywire."}, {"time": 4427, "text": "And I think we should remember that the extent of the monetary chaos from certainly 1918 all the way through to the late 1940s."}, {"time": 4436, "text": "I mean, the German currency was destroyed not once but twice in that period."}, {"time": 4440, "text": "And that was one of the most advanced economies in the world."}, {"time": 4442, "text": "In the United States, there were periods of intensely deep deflation."}, {"time": 4449, "text": "Prices fell by a third in the Great Depression."}, {"time": 4452, "text": "And then very serious price volatility in the immediate post World War II period."}, {"time": 4457, "text": "So it's a bit of an illusion."}, {"time": 4459, "text": "Maybe it's an illusion for people who've spent most of their lives in the last 20 years."}, {"time": 4466, "text": "We've had a period of exceptional price stability since this century began in which a regime of central bank independence and inflation targeting appeared to generate steady below 2% inflation in much of the developed world."}, {"time": 4483, "text": "It was a bit too low for the central bankers liking."}, {"time": 4486, "text": "And that became a problem in the financial crisis."}, {"time": 4489, "text": "But we've avoided major price instability for the better part of 20 years."}, {"time": 4494, "text": "In most of the world, there haven't really been that many very high inflation episodes and hardly any hyperinflationary episodes."}, {"time": 4500, "text": "Venezuela's one of the very few, Zimbabwe's another."}, {"time": 4503, "text": "But if you take a 100 year view or a 200 year view, or if you want to take a 500 year view, you realize that quite often the system doesn't work."}, {"time": 4512, "text": "If you go back to the 17th century, there were multiple competing systems of coinage."}, {"time": 4517, "text": "There had been a great inflation that had begun the previous century."}, {"time": 4521, "text": "The price revolution caused mainly by the rise and caused mainly by the arrival of new world silver."}, {"time": 4528, "text": "I think financial history is a bit messier than one might think."}, {"time": 4533, "text": "And the more one studies it, the more one realizes the need for the evolution."}, {"time": 4540, "text": "The reason bills of exchange came along was because the coinage systems had stopped working."}, {"time": 4545, "text": "The reason that banknotes started to become used more generally first in the American colonies in the 17th century, then more widely in the 18th century was just that they were more convenient than any other way of paying for things."}, {"time": 4557, "text": "We had to invent the bond market in the 18th century to cope with the problem of public debt, which up until that point had been a recurrent source of instability."}, {"time": 4566, "text": "And then we invented equity finance because bonds were not enough."}, {"time": 4572, "text": "So I would prefer to think of the financial history as a series of crises really that are resolved by innovations and in the most recent episode, very exciting episode of financial history, something called Bitcoin initiated a new financial or monetary revolution in response, I think, to the growing crisis of the fiat money system."}, {"time": 4597, "text": "So what do you think about Bitcoin?"}, {"time": 4601, "text": "What do you think it is a response to?"}, {"time": 4603, "text": "What are the growing problems of the fiat system?"}, {"time": 4606, "text": "What is this moment in human history that is full of challenges that Bitcoin and cryptocurrency is trying to overcome?"}, {"time": 4615, "text": "I don't think Bitcoin was devised by Satoshi, whoever he was, for fear of a breakdown of the fiat currencies."}, {"time": 4628, "text": "If it was, it was a very far sighted enterprise because certainly in 2008, when the first Bitcoin paper appeared, it wasn't very likely that a wave of inflation was coming."}, {"time": 4638, "text": "If anything, there was more reason to fear deflation at that point."}, {"time": 4642, "text": "I think it would be more accurate to say that with the advent of the internet, there was a need for a means of payment native to the internet, typing your credit card number into a random website."}, {"time": 4656, "text": "It's not the way to pay for things on the internet."}, {"time": 4660, "text": "And I'd rather think of Bitcoin as the first iteration, the first attempt to solve the problem of how do we pay for things in what we must learn to call the metaverse, but let's just call it the internet for old time's sake."}, {"time": 4672, "text": "And ever since that initial innovation, the realization that you could use computing power and cryptography to create peer to peer payments without third party verification, a revolution has been gathering momentum that poses a very profound threat to the existing legacy system of banks and fiat currencies."}, {"time": 4693, "text": "Most money in the world today is made by banks, not central banks, banks."}, {"time": 4697, "text": "That's what most money is, it's entries in bank accounts."}, {"time": 4701, "text": "And what Bitcoin represents is an alternative mode of payment that really ought to render banks obsolete."}, {"time": 4711, "text": "I think this financial revolution has got past the point at which it can be killed."}, {"time": 4717, "text": "It was vulnerable in the early years, but it now has sufficient adoption and has generated sufficient additional layers."}, {"time": 4725, "text": "I mean, Ethereum was in many ways the more important innovation because you can build a whole system of payments and ultimately smart contracts on top of ether."}, {"time": 4735, "text": "I think we've now reached the point that it's pretty hard to imagine it all being killed."}, {"time": 4739, "text": "And it's just survived an amazing thing, which was the Chinese shutting down mining and shutting down everything."}, {"time": 4744, "text": "And still here we are, in fact, cryptos thriving."}, {"time": 4749, "text": "What we don't know is how much damage ill judged regulatory interventions are going to do to this financial revolution."}, {"time": 4759, "text": "Left to its own devices, I think decentralized finance provides the native monetary and financial system for the internet."}, {"time": 4769, "text": "And the more time we spend in the metaverse, the more use we will make of it."}, {"time": 4774, "text": "The next things that will happen, I think, will be that tokens in game spaces like Roblox will become fungible."}, {"time": 4782, "text": "As my nine year old spends a lot more time playing on computer games than I ever did, I can see that entertainment is becoming a game driven phenomenon."}, {"time": 4792, "text": "And in the game space, you need skins for your avatar."}, {"time": 4796, "text": "The economics of the internet, it's evolving very fast."}, {"time": 4801, "text": "And in parallel, you can see this payments revolution happening."}, {"time": 4804, "text": "I think that all goes naturally very well and generates an enormous amount of wealth in the process."}, {"time": 4813, "text": "The problem is there are people in Washington with an overwhelming urge to intervene and disrupt this evolutionary process."}, {"time": 4825, "text": "Partly, I think out of a muddled sense that there must be a lot of nefarious things going on."}, {"time": 4831, "text": "If we don't step in, many more will go on."}, {"time": 4834, "text": "This, I think, greatly exaggerates how much criminal activity is in fact going on in the space."}, {"time": 4839, "text": "But there's also the vested interests at work."}, {"time": 4842, "text": "It was odd to me, maybe not odd, perhaps it wasn't surprising, that the Bank for International Settlements earlier this year published a report, one chapter of which said this must all go, must all stop."}, {"time": 4855, "text": "It's all gotta be shut down and it's gotta be replaced by central bank digital currency."}, {"time": 4860, "text": "And Martin Wolf in the Financial Times read this and said, I agree with this."}, {"time": 4864, "text": "And one suddenly realized that the banks are clever."}, {"time": 4867, "text": "They had achieved the intellectual counterattack with almost no fingerprints on the weapon."}, {"time": 4875, "text": "I think central bank digital currency is a terrible idea."}, {"time": 4878, "text": "I can't imagine why we would want to copy a Chinese model that essentially takes all transactions and puts them directly under the surveillance of a central government institution."}, {"time": 4888, "text": "But that suddenly is a serious counterproposal."}, {"time": 4921, "text": "That's one alternative."}, {"time": 4923, "text": "But on the other side, we have a highly centralized system in which transactions will by default be under the surveillance of the central bank."}, {"time": 4930, "text": "It seems like an easy choice to me, but hey, I have this thing about personal liberty."}, {"time": 4937, "text": "I don't think that the regulators can kill web three."}, {"time": 4942, "text": "I think we're supposed to call it web three because crypto is now an obsolescent term."}, {"time": 4946, "text": "They can't kill it, but they can definitely make it difficult and throw a lot of sand into the machine."}, {"time": 4953, "text": "And I think worst of all, they can spoil the evolutionary story by creating central bank digital currency that I don't think we really need."}, {"time": 4962, "text": "Or we certainly don't need it in the Chinese form."}, {"time": 4968, "text": "Do you think Bitcoin has a strong chance to take over the world?"}, {"time": 4973, "text": "So become the primary, you mentioned the three things that make money, money, become the primary methodology by which we store wealth, we exchange."}, {"time": 4987, "text": "No, I think what Bitcoin is, this was a phrase that I got from my friend, Matt McLennan at First Eagle, an option on digital gold."}, {"time": 4995, "text": "So it's the gold of the system, but currently behaves like an option."}, {"time": 5000, "text": "That's why it's quite volatile because we don't really know if this brave new world of crypto is gonna work."}, {"time": 5009, "text": "But if it does work, then Bitcoin is the gold because of the finite supply."}, {"time": 5013, "text": "What role we need gold to play in the metaverse isn't quite clear."}, {"time": 5018, "text": "I love that you're using the term metaverse."}, {"time": 5021, "text": "Well, I just like the metaversity as the antithesis of what we're trying to do in Austin."}, {"time": 5028, "text": "But can you imagine I'm using it sarcastically?"}, {"time": 5032, "text": "I come from Glasgow where all novel words have to be used sarcastically."}, {"time": 5035, "text": "So the metaverse, sarcastic."}, {"time": 5037, "text": "But see, the beauty about humor and sarcasm is that the joke becomes reality."}, {"time": 5043, "text": "I mean, it's like using the word Big Bang to describe the origins of the universe."}, {"time": 5047, "text": "It becomes like that."}, {"time": 5050, "text": "After a while, it's in the textbooks and nobody's laughing."}, {"time": 5052, "text": "Yeah, well, that's exactly right."}, {"time": 5054, "text": "Humor is sticky."}, {"time": 5056, "text": "Yeah, I'm on the side of humor, but it is a dangerous activity these days."}, {"time": 5061, "text": "Anyway, I think Bitcoin is the option of digital gold."}, {"time": 5065, "text": "The role it plays is probably not so much store of value."}, {"time": 5071, "text": "Right now, it's just nicely not very correlated asset in your portfolio."}, {"time": 5075, "text": "When I updated the Ascent of Money, which was in 2018, 10 years after it came out, I wrote a new chapter in which I said, Bitcoin, which had just sold off after its 2017 bubble, will rise again through adoption because if every millionaire in the world has 0.2% of his or her wealth in Bitcoin, the price should be $15,000."}, {"time": 5099, "text": "If it's 1%, it's $75,000."}, {"time": 5103, "text": "And it might not even stay at 1% because, I mean, look at its recent performance."}, {"time": 5108, "text": "If your exposure to global stocks had been hedged with a significant crypto holding, you would have aced the last few months."}, {"time": 5119, "text": "So I think the non correlation property is very, very important in driving adoption."}, {"time": 5126, "text": "And the volatility also drives adoption if you're a sophisticated investor."}, {"time": 5131, "text": "So I think the adoption drives Bitcoin up because it's the option of digital gold, but it's also just this nicely not very correlated asset that you wanna hold."}, {"time": 5141, "text": "In a world where, what the hell?"}, {"time": 5143, "text": "I mean, the central bank's gonna tighten."}, {"time": 5146, "text": "We've come through this massively disruptive effort of the pandemic, public debt soared, money printing soared."}, {"time": 5154, "text": "You could hang around with your bonds and wait for the euthanasia of the Rontier."}, {"time": 5159, "text": "You can hang on to your tech stocks and just hope there isn't a massive correction or dot, dot, dot."}, {"time": 5165, "text": "Well, and it seems like a fairly obvious strategy to make sure that you have at least some crypto for the coming year, given what we likely have to face."}, {"time": 5175, "text": "I think what's really interesting is that on top of Ethereum, a more elaborate financial system is being built."}, {"time": 5186, "text": "Stable coins are the interesting puzzle for me because we need off ramps."}, {"time": 5194, "text": "Ultimately, you and I have to pay taxes in US dollars."}, {"time": 5199, "text": "And there's no getting away from that."}, {"time": 5203, "text": "The IRS is gonna let us hold crypto as long as we pay our taxes."}, {"time": 5208, "text": "And the only question in my mind is what's the optimal off ramp to make those taxes, make those tax payments?"}, {"time": 5217, "text": "Probably it shouldn't be a currency invented by Facebook."}, {"time": 5221, "text": "Never struck me as the best solution to this problem."}, {"time": 5225, "text": "Maybe it's some kind of Fed coin or maybe one of the existing algorithmic stable coins does the job."}, {"time": 5233, "text": "But we clearly need some stable off ramp."}, {"time": 5236, "text": "So you don't think it's possible for the IRS within the next decade to be accepting Bitcoin as tax payments?"}, {"time": 5242, "text": "I doubt that."}, {"time": 5244, "text": "Having dealt with the IRS now since when did I first come here, 2002, it's hard to think of an institution less likely to leap into the 21st century when it comes to payments."}, {"time": 5257, "text": "No, I think we'll be tolerated, crypto world will be tolerated as long as we pay our taxes."}, {"time": 5266, "text": "And it's important that we're already at that point."}, {"time": 5268, "text": "And then the next question becomes, well, does Gary Gensler define everything as a security?"}, {"time": 5273, "text": "And do we then have to go through endless regulatory contortions to satisfy the SEC?"}, {"time": 5280, "text": "There's a whole bunch of uncertainties that the administrative state excels at creating because that's just how the administrative state works."}, {"time": 5289, "text": "You'll do something new."}, {"time": 5290, "text": "Hmm, I'll decide whether that's a security but don't expect me to define it for you."}, {"time": 5295, "text": "I'll decide in an arbitrary way and then you'll owe me money."}, {"time": 5298, "text": "So all of this is going to be very annoying."}, {"time": 5301, "text": "And for people who are trying to run exchanges or innovate in the space, these regulations will be annoying."}, {"time": 5309, "text": "But the problem with FinTech is it's different from tech, broadly defined."}, {"time": 5313, "text": "When tech got into eCommerce with Amazon, when it got into social networking with Facebook, there wasn't a huge regulatory jungle to navigate."}, {"time": 5323, "text": "But welcome to the world of finance, which has always been a jungle of regulation because the regulation is there to basically entrench the incumbents."}, {"time": 5334, "text": "That's what it's for."}, {"time": 5336, "text": "So it'll be a much tougher fight than the fights we've seen of other aspects of the tech revolution because the incumbents are there and they see the threat."}, {"time": 5349, "text": "And in the end, Satoshi said it very explicitly."}, {"time": 5353, "text": "It's peer to peer payment without third party verification."}, {"time": 5355, "text": "And all the third parties are going, wait, what?"}, {"time": 5358, "text": "We're the third parties."}, {"time": 5360, "text": "So there is a connection between power and money."}, {"time": 5364, "text": "You've mentioned World War I from the perspective of money."}, {"time": 5369, "text": "So power, money, war, authoritarian regimes."}, {"time": 5375, "text": "From the perspective of money, do you have hope that cryptocurrency can help resist war, can help resist the negative effects of authoritarian regimes?"}, {"time": 5388, "text": "Or is that a silly hope?"}, {"time": 5390, "text": "Wars happen because the people who have the power to command armed forces miscalculate."}, {"time": 5402, "text": "That's generally what happens."}, {"time": 5406, "text": "And we will have a big war in the near future if both the Chinese government and the US government miscalculates and they unleash lethal force on one another."}, {"time": 5417, "text": "And there's nothing that any financial institution can do to stop that any more than the Rothschilds could stop World War I."}, {"time": 5426, "text": "And they were then the biggest bank in the world by far with massive international financial influence."}, {"time": 5432, "text": "So let's accept that war is in a different domain."}, {"time": 5438, "text": "War would impact the financial world massively if it were a war between the United States and China because there's still a huge China trade on."}, {"time": 5449, "text": "Wall Street is long China, Europe is long China."}, {"time": 5454, "text": "So the conflict that I can foresee in the future is one that's highly financially disruptive."}, {"time": 5460, "text": "Where does crypto fit in?"}, {"time": 5462, "text": "Crypto's obvious utility in the short run is as a store of wealth, of transferable wealth for people who live in a world of transferable wealth for people who live in dangerous places with failing, not just failing money, but failing rule of law."}, {"time": 5481, "text": "That's why in Latin America, there's so much interest in crypto because Latin Americans have a lot of monetary history to look back on and not much of it is good."}, {"time": 5490, "text": "So I think that the short run problem that crypto solves is, and this goes back to the digital gold point, if you are in a dangerous place with weak rule of law and weak property rights, here is a new and better way to have portable wealth."}, {"time": 5511, "text": "I think the next question to ask is, would you want to be long crypto in the event of World War III?"}, {"time": 5522, "text": "What's interesting about that question is that World War III would likely have a significant cyber dimension to it."}, {"time": 5527, "text": "And I don't want to be 100% in crypto if they crash the internet, which between them, China and Russia might be able to do."}, {"time": 5537, "text": "That's a fascinating question, whether you want to be holding physical gold or digital gold in the event of World War III."}, {"time": 5545, "text": "The smart person who studied history definitely wants a bit of both."}, {"time": 5549, "text": "And so let's imagine World War III has a very, very severe cyber component to it with high levels of disruption."}, {"time": 5558, "text": "Yeah, you'd be glad of the old shiny stuff at that point."}, {"time": 5563, "text": "So diversification still seems like the most important truth of financial history."}, {"time": 5572, "text": "And what is crypto?"}, {"time": 5573, "text": "It's just this wonderful new source of diversification, but you'd be nuts to be 100% in Bitcoin."}, {"time": 5579, "text": "I mean, I have some friends who are probably quite close to that."}, {"time": 5584, "text": "Close to 100%, yeah."}, {"time": 5585, "text": "I'd mar the balls of steel."}, {"time": 5591, "text": "Yeah, in whatever way that balls of steel takes form."}, {"time": 5598, "text": "You mentioned smart contracts."}, {"time": 5600, "text": "What are your thoughts about, in the context of the history of money, about Ethereum, about smart contracts, about kind of more systematic at scale formalization of agreements between humans?"}, {"time": 5613, "text": "Well, I think it must be the case that a lot of the complexity in a mortgage is redundant."}, {"time": 5629, "text": "That when we are confronted with pages and pages and pages and pages of small prints, we're seeing some manifestation of the late stage regulatory state."}, {"time": 5641, "text": "The transaction itself is quite simple."}, {"time": 5644, "text": "And most of the verbiage is just ass covering by regulators."}, {"time": 5649, "text": "So I think the smart contract, although I'm sure lawyers will email me and tell me I'm wrong, can deal with a lot of the plain vanilla and maybe not so plain transactions that we want to do and eliminate yet more intermediaries."}, {"time": 5668, "text": "That's my kind of working assumption."}, {"time": 5671, "text": "And given that a lot of financial transactions have the potential at least to be simplified, automated, turned into smart contracts, that's probably where the future goes."}, {"time": 5688, "text": "I can't see an obvious reason why my range of different financial needs, let's think about insurance, for example, will continue to be met with instruments that in some ways are 100 years old."}, {"time": 5705, "text": "So I think we're still at an early stage of a financial revolution that will greatly streamline how we take care of all those financial needs that we have, mortgages and insurance leap to mind."}, {"time": 5720, "text": "Most households are penalized for being financially poorly educated and confronted with oligopolistic financial services providers."}, {"time": 5731, "text": "So you kind of leave college already in debt."}, {"time": 5735, "text": "So you start in debt servitude and then you got to somehow lever up to buy a home if you can, because everybody's kind of telling you you should do that."}, {"time": 5747, "text": "So you and your spouse, you are getting even more leveraged and your long one asset class called real estate, which is super illiquid."}, {"time": 5759, "text": "I mean, already I'm crying inside at the thought of describing so many households financial predicament in that way, and I'm not done with them yet because, oh, by the way, there's all this insurance you have to take out and here are the providers that are willing to insure you and here are the premiums you're gonna be paying, which are kind of presented to you."}, {"time": 5779, "text": "That's your car insurance, that's your home insurance."}, {"time": 5782, "text": "And if you're here, it's the earthquake insurance."}, {"time": 5783, "text": "And pretty soon you're just bleeding money in a bunch of monthly payments to the mortgage lender, to the insurer, to all the other people that lent you money."}, {"time": 5795, "text": "And let's look at your balance sheet, it sucks."}, {"time": 5799, "text": "There's this great big chunk of real estate and what else have you really got on there?"}, {"time": 5803, "text": "And the other side is a bunch of debt, which is probably paying too high interest."}, {"time": 5808, "text": "The typical household in the median kind of range is at the mercy of oligopolistic financial services providers."}, {"time": 5817, "text": "Go down further in the social scale and people are outside the financial system altogether."}, {"time": 5823, "text": "And those poor folks have to rely on bank notes and informal lending with huge punitive rates."}, {"time": 5830, "text": "We have to do better than this."}, {"time": 5832, "text": "This has to be improved upon."}, {"time": 5835, "text": "And I think what's exciting about our time is that technology now exists that didn't exist when I wrote The Ascent of Money to solve these problems."}, {"time": 5842, "text": "When I wrote The Ascent of Money, which was in 2008, you couldn't really solve the problem I've just described."}, {"time": 5850, "text": "Certainly you couldn't solve it with something like microfinance."}, {"time": 5852, "text": "That was obviously not viable."}, {"time": 5855, "text": "The interest rates were high, the transaction costs were crazy, but now we have solutions and the solutions are extremely exciting."}, {"time": 5863, "text": "So FinTech is this great force for good that brings people into the financial system and reduces transaction costs."}, {"time": 5870, "text": "Crypto is part of it, but it's just part of it."}, {"time": 5873, "text": "There's a much broader story of FinTech going on here where suddenly you get financial services on your phone, don't cost nearly as much as they did when there had to be a bricks and mortar building on main street that you kind of went humbly and beseeched to lend you money."}, {"time": 5890, "text": "I'm excited about that because it seems to me very socially transformative."}, {"time": 5894, "text": "I'll give you one other example of what's great."}, {"time": 5897, "text": "The people who really get sculpted in our financial system are senders and receivers of remittances, which are often amongst the poorest families in the world."}, {"time": 5909, "text": "The people who are like my wife's family in East Africa really kind of hand to mouth."}, {"time": 5914, "text": "And if you send money to East Africa or the Philippines or Central America, it's the transaction costs are awful."}, {"time": 5921, "text": "I'm talking to you, Western Union."}, {"time": 5924, "text": "We're going to solve that problem."}, {"time": 5927, "text": "So 10 years from now, the transaction costs will just be negligible and the money will go to the people who need it rather than to rent seeking financial institutions."}, {"time": 5935, "text": "So I'm on the side of the revolution with this because I think the incumbent financial institutions globally are doing a pretty terrible job and middle class and lower class families lose out."}, {"time": 5948, "text": "And thankfully, technologically, technology allows us to fix this."}, {"time": 5951, "text": "Yeah, so FinTech can remove a lot of inefficiencies in the system."}, {"time": 5955, "text": "I'm super excited myself, maybe as a machine learning person in data oracles."}, {"time": 5960, "text": "So converting a lot of our physical world into data and have smart contracts on top of that."}, {"time": 5967, "text": "So that no longer is there's this fuzziness about what is the concrete nature of the agreements."}, {"time": 5974, "text": "You can tie your agreement to weather."}, {"time": 5977, "text": "You can tie your agreement to the behavior of certain kinds of financial systems."}, {"time": 5984, "text": "You can tie your behavior to, I don't know, I mean, all kinds of things."}, {"time": 5988, "text": "You can connect it to the body in terms of human sensory information."}, {"time": 5993, "text": "Like you can make an agreement that if you don't lose five pounds in the next month, you're going to pay me $1,000 or something like that."}, {"time": 6004, "text": "It's a stupid example, but it's not going to happen."}, {"time": 6006, "text": "It's a good example, but it's not because like you can create all kinds of services on top of that."}, {"time": 6011, "text": "You can just create all kinds of interesting applications that completely revolutionize how humans transact."}, {"time": 6019, "text": "I think, of course, we don't want to create a world of Chinese style social credit in which our behavior becomes so transparent to providers of financial services, particularly insurers that when I try to go into the pub, I'm stopped from doing so."}, {"time": 6044, "text": "Every time you take a drink, your insurance goes up."}, {"time": 6047, "text": "Right, or my credit card wouldn't work in certain restaurants because they serve ribeye steak."}, {"time": 6056, "text": "I fear that world because I see it being built in China."}, {"time": 6059, "text": "And we must at all costs make sure that the Western world has something distinctive to offer."}, {"time": 6067, "text": "It can't just be, oh, it's the same as in China."}, {"time": 6069, "text": "Only the data go to five tech companies rather than to Xi Jinping."}, {"time": 6076, "text": "So I think that the way we need to steer this world is in the way that our data are by default are by default vaulted on our devices and we choose when to release the data rather than the default setting being that the data are available."}, {"time": 6100, "text": "That's important, I think, because it was one of the biggest mistakes of the evolution of the internet that in a way the default was to let our data be plundered."}, {"time": 6110, "text": "It's hard to undo that, but I think we can at least create a new regime that in future makes privacy default rather than open access default."}, {"time": 6124, "text": "In the book, Doom, The Politics of Catastrophe, your newest book, you describe wars, pandemics and the terrible disasters in human history, which stands out to you as the worst in terms of how much it shook the world and the human spirit."}, {"time": 6142, "text": "I am glad I was not around in the mid 14th century when the bubonic plague swept across Eurasia."}, {"time": 6152, "text": "As far as we can see, that was history's worst pandemic."}, {"time": 6156, "text": "Maybe there was a comparably bad one in the reign of the emperor Justinian, but there's some reason to think it wasn't as bad."}, {"time": 6165, "text": "And the more we learn about the 14th century, the more we realize that it really was across Eurasia and the mortality was 30% in some places, 50% in some places higher."}, {"time": 6180, "text": "There were whole towns that were just emptied."}, {"time": 6183, "text": "And when one reads about the Black Death, it's an unimaginable nightmare of death and madness in the death with flagellant orders wandering from town to town."}, {"time": 6198, "text": "Town to town seeking to ward off divine retribution by flogging themselves, people turning on the local Jewish communities as if it's somehow their fault."}, {"time": 6208, "text": "That must have been a nightmarish time."}, {"time": 6212, "text": "If you ask me for an also random runner up, it would be World War II in Eastern Europe."}, {"time": 6222, "text": "And in many ways, it might have been worse because for a medieval peasant, the sense of being on the wrong side of divine retribution must have been overpowering."}, {"time": 6236, "text": "In the mid 20th century, you knew that this was manmade murder on a massive industrial scale."}, {"time": 6246, "text": "If one reads Grossman's Life and Fate, just to take one example, one enters a hellscape that it's extremely hard to imagine oneself in."}, {"time": 6261, "text": "So these are two of the great disasters of human history."}, {"time": 6264, "text": "And if we did have a time machine, if one really were able to transport people back and give them a glimpse of these times, I think the post traumatic stress would be enormous."}, {"time": 6277, "text": "People would come back from those trips even if it was a one day excursion with guaranteed survival in a state of utter shock."}, {"time": 6288, "text": "You often explore counterfactual and hypothetical history, which is a fascinating thing to do, sometimes to a controversial degree."}, {"time": 6297, "text": "And again, you walk through that fire gracefully."}, {"time": 6301, "text": "So let me ask maybe about World War II or in general, what key moments in history of the 20th century do you think if something else happened at those moments, we could have avoided some of the big atrocities, Stalin's Baltimore, Hitler's Holocaust, Mao's Great Chinese Famine?"}, {"time": 6325, "text": "The great turning point in world history is August the 2nd, 1914, when the British cabinet decides to intervene and what would have been a European war becomes a world war."}, {"time": 6346, "text": "And with British intervention, it becomes a massively larger and more protracted conflict."}, {"time": 6351, "text": "So very early in my career, I became very preoccupied with the deliberations on that day and the surprising decision that a liberal cabinet took to go to war, which you might not have bet on that morning because there seemed to be a majority of cabinet members who would be disinclined and only a minority, including Winston Churchill, who wanted to go to war."}, {"time": 6375, "text": "So that's one turning point."}, {"time": 6376, "text": "I often wish I could get my time machine working and go back and say, wait, stop."}, {"time": 6382, "text": "Just think about what you're going to do."}, {"time": 6384, "text": "And by the way, let me show you a video of Europe in 1918."}, {"time": 6389, "text": "Can we linger on that one?"}, {"time": 6391, "text": "That one, a lot of people push back on you because it's so difficult."}, {"time": 6400, "text": "So the idea is, if I could try to summarize, and you're the first person that made me think about this very uncomfortable thought, which is the ideas in World War I, it would be a better world if Britain stayed out of the war and Germany won."}, {"time": 6454, "text": "Well, that's one heck of an example of why you're just like fearless in this particular style of exploring counterfactual history."}, {"time": 6464, "text": "So can you elaborate on that idea and maybe why this was such an important day in human history?"}, {"time": 6472, "text": "This argument was central to my book, The Pity of War."}, {"time": 6475, "text": "I also did an essay in virtual history about this and it's always amused me that from around that time, I began to be called a conservative historian because it's actually a very left wing argument."}, {"time": 6485, "text": "The people in 1914 who thought Britain should stay at the war were the left of the Labour Party, who split to become the Independent Labour Party."}, {"time": 6494, "text": "What would have happened?"}, {"time": 6496, "text": "Well, first of all, Britain was not ready for war in 1914."}, {"time": 6499, "text": "There had not been conscription."}, {"time": 6501, "text": "The army was tiny."}, {"time": 6503, "text": "So Britain had failed to deter Germany."}, {"time": 6505, "text": "The Germans took the decision that they could risk going through Belgium using the Schlieffen Plan to fight their two front war."}, {"time": 6514, "text": "They calculated that Britain's intervention would either not happen or not matter."}, {"time": 6521, "text": "If Britain had been strategically committed to preventing Germany winning a war in Europe, they should have introduced conscription 10 years before, had a meaningful land army and that would have deterred the Germans."}, {"time": 6535, "text": "So the Liberal government provided the worst of both worlds, a commitment that was more or less secret to intervene that the public didn't know about."}, {"time": 6545, "text": "In fact, much of the Liberal Party didn't know about, but without really the means to make that intervention effective, a tiny army with just a few divisions."}, {"time": 6554, "text": "So it was perfectly reasonable to argue as a number of people did on August the 2nd, 1914, that Britain should not intervene."}, {"time": 6561, "text": "After all, Britain had not immediately intervened against the French Revolutionary armies back in the 1790s."}, {"time": 6567, "text": "It had played an offshore role, ultimately intervening, but not immediately intervening."}, {"time": 6572, "text": "If Britain had stayed out, I don't think that France would have collapsed immediately as it had in 1870."}, {"time": 6580, "text": "The French held up remarkably well to catastrophic casualties in the first six months of the First World War."}, {"time": 6587, "text": "But by 1916, I don't see how France could have kept going if Britain had not joined the war."}, {"time": 6594, "text": "And I think the war would have been over perhaps at some point in 1916."}, {"time": 6599, "text": "We know that Germany's aims would have been significantly limited because they would have needed to keep Britain out."}, {"time": 6604, "text": "If they'd succeeded in keeping Britain out, they'd have had to keep Britain out."}, {"time": 6607, "text": "And the way to keep Britain out was obviously not to make any annexation of Belgium, to limit German war aims, particularly to limit them to Eastern Europe."}, {"time": 6616, "text": "And from Britain's point of view, what was not to like?"}, {"time": 6619, "text": "So the Russian Empire is defeated along with France."}, {"time": 6624, "text": "What does that really change?"}, {"time": 6627, "text": "If the Germans are sensible and we can see what this might've looked like, they focus on Eastern Europe, they take chunks of the Russian Empire, perhaps they create as they did in the piece of Brest Litovsk, an independent or quasi independent Poland."}, {"time": 6647, "text": "In no way does that pose a threat to the British Empire."}, {"time": 6649, "text": "In fact, it's a good thing."}, {"time": 6652, "text": "Britain never had had a particularly good relationship with the Russian Empire after all."}, {"time": 6657, "text": "The key point here is that the Germany that emerges from victory in 1916 has a kind of European union."}, {"time": 6665, "text": "It's the dominant power of an enlarged Germany with a significant middle Europa, whatever you want to call it, customs union type arrangement with neighboring countries, including one suspects, Austria, Hungary."}, {"time": 6682, "text": "That is a very different world from the world of 1917, 18."}, {"time": 6687, "text": "The protraction of the war for a further two years, it's globalization, which Britain's intervention made inevitable."}, {"time": 6696, "text": "As Philip Zelikow showed in his recent book on the failure to make peace in 1916, Woodrow Wilson tried and failed to intervene and broker a peace in 1916."}, {"time": 6707, "text": "So I'm not the only counterfactualist here."}, {"time": 6710, "text": "The extension of the war for a further two years with escalating slaughter, the death toll rose because the industrial capacity of the armies grew greater."}, {"time": 6720, "text": "That's what condemns us to the Bolshevik revolution."}, {"time": 6724, "text": "And it's what condemns us ultimately to Nazism because it's out of the experience of defeat in 1918 as Hitler makes clear in Mein Kampf that he becomes radicalized and enters the political realm."}, {"time": 6741, "text": "Take out those additional years of war and Hitler's just a failed artist."}, {"time": 6746, "text": "It's the end of the war that turns him into the demagogue."}, {"time": 6753, "text": "You asked what are the things that avoid the totalitarian states."}, {"time": 6758, "text": "As I've said, British nonintervention for me is the most plausible and it takes out all of that malignant history that follows from the Bolshevik revolution."}, {"time": 6768, "text": "It's very hard for me to see how Lenin gets anywhere if the war is over."}, {"time": 6773, "text": "That looks like the opportunity for the constitutional elements, the liberal elements in Russia."}, {"time": 6782, "text": "There are other moments at which you can imagine history taking a different path."}, {"time": 6787, "text": "If the provisional government in Russia had been more ruthless, it was very lenient towards the Bolsheviks, but if it had just rounded them up and shot the Bolshevik leadership, that would have certainly cut the Bolshevik revolution off."}, {"time": 6803, "text": "One looks back on the conduct of the Russian liberals with the kind of despair at their failure to see the scale of the threat that they faced and the ruthlessness that the Bolshevik leadership would evince."}, {"time": 6815, "text": "There's a counterfactual in Germany, which is interesting."}, {"time": 6820, "text": "I think the Weimar Republic destroyed itself in two disastrous economic calamities, the inflation and then the deflation."}, {"time": 6831, "text": "It's difficult for me to imagine Hitler getting to be Reich Chancellor without those huge economic disasters."}, {"time": 6839, "text": "So another part of my early work explored alternative policy options that the German Republic, the Weimar Republic might have pursued."}, {"time": 6849, "text": "There are other contingencies that spring to mind."}, {"time": 6852, "text": "In 1936 or 38, I think more plausibly 38, Britain should have gone to war."}, {"time": 6859, "text": "The great mistake was Munich."}, {"time": 6863, "text": "Hitler was in an extremely vulnerable position in 1938, because remember, he didn't have Russia squared away as he would in 1938."}, {"time": 6871, "text": "As he would in 1939."}, {"time": 6873, "text": "Chamberlain's mistake was to fold instead of going for war as Churchill rightly saw."}, {"time": 6881, "text": "And there was a magical opportunity there that would have played into the hands of the German military opposition and conservatives to snuff Hitler out over Czechoslovakia."}, {"time": 6893, "text": "The point is that history is not some inexorable narrative, which can only end one way."}, {"time": 6901, "text": "It's a garden of forking paths."}, {"time": 6903, "text": "And many, many junctions in the road, there were choices that could have averted the calamities of the mid 20th century."}, {"time": 6914, "text": "I have to ask you about this moment, before you said I could go on, this moment of Chamberlain and Hitler, snuff Hitler out in terms of Czechoslovakia."}, {"time": 6925, "text": "And we'll return to the book Doom on this point."}, {"time": 6929, "text": "What does it take to be a great leader in the room with Hitler, or in the same time and space as Hitler, to snuff him out, to make the right decisions?"}, {"time": 6944, "text": "So it sounds like you put quite a bit of a blame on the man, Chamberlain, and give credit to somebody like a Churchill."}, {"time": 6953, "text": "So what is the difference?"}, {"time": 6954, "text": "Where's that line?"}, {"time": 6955, "text": "You've also written a book about Henry Kissinger, who's an interesting sort of person that's been throughout many difficult decisions in the games of power."}, {"time": 6966, "text": "So what does it take to be a great leader in that moment?"}, {"time": 6968, "text": "That particular moment, sorry to keep talking, is fascinating to me, because it feels like it's man on man conversations that define history."}, {"time": 6977, "text": "Well, Hitler was bluffing."}, {"time": 6979, "text": "He really wasn't ready for war in 1938."}, {"time": 6981, "text": "The German economy was clearly not ready for war in 1938."}, {"time": 6985, "text": "And Chamberlain made a fundamental miscalculation along with his advisors, because it wasn't all Chamberlain."}, {"time": 6993, "text": "He was in many ways articulating the establishment view."}, {"time": 6999, "text": "And I tried to show in a book called War of the World how that establishment worked."}, {"time": 7002, "text": "It extended through the BBC, into the aristocracy, to Oxford."}, {"time": 7007, "text": "There was an establishment view."}, {"time": 7008, "text": "Chamberlain personified it."}, {"time": 7009, "text": "Churchill was seen as a warmonger."}, {"time": 7013, "text": "He was at his lowest point of popularity in 1938."}, {"time": 7016, "text": "But what is it that Chamberlain gets wrong?"}, {"time": 7019, "text": "Because it's conceptual."}, {"time": 7020, "text": "Chamberlain is persuaded that Britain has to play for time because Britain is not ready for war in 1938."}, {"time": 7026, "text": "He fails to see that the time that he gets, that he buys at Munich is also available to Hitler."}, {"time": 7033, "text": "Everybody gets the time and Hitler's able to do much more with it because Hitler strikes the pact with Stalin that guarantees that Germany can fight a war on one front in 1939."}, {"time": 7045, "text": "What does Chamberlain do?"}, {"time": 7046, "text": "Build some more aircraft."}, {"time": 7048, "text": "So the great mistake of the strategy of appeasement was to play for time."}, {"time": 7052, "text": "I mean, they knew war was coming, but they were playing for time, not realizing that Hitler got the time too."}, {"time": 7059, "text": "And after he partitioned Czechoslovakia, he was in a much stronger position, not least because of all the resources that they were able to plunder from Czechoslovakia."}, {"time": 7070, "text": "So that was the conceptual mistake."}, {"time": 7072, "text": "Churchill played an heroic role in pointing out this mistake and predicting accurately that it would lead to war on worse terms."}, {"time": 7085, "text": "It takes a distinct courage to be unpopular."}, {"time": 7091, "text": "And Churchill was deeply unpopular at that point."}, {"time": 7093, "text": "People would listen to him in the House of Commons in silence."}, {"time": 7097, "text": "On one occasion, Lady Astor shouted, rubbish."}, {"time": 7102, "text": "So he went through a period of being hated on."}, {"time": 7106, "text": "The other thing that made Churchill a formidable leader was that he always applied history to the problem."}, {"time": 7112, "text": "And that's why he gets it right."}, {"time": 7115, "text": "He sees the historical problem much more clearly than Chamberlain."}, {"time": 7119, "text": "So I think if you go back to 1938, there's no realistic counterfactual in which Churchill's in government in 1938."}, {"time": 7128, "text": "You have to have France collapse for Churchill to come into government."}, {"time": 7131, "text": "But you can certainly imagine a Tory elite that's thinking more clearly about the likely dynamics."}, {"time": 7142, "text": "They haven't seen this, I guess, problem of conjecture, to take a phrase from Kissinger, which is that whatever they're doing in postponing the war has the potential to create a worse starting point for the war."}, {"time": 7160, "text": "It would have been risky in 1938, but it was a way better situation than they ended up with in 1939, a year later."}, {"time": 7167, "text": "You asked about Kissinger, and I've learned a lot from reading Kissinger and talking to Kissinger since I embarked on writing his biography a great many years ago."}, {"time": 7177, "text": "So I think one of the most important things I've learned is that you can apply history to contemporary problems."}, {"time": 7186, "text": "It may be the most important tool that we have in that kind of decision making."}, {"time": 7192, "text": "You have to do it quite ruthlessly and rigorously."}, {"time": 7198, "text": "And in the moment of crisis, you have to take risk."}, {"time": 7203, "text": "So Kissinger often says in his early work, the temptation of the bureaucrat is to wait for more data, but ultimately the decision making that we do under uncertainty can't be based on data."}, {"time": 7218, "text": "The problem of conjecture is that you could take an action now and incur some cost, an avert disaster, but you'll get no thanks for it because nobody is grateful for an averted disaster."}, {"time": 7232, "text": "And nobody goes around saying, wasn't it wonderful how we didn't have another 9 11."}, {"time": 7238, "text": "On the other hand, you can do nothing, incur no upfront costs and hope for the best."}, {"time": 7244, "text": "And you might get lucky, the disaster might not happen."}, {"time": 7247, "text": "That's in a democratic system, the much easier path to take."}, {"time": 7254, "text": "And I think that the essence of leadership is to be ready to take that upfront cost, avert the disaster and accept that you won't get gratitude."}, {"time": 7265, "text": "If I may make a comment, an aside about Henry Kissinger."}, {"time": 7270, "text": "So he, I think at 98 years old currently has still got it."}, {"time": 7277, "text": "It's very, very impressive."}, {"time": 7279, "text": "I can only hope that my brain has the same durability that his does because it's a formidable intellect and it's still in as sharp form as it was 50 years ago."}, {"time": 7291, "text": "So you mentioned Eric Schmidt's in his book and he reached out to me that he wanted to do this podcast."}, {"time": 7297, "text": "And I know Eric Schmidt, I've spoken to him before."}, {"time": 7301, "text": "I like him a lot, obviously."}, {"time": 7304, "text": "So they said, we could do a podcast for 40 minutes with Eric, 40 minutes with Eric and Henry together and 40 minutes with Henry."}, {"time": 7314, "text": "So those are three different conversations."}, {"time": 7318, "text": "And I had to like, I had to do some soul searching because I said, fine, 40 minutes with Eric."}, {"time": 7322, "text": "We'll probably talk many times again."}, {"time": 7324, "text": "Fine, let's talk about this AI book together for 40 minutes."}, {"time": 7329, "text": "But I said, what I wrote to them is that I would hate myself if I only have 40 minutes to talk to Henry Kissinger."}, {"time": 7336, "text": "And so I had to hold my ground, went back and forth and in the end decided to part ways over this."}, {"time": 7341, "text": "And I sometimes think about this kind of difficult decision in the podcasting space of when do you walk away?"}, {"time": 7354, "text": "Because there's a particular world leader that I've mentioned in the past where the conversation is very likely to happen."}, {"time": 7363, "text": "And as it happens, those conversations could often be, unfortunately this person only has 30 minutes now."}, {"time": 7373, "text": "I know we agreed for three hours, but unfortunately, and you have to decide, do I stand my ground on this point?"}, {"time": 7381, "text": "I suppose that's the thing that journalists have to think about, right?"}, {"time": 7384, "text": "Like, do I hold onto my integrity in whatever form that takes?"}, {"time": 7391, "text": "And do I stay my ground even if I lose a fascinating opportunity?"}, {"time": 7396, "text": "Anyway, it's something I thought about and something I think about."}, {"time": 7399, "text": "And with Henry Kissinger, I mean, he's had a million amazing conversations in your biography, so it's not like something is lost, but it was still nevertheless to me some soul searching that I had to do as a kind of practice for what to me is a higher stakes conversation."}, {"time": 7416, "text": "I'll just mention it as Vladimir Putin."}, {"time": 7420, "text": "I can have a conversation with him unlike any conversation he's ever had, partially because I'm a fluent Russian speaker, partially because I'm messed up in the head in certain kinds of ways that make for an interesting dynamic, because we're both Judo people, we both are certain kinds of human beings that can have a much deeper apolitical conversation."}, {"time": 7442, "text": "I have to ask to stay on the topic of leadership."}, {"time": 7445, "text": "You've, in your book, Doom, have talked about wars, pandemics throughout human history, and in some sense, saying that all of these disasters are manmade."}, {"time": 7460, "text": "So humans have a role in terms of the magnitude of the effect that they have on human civilization."}, {"time": 7467, "text": "Without taking cheap political shots, can we talk about COVID 19?"}, {"time": 7473, "text": "How will history remember the COVID 19 pandemic?"}, {"time": 7478, "text": "What were the successes, what were the failures of leadership of man, of humans?"}, {"time": 7484, "text": "Doom was a book that I was planning to write before the pandemic struck."}, {"time": 7492, "text": "As a history of the future based in large measure on science fiction."}, {"time": 7497, "text": "It had occurred to me in 2019 that I had spent too long not reading science fiction, and so I decided I would liven up my intake by getting off history for a bit and reading science fiction."}, {"time": 7512, "text": "Because history is great at telling you about the perennial problems of power."}, {"time": 7516, "text": "Putin is always interesting on history."}, {"time": 7518, "text": "He's become something of a historian recently with his essays and lectures."}, {"time": 7523, "text": "But what history is bad at telling you is, well, what will the effects of discontinuity of technology be?"}, {"time": 7529, "text": "And so I thought I need some science fiction to think more about this, because I'm tending to miss the importance of technological discontinuity."}, {"time": 7539, "text": "If you read a lot of science fiction, you read a lot of plague books, because science fiction writers are really quite fond of the plague scenario."}, {"time": 7548, "text": "So the world ends in many ways in science fiction, but one of the most popular is the lethal pandemic."}, {"time": 7552, "text": "So when the first email came to me, I think it was on January the 3rd from my medical friend, Justin Stebbing, funny pneumonia in Wuhan, my antennae began to tingle because it was just like one of those science fiction books that begins in just that moment."}, {"time": 7570, "text": "It begins in just that way."}, {"time": 7574, "text": "In a pandemic, as Larry Brilliant, the epidemiologist said many years ago, the key is early detection and early action."}, {"time": 7585, "text": "That's how you deal with a novel pathogen."}, {"time": 7588, "text": "And almost no Western country did that."}, {"time": 7591, "text": "We know it was doable because the Taiwanese and the South Koreans did it, and they did it very well."}, {"time": 7596, "text": "But really no Western country got this right."}, {"time": 7600, "text": "Some were unlucky because super spreader events happened earlier than in other countries."}, {"time": 7605, "text": "Italy was hit very hard very early."}, {"time": 7607, "text": "For other countries, the real disaster came quite late."}, {"time": 7610, "text": "Russia, which has only relatively recently had a really bad experience."}, {"time": 7616, "text": "The lesson for me is quite different from the one that most journalists thought they were learning last year."}, {"time": 7623, "text": "Most journalists last year thought, Trump is a terrible president."}, {"time": 7627, "text": "He's saying a lot of crazy things."}, {"time": 7630, "text": "It's his fault that we have high excess mortality in the United States."}, {"time": 7634, "text": "The same argument was being made by journalists in Britain, Boris Johnson, dot, dot, dot, Brazil, Jair Bolsonaro, dot, dot, dot, even India, Narendra Modi, the same argument."}, {"time": 7646, "text": "And I think this argument is wrong in a few ways."}, {"time": 7650, "text": "It's true that the populist leaders said many crazy things, and broadly speaking gave poor guidance to their populations."}, {"time": 7660, "text": "But I don't think it's true to say that with different leaders, these countries would have done significantly better if Joe Biden had magically been president a year earlier."}, {"time": 7670, "text": "I don't think the US would have done much better because the things that caused excess mortality last year weren't presidential decisions."}, {"time": 7677, "text": "They were utter failure of CDC to provide testing."}, {"time": 7680, "text": "That definitely wasn't Trump's fault."}, {"time": 7683, "text": "Scott Gottlieb's book makes that very clear."}, {"time": 7684, "text": "It's just been published recently."}, {"time": 7686, "text": "We utterly failed to use technology for contact tracing, which the Koreans did very well."}, {"time": 7692, "text": "We didn't really quarantine anybody seriously."}, {"time": 7696, "text": "There was no enforcement of quarantine."}, {"time": 7699, "text": "And we exposed the elderly to the virus as quickly as possible in elderly care homes."}, {"time": 7703, "text": "And these things had very little to do with presidential incompetence."}, {"time": 7708, "text": "So I think leadership is of somewhat marginal importance in a crisis like this, because what you really need is your public health bureaucracy to get it right."}, {"time": 7718, "text": "And very few Western public health bureaucracies got it right."}, {"time": 7722, "text": "Could the president have given better leadership?"}, {"time": 7727, "text": "His correct strategy, however, was to learn from Barack Obama's playbook with the opioid epidemic."}, {"time": 7735, "text": "The opioid epidemic killed as many people Obama's watch as COVID did on Trump's watch."}, {"time": 7741, "text": "And it was worse in a sense because it only happened in the US."}, {"time": 7745, "text": "And each year it killed more people than the year before, over eight years."}, {"time": 7749, "text": "Nobody to my knowledge has ever seriously blamed Obama for the opioid epidemic."}, {"time": 7754, "text": "Trump's mistake was to put himself front and center of the response to claim that he had some unique insight into the pandemic and to say with every passing week, more and more foolish things until even a significant portion of people who'd voted for him in 2016 realized that he'd blown it, which was why he lost the election."}, {"time": 7774, "text": "The correct strategy was actually to make Mike Pence the pandemic czar and get the hell out of the way."}, {"time": 7781, "text": "That's what my advice to Trump would have been."}, {"time": 7782, "text": "In fact, it was in February of last year."}, {"time": 7785, "text": "So the mistake was to try to lead, but actually leadership in a pandemic is almost a contradiction in terms."}, {"time": 7794, "text": "What you really need is your public health bureaucracy not to fuck it up."}, {"time": 7798, "text": "And they really, really fucked it up."}, {"time": 7800, "text": "And that was then all blamed on Trump."}, {"time": 7802, "text": "Jim Fallows writes a piece in the Atlantic that says, well, being the president's like flying a light aircraft, it's pilot error."}, {"time": 7809, "text": "And I read that piece and I thought, does he really after all the years he spent writing think that being president is like flying a light aircraft?"}, {"time": 7816, "text": "I mean, it's really nothing like flying a light aircraft."}, {"time": 7819, "text": "Being president is you sit on top of a vast bureaucracy with how many different agencies, 60, 70, we've all lost count."}, {"time": 7825, "text": "And you're surrounded by advisors, at least a quarter of whom are saying, this is a disaster."}, {"time": 7830, "text": "We have to close the borders."}, {"time": 7831, "text": "And the others are saying, no, no, we have to keep the economy going."}, {"time": 7834, "text": "That's what you're running on in November."}, {"time": 7837, "text": "So being a president in a pandemic is a very unenviable position because you actually can't really determine whether your public health bureaucracy will get it right or not."}, {"time": 7848, "text": "You don't think to push back on that, just like being Churchill in a war is difficult."}, {"time": 7854, "text": "So leaving Trump by an aside, what I would love to see from a president is somebody who makes great speeches and arouses the public to push the bureaucracy, the public health bureaucracy, to get their shit together, to fire certain kinds of people."}, {"time": 7871, "text": "I mean, I'm sorry, but I'm a big fan of powerful speeches, especially in the modern age with the internet."}, {"time": 7877, "text": "It can really move people."}, {"time": 7879, "text": "Instead, the lack of speeches resulted in certain kinds of forces amplifying division over whether to wear masks or not, or it's almost like the public picked some random topic over which to divide themselves."}, {"time": 7897, "text": "And there was like a complete indecision, which is really what it was, fear of uncertainty materializing itself in some kind of division."}, {"time": 7906, "text": "And then you almost like busy yourself with the red versus blue politics, as opposed to some, I don't know, FDR type character just stands and say, fuck all this bullshit that we're hearing."}, {"time": 7919, "text": "We're going to manufacture 5 billion tests."}, {"time": 7922, "text": "This is what America is great at."}, {"time": 7924, "text": "We're going to build the greatest testing infrastructure ever built, or something, or even with the vaccine development."}, {"time": 7932, "text": "But that was what I was about to interject."}, {"time": 7935, "text": "In a pandemic, the most important thing is the vaccine."}, {"time": 7938, "text": "If you get that right, then you should be forgiven for much else."}, {"time": 7941, "text": "And that was the one thing the Trump administration got right, because they went around the bureaucracy with Operation Warp Speed and achieved a really major success."}, {"time": 7953, "text": "So I think the paradox of the 2020 story in the United States is that the one thing that mattered most the Trump administration got right, and it got so much else wrong that was sort of marginal, that we were left with the impression that Trump had been to blame for the whole disaster, which wasn't really quite right."}, {"time": 7976, "text": "Sure, it would have been great if we did Operation Warp Speed for testing, but ultimately vaccines are more important than tests."}, {"time": 7982, "text": "And this brings me to the question that you raised there of polarization and why that happened."}, {"time": 7991, "text": "Now, in a book called The Square and the Tower, I argued that it would be very costly for the United States to allow the public sphere to continue to be dominated by a handful of big tech companies, that this ultimately would have more adverse effects than simply contested elections."}, {"time": 8007, "text": "And I think we saw over the past 18 months just how bad this could be, because the odd thing about this country is that we came up with vaccines with 90 plus percent efficacy and about 20% of people refused to get them and still do refuse for reasons that seem best explained in terms of the anti vaccine network, which has been embedded on the internet for a long time, predating the pandemic."}, {"time": 8038, "text": "Renny DiResta wrote about this pre 2020."}, {"time": 8042, "text": "And this anti vaccine network has turned out to kill maybe 200,000 Americans who could have been vaccinated, but were persuaded through magical thinking that the vaccine was riskier than the virus."}, {"time": 8054, "text": "Whereas you don't need to be an epidemiologist, you don't need to be a medical scientist to know that the virus is about two orders of magnitude riskier than the vaccine."}, {"time": 8063, "text": "So again, leadership could definitely have been better."}, {"time": 8070, "text": "But the politicization of everything was not Trump's doing alone."}, {"time": 8075, "text": "It happened because our public sphere has been dominated by a handful of platforms whose business model inherently promotes polarization, inherently promotes fake news and extreme views, because those are the things that get the eyeballs on the screens and sell the ads."}, {"time": 8093, "text": "I mean, this is now a commonplace."}, {"time": 8095, "text": "But when one thinks about the cost of allowing this kind of thing to happen, it's now a very high human cost."}, {"time": 8104, "text": "And we were foolish to leave uncorrected these structural problems in the public sphere that were already very clearly visible in 2016."}, {"time": 8112, "text": "And you described that, like you mentioned, that there's these networks that are almost like laying dormant, waiting for their time in the sun, and they stepped forward in this case."}, {"time": 8125, "text": "And that those network effects just disservice catalyst for whatever the bad parts of human nature."}, {"time": 8134, "text": "I do hope that there's kinds of networks that emphasize the better angels of our nature, to quote Steven Pinker."}, {"time": 8140, "text": "It's just clearly, and we know this from all the revelations of the Facebook whistleblower, there is clearly a very clear tension between the business model of a company like Facebook and the public good, and they know that."}, {"time": 8157, "text": "I just talked to the founder of Instagram."}, {"time": 8160, "text": "Yes, that's the case, but it's not, from a technology perspective, absolutely true of any kind of social network."}, {"time": 8168, "text": "I think it's possible to build, actually I think it's not just possible, I think it's pretty easy if you set that as the goal, to build social networks that don't have these negative effects."}, {"time": 8180, "text": "Right, but if the business model is we sell ads, and the way you sell ads is to maximize user engagement, then the algorithm is biased in favor of fake news and extreme views."}, {"time": 8193, "text": "So it's not the ads, a lot of people blame the ads."}, {"time": 8196, "text": "The problem I think is the engagement, and the engagement is just the easiest, the dumbest way to sell the ads."}, {"time": 8203, "text": "I think there's much different metrics that could be used to make a lot more money than the engagement in the long term."}, {"time": 8210, "text": "It has more to do with planning for the long term, so optimizing the selling of ads to make people happy with themselves in the long term, as opposed to some kind of addicted like dopamine feeling."}, {"time": 8227, "text": "And so that's, to me that has to do with metrics and measuring things correctly and sort of also creating a culture with what's valued to have difficult conversations about what we're doing with society, all those kinds of things."}, {"time": 8239, "text": "And I think once you have those conversations, this takes us back to the University of Austin, kind of once you have those difficult human conversations, you can design the technology that will actually make for help people grow, become the best version of themselves, help them be happy in the long term."}, {"time": 8256, "text": "What gives you hope about the future?"}, {"time": 8261, "text": "As somebody who studied some of the darker moments of human history, what gives you hope?"}, {"time": 8272, "text": "First of all, the United States has a very unique operating system."}, {"time": 8278, "text": "Which was very well designed by the founders who'd thought a lot about history and realized it would take quite a novel design to prevent the republic going the way of all republics because republics tend to end up as tyrannies for reasons that were well established by the time of the Renaissance."}, {"time": 8296, "text": "And it gives me hope that this design has worked very well and withstood an enormous stress test in the last year."}, {"time": 8305, "text": "I became an American in 2018, I think one of the most important features of this operating system is that it is the magnet for talent."}, {"time": 8318, "text": "Here we sit, part of the immigration story in a darkened room with funny accents."}, {"time": 8330, "text": "A Scot and a Russian walk into a recording studio and talk about America, it's very much like a joke."}, {"time": 8338, "text": "And Elon's a South African and so on, and Teal is a German."}, {"time": 8340, "text": "And we're extraordinarily fortunate that the natives let us come and play and play in a way that we could not in our countries of birth."}, {"time": 8352, "text": "And as long as the United States continues to exploit that superpower, that it is the talent magnet, then it should out innovate the totalitarian competition every time."}, {"time": 8364, "text": "So that's one reason for being an optimist."}, {"time": 8370, "text": "Another reason, and it's quite a historical reason as you would expect from me."}, {"time": 8375, "text": "Another reason that I'm optimistic is that my kids give me a great deal of hope."}, {"time": 8385, "text": "They range in age from 27 down to four, but each of them in their different way seems to be finding a way through this crazy time of ours without losing contact with that culture and civilization that I hold dear."}, {"time": 8408, "text": "I don't want to live in the metaverse as Mark Zuckerberg imagines it."}, {"time": 8412, "text": "To me, that's a kind of ghastly hell."}, {"time": 8415, "text": "I think Western civilization is the best civilization."}, {"time": 8420, "text": "And I think that almost all the truths about the human condition can be found in Western literature, art, and music."}, {"time": 8434, "text": "And I think also that the civilization that produced the scientific revolution has produced the great problem solving tool that eluded the other civilizations that never really cracked science."}, {"time": 8447, "text": "And what gives me hope is that despite all the temptations and distractions that their generation had to contend with, my children in their different ways have found their way to literature and to art and to music, and they are civilized."}, {"time": 8469, "text": "And I don't claim much of the credit for that, I've done my best, but I think it's deeply encouraging that they found their way to the things that I think are indispensable for a happy life, a fulfilled life."}, {"time": 8486, "text": "Nobody, I think, can be truly fulfilled if they're cut off from the great body of Western literature, for example."}, {"time": 8494, "text": "I've thought a lot about Elon's argument that we might be in a simulation."}, {"time": 8501, "text": "No, no, there is a simulation, it's called literature."}, {"time": 8504, "text": "And we just have to decide whether or not to enter it."}, {"time": 8525, "text": "And it's impossible not to find yourself identifying with Marcel and his obsessive, jealous relationships, particularly with Albertine."}, {"time": 8537, "text": "It's the simulation."}, {"time": 8538, "text": "And you decide, I think, as a sentient being, how far to, in your own life, reenact these more profound experiences that others have written down."}, {"time": 8551, "text": "One of my earliest literary simulations was to reenact Jack Kerouac's Trippin on the Road when I was 17, culminating in getting very wasted in the Hanging Gardens of Xochimilco, not to be missed."}, {"time": 8564, "text": "And it hit me, just as I was reading Proust, that that's really how to live a rich life, that one lives life, but one lives it juxtaposing one's own experience against the more refined experiences of the great writers."}, {"time": 8580, "text": "So it gives me hope that my children do that a bit."}, {"time": 8584, "text": "Do you include the Russian authors in the canon?"}, {"time": 8589, "text": "Yes, I don't read Russian, but I was entirely obsessed with Russian literature as a schoolboy."}, {"time": 8597, "text": "I read my way through Dostoevsky, Tolstoy, Turgenev, I, Chekhov."}, {"time": 8604, "text": "I think of all of those writers, Tolstoy had the biggest impact because at the end of War and Peace, there's this great essay on historical determinism, which I think was the reason I became a historian."}, {"time": 8619, "text": "But I'm really temperamentally a kind of Turgenev person, oddly enough."}, {"time": 8628, "text": "I think if you haven't read those novelists, I mean, you can't really be a complete human being if you haven't read the Brothers Karamazov."}, {"time": 8637, "text": "You're not really, you're not grown up."}, {"time": 8640, "text": "And so I think in many ways, those are the greatest novels."}, {"time": 8645, "text": "Raskolnikov, remember Raskolnikov's Nightmare at the end of Crime and Punishment, in which he imagines in his dream a world in which a terrible virus spreads."}, {"time": 8659, "text": "Do you remember this?"}, {"time": 8660, "text": "And this virus has the effect of making every individual think that what he believes is right."}, {"time": 8667, "text": "And in this self righteousness, people fall on one another and commit appalling violence."}, {"time": 8676, "text": "That's Raskolnikov's Nightmare, and it's a prophecy."}, {"time": 8679, "text": "It's a terrible prophecy of Russia's future."}, {"time": 8684, "text": "Yeah, and coupled with that is probably the, I also like the French, the existentialists, all that."}, {"time": 8690, "text": "The full spectrum and German's Hermann Hesse and just that range of human thought as expressed in the literature is fascinating."}, {"time": 8698, "text": "I really love your idea that the simulation, like one way to live life is to kind of explore these other worlds and borrow from them wisdom that you then just map onto your own lives."}, {"time": 8717, "text": "You almost like stitch together your life with these kind of pieces from literature."}, {"time": 8722, "text": "The highly educated person is constantly struck by illusion."}, {"time": 8727, "text": "Everything is an illusion to something that one has read."}, {"time": 8732, "text": "And that is the simulation."}, {"time": 8734, "text": "That's what the real metaverse is."}, {"time": 8738, "text": "It's the imaginary world that we enter when we read, empathize, and then recognize in our daily lives some scrap of the shared experience that literature gives us."}, {"time": 8751, "text": "Yeah, I think I've aspired to be the idiot from Prince Mishkin from Dostoevsky and in aspiring to be that, I have become the idiot, I feel, at least in part."}, {"time": 8766, "text": "What, you mentioned the human condition, does love have to do?"}, {"time": 8772, "text": "What role does it play in the human condition?"}, {"time": 8775, "text": "Friendship, love."}, {"time": 8780, "text": "Love is the drug."}, {"time": 8784, "text": "Love is, this was the great Roxy music line that Brian Ferry wrote."}, {"time": 8793, "text": "And love is the most powerful and dangerous of all the drugs."}, {"time": 8801, "text": "The driving force that overrides our reason."}, {"time": 8806, "text": "And of course, it is the primal urge."}, {"time": 8813, "text": "So what a civilized society has to do is to prevent that drug, that primal force from creating mayhem."}, {"time": 8823, "text": "So there have to be rules like monogamy and rituals like marriage that reign love in."}, {"time": 8833, "text": "And make the addicts at least more or less under control."}, {"time": 8841, "text": "And I think that's part of why I'm a romantic rather than a Steve Pinker, enlightenment rationalist."}, {"time": 8852, "text": "Because the romantics realized that love was the drug."}, {"time": 8857, "text": "It's like, the difference in sensibility between Handel and Wagner."}, {"time": 8865, "text": "And I had a Wagnerian phase when I was an undergraduate."}, {"time": 8869, "text": "And I still remember thinking that in, as old as Lieberstod, that Wagner had got the closest to sex that anybody had ever got in music, or perhaps to love."}, {"time": 8885, "text": "I'm lucky that I love my wife and that we were, by the time we met, you know, smart enough to understand that love is a drug that you have to kind of take in certain careful ways."}, {"time": 8905, "text": "And that it works best in the context of a stable relationship it works best in the context of a stable family."}, {"time": 8918, "text": "That one has to sort of take the drug and then submit to the conventions of marriage and family life."}, {"time": 8927, "text": "I think in that respect, I'm a kind of tamed romantic."}, {"time": 8935, "text": "Tamed romantic."}, {"time": 8936, "text": "That's how I'd like to think of myself."}, {"time": 8938, "text": "The degree to which your romanticism is tamed can be then channeled into productive work."}, {"time": 8943, "text": "That's why you are a historian and a writer is the best that love is channeled through the writing."}, {"time": 8948, "text": "So if you're going to be addicted to anything, be addicted to work."}, {"time": 8952, "text": "I mean, we're all addictive, but the thing about workaholism is that it is the most productive addiction."}, {"time": 8959, "text": "And rather that than drugs or booze."}, {"time": 8962, "text": "So yes, I'm always trying to channel my anxieties into work."}, {"time": 8968, "text": "I learned that at a relatively early age, it's a sort of massively productive way of coping with the inner demons."}, {"time": 8976, "text": "And again, we should teach kids that because let's come back to our earlier conversation about universities."}, {"time": 8983, "text": "Part of what happens at university is that adolescents have to overcome all the inner demons."}, {"time": 8989, "text": "And these include deep insecurity about one's appearance, about one's intellect, and then madly raging hormones that cause you to behave like a complete fool with the people to whom you're sexually attracted."}, {"time": 9003, "text": "All of this is going on in the university."}, {"time": 9005, "text": "How can it be a safe space?"}, {"time": 9007, "text": "It's a completely dangerous space by definition."}, {"time": 9011, "text": "So yeah, I learned teaching young people how to manage these storms, that's part of the job."}, {"time": 9018, "text": "And we're really not allowed to do that anymore because we can't talk about these things for fear of the Title IX officers kicking down the door and dragging us off in chains."}, {"time": 9026, "text": "And like you said, hard work and something you call work ethic in civilization is a pretty effective way to achieve, I think, a kind of happiness in a world that's full of anxiety."}, {"time": 9042, "text": "Or at least exhaustion so that you sleep well."}, {"time": 9046, "text": "Well, there is beauty to the exhaustion too."}, {"time": 9049, "text": "That's why running, there's manual work that some part of us is built for that."}, {"time": 9056, "text": "I mean, we are products of evolution and our adaptation to a technological world is a very imperfect one."}, {"time": 9064, "text": "So hence the kind of masochistic urge to run."}, {"time": 9071, "text": "I like outdoor exercise."}, {"time": 9074, "text": "I don't really like gyms."}, {"time": 9076, "text": "So I'll go for long punishing runs in woodland, hike up hills."}, {"time": 9084, "text": "I like swimming in lakes and in the sea because there just has to be that physical activity in order to do the good mental work."}, {"time": 9094, "text": "And so it's all about trying to do the best work."}, {"time": 9099, "text": "That's my sense that we have some random allocation of talent."}, {"time": 9105, "text": "You kind of figure out what it is that you're relatively good at and you try to do that well."}, {"time": 9111, "text": "I think my father encouraged me to think that way."}, {"time": 9115, "text": "And you don't mind about being average at the other stuff."}, {"time": 9118, "text": "The kind of sick thing is to try to be brilliant at everything."}, {"time": 9121, "text": "I hate those people."}, {"time": 9122, "text": "Should really not worry too much if you're just an average double bass player, which I am, or kind of average skier, which I definitely am."}, {"time": 9132, "text": "Doing those things okay is part of leading a rich and fulfilling life."}, {"time": 9136, "text": "I was not a good actor, but I got a lot out of acting as an undergraduate."}, {"time": 9142, "text": "Turned out after three years of experimentation at Oxford that I was, broadly speaking, better at writing history essays than my peers."}, {"time": 9152, "text": "And that was my edge."}, {"time": 9154, "text": "That was my comparative advantage."}, {"time": 9155, "text": "And so I've just tried to make a living from that slight edge."}, {"time": 9160, "text": "Yeah, that's a beautiful way to describe a life."}, {"time": 9164, "text": "Is there a meaning to this thing?"}, {"time": 9166, "text": "Is there a meaning to life?"}, {"time": 9169, "text": "I was brought up by a physicist and a physician."}, {"time": 9174, "text": "They were more or less committed atheists who had left the Church of Scotland as a protest against sectarianism in Glasgow."}, {"time": 9183, "text": "And so my sister and I were told from an early age life was a cosmic accident, and that was it."}, {"time": 9190, "text": "There was no great meaning to it, and I can't really get past that."}, {"time": 9199, "text": "Isn't there beauty to being an accident at a cosmic scale?"}, {"time": 9204, "text": "Yes, I wasn't taught to feel negative about that."}, {"time": 9207, "text": "And if anything, it was a frivolous insight that the whole thing was a kind of joke."}, {"time": 9214, "text": "And I think that atheism isn't really a basis for ordering a society, but it's been all right for me."}, {"time": 9226, "text": "I don't have a kind of sense of a missing religious faith."}, {"time": 9233, "text": "For me, however, there's clearly some embedded Christian ethics in the way my parents lived."}, {"time": 9243, "text": "And so we were kind of atheist Calvinists who had kind of deposed God, but carried on behaving as if we were members of the elect in a moral universe."}, {"time": 9254, "text": "So that's kind of the state of mind that I was left in."}, {"time": 9261, "text": "And I think that we aren't really around long enough to claim that our individual lives have meaning."}, {"time": 9271, "text": "But what Edmund Burke said is true."}, {"time": 9275, "text": "The real social contract is between the generations, between the dead, the living, and the unborn."}, {"time": 9281, "text": "And the meaning of life is, for me at least, to live in a way that honors the dead, seeks to learn from their accumulated wisdom because they do still outnumber us."}, {"time": 9292, "text": "They outnumber the living by quite a significant margin."}, {"time": 9295, "text": "And then to be mindful of the unborn and our responsibility to them."}, {"time": 9303, "text": "Writing books is a way of communicating with the unborn."}, {"time": 9307, "text": "It may or may not succeed, and probably won't succeed if my books are never assigned by work professors in the future."}, {"time": 9314, "text": "So what we have to do is more than just write books and record podcasts, there have to be institutions."}, {"time": 9320, "text": "I'm 57 now."}, {"time": 9322, "text": "I realized recently that succession planning had to be the main focus of the next 20 years because there are things that I really care about that I want future generations to have access to."}, {"time": 9338, "text": "And so the meaning of life I do regard as being intergenerational transfer of wisdom."}, {"time": 9346, "text": "Ultimately the species will go extinct at some point."}, {"time": 9350, "text": "Even if we do colonize Mars, one senses that physics will catch up with this particular organism, but it's in the pretty far distant future."}]}]