[{"title": "Jim Gates: Supersymmetry, String Theory and Proving Einstein Right | Lex Fridman Podcast #60", "id": "IUHkhB366tE", "quotes": [{"time": 365, "text": "It was about 10 year duration between the challenge that President Kennedy laid out and our successfully landing a moon."}, {"time": 372, "text": "I was actually here at MIT when that first moon landing occurred, so I remember watching it on TV."}, {"time": 378, "text": "But how did we get there?"}, {"time": 379, "text": "Well, we had this extraordinarily technical agency of the United States government, NASA."}, {"time": 386, "text": "It consumed about 5% of the country's economic output."}, {"time": 392, "text": "And so you say 5% of the economic output over about a 10 year period gets us 250,000 miles in space."}, {"time": 400, "text": "Mars is about a hundred times farther."}, {"time": 403, "text": "So you have at least a hundred times the challenge and we're spending about one tenth of the funds that we spent then as a government."}, {"time": 410, "text": "So my claim is that it's at least a thousand times harder for me to imagine us getting to Mars by 2030."}, {"time": 418, "text": "And he had that part that you mentioned in the speech that I just have to throw in there of JFK, of we do these things not because they're easy, but because they're hard."}, {"time": 427, "text": "That's such a beautiful line that I would love to hear a modern president say about a scientific endeavor."}, {"time": 433, "text": "Well, one day we live and hope that such a president will arise for our nation."}, {"time": 439, "text": "But even if, like I said, even if you fix the technical problems, the biological engineering that I worry most about, however, I'm gonna go out on a limb here."}, {"time": 451, "text": "I think that by 2090 or so, or 2100, should I say 120, I suspect we're gonna have a human on Mars."}, {"time": 464, "text": "Wow, so you think that many years out, first a few tangents."}, {"time": 468, "text": "You said bioengineering is a challenge."}, {"time": 470, "text": "What's the challenge there?"}, {"time": 472, "text": "So as I said, the real problem with interstellar travel, aside from the technology challenges, the real problem is radiation."}, {"time": 483, "text": "And how do you engineer either an environment or a body, because we see rapid advances going on in bioengineering, how do you engineer either a ship or a body so that something, some person that's recognizably human will survive the rigors of interplanetary space travel?"}, {"time": 504, "text": "It's much more difficult than most people seem to take into account."}, {"time": 509, "text": "So if we could linger on the 2090, 2100, 2120, sort of thinking of that kind of, you know, and let's linger on money."}, {"time": 523, "text": "So Elon Musk and Jeff Bezos are pushing the cost, trying to push the cost down."}, {"time": 530, "text": "I mean, this is, so do you have hope as this actually sort of a brilliant big picture scientist, do you think a business entrepreneur can take science and make it cheaper and get it out there faster?"}, {"time": 544, "text": "So bending the cost curve is, you'll notice that has been an anchor."}, {"time": 548, "text": "This is the simplest way for me to discuss this with people about what the challenge is."}, {"time": 552, "text": "So yes, bending the cost curve is certainly critical if we're going to be successful."}, {"time": 558, "text": "Now, you asked about the endeavors that are out there now sponsored by two very prominent American citizens, Jeff Bezos and Elon Musk."}, {"time": 568, "text": "I'm disappointed actually in what I see in terms of the routes that are being pursued."}, {"time": 575, "text": "So let me give you one example there."}, {"time": 576, "text": "And this one is going to be a little bit more technical."}, {"time": 579, "text": "So if you look at the kinds of rockets that both these organizations are creating, yes, it's wonderful, reusable technology to see a rocket go up and land on its fins just like it did in science fiction movies when I was a kid, that's astounding."}, {"time": 594, "text": "But the real problem is those rockets, the technology that we're doing now is not really that different than what was used to go to the moon."}, {"time": 604, "text": "And there are alternatives it turns out."}, {"time": 606, "text": "There's an engine called a flare engine, which so a traditional rocket, if you look at the engine, it looks like a bell, right?"}, {"time": 613, "text": "And then the flame comes out the bottom."}, {"time": 614, "text": "But there is a kind of engine called a flare engine, which is essentially, when you look at it, it looks like an exhaust pipe on like a fancy car that's long and elongated."}, {"time": 627, "text": "And it's a type of rocket engine that we know there've been preliminary testing, we know it works."}, {"time": 634, "text": "And it also is actually much more economical because what it does is allow you to vary the amount of thrust as you go up."}, {"time": 640, "text": "In a way that you cannot do with one of these bell shaped engines."}, {"time": 644, "text": "So you would think that an entrepreneur might try to have the breakthrough to use flare nozzles, as they're called, as a way to bend the cost curve."}, {"time": 656, "text": "Because as we keep coming back, that's gonna be a big factor."}, {"time": 659, "text": "But that's not happening."}, {"time": 660, "text": "In fact, what we see is what I think of as incremental change in terms of our technology."}, {"time": 666, "text": "So I'm not really very encouraged by what I personally see."}, {"time": 670, "text": "So incremental change won't bend the cost curve."}, {"time": 672, "text": "I don't see it."}, {"time": 674, "text": "Just linger on the sci fi for one more question."}, {"time": 678, "text": "Do you think we're alone in the universe?"}, {"time": 680, "text": "Are we the only intelligent form of life?"}, {"time": 683, "text": "So there is a quote by Carl Sagan, which I really love when I hear this question."}, {"time": 690, "text": "And I recall the quote, and it goes something like, if we're the only conscious life in the universe, it's in a terrible waste of space because the universe is an incredibly big place."}, {"time": 705, "text": "And when Carl made that statement, we didn't know about the profusion of planets that are out there."}, {"time": 711, "text": "In the last decade, we've discovered over a thousand planets and a substantial number of those planets are Earth like in terms of being in the Goldilocks zone as it's called."}, {"time": 724, "text": "So in my mind, it's practically inconceivable that we're the only conscious form of life in the universe."}, {"time": 733, "text": "But that doesn't mean they've come to visit us."}, {"time": 735, "text": "Do you think they would look, do you think we'll recognize alien life if we saw it?"}, {"time": 741, "text": "Do you think it'd look anything like the carbon base, the biological system we have on Earth today?"}, {"time": 747, "text": "It would depend on that life's native environment in which it arose."}, {"time": 752, "text": "If that environment was sufficiently like our environment, there's a principle in biology and nature called convergence, which is that even if you have two biological systems that are totally separated from each other, if they face similar conditions, nature tends to converge on solutions."}, {"time": 769, "text": "And so there might be similarities if this alien life form was born in a place that's kind of like this place."}, {"time": 777, "text": "Physics appears to be quite similar, the laws of physics across the entirety of the universe."}, {"time": 783, "text": "Do you think weirder things than we see on Earth can spring up out of the same kinds of laws of physics?"}, {"time": 790, "text": "From the laws of physics, I would say yes."}, {"time": 792, "text": "First of all, if you look at carbon based life, why are we carbon based?"}, {"time": 795, "text": "Well, it turns out it's because of the way that carbon interacts with elements, which in fact is also a reflection on the electronic structure of the carbon nucleus."}, {"time": 806, "text": "So you can look down the table of elements and say, well, gee, do we see similar elements?"}, {"time": 810, "text": "The answer is yes."}, {"time": 811, "text": "And one that one often hears about in science fiction is silicon."}, {"time": 816, "text": "So maybe there's a silicon based life form out there if the conditions are right."}, {"time": 820, "text": "But I think it's presumptuous of us to think that we are the template by which all life has to appear."}, {"time": 830, "text": "Before we dive into beautiful details, let me ask a big question."}, {"time": 835, "text": "What to you is the most beautiful idea, maybe the most surprising, mysterious idea in physics?"}, {"time": 842, "text": "The most surprising idea to me is that we can actually do physics."}, {"time": 845, "text": "The universe did not have to be constructed in such a way with our limited intellectual capacity that is actually put together in such a way and that we are put together in such a way that we can, with our mind's eye, delve incredibly deeply into the structure of the universe."}, {"time": 867, "text": "That to me is pretty close to a miracle."}, {"time": 870, "text": "So there are simple equations, relatively simple, that can describe things, the fundamental functions."}, {"time": 880, "text": "They can describe everything about our reality."}, {"time": 882, "text": "That's not, can you imagine universes where everything is a lot more complicated?"}, {"time": 890, "text": "Do you think there's something inherent about universes that simple laws are... Well, first of all, let me, this is a question that I encounter in a number of guides."}, {"time": 902, "text": "A lot of people will raise the question about whether mathematics is the language of the universe."}, {"time": 908, "text": "And my response is mathematics is the language that we humans are capable of using in describing the universe."}, {"time": 914, "text": "It may have little to do with the universe, but in terms of our capacity, it's the microscope, it's the telescope through which we, it's the lens through which we are able to view the universe with the precision that no other human language allows."}, {"time": 931, "text": "So could there be other universes?"}, {"time": 932, "text": "Well, I don't even know if this one looks like I think it does."}, {"time": 936, "text": "But the beautiful surprising thing is that physics, there are laws of physics, very few laws of physics that can effectively compress down the functioning of the universe."}, {"time": 950, "text": "Yes, that's extraordinarily surprising."}, {"time": 952, "text": "I like to use the analogy with computers and information technology."}, {"time": 956, "text": "If you worry about transmitting large bundles of data, one of the things that computer scientists do for us is they allow for processes that are called compression, where you take big packets of data and you press them down into much smaller packets, and then you transmit those and then unpack them at the other end."}, {"time": 973, "text": "And so it looks a little bit to me like the universe has kind of done us a favor."}, {"time": 978, "text": "It's constructed our minds in such a way that we have this thing called mathematics, which then as we look at the universe, teaches us how to carry out the compression process."}, {"time": 989, "text": "A quick question about compression."}, {"time": 991, "text": "Do you think the human mind can be compressed?"}, {"time": 995, "text": "The biology can be compressed?"}, {"time": 998, "text": "We talked about space travel."}, {"time": 1000, "text": "To be able to compress the information that captures some large percent of what it means to be me or you, and then be able to send that at the speed of light."}, {"time": 1012, "text": "Wow, that's a big question."}, {"time": 1014, "text": "And let me try to take it apart, unpack it into several pieces."}, {"time": 1018, "text": "I don't believe that wetware biology such as we are has an exclusive patent on intellectual consciousness."}, {"time": 1028, "text": "I suspect that other structures in the universe are perfectly capable of producing the data streams that we use to process, first of all, our observations of the universe and an awareness of ourself."}, {"time": 1040, "text": "I can imagine other structures can do that also."}, {"time": 1043, "text": "So that's part of what you were talking about, which I would have some disagreement with."}, {"time": 1051, "text": "What's the most interesting part of us humans?"}, {"time": 1056, "text": "Is consciousness the thing?"}, {"time": 1058, "text": "I think that's the most interesting thing about humans."}, {"time": 1059, "text": "And then you're saying that there's other entities throughout the universe."}, {"time": 1065, "text": "I can well imagine that the architecture that supports our consciousness, again, has no patent on consciousness."}, {"time": 1073, "text": "Just in case you have an interesting thought here, there's folks perhaps in philosophy called panpsychists that believe consciousness underlies everything."}, {"time": 1084, "text": "It is one of the fundamental laws of the universe."}, {"time": 1087, "text": "Do you have a sense that that could possibly fit into..."}, {"time": 1089, "text": "I don't know the answer to that question."}, {"time": 1092, "text": "One part of that belief system is giya, which is that there's a kind of conscious life force about our planet."}, {"time": 1100, "text": "And I've encountered these things before."}, {"time": 1102, "text": "I don't quite know what to make of them."}, {"time": 1105, "text": "My own life experience, and I'll be 69 in about two months, and I have spent all my adulthood thinking about the way that mathematics interacts with nature and with us to try to understand nature."}, {"time": 1119, "text": "And all I can tell you from all of my integrated experience is that there is something extraordinarily mysterious to me about our universe."}, {"time": 1128, "text": "This is something that Einstein said from his life experience as a scientist."}, {"time": 1133, "text": "And this mysteriousness almost feels like the universe is our parent."}, {"time": 1143, "text": "It's a very strange thing perhaps to hear scientists say, but there are just so many strange coincidences that you just get a sense that something is going on."}, {"time": 1154, "text": "Well, I interrupted you."}, {"time": 1156, "text": "In terms of compressing what we're down to, we can send it at the speed of light."}, {"time": 1163, "text": "So the first thing is I would argue that it's probably very likely that artificial intelligence ultimately will develop something like consciousness, something that for us will probably be indistinguishable from consciousness."}, {"time": 1176, "text": "So that's what I meant by our biological processing equipment that we carry up here probably does not hold a patent on consciousness, because it's really about the data streams."}, {"time": 1188, "text": "As far as I can tell, that's what we are."}, {"time": 1189, "text": "We are self actuating, self learning data streams."}, {"time": 1193, "text": "That to me is most accurate way I can tell you what I've seen in my lifetime about what humans are at the level of consciousness."}, {"time": 1201, "text": "So if that's the case, then you just need to have an architecture that supports that information processing."}, {"time": 1206, "text": "So let's assume that that's true, that in fact what we call consciousness is really about a very peculiar kind of data stream."}, {"time": 1217, "text": "If that's the case, then if you can export that to a piece of hardware, something metal, electronic, what have you, then you certainly will, ultimately that kind of consciousness could get to Mars very quickly, it doesn't have our problems."}, {"time": 1235, "text": "You can engineer the body, as I said, it's a ship or a body, you engineer one or both."}, {"time": 1241, "text": "Send it at a speed of light, well, that one is a more difficult one because that now goes beyond just a matter of having a data stream."}, {"time": 1249, "text": "It's now the preservation of the information in the data stream."}, {"time": 1253, "text": "And so unless you can build something that's like a super, super, super version of the way the internet works because most people aren't aware that the internet itself is actually a miracle, it's based on a technology called message packaging."}, {"time": 1266, "text": "So if you could exponentiate message packaging in some way to preserve the information that's in the data stream, then maybe your dream becomes true."}, {"time": 1276, "text": "You mentioned with artificial intelligence, sort of us human beings not having a monopoly on consciousness."}, {"time": 1284, "text": "Does the idea of artificial intelligence systems, computational systems, being able to basically replacing us humans scare you, excite you?"}, {"time": 1298, "text": "So I'm gonna tell you about a conversation I once had with Eric Schmidt."}, {"time": 1301, "text": "I was sitting at a meeting with him and he was a few feet away and he turned to me and he said something like, you know, Jim, in maybe a decade or so, we're gonna have computers that do what you do."}, {"time": 1313, "text": "And my response was not unless they can dream because there's something about, the way that we humans actually generate creativity."}, {"time": 1321, "text": "It's somehow, I get this sense of my lived experience in watching creative people that it's somehow connected to the irrational parts of what goes on in our head and dreaming is part of that irrational."}, {"time": 1332, "text": "So unless you can build a piece of artificial intelligence that dreams, I have a strong suspicion that you will not get something that will fully be conscious by a definition that I would accept, for example."}, {"time": 1344, "text": "So you mentioned dreaming."}, {"time": 1345, "text": "You've played around with some out there fascinating ideas."}, {"time": 1351, "text": "How do you think, and we'll start diving into the world of the very small ideas of super symmetry and all that in terms of visualization, in terms of how do you think about it?"}, {"time": 1363, "text": "How do you dream of it?"}, {"time": 1364, "text": "How do you come up with ideas in that fascinating, mysterious space?"}, {"time": 1369, "text": "So in my workspace, which is basically where I am charged with coming up on a mathematical palette with new ideas that will help me understand the structure of nature and hopefully help all of us understand the structure of nature."}, {"time": 1386, "text": "I've observed several different ways in which my creativity expresses itself."}, {"time": 1390, "text": "There's one mode which looks pretty normal, which I sort of think of as the Chinese water torture method."}, {"time": 1396, "text": "Drop, drop, drop, you get more and more information and suddenly it all congeals and you get a clear picture."}, {"time": 1403, "text": "And so that's kind of a standard way of working."}, {"time": 1405, "text": "And I think that's how most people think about the way technical people solve problems."}, {"time": 1410, "text": "That is kind of you accumulate this body of information and at a certain point you synthesize it and then boom, there's something new."}, {"time": 1419, "text": "But I've also observed in myself and other scientists that there are other ways that we are creative."}, {"time": 1424, "text": "And these other ways to me are actually far more powerful."}, {"time": 1428, "text": "I first personally experienced this when I was a freshman at MIT over in Baker House right across the campus."}, {"time": 1435, "text": "And I was in a calculus course, 1801 is called at MIT."}, {"time": 1440, "text": "And calculus comes in two different flavors."}, {"time": 1443, "text": "One of them is called differential calculus."}, {"time": 1445, "text": "The other is called integral calculus."}, {"time": 1447, "text": "Differential calculus is the calculus that Newton invented to describe motion."}, {"time": 1453, "text": "It turns out integral calculus was probably invented about 1700 years earlier by Archimedes."}, {"time": 1458, "text": "But we didn't know that when I was a freshman."}, {"time": 1460, "text": "But so that's what you study as a student."}, {"time": 1464, "text": "And the differential calculus part of the course was, to me, I wouldn't, how do I say this?"}, {"time": 1470, "text": "It was something that by the drip, drip, drip method you could sort of figure it out."}, {"time": 1475, "text": "Now, the integral part of calculus, I could memorize the formula."}, {"time": 1478, "text": "That was not the formulae, that was not the problem."}, {"time": 1482, "text": "The problem was why, in my own mind, why do these formulae work?"}, {"time": 1487, "text": "And because of that, when I was in the part of the calculus course where we had to do multiple substitutions to solve integrals, I had a lot of difficulty."}, {"time": 1499, "text": "I was emotionally involved in my education because this is where I think the passion of motion comes to."}, {"time": 1505, "text": "And it caused an emotional crisis that I was having these difficulties understanding the integral part of calculus."}, {"time": 1510, "text": "The why."}, {"time": 1511, "text": "The why, that's right, the why of it."}, {"time": 1512, "text": "Not the rote memorization of fact, but the why of it."}, {"time": 1518, "text": "And so one night I was over in my dormitory room in Baker House."}, {"time": 1523, "text": "I was trying to do a calculus problem set."}, {"time": 1525, "text": "I was getting nowhere."}, {"time": 1528, "text": "I got a terrific headache."}, {"time": 1530, "text": "I went to sleep and had this very strange dream."}, {"time": 1533, "text": "And when I woke, awakened, I could do three and four substitutions and integrals with relative ease."}, {"time": 1541, "text": "Now, this to me was an astounding experience because I had never before in my life understood that one subconscious is actually capable of being harnessed to do mathematics."}, {"time": 1554, "text": "I experienced it, this."}, {"time": 1555, "text": "And I've experienced this more than once."}, {"time": 1556, "text": "So this was just the first time why I remember it so."}, {"time": 1559, "text": "So that's why when it comes to like really wickedly tough problems, I think that the kind of creativity that you need to solve them is probably this second variety which comes somehow from dreaming."}, {"time": 1575, "text": "Do you think, again, I told you I'm Russian."}, {"time": 1578, "text": "So we romanticize suffering."}, {"time": 1580, "text": "But do you think part of that equation is the suffering leading up to that dreaming?"}, {"time": 1585, "text": "So the suffering is, I am convinced that this kind of creative, this second mode of creativity as I like to call it, I'm convinced that this second mode of creativity is in fact that suffering is a kind of crucible that triggers it."}, {"time": 1604, "text": "Because the mind I think is struggling to get out of this."}, {"time": 1607, "text": "And the only way to actually solve the problem."}, {"time": 1611, "text": "And even though you're not consciously solving problems, something is going on."}, {"time": 1615, "text": "And I've talked about to a few other people and I've heard other similar stories."}, {"time": 1620, "text": "And so I guess what I think about it is it's a little bit by like the way that thermonuclear weapons work."}, {"time": 1627, "text": "I don't know if you know how they work."}, {"time": 1629, "text": "But a thermonuclear weapon is actually two bombs."}, {"time": 1631, "text": "It's an atomic bomb which sort of does a compression."}, {"time": 1634, "text": "And then you have a fusion bomb that goes off."}, {"time": 1636, "text": "And somehow that emotional pressure I think acts like the first stage of a thermonuclear weapon."}, {"time": 1642, "text": "That's when we get really big thoughts."}, {"time": 1645, "text": "The analogy between thermonuclear weapons and the subconscious, the connection there is, at least visually, is kind of interesting."}, {"time": 1654, "text": "There may be, Freud would have a few things to say."}, {"time": 1659, "text": "Well, part of it is probably based on my own trajectory through life."}, {"time": 1663, "text": "My father was in the US Army for 27 years."}, {"time": 1666, "text": "And so I started my life out on a military basis."}, {"time": 1670, "text": "And so a lot of probably the things that wander around in my subconscious are connected to that experience."}, {"time": 1676, "text": "I apologize for all the tangents, but."}, {"time": 1678, "text": "Well, you're doing it."}, {"time": 1681, "text": "But you're encouraging by answering the stupid questions."}, {"time": 1687, "text": "No, they're not stupid."}, {"time": 1688, "text": "You know, your father was in the Army."}, {"time": 1694, "text": "What do you think about, Neil deGrasse Tyson recently wrote a book on interlinking the progress of science to sort of the aspirations of our military endeavors and DARPA funding and so on."}, {"time": 1713, "text": "What do you think about war in general?"}, {"time": 1715, "text": "Do you think we'll always have war?"}, {"time": 1717, "text": "Do you think we'll always have conflict in the world?"}, {"time": 1722, "text": "I'm not sure that we're going to be able to afford to have war always, because if."}, {"time": 1727, "text": "Strictly financially speaking?"}, {"time": 1729, "text": "No, not in terms of finance, but in terms of consequences."}, {"time": 1733, "text": "So if you look at technology today, you can have non state actors acquire technology, for example, bioterrorism, whose impact is roughly speaking equivalent to what it used to take nations to impart on a population."}, {"time": 1750, "text": "I think the cost of war is ultimately, it's going to be a little, I think it's going to work a little bit like the Cold War."}, {"time": 1756, "text": "You know, we survived 50, 60 years as a species with these weapons that are so terrible that they could have actually ended our form of life on this planet, but it didn't."}, {"time": 1769, "text": "Why didn't it?"}, {"time": 1770, "text": "Well, it's a very bizarre and interesting thing, but it was called mutually assured destruction."}, {"time": 1774, "text": "And so the cost was so great that people eventually figured out that you can't really use these things, which is kind of interesting, because if you read the history about the development of nuclear weapons, physicists actually realized this pretty quickly."}, {"time": 1786, "text": "I think it was maybe Schrodinger who said that these things are not really weapons."}, {"time": 1791, "text": "They're political implements."}, {"time": 1792, "text": "They're not weapons, because the cost is so high."}, {"time": 1795, "text": "And if you take that example and spread it out to the kind of technological development we're seeing now outside of nuclear physics, but I picked the example of biology, I could well imagine that there would be material science sorts of equivalents across a broad front of technology."}, {"time": 1814, "text": "You take that experience from nuclear weapons, and the picture that I see is that it would be possible to develop technologies that are so terrible that you couldn't use them, because the costs are too high."}, {"time": 1827, "text": "And that might cure us."}, {"time": 1829, "text": "And many people have argued that actually it prevented, nuclear weapons have prevented more military conflict than."}, {"time": 1836, "text": "It certainly froze the conflict domain."}, {"time": 1841, "text": "It's interesting that nowadays it was with the removal of the threat of mutually assured destruction that other forces took over in our geopolitics."}, {"time": 1852, "text": "Do you have worries of existential threats of nuclear weapons or other technologies like artificial intelligence?"}, {"time": 1861, "text": "Do you think we humans will tend to figure out how to not blow ourselves up?"}, {"time": 1866, "text": "I don't know, quite frankly."}, {"time": 1870, "text": "This is something I've thought about."}, {"time": 1871, "text": "And I'm not, I mean, so I'm a spectator in the sense that as a scientist, I collect and collate data."}, {"time": 1881, "text": "So I've been doing that all my life and looking at my species."}, {"time": 1885, "text": "And it's not clear to me that we are going to avoid a catastrophic, self induced ending."}, {"time": 1894, "text": "Are you optimistic?"}, {"time": 1897, "text": "Not as a scientist, but as a single element speaker?"}, {"time": 1900, "text": "I would say I wouldn't bet against us."}, {"time": 1907, "text": "Let's dive into the world of the very small, if we could for a bit."}, {"time": 1912, "text": "What are the basic particles, either experimentally observed or hypothesized by physicists?"}, {"time": 1919, "text": "So as we physicists look at the universe, you can, first of all, there are two big buckets of particles."}, {"time": 1925, "text": "That is the smallest objects that we are able to currently mathematically conceive and then experimentally verify that these ideas have a sense of accuracy to them."}, {"time": 1937, "text": "So one of those buckets we call matter."}, {"time": 1940, "text": "These are things like electrons, things that are like quarks, which are particles that exist inside of protons."}, {"time": 1947, "text": "And there's a whole family of these things."}, {"time": 1950, "text": "There are, in fact, 18 quarks and apparently six electron like objects that we call leptons."}, {"time": 1957, "text": "So that's one bucket."}, {"time": 1959, "text": "The other bucket that we see both in our mathematics as well as in our experimental equipment are a set of particles that you can call force carriers."}, {"time": 1967, "text": "The most familiar force carrier is the photon, the particle of light that allows you to see me."}, {"time": 1972, "text": "In fact, it's the same object that carries electric repulsion between like charges."}, {"time": 1978, "text": "From science fiction, we have the object called the graviton, which is talked about a lot in science fiction and Star Trek."}, {"time": 1985, "text": "But the graviton is also a mathematical object that we physicists have known about essentially since Einstein wrote his theory of general relativity."}, {"time": 1993, "text": "There are four forces in nature, the fundamental forces."}, {"time": 1997, "text": "There is the gravitational force."}, {"time": 1999, "text": "Its carrier is the graviton."}, {"time": 2001, "text": "There are three other forces in nature, the electromagnetic force, the strong nuclear force, and the weak nuclear force."}, {"time": 2007, "text": "And each one of these forces has one or more carriers."}, {"time": 2010, "text": "The photon is the carrier of the electromagnetic force."}, {"time": 2013, "text": "The strong nuclear force actually has eight carriers."}, {"time": 2015, "text": "They're called gluons."}, {"time": 2017, "text": "And then the weak nuclear force has three carriers."}, {"time": 2019, "text": "They're called the W plus, W minus, and Z bosons."}, {"time": 2024, "text": "So those are the things that both in mathematics and in experiments, by the way, the most precise experiments we're ever as a species able to conduct is about measuring the accuracy of these ideas."}, {"time": 2035, "text": "And we know that at least to one part in a billion, these ideas are right."}, {"time": 2039, "text": "So first of all, you've made it sound both elegant and simple."}, {"time": 2045, "text": "But is it crazy to you that there is force carriers?"}, {"time": 2051, "text": "Like, is that supposed to be a trivial idea to think about?"}, {"time": 2054, "text": "If we think about photons, gluons, that there's four fundamental forces of physics, and then those forces are expressed."}, {"time": 2064, "text": "There's carriers of those forces."}, {"time": 2066, "text": "Like, is that a kind of trivial thing?"}, {"time": 2069, "text": "It's not a trivial thing at all."}, {"time": 2071, "text": "In fact, it was a puzzle for Sir Isaac Newton, because he's the first person to give us basically physics."}, {"time": 2077, "text": "Before Isaac Newton, physics didn't exist."}, {"time": 2079, "text": "What did exist was called natural philosophy, so discussions about using the methods of classical philosophy to understand nature, natural philosophy."}, {"time": 2088, "text": "So the Greeks, we call them scientists, but they were natural philosophers."}, {"time": 2092, "text": "Physics doesn't get born until Newton writes the Principia."}, {"time": 2096, "text": "One of the things that puzzled him was how gravity works, because if you read very carefully what he writes, he basically says, and I'm paraphrasing badly, but he basically says that someone who thinks deeply about this subject would find it inconceivable that an object in one place or location can magically reach out and affect another object with nothing intervening."}, {"time": 2121, "text": "And so it puzzled him."}, {"time": 2123, "text": "There's a puzzle of you, action at a distance."}, {"time": 2125, "text": "I mean, not as a physicist."}, {"time": 2127, "text": "It would, it would, except that I am a physicist, and we have long ago resolved this issue, and the resolution came about through a second great physicist."}, {"time": 2136, "text": "Most people have heard of Newton."}, {"time": 2138, "text": "Most people have heard of Einstein."}, {"time": 2140, "text": "But between the two of them, there was another extraordinarily great physicist, a man named James Clark Maxwell."}, {"time": 2145, "text": "And Maxwell, between these two other giants, taught us about electric and magnetic forces, and it's from his equations that one can figure out that there's a carrier called the photon."}, {"time": 2158, "text": "So this was resolved for physicists around 1860 or so."}, {"time": 2164, "text": "So what are bosons and fermions and hadrons, elementary and composites?"}, {"time": 2169, "text": "Sure, so earlier I said."}, {"time": 2172, "text": "Two buckets."}, {"time": 2173, "text": "You have got two buckets if you wanna try to build the universe."}, {"time": 2175, "text": "You gotta start off with things on these two buckets."}, {"time": 2178, "text": "So you gotta have things, that's a matter, and then you have to have other objects that act on them to cause those things to cohere to fixed finite patterns, because you need those fixed finite patterns as building blocks."}, {"time": 2191, "text": "So that's the way our universe looks to people like me."}, {"time": 2194, "text": "Now, the building blocks do different things."}, {"time": 2197, "text": "So let's go back to these two buckets again."}, {"time": 2199, "text": "Let me start with a bucket containing the particle of light."}, {"time": 2202, "text": "Let me imagine I'm in a dusty room with two flashlights, and I have one flashlight, which I direct directly in front of me, and then I have you stand over to say my left and then we both take our flashlights and turn them on and make sure the beams go right through each other."}, {"time": 2216, "text": "And the beams do just that."}, {"time": 2217, "text": "They go right through each other."}, {"time": 2218, "text": "They don't bounce off of each other."}, {"time": 2220, "text": "The reason the room has to be dusty is because we wanna see the light."}, {"time": 2223, "text": "The room dust wasn't there."}, {"time": 2224, "text": "We wouldn't actually see the light until it got to the other wall, right?"}, {"time": 2227, "text": "So you see the beam because it's the dust in the air."}, {"time": 2229, "text": "But the two beams actually pass right through each other."}, {"time": 2232, "text": "They literally pass right through."}, {"time": 2233, "text": "They don't affect each other at all."}, {"time": 2235, "text": "One acts like the other's not there."}, {"time": 2240, "text": "The particle of light is the simplest example that shows that behavior."}, {"time": 2244, "text": "That's a boson."}, {"time": 2246, "text": "Now let's imagine that we're in the same dusty room and this time you have a bucket of balls and I have a bucket of balls."}, {"time": 2253, "text": "And we try to throw them so that we get something like a beam, throwing them fast, right?"}, {"time": 2259, "text": "If they collide, they don't just pass through each other."}, {"time": 2261, "text": "They bounce off of each other."}, {"time": 2263, "text": "Now that's mostly because they have electric charge and electric charges, light charges repel."}, {"time": 2268, "text": "But mathematically, I know how to turn off the electric charge."}, {"time": 2271, "text": "And if you do that, you'll find these still repel."}, {"time": 2273, "text": "And it's because they are these things we call fermions."}, {"time": 2277, "text": "So this is how you distinguish the things that are in the two buckets."}, {"time": 2280, "text": "They are either bosons or fermions."}, {"time": 2284, "text": "Which of them, and maybe you can mention the most popular of the bosons."}, {"time": 2289, "text": "The most recently discovered."}, {"time": 2292, "text": "It's like when I was in high school and there was a really popular majorette."}, {"time": 2298, "text": "Her name is the Higgs particle these days."}, {"time": 2301, "text": "Can you describe which of the bosons and the fermions have been discovered, hypothesized, which have been experimentally validated, what's still out there?"}, {"time": 2312, "text": "Right, so the two buckets that I've actually described to you have all been first hypothesized and then verified by observation."}, {"time": 2323, "text": "With the Higgs boson being the most recent one of these things."}, {"time": 2327, "text": "We haven't actually verified the graviton interestingly enough."}, {"time": 2331, "text": "Mathematically, we have an expectation that gravitons exist."}, {"time": 2335, "text": "But we've not performed an experiment to show that this is an accurate idea that nature uses."}, {"time": 2339, "text": "So something has to be a carrier."}, {"time": 2342, "text": "For the force of gravity, exactly."}, {"time": 2344, "text": "Can it be something way more mysterious than we, so when you say the graviton, is it, would it be like the other particles, force carriers, or can it be something much more mysterious?"}, {"time": 2356, "text": "In some ways, yes, but in other ways, no."}, {"time": 2358, "text": "It turns out that the graviton is also, if you look at Einstein's theory, he taught us about this thing he calls space time, which is, if you try to imagine it, you can sort of think of it as kind of a rubber surface."}, {"time": 2372, "text": "That's one popular depiction of space time."}, {"time": 2374, "text": "It's not an accurate depiction because the only accuracy is actually in the calculus that he uses, but that's close enough."}, {"time": 2381, "text": "So if you have a sheet of rubber, you can wave it."}, {"time": 2383, "text": "You can actually form a wave on it."}, {"time": 2386, "text": "Space time is enough like that so that when space time oscillates, you create these waves."}, {"time": 2391, "text": "These waves carry energy."}, {"time": 2393, "text": "We expect them to carry energy in quanta."}, {"time": 2395, "text": "That's what a graviton is."}, {"time": 2396, "text": "It's a wave in space time."}, {"time": 2397, "text": "And so the fact that we have seen the waves with LIGO over the course of the last three years, and we've recently used gravitational wave observatories to watch colliding black holes and neutron stars and all sorts of really cool stuff out there."}, {"time": 2412, "text": "So we know the waves exist, but in order to know that gravitons exist, you have to prove that these waves carry energy in energy packets."}, {"time": 2420, "text": "And that's what we don't have the technology to do yet."}, {"time": 2425, "text": "And perhaps briefly jumping to a philosophical question, does it make sense to you that gravity is so much weaker than the other forces?"}, {"time": 2434, "text": "You see, now you've touched on a very deep mystery about physics."}, {"time": 2442, "text": "There are a lot of such questions in physics about why things are as they are."}, {"time": 2447, "text": "And as someone who believes that there are some things that certainly are coincidences, like you could ask the same question about, well, why are the planets at the orbits that they are around the sun?"}, {"time": 2458, "text": "The answer turns out there is no good reason."}, {"time": 2460, "text": "It's just an accident."}, {"time": 2461, "text": "So there are things in nature that have that character."}, {"time": 2463, "text": "And perhaps the strength of the various forces is like that."}, {"time": 2468, "text": "On the other hand, we don't know that that's the case."}, {"time": 2470, "text": "And there may be some deep reasons about why the forces are ordered as they are, where the weakest force is gravity, the next weakest force is the weak interaction, the weak nuclear force, then there's electromagnetism, there's a strong force."}, {"time": 2483, "text": "We don't really have a good understanding of why this is the ordering of the forces."}, {"time": 2487, "text": "So some of the fascinating work you've done is in the space of supersymmetry, symmetry in general."}, {"time": 2496, "text": "Can you describe, first of all, what is supersymmetry?"}, {"time": 2499, "text": "Yes, so you remember the two buckets I told you about perhaps earlier?"}, {"time": 2503, "text": "So there are two buckets in our universe."}, {"time": 2506, "text": "So now I want you to think about drawing a pie that has four quadrants."}, {"time": 2513, "text": "So I want you to cut the piece of pie in fourths."}, {"time": 2516, "text": "So in one quadrant, I'm gonna put all the buckets that we talked about that are like the electron and quarks."}, {"time": 2521, "text": "In a different quadrant, I'm going to put all the force carriers."}, {"time": 2524, "text": "The other two quadrants are empty."}, {"time": 2526, "text": "Now, I showed you a picture of that."}, {"time": 2528, "text": "You'd see a circle."}, {"time": 2530, "text": "There would be a bunch of stuff in one upper quadrant and stuff in others."}, {"time": 2533, "text": "And then I would ask you a question."}, {"time": 2535, "text": "Does that look symmetrical to you?"}, {"time": 2540, "text": "And that's exactly right because we humans actually have a very deeply programmed sense of symmetry."}, {"time": 2548, "text": "It's something that is part of that mystery of the universe."}, {"time": 2552, "text": "So how would you make it symmetrical?"}, {"time": 2554, "text": "Or one way you could is by saying those two empty quadrants had things in them also."}, {"time": 2558, "text": "And if you do that, that's supersymmetry."}, {"time": 2562, "text": "So that's what I understood when I was a graduate student here at MIT in 1975 when the mathematics of this was first being born."}, {"time": 2572, "text": "Supersymmetry was actually born in the Ukraine in the late 60s, but we had this thing called the Iron Curtain."}, {"time": 2577, "text": "So we Westerners didn't know about it."}, {"time": 2580, "text": "But by the early 70s, independently, there were scientists in the West who had rediscovered supersymmetry."}, {"time": 2587, "text": "Bruno Zemeno and Julius Wess were their names."}, {"time": 2590, "text": "So this was around 71 or 72 when this happened."}, {"time": 2594, "text": "I started graduate school in 73."}, {"time": 2596, "text": "So around 74, 75, I was trying to figure out how to write a thesis so that I could become a physicist the rest of my life."}, {"time": 2603, "text": "I did a, I had a great advisor, Professor James Young who had taught me a number of things about electrons and weak forces and those sorts of things."}, {"time": 2613, "text": "But I decided that if I was going to have a really an opportunity to maximize my chances of being successful, I should strike it out in a direction that other people were not studying."}, {"time": 2628, "text": "And so as a consequence, I surveyed ideas that were going, that were being developed."}, {"time": 2634, "text": "And I came across the idea of supersymmetry."}, {"time": 2637, "text": "And it was so, the mathematics was so remarkable that I just, it bowled me over."}, {"time": 2643, "text": "I actually have two undergraduate degrees."}, {"time": 2645, "text": "My first undergraduate degree is actually mathematics."}, {"time": 2647, "text": "And my second is physics, even though I always wanted to be a physicist."}, {"time": 2652, "text": "Plan A, which involved getting good grades was mathematics."}, {"time": 2657, "text": "I was a mathematics major thinking about graduate school, but my heart was in physics."}, {"time": 2662, "text": "If we could take a small digression, what's to you the most beautiful idea in mathematics that you've encountered in this interplay between math and physics?"}, {"time": 2673, "text": "It's the idea of symmetry."}, {"time": 2675, "text": "The fact that our innate sense of symmetry winds up aligning with just incredible mathematics, to me is the most beautiful thing."}, {"time": 2687, "text": "It's very strange, but true that if symmetries were perfect, we would not exist."}, {"time": 2693, "text": "And so even though we have these very powerful ideas about balance in the universe in some sense, it's only when you break those balances that you get creatures like humans and objects like planets and stars."}, {"time": 2703, "text": "So although they are a scaffold for reality, they cannot be the entirety of reality."}, {"time": 2709, "text": "So I'm kind of naturally attracted to parts of science and technology where symmetry plays a dominant role."}, {"time": 2721, "text": "And not just, I guess, symmetry as you said, but the magic happens when you break the symmetry."}, {"time": 2726, "text": "The magic happens when you break the symmetry."}, {"time": 2729, "text": "Okay, so diving right back in, you mentioned four quadrants."}, {"time": 2734, "text": "Two are filled with stuff we can, two buckets."}, {"time": 2737, "text": "And then there's crazy mathematical thing, ideas fulfilling the other two."}, {"time": 2741, "text": "What are those things?"}, {"time": 2743, "text": "So earlier, the way I described these two buckets is I gave you a story that started out by putting us in a dusty room with two flashlights."}, {"time": 2752, "text": "And I said, turn on your flashlight, I'll turn on mine, the beams will go through each other."}, {"time": 2756, "text": "And the beams are composed of force carriers called photons."}, {"time": 2760, "text": "They carry the electromagnetic force and they pass right through each other."}, {"time": 2764, "text": "So imagine looking at the mathematics of such an object, which you don't have to imagine people like me do that."}, {"time": 2771, "text": "So you take that mathematics and then you ask yourself a question."}, {"time": 2775, "text": "You see, mathematics is a palette."}, {"time": 2776, "text": "It's just like a musical composer is able to construct variations on a theme."}, {"time": 2784, "text": "Well, a piece of mathematics in the hand of a physicist is something that we can construct variations on."}, {"time": 2789, "text": "So even though the mathematics that Maxwell gave us about light, we know how to construct variations on that."}, {"time": 2798, "text": "And one of the variations you can construct is to say, suppose you have a force carrier for electromagnetism that behaves like an electron in that it would bounce off of another one."}, {"time": 2809, "text": "That's changing a mathematical term in an equation."}, {"time": 2813, "text": "So if you did that, you would have a force carrier."}, {"time": 2816, "text": "So you would say first it belongs in this force carrying bucket, but it's got this property of bouncing off like electrons."}, {"time": 2821, "text": "So you say, well, gee, wait, no, that's not the right bucket."}, {"time": 2824, "text": "So you're forced to actually put it in one of these empty quadrants."}, {"time": 2827, "text": "So those sorts of things, basically we give them..."}, {"time": 2832, "text": "So the photon mathematically can be accompanied by a photino."}, {"time": 2835, "text": "It's the thing that carries a force but has the rule of bouncing off."}, {"time": 2840, "text": "In a similar manner, you could start with an electron and you say, okay, so write down the mathematical electron."}, {"time": 2847, "text": "I know how to do that."}, {"time": 2848, "text": "A physicist named Dirac first told us how to do that back in the late 20s, early 30s."}, {"time": 2853, "text": "So take that mathematics."}, {"time": 2854, "text": "And then you say, let me look at that mathematics and find out what in the mathematics causes two electrons to bounce off of each other, even if I turn off the electrical charge."}, {"time": 2864, "text": "So I could do that."}, {"time": 2865, "text": "And now let me change that mathematical term."}, {"time": 2868, "text": "So now I have something that carries electrical charge, but if you take two of them, I'm sorry, if you turn their charges off, they'll pass through each other."}, {"time": 2875, "text": "So that puts things in the other quadrant."}, {"time": 2877, "text": "And those things we tend to call, we put the S in front of their name."}, {"time": 2882, "text": "So in the lower quadrant here, we have electrons and this now newly filled quadrant, we have selectors."}, {"time": 2888, "text": "And the quadrant over here, we had quarks."}, {"time": 2892, "text": "Over here, we have squarks."}, {"time": 2893, "text": "So now we've got this balanced pie."}, {"time": 2895, "text": "And that's basically what I understood as a graduate student in 1975 about this idea of supersymmetry, that it was going to fill up these two quadrants of the pie in a way that no one had ever thought about before."}, {"time": 2907, "text": "So I was amazed that no one else at MIT found this an interesting idea."}, {"time": 2912, "text": "So it led to my becoming the first person in MIT to really study supersymmetry."}, {"time": 2919, "text": "This is 1975, 76, 77."}, {"time": 2922, "text": "And in 77, I wrote the first PhD thesis in the physics department on this idea because I was drawn to the balance."}, {"time": 2930, "text": "Drawn to the symmetry."}, {"time": 2931, "text": "So what does that, first of all, is this fundamentally a mathematical idea?"}, {"time": 2941, "text": "So how much experimental, and we'll have this theme."}, {"time": 2944, "text": "It's a really interesting one."}, {"time": 2945, "text": "When you explore the world of the small and in your new book talking about Approving Einstein, right, that we'll also talk about, there's this theme of kind of starting it, exploring crazy ideas first in the mathematics and then seeking for ways to experimentally validate them."}, {"time": 2963, "text": "Where do you put supersymmetry in that?"}, {"time": 2965, "text": "It's closer than string theory."}, {"time": 2968, "text": "It has not yet been validated."}, {"time": 2970, "text": "In some sense, you mentioned Einstein, so let's go there for a moment."}, {"time": 2975, "text": "In our book, Approving Einstein Right, we actually do talk about the fact that Albert Einstein in 1915 wrote a set of equations which were very different from Newton's equations in describing gravity."}, {"time": 2986, "text": "These equations made some predictions that were different from Newton's predictions."}, {"time": 2991, "text": "It actually made three different predictions."}, {"time": 2993, "text": "One of them was not actually a prediction, but a postdiction, because it was known that Mercury was not orbiting the sun in the way that Newton would have told you."}, {"time": 3001, "text": "And so Einstein's theory actually describes Mercury orbiting in a way that was observed as opposed to what Newton would have told you."}, {"time": 3009, "text": "So that was one prediction."}, {"time": 3011, "text": "The second prediction that came out of the theory of general relativity, which Einstein wrote in 1915, was that if you, so let me describe an experiment and come back to it."}, {"time": 3023, "text": "Suppose I had a glass of water, and I filled the glass up, and then I moved the glass slowly back and forth between our two faces."}, {"time": 3033, "text": "It would appear to me like your face was moving, even though you weren't moving."}, {"time": 3038, "text": "I mean, it's actually, and what's causing it is because the light gets bent through the glass as it passes from your face to my eye."}, {"time": 3045, "text": "So Einstein in his 1915 theory of general relativity found out that gravity has the same effect on light as that glass of water."}, {"time": 3055, "text": "It would cause beams of light to bend."}, {"time": 3058, "text": "Now, Newton also knew this, but Einstein's prediction was that light would bend twice as much."}, {"time": 3064, "text": "And so here's a mathematical idea."}, {"time": 3067, "text": "Now, how do you actually prove it?"}, {"time": 3069, "text": "Well, you've got to watch."}, {"time": 3071, "text": "Just a quick pause on that, just the language you're using."}, {"time": 3075, "text": "He found out."}, {"time": 3077, "text": "I can say he did a calculation."}, {"time": 3079, "text": "It's a really interesting notion that one of the beautiful things about this universe is you can do a calculation and combine with some of that magical intuition that physicists have, actually predict what would be, what's possible to experimentally validate."}, {"time": 3098, "text": "So he found out in the sense that there seems to be something here and mathematically it should bend, gravity should bend light this amount."}, {"time": 3108, "text": "And so therefore that's something that could be potentially, and then come up with an experiment that could be validated."}, {"time": 3114, "text": "And that's the way that actually modern physics, deeply fundamental modern physics, this is how it works."}, {"time": 3122, "text": "Earlier we spoke about the Higgs boson."}, {"time": 3124, "text": "So why did we go looking for it?"}, {"time": 3126, "text": "The answer is that back in the late 60s and early 70s, some people wrote some equations and the equations predicted this."}, {"time": 3135, "text": "So then we went looking for it."}, {"time": 3138, "text": "So on supersymmetry for a second, there's these things called idynchrous symbols, these strange little graphs."}, {"time": 3147, "text": "You refer to them as revealing something like binary code underlying reality."}, {"time": 3152, "text": "First of all, can you describe these graphs?"}, {"time": 3154, "text": "Describe these graphs, what are they?"}, {"time": 3158, "text": "What are these beautiful little strange graphs?"}, {"time": 3160, "text": "Well, first of all, idynchrous are an invention of mine, together with a colleague named Michael Fox."}, {"time": 3166, "text": "In 2005, we were looking at equations."}, {"time": 3170, "text": "Well, the story's a little bit more complicated and it'll take too long to explain all the details, but the Reader's Digest version is that we were looking at these equations and we figured out that all the data in a certain class of equations could be put in pictures."}, {"time": 3184, "text": "And the pictures, what do they look like?"}, {"time": 3186, "text": "Well, they're just little balls."}, {"time": 3189, "text": "You have black balls and white balls."}, {"time": 3192, "text": "Those stand for those two buckets, by the way, that we talked about in reality."}, {"time": 3195, "text": "The white balls are things that are like particles of light."}, {"time": 3198, "text": "The black balls are like electrons."}, {"time": 3200, "text": "And then you can draw lines connecting these balls."}, {"time": 3204, "text": "And these lines are deeply mathematical objects and there's no way for me to, I have no physical model for telling you what the lines are."}, {"time": 3213, "text": "But if you were a mathematician, I would do a technical phrase saying, this is the orbit of the representation and the action of the symmetry generators."}, {"time": 3221, "text": "Mathematicians wouldn't understand that."}, {"time": 3223, "text": "Nobody else in their right mind would, so let's not go there."}, {"time": 3227, "text": "So, but we figured out that the data that was in the equations was in these funny pictures that we could draw."}, {"time": 3233, "text": "And so that was stunning, but it also was encouraging because there are problems with the equations, which I had first learned about in 1979 when I was down at Harvard and I went out to Caltech for the first time and working with a great scientist by the name of John Schwartz."}, {"time": 3252, "text": "There are problems in the equations we don't know how to solve."}, {"time": 3256, "text": "And so one of the things about solving problems that you don't know how to solve is that beating your head against a brick wall is probably not a good philosophy about how to solve it."}, {"time": 3265, "text": "So what do you need to do?"}, {"time": 3266, "text": "You need to change your sense of reference, your frame of reference, your perspective."}, {"time": 3271, "text": "So when I saw these funny pictures, I thought, gee, that might be a way to solve these problems with equations that we don't know how to do."}, {"time": 3281, "text": "So that was for me one of the first attractions is that I now had an alternative language to try to attack a set of mathematical problems."}, {"time": 3290, "text": "But I quickly realized that A, this mathematical language was not known by mathematicians, which makes it pretty interesting because now you have to actually teach mathematicians about a piece of mathematics because that's how they make their living."}, {"time": 3305, "text": "And the great thing about working with mathematicians, of course, is the rigor with which they examine ideas."}, {"time": 3311, "text": "So they make your ideas better than they start out."}, {"time": 3314, "text": "So I start working with a group of mathematicians and it was in that collaboration that we figured out that these funny pictures had error correcting codes buried in them."}, {"time": 3323, "text": "Can you talk about what are error correcting codes?"}, {"time": 3325, "text": "Ah, sure."}, {"time": 3326, "text": "So the simplest way to talk about error correcting codes is first of all, to talk about digital information."}, {"time": 3336, "text": "Digital information is basically strings of ones and zeros."}, {"time": 3339, "text": "They're called bits."}, {"time": 3341, "text": "So now let's imagine that I want to send you some bits."}, {"time": 3346, "text": "Well, maybe I could show you pictures, but maybe it's a rainy day or maybe the windows in your house are foggy."}, {"time": 3356, "text": "So sometimes when I show you a zero, you might interpret it as a one."}, {"time": 3361, "text": "Or other times when I show you a one, you might interpret it as a zero."}, {"time": 3365, "text": "So if that's the case, that means when I try to send you this data, it comes to you in corrupted form."}, {"time": 3371, "text": "And so the challenge is how do you get it to be uncorrupted?"}, {"time": 3375, "text": "In the 1940s, a computer scientist named Hamming addressed the problem of how do you reliably transmit digital information?"}, {"time": 3386, "text": "And what he came up with was a brilliant idea."}, {"time": 3389, "text": "Now, the way that you solve it is that you take the data that you want to send, the ones in your strings of ones and zeros, your favorite string, and then you dump more ones and zeros in, but you dump them in in a particular pattern."}, {"time": 3401, "text": "And this particular pattern is what a Hamming code is all about."}, {"time": 3405, "text": "So it's an error correcting code because if the person at the other end knows what the pattern's supposed to be, they can figure out when one's got changed to zeros, zero's got changed to one."}, {"time": 3413, "text": "So it turned out that our strange little objects that came from looking at the equations that we couldn't solve, it turns out that when you look at them deeply enough, you find out that they have ones and zeros buried in them."}, {"time": 3427, "text": "But even more astoundingly, the ones and zeros are not there randomly."}, {"time": 3430, "text": "They are in the pattern of error correcting codes."}, {"time": 3434, "text": "So this was an astounding thing that when we first got this result and tried to publish it, it took us three years to convince other physicists that we weren't crazy."}, {"time": 3443, "text": "Eventually we were able to publish it, I and this collaboration of mathematicians and other physicists."}, {"time": 3449, "text": "And so ever since then, I have actually been looking at the mathematics of these objects, trying to still understand properties of the equations."}, {"time": 3459, "text": "And I want to understand the properties of equations because I want to be able to try things like electrons."}, {"time": 3463, "text": "So as you can see, it's just like a two step removed process of trying to get back to reality."}, {"time": 3468, "text": "So what would you say is the most beautiful property of these Adinkra graphs, objects?"}, {"time": 3476, "text": "What do you think, by the way, the word symbols, what do you think of them, these simple graphs?"}, {"time": 3481, "text": "Are they objects or?"}, {"time": 3484, "text": "How should we think about that?"}, {"time": 3486, "text": "For people who work with mathematics like me, our mathematical concepts are, we often refer to them as objects because they feel like real things."}, {"time": 3495, "text": "Even though you can't see them or touch them, they're so much part of your interior life that it is as if you could."}, {"time": 3503, "text": "So we often refer to these things as objects, even though there's nothing objective about them."}, {"time": 3508, "text": "And what does a single graph represent in space?"}, {"time": 3511, "text": "Okay, so the simplest of these graphs has to have one white ball and one black ball."}, {"time": 3516, "text": "That's that balance that we talked about earlier."}, {"time": 3518, "text": "Remember, we want to balance out the quadrants?"}, {"time": 3520, "text": "Well, you can't do it unless you have a black ball and white ball."}, {"time": 3523, "text": "So the simplest of these objects looks like two little balls, one black, one white, connected by a single line."}, {"time": 3529, "text": "And what it's talking about is, as I said, a deep mathematical property related to symmetry."}, {"time": 3534, "text": "You've mentioned the error correcting codes, but is there a particular beautiful property that stands out to you about these objects that you just find?"}, {"time": 3541, "text": "Yes, yes, there is."}, {"time": 3543, "text": "Early on in the development of it."}, {"time": 3544, "text": "Yes, there is."}, {"time": 3545, "text": "The craziest thing about these to me is that when you look at physics and try to write equations where information gets transmitted reliably, if you're in one of these super symmetrical systems with this extra symmetry, that doesn't happen unless there's an error correcting code present."}, {"time": 3566, "text": "So it's as if the universe says, you don't retransmit information unless there's something about an error correcting code."}, {"time": 3573, "text": "This to me is the craziest thing that I've ever personally encountered in my research."}, {"time": 3578, "text": "And it's actually got me to wondering how this could come about, because the only place in nature that we know about error correcting codes is genetics."}, {"time": 3587, "text": "And in genetics, we think it was evolution that causes error correcting codes to be in genomes."}, {"time": 3593, "text": "And so does that mean that there was some kind of form of evolution acting on the mathematical laws of the physics of our universe?"}, {"time": 3599, "text": "This is a very bizarre and strange idea."}, {"time": 3601, "text": "And it's something I've wondered about from time to time since making these discoveries."}, {"time": 3605, "text": "Do you think such an idea could be fundamental, or is it emergent throughout all the different kinds of systems?"}, {"time": 3612, "text": "I don't know whether it's fundamental."}, {"time": 3615, "text": "I probably will not live to find out."}, {"time": 3618, "text": "This is gonna be the work of probably some future either mathematician or physicist to figure out what these things actually mean."}, {"time": 3624, "text": "We have to talk a bit about the magical, the mysterious string theory, super string theory."}, {"time": 3632, "text": "There's still maybe this aspect of it, which is there's still for me from an outsider's perspective, this fascinating heated debate."}, {"time": 3642, "text": "On the status of string theory."}, {"time": 3644, "text": "Can you clarify this debate, perhaps articulating the various views and say where you land on it?"}, {"time": 3650, "text": "So first of all, I doubt that I will be able to say anything to clarify the debate around string theory for a general audience."}, {"time": 3661, "text": "Part of the reason is because string theory has done something I've never seen the erectal physics do."}, {"time": 3668, "text": "It has broken out into consciousness of the general public before we're finished."}, {"time": 3673, "text": "You see, string theory doesn't actually exist because when we use the word theory, we mean a particular set of attributes."}, {"time": 3680, "text": "In particular, it means that you have an overarching paradigm that explains what it is that you're doing."}, {"time": 3685, "text": "No such overarching paradigm exists for string theory."}, {"time": 3689, "text": "What string theory is currently is an enormously large mutually reinforcing collection of mathematical facts in which we can find no contradictions."}, {"time": 3699, "text": "We don't know why it's there, but we can certainly say that without challenge."}, {"time": 3704, "text": "Now, just because you find a piece of mathematics doesn't mean that this applies to nature."}, {"time": 3709, "text": "And in fact, there has been a very heated debate about whether string theory is some sort of hysteria among the community of theoretical physicists, or whether it has something fundamental to say about our universe."}, {"time": 3724, "text": "We don't yet know the answer to that question."}, {"time": 3727, "text": "What those of us who study string theory will tell you are things like, string theory has been extraordinarily productive in getting us to think more deeply, even about mathematics that's not string theory, but the kind of mathematics that we've used to describe elementary particles."}, {"time": 3743, "text": "There have been spin offs from string theory, and this has been going on now for two decades almost, that have allowed us, for example, to more accurately calculate the force between electrons with the presence of quantum mechanics."}, {"time": 3756, "text": "This is not something you hear about in the public."}, {"time": 3759, "text": "There are other similar things."}, {"time": 3762, "text": "That kind of property I just told you about is what's called weak strong duality, and it comes directly from string theory."}, {"time": 3768, "text": "There are other things such as a property called holography, which allows one to take equations and look at them on the boundary of a space, and then to know information about inside a space without actually doing calculations there."}, {"time": 3786, "text": "This has come directly from string theory."}, {"time": 3788, "text": "So there are a number of direct mathematical effects that we learn as string theory, but we take these ideas and look at math that we already know and we find suddenly we're more powerful."}, {"time": 3799, "text": "This is a pretty good indication there's something interesting going on with string theory itself."}, {"time": 3803, "text": "So it's the early days of a powerful mathematical framework."}, {"time": 3805, "text": "That's what we have right now."}, {"time": 3807, "text": "What are the big, first of all, most people will probably, which as you said, most general public would know actually what string theory is, which is at the highest level, which is a fascinating fact."}, {"time": 3821, "text": "Well, string theory is what they do on the Big Bang Theory, right?"}, {"time": 3824, "text": "One, can you maybe describe what is string theory, and two, what are the open challenges?"}, {"time": 3835, "text": "So what is string theory?"}, {"time": 3837, "text": "Well, the simplest explanation I can provide is to go back and ask what are particles, which is the question you first asked me."}, {"time": 3850, "text": "What's the smallest thing?"}, {"time": 3851, "text": "Yeah, what's the smallest thing?"}, {"time": 3853, "text": "So particles, one way I try to describe particles to people is start, I want you to imagine a little ball and I want you to let the size of that ball shrink until it has no extent whatsoever, but it still has the mass of the ball."}, {"time": 3872, "text": "That's actually what Newton was working with when he first invented physics."}, {"time": 3876, "text": "He's the real inventor of the massive particle, which is this idea that underlies all of physics."}, {"time": 3883, "text": "So that's where we start."}, {"time": 3884, "text": "It's a mathematical construct that you get by taking a limit of things that you know."}, {"time": 3891, "text": "So what's a string?"}, {"time": 3891, "text": "Well, in the same analogy, I would say, now I want you to start with a piece of spaghetti."}, {"time": 3897, "text": "So we all know what that looks like."}, {"time": 3899, "text": "And now I want you to let the thickness of the spaghetti shrink until it has no thickness."}, {"time": 3905, "text": "Mathematically, I mean, in words, this makes no sense, but mathematically, this actually works and you get this mathematical object out."}, {"time": 3913, "text": "It has properties that are like spaghetti."}, {"time": 3915, "text": "It can wiggle and jiggle, but it can also move collectively like a piece of spaghetti."}, {"time": 3921, "text": "It's the mathematics of those sorts of objects that constitute string theory."}, {"time": 3925, "text": "And does the multidimensional, 11 dimensional, however many dimensional, more than four dimension, is that a crazy idea to you?"}, {"time": 3936, "text": "Is that the stranger aspect of string theory to you?"}, {"time": 3940, "text": "Not really, and also partly because of my own research."}, {"time": 3945, "text": "So earlier we talked about these strange symbols that we've discovered inside the equations."}, {"time": 3951, "text": "It turns out that to a very large extent, a Dinkers don't really care about the number of dimensions."}, {"time": 3956, "text": "They kind of have an internal mathematical consistency that allows them to be manifested in many different dimensions."}, {"time": 3962, "text": "Since supersymmetry is a part of string theory, then the same property you would expect to be inherited by string theory."}, {"time": 3969, "text": "However, another little known fact, which is not in the public debate, is that there are actually strings that are only four dimensional."}, {"time": 3977, "text": "This is something that was discovered at the end of the 80s by a scientist, by three different groups of physicists working independently."}, {"time": 3987, "text": "I and my friend Warren Siegel, who were at the University of Maryland at the time, were able to prove that there's mathematics that looks totally four dimensional, and yet it's a string."}, {"time": 3996, "text": "There was a group in Germany that used slightly different mathematics, but they found the same result."}, {"time": 4002, "text": "And then there was a group at Cornell who using yet a third piece of mathematics found the same result."}, {"time": 4006, "text": "So the fact that extra dimensions is so widely talked about in the public is partly a function of how the public has come to understand string theory and how the story has been told to them."}, {"time": 4019, "text": "But there are alternatives you don't know about."}, {"time": 4022, "text": "If we could talk about maybe experimental validation, and you're the coauthor of a recently published book, Proving Einstein Right, the human story of it too, the daring expeditions that change how we look at the universe."}, {"time": 4039, "text": "Do you see echoes of the early days of general relativity in the 1910s to the more stretched out to string theory?"}, {"time": 4049, "text": "I do, I do."}, {"time": 4051, "text": "And that's one reason why I was happy to focus on the story of how Einstein became a global superstar."}, {"time": 4063, "text": "Earlier in our discussion, we went over his history where in 1915, he came up with this piece of mathematics, used it to do some calculations and then made a prediction."}, {"time": 4078, "text": "But making a prediction is not enough."}, {"time": 4080, "text": "Someone's got to go out and measure."}, {"time": 4082, "text": "And so string theory is in that in between zone."}, {"time": 4087, "text": "Now for Einstein, it was from 1915 to 1919."}, {"time": 4089, "text": "1915 he makes the correct prediction."}, {"time": 4094, "text": "By the way, he made an incorrect prediction about the same thing in 1911, but he corrected himself in 1915."}, {"time": 4100, "text": "And by 1919, the first pieces of experimental observational data became available to say, yes, he's not wrong."}, {"time": 4111, "text": "And by 1922, the argument that based on observation was overwhelming that he was not wrong."}, {"time": 4118, "text": "Can you describe what special general relativity are just briefly?"}, {"time": 4123, "text": "And what prediction Einstein made and maybe some or a memorable moment from the human journey of trying to prove this thing right, which is incredible."}, {"time": 4138, "text": "So I'm very fortunate to have worked with a talented novelist who wanted to write a book that coincided with a book I wanted to write about how science kind of feels if you're a person, because it's actually people who do science, even though that may not be obvious to everyone."}, {"time": 4160, "text": "So for me, I wanted to write this book for a couple of reasons."}, {"time": 4163, "text": "I wanted young people to understand that the seeming alien giants that live before them were just as human as they are."}, {"time": 4174, "text": "They get married, they get divorced."}, {"time": 4177, "text": "They do terrible things."}, {"time": 4178, "text": "They do great things."}, {"time": 4179, "text": "They're people."}, {"time": 4180, "text": "They're just people like you."}, {"time": 4182, "text": "And so that part of telling the story allowed me to get that out there for both young people interested in the sciences as well as the public."}, {"time": 4189, "text": "But the other part of the story is I wanted to open up sort of what it was like."}, {"time": 4198, "text": "Now I'm a scientist."}, {"time": 4200, "text": "And so I will not pretend to be a great writer."}, {"time": 4202, "text": "I understand a lot about mathematics and I've even created my own mathematics that is kind of a weird thing to be able to do."}, {"time": 4211, "text": "But in order to tell the story, you really have to have an incredible master of the narrative."}, {"time": 4219, "text": "And that was my coauthor, Kathy Pelletier, who is a novelist."}, {"time": 4224, "text": "So we formed this conjoined brain, I used to call us."}, {"time": 4227, "text": "She used to call us Professor Higgins and Eliza Doolittle."}, {"time": 4230, "text": "My expression for us is that we were a conjoined brain to tell this story."}, {"time": 4234, "text": "And it allowed, so what are some magical moments?"}, {"time": 4239, "text": "To me, the first magical moment in telling the story was looking at Albert Einstein and his struggle because although we regard him as a genius, as I said, in 1911, he actually made an incorrect prediction about bending starlight."}, {"time": 4255, "text": "And that's actually what set the astronomers off."}, {"time": 4259, "text": "In 1914, there was an eclipse."}, {"time": 4262, "text": "And by various accidents of war and weather and all sorts of things that we talk about in the book, no one was able to make the measurement."}, {"time": 4271, "text": "If they had made the measurement, it would have disagreed with his 1911 prediction because nature only has one answer."}, {"time": 4282, "text": "And so then you see how fortunate he was that wars and bad weather and accidents and transporting equipment stopped any measurements from being made."}, {"time": 4295, "text": "So he corrects himself in 1915, but the astronomers are already out there trying to make the measurement."}, {"time": 4301, "text": "So now he gives them a different number."}, {"time": 4303, "text": "And it turns out that's the number that nature agrees with."}, {"time": 4306, "text": "So it gives you a sense of this is a person struggling with something deeply."}, {"time": 4312, "text": "And although his deep insight led him to this, it is the circumstance of time, place and accident but through which we view him."}, {"time": 4323, "text": "And the story could have turned out very differently where first he makes a prediction, the measurements are made in 1914, they disagree with his prediction."}, {"time": 4333, "text": "And so what would the world view him as?"}, {"time": 4335, "text": "Well, he's this professor who made this prediction that didn't get it right, yes?"}, {"time": 4340, "text": "So the fragility of human history is illustrated by that story."}, {"time": 4347, "text": "And it's one of my favorite things."}, {"time": 4349, "text": "You also learn things like in our book, how eclipses and watching eclipses was a driver of the development of science in our nation when it was very young."}, {"time": 4358, "text": "In fact, even before we were a nation, it turns out there were citizens of this would be country that were going out trying to measure eclipses."}, {"time": 4370, "text": "So some fortune, some misfortune affects the progress of science."}, {"time": 4377, "text": "Especially with ideas as, to me at least, if I put myself back in those days, as radical as general relativity is."}, {"time": 4388, "text": "First, can you describe, if it's OK briefly, what general relativity is?"}, {"time": 4394, "text": "And yeah, could you just take a moment of, yeah, put yourself in those shoes in the academic researchers, scientists of that time, and what is this theory?"}, {"time": 4405, "text": "What is it trying to describe about our world?"}, {"time": 4408, "text": "It's trying to answer the thing that left Isaac Newton puzzled."}, {"time": 4417, "text": "Isaac Newton says gravity magically goes from one place to another."}, {"time": 4421, "text": "He doesn't believe it, by the way."}, {"time": 4423, "text": "He knows that's not right."}, {"time": 4425, "text": "But the mathematics is so good that you have to say, well, I'll throw my qualms away because I'll use it."}, {"time": 4432, "text": "That's all we used to get a man from the Earth to the moon was that mathematics."}, {"time": 4438, "text": "So I'm one of those scientists, and I've seen this."}, {"time": 4443, "text": "And if I thought deeply about it, maybe I know that Newton himself wasn't comfortable."}, {"time": 4448, "text": "And so the first thing I would hope that I would feel is, gee, there's this young kid out there who has an idea to fill in this hole that was left with us by Sir Isaac Newton."}, {"time": 4459, "text": "That, I hope, would be my reaction."}, {"time": 4463, "text": "I have a suspicion."}, {"time": 4464, "text": "I'm kind of a mathematical creature."}, {"time": 4469, "text": "I was four years old when I first decided that science was what I wanted to do with my life."}, {"time": 4473, "text": "And so if my personality back then was like it is now, I think it's probably likely I would want to have studied his mathematics."}, {"time": 4483, "text": "What was a piece of mathematics that he was using to make this prediction?"}, {"time": 4487, "text": "Because he didn't actually create that mathematics."}, {"time": 4490, "text": "That mathematics was created roughly 50 years before he lived."}, {"time": 4493, "text": "He's the person who harnessed it in order to make a prediction."}, {"time": 4497, "text": "In fact, he had to be taught this mathematics by a friend."}, {"time": 4500, "text": "So this is in our book."}, {"time": 4503, "text": "So putting myself in that time, I would want to, like I said, I think I would feel excitement."}, {"time": 4509, "text": "I would want to know what the mathematics is."}, {"time": 4510, "text": "And then I would want to do the calculations myself."}, {"time": 4513, "text": "Because one thing that physics is all about is that you don't have to take anybody's word for anything."}, {"time": 4519, "text": "You can do it yourself."}, {"time": 4520, "text": "It does seem that mathematics is a little bit more tolerant of radical ideas, or mathematicians, or people who find beauty in mathematics."}, {"time": 4531, "text": "All the white questions have no good answer."}, {"time": 4533, "text": "But let me ask, why do you think Einstein never got the Nobel Prize for general relativity?"}, {"time": 4538, "text": "He got it for the photoelectric effect."}, {"time": 4540, "text": "That is correct."}, {"time": 4541, "text": "Well, first of all, that's something that is misunderstood about the Nobel Prize in physics."}, {"time": 4546, "text": "The Nobel Prize in physics is never given for purely proposing an idea."}, {"time": 4554, "text": "It is always given for proposing an idea that has observational support."}, {"time": 4559, "text": "So he could not get the Nobel Prize for either special relativity nor general relativity, because the provisions that Alfred Nobel left for the award prevent that."}, {"time": 4571, "text": "But after it's been validated, can he not get it then, or no?"}, {"time": 4576, "text": "Yes, but remember the validation doesn't really come until the 1920s."}, {"time": 4581, "text": "But that's why they invented the second Nobel Prize."}, {"time": 4584, "text": "I mean, Marie Curie, you can get a second Nobel Prize for one of the greatest theories in physics."}, {"time": 4591, "text": "So let's be clear on this."}, {"time": 4593, "text": "The theory of general relativity had its critics even up until the 50s."}, {"time": 4603, "text": "So if the committee had wanted to give the prize for general relativity, there were vociferous critics of general relativity up until the 50s."}, {"time": 4616, "text": "Einstein died in 1955."}, {"time": 4619, "text": "What lessons do you draw from the story you tell in the book, from general relativity, from the radical nature of the theory, to looking at the future of string theory?"}, {"time": 4632, "text": "Well, I think that the string theorists are probably going to retrace this path."}, {"time": 4637, "text": "But it's going to be far longer and more torturous, in my opinion."}, {"time": 4642, "text": "String theory is such a broad and deep development that, in my opinion, when it becomes acceptable, it's going to be because of a confluence of observations."}, {"time": 4658, "text": "It's not going to be a single observation."}, {"time": 4660, "text": "And I have to tell you that, so I gave a seminar here yesterday at MIT."}, {"time": 4666, "text": "And it's on an idea I have about how string theory can leave signatures in the cosmic microwave background, which is an astrophysical structure."}, {"time": 4676, "text": "And so if those kinds of observations are borne out, if perhaps other things related to the idea of supersymmetry are borne out, those are going to be the first powerful observationally based pieces of evidence that will begin to do what the Eddington expedition did in 1919."}, {"time": 4699, "text": "But that may take several decades."}, {"time": 4702, "text": "Do you think there will be Nobel prizes given for string theory?"}, {"time": 4706, "text": "No, because I think it will exceed normal human lifetimes."}, {"time": 4714, "text": "But there are other prizes that are given."}, {"time": 4718, "text": "I mean, there is something called the Breakthrough Prize."}, {"time": 4722, "text": "There's a Russian immigrant, a Russian American immigrant named Yuri Milner, I believe his name, started this wonderful prize called the Breakthrough Prize."}, {"time": 4733, "text": "It's three times as much money as the Nobel Prize."}, {"time": 4736, "text": "And it gets awarded every year."}, {"time": 4738, "text": "And so something like one of those prizes is likely to be garnered at some point far earlier than a Nobel award."}, {"time": 4747, "text": "Jumping around a few topics."}, {"time": 4749, "text": "While you were at Caltech, you've gotten to interact, I believe, with Richard Feynman, I have to ask."}, {"time": 4756, "text": "Yes, Richard Feynman, indeed."}, {"time": 4759, "text": "Do you have any stories that stand out in your memory of that time?"}, {"time": 4761, "text": "I have a fair number of stories, but I'm not prepared to tell them."}, {"time": 4764, "text": "They're not all politically correct."}, {"time": 4766, "text": "Let me see."}, {"time": 4768, "text": "Let me just say, I'll say the following."}, {"time": 4771, "text": "Richard Feynman, if you've ever read some of the books about him, in particular, there's a book called Surely You're Joking, Mr. Feynman."}, {"time": 4778, "text": "There's a series of books that starts with Surely You're Joking, Mr. Feynman."}, {"time": 4783, "text": "And I think the second one may be something like What Do You Care What They Say or something."}, {"time": 4787, "text": "I mean, the titles are all, there are three of them."}, {"time": 4789, "text": "When I read those books, I was amazed at how accurately those books portrayed the man that I interacted with."}, {"time": 4797, "text": "He was irreverent, he was fun, he was deeply intelligent, he was deeply human."}, {"time": 4803, "text": "And those books tell that story very effectively."}, {"time": 4807, "text": "Even just those moments, how did they affect you as a physicist?"}, {"time": 4812, "text": "Well, one of the, well, it's funny because one of the things that, I didn't hear Feynman say this, but one of the things that is reported that he said is if you're in a bar stool as a physicist, and you can't explain to the guy on the bar stool next to you what you're doing, you don't understand what you're doing."}, {"time": 4835, "text": "And there's a lot of that that I think is correct, that when you truly understand something as complicated as string theory, when it's in its fully formed final development, it should be something you could tell to the person on the bar stool next to you."}, {"time": 4858, "text": "And that's something that affects the way I do science, quite frankly."}, {"time": 4864, "text": "It also affects the way I talk to the public about science."}, {"time": 4868, "text": "It's one of my mantras that I keep deeply, and try to keep deeply before me when I appear in public fora speaking about physics in particular and science in general."}, {"time": 4881, "text": "It's also something that Einstein said in a different way."}, {"time": 4883, "text": "He said he had these two different formulations."}, {"time": 4887, "text": "One of them is when the answer is simple, it's God speaking."}, {"time": 4891, "text": "And the other thing that he said was that what he did in his work was simply the distillation of common sense, that you distill down to something."}, {"time": 4903, "text": "And he also said you make things as simple as possible but no simpler."}, {"time": 4907, "text": "So all of those things, and certainly this attitude for me first seeing this was exemplified by being around Richard Feynman."}, {"time": 4915, "text": "So in all your work, you're always searching for the simplicity, for the simple, clear."}, {"time": 4919, "text": "I am, ultimately."}, {"time": 4920, "text": "Ultimately, I am."}, {"time": 4921, "text": "You served President Barack Obama's Council of Advisors in Science and Technology."}, {"time": 4927, "text": "For seven years, yes."}, {"time": 4928, "text": "For seven years with Eric Schmidt and several other brilliant people?"}, {"time": 4933, "text": "Met Eric for the first time in 2009 when the council was called together."}, {"time": 4939, "text": "Yeah, I've seen pictures of you in that room."}, {"time": 4941, "text": "I mean, there's a bunch of brilliant people."}, {"time": 4943, "text": "It kind of looks amazing."}, {"time": 4944, "text": "What was that experience like, being called upon that kind of service?"}, {"time": 4949, "text": "So let me go back to my father, first of all."}, {"time": 4951, "text": "I earlier mentioned that my father served 27 years in the US Army, starting in World War II."}, {"time": 4957, "text": "He went off in 1942, 43 to fight against the fascists."}, {"time": 4962, "text": "He was part of the supply corps that supplied General Patton as the tanks rolled across Western Europe, pushing back the forces of Nazism to meet up with our Russian comrades who were pushing the Nazis starting in Stalingrad."}, {"time": 4979, "text": "And the Second World War is actually a very interesting piece of history to know from both sides."}, {"time": 4988, "text": "Here in America, we typically don't."}, {"time": 4989, "text": "But I've actually studied history as an adult."}, {"time": 4992, "text": "So I actually know sort of the whole story."}, {"time": 4994, "text": "And on the Russian side, we don't know the Americans."}, {"time": 4996, "text": "We weren't taught the American side of the story."}, {"time": 5000, "text": "I have many Russian friends, and we've had this conversation on many occasions."}, {"time": 5005, "text": "But you know, like General Zhukov, for example, was something that you wouldn't know about, but you might not know about a Patton."}, {"time": 5010, "text": "But you're right."}, {"time": 5010, "text": "So Georgy Zhukov or Rokossovsky, I mean, there's a whole list of names that I've learned in the last 15 or 20 years looking at the Second World War."}, {"time": 5021, "text": "So your father was in the midst of that, probably one of the greatest wars in history."}, {"time": 5026, "text": "In the history of our species."}, {"time": 5029, "text": "And so the idea of service comes to me essentially from that example."}, {"time": 5037, "text": "So in 2009, when I first got a call from a Nobel laureate actually in biology, Harold Varmus, I was on my way to India, and I got this email message, and he said he needed to talk to me."}, {"time": 5055, "text": "And I said, OK, fine, we can talk."}, {"time": 5058, "text": "Got back to States I didn't hear from him."}, {"time": 5060, "text": "We went through several cycles of this, sending me a message, I want to talk to you, and then him never contacting us."}, {"time": 5064, "text": "Finally, I was on my way to give a physics presentation at the University of Florida in Gainesville, and Jess had stepped off a plane, and my mobile phone went off, and it was Harold."}, {"time": 5077, "text": "And so I said, Harold, why do you keep sending me messages that you want to talk but you never call?"}, {"time": 5083, "text": "And he said, well, I'm sorry, things have been hectic and da, da, da, da, da."}, {"time": 5087, "text": "And then he said, if you were offered the opportunity to serve on the US President's Council of Advisors on Science and Technology, what would be your answer?"}, {"time": 5099, "text": "I was amused at the formulation of the question, because it's clear there's a purpose of why the question is asked that way."}, {"time": 5107, "text": "But then he made it clear to me he wasn't joking."}, {"time": 5112, "text": "And literally, one of the few times in my life, my knees went weak and I had to hold myself up against a wall so that I didn't fall over."}, {"time": 5123, "text": "I doubt if most of us who have been the beneficiaries of the benefits of this country, when given that kind of opportunity, could say no."}, {"time": 5134, "text": "And I know I certainly couldn't say no."}, {"time": 5137, "text": "I was frightened out of my wits because I had never, although I have, my career in terms of policy recommendations is actually quite long, it goes back to the 80s, but I had never been called upon to serve as an advisor to a president of the United States."}, {"time": 5160, "text": "And it was very scary, but I did not feel that I could say no because I wouldn't be able to sleep with myself at night saying that I chickened out or whatever."}, {"time": 5174, "text": "And so I took the plunge and we had a pretty good run."}, {"time": 5179, "text": "There are things that I did in those seven years of which I'm extraordinarily proud."}, {"time": 5188, "text": "One of the ways I tell people is if you've ever seen that television cartoon called Schoolhouse Rock, there's this one story about how a bill becomes a law."}, {"time": 5197, "text": "And I've kind of lived that."}, {"time": 5198, "text": "There are things that I did that have now been codified in US law."}, {"time": 5204, "text": "Not everybody gets a chance to do things like that in life."}, {"time": 5207, "text": "What do you think is the, science and technology, especially in American politics, we haven't had a president who's an engineer or a scientist."}, {"time": 5218, "text": "What do you think is the role of a president like President Obama in understanding the latest ideas in science and tech?"}, {"time": 5225, "text": "What was that experience like?"}, {"time": 5226, "text": "Well, first of all, I've met other presidents beside President Obama."}, {"time": 5230, "text": "He is the most extraordinary president that I've ever encountered."}, {"time": 5235, "text": "Despite the fact that he went to Harvard."}, {"time": 5238, "text": "When I think about President Obama, he is a deep mystery to me."}, {"time": 5243, "text": "In the same way perhaps that the universe is a mystery."}, {"time": 5247, "text": "I don't really understand how that constellation of personality traits could come to fit within a single individual."}, {"time": 5255, "text": "But I saw them for seven years."}, {"time": 5258, "text": "So I'm convinced that I wasn't seeing fake news."}, {"time": 5261, "text": "I was seeing real data."}, {"time": 5262, "text": "He was just an extraordinary man."}, {"time": 5264, "text": "And one of the things that was completely clear was that he was not afraid and not intimidated to be in a room of really smart people."}, {"time": 5278, "text": "I mean, really smart people."}, {"time": 5280, "text": "That he was completely comfortable in asking some of the world's greatest experts, what do I do about this problem?"}, {"time": 5289, "text": "And it wasn't that he was going to just take the problem and it wasn't that he was going to just take their answer, but he would listen to the advice."}, {"time": 5298, "text": "And that to me was extraordinary."}, {"time": 5301, "text": "As I said, I've been around other executives and I've never seen one quite like him."}, {"time": 5307, "text": "He's an extraordinary learner, is what I observed."}, {"time": 5310, "text": "And not just about science."}, {"time": 5312, "text": "He has a way of internalizing information in real time that I've never seen in a politician before."}, {"time": 5319, "text": "Even in extraordinarily complicated situations."}, {"time": 5322, "text": "Even scientific ideas."}, {"time": 5323, "text": "Scientific or non scientific."}, {"time": 5325, "text": "Complicated ideas don't have to be scientific ideas."}, {"time": 5327, "text": "But I have, like I said, seen him in real time process complicated ideas with a speed that was stunning."}, {"time": 5334, "text": "In fact, he shocked the entire council."}, {"time": 5336, "text": "I mean, we were all stunned at his capacity to be presented with complicated ideas and then to wrestle with them and internalize them."}, {"time": 5348, "text": "And then come back, more interestingly enough, come back with really good questions to ask."}, {"time": 5354, "text": "I've noticed this in an area that I understand more of artificial intelligence."}, {"time": 5359, "text": "I've seen him integrate information about artificial intelligence and then come out with these kind of Richard Feynman like insights."}, {"time": 5368, "text": "And as I said, those of us who have been in that position, it is stunning to see it happen because you don't expect it."}, {"time": 5375, "text": "Yeah, he takes what, for a lot of sort of graduate students, takes like four years in a particular topic and he just does it in a few minutes."}, {"time": 5383, "text": "He sees it very naturally."}, {"time": 5386, "text": "You've mentioned that you would love to see experimental validation of super strength theory before you shove."}, {"time": 5393, "text": "Before I shuffle off this mortal coil."}, {"time": 5396, "text": "Which the poetry of that reference made me smile when I saw it."}]}]