[{"title": "Leonard Susskind: Quantum Mechanics, String Theory and Black Holes | Lex Fridman Podcast #41", "id": "s78hvV3QLUE", "quotes": [{"time": 293, "text": "Forget for a minute quantum mechanics."}, {"time": 295, "text": "Just visualizing four dimensional space or five dimensional space or six dimensional space, I think we're fundamentally wired to visualize three dimensions."}, {"time": 308, "text": "I can't even visualize two dimensions or one dimension without thinking about it as embedded in three dimensions."}, {"time": 316, "text": "If I wanna visualize a line, I think of the line as being a line in three dimensions."}, {"time": 323, "text": "Or I think of the line as being a line on a piece of paper with a piece of paper being in three dimensions."}, {"time": 328, "text": "I never seem to be able to, in some abstract and pure way, visualize in my head the one dimension, the two dimension, the four dimension, the five dimensions."}, {"time": 338, "text": "And I don't think that's ever gonna happen."}, {"time": 341, "text": "The reason is I think our neural wiring is just set up for that."}, {"time": 347, "text": "On the other hand, we do learn ways to think about five, six, seven dimensions."}, {"time": 352, "text": "We learn ways, we learn mathematical ways, and we learn ways to visualize them, but they're different."}, {"time": 360, "text": "And so yeah, I think we do rewire ourselves."}, {"time": 364, "text": "Whether we can ever completely rewire ourselves to be completely comfortable with these concepts, I doubt."}, {"time": 371, "text": "So that it's completely natural."}, {"time": 373, "text": "To where it's completely natural."}, {"time": 375, "text": "So I'm sure there's somewhat, you could argue, creatures that live in a two dimensional space."}, {"time": 382, "text": "Yeah, maybe there are."}, {"time": 383, "text": "And while it's romanticizing the notion of curse, we're all living, as far as we know, in three dimensional space."}, {"time": 391, "text": "But how do those creatures imagine 3D space?"}, {"time": 395, "text": "Well, probably the way we imagine 4D, by using some mathematics and some equations and some tricks."}, {"time": 404, "text": "Okay, so jumping back to Feynman just for a second."}, {"time": 408, "text": "He had a little bit of an ego."}, {"time": 414, "text": "Why, do you think ego is powerful or dangerous in science?"}, {"time": 420, "text": "I think both, both, both."}, {"time": 422, "text": "I think you have to have both arrogance and humility."}, {"time": 426, "text": "You have to have the arrogance to say, I can do this."}, {"time": 430, "text": "Nature is difficult, nature is very, very hard."}, {"time": 433, "text": "I'm smart enough, I can do it."}, {"time": 436, "text": "I can win the battle with nature."}, {"time": 439, "text": "On the other hand, I think you also have to have the humility to know that you're very likely to be wrong on any given occasion."}, {"time": 449, "text": "Everything you're thinking could suddenly change."}, {"time": 453, "text": "Young people can come along and say things you won't understand and you'll be lost and flabbergasted."}, {"time": 459, "text": "So I think it's a combination of both."}, {"time": 462, "text": "You better recognize that you're very limited, and you better be able to say to yourself, I'm not so limited that I can't win this battle with nature."}, {"time": 473, "text": "It takes a special kind of person who can manage both of those, I would say."}, {"time": 479, "text": "And I would say there's echoes of that in your own work, a little bit of ego, a little bit of outside of the box, humble thinking."}, {"time": 488, "text": "I hope so."}, {"time": 489, "text": "So was there a time where you felt, you looked at yourself and asked, am I completely wrong about this?"}, {"time": 499, "text": "Oh yeah, about the whole thing or about specific things?"}, {"time": 503, "text": "The whole thing."}, {"time": 505, "text": "Wait, which whole thing?"}, {"time": 507, "text": "Me and me and my ability to do this thing."}, {"time": 509, "text": "Oh, those kinds of doubts."}, {"time": 511, "text": "First of all, did you have those kinds of doubts?"}, {"time": 513, "text": "No, I had different kind of doubts."}, {"time": 515, "text": "I came from a very working class background and I was uncomfortable in academia for, oh, for a long time."}, {"time": 523, "text": "But they weren't doubts about my ability or my, they were just the discomfort in being in an environment that my family hadn't participated in, I knew nothing about as a young person."}, {"time": 538, "text": "I didn't learn that there was such a thing called physics until I was almost 20 years old."}, {"time": 542, "text": "Yeah, so I did have certain kind of doubts, but not about my ability."}, {"time": 551, "text": "I don't think I was too worried about whether I would succeed or not."}, {"time": 558, "text": "I never felt this insecurity, am I ever gonna get a job?"}, {"time": 563, "text": "That had never occurred to me that I wouldn't."}, {"time": 567, "text": "Maybe you could speak a little bit to this sense of what is academia."}, {"time": 571, "text": "Because I too feel a bit uncomfortable in it."}, {"time": 577, "text": "There's something I can't put quite into words what you have that's not, doesn't, if we call it music, you play a different kind of music than a lot of academia."}, {"time": 588, "text": "How have you joined this orchestra?"}, {"time": 591, "text": "How do you think about it?"}, {"time": 594, "text": "I don't know that I thought about it as much as I just felt it."}, {"time": 598, "text": "Thinking is one thing, feeling is another thing."}, {"time": 602, "text": "I felt like an outsider until a certain age when I suddenly found myself the ultimate insider in academic physics."}, {"time": 614, "text": "And that was a sharp transition, and I wasn't a young man."}, {"time": 619, "text": "I was probably 50 years old."}, {"time": 622, "text": "So you were never quite, it was a phase transition, you were never quite in the middle."}, {"time": 627, "text": "Yeah, that's right, I wasn't."}, {"time": 629, "text": "I always felt a little bit of an outsider."}, {"time": 632, "text": "In the beginning, a lot an outsider."}, {"time": 637, "text": "My way of thinking was different, my approach to mathematics was different, but also my social background that I came from was different."}, {"time": 649, "text": "Now these days, half the young people I meet, they're parents or professors."}, {"time": 653, "text": "That was not my case."}, {"time": 659, "text": "But then all of a sudden, at some point, I found myself at very much the center of, maybe not the only one at the center, but certainly one of the people in the center of a certain kind of physics."}, {"time": 672, "text": "And all that went away, it went away in a flash."}, {"time": 677, "text": "So maybe a little bit with Feynman, but in general, how do you develop ideas?"}, {"time": 684, "text": "Do you work through ideas alone?"}, {"time": 686, "text": "Do you brainstorm with others?"}, {"time": 687, "text": "Oh, both, both, very definitely both."}, {"time": 691, "text": "The younger time, I spent more time with myself."}, {"time": 696, "text": "Now, because I'm at Stanford, because I have a lot of ex students and people who are interested in the same thing I am, I spend a good deal of time, almost on a daily basis, interacting, brainstorming, as you said."}, {"time": 717, "text": "It's a very important part."}, {"time": 720, "text": "I spend less time probably completely self focused than with a piece of paper and just sitting there staring at it."}, {"time": 729, "text": "What are your hopes for quantum computers?"}, {"time": 733, "text": "So machines that are based on, that have some elements of leverage quantum mechanical ideas."}, {"time": 741, "text": "Yeah, it's not just leveraging quantum mechanical ideas."}, {"time": 744, "text": "You can simulate quantum systems on a classical computer."}, {"time": 749, "text": "Simulate them means solve the Schrodinger equation for them or solve the equations of quantum mechanics or solve the equations of quantum mechanics on a computer, on a classical computer."}, {"time": 763, "text": "But the classical computer is not doing, is not a quantum mechanical system itself."}, {"time": 769, "text": "Of course it is."}, {"time": 770, "text": "Everything's made of quantum mechanics, but it's not functioning."}, {"time": 773, "text": "It's not functioning as a quantum system."}, {"time": 776, "text": "It's just solving equations."}, {"time": 778, "text": "The quantum computer is truly a quantum system which is actually doing the things that you're programming it to do."}, {"time": 787, "text": "You want to program a quantum field theory."}, {"time": 792, "text": "If you do it in classical physics, that program is not actually functioning in the computer as a quantum field theory."}, {"time": 798, "text": "It's just solving some equations."}, {"time": 801, "text": "Physically, it's not doing the things that the quantum system would do."}, {"time": 807, "text": "The quantum computer is really a quantum mechanical system which is actually carrying out the quantum operations."}, {"time": 814, "text": "You can measure it at the end."}, {"time": 816, "text": "It intrinsically satisfies the uncertainty principle."}, {"time": 820, "text": "It is limited in the same way that quantum systems are limited by uncertainty and so forth."}, {"time": 827, "text": "And it really is a quantum system."}, {"time": 829, "text": "That means that what you're doing when you program something for a quantum system is you're actually building a real version of the system."}, {"time": 838, "text": "The limits of a classical computer, classical computers are enormously limited when it comes to the quantum systems."}, {"time": 847, "text": "They're enormously limited because you've probably heard this before, but in order to store the amount of information that's in a quantum state of 400 spins, that's not very many, 400 I can put in my pocket, I can put 400 pennies in my pocket."}, {"time": 867, "text": "To be able to simulate the quantum state of 400 elementary quantum systems, qubits we call them, to do that would take more information than can possibly be stored in the entire universe if it were packed so tightly that you couldn't pack any more in."}, {"time": 890, "text": "400 qubits."}, {"time": 892, "text": "On the other hand, if your quantum computer is composed of 400 qubits, it can do everything 400 qubits can do."}, {"time": 899, "text": "What kind of space, if you just intuitively think about the space of algorithms that that unlocks for us, so there's a whole complexity theory around classical computers, measuring the running time of things, and P, so on, what kind of algorithms just intuitively do you think it unlocks for us?"}, {"time": 918, "text": "Okay, so we know that there are a handful of algorithms that can seriously beat classical computers and which can have exponentially more power."}, {"time": 928, "text": "This is a mathematical statement."}, {"time": 929, "text": "Nobody's exhibited this in the laboratory."}, {"time": 932, "text": "It's a mathematical statement."}, {"time": 933, "text": "We know that's true, but it also seems more and more that the number of such things is very limited."}, {"time": 940, "text": "Only very, very special problems exhibit that much advantage for a quantum computer, of standard problems."}, {"time": 952, "text": "To my mind, as far as I can tell, the great power of quantum computers will actually be to simulate quantum systems."}, {"time": 959, "text": "If you're interested in a certain quantum system and it's too hard to simulate classically, you simply build a version of the same system."}, {"time": 969, "text": "You build a version of it."}, {"time": 971, "text": "You build a model of it that's actually functioning as the system."}, {"time": 974, "text": "You run it, and then you do the same thing you would do to the quantum system."}, {"time": 978, "text": "You make measurements on it, quantum measurements on it."}, {"time": 981, "text": "The advantage is you can run it much slower."}, {"time": 986, "text": "You could say, why bother?"}, {"time": 987, "text": "Why not just use the real system?"}, {"time": 989, "text": "Why not just do experiments on the real system?"}, {"time": 992, "text": "Well, real systems are kind of limited."}, {"time": 993, "text": "You can't change them."}, {"time": 994, "text": "You can't manipulate them."}, {"time": 996, "text": "You can't slow them down so that you can poke into them."}, {"time": 1000, "text": "You can't modify them in arbitrary kinds of ways to see what would happen if I change the system a little bit."}, {"time": 1008, "text": "I think that quantum computers will be extremely valuable in understanding quantum systems."}, {"time": 1020, "text": "At the lowest level of the fundamental laws."}, {"time": 1024, "text": "They're actually satisfying the same laws as the systems that they're simulating."}, {"time": 1029, "text": "Okay, so on the one hand, you have things like factoring."}, {"time": 1033, "text": "Factoring is the great thing of quantum computers."}, {"time": 1037, "text": "Factoring large numbers, that doesn't seem that much to do with quantum mechanics."}, {"time": 1042, "text": "It seems to be almost a fluke that a quantum computer can solve the factoring problem in a short time."}, {"time": 1054, "text": "And those problems seem to be extremely special, rare, and it's not clear to me that there's gonna be a lot of them."}, {"time": 1062, "text": "On the other hand, there are a lot of quantum systems."}, {"time": 1065, "text": "Chemistry, there's solid state physics, there's material science, there's quantum gravity, there's all kinds of quantum field theory."}, {"time": 1074, "text": "And some of these are actually turning out to be applied sciences, as well as very fundamental sciences."}, {"time": 1081, "text": "So we probably will run out of the ability to solve equations for these things."}, {"time": 1087, "text": "Solve equations by the standard methods of pencil and paper."}, {"time": 1091, "text": "Solve the equations by the method of classical computers."}, {"time": 1096, "text": "And so what we'll do is we'll build versions of these systems, run them, and run them under controlled circumstances where we can change them, manipulate them, make measurements on them, and find out all the things we wanna know."}, {"time": 1110, "text": "So in finding out the things we wanna know about very small systems, is there something that we can also find out about the macro level, about something about the function, forgive me, of our brain, biological systems, the stuff that's about one meter in size versus much, much smaller?"}, {"time": 1133, "text": "Well, what all the excitement is about among the people that I interact with is understanding black holes."}, {"time": 1138, "text": "Black holes."}, {"time": 1139, "text": "Black holes are big things."}, {"time": 1142, "text": "They are many, many degrees of freedom."}, {"time": 1144, "text": "There is another kind of quantum system that is big."}, {"time": 1148, "text": "It's a large quantum computer."}, {"time": 1151, "text": "And one of the things we've learned is that the physics of large quantum computers is in some ways similar to the physics of large quantum black holes."}, {"time": 1159, "text": "And we're using that relationship."}, {"time": 1162, "text": "Now you asked, you didn't ask about quantum computers or systems, you didn't ask about black holes, you asked about brains."}, {"time": 1169, "text": "Yeah, about stuff that's in the middle of the two."}, {"time": 1174, "text": "So black holes are, there's something fundamental about black holes that feels to be very different than a brain."}, {"time": 1183, "text": "And they also function in a very quantum mechanical way."}, {"time": 1187, "text": "It is, first of all, unclear to me, but of course it's unclear to me."}, {"time": 1192, "text": "I'm not a neuroscientist."}, {"time": 1195, "text": "I have, I don't even have very many friends who are neuroscientists."}, {"time": 1200, "text": "I would like to have more friends who are neuroscientists."}, {"time": 1202, "text": "I just don't run into them very often."}, {"time": 1205, "text": "Among the few neuroscientists I've ever talked about about this, they are pretty convinced that the brain functions classically, that it is not intrinsically a quantum mechanical system or it doesn't make use of the special features, entanglement, coherence, superposition."}, {"time": 1226, "text": "Are they right?"}, {"time": 1228, "text": "I sort of hope they're wrong just because I like the romantic idea that the brain is a quantum system."}, {"time": 1235, "text": "But I think probably not."}, {"time": 1238, "text": "The other thing, big systems can be composed of lots of little systems."}, {"time": 1244, "text": "Materials, the materials that we work with and so forth are, can be large systems, a large piece of material, but they're made out of quantum systems."}, {"time": 1255, "text": "Now, one of the things that's been happening over the last good number of years is we're discovering materials and quantum systems, which function much more quantum mechanically than we imagined."}, {"time": 1269, "text": "Topological insulators, this kind of thing, that kind of thing."}, {"time": 1273, "text": "Those are macroscopic systems, but they're just superconductors."}, {"time": 1277, "text": "Superconductors have a lot of quantum mechanics in them."}, {"time": 1282, "text": "You can have a large chunk of superconductor."}, {"time": 1285, "text": "So it's a big piece of material."}, {"time": 1286, "text": "On the other hand, it's functioning and its properties depend very, very strongly on quantum mechanics."}, {"time": 1292, "text": "And to analyze them, you need the tools of quantum mechanics."}, {"time": 1297, "text": "If we can go on to black holes and looking at the universe as a information processing system, as a computer, as a giant computer."}, {"time": 1306, "text": "It's a giant computer."}, {"time": 1308, "text": "What's the power of thinking of the universe as an information processing system?"}, {"time": 1312, "text": "Or what is perhaps its use besides the mathematical use of discussing black holes and your famous debates and ideas around that to human beings, or life in general as information processing systems?"}, {"time": 1328, "text": "Well, all systems are information processing systems."}, {"time": 1333, "text": "You poke them, they change a little bit, they evolve."}, {"time": 1336, "text": "All systems are information processing systems."}, {"time": 1338, "text": "So there's no extra magic to us humans?"}, {"time": 1342, "text": "It certainly feels, consciousness intelligence feels like magic."}, {"time": 1346, "text": "It sure does."}, {"time": 1346, "text": "Where does it emerge from?"}, {"time": 1349, "text": "If we look at information processing, what are the emergent phenomena that come from viewing the world as an information processing system?"}, {"time": 1359, "text": "Here is what I think."}, {"time": 1361, "text": "My thoughts are not worth much in this."}, {"time": 1363, "text": "If you ask me about physics, my thoughts may be worth something."}, {"time": 1366, "text": "If you ask me about this, I'm not sure my thoughts are worth anything."}, {"time": 1370, "text": "But as I said earlier, I think when we do introspection, when we imagine doing introspection and try to figure out what it is when we do when we're thinking, I think we get it wrong."}, {"time": 1383, "text": "I'm pretty sure we get it wrong."}, {"time": 1384, "text": "Everything I've heard about the way the brain functions is so counterintuitive."}, {"time": 1389, "text": "For example, you have neurons which detect vertical lines."}, {"time": 1394, "text": "You have different neurons which detect lines at 45 degrees."}, {"time": 1397, "text": "You have different neurons."}, {"time": 1399, "text": "I never imagined that there were whole circuits which were devoted to vertical lines in my brain."}, {"time": 1405, "text": "Doesn't seem to be the way my brain works."}, {"time": 1408, "text": "My brain seems to work if I put my finger up vertically or if I put it horizontally or if I put it this way or that way."}, {"time": 1413, "text": "It seems to me it's the same circuits."}, {"time": 1416, "text": "It's not the way it works."}, {"time": 1418, "text": "The way the brain is compartmentalized seems to be very, very different than what I would have imagined if I were just doing psychological introspection about how things work."}, {"time": 1431, "text": "My conclusion is that we won't get it right that way, that how will we get it right?"}, {"time": 1439, "text": "I think maybe computer scientists will get it right eventually."}, {"time": 1443, "text": "I don't think there are any ways near it."}, {"time": 1444, "text": "I don't even think they're thinking about it, but eventually we will build machines perhaps which are complicated enough and partly engineered, partly evolved, maybe evolved by machine learning and so forth."}, {"time": 1461, "text": "This machine learning is very interesting."}, {"time": 1463, "text": "By machine learning, we will evolve systems and we may start to discover mechanisms that have implications for how we think and for what this consciousness thing is all about and we'll be able to do experiments on them and perhaps answer questions that we can't possibly answer by introspection."}, {"time": 1489, "text": "So that's a really interesting point."}, {"time": 1491, "text": "In many cases, if you look at even a string theory, when you first think about a system, it seems really complicated, like the human brain, and through some basic reasoning and trying to discover fundamental low level behavior of the system, you find out that it's actually much simpler."}, {"time": 1510, "text": "Do you, one, have you, is that generally the process and two, do you have that also hope for biological systems as well, for all the kinds of stuff we're studying at the human level?"}, {"time": 1521, "text": "Of course, physics always begins by trying to find the simplest version of something and analyze it."}, {"time": 1526, "text": "Yeah, I mean, there are lots of examples where physics has taken very complicated systems, analyzed them and found simplicity in them for sure."}, {"time": 1536, "text": "I said superconductors before, it's an obvious one."}, {"time": 1539, "text": "A superconductor seems like a monstrously complicated thing with all sorts of crazy electrical properties, magnetic properties and so forth."}, {"time": 1548, "text": "And when it finally is boiled down to its simplest elements, it's a very simple quantum mechanical phenomenon called spontaneous symmetry breaking, and which we, in other contexts, we learned about and we're very familiar with."}, {"time": 1566, "text": "So yeah, I mean, yes, we do take complicated things, make them simple, but what we don't want to do is take things which are intrinsically complicated and fool ourselves into thinking that we can make them simple."}, {"time": 1580, "text": "We don't want to make, I don't know who said this, but we don't want to make them simpler than they really are, okay?"}, {"time": 1586, "text": "Is the brain a thing which ultimately functions by some simple rules or is it just complicated?"}, {"time": 1595, "text": "In terms of artificial intelligence, nobody really knows what are the limits of our current approaches, you mentioned machine learning."}, {"time": 1603, "text": "How do we create human level intelligence?"}, {"time": 1604, "text": "It seems that there's a lot of very smart physicists who perhaps oversimplify the nature of intelligence and think of it as information processing, and therefore there doesn't seem to be any theoretical reason why we can't artificially create human level or superhuman level intelligence."}, {"time": 1622, "text": "In fact, the reasoning goes, if you create human level intelligence, the same approach you just used to create human level intelligence should allow you to create superhuman level intelligence very easily, exponentially."}, {"time": 1636, "text": "So what do you think that way of thinking that comes from physicists is all about?"}, {"time": 1642, "text": "I wish I knew, but there's a particular reason why I wish I knew."}, {"time": 1647, "text": "I have a second job."}, {"time": 1650, "text": "I consult for Google, not for Google, for Google X. I am the senior academic advisor to a group of machine learning physicists."}, {"time": 1663, "text": "Now that sounds crazy because I know nothing about the subject."}, {"time": 1667, "text": "I know very little about the subject."}, {"time": 1669, "text": "On the other hand, I'm good at giving advice, so I give them advice on things."}, {"time": 1673, "text": "Anyway, I see these young physicists who are approaching the machine learning problem."}, {"time": 1678, "text": "There is a real machine learning problem."}, {"time": 1680, "text": "Namely, why does it work as well as it does?"}, {"time": 1683, "text": "Nobody really seems to understand why it is capable of doing the kind of generalizations that it does and so forth."}, {"time": 1691, "text": "And there are three groups of people who have thought about this."}, {"time": 1697, "text": "There are the engineers."}, {"time": 1699, "text": "The engineers are incredibly smart, but they tend not to think as hard about why the thing is working as much as they do how to use it."}, {"time": 1708, "text": "Obviously, they provided a lot of data, and it is they who demonstrated that machine learning can work much better than you have any right to expect."}, {"time": 1717, "text": "The machine learning systems are systems."}, {"time": 1720, "text": "The system's not too different than the kind of systems that physicists study."}, {"time": 1724, "text": "There's not all that much difference between quantum, in the structure of mathematics, physically, yes, but in the structure of mathematics, between a tensor network designed to describe a quantum system on the one hand and the kind of networks that are used in machine learning."}, {"time": 1745, "text": "So there are more and more, I think, young physicists are being drawn to this field of machine learning, some very, very good ones."}, {"time": 1755, "text": "I work with a number of very good ones, not on machine learning, but on having lunch."}, {"time": 1760, "text": "On having lunch?"}, {"time": 1763, "text": "And I can tell you they are super smart."}, {"time": 1767, "text": "They don't seem to be so arrogant about their physics backgrounds that they think they can do things that nobody else can do."}, {"time": 1775, "text": "But the physics way of thinking, I think, will add great value to, or will bring value to the machine learning."}, {"time": 1783, "text": "I believe it will."}, {"time": 1785, "text": "And I think it already has."}, {"time": 1787, "text": "At what time scale do you think predicting the future becomes useless in your long experience and being surprised at new discoveries?"}, {"time": 1797, "text": "Well, sometimes a day, sometimes 20 years."}, {"time": 1803, "text": "There are things which I thought we were very far from understanding, which practically in a snap of the fingers or a blink of the eye suddenly became understood, completely surprising to me."}, {"time": 1821, "text": "There are other things which I looked at and I said, we're not gonna understand these things for 500 years, in particular quantum gravity."}, {"time": 1829, "text": "The scale for that was 20 years, 25 years."}, {"time": 1832, "text": "And we understand a lot and we don't understand it completely now by any means, but I thought it was 500 years to make any progress."}, {"time": 1840, "text": "It turned out to be very, very far from that."}, {"time": 1842, "text": "It turned out to be more like 20 or 25 years from the time when I thought it was 500 years."}, {"time": 1848, "text": "So if we may, can we jump around quantum gravity, some basic ideas in physics?"}, {"time": 1853, "text": "What is the dream of string theory mathematically?"}, {"time": 1859, "text": "What is the hope?"}, {"time": 1860, "text": "Where does it come from?"}, {"time": 1861, "text": "What problem is it trying to solve?"}, {"time": 1863, "text": "I don't think the dream of string theory is any different than the dream of fundamental theoretical physics altogether."}, {"time": 1869, "text": "Understanding a unified theory of everything."}, {"time": 1872, "text": "I don't like thinking of string theory as a subject unto itself with people called string theorists who are the practitioners of this thing called string theory."}, {"time": 1884, "text": "I much prefer to think of them as theoretical physicists trying to answer deep fundamental questions about nature, in particular gravity, in particular gravity and its connection with quantum mechanics, and who at the present time find string theory a useful tool rather than saying there's a subject called string theorists."}, {"time": 1906, "text": "I don't like being referred to as a string theorist."}, {"time": 1908, "text": "Yes, but as a tool, is it useful to think about our nature in multiple dimensions, the strings vibrating?"}, {"time": 1917, "text": "I believe it is useful."}, {"time": 1919, "text": "I'll tell you what the main use of it has been up till now."}, {"time": 1922, "text": "Well, it has had a number of main uses."}, {"time": 1923, "text": "Originally, string theory was invented, and I know that I was there."}, {"time": 1927, "text": "I was right at the spot where it was being invented literally, and it was being invented to understand hadrons."}, {"time": 1936, "text": "Hadrons are subnuclear particles, protons, neutrons, mesons, and at that time, the late 60s, early 70s, it was clear from experiment that these particles called hadrons could vibrate, could rotate, could do all the things that a little closed string can do, and it was and is a valid and correct theory of these hadrons."}, {"time": 1967, "text": "It's been experimentally tested, and that is a done deal."}, {"time": 1973, "text": "It had a second life as a theory of gravity, the same basic mathematics, except on a very, very much smaller distance scale."}, {"time": 1982, "text": "The objects of gravitation are 19 orders of magnitude or orders of magnitude smaller than a proton, but the same mathematics turned up."}, {"time": 1992, "text": "The same mathematics turned up."}, {"time": 1994, "text": "What has been its value?"}, {"time": 1995, "text": "Its value is that it's mathematically rigorous in many ways and enabled us to find mathematical structures which have both quantum mechanics and gravity."}, {"time": 2010, "text": "With rigor, we can test out ideas."}, {"time": 2014, "text": "We can test out ideas."}, {"time": 2015, "text": "We can't test them in the laboratory."}, {"time": 2017, "text": "They're 19 orders of magnitude too small are things that we're interested in, but we can test them out mathematically and analyze their internal consistency."}, {"time": 2027, "text": "By now, 40 years ago, 35 years ago, and so forth, people very, very much questioned the consistency between gravity and quantum mechanics."}, {"time": 2039, "text": "Stephen Hawking was very famous for it, rightly so."}, {"time": 2042, "text": "Now, nobody questions that consistency anymore."}, {"time": 2045, "text": "They don't because we have mathematically precise string theories which contain both gravity and quantum mechanics in a consistent way."}, {"time": 2055, "text": "So it's provided that certainty that quantum mechanics and gravity can coexist."}, {"time": 2062, "text": "That's not a small thing."}, {"time": 2064, "text": "It's a very big thing."}, {"time": 2065, "text": "It's a huge thing."}, {"time": 2065, "text": "Einstein would be proud."}, {"time": 2067, "text": "Einstein, he might be appalled."}, {"time": 2069, "text": "He didn't like it."}, {"time": 2071, "text": "He might not be appalled, I don't know."}, {"time": 2072, "text": "He didn't like quantum mechanics very much, but he would certainly be struck by it."}, {"time": 2077, "text": "I think that may be, at this time, its biggest contribution to physics in illustrating almost definitively that quantum mechanics and gravity are very closely related and not inconsistent with each other."}, {"time": 2091, "text": "Is there a possibility of something deeper, more profound that still is consistent with string theory but is deeper, that is to be found?"}, {"time": 2103, "text": "Well, you could ask the same thing about quantum mechanics."}, {"time": 2104, "text": "Is there something?"}, {"time": 2107, "text": "I think string theory is just an example of a quantum mechanical system that contains both gravitation and quantum mechanics."}, {"time": 2116, "text": "So is there something underlying quantum mechanics?"}, {"time": 2119, "text": "Perhaps something deterministic."}, {"time": 2123, "text": "My friend, Ferad Etouf, whose name you may know, he's a very famous physicist."}, {"time": 2129, "text": "Dutch, not as famous as he should be, but... Hard to spell his name."}, {"time": 2135, "text": "It's hard to say his name."}, {"time": 2136, "text": "No, it's easy to spell his name."}, {"time": 2137, "text": "Apostrophe, he's the only person I know whose name begins with an apostrophe."}, {"time": 2142, "text": "And he's one of my heroes in physics."}, {"time": 2144, "text": "He's a little younger than me, but he's nevertheless one of my heroes."}, {"time": 2147, "text": "Etouf believes that there is some substructure to the world which is classical in character, deterministic in character, which somehow by some mechanism that he has a hard time spelling out emerges as quantum mechanics."}, {"time": 2168, "text": "The wave function is somehow emergent."}, {"time": 2170, "text": "The wave function, not just the wave function, but the whole thing that goes with quantum mechanics, uncertainty, entanglement, all these things, are emergent."}, {"time": 2179, "text": "So you think quantum mechanics is the bottom of the well?"}, {"time": 2183, "text": "Is the..."}, {"time": 2185, "text": "Here I think is where you have to be humble."}, {"time": 2190, "text": "Here's where humility comes."}, {"time": 2191, "text": "I don't think anybody should say anything is the bottom of the well at this time."}, {"time": 2196, "text": "I think we can reasonably say, I can reasonably say when I look into the well, I can't see past quantum mechanics."}, {"time": 2207, "text": "I can't see past quantum mechanics."}, {"time": 2210, "text": "I don't see any reason for there to be anything beyond quantum mechanics."}, {"time": 2215, "text": "I think Etouf has asked very interesting and deep questions."}, {"time": 2219, "text": "I don't like his answers."}, {"time": 2221, "text": "Well, again, let me ask, if we look at the deepest nature of reality with whether it's deterministic or when observed as probabilistic, what does that mean for our human level of ideas of free will?"}, {"time": 2238, "text": "Is there any connection whatsoever from this perception, perhaps illusion of free will that we have and the fundamental nature of reality?"}, {"time": 2247, "text": "The only thing I can say is I am puzzled by that as much as you are."}, {"time": 2252, "text": "The illusion of it."}, {"time": 2253, "text": "The illusion of consciousness, the illusion of free will, the illusion of self."}, {"time": 2259, "text": "Does that connect to?"}, {"time": 2263, "text": "How can a physical system do that?"}, {"time": 2265, "text": "And I am as puzzled as anybody."}, {"time": 2268, "text": "There's echoes of it in the observer effect."}, {"time": 2271, "text": "So do you understand what it means to be an observer?"}, {"time": 2275, "text": "I understand it at a technical level."}, {"time": 2277, "text": "An observer is a system with enough degrees of freedom that it can record information and which can become entangled with the thing that it's measuring."}, {"time": 2285, "text": "Entanglement is the key."}, {"time": 2287, "text": "When a system which we call an apparatus or an observer, same thing, interacts with the system that it's observing, it doesn't just look at it."}, {"time": 2299, "text": "It becomes physically entangled with it."}, {"time": 2301, "text": "And it's that entanglement which we call an observation or a measurement."}, {"time": 2306, "text": "Now, does that satisfy me personally as an observer?"}, {"time": 2312, "text": "Yes and no."}, {"time": 2313, "text": "I find it very satisfying that we have a mathematical representation of what it means to observe a system."}, {"time": 2320, "text": "You are observing stuff right now, the conscious level."}, {"time": 2324, "text": "Do you think there's echoes of that kind of entanglement in our macro scale?"}, {"time": 2329, "text": "Yes, absolutely, for sure."}, {"time": 2332, "text": "We're entangled with, quantum mechanically entangled with everything in this room."}, {"time": 2336, "text": "If we weren't, then it would just, well, we wouldn't be observing it."}, {"time": 2343, "text": "But on the other hand, you can ask, do I really, am I really comfortable with it?"}, {"time": 2350, "text": "And I'm uncomfortable with it in the same way that I can never get comfortable with five dimensions."}, {"time": 2355, "text": "My brain isn't wired for it."}, {"time": 2358, "text": "Are you comfortable with four dimensions?"}, {"time": 2361, "text": "A little bit more, because I can always imagine the fourth dimension is time."}, {"time": 2366, "text": "So the arrow of time, are you comfortable with that arrow?"}, {"time": 2369, "text": "Do you think time is an emergent phenomena or is it fundamental to nature?"}, {"time": 2373, "text": "That is a big question in physics right now."}, {"time": 2377, "text": "All the physics that we do, or at least that the people that I am comfortable with talking to, my friends, my friends."}, {"time": 2389, "text": "No, we all ask the same question that you just asked."}, {"time": 2391, "text": "Space, we have a pretty good idea is emergent and it emerges out of entanglement and other things."}, {"time": 2400, "text": "Time always seems to be built into our equations as just what Newton pretty much would have thought."}, {"time": 2406, "text": "Newton, modified a little bit by Einstein, would have called time."}, {"time": 2412, "text": "And mostly in our equations, it is not emergent."}, {"time": 2419, "text": "Time in physics is completely symmetric, forward and backward."}, {"time": 2422, "text": "Right, it's symmetric."}, {"time": 2423, "text": "So you don't really need to think about the arrow of time for most physical phenomena."}, {"time": 2429, "text": "For most microscopic phenomena, no."}, {"time": 2433, "text": "It's only when the phenomena involve systems which are big enough for thermodynamics to become important, for entropy to become important."}, {"time": 2441, "text": "For a small system, entropy is not a good concept."}, {"time": 2447, "text": "Entropy is something which emerges out of large numbers."}, {"time": 2452, "text": "It's a probabilistic idea or it's a statistical idea and it's a thermodynamic idea."}, {"time": 2458, "text": "Thermodynamics requires lots and lots and lots of little substructures, okay?"}, {"time": 2464, "text": "So it's not until you emerge at the thermodynamic level that there's an arrow of time."}, {"time": 2471, "text": "Do we understand it?"}, {"time": 2473, "text": "Yeah, I think we understand better than most people think they have."}, {"time": 2477, "text": "Most people say they think we understand it."}, {"time": 2479, "text": "Yeah, I think we understand it."}, {"time": 2481, "text": "It's a statistical idea."}, {"time": 2483, "text": "You mean like second law of thermodynamics, entropy and so on?"}, {"time": 2487, "text": "Yeah, take a pack of cards and you fling it in the air and you look what happens to it, it gets random."}, {"time": 2492, "text": "We understand it."}, {"time": 2493, "text": "It doesn't go from random to simple."}, {"time": 2496, "text": "It goes from simple to random."}, {"time": 2498, "text": "But do you think it ever breaks down?"}, {"time": 2501, "text": "What I think you can do is in a laboratory setting, you can take a system which is somewhere intermediate between being small and being large and make it go backward."}, {"time": 2516, "text": "A thing which looks like it only wants to go forward because of statistical mechanical reasons, because of the second law, you can very, very carefully manipulate it to make it run backward."}, {"time": 2529, "text": "I don't think you can take an egg, a Humpty Dumpty who fell on the floor and reverse that."}, {"time": 2535, "text": "But you can, in a very controlled situation, you can take systems which appear to be evolving statistically toward randomness, stop them, reverse them, and make them go back."}, {"time": 2549, "text": "What's the intuition behind that?"}, {"time": 2551, "text": "How do we reverse it?"}, {"time": 2553, "text": "You're saying a closed system."}, {"time": 2555, "text": "Yeah, pretty much closed system, yes."}, {"time": 2558, "text": "Did you just say that time travel is possible?"}, {"time": 2561, "text": "No, I didn't say time travel is possible."}, {"time": 2564, "text": "I said you can make a system go backward."}, {"time": 2565, "text": "In time."}, {"time": 2566, "text": "You can make it go back."}, {"time": 2568, "text": "You can make it reverse its steps."}, {"time": 2569, "text": "You can make it reverse its trajectory."}, {"time": 2573, "text": "What's the intuition there?"}, {"time": 2574, "text": "Does it have, is it just a fluke thing that we can do at a small scale in the lab that doesn't have?"}, {"time": 2581, "text": "Well, what I'm saying is you can do it a little bit better than a small scale."}, {"time": 2585, "text": "You can certainly do it with a simple, small system."}, {"time": 2590, "text": "Small systems don't have any sense of the arrow of time."}, {"time": 2594, "text": "Atoms, atoms are no sense of an arrow of time."}, {"time": 2600, "text": "They're completely reversible."}, {"time": 2602, "text": "It's only when you have, you know, the second law of thermodynamics is the law of large numbers."}, {"time": 2608, "text": "So you can break the law because it's not a deterministic law."}, {"time": 2610, "text": "You can break it, you can break it, but it's hard."}, {"time": 2613, "text": "It requires great care."}, {"time": 2616, "text": "The bigger the system is, the more care, the more, the harder it is."}, {"time": 2620, "text": "You have to overcome what's called chaos."}, {"time": 2623, "text": "And that's hard."}, {"time": 2625, "text": "And it requires more and more precision."}, {"time": 2627, "text": "For 10 particles, you might be able to do it with some effort."}, {"time": 2634, "text": "For a hundred particles, it's really hard."}, {"time": 2636, "text": "For a thousand or a million particles, forget it, but not for any fundamental reason, just because it's technologically too hard to make the system go backward."}, {"time": 2648, "text": "So, no time travel for engineering reasons."}, {"time": 2653, "text": "Oh, no, no, no, no."}, {"time": 2655, "text": "What is time travel?"}, {"time": 2656, "text": "Time travel to the future?"}, {"time": 2660, "text": "You just close your eyes, go to sleep, and you wake up in the future."}, {"time": 2663, "text": "Yeah, yeah, a good nap gets you there, yeah."}, {"time": 2665, "text": "A good nap gets you there, right."}, {"time": 2667, "text": "But reversing the second law of thermodynamics, going backward in time for anything that's human scale is a very difficult engineering effort."}, {"time": 2680, "text": "I wouldn't call that time travel because it gets too mixed up with what science fiction calls time travel."}, {"time": 2686, "text": "This is just the ability to reverse a system."}, {"time": 2691, "text": "You take the system and you reverse the direction of motion of every molecule in it."}, {"time": 2698, "text": "That, you can do it with one molecule."}, {"time": 2700, "text": "If you find a particle moving in a certain direction, let's not say a particle, a baseball, you stop it dead and then you simply reverse its motion."}, {"time": 2710, "text": "In principle, that's not too hard."}, {"time": 2712, "text": "And it'll go back along its trajectory in the backward direction."}, {"time": 2716, "text": "Just running the program backwards."}, {"time": 2718, "text": "Running the program backward."}, {"time": 2720, "text": "If you have two baseballs colliding, well, you can do it, but you have to be very, very careful to get it just right."}, {"time": 2728, "text": "If you have 10 baseballs, really, really, better yet, 10 billiard balls on an idealized, frictionless billiard table."}, {"time": 2738, "text": "Okay, so you start the balls all on a triangle, right?"}, {"time": 2741, "text": "And you whack them."}, {"time": 2743, "text": "Depending on the game you're playing, you either whack them or you're really careful, but you whack them."}, {"time": 2748, "text": "And they go flying off in all possible directions."}, {"time": 2751, "text": "Okay, try to reverse that."}, {"time": 2754, "text": "Try to reverse that."}, {"time": 2755, "text": "Imagine trying to take every billiard ball, stopping it dead at some point, and reversing its motion so that it was going in the opposite direction."}, {"time": 2764, "text": "If you did that with tremendous care, it would reassemble itself back into the triangle."}, {"time": 2771, "text": "Okay, that is a fact."}, {"time": 2774, "text": "And you can probably do it with two billiard balls, maybe with three billiard balls if you're really lucky."}, {"time": 2779, "text": "But what happens is as the system gets more and more complicated, you have to be more and more precise not to make the tiniest error, because the tiniest errors will get magnified and you'll simply not be able to do the reversal."}, {"time": 2794, "text": "So yeah, but I wouldn't call that time travel."}, {"time": 2798, "text": "Yeah, that's something else."}, {"time": 2799, "text": "But if you think of it, it just made me think, if you think the unrolling of state that's happening as a program, if we look at the world, silly idea of looking at the world as a simulation, as a computer."}, {"time": 2819, "text": "But it's not a computer, it's just a single program."}, {"time": 2823, "text": "A question arises that might be useful."}, {"time": 2826, "text": "How hard is it to have a computer that runs the universe?"}, {"time": 2831, "text": "Okay, so there are mathematical universes that we know about."}, {"time": 2840, "text": "One of them is called anti de Sitter space, where we, and it's quantum mechanics, I think we could simulate it in a computer, in a quantum computer."}, {"time": 2854, "text": "Classical computer, all you can do is solve its equations."}, {"time": 2856, "text": "You can't make it work like the real system."}, {"time": 2859, "text": "If we could build a quantum computer, a big enough one, a robust enough one, we could probably simulate a universe, a small version of an anti de Sitter universe."}, {"time": 2872, "text": "Anti de Sitter is a kind of cosmology."}, {"time": 2877, "text": "So I think we know how to do that."}, {"time": 2880, "text": "The trouble is the universe that we live in is not the anti de Sitter geometry, it's the de Sitter geometry."}, {"time": 2887, "text": "And we don't really understand its quantum mechanics at all."}, {"time": 2891, "text": "So at the present time, I would say we wouldn't have the vaguest idea how to simulate a universe similar to our own."}, {"time": 2898, "text": "No, we can ask, could we build in the laboratory a small version, a quantum mechanical version, the collection of quantum computers and tangled and coupled together, which would reproduce the phenomena that go on in the universe, even on a small scale."}, {"time": 2920, "text": "Yes, if it were anti de Sitter space, no, if it's de Sitter space."}, {"time": 2924, "text": "Can you slightly describe de Sitter space and anti de Sitter space?"}, {"time": 2929, "text": "What are the geometric properties of?"}, {"time": 2931, "text": "They differ by the sign of a single constant called the cosmological constant."}, {"time": 2937, "text": "One of them is negatively curved, the other is positively curved."}, {"time": 2944, "text": "Anti de Sitter space, which is the negatively curved one, you can think of as an isolated system in a box with reflecting walls."}, {"time": 2954, "text": "You could think of it as a system of quantum mechanical system isolated in an isolated environment."}, {"time": 2961, "text": "De Sitter space is the one we really live in."}, {"time": 2963, "text": "And that's the one that's exponentially expanding, exponential expansion, dark energy, whatever we wanna call it."}, {"time": 2971, "text": "And we don't understand that mathematically."}, {"time": 2975, "text": "Do we understand?"}, {"time": 2976, "text": "Not everybody would agree with me, but I don't understand."}, {"time": 2979, "text": "They would agree with me, they definitely would agree with me that I don't understand it."}, {"time": 2984, "text": "What about, is there an understanding of the birth, the origin, the big bang?"}, {"time": 2990, "text": "So there's one problem with the other."}, {"time": 2991, "text": "No, no, there's theories."}, {"time": 2993, "text": "There are theories."}, {"time": 2995, "text": "My favorite is the one called eternal inflation."}, {"time": 2998, "text": "The infinity can be on both sides, on one of the sides and none of the sides."}, {"time": 3002, "text": "So what's eternal infinity?"}, {"time": 3009, "text": "Infinity on both sides."}, {"time": 3013, "text": "Yeah, yeah, that's."}, {"time": 3015, "text": "Why is that your favorite?"}, {"time": 3016, "text": "Because it's the most just mind blowing?"}, {"time": 3022, "text": "Because we want a beginning."}, {"time": 3023, "text": "No, why do we want a beginning?"}, {"time": 3026, "text": "In practice there was a beginning, of course."}, {"time": 3028, "text": "In practice there was a beginning."}, {"time": 3031, "text": "But could it have been a random fluctuation in an otherwise infinite time?"}, {"time": 3041, "text": "In any case, the eternal inflation theory, I think if correctly understood, would be infinite in both directions."}, {"time": 3050, "text": "How do you think about infinity?"}, {"time": 3053, "text": "So, okay, of course you can think about it mathematically."}, {"time": 3057, "text": "I just finished this discussion with my friend Sergei Brin."}, {"time": 3062, "text": "I say, well, Sergei Brin is infinitely rich."}, {"time": 3067, "text": "How do you test that hypothesis?"}, {"time": 3072, "text": "Such a good line."}, {"time": 3075, "text": "Yeah, so there's really no way to visualize some of these things."}, {"time": 3080, "text": "Yeah, no, this is a very good question."}, {"time": 3082, "text": "Does physics have any, does infinity have any place in physics?"}, {"time": 3088, "text": "Right, and all I can say is very good question."}, {"time": 3095, "text": "So what do you think of the recent first image of a black hole visualized from the Horizon Telescope?"}, {"time": 3103, "text": "It's an incredible triumph of science."}, {"time": 3105, "text": "In itself, the fact that there are black holes which collide is not a surprise."}, {"time": 3110, "text": "And they seem to work exactly the way they're supposed to work."}, {"time": 3114, "text": "Will we learn a great deal from it?"}, {"time": 3117, "text": "I don't know, we might."}, {"time": 3120, "text": "But the kind of things we'll learn won't really be about black holes."}, {"time": 3125, "text": "Why there are black holes in nature of that particular mass scale and why they're so common may tell us something about the structure, evolution of structure in the universe."}, {"time": 3138, "text": "But I don't think it's gonna tell us anything new about black holes."}, {"time": 3142, "text": "But it's a triumph in the sense that you go back 100 years and it was a continuous development, general relativity, the discovery of black holes, LIGO, the incredible technology that went into LIGO."}, {"time": 3157, "text": "It is something that I never would have believed was gonna happen 30, 40 years ago."}, {"time": 3167, "text": "And I think it's a magnificent structure, magnificent thing, this evolution of general relativity, LIGO, high precision, ability to measure things on a scale of 10 to the minus 21."}, {"time": 3187, "text": "So, astonishing."}, {"time": 3189, "text": "So you're just in awe that this path took us to this picture."}, {"time": 3194, "text": "Is it different?"}, {"time": 3197, "text": "You've thought a lot about black holes."}, {"time": 3199, "text": "How did you visualize them in your mind?"}, {"time": 3203, "text": "And is the picture different than you've visualized it?"}, {"time": 3206, "text": "No, it's simply confirmed."}, {"time": 3210, "text": "It's a magnificent triumph to have confirmed a direct observation that Einstein's theory of gravity at the level of black hole collisions actually works is awesome, it is really awesome."}]}]