[{"title": "Melanie Mitchell: Concepts, Analogies, Common Sense & Future of AI | Lex Fridman Podcast #61", "id": "ImKkaeUx1MU", "quotes": [{"time": 390, "text": "At a high level, if you look at the founding of the field of McCarthy and Searle and so on, are we closer to having a better sense of that line between narrow, weak AI and strong AI?"}, {"time": 410, "text": "Yes, I think we're closer to having a better idea of what that line is."}, {"time": 418, "text": "Early on, for example, a lot of people thought that playing chess would be, you couldn't play chess if you didn't have sort of general human level intelligence."}, {"time": 431, "text": "And of course, once computers were able to play chess better than humans, that revised that view."}, {"time": 438, "text": "And people said, okay, well, maybe now we have to revise what we think of intelligence as."}, {"time": 445, "text": "And so that's kind of been a theme throughout the history of the field is that once a machine can do some task, we then have to look back and say, oh, well, that changes my understanding of what intelligence is because I don't think that machine is intelligent, at least that's not what I wanna call intelligence."}, {"time": 465, "text": "So do you think that line moves forever or will we eventually really feel as a civilization like we've crossed the line if it's possible?"}, {"time": 474, "text": "It's hard to predict, but I don't see any reason why we couldn't in principle create something that we would consider intelligent."}, {"time": 483, "text": "I don't know how we will know for sure."}, {"time": 487, "text": "Maybe our own view of what intelligence is will be refined more and more until we finally figure out what we mean when we talk about it."}, {"time": 497, "text": "But I think eventually we will create machines in a sense that have intelligence."}, {"time": 504, "text": "They may not be the kinds of machines we have now."}, {"time": 508, "text": "And one of the things that that's going to produce is making us sort of understand our own machine like qualities that we in a sense are mechanical in the sense that like cells, cells are kind of mechanical."}, {"time": 527, "text": "They have algorithms, they process information by and somehow out of this mass of cells, we get this emergent property that we call intelligence."}, {"time": 541, "text": "But underlying it is really just cellular processing and lots and lots and lots of it."}, {"time": 550, "text": "Do you think we'll be able to, do you think it's possible to create intelligence without understanding our own mind?"}, {"time": 556, "text": "You said sort of in that process we'll understand more and more, but do you think it's possible to sort of create without really fully understanding from a mechanistic perspective, sort of from a functional perspective how our mysterious mind works?"}, {"time": 572, "text": "If I had to bet on it, I would say, no, we do have to understand our own minds at least to some significant extent."}, {"time": 582, "text": "But I think that's a really big open question."}, {"time": 587, "text": "I've been very surprised at how far kind of brute force approaches based on say big data and huge networks can take us."}, {"time": 597, "text": "I wouldn't have expected that."}, {"time": 599, "text": "And they have nothing to do with the way our minds work."}, {"time": 603, "text": "So that's been surprising to me, so it could be wrong."}, {"time": 606, "text": "To explore the psychological and the philosophical, do you think we're okay as a species with something that's more intelligent than us?"}, {"time": 616, "text": "Do you think perhaps the reason we're pushing that line further and further is we're afraid of acknowledging that there's something stronger, better, smarter than us humans?"}, {"time": 629, "text": "Well, I'm not sure we can define intelligence that way because smarter than is with respect to what, computers are already smarter than us in some areas."}, {"time": 642, "text": "They can multiply much better than we can."}, {"time": 645, "text": "They can figure out driving routes to take much faster and better than we can."}, {"time": 651, "text": "They have a lot more information to draw on."}, {"time": 654, "text": "They know about traffic conditions and all that stuff."}, {"time": 657, "text": "So for any given particular task, sometimes computers are much better than we are and we're totally happy with that, right?"}, {"time": 667, "text": "I'm totally happy with that."}, {"time": 668, "text": "It doesn't bother me at all."}, {"time": 670, "text": "I guess the question is which things about our intelligence would we feel very sad or upset that machines had been able to recreate?"}, {"time": 684, "text": "So in the book, I talk about my former PhD advisor, Douglas Hofstadter, who encountered a music generation program."}, {"time": 692, "text": "And that was really the line for him, that if a machine could create beautiful music, that would be terrifying for him because that is something he feels is really at the core of what it is to be human, creating beautiful music, art, literature."}, {"time": 716, "text": "He doesn't like the fact that machines can recognize spoken language really well."}, {"time": 725, "text": "He personally doesn't like using speech recognition, but I don't think it bothers him to his core because it's like, okay, that's not at the core of humanity."}, {"time": 735, "text": "But it may be different for every person what really they feel would usurp their humanity."}, {"time": 745, "text": "And I think maybe it's a generational thing also."}, {"time": 747, "text": "Maybe our children or our children's children will be adapted, they'll adapt to these new devices that can do all these tasks and say, yes, this thing is smarter than me in all these areas, but that's great because it helps me."}, {"time": 766, "text": "Looking at the broad history of our species, why do you think so many humans have dreamed of creating artificial life and artificial intelligence throughout the history of our civilization?"}, {"time": 777, "text": "So not just this century or the 20th century, but really throughout many centuries that preceded it?"}, {"time": 786, "text": "That's a really good question, and I have wondered about that."}, {"time": 789, "text": "Because I myself was driven by curiosity about my own thought processes and thought it would be fantastic to be able to get a computer to mimic some of my thought processes."}, {"time": 806, "text": "I'm not sure why we're so driven."}, {"time": 808, "text": "I think we want to understand ourselves better and we also want machines to do things for us."}, {"time": 820, "text": "But I don't know, there's something more to it because it's so deep in the kind of mythology or the ethos of our species."}, {"time": 829, "text": "And I don't think other species have this drive."}, {"time": 832, "text": "So I don't know."}, {"time": 833, "text": "If you were to sort of psychoanalyze yourself in your own interest in AI, are you, what excites you about creating intelligence?"}, {"time": 847, "text": "You said understanding our own selves?"}, {"time": 849, "text": "Yeah, I think that's what drives me particularly."}, {"time": 853, "text": "I'm really interested in human intelligence, but I'm also interested in the sort of the phenomenon of intelligence more generally."}, {"time": 868, "text": "And I don't think humans are the only thing with intelligence, or even animals."}, {"time": 874, "text": "But I think intelligence is a concept that encompasses a lot of complex systems."}, {"time": 883, "text": "And if you think of things like insect colonies or cellular processes or the immune system or all kinds of different biological or even societal processes have as an emergent property some aspects of what we would call intelligence."}, {"time": 902, "text": "They have memory, they process information, they have goals, they accomplish their goals, et cetera."}, {"time": 908, "text": "And to me, the question of what is this thing we're talking about here was really fascinating to me."}, {"time": 917, "text": "And exploring it using computers seem to be a good way to approach the question."}, {"time": 923, "text": "So do you think kind of of intelligence, do you think of our universe as a kind of hierarchy of complex systems?"}, {"time": 930, "text": "And then intelligence is just the property of any, you can look at any level and every level has some aspect of intelligence."}, {"time": 939, "text": "So we're just like one little speck in that giant hierarchy of complex systems."}, {"time": 944, "text": "I don't know if I would say any system like that has intelligence, but I guess what I wanna, I don't have a good enough definition of intelligence to say that."}, {"time": 956, "text": "So let me do sort of a multiple choice, I guess."}, {"time": 959, "text": "So you said ant colonies."}, {"time": 962, "text": "So are ant colonies intelligent?"}, {"time": 964, "text": "Are the bacteria in our body intelligent?"}, {"time": 969, "text": "And then going to the physics world molecules and the behavior at the quantum level of electrons and so on, are those kinds of systems, do they possess intelligence?"}, {"time": 982, "text": "Like where's the line that feels compelling to you?"}, {"time": 988, "text": "I mean, I think intelligence is a continuum."}, {"time": 990, "text": "And I think that the ability to, in some sense, have intention, have a goal, have some kind of self awareness is part of it."}, {"time": 1005, "text": "So I'm not sure if, you know, it's hard to know where to draw that line."}, {"time": 1010, "text": "I think that's kind of a mystery."}, {"time": 1012, "text": "But I wouldn't say that the planets orbiting the sun is an intelligent system."}, {"time": 1021, "text": "I mean, I would find that maybe not the right term to describe that."}, {"time": 1026, "text": "And there's all this debate in the field of like what's the right way to define intelligence?"}, {"time": 1032, "text": "What's the right way to model intelligence?"}, {"time": 1035, "text": "Should we think about computation?"}, {"time": 1036, "text": "Should we think about dynamics?"}, {"time": 1038, "text": "And should we think about free energy and all of that stuff?"}, {"time": 1043, "text": "And I think that it's a fantastic time to be in the field because there's so many questions and so much we don't understand."}, {"time": 1052, "text": "There's so much work to do."}, {"time": 1053, "text": "So are we the most special kind of intelligence in this kind of, you said there's a bunch of different elements and characteristics of intelligence systems and colonies."}, {"time": 1067, "text": "Is human intelligence the thing in our brain?"}, {"time": 1073, "text": "Is that the most interesting kind of intelligence in this continuum?"}, {"time": 1077, "text": "Well, it's interesting to us because it is us."}, {"time": 1081, "text": "I mean, interesting to me, yes."}, {"time": 1083, "text": "And because I'm part of, you know, human."}, {"time": 1086, "text": "But to understanding the fundamentals of intelligence, what I'm getting at, is studying the human, is sort of, if everything we've talked about, what you talk about in your book, what just the AI field, this notion, yes, it's hard to define, but it's usually talking about something that's very akin to human intelligence."}, {"time": 1104, "text": "Yeah, to me it is the most interesting because it's the most complex, I think."}, {"time": 1109, "text": "It's the most self aware."}, {"time": 1112, "text": "It's the only system, at least that I know of, that reflects on its own intelligence."}, {"time": 1118, "text": "And you talk about the history of AI and us, in terms of creating artificial intelligence, being terrible at predicting the future with AI, with tech in general."}, {"time": 1130, "text": "So why do you think we're so bad at predicting the future?"}, {"time": 1136, "text": "Are we hopelessly bad?"}, {"time": 1139, "text": "So no matter what, whether it's this decade or the next few decades, every time we make a prediction, there's just no way of doing it well, or as the field matures, we'll be better and better at it."}, {"time": 1150, "text": "I believe as the field matures, we will be better."}, {"time": 1153, "text": "And I think the reason that we've had so much trouble is that we have so little understanding of our own intelligence."}, {"time": 1160, "text": "So there's the famous story about Marvin Minsky assigning computer vision as a summer project to his undergrad students."}, {"time": 1174, "text": "And I believe that's actually a true story."}, {"time": 1176, "text": "Yeah, no, there's a write up on it."}, {"time": 1179, "text": "Everyone should read."}, {"time": 1180, "text": "It's like a, I think it's like a proposal that describes everything that should be done in that project."}, {"time": 1186, "text": "It's hilarious because it, I mean, you could explain it, but from my recollection, it describes basically all the fundamental problems of computer vision, many of which still haven't been solved."}, {"time": 1197, "text": "Yeah, and I don't know how far they really expect it to get."}, {"time": 1201, "text": "But I think that, and they're really, Marvin Minsky is a super smart guy and very sophisticated thinker."}, {"time": 1208, "text": "But I think that no one really understands or understood, still doesn't understand how complicated, how complex the things that we do are because they're so invisible to us."}, {"time": 1224, "text": "To us, vision, being able to look out at the world and describe what we see, that's just immediate."}, {"time": 1231, "text": "It feels like it's no work at all."}, {"time": 1233, "text": "So it didn't seem like it would be that hard, but there's so much going on unconsciously, sort of invisible to us that I think we overestimate how easy it will be to get computers to do it."}, {"time": 1250, "text": "And sort of for me to ask an unfair question, you've done research, you've thought about many different branches of AI through this book, widespread looking at where AI has been, where it is today."}, {"time": 1266, "text": "If you were to make a prediction, how many years from now would we as a society create something that you would say achieved human level intelligence or superhuman level intelligence?"}, {"time": 1283, "text": "That is an unfair question."}, {"time": 1285, "text": "A prediction that will most likely be wrong."}, {"time": 1288, "text": "But it's just your notion because."}, {"time": 1290, "text": "Okay, I'll say more than 100 years."}, {"time": 1294, "text": "More than 100 years."}, {"time": 1295, "text": "And I quoted somebody in my book who said that human level intelligence is 100 Nobel Prizes away, which I like because it's a nice way to sort of, it's a nice unit for prediction."}, {"time": 1311, "text": "And it's like that many fantastic discoveries have to be made."}, {"time": 1316, "text": "And of course there's no Nobel Prize in AI, not yet at least."}, {"time": 1357, "text": "That would be my guess."}, {"time": 1362, "text": "I think that in the sort of going along in the narrow AI that the current approaches will get better."}, {"time": 1374, "text": "I think there's some fundamental limits to how far they're gonna get."}, {"time": 1379, "text": "I might be wrong, but that's what I think."}, {"time": 1381, "text": "And there's some fundamental weaknesses that they have that I talk about in the book that just comes from this approach of supervised learning requiring sort of feed forward networks and so on."}, {"time": 1407, "text": "It's just, I don't think it's a sustainable approach to understanding the world."}, {"time": 1414, "text": "Yeah, I'm personally torn on it."}, {"time": 1416, "text": "Sort of everything you read about in the book and sort of what we're talking about now, I agree with you, but I'm more and more, depending on the day, first of all, I'm deeply surprised by the success of machine learning and deep learning in general."}, {"time": 1432, "text": "From the very beginning, when I was, it's really been my main focus of work."}, {"time": 1437, "text": "I'm just surprised how far it gets."}, {"time": 1439, "text": "And I'm also think we're really early on in these efforts of these narrow AI."}, {"time": 1447, "text": "So I think there'll be a lot of surprise of how far it gets."}, {"time": 1451, "text": "I think we'll be extremely impressed."}, {"time": 1454, "text": "Like my sense is everything I've seen so far, and we'll talk about autonomous driving and so on, I think we can get really far."}, {"time": 1461, "text": "But I also have a sense that we will discover, just like you said, is that even though we'll get really far in order to create something like our own intelligence, it's actually much farther than we realize."}, {"time": 1474, "text": "I think these methods are a lot more powerful than people give them credit for actually."}, {"time": 1479, "text": "So that of course there's the media hype, but I think there's a lot of researchers in the community, especially like not undergrads, right?"}, {"time": 1486, "text": "But like people who've been in AI, they're skeptical about how far deep learning can get."}, {"time": 1490, "text": "And I'm more and more thinking that it can actually get farther than they'll realize."}, {"time": 1496, "text": "It's certainly possible."}, {"time": 1498, "text": "One thing that surprised me when I was writing the book is how far apart different people in the field are on their opinion of how far the field has come and what is accomplished and what's gonna happen next."}, {"time": 1511, "text": "What's your sense of the different, who are the different people, groups, mindsets, thoughts in the community about where AI is today?"}, {"time": 1522, "text": "Yeah, they're all over the place."}, {"time": 1524, "text": "So there's kind of the singularity transhumanism group."}, {"time": 1530, "text": "I don't know exactly how to characterize that approach, which is sort of the sort of exponential, exponential progress where we're on the sort of almost at the hugely accelerating part of the exponential."}, {"time": 1545, "text": "And in the next 30 years, we're going to see super intelligent AI and all that, and we'll be able to upload our brains and that."}, {"time": 1557, "text": "So there's that kind of extreme view that most, I think most people who work in AI don't have."}, {"time": 1564, "text": "They disagree with that."}, {"time": 1566, "text": "But there are people who are, maybe aren't singularity people, but they do think that the current approach of deep learning is going to scale and is going to kind of go all the way basically and take us to true AI or human level AI or whatever you wanna call it."}, {"time": 1589, "text": "And there's quite a few of them."}, {"time": 1590, "text": "And a lot of them, like a lot of the people I've met who work at big tech companies in AI groups kind of have this view that we're really not that far."}, {"time": 1606, "text": "Just to linger on that point, sort of if I can take as an example, like Yann LeCun, I don't know if you know about his work and so his viewpoints on this."}, {"time": 1615, "text": "He believes that there's a bunch of breakthroughs, like fundamental, like Nobel prizes that are needed still."}, {"time": 1621, "text": "But I think he thinks those breakthroughs will be built on top of deep learning."}, {"time": 1626, "text": "And then there's some people who think we need to kind of put deep learning to the side a little bit as just one module that's helpful in the bigger cognitive framework."}, {"time": 1637, "text": "Right, so I think somewhat I understand Yann LeCun is rightly saying supervised learning is not sustainable."}, {"time": 1647, "text": "We have to figure out how to do unsupervised learning, that that's gonna be the key."}, {"time": 1654, "text": "And I think that's probably true."}, {"time": 1659, "text": "I think unsupervised learning is gonna be harder than people think."}, {"time": 1663, "text": "I mean, the way that we humans do it."}, {"time": 1667, "text": "Then there's the opposing view, there's the Gary Marcus kind of hybrid view where deep learning is one part, but we need to bring back kind of these symbolic approaches and combine them."}, {"time": 1683, "text": "Of course, no one knows how to do that very well."}, {"time": 1686, "text": "Which is the more important part to emphasize and how do they fit together?"}, {"time": 1692, "text": "What's the foundation?"}, {"time": 1693, "text": "What's the thing that's on top?"}, {"time": 1695, "text": "What's the cake?"}, {"time": 1696, "text": "What's the icing?"}, {"time": 1698, "text": "Then there's people pushing different things."}, {"time": 1702, "text": "There's the people, the causality people who say, deep learning as it's formulated today completely lacks any notion of causality."}, {"time": 1712, "text": "And that's, dooms it."}, {"time": 1715, "text": "And therefore we have to somehow give it some kind of notion of causality."}, {"time": 1721, "text": "There's a lot of push from the more cognitive science crowd saying, we have to look at developmental learning."}, {"time": 1734, "text": "We have to look at how babies learn."}, {"time": 1736, "text": "We have to look at intuitive physics, all these things we know about physics."}, {"time": 1743, "text": "And as somebody kind of quipped, we also have to teach machines intuitive metaphysics, which means like objects exist."}, {"time": 1754, "text": "Causality exists."}, {"time": 1757, "text": "These things that maybe we're born with."}, {"time": 1759, "text": "I don't know that they don't have the, machines don't have any of that."}, {"time": 1763, "text": "They look at a group of pixels and maybe they get 10 million examples, but they can't necessarily learn that there are objects in the world."}, {"time": 1778, "text": "So there's just a lot of pieces of the puzzle that people are promoting and with different opinions of like how important they are and how close we are to being able to put them all together to create general intelligence."}, {"time": 1794, "text": "Looking at this broad field, what do you take away from it?"}, {"time": 1797, "text": "Who is the most impressive?"}, {"time": 1799, "text": "Is it the cognitive folks, the Gary Marcus camp, the on camp, unsupervised and their self supervised."}, {"time": 1807, "text": "There's the supervisors and then there's the engineers who are actually building systems."}, {"time": 1811, "text": "You have sort of the Andrej Karpathy at Tesla building actual, it's not philosophy, it's real like systems that operate in the real world."}, {"time": 1821, "text": "What do you take away from all this beautiful variety?"}, {"time": 1823, "text": "I don't know if, these different views are not necessarily mutually exclusive."}, {"time": 1829, "text": "And I think people like Yann LeCun agrees with the developmental psychology of causality, intuitive physics, et cetera."}, {"time": 1843, "text": "But he still thinks that it's learning, like end to end learning is the way to go."}, {"time": 1848, "text": "Will take us perhaps all the way."}, {"time": 1850, "text": "Yeah, and that we don't need, there's no sort of innate stuff that has to get built in."}, {"time": 1856, "text": "This is, it's because it's a hard problem."}, {"time": 1862, "text": "I personally, I'm very sympathetic to the cognitive science side, cause that's kind of where I came in to the field."}, {"time": 1870, "text": "I've become more and more sort of an embodiment adherent saying that without having a body, it's gonna be very hard to learn what we need to learn about the world."}, {"time": 1884, "text": "That's definitely something I'd love to talk about in a little bit."}, {"time": 1888, "text": "To step into the cognitive world, then if you don't mind, cause you've done so many interesting things."}, {"time": 1894, "text": "If you look to copycat, taking a couple of decades step back, you, Douglas Hofstadter and others have created and developed copycat more than 30 years ago."}, {"time": 1908, "text": "That's painful to hear."}, {"time": 1910, "text": "So what is it?"}, {"time": 1911, "text": "What is copycat?"}, {"time": 1914, "text": "It's a program that makes analogies in an idealized domain, idealized world of letter strings."}, {"time": 1923, "text": "So as you say, 30 years ago, wow."}, {"time": 1926, "text": "So I started working on it when I started grad school in 1984."}, {"time": 1932, "text": "Wow, dates me."}, {"time": 1937, "text": "And it's based on Doug Hofstadter's ideas about that analogy is really a core aspect of thinking."}, {"time": 1950, "text": "I remember he has a really nice quote in the book by himself and Emmanuel Sandor called Surfaces and Essences."}, {"time": 1958, "text": "I don't know if you've seen that book, but it's about analogy and he says, without concepts, there can be no thought and without analogies, there can be no concepts."}, {"time": 1971, "text": "So the view is that analogy is not just this kind of reasoning technique where we go, shoe is to foot as glove is to what, these kinds of things that we have on IQ tests or whatever, but that it's much deeper, it's much more pervasive in every thing we do, in our language, our thinking, our perception."}, {"time": 1996, "text": "So he had a view that was a very active perception idea."}, {"time": 2033, "text": "And so copycat was trying to do that, kind of simulate that kind of idea where you have these agents, it's kind of an agent based system and you have these agents that are picking things to look at and deciding whether they were interesting or not and whether they should be looked at more and that would influence other agents."}, {"time": 2055, "text": "Now, how do they interact?"}, {"time": 2057, "text": "So they interacted through this global kind of what we call the workspace."}, {"time": 2062, "text": "So it's actually inspired by the old blackboard systems where you would have agents that post information on a blackboard, a common blackboard."}, {"time": 2070, "text": "This is like very old fashioned AI."}, {"time": 2073, "text": "Is that, are we talking about like in physical space?"}, {"time": 2076, "text": "Is this a computer program?"}, {"time": 2077, "text": "It's a computer program."}, {"time": 2078, "text": "So agents posting concepts on a blackboard kind of thing?"}, {"time": 2081, "text": "Yeah, we called it a workspace."}, {"time": 2083, "text": "And the workspace is a data structure."}, {"time": 2088, "text": "The agents are little pieces of code that you could think of them as little detectors or little filters that say, I'm gonna pick this place to look and I'm gonna look for a certain thing and is this the thing I think is important, is it there?"}, {"time": 2103, "text": "So it's almost like, you know, a convolution in a way, except a little bit more general and saying, and then highlighting it in the workspace."}, {"time": 2114, "text": "Once it's in the workspace, how do the things that are highlighted relate to each other?"}, {"time": 2118, "text": "Like what's, is this?"}, {"time": 2119, "text": "So there's different kinds of agents that can build connections between different things."}, {"time": 2123, "text": "So just to give you a concrete example, what CopyCat did was it made analogies between strings of letters."}, {"time": 2131, "text": "ABC changes to ABD."}, {"time": 2135, "text": "What does IJK change to?"}, {"time": 2139, "text": "And the program had some prior knowledge about the alphabet, knew the sequence of the alphabet."}, {"time": 2145, "text": "It had a concept of letter, successor of letter."}, {"time": 2149, "text": "It had concepts of sameness."}, {"time": 2150, "text": "So it has some innate things programmed in."}, {"time": 2155, "text": "But then it could do things like say, discover that ABC is a group of letters in succession."}, {"time": 2166, "text": "And then an agent can mark that."}, {"time": 2171, "text": "So the idea that there could be a sequence of letters, is that a new concept that's formed or that's a concept that's innate?"}, {"time": 2179, "text": "That's a concept that's innate."}, {"time": 2181, "text": "Sort of, can you form new concepts or are all concepts innate?"}, {"time": 2185, "text": "So in this program, all the concepts of the program were innate."}, {"time": 2190, "text": "So, cause we weren't, I mean, obviously that limits it quite a bit."}, {"time": 2195, "text": "But what we were trying to do is say, suppose you have some innate concepts, how do you flexibly apply them to new situations?"}, {"time": 2205, "text": "And how do you make analogies?"}, {"time": 2207, "text": "Let's step back for a second."}, {"time": 2209, "text": "So I really liked that quote that you say, without concepts, there could be no thought and without analogies, there can be no concepts."}, {"time": 2216, "text": "In a Santa Fe presentation, you said that it should be one of the mantras of AI."}, {"time": 2221, "text": "And that you also yourself said, how to form and fluidly use concept is the most important open problem in AI."}, {"time": 2231, "text": "How to form and fluidly use concepts is the most important open problem in AI."}, {"time": 2236, "text": "So let's, what is a concept and what is an analogy?"}, {"time": 2241, "text": "A concept is in some sense a fundamental unit of thought."}, {"time": 2248, "text": "So say we have a concept of a dog, okay?"}, {"time": 2258, "text": "And a concept is embedded in a whole space of concepts so that there's certain concepts that are closer to it or farther away from it."}, {"time": 2270, "text": "Are these concepts, are they really like fundamental, like we mentioned innate, almost like axiomatic, like very basic and then there's other stuff built on top of it?"}, {"time": 2278, "text": "Or does this include everything?"}, {"time": 2281, "text": "Are they complicated?"}, {"time": 2284, "text": "You can certainly form new concepts."}, {"time": 2286, "text": "Right, I guess that's the question I'm asking."}, {"time": 2288, "text": "Can you form new concepts that are complex combinations of other concepts?"}, {"time": 2295, "text": "And that's kind of what we do in learning."}, {"time": 2300, "text": "And then what's the role of analogies in that?"}, {"time": 2302, "text": "So analogy is when you recognize that one situation is essentially the same as another situation."}, {"time": 2315, "text": "And essentially is kind of the key word there because it's not the same."}, {"time": 2319, "text": "So if I say, last week I did a podcast interview actually like three days ago in Washington, DC."}, {"time": 2332, "text": "And that situation was very similar to this situation, although it wasn't exactly the same."}, {"time": 2338, "text": "It was a different person sitting across from me."}, {"time": 2340, "text": "We had different kinds of microphones."}, {"time": 2343, "text": "The questions were different."}, {"time": 2344, "text": "The building was different."}, {"time": 2346, "text": "There's all kinds of different things, but really it was analogous."}, {"time": 2350, "text": "Or I can say, so doing a podcast interview, that's kind of a concept, it's a new concept."}, {"time": 2357, "text": "I never had that concept before this year essentially."}, {"time": 2363, "text": "I mean, and I can make an analogy with it like being interviewed for a news article in a newspaper."}, {"time": 2371, "text": "And I can say, well, you kind of play the same role that the newspaper reporter played."}, {"time": 2380, "text": "It's not exactly the same because maybe they actually emailed me some written questions rather than talking and the writing, the written questions are analogous to your spoken questions."}, {"time": 2393, "text": "And there's just all kinds of similarities."}, {"time": 2395, "text": "And this somehow probably connects to conversations you have over Thanksgiving dinner, just general conversations."}, {"time": 2401, "text": "There's like a thread you can probably take that just stretches out in all aspects of life that connect to this podcast."}, {"time": 2408, "text": "I mean, conversations between humans."}, {"time": 2411, "text": "Sure, and if I go and tell a friend of mine about this podcast interview, my friend might say, oh, the same thing happened to me."}, {"time": 2422, "text": "Let's say, you ask me some really hard question and I have trouble answering it."}, {"time": 2429, "text": "My friend could say, the same thing happened to me, but it was like, it wasn't a podcast interview."}, {"time": 2434, "text": "It wasn't, it was a completely different situation."}, {"time": 2439, "text": "And yet my friend is seeing essentially the same thing."}, {"time": 2443, "text": "We say that very fluidly, the same thing happened to me."}, {"time": 2446, "text": "Essentially the same thing."}, {"time": 2448, "text": "But we don't even say that, right?"}, {"time": 2450, "text": "We just say the same thing."}, {"time": 2451, "text": "You imply it, yes."}, {"time": 2451, "text": "Yeah, and the view that kind of went into say copycat, that whole thing is that that act of saying the same thing happened to me is making an analogy."}, {"time": 2464, "text": "And in some sense, that's what's underlies all of our concepts."}, {"time": 2470, "text": "Why do you think analogy making that you're describing is so fundamental to cognition?"}, {"time": 2477, "text": "Like it seems like it's the main element action of what we think of as cognition."}, {"time": 2483, "text": "Yeah, so it can be argued that all of this generalization we do of concepts and recognizing concepts in different situations is done by analogy."}, {"time": 2502, "text": "That that's, every time I'm recognizing that say you're a person, that's by analogy because I have this concept of what person is and I'm applying it to you."}, {"time": 2517, "text": "And every time I recognize a new situation, like one of the things I talked about in the book was the concept of walking a dog, that that's actually making an analogy because all of the details are very different."}, {"time": 2535, "text": "So reasoning could be reduced down to essentially analogy making."}, {"time": 2541, "text": "So all the things we think of as like, yeah, like you said, perception."}, {"time": 2546, "text": "So what's perception is taking raw sensory input and it's somehow integrating into our understanding of the world, updating the understanding."}, {"time": 2554, "text": "And all of that has just this giant mess of analogies that are being made."}, {"time": 2562, "text": "If you just linger on it a little bit, like what do you think it takes to engineer a process like that for us in our artificial systems?"}, {"time": 2572, "text": "We need to understand better, I think, how we do it, how humans do it."}, {"time": 2582, "text": "And it comes down to internal models, I think."}, {"time": 2587, "text": "People talk a lot about mental models, that concepts are mental models, that I can, in my head, I can do a simulation of a situation like walking a dog."}, {"time": 2602, "text": "And there's some work in psychology that promotes this idea that all of concepts are really mental simulations, that whenever you encounter a concept or situation in the world or you read about it or whatever, you do some kind of mental simulation that allows you to predict what's gonna happen, to develop expectations of what's gonna happen."}, {"time": 2627, "text": "So that's the kind of structure I think we need, is that kind of mental model that, and in our brains, somehow these mental models are very much interconnected."}, {"time": 2641, "text": "Again, so a lot of stuff we're talking about are essentially open problems, right?"}, {"time": 2645, "text": "So if I ask a question, I don't mean that you would know the answer, only just hypothesizing."}, {"time": 2651, "text": "But how big do you think is the network graph, data structure of concepts that's in our head?"}, {"time": 2663, "text": "Like if we're trying to build that ourselves, like it's, we take it, that's one of the things we take for granted."}, {"time": 2669, "text": "We think, I mean, that's why we take common sense for granted, we think common sense is trivial."}, {"time": 2674, "text": "But how big of a thing of concepts is that underlies what we think of as common sense, for example?"}, {"time": 2685, "text": "And I'm not, I don't even know what units to measure it in."}, {"time": 2688, "text": "Can you say how big is it?"}, {"time": 2690, "text": "That's beautifully put, right?"}, {"time": 2691, "text": "But, you know, we have, you know, it's really hard to know."}, {"time": 2695, "text": "We have, what, a hundred billion neurons or something."}, {"time": 2702, "text": "And they're connected via trillions of synapses."}, {"time": 2707, "text": "And there's all this chemical processing going on."}, {"time": 2710, "text": "There's just a lot of capacity for stuff."}, {"time": 2713, "text": "And their information's encoded in different ways in the brain."}, {"time": 2717, "text": "It's encoded in chemical interactions."}, {"time": 2719, "text": "It's encoded in electric, like firing and firing rates."}, {"time": 2724, "text": "And nobody really knows how it's encoded, but it just seems like there's a huge amount of capacity."}, {"time": 2729, "text": "So I think it's huge."}, {"time": 2730, "text": "It's just enormous."}, {"time": 2732, "text": "And it's amazing how much stuff we know."}, {"time": 2738, "text": "And for, but we know, and not just know like facts, but it's all integrated into this thing that we can make analogies with."}, {"time": 2747, "text": "There's a dream of Semantic Web, and there's a lot of dreams from expert systems of building giant knowledge bases."}, {"time": 2756, "text": "Do you see a hope for these kinds of approaches of building, of converting Wikipedia into something that could be used in analogy making?"}, {"time": 2767, "text": "And I think people have made some progress along those lines."}, {"time": 2770, "text": "I mean, people have been working on this for a long time."}, {"time": 2773, "text": "But the problem is, and this I think is the problem of common sense."}, {"time": 2777, "text": "Like people have been trying to get these common sense networks."}, {"time": 2781, "text": "Here at MIT, there's this concept net project, right?"}, {"time": 2785, "text": "But the problem is that, as I said, most of the knowledge that we have is invisible to us."}, {"time": 2791, "text": "It's not in Wikipedia."}, {"time": 2793, "text": "It's very basic things about intuitive physics, intuitive psychology, intuitive metaphysics, all that stuff."}, {"time": 2807, "text": "If you were to create a website that described intuitive physics, intuitive psychology, would it be bigger or smaller than Wikipedia?"}, {"time": 2818, "text": "I guess described to whom?"}, {"time": 2820, "text": "I'm sorry, but."}, {"time": 2823, "text": "No, that's really good."}, {"time": 2825, "text": "That's exactly right, yeah."}, {"time": 2827, "text": "That's a hard question, because how do you represent that knowledge is the question, right?"}, {"time": 2832, "text": "I can certainly write down F equals MA and Newton's laws and a lot of physics can be deduced from that."}, {"time": 2843, "text": "But that's probably not the best representation of that knowledge for doing the kinds of reasoning we want a machine to do."}, {"time": 2855, "text": "So, I don't know, it's impossible to say now."}, {"time": 2860, "text": "And people, you know, the projects, like there's the famous psych project, right, that Douglas Linnaught did that was trying."}, {"time": 2870, "text": "That thing's still going?"}, {"time": 2871, "text": "I think it's still going."}, {"time": 2872, "text": "And the idea was to try and encode all of common sense knowledge, including all this invisible knowledge in some kind of logical representation."}, {"time": 2883, "text": "And it just never, I think, could do any of the things that he was hoping it could do, because that's just the wrong approach."}, {"time": 2893, "text": "Of course, that's what they always say, you know."}, {"time": 2896, "text": "And then the history books will say, well, the psych project finally found a breakthrough in 2058 or something."}, {"time": 2904, "text": "So much progress has been made in just a few decades that who knows what the next breakthroughs will be."}, {"time": 2911, "text": "It could be."}, {"time": 2912, "text": "It's certainly a compelling notion what the psych project stands for."}, {"time": 2917, "text": "I think Linnaught was one of the earliest people to say common sense is what we need."}, {"time": 2924, "text": "All this like expert system stuff, that is not gonna get you to AI."}, {"time": 2929, "text": "You need common sense."}, {"time": 2930, "text": "And he basically gave up his whole academic career to go pursue that."}, {"time": 2937, "text": "And I totally admire that, but I think that the approach itself will not, in 2040 or wherever, be successful."}, {"time": 2949, "text": "What do you think is wrong with the approach?"}, {"time": 2950, "text": "What kind of approach might be successful?"}, {"time": 2954, "text": "Well, if I knew that."}, {"time": 2955, "text": "Again, nobody knows the answer, right?"}, {"time": 2956, "text": "If I knew that, you know, one of my talks, one of the people in the audience, this is a public lecture, one of the people in the audience said, what AI companies are you investing in?"}, {"time": 2967, "text": "I'm like, well, I'm a college professor for one thing, so I don't have a lot of extra funds to invest, but also like no one knows what's gonna work in AI, right?"}, {"time": 2981, "text": "Let me ask another impossible question in case you have a sense."}, {"time": 2984, "text": "In terms of data structures that will store this kind of information, do you think they've been invented yet, both in hardware and software?"}, {"time": 2994, "text": "Or is it something else needs to be, are we totally, you know?"}, {"time": 2998, "text": "I think something else has to be invented."}, {"time": 3001, "text": "That's my guess."}, {"time": 3003, "text": "Is the breakthroughs that's most promising, would that be in hardware or in software?"}, {"time": 3009, "text": "Do you think we can get far with the current computers?"}, {"time": 3012, "text": "Or do we need to do something that you see?"}, {"time": 3014, "text": "I see what you're saying."}, {"time": 3016, "text": "I don't know if Turing computation is gonna be sufficient."}, {"time": 3019, "text": "Probably, I would guess it will."}, {"time": 3022, "text": "I don't see any reason why we need anything else."}, {"time": 3026, "text": "So in that sense, we have invented the hardware we need, but we just need to make it faster and bigger, and we need to figure out the right algorithms and the right sort of architecture."}, {"time": 3039, "text": "Turing, that's a very mathematical notion."}, {"time": 3043, "text": "When we try to have to build intelligence, it's now an engineering notion where you throw all that stuff."}, {"time": 3048, "text": "Well, I guess it is a question."}, {"time": 3053, "text": "People have brought up this question, and when you asked about, like, is our current hardware, will our current hardware work?"}, {"time": 3062, "text": "Well, Turing computation says that our current hardware is, in principle, a Turing machine, right?"}, {"time": 3073, "text": "So all we have to do is make it faster and bigger."}, {"time": 3076, "text": "But there have been people like Roger Penrose, if you might remember, that he said, Turing machines cannot produce intelligence because intelligence requires continuous valued numbers."}, {"time": 3090, "text": "I mean, that was sort of my reading of his argument."}, {"time": 3094, "text": "And quantum mechanics and what else, whatever."}, {"time": 3098, "text": "But I don't see any evidence for that, that we need new computation paradigms."}, {"time": 3108, "text": "But I don't know if we're, you know, I don't think we're gonna be able to scale up our current approaches to programming these computers."}, {"time": 3118, "text": "What is your hope for approaches like CopyCat or other cognitive architectures?"}, {"time": 3122, "text": "I've talked to the creator of SOAR, for example."}, {"time": 3124, "text": "I've used ActR myself."}, {"time": 3126, "text": "I don't know if you're familiar with it."}, {"time": 3127, "text": "What do you think is, what's your hope of approaches like that in helping develop systems of greater and greater intelligence in the coming decades?"}, {"time": 3139, "text": "Well, that's what I'm working on now, is trying to take some of those ideas and extending it."}, {"time": 3146, "text": "So I think there are some really promising approaches that are going on now that have to do with more active generative models."}, {"time": 3159, "text": "So this is the idea of this simulation in your head, the concept, when you, if you wanna, when you're perceiving a new situation, you have some simulations in your head."}, {"time": 3171, "text": "Those are generative models."}, {"time": 3172, "text": "They're generating your expectations."}, {"time": 3174, "text": "They're generating predictions."}, {"time": 3175, "text": "So that's part of a perception."}, {"time": 3177, "text": "You have a metamodel that generates a prediction then you compare it with, and then the difference."}, {"time": 3183, "text": "And you also, that generative model is telling you where to look and what to look at and what to pay attention to."}, {"time": 3191, "text": "And it, I think it affects your perception."}, {"time": 3194, "text": "It's not that just you compare it with your perception."}, {"time": 3196, "text": "It becomes your perception in a way."}, {"time": 3201, "text": "It's kind of a mixture of the bottom up information coming from the world and your top down model being imposed on the world is what becomes your perception."}, {"time": 3216, "text": "So your hope is something like that can improve perception systems and that they can understand things better."}, {"time": 3221, "text": "To understand things."}, {"time": 3224, "text": "What's the, what's the step, what's the analogy making step there?"}, {"time": 3229, "text": "Well, there, the idea is that you have this pretty complicated conceptual space."}, {"time": 3237, "text": "You can talk about a semantic network or something like that with these different kinds of concept models in your brain that are connected."}, {"time": 3247, "text": "So, so let's, let's take the example of walking a dog."}, {"time": 3250, "text": "So we were talking about that."}, {"time": 3253, "text": "Let's say I see someone out in the street walking a cat."}, {"time": 3256, "text": "Some people walk their cats, I guess."}, {"time": 3258, "text": "Seems like a bad idea, but."}, {"time": 3261, "text": "So my model, my, you know, there's connections between my model of a dog and model of a cat."}, {"time": 3268, "text": "And I can immediately see the analogy of that those are analogous situations, but I can also see the differences and that tells me what to expect."}, {"time": 3283, "text": "So also, you know, I have a new situation."}, {"time": 3288, "text": "So another example with the walking the dog thing is sometimes people, I see people riding their bikes with a leash, holding a leash and the dogs running alongside."}, {"time": 3297, "text": "Okay, so I know that the, I recognize that as kind of a dog walking situation, even though the person's not walking, right?"}, {"time": 3306, "text": "And the dog's not walking."}, {"time": 3308, "text": "Because I have these models that say, okay, riding a bike is sort of similar to walking or it's connected, it's a means of transportation, but I, because they have their dog there, I assume they're not going to work, but they're going out for exercise."}, {"time": 3326, "text": "You know, these analogies help me to figure out kind of what's going on, what's likely."}, {"time": 3333, "text": "But sort of these analogies are very human interpretable."}, {"time": 3337, "text": "So that's that kind of space."}, {"time": 3338, "text": "And then you look at something like the current deep learning approaches, they kind of help you to take raw sensory information and to sort of automatically build up hierarchies of what you can even call them concepts."}, {"time": 3352, "text": "They're just not human interpretable concepts."}, {"time": 3355, "text": "What's your, what's the link here?"}, {"time": 3358, "text": "Do you hope, sort of the hybrid system question, how do you think the two can start to meet each other?"}, {"time": 3368, "text": "What's the value of learning in this systems of forming, of analogy making?"}, {"time": 3376, "text": "The goal of, you know, the original goal of deep learning in at least visual perception was that you would get the system to learn to extract features that at these different levels of complexity."}, {"time": 3390, "text": "So maybe edge detection and that would lead into learning, you know, simple combinations of edges and then more complex shapes and then whole objects or faces."}, {"time": 3402, "text": "And this was based on the ideas of the neuroscientists, Hubel and Wiesel, who had seen, laid out this kind of structure in brain."}, {"time": 3418, "text": "And I think that's right to some extent."}, {"time": 3422, "text": "Of course, people have found that the whole story is a little more complex than that."}, {"time": 3427, "text": "And the brain of course always is and there's a lot of feedback."}, {"time": 3430, "text": "So I see that as absolutely a good brain inspired approach to some aspects of perception."}, {"time": 3445, "text": "But one thing that it's lacking, for example, is all of that feedback, which is extremely important."}, {"time": 3453, "text": "The interactive element that you mentioned."}, {"time": 3456, "text": "The expectation, right, the conceptual level."}, {"time": 3459, "text": "Going back and forth with the expectation, the perception and just going back and forth."}, {"time": 3464, "text": "So, right, so that is extremely important."}, {"time": 3467, "text": "And, you know, one thing about deep neural networks is that in a given situation, like, you know, they're trained, right?"}, {"time": 3476, "text": "They get these weights and everything, but then now I give them a new image, let's say."}, {"time": 3482, "text": "They treat every part of the image in the same way."}, {"time": 3489, "text": "You know, they apply the same filters at each layer to all parts of the image."}, {"time": 3495, "text": "There's no feedback to say like, oh, this part of the image is irrelevant."}, {"time": 3500, "text": "I shouldn't care about this part of the image."}, {"time": 3503, "text": "Or this part of the image is the most important part."}, {"time": 3507, "text": "And that's kind of what we humans are able to do because we have these conceptual expectations."}, {"time": 3513, "text": "So there's a, by the way, a little bit of work in that."}, {"time": 3515, "text": "There's certainly a lot more in what's under the, called attention in natural language processing knowledge."}, {"time": 3522, "text": "It's a, and that's exceptionally powerful."}, {"time": 3526, "text": "And it's a very, just as you say, it's a really powerful idea."}, {"time": 3530, "text": "But again, in sort of machine learning, it all kind of operates in an automated way."}, {"time": 3535, "text": "That's not human interpret."}, {"time": 3536, "text": "It's not also, okay, so that, right."}, {"time": 3539, "text": "It's not dynamic."}, {"time": 3540, "text": "I mean, in the sense that as a perception of a new example is being processed, those attention's weights don't change."}, {"time": 3552, "text": "Right, so I mean, there's a kind of notion that there's not a memory."}, {"time": 3560, "text": "So you're not aggregating the idea of like, this mental model."}, {"time": 3566, "text": "I mean, that seems to be a fundamental idea."}, {"time": 3568, "text": "There's not a really powerful, I mean, there's some stuff with memory, but there's not a powerful way to represent the world in some sort of way that's deeper than, I mean, it's so difficult because, you know, neural networks do represent the world."}, {"time": 3587, "text": "They do have a mental model, right?"}, {"time": 3590, "text": "But it just seems to be shallow."}, {"time": 3593, "text": "It's hard to criticize them at the fundamental level, to me at least."}, {"time": 3601, "text": "It's easy to criticize them."}, {"time": 3605, "text": "Well, look, like exactly what you're saying, mental models sort of almost put a psychology hat on, say, look, these networks are clearly not able to achieve what we humans do with forming mental models, analogy making and so on."}, {"time": 3620, "text": "But that doesn't mean that they fundamentally cannot do that."}, {"time": 3623, "text": "Like it's very difficult to say that."}, {"time": 3625, "text": "I mean, at least to me, do you have a notion that the learning approach is really, I mean, they're going to not only are they limited today, but they will forever be limited in being able to construct such mental models."}, {"time": 3642, "text": "I think the idea of the dynamic perception is key here."}, {"time": 3647, "text": "The idea that moving your eyes around and getting feedback."}, {"time": 3654, "text": "And that's something that, you know, there's been some models like that."}, {"time": 3658, "text": "There's certainly recurrent neural networks that operate over several time steps."}, {"time": 3663, "text": "But the problem is that the actual, the recurrence is, you know, basically the feedback is at the next time step is the entire hidden state of the network, which is, it turns out that that doesn't work very well."}, {"time": 3685, "text": "But see, the thing I'm saying is mathematically speaking, it has the information in that recurrence to capture everything, it just doesn't seem to work."}, {"time": 3698, "text": "So like, you know, it's like, it's the same Turing machine question, right?"}, {"time": 3704, "text": "Yeah, maybe theoretically, computers, anything that's Turing, a universal Turing machine can be intelligent, but practically, the architecture might be very specific."}, {"time": 3719, "text": "Kind of architecture to be able to create it."}, {"time": 3724, "text": "So just, I guess it sort of asks almost the same question again is how big of a role do you think deep learning needs, will play or needs to play in this, in perception?"}, {"time": 3740, "text": "I think that deep learning as it's currently, as it currently exists, you know, will place, that kind of thing will play some role."}, {"time": 3751, "text": "But I think that there's a lot more going on in perception."}, {"time": 3756, "text": "But who knows, you know, the definition of deep learning, I mean, it's pretty broad."}, {"time": 3761, "text": "It's kind of an umbrella for a lot of different things."}, {"time": 3763, "text": "So what I mean is purely sort of neural networks."}, {"time": 3765, "text": "Yeah, and a feed forward neural networks."}, {"time": 3768, "text": "Essentially, or there could be recurrence, but sometimes it feels like, for instance, I talked to Gary Marcus, it feels like the criticism of deep learning is kind of like us birds criticizing airplanes for not flying well, or that they're not really flying."}, {"time": 3787, "text": "Do you think deep learning, do you think it could go all the way?"}, {"time": 3792, "text": "Like Yann LeCun thinks."}, {"time": 3794, "text": "Do you think that, yeah, the brute force learning approach can go all the way?"}, {"time": 3801, "text": "I don't think so, no."}, {"time": 3803, "text": "I mean, I think it's an open question, but I tend to be on the innateness side that there's some things that we've been evolved to be able to learn, and that learning just can't happen without them."}, {"time": 3824, "text": "So one example, here's an example I had in the book that I think is useful to me, at least, in thinking about this."}, {"time": 3831, "text": "So this has to do with the Deep Minds Atari game playing program, okay?"}, {"time": 3839, "text": "And it learned to play these Atari video games just by getting input from the pixels of the screen, and it learned to play the game Breakout 1,000% better than humans, okay?"}, {"time": 3858, "text": "That was one of their results, and it was great."}, {"time": 3860, "text": "And it learned this thing where it tunneled through the side of the bricks in the breakout game, and the ball could bounce off the ceiling and then just wipe out bricks."}, {"time": 3870, "text": "Okay, so there was a group who did an experiment where they took the paddle that you move with the joystick and moved it up two pixels or something like that."}, {"time": 3885, "text": "And then they looked at a deep Q learning system that had been trained on Breakout and said, could it now transfer its learning to this new version of the game?"}, {"time": 3895, "text": "Of course, a human could, and it couldn't."}, {"time": 3898, "text": "Maybe that's not surprising, but I guess the point is it hadn't learned the concept of a paddle."}, {"time": 3904, "text": "It hadn't learned the concept of a ball or the concept of tunneling."}, {"time": 3909, "text": "It was learning something, you know, we looking at it kind of anthropomorphized it and said, oh, here's what it's doing in the way we describe it."}, {"time": 3918, "text": "But it actually didn't learn those concepts."}, {"time": 3921, "text": "And so because it didn't learn those concepts, it couldn't make this transfer."}, {"time": 3926, "text": "Yes, so that's a beautiful statement, but at the same time, by moving the paddle, we also anthropomorphize flaws to inject into the system that will then flip how impressed we are by it."}, {"time": 3939, "text": "What I mean by that is, to me, the Atari games were, to me, deeply impressive that that was possible at all."}, {"time": 3948, "text": "So like I have to first pause on that, and people should look at that, just like the game of Go, which is fundamentally different to me than what Deep Blue did."}, {"time": 3959, "text": "Even though there's still a tree search, it's just everything DeepMind has done in terms of learning, however limited it is, is still deeply surprising to me."}, {"time": 3971, "text": "Yeah, I'm not trying to say that what they did wasn't impressive."}, {"time": 3975, "text": "I think it was incredibly impressive."}, {"time": 3977, "text": "To me, it's interesting."}, {"time": 3979, "text": "Is moving the board just another thing that needs to be learned?"}, {"time": 3984, "text": "So like we've been able to, maybe, maybe, been able to, through the current neural networks, learn very basic concepts that are not enough to do this general reasoning, and maybe with more data."}, {"time": 3997, "text": "I mean, the interesting thing about the examples that you talk about beautifully is it's often flaws of the data."}, {"time": 4008, "text": "Well, that's the question."}, {"time": 4009, "text": "I mean, I think that is the key question, whether it's a flaw of the data or not."}, {"time": 4013, "text": "Because the reason I brought up this example was because you were asking, do I think that learning from data could go all the way?"}, {"time": 4021, "text": "And this was why I brought up the example, because I think, and this is not at all to take away from the impressive work that they did, but it's to say that when we look at what these systems learn, do they learn the things that we humans consider to be the relevant concepts?"}, {"time": 4045, "text": "And in that example, it didn't."}, {"time": 4049, "text": "Sure, if you train it on moving, you know, the paddle being in different places, maybe it could deal with, maybe it would learn that concept."}, {"time": 4060, "text": "I'm not totally sure."}, {"time": 4062, "text": "But the question is, you know, scaling that up to more complicated worlds, to what extent could a machine that only gets this very raw data learn to divide up the world into relevant concepts?"}, {"time": 4078, "text": "And I don't know the answer, but I would bet that without some innate notion that it can't do it."}, {"time": 4090, "text": "Yeah, 10 years ago, I 100% agree with you as the most experts in AI system, but now I have a glimmer of hope."}, {"time": 4099, "text": "Okay, I mean, that's fair enough."}, {"time": 4101, "text": "And I think that's what deep learning did in the community is, no, no, if I had to bet all my money, it's 100% deep learning will not take us all the way."}, {"time": 4109, "text": "But there's still other, it's still, I was so personally sort of surprised by the Atari games, by Go, by the power of self play of just game playing against each other that I was like many other times just humbled of how little I know about what's possible in this approach."}, {"time": 4129, "text": "Yeah, I think fair enough."}, {"time": 4131, "text": "Self play is amazingly powerful."}, {"time": 4133, "text": "And that goes way back to Arthur Samuel, right, with his checker plane program, which was brilliant and surprising that it did so well."}, {"time": 4146, "text": "So just for fun, let me ask you on the topic of autonomous vehicles."}, {"time": 4150, "text": "It's the area that I work at least these days most closely on, and it's also area that I think is a good example that you use as sort of an example of things we as humans don't always realize how hard it is to do."}, {"time": 4168, "text": "It's like the constant trend in AI, but the different problems that we think are easy when we first try them and then realize how hard it is."}, {"time": 4176, "text": "Okay, so you've talked about autonomous driving being a difficult problem, more difficult than we realize."}, {"time": 4184, "text": "Humans give it credit for it."}, {"time": 4186, "text": "Why is it so difficult?"}, {"time": 4187, "text": "What are the most difficult parts in your view?"}, {"time": 4191, "text": "I think it's difficult because of the world is so open ended as to what kinds of things can happen."}, {"time": 4199, "text": "So you have sort of what normally happens, which is just you drive along and nothing surprising happens, and autonomous vehicles can do, the ones we have now evidently can do really well on most normal situations as long as the weather is reasonably good and everything."}, {"time": 4224, "text": "But if some, we have this notion of edge cases or things in the tail of the distribution, we call it the long tail problem, which says that there's so many possible things that can happen that was not in the training data of the machine that it won't be able to handle it because it doesn't have common sense."}, {"time": 4250, "text": "Right, it's the old, the paddle moved problem."}, {"time": 4254, "text": "Yeah, it's the paddle moved problem, right."}, {"time": 4257, "text": "And so my understanding, and you probably are more of an expert than I am on this, is that current self driving car vision systems have problems with obstacles, meaning that they don't know which obstacles, which quote unquote obstacles they should stop for and which ones they shouldn't stop for."}, {"time": 4278, "text": "And so a lot of times I read that they tend to slam on the brakes quite a bit."}, {"time": 4283, "text": "And the most common accidents with self driving cars are people rear ending them because they were surprised."}, {"time": 4291, "text": "They weren't expecting the machine, the car to stop."}, {"time": 4295, "text": "Yeah, so there's a lot of interesting questions there."}, {"time": 4298, "text": "Whether, because you mentioned kind of two things."}, {"time": 4302, "text": "So one is the problem of perception, of understanding, of interpreting the objects that are detected correctly."}, {"time": 4311, "text": "And the other one is more like the policy, the action that you take, how you respond to it."}, {"time": 4317, "text": "So a lot of the car's braking is a kind of notion of, to clarify, there's a lot of different kind of things that are people calling autonomous vehicles."}, {"time": 4327, "text": "But the L4 vehicles with a safety driver are the ones like Waymo and Cruise and those companies, they tend to be very conservative and cautious."}, {"time": 4338, "text": "So they tend to be very, very afraid of hurting anything or anyone and getting in any kind of accidents."}, {"time": 4344, "text": "So their policy is very kind of, that results in being exceptionally responsive to anything that could possibly be an obstacle, right?"}, {"time": 4353, "text": "Right, which the human drivers around it, it behaves unpredictably."}, {"time": 4361, "text": "Yeah, that's not a very human thing to do, caution."}, {"time": 4363, "text": "That's not the thing we're good at, especially in driving."}, {"time": 4366, "text": "We're in a hurry, often angry and et cetera, especially in Boston."}, {"time": 4371, "text": "And then there's sort of another, and a lot of times, machine learning is not a huge part of that."}, {"time": 4377, "text": "It's becoming more and more unclear to me how much sort of speaking to public information because a lot of companies say they're doing deep learning and machine learning just to attract good candidates."}, {"time": 4392, "text": "The reality is in many cases, it's still not a huge part of the perception."}, {"time": 4398, "text": "There's LiDAR and there's other sensors that are much more reliable for obstacle detection."}, {"time": 4403, "text": "And then there's Tesla approach, which is vision only."}, {"time": 4407, "text": "And there's, I think a few companies doing that, but Tesla most sort of famously pushing that forward."}, {"time": 4412, "text": "And that's because the LiDAR is too expensive, right?"}, {"time": 4415, "text": "Well, I mean, yes, but I would say if you were to for free give to every Tesla vehicle, I mean, Elon Musk fundamentally believes that LiDAR is a crutch, right, famously said that."}, {"time": 4430, "text": "That if you want to solve the problem of machine learning, LiDAR should not be the primary sensor is the belief."}, {"time": 4440, "text": "The camera contains a lot more information."}, {"time": 4444, "text": "So if you want to learn, you want that information."}, {"time": 4448, "text": "But if you want to not to hit obstacles, you want LiDAR, right?"}, {"time": 4453, "text": "Sort of it's this weird trade off because yeah, sort of what Tesla vehicles have a lot of, which is really the thing, the fallback, the primary fallback sensor is radar, which is a very crude version of LiDAR."}, {"time": 4472, "text": "It's a good detector of obstacles except when those things are standing, right?"}, {"time": 4477, "text": "The stopped vehicle."}, {"time": 4479, "text": "Right, that's why it had problems with crashing into stop fire trucks."}, {"time": 4483, "text": "Stop fire trucks, right."}, {"time": 4484, "text": "So the hope there is that the vision sensor would somehow catch that."}, {"time": 4489, "text": "And for, there's a lot of problems with perception."}, {"time": 4494, "text": "They are doing actually some incredible stuff in the, almost like an active learning space where it's constantly taking edge cases and pulling back in."}, {"time": 4506, "text": "There's this data pipeline."}, {"time": 4508, "text": "Another aspect that is really important that people are studying now is called multitask learning, which is sort of breaking apart this problem, whatever the problem is, in this case driving, into dozens or hundreds of little problems that you can turn into learning problems."}, {"time": 4526, "text": "So this giant pipeline, it's kind of interesting."}, {"time": 4530, "text": "I've been skeptical from the very beginning, but become less and less skeptical over time how much of driving can be learned."}, {"time": 4537, "text": "I still think it's much farther than the CEO of that particular company thinks it will be, but it's constantly surprising that through good engineering and data collection and active selection of data, how you can attack that long tail."}, {"time": 4556, "text": "And it's an interesting open question that you're absolutely right."}, {"time": 4559, "text": "There's a much longer tail and all these edge cases that we don't think about, but it's a fascinating question that applies to natural language and all spaces."}, {"time": 4569, "text": "How big is that long tail?"}, {"time": 4572, "text": "And I mean, not to linger on the point, but what's your sense in driving in these practical problems of the human experience?"}, {"time": 4584, "text": "Can it be learned?"}, {"time": 4586, "text": "So the current, what are your thoughts of sort of Elon Musk thought, let's forget the thing that he says it'd be solved in a year, but can it be solved in a reasonable timeline or do fundamentally other methods need to be invented?"}, {"time": 4601, "text": "So I don't, I think that ultimately driving, so it's a trade off in a way, being able to drive and deal with any situation that comes up does require kind of full human intelligence."}, {"time": 4619, "text": "And even in humans aren't intelligent enough to do it because humans, I mean, most human accidents are because the human wasn't paying attention or the humans drunk or whatever."}, {"time": 4631, "text": "And not because they weren't intelligent enough."}, {"time": 4633, "text": "And not because they weren't intelligent enough, right."}, {"time": 4637, "text": "Whereas the accidents with autonomous vehicles is because they weren't intelligent enough."}, {"time": 4645, "text": "They're always paying attention."}, {"time": 4646, "text": "Yeah, they're always paying attention."}, {"time": 4647, "text": "So it's a trade off, you know, and I think that it's a very fair thing to say that autonomous vehicles will be ultimately safer than humans because humans are very unsafe."}, {"time": 4659, "text": "It's kind of a low bar."}, {"time": 4662, "text": "But just like you said, I think humans got a better rap, right."}, {"time": 4668, "text": "Because we're really good at the common sense thing."}, {"time": 4670, "text": "Yeah, we're great at the common sense thing."}, {"time": 4672, "text": "We're bad at the paying attention thing."}, {"time": 4673, "text": "Paying attention thing, right."}, {"time": 4674, "text": "Especially when we're, you know, driving is kind of boring and we have these phones to play with and everything."}, {"time": 4679, "text": "But I think what's going to happen is that for many reasons, not just AI reasons, but also like legal and other reasons, that the definition of self driving is going to change or autonomous is going to change."}, {"time": 4699, "text": "It's not going to be just, I'm going to go to sleep in the back and you just drive me anywhere."}, {"time": 4707, "text": "It's going to be more certain areas are going to be instrumented to have the sensors and the mapping and all of the stuff you need for, that the autonomous cars won't have to have full common sense and they'll do just fine in those areas as long as pedestrians don't mess with them too much."}, {"time": 4729, "text": "That's another question."}, {"time": 4732, "text": "But I don't think we will have fully autonomous self driving in the way that like most, the average person thinks of it for a very long time."}, {"time": 4744, "text": "And just to reiterate, this is the interesting open question that I think I agree with you on, is to solve fully autonomous driving, you have to be able to engineer in common sense."}, {"time": 4759, "text": "I think it's an important thing to hear and think about."}, {"time": 4763, "text": "I hope that's wrong, but I currently agree with you that unfortunately you do have to have, to be more specific, sort of these deep understandings of physics and of the way this world works and also the human dynamics."}, {"time": 4779, "text": "Like you mentioned, pedestrians and cyclists, actually that's whatever that nonverbal communication as some people call it, there's that dynamic that is also part of this common sense."}, {"time": 4791, "text": "And we humans are pretty good at predicting what other humans are going to do."}, {"time": 4797, "text": "And how our actions impact the behaviors of this weird game theoretic dance that we're good at somehow."}, {"time": 4805, "text": "And the funny thing is, because I've watched countless hours of pedestrian video and talked to people, we humans are also really bad at articulating the knowledge we have."}, {"time": 4817, "text": "Which has been a huge challenge."}, {"time": 4820, "text": "So you've mentioned embodied intelligence."}, {"time": 4823, "text": "What do you think it takes to build a system of human level intelligence?"}, {"time": 4827, "text": "Does it need to have a body?"}, {"time": 4829, "text": "I'm not sure, but I'm coming around to that more and more."}, {"time": 4834, "text": "And what does it mean to be, I don't mean to keep bringing up Yann LeCun."}, {"time": 4840, "text": "He looms very large."}, {"time": 4842, "text": "Well, he certainly has a large personality."}, {"time": 4846, "text": "He thinks that the system needs to be grounded, meaning he needs to sort of be able to interact with reality, but doesn't think it necessarily needs to have a body."}, {"time": 4856, "text": "So when you think of..."}, {"time": 4857, "text": "So what's the difference?"}, {"time": 4858, "text": "I guess I want to ask, when you mean body, do you mean you have to be able to play with the world?"}, {"time": 4864, "text": "Or do you also mean like there's a body that you have to preserve?"}, {"time": 4871, "text": "I haven't really thought about that, but I think both, I would guess."}, {"time": 4875, "text": "Because I think intelligence, it's so hard to separate it from our desire for self preservation, our emotions, all that non rational stuff that kind of gets in the way of logical thinking."}, {"time": 4903, "text": "Because the way, if we're talking about human intelligence or human level intelligence, whatever that means, a huge part of it is social."}, {"time": 4915, "text": "We were evolved to be social and to deal with other people."}, {"time": 4921, "text": "And that's just so ingrained in us that it's hard to separate intelligence from that."}, {"time": 4929, "text": "I think AI for the last 70 years or however long it's been around, it has largely been separated."}, {"time": 4938, "text": "There's this idea that there's like, it's kind of very Cartesian."}, {"time": 4943, "text": "There's this thinking thing that we're trying to create, but we don't care about all this other stuff."}, {"time": 4950, "text": "And I think the other stuff is very fundamental."}, {"time": 4954, "text": "So there's idea that things like emotion can get in the way of intelligence."}, {"time": 4960, "text": "As opposed to being an integral part of it."}, {"time": 4962, "text": "Integral part of it."}, {"time": 4963, "text": "So, I mean, I'm Russian, so romanticize the notions of emotion and suffering and all that kind of fear of mortality, those kinds of things."}, {"time": 4972, "text": "So in AI, especially."}, {"time": 4976, "text": "By the way, did you see that?"}, {"time": 4977, "text": "There was this recent thing going around the internet."}, {"time": 4980, "text": "Some, I think he's a Russian or some Slavic had written this thing, anti the idea of super intelligence."}, {"time": 4988, "text": "I forgot, maybe he's Polish."}, {"time": 4990, "text": "Anyway, so it all these arguments and one was the argument from Slavic pessimism."}, {"time": 4995, "text": "My favorite."}, {"time": 4999, "text": "Do you remember what the argument is?"}, {"time": 5001, "text": "It's like nothing ever works."}, {"time": 5003, "text": "Everything sucks."}, {"time": 5007, "text": "So what do you think is the role?"}, {"time": 5009, "text": "Like that's such a fascinating idea that what we perceive as sort of the limits of the human mind, which is emotion and fear and all those kinds of things are integral to intelligence."}, {"time": 5025, "text": "Could you elaborate on that?"}, {"time": 5027, "text": "Like why is that important, do you think?"}, {"time": 5034, "text": "For human level intelligence."}, {"time": 5038, "text": "At least for the way the humans work, it's a big part of how it affects how we perceive the world."}, {"time": 5044, "text": "It affects how we make decisions about the world."}, {"time": 5047, "text": "It affects how we interact with other people."}, {"time": 5050, "text": "It affects our understanding of other people."}, {"time": 5054, "text": "For me to understand what you're likely to do, I need to have kind of a theory of mind and that's very much a theory of emotion and motivations and goals."}, {"time": 5072, "text": "And to understand that, we have this whole system of mirror neurons."}, {"time": 5082, "text": "I sort of understand your motivations through sort of simulating it myself."}, {"time": 5089, "text": "So it's not something that I can prove that's necessary, but it seems very likely."}, {"time": 5101, "text": "You've written the op ed in the New York Times titled We Shouldn't Be Scared by Superintelligent AI and it criticized a little bit Stuart Russell and Nick Bostrom."}, {"time": 5113, "text": "Can you try to summarize that article's key ideas?"}, {"time": 5118, "text": "So it was spurred by an earlier New York Times op ed by Stuart Russell, which was summarizing his book called Human Compatible."}, {"time": 5128, "text": "And the article was saying if we have superintelligent AI, we need to have its values aligned with our values and it has to learn about what we really want."}, {"time": 5143, "text": "And he gave this example."}, {"time": 5145, "text": "What if we have a superintelligent AI and we give it the problem of solving climate change and it decides that the best way to lower the carbon in the atmosphere is to kill all the humans?"}, {"time": 5199, "text": "And, you know, Bostrom, in his book, talks about the orthogonality hypothesis where he says he thinks that a system's, I can't remember exactly what it is, but like a system's goals and its values don't have to be aligned."}, {"time": 5218, "text": "There's some orthogonality there, which didn't make any sense to me."}, {"time": 5222, "text": "So you're saying in any system that's sufficiently not even superintelligent, but as opposed to greater and greater intelligence, there's a holistic nature that will sort of, a tension that will naturally emerge that prevents it from sort of any one dimension running away."}, {"time": 5237, "text": "Yeah, yeah, exactly."}, {"time": 5239, "text": "So, you know, Bostrom had this example of the superintelligent AI that makes, that turns the world into paper clips because its job is to make paper clips or something."}, {"time": 5253, "text": "And that just, as a thought experiment, didn't make any sense to me."}, {"time": 5257, "text": "Well, as a thought experiment or as a thing that could possibly be realized?"}, {"time": 5263, "text": "So I think that, you know, what my op ed was trying to do was say that intelligence is more complex than these people are presenting it."}, {"time": 5273, "text": "That it's not like, it's not so separable."}, {"time": 5278, "text": "The rationality, the values, the emotions, the, all of that, that it's, the view that you could separate all these dimensions and build a machine that has one of these dimensions and it's superintelligent in one dimension, but it doesn't have any of the other dimensions."}, {"time": 5297, "text": "That's what I was trying to criticize that I don't believe that."}, {"time": 5304, "text": "So can I read a few sentences from Yoshua Bengio who is always super eloquent?"}, {"time": 5315, "text": "So he writes, I have the same impression as Melanie that our cognitive biases are linked with our ability to learn to solve many problems."}, {"time": 5325, "text": "They may also be a limiting factor for AI."}, {"time": 5329, "text": "However, this is a may in quotes."}, {"time": 5333, "text": "Things may also turn out differently and there's a lot of uncertainty about the capabilities of future machines."}, {"time": 5339, "text": "But more importantly for me, the value alignment problem is a problem well before we reach some hypothetical superintelligence."}, {"time": 5348, "text": "It is already posing a problem in the form of super powerful companies whose objective function may not be sufficiently aligned with humanity's general wellbeing, creating all kinds of harmful side effects."}, {"time": 5361, "text": "So he goes on to argue that the orthogonality and those kinds of things, the concerns of just aligning values with the capabilities of the system is something that might come long before we reach anything like superintelligence."}, {"time": 5380, "text": "So your criticism is kind of really nice to saying this idea of superintelligent systems seem to be dismissing fundamental parts of what intelligence would take."}, {"time": 5390, "text": "And then Yoshua kind of says, yes, but if we look at systems that are much less intelligent, there might be these same kinds of problems that emerge."}, {"time": 5402, "text": "Sure, but I guess the example that he gives there of these corporations, that's people, right?"}, {"time": 5409, "text": "Those are people's values."}, {"time": 5411, "text": "I mean, we're talking about people, the corporations are, their values are the values of the people who run those corporations."}, {"time": 5421, "text": "But the idea is the algorithm, that's right."}, {"time": 5424, "text": "So the fundamental person, the fundamental element of what does the bad thing is a human being."}, {"time": 5432, "text": "But the algorithm kind of controls the behavior of this mass of human beings."}, {"time": 5438, "text": "Which algorithm?"}, {"time": 5440, "text": "For a company that's the, so for example, if it's an advertisement driven company that recommends certain things and encourages engagement, so it gets money by encouraging engagement and therefore the company more and more, it's like the cycle that builds an algorithm that enforces more engagement and may perhaps more division in the culture and so on, so on."}, {"time": 5467, "text": "I guess the question here is sort of who has the agency?"}, {"time": 5472, "text": "So you might say, for instance, we don't want our algorithms to be racist."}, {"time": 5478, "text": "And facial recognition, some people have criticized some facial recognition systems as being racist because they're not as good on darker skin than lighter skin."}, {"time": 5491, "text": "But the agency there, the actual facial recognition algorithm isn't what has the agency."}, {"time": 5498, "text": "It's not the racist thing, right?"}, {"time": 5501, "text": "It's the, I don't know, the combination of the training data, the cameras being used, whatever."}, {"time": 5511, "text": "But my understanding of, and I agree with Bengio there that he, I think there are these value issues with our use of algorithms."}, {"time": 5522, "text": "But my understanding of what Russell's argument was is more that the machine itself has the agency now."}, {"time": 5534, "text": "It's the thing that's making the decisions and it's the thing that has what we would call values."}, {"time": 5542, "text": "So whether that's just a matter of degree, it's hard to say, right?"}, {"time": 5547, "text": "But I would say that's sort of qualitatively different than a face recognition neural network."}, {"time": 5554, "text": "And to broadly linger on that point, if you look at Elon Musk or Stuart Russell or Bostrom, people who are worried about existential risks of AI, however far into the future, the argument goes is it eventually happens."}, {"time": 5570, "text": "We don't know how far, but it eventually happens."}, {"time": 5573, "text": "Do you share any of those concerns and what kind of concerns in general do you have about AI that approach anything like existential threat to humanity?"}, {"time": 5586, "text": "So I would say, yes, it's possible, but I think there's a lot more closer in existential threats to humanity."}, {"time": 5595, "text": "As you said, like a hundred years for your time."}, {"time": 5598, "text": "It's more than a hundred years."}, {"time": 5600, "text": "More than a hundred years."}, {"time": 5601, "text": "Maybe even more than 500 years."}, {"time": 5604, "text": "So the existential threats are so far out that the future is, I mean, there'll be a million different technologies that we can't even predict now that will fundamentally change the nature of our behavior, reality, society, and so on before then."}, {"time": 5619, "text": "Yeah, I think so."}, {"time": 5621, "text": "And we have so many other pressing existential threats going on right now."}, {"time": 5626, "text": "Nuclear weapons even."}, {"time": 5627, "text": "Nuclear weapons, climate problems, poverty, possible pandemics."}, {"time": 5637, "text": "You can go on and on."}, {"time": 5639, "text": "And I think worrying about existential threat from AI is not the best priority for what we should be worrying about."}, {"time": 5653, "text": "That's kind of my view, because we're so far away."}, {"time": 5655, "text": "But I'm not necessarily criticizing Russell or Bostrom or whoever for worrying about that."}, {"time": 5666, "text": "And I think some people should be worried about it."}, {"time": 5669, "text": "It's certainly fine."}, {"time": 5670, "text": "But I was more getting at their view of what intelligence is."}, {"time": 5678, "text": "So I was more focusing on their view of superintelligence than just the fact of them worrying."}, {"time": 5689, "text": "And the title of the article was written by the New York Times editors."}, {"time": 5694, "text": "I wouldn't have called it that."}, {"time": 5695, "text": "We shouldn't be scared by superintelligence."}, {"time": 5699, "text": "If you wrote it, it'd be like we should redefine what you mean by superintelligence."}, {"time": 5702, "text": "I actually said something like superintelligence is not a sort of coherent idea."}, {"time": 5713, "text": "But that's not something the New York Times would put in."}, {"time": 5718, "text": "And the follow up argument that Yoshua makes also, not argument, but a statement, and I've heard him say it before."}, {"time": 5725, "text": "And I think I agree."}, {"time": 5727, "text": "He kind of has a very friendly way of phrasing it."}, {"time": 5730, "text": "It's good for a lot of people to believe different things."}, {"time": 5734, "text": "He's such a nice guy."}, {"time": 5737, "text": "But it's also practically speaking like we shouldn't be like, while your article stands, like Stuart Russell does amazing work."}, {"time": 5746, "text": "Bostrom does amazing work."}, {"time": 5748, "text": "You do amazing work."}, {"time": 5749, "text": "And even when you disagree about the definition of superintelligence or the usefulness of even the term, it's still useful to have people that like use that term, right?"}, {"time": 5761, "text": "And then argue."}, {"time": 5763, "text": "I absolutely agree with Benjo there."}, {"time": 5765, "text": "And I think it's great that, you know, and it's great that New York Times will publish all this stuff."}, {"time": 5771, "text": "It's an exciting time to be here."}, {"time": 5773, "text": "What do you think is a good test of intelligence?"}, {"time": 5776, "text": "Is natural language ultimately a test that you find the most compelling, like the original or the higher levels of the Turing test kind of?"}, {"time": 5788, "text": "Yeah, I still think the original idea of the Turing test is a good test for intelligence."}, {"time": 5796, "text": "I mean, I can't think of anything better."}, {"time": 5798, "text": "You know, the Turing test, the way that it's been carried out so far has been very impoverished, if you will."}, {"time": 5807, "text": "But I think a real Turing test that really goes into depth, like the one that I mentioned, I talk about in the book, I talk about Ray Kurzweil and Mitchell Kapoor have this bet, right?"}, {"time": 5819, "text": "That in 2029, I think is the date there, a machine will pass the Turing test and they have a very specific, like how many hours, expert judges and all of that."}, {"time": 5834, "text": "And, you know, Kurzweil says yes, Kapoor says no."}, {"time": 5837, "text": "We only have like nine more years to go to see."}, {"time": 5841, "text": "But I, you know, if something, a machine could pass that, I would be willing to call it intelligent."}, {"time": 5850, "text": "Of course, nobody will."}, {"time": 5853, "text": "They will say that's just a language model, if it does."}, {"time": 5857, "text": "So you would be comfortable, so language, a long conversation that, well, yeah, you're, I mean, you're right, because I think probably to carry out that long conversation, you would literally need to have deep common sense understanding of the world."}, {"time": 5874, "text": "And the conversation is enough to reveal that."}, {"time": 5879, "text": "So another super fun topic of complexity that you have worked on, written about."}, {"time": 5889, "text": "Let me ask the basic question."}, {"time": 5890, "text": "What is complexity?"}, {"time": 5892, "text": "So complexity is another one of those terms like intelligence."}, {"time": 5897, "text": "It's perhaps overused."}, {"time": 5898, "text": "But my book about complexity was about this wide area of complex systems, studying different systems in nature, in technology, in society in which you have emergence, kind of like I was talking about with intelligence."}, {"time": 5921, "text": "You know, we have the brain, which has billions of neurons."}, {"time": 5925, "text": "And each neuron individually could be said to be not very complex compared to the system as a whole."}, {"time": 5933, "text": "But the system, the interactions of those neurons and the dynamics, creates these phenomena that we call intelligence or consciousness, you know, that we consider to be very complex."}, {"time": 5948, "text": "So the field of complexity is trying to find general principles that underlie all these systems that have these kinds of emergent properties."}, {"time": 5959, "text": "And the emergence occurs from like underlying the complex system is usually simple, fundamental interactions."}, {"time": 5968, "text": "And the emergence happens when there's just a lot of these things interacting."}, {"time": 5975, "text": "Sort of what, and then most of science to date, can you talk about what is reductionism?"}, {"time": 5985, "text": "Well, reductionism is when you try and take a system and divide it up into its elements, whether those be cells or atoms or subatomic particles, whatever your field is, and then try and understand those elements."}, {"time": 6006, "text": "And then try and build up an understanding of the whole system by looking at sort of the sum of all the elements."}, {"time": 6013, "text": "So what's your sense?"}, {"time": 6015, "text": "Whether we're talking about intelligence or these kinds of interesting complex systems, is it possible to understand them in a reductionist way, which is probably the approach of most of science today, right?"}, {"time": 6029, "text": "I don't think it's always possible to understand the things we want to understand the most."}, {"time": 6035, "text": "So I don't think it's possible to look at single neurons and understand what we call intelligence, to look at sort of summing up, and sort of the summing up is the issue here."}, {"time": 6054, "text": "One example is that the human genome, right, so there was a lot of work on excitement about sequencing the human genome because the idea would be that we'd be able to find genes that underlies diseases."}, {"time": 6070, "text": "But it turns out that, and it was a very reductionist idea, you know, we figure out what all the parts are, and then we would be able to figure out which parts cause which things."}, {"time": 6082, "text": "But it turns out that the parts don't cause the things that we're interested in."}, {"time": 6085, "text": "It's like the interactions, it's the networks of these parts."}, {"time": 6090, "text": "And so that kind of reductionist approach didn't yield the explanation that we wanted."}, {"time": 6097, "text": "What do you, what do you use the most beautiful complex system that you've encountered?"}, {"time": 6103, "text": "The most beautiful."}, {"time": 6105, "text": "That you've been captivated by."}, {"time": 6107, "text": "Is it sort of, I mean, for me, is the simplest to be cellular automata."}, {"time": 6114, "text": "So I was very captivated by cellular automata and worked on cellular automata for several years."}, {"time": 6121, "text": "Do you find it amazing or is it surprising that such simple systems, such simple rules in cellular automata can create sort of seemingly unlimited complexity?"}, {"time": 6134, "text": "Yeah, that was very surprising to me."}, {"time": 6136, "text": "How do you make sense of it?"}, {"time": 6138, "text": "Is it just ultimately humbling or is there a hope to somehow leverage this into a deeper understanding and even able to engineer things like intelligence?"}, {"time": 6149, "text": "It's definitely humbling."}, {"time": 6151, "text": "How humbling in that also kind of awe inspiring that it's that awe inspiring like part of mathematics that these credibly simple rules can produce this very beautiful, complex, hard to understand behavior."}, {"time": 6170, "text": "And that's, it's mysterious, you know, and surprising still."}, {"time": 6178, "text": "But exciting because it does give you kind of the hope that you might be able to engineer complexity just from simple rules."}, {"time": 6189, "text": "Can you briefly say what is the Santa Fe Institute, its history, its culture, its ideas, its future?"}, {"time": 6194, "text": "So I've never, as I mentioned to you, I've never been, but it's always been this, in my mind, this mystical place where brilliant people study the edge of chaos."}, {"time": 6206, "text": "So the Santa Fe Institute was started in 1984 and it was created by a group of scientists, a lot of them from Los Alamos National Lab, which is about a 40 minute drive from Santa Fe Institute."}, {"time": 6225, "text": "They were mostly physicists and chemists, but they were frustrated in their field because they felt so that their field wasn't approaching kind of big interdisciplinary questions like the kinds we've been talking about."}, {"time": 6243, "text": "And they wanted to have a place where people from different disciplines could work on these big questions without sort of being siloed into physics, chemistry, biology, whatever."}, {"time": 6257, "text": "So they started this institute and this was people like George Cowen, who was a chemist in the Manhattan Project, and Nicholas Metropolis, a mathematician, physicist, Marie Gail Mann, physicist."}, {"time": 6277, "text": "So some really big names here."}, {"time": 6279, "text": "Ken Arrow, Nobel Prize winning economist, and they started having these workshops."}, {"time": 6287, "text": "And this whole enterprise kind of grew into this research institute that itself has been kind of on the edge of chaos its whole life because it doesn't have a significant endowment."}, {"time": 6303, "text": "And it's just been kind of living on whatever funding it can raise through donations and grants and however it can, you know, business associates and so on."}, {"time": 6321, "text": "But it's a great place."}, {"time": 6321, "text": "It's a really fun place to go think about ideas that you wouldn't normally encounter."}, {"time": 6328, "text": "I saw Sean Carroll, a physicist."}, {"time": 6328, "text": "Yeah, he's on the external faculty."}, {"time": 6334, "text": "And you mentioned that there's, so there's some external faculty and there's people that are... A very small group of resident faculty, maybe about 10 who are there for five year terms that can sometimes get renewed."}, {"time": 6348, "text": "And then they have some postdocs and then they have this much larger on the order of 100 external faculty or people like me who come and visit for various periods of time."}, {"time": 6359, "text": "So what do you think is the future of the Santa Fe Institute?"}, {"time": 6362, "text": "And if people are interested, like what's there in terms of the public interaction or students or so on that could be a possible interaction with the Santa Fe Institute or its ideas?"}, {"time": 6375, "text": "Yeah, so there's a few different things they do."}, {"time": 6378, "text": "They have a complex system summer school for graduate students and postdocs and sometimes faculty attend too."}, {"time": 6385, "text": "And that's a four week, very intensive residential program where you go and you listen to lectures and you do projects and people really like that."}, {"time": 6395, "text": "I mean, it's a lot of fun."}, {"time": 6397, "text": "They also have some specialty summer schools."}, {"time": 6401, "text": "There's one on computational social science."}, {"time": 6405, "text": "There's one on climate and sustainability, I think it's called."}, {"time": 6412, "text": "There's a few and then they have short courses where just a few days on different topics."}, {"time": 6419, "text": "They also have an online education platform that offers a lot of different courses and tutorials from SFI faculty."}, {"time": 6429, "text": "Including an introduction to complexity course that I taught."}, {"time": 6433, "text": "And there's a bunch of talks too online from the guest speakers and so on."}, {"time": 6439, "text": "They host a lot of... Yeah, they have sort of technical seminars and colloquia and they have a community lecture series like public lectures and they put everything on their YouTube channel so you can see it all."}, {"time": 6453, "text": "Watch it."}, {"time": 6454, "text": "Douglas Hofstadter, author of Ghetto Escherbach, was your PhD advisor."}, {"time": 6460, "text": "He mentioned a couple of times in collaborator."}, {"time": 6463, "text": "Do you have any favorite lessons or memories from your time working with him that continues to this day?"}, {"time": 6470, "text": "Just even looking back throughout your time working with him."}, {"time": 6475, "text": "One of the things he taught me was that when you're looking at a complex problem, to idealize it as much as possible to try and figure out what is the essence of this problem."}, {"time": 6491, "text": "And this is how the copycat program came into being was by taking analogy making and saying, how can we make this as idealized as possible but still retain really the important things we want to study?"}, {"time": 6505, "text": "And that's really been a core theme of my research, I think."}, {"time": 6513, "text": "And I continue to try and do that."}, {"time": 6516, "text": "And it's really very much kind of physics inspired."}, {"time": 6516, "text": "Hofstadter was a PhD in physics."}, {"time": 6522, "text": "That was his background."}, {"time": 6524, "text": "It's like first principles kind of thing."}, {"time": 6526, "text": "You're reduced to the most fundamental aspect of the problem so that you can focus on solving that fundamental aspect."}]}]