[{"title": "Scott Aaronson: Quantum Computing | Lex Fridman Podcast #72", "id": "uX5t8EivCaM", "quotes": [{"time": 393, "text": "So the ones you mentioned, right?"}, {"time": 395, "text": "Are we living in a simulation?"}, {"time": 398, "text": "Are we alone in the universe?"}, {"time": 401, "text": "How should we even think about such questions?"}, {"time": 404, "text": "Is the future determined, and what do we even mean by it being determined?"}, {"time": 409, "text": "Why are we alive at the time we are and not at some other time?"}, {"time": 415, "text": "And when you sort of contemplate the enormity of those questions, I think you could ask, well, then why be concerned with anything else, right?"}, {"time": 424, "text": "Why not spend your whole life on those questions?"}, {"time": 428, "text": "I think in some sense, that is the right way to phrase the question."}, {"time": 433, "text": "And actually, what we learned, I mean, throughout history, but really starting with the scientific revolution with Galileo and so on, is that there is a good reason to focus on narrower questions, more technical, mathematical or empirical questions."}, {"time": 453, "text": "And that is that you can actually make progress on them, and you can actually often answer them."}, {"time": 459, "text": "And sometimes they actually tell you something about the philosophical questions that sort of maybe motivated your curiosity as a child."}, {"time": 468, "text": "They don't necessarily resolve the philosophical questions, but sometimes they reframe your whole understanding of them, right?"}, {"time": 475, "text": "And so for me, philosophy is just the thing that you have in the background from the very beginning that you want to, these are sort of the reasons why you went into intellectual life in the first place, at least the reasons why I did, right?"}, {"time": 491, "text": "But math and science are tools that we have for actually making progress."}, {"time": 497, "text": "And hopefully even changing our understanding of these philosophical questions, sometimes even more than philosophy itself does."}, {"time": 506, "text": "Why do you think computer scientists avoid these questions?"}, {"time": 510, "text": "We'll run away from them a little bit, at least in a technical scientific discourse."}, {"time": 514, "text": "Well, I'm not sure if they do so more than any other scientists do."}, {"time": 519, "text": "I mean, Alan Turing was famously interested and his most famous, one of his two most famous papers was in a philosophy journal mind."}, {"time": 532, "text": "It was the one where he proposed the Turing test."}, {"time": 535, "text": "He took a Wittgenstein's course at Cambridge, argued with him."}, {"time": 541, "text": "I just recently learned that little bit and it's actually fascinating."}, {"time": 545, "text": "I was trying to look for resources in trying to understand where the sources of disagreement and debates between Wittgenstein and Turing were."}, {"time": 555, "text": "That's interesting that these two minds have somehow met in the arc of history."}, {"time": 560, "text": "Yeah, well, the transcript of the course, which was in 1939, right, is one of the more fascinating documents that I've ever read because Wittgenstein is trying to say, well, all of these formal systems are just complete irrelevancies, right?"}, {"time": 581, "text": "If a formal system is irrelevant, who cares?"}, {"time": 584, "text": "Why does that matter in real life, right?"}, {"time": 586, "text": "And Turing is saying, well, look, if you use an inconsistent formal system to design a bridge, the bridge may collapse, right?"}, {"time": 595, "text": "And so Turing, in some sense, is thinking decades ahead, you know, I think, of where Wittgenstein is, to where the formal systems are actually going to be used in computers, right, to actually do things in the world."}, {"time": 608, "text": "You know, and it's interesting that Turing actually dropped the course halfway through."}, {"time": 613, "text": "Because he had to go to Bletchley Park and work on something of more immediate importance."}, {"time": 619, "text": "Take a step from philosophy to actual, like the biggest possible step to actual engineering with actual real impact."}, {"time": 626, "text": "Yeah, and I would say more generally, right, a lot of scientists are interested in philosophy, but they're also busy, right?"}, {"time": 636, "text": "And they have a lot on their plate, and there are a lot of sort of very concrete questions that are already not answered, but look like they might be answerable, right?"}, {"time": 647, "text": "And so then you could say, well, then why break your brain over these metaphysically unanswerable questions when there were all of these answerable ones instead?"}, {"time": 659, "text": "So I think, you know, for me, I enjoy talking about philosophy."}, {"time": 666, "text": "I even go to philosophy conferences sometimes, such as the FQXI conferences."}, {"time": 672, "text": "I enjoy interacting with philosophers."}, {"time": 674, "text": "I would not want to be a professional philosopher because I like being in a field where I feel like, you know, if I get too confused about the sort of eternal questions, then I can actually make progress on something."}, {"time": 690, "text": "Can you maybe link on that for just a little longer?"}, {"time": 692, "text": "What do you think is the difference?"}, {"time": 694, "text": "So like the corollary of the criticism that I mentioned previously, that why ask the philosophical questions of the mathematician is if you want to ask philosophical questions, then invite a real philosopher on and ask them."}, {"time": 709, "text": "So what's the difference between the way a computer scientist or mathematician ponders a philosophical question and a philosopher ponders a philosophical question?"}, {"time": 717, "text": "Well, I mean, a lot of it just depends on the individual, right?"}, {"time": 721, "text": "It's hard to make generalizations about entire fields, but, you know, I think if we tried to, if we tried to stereotype, you know, we would say that scientists very often will be less careful in their use of words."}, {"time": 741, "text": "You know, I mean, philosophers are really experts in sort of, you know, like when I talk to them, they will just pounce if I, you know, use the wrong phrase for something."}, {"time": 750, "text": "Experts is a very nice word."}, {"time": 752, "text": "You could say sticklers."}, {"time": 754, "text": "Sticklers, yeah, yeah, yeah, or, you know, they will sort of interrogate my word choices, let's say, to a much greater extent than scientists would, right?"}, {"time": 762, "text": "And scientists, you know, will often, if you ask them about a philosophical problem, like the hard problem of consciousness or free will or whatever, they will try to relate it back to, you know, recent research, you know, research about neurobiology or, you know, the best of all is research that they personally are involved with, right?"}, {"time": 786, "text": "And, you know, of course they will want to talk about that, you know, and it is what they will think of, you know, and of course you could have an argument that maybe, you know, it's all interesting as it goes, but maybe none of it touches the philosophical question, right?"}, {"time": 800, "text": "But, you know, but maybe, you know, a science, you know, at least it, as I said, it does tell us concrete things."}, {"time": 809, "text": "And, you know, even if like a deep dive into neurobiology will not answer the hard problem of consciousness, you know, maybe it can take us about as far as we can get toward, you know, expanding our minds about it, you know, toward thinking about it in a different way."}, {"time": 828, "text": "Well, I mean, I think neurobiology can do that, but, you know, with these profound philosophical questions, I mean, also art and literature do that, right?"}, {"time": 836, "text": "They're all different ways of trying to approach these questions that, you know, we don't, for which we don't even know really what an answer would look like, but, and yet somehow we can't help, but keep returning to the questions."}, {"time": 847, "text": "And you have a kind of mathematical, beautiful mathematical way of discussing this with the idea of Q prime."}, {"time": 853, "text": "You write that usually the only way to make progress on the big questions, like the philosophical questions we're talking about now is to pick off smaller sub questions."}, {"time": 864, "text": "Ideally sub questions that you can attack using math, empirical observation, or both."}, {"time": 869, "text": "You define the idea of a Q prime."}, {"time": 871, "text": "So given an unanswerable philosophical riddle Q, replace it with a merely, in quotes, scientific or mathematical question Q prime, which captures part of what people have wanted to know when they first asked Q."}, {"time": 887, "text": "Then with luck, one solves Q prime."}, {"time": 889, "text": "So you described some examples of such Q prime sub questions in your long essay titled, Why Philosophers Should Care About Computational Complexity."}, {"time": 902, "text": "So you catalog the various Q primes on which you think theoretical computer science has made progress."}, {"time": 908, "text": "Can you mention a few favorites, if any pop to mind, or do you remember some?"}, {"time": 913, "text": "So, I mean, I would say some of the most famous examples in history of that sort of replacement were, I mean, to go back to Alan Turing, right?"}, {"time": 923, "text": "What he did in his computing machinery and intelligence paper was exactly, he explicitly started with the question, can machines think?"}, {"time": 933, "text": "And then he said, sorry, I think that question is too meaningless, but here's a different question."}, {"time": 940, "text": "Could you program a computer so that you couldn't tell the difference between it and a human, right?"}, {"time": 946, "text": "So in the very first few sentences, he in fact just formulates the Q prime question."}, {"time": 950, "text": "He does precisely that."}, {"time": 956, "text": "Where you had these philosophers arguing for centuries about the limits of mathematical reasoning, right?"}, {"time": 963, "text": "The limits of formal systems."}, {"time": 979, "text": "They have these definite rules."}, {"time": 981, "text": "Are there questions that we can phrase within the rules of these systems that are not provable within the rules of the systems?"}, {"time": 988, "text": "And can we prove that fact, right?"}, {"time": 990, "text": "And so that would be another example."}, {"time": 994, "text": "You know, I had this essay called The Ghost in the Quantum Turing Machine."}, {"time": 998, "text": "That was one of the crazier things I've written, but I tried to do something, or to advocate doing something similar there for free will, where instead of talking about is free will real, where we get hung up on the meaning of, what exactly do we mean by freedom?"}, {"time": 1017, "text": "And can you have, can you be, or do we mean compatibilist free will, libertarian free will?"}, {"time": 1023, "text": "What do these things mean?"}, {"time": 1025, "text": "You know, I suggested just asking the question, how well in principle, consistently with the laws of physics, could a person's behavior be predicted?"}, {"time": 1035, "text": "You know, without, so let's say, destroying the person's brain, you know, taking it apart in the process of trying to predict them."}, {"time": 1042, "text": "And, you know, and that actually, asking that question gets you into all sorts of meaty and interesting issues, you know, issues of, what is the computational substrate of the brain?"}, {"time": 1053, "text": "You know, or can you understand the brain, you know, just at the sort of level of the neurons, you know, at sort of the abstraction of a neural network, or do you need to go deeper to the, you know, molecular level and ultimately even to the quantum level?"}, {"time": 1068, "text": "Right, and of course, that would put limits on predictability if you did."}, {"time": 1072, "text": "So you need to reduce, you need to reduce the mind to a computational device, like formalize it so then you can make predictions about what, you know, whether you could predict the behavior of the system."}, {"time": 1083, "text": "Well, if you were trying to predict a person, yeah, then presumably, you would need some model of their brain, right?"}, {"time": 1089, "text": "And now the question becomes one of, how accurate can such a model become?"}, {"time": 1093, "text": "Can you make a model that will be accurate enough to really seriously threaten people's sense of free will?"}, {"time": 1101, "text": "You know, not just metaphysically, but like really, I have written in this envelope what you were going to say next."}, {"time": 1106, "text": "Is accuracy the right term here?"}, {"time": 1108, "text": "So it's also a level of abstraction has to be right."}, {"time": 1112, "text": "So if you're accurate at the, somehow at the quantum level, that may not be convincing to us at the human level."}, {"time": 1122, "text": "Well, right, but the question is what accuracy at the sort of level of the underlying mechanisms do you need in order to predict the behavior, right?"}, {"time": 1132, "text": "At the end of the day, the test is just, can you, you know, foresee what the person is going to do?"}, {"time": 1137, "text": "Right, I am, you know, and in discussions of free will, you know, it seems like both sides wanna, you know, very quickly dismiss that question as irrelevant."}, {"time": 1149, "text": "Well, to me, it's totally relevant."}, {"time": 1151, "text": "Okay, because, you know, if someone says, oh, well, you know, a Laplace demon that knew the complete state of the universe, you know, could predict everything you're going to do, therefore you don't have free will."}, {"time": 1164, "text": "You know, it doesn't trouble me that much because, well, you know, I've never met such a demon, right?"}, {"time": 1169, "text": "You know, and we, you know, we even have some reasons to think, you know, maybe, you know, it could not exist as part of our world, you know, it's only an abstraction, a thought experiment."}, {"time": 1180, "text": "On the other hand, if someone said, well, you know, I have this brain scanning machine, you know, you step into it and then, you know, every paper that you will ever write, it will write, you know, every thought that you will have, you know, even right now about the machine itself, it will foresee."}, {"time": 1195, "text": "You know, well, if you can actually demonstrate that, then I think, you know, that sort of threatens my internal sense of having free will in a much more visceral way."}, {"time": 1206, "text": "You know, but now you notice that we're asking a much more empirical question."}, {"time": 1211, "text": "We're asking, is such a machine possible or isn't it?"}, {"time": 1214, "text": "We're asking, if it's not possible, then what in the laws of physics or what about the behavior of the brain, you know, prevents it from existing?"}, {"time": 1222, "text": "So if you could philosophize a little bit within this empirical question, where do you think would enter the, by which mechanism would enter the possibility that we can't predict the outcome?"}, {"time": 1235, "text": "So there would be something that would be akin to a free will."}, {"time": 1238, "text": "Yeah, well, you could say the sort of obvious possibility, which was, you know, recognized by Eddington and many others about as soon as quantum mechanics was discovered in the 1920s, was that if, you know, let's say a sodium ion channel, you know, in the brain, right?"}, {"time": 1260, "text": "You know, its behavior is chaotic, right?"}, {"time": 1270, "text": "Which are differential equations that have a stochastic component, right?"}, {"time": 1274, "text": "Now, where does, you know, and this ultimately governs, let's say whether a neuron will fire or not fire, right?"}, {"time": 1279, "text": "So that's the basic chemical process or electrical process by which signals are sent in the brain."}, {"time": 1285, "text": "And, you know, and so you could ask, well, where does the randomness in the process, you know, that neuroscientists, or what neuroscientists would treat as randomness, where does it come from?"}, {"time": 1299, "text": "You know, ultimately it's thermal noise, right?"}, {"time": 1301, "text": "Where does thermal noise come from?"}, {"time": 1303, "text": "But ultimately, you know, there were some quantum mechanical events at the molecular level that are getting sort of chaotically amplified by, you know, a sort of butterfly effect."}, {"time": 1313, "text": "And so, you know, even if you knew the complete quantum state of someone's brain, you know, at best you could predict the probabilities that they would do one thing or do another thing, right?"}, {"time": 1325, "text": "I think that part is actually relatively uncontroversial, right?"}, {"time": 1329, "text": "The controversial question is whether any of it matters for the sort of philosophical questions that we care about."}, {"time": 1336, "text": "Because you could say, if all it's doing is just injecting some randomness into an otherwise completely mechanistic process, well, then who cares, right?"}, {"time": 1345, "text": "And more concretely, if you could build a machine that, you know, could just calculate even just the probabilities of all of the possible things that you would do, right?"}, {"time": 1355, "text": "And, you know, of all the things that said you had a 10% chance of doing, you did exactly a 10th of them, you know, and so on and so on."}, {"time": 1365, "text": "And that somehow also takes away the feeling of free will."}, {"time": 1369, "text": "I mean, to me, it seems essentially just as bad as if the machine deterministically predicted you."}, {"time": 1374, "text": "It seems, you know, hardly different from that."}, {"time": 1377, "text": "So then, but a more subtle question is could you even learn enough about someone's brain to do that, okay?"}, {"time": 1386, "text": "Because, you know, another central fact about quantum mechanics is that making a measurement on a quantum state is an inherently destructive operation."}, {"time": 1398, "text": "Okay, so, you know, if I want to measure the, you know, position of a particle, right?"}, {"time": 1403, "text": "It was, well, before I measured, it had a superposition over many different positions."}, {"time": 1408, "text": "As soon as I measure, I localize it, right?"}, {"time": 1410, "text": "So now I know the position, but I've also fundamentally changed the state."}, {"time": 1415, "text": "And so you could say, well, maybe in trying to build a model of someone's brain that was accurate enough to actually, you know, make, let's say, even well calibrated probabilistic predictions of their future behavior, maybe you would have to make measurements that were just so accurate that you would just fundamentally alter their brain, okay?"}, {"time": 1436, "text": "Or maybe not, maybe you only, you know, it would suffice to just make some nanorobots that just measured some sort of much larger scale, you know, macroscopic behavior, like, you know, what is this neuron doing?"}, {"time": 1450, "text": "What is that neuron doing?"}, {"time": 1452, "text": "Maybe that would be enough."}, {"time": 1453, "text": "See, but now, you know, what I claim is that we're now asking a question, you know, in which, you know, it is possible to envision what progress on it would look like."}, {"time": 1464, "text": "Yeah, but just as you said, that question may be slightly detached from the philosophical question in the sense if consciousness somehow has a role to the experience of free will."}, {"time": 1476, "text": "Because ultimately, when we're talking about free will, we're also talking about not just the predictability of our actions, but somehow the experience of that predictability."}, {"time": 1486, "text": "Yeah, well, I mean, a lot of philosophical questions ultimately, like, feedback to the hard problem of consciousness, you know, and as much as you can try to sort of talk around it or not, right?"}, {"time": 1497, "text": "And, you know, and there is a reason why people try to talk around it, which is that, you know, Democritus talked about the hard problem of consciousness, you know, in 400 BC in terms that would be totally recognizable to us today, right?"}, {"time": 1513, "text": "And it's really not clear if there's been progress since or what progress could possibly consist of."}, {"time": 1519, "text": "Is there a Q prime type of subquestion that could help us get at consciousness?"}, {"time": 1524, "text": "It's something about consciousness."}, {"time": 1525, "text": "Well, I mean, well, I mean, there is the whole question of, you know, of AI, right?"}, {"time": 1529, "text": "Of, you know, can you build a human level or superhuman level AI?"}, {"time": 1535, "text": "And, you know, can it work in a completely different substrate from the brain?"}, {"time": 1540, "text": "I mean, you know, and of course, that was Alan Turing's point."}, {"time": 1543, "text": "And, you know, and even if that was done, it's, you know, maybe people would still argue about the hard problem of consciousness, right?"}, {"time": 1549, "text": "And yet, you know, my claim is a little different."}, {"time": 1553, "text": "My claim is that in a world where, you know, there were, you know, human level AIs or we'd been even overtaken by such AIs, the entire discussion of the hard problem of consciousness would have a different character, right?"}, {"time": 1567, "text": "It would take place in different terms in such a world, even if we hadn't answered the question."}, {"time": 1572, "text": "And my claim about free will would be similar, right?"}, {"time": 1575, "text": "That if this prediction machine that I was talking about could actually be built, well, now the entire discussion of the, you know, of free will is sort of transformed by that, you know, even if in some sense the metaphysical question hasn't been answered."}, {"time": 1591, "text": "Yeah, exactly, it transforms it fundamentally because say that machine does tell you that it can predict perfectly and yet there is this deep experience of free will and then that changes the question completely."}, {"time": 1603, "text": "And it starts actually getting to the question of the AGI, the touring questions of the demonstration of free will, the demonstration of intelligence, the demonstration of consciousness, does that equal consciousness, intelligence and free will?"}, {"time": 1622, "text": "But see, Alex, if every time I was contemplating a decision, you know, this machine had printed out an envelope, you know, where I could open it and see that it knew my decision, I think that actually would change my subjective experience of making decisions, right?"}, {"time": 1638, "text": "I mean, it would."}, {"time": 1639, "text": "Does knowledge change your subjective experience?"}, {"time": 1640, "text": "Well, you know, I mean, the knowledge that this machine had predicted everything I would do, I mean, it might drive me completely insane, right?"}, {"time": 1647, "text": "But at any rate, it would change my experience to act, you know, to not just discuss such a machine as a thought experiment, but to actually see it."}, {"time": 1659, "text": "I mean, you know, you could say at that point, you know, you could say, you know, why not simply call this machine a second instantiation of me and be done with it, right?"}, {"time": 1669, "text": "What, you know, why even privilege the original me over this perfect duplicate that exists in the machine?"}, {"time": 1676, "text": "Yeah, or there could be a religious experience with it too."}, {"time": 1680, "text": "It's kind of what God throughout the generations is supposed to have."}, {"time": 1683, "text": "That God kind of represents that perfect machine, is able to, I guess, actually, well, I don't even know what are the religious interpretations of free will."}, {"time": 1697, "text": "So if God knows perfectly everything in religion, in the various religions, where does free will fit into that?"}, {"time": 1706, "text": "Do you know?"}, {"time": 1707, "text": "That has been one of the big things that theologians have argued about for thousands of years."}, {"time": 1713, "text": "You know, I am not a theologian, so maybe I shouldn't go there."}, {"time": 1716, "text": "So there's not a clear answer in a book like..."}, {"time": 1718, "text": "I mean, this is, you know, the Calvinists debated this, the, you know, this has been, you know, I mean, different religious movements have taken different positions on that question, but that is how they think about it."}, {"time": 1730, "text": "You know, meanwhile, you know, a large part of sort of what animates, you know, theoretical computer science, you could say is, you know, we're asking sort of, what are the ultimate limits of, you know, what you can know or, you know, calculate or figure out by, you know, entities that you can actually build in the physical world, right?"}, {"time": 1749, "text": "And if I were trying to explain it to a theologian, maybe I would say, you know, we are studying, you know, to what extent, you know, gods can be made manifest in the physical world."}, {"time": 1759, "text": "I'm not sure my colleagues would like that."}, {"time": 1761, "text": "So let's talk about quantum computers for a second."}, {"time": 1765, "text": "Yeah, sure, sure."}, {"time": 1767, "text": "As you've said, quantum computing, at least in the 1990s, was a profound story at the intersection of computer science, physics, engineering, math, and philosophy."}, {"time": 1776, "text": "So there's this broad and deep aspect to quantum computing that represents more than just the quantum computer."}, {"time": 1782, "text": "But can we start at the very basics?"}, {"time": 1785, "text": "What is quantum computing?"}, {"time": 1787, "text": "Yeah, so it's a proposal for a new type of computation, or let's say a new way to harness nature to do computation that is based on the principles of quantum mechanics."}, {"time": 1799, "text": "Okay, now the principles of quantum mechanics have been in place since 1926."}, {"time": 1805, "text": "You know, they haven't changed."}, {"time": 1807, "text": "You know, what's new is, you know, how we wanna use them."}, {"time": 1810, "text": "Okay, so what does quantum mechanics say about the world?"}, {"time": 1815, "text": "You know, the physicists, I think, over the generations, you know, convinced people that that is an unbelievably complicated question and, you know, just give up on trying to understand it."}, {"time": 1825, "text": "I can let you in, not being a physicist, I can let you in on a secret, which is that it becomes a lot simpler if you do what we do in quantum information theory and sort of take the physics out of it."}, {"time": 1837, "text": "So the way that we think about quantum mechanics is sort of as a generalization of the rules of probability themselves."}, {"time": 1845, "text": "So, you know, you might say there was a 30% chance that it was going to snow today or something."}, {"time": 1852, "text": "You would never say that there was a negative 30% chance, right, that would be nonsense."}, {"time": 1857, "text": "Much less would you say that there was, you know, an I% chance, you know, square root of minus 1% chance."}, {"time": 1863, "text": "Now, the central discovery that sort of quantum mechanics made is that fundamentally the world is described by, or, you know, the sort of, let's say the possibilities for, you know, what a system could be doing are described using numbers called amplitudes, okay, which are like probabilities in some ways, but they are not probabilities."}, {"time": 1890, "text": "They can be positive."}, {"time": 1891, "text": "For one thing, they can be positive or negative."}, {"time": 1894, "text": "In fact, they can even be complex numbers."}, {"time": 1897, "text": "Okay, and if you've heard of a quantum superposition, this just means some state of affairs where you assign an amplitude, one of these complex numbers, to every possible configuration that you could see a system in on measuring it."}, {"time": 1913, "text": "So for example, you might say that an electron has some amplitude for being here and some other amplitude for being there, right?"}, {"time": 1922, "text": "Now, if you look to see where it is, you will localize it, right?"}, {"time": 1926, "text": "You will sort of force the amplitudes to be converted into probabilities."}, {"time": 1932, "text": "That happens by taking their squared absolute value, okay, and then, you know, you can say either the electron will be here or it will be there."}, {"time": 1942, "text": "And, you know, knowing the amplitudes, you can predict at least the probabilities that you'll see each possible outcome, okay?"}, {"time": 1949, "text": "But while a system is isolated from the whole rest of the universe, the rest of its environment, the amplitudes can change in time by rules that are different from the normal rules of probability and that are, you know, alien to our everyday experience."}, {"time": 1967, "text": "So anytime anyone ever tells you anything about the weirdness of the quantum world, you know, or assuming that they're not lying to you, right, they are telling you, you know, yet another consequence of nature being described by these amplitudes."}, {"time": 1983, "text": "So most famously, what amplitudes can do is that they can interfere with each other, okay?"}, {"time": 1988, "text": "So in the famous double slit experiment, what happens is that you shoot a particle, like an electron, let's say, at a screen with two slits in it, and you find that there are, you know, on a second screen, now there are certain places where that electron will never end up, you know, after it passes through the first screen."}, {"time": 2009, "text": "And yet, if I close off one of the slits, then the electron can appear in that place, okay?"}, {"time": 2015, "text": "So by decreasing the number of paths that the electron could take to get somewhere, you can increase the chance that it gets there, okay?"}, {"time": 2023, "text": "Now, how is that possible?"}, {"time": 2025, "text": "Well, it's because, you know, as we would say now, the electron has a superposition state, okay?"}, {"time": 2031, "text": "It has some amplitude for reaching this point by going through the first slit."}, {"time": 2037, "text": "It has some other amplitude for reaching it by going through the second slit."}, {"time": 2041, "text": "But now, if one amplitude is positive and the other one is negative, then, you know, I have to add them all up, right?"}, {"time": 2047, "text": "I have to add the amplitudes for every path that the electron could have taken to reach this point."}, {"time": 2053, "text": "And those amplitudes, if they're pointing in different directions, they can cancel each other out."}, {"time": 2059, "text": "That would mean the total amplitude is zero and the thing never happens at all."}, {"time": 2064, "text": "I close off one of the possibilities, then the amplitude is positive or it's negative, and now the thing can happen."}, {"time": 2070, "text": "Okay, so that is sort of the one trick of quantum mechanics."}, {"time": 2073, "text": "And now I can tell you what a quantum computer is."}, {"time": 2076, "text": "Okay, a quantum computer is a computer that tries to exploit, you know, exactly these phenomena, superposition, amplitudes, and interference, in order to solve certain problems much faster than we know how to solve them otherwise."}, {"time": 2094, "text": "So the basic building block of a quantum computer is what we call a quantum bit or a qubit."}, {"time": 2099, "text": "That just means a bit that has some amplitude for being zero and some other amplitude for being one."}, {"time": 2105, "text": "So it's a superposition of zero and one states, right?"}, {"time": 2109, "text": "But now the key point is that if I've got, let's say, a thousand qubits, the rules of quantum mechanics are completely unequivocal that I do not just need one ampli... You know, I don't just need amplitudes for each qubit separately."}, {"time": 2123, "text": "Okay, in general, I need an amplitude for every possible setting of all thousand of those bits, okay?"}, {"time": 2130, "text": "So that what that means is two to the one thousand power amplitudes."}, {"time": 2134, "text": "Okay, if I had to write those down, or let's say in the memory of a conventional computer, if I had to write down two to the one thousand complex numbers, that would not fit within the entire observable universe."}, {"time": 2147, "text": "Okay, and yet, you know, quantum mechanics is unequivocal that if these qubits can all interact with each other, and in some sense, I need two to the one thousand parameters, you know, amplitudes to describe what is going on."}, {"time": 2161, "text": "Now, you know, now I can tell, you know, where all the popular articles, you know, about quantum computing go off the rails is that they say, you know, they sort of say what I just said, and then they say, oh, so the way a quantum computer works is just by trying every possible answer in parallel."}, {"time": 2177, "text": "You know, that sounds too good to be true, and unfortunately, it kind of is too good to be true."}, {"time": 2184, "text": "The problem is I could make a superposition over every possible answer to my problem, you know, even if there are two to the one thousand of them, right?"}, {"time": 2194, "text": "I can easily do that."}, {"time": 2195, "text": "The trouble is for a computer to be useful, you've got to, at some point, you've got to look at it and see an output, right?"}, {"time": 2202, "text": "And if I just measure a superposition over every possible answer, then the rules of quantum mechanics tell me that all I'll see will be a random answer."}, {"time": 2211, "text": "You know, if I just wanted a random answer, well, I could have picked one myself with a lot less trouble, right?"}, {"time": 2216, "text": "So the entire trick with quantum computing, with every algorithm for a quantum computer, is that you try to choreograph a pattern of interference of amplitudes, and you try to do it so that for each wrong answer, some of the paths leading to that wrong answer have positive amplitudes and others have negative amplitudes."}, {"time": 2237, "text": "So on the whole, they cancel each other out, okay?"}, {"time": 2240, "text": "Whereas all the paths leading to the right answer should reinforce each other, you know, should have amplitudes pointing the same direction."}, {"time": 2248, "text": "So the design of algorithms in the space is the choreography of the interferences."}, {"time": 2253, "text": "That's precisely what it is."}, {"time": 2255, "text": "Can we take a brief step back?"}, {"time": 2256, "text": "And you mentioned information."}, {"time": 2260, "text": "So in which part of this beautiful picture that you've painted is information contained?"}, {"time": 2266, "text": "Oh, well, information is at the core of everything that we've been talking about, right?"}, {"time": 2271, "text": "I mean, the bit is, you know, the basic unit of information since, you know, Claude Shannon's paper in 1948."}, {"time": 2278, "text": "You know, and, you know, of course, you know, people had the concept even before that, you know, he popularized the name, right?"}, {"time": 2285, "text": "But I mean..."}, {"time": 2285, "text": "But a bit is zero or one."}, {"time": 2288, "text": "So that's a basic element of information."}, {"time": 2289, "text": "And what we would say is that the basic unit of quantum information is the qubit, is, you know, the object, any object that can be maintained in this, or manipulated, in a superposition of zero and one states."}, {"time": 2304, "text": "Now, you know, sometimes people ask, well, but what is a qubit physically, right?"}, {"time": 2309, "text": "And there are all these different, you know, proposals that are being pursued in parallel for how you implement qubits."}, {"time": 2316, "text": "There is, you know, superconducting quantum computing that was in the news recently because of Google's quantum supremacy experiment, right?"}, {"time": 2324, "text": "Where you would have some little coils where a current can flow through them in two different energy states, one representing a zero, another representing a one."}, {"time": 2337, "text": "And if you cool these coils to just slightly above absolute zero, like a hundredth of a degree, then they superconduct."}, {"time": 2345, "text": "And then the current can actually be in a superposition of the two different states."}, {"time": 2350, "text": "So that's one kind of qubit."}, {"time": 2352, "text": "Another kind would be, you know, just an individual atomic nucleus, right?"}, {"time": 2357, "text": "It has a spin."}, {"time": 2358, "text": "It could be spinning clockwise."}, {"time": 2360, "text": "It could be spinning counterclockwise, or it could be in a superposition of the two spin states."}, {"time": 2365, "text": "That is another qubit."}, {"time": 2367, "text": "But see, just like in the classical world, right?"}, {"time": 2370, "text": "You could be a virtuoso programmer without having any idea of what a transistor is, right?"}, {"time": 2376, "text": "Or how the bits are physically represented inside the machine, even that the machine uses electricity, right?"}, {"time": 2383, "text": "You just care about the logic."}, {"time": 2384, "text": "It's sort of the same with quantum computing, right?"}, {"time": 2387, "text": "Qubits could be realized by many, many different quantum systems."}, {"time": 2391, "text": "And yet all of those systems will lead to the same logic, you know, the logic of qubits and how, you know, how you measure them, how you change them over time."}, {"time": 2401, "text": "And so, you know, the subject of, you know, how qubits behave and what you can do with qubits, that is quantum information."}, {"time": 2409, "text": "So just to linger on that."}, {"time": 2411, "text": "So the physical design implementation of a qubit does not interfere with the, that next level of abstraction that you can program over it."}, {"time": 2422, "text": "So it truly is, the idea of it is, okay."}, {"time": 2427, "text": "Well, to be honest with you, today they do interfere with each other."}, {"time": 2430, "text": "That's because all the quantum computers we can build today are very noisy, right?"}, {"time": 2435, "text": "And so sort of the, you know, the qubits are very far from perfect."}, {"time": 2440, "text": "And so the lower level sort of does affect the higher levels."}, {"time": 2443, "text": "And we sort of have to think about all of them at once."}, {"time": 2446, "text": "Okay, but eventually where we hope to get is to what are called error corrected quantum computers, where the qubits really do behave like perfect abstract qubits for as long as we want them to."}, {"time": 2458, "text": "And in that future, you know, a future that we can already sort of prove theorems about or think about today."}, {"time": 2466, "text": "But in that future, the logic of it really does become decoupled from the hardware."}, {"time": 2471, "text": "So if noise is currently like the biggest problem for quantum computing, and then the dream is error correcting quantum computers, can you just maybe describe what does it mean for there to be noise in the system?"}, {"time": 2488, "text": "Absolutely, so yeah, so the problem is even a little more specific than noise."}, {"time": 2493, "text": "So the fundamental problem, if you're trying to actually build a quantum computer, you know, of any appreciable size, is something called decoherence."}, {"time": 2503, "text": "Okay, and this was recognized from the very beginning, you know, when people first started thinking about this in the 1990s."}, {"time": 2509, "text": "Now, what decoherence means is sort of the unwanted interaction between, you know, your qubits, you know, the state of your quantum computer and the external environment."}, {"time": 2521, "text": "Okay, and why is that such a problem?"}, {"time": 2523, "text": "Well, I talked before about how, you know, when you measure a quantum system, so let's say if I measure a qubit that's in a superposition of zero and one states to ask it, you know, are you zero or are you one?"}, {"time": 2534, "text": "Well, now I force it to make up its mind, right?"}, {"time": 2537, "text": "And now, probabilistically, it chooses one or the other and now, you know, it's no longer a superposition, there's no longer amplitudes, there's just, there's some probability that I get a zero and there's some that I get a one."}, {"time": 2549, "text": "And now, the trouble is that it doesn't have to be me who's looking, okay?"}, {"time": 2556, "text": "Or in fact, it doesn't have to be any conscious entity."}, {"time": 2591, "text": "It is, you know, the state has now collapsed."}, {"time": 2595, "text": "You know, another way to say it is that it's become entangled with its environment, okay?"}, {"time": 2599, "text": "But, you know, from the perspective of someone who's just looking at this qubit, it is as though it has lost its quantum state."}, {"time": 2606, "text": "And so, what this means is that if I want to do a quantum computation, I have to keep the qubits sort of fanatically well isolated from their environment."}, {"time": 2617, "text": "But then at the same time, they can't be perfectly isolated because I need to tell them what to do."}, {"time": 2622, "text": "I need to make them interact with each other, for one thing, and not only that, but in a precisely choreographed way, okay?"}, {"time": 2630, "text": "And, you know, that is such a staggering problem, right?"}, {"time": 2633, "text": "How do I isolate these qubits from the whole universe but then also tell them exactly what to do?"}, {"time": 2638, "text": "I mean, you know, there were distinguished physicists and computer scientists in the 90s who said, this is fundamentally impossible, you know?"}, {"time": 2647, "text": "The laws of physics will just never let you control qubits to the degree of accuracy that you're talking about."}, {"time": 2654, "text": "Now, what changed the views of most of us was a profound discovery in the mid to late 90s which was called the theory of quantum error correction and quantum fault tolerance, okay?"}, {"time": 2667, "text": "And the upshot of that theory is that if I want to build a reliable quantum computer and scale it up to, you know, an arbitrary number of as many qubits as I want, you know, and doing as much on them as I want, I do not actually have to get the qubits perfectly isolated from their environment."}, {"time": 2686, "text": "It is enough to get them really, really, really well isolated, okay?"}, {"time": 2690, "text": "And even if every qubit is sort of leaking, you know, its state into the environment at some rate, as long as that rate is low enough, okay, I can sort of encode the information that I care about in very clever ways across the collective states of multiple qubits, okay?"}, {"time": 2710, "text": "In such a way that even if, you know, a small percentage of my qubits leak, well, I'm constantly monitoring them to see if that leak happened."}, {"time": 2718, "text": "I can detect it and I can correct it."}, {"time": 2720, "text": "I can recover the information I care about from the remaining qubits, okay?"}, {"time": 2725, "text": "And so, you know, you can build a reliable quantum computer even out of unreliable parts, right?"}, {"time": 2732, "text": "Now, in some sense, you know, that discovery is what set the engineering agenda for quantum computing research from the 1990s until the present, okay?"}, {"time": 2743, "text": "The goal has been, you know, engineer qubits that are not perfectly reliable but reliable enough that you can then use these error correcting codes to have them simulate qubits that are even more reliable than they are, right?"}, {"time": 2758, "text": "The error correction becomes a net win rather than a net loss, right?"}, {"time": 2762, "text": "And then once you reach that sort of crossover point, then, you know, your simulated qubits could in turn simulate qubits that are even more reliable and so on until you've just, you know, effectively, you have arbitrarily reliable qubits."}, {"time": 2777, "text": "So long story short, we are not at that breakeven point yet."}, {"time": 2780, "text": "We're a hell of a lot closer than we were when people started doing this in the 90s, like orders of magnitude closer."}, {"time": 2786, "text": "But the key ingredient there is the more qubits, the better because... Ah, well, the more qubits, the larger the computation you can do, right?"}, {"time": 2795, "text": "I mean, qubits are what constitute the memory of your quantum computer, right?"}, {"time": 2800, "text": "But also for the, sorry, for the error correcting mechanism."}, {"time": 2804, "text": "So the way I would say it is that error correction imposes an overhead in the number of qubits."}, {"time": 2810, "text": "And that is actually one of the biggest practical problems with building a scalable quantum computer."}, {"time": 2815, "text": "If you look at the error correcting codes, at least the ones that we know about today, and you look at, you know, what would it take to actually use a quantum computer to, you know, hack your credit card number, which is, you know, maybe, you know, the most famous application people talk about, right?"}, {"time": 2833, "text": "Let's say to factor huge numbers and thereby break the RSA cryptosystem."}, {"time": 2837, "text": "Well, what that would take would be thousands of, several thousand logical qubits."}, {"time": 2843, "text": "But now with the known error correcting codes, each of those logical qubits would need to be encoded itself using thousands of physical qubits."}, {"time": 2852, "text": "So at that point, you're talking about millions of physical qubits."}, {"time": 2855, "text": "And in some sense, that is the reason why quantum computers are not breaking cryptography already."}, {"time": 2860, "text": "It's because of these immense overheads involved."}, {"time": 2863, "text": "So that overhead is additive or multiplicative?"}, {"time": 2866, "text": "Well, it's multiplicative."}, {"time": 2867, "text": "I mean, it's like you take the number of logical qubits that you need in your abstract quantum circuit, you multiply it by a thousand or so."}, {"time": 2876, "text": "So, you know, there's a lot of work on, you know, inventing better, trying to invent better error correcting codes."}, {"time": 2882, "text": "Okay, that is the situation right now."}, {"time": 2884, "text": "In the meantime, we are now in, what the physicist John Preskill called the noisy intermediate scale quantum or NISQ era."}, {"time": 2893, "text": "And this is the era, you can think of it as sort of like the vacuum, you know, we're now entering the very early vacuum tube era of quantum computers."}, {"time": 2901, "text": "The quantum computer analog of the transistor has not been invented yet, right?"}, {"time": 2906, "text": "That would be like true error correction, right?"}, {"time": 2909, "text": "Where, you know, we are not or something else that would achieve the same effect, right?"}, {"time": 2913, "text": "We are not there yet."}, {"time": 2917, "text": "But where we are now, let's say as of a few months ago, you know, as of Google's announcement of quantum supremacy, you know, we are now finally at the point where even with a non error corrected quantum computer, with, you know, these noisy devices, we can do something that is hard for classical computers to simulate, okay?"}, {"time": 2936, "text": "So we can eke out some advantage."}, {"time": 2938, "text": "Now, will we in this noisy era be able to do something beyond what a classical computer can do that is also useful to someone?"}, {"time": 2946, "text": "That we still don't know."}, {"time": 2947, "text": "People are going to be racing over the next decade to try to do that."}, {"time": 2951, "text": "By people, I mean, Google, IBM, you know, a bunch of startup companies."}, {"time": 2956, "text": "And research labs."}, {"time": 2958, "text": "Yeah, and research labs and governments."}, {"time": 2962, "text": "You just mentioned a million things."}, {"time": 2963, "text": "Well, I'll backtrack for a second."}, {"time": 2967, "text": "So we're in these vacuum tube days."}, {"time": 2969, "text": "Yeah, just entering them."}, {"time": 2971, "text": "And just entering, wow."}, {"time": 2972, "text": "Okay, so how do we escape the vacuum?"}, {"time": 2976, "text": "So how do we get to, how do we get to where we are now with the CPU?"}, {"time": 2982, "text": "Is this a fundamental engineering challenge?"}, {"time": 2984, "text": "Is there breakthroughs on the physics side that are needed on the computer science side?"}, {"time": 2993, "text": "Or is it a financial issue where much larger just sheer investment and excitement is needed?"}, {"time": 3001, "text": "So, you know, those are excellent questions."}, {"time": 3003, "text": "My guess might, well, no, no."}, {"time": 3005, "text": "My guess would be all of the above."}, {"time": 3009, "text": "I mean, my guess, you know, I mean, you could say fundamentally it is an engineering issue, right?"}, {"time": 3015, "text": "The theory has been in place since the 90s."}, {"time": 3017, "text": "You know, at least, you know, this is what, you know, error correction would look like."}, {"time": 3023, "text": "You know, we do not have the hardware that is at that level."}, {"time": 3026, "text": "But at the same time, you know, so you could just, you know, try to power through, you know, maybe even like, you know, if someone spent a trillion dollars on some quantum computing Manhattan project, right?"}, {"time": 3039, "text": "Then conceivably they could just, you know, build an error corrected quantum computer as it was envisioned back in the 90s, right?"}, {"time": 3049, "text": "I think the more plausible thing to happen is that there will be further theoretical breakthroughs and there will be further insights that will cut down the cost of doing this."}, {"time": 3059, "text": "So let's take a brief step to the philosophical."}, {"time": 3062, "text": "I just recently talked to Jim Keller who's sort of like the famed architect in the microprocessor world."}, {"time": 3072, "text": "And he's been told for decades, every year that the Moore's law is going to die this year."}, {"time": 3080, "text": "And he tries to argue that the Moore's law is still alive and well, and it'll be alive for quite a long time to come."}, {"time": 3089, "text": "How long did he say?"}, {"time": 3090, "text": "Well, the main point is it's still alive, but he thinks there's still a thousand X improvement just on shrinking the transition that's possible."}, {"time": 3101, "text": "The point is that the exponential growth we see is actually a huge number of these S curves, just constant breakthroughs."}, {"time": 3111, "text": "At the philosophical level, why do you think we as descendants of apes were able to just keep coming up with these new breakthroughs on the CPU side is this something unique to this particular endeavor or will it be possible to replicate in the quantum computer space?"}, {"time": 3132, "text": "There was a lot there, but to break off something, I mean, I think we are in an extremely special period of human history, right?"}, {"time": 3142, "text": "I mean, it is, you could say, obviously special in many ways, right?"}, {"time": 3148, "text": "There are way more people alive than there have been and the whole future of the planet is in question in a way that it hasn't been for the rest of human history."}, {"time": 3166, "text": "But in particular, we are in the era where we finally figured out how to build universal machines, you could say, the things that we call computers, machines that you program to simulate the behavior of whatever machine you want."}, {"time": 3187, "text": "And once you've sort of crossed this threshold of universality, you've built, you could say, touring, you've instantiated touring machines in the physical world."}, {"time": 3200, "text": "Well, then the main questions are ones of numbers."}, {"time": 3203, "text": "They are ones of how much memory can you access?"}, {"time": 3209, "text": "How fast does it run?"}, {"time": 3211, "text": "How many parallel processors?"}, {"time": 3213, "text": "At least until quantum computing."}, {"time": 3214, "text": "Quantum computing is the one thing that changes what I just said, right?"}, {"time": 3218, "text": "But as long as it's classical computing, then it's all questions of numbers."}, {"time": 3224, "text": "And you could say at a theoretical level, the computers that we have today are the same as the ones in the 50s."}, {"time": 3232, "text": "They're just millions of times faster and with millions of times more memory."}, {"time": 3237, "text": "And I think there's been an immense economic pressure to get more and more transistors, get them smaller and smaller, add more and more cores."}, {"time": 3249, "text": "And in some sense, a huge fraction of all of the technological progress that there is in all of civilization has gotten concentrated just more narrowly into just those problems, right?"}, {"time": 3264, "text": "And so it has been one of the biggest success stories in the history of technology, right?"}, {"time": 3271, "text": "There's, I mean, it is, I am as amazed by it as anyone else is, right?"}, {"time": 3276, "text": "But at the same time, we also know that it, and I really do mean we know that it cannot continue indefinitely, okay?"}, {"time": 3288, "text": "Because you will reach fundamental limits on how small you can possibly make a processor."}, {"time": 3296, "text": "And if you want a real proof that would justify my use of the word, we know that Moore's law has to end."}, {"time": 3304, "text": "I mean, ultimately you will reach the limits imposed by quantum gravity."}, {"time": 3310, "text": "If you tried to build a computer that operated at 10 to the 43 Hertz, so did 10 to the 43 operations per second, that computer would use so much energy that it would simply collapse through a black hole, okay?"}, {"time": 3324, "text": "So in reality, we're going to reach the limits long before that, but that is a sufficient proof."}, {"time": 3331, "text": "That there's a limit."}, {"time": 3365, "text": "And it'd be nice to replicate."}, {"time": 3367, "text": "Yeah, well, I mean, some people are sort of, get depressed about the fact that technological progress may seem to have slowed down in many, many realms outside of computing, right?"}, {"time": 3379, "text": "And there was this whole thing of we wanted flying cars and we only got Twitter instead, right?"}, {"time": 3384, "text": "Yeah, good old Peter Thiel, yeah."}, {"time": 3387, "text": "Yeah, yeah, yeah, right, right, right."}, {"time": 3388, "text": "So then jumping to another really interesting topic that you mentioned, so Google announced with their work in the paper in Nature with quantum supremacy."}, {"time": 3400, "text": "Can you describe, again, back to the basic, what is perhaps not so basic, what is quantum supremacy?"}, {"time": 3407, "text": "Absolutely, so quantum supremacy is a term that was coined by, again, by John Preskill in 2012."}, {"time": 3417, "text": "Not everyone likes the name, but it sort of stuck."}, {"time": 3424, "text": "We don't, we sort of haven't found a better alternative."}, {"time": 3427, "text": "It's technically quantum computational supremacy."}, {"time": 3430, "text": "Yeah, yeah, supremacy, that's right, that's right."}, {"time": 3432, "text": "But the basic idea is actually one that goes all the way back to the beginnings of quantum computing when Richard Feynman and David Deutsch, people like that, were talking about it in the early 80s."}, {"time": 3444, "text": "And quantum supremacy just refers to sort of the point in history when you can first use a quantum computer to do some well defined task much faster than any known algorithm running on any of the classical computers that are available, okay?"}, {"time": 3462, "text": "So notice that I did not say a useful task, okay?"}, {"time": 3466, "text": "It could be something completely artificial, but it's important that the task be well defined."}, {"time": 3471, "text": "So in other words, it is something that has right and wrong answers that are knowable independently of this device, right?"}, {"time": 3480, "text": "And we can then run the device, see if it gets the right answer or not."}, {"time": 3484, "text": "Can you clarify a small point?"}, {"time": 3485, "text": "You said much faster than a classical implementation."}, {"time": 3489, "text": "What about sort of what about the space with where the class, there's no, there's not, it doesn't even exist, a classical algorithm to show the power?"}, {"time": 3498, "text": "So maybe I should clarify."}, {"time": 3500, "text": "Everything that a quantum computer can do, a classical computer can also eventually do, okay?"}, {"time": 3506, "text": "And the reason why we know that is that a classical computer could always, you know, if it had no limits of time and memory, it could always just store the entire quantum state, you know, of your, you know, of the quantum, store a list of all the amplitudes, you know, in the state of the quantum computer, and then just, you know, do some linear algebra to just update that state, right?"}, {"time": 3532, "text": "And so anything that quantum computers can do can also be done by classical computers, albeit exponentially slower in some cases."}, {"time": 3540, "text": "So quantum computers don't go into some magical place outside of Alan Turing's definition of computation."}, {"time": 3547, "text": "They do not solve the halting problem."}, {"time": 3549, "text": "They cannot solve anything that is uncomputable in Alan Turing's sense."}, {"time": 3554, "text": "What we think they do change is what is efficiently computable, okay?"}, {"time": 3587, "text": "Yeah, so I do hope we get to talk again because one of the many topics that there's probably several hours worth of conversation on is complexity, which we probably won't even get a chance to touch today, but you briefly mentioned it, but let's maybe try to continue."}, {"time": 3605, "text": "So you said the definition of quantum supremacy is basically achieving a place where much faster on a formal, that quantum computer is much faster on a formal well defined problem that is or isn't useful."}, {"time": 3621, "text": "Yeah, yeah, yeah, right, right."}, {"time": 3622, "text": "And I would say that we really want three things, right?"}, {"time": 3625, "text": "We want, first of all, the quantum computer to be much faster just in the literal sense of like number of seconds, you know, it's a solving this, you know, well defined, you know, problem."}, {"time": 3636, "text": "Secondly, we want it to be sort of, you know, for a problem where we really believe that a quantum computer has better scaling behavior, right?"}, {"time": 3645, "text": "So it's not just an incidental, you know, matter of hardware, but it's that, you know, as you went to larger and larger inputs, you know, the classical scaling would be exponential and the scaling for the quantum algorithm would only be polynomial."}, {"time": 3661, "text": "And then thirdly, we want the first thing, the actual observed speed up to only be explainable in terms of the scaling behavior, right?"}, {"time": 3670, "text": "So, you know, I want, you know, a real world, you know, a real problem to get solved, let's say by a quantum computer with 50 qubits or so, and for no one to be able to explain that in any way other than, well, you know, this computer involved a quantum state with two to the 50th power amplitudes."}, {"time": 3693, "text": "And, you know, a classical simulation, at least any that we know today, would require keeping track of two to the 50th numbers."}, {"time": 3700, "text": "And this is the reason why it was faster."}, {"time": 3702, "text": "So the intuition is that then if you demonstrate on 50 qubits, then once you get to 100 qubits, then it'll be even much more faster."}, {"time": 3710, "text": "Precisely, precisely."}, {"time": 3712, "text": "Yeah, and, you know, and quantum supremacy does not require error correction, right?"}, {"time": 3717, "text": "We don't, you know, we don't have, you could say, true scalability yet or true, you know, error correction yet."}, {"time": 3724, "text": "But you could say quantum supremacy is already enough by itself to refute the skeptics who said a quantum computer will never outperform a classical computer for anything."}, {"time": 3735, "text": "But one, how do you demonstrate quantum supremacy?"}, {"time": 3740, "text": "And two, what's up with these news articles I'm reading that Google did so?"}, {"time": 3745, "text": "Yeah, all right, well, great, great questions, because now you get into actually, you know, a lot of the work that I've, you know, I and my students have been doing for the last decade, which was precisely about how do you demonstrate quantum supremacy using technologies that, you know, we thought would be available in the near future."}, {"time": 3767, "text": "And so one of the main things that we realized around 2011, and this was me and my student, Alex Arkhipov at MIT at the time, and independently of some others, including Bremner, Joseph, and Shepherd, okay?"}, {"time": 3786, "text": "And the realization that we came to was that if you just want to prove that a quantum computer is faster, you know, and not do something useful with it, then there are huge advantages to sort of switching your attention from problems like factoring numbers that have a single right answer to what we call sampling problems."}, {"time": 3808, "text": "So these are problems where the goal is just to output a sample from some probability distribution, let's say over strings of 50 bits, right?"}, {"time": 3818, "text": "So there are, you know, many, many, many possible valid outputs."}, {"time": 3822, "text": "You know, your computer will probably never even produce the same output twice, you know, if it's running as, even, you know, assuming it's running perfectly, okay?"}, {"time": 3832, "text": "But the key is that some outputs are supposed to be likelier than other ones."}, {"time": 3837, "text": "So, sorry, to clarify, is there a set of outputs that are valid and set they're not, or is it more that the distribution of a particular kind of output is more, is like there's a specific distribution of a particular kind of output?"}, {"time": 3854, "text": "Yeah, there's a specific distribution that you're trying to hit, right?"}, {"time": 3857, "text": "Or, you know, that you're trying to sample from."}, {"time": 3859, "text": "Now, there are a lot of questions about this, you know, how do you do that, right?"}, {"time": 3864, "text": "Now, how you do it, you know, it turns out that with a quantum computer, even with the noisy quantum computers that we have now, that we have today, what you can do is basically just apply a randomly chosen sequence of operations, right?"}, {"time": 3880, "text": "So we, you know, in some of the, you know, that part is almost trivial, right?"}, {"time": 3884, "text": "We just sort of get the qubits to interact in some random way, although a sort of precisely specified random way so we can repeat the exact same random sequence of interactions again and get another sample from that same distribution."}, {"time": 3899, "text": "And what this does is it basically, well, it creates a lot of garbage, but, you know, very specific garbage, right?"}, {"time": 3906, "text": "So, you know, of all of the, so we're gonna talk about Google's device that were 53 qubits there, okay?"}, {"time": 3914, "text": "And so there were two to the 53 power possible outputs."}, {"time": 3918, "text": "Now, for some of those outputs, you know, there was a little bit more destructive interference in their amplitude, okay?"}, {"time": 3925, "text": "So their amplitudes were a little bit smaller."}, {"time": 3928, "text": "And for others, there was a little more constructive interference."}, {"time": 3931, "text": "You know, the amplitudes were a little bit more aligned with each other, you know, and so those were a little bit likelier, okay?"}, {"time": 3938, "text": "All of the outputs are exponentially unlikely, but some are, let's say, two times or three times, you know, unlikelier than others, okay?"}, {"time": 3947, "text": "And so you can define, you know, this sequence of operations that gives rise to this probability distribution."}, {"time": 3955, "text": "Okay, now the next question would be, well, how do you, you know, even if you're sampling from it, how do you verify that, right?"}, {"time": 3962, "text": "How do you know?"}, {"time": 3964, "text": "And so my students and I, and also the people at Google were doing the experiment, came up with statistical tests that you can apply to the outputs in order to try to verify, you know, what is, you know, that at least that some hard problem is being solved."}, {"time": 3985, "text": "The test that Google ended up using was something that they called the linear cross entropy benchmark, okay?"}, {"time": 3992, "text": "And it's basically, you know, so the drawback of this test is that it requires, like, it requires you to do a two to the 53 time calculation with your classical computer, okay?"}, {"time": 4004, "text": "So it's very expensive to do the test on a classical computer."}, {"time": 4009, "text": "The good news is... How big of a number is two to the 53?"}, {"time": 4011, "text": "It's about nine quadrillion, okay?"}, {"time": 4013, "text": "That doesn't help."}, {"time": 4015, "text": "Well, you know, it's, you want it in like scientific notation."}, {"time": 4018, "text": "No, no, no, what I mean is... Yeah, it is just..."}, {"time": 4021, "text": "It's impossible to run on a... Yeah, so we will come back to that."}, {"time": 4024, "text": "It is just barely possible to run, we think, on the largest supercomputer that currently exists on Earth, which is called Summit at Oak Ridge National Lab, okay?"}, {"time": 4035, "text": "Great, this is exciting."}, {"time": 4036, "text": "That's the short answer."}, {"time": 4038, "text": "So ironically, for this type of experiment, we don't want 100 qubits, okay?"}, {"time": 4044, "text": "Because with 100 qubits, even if it works, we don't know how to verify the results, okay?"}, {"time": 4049, "text": "So we want, you know, a number of qubits that is enough that, you know, the biggest classical computers on Earth will have to sweat, you know, and we'll just barely, you know, be able to keep up with the quantum computer, you know, using much more time, but they will still be able to do it in order that we can verify the results."}, {"time": 4068, "text": "Which is where the 53 comes from for the number of qubits?"}, {"time": 4070, "text": "Basically, well, I mean, that's also, that's sort of, you know, I mean, that's sort of where they are now in terms of scaling, you know?"}, {"time": 4080, "text": "And then, you know, soon, you know, that point will be passed."}, {"time": 4083, "text": "And then when you get to larger numbers of qubits, then, you know, these types of sampling experiments will no longer be so interesting because we won't even be able to verify the results and we'll have to switch to other types of computation."}, {"time": 4097, "text": "So with the sampling thing, you know, so the test that Google applied with this linear cross entropy benchmark was basically just take the samples that were generated, which are, you know, a very small subset of all the possible samples that there are."}, {"time": 4112, "text": "But for those, you calculate with your classical computer the probabilities that they should have been output."}, {"time": 4119, "text": "And you see, are those probabilities like larger than the mean?"}, {"time": 4123, "text": "You know, so is the quantum computer biased toward outputting the strings that it's, you know, that you want it to be biased toward?"}, {"time": 4130, "text": "Okay, and then finally, we come to a very crucial question, which is supposing that it does that."}, {"time": 4136, "text": "Well, how do we know that a classical computer could not have quickly done the same thing, right?"}, {"time": 4141, "text": "How do we know that, you know, this couldn't have been spoofed by a classical computer, right?"}, {"time": 4145, "text": "And so, well, the first answer is we don't know for sure because, you know, this takes us into questions of complexity theory."}, {"time": 4153, "text": "You know, I mean, questions of the magnitude of the P versus NP question and things like that, right?"}, {"time": 4160, "text": "You know, we don't know how to rule out definitively that there could be fast classical algorithms for, you know, even simulating quantum mechanics and for, you know, simulating experiments like these, but we can give some evidence against that possibility."}, {"time": 4176, "text": "And that was sort of the, you know, the main thrust of a lot of the work that my colleagues and I did, you know, over the last decade, which is then sort of in around 2015 or so, what led to Google deciding to do this experiment."}, {"time": 4189, "text": "So is the kind of evidence here, first of all, the hard P equals NP problem that you mentioned and the kind of evidence that you were looking at, is that something you come to on a sheet of paper or is this something, are these empirical experiments?"}, {"time": 4207, "text": "It's math for the most part."}, {"time": 4209, "text": "I mean, you know, it's also, you know, we have a bunch of methods that are known for simulating quantum circuits or quantum computations with classical computers."}, {"time": 4223, "text": "And so we have to try them all out and make sure that, you know, they don't work, you know, make sure that they have exponential scaling on, you know, these problems and not just theoretically, but with the actual range of parameters that are actually, you know, arising in Google's experiment."}, {"time": 4240, "text": "Okay, so there is an empirical component to it, right?"}, {"time": 4243, "text": "But now on the theoretical side, you know, basically what we know how to do in theoretical computer science and computational complexity is, you know, we don't know how to prove that most of the problems we care about are hard, but we know how to pass the blame to someone else, okay?"}, {"time": 4261, "text": "We know how to say, well, look, you know, I can't prove that this problem is hard, but if it is easy, then all these other things that, you know, you probably were much more confident or were hard, then those would be easy as well, okay?"}, {"time": 4276, "text": "So we can give what are called reductions."}, {"time": 4279, "text": "This has been the basic strategy in, you know, NP completeness, right, in all of theoretical computer science and cryptography since the 1970s, really."}, {"time": 4291, "text": "And so we were able to give some reduction evidence for the hardness of simulating these sampling experiments, these sampling based quantum supremacy experiments."}, {"time": 4303, "text": "So reduction evidence is not as satisfactory as it should be."}, {"time": 4307, "text": "One of the biggest open problems in this area is to make it better."}, {"time": 4311, "text": "But, you know, we can do something."}, {"time": 4313, "text": "You know, certainly we can say that, you know, if there is a fast classical algorithm to spoof these experiments, then it has to be very, very unlike any of the algorithms that we know."}, {"time": 4324, "text": "TREVOR Which is kind of in the same kind of space of reasoning that people say P not equals NP."}, {"time": 4332, "text": "BENJAMIN Yeah, it's in the same spirit."}, {"time": 4337, "text": "TREVOR Okay, so Andrew Yang, a very intelligent and a presidential candidate with a lot of interesting ideas in all kinds of technological fields, tweeted that because of quantum computing, no code is uncrackable."}, {"time": 4356, "text": "Is he wrong or right?"}, {"time": 4357, "text": "BENJAMIN He was premature, let's say."}, {"time": 4360, "text": "So, well, okay, wrong."}, {"time": 4365, "text": "Look, I'm actually, you know, I'm a fan of Andrew Yang."}, {"time": 4369, "text": "I like his ideas."}, {"time": 4371, "text": "I like his candidacy."}, {"time": 4373, "text": "I think that, you know, he may be ahead of his time with, you know, the universal basic income and so forth."}, {"time": 4381, "text": "And he may also be ahead of his time in that tweet that you referenced."}, {"time": 4385, "text": "So regarding using quantum computers to break cryptography, so the situation is this, okay?"}, {"time": 4393, "text": "So the famous discovery of Peter Shor, you know, 26 years ago that really started quantum computing, you know, as an autonomous field was that if you built a full scalable quantum computer, then you could use it to efficiently find the prime factors of huge numbers and calculate discrete logarithms and solve a few other problems that are very, very special in character, right?"}, {"time": 4422, "text": "They're not NP complete problems."}, {"time": 4424, "text": "We're pretty sure they're not, okay?"}, {"time": 4426, "text": "But it so happens that most of the public key cryptography that we currently use to protect the internet is based on the belief that these problems are hard."}, {"time": 4437, "text": "Okay, what Shor showed is that once you get scalable quantum computers, then that's no longer true, okay?"}, {"time": 4443, "text": "But now, you know, before people panic, there are two important points to understand here."}, {"time": 4449, "text": "Okay, the first is that quantum supremacy, the milestone that Google just achieved, is very, very far from the kind of scalable quantum computer that would be needed to actually threaten public key cryptography."}, {"time": 4463, "text": "Okay, so, you know, we touched on this earlier, right?"}, {"time": 4465, "text": "But Google's device has 53 physical qubits, right?"}, {"time": 4469, "text": "To threaten cryptography, you're talking, you know, with any of the known error correction methods, you're talking millions of physical qubits."}, {"time": 4477, "text": "Because error correction would be required to threaten cryptography."}, {"time": 4480, "text": "Yes, yes, yes, it certainly would, right?"}, {"time": 4486, "text": "And, you know, how much, you know, how great will the overhead be from the error correction?"}, {"time": 4493, "text": "That we don't know yet."}, {"time": 4495, "text": "But with the known codes, you're talking millions of physical qubits and of a much higher quality than any that we have now, okay?"}, {"time": 4530, "text": "So this brings me to the second point I wanted to make, which is that there are other public key cryptosystems that are known that we don't know how to break even with quantum computers, okay?"}, {"time": 4545, "text": "And so there's a whole field devoted to this now, which is called post quantum cryptography, okay?"}, {"time": 4551, "text": "And so there is already, so we have some good candidates now."}, {"time": 4556, "text": "The best known being what are called lattice based cryptosystems."}, {"time": 4560, "text": "And there is already some push to try to migrate to these cryptosystems."}, {"time": 4564, "text": "So NIST in the US is holding a competition to create standards for post quantum cryptography, which will be the first step in trying to get every web browser and every router to upgrade, you know, and use, you know, something like SSL that would be based on, you know, what we think is quantum secure cryptography."}, {"time": 4589, "text": "But, you know, this will be a long process."}, {"time": 4593, "text": "But, you know, it is something that people are already starting to do."}, {"time": 4596, "text": "And so, you know, I'm sure this algorithm is sort of a dramatic discovery."}, {"time": 4602, "text": "You know, it could be a big deal for whatever intelligence agency first gets a scalable quantum computer, if no, at least certainly if no one else knows that they have it, right?"}, {"time": 4613, "text": "But eventually we think that we could migrate the internet to the post quantum cryptography and then we'd be more or less back where we started."}, {"time": 4623, "text": "Okay, so this is sort of not the application of quantum computing."}, {"time": 4627, "text": "I think that's really gonna change the world in a sustainable way, right?"}, {"time": 4630, "text": "The big, by the way, the biggest practical application of quantum computing that we know about by far, I think is simply the simulation of quantum mechanics itself."}, {"time": 4641, "text": "In order to, you know, learn about chemical reactions, you know, design maybe new chemical processes, new materials, new drugs, new solar cells, new superconductors, all kinds of things like that."}, {"time": 4655, "text": "What's the size of a quantum computer that would be able to simulate the, you know, quantum mechanical systems themselves that would be impactful for the real world for the kind of chemical reactions and that kind of work?"}, {"time": 4670, "text": "What scale are we talking about?"}, {"time": 4671, "text": "Now you're asking a very, very current question, a very big question."}, {"time": 4677, "text": "People are going to be racing over the next decade to try to do useful quantum simulations even with, you know, 100 or 200 qubit quantum computers of the sort that we expect to be able to build over the next decade."}, {"time": 4692, "text": "Okay, so that might be, you know, the first application of quantum computing that we're able to realize, you know, or maybe it will prove to be too difficult and maybe even that will require fault tolerance or, you know, will require error correction."}, {"time": 4708, "text": "So there's an aggressive race to come up with the one case study kind of like Peter Schor with the idea that would just capture the world's imagination of like, look, we can actually do something very useful here."}, {"time": 4721, "text": "Right, but I think, you know, within the next decade, the best shot we have is certainly not, you know, using Schor's algorithm to break cryptography, you know, just because it requires, you know, too much in the way of error correction."}, {"time": 4735, "text": "The best shot we have is to do some quantum simulation that tells the material scientists or chemists or nuclear physicists, you know, something that is useful to them and that they didn't already know, you know, and you might only need one or two successes in order to change some, you know, billion dollar industries, right?"}, {"time": 4754, "text": "Like, you know, the way that people make fertilizer right now is still based on the Haber Bosch process from a century ago."}, {"time": 4762, "text": "And it is some many body quantum mechanics problem that no one really understands, right?"}, {"time": 4767, "text": "If you could design a better way to make fertilizer, right?"}, {"time": 4770, "text": "That's, you know, billions of dollars right there."}, {"time": 4773, "text": "So those are sort of the applications that people are going to be aggressively racing toward over the next decade."}, {"time": 4780, "text": "Now, I don't know if they're gonna realize it or not, but, you know, they certainly at least have a shot."}, {"time": 4786, "text": "So it's gonna be a very, very interesting next decade."}, {"time": 4788, "text": "But just to clarify, what's your intuition?"}, {"time": 4791, "text": "If a breakthrough like that comes with, is it possible for that breakthrough to be on 50 to 100 qubits or is scale a fundamental thing like 500, 1000 plus qubits?"}, {"time": 4804, "text": "Yeah, so I can tell you what the current studies are saying."}, {"time": 4809, "text": "You know, I think probably better to rely on that than on my intuition."}, {"time": 4813, "text": "But, you know, there was a group at Microsoft had a study a few years ago that said even with only about 100 qubits, you know, you could already learn something new about the chemical reaction that makes fertilizer, for example."}, {"time": 4830, "text": "The trouble is they're talking about 100 qubits and about a million layers of quantum gates."}, {"time": 4838, "text": "Okay, so basically they're talking about 100 nearly perfect qubits."}, {"time": 4842, "text": "So the logical qubits, as you mentioned before."}, {"time": 4844, "text": "Yeah, exactly, 100 logical qubits."}, {"time": 4847, "text": "And now, you know, the hard part for the next decade is gonna be, well, what can we do with 100 to 200 noisy qubits?"}, {"time": 4856, "text": "Yeah, is there error correction breakthroughs that might come without the need to do thousands or millions of physical qubits?"}, {"time": 4864, "text": "Yeah, so people are gonna be pushing simultaneously on a bunch of different directions."}, {"time": 4869, "text": "One direction, of course, is just making the qubits better, right?"}, {"time": 4874, "text": "And, you know, there is tremendous progress there."}, {"time": 4876, "text": "I mean, you know, the fidelity is like the accuracy of the qubits has improved by several orders of magnitude, you know, in the last decade or two."}, {"time": 4888, "text": "Okay, the second thing is designing better error, you know, let's say lower overhead error correcting codes and even short of doing the full recursive error correction."}, {"time": 4900, "text": "You know, there are these error mitigation strategies that you can use, you know, that may, you know, allow you to eke out a useful speed up in the near term."}, {"time": 4912, "text": "And then the third thing is just taking the quantum algorithms for simulating quantum chemistry or materials and making them more efficient."}, {"time": 4921, "text": "You know, and those algorithms are already dramatically more efficient than they were, let's say, five years ago."}, {"time": 4927, "text": "And so when, you know, I quoted these estimates like, you know, circuit depth of one million."}, {"time": 4933, "text": "And so, you know, I hope that because people will care enough that these numbers are gonna come down."}, {"time": 4938, "text": "So you're one of the world class researchers in this space."}, {"time": 4944, "text": "There's a few groups like you mentioned, Google and IBM working at this."}, {"time": 4947, "text": "There's other research labs, but you put also, you have an amazing blog."}, {"time": 4955, "text": "You just, you put a lot, you paid me to say it."}, {"time": 4961, "text": "You put a lot of effort sort of to communicating the science of this and communicating, exposing some of the BS and sort of the natural, just like in the AI space, the natural charlatanism, if that's a word in this, in the quantum mechanics in general, but quantum computers and so on."}, {"time": 4982, "text": "Can you give some notes about people or ideas that people like me or listeners in general from outside the field should be cautious of when they're taking in news headings that Google achieved quantum supremacy?"}, {"time": 4999, "text": "So what should we look out for?"}, {"time": 5001, "text": "Where's the charlatans in the space?"}, {"time": 5003, "text": "Where's the BS?"}, {"time": 5003, "text": "Yeah, so good question."}, {"time": 5006, "text": "Unfortunately, quantum computing is a little bit like cryptocurrency or deep learning."}, {"time": 5012, "text": "Like there is a core of something that is genuinely revolutionary and exciting."}, {"time": 5017, "text": "And because of that core, it attracts this sort of vast penumbra of people making just utterly ridiculous claims."}, {"time": 5027, "text": "And so with quantum computing, I mean, I would say that the main way that people go astray is by not focusing on sort of the question of, are you getting a speed up over a classical computer or not?"}, {"time": 5043, "text": "And so people have like dismissed quantum supremacy because it's not useful, right?"}, {"time": 5050, "text": "Or it's not itself, let's say, obviously useful for anything."}, {"time": 5054, "text": "Okay, but ironically, these are some of the same people who will go and say, well, we care about useful applications."}, {"time": 5061, "text": "We care about solving traffic routing and financial optimization and all these things."}, {"time": 5068, "text": "And that sounds really good, but their entire spiel is sort of counting on nobody asking the question, yes, but how well could a classical computer do the same thing, right?"}, {"time": 5082, "text": "I really mean the entire thing is they say, well, a quantum computer can do this, a quantum computer can do that."}, {"time": 5090, "text": "A quantum computer can do that, right?"}, {"time": 5092, "text": "And they just avoid the question, are you getting a speed up over a classical computer or not?"}, {"time": 5098, "text": "And if so, how do you know?"}, {"time": 5101, "text": "Have you really thought carefully about classical algorithms to solve the same problem, right?"}, {"time": 5107, "text": "And a lot of the application areas that the companies and investors are most excited about that the popular press is most excited about where quantum computers have been things like machine learning, AI, optimization, okay?"}, {"time": 5127, "text": "And the problem with that is that since the very beginning, even if you have a perfect fault tolerant, scalable quantum computer, we have known of only modest speed ups that you can get for these problems, okay?"}, {"time": 5146, "text": "So there is a famous quantum algorithm called Grover's algorithm, okay?"}, {"time": 5150, "text": "And what it can do is it can solve many, many of the problems that arise in AI, machine learning, optimization, including NP complete problems, okay?"}, {"time": 5160, "text": "But it can solve them in about the square root of the number of steps that a classical computer would need for the same problems, okay?"}, {"time": 5168, "text": "Now a square root speed up is important, it's impressive."}, {"time": 5172, "text": "It is not an exponential speed up, okay?"}, {"time": 5175, "text": "So it is not the kind of game changer that let's say Shor's algorithm for factoring is, or for that matter that simulation of quantum mechanics is, okay, it is a more modest speed up."}, {"time": 5186, "text": "And let's say roughly, in theory, it could roughly double the size of the optimization problems that you could handle, right?"}, {"time": 5193, "text": "And so because people found that I guess too boring or too unimpressive, they've gone on to like invent all of these heuristic algorithms where because no one really understands them, you can just project your hopes onto them, right?"}, {"time": 5212, "text": "That, well, maybe it gets an exponential speed up."}, {"time": 5215, "text": "You can't prove that it doesn't, and the burden is on you to prove that it doesn't get a speed up, right?"}, {"time": 5220, "text": "And so they've done an immense amount of that kind of thing."}, {"time": 5224, "text": "And a really worrying amount of the case for building a quantum computer has come to rest on this stuff that those of us in this field know perfectly well is on extremely shaky foundations."}, {"time": 5237, "text": "So the fundamental question is, show that there's a speed up over the classical."}, {"time": 5244, "text": "And in this space that you're referring to, which is actually really interesting, it's the area that a lot of people excited about is machine learning."}, {"time": 5251, "text": "So your sense is, do you think it will, I know that there's a lot of smoke currently, but do you think there actually eventually might be breakthroughs where you do get exponential speed ups in the machine learning space?"}, {"time": 5266, "text": "Absolutely, there might be."}, {"time": 5268, "text": "I mean, I think we know of modest speed ups that you can get for these problems."}, {"time": 5272, "text": "I think, you know, whether you can get bigger speed ups is one of the biggest questions for quantum computing theory, you know, for people like me to be thinking about."}, {"time": 5283, "text": "Now, you know, we had actually recently a really, you know, a super exciting candidate for an exponential quantum speed up for a machine learning problem that people really care about."}, {"time": 5296, "text": "This is basically the Netflix problem, the problem of recommending products to users given some sparse data about their preferences."}, {"time": 5305, "text": "Karinidis and Prakash in 2016 had an algorithm for sampling recommendations that was exponentially faster than any known classical algorithm, right?"}, {"time": 5315, "text": "And so, you know, a lot of people were excited."}, {"time": 5317, "text": "I was excited about it."}, {"time": 5320, "text": "I had an 18 year old undergrad by the name of Yilin Tang, and she was obviously brilliant."}, {"time": 5327, "text": "She was looking for a project."}, {"time": 5328, "text": "I gave her as a project, can you prove that this speed up is real?"}, {"time": 5332, "text": "Can you prove that, you know, any classical algorithm would need to access exponentially more data, right?"}, {"time": 5338, "text": "And, you know, this was a case where if that was true, this was not like a P versus NP type of question, right?"}]}]