[{"title": "Carl Hart: Heroin, Cocaine, MDMA, Alcohol & the Role of Drugs in Society | Lex Fridman Podcast #233", "id": "3LWNY70Oj4A", "quotes": [{"time": 282, "text": "Strongly dependent upon it."}, {"time": 284, "text": "But the environment is a very, it's a short word that can describe a lot of things."}, {"time": 288, "text": "So would you say the environment is important or the people where you are currently in your life?"}, {"time": 295, "text": "Or is it also dependent on the full trajectory of your psychology of your life experiences of your parents or the people you came up with of the trauma you've experienced of the hopes and dreams that were crushed or not or the opposite or the success levels or all those things."}, {"time": 311, "text": "Like what are the interesting sort of landscape of experiences that contribute to how you actually feel when you take a drug?"}, {"time": 321, "text": "So all of those things are important."}, {"time": 323, "text": "But you know, like if someone had trauma in childhood and they did the work and they dealt with it that's not so important in this case."}, {"time": 330, "text": "But if they didn't deal with it and that trauma is being triggered in that event in that moment, then it's important."}, {"time": 338, "text": "But let's just take somebody like me."}, {"time": 340, "text": "I'm 54 years old."}, {"time": 342, "text": "I'll be 55 this month actually."}, {"time": 343, "text": "And you know, I've done a lot of work in terms of figuring out who I am and I'm comfortable with myself."}, {"time": 352, "text": "And I know how to set limits for whatever it is I'm doing."}, {"time": 359, "text": "And so I know I need to work out."}, {"time": 362, "text": "I know I need to eat well."}, {"time": 363, "text": "I know I need to sleep well."}, {"time": 365, "text": "I know I need to be in an environment with people within my trust."}, {"time": 370, "text": "And then if all of those things are met, oh, it's likely to be a good time."}, {"time": 377, "text": "But if I haven't slept, if I haven't worked out, if I don't feel good, it won't be a good time."}, {"time": 383, "text": "But I try and be responsible and take care of my eating habits, sleeping habits, make sure my responsibilities are taken care of."}, {"time": 394, "text": "And so when I'm in that moment, I just enjoy that moment."}, {"time": 399, "text": "I'm there."}, {"time": 399, "text": "I'm not thinking about a bill that I didn't pay."}, {"time": 402, "text": "I'm not thinking about, oh, I forgot to do this for my kid."}, {"time": 406, "text": "I'm not thinking about that because all of those things are taken care of."}, {"time": 409, "text": "If they're not taken care of, it will impact the experience and it may negatively impact the experience."}, {"time": 417, "text": "Well, that is the counterintuitive, even controversial finding from your recent book."}, {"time": 423, "text": "So we should kind of, I know it seems obvious to you, but I think a lot of people hearing this would think it's quite non obvious."}, {"time": 431, "text": "So in your new book, Drug Use for Grownups, you write for the finding section."}, {"time": 438, "text": "I discovered that the predominant effects produced by the drugs discussed in this book are positive."}, {"time": 444, "text": "It didn't matter whether the drug in question was cannabis, cocaine, heroin, methamphetamine, or psilocybin."}, {"time": 451, "text": "Overwhelmingly, consumers expressed feeling more altruistic, empathetic, euphoric, focused, grateful, and tranquil."}, {"time": 459, "text": "They also experienced enhanced social interactions, a great sense of purpose and meaning, and increased sexual intimacy and performance."}, {"time": 466, "text": "This constellation of findings challenged my original beliefs about drugs and their effects."}, {"time": 472, "text": "I had been indoctrinated to be biased toward the negative effects of drug use."}, {"time": 477, "text": "But over the past two plus decades, I had gained a deeper, more nuanced understanding."}, {"time": 483, "text": "These words are very counterintuitive to a lot of people."}, {"time": 489, "text": "I think like you also mentioned in the book and elsewhere, people have come around to maybe psilocybin being one such drug, maybe cannabis being one such drug, but you also mentioned other drugs like cocaine, heroin, methamphetamine."}, {"time": 506, "text": "Can you just linger on this point?"}, {"time": 508, "text": "How do we get the positive effects of those drugs and why in the media, and the general conception we have of these drugs is that they were going to make a bad life worse or ruin a good life?"}, {"time": 523, "text": "Well, so your first question was, how do we harness the positive effects?"}, {"time": 527, "text": "How do we increase the likelihood of getting the positive effects?"}, {"time": 531, "text": "Again, like I said, we wanna make sure that people are responsible and they've handled their responsibilities, make sure they eat well, sleep well, exercise, all of those sorts of things play an important role."}, {"time": 543, "text": "And also if they know exactly what they're getting and then they're not paranoid about, it's something contaminated in some adulterant in my drug."}, {"time": 553, "text": "So you wanna make sure you know exactly what you have."}, {"time": 556, "text": "Once you satisfy those kinds of things, you understand the dose and potency, you understand all of those things to decrease any sort of anxiety you might have about the substance itself, it increases the likelihood that you will have a better time."}, {"time": 570, "text": "So anxiety is a big one, you need to remove the anxiety."}, {"time": 573, "text": "Anxiety is critical, it's huge."}, {"time": 576, "text": "Many of the negative effects that we see with drugs have to do with anxiety and not necessarily anxiety because a drug induced it, it's the anxiety that the situation induced a lot of times."}, {"time": 589, "text": "And then you ask like, well, why does this sound counterintuitive?"}, {"time": 593, "text": "Why does the media report differently?"}, {"time": 599, "text": "Well, because there's money in reporting the negative effects almost exclusively."}, {"time": 604, "text": "Think about writing a newspaper article."}, {"time": 608, "text": "It's really easy to get the population all ginned up about something like an opioid crisis, overdoses, and you don't even have to tell people how to keep people safe if you're talking about overdose."}, {"time": 620, "text": "You don't even have to say why people are dying from overdoses."}, {"time": 624, "text": "Like overdoses in our country happen largely because people get contaminated drugs, because people are combining sedatives and they don't know that this enhances the respiratory depressing effects of drugs."}, {"time": 638, "text": "They don't know."}, {"time": 639, "text": "But when you read these newspaper articles, they don't say this."}, {"time": 643, "text": "They don't say how to keep people safe."}, {"time": 645, "text": "All they do is frighten the population."}, {"time": 648, "text": "There's money in that."}, {"time": 649, "text": "And then we think about people who write TV shows, the people who write movies."}, {"time": 656, "text": "Most of the stuff written about drugs is just bullshit."}, {"time": 661, "text": "I think about, I love going to watch comedians and the comedians when they talk about drugs, again, most of the things that they say about drugs is bullshit."}, {"time": 670, "text": "I mean, you can say the stupidest things about drugs and be believed."}, {"time": 674, "text": "You can write a movie and you don't even have to develop your characters."}, {"time": 680, "text": "If you throw drugs into the mix, you say, oh, he's a drug dealer."}, {"time": 684, "text": "You don't have to say anything about that person's background or about that person being developed as a character because the population think they know."}, {"time": 693, "text": "And the writer is lazy and does not do any sort of development."}, {"time": 699, "text": "Just think about any more."}, {"time": 702, "text": "Oh, let's think about the Sopranos, for example."}, {"time": 705, "text": "They have a new program coming out."}, {"time": 708, "text": "So let's think about them for a second."}, {"time": 710, "text": "The Sopranos is a show in which the lead character, Tony, kills people for a living."}, {"time": 717, "text": "That's what he does, right?"}, {"time": 719, "text": "This character actually made a sympathetic for him when he is besmirching and denigrating his nephew, Christopher, for using a drug."}, {"time": 733, "text": "And we feel sympathy for Tony, the character, who just killed somebody, who is a horrible person, but being a drug user is a worse person."}, {"time": 746, "text": "That's what the show wants us to believe."}, {"time": 748, "text": "Tony's a racist, murderer, all of these things, but we feel sympathy for him."}, {"time": 754, "text": "But we don't feel sympathy for anyone who uses drugs."}, {"time": 758, "text": "That's some crazy shit."}, {"time": 759, "text": "I mean, and the American public buys into it."}, {"time": 762, "text": "That is, that's wild to me, and that we all bought into this crap."}, {"time": 767, "text": "And that's what we do in damn near everything that's in film, on television."}, {"time": 772, "text": "And it's like, what's wrong with you people?"}, {"time": 775, "text": "So why aren't there not more stories of grownups using drugs?"}, {"time": 783, "text": "The full spectrum of drugs that we're talking about."}, {"time": 785, "text": "Why isn't there?"}, {"time": 786, "text": "So we talked offline about Joe Rogan."}, {"time": 789, "text": "He's somebody who started smoking weed later in life, which is an interesting story."}, {"time": 793, "text": "Like when he's already very successful and he has a very interesting way of describing his experience with weed, that it was like enhancing just productivity."}, {"time": 802, "text": "It actually, I think he says, like it increases anxiety a little bit in a way that was productive, like paranoia, not anxiety."}, {"time": 809, "text": "And so that's an interesting story of an adult talking about the use of weed for productivity purposes."}, {"time": 816, "text": "But you don't get those stories very often."}, {"time": 820, "text": "I think fear."}, {"time": 821, "text": "People are afraid that they will be belittled, dismissed, all of these things, that's a drug addict or some negative thing, but cannabis is lightweight."}, {"time": 831, "text": "Come on, you can admit cannabis these days."}, {"time": 834, "text": "And the fact that I don't know when Joe started, but if he did start later in life, that's cool."}, {"time": 841, "text": "I mean, you are mature, developed, you have developed some responsibility skills, all of these kinds of things."}, {"time": 849, "text": "This is a good thing."}, {"time": 852, "text": "You don't want people to engage in any kind of behaviors when they're young and immature that might put them in harm's way."}, {"time": 861, "text": "And so we want people to be developed at least."}, {"time": 866, "text": "I mean, whether it's being in a relationship with a partner or whether it's driving an automobile, all of these things that can be potentially harmful, but extremely beneficial if you are responsible enough to handle them."}, {"time": 884, "text": "You want people to be mature, so that's a good thing."}, {"time": 886, "text": "So how are you supposed to, like somebody like me, somebody like Joe, how are you supposed to understand what the dangers are, what the negative effects are?"}, {"time": 895, "text": "So you said automobile, relationships."}, {"time": 899, "text": "I think I have a reasonably, it's crappy, but reasonable understanding of all the troubles I can get with in relationships and what things to avoid."}, {"time": 909, "text": "Same thing with driving a car."}, {"time": 912, "text": "I'm in the dark in terms of what are the things to be careful about, what to avoid with drug use when we're talking about the heavy drugs."}, {"time": 924, "text": "Have you ever drank alcohol?"}, {"time": 926, "text": "That's drug use."}, {"time": 927, "text": "I know, I drank a lot."}, {"time": 928, "text": "But I understand that because culturally I came up, I was taught a lot of like, this is what you don't do and this is what you do."}, {"time": 937, "text": "This is when you drink a lot."}, {"time": 938, "text": "I mean, you see the effects, you see the, there's a lot of negative examples, there's positive examples of social stimulant."}, {"time": 945, "text": "There's examples of great artists using alcohol to sort of, I don't know, to help be the catalyst for that magic moment, for all of that."}, {"time": 955, "text": "I have some examples now, especially in America, the same with weed, more and more you're starting to get a lot of stories of psychedelics of different kinds."}, {"time": 967, "text": "There's psilocybin where you have mushrooms or even MDMA used sort of positively."}, {"time": 975, "text": "There's kind of like negative stories from the past about acid, about LSD being used, ultimately for productive ends, but it destroyed the person."}, {"time": 988, "text": "That's kind of how the story goes."}, {"time": 989, "text": "It was like a trade off."}, {"time": 990, "text": "You take, it's like, what is it?"}, {"time": 993, "text": "Robert Johnson sold his soul to the devil to learn guitar."}, {"time": 996, "text": "Like it's a trade off."}, {"time": 997, "text": "You can take the drug, you're gonna create some good stuff, but you have to pay for it."}, {"time": 1001, "text": "Those are the stories."}, {"time": 1002, "text": "That's some bullshit we tell children, come on."}, {"time": 1007, "text": "These fairy tales, these cautionary tales that we tell people, we have to grow up."}, {"time": 1012, "text": "That's what the book is about, drug use for grownups."}, {"time": 1016, "text": "We tell people, Pinocchio, if you lie, your nose grow."}, {"time": 1022, "text": "Who believes that?"}, {"time": 1023, "text": "Who believes that there are fairy tales?"}, {"time": 1024, "text": "But that's exactly what these stories are."}, {"time": 1026, "text": "They're in the same vein as those kind of stories, as Pinocchio."}, {"time": 1033, "text": "Like you said, when you were learning about alcohol, you were told what to do, what not to do, so forth."}, {"time": 1040, "text": "The same can be true with MDMA, with cocaine, with heroin."}, {"time": 1044, "text": "The same is true, because there are some times when there are some potential dangers that you should avoid."}, {"time": 1052, "text": "And I wrote about some of them, certainly in my work, just throughout all of my writings."}, {"time": 1059, "text": "I talk about those kinds of things and other people talk about these things."}, {"time": 1063, "text": "The problem is, is that we're getting our education from bullshit sources, from people who believe in this kind of Pinocchio thing."}, {"time": 1074, "text": "And it just does not fit with the evidence."}, {"time": 1078, "text": "And the evidence we all publish in the scientific literature, all these things that I'm saying, it's there in the literature."}, {"time": 1085, "text": "I mean, at a place like Columbia, we give these drugs thousands of doses every year."}, {"time": 1093, "text": "Do you think we would be doing this?"}, {"time": 1095, "text": "And we do this with research grants that's funded by the public, taxpayers dollars."}, {"time": 1102, "text": "Do you think we would be allowed to do this if these drugs were so dangerous?"}, {"time": 1109, "text": "It's just nonsense."}, {"time": 1110, "text": "I mean, and the drugs we're talking about, they are all approved for medical use somewhere in the world."}, {"time": 1120, "text": "And the studies you conduct are basically asking what kinds of questions."}, {"time": 1124, "text": "So you take the full range of drugs you're talking about from marijuana to psilocybin to MDMA to cocaine and heroin."}, {"time": 1133, "text": "What is the study looking at?"}, {"time": 1135, "text": "Like what the actual experience with the positive and negative effects of the experience on the drug are in the control conditions."}, {"time": 1141, "text": "Yeah, so we did these kinds of experiments with alcohol, nicotine, all these drugs in order to have an empirical database to tell people exactly what these drugs do and what they don't do."}, {"time": 1155, "text": "The conditions under which the drugs will produce positive effects, the conditions under which the drugs were more likely to produce negative effects."}, {"time": 1163, "text": "All of this information is important for society to know."}, {"time": 1168, "text": "And we do know, and that's why we're collecting the data."}, {"time": 1171, "text": "We're collecting the data to help us with treatment if someone is having problems with these data."}, {"time": 1178, "text": "Hopefully we'll understand more about how to help them deal with their problems based on some of the research that we're doing."}, {"time": 1189, "text": "So what kind of negative effects are we looking out for?"}, {"time": 1191, "text": "Like what are the properties of drugs we should be careful about?"}, {"time": 1195, "text": "Is it addictive properties?"}, {"time": 1196, "text": "How addictive it is, how destructive or painful, whatever the withdrawal processes, what kind of things are we looking out for?"}, {"time": 1207, "text": "Yeah, those are certain kind of questions we certainly have asked because like something like crack cocaine versus alcohol or heroin when it comes to withdrawal of physical dependence."}, {"time": 1220, "text": "Like cocaine has a very limited sort of withdrawal symptoms."}, {"time": 1224, "text": "I mean, it's hard to see."}, {"time": 1226, "text": "Same is true with methamphetamine."}, {"time": 1228, "text": "But with heroin, you certainly can see a withdrawal syndrome that's unpleasant, but with alcohol that withdrawal can actually kill you."}, {"time": 1239, "text": "So heroin is unpleasant and not lovely, but with alcohol withdrawal, that's the one, that's the most dangerous."}, {"time": 1245, "text": "I mean, all of these kind of questions we wanna know answers to."}, {"time": 1250, "text": "And so when we think about heroin or some other drugs and you say like, what kind of negative effects?"}, {"time": 1257, "text": "Negative effects, we don't talk about much in the society."}, {"time": 1260, "text": "The main thing that really concerns me about like heroin use really is constipation."}, {"time": 1266, "text": "So if people are using heroin on a regular basis and then they have a sort of slowing of their gut modality, they're likely to increase constipation and that's not good."}, {"time": 1280, "text": "I mean, for your general health, but we never talk about that in this society."}, {"time": 1285, "text": "And that's probably the most important thing aside from the fact that people get contaminated street drugs and that sort of stuff and increase the likelihood of maybe dying from some contaminant or people who are inexperienced and they're mixing heroin with other sedatives."}, {"time": 1302, "text": "That's not good, but the constipation is a huge one."}, {"time": 1307, "text": "And then other sort of drugs, negative effects like the amphetamines, all of the amphetamines, they disrupt sleep, food intake, all of these things are so critical for sustaining human life, but we never talk about that because it's not as sexy as this nonsense that people write about like addiction."}, {"time": 1328, "text": "Addiction has almost nothing to do with the drugs themselves."}, {"time": 1331, "text": "And I make that comment because the vast majority of users for any drug never become addicted."}, {"time": 1339, "text": "And so if the vast majority of users don't become addicted, then you have to move beyond the drug when you're talking about the phenomenon interest in this case, addiction."}, {"time": 1349, "text": "And so when we think about addiction, it has much more to do with our psychosocial environment than the drug itself, but that's not sexy."}, {"time": 1358, "text": "So addiction is even the property of the environment, not a property, a result of the environment."}, {"time": 1364, "text": "It certainly can be."}, {"time": 1365, "text": "There are people who are suffering from cooccurring mental illness like depression, anxiety."}, {"time": 1372, "text": "I mean, that's within the person, of course, and that increases the likelihood for addiction."}, {"time": 1377, "text": "So that's not so much the environment, but there are people who, for example, they have chronic unrealistic expectations heaped on them."}, {"time": 1387, "text": "And those people are more likely to have some problems with drugs."}, {"time": 1392, "text": "There are people who are just immature, not having developed responsibility skills."}, {"time": 1398, "text": "They are likely to have some problems if they engage in some of these behaviors."}, {"time": 1403, "text": "There are people who lost their jobs, COVID, factories went away, a wide range of things."}, {"time": 1410, "text": "And those people used to have standing in their community."}, {"time": 1413, "text": "Now they have none."}, {"time": 1415, "text": "Those people might be susceptible to having a drug related problem if they indulge."}, {"time": 1421, "text": "All of these kinds of issues are far more important than the drug itself."}, {"time": 1426, "text": "And so they could seek escape in a particular drug."}, {"time": 1428, "text": "I mean, there is a biochemical thing to each of these drugs, and some pull you in harder than others when you need the escape, right?"}, {"time": 1436, "text": "When you're not doing well in life."}, {"time": 1438, "text": "What evidence you have for that bullshit?"}, {"time": 1441, "text": "Yeah, because there is none."}, {"time": 1442, "text": "There is absolutely none."}, {"time": 1443, "text": "I mean, people say stuff like that, and that's the problem."}, {"time": 1449, "text": "That's precisely the problem."}, {"time": 1451, "text": "See, I'm operating from limited personal evidence."}, {"time": 1454, "text": "Well, this is a problem though, but we have a scientific database."}, {"time": 1458, "text": "We don't need personal evidence for this."}, {"time": 1461, "text": "We have, in my book, I try to go through some of the science so people could understand."}, {"time": 1466, "text": "It's like when you have a math problem, you don't want people saying, well, you know, I feel like this."}, {"time": 1472, "text": "Fuck what you feel."}, {"time": 1473, "text": "What does the data say?"}, {"time": 1475, "text": "So one of the problems with the data, so one data is there's the studies that you're doing, this is excellent research work, but there's some of the drugs that are illegal."}, {"time": 1485, "text": "And some are legal."}, {"time": 1487, "text": "So you have just, it's unfortunate that some of the drugs are illegal or whatever you believe, but there's not enough of a data set of public and the open use."}, {"time": 1498, "text": "That's like you got in the wild data set."}, {"time": 1501, "text": "It'd be nice to do, you know, thousands of people and see from all the different kinds of environments and all that kind of stuff to get an understanding."}, {"time": 1508, "text": "I think we have a substantial database, but people just ignore it."}, {"time": 1517, "text": "That said, let me ask you the question of legalization."}, {"time": 1521, "text": "So should, in your view, all drugs be legalized?"}, {"time": 1526, "text": "The drugs that people seek certainly should be legally regulated and available to adults."}, {"time": 1532, "text": "So when I say the drugs people seek, like cannabis, MDMA, cocaine, heroin, those drugs certainly should be available."}, {"time": 1542, "text": "And some of the psychedelics that people seek."}, {"time": 1545, "text": "Now, the thing about it is that some people think that, oh, it will be a free fall."}, {"time": 1552, "text": "These drugs are available to everyone."}, {"time": 1554, "text": "I mean, there will be age requirements and maybe other requirements, but they should be available."}, {"time": 1561, "text": "And we should also do like what we do with alcohol."}, {"time": 1564, "text": "We can put enough alcohol in a bottle to kill you, but we don't."}, {"time": 1569, "text": "So we regulate it such that the amount that's in the bottle enhances the safety and minimizes the potential harms."}, {"time": 1578, "text": "We can do the same thing with these other drugs."}, {"time": 1580, "text": "And we can also say, okay, we won't be selling intravenous preparations of any of these drugs."}, {"time": 1588, "text": "The drugs that the routes of administration will be oral and I don't know, let's say intranasal."}, {"time": 1598, "text": "Again, routes of administration, the dose that you have in each unit, all can minimize harm based on how you do these things."}, {"time": 1610, "text": "We have the technology, we have the knowhow."}, {"time": 1613, "text": "So you're actually making me think about alcohol a little bit."}, {"time": 1616, "text": "So if I were, say the drugs become legalized in the way you're describing, and me, Lex, wanted to, as an adult, explore some of these drugs, what are some procedures do you think for sort of safe, positive exploration of those drugs?"}, {"time": 1634, "text": "The reason I say I'm thinking about alcohol because I don't think, besides not putting enough alcohol in a bottle to kill you, I don't think anyone ever gave me specific instructions."}, {"time": 1645, "text": "I think it's kind of word of mouth and examples of people doing the wrong thing."}, {"time": 1650, "text": "You kind of get it through osmosis that way."}, {"time": 1653, "text": "Is that basically what we would do, this kind of free exploration of use?"}, {"time": 1658, "text": "No, we have to change our education about these things."}, {"time": 1661, "text": "I mean, let's just take a drug like cocaine."}, {"time": 1664, "text": "Cocaine's a stimulant."}, {"time": 1666, "text": "You want to make sure people understand that they shouldn't be taking cocaine near bedtime."}, {"time": 1670, "text": "You know, they need to get a certain amount of hours of sleep and they need to get up in the morning."}, {"time": 1677, "text": "Cocaine probably isn't a drug for you at night."}, {"time": 1681, "text": "Certainly not amphetamines at night for most people."}, {"time": 1684, "text": "And also, if you want to make sure that you, they need to understand that cocaine can also disrupt your food intake."}, {"time": 1691, "text": "Not as much as the amphetamines, but all of these kinds of things people need to know so they can have proper nutrition and they can time their drug use around these other important functions that's the same human life."}, {"time": 1706, "text": "So we have to make sure that we educate people."}, {"time": 1710, "text": "We can't just throw people in a while."}, {"time": 1716, "text": "I gotta tell you, I mean, for me, and even given your book and for people listening to this, it's still tough to hear that the thing we should be concerned about with cocaine is the same as with caffeine."}, {"time": 1730, "text": "Don't take it before bed."}, {"time": 1732, "text": "And the thing we should be concerned with heroin is constipation."}, {"time": 1772, "text": "I don't know, what do you want me to say to that?"}, {"time": 1775, "text": "I mean, they have access to alcohol, they have access to the... You know, we live in this country called the United States where our Declaration of Independence says that we are free to live like we wanna live so long as we don't disrupt other people from doing the same."}, {"time": 1793, "text": "But it's remarkable to me how we try to control the behaviors of other people."}, {"time": 1798, "text": "That's just remarkable."}, {"time": 1801, "text": "And that's partially what your book is about."}, {"time": 1803, "text": "I mean, it's not just about drugs, it's about freedom."}, {"time": 1806, "text": "That's the bigger issue that we can't get to."}, {"time": 1809, "text": "It's like this issue of freedom and freedom comes with a tremendous amount of responsibility."}, {"time": 1815, "text": "I am responsible for my neighbors, my brothers."}, {"time": 1818, "text": "I mean, I can't impede their freedoms."}, {"time": 1822, "text": "Like some people think that their freedom supersedes everybody else's freedoms."}, {"time": 1827, "text": "And that's what I'm trying to remind people in this book."}, {"time": 1830, "text": "I am responsible to you as a citizen and we're in this together."}, {"time": 1839, "text": "And I tried to make that point in the book and people have conveniently ignored things like that."}, {"time": 1847, "text": "Do you think the war on drugs has done more positive or negative for the world?"}, {"time": 1853, "text": "Depends on which world you live in."}, {"time": 1855, "text": "The war on drugs has been hugely beneficial to law enforcement, to the media, to people who make bullshit TV shows."}, {"time": 1866, "text": "The Sopranos, The Wire, all of those shows, they benefit from this kind of nonsense."}, {"time": 1875, "text": "Who else have benefited?"}, {"time": 1877, "text": "People who provide treatment, many of them benefit from the war on drugs."}, {"time": 1881, "text": "The folks who do urine testing for drugs, they've all benefited."}, {"time": 1886, "text": "They're making mad money."}, {"time": 1888, "text": "People who run prisons, the phone companies who charge the prisoners, the people who run the hotels that are around the prisons where people's family have to come and stay, the restaurants, they are making out like bandits."}, {"time": 1905, "text": "But many of us are getting screwed as a society."}, {"time": 1909, "text": "In general, we're getting screwed, but there are people who are just benefiting handsomely."}, {"time": 1914, "text": "That's why it continues."}, {"time": 1916, "text": "Politicians benefit."}, {"time": 1918, "text": "I mean, whether you're Democrat or Republican, you have the same stance on drugs anyway, so they all benefit from this."}, {"time": 1925, "text": "So many questions I want to ask you, because you're challenging a lot of beliefs that people have about drugs, about society in general."}, {"time": 1933, "text": "So it's difficult for me to ask the right questions here."}, {"time": 1938, "text": "If you were with a sort of a snap of a finger, change the world, what from a policy perspective would you, and from just a, I don't know, human to human perspective, what would you like to see in the United States of America in terms of if that fixes some of the problems we're discussing here?"}, {"time": 1959, "text": "First of all, we wouldn't be arresting anybody for drugs anymore."}, {"time": 1962, "text": "That would go away."}, {"time": 1965, "text": "The folks who are in prison for drugs, that would go away."}, {"time": 1968, "text": "Their records would be expunged, that would just go away."}, {"time": 1972, "text": "And then we work on a system to make sure that responsible adults can legally obtain these substances and we'll have a corresponding educational system to teach people how to do this."}, {"time": 1988, "text": "That's where I would start initially."}, {"time": 1992, "text": "Yeah, the arresting for drug use or anything drug related is absurd, especially in the context of hard destructive alcohol and tobacco."}, {"time": 2002, "text": "Alcohol can be destructive to some people, but alcohol also is a hugely beneficial drug."}, {"time": 2008, "text": "To be honest, which I couldn't have gotten through many of the sort of receptions and functions I had to go through as the chair of the department without alcohol."}, {"time": 2018, "text": "Yeah, you have a line I really liked."}, {"time": 2021, "text": "The vast amount of predictably favorable drug effects intrigued me, so much so that I expanded my own drug use to take advantage of the wide array of beneficial outcome specific drugs can offer."}, {"time": 2032, "text": "The part that entertained me was this."}, {"time": 2034, "text": "To put this in personal terms, my position as department chairman from 2016 to 2019 was far more detrimental to my health than my drug use ever was."}, {"time": 2044, "text": "I mean, there is a standard we're treating drugs, certain kinds of drugs that's completely different than the standard we're treating everything else in our lives."}, {"time": 2053, "text": "Yeah, I mean, it's almost difficult to snap out of it as I'm listening to you and reading your work."}, {"time": 2064, "text": "It's difficult because it's like, why is everybody living this idea that certain drugs are so horribly destructive and others are not?"}, {"time": 2075, "text": "And we just kind of fix that idea."}, {"time": 2077, "text": "And then there's this narrative, I hate to be so cynical to think that there is just like a system that just propagates narratives."}, {"time": 2086, "text": "I always kind of think that truth wins out."}, {"time": 2090, "text": "Truth is the best narrative."}, {"time": 2091, "text": "I believe that too."}, {"time": 2092, "text": "Obviously, that's why I'm out here and putting, subjecting myself to this sort of criticism and so forth, but because I believe that truth ultimately wins out, but I might be wrong, but I have to live my life like it's true."}, {"time": 2107, "text": "Otherwise, then I have no hope, then why be here?"}, {"time": 2111, "text": "Well, kind of, if you can steal man or at least show respect to a criticism, you've I'm sure received quite a bit of criticism for your work."}, {"time": 2120, "text": "I've heard quite a bit of BS criticisms, sort of ignorant stuff that don't actually pay attention to your work, but is there some serious, like is there some pushback that makes you think twice?"}, {"time": 2134, "text": "People say like, I'm presenting a too rosy picture of drugs."}, {"time": 2142, "text": "I don't want people to think that I'm not aware of the potential negative effects of any activity, including drug use."}, {"time": 2151, "text": "And so I do acknowledge that there are potential harms associated with drugs."}, {"time": 2157, "text": "I acknowledge that in the book, but the fact remains the beneficial effects far outweigh the potential harmful effects."}, {"time": 2165, "text": "And we have technology information to help people to minimize the likelihood of negative effects."}, {"time": 2172, "text": "But this sort of approach that we have where we say we're only exclusively presenting the harmful effects and that should make people, keep people safe."}, {"time": 2183, "text": "I just have a problem with that."}, {"time": 2185, "text": "But I certainly, I take the point that people say there are negative effects."}, {"time": 2192, "text": "Absolutely, I absolutely agree."}, {"time": 2195, "text": "What do you, if I can just talk about specific drugs, what's the difference between opioids and benzos, for example, specifically, I mean, these are drugs that you often read about being misused at scale."}, {"time": 2213, "text": "I mean, the misuse is the problem, right?"}, {"time": 2216, "text": "No matter what the drug is."}, {"time": 2218, "text": "And that's actually what you're pushing for is education and it should be legal and should be good."}, {"time": 2223, "text": "So people should know what's the difference in proper use, positive use and misuse."}, {"time": 2230, "text": "I mean, one public figure who has been going through this is Jordan Peterson, he's been public about his struggle of getting off benzos, the withdrawal he's going through."}, {"time": 2240, "text": "I mean, what are your thoughts about the misuse of benzos or opioids and so on, the epidemic that people talk about?"}, {"time": 2250, "text": "Yeah, I don't know Jordan's specific case, but certainly with benzodiazepines in general, we talked about withdrawal earlier."}, {"time": 2257, "text": "When I said that with alcohol withdrawal, you can die."}, {"time": 2260, "text": "So benzos and alcohol, they're closely related."}, {"time": 2263, "text": "So benzo withdrawal too can kill you just like alcohol."}, {"time": 2267, "text": "So when we think about the effects that benzodiazepines produce, think about the effects that alcohol produce, they're comparable or similar."}, {"time": 2275, "text": "And so I know that it's a difficult one to wean yourself off if you develop the dependence, but we have protocols for that and I hope he's okay."}, {"time": 2289, "text": "It's interesting you say we have protocols for that, but from my understanding was that like the protocols aren't standardized."}, {"time": 2296, "text": "It feels like a lot of doctors aren't as helpful as they could be in this process."}, {"time": 2300, "text": "Like it's a bit of a mess."}, {"time": 2302, "text": "Certainly with withdrawal, they're more standardized than anything."}, {"time": 2307, "text": "So like if someone is going through alcohol withdrawal, there is a standard protocol that most physicians in this business, they follow."}, {"time": 2316, "text": "The same is true with a benzo withdrawal."}, {"time": 2319, "text": "But the thing where it gets murky is when they're treating addiction itself."}, {"time": 2324, "text": "So when you're thinking about the substance use disorder in the DSM, not just withdrawal, but the entire addiction, that's where you have this sort of a divergence or diversity in terms of approaches."}, {"time": 2340, "text": "And many of those approaches are rubbish."}, {"time": 2343, "text": "Can you just elaborate like technically what the term addiction means that you're referring to?"}, {"time": 2349, "text": "When I use the term addiction, I'm referring to the Diagnostic Statistical Manual of the American Psychiatric Association, number five now, the DSM five."}, {"time": 2360, "text": "That's never been wrong, right?"}, {"time": 2365, "text": "You're absolutely, that point is well taken."}, {"time": 2368, "text": "And your point is that their definition of substance use disorder, that's addiction."}, {"time": 2375, "text": "That's what I'm talking about."}, {"time": 2376, "text": "But that definition continues to evolve."}, {"time": 2379, "text": "And so you're right."}, {"time": 2381, "text": "They still are working it out."}, {"time": 2384, "text": "We're getting new information from scientific studies and so forth."}, {"time": 2388, "text": "And so it's supposed to be incorporated into the DSM, but there are some problems with the DSM."}, {"time": 2393, "text": "Like for example, they also have this sort of once an addict, always an addict thing."}, {"time": 2400, "text": "And there's no evidence to support that, but it's evolving."}, {"time": 2405, "text": "And it's the definition that people in science and medicine use."}, {"time": 2410, "text": "And so we all know we're talking about the same language when we call someone a substance use disorder patient or someone who meets criteria for addiction."}, {"time": 2419, "text": "We all are speaking the same language."}, {"time": 2422, "text": "We're not saying that simply because this person use heroin, they are an addict."}, {"time": 2426, "text": "That's not what we're saying."}, {"time": 2428, "text": "You have to meet these criteria where you have disruptions in your psychosocial functioning."}, {"time": 2435, "text": "And two, you, the person are distressed by these disruptions."}, {"time": 2443, "text": "So people have to meet those two basic criteria before we say they are addicted."}, {"time": 2448, "text": "So once an addict, always an addict, this idea."}, {"time": 2453, "text": "So I've, I mean, some of it is always mapped to the person, all right."}, {"time": 2458, "text": "But just the people I've interacted with who have struggled with alcohol addiction, I don't know what the proper term is."}, {"time": 2466, "text": "It seems like with Alcohol Anonymous, the process of putting that addiction behind you is a very, very long process."}, {"time": 2476, "text": "It's surprisingly long to me."}, {"time": 2478, "text": "That almost seems like a whole life."}, {"time": 2480, "text": "Like, he's not always an addict, but it takes decades."}, {"time": 2484, "text": "It seems like, what is that?"}, {"time": 2487, "text": "What, can you maybe just, from your understanding as a scientist, from your understanding as a human who studies human nature, why does it take so long to treat, to deal with that addiction?"}, {"time": 2502, "text": "Well, you cited Alcohol Anonymous, right?"}, {"time": 2506, "text": "And so I don't think of Alcohol Anonymous as like a treatment that I would send any relative to, like for a drug related problem."}, {"time": 2517, "text": "I think Alcohol Anonymous AA is really good for social interactions, making sure people have a social group and they have peers."}, {"time": 2530, "text": "I mean, that's a good thing."}, {"time": 2531, "text": "We all need that social interaction."}, {"time": 2534, "text": "But I don't think they know much about drugs."}, {"time": 2536, "text": "That's not, it's like saying, well, you know, my uncle broke his knee and he has this support group and they said this, and then we follow that."}, {"time": 2551, "text": "But in our society, judges even sentence people to go to AA."}, {"time": 2560, "text": "But that's the kind of thing that has been allowed to happen in this society because we think of drugs as this moral failing or drug addiction as this moral failing."}, {"time": 2574, "text": "And any idiot can provide treatment and no disrespect to AA because I think what they do is a lot more than what some people do because at least they have this social, these social interactions, you have a social group."}, {"time": 2589, "text": "That's better than what a lot of these other idiots out here do."}, {"time": 2593, "text": "Well, and that social support group unrelated to the drug, it helps cure some of the environment issues you might be in."}, {"time": 2603, "text": "So we kind of coupled the drug to the environment, but the reality is, as you argue, most of the problems come from the environment."}, {"time": 2611, "text": "Certainly with people who are experiencing drug related problem with most of the people, not all, but most."}, {"time": 2616, "text": "There are differences like that psychedelics and like psilocybin has versus alcohol."}, {"time": 2623, "text": "I personally think I've enjoyed both experiences in different ways."}, {"time": 2631, "text": "Is it possible or are we getting into the realm of poetry to describe the benefits, like how it alters the mind, how the different drugs alter the mind and the places it can take you that produce a positive experience?"}, {"time": 2646, "text": "Yeah, no, it's very real."}, {"time": 2649, "text": "Like some drugs take people in places that other drugs can and that's very real."}, {"time": 2657, "text": "I have friends, some of them you know, they, for example, say that they've never had an experience like the one they had with ayahuasca and they've done a number of sort of things, but they did the ayahuasca in a setting with a shaman and this group and they felt like they actually began to heal or solve some problems that they were trying to solve for some years."}, {"time": 2690, "text": "And that's great, that's great for them."}, {"time": 2694, "text": "And nothing else does it for them like that."}, {"time": 2696, "text": "And that's absolutely fantastic."}, {"time": 2699, "text": "All I argue is that if that kind of thing happens for you with ayahuasca, with psilocybin, with some other psychedelic, why isn't it possible that heroin does that for someone or cocaine does that for someone else or MDMA does it for someone, that's it."}, {"time": 2723, "text": "That's interesting to imagine like a shaman for heroin."}, {"time": 2729, "text": "Or cocaine, you said creating an environment for yourself, for use of these different substances and that environment has a very strong impact on the actual experience that you have."}, {"time": 2741, "text": "But I mean, so cocaine is an upper and then."}, {"time": 2747, "text": "Yeah, the way we define drugs like uppers and downers, that's a really kind of inappropriate way but it's a quick way."}, {"time": 2757, "text": "So we certainly say cocaine is an upper or stimulant."}, {"time": 2761, "text": "But it depends on the activity of the person before they take the drug."}, {"time": 2766, "text": "Say like if you're like really active before taking a drug like cocaine, it might actually calm you."}, {"time": 2772, "text": "So it all depends on the activity of the person before they take the drug."}, {"time": 2776, "text": "I remember, I don't know if you know Matthew Johnson is."}, {"time": 2781, "text": "He did all these studies on, or I remember just reading a paper, I didn't get a chance to talk with him much about it, but it was about condom use and cocaine."}, {"time": 2790, "text": "And then like the doses and whether people are more or less likely."}, {"time": 2795, "text": "Like the unsafe thing there is the using or not using, or not using, I guess, condoms during sexual intercourse."}, {"time": 2805, "text": "I don't know, I just, I love that these drugs that have connotation probably because of Hollywood, negative connotations are actually being studied by science."}, {"time": 2814, "text": "And then the actual impact they have, and what are the negative effects."}, {"time": 2817, "text": "Again, in those studies often, the positive effects are difficult to quantify, I think."}, {"time": 2825, "text": "Maybe I guess you can from self report and so on."}, {"time": 2828, "text": "Positive effects are not difficult to quantify."}, {"time": 2831, "text": "You ask people about their euphoria, you can see how well people are getting along."}, {"time": 2838, "text": "Like in our studies that we have people sometimes in groups and you see how well they get along on the various drug conditions or placebo conditions."}, {"time": 2849, "text": "It's really, it's not that difficult."}, {"time": 2852, "text": "And then you can see these amazing studies with like Rick Doblin, like the looking at MDMA and combined with therapy, like how you can overcome certain PTSD things or depression and so on."}, {"time": 2870, "text": "I had to ask you, cause you mentioned The Wire."}, {"time": 2873, "text": "Do you think The Wire, you think movies like Trainspotting, do you think they're ultimately destroying?"}, {"time": 2878, "text": "Cause okay."}, {"time": 2879, "text": "Yes, they celebrate murder, right?"}, {"time": 2882, "text": "The Godfather a little bit."}, {"time": 2885, "text": "But another one, I mean, it's like these racist ass motherfuckers and they also are killing people, but yet they say, we don't do drugs."}, {"time": 2894, "text": "What kind of shit is that?"}, {"time": 2896, "text": "I mean, people who are doing drugs, psilocybin or whatever."}, {"time": 2901, "text": "The thing is we're trying to be better people and trying to make our society better and you're killing people and you are denigrating people for using drugs."}, {"time": 2912, "text": "Are you fucking kidding me?"}, {"time": 2913, "text": "And we let them get away with that as a society."}, {"time": 2915, "text": "Do you see those movies?"}, {"time": 2917, "text": "I apologize if I'm not sufficiently informed."}, {"time": 2919, "text": "You see them as denigrating drugs?"}, {"time": 2922, "text": "I mean, The Godfather."}, {"time": 2926, "text": "The Godfather, The Sopranos is all about that."}, {"time": 2929, "text": "I mean, Christopher is using heroin in The Sopranos and they have an intervention in one season and they are denigrating him."}, {"time": 2943, "text": "You just cut somebody's head off."}, {"time": 2945, "text": "Yeah, but they're, to be fair, they were denigrating, I think, all drugs."}, {"time": 2950, "text": "And then they're drinking alcohol in the butterbeam."}, {"time": 2953, "text": "Come on, I mean, first of all, they're killing people."}, {"time": 2958, "text": "They don't have any space, none, to denigrate somebody who's just trying to alter their consciousness."}, {"time": 2967, "text": "And not bothering anyone else."}, {"time": 2969, "text": "But there's a lot of other mob movies that Scarface celebrates the murder and the drugs equally."}, {"time": 2975, "text": "So, I mean, it doesn't, it celebrates all of the, not just drugs or so on, it's extreme."}, {"time": 2985, "text": "All of those movies, you know, I loved all those movies."}, {"time": 2988, "text": "I'm from Miami, I loved Scarface."}, {"time": 2990, "text": "I even liked The Sopranos that I started looking at that shit with a critical eye and see what it's doing."}, {"time": 2996, "text": "But Scarface is dependent upon the American viewer having a certain view of people who deal in drugs."}, {"time": 3006, "text": "And that view is that these people are animals, basically."}, {"time": 3010, "text": "And in the end, the animal kills himself with too much cocaine and he was high."}, {"time": 3016, "text": "That's what they show."}, {"time": 3017, "text": "And so it's like, what the fuck?"}, {"time": 3020, "text": "So it's leveraging, it's playing into not the better angels of our nature."}, {"time": 3031, "text": "The question."}, {"time": 3031, "text": "Don't take away these great movies from me."}, {"time": 3034, "text": "But it's true, you have to think about them critically in the context."}, {"time": 3038, "text": "I like these movies."}, {"time": 3039, "text": "It's not a matter of taking away."}, {"time": 3041, "text": "It's a matter of making the writers be more honest to the reality."}, {"time": 3048, "text": "That's really true."}, {"time": 3049, "text": "And the writers, the people, the culture, all of it."}, {"time": 3052, "text": "I mean, they write these things."}, {"time": 3054, "text": "I just think about some hip hop artists."}, {"time": 3057, "text": "They say like, this is real."}, {"time": 3058, "text": "This is my experience and so forth."}, {"time": 3061, "text": "And that's how these movie writers, they write this bullshit and then say, well, this is real."}, {"time": 3067, "text": "Anyway, I get so upset talking about it because I know the harm it's doing."}, {"time": 3072, "text": "And I know those kinds of movies are the reason that we have this war on drugs."}, {"time": 3078, "text": "And all of these people are going to jail because of those kinds of movies."}, {"time": 3084, "text": "In the epilogue of your book, you quote James Baldwin."}, {"time": 3088, "text": "You cannot know what you will discover on the journey, what you will do with what you find or what you find will do to you."}, {"time": 3096, "text": "So let me ask, how has drug use or the study of drugs changed you as a human being?"}, {"time": 3102, "text": "It has helped me think about other people's experience."}, {"time": 3106, "text": "So how we're all connected, like going to Northern Ireland."}, {"time": 3111, "text": "I don't know if you know much about the situation with the troubles and what those people went through."}, {"time": 3117, "text": "And so I see people there."}, {"time": 3119, "text": "Northern Ireland, by the way, is all white."}, {"time": 3122, "text": "And you see those people there suffering for the same reasons that people in Appalachia are suffering for."}, {"time": 3129, "text": "Neglected by politicians who told them lies about drugs and not dealing with the real problems, like West Virginia, for example."}, {"time": 3139, "text": "Their water's polluted, the factories have gone away, people are desperate and they're blaming drugs."}, {"time": 3147, "text": "So the politicians don't have to bring back the jobs."}, {"time": 3151, "text": "So we don't have to really make sure they have clean drinking water, things of that nature."}, {"time": 3157, "text": "And so those people are connected to the people in Northern Ireland."}, {"time": 3160, "text": "They're connected to the people in Brownsville."}, {"time": 3163, "text": "They're connected to the people in other places in the United States for the same reason."}, {"time": 3169, "text": "They're connected to the people in Sao Paulo, Brazil."}, {"time": 3174, "text": "Same thing, people are catching hell for the same reason in the Philippines for the same reason."}, {"time": 3181, "text": "And that's why I feel so strongly about this thing because I know there are people getting paid and their paycheck is predicated on subjugating and the suffering of those other people."}, {"time": 3197, "text": "So when we hear about the destructive effects of drugs, it's essentially a scapegoat for the failures of leaders and politicians to help alleviate the suffering of people in those communities."}, {"time": 3211, "text": "Absolutely, it's so easy to say, I'm gonna rid your community of drugs."}, {"time": 3216, "text": "I'm gonna put more cops on the street."}, {"time": 3220, "text": "If you want a problem not to be solved, just give it to the military or the cops."}, {"time": 3228, "text": "You had a tough childhood growing up in Miami, like you said."}, {"time": 3231, "text": "What memory stands out in particular that was formative and helping make you the man you are?"}, {"time": 3240, "text": "That's so hard to say, my grandmother was really important."}, {"time": 3248, "text": "So maybe just her trying to make sure that I think critically, I guess that's the biggest one."}, {"time": 3255, "text": "So you moved in with your parents split?"}, {"time": 3259, "text": "Six, seven, yeah."}, {"time": 3260, "text": "What have you learned about life from her?"}, {"time": 3263, "text": "Be self sufficient, be critical and keep your eyes open and watch out for the okie doke."}, {"time": 3270, "text": "And that's what this whole drug thing is about."}, {"time": 3273, "text": "It's the okie doke, people, it really boils down to just simple thing."}, {"time": 3280, "text": "We're all similar in that we're all just trying to live our life, trying to take care of our kids."}, {"time": 3286, "text": "We want the best for our kids, all of us."}, {"time": 3288, "text": "But yet somehow we've been made to believe that we're different in that way."}, {"time": 3296, "text": "But fundamentally, we're all the same."}, {"time": 3298, "text": "So when people are seeking to feel pleasure, to feel better, why don't we celebrate that?"}, {"time": 3306, "text": "Instead, we denigrate people for that."}, {"time": 3310, "text": "I mean, if I feel better, I'm more likely to treat you well."}, {"time": 3315, "text": "I got to say still, though, you're going against the grain and you're at Columbia, it takes a lot of guts to sort of speak out about these ideas so boldly."}, {"time": 3329, "text": "I don't know how to ask this question."}, {"time": 3332, "text": "Where do you find the guts?"}, {"time": 3334, "text": "What, because it's also perhaps inspirational to others in different disciplines that are sort of taking on the conventional wisdom of the day."}, {"time": 3343, "text": "And challenging it, what does it take to do that?"}, {"time": 3347, "text": "What advice would you give to others like you kind of a little bit afraid to do so?"}, {"time": 3352, "text": "Once you know, you cannot not know, as they say."}, {"time": 3356, "text": "And so I have to look in the mirror."}, {"time": 3358, "text": "And then looking in the mirror, I have to face myself."}, {"time": 3361, "text": "Have I lived honestly?"}, {"time": 3363, "text": "And if I can't face myself, then what am I doing here?"}, {"time": 3370, "text": "You know, that's how I see it."}, {"time": 3374, "text": "One of the things that people don't really talk about with drugs and people who die from some drug related death."}, {"time": 3383, "text": "And I've been thinking about this a whole lot over the past couple of years."}, {"time": 3388, "text": "It's like some of these drugs can take you to a place where you feel so optimistic and positive about humans, our fellow humans."}, {"time": 3399, "text": "And you want to do your best to contribute."}, {"time": 3403, "text": "And because you know the possibilities of what we can be as a society."}, {"time": 3409, "text": "And then you come up with resistance and you, like you say, there are a lot, there's a lot of resistance and people just have a hard time."}, {"time": 3418, "text": "And so if you know humans can be better and they refuse to be better, why be here as someone who knows that we can do this better?"}, {"time": 3432, "text": "I certainly don't want to do it the way we're doing it."}, {"time": 3435, "text": "So you kind of see drugs as mechanisms for potentially elevating the human spirit, sort of making people feel better."}, {"time": 3444, "text": "So you want to communicate that message."}, {"time": 3446, "text": "So it's that plus the fact that drugs are used as scapegoat to not alleviate the suffering of certain communities."}, {"time": 3456, "text": "So those two things come together."}, {"time": 3458, "text": "One of the sort of main points of the book too was to try and get people to understand the possibilities that we could have if we embraced certain drug use."}, {"time": 3472, "text": "If we allowed adults to do this sort of thing."}, {"time": 3476, "text": "Relationships can be better."}, {"time": 3481, "text": "A wide range of beneficial effects."}, {"time": 3484, "text": "People would be, or can learn to be more magnanimous."}, {"time": 3489, "text": "All of these pro social things that we say we value."}, {"time": 3495, "text": "In your previous book, High Price, you talk about rap and DJing, chapter five."}, {"time": 3501, "text": "There's a nice picture of you DJing from 1983."}, {"time": 3504, "text": "So let me ask who in your view, this is the toughest question of this interview, is the greatest hip hop artist of all time?"}, {"time": 3512, "text": "Maybe give some candidates."}, {"time": 3515, "text": "Who is the greatest hip hop artist?"}, {"time": 3517, "text": "I don't know if I'm qualified to make that bag because I have to go back to like Gil Scott Heron."}, {"time": 3527, "text": "Like people think of him as one of the fathers of hip hop."}, {"time": 3532, "text": "That's my all time favorite."}, {"time": 3536, "text": "People like Chuck D from Public Enemy."}, {"time": 3538, "text": "Some of the things that they were doing, I was really digging, but even though I was digging like Public Enemy, but even they got it wrong on drugs."}, {"time": 3548, "text": "Even Gil Scott Heron got it wrong on drugs."}, {"time": 3552, "text": "But they were doing so much other good stuff."}, {"time": 3556, "text": "It helped me to develop as a person."}, {"time": 3560, "text": "And so I think like my son is a hip hop artist now."}, {"time": 3569, "text": "I think those folks who are in the game now, they are a lot more qualified to talk about who's the greatest hip hop artist."}, {"time": 3577, "text": "I'm not qualified."}, {"time": 3578, "text": "The evolution, I mean, have you tracked the evolution from sort of the 90s with Wu Tang and Tupac and Biggie and then to what we have today?"}, {"time": 3588, "text": "So there's just been a crazy amount of progress."}, {"time": 3590, "text": "It's like almost difficult to track."}, {"time": 3592, "text": "Yeah, I mean, I really love what they're doing."}, {"time": 3595, "text": "I like what they accept the part where they get over 40 and they become fucking cops on TV."}, {"time": 3601, "text": "I mean, other than that, I dig what's that about."}, {"time": 3605, "text": "Yeah, I don't understand that, but that's what they do."}, {"time": 3608, "text": "Again, this sort of glorification of cops, that's dangerous for a society."}, {"time": 3616, "text": "And those cats who do that kind of thing, I have a problem with that."}, {"time": 3621, "text": "Is it all sort of to push back a little bit?"}, {"time": 3623, "text": "Because I come from the Soviet Union where there's a huge amount of corruption."}, {"time": 3626, "text": "And when I see what's going on with cops in this country, there's a lot of proper criticism you can apply, but like relative to other places, this is, well, on so many ways, this country is incredible."}, {"time": 3640, "text": "Is your criticism towards cops or towards what cops are asked to do?"}, {"time": 3646, "text": "Yeah, towards what cops are asked to do."}, {"time": 3649, "text": "Cops provide the shield for politicians and those in power."}, {"time": 3654, "text": "Absolutely, because I was in the military, I spent four years in the military and I did what I was told to do."}, {"time": 3660, "text": "And I was ignorant and thought I was doing the right thing."}, {"time": 3666, "text": "And I did what I was told to do."}, {"time": 3668, "text": "And so just like these guys are doing what they're told to do."}, {"time": 3671, "text": "But no, my real beef is with the power structure, the folks who are telling them what to do."}, {"time": 3677, "text": "And also the folks who go play cops on television."}, {"time": 3682, "text": "That imagery, that sort of glorifying cops, that's a problem in a democracy."}, {"time": 3690, "text": "Yeah, all sides of the glorification of the drug war is a problem."}, {"time": 3697, "text": "If I can just linger on a little longer in terms of the effects of drugs, on the positive like mind expanding components of it, what have mind altering drugs teach you about the human mind?"}, {"time": 3715, "text": "Sort of from a neuroscience, not even like a biochemical, but just like the human mind is amazing, right?"}, {"time": 3722, "text": "The places it can go."}, {"time": 3726, "text": "Like, are there some insights you've learned from studying drugs about the mind?"}, {"time": 3731, "text": "Yeah, can I start from a neurochemical perspective first and then we'll go larger?"}, {"time": 3736, "text": "Just from a neurochemical perspective."}, {"time": 3739, "text": "I mean, everything I know about the brain, I learned through drugs because of my interest in drugs."}, {"time": 3745, "text": "So I learned a lot about dopamine neurons in certain regions of the brain, about neuro epinephrine neurons and a wide range of other sort of neural transmission happened because of drugs."}, {"time": 3757, "text": "And so that's a really valuable tool, lessons for me."}, {"time": 3761, "text": "But then when we think that we move out a bit and we think more globally, what have I learned in terms of the mind from drugs?"}, {"time": 3772, "text": "I have really learned how to be more forgiving of people and myself and tolerant, more tolerant of people and certainly learned a lot more about empathy as a result of drug use."}, {"time": 3796, "text": "And like I said earlier, I'm learning what we can be as a species and it's quite incredible, but because of drugs."}, {"time": 3807, "text": "Yeah, there's a certain property of drugs in different ways."}, {"time": 3809, "text": "They take you out of your body, like they help you evaluate yourself from like a third person perspective."}, {"time": 3816, "text": "It's almost like you have a consciousness in here and you get to step outside of it a little bit."}, {"time": 3821, "text": "I mean, that's kind of what meditation does too."}, {"time": 3822, "text": "All of these processes, that's what a hell of a good workout does too."}, {"time": 3827, "text": "It makes you evaluate yourself and then somehow that allows you to be forgiving to yourself and forgiving to others, sort of empathize."}, {"time": 3837, "text": "It trains that part of your brain."}, {"time": 3839, "text": "So stepping outside of yourself, not taking yourself too seriously, that process."}, {"time": 3843, "text": "And different drugs do that in different ways."}, {"time": 3874, "text": "Cause I'm really fascinated with consciousness on the engineering side."}, {"time": 3878, "text": "I really want to build robots that have elements of intelligence, emotion, even consciousness."}, {"time": 3885, "text": "And for that, we need to understand it in ourselves and drugs is all the different kinds of drugs."}, {"time": 3891, "text": "If you safely seems like an incredible tool to understand ourselves."}, {"time": 3895, "text": "And if we're limiting ourselves from certain drugs because of certain political games that are being played, it's sad."}, {"time": 3903, "text": "And people know this, a lot of middle to upper class people know this, the illicit drug trade business is a multi million dollar industry, multi billion dollar industry that could not be supported by people who are poor."}, {"time": 3919, "text": "And that has to be supported by a lot of customers."}, {"time": 3923, "text": "And a lot of people around the world know this, they're in the closet and in the book, I call for them to get out of the closet."}, {"time": 3932, "text": "So we can start being more honest and we can take the pressure off of those people who are not as privileged."}, {"time": 3940, "text": "Like I said, you're brave, you're bold."}, {"time": 3943, "text": "I gotta ask you for some advice."}, {"time": 3945, "text": "What advice would you give to a young person today?"}, {"time": 3948, "text": "High school, maybe undergrad, college, thinking about their career, thinking about how to live a life they can be proud of."}, {"time": 3957, "text": "Yeah, whatever career they choose, just make sure that they dedicate themselves to it and be the best at what they do first."}, {"time": 3966, "text": "That's what you have to do first."}, {"time": 3968, "text": "Like people see me advocating for this position."}, {"time": 3973, "text": "30 years of science is in these opinions, this view."}, {"time": 3978, "text": "And trust me, I would be dismissed if I didn't know my shit, if I was not."}, {"time": 3984, "text": "Yeah, you did the work, you proved yourself, you're legit by the people in the eyes of the people who know."}, {"time": 3991, "text": "Absolutely, so that's the main thing that I would encourage people to do, really know your craft."}, {"time": 3996, "text": "If you know your craft, and then maybe you will be a service to your fellow citizens."}, {"time": 4005, "text": "There are so many people out here faking the funk and they don't know their craft and they're not a service to the people that they claim to serve."}, {"time": 4015, "text": "And when you have a fair number of people like that in positions of power, your society is going to crumble."}, {"time": 4024, "text": "What about the scientific path?"}, {"time": 4026, "text": "You recommend people get a PhD?"}, {"time": 4029, "text": "Not necessarily, like my own children, I don't recommend that."}, {"time": 4034, "text": "So science can, certainly my science can be a very petty sort of space to be in."}, {"time": 4042, "text": "But it was the only sort of path that I had."}, {"time": 4046, "text": "And so I had to do it."}, {"time": 4049, "text": "But no, I would really encourage people to just do something that they enjoy and something that makes them happy."}, {"time": 4060, "text": "Because the greater number of happy people in our society, the better off we all are."}]}]