[{"title": "Daphne Koller: Biomedicine and Machine Learning | Lex Fridman Podcast #93", "id": "xlMTWfkQqbY", "quotes": [{"time": 395, "text": "Do you see the disease and longevity as overlapping completely, partially, or not at all as efforts?"}, {"time": 405, "text": "Those mechanisms are certainly overlapping."}, {"time": 408, "text": "There's a well known phenomenon that says that for most diseases, other than childhood diseases, the risk for contracting that disease increases exponentially year on year, every year from the time you're about 40."}, {"time": 425, "text": "So obviously there's a connection between those two things."}, {"time": 430, "text": "That's not to say that they're identical."}, {"time": 432, "text": "There's clearly aging that happens that is not really associated with any specific disease."}, {"time": 438, "text": "And there's also diseases and mechanisms of disease that are not specifically related to aging."}, {"time": 445, "text": "So I think overlap is where we're at."}, {"time": 450, "text": "It is a little unfortunate that we get older and it seems that there's some correlation with the occurrence of diseases or the fact that we get older."}, {"time": 460, "text": "And both are quite sad."}, {"time": 463, "text": "I mean, there's processes that happen as cells age that I think are contributing to disease."}, {"time": 469, "text": "Some of those have to do with DNA damage that accumulates as cells divide where the repair mechanisms don't fully correct for those."}, {"time": 479, "text": "There are accumulations of proteins that are misfolded and potentially aggregate and those too contribute to disease and will contribute to inflammation."}, {"time": 490, "text": "There's a multitude of mechanisms that have been uncovered that are sort of wear and tear at the cellular level that contribute to disease processes and I'm sure there's many that we don't yet understand."}, {"time": 504, "text": "On a small tangent and perhaps philosophical, the fact that things get older and the fact that things die is a very powerful feature for the growth of new things."}, {"time": 518, "text": "It's a learning, it's a kind of learning mechanism."}, {"time": 521, "text": "So it's both tragic and beautiful."}, {"time": 524, "text": "So do you, so in trying to fight disease and trying to fight aging, do you think about sort of the useful fact of our mortality or would you, like if you were, could be immortal, would you choose to be immortal?"}, {"time": 547, "text": "Again, I think immortal is a very long time and I don't know that that would necessarily be something that I would want to aspire to but I think all of us aspire to an increased health span, I would say, which is an increased amount of time where you're healthy and active and feel as you did when you were 20 and we're nowhere close to that."}, {"time": 576, "text": "People deteriorate physically and mentally over time and that is a very sad phenomenon."}, {"time": 583, "text": "So I think a wonderful aspiration would be if we could all live to the biblical 120 maybe in perfect health."}, {"time": 593, "text": "In high quality of life."}, {"time": 594, "text": "High quality of life."}, {"time": 595, "text": "I think that would be an amazing goal for us to achieve as a society now is the right age 120 or 100 or 150."}, {"time": 603, "text": "I think that's up for debate but I think an increased health span is a really worthy goal."}, {"time": 610, "text": "And anyway, in a grand time of the age of the universe, it's all pretty short."}, {"time": 616, "text": "So from the perspective, you've done obviously a lot of incredible work in machine learning."}, {"time": 622, "text": "So what role do you think data and machine learning play in this goal of trying to understand diseases and trying to eradicate diseases?"}, {"time": 632, "text": "Up until now, I don't think it's played very much of a significant role because largely the data sets that one really needed to enable a powerful machine learning methods, those data sets haven't really existed."}, {"time": 649, "text": "There's been dribs and drabs and some interesting machine learning that has been applied, I would say machine learning slash data science, but the last few years are starting to change that."}, {"time": 660, "text": "So we now see an increase in some large data sets but equally importantly, an increase in technologies that are able to produce data at scale."}, {"time": 674, "text": "It's not typically the case that people have deliberately proactively used those tools for the purpose of generating data for machine learning."}, {"time": 684, "text": "They, to the extent that those techniques have been used for data production, they've been used for data production to drive scientific discovery and the machine learning came as a sort of byproduct second stage of, oh, you know, now we have a data set, let's do machine learning on that rather than a more simplistic data analysis method."}, {"time": 729, "text": "So really focus to get, make data the primary focus and the primary goal and find, use the mechanisms of biology and chemistry to create the kinds of data set that could allow machine learning to benefit the most."}, {"time": 745, "text": "I wouldn't put it in those terms because that says that data is the end goal."}, {"time": 750, "text": "Data is the means."}, {"time": 752, "text": "So for us, the end goal is helping address challenges in human health and the method that we've elected to do that is to apply machine learning to build predictive models and machine learning, in my opinion, can only be really successfully applied especially the more powerful models if you give it data that is of sufficient scale and sufficient quality."}, {"time": 774, "text": "So how do you create those data sets so as to drive the ability to generate predictive models which subsequently help improve human health?"}, {"time": 785, "text": "So before we dive into the details of that, let me take a step back and ask when and where was your interest in human health born?"}, {"time": 796, "text": "Are there moments, events, perhaps if I may ask, tragedies in your own life that catalyzes passion or was it the broader desire to help humankind?"}, {"time": 806, "text": "So I would say it's a bit of both."}, {"time": 809, "text": "So on, I mean, my interest in human health actually dates back to the early 2000s when a lot of my peers in machine learning and I were using data sets that frankly were not very inspiring."}, {"time": 827, "text": "Some of us old timers still remember the quote unquote 20 news groups data set where this was literally a bunch of texts from 20 news groups, a concept that doesn't really even exist anymore."}, {"time": 839, "text": "And the question was, can you classify which news group a particular bag of words came from?"}, {"time": 846, "text": "And it wasn't very interesting."}, {"time": 848, "text": "The data sets at the time on the biology side were much more interesting, both from a technical and also from an aspirational perspective."}, {"time": 857, "text": "They were still pretty small, but they were better than 20 news groups."}, {"time": 860, "text": "And so I started out, I think just by wanting to do something that was more, I don't know, societally useful and technically interesting."}, {"time": 870, "text": "And then over time became more and more interested in the biology and the human health aspects for themselves and began to work even sometimes on papers that were just in biology without having a significant machine learning component."}, {"time": 888, "text": "I think my interest in drug discovery is partly due to an incident I had with when my father sadly passed away about 12 years ago."}, {"time": 902, "text": "He had an autoimmune disease that settled in his lungs and the doctors basically said, well, there's only one thing that we could do, which is give him prednisone."}, {"time": 915, "text": "At some point, I remember a doctor even came and said, hey, let's do a lung biopsy to figure out which autoimmune disease he has."}, {"time": 920, "text": "And I said, would that be helpful?"}, {"time": 923, "text": "Would that change treatment?"}, {"time": 924, "text": "He said, no, there's only prednisone."}, {"time": 925, "text": "That's the only thing we can give him."}, {"time": 927, "text": "And I had friends who were rheumatologists who said the FDA would never approve prednisone today because the ratio of side effects to benefit is probably not large enough."}, {"time": 939, "text": "Today, we're in a state where there's probably four or five, maybe even more, well, it depends for which autoimmune disease, but there are multiple drugs that can help people with autoimmune disease, many of which didn't exist 12 years ago."}, {"time": 956, "text": "And I think we're at a golden time in some ways in drug discovery where there's the ability to create drugs that are much more safe and much more effective than we've ever been able to before."}, {"time": 973, "text": "And what's lacking is enough understanding of biology and mechanism to know where to aim that engine."}, {"time": 982, "text": "And I think that's where machine learning can help."}, {"time": 985, "text": "So in 2018, you started and now lead a company in Citro, which is, like you mentioned, perhaps the focus is drug discovery and the utilization of machine learning for drug discovery."}, {"time": 998, "text": "So you mentioned that, quote, we're really interested in creating what you might call a disease in a dish model, disease in a dish models, places where diseases are complex, where we really haven't had a good model system, where typical animal models that have been used for years, including testing on mice, just aren't very effective."}, {"time": 1018, "text": "So can you try to describe what is an animal model and what is a disease in a dish model?"}, {"time": 1026, "text": "So an animal model for disease is where you create effectively, it's what it sounds like."}, {"time": 1034, "text": "It's oftentimes a mouse where we have introduced some external perturbation that creates the disease and then we cure that disease."}, {"time": 1046, "text": "And the hope is that by doing that, we will cure a similar disease in the human."}, {"time": 1051, "text": "The problem is that oftentimes the way in which we generate the disease in the animal has nothing to do with how that disease actually comes about in a human."}, {"time": 1060, "text": "It's what you might think of as a copy of the phenotype, a copy of the clinical outcome, but the mechanisms are quite different."}, {"time": 1068, "text": "And so curing the disease in the animal, which in most cases doesn't happen naturally, mice don't get Alzheimer's, they don't get diabetes, they don't get atherosclerosis, they don't get autism or schizophrenia."}, {"time": 1082, "text": "Those cures don't translate over to what happens in the human."}, {"time": 1088, "text": "And that's where most drugs fails just because the findings that we had in the mouse don't translate to a human."}, {"time": 1096, "text": "The disease in the dish models is a fairly new approach."}, {"time": 1100, "text": "It's been enabled by technologies that have not existed for more than five to 10 years."}, {"time": 1108, "text": "So for instance, the ability for us to take a cell from any one of us, you or me, revert that say skin cell to what's called stem cell status, which is what's called the pluripotent cell that can then be differentiated into different types of cells."}, {"time": 1127, "text": "So from that pluripotent cell, one can create a Lex neuron or a Lex cardiomyocyte or a Lex hepatocyte that has your genetics, but that right cell type."}, {"time": 1140, "text": "And so if there's a genetic burden of disease that would manifest in that particular cell type, you might be able to see it by looking at those cells and saying, oh, that's what potentially sick cells look like versus healthy cells and then explore what kind of interventions might revert the unhealthy looking cell to a healthy cell."}, {"time": 1164, "text": "Now, of course, curing cells is not the same as curing people."}, {"time": 1200, "text": "So that's really what we're hoping to do."}, {"time": 1202, "text": "That step, that backward step, I was reading about it, the Yamanaka factor."}, {"time": 1209, "text": "So it's like that reverse step back to stem cells."}, {"time": 1213, "text": "Seems like magic."}, {"time": 1215, "text": "Honestly, before that happened, I think very few people would have predicted that to be possible."}, {"time": 1222, "text": "Can you maybe elaborate, is it actually possible?"}, {"time": 1225, "text": "Like where, like how stable?"}, {"time": 1227, "text": "So this result was maybe like, I don't know how many years ago, maybe 10 years ago was first demonstrated, something like that."}, {"time": 1233, "text": "Is this, how hard is this?"}, {"time": 1235, "text": "Like how noisy is this backward step?"}, {"time": 1237, "text": "It seems quite incredible and cool."}, {"time": 1239, "text": "It is, it is incredible and cool."}, {"time": 1242, "text": "It was much more, I think finicky and bespoke at the early stages when the discovery was first made."}, {"time": 1249, "text": "But at this point, it's become almost industrialized."}, {"time": 1254, "text": "There are what's called contract research organizations, vendors that will take a sample from a human and revert it back to stem cell status."}, {"time": 1264, "text": "And it works a very good fraction of the time."}, {"time": 1267, "text": "Now there are people who will ask, I think good questions."}, {"time": 1272, "text": "Is this really truly a stem cell or does it remember certain aspects of what, of changes that were made in the human beyond the genetics?"}, {"time": 1282, "text": "It's passed as a skin cell, yeah."}, {"time": 1284, "text": "It's passed as a skin cell or it's passed in terms of exposures to different environmental factors and so on."}, {"time": 1290, "text": "So I think the consensus right now is that these are not always perfect and there is little bits and pieces of memory sometimes, but by and large, these are actually pretty good."}, {"time": 1304, "text": "So one of the key things, well, maybe you can correct me, but one of the useful things for machine learning is size, scale of data."}, {"time": 1314, "text": "How easy it is to do these kinds of reversals to stem cells and then disease in a dish models at scale."}, {"time": 1322, "text": "Is that a huge challenge or not?"}, {"time": 1326, "text": "So the reversal is not as of this point something that can be done at the scale of tens of thousands or hundreds of thousands."}, {"time": 1338, "text": "I think total number of stem cells or IPS cells that are what's called induced pluripotent stem cells in the world I think is somewhere between five and 10,000 last I looked."}, {"time": 1351, "text": "Now again, that might not count things that exist in this or that academic center and they may add up to a bit more, but that's about the range."}, {"time": 1360, "text": "So it's not something that you could at this point generate IPS cells from a million people, but maybe you don't need to because maybe that background is enough because it can also be now perturbed in different ways."}, {"time": 1376, "text": "And some people have done really interesting experiments in for instance, taking cells from a healthy human and then introducing a mutation into it using one of the other miracle technologies that's emerged in the last decade which is CRISPR gene editing and introduced a mutation that is known to be pathogenic."}, {"time": 1399, "text": "And so you can now look at the healthy cells and the unhealthy cells, the one with the mutation and do a one on one comparison where everything else is held constant."}, {"time": 1408, "text": "And so you could really start to understand specifically what the mutation does at the cellular level."}, {"time": 1414, "text": "So the IPS cells are a great starting point and obviously more diversity is better because you also wanna capture ethnic background and how that affects things, but maybe you don't need one from every single patient with every single type of disease because we have other tools at our disposal."}, {"time": 1430, "text": "Well, how much difference is there between people I mentioned ethnic background in terms of IPS cells?"}, {"time": 1434, "text": "So we're all like, it seems like these magical cells that can do to create anything between different populations, different people."}, {"time": 1444, "text": "Is there a lot of variability between cell cells?"}, {"time": 1447, "text": "Well, first of all, there's the variability, that's driven simply by the fact that genetically we're different."}, {"time": 1453, "text": "So a stem cell that's derived from my genotype is gonna be different from a stem cell that's derived from your genotype."}, {"time": 1460, "text": "There's also some differences that have more to do with for whatever reason, some people's stem cells differentiate better than other people's stem cells."}, {"time": 1469, "text": "We don't entirely understand why."}, {"time": 1471, "text": "So there's certainly some differences there as well, but the fundamental difference and the one that we really care about and is a positive is that the fact that the genetics are different and therefore recapitulate my disease burden versus your disease burden."}, {"time": 1487, "text": "What's a disease burden?"}, {"time": 1489, "text": "Well, a disease burden is just if you think, I mean, it's not a well defined mathematical term, although there are mathematical formulations of it."}, {"time": 1498, "text": "If you think about the fact that some of us are more likely to get a certain disease than others because we have more variations in our genome that are causative of the disease, maybe fewer that are protective of the disease."}, {"time": 1512, "text": "People have quantified that using what are called polygenic risk scores, which look at all of the variations in an individual person's genome and add them all up in terms of how much risk they confer for a particular disease."}, {"time": 1527, "text": "And then they've put people on a spectrum of their disease risk."}, {"time": 1532, "text": "And for certain diseases where we've been sufficiently powered to really understand the connection between the many, many small variations that give rise to an increased disease risk, there's some pretty significant differences in terms of the risk between the people, say at the highest decile of this polygenic risk score and the people at the lowest decile."}, {"time": 1553, "text": "Sometimes those differences are factor of 10 or 12 higher."}, {"time": 1558, "text": "So there's definitely a lot that our genetics contributes to disease risk, even if it's not by any stretch the full explanation."}, {"time": 1569, "text": "And from a machine learning perspective, there's signal there."}, {"time": 1572, "text": "There is definitely signal in the genetics and there's even more signal, we believe, in looking at the cells that are derived from those different genetics because in principle, you could say all the signal is there at the genetics level."}, {"time": 1588, "text": "So we don't need to look at the cells, but our understanding of the biology is so limited at this point than seeing what actually happens at the cellular level is a heck of a lot closer to the human clinical outcome than looking at the genetics directly."}, {"time": 1604, "text": "And so we can learn a lot more from it than we could by looking at genetics alone."}, {"time": 1609, "text": "So just to get a sense, I don't know if it's easy to do, but what kind of data is useful in this disease in a dish model?"}, {"time": 1616, "text": "Like what's the source of raw data information?"}, {"time": 1619, "text": "And also from my outsider's perspective, so biology and cells are squishy things."}, {"time": 1628, "text": "And then how do you connect the computer to that?"}, {"time": 1635, "text": "Which sensory mechanisms, I guess."}, {"time": 1637, "text": "So that's another one of those revolutions that have happened in the last 10 years in that our ability to measure cells very quantitatively has also dramatically increased."}, {"time": 1650, "text": "So back when I started doing biology in the late 90s, early 2000s, that was the initial era where we started to measure biology in really quantitative ways using things like microarrays, where you would measure in a single experiment the activity level, what's called expression level of every gene in the genome in that sample."}, {"time": 1676, "text": "And that ability is what actually allowed us to even understand that there are molecular subtypes of diseases like cancer, where up until that point, it's like, oh, you have breast cancer."}, {"time": 1689, "text": "But then when we looked at the molecular data, it was clear that there's different subtypes of breast cancer that at the level of gene activity look completely different to each other."}, {"time": 1700, "text": "So that was the beginning of this process."}, {"time": 1703, "text": "Now we have the ability to measure individual cells in terms of their gene activity using what's called single cell RNA sequencing, which basically sequences the RNA, which is that activity level of different genes for every gene in the genome."}, {"time": 1720, "text": "And you could do that at single cell level."}, {"time": 1722, "text": "So that's an incredibly powerful way of measuring cells."}, {"time": 1725, "text": "I mean, you literally count the number of transcripts."}, {"time": 1727, "text": "So it really turns that squishy thing into something that's digital."}, {"time": 1731, "text": "Another tremendous data source that's emerged in the last few years is microscopy and specifically even super resolution microscopy, where you could use digital reconstruction to look at subcellular structures, sometimes even things that are below the diffraction limit of light by doing a sophisticated reconstruction."}, {"time": 1753, "text": "And again, that gives you a tremendous amount of information at the subcellular level."}, {"time": 1758, "text": "There's now more and more ways that amazing scientists out there are developing for getting new types of information from even single cells."}, {"time": 1770, "text": "And so that is a way of turning those squishy things into digital data."}, {"time": 1777, "text": "Into beautiful data sets."}, {"time": 1778, "text": "But so that data set then with machine learning tools allows you to maybe understand the developmental, like the mechanism of a particular disease."}, {"time": 1789, "text": "And if it's possible to sort of at a high level describe, how does that help lead to a drug discovery that can help prevent, reverse that mechanism?"}, {"time": 1805, "text": "So I think there's different ways in which this data could potentially be used."}, {"time": 1810, "text": "Some people use it for scientific discovery and say, oh, look, we see this phenotype at the cellular level."}, {"time": 1820, "text": "So let's try and work our way backwards and think which genes might be involved in pathways that give rise to that."}, {"time": 1827, "text": "So that's a very sort of analytical method to sort of work our way backwards using our understanding of known biology."}, {"time": 1838, "text": "Some people use it in a somewhat more, sort of forward, if that was a backward, this would be forward, which is to say, okay, if I can perturb this gene, does it show a phenotype that is similar to what I see in disease patients?"}, {"time": 1856, "text": "And so maybe that gene is actually causal of the disease."}, {"time": 1858, "text": "So that's a different way."}, {"time": 1860, "text": "And then there's what we do, which is basically to take that very large collection of data and use machine learning to uncover the patterns that emerge from it."}, {"time": 1872, "text": "So for instance, what are those subtypes that might be similar at the human clinical outcome, but quite distinct when you look at the molecular data?"}, {"time": 1881, "text": "And then if we can identify such a subtype, are there interventions that if I apply it to cells that come from this subtype of the disease and you apply that intervention, it could be a drug or it could be a CRISPR gene intervention, does it revert the disease state to something that looks more like normal, happy, healthy cells?"}, {"time": 1904, "text": "And so hopefully if you see that, that gives you a certain hope that that intervention will also have a meaningful clinical benefit to people."}, {"time": 1915, "text": "And there's obviously a bunch of things that you would wanna do after that to validate that, but it's a very different and much less hypothesis driven way of uncovering new potential interventions and might give rise to things that are not the same things that everyone else is already looking at."}, {"time": 1932, "text": "That's, I don't know, I'm just like to psychoanalyze my own feeling about our discussion currently."}, {"time": 1938, "text": "It's so exciting to talk about sort of a machine, fundamentally, well, something that's been turned into a machine learning problem and that says can have so much real world impact."}, {"time": 1949, "text": "That's how I feel too."}, {"time": 1950, "text": "That's kind of exciting because I'm so, most of my day is spent with data sets that I guess closer to the news groups."}, {"time": 1959, "text": "So this is a kind of, it just feels good to talk about."}, {"time": 1961, "text": "In fact, I almost don't wanna talk about machine learning."}, {"time": 1965, "text": "I wanna talk about the fundamentals of the data set, which is an exciting place to be."}, {"time": 1971, "text": "It's what gets me up in the morning."}, {"time": 1973, "text": "It's also what attracts a lot of the people who work at InCetro to InCetro because I think all of the, certainly all of our machine learning people are outstanding and could go get a job selling ads online or doing eCommerce or even self driving cars."}, {"time": 1992, "text": "But I think they would want, they come to us because they want to work on something that has more of an aspirational nature and can really benefit humanity."}, {"time": 2004, "text": "What, with these approaches, what do you hope, what kind of diseases can be helped?"}, {"time": 2011, "text": "We mentioned Alzheimer's, schizophrenia, type 2 diabetes."}, {"time": 2013, "text": "Can you just describe the various kinds of diseases that this approach can help?"}, {"time": 2018, "text": "Well, we don't know."}, {"time": 2019, "text": "And I try and be very cautious about making promises about some things that, oh, we will cure X."}, {"time": 2026, "text": "People make that promise."}, {"time": 2028, "text": "And I think it's, I tried to first deliver and then promise as opposed to the other way around."}, {"time": 2034, "text": "There are characteristics of a disease that make it more likely that this type of approach can potentially be helpful."}, {"time": 2042, "text": "So for instance, diseases that have a very strong genetic basis are ones that are more likely to manifest in a stem cell derived model."}, {"time": 2053, "text": "We would want the cellular models to be relatively reproducible and robust so that you could actually get enough of those cells and in a way that isn't very highly variable and noisy."}, {"time": 2070, "text": "You would want the disease to be relatively contained in one or a small number of cell types that you could actually create in an in vitro, in a dish setting."}, {"time": 2080, "text": "Whereas if it's something that's really broad and systemic and involves multiple cells that are in very distal parts of your body, putting that all in the dish is really challenging."}, {"time": 2090, "text": "So we want to focus on the ones that are most likely to be successful today with the hope, I think, that really smart bioengineers out there are developing better and better systems all the time so that diseases that might not be tractable today might be tractable in three years."}, {"time": 2111, "text": "So for instance, five years ago, these stem cell derived models didn't really exist."}, {"time": 2116, "text": "People were doing most of the work in cancer cells and cancer cells are very, very poor models of most human biology because they're, A, they were cancer to begin with and B, as you passage them and they proliferate in a dish, they become, because of the genomic instability, even less similar to human biology."}, {"time": 2135, "text": "Now we have these stem cell derived models."}, {"time": 2139, "text": "We have the capability to reasonably robustly, not quite at the right scale yet, but close, to derive what's called organoids, which are these teeny little sort of multicellular organ, sort of models of an organ system."}, {"time": 2156, "text": "So there's cerebral organoids and liver organoids and kidney organoids and."}, {"time": 2161, "text": "Yeah, brain organoids."}, {"time": 2163, "text": "That's organoids."}, {"time": 2164, "text": "It's possibly the coolest thing I've ever seen."}, {"time": 2165, "text": "Is that not like the coolest thing?"}, {"time": 2168, "text": "And then I think on the horizon, we're starting to see things like connecting these organoids to each other so that you could actually start, and there's some really cool papers that start to do that where you can actually start to say, okay, can we do multi organ system stuff?"}, {"time": 2182, "text": "There's many challenges to that."}, {"time": 2183, "text": "It's not easy by any stretch, but it might, I'm sure people will figure it out."}, {"time": 2189, "text": "And in three years or five years, there will be disease models that we could make for things that we can't make today."}, {"time": 2195, "text": "Yeah, and this conversation would seem almost outdated with the kind of scale that could be achieved in like three years."}, {"time": 2202, "text": "That's the hope."}, {"time": 2202, "text": "That would be so cool."}, {"time": 2203, "text": "So you've cofounded Coursera with Andrew Ng and were part of the whole MOOC revolution."}, {"time": 2211, "text": "So to jump topics a little bit, can you maybe tell the origin story of the history, the origin story of MOOCs, of Coursera, and in general, your teaching to huge audiences on a very sort of impactful topic of AI in general?"}, {"time": 2232, "text": "So I think the origin story of MOOCs emanates from a number of efforts that occurred at Stanford University around the late 2000s where different individuals within Stanford, myself included, were getting really excited about the opportunities of using online technologies as a way of achieving both improved quality of teaching and also improved scale."}, {"time": 2260, "text": "And so Andrew, for instance, led the Stanford Engineering Everywhere, which was sort of an attempt to take 10 Stanford courses and put them online just as video lectures."}, {"time": 2302, "text": "And so those efforts eventually sort of started to interplay with each other and created a tremendous sense of excitement and energy within the Stanford community about the potential of online teaching and led in the fall of 2011 to the launch of the first Stanford MOOCs."}, {"time": 2323, "text": "By the way, MOOCs, it's probably impossible that people don't know, but it's, I guess, massive."}, {"time": 2329, "text": "Open online courses."}, {"time": 2331, "text": "We did not come up with the acronym."}, {"time": 2334, "text": "I'm not particularly fond of the acronym, but it is what it is."}, {"time": 2337, "text": "It is what it is."}, {"time": 2338, "text": "Big bang is not a great term for the start of the universe, but it is what it is."}, {"time": 2341, "text": "Probably so."}, {"time": 2345, "text": "So anyway, so those courses launched in the fall of 2011, and there were, within a matter of weeks, with no real publicity campaign, just a New York Times article that went viral, about 100,000 students or more in each of those courses."}, {"time": 2364, "text": "And I remember this conversation that Andrew and I had."}, {"time": 2369, "text": "We were just like, wow, there's this real need here."}, {"time": 2373, "text": "And I think we both felt like, sure, we were accomplished academics and we could go back and go back to our labs, write more papers."}, {"time": 2382, "text": "But if we did that, then this wouldn't happen."}, {"time": 2385, "text": "And it seemed too important not to happen."}, {"time": 2388, "text": "And so we spent a fair bit of time debating, do we wanna do this as a Stanford effort, kind of building on what we'd started?"}, {"time": 2396, "text": "Do we wanna do this as a for profit company?"}, {"time": 2399, "text": "Do we wanna do this as a nonprofit?"}, {"time": 2400, "text": "And we decided ultimately to do it as we did with Coursera."}, {"time": 2404, "text": "And so, you know, we started really operating as a company at the beginning of 2012."}, {"time": 2413, "text": "And the rest is history."}, {"time": 2415, "text": "But how did you, was that really surprising to you?"}, {"time": 2419, "text": "How did you at that time and at this time make sense of this need for sort of global education you mentioned that you felt that, wow, the popularity indicates that there's a hunger for sort of globalization of learning."}, {"time": 2437, "text": "I think there is a hunger for learning that, you know, globalization is part of it, but I think it's just a hunger for learning."}, {"time": 2447, "text": "The world has changed in the last 50 years."}, {"time": 2450, "text": "It used to be that you finished college, you got a job, by and large, the skills that you learned in college were pretty much what got you through the rest of your job history."}, {"time": 2461, "text": "And yeah, you learn some stuff, but it wasn't a dramatic change."}, {"time": 2465, "text": "Today, we're in a world where the skills that you need for a lot of jobs, they didn't even exist when you went to college."}, {"time": 2472, "text": "And the jobs, and many of the jobs that existed when you went to college don't even exist today or are dying."}, {"time": 2478, "text": "So part of that is due to AI, but not only."}, {"time": 2482, "text": "And we need to find a way of keeping people, giving people access to the skills that they need today."}, {"time": 2489, "text": "And I think that's really what's driving a lot of this hunger."}, {"time": 2493, "text": "So I think if we even take a step back, for you, all of this started in trying to think of new ways to teach or to, new ways to sort of organize the material and present the material in a way that would help the education process, the pedagogy, yeah."}, {"time": 2511, "text": "So what have you learned about effective education from this process of playing, of experimenting with different ideas?"}, {"time": 2520, "text": "So we learned a number of things."}, {"time": 2523, "text": "Some of which I think could translate back and have translated back effectively to how people teach on campus."}, {"time": 2529, "text": "And some of which I think are more specific to people who learn online, more sort of people who learn as part of their daily life."}, {"time": 2538, "text": "So we learned, for instance, very quickly that short is better."}, {"time": 2543, "text": "So people who are especially in the workforce can't do a 15 week semester long course."}, {"time": 2550, "text": "They just can't fit that into their lives."}, {"time": 2552, "text": "Sure, can you describe the shortness of what?"}, {"time": 2555, "text": "The entirety, so every aspect, so the little lecture, the lecture's short, the course is short."}, {"time": 2563, "text": "We started out, the first online education efforts were actually MIT's OpenCourseWare initiatives."}, {"time": 2570, "text": "And that was recording of classroom lectures and, Hour and a half or something like that, yeah."}, {"time": 2577, "text": "And that didn't really work very well."}, {"time": 2580, "text": "I mean, some people benefit."}, {"time": 2581, "text": "I mean, of course they did, but it's not really a very palatable experience for someone who has a job and three kids and they need to run errands and such."}, {"time": 2593, "text": "They can't fit 15 weeks into their life and the hour and a half is really hard."}, {"time": 2600, "text": "So we learned very quickly."}, {"time": 2602, "text": "I mean, we started out with short video modules and over time we made them shorter because we realized that 15 minutes was still too long."}, {"time": 2611, "text": "If you wanna fit in when you're waiting in line for your kid's doctor's appointment, it's better if it's five to seven."}, {"time": 2618, "text": "We learned that 15 week courses don't work and you really wanna break this up into shorter units so that there is a natural completion point, gives people a sense of they're really close to finishing something meaningful."}, {"time": 2630, "text": "They can always come back and take part two and part three."}, {"time": 2633, "text": "We also learned that compressing the content works really well because if some people that pace works well and for others, they can always rewind and watch again."}, {"time": 2643, "text": "And so people have the ability to then learn at their own pace."}, {"time": 2646, "text": "And so that flexibility, the brevity and the flexibility are both things that we found to be very important."}, {"time": 2655, "text": "We learned that engagement during the content is important and the quicker you give people feedback, the more likely they are to be engaged."}, {"time": 2662, "text": "Hence the introduction of these, which we actually was an intuition that I had going in and was then validated using data that introducing some of these sort of little micro quizzes into the lectures really helps."}, {"time": 2676, "text": "Self graded as automatically graded assessments really helped too because it gives people feedback."}, {"time": 2681, "text": "See, there you are."}, {"time": 2683, "text": "So all of these are valuable."}, {"time": 2685, "text": "And then we learned a bunch of other things too."}, {"time": 2687, "text": "We did some really interesting experiments, for instance, on gender bias and how having a female role model as an instructor can change the balance of men to women in terms of, especially in STEM courses."}, {"time": 2702, "text": "And you could do that online by doing AB testing in ways that would be really difficult to go on campus."}, {"time": 2707, "text": "Oh, that's exciting."}, {"time": 2709, "text": "But so the shortness, the compression, I mean, that's actually, so that probably is true for all good editing is always just compressing the content, making it shorter."}, {"time": 2721, "text": "So that puts a lot of burden on the creator of the, the instructor and the creator of the educational content."}, {"time": 2728, "text": "Probably most lectures at MIT or Stanford could be five times shorter if the preparation was put enough."}, {"time": 2737, "text": "So maybe people might disagree with that, but like the Christmas, the clarity that a lot of the, like Coursera delivers is, how much effort does that take?"}, {"time": 2750, "text": "So first of all, let me say that it's not clear that that crispness would work as effectively in a face to face setting because people need time to absorb the material."}, {"time": 2762, "text": "And so you need to at least pause and give people a chance to reflect and maybe practice."}, {"time": 2767, "text": "And that's what MOOCs do is that they give you these chunks of content and then ask you to practice with it."}, {"time": 2773, "text": "And that's where I think some of the newer pedagogy that people are adopting in face to face teaching that have to do with interactive learning and such can be really helpful."}, {"time": 2783, "text": "But both those approaches, whether you're doing that type of methodology in online teaching or in that flipped classroom, interactive teaching."}, {"time": 2794, "text": "What's that, sorry to pause, what's flipped classroom?"}, {"time": 2797, "text": "Flipped classroom is a way in which online content is used to supplement face to face teaching where people watch the videos perhaps and do some of the exercises before coming to class."}, {"time": 2809, "text": "And then when they come to class, it's actually to do much deeper problem solving oftentimes in a group."}, {"time": 2816, "text": "But any one of those different pedagogies that are beyond just standing there and droning on in front of the classroom for an hour and 15 minutes require a heck of a lot more preparation."}, {"time": 2829, "text": "And so it's one of the challenges I think that people have that we had when trying to convince instructors to teach on Coursera."}, {"time": 2836, "text": "And it's part of the challenges that pedagogy experts on campus have in trying to get faculty to teach differently is that it's actually harder to teach that way than it is to stand there and drone."}, {"time": 2847, "text": "Do you think MOOCs will replace in person education or become the majority of in person of education of the way people learn in the future?"}, {"time": 2861, "text": "Again, the future could be very far away, but where's the trend going do you think?"}, {"time": 2866, "text": "So I think it's a nuanced and complicated answer."}, {"time": 2870, "text": "I don't think MOOCs will replace face to face teaching."}, {"time": 2875, "text": "I think learning is in many cases a social experience."}, {"time": 2880, "text": "And even at Coursera, we had people who naturally formed study groups, even when they didn't have to, to just come and talk to each other."}, {"time": 2890, "text": "And we found that that actually benefited their learning in very important ways."}, {"time": 2895, "text": "So there was more success among learners who had those study groups than among ones who didn't."}, {"time": 2902, "text": "So I don't think it's just gonna, oh, we're all gonna just suddenly learn online with a computer and no one else in the same way that recorded music has not replaced live concerts."}, {"time": 2944, "text": "Briefly, it might be a difficult question to ask, but there's a lot of people fascinated by artificial intelligence, by machine learning, by deep learning."}, {"time": 2953, "text": "Is there a recommendation for the next year or for a lifelong journey of somebody interested in this?"}, {"time": 2961, "text": "How do they begin?"}, {"time": 2963, "text": "How do they enter that learning journey?"}, {"time": 2967, "text": "I think the important thing is first to just get started."}, {"time": 2970, "text": "And there's plenty of online content that one can get for both the core foundations of mathematics and statistics and programming."}, {"time": 2982, "text": "And then from there to machine learning, I would encourage people not to skip to quickly pass the foundations because I find that there's a lot of people who learn machine learning, whether it's online or on campus without getting those foundations."}, {"time": 2996, "text": "And they basically just turn the crank on existing models in ways that A, don't allow for a lot of innovation and an adjustment to the problem at hand, but also B, are sometimes just wrong and they don't even realize that their application is wrong because there's artifacts that they haven't fully understood."}, {"time": 3015, "text": "So I think the foundations, machine learning is an important step."}, {"time": 3050, "text": "Practice."}, {"time": 3052, "text": "Perhaps a bit of a romanticized question, but what idea in deep learning do you find, have you found in your journey the most beautiful or surprising or interesting?"}, {"time": 3067, "text": "Perhaps not just deep learning, but AI in general, statistics."}, {"time": 3074, "text": "I'm gonna answer with two things."}, {"time": 3079, "text": "One would be the foundational concept of end to end training, which is that you start from the raw data and you train something that is not like a single piece, but rather towards the actual goal that you're looking to."}, {"time": 3098, "text": "From the raw data to the outcome, like no details in between."}, {"time": 3103, "text": "Well, not no details, but the fact that you, I mean, you could certainly introduce building blocks that were trained towards other tasks."}, {"time": 3110, "text": "I'm actually coming to that in my second half of the answer, but it doesn't have to be like a single monolithic blob in the middle."}, {"time": 3118, "text": "Actually, I think that's not ideal, but rather the fact that at the end of the day, you can actually train something that goes all the way from the beginning to the end."}, {"time": 3126, "text": "And the other one that I find really compelling is the notion of learning a representation that in its turn, even if it was trained to another task, can potentially be used as a much more rapid starting point to solving a different task."}, {"time": 3146, "text": "And that's, I think, reminiscent of what makes people successful learners."}, {"time": 3152, "text": "It's something that is relatively new in the machine learning space."}, {"time": 3156, "text": "I think it's underutilized even relative to today's capabilities, but more and more of how do we learn sort of reusable representation?"}, {"time": 3165, "text": "And so end to end and transfer learning."}, {"time": 3171, "text": "Is it surprising to you that neural networks are able to, in many cases, do these things?"}, {"time": 3176, "text": "Is it maybe taken back to when you first would dive deep into neural networks or in general, even today, is it surprising that neural networks work at all and work wonderfully to do this kind of raw end to end and end to end learning and even transfer learning?"}, {"time": 3196, "text": "I think I was surprised by how well when you have large enough amounts of data, it's possible to find a meaningful representation in what is an exceedingly high dimensional space."}, {"time": 3216, "text": "And so I find that to be really exciting and people are still working on the math for that."}, {"time": 3221, "text": "There's more papers on that every year."}, {"time": 3223, "text": "And I think it would be really cool if we figured that out, but that to me was a surprise because in the early days when I was starting my way in machine learning and the data sets were rather small, I think we believed, I believed that you needed to have a much more constrained and knowledge rich search space to really make, to really get to a meaningful answer."}, {"time": 3251, "text": "And I think it was true at the time."}, {"time": 3253, "text": "What I think is still a question is will a completely knowledge free approach where there's no prior knowledge going into the construction of the model, is that gonna be the solution or not?"}, {"time": 3271, "text": "It's not actually the solution today in the sense that the architecture of a convolutional neural network that's used for images is actually quite different to the type of network that's used for language and yet different from the one that's used for speech or biology or any other application."}, {"time": 3292, "text": "There's still some insight that goes into the structure of the network to get the right performance."}, {"time": 3300, "text": "Will you be able to come up with a universal learning machine?"}, {"time": 3305, "text": "I wonder if there's always has to be some insight injected somewhere or whether it can converge."}, {"time": 3310, "text": "So you've done a lot of interesting work with probabilistic graphical models in general, Bayesian deep learning and so on."}, {"time": 3318, "text": "Can you maybe speak high level, how can learning systems deal with uncertainty?"}, {"time": 3325, "text": "One of the limitations I think of a lot of machine learning models is that they come up with an answer and you don't know how much you can believe that answer."}, {"time": 3340, "text": "And oftentimes the answer is actually quite poorly calibrated relative to its uncertainties."}, {"time": 3350, "text": "Even if you look at where the confidence that comes out of say the neural network at the end, and you ask how much more likely is an answer of 0.8 versus 0.9, it's not really in any way calibrated to the actual reliability of that network and how true it is."}, {"time": 3373, "text": "And the further away you move from the training data, the more, not only the more wrong the network is, often it's more wrong and more confident in its wrong answer."}, {"time": 3384, "text": "And that is a serious issue in a lot of application areas."}, {"time": 3416, "text": "So I think creating more of an understanding of how do you produce networks that are calibrated in their uncertainty and can also say, you know what, I give up."}, {"time": 3430, "text": "I don't know what to say about this particular data instance because I've never seen something that's sufficiently like it before."}, {"time": 3438, "text": "I think it's going to be really important in mission critical applications, especially ones where human life is at stake and that includes medical applications, but it also includes automated driving because you'd want the network to be able to say, you know what, I have no idea what this blob is that I'm seeing in the middle of the road."}, {"time": 3457, "text": "So I'm just going to stop because I don't want to potentially run over a pedestrian that I don't recognize."}, {"time": 3462, "text": "Is there good mechanisms, ideas of how to allow learning systems to provide that uncertainty along with their predictions?"}, {"time": 3474, "text": "Certainly people have come up with mechanisms that involve Bayesian deep learning, deep learning that involves Gaussian processes."}, {"time": 3484, "text": "I mean, there's a slew of different approaches that people have come up with."}, {"time": 3489, "text": "There's methods that use ensembles of networks trained with different subsets of data or different random starting points."}, {"time": 3497, "text": "Those are actually sometimes surprisingly good at creating a sort of set of how confident or not you are in your answer."}, {"time": 3506, "text": "It's very much an area of open research."}, {"time": 3510, "text": "Let's cautiously venture back into the land of philosophy and speaking of AI systems providing uncertainty, somebody like Stuart Russell believes that as we create more and more intelligence systems, it's really important for them to be full of self doubt because if they're given more and more power, we want the way to maintain human control over AI systems or human supervision, which is true."}, {"time": 3537, "text": "Like you just mentioned with autonomous vehicles, it's really important to get human supervision when the car is not sure because if it's really confident in cases when it can get in trouble, it's gonna be really problematic."}, {"time": 3549, "text": "So let me ask about sort of the questions of AGI and human level intelligence."}, {"time": 3554, "text": "I mean, we've talked about curing diseases, which is sort of fundamental thing we can have an impact today, but AI people also dream of both understanding and creating intelligence."}, {"time": 3570, "text": "Is that something you dream about?"}, {"time": 3572, "text": "Is that something you think is within our reach to be thinking about as computer scientists?"}, {"time": 3579, "text": "Well, boy, let me tease apart different parts of that question."}, {"time": 3585, "text": "The worst question."}, {"time": 3586, "text": "Yeah, it's a multi part question."}, {"time": 3590, "text": "So let me start with the feasibility of AGI."}, {"time": 3597, "text": "Then I'll talk about the timelines a little bit and then talk about, well, what controls does one need when thinking about protections in the AI space?"}, {"time": 3610, "text": "So, I think AGI obviously is a longstanding dream that even our early pioneers in the space had, the Turing test and so on are the earliest discussions of that."}, {"time": 3627, "text": "We're obviously closer than we were 70 or so years ago, but I think it's still very far away."}, {"time": 3637, "text": "I think machine learning algorithms today are really exquisitely good pattern recognizers in very specific problem domains where they have seen enough training data to make good predictions."}, {"time": 3653, "text": "You take a machine learning algorithm and you move it to a slightly different version of even that same problem, far less one that's different and it will just completely choke."}, {"time": 3666, "text": "So I think we're nowhere close to the versatility and flexibility of even a human toddler in terms of their ability to context switch and solve different problems using a single knowledge base, single brain."}, {"time": 3684, "text": "So am I desperately worried about the machines taking over the universe and starting to kill people because they want to have more power?"}, {"time": 3698, "text": "Well, so to pause on that, so you kind of intuited that super intelligence is a very difficult thing to achieve."}, {"time": 3706, "text": "Even intelligence."}, {"time": 3707, "text": "Intelligence, intelligence."}, {"time": 3708, "text": "Super intelligence, we're not even close to intelligence."}, {"time": 3710, "text": "Even just the greater abilities of generalization of our current systems."}, {"time": 3715, "text": "But we haven't answered all the parts and we'll take another."}, {"time": 3720, "text": "I'm getting to the second part."}, {"time": 3720, "text": "Okay, but maybe another tangent you can also pick up is can we get in trouble with much dumber systems?"}, {"time": 3728, "text": "Yes, and that is exactly where I was going."}, {"time": 3731, "text": "So just to wrap up on the threats of AGI, I think that it seems to me a little early today to figure out protections against a human level or superhuman level intelligence where we don't even see the skeleton of what that would look like."}, {"time": 3753, "text": "So it seems that it's very speculative on how to protect against that."}, {"time": 3759, "text": "But we can definitely and have gotten into trouble on much dumber systems."}, {"time": 3765, "text": "And a lot of that has to do with the fact that the systems that we're building are increasingly complex, increasingly poorly understood."}, {"time": 3777, "text": "And there's ripple effects that are unpredictable in changing little things that can have dramatic consequences on the outcome."}, {"time": 3788, "text": "And by the way, that's not unique to artificial intelligence."}, {"time": 3791, "text": "I think artificial intelligence exacerbates that, brings it to a new level."}, {"time": 3795, "text": "But heck, our electric grid is really complicated."}, {"time": 3798, "text": "The software that runs our financial markets is really complicated."}, {"time": 3802, "text": "And we've seen those ripple effects translate to dramatic negative consequences, like for instance, financial crashes that have to do with feedback loops that we didn't anticipate."}, {"time": 3815, "text": "So I think that's an issue that we need to be thoughtful about in many places, artificial intelligence being one of them."}]}]