[{"title": "Ian Hutchinson: Nuclear Fusion, Plasma Physics, and Religion | Lex Fridman Podcast #112", "id": "pDSEjaDCtOU", "quotes": [{"time": 372, "text": "That's what my research has mostly been aimed at."}, {"time": 376, "text": "But plasmas are essentially the fourth state of matter."}, {"time": 382, "text": "So if you think about solid, liquid, gas, plasma is the fourth of those states of matter."}, {"time": 389, "text": "And it's actually the state of matter which one reaches if one raises the temperature."}, {"time": 396, "text": "So cold things, you know, like ice are solid."}, {"time": 400, "text": "Liquids are hotter water."}, {"time": 403, "text": "And if you heat water beyond 100 degrees Celsius, it becomes gas."}, {"time": 408, "text": "Well, that's true of most substances."}, {"time": 411, "text": "And plasma is a state of matter in which the electrons are unbound from the nuclei."}, {"time": 421, "text": "So they become separate from the nuclei and can move separately."}, {"time": 426, "text": "So we have positively charged nuclei and we have negatively charged electrons."}, {"time": 432, "text": "The net is still electrically neutral."}, {"time": 437, "text": "But a plasma conducts electricity, has all sorts of important properties that are associated with that separation."}, {"time": 447, "text": "And that's what plasmas are all about."}, {"time": 449, "text": "And the reason why my department is interested in plasma physics very strongly is because most things, well, for one thing, most things in the universe are plasma."}, {"time": 457, "text": "The vast majority of matter in the universe is plasma."}, {"time": 460, "text": "But most particularly, stars and the sun are plasmas because they're very hot."}, {"time": 468, "text": "And it's only in very hot states that nuclear fusion reactions take place."}, {"time": 474, "text": "And we want to understand how to implement those kind of phenomena on Earth."}, {"time": 480, "text": "Maybe another distinction we want to try to get at is the difference between fission and fusion."}, {"time": 486, "text": "So you mentioned fusion is the kind of reaction happening in the sun."}, {"time": 489, "text": "So what's fission and what's fusion?"}, {"time": 491, "text": "Well, fission is taking heavy elements like uranium and breaking them up."}, {"time": 498, "text": "And it turns out that that process of breaking up heavy elements releases energy."}, {"time": 503, "text": "What does it mean to be a heavy element?"}, {"time": 505, "text": "It means that there are many nuclear particles in the nucleus itself, neutrons and protons in the nucleus itself so that in the case of uranium, there are 92 protons in each nucleus and even more neutrons so that the total number of nucleons in the nucleus, nucleons is short for either a proton or a neutron, the total number might be 235, that's U235, or it might be 238, that's U238."}, {"time": 541, "text": "So those are heavy elements."}, {"time": 543, "text": "Light elements, by contrast, have very few nucleons, protons or neutrons in the nucleus."}, {"time": 550, "text": "Hydrogen is the lightest nucleus."}, {"time": 552, "text": "It has one proton."}, {"time": 554, "text": "There are actually slightly heavier forms of hydrogen, isotopes."}, {"time": 559, "text": "Deuterium has a proton and a neutron and tritium has a proton and two neutrons."}, {"time": 566, "text": "So it has a total of three nucleons in the nucleus."}, {"time": 571, "text": "While taking light elements like isotopes of hydrogen and not breaking them up but actually fusing them together, reacting them together to produce heavier elements, typically helium, which is helium is a nucleus which has two protons and two neutrons, that also releases energy and that or reactions like that, making heavier elements from lighter elements is what mostly powers the sun and stars."}, {"time": 605, "text": "Both fusion and fission release approximately a million times more energy per unit mass than chemical reactions."}, {"time": 616, "text": "So a chemical reaction means take hydrogen, take oxygen, react them together, let's say, and get water, that releases energy."}, {"time": 625, "text": "The energy released in a chemical reaction like that or the burning of coal or on oil or whatever else is about a million times less per unit mass than what is released in nuclear reactions."}, {"time": 637, "text": "So but it's hard to do."}, {"time": 638, "text": "It requires very high energy of impact."}, {"time": 644, "text": "And actually, it's very easy to understand why."}, {"time": 646, "text": "And that is that those two nuclei, if they're both, let's say, hydrogen nuclei, one is, let's say, deuterium and the other is, let's say, tritium, they're both electrically charged."}, {"time": 658, "text": "And they're positively charged, so they like charges repel."}, {"time": 662, "text": "Everyone knows that, right?"}, {"time": 663, "text": "So basically, to get them close enough together to react, you have to overcome the repulsion, the electric repulsion of the two nuclei from one another."}, {"time": 675, "text": "And you have to get them extremely close to one another in order for the nuclear forces to overtake the electrical forces and actually form a new nucleus."}, {"time": 685, "text": "And so one requires very high energies of impact in order for reactions to take place."}, {"time": 691, "text": "And those high energies of impact correspond to very high temperatures of random motion."}, {"time": 697, "text": "So that's why you can do something like that in the sun."}, {"time": 701, "text": "So we can build the sun."}, {"time": 702, "text": "That's one way to do it."}, {"time": 703, "text": "But on Earth, how do you create a fusion reaction?"}, {"time": 708, "text": "Well, nature's."}, {"time": 709, "text": "Engineering wise."}, {"time": 710, "text": "Nature's fusion reactors are indeed the stars, and they are very hot in the center."}, {"time": 720, "text": "And they reach the point where they release more energy from those reactions than they lose by radiation and transport to the surface and so forth."}, {"time": 730, "text": "And that's a state of ignition."}, {"time": 735, "text": "And that's what we have to achieve to give net energy."}, {"time": 739, "text": "That's like lighting a fire."}, {"time": 741, "text": "If you have a bundle of sticks and you hold a match up to it and you see smoke coming from the sticks, but you take the match away and the sticks just fizzle out."}, {"time": 753, "text": "That's not the reason they fizzled out is that, yes, they were burning, there was smoke coming from them, but they were not ignited."}, {"time": 761, "text": "But if you are able to take the match away and they keep burning and they are generating enough heat to keep themselves hot and hence keep the reactions going, that's chemical ignition."}, {"time": 772, "text": "But what we need to do, what the stars do in order to generate nuclear fusion energy is they are ignited."}, {"time": 782, "text": "They are generated enough energy to keep themselves hot."}, {"time": 788, "text": "And that's what we've got to do on Earth if we're going to make fusion work on Earth."}, {"time": 793, "text": "But it's much harder to do on Earth than it is in a star because we need temperatures of order tens of millions of degrees Celsius in order for the reactions to go fast enough to generate enough energy to keep it going."}, {"time": 817, "text": "And so if you've got something that's tens of millions of degrees Celsius and you want to keep it all together and keep the heat in long enough to have enough reactions taking place, you can't just put it in a bottle, plastic or glass, it would be gone in milliseconds."}, {"time": 837, "text": "So you have to have some nonmaterial mechanism of confining the plasma."}, {"time": 845, "text": "In the case of stars, that nonmaterial force is gravity."}, {"time": 850, "text": "So gravity is what holds the star together, it's what holds the plasma in long enough for it to react and sustain itself by the fusion reactions."}, {"time": 862, "text": "But on Earth, gravity is extremely weak."}, {"time": 864, "text": "I mean, I don't mean to say we don't fall, yes, we fall."}, {"time": 867, "text": "But the mutual gravitational attraction of small objects is very weak compared with the electrical repulsion or any other force that you can think about on Earth."}, {"time": 880, "text": "And so we need a stronger force to keep the plasma together, to confine it."}, {"time": 888, "text": "And the predominant attempt at making fusion work on Earth is to use magnetic fields to confine the plasma."}, {"time": 897, "text": "And that's what I've worked on for much, essentially most of my career, is to understand how we can and how best we can confine these incredibly hot gases, plasmas, using magnetic fields with the ultimate objective of releasing fusion energy on Earth and generating electricity with it and powering our society with it."}, {"time": 921, "text": "A dumb question."}, {"time": 923, "text": "So on top of the magnetic fields, do you also need the plastic water bottle walls or is it purely magnetic fields?"}, {"time": 930, "text": "Well, actually what we do need walls, those walls must be kept away from the plasma because otherwise they'd be melted or the plasma must be kept away from them inside of them."}, {"time": 942, "text": "But the main purpose of the walls is not to keep the plasma in, it's to keep the atmosphere out."}, {"time": 950, "text": "So if we want to do it on Earth where there's air, we want the plasma to consist of hydrogen isotopes or other things, the things we're trying to react."}, {"time": 959, "text": "And by the way, the density of those plasmas, at least in magnetic confinement fusion, is very low."}, {"time": 967, "text": "It's maybe a million times less than the density of air in this room."}, {"time": 973, "text": "So in order for a fusion reactor like that to work, you have to keep all of the air out and just keep the plasma in."}, {"time": 980, "text": "So yes, there are other things, but those are things that are relatively easy."}, {"time": 984, "text": "I mean, making a vacuum these days is technologically quite straightforward."}, {"time": 989, "text": "We know how to do that."}, {"time": 991, "text": "What we don't quite know how to do is to make a confinement device that isolates the plasma well enough so that it's able to keep itself burning with its own reaction."}, {"time": 1003, "text": "So maybe can you talk about what a tokamak is?"}, {"time": 1007, "text": "The Russian acronym from which the word tokamak is built just means toroidal magnetic chamber."}, {"time": 1014, "text": "So it's a toroidal chamber, a torus is a geometric shape which is like a doughnut with a hole down the middle."}, {"time": 1022, "text": "And so it's the meat of the doughnut, that's the torus, and it's got a magnetic field."}, {"time": 1030, "text": "So that's really all tokamak means."}, {"time": 1033, "text": "But the particular configuration that is very widespread and is the sort of best prospect in the least in the near term for making fusion energy work is one in which there's a very strong magnetic field the long way around the doughnut, around the torus."}, {"time": 1055, "text": "So you've got to imagine that there's this doughnut shape with an embedded magnetic field just going round and round the long way."}, {"time": 1063, "text": "The big advantage of that is that plasma particles when they're in the presence of a magnetic field feel strong forces from the magnetic field and those forces make the particles gyrate around the direction of the magnetic field line."}, {"time": 1084, "text": "So basically the particles follow helical orbits following like a spring that's directed along the magnetic field."}, {"time": 1093, "text": "Well if you make the magnetic field go inside this toroidal chamber and just simply go round and round the chamber then because of this helical orbit the particles can't move fast across the magnetic field but they can move very quickly along the magnetic field."}, {"time": 1113, "text": "And if you have a magnetic field that doesn't leave the chamber it doesn't matter if they move along the magnetic field it doesn't mean they're going to exit the chamber."}, {"time": 1124, "text": "But if you just had a straight magnetic field for example coming from a Helmholtz coil or a bar magnet then you'd have to have ends that would come to the ends of the chamber somewhere and the particles would hit the ends and they would lose their energy."}, {"time": 1142, "text": "So that's why it's toroidal and that's why we have a strong magnetic field."}, {"time": 1147, "text": "It's providing a confinement against motion in the in the direction that would lead the particles to leave the chamber."}, {"time": 1156, "text": "It turns out that here we're getting a little bit technical but turns out that a toroidal field alone is not enough and so you need more fields to produce true true confinement of plasma and we get those by passing a current as well through the plasma itself."}, {"time": 1172, "text": "I can make sure it stays on track."}, {"time": 1174, "text": "Well that what that does is makes the field lines themselves into much bigger helices and that for reasons that are too complicated to explain that clinches the confinement of the particles at least in terms of their single particle orbits so they don't leave the chamber."}, {"time": 1193, "text": "So when the particles are flying along this this this donut the inside of the donut are they what's where's the generation of the energy coming from?"}, {"time": 1203, "text": "Are they smashing into each other?"}, {"time": 1207, "text": "Yeah eventually I mean in a fusion reactor there will be deuterons and tritons and they will be smashing in."}, {"time": 1213, "text": "They will be very hot there'll be a hundred million degrees Celsius or something so they're moving thermally with very large thermal energies in random directions and they will collide with one another and have fusion reactions."}, {"time": 1228, "text": "When those fusion reactions take place energy is released large amounts of energy is released in the form of particles."}, {"time": 1235, "text": "One of the particles that's released is an alpha particle which is also charged and it's also confined and that alpha particle stays in the in the in the donut and heats the other particles that are in that donut so it transfers its energy to those and they it keeps them hot."}, {"time": 1250, "text": "There are there's some leaking of heat all the time a little bit of radiation some transport and so forth."}, {"time": 1256, "text": "There's also a neutron released from that reaction the neutron carries out four fifths of the fusion energy and that will have to be captured in a blanket that surrounds the chamber in which we take the energy drive some kind of electrical generator from you know thermal thermal engine gas turbine or something like that and power the power."}, {"time": 1285, "text": "You got energy."}, {"time": 1286, "text": "So where do we stand?"}, {"time": 1289, "text": "I'm getting this thing to be something that actually works that generates energy."}, {"time": 1295, "text": "Well there have been experiments that have generated net nuclear energies or nuclear powers in the vicinity of you know a few tens of megawatts for a few seconds."}, {"time": 1309, "text": "So that's you know 10 megajoules that's not much energy it's a few donuts worth of energy okay."}, {"time": 1317, "text": "A literal donut."}, {"time": 1322, "text": "But we have studied how well tokamaks can find plasmas and so we now understand in rather great detail the way they work and we're able to predict what is going to be required in order to build a tokamak that becomes self sustaining that becomes essentially ignited or very so close to ignited that it doesn't matter."}, {"time": 1349, "text": "And at the moment at least if you use the modest magnetic field values still very strong but limited magnetic field values you have to build a very big device."}, {"time": 1364, "text": "And so we are at the moment worldwide fusion research is at the moment in the process of building a very big experiment that's located in the south of France."}, {"time": 1378, "text": "It's called ITER which means the way or just means the international tokamak experimental reactor if you like."}, {"time": 1388, "text": "And that experiment is designed to reach this burning plasma state and to generate about 500 megawatts of fusion power for hundreds of seconds at a time."}, {"time": 1401, "text": "It'll still only be an experiment."}, {"time": 1404, "text": "It won't put electricity on the grid or anything like that."}, {"time": 1408, "text": "It's to figure out whether it works and what the remaining engineering challenges are."}, {"time": 1414, "text": "It's a scientific experiment."}, {"time": 1416, "text": "It won't be engineered to run round the clock and so on and so forth which ultimately one needs to do in order to make something that's practical for generating electricity."}, {"time": 1426, "text": "But it will be the first demonstration on earth of a controlled fusion reaction for you know long time periods."}, {"time": 1435, "text": "Is that exciting to you?"}, {"time": 1439, "text": "It's been an objective that is in many ways motivated my entire career and the career of many people like me in the field."}, {"time": 1449, "text": "I have to admit though that one of the problems with ITER is that it's an extremely big and expensive and long time to build experiment and so it won't even come into operation until about 2025 even though it's been being built for 10 years and it was designed for 30 years before that."}, {"time": 1473, "text": "And so that's actually one of the big disappointments of my career in a certain sense which is that we won't get to burning fusion reaction until well past the first operation of ITER and whether I'm alive or not I don't know but I certainly will be well and truly retired by the time that happens."}, {"time": 1494, "text": "And so when I realized maybe some years ago that that was going to be the case it was a discouragement to me let's put it like that."}, {"time": 1503, "text": "But if we can try to look maybe in a ridiculous kind of way look into a hundred years from now two hundred years five hundred years from now and we you know there's folks like Elon Musk trying to travel outside the solar system."}, {"time": 1518, "text": "I mean the amount of energy we need for some of the exciting things we want to do in this world if we look again hundred years from now seems to be a very large amount."}, {"time": 1529, "text": "So do you think fusion energy will eventually sometime into your retirement will be basically behind most of the things we do?"}, {"time": 1541, "text": "Look I absolutely think that fusion research is completely justified."}, {"time": 1547, "text": "In fact we should be spending more time and effort on it than we currently do."}, {"time": 1551, "text": "But it isn't going to be a magic bullet that somehow solves all the problems of energy."}, {"time": 1559, "text": "By the way that's a generic statement you can make about any energy source in my view."}, {"time": 1564, "text": "I think it's a grave mistake to think that science of any sort is suddenly going to find a magic bullet for meeting all the energy needs of society or any of the other needs of society by the way."}, {"time": 1575, "text": "But and we can talk about that later."}, {"time": 1581, "text": "But fusion is very worthwhile and we should be doing it."}, {"time": 1585, "text": "And so my disappointment that I just expressed was in a certain sense of personal disappointment."}, {"time": 1592, "text": "I do think that fusion energy is a terrific challenge."}, {"time": 1596, "text": "It's very difficult to bring the energy source of the sun and stars down to earth."}, {"time": 1602, "text": "This does contrast in a certain sense with fission energy."}, {"time": 1607, "text": "By contrast fission energy efficient to build a fission reactor proved to be amazingly easy."}, {"time": 1614, "text": "You know we did it within a few years of discovering nuclear fission."}, {"time": 1620, "text": "People had figured out how to build a reactor and did so during the Second World War."}, {"time": 1627, "text": "Which is by the way fission is how the current nuclear power plants work."}, {"time": 1631, "text": "And so we have nuclear energy today because fission reactors are relatively easy to build."}, {"time": 1641, "text": "What's hard is getting the materials and that's just as well because if everyone could get those materials there would be weapons proliferation and so forth."}, {"time": 1650, "text": "But it wasn't all that long after even the discovery of nuclear fission that fission reactors were built and fission reactors of course operated before we had weapons."}, {"time": 1664, "text": "So I think nuclear power is obviously important to meet the energy challenges of our age."}, {"time": 1677, "text": "It is completely intrinsically completely CO2 emissions free."}, {"time": 1684, "text": "And in fact the wastes that come from nuclear power whether it's fission or fusion for that matter are so moderate in quantity that we shouldn't really be worried about them."}, {"time": 1698, "text": "I mean yes fission products are highly radioactive and we need to keep them away from people but there's so little of them it's that keeping them away from people is not particularly difficult."}, {"time": 1708, "text": "And so while people complain a lot about the drawbacks of fission energy I think most of those complaints are ill informed."}, {"time": 1719, "text": "We can talk about you know the challenges and the disasters if you like of fission reactors but I think fission in the near term offers a terrific opportunity for environmentally friendly energy which in the world as a whole is rapidly being taken advantage of."}, {"time": 1739, "text": "You know China and India and places like that are rapidly building fission plants."}, {"time": 1743, "text": "We're not rapidly building fission plants in the US although we are actually building two at the moment, two new ones."}, {"time": 1752, "text": "But we do still get 20 percent of our electricity from fission energy and we could get a lot more."}, {"time": 1758, "text": "So it's clean energy."}, {"time": 1760, "text": "Now again the concern is there's a very popular HBO show and just came out on Chernobyl."}, {"time": 1768, "text": "There's the Three Mile Island, there's Fukushima, that's the most recent disaster."}, {"time": 1772, "text": "So there's a kind of a concern of yeah I mean nuclear disasters."}, {"time": 1777, "text": "Is that, what do you make of that kind of concern especially if we look into the future of fission energy based reactors?"}, {"time": 1784, "text": "Well first of all let me say one or two words about the contrast between fission and fusion and then we'll come on to the question of the disasters and so forth."}, {"time": 1793, "text": "Fission does have some drawbacks and they're largely to do with four main areas."}, {"time": 1800, "text": "One is do we have enough uranium or other fissile fuels to supply our energy needs for a long time?"}, {"time": 1808, "text": "The answer to that is we know we have enough uranium to support fission energy worldwide for thousands of years but maybe not for millions of years okay."}, {"time": 1823, "text": "So that's resources."}, {"time": 1825, "text": "Secondly there are issues to do with wastes."}, {"time": 1829, "text": "Fission wastes are highly radioactive and some of them are volatile and so for example in Fukushima the problem was that some fraction of the fission wastes were volatilized and went out as a cloud and polluted areas with cesium 137, strontium 90 and things like that."}, {"time": 1855, "text": "So that's a challenge of fission."}, {"time": 1858, "text": "There's a problem of safety beyond that and that is that in fission it's hard to turn the reactor off."}, {"time": 1869, "text": "When you stop the nuclear reactions there is still a lot of heat being liberated from the fission products and that is actually what the problem was at Fukushima."}, {"time": 1880, "text": "The Fukushima reactors were shut down the moment that the earthquake took place and they were shut down safely."}, {"time": 1889, "text": "What then happened after that at Fukushima was you know there was this enormous tidal wave many tens of meters high that came through and destroyed the electricity grid feed to the Fukushima reactors and their cooling was then turned off and it was the after heat of the turned off reactors that eventually caused the problems that led to release."}, {"time": 1917, "text": "And so that's a safety concern and then finally there's a problem of proliferation and that is that fission reactors need fissile fuel and the technologies for producing and enriching and so forth the fuels can be used by bad actors to generate the materials needed for a nuclear weapon and that's a very serious concern."}, {"time": 1947, "text": "So those are the four problems."}, {"time": 1949, "text": "Fusion has major advantages in respect of all of those problems."}, {"time": 1954, "text": "It has more longer term fuel resources, it has far more benign waste issues, the radioactivity from fusion reactions is at least a hundred times less than it is from fission reactions."}, {"time": 1971, "text": "It has essentially none of this after heat problem because it doesn't produce fission products that are highly radioactive and generating their own heat when it's turned off."}, {"time": 1982, "text": "In fact the hard part of fusion is turning it on not turning it off."}, {"time": 1987, "text": "And finally you don't need the same fission technology to make fusion work and so it's got terrific advantages from the point of view of proliferation control."}, {"time": 1999, "text": "So those are the four main issues which make fusion seem attractive technologically because they address some of the problems of fission energy."}, {"time": 2011, "text": "I don't mean to say that fission energy is overwhelmingly problematic but clearly there have been catastrophes associated with fission reactors."}, {"time": 2021, "text": "Fukushima actually is I think in many ways are often overstated as a disaster because after all nobody was killed by the reactors essentially, zero."}, {"time": 2033, "text": "And that's in the context of a disaster and tsunami that killed between 15 and 20,000 people instantane more or less instantaneously."}, {"time": 2045, "text": "So you know in the scale of risks one should take the view that in my estimation that fission energy came out of that looking pretty good."}]}]