[{"title": "Donald Knuth: Algorithms, Complexity, and The Art of Computer Programming | Lex Fridman Podcast #62", "id": "2BdBfsXbST8", "quotes": [{"time": 388, "text": "So subroutine wanted to go up there."}, {"time": 391, "text": "Could you have predicted the future 60 years later of computing from then?"}, {"time": 397, "text": "You know, in fact, the hardest question I was ever asked was what could I have predicted?"}, {"time": 404, "text": "In other words, the interviewer asked me, she said, you know, what about computing has surprised you?"}, {"time": 411, "text": "And immediately I ran, I rattled off a couple dozen things and then she said, okay, so what didn't surprise?"}, {"time": 417, "text": "And I tried for five minutes to think of something that I would have predicted and I couldn't."}, {"time": 424, "text": "But let me say that this machine, I didn't know, well, there wasn't much else in the world at that time."}, {"time": 433, "text": "The 650 was the first machine that there were more than a thousand of ever."}, {"time": 439, "text": "Before that there were, you know, each machine there might be a half a dozen examples, maybe a couple dozen."}, {"time": 445, "text": "The first mass market, mass produced."}, {"time": 448, "text": "The first one, yeah, done in quantity."}, {"time": 450, "text": "And IBM didn't sell them, they rented them, but they rented them to universities that had a great deal."}, {"time": 464, "text": "And so that's why a lot of students learned about computers at that time."}, {"time": 471, "text": "So you refer to people, including yourself, who gravitate toward a kind of computational thinking as geeks, at least I've heard you use that terminology."}, {"time": 483, "text": "It's true that I think there's something that happened to me as I was growing up that made my brain structure in a certain way that resonates with computers."}, {"time": 494, "text": "So there's this space of people, 2% of the population, you empirically estimate."}, {"time": 499, "text": "That's been fairly constant over most of my career."}, {"time": 504, "text": "However, it might be different now because kids have different experiences when they're young."}, {"time": 511, "text": "So what does the world look like to a geek?"}, {"time": 515, "text": "What is this aspect of thinking that is unique to, that makes a geek?"}, {"time": 525, "text": "This is a hugely important question."}, {"time": 528, "text": "In the 50s, IBM noticed that there were geeks and nongeeks, and so they tried to hire geeks."}, {"time": 536, "text": "And they put out ads with papers saying, if you play chess, come to Madison Avenue for an interview or something like this."}, {"time": 543, "text": "They were trying for some things."}, {"time": 544, "text": "So what is it that I find easy and other people tend to find harder?"}, {"time": 551, "text": "And I think there's two main things."}, {"time": 554, "text": "One is this, is the ability to jump levels of abstraction."}, {"time": 566, "text": "So you see something in the large and you see something in the small and you pass between those unconsciously."}, {"time": 575, "text": "So you know that in order to solve some big problem, what you need to do is add one to a certain register and that gets you to another step."}, {"time": 587, "text": "And below the, I don't go down to the electron level, but I knew what those milliseconds were, what the drum was like on the 650."}, {"time": 596, "text": "I knew how I was gonna factor a number or find a root of an equation or something because of what was doing."}, {"time": 604, "text": "And as I'm debugging, I'm going through, did I make a key punch error?"}, {"time": 609, "text": "Did I write the wrong instruction?"}, {"time": 613, "text": "Do I have the wrong thing in a register?"}, {"time": 615, "text": "And each level is different."}, {"time": 620, "text": "And this idea of being able to see something at lots of levels and fluently go between them seems to me to be much more pronounced in the people that resonate with computers like I do."}, {"time": 637, "text": "So in my books, I also don't stick just to the high level, but I mix low level stuff with high level and this means that some people think that I should write better books and it's probably true."}, {"time": 658, "text": "But other people say, well, but that's, if you think like that, then that's the way to train yourself, keep mixing the levels and learn more and more how to jump between."}, {"time": 670, "text": "So that's the one thing."}, {"time": 671, "text": "The other thing is that it's more of a talent to be able to deal with non uniformity where there's case one, case two, case three, instead of having one or two rules that govern everything."}, {"time": 690, "text": "So it doesn't bother me if I need, like an algorithm has 10 steps to it, each step does something else that doesn't bother me, but a lot of pure mathematics is based on one or two rules which are universal and so this means that people like me sometimes work with systems that are more complicated than necessary because it doesn't bother us that we didn't figure out the simple rule."}, {"time": 720, "text": "And you mentioned that while Jacobi, Boole, Abel, all the mathematicians in the 19th century may have had symptoms of geek, the first 100% legit geek was Turing, Alan Turing."}, {"time": 736, "text": "I think he had, yeah, a lot more of this quality than anybody, just from reading the kind of stuff he did."}, {"time": 746, "text": "So how does Turing, what influence has Turing had on you in your way of thinking?"}, {"time": 755, "text": "I didn't know that aspect of him until after I graduated some years."}, {"time": 760, "text": "As undergraduate we had a class that talked about computability theory and Turing machines and it was all, it sounded like a very specific kind of purely theoretical approach to stuff."}, {"time": 776, "text": "So when, how old were they when I learned that he had a design machine and that he wrote a wonderful manual for Manchester machines and he invented all kinds of subroutines and he was a real hacker that he had his hands dirty."}, {"time": 804, "text": "I thought for many years that he had only done purely formal work, as I started reading his own publications, I could feel this kinship and of course he had a lot of peculiarities, like he wrote numbers backwards because I mean, left to right instead of right to left because that's, it was easier for computers to process them that way."}, {"time": 832, "text": "What do you mean left to right?"}, {"time": 834, "text": "He would write pi as 9, 5, 1, 4.3, I mean, okay."}, {"time": 845, "text": "Right, got it."}, {"time": 847, "text": "4, 1.3, on the blackboard."}, {"time": 850, "text": "I mean, he had trained himself to do that because the computers he was working with worked that way inside."}, {"time": 861, "text": "Trained himself to think like a computer."}, {"time": 862, "text": "There you go, that's geek thinking."}, {"time": 866, "text": "You've practiced some of the most elegant formalism in computer science and yet you're the creator of a concept like literate programming which seems to move closer to natural language type of description of programming."}, {"time": 884, "text": "How do you see those two as conflicting as the formalism of theory and the idea of literate programming?"}, {"time": 891, "text": "So there we are in a nonuniform system where I don't think one size fits all and I don't think all truth lies in one kind of expertise."}, {"time": 903, "text": "And so somehow, in a way you'd say my life is a convex combination of English and mathematics."}, {"time": 913, "text": "And you're okay with that."}, {"time": 914, "text": "And not only that, I think."}, {"time": 916, "text": "Thrive in it."}, {"time": 917, "text": "I wish, you know, I want my kids to be that way, I want, et cetera, you know, use left brain, right brain at the same time."}, {"time": 923, "text": "You got a lot more done."}, {"time": 925, "text": "That was part of the bargain."}, {"time": 928, "text": "And I've heard that you didn't really read for pleasure until into your 30s, you know, literature."}, {"time": 937, "text": "You know more about me than I do but I'll try to be consistent with what you read."}, {"time": 941, "text": "Yeah, no, just believe me."}, {"time": 942, "text": "I just go with whatever story I tell you."}, {"time": 945, "text": "It'll be easier that way."}, {"time": 946, "text": "The conversation works."}, {"time": 947, "text": "Right, yeah, no, that's true."}, {"time": 949, "text": "So I've heard mention of Philip Roth's American Pastoral, which I love as a book."}, {"time": 956, "text": "I don't know if, it was mentioned as something, I think, that was meaningful to you as well."}, {"time": 963, "text": "In either case, what literary books had a lasting impact on you?"}, {"time": 967, "text": "What literature, what poetry?"}, {"time": 968, "text": "Yeah, okay, good question."}, {"time": 969, "text": "So I met Roth."}, {"time": 973, "text": "Well, we both got doctors from Harvard on the same day, so we had lunch together and stuff like that."}, {"time": 981, "text": "But he knew that, you know, computer books would never sell."}, {"time": 1028, "text": "On the other hand, Dostoevsky, I didn't like at all because I felt that his genius was mostly because he kept forgetting what he had started out to do, and he was just sloppy."}, {"time": 1041, "text": "I didn't think that he polished his stuff at all, and I tend to admire somebody who dots the I's and crosses the T's."}, {"time": 1052, "text": "So the music of the pros is what you admire more than..."}, {"time": 1056, "text": "I certainly do admire the music of the language, which I couldn't appreciate in the Russian original, but I can in Victor Hugo, because French is closer."}, {"time": 1067, "text": "But Tolstoy, I like the same reason."}, {"time": 1071, "text": "I like Herman Wouk as a novelist."}, {"time": 1074, "text": "I think like his book, Marjorie Morningstar, has a similar character in Hugo who developed his own personal philosophy, and it goes in the... What's consistent?"}, {"time": 1090, "text": "Yeah, right, and it's worth pondering."}, {"time": 1095, "text": "So you don't like Nietzsche, and... Like what?"}, {"time": 1098, "text": "You don't like Friedrich Nietzsche, or... Nietzsche, yeah, no, no, yeah, this has..."}, {"time": 1103, "text": "I keep seeing quotations from Nietzsche, and he never tempt me to read any further."}, {"time": 1110, "text": "Well, he's full of contradictions, and you will certainly not appreciate him."}, {"time": 1114, "text": "But Schiller, I'm trying to get across what I appreciate in literature, and part of it is, as you say, the music of the language, the way it flows, and take Raymond Chandler versus Dashiell Hammett."}, {"time": 1132, "text": "Dashiell Hammett's sentences are awful, and Raymond Chandler's are beautiful, they just flow."}, {"time": 1139, "text": "So I don't read literature because it's supposed to be good for me, or because somebody said it's great, but I find things that I like."}, {"time": 1154, "text": "I mean, you mentioned you were dressed like James Bond, so I love Ian Fleming."}, {"time": 1160, "text": "I think he had a really great gift for..."}, {"time": 1163, "text": "If he has a golf game, or a game of bridge, or something and this comes into his story, it'll be the most exciting golf game, or the absolute best possible hands of bridge that exists, and he exploits it and tells it beautifully."}, {"time": 1185, "text": "So in connecting some things here, looking at literate programming and being able to convey in code algorithms to a computer in a way that mimics how humans speak, what do you think about natural language in general and the messiness of our human world, about trying to express difficult things?"}, {"time": 1215, "text": "So the idea of literate programming is really to try to understand something better by seeing it from at least two perspectives, the formal and the informal."}, {"time": 1227, "text": "If we're trying to understand a complicated thing, if we can look at it in different ways."}, {"time": 1232, "text": "And so this is in fact the key to technical writing, a good technical writer trying not to be obvious about it, but says everything twice, formally and informally, or maybe three times, but you try to give the reader a way to put the concept into his own brain or her own brain."}, {"time": 1257, "text": "Is that better for the writer or the reader or both?"}, {"time": 1261, "text": "Well, the writer just tries to understand the reader."}, {"time": 1266, "text": "That's the goal of a writer, is to have a good mental image of the reader and to say what the reader expects next and to impress the reader with what has impressed the writer why something is interesting."}, {"time": 1284, "text": "So when you have a computer program, we try to, instead of looking at it as something that we're just trying to give instruction to the computer, what we really wanna be is giving insight to the person who's gonna be maintaining this program or to the programmer himself when he's debugging it as to why this stuff is being done."}, {"time": 1307, "text": "And so all the techniques of exposition that a teacher uses or a book writer uses make you a better programmer if your program is gonna be not just a one shot deal."}, {"time": 1320, "text": "So how difficult is that?"}, {"time": 1324, "text": "Do you see hope for the combination of informal and formal for the programming task?"}, {"time": 1332, "text": "Yeah, I'm the wrong person to ask, I guess, because I'm a geek, but I think for a geek it's easy."}, {"time": 1341, "text": "Some people have difficulty writing and that might be because there's something in their brain structure that makes it hard for them to write or it might be something just that they haven't had enough practice."}, {"time": 1356, "text": "I'm not the right one to judge, but I don't think you can teach any person any particular skill."}, {"time": 1364, "text": "I do think that writing is half of my life and so I put it together in a literate program."}, {"time": 1373, "text": "Even when I'm writing a one shot program, I write it in a literate way because I get it right faster that way."}, {"time": 1384, "text": "Now does it get compiled automatically?"}, {"time": 1387, "text": "Or?"}, {"time": 1388, "text": "So I guess on the technical side, my question was how difficult is it to design a system where much of the programming is done informally?"}, {"time": 1399, "text": "Informally?"}, {"time": 1400, "text": "Yeah, informally."}, {"time": 1402, "text": "I think whatever works to make it understandable is good, but then you have to also understand how informal is."}, {"time": 1413, "text": "You have to know the limitations."}, {"time": 1415, "text": "So by putting the formal and informal together, this is where it gets locked into your brain."}, {"time": 1425, "text": "You can say informally, well, I'm working on a problem right now, so."}, {"time": 1432, "text": "Let's go there."}, {"time": 1434, "text": "Can you give me an example of connecting the informal and the formal?"}, {"time": 1440, "text": "Well, it's a little too complicated an example."}, {"time": 1443, "text": "There's a puzzle that's self referential."}, {"time": 1446, "text": "It's called a Japanese arrow puzzle."}, {"time": 1449, "text": "And you're given a bunch of boxes."}, {"time": 1453, "text": "Each one points north, east, south, or west."}, {"time": 1456, "text": "And at the end, you're supposed to fill in each box with the number of distinct numbers that it points to."}, {"time": 1465, "text": "So if I put a three in a box, that means that, and it's pointing to five other boxes, that means that there's gonna be three different numbers in those five boxes."}, {"time": 1474, "text": "And those boxes are pointing, one of them might be pointing to me, one of them might be pointing the other way."}, {"time": 1480, "text": "But anyway, I'm supposed to find a set of numbers that obeys this complicated condition that each number counts how many distinct numbers it points to."}, {"time": 1494, "text": "And so a guy sent me his solution to this problem where he presents formal statements that say either this is true or this is true or this is true."}, {"time": 1508, "text": "And so I try to render that formal statement informally and I try to say, I contain a three and the guys I'm pointing to contain the numbers one, two, and six."}, {"time": 1525, "text": "So by putting it informally and also I convert it into a dialogue statement, that helps me understand the logical statement that he's written down as a string of numbers in terms of some abstract variables that he had."}, {"time": 1542, "text": "So maybe an extension of that, there has been a resurgence in computer science and machine learning and neural networks."}, {"time": 1552, "text": "So using data to construct algorithms."}, {"time": 1556, "text": "So it's another way to construct algorithms, really."}, {"time": 1560, "text": "If you can think of it that way."}, {"time": 1563, "text": "So as opposed to natural language to construct algorithms, use data to construct algorithms."}, {"time": 1568, "text": "So what's your view of this branch of computer science where data is almost more important than the mechanism of the algorithm?"}, {"time": 1578, "text": "It seems to be suited to a certain kind of non geek, which is probably why it's taken off."}, {"time": 1589, "text": "It has its own community that really resonates with that."}, {"time": 1594, "text": "But it's hard to trust something like that because nobody, even the people who work with it, they have no idea what has been learned."}, {"time": 1607, "text": "That's a really interesting thought that it makes algorithms more accessible to a different community, a different type of brain."}, {"time": 1619, "text": "And that's really interesting because just like literate programming perhaps could make programming more accessible to a certain kind of brain."}, {"time": 1630, "text": "There are people who think it's just a matter of education and anybody can learn to be a great programmer."}, {"time": 1636, "text": "Anybody can learn to be a great skier."}, {"time": 1643, "text": "I wish that were true, but I know that there's a lot of things that I've tried to do and I was well motivated and I kept trying to build myself up and I never got past a certain level."}, {"time": 1656, "text": "I can't view, for example, I can't view three dimensional objects in my head."}, {"time": 1663, "text": "I have to make a model and look at it and study it from all points of view and then I start to get some idea."}, {"time": 1670, "text": "But other people are good at four dimensions."}, {"time": 1677, "text": "So let's go to the art of computer programming."}, {"time": 1685, "text": "In 1962, you set the table of contents for this magnum opus, right?"}, {"time": 1693, "text": "It was supposed to be a single book with 12 chapters."}, {"time": 1696, "text": "Now today, what is it, 57 years later, you're in the middle of volume four of seven?"}, {"time": 1706, "text": "In the middle of volume four B is."}, {"time": 1708, "text": "Four B."}, {"time": 1709, "text": "More precisely."}, {"time": 1710, "text": "Can I ask you for an impossible task, which is try to summarize the book so far maybe by giving a little examples."}, {"time": 1721, "text": "So from the sorting and the search and the combinatorial algorithms, if you were to give a summary, a quick elevator summary."}, {"time": 1730, "text": "Elevator, that's great."}, {"time": 1732, "text": "But depending how many floors there are in the building."}, {"time": 1736, "text": "The first volume called Fundamental Algorithms talks about something that you can't, the stuff you can't do without."}, {"time": 1744, "text": "You have to know the basic concepts of what is a program, what is an algorithm."}, {"time": 1751, "text": "And it also talks about a low level machine so you can have some kind of an idea what's going on."}, {"time": 1760, "text": "And it has basic concepts of input and output and subroutines."}, {"time": 1766, "text": "Induction."}, {"time": 1767, "text": "Induction, right."}, {"time": 1769, "text": "Mathematical, preliminary."}, {"time": 1771, "text": "So the thing that makes my book different from a lot of others is that I try to, not only present the algorithm, but I try to analyze them, which means quantitatively I say, not only does it work, but it works this fast."}, {"time": 1787, "text": "Okay, and so I need math for that."}, {"time": 1789, "text": "And then there's the standard way to structure data inside and represent information in the computer."}, {"time": 1796, "text": "So that's all volume one."}, {"time": 1798, "text": "Volume two talks, it's called Seminumerical Algorithms."}, {"time": 1801, "text": "And here we're writing programs, but we're also dealing with numbers."}, {"time": 1807, "text": "Algorithms deal with any kinds of objects, but specific when there's objects or numbers, well then we have certain special paradigms that apply to things that involve numbers."}, {"time": 1820, "text": "And so there's arithmetic on numbers and there's matrices full of numbers, there's random numbers, and there's power series full of numbers."}, {"time": 1831, "text": "There's different algebraic concepts that have numbers in structured ways."}, {"time": 1837, "text": "And arithmetic in the way a computer would think about arithmetic, so floating point."}, {"time": 1841, "text": "Floating point arithmetic, high precision arithmetic, not only addition, subtraction, multiplication, but also comparison of numbers."}, {"time": 1850, "text": "So then volume three talks about."}, {"time": 1853, "text": "I like that one, sorting and search."}, {"time": 1855, "text": "Sorting and search."}, {"time": 1855, "text": "I love sorting."}, {"time": 1857, "text": "Right, so here we're not dealing necessarily with numbers because you sort letters and other objects and searching we're doing all the time with Google nowadays, but I mean, we have to find stuff."}, {"time": 1869, "text": "So again, algorithms that underlie all kinds of applications."}, {"time": 1876, "text": "None of these volumes is about a particular application, but the applications are examples of why people want to know about sorting, why people want to know about random numbers."}, {"time": 1886, "text": "So then volume four goes into combinatorial algorithm."}, {"time": 1891, "text": "This is where we have zillions of things to deal with and here we keep finding cases where one good idea can make something go more than a million times faster."}, {"time": 1905, "text": "And we're dealing with problems that are probably never gonna be solved efficiently, but that doesn't mean we give up on them and we have this chance to have good ideas and go much, much faster on them."}, {"time": 1922, "text": "So that's combinatorial algorithms and those are the ones that are, I mean, you said sorting is most fun for you."}, {"time": 1929, "text": "It's true, it's fun, but combinatorial algorithms are the ones that I always enjoyed the most because that's when my skillet programming had most payoff."}, {"time": 1942, "text": "The difference between an obvious algorithm that you think up first thing and an interesting, subtle algorithm that's not so obvious, but run circles around the other one, that's where computer science really comes in."}, {"time": 1963, "text": "And a lot of these combinatorial methods were found first in applications to artificial intelligence or cryptography."}, {"time": 1972, "text": "And in my case, I just liked them and it was associated more with puzzles."}, {"time": 1981, "text": "Do you like them most in the domain of graphs and graph theory?"}, {"time": 1984, "text": "Graphs are great because they're terrific models of so many things in the real world and you throw numbers on a graph, you got a network and so there you have many more things."}, {"time": 1998, "text": "But combinatorial in general is any arrangement of objects that has some kind of higher structure, nonrandom structure and is it possible to put something together satisfying all these conditions?"}, {"time": 2019, "text": "Like I mentioned arrows a minute ago, is there a way to put these numbers on a bunch of boxes that are pointing to each other?"}, {"time": 2027, "text": "Is that gonna be possible at all?"}, {"time": 2028, "text": "That's volume four."}, {"time": 2032, "text": "What does the future hold?"}, {"time": 2032, "text": "Volume four A was part one."}, {"time": 2034, "text": "And what happened was in 1962, when I started writing down a table of contents, it wasn't gonna be a book about computer programming in general, it was gonna be a book about how to write compilers."}, {"time": 2050, "text": "And I was asked to write a book explaining how to write a compiler."}, {"time": 2056, "text": "And at that time, there were only a few dozen people in the world who had written compilers and I happened to be one of them."}, {"time": 2065, "text": "And I also had some experience writing for like the campus newspaper and things like that."}, {"time": 2075, "text": "So I said, okay, great."}, {"time": 2078, "text": "I'm the only person I know who's written a compiler but hasn't invented any new techniques for writing compilers."}, {"time": 2085, "text": "And all the other people I knew had super ideas but I couldn't see that they would be able to write a book that would describe anybody else's ideas with their own."}, {"time": 2095, "text": "So I could be the journalist and I could explain what all these cool ideas about compiler writing were."}, {"time": 2104, "text": "And then I started putting down, well, yeah, you need to have a chapter about data structures."}, {"time": 2111, "text": "You need to have some introductory material."}, {"time": 2113, "text": "I wanna talk about searching because a compiler writer has to look up the variables in a symbol table and find out which, when you write the name of a variable in one place, it's supposed to be the same as the one you put somewhere else."}, {"time": 2132, "text": "So you need all these basic techniques and I kinda know some arithmetic and stuff."}, {"time": 2140, "text": "So I threw in these chapters and I threw in a chapter on combinatorics because that was what I really enjoyed programming the most but there weren't many algorithms known about combinatorial methods in 1962."}, {"time": 2153, "text": "So that was a kind of a short chapter but it was sort of thrown in just for fun."}, {"time": 2158, "text": "And chapter 12 was gonna be actual compilers, applying all the stuff in chapters one to 11 to make compilers."}, {"time": 2166, "text": "Well, okay, so that was my table of contents from 1962."}, {"time": 2170, "text": "And during the 70s, the whole field of combinatorics went through a huge explosion."}, {"time": 2177, "text": "People talk about a combinatorial explosion and they usually mean by that that the number of cases goes up, you know, you change end to end plus one and all of a sudden your problem has gotten more than 10 times harder."}, {"time": 2191, "text": "But there was an explosion of ideas about combinatorics in the 70s to the point that like take 1975, I bet you more than half of all the journals of computer science were about combinatorial methods."}, {"time": 2209, "text": "What kind of problems were occupying people's minds?"}, {"time": 2212, "text": "What kind of problems in combinatorics?"}, {"time": 2214, "text": "Was it satisfiability, graph theory?"}, {"time": 2217, "text": "Yeah, graph theory was quite dominant."}, {"time": 2219, "text": "I mean, but all of the NP hard problems that you have like Hamiltonian path."}, {"time": 2228, "text": "Travel salesman."}, {"time": 2229, "text": "Going beyond graphs, you had operation research whenever there was a small class of problems that had efficient solutions and they were usually associated with matron theory, special mathematical construction."}, {"time": 2244, "text": "But once we went to things that involve three things at a time instead of two, all of a sudden things got harder."}, {"time": 2252, "text": "So we had satisfiability problems where if you have clauses, every clause has two logical elements in it, then we can satisfy it in linear time."}, {"time": 2263, "text": "We can test for satisfiability in linear time, but if you allow yourself three variables in the clause, then nobody knows how to do it."}, {"time": 2272, "text": "So these articles were about trying to find better ways to solve cryptography problems and graph theory problems."}, {"time": 2281, "text": "We have lots of data, but we didn't know how to find the best subsets of the data."}, {"time": 2287, "text": "Like with sorting, we could get the answer."}, {"time": 2292, "text": "Didn't take long."}, {"time": 2292, "text": "So how did it continue to change from the 70s to today?"}, {"time": 2296, "text": "Yeah, so now there may be half a dozen conferences whose topic is combinatorics, a different kind, but fortunately I don't have to rewrite my book every month like I had to in the 70s."}, {"time": 2311, "text": "But still there's huge amount of work being done and people getting better ideas on these problems that don't seem to have really efficient solutions, but we still do a lot more with them."}, {"time": 2324, "text": "And so this book that I'm finishing now is, I've got a whole bunch of brand new methods that as far as I know, there's no other book that covers this particular approach."}, {"time": 2340, "text": "And so I'm trying to do my best of exploring the tip of the iceberg and I try out lots of things and keep rewriting as I find better method."}, {"time": 2356, "text": "So what's your writing process like?"}, {"time": 2358, "text": "What's your thinking and writing process like every day?"}, {"time": 2364, "text": "What's your routine even?"}, {"time": 2366, "text": "Yeah, I guess it's actually the best question because I spend seven days a week doing it."}, {"time": 2374, "text": "You're the most prepared to answer it."}, {"time": 2378, "text": "So the chair I'm sitting in is where I do..."}, {"time": 2385, "text": "It's where the magic happens."}, {"time": 2386, "text": "Well, reading and writing, the chair is usually sitting over there where I have other books, some reference books, but I found this chair which was designed by a Swedish guy anyway."}, {"time": 2400, "text": "It turns out this is the only chair I can really sit in for hours and hours and not know that I'm in a chair."}, {"time": 2405, "text": "But then I have the standup desk right next to us and so after I write something with pencil and eraser, I get up and I type it and revise and rewrite."}, {"time": 2420, "text": "I'm standing up."}, {"time": 2421, "text": "The kernel of the idea is first put on paper."}, {"time": 2426, "text": "And I'll write maybe five programs a week, of course, literate programming."}, {"time": 2433, "text": "And these are, before I describe something in my book, I always program it to see how it's working and I try it a lot."}, {"time": 2441, "text": "So for example, I learned at the end of January, I learned of a breakthrough by four Japanese people who had extended one of my methods in a new direction."}, {"time": 2454, "text": "And so I spent the next five days writing a program to implement what they did."}, {"time": 2459, "text": "And then they had only generalized part of what I had done so then I had to see if I could generalize more parts of it."}, {"time": 2467, "text": "And then I had to take their approach and I had to try it out on a couple of dozen of the other problems I had already worked out with my old methods."}, {"time": 2478, "text": "And so that took another couple of weeks."}, {"time": 2480, "text": "And then I started to see the light and I started writing the final draft and then I would type it up, involve some new mathematical questions."}, {"time": 2494, "text": "And so I wrote to my friends who might be good at solving those problems and they solved some of them."}, {"time": 2502, "text": "So I put that in as exercises."}, {"time": 2505, "text": "And so a month later, I had absorbed one new idea that I learned and I'm glad I heard about it in time."}, {"time": 2514, "text": "Otherwise, I wouldn't put my book out before I'd heard about the idea."}, {"time": 2519, "text": "On the other hand, this book was supposed to come in at 300 pages and I'm up to 350 now."}, {"time": 2524, "text": "That added 10 pages to the book."}, {"time": 2526, "text": "But if I learn about another one, my publisher is gonna shoot me."}, {"time": 2531, "text": "Well, so in that process, in that one month process, are some days harder than others?"}, {"time": 2539, "text": "Are some days harder than others?"}, {"time": 2540, "text": "Well, yeah, my work is fun, but I also work hard and every big job has parts that are a lot more fun than others."}, {"time": 2549, "text": "And so many days I'll say, why do I have to have such high standards?"}, {"time": 2555, "text": "Why couldn't I just be sloppy and not try this out and just report the answer?"}, {"time": 2560, "text": "But I know that people are calling me to do this and so, okay, so, okay, Don, I'll grit my teeth and do it."}, {"time": 2570, "text": "And then the joy comes out when I see that actually, I'm getting good results and I get even more when I see that somebody has actually read and understood what I wrote and told me how to make it even better."}, {"time": 2585, "text": "I did wanna mention something about the method."}, {"time": 2590, "text": "So I got this tablet here, where I do the first, the first writing of concepts, okay, so."}, {"time": 2605, "text": "And what language is that in?"}, {"time": 2607, "text": "Right, so take a look at it, but you know, here, random say, explain how to draw such skewed pixel diagrams, okay, so."}, {"time": 2616, "text": "I got this paper about 40 years ago when I was visiting my sister in Canada and they make tablets of paper with this nice large size and just the right."}, {"time": 2628, "text": "A very small space between lines."}, {"time": 2629, "text": "Small spaces, yeah, yeah, take a look."}, {"time": 2631, "text": "Maybe also just show it."}, {"time": 2639, "text": "You know, I've got these manuscripts going back to the 60s."}, {"time": 2644, "text": "And those are where I'm getting my ideas on paper, okay."}, {"time": 2649, "text": "But I'm a good typist."}, {"time": 2650, "text": "In fact, I went to typing school when I was in high school and so I can type faster than I think."}, {"time": 2657, "text": "So then when I do the editing, stand up and type, then I revise this and it comes out a lot different than what, you know, for style and rhythm and things like that come out at the typing stage."}, {"time": 2671, "text": "And you type in tech."}, {"time": 2672, "text": "And I type in tech."}, {"time": 2674, "text": "And can you think in tech?"}, {"time": 2679, "text": "To a certain extent, I have only a small number of idioms that I use."}, {"time": 2684, "text": "Like, you know, I'm beginning with theorem, I do something for displayed equation, I do something and so on."}, {"time": 2689, "text": "But I have to see it and."}, {"time": 2693, "text": "In the way that it's on paper here."}, {"time": 2696, "text": "So for example, Turing wrote, what, The Other Direction."}, {"time": 2699, "text": "You don't write macros, you don't think in macros."}, {"time": 2704, "text": "Not particularly, but when I need a macro, I'll go ahead and do it."}, {"time": 2709, "text": "But the thing is, I also write to fit."}, {"time": 2712, "text": "I mean, I'll change something if I can save a line."}, {"time": 2718, "text": "You know, it's like haiku."}, {"time": 2719, "text": "I'll figure out a way to rewrite the sentence so that it'll look better on the page."}, {"time": 2725, "text": "And I shouldn't be wasting my time on that, but I can't resist because I know it's only another 3% of the time or something like that."}, {"time": 2733, "text": "And it could also be argued that that is what life is about."}, {"time": 2739, "text": "Ah, yes, in fact, that's true."}, {"time": 2743, "text": "Like, I work in the garden one day a week and that's kind of a description of my life is getting rid of weeds, you know, removing bugs for programs."}, {"time": 2752, "text": "So, you know, a lot of writers talk about, you know, basically suffering, the writing processes, having, you know, it's extremely difficult."}, {"time": 2762, "text": "And I think of programming, especially, or technical writing that you're doing can be like that."}, {"time": 2768, "text": "Do you find yourself, methodologically, how do you every day sit down to do the work?"}, {"time": 2776, "text": "Is it a challenge?"}, {"time": 2778, "text": "You kind of say it's, you know, it's fun."}, {"time": 2784, "text": "But it'd be interesting to hear if there are non fun parts that you really struggle with."}, {"time": 2791, "text": "Yeah, so the fun comes when I'm able to put together ideas of two people who didn't know about each other."}, {"time": 2799, "text": "And so I might be the first person that saw both of their ideas."}, {"time": 2804, "text": "And so then, you know, then I get to make the synthesis and that gives me a chance to be creative."}, {"time": 2812, "text": "But the dredge work is where I've got to chase everything down to its root."}, {"time": 2817, "text": "This leads me into really interesting stuff."}, {"time": 2820, "text": "I mean, I learn about Sanskrit and I try to give credit to all the authors."}, {"time": 2826, "text": "And so I write to people who know the authors if they're dead or I communicate this way."}, {"time": 2836, "text": "And I got to get the math right."}, {"time": 2838, "text": "And I got to tackle all my programs, try to find holes in them."}, {"time": 2842, "text": "And I rewrite the programs after I get a better idea."}, {"time": 2846, "text": "Is there ever dead ends?"}, {"time": 2848, "text": "Oh yeah, I throw stuff out, yeah."}, {"time": 2851, "text": "One of the things that I spend a lot of time preparing, a major example based on the game of baseball."}, {"time": 2860, "text": "And I know a lot of people for whom baseball is the most important thing in the world."}, {"time": 2866, "text": "But I also know a lot of people for whom cricket is the most important in the world or soccer or something."}, {"time": 2872, "text": "You know, and I realized that if I had a big example, I mean, it was gonna have a fold out illustration and everything."}, {"time": 2880, "text": "And I was saying, well, what am I really teaching about algorithms here where I had this baseball example?"}, {"time": 2886, "text": "And if I was a person who knew only cricket, wouldn't they, what would they think about this?"}, {"time": 2892, "text": "And so I've ripped the whole thing out."}, {"time": 2894, "text": "But I had something that would have really appealed to people who grew up with baseball as a major theme in their life."}, {"time": 2904, "text": "Which is a lot of people, but still a minority."}, {"time": 2908, "text": "Small minority, I took out bowling too."}, {"time": 2913, "text": "Even a smaller minority."}, {"time": 2916, "text": "What's the art in the art of programming?"}, {"time": 2920, "text": "Why is there, of the few words in the title, why is art one of them?"}, {"time": 2926, "text": "Yeah, well, that's what I wrote my Turing lecture about."}, {"time": 2930, "text": "And so when people talk about art, it really, I mean, what the word means is something that's not in nature."}, {"time": 2942, "text": "So when you have artificial intelligence, art comes from the same root, saying that this is something that was created by human beings."}, {"time": 2954, "text": "And then it's gotten a further meaning often of fine art, which has this beauty to the mix."}, {"time": 2961, "text": "And so we have things that are artistically done, and this means not only done by humans, but also done in a way that's elegant and brings joy."}, {"time": 2975, "text": "And has, I guess, Tolstoy versus Dostoevsky going back."}, {"time": 2984, "text": "But anyway, it's that part that says that it's done well, as well as not only different from nature."}, {"time": 2994, "text": "In general, then, art is what human beings are specifically good at."}, {"time": 3001, "text": "And when they say artificial intelligence, well, they're trying to mimic human beings."}, {"time": 3007, "text": "But there's an element of fine art and beauty."}, {"time": 3011, "text": "You are one."}, {"time": 3012, "text": "That's what I try to also say, that you can write a program and make a work of art."}, {"time": 3019, "text": "So now, in terms of surprising, what ideas in writing from search to the combinatorial algorithms, what ideas have you come across that were particularly surprising to you that changed the way you see a space of problems?"}, {"time": 3048, "text": "I get a surprise every time I have a bug in my program, obviously."}, {"time": 3051, "text": "But that isn't really what you're at."}, {"time": 3053, "text": "More transformational than surprising."}, {"time": 3057, "text": "For example, in volume 4A, I was especially surprised when I learned about data structure called BDD, Boolean Decision Diagram."}, {"time": 3068, "text": "Because I sort of had the feeling that as an old timer, and I've been programming since the 50s, and BDDs weren't invented until 1986."}, {"time": 3083, "text": "And here comes a brand new idea that revolutionizes the way to represent a Boolean function."}, {"time": 3089, "text": "And Boolean functions are so basic to all kinds of things in, I mean, logic is, underlies it."}, {"time": 3099, "text": "Everything we can describe, all of what we know in terms of logic somehow, and propositional logic, I thought that was cut and dried and everything was known."}, {"time": 3115, "text": "But here comes Randy Bryant and discovers that BDDs are incredibly powerful."}, {"time": 3125, "text": "Then, so that means I have a whole new section to the book that I never would have thought of until 1986, not even until 1990s, when people started to use it for a billion dollar of applications."}, {"time": 3146, "text": "And it was the standard way to design computers for a long time, until SAT solvers came along in the year 2000."}, {"time": 3154, "text": "So that's another great big surprise."}, {"time": 3156, "text": "So a lot of these things have totally changed the structure of my book."}, {"time": 3162, "text": "And the middle third of volume 4B is about SAT solvers, and that's 300 plus pages, which is all about material, mostly about material that was discovered in this century."}, {"time": 3179, "text": "And I had to start from scratch and meet all the people in the field and write 15 different SAT solvers that I wrote while preparing that."}, {"time": 3190, "text": "Seven of them are described in the book."}, {"time": 3192, "text": "Others were from my own experience."}, {"time": 3196, "text": "So newly invented data structures or ways to represent?"}, {"time": 3200, "text": "A whole new class of algorithm."}, {"time": 3202, "text": "Whole new class of algorithm."}, {"time": 3203, "text": "Yeah, and the interesting thing about the BDDs was that the theoreticians started looking at it and started to describe all the things you couldn't do with BDDs."}, {"time": 3216, "text": "And so they were getting a bad name because, okay, they were useful, but they didn't solve every problem."}, {"time": 3228, "text": "I'm sure that the theoreticians are, in the next 10 years, are gonna show why machine learning doesn't solve everything."}, {"time": 3236, "text": "But I'm not only worried about the worst case, I get a huge delight when I can actually solve a problem that I couldn't solve before."}, {"time": 3245, "text": "Even though I can't solve the problem that it suggests is a further problem, I know that I'm way better than I was before."}, {"time": 3254, "text": "And so I found out that BDDs could do all kinds of miraculous things."}, {"time": 3259, "text": "And so I had to spend quite a few years learning about that territory."}, {"time": 3271, "text": "So in general, what brings you more pleasure?"}, {"time": 3276, "text": "Proving or showing a worst case analysis of an algorithm or showing a good average case or just showing a good case?"}, {"time": 3285, "text": "That something good, pragmatically can be done with this algorithm."}, {"time": 3289, "text": "Yeah, I like a good case that is maybe only a million times faster than I was able to do before."}, {"time": 3295, "text": "But, and not worry about the fact that it's still gonna take too long if I double the size of the problem."}, {"time": 3305, "text": "So that said, you popularized the asymptotic notation for describing running time, obviously in the analysis of algorithms."}, {"time": 3315, "text": "Worst case is such an important part."}, {"time": 3318, "text": "Do you see any aspects of that kind of analysis as lacking and notation too?"}, {"time": 3326, "text": "Well, the main purpose should have notations that help us for the problems we wanna solve."}, {"time": 3333, "text": "And so they match our intuitions."}, {"time": 3336, "text": "And people who worked in number theory had used asymptotic notation in a certain way, but it was only known to a small group of people."}, {"time": 3346, "text": "And I realized that, in fact, it was very useful to be able to have a notation for something that we don't know exactly what it is, but we only know partial about it."}, {"time": 3357, "text": "And so instead, so for example, instead of big O notation, let's just take a much simpler notation where I'd say zero or one, or zero, one or two."}, {"time": 3370, "text": "And suppose that when I had been in high school, we would be allowed to put in the middle of our formula, X plus zero, one or two equals Y, okay?"}, {"time": 3383, "text": "And then we would learn how to multiply two such expressions together and deal with them."}, {"time": 3392, "text": "Well, the same thing big O notation says, here's something that's, I'm not sure what it is, but I know it's not too big."}, {"time": 3401, "text": "I know it's not bigger than some constant times N squared or something like that."}, {"time": 3405, "text": "So I write big O of N squared."}, {"time": 3407, "text": "And now I learned how to add big O of N squared to big O of N cubed."}, {"time": 3411, "text": "And I know how to add big O of N squared to plus one and square that and how to take logarithmic exponentials where I have big O's in the middle of them."}, {"time": 3420, "text": "And that turned out to be hugely valuable in all of the work that I was trying to do as I'm trying to figure out how good an algorithm is."}, {"time": 3429, "text": "So have there been algorithms in your journey that perform very differently in practice than they do in theory?"}, {"time": 3438, "text": "Well, the worst case of a combinatorial algorithm is almost always horrible."}, {"time": 3445, "text": "But we have SAT solvers that are solving, where one of the last exercises in that part of my book was to figure out a problem that has 100 variables that's difficult for a SAT solver."}, {"time": 3461, "text": "But you would think that a problem with 100 billion variables has, requires you to do two to the 100th operations because that's the number of possibilities when you have 100 billion variables in two to the 100th."}, {"time": 3477, "text": "Two to the 100th is way bigger than we can handle."}, {"time": 3480, "text": "10 to the 17th is a lot."}, {"time": 3483, "text": "You've mentioned over the past few years that you believe P may be equal to NP, but that it's not really, if somebody does prove that P equals NP, it will not directly lead to an actual algorithm to solve difficult problems."}, {"time": 3499, "text": "Can you explain your intuition here?"}, {"time": 3501, "text": "Has it been changed?"}, {"time": 3503, "text": "And in general, on the difference between easy and difficult problems of P and NP and so on?"}, {"time": 3508, "text": "Yeah, so the popular idea is if an algorithm exists, then somebody will find it."}, {"time": 3516, "text": "And it's just a matter of writing it down."}, {"time": 3524, "text": "But many more algorithms exist than anybody can understand or ever make use of."}, {"time": 3531, "text": "Or discover, yeah."}, {"time": 3533, "text": "Because they're just way beyond human comprehension."}, {"time": 3536, "text": "The total number of algorithms is more than mind boggling."}, {"time": 3543, "text": "So we have situations now where we know that algorithms exist, but we don't have the farthest idea what the algorithms are."}, {"time": 3552, "text": "There are simple examples based on game playing where you have, where you say, well, there must be an algorithm that exists to win in the game of Hex because, for the first player to win in the game of Hex because Hex is always either a win for the first player or the second player."}, {"time": 3575, "text": "Well, what's the game of Hex?"}, {"time": 3576, "text": "There's a game of Hex which is based on putting pebbles onto a hexagonal board and the white player tries to get a white path from left to right and the black player tries to get a black path from bottom to top."}, {"time": 3589, "text": "And how does capture occur?"}, {"time": 3591, "text": "Just so I understand."}, {"time": 3591, "text": "And there's no capture."}, {"time": 3593, "text": "You just put pebbles down one at a time."}, {"time": 3596, "text": "But there's no draws because after all the white and black are played, there's either gonna be a white path across from east to west or a black path from bottom to top."}, {"time": 3605, "text": "So there's always, it's the perfect information game and people take turns like tic tac toe."}, {"time": 3615, "text": "And the hex board can be different sizes."}, {"time": 3618, "text": "But anyway, there's no possibility of a draw and players move one at a time."}, {"time": 3624, "text": "And so it's gotta be either a first player win or a second player win."}, {"time": 3627, "text": "Mathematically, you follow out all the trees and either there's always a win for the first player, second player, okay."}, {"time": 3636, "text": "And it's finite."}, {"time": 3637, "text": "The game is finite."}, {"time": 3638, "text": "So there's an algorithm that will decide."}, {"time": 3641, "text": "You can show it has to be one or the other because the second player could mimic the first player with kind of a pairing strategy."}, {"time": 3649, "text": "And so you can show that it has to be one way or the other."}, {"time": 3656, "text": "But we don't know any algorithm anyway."}, {"time": 3658, "text": "We don't know the third or the fourth."}, {"time": 3661, "text": "There are cases where you can prove the existence of a solution but nobody knows any way how to find it."}, {"time": 3668, "text": "But more like the algorithm question, there's a very powerful theorem in graph theory by Robinson and Seymour that says that every class of graphs that is closed under taking minors has a polynomial time algorithm to determine whether it's in this class or not."}, {"time": 3691, "text": "Now a class of graphs, for example, planar graphs."}, {"time": 3693, "text": "These are graphs that you can draw in a plane without crossing lines."}, {"time": 3697, "text": "And a planar graph, taking minors means that you can shrink an edge into a point or you can delete an edge."}, {"time": 3709, "text": "And so you start with a planar graph and shrink any edge to a point is still planar."}, {"time": 3714, "text": "Delete an edge is still planar."}, {"time": 3716, "text": "Okay, now, but there are millions of different ways to describe a family of graph that still remains the same under taking minor."}, {"time": 3734, "text": "And Robertson and Seymour proved that any such family of graphs, there's a finite number of minimum graphs that are obstructions so that if it's not in the family, then it has to contain, then there has to be a way to shrink it down until you get one of these bad minimum graphs that's not in the family."}, {"time": 3761, "text": "In the case of a planar graph, the minimum graph is a five pointed star where everything points to another and the minimum graph consisting of trying to connect three utilities to three houses without crossing lines."}, {"time": 3774, "text": "And so there are two bad graphs that are not planar and every non planar graph contains one of these two bad graphs by shrinking and removing edges."}, {"time": 3787, "text": "Sorry, can you say it again?"}, {"time": 3788, "text": "So he proved that there's a finite number of these bad graphs."}, {"time": 3791, "text": "There's always a finite number."}, {"time": 3793, "text": "So somebody says, here's a family."}, {"time": 3795, "text": "It's hard to believe."}, {"time": 3796, "text": "And they present a sequence of 20 papers."}, {"time": 3800, "text": "I mean, it's deep work, but it's."}, {"time": 3805, "text": "Because that's for any arbitrary class."}, {"time": 3807, "text": "So for any arbitrary class that's closed under taking minors."}, {"time": 3811, "text": "That's closed under, maybe I'm not understanding because it seems like a lot of them are closed under taking minors."}, {"time": 3816, "text": "Almost all the important classes of graphs are."}, {"time": 3819, "text": "There are tons of such graphs, but also hundreds of them that arise in applications."}, {"time": 3828, "text": "I have a book over here called classes of graphs and it's amazing how many different classes of graphs that people have looked at."}, {"time": 3838, "text": "So why do you bring up this theorem or this proof?"}, {"time": 3842, "text": "So now there are lots of algorithms that are known for special class of graphs."}, {"time": 3847, "text": "For example, if I have a certain, if I have a chordal graph then I can color it efficiently."}, {"time": 3852, "text": "If I have some kind of graphs, it'll make a great network."}, {"time": 3857, "text": "So you'd like to test, somebody gives you a graph and says, oh, is it in this family of graphs?"}, {"time": 3864, "text": "If so, then I can go to the library and find an algorithm that's gonna solve my problem on that graph."}, {"time": 3872, "text": "Okay, so we wanna have a graph that says, an algorithm that says, you give me a graph, I'll tell you whether it's in this family or not, okay?"}, {"time": 3888, "text": "And so all I have to do is test whether or not that does this given graph have a minor, that's one of the bad ones."}, {"time": 3897, "text": "A minor is everything you can get by shrinking and removing edges."}, {"time": 3901, "text": "And given any minor, there's a polynomial time algorithm saying, I can tell whether this is a minor of you."}, {"time": 3909, "text": "And there's a finite number of bad cases."}, {"time": 3911, "text": "So I just try, does it have this bad case?"}, {"time": 3915, "text": "Polynomial time, I got the answer."}, {"time": 3917, "text": "Does it have this bad case?"}, {"time": 3921, "text": "Total polynomial time."}, {"time": 3923, "text": "And so I've solved the problem."}, {"time": 3924, "text": "However, all we know is that the number of minors is finite."}, {"time": 3928, "text": "We don't know what, we might only know one or two of those minors, but we don't know if we've got a, if we've got 20 of them, we don't know, there might be 21, 25, there's just some, all we know is that it's finite."}, {"time": 3942, "text": "So here we have a polynomial time algorithm that we don't know."}, {"time": 3946, "text": "That's a really great example of what you worry about or why you think P equals NP won't be useful."}, {"time": 3953, "text": "But still, why do you hold the intuition that P equals NP?"}, {"time": 3958, "text": "P equals NP because you have to rule out so many possible algorithms as being not working."}, {"time": 3971, "text": "You can take the graph and you can represent it as in terms of certain prime numbers, and then you can multiply those together, and then you can take the bitwise AND and construct some certain constant in polynomial time."}, {"time": 3990, "text": "And then that's perfectly valid algorithm."}, {"time": 3993, "text": "And there's so many algorithms of that kind."}, {"time": 3997, "text": "A lot of times we see random, take data and we get coincidences that some fairly random looking number actually is useful because it happens to solve a problem just because there's so many hairs on your head."}, {"time": 4026, "text": "But it seems like unlikely that two people are gonna have the same number of hairs on their head."}, {"time": 4034, "text": "But they're obvious, but you can count how many people there are and how many hairs on the head."}, {"time": 4040, "text": "There must be people walking around in the country that have the same number of hairs on their head."}, {"time": 4044, "text": "Well, that's a kind of a coincidence that you might say also this particular combination of operations just happens to prove that the graph has a Hamiltonian path."}, {"time": 4056, "text": "I see lots of cases where unexpected things happen when you have enough possibilities."}, {"time": 4064, "text": "So because the space of possibility is so huge, your intuition just says it's not."}, {"time": 4067, "text": "You have to rule them all out."}, {"time": 4069, "text": "And so that's the reason for my intuition."}, {"time": 4071, "text": "It's by no means a proof."}, {"time": 4073, "text": "I mean, some people say, well, P can't equal NP because you've had all these smart people."}, {"time": 4082, "text": "The smartest designers of algorithms have been racking their brains for years and years and there's million dollar prizes out there and none of them, nobody has thought of the algorithm."}, {"time": 4096, "text": "So there must be no such algorithm."}, {"time": 4099, "text": "On the other hand, I can use exactly the same logic and I can say, well, P must be equal to NP because there's so many smart people out here have been trying to prove it unequal to NP and they've all failed."}, {"time": 4114, "text": "This kind of reminds me of the discussion about the search for aliens."}, {"time": 4119, "text": "They've been trying to look for them and we haven't found them yet, therefore they don't exist."}, {"time": 4123, "text": "But you can show that there's so many planets out there that they very possibly could exist."}, {"time": 4128, "text": "Yeah, right, and then there's also the possibility that they exist but they all discovered machine learning or something and then blew each other up."}, {"time": 4140, "text": "Well, on that small, quick tangent, let me ask, do you think there's intelligent life out there in the universe?"}, {"time": 4147, "text": "I have no idea."}, {"time": 4148, "text": "Do you hope so?"}, {"time": 4149, "text": "Do you think about it?"}, {"time": 4150, "text": "I don't spend my time thinking about things that I could never know, really."}, {"time": 4156, "text": "And yet you do enjoy the fact that there's many things you don't know."}, {"time": 4160, "text": "You do enjoy the mystery of things."}, {"time": 4163, "text": "I enjoy the fact that I have limits, yeah."}, {"time": 4167, "text": "But I don't take time to answer unsolvable questions."}, {"time": 4175, "text": "Well, because you've taken on some tough questions that may seem unsolvable."}, {"time": 4180, "text": "You have taken on some tough questions that may seem unsolvable, but they're in the space."}, {"time": 4184, "text": "It gives me a thrill when I can get further than I ever thought I could, yeah."}, {"time": 4188, "text": "But much like with religion, these."}, {"time": 4193, "text": "I'm glad that there's no proof that God exists or not."}, {"time": 4197, "text": "I mean, I think."}, {"time": 4199, "text": "It would spoil the mystery."}, {"time": 4200, "text": "It would be too dull, yeah."}, {"time": 4204, "text": "So to quickly talk about the other art of artificial intelligence, what's your view?"}, {"time": 4214, "text": "Artificial intelligence community has developed as part of computer science and in parallel with computer science since the 60s."}, {"time": 4221, "text": "What's your view of the AI community from the 60s to now?"}, {"time": 4227, "text": "So all the way through, it was the people who were inspired by trying to mimic intelligence or to do things that were somehow the greatest achievements of intelligence that had been inspiration to people who have pushed the envelope of computer science maybe more than any other group of people."}, {"time": 4250, "text": "So all the way through, it's been a great source of good problems to sink teeth into."}, {"time": 4258, "text": "Sink teeth into and getting partial answers and then more and more successful answers over the years."}, {"time": 4270, "text": "So this has been the inspiration for lots of the great discoveries of computer science."}, {"time": 4276, "text": "Are you yourself captivated by the possibility of creating, of algorithms having echoes of intelligence in them?"}, {"time": 4328, "text": "Do you think it's possible to create without understanding?"}, {"time": 4332, "text": "So to."}, {"time": 4333, "text": "Oh, I do that all the time too, I mean."}, {"time": 4336, "text": "So I use random numbers, but there's still this great gap."}, {"time": 4344, "text": "I don't assert that it's impossible, but I don't see anything coming any closer to really the kind of stuff that I would consider intelligence."}, {"time": 4358, "text": "So you've mentioned something that, on that line of thinking, which I very much agree with, so The Art of Computer Programming as the book is focused on single processor algorithms, and for the most part, you mentioned."}, {"time": 4377, "text": "That's only because I set the table of contents in 1962, you have to remember."}, {"time": 4382, "text": "For sure, there's no."}, {"time": 4384, "text": "I'm glad I didn't wait until 1965 or something."}, {"time": 4388, "text": "That's, one book, maybe we'll touch on the Bible, but one book can't always cover the entirety of everything."}, {"time": 4397, "text": "So I'm glad the table of contents for The Art of Computer Programming is what it is."}, {"time": 4405, "text": "But you did mention that you thought that an understanding of the way ant colonies are able to perform incredibly organized tasks might well be the key to understanding human cognition."}, {"time": 4418, "text": "So these fundamentally distributed systems."}, {"time": 4422, "text": "So what do you think is the difference between the way Don Knuth would sort a list and an ant colony would sort a list or perform an algorithm?"}, {"time": 4432, "text": "Sorting a list isn't the same as cognition, though, but I know what you're getting at is."}, {"time": 4440, "text": "Well, the advantage of ant colonies, at least we can see what they're doing."}, {"time": 4444, "text": "We know which ant has talked to which other ant, and it's much harder with the brains to know to what extent neurons are passing signal."}, {"time": 4458, "text": "So I'm just saying that ant colony might be, if they have the secret of cognition, think of an ant colony as a cognitive single being rather than as a colony of lots of different ants."}, {"time": 4472, "text": "I mean, just like the cells of our brain and the microbiome and all that is interacting entities, but somehow I consider myself to be a single person."}, {"time": 4488, "text": "Well, an ant colony, you can say, might be cognitive somehow."}, {"time": 4495, "text": "It's some suggestion."}, {"time": 4497, "text": "Yeah, I mean, okay, I smash a certain ant and the organism's saying, hmm, that stung."}, {"time": 4506, "text": "But if we're going to crack the secret of cognition, it might be that we could do so by psyching out how ants do it because we have a better chance to measure their communicating by pheromones and by touching each other in sight, but not by much more subtle phenomenon like electric currents going through."}, {"time": 4530, "text": "But even a simpler version of that, what are your thoughts of maybe Conway's Game of Life?"}, {"time": 4535, "text": "Okay, so Conway's Game of Life is able to simulate any computable process."}, {"time": 4544, "text": "And any deterministic process is..."}, {"time": 4546, "text": "I like how you went there."}, {"time": 4548, "text": "I mean, that's not its most powerful thing, I would say."}, {"time": 4553, "text": "I mean, it can simulate it, but the magic is that the individual units are distributed and extremely simple."}, {"time": 4563, "text": "Yes, we understand exactly what the primitives are."}, {"time": 4566, "text": "The primitives, just like with the ant colony, even simpler, though."}, {"time": 4569, "text": "But still, it doesn't say that I understand life."}, {"time": 4576, "text": "I mean, it gives me a better insight into what does it mean to have a deterministic universe?"}, {"time": 4587, "text": "What does it mean to have free choice, for example?"}, {"time": 4595, "text": "Do you think God plays dice?"}, {"time": 4598, "text": "I don't see any reason why God should be forbidden from using the most efficient ways to..."}, {"time": 4609, "text": "I mean, we know that dice are extremely important in efficient algorithms."}, {"time": 4614, "text": "There are things that couldn't be done well without randomness."}, {"time": 4618, "text": "And so, I don't see any reason why God should be prohibited."}, {"time": 4623, "text": "When the algorithm requires it, you don't see why the physics should constrain it."}, {"time": 4631, "text": "So, in 2001, you gave a series of lectures at MIT about religion and science."}, {"time": 4637, "text": "No, that was in 1999."}, {"time": 4640, "text": "The book came out in 2001."}, {"time": 4642, "text": "So, in 1999, you spent a little bit of time in Boston enough to give those lectures."}, {"time": 4650, "text": "And I read the 2001 version, most of it."}, {"time": 4656, "text": "It's quite fascinating to read."}, {"time": 4657, "text": "I recommend people, it's a transcription of your lectures."}, {"time": 4660, "text": "So, what did you learn about how ideas get started and grow from studying the history of the Bible?"}, {"time": 4666, "text": "So, you've rigorously studied a very particular part of the Bible."}, {"time": 4671, "text": "What did you learn from this process about the way us human beings as a society develop and grow ideas, share ideas, and are defined by those ideas?"}, {"time": 4681, "text": "Well, it's hard to summarize that."}, {"time": 4685, "text": "I wouldn't say that I learned a great deal of really definite things where I could make conclusions, but I learned more about what I don't know."}, {"time": 4695, "text": "You have a complex subject, which is really beyond human understanding."}, {"time": 4701, "text": "So, we give up on saying, I'm never gonna get to the end of the road and I'm never gonna understand it, but you say, but maybe it might be good for me to get closer and closer and learn more and more about something."}, {"time": 4714, "text": "And so, how can I do that efficiently?"}, {"time": 4719, "text": "And the answer is, well, use randomness."}, {"time": 4722, "text": "And so, try a random subset of that is within my grasp and study that in detail, instead of just studying parts that somebody tells me to study, or instead of studying nothing because it's too hard."}, {"time": 4745, "text": "So, I decided, for my own amusement once, that I would take a subset of the verses of the Bible and I would try to find out what the best thinkers have said about that small subset."}, {"time": 4769, "text": "And I had about, let's say 60 verses out of 3,000, I think it's one out of 500 or something like this."}, {"time": 4777, "text": "And so, then I went to the libraries, which are well indexed."}, {"time": 4783, "text": "I spent, for example, at Boston Public Library, I would go once a week for a year and I went, I have done times to Hanover Harvard Library to look at this, that weren't in the Boston Public, where scholars had looked and you can go down the shelves and you can look in the index and say, oh, is this verse mentioned anywhere in this book?"}, {"time": 4815, "text": "If so, look at page 105."}, {"time": 4817, "text": "So, in other words, I could learn not only about the Bible, but about the secondary literature about the Bible, the things that scholars have written about it."}, {"time": 4825, "text": "And so, that gave me a way to zoom in on parts of the thing, so that I could get more insight."}, {"time": 4835, "text": "And so, I look at it as a way of giving me some firm pegs, which I could hang pieces of information, but not as things where I would say, and therefore, this is true."}, {"time": 4850, "text": "In this random approach of sampling the Bible, what did you learn about the most central, one of the biggest accumulation of ideas in our history?"}, {"time": 4865, "text": "It seemed to me that the main thrust was not the one that most people think of as saying, oh, don't have sex or something like this, but that the main thrust was to try to figure out how to live in harmony with God's wishes."}, {"time": 4884, "text": "I'm assuming that God exists, and as I say, I'm glad that there's no way to prove this, because I would run through the proof once, and then I'd forget it, and I would never speculate about spiritual things and mysteries otherwise, and I think my life would be very incomplete."}, {"time": 4911, "text": "So, I'm assuming that God exists, but a lot of the people say God doesn't exist, but that's still important to them."}, {"time": 4923, "text": "And so, in a way, that might still be, whether God is there or not, in some sense, God is important to them."}, {"time": 4932, "text": "One of the verses I studied, Doc, you can interpret it as saying that it's much better to be an atheist than not to care at all."}, {"time": 4944, "text": "So, I would say it's similar to the P equals NP discussion."}, {"time": 4949, "text": "You mentioned a mental exercise that I'd love it if you could partake in yourself, a mental exercise of being God."}, {"time": 4959, "text": "So, if you were God, Doc Neuth, how would you present yourself to the people of Earth?"}, {"time": 4965, "text": "You mentioned your love of literature, and there's this book that really I can recommend to you."}, {"time": 4972, "text": "Yeah, the title, I think, is Blasphemy."}, {"time": 4975, "text": "It talks about God revealing Himself through a computer in Los Alamos, and it's the only book that I've ever read where the punchline was really the very last word of the book and explained the whole idea of the book."}, {"time": 4998, "text": "And so, I'd only give that away, but it's really very much about this question that you raised."}, {"time": 5007, "text": "But suppose God said, okay, my previous means of communication with the world are not the best for the 21st century, so what should I do now?"}, {"time": 5021, "text": "And it's conceivable that God would choose the way that's described in this book."}, {"time": 5031, "text": "Another way to look at this exercise is looking at the human mind, looking at the human spirit, the human life in a systematic way."}, {"time": 5039, "text": "I think mostly you want to learn humility."}, {"time": 5042, "text": "You want to realize that once we solve one problem, that doesn't mean that all of a sudden other problems are going to drop out."}, {"time": 5049, "text": "And we have to realize that there are things beyond our ability."}, {"time": 5062, "text": "I see hubris all around."}, {"time": 5066, "text": "Yeah, well said."}, {"time": 5068, "text": "If you were to run program analysis on your own life, how did you do in terms of correctness, running time, resource use, asymptotically speaking, of course?"}, {"time": 5081, "text": "Okay, yeah, well, I would say that question has not been asked me before."}, {"time": 5090, "text": "And I started out with library subroutines and learning how to be an automaton that was obedient, and I had the great advantage that I didn't have anybody to blame for my failures."}, {"time": 5118, "text": "If I started not understanding something, I knew that I should stop playing ping pong, and it was my fault that I wasn't studying hard enough or something, rather than that somebody was discriminating against me in some way."}, {"time": 5133, "text": "And I don't know how to avoid the existence of biases in the world, but I know that that's an extra burden that I didn't have to suffer from."}, {"time": 5146, "text": "And then I found from parents, I learned the idea of service to other people as being more important than what I get out of stuff myself."}, {"time": 5170, "text": "I know that I need to be happy enough in order to be able to be of service, but I came to a philosophy finally that I phrase as, point eight is enough."}, {"time": 5188, "text": "There was a TV show once called Eight is Enough, which was about somebody had eight kids."}, {"time": 5195, "text": "But I say point eight is enough, which means if I can have a way of rating happiness, I think it's good design to have an organism that's happy about 80% of the time."}, {"time": 5215, "text": "And if it was 100% of the time, it would be like everybody's on drugs and everything collapses and nothing works because everybody's just too happy."}, {"time": 5229, "text": "Do you think you've achieved that point eight optimal balance?"}, {"time": 5233, "text": "There are times when I'm down and I know that I've actually been programmed to be depressed a certain amount of time."}, {"time": 5247, "text": "And if that gets out of kilter and I'm more depressed than usual, sometimes I find myself trying to think, now, who should I be mad at today?"}, {"time": 5256, "text": "There must be a reason why."}, {"time": 5259, "text": "But then I realize it's just my chemistry telling me that I'm supposed to be mad at somebody, and so I trigger it up and say, okay, go to sleep and get better."}, {"time": 5269, "text": "But if I'm not 100% happy, that doesn't mean that I should find somebody that's screwing me and try to silence them."}, {"time": 5281, "text": "But I'm saying, okay, I'm not 100% happy, but I'm happy enough to be part of a sustainable situation."}, {"time": 5294, "text": "So that's kind of the numerical analysis I do."}, {"time": 5301, "text": "You've converged towards the optimal, which for human life is a point eight."}, {"time": 5305, "text": "I hope it's okay to talk about, as you talked about previously, in 2006 you were diagnosed with prostate cancer."}, {"time": 5314, "text": "Has that encounter with mortality changed you in some way or the way you see the world?"}, {"time": 5320, "text": "Yeah, it did."}, {"time": 5320, "text": "The first encounter with mortality was when my dad died, and I went through a month when I sort of came to be comfortable with the fact that I was going to die someday."}, {"time": 5339, "text": "And during that month, I don't know, I felt okay, but I couldn't sing."}, {"time": 5349, "text": "And I couldn't do original research either."}, {"time": 5354, "text": "I sort of remember after three or four weeks, the first time I started having a technical thought that made sense and was maybe slightly creative, I could sort of feel that something was starting to move again."}, {"time": 5369, "text": "So I felt very empty until I came to grips with it."}, {"time": 5369, "text": "I learned that this is sort of a standard grief process that people go through."}, {"time": 5382, "text": "Okay, so then now I'm at a point in my life, even more so than in 2006, where all of my goals have been fulfilled except for finishing the art of computer programming."}, {"time": 5394, "text": "I had one major unfulfilled goal."}, {"time": 5394, "text": "I'd wanted all my life to write a piece of music, and I had an idea for a certain kind of music that I thought ought to be written, at least somebody ought to try to do it."}, {"time": 5415, "text": "And I felt that it wasn't going to be easy, but I wanted proof of concept."}, {"time": 5424, "text": "I wanted to know if it was going to work or not, and so I spent a lot of time."}, {"time": 5428, "text": "And finally, I finished that piece, and we had the world premiere last year on my 80th birthday, and we had another premiere in Canada, and there's talk of concerts in Europe and various things."}, {"time": 5442, "text": "But that's done."}, {"time": 5442, "text": "It's part of the world's music now, and it's either good or bad, but I did what I was hoping to do."}, {"time": 5450, "text": "So the only thing that I have on my agenda is to try to do as well as I can with the art of computer programming until I go to CINA."}, {"time": 5463, "text": "Do you think there's an element of.8 that might apply there?"}, {"time": 5467, "text": ".8?"}, {"time": 5467, "text": "Well, I look at it more that I got actually to 1.0 when that concert was over with."}, {"time": 5484, "text": "So in 2006, I was at.8, so when I was diagnosed with prostate cancer, then I said, okay, well, I've had all kinds of good luck all my life, and I have nothing to complain about, so I might die now, and we'll see what happens."}, {"time": 5505, "text": "And so quite seriously, I had no expectation that I deserved better."}, {"time": 5517, "text": "I didn't make any plans for the future."}, {"time": 5517, "text": "I came out of the surgery and spent some time learning how to walk again and so on."}, {"time": 5531, "text": "It was painful for a while, but I got home, and I realized I hadn't really thought about what to do next."}, {"time": 5541, "text": "I hadn't any expectation."}, {"time": 5541, "text": "I said, okay, hey, I'm still alive."}, {"time": 5541, "text": "Okay, now I can write some more books."}, {"time": 5548, "text": "But I didn't come with the attitude that this was terribly unfair, and I just said, okay, I was accepting whatever turned out."}, {"time": 5564, "text": "I'd gotten more than my share already, so why should I?"}, {"time": 5578, "text": "When I got home, I realized that I had really not thought about the next step, what I would do after I would be able to work again."}, {"time": 5585, "text": "I was comfortable with the fact that it was at the end, but I was hoping that I would still be able to learn about satisfiability and also someday even write music."}, {"time": 5609, "text": "I didn't start seriously on the music project until 2012."}, {"time": 5614, "text": "So I'm going to be in huge trouble if I don't talk to you about this."}, {"time": 5619, "text": "In the 70s, you've created the tech typesetting system together with MetaFont language for font description and computer modern family of typefaces."}, {"time": 5629, "text": "That has basically defined the methodology and the aesthetic of countless research fields, math, physics, beyond computer science, so on."}, {"time": 5642, "text": "Okay, well, first of all, thank you."}, {"time": 5645, "text": "I think I speak for a lot of people in saying that."}, {"time": 5648, "text": "But question in terms of beauty."}, {"time": 5651, "text": "There's a beauty to typography that you've created, and yet beauty is hard to quantify."}, {"time": 5660, "text": "How does one create beautiful letters and beautiful equations?"}, {"time": 5668, "text": "Perhaps there's no words to be describing the process."}, {"time": 5675, "text": "So the great Harvard mathematician George D. Burkhoff wrote a book in the 30s called Aesthetic Measure where he would have pictures of vases and underneath would be a number."}, {"time": 5690, "text": "And this was how beautiful the vase was."}, {"time": 5692, "text": "And he had a formula for this."}, {"time": 5694, "text": "And he actually also wrote about music."}, {"time": 5698, "text": "So I thought maybe part of my musical composition I would try to program his algorithms so that I would write something that had the highest number by his score."}, {"time": 5714, "text": "Well, it wasn't quite rigorous enough for a computer to do."}, {"time": 5719, "text": "But anyway, people have tried to put numerical value on beauty, and he did probably the most serious attempt."}, {"time": 5729, "text": "And George Gershwin's teacher also wrote two volumes where he talked about his method of composing music."}, {"time": 5738, "text": "But you're talking about another kind of beauty and letters and letter phrases."}, {"time": 5743, "text": "Elegance and whatever that curvature is."}, {"time": 5746, "text": "And so that's in the eye of the beholder, as they say."}, {"time": 5753, "text": "But striving for excellence in whatever definition you want to give to beauty, then you try to get as close to that as you can somehow."}, {"time": 5762, "text": "I guess I'm trying to ask, and there may not be a good answer, what loose definitions were you operating under with the community of people that you were working under?"}, {"time": 5773, "text": "Well, the loose definition, I wanted it to appeal to me."}, {"time": 5781, "text": "To you personally."}, {"time": 5783, "text": "That's a good start, right?"}, {"time": 5784, "text": "No, and it failed that test when Volume Two came out with the new printing, and I was expecting it to be the happiest day of my life."}, {"time": 5792, "text": "And I felt like a burning, like how angry I was that I opened the book and it was in the same beige covers, but it didn't look right on the page."}, {"time": 5808, "text": "The number two was particularly ugly."}, {"time": 5812, "text": "I couldn't stand any page that had a two in its page number."}, {"time": 5815, "text": "And I was expecting that."}, {"time": 5815, "text": "I spent all this time making measurements and I had looked at stuff in different ways and I had great technology, but I wasn't done."}, {"time": 5835, "text": "I had to retune the whole thing after 1961."}, {"time": 5840, "text": "Has it ever made you happy, finally?"}, {"time": 5843, "text": "Or is it a 0.8?"}, {"time": 5846, "text": "No, and so many books have come out that would never have been written without this."}, {"time": 5851, "text": "It's just a joy."}, {"time": 5854, "text": "But now, I mean, all these pages that are sitting up there, if I didn't like them, I would change them."}, {"time": 5864, "text": "Nobody else has this ability."}, {"time": 5868, "text": "They have to stick with what I gave them."}, {"time": 5870, "text": "So, in terms of the other side of it, there's the typography, so the look of the type and the curves and the lines."}, {"time": 5879, "text": "What about the spacing?"}, {"time": 5881, "text": "What about the?"}, {"time": 5882, "text": "The spacing between the white space."}, {"time": 5886, "text": "It seems like you could be a little bit more systematic about the layout or technical."}, {"time": 5892, "text": "You can always go further."}, {"time": 5893, "text": "I didn't stop at 0.8, but I stopped at about 0.98."}, {"time": 5902, "text": "It seems like you're not following your own rule for happiness."}, {"time": 5910, "text": "Of course, there's this, what is the Japanese word, wabi sabi or something, where the most beautiful works of art are those that have flaws because then the person who perceives them adds their own appreciation and that gives the viewer more satisfaction or so on."}, {"time": 5933, "text": "But no, no, with typography, I wanted it to look as good as I could in the vast majority of cases, and then when it doesn't, then I say, okay, that's 2% more work for the author."}, {"time": 5951, "text": "But I didn't want to say that my job was to get to 100% and take all the work away from the author."}, {"time": 5960, "text": "That's what I meant by that."}, {"time": 5962, "text": "So if you were to venture a guess, how much of the nature of reality do you think we humans understand?"}, {"time": 5971, "text": "You mentioned you appreciate mystery."}, {"time": 5974, "text": "How much of the world about us is shrouded in mystery?"}, {"time": 5978, "text": "If you were to put a number on it, what percent of it all do we understand?"}, {"time": 5985, "text": "How many leading zeros, 0.00?"}, {"time": 5990, "text": "I think it's infinitesimal."}]}]