[{"title": "Ian Goodfellow: Generative Adversarial Networks (GANs) | Lex Fridman Podcast #19", "id": "Z6rxFNMGdn0", "quotes": [{"time": 360, "text": "Cognition, yes, I think so."}, {"time": 362, "text": "Consciousness, it's really hard to even define what we mean by that."}, {"time": 367, "text": "I guess there's, consciousness is often defined as things like having self awareness, and that's relatively easy to turn into something actionable for a computer scientist to reason about."}, {"time": 378, "text": "People also define consciousness in terms of having qualitative states of experience, like qualia, and there's all these philosophical problems, like could you imagine a zombie who does all the same information processing as a human, but doesn't really have the qualitative experiences that we have?"}, {"time": 394, "text": "That sort of thing, I have no idea how to formalize or turn it into a scientific question."}, {"time": 400, "text": "I don't know how you could run an experiment to tell whether a person is a zombie or not."}, {"time": 404, "text": "And similarly, I don't know how you could run an experiment to tell whether an advanced AI system had become conscious in the sense of qualia or not."}, {"time": 413, "text": "But in the more practical sense, like almost like self attention, you think consciousness and cognition can, in an impressive way, emerge from current types of architectures that we think of as learning."}, {"time": 426, "text": "Or if you think of consciousness in terms of self awareness and just making plans based on the fact that the agent itself exists in the world, reinforcement learning algorithms are already more or less forced to model the agent's effect on the environment."}, {"time": 443, "text": "So that more limited version of consciousness is already something that we get limited versions of with reinforcement learning algorithms if they're trained well."}, {"time": 454, "text": "But you say limited, so the big question really is how you jump from limited to human level, right?"}, {"time": 462, "text": "And whether it's possible, even just building common sense reasoning seems to be exceptionally difficult."}, {"time": 470, "text": "So if we scale things up, if we get much better on supervised learning, if we get better at labeling, if we get bigger data sets, more compute, do you think we'll start to see really impressive things that go from limited to something, echoes of human level cognition?"}, {"time": 490, "text": "I think so, yeah."}, {"time": 491, "text": "I'm optimistic about what can happen just with more computation and more data."}, {"time": 496, "text": "I do think it'll be important to get the right kind of data."}, {"time": 500, "text": "Today, most of the machine learning systems we train are mostly trained on one type of data for each model."}, {"time": 507, "text": "But the human brain, we get all of our different senses and we have many different experiences like riding a bike, driving a car, talking to people, reading."}, {"time": 519, "text": "I think when we get that kind of integrated data set, working with a machine learning model that can actually close the loop and interact, we may find that algorithms not so different from what we have today learn really interesting things when you scale them up a lot and train them on a large amount of multimodal data."}, {"time": 538, "text": "So multimodal is really interesting, but within, like you're working adversarial examples."}, {"time": 544, "text": "So selecting within modal, within one mode of data, selecting better at what are the difficult cases from which you're most useful to learn from."}, {"time": 556, "text": "Oh yeah, like could we get a whole lot of mileage out of designing a model that's resistant to adversarial examples or something like that?"}, {"time": 564, "text": "Right, that's the question."}, {"time": 566, "text": "My thinking on that has evolved a lot over the last few years."}, {"time": 569, "text": "When I first started to really invest in studying adversarial examples, I was thinking of it mostly as adversarial examples reveal a big problem with machine learning and we would like to close the gap between how machine learning models respond to adversarial examples and how humans respond."}, {"time": 587, "text": "After studying the problem more, I still think that adversarial examples are important."}, {"time": 591, "text": "I think of them now more of as a security liability than as an issue that necessarily shows there's something uniquely wrong with machine learning as opposed to humans."}, {"time": 602, "text": "Also, do you see them as a tool to improve the performance of the system?"}, {"time": 606, "text": "Not on the security side, but literally just accuracy."}, {"time": 610, "text": "I do see them as a kind of tool on that side, but maybe not quite as much as I used to think."}, {"time": 616, "text": "We've started to find that there's a trade off between accuracy on adversarial examples and accuracy on clean examples."}, {"time": 624, "text": "Back in 2014, when I did the first adversarily trained classifier that showed resistance to some kinds of adversarial examples, it also got better at the clean data on MNIST."}, {"time": 636, "text": "And that's something we've replicated several times on MNIST, that when we train against weak adversarial examples, MNIST classifiers get more accurate."}, {"time": 643, "text": "So far that hasn't really held up on other data sets and hasn't held up when we train against stronger adversaries."}, {"time": 650, "text": "It seems like when you confront a really strong adversary, you tend to have to give something up."}, {"time": 659, "text": "But it's such a compelling idea because it feels like that's how us humans learn is through the difficult cases."}, {"time": 666, "text": "We try to think of what would we screw up and then we make sure we fix that."}, {"time": 671, "text": "It's also in a lot of branches of engineering, you do a worst case analysis and make sure that your system will work in the worst case."}, {"time": 678, "text": "And then that guarantees that it'll work in all of the messy average cases that happen when you go out into a really randomized world."}, {"time": 687, "text": "Yeah, with driving with autonomous vehicles, there seems to be a desire to just look for, think adversarially, try to figure out how to mess up the system."}, {"time": 696, "text": "And if you can be robust to all those difficult cases, then you can, it's a hand wavy empirical way to show your system is safe."}, {"time": 707, "text": "Today, most adversarial example research isn't really focused on a particular use case, but there are a lot of different use cases where you'd like to make sure that the adversary can't interfere with the operation of your system."}, {"time": 720, "text": "Like in finance, if you have an algorithm making trades for you, people go to a lot of an effort to obfuscate their algorithm."}, {"time": 726, "text": "That's both to protect their IP because you don't want to research and develop a profitable trading algorithm then have somebody else capture the gains."}, {"time": 736, "text": "But it's at least partly because you don't want people to make adversarial examples that fool your algorithm into making bad trades."}, {"time": 744, "text": "Or I guess one area that's been popular in the academic literature is speech recognition."}, {"time": 750, "text": "If you use speech recognition to hear an audio wave form and then turn that into a command that a phone executes for you, you don't want a malicious adversary to be able to produce audio that gets interpreted as malicious commands, especially if a human in the room doesn't realize that something like that is happening."}, {"time": 770, "text": "And speech recognition, has there been much success in being able to create adversarial examples that fool the system?"}, {"time": 779, "text": "Yeah, actually."}, {"time": 780, "text": "I guess the first work that I'm aware of is a paper called Hidden Voice Commands that came out in 2016, I believe."}, {"time": 788, "text": "And they were able to show that they could make sounds that are not understandable by a human but are recognized as the target phrase that the attacker wants the phone to recognize it as."}, {"time": 801, "text": "Since then, things have gotten a little bit better on the attacker's side when worse on the defender's side."}, {"time": 808, "text": "It's become possible to make sounds that sound like normal speech but are actually interpreted as a different sentence than the human hears."}, {"time": 820, "text": "The level of perceptibility of the adversarial perturbation is still kind of high."}, {"time": 826, "text": "When you listen to the recording, it sounds like there's some noise in the background, just like rustling sounds."}, {"time": 832, "text": "But those rustling sounds are actually the adversarial perturbation that makes the phone hear a completely different sentence."}, {"time": 838, "text": "Yeah, that's so fascinating."}, {"time": 840, "text": "Peter Norvig mentioned that you're writing the deep learning chapter for the fourth edition of the Artificial Intelligence, A Modern Approach book."}, {"time": 847, "text": "So how do you even begin summarizing the field of deep learning in a chapter?"}, {"time": 853, "text": "Well, in my case, I waited like a year before I actually wrote anything."}, {"time": 859, "text": "Even having written a full length textbook before, it's still pretty intimidating to try to start writing just one chapter that covers everything."}, {"time": 871, "text": "One thing that helped me make that plan was actually the experience of having written the full book before and then watching how the field changed after the book came out."}, {"time": 881, "text": "I've realized there's a lot of topics that were maybe extraneous in the first book and just seeing what stood the test of a few years of being published and what seems a little bit less important to have included now helped me pare down the topics I wanted to cover for the book."}, {"time": 896, "text": "It's also really nice now that the field is kind of stabilized to the point where some core ideas from the 1980s are still used today."}, {"time": 904, "text": "When I first started studying machine learning, almost everything from the 1980s had been rejected and now some of it has come back."}, {"time": 911, "text": "So that stuff that's really stood the test of time is what I focused on putting into the book."}, {"time": 916, "text": "There's also, I guess, two different philosophies about how you might write a book."}, {"time": 923, "text": "One philosophy is you try to write a reference that covers everything."}, {"time": 926, "text": "The other philosophy is you try to provide a high level summary that gives people the language to understand a field and tells them what the most important concepts are."}, {"time": 935, "text": "The first deep learning book that I wrote with Joshua and Aaron was somewhere between the two philosophies, that it's trying to be both a reference and an introductory guide."}, {"time": 945, "text": "Writing this chapter for Russell Norvig's book, I was able to focus more on just a concise introduction of the key concepts and the language you need to read about them more."}, {"time": 955, "text": "In a lot of cases, I actually just wrote paragraphs that said, here's a rapidly evolving area that you should pay attention to."}, {"time": 962, "text": "It's pointless to try to tell you what the latest and best version of a learn to learn model is."}, {"time": 971, "text": "I can point you to a paper that's recent right now, but there isn't a whole lot of a reason to delve into exactly what's going on with the latest learning to learn approach or the latest module produced by a learning to learn algorithm."}, {"time": 985, "text": "You should know that learning to learn is a thing and that it may very well be the source of the latest and greatest convolutional net or recurrent net module that you would want to use in your latest project."}, {"time": 996, "text": "But there isn't a lot of point in trying to summarize exactly which architecture and which learning approach got to which level of performance."}, {"time": 1004, "text": "So you maybe focus more on the basics of the methodology."}, {"time": 1009, "text": "So from back propagation to feed forward to recurrent neural networks, convolutional, that kind of thing?"}, {"time": 1016, "text": "So if I were to ask you, I remember I took algorithms and data structures algorithms course."}, {"time": 1023, "text": "I remember the professor asked, what is an algorithm?"}, {"time": 1029, "text": "And yelled at everybody in a good way that nobody was answering it correctly."}, {"time": 1034, "text": "Everybody knew what the algorithm, it was graduate course."}, {"time": 1036, "text": "Everybody knew what an algorithm was, but they weren't able to answer it well."}, {"time": 1039, "text": "So let me ask you in that same spirit, what is deep learning?"}, {"time": 1044, "text": "I would say deep learning is any kind of machine learning that involves learning parameters of more than one consecutive step."}, {"time": 1057, "text": "So that, I mean, shallow learning is things where you learn a lot of operations that happen in parallel."}, {"time": 1063, "text": "You might have a system that makes multiple steps."}, {"time": 1066, "text": "Like you might have hand designed feature extractors, but really only one step is learned."}, {"time": 1072, "text": "Deep learning is anything where you have multiple operations in sequence, and that includes the things that are really popular today, like convolutional networks and recurrent networks."}, {"time": 1083, "text": "But it also includes some of the things that have died out like Bolton machines, where we weren't using back propagation."}, {"time": 1091, "text": "Today, I hear a lot of people define deep learning as gradient descent applied to these differentiable functions."}, {"time": 1101, "text": "And I think that's a legitimate usage of the term."}, {"time": 1104, "text": "It's just different from the way that I use the term myself."}, {"time": 1107, "text": "So what's an example of deep learning that is not gradient descent and differentiable functions?"}, {"time": 1114, "text": "In your, I mean, not specifically perhaps, but more even looking into the future, what's your thought about that space of approaches?"}, {"time": 1124, "text": "Yeah, so I tend to think of machine learning algorithms as decomposed into really three different pieces."}, {"time": 1130, "text": "There's the model, which can be something like a neural net or a Bolton machine or a recurrent model."}, {"time": 1136, "text": "And that basically just describes how do you take data and how do you take parameters?"}, {"time": 1141, "text": "And what function do you use to make a prediction given the data and the parameters?"}, {"time": 1147, "text": "Another piece of the learning algorithm is the optimization algorithm."}, {"time": 1152, "text": "Or not every algorithm can be really described in terms of optimization, but what's the algorithm for updating the parameters or updating whatever the state of the network is?"}, {"time": 1162, "text": "And then the last part is the data set, like how do you actually represent the world as it comes into your machine learning system?"}, {"time": 1173, "text": "So I think of deep learning as telling us something about what does the model look like?"}, {"time": 1179, "text": "And basically to qualify as deep, I say that it just has to have multiple layers."}, {"time": 1184, "text": "That can be multiple steps in a feed forward differentiable computation."}, {"time": 1189, "text": "That can be multiple layers in a graphical model."}, {"time": 1192, "text": "There's a lot of ways that you could satisfy me that something has multiple steps that are each parameterized separately."}, {"time": 1198, "text": "I think of gradient descent as being all about that other piece, the how do you actually update the parameters piece?"}, {"time": 1204, "text": "So you could imagine having a deep model like a convolutional net and training it with something like evolution or a genetic algorithm."}, {"time": 1211, "text": "And I would say that still qualifies as deep learning."}, {"time": 1214, "text": "And then in terms of models that aren't necessarily differentiable, I guess Bolton machines are probably the main example of something where you can't really take a derivative and use that for the learning process."}, {"time": 1227, "text": "But you can still argue that the model has many steps of processing that it applies when you run inference in the model."}, {"time": 1235, "text": "So it's the steps of processing that's key."}, {"time": 1238, "text": "So Jeff Hinton suggests that we need to throw away back propagation and start all over."}, {"time": 1244, "text": "What do you think about that?"}, {"time": 1246, "text": "What could an alternative direction of training neural networks look like?"}, {"time": 1250, "text": "I don't know that back propagation is gonna go away entirely."}, {"time": 1254, "text": "Most of the time when we decide that a machine learning algorithm isn't on the critical path to research for improving AI, the algorithm doesn't die."}, {"time": 1264, "text": "It just becomes used for some specialized set of things."}, {"time": 1268, "text": "A lot of algorithms like logistic regression don't seem that exciting to AI researchers who are working on things like speech recognition or autonomous cars today."}, {"time": 1278, "text": "But there's still a lot of use for logistic regression and things like analyzing really noisy data in medicine and finance or making really rapid predictions in really time limited contexts."}, {"time": 1290, "text": "So I think back propagation and gradient descent are around to stay, but they may not end up being everything that we need to get to real human level or super human AI."}, {"time": 1302, "text": "Are you optimistic about us discovering back propagation has been around for a few decades?"}, {"time": 1310, "text": "So are you optimistic about us as a community being able to discover something better?"}, {"time": 1316, "text": "Yeah, I am."}, {"time": 1317, "text": "I think we likely will find something that works better."}, {"time": 1321, "text": "You could imagine things like having stacks of models where some of the lower level models predict parameters of the higher level models."}, {"time": 1330, "text": "And so at the top level, you're not learning in terms of literally calculating gradients, but just predicting how different values will perform."}, {"time": 1337, "text": "You can kind of see that already in some areas like Bayesian optimization, where you have a Gaussian process that predicts how well different parameter values will perform."}, {"time": 1345, "text": "We already use those kinds of algorithms for things like hyper parameter optimization."}, {"time": 1350, "text": "And in general, we know a lot of things other than back prop that work really well for specific problems."}, {"time": 1354, "text": "The main thing we haven't found is a way of taking one of these other non back prop based algorithms and having it really advanced the state of the art on an AI level problem."}, {"time": 1367, "text": "But I wouldn't be surprised if eventually we find that some of these algorithms that even the ones that already exist, not even necessarily new one, we might find some way of customizing one of these algorithms to do something really interesting at the level of cognition or the level of, I think one system that we really don't have working quite right yet is like short term memory."}, {"time": 1392, "text": "We have things like LSTMs, they're called long short term memory."}, {"time": 1396, "text": "They still don't do quite what a human does with short term memory."}, {"time": 1402, "text": "Like gradient descent to learn a specific fact has to do multiple steps on that fact."}, {"time": 1409, "text": "Like if I tell you the meeting today is at 3 p.m., I don't need to say over and over again, it's at 3 p.m., it's at 3 p.m., it's at 3 p.m., it's at 3 p.m. for you to do a gradient step on each one."}, {"time": 1420, "text": "You just hear it once and you remember it."}, {"time": 1423, "text": "There's been some work on things like self attention and attention like mechanisms, like the neural Turing machine that can write to memory cells and update themselves with facts like that right away."}, {"time": 1434, "text": "But I don't think we've really nailed it yet."}, {"time": 1436, "text": "And that's one area where I'd imagine that new optimization algorithms or different ways of applying existing optimization algorithms could give us a way of just lightning fast updating the state of a machine learning system to contain a specific fact like that without needing to have it presented over and over and over again."}, {"time": 1456, "text": "So some of the success of symbolic systems in the 80s is they were able to assemble these kinds of facts better."}, {"time": 1466, "text": "But there's a lot of expert input required and it's very limited in that sense."}, {"time": 1471, "text": "Do you ever look back to that as something that we'll have to return to eventually?"}, {"time": 1476, "text": "Sort of dust off the book from the shelf and think about how we build knowledge, representation, knowledge base."}, {"time": 1482, "text": "Like will we have to use graph searches?"}, {"time": 1484, "text": "Graph searches, right."}, {"time": 1485, "text": "And like first order logic and entailment and things like that."}, {"time": 1488, "text": "That kind of thing, yeah, exactly."}, {"time": 1489, "text": "In my particular line of work, which has mostly been machine learning security and also generative modeling, I haven't usually found myself moving in that direction."}, {"time": 1500, "text": "For generative models, I could see a little bit of, it could be useful if you had something like a differentiable knowledge base or some other kind of knowledge base where it's possible for some of our fuzzier machine learning algorithms to interact with a knowledge base."}, {"time": 1516, "text": "I mean, your network is kind of like that."}, {"time": 1519, "text": "It's a differentiable knowledge base of sorts."}, {"time": 1523, "text": "If we had a really easy way of giving feedback to machine learning models, that would clearly help a lot with generative models."}, {"time": 1532, "text": "And so you could imagine one way of getting there would be get a lot better at natural language processing."}, {"time": 1536, "text": "But another way of getting there would be take some kind of knowledge base and figure out a way for it to actually interact with a neural network."}, {"time": 1544, "text": "Being able to have a chat with a neural network."}, {"time": 1547, "text": "So like one thing in generative models we see a lot today is you'll get things like faces that are not symmetrical, like people that have two eyes that are different colors."}, {"time": 1558, "text": "I mean, there are people with eyes that are different colors in real life, but not nearly as many of them as you tend to see in the machine learning generated data."}, {"time": 1566, "text": "So if you had either a knowledge base that could contain the fact, people's faces are generally approximately symmetric and eye color is especially likely to be the same on both sides."}, {"time": 1577, "text": "Being able to just inject that hint into the machine learning model without it having to discover that itself after studying a lot of data would be a really useful feature."}, {"time": 1588, "text": "I could see a lot of ways of getting there without bringing back some of the 1980s technology, but I also see some ways that you could imagine extending the 1980s technology to play nice with neural nets and have it help get there."}, {"time": 1600, "text": "So you talked about the story of you coming up with the idea of GANs at a bar with some friends."}, {"time": 1607, "text": "You were arguing that this, you know, GANs would work, generative adversarial networks, and the others didn't think so."}, {"time": 1614, "text": "Then you went home at midnight, coded it up, and it worked."}, {"time": 1618, "text": "So if I was a friend of yours at the bar, I would also have doubts."}, {"time": 1622, "text": "It's a really nice idea, but I'm very skeptical that it would work."}, {"time": 1626, "text": "What was the basis of their skepticism?"}, {"time": 1629, "text": "What was the basis of your intuition why it should work?"}, {"time": 1634, "text": "I don't want to be someone who goes around promoting alcohol for the purposes of science, but in this case, I do actually think that drinking helped a little bit."}, {"time": 1643, "text": "When your inhibitions are lowered, you're more willing to try out things that you wouldn't try out otherwise."}, {"time": 1649, "text": "So I have noticed in general that I'm less prone to shooting down some of my own ideas when I have had a little bit to drink."}, {"time": 1657, "text": "I think if I had had that idea at lunchtime, I probably would have thought, it's hard enough to train one neural net, you can't train a second neural net in the inner loop of the outer neural net."}, {"time": 1668, "text": "That was basically my friend's objection, was that trying to train two neural nets at the same time would be too hard."}, {"time": 1674, "text": "So it was more about the training process, unless, so my skepticism would be, you know, I'm sure you could train it, but the thing it would converge to would not be able to generate anything reasonable, any kind of reasonable realism."}, {"time": 1688, "text": "Yeah, so part of what all of us were thinking about when we had this conversation was deep Bolton machines, which a lot of us in the lab, including me, were a big fan of deep Bolton machines at the time."}, {"time": 1700, "text": "They involved two separate processes running at the same time."}, {"time": 1705, "text": "One of them is called the positive phase, where you load data into the model and tell the model to make the data more likely."}, {"time": 1713, "text": "The other one is called the negative phase, where you draw samples from the model and tell the model to make those samples less likely."}, {"time": 1721, "text": "In a deep Bolton machine, it's not trivial to generate a sample."}, {"time": 1723, "text": "You have to actually run an iterative process that gets better and better samples coming closer and closer to the distribution the model represents."}, {"time": 1732, "text": "So during the training process, you're always running these two systems at the same time, one that's updating the parameters of the model and another one that's trying to generate samples from the model."}, {"time": 1741, "text": "And they worked really well in things like MNIST, but a lot of us in the lab, including me, had tried to get deep Bolton machines to scale past MNIST to things like generating color photos, and we just couldn't get the two processes to stay synchronized."}, {"time": 1757, "text": "So when I had the idea for GANs, a lot of people thought that the discriminator would have more or less the same problem as the negative phase in the Bolton machine, that trying to train the discriminator in the inner loop, you just couldn't get it to keep up with the generator in the outer loop, and that would prevent it from converging to anything useful."}, {"time": 1775, "text": "Yeah, I share that intuition."}, {"time": 1779, "text": "But turns out to not be the case."}, {"time": 1781, "text": "A lot of the time with machine learning algorithms, it's really hard to predict ahead of time how well they'll actually perform."}, {"time": 1786, "text": "You have to just run the experiment and see what happens."}, {"time": 1789, "text": "And I would say I still today don't have like one factor I can put my finger on and say, this is why GANs worked for photo generation and deep Bolton machines don't."}, {"time": 1801, "text": "There are a lot of theory papers showing that under some theoretical settings, the GAN algorithm does actually converge, but those settings are restricted enough that they don't necessarily explain the whole picture in terms of all the results that we see in practice."}, {"time": 1820, "text": "So taking a step back, can you, in the same way as we talked about deep learning, can you tell me what generative adversarial networks are?"}, {"time": 1829, "text": "Yeah, so generative adversarial networks are a particular kind of generative model."}, {"time": 1833, "text": "A generative model is a machine learning model that can train on some set of data."}, {"time": 1838, "text": "Like, so you have a collection of photos of cats and you want to generate more photos of cats, or you want to estimate a probability distribution over cats."}, {"time": 1847, "text": "So you can ask how likely it is that some new image is a photo of a cat."}, {"time": 1852, "text": "GANs are one way of doing this."}, {"time": 1855, "text": "Some generative models are good at creating new data."}, {"time": 1859, "text": "Other generative models are good at estimating that density function and telling you how likely particular pieces of data are to come from the same distribution as the training data."}, {"time": 1869, "text": "GANs are more focused on generating samples rather than estimating the density function."}, {"time": 1875, "text": "There are some kinds of GANs like FlowGAN that can do both, but mostly GANs are about generating samples, generating new photos of cats that look realistic."}, {"time": 1884, "text": "And they do that completely from scratch."}, {"time": 1889, "text": "It's analogous to human imagination."}, {"time": 1892, "text": "When a GAN creates a new image of a cat, it's using a neural network to produce a cat that has not existed before."}, {"time": 1901, "text": "It isn't doing something like compositing photos together."}, {"time": 1904, "text": "You're not literally taking the eye off of one cat and the ear off of another cat."}, {"time": 1908, "text": "It's more of this digestive process where the neural net trains in a lot of data and comes up with some representation of the probability distribution and generates entirely new cats."}, {"time": 1919, "text": "There are a lot of different ways of building a generative model."}, {"time": 1921, "text": "What's specific to GANs is that we have a two player game in the game theoretic sense."}, {"time": 1928, "text": "And as the players in this game compete, one of them becomes able to generate realistic data."}, {"time": 1933, "text": "The first player is called the generator."}, {"time": 1936, "text": "It produces output data such as just images, for example."}, {"time": 1940, "text": "And at the start of the learning process, it'll just produce completely random images."}, {"time": 1945, "text": "The other player is called the discriminator."}, {"time": 1947, "text": "The discriminator takes images as input and guesses whether they're real or fake."}, {"time": 1952, "text": "You train it both on real data, so photos that come from your training set, actual photos of cats, and you train it to say that those are real."}, {"time": 1959, "text": "You also train it on images that come from the generator network and you train it to say that those are fake."}, {"time": 1966, "text": "As the two players compete in this game, the discriminator tries to become better at recognizing whether images are real or fake."}, {"time": 1973, "text": "And the generator becomes better at fooling the discriminator into thinking that its outputs are real."}, {"time": 1980, "text": "And you can analyze this through the language of game theory and find that there's a Nash equilibrium where the generator has captured the correct probability distribution."}, {"time": 1990, "text": "So in the cat example, it makes perfectly realistic cat photos."}, {"time": 1994, "text": "And the discriminator is unable to do better than random guessing because all the samples coming from both the data and the generator look equally likely to have come from either source."}, {"time": 2005, "text": "So do you ever sit back and does it just blow your mind that this thing works?"}, {"time": 2011, "text": "So from very, so it's able to estimate that density function enough to generate realistic images."}, {"time": 2018, "text": "I mean, does it, yeah."}, {"time": 2020, "text": "Do you ever sit back and think how does this even, why, this is quite incredible, especially where GANs have gone in terms of realism."}, {"time": 2029, "text": "Yeah, and not just to flatter my own work, but generative models, all of them have this property that if they really did what we ask them to do, they would do nothing but memorize the training data."}, {"time": 2042, "text": "Models that are based on maximizing the likelihood, the way that you obtain the maximum likelihood for a specific training set is you assign all of your probability mass to the training examples and nowhere else."}, {"time": 2055, "text": "For GANs, the game is played using a training set."}, {"time": 2058, "text": "So the way that you become unbeatable in the game is you literally memorize training examples."}, {"time": 2065, "text": "One of my former interns wrote a paper, his name is Vaishnav Nagarajan, and he showed that it's actually hard for the generator to memorize the training data, hard in a statistical learning theory sense, that you can actually create reasons for why it would require quite a lot of learning steps and a lot of observations of different latent variables before you could memorize the training data."}, {"time": 2094, "text": "That still doesn't really explain why when you produce samples that are new, why do you get compelling images rather than just garbage that's different from the training set."}, {"time": 2103, "text": "And I don't think we really have a good answer for that, especially if you think about how many possible images are out there and how few images the generative model sees during training."}, {"time": 2115, "text": "It seems just unreasonable that generative models create new images as well as they do, especially considering that we're basically training them to memorize rather than generalize."}, {"time": 2126, "text": "I think part of the answer is there's a paper called Deep Image Prior where they show that you can take a convolutional net and you don't even need to learn the parameters of it at all, you just use the model architecture."}, {"time": 2136, "text": "And it's already useful for things like inpainting images."}, {"time": 2140, "text": "I think that shows us that the convolutional network architecture captures something really important about the structure of images."}, {"time": 2147, "text": "And we don't need to actually use the learning to capture all the information coming out of the convolutional net."}, {"time": 2154, "text": "That would imply that it would be much harder to make generative models in other domains."}, {"time": 2160, "text": "So far, we're able to make reasonable speech models and things like that."}, {"time": 2164, "text": "But to be honest, we haven't actually explored a whole lot of different data sets all that much."}, {"time": 2169, "text": "We don't, for example, see a lot of deep learning models of like biology data sets where you have lots of microarrays measuring the amount of different enzymes and things like that."}, {"time": 2182, "text": "So we may find that some of the progress that we've seen for images and speech turns out to really rely heavily on the model architecture."}, {"time": 2189, "text": "And we were able to do what we did for vision by trying to reverse engineer the human visual system."}, {"time": 2195, "text": "And maybe it'll turn out that we can't just use that same trick for arbitrary kinds of data."}, {"time": 2202, "text": "Right, so there's aspect to the human vision system, the hardware of it, that makes it without learning, without cognition, just makes it really effective at detecting the patterns we see in the visual world."}, {"time": 2215, "text": "Yeah, that's really interesting."}, {"time": 2217, "text": "What, in a big, quick overview, in your view, what types of GANs are there and what other generative models besides GANs are there?"}, {"time": 2229, "text": "Yeah, so it's maybe a little bit easier to start with what kinds of generative models are there other than GANs."}, {"time": 2236, "text": "So most generative models are likelihood based where to train them, you have a model that tells you how much probability it assigns to a particular example and you just maximize the probability assigned to all the training examples."}, {"time": 2253, "text": "It turns out that it's hard to design a model that can create really complicated images or really complicated audio waveforms and still have it be possible to estimate the likelihood function from a computational point of view."}, {"time": 2271, "text": "Most interesting models that you would just write down intuitively, it turns out that it's almost impossible to calculate the amount of probability they assign to a particular point."}, {"time": 2281, "text": "So there's a few different schools of generative models in the likelihood family."}, {"time": 2287, "text": "One approach is to very carefully design the model so that it is computationally tractable to measure the density it assigns to a particular point."}, {"time": 2295, "text": "So there are things like autoregressive models, like PixelCNN, those basically break down the probability distribution into a product over every single feature."}, {"time": 2308, "text": "So for an image, you estimate the probability of each pixel given all of the pixels that came before it."}, {"time": 2315, "text": "There's tricks where if you want to measure the density function, you can actually calculate the density for all these pixels more or less in parallel."}, {"time": 2324, "text": "Generating the image still tends to require you to go one pixel at a time, and that can be very slow."}, {"time": 2330, "text": "But there are, again, tricks for doing this in a hierarchical pattern where you can keep the runtime under control."}, {"time": 2335, "text": "Are the quality of the images it generates, putting runtime aside, pretty good?"}, {"time": 2342, "text": "They're reasonable, yeah."}, {"time": 2344, "text": "I would say a lot of the best results are from GANs these days, but it can be hard to tell how much of that is based on who's studying which type of algorithm, if that makes sense."}, {"time": 2357, "text": "The amount of effort invested in a particular."}, {"time": 2358, "text": "Yeah, or like the kind of expertise."}, {"time": 2361, "text": "So a lot of people who've traditionally been excited about graphics or art and things like that have gotten interested in GANs."}, {"time": 2367, "text": "And to some extent, it's hard to tell are GANs doing better because they have a lot of graphics and art experts behind them, or are GANs doing better because they're more computationally efficient, or are GANs doing better because they prioritize the realism of samples over the accuracy of the density function."}, {"time": 2385, "text": "I think all of those are potentially valid explanations, and it's hard to tell."}, {"time": 2391, "text": "So can you give a brief history of GANs from 2014?"}, {"time": 2397, "text": "Were you paper 13?"}, {"time": 2399, "text": "Yeah, so a few highlights."}, {"time": 2400, "text": "In the first paper, we just showed that GANs basically work."}, {"time": 2404, "text": "If you look back at the samples we had now, they look terrible."}, {"time": 2408, "text": "On the CIFAR 10 data set, you can't even recognize objects in them."}, {"time": 2412, "text": "Your paper, sorry, you used CIFAR 10?"}, {"time": 2415, "text": "We used MNIST, which is little handwritten digits."}, {"time": 2418, "text": "We used the Toronto Face database, which is small grayscale photos of faces."}, {"time": 2422, "text": "We did have recognizable faces."}, {"time": 2424, "text": "My colleague Bing Xu put together the first GAN face model for that paper."}, {"time": 2429, "text": "We also had the CIFAR 10 data set, which is things like very small 32 by 32 pixels of cars and cats and dogs."}, {"time": 2440, "text": "For that, we didn't get recognizable objects, but all the deep learning people back then were really used to looking at these failed samples and kind of reading them like tea leaves."}, {"time": 2450, "text": "And people who are used to reading the tea leaves recognize that our tea leaves at least look different."}, {"time": 2456, "text": "Maybe not necessarily better, but there was something unusual about them."}, {"time": 2461, "text": "And that got a lot of us excited."}, {"time": 2463, "text": "One of the next really big steps was LAPGAN by Emily Denton and Sumit Chintala at Facebook AI Research, where they actually got really good high resolution photos working with GANs for the first time."}, {"time": 2476, "text": "They had a complicated system where they generated the image starting at low res and then scaling up to high res, but they were able to get it to work."}, {"time": 2484, "text": "And then in 2015, I believe later that same year, Alec Radford and Sumit Chintala and Luke Metz published the DCGAN paper, which it stands for deep convolutional GAN."}, {"time": 2501, "text": "It's kind of a non unique name because these days basically all GANs and even some before that were deep and convolutional, but they just kind of picked a name for a really great recipe where they were able to actually using only one model instead of a multi step process, actually generate realistic images of faces and things like that."}, {"time": 2521, "text": "That was sort of like the beginning of the Cambrian explosion of GANs."}, {"time": 2527, "text": "Like once you had animals that had a backbone, you suddenly got lots of different versions of fish and four legged animals and things like that."}, {"time": 2535, "text": "So DCGAN became kind of the backbone for many different models that came out."}, {"time": 2539, "text": "It's used as a baseline even still."}, {"time": 2543, "text": "And so from there, I would say some interesting things we've seen are there's a lot you can say about how just the quality of standard image generation GANs has increased, but what's also maybe more interesting on an intellectual level is how the things you can use GANs for has also changed."}, {"time": 2561, "text": "One thing is that you can use them to learn classifiers without having to have class labels for every example in your training set."}, {"time": 2568, "text": "So that's called semi supervised learning."}, {"time": 2571, "text": "My colleague at OpenAI, Tim Solomons, who's at Brain now, wrote a paper called Improve Techniques for Training GANs."}, {"time": 2579, "text": "I'm a coauthor on this paper, but I can't claim any credit for this particular part."}, {"time": 2583, "text": "One thing he showed in the paper is that you can take the GAN discriminator and use it as a classifier that actually tells you, this image is a cat, this image is a dog, this image is a car, this image is a truck, and so on."}, {"time": 2596, "text": "Not just to say whether the image is real or fake, but if it is real to say specifically what kind of object it is."}, {"time": 2602, "text": "And he found that you can train these classifiers with far fewer labeled examples than traditional classifiers."}, {"time": 2610, "text": "So if you supervise based on also not just your discrimination ability, but your ability to classify, you're going to do much, you're going to converge much faster to being effective at being a discriminator."}, {"time": 2624, "text": "So for example, for the MNIST dataset, you want to look at an image of a handwritten digit and say whether it's a zero, a one, or a two, and so on."}, {"time": 2634, "text": "To get down to less than 1% accuracy required around 60,000 examples until maybe about 2014 or so."}, {"time": 2642, "text": "In 2016 with this semi supervised GAN project, Tim was able to get below 1% error using only 100 labeled examples."}, {"time": 2653, "text": "So that was about a 600X decrease in the amount of labels that he needed."}, {"time": 2657, "text": "He's still using more images than that, but he doesn't need to have each of them labeled as this one's a one, this one's a two, this one's a zero, and so on."}, {"time": 2667, "text": "Then to be able to, for GANs to be able to generate recognizable objects, so objects from a particular class, you still need labeled data because you need to know what it means to be a particular class cat, dog."}, {"time": 2681, "text": "How do you think we can move away from that?"}, {"time": 2684, "text": "Yeah, some researchers at Brain Zurich actually just released a really great paper on semi supervised GANs where their goal isn't to classify, it's to make recognizable objects despite not having a lot of labeled data."}, {"time": 2698, "text": "They were working off of DeepMind's BigGAN project and they showed that they can match the performance of BigGAN using only 10%, I believe, of the labels."}, {"time": 2710, "text": "BigGAN was trained on the ImageNet data set, which is about 1.2 million images and had all of them labeled."}, {"time": 2717, "text": "This latest project from Brain Zurich shows that they're able to get away with only having about 10% of the images labeled."}, {"time": 2753, "text": "If you train a GAN with no class labels, you tend to get things that look sort of like grass or water or brick or dirt, but without necessarily a lot going on in them."}, {"time": 2764, "text": "And I think that's partly because if you look at a large ImageNet image, the object doesn't necessarily occupy the whole image."}, {"time": 2771, "text": "And so you learn to create realistic sets of pixels, but you don't necessarily learn that the object is the star of the show and you want it to be in every image you make."}, {"time": 2782, "text": "Yeah, I've heard you talk about the horse, the zebra cycle GAN mapping and how it turns out, again, thought provoking that horses are usually on grass and zebras are usually on drier terrain."}, {"time": 2795, "text": "So when you're doing that kind of generation, you're going to end up generating greener horses or whatever, so those are connected together."}, {"time": 2805, "text": "It's not just, you're not able to segment, be able to generate in a segment away."}, {"time": 2812, "text": "So are there other types of games you come across in your mind that neural networks can play with each other to be able to solve problems?"}, {"time": 2824, "text": "Yeah, the one that I spend most of my time on is in security."}, {"time": 2829, "text": "You can model most interactions as a game where there's attackers trying to break your system and you're the defender trying to build a resilient system."}, {"time": 2840, "text": "There's also domain adversarial learning, which is an approach to domain adaptation that looks really a lot like GANs."}, {"time": 2848, "text": "The authors had the idea before the GAN paper came out, their paper came out a little bit later and they're very nice and cited the GAN paper, but I know that they actually had the idea before it came out."}, {"time": 2862, "text": "Domain adaptation is when you want to train a machine learning model in one setting called a domain and then deploy it in another domain later."}, {"time": 2870, "text": "And you would like it to perform well in the new domain, even though the new domain is different from how it was trained."}, {"time": 2875, "text": "So for example, you might want to train on a really clean image data set like ImageNet, but then deploy on users phones where the user is taking pictures in the dark and pictures while moving quickly and just pictures that aren't really centered or composed all that well."}, {"time": 2893, "text": "When you take a normal machine learning model, it often degrades really badly when you move to the new domain because it looks so different from what the model was trained on."}, {"time": 2902, "text": "Domain adaptation algorithms try to smooth out that gap and the domain adversarial approach is based on training a feature extractor where the features have the same statistics regardless of which domain you extracted them on."}, {"time": 2915, "text": "So in the domain adversarial game, you have one player that's a feature extractor and another player that's a domain recognizer."}, {"time": 2922, "text": "The domain recognizer wants to look at the output of the feature extractor and guess which of the two domains the features came from."}, {"time": 2929, "text": "So it's a lot like the real versus fake discriminator in GANs and then the feature extractor, you can think of as loosely analogous to the generator in GANs, except what it's trying to do here is both fool the domain recognizer into not knowing which domain the data came from and also extract features that are good for classification."}, {"time": 2949, "text": "So at the end of the day, in the cases where it works out, you can actually get features that work about the same in both domains."}, {"time": 2960, "text": "Sometimes this has a drawback where in order to make things work the same in both domains, it just gets worse at the first one."}, {"time": 2966, "text": "But there are a lot of cases where it actually works out well on both."}, {"time": 2970, "text": "So do you think of GANs being useful in the context of data augmentation?"}, {"time": 2975, "text": "Yeah, one thing you could hope for with GANs is you could imagine I've got a limited training set and I'd like to make more training data to train something else like a classifier."}, {"time": 2987, "text": "You could train the GAN on the training set and then create more data and then maybe the classifier would perform better on the test set after training on this bigger GAN generated data set."}, {"time": 2998, "text": "So that's the simplest version of something you might hope would work."}, {"time": 3003, "text": "I've never heard of that particular approach working, but I think there's some closely related things that I think could work in the future and some that actually already have worked."}, {"time": 3014, "text": "So if we think a little bit about what we'd be hoping for if we use the GAN to make more training data, we're hoping that the GAN will generalize to new examples better than the classifier would have generalized if it was trained on the same data."}, {"time": 3025, "text": "And I don't know of any reason to believe that the GAN would generalize better than the classifier would, but what we might hope for is that the GAN could generalize differently from a specific classifier."}, {"time": 3037, "text": "So one thing I think is worth trying that I haven't personally tried but someone could try is what if you trained a whole lot of different generative models on the same training set, create samples from all of them and then train a classifier on that?"}, {"time": 3050, "text": "Because each of the generative models might generalize in a slightly different way."}, {"time": 3054, "text": "They might capture many different axes of variation that one individual model wouldn't and then the classifier can capture all of those ideas by training in all of their data."}, {"time": 3063, "text": "So it'd be a little bit like making an ensemble of classifiers."}, {"time": 3066, "text": "And I think that... Ensemble of GANs in a way."}, {"time": 3068, "text": "I think that could generalize better."}, {"time": 3070, "text": "The other thing that GANs are really good for is not necessarily generating new data that's exactly like what you already have, but by generating new data that has different properties from the data you already had."}, {"time": 3085, "text": "One thing that you can do is you can create differentially private data."}, {"time": 3089, "text": "So suppose that you have something like medical records and you don't want to train a classifier on the medical records and then publish the classifier because someone might be able to reverse engineer some of the medical records you trained on."}, {"time": 3100, "text": "There's a paper from Casey Green's lab that shows how you can train a GAN using differential privacy."}, {"time": 3107, "text": "And then the samples from the GAN still have the same differential privacy guarantees as the parameters of the GAN."}, {"time": 3112, "text": "So you can make fake patient data for other researchers to use."}, {"time": 3117, "text": "And they can do almost anything they want with that data because it doesn't come from real people."}, {"time": 3122, "text": "And the differential privacy mechanism gives you clear guarantees on how much the original people's data has been protected."}, {"time": 3129, "text": "That's really interesting, actually."}, {"time": 3131, "text": "I haven't heard you talk about that before."}, {"time": 3133, "text": "In terms of fairness, I've seen from AAAI, your talk, how can adversarial machine learning help models be more fair with respect to sensitive variables?"}, {"time": 3145, "text": "Yeah, so there's a paper from Amos Starkey's lab about how to learn machine learning models that are incapable of using specific variables."}, {"time": 3154, "text": "So say, for example, you wanted to make predictions that are not affected by gender."}, {"time": 3159, "text": "It isn't enough to just leave gender out of the input to the model."}, {"time": 3162, "text": "You can often infer gender from a lot of other characteristics."}, {"time": 3165, "text": "Like say that you have the person's name, but you're not told their gender."}, {"time": 3168, "text": "Well, if their name is Ian, they're kind of obviously a man."}, {"time": 3173, "text": "So what you'd like to do is make a machine learning model that can still take in a lot of different attributes and make a really accurate informed prediction, but be confident that it isn't reverse engineering gender or another sensitive variable internally."}, {"time": 3188, "text": "You can do that using something very similar to the domain adversarial approach, where you have one player that's a feature extractor and another player that's a feature analyzer."}, {"time": 3199, "text": "And you want to make sure that the feature analyzer is not able to guess the value of the sensitive variable that you're trying to keep private."}, {"time": 3206, "text": "Right, that's, yeah, I love this approach."}, {"time": 3209, "text": "So yeah, with the feature, you're not able to infer the sensitive variables."}, {"time": 3216, "text": "Brilliant, that's quite brilliant and simple actually."}, {"time": 3219, "text": "Another way I think that GANs in particular could be used for fairness would be to make something like a CycleGAN, where you can take data from one domain and convert it into another."}, {"time": 3231, "text": "We've seen CycleGAN turning horses into zebras."}, {"time": 3233, "text": "We've seen other unsupervised GANs made by Mingyu Liu doing things like turning day photos into night photos."}, {"time": 3243, "text": "I think for fairness, you could imagine taking records for people in one group and transforming them into analogous people in another group and testing to see if they're treated equitably across those two groups."}, {"time": 3256, "text": "There's a lot of things that'd be hard to get right to make sure that the conversion process itself is fair."}, {"time": 3261, "text": "And I don't think it's anywhere near something that we could actually use yet, but if you could design that conversion process very carefully, it might give you a way of doing audits where you say, what if we took people from this group, converted them into equivalent people in another group, does the system actually treat them how it ought to?"}, {"time": 3278, "text": "That's also really interesting."}, {"time": 3281, "text": "You know, in popular press and in general, in our imagination, you think, well, GANs are able to generate data and you start to think about deep fakes or being able to sort of maliciously generate data that fakes the identity of other people."}, {"time": 3301, "text": "Is this something of a concern to you?"}, {"time": 3303, "text": "Is this something, if you look 10, 20 years into the future, is that something that pops up in your work, in the work of the community that's working on generating models?"}, {"time": 3313, "text": "I'm a lot less concerned about 20 years from now than the next few years."}, {"time": 3317, "text": "I think there'll be a kind of bumpy cultural transition as people encounter this idea that there can be very realistic videos and audio that aren't real."}, {"time": 3326, "text": "I think 20 years from now, people will mostly understand that you shouldn't believe something is real just because you saw a video of it."}, {"time": 3334, "text": "People will expect to see that it's been cryptographically signed or have some other mechanism to make them believe that the content is real."}, {"time": 3344, "text": "There's already people working on this."}, {"time": 3345, "text": "Like there's a startup called Truepick that provides a lot of mechanisms for authenticating that an image is real."}, {"time": 3352, "text": "They're maybe not quite up to having a state actor try to evade their verification techniques, but it's something that people are already working on and I think we'll get right eventually."}, {"time": 3364, "text": "So you think authentication will eventually win out."}, {"time": 3368, "text": "So being able to authenticate that this is real and this is not."}, {"time": 3373, "text": "As opposed to GANs just getting better and better or generative models being able to get better and better to where the nature of what is real is normal."}, {"time": 3381, "text": "I don't think we'll ever be able to look at the pixels of a photo and tell you for sure that it's real or not real."}, {"time": 3388, "text": "And I think it would actually be somewhat dangerous to rely on that approach too much."}, {"time": 3395, "text": "If you make a really good fake detector and then someone's able to fool your fake detector and your fake detector says this image is not fake, then it's even more credible than if you've never made a fake detector in the first place."}, {"time": 3406, "text": "What I do think we'll get to is systems that we can kind of use behind the scenes to make estimates of what's going on and maybe not like use them in court for a definitive analysis."}, {"time": 3419, "text": "I also think we will likely get better authentication systems where, imagine that every phone cryptographically signs everything that comes out of it."}, {"time": 3430, "text": "You wouldn't be able to conclusively tell that an image was real, but you would be able to tell somebody who knew the appropriate private key for this phone was actually able to sign this image and upload it to this server at this timestamp."}, {"time": 3447, "text": "Okay, so you could imagine maybe you make phones that have the private keys hardware embedded in them."}, {"time": 3455, "text": "If like a state security agency really wants to infiltrate the company, they could probably plant a private key of their choice or break open the chip and learn the private key or something like that."}, {"time": 3466, "text": "But it would make it a lot harder for an adversary with fewer resources to fake things."}, {"time": 3471, "text": "For most of us it would be okay."}, {"time": 3473, "text": "So you mentioned the beer and the bar and the new ideas."}, {"time": 3478, "text": "You were able to implement this or come up with this new idea pretty quickly and implement it pretty quickly."}, {"time": 3484, "text": "Do you think there's still many such groundbreaking ideas in deep learning that could be developed so quickly?"}, {"time": 3490, "text": "Yeah, I do think that there are a lot of ideas that can be developed really quickly."}, {"time": 3495, "text": "GANs were probably a little bit of an outlier on the whole like one hour timescale."}, {"time": 3500, "text": "But just in terms of like low resource ideas where you do something really different on the algorithm scale and get a big payback."}, {"time": 3510, "text": "I think it's not as likely that you'll see that in terms of things like core machine learning technologies like a better classifier or a better reinforcement learning algorithm or a better generative model."}, {"time": 3521, "text": "If I had the GAN idea today, it would be a lot harder to prove that it was useful than it was back in 2014 because I would need to get it running on something like ImageNet or Celeb A at high resolution."}, {"time": 3534, "text": "You know, those take a while to train."}, {"time": 3535, "text": "You couldn't train it in an hour and know that it was something really new and exciting."}, {"time": 3541, "text": "Back in 2014, training on MNIST was enough."}, {"time": 3544, "text": "But there are other areas of machine learning where I think a new idea could actually be developed really quickly with low resources."}, {"time": 3553, "text": "What's your intuition about what areas of machine learning are ripe for this?"}, {"time": 3557, "text": "Yeah, so I think fairness and interpretability are areas where we just really don't have any idea how anything should be done yet."}, {"time": 3569, "text": "Like for interpretability, I don't think we even have the right definitions."}, {"time": 3572, "text": "And even just defining a really useful concept, you don't even need to run any experiments, could have a huge impact on the field."}, {"time": 3580, "text": "We've seen that, for example, in differential privacy that Cynthia Dwork and her collaborators made this technical definition of privacy where before a lot of things were really mushy."}, {"time": 3590, "text": "And then with that definition, you could actually design randomized algorithms for accessing databases and guarantee that they preserved individual people's privacy in like a mathematical quantitative sense."}, {"time": 3603, "text": "Right now, we all talk a lot about how interpretable different machine learning algorithms are, but it's really just people's opinion."}, {"time": 3609, "text": "And everybody probably has a different idea of what interpretability means in their head."}, {"time": 3613, "text": "If we could define some concept related to interpretability that's actually measurable, that would be a huge leap forward even without a new algorithm that increases that quantity."}, {"time": 3624, "text": "And also once we had the definition of differential privacy, it was fast to get the algorithms that guaranteed it."}, {"time": 3631, "text": "So you could imagine once we have definitions of good concepts and interpretability, we might be able to provide the algorithms that have the interpretability guarantees quickly too."}, {"time": 3640, "text": "So what do you think it takes to build a system with human level intelligence as we quickly venture into the philosophical?"}, {"time": 3651, "text": "So artificial general intelligence, what do you think it takes?"}, {"time": 3655, "text": "I think that it definitely takes better environments than we currently have for training agents that we want them to have a really wide diversity of experiences."}, {"time": 3668, "text": "I also think it's gonna take really a lot of computation."}, {"time": 3671, "text": "It's hard to imagine exactly how much."}, {"time": 3673, "text": "So you're optimistic about simulation, simulating a variety of environments as the path forward?"}, {"time": 3679, "text": "I think it's a necessary ingredient."}, {"time": 3681, "text": "Yeah, I don't think that we're going to get to artificial general intelligence by training on fixed data sets or by thinking really hard about the problem."}, {"time": 3692, "text": "I think that the agent really needs to interact and have a variety of experiences within the same lifespan."}, {"time": 3701, "text": "And today we have many different models that can each do one thing."}, {"time": 3705, "text": "And we tend to train them on one data set or one RL environment."}, {"time": 3710, "text": "Sometimes there are actually papers about getting one set of parameters to perform well in many different RL environments."}, {"time": 3716, "text": "But we don't really have anything like an agent that goes seamlessly from one type of experience to another and really integrates all the different things that it does over the course of its life."}, {"time": 3728, "text": "When we do see multi agent environments, they tend to be, or so many multi environment agents, they tend to be similar environments."}, {"time": 3736, "text": "Like all of them are playing like an action based video game."}]}]