[{"title": "Rick Rubin: Legendary Music Producer | Lex Fridman Podcast #275", "id": "H_szemxPcTI", "quotes": [{"time": 287, "text": "What else can capture that?"}, {"time": 290, "text": "But it's true that there's a connection both between time and place and music."}, {"time": 295, "text": "And I, certain music growing up on the East Coast didn't really resonate with me until I spent time on the West Coast."}, {"time": 305, "text": "Eagles being an example."}, {"time": 306, "text": "When I lived in New York, the Eagles didn't really speak to me."}, {"time": 309, "text": "ZZ Top didn't really speak to me."}, {"time": 312, "text": "And then when I started spending time in California and driving through Laurel Canyon, all of a sudden the music of the Eagles felt appropriate somehow."}, {"time": 321, "text": "And I started listening to it more."}, {"time": 324, "text": "So not until you went out West can you understand the sounds of the West."}, {"time": 329, "text": "So it's really like New York has a sound."}, {"time": 332, "text": "What other places have a sound in the United States?"}, {"time": 334, "text": "I think every place does."}, {"time": 336, "text": "And that said, sometimes we can get an experience through music of a place."}, {"time": 342, "text": "Like we can resonate with the music and not understand why."}, {"time": 346, "text": "And then maybe when we go to the place where it was created, it's almost like we have a knowingness of that place."}, {"time": 352, "text": "It's not a strange place anymore."}, {"time": 354, "text": "Yeah, Stevie Ray Vaughan with blues and Texas blues."}, {"time": 358, "text": "You can just listen to Texas Flood and just, again, this is like a woman you're missing, a broken heart and somehow that connects to the place."}, {"time": 367, "text": "The Eagles, what song with the Eagles connects with you?"}, {"time": 371, "text": "Are we talking about like Take It Easy or are we talking more like Hotel California?"}, {"time": 378, "text": "I'm thinking Take It Easy, but both are great."}, {"time": 382, "text": "Yeah, there's certain songs when I started learning guitar when I was young that's like, I would like to be the kind of person that not only knows how to play this song, but understands the song and like have that song be something I played 20 years ago."}, {"time": 400, "text": "And I've lived with that song for a while."}, {"time": 402, "text": "Like Hotel California is an example."}, {"time": 405, "text": "Obviously there's the solo, but there's also the soulfulness of the lyrics, which I still don't understand."}, {"time": 411, "text": "And it could be about anything."}, {"time": 412, "text": "And as you get older, I feel like the meaning of the song could be anything."}, {"time": 417, "text": "I think that's the beauty of them."}, {"time": 419, "text": "I think when the person wrote them, they may have had one interpretation, but it's not contingent on us getting that interpretation to like it or resonate with it or feel it."}, {"time": 432, "text": "In some ways, the best art is open enough where the artist gets to have their experience when they make it and then the audience gets to have their experience when they listen and they don't have to be the same."}, {"time": 446, "text": "And then it connects thousands or millions of people together."}, {"time": 450, "text": "There's a togetherness of music when you share that music, when you're listening to stuff together, like in a car."}, {"time": 456, "text": "First of all, the car is a sacred place."}, {"time": 459, "text": "So I work in part on autonomous vehicles."}, {"time": 463, "text": "And you start to think, well, what are the things you lose when the car stops being the central part of American life?"}, {"time": 473, "text": "The car ownership."}, {"time": 474, "text": "It just feels like the car, when you're alone, it's like a therapist thing, session, because you get angry at other humans and then you get to like sit in your own anger and emotion."}, {"time": 489, "text": "You get to listen to the song on a long road trip and remember, like run through your memories, the heartbreak."}, {"time": 498, "text": "I don't know, the one that got away, but also like the beautiful moments, all of it."}, {"time": 503, "text": "Yeah, and all of that in the car."}, {"time": 507, "text": "Yeah, driving also serves another purpose."}, {"time": 510, "text": "And it's one of the things that we can do that we have to pay attention enough not to crash, but typically can essentially run on autopilot enough where we could be thinking about something else or concentrating on something else."}, {"time": 530, "text": "And the difference between concentrating on something or trying to solve a problem when you're solely trying to solve a problem versus when you have some little task that's keeping you occupied, I find if I have something slight to take care of, it frees a more creative side of my mind to better solve problems."}, {"time": 555, "text": "You know, I'm kind of jealous of people that found that in painting, for example."}, {"time": 559, "text": "They'll be drawing or painting and listening to, so that's the small task you do."}, {"time": 565, "text": "You're coloring in the lines."}, {"time": 567, "text": "It's like this gentle, peaceful, slow process that requires just a small fraction of your mind and then you can listen."}, {"time": 574, "text": "Some people listen to podcasts that way."}, {"time": 576, "text": "Some people listen to music that way."}, {"time": 580, "text": "How do you free your mind?"}, {"time": 582, "text": "Yeah, running is one of them."}, {"time": 591, "text": "There's a process."}, {"time": 594, "text": "So most freeing of the mind for me has to go through a process of a bit of pain for a bit."}, {"time": 601, "text": "So doing something difficult, so it's like an airplane taking off or something."}, {"time": 606, "text": "So that's like, for example, running."}, {"time": 609, "text": "The first few miles would just be, just first of all, the physical aspect, which is like, ah, you're so fat."}, {"time": 616, "text": "You're out of shape."}, {"time": 617, "text": "You're, this is the getting old, this, that."}, {"time": 620, "text": "Okay, that slowly dissipates."}, {"time": 621, "text": "And then the demons come in who are like, you should be getting this and that and this done."}, {"time": 630, "text": "You haven't gotten it done."}, {"time": 631, "text": "You're like breaking promises, all those kinds of voices coming in."}, {"time": 635, "text": "And after that, maybe mile four, it's like, fuck it."}, {"time": 640, "text": "You just run, run with the wind at a very slow pace, but with the wind, and then you could think."}, {"time": 647, "text": "So it's the footsteps, the physical activity."}, {"time": 650, "text": "Then you could deeply think about stuff, ideas, sort of design, whether it's program design stuff or like high level life decisions, all those kinds of things."}, {"time": 660, "text": "I would say running."}, {"time": 662, "text": "I used to build bridges from toothpicks."}, {"time": 665, "text": "I used to be a thing."}, {"time": 667, "text": "It's an engineering."}, {"time": 668, "text": "I guess some people like glue together airplanes and stuff like that."}, {"time": 673, "text": "But the bridges, it's such deeply honest work because at the end of it, you're gonna have to test that bridge and you're gonna see how good your work was."}, {"time": 684, "text": "The little details, but also the big picture."}, {"time": 686, "text": "Do you use glue or no?"}, {"time": 688, "text": "Yeah, use glue."}, {"time": 690, "text": "So it's not pure physics."}, {"time": 692, "text": "It's materials engineering too."}, {"time": 696, "text": "Because the way you want to do it is you actually split the wood as thin as possible and then glue it back together because the glue is really strong, except for the arches and things like that."}, {"time": 709, "text": "So you're building arch bridges, which is a whole nother skill because you have to bend the wood."}, {"time": 714, "text": "And it's so cool because the thing can hold thousands of times its weight."}, {"time": 718, "text": "And then you get to watch it explode at a certain point from the pressure and when you do a really good job, it doesn't explode in a kind of some weak point that you didn't anticipate just kind of starts cracking."}, {"time": 734, "text": "Everything cracks, everything explodes."}, {"time": 737, "text": "It's just pieces fly everywhere."}, {"time": 740, "text": "And it's literally hundreds of hours of work just explode in front of you."}, {"time": 746, "text": "And that's a metaphor for life maybe."}, {"time": 749, "text": "And it's all for nothing, except for the journey that you took to get there."}, {"time": 754, "text": "And no one understands."}, {"time": 757, "text": "Speaking of which, back to Nietzsche, these questions are ridiculous."}, {"time": 762, "text": "So you're gonna have to try to figure out what the heck I'm trying to do here."}, {"time": 768, "text": "So Nietzsche also said, a line I love, which is, and those who were seen dancing were thought to be insane by those who could not hear the music."}, {"time": 778, "text": "Do you, Rick Rubin, ever feel crazy?"}, {"time": 782, "text": "Or maybe you're the one who's sane and everybody else is crazy."}, {"time": 787, "text": "You know that the dancing, the joy of the music, of just feeling the music and everybody else just doesn't understand."}, {"time": 795, "text": "And this doesn't have to be literally about music."}, {"time": 797, "text": "This is about art, about creation."}, {"time": 801, "text": "I would say I feel different and it's hard to say it's like which side of the equation is crazy, you know?"}, {"time": 813, "text": "Did you ever find a group of people that you get, they get you?"}, {"time": 819, "text": "Is that what producing is essentially?"}, {"time": 822, "text": "Is you try to find the moments when you just get each other?"}, {"time": 826, "text": "I would say there are definitely certain artists with certain temperaments."}, {"time": 838, "text": "When you're around them, it feels like you can finish each other's sentences."}, {"time": 842, "text": "You know, just see the world the same way."}, {"time": 844, "text": "Comedians as well."}, {"time": 847, "text": "And that's not essential for the two of you together creating something special."}, {"time": 856, "text": "So it could be attention too?"}, {"time": 858, "text": "It could be any, there's no rules."}, {"time": 861, "text": "It'd be like, think of it like a coach."}, {"time": 864, "text": "A coach could bring what they have to bring to any talented individual and help them find their way."}, {"time": 876, "text": "And sometimes the right coach for the right athlete really works and other times there's a mismatch."}, {"time": 887, "text": "I saw it when it came out so I don't really remember it well, but I did see it."}, {"time": 889, "text": "So there's a coach type of figure."}, {"time": 892, "text": "Who is pushing a drummer to create, to grow as a musician, but also to create something special."}, {"time": 900, "text": "I don't know if it's even special music skill wise, it's a special moment."}, {"time": 904, "text": "I don't know what he's trying to create."}, {"time": 906, "text": "From one perspective, it's just an abusive, a person who selfishly gets off on being abusive to those he's with."}, {"time": 912, "text": "But from another perspective, the way I saw that movie, is it's just the two right humans finding each other at the right moment in life and risking destroying each other in the process, but maybe something beautiful will come of it."}, {"time": 929, "text": "Do you think that's a toxic relationship?"}, {"time": 932, "text": "Or is there, does some of that movie resonate with you as that sometimes is required to create art?"}, {"time": 941, "text": "That kind of suffering."}, {"time": 944, "text": "Well, there's suffering involved, but not that kind of suffering."}, {"time": 950, "text": "There are some people who that's their process and that's whatever works."}, {"time": 955, "text": "There's no right answers for anything involved in art."}, {"time": 959, "text": "We're all trying experiments to find a way."}, {"time": 962, "text": "And even for the things that I work on, I don't have a set way that I do anything."}, {"time": 967, "text": "I come to every project blank and see, I really listen to what the artist plays and says and through what they explain they wanna do, help find the best way to get there."}, {"time": 990, "text": "Was it implicit in the movie that the mean teacher liked being a mean teacher?"}, {"time": 997, "text": "You said the way you described it was that he got off on treating people this way."}, {"time": 1003, "text": "Do we know that to be the case?"}, {"time": 1004, "text": "I don't remember that in the movie."}, {"time": 1005, "text": "No, but we sometimes project that onto people, people who are really rough on students."}, {"time": 1012, "text": "You start to think, well, maybe, maybe that is fundamentally who they are and if it's fundamentally who they are, that there must be some pleasure in it or it's an addiction of some sort."}, {"time": 1027, "text": "But it could be also a deliberate choice made by the teacher."}, {"time": 1034, "text": "It also could be a lineage."}, {"time": 1035, "text": "Like in the Zen tradition, there are sort of the mean Roshi's who if you do something wrong, take a physical action."}, {"time": 1047, "text": "And it's just in the lineage, it's considered that's how you teach."}, {"time": 1054, "text": "I didn't come from that lineage."}, {"time": 1057, "text": "So I'm much more of a, I feel like it's more of a collaboration between people working together to make the best thing."}, {"time": 1066, "text": "It's not a boss slave relationship at all."}, {"time": 1071, "text": "It's much more of a let's find our way."}, {"time": 1075, "text": "And we agree at the beginning of the process that if either of us or any of us don't like what's happening, we say it."}, {"time": 1084, "text": "And the goal is to keep working till we get to a point where we're all really happy with it."}, {"time": 1089, "text": "It's like if we make something that an artist likes and I don't like, or that I like and they don't like, we haven't gone far enough."}, {"time": 1097, "text": "In terms of lineage, the ones that seek destruction and the ones that seek happiness all come from the same lineage."}, {"time": 1103, "text": "We all came from fish."}, {"time": 1104, "text": "So somewhere in you, deep down there, there's the other stuff too."}, {"time": 1110, "text": "It's just that you haven't been yet, by the way, because you said every new project, including maybe starting today, is an opportunity to channel, to plug into something that was always there and you haven't gotten a chance to plug into."}, {"time": 1126, "text": "You mentioned listening."}, {"time": 1127, "text": "How do you listen to a person?"}, {"time": 1129, "text": "How do you hear a person?"}, {"time": 1131, "text": "When you first come in, like we just met, what's the analysis happening?"}, {"time": 1137, "text": "But I mean, with me is one thing."}, {"time": 1139, "text": "I'm an artist of sorts."}, {"time": 1140, "text": "I program and I'm just, I'm human, I guess."}, {"time": 1146, "text": "I guess we're all creating art."}, {"time": 1148, "text": "How do you see, like, how do I bring out?"}, {"time": 1150, "text": "So for people who don't know, I mean, obviously everyone knows that you've produced some of the greatest records ever, but the way I see that is you just brought out the best in a lot of interesting artists."}, {"time": 1167, "text": "And so in order to bring out the best in them, you have to understand them."}, {"time": 1173, "text": "You have to hear the music of their soul, hopefully not being too romantic here, but just like, is there something you can say of how difficult that is, if there's a process, if there's tricks, if it's luck?"}, {"time": 1192, "text": "I think it starts with this, again, coming in blank, like not having any preconceived ideas, being open and really listening, listening and not thinking about what you're gonna say next or what your opinion is or any, you know, not basically being a recorder and just hearing what comes in."}, {"time": 1214, "text": "And then once you hear what comes in, processing that information and trying our best to do that without any of the beliefs that we might have to impact what that is."}, {"time": 1228, "text": "If I ask you a question, I don't wanna hear what, I don't wanna listen to you and have any reaction happening when you're speaking."}, {"time": 1238, "text": "I wanna be as neutral as possible."}, {"time": 1241, "text": "For me, my goal is not to form an opinion, it's to understand."}, {"time": 1248, "text": "So if anything, I would draw you out further and just ask questions to really understand."}, {"time": 1256, "text": "And if you say, or if you say something that somehow triggers me in a way that that's, you know, I wonder how he came to that."}, {"time": 1268, "text": "I wouldn't challenge you, I would ask, like, how did you find that?"}, {"time": 1272, "text": "You know, how did you get to that place?"}, {"time": 1274, "text": "From a place of curiosity, you would try to figure out."}, {"time": 1277, "text": "Yeah, I wanna understand who the person is."}, {"time": 1280, "text": "And through questioning, we can usually get there."}, {"time": 1282, "text": "Or through just spending time together, you find out who the person is."}, {"time": 1289, "text": "What about finding out and figuring out how to then take the next steps of bringing out the best in them?"}, {"time": 1297, "text": "Like, is it just trial and error?"}, {"time": 1300, "text": "Like, let's try this."}, {"time": 1301, "text": "It's definitely trial and error."}, {"time": 1302, "text": "It's always trial and error."}, {"time": 1305, "text": "Are you afraid of making a mistake?"}, {"time": 1306, "text": "Like, let's add this instrument, let's remove this instrument."}, {"time": 1310, "text": "Let's add this line, let's remove this line."}, {"time": 1312, "text": "Let's try."}, {"time": 1313, "text": "And let's be open."}, {"time": 1315, "text": "So one of the, we don't really have rules, but one of the agreements in the studio is any idea that anyone has will always demonstrate it, will always try it."}, {"time": 1329, "text": "Because I can describe to you an idea and you can think, that's a terrible idea, let's not do that."}, {"time": 1336, "text": "And then I can play you the idea and then you can say, oh, that's really good."}, {"time": 1339, "text": "And it's completely different because we, when we hear, when we're told something, we have to imagine what that is and the way you see something and imagine it and the way I see something and imagine it are completely different."}, {"time": 1353, "text": "So you say a thing and now there's two humans that play that thing in their mind differently, in their imagination, and then there's a cool creative step and when you actually do it, to see how it differs in the imagination, and then the difference or the commonality will be like an exciting little discovery together."}, {"time": 1372, "text": "Well, so many groups of people making things together in a room, one person will suggest something and someone else in the room say, ah, that doesn't sound like a good idea, let's not do that, and then they move on."}, {"time": 1385, "text": "The testing of every idea is really important and that's how you get to see, oh, that's not at all what I thought it was gonna be."}, {"time": 1391, "text": "Happens to me all the time, I know, because someone will suggest, why don't we do it like this?"}, {"time": 1396, "text": "And I'll think, that sounds bad, and then I'll think, okay, let's try it, and then we hear it, and then eight times out of 10, it's nothing like I imagined and great."}, {"time": 1408, "text": "And then you try not to have an ego about the fact that you thought it was not a good idea in your head."}, {"time": 1413, "text": "There can't be any ego in this."}, {"time": 1416, "text": "It doesn't, if everyone's there with the purpose of making the best thing we can, there's nothing else."}, {"time": 1429, "text": "There are no, there can't be any boundaries to that."}, {"time": 1433, "text": "So there's a moment I saw with, I know you don't love talking about previous things you've done, but it's cool to dive in there every once in a while."}, {"time": 1442, "text": "I'm fine to talk about anything."}, {"time": 1444, "text": "To sample it, anything?"}, {"time": 1447, "text": "I have this pain I gotta talk now."}, {"time": 1449, "text": "I'll think of something ridiculous that would make you change your mind."}, {"time": 1456, "text": "You mentioned, I saw a video of you with Jay Z at Workaround 99 Problems where you suggested acapella, opening the song with acapella, just no instruments, just voice."}, {"time": 1468, "text": "That to me, I mean, that's one of the characteristics of the things, of the ways you've brought out the best in artists is doing less."}, {"time": 1478, "text": "Sort of the tending towards simplicity in some kind of way."}, {"time": 1483, "text": "So that choice of acapella is really interesting because I could see a lot of people think that that's a bad idea, but it turned out to be a really powerful idea."}, {"time": 1492, "text": "Can you maybe talk about the simplicity, how to find simplicity, why you find simplicity is beautiful."}, {"time": 1498, "text": "It does appear to be beautiful."}, {"time": 1501, "text": "Yeah, I don't know where it comes from."}, {"time": 1504, "text": "It has been with me from the beginning of my work, the very first album I ever produced, the credit I took was reduced by me instead of produced by me for that reason."}, {"time": 1516, "text": "I like the idea of getting to the essential and I have a better idea now that I've done it for a while, but at the time it was purely an instinctual thing."}, {"time": 1528, "text": "And part of it is a sonic, there's a sonic benefit, which is the less elements you have, you can hear each of the ones that are there and they can sound better."}, {"time": 1542, "text": "And the less there are, the more space they could have around them and the more you can hear their personality."}]}]