[{"title": "Anca Dragan: Human-Robot Interaction and Reward Engineering | Lex Fridman Podcast #81", "id": "iOCfIFBBpVY", "quotes": [{"time": 414, "text": "I was like, you could take a special, I wouldn't say it was an extracurricular, it's in the sense an extracurricular, so you could sign up for dance or music or programming."}, {"time": 423, "text": "And I did the programming thing and my mom was like, what, why?"}, {"time": 427, "text": "Did you compete in programming?"}, {"time": 428, "text": "Like these days, Romania probably, that's like a big thing."}, {"time": 432, "text": "There's a programming competition."}, {"time": 435, "text": "Was that, did that touch you at all?"}, {"time": 437, "text": "I did a little bit of the computer science Olympian, but not as seriously as I did the math Olympian."}, {"time": 444, "text": "So it was programming."}, {"time": 445, "text": "Yeah, it's basically, here's a hard math problem, solve it with a computer is kind of the deal."}, {"time": 449, "text": "Yeah, it's more like algorithm."}, {"time": 450, "text": "Exactly, it's always algorithmic."}, {"time": 452, "text": "So again, you kind of mentioned the Google self driving car, but outside of that, what's like who or what is your favorite robot, real or fictional that like captivated your imagination throughout?"}, {"time": 468, "text": "I mean, I guess you kind of alluded to the Google self drive, the Firefly was a magical moment, but is there something else?"}, {"time": 474, "text": "It wasn't the Firefly there, I think there was the Lexus by the way."}, {"time": 478, "text": "This was back then."}, {"time": 479, "text": "But yeah, so good question."}, {"time": 482, "text": "Okay, my favorite fictional robot is WALLI."}, {"time": 488, "text": "And I love how amazingly expressive it is."}, {"time": 495, "text": "I'm personally thinks a little bit about expressive motion kinds of things you're saying with, you can do this and it's a head and it's the manipulator and what does it all mean?"}, {"time": 502, "text": "I like to think about that stuff."}, {"time": 504, "text": "I love Pixar, I love animation."}, {"time": 506, "text": "WALLI has two big eyes, I think, or no?"}, {"time": 508, "text": "Yeah, it has these cameras and they move."}, {"time": 514, "text": "So yeah, it goes and then it's super cute."}, {"time": 518, "text": "Yeah, the way it moves is just so expressive, the timing of that motion, what it's doing with its arms and what it's doing with these lenses is amazing."}, {"time": 528, "text": "And so I've really liked that from the start."}, {"time": 533, "text": "And then on top of that, sometimes I share this, it's a personal story I share with people or when I teach about AI or whatnot."}, {"time": 541, "text": "My husband proposed to me by building a WALLI and he actuated it."}, {"time": 549, "text": "So it's seven degrees of freedom, including the lens thing."}, {"time": 553, "text": "And it kind of came in and it had the, he made it have like the belly box opening thing."}, {"time": 561, "text": "So it just did that."}, {"time": 563, "text": "And then it spewed out this box made out of Legos that open slowly and then bam, yeah."}, {"time": 571, "text": "Yeah, it was quite, it set a bar."}, {"time": 574, "text": "That could be like the most impressive thing I've ever heard."}, {"time": 579, "text": "That was special connection to WALLI, long story short."}, {"time": 580, "text": "I like WALLI because I like animation and I like robots and I like the fact that this was, we still have this robot to this day."}, {"time": 589, "text": "How hard is that problem, do you think of the expressivity of robots?"}, {"time": 594, "text": "Like with the Boston Dynamics, I never talked to those folks about this particular element."}, {"time": 600, "text": "I've talked to them a lot, but it seems to be like almost an accidental side effect for them that they weren't, I don't know if they're faking it."}, {"time": 608, "text": "They weren't trying to, okay."}, {"time": 611, "text": "They do say that the gripper, it was not intended to be a face."}, {"time": 617, "text": "I don't know if that's a honest statement, but I think they're legitimate."}, {"time": 621, "text": "Probably yes."}, {"time": 621, "text": "And so do we automatically just anthropomorphize anything we can see about a robot?"}, {"time": 629, "text": "So like the question is, how hard is it to create a WALLI type robot that connects so deeply with us humans?"}, {"time": 636, "text": "It's really hard, right?"}, {"time": 637, "text": "So it depends on what setting."}, {"time": 639, "text": "So if you wanna do it in this very particular narrow setting where it does only one thing and it's expressive, then you can get an animator, you know, you can have Pixar on call come in, design some trajectories."}, {"time": 653, "text": "There was a, Anki had a robot called Cosmo where they put in some of these animations."}, {"time": 658, "text": "That part is easy, right?"}, {"time": 660, "text": "The hard part is doing it not via these kind of handcrafted behaviors, but doing it generally autonomously."}, {"time": 669, "text": "Like I want robots, I don't work on, just to clarify, I don't, I used to work a lot on this."}, {"time": 698, "text": "I think that when robots move, they can communicate so much about internal states or perceived internal states that they have."}, {"time": 709, "text": "And I think that's really useful and an element that we'll want in the future because I was reading this article about how kids are, kids are being rude to Alexa because they can be rude to it and it doesn't really get angry, right?"}, {"time": 731, "text": "It doesn't reply in any way, it just says the same thing."}, {"time": 735, "text": "So I think there's, at least for that, for the correct development of children, it's important that these things, you kind of react differently."}, {"time": 782, "text": "What is the person actually perceiving?"}, {"time": 785, "text": "What do they think about the robots?"}, {"time": 788, "text": "Something or rather, and then you have to optimize in that system."}, {"time": 792, "text": "And so that means that you have to understand how your motion, your actions end up sort of influencing the observer's kind of perception of you."}, {"time": 800, "text": "And it's very hard to write math about that."}, {"time": 805, "text": "Right, so when you start to think about incorporating the human into the state model, apologize for the philosophical question, but how complicated are human beings, do you think?"}, {"time": 816, "text": "Like, can they be reduced to a kind of almost like an object that moves and maybe has some basic intents?"}, {"time": 826, "text": "Or is there something, do we have to model things like mood and general aggressiveness and time?"}, {"time": 832, "text": "I mean, all these kinds of human qualities or like game theoretic qualities, like what's your sense?"}, {"time": 838, "text": "How complicated is... How hard is the problem of human robot interaction?"}, {"time": 843, "text": "Yeah, should we talk about what the problem of human robot interaction is?"}, {"time": 847, "text": "Yeah, what is human robot interaction?"}, {"time": 850, "text": "And then talk about how that, yeah."}, {"time": 852, "text": "So, and by the way, I'm gonna talk about this very particular view of human robot interaction, right?"}, {"time": 859, "text": "Which is not so much on the social side or on the side of how do you have a good conversation with the robot, what should the robot's appearance be?"}, {"time": 866, "text": "It turns out that if you make robots taller versus shorter, this has an effect on how people act with them."}, {"time": 871, "text": "So I'm not talking about that."}, {"time": 874, "text": "But I'm talking about this very kind of narrow thing, which is you take, if you wanna take a task that a robot can do in isolation, in a lab out there in the world, but in isolation, and now you're asking what does it mean for the robot to be able to do this task for, presumably what its actually end goal is, which is to help some person."}, {"time": 896, "text": "That ends up changing the problem in two ways."}, {"time": 902, "text": "The first way it changes the problem is that the robot is no longer the single agent acting."}, {"time": 908, "text": "That you have humans who also take actions in that same space."}, {"time": 912, "text": "Cars navigating around people, robots around an office, navigating around the people in that office."}, {"time": 918, "text": "If I send the robot over there in the cafeteria to get me a coffee, then there's probably other people reaching for stuff in the same space."}, {"time": 925, "text": "And so now you have your robot and you're in charge of the actions that the robot is taking."}, {"time": 930, "text": "Then you have these people who are also making decisions and taking actions in that same space."}, {"time": 936, "text": "And even if, you know, the robot knows what it should do and all of that, just coexisting with these people, right?"}, {"time": 942, "text": "Kind of getting the actions to gel well, to mesh well together."}, {"time": 947, "text": "That's sort of the kind of problem number one."}, {"time": 950, "text": "And then there's problem number two, which is, goes back to this notion of if I'm a programmer, I can specify some objective for the robot to go off and optimize and specify the task."}, {"time": 963, "text": "But if I put the robot in your home, presumably you might have your own opinions about, well, okay, I want my house clean, but how do I want it cleaned?"}, {"time": 974, "text": "And how should robot move, how close to me it should come and all of that."}, {"time": 977, "text": "And so I think those are the two differences that you have."}, {"time": 980, "text": "You're acting around people and what you should be optimizing for should satisfy the preferences of that end user, not of your programmer who programmed you."}, {"time": 990, "text": "Yeah, and the preferences thing is tricky."}, {"time": 993, "text": "So figuring out those preferences, be able to interactively adjust to understand what the human is doing."}, {"time": 999, "text": "So really it boils down to understand the humans in order to interact with them and in order to please them."}, {"time": 1007, "text": "So why is this hard?"}, {"time": 1008, "text": "Yeah, why is understanding humans hard?"}, {"time": 1011, "text": "So I think there's two tasks about understanding humans that in my mind are very, very similar, but not everyone agrees."}, {"time": 1020, "text": "So there's the task of being able to just anticipate what people will do."}, {"time": 1025, "text": "We all know that cars need to do this, right?"}, {"time": 1027, "text": "We all know that, well, if I navigate around some people, the robot has to get some notion of, okay, where is this person gonna be?"}, {"time": 1035, "text": "So that's kind of the prediction side."}, {"time": 1037, "text": "And then there's what you were saying, satisfying the preferences, right?"}, {"time": 1041, "text": "So adapting to the person's preferences, knowing what to optimize for, which is more this inference side, this what does this person want?"}, {"time": 1048, "text": "What is their intent?"}, {"time": 1048, "text": "What are their preferences?"}, {"time": 1051, "text": "And to me, those kind of go together because I think that at the very least, if you can understand, if you can look at human behavior and understand what it is that they want, then that's sort of the key enabler to being able to anticipate what they'll do in the future."}, {"time": 1070, "text": "Because I think that we're not arbitrary."}, {"time": 1073, "text": "We make these decisions that we make, we act in the way we do because we're trying to achieve certain things."}, {"time": 1079, "text": "And so I think that's the relationship between them."}, {"time": 1081, "text": "Now, how complicated do these models need to be in order to be able to understand what people want?"}, {"time": 1090, "text": "So we've gotten a long way in robotics with something called inverse reinforcement learning, which is the notion of if someone acts, demonstrates how they want the thing done."}, {"time": 1102, "text": "What is inverse reinforcement learning?"}, {"time": 1104, "text": "You just briefly said it."}, {"time": 1105, "text": "Right, so it's the problem of take human behavior and infer reward function from this."}, {"time": 1113, "text": "So figure out what it is that that behavior is optimal with respect to."}, {"time": 1117, "text": "And it's a great way to think about learning human preferences in the sense of you have a car and the person can drive it and then you can say, well, okay, I can actually learn what the person is optimizing for."}, {"time": 1131, "text": "I can learn their driving style, or you can have people demonstrate how they want the house clean."}, {"time": 1137, "text": "And then you can say, okay, this is, I'm getting the trade offs that they're making."}, {"time": 1142, "text": "I'm getting the preferences that they want out of this."}, {"time": 1146, "text": "And so we've been successful in robotics somewhat with this."}, {"time": 1150, "text": "And it's based on a very simple model of human behavior."}, {"time": 1155, "text": "It was remarkably simple, which is that human behavior is optimal with respect to whatever it is that people want, right?"}, {"time": 1162, "text": "So you make that assumption and now you can kind of inverse through."}, {"time": 1164, "text": "That's why it's called inverse, well, really optimal control, but also inverse reinforcement learning."}, {"time": 1170, "text": "So this is based on utility maximization in economics."}, {"time": 1176, "text": "Back in the forties, von Neumann and Morgenstern were like, okay, people are making choices by maximizing utility, go."}, {"time": 1185, "text": "And then in the late fifties, we had Luce and Shepherd come in and say, people are a little bit noisy and approximate in that process."}, {"time": 1197, "text": "So they might choose something kind of stochastically with probability proportional to how much utility something has."}, {"time": 1207, "text": "So there's a bit of noise in there."}, {"time": 1209, "text": "This has translated into robotics and something that we call Boltzmann rationality."}, {"time": 1214, "text": "So it's a kind of an evolution of inverse reinforcement learning that accounts for human noise."}, {"time": 1219, "text": "And we've had some success with that too, for these tasks where it turns out people act noisily enough that you can't just do vanilla, the vanilla version."}, {"time": 1229, "text": "You can account for noise and still infer what they seem to want based on this."}, {"time": 1236, "text": "Then now we're hitting tasks where that's not enough."}, {"time": 1239, "text": "And because... What are examples of spatial tasks?"}, {"time": 1243, "text": "So imagine you're trying to control some robot, that's fairly complicated."}, {"time": 1247, "text": "You're trying to control a robot arm because maybe you're a patient with a motor impairment and you have this wheelchair mounted arm and you're trying to control it around."}, {"time": 1256, "text": "Or one task that we've looked at with Sergei is, and our students did, is a lunar lander."}, {"time": 1262, "text": "So I don't know if you know this Atari game, it's called Lunar Lander."}, {"time": 1266, "text": "It's really hard."}, {"time": 1267, "text": "People really suck at landing the thing."}, {"time": 1269, "text": "Mostly they just crash it left and right."}, {"time": 1271, "text": "Okay, so this is the kind of task we imagine you're trying to provide some assistance to a person operating such a robot where you want the kind of the autonomy to kick in, figure out what it is that you're trying to do and help you do it."}, {"time": 1285, "text": "It's really hard to do that for, say, Lunar Lander because people are all over the place."}, {"time": 1292, "text": "And so they seem much more noisy than really irrational."}, {"time": 1296, "text": "That's an example of a task where these models are kind of failing us."}, {"time": 1301, "text": "And it's not surprising because we're talking about the 40s, utility, late 50s, sort of noisy."}, {"time": 1308, "text": "Then the 70s came and behavioral economics started being a thing where people were like, no, no, no, no, no, people are not rational."}, {"time": 1318, "text": "People are messy and emotional and irrational and have all sorts of heuristics that might be domain specific."}, {"time": 1326, "text": "And they're just a mess."}, {"time": 1329, "text": "So what does my robot do to understand what you want?"}, {"time": 1334, "text": "And it's a very, it's very, that's why it's complicated."}, {"time": 1338, "text": "It's, you know, for the most part, we get away with pretty simple models until we don't."}, {"time": 1343, "text": "And then the question is, what do you do then?"}, {"time": 1346, "text": "And I had days when I wanted to, you know, pack my bags and go home and switch jobs because it's just, it feels really daunting to make sense of human behavior enough that you can reliably understand what people want, especially as, you know, robot capabilities will continue to get developed."}, {"time": 1364, "text": "You'll get these systems that are more and more capable of all sorts of things."}, {"time": 1368, "text": "And then you really want to make sure that you're telling them the right thing to do."}, {"time": 1372, "text": "Well, read it in human behavior."}, {"time": 1376, "text": "So if I just sat here quietly and tried to understand something about you by listening to you talk, it would be harder than if I got to say something and ask you and interact and control."}, {"time": 1388, "text": "Can you, can the robot help its understanding of the human by influencing the behavior by actually acting?"}, {"time": 1399, "text": "So one of the things that's been exciting to me lately is this notion that when you try to, that when you try to think of the robotics problem as, okay, I have a robot and it needs to optimize for whatever it is that a person wants it to optimize as opposed to maybe what a programmer said."}, {"time": 1420, "text": "That problem we think of as a human robot collaboration problem in which both agents get to act in which the robot knows less than the human because the human actually has access to, you know, at least implicitly to what it is that they want."}, {"time": 1437, "text": "They can't write it down, but they can talk about it."}, {"time": 1440, "text": "They can give all sorts of signals."}, {"time": 1442, "text": "They can demonstrate and, but the robot doesn't need to sit there and passively observe human behavior and try to make sense of it."}, {"time": 1450, "text": "The robot can act too."}, {"time": 1451, "text": "And so there's these information gathering actions that the robot can take to sort of solicit responses that are actually informative."}, {"time": 1461, "text": "So for instance, this is not for the purpose of assisting people, but with kind of back to coordinating with people in cars and all of that."}, {"time": 1467, "text": "One thing that Dorsa did was, so we were looking at cars being able to navigate around people and you might not know exactly the driving style of a particular individual that's next to you, but you wanna change lanes in front of them."}, {"time": 1485, "text": "Navigating around other humans inside cars."}, {"time": 1488, "text": "Yeah, good, good clarification question."}, {"time": 1490, "text": "So you have an autonomous car and it's trying to navigate the road around human driven vehicles."}, {"time": 1498, "text": "Similar things ideas apply to pedestrians as well, but let's just take human driven vehicles."}, {"time": 1503, "text": "So now you're trying to change a lane."}, {"time": 1506, "text": "Well, you could be trying to infer the driving style of this person next to you."}, {"time": 1512, "text": "You'd like to know if they're in particular, if they're sort of aggressive or defensive, if they're gonna let you kind of go in or if they're gonna not."}, {"time": 1520, "text": "And it's very difficult to just, if you think that if you wanna hedge your bets and say, ah, maybe they're actually pretty aggressive, I shouldn't try this."}, {"time": 1531, "text": "You kind of end up driving next to them and driving next to them, right?"}, {"time": 1534, "text": "And then you don't know because you're not actually getting the observations that you're getting away."}, {"time": 1540, "text": "Someone drives when they're next to you and they just need to go straight."}, {"time": 1544, "text": "It's kind of the same regardless if they're aggressive or defensive."}, {"time": 1547, "text": "And so you need to enable the robot to reason about how it might actually be able to gather information by changing the actions that it's taking."}, {"time": 1558, "text": "And then the robot comes up with these cool things where it kind of nudges towards you and then sees if you're gonna slow down or not."}, {"time": 1565, "text": "Then if you slow down, it sort of updates its model of you and says, oh, okay, you're more on the defensive side."}, {"time": 1571, "text": "So now I can actually like."}, {"time": 1572, "text": "That's a fascinating dance."}, {"time": 1574, "text": "That's so cool that you could use your own actions to gather information."}, {"time": 1579, "text": "That feels like a totally open, exciting new world of robotics."}, {"time": 1584, "text": "I mean, how many people are even thinking about that kind of thing?"}, {"time": 1588, "text": "A handful of us, I'd say."}, {"time": 1590, "text": "It's rare because it's actually leveraging human."}, {"time": 1593, "text": "I mean, most roboticists, I've talked to a lot of colleagues and so on, are kind of, being honest, kind of afraid of humans."}, {"time": 1602, "text": "Because they're messy and complicated, right?"}, {"time": 1607, "text": "Going back to what we were talking about earlier, right now we're kind of in this dilemma of, okay, there are tasks that we can just assume people are approximately rational for and we can figure out what they want."}, {"time": 1617, "text": "We can figure out their goals."}, {"time": 1617, "text": "We can figure out their driving styles, whatever."}, {"time": 1620, "text": "There are these tasks that we can't."}, {"time": 1622, "text": "So what do we do, right?"}, {"time": 1623, "text": "Do we pack our bags and go home?"}, {"time": 1626, "text": "And this one, I've had a little bit of hope recently."}, {"time": 1632, "text": "And I'm kind of doubting myself because what do I know that, you know, 50 years of behavioral economics hasn't figured out."}, {"time": 1639, "text": "But maybe it's not really in contradiction with the way that field is headed."}, {"time": 1643, "text": "But basically one thing that we've been thinking about is, instead of kind of giving up and saying people are too crazy and irrational for us to make sense of them, maybe we can give them a bit the benefit of the doubt."}, {"time": 1659, "text": "And maybe we can think of them as actually being relatively rational, but just under different assumptions about the world, about how the world works, about, you know, they don't have, when we think about rationality, implicit assumption is, oh, they're rational, and they're all the same assumptions and constraints as the robot, right?"}, {"time": 1679, "text": "What, if this is the state of the world, that's what they know."}, {"time": 1682, "text": "This is the transition function, that's what they know."}, {"time": 1685, "text": "This is the horizon, that's what they know."}, {"time": 1687, "text": "But maybe the kind of this difference, the way, the reason they can seem a little messy and hectic, especially to robots, is that perhaps they just make different assumptions or have different beliefs."}, {"time": 1701, "text": "Yeah, I mean, that's another fascinating idea that this, our kind of anecdotal desire to say that humans are irrational, perhaps grounded in behavioral economics, is that we just don't understand the constraints and the rewards under which they operate."}, {"time": 1718, "text": "And so our goal shouldn't be to throw our hands up and say they're irrational, it's to say, let's try to understand what are the constraints."}, {"time": 1726, "text": "What it is that they must be assuming that makes this behavior make sense."}, {"time": 1731, "text": "Good life lesson, right?"}, {"time": 1732, "text": "Good life lesson."}, {"time": 1733, "text": "That's true, it's just outside of robotics."}, {"time": 1735, "text": "That's just good to, that's communicating with humans."}, {"time": 1738, "text": "That's just a good assume that you just don't, sort of empathy, right?"}, {"time": 1744, "text": "This is maybe there's something you're missing and it's, you know, it especially happens to robots cause they're kind of dumb and they don't know things."}, {"time": 1750, "text": "And oftentimes people are sort of supra rational and that they actually know a lot of things that robots don't."}, {"time": 1755, "text": "Sometimes like with the lunar lander, the robot, you know, knows much more."}, {"time": 1760, "text": "So it turns out that if you try to say, look, maybe people are operating this thing but assuming a much more simplified physics model cause they don't get the complexity of this kind of craft or the robot arm with seven degrees of freedom with these inertias and whatever."}, {"time": 1778, "text": "So maybe they have this intuitive physics model which is not, you know, this notion of intuitive physics is something that you studied actually in cognitive science was like Josh Denenbaum, Tom Griffith's work on this stuff."}, {"time": 1789, "text": "And what we found is that you can actually try to figure out what physics model kind of best explains human actions."}, {"time": 1801, "text": "And then you can use that to sort of correct what it is that they're commanding the craft to do."}, {"time": 1808, "text": "So they might, you know, be sending the craft somewhere but instead of executing that action, you can sort of take a step back and say, according to their intuitive, if the world worked according to their intuitive physics model, where do they think that the craft is going?"}, {"time": 1823, "text": "Where are they trying to send it to?"}, {"time": 1826, "text": "And then you can use the real physics, right?"}, {"time": 1828, "text": "The inverse of that to actually figure out what you should do so that you do that instead of where they were actually sending you in the real world."}, {"time": 1834, "text": "And I kid you not at work people land the damn thing and you know, in between the two flags and all that."}, {"time": 1842, "text": "So it's not conclusive in any way but I'd say it's evidence that yeah, maybe we're kind of underestimating humans in some ways when we're giving up and saying, yeah, they're just crazy noisy."}, {"time": 1853, "text": "So then you try to explicitly try to model the kind of worldview that they have."}, {"time": 1858, "text": "That they have, that's right."}, {"time": 1860, "text": "And it's not too, I mean, there's things in behavior economics too that for instance have touched upon the planning horizon."}, {"time": 1866, "text": "So there's this idea that there's bounded rationality essentially and the idea that, well, maybe we work under computational constraints."}, {"time": 1873, "text": "And I think kind of our view recently has been take the Bellman update in AI and just break it in all sorts of ways by saying state, no, no, no, the person doesn't get to see the real state."}, {"time": 1885, "text": "Maybe they're estimating somehow."}, {"time": 1886, "text": "Transition function, no, no, no, no, no."}, {"time": 1888, "text": "Even the actual reward evaluation, maybe they're still learning about what it is that they want."}, {"time": 1894, "text": "Like, you know, when you watch Netflix and you know, you have all the things and then you have to pick something, imagine that, you know, the AI system interpreted that choice as this is the thing you prefer to see."}, {"time": 1908, "text": "Like, how are you going to know?"}, {"time": 1909, "text": "You're still trying to figure out what you like, what you don't like, et cetera."}, {"time": 1912, "text": "So I think it's important to also account for that."}, {"time": 1915, "text": "So it's not irrationality, because they're doing the right thing under the things that they know."}, {"time": 1919, "text": "Yeah, that's brilliant."}, {"time": 1921, "text": "You mentioned recommender systems."}, {"time": 1923, "text": "What kind of, and we were talking about human robot interaction, what kind of problem spaces are you thinking about?"}, {"time": 1930, "text": "So is it robots, like wheeled robots with autonomous vehicles?"}, {"time": 1936, "text": "Is it object manipulation?"}, {"time": 1938, "text": "Like when you think about human robot interaction in your mind, and maybe I'm sure you can speak for the entire community of human robot interaction."}, {"time": 1947, "text": "But like, what are the problems of interest here?"}, {"time": 1950, "text": "And does it, you know, I kind of think of open domain dialogue as human robot interaction, and that happens not in the physical space, but it could just happen in the virtual space."}, {"time": 1966, "text": "So where's the boundaries of this field for you when you're thinking about the things we've been talking about?"}, {"time": 1971, "text": "Yeah, so I try to find kind of underlying, I don't know what to even call them."}, {"time": 1982, "text": "I try to work on, you know, I might call what I do, the kind of working on the foundations of algorithmic human robot interaction and trying to make contributions there."}, {"time": 1992, "text": "And it's important to me that whatever we do is actually somewhat domain agnostic when it comes to, is it about, you know, autonomous cars or is it about quadrotors or is it about, is this sort of the same underlying principles apply?"}, {"time": 2010, "text": "Of course, when you're trying to get a particular domain to work, you usually have to do some extra work to adapt that to that particular domain."}, {"time": 2016, "text": "But these things that we were talking about around, well, you know, how do you model humans?"}, {"time": 2022, "text": "It turns out that a lot of systems need to core benefit from a better understanding of how human behavior relates to what people want and need to predict human behavior, physical robots of all sorts and beyond that."}, {"time": 2036, "text": "And so I used to do manipulation."}, {"time": 2038, "text": "I used to be, you know, picking up stuff and then I was picking up stuff with people around."}, {"time": 2043, "text": "And now it's sort of very broad when it comes to the application level, but in a sense, very focused on, okay, how does the problem need to change?"}, {"time": 2054, "text": "How do the algorithms need to change when we're not doing a robot by itself?"}, {"time": 2059, "text": "You know, emptying the dishwasher, but we're stepping outside of that."}, {"time": 2063, "text": "I thought that popped into my head just now."}, {"time": 2066, "text": "On the game theoretic side, I think you said this really interesting idea of using actions to gain more information."}, {"time": 2073, "text": "But if we think of sort of game theory, the humans that are interacting with you, with you, the robot?"}, {"time": 2084, "text": "Wow, I'm thinking the identity of the robot."}, {"time": 2086, "text": "Yeah, I do that all the time."}, {"time": 2087, "text": "Yeah, is they also have a world model of you and you can manipulate that."}, {"time": 2097, "text": "I mean, if we look at autonomous vehicles, people have a certain viewpoint."}, {"time": 2101, "text": "You said with the kids, people see Alexa in a certain way."}, {"time": 2107, "text": "Is there some value in trying to also optimize how people see you as a robot?"}, {"time": 2115, "text": "Or is that a little too far away from the specifics of what we can solve right now?"}, {"time": 2121, "text": "So, well, both, right?"}, {"time": 2124, "text": "So it's really interesting."}, {"time": 2126, "text": "And we've seen a little bit of progress on this problem, on pieces of this problem."}, {"time": 2132, "text": "So you can, again, it kind of comes down to how complicated does the human model need to be?"}, {"time": 2138, "text": "But in one piece of work that we were looking at, we just said, okay, there's these parameters that are internal to the robot and what the robot is about to do, or maybe what objective, what driving style the robot has or something like that."}, {"time": 2155, "text": "And what we're gonna do is we're gonna set up a system where part of the state is the person's belief over those parameters."}, {"time": 2162, "text": "And now when the robot acts, that the person gets new evidence about this robot internal state."}, {"time": 2170, "text": "And so they're updating their mental model of the robot."}, {"time": 2173, "text": "So if they see a car that sort of cuts someone off, they're like, oh, that's an aggressive car."}, {"time": 2178, "text": "They know more."}, {"time": 2180, "text": "If they see sort of a robot head towards a particular door, they're like, oh yeah, the robot's trying to get to that door."}, {"time": 2186, "text": "So this thing that we have to do with humans to try and understand their goals and intentions, humans are inevitably gonna do that to robots."}, {"time": 2194, "text": "And then that raises this interesting question that you asked, which is, can we do something about that?"}, {"time": 2198, "text": "This is gonna happen inevitably, but we can sort of be more confusing or less confusing to people."}, {"time": 2204, "text": "And it turns out you can optimize for being more informative and less confusing if you have an understanding of how your actions are being interpreted by the human, and how they're using these actions to update their belief."}, {"time": 2216, "text": "And honestly, all we did is just Bayes rule."}, {"time": 2219, "text": "Basically, okay, the person has a belief, they see an action, they make some assumptions about how the robot generates its actions, presumably as being rational, because robots are rational."}, {"time": 2229, "text": "It's reasonable to assume that about them."}, {"time": 2231, "text": "And then they incorporate that new piece of evidence in the Bayesian sense in their belief, and they obtain a posterior."}, {"time": 2240, "text": "And now the robot is trying to figure out what actions to take such that it steers the person's belief to put as much probability mass as possible on the correct parameters."}, {"time": 2251, "text": "So that's kind of a mathematical formalization of that."}, {"time": 2253, "text": "But my worry, and I don't know if you wanna go there with me, but I talk about this quite a bit."}, {"time": 2264, "text": "The kids talking to Alexa disrespectfully worries me."}, {"time": 2269, "text": "I worry in general about human nature."}, {"time": 2272, "text": "Like I said, I grew up in Soviet Union, World War II, I'm a Jew too, so with the Holocaust and everything."}, {"time": 2278, "text": "I just worry about how we humans sometimes treat the other, the group that we call the other, whatever it is."}, {"time": 2285, "text": "Through human history, the group that's the other has been changed faces."}, {"time": 2289, "text": "But it seems like the robot will be the other, the other, the next other."}, {"time": 2295, "text": "And one thing is it feels to me that robots don't get no respect."}, {"time": 2302, "text": "They get shoved around."}, {"time": 2303, "text": "Shoved around, and is there, one, at the shallow level, for a better experience, it seems that robots need to talk back a little bit."}, {"time": 2311, "text": "Like my intuition says, I mean, most companies from sort of Roomba, autonomous vehicle companies might not be so happy with the idea that a robot has a little bit of an attitude."}, {"time": 2323, "text": "But I feel, it feels to me that that's necessary to create a compelling experience."}, {"time": 2328, "text": "Like we humans don't seem to respect anything that doesn't give us some attitude."}, {"time": 2332, "text": "That, or like a mix of mystery and attitude and anger and that threatens us subtly, maybe passive aggressively."}, {"time": 2344, "text": "It seems like we humans, yeah, need that."}, {"time": 2348, "text": "Do you, what are your, is there something, you have thoughts on this?"}, {"time": 2351, "text": "All right, I'll give you two thoughts on this."}, {"time": 2353, "text": "One is, one is, it's, we respond to, you know, someone being assertive, but we also respond to someone being vulnerable."}, {"time": 2366, "text": "So I think robots, my first thought is that robots get shoved around and bullied a lot because they're sort of, you know, tempting and they're sort of showing off or they appear to be showing off."}, {"time": 2375, "text": "And so I think going back to these things we were talking about in the beginning of making robots a little more, a little more expressive, a little bit more like, eh, that wasn't cool to do."}, {"time": 2386, "text": "And now I'm bummed, right?"}, {"time": 2389, "text": "I think that that can actually help because people can't help but anthropomorphize and respond to that."}, {"time": 2394, "text": "Even that though, the emotion being communicated is not in any way a real thing."}, {"time": 2398, "text": "And people know that it's not a real thing because they know it's just a machine."}, {"time": 2401, "text": "We're still interpreting, you know, we watch, there's this famous psychology experiment with little triangles and kind of dots on a screen and a triangle is chasing the square and you get really angry at the darn triangle because why is it not leaving the square alone?"}, {"time": 2418, "text": "So that's, yeah, we can't help."}, {"time": 2420, "text": "So that was the first thought."}, {"time": 2421, "text": "The vulnerability, that's really interesting that, I think of like being, pushing back, being assertive as the only mechanism of getting, of forming a connection, of getting respect, but perhaps vulnerability, perhaps there's other mechanisms that are less threatening."}, {"time": 2441, "text": "Well, I think, well, a little bit, yes, but then this other thing that we can think about is, it goes back to what you were saying, that interaction is really game theoretic, right?"}, {"time": 2450, "text": "So the moment you're taking actions in a space, the humans are taking actions in that same space, but you have your own objective, which is, you know, you're a car, you need to get your passenger to the destination."}, {"time": 2460, "text": "And then the human nearby has their own objective, which somewhat overlaps with you, but not entirely."}, {"time": 2467, "text": "You're not interested in getting into an accident with each other, but you have different destinations and you wanna get home faster and they wanna get home faster."}, {"time": 2474, "text": "And that's a general sum game at that point."}, {"time": 2477, "text": "And so that's, I think that's what, treating it as such is kind of a way we can step outside of this kind of mode that, where you try to anticipate what people do and you don't realize you have any influence over it while still protecting yourself because you're understanding that people also understand that they can influence you."}, {"time": 2502, "text": "And it's just kind of back and forth is this negotiation, which is really talking about different equilibria of a game."}, {"time": 2510, "text": "The very basic way to solve coordination is to just make predictions about what people will do and then stay out of their way."}, {"time": 2517, "text": "And that's hard for the reasons we talked about, which is how you have to understand people's intentions implicitly, explicitly, who knows, but somehow you have to get enough of an understanding of that to be able to anticipate what happens next."}, {"time": 2530, "text": "And so that's challenging."}, {"time": 2531, "text": "But then it's further challenged by the fact that people change what they do based on what you do because they don't plan in isolation either, right?"}, {"time": 2541, "text": "So when you see cars trying to merge on a highway and not succeeding, one of the reasons this can be is because they look at traffic that keeps coming, they predict what these people are planning on doing, which is to just keep going, and then they stay out of the way because there's no feasible plan, right?"}, {"time": 2562, "text": "Any plan would actually intersect with one of these other people."}, {"time": 2566, "text": "So that's bad, so you get stuck there."}, {"time": 2569, "text": "So now kind of if you start thinking about it as no, no, no, actually these people change what they do depending on what the car does."}, {"time": 2579, "text": "Like if the car actually tries to kind of inch itself forward, they might actually slow down and let the car in."}, {"time": 2587, "text": "And now taking advantage of that, well, that's kind of the next level."}, {"time": 2593, "text": "We call this like this underactuated system idea where it's kind of underactuated system robotics, but it's kind of, you're influenced these other degrees of freedom, but you don't get to decide what they do."}, {"time": 2605, "text": "I've somewhere seen you mention it, the human element in this picture as underactuated."}, {"time": 2612, "text": "So you understand underactuated robotics is that you can't fully control the system."}, {"time": 2621, "text": "You can't go in arbitrary directions in the configuration space."}, {"time": 2624, "text": "Under your control."}, {"time": 2626, "text": "Yeah, it's a very simple way of underactuation where basically there's literally these degrees of freedom that you can control, and these degrees of freedom that you can't, but you influence them."}, {"time": 2634, "text": "And I think that's the important part is that they don't do whatever, regardless of what you do, that what you do influences what they end up doing."}, {"time": 2642, "text": "I just also like the poetry of calling human robot interaction an underactuated robotics problem."}, {"time": 2649, "text": "And you also mentioned sort of nudging."}, {"time": 2651, "text": "It seems that they're, I don't know."}, {"time": 2654, "text": "I think about this a lot in the case of pedestrians I've collected hundreds of hours of videos."}, {"time": 2658, "text": "I like to just watch pedestrians."}, {"time": 2661, "text": "And it seems that."}, {"time": 2662, "text": "It's a funny hobby."}, {"time": 2664, "text": "Yeah, it's weird."}, {"time": 2665, "text": "Cause I learn a lot."}, {"time": 2667, "text": "I learned a lot about myself, about our human behavior, from watching pedestrians, watching people in their environment."}, {"time": 2675, "text": "Basically crossing the street is like you're putting your life on the line."}, {"time": 2681, "text": "I don't know, tens of millions of time in America every day is people are just like playing this weird game of chicken when they cross the street, especially when there's some ambiguity about the right of way."}, {"time": 2694, "text": "That has to do either with the rules of the road or with the general personality of the intersection based on the time of day and so on."}, {"time": 2702, "text": "And this nudging idea, it seems that people don't even nudge."}, {"time": 2707, "text": "They just aggressively take, make a decision."}, {"time": 2710, "text": "Somebody, there's a runner that gave me this advice."}, {"time": 2714, "text": "I sometimes run in the street, not in the street, on the sidewalk."}, {"time": 2718, "text": "And he said that if you don't make eye contact with people when you're running, they will all move out of your way."}, {"time": 2725, "text": "It's called civil inattention."}, {"time": 2727, "text": "Civil inattention, that's a thing."}, {"time": 2729, "text": "Oh wow, I need to look this up, but it works."}, {"time": 2732, "text": "My sense was if you communicate like confidence in your actions that you're unlikely to deviate from the action that you're following, that's a really powerful signal to others that they need to plan around your actions."}, {"time": 2747, "text": "As opposed to nudging where you're sort of hesitantly, then the hesitation might communicate that you're still in the dance and the game that they can influence with their own actions."}, {"time": 2759, "text": "I've recently had a conversation with Jim Keller, who's a sort of this legendary chip architect, but he also led the autopilot team for a while."}, {"time": 2772, "text": "And his intuition that driving is fundamentally still like a ballistics problem."}, {"time": 2778, "text": "Like you can ignore the human element that is just not hitting things."}, {"time": 2784, "text": "And you can kind of learn the right dynamics required to do the merger and all those kinds of things."}, {"time": 2789, "text": "And then my sense is, and I don't know if I can provide sort of definitive proof of this, but my sense is like an order of magnitude are more difficult when humans are involved."}, {"time": 2801, "text": "Like it's not simply object collision avoidance problem."}, {"time": 2808, "text": "Where does your intuition, of course, nobody knows the right answer here, but where does your intuition fall on the difficulty, fundamental difficulty of the driving problem when humans are involved?"}, {"time": 2820, "text": "I have many opinions on this."}, {"time": 2823, "text": "Imagine downtown San Francisco."}, {"time": 2827, "text": "Yeah, it's crazy, busy, everything."}, {"time": 2830, "text": "Okay, now take all the humans out."}, {"time": 2832, "text": "No pedestrians, no human driven vehicles, no cyclists, no people on little electric scooters zipping around, nothing."}, {"time": 2839, "text": "I think we're done."}, {"time": 2841, "text": "I think driving at that point is done."}, {"time": 2845, "text": "There's nothing really that still needs to be solved about that."}, {"time": 2848, "text": "Well, let's pause there."}, {"time": 2850, "text": "I think I agree with you and I think a lot of people that will hear will agree with that, but we need to sort of internalize that idea."}, {"time": 2861, "text": "So what's the problem there?"}, {"time": 2862, "text": "Cause we might not quite yet be done with that."}, {"time": 2865, "text": "Cause a lot of people kind of focus on the perception problem."}, {"time": 2868, "text": "A lot of people kind of map autonomous driving into how close are we to solving, being able to detect all the, you know, the drivable area, the objects in the scene."}, {"time": 2882, "text": "Do you see that as a, how hard is that problem?"}, {"time": 2887, "text": "So your intuition there behind your statement was we might have not solved it yet, but we're close to solving basically the perception problem."}, {"time": 2894, "text": "I think the perception problem, I mean, and by the way, a bunch of years ago, this would not have been true."}, {"time": 2901, "text": "And a lot of issues in the space were coming from the fact that, oh, we don't really, you know, we don't know what's where."}, {"time": 2909, "text": "But I think it's fairly safe to say that at this point, although you could always improve on things and all of that, you can drive through downtown San Francisco if there are no people around."}, {"time": 2920, "text": "There's no really perception issues standing in your way there."}, {"time": 2924, "text": "I think perception is hard, but yeah, it's, we've made a lot of progress on the perception, so I had to undermine the difficulty of the problem."}, {"time": 2930, "text": "I think everything about robotics is really difficult, of course, I think that, you know, the planning problem, the control problem, all very difficult, but I think what's, what makes it really kind of, yeah."}, {"time": 2943, "text": "It might be, I mean, you know, and I picked downtown San Francisco, it's adapting to, well, now it's snowing, now it's no longer snowing, now it's slippery in this way, now it's the dynamics part could, I could imagine being still somewhat challenging, but."}, {"time": 2964, "text": "No, the thing that I think worries us, and our intuition's not good there, is the perception problem at the edge cases."}, {"time": 2971, "text": "Sort of downtown San Francisco, the nice thing, it's not actually, it may not be a good example because."}, {"time": 2979, "text": "Because you know what you're getting from, well, there's like crazy construction zones and all of that."}, {"time": 2983, "text": "Yeah, but the thing is, you're traveling at slow speeds, so like it doesn't feel dangerous."}, {"time": 2987, "text": "To me, what feels dangerous is highway speeds, when everything is, to us humans, super clear."}, {"time": 2994, "text": "Yeah, I'm assuming LiDAR here, by the way."}, {"time": 2997, "text": "I think it's kind of irresponsible to not use LiDAR."}, {"time": 2999, "text": "That's just my personal opinion."}, {"time": 3002, "text": "That's, I mean, depending on your use case, but I think like, you know, if you have the opportunity to use LiDAR, in a lot of cases, you might not."}, {"time": 3011, "text": "Good, your intuition makes more sense now."}, {"time": 3013, "text": "So you don't think vision."}, {"time": 3015, "text": "I really just don't know enough to say, well, vision alone, what, you know, what's like, there's a lot of, how many cameras do you have?"}, {"time": 3024, "text": "Is it, how are you using them?"}, {"time": 3025, "text": "There's details."}, {"time": 3026, "text": "There's all, there's all sorts of details."}, {"time": 3028, "text": "I imagine there's stuff that's really hard to actually see, you know, how do you deal with glare, exactly what you were saying, stuff that people would see that you don't."}, {"time": 3037, "text": "I think I have, more of my intuition comes from systems that can actually use LiDAR as well."}, {"time": 3044, "text": "Yeah, and until we know for sure, it makes sense to be using LiDAR."}, {"time": 3048, "text": "That's kind of the safety focus."}, {"time": 3050, "text": "But then the sort of the, I also sympathize with the Elon Musk statement of LiDAR is a crutch."}, {"time": 3057, "text": "It's a fun notion to think that the things that work today is a crutch for the invention of the things that will work tomorrow, right?"}, {"time": 3069, "text": "Like it, it's kind of true in the sense that if, you know, we want to stick to the comfort zone, you see this in academic and research settings all the time, the things that work force you to not explore outside, think outside the box."}, {"time": 3085, "text": "I mean, that happens all the time."}, {"time": 3086, "text": "The problem is in the safety critical systems, you kind of want to stick with the things that work."}, {"time": 3092, "text": "So it's an interesting and difficult trade off in the case of real world sort of safety critical robotic systems, but so your intuition is, just to clarify, how, I mean, how hard is this human element for, like how hard is driving when this human element is involved?"}, {"time": 3115, "text": "Are we years, decades away from solving it?"}, {"time": 3120, "text": "But perhaps actually the year isn't the thing I'm asking."}, {"time": 3123, "text": "It doesn't matter what the timeline is, but do you think we're, how many breakthroughs are we away from in solving the human robotic interaction problem to get this, to get this right?"}, {"time": 3135, "text": "I think it, in a sense, it really depends."}, {"time": 3140, "text": "I think that, you know, we were talking about how, well, look, it's really hard because anticipate what people do is hard."}, {"time": 3147, "text": "And on top of that, playing the game is hard."}, {"time": 3150, "text": "But I think we sort of have the fundamental, some of the fundamental understanding for that."}, {"time": 3158, "text": "And then you already see that these systems are being deployed in the real world, you know, even driverless."}, {"time": 3167, "text": "Like there's, I think now a few companies that don't have a driver in the car in some small areas."}, {"time": 3175, "text": "I got a chance to, I went to Phoenix and I, I shot a video with Waymo and I needed to get that video out."}, {"time": 3184, "text": "People have been giving me slack, but there's incredible engineering work being done there."}, {"time": 3189, "text": "And it's one of those other seminal moments for me in my life to be able to, it sounds silly, but to be able to drive without a ride, sorry, without a driver in the seat."}, {"time": 3199, "text": "I mean, that was an incredible robotics."}, {"time": 3202, "text": "I was driven by a robot without being able to take over, without being able to take the steering wheel."}, {"time": 3211, "text": "That's a magical, that's a magical moment."}, {"time": 3213, "text": "So in that regard, in those domains, at least for like Waymo, they're solving that human, there's, I mean, they're going, I mean, it felt fast because you're like freaking out at first."}, {"time": 3225, "text": "That was, this is my first experience, but it's going like the speed limit, right?"}, {"time": 3229, "text": "30, 40, whatever it is."}, {"time": 3231, "text": "And there's humans and it deals with them quite well."}, {"time": 3233, "text": "It detects them, it negotiates the intersections, the left turns and all of that."}, {"time": 3238, "text": "So at least in those domains, it's solving them."}, {"time": 3241, "text": "The open question for me is like, how quickly can we expand?"}, {"time": 3246, "text": "You know, that's the, you know, outside of the weather conditions, all of those kinds of things, how quickly can we expand to like cities like San Francisco?"}, {"time": 3254, "text": "Yeah, and I wouldn't say that it's just, you know, now it's just pure engineering and it's probably the, I mean, and by the way, I'm speaking kind of very generally here as hypothesizing, but I think that there are successes and yet no one is everywhere out there."}, {"time": 3274, "text": "So that seems to suggest that things can be expanded and can be scaled and we know how to do a lot of things, but there's still probably, you know, new algorithms or modified algorithms that you still need to put in there as you learn more and more about new challenges that you get faced with."}, {"time": 3295, "text": "How much of this problem do you think can be learned through end to end?"}, {"time": 3299, "text": "Is it the success of machine learning and reinforcement learning?"}, {"time": 3302, "text": "How much of it can be learned from sort of data from scratch and how much, which most of the success of autonomous vehicle systems have a lot of heuristics and rule based stuff on top, like human expertise injected forced into the system to make it work."}, {"time": 3322, "text": "How much, what will be the role of learning in the near term and long term?"}, {"time": 3328, "text": "I think on the one hand that learning is inevitable here, right?"}, {"time": 3337, "text": "I think on the other hand that when people characterize the problem as it's a bunch of rules that some people wrote down, versus it's an end to end RL system or imitation learning, then maybe there's kind of something missing from maybe that's more."}, {"time": 3357, "text": "So for instance, I think a very, very useful tool in this sort of problem, both in how to generate the car's behavior and robots in general and how to model human beings is actually planning, search optimization, right?"}, {"time": 3375, "text": "So robotics is the sequential decision making problem."}, {"time": 3378, "text": "And when a robot can figure out on its own how to achieve its goal without hitting stuff and all that stuff, right?"}, {"time": 3390, "text": "All the good stuff for motion planning 101, I think of that as very much AI, not this is some rule or something."}, {"time": 3398, "text": "There's nothing rule based around that, right?"}, {"time": 3400, "text": "It's just you're searching through a space and figuring out are you optimizing through a space and figure out what seems to be the right thing to do."}, {"time": 3407, "text": "And I think it's hard to just do that because you need to learn models of the world."}, {"time": 3412, "text": "And I think it's hard to just do the learning part where you don't bother with any of that, because then you're saying, well, I could do imitation, but then when I go off distribution, I'm really screwed."}, {"time": 3424, "text": "Or you can say, I can do reinforcement learning, which adds a lot of robustness, but then you have to do either reinforcement learning in the real world, which sounds a little challenging or that trial and error, you know, or you have to do reinforcement learning in simulation."}, {"time": 3441, "text": "And then that means, well, guess what?"}, {"time": 3443, "text": "You need to model things, at least to model people, model the world enough that whatever policy you get of that is actually fine to roll out in the world and do some additional learning there."}, {"time": 3456, "text": "Do you think simulation, by the way, just a quick tangent has a role in the human robot interaction space?"}, {"time": 3464, "text": "Like, is it useful?"}, {"time": 3466, "text": "It seems like humans, everything we've been talking about are difficult to model and simulate."}, {"time": 3471, "text": "Do you think simulation has a role in this space?"}, {"time": 3474, "text": "I think so because you can take models and train with them ahead of time, for instance."}, {"time": 3486, "text": "But the models, sorry to interrupt, the models are sort of human constructed or learned?"}, {"time": 3490, "text": "I think they have to be a combination because if you get some human data and then you say, this is how, this is gonna be my model of the person."}, {"time": 3502, "text": "What are for simulation and training or for just deployment time?"}, {"time": 3505, "text": "And that's what I'm planning with as my model of how people work."}, {"time": 3509, "text": "Regardless, if you take some data and you don't assume anything else and you just say, okay, this is some data that I've collected."}, {"time": 3519, "text": "Let me fit a policy to how people work based on that."}, {"time": 3522, "text": "What tends to happen is you collected some data and some distribution, and then now your robot sort of computes a best response to that, right?"}, {"time": 3532, "text": "It's sort of like, what should I do if this is how people work?"}, {"time": 3536, "text": "And easily goes off of distribution where that model that you've built of the human completely sucks because out of distribution, you have no idea, right?"}, {"time": 3545, "text": "If you think of all the possible policies and then you take only the ones that are consistent with the human data that you've observed, that still leads a lot of, a lot of things could happen outside of that distribution where you're confident then you know what's going on."}, {"time": 3559, "text": "By the way, that's, I mean, I've gotten used to this terminology of not a distribution, but it's such a machine learning terminology because it kind of assumes, so distribution is referring to the data that you've seen."}, {"time": 3576, "text": "The set of states that you encounter at training time."}, {"time": 3578, "text": "They've encountered so far at training time."}, {"time": 3580, "text": "But it kind of also implies that there's a nice like statistical model that represents that data."}, {"time": 3587, "text": "So out of distribution feels like, I don't know, it raises to me philosophical questions of how we humans reason out of distribution, reason about things that are completely, we haven't seen before."}, {"time": 3603, "text": "And so, and what we're talking about here is how do we reason about what other people do in situations where we haven't seen them?"}, {"time": 3611, "text": "And somehow we just magically navigate that."}, {"time": 3614, "text": "I can anticipate what will happen in situations that are even novel in many ways."}, {"time": 3621, "text": "And I have a pretty good intuition for, I don't always get it right, but you know, and I might be a little uncertain and so on."}, {"time": 3626, "text": "But I think it's this that if you just rely on data, you know, there's just too many possibilities, there's too many policies out there that fit the data."}, {"time": 3637, "text": "And by the way, it's not just state, it's really kind of history of state, cause to really be able to anticipate what the person will do, it kind of depends on what they've been doing so far, cause that's the information you need to kind of, at least implicitly sort of say, oh, this is the kind of person that this is, this is probably what they're trying to do."}, {"time": 3653, "text": "So anyway, it's like you're trying to map history of states to actions, there's many mappings."}, {"time": 3656, "text": "And history meaning like the last few seconds or the last few minutes or the last few months."}, {"time": 3662, "text": "Who knows, who knows how much you need, right?"}, {"time": 3664, "text": "In terms of if your state is really like the positions of everything or whatnot and velocities, who knows how much you need."}, {"time": 3670, "text": "And then there's so many mappings."}, {"time": 3674, "text": "And so now you're talking about how do you regularize that space?"}, {"time": 3677, "text": "What priors do you impose or what's the inductive bias?"}, {"time": 3681, "text": "So, you know, there's all very related things to think about it."}, {"time": 3685, "text": "Basically, what are assumptions that we should be making such that these models actually generalize outside of the data that we've seen?"}, {"time": 3695, "text": "And now you're talking about, well, I don't know, what can you assume?"}, {"time": 3698, "text": "Maybe you can assume that people like actually have intentions and that's what drives their actions."}, {"time": 3703, "text": "Maybe that's, you know, the right thing to do when you haven't seen data very nearby that tells you otherwise."}, {"time": 3711, "text": "I don't know, it's a very open question."}, {"time": 3713, "text": "Do you think sort of that one of the dreams of artificial intelligence was to solve common sense reasoning, whatever the heck that means."}, {"time": 3722, "text": "Do you think something like common sense reasoning has to be solved in part to be able to solve this dance of human robot interaction, the driving space or human robot interaction in general?"}, {"time": 3734, "text": "Do you have to be able to reason about these kinds of common sense concepts of physics, of, you know, all the things we've been talking about humans, I don't even know how to express them with words, but the basics of human behavior, a fear of death."}, {"time": 3754, "text": "So like, to me, it's really important to encode in some kind of sense, maybe not, maybe it's implicit, but it feels that it's important to explicitly encode the fear of death, that people don't wanna die."}, {"time": 3768, "text": "Because it seems silly, but like the game of chicken that involves with the pedestrian crossing the street is playing with the idea of mortality."}, {"time": 3783, "text": "Like we really don't wanna die."}, {"time": 3784, "text": "It's not just like a negative reward."}, {"time": 3787, "text": "I don't know, it just feels like all these human concepts have to be encoded."}, {"time": 3791, "text": "Do you share that sense or is this a lot simpler than I'm making out to be?"}, {"time": 3795, "text": "I think it might be simpler."}, {"time": 3797, "text": "And I'm the person who likes to complicate things."}, {"time": 3798, "text": "I think it might be simpler than that."}, {"time": 3801, "text": "Because it turns out, for instance, if you say model people in the very, I'll call it traditional, I don't know if it's fair to look at it as a traditional way, but you know, calling people as, okay, they're rational somehow, the utilitarian perspective."}, {"time": 3820, "text": "Well, in that, once you say that, you automatically capture that they have an incentive to keep on being."}, {"time": 3830, "text": "You know, Stuart likes to say, you can't fetch the coffee if you're dead."}, {"time": 3836, "text": "Stuart Russell, by the way."}, {"time": 3841, "text": "So when you're sort of treating agents as having these objectives, these incentives, humans or artificial, you're kind of implicitly modeling that they'd like to stick around so that they can accomplish those goals."}, {"time": 3860, "text": "So I think in a sense, maybe that's what draws me so much to the rationality framework, even though it's so broken, we've been able to, it's been such a useful perspective."}, {"time": 3870, "text": "And like we were talking about earlier, what's the alternative?"}, {"time": 3873, "text": "I give up and go home or, you know, I just use complete black boxes, but then I don't know what to assume out of distribution that come back to this."}, {"time": 3880, "text": "It's just, it's been a very fruitful way to think about the problem in a very more positive way, right?"}, {"time": 3887, "text": "People aren't just crazy."}, {"time": 3889, "text": "Maybe they make more sense than we think."}, {"time": 3891, "text": "But I think we also have to somehow be ready for it to be wrong, be able to detect when these assumptions aren't holding, be all of that stuff."}, {"time": 3902, "text": "Let me ask sort of another small side of this that we've been talking about the pure autonomous driving problem, but there's also relatively successful systems already deployed out there in what you may call like level two autonomy or semi autonomous vehicles, whether that's Tesla Autopilot, work quite a bit with Cadillac SuperGuru system, which has a driver facing camera that detects your state."}, {"time": 3931, "text": "There's a bunch of basically lane centering systems."}, {"time": 3935, "text": "What's your sense about this kind of way of dealing with the human robot interaction problem by having a really dumb robot and relying on the human to help the robot out to keep them both alive?"}, {"time": 3953, "text": "Is that from the research perspective, how difficult is that problem?"}, {"time": 3959, "text": "And from a practical deployment perspective, is that a fruitful way to approach this human robot interaction problem?"}, {"time": 3968, "text": "I think what we have to be careful about there is to not, it seems like some of these systems, not all are making this underlying assumption that if, so I'm a driver and I'm now really not driving, but supervising and my job is to intervene, right?"}, {"time": 3988, "text": "And so we have to be careful with this assumption that when I'm, if I'm supervising, I will be just as safe as when I'm driving."}, {"time": 4001, "text": "That I will, if I wouldn't get into some kind of accident, if I'm driving, I will be able to avoid that accident when I'm supervising too."}, {"time": 4012, "text": "And I think I'm concerned about this assumption from a few perspectives."}, {"time": 4016, "text": "So from a technical perspective, it's that when you let something kind of take control and do its thing, and it depends on what that thing is, obviously, and how much it's taking control and how, what things are you trusting it to do."}, {"time": 4027, "text": "But if you let it do its thing and take control, it will go to what we might call off policy from the person's perspective state."}, {"time": 4036, "text": "So states that the person wouldn't actually find themselves in if they were the ones driving."}, {"time": 4042, "text": "And the assumption that the person functions just as well there as they function in the states that they would normally encounter is a little questionable."}, {"time": 4050, "text": "Now, another part is the kind of the human factor side of this, which is that I don't know about you, but I think I definitely feel like I'm experiencing things very differently when I'm actively engaged in the task versus when I'm a passive observer."}, {"time": 4067, "text": "Like even if I try to stay engaged, right?"}, {"time": 4069, "text": "It's very different than when I'm actually actively making decisions."}, {"time": 4073, "text": "And you see this in life in general."}, {"time": 4075, "text": "Like you see students who are actively trying to come up with the answer, learn this thing better than when they're passively told the answer."}, {"time": 4083, "text": "I think that's somewhat related."}, {"time": 4084, "text": "And I think people have studied this in human factors for airplanes."}, {"time": 4087, "text": "And I think it's actually fairly established that these two are not the same."}, {"time": 4093, "text": "On that point, because I've gotten a huge amount of heat on this and I stand by it."}, {"time": 4098, "text": "Because I know the human factors community well and the work here is really strong."}, {"time": 4104, "text": "And there's many decades of work showing exactly what you're saying."}, {"time": 4108, "text": "Nevertheless, I've been continuously surprised that much of the predictions of that work has been wrong in what I've seen."}, {"time": 4115, "text": "So what we have to do, I still agree with everything you said, but we have to be a little bit more open minded."}, {"time": 4125, "text": "So the, I'll tell you, there's a few surprising things that supervise, like everything you said to the word is actually exactly correct."}, {"time": 4134, "text": "But it doesn't say, what you didn't say is that these systems are, you said you can't assume a bunch of things, but we don't know if these systems are fundamentally unsafe."}, {"time": 4146, "text": "That's still unknown."}, {"time": 4148, "text": "There's a lot of interesting things, like I'm surprised by the fact, not the fact, that what seems to be anecdotally from, well, from large data collection that we've done, but also from just talking to a lot of people, when in the supervisory role of semi autonomous systems that are sufficiently dumb, at least, which is, that might be the key element, is the systems have to be dumb."}, {"time": 4175, "text": "The people are actually more energized as observers."}, {"time": 4178, "text": "So they're actually better, they're better at observing the situation."}, {"time": 4183, "text": "So there might be cases in systems, if you get the interaction right, where you, as a supervisor, will do a better job with the system together."}, {"time": 4193, "text": "I agree, I think that is actually really possible."}, {"time": 4196, "text": "I guess mainly I'm pointing out that if you do it naively, you're implicitly assuming something, that assumption might actually really be wrong."}, {"time": 4204, "text": "But I do think that if you explicitly think about what the agent should do so that the person still stays engaged."}, {"time": 4213, "text": "What the, so that you essentially empower the person to do more than they could, that's really the goal, right?"}, {"time": 4219, "text": "Is you still have a driver, so you wanna empower them to be so much better than they would be by themselves."}, {"time": 4227, "text": "And that's different, it's a very different mindset than I want them to basically not drive, right?"}, {"time": 4233, "text": "And, but be ready to sort of take over."}, {"time": 4240, "text": "So one of the interesting things we've been talking about is the rewards, that they seem to be fundamental too, the way robots behaves."}, {"time": 4249, "text": "So broadly speaking, we've been talking about utility functions and so on, but could you comment on how do we approach the design of reward functions?"}, {"time": 4259, "text": "Like, how do we come up with good reward functions?"}, {"time": 4262, "text": "Well, really good question, because the answer is we don't."}, {"time": 4270, "text": "This was, you know, I used to think, I used to think about how, well, it's actually really hard to specify rewards for interaction because it's really supposed to be what the people want, and then you really, you know, we talked about how you have to customize what you wanna do to the end user."}, {"time": 4290, "text": "But I kind of realized that even if you take the interactive component away, it's still really hard to design reward functions."}, {"time": 4338, "text": "So I do motion planning on my robot arm, I specify some cost function like, you know, this is how far away you should try to stay, so much it matters to stay away from people, and this is how much it matters to be able to be efficient and blah, blah, blah, right?"}, {"time": 4353, "text": "I need to make sure that whatever I specified, those constraints or trade offs or whatever they are, that when the robot goes and solves that problem in every new situation, that behavior is the behavior that I wanna see."}, {"time": 4367, "text": "And what I've been finding is that we have no idea how to do that."}, {"time": 4428, "text": "And so I think this is a lesson that I don't know, kind of, I guess I close my eyes to it for a while cause I've been, you know, tuning cost functions for 10 years now, but it's really strikes me that, yeah, we've moved the tuning and the like designing of features or whatever from the behavior side into the reward side."}, {"time": 4459, "text": "And yes, I agree that there's way less of it, but it still seems really hard to anticipate any possible situation and make sure you specify a reward function that when optimized will work well in every possible situation."}, {"time": 4475, "text": "So you're kind of referring to unintended consequences or just in general, any kind of suboptimal behavior that emerges outside of the things you said, out of distribution."}, {"time": 4486, "text": "Suboptimal behavior that is, you know, actually optimal."}, {"time": 4489, "text": "I mean, this, I guess the idea of unintended consequences, you know, it's optimal respect to what you specified, but it's not what you want."}, {"time": 4495, "text": "And there's a difference between those."}, {"time": 4497, "text": "But that's not fundamentally a robotics problem, right?"}, {"time": 4499, "text": "That's a human problem."}, {"time": 4501, "text": "That's the thing, right?"}, {"time": 4503, "text": "So there's this thing called Goodhart's law, which is you set a metric for an organization and the moment it becomes a target that people actually optimize for, it's no longer a good metric."}, {"time": 4515, "text": "What's it called?"}, {"time": 4517, "text": "So the moment you specify a metric, it stops doing its job."}, {"time": 4521, "text": "Yeah, it stops doing its job."}, {"time": 4524, "text": "So there's, yeah, there's such a thing as optimizing for things and, you know, failing to think ahead of time of all the possible things that might be important."}, {"time": 4535, "text": "And so that's, so that's interesting because Historia works a lot on reward learning from the perspective of customizing to the end user, but it really seems like it's not just the interaction with the end user that's a problem of the human and the robot collaborating so that the robot can do what the human wants, right?"}, {"time": 4555, "text": "This kind of back and forth, the robot probing, the person being informative, all of that stuff might be actually just as applicable to this kind of maybe new form of human robot interaction, which is the interaction between the robot and the expert programmer, roboticist designer in charge of actually specifying what the heck the robot should do, specifying the task for the robot."}, {"time": 4581, "text": "That's so cool, like collaborating on the reward design."}, {"time": 4583, "text": "Right, collaborating on the reward design."}, {"time": 4586, "text": "And so what does it mean, right?"}, {"time": 4588, "text": "What does it, when we think about the problem, not as someone specifies all of your job is to optimize, and we start thinking about you're in this interaction and this collaboration."}, {"time": 4599, "text": "And the first thing that comes up is when the person specifies a reward, it's not, you know, gospel, it's not like the letter of the law."}, {"time": 4608, "text": "It's not the definition of the reward function you should be optimizing, because they're doing their best, but they're not some magic perfect oracle."}, {"time": 4617, "text": "And the sooner we start understanding that, I think the sooner we'll get to more robust robots that function better in different situations."}, {"time": 4626, "text": "And then you have kind of say, okay, well, it's almost like robots are over learning, over putting too much weight on the reward specified by definition, and maybe leaving a lot of other information on the table, like what are other things we could do to actually communicate to the robot about what we want them to do besides attempting to specify a reward function."}, {"time": 4649, "text": "Yeah, you have this awesome, and again, I love the poetry of it, of leaked information."}, {"time": 4654, "text": "So you mentioned humans leak information about what they want, you know, leak reward signal for the robot."}, {"time": 4664, "text": "So how do we detect these leaks?"}, {"time": 4668, "text": "Yeah, what are these leaks?"}, {"time": 4669, "text": "Whether it just, I don't know, those were just recently saw it, read it, I don't know where from you, and it's gonna stick with me for a while for some reason, because it's not explicitly expressed."}, {"time": 4680, "text": "It kind of leaks indirectly from our behavior."}, {"time": 4684, "text": "From what we do, yeah, absolutely."}, {"time": 4686, "text": "So I think maybe some surprising bits, right?"}, {"time": 4691, "text": "So we were talking before about, I'm a robot arm, it needs to move around people, carry stuff, put stuff away, all of that."}, {"time": 4700, "text": "And now imagine that, you know, the robot has some initial objective that the programmer gave it so they can do all these things functionally."}, {"time": 4710, "text": "It's capable of doing that."}, {"time": 4712, "text": "And now I noticed that it's doing something and maybe it's coming too close to me, right?"}, {"time": 4719, "text": "And maybe I'm the designer, maybe I'm the end user and this robot is now in my home."}, {"time": 4723, "text": "And I push it away."}, {"time": 4727, "text": "So I push away because, you know, it's a reaction to what the robot is currently doing."}, {"time": 4732, "text": "And this is what we call physical human robot interaction."}, {"time": 4735, "text": "And now there's a lot of interesting work on how the heck do you respond to physical human robot interaction?"}, {"time": 4741, "text": "What should the robot do if such an event occurs?"}, {"time": 4743, "text": "And there's sort of different schools of thought."}, {"time": 4745, "text": "Well, you know, you can sort of treat it the control theoretic way and say, this is a disturbance that you must reject."}, {"time": 4751, "text": "You can sort of treat it more kind of heuristically and say, I'm gonna go into some like gravity compensation mode so that I'm easily maneuverable around."}, {"time": 4759, "text": "I'm gonna go in the direction that the person pushed me."}, {"time": 4762, "text": "And to us, part of realization has been that that is signal that communicates about the reward."}, {"time": 4770, "text": "Because if my robot was moving in an optimal way and I intervened, that means that I disagree with his notion of optimality, right?"}, {"time": 4780, "text": "Whatever it thinks is optimal is not actually optimal."}, {"time": 4783, "text": "And sort of optimization problems aside, that means that the cost function, the reward function is incorrect, or at least is not what I want it to be."}, {"time": 4793, "text": "How difficult is that signal to interpret and make actionable?"}, {"time": 4799, "text": "So like, cause this connects to our autonomous vehicle discussion where they're in the semi autonomous vehicle or autonomous vehicle when a safety driver disengages the car, like, but they could have disengaged it for a million reasons."}, {"time": 4811, "text": "Yeah, so that's true."}, {"time": 4815, "text": "Again, it comes back to, can you structure a little bit your assumptions about how human behavior relates to what they want?"}, {"time": 4824, "text": "And you can, one thing that we've done is literally just treated this external torque that they applied as, when you take that and you add it with what the torque the robot was already applying, that overall action is probably relatively optimal in respect to whatever it is that the person wants."}, {"time": 4841, "text": "And then that gives you information about what it is that they want."}, {"time": 4844, "text": "So you can learn that people want you to stay further away from them."}, {"time": 4847, "text": "Now you're right that there might be many things that explain just that one signal and that you might need much more data than that for the person to be able to shape your reward function over time."}, {"time": 4858, "text": "You can also do this info gathering stuff that we were talking about."}, {"time": 4861, "text": "Not that we've done that in that context, just to clarify, but it's definitely something we thought about where you can have the robot start acting in a way, like if there's a bunch of different explanations, right?"}, {"time": 4873, "text": "It moves in a way where it sees if you correct it in some other way or not, and then kind of actually plans its motion so that it can disambiguate and collect information about what you want."}, {"time": 4884, "text": "Anyway, so that's one way, that's kind of sort of leaked information, maybe even more subtle leaked information is if I just press the E stop, right?"}, {"time": 4892, "text": "I just, I'm doing it out of panic because the robot is about to do something bad."}, {"time": 4896, "text": "There's again, information there, right?"}, {"time": 4898, "text": "Okay, the robot should definitely stop, but it should also figure out that whatever it was about to do was not good."}, {"time": 4905, "text": "And in fact, it was so not good that stopping and remaining stopped for a while was a better trajectory for it than whatever it is that it was about to do."}, {"time": 4912, "text": "And that again is information about what are my preferences, what do I want?"}, {"time": 4917, "text": "Speaking of E stops, what are your expert opinions on the three laws of robotics from Isaac Asimov that don't harm humans, obey orders, protect yourself?"}, {"time": 4931, "text": "I mean, it's such a silly notion, but I speak to so many people these days, just regular folks, just, I don't know, my parents and so on about robotics."}, {"time": 4939, "text": "And they kind of operate in that space of, you know, imagining our future with robots and thinking what are the ethical, how do we get that dance right?"}, {"time": 4951, "text": "I know the three laws might be a silly notion, but do you think about like what universal reward functions that might be that we should enforce on the robots of the future?"}, {"time": 4964, "text": "Or is that a little too far out and it doesn't, or is the mechanism that you just described, it shouldn't be three laws, it should be constantly adjusting kind of thing."}, {"time": 4975, "text": "I think it should constantly be adjusting kind of thing."}, {"time": 4977, "text": "You know, the issue with the laws is, I don't even, you know, they're words and I have to write math and have to translate them into math."}, {"time": 4986, "text": "What does it mean to?"}, {"time": 4987, "text": "What does harm mean?"}, {"time": 4988, "text": "What is, it's not math."}, {"time": 4991, "text": "Obey what, right?"}, {"time": 4992, "text": "Cause we just talked about how you try to say what you want, but you don't always get it right."}, {"time": 4999, "text": "And you want these machines to do what you want, not necessarily exactly what you literally, so you don't want them to take you literally."}, {"time": 5006, "text": "You wanna take what you say and interpret it in context."}, {"time": 5011, "text": "And that's what we do with the specified rewards."}, {"time": 5013, "text": "We don't take them literally anymore from the designer."}, {"time": 5016, "text": "We, not we as a community, we as, you know, some members of my group, we, and some of our collaborators like Peter Beal and Stuart Russell, we sort of say, okay, the designer specified this thing, but I'm gonna interpret it not as, this is the universal reward function that I shall always optimize always and forever, but as this is good evidence about what the person wants."}, {"time": 5045, "text": "And I should interpret that evidence in the context of these situations that it was specified for."}, {"time": 5051, "text": "Cause ultimately that's what the designer thought about."}, {"time": 5052, "text": "That's what they had in mind."}, {"time": 5054, "text": "And really them specifying reward function that works for me in all these situations is really kind of telling me that whatever behavior that incentivizes must be good behavior with respect to the thing that I should actually be optimizing for."}, {"time": 5068, "text": "And so now the robot kind of has uncertainty about what it is that it should be, what its reward function is."}, {"time": 5074, "text": "And then there's all these additional signals that we've been finding that it can kind of continually learn from and adapt its understanding of what people want."}, {"time": 5081, "text": "Every time the person corrects it, maybe they demonstrate, maybe they stop, hopefully not, right?"}, {"time": 5088, "text": "One really, really crazy one is the environment itself."}, {"time": 5094, "text": "Like our world, you don't, it's not, you know, you observe our world and the state of it."}, {"time": 5101, "text": "And it's not that you're seeing behavior and you're saying, oh, people are making decisions that are rational, blah, blah, blah."}, {"time": 5107, "text": "It's, but our world is something that we've been acting with according to our preferences."}, {"time": 5114, "text": "So I have this example where like, the robot walks into my home and my shoes are laid down on the floor kind of in a line, right?"}, {"time": 5121, "text": "It took effort to do that."}, {"time": 5123, "text": "So even though the robot doesn't see me doing this, you know, actually aligning the shoes, it should still be able to figure out that I want the shoes aligned because there's no way for them to have magically, you know, be instantiated themselves in that way."}, {"time": 5139, "text": "Someone must have actually taken the time to do that."}, {"time": 5143, "text": "So it must be important."}, {"time": 5144, "text": "So the environment actually tells, the environment is."}, {"time": 5146, "text": "Leaks information."}, {"time": 5148, "text": "It leaks information."}, {"time": 5148, "text": "I mean, the environment is the way it is because humans somehow manipulated it."}, {"time": 5152, "text": "So you have to kind of reverse engineer the narrative that happened to create the environment as it is and that leaks the preference information."}, {"time": 5160, "text": "Yeah, and you have to be careful, right?"}, {"time": 5163, "text": "Because people don't have the bandwidth to do everything."}, {"time": 5166, "text": "So just because, you know, my house is messy doesn't mean that I want it to be messy, right?"}, {"time": 5170, "text": "But that just, you know, I didn't put the effort into that."}, {"time": 5174, "text": "I put the effort into something else."}, {"time": 5176, "text": "So the robot should figure out, well, that something else was more important, but it doesn't mean that, you know, the house being messy is not."}, {"time": 5181, "text": "So it's a little subtle, but yeah, we really think of it."}, {"time": 5184, "text": "The state itself is kind of like a choice that people implicitly made about how they want their world."}, {"time": 5191, "text": "What book or books, technical or fiction or philosophical, when you like look back, you know, life had a big impact, maybe it was a turning point, it was inspiring in some way."}, {"time": 5202, "text": "Maybe we're talking about some silly book that nobody in their right mind would want to read."}, {"time": 5208, "text": "Or maybe it's a book that you would recommend to others to read."}, {"time": 5212, "text": "Or maybe those could be two different recommendations of books that could be useful for people on their journey."}, {"time": 5220, "text": "When I was in, it's kind of a personal story."}, {"time": 5223, "text": "When I was in 12th grade, I got my hands on a PDF copy in Romania of Russell Norvig, AI modern approach."}, {"time": 5234, "text": "I didn't know anything about AI at that point."}, {"time": 5236, "text": "I was, you know, I had watched the movie, The Matrix was my exposure."}, {"time": 5242, "text": "And so I started going through this thing and, you know, you were asking in the beginning, what are, you know, it's math and it's algorithms, what's interesting."}, {"time": 5256, "text": "It was so captivating."}, {"time": 5258, "text": "This notion that you could just have a goal and figure out your way through kind of a messy, complicated situation."}, {"time": 5267, "text": "So what sequence of decisions you should make to autonomously to achieve that goal."}, {"time": 5273, "text": "That was so cool."}, {"time": 5275, "text": "I'm, you know, I'm biased, but that's a cool book to look at."}, {"time": 5280, "text": "You can convert, you know, the goal of intelligence, the process of intelligence and mechanize it."}, {"time": 5286, "text": "I had the same experience."}, {"time": 5287, "text": "I was really interested in psychiatry and trying to understand human behavior."}, {"time": 5291, "text": "And then AI modern approach is like, wait, you can just reduce it all to."}, {"time": 5295, "text": "You can write math about human behavior, right?"}, {"time": 5323, "text": "That's kind of our, you know, that's our signature move."}, {"time": 5326, "text": "We wrote some math and then instead of kind of hand crafting this and that and that and the robot figuring stuff out and isn't that cool."}, {"time": 5333, "text": "And I think that is the same enthusiasm that I got from the robot figured out how to reach that goal in that graph."}, {"time": 5339, "text": "Isn't that cool?"}, {"time": 5342, "text": "So apologize for the romanticized questions, but, and the silly ones, if a doctor gave you five years to live, sort of emphasizing the finiteness of our existence, what would you try to accomplish?"}, {"time": 5360, "text": "It's like my biggest nightmare, by the way."}, {"time": 5362, "text": "I really like living."}, {"time": 5364, "text": "So I'm actually, I really don't like the idea of being told that I'm going to die."}, {"time": 5370, "text": "Sorry to linger on that for a second."}, {"time": 5372, "text": "Do you, I mean, do you meditate or ponder on your mortality or human, the fact that this thing ends, it seems to be a fundamental feature."}, {"time": 5381, "text": "Do you think of it as a feature or a bug too?"}, {"time": 5384, "text": "Is it, you said you don't like the idea of dying, but if I were to give you a choice of living forever, like you're not allowed to die."}, {"time": 5392, "text": "Now I'll say that I want to live forever, but I watched this show."}, {"time": 5395, "text": "It's very silly."}, {"time": 5396, "text": "It's called The Good Place and they reflect a lot on this."}, {"time": 5399, "text": "And you know, the, the moral of the story is that you have to make the afterlife be a finite too."}, {"time": 5405, "text": "Cause otherwise people just kind of, it's like Wally."}, {"time": 5408, "text": "It's like, ah, whatever."}, {"time": 5410, "text": "So, so I think the finiteness helps, but, but yeah, it's just, you know, I don't, I don't, I'm not a religious person."}, {"time": 5418, "text": "I don't think that there's something after."}, {"time": 5421, "text": "And so I think it just ends and you stop existing."}, {"time": 5425, "text": "And I really like existing."}, {"time": 5426, "text": "It's just, it's such a great privilege to exist that, that yeah, it's just, I think that's the scary part."}, {"time": 5435, "text": "I still think that we like existing so much because it ends."}, {"time": 5440, "text": "And that's so sad."}, {"time": 5441, "text": "Like it's so sad to me every time."}, {"time": 5443, "text": "Like I find almost everything about this life beautiful."}, {"time": 5446, "text": "Like the silliest, most mundane things are just beautiful."}, {"time": 5449, "text": "And I think I'm cognizant of the fact that I find it beautiful because it ends like it."}, {"time": 5455, "text": "And it's so, I don't know."}, {"time": 5457, "text": "I don't know how to feel about that."}, {"time": 5459, "text": "I also feel like there's a lesson in there for robotics and AI that is not like the finiteness of things seems to be a fundamental nature of human existence."}, {"time": 5473, "text": "I think some people sort of accuse me of just being Russian and melancholic and romantic or something, but that seems to be a fundamental nature of our existence that should be incorporated in our reward functions."}, {"time": 5488, "text": "But anyway, if you were speaking of reward functions, if you only had five years, what would you try to accomplish?"}, {"time": 5498, "text": "This is the thing."}, {"time": 5501, "text": "I'm thinking about this question and have a pretty joyous moment because I don't know that I would change much."}, {"time": 5509, "text": "I'm trying to make some contributions to how we understand human AI interaction."}, {"time": 5517, "text": "I don't think I would change that."}, {"time": 5520, "text": "Maybe I'll take more trips to the Caribbean or something, but I tried some of that already from time to time."}, {"time": 5528, "text": "So, yeah, I try to do the things that bring me joy and thinking about these things bring me joy is the Marie Kondo thing."}, {"time": 5537, "text": "Don't do stuff that doesn't spark joy."}, {"time": 5539, "text": "For the most part, I do things that spark joy."}, {"time": 5542, "text": "Maybe I'll do less service in the department or something."}, {"time": 5545, "text": "I'm not dealing with admissions anymore."}, {"time": 5550, "text": "But no, I think I have amazing colleagues and amazing students and amazing family and friends and spending time in some balance with all of them is what I do and that's what I'm doing already."}, {"time": 5564, "text": "So, I don't know that I would really change anything."}, {"time": 5567, "text": "So, on the spirit of positiveness, what small act of kindness, if one pops to mind, were you once shown that you will never forget?"}, {"time": 5577, "text": "When I was in high school, my friends, my classmates did some tutoring."}, {"time": 5588, "text": "We were gearing up for our baccalaureate exam and they did some tutoring on, well, some on math, some on whatever."}, {"time": 5595, "text": "I was comfortable enough with some of those subjects, but physics was something that I hadn't focused on in a while."}, {"time": 5602, "text": "And so, they were all working with this one teacher and I started working with that teacher."}, {"time": 5611, "text": "Her name is Nicole Beccano."}, {"time": 5613, "text": "And she was the one who kind of opened up this whole world for me because she sort of told me that I should take the SATs and apply to go to college abroad and do better on my English and all of that."}, {"time": 5631, "text": "And when it came to, well, financially I couldn't, my parents couldn't really afford to do all these things, she started tutoring me on physics for free and on top of that sitting down with me to kind of train me for SATs and all that jazz that she had experience with."}, {"time": 5649, "text": "And obviously that has taken you to be here today, sort of one of the world experts in robotics."}, {"time": 5657, "text": "It's funny those little... For no reason really."}, {"time": 5664, "text": "Just out of karma."}, {"time": 5667, "text": "Wanting to support someone, yeah."}, {"time": 5669, "text": "So, we talked a ton about reward functions."}, {"time": 5673, "text": "Let me talk about the most ridiculous big question."}]}]