[{"title": "Eric Schmidt: Google | Lex Fridman Podcast #8", "id": "hIC9FQpxVwQ", "quotes": [{"time": 304, "text": "What I did not understand was scaling."}, {"time": 308, "text": "I did not understand what would happen when you had 100 million as opposed to 100."}, {"time": 312, "text": "And so the, since then, and I have learned the benefit of scale, I always look for things which are going to scale to platforms, right?"}, {"time": 319, "text": "So mobile phones, Android, all those things."}, {"time": 323, "text": "There are, the world is in numerous, there are many, many people in the world, people really have needs."}, {"time": 328, "text": "They really will use these platforms and you can build big businesses on top of them."}, {"time": 332, "text": "So it's interesting."}, {"time": 333, "text": "So when you see a piece of technology, now you think, what will this technology look like when it's in the hands of a billion people?"}, {"time": 339, "text": "So an example would be that the market is so competitive now that if you can't figure out a way for something to have a million users or a billion users, it probably is not going to be successful because something else will become the general platform and your idea will become a lost idea or a specialized service with relatively few users."}, {"time": 364, "text": "So it's a path to generality."}, {"time": 365, "text": "It's a path to general platform use."}, {"time": 367, "text": "It's a path to broad applicability."}, {"time": 370, "text": "Now there are plenty of good businesses that are tiny."}, {"time": 372, "text": "So luxury goods, for example."}, {"time": 374, "text": "But if you want to have an impact at scale, you have to look for things which are of common value, common pricing, common distribution and solve common problems."}, {"time": 384, "text": "They're problems that everyone has."}, {"time": 386, "text": "And by the way, people have lots of problems."}, {"time": 388, "text": "Information, medicine, health, education and so forth."}, {"time": 391, "text": "Work on those problems."}, {"time": 392, "text": "Like you said, you're a big fan of the middle class."}, {"time": 396, "text": "Because there's so many of them."}, {"time": 397, "text": "There's so many of them."}, {"time": 398, "text": "By definition."}, {"time": 400, "text": "So any product, any thing that has a huge impact and improves their lives is a great business decision and it's just good for society."}, {"time": 408, "text": "And there's nothing wrong with starting off in the high end as long as you have a plan to get to the middle class."}, {"time": 415, "text": "There's nothing wrong with starting with a specialized market in order to learn and to build and to fund things."}, {"time": 421, "text": "So you start with a luxury market to build a general purpose market."}, {"time": 424, "text": "But if you define yourself as only a narrow market, someone else can come along with a general purpose market that can push you to the corner, can restrict the scale of operation, can force you to be a lesser impact than you might be."}, {"time": 437, "text": "So it's very important to think in terms of broad businesses and broad impact."}, {"time": 442, "text": "Even if you start in a little corner somewhere."}, {"time": 446, "text": "So as you look to the 70s but also in the decades to come and you saw computers, did you see them as tools or was there a little element of another entity?"}, {"time": 460, "text": "I remember a quote saying AI began with our dream to create the gods."}, {"time": 466, "text": "Is there a feeling when you wrote that program that you were creating another entity, giving life to something?"}, {"time": 472, "text": "I wish I could say otherwise, but I simply found the technology platforms so exciting."}, {"time": 478, "text": "That's what I was focused on."}, {"time": 480, "text": "I think the majority of the people that I've worked with, and there are a few exceptions, Steve Jobs being an example, really saw this as a great technological play."}, {"time": 489, "text": "I think relatively few of the technical people understood the scale of its impact."}, {"time": 495, "text": "So I used NCP, which is a predecessor to TCPIP."}, {"time": 499, "text": "It just made sense to connect things."}, {"time": 501, "text": "We didn't think of it in terms of the internet and then companies and then Facebook and then Twitter and then politics and so forth."}, {"time": 509, "text": "We never did that build."}, {"time": 510, "text": "We didn't have that vision."}, {"time": 512, "text": "And I think most people, it's a rare person who can see compounding at scale."}, {"time": 518, "text": "Most people can see, if you ask people to predict the future, they'll give you an answer of six to nine months or 12 months, because that's about as far as people can imagine."}, {"time": 527, "text": "But there's an old saying, which actually was attributed to a professor at MIT a long time ago, that we overestimate what can be done in one year and we underestimate what can be done in a decade."}, {"time": 540, "text": "And there's a great deal of evidence that these core platforms at hardware and software take a decade, right?"}, {"time": 547, "text": "So think about self driving cars."}, {"time": 549, "text": "Self driving cars were thought about in the 90s."}, {"time": 552, "text": "There were projects around them."}, {"time": 553, "text": "The first DARPA Grand Challenge was roughly 2004."}, {"time": 557, "text": "So that's roughly 15 years ago."}, {"time": 559, "text": "And today we have self driving cars operating in a city in Arizona, right?"}, {"time": 563, "text": "It's 15 years and we still have a ways to go before they're more generally available."}, {"time": 571, "text": "So you've spoken about the importance, you just talked about predicting into the future."}, {"time": 577, "text": "You've spoken about the importance of thinking five years ahead and having a plan for those five years."}, {"time": 582, "text": "The way to say it is that almost everybody has a one year plan."}, {"time": 587, "text": "Almost no one has a proper five year plan."}, {"time": 590, "text": "And the key thing to having a five year plan is to having a model for what's going to happen under the underlying platforms."}, {"time": 596, "text": "So here's an example."}, {"time": 599, "text": "Moore's Law as we know it, the thing that powered improvements in CPUs has largely halted in its traditional shrinking mechanism because the costs have just gotten so high."}, {"time": 610, "text": "It's getting harder and harder."}, {"time": 612, "text": "But there's plenty of algorithmic improvements and specialized hardware improvements."}, {"time": 616, "text": "So you need to understand the nature of those improvements and where they'll go in order to understand how it will change the platform."}, {"time": 624, "text": "In the area of network connectivity, what are the gains that are gonna be possible in wireless?"}, {"time": 629, "text": "It looks like there's an enormous expansion of wireless connectivity at many different bands."}, {"time": 636, "text": "And that we will primarily, historically I've always thought that we were primarily gonna be using fiber, but now it looks like we're gonna be using fiber plus very powerful high bandwidth sort of short distance connectivity to bridge the last mile."}, {"time": 651, "text": "That's an amazing achievement."}, {"time": 653, "text": "If you know that, then you're gonna build your systems differently."}, {"time": 656, "text": "By the way, those networks have different latency properties, right?"}, {"time": 659, "text": "Because they're more symmetric, the algorithms feel faster for that reason."}, {"time": 664, "text": "And so when you think about whether it's a fiber or just technologies in general, so there's this barber wooden poem or quote that I really like."}, {"time": 675, "text": "It's from the champions of the impossible rather than the slaves of the possible that evolution draws its creative force."}, {"time": 683, "text": "So in predicting the next five years, I'd like to talk about the impossible and the possible."}, {"time": 689, "text": "Well, and again, one of the great things about humanity is that we produce dreamers, right?"}, {"time": 694, "text": "We literally have people who have a vision and a dream."}, {"time": 697, "text": "They are, if you will, disagreeable in the sense that they disagree with the, they disagree with what the sort of zeitgeist is."}, {"time": 705, "text": "They say there is another way."}, {"time": 708, "text": "They have a belief, they have a vision."}, {"time": 710, "text": "If you look at science, science is always marked by such people who went against some conventional wisdom, collected the knowledge at the time and assembled it in a way that produced a powerful platform."}, {"time": 778, "text": "So in Google's case, we're big enough and well enough managed and so forth that we have a pretty good sense of what our revenue will be for the next year or two, at least for a while."}, {"time": 787, "text": "And so we have enough cash generation that we can make bets, and indeed, Google has become alphabet, so the corporation is organized around these bets, and these bets are in areas of fundamental importance to the world, whether it's artificial intelligence, medical technology, self driving cars, connectivity through balloons, on and on and on."}, {"time": 813, "text": "And there's more coming and more coming."}, {"time": 815, "text": "So one way you could express this is that the current business is successful enough that we have the luxury of making bets."}, {"time": 824, "text": "And another one that you could say is that we have the wisdom of being able to see that a corporate structure needs to be created to enhance the likelihood of the success of those bets."}, {"time": 835, "text": "So we essentially turned ourselves into a conglomerate of bets and then this underlying corporation, Google, which is itself innovative."}, {"time": 844, "text": "So in order to pull this off, you have to have a bunch of belief systems, and one of them is that you have to have bottoms up and tops down."}, {"time": 851, "text": "The bottoms up we call 20% time, and the idea is that people can spend 20% of the time whatever they want, and the top down is that our founders in particular have a keen eye on technology and they're reviewing things constantly."}, {"time": 863, "text": "So an example would be they'll hear about an idea or I'll hear about something and it sounds interesting, let's go visit them."}, {"time": 870, "text": "And then let's begin to assemble the pieces to see if that's possible."}, {"time": 874, "text": "And if you do this long enough, you get pretty good at predicting what's likely to work."}, {"time": 879, "text": "So that's a beautiful balance that struck."}, {"time": 882, "text": "Is this something that applies at all scale?"}, {"time": 884, "text": "It seems to be that Sergey, again, 15 years ago, came up with a concept called 10% of the budget should be on things that are unrelated."}, {"time": 898, "text": "It was called 70, 20, 10."}, {"time": 900, "text": "70% of our time on core business, 20% on adjacent business, and 10% on other."}, {"time": 906, "text": "And he proved mathematically, of course he's a brilliant mathematician, that you needed that 10% to make the sum of the growth work."}, {"time": 914, "text": "And it turns out he was right."}, {"time": 918, "text": "So getting into the world of artificial intelligence, you've talked quite extensively and effectively to the impact in the near term, the positive impact of artificial intelligence, whether it's especially machine learning in medical applications and education, and just making information more accessible, right?"}, {"time": 941, "text": "In the AI community, there is a kind of debate."}, {"time": 945, "text": "There's this shroud of uncertainty as we face this new world with artificial intelligence in it."}, {"time": 950, "text": "And there's some people, like Elon Musk, you've disagreed, at least on the degree of emphasis he places on the existential threat of AI."}, {"time": 960, "text": "So I've spoken with Stuart Russell, Max Tegmark, who share Elon Musk's view, and Yoshua Bengio, Steven Pinker, who do not."}, {"time": 969, "text": "And so there's a lot of very smart people who are thinking about this stuff, disagreeing, which is really healthy, of course."}, {"time": 977, "text": "So what do you think is the healthiest way for the AI community to, and really for the general public, to think about AI and the concern of the technology being mismanaged in some kind of way?"}, {"time": 992, "text": "So the source of education for the general public has been robot killer movies."}, {"time": 998, "text": "And Terminator, et cetera."}, {"time": 1000, "text": "And the one thing I can assure you we're not building are those kinds of solutions."}, {"time": 1006, "text": "Furthermore, if they were to show up, someone would notice and unplug them, right?"}, {"time": 1011, "text": "So as exciting as those movies are, and they're great movies, were the killer robots to start, we would find a way to stop them, right?"}, {"time": 1020, "text": "So I'm not concerned about that."}, {"time": 1024, "text": "And much of this has to do with the timeframe of conversation."}, {"time": 1028, "text": "So you can imagine a situation 100 years from now when the human brain is fully understood and the next generation and next generation of brilliant MIT scientists have figured all this out, we're gonna have a large number of ethics questions, right?"}, {"time": 1045, "text": "Around science and thinking and robots and computers and so forth and so on."}, {"time": 1049, "text": "So it depends on the question of the timeframe."}, {"time": 1052, "text": "In the next five to 10 years, we're not facing those questions."}, {"time": 1057, "text": "What we're facing in the next five to 10 years is how do we spread this disruptive technology as broadly as possible to gain the maximum benefit of it?"}, {"time": 1066, "text": "The primary benefits should be in healthcare and in education."}, {"time": 1070, "text": "Healthcare because it's obvious."}, {"time": 1072, "text": "We're all the same even though we somehow believe we're not."}, {"time": 1075, "text": "As a medical matter, the fact that we have big data about our health will save lives, allow us to deal with skin cancer and other cancers, ophthalmological problems."}, {"time": 1085, "text": "There's people working on psychological diseases and so forth using these techniques."}, {"time": 1090, "text": "I can go on and on."}, {"time": 1091, "text": "The promise of AI in medicine is extraordinary."}, {"time": 1095, "text": "There are many, many companies and startups and funds and solutions and we will all live much better for that."}, {"time": 1102, "text": "The same argument in education."}, {"time": 1105, "text": "Can you imagine that for each generation of child and even adult, you have a tutor educator that's AI based, that's not a human but is properly trained, that helps you get smarter, helps you address your language difficulties or your math difficulties or what have you."}, {"time": 1121, "text": "Why don't we focus on those two?"}, {"time": 1123, "text": "The gains societally of making humans smarter and healthier are enormous and those translate for decades and decades and we'll all benefit from them."}, {"time": 1133, "text": "There are people who are working on AI safety, which is the issue that you're describing and there are conversations in the community that should there be such problems, what should the rules be like?"}, {"time": 1144, "text": "Google, for example, has announced its policies with respect to AI safety, which I certainly support and I think most everybody would support and they make sense, right?"}, {"time": 1154, "text": "So it helps guide the research but the killer robots are not arriving this year and they're not even being built."}, {"time": 1162, "text": "And on that line of thinking, you said the time scale."}, {"time": 1166, "text": "In this topic or other topics, have you found it useful on the business side or the intellectual side to think beyond five, 10 years, to think 50 years out?"}, {"time": 1179, "text": "Has it ever been useful or productive?"}, {"time": 1181, "text": "In our industry, there are essentially no examples of 50 year predictions that have been correct."}, {"time": 1188, "text": "Let's review AI, right?"}, {"time": 1190, "text": "AI, which was largely invented here at MIT and a couple of other universities in the 1956, 1957, 1958, the original claims were a decade or two."}, {"time": 1201, "text": "And when I was a PhD student, I studied AI a bit and it entered during my looking at it, a period which is known as AI winter, which went on for about 30 years, which is a whole generation of science, scientists and a whole group of people who didn't make a lot of progress because the algorithms had not improved and the computers had not approved."}, {"time": 1222, "text": "It took some brilliant mathematicians starting with a fellow named Jeff Hinton at Toronto and Montreal who basically invented this deep learning model which empowers us today."}, {"time": 1233, "text": "The seminal work there was 20 years ago and in the last 10 years, it's become popularized."}, {"time": 1239, "text": "So think about the timeframes for that level of discovery."}, {"time": 1243, "text": "It's very hard to predict."}, {"time": 1245, "text": "Many people think that we'll be flying around in the equivalent of flying cars, who knows?"}, {"time": 1251, "text": "My own view, if I wanna go out on a limb, is to say that we know a couple of things about 50 years from now."}, {"time": 1257, "text": "We know that there'll be more people alive."}, {"time": 1260, "text": "We know that we'll have to have platforms that are more sustainable because the earth is limited in the ways we all know and that the kind of platforms that are gonna get built will be consistent with the principles that I've described."}, {"time": 1273, "text": "They will be much more empowering of individuals."}, {"time": 1275, "text": "They'll be much more sensitive to the ecology because they have to be, they just have to be."}, {"time": 1280, "text": "I also think that humans are gonna be a great deal smarter and I think they're gonna be a lot smarter because of the tools that I've discussed with you and of course, people will live longer."}, {"time": 1289, "text": "Life extension is continuing apace."}, {"time": 1292, "text": "A baby born today has a reasonable chance of living to 100, which is pretty exciting."}, {"time": 1297, "text": "It's well past the 21st century, so we better take care of them."}, {"time": 1300, "text": "And you mentioned an interesting statistic on some very large percentage, 60, 70% of people may live in cities."}, {"time": 1308, "text": "Today, more than half the world lives in cities and one of the great stories of humanity in the last 20 years has been the rural to urban migration."}, {"time": 1317, "text": "This has occurred in the United States, it's occurred in Europe, it's occurring in Asia and it's occurring in Africa."}, {"time": 1324, "text": "When people move to cities, the cities get more crowded, but believe it or not, their health gets better, their productivity gets better, their IQ and educational capabilities improve."}, {"time": 1335, "text": "So it's good news that people are moving to cities, but we have to make them livable and safe."}, {"time": 1340, "text": "So you, first of all, you are, but you've also worked with some of the greatest leaders in the history of tech."}, {"time": 1349, "text": "What insights do you draw from the difference in leadership styles of yourself, Steve Jobs, Elon Musk, Larry Page, now the new CEO, Sandra Pichai and others?"}, {"time": 1362, "text": "From the, I would say, calm sages to the mad geniuses."}, {"time": 1367, "text": "One of the things that I learned as a young executive is that there's no single formula for leadership."}, {"time": 1374, "text": "They try to teach one, but that's not how it really works."}, {"time": 1378, "text": "There are people who just understand what they need to do and they need to do it quickly."}, {"time": 1382, "text": "Those people are often entrepreneurs."}, {"time": 1385, "text": "They just know and they move fast."}, {"time": 1387, "text": "There are other people who are systems thinkers and planners, that's more who I am, somewhat more conservative, more thorough in execution, a little bit more risk of risk."}, {"time": 1396, "text": "A little bit more risk averse."}, {"time": 1398, "text": "There's also people who are sort of slightly insane, in the sense that they are emphatic and charismatic and they feel it and they drive it and so forth."}, {"time": 1408, "text": "There's no single formula to success."}, {"time": 1411, "text": "There is one thing that unifies all of the people that you named, which is very high intelligence."}, {"time": 1416, "text": "At the end of the day, the thing that characterizes all of them is that they saw the world quicker, faster, they processed information faster."}, {"time": 1425, "text": "They didn't necessarily make the right decisions all the time, but they were on top of it."}, {"time": 1429, "text": "And the other thing that's interesting about all those people is they all started young."}, {"time": 1434, "text": "So think about Steve Jobs starting Apple roughly at 18 or 19."}, {"time": 1438, "text": "Think about Bill Gates starting at roughly 20, 21."}, {"time": 1441, "text": "Think about by the time they were 30, Mark Zuckerberg, a good example, at 19, 20."}, {"time": 1446, "text": "By the time they were 30, they had 10 years."}, {"time": 1450, "text": "At 30 years old, they had 10 years of experience of dealing with people and products and shipments and the press and business and so forth."}, {"time": 1459, "text": "It's incredible how much experience they had compared to the rest of us who were busy getting our PhDs."}, {"time": 1466, "text": "So we should celebrate these people because they've just had more life experience, right?"}, {"time": 1472, "text": "And that helps inform the judgment."}, {"time": 1474, "text": "At the end of the day, when you're at the top of these organizations, all the easy questions have been dealt with, right?"}, {"time": 1483, "text": "How should we design the buildings?"}, {"time": 1485, "text": "Where should we put the colors on our product?"}, {"time": 1488, "text": "What should the box look like, right?"}, {"time": 1491, "text": "The problems, that's why it's so interesting to be in these rooms, the problems that they face, right, in terms of the way they operate, the way they deal with their employees, their customers, their innovation, are profoundly challenging."}, {"time": 1503, "text": "Each of the companies is demonstrably different culturally."}, {"time": 1509, "text": "They are not, in fact, cut of the same."}, {"time": 1511, "text": "They behave differently based on input."}, {"time": 1514, "text": "Their internal cultures are different."}, {"time": 1515, "text": "Their compensation schemes are different."}, {"time": 1517, "text": "Their values are different."}, {"time": 1519, "text": "So there's proof that diversity works."}, {"time": 1524, "text": "So, so when faced with a tough decision, in need of advice, it's been said that the best thing one can do is to find the best person in the world who can give that advice and find a way to be in a room with them, one on one and ask."}, {"time": 1544, "text": "So here we are, and let me ask in a long winded way, I wrote this down."}, {"time": 1550, "text": "In 1998, there were many good search engines, Lycos, Excite, AltaVista, Infoseek, Ask Jeeves maybe, Yahoo even."}, {"time": 1561, "text": "So Google stepped in and disrupted everything."}, {"time": 1564, "text": "They disrupted the nature of search, the nature of our access to information, the way we discover new knowledge."}, {"time": 1571, "text": "So now it's 2018, actually 20 years later."}, {"time": 1576, "text": "There are many good personal AI assistants, including, of course, the best from Google."}, {"time": 1582, "text": "So you've spoken in medical and education, the impact of such an AI assistant could bring."}, {"time": 1588, "text": "So we arrive at this question."}, {"time": 1590, "text": "So it's a personal one for me, but I hope my situation represents that of many other, as we said, dreamers and the crazy engineers."}, {"time": 1600, "text": "So my whole life, I've dreamed of creating such an AI assistant."}, {"time": 1605, "text": "Every step I've taken has been towards that goal."}, {"time": 1608, "text": "Now I'm a research scientist in human centered AI here at MIT."}, {"time": 1612, "text": "So the next step for me as I sit here, so facing my passion is to do what Larry and Sergey did in 98, this simple startup."}, {"time": 1624, "text": "And so here's my simple question."}, {"time": 1626, "text": "Given the low odds of success, the timing and luck required, the countless other factors that can't be controlled or predicted, which is all the things that Larry and Sergey faced, is there some calculation, some strategy to follow in this step?"}, {"time": 1641, "text": "Or do you simply follow the passion just because there's no other choice?"}, {"time": 1646, "text": "I think the people who are in universities are always trying to study the extraordinarily chaotic nature of innovation and entrepreneurship."}, {"time": 1657, "text": "My answer is that they didn't have that conversation."}, {"time": 1661, "text": "They just did it."}, {"time": 1662, "text": "They sensed a moment when in the case of Google, there was all of this data that needed to be organized and they had a better algorithm."}, {"time": 1671, "text": "They had invented a better way."}, {"time": 1673, "text": "So today with human centered AI, which is your area of research, there must be new approaches."}, {"time": 1680, "text": "It's such a big field."}, {"time": 1682, "text": "There must be new approaches, different from what we and others are doing."}, {"time": 1687, "text": "There must be startups to fund."}, {"time": 1689, "text": "There must be research projects to try."}]}]