[{"title": "Vladimir Vapnik: Predicates, Invariants, and the Essence of Intelligence | Lex Fridman Podcast #71", "id": "bQa7hpUpMzM", "quotes": [{"time": 397, "text": "And that's, I believe, the combination of ideas in way to constructing invariants."}, {"time": 407, "text": "Constructing invariant is intelligence."}, {"time": 409, "text": "But first of all, predicate, if you know, predicate and hopefully then not too much predicate exists."}, {"time": 420, "text": "For example, 31 predicate for human behavior, it is not a lot."}, {"time": 426, "text": "Vladimir Propp used 31, you can even call them predicate, 31 predicates to describe stories, narratives."}, {"time": 437, "text": "Do you think human behavior, how much of human behavior, how much of our world, our universe, all the things that matter in our existence can be summarized in predicates of the kind that Propp was working with?"}, {"time": 452, "text": "I think that we have a lot of form of behavior, but I think that predicate is much less because even in this example, which I gave you yesterday, you saw that predicate can be, one predicate can construct many different invariants depending on your data."}, {"time": 479, "text": "They're applying to different data and they give different invariants."}, {"time": 484, "text": "So, but pure ideas, maybe not so much."}, {"time": 488, "text": "Not so many."}, {"time": 489, "text": "I don't know about that, but my guess, I hope that's why challenge about digit recognition, how much you need."}, {"time": 499, "text": "I think we'll talk about computer vision and 2D images a little bit in your challenge."}, {"time": 504, "text": "That's exactly about intelligence."}, {"time": 506, "text": "That's exactly, that's exactly about, no, that hopes to be exactly about the spirit of intelligence in the simplest possible way."}, {"time": 517, "text": "Yeah, absolutely you should start the simplest way, otherwise you will not be able to do it."}, {"time": 522, "text": "Well, there's an open question whether starting at the MNIST digit recognition is a step towards intelligence or it's an entirely different thing."}, {"time": 532, "text": "I think that to beat records using say 100, 200 times less examples, you need intelligence."}, {"time": 540, "text": "You need intelligence."}, {"time": 541, "text": "So let's, because you use this term and it would be nice, I'd like to ask simple, maybe even dumb questions."}, {"time": 549, "text": "Let's start with a predicate."}, {"time": 552, "text": "In terms of terms and how you think about it, what is a predicate?"}, {"time": 558, "text": "I have a feeling formally they exist, but I believe that predicate for 2D images, one of them is symmetry."}, {"time": 572, "text": "Sorry, sorry to interrupt and pull you back."}, {"time": 576, "text": "At the simplest level, we're not even, we're not being profound currently."}, {"time": 580, "text": "A predicate is a statement of something that is true."}, {"time": 586, "text": "Do you think of predicates as somehow probabilistic in nature or is this binary?"}, {"time": 594, "text": "This is truly constraints of logical statements about the world."}, {"time": 599, "text": "In my definition, the simplest predicate is function."}, {"time": 603, "text": "Function, and you can use this function to make inner product that is predicate."}, {"time": 610, "text": "What's the input and what's the output of the function?"}, {"time": 613, "text": "Input is X, something which is input in reality."}, {"time": 618, "text": "Say if you consider digit recognition, it pixel space input, but it is function which in pixel space, but it can be any function from pixel space and you choose, and I believe that there are several functions which is important for understanding of images."}, {"time": 646, "text": "One of them is symmetry."}, {"time": 648, "text": "It's not so simple construction as I described with the derivative, with all this stuff, but another, I believe, I don't know how many, is how well structurized is picture."}, {"time": 663, "text": "Structurized?"}, {"time": 664, "text": "What do you mean by structurized?"}, {"time": 666, "text": "It is formal definition."}, {"time": 669, "text": "Say something heavy on the left corner, not so heavy in the middle and so on."}, {"time": 677, "text": "You describe in general concept of what you assume."}, {"time": 681, "text": "Concepts, some kind of universal concepts."}, {"time": 685, "text": "Yeah, but I don't know how to formalize this."}, {"time": 689, "text": "So this is the thing."}, {"time": 691, "text": "There's a million ways we can talk about this."}, {"time": 693, "text": "I'll keep bringing it up, but we humans have such concepts when we look at digits, but it's hard to put them, just like you're saying now, it's hard to put them into words."}, {"time": 705, "text": "You know, that is example, when critics in music, trying to describe music, they use predicate and not too many predicate, but in different combination, but they have some special words for describing music and the same should be for images, but maybe there are critics who understand essence of what this image is about."}, {"time": 740, "text": "Do you think there exists critics who can summarize the essence of images, human beings?"}, {"time": 749, "text": "I hope so, yes, but that..."}, {"time": 752, "text": "Explicitly state them on paper."}, {"time": 754, "text": "The fundamental question I'm asking is, do you think there exists a small set of predicates that will summarize images?"}, {"time": 765, "text": "It feels to our mind, like it does, that the concept of what makes a two and a three and a four... No, no, no, it's not on this level."}, {"time": 778, "text": "It should not describe two, three, four."}, {"time": 781, "text": "It describes some construction, which allow you to create invariance."}, {"time": 788, "text": "And invariance, sorry to stick on this, but terminology."}, {"time": 792, "text": "Invariance, it is property of your image."}, {"time": 801, "text": "Say, I can say, looking on my image, it is more or less symmetric."}, {"time": 807, "text": "Looking on my image, it is more or less symmetric, and I can give you value of symmetry, say, level of symmetry, using this function which I gave yesterday."}, {"time": 820, "text": "And you can describe that your image has these characteristics exactly in the way how musical critics describe music."}, {"time": 836, "text": "So, but this is invariant applied to specific data, to specific music, to something."}, {"time": 847, "text": "I strongly believe in this plot ideas that there exists world of predicate and world of reality, and predicate and reality is somehow connected, and you have to know that."}, {"time": 862, "text": "Let's talk about Plato a little bit."}, {"time": 863, "text": "So you draw a line from Plato, to Hegel, to Wigner, to today."}, {"time": 870, "text": "So Plato has forms, the theory of forms."}, {"time": 875, "text": "So there's a world of ideas and a world of things, as you talk about, and there's a connection."}, {"time": 880, "text": "And presumably the world of ideas is very small, and the world of things is arbitrarily big, but they're all what Plato calls them like, it's a shadow."}, {"time": 892, "text": "The real world is a shadow from the world of forms."}, {"time": 895, "text": "Yeah, you have projection of a world of ideas."}, {"time": 898, "text": "Yeah, very poetic."}, {"time": 900, "text": "In reality, you can realize this projection using these invariants because it is projection for own specific examples, which create specific features of specific objects."}, {"time": 914, "text": "So the essence of intelligence is while only being able to observe the world of things, try to come up with a world of ideas."}, {"time": 927, "text": "Like in this music story, intelligent musical critics knows all these words and have a feeling about what they mean."}, {"time": 934, "text": "I feel like that's a contradiction, intelligent music critics."}, {"time": 938, "text": "But I think music is to be enjoyed in all its forms."}, {"time": 947, "text": "The notion of critic, like a food critic."}, {"time": 949, "text": "No, I don't want touch emotion."}, {"time": 951, "text": "That's an interesting question."}, {"time": 953, "text": "Does emotion..."}, {"time": 954, "text": "There's certain elements of the human psychology, of the human experience, which seem to almost contradict intelligence and reason."}, {"time": 964, "text": "Like emotion, like fear, like love, all of those things, are those not connected in any way to the space of ideas?"}, {"time": 978, "text": "I just want to be concentrate on very simple story, on digit recognition."}, {"time": 987, "text": "So you don't think you have to love and fear death in order to recognize digits?"}, {"time": 993, "text": "Because it's so complicated."}, {"time": 996, "text": "It involves a lot of stuff which I never considered."}, {"time": 1001, "text": "But I know about digit recognition."}, {"time": 1004, "text": "And I know that for digit recognition, to get records from small number of observations, you need predicate."}, {"time": 1019, "text": "But not special predicate for this problem."}, {"time": 1023, "text": "But universal predicate, which understand world of images."}, {"time": 1028, "text": "Of visual information."}, {"time": 1029, "text": "Visual, yes."}, {"time": 1031, "text": "But on the first step, they understand, say, world of handwritten digits, or characters, or something simple."}, {"time": 1041, "text": "So like you said, symmetry is an interesting one."}, {"time": 1043, "text": "No, that's what I think one of the predicate is related to symmetry."}, {"time": 1048, "text": "The level of symmetry."}, {"time": 1050, "text": "Okay, degree of symmetry."}, {"time": 1052, "text": "So you think symmetry at the bottom is a universal notion, and there's degrees of a single kind of symmetry, or is there many kinds of symmetries?"}, {"time": 1064, "text": "Many kinds of symmetries."}, {"time": 1066, "text": "There is a symmetry, antisymmetry, say, letter S. So it has vertical antisymmetry."}, {"time": 1078, "text": "And it could be diagonal symmetry, vertical symmetry."}, {"time": 1082, "text": "So when you cut vertically the letter S... Yeah, then the upper part and lower part in different directions."}, {"time": 1096, "text": "Inverted, along the Y axis."}, {"time": 1098, "text": "But that's just like one example of symmetry, right?"}, {"time": 1101, "text": "Isn't there like..."}, {"time": 1101, "text": "Right, but there is a degree of symmetry."}, {"time": 1106, "text": "If you play all this iterative stuff to do tangent distance, whatever I describe, you can have a degree of symmetry."}, {"time": 1120, "text": "And that is what describing reason of image."}, {"time": 1125, "text": "It is the same as you will describe this image."}, {"time": 1133, "text": "Think about digit S, it has antisymmetry."}, {"time": 1137, "text": "Digit three is symmetric."}, {"time": 1140, "text": "More or less, look for symmetry."}, {"time": 1144, "text": "Do you think such concepts like symmetry, predicates like symmetry, is it a hierarchical set of concepts?"}, {"time": 1154, "text": "Or are these independent, distinct predicates that we want to discover as some set of... No, there is an idea of symmetry."}, {"time": 1165, "text": "And you can, this idea of symmetry, make very general."}, {"time": 1174, "text": "Like degree of symmetry."}, {"time": 1177, "text": "If degree of symmetry can be zero, no symmetry at all."}, {"time": 1180, "text": "Or degree of symmetry, say, more or less symmetrical."}, {"time": 1186, "text": "But you have one of these descriptions."}, {"time": 1190, "text": "And symmetry can be different."}, {"time": 1192, "text": "As I told, horizontal, vertical, diagonal, and antisymmetry is also concept of symmetry."}, {"time": 1201, "text": "What about shape in general?"}, {"time": 1203, "text": "I mean, symmetry is a fascinating notion, but... No, no, I'm talking about digit."}, {"time": 1208, "text": "I would like to concentrate on all I would like to know, predicate for digit recognition."}, {"time": 1214, "text": "Yes, but symmetry is not enough for digit recognition, right?"}, {"time": 1219, "text": "It is not necessarily for digit recognition."}, {"time": 1222, "text": "It helps to create invariant, which you can use when you will have examples for digit recognition."}, {"time": 1235, "text": "You have regular problem of digit recognition."}, {"time": 1238, "text": "You have examples of the first class or second class."}, {"time": 1241, "text": "Plus, you know that there exists concept of symmetry."}, {"time": 1245, "text": "And you apply, when you're looking for decision rule, you will apply concept of symmetry, of this level of symmetry, which you estimate from..."}, {"time": 1260, "text": "So let's talk."}, {"time": 1261, "text": "Everything comes from weak convergence."}, {"time": 1266, "text": "What is convergence?"}, {"time": 1267, "text": "What is weak convergence?"}, {"time": 1269, "text": "What is strong convergence?"}, {"time": 1271, "text": "I'm sorry, I'm gonna do this to you."}, {"time": 1273, "text": "What are we converging from and to?"}, {"time": 1276, "text": "You're converging, you would like to have a function."}, {"time": 1280, "text": "The function which, say, indicator function, which indicate your digit five, for example."}, {"time": 1289, "text": "A classification task."}, {"time": 1291, "text": "Let's talk only about classification."}, {"time": 1293, "text": "So classification means you will say whether this is a five or not, or say which of the 10 digits it is."}, {"time": 1302, "text": "I would like to have these functions."}, {"time": 1306, "text": "Then, I have some examples."}, {"time": 1316, "text": "I can consider property of these examples."}, {"time": 1321, "text": "Say, symmetry."}, {"time": 1322, "text": "And I can measure level of symmetry for every digit."}, {"time": 1328, "text": "And then I can take average from my training data."}, {"time": 1336, "text": "And I will consider only functions of conditional probability, which I'm looking for my decision rule."}, {"time": 1347, "text": "Which applying to digits will give me the same average as I observe on training data."}, {"time": 1361, "text": "So, actually, this is different level of description of what you want."}, {"time": 1368, "text": "You want not just, you show not one digit."}, {"time": 1374, "text": "You show, this predicate, show general property of all digits which you have in mind."}, {"time": 1383, "text": "If you have in mind digit three, it gives you property of digit three."}, {"time": 1390, "text": "And you select as admissible set of function, only function, which keeps this property."}, {"time": 1396, "text": "You will not consider other functions."}, {"time": 1400, "text": "So, you immediately looking for smaller subset of function."}, {"time": 1404, "text": "That's what you mean by admissible functions."}, {"time": 1407, "text": "Admissible function, exactly."}, {"time": 1408, "text": "Which is still a pretty large, for the number three, is a large."}, {"time": 1412, "text": "It is pretty large, but if you have one predicate."}, {"time": 1416, "text": "But according to, there is a strong and weak convergence."}, {"time": 1422, "text": "Strong convergence is convergence in function."}, {"time": 1426, "text": "You're looking for the function on one function, and you're looking for another function."}, {"time": 1431, "text": "And square difference from them should be small."}, {"time": 1439, "text": "If you take difference in any points, make a square, make an integral, and it should be small."}, {"time": 1445, "text": "That is convergence in function."}, {"time": 1448, "text": "Suppose you have some function, any function."}, {"time": 1451, "text": "So, I would say, I say that some function converge to this function."}, {"time": 1457, "text": "If integral from square difference between them is small."}, {"time": 1462, "text": "That's the definition of strong convergence."}, {"time": 1464, "text": "That definition of strong convergence."}, {"time": 1465, "text": "Two functions, the integral, the difference, is small."}, {"time": 1468, "text": "Yeah, it is convergence in functions."}, {"time": 1472, "text": "But you have different convergence in functionals."}, {"time": 1476, "text": "You take any function, you take some function, phi, and take inner product, this function, this f function."}, {"time": 1486, "text": "f0 function, which you want to find."}, {"time": 1490, "text": "And that gives you some value."}, {"time": 1492, "text": "So, you say that set of functions converge in inner product to this function, if this value of inner product converge to value f0."}, {"time": 1510, "text": "That is for one phi."}, {"time": 1512, "text": "But weak convergence requires that it converge for any function of Hilbert space."}, {"time": 1520, "text": "If it converge for any function of Hilbert space, then you will say that this is weak convergence."}, {"time": 1528, "text": "You can think that when you take integral, that is integral property of function."}, {"time": 1535, "text": "For example, if you will take sine or cosine, it is coefficient of, say, Fourier expansion."}, {"time": 1545, "text": "So, if it converge for all coefficients of Fourier expansion, so under some condition, it converge to function you're looking for."}, {"time": 1558, "text": "But weak convergence means any property."}, {"time": 1562, "text": "Convergence not point wise, but integral property of function."}, {"time": 1569, "text": "So, weak convergence means integral property of functions."}, {"time": 1573, "text": "When I'm talking about predicate, I would like to formulate which integral properties I would like to have for convergence."}, {"time": 1587, "text": "So, and if I will take one predicated function, which I measure property, if I will use one predicate and say, I will consider only function which give me the same value as this predicate, I selecting set of functions from functions which is admissible in the sense that function which I'm looking for in this set of functions because I checking in training data, it gives the same."}, {"time": 1628, "text": "Yeah, so it always has to be connected to the training data in terms of?"}, {"time": 1632, "text": "Yeah, but property, you can know independent on training data."}, {"time": 1638, "text": "And this guy, prop, says that there is formal property, 31 property."}, {"time": 1645, "text": "A fairy tale, a Russian fairy tale."}, {"time": 1647, "text": "But Russian fairy tale is not so interesting."}, {"time": 1650, "text": "More interesting that people apply this to movies, to theater, to different things."}, {"time": 1658, "text": "And the same works, they're universal."}, {"time": 1661, "text": "Well, so I would argue that there's a little bit of a difference between the kinds of things that were applied to which are essentially stories and digit recognition."}, {"time": 1674, "text": "It is the same story."}, {"time": 1675, "text": "You're saying digits, there's a story within the digit."}, {"time": 1680, "text": "And so but my point is why I hope that it possible to beat record using not 60,000, but say 100 times less."}, {"time": 1693, "text": "Because instead, you will give predicates."}, {"time": 1697, "text": "And you will select your decision not from wide set of functions, but from set of functions which keeps this predicates."}, {"time": 1708, "text": "But predicate is not related just to digit recognition."}, {"time": 1713, "text": "Like in Plato's case."}, {"time": 1717, "text": "Do you think it's possible to automatically discover the predicates?"}, {"time": 1722, "text": "So you basically said that the essence of intelligence is the discovery of good predicates."}, {"time": 1731, "text": "Now, the natural question is that's what Einstein was good at doing in physics."}, {"time": 1739, "text": "Can we make machines do these kinds of discovery of good predicates?"}, {"time": 1744, "text": "Or is this ultimately a human endeavor?"}, {"time": 1749, "text": "I don't think that machine can do."}, {"time": 1751, "text": "Because according to theory about weak convergence, any function from Hilbert space can be predicated."}, {"time": 1763, "text": "So you have infinite number of predicate in upper."}, {"time": 1767, "text": "And before, you don't know which predicate is good and which."}, {"time": 1772, "text": "But whatever prop show and why people call it breakthrough, that there is not too many predicate which cover most of situation happened in the world."}, {"time": 1791, "text": "So there's a sea of predicates."}, {"time": 1794, "text": "And most of the only a small amount are useful for the kinds of things that happen in the world."}, {"time": 1801, "text": "I think that I would say only small part of predicate very useful."}, {"time": 1808, "text": "Useful all of them."}, {"time": 1811, "text": "Only very few are what we should let's call them good predicates."}, {"time": 1815, "text": "Very good predicates."}, {"time": 1818, "text": "So can we linger on it?"}, {"time": 1821, "text": "Why is it hard for a machine to discover good predicates?"}, {"time": 1827, "text": "Even in my talk described how to do predicate."}, {"time": 1830, "text": "How to find new predicate."}, {"time": 1832, "text": "I'm not sure that it is very good."}, {"time": 1834, "text": "What did you propose in your talk?"}, {"time": 1837, "text": "In my talk, I gave example for diabetes."}, {"time": 1842, "text": "Diabetes, yeah."}, {"time": 1843, "text": "When we achieve some percent."}, {"time": 1846, "text": "So then we're looking for area where some sort of predicate, which I formulate, does not keeps invariant."}, {"time": 1863, "text": "So if it doesn't keep, I retrain my data."}, {"time": 1866, "text": "I select only function which keeps this invariant."}, {"time": 1871, "text": "And when I did it, I improved my performance."}, {"time": 1874, "text": "I can looking for this predicate."}, {"time": 1876, "text": "I know technically how to do that."}, {"time": 1879, "text": "And you can, of course, do it using machine."}, {"time": 1885, "text": "But I'm not sure that we will construct the smartest predicate."}, {"time": 1890, "text": "But this is the, allow me to linger on it."}, {"time": 1894, "text": "Because that's the essence."}, {"time": 1896, "text": "That is artificial."}, {"time": 1897, "text": "That's the human level intelligence that we seek is the discovery of these good predicates."}, {"time": 1903, "text": "You've talked about deep learning as a way to, the predicates they use and the functions are mediocre."}, {"time": 1912, "text": "You can find better ones."}, {"time": 1915, "text": "Let's talk about deep learning."}, {"time": 1917, "text": "Sure, let's do it."}, {"time": 1918, "text": "I know only Jan's Likun convolutional network."}, {"time": 1924, "text": "And what else?"}, {"time": 1925, "text": "And it's a very simple convolution."}, {"time": 1927, "text": "There's not much else to know."}, {"time": 1929, "text": "To pixel left and right."}, {"time": 1930, "text": "I can do it like that with one predicate."}, {"time": 1934, "text": "Convolution is a single predicate."}, {"time": 1936, "text": "It's single."}, {"time": 1937, "text": "It's single predicate."}, {"time": 1941, "text": "Yes, but that's it."}, {"time": 1942, "text": "You know exactly."}, {"time": 1943, "text": "You take the derivative for translation and predicate."}, {"time": 1948, "text": "This should be kept."}, {"time": 1951, "text": "So that's a single predicate."}, {"time": 1952, "text": "But humans discovered that one."}, {"time": 1954, "text": "Or at least."}, {"time": 1955, "text": "Not it."}, {"time": 1956, "text": "That is a risk."}, {"time": 1957, "text": "Not too many predicates."}, {"time": 1958, "text": "And that is big story because Jan did it 25 years ago and nothing so clear was added to deep network."}, {"time": 1970, "text": "And then I don't understand why we should talk about deep network instead of talking about piecewise linear functions which keeps this predicate."}, {"time": 1982, "text": "Well, a counter argument is that maybe the amount of predicates necessary to solve general intelligence, say in the space of images, doing efficient recognition of handwritten digits is very small."}, {"time": 2002, "text": "And so we shouldn't be so obsessed about finding."}, {"time": 2006, "text": "We'll find other good predicates like convolution, for example."}, {"time": 2010, "text": "There has been other advancements like if you look at the work with attention, there's intentional mechanisms in especially used in natural language focusing the network's ability to learn at which part of the input to look at."}, {"time": 2027, "text": "The thing is, there's other things besides predicates that are important for the actual engineering mechanism of showing how much you can really do given these predicates."}, {"time": 2042, "text": "I mean, that's essentially the work of deep learning is constructing architectures that are able to be, given the training data, to be able to converge towards a function that can generalize well."}, {"time": 2064, "text": "Yeah, I understand."}, {"time": 2066, "text": "But let's talk not on emotional level, but on a mathematical level."}, {"time": 2071, "text": "You have set of piecewise linear functions."}, {"time": 2076, "text": "It is all possible neural networks."}, {"time": 2082, "text": "It's just piecewise linear functions."}, {"time": 2084, "text": "It's many, many pieces."}, {"time": 2085, "text": "Large number of piecewise linear functions."}, {"time": 2090, "text": "Almost feels like too large."}, {"time": 2091, "text": "It's still simpler than, say, convolution, than reproducing kernel Hilbert space, which have a Hilbert set of functions."}, {"time": 2100, "text": "What's Hilbert space?"}, {"time": 2102, "text": "It's space with infinite number of coordinates, say, or function for expansion, something like that."}, {"time": 2111, "text": "So it's much richer."}, {"time": 2114, "text": "And when I'm talking about closed form solution, I'm talking about this set of function, not piecewise linear set, which is particular case of it is small part."}, {"time": 2131, "text": "So neural networks is a small part of the space of functions you're talking about."}, {"time": 2135, "text": "Say, small set of functions."}, {"time": 2139, "text": "Let me take that."}, {"time": 2140, "text": "But it is fine."}, {"time": 2142, "text": "It is fine."}, {"time": 2142, "text": "I don't want to discuss the small or big."}, {"time": 2146, "text": "You take advantage."}, {"time": 2147, "text": "So you have some set of functions."}, {"time": 2151, "text": "So now, when you're trying to create architecture, you would like to create admissible set of functions, which all your tricks to use not all functions, but some subset of this set of functions."}, {"time": 2167, "text": "Say, when you're introducing convolutional net, it is way to make this subset useful for you."}, {"time": 2176, "text": "But from my point of view, convolutional, it is something you want to keep some invariants, say, translation invariants."}, {"time": 2187, "text": "But now, if you understand this and you cannot explain on the level of ideas what neural network does, you should agree that it is much better to have a set of functions."}, {"time": 2206, "text": "And they say, this set of functions should be admissible."}, {"time": 2211, "text": "It must keep this invariant, this invariant, and that invariant."}, {"time": 2215, "text": "You know that as soon as you incorporate new invariant set of function, because smaller and smaller and smaller."}, {"time": 2222, "text": "But all the invariants are specified by you, the human."}, {"time": 2226, "text": "Yeah, but what I hope that there is a standard predicate, like PROPSHOW, that's what I want to find for digit recognition."}, {"time": 2239, "text": "If we start, it is completely new area, what is intelligence about on the level, starting from Plato's idea, what is world of ideas."}, {"time": 2252, "text": "And I believe that is not too many."}, {"time": 2256, "text": "But it is amusing that mathematicians doing something, a neural network in general function, but people from literature, from art, they use this all the time."}, {"time": 2270, "text": "Invariants saying, it is great how people describe music."}, {"time": 2277, "text": "We should learn from that."}, {"time": 2278, "text": "And something on this level."}, {"time": 2282, "text": "But so why Vladimir Propp, who was just theoretical, who studied theoretical literature, he found that."}, {"time": 2293, "text": "Let me throw that right back at you, because there's a little bit of a, that's less mathematical and more emotional, philosophical, Vladimir Propp."}, {"time": 2302, "text": "I mean, he wasn't doing math."}, {"time": 2306, "text": "And you just said another emotional statement, which is you believe that this Plato world of ideas is small."}, {"time": 2318, "text": "Do you, what's your intuition, though?"}, {"time": 2322, "text": "If we can linger on it."}, {"time": 2324, "text": "You know, it is not just small or big."}, {"time": 2328, "text": "I know exactly."}, {"time": 2330, "text": "Then when I introducing some predicate, I decrease set of functions."}, {"time": 2339, "text": "But my goal to decrease set of function much."}, {"time": 2344, "text": "By as much as possible."}, {"time": 2347, "text": "Good predicate, which does this, then I should choose next predicate, which decrease set as much as possible."}, {"time": 2357, "text": "So set of good predicate, it is such that they decrease this amount of admissible function."}, {"time": 2367, "text": "So if each good predicate significantly reduces the set of admissible functions, that there naturally should not be that many good predicates."}, {"time": 2375, "text": "No, but if you reduce very well the VC dimension of the function, of admissible set of function, it's small."}, {"time": 2386, "text": "And you need not too much training data to do well."}, {"time": 2392, "text": "And VC dimension, by the way, is some measure of capacity of this set of functions."}, {"time": 2399, "text": "Roughly speaking, how many function in this set."}, {"time": 2401, "text": "So you're decreasing, decreasing."}, {"time": 2403, "text": "And it makes easy for you to find function you're looking for."}, {"time": 2410, "text": "But the most important part, to create good admissible set of functions."}, {"time": 2415, "text": "And it probably, there are many ways."}, {"time": 2418, "text": "But the good predicates such that they can do that."}, {"time": 2425, "text": "So for this duck, you should know a little bit about duck."}, {"time": 2430, "text": "Because what are the three fundamental laws of ducks?"}, {"time": 2435, "text": "Looks like a duck, swims like a duck, and quacks like a duck."}, {"time": 2438, "text": "You should know something about ducks to be able to."}, {"time": 2442, "text": "Looks like, say, horse."}, {"time": 2444, "text": "It's also good."}, {"time": 2446, "text": "So it's not, it generalizes from ducks."}, {"time": 2449, "text": "And talk like, and make sound like horse or something."}, {"time": 2454, "text": "And run like horse, and moves like horse."}, {"time": 2457, "text": "It is general, it is general predicate that this applied to duck."}, {"time": 2464, "text": "But for duck, you can say, play chess like duck."}, {"time": 2469, "text": "You cannot say play chess like duck."}, {"time": 2472, "text": "So you're saying you can, but that would not be a good."}, {"time": 2475, "text": "No, you will not reduce a lot of functions."}, {"time": 2478, "text": "You would not do, yeah, you would not reduce the set of functions."}, {"time": 2481, "text": "So you can, the story is formal story, mathematical story."}, {"time": 2486, "text": "Is that you can use any function you want as a predicate."}, {"time": 2491, "text": "But some of them are good, some of them are not, because some of them reduce a lot of functions to admissible set of some of them."}, {"time": 2499, "text": "But the question is, and I'll probably keep asking this question, but how do we find such, what's your intuition?"}, {"time": 2507, "text": "Handwritten recognition."}, {"time": 2509, "text": "How do we find the answer to your challenge?"}, {"time": 2512, "text": "Yeah, I understand it like that."}, {"time": 2515, "text": "I understand what."}, {"time": 2517, "text": "What defined?"}, {"time": 2519, "text": "What it means, I knew predicate."}, {"time": 2522, "text": "Like guy who understand music can say this word, which he described when he listened to music."}, {"time": 2529, "text": "He understand music."}, {"time": 2531, "text": "He use not too many different, oh, you can do like prop."}, {"time": 2535, "text": "You can make collection."}, {"time": 2537, "text": "What he talking about music, about this, about that."}, {"time": 2540, "text": "It's not too many different situation he described."}, {"time": 2544, "text": "Because we mentioned Vladimir prop a bunch."}, {"time": 2546, "text": "Let me just mention, there's a sequence of 31 structural notions that are common in stories."}, {"time": 2556, "text": "And I think."}, {"time": 2557, "text": "You call it units."}, {"time": 2558, "text": "Units."}, {"time": 2559, "text": "And I think they resonate."}, {"time": 2560, "text": "I mean, it starts just to give an example, obsession, a member of the hero's community, a family leaves the security of the home environment."}, {"time": 2568, "text": "Then it goes to the interdiction, a forbidding edict or command is passed upon the hero."}, {"time": 2574, "text": "Don't go there."}, {"time": 2575, "text": "Don't do this."}, {"time": 2576, "text": "The hero is warned against some action."}, {"time": 2578, "text": "Then step three, violation of interdiction."}, {"time": 2585, "text": "Break the rules, break out on your own."}, {"time": 2587, "text": "Then reconnaissance."}, {"time": 2589, "text": "The villain makes an effort to attain knowledge, needing to fulfill their plan, so on."}, {"time": 2593, "text": "It goes on like this, ends in a wedding, number 31."}, {"time": 2599, "text": "Happily ever after."}, {"time": 2600, "text": "No, he just gave description of all situations."}, {"time": 2606, "text": "He understands this world."}, {"time": 2608, "text": "Of folktales."}, {"time": 2609, "text": "Yeah, not folktales, but stories."}, {"time": 2613, "text": "And these stories not in just folktales."}, {"time": 2616, "text": "These stories in detective serials as well."}, {"time": 2620, "text": "And probably in our lives."}, {"time": 2622, "text": "We probably live."}, {"time": 2623, "text": "Read this."}, {"time": 2625, "text": "And then they wrote that this predicate is good for different situation."}, {"time": 2634, "text": "From movie, for theater."}, {"time": 2637, "text": "By the way, there's also criticism, right?"}, {"time": 2640, "text": "There's an other way to interpret narratives from Claude Levi Strauss."}, {"time": 2650, "text": "I am not in this business."}, {"time": 2652, "text": "No, I know, it's theoretical literature, but it's looking at paradigms behind things."}, {"time": 2655, "text": "It's always the discussion, yeah."}, {"time": 2660, "text": "But at least there is units."}, {"time": 2663, "text": "It's not too many units that can describe."}, {"time": 2667, "text": "But this guy probably gives another units."}, {"time": 2670, "text": "Or another way of..."}, {"time": 2671, "text": "Exactly, another set of units."}, {"time": 2674, "text": "Another set of predicates."}, {"time": 2675, "text": "It doesn't matter how."}, {"time": 2677, "text": "But they exist."}, {"time": 2680, "text": "My question is, whether given those units, whether without our human brains to interpret these units, they would still hold as much power as they have."}, {"time": 2693, "text": "Meaning, are those units enough when we give them to an alien species?"}, {"time": 2698, "text": "Let me ask you."}, {"time": 2700, "text": "Do you understand digit images?"}, {"time": 2706, "text": "No, I don't understand."}, {"time": 2708, "text": "When you can recognize these digit images, it means that you understand."}, {"time": 2714, "text": "You understand characters, you understand... No, no, no, no."}, {"time": 2722, "text": "It's the imitation versus understanding question, because I don't understand the mechanism by which I understand."}, {"time": 2730, "text": "I'm not talking about, I'm talking about predicates."}, {"time": 2732, "text": "You understand that it involves symmetry, maybe structure, maybe something else."}, {"time": 2737, "text": "I cannot formulate."}, {"time": 2738, "text": "I just was able to find symmetries, degree of symmetries."}, {"time": 2743, "text": "That's really good."}, {"time": 2744, "text": "So this is a good line."}, {"time": 2747, "text": "I feel like I understand the basic elements of what makes a good hand recognition system my own."}, {"time": 2754, "text": "Like symmetry connects with me."}, {"time": 2756, "text": "It seems like that's a very powerful predicate."}, {"time": 2759, "text": "My question is, is there a lot more going on that we're not able to introspect?"}, {"time": 2764, "text": "Maybe I need to be able to understand a huge amount in the world of ideas, thousands of predicates, millions of predicates in order to do hand recognition."}, {"time": 2783, "text": "So both your hope and your intuition are such that very few predicates are enough."}, {"time": 2788, "text": "You're using digits, you're using examples as well."}, {"time": 2793, "text": "Theory says that if you will use all possible functions from Hilbert space, all possible predicate, you don't need training data."}, {"time": 2809, "text": "You just will have admissible set of function which contain one function."}, {"time": 2817, "text": "So the trade off is when you're not using all predicates, you're only using a few good predicates you need to have some training data."}, {"time": 2826, "text": "The more good predicates you have, the less training data you need."}, {"time": 2830, "text": "That is intelligent."}, {"time": 2833, "text": "Still, okay, I'm gonna keep asking the same dumb question, handwritten recognition to solve the challenge."}, {"time": 2840, "text": "You kind of propose a challenge that says we should be able to get state of the art MNIST error rates by using very few, 60, maybe fewer examples per digit."}, {"time": 2851, "text": "What kind of predicates do you think it will look like?"}, {"time": 2855, "text": "That is the challenge."}, {"time": 2857, "text": "So people who will solve this problem, they will answer."}, {"time": 2861, "text": "Do you think they'll be able to answer it in a human explainable way?"}, {"time": 2867, "text": "They just need to write function, that's it."}, {"time": 2870, "text": "But so can that function be written, I guess, by an automated reasoning system?"}, {"time": 2878, "text": "Whether we're talking about a neural network learning a particular function or another mechanism?"}, {"time": 2885, "text": "No, I'm not against neural network."}, {"time": 2888, "text": "I'm against admissible set of function which create neural network."}, {"time": 2893, "text": "You did it by hand."}, {"time": 2896, "text": "You don't do it by invariance, by predicate, by reason."}, {"time": 2904, "text": "But neural networks can then reverse, do the reverse step of helping you find a function that just, the task of a neural network is to find a disentangled representation, for example, that they call, is to find that one predicate function that's really capture some kind of essence."}, {"time": 2925, "text": "One, not the entire essence, but one very useful essence of this particular visual space."}, {"time": 2933, "text": "Listen, I'm grasping, hoping there's an automated way to find good predicates, right?"}, {"time": 2940, "text": "So the question is what are the mechanisms of finding good predicates, ideas that you think we should pursue?"}, {"time": 2948, "text": "A young grad student listening right now."}, {"time": 2951, "text": "I gave example."}, {"time": 2953, "text": "So find situation where predicate which you're suggesting don't create invariant."}, {"time": 2964, "text": "It's like in physics."}, {"time": 2968, "text": "Find situation where existing theory cannot explain it."}, {"time": 2977, "text": "Find situation where the existing theory can't explain it."}, {"time": 2980, "text": "So you're finding contradictions."}, {"time": 2982, "text": "Find contradiction, and then remove this contradiction."}, {"time": 2986, "text": "But in my case, what means contradiction, you find function which, if you will use this function, you're not keeping invariants."}, {"time": 2996, "text": "This is really the process of discovering contradictions."}, {"time": 3004, "text": "It is like in physics."}, {"time": 3005, "text": "Find situation where you have contradiction for one of the property, for one of the predicate."}, {"time": 3015, "text": "Then include this predicate, making invariants, and solve again this problem."}, {"time": 3020, "text": "Now you don't have contradiction."}, {"time": 3022, "text": "But it is not the best way, probably, I don't know, to looking for predicate."}, {"time": 3031, "text": "That's just one way, okay."}, {"time": 3033, "text": "That, no, no, it is brute force way."}, {"time": 3035, "text": "The brute force way."}, {"time": 3037, "text": "What about the ideas of what, big umbrella term of symbolic AI?"}, {"time": 3045, "text": "There's what in the 80s with expert systems, sort of logic reasoning based systems."}, {"time": 3052, "text": "Is there hope there to find some, through sort of deductive reasoning, to find good predicates?"}, {"time": 3068, "text": "I think that just logic is not enough."}, {"time": 3072, "text": "It's kind of a compelling notion, though."}, {"time": 3074, "text": "You know, that when smart people sit in a room and reason through things, it seems compelling."}, {"time": 3080, "text": "And making our machines do the same is also compelling."}, {"time": 3084, "text": "So, everything is very simple."}, {"time": 3089, "text": "When you have infinite number of predicate, you can choose the function you want."}, {"time": 3098, "text": "You have invariants and you can choose the function you want."}, {"time": 3101, "text": "But you have to have not too many invariants to solve the problem."}, {"time": 3116, "text": "So, and have from infinite number of function to select finite number and hopefully small number of functions, which is good enough to extract small set of admissible functions."}, {"time": 3137, "text": "So, they will be admissible, it's for sure, because every function just decrease set of function and leaving it admissible."}, {"time": 3145, "text": "But it will be small."}, {"time": 3147, "text": "But why do you think logic based systems don't, can't help, intuition, not?"}, {"time": 3155, "text": "Because you should know reality."}, {"time": 3157, "text": "You should know life."}, {"time": 3159, "text": "This guy like Propp, he knows something."}, {"time": 3164, "text": "And he tried to put in invariant his understanding."}, {"time": 3169, "text": "That's the human, yeah, but see, you're putting too much value into Vladimir Propp knowing something."}, {"time": 3177, "text": "No, it is, in the story, what means you know life?"}, {"time": 3184, "text": "What it means?"}, {"time": 3185, "text": "You know common sense."}, {"time": 3187, "text": "No, no, you know something."}, {"time": 3190, "text": "Common sense, it is some rules."}, {"time": 3194, "text": "Common sense is simply rules?"}, {"time": 3197, "text": "Common sense is every, it's mortality, it's fear of death, it's love, it's spirituality, it's happiness and sadness."}, {"time": 3210, "text": "All of it is tied up into understanding gravity, which is what we think of as common sense."}, {"time": 3216, "text": "I don't really need to discuss so wide."}, {"time": 3219, "text": "I want to discuss, understand digit recognition."}, {"time": 3225, "text": "Anytime I bring up love and death, you bring it back to digit recognition, I like it."}, {"time": 3231, "text": "No, you know, it is durable because there is a challenge."}, {"time": 3236, "text": "Which I see how to solve it."}, {"time": 3239, "text": "If I will have a student concentrate on this work, I will suggest something to solve."}, {"time": 3244, "text": "You mean handwritten record?"}, {"time": 3247, "text": "Yeah, it's a beautifully simple, elegant, and yet."}, {"time": 3250, "text": "I think that I know invariants which will solve this."}, {"time": 3255, "text": "But it is not universal, it is maybe, I want some universal invariants which are good not only for digit recognition, for image understanding."}, {"time": 3268, "text": "So let me ask, how hard do you think is 2D image understanding?"}, {"time": 3278, "text": "So if we, we can kind of intuit handwritten recognition."}, {"time": 3283, "text": "How big of a step, leap, journey is it from that?"}, {"time": 3289, "text": "If I gave you good, if I solved your challenge for handwritten recognition, how long would my journey then be from that to understanding more general, natural images?"}, {"time": 3299, "text": "Immediately, you will understand this as soon as you will make a record."}, {"time": 3305, "text": "Because it is not for free."}, {"time": 3307, "text": "As soon as you will create several invariants which will help you to get the same performance that the best neural net did using 100, there might be more than 100 times less examples, you have to have something smart to do that."}, {"time": 3331, "text": "And you're saying?"}, {"time": 3332, "text": "That is invariant, it is predicate."}, {"time": 3335, "text": "Because you should put some idea how to do that."}, {"time": 3339, "text": "But okay, let me just pause."}, {"time": 3342, "text": "Maybe it's a trivial point, maybe not."}, {"time": 3344, "text": "But handwritten recognition feels like a 2D, two dimensional problem."}, {"time": 3350, "text": "And it seems like how much complicated is the fact that most images are projection of a three dimensional world onto a 2D plane."}, {"time": 3363, "text": "It feels like for a three dimensional world, we need to start understanding common sense in order to understand an image."}, {"time": 3371, "text": "It's no longer visual shape and symmetry."}, {"time": 3377, "text": "It's having to start to understand concepts of, understand life."}, {"time": 3382, "text": "Yeah, you're talking that there are different invariant, different predicate, yeah."}, {"time": 3388, "text": "And potentially much larger number."}, {"time": 3392, "text": "You know, maybe, but let's start from simple."}, {"time": 3396, "text": "Yeah, but you said that it would be immediate."}, {"time": 3398, "text": "No, you know, I cannot think about things which I don't understand."}, {"time": 3403, "text": "This I understand, but I'm sure that I don't understand everything there."}, {"time": 3408, "text": "Yeah, that's the difference."}, {"time": 3410, "text": "Do as simple as possible, but not simpler."}, {"time": 3414, "text": "And that is exact case."}, {"time": 3418, "text": "Yeah, but that's the difference between you and I. I welcome and enjoy thinking about things I completely don't understand."}, {"time": 3429, "text": "Because to me, it's a natural extension without having solved handwritten recognition to wonder how difficult is the next step of understanding 2D, 3D images."}, {"time": 3445, "text": "Because ultimately, while the science of intelligence is fascinating, it's also fascinating to see how that maps to the engineering of intelligence."}, {"time": 3454, "text": "And recognizing handwritten digits is not, doesn't help you, it might, it may not help you with the problem of general intelligence."}, {"time": 3467, "text": "It'll help you a little bit."}, {"time": 3468, "text": "We don't know how much."}, {"time": 3471, "text": "It might very much."}, {"time": 3472, "text": "But I would like to make a remark."}, {"time": 3474, "text": "I start not from very primitive problem, make a challenge problem."}, {"time": 3483, "text": "I start with very general problem, with PLATO."}, {"time": 3487, "text": "So you understand, and it comes from PLATO to digit recognition."}, {"time": 3494, "text": "So you basically took PLATO and the world of forms and ideas and mapped and projected into the clearest, simplest formulation of that big world."}, {"time": 3506, "text": "You know, I would say that I did not understand PLATO until recently, and until I consider the convergence and then predicate, and then, oh, this is what PLATO told."}, {"time": 3526, "text": "Can you linger on that?"}, {"time": 3527, "text": "Like why, how do you think about this world of ideas and world of things in PLATO?"}, {"time": 3532, "text": "No, it is metaphor."}, {"time": 3535, "text": "It's a metaphor, for sure."}, {"time": 3536, "text": "It's a compelling, it's a poetic and a beautiful metaphor."}, {"time": 3539, "text": "But what, can you?"}, {"time": 3540, "text": "But it is a way how you should try to understand how to talk ideas in the world."}, {"time": 3547, "text": "So from my point of view, it is very clear, but it is lying."}, {"time": 3554, "text": "All the time, people looking for that."}, {"time": 3557, "text": "Say, PLATO, then Hegel, whatever reasonable it exists, whatever exists, it is reasonable."}, {"time": 3566, "text": "I don't know what he have in mind reasonable."}, {"time": 3570, "text": "Right, this philosophers again, their words."}, {"time": 3571, "text": "No, no, no, no, no, no, no."}, {"time": 3573, "text": "It is next stop of Wigner."}, {"time": 3577, "text": "That mathematics understand something of reality."}, {"time": 3580, "text": "It is the same PLATO line."}, {"time": 3583, "text": "And then it comes suddenly to Vladimir Propp."}, {"time": 3588, "text": "Look, 31 ideas, 31 units, and this corrects everything."}, {"time": 3594, "text": "There's abstractions, ideas that represent our world."}, {"time": 3599, "text": "Our world, and we should always try to reach into that."}, {"time": 3603, "text": "Yeah, but you should make a projection on reality."}, {"time": 3607, "text": "But understanding is, it is abstract ideas."}, {"time": 3611, "text": "You have in your mind several abstract ideas which you can apply to reality."}, {"time": 3617, "text": "And reality in this case, so if you look at machine learning as data."}, {"time": 3621, "text": "This example, data."}, {"time": 3624, "text": "Okay, let me put this on you because I'm an emotional creature."}, {"time": 3628, "text": "I'm not a mathematical creature like you."}, {"time": 3630, "text": "I find compelling the idea, forget the space, the sea of functions."}, {"time": 3636, "text": "There's also a sea of data in the world."}, {"time": 3639, "text": "And I find compelling that there might be, like you said, teacher, small examples of data that are most useful for discovering good, whether it's predicates or good functions, that the selection of data may be a powerful journey, a useful, you know, coming up with a mechanism for selecting good data might be useful too."}, {"time": 3667, "text": "Do you find this idea of finding the right data set interesting at all?"}, {"time": 3674, "text": "Or do you kind of take the data set as a given?"}, {"time": 3677, "text": "I think that it is, you know, my theme is very simple."}, {"time": 3682, "text": "You have huge set of functions."}, {"time": 3685, "text": "If you will apply, and you have not too many data, if you pick up function which describes this data, you will do not very well."}, {"time": 3701, "text": "You will."}, {"time": 3702, "text": "Like randomly pick up."}, {"time": 3702, "text": "Yeah, you will overfit."}, {"time": 3703, "text": "Yeah, it will be overfitting."}, {"time": 3706, "text": "So you should decrease set of function from which you're picking up one."}, {"time": 3713, "text": "So you should go somehow to admissible set of function."}, {"time": 3719, "text": "And this, what about weak conversions?"}, {"time": 3723, "text": "So, but from another point of view, to make admissible set of function, you need just a DG, just function which you will take in inner product, which you will measure property of your function."}, {"time": 3747, "text": "And that is how it works."}, {"time": 3751, "text": "No, I get it, I get it, I understand it, but do you, the reality is."}, {"time": 3754, "text": "But let's think about examples."}, {"time": 3760, "text": "You have huge set of function, and you have several examples."}, {"time": 3764, "text": "If you just trying to keep, take function which satisfies these examples, you still will overfit."}, {"time": 3776, "text": "You need decrease, you need admissible set of function."}, {"time": 3779, "text": "Absolutely, but what, say you have more data than functions."}, {"time": 3786, "text": "So sort of consider the, I mean, maybe not more data than functions, because that's impossible."}, {"time": 3792, "text": "But what, I was trying to be poetic for a second."}, {"time": 3795, "text": "I mean, you have a huge amount of data, a huge amount of examples."}, {"time": 3799, "text": "But amount of function can be even bigger."}, {"time": 3802, "text": "It can get bigger, I understand."}, {"time": 3804, "text": "Everything is."}, {"time": 3805, "text": "There's always a bigger boat."}, {"time": 3807, "text": "Full Hilbert space."}, {"time": 3809, "text": "I got you, but okay."}, {"time": 3811, "text": "But you don't find the world of data to be an interesting optimization space."}, {"time": 3818, "text": "Like the optimization should be in the space of functions."}, {"time": 3825, "text": "Creating admissible set of functions."}, {"time": 3827, "text": "Admissible set of functions."}, {"time": 3828, "text": "No, you know, even from the classical business theory, from structure risk minimization, you should organize function in the way that they will be useful for you."}, {"time": 3847, "text": "And that is admissible set."}, {"time": 3850, "text": "The way you're thinking about useful is you're given a small set of examples."}, {"time": 3857, "text": "Useful small, small set of function which contain function I'm looking for."}, {"time": 3861, "text": "Yeah, but looking for based on the empirical set of small examples."}, {"time": 3867, "text": "Yeah, but that is another story."}, {"time": 3869, "text": "I don't touch it."}, {"time": 3871, "text": "Because I believe that this small examples is not too small."}, {"time": 3877, "text": "Say 60 per class."}, {"time": 3879, "text": "Law of large numbers works."}, {"time": 3881, "text": "I don't need uniform law."}, {"time": 3883, "text": "The story is that in statistics there are two law."}, {"time": 3886, "text": "Law of large numbers and uniform law of large numbers."}, {"time": 3891, "text": "So I want to be in situation where I use law of large numbers but not uniform law of large numbers."}, {"time": 3898, "text": "Right, so 60 is law of large, it's large enough."}, {"time": 3901, "text": "I hope, no, it still need some evaluations, some bonds."}, {"time": 3907, "text": "But the idea is the following that if you trust that say this average gives you something close to expectations so you can talk about that, about this predicate."}, {"time": 3926, "text": "And that is basis of human intelligence."}, {"time": 3930, "text": "Good predicates is the, the discovery of good predicates is the basis of human intelligence."}, {"time": 3934, "text": "It is discoverer of your understanding world."}, {"time": 3939, "text": "Of your methodology of understanding world."}, {"time": 3945, "text": "Because you have several function which you will apply to reality."}, {"time": 3951, "text": "Can you say that again?"}, {"time": 3952, "text": "So you're... You have several functions predicate."}, {"time": 3958, "text": "But they're abstract."}, {"time": 3961, "text": "Then you will apply them to reality, to your data."}, {"time": 3964, "text": "And you will create in this way predicate."}, {"time": 3967, "text": "Which is useful for your task."}, {"time": 3971, "text": "But predicate are not related specifically to your task."}, {"time": 3976, "text": "To this your task."}, {"time": 3977, "text": "It is abstract functions."}, {"time": 3980, "text": "Which being applying, applied to..."}, {"time": 3983, "text": "Many tasks that you might be interested in."}, {"time": 3985, "text": "It might be many tasks, I don't know."}, {"time": 3987, "text": "Or..."}, {"time": 3988, "text": "Different tasks."}, {"time": 3989, "text": "Well they should be many tasks, right?"}, {"time": 3991, "text": "I believe like, like in prop case."}, {"time": 3995, "text": "It was for fairytales, but it's happened everywhere."}, {"time": 4000, "text": "Okay, so we talked about images a little bit."}, {"time": 4002, "text": "But, can we talk about Noam Chomsky for a second?"}, {"time": 4009, "text": "No, I believe I..."}, {"time": 4012, "text": "I don't know him very well."}, {"time": 4014, "text": "Personally, well... Not personally, I don't know."}, {"time": 4018, "text": "Well let me just say, do you think language, human language, is essential to expressing ideas?"}, {"time": 4025, "text": "As Noam Chomsky believes."}, {"time": 4028, "text": "So like, language is at the core of our formation of predicates."}, {"time": 4033, "text": "The human language."}, {"time": 4034, "text": "For me, language and all the story of language is very complicated."}, {"time": 4040, "text": "I don't understand this."}, {"time": 4042, "text": "And I am not..."}, {"time": 4044, "text": "I thought about... Nobody does."}, {"time": 4046, "text": "I am not ready to work on that."}, {"time": 4048, "text": "Because it's so huge."}, {"time": 4050, "text": "It is not for me, and I believe not for our century."}, {"time": 4055, "text": "The 21st century."}, {"time": 4057, "text": "Not for 21st century."}, {"time": 4059, "text": "You should learn something, a lot of stuff, from simple task like digit recognition."}, {"time": 4065, "text": "So you think, okay, you think digital recognition, 2D image, how would you more abstractly define digit recognition?"}, {"time": 4076, "text": "It's 2D image, symbol recognition, essentially."}, {"time": 4083, "text": "I mean, I'm trying to get a sense, sort of thinking about it now, having worked with MNIST forever, how small of a subset is this of the general vision recognition problem and the general intelligence problem?"}, {"time": 4101, "text": "Is it... Yeah."}, {"time": 4105, "text": "Is it a giant subset?"}, {"time": 4106, "text": "Is it not?"}, {"time": 4107, "text": "And how far away is language?"}, {"time": 4110, "text": "You know, let me refer to Einstein."}, {"time": 4114, "text": "Take the simplest problem, as simple as possible, but not simpler."}, {"time": 4119, "text": "And this is challenge, this simple problem."}, {"time": 4124, "text": "But it's simple by idea, but not simple to get it."}, {"time": 4130, "text": "When you will do this, you will find some predicate, which helps it a bit."}, {"time": 4137, "text": "Well, yeah, I mean, with Einstein, you can, you look at general relativity, but that doesn't help you with quantum mechanics."}, {"time": 4148, "text": "You don't have any universal instrument."}, {"time": 4151, "text": "Yes, so I'm trying to wonder which space we're in, whether handwritten recognition is like general relativity, and then language is like quantum mechanics."}, {"time": 4163, "text": "So you're still gonna have to do a lot of mess to universalize it."}, {"time": 4168, "text": "But I'm trying to see, so what's your intuition why handwritten recognition is easier than language?"}, {"time": 4182, "text": "Just, I think a lot of people would agree with that, but if you could elucidate sort of the intuition of why."}, {"time": 4190, "text": "I don't know, no, I don't think in this direction."}, {"time": 4196, "text": "I just think in directions that this is problem, which if we will solve it well, we will create some abstract understanding of images."}, {"time": 4218, "text": "Maybe not all images."}, {"time": 4219, "text": "I would like to talk to guys who doing in real images in Columbia University."}, {"time": 4226, "text": "What kind of images, unreal?"}, {"time": 4230, "text": "Yeah, what they're ready, is there a predicate, what can be predicate?"}, {"time": 4235, "text": "I still symmetry will play role in real life images, in any real life images, 2D images."}, {"time": 4243, "text": "Let's talk about 2D images."}, {"time": 4246, "text": "Because that's what we know."}, {"time": 4252, "text": "A neural network was created for 2D images."}, {"time": 4255, "text": "So the people I know in vision science, for example, the people who study human vision, that they usually go to the world of symbols and like handwritten recognition, but not really, it's other kinds of symbols to study our visual perception system."}, {"time": 4271, "text": "As far as I know, not much predicate type of thinking is understood about our vision system."}, {"time": 4277, "text": "They did not think in this direction."}, {"time": 4279, "text": "They don't, yeah, but how do you even begin to think in that direction?"}, {"time": 4283, "text": "That's a, I would like to discuss with them."}, {"time": 4287, "text": "Because if we will be able to show that it is what working, and theoretical scheme, it's not so bad."}, {"time": 4300, "text": "So the unfortunate, so if we compare to language, language is like letters, finite set of letters, and a finite set of ways you can put together those letters."}, {"time": 4310, "text": "So it feels more amenable to kind of analysis."}, {"time": 4313, "text": "With natural images, there is so many pixels."}, {"time": 4318, "text": "No, no, no, letter, language is much, much more complicated."}, {"time": 4323, "text": "It's involved a lot of different stuff."}, {"time": 4328, "text": "It's not just understanding of very simple class of tasks."}, {"time": 4335, "text": "I would like to see list of task with language involved."}, {"time": 4339, "text": "Yes, so there's a lot of nice benchmarks now in natural language processing from the very trivial, like understanding the elements of a sentence, to question answering, to much more complicated where you talk about open domain dialogue."}, {"time": 4356, "text": "The natural question is, with handwritten recognition, is really the first step of understanding visual information."}, {"time": 4366, "text": "But even our records show that we go in the wrong direction because we need 60,000 digits."}, {"time": 4376, "text": "So even this first step, so forget about talking about the full journey, this first step should be taking in the right direction."}, {"time": 4383, "text": "No, no, wrong direction because 60,000 is unacceptable."}, {"time": 4387, "text": "No, I'm saying it should be taken in the right direction because 60,000 is not acceptable."}, {"time": 4393, "text": "If you can talk, it's great, we have half percent of error."}, {"time": 4398, "text": "And hopefully the step from doing hand recognition using very few examples, the step towards what babies do when they crawl and understand their physical environment."}, {"time": 4410, "text": "I know you don't know about babies."}, {"time": 4411, "text": "If you will do from very small examples, you will find principles which are different from what we're using now."}, {"time": 4424, "text": "And so it's more or less clear."}, {"time": 4428, "text": "That means that you will use weak convergence, not just strong convergence."}, {"time": 4434, "text": "Do you think these principles will naturally be human interpretable?"}, {"time": 4442, "text": "So like when we'll be able to explain them and have a nice presentation to show what those principles are, or are they very, going to be very kind of abstract kinds of functions?"}, {"time": 4454, "text": "For example, I talked yesterday about symmetry."}, {"time": 4458, "text": "And I gave very simple examples."}, {"time": 4460, "text": "The same will be like that."}, {"time": 4462, "text": "You gave like a predicate of a basic for?"}, {"time": 4464, "text": "For symmetries."}, {"time": 4465, "text": "Yes, for different symmetries and you have for?"}, {"time": 4469, "text": "Degree of symmetries, that is important."}, {"time": 4471, "text": "Not just symmetry."}, {"time": 4473, "text": "Existence doesn't exist, degree of symmetry."}, {"time": 4478, "text": "Yeah, for handwritten recognition."}, {"time": 4481, "text": "No, it's not for handwritten, it's for any images."}, {"time": 4485, "text": "But I would like apply to handwritten."}, {"time": 4487, "text": "Right, in theory it's more general, okay, okay."}, {"time": 4495, "text": "So a lot of the things we've been talking about falls, we've been talking about philosophy a little bit, but also about mathematics and statistics."}, {"time": 4505, "text": "A lot of it falls into this idea, a universal idea of statistical theory of learning."}, {"time": 4511, "text": "What is the most beautiful and sort of powerful or essential idea you've come across, even just for yourself personally in the world of statistics or statistic theory of learning?"}, {"time": 4525, "text": "Probably uniform convergence, which we did with Alexei Chilvonenkis."}, {"time": 4533, "text": "Can you describe universal convergence?"}, {"time": 4536, "text": "You have law of large numbers."}, {"time": 4540, "text": "So for any function, expectation of function, average of function converged to expectation."}, {"time": 4548, "text": "But if you have set of functions, for any function it is true."}, {"time": 4552, "text": "But it should converge simultaneously for all set of functions."}, {"time": 4559, "text": "And for learning, you need uniform convergence."}, {"time": 4566, "text": "Just convergence is not enough."}, {"time": 4571, "text": "Because when you pick up one which gives minimum, you can pick up one function which does not converge and it will give you the best answer for this function."}, {"time": 4591, "text": "So you need uniform convergence to guarantee learning."}, {"time": 4594, "text": "So learning does not rely on trivial law of large numbers, it relies on universal law."}, {"time": 4602, "text": "But idea of convergence exists in statistics for a long time."}, {"time": 4611, "text": "But it is interesting that as I think about myself, how stupid I was 50 years, I did not see weak convergence."}, {"time": 4628, "text": "I work on strong convergence."}, {"time": 4630, "text": "But now I think that most powerful is weak convergence."}, {"time": 4635, "text": "Because it makes admissible set of functions."}, {"time": 4638, "text": "And even in all proverbs, when people try to understand recognition about dog law, looks like a dog and so on, they use weak convergence."}, {"time": 4652, "text": "People in language, they understand this."}, {"time": 4654, "text": "But when we're trying to create artificial intelligence, we want event in different way."}, {"time": 4666, "text": "We just consider strong convergence arguments."}, {"time": 4670, "text": "So reducing the set of admissible functions, you think there should be effort put into understanding the properties of weak convergence?"}, {"time": 4681, "text": "You know, in classical mathematics, in Gilbert space, there are only two ways, two form of convergence, strong and weak."}, {"time": 4694, "text": "Now we can use both."}, {"time": 4696, "text": "That means that we did everything."}, {"time": 4701, "text": "And it so happened that when we use Hilbert space, which is very rich space, space of continuous functions, which has integral and square."}, {"time": 4718, "text": "So we can apply weak and strong convergence for learning and have closed form solution."}, {"time": 4725, "text": "So for computationally simple."}, {"time": 4727, "text": "For me, it is sign that it is right way."}, {"time": 4731, "text": "Because you don't need any heuristic here, just do whatever you want."}, {"time": 4739, "text": "But now the only what left is this concept of what is predicate, but it is not statistics."}, {"time": 4748, "text": "By the way, I like the fact that you think that heuristics are a mess that should be removed from the system."}, {"time": 4754, "text": "So closed form solution is the ultimate goal."}, {"time": 4758, "text": "No, it so happened that when you're using right instrument, you have closed form solution."}, {"time": 4768, "text": "Do you think intelligence, human level intelligence, when we create it, will have something like a closed form solution?"}, {"time": 4782, "text": "You know, now I'm looking on bounds, which I gave bounds for convergence."}, {"time": 4791, "text": "And when I'm looking for bounds, I'm thinking what is the most appropriate kernel for this bound would be."}, {"time": 4802, "text": "So we know that in say, all our businesses, we use radial basis function."}, {"time": 4811, "text": "But looking on the bound, I think that I start to understand that maybe we need to make corrections to radial basis function to be closer to work better for this bounds."}, {"time": 4828, "text": "So I'm again trying to understand what type of kernel have best approximation, best fit to this bound."}, {"time": 4843, "text": "Sure, so there's a lot of interesting work that could be done in discovering better functions than radial basis functions for bounds you find."}, {"time": 4853, "text": "It still comes from, you're looking to mass and trying to understand what."}, {"time": 4860, "text": "From your own mind, looking at the, I don't know."}, {"time": 4863, "text": "Then I'm trying to understand what will be good for that."}, {"time": 4871, "text": "Yeah, but to me, there's still a beauty."}, {"time": 4874, "text": "Again, maybe I'm a descendant of Alan Turing to heuristics."}, {"time": 4877, "text": "To me, ultimately, intelligence will be a mess of heuristics."}, {"time": 4883, "text": "And that's the engineering answer, I guess."}, {"time": 4887, "text": "When you're doing say, self driving cars, the great guy who will do this."}, {"time": 4895, "text": "It doesn't matter what theory behind that."}, {"time": 4900, "text": "Who has a better feeling how to apply it."}, {"time": 4903, "text": "But by the way, it is the same story about predicates."}, {"time": 4910, "text": "Because you cannot create rule for, situation is much more than you have rule for that."}, {"time": 4916, "text": "But maybe you can have more abstract rule than it will be less literal."}, {"time": 4928, "text": "It is the same story about ideas and ideas applied to specific cases."}, {"time": 4936, "text": "But still you should reach."}, {"time": 4937, "text": "You cannot avoid this."}, {"time": 4939, "text": "But you should still reach for the ideas to understand the science."}, {"time": 4942, "text": "Okay, let me kind of ask, do you think neural networks or functions can be made to reason?"}, {"time": 4954, "text": "So what do you think, we've been talking about intelligence, but this idea of reasoning, there's an element of sequentially disassembling, interpreting the images."}, {"time": 4968, "text": "So when you think of handwritten recognition, we kind of think that there'll be a single, there's an input and output."}, {"time": 4976, "text": "There's not a recurrence."}, {"time": 4981, "text": "What do you think about sort of the idea of recurrence, of going back to memory and thinking through this sort of sequentially mangling the different representations over and over until you arrive at a conclusion?"}, {"time": 5000, "text": "Or is ultimately all that can be wrapped up into a function?"}, {"time": 5003, "text": "No, you're suggesting that let us use this type of algorithm."}, {"time": 5009, "text": "When I started thinking, I first of all, starting to understand what I want."}, {"time": 5016, "text": "Can I write down what I want?"}, {"time": 5019, "text": "And then I'm trying to formalize."}, {"time": 5025, "text": "And when I do that, I think I have to solve this problem."}, {"time": 5032, "text": "And till now I did not see a situation where you need recurrence."}, {"time": 5044, "text": "But do you observe human beings?"}, {"time": 5048, "text": "You try to, it's the imitation question, right?"}, {"time": 5052, "text": "It seems that human beings reason this kind of sequentially sort of, does that inspire in you a thought that we need to add that into our intelligence systems?"}, {"time": 5070, "text": "You're saying, okay, I mean, you've kind of answered saying until now I haven't seen a need for it."}, {"time": 5077, "text": "And so because of that, you don't see a reason to think about it."}, {"time": 5081, "text": "You know, most of things I don't understand."}, {"time": 5085, "text": "In reasoning in human, it is for me too complicated."}, {"time": 5092, "text": "For me, the most difficult part is to ask questions, to good questions, how it works, how people asking questions, I don't know this."}, {"time": 5111, "text": "You said that machine learning is not only about technical things, speaking of questions, but it's also about philosophy."}, {"time": 5119, "text": "So what role does philosophy play in machine learning?"}, {"time": 5123, "text": "We talked about Plato, but generally thinking in this philosophical way, does it have, how does philosophy and math fit together in your mind?"}, {"time": 5136, "text": "First ideas and then their implementation."}, {"time": 5139, "text": "It's like predicate, like say admissible set of functions."}, {"time": 5148, "text": "It comes together, everything."}, {"time": 5151, "text": "Because the first iteration of theory was done 50 years ago."}, {"time": 5158, "text": "I told that, this is theory."}, {"time": 5160, "text": "So everything's there, if you have data you can, and your set of function has not big capacity."}, {"time": 5173, "text": "So low VC dimension, you can do that."}, {"time": 5175, "text": "You can make structural risk minimization, control capacity."}, {"time": 5181, "text": "But you was not able to make admissible set of function good."}, {"time": 5186, "text": "Now when suddenly realize that we did not use another idea of convergence, which we can, everything comes together."}, {"time": 5201, "text": "But those are mathematical notions."}, {"time": 5203, "text": "Philosophy plays a role of simply saying that we should be swimming in the space of ideas."}, {"time": 5212, "text": "Let's talk what is philosophy."}, {"time": 5214, "text": "Philosophy means understanding of life."}, {"time": 5218, "text": "So understanding of life, say people like Plata, they understand on very high abstract level of life."}, {"time": 5227, "text": "So, and whatever I doing, just implementation of my understanding of life."}, {"time": 5236, "text": "But every new step, it is very difficult."}, {"time": 5241, "text": "For example, to find this idea that we need big convergence was not simple for me."}, {"time": 5260, "text": "So that required thinking about life a little bit."}, {"time": 5264, "text": "Hard to trace, but there was some thought process."}, {"time": 5268, "text": "I'm working, I'm thinking about the same problem for 50 years or more, and again, and again, and again."}, {"time": 5280, "text": "I'm trying to be honest and that is very important."}, {"time": 5282, "text": "Not to be very enthusiastic, but concentrate on whatever we was not able to achieve, for example."}, {"time": 5292, "text": "And understand why."}, {"time": 5293, "text": "And now I understand that because I believe in math, I believe that in Wigner's idea."}, {"time": 5303, "text": "But now when I see that there are only two way of convergence and we're using both, that means that we must do as well as people doing."}, {"time": 5317, "text": "But now, exactly in philosophy and what we know about predicate, how we understand life, can we describe as a predicate."}, {"time": 5331, "text": "I thought about that and that is more or less obvious level of symmetry."}, {"time": 5340, "text": "But next, I have a feeling, it's something about structures."}, {"time": 5349, "text": "But I don't know how to formulate, how to measure measure of structure and all this stuff."}, {"time": 5356, "text": "And the guy who will solve this challenge problem, then when we were looking how he did it, probably just only symmetry is not enough."}, {"time": 5370, "text": "But something like symmetry will be there."}, {"time": 5373, "text": "Structure will be there."}, {"time": 5374, "text": "Oh yeah, absolutely."}, {"time": 5375, "text": "Symmetry will be there and level of symmetry will be there."}, {"time": 5380, "text": "And level of symmetry, antisymmetry, diagonal, vertical."}, {"time": 5384, "text": "And I even don't know how you can use in different direction idea of symmetry, it's very general."}, {"time": 5392, "text": "But it will be there."}, {"time": 5394, "text": "I think that people very sensitive to idea of symmetry."}, {"time": 5398, "text": "But there are several ideas like symmetry."}, {"time": 5404, "text": "As I would like to learn."}, {"time": 5407, "text": "But you cannot learn just thinking about that."}, {"time": 5411, "text": "You should do challenging problems and then analyze them, why it was able to solve them."}, {"time": 5420, "text": "And then you will see."}, {"time": 5422, "text": "Very simple things, it's not easy to find."}, {"time": 5425, "text": "But even with talking about this every time."}, {"time": 5432, "text": "I was surprised, I tried to understand."}, {"time": 5436, "text": "These people describe in language strong convergence mechanism for learning."}, {"time": 5444, "text": "I did not see, I don't know."}, {"time": 5446, "text": "But weak convergence, this dark story and story like that when you will explain to kid, you will use weak convergence argument."}, {"time": 5457, "text": "It looks like it does like it does that."}, {"time": 5460, "text": "But when you try to formalize, you're just ignoring this."}, {"time": 5465, "text": "Why, why 50 years from start of machine learning?"}, {"time": 5470, "text": "And that's the role of philosophy, thinking about life."}, {"time": 5472, "text": "I think that maybe, I don't know."}, {"time": 5478, "text": "Maybe this is theory also, we should blame for that because empirical risk minimization and all this stuff."}, {"time": 5487, "text": "And if you read now textbooks, they just about bound about empirical risk minimization."}, {"time": 5494, "text": "They don't looking for another problem like admissible set."}, {"time": 5501, "text": "But on the topic of life, perhaps we, you could talk in Russian for a little bit."}, {"time": 5510, "text": "What's your favorite memory from childhood?"}, {"time": 5516, "text": "Oh, music."}, {"time": 5519, "text": "How about, can you try to answer in Russian?"}, {"time": 5522, "text": "Music?"}, {"time": 5524, "text": "It was very cool when... What kind of music?"}, {"time": 5529, "text": "Classic music."}, {"time": 5531, "text": "What's your favorite?"}, {"time": 5533, "text": "Well, different composers."}, {"time": 5535, "text": "At first, it was Vivaldi, I was surprised that it was possible."}, {"time": 5543, "text": "And then when I understood Bach, I was absolutely shocked."}, {"time": 5549, "text": "By the way, from him I think that there is a predicate, like a structure."}, {"time": 5556, "text": "In Bach?"}, {"time": 5557, "text": "Well, of course."}, {"time": 5558, "text": "Because you can just feel the structure."}, {"time": 5562, "text": "And I don't think that different elements of life are very much divided, in the sense of predicates."}, {"time": 5573, "text": "Everywhere structure, in painting structure, in human relations structure."}, {"time": 5579, "text": "Here's how to find these high level predicates, it's..."}, {"time": 5585, "text": "In Bach and in life, everything is connected."}, {"time": 5588, "text": "Now that we're talking about Bach, let's switch back to English, because I like Beethoven and Chopin, so... Well, Chopin, it's another amusing story."}, {"time": 5601, "text": "But Bach, if we talk about predicates, Bach probably has the most sort of well defined predicates that underlie it."}, {"time": 5611, "text": "It is very interesting to read what critics are writing about Bach, which words they're using."}, {"time": 5620, "text": "They're trying to describe predicates."}, {"time": 5623, "text": "And then Chopin, it is very different vocabulary, very different predicates."}, {"time": 5635, "text": "And I think that if you will make collection of that, so maybe from this you can describe predicate for digit recognition as well."}, {"time": 5648, "text": "From Bach and Chopin."}, {"time": 5650, "text": "No, no, no, not from Bach and Chopin."}, {"time": 5652, "text": "From the critic interpretation of the music, yeah."}, {"time": 5655, "text": "When they're trying to explain you music, what they use."}, {"time": 5662, "text": "As they use, they describe high level ideas of platos ideas, what behind this music."}, {"time": 5669, "text": "So art is not self explanatory in some sense."}, {"time": 5674, "text": "So you have to try to convert it into ideas."}, {"time": 5679, "text": "It is ill post problems."}, {"time": 5680, "text": "When you go from ideas to the representation, it is easy way."}, {"time": 5687, "text": "But when you're trying to go Bach, it is ill post problems."}, {"time": 5691, "text": "But nevertheless, I believe that when you're looking from that, even from art, you will be able to find predicates for digit recognition."}, {"time": 5702, "text": "That's such a fascinating and powerful notion."}, {"time": 5708, "text": "Do you ponder your own mortality?"}, {"time": 5712, "text": "Do you fear it?"}, {"time": 5713, "text": "Do you draw insight from it?"}, {"time": 5716, "text": "About mortality, no, yeah."}, {"time": 5721, "text": "Are you afraid of death?"}, {"time": 5725, "text": "Not too much, not too much."}, {"time": 5729, "text": "It is pity that I will not be able to do something which I think I have a feeling to do that."}, {"time": 5739, "text": "For example, I will be very happy to work with guys theoretician from music to write this collection of description, how they describe music, how they use that predicate, and from art as well."}, {"time": 5760, "text": "Then take what is in common and try to understand predicate which is absolute for everything."}, {"time": 5768, "text": "And then use that for visual recognition and see if there is a connection."}, {"time": 5773, "text": "Ah, there's still time."}, {"time": 5774, "text": "We got time."}, {"time": 5776, "text": "Ha ha ha ha."}, {"time": 5780, "text": "It take years and years and years."}, {"time": 5784, "text": "Yes, yeah, it's a long way."}, {"time": 5786, "text": "Well, see, you've got the patient mathematicians mind."}, {"time": 5790, "text": "I think it could be done very quickly and very beautifully."}, {"time": 5794, "text": "I think it's a really elegant idea."}, {"time": 5795, "text": "Yeah, but also."}, {"time": 5796, "text": "Some of many."}, {"time": 5797, "text": "Yeah, you know, the most time, it is not to make this collection to understand what is the common to think about that once again and again and again."}, {"time": 5809, "text": "Again and again and again, but I think sometimes, especially just when you say this idea now, even just putting together the collection and looking at the different sets of data, language, trying to interpret music, criticize music, and images, I think there'll be sparks of ideas that'll come."}, {"time": 5830, "text": "Of course, again and again, you'll come up with better ideas, but even just that notion is a beautiful notion."}, {"time": 5836, "text": "I even have some example."}, {"time": 5839, "text": "Yes, so I have friend who was specialist in Russian poetry."}, {"time": 5850, "text": "She is professor of Russian poetry."}, {"time": 5855, "text": "He did not write poems, but she know a lot of stuff."}, {"time": 5863, "text": "She make book, several books, and one of them is a collection of Russian poetry."}, {"time": 5874, "text": "She have images of Russian poetry."}, {"time": 5877, "text": "She collect all images of Russian poetry."}, {"time": 5880, "text": "And I ask her to do following."}, {"time": 5885, "text": "You have NIPS, digit recognition, and we get 100 digits, or maybe less than 100."}, {"time": 5895, "text": "I don't remember, maybe 50 digits."}, {"time": 5898, "text": "And try from poetical point of view, describe every image which she see, using only words of images of Russian poetry."}, {"time": 5911, "text": "And she did it."}, {"time": 5914, "text": "And then we tried to, I call it learning using privileged information."}, {"time": 5923, "text": "I call it privileged information."}, {"time": 5925, "text": "You have on two languages."}, {"time": 5928, "text": "One language is just image of digit, and another language, poetic description of this image."}, {"time": 5937, "text": "And this is privileged information."}, {"time": 5942, "text": "And there is an algorithm when you're working using privileged information, you're doing better."}, {"time": 5948, "text": "Much better, so."}, {"time": 5950, "text": "So there's something there."}, {"time": 5951, "text": "Something there."}, {"time": 5952, "text": "And there is a, in NEC, she unfortunately died."}, {"time": 5960, "text": "The collection of digits in poetic descriptions of these digits."}, {"time": 5970, "text": "So there's something there in that poetic description."}, {"time": 5972, "text": "But I think that there is a abstract ideas on the plot of level of ideas."}, {"time": 5980, "text": "Yeah, that they're there."}, {"time": 5982, "text": "That could be discovered."}, {"time": 5983, "text": "And music seems to be a good entry point."}, {"time": 5985, "text": "But as soon as we start with this challenge problem."}, {"time": 5990, "text": "The challenge problem."}, {"time": 5992, "text": "It immediately connected to all this stuff."}, {"time": 5995, "text": "Especially with your talk and this podcast, and I'll do whatever I can to advertise it."}, {"time": 6000, "text": "It's such a clean, beautiful Einstein like formulation of the challenge before us."}, {"time": 6006, "text": "Let me ask another absurd question."}, {"time": 6009, "text": "We talked about mortality."}, {"time": 6012, "text": "We talked about philosophy of life."}, {"time": 6014, "text": "What do you think is the meaning of life?"}, {"time": 6017, "text": "What's the predicate for mysterious existence here on earth?"}, {"time": 6033, "text": "It's very interesting how we have, in Russia, I don't know if you know the guy Strugatsky."}, {"time": 6043, "text": "They are writing fiction."}, {"time": 6046, "text": "They're thinking about human, what's going on."}, {"time": 6051, "text": "And they have idea that there are developing two type of people, common people and very smart people."}, {"time": 6065, "text": "They just started."}, {"time": 6066, "text": "And these two branches of people will go in different direction very soon."}, {"time": 6073, "text": "So that's what they're thinking about that."}, {"time": 6078, "text": "So the purpose of life is to create two paths."}]}]