[{"title": "Michael Malice: The White Pill, Freedom, Hope, and Happiness Amidst Chaos | Lex Fridman Podcast #150", "id": "uykM3NhJbso", "quotes": [{"time": 252, "text": "Yeah, you crossed it out on a sheet of paper."}, {"time": 257, "text": "That means it's real."}, {"time": 258, "text": "The reason I bring it up is because you had the guts, the brilliance to do a knock knock joke."}, {"time": 266, "text": "Not once, but three times with Alex Jones."}, {"time": 268, "text": "I think it was like six."}, {"time": 269, "text": "I had a runner."}, {"time": 271, "text": "Maybe they started to sort of melt together in this beautiful art form that you've created, which is like these kind, loving knock knock jokes with Alex Jones."}, {"time": 280, "text": "So you got the chance to meet him and talk to him twice with Tim Pool in a long form conversation."}, {"time": 288, "text": "What was it like talking to Alex Jones, both on the deep philosophical intellectual level and staring the man in his eyes and doing a knock knock joke about Olive knock knock."}, {"time": 305, "text": "Olive."}, {"time": 306, "text": "I love you, Alex."}, {"time": 307, "text": "I love you."}, {"time": 308, "text": "Well, there's a lot to explain."}, {"time": 311, "text": "Where do you start?"}, {"time": 312, "text": "I've been on his show Infowars a few times when I was researching my book, Then You Write."}, {"time": 317, "text": "So I had had conversations with him before."}, {"time": 320, "text": "One of the things that I appreciate about Alex is he is a lot more self aware than people think and has a good sense of humor."}, {"time": 328, "text": "And I also like a good twist ending."}, {"time": 332, "text": "So if you set people up and all these jokes are these kind of vapid, you know, all of you jokes and the last one's about building seven, they're not going to see that one coming nor will he see that one coming."}, {"time": 343, "text": "I even had another one about Sandy Hook, which I didn't do on the air because he was being like a good sport, but that was the dagger that was kind of behind my back if necessary."}, {"time": 352, "text": "But it was a good mechanism toward I like it when things work on several levels."}, {"time": 357, "text": "It was also a good mechanism to keep kind of the conversation guarded and this every so often, this is kind of hitting the control, alt, delete and bring it down to a certain point of calmness."}, {"time": 371, "text": "What about the love thing?"}, {"time": 372, "text": "I mean, you're saying that that was a buildup to the dagger, but it was also somehow really refreshing to get that little jolt, like that pause."}, {"time": 383, "text": "You don't get that in conversations often."}, {"time": 385, "text": "Like I'm a huge fan of Rogan and he'll have a three hour conversation, but at some point just pause and be like, I love you, man."}, {"time": 395, "text": "Like it's in the cheesiest way possible because that seems to be, it somehow hits the hardest then."}, {"time": 404, "text": "I don't know you didn't intend it that way, but with Alex Jones to sit there and to say, I love you."}, {"time": 410, "text": "That was like, I just haven't never heard that before."}, {"time": 415, "text": "And so it struck me as like, not just funny for what you're doing, but just like, whoa, we just took, cause conversations are all about like this ranting, especially with Alex Jones, just like ranting about this or that, this part of the world, like, can you believe this shit?"}, {"time": 430, "text": "But like to pause and be like, this is awesome."}, {"time": 433, "text": "I don't know if you felt that way, but."}, {"time": 435, "text": "Oh, I definitely felt that way."}, {"time": 436, "text": "So it was actually very fun."}, {"time": 437, "text": "I'll give you the backstory of how that happened."}, {"time": 442, "text": "It was silly cause Tim calls me up and there's this expression in marketing, don't go past the sale."}, {"time": 448, "text": "You're gonna buy someone a car and like, it's got this feature, this feature and that feature."}, {"time": 452, "text": "And they're like, you know what?"}, {"time": 453, "text": "I'm going to buy the car."}, {"time": 454, "text": "If you keep talking, you can only make them lose the sale."}, {"time": 458, "text": "You just get them to sign and get, get out of Dodge."}, {"time": 461, "text": "So Tim calls me up and he goes, okay, here's what we're thinking."}, {"time": 467, "text": "This is top secret."}, {"time": 468, "text": "Alex is going to be on the show."}, {"time": 470, "text": "We want you on as well."}, {"time": 471, "text": "And I've never said yes to anything as quickly in my life."}, {"time": 474, "text": "And then he keeps talking and I'm like, Tim, this, you don't have to sell it."}, {"time": 478, "text": "I interrupted him."}, {"time": 479, "text": "I go, you don't have to sell it."}, {"time": 480, "text": "Why you, by the way?"}, {"time": 481, "text": "I think because I am kind of an agent of chaos and Alex is in his own way, an agent of chaos."}, {"time": 490, "text": "And what is, provides an opportunity in this kind of news media space that you and I travel in, it's the kind of things where none of us three, you know, as we said on the show, knew what it would be like."}, {"time": 502, "text": "If you, you know, to certain, within certain parameters, what, you know, Megyn Kelly or Wolf Blitzer or any of these corporate figures are going to be like in a conversation to some extent, none of us had any idea."}, {"time": 515, "text": "I knew they didn't know I was bringing in knocking up jokes."}, {"time": 519, "text": "So that was kind of what was so exciting."}, {"time": 522, "text": "I said at one point, I'm kind of envious of the audience because this is, there's so many exciting things that are happening and that the internet and podcasting provides people an opportunity to do that."}, {"time": 535, "text": "That, that was the greatest pairing with Alex Jones that I've ever seen by far."}, {"time": 542, "text": "So like, so I immediately knew now this isn't a knock on Tim, but I don't even know if Tim was prepared."}, {"time": 549, "text": "Tim was not prepared."}, {"time": 551, "text": "For this."}, {"time": 552, "text": "How could he be prepared?"}, {"time": 553, "text": "Well, so I mean, I don't know if Tim is used to that."}, {"time": 556, "text": "I think Joe Rogan is more equipped, prepared for the chaos, just the years he's been in it."}, {"time": 563, "text": "Like I immediately thought this is the right pairing for Joe Rogan because Alex Jones has been on Joe Rogan a few times, three times."}, {"time": 571, "text": "My favorite so far was with Tim Dillon, but Tim was clearly, Tim Dillon was also kind of a genius in his own right, but he was kind of a fan and he was stepping away."}, {"time": 588, "text": "He was almost like in awe of Alex Jones where you were both, you were in awe of the experience that's being created and at the same time fearlessly just trolling the situation."}, {"time": 604, "text": "I mean, to do a knock, knock joke, to stop, I mean, that just shows that you're in control of the experience."}, {"time": 609, "text": "No, you're like riding the experience."}, {"time": 611, "text": "That immediately was like, this needs to be on Rogan."}, {"time": 614, "text": "So I hope that happens as well."}, {"time": 618, "text": "You're on your own, of course, on Rogan, but just you, that's an experience."}, {"time": 622, "text": "That's the, whatever, this gotta be a good name for it."}, {"time": 624, "text": "Like Jimi Hendrix Experience, there's the Michael and Alex."}, {"time": 627, "text": "Because that was a band."}, {"time": 629, "text": "It's taken."}, {"time": 630, "text": "Well, I don't know how many years you can restart the experience."}, {"time": 635, "text": "Because I feel sorry to interrupt you, I feel a very big responsibility, especially in 2020 to provide fun and something cool and something unique that hasn't been done before for the audience."}, {"time": 650, "text": "I think this has been a very rough year on our audiences psychologically and in other aspects of their lives."}, {"time": 657, "text": "So I feel if I'm going to be there, I'm going to put on a show and it's also going to be great because it also alienates the people you don't want."}, {"time": 666, "text": "So there's a lot of people who sit there and be like, oh, he's telling knock, people who are too cool for school, where they're like, oh, he's telling knock, knock jokes."}, {"time": 673, "text": "This is stupid."}, {"time": 674, "text": "I'm like, good."}, {"time": 675, "text": "If you have an issue with having eaten cotton candy or doing a puzzle with a kid or with that by yourself, that's on you."}, {"time": 686, "text": "And it's something very, something I think is the enemy is cynicism and this idea that like, oh, this is too silly and we need that kind of childlike aspect in our lives."}, {"time": 696, "text": "I think it's something we could use more of."}, {"time": 698, "text": "It's very much an aspect of our media culture that to kind of have be condemnatory about that or to do it in a certain very corporate fake way."}, {"time": 706, "text": "So it is something I encourage a lot, something I enjoy doing."}, {"time": 711, "text": "And again, like with the first time I was on Tim, I had a propeller beanie on, you know, with the motorized and a lot of people were like, I can't take anyone seriously who dresses like this."}, {"time": 721, "text": "I go, good."}, {"time": 722, "text": "If you judge someone's ideas by how they appear instead of the ideas themselves, you're not someone I want on my team."}, {"time": 730, "text": "Are we going to address the outfit you're wearing?"}, {"time": 735, "text": "We can address it, sure."}, {"time": 736, "text": "You know, for those who are colorblind, Michael's wearing the, or just listening to this, Michael's wearing the exact opposite, the universe from another dimension outfit, which is a white suit and black shirt."}, {"time": 753, "text": "So genius."}, {"time": 756, "text": "You just see the next two looks I've planned."}, {"time": 758, "text": "Yeah, they're great."}, {"time": 759, "text": "Well, obviously this relationship's going to end today."}, {"time": 763, "text": "I'll put them on Insta."}, {"time": 768, "text": "Is there some deep philosophy to the humor?"}, {"time": 770, "text": "Is this goes to our trolling discussion?"}, {"time": 774, "text": "Is there some, is there like chapters to this genius or is this just what makes you smile in the morning?"}, {"time": 783, "text": "Well, I mean, I think you're honestly, in this case, using the word genius a little loosely."}, {"time": 789, "text": "I don't think this is particularly genius, but I do think it is fun."}, {"time": 792, "text": "It is exuberant."}, {"time": 793, "text": "It is joyous."}, {"time": 796, "text": "I think the bigger my audience has gotten and the more I actually communicate with, you know, fans, I do feel it kind of kicks in these paternal maternal instincts, which is very, very odd."}, {"time": 809, "text": "I did not expect to have them."}, {"time": 811, "text": "Who's the dad?"}, {"time": 812, "text": "I'm the dad and the mom."}, {"time": 813, "text": "I remember, and it may have been similar for you, I'm curious to hear it."}, {"time": 817, "text": "For young, smart, like ambitious men, like 24 to 27 for me was a very rough period because that's the window where a lot of people get married and they kind of check out."}, {"time": 827, "text": "And if you're very much kind of finding your own road, you don't know what's happening."}, {"time": 832, "text": "No one's in a position to really guide you or help you."}, {"time": 835, "text": "And it's tough."}, {"time": 836, "text": "It's a very tough window."}, {"time": 838, "text": "And what I'm finding now is having these kids who are in that position, but now instead of them stumbling along, for some of them, I'm the one who could be like, no, no, no, it's not you."}, {"time": 850, "text": "It's everybody else."}, {"time": 851, "text": "And to be able to give them that semblance of feeling seen, to use a cliched expression, to feel normal and that, no, no, you're the heroes here."}, {"time": 863, "text": "They're the background noise."}, {"time": 865, "text": "It's just really very flattering and humbling to be in that position."}, {"time": 870, "text": "You have many minds, right?"}, {"time": 871, "text": "There's the thoughtful kind, Michael, there's like, I'm going to burn down the powerful."}, {"time": 881, "text": "And then there's like, I'm going to have this just lighthearted trolling of the world, which and which of those are most important to the 27 demographic?"}, {"time": 895, "text": "I think it is the combination."}, {"time": 897, "text": "It's like if you're making a meal, chicken Kiev, you need the chicken, you need the ham, you need the butter sauce."}, {"time": 907, "text": "Because I think people, when you're young, you need to see someone who's fought the fight for you and who's won."}, {"time": 915, "text": "So it's very easy to be defeatist."}, {"time": 918, "text": "So this is what winning looks like."}, {"time": 920, "text": "No, this is not."}, {"time": 923, "text": "This is most assuredly what winning does not look like."}, {"time": 926, "text": "But in my normal clothes, a little bit more."}, {"time": 929, "text": "This is a good time to mention that clothes wise, you're wearing sheath underwear."}, {"time": 934, "text": "And people should buy sheath underwear."}, {"time": 937, "text": "Use code Malice20."}, {"time": 938, "text": "If you go to sheathunderwear.com, use promo code Malice20."}, {"time": 942, "text": "What I love about why I'm glad to promote the product and wear it, it's the most comfortable underwear I've ever worn."}, {"time": 948, "text": "And you have a separate pouch for both parts of your genitals."}, {"time": 951, "text": "That's what I thought there was like a punchline coming."}, {"time": 954, "text": "No, it's a very nice aspect of the product."}, {"time": 957, "text": "But I think what here's something else just goes back to what we're just talking about."}, {"time": 960, "text": "There are so many and this is going to segue into this."}, {"time": 962, "text": "There are so many small companies who've been devastated this year."}, {"time": 967, "text": "We have not seen a sustained attack on mom and pop shops like we've seen in 2020, who are innovators and making something happen."}, {"time": 977, "text": "And when you're just like one dude who's producing a product, they're a sponsor of mine."}, {"time": 982, "text": "I'm happy to, first of all, it's funny that I'm pitching underwear, but it's also something I enjoy."}, {"time": 989, "text": "And also you said small business."}, {"time": 991, "text": "It's microscopic, like a thimble."}, {"time": 993, "text": "So this isn't a sponsor of mine, but this is a good segue."}, {"time": 996, "text": "So this is, Russians, we celebrate New Year's, it's Novomgorodom."}, {"time": 999, "text": "We have Dmitry, he comes down, puts a present under your pillow."}, {"time": 1003, "text": "So this is a company called J.L."}, {"time": 1003, "text": "Lawson."}, {"time": 1005, "text": "He's a fan of yours."}, {"time": 1006, "text": "He's a metal worker."}, {"time": 1007, "text": "And he said, can I give you something to give to Lex?"}, {"time": 1010, "text": "I have one of his worry coins."}, {"time": 1012, "text": "I'll tell you what it is."}, {"time": 1014, "text": "He's not a sponsor."}, {"time": 1015, "text": "This is not, I'm not getting paid for this."}, {"time": 1016, "text": "So what a worry coin is, I carry it around in my butt."}, {"time": 1018, "text": "If you have raw denim, it's great because it brings you fades."}, {"time": 1021, "text": "So you carry it around with you all the time."}, {"time": 1023, "text": "It says worrying is like paying a debt you don't owe, right?"}, {"time": 1028, "text": "And I carry this around and allow it to spend like a year."}, {"time": 1032, "text": "Next time you're worrying, and this is good advice if you don't have a worry coin."}, {"time": 1035, "text": "Go think about 10 years ago and what you were worried about then."}, {"time": 1040, "text": "And then think about, did any of those things pan out?"}, {"time": 1043, "text": "And some of them did, but you were able to handle it."}, {"time": 1045, "text": "And that's a good way to maintain perspective."}, {"time": 1048, "text": "So J.L."}, {"time": 1048, "text": "Lawson is the company."}, {"time": 1050, "text": "He sent me this present."}, {"time": 1051, "text": "I said, let me give it to Lex on air."}, {"time": 1053, "text": "So enjoy."}, {"time": 1054, "text": "So I have to open it up now?"}, {"time": 1058, "text": "J.L."}, {"time": 1058, "text": "Lawson and co. Two Lex from Anthony."}, {"time": 1061, "text": "And I said, make something mathematical for Lex."}, {"time": 1063, "text": "So I don't even know what's in there."}, {"time": 1064, "text": "You don't know what's in there?"}, {"time": 1066, "text": "And it got through his TSA."}, {"time": 1067, "text": "Could be a bomb."}, {"time": 1070, "text": "Just like this episode."}, {"time": 1074, "text": "Make sure you unwrap it close to the mic because it drives you for crazy."}, {"time": 1077, "text": "That's really the best part."}, {"time": 1083, "text": "Is this what an unboxing video looks like?"}, {"time": 1087, "text": "This conversation is going to be a big hit on the internet."}, {"time": 1090, "text": "With the unboxing community."}, {"time": 1092, "text": "I need to have an excited look on my face to make sure that the reaction video, it should be an unboxing and a reaction video."}, {"time": 1099, "text": "Lex Freeman reacts."}, {"time": 1100, "text": "It's another box."}, {"time": 1101, "text": "It's just a series of boxes."}, {"time": 1105, "text": "Lex big fan since hearing you on Rogan months ago."}, {"time": 1110, "text": "Most of your guests are over my head, but still enjoyable."}, {"time": 1114, "text": "Like this episode, Michael was kind enough to want to share my work with you."}, {"time": 1120, "text": "Keep doing what you do."}, {"time": 1121, "text": "Anthony Lawson."}, {"time": 1122, "text": "Thanks Anthony."}, {"time": 1123, "text": "There's a lot in there."}, {"time": 1124, "text": "What is in there?"}, {"time": 1125, "text": "Give me some."}, {"time": 1126, "text": "I'll open some."}, {"time": 1129, "text": "Show it to the camera and then make sure you look excited or not or disappointed."}, {"time": 1136, "text": "No, this is cool."}, {"time": 1137, "text": "This is a worry coin."}, {"time": 1138, "text": "Like I was showing you."}, {"time": 1139, "text": "So you hold it in your hand and when you can do this with your thumb, if people are, have anxiety or whatever."}, {"time": 1144, "text": "Oh, there's a lot of cool stuff in here."}, {"time": 1146, "text": "Fibonacci coin."}, {"time": 1147, "text": "Oh, see, yeah, that's the math stuff."}, {"time": 1150, "text": "That's really awesome."}, {"time": 1152, "text": "Wait, you got a big one laying there too."}, {"time": 1156, "text": "That's what she said."}, {"time": 1159, "text": "I'm telling you last time you offended me saying I don't have humor."}, {"time": 1168, "text": "The spin tray micro brass and copper bronze."}, {"time": 1173, "text": "By the way, the packaging is epic."}, {"time": 1176, "text": "I think that's his top."}, {"time": 1177, "text": "He makes tops."}, {"time": 1179, "text": "Yeah, you spin it in there and it's the two different bronze and copper."}, {"time": 1189, "text": "I think he's the only one who makes these machined tops and then they sit in here, I guess."}, {"time": 1195, "text": "Yeah, but you could spin them in that section."}, {"time": 1197, "text": "Got it, cool."}, {"time": 1201, "text": "Where's the where's the worry thing?"}, {"time": 1202, "text": "Here's the worry coin."}, {"time": 1203, "text": "Anyway, I wasn't listening."}, {"time": 1204, "text": "What were you worried about 10 years ago?"}, {"time": 1206, "text": "10 years ago, 2010."}, {"time": 1209, "text": "What would I have been worried about then?"}, {"time": 1211, "text": "The government?"}, {"time": 1213, "text": "That's not a worry."}, {"time": 1214, "text": "I think... What was the North Korea book?"}, {"time": 1217, "text": "That came out in 2014."}, {"time": 1219, "text": "I went there in 2012, came out in January 2014."}, {"time": 1224, "text": "It still pays my rent with the royalties."}, {"time": 1228, "text": "The North Korea book?"}, {"time": 1230, "text": "See, this is why it's so much better."}, {"time": 1231, "text": "I gotta talk to you about self publishing because you brought that up."}, {"time": 1236, "text": "I'm doing the next books also going to be self published."}, {"time": 1238, "text": "Can we talk about self publishing?"}, {"time": 1242, "text": "What's the whole idea of publishing?"}, {"time": 1245, "text": "Like having a publisher and an agent because there's a bunch of people have been reaching out to me trying to get me to write a book, which is ridiculous."}, {"time": 1253, "text": "Because people who are brilliant folks like you, like Jordan Peterson, that I think have a lot of knowledge to share with the world."}, {"time": 1260, "text": "I think what I feel I can contribute to the world in terms of impact is to build something."}, {"time": 1270, "text": "Meaning like engineering stuff."}, {"time": 1272, "text": "Like a book... A book has to be engineered and I'm not using that loosely."}, {"time": 1276, "text": "You have to engineer a book."}, {"time": 1278, "text": "What I mean is like literally a product with programming and artificial intelligence."}, {"time": 1282, "text": "I want to build a company."}, {"time": 1284, "text": "I want to... Because I have a few ideas that I feel I'm equipped and it has to do with your intuition about the way you can build a better world."}, {"time": 1294, "text": "You individually."}, {"time": 1295, "text": "Like, what can you add to the world that's a positive thing?"}, {"time": 1298, "text": "And for me, I feel like the maximal thing I can add to the world is at least to attempt to build products that would add more love in the world."}, {"time": 1309, "text": "And like, so I want to focus on that."}, {"time": 1310, "text": "The danger of the book for me, or any kind of writing, and even this podcast is a little bit dangerous for me, is like, it's fun."}, {"time": 1324, "text": "It's like it takes you into this place where you start thinking about the world."}, {"time": 1327, "text": "You start enjoying and playing with ideas."}, {"time": 1329, "text": "You start... And like, just your book on a Dear Reader, but also the new write."}, {"time": 1336, "text": "Like clearly you and I probably think similarly in the sense that you did a lot of work."}, {"time": 1343, "text": "This next book is killing me."}, {"time": 1346, "text": "As you mentioned, often it's clear, like on your YouTube channel, which I'm a fan of, you often, it just comes out like you mentioned all of these books that you're reading."}, {"time": 1357, "text": "It just comes through you that you're suffering through this and it changes you."}, {"time": 1363, "text": "And it's clear that you're thinking deeply about the world because of this book."}, {"time": 1369, "text": "And I feel like if you do that, that's like when I first came to this country, I read the book The Giver."}, {"time": 1376, "text": "I need to read it again."}, {"time": 1377, "text": "It's like the red pill thing is it changes you in where you can never be the same person again."}, {"time": 1386, "text": "I feel about a book in that same way."}, {"time": 1387, "text": "The moment you write a book, of course it depends on the book."}, {"time": 1391, "text": "I could also just write like in my field, a very technical book."}, {"time": 1395, "text": "No, that's a terrible idea."}, {"time": 1398, "text": "But that's okay."}, {"time": 1399, "text": "That doesn't really change you."}, {"time": 1400, "text": "That's just like sharing information."}, {"time": 1402, "text": "But like something where you're like, how do I think about this world?"}, {"time": 1406, "text": "Can you just leave that behind you?"}, {"time": 1409, "text": "Dude, it's being pregnant."}, {"time": 1411, "text": "It never escapes your brain."}, {"time": 1412, "text": "I'm telling you."}, {"time": 1416, "text": "It does seem to change you."}, {"time": 1417, "text": "The reason I bring that up is because there's this whole industry of people that seem to not really contribute much to the publication process, but they make themselves seem necessary for like, if you want to be in the New York Times bestseller list kind of thing, but also just being like reputable, which I'm allergic to that whole concept."}, {"time": 1439, "text": "But do you think it's possible to be on the New York Times bestseller list and be a reputable author and still be self published?"}, {"time": 1449, "text": "Not what you would want to do."}, {"time": 1451, "text": "Like people like Mark Sisson, I think is his name."}, {"time": 1452, "text": "He wrote like the Primal Blueprints."}, {"time": 1454, "text": "So like if I'm getting the names correct, he's the first paleo guy, right?"}, {"time": 1458, "text": "So he self published it."}, {"time": 1459, "text": "It sold gangbusters."}, {"time": 1460, "text": "But that would be on their health chart, I believe."}, {"time": 1464, "text": "And it's a little bit of a different situation."}, {"time": 1467, "text": "You would be reaching much more for the mainstream."}, {"time": 1470, "text": "You'd be giving up a lot if you go through a publisher, especially financially."}, {"time": 1476, "text": "But yeah, you are not going to have the cred because the publishing is a cartel."}, {"time": 1481, "text": "The New York Times is part of this cartel."}, {"time": 1484, "text": "And if you don't publish within this cartel, they will do what they can, as any cartel has to, by necessity of being cartel, to pretend you don't exist."}, {"time": 1495, "text": "So I was, I think, the first one to have an hour on BookTV for Dear Reader because that was a Kickstarter book."}, {"time": 1503, "text": "But this is something that people would have to be aware of."}, {"time": 1512, "text": "So you would be giving up a lot."}, {"time": 1514, "text": "But you'd also be giving a lot to work with a publisher because you're losing like a year and a half of your life because they're glacial and they don't care."}, {"time": 1521, "text": "Well, that's my problem."}, {"time": 1522, "text": "It's not the money."}, {"time": 1523, "text": "I mean, the money is whatever percent they take, 10, 20, 30, 50%."}, {"time": 1527, "text": "They're taking a huge chunk."}, {"time": 1529, "text": "So if I sell a book through St. Martin's, it's a dollar."}, {"time": 1533, "text": "If I sell a book through Amazon, which is Dear Reader, that's $6."}, {"time": 1537, "text": "So that's what, 87%, it's something crazy."}, {"time": 1541, "text": "But for me, what bothers me isn't the money that, for me personally, for me, what bothers me is incompetence."}, {"time": 1548, "text": "Like whenever I go to the DMV or something like that."}, {"time": 1550, "text": "Can I interrupt you?"}, {"time": 1552, "text": "Let's talk incompetence."}, {"time": 1553, "text": "When a new write comes out last year, I get on Rogan, get on Ruben."}, {"time": 1560, "text": "I call them and I said, I got on these shows."}, {"time": 1564, "text": "Is there money in the budget for travel?"}, {"time": 1568, "text": "And they say, we don't have that budget."}, {"time": 1571, "text": "By the way, you got on those shows with no help from them."}, {"time": 1575, "text": "Oh yeah, that's not even a question."}, {"time": 1577, "text": "The reason they would want you to do a book is because they know you could get..."}, {"time": 1580, "text": "The only reason people get book deals nowadays, literally, is because they know that person can market their own book."}, {"time": 1585, "text": "That's the only way."}, {"time": 1587, "text": "And I got on Ruben, I got on Rogan, and they go and have the money for the budget for travel, which is fair."}, {"time": 1592, "text": "They can do Skype."}, {"time": 1593, "text": "They told me this in writing."}, {"time": 1596, "text": "And I'm like, okay."}, {"time": 1598, "text": "And they can financially cover Skype."}, {"time": 1600, "text": "No, but it's like, hey Joe, yeah, we don't have the budget, but you're going to do Skype."}, {"time": 1608, "text": "There is, another friend of mine was on a show on CNBC with Nassim Taleb, and they said Nassim wants a copy of the book."}, {"time": 1619, "text": "And they're like, oh yeah, it's like four o clock on Friday, so we're closed."}, {"time": 1624, "text": "So, and he's like, he went there, picked it up, and walked it the two blocks."}, {"time": 1630, "text": "So there is, it's almost cartoonish, and it's not incompetence."}, {"time": 1637, "text": "It's past that."}, {"time": 1640, "text": "It's something almost, you can't really believe that, I've had two friends who have been literally rendered suicidal because this was such a huge opportunity for them."}, {"time": 1651, "text": "And it was like watching their kid get beaten in front of them, and I had to talk them off the ledge."}, {"time": 1655, "text": "So it's, people do not appreciate how bad, here's another example."}, {"time": 1659, "text": "The apathy of bureaucracy, something like that."}, {"time": 1661, "text": "I did this book, Concierge Confidential."}, {"time": 1664, "text": "There's a typo in the first chapter, it ends with, I'm about to, TOO, they didn't fix it for the paperback."}, {"time": 1673, "text": "It's just like, well, okay, yeah, great book by the way, it got, NPR gave it one of the books of the year, so that was good."}, {"time": 1680, "text": "So why participate in this?"}, {"time": 1683, "text": "Because otherwise, New York Times is going to pretend you don't exist."}, {"time": 1687, "text": "Getting booked on some shows might be more difficult."}, {"time": 1690, "text": "Although I think that's collapsing in real time."}, {"time": 1695, "text": "You're not going to get reviewed necessarily on places like PW, or some others."}, {"time": 1701, "text": "So the new book you're working on, do you have a title yet?"}, {"time": 1704, "text": "The White Pill."}, {"time": 1708, "text": "Are you self publishing that?"}, {"time": 1709, "text": "Oh yeah, for sure."}, {"time": 1711, "text": "And what's the thinking behind that?"}, {"time": 1713, "text": "Just because you already have a huge following and a big platform and..."}, {"time": 1716, "text": "It's six times the cash."}, {"time": 1718, "text": "If I finish the book in December, I could have it out in February."}, {"time": 1723, "text": "If I finish the book in December with the publisher, it's going to be out in December at the earliest, 2021."}, {"time": 1730, "text": "Why am I giving up 10 months of my life?"}, {"time": 1732, "text": "Well, this is the big one."}, {"time": 1733, "text": "Do you have any leverage?"}, {"time": 1735, "text": "Like do authors have leverage to say, F you?"}, {"time": 1738, "text": "Can you just say, what do you mean?"}, {"time": 1742, "text": "Meaning like, I want to release this book in two months."}, {"time": 1747, "text": "I mean, you'll have a contract and then your agent can fight it, but they don't have the capacity to rush things through."}, {"time": 1754, "text": "I guess if the, cause I've heard like big authors, I don't know, Sam Harris, all those folks talk about like, they've accepted it actually."}, {"time": 1763, "text": "They've accepted it."}, {"time": 1764, "text": "They're like, yeah, it takes a long time to..."}, {"time": 1766, "text": "I'm not accepting it."}, {"time": 1768, "text": "But you're kind of implying that a human being like me should, like..."}, {"time": 1773, "text": "I'm saying these are your options."}, {"time": 1776, "text": "So I just, I just hate it."}, {"time": 1778, "text": "I hate the waiting because it's incompetence."}, {"time": 1781, "text": "It's not the, it's not necessarily the wait."}, {"time": 1784, "text": "If I knew it wasn't, you know, if it was the kind of people that are up at 2 a.m. at night on a Friday and they love what you're doing and they're helping create something special."}, {"time": 1796, "text": "That's the sense I get with some of the Netflix folks, for example, that work with people."}, {"time": 1801, "text": "I just, I don't know anything about this world, but you get like Netflix folks who, who help with shows."}, {"time": 1808, "text": "You could tell that they're obsessed with those shows."}, {"time": 1812, "text": "You're not going to get that publishing."}, {"time": 1813, "text": "If you hand, like I handed the book in, I think it was July, I didn't hear anything from my editor until December."}, {"time": 1819, "text": "Well, can we actually talk about the suffering, the darkest parts of writing a book?"}, {"time": 1827, "text": "So the, let's go to the full Michael Malice, Stephen King mode of what are the darkest moments of writing this book and what is it maybe start, the white pill?"}, {"time": 1838, "text": "What's the idea?"}, {"time": 1839, "text": "What's the hope and what are your darkest moments around writing this book?"}, {"time": 1843, "text": "So people are familiar with the red pill and the blue pill, the red, they're from the Matrix."}, {"time": 1848, "text": "The red pill is the idea that what is presented as fact by the corporate press entertainment industry is in fact a carefully constructed narrative designed to keep some very unpleasant people in power and everyone else under control."}, {"time": 1861, "text": "And I guess one of my expressions is you take one red pill, not the whole bottle because at a certain point you think everything's lie and then you're kind of no capacity for distinguishing truths."}, {"time": 1871, "text": "You're full of good one liners."}, {"time": 1872, "text": "Well, thank you."}, {"time": 1874, "text": "I'm full of something that's for sure."}, {"time": 1877, "text": "And what I saw in this space is a lot of these red pill people got very disheartened and cynical."}, {"time": 1887, "text": "And one of my big heroes is Albert Camus and he said the worst thing is cynicism."}, {"time": 1893, "text": "And that's something called the black pill, which is the idea that, you know, it's all, it's just we're waiting for the end."}, {"time": 1902, "text": "And I don't see it that way at all."}, {"time": 1907, "text": "And I'm like, all right, I have to address this."}, {"time": 1911, "text": "And not just with some kind of cheerleading, everything's going to be great guys."}, {"time": 1915, "text": "Here is why I am positive."}, {"time": 1918, "text": "And not that I'm positive the good guys are going to win, but I'm positive that good guys can win."}, {"time": 1925, "text": "And that's all you need."}, {"time": 1927, "text": "Because if your God forbid kid is kidnapped and there's a 10% chance that you can save them, you're not going to be like, well, I don't like those odds."}, {"time": 1937, "text": "This is your country."}, {"time": 1939, "text": "This is your values."}, {"time": 1940, "text": "This is your family."}, {"time": 1941, "text": "And I think it's much more than 10%."}, {"time": 1944, "text": "And even if you lose, you will take pride in that you did everything in your power to win."}, {"time": 1952, "text": "Is there a good definition of good guys?"}, {"time": 1955, "text": "In the sense that."}, {"time": 1956, "text": "The ones who wear white."}, {"time": 1958, "text": "There's layers to this."}, {"time": 1960, "text": "You're like modern day Shakespeare."}, {"time": 1963, "text": "Is there a danger in thinking Adolf Hitler was probably pretty confident that he led a group of good guys?"}, {"time": 1974, "text": "Listen, if Hitler did anything wrong, why isn't he in jail?"}, {"time": 1978, "text": "My Czech friend thought of that joke."}, {"time": 1981, "text": "He actually says in his accent, he goes, if Hitler's so bad, why isn't he in the jail?"}, {"time": 1989, "text": "He's probably still alive."}, {"time": 1991, "text": "And look, yeah."}, {"time": 1994, "text": "Two of the three people listening to this are very upset right now."}, {"time": 2001, "text": "What were you even talking about?"}, {"time": 2002, "text": "Oh, how do you, how do you know the, what is good?"}, {"time": 2006, "text": "There's lots of standards of good, but if you're for me to be a good guy is if you want to leave the world a little bit better than you found it, that to me is the definition of a good guy."}, {"time": 2018, "text": "And I think there are many people that that's not their motivation at all."}, {"time": 2023, "text": "It's about your motivation."}, {"time": 2024, "text": "Well, it's also about if your motivation is at all correlated to reality."}, {"time": 2030, "text": "No one thinks we're the bad guys."}, {"time": 2033, "text": "But are you taking steps to check your motivations and also take a certain amount of humility because if you're going to start interfering with other people's lives, you really better be sure you know what you're talking about."}, {"time": 2048, "text": "The control of others, if you do have centralized control or then you kind of, you become a leader of a group, you better know, you better do so humbly and cautiously."}, {"time": 2061, "text": "And also have steam valves, right?"}, {"time": 2065, "text": "So if in case things go wrong, let's have, I'm sure this is a lot happening with AI, whatever work with computers, like, okay, if something goes wrong here, how do we have a workaround to make sure it doesn't cause everything to collapse?"}, {"time": 2078, "text": "The going wrong thing."}, {"time": 2079, "text": "I mean, the whole, the feedback mechanism."}, {"time": 2082, "text": "Like, I wonder if people in Congress think that things are really wrong."}, {"time": 2090, "text": "It's working for them."}, {"time": 2092, "text": "No, I'm not sure."}, {"time": 2094, "text": "Because I'd like to believe that the people that at least when they got into politics actually wanted, some of it is ego, but some of it is like wanting to be the kind of person that builds a better world."}, {"time": 2111, "text": "I also think it's diverse."}, {"time": 2112, "text": "Some of who are going to have different motivations than others."}, {"time": 2115, "text": "But like once you're in the system and trying to build a better world, how do you know that's not working?"}, {"time": 2122, "text": "Like, how do you take the basic feedback mechanisms and like, and actually productively change?"}, {"time": 2130, "text": "I mean, that's what it means to be a good guy is like, hmm, something is wrong here."}, {"time": 2134, "text": "And that's why I like the Elon Musk, like think from first principles, like, wait, wait, wait."}, {"time": 2141, "text": "Let's ask the big question."}, {"time": 2142, "text": "Like, can this be, one, is this working at all?"}, {"time": 2145, "text": "Like the way we're solving this particular problem of government, is this working at all?"}, {"time": 2149, "text": "And then like stepping away and saying like, as opposed to modifying this bill or that bill or like this little strategy, like increase the tax by this much or decrease the tax by this much, like, why do we have a democracy at all?"}, {"time": 2166, "text": "Or why do we have any kind of representative democracy?"}, {"time": 2171, "text": "Shouldn't it be a pure democracy?"}, {"time": 2173, "text": "Or why do we have states, like representation of states and federal government and so on?"}, {"time": 2180, "text": "Why do we have this kind of separation of powers?"}, {"time": 2183, "text": "Is this different?"}, {"time": 2184, "text": "Why don't we have term limits or not like big things?"}, {"time": 2188, "text": "Like how do you actually make that happen?"}, {"time": 2191, "text": "And is that what it means to be a good guy?"}, {"time": 2193, "text": "It's like taking big revolutionary steps as opposed to incremental steps."}, {"time": 2199, "text": "Well, I don't know that you could be a politician to be a good guy, to be honest."}, {"time": 2203, "text": "And let me give you a counter example of someone who you could tell is not being a good guy."}, {"time": 2207, "text": "Joe Biden said he regards the Iraq wars a mistake."}, {"time": 2211, "text": "You and I have made mistakes in our lives, I'm sure."}, {"time": 2213, "text": "None of our mistakes have caused tens of thousands of people to die."}, {"time": 2216, "text": "If I were a chef, let's take it out of politics."}, {"time": 2228, "text": "And in my restaurant, somehow, accidentally, someone ate something and they died."}, {"time": 2233, "text": "A, I would feel horrible."}, {"time": 2235, "text": "But more importantly, I would be like, we need to look through the system and figure out how it got to the point where someone lost their life."}, {"time": 2244, "text": "Because that can never happen again."}, {"time": 2246, "text": "And we need to figure out step by step."}, {"time": 2248, "text": "I'm not a gun person, but there's like this checklist of like, if you're holding a gun, there's five things to do."}, {"time": 2255, "text": "And if you get too wrong, it's like assume every gun is loaded, only pointed at something that you want to kill."}, {"time": 2262, "text": "And there's like three other things."}, {"time": 2264, "text": "And it's like to make sure that nothing goes wrong."}, {"time": 2268, "text": "So if I'm that chef, and I would have to not only feel guilt, but take preventative action to make sure this has no possibility of happening again."}, {"time": 2280, "text": "If you look at the staff he's putting in, it's the same warmongers that would have advised him to get into the Iraq war on the first time."}, {"time": 2289, "text": "That is to me is not a good guy."}, {"time": 2292, "text": "That to me is someone who does not feel remorse for their responsibility in killing not only many Americans, but some of us think that, you know, dead Iraqis isn't necessarily ideal either."}, {"time": 2303, "text": "Okay, let's talk a bit about war."}, {"time": 2307, "text": "Maybe you can also correct me on something."}, {"time": 2309, "text": "The first time I found myself into Barack Obama was, I don't know how many years ago this was, but when I maybe heard a speech of his about him speaking out against the war."}, {"time": 2326, "text": "And him, I think it's on record saying he was against the war before it was happening."}, {"time": 2332, "text": "But he wasn't in Senate at the time, so it was very easy for him to say this."}, {"time": 2335, "text": "But see, like people say that, people say that."}, {"time": 2338, "text": "People say like it was easy and it was some people say it's like strategically the wise thing to do given some kind of calculus, whatever."}, {"time": 2347, "text": "But I, to this day give him, that's the reason I've always given him props in my mind."}, {"time": 2353, "text": "Like this is a man of character, like he makes, I also personally really value great speeches."}, {"time": 2359, "text": "I think speeches are really important for leaders because they inspire the world."}, {"time": 2363, "text": "It's like one of the most best things you can contribute to the world is great, like through intellect, mold ideas in a way that's communicable to like a huge number of people."}, {"time": 2374, "text": "Yeah, it's better to persuade than to force in every instance."}, {"time": 2377, "text": "That's where I disagree with Chomsky said, like if you're, Chomsky's whole idea was that like if you're really eloquent speaker, that means your ideas aren't that good."}, {"time": 2388, "text": "That's nonsense."}, {"time": 2390, "text": "So I think that's a way for him to describe like I speak in a very boring way."}, {"time": 2394, "text": "Maybe that's a pitch for this podcast."}, {"time": 2396, "text": "I speak boring so that the ideas are the things you value and it's also useful to go to sleep."}, {"time": 2402, "text": "But that's why I really liked Obama throughout his life and still do."}, {"time": 2409, "text": "But when I first like saw this is for some reason you can disagree, I thought he's a man of character."}, {"time": 2415, "text": "It's when most politicians, most people who are trying to calculate and rise in power, I think were for the war or too afraid to be against the war."}, {"time": 2425, "text": "That's why I liked Bernie Sanders and that's why I liked like in the early days Obama for speaking out against the war and not like in this weird activist way."}, {"time": 2437, "text": "Not weird, but not saying I'm an activist, but like just saying the common sense thing and being brave enough to say the common sense thing without like having a big sign and saying I'm going to be the antiwar candidate or something like that, but just saying this is not a good idea."}, {"time": 2457, "text": "And I think it's for those of us who are old enough to remember, it's pretty despicable what happened with Tulsi in 2020."}, {"time": 2464, "text": "She was the biggest antiwar candidate and she was marginalized within her own party, which I guess you can make sense."}, {"time": 2470, "text": "She's just a congresswoman from Hawaii."}, {"time": 2472, "text": "But the corporate press did everything in their power to diminish her and pretend she didn't exist."}, {"time": 2479, "text": "And for those of us who remember where 12 years prior, when George W. Bush had the Republican National Convention in New York and it was the biggest protest in history and the Iraq war led to democratic landslides in 2006 and 2008, to have that completely not part of the Democratic Party in 2020 is both shocking and reprehensible."}, {"time": 2503, "text": "Hey, Michael, you don't have to say, hey, Michael, you just say knock, knock, okay."}, {"time": 2514, "text": "What did the volcano say to his true love?"}, {"time": 2525, "text": "These jokes are better when you know how to speak English."}, {"time": 2529, "text": "It was actually in Russian, I did Google translate, okay."}, {"time": 2533, "text": "Back to your book, In the Suffering, you somehow turned it positive."}, {"time": 2538, "text": "And as one who's wearing, who's the representative of the black pill in this conversation, what are some of the darker moments?"}, {"time": 2545, "text": "What are some of the hardest challenges of putting together this book, the white pill?"}, {"time": 2550, "text": "Content, content, content."}, {"time": 2552, "text": "So if I'm having a page in about Reagan taking on Gerald Ford in the 1976 presidential primaries, I'm going to have to read like 20."}, {"time": 2563, "text": "So it's the thing like if there'll be some times I'll remember some quote somewhere and then I have to spend an hour trying to find it because I want it to be as dense with information as possible."}, {"time": 2574, "text": "Like how do you structure the main philosophical ideas you want to convey?"}, {"time": 2581, "text": "Is that already planned out?"}, {"time": 2583, "text": "No, the book changed entirely from its conception."}, {"time": 2586, "text": "So my buddy Ryan Holiday had a series of books, still does, where he takes the ideas of the Stoics and he applies them to contemporary terms."}, {"time": 2596, "text": "He has this whole cottage industry that he's doing very well with."}, {"time": 2598, "text": "And I'd asked him years ago if I could do that with Camus and he's like, sure, go for it."}, {"time": 2603, "text": "And I was going to rework Camus, The Myth of Sisyphus."}, {"time": 2607, "text": "And I read it recently, reread it, and this wasn't the book I remembered at all."}, {"time": 2612, "text": "And I'm like, okay, I'm going to write the book that I remembered."}, {"time": 2615, "text": "But the more I was writing it, one of the things I always yell at conservatives about, there's a long list, is they don't talk about the great victory of conservatism, which was the winning of the Cold War without firing a shot."}, {"time": 2631, "text": "And I said, you can't expect the New York Times to tell this story because the blood is on their hands."}, {"time": 2635, "text": "And I'm like, well, Michael, instead of complaining about it, why don't you do it?"}, {"time": 2641, "text": "Why don't you talk?"}, {"time": 2642, "text": "That is a great example of the good guys winning over the bad guys."}, {"time": 2646, "text": "And that's become, A, the victory is beautiful."}, {"time": 2651, "text": "But also pointing out to people, when people are like, oh, things are worse than they've ever been, they don't appreciate how bad things were in the 30s, what Stalin was doing overseas and how people in the West were advocating to bring that here."}, {"time": 2664, "text": "So that's kind of pointing out how bad things were and how good they became."}, {"time": 2671, "text": "And you don't have to be a Republican or conservative to be delighted at the collapse of totalitarianism and the peaceful liberation of half the world."}, {"time": 2679, "text": "So that's a picture of the good guys winning."}, {"time": 2681, "text": "Well, how does that connect to Sisyphus and maybe to speak deeper to life and whatever the hell this thing is, which is what I remember the myth of Sisyphus being about."}, {"time": 2695, "text": "So where does the threat of Camus sort of lie in the work that you're doing?"}, {"time": 2702, "text": "So the myth of Sisyphus, which I had remembered incorrectly, is actually just a five to seven page coda to the whole book at the very end."}, {"time": 2712, "text": "You only need to read that little essay called The Myth of Sisyphus."}, {"time": 2715, "text": "The broader work is about Camus's concept of the absurd and the absurd man within literature."}, {"time": 2721, "text": "And it's just like, I don't really care about the character in Dostoevsky and all this other stuff that you're talking about."}, {"time": 2725, "text": "It's of no relevance."}, {"time": 2727, "text": "But the myth of Sisyphus, the myth itself, not the book or the essay of his, is this Greek character and Sisyphus is forced in hell to roll a rock up a hill for eternity."}, {"time": 2739, "text": "At the very last moment, the rock falls away."}, {"time": 2742, "text": "And Camus's takeaway from the story is that we must imagine Sisyphus happy."}, {"time": 2748, "text": "And there's several interpretations of this, but one is once you accept that you are living an absurdist existence, once you own your reality, it loses its bite."}, {"time": 2762, "text": "And you can start with that as your kind of baseline."}, {"time": 2766, "text": "And bite is suffering."}, {"time": 2769, "text": "And hopelessness."}, {"time": 2771, "text": "So I think when people look at how much ridiculousness is happening in America and it's escalating, you can either think, oh, all is lost."}, {"time": 2783, "text": "And I think you and I have lived our lives like this."}, {"time": 2785, "text": "You can live life more like a surfer, whereas you're never going to control the ocean."}, {"time": 2790, "text": "But you can sure enjoy that ride and stop."}, {"time": 2793, "text": "If you're trying to control the waves, yeah, you're done."}, {"time": 2796, "text": "But if you're like, all right, I've got my board, I'm going to see where this takes me."}, {"time": 2801, "text": "Surfing from what I understand is a pretty fun activity."}, {"time": 2804, "text": "And also sometimes dangerous, but you'd have to ask Tulsi about that."}, {"time": 2808, "text": "So we were offline talking about Stalin and the evils of the Soviet regime."}, {"time": 2818, "text": "One of the things I mentioned, I watched the movie, Mr. Jones, but it's about the 1930s, all the more the, what would you say, the torture of the Ukrainian people by Stalin."}, {"time": 2833, "text": "One interesting thing to me that I'd love to hear your opinion about is the role of journalism in all of this and also about 1930s Germany."}, {"time": 2845, "text": "So what's the role of journalists and intellectuals in a time when trouble is brewing."}, {"time": 2854, "text": "But it requires a really sort of brave and deep thinking to understand that trouble is brewing."}, {"time": 2862, "text": "Like if you were a journalist or if you were just like an intellectual, a thinker, but also a voice in the space of public discourse, what would you do in 1930s about Stalin, about how the more, and what would you do about Nazi Germany in 1937, 1938?"}, {"time": 2883, "text": "So that's really funny that you asked that because currently how the book is structured, it's like books often follow a three act structure, right?"}, {"time": 2891, "text": "So act three is the 80s, act one is the 30s, and act two is going to be like, all right, let's suppose you were in the 30s."}, {"time": 2899, "text": "Are you just going to give up?"}, {"time": 2900, "text": "Are you just going to be like, well, we're screwed?"}, {"time": 2902, "text": "And you'd be right to say things are going to be very bad for a long time."}, {"time": 2905, "text": "Or are you going to be one of those few who are like, we're going to do something about this and we're going to go down swinging."}, {"time": 2912, "text": "There are two books I can recommend, which are just masterpieces that are written by women that just are historians that are just superb."}, {"time": 2921, "text": "There's a book called Beyond Belief by Deborah Lipschdott."}, {"time": 2923, "text": "She talks about the rise of Nazi Germany as seen through the press."}, {"time": 2927, "text": "And what was amazing, and she does a great job empathizing with the press and understand their perspective, is we remember, and Chamberlain gets a bad rap, Neville Chamberlain for kind of appeasing Hitler, because not that long ago they had the Great War, they had World War I, and they had the carnage that the earth had never seen before."}, {"time": 2946, "text": "And when you had people made out of meat, meeting industrial machines, and plastic surgery was invented as a consequence of this, they're coming back mangled and disfigured."}, {"time": 2954, "text": "And for what?"}, {"time": 2956, "text": "And this was a world where the Kaiser was the most evil person ever lived."}, {"time": 2960, "text": "And we all had the Western propaganda about the Hun and all the rapes and all this barbarism and blah, blah, blah."}, {"time": 2967, "text": "So not that long later, when you're hearing all this propaganda, which was factual, about Hitler, it's like, we heard this, we heard this 20 years ago."}, {"time": 2977, "text": "This was all lies."}, {"time": 2979, "text": "Give us a break."}, {"time": 2982, "text": "And she has all the quotes from the different agencies and how they addressed it."}, {"time": 2987, "text": "Plus they had very limited information."}, {"time": 2989, "text": "It's not like Nazi Germany was an open society where reporters can walk around and they were under a lot of pressure as well in those areas."}, {"time": 2996, "text": "And Hitler himself was pretty good at, he let some stuff slip, but usually he made it seem like he wants peace."}, {"time": 3004, "text": "He wants world peace."}, {"time": 3005, "text": "This was amazing."}, {"time": 3006, "text": "They were making the argument that because all these Jews were being beaten up on the street, this proved, this was the hot take of the day, that Hitler was weak because since Hitler's a statesman and he can't control these hooligans, that shows his control and power is tenuous and this is all going to go away."}, {"time": 3024, "text": "By the way, Hitler thought that too."}, {"time": 3026, "text": "He was kind of afraid of the branchers, whatever, he was afraid of these hooligans a little bit."}, {"time": 3032, "text": "They were useful to him, but at a certain point, yeah, they can get in the way."}, {"time": 3038, "text": "That's why he wanted to get control of the military, the army, their regiment."}, {"time": 3042, "text": "If you want to take over the world, you can't do it with hooligans."}, {"time": 3045, "text": "You have to do it with an actual army."}, {"time": 3047, "text": "And then you had Kristallnacht, which was a nationwide pogrom, and then all the news agencies universally were like, oh, crap, we got this wrong, and the condemnation was universal."}, {"time": 3059, "text": "So that book traces the West's reaction to what's going on there and including the reaction to the insipid Holocaust as people being, you know, what they knew, when did they know."}, {"time": 3071, "text": "There was not ambiguity about people."}, {"time": 3074, "text": "I think there's this myth that she dispels that they didn't know the Holocaust was happening or they didn't care."}, {"time": 3082, "text": "They were aware, but they were already at war with Nazi Germany, like what literally what else could they do at that point, you know, to rescue all these Jews."}, {"time": 3091, "text": "So that's a superb book."}, {"time": 3093, "text": "And Ann Applebaum, I think the book is called Red Famine, came out fairly recently."}, {"time": 3098, "text": "And she brings the receipts."}, {"time": 3101, "text": "And she's a, you know, this is something I really hate with the binary thinkers, where the people think, oh, you know, if you're a Democrat, you're basically a communist, they call Joe Biden a Marxist."}, {"time": 3111, "text": "It's just like, you know, she's a hard lefty, she's, you know, has TDS."}, {"time": 3114, "text": "But this book just systemically lays out what Stalin did."}, {"time": 3119, "text": "By the way, I'm triggered by the binary thinkers."}, {"time": 3121, "text": "And for those who don't know, TDS 0011 is a trauma derangement syndrome."}, {"time": 3128, "text": "So they, you know, forced the starvation in this entire population."}, {"time": 3132, "text": "And it's not only that, it's like they knew if you weren't starving by looking at you, you were hiding food."}, {"time": 3141, "text": "So they'd come back to your house at night and break your fingers in the door, or take, burn down your house."}, {"time": 3147, "text": "And now you're on the street without food because you lied, because this is the people's food."}, {"time": 3151, "text": "You're a kulak, you're a landowner."}, {"time": 3152, "text": "And very quickly, a kulak, which meant like peasant landowner, became anyone who had a piece of bread."}, {"time": 3157, "text": "And this was systemic and ongoing."}, {"time": 3160, "text": "And many people in the press did not believe it."}, {"time": 3165, "text": "There was a British journalist, I believe, who got out of the train, Ukraine, like one town earlier and walked and he described all this."}, {"time": 3173, "text": "And he was mocked and derided."}, {"time": 3175, "text": "And this is just anti Russian propaganda."}, {"time": 3178, "text": "Because at the time, in the 30s, this was socialism had come to fruition."}, {"time": 3182, "text": "This was a noble experiment."}, {"time": 3183, "text": "I'd seen the future and it works, as I think Sidney Webb was the guy who said that."}, {"time": 3188, "text": "And the premise was, let's see what happens."}, {"time": 3192, "text": "We've never tried something like that."}, {"time": 3193, "text": "And they were perfectly happy to have this experiment happen overseas at the price of the Russian people."}, {"time": 3200, "text": "Because it's like, you know what, maybe this will be paradise on earth."}, {"time": 3203, "text": "And I address this in my book as well."}, {"time": 3206, "text": "This superb essay, I think, by Eugene Genovese."}, {"time": 3210, "text": "And he talks about the question."}, {"time": 3212, "text": "The question being, what did you know?"}, {"time": 3214, "text": "And when did you know it?"}, {"time": 3216, "text": "What did you know about the concentration camps?"}, {"time": 3218, "text": "What did you know about the starvation?"}, {"time": 3219, "text": "What did you know about children being taught at school to turn in their parents for having some extra bread?"}, {"time": 3225, "text": "And his conclusion is, we all knew."}, {"time": 3227, "text": "And we all knew from the beginning, every bit of it."}, {"time": 3229, "text": "And we didn't care."}, {"time": 3231, "text": "Because we were more interested in promoting this ideology."}, {"time": 3234, "text": "So when people are kind of thinking the worst thing on earth is like Robert E. Lee statue being taken down to Washington, DC."}, {"time": 3242, "text": "We were being told, and especially in a much more limited news information world where now you have literally anyone can have a Twitter, but how many outlets were there, that this is, we're backwards, they're the future, they're scientific."}, {"time": 3258, "text": "We have the vagaries of the market, which led to the Great Depression."}, {"time": 3261, "text": "And when you see what was being put over on the American public at the time, anyone who thinks things are as bad now as they've ever been is simply delusional or ignorant."}, {"time": 3271, "text": "Yeah, I would say just as a small aside, that's why reading, as I'm almost done with The Rise and Fall of the Third Reich, it's a refreshes the, resets the palette of your understanding what is good and evil in the world that I think is really useful now."}, {"time": 3294, "text": "What helps me be really positive and almost naive on Twitter and in the world is by just studying history and comparing it to how amazing things are today."}, {"time": 3310, "text": "But in that time, what would you do?"}, {"time": 3318, "text": "What does a brave mind do?"}, {"time": 3321, "text": "And not just acts of bravery, but how do you be effective in that?"}, {"time": 3330, "text": "That's something I often think about."}, {"time": 3331, "text": "It's easy to be an activist in terms of just saying stuff."}, {"time": 3337, "text": "It's hard to be effective at your activism."}, {"time": 3340, "text": "One of the big questions historians have constantly is how did this happen?"}, {"time": 3344, "text": "A, to make sure it doesn't happen again, but this is Germany."}, {"time": 3348, "text": "This is not some kind of weirdo cult nation."}, {"time": 3351, "text": "They're very advanced, very in the land of poets and philosophers."}, {"time": 3355, "text": "How did it get to that point that they're just shooting children and everyone's cheering for this?"}, {"time": 3362, "text": "Specifically on the anti Semitism and the Holocaust."}, {"time": 3364, "text": "But just the totalitarianism, the cult of Hitler and just this whole kind of thing."}, {"time": 3369, "text": "This is starting to drop, but there's two sides."}, {"time": 3371, "text": "I don't know if you want to separate them."}, {"time": 3373, "text": "One is the totalitarianism and the entirety of the Nazi regime."}, {"time": 3378, "text": "And then there's the Holocaust, which is going, I would say, very specifically, as I think you're about to describe, is targeting Jews very much so."}, {"time": 3394, "text": "I don't know if you see those as two separate things."}, {"time": 3396, "text": "I think they're very interconnected."}, {"time": 3398, "text": "But I think if you look at it, everyone thinks that they'd be the ones putting up Anne Frank."}, {"time": 3405, "text": "But if you look at the numbers, they'd be the ones calling the Stasi on her or whoever the people were at the time, and not the Stasi, obviously, and patting themselves on the back for it."}, {"time": 3414, "text": "So sorry to pause on that."}, {"time": 3415, "text": "That's a really important thing."}, {"time": 3417, "text": "If you're listening to this, and you were in Germany at the time, you would have likely been willing to commit or at least keep a blind eye to the violence against Jews."}, {"time": 3431, "text": "You have to really sit with that idea that you would have been somebody who just sees this and is not bothered by it, and also very likely kind of understand this as a necessary evil or even a necessary good."}, {"time": 3447, "text": "And I think people think they would be the abolitionists or marching on Selma."}, {"time": 3452, "text": "The numbers don't add up to that at all."}, {"time": 3456, "text": "And I think the question would be like, what social... My friend was on Tinder, my friend Matt, who's a great dude."}, {"time": 3462, "text": "And the question was, what's the most controversial opinion you have?"}, {"time": 3466, "text": "This is New York."}, {"time": 3467, "text": "And the girl wrote, I hate Trump."}, {"time": 3470, "text": "And what people perceive themselves as being courageous in saying and doing, and what is the actual social costs of you saying or doing this are two very disconnected things."}, {"time": 3481, "text": "And we're also trained by corporate media to have completely vapid, uninteresting, banal ideas and yet regard ourselves as revolutionaries."}, {"time": 3492, "text": "There are people who still in New York will take pride because they have a gay friend."}, {"time": 3498, "text": "And it's like, first of all, who cares?"}, {"time": 3501, "text": "But second of all, you are not a hero."}, {"time": 3505, "text": "And that person is not your prop, by the way."}, {"time": 3506, "text": "That's another big problem."}, {"time": 3508, "text": "Which is why I'd like to give Richard Wolff a shout out for being an intellectual who talks about communism."}, {"time": 3514, "text": "I think it takes kind of a heroic intellectual right now to speak about communism seriously."}, {"time": 3521, "text": "There's difficult waters to tread."}, {"time": 3524, "text": "Is that the expression?"}, {"time": 3525, "text": "There's difficult paths to walk."}, {"time": 3527, "text": "I love watching a robot try to use idiom in a language he doesn't even know."}, {"time": 3532, "text": "0011."}, {"time": 3533, "text": "I'm quite deeply hurt by the binary comment."}, {"time": 3538, "text": "Your feeling has gone from one to zero."}, {"time": 3544, "text": "My buffers have overflown."}, {"time": 3547, "text": "But there's difficult, I feel like communism is universally seen as a bad thing currently in intellectual circles."}, {"time": 3555, "text": "Or actually maybe some people disagree with that."}, {"time": 3557, "text": "People say far left, people are trying to, there's some people who argue the BLM movement is some kind of a Marxist."}, {"time": 3568, "text": "I don't really follow the deep logic in that, whatever."}, {"time": 3574, "text": "They said they were formed by Marxism, the founder, co founder."}, {"time": 3577, "text": "But stating that is different than..."}, {"time": 3581, "text": "There's Marx the totalitarian, there's also Marx the revolutionary."}, {"time": 3584, "text": "I think they're talking more like we're revolutionaries, we're going to overthrow the status quo."}, {"time": 3589, "text": "But we can have that further discussion."}, {"time": 3591, "text": "But I just don't think they speak deeply about political systems and saying communism is going to be the righteous system."}, {"time": 3601, "text": "There's not a deep intellectual discourse is what I mean."}, {"time": 3603, "text": "But if you were to try to be on stage with the Jordan Peterson, to me the brave thing now, it would be to argue for communism."}, {"time": 3613, "text": "It'd be interesting to see."}, {"time": 3615, "text": "Not many people do it."}, {"time": 3616, "text": "I certainly wouldn't be willing to do it."}, {"time": 3618, "text": "I don't have enough..."}, {"time": 3619, "text": "I don't, first of all, I don't believe it, but second of all, it's a very difficult argument to make because you will get so much fire, which is why I like Richard Wolff, he's one of the people who is quite rigorously showing that there's some good ideas within the system of communism, specifically saying that attacking more the negative sides of capitalism."}, {"time": 3642, "text": "Just saying that capitalism potentially is more dangerous than communism."}, {"time": 3647, "text": "I mean, I disagree with that, but I think it's a..."}, {"time": 3651, "text": "I love how something is like we've got a body count of 60 million, but this everything is potentially, like water can drown everyone on earth."}, {"time": 3659, "text": "So this is incoherent."}, {"time": 3660, "text": "Well, I think nuclear weapons are bad, but nuclear energy is good."}, {"time": 3665, "text": "Well, nuclear weapons also can be good."}, {"time": 3667, "text": "You can easily make the argument, which I don't know that I subscribe to, that nuclear weapons prevented boots on the ground war, or it caused them to be much more contained."}, {"time": 3677, "text": "And they're also quite effective at changing the direction of an asteroid that's about to hit earth, as I've learned from a movie."}, {"time": 3685, "text": "Armageddon."}, {"time": 3686, "text": "And they're actually useful as Elon Musk has claimed for prior to colonizing Mars, making it more habitable."}, {"time": 3696, "text": "Got to do something."}, {"time": 3697, "text": "But yes, but I guess what I'm saying is there's a place for nuance."}, {"time": 3706, "text": "And there's some topics so hot, like communism, where nuance is very difficult to have."}, {"time": 3713, "text": "And I feel like with Nazi Germany, it was a similar thing at the time."}, {"time": 3719, "text": "You want to talk about Jeanette Rankin, who was one of my favorite people."}, {"time": 3723, "text": "So Jeanette Rankin was the first woman elected to Congress."}, {"time": 3726, "text": "She was elected before women's suffrage was a constitutional amendment from Montana."}, {"time": 3732, "text": "She was elected in 1916."}, {"time": 3736, "text": "She was one of a handful of people to vote against the US going into the Great War, which was the right call at the time."}, {"time": 3743, "text": "She was a pacifist Republican as well, coincidentally."}, {"time": 3746, "text": "She lost her seat, ran again in, was it 1940?"}, {"time": 3752, "text": "Got the seat again, and was the only person to vote against getting into World War II."}, {"time": 3758, "text": "It was not a unanimous choice."}, {"time": 3760, "text": "Jeanette Rankin was the one person."}, {"time": 3762, "text": "And she said, you can no more win a war than you can win a hurricane."}, {"time": 3766, "text": "So she's one of these interesting, and talk about bravery."}, {"time": 3770, "text": "You're the one vote after Pearl Harbor to say, we're not doing this."}, {"time": 3775, "text": "And I mean, the pressure she must have been under at the time is, and of course, many people are not interested in hearing her perspective."}, {"time": 3782, "text": "She's crazy."}, {"time": 3783, "text": "She's evil, blah, blah, blah."}, {"time": 3784, "text": "It's also funny, someone on my Twitter when I talked about her goes, maybe she had Hitler's sympathies."}, {"time": 3788, "text": "Like, yeah, Ms. Rankin was a big fan of Hitler."}, {"time": 3792, "text": "You figured it out, guys."}, {"time": 3793, "text": "Do you think there's an argument to be made that United States should not have gotten involved in World War II?"}, {"time": 3800, "text": "Oh, easy."}, {"time": 3801, "text": "An easy argument."}, {"time": 3802, "text": "The argument, I talk about this in The New Right."}, {"time": 3805, "text": "So on internet circles, there's something called Godwin's Law, which means the longer an internet conversation goes on, the probability someone gets compared to Hitler becomes one."}, {"time": 3817, "text": "In certain New Right circles, the longer the conversation goes on, the more likelihood that the argument will become we shouldn't have ended World War II also becomes one."}, {"time": 3826, "text": "And the argument is, at the very least, stay back, let Hitler and Stalin kill each other off, and then go in and knock off the weaker one."}, {"time": 3834, "text": "And you're going to be saving, destroying two nightmare systems."}, {"time": 3839, "text": "And I think that's an easy argument to make."}, {"time": 3840, "text": "Now, it's hard to pull off after Pearl Harbor."}, {"time": 3842, "text": "But in terms of strategy, I don't think that's a tough sell."}, {"time": 3847, "text": "What about after Pearl Harbor?"}, {"time": 3848, "text": "I mean, that's what I'm saying."}, {"time": 3849, "text": "After Pearl Harbor, how are you going to sell it to the people?"}, {"time": 3851, "text": "The argument is, blah, blah, the Holocaust."}, {"time": 3853, "text": "The Holocaust, there's no scenario where that doesn't happen, really, unless you're going in way earlier."}, {"time": 3859, "text": "But even so, Hitler had said, if the Jews launch another war, we're going to wipe them from the face of the earth."}, {"time": 3865, "text": "So the Jews are being held hostage by Hitler as an argument for this."}, {"time": 3867, "text": "Another thing he did, which was diabolical, is in order to make it that people could not accept Jews as refugees, if they were going to leave Germany, they had to be penniless."}, {"time": 3879, "text": "So now you have, it's not like they're coming over with money and they can take care of themselves."}, {"time": 3885, "text": "They're going to be completely destitute."}, {"time": 3886, "text": "It makes it harder to accept them, yeah."}, {"time": 3887, "text": "Millions of destitute people who don't speak the language, it's a tough sell."}, {"time": 3890, "text": "So speaking of good ones law, what do you make of this condition, Trump derangement syndrome?"}, {"time": 3900, "text": "And the idea of comparing Trump to Hitler?"}, {"time": 3904, "text": "I think it's despicable."}, {"time": 3906, "text": "And I'll give you an example, something parallel that I think more people should be regarding as despicable."}, {"time": 3912, "text": "Earlier in 2020, we were all told that unless we were in Syria immediately, the Kurds were going to be exterminated."}, {"time": 3920, "text": "They invoke the Holocaust."}, {"time": 3922, "text": "This is going to be another genocide."}, {"time": 3924, "text": "And if you're not for this, you're basically forcing another Holocaust."}, {"time": 3929, "text": "None of the people who use this argument, we didn't go to Syria, the Kurds were exterminated, they just vanished from the news, had any consequences for using this kind of a comparison."}, {"time": 3939, "text": "So I think it's really kind of fatuous."}, {"time": 3944, "text": "And I think it's amazing that people think Hitler's the only tyrant who ever lived."}, {"time": 3949, "text": "Like everyone who's bad is specifically Hitler."}, {"time": 3952, "text": "You know how you know he's not Hitler?"}, {"time": 3954, "text": "Because you can tweet at him, and no one comes to your house to kill your family."}, {"time": 3958, "text": "Like that's kind of a big difference."}, {"time": 3961, "text": "Also there between Trump and many of his critics is that his grandchildren will be raised as Jews."}, {"time": 3967, "text": "So that's also kind of a, and Deborah Lipschad talks about this a lot."}, {"time": 3971, "text": "The New York Times at the time, there's another book called Buried by the Times, which talks about the New York Times in the World War II."}, {"time": 3979, "text": "Because the idea that Jews weren't white was the Hitler idea, the New York Times at the time, Salzburger, wanted to be against this idea."}, {"time": 3990, "text": "So they specifically downplayed the antisemitism as opposed to the Nazis are being oppressive."}, {"time": 3997, "text": "So the argument that you can separate Nazism from antisemitism is a historical debate people have."}, {"time": 4004, "text": "And my perspective is, I think it's, I do not find it convincing that you can separate those two."}, {"time": 4011, "text": "I think antisemitism was essential to Nazism."}, {"time": 4014, "text": "I think Nazism and Mussolini's fascism have very big differences."}, {"time": 4019, "text": "And do you think, do you think antisemitism was fundamental to who Hitler was or was it just that?"}, {"time": 4025, "text": "So this is the interesting thing is like, was it a tool that he saw as being effective?"}, {"time": 4032, "text": "No, he believed it."}, {"time": 4034, "text": "So why do you see those as intricately connected?"}, {"time": 4037, "text": "Could Hitler have accomplished the same amount or more without the Holocaust?"}, {"time": 4044, "text": "Because think about how many resources you had to divert at a time where you have Operation Barbarossa with Stalin."}, {"time": 4049, "text": "So why are they connected?"}, {"time": 4050, "text": "Why are they so connected?"}, {"time": 4053, "text": "Is it because Hitler was insane or was he a bad strategist or what?"}, {"time": 4058, "text": "He was obviously a bad strategist."}, {"time": 4060, "text": "He had no need to open a second front."}, {"time": 4062, "text": "His generals, my understanding, told him this is crazy."}, {"time": 4065, "text": "It didn't work out for him at all."}, {"time": 4068, "text": "I mean, to draw Russia and her resources into that war, it makes absolutely no sense in retrospect."}, {"time": 4075, "text": "There's a book about, I forgot what it's called, where it talked about him at that point was just high all the time on amphetamines and that could have affected his thinking."}, {"time": 4081, "text": "Yeah, there's a really good book on drugs."}, {"time": 4083, "text": "I forget what it's called, but yeah, it's a really good one."}, {"time": 4087, "text": "But it was, I mean, scapegoating is a big part and parcel of the Nazi mythology and this kind of one universal figure to explain this kind of skeleton key."}, {"time": 4100, "text": "But it could have been the communists."}, {"time": 4102, "text": "I mean, that could have been the source of the hatred."}, {"time": 4104, "text": "But the communists didn't get Germany into World War I like he said the Jews did."}, {"time": 4108, "text": "It seems to me that the atrocity of the Holocaust is the reason we see Hitler as evil."}, {"time": 4116, "text": "No, the reason we see Hitler as evil is because of World War II propaganda still."}, {"time": 4120, "text": "Because we don't see Stalin as evil."}, {"time": 4122, "text": "Right, that's my main point."}, {"time": 4123, "text": "We don't see Mao as evil to that extent."}, {"time": 4125, "text": "I think that... Why?"}, {"time": 4127, "text": "Like why would you say that?"}, {"time": 4130, "text": "The nature of that propaganda."}, {"time": 4131, "text": "Because I think a lot of the problem for certain type of mentality is Hitler didn't mass murder equally."}, {"time": 4136, "text": "So as long as you're killing just one group, it's a problem."}, {"time": 4139, "text": "But if you're murdering everyone equally, all of a sudden, it's like, what are you going to do?"}, {"time": 4143, "text": "So the fact like you were saying, the Hall of the Moor is not common knowledge."}, {"time": 4146, "text": "The fact that Mao's 50 million dead are not common knowledge and Richard Nixon can be raising a glass to him in China."}, {"time": 4154, "text": "These are things that I think the West has not done a good job reconciling."}, {"time": 4161, "text": "Frank."}, {"time": 4162, "text": "Frank who?"}, {"time": 4163, "text": "Frank, you for being my friend, Michael."}, {"time": 4166, "text": "And the heart attacks will say, Frank, you for being my friend."}, {"time": 4170, "text": "This is... You got to do it like this."}, {"time": 4176, "text": "Now back to Hitler."}, {"time": 4186, "text": "We kind of talked about it a little bit in terms of how to... What is the brave thing to do in the time of Nazi Germany?"}, {"time": 4194, "text": "But do you think, I mean, I'm not even going to ask about Stalin in terms of could Stalin have been stopped?"}, {"time": 4200, "text": "Because probably the answer there is no."}, {"time": 4202, "text": "But on the Hitler side, could Hitler have been stopped?"}, {"time": 4205, "text": "I think a lot of these things, a lot of luck has to play with it."}, {"time": 4209, "text": "He was almost assassinated."}, {"time": 4211, "text": "If you mean by like the West, it's very hard."}, {"time": 4215, "text": "By the German people too."}, {"time": 4217, "text": "I mean, like if we're politically speaking, there was a rise to power through the thirties, through the twenties, really, I mean, like can whoever..."}, {"time": 4228, "text": "It's not about Hitler."}, {"time": 4229, "text": "It's about that kind of way of thinking, that totalitarian control that always leads to trouble at sometimes at a mass scale."}, {"time": 4240, "text": "Could that have been stopped in Germany or maybe in the Soviet Union?"}, {"time": 4244, "text": "I think this is one of the best arguments against radicalization in the States, which is how do you engage when you have like 30% of the population who are members of a party, which is dedicated to systemically overthrowing the existing democracy."}, {"time": 4261, "text": "Stalin gave orders that the communists who had a pretty sizable population, the Reichstag, that their target shouldn't be the Nazis, but the liberals and the social Democrats and they invented the term social fascist for them."}, {"time": 4276, "text": "So instead of, they're just like jihadis, instead of taking their sights on Nazism, they set their sights on the moderates because they figured the choice between Hitler and us we're going to win."}, {"time": 4288, "text": "And this was a huge gamble and they were all killed or had to flee and ones who fled were killed also by Stalin to my understanding."}, {"time": 4296, "text": "So this is an easy way where he could have been certainly heavily mitigated."}, {"time": 4301, "text": "What about France and England that it was obvious that Hitler was lying and they wanted peace so bad that they were willing to put up with it even after Czechoslovakia?"}, {"time": 4312, "text": "Like this is the anti pacifist argument, which is like they should have threatened military force more."}, {"time": 4324, "text": "But then the other anti, the anti anti pacifist argument is if you're going to remember Barack Obama had that, the red line, if you cross this red line in Syria, we're going to go in and Assad or whatever is like, yeah, cool."}, {"time": 4335, "text": "And he's like, oh, okay, well, sorry."}, {"time": 4338, "text": "So if you're threatening force, there's the great song lyric, don't show your guns unless you intend to fight, right?"}, {"time": 4345, "text": "So if it's very clear with, with free countries through what's in the press, whether the institutional will is there to follow through on these threats."}, {"time": 4355, "text": "So I think we have been very hard for Chamberlain to rally the British people to take on Hitler just after the great, I mean, the suffering that Britain's took the great war, they still, you know, obviously it means so much more to them than does to us in the West."}, {"time": 4370, "text": "What about what do you make of Churchill then?"}, {"time": 4373, "text": "Like why was Churchill able to rally the British people?"}, {"time": 4376, "text": "Why was he like, do you give much credit to Churchill for being one of the great forces in stopping Hitler in World War II?"}, {"time": 4388, "text": "I don't think that's really in dispute."}, {"time": 4390, "text": "I think he was very much regarded as this kind of the right man at the right time."}, {"time": 4396, "text": "And I think Chamberlain took a gamble."}, {"time": 4399, "text": "He, the expression peace in our time was Neville Chamberlain when he signed the appeasement with Hitler and he goes, we now have peace in our time, now go home and get a good night's sleep."}, {"time": 4409, "text": "That's what he said."}, {"time": 4410, "text": "Cause he's like, all right, you know, he's going to stop here."}, {"time": 4413, "text": "And it's not impossible that if you just gave him, like if you gave Saddam Hussein Kuwait, it's not impossible that he's not going to, you know, invade Saudi Arabia next or something like that."}, {"time": 4427, "text": "The last thing I've read, it's like, of course there's, there's a, it's not impossible, but when you're in the room with Hitler, you should be able to see like man to man, like, like to me, a great leader should be able to see past the facade and see like, like, yes, everything in life is a risk, but it seems like the right risk to take with Hitler, like it's surprising to me."}, {"time": 4458, "text": "I know there's charisma, but it's surprising to me."}, {"time": 4460, "text": "People did not see through this facade."}, {"time": 4463, "text": "I really hate the idea of hindsight and everything being 20, 20, and I think it's a very good idea."}, {"time": 4469, "text": "Generally, I'm thinking generally not in this specific instance to give our ancestors more credit than they, than, than we tend to give them because people often, here's a great example from another context, which is a lightning rods."}, {"time": 4482, "text": "People always talk about religious people being stupid and superstitious and they weren't, they often were very well reasoned and example of this is lightning rods, which is every year whatever town, the church was the tallest building and that's the one that always got hit by lightning and got caught on fire."}, {"time": 4499, "text": "Now what, it's a coincidence that it's always the church, like that makes logical sense that they didn't realize, well, it's because the tallest and therefore that attracts electricity."}, {"time": 4511, "text": "And in fact, when they invented lighting rods, this is a controversy because it's like, well, how is God going to show his displeasure if now it's striking this lightning rod not burning down the church?"}, {"time": 4520, "text": "So a lot of times things are a lot more coherent than we give them credit for."}, {"time": 4526, "text": "And again, Chamberlain didn't, he's the head of a parliamentary party."}, {"time": 4532, "text": "So he does not have the freedom in a sense that a Hitler would to be like, all right, we're doing this again, boys."}, {"time": 4538, "text": "We don't know what it's like in the room with Hitler."}, {"time": 4541, "text": "That's, that's, we really have no idea."}, {"time": 4543, "text": "But I think you have to think about that, right?"}, {"time": 4545, "text": "Yeah, but you can, I can very easily see him in the room being very calm and charming."}, {"time": 4551, "text": "And then you think, okay, the guy with the speeches is the act and he's putting on a show for his people and this is the real one."}, {"time": 4560, "text": "So let's, let's take somebody as an example."}, {"time": 4562, "text": "Let's take our mutual friend, Vladimir Putin."}, {"time": 4568, "text": "I don't know why saying his name makes my voice crack."}, {"time": 4571, "text": "Because he's scared he can hear you."}, {"time": 4573, "text": "It's like Beetlejuice."}, {"time": 4574, "text": "Volodya."}, {"time": 4575, "text": "So there's a lot of people that... Was he the one who built you?"}, {"time": 4583, "text": "No, that was a, that was a collaboration."}, {"time": 4589, "text": "It's a double blind engineering effort where I was not told of who my maker was."}, {"time": 4599, "text": "There's a backstory, but..."}, {"time": 4602, "text": "There's a talking cricket."}, {"time": 4603, "text": "Pinocchio."}, {"time": 4604, "text": "He'll be a real boy someday."}, {"time": 4612, "text": "I talk about him quite a bit because I find him fascinating."}, {"time": 4618, "text": "Now there's a, there's a really important line that people say, like, why does Lex admire Putin?"}, {"time": 4624, "text": "I do not admire Putin."}, {"time": 4627, "text": "I find the man fascinating."}, {"time": 4628, "text": "I find Hitler fascinating."}, {"time": 4630, "text": "I find a lot of figures in history fascinating, both good and bad."}, {"time": 4637, "text": "And the figures, just as you said, that are with us today, like Vladimir Putin, like Donald Trump, like Barack Obama, it's difficult to place them on the spectrum of good and evil because that's only really applies to like when you see the consequences of their action in a historical context."}, {"time": 4655, "text": "So there's some people who say that Vladimir Putin is evil."}, {"time": 4661, "text": "And based on our discussion about Hitler, that's something I think about a lot, which is in the room with Putin, and there's also a lot of historical descriptions of what it's like to be in the room with Hitler in the 1930s."}, {"time": 4677, "text": "There is a lot of charisma."}, {"time": 4679, "text": "In the same way, I find Putin to be very charismatic in his own way."}, {"time": 4685, "text": "The humor, the wit, the brilliance, there's a simplicity of the way he thinks that really, if taken at face value, looks like a very intelligent, honest man thinking practically about how to build a better Russia constantly, almost like an executive."}, {"time": 4716, "text": "He looks like a man who loves his job in a way that Trump, for example, doesn't, meaning like he loves laws and rules and how to..."}, {"time": 4725, "text": "There's no adversarial press, so that's going to help."}, {"time": 4729, "text": "And he's popular with his people, that's also going to help enormously."}, {"time": 4731, "text": "I'm talking about strictly the man, directly the words coming out of his mouth, like all the videos and interviews I watch, I'm based on that, not the press, not the reporting."}, {"time": 4743, "text": "You can just see that here's a man who's able to display a charisma that's not... Like I can see, that's why I love Joe Rogan, is like you could tell the guy is genuine and is a good person."}, {"time": 4758, "text": "And you could tell immediately that once you meet Joe, that he's going to be offline, also a good person."}, {"time": 4764, "text": "You could tell there's signals that we send that are difficult to describe."}, {"time": 4769, "text": "In the same way, you could tell Putin is like he genuinely loves his job and wants to build a better Russia."}, {"time": 4778, "text": "There's the argument that he is actually an evil man behind that charisma, or is able to assassinate people, limit free press, all those kinds of things."}, {"time": 4794, "text": "Like that's... What do we do with that?"}, {"time": 4799, "text": "So what do human beings like journalists or what do other leaders when they're in their room with Putin do with those kinds of notions in deciding how to act in this world and deciding what policy to enact, all those kinds of things?"}, {"time": 4816, "text": "Just like with Hitler, when Chairman is in the room with Hitler, how does he decide how to act?"}, {"time": 4823, "text": "Well, let's go back to my wheelhouse, which is North Korea."}, {"time": 4827, "text": "So when your entire world is based on being against Trump and everything Trump does is buffoonery or counterproductive, the conclusion of your reporting is going to be pretty much given."}, {"time": 4841, "text": "I was very hopeful that there would be some positive outlooks or outcomes rather of Trump's meeting with Kim Jong Un."}, {"time": 4849, "text": "It looked like there was a space for things to go a bit better."}, {"time": 4853, "text": "I talked about it a lot at the time."}, {"time": 4857, "text": "And Trump was under no illusions about who he was dealing with."}, {"time": 4865, "text": "People pretend that, oh, he was kind of naive."}, {"time": 4868, "text": "He had one of the refugees that had stayed the union, you know, lifting up his crutch."}, {"time": 4873, "text": "The first thing he sat down and talked to Xi Jinping about in Mar a Laga right after he became inaugurated was North Korea."}, {"time": 4879, "text": "Barack Obama said that when he sat down Trump in the White House during the transfer of power, he said North Korea is the biggest issue."}, {"time": 4887, "text": "So I think a good leader, whether or not you consider Trump a good leader, has to be aware of, all right, I'm going to have to have relationships of some kind, even if it's adversarial, with some really evil, evil, horrible people, which Kim Jong Un clearly is."}, {"time": 4907, "text": "Well, I don't think there's anybody that has a perspective that North Korean Kim Jong Un or ill are not evil, right?"}, {"time": 4919, "text": "But with, in 1930s Germany, isn't it a little bit more nuanced and difficult?"}, {"time": 4926, "text": "Yeah, because Hitler hasn't done anything yet and he's just a blowhard and he's an anti Semite, sure, but he's... What about like before the war breaks out, like what about the basic actionable anti Semitism when you're like just attacking, hurting?"}, {"time": 4942, "text": "Are you talking about Kristallnacht or are you talking about the Night of Long Knives?"}, {"time": 4945, "text": "Kristallnacht."}, {"time": 4946, "text": "So it's the Night of the Broken Glass."}, {"time": 4948, "text": "Yeah, yeah, the Long Knives is when he assassinated a bunch of his people, that was something different."}, {"time": 4953, "text": "Yeah, so like when you're actually attacking your own citizenry."}, {"time": 4957, "text": "Yeah, that was universally condemned, Kristallnacht, and that was very shocking, its level of barbarism to the West."}, {"time": 4967, "text": "Because I think we still want to believe, understandably, that things aren't as bad as they seem."}, {"time": 4977, "text": "We would rather..."}, {"time": 4979, "text": "This is why the North Korea book I did, Dear Reader, is used in a humorous framework because if you have to look, it's like looking to the sun."}, {"time": 4989, "text": "If you stared it straight on, it's very hard to do."}, {"time": 4992, "text": "So you have to kind of look at it obliquely and then you're kind of realizing the enormity of the depravity."}, {"time": 5000, "text": "And again, pogroms in Russia had been a thing for a very long time."}, {"time": 5006, "text": "And there's a difference between, okay, we're going to sack these villages and persecute people and we're going to systematically exterminate them."}, {"time": 5015, "text": "There's still levels of evil and depravity."}, {"time": 5018, "text": "So you did write the book, Dear Reader, on Kim Jong Il, Dear Reader, the unauthorized autobiography of Kim Jong Il."}, {"time": 5028, "text": "So that's the previous leader of North Korea."}, {"time": 5031, "text": "Third one is the un, no creativity on the naming."}, {"time": 5036, "text": "Well, no, this is intentional because it's a throwback to the dad."}, {"time": 5041, "text": "So there's been only three leaders in North Korea."}, {"time": 5046, "text": "So we've talked about the history of Hitler and Stalin, men like these."}, {"time": 5049, "text": "I think it's important to understand that the history of those kinds of humans, there's the history of North Korea is not well written about or understood, which is why your book is exceptionally powerful and important."}, {"time": 5061, "text": "So maybe in a big broad way, can you say who was, who is Kim Jong Il as a man, as a leader, as a historical figure that we should understand and why should we understand them?"}, {"time": 5079, "text": "So I wrote Dear Reader by going to North Korea and getting all their propaganda, which is translated into several languages because the conceit is everyone on earth is interested in them and wants to mirror their ideology."}, {"time": 5091, "text": "And he died in 2011 and you wrote the book in 2012."}, {"time": 5095, "text": "I went there in 2012."}, {"time": 5096, "text": "I wrote the book, came out in 2014."}, {"time": 5098, "text": "So Kim Jong Il is, though not an intellect, North Korea's version of Forrest Gump in that when they write their history, whenever something happens, he's there."}, {"time": 5108, "text": "And by telling his life story, it's in the first person, he's telling the history of North Korea."}, {"time": 5114, "text": "So I wanted to write the kind of book where in one book, and it's the kind of reading you could do in the beach or the bathroom, you're gonna get the entire history and know everything you need to know about North Korea in one accessible outlet."}, {"time": 5126, "text": "And it's what people don't appreciate about North Korea, there's several things, how bad it is."}, {"time": 5133, "text": "And this didn't happen overnight."}, {"time": 5135, "text": "This was very systemic that what this family did to that country where piece by piece, they did everything in their power to hermetically seal it from the rest of the world, ramp up the oppression, keep any information from coming in."}, {"time": 5150, "text": "And they're very creative and innovative in their style of manipulation and control."}, {"time": 5160, "text": "So there is a farcical element."}, {"time": 5164, "text": "So people in the West kind of get it wrong."}, {"time": 5165, "text": "They talk about, oh, they talk about when Kim Jong Il played golf for the first time, they get 17 holes in one."}, {"time": 5171, "text": "There's this one story about Kim Jong Il shrinking time."}, {"time": 5177, "text": "And this is a story, it sounds supernatural, but it's not."}, {"time": 5180, "text": "So Kim Jong Il is at a conference, the Dear Leader, and someone is giving a talk."}, {"time": 5185, "text": "And while that person is giving a talk, Kim Jong Il is taking notes and working on his work."}, {"time": 5191, "text": "And he has an aide who keeps interrupting him with questions and the speaker keeps stopping."}, {"time": 5196, "text": "And Kim Jong Il says, why are you stopping, goes, I see you're doing these other things."}, {"time": 5199, "text": "And he goes, no, no, I can do all these things at once, everyone's shocked."}, {"time": 5203, "text": "And they said, this is why Kim Jong Il looks at time, not like a plane, but like a cube, and he can shrink time."}, {"time": 5211, "text": "And my friend goes, do they mean multitasking?"}, {"time": 5214, "text": "And yes, Kim Jong Il is the only person in North Korea who's capable of multitasking."}, {"time": 5220, "text": "So in order to elevate him, they basically make everyone else in North Korea completely incompetent."}, {"time": 5229, "text": "And that has a purpose because should the leader go away, this country is going to collapse overnight."}, {"time": 5236, "text": "So they laugh in the West about all these newspapers show him at the factory and he's at the fish hatchery at the paper plant."}, {"time": 5245, "text": "They say the difference in North Korea is that the leader goes among the people and does what he calls field guidance."}, {"time": 5251, "text": "So he will go in that farm and be like, this is what you need to do."}, {"time": 5254, "text": "And he'll go here and he's so smart, he's good at everything."}, {"time": 5257, "text": "And thanks to him for sharing his wisdom with us."}, {"time": 5259, "text": "And he's not removed from the people like in every other country."}, {"time": 5263, "text": "Why does that seem to go wrong with humans, do you think that this kind of the structure where there's this one figure, this authoritarian, this totalitarian structure where there's one figure that's a source of comfort and knowledge?"}, {"time": 5280, "text": "Kim Jong Il is not good at farming."}, {"time": 5283, "text": "Kim Jong Il is not good at the machinery."}, {"time": 5286, "text": "It's all a complete lie."}, {"time": 5287, "text": "Or the things he'll point out will be things that are completely obvious."}, {"time": 5290, "text": "So here's another example that they use."}, {"time": 5292, "text": "In North Korea, they have something called the Tower of the Juche Idea, which is an obelisk, which looks like the Washington Monument."}, {"time": 5298, "text": "But it's completely different because it's got this like plastic torch at the top."}, {"time": 5303, "text": "And they talk about in their propaganda how all the architects got together and they said, oh, we should make this the second tallest stone obelisk in the world."}, {"time": 5315, "text": "And Kim Jong Il says, no, let's make it the tallest."}, {"time": 5319, "text": "They're like, we never thought of this before."}, {"time": 5321, "text": "And the way it's presented as if, and like, he's the first person to think of this, like these architects are having a brainstorming session at the Tower of the Juche Idea."}, {"time": 5329, "text": "They're like, all right, we got to do something innovative to put North Korea on the map."}, {"time": 5334, "text": "How about second biggest?"}, {"time": 5336, "text": "He's going to go for this."}, {"time": 5338, "text": "And then he's like, make, oh, we never thought of this."}, {"time": 5341, "text": "It's so, because I present it at face value, people sometimes say the book's a satire."}, {"time": 5346, "text": "It's not a satire."}, {"time": 5347, "text": "I downplayed all this stuff."}, {"time": 5349, "text": "It's a farce."}, {"time": 5350, "text": "Here's another example."}, {"time": 5351, "text": "North Korea is very big."}, {"time": 5352, "text": "And I think Russia is to some extent too, on amusement parks, funfairs, they call them, in the British style, because this is a chance for the people to all get together."}, {"time": 5361, "text": "And there was this amusement park, it's almost like South Park, Cartman, where there's all these rides."}, {"time": 5367, "text": "And Kim Jong Il's like, I'm not going to let any elderly or children take these rides until I put myself in danger and ride them myself."}, {"time": 5379, "text": "And they go, but dear leader, it's drizzling."}, {"time": 5382, "text": "And he goes, no, I have to make sure these rides are going to be safe for everyone, even during the light rain."}, {"time": 5389, "text": "They go, well, can we go on these rides with you?"}, {"time": 5392, "text": "I have to be the courageous one."}, {"time": 5394, "text": "And he's riding all the rides and they're standing there crying at his courage."}, {"time": 5398, "text": "But that's what's, and you ask all the things in one power."}, {"time": 5400, "text": "It's like, listen, I'm quite confident that those funfair engineers are in a position to ride Modest Mouse, whatever it's called, by themselves and be like, yeah, okay, this is good for the kids."}, {"time": 5411, "text": "Although to be fair, some of those amusement parks are pretty rusty and dangerous."}, {"time": 5417, "text": "That kind of propaganda, I guess what I'm playing a devil's advocate is like, it's comforting and it's useful."}, {"time": 5425, "text": "But it does seem that that naturally leads to an abuse of power."}, {"time": 5433, "text": "How can it be used correctly?"}, {"time": 5434, "text": "No one person has the intellect or the mind to understand the entirety of an economy, let alone every individual field of interest."}, {"time": 5442, "text": "Well, for example, you can have an artificial intelligence system that understands the entirety of it."}, {"time": 5449, "text": "Your affect just completely changed."}, {"time": 5450, "text": "The mask slipped."}, {"time": 5451, "text": "I guess you could have an artificial intelligence system."}, {"time": 5455, "text": "But the question is, can that, I mean, the human version of that is like, you can hire a lot of experts, right?"}, {"time": 5465, "text": "You can be an extremely good manager."}, {"time": 5467, "text": "Since everything's dynamic, they're not going to have the data to kind of manage it well."}, {"time": 5473, "text": "It seems that there's a, like what George Washington allegedly did, it seems like most humans are not able to fire themselves."}, {"time": 5481, "text": "You're not able to like, ultimately be a check on your own power."}, {"time": 5486, "text": "But that's not, if I was creating a human, that's not an obvious bug of the system that we would not be able to fire ourselves, to know when we have, I mean, it seems like that's something you have to know always, like that's something I often wonder is like, am I wrong about this?"}, {"time": 5509, "text": "Well, this is what we talked about earlier, what are the safety valves to make sure that, okay, if I am incorrect, or my knowledge is finite, Plato's cave kind of thing, what mechanisms are in place that my mistake or limited information isn't going to have the deleterious consequences?"}, {"time": 5526, "text": "And North Korea does not really have that, and as a result, they had polio in the 90s."}, {"time": 5530, "text": "So there is a, you write about it straight, but there's a humor to it, because it's an absurdly evil place, I suppose."}, {"time": 5541, "text": "A bunch of people, I asked, I said that I'm talking to you and a bunch of people ask questions."}, {"time": 5548, "text": "Oh, I got to hear from the plebs, you asked me before we started recording, I specifically said no, it was my contract."}, {"time": 5555, "text": "Yeah, and you gave, I gave you all the pink skittles or whatever."}, {"time": 5560, "text": "But they, So pink skittles, you know, pink."}, {"time": 5563, "text": "I'm trolling, Michael, let me explain to you how that works."}, {"time": 5567, "text": "We should go at malice.locals.com and sign up and pay, I think the membership fee is several thousand dollars, it's very, it's not."}, {"time": 5578, "text": "It's not for the layman."}, {"time": 5579, "text": "Yeah, but the service is excellent."}, {"time": 5583, "text": "You get a coat with it."}, {"time": 5584, "text": "But yeah, I went there, posted a lot of really brilliant people there, people should join that community."}, {"time": 5590, "text": "If you find Michael interesting, or if you just want to go and say why he's wrong, it's a great place to have that."}, {"time": 5597, "text": "It's not a good place for that, I assure you."}, {"time": 5601, "text": "A lot of really kind people."}, {"time": 5603, "text": "So anyway, there's a bunch of people ask that we should talk about humor."}, {"time": 5609, "text": "So pretend hypothetically speaking that I'm a robot asking you to explain humor to me."}, {"time": 5620, "text": "So dear reader, I mean, there's a humor, you so wonderfully dance between serious dark topics and then seriously dark humor."}, {"time": 5635, "text": "Can you try to, if you were to write like a, I don't know, a Wikipedia article, maybe a book about your philosophy of humor, what do you think is the role of humor in all of this?"}, {"time": 5646, "text": "A joke is like a baby."}, {"time": 5647, "text": "You can't dissect it and then put it back together and expect it to work."}, {"time": 5650, "text": "Trust me on this one."}, {"time": 5652, "text": "Despite no matter how you carve that thing up, it's not going to be working the next day."}, {"time": 5658, "text": "And you need it to sew those little sneakers with those hands."}, {"time": 5662, "text": "I don't know that humor is something that is very explainable."}, {"time": 5666, "text": "People there's something called claptor, where this is like the worst kind of humor where people applaud because they agree with what you're saying, as opposed to laughter."}, {"time": 5675, "text": "That's the poetry reading and the drag queens do that too, I think because of the nails."}, {"time": 5683, "text": "You laugh, it's a visceral reaction."}, {"time": 5685, "text": "When someone on Twitter is insisting, you know, that's not funny, you're not in a position to make that claim."}, {"time": 5692, "text": "And let's go back to North Korea."}, {"time": 5694, "text": "I had a refugee I knew and he went to high school here and he was talking to his buddies and they said, hey, remember when we were kids, we had Pokemon and he goes, oh yeah, except instead of Pokemon, I watched my dad starve to death, which is the truth."}, {"time": 5709, "text": "Now, who are any of us to tell him not to make that joke?"}, {"time": 5715, "text": "I don't know what it's like watching anyone, including my dad, starve to death and my dad's fatty so he's not going hungry anytime soon."}, {"time": 5723, "text": "So it's very bizarre to me when people feel comfortable precluding others from making jokes, especially, and I think this is a very Jewish thing, like this kind of gallows humor, especially when it's laughing about a personal loss or experience that they've had."}, {"time": 5744, "text": "Humor is a great way to mitigate pain and suffering."}, {"time": 5750, "text": "But it's also, I think this is why it's a Jewish thing, it's a black thing."}, {"time": 5753, "text": "When you are a marginalized community or poorer, it's free."}, {"time": 5758, "text": "Telling stories, telling jokes or songs, you don't have to have money, but you can have joy and happiness."}, {"time": 5765, "text": "And I think that's why you find it so much more in kind of lower status communities than you find in like wasps who are notoriously humorless."}, {"time": 5774, "text": "Which is strange because people pay you a lot of money for the jokes you do, so it's not really free."}, {"time": 5780, "text": "Yeah, well, nope, they don't have to pay me."}, {"time": 5782, "text": "It's appreciated but not expected."}, {"time": 5785, "text": "I find my voice cracking every time I try to make a joke, like I fail miserably at this."}, {"time": 5791, "text": "Some people... You're still in beta, that's what I thought."}, {"time": 5795, "text": "Alpha."}, {"time": 5797, "text": "Being an alpha is like being a lady."}, {"time": 5798, "text": "If you have to tell people you are, you aren't."}, {"time": 5799, "text": "No, I meant alpha version."}, {"time": 5801, "text": "I don't know if you're a robot gobbledygook."}, {"time": 5806, "text": "I'm not going there, okay."}, {"time": 5809, "text": "Who are you talking to?"}, {"time": 5811, "text": "In my own head."}, {"time": 5812, "text": "I'm talking to myself in my own head."}, {"time": 5814, "text": "Okay, speaking of North Korea, some people say that, you know, I've read that comedy is about timing."}, {"time": 5824, "text": "Well, first of all, do you agree?"}, {"time": 5826, "text": "And second of all... No, I'm serious."}, {"time": 5828, "text": "It's very much about timing."}, {"time": 5829, "text": "No, just that you're saying yes."}, {"time": 5830, "text": "Oh, yeah, yeah, yeah."}, {"time": 5833, "text": "Isn't it comedy is tragedy plus timing?"}, {"time": 5836, "text": "This is not the full reference."}, {"time": 5838, "text": "The interrupting cow knock knock joke."}, {"time": 5840, "text": "I'm not going to do it, but... That's not a timing thing."}, {"time": 5843, "text": "It's more of a repetition and then the twist ending."}, {"time": 5847, "text": "No, the moo."}, {"time": 5848, "text": "Oh, the moo."}, {"time": 5850, "text": "Interrupting cow."}, {"time": 5851, "text": "You're thinking of the banana one."}, {"time": 5853, "text": "Anyway, I'm not going there."}, {"time": 5857, "text": "Yet you're... Who are you talking to?"}, {"time": 5860, "text": "Good lord."}, {"time": 5861, "text": "Are you small wonder?"}, {"time": 5862, "text": "Do you stand sleeping in a wardrobe?"}, {"time": 5866, "text": "That's so British."}, {"time": 5870, "text": "But yet you're very..."}, {"time": 5871, "text": "I don't want to stay in a closet because that has connotations."}, {"time": 5875, "text": "Let's both come out of the closet for a second."}, {"time": 5878, "text": "Let's talk about..."}, {"time": 5879, "text": "I love you, Lex."}, {"time": 5880, "text": "I wasn't saying, I love you, Alex."}, {"time": 5882, "text": "I was saying, I love you, Lex."}, {"time": 5884, "text": "Oh, you're talking to me."}, {"time": 5886, "text": "Yes, through the screen."}, {"time": 5887, "text": "So you think about me when you're with another man."}, {"time": 5891, "text": "I watch you when you're sleeping."}, {"time": 5893, "text": "Okay, so you're really active on Twitter."}, {"time": 5899, "text": "And somebody else asked on your overly expensive membership site, how do you find humor different in writing on Twitter versus spoken humor?"}, {"time": 5914, "text": "So if humor is about timing, how do you capture the timing and the brilliance of the whatever is underlying humor in the context of Twitter?"}, {"time": 5925, "text": "Like another way to say it is how do you be funny and yet thoughtful on Twitter?"}, {"time": 5934, "text": "So with Twitter, you have to be the first one to the punchline."}, {"time": 5938, "text": "So when Ron Paul had a stroke, I was immediately being like, he's still the most articulate libertarian."}, {"time": 5944, "text": "He's doing a great Joe Biden impression right now."}, {"time": 5946, "text": "All the libertarians got ass mad."}, {"time": 5948, "text": "So like too soon, or like when someone dies, you're making the jokes about them."}, {"time": 5952, "text": "It's like, when do you want to make the jokes about someone just died a week later?"}, {"time": 5957, "text": "Too soon is perfect timing."}, {"time": 5958, "text": "Or you could say it's not appropriate ever, but too soon does not make sense in this context."}, {"time": 5965, "text": "So that is something that I enjoy doing."}, {"time": 5968, "text": "It's also fun ruffling people's feathers, something I enjoy doing."}, {"time": 5972, "text": "I think spoken versus writing is very different because when you are having good banter with someone, for me as the audience, knowing that it is on the spot really adds an element of humor because then it's like, wow, this is fun."}, {"time": 5991, "text": "It's like a ping pong match or something."}, {"time": 5994, "text": "Whereas in writing, you're losing the tone, you're losing the relationship of a dynamic conversation."}, {"time": 6004, "text": "And a lot of times the joke is just going to be a different type of joke."}, {"time": 6007, "text": "Well, it's funny, but Twitter, there's a sense, especially your Twitter, that you just thought of that and you just wrote it."}, {"time": 6018, "text": "Like there's a feeling like it's literally you talking as opposed to what I imagine is there's some editing or it doesn't look like it."}, {"time": 6027, "text": "Whoever your editor is should be fired."}, {"time": 6032, "text": "There's an interesting effect actually."}, {"time": 6034, "text": "If I want to say something, I don't know, about something that's bothering me about the presidential election or something like that, what is the actual central idea that I'm trying to convey to myself?"}, {"time": 6048, "text": "Like if say I was having a hypothetical conversation with myself in my head, why am I putting my pants back on?"}, {"time": 6057, "text": "I'm more comfortable this way."}, {"time": 6061, "text": "Promo code MALICE20, sheathunderwear.com, okay."}, {"time": 6069, "text": "That's sheath... What is it?"}, {"time": 6071, "text": "What's the website?"}, {"time": 6072, "text": "Sheathunderwear.com."}, {"time": 6073, "text": "Sheathunderwear.com, promo code MALICE20."}, {"time": 6077, "text": "And I forgot, why is that underwear really nice?"}, {"time": 6080, "text": "Because it has a dual pouch technology to keep your man parts separate."}, {"time": 6083, "text": "They've also got woman stuff, but I don't know how that works."}, {"time": 6085, "text": "There's a thing worth going somewhere."}, {"time": 6087, "text": "And the material is really refreshing."}, {"time": 6089, "text": "I mean, it's really... And it makes your ass look good."}, {"time": 6092, "text": "That's promo code MALICE20."}, {"time": 6095, "text": "And it's made by a former vet because he was in Iraq."}, {"time": 6099, "text": "So that's why I like promoting it."}, {"time": 6102, "text": "But what I'm writing the tweet, I like to..."}, {"time": 6105, "text": "It forces me to think deeply about the core of the message."}, {"time": 6110, "text": "But what I found, this really interesting effect, like I don't really do much editing on the tweet, I'll just think and then I'll write it."}, {"time": 6117, "text": "And then when I post it, like submit, I immediately see the tweet very differently than it was in my mind."}, {"time": 6127, "text": "I often delete, I delete, I don't know, some percentage of tweets about two, five seconds after."}, {"time": 6135, "text": "It's something... Once you send it, it's why the Gmail send features, undo send feature is really nice."}, {"time": 6141, "text": "It's like it just changes the way I see the thing."}, {"time": 6144, "text": "So it's very interesting."}, {"time": 6146, "text": "But I really love it that you can delete it because when I say stuff out in the wild, like to other humans, like spoken word is like, you can't delete what you just said."}, {"time": 6160, "text": "And I often regret the things I say, like on the spot, like I shouldn't have said that."}, {"time": 6168, "text": "I don't have that."}, {"time": 6169, "text": "Well, again, whoever your editor is, what is it, Edith Piaf, Jeannine Hicart Han?"}, {"time": 6178, "text": "Wow, your French is as bad as your English."}, {"time": 6181, "text": "I don't have any tweets I regret because if I sent a tweet that I regretted, I would make amends."}, {"time": 6191, "text": "I would make it a point if I was needlessly offensive to somebody or hurtful or accidentally, I would make sure to fix it and go out of my way to make sure that person feels vindicated and validated by accepting my apology."}, {"time": 6207, "text": "That has never happened, had to happen, thankfully."}, {"time": 6210, "text": "I'm also someone who is not big on taking the bait."}, {"time": 6217, "text": "Some recently some people have come after me pretty hard."}, {"time": 6220, "text": "And my perspective is that it's not really about me."}, {"time": 6224, "text": "It's either I represent something to them."}, {"time": 6226, "text": "I'm just a jackass with the Twitter."}, {"time": 6229, "text": "So if you're getting this riled up over me, it's not really about me."}, {"time": 6233, "text": "Maybe I'm delusional, but that's how I look at it."}, {"time": 6235, "text": "So if they are trying to provoke me into this kind of heated exchange, I will never do it because I'm not interested in it."}, {"time": 6243, "text": "And I don't think there's going to be any, like Jeannette Rankin, you can't win."}, {"time": 6248, "text": "It's just going to be like trying to win a hurricane."}, {"time": 6250, "text": "There's no hero here."}, {"time": 6252, "text": "Well, let me ask you about this because somebody also asked that on your overly expensive membership site that like they were saying that they're an academic."}, {"time": 6260, "text": "They wondered, because I'm an academic, quote unquote, I'm not an academic, but I do still have an affiliation with MIT."}, {"time": 6267, "text": "The word academic is just dirty, which is a problem that needs to change."}, {"time": 6272, "text": "Just like the word nerd is dirty."}, {"time": 6274, "text": "No, academic needs is going to be the next front to open and they're going to be very vilified."}, {"time": 6279, "text": "We're coming for them and it's going to be very, very ugly."}, {"time": 6282, "text": "And I cannot wait."}, {"time": 6283, "text": "No, but there needs to be a place, a different term for people who love research and knowledge."}, {"time": 6291, "text": "That's very fair."}, {"time": 6295, "text": "So like you have to clarify what you mean by academic and right now the word academic means in the intellectual public discourse, it means the enemy."}, {"time": 6304, "text": "And there's a lot of people that perhaps deserve that targeted vilification, but like a lot that don't."}, {"time": 6312, "text": "They're just curious people that are just building robots that will one day destroy you."}, {"time": 6319, "text": "Voice cracks every time I make a joke."}, {"time": 6320, "text": "You're not consistent."}, {"time": 6321, "text": "I can't do this."}, {"time": 6322, "text": "Because you're not making a joke, you're telling the truth."}, {"time": 6324, "text": "I'm editing."}, {"time": 6325, "text": "Can I delete that joke?"}, {"time": 6329, "text": "That's not even a joke."}, {"time": 6331, "text": "Robots building robots that will one day kill us."}, {"time": 6334, "text": "Oh, God willing."}, {"time": 6336, "text": "God willing."}, {"time": 6337, "text": "Humans are the joke."}, {"time": 6338, "text": "That's why I'm cracking."}, {"time": 6339, "text": "My voice is cracking."}, {"time": 6340, "text": "What was I even fucking saying?"}, {"time": 6348, "text": "My local, someone had a question."}, {"time": 6349, "text": "They're an academic."}, {"time": 6352, "text": "They're saying like, are you worried that in academia, associating yourself with a sort of somebody who can be misconstrued to have radical ideas, like the two examples they gave is Michael Malice and Joe Rogan."}, {"time": 6370, "text": "Does Joe have any radical?"}, {"time": 6371, "text": "I wouldn't consider him radical at all."}, {"time": 6373, "text": "Well, we can talk about it."}, {"time": 6375, "text": "But Joe is, I think, a bad example."}, {"time": 6377, "text": "He's quite centrist to me."}, {"time": 6380, "text": "Well he could have, for example, like what has Joe been attacked on?"}, {"time": 6384, "text": "It's, for example, on the topic of like transgender athletes in sports, there's what else?"}, {"time": 6394, "text": "I mean, he's been pro Bernie Sanders and pro Trump or like giving Trump a pass."}, {"time": 6403, "text": "Not anti Trump."}, {"time": 6408, "text": "None of these are radical."}, {"time": 6412, "text": "Meat stuff, being pro meat versus anti vegan."}, {"time": 6417, "text": "But you can be misconstrued and saying, there's I think a highlight, my mom actually wrote to me about this, which is hilarious."}, {"time": 6425, "text": "I said, I like how you jot it down."}, {"time": 6428, "text": "That's when it's important."}, {"time": 6429, "text": "That's a sign, my voice cracks, a sign when Michael Malice makes a funny joke when you jot something down."}, {"time": 6443, "text": "He writes it and then the next time he crosses it out."}, {"time": 6448, "text": "It's like Joe Biden and the debates."}, {"time": 6451, "text": "I did also just crap my pants."}, {"time": 6456, "text": "So there's a, I mean, he's a comedian."}, {"time": 6462, "text": "You have a comedian side to you, right?"}, {"time": 6464, "text": "I mean, you're, you've talked humorous side humorous."}, {"time": 6468, "text": "So you can misconstrued like Joe is being somehow a radical thinker and the same can be done with you."}, {"time": 6474, "text": "And his question was, how are you worried about associating yourself with folks like that?"}, {"time": 6480, "text": "Am I or are you?"}, {"time": 6481, "text": "Like me?"}, {"time": 6484, "text": "And is that something, do you see yourself as somebody who's dangerous that I shouldn't be talking to?"}, {"time": 6494, "text": "And in the same way, do you ever think about guests on your podcast or people you talk to publicly, associate yourself with publicly and think that there is somebody that crosses that line that you shouldn't talk to?"}, {"time": 6512, "text": "So I interviewed in the new ride, I interviewed like up to full blown Nazis in the last chapter is that Chris Cantwell, but that was in the context of that book, right?"}, {"time": 6520, "text": "So there's lots of people who people want me to have on my show."}, {"time": 6525, "text": "And the way I look at it is like you have a table and tablecloth, right?"}, {"time": 6528, "text": "And let's suppose the table is three feet wide."}, {"time": 6532, "text": "The tablecloth is two feet wide."}, {"time": 6534, "text": "So if I move the tablecloth to the right, I'm going to lose people on the left."}, {"time": 6538, "text": "I can only cover so much space."}, {"time": 6540, "text": "And the further you go on the fringe in one direction, the more mainstream you're going to lose on the other direction."}, {"time": 6545, "text": "So I'm very much making a conscious choice not to talk to being, people will say I'm cowardly and that's absolutely true."}, {"time": 6553, "text": "I'm being fearful here."}, {"time": 6555, "text": "I would prefer not to talk to some of those who would alienate some of the more mainstream people."}, {"time": 6563, "text": "And here's a perfect example of why."}, {"time": 6565, "text": "On my birthday last year, I woke up seven o clock in the morning to go pee."}, {"time": 6569, "text": "And I checked Twitter or whatever, and Jeb Bush had followed me, Jeb."}, {"time": 6574, "text": "And it's seven a.m., you're not really awake."}, {"time": 6577, "text": "You're like, wait, what?"}, {"time": 6578, "text": "And then I thought maybe it was a fake account, but it's in the verified tab."}, {"time": 6581, "text": "Oh, you don't have this because you're not verified on Twitter, that's a shame."}, {"time": 6584, "text": "So people who are mad are on Twitter."}, {"time": 6585, "text": "Twitter does not respect robots."}, {"time": 6589, "text": "They ban bots."}, {"time": 6590, "text": "You're lucky."}, {"time": 6591, "text": "Zero, one."}, {"time": 6592, "text": "Zero, zero."}, {"time": 6593, "text": "It's zero, zero, zero."}, {"time": 6596, "text": "Those are my pronouns."}, {"time": 6597, "text": "So it was Jeb, Jeb, Governor Bush, and I corresponded with him and I asked him on the show and he decided not to for various reasons."}, {"time": 6609, "text": "Very politely, he's like, just politics is so bad right now, I don't want to talk about it."}, {"time": 6613, "text": "And I respect that for him."}, {"time": 6614, "text": "If I'm creating my show where he's going to get heat and get canceled, oh, you can't be on the show."}, {"time": 6625, "text": "He has these other guests."}, {"time": 6626, "text": "I don't want to lose that opportunity because as we were talking about earlier, me and Alex Jones and Tim Pool, I think a lot of people would be very excited to see me sit down with Jeb Bush."}, {"time": 6636, "text": "And I told him in writing, and I meant this, I wouldn't be clowning him."}, {"time": 6640, "text": "I wouldn't be disrespectful."}, {"time": 6641, "text": "It would be a lot of fun."}, {"time": 6643, "text": "There's a goofball side to him that comes out sometimes and I would do my best to bring that out and talk about what it's like being a blue blood to be born into his grandfather, Prescott Bush was a Senator from Connecticut, marrying a woman who didn't speak English."}, {"time": 6655, "text": "How does that work when your family's royalty and things like that?"}, {"time": 6658, "text": "So I had a lot of fun questions for him and that's kind of, you're going to have to choose one or the other."}, {"time": 6662, "text": "Well, you do a really good job with that."}, {"time": 6664, "text": "Like Ben Shapiro does a good job with that too, which is you can have multiple, you can have a trolley side, humor side where you tear down the power structures and so on, but you can also have a serious side and it's a safe space for people from all walks of life to walk in and you're not adversarial."}, {"time": 6683, "text": "So I take the word guests seriously."}, {"time": 6685, "text": "If they're going to be on my show, I'm not going to have them have negative consequences as a result of being on my show."}, {"time": 6692, "text": "That said, I mean, maybe in my case, I'll be honest and say that I find Alex Jones outside of the conspiracy stuff for some reason, maybe you can explain, maybe you can psychoanalyze me, but I find him hilarious to listen to."}, {"time": 6709, "text": "He's a performer."}, {"time": 6710, "text": "He's very performative."}, {"time": 6711, "text": "But there's a lot of people that don't see the humor of it and they see the serious consequences of spreading conspiracy theories of different kinds and they see the danger of it."}, {"time": 6725, "text": "And I personally, I'm often tempted to talk to Alex in a podcast format, but I think I'm trying to convince myself that I never will."}, {"time": 6739, "text": "For me, I feel unsafe talking to Alex because I can't truly be myself, which is like naive and honest."}, {"time": 6750, "text": "And actually, I generally, when I talk to humans, I want to see the best in them."}, {"time": 6757, "text": "And I think that's like, I often think about if I talked to Hitler in 1935, 1938."}, {"time": 6762, "text": "You got a list of names to give him."}, {"time": 6766, "text": "Well, yeah, I mean, that's how you get the interview."}, {"time": 6770, "text": "Come on, let's be honest."}, {"time": 6773, "text": "Who are we kidding?"}, {"time": 6774, "text": "I would, you have to give away one of your, I would probably give away one of my brothers, so."}, {"time": 6780, "text": "How many brothers do you have?"}, {"time": 6781, "text": "Well, just one."}, {"time": 6783, "text": "Too many."}, {"time": 6784, "text": "I want to be an only child."}, {"time": 6787, "text": "He's the older brother."}, {"time": 6788, "text": "He used to pick on me."}, {"time": 6789, "text": "Payback."}, {"time": 6790, "text": "You know, it's only, he had a good life."}, {"time": 6791, "text": "You should think of it more as Stalin, so I don't interrupt you, because Hitler, you're Jewish."}, {"time": 6795, "text": "You're already going to have very adversarial, he's not going to perceive you as a human in a sense, right?"}, {"time": 6802, "text": "Stalin, you're right."}, {"time": 6804, "text": "That would be much easier."}, {"time": 6805, "text": "Or Kim Jong Un or something like that."}, {"time": 6807, "text": "Do you think, like how, okay, this is a good question, is, and that's, why don't you judge something?"}, {"time": 6813, "text": "If you, alright, we'll cross it out in a second."}, {"time": 6824, "text": "I think this is a really good example of a difficult figure that's controversial that people bring up to me a lot, and you've interviewed twice, which is Curtis Yarvin."}, {"time": 6833, "text": "Yeah, Manchester Smallbug."}, {"time": 6834, "text": "Manchester Small, AKA Manchester Smallbug, which is his pseudonym that he goes by in his blog."}, {"time": 6840, "text": "Can you tell me about who he is?"}, {"time": 6844, "text": "Why is he interesting?"}, {"time": 6845, "text": "What of his ideas are interesting?"}, {"time": 6846, "text": "Well, briefly, he invented the concept, the red pill."}, {"time": 6850, "text": "So Curtis, Manchester Smallbug had a blog called Unqualified Reservations, you can still find it online."}, {"time": 6856, "text": "It's very verbose."}, {"time": 6858, "text": "He writes at length, very, very bright."}, {"time": 6862, "text": "His perspective is very heretical."}, {"time": 6866, "text": "So a lot of things that we take for granted in our liberal democracy, he regards as not only incorrect, which is downright absurd, and he does not take what many people view as the basis of American political discourse as the basis for his thought."}, {"time": 6884, "text": "So when you're starting with someone who is basically repudiating the American milieu, a lot of people are going to, of course, regard him as dangerous or someone who is verboten."}, {"time": 6902, "text": "He's a very bright person."}, {"time": 6905, "text": "Why is he such a toxic figure?"}, {"time": 6908, "text": "Because if you are blue pilled, if you are the guardians of what is acceptable discourse, then you have to make sure your forts are secured, and that any figure outside of this acceptable discourse has to be marginalized and regarded as radioactive as possible."}, {"time": 6928, "text": "You don't want to let in these kind of ideas that would be destructive to your hegemony."}, {"time": 6934, "text": "So let's dig into it."}, {"time": 6936, "text": "So I've read a few things by him, but then I hear that in a bunch of places, him being called a racist, a white supremacist, neo fascist, so on."}, {"time": 6949, "text": "I go to his Wikipedia."}, {"time": 6952, "text": "There's a view on race section."}, {"time": 6954, "text": "Let me read it."}, {"time": 6957, "text": "Yarvin's opinions have been described as racist, with his writings interpreted as supportive of slavery, including the belief that whites have higher IQs than blacks for genetic reasons."}, {"time": 6968, "text": "Yarvin himself maintains that he's not a racist because while he doubts that, quote, all races are equally smart, the notion, quote, that people who score higher on IQ tests are in some sense superior human beings is, quote, creepy."}, {"time": 6984, "text": "He also disputes being an outspoken advocate for slavery, though he has argued that some races are more suited for slavery than others, quote, it should be obvious that although I'm not a white nationalist, I am not exactly allergic to the stuff."}, {"time": 7000, "text": "Yarvin wrote in a post that linked approvingly of, I don't know these people, Steve Saylor."}, {"time": 7005, "text": "Steve Saylor, yeah, he's from."}, {"time": 7006, "text": "Jared Taylor and other racialists."}, {"time": 7010, "text": "Okay, so like, one of my questions is."}, {"time": 7014, "text": "Let me just say one sentence."}, {"time": 7016, "text": "In the same way that you had, you mentioned that guy earlier who was defending some aspects of communism, and that is, in some context, acceptable when you think about it, it's like this should be radioactive."}, {"time": 7028, "text": "The fact that he is engaging with these ideas in anything other than this has to be reputed at all costs is what renders him to a large extent a racist."}, {"time": 7039, "text": "There are some topics you can be nuanced and some not, and communism is still a topic that you can be nuanced about."}, {"time": 7048, "text": "It's difficult, but you can be."}, {"time": 7051, "text": "Race and this like talking about slavery and IQ differences based on race is a topic that I guess is radioactive to a degree where you can't even say anything, even if it's like nuanced or not even like making a point, it's like touching it as you make another point."}, {"time": 7072, "text": "And understandably, you can understand that I'm going to steel man their point, because you can understand the point."}, {"time": 7077, "text": "It's like you're just talking about Hitler."}, {"time": 7079, "text": "Once this foot gets in the door that some people are inherently slaves or some people are inherently better than others, it really quickly collapses, so that would be their perspective."}, {"time": 7090, "text": "But that's what, like if I were to give criticism of his..."}, {"time": 7092, "text": "But let me just say one more thing."}, {"time": 7094, "text": "Racist is also used to describe Alex Jones."}, {"time": 7097, "text": "Alex doesn't talk about race."}, {"time": 7099, "text": "Racist is a shorthand for a certain percentage of the population to let you know, do not bother investing in this person any further."}, {"time": 7108, "text": "They're off limits."}, {"time": 7109, "text": "Yeah, so definitely."}, {"time": 7110, "text": "Racism and sexism is a thing that's now used to shut down conversation that's quite absurd by a small percent of the population."}, {"time": 7116, "text": "But Jared Taylor and Steve Saylor, Jared Taylor interviewed him for my book, he would be regarded in any sense as a racist."}, {"time": 7123, "text": "What's the difference between racist and racialists?"}, {"time": 7125, "text": "So racialists, I mean, this is splitting hairs and now I'm gonna be all radioactive, Jared Taylor runs something called Amarin and this is, I mean, his perspective is that there are inherent differences for the races and you cannot live side by side, well, whites and blacks should not be living side by side."}, {"time": 7143, "text": "And by the way, for people who don't know, this is out of context, you have written a great book that includes some of these concepts called The New Right, which does not include these concepts, but talks about, well, it's more about the growth of the community around the alt right and all those kinds of the world."}, {"time": 7163, "text": "So and his point about IQ, it's like, if you had a population, the Dutch, right, I think they're the tallest people on earth."}, {"time": 7171, "text": "And if you said, well, the Dutch are the best people on earth, why?"}, {"time": 7175, "text": "Because they're the tallest, it's like you're a crazy person."}, {"time": 7178, "text": "So if someone is scoring low, an individual on an IQ test, that means they're somehow a lower quality person."}, {"time": 7184, "text": "Well, maybe one very specific aspect, but I mean, if they're a good human being, I've got friends who are low IQ, all my friends are low IQ, frankly, compared to me, sound like Trump there for a second."}, {"time": 7193, "text": "That's how you choose."}, {"time": 7194, "text": "Well, I don't have any other choices, no one's gonna be at my level."}, {"time": 7198, "text": "You're the smartest person since Abraham Lincoln that I've ever seen."}, {"time": 7202, "text": "Unlike him, I actually am honest."}, {"time": 7205, "text": "So he is someone who very much swims in heretical ideas."}, {"time": 7211, "text": "Here's another thing, like if you bring up that Aristotle said that some people are born to be slaves, he wasn't speaking about race, he just meant people's souls."}, {"time": 7220, "text": "H.L."}, {"time": 7221, "text": "Mencken, who's a great heretic and early 20th century figure, one of his quotes that I say all the time, which people have seen a lot in this past year, that the average man does not want to be free, he merely wants to be safe."}, {"time": 7234, "text": "That I think speaks, I don't know, I am not familiar with what Mulbug's saying about slavery because his writing is ponderous, but that certainly is something I think that is undeniable, that I think more people are realizing there's a large percent of the population that is actively disinterested in freedom and the more responsibilities it entails."}, {"time": 7252, "text": "Well, I mean, really just the word slavery, if you want to make some kind of point or even think about the topic outside the context of this is a horrible thing that happened in the United States history."}, {"time": 7265, "text": "And other countries history is not unique to us, let's be clear."}, {"time": 7300, "text": "Well, here's where I would disagree."}, {"time": 7303, "text": "When I say things, I often say things that are controversial, or I will say uncontroversial things in a controversial way, because it's a useful mechanism to alienate people you don't want around you."}, {"time": 7315, "text": "Because if there are people who are going to be shocked by certain topics, like we should have ended World War II, like even as a hypothesis, they just clutch their pearls, they're like, oh, you want the Holocaust to happen?"}, {"time": 7326, "text": "I can't discuss most things with you because you're not interested in having a conversation, you're interested in your emotional response."}, {"time": 7332, "text": "I see things differently, maybe this is a bit of a devil's advocate, but in at least the modern discourse of like Twitter and social media and so on, I find that if you do that, you're not actually removing the people that are not thoughtful and kind and so on, you're actually attracting loud people."}, {"time": 7351, "text": "Like a small number of them, they come over and start yelling at you, start yelling, they're basically ruin the party by showing up and just screaming, and so all the thoughtful people leave."}, {"time": 7364, "text": "Well, that's why you have to be a very heavy blocker."}, {"time": 7366, "text": "You have to block people on Twitter because you have to cultivate your audience and have them, like a lot of times people come at me, I don't care, then they'll start attacking members of my audience and then I'm like, dang, I got to block them because they've won this one because I can't have that."}, {"time": 7379, "text": "Yeah, I don't know, unnecessarily provoking people feels, this is beta testing, you try to break the system and see what works, you put up as much pressure as possible."}, {"time": 7397, "text": "This is very much computer stuff that you should be able to appreciate, the point being when you have a program, you're trying to intentionally sit there and do as many mistakes as you would go wrong."}, {"time": 7407, "text": "Is that not common practice?"}, {"time": 7409, "text": "So you're saying that's a way to see communication with the world, as you say something uncontroversial in a controversial way and that blocks people."}, {"time": 7420, "text": "Or does it trigger them?"}, {"time": 7421, "text": "Do they roll their eyes?"}, {"time": 7422, "text": "What is going to be their emotional response?"}, {"time": 7424, "text": "Are they going to start yelling?"}, {"time": 7427, "text": "The problem is the reason I can't think like this, or I can't, because I'm not sure about the points I'm trying to make, always."}, {"time": 7436, "text": "I'm not always 100% sure that I'm right about things."}, {"time": 7439, "text": "So in being thoughtful, I'm afraid that I'll turn off with an eloquently phrased or even incorrect statement, I will do damage that can't be undone in terms of having a good conversation about a topic."}, {"time": 7457, "text": "So I want to be very careful about like, I'm not saying afraid, fear is not what I'm talking about."}, {"time": 7465, "text": "I think fear is like not saying something out of fear is at the core of the many of the problems of the world today."}, {"time": 7473, "text": "But I'm just saying be, say stuff with care."}, {"time": 7476, "text": "If I'm going to touch race as a topic, it feels like you really should be deeply, first have a point to make, like you really care about a point you want to make, and second, think deeply about how to say that point in a way that communicates it the best."}, {"time": 7494, "text": "And touching, I would say, listen, on your show, which is great, I mean, I'd like to say thank you for having Menchus Moberg."}, {"time": 7507, "text": "You are welcome."}, {"time": 7509, "text": "That's the name of the show."}, {"time": 7513, "text": "Thank you for having me."}, {"time": 7514, "text": "A couple of times, it's great to sort of get him to in this loose way to talk about different kinds of stuff."}, {"time": 7521, "text": "I don't think we talked about race at all."}, {"time": 7522, "text": "So I'm just bringing it back to what you were asking, which is if you read the Wikipedia, the perspective is going to be this guy talks about slavery constantly, where it's completely disproportionate to his work."}, {"time": 7533, "text": "But even on your show, you can tell even not outside of the race stuff that he's not ultra careful about, he's not nuanced."}, {"time": 7544, "text": "He's not afraid to say something just like, I would say, let me just criticize him, my face is not used as me, carelessly say something controversial."}, {"time": 7553, "text": "I'm not saying he doesn't go, that makes him, it's a very different thing than somebody who on purpose says something controversial stuff, like Milo Annapolis, sorry, I forgot Milo, whatever his name is."}, {"time": 7571, "text": "Which is really nice to see that he's a genuine person who's thoughtful, he doesn't mean to, but he just carelessly seems to say things that I feel like damaged the rest of his body of work."}, {"time": 7584, "text": "I can't really speak for him, but I would guess his point is once you're swimming in this kind of worldview, you're going to be anathema already."}, {"time": 7594, "text": "So there's no pleasing these people, so why bother trying?"}, {"time": 7596, "text": "Yeah, I think that's a deeply, that's a black pill way of seeing the world."}, {"time": 7601, "text": "It's not black pilled at all, because it's a cynical way that these people, so it's saying that it's a very kind of way of thinking, I'll say whatever I want, whoever comes along with me."}, {"time": 7614, "text": "You just earlier said yourself that race, racism has been weaponized as a way to shut down conversation."}, {"time": 7620, "text": "So I think his perspective would be, I am so outside the mainstream in my worldview that I know I'm going to be called racism, racist."}, {"time": 7629, "text": "So there's no point in trying to be nuanced because I'm already going to get the scarlet letter."}, {"time": 7635, "text": "Yeah, I just disagree with that because for example, I am one person that he turned off by his carelessness, and I think I should be a good target."}, {"time": 7645, "text": "I should be somebody."}, {"time": 7646, "text": "I think that's fair."}, {"time": 7647, "text": "And I'm just like, he, it's very convenient to think that there's ridiculous people out there, which they are, who call everybody racist and sexist currently."}, {"time": 7657, "text": "And then you can't please them."}, {"time": 7659, "text": "So I'm not even going to try, no, but there's like this gray area of people that I don't listen to the outreach culture, whatever that I don't, this Wikipedia article means nothing to me."}, {"time": 7669, "text": "I'm not going to, I'm more, I'm just seeing this careless person."}, {"time": 7675, "text": "And if he's going to be careless about a race like this, I feel like if I walk along with him long enough, I'm going to catch the carelessness."}, {"time": 7686, "text": "I'm going to lose like, I'll defend your perspective better than you can."}, {"time": 7693, "text": "I'm taking notes."}, {"time": 7694, "text": "I talked to Eric Weinstein after you guys talked about me on your show."}, {"time": 7698, "text": "We had a good conversation."}, {"time": 7699, "text": "He invited me on his show."}, {"time": 7700, "text": "That would be an amazing conversation."}, {"time": 7702, "text": "And we got on the phone and his concern, fairly, he goes, I don't want you to come on my show for the purposes of clowning me."}, {"time": 7711, "text": "And I would never do that."}, {"time": 7713, "text": "It would never."}, {"time": 7714, "text": "He might not be aware of who you are."}, {"time": 7716, "text": "That's why he wants to feel me out."}, {"time": 7717, "text": "He's like, you know, when he hears troll, it can mean a lot of different things."}, {"time": 7720, "text": "And I, we had a very conversation and very much was very clear that that's not where the conversation would go."}, {"time": 7725, "text": "But I think when you are going to be on someone's show, there is a responsibility that they're not going to have to pay a cost for having you as their guests."}, {"time": 7734, "text": "So if you're perceived, if you were put off by how he was in that live streams or two, I did like, I understand where you're coming from."}, {"time": 7741, "text": "I think he's very, very bright, but you have a very, you have a different audience than I do."}, {"time": 7746, "text": "And you're going for something different than I am."}, {"time": 7748, "text": "Like in my interest, the sense of."}, {"time": 7751, "text": "You wouldn't feel safe with him."}, {"time": 7753, "text": "I wouldn't feel safe with him."}, {"time": 7754, "text": "That's a really boring line for me."}, {"time": 7755, "text": "I think I would like to actually talk to him one day, Alex Jones has crossed the other line for me."}, {"time": 7762, "text": "Well, you could do what you could do with me, tape the episode and then never release it."}, {"time": 7766, "text": "No, it's, it's one of those things will be when there's finally they'll, they'll make a history channel documentary about you and I and how it all went wrong."}, {"time": 7778, "text": "Like the cult that we started and then everybody killed themselves."}, {"time": 7782, "text": "And there's a, we'll release it then because it'll be like unseen footage."}, {"time": 7789, "text": "This is how it started is it'll be black and white in a basement somewhere in New York."}, {"time": 7798, "text": "My mother's basement."}, {"time": 7799, "text": "Let's explain so much."}, {"time": 7842, "text": "That would, you know."}, {"time": 7844, "text": "2020 showed that."}, {"time": 7846, "text": "The government's great at that."}, {"time": 7848, "text": "Well, what, what's, okay."}, {"time": 7849, "text": "Without."}, {"time": 7850, "text": "This is him with a straight face making that argument."}, {"time": 7851, "text": "Good work Yaron."}, {"time": 7853, "text": "Well, can you with a straight face argue for the idea that in anarchism, violence would not get out of hand?"}, {"time": 7865, "text": "For one thing, if your worst argument against that, one of my little quotes is what are presented as the strongest arguments against anarchism are inevitably description of the Strasquo."}, {"time": 7875, "text": "So the argument is under anarchism, you know, you'd have warlords, you know, killing people and then you'd have, you know, whoever's strongest gets to just take over a neighborhood."}, {"time": 7885, "text": "Well, we have that now."}, {"time": 7887, "text": "We saw that the police are perfectly comfortable disarming the population."}, {"time": 7893, "text": "And then when they try to protect themselves or punished, they're, we're happy to stand down."}, {"time": 7898, "text": "You can't, you can only have that happen if you have a monopoly."}, {"time": 7902, "text": "If they're like, let's suppose you had a television stations, right?"}, {"time": 7905, "text": "And CBS said, you know what?"}, {"time": 7907, "text": "We're not going to broadcast."}, {"time": 7911, "text": "We're going to watch any of these other channels."}, {"time": 7913, "text": "So the problem with having monopoly is everyone has to be dependent on this issue."}, {"time": 7917, "text": "What's amazing about minarchism, which objectivists are, is they will argue that government is really, really bad at everything it does and it touches."}, {"time": 7927, "text": "Therefore it has to be in charge of the most important stuff."}, {"time": 7930, "text": "Well, that's not therefore, but, but there is a thing that's fundamentally different than all the other things."}, {"time": 7937, "text": "And Yaron Brook also said that no government has, this is on your show, has ever worked in the way he's proposing."}, {"time": 7946, "text": "Now objectivism, Ayn Rand's philosophy is based on objective reality."}, {"time": 7951, "text": "And what she posited is you look and study the facts of nature, facts of reality and deduce things accordingly."}, {"time": 7959, "text": "And she very much regards herself as part of the Aristotelian tradition, as opposed to the Platonist tradition, where the idea precedes reality and the idea is more real than what we see around us."}, {"time": 7970, "text": "So what he's saying is all the data, according to him, contradicts his argument, but still he's going to make this imaginary government that has never existed and there's no evidence that it can exist."}, {"time": 7986, "text": "Let's talk about objective law, to have access to the legal system, which is something we want."}, {"time": 7993, "text": "And just in terms of selling disputes, when you have a government monopoly, it's going to be more expensive, more difficult for poor people."}, {"time": 8000, "text": "The cost of hiring a lawyer is more expensive than hiring a surgeon."}, {"time": 8004, "text": "You can't say with a straight face, this is the only way or the best way."}, {"time": 8011, "text": "And the other thing is the argument for objectivism, against anarchism, they have this stupid claim it's like, what if you're a member of one security company and I'm a member of another and we have a dispute and one shows up the door."}, {"time": 8025, "text": "What happens now?"}, {"time": 8027, "text": "As if this is some insuperable argument."}, {"time": 8029, "text": "Well, we have that on earth."}, {"time": 8031, "text": "Every country is in a state of anarchism regarding every other country."}, {"time": 8034, "text": "We don't have a world government."}, {"time": 8035, "text": "So what happens if a Canadian kills an American in Mexico?"}, {"time": 8041, "text": "I bet you don't have an idea."}, {"time": 8043, "text": "What I'm sure of is that system has been worked out ahead of time between the three countries and it's been worked out in such a way that you and I don't have to reinvent the wheel."}, {"time": 8053, "text": "Same thing with cell phone companies."}, {"time": 8055, "text": "If I'm on Sprint, you're on Metro PCS and I call you, who pays?"}, {"time": 8059, "text": "Does Sprint pay you?"}, {"time": 8060, "text": "Do they split the difference?"}, {"time": 8061, "text": "First of all, there's no objective way that one has to work, but the thing is companies who have auto accidents, they have arbitrage all the time."}, {"time": 8070, "text": "Like if I run into you, they work it out and it never reaches our desk."}, {"time": 8076, "text": "So the only thing that cops are good at is keeping people, at any government monopoly, is forcing people to be their customers by keeping them unsafe."}, {"time": 8086, "text": "There's a few things I'd like to say there to just explore some of these ideas."}, {"time": 8091, "text": "So one is in terms of Canadian and Mexico and so on, that it does, something has been worked out perhaps."}, {"time": 8098, "text": "Not perhaps."}, {"time": 8100, "text": "Do you know for sure that if there's a point I'm trying to make, so let's say for sure it's been worked out."}, {"time": 8107, "text": "There was a point in history where it wasn't worked out."}, {"time": 8111, "text": "To work, to come to a place of stability, there has to first be some instability."}, {"time": 8117, "text": "So when you first, like for every kind of situation, they're like dispute over space, like who gets to own Mars, that kind of thing."}, {"time": 8127, "text": "For it, and then these different competing institutions will have to figure it out."}, {"time": 8133, "text": "And so there's the concern with anarchism, I think, or with any kind of interaction."}, {"time": 8138, "text": "You said brilliantly that there's an anarchism relative to the, there's no one world government."}, {"time": 8145, "text": "Alex Jones enters the chat, but the fear is that there's going to be an instability that doesn't converge towards some stable place."}, {"time": 8158, "text": "That is not the fear."}, {"time": 8160, "text": "That is the goal under Ayn Rand's philosophy."}, {"time": 8163, "text": "Markets have something what they always talk about as being creatively destructive, which means you look at something that's been happening for a very long time."}, {"time": 8172, "text": "Every generation, every innovator starts chipping away at it."}, {"time": 8176, "text": "He finds better ways, marginal improvement or marginal, or it doesn't work and he goes broke."}, {"time": 8181, "text": "When government tries to implement improvement, we all have to suffer the consequences."}, {"time": 8185, "text": "When an innovator does, it's a huge asymmetry."}, {"time": 8188, "text": "If it hurts, it only hurts him."}, {"time": 8190, "text": "If it succeeds, he becomes rich and we all profit as a consequence."}, {"time": 8194, "text": "But the fear of anarchism, I think, is that it will be non creative destruction."}, {"time": 8199, "text": "It'll be just destruction, right?"}, {"time": 8203, "text": "It's not like the instability."}, {"time": 8207, "text": "Stability is one of these words that sounds objective, but has no real meaning."}, {"time": 8211, "text": "What field has stability?"}, {"time": 8215, "text": "Let's suppose you want stability."}, {"time": 8216, "text": "Relationships."}, {"time": 8218, "text": "Let's talk about medicine."}, {"time": 8219, "text": "Stability means we're not going to invent new diseases or new treatments, right?"}, {"time": 8222, "text": "If you mean stability in terms of a baseline of security, we have that already."}, {"time": 8228, "text": "Very few relationships turn violent."}, {"time": 8231, "text": "Under an anarchist system, look at it right now."}, {"time": 8234, "text": "If you look at a bar full of drunken young males full of testosterone, if you look at a hotel where everyone is not native to the area, those are both far safer than the places that the government has taken upon itself to protect you."}, {"time": 8252, "text": "The parks, the alleyways, the streets, the subways."}, {"time": 8256, "text": "We have right now a comparison of which is better at keeping people safe."}, {"time": 8261, "text": "And it's very obvious that when something is private and under someone's control, and there would be layers of there'd be more police, but they wouldn't be a government monopoly."}, {"time": 8270, "text": "The store would have someone, the street would have someone, and you'd have your own personal security that would be attached to your phone."}, {"time": 8276, "text": "Having security as a function of geography as opposed to a function of you as an individual is a landline technology in a post cell phone world."}, {"time": 8285, "text": "So you think it's possible to have, psychologically speaking, as an individual among the masses, to have a sense of security even though there's not a centralized thing at the bottom of the whole thing?"}, {"time": 8298, "text": "Like, there's not a set of laws that are enforced based on geography like we have nations now."}, {"time": 8304, "text": "You can have a set of laws that are enforced in some kind of emergent agreed upon way."}, {"time": 8310, "text": "So like, basically, I want to go to a hotel and trust that I'll be able to get a room and nobody's going to break down the door and I don't know, take all my vodka."}, {"time": 8321, "text": "Let's take a different way."}, {"time": 8322, "text": "If you were worried about a hotel having bedbugs, that's not something the government's involved in."}, {"time": 8327, "text": "And that's not an unrealistic concern."}, {"time": 8330, "text": "Are there mechanisms right now that you can undertake to make sure that's not the case?"}, {"time": 8335, "text": "So it would be the same thing with, I want to make sure I go to a hotel that has security."}, {"time": 8341, "text": "It would be exactly the same thing."}, {"time": 8343, "text": "And here's another example, kosher food."}, {"time": 8346, "text": "People who keep kosher, Jews who keep kosher, their food has to be prepared in a certain way."}, {"time": 8350, "text": "It has to meet higher rabbinical standards, right?"}, {"time": 8353, "text": "If you look at food, it will have that certification, the K, and there's even competition there."}, {"time": 8358, "text": "There's the K and there's the stricter U letter."}, {"time": 8360, "text": "People don't notice it because they're looking for it."}, {"time": 8362, "text": "You would have companies certifying different locales for their level of security."}, {"time": 8368, "text": "And it would take an hour to have an app that would, just like when you have toll roads, right?"}, {"time": 8375, "text": "That would tell you you're approaching an unsafe area, you're not going to be covered by us or, and you could have it color coded very easily."}, {"time": 8381, "text": "We could do this today."}, {"time": 8383, "text": "But the thing is, you're exactly correct, but there's an assumption of you're already in a, okay, you can give me a different word than stability, but you're already in a place where the forces of the market or whatever can operate."}, {"time": 8397, "text": "The worry is like, initially, you might not have enough stability to where you can choose one place over the other based on the security that they provide."}, {"time": 8410, "text": "We already have different types of security here because we have federal government, we have state governments and we have local governments."}, {"time": 8417, "text": "So and these often contradict each other."}, {"time": 8420, "text": "So the idea of the implausibility of having different security companies and having it be unstable or impossible, we already have a very rough example of it happening in real life."}, {"time": 8432, "text": "So how all of it started, the idea of, especially with Yaron, is like it all started with government monopoly of violence saying like, no kids, don't let violence get out of hand."}, {"time": 8447, "text": "So like how do... We had a civil war where half the country was slaughtered."}, {"time": 8451, "text": "That's the display of the government not having a monopoly on the violence, right?"}, {"time": 8456, "text": "It's like, that's the split."}, {"time": 8458, "text": "They had such a monopoly on the violence in the North that it could draft people to fight others that they didn't even care about."}, {"time": 8463, "text": "But there's a South."}, {"time": 8467, "text": "It's the government splitting because this is giant iceberg like splitting."}, {"time": 8474, "text": "The argument is that you would have something like a civil war much more often under anarchism."}, {"time": 8481, "text": "First of all, if you had a civil war much more often, we don't have that with car companies, right?"}, {"time": 8488, "text": "We don't have a company that says, I refuse to pay or whatever."}, {"time": 8492, "text": "That's not violence."}, {"time": 8494, "text": "And I'm playing..."}, {"time": 8495, "text": "Hold on, let me finish."}, {"time": 8496, "text": "It is violence because if I'm a company and I'm saying that my cars can run over yours with no consequences, this is a rough analog, why has that not happened?"}, {"time": 8508, "text": "Now in terms of having security system, if I am free, just like switching cell phone to go from one provider to another and this one company as part of its payment doesn't want $50 a month, $100 a month, wants my son, I'm not going to be a member of this security company unless in that case we're dealing with something like a Pearl Harbor or foreign invasion where it's like all hands on deck."}, {"time": 8532, "text": "Let's go by evidence."}, {"time": 8533, "text": "How many places do have evidence of that you can have at a large scale?"}, {"time": 8537, "text": "Well, it's absolutely in a large scale."}, {"time": 8541, "text": "Because it feels like once you don't know the person."}, {"time": 8544, "text": "What about eBay?"}, {"time": 8545, "text": "eBay is an example of anarchism in practice."}, {"time": 8547, "text": "I am selling something to someone whose name I don't even know in a country that is nowhere proximate to me and eBay acts as the arbiter."}, {"time": 8554, "text": "Sometimes I don't get the money after I get screwed over, but that's far less than the taxation that I have to give to the federal government."}, {"time": 8560, "text": "It's a great point, but it's in the space of finance."}, {"time": 8563, "text": "If I could, if on eBay you could also commit violence."}, {"time": 8569, "text": "Theft is violence."}, {"time": 8571, "text": "Yeah, if you give me 10 grand for a car and I don't deliver anything, you've stolen 10 grand from me."}, {"time": 8578, "text": "Yes, but there's something uniquely problematic to being stabbed or shot."}, {"time": 8586, "text": "The reason you're stabbed or shot is because the government, despite its contract, is refusing to allow second amendment rights to be implemented among the citizenry and the people who are making that the case are the cops."}, {"time": 8600, "text": "They are the ones who are the traitors to the constitution and should be regarded as such."}, {"time": 8604, "text": "Whereas private companies are far more amenable to market pressures than the state is."}, {"time": 8611, "text": "It's a strong argument, but let's actually just briefly mention the scale thing."}, {"time": 8617, "text": "Why don't you think we should talk about scale?"}, {"time": 8620, "text": "Because if you had anarchism just in Vermont or just in Brooklyn, well, fine."}, {"time": 8625, "text": "The people make the argument you need anarchism or else China's going to invade, but that's like saying what, do these little countries don't exist?"}, {"time": 8632, "text": "Does San Salvador not exist?"}, {"time": 8633, "text": "Some of them are violent, some of them are not, but the point is they're not all at moments notice about to be invaded."}, {"time": 8639, "text": "Kuwait's an example of this."}, {"time": 8641, "text": "Kuwait was invaded by Iraq and very quickly all the big countries who are interested in having your stability, safe space, got involved and kicked him out of Kuwait."}, {"time": 8651, "text": "If you had this company that was waging war on the population, it seems quite likely that the other organization would get together and put a stop to this because they're not in a position to provide this service of security to their customers."}, {"time": 8664, "text": "All of this is brilliant, but didn't you just say that we are actually in a state of anarchism relative to other countries?"}, {"time": 8673, "text": "So isn't this what emerges?"}, {"time": 8675, "text": "This is what, aren't we actually living in a state of anarchism where we all have agreed?"}, {"time": 8681, "text": "I haven't agreed to anything."}, {"time": 8683, "text": "So the basic criticism you have is you're born on a geographical area and you're forced to have signed a bunch of stuff just by being born in a particular place."}, {"time": 8699, "text": "So really, if you could just much easier choose which space of ideas you associated with, that would be actually a state of anarchism."}, {"time": 8712, "text": "And you could have like a military that you sign up with."}, {"time": 8718, "text": "And you're certainly not putting people in prison to get raped because they're selling drugs."}, {"time": 8724, "text": "And you're certainly not allowing everyone else on the street who wants to be there."}, {"time": 8730, "text": "Can we say something nice about Ayn Rand?"}, {"time": 8732, "text": "I can talk about nice things about her all day."}, {"time": 8734, "text": "I own her copy of the Fountainhead, you know."}, {"time": 8736, "text": "What to you is Ayn Rand's best idea, one that you find impactful, insightful, useful for us in modern society that you think about?"}, {"time": 8747, "text": "That your life has meaning and productive work is your highest value."}, {"time": 8754, "text": "And that you shouldn't apologize, and this is something I despise, you shouldn't apologize for saying, I want to be happy and I'm going to work toward that."}, {"time": 8765, "text": "And that, there's a few others, that you owe nobody else, some random stranger, a second of your time."}, {"time": 8772, "text": "You see this a lot on Twitter and social media, people like demanding a debate or demanding you act a certain way and engage with them."}, {"time": 8779, "text": "You don't owe them anything."}, {"time": 8782, "text": "So I think those are some of her best ideas."}, {"time": 8785, "text": "And she teaches you how to think."}, {"time": 8789, "text": "Do you think, what do you think about the whole selfishness thing?"}, {"time": 8792, "text": "I mean, are you triggered by the word selfishness?"}, {"time": 8797, "text": "It's really unfortunate what she does because you were just talking earlier about Moldbug being carelessly, this is indefensible in my opinion."}, {"time": 8807, "text": "So she talks about the virtue of selfishness and she claims that when people talk about selfishness, they mean concern primarily with the self, they don't."}, {"time": 8818, "text": "When people talk about selfishness, they mean in a sociopathic way, concern exclusively with oneself."}, {"time": 8823, "text": "They mean like, oh, if someone is dying on the street, I'm not going to even waste a second saving them because I'm selfish."}, {"time": 8831, "text": "So she sets up this complete caricature of the term."}, {"time": 8835, "text": "When she's attacking selflessness in her best sense is when there are people who have no sense of self, they have no values of their own, they have no goals of their own, everything that's in their mind is gotten secondhand from the culture at large and there's nothing unique or special from their perspective worth fighting for."}, {"time": 8856, "text": "So when she attacks, when she advocates for the self, she basically means self development, self improvement and achievement."}, {"time": 8864, "text": "So I think that word choice is really false and needlessly off putting."}, {"time": 8872, "text": "Yeah, controversial perhaps for the purpose of being controversial, I don't know, but it's just, it's not accurate."}, {"time": 8879, "text": "That's not what people mean by selfishness."}, {"time": 8881, "text": "Yeah, I would say it's one of the reasons probably her philosophy is not as much adopted or thought about is like, it's funny, like the use of words means something."}, {"time": 8893, "text": "Exactly as you said, that's my criticism, I mentioned small bug, which could be incorrect criticism by the way, so I'm not exactly sure."}, {"time": 8901, "text": "Can we talk about some modern day chaos and politics?"}, {"time": 8909, "text": "I hate chaos."}, {"time": 8910, "text": "Speaking of your hatred for chaos, let's talk about secession."}, {"time": 8913, "text": "Oh yeah, I was the first one on this trip."}, {"time": 8916, "text": "Yeah, you were, well, the Civil War beat you to it, but."}, {"time": 8919, "text": "Sure, in contemporary times."}, {"time": 8921, "text": "In contemporary times you were, you're on this."}, {"time": 8925, "text": "Can you talk about what is the idea of secession, what are the odds that it might happen, what does it mean for the United States in some way for different states to secede?"}, {"time": 8938, "text": "Sure, America's been one country with several cultures since the beginning."}, {"time": 8942, "text": "There's absolutely no reason for someone, this goes back to the anarchist idea, if you despise Donald Trump, which is your prerogative, if you think Joe Biden is a clown, which is your prerogative, there's absolutely no reason for you to be governed by someone you disapprove of."}, {"time": 8959, "text": "This is an incoherent, nonsensical concept."}, {"time": 8961, "text": "The only reason we even take it as a hypothesis is that we're trained to the contrary since kindergarten."}, {"time": 8966, "text": "A secession, I don't know along what lines, but increasingly it's becoming harder and harder for people to have conversations."}, {"time": 8975, "text": "I think social media, and this is something people despise social media for, I think this is something that social media has done well, which I'm advocating for, is it tends to kind of run through ideas through like an evolutionary process and drive them to the logical conclusion."}, {"time": 8990, "text": "So it's very hard to be a moderate online because there's going to be people pushing through your ideas through several cycles, and then you're going to end up at some kind of more pure, or if you want to dislike it, extreme perspective."}, {"time": 9002, "text": "Having these different pockets, it's not really governable because people fundamentally have different worldviews."}, {"time": 9009, "text": "So I don't know what secession would look like."}, {"time": 9011, "text": "I think the number is really increasing at an exponential rate."}, {"time": 9017, "text": "I do not think the number of supporters."}, {"time": 9020, "text": "I think the claim that this can only be accomplished through violence is false."}, {"time": 9024, "text": "It's a lie."}, {"time": 9026, "text": "Just like any divorce doesn't have to involve beating your ex husband or ex wife."}, {"time": 9031, "text": "And I'm very much looking forward to this becoming a reality far quicker than I ever expected."}, {"time": 9038, "text": "Do you think there's a value of competing worldviews being forced to be in the same space?"}, {"time": 9049, "text": "Yes, but within a context."}, {"time": 9052, "text": "So we can agree if group one thinks A, B, and C are the fundamental aspects of the worldview and argue within that, and group two thinks D, E, and F and argue within that."}, {"time": 9064, "text": "So you're going to have a lot of argument within those space."}, {"time": 9067, "text": "And if there's fundamental differences in worldview, there's no reason to be, especially when each views the other as completely coherent and unreasonable."}, {"time": 9075, "text": "Do you think there's a line of fundamentally different worldviews along which a secession will happen in the United States?"}, {"time": 9087, "text": "Is there something that emerges to you as a set of ideas that are like, what do you call that?"}, {"time": 9095, "text": "That you can't come to an agreement over?"}, {"time": 9098, "text": "Yeah, I think that's already happening."}, {"time": 9100, "text": "Like with the masks, I think there's just two fundamental perspective and each one thinks the other is insane and also deadly and destructive."}, {"time": 9111, "text": "And I don't see how there's any discourse on this topic."}, {"time": 9116, "text": "So on the left, I wouldn't say it's left versus right."}, {"time": 9119, "text": "I think it's people who are pro risk versus people who are risk averse."}, {"time": 9124, "text": "Yeah, so risk averse."}, {"time": 9127, "text": "And then there's like a hope for the comfort of the sort of a centralized science giving the truth and then everybody must follow the truth of the proper way to behave."}, {"time": 9143, "text": "And then there's on the other side, a distrust of any kind of centralized institutions of anybody who might use like control to try to gain greater and greater power and masks are a symbol of that."}, {"time": 9158, "text": "And even if masks are or are not a effective way of stopping the virus, which is really unfortunate to me from a perspective, I happen to be on a survey paper about masks."}, {"time": 9173, "text": "Like people don't seem to care about the data or the so on."}, {"time": 9177, "text": "This has become just a nice point on which to then highlight the difference between the two sides."}, {"time": 9187, "text": "I mean, it sounds kind of on the face kind of ridiculous that the succession would occur over masks."}, {"time": 9193, "text": "It wouldn't, but I'm saying this is an example of something where there's a clean break."}, {"time": 9198, "text": "And risk averse versus someone who's risk seeking, these are just two fundamentally different perspectives."}, {"time": 9205, "text": "Do you want to have an NHS or do you have one of a market based healthcare system?"}, {"time": 9209, "text": "You can make very valid arguments for both."}, {"time": 9212, "text": "There's no reason for everyone to be under one."}, {"time": 9214, "text": "But do you think that's not something that's, you think that's irreconcilable, if that's the word, that that's not in the space of ideas that you can have in the same room together and they fight at each other and ultimately make progress like that."}, {"time": 9229, "text": "That succession is the more effective way to proceed forward."}, {"time": 9234, "text": "But do you see a possible world with no is the answer, meaning I know you say yes, because you kind of lean on the side of freedom and anarchism."}, {"time": 9248, "text": "Like you make, you want to make, let me make an argument in terms of divorce, which is in your worldview or your intuition is you want to make secession as frictionless as possible."}, {"time": 9264, "text": "And not just like states or whatever, just like you want to choose, you want to be free."}, {"time": 9270, "text": "And peaceful."}, {"time": 9271, "text": "Let me make my authoritarian, Russian, okay, Papa Stalin argument in terms of relationships."}, {"time": 9279, "text": "Like when shit goes wrong in a relationship."}, {"time": 9282, "text": "That's your language."}, {"time": 9287, "text": "There's only a place for one Stalin at this table."}, {"time": 9292, "text": "I'll get to be Lenin."}, {"time": 9293, "text": "Or you get to be like Merkel as our previous discussion with Putin."}, {"time": 9298, "text": "Don't let me unleash the hounds."}, {"time": 9300, "text": "You know, you want to work through some of the troubles before you get divorced."}, {"time": 9305, "text": "Like you want to do the work in relationships sometimes, like it goes up and down."}, {"time": 9309, "text": "It's been 200 plus years."}, {"time": 9312, "text": "But in the, listen, okay, so it's not a one night stand, but you know."}, {"time": 9317, "text": "Look at Trump."}, {"time": 9318, "text": "This I don't see the middle ground."}, {"time": 9320, "text": "He's either a complete calamity buffoon, or he's been the first great president we've had in like many, many years."}, {"time": 9329, "text": "So you think that there's something different now than it was 20 years ago?"}, {"time": 9334, "text": "Social media and access to information."}, {"time": 9337, "text": "And the division will only increase, you think?"}, {"time": 9340, "text": "So Trump is not an accident of history."}, {"time": 9342, "text": "So they thought Trump was the river, but he was the dam."}, {"time": 9346, "text": "Trump was the dam."}, {"time": 9349, "text": "They thought he was the river."}, {"time": 9350, "text": "So in that analogy, Trump being gone makes things worse."}, {"time": 9356, "text": "For that perspective, because now things are really going to hit the fan."}, {"time": 9361, "text": "So what are the odds of secession?"}, {"time": 9366, "text": "And my desperate hope is that it's peaceful, but I think the number of people who are becoming very comfortable with the violence is making me very unsettled."}, {"time": 9377, "text": "So I see words as violence and your Twitter."}, {"time": 9381, "text": "It's like Hiroshima times a million."}, {"time": 9387, "text": "Sometimes I curl up in the corner crying after I check your Twitter feed."}, {"time": 9391, "text": "So in all seriousness, you think it's possible to do nonviolent secession?"}, {"time": 9399, "text": "It's like a Czechoslovakia."}, {"time": 9401, "text": "Look at Brexit."}, {"time": 9403, "text": "Brexit was a secession."}, {"time": 9406, "text": "Right, so you can have a civil war did not need to be fought."}, {"time": 9410, "text": "That would have been a nonviolent secession."}, {"time": 9412, "text": "And if you worry about slavery, you could have bought off all the slaves, import them to the North."}, {"time": 9416, "text": "It still would have been cheaper and less loss of life and probably better for race relations."}, {"time": 9421, "text": "I don't know enough history to, to wonder about like how the civil war could have been avoided."}, {"time": 9426, "text": "Well, that's how is a well conversation."}, {"time": 9431, "text": "So like, no, no."}, {"time": 9432, "text": "If they want to secede, say, look, here's what we're going to do."}, {"time": 9434, "text": "We're going to let you secede, but you have to end slavery."}, {"time": 9438, "text": "They seceded because of slavery."}, {"time": 9439, "text": "Here's the other thing."}, {"time": 9440, "text": "There's like this, some circles of conservatism have this myth that, oh, it wasn't about slavery, it was about state's rights."}, {"time": 9444, "text": "Well, if you go back, every state, when they seceded, released the press release."}, {"time": 9448, "text": "And they said explicitly, we're doing this because of slavery."}, {"time": 9451, "text": "So that is an abomination that needs to be taken care of."}, {"time": 9454, "text": "But other countries have ended slavery peacefully."}, {"time": 9457, "text": "One of the ways to do it is pay them by all, and we ended up doing this after the war."}, {"time": 9462, "text": "I think the South people got reparations, the slave owners, it was just insane."}, {"time": 9467, "text": "Bring them North."}, {"time": 9468, "text": "You want to go to Canada, whatever."}, {"time": 9470, "text": "And you agree."}, {"time": 9471, "text": "And that's our peace treaty."}, {"time": 9473, "text": "Because the people who died weren't the slave owners."}, {"time": 9476, "text": "It was white trash."}, {"time": 9477, "text": "And it was, that's who always, and I hate that that's the term, I can't think of a better one, but that's who always ends up fighting these wars often disproportionately."}, {"time": 9485, "text": "It's poor people and uneducated people."}, {"time": 9487, "text": "And I don't, I did not regard them as cannon fodder."}, {"time": 9489, "text": "I think it's horrible."}, {"time": 9492, "text": "So what would it look like?"}, {"time": 9494, "text": "There would be two founding documents?"}, {"time": 9496, "text": "Yeah, they had their constitution."}, {"time": 9498, "text": "Actually, I don't know the history of that."}, {"time": 9500, "text": "Yeah, they had a constitution, but it was much more decentralized."}, {"time": 9504, "text": "If secession doesn't happen, you said that Donald Trump was the dam, not the river."}, {"time": 9515, "text": "That sounds like Walt Whitman or something."}, {"time": 9519, "text": "Are you flirting with me?"}, {"time": 9524, "text": "You know us, we don't flirt."}, {"time": 9525, "text": "We just club and drag you to the cave."}, {"time": 9530, "text": "We hammer and sickle."}, {"time": 9533, "text": "And you don't want to know about the sickle."}, {"time": 9534, "text": "It's not good cob, bad cob."}, {"time": 9536, "text": "It's bad cup for a sickle."}, {"time": 9540, "text": "What do you think 2024 looks like in terms of the candidates?"}, {"time": 9547, "text": "It's going to be Kamala Harris as the Democratic candidate."}, {"time": 9551, "text": "I'm really looking forward to Ted Cruz versus Mike Pence, because they're both very good at debate."}, {"time": 9556, "text": "That would be interesting to see how they differentiate themselves."}, {"time": 9559, "text": "But honestly, I don't, I mean, things are going to get really ugly really soon."}, {"time": 9564, "text": "What about Donald Trump coming back?"}, {"time": 9566, "text": "He's not going to do it."}, {"time": 9568, "text": "So things, in my opinion, I think things are going to be really, really crazy in 2021."}, {"time": 9573, "text": "And talking about the dam being gone, like 2021."}, {"time": 9575, "text": "So this year coming up."}, {"time": 9578, "text": "It's going to be complete."}, {"time": 9579, "text": "It's going to be complete mayhem."}, {"time": 9580, "text": "What do you think, like prediction wise, and this is empirical."}, {"time": 9585, "text": "What do you think Donald Trump's Twitter feed looks like in 2021?"}, {"time": 9591, "text": "Like if we're at the end of 2021, we'll look back and see like, what was the, you know, Obama gate exclamation points or we won."}, {"time": 9601, "text": "He is going to be, for the first time in history, holding the Republican party accountable to the base."}, {"time": 9610, "text": "We've never had that happen before."}, {"time": 9611, "text": "I think he's going to be holding their feet to the fire, radicalizing them."}, {"time": 9617, "text": "And given that they have the Senate, where it's going to be 50 50, the Democrats have a three seat majority in the House."}, {"time": 9624, "text": "This is not a governing coalition for either."}, {"time": 9627, "text": "What does that actually look like?"}, {"time": 9629, "text": "What are the key values you think that he's going to try to push?"}, {"time": 9633, "text": "I think it's just going to be very contrarian."}, {"time": 9636, "text": "He's going to be holding them accountable in terms of budgeting, even though he never did that as president."}, {"time": 9641, "text": "I think in terms of some kind of nominations, here's the thing."}, {"time": 9644, "text": "This is the first time since Nixon, 50 years and things weren't as politicized then, where an incoming president doesn't have control of the Senate."}, {"time": 9657, "text": "The Senate has the vote over cabinet positions."}, {"time": 9661, "text": "I do not see a possibility of them not trying to pick a fight on one or two of these nominations."}, {"time": 9668, "text": "And especially as revenge for Kavanaugh."}, {"time": 9670, "text": "This is going to get very bloody very quickly."}, {"time": 9672, "text": "And I think Mitch McConnell, there's a sadistic side to him."}, {"time": 9676, "text": "He revels in being the brakes on the car."}, {"time": 9679, "text": "And I think the base, it's just going to be throwing just, they're going to want some bone."}, {"time": 9683, "text": "It's like, oh yeah, we eliminated this one person."}, {"time": 9685, "text": "So that's going to get really ugly really quickly."}, {"time": 9688, "text": "You see it being quite divisive, like the division increasing, not stabilizing or decreasing."}, {"time": 9695, "text": "And I'll be doing my part."}, {"time": 9697, "text": "I know you'll be doing my part, but I'm trying to do my part and like trying to be like, to me, the division is shouting over people like Elon Musk, people who are actually building stuff and like accomplishing things in this world in terms of like."}, {"time": 9713, "text": "Elon said he took the red pill."}, {"time": 9716, "text": "No, see, you're talking about the, I'm talking about, forget Elon, SpaceX and Tesla and actually the good sides of like some of the things that Google is doing."}, {"time": 9727, "text": "Like actually building things, like making the world's information searchable, all that kind of stuff."}, {"time": 9732, "text": "Like all this stuff, you know, making actually the world a better place."}, {"time": 9738, "text": "There's a bunch of technologies that are increasing our quality of life."}, {"time": 9741, "text": "All this, all that kind of stuff."}, {"time": 9742, "text": "I feel like they get like not much credit or in our public discourse because of the division."}, {"time": 9750, "text": "The division is just like, it's clouding our ability to concentrate on what's awesome about this world."}, {"time": 9757, "text": "Well, you know what would eliminate the division, right?"}, {"time": 9759, "text": "Succession."}, {"time": 9761, "text": "See, I don't, I don't, it's hard for me to disagree."}, {"time": 9767, "text": "It's hard for me to disagree because, but at the same time, succession, I'm a romantic at heart and divorce breaks my heart."}, {"time": 9780, "text": "But do you want to live in a country where Joe Rogan is regarded as an example of someone who's spreading white supremacy?"}, {"time": 9790, "text": "Well, but see, I feel like that's not the country we live in."}, {"time": 9793, "text": "That's just."}, {"time": 9794, "text": "The New York Times did it, the cathedral does it on a regular basis."}, {"time": 9798, "text": "Well, the cathedral is, okay, the cathedral, I guess you can maybe define the cathedral, but it's like the centralized institutions that have like a story that they're trying to sell and so on."}, {"time": 9809, "text": "Yeah, this is mold books concept, but yeah, they basically are set the limits of permissible discourse and create a narrative for the population to follow."}, {"time": 9815, "text": "But to me, that's a minority of people."}, {"time": 9817, "text": "Yeah, minorities always controlling everything in any country, the vast majority of the masses have no thought."}, {"time": 9823, "text": "But minorities can be overthrown and the."}, {"time": 9825, "text": "Sure, the circulation of the elites, yeah."}, {"time": 9826, "text": "The way the, no, no, no, and that's why the, what progress looks like is ridiculous people take power."}, {"time": 9833, "text": "And then they get annoying and new ridiculous people that are a little bit better overthrow the previous."}, {"time": 9839, "text": "No, I think progress happens despite the people who are in power, not because of them."}, {"time": 9845, "text": "And so why is this a succession?"}, {"time": 9848, "text": "So is it always about overthrowing the powerful?"}, {"time": 9851, "text": "Is that how progress happens?"}, {"time": 9852, "text": "No, I think progress happens despite the powerful."}, {"time": 9854, "text": "The powerful are going to do what's in their power to maintain their power and they're going to fight innovation because it's a threat to their control."}, {"time": 9861, "text": "There's always going to be the New York Times of the world, right?"}, {"time": 9864, "text": "There's always going to be those, those people that haven't heard."}, {"time": 9866, "text": "Sure, let them have their own country."}, {"time": 9868, "text": "So it's two countries."}, {"time": 9870, "text": "One has Joe Rogan, the other one has the New York Times."}, {"time": 9873, "text": "That's basically what's happening right now."}, {"time": 9874, "text": "It just geographically doesn't map out very well, but culturally, yes."}, {"time": 9880, "text": "But that's just cultural stuff."}, {"time": 9881, "text": "Like there's a layer of public discourse."}, {"time": 9884, "text": "I don't mean like that's what we're operating under now, but there's actual like progress being made, like roads being built, hospitals being run, all those kinds of things like different innovations."}, {"time": 9895, "text": "That seems like secession is counterproductive to that."}, {"time": 9899, "text": "Right, because one country would have all the roads and the other would have all the hospitals."}, {"time": 9902, "text": "That's a great point."}, {"time": 9903, "text": "No, that's not, that's not the point I'm trying to make."}, {"time": 9905, "text": "It's just like, it just feels like the division that we're experiencing in the space of ideas could be constructive and productive for, for building better roads and better hospitals as opposed to like using that division to separate the countries."}, {"time": 9921, "text": "They're all going to have to solve the same problems, it feels like."}, {"time": 9925, "text": "Sure but they can solve them differently and compete that way."}, {"time": 9928, "text": "Mass is a great example."}, {"time": 9931, "text": "We're seeing that right now."}, {"time": 9932, "text": "Different countries have different mass mandates and things like this."}, {"time": 9934, "text": "And the competition within the same structure, within the same founding documents and same institutions is not effective, you think?"}, {"time": 9942, "text": "As effective as separating."}, {"time": 9943, "text": "It is effective but there is a certain point, which I think we have long passed, where there is not a governing consensus ideologically or culturally."}, {"time": 9951, "text": "Let me ask you a fun question, okay?"}, {"time": 9956, "text": "Mars."}, {"time": 9957, "text": "God of war."}, {"time": 9963, "text": "The other one."}, {"time": 9968, "text": "So, there is a kind of captivating notion that we might, I'm excited by it, the human being stepping foot on Mars."}, {"time": 9979, "text": "That to me is, it's like one of those things that feels like it's, why do we want to engage in space exploration?"}, {"time": 9992, "text": "But I'm a little bit with Elon Musk on this, which is, it's obvious that eventually if human species is to survive, it's going to have to innovate in ways that includes the space."}, {"time": 10007, "text": "Like, there's a lot of things we're not able to predict yet that if we push ourselves to the limits of space, like new ideas will come that'll be obvious a hundred years from now and then we're not even imagining now."}, {"time": 10021, "text": "And colonizing Mars, that idea that seems ridiculous, exceptionally difficult, impossibly expensive is something that is actually going to be seen as obvious in retrospect and that we should engage in."}, {"time": 10036, "text": "That's just to contextualize things."}, {"time": 10038, "text": "The fun idea and experiment from a philosophical and political sense is what kind of government, how do you orchestrate a government when you go to Mars, like we don't get too many chances like this, but how do you build new systems, not in place of old ones, but in a place with no system previous have existed?"}, {"time": 10061, "text": "I think organically, I hate that word, but that's the correct word."}, {"time": 10065, "text": "You would have to figure out, I mean, that's how America was built."}, {"time": 10068, "text": "You had the, it was a Jamestown colony and they tried to do communism here and it completely failed and they went to a more free market system with the second wave of colonists is my understanding."}, {"time": 10077, "text": "For Mars, I mean, it depends on the population, who the population was, the number of people."}, {"time": 10085, "text": "These are all kind of hypotheticals that I don't really have any good insight in whatsoever."}, {"time": 10090, "text": "I'm not a space person."}, {"time": 10092, "text": "I hate astronomy."}, {"time": 10093, "text": "Like I hate it."}, {"time": 10094, "text": "So a lot of people look up to the stars and they're filled with awe and wonder about the mystery of the universe and you look up to the stars and you feel what?"}, {"time": 10102, "text": "I'm not looking up."}, {"time": 10103, "text": "I'm looking at the earth."}, {"time": 10105, "text": "If you look at what's, I'd much rather given a choice between Mars and the deep sea."}, {"time": 10113, "text": "I'd much rather spend a week at the deep sea and all the life forms that are down there because they're literal aliens."}, {"time": 10118, "text": "It's like things that are not literal, but they're unimaginable to us."}, {"time": 10121, "text": "Some of the things down there."}, {"time": 10123, "text": "To me, it's an interesting thought experiment to see when you have 10 people, when you have a hundred people, how do you build an effective, you know, this is actually really useful for a company, right?"}, {"time": 10134, "text": "How do you build an effective company that does things?"}, {"time": 10137, "text": "It's not an obvious, despite everybody being really certain about everything in this, in this modern world, to me, it's not obvious, like how do you run successfully as a group of people?"}, {"time": 10151, "text": "It also organic means you have to look at who the people are and tailor the organization to them as opposed to try to impose something."}, {"time": 10157, "text": "But you get to also select people."}, {"time": 10160, "text": "Cause it's not going to be open borders on Mars."}, {"time": 10163, "text": "I was going to say when you have one country, it's all open borders."}, {"time": 10168, "text": "They're from outer space, right?"}, {"time": 10172, "text": "Some say they're aliens already there."}, {"time": 10173, "text": "So you're going to have to negotiate that."}, {"time": 10176, "text": "We're aliens."}, {"time": 10177, "text": "So we're aliens to somebody."}, {"time": 10178, "text": "We're legal aliens."}, {"time": 10179, "text": "Do you think there's alien civilizations out there?"}, {"time": 10184, "text": "What do you think is their system of government anarchism?"}, {"time": 10188, "text": "Cause they're advanced."}, {"time": 10191, "text": "Do you honestly think there's intelligent life forms out there?"}, {"time": 10194, "text": "It's the math."}, {"time": 10195, "text": "It's impossible that there isn't."}, {"time": 10196, "text": "So what do you make of all the stories of UFO sightings, all that kind of stuff?"}, {"time": 10203, "text": "Do you think they've visited earth?"}, {"time": 10206, "text": "My grandfather was an air traffic controller in the Soviet Union and he said they would often see these things that were not operating the way we knew vehicles operate."}, {"time": 10217, "text": "So that's good enough for me."}, {"time": 10218, "text": "So I mean, do you think government is in possession of some, like, what do you think government is doing with this kind of information?"}, {"time": 10226, "text": "Do you think somebody has any understanding of UFO sightings or any kind of information about extraterrestrial life forms that are not known to the public?"}, {"time": 10242, "text": "That's indisputably true."}, {"time": 10243, "text": "I think the fact that so many of these sightings are from aerodynamic professionals, like pilots and things of that nature, they are people who've seen it all, who are reputable."}, {"time": 10253, "text": "If they are on record saying, I've seen things that don't make sense, and both the Russians and the Americans thought it was the other one, that says something."}, {"time": 10263, "text": "Shouldn't that be a bigger problem?"}, {"time": 10264, "text": "Shouldn't that be bigger news and a bigger problem if government is in fact hiding it?"}, {"time": 10269, "text": "I guess, but like, what are they going to do with that information?"}, {"time": 10274, "text": "Like, if a UFO, if an extraterrestrial spacecraft, which most likely would be like a crappy space, like it wouldn't be the actual aliens, it would be like some drone probe ship."}, {"time": 10292, "text": "So if that, like, what would you do with that information?"}, {"time": 10293, "text": "As somebody that's in charge of, you know, like you see how badly WHO fumbled the discussion of masks."}, {"time": 10302, "text": "Masks?"}, {"time": 10305, "text": "Masks is one of them, but everything really in terms of communicating with the public honestly about what they know, what they don't know."}, {"time": 10311, "text": "And that's a trivial one."}, {"time": 10314, "text": "I don't, I don't, I don't know."}, {"time": 10318, "text": "There certainly feel incompetent at being able to communicate effectively with the public about something much more difficult, much more full of mystery, like a UFO, a thing, a piece of material that's out of this earth."}, {"time": 10334, "text": "Forget like organic material."}, {"time": 10337, "text": "I don't, I don't know."}, {"time": 10339, "text": "To me, I just, so from a scientist perspective, it would be beautiful."}, {"time": 10342, "text": "It would be inspiring to reveal this to the world."}, {"time": 10345, "text": "Here's the mystery and make it completely public."}, {"time": 10349, "text": "Share it with China."}, {"time": 10350, "text": "Share it with everybody."}, {"time": 10351, "text": "I think there is a domino effect where the concern would be what else are you hiding from us?"}, {"time": 10356, "text": "And at that point, if you said, no, no, no, this is everything, people wouldn't believe you and they would, you can't blame them for not believing them."}, {"time": 10365, "text": "And then it'd be like, show us the aliens."}, {"time": 10366, "text": "They'd be like, we don't have them."}, {"time": 10367, "text": "We just have the craft."}, {"time": 10370, "text": "Speaking of aliens, offline, you mentioned elves."}, {"time": 10377, "text": "And psychedelics."}, {"time": 10379, "text": "What do you think about psychedelics in terms of the kind of places that can take your mind?"}, {"time": 10389, "text": "The kind of journey it can take you on."}, {"time": 10391, "text": "Like what do you think, what do you think the psychedelics do to the human mind and what does that say about the capacity of the human mind and just in general, like the mysteries of all that's out there?"}, {"time": 10403, "text": "I don't know that we understand what they do."}, {"time": 10406, "text": "The way I heard it explained to me is that much of the human mind isn't about receiving information but blocking information, right?"}, {"time": 10416, "text": "Because we're so, there's so much data coming in any moment that you basically have to train yourself to see and to hear only what you want to see and to hear."}, {"time": 10422, "text": "And that what psychedelics do is they tear that away and suddenly you're much more aware of what's out there and also you're going to be noticing patterns that you hadn't noticed before."}, {"time": 10430, "text": "I know you had that researcher on the show and he kind of discussed this at some length."}, {"time": 10436, "text": "I mean, Rogan is probably the person who popularized DMT more than, well, he's obviously the person who's popularized DMT more than anything."}, {"time": 10443, "text": "I don't know anyone who had, even the researchers who have anything close to a coherent explanation of why this drug, which exists everywhere, would have this very specific, very extreme effect on so many people who are going to be experiencing such bizarre consequences as a result of it."}, {"time": 10492, "text": "I think Colorado just legalized mushrooms, something like that and I think it'll be very interesting to see what happens as a result of this."}, {"time": 10498, "text": "Yeah, and the interesting thing is, there doesn't seem to be, for certain psychedelics like psilocybin, like mushrooms, there doesn't seem to be a lethal dose, which is fascinating, like Matthew Johnson, the Hopkins professor that you mentioned, I'm definitely going to do one of his studies, it's a really cool way to do what he calls a heroic dose of psilocybin."}, {"time": 10524, "text": "Oh, I want to do it, what do I have to do?"}, {"time": 10528, "text": "A heroic dose, holy crap."}, {"time": 10532, "text": "Yeah, but it's safe."}, {"time": 10536, "text": "How many grams are we talking?"}, {"time": 10537, "text": "I don't know, but it's just, it's big."}, {"time": 10541, "text": "He says that..."}, {"time": 10542, "text": "This is going to have a kick."}, {"time": 10546, "text": "He says that, I mean, he also studies cocaine, he studies all kinds of drugs and he's like, the psilocybin is... A heroic dose of cocaine kills you."}, {"time": 10555, "text": "You can't, so you can't even come close, so he says the problem with studying cocaine is you have people who are addicted to cocaine or war or so on, you give them the kind of doses that we can and part of the study is like, it's nothing to them."}, {"time": 10574, "text": "Psilocybin is the only one where even daily users or regular users are blown away by the dose they give them."}, {"time": 10585, "text": "So you can go to Russia in your mind, you can go to outer space, maybe you'll become an astronaut or astronomer after all."}, {"time": 10599, "text": "Maybe I'll be Baba Yaga."}, {"time": 10602, "text": "I'll let people look that one up."}, {"time": 10610, "text": "What do you think this thing is like our attachment to other human beings?"}, {"time": 10617, "text": "And is it something that we should give to just a few people?"}, {"time": 10620, "text": "Yes, that's for sure."}, {"time": 10621, "text": "When I was working with DL Hughley in his book, he didn't use the term, but he was describing like low key depression."}, {"time": 10630, "text": "And he talked about how he was in the airport and he noticed a girl had a red dress and he went up and thanked her and she was like, what are you thanking for?"}, {"time": 10637, "text": "And he had realized he hadn't registered color in like weeks."}, {"time": 10642, "text": "And I think love is like that when you see someone and you just like, oh, like your eyes are open."}, {"time": 10649, "text": "Like this is something I've never seen before or I want more of this, that kind of thing."}, {"time": 10654, "text": "It really disorients and reorients your thinking."}, {"time": 10660, "text": "Don't you find that like the world is full of that like nonstop?"}, {"time": 10665, "text": "It's not just like a person either."}, {"time": 10668, "text": "Yes, but when it's in a person, it's a whole other level because it's like, I could have, this is going to be great for years."}, {"time": 10675, "text": "It's like, you know, every day it's something new."}, {"time": 10677, "text": "I mean, that is, and that is rare."}, {"time": 10680, "text": "You think it's rare?"}, {"time": 10681, "text": "I mean... Find someone who you could talk to them for years and not run out of things to talk to."}, {"time": 10686, "text": "Oh, that's true for years."}, {"time": 10689, "text": "That's rare."}, {"time": 10690, "text": "And know that they really, if you leave the room, they will do right by you."}, {"time": 10694, "text": "That's really rare."}]}]