[{"title": "Sertac Karaman: Robots That Fly and Robots That Drive | Lex Fridman Podcast #97", "id": "M1-v-dXIzho", "quotes": [{"time": 315, "text": "When they're in the air, it's a little bit more complicated."}, {"time": 319, "text": "But I don't see that there's going to be a big separation."}, {"time": 321, "text": "I think that, you know, there will come a time that we're going to quickly see these things unfold."}, {"time": 325, "text": "Do you think there will be a time where there's tens of thousands of delivery drones that fill the sky?"}, {"time": 331, "text": "You know, I think, I think it's possible to be honest."}, {"time": 334, "text": "Delivery drones is one thing, but you know, you can imagine for transportation, like an important use case is, you know, we're in Boston, you want to go from Boston to New York and you want to do it from the top of this building to the top of another building in Manhattan."}, {"time": 348, "text": "And you're going to do it in one and a half hours."}, {"time": 350, "text": "And that's, that's a big opportunity, I think."}, {"time": 353, "text": "Personal transport."}, {"time": 354, "text": "So like you and me be a friend, like almost like an Uber."}, {"time": 358, "text": "So like four people, six people, eight people."}, {"time": 361, "text": "In our work in autonomous vehicles, I see that."}, {"time": 364, "text": "So there's kind of like a bit of a need for, you know, one person transport, but also like, like a few people."}, {"time": 369, "text": "So you and I could take that trip together."}, {"time": 370, "text": "We could have lunch, you know, I think kind of sounds crazy, maybe even sounds a bit cheesy, but I think that those kinds of things are some of the real opportunities."}, {"time": 380, "text": "And I think, you know it's not like the typical airplane and the airport would disappear very quickly, but I would think that, you know many people would feel like they would spend an extra hundred dollars on doing that and cutting that four hour travel down to one and a half hours."}, {"time": 397, "text": "So how feasible are flying cars has been the dream."}, {"time": 401, "text": "That's like when people imagine the future for 50 plus years, they think flying cars, it's a, it's like all technologies."}, {"time": 409, "text": "It's cheesy to think about now because it seems so far away, but overnight it can change."}, {"time": 414, "text": "But just technically speaking in your view, how feasible is it to make that happen?"}, {"time": 419, "text": "I'll get to that question, but just one thing is that I think, you know, sometimes we think about what's going to happen in the next 50 years."}, {"time": 427, "text": "It's just really hard to guess, right?"}, {"time": 428, "text": "Next 50 years."}, {"time": 430, "text": "I mean, we could get what's going to happen in transportation in the next 50, we could get flying saucers."}, {"time": 434, "text": "I could bet on that."}, {"time": 436, "text": "I think there's a 50, 50 chance that, you know, like you can build machines that can ionize the air around them and push it down with magnets and they would fly like a flying saucer that is possible."}, {"time": 446, "text": "And it might happen in the next 50 years."}, {"time": 447, "text": "So it's a bit hard to guess like when you think about 50 years before, but I would think that, you know, there's this, this, this kind of a notion where there's a certain type of airspace that we call the agile airspace."}, {"time": 461, "text": "And there's, there's good amount of opportunities in that airspace."}, {"time": 464, "text": "So that would be the space that is kind of a little bit higher than the place where you can throw a stone because that's a tough thing when you think about it, you know, it takes a kid on a stone to take an aircraft down and then what happens."}, {"time": 479, "text": "But you know, imagine the airspace that's high enough so that you cannot throw the stone, but it is low enough that you're not interacting with the, with the very large aircraft that are, you know, flying several thousand feet above."}, {"time": 495, "text": "And that airspace is underutilized or it's actually kind of not utilized at all."}, {"time": 501, "text": "You know, there's like recreational people kind of fly every now and then, but it's very few."}, {"time": 505, "text": "Like if you look up in the sky, you may not see any of them at any given time, every now and then you'll see one airplane kind of utilizing that space and you'll be surprised."}, {"time": 514, "text": "And the moment you're outside of an airport a little bit, like it just kind of flies off and then it goes out."}, {"time": 519, "text": "And I think utilizing that airspace, the technical challenges there is, you know, building an autonomy and ensuring that that kind of autonomy is safe."}, {"time": 531, "text": "Ultimately, I think it is going to be building in complex software or complicated so that it's maybe a few orders of magnitude more complicated than what we have on aircraft today."}, {"time": 545, "text": "And at the same time, ensuring just like we ensure on aircraft, ensuring that it's safe."}, {"time": 550, "text": "And so that becomes like building that kind of complicated hardware and software becomes a challenge, especially when, you know, you build that hardware, I mean, you build that software with data."}, {"time": 562, "text": "And so, you know, it's, of course there's some rule based software in there that kind of do a certain set of things, but then, you know, there's a lot of training there."}, {"time": 572, "text": "Do you think machine learning will be key to these kinds of, to delivering safe vehicles in the future, especially flight?"}, {"time": 580, "text": "Not maybe the safe part, but I think the intelligent part."}, {"time": 583, "text": "I mean, there are certain things that we do it with machine learning and it's just, there's like right now, no other way."}, {"time": 590, "text": "And I don't know how else they could be done."}, {"time": 593, "text": "And you know, there's always this conundrum, I mean, we could like, could we like, we could maybe gather billions of programmers, humans who program perception algorithms that detect things in the sky and whatever, or, you know, we, I don't know, we maybe even have robots like learn in a simulation environment and transfer."}, {"time": 617, "text": "And they might be learning a lot better in a simulation environment than a billion humans put their brains together and try to program."}, {"time": 625, "text": "Humans pretty limited."}, {"time": 626, "text": "So what's, what's the role of simulations with drones?"}, {"time": 630, "text": "You've done quite a bit of work there."}, {"time": 632, "text": "How promising, just the very thing you said just now, how promising is the possibility of training and developing a safe flying robot in simulation and deploying it and having that work pretty well in the real world?"}, {"time": 648, "text": "I think that, you know, a lot of people, when they hear simulation, they will focus on training immediately."}, {"time": 654, "text": "But I think one thing that you said, which was interesting, it's developing."}, {"time": 657, "text": "I think simulation environments are actually could be key and great for development."}, {"time": 661, "text": "And that's not new."}, {"time": 663, "text": "Like for example, you know, there's people in the automotive industry have been using dynamic simulation for like decades now."}, {"time": 672, "text": "And it's pretty standard that, you know, you would build and you would simulate."}, {"time": 676, "text": "If you want to build an embedded controller, you plug that kind of embedded computer into another computer, that other computer would simulate dynamic and so on."}, {"time": 684, "text": "And I think, you know, fast forward these things, you can create pretty crazy simulation environments."}, {"time": 689, "text": "Like for instance, one of the things that has happened recently and that, you know, we can do now is that we can simulate cameras a lot better than we used to simulate them."}, {"time": 699, "text": "We were able to simulate them before."}, {"time": 701, "text": "And that's, I think we just hit the elbow on that kind of improvement."}, {"time": 705, "text": "I would imagine that with improvements in hardware, especially, and with improvements in machine learning, I think that we would get to a point where we can simulate cameras very, very well."}, {"time": 717, "text": "Simulate cameras means simulate how a real camera would see the real world."}, {"time": 723, "text": "Therefore you can explore the limitations of that."}, {"time": 727, "text": "You can train perception algorithms on that in simulation, all that kind of stuff."}, {"time": 734, "text": "So, you know, it's, it's, it has been easier to simulate what we would call introspective sensors like internal sensors."}, {"time": 740, "text": "So for example, inertial sensing has been easy to simulate."}, {"time": 744, "text": "It has also been easy to simulate dynamics, like physics that are governed by ordinary differential equations."}, {"time": 750, "text": "I mean, like how a car goes around, maybe how it rolls on the road, how it interacts with the road, or even an aircraft flying around, like the dynamic physics of that."}, {"time": 760, "text": "What has been really hard has been to simulate extra septive sensors, sensors that kind of like look out from the vehicle."}, {"time": 768, "text": "And that's a new thing that's coming like laser range finders that are a little bit easier."}, {"time": 773, "text": "Because radars are a little bit tougher."}, {"time": 776, "text": "I think once we nail that down, the next challenge I think in simulation will be to simulate human behavior."}, {"time": 783, "text": "That's also extremely hard."}, {"time": 785, "text": "Even when you imagine like how a human driven car would act around, even that is hard."}, {"time": 792, "text": "But imagine trying to simulate, you know, a model of a human just doing a bunch of gestures and so on."}, {"time": 798, "text": "And you know, it's, it's actually simulated."}, {"time": 800, "text": "It's not captured like with motion capture, but it is simulated."}, {"time": 804, "text": "In fact, today I get involved a lot with like sort of this kind of very high end rendering projects and I have like this test that I pass it to my friends or my mom, you know, I send like two photos, two kind of pictures and I say rendered, which one is rendered, which one is real."}, {"time": 820, "text": "And it's pretty hard to distinguish, except I realized, except when we put humans in there, it's possible that our brains are trained in a way that we recognize humans extremely well."}, {"time": 831, "text": "We don't so much recognize the built environments because built environments sort of came after per se we evolved into sort of being humans, but humans were always there."}, {"time": 840, "text": "Same thing happens, for example, you look at like monkeys and you can't distinguish one from another, but they sort of do."}, {"time": 846, "text": "And it's very possible that they look at humans."}, {"time": 848, "text": "It's kind of pretty hard to distinguish one from another, but we do."}, {"time": 852, "text": "And so our eyes are pretty well trained to look at humans and understand if something is off, we will get it."}, {"time": 858, "text": "We may not be able to pinpoint it."}, {"time": 859, "text": "So in my typical friend test or mom test, what would happen is that we'd put like a human walking in anything and they say, you know, this is not right."}, {"time": 869, "text": "Something is off in this video."}, {"time": 871, "text": "I don't know what, but I can tell you it's the human."}, {"time": 874, "text": "I can take the human and I can show you like inside of a building or like an apartment and it will look like if we had time to render it, it will look great."}, {"time": 882, "text": "And this should be no surprise."}, {"time": 883, "text": "A lot of movies that people are watching, it's all computer generated."}, {"time": 887, "text": "You know, even nowadays, even you watch a drama movie and like, there's nothing going on action wise, but it turns out it's kind of like cheaper, I guess, to render the background."}, {"time": 895, "text": "And so they would."}, {"time": 897, "text": "But how do we get there?"}, {"time": 899, "text": "How do we get a human that's would pass the mom slash friend test, a simulation of a human walking?"}, {"time": 909, "text": "So do you think that's something we can creep up to by just doing kind of a comparison learning where you have humans annotate what's more realistic and not just by watching, like what's the path?"}, {"time": 924, "text": "Cause it seems totally mysterious how we simulate human behavior."}, {"time": 929, "text": "It's hard because a lot of the other things that I mentioned to you, including simulating cameras, right?"}, {"time": 935, "text": "It is, the thing there is that, you know, we know the physics, we know how it works like in the real world and we can write some rules and we can do that."}, {"time": 946, "text": "Like for example, simulating cameras, there's this thing called ray tracing."}, {"time": 949, "text": "I mean, you literally just kind of imagine it's very similar to, it's not exactly the same, but it's very similar to tracing photon by photon."}, {"time": 957, "text": "They're going around, bouncing on things and come into your eye, but human behavior, developing a dynamic, like a model of that, that is mathematical so that you can put it into a processor that would go through that, that's going to be hard."}, {"time": 973, "text": "And so what else do you got?"}, {"time": 975, "text": "You can collect data, right?"}, {"time": 977, "text": "And you can try to match the data."}, {"time": 980, "text": "Or another thing that you can do is that, you know, you can show the friend test, you know, you can say this or that and this or that, and that will be labeling."}, {"time": 987, "text": "Anything that requires human labeling, ultimately we're limited by the number of humans that, you know, we have available at our disposal and the things that they can do, you know, they have to do a lot of other things than also labeling this data."}, {"time": 999, "text": "So that modeling human behavior part is, is I think going, we're going to realize it's very tough."}, {"time": 1005, "text": "And I think that also affects, you know, our development of autonomous vehicles."}, {"time": 1010, "text": "I see them in self driving as well."}, {"time": 1012, "text": "Like you want to use, so you're building self driving, you know, at the first time, like right after urban challenge, I think everybody focused on localization, mapping and localization, you know, slam algorithms came in, Google was just doing that."}, {"time": 1026, "text": "And so building these HD maps, basically that's about knowing where you are."}, {"time": 1031, "text": "And then five years later in 2012, 2013 came the kind of coding code AI revolution."}, {"time": 1036, "text": "And that started telling us where everybody else is, but we're still missing what everybody else is going to do next."}, {"time": 1043, "text": "And so you want to know where you are."}, {"time": 1044, "text": "You want to know what everybody else is."}, {"time": 1046, "text": "Hopefully you know that what you're going to do next, and then you want to predict what other people are going to do."}, {"time": 1050, "text": "And that last bit has, has been a real, real challenge."}, {"time": 1055, "text": "What do you think is the role, your own of your, of your, the ego vehicle, the robot, the you, the robotic you in controlling and having some control of how the future unrolls of what's going to happen in the future."}, {"time": 1071, "text": "That seems to be a little bit ignored in trying to predict the future is how you yourself can affect that future by being either aggressive or less aggressive or signaling in some kind of way."}, {"time": 1086, "text": "So this kind of game theoretic dance seems to be ignored for the moment."}, {"time": 1090, "text": "It's yeah, it's, it's totally ignored."}, {"time": 1092, "text": "I mean, it's, it's quite interesting actually, like how we how we interact with things versus we interact with humans."}, {"time": 1101, "text": "Like so if, if you see a vehicle that's completely empty and it's trying to do something, all of a sudden it becomes a thing."}, {"time": 1109, "text": "So interacted with like you interact with this table and so you can throw your backpack or you can kick your, kick it, put your feet on it and things like that."}, {"time": 1118, "text": "But when it's a human, there's all kinds of ways of interacting with a human."}, {"time": 1122, "text": "So if you know, like you and I are face to face, we're very civil."}, {"time": 1125, "text": "You know, we talk, we understand each other for the most part."}, {"time": 1128, "text": "We'll see you just, you never know what's going to happen."}, {"time": 1132, "text": "But the thing is that like, for example, you and I might interact through YouTube comments and, you know, the conversation may go at a totally different angle."}, {"time": 1141, "text": "And so I think people kind of abusing as autonomous vehicles is a real issue in some sense."}, {"time": 1148, "text": "And so when you're an ego vehicle, you're trying to, you know, coordinate your way, make your way, it's actually kind of harder than being a human."}, {"time": 1156, "text": "You know, it's like, it's you, you, you not only need to be as smart as, as kind of humans are, but you also, you're a thing."}, {"time": 1162, "text": "So they're going to abuse you a little bit."}, {"time": 1163, "text": "So you need to make sure that you can get around and do something."}, {"time": 1168, "text": "So I, in general, believe in that sort of game theoretic aspects."}, {"time": 1174, "text": "I've actually personally have done, you know, quite a few papers, both on that kind of game theory and also like this, this kind of understanding people's social value orientation, for example, you know, some people are aggressive, some people not so much."}, {"time": 1188, "text": "And, and, you know, like a robot could understand that by just looking at how people drive."}, {"time": 1194, "text": "And as they kind of come in approach, you can actually understand, like if someone is going to be aggressive or, or not as a robot and you can make certain decisions."}, {"time": 1202, "text": "Well, in terms of predicting what they're going to do, the hard question is you as a robot, should you be aggressive or not when faced with an aggressive robot?"}, {"time": 1213, "text": "Right now it seems like aggressive is a very dangerous thing to do because it's costly from a societal perspective, how you're perceived."}, {"time": 1222, "text": "People are not very accepting of aggressive robots in modern society."}, {"time": 1227, "text": "I think that's accurate."}, {"time": 1228, "text": "So that is really is."}, {"time": 1231, "text": "And so I'm not entirely sure like how to have to go about, but I know, I know for a fact that how these robots interact with other people in there is going to be, and then interaction is always going to be there."}, {"time": 1242, "text": "I mean, you could be interacting with other vehicles or other just people kind of like walking around."}, {"time": 1248, "text": "And like I said, the moment there's like nobody in the seat, it's like an empty thing just rolling off the street."}, {"time": 1254, "text": "It becomes like no different than like any other thing that's not human."}, {"time": 1259, "text": "And so people, and maybe abuse is the wrong word, but people maybe rightfully even they feel like this is a human present environment designed for humans to be, and they kind of they want to own it."}, {"time": 1273, "text": "And then the robots, they would need to understand it and they would need to respond in a certain way."}, {"time": 1279, "text": "And I think that this actually opens up like quite a few interesting societal questions for us as we deploy, like we talk robots at large scale."}, {"time": 1286, "text": "So what would happen when we try to deploy robots at large scale, I think is that we can design systems in a way that they're very efficient or we can design them that they're very sustainable, but ultimately the sustainability efficiency trade offs, like they're going to be right in there and we're going to have to make some choices."}, {"time": 1304, "text": "Like we're not going to be able to just kind of put it aside."}, {"time": 1307, "text": "So for example, we can be very aggressive and we can reduce transportation delays, increase capacity of transportation, or we can be a lot nicer and allow other people to kind of quote unquote own the environment and live in a nice place and then efficiency will drop."}, {"time": 1324, "text": "So when you think about it, I think sustainability gets attached to energy consumption or environmental impact immediately."}, {"time": 1331, "text": "And those are there, but like livability is another sustainability impact."}, {"time": 1335, "text": "So you create an environment that people want to live in."}, {"time": 1339, "text": "And if, if, if robots are going around being aggressive and you don't want to live in that environment, maybe, however, you should note that if you're not being aggressive, then, you know, you're probably taking up some, some delays in transportation and this and that."}, {"time": 1352, "text": "So you're always balancing that."}, {"time": 1354, "text": "And I think this, this choice has always been there in transportation, but I think the more autonomy comes in, the more explicit the choice becomes."}, {"time": 1363, "text": "And when it becomes explicit, then we can start to optimize it and then we'll get to ask the very difficult societal questions of what do we value more, efficiency or sustainability?"}, {"time": 1373, "text": "It's kind of interesting."}, {"time": 1376, "text": "I think we're going to have to like, I think that the interesting thing about like the whole autonomous vehicles question, I think is also kind of, um, I think a lot of times, you know, we have, we have focused on technology development, like hundreds of years and you know, the products somehow followed and then, you know, we got to make these choices and things like that."}, {"time": 1396, "text": "So this is, this is a good time that, you know, we even think about, you know, autonomous taxi type of deployments and the systems that would evolve from there."}, {"time": 1405, "text": "And you realize the business models are different."}, {"time": 1408, "text": "The impact on architecture is different, urban planning, you get into like regulations, um, and then you get into like these issues that you didn't think about before, but like sustainability and ethics is like right in the middle of it."}, {"time": 1421, "text": "I mean, even testing autonomous vehicles, like think about it, you're testing autonomous vehicles in human present environments."}, {"time": 1427, "text": "I mean, uh, the risk may be very small, but still, you know, it's, it's a, it's a, it's, it's a, you know, strictly greater than zero risk that you're putting people into."}, {"time": 1436, "text": "And so then you have that innovation, you know, risk trade off that you're, you're in that somewhere."}, {"time": 1442, "text": "Um, and we, we understand that pretty now that pretty well now is that if we don't test the, at least the, the development will be slower."}, {"time": 1452, "text": "I mean, it doesn't mean that we're not going to be able to develop."}, {"time": 1455, "text": "I think it's going to be pretty hard actually."}, {"time": 1457, "text": "Maybe we can, we don't, we don't, I don't know."}, {"time": 1458, "text": "But the thing is that those kinds of trade offs we already are making and as these systems become more ubiquitous, I think those trade offs will just really hit."}, {"time": 1470, "text": "So you are one of the founders of Optimus Ride and autonomous vehicle company."}, {"time": 1474, "text": "We'll talk about it, but let me on that point ask maybe a good examples, keeping Optimus Ride out, out of this question, uh, sort of exemplars of different strategies on the spectrum of innovation and safety or caution."}, {"time": 1496, "text": "So like Waymo, Google self driving car Waymo represents maybe a more cautious approach."}, {"time": 1503, "text": "And then you have Tesla on the other side headed by Elon Musk that represents a more, however, which adjective you want to use, aggressive, innovative, I don't know."}, {"time": 1514, "text": "But uh, what, what do you think about the difference in the two strategies in your view?"}, {"time": 1521, "text": "What's more likely, what's needed and is more likely to succeed in the short term and in the long term?"}, {"time": 1530, "text": "Definitely some sort of a balance is, is kind of the right way to go."}, {"time": 1533, "text": "But I do think that the thing that is the most important is actually like an informed public."}, {"time": 1539, "text": "So I don't, I don't mind, you know, I personally, like if I were in some place, I wouldn't mind so much like taking a certain amount of risk, um, some other people might."}, {"time": 1552, "text": "And so I think the key is for people to be informed and so that they can, ideally they can make a choice."}, {"time": 1559, "text": "In some cases, that kind of choice, um, making that unanimously is of course very hard."}, {"time": 1566, "text": "But I don't think it's actually that hard to inform people."}, {"time": 1570, "text": "So I think in, in, in one case, like for example, even the Tesla approach, um, I don't know, it's hard to judge how informed it is, but it is somewhat informed."}, {"time": 1580, "text": "I mean, you know, things kind of come out."}, {"time": 1581, "text": "I think people know what they're taking and things like that and so on."}, {"time": 1585, "text": "But I think the, the underlying, um, I do think that these two companies are a little bit kind of representing like the, of course they, you know, one of them seems a bit safer or the other one, or, you know, um, whatever the objective for that is, and the other one seems more aggressive or whatever the objective for that is."}, {"time": 1603, "text": "But, but I think, you know, when you turn the tables, they're actually, there are two other orthogonal dimensions that these two are focusing on."}, {"time": 1610, "text": "On the one hand for Waymo, I can see that, you know, they're, I mean, um, they, I think they a little bit see it as research as well."}, {"time": 1617, "text": "So they kind of, they don't, I'm not sure if they're like really interested in like an immediate, um, product, um, you know, they, they talk about it."}, {"time": 1625, "text": "Um, sometimes there's some pressure to talk about it."}, {"time": 1628, "text": "So they, they kind of go for it, but I think, um, I think that they're thinking, um, maybe in the back of their minds, maybe they don't put it this way, but I think they, they realize that we're building like a new engine."}, {"time": 1640, "text": "It's kind of like call it the AI engine or whatever that is."}, {"time": 1643, "text": "And you know, an autonomous vehicles is a very interesting embodiment of that engine that allows you to understand where the ego vehicle is, the ego thing is where everything else is, what everything else is going to do and how do you react, how do you actually, you know, interact with humans the right way?"}, {"time": 1658, "text": "How do you build these systems?"}, {"time": 1659, "text": "And I think, uh, they, they want to know that they want to understand that."}, {"time": 1663, "text": "And so they keep going and doing that."}, {"time": 1665, "text": "And so on the other dimension, Tesla is doing something interesting."}, {"time": 1668, "text": "I mean, I think that they have a good product."}, {"time": 1670, "text": "People use it."}, {"time": 1671, "text": "I think that, you know, like it's, it's not for me, um, but I can totally see people, people like it and, and people, I think they have a good product outside of automation, but I was just referring to the, the, the automation itself."}, {"time": 1682, "text": "I mean, you know, like it, it kind of drives itself."}, {"time": 1685, "text": "You still have to be kind of, um, you still have to pay attention to it, right?"}, {"time": 1689, "text": "Well, you know, um, people seem to use it."}, {"time": 1692, "text": "So it works for something."}, {"time": 1694, "text": "And so people, I think people are willing to pay for it."}, {"time": 1696, "text": "People are willing to buy it."}, {"time": 1697, "text": "I think it, uh, it's, it's one of the other reasons why people buy a Tesla car."}, {"time": 1702, "text": "Maybe one of those reasons is Elon Musk is the CEO and you know, he seems like a visionary person."}, {"time": 1707, "text": "That's what people think."}, {"time": 1708, "text": "He's a great person."}, {"time": 1709, "text": "And so that adds like 5k to the value of the car and then maybe another 5k is the autopilot and, and you know, it's, it's useful."}, {"time": 1715, "text": "I mean, it's, um, useful in the sense that like people are using it."}, {"time": 1720, "text": "And so I can see Tesla and sure, of course they want to be visionary."}, {"time": 1725, "text": "They want to kind of put out a certain approach and they may actually get there."}, {"time": 1728, "text": "Um, but I think that there's also a primary benefit of doing all these updates and rolling it out because, you know, people pay for it and it's, it's, you know, it's basic, you know, demand, supply market and people like it."}, {"time": 1743, "text": "They're happy to pay another 5k, 10k for that novelty or whatever that is, um, they, and they use it."}, {"time": 1750, "text": "It's not like they get it and they try it a couple of times as a novelty, but they use it a lot of the time."}, {"time": 1755, "text": "And so I think that's what Tesla is doing."}, {"time": 1757, "text": "It's actually pretty different."}, {"time": 1758, "text": "Like they, they are on pretty orthogonal dimensions of what kind of things that they're building."}, {"time": 1763, "text": "They are using the same AI engine."}, {"time": 1765, "text": "So it's very possible that, you know, they're both going to be, um, sort of one day, um, kind of using a similar, almost like an internal internal combustion engine."}, {"time": 1774, "text": "It's a very bad metaphor, but similar internal combustion engine, and maybe one of them is building like a car."}, {"time": 1781, "text": "The other one is building a truck or something."}, {"time": 1782, "text": "So ultimately the use case is very different."}, {"time": 1785, "text": "So you, like I said, are one of the founders of Optimus, right?"}, {"time": 1788, "text": "Let's take a step back."}, {"time": 1789, "text": "That's one of the success stories in the autonomous vehicle space."}, {"time": 1794, "text": "It's a great autonomous vehicle company."}, {"time": 1796, "text": "Let's go from the very beginning."}, {"time": 1798, "text": "What does it take to start an autonomous vehicle company?"}, {"time": 1802, "text": "How do you go from idea to deploying vehicles like you are in a few, a bunch of places, including New York?"}, {"time": 1808, "text": "I would say that I think that, you know, what happened to us is it was, was the following."}, {"time": 1812, "text": "I think, um, we realized a lot of kind of talk in the autonomous vehicle industry back in like 2014, even when we wanted to kind of get started."}, {"time": 1822, "text": "Um, and, and I don't know, like I, I kind of, I would hear things like fully autonomous vehicles, two years from now, three years from now, I kind of never bought it."}, {"time": 1833, "text": "Um, you know, I was a part of, um, MIT's urban challenge entry."}, {"time": 1837, "text": "Um, it kind of like, it has an interesting history."}, {"time": 1840, "text": "So, um, I did in, in, in college and in high school, sort of a lot of mathematically oriented work."}, {"time": 1847, "text": "I mean, I kind of, you know, at some point, uh, it kind of hit me."}, {"time": 1850, "text": "I wanted to build something."}, {"time": 1852, "text": "And so I came to MIT's mechanical engineering program and I now realize, I think my advisor hired me because I could do like really good math, but I told him that, no, no, no, I want to work on that urban challenge car."}, {"time": 1864, "text": "I want to build the autonomous car."}, {"time": 1866, "text": "And I think that was, that was kind of like a process where we really learned, I mean, what the challenges are and what kind of limitations are we up against, you know, like having the limitations of computers or understanding human behavior, there's so many of these things."}, {"time": 1881, "text": "And I think it just kind of didn't."}, {"time": 1883, "text": "And so, so we said, Hey, you know, like, why don't we take a more like a market based approach?"}, {"time": 1889, "text": "So we focus on a certain kind of market and we build a system for that."}, {"time": 1895, "text": "What we're building is not so much of like an autonomous vehicle only, I would say."}, {"time": 1898, "text": "So we build full autonomy into the vehicles."}, {"time": 1901, "text": "But, you know, the way we kind of see it is that we think that the approach should actually involve humans operating them, not just, just not sitting in the vehicle."}, {"time": 1912, "text": "And I think today, what we have is today, we have one person operate one vehicle, no matter what that vehicle, it could be a forklift, it could be a truck, it could be a car, whatever that is."}, {"time": 1924, "text": "And we want to go from that to 10 people operate 50 vehicles."}, {"time": 1930, "text": "If you're referring to a world of maybe perhaps teleoperation, so can you just say what it means for 10?"}, {"time": 1937, "text": "It might be confusing for people listening."}, {"time": 1939, "text": "What does it mean for 10 people to control 50 vehicles?"}, {"time": 1943, "text": "That's a good point."}, {"time": 1944, "text": "So I think it's, I very deliberately didn't call it teleoperation because what people think then is that people think, away from the vehicle sits a person, sees like maybe puts on goggles or something, VR and drives the car."}, {"time": 1958, "text": "So that's not at all what we mean, but we mean the kind of intelligence whereby humans are in control, except in certain places, the vehicles can execute on their own."}, {"time": 1969, "text": "And so imagine like, like a room where people can see what the other vehicles are doing and everything."}, {"time": 1976, "text": "And you know, there will be some people who are more like, more like air traffic controllers, call them like AV controllers."}, {"time": 1984, "text": "And so these AV controllers would actually see kind of like a whole map and they would understand where vehicles are really confident and where they kind of need a little bit more help."}, {"time": 1996, "text": "And the help shouldn't be for safety."}, {"time": 1999, "text": "Help should be for efficiency."}, {"time": 2001, "text": "Vehicles should be safe no matter what."}, {"time": 2002, "text": "If you had zero people, they could be very safe, but they'd be going five miles an hour."}, {"time": 2007, "text": "And so if you want them to go around 25 miles an hour, then you need people to come in and, and for example, you know, the vehicle come to an intersection and the vehicle can say, you know, I can wait."}, {"time": 2019, "text": "I can inch forward a little bit, show my intent, or I can turn left."}, {"time": 2025, "text": "And right now it's clear I can turn, I know that, but before you give me the go, I won't."}, {"time": 2030, "text": "And so that's one example."}, {"time": 2031, "text": "This doesn't mean necessarily we're doing that actually."}, {"time": 2033, "text": "I think, I think if you go down all the, all that much detail that every intersection you're kind of expecting a person to press a button, then I don't think you'll get the efficiency benefits you want."}, {"time": 2044, "text": "You need to be able to kind of go around and be able to do these things."}, {"time": 2047, "text": "But, but I think you need people to be able to set high level behavior to vehicles."}, {"time": 2052, "text": "That's the other thing with autonomous vehicles, you know, I think a lot of people kind of think about it as follows."}, {"time": 2056, "text": "I mean, this happens with technology a lot."}, {"time": 2058, "text": "You know, you think, all right, so I know about cars and I heard robots."}, {"time": 2063, "text": "So I think how this is going to work out is that I'm going to buy a car, press a button and it's going to drive itself."}, {"time": 2069, "text": "And when is that going to happen?"}, {"time": 2071, "text": "You know, and people kind of tend to think about it that way, but when you think about what really happens is that something comes in in a way that you didn't even expect."}, {"time": 2080, "text": "If asked, you might have said, I don't think I need that, or I don't think it should be that and so on."}, {"time": 2085, "text": "And then, and then that, that becomes the next big thing, coding code."}, {"time": 2089, "text": "And so I think that this kind of different ways of humans operating vehicles could be really powerful."}, {"time": 2095, "text": "I think that sooner than later, we might open our eyes up to a world in which you go around walk in a mall and there's a bunch of security robots that are exactly operated in this way."}, {"time": 2106, "text": "You go into a factory or a warehouse, there's a whole bunch of robots that are playing exactly in this way."}, {"time": 2111, "text": "You go to a, you go to the Brooklyn Navy Yard, you see a whole bunch of autonomous vehicles, Optimus Ride, and they're operated maybe in this way."}, {"time": 2121, "text": "But I think people kind of don't see that."}, {"time": 2122, "text": "I sincerely think that there's a possibility that we may almost see like a whole mushrooming of this technology in all kinds of places that we didn't expect before."}, {"time": 2133, "text": "And that may be the real surprise."}, {"time": 2135, "text": "And then one day when your car actually drives itself, it may not be all that much of a surprise at all because you see it all the time."}, {"time": 2142, "text": "You interact with them, you take the Optimus Ride, hopefully that's your choice."}, {"time": 2147, "text": "And then you hear a bunch of things, you go around, you interact with them."}, {"time": 2153, "text": "Like you have a little delivery vehicle that goes around the sidewalks and delivers you things and then you take it, it says thank you."}, {"time": 2159, "text": "And then you get used to that and one day your car actually drives itself and the regulation goes by and you can hit the button of sleep and it wouldn't be a surprise at all."}, {"time": 2168, "text": "I think that may be the real reality."}, {"time": 2170, "text": "So there's going to be a bunch of applications that pop up around autonomous vehicles, some of which, maybe many of which we don't expect at all."}, {"time": 2180, "text": "So if we look at Optimus Ride, what do you think, you know, the viral application, the one that like really works for people in mobility, what do you think Optimus Ride will connect with in the near future first?"}, {"time": 2196, "text": "I think that the first places that I like to target honestly is like these places where transportation is required within an environment, like people typically call it geofence."}, {"time": 2206, "text": "So you can imagine like roughly two mile by two mile could be bigger, could be smaller type of an environment."}, {"time": 2213, "text": "And there's a lot of these kinds of environments that are typically transportation deprived."}, {"time": 2217, "text": "The Brooklyn Navy Yard that, you know, we're in today, we're in a few different places, but that was the one that was last publicized and that's a good example."}, {"time": 2226, "text": "So there's not a lot of transportation there and you wouldn't expect like, I don't know, I think maybe operating an Uber there ends up being sort of a little too expensive or when you compare it with operating Uber elsewhere, elsewhere becomes the priority and these places become totally transportation deprived."}, {"time": 2246, "text": "And then what happens is that, you know, people drive into these places and to go from point A to point B inside this place within that day, they use their cars."}, {"time": 2255, "text": "And so we end up building more parking for them to, for example, take their cars and go to the lunch place."}, {"time": 2263, "text": "And I think that one of the things that can be done is that, you know, you can put in efficient, safe, sustainable transportation systems into these types of places first."}, {"time": 2273, "text": "And I think that, you know, you could deliver mobility in an affordable way, affordable, accessible, you know, sustainable way."}, {"time": 2283, "text": "But I think what also enables is that this kind of effort, money, area, land that we spend on parking, you could reclaim some of that."}, {"time": 2292, "text": "And that is on the order of like, even for a small environment like two mile by two mile, it doesn't have to be smack in the middle of New York."}, {"time": 2299, "text": "I mean, anywhere else you're talking tens of millions of dollars."}, {"time": 2303, "text": "If you're smack in the middle of New York, you're looking at billions of dollars of savings just by doing that."}, {"time": 2308, "text": "And that's the economic part of it."}, {"time": 2309, "text": "And there's a societal part, right?"}, {"time": 2311, "text": "I mean, just look around."}, {"time": 2312, "text": "I mean the places that we live are like built for cars."}, {"time": 2318, "text": "It didn't look like this just like a hundred years ago, like today, no one walks in the middle of the street."}, {"time": 2324, "text": "It's for cars."}, {"time": 2325, "text": "No one tells you that growing up, but you grow into that reality."}, {"time": 2329, "text": "And so sometimes they close the road."}, {"time": 2331, "text": "It happens here, you know, like the celebration, they close the road."}, {"time": 2334, "text": "Still people don't walk in the middle of the road, like just walk in the middle and people don't."}, {"time": 2338, "text": "But I think it has so much impact, the car in the space that we have."}, {"time": 2344, "text": "And I think we talked about sustainability, livability."}, {"time": 2347, "text": "I mean, ultimately these kinds of places that parking spots at the very least could change into something more useful or maybe just like park areas, recreational."}, {"time": 2356, "text": "And so I think that's the first thing that we're targeting."}, {"time": 2359, "text": "And I think that we're getting like a really good response, both from an economic societal point of view, especially places that are a little bit forward looking."}, {"time": 2367, "text": "And like, for example, Brooklyn Navy Yard, they have tenants."}, {"time": 2371, "text": "There's distinct direct call like new lab."}, {"time": 2373, "text": "It's kind of like an innovation center."}, {"time": 2375, "text": "There's a bunch of startups there."}, {"time": 2376, "text": "And so, you know, you get those kinds of people and, you know, they're really interested in sort of making that environment more livable."}, {"time": 2384, "text": "And these kinds of solutions that Optimus Ride provides almost kind of comes in and becomes that."}, {"time": 2390, "text": "And many of these places that are transportation deprived, you know, they have, they actually rent shuttles."}, {"time": 2397, "text": "And so, you know, you can ask anybody, the shuttle experience is like terrible."}, {"time": 2403, "text": "People hate shuttles."}, {"time": 2406, "text": "Because, you know, like the driver is very expensive in a shuttle business."}, {"time": 2411, "text": "So what makes sense is to attach 20, 30 seats to a driver."}, {"time": 2415, "text": "And a lot of people have this misconception."}, {"time": 2417, "text": "They think that shuttles should be big."}, {"time": 2419, "text": "Sometimes we get that at Optimus Ride."}, {"time": 2420, "text": "We tell them, we're going to give you like four seaters, six seaters."}, {"time": 2423, "text": "And we get asked like, how about like 20 seaters?"}, {"time": 2425, "text": "I'm like, you know, you don't need 20 seaters."}, {"time": 2427, "text": "You want to split up those seats so that they can travel faster and the transportation delays would go down."}, {"time": 2433, "text": "That's what you want."}, {"time": 2434, "text": "If you make it big, not only you will get delays in transportation, but you won't have an agile vehicle."}, {"time": 2440, "text": "It will take a long time to speed up, slow down and so on."}, {"time": 2444, "text": "You need to climb up to the thing."}, {"time": 2445, "text": "So it's kind of like really hard to interact with."}, {"time": 2448, "text": "And scheduling too, perhaps when you have more smaller vehicles, it becomes closer to Uber where you can actually get a personal, I mean, just the logistics of getting the vehicle to you becomes easier when you have a giant shuttle."}, {"time": 2462, "text": "There's fewer of them and it probably goes on a route, a specific route that is supposed to hit."}, {"time": 2468, "text": "And when you go on a specific route and all seats travel together versus, you know, you have a whole bunch of them."}, {"time": 2474, "text": "You can imagine the route you can still have, but you can imagine you split up the seats and instead of, you know, them traveling, like, I don't know, a mile apart, they could be like, you know, half a mile apart if you split them into two."}, {"time": 2488, "text": "That basically would mean that your delays, when you go out, you won't wait for them for a long time."}, {"time": 2495, "text": "And that's one of the main reasons, or you don't have to climb up."}, {"time": 2497, "text": "The other thing is that I think if you split them up in a nice way, and if you can actually know where people are going to be somehow, you don't even need the app."}, {"time": 2506, "text": "A lot of people ask us the app, we say, why don't you just walk into the vehicle?"}, {"time": 2510, "text": "How about you just walk into the vehicle, it recognizes who you are and it gives you a bunch of options of places that you go and you just kind of go there."}, {"time": 2517, "text": "I mean, people kind of also internalize the apps."}, {"time": 2521, "text": "Everybody needs an app."}, {"time": 2522, "text": "It's like, you don't need an app."}, {"time": 2523, "text": "You just walk into the thing."}, {"time": 2525, "text": "But I think one of the things that, you know, we really try to do is to take that shuttle experience that no one likes and tilt it into something that everybody loves."}, {"time": 2534, "text": "And so I think that's another important thing."}, {"time": 2537, "text": "I would like to say that carefully, just like teleoperation, like we don't do shuttles."}, {"time": 2541, "text": "You know, we're really kind of thinking of this as a system or a network that we're designing."}, {"time": 2548, "text": "But ultimately, we go to places that would normally rent a shuttle service that people wouldn't like as much and we want to tilt it into something that people love."}, {"time": 2557, "text": "So you've mentioned this earlier, but how many Optimus ride vehicles do you think would be needed for any person in Boston or New York, if they step outside, there will be, this is like a mathematical question, there'll be two Optimus ride vehicles within line of sight."}, {"time": 2576, "text": "Is that the right number to, well, at least one."}, {"time": 2578, "text": "For example, that's the density."}, {"time": 2581, "text": "So meaning that if you see one vehicle, you look around, you see another one too."}, {"time": 2587, "text": "Imagine like, you know, Tesla would tell you they collect a lot of data."}, {"time": 2591, "text": "Do you see that with Tesla?"}, {"time": 2592, "text": "Like you just walk around and you look around, you see Tesla?"}, {"time": 2597, "text": "Very specific areas of California, maybe."}, {"time": 2601, "text": "Like there's a couple of zip codes that, you know, but I think that's kind of important because you know, like maybe the couple of zip codes, the one thing that we kind of depend on and I'll get to your question in a second, but now like we're taking a lot of tensions today."}, {"time": 2614, "text": "And so I think that this is actually important."}, {"time": 2618, "text": "People call this data density or data velocity."}, {"time": 2621, "text": "So it's very good to collect data in a way that, you know, you see the same place so many times."}, {"time": 2627, "text": "Like you can drive 10,000 miles around the country or you drive 10,000 miles in a confined environment."}, {"time": 2634, "text": "You'll see the same intersection hundreds of times."}, {"time": 2636, "text": "And when it comes to predicting what people are going to do in that specific intersection, you become really good at it versus if you draw in like 10,000 miles around the country, you've seen that only once."}, {"time": 2646, "text": "And so trying to predict what people do becomes hard."}, {"time": 2650, "text": "And I think that, you know, you said what is needed, it's tens of thousands of vehicles."}, {"time": 2654, "text": "You know, you really need to be like a specific fractional vehicle."}, {"time": 2657, "text": "Like for example, in good times in Singapore, you can go and you can just grab a cab and they are like, you know, 10%, 20% of traffic, those taxis."}, {"time": 2669, "text": "Ultimately that's where you need to get to."}, {"time": 2671, "text": "So that, you know, you get to a certain place where you really, the benefits really kick off in like orders of magnitude type of a point."}, {"time": 2680, "text": "But once you get there, you actually get the benefits."}, {"time": 2683, "text": "And you can certainly carry people."}, {"time": 2684, "text": "I think that's one of the things people really don't like to wait for themselves."}, {"time": 2691, "text": "But for example, they can wait a lot more for the goods if they order something."}, {"time": 2695, "text": "Like you're sitting at home and you want to wait half an hour."}, {"time": 2697, "text": "That sounds great."}, {"time": 2698, "text": "People will say it's great."}, {"time": 2699, "text": "You want to, you're going to take a cab, you're waiting half an hour."}, {"time": 2702, "text": "Like that's crazy."}, {"time": 2703, "text": "You don't want to wait that much."}, {"time": 2706, "text": "But I think, you know, you can, I think really get to a point where the system at peak times really focuses on kind of transporting humans around."}, {"time": 2714, "text": "And then it's really, it's a good fraction of the traffic to the point where, you know, you go, you look around and there's something there and you just kind of basically get in there and it's already waiting for you or something like that."}, {"time": 2727, "text": "And then you take it."}, {"time": 2728, "text": "If you do it at that scale, like today, for instance, Uber, if you talk to a driver, right?"}, {"time": 2735, "text": "I mean, Uber takes a certain cut."}, {"time": 2737, "text": "It's a small cut."}, {"time": 2739, "text": "Or drivers would argue that it's a large cut, but you know, it's when you look at the grand scheme of things, most of that money that you pay Uber kind of goes to the driver."}, {"time": 2750, "text": "And if you talk to the driver, the driver will claim that most of it is their time."}, {"time": 2754, "text": "You know, it's not spent on gas."}, {"time": 2756, "text": "They think it's not spent on the car per se as much."}, {"time": 2761, "text": "It's like their time."}, {"time": 2762, "text": "And if you didn't have a person driving, or if you're in a scenario where, you know, like 0.1 person is driving the car, a fraction of a person is kind of operating the car because you know, you want to operate several."}, {"time": 2777, "text": "If you're in that situation, you realize that the internal combustion engine type of cars are very inefficient."}, {"time": 2783, "text": "You know, we build them to go on highways, they pass crash tests."}, {"time": 2786, "text": "They're like really heavy."}, {"time": 2787, "text": "They really don't need to be like 25 times the weight of its passengers or, you know, like area wise and so on."}, {"time": 2795, "text": "But if you get through those inefficiencies and if you really build like urban cars and things like that, I think the economics really starts to check out."}, {"time": 2803, "text": "Like to the point where, I mean, I don't know, you may be able to get into a car and it may be less than a dollar to go from A to B."}, {"time": 2807, "text": "As long as you don't change your destination, you just pay 99 cents and go there."}, {"time": 2815, "text": "If you share it, if you take another stop somewhere, it becomes a lot better."}, {"time": 2820, "text": "You know, these kinds of things, at least for models, at least for mathematics and theory, they start to really check out."}, {"time": 2827, "text": "So I think it's really exciting what Optimus Ride is doing in terms of it feels the most reachable, like it'll actually be here and have an impact."}, {"time": 2835, "text": "Yeah, that is the idea."}, {"time": 2837, "text": "And if we contrast that, again, we'll go back to our old friends, Waymo and Tesla."}, {"time": 2843, "text": "So Waymo seems to have sort of technically similar approaches as Optimus Ride, but a different, they're not as interested as having impact today."}, {"time": 2891, "text": "And then Tesla is like the complete opposite, which is, you know, the entirety of the world actually is going to be automated."}, {"time": 2901, "text": "Highway driving, urban driving, every kind of driving, you know, you kind of creep up to it by incrementally improving the capabilities of the autopilot system."}, {"time": 2913, "text": "So when you contrast all of these, and on top of that, let me throw a question that nobody likes, but is a timeline."}, {"time": 2922, "text": "When do you think each of these approaches, loosely speaking, nobody can predict the future, will see mass deployment?"}, {"time": 2929, "text": "So Elon Musk predicts the craziest approach is, I've heard figures like at the end of this year, right?"}, {"time": 2938, "text": "So that's probably wildly inaccurate, but how wildly inaccurate is it?"}, {"time": 2946, "text": "I mean, first thing to lay out, like everybody else, it's really hard to guess."}, {"time": 2951, "text": "I mean, I don't know where Tesla can look at or Elon Musk can look at and say, hey, you know, it's the end of this year."}, {"time": 2959, "text": "I mean, I don't know what you can look at."}, {"time": 2962, "text": "You know, even the data that, I mean, if you look at the data, even kind of trying to extrapolate the end state without knowing what exactly is going to go, especially for like a machine learning approach."}, {"time": 2975, "text": "I mean, it's just kind of very hard to predict."}, {"time": 2979, "text": "But I do think the following does happen."}, {"time": 2981, "text": "I think a lot of people, you know, what they do is that there's something that I called a couple times time dilation in technology prediction happens."}, {"time": 2991, "text": "Let me try to describe a little bit."}, {"time": 2993, "text": "There's a lot of things that are so far ahead, people think they're close."}, {"time": 2997, "text": "And there's a lot of things that are actually close."}, {"time": 3000, "text": "People think it's far ahead."}, {"time": 3002, "text": "People try to kind of look at a whole landscape of technology development, admittedly, it's chaos."}, {"time": 3008, "text": "Anything can happen in any order at any time."}, {"time": 3010, "text": "And there's a whole bunch of things in there."}, {"time": 3012, "text": "People take it, clamp it, and put it into the next three years."}, {"time": 3017, "text": "And so then what happens is that there's some things that maybe can happen by the end of the year or next year and so on."}, {"time": 3023, "text": "And they push that into like few years ahead, because it's just hard to explain."}, {"time": 3028, "text": "And there are things that are like, we're looking at 20 years more, maybe, you know, hopefully in my lifetime type of things, because, you know, we don't know."}, {"time": 3037, "text": "I mean, we don't know how hard it is even."}, {"time": 3040, "text": "Like that's a problem."}, {"time": 3041, "text": "We don't know like if some of these problems are actually AI complete, like, we have no idea what's going on."}, {"time": 3048, "text": "And you know, we take all of that and then we clump it."}, {"time": 3051, "text": "And then we say three years from now."}, {"time": 3055, "text": "And then some of us are more optimistic."}, {"time": 3057, "text": "So they're shooting at the end of the year and some of us are more realistic."}, {"time": 3060, "text": "They say like five years, but you know, we all, I think it's just hard to know."}, {"time": 3066, "text": "And I think trying to predict like products ahead two, three years, it's hard to know in the following sense."}, {"time": 3074, "text": "You know, like we typically say, okay, this is a technology company, but sometimes, sometimes really you're trying to build something where the technology does, like there's a technology gap, you know, like, and Tesla had that with electric vehicles, you know, like when they first started, they would look at a chart much like a Moore's law type of chart."}, {"time": 3093, "text": "And they would just kind of extrapolate that out and they'd say, we want to be here."}, {"time": 3097, "text": "What's the technology to get that?"}, {"time": 3099, "text": "It goes like this."}, {"time": 3100, "text": "We're just going to, you know, keep going with AI that goes into the cars."}, {"time": 3106, "text": "We don't even have that."}, {"time": 3107, "text": "Like we don't, we can't, I mean, what can you quantify, like what kind of chart are you looking at?"}, {"time": 3113, "text": "But so, but so I think when there's that technology gap, it's just kind of really hard to predict."}, {"time": 3118, "text": "So now I realize I talked like five minutes and avoid your question."}, {"time": 3121, "text": "I didn't tell you anything about that and it was very skillfully done."}, {"time": 3125, "text": "That was very well done."}, {"time": 3127, "text": "And I don't think you, I think you've actually argued that it's not a use, even any answer you provide now is not that useful."}, {"time": 3132, "text": "It's going to be very hard."}, {"time": 3133, "text": "There's one thing that I really believe in and, um, and you know, this is not my idea and it's been, you know, discussed several times, but, but this, um, this, this kind of like something like a startup, um, or, or a kind of an innovative company, um, including definitely may one, may Waymo, Tesla, maybe even some of the other big companies that are kind of trying things."}, {"time": 3154, "text": "This kind of like iterated learning is very important."}, {"time": 3158, "text": "The fact that we're over there and we're trying things and so on, I think that's, um, that that's important."}, {"time": 3164, "text": "We try to understand."}, {"time": 3165, "text": "And, and I think that, you know, the code in code Silicon Valley has done that with business models pretty well."}, {"time": 3172, "text": "And now I think we're trying to get to do it, but there's a literal technology gap."}, {"time": 3176, "text": "I mean, before, like, you know, you're trying to build, I'm not trying to, you know, I think these companies are building great technology to, for example, enable internet search to do it so quickly."}, {"time": 3187, "text": "And that kind of didn't, didn't, wasn't there so much, but at least like it was a kind of a technology that you could predict to some degree and so on."}, {"time": 3194, "text": "And now we're just kind of trying to build, you know, things that it's kind of hard to quantify what kind of a metric are we looking at?"}, {"time": 3201, "text": "So psychologically as a sort of a, as a leader of graduate students and at Optimus ride a bunch of brilliant engineers, just curiosity, psychologically, do you think it's good to think that, you know, whatever technology gap we're talking about can be closed by the end of the year or do you, you know, cause we don't know."}, {"time": 3226, "text": "So the way, do you want to say that everything is going to improve exponentially to yourself and to others around you as a leader, or do you want to be more sort of maybe not cynical, but I don't want to use realistic cause it's hard to predict, but yeah, maybe more cynical, pessimistic about the ability to close that gap."}, {"time": 3252, "text": "I think that, you know, going back, I think that iterated learning is like key that, you know, you're out there, you're running experiments to learn."}, {"time": 3259, "text": "And that doesn't mean sort of like, you know, like, like your Optimus ride, you're kind of doing something, but like in an environment, but like what Tesla is doing, I think is also kind of like this, this kind of notion."}, {"time": 3270, "text": "And, and, you know, people can go around and say like, you know, this year, next year, the other year and so on."}, {"time": 3275, "text": "But, but I think that the nice thing about it is that they're out there, they're pushing this technology in."}, {"time": 3280, "text": "I think what they should do more of, I think that kind of informed people about what kind of technology that they're providing, you know, the good and the bad."}, {"time": 3310, "text": "I think they're kind of go out there and they, they do great things."}, {"time": 3313, "text": "They do their own kind of experiment."}, {"time": 3314, "text": "I think we do our own and I think we're closing some similar technology gaps, but some also some are orthogonal as well."}, {"time": 3322, "text": "You know, I think like, like we talked about, you know, people being remote, like it's something or in the kind of environments that we're in or think about a Tesla car, maybe, maybe you can enable it one day."}, {"time": 3332, "text": "Like there's, you know, low traffic, like you're kind of the stop on go motion, you just hit the button and the, you can release, or maybe there's another lane that you can pass into, you go in that."}, {"time": 3342, "text": "I think they can enable these kinds of, I believe it."}, {"time": 3345, "text": "And so I think that that part, that is really important and that is really key."}, {"time": 3351, "text": "And beyond that, I think, you know, when is it exactly going to happen and, and, and so on."}, {"time": 3358, "text": "I mean it's like I said, it's very hard to predict."}, {"time": 3362, "text": "And I would, I would imagine that it would be good to do some sort of like a, like a one or two year plan when it's a little bit more predictable that, you know, the technology gaps you close and, and the, and the kind of sort of product that would ensue."}, {"time": 3378, "text": "So I know that from Optimus ride or, you know, other companies that I get involved in."}, {"time": 3382, "text": "I mean, at some point you find yourself in a situation where you're trying to build a product and, and people are investing in that, in that, you know, building effort and those investors that they do want to know as they compare the investments they want to make, they do want to know what happens in the next one or two years."}, {"time": 3402, "text": "And I think that's good to communicate that."}, {"time": 3404, "text": "But I think beyond that, it becomes, it becomes a vision that we want to get to someday and saying five years, 10 years, I don't think it means anything."}, {"time": 3412, "text": "But iterative learning is key to do and learn."}, {"time": 3416, "text": "I think that is key."}, {"time": 3417, "text": "You know, I got to sort of throw back right at you criticism in terms of, you know, like Tesla or somebody communicating, you know, how someone works and so on."}, {"time": 3427, "text": "I got a chance to visit Optimus ride and you guys are doing some awesome stuff and yet the internet doesn't know about it."}, {"time": 3434, "text": "So you should also communicate more showing off, you know, showing off some of the awesome stuff, the stuff that works and stuff that doesn't work."}, {"time": 3442, "text": "I mean, it's just the stuff I saw with the tracking of different objects and pedestrians."}, {"time": 3447, "text": "So I mean, incredible stuff going on there."}, {"time": 3450, "text": "Maybe it's just the nerd in me, but I think the world would love to see that kind of stuff."}, {"time": 3455, "text": "That's, that's well taken."}, {"time": 3456, "text": "Um, you know, I, I should say that it's not like, you know, we, we, we weren't able to, I think we made a decision at some point, um, that decision did involve me quite a bit on kind of, um, uh, sort of doing this in kind of coding code stealth mode for a bit."}, {"time": 3473, "text": "Um, but I think that, you know, we'll, we'll open it up quite a lot more."}, {"time": 3476, "text": "And I think that we are also at Optimus ride kind of hitting, um, when you have new era, um, you know, we're, we're, we're big now, we're doing a lot of interesting things and I think, you know, some of the deployments that we've kind of announced were some of the first bits, bits of, um, information that we kind of put out into the world."}, {"time": 3496, "text": "We'll also put out our technology, a lot of the things that we've been developing is really amazing."}, {"time": 3501, "text": "And then, you know, we're, we're gonna, we're gonna start putting that out now."}, {"time": 3504, "text": "We're especially interested in sort of like, um, being able to work with the best people."}, {"time": 3508, "text": "And I think, and I think it's, it's good to not just kind of show them when they come to our office for an interview, but just put it out there in terms of like, you know, get people excited about what we're doing."}, {"time": 3519, "text": "So on the autonomous vehicle space, let me ask one last question."}, {"time": 3523, "text": "So Elon Musk famously said that lighter is a crutch."}, {"time": 3527, "text": "So I've talked to a bunch of people about it, got to ask you, you use that crutch quite a bit in the DARPA days."}, {"time": 3535, "text": "So, uh, uh, you know, and his, his idea in general, sort of, you know, more provocative and fun, I think than a technical discussion, but the idea is that camera based, primarily camera based systems is going to be what defines the future of autonomous vehicles."}, {"time": 3554, "text": "So what do you think of this idea?"}, {"time": 3556, "text": "Lighter is a crutch versus primarily, uh, camera based systems."}, {"time": 3561, "text": "First things first, I think, you know, I'm a big believer in just camera based autonomous vehicle systems."}, {"time": 3568, "text": "Um, I think that, you know, you can put in a lot of autonomy and, and you can do great things."}, {"time": 3574, "text": "And, and it's, it's, it's very possible that at the time scales, like I said, we can't predict 20 years from now, like you may be able to do, do things that we're doing today only with LIDAR and then you may be able to do them just with cameras."}, {"time": 3588, "text": "And I think that, um, you know, you, you can just, um, I, I, I think that I will put my name on it too."}, {"time": 3594, "text": "You know, there will be a time when you can only use cameras and you'll be fine."}, {"time": 3600, "text": "Um, at that time though, it's very possible that, you know, you find the LIDAR system as another robustifier or, or it's so affordable that it's stupid not to, you know, just kind of put it there."}, {"time": 3615, "text": "And I think, um, and I think we may be looking at a future like that."}, {"time": 3620, "text": "You think we're over relying on LIDAR right now, because we understand the better it's more reliable in many ways in terms of, from a safety perspective."}, {"time": 3628, "text": "It's easier to build with."}, {"time": 3629, "text": "That's the other, that's the other thing."}, {"time": 3631, "text": "I think to be very frank with you, I mean, um, you know, we've seen a lot of sort of autonomous vehicles companies come and go and the approach has been, you know, you slap a LIDAR on a car and it's kind of easy to build with when you have a LIDAR, you know, you just kind of code it up and, and you hit the button and you do a demo."}, {"time": 3652, "text": "So I think there's admittedly, there's a lot of people, they focus on the LIDAR cause it's easier to build with."}, {"time": 3657, "text": "That doesn't mean that, you know, without the camera, just cameras, you can, uh, you cannot do what they're doing, but it's just kind of a lot harder."}, {"time": 3665, "text": "And so you need to have certain kinds of expertise to exploit that."}, {"time": 3668, "text": "What we believe in and, you know, you may be seeing some of it is that, um, we believe in computer vision."}, {"time": 3674, "text": "We certainly work on computer vision and Optimus ride, uh, by a lot, like, um, and, and we've been doing that from day one."}, {"time": 3681, "text": "And we also believe in sensor fusion."}, {"time": 3683, "text": "So, you know, we, we do, we have a relatively minimal use of LIDARs, but, but we do use them."}, {"time": 3689, "text": "And I think, you know, in the future, I really believe that the following sequence of events may happen."}, {"time": 3695, "text": "First things first, number one, there may be a future in which, you know, there's like cars with LIDARs and everything and the cameras, but you know, this in this 50 year ahead future, they can just drive with cameras as well."}, {"time": 3707, "text": "Especially in some isolated environments and cameras, they go and they do the thing in the same future."}, {"time": 3738, "text": "And if you don't put the LIDAR, it's a more expensive system because you have to put in a lot of compute."}, {"time": 3743, "text": "Like, this is another possibility."}, {"time": 3745, "text": "Um, I do think that a lot of the, um, sort of initial deployments of self driving vehicles, I think they will involve LIDARs and especially either low range or short, um, either short range or low resolution LIDARs are actually not that hard to build in solid state."}, {"time": 3762, "text": "Uh, they're still scanning, but like MEMS type of scanning LIDARs and things like that, they're like, they're actually not that hard."}, {"time": 3768, "text": "I think they will maybe kind of playing with the spectrum and the phase arrays that they're a little bit harder, but, but I think, um, like, you know, putting a MEMS mirror in there that kind of scans the environment, it's not hard."}, {"time": 3780, "text": "The only thing is that, you know, you, just like with a lot of the things that we do nowadays in developing technology, you hit fundamental limits of the universe, um, the speed of light becomes a problem in when you're trying to scan the environment."}, {"time": 3792, "text": "So you don't get either good resolution or you don't get range."}, {"time": 3795, "text": "Um, but, but you know, it's still, it's something that you can put in there affordably."}, {"time": 3800, "text": "So let me jump back to, uh, drones."}, {"time": 3804, "text": "You've, uh, you have a role in the Lockheed Martin Alpha Pilot Innovation Challenge."}, {"time": 3810, "text": "Where, uh, teams compete in drone racing and super cool, super intense, interesting application of AI."}, {"time": 3818, "text": "So can you tell me about the very basics of the challenge and where you fit in, what your thoughts are on this problem?"}, {"time": 3826, "text": "And it's sort of echoes of the early DARPA challenge in the, through the desert that we're seeing now, now with drone racing."}, {"time": 3834, "text": "I mean, one interesting thing about it is that, you know, people, the drone racing exists as an eSport."}, {"time": 3841, "text": "And so it's much like you're playing a game, but there's a real drone going in an environment."}, {"time": 3846, "text": "A human being is controlling it with goggles on."}, {"time": 3848, "text": "So there's no, it is a robot, but there's no AI."}, {"time": 3853, "text": "There's no AI."}, {"time": 3855, "text": "Human being is controlling it."}, {"time": 3856, "text": "And so that's already there."}, {"time": 3857, "text": "And, um, and I've been interested in this problem for quite a while, actually, um, from a roboticist point of view."}, {"time": 3863, "text": "And that's what's happening in Alpha Pilot, which, which problem of aggressive flight of aggressive flight, fully autonomous, aggressive flight."}, {"time": 3870, "text": "Um, the problem that I'm interested, I mean, you asked about Alpha Pilot and I'll, I'll get there in a second, but the problem that I'm interested in, I'd love to build autonomous vehicles like, like drones that can go far faster than any human possibly can."}, {"time": 3885, "text": "I think we should recognize that we as humans have, you know, limitations in how fast we can process information."}, {"time": 3892, "text": "And those are some biological limitations."}, {"time": 3894, "text": "Like we think about this AI this way too."}, {"time": 3896, "text": "I mean, this has been discussed a lot and this is not sort of my idea per se, but a lot of people kind of think about human level AI and they think that, you know, AI is not human level."}, {"time": 3906, "text": "One day it'll be human level and humans and AI's, they kind of interact."}, {"time": 3909, "text": "Um, versus I think that the situation really is that humans are at a certain place and AI keeps improving and at some point it just crosses off and then, you know, it gets smarter and smarter and smarter."}, {"time": 3921, "text": "And so drone racing, the same issue."}, {"time": 3924, "text": "Just play this game and you know, you have to like react in milliseconds and there's really, you know, you see something with your eyes and then that information just flows through your brain, into your hands so that you can command it."}, {"time": 3937, "text": "And there's some also delays on, you know, getting information back and forth, but suppose those delays didn't exist."}, {"time": 3941, "text": "You just, just the delay between your eye and your fingers is a delay that a robot doesn't have to have."}, {"time": 3951, "text": "Um, so we end up building in my research group, like systems that, you know, see things at a kilohertz, like a human eye would barely hit a hundred Hertz."}, {"time": 3960, "text": "So imagine things that see stuff in slow motion, like 10 X slow motion."}, {"time": 3967, "text": "Um, it will be very useful."}, {"time": 3968, "text": "Like we talked a lot about autonomous cars."}, {"time": 3970, "text": "So, um, you know, we don't get to see it, but a hundred lives are lost every day, just in the United States on traffic accidents."}, {"time": 3979, "text": "And many of them are like known cases, you know, like the, uh, you're coming through like, uh, like a ramp going into a highway, you hit somebody and you're off, or, you know, like you kind of get confused."}, {"time": 3990, "text": "You try to like swerve into the next lane, you go off the road and you crash, whatever."}, {"time": 3995, "text": "And um, I think if you had enough compute in a car and a very fast camera right at the time of an accident, you could use all compute you have, like you could shut down the infotainment system and use that kind of computing resources instead of rendering, you use it for the kind of artificial intelligence that goes in there, the autonomy."}, {"time": 4016, "text": "And you can, you can either take control of the car and bring it to a full stop."}, {"time": 4020, "text": "But even, even if you can't do that, you can deliver what the human is trying to do."}, {"time": 4024, "text": "Human is trying to change the lane, but goes off the road, not being able to do that with motor skills and the eyes."}, {"time": 4030, "text": "And you know, you can get in there and I was, there's so many other things that you can enable with what I would call high throughput computing."}, {"time": 4037, "text": "You know, data is coming in extremely fast and in real time you have to process it."}, {"time": 4044, "text": "And the current CPUs, however fast you clock it are typically not enough."}, {"time": 4050, "text": "You need to build those computers from the ground up so that they can ingest all that data that I'm really interested in."}, {"time": 4056, "text": "Just on that point, just really quick is the currently what's the bottom, like you mentioned the delays in humans, is it the hardware?"}, {"time": 4065, "text": "So you work a lot with Nvidia hardware."}, {"time": 4067, "text": "Is it the hardware or is it the software?"}, {"time": 4072, "text": "In fact, they need to be co developed I think in the future."}, {"time": 4074, "text": "I mean, that's a little bit what Nvidia does sort of like they almost like build the hardware and then they build the neural networks and then they build the hardware back and the neural networks back and it goes back and forth, but it's that co design."}, {"time": 4086, "text": "And I think that, you know, like we try to way back, we try to build a fast drone that could use a camera image to like track what's moving in order to find where it is in the world."}, {"time": 4097, "text": "This typical sort of, you know, visual inertial state estimation problems that we would solve."}, {"time": 4102, "text": "And you know, we just kind of realized that we're at the limit sometimes of, you know, doing simple tasks."}, {"time": 4106, "text": "We're at the limit of the camera frame rate because you know, if you really want to track things, you want the camera image to be 90% kind of like, or some somewhat the same from one frame to the next."}, {"time": 4119, "text": "And why are we at the limit of the camera frame rate?"}, {"time": 4122, "text": "It's because camera captures data."}, {"time": 4124, "text": "It puts it into some serial connection."}, {"time": 4127, "text": "It could be USB or like there's something called camera serial interface that we use a lot."}, {"time": 4132, "text": "It puts into some serial connection and copper wires can only transmit so much data."}, {"time": 4138, "text": "And you hit the channel limit on copper wires and you know, you, you hit yet another kind of universal limit that you can transfer the data."}, {"time": 4146, "text": "So you have to be much more intelligent on how you capture those pixels."}, {"time": 4151, "text": "You can take compute and put it right next to the pixels."}, {"time": 4156, "text": "People are building those."}, {"time": 4157, "text": "How hard is it to do?"}, {"time": 4158, "text": "How hard is it to get past the bottleneck of the copper wire?"}, {"time": 4163, "text": "Yeah, you need to, you need to do a lot of parallel processing, as you can imagine."}, {"time": 4167, "text": "The same thing happens in the GPUs, you know, like the data is transferred in parallel somehow."}, {"time": 4171, "text": "It gets into some parallel processing."}, {"time": 4173, "text": "I think that, you know, like now we're really kind of diverted off into so many different dimensions, but."}, {"time": 4180, "text": "So it's aggressive flight."}, {"time": 4181, "text": "How do we make drones see many more frames a second in order to enable aggressive flight?"}, {"time": 4186, "text": "That's a super interesting problem."}, {"time": 4188, "text": "That's an interesting problem."}, {"time": 4189, "text": "So, but like, think about it."}, {"time": 4190, "text": "You have, you have CPUs."}, {"time": 4192, "text": "You clock them at, you know, several gigahertz."}, {"time": 4197, "text": "We don't clock them faster, largely because, you know, we run into some heating issues and things like that."}, {"time": 4201, "text": "But the whole thing is that three gigahertz clock light travels kind of like on the order of a few inches or an inch."}, {"time": 4209, "text": "That's the size of a chip."}, {"time": 4211, "text": "And so you pass a clock cycle and as the clock signal is going around in the chip, you pass another one."}, {"time": 4219, "text": "And so trying to coordinate that, the design of the complexity of the chip becomes so hard."}, {"time": 4223, "text": "I mean, we have hit the fundamental limits of the universe in so many things that we're designing."}, {"time": 4230, "text": "I don't know if people realize that."}, {"time": 4231, "text": "Like, we can't make transistors smaller because like quantum effects, the electrons start to tunnel around."}, {"time": 4236, "text": "We can't clock it faster."}, {"time": 4238, "text": "One of the reasons why is because like information doesn't travel faster in the universe and we're limited by that."}, {"time": 4246, "text": "Same thing with the laser scanner."}, {"time": 4248, "text": "But so then it becomes clear that, you know, the way you organize the chip into a CPU or even a GPU, you now need to look at how to redesign that."}, {"time": 4259, "text": "If you're going to stick with Silicon, you could go do other things too."}, {"time": 4262, "text": "I mean, there's that too, but you really almost need to take those transistors, put them in a different way so that the information travels on those transistors in a different way, in a much more way that is specific to the high speed cameras coming in."}, {"time": 4276, "text": "And so that's one of the things that we talk about quite a bit."}, {"time": 4280, "text": "So drone racing kind of really makes that embodies that and that's why it's exciting."}, {"time": 4287, "text": "It's exciting for people, you know, students like it."}, {"time": 4290, "text": "It embodies all those problems."}, {"time": 4292, "text": "But going back, we're building, quote, unquote, another engine."}, {"time": 4296, "text": "And that engine, I hope one day will be just like how impactful seat belts were in driving."}, {"time": 4305, "text": "Or it could enable, you know, next generation autonomous air taxis and things like that."}, {"time": 4309, "text": "I mean, it sounds crazy, but one day we may need to perch land these things."}, {"time": 4313, "text": "If you really want to go from Boston to New York in more than a half hours, you may want to fix wing aircraft."}, {"time": 4320, "text": "Most of these companies that are kind of doing quote unquote flying cars, they're focusing on that."}, {"time": 4324, "text": "But then how do you land it on top of a building?"}, {"time": 4326, "text": "You may need to pull off like kind of fast maneuvers for a robot, like perch land."}, {"time": 4330, "text": "It's going to go perch into a building."}, {"time": 4334, "text": "If you want to do that, like you need these kinds of systems."}, {"time": 4337, "text": "And so drone racing, you know, it's being able to go way faster than any human can comprehend."}, {"time": 4345, "text": "Take an aircraft, forget the quadcopter, you take your fixed wing, while you're at it, you might as well put some like rocket engines in the back and you just light it."}, {"time": 4354, "text": "You go through the gate and a human looks at it and just said, what just happened?"}, {"time": 4359, "text": "And they would say, it's impossible for me to do that."}, {"time": 4361, "text": "And that's closing the same technology gap that would, you know, one day steer cars out of accidents."}, {"time": 4401, "text": "So that let me ask about the the the Alpha pilot challenge is a, I guess, a big prize potentially associated with it."}, {"time": 4409, "text": "But let me ask, reminiscent of the DARPA days, predictions, you think anybody will finish?"}, {"time": 4416, "text": "Well, not, not soon."}, {"time": 4419, "text": "I think that depends on how you set up the race course."}, {"time": 4422, "text": "And so if the race course is a solo course, I think people will kind of do it."}, {"time": 4426, "text": "But can you set up some course, like literally some core, you get to design it is the algorithm developer, can you set up some course, so that you can be the best human?"}, {"time": 4438, "text": "When is that going to happen?"}, {"time": 4440, "text": "Like that's not very easy, even just setting up some course, if you let the human that you're competing with set up the course, it becomes a lot easier, a lot harder."}, {"time": 4450, "text": "So how many in the space of all possible courses are, would humans win and would machines win?"}, {"time": 4459, "text": "Let's get to that."}, {"time": 4460, "text": "I want to answer your other question, which is like, the DARPA challenge days, right?"}, {"time": 4464, "text": "What was really hard?"}, {"time": 4465, "text": "I think, I think we understand, we understood what we wanted to build, but still building things, that experimentation, that iterated learning, that takes up a lot of time actually."}, {"time": 4476, "text": "And so in my group, for example, in order for us to be able to develop fast, we build like VR environments, we'll take an aircraft, we'll put it in a motion capture room, big, huge motion capture room, and we'll fly it in real time, we'll render other images and beam it back to the drone."}, {"time": 4494, "text": "That sounds kind of notionally simple, but it's actually hard because now you're trying to fit all that data through the air into the drone."}, {"time": 4502, "text": "And so you need to do a few crazy things to make that happen."}, {"time": 4505, "text": "But once you do that, then at least you can try things."}, {"time": 4509, "text": "If you crash into something, you didn't actually crash."}, {"time": 4512, "text": "So it's like the whole drone is in VR."}, {"time": 4514, "text": "We can do augmented reality and so on."}, {"time": 4517, "text": "And so I think at some point testing becomes very important."}, {"time": 4520, "text": "One of the nice things about Alpha Pilot is that they built the drone and they build a lot of drones and it's okay to crash."}, {"time": 4528, "text": "In fact, I think maybe the viewers may kind of like to see things that crash."}, {"time": 4534, "text": "That potentially could be the most exciting part."}, {"time": 4536, "text": "It could be the exciting part."}, {"time": 4538, "text": "And I think as an engineer, it's a very different situation to be in."}, {"time": 4542, "text": "Like in academia, a lot of my colleagues who are actually in this race and they're really great researchers, but I've seen them trying to do similar things whereby they built this one drone and somebody with like a face mask and a gloves are going right behind the drone."}, {"time": 4558, "text": "They're trying to hold it."}, {"time": 4559, "text": "If it falls down, imagine you don't have to do that."}, {"time": 4562, "text": "I think that's one of the nice things about Alpha Pilot Challenge where we have these drones and we're going to design the courses in a way that we'll keep pushing people up until the crashes start to happen."}, {"time": 4574, "text": "And we'll hopefully sort of, I don't think you want to tell people crashing is okay."}, {"time": 4579, "text": "Like we want to be careful here, but because we don't want people to crash a lot, but certainly we want them to push it so that everybody crashes once or twice and they're really pushing it to their limits."}, {"time": 4592, "text": "That's where iterated learning comes in, because every crash is a lesson."}, {"time": 4596, "text": "Is a lesson."}, {"time": 4598, "text": "So in terms of the space of possible courses, how do you think about it in the war of humans versus machines, where do machines win?"}, {"time": 4607, "text": "We look at that quite a bit."}, {"time": 4608, "text": "I mean, I think that you will see quickly that you can design a course and in certain courses like in the middle somewhere, if you kind of run through the course once, the machine gets beaten pretty much consistently by slightly."}, {"time": 4627, "text": "But if you go through the course like 10 times, humans get beaten very slightly, but consistently."}, {"time": 4633, "text": "So humans at some point, you get confused, you get tired and things like that versus this machine is just executing the same line of code tirelessly, just going back to the beginning and doing the same thing exactly."}, {"time": 4646, "text": "I think that kind of thing happens and I realized sort of as humans, there's the classical things that everybody has realized."}, {"time": 4656, "text": "Like if you put in some sort of like strategic thinking, that's a little bit harder for machines that I think sort of comprehend."}, {"time": 4665, "text": "Machine is easy to do, so that's what they excel in."}]}]