[{"title": "Jocko Willink: War, Leadership, and Discipline | Lex Fridman Podcast #197", "id": "n2RcVEftY48", "quotes": [{"time": 360, "text": "And maybe I'm romanticizing war here, but it feels like that's inextricably connected to World War II for Russians."}, {"time": 367, "text": "Does that resonate at all?"}, {"time": 374, "text": "So if you look at military training, what they do is they take people in the military from the civilian world."}, {"time": 382, "text": "They bring them into the military and they put them through bootcamp, which is the stereotypical thing that you see on TV."}, {"time": 388, "text": "You're going to get yelled at."}, {"time": 391, "text": "You're going to get screamed at."}, {"time": 391, "text": "You're going to get, you're going to get put in the mud and you're going to be made to do hard things together."}, {"time": 395, "text": "And what does that do with those civilians?"}, {"time": 402, "text": "Well, it gives them a common background."}, {"time": 402, "text": "It gives them a common suffering that they've been through together and they form some sort of connection, some sort of bond."}, {"time": 414, "text": "Now to make that bond a little bit stronger, after you get done with bootcamp, they send you to advanced infantry school and you suffer some more together."}, {"time": 420, "text": "And when you suffer more together, now you're in a smaller group too, because now it's infantry."}, {"time": 428, "text": "It's not supply people anymore or logisticians."}, {"time": 432, "text": "It's strictly people that are going to fight."}, {"time": 432, "text": "They're infantrymen."}, {"time": 438, "text": "So they go through a school together and now they get a little bit tighter, get done with that."}, {"time": 438, "text": "And maybe you go to an airborne division."}, {"time": 444, "text": "So you go to airborne school and now you all overcome this fear of jumping out of an airplane together and you celebrate surviving that."}, {"time": 453, "text": "Then maybe you get done with that."}, {"time": 453, "text": "And now you go at an airborne division."}, {"time": 453, "text": "Now you're an even tighter group because you've suffered together."}, {"time": 456, "text": "What comes next is special forces training or ranger training."}, {"time": 462, "text": "And what they do is they put you in these situations where you're going to suffer together and you're going to build these bonds because as I said earlier, you have to rely on each other to survive."}, {"time": 472, "text": "And by the way, not everyone does, not everyone makes it through this training."}, {"time": 472, "text": "So you sort of have these memories of people that didn't make it."}, {"time": 475, "text": "You share that connection as well."}, {"time": 479, "text": "And you can keep going down this road until you go into combat with a military unit and military units that go through combat, have an even tighter bond."}, {"time": 484, "text": "And the harder the combat that they go through, the tighter the bond is going to be."}, {"time": 489, "text": "So I think when you talk about what the Soviet Union went through in World War II, there was a shared suffering to survive."}, {"time": 495, "text": "And so the entire nation has that common thread."}, {"time": 505, "text": "And that's probably the thing that you sense or feel when you refer back to the bond that resonates all the way back to World War II."}, {"time": 520, "text": "So in your podcast and your writing, you talk about some of the most fascinating things I listen to you talk about in terms of military conflict is tactics and sort of the details of combat."}, {"time": 538, "text": "But allow me to stick on World War II for a second."}, {"time": 538, "text": "There's a particular aspect to that war, I don't know if you can speak to it, where twice the number of civilians died than military personnel."}, {"time": 551, "text": "So the Soviet Union, especially."}, {"time": 551, "text": "My grandfather was a machine gunner in Ukraine as the Germans were marching towards Moscow."}, {"time": 566, "text": "There's this important push in 1941 where they were trying to get before the winter to Moscow."}, {"time": 572, "text": "And what Stalin was doing, he was trying to get to Moscow."}, {"time": 572, "text": "He was trying to get to Moscow."}, {"time": 578, "text": "And what Stalin was doing is he was basically throwing bodies to slow the attack."}, {"time": 589, "text": "And what that meant is everybody understood that your job was, you have this heavy machine guns, it's very, it's almost unreasonable to be able to be mobile in any kind of way with them."}, {"time": 601, "text": "So you're thrown at the front and you're just nonstop shooting and 95 plus percent of people are just dead."}, {"time": 609, "text": "All the soldiers are just dead."}, {"time": 609, "text": "And then you just go back and back and you're trying to protect as many civilians as you can throughout this whole process, but you don't."}, {"time": 615, "text": "And so you have millions of civilians that die along the way into this march."}, {"time": 620, "text": "Is there something you could say about this complete, perhaps it's naive of me to say, but a war that lacks tactics, that lacks strategy and is purely about just no consideration of human life and just throwing bodies and bullets into a mix together where millions die."}, {"time": 650, "text": "And that in particular felt much less like conflict and much more like torture or suffering."}, {"time": 661, "text": "It didn't come off as torture only that interestingly enough, as you probably know, my grandfather, including everybody else, volunteered."}, {"time": 672, "text": "They were proud to do this."}, {"time": 680, "text": "They were proud to march to their death for country, for love of country."}, {"time": 687, "text": "But the question on the civilian side, when more civilians die, the military personnel, what do you make of that?"}, {"time": 693, "text": "It's awful when a soldier dies."}, {"time": 693, "text": "It's awful when a civilian dies."}, {"time": 702, "text": "It's awful when 10 civilians or 10 soldiers."}, {"time": 702, "text": "And it's even more awful when millions and millions of soldiers and civilians die."}, {"time": 709, "text": "I think it's safe to say that the Soviet Union was facing an existential threat to their existence against the Nazis."}, {"time": 717, "text": "So to not fight would be to die as well, maybe die a death a few years later, maybe die a different way."}, {"time": 729, "text": "But the choice was die now, trying or die later on your knees."}, {"time": 733, "text": "And I think the choice was pretty clear."}, {"time": 743, "text": "As far as the tactics go, I mean, there is this is attrition warfare."}, {"time": 743, "text": "That's what that is."}, {"time": 743, "text": "We are going to keep, you know, you said throwing bodies at the problem."}, {"time": 750, "text": "That's attrition warfare."}, {"time": 750, "text": "And the Soviet Union had a lot of bodies, more than the Germans."}, {"time": 756, "text": "And when you fight with attrition warfare, whoever has more men and material will eventually win."}, {"time": 763, "text": "It's an awful, it's an awful way."}, {"time": 763, "text": "But that's the that's that's what the strategy was."}, {"time": 771, "text": "You often talk about leadership."}, {"time": 777, "text": "Let's put the evils of Hitler aside."}, {"time": 777, "text": "The boldness of Hitler in making some of the strategic decisions he did was considered by many military historians quite brilliant, early in the war, or insane and brilliant."}, {"time": 793, "text": "Stalin, on the other hand, I think university is seen as somebody who is terrible military strategist, especially early in the war."}, {"time": 801, "text": "He did not see all the possible trajectories that the war could take."}, {"time": 840, "text": "You know, I think one of the things with Hitler was in the beginning of the war, he listened to his friends, his family, and he listened to his friends."}, {"time": 843, "text": "He listened to his generals."}, {"time": 849, "text": "And therefore, they did pretty well with that."}, {"time": 849, "text": "I think as the war went on, he believed that he was smarter than he was, and made decisions that were bad, that cost him dearly."}, {"time": 866, "text": "You know, I mean, case in point, as everyone knows, going and attacking the Soviet Union, while you're still fighting a war on the other front is not not a good move."}, {"time": 874, "text": "There's an example of yeah, bad leadership, letting your ego get in the way believing that you can do things that you that are beyond your capabilities."}, {"time": 878, "text": "But, you know, as you mentioned in the beginning with Blitzkrieg, those were really dynamic and bold moves."}, {"time": 885, "text": "And they worked."}, {"time": 885, "text": "And that what does that do?"}, {"time": 893, "text": "That fuels your ego and makes you think that you can win."}, {"time": 897, "text": "Many people consider that war a just war."}, {"time": 897, "text": "What do you think makes a just war?"}, {"time": 905, "text": "I think you have the Nazis, and the Imperial Japanese trying to impose their will on other nations and other peoples."}, {"time": 912, "text": "And when that happens, I think on a grand scale, people look at that."}, {"time": 912, "text": "And believe it's just to step in and do something about it."}, {"time": 925, "text": "Is there some gray area here?"}, {"time": 928, "text": "There's, there's nothing but gray area."}, {"time": 932, "text": "The United States has been involved in a lot of military conflict since then."}, {"time": 936, "text": "How do you draw the line to the gray area?"}, {"time": 936, "text": "What, what war should we engage in and not?"}, {"time": 944, "text": "I know you don't get a lot of questions about that, but I think it's important that you I know you don't get into politics much."}, {"time": 948, "text": "But what the decision to go to war, you have to look at the situation that you're going into."}, {"time": 955, "text": "And you have to make sure that you have the will to go to war."}, {"time": 960, "text": "And the will to go to war means that you are willing to kill people."}, {"time": 969, "text": "And when I say people, I don't just mean enemy, because in war, civilians are going to die, women and children are going to die."}, {"time": 972, "text": "Every a lot of people are going to die."}, {"time": 977, "text": "And so you and you are going to kill them."}, {"time": 977, "text": "Doesn't matter what kind of smart munitions you have."}, {"time": 981, "text": "Doesn't matter how disciplined your soldiers are."}, {"time": 981, "text": "When you go into a war, civilians are going to die and you have to understand that."}, {"time": 986, "text": "And the other thing that you have to understand is that your troops are also going to die."}, {"time": 992, "text": "And it seems like sometimes we're a little bit naive about the calculation of what that's going to look like."}, {"time": 1005, "text": "And maybe we think, well, not that many civilians and maybe not that many of our our personnel are going to die."}, {"time": 1010, "text": "And that's where you get into sticky situations."}, {"time": 1010, "text": "And, you know, another thing when you were talking about the Soviet Union versus the Nazis, that's total war."}, {"time": 1016, "text": "And we don't engage in that very often."}, {"time": 1024, "text": "It's total war."}, {"time": 1024, "text": "It's we will do absolutely anything to win."}, {"time": 1030, "text": "And America doesn't fight like that very often."}, {"time": 1030, "text": "In fact, the last time we fought like that was World War Two."}, {"time": 1035, "text": "We it was total war."}, {"time": 1035, "text": "We will do whatever it takes to up to and including the atomic bomb to destroy the enemy."}, {"time": 1042, "text": "So those are the kind of things you need to think about before you go to war."}, {"time": 1049, "text": "And I don't think we think about that very often."}, {"time": 1053, "text": "I don't think we think about that very often."}, {"time": 1053, "text": "You know, even the United States, the atomic bomb, nuclear weapons is an interesting one because there's a lot of there's a lot of hesitation on that."}, {"time": 1066, "text": "There's a lot of critics of that decision as it was happening."}, {"time": 1072, "text": "So even America, you could imagine other countries like Germany would not be so hesitant to use nuclear weapons."}, {"time": 1077, "text": "It's interesting to think about in deciding military strategy to inject ethics into it, into morality."}, {"time": 1088, "text": "It's not just about winning the war, but should we do this and doing the calculation of human life."}, {"time": 1097, "text": "Usually those decisions are made by leaders, not by the soldier that's going to be implementing that decision."}, {"time": 1110, "text": "Do you put some responsibility, I should even say blame on the leaders and not doing that kind of calculation here?"}, {"time": 1118, "text": "You could say that about the Vietnam War, you could say that about even the war that you were involved with in Iraq."}, {"time": 1127, "text": "Is there some criticism here that you could apply to leaders for failing not to consider that the broader moral questions?"}, {"time": 1140, "text": "Natural, like all leaders will make these mistakes or should leaders not make these mistakes?"}, {"time": 1149, "text": "Leaders are going to make mistakes."}, {"time": 1149, "text": "It's impossible to know what's going to happen in war, just like it's impossible to know what's going to happen in life."}, {"time": 1155, "text": "You make decisions based on the information that you have at the time and you will make mistakes."}, {"time": 1163, "text": "If you fail to admit that you made a mistake, that's where I have a more significant problem than someone that makes a mistake and says, hey, this is the mistake that I made."}, {"time": 1170, "text": "This is the intelligence that I thought we were utilizing and it actually is not what I thought it was going to be."}, {"time": 1182, "text": "And here's the new direction that we're going in."}, {"time": 1182, "text": "We don't have enough of that type of ownership in leadership globally."}, {"time": 1192, "text": "Just saying I made a mistake that resulted in a loss at scale of human life, being able to say that."}, {"time": 1205, "text": "Being able to say that."}, {"time": 1205, "text": "And when you don't say that, you end up with a more loss of human life."}, {"time": 1213, "text": "Can I ask you about the loss of human life?"}, {"time": 1213, "text": "How does killing a human being change you?"}, {"time": 1223, "text": "What does it mean to kill a human being?"}, {"time": 1223, "text": "What does it feel like to kill a human being?"}, {"time": 1227, "text": "Well, I mean, I guess you'd have to look at what circumstances a person's in when this is taking place."}, {"time": 1232, "text": "If you've got someone that's in a, a fit of rage that goes and kills somebody, you know, they're going to come out of it and think, wow, I've just really messed up."}, {"time": 1244, "text": "If you've got a, someone that is a sociopath, right?"}, {"time": 1244, "text": "They're not going to feel anything."}, {"time": 1253, "text": "And that person deserved to die."}, {"time": 1253, "text": "And that's why they died."}, {"time": 1253, "text": "If you've got a soldier who feels like they're trying to protect their friends, they'll move through that."}, {"time": 1260, "text": "If you've got a soldier that's doing it because they want some kind of personal glory, they'll probably not feel good about it later."}, {"time": 1275, "text": "So I think it depends on the situation."}, {"time": 1275, "text": "I think it depends on the psychology of the individual that's going through it."}, {"time": 1280, "text": "He said, move through that."}, {"time": 1288, "text": "Is there some calculation here that a soldier, when they kill another soldier, a realization that is just another human being, I mean, is there some heavy burden to that aspect that it's ultimately just human on human?"}, {"time": 1311, "text": "I think it depends a lot on the scenario."}, {"time": 1311, "text": "I know that when I was in Iraq fighting, we, we talk a lot about the dehumanization of the enemy and it's something that the governments will do."}, {"time": 1322, "text": "I mean, governments will do that to each other."}, {"time": 1322, "text": "I mean, the Japanese dehumanized the Americans and the Americans dehumanized the Japanese and the Americans dehumanized the Nazis and the Nazis dehumanized the Americans so that to remove as much of that human on human killing aspect that you're talking about."}, {"time": 1342, "text": "And what I would say is that the Japanese human killing aspect that you're talking about."}, {"time": 1347, "text": "And what I, what I've said is that in, when we were in Iraq, we didn't have to dehumanize the enemy because the, the enemy dehumanized themselves through their actions, through their behaviors."}, {"time": 1365, "text": "When, when we know that they are torturing and raping and murdering the local populace, they've been dehumanized."}, {"time": 1372, "text": "And so as far as looking at them and thinking, oh, this is a, you know, a human, another human that's, that's on the level of, you know, my, my uncle or my brother, I didn't, I didn't think of them out that way."}, {"time": 1387, "text": "I thought of them as, as murdering, raping, evil, subhumans."}, {"time": 1401, "text": "Rock is different and America's position is different."}, {"time": 1401, "text": "That America has not been involved in a war where it's quite like two humans fighting, like teenage boys fighting against each other."}, {"time": 1413, "text": "And you've got to remember that America has not been involved in a war where it's quite like two humans fighting, like teenage boys fighting against each other."}, {"time": 1422, "text": "And you've got to remember, I mean, we're, we're seeing these Iraqi kids that are living under this sadistic, sadistic terror, the Iraqi women that are being raped and so on the one side we become the, the Iraqi populace is very humanized to us because we're talking to them."}, {"time": 1446, "text": "We've got interpreters, we understand we're seeing them day after day, the same individuals."}, {"time": 1451, "text": "And so we form a bond with the local populace and yet we see what the insurgents are doing."}, {"time": 1459, "text": "And so it's again, not difficult to dehumanize people that behave in that manner."}, {"time": 1466, "text": "I suppose I'm, I worry about the dehumanization at a much larger scale when it's not the kind of case that you're talking about."}, {"time": 1474, "text": "Even now, hopefully I'm not fear mongering, but there's a sense in which there's the drums of war slowly starting to build with China."}, {"time": 1490, "text": "There, in the best case, it would be a cold war of, there's a dehumanization aspect that's happening with China currently, which is they're the other and they're after stealing all of your data."}, {"time": 1507, "text": "There's a cybersecurity, it starts with cybersecurity and it worries me because it creates the other out of a very large population that may ultimately lead to conflict."}, {"time": 1525, "text": "In the worst case, hot conflict that would no longer be the situation you are in in Iraq and more similar to the Soviet Union conflict with Germany that it's kids and then they're dehumanized to where you're at scale slaughtering them or at least hurting their quality of life in a way that's maybe, you know, suffering has many forms."}, {"time": 1550, "text": "It doesn't have to be through just a hot war."}, {"time": 1555, "text": "It could be through starvation, through camps, all those kinds of things."}, {"time": 1562, "text": "And I worry about that."}, {"time": 1562, "text": "We kind of tend to think that these wars are behind us and I'm not always so sure that's the case."}, {"time": 1567, "text": "And at least in the way that, it ultimately starts with hate and it, again, hopefully I'm not being too dramatic, but I see that there's a kind of brewing of, it starts with dehumanization that turns to hate of the other."}, {"time": 1582, "text": "You see that with China, you see it a little bit with Russia and you have an early podcast with between the where you break down the tactics of the Chechen war versus Russia."}, {"time": 1596, "text": "But that's the kind of conflicts I'm referring to."}, {"time": 1602, "text": "There's a, I know you're a bit of a musician."}, {"time": 1610, "text": "I love, I love Dire Straits song called Brothers in Arms."}, {"time": 1610, "text": "I don't know if you know that one."}, {"time": 1616, "text": "And there's a line in it."}, {"time": 1616, "text": "I think they play it quite often at military funerals, which I just recently learned, but it's this powerful song that has a line, we're fools to make war on our brothers in arms."}, {"time": 1629, "text": "Do you think there's some sense in which at the leadership level, but just as human beings, we're perhaps foolish and engaging in military conflict as much as we have, or as fool, a very inappropriate word here."}, {"time": 1653, "text": "Well, I think that using the term brothers in arms means the people that are on my side, right?"}, {"time": 1658, "text": "So it doesn't make sense to start wars with people that are on your side."}, {"time": 1658, "text": "So that's, that might just be the way the lyrics are written so that it fit the song or whatever."}, {"time": 1670, "text": "I think broadly what you're asking me is, is war foolish?"}, {"time": 1670, "text": "And I would say the answer is yes."}, {"time": 1677, "text": "And if you can avoid it, you absolutely should."}, {"time": 1677, "text": "But if there is a bear or a wolf that is trying to get into your house, is it foolish to shoot that bear or shoot that wolf?"}, {"time": 1688, "text": "I think that's the answer."}, {"time": 1695, "text": "Is it foolish to shoot that bear or shoot that wolf?"}, {"time": 1695, "text": "I think the answer is pretty obvious."}, {"time": 1702, "text": "So when you're threatened or your family are threatened or your way of life is threatened, then you have to do something to try and defend your family, your way of life."}, {"time": 1709, "text": "It should be the last resort."}, {"time": 1716, "text": "You had a conversation with Jordan Peterson where he asked you a question in terms of war being the last resort, whether you would like your kids to grow up in peace in a time of no war."}, {"time": 1735, "text": "You said yes, but, and so happens Jordan didn't let you finish."}, {"time": 1735, "text": "Can you, can you elaborate what follows the but?"}, {"time": 1746, "text": "Well, you, you and I have been talking about the fact that struggle brings people together and, and brings out the best and, and the worst, brings out the worst in people."}, {"time": 1758, "text": "War brings out the worst in people."}, {"time": 1758, "text": "It also brings out the best in people."}, {"time": 1762, "text": "So would you want your kid to go and enter in a wrestling tournament where you paid all the other kids off and your kid won?"}, {"time": 1772, "text": "Or you enter them in a jujitsu tournament where they're a purple belt and you know that everyone that they're going to fight against is a white belt."}, {"time": 1787, "text": "And so they get the, they get the big W, they get the win, but they don't really get tested and they don't really struggle."}, {"time": 1793, "text": "And if you don't struggle, you don't grow."}, {"time": 1793, "text": "So that's the, but right."}, {"time": 1800, "text": "Um, the, the absolute best times of my life were in combat and the worst times of my life were in combat."}, {"time": 1813, "text": "And so even though I wouldn't want any of my children to suffer through the worst of times at the same time, the but is I would want them to have the opportunity to feel that bond that you're referring to earlier and to see human beings that are willing to sacrifice their lives for their friends."}, {"time": 1835, "text": "You mentioned the worst."}, {"time": 1835, "text": "What are some of the worst aspects of when you were in Iraq?"}, {"time": 1842, "text": "Well, what are the things that, um, the hardest on you having my guys killed?"}, {"time": 1856, "text": "Is there, uh, absurd cruelty to it?"}, {"time": 1856, "text": "Was it due to mistakes or natural consequences of, of fighting?"}, {"time": 1867, "text": "Is there any difference?"}, {"time": 1867, "text": "Is that at the end is just losing?"}, {"time": 1867, "text": "Those are brothers in arms."}, {"time": 1873, "text": "There's a million different ways to get killed in the war and you can go out on an operation and you can do everything wrong and you can survive and you can go out in an operation and do everything perfect and you can get killed."}, {"time": 1883, "text": "Is there some aspect which makes it worse when there is mistakes made?"}, {"time": 1890, "text": "Well, yeah, if there's mistakes made, then you're going to sit there and beat yourself up eternally for mistakes that were made."}, {"time": 1896, "text": "But to you, the things that hurt is just losing, losing people close to you."}, {"time": 1912, "text": "Does it make sense to you that this thing ends?"}, {"time": 1920, "text": "Like do you, uh, the Stoics contemplated death."}, {"time": 1920, "text": "It gives flavor to life."}, {"time": 1929, "text": "It makes you appreciate, there's something about finiteness of life that makes it, that makes it this, uh, Jocko Discipline Go drink, sour apple that I'm enjoying is delicious."}, {"time": 1934, "text": "Makes it taste better because I'm going to die one day."}, {"time": 1943, "text": "And I think about that a lot."}, {"time": 1952, "text": "Other than I know that it's going to end."}, {"time": 1952, "text": "I mean, but I don't think about it on a daily basis."}, {"time": 1952, "text": "I think about the fact I think about, I know that I'm lucky to be here."}, {"time": 1959, "text": "I know that many people sacrificed to give me this opportunity to be here."}, {"time": 1965, "text": "So, but I don't dwell on it."}, {"time": 1976, "text": "What about when you were in combat?"}, {"time": 1976, "text": "There's, there's tactics, there's strategy, there's the mission."}, {"time": 1981, "text": "And then your mortality is not part of the calculation."}, {"time": 1990, "text": "I think you get to a point where you accept the fact that you can die."}, {"time": 1990, "text": "Like I, I, you know, like I said, you can do everything right."}, {"time": 1996, "text": "You roll out the gate, you hit an ID, a triple stack subsurface ID and you're dead."}, {"time": 2000, "text": "And there's nothing that's going to stop that."}, {"time": 2000, "text": "It's going to happen."}, {"time": 2005, "text": "And I think if you're scared of that or you're thinking about that, it's going to inhibit your ability to do your job properly."}, {"time": 2010, "text": "And I think it's also going to drive you crazy."}, {"time": 2016, "text": "The thing that I thought about more was that happening to my guys."}, {"time": 2016, "text": "And that's the gut wrenching terror that you feel when, when operations happen."}, {"time": 2022, "text": "Can I ask you about love of country?"}, {"time": 2022, "text": "It's, it continues to just how much I've studied Stalin recently in the past few years."}, {"time": 2032, "text": "It continues to surprise me, not surprise me."}, {"time": 2041, "text": "It's just tragic in some kind of way."}, {"time": 2041, "text": "I'm not sure exactly if I could put words to it, but how many people and still do, but at the time were willing, loved Stalin and were willing to die for country for the love of country."}, {"time": 2056, "text": "And I too, maybe because I was born there and now I am a red blooded American."}, {"time": 2065, "text": "I love nationalism is a bad word, but I love the love of country."}, {"time": 2076, "text": "It gives, it somehow gives a meaning like a brotherhood, like we're in this together."}, {"time": 2083, "text": "I love that's why I love the Olympics."}, {"time": 2083, "text": "That's just the, the unity of it."}, {"time": 2083, "text": "It takes a step out of the selfish pursuits of any one particular ant and looks at us as a big ant colony and it's inspiring."}, {"time": 2104, "text": "It's it's exciting, but at the same time, it seems to get us to do horrible things."}, {"time": 2111, "text": "If, if manipulated by charismatic leaders, what do you make of this love of country?"}, {"time": 2111, "text": "Is it a, is it a bad thing?"}, {"time": 2120, "text": "Is it a thing that gets in the way or is it a good thing?"}, {"time": 2126, "text": "Well, I think like anything else, if it's balanced correctly, it's great."}, {"time": 2130, "text": "And if it goes to some extreme level, then it becomes a negative."}, {"time": 2135, "text": "And I think it, I think it's probably sourced in some sort of animalistic tribalism that we all have to be part of a tribe."}, {"time": 2143, "text": "And this is a real big tribe that you get to be a part of."}, {"time": 2143, "text": "And all you have to do is kind of show up."}, {"time": 2149, "text": "And so when someone says, Hey, we're going to play hockey against the Russians, well, we're going to cheer for the American boys."}, {"time": 2160, "text": "So my, my area of work is artificial intelligence."}, {"time": 2160, "text": "It'd be interesting to ask your thoughts about something, which is autonomous weapon systems."}, {"time": 2168, "text": "US has now officially released the report saying that they're open to, not open, they're engaging in, in adding more and more autonomy and artificial intelligence into its weapon systems because China is doing it."}, {"time": 2185, "text": "So there's, these are the first steps in something that AI folks worry about, which is a race, an AI race in the space of autonomous weapons that can run away too quickly."}, {"time": 2233, "text": "And then just loading that in and letting the AI system automatically decide that."}, {"time": 2240, "text": "What are your general thoughts about it?"}, {"time": 2240, "text": "Do you, do you worry about it?"}, {"time": 2247, "text": "Because there's the positive effects that in the best version of that world, you kill fewer civilians, you kill, hurt fewer of your own human beings."}, {"time": 2254, "text": "But at the negative side of that, you might lose the thing we kind of talked about, which is the basic humanity, even in the individual soldier of what is right and what is wrong and not making huge mistakes that hurt thousands or millions of people."}, {"time": 2278, "text": "I guess what you're asking me is if they could make a machine that could do more surgical attacks on enemy individuals, would I be for it?"}, {"time": 2284, "text": "Yes, I would be for it."}, {"time": 2294, "text": "The problem is if you've ever used machines of any kind, their initial design may not be, there's unintended consequences."}, {"time": 2303, "text": "There's ways in the machine actually behaves that you realize there's bugs in this thing."}, {"time": 2312, "text": "So do we not put protocols in place to prevent something from going too far outside the boundaries of what we wanted to execute?"}, {"time": 2318, "text": "But the question is, this is the first time in human history you can create things, machines, toaster, microwave oven, that's smarter than you in this particular task."}, {"time": 2333, "text": "I mean, it's not yet there."}, {"time": 2333, "text": "What you're learning a lot with military strategies, humans are actually really damn smart."}, {"time": 2340, "text": "It's very hard to improve on a human."}, {"time": 2346, "text": "And so most actual drones that are unmanned are still piloted by humans."}, {"time": 2346, "text": "It's very difficult to do every aspect of war."}, {"time": 2353, "text": "But it's not out of the realm of possibility that machines will start doing those things better in certain things, certain more precise targeting of the enemy."}, {"time": 2375, "text": "The question is, so what happens when you start to rely on the machine to do some of the task is you get lazy."}, {"time": 2382, "text": "You forget what it is like to do that task or more importantly, you lose the knowledge of the intricacies of that task and you forget the ways it can go wrong."}, {"time": 2391, "text": "So the protocols may not be sufficient to constrain the power of the ways that things go wrong, especially when things are moving really quickly, especially when the ethics of the two sides aren't perfectly aligned."}, {"time": 2412, "text": "When people are some certain sides, like on the Chinese side, may be more willing to take risks for dangerous consequences than others."}, {"time": 2419, "text": "So what happened on the bioweapon side is internationally, maybe you can speak to this more, but my sense, what I was told, there is a sense globally that bioweapons are not going to be used."}, {"time": 2432, "text": "They're unethical."}, {"time": 2432, "text": "There's a sense like we're not going to engage in this."}, {"time": 2440, "text": "And with AI currently, China and US said, green light, all go ahead."}, {"time": 2449, "text": "It's totally ethical."}, {"time": 2449, "text": "If it can decrease the loss of human life, why not?"}, {"time": 2459, "text": "And my worry is that it's much easier to design weapons that are effective than design weapons who have the depth of ethics and morals that humans do, which I think we don't as human beings don't acknowledge enough that even like the cold calculated killing of others, like precise, effective execution of a mission still has ethics in it."}, {"time": 2486, "text": "At every level, you know what's right and what's wrong."}, {"time": 2495, "text": "And I don't know if you take that away, you're not going to make huge mistakes that you regret."}, {"time": 2500, "text": "Is that something you don't worry about?"}, {"time": 2508, "text": "I don't really worry about it."}, {"time": 2508, "text": "But as you design something, like I said, you put protocols in place and from what I am hearing you say, or trying to hear you say, there's be a point where our protocols wouldn't be sufficient to stop the machine from doing something that was unethical."}, {"time": 2530, "text": "I'm kind of worried that this is something you don't worry about."}, {"time": 2530, "text": "Because a lot of people I respect don't worry about it."}, {"time": 2540, "text": "And I don't know what to do about that."}, {"time": 2540, "text": "A lot of generals don't worry about it."}, {"time": 2545, "text": "A lot of people who know much more about war, like you than me, don't worry about it."}, {"time": 2552, "text": "And that worries me."}, {"time": 2554, "text": "Well, that's because you have a vision into the shortfalls of AI."}, {"time": 2554, "text": "And I don't."}, {"time": 2554, "text": "I don't have a vision of the shortfalls of AI."}, {"time": 2562, "text": "I don't know enough about it."}, {"time": 2562, "text": "As far as I'm concerned, you put a on off switch somewhere, you put a kill switch on a system."}, {"time": 2567, "text": "And if it starts going awry, you hit the kill switch, and that's it."}, {"time": 2575, "text": "So if you know, when you look at me and say, well, there's no possible way to put a kill switch, that would be 100% effective."}, {"time": 2580, "text": "And here's, you draw those concerns to me."}, {"time": 2585, "text": "And we could talk through it and say, okay, well, here's where we should draw the line."}, {"time": 2591, "text": "I mean, it's like, again, for the Soviet Union, Chernobyl meltdown, there was always the ability, I believe, to have a kill switch."}, {"time": 2598, "text": "The problem is, the more power you give to the machine, the more opportunity you give to the human supervising that machine to make a mistake and not shut off the switch at the right time."}, {"time": 2614, "text": "So yes, the solution, I mean, you're putting the responsibility still in the human hands."}, {"time": 2621, "text": "And I think that's the correct place to put it."}, {"time": 2621, "text": "There should be good protocols, good leadership, good execution, competency all around."}, {"time": 2624, "text": "Your protocols should consider the basic failures of human nature, the human factor of how things go wrong."}, {"time": 2635, "text": "So there should be multiple people supervising the system, all those things."}, {"time": 2635, "text": "But I am just very skeptical of greater and greater power in the machine that can create war, that cannot lead to death."}, {"time": 2647, "text": "And that's why, like I said, and like you just said, you have protocols in place that are a kill switch."}, {"time": 2654, "text": "And if you think about the amount of nuclear weapons that we've had on planet Earth for the past however many years, and there's been no rogue element that said, you know what, I'm going to shoot this thing."}, {"time": 2669, "text": "There's been no protocol that took place where all of a sudden we said, oh no."}, {"time": 2673, "text": "I mean, there's been escalations, but the protocols worked, have worked so far."}, {"time": 2680, "text": "Now, that's a scary thing to think about, that we rely on these protocols to stop some rogue element out there from launching a missile that could kill millions of people and trigger a global war."}, {"time": 2694, "text": "So yeah, the protocols should be strict."}, {"time": 2694, "text": "Can I ask a Jack O Wonka ridiculous question?"}, {"time": 2704, "text": "If human civilization goes extinct, what would be the reason?"}, {"time": 2704, "text": "You mentioned nuclear war."}, {"time": 2711, "text": "Do you worry about this?"}, {"time": 2711, "text": "The reason I bring that up, a lot of people in the AI community worry about artificial general intelligence."}, {"time": 2717, "text": "So super intelligent AI systems creating a lot of damage."}, {"time": 2723, "text": "Autonomous weapon systems is one possibility."}, {"time": 2723, "text": "A lot of folks recently, especially with this pandemic, if you want to be terrified, listen, somebody I talked to recently, Sam Harris, he did a four hour podcast on how bioengineering of viruses is likely to destroy human civilization."}, {"time": 2743, "text": "I recommend that highly if you were too optimistic about the future of the human species."}, {"time": 2748, "text": "So apparently in the space of bioengineering is becoming easier and easier and easier to engineer viruses, engineer pathogens."}, {"time": 2755, "text": "This is the world's most depressing question."}, {"time": 2766, "text": "Is there something in particular you worry about?"}, {"time": 2766, "text": "Like that we should be thinking as a human species about?"}, {"time": 2773, "text": "Yeah, I'm sorry to disappoint you again with my lack of worry for all these problems, but I don't worry too much about it."}, {"time": 2781, "text": "We've made it through a bunch of wickets so far as a species and we'll make it through some more or we won't."}, {"time": 2790, "text": "And if we don't make it through some of these wickets and someone decides that what they're going to do over the weekend is create some crazy virus that spreads and kills everybody."}, {"time": 2801, "text": "I'm usually extremely optimistic about this stuff."}, {"time": 2809, "text": "I am now I'm with you except we won't."}, {"time": 2809, "text": "Well, there's always a chance we won't, but I have a sense that human, first of all, I believe that most people have much more capacity for good than evil."}, {"time": 2823, "text": "All of us are capable of evil, I believe, but most people are much more capable of doing good and want to do good."}, {"time": 2828, "text": "And I also believe in the resiliency of the human species that we're an innovative bunch and we can respond to tragedy, especially we respond more to tragedy as the scale of tragedy grows and our response is much better."}, {"time": 2848, "text": "So that's why I'm not worried about it, bro."}, {"time": 2848, "text": "What makes a great man?"}, {"time": 2848, "text": "Let's start at the individual."}, {"time": 2859, "text": "What makes a great woman?"}, {"time": 2859, "text": "What makes a great human being?"}, {"time": 2864, "text": "Somebody that puts others above themselves."}, {"time": 2864, "text": "What makes a great leader of humans?"}, {"time": 2873, "text": "But that sentence does a lot of work."}, {"time": 2873, "text": "When you're a leader, there's a lot of egos."}, {"time": 2873, "text": "There's a lot of tension."}, {"time": 2881, "text": "There's the human factor."}, {"time": 2881, "text": "There's people who are timid."}, {"time": 2881, "text": "There's people who are assholes."}, {"time": 2887, "text": "There's people who are incredibly competent, but self obsessed."}, {"time": 2894, "text": "There's complexities of human nature."}, {"time": 2894, "text": "How do you get all those people to be the best version of themselves and to lift up everyone else around them?"}, {"time": 2905, "text": "So now that, that question is a little bit different now."}, {"time": 2905, "text": "So now it's getting into a more specific question, but at the same time, a more broad question of what elements does it take to make a good leader?"}, {"time": 2916, "text": "So you're right that different people have different personalities, different tendencies, different levels of ego."}, {"time": 2921, "text": "And the, the way that I try and explain this is like a video game."}, {"time": 2931, "text": "And I'm not even a video game player, but I've seen this before where video game characters have various skills, various strengths and weaknesses."}, {"time": 2935, "text": "So maybe they're strong, but they're dumb, or maybe they're strong and smart, but they're slow."}, {"time": 2942, "text": "They just give them these, these ratings."}, {"time": 2947, "text": "And so that's where human beings are."}, {"time": 2947, "text": "And that's the way leaders are."}, {"time": 2947, "text": "And you can have different leaders with different characteristics."}, {"time": 2951, "text": "And depending on how all those characteristics match up, you can have somebody that is very introverted, but they're a, but, but they're still a very good leader because when they do communicate, they do it in a clear, simple manner that everyone understands."}, {"time": 2971, "text": "So even though they're a little bit introverted, people still respect them and listen to them because they communicate in a clear way."}, {"time": 2979, "text": "You could have somebody that's extremely charismatic, extremely charismatic and everyone looks to them, but they're slow in making decisions."}, {"time": 2987, "text": "And so now we've got someone that can't really make decisions when decisions need to get made."}, {"time": 2993, "text": "So even though they're charismatic, they're still not a good leader."}, {"time": 2997, "text": "So depending on the human being that we're talking about, and you just mentioned earlier that human beings are, you know, more complex than anything and do a better job at just about everything than a robot."}, {"time": 3007, "text": "So that's the same thing with leadership."}, {"time": 3012, "text": "You've got all these different characteristics and you, you match them or mix them together."}, {"time": 3016, "text": "And depending on where the ratings come out, depending on how that thing does in the end, can we almost like as a case study, look at a few people in the tech area that I'm familiar with that I know well, we can, the only caveat being that I may have no familiarization with them whatsoever."}, {"time": 3035, "text": "You may have to brief me on them."}, {"time": 3035, "text": "So I'll do my best to brief."}, {"time": 3035, "text": "I'll do my best to reduce human beings into simple descriptions."}, {"time": 3040, "text": "And then you can give me insights of why the hell they're such effective leaders based on my description, not based on your actual deep knowledge of the human beings."}, {"time": 3050, "text": "So that caveat of my inability to speak both the English language and describe humans well."}, {"time": 3058, "text": "Let's talk about first, Elon Musk."}, {"time": 3058, "text": "So he's known as being quite harsh in the sense of, first of all, a very high bar of excellence."}, {"time": 3073, "text": "And also willing to what he calls that kind of first principles thinking of asking the, the questions that hurt, which is why the hell are we doing it this way?"}, {"time": 3086, "text": "Why can't it be done a lot, but not just better, but a lot better."}, {"time": 3086, "text": "So, so let's, I don't want to hear his whole character."}, {"time": 3093, "text": "I'll go one at one section at a time."}, {"time": 3093, "text": "So we've got a guy that's harsh and, and asking the really hard questions."}, {"time": 3096, "text": "How can that be good?"}, {"time": 3096, "text": "Or why is that good?"}, {"time": 3104, "text": "Well, first of all, it can be horrible."}, {"time": 3104, "text": "And there's leaders out there that are harsh and they're hated and no one likes them and no one wants to work for them and they never do anything."}, {"time": 3112, "text": "So what is it that Elon Musk does that makes, gives him the ability to be harsh?"}, {"time": 3112, "text": "So I was, I was hearing a description of me when I would give feedback to young seals that had made mistakes during training operations."}, {"time": 3130, "text": "And the description was that I, same thing, like this harsh blunt force trauma and just totally direct sledgehammer of truth that I would hit guys with."}, {"time": 3138, "text": "But it's interesting because I always talk about, you know, building relationships and making sure you're not offending someone."}, {"time": 3152, "text": "So how do these things match up?"}, {"time": 3152, "text": "Well, I can tell you how they match up when I was being harsh, the guys that I was being harsh with knew without one shred of doubt that I cared about them more than anything else."}, {"time": 3166, "text": "And that the reason I was giving them this feedback is because I wanted them to be able to lead their troops."}, {"time": 3170, "text": "I wanted them to be able to go accomplish their mission."}, {"time": 3173, "text": "And I wanted them to be able to bring their guys home from war."}, {"time": 3179, "text": "So I wasn't being harsh because it elevated my ego."}, {"time": 3179, "text": "I wasn't being harsh because I wanted to denigrate them."}, {"time": 3184, "text": "I was being, actually being harsh because I wanted them to accomplish the mission."}, {"time": 3188, "text": "Because I wanted them to accomplish the mission."}, {"time": 3188, "text": "So if that's where Elon comes from, hey, listen, we got to make this happen."}, {"time": 3195, "text": "This is for the good of the world to do this."}, {"time": 3200, "text": "And people know that then it works."}, {"time": 3200, "text": "I'll bring this point back up with another guy, Steve Jobs, but let me stay on Elon for a second."}, {"time": 3206, "text": "The other thing he does, which is interesting, I see the value of this."}, {"time": 3214, "text": "It'd be great to hear you speak about it."}, {"time": 3214, "text": "He's unlike many of the other CEOs, very rich billionaires, involved in leading a lot of people."}, {"time": 3221, "text": "He puts a lot of time into making sure he's on the factory floor."}, {"time": 3232, "text": "He famously sleeps on the, sort of like in the middle of things."}, {"time": 3238, "text": "And he puts a lot of effort."}, {"time": 3238, "text": "He's also very good at it is being a low level engineer."}, {"time": 3238, "text": "So like, whatever the task is, he wants to understand the details and he'll talk to the lowest level person in terms of like, somebody who's like working literally on putting parts together."}, {"time": 3251, "text": "He wants to understand what the problem is, what the challenge is."}, {"time": 3259, "text": "If there's an emergency, he wants to understand the actual details of the problem, not like delegating it to a manager, but like, because a lot of CEOs, a lot of managers will talk about sort of the power and the importance of delegation."}, {"time": 3275, "text": "Here, he wants to know if there's a big problem, he wants to know the exact detail."}, {"time": 3281, "text": "He wants to know the exact problem."}, {"time": 3281, "text": "He wants to, at the fundamental level, understand how to solve that problem."}, {"time": 3286, "text": "Whether it has to do with materials, whether it has to do with the actual manufacturing, the mechanical engineering aspect, like we're talking about engineering."}, {"time": 3291, "text": "This is a guy who wears a suit as a CEO, tweets about Dogecoin, but like an actual job, he's low level engineering."}, {"time": 3305, "text": "And that to me was always inspiring to see somebody who knows what the fuck they're doing."}, {"time": 3312, "text": "That's what it, like he gains the respect of engineers at the lowest level."}, {"time": 3318, "text": "I don't know if that's scalable, but that's always been inspiring to me."}, {"time": 3318, "text": "And I wonder how many people it's inspiring to."}, {"time": 3322, "text": "Maybe you could speak to the value of doing that, of no matter how high your level of leader is, to be able to do the low level shit."}, {"time": 3328, "text": "And that's a common trait that good leaders have."}, {"time": 3335, "text": "And maybe he doesn't necessarily know how to do everything, a good leader, but they go down there and talk to the frontline troops and say, Hey, what is the issue that you're dealing with?"}, {"time": 3345, "text": "Or, you know, how can I support you?"}, {"time": 3345, "text": "How can I give you help?"}, {"time": 3345, "text": "And one key point that you said is, he said, when there's a problem, he gets in there."}, {"time": 3350, "text": "So there's things happening at his companies that they're working."}, {"time": 3355, "text": "And so he doesn't have to die."}, {"time": 3355, "text": "I'm not saying he never does, but he doesn't have to spend as much time working on or looking at some subsystem that's functioning well."}, {"time": 3368, "text": "He's got a good leader in there that's handling it."}, {"time": 3368, "text": "And he checks in with that leader."}, {"time": 3372, "text": "And the leader says, yeah, it's working perfectly."}, {"time": 3372, "text": "He says, great."}, {"time": 3372, "text": "When there's a problem, that's when he might have to get down there and dig into some details so that he fully understands it."}, {"time": 3377, "text": "So that he, when he digs down in the details, and this is important, he's coming from an altitude where he has a better, bigger perspective, not necessarily better, but a bigger perspective."}, {"time": 3393, "text": "So if you sit there and work on a problem, whatever, for eight hours and you're staring at, you know, if you were planning a mission and you were planning it for eight hours, you're staring at the maps and the charts and you're figuring out where all the troops are going to be located."}, {"time": 3407, "text": "And I come in after eight hours and I look at your plan from a distant perspective, there's a good chance I'll be able to see holes in your plan that you couldn't see because your perspective was too close."}, {"time": 3417, "text": "So that's good for me to be able to come in from a higher perspective and have a look at it."}, {"time": 3424, "text": "But also there's times where I need to get down there and actually look, you know, if you're looking at a problem and you say, look, I can't figure out boss, I can't figure out how to get to this target."}, {"time": 3433, "text": "And I'm looking at it from a distance and I don't see, I might need to start digging in and looking and saying, Oh, here's a route that we can take that actually makes sense."}, {"time": 3442, "text": "So I think it's a good example of someone going up and down in altitude to look at problems, understanding what's happening with the frontline troops."}, {"time": 3453, "text": "And at the same time, being able to go back to the strategic level."}, {"time": 3453, "text": "And I can, it's probably this way."}, {"time": 3459, "text": "The reason that he's successful is because he doesn't get stuck down there."}, {"time": 3464, "text": "Because if he felt the need to micromanage each and every part on a Tesla, it wouldn't be, it would be very unlikely that he would have the capacity to do that."}, {"time": 3475, "text": "It wouldn't be, it would be very unlikely that he would have the capacity to do all that."}, {"time": 3480, "text": "Now he can hand over some broad chip design and say, Hey, this is what the function needs to be."}, {"time": 3486, "text": "And he gives it to Lex and Lex goes there with your team and you figured out and you make it happen."}, {"time": 3489, "text": "If he had to actually do that all himself, most likely not possible."}, {"time": 3489, "text": "So that's what leaders should be doing."}, {"time": 3495, "text": "They should go elevate and, and, and then get down in the weeds when they have to, and then go back up."}, {"time": 3500, "text": "The sad thing, this is the part that makes me not want to do a startup is basically his whole life is dealing with emergencies."}, {"time": 3508, "text": "Just like you said, he's not dealing, this is not shooting the shit about details of engineering."}, {"time": 3515, "text": "It's dealing with like, in this, in the case of the company, life and death, like something that can just completely damage the production line, right?"}, {"time": 3528, "text": "So he's constantly dealing with emergencies, putting out fires."}, {"time": 3532, "text": "And I don't know if there's something to be said about that psychology of that, of how, like he, he's spoken himself that he's worried whether his mind can hold up much longer."}, {"time": 3544, "text": "So hopefully in the near future, he will start to form more decentralized command where he has some subordinate leadership that he fully trusts."}, {"time": 3550, "text": "And most important that he has properly trained so that they can handle these day to day fires at least 80% of them."}, {"time": 3556, "text": "So only 20% of the time, does he actually need to go in and solve a problem."}, {"time": 3563, "text": "If he's not doing that right now, then that's going to end up being a problem anytime."}, {"time": 3568, "text": "So I work with companies all the time."}, {"time": 3572, "text": "And that's, what's interesting about this is I go and work with a CEO or with a, with a C suite of a company."}, {"time": 3577, "text": "It takes a little while to figure out what's going on."}, {"time": 3577, "text": "I'm kind of going off of the things that you're telling me almost anecdotally, right?"}, {"time": 3610, "text": "Number one, so you can let your brain, you know, you can, you can survive a little longer as he put it, but also all the time that you spend as a leader, looking down and into your organization is time that you're not looking up and out."}, {"time": 3625, "text": "So when you're not looking up and out, you're not seeing what the competitors doing."}, {"time": 3629, "text": "You're not seeing where the market's going."}, {"time": 3629, "text": "There's problems that, that, that can come from that."}, {"time": 3633, "text": "So if right now he's spending too much time looking down and in, and you mentioned, you know, you said, I don't know if I want to do a startup."}, {"time": 3638, "text": "When you do a startup, you're going to be looking down and in for a while."}, {"time": 3640, "text": "It's going to take a while."}, {"time": 3640, "text": "You're going to have to do all this work yourself."}, {"time": 3644, "text": "You're not going to have the finances to put people manpower behind these things."}, {"time": 3647, "text": "So that's probably he, maybe he's in that mindset a little bit because he's done so many startups over the years."}, {"time": 3653, "text": "And so he's in the he's habitually in the weeds."}, {"time": 3658, "text": "So my advice would be, all right, let's start looking at formulating some subordinate leadership that has the, like I said, the expertise, the trust that you can, you can start to turn over some of these more minute details to them so that you can start looking up and out."}, {"time": 3675, "text": "I think he's done that more successful in some places than others."}, {"time": 3675, "text": "The SpaceX, a lot of people give the credit to Gwen Shotwell for the CEO, the COO of SpaceX as, as a very successful person that runs shit, but in Tesla, not as much."}, {"time": 3691, "text": "So I wonder if you can comment on something a lot of people worry about, and this applies to a lot of tech companies, which is a lot of people worry about that if Elon disappears, the, the, the innovative spirit, the company is as we know them today will collapse, will stagnate and will basically fail to do what they've been doing for so many years successfully."}, {"time": 3720, "text": "Is there some aspect to what makes a good leader that if you disappear, it's still the thing still lives on and not just lives on, but thrives."}, {"time": 3734, "text": "So what we have to do in those situations is we have to establish a strong culture inside that organization."}, {"time": 3739, "text": "And if you're there's, there's, there's reasons why this happens, right?"}, {"time": 3739, "text": "If I have a big ego and I form a company and I love the fact that everyone looks at me and says, Oh, Jocko made this company and he's the creative force behind this company."}, {"time": 3752, "text": "And that fuels my ego and it makes me feel good."}, {"time": 3756, "text": "And you know, I'm working with you, Lex."}, {"time": 3756, "text": "And every time you come up with an idea, I say, Lex, you need to stay in your box."}, {"time": 3760, "text": "So I'm not creating a culture that rewards that sort of creativity."}, {"time": 3767, "text": "And eventually when I die, I won't have have educated my team on how to maintain that creative aspect."}, {"time": 3774, "text": "So again, hopefully inside that organization, he's, he's encouraging and growing that culture where creativity is rewarded, where, where it flourishes, even when he's gone, that's what we have to hope for."}, {"time": 3796, "text": "He is, but I also seem to notice that there's not many people like him."}, {"time": 3801, "text": "Um, people become complacent too easily."}, {"time": 3801, "text": "I've been disappointed by people a little bit."}, {"time": 3811, "text": "It's like, success makes people soft."}, {"time": 3811, "text": "With Elon, it seems like success doesn't have any effect."}, {"time": 3821, "text": "It's like the reverse effect."}, {"time": 3821, "text": "It doesn't, it's like, what's the, it's always like, what's the next biggest thing, right?"}, {"time": 3825, "text": "He's living that exponential growth, which I think that's the problem that you have to have somebody who's constantly trying to find the 10 X solution, like trying to constantly improve things."}, {"time": 3841, "text": "And, uh, restlessly that, I mean, that probably has to do with finding the right people, not just creating the culture, but creating a culture with the right set of people."}, {"time": 3851, "text": "Speaking of which Steve Jobs, there's, uh, two things I want to mention there."}, {"time": 3859, "text": "One, once again, the harshness, but a very different kind."}, {"time": 3862, "text": "And the second is team building."}, {"time": 3862, "text": "So on the harshness, he is much harsher than Elon in a way, in the following way."}, {"time": 3872, "text": "And I'm having a sense that you will not like this, but I'd like to defend it is he loses his shit quite a bit."}, {"time": 3878, "text": "He was famously, at least, especially early on being very emotional."}, {"time": 3884, "text": "He was letting passion dominate the discussion."}, {"time": 3891, "text": "There'd be a lot of firings."}, {"time": 3891, "text": "There would be a lot of mean things said to people."}, {"time": 3898, "text": "I don't know what you make of that."}, {"time": 3898, "text": "How much as a leader, are you allowed to just lose your shit in your love for the thing you're doing?"}, {"time": 3907, "text": "And how effective is that?"}, {"time": 3909, "text": "As a leader, you shouldn't be doing that very often."}, {"time": 3911, "text": "So you can look back at me and say, well, Jocko, here's the most profitable company that's ever existed."}, {"time": 3916, "text": "And so you're wrong."}, {"time": 3916, "text": "Well, going back to that multiple multitude of characteristics that human beings can have."}, {"time": 3924, "text": "Well, it's the same thing with businesses."}, {"time": 3924, "text": "It's the same thing with companies."}, {"time": 3930, "text": "Steve Jobs was off the charts in some of his traits, his ability to understand design, his ability to understand human interface with computer systems."}, {"time": 3938, "text": "So, so far off the charts that despite his bad temper, emotional behavior, the company still thrived."}, {"time": 3957, "text": "You can have people that are horrible leaders that develop something that's so universally outstanding that you end up with a company that's successful."}, {"time": 3974, "text": "The reason, I mean, I get asked that a bunch, people always ask me, because I say, look, you shouldn't be losing your temper as a leader."}, {"time": 3978, "text": "Well, what about Steve Jobs?"}, {"time": 3978, "text": "He used to yell and scream all the time."}, {"time": 3984, "text": "When people say that to me, I say, oh, okay."}, {"time": 3984, "text": "Are you as good at design as Steve Jobs was?"}, {"time": 3990, "text": "Are you as good at marketing as Steve Jobs was?"}, {"time": 3990, "text": "He had a certain amount of skills that were off the charts."}, {"time": 3998, "text": "And so he was able to be successful despite the fact that he would lose his temper, treat people horribly."}, {"time": 4005, "text": "That's not good."}, {"time": 4005, "text": "And it would have been even more successful if he wouldn't had those characteristics."}, {"time": 4010, "text": "Now you might say, well, he, his anger is what pushed things."}, {"time": 4015, "text": "Well, let me ask you this."}, {"time": 4015, "text": "What leader wins the leader whose team is afraid, who the team who execute, executes the mission because they're afraid of their leader or executes the task because they're afraid of their leader or the team that loves their leaders so much that they don't want to let them down."}, {"time": 4038, "text": "They don't want to let them down."}, {"time": 4041, "text": "Or the team that loves their leaders so much that they don't want to let them down."}, {"time": 4041, "text": "Which team wins?"}, {"time": 4048, "text": "You're implying a confidence that love is more powerful than fear, but I'm not so sure."}, {"time": 4048, "text": "This is the Machiavelli question."}, {"time": 4054, "text": "You're saying ultimately it's always better to lead by inspiration and love than by, by putting the fear into the team."}, {"time": 4061, "text": "What I'm, what I'm saying is that I've seen countless times is me leading through my authority, leading through my rank, leading through punitive measures is infinitely worse than me and you working together as a team to win."}, {"time": 4082, "text": "On the second point of Steve Jobs is he has this idea of philosophy of eight players where you have a group, like the power and the productivity of a group of what he called eight players is invaluable."}, {"time": 4101, "text": "So you want to get a team of people who are the best at what they do."}, {"time": 4109, "text": "But the most important aspect to him was that a single quote unquote B player on the team destroys the entire productivity of the team."}, {"time": 4117, "text": "Is there something that it brings true to that?"}, {"time": 4117, "text": "So he was, I guess this could be a temper thing, but vicious about firing and removing the, uh, what he felt was a toxic B player in a team."}, {"time": 4130, "text": "So eight players feed off of each other, unless there's one B player present."}, {"time": 4137, "text": "It depends on the nature of the B player."}, {"time": 4137, "text": "Is the player, is the player a B player?"}, {"time": 4144, "text": "Is the player a B player because he's a little bit lazy?"}, {"time": 4144, "text": "Is he a B player because he doesn't have a good vision?"}, {"time": 4153, "text": "Is he a B player because he's got a big ego and always thinks he's right and now creates conflict in the team."}, {"time": 4161, "text": "So there's a bunch of different B players."}, {"time": 4164, "text": "Look, if you're working for me and you're kind of a B player, but guess what?"}, {"time": 4164, "text": "You're a grinder and you get stuff done."}, {"time": 4169, "text": "I want you on the team."}, {"time": 4169, "text": "You might not be the smartest person I have, but I know that you're committed to the team and I want you on the team."}, {"time": 4173, "text": "So you're a B player, but that's okay."}, {"time": 4180, "text": "Now, if you're Lex with the giant ego, I'd rather have, I'd rather have Lex."}, {"time": 4188, "text": "That's not quite as smart."}, {"time": 4188, "text": "Cause I got other people that are smart."}, {"time": 4188, "text": "I got other people that are smart on the team."}, {"time": 4192, "text": "Look, you're going to need some smart people on the team, but a team is made up."}, {"time": 4197, "text": "It's a team."}, {"time": 4197, "text": "And so you take these different components of a team."}, {"time": 4197, "text": "And if you have complimentary components, you'll end up with a superior team."}, {"time": 4202, "text": "Then just basing it on the level of, and what's an A player sometimes in the seal teams, they would get something called the stacked platoon."}, {"time": 4216, "text": "And what that would be is someone, you know, some senior person in that platoon would manipulate and maneuver to get the quote best guys that he could in that platoon."}, {"time": 4224, "text": "So, you know, the most experienced guys, the person that had great, great reputations."}, {"time": 4231, "text": "And sometimes those platoons would be great."}, {"time": 4236, "text": "Sometimes they would implode because what you end up with is a bunch of A players."}, {"time": 4241, "text": "And now no one wants to follow anyone else."}, {"time": 4241, "text": "No one wants to agree with anyone else."}, {"time": 4247, "text": "Everyone wants to do it my way."}, {"time": 4247, "text": "Not it's my way, not Lex's way."}, {"time": 4247, "text": "Lex is stupid."}, {"time": 4247, "text": "No, you're stupid."}, {"time": 4250, "text": "We end up with problems."}, {"time": 4250, "text": "So can one person derail a team?"}, {"time": 4257, "text": "Under good leadership, one person should not derail a team."}, {"time": 4264, "text": "This could be a tech thing too."}, {"time": 4264, "text": "There's some multiplying effect of just pure excellence, no matter the personalities."}, {"time": 4270, "text": "I think for Steve Jobs, he doesn't, the ego doesn't matter."}, {"time": 4279, "text": "What matters is the quality of the output, the genius of the result."}, {"time": 4284, "text": "And that somehow multiplies itself."}, {"time": 4284, "text": "And the egos actually, like one of the problems with egos is like, what does ego usually say?"}, {"time": 4291, "text": "It says, I'm much better than you."}, {"time": 4291, "text": "When you have people that are really good together, it's very hard for the ego to flourish because you're like constantly being shown that you're not as good and there's a competition."}, {"time": 4301, "text": "So like, I think to his, his idea was that like, if you get people that are really good at what they do, it turns out that you're not as good at what you do."}, {"time": 4313, "text": "It turns as opposed to you being complacent and not doing much and thinking you're better than everyone else and your opinion is better, is you almost getting in that competitive race."}, {"time": 4325, "text": "You know that magic that happens when you're at the end of a marathon and you're just like head to head, like you're just going full steam with a person that is as good as you."}, {"time": 4330, "text": "There's no place for ego there."}, {"time": 4335, "text": "You and I are racing, the end of the marathon."}, {"time": 4342, "text": "We're both highly competitive, highly competitive."}, {"time": 4342, "text": "We have massive egos and we both want to win."}, {"time": 4347, "text": "We both want to win so bad that we, we give everything we've got."}, {"time": 4357, "text": "That's totally positive, right?"}, {"time": 4357, "text": "Isn't that totally positive?"}, {"time": 4357, "text": "Now imagine this same thing."}, {"time": 4363, "text": "We're in a race, we're in a marathon, we're in the last hundred meters."}, {"time": 4363, "text": "It's you against me and, and our egos are huge and we're pushing to win and you start to pull ahead of me and my ego is so big and I hate losing so much that I somehow accidentally push my knee up against your foot on a backstride and throw you onto your face."}, {"time": 4386, "text": "So that's what ego, ego is an awesome driver unless you let your ego control you and you let ego drive your decision making process, in which case it turns into an incredible problem."}, {"time": 4394, "text": "So you might have someone that is excellent."}, {"time": 4400, "text": "You might have someone that's outstanding."}, {"time": 4400, "text": "You might have some someone that's tens across the board, but their ego is so big that big that they can't work with other people."}, {"time": 4411, "text": "They can't accept anyone else's ideas."}, {"time": 4411, "text": "They can't compromise on something because they think their idea is better all the time and that is going to be problematic and I don't want them on the team."}, {"time": 4420, "text": "Now as a good leader, guess what I'll do?"}, {"time": 4420, "text": "I'll put them into a situation where I can utilize their best aspects, but not have their ego destroy the team."}, {"time": 4425, "text": "So I might say, Hey Lex, you know what?"}, {"time": 4433, "text": "I actually want you to take lead on this part of the project over here and since you're so smart and you work so hard, I know you're going to pull ahead of everyone else."}, {"time": 4444, "text": "So you grind on that."}, {"time": 4444, "text": "Once you get that result, give it to me and I'm going to disseminate it to the team."}, {"time": 4450, "text": "So I, I, I isolate you from wrecking yourself and the rest of the team with your giant ego."}, {"time": 4457, "text": "So then, uh, looking at a completely opposite person was this a fascinating person to me is Sandra Pichai, who's the CEO of Alphabet CEO of Google."}, {"time": 4464, "text": "I admire the the, uh, in a romantic sense, the madness that is, uh, Steve Jobs and Elon Musk."}, {"time": 4480, "text": "So to me, the opposite of that is Sandra Pichai, who's, uh, like everybody loves him."}, {"time": 4489, "text": "And, uh, he's also a great listener."}, {"time": 4489, "text": "So he always brings people together."}, {"time": 4489, "text": "And so he went, the, the, the energy of that person in the room is like the basic energy."}, {"time": 4494, "text": "If I were to summarize it, it's like, I want to hear all the voices in the room."}, {"time": 4500, "text": "That's the energy he brings."}, {"time": 4500, "text": "And, uh, it's almost like he doesn't want to impose a final decision."}, {"time": 4508, "text": "He wants to hear all the voices and somehow always the decision just falls out."}, {"time": 4514, "text": "I don't know what to say about that."}, {"time": 4522, "text": "What to say about that style of leadership, but it's always surprising to me how that love brought a lot of people together and still, I mean, some of the greatest things Google has done over the past several years, uh, could be attributed to that continued innovation, bringing out the best out of people."}, {"time": 4543, "text": "There's of course, bureaucracy, which I could criticize at the end of the day, which always happens with big companies."}, {"time": 4547, "text": "I would argue actually the dictatorial style of Steve jobs and, you know, Musk helped fight the bureaucracy, which is one criticism I would give of being a listener and being kind is sometimes you can't cut through the as effectively, but he."}, {"time": 4561, "text": "He's one of the only people I've ever heard of who everybody loves."}, {"time": 4567, "text": "He's inspirational figure to millions, especially in the, like in India, he's a celebrity in the best kind of way."}, {"time": 4573, "text": "Is there something you could say about that kind of leadership where you're never the asshole."}, {"time": 4578, "text": "You're never the dictator."}, {"time": 4578, "text": "You're always the listener and, um, the compassionate empathetic glue that brings the team together basically would love."}, {"time": 4592, "text": "That's that's great leadership."}, {"time": 4592, "text": "If you have to choose for Google, uh, for large companies, is there something to be said about what is more effective?"}, {"time": 4607, "text": "The dictator, uh, ruling by love or ruling by fear?"}, {"time": 4614, "text": "First of all, everything's a dichotomy, right?"}, {"time": 4614, "text": "And so to think that all the time, you're always going to be able to just bark orders at people and they're always going to listen to you."}, {"time": 4620, "text": "And you're always going to get the best result."}, {"time": 4624, "text": "That would not be smart to think that every single time you're going to come to a 100% consensus amongst the troops."}, {"time": 4629, "text": "And that decision is going to reveal itself without you nudging it along."}, {"time": 4635, "text": "That would also be short sighted and naive."}, {"time": 4635, "text": "So what you, what a good leader does is they, they, they stay balanced."}, {"time": 4642, "text": "And as much as they can, they listen to what the troops have to say."}, {"time": 4647, "text": "They take that feedback."}, {"time": 4647, "text": "Maybe they quietly nudge things and, and I'm sure he does that."}, {"time": 4654, "text": "I'm sure he does some nudging that maybe no one even picks up on."}, {"time": 4660, "text": "You know, I like to say the best forms of leadership is leadership with minimum force required."}, {"time": 4665, "text": "So if I can go into a room as a leader and not say one single thing and the team can come to the right consensus and move in that direction, that's my preferred method."}, {"time": 4671, "text": "Maybe I have to give them a little bit of a nudge, a 10% nudge in one direction."}, {"time": 4675, "text": "That's better than me walking in there and giving them 100% dictatorial direction of exactly what I want to have happen."}, {"time": 4680, "text": "Now, occasionally, if we have an emergency situation, people are starting to be frazzled and they're not sure which direction to go."}, {"time": 4693, "text": "Then sometimes as a leader, you have to walk in and say, all right, everyone here's where we're going."}, {"time": 4697, "text": "And people get on board."}, {"time": 4697, "text": "Because for many years or months or however long you've trusted them to come up with a plan."}, {"time": 4704, "text": "And when you trust, when you, as a leader, trust your team to come up with a plan, the team starts to trust you and you get leadership capital."}, {"time": 4717, "text": "And as you build leadership capital, occasionally you need to cash in some of that leadership capital."}, {"time": 4722, "text": "You need to spend some of it."}, {"time": 4722, "text": "And maybe it is, hey, listen, here's the direction we're going right now."}, {"time": 4726, "text": "We'll debrief it later, but we got to make a move."}, {"time": 4726, "text": "And the team who trusts you says, Roger that boss, we got it."}, {"time": 4732, "text": "And all of them actually do this interesting thing."}, {"time": 4737, "text": "I'd love to hear your opinion on it."}, {"time": 4737, "text": "Sondra certainly does it to a large degree, which is it's in the process of delegation, trusting a person to do a really difficult thing, like tossing it up and saying like, I trust you can get this job done for some, even if your resume does not support that."}, {"time": 4764, "text": "I'm actually kind of amazed that human beings when they're given the trust to get the job done, they step up very often."}, {"time": 4771, "text": "That's kind of an amazing property of human nature."}, {"time": 4776, "text": "People often ask me issues about leadership."}, {"time": 4776, "text": "And I always say that one of the best tools for teaching leadership and for teaching a bunch of other lessons is leadership itself."}, {"time": 4787, "text": "So when it happens all the time, when you elevate someone into a leadership position, they do step up and they do make things happen."}, {"time": 4793, "text": "So that's not surprising to me."}, {"time": 4800, "text": "You do have to mitigate risks."}, {"time": 4800, "text": "So saying, Hey, you know, Lex, I know you're, haven't been in the military before."}, {"time": 4805, "text": "I know you have very limited weapons experience, but I want you to run a target assault on a real mission in whatever country that would not be good."}, {"time": 4818, "text": "That would not be a good move on, on my part."}, {"time": 4818, "text": "Now, if I said, all right, Lex, you know what, I want you to get some leadership experience."}, {"time": 4822, "text": "I've got a training mission and it's going to be using paintball and I'm going to put you in charge of it."}, {"time": 4826, "text": "I got no problem doing that."}, {"time": 4833, "text": "Some of that is judging human character is like, there's potential, there's something in this person that they are, they have enough demons or whatever the hell it requires to have that fuel."}, {"time": 4845, "text": "They'll hate themselves if they don't."}, {"time": 4845, "text": "And they'll find the right, they'll find the tools that find the path to achieve the, whatever the level of perfection they can."}, {"time": 4856, "text": "It's been really surprising to me."}, {"time": 4856, "text": "It's been making me rethink the whole hiring process because I often now I'm thinking and looking, so I'm looking for people, both for the startup, but just for my own life to help."}, {"time": 4867, "text": "And I almost want to see evidence of excellence, but maybe you want to just based on just judgment of human character without evidence of excellence, have people step up."}, {"time": 4881, "text": "Like Joe Rogan with Jamie, that's a funny side of it."}, {"time": 4881, "text": "I didn't understand how little Joe knew about Jamie when he hired him."}, {"time": 4888, "text": "And Jamie stepped up and now runs one of the most successful podcasts ever."}, {"time": 4894, "text": "And that's an incredible kind of, and he's one of the best producers in the world now, not to let it get to his head."}, {"time": 4899, "text": "And by the way, the funny thing about him."}, {"time": 4905, "text": "And one of the best Googlers in the world."}, {"time": 4905, "text": "One of the best Googlers."}, {"time": 4905, "text": "The funny thing about Jamie, this is okay."}, {"time": 4909, "text": "You might not like this, but what I, what I like, I'm constantly exceptionally self critical to a point of like self hating."}, {"time": 4917, "text": "Sometimes I deeply appreciate every single moment I'm alive, but everything I've ever done, I feel like a shit."}, {"time": 4924, "text": "And when I talked to Jamie about everything he's done, he's just in every way he carries himself."}, {"time": 4930, "text": "He's so self critical."}, {"time": 4930, "text": "He's so he's so like worried that it's wrong."}, {"time": 4936, "text": "That anxious energy."}, {"time": 4936, "text": "Cause that's how you lead to growth and progress."}, {"time": 4944, "text": "Like you might, like a therapist might say, that's probably not good for your like wellbeing."}, {"time": 4949, "text": "Fuck it."}, {"time": 4949, "text": "It's good for the what's good for your wellbeing is to create awesome things."}, {"time": 4956, "text": "That's ultimately what leads to happiness is to, to create the best thing you can in your life."}, {"time": 4961, "text": "And so when I see that in somebody like Jamie or anybody I talked to, when you're really self critical, that's a good sign to me."}, {"time": 4967, "text": "It's not ridiculous at all."}, {"time": 4973, "text": "And it goes back, you know, you were, you were the way you were phrasing these questions about what makes a good person and what makes a good leader, the way you phrase them kind of eliminated the normal answer that I give the normal answer that I give."}, {"time": 4985, "text": "You asked me what makes a good leader, what makes a good person is, is being humble."}, {"time": 4990, "text": "So when you're going to hire someone for your, for your startup or whatever company you're creating, that is a key characteristic to look for is someone that has the humility like, like young Jamie to say, yeah, you know, I, I could have done this better and here's what I can improve."}, {"time": 5010, "text": "And here's what I need to work on."}, {"time": 5010, "text": "When you have somebody that thinks they know everything out of the gate, you're, you're already got someone that's going to be hard to deal with."}, {"time": 5020, "text": "They're going to be hard to coach."}, {"time": 5020, "text": "They're going to be hard to mentor."}, {"time": 5022, "text": "When you have somebody that's truly humble, you barely, again, it's minimum force required because when you say to Jamie after a show, how do you think that went, he says, well, you know, I did this wrong and I didn't have this set up in time."}, {"time": 5032, "text": "And you don't, you don't barely have to do anything because he's got the humility."}, {"time": 5038, "text": "If you've got someone that's a big ego and you say, Hey, how did that show go?"}, {"time": 5038, "text": "He goes, I went awesome on my end."}, {"time": 5043, "text": "Now guess what you have to do."}, {"time": 5043, "text": "Now you have to start applying force as a leader, which is expending leadership capital, which we don't want to do because we always try and conserve our leadership capital as much as we possibly can."}, {"time": 5051, "text": "And when we have to expend it just to get Jamie to make some improvements, that's bad."}, {"time": 5056, "text": "So when you go looking for people, look for people that are humble."}, {"time": 5063, "text": "Now, does this mean you look for people that don't have any confidence?"}, {"time": 5066, "text": "No, that's not what I'm saying."}, {"time": 5066, "text": "There's a balance to all these things."}, {"time": 5069, "text": "That's the dichotomy of leadership you, but people tend towards and look, I work with a lot of military troops in the past."}, {"time": 5075, "text": "Now I work with companies."}, {"time": 5075, "text": "The reason I talk about humility all the time is because for someone to be, get into a leadership position in the military, they have to have confidence."}, {"time": 5087, "text": "So the tendency is that their confidence is going to outweigh their humility at some point."}, {"time": 5093, "text": "Same thing with, with civilian companies."}, {"time": 5093, "text": "If you get to a point of leadership inside of a company, you have to have confidence to get there."}, {"time": 5099, "text": "You don't get to a position of leadership inside of a company lacking confidence."}, {"time": 5103, "text": "So the tendency is for confidence to, to grow a little bit too much."}, {"time": 5109, "text": "And we have to put that, put that confidence into check."}, {"time": 5116, "text": "We have to put that ego into check."}, {"time": 5116, "text": "Really good leaders."}, {"time": 5116, "text": "They're confident, but they're humble."}, {"time": 5121, "text": "That's the balance of the dichotomy."}, {"time": 5121, "text": "Hear that, Jamie, don't get cocky."}, {"time": 5125, "text": "On occasion."}, {"time": 5125, "text": "Rarely you talk about discipline."}, {"time": 5125, "text": "What does a discipline life look like doing what you're supposed to do?"}, {"time": 5133, "text": "What if I want to lay on the couch and eat Cheetos and watch soap operas?"}, {"time": 5141, "text": "That's that's not, that doesn't feel like discipline."}, {"time": 5141, "text": "Do you think you're supposed to do that?"}, {"time": 5147, "text": "Well, you know, you could argue from a, a sort of a meaning of life perspective that perhaps happiness is the most important."}, {"time": 5153, "text": "And if it makes me happy, perhaps that's, if it's fulfilling, of course, eating Cheetos and watching soap operas is fulfilling for nobody whatsoever."}, {"time": 5166, "text": "But there's something about discipline that's more than that."}, {"time": 5166, "text": "We have to like the rigor of habit, right?"}, {"time": 5171, "text": "You, you wake up early in the morning, all the time."}, {"time": 5180, "text": "What is it Jordan Peterson talks about?"}, {"time": 5180, "text": "One place where you probably agree with Jordan."}, {"time": 5185, "text": "People ask me if I make my bed."}, {"time": 5185, "text": "There's a disagreement with Jordan."}, {"time": 5199, "text": "You know, when I was younger, before I was married, I didn't make my bed because I had one sleeping bag on it and I would get out of the sleeping bag."}, {"time": 5213, "text": "There was nothing to make."}, {"time": 5213, "text": "Now I'm married and I can't make my bed because my wife's in my bed."}, {"time": 5219, "text": "So I don't make my bed."}, {"time": 5219, "text": "So what in your life, maybe we can talk about the one that's most publicly facing, which is you wake up at four o clock or around four o clock in the morning."}, {"time": 5234, "text": "You post on social media a picture of your watch."}, {"time": 5234, "text": "It being early, just to remind people that you are a man of your word."}, {"time": 5245, "text": "What's the philosophy of the four o clock?"}, {"time": 5252, "text": "What role does that play in a disciplined life for you?"}, {"time": 5255, "text": "From that perspective, what role it plays is getting a jump on the day."}, {"time": 5260, "text": "And when you wake up early and you get a jump on the day and you've got your workout done, and you've got a little bit of little bit of work done by the time normal people are getting up, that's a win."}, {"time": 5273, "text": "That's a psychological win."}, {"time": 5273, "text": "And it's not just a psychological win."}, {"time": 5273, "text": "It's an actual win."}, {"time": 5278, "text": "So that feels great."}, {"time": 5278, "text": "It doesn't feel great."}, {"time": 5278, "text": "Maybe when your alarm clock goes off, but by eight o clock in the morning and you've already accomplished some of the major tasks that you have, some of the most painful tasks that you have for the day, you're off to a great start and it's going to feel great."}, {"time": 5299, "text": "Let's break this down then."}, {"time": 5299, "text": "What does then the rest of the day look like?"}, {"time": 5299, "text": "What is the perfect, productive, disciplined day in the life of Jaco Willink look like?"}, {"time": 5311, "text": "Wake up, workout."}, {"time": 5314, "text": "Wake up when?"}, {"time": 5315, "text": "4, 4.30."}, {"time": 5316, "text": "Workout when?"}, {"time": 5318, "text": "5, 5 to 6 or 7."}, {"time": 5322, "text": "No eating?"}, {"time": 5324, "text": "And then what does the workout look like?"}, {"time": 5326, "text": "Depends on the day."}, {"time": 5328, "text": "What's the perfect?"}, {"time": 5328, "text": "We're talking about body weight, lifting, cardio, heavy bag, jiu jitsu."}, {"time": 5338, "text": "When I say workout, I mean no jiu jitsu."}, {"time": 5338, "text": "So jiu jitsu comes later in the day."}, {"time": 5346, "text": "So this is just you alone?"}, {"time": 5347, "text": "This is me alone working out."}, {"time": 5347, "text": "And I'm going to be doing a wide variety of things."}, {"time": 5353, "text": "This is the thing that has the pictures of the aftermath with some sweat at the end."}, {"time": 5353, "text": "So the goal is to do whatever the hell results in some sweat."}, {"time": 5360, "text": "And that takes an hour."}, {"time": 5364, "text": "Sometimes it takes 12 minutes."}, {"time": 5364, "text": "Sometimes it takes three hours, depending on what kind of mood I'm in."}, {"time": 5373, "text": "You got some demons to work through or is this just work?"}, {"time": 5373, "text": "So you got the David Goggins who clearly has demons screaming inside of his head that he's trying to work through."}, {"time": 5383, "text": "Are you just getting the work done out of the discipline?"}, {"time": 5387, "text": "Or is this, I think Joe is a little bit with David Goggins is like, there's some ego, there's some bullshit that you're trying to get out through some of the exercise."}, {"time": 5398, "text": "That's a good way to kind of humble you is just doing that exercise."}, {"time": 5401, "text": "Well, exercise is certainly humbling."}, {"time": 5406, "text": "I mean, it's, but it's physical conditioning, right?"}, {"time": 5406, "text": "It's preparing your body so that you can handle whatever it is you're going to do."}, {"time": 5414, "text": "What does, what do you do after?"}, {"time": 5414, "text": "Let's talk about food."}, {"time": 5414, "text": "Hopefully surf."}, {"time": 5414, "text": "If the waves are good, surf for how good are the waves?"}, {"time": 5422, "text": "Let's say they're good."}, {"time": 5422, "text": "This is a perfect day."}, {"time": 5422, "text": "It's a perfect, perfect waves."}, {"time": 5429, "text": "Why do you surf?"}, {"time": 5429, "text": "This is fun."}, {"time": 5429, "text": "Man, man and nature."}, {"time": 5438, "text": "It was just like, what surfing is the ultimate is the power of the, the infinite power of the ocean versus a little silly looking man on a board."}, {"time": 5453, "text": "You could say it's the infinite power of the ocean versus a silly looking man on a board, or you could say it's fun because it's Russian and romance."}, {"time": 5457, "text": "This is for fun in the morning."}, {"time": 5463, "text": "And this is, you're still having eaten."}, {"time": 5466, "text": "So when do you eat?"}, {"time": 5466, "text": "I'll usually start grazing around 11 oclock and grazing."}, {"time": 5473, "text": "What's the, what's the diet that's the, is there a perfect diet or do you graze?"}, {"time": 5479, "text": "I'll have, I'll eat some nuts, you know, something like that."}, {"time": 5479, "text": "I usually start grazing."}, {"time": 5479, "text": "Maybe I'll have a little piece of meat or something like that."}, {"time": 5484, "text": "Does work enter any of this?"}, {"time": 5484, "text": "I'm sure you have a lot of people that want your attention."}, {"time": 5489, "text": "No work is work is about to happen."}, {"time": 5495, "text": "Cause you know, even if I, if I woke up at four, worked out from five to six surf from six to eight, now I'm starting to work writing, recording, reading, talking to clients."}, {"time": 5511, "text": "Is there parts of the day where you try to find moments to think deeply, to read deeply, to sort of really focus?"}, {"time": 5519, "text": "Cause this world wants, it's full of distractions, right?"}, {"time": 5524, "text": "Even talking to, uh, like even work stuff, the emails and all those kinds of things that can, they can scatter your mind."}, {"time": 5530, "text": "Is there times you seek to have that focus?"}, {"time": 5534, "text": "Well, I read a lot of books."}, {"time": 5534, "text": "And so usually when I read, I'll be reading for a chunk of time, maybe an hour at a time, maybe a little bit longer."}, {"time": 5540, "text": "And I might do that twice a day."}, {"time": 5540, "text": "So I don't know if that counts as what you're describing, but then same thing with writing."}, {"time": 5552, "text": "When I, when I'm writing something, I mean, I just, that's what I do."}, {"time": 5552, "text": "I write usually usually write for about an hour."}, {"time": 5557, "text": "I can get about a thousand words an hour out of me."}, {"time": 5557, "text": "So that's, that's sort of what I do."}, {"time": 5563, "text": "What does the rest of the day look like?"}, {"time": 5568, "text": "Just a lot of work, but one is the jujitsu."}, {"time": 5568, "text": "I want to find out about the jujitsu."}, {"time": 5572, "text": "So round, round four, 30 or five oclock at night and train."}, {"time": 5572, "text": "And, uh, how hard you still, how, how are you doing body wise?"}, {"time": 5582, "text": "He still is the old man."}, {"time": 5582, "text": "Does the old man still got it or, or are you talking to me?"}, {"time": 5595, "text": "It'd be good for viewership and ratings."}, {"time": 5595, "text": "If I die before the end of the podcast."}, {"time": 5595, "text": "So so I, I, I still train with the same guys and I'll train, you know, so I've been very lucky when it comes to getting injured and stuff like that."}, {"time": 5605, "text": "So haven't, I've had some injuries, but they're, they're healed."}, {"time": 5610, "text": "And so, yeah, I train and, uh, food wise, you mentioned grazing us some, uh, of some nuts, a very light kind of things."}, {"time": 5616, "text": "Is there a main meal here at night at night?"}, {"time": 5621, "text": "High, uh, in protein or is it anything?"}, {"time": 5621, "text": "I'll have like a steak and salad."}, {"time": 5621, "text": "I'll usually have for dessert."}, {"time": 5628, "text": "I have like a protein shake."}, {"time": 5628, "text": "So is there a thing where at the end of the, uh, at the end of the day, you will like, you have like a summarize sword and you meditate on, uh, uh, death and, um, all those kinds of, is, is there some weird ritual you partake in?"}, {"time": 5650, "text": "You just go to bed when I get done with the end of the day, I might read a little bit more."}, {"time": 5653, "text": "Read more."}, {"time": 5653, "text": "Because reading makes me tired usually."}, {"time": 5653, "text": "Um, so I'll read a little bit more."}, {"time": 5663, "text": "Is there a key to you that you can speak to that makes for a productive day?"}, {"time": 5668, "text": "Just the way you approach it mentally."}, {"time": 5668, "text": "Write down what you're supposed to do, wake up early and start doing it and then get it done."}, {"time": 5672, "text": "I know it's a miraculous trick."}, {"time": 5679, "text": "Can I ask you about Jiu Jitsu?"}, {"time": 5679, "text": "By all means."}, {"time": 5685, "text": "What have you learned from being a practitioner?"}, {"time": 5685, "text": "You're a black belt."}, {"time": 5689, "text": "What have you learned from this journey, uh, of, um, being a martial artist?"}, {"time": 5697, "text": "Jiu Jitsu for me was the connective tissue that started to join my mind together with all the F different aspects of my life."}, {"time": 5705, "text": "And so Jiu Jitsu for me was, was really important."}, {"time": 5712, "text": "And I don't think I would be doing anything that I'm doing right now if it wasn't for Jiu Jitsu."}, {"time": 5716, "text": "So there's various aspects of my life that were in existence, but I didn't understand how they were connected until I started training Jiu Jitsu."}, {"time": 5723, "text": "The primary things are interacting with other human beings and combat tactics and strategy and Jiu Jitsu."}, {"time": 5728, "text": "And all those things are connected."}, {"time": 5737, "text": "They all follow the same guiding principles."}, {"time": 5737, "text": "And I wouldn't have recognized those guiding principles if I didn't do Jiu Jitsu."}, {"time": 5742, "text": "Cause you've trained for many, many years."}, {"time": 5749, "text": "What, um, is it the hardship?"}, {"time": 5749, "text": "Is it the humbling nature of just being tapped all over, you know, nonstop, or I don't actually don't know how many times more times than you."}, {"time": 5762, "text": "Is it just the hardship of physical training, like the honesty of the mat in the sense that like, you know, what works and what doesn't work, which, which aspects were the most, uh, impactful for you?"}, {"time": 5773, "text": "All aspects."}, {"time": 5773, "text": "So yes, from a humility perspective, when you realize you think when you think, you know what you're doing, when you think you have certain skills and you realize that there's always somebody better than you."}, {"time": 5783, "text": "And you realize that, Hey, maybe I don't have all the answers all the time."}, {"time": 5786, "text": "And you bring that to a leadership perspective and you walk into your platoon and you realize that maybe you don't have all the answers all the time."}, {"time": 5795, "text": "And maybe you should listen to what other people have to say."}, {"time": 5795, "text": "You bring that to a combat situation and you realize that you think if you sit there and think that you're smarter than the enemy, you're going to be complacent."}, {"time": 5804, "text": "You're going to make mistakes."}, {"time": 5804, "text": "So there's one aspect out of the gate, as far as, you know, if I, if I'm going to try and get your arm, do I attack your arm?"}, {"time": 5819, "text": "Maybe not directly, unless I'm a white belt."}, {"time": 5819, "text": "I attack your neck."}, {"time": 5819, "text": "And when you reach up to defend your neck, that's when I get your arm."}, {"time": 5826, "text": "Well, if I'm out on the battlefield and there's an enemy position, should I attack frontal assault into that position?"}, {"time": 5836, "text": "No, no, I shouldn't."}, {"time": 5836, "text": "I should put down some covering fire and I should maneuver around to the flank."}, {"time": 5839, "text": "If I'm dealing with you and you're my boss and you've got a giant ego and you've come up with a plan and I don't like your plan, should I walk up to you and say, hey, Lex, your plan isn't good?"}, {"time": 5849, "text": "Or should I say, Hey, Lex, can I ask you some questions about how you want us to execute this?"}, {"time": 5855, "text": "Cause I want to make sure I understand your vision."}, {"time": 5862, "text": "So all these things are connected."}, {"time": 5864, "text": "And I wouldn't have realized that we could sit here and do this forever."}, {"time": 5864, "text": "We could, we could, I could tell you these comparisons forever, but this, all this connective tissue, bringing all these things together, I wouldn't have seen it without, I don't think I would have seen it without jujitsu."}, {"time": 5878, "text": "So jujitsu to me had, it had a incredible life impact on me."}, {"time": 5878, "text": "Not look the physical part."}, {"time": 5889, "text": "Does it, does it keep you humble when you know that there's 145 pound individual that can tap you out when you're 220 pound, 25 year old guy."}, {"time": 5898, "text": "And there's 135 or 140 pound, you know, 46 year old guy that can make you tap out."}, {"time": 5908, "text": "That's humbling."}, {"time": 5908, "text": "And, and what do you do with that?"}, {"time": 5908, "text": "Do you run away from it or do you continue to pursue it?"}, {"time": 5915, "text": "Same thing with life."}, {"time": 5915, "text": "Same thing with anything."}, {"time": 5920, "text": "So jujitsu is an incredibly powerful, not just physical aspect, but it's, it's a way to understand."}, {"time": 5928, "text": "It's a way of thinking."}, {"time": 5928, "text": "You've also competed."}, {"time": 5928, "text": "Is there something you can speak to the value of competition?"}, {"time": 5934, "text": "Obviously you've been through combat, actual military combat is many, many, many, many orders of magnitude, more high stakes than competition in a, in a silly sport like jujitsu."}, {"time": 5950, "text": "Nevertheless, it still has some of the echoes of the same challenges."}, {"time": 5950, "text": "Is there something you can speak to the value of competition for you?"}, {"time": 5958, "text": "Competition will reveal weaknesses in your game that you can then go back and train to rectify."}, {"time": 5964, "text": "So that, that's a big part of it."}, {"time": 5971, "text": "So that that's very useful to serve."}, {"time": 5971, "text": "As a testing ground, of course, training can be that testing ground as well or, or that feedback."}, {"time": 5978, "text": "But as you and I both know, if you and I train together all the time, you'll know my game."}, {"time": 5984, "text": "I'll know your game."}, {"time": 5984, "text": "And even if we have five other people, we all kind of understand each other's games and you're not doing something to me that I don't expect."}, {"time": 5993, "text": "So when I go and compete, I'm good."}, {"time": 5993, "text": "You know, this random person has a game that I've never seen before."}, {"time": 5998, "text": "I'm, and I may or may not know how to deal with that game."}, {"time": 6003, "text": "If I know how to deal with it, great."}, {"time": 6003, "text": "I get the victory."}, {"time": 6003, "text": "Maybe I don't learn as much."}, {"time": 6003, "text": "If I don't know how to deal with their game, I get the loss and I get the win of learning what some weakness in my game is."}, {"time": 6015, "text": "So you mentioned offline that your friends and you work with Dean Lister and Dean Lister is one of the people that inspired John Donoher, who I've very much been, I've gotten a chance to talk to quite a bit recently."}, {"time": 6034, "text": "I don't know what you think about this."}, {"time": 6034, "text": "This is not a therapy session, but or maybe it is turning into one."}, {"time": 6039, "text": "He's a fascinating person, John Donoher, in terms of creating almost a science of Jiu Jitsu to a level that I haven't seen before, which is systems thinking about, like you can think about military combat as tactics in a particular situation, but then you zoom out and you want to create entire systems of tactics in all situations, right?"}, {"time": 6069, "text": "He's very kind of wants to keep zooming out and creating giant systems."}, {"time": 6074, "text": "And, which I appreciate that, even though the task is probably impossible to do completely, but there is something that's in terms of competition that he kindled a fire in me that I want to get back out there."}, {"time": 6089, "text": "He has a particular thing that did it, which is very different from my personal journey in Jiu Jitsu, which was to a degree that people I worked with cared about competition, it was always about winning or doing well, all those kinds of things."}, {"time": 6113, "text": "For John, it's about winning, like winning is not even a thing that's important."}, {"time": 6121, "text": "What's most important is winning by submission or dominance, right?"}, {"time": 6121, "text": "And not just the end, it's the entire time competing such that the only thing that matters is that kind of victory."}, {"time": 6139, "text": "And that's a very different level of competition that's actually liberating in a certain kind of sense."}, {"time": 6143, "text": "I remember so much of my competition was about fear of not taking risks."}, {"time": 6143, "text": "You get up on points or you hold a strong position, you kind of advance and you get more points."}, {"time": 6154, "text": "Maybe you chase the submission, but there's always a fear of risk."}, {"time": 6159, "text": "And for him, you embrace the risk."}, {"time": 6159, "text": "You should not be competing out of fear."}, {"time": 6166, "text": "Live and die by the sword versus stay in safety."}, {"time": 6166, "text": "I don't know if there's something to be said here."}, {"time": 6174, "text": "Well, you said it's novel to you, it's not novel to me."}, {"time": 6174, "text": "My entire journey in Jiu Jitsu was only about submission."}, {"time": 6182, "text": "And as you mentioned, Dean Lister is my coach and my main training partner for 20 something years."}, {"time": 6190, "text": "And if you ever watch Dean train or fight, that's what he's trying to do is submit as everyone."}, {"time": 6198, "text": "That's what he's always done."}, {"time": 6198, "text": "That's what he always will do."}, {"time": 6203, "text": "He, you know, he has the highest, I think he has impact."}, {"time": 6203, "text": "I know he has the highest submission victories in ADCC."}, {"time": 6210, "text": "He, that's what he does."}, {"time": 6210, "text": "So this is, in fact, as Jiu Jitsu got bigger and bigger, in fact, as Jiu Jitsu got more popular and we started seeing people competing to win by points, that was what was novel to me in the beginning."}, {"time": 6227, "text": "Now it's the standard."}, {"time": 6227, "text": "So it's not novel to me."}, {"time": 6233, "text": "I love the fact that John Donoher and all of his troops go out and they try and submit people."}, {"time": 6240, "text": "I think it's awesome."}, {"time": 6240, "text": "And I think that's what Jiu Jitsu is."}, {"time": 6243, "text": "Let's ask for some advice for white belts."}, {"time": 6243, "text": "There's a lot of white belts who listen to this."}, {"time": 6249, "text": "What advice would you give?"}, {"time": 6249, "text": "You've been in Jiu Jitsu for many years."}, {"time": 6249, "text": "In terms of a successful journey through Jiu Jitsu, what advice would you give them?"}, {"time": 6255, "text": "People just starting out."}, {"time": 6260, "text": "Just keep training, keep your ego in check."}, {"time": 6260, "text": "Don't freak out."}, {"time": 6260, "text": "Try and use the techniques that you learn and all this stuff."}, {"time": 6264, "text": "So I'm like saying it, you know, notice how I'm saying it."}, {"time": 6268, "text": "Hey, tap out, keep your ego in check."}, {"time": 6271, "text": "It's common sense."}, {"time": 6271, "text": "But the thing is everyone says this all the time and white belts still start off by going completely nuts for at least, you know, three to six months of, I'm not going to let this guy tap me out."}, {"time": 6280, "text": "And they're going to, and I'm going to tap this guy out, not by using technique, but by just using strength."}, {"time": 6284, "text": "And it's just, it's just inhibiting your learning."}, {"time": 6284, "text": "So as much as you can, I know, I know you got to get it out of your system."}, {"time": 6290, "text": "I know you don't want to tap."}, {"time": 6290, "text": "And I know you want to tap somebody, but as soon as you get, get that off your chest, then try and, try and relax and try and learn the techniques."}, {"time": 6301, "text": "It's perhaps counterintuitive."}, {"time": 6301, "text": "It never was to me, but it's counterintuitive that to, to start on the journey of really sort of mastering Jiu Jitsu or whatever, or improving is you have to relax."}, {"time": 6313, "text": "And that seems to be a very counterintuitive lesson."}, {"time": 6319, "text": "I learned that early on with, that was thanks to the Russian system."}, {"time": 6319, "text": "I played piano and like music, basically, actually this is true for basically any sport that includes the human body is like relaxing is the way you, you start learning stuff."}, {"time": 6331, "text": "You have to learn, you have to literally, and most people don't seem to understand this is like, you have to learn what it means for the human body to relax."}, {"time": 6341, "text": "Like, I guess you have to have enough knowledge of all the muscles involved to know what it means to relax those muscles."}, {"time": 6348, "text": "So for piano, you have to understand what it means to relax your wrists and your fingers in order to learn how to move them."}, {"time": 6353, "text": "Like if there's tenseness in the fingers, you're not going to like, you have to learn how to try hard while relaxed."}, {"time": 6368, "text": "The, I guess the beginner, if you don't internalize this lesson, will try hard by tensing up hard and like trying hard, tensing up more as opposed to relaxing more."}, {"time": 6374, "text": "And that lesson cannot be conveyed through words, I guess."}, {"time": 6381, "text": "I've had the great fortune of having dictatorial teachers as they do in Russia for piano and so on, where you get like hit if you don't learn to relax, which is a counterintuitive notion, but it works."}, {"time": 6397, "text": "This brings me to one of my favorite pieces of coaching advice that I will tell white belts while they're struggling on the mat."}, {"time": 6402, "text": "I'll tell them to relax harder."}, {"time": 6407, "text": "For somebody who studied war, who participated in war, what do you think is the best martial arts for, let's call it self defense, let's call it self defense for hand to hand combat outside the constraints of sport."}, {"time": 6433, "text": "So it's not one answer."}, {"time": 6433, "text": "The answer to me is jujitsu, boxing, wrestling, Muay Thai, judo, Sambo, and on down the list."}, {"time": 6444, "text": "I definitely start with jujitsu."}, {"time": 6444, "text": "The reason I start with jujitsu is because in a self defense situation, if you are a big monster human and you want to fight me and you square off with me, guess what I'm going to do?"}, {"time": 6458, "text": "Run away."}, {"time": 6458, "text": "Cause I don't want, I don't want to get involved."}, {"time": 6465, "text": "Even if I see skinny little Lex out on the street and you start yelling at me and saying, you want to fight me?"}, {"time": 6472, "text": "I don't, it doesn't matter."}, {"time": 6475, "text": "I don't care if I can beat you or not."}, {"time": 6475, "text": "What if you stab me?"}, {"time": 6475, "text": "What if you sue me after I get done throwing you onto the concrete?"}, {"time": 6479, "text": "There's a million bad things that can happen and almost nothing good."}, {"time": 6484, "text": "So for self defense, my first self defense is my feet to get away from you."}, {"time": 6490, "text": "And if you square off to punch me, I can run away from you."}, {"time": 6490, "text": "If you square off to kick me, I can run away from you."}, {"time": 6497, "text": "If you push me, I can run away from you."}, {"time": 6497, "text": "So great."}, {"time": 6497, "text": "I don't need to know how to box to run away from you where this all changes is when you grab me."}, {"time": 6503, "text": "And now I don't have the option to run away anymore."}, {"time": 6511, "text": "Now I actually have to know how to get away from your grip."}, {"time": 6517, "text": "And that's where jujitsu comes into play."}, {"time": 6517, "text": "So, especially if you get me on the ground, if you, if you grab me and get me on the ground, now I need to know how to get you off of me and get up and get away from you so I can run away."}, {"time": 6529, "text": "So that's why I say start with jujitsu."}, {"time": 6529, "text": "And, and from there, boxing, wrestling, judo, Sambo, Muay Thai."}, {"time": 6535, "text": "There's a, there's certain in the standing position."}, {"time": 6544, "text": "I mean, I'm a judo person as well."}, {"time": 6544, "text": "And, uh, the judo is very limited in their understanding of the full grappling spectrum, even though they do all the things on the ground as well."}, {"time": 6555, "text": "But, uh, it's so focused on the feet, but nevertheless, it's important to understand the thing that judo has as a sport and it's good to practice that, uh, jujitsu doesn't is, um, not just the, the skill of grappling on the feet, but the skill of explosive aggression that, uh, sometimes jujitsu is more about in terms of tactics is more about patience."}, {"time": 6579, "text": "It depends how you practice it, but because so much is, uh, about control and, uh, technique that, uh, sometimes you don't get to practice like aggression, explosive aggression."}, {"time": 6593, "text": "And judo is so much about, uh, aggression implemented in such a way that the demonstration of power is effortless, right?"}, {"time": 6605, "text": "That's the beauty of jujitsu."}, {"time": 6605, "text": "And same thing with wrestling."}, {"time": 6605, "text": "Wrestling also has a high level of intensity and aggression as well."}, {"time": 6610, "text": "So that's where, that's where I agree."}, {"time": 6615, "text": "Judo and wrestling."}, {"time": 6615, "text": "Get some and striking boxing Muay Thai."}, {"time": 6615, "text": "You know, like the, you should train all these things."}, {"time": 6624, "text": "Are there books and movies in your life long ago or recently that had a big impact on you?"}, {"time": 6631, "text": "Uh, yeah, the main one is about face, which is sitting right here."}, {"time": 6638, "text": "This is written by Colonel David Hackworth."}, {"time": 6638, "text": "That's the book that really had a massive impact on me from a leadership perspective."}, {"time": 6645, "text": "And I ended up, I talked about it enough that it started kind of coming back and started selling well and they contacted me and I wrote a forward for it."}, {"time": 6655, "text": "So that book had a huge impact on me and I still, when I read it, I still get lessons out of it just about every time."}, {"time": 6663, "text": "This is the Vietnam war."}, {"time": 6669, "text": "And Korea."}, {"time": 6669, "text": "And he got in towards the end of, right at the end of world war II."}, {"time": 6669, "text": "So he was kind of raised by the, the soldiers that fought in world war II and then he went to Korea and then he went to Vietnam."}, {"time": 6682, "text": "An exceptional warrior, a soldier soldier."}, {"time": 6682, "text": "If you can give a little inkling what made him a soldier soldier."}, {"time": 6687, "text": "So I, he died in 2005 so I never got to meet him."}, {"time": 6701, "text": "And I, I had a guy on my podcast who worked for him in Vietnam, a guy named general James Mukiyama."}, {"time": 6710, "text": "And luckily his son had reached out to me and said, I think you're talking about my dad cause I read some passage in there that, that Jim Mukiyama was young cap young captain Jim Mukiyama, company commander in Vietnam."}, {"time": 6724, "text": "He said, I think you're talking about my dad."}, {"time": 6724, "text": "Would you want to talk to him?"}, {"time": 6730, "text": "And I said, absolutely."}, {"time": 6730, "text": "Well, here's the thing that I didn't really understand."}, {"time": 6730, "text": "And you read one quote, but there's all these quotes in that book that talk about how great Hackworth was and what an incredible leader he was and how he was the best combat leader anyone had ever seen."}, {"time": 6744, "text": "And all these just really complimentary things that are said by a bunch of different people."}, {"time": 6749, "text": "And when you read the book, you're reading this guy's account of what he went through."}, {"time": 6755, "text": "But I never really knew if that was all true or did he just cherry pick his friends, quotes about him and cherry pick the stories that he wanted to tell."}, {"time": 6766, "text": "And so it was very interesting for me when I met Mukiyama, General Mukiyama, who he became a general eventually when I met him and we were talking about his life."}, {"time": 6771, "text": "And I was very curious and I was a little bit nervous going into this interview because I was thinking maybe my hero, my mentor, this guy that I've never met before, maybe he's just an arrogant jerk that talked, talked himself up in this book."}, {"time": 6788, "text": "So I'm sitting down with, with General Mukiyama and I finally got to the part where he's meeting Hackworth for the first time."}, {"time": 6794, "text": "And I said, did, you know, did you know who Hackworth was when he showed up?"}, {"time": 6803, "text": "So he was Mukiyama, Muk, Muk, they call him Muk."}, {"time": 6803, "text": "Muk was the, was the, like the adjutant to the, to the general that, that was going to, that, that Hackworth was going to be working for."}, {"time": 6816, "text": "So when Hackworth comes into the office, the first person he meets is this guy, this guy, Captain Mukiyama."}, {"time": 6820, "text": "And so Hackworth walks in and I said, when Hackworth walked in, did you know who he was?"}, {"time": 6826, "text": "And Mukiyama says, everybody knew who he was, Mr. Infantry."}, {"time": 6834, "text": "And so he ended up explaining that everything that is written in there about Hackworth, they, they just loved him."}, {"time": 6841, "text": "They adored him."}, {"time": 6841, "text": "Up the chain of command, it turned out a little bit different."}, {"time": 6847, "text": "And, you know, the title of the book is about face."}, {"time": 6847, "text": "And if you're familiar, familiar with military drill about faces, when you turn around 180 degrees, and at the end of the Vietnam war, towards the end of the Vietnam war, he was so disgusted with the way that the war was being fought."}, {"time": 6863, "text": "He was so disgusted with the decisions that were being made by the leadership that he did an interview."}, {"time": 6868, "text": "He was the first Colonel, first senior officer to do an interview that spoke out against the war that was happening."}, {"time": 6874, "text": "And this is while he's in Vietnam, by the way."}]}]