[{"title": "Brian Greene: Quantum Gravity, The Big Bang, Aliens, Death, and Meaning | Lex Fridman Podcast #232", "id": "98HZanvAJ8Y", "quotes": [{"time": 450, "text": "It may in fact be unique, but it may not."}, {"time": 489, "text": "It could be that all you need are those fairly commonplace conditions and maybe life naturally forms."}, {"time": 497, "text": "Look, the James Webb Space Telescope, right?"}, {"time": 499, "text": "It's going up hopefully in December."}, {"time": 501, "text": "And one of the goals of that mission is to look at atmospheres around distant planets and perhaps come to some sense of how special or not life or life as we know it is in the universe."}, {"time": 515, "text": "Which part of the story of life, let's stick to Earth for a second, do you think is the hardest?"}, {"time": 522, "text": "If you were like a betting man, which part is the hardest to make happen?"}, {"time": 528, "text": "Is it the origin of life?"}, {"time": 530, "text": "Again, we haven't drawn the line where, as you say, the line between a rock and a rabbit."}, {"time": 535, "text": "That part, is it complex organisms, like multicellular organisms?"}, {"time": 543, "text": "Is it crawling out of the ocean where the fish somehow figured out how to crawl around?"}, {"time": 549, "text": "Is it then the us homo sapiens, as we like to think of ourselves special and intelligent?"}, {"time": 557, "text": "Or is it somewhere in between?"}, {"time": 558, "text": "As you also talk about, again, very hard to know at which point this consciousness emerge."}, {"time": 568, "text": "If you were to sort of took us a survey and made bets about other Earth like planets in the universe, where do you think they get stuck the most?"}, {"time": 578, "text": "Well, I would certainly say if we're gonna go all the way to conscious beings like ourselves, I would put it at the onset of consciousness, which again, I think is a continuum."}, {"time": 587, "text": "I don't think it is something that you can draw the line in the sand, but there are obvious circumstances, there are obvious creatures such as ourselves where we do recognize a certain kind of self reflective conscious awareness."}, {"time": 638, "text": "So for billions of years on this planet, there was life that didn't have the kind of conscious awareness that we have."}, {"time": 647, "text": "And it was an accidental event in astrophysical history that allowed a mammalian species like us to ultimately be the end product."}, {"time": 658, "text": "And so, yeah, I could imagine there's a lot of life out there, but perhaps none of it's wondering what's the meaning of life or trying to make sense of it, just going about its business of survival, which of course is the dominant activity that life on this planet has practiced."}, {"time": 675, "text": "We are a rare exception to that."}, {"time": 677, "text": "And I really appreciate that you lean into some of these unanswerable questions from me today."}, {"time": 682, "text": "But the, so you think about consciousness, not as like a phase shift, the binary zero one, you think of it as a continuum that humans somehow are maybe some of the most conscious beings on Earth."}, {"time": 697, "text": "So you're, so."}, {"time": 699, "text": "I mean, people will dispute that."}, {"time": 700, "text": "Yes, I mean, well, and it's a very hard argument."}, {"time": 703, "text": "People will dispute that, rocks probably will stay quiet on the matter."}, {"time": 707, "text": "Maybe not, right?"}, {"time": 708, "text": "For the moment, they're waiting for their opportunity."}, {"time": 711, "text": "But I agree that, look, even when you and I look at each other, I am not fully convinced that you're a conscious being, right?"}, {"time": 723, "text": "I mean, I think that you are."}, {"time": 724, "text": "It's not to me."}, {"time": 725, "text": "I mean, your behavior is such that that's the best explanation for what's going on."}, {"time": 729, "text": "But of course, we're all in the position of only having direct awareness of our own conscious being."}, {"time": 736, "text": "And therefore, when it comes to other creatures in the world, we're in a similar state of ignorance regarding what's actually happening inside of their head, if they have a head."}, {"time": 746, "text": "And so it's hard to know how singular we are, but I would say based on the best available data and the best explanations that we can make, yeah, there is something special about us."}, {"time": 756, "text": "I don't think that there are fish walking around and coming up with existentialism."}, {"time": 763, "text": "I don't know that there are dogs walking around who've developed an understanding of the general theory of relativity."}, {"time": 769, "text": "I mean, maybe we're wrong, but that seems the best explanation."}, {"time": 774, "text": "What do you think is more special, intelligence or consciousness?"}, {"time": 777, "text": "I think consciousness."}, {"time": 779, "text": "And I think that there's a deep connection between these ideas."}, {"time": 783, "text": "They are distinct, but they're deeply connected."}, {"time": 786, "text": "But look, I mean, to me and to, of course, many philosophers who actually coined a name for this, the hard problem of consciousness, David Chalmers and others, as a physicist, I look out at the world and I see it's particles governed by physical law."}, {"time": 803, "text": "We can name them."}, {"time": 804, "text": "We got electrons, we got quarks that come in various flavors and so forth."}, {"time": 809, "text": "We have a list of ingredients that science has revealed and we have a list of laws that seemingly govern those ingredients."}, {"time": 817, "text": "And nowhere in there is there even a hint that when you put those particles together in the right way, an inner world should turn on."}, {"time": 828, "text": "And it's not only that there's no hint, it's insane."}, {"time": 833, "text": "How could it be that a thoughtless, passionless, emotionless particle, when grouped together with compatriots, somehow can yield something so deeply foreign to the nature of the ingredients themselves?"}, {"time": 849, "text": "So answering that question, I think is among the deepest and most difficult questions that we face."}, {"time": 857, "text": "Do you think it is in fact a really hard problem?"}, {"time": 863, "text": "Or is it possible, I think you mentioned in your book, that it's just like almost like a side effect."}, {"time": 870, "text": "It's an emergent thing that's like, oh, it's nice."}, {"time": 873, "text": "It's like a nice little feature."}, {"time": 875, "text": "Well, I mean, when people use the phrase hard problem, I mean, they mean in a somewhat technical sense that it's trying to explain something that seems fundamentally unavailable to third party objective analysis, right?"}, {"time": 893, "text": "I'm the only one that can get inside my head and I can tell you a lot about what's happening inside my head right now, it's reflected in what I'm saying, and you can try to deduce things about what's going on inside my head, but you don't have access to it in the way that I do."}, {"time": 906, "text": "And so it seems like a fundamentally different kind of problem from the ones that we have successfully dealt with over the course of centuries in science, where we look at the motion of the moon, everybody can look, everybody can measure it."}, {"time": 918, "text": "We look at the properties of hydrogen when you shine lasers on it, everybody can look at the data and understand it."}, {"time": 965, "text": "And however mysterious that feels right now, I think for instance, when we start to build conscious systems, things that you're more familiar with than I am, when we start to build these artificial systems and those systems report to us, I'm feeling sad, I'm feeling anxious, yeah, there's a world going on inside here, I think the mystery of consciousness will just begin to evaporate."}, {"time": 990, "text": "Well, that's, first of all, beautifully put, and I agree with you completely, just the way you said it, it'll begin to evaporate."}, {"time": 998, "text": "I have built quite a few robots and have had them do emotion, emotional type things, and it's immediate that exactly what you're saying, this kind of mystery of consciousness starts to evaporate, that the kind of need to truly understand, to solve the hard problem of consciousness disappears, because, well, I don't really care if I understand what can solve the hard problem of consciousness."}, {"time": 1027, "text": "That thing sure as heck looks conscious."}, {"time": 1029, "text": "I feel like that way when I interact with a dog."}, {"time": 1032, "text": "I don't need to solve the problem of consciousness to be able to interact and richly enjoy the experience with this other living being."}, {"time": 1044, "text": "Obviously, same thing with other humans."}, {"time": 1046, "text": "I don't need to fully understand it."}, {"time": 1047, "text": "And there's some aspect, maybe this is a little bit too engineering focused, but there's some aspect in which it feels like consciousness is just a nice trick to help us communicate with each other."}, {"time": 1061, "text": "It sounds ridiculous to say, but sort of the ability to experience the world is very useful, in a subjective sense, is very useful to put yourself in that world and to be able to describe the experience to others."}, {"time": 1079, "text": "It could be just a social and the merge."}, {"time": 1081, "text": "Obviously, animals, the sort of more primitive animals might experience consciousness in some more primitive way, but this kind of rich, subjective experience that we think about as humans, I think it's probably deeply coupled with language and poetry."}, {"time": 1097, "text": "Yeah, that resonates with my view as well."}, {"time": 1100, "text": "I mean, there's a scientist, maybe you've spoken to him, Michael Graziano from Princeton."}, {"time": 1105, "text": "Yeah, he's developed ideas of consciousness that, look, I don't think they solve the problem, but I think they do illuminate it in an interesting way where basically we are not aware of all the underlying physiochemical processes that make our brains and our inner worlds tick the way they do."}, {"time": 1128, "text": "And because of that dissociation between sensation and the physics of it and the chemistry of it and the biology of it, it feels like our minds and our inner worlds are just untethered, like floating somewhere in this gray matter inside of our heads."}, {"time": 1146, "text": "And the way I like to think of it is like, look, if you were in a dark room, right, and I had glow in the dark paint on my fingers, so all you saw was my fingers dancing around, there'd be something mysterious."}, {"time": 1161, "text": "How could those fingers be doing that?"}, {"time": 1164, "text": "And then you turn on the light, you realize, oh, there's this arm underlying it, and that's the deep physical connection explains it all."}, {"time": 1170, "text": "And I think that's what we're missing, the deep physical connection between what's happening up here and what is responsible for it in a physical, chemical, biological way."}, {"time": 1181, "text": "And so to me, that at least gives me some understanding of why consciousness feels so mysterious because we are suppressing all of the underlying science that ultimately is responsible for it."}, {"time": 1193, "text": "And one day we will reveal that more fully, and I think that will help us tether this experience to something quite tangible in the world."}, {"time": 1201, "text": "I wonder if the mystery is an important component of enjoying something."}, {"time": 1210, "text": "So once we know how this thing works, maybe we will no longer enjoy this conversation."}, {"time": 1219, "text": "We'll seek other sources of enjoyment, but this is, again, from an engineering perspective, I wonder if the mystery is an important component."}, {"time": 1229, "text": "Well, have you ever seen, there's this beautiful interview that Richard Feynman did, great Nobel laureate physicist responsible for a lot of our understanding of quantum mechanics, quantum field theory and so forth."}, {"time": 1243, "text": "And he was in a conversation with an interviewer where he noted that some people feel like once the mystery is gone, once science explains something, the beauty goes away, the wonder of it goes away."}, {"time": 1258, "text": "And he was emphasizing in his response to that, he's like, no, that's not the right way of thinking about it."}, {"time": 1265, "text": "He says, look, when I look at a rose, he says, yeah, I can still deeply enjoy the aroma, the color, the texture."}, {"time": 1273, "text": "He says, but what I can do that you can't, if you're not a physicist, I can look more deeply and understand where the red comes from, where the aroma comes from, where the structure comes from."}, {"time": 1282, "text": "He says, that only augments my wonder."}, {"time": 1287, "text": "It only augments my experience."}, {"time": 1289, "text": "It doesn't flatten it or take away from it."}, {"time": 1292, "text": "So I sort of take that as a bit of a motto in some sense that there is a wonder that comes from a kind of ignorance."}, {"time": 1303, "text": "And I don't mean that in a derogatory sense, but just from not knowing."}, {"time": 1307, "text": "So there is a wonder that comes from mystery."}, {"time": 1309, "text": "There's another kind of wonder that comes from knowing and deep knowing."}, {"time": 1315, "text": "And I think that kind of wonder has its own special character that in some ways can be more gratifying."}, {"time": 1324, "text": "I hope he's right."}, {"time": 1327, "text": "But there's also, I remember he said something about like science is an onion or something like that."}, {"time": 1333, "text": "You can peel back, you can keep peeling back."}, {"time": 1336, "text": "I mean, there is also, when you understand something, there's always a sense that there's more mystery to understand."}, {"time": 1343, "text": "Like you never get to the bottom of the mystery."}, {"time": 1347, "text": "But I think it's also different than, you know, I don't think you can analogize say to a magician, right?"}, {"time": 1353, "text": "A magician does some trick."}, {"time": 1355, "text": "You learn how it sounds like, oh my God, that's ridiculous when you find."}, {"time": 1396, "text": "Yeah, it's very possible then say in physics that we arrive at a theory of everything that unifies the laws of physics and has a very strong understanding of the fabric of reality, even like from the big bang to today, it's possible that that understanding is only going to elevate our appreciation of this whole thing."}, {"time": 1417, "text": "Yeah, I think it will."}, {"time": 1419, "text": "I mean, I think it has so far."}, {"time": 1420, "text": "But the other side of it which you emphasize is it's not like science somehow reaches an end, right?"}, {"time": 1428, "text": "There are certain categories of questions that do reach an end."}, {"time": 1432, "text": "I think we one day will close the book on nature's ingredients and the fundamental laws."}, {"time": 1437, "text": "Now that we can't prove that, maybe it goes on forever, smaller and smaller, maybe there are deeper and deeper laws, but I don't think so."}, {"time": 1443, "text": "I think that there's going to be a collection of ingredients and a collection of basic laws."}, {"time": 1448, "text": "That chapter will close, but it's one chapter."}, {"time": 1452, "text": "Now we take that knowledge and we try to understand how the world builds the structures that it does, from planets to people to black holes to the possibility of other universes and every step of the way, the collection of questions that we don't know the answer to only blossoms."}, {"time": 1472, "text": "And so there's a deep sense of gratification from understanding certain qualities of the world."}, {"time": 1479, "text": "But I would say that if you take a ratio of what we understand to the things that we know that we don't yet understand, that ratio keeps getting smaller and smaller because the things that we know that we don't understand grows larger and larger."}, {"time": 1494, "text": "Do you have a hope that we solve that theory of everything puzzle in the next few decades?"}, {"time": 1500, "text": "So there's been a bunch of attempts from string theory to all kinds of attempts at trying to solve quantum gravity or basically come up with a theory for quantum gravity."}, {"time": 1510, "text": "There's a lot of complexities to this."}, {"time": 1513, "text": "One, for experimental validation, you have to observe effects that are very difficult to measure."}, {"time": 1520, "text": "So you have to build, like that's like an engineering challenge."}, {"time": 1523, "text": "And then there's the theory challenge, which is like, it seems very difficult to connect the laws of gravity to quantum mechanics."}, {"time": 1531, "text": "Do you have a hope or are we hopelessly stuck?"}, {"time": 1535, "text": "Well, I have to have to have a hope."}, {"time": 1537, "text": "I mean, it's in some sense, but I devote at least part of my professional life toward trying to make progress on."}, {"time": 1545, "text": "And I'm glad you used the phrase quantum gravity."}, {"time": 1547, "text": "I'm not a great fan of the theory of everything phrase because it does make other scientists feel like if they're not working on this, what are they working on?"}, {"time": 1555, "text": "Man's like, there's not much left when you're talking about theory of everything."}, {"time": 1558, "text": "Biology is just small details we'll figure out."}, {"time": 1561, "text": "Yeah, so it is really trying to put gravity and quantum mechanics together."}, {"time": 1566, "text": "And since I was a college kid, I was deeply fascinated with gravity."}, {"time": 1572, "text": "And as I learned quantum mechanics, the notion of physicists being stumped and trying to blend them together, how could one not get fired up about maybe contributing something to that journey?"}, {"time": 1585, "text": "And so we've been on this, I've been on this for 30 years since I was a student."}, {"time": 1589, "text": "We have made progress."}, {"time": 1591, "text": "We do have ideas."}, {"time": 1592, "text": "You mentioned string theory is one possible scenario."}, {"time": 1596, "text": "It's not stuck."}, {"time": 1597, "text": "String theory is a vibrant field of research that is making incredible progress, but we've not made progress on this issue of experimental verification validation, which is, you know, it is a vital part of the story."}, {"time": 1613, "text": "So I would have hoped that by now we would have made contact with observation."}, {"time": 1618, "text": "If you would have interviewed me back in the 80s when I was, you know, a wild bright eyed kid trying to make headway working 18 hours a day and this sort of stuff, I would have said, yeah, by 2021, yeah, we're gonna know whether it's right or wrong."}, {"time": 1632, "text": "We'll have made contact."}, {"time": 1633, "text": "I would have said, look, there may be certain mathematical puzzles that we've yet to work out, but we'll know enough to make contact with experiment."}, {"time": 1639, "text": "That has not happened."}, {"time": 1641, "text": "On the other hand, if you would have interviewed me back then and asked me, will we be able to talk about detailed qualities of black holes and understand them at the level of detail that we actually, I would have said, no, I don't think that we're gonna be able to do that."}, {"time": 1659, "text": "Will we have an exact formulation of string theory in certain circumstances?"}, {"time": 1663, "text": "No, I don't think we're gonna have that, and yet we do."}, {"time": 1666, "text": "So it's just to say, you don't know where the progress is going to happen, but yes, I do hold out hope that maybe before I move on to wherever, I don't think there is an after, but I would love before I leave this earth to know the answer, but science and the universe, it's not about pleasing any individual, it is what it is."}, {"time": 1691, "text": "And so we just press onward and we'll see where it goes."}, {"time": 1695, "text": "So in terms of string theory, if I just look from an authoritative perspective currently at the theoretical physics community, string theory as a theory has been very popular for a few decades, but has recently fallen out of favor, or at least there's been like, you know, it became more popular to kind of ask the question, is string theory really the answer?"}, {"time": 1719, "text": "Where do you fall on this?"}, {"time": 1720, "text": "Like, how do you make sense of this puzzle?"}, {"time": 1723, "text": "Why do you think it's fallen out of favor?"}, {"time": 1725, "text": "Yeah, so I would actually challenge the statement that it's fallen out of favor."}, {"time": 1730, "text": "I would say that any field of research when it's new and it's the bright, shiny bicycle that no one has yet seen on that block, yeah, it's gonna attract attention and the news outlets are gonna cover it and students are gonna flock to it, sure."}, {"time": 1749, "text": "But as a field matures, it does shed those qualities because it's no longer as novel as it was when it was first introduced 30, 40 years ago, but you need to judge it by a different standard."}, {"time": 1762, "text": "You need to judge it by is it making progress on foundational issues deepening our understanding of the subject and by that measure, string theory is scoring very high."}, {"time": 1776, "text": "Now, at the same time, you also need to judge whether it makes contact with experiment as we discussed before too and in that measure, we're still challenged."}, {"time": 1785, "text": "So I would say that many string theorists, myself included, are very sober about the theory."}, {"time": 1794, "text": "It has the tremendous progress that it had 30, 40 years ago that hasn't gone away, but we become better equipped at assessing the long journey ahead and that was something that we weren't particularly good at back, say, in the 80s."}, {"time": 1810, "text": "Look, when I was just starting out in the field, there was a sense of physics is about to end."}, {"time": 1818, "text": "String theory is about to be the be all and end all final unified theory and that will bring this chapter to a close."}, {"time": 1827, "text": "Now, I have to say, I think it was more the younger physicists who were saying that."}, {"time": 1831, "text": "Some of them were seasoned, even if they were pro string theory at the time."}, {"time": 1835, "text": "I don't know if they were rolling their eyes, but they knew that it was gonna be a long, long journey."}, {"time": 1841, "text": "I think people like John Schwartz, one of the founders of string theory, Michael Green, no relation to me, founders of the theory, Edward Witten, one of the main people driving the theory back then and today."}, {"time": 1853, "text": "I think they knew that we were in for a long haul and that's the nature of science, quick hits that resolve everything few and far between."}, {"time": 1866, "text": "And so if you were in for the quick solution to the big questions of the world, then you would have been disappointed and I think there were people who were disappointed and moved on and work on other subjects."}, {"time": 1879, "text": "If you're in in the way that Einstein was in for a lifetime of investigation to try to see what the answers to the deep questions would be, then I think string theory has been a rich source of material that has kept so many people deeply engaged in moving the frontier forward."}, {"time": 1901, "text": "There's a few qualities about string theory, which are weird."}, {"time": 1905, "text": "I mean, a lot of physics is just weird and beautiful."}, {"time": 1908, "text": "So let me ask the question, what do you use most beautiful about string theory?"}, {"time": 1913, "text": "Well, what attracted me to the theory at the outset beyond it's putting gravity and quantum mechanics together, which I think is its true claim to fame, at least on paper, it's able to do that."}, {"time": 1926, "text": "What attracted me to the theory was the fact that it requires extra dimensions of space."}, {"time": 1931, "text": "And this was an idea that intrigued me in a very deep way, even before I really understood what it meant."}, {"time": 1940, "text": "I somehow had, I mean, talk about sort of the emotional part of consciousness and the cognitive part in some, perhaps you call it strange, in some strange emotional way, I was enamored with Einstein's general relativity, the idea of curved space and time before I really knew what it meant."}, {"time": 1959, "text": "It just spoke to me, I don't know how else to say it."}, {"time": 1963, "text": "And then when I subsequently learned that people had thought about more dimensions of space than we can see and how those extra dimensions would be vital to a deep understanding of the things that we do see in this world, four, five, six dimensions might explain why there are certain forces and particles and how they behave."}, {"time": 1983, "text": "To me, this was like amazing, utterly amazing."}, {"time": 1986, "text": "And then when I learned that string theory embraced all these ideas, embraced the general theory of relativity, embraced quantum mechanics, embraced the possibility of extra dimensions, then I was hooked."}, {"time": 2023, "text": "And it was a heady, heady time."}, {"time": 2026, "text": "And that kind of excitement has sort of filtered through over the decades."}, {"time": 2031, "text": "But I'd say that's really the part of the theory that I think really hooked me most strongly."}, {"time": 2040, "text": "How are we supposed to think about those extra dimensions?"}, {"time": 2042, "text": "I was supposed to imagine actual physical reality or is this more in the space of mathematics that allows you to sort of come up with tricks to describe the four dimensional reality that we more directly perceive?"}, {"time": 2057, "text": "No one really knows the answer, of course, but if I take the most straightforward approach to string theory, you really are imagining that these dimensions are there, they're real."}, {"time": 2068, "text": "I mean, just as you would say that the three space dimensions around us, left, right, back, forth, up, down, yeah, they're real, they're here."}, {"time": 2077, "text": "We are immersed within those dimensions."}, {"time": 2080, "text": "These other dimensions are as real as these with the one difference being their shape and their size differs from the shape and size of the dimensions that we have direct access to through human experience."}, {"time": 2094, "text": "And one approach imagines that these extra dimensions are tightly coiled up, curled up, crushed together, if you will, into a beautiful geometrical form that's all around us, but just too small for us to detect with our eyes, too small for us to detect even with the most powerful equipment that we have."}, {"time": 2116, "text": "Nevertheless, according to the mathematics, the size and the shape of those extra dimensions leaves an imprint in the world that we do have access to."}, {"time": 2124, "text": "So one of the ways that we have hoped yet to achieve to make contact with experimental physics is to see a signature of those extra dimensions in places like the Large Hadron Collider in Geneva, Switzerland."}, {"time": 2138, "text": "And it hasn't happened yet, doesn't mean it won't happen, but that would be a stunning moment in the history of the species if data that we acquired in these dimensions gives us kind of incontrovertible evidence that these dimensions are not the only dimensions."}, {"time": 2155, "text": "I mean, how mind blowing would that be?"}, {"time": 2159, "text": "So with the Large Hadron Collider, it would be something in the movement of the particles or also the gravitational waves potentially be a place where you can detect signs of multiple dimensions, like with something like LIGO, but much more accurate."}, {"time": 2172, "text": "In principle, all of these can work."}, {"time": 2174, "text": "So one of the experiments that we had high hopes for, but by high hopes, I'm actually exaggerating."}, {"time": 2180, "text": "One of the experiments that we imagined might in the best of all circumstances, yield some insight."}, {"time": 2187, "text": "We weren't with bated breath waiting for the result."}, {"time": 2190, "text": "We knew it was a long shot."}, {"time": 2191, "text": "When you slam protons together at very high speed of the Large Hadron Collider, if there are these extra dimensions and if they have the right form, and that's a hypothesis that may not be correct, but when the protons collide, they can create debris, energetic debris that can in some sense leave our dimensions and insert itself into the other dimensions."}, {"time": 2213, "text": "And the way you'd recognize that is, there'd be more energy before the collision and after the collision because the debris would have taken energy away from the place where our detectors can detect it."}, {"time": 2226, "text": "So that's one real concrete way that you could find evidence for extra dimensions."}, {"time": 2232, "text": "But yeah, since extra dimensions are of space and gravity is something that exists within, in fact is associated with the shape of space, gravitational waves in principle can provide a kind of cat scan of the extra dimensions if you had sufficient control over those processes."}, {"time": 2255, "text": "We don't yet, but perhaps one day we will."}, {"time": 2258, "text": "Does it make you sad a little bit?"}, {"time": 2261, "text": "Maybe looking out into the future, you mentioned Ed Witten that no Nobel prizes have been given yet related to string theory."}, {"time": 2268, "text": "Do you think they will be?"}, {"time": 2270, "text": "Do you think you have to have experimental validation or can a Nobel prize be given?"}, {"time": 2275, "text": "Which I don't think has been given for quite a long time for purely sort of theoretical contribution."}, {"time": 2281, "text": "Yeah, it's certainly as a matter of historical precedent has been the case that those who win the prize have established, investigated, illuminated a demonstrably real quality of the world."}, {"time": 2298, "text": "So gravitational waves, the prize was awarded after they were detected, not the mathematics of it, but the actual detection of it."}, {"time": 2308, "text": "The Higgs particle, it was an idea that came from the 1960s, Peter Higgs and others in fact."}, {"time": 2316, "text": "And it wasn't until 2012 on July 4th when the announcement came that this particle had been detected at the Large Hadron Collider that people viewed it as eligible for the Nobel prize."}, {"time": 2329, "text": "The idea was there, the math was there, but you needed to confirm it."}, {"time": 2332, "text": "Indeed, the prize ultimately was awarded."}, {"time": 2335, "text": "So I'm not surprised."}, {"time": 2336, "text": "In fact, I would have been surprised if a Nobel prize had been awarded in the arena of string theory because it's far too speculative right now."}, {"time": 2347, "text": "It's far too hypothetical."}, {"time": 2349, "text": "In fact, I am sympathetic to the view that it really shouldn't be called string theory."}, {"time": 2355, "text": "It degrades the word theory because theory in science, of course, means the best available explanation for the things that we observe in the world, the things that we measure in experiments about the world."}, {"time": 2370, "text": "And string theory does not do that, at least not yet."}, {"time": 2374, "text": "So it really should be the string hypothesis, right?"}, {"time": 2377, "text": "We're at an earlier stage of development and that's not the kind of thing that Nobel prizes should be awarded for."}, {"time": 2385, "text": "What do you think about the critics out there, Peter White, he's from Columbia too, I think Sabine Hafenstatter."}, {"time": 2393, "text": "Is that a healthy thing or should we sort of focus on sort of the optimism of these hypotheses?"}, {"time": 2399, "text": "Yeah, it's actually a good way that you frame it because I'm always somewhat repelled by views of the world that start from the negative."}, {"time": 2414, "text": "Try to cut down an idea, try to say that's the wrong way of thinking about things and so on."}, {"time": 2421, "text": "I'm much more drawn, maybe because I'm an optimist, I don't know, I'm much more drawn to those who go out into the world with new ideas."}, {"time": 2430, "text": "And don't try to cut down one idea, but rather present another one that might be better."}, {"time": 2438, "text": "And so you make the first idea, maybe string theory irrelevant because you've come up with the better approach to the world."}, {"time": 2447, "text": "So do I think it's healthy?"}, {"time": 2449, "text": "Look, I think having a wide range of views and perspectives is generally a healthy thing."}, {"time": 2456, "text": "I think it's good to have arguments within a subject in order that you stay fresh and you stay focused on the things that matter."}, {"time": 2466, "text": "But in the end of the day, I think it's a more vital contribution to give us something new rather than to criticize something that's there."}, {"time": 2475, "text": "Yeah, I'm totally with you."}, {"time": 2477, "text": "But it could be just the nature of being an optimist and also just a love of engineering."}, {"time": 2484, "text": "It helps nobody by criticizing the rocket that somebody else built, just build a bigger, cheaper, better rocket."}, {"time": 2496, "text": "And that seems to be how human civilization can progress effectively."}, {"time": 2501, "text": "We've mentioned the second law of thermodynamics."}, {"time": 2504, "text": "I gotta ask you about time."}, {"time": 2507, "text": "And do you think of time as emergent or fundamental to our universe?"}, {"time": 2513, "text": "I like to think of it as emergent."}, {"time": 2516, "text": "I don't have a solid reason for that perspective."}, {"time": 2520, "text": "I have a lot of hints of reasons that some of which come out of string theory and quantum gravity that perhaps would be worth talking about."}, {"time": 2529, "text": "But what I would say is, time is the most familiar quality of experience because there's nothing that takes place that doesn't take place within an interval of time."}, {"time": 2542, "text": "And yet at the same time, it is perhaps the most mysterious quality of the world."}, {"time": 2548, "text": "So it's a wonderful confluence of the familiar and the deeply mysterious all in one little package."}, {"time": 2555, "text": "If you were to ask me, what is time?"}, {"time": 2559, "text": "I don't think anybody does."}, {"time": 2561, "text": "I can say what time gives us, it allows us the language for talking about change."}, {"time": 2568, "text": "It allows us to envision the events of the universe being spread out in this temporal timeline."}, {"time": 2575, "text": "And in that way, allows us to see the patterns that unfold within time."}, {"time": 2581, "text": "I mean, time allows us the structure and the organization to think about things in that kind of a progression."}, {"time": 2588, "text": "But what actually is it?"}, {"time": 2592, "text": "And that's so strange because we can measure it, right?"}, {"time": 2596, "text": "I mean, there are laboratories in the world that measure this thing called time to spectacular precision."}, {"time": 2604, "text": "But if you go up to the folks and say, what is it that you're actually measuring?"}, {"time": 2611, "text": "I don't know that they can really articulate the kind of answer that you would expect from those who are engineering a device that can measure something called time to that level of precision."}, {"time": 2623, "text": "So it's a very curious combination."}, {"time": 2626, "text": "What do you make of the one way feeling of causality?"}, {"time": 2631, "text": "Like is causality a thing or is that too just a human story that we put on top of this emergent phenomenon of time?"}, {"time": 2642, "text": "I can give you my guess and my intuition about it."}, {"time": 2645, "text": "I do think that at the macroscopic level, if we're talking about sort of the human experience of time, I do think at the macroscopic level, there is a fundamental notion of causality that does emerge from a starting point that may not have causality built in."}, {"time": 2661, "text": "So I certainly would allow that at the deepest description of reality when we finally have that on the table, we may not see causality directly at that fundamental level."}, {"time": 2673, "text": "But I do believe that we will understand how to go from that fundamental level to a world where at the macroscopic level, there is this notion of A causes B."}, {"time": 2684, "text": "A notion that Einstein deeply embraced in his special theory of relativity where he showed that time has qualities that we wouldn't expect based on experience."}, {"time": 2694, "text": "You and I, if we move relative to each other, our clocks tick off time at different rate."}, {"time": 2699, "text": "And our clocks is just a means of measuring this thing called time."}, {"time": 2703, "text": "So this is really time that we're talking about."}, {"time": 2705, "text": "Time for you and time for me are different if we're in relative motion."}, {"time": 2709, "text": "He then shows in the general theory of relativity that if we're experiencing different gravity, different gravitational fields or actually more precisely different gravitational potentials, time will elapse for us at different rates."}, {"time": 2721, "text": "These are things that are astoundingly strange that give rise to a scientific notion of time travel."}, {"time": 2729, "text": "Okay, so this is how far Einstein took us in wiping away the old understanding of time and injecting a new understanding of its qualities."}, {"time": 2740, "text": "So there's so much about time that's counterintuitive, but I do not think that we're ever going to wipe away causality at the macroscopic level."}, {"time": 2750, "text": "At the macroscopic, I mean, there's so many interesting things at the macroscopic level that may only exist at the macroscopic level."}, {"time": 2756, "text": "Like we already talked about consciousness that very well could be one of the things."}, {"time": 2761, "text": "You mentioned time travel."}, {"time": 2762, "text": "So, I mean, according to Einstein and in general, what types of travel do you think our physical universe allows?"}, {"time": 2774, "text": "Well, it certainly allows time travel to the future."}, {"time": 2777, "text": "And I'm not talking about the silly thing that you and I are now going into the future second by second by second."}, {"time": 2782, "text": "I'm talking about really the diversion that you see in Hollywood, at least in terms of its net effect, whereby an individual can follow an Einsteinian strategy and propel themselves into the future in some sense more quickly."}, {"time": 2802, "text": "So if I wanted to see what's happening on planet Earth one million years from now, Einstein tells me how to get one million years from now."}, {"time": 2812, "text": "Build a ship."}, {"time": 2813, "text": "I got to turn to guys who know how to build stuff."}, {"time": 2816, "text": "I can't do it like you."}, {"time": 2817, "text": "Build a ship that can go out into the universe near the speed of light, turn around and come back."}, {"time": 2822, "text": "Let's say it's a six month journey out and a six month journey back."}, {"time": 2825, "text": "And Einstein tells me how fast I need to travel, how close to the speed of light I need to go so that when I step out of my ship, it will now be one million years into the future on planet Earth."}, {"time": 2840, "text": "And this is not a controversial statement, right?"}, {"time": 2843, "text": "This is not something where there's differences of opinion in the scientific community."}, {"time": 2848, "text": "Any scientist who knows anything about what Einstein taught us agrees with what I just said."}, {"time": 2855, "text": "It's commonplace, it's bread and butter physics."}, {"time": 2857, "text": "And so that kind of travel to the future is absolutely allowed by the laws of physics."}, {"time": 2864, "text": "There are engineering challenges, there are technological challenges."}, {"time": 2867, "text": "They're close to the speed of light part, yeah."}, {"time": 2869, "text": "Yeah, and there are even biological challenges, right?"}, {"time": 2872, "text": "They're G forces that you're gonna experience."}, {"time": 2875, "text": "So there's all sorts of stuff embedded in this, but those I will call the details."}, {"time": 2881, "text": "And those details, notwithstanding, the universe allows this kind of travel to the future."}, {"time": 2887, "text": "And if I could pause real quick, you could also, at the macro level, with biology extend the human lifespan to do a kind of travel forward in time."}, {"time": 2899, "text": "If you expand how long we live, that's a way to, from a perspective of an observer, a conscious observer that is a human being, you're essentially traveling forward in time by allowing yourself to live long enough to see the thing."}, {"time": 2912, "text": "So that's in the space of biology."}, {"time": 2914, "text": "What about traveling back in time?"}, {"time": 2917, "text": "Yeah, that is a natural next question, especially if you're going on one of these journeys."}, {"time": 2925, "text": "Is it a one way journey or can you come back?"}, {"time": 2928, "text": "And the physics community doesn't speak with a unified voice on this as yet, but I would say that the dominant perspective is that you cannot get back."}, {"time": 2940, "text": "Now, having said that, there are proposals that serious people have written papers on regarding hypothetical ways in which you could travel to the past."}, {"time": 2950, "text": "And we've seen some of these."}, {"time": 2953, "text": "Again, Hollywood loves to take the most sexy ideas of physics and build narratives around them."}, {"time": 2960, "text": "This idea of a wormhole, like Jodie Foster in Contact went through a wormhole, Deep Space Nine Star, I'm sure there are many other examples for these ideas that I've probably never even seen."}, {"time": 2970, "text": "But with wormholes, there's at least a proposal of how you could take a wormhole tunnel through space time, manipulate the openings of the wormhole in such a way that the openings are no longer synchronous."}, {"time": 2984, "text": "They are out of sync relative to each other, which would mean one's ahead and one's behind, which means if you go through one direction, you travel to the future."}, {"time": 2991, "text": "If you go back, you travel to the past."}, {"time": 2994, "text": "Now, we don't know if there are wormholes in the world."}, {"time": 2997, "text": "But they're possible according to Einstein, correct?"}, {"time": 2999, "text": "They are possible according to Einstein."}, {"time": 3001, "text": "But even Einstein was very quick to say, just because my math allows for something, doesn't mean it's real."}, {"time": 3008, "text": "I mean, he famously didn't even believe in black holes."}, {"time": 3010, "text": "Didn't believe in the Big Bang, right?"}, {"time": 3012, "text": "And yet the black hole issue has really been settled now."}, {"time": 3017, "text": "We have radio telescopic photographs of the black hole in M87."}, {"time": 3022, "text": "It was in newspapers around the world just a couple of years ago."}, {"time": 3026, "text": "So it's just to say that just because it's in Einstein's math, it doesn't mean it's real."}, {"time": 3032, "text": "But yes, it is the case that wormholes are allowed by Einstein's equations."}, {"time": 3036, "text": "And in principle, you can imagine, you know, putting electric charges on the openings of the wormhole, allowing you to tow them around in a manner that could yield this temporal asymmetry between them."}, {"time": 3048, "text": "Maybe you tow one of the mouths to the edge of a black hole."}, {"time": 3051, "text": "In principle, you can do this, slowing down the passage of time near that black hole."}, {"time": 3056, "text": "And then when you bring it back, it will be well out of sync with the other opening and therefore could be a significant temporal gap between one and the other."}, {"time": 3067, "text": "But people who study this in more detail question, could you ever keep a wormhole open, assuming it does exist?"}, {"time": 3074, "text": "Could you ever travel through a wormhole or would there be a requirement to some kind of exotic matter to prop it open that perhaps doesn't exist?"}, {"time": 3084, "text": "So there are many, many issues that people have raised."}, {"time": 3088, "text": "And I would say that the general sentiment is that it's unlikely that this kind of scenario is going to survive our deeper understanding of physics when we finally have it."}, {"time": 3099, "text": "But that doesn't mean that the door is closed."}, {"time": 3101, "text": "So maybe there's a small possibility that this could one day be real."}, {"time": 3105, "text": "That's such an interesting way to put it."}, {"time": 3107, "text": "It will not, this kind of scenario will not survive deep understanding of physics."}, {"time": 3113, "text": "It's an interesting way to put it because it makes you wonder what kind of scenarios will be created by our deeper understanding of physics."}, {"time": 3124, "text": "Maybe, sorry to go crazy for a second, but if you have like the pan psychism idea that consciousness permeates all matter, maybe traveling in that, whatever laws of physics, the consciousness operates under something like that."}, {"time": 3140, "text": "In that view of the university, if we somehow are able to understand that part, maybe traveling is super easy."}, {"time": 3146, "text": "Yeah, it does not follow the constraints of the speed of light, something like this."}, {"time": 3152, "text": "Yeah, so look, I have a definite degree of sympathy with the possibility that consciousness might be more than what we described earlier as just the byproduct of mindless particles."}, {"time": 3168, "text": "You just made the rock happy."}, {"time": 3170, "text": "Exactly, so it isn't the approach that feels to me the most likely, but I see the logic."}, {"time": 3179, "text": "If you've got the puzzle, how to mindless particles build mind, one resolution might be the particles are not mindless."}, {"time": 3188, "text": "The particles have some kind of proto conscious quality."}, {"time": 3190, "text": "So there's something appealing about that straightforward solution to the puzzle."}, {"time": 3196, "text": "And if that's the case, if we do live in a pan psychist world where there is a degree of consciousness residing in everything in the world around us, then yes, I do think some interesting possibilities might emerge where maybe there's a way of communing with physical reality in a deeper way than we have so far."}, {"time": 3216, "text": "I mean, we as human beings, a vital part of our existence is human to human communication, contact."}, {"time": 3223, "text": "We live in social groups and that's what it's allowed us to get to the place where we've gotten."}, {"time": 3228, "text": "Imagine that we have long missed that there's other consciousness out there and some kind of relationship or communion with that larger conscious possibility would take us to a different place."}, {"time": 3241, "text": "Now, do I buy into this yet?"}, {"time": 3243, "text": "I don't, I don't see any evidence for it, but do I have an open mind and allow for the possibility in the future?"}, {"time": 3253, "text": "So if that's not the case and you have these simple particles that at the macro level emerges some interesting stuff like consciousness, another thing you write about in the Until the End of Time book is the thing that it seems to emerge at the macro level is the feeling like there's a free will, like we decide to do stuff."}, {"time": 3276, "text": "And you have a really interesting take here, which is, no, there's not a free will."}, {"time": 3283, "text": "I'm just gonna speak for you and then you can correct me."}, {"time": 3285, "text": "No, there's not a free will, but there is an experience of freedom."}, {"time": 3294, "text": "Which I really love."}, {"time": 3296, "text": "So where does the experience, where does freedom come from if we don't have any kind of physics based free will?"}, {"time": 3302, "text": "Yeah, and so the idea follows naturally from all that we've been talking about."}, {"time": 3308, "text": "Let's make the assumption that all there is in the physical universe is stuff governed by laws."}, {"time": 3315, "text": "We may not have those laws, may not know what the fundamental stuff is yet, but everything we know in science points in the direction that it's physical stuff governed by universal laws."}, {"time": 3327, "text": "And that being the case, or that being the assumption, then you come to a particular collection of those ingredients called a human being."}, {"time": 3335, "text": "And that human being has particles that are fully governed by physical law."}, {"time": 3341, "text": "And when you then recognize it, every thought that we have, every action that we undertake is just the motion of particles."}, {"time": 3349, "text": "When I'm thinking thoughts right now, of course, at this level of description, it is the motion of particles cascading down various neurons inside of my head and so on."}, {"time": 3359, "text": "And every single one of those motions, collectively and individually, is fully governed by these laws that we perhaps don't have yet, but we imagine one day we will."}, {"time": 3372, "text": "That leaves no opportunity for any kind of freedom to break free from the constraint of physical law."}, {"time": 3379, "text": "And that is the end of the story."}, {"time": 3381, "text": "So the traditional intuitive notion of free will, that we're the ultimate authors of our actions, that we were the buck stops, that there is no antecedent, that is the cause for our decided to go left or right, choose vanilla or chocolate, live or die, that intuitive sensation does not have a basis in our understanding of the physical world."}, {"time": 3403, "text": "So that's the end of the free will of the traditional sort."}, {"time": 3407, "text": "But then your question is, what about this other kind of freedom I talk about?"}, {"time": 3412, "text": "And the other kind of freedom, if you focus on it intently, I think is actually the true version of freedom that we feel."}, {"time": 3422, "text": "And that freedom is this."}, {"time": 3424, "text": "You look at inanimate objects in the world, rocks, bottles of water, whatever, they have a very limited behavioral repertoire."}, {"time": 3434, "text": "Their internal organization is too coarse for them to do very much, right?"}, {"time": 3438, "text": "You try to have a conversation with a glass of water, you send sound waves, it doesn't do much."}, {"time": 3444, "text": "It may vibrate a little bit, but the repertoire of responses are incredibly limited."}, {"time": 3450, "text": "The difference between us and a rock or a bottle of water is that our inner organization, by virtue of eons of evolution by natural selection, is so refined, so spectacularly ordered, that we have a huge repertoire of behaviors that are finely attuned to stimuli from the external world."}, {"time": 3471, "text": "You ask me a question, that's a stimulus, and all of a sudden, these particle processes go into action, and this is the result, this answer that I'm giving you."}, {"time": 3480, "text": "So the freedom that we have is not from the control of physical law."}, {"time": 3485, "text": "The freedom that we have is from the constrained behavior that has long since governed inanimate objects."}, {"time": 3491, "text": "We are liberated from the limited behavioral repertoire of rocks and bottles of water to have this broad spectrum of responses."}, {"time": 3500, "text": "Do we pick them?"}, {"time": 3500, "text": "We do not."}, {"time": 3501, "text": "Do we freely choose them?"}, {"time": 3503, "text": "We do not, but yet we have them, and we can marvel at those behaviors, and that's the freedom that we have."}, {"time": 3511, "text": "The complexity and the breadth of that repertoire is where the freedom emerges."}, {"time": 3516, "text": "Is there something to be said about emergence?"}, {"time": 3520, "text": "I don't know if you know, I've looked at much about objects that I seem to love way more than anyone else, which is Sally or Tom, like game of life type of stuff."}, {"time": 3531, "text": "From simple things emerges beautiful complexities, and so that's that repertoire."}, {"time": 3538, "text": "It's like, it seems if you have enough stuff, just beautiful complexity emerges that sure as heck to our human eyes looks like there's consciousness there, there's free will, there's little objects moving about and making decisions."}, {"time": 3555, "text": "I mean, all of that, you can say it's anthropomorphization, but it sure as heck feels like they're organisms making decisions."}, {"time": 3565, "text": "What is that emergence thing?"}, {"time": 3567, "text": "Is that within the realm of physics to understand?"}, {"time": 3571, "text": "Is it within the realm of poetry?"}, {"time": 3576, "text": "What is that, like complex systems, emergence?"}, {"time": 3579, "text": "Will that ever be understood by science?"}, {"time": 3581, "text": "So here's the way that I think about it."}, {"time": 3583, "text": "So there are clearly qualities of the world that emerge on macroscopic scales, our sense of beauty, wonder, consciousness, all of these kinds of qualities."}, {"time": 3595, "text": "Do I feel that they ultimately are explainable from the laws of physics?"}, {"time": 3602, "text": "There is nothing that's not ultimately explainable with the laws of physics from this physicalist perspective, which is what I take."}, {"time": 3610, "text": "So you got the particles, you got the laws, and you have things that emerge from the choreographed motions of those particles."}, {"time": 3620, "text": "But is that the best language for talking about these emergent qualities?"}, {"time": 3627, "text": "If I was to take something even more mundane, like a baseball flying through the air, if I was to describe it in terms of the quarks and the electrons, I'd give you this mountain of data with 10 to the 28 particles and all of their coordinates and spaces a function of time."}, {"time": 3646, "text": "I hand you this mountain of data, you'd be like, I don't know what this is."}, {"time": 3649, "text": "And then if you really were clever and you're looking, oh, it's a baseball, just described in the least economical way possible."}, {"time": 3657, "text": "It is much more useful and insightful to talk about the baseball flying through the air."}, {"time": 3661, "text": "Similarly, there are things at the macroscopic level like human experience and human emotion and human action and the sensation of free will that we undeniably all have, even if it itself doesn't have a basis in our understanding of the physical world."}, {"time": 3679, "text": "It's useful to talk about things in this very human language."}, {"time": 3684, "text": "And so, yes, it's vital to talk about things in the poetic language of human experience, but do not lose sight of the fact, and some people do."}, {"time": 3691, "text": "They say, oh, it's just an emergent phenomenon."}, {"time": 3693, "text": "Don't lose sight of the fact that emergent phenomena are emerging from this deeper understanding that comes from the reductionist account of physical law."}, {"time": 3702, "text": "And there's a lot of insight to come from that, such as the freedom that you thought that you had, the freedom of will that you thought you had."}, {"time": 3710, "text": "It doesn't have a basis in that reductionist account, so it's not real."}, {"time": 3716, "text": "So speaking of the poetry of human experience, you mentioned the images of the black holes."}, {"time": 3721, "text": "How did it make you feel a few years ago when that first image came out?"}, {"time": 3724, "text": "It's truly amazing."}, {"time": 3726, "text": "A sense of, well, I guess the feeling was both amazing and there was a little sense of, jealousy is not quite the right word, but a sense of longing."}, {"time": 3739, "text": "Yeah, I think that's a better word, because here's a subject that started with Einstein back in 1915, writes down the equations of the general theory of relativity, and then there are scores of individuals over the decades, starting with people like Karl Schwarzschild who analyze the equations, see the possibility of black holes."}, {"time": 3760, "text": "People develop these ideas."}, {"time": 3761, "text": "John Wheeler, all these greats of physics."}, {"time": 3764, "text": "It's still a hypothetical subject."}, {"time": 3766, "text": "It gets closer to reality through observations of the center of our galaxy, stars whipping around in a manner that could only really be explained by there being a black hole in the center of our galaxy, but it was still indirect."}, {"time": 3778, "text": "To actually have a direct image that you can look at, what a beautiful arc, narrative arc from the theoretical to the absolutely established."}, {"time": 3790, "text": "And that's what we hope will happen with other areas, for instance, string theory, right?"}, {"time": 3795, "text": "I mean, wholly mathematical subject at the outset and still pretty much a wholly mathematical subject today."}, {"time": 3802, "text": "Yeah, do we long for that image where we can look at it and say, string, it's real."}, {"time": 3809, "text": "I mean, how thrilling, how thrilling to be part of that journey, to be part of that step that moves things from the abstract to the concrete."}, {"time": 3819, "text": "Yeah, so like the image of the DNA, the early images of the DNA, for example, but there is something special."}, {"time": 3827, "text": "So the problem with strings is they're tiny."}, {"time": 3830, "text": "So it's harder to take a picture in the following sense."}, {"time": 3834, "text": "When you think of a black hole, I mean, you have a swirl of, I guess, what is, I don't even know it's dust, whatever light."}, {"time": 3842, "text": "A careening onto the event horizon."}, {"time": 3844, "text": "And then there's darkness in the center."}, {"time": 3846, "text": "And you just imagine, so that picture in particular, I guess, is of a gigantic black hole."}, {"time": 3853, "text": "So you just, I mean, it's terrifying."}, {"time": 3856, "text": "Billions of times the mass of the sun."}, {"time": 3857, "text": "Yeah, so it's both exciting and terrifying."}, {"time": 3859, "text": "I mean, I don't know where you fall in the spectrum."}, {"time": 3862, "text": "I think it's exciting at first."}, {"time": 3864, "text": "Like the longer I think about it, every time I think about it, the more terrifying it becomes."}, {"time": 3869, "text": "So it always starts exciting and then it goes to terrifying."}, {"time": 3872, "text": "And both are feelings, very human feelings that I appreciate."}, {"time": 3878, "text": "It's like terrified awe."}, {"time": 3880, "text": "Somehow it's still beautiful."}, {"time": 3883, "text": "It's a good way of saying it."}, {"time": 3883, "text": "And I think I kind of share that reaction because there is a way in which when you work on this subject, like all the time, I teach it, I teach about black holes, write the equations on the blackboard."}, {"time": 3896, "text": "The ideas reside in a very cognitive, I don't know, mathematical portion of the brain, or at least for me."}, {"time": 3908, "text": "And it's only when you like sit down and it's quiet and you start to contemplate, wait, wait, wait, wait, this isn't just like a mathematical game."}, {"time": 3917, "text": "There are these monsters out there."}, {"time": 3919, "text": "Now I don't, not in a sense of I fear for my life, but it's a sense of how extraordinary is this universe."}, {"time": 3928, "text": "And so it is breathtaking."}, {"time": 3930, "text": "How powerful nature is."}, {"time": 3931, "text": "Yeah, how stupendously powerful nature is."}, {"time": 3937, "text": "And so there is a deep sense of humility that I think this instills if you really allow the ideas to sink in."}, {"time": 3948, "text": "Well, I have to ask about the most stupendously powerful thing to have ever happened in our universe, which is the Big Bang."}, {"time": 3956, "text": "What's up with the Big Bang?"}, {"time": 3957, "text": "So we can, I mean, with gravitational waves, the hope is you have more and more accurate measurements of the gravitational waves."}, {"time": 3966, "text": "You can crawl back further and further back in time towards the Big Bang."}, {"time": 3970, "text": "Do you have a hope that we'll be able to understand the early spark that created our universe?"}, {"time": 3978, "text": "Yeah, that and the deep interior of a black hole I think are the biggest mysteries that we hope the melding of quantum mechanics and gravity will reveal, will illuminate."}, {"time": 3992, "text": "And what question could be more captivating than why is there something rather than nothing, right?"}, {"time": 3999, "text": "Why is there a universe at all?"}, {"time": 4003, "text": "And will the theories that we're developing take us to an answer to that?"}, {"time": 4009, "text": "Even if we truly knew what the Big Bang is, and that's a big question in its own right, one would still be left with the question, well, okay, so you've explained the process by which a tiny nugget of a universe, a tiny nugget of space time can undergo some kind of growth to yield the world around us."}, {"time": 4030, "text": "But presumably in that explanation, you're gonna involve mathematics and some ingredients like quantum fields or matter or energy or something."}, {"time": 4041, "text": "Where did that stuff come from?"}, {"time": 4044, "text": "Can we get to that level of explanation?"}, {"time": 4046, "text": "I don't know, but it is remarkable that if you ask what happened a millionth of a second after the Big Bang, it's not really that controversial any longer, right?"}, {"time": 4060, "text": "Even though there's a lot of argument in the field and it's very heated right now I should say regarding what is the right theory of the Big Bang?"}, {"time": 4069, "text": "What is the right theory of early universe cosmology where I mean early, much earlier than a millionth of a second, a lot of dissent, a lot of heated arguments about that."}, {"time": 4081, "text": "No pun intended."}, {"time": 4082, "text": "Yeah, right, exactly."}, {"time": 4084, "text": "But you go like a millionth of a second after that and we're on pretty firm ground."}, {"time": 4090, "text": "Isn't that amazing, right?"}, {"time": 4092, "text": "To understand what happened from that point forward."}, {"time": 4095, "text": "But to go back is controversial."}, {"time": 4098, "text": "So there is this theory called inflationary cosmology, which I would say has been the dominant paradigm since early 1980s."}, {"time": 4107, "text": "Roughly 40 years now, it's been the dominant cosmological paradigm."}, {"time": 4111, "text": "And it makes use of a curious feature of Einstein's general theory of relativity, his theory of gravity, where Einstein shows us mathematically that gravity can not only be attractive, the kind of gravity that we're used to, things pulled together, but it can also be repulsive."}, {"time": 4127, "text": "And that fact is then leveraged by people like Alan Guth and Andre Linde, and at the time Paul Steinhardt and Andreas Albrecht and others to say, okay, if we had a little nugget in the earlier universe, which was filled with the stuff that yields this repulsive gravity, well, that would have blown everything apart."}, {"time": 4147, "text": "It would cause everything to swell."}, {"time": 4149, "text": "Beautiful explanation for what the bang in the big bang was."}, {"time": 4153, "text": "And then people mathematically analyze the consequences of this idea and they make predictions for tiny temperature differences across the night sky that in principle could be measured."}, {"time": 4164, "text": "You send up balloons, you send up satellites with very refined thermometers, and they measured the temperature of the night sky and the statistical distribution of the temperature differences agrees with the mathematical predictions."}, {"time": 4179, "text": "I mean, you just sort of have to stand in awe of this insight."}, {"time": 4184, "text": "So you think, aha, the theory has been established, but scientists are an incredibly skeptical bunch."}, {"time": 4194, "text": "And some scientists, including one of the people who helped develop the theory at the outset, Paul Steinhardt comes along and says, well, yeah, this theory has done pretty well so far, but there are aspects of this theory that are making me lose confidence."}, {"time": 4208, "text": "For instance, this theory seems to suggest that there might be other universes."}, {"time": 4213, "text": "Like, how do you make sense of a theory that suggests there are other universes?"}, {"time": 4216, "text": "Or there are others who come along and say, this theory seems to talk about length scales that are minuscule even by the so called Planck length, the sort of shortest length that we can imagine making sense of in a theory of quantum gravity."}, {"time": 4233, "text": "And so on and so forth, they develop a list of things that they consider to be chinks in the inflationary cosmological theory's armor."}, {"time": 4242, "text": "And they develop other ideas, which they claim yield the same predictions as inflationary cosmology for those temperature differences across space, but don't suffer from these problems."}, {"time": 4252, "text": "And then the inflationary cosmology folks say, no, no, no, hang on."}, {"time": 4256, "text": "Your theory suffers from different problems."}, {"time": 4259, "text": "And so the arguments goes, it's a healthy debate."}, {"time": 4262, "text": "Talk about real debates in science."}, {"time": 4265, "text": "So when you ask what's up with the Big Bang, I don't know right now."}, {"time": 4269, "text": "If you would have asked me five years ago, maybe even less than that, three or four years ago, I've said, look, inflationary cosmology has some issues, but the package of explanations it provides is so potent and the issues that beset it are seemingly solvable to me that I would imagine it's going to in the end, win out."}, {"time": 4292, "text": "I would still say that today, but I wouldn't say it as loudly."}, {"time": 4296, "text": "I wouldn't say it as confidently."}, {"time": 4298, "text": "I think it's worth thinking about alternate ideas and it could be the case that the paradigm at some point shifts."}, {"time": 4306, "text": "Does dark matter and dark energy fit into the shifting of the explanations for those?"}, {"time": 4312, "text": "Yeah, certainly."}, {"time": 4313, "text": "So dark energy has in the inflationary theory is kind of a big mystery."}, {"time": 4320, "text": "So dark energy is the observational realization in the last 20 years that not only is the universe expanding, it's expanding ever more quickly."}, {"time": 4331, "text": "Something is still pushing things outward."}, {"time": 4335, "text": "And the explanation is that there's like a residual version of the repulsive gravity from the early universe, but it's such a strange number."}, {"time": 4343, "text": "When you write that amount of dark energy using the relevant units in a theory of quantum gravity, it's a decimal point followed by like 120 zeros and then a one."}, {"time": 4354, "text": "We're not used to those kinds of numbers in physics."}, {"time": 4358, "text": "We're used to a half, one, pi, e squared to two."}, {"time": 4364, "text": "Those are the kinds of fundamental numbers that emerge in our explanations of the world."}, {"time": 4369, "text": "And we look at this bizarre number, decimal point, all these zeros and a one, we say something's wrong there."}, {"time": 4376, "text": "Like where would that number have come from?"}, {"time": 4379, "text": "And now there are people who suggest resolution to it."}, {"time": 4381, "text": "So it's not like we're totally in the dark on it, but those people like Paul Steinhard who have alternate cosmological theories, cyclic cosmologies as they call it, claim that they have a more natural explanation of the dark energy, that it naturally feeds into a cyclical process that is their cosmological paradigm."}, {"time": 4402, "text": "So yeah, if the cosmology should change, it's conceivable our view of dark energy may change from deeply mysterious to deeply integrated into a different paradigm."}, {"time": 4414, "text": "That is possible."}, {"time": 4415, "text": "I think it's Roger Penrose that think that information can bleed through from before the Big Bang to the after the Big Bang."}, {"time": 4422, "text": "Is the Big Bang like a full erasure of the hard drive or is there some information that could bleed through?"}, {"time": 4428, "text": "Yeah, I mean, so Roger is among the most creative thinkers of the last 100 years, rightly won the Nobel Prize for his insights into singularities in space time that we know to afflict our mathematical solutions of black holes in the Big Bang and so forth."}, {"time": 4448, "text": "And he has an enormously fertile imagination."}, {"time": 4453, "text": "And I mean that in the most positive sense."}, {"time": 4456, "text": "And so he has put forward this idea, this conformal cyclic cosmology, I think is the official title, although I could be getting that wrong."}, {"time": 4466, "text": "I can't say that I've studied it."}, {"time": 4467, "text": "I have seen lectures on it."}, {"time": 4470, "text": "I don't find it convincing as yet."}, {"time": 4473, "text": "It feels like it's being built to find a solution as opposed to sort of more naturally emerging."}, {"time": 4482, "text": "Maybe Roger would say otherwise."}, {"time": 4483, "text": "And I don't mean to in any way cast aspersions on the work."}, {"time": 4488, "text": "It's vital and interesting and people are thinking about it."}, {"time": 4491, "text": "I don't consider it as close a competitor to say the inflationary theory as for instance, the stuff that Paul Steinhardt has put forward."}, {"time": 4500, "text": "But again, you've got to keep an open mind in this business when there's so much that we don't yet understand."}, {"time": 4507, "text": "I mean, it is wild to think that information could survive something like that."}, {"time": 4510, "text": "Just like it is wild to imagine that information could escape a black hole, for example."}, {"time": 4516, "text": "It just seems like by construction, these things are supposed to not bleed out anything."}, {"time": 4524, "text": "But one of the challenges in all of these theories is when we talk about a singularity, has this real sexy term, the singularity."}, {"time": 4530, "text": "But a singularity is in more ordinary language, a physical system where the mathematics breaks down."}, {"time": 4539, "text": "It's nonsensical."}, {"time": 4541, "text": "It's like taking one divided by zero."}, {"time": 4542, "text": "You put that into a calculator and it says E error, right?"}, {"time": 4545, "text": "It does not make sense, doesn't compute."}, {"time": 4548, "text": "And so it's very hard to make definitive statements about things like the Big Bang or about black holes until we cure the mathematical singularities."}, {"time": 4559, "text": "And there are some who claim that in certain regimes, the singularities have been cured."}, {"time": 4565, "text": "I don't by any means think that there's consensus on these ideas."}, {"time": 4569, "text": "So when one talks about information sort of bleeding through the Big Bang, you've really got to make sure that the equations have no singularity."}, {"time": 4576, "text": "You talk about cyclic cosmology, you've got to make sure that the equations don't have any singularities as you go from, say, one cycle to the next."}, {"time": 4583, "text": "Now, some of the proponents of these theories claim that they have resolved these issues."}, {"time": 4587, "text": "I don't think that there's a general sense that that is the case as yet, but it could be that, look, life is so short that I haven't had the time to deeply delve into all the mathematical intricacies of all the ideas that have been put forward."}, {"time": 4600, "text": "If I did that, I'd never do anything else."}, {"time": 4602, "text": "But that's what the issue is."}, {"time": 4604, "text": "And of course, it's just math."}, {"time": 4605, "text": "There may be holes."}, {"time": 4607, "text": "There may be gaps in our understanding in the way we're modeling physical reality."}, {"time": 4615, "text": "Well, that's the point."}, {"time": 4616, "text": "In fact, when you said, I was about to jump in and say modeling, but you got there first, and it's exactly the right point."}, {"time": 4622, "text": "We're talking about the universe here, right?"}, {"time": 4624, "text": "And how do you talk about the universe with a straight face, mathematically?"}, {"time": 4629, "text": "And the way you do it is you simplify, you throw away those characteristics of the universe that you don't think are vital to a full understanding."}, {"time": 4638, "text": "And so we're gonna get to a point people are starting to where we've got to go beyond those simplifications."}, {"time": 4644, "text": "And so cosmology has for a long time modeled the universe in the most simplest terms, homogeneous, isotropic."}, {"time": 4653, "text": "It has just a few parameters that describe it, the average density of mass and energy and so forth."}, {"time": 4658, "text": "We have to go beyond those simplifications, and that will require putting these things on computers."}, {"time": 4663, "text": "We're not gonna be able to do calculations there."}, {"time": 4665, "text": "So much as astrophysics has gone beyond many simplifications to now give really detailed simulations of star systems and galaxies and so forth, we're gonna have to do that with cosmology, and people are starting to do that today."}, {"time": 4679, "text": "Yeah, I've seen some interesting work on simulation, most simulation cosmology, by the way, is just awesome."}, {"time": 4685, "text": "But just like simulation of the early formation of our solar system to understand how the like the Oort cloud and just, I don't know, the whole of it, how Earth came to be, like how Jupiter just protects us."}, {"time": 4702, "text": "And then there's like weird like moons and volcanoes and like modeling all of that, the formation of all of that is fascinating."}, {"time": 4714, "text": "Because that naturally is the question of how does life emerge on these kinds of rocks?"}, {"time": 4721, "text": "How does a rock become a rabbit?"}, {"time": 4724, "text": "But speaking of models, there's an equation called the Drake equation."}, {"time": 4730, "text": "We were talking about life."}, {"time": 4732, "text": "Have to ask, at the highest level first, when you look out there, how many alien civilizations do you think are out there?"}, {"time": 4741, "text": "Well, zero, one, or many?"}, {"time": 4744, "text": "So if you say civilization, I would bring my number way down."}, {"time": 4752, "text": "It could be zero."}, {"time": 4755, "text": "If you talk about life, I think it could be many."}, {"time": 4760, "text": "As we were saying before, I think the move from life to consciousness, the kinds of beings that would build what we would recognize as a civilization, that may be extraordinarily rare."}, {"time": 4774, "text": "I hope it's not."}, {"time": 4776, "text": "You know, as a kid, I loved Star Trek."}, {"time": 4778, "text": "I just loved the idea that we would be part of some universal community where, look, experience on planet Earth suggests it doesn't always go so well when groups who are separated try to come together and live in some larger collective."}, {"time": 4793, "text": "But again, as an optimist, how amazing would it be to converse with an alien civilization and learn what they've figured out about physics and cosmology and compare notes and learn from each other in some wonderful way?"}, {"time": 4810, "text": "But if you ask me the likelihood of it, I would err on saying it may be so improbable that the conditions conspire to allow life to move to this place of consciousness that it might be rare."}, {"time": 4827, "text": "It might be oversimplifying things, but just observing the power of the evolutionary process, I tend to believe, and like you read different theories of how we went, how Homo sapiens evolved, it seems like the evolutionary process naturally leads to Homo sapiens or creatures like that or much better than that."}, {"time": 4853, "text": "So to me, there's several scary scenarios."}, {"time": 4857, "text": "So, okay, the positive scenario is life itself is really difficult."}, {"time": 4863, "text": "So that origin of life is difficult."}, {"time": 4865, "text": "That's exciting for many reasons because we might be able to prove that wrong easily in the near term by finding life elsewhere."}, {"time": 4875, "text": "The scary thing to me is if life is easy and there's plenty of conscious intelligent civilizations out there and we have not obviously made contact, which means with intelligence and consciousness comes responsibility and ultimately destruction."}, {"time": 4899, "text": "So with power comes great responsibility and then we end up destroying ourselves."}, {"time": 4904, "text": "That's the scariest."}, {"time": 4908, "text": "The positive, I guess, version is that maybe we're being watched, sort of like there's a transition to where you don't wanna ruin the primitive villages out there and so there's a protective layer around us."}, {"time": 4924, "text": "They're watching."}, {"time": 4926, "text": "So where do you in these possible explanations to the Fermi paradox, why haven't we contacted aliens?"}, {"time": 4932, "text": "Do you land on?"}, {"time": 4933, "text": "Well, I think the most straightforward explanation is that there aren't any."}, {"time": 4940, "text": "Now, there are many other explanations too."}, {"time": 4943, "text": "So you can't be dogmatic about things that are just sort of gut feel, but one of my favorite Twilight Zone episodes, I don't know if you ever saw this one where this alien civilization finally comes to planet Earth and gives us this book that they really want us to have and to hold and it's in this foreign language, you don't understand it."}, {"time": 4965, "text": "The cryptographers, they desperately try to decipher it as humans are gonna visit this other alien planet and they're all sending back postcards, how wonderful it is and so forth and they finally decipher the title."}, {"time": 4978, "text": "It's To Serve Man and everyone's so thrilled, oh, they're here to serve us, it all makes sense and then just as one of the final cryptographers is going on to the alien ship, his helper runs and says, I've deciphered the rest of the book."}, {"time": 4992, "text": "To Serve Man, it's a cookbook."}, {"time": 4994, "text": "So yeah, is that a possibility?"}, {"time": 5001, "text": "And so could they be watching us and just sort of waiting for us to get to a mature enough level?"}, {"time": 5009, "text": "I don't know, it strikes me."}, {"time": 5011, "text": "Well, I think it'd be better to have this conversation after the James Webb Telescope."}, {"time": 5015, "text": "I mean, I do think that if we look at the atmospheres of many planets, I mean, there's now an estimate now that there's on order of one planet per star on average."}, {"time": 5028, "text": "So we've long known that the galaxy, hundreds of billions of stars, numbers of galaxies, hundreds of billions of galaxies."}, {"time": 5034, "text": "So we're talking about hundreds of billions of hundreds of billions of planets, oh my."}, {"time": 5039, "text": "And if we start to survey some of these planets and one after the other after the other, we just sort of find no evidence for any of the biological markers."}, {"time": 5050, "text": "It could be, of course, maybe life takes a radically different form."}, {"time": 5053, "text": "It'd be hard to know that."}, {"time": 5055, "text": "But I think that would at least give us some insight on the life question."}, {"time": 5059, "text": "But I just don't see how we get insight on the civilization or consciousness question without the direct connection."}, {"time": 5067, "text": "And it strikes me that if consciousness is ubiquitous, let's say life is, I'm willing to grant that."}, {"time": 5075, "text": "If consciousness is also ubiquitous, then I don't understand why they haven't been here or why there hasn't been separation because presumably they should be much further ahead of us."}, {"time": 5087, "text": "How unlike would it be that we're like, of all consciousness in the universe, we're the most advanced."}, {"time": 5093, "text": "That'd be such a special place for human beings that it's hard for me to grant that as a likely possibility."}, {"time": 5100, "text": "Rather, I think we're kind of run of the mill."}, {"time": 5102, "text": "And there are many who are far more advanced than us."}, {"time": 5106, "text": "And I don't think that they would expend the energy to hide themselves."}, {"time": 5111, "text": "I don't think they care enough."}, {"time": 5112, "text": "And so see, that's actually what I believe that there's a very large number of civilizations that are far more advanced than us."}, {"time": 5156, "text": "We're young in terms of intelligence."}, {"time": 5159, "text": "But I guess what I'd say is like, I'm on board with all of that as a real possibility, but then it does strike me that we are sufficiently able to observe the unit."}, {"time": 5171, "text": "Look, we can look back to a fraction of the duration from here to the, just a fraction is left that we are unable to see."}, {"time": 5182, "text": "So however young we are, we have been able to sort of pierce the universe and it just strikes me that there would be some signature, but maybe that's coming."}, {"time": 5195, "text": "But look, having said that I do, look, I certainly note the fact that it's rare that I stoop down while walking in Manhattan and sort of dig up some ants in the bushes on the side of the street and talk to the ants, right?"}, {"time": 5211, "text": "Because it's just not interesting to me."}, {"time": 5212, "text": "So if we're like the ants on the cosmological landscape, then yeah, I can imagine that the super advanced aliens would be like, like whoever, you know, but I feel like we're sufficiently advanced that there should be some signal signature of that, but maybe it's coming."}, {"time": 5228, "text": "I think the deeper fundamental problem between us and the ants is that we don't have a common language."}, {"time": 5232, "text": "It's not the interest."}, {"time": 5234, "text": "It's that we don't even have a common language."}, {"time": 5237, "text": "And so the alien civilizations don't even know how to, like we humans have convinced ourselves we're special because we developed the language."}, {"time": 5269, "text": "I wonder if there's some totally other kinds of language that communicates on a different timescale with different, very different mechanisms in the space of information that just is not, it's everything, everything is lost in translation."}, {"time": 5283, "text": "Yeah, and it could well be as a look."}, {"time": 5285, "text": "I mean, I think part of the reason I go toward the possibility of the soul intelligence is there's a certain kind of romantic appeal to looking out in the cosmos and it's just quiet and it's just eternal silence."}, {"time": 5302, "text": "There's something that appeals to me at an emotional level that way."}, {"time": 5307, "text": "But yeah, I mean, nobody knows."}, {"time": 5311, "text": "And it's certainly conceivable that there's just a radical mismatch between the kinds of things that we are able to observe and sensitive to versus the kinds of structures that permeate the universe in a manner that simply we're unable to detect."}, {"time": 5330, "text": "Well, if we are alone, that is exciting."}, {"time": 5334, "text": "And one of the ways it's exciting is that it's up to us to become, to expand out into the universe, to permeate consciousness out into the universe."}, {"time": 5347, "text": "So that's where space exploration comes in."}, {"time": 5349, "text": "Let me ask you as somebody who's a screen theorist, a physicist, do you think space exploration, a colonizing space is a physics or an engineering problem?"}, {"time": 5362, "text": "Yeah, I think it's fundamentally an engineering problem if we're not trying to do things like build wormholes the way they did, say an interstellar to get to a different place or trying to travel near the speed of light so that we would actually be able to traverse interstellar distances."}, {"time": 5380, "text": "I mean, without that, our colonization will happen in a very, very slow rate."}, {"time": 5387, "text": "But one of the beauties of relativity is if you do travel near the speed of light, you can actually go arbitrarily far in a human lifetime."}, {"time": 5396, "text": "People say, how's that possible?"}, {"time": 5397, "text": "You can't go billions of light years."}, {"time": 5399, "text": "Billions of light years, well, you can actually, because as you can do the speed of light, the way in which space and time change allows you to go in principle arbitrarily far."}, {"time": 5408, "text": "That's very exciting."}, {"time": 5409, "text": "But if we put that physics side of the issue and the manipulation of space and time to the side, yeah, I think it's a deep engineering problem."}, {"time": 5418, "text": "How do you terraform other planets?"}, {"time": 5421, "text": "I mean, how do you go beyond our local neighborhood, say without using the ideas of relativity?"}, {"time": 5430, "text": "So I think it's all quite exciting."}, {"time": 5432, "text": "And I think the idea is using solar sails that people have developed and trying to take that first step to Mars, I think that's a vital and valuable step to take."}, {"time": 5443, "text": "But yeah, I think these are fundamentally engineering challenges."}, {"time": 5446, "text": "Or extending the human lifespan through biology research or maybe reducing what it means to be a human being into information and uploading certain parts of it."}, {"time": 5457, "text": "Maybe not all of the full resolution of a human life, but maybe the essential things like the DNA and be able to reconstruct that human being."}, {"time": 5467, "text": "But I have to ask about Mars."}, {"time": 5472, "text": "Do you find the dream of humans stepping on Mars, stepping foot first, but also colonizing Mars, one that's worth us fighting for?"}, {"time": 5485, "text": "Yeah, usually so."}, {"time": 5485, "text": "I mean, I think what we have long been not always in the best way is a species of explorers in the literal sense of traveling from one part of the world to another, or in the more metaphorical sense of trying to travel through our minds to the quantum realm or back to the Big Bang or to the center of black holes."}, {"time": 5507, "text": "So I think that's fundamentally part of the human spirit."}, {"time": 5511, "text": "So I do think that's a vital part of our heritage brought forward into its next incarnation."}, {"time": 5521, "text": "That's who we are."}, {"time": 5523, "text": "Do you think there'll be a day in the future where a human being is born on Mars and has to learn about his or her human origins on Earth?"}, {"time": 5536, "text": "Like, they'll have to read in a book."}, {"time": 5538, "text": "Yeah, I don't think it'll be a book at that stage."}, {"time": 5540, "text": "It'll probably just be uploaded into the head or something or imprinted into the DNA, and then they just sort of sense it."}, {"time": 5546, "text": "But yeah, I think there's, well, look, the issue you raised before is the vital one."}, {"time": 5552, "text": "Is it the case that any sufficiently advanced civilization destroys itself?"}, {"time": 5557, "text": "Is that sort of a commonplace quality?"}, {"time": 5559, "text": "I mean, that's the other potential answer to the Fermi paradox."}, {"time": 5563, "text": "Why aren't they here?"}, {"time": 5564, "text": "Because by the time they got to the technological development where they could travel here, they blew themselves up."}, {"time": 5569, "text": "They destroyed themselves."}, {"time": 5570, "text": "And that's an unfortunate, but not a hard to imagine possibility based on things that have happened here on planet Earth."}, {"time": 5581, "text": "But putting that to the side, I think that's the big obstacle, but putting that to the side, we will resolve the engineering challenges."}, {"time": 5589, "text": "And I should probably modify my answer from before when you said, is it engineering or physics?"}, {"time": 5597, "text": "So we will surmount the engineering challenges and that will then make the physics challenges relevant."}, {"time": 5603, "text": "It'll make it relevant to figure out how to travel near the speed of light."}, {"time": 5606, "text": "It'll make it relevant to learn how to manipulate the shape of space time and so forth."}, {"time": 5612, "text": "So I think it's a multi stage process where it is engineering and ultimately physics."}, {"time": 5618, "text": "And if we stick around long enough, those are the kinds of challenges I think that we're ultimately gonna surmount."}, {"time": 5623, "text": "And then the physics side is figuring out how to harness energy enough to travel outside the solar system, which seems like a heck of a difficult journey."}, {"time": 5631, "text": "But even Mars itself, I don't know, maybe because I was born in the Soviet Union and was born with the, looking up at the stars and that dream of like the highest of human achievement is the ability to fly out there, to join the stars."}, {"time": 5650, "text": "I really liked the idea of going to Mars and not just stepping foot on Mars."}, {"time": 5655, "text": "And it wasn't until maybe misinformed, but for me personally, it wasn't until Elon Musk started talking about the colonization of Mars, did I realize like we humans can actually do that."}, {"time": 5674, "text": "And first of all, the importance of somebody saying that we can do these seemingly impossible things is immeasurable because the fact that he placed that into my mind and into the minds of millions of others, maybe hundreds of millions, maybe billions of others, young kids today, I mean, that's gonna make it a reality."}, {"time": 5698, "text": "I, for some reason, am deeply excited, even though my work isn't AI that echoes all of this."}, {"time": 5706, "text": "I'm excited by the idea that somebody would be born, as we were saying, on Mars and sort of look up and be able to see with a telescope Earth and say, that's where I came from."}, {"time": 5719, "text": "I don't know, that idea scale to other planets, to other solar systems, that's really exciting."}, {"time": 5726, "text": "And hugely exciting."}, {"time": 5729, "text": "I mean, the vital thing is to dream, right?"}, {"time": 5733, "text": "I mean, and it sounds hackneyed, but it is so important for young kids, for the next generation, to think about the things that are seemingly impossible."}, {"time": 5745, "text": "I mean, that's what makes them possible."}, {"time": 5747, "text": "And this is one which is concrete enough."}, {"time": 5750, "text": "I mean, this is something that's gonna happen soon in terms of actually going to Mars."}, {"time": 5754, "text": "And then the next step of establishing some presence, some semi permanent or permanent presence."}, {"time": 5762, "text": "This is not something that's gonna wait to the 25th century."}, {"time": 5766, "text": "I mean, this is something that's gonna happen relatively soon."}, {"time": 5769, "text": "So, I mean, it could well be in your lifetime, unlikely mine, but possibly in your lifetime that that kid will be born and have the experience that you described."}, {"time": 5778, "text": "So yeah, it's spectacularly exciting."}, {"time": 5781, "text": "And I actually, I would love to go on Mars on one of the early."}, {"time": 5785, "text": "You would?"}, {"time": 5786, "text": "It would if it's one way."}, {"time": 5788, "text": "I'm happy to do it one way."}, {"time": 5790, "text": "I'm single if there's ladies out there that wanna start that family."}, {"time": 5794, "text": "Let's go out to Mars."}, {"time": 5796, "text": "No, I think."}, {"time": 5797, "text": "See, I have to tell you something."}, {"time": 5798, "text": "You spoke about terror, thinking about like black holes."}, {"time": 5802, "text": "If I actually think about going to Mars and being on Mars and put myself in there fully, that's terror inducing."}, {"time": 5811, "text": "The idea of to be in this foreign world where you can't come back, where you've made this choice that can't be reversed."}, {"time": 5820, "text": "Well, at some point it may be, but in that guise, that to me carries a deep sense of terror."}, {"time": 5828, "text": "I feel that sense of terror every time Kerouac, Jack Kerouac talked about this on the road is when you leave a place, if you're honest about it, like life is short."}, {"time": 5840, "text": "And when you leave a place, you move to a new place and you think of all the friends, maybe family you're leaving behind as you drive over the hill, that really is goodbye."}, {"time": 5851, "text": "Like we sometimes don't think of it that way when we're moving, but that really is goodbye to that life, to the person you were, to all the people."}, {"time": 5858, "text": "Maybe if it's close friends, you'll see them maybe 10, 15 more times in your life and that's it."}, {"time": 5863, "text": "And you're saying goodbye to all of that."}, {"time": 5866, "text": "And so in the same way, I see it as way more dramatic when you're flying away from earth and it's like, it's goodbye to Dunkin Donuts and Starbucks."}, {"time": 5876, "text": "And it's goodbye to whatever, I don't know why I picked those, but some, all the things that are special to earth, it's goodbye, but that's life."}, {"time": 5886, "text": "I suppose more, what excites me about that kind of journey is it's a distinct contemplation of your mortality, acceptance of your mortality."}, {"time": 5896, "text": "You're saying, just like when you take on any difficult journey, it's accepting that you're going to die one day and might as well do something truly exciting."}, {"time": 5908, "text": "Yes, I mean, I will, you know, I'm with you on that."}, {"time": 5911, "text": "I'm a strong believer that deep underneath human motivation is this terror of our own mortality."}, {"time": 5921, "text": "Yeah, there's this a wonderful book that had a great influence in me called The Denial of Death by Ernest Becker."}, {"time": 5927, "text": "And when you are aware of the ways in which our mortality influences our behaviors, it really does add a different slant, a different kind of color to the interpretation of human behavior."}, {"time": 5941, "text": "Yeah, it's funny that that book had a big influence in me as well."}, {"time": 5948, "text": "And the terror management theory and I, again, from an engineering perspective, I don't know how many people that book influenced because I talk to people about the fear of death and it doesn't seem like about the fear of death and it doesn't seem to be that fundamental to their experience."}, {"time": 5966, "text": "And I don't think on the surface it's fundamental to my experience, but it seems like an awfully, in terms of we talk about models and strength theory and theories, in terms of theories of this macro experience of human life, it seems like a heck of a good theory that the fear of death is at the kind of is the warm at the core."}, {"time": 5984, "text": "Yeah, well, I mean, and the terror management theories that you make reference to, I mean, this is a group of psychologists, social psychologists who devise these very clever experiments, real world experiments with real people, where you can directly measure the hidden influence of the recognition of our own mortality."}]}]