[{"title": "Gilbert Strang: Linear Algebra, Teaching, and MIT OpenCourseWare | Lex Fridman Podcast #52", "id": "lEZPfmGCEk0", "quotes": [{"time": 307, "text": "And I mean, the fact that there is thousands, hundreds of thousands, millions of people that watch that video, I think that's really powerful."}, {"time": 318, "text": "So how do you think the idea of putting lectures online, what really MIT OpenCourseWare has innovated?"}, {"time": 327, "text": "That was a wonderful idea."}, {"time": 329, "text": "I think the story that I've heard is the committee was appointed by the president, President Vest, at that time, a wonderful guy."}, {"time": 340, "text": "And the idea of the committee was to figure out how MIT could be like other universities, market the work we were doing."}, {"time": 352, "text": "And then they didn't see a way."}, {"time": 354, "text": "And after a weekend, and they had an inspiration, came back to President Vest and said, what if we just gave it away?"}, {"time": 362, "text": "And he decided that was okay, good idea."}, {"time": 368, "text": "You know, that's a crazy idea."}, {"time": 370, "text": "If we think of a university as a thing that creates a product, isn't knowledge, the kind of educational knowledge, isn't the product and giving that away, are you surprised that it went through?"}, {"time": 386, "text": "The result that he did it, well, knowing a little bit President Vest, it was like him, I think, and it was really the right idea."}, {"time": 398, "text": "MIT is a kind of, it's known for being high level, technical things, and this is the best way we can say, tell, we can show what MIT really is like, because in my case, those 1806 videos are just teaching the class."}, {"time": 419, "text": "They were there in 26, 100."}, {"time": 423, "text": "They're kind of fun to look at."}, {"time": 424, "text": "People write to me and say, oh, you've got a sense of humor, but I don't know where that comes through."}, {"time": 430, "text": "Somehow I'm friendly with the class, I like students."}, {"time": 435, "text": "And then your algebra, the subject, we gotta give the subject most of the credit."}, {"time": 441, "text": "It really has come forward in importance in these years."}, {"time": 449, "text": "So let's talk about linear algebra a little bit, because it is such a, it's both a powerful and a beautiful subfield of mathematics."}, {"time": 459, "text": "So what's your favorite specific topic in linear algebra, or even math in general to give a lecture on, to convey, to tell a story, to teach students?"}, {"time": 470, "text": "Okay, well, on the teaching side, so it's not deep mathematics at all, but I'm kind of proud of the idea of the four subspaces, the four fundamental subspaces, which are of course known before, long before my name for them, but."}, {"time": 493, "text": "Can you go through them?"}, {"time": 494, "text": "Can you go through the four subspaces?"}, {"time": 495, "text": "Sure I can, yeah."}, {"time": 497, "text": "So the first one to understand is, so the matrix is, maybe I should say the matrix is."}, {"time": 502, "text": "What is a matrix?"}, {"time": 503, "text": "What's a matrix?"}, {"time": 504, "text": "Well, so we have like a rectangle of numbers."}, {"time": 508, "text": "So it's got n columns, got a bunch of columns, and also got an m rows, let's say, and the relation between, so of course the columns and the rows, it's the same numbers."}, {"time": 521, "text": "So there's gotta be connections there, but they're not simple."}, {"time": 525, "text": "The columns might be longer than the rows, and they're all different, the numbers are mixed up."}, {"time": 533, "text": "First space to think about is take the columns, so those are vectors, those are points in n dimensions."}, {"time": 541, "text": "What's a vector?"}, {"time": 542, "text": "So a physicist would imagine a vector or might imagine a vector as a arrow in space or the point it ends at in space."}, {"time": 554, "text": "For me, it's a column of numbers."}, {"time": 558, "text": "You often think of, this is very interesting in terms of linear algebra, in terms of a vector, you think a little bit more abstract than how it's very commonly used, perhaps."}, {"time": 570, "text": "You think this arbitrary multidimensional space."}, {"time": 574, "text": "Right away, I'm in high dimensions."}, {"time": 578, "text": "Dreamland."}, {"time": 580, "text": "In the lecture, I try to, so if you think of two vectors in 10 dimensions, I'll do this in class, and I'll readily admit that I have no good image in my mind of a vector of an arrow in 10 dimensional space, but whatever."}, {"time": 600, "text": "You can add one bunch of 10 numbers to another bunch of 10 numbers, so you can add a vector to a vector, and you can multiply a vector by three, and that's, if you know how to do those, you've got linear algebra."}, {"time": 614, "text": "10 dimensions, there's this beautiful thing about math, if we look at string theory and all these theories, which are really fundamentally derived through math, but are very difficult to visualize."}, {"time": 626, "text": "How do you think about the things, like a 10 dimensional vector, that we can't really visualize?"}, {"time": 634, "text": "And yet, math reveals some beauty underlying our world in that weird thing we can't visualize."}, {"time": 643, "text": "How do you think about that difference?"}, {"time": 646, "text": "Well, probably, I'm not a very geometric person, so I'm probably thinking in three dimensions, and the beauty of linear algebra is that it goes on to 10 dimensions with no problem."}, {"time": 658, "text": "I mean, that if you're just seeing what happens if you add two vectors in 3D, yeah, then you can add them in 10D."}, {"time": 666, "text": "You're just adding the 10 components."}, {"time": 670, "text": "So, I can't say that I have a picture, but yet I try to push the class to think of a flat surface in 10 dimensions."}, {"time": 681, "text": "So a plane in 10 dimensions, and so that's one of the spaces."}, {"time": 687, "text": "Take all the columns of the matrix, take all their combinations, so much of this column, so much of this one, then if you put all those together, you get some kind of a flat surface that I call a vector space, space of vectors."}, {"time": 704, "text": "And my imagination is just seeing like a piece of paper in 3D, but anyway, so that's one of the spaces, that's space number one, the column space of the matrix."}, {"time": 718, "text": "And then there's the row space, which is, as I said, different, but came from the same numbers."}, {"time": 724, "text": "So we got the column space, all combinations of the columns, and then we've got the row space, all combinations of the rows."}, {"time": 734, "text": "So those words are easy for me to say, and I can't really draw them on a blackboard, but I try with my thick chalk."}, {"time": 742, "text": "Everybody likes that railroad chalk, and me too."}, {"time": 747, "text": "I wouldn't use anything else now."}, {"time": 750, "text": "And then the other two spaces are perpendicular to those."}, {"time": 755, "text": "So like if you have a plane in 3D, just a plane is just a flat surface in 3D, then perpendicular to that plane would be a line."}, {"time": 767, "text": "So that would be the null space."}, {"time": 770, "text": "So we've got two, we've got a column space, a row space, and there are two perpendicular spaces."}, {"time": 776, "text": "So those four fit together in a beautiful picture of a matrix, yeah, yeah."}, {"time": 783, "text": "It's sort of a fundamental, it's not a difficult idea."}, {"time": 786, "text": "It comes pretty early in 1806, and it's basic."}, {"time": 792, "text": "Planes in these multidimensional spaces, how difficult of an idea is that to come to, do you think?"}, {"time": 800, "text": "If you look back in time, I think mathematically it makes sense, but I don't know if it's intuitive for us to imagine, just as we were talking about."}, {"time": 811, "text": "It feels like calculus is easier to intuit."}, {"time": 814, "text": "Well, I have to admit, calculus came earlier, earlier than linear algebra."}, {"time": 819, "text": "So Newton and Leibniz were the great men to understand the key ideas of calculus."}, {"time": 827, "text": "But linear algebra to me is like, okay, it's the starting point, because it's all about flat things."}, {"time": 834, "text": "Calculus has got, all the complications of calculus come from the curves, the bending, the curved surfaces."}, {"time": 843, "text": "Linear algebra, the surfaces are all flat."}, {"time": 845, "text": "Nothing bends in linear algebra."}, {"time": 848, "text": "So it should have come first, but it didn't."}, {"time": 851, "text": "And calculus also comes first in high school classes, in college class, it'll be freshman math, it'll be calculus, and then I say, enough of it."}, {"time": 864, "text": "Like, okay, get to the good stuff."}, {"time": 867, "text": "And that's... Do you think linear algebra should come first?"}, {"time": 870, "text": "Well, it really, I'm okay with it not coming first, but it should, yeah, it should."}, {"time": 877, "text": "It's simpler."}, {"time": 879, "text": "Because everything is flat."}, {"time": 880, "text": "Yeah, everything's flat."}, {"time": 881, "text": "Well, of course, for that reason, calculus sort of sticks to one dimension, or eventually you do multivariate, but that basically means two dimensions."}, {"time": 892, "text": "Linear algebra, you take off into 10 dimensions, no problem."}, {"time": 895, "text": "It just feels scary and dangerous to go beyond two dimensions, that's all."}, {"time": 901, "text": "If everything's flat, you can't go wrong."}, {"time": 903, "text": "So what concept or theorem in linear algebra or in math you find most beautiful, that gives you pause that leaves you in awe?"}, {"time": 915, "text": "Well, I'll stick with linear algebra here."}, {"time": 918, "text": "I hope the viewer knows that really, mathematics is amazing, amazing subject and deep, deep connections between ideas that didn't look connected, they turned out they were."}, {"time": 932, "text": "But if we stick with linear algebra..."}, {"time": 935, "text": "So we have a matrix."}, {"time": 937, "text": "That's like the basic thing, a rectangle of numbers."}, {"time": 940, "text": "And it might be a rectangle of data."}, {"time": 942, "text": "You're probably gonna ask me later about data science, where often data comes in a matrix."}, {"time": 950, "text": "You have maybe every column corresponds to a drug and every row corresponds to a patient."}, {"time": 960, "text": "And if the patient reacted favorably to the drug, then you put up some positive number in there."}, {"time": 969, "text": "Anyway, rectangle of numbers, a matrix is basic."}, {"time": 974, "text": "So the big problem is to understand all those numbers."}, {"time": 978, "text": "You got a big, big set of numbers."}, {"time": 980, "text": "And what are the patterns, what's going on?"}, {"time": 983, "text": "And so one of the ways to break down that matrix into simple pieces is uses something called singular values."}, {"time": 996, "text": "And that's come on as fundamental in the last, certainly in my lifetime."}, {"time": 1004, "text": "Eigenvalues, if you have viewers who've done engineering, math, or basic linear algebra, eigenvalues were in there."}, {"time": 1015, "text": "But those are restricted to square matrices."}, {"time": 1018, "text": "And data comes in rectangular matrices."}, {"time": 1021, "text": "So you gotta take that next step."}, {"time": 1024, "text": "I'm always pushing math faculty, get on, do it, do it."}, {"time": 1029, "text": "Singular values."}, {"time": 1031, "text": "So those are a way to break, to find the important pieces of the matrix, which add up to the whole matrix."}, {"time": 1042, "text": "So you're breaking a matrix into simple pieces."}, {"time": 1046, "text": "And the first piece is the most important part of the data."}, {"time": 1050, "text": "The second piece is the second most important part."}, {"time": 1053, "text": "And then often, so a data set is a matrix."}, {"time": 1058, "text": "And often, so a data scientist will like, if a data scientist can find those first and second pieces, stop there, the rest of the data is probably round off, experimental error maybe."}, {"time": 1077, "text": "So you're looking for the important part."}, {"time": 1080, "text": "So what do you find beautiful about singular values?"}, {"time": 1083, "text": "Well, yeah, I didn't give the theorem."}, {"time": 1086, "text": "So here's the idea of singular values."}, {"time": 1089, "text": "Every matrix, every matrix, rectangular, square, whatever, can be written as a product of three very simple special matrices."}, {"time": 1100, "text": "So that's the theorem."}, {"time": 1101, "text": "Every matrix can be written as a rotation times a stretch, which is just a diagonal matrix, otherwise all zeros except on the one diagonal."}, {"time": 1114, "text": "And then the third factor is another rotation."}, {"time": 1117, "text": "So rotation, stretch, rotation is the breakup of any matrix."}, {"time": 1125, "text": "The structure of that, the ability that you can do that, what do you find appealing?"}, {"time": 1129, "text": "What do you find beautiful about it?"}, {"time": 1131, "text": "Well, geometrically, as I freely admit, the action of a matrix is not so easy to visualize, but everybody can visualize a rotation."}, {"time": 1142, "text": "Take two dimensional space and just turn it around the center."}, {"time": 1149, "text": "Take three dimensional space."}, {"time": 1150, "text": "So a pilot has to know about, well, what are the three, the yaw is one of them."}, {"time": 1156, "text": "I've forgotten all the three turns that a pilot makes."}, {"time": 1162, "text": "Up to 10 dimensions, you've got 10 ways to turn, but you can visualize a rotation."}, {"time": 1168, "text": "Take the space and turn it."}, {"time": 1170, "text": "And you can visualize a stretch."}, {"time": 1172, "text": "So to break a matrix with all those numbers in it into something you can visualize, rotate, stretch, rotate is pretty neat."}, {"time": 1184, "text": "It's pretty neat."}, {"time": 1185, "text": "That's pretty powerful."}, {"time": 1187, "text": "On YouTube, just consuming a bunch of videos and just watching what people connect with and what they really enjoy and are inspired by, math seems to come up again and again."}, {"time": 1199, "text": "I'm trying to understand why that is."}, {"time": 1203, "text": "Perhaps you can help give me clues."}, {"time": 1206, "text": "So it's not just the kinds of lectures that you give, but it's also just other folks like with Numberphile, there's a channel where they just chat about things that are extremely complicated, actually."}, {"time": 1219, "text": "People nevertheless connect with them."}, {"time": 1222, "text": "What do you think that is?"}, {"time": 1224, "text": "It's wonderful, isn't it?"}, {"time": 1225, "text": "I mean, I wasn't really aware of it."}, {"time": 1228, "text": "We're conditioned to think math is hard, math is abstract, math is just for a few people, but it isn't that way."}, {"time": 1236, "text": "A lot of people quite like math and they liked it."}, {"time": 1241, "text": "I get messages from people saying, now I'm retired, I'm gonna learn some more math."}, {"time": 1246, "text": "I get a lot of those."}, {"time": 1247, "text": "It's really encouraging."}, {"time": 1249, "text": "And I think what people like is that there's some order, a lot of order and things are not obvious, but they're true."}, {"time": 1260, "text": "So it's really cheering to think that so many people really wanna learn more about math."}, {"time": 1268, "text": "And in terms of truth, again, sorry to slide into philosophy at times, but math does reveal pretty strongly what things are true."}, {"time": 1280, "text": "I mean, that's the whole point of proving things."}, {"time": 1283, "text": "It is, yeah."}, {"time": 1284, "text": "And yet, sort of our real world is messy and complicated."}, {"time": 1290, "text": "What do you think about the nature of truth that math reveals?"}, {"time": 1295, "text": "Because it is a source of comfort like you've mentioned."}, {"time": 1299, "text": "Well, I have to say, I'm not much of a philosopher."}, {"time": 1303, "text": "I just like numbers."}, {"time": 1304, "text": "As a kid, this was before you had to go in, when you had a filly in your teeth, you had to kind of just take it."}, {"time": 1316, "text": "So what I did was think about math, like take powers of two, two, four, eight, 16, up until the time the tooth stopped hurting and the dentist said you're through."}, {"time": 1328, "text": "Or counting."}, {"time": 1330, "text": "So that was a source of just, source of peace almost."}, {"time": 1335, "text": "What is it about math do you think that brings that?"}, {"time": 1341, "text": "Well, you know where you are."}, {"time": 1342, "text": "Yeah, it's symmetry, it's certainty."}, {"time": 1345, "text": "The fact that, you know, if you multiply two by itself 10 times, you get 1,024 period."}, {"time": 1353, "text": "Everybody's gonna get that."}, {"time": 1354, "text": "Do you see math as a powerful tool or as an art form?"}, {"time": 1359, "text": "So it's both."}, {"time": 1360, "text": "That's really one of the neat things."}, {"time": 1362, "text": "You can be an artist and like math, you can be an engineer and use math."}, {"time": 1370, "text": "Which are you?"}, {"time": 1371, "text": "Which am I?"}, {"time": 1373, "text": "What did you connect with most?"}, {"time": 1374, "text": "Yeah, I'm somewhere between."}, {"time": 1377, "text": "I'm certainly not a artist type, philosopher type person."}, {"time": 1381, "text": "Might sound that way this morning, but I'm not."}, {"time": 1384, "text": "Yeah, I really enjoy teaching engineers because they go for an answer."}, {"time": 1393, "text": "And yeah, so probably within the MIT math department, most people enjoy teaching people, teaching students who get the abstract idea."}, {"time": 1406, "text": "I'm okay with, I'm good with engineers who are looking for a way to find answers."}, {"time": 1415, "text": "Actually, that's an interesting question."}, {"time": 1417, "text": "Do you think for teaching and in general, thinking about new concepts, do you think it's better to plug in the numbers or to think more abstractly?"}, {"time": 1429, "text": "So looking at theorems and proving the theorems or actually building up a basic intuition of the theorem or the method, the approach, and then just plugging in numbers and seeing it work."}, {"time": 1442, "text": "Yeah, well, certainly many of us like to see examples."}, {"time": 1449, "text": "First, we understand, it might be a pretty abstract sounding example, like a three dimensional rotation."}, {"time": 1456, "text": "How are you gonna understand a rotation in 3D?"}, {"time": 1462, "text": "Or in 10D?"}, {"time": 1468, "text": "And then some of us like to keep going with it to the point where you got numbers, where you got 10 angles, 10 axes, 10 angles."}, {"time": 1478, "text": "But the best, the great mathematicians probably, I don't know if they do that, because for them, an example would be a highly abstract thing to the rest of it."}, {"time": 1494, "text": "Right, but nevertheless, working in the space of examples."}, {"time": 1497, "text": "Yeah, examples."}, {"time": 1498, "text": "It seems to."}, {"time": 1499, "text": "Examples of structure."}, {"time": 1501, "text": "Our brains seem to connect with that."}, {"time": 1504, "text": "So I'm not sure if you're familiar with him, but Andrew Yang is a presidential candidate currently running with math in all capital letters and his hats as a slogan."}, {"time": 1519, "text": "Stands for Make America Think Hard."}, {"time": 1521, "text": "Okay, I'll vote for him."}, {"time": 1525, "text": "So, and his name rhymes with yours, Yang, Strang."}, {"time": 1528, "text": "But he also loves math and he comes from that world of, but he also, looking at it, makes me realize that math, science, and engineering are not really part of our politics, political discourse, about political government in general."}, {"time": 1549, "text": "What are your thoughts on that in general?"}, {"time": 1551, "text": "Well, certainly somewhere in the system, we need people who are comfortable with numbers, comfortable with quantities."}, {"time": 1558, "text": "You know, if you say this leads to that, they see it and it's undeniable."}, {"time": 1565, "text": "But isn't that strange to you that we have almost no, I mean, I'm pretty sure we have no elected officials in Congress or obviously the president that either has an engineering degree or a math degree."}, {"time": 1582, "text": "Yeah, well, that's too bad."}, {"time": 1585, "text": "A few could, a few who could make the connection."}, {"time": 1590, "text": "Yeah, it would have to be people who understand engineering or science and at the same time can make speeches and lead, yeah."}, {"time": 1604, "text": "Yeah, inspire people."}, {"time": 1605, "text": "Yeah, inspire, yeah."}, {"time": 1606, "text": "You were, speaking of inspiration, the president of the Society for Industrial and Applied Mathematics."}, {"time": 1613, "text": "It's a major organization in math, applied math."}, {"time": 1617, "text": "What do you see as a role of that society, you know, in our public discourse?"}, {"time": 1623, "text": "In public."}, {"time": 1624, "text": "Yeah, so, well, it was fun to be president at the time."}, {"time": 1628, "text": "A couple years, a few years."}, {"time": 1629, "text": "Two years, around 2000."}, {"time": 1633, "text": "I just hope that's president of a pretty small society."}, {"time": 1636, "text": "But nevertheless, it was a time when math was getting some more attention in Washington."}, {"time": 1644, "text": "But yeah, I got to give a little 10 minutes to a committee of the House of Representatives talking about who I met."}, {"time": 1655, "text": "And then, actually, it was fun because one of the members of the House had been a student, had been in my class."}, {"time": 1664, "text": "What do you think of that?"}, {"time": 1666, "text": "Yeah, as you say, pretty rare, most members of the House have had a different training, different background."}, {"time": 1672, "text": "But there was one from New Hampshire who was my friend, really, by being in the class."}, {"time": 1682, "text": "Yeah, so those years were good."}, {"time": 1685, "text": "Then, of course, other things take over in importance in Washington, and math just, at this point, is not so visible."}, {"time": 1698, "text": "But for a little moment, it was."}, {"time": 1700, "text": "There's some excitement, some concern about artificial intelligence in Washington now."}, {"time": 1706, "text": "About the future."}, {"time": 1707, "text": "And I think at the core of that is math."}, {"time": 1710, "text": "Well, it is, yeah."}, {"time": 1712, "text": "Maybe it's hidden."}, {"time": 1712, "text": "Maybe it's wearing a different hat."}, {"time": 1714, "text": "Well, artificial intelligence, and particularly, can I use the words deep learning?"}, {"time": 1721, "text": "Deep learning is a particular approach to understanding data."}, {"time": 1727, "text": "Again, you've got a big, whole lot of data where data is just swamping the computers of the world."}, {"time": 1736, "text": "And to understand it, out of all those numbers, to find what's important in climate, in everything."}, {"time": 1745, "text": "And artificial intelligence is two words for one approach to data."}, {"time": 1751, "text": "Deep learning is a specific approach there, which uses a lot of linear algebra."}, {"time": 1757, "text": "So I got into it."}, {"time": 1759, "text": "I thought, okay, I've gotta learn about this."}, {"time": 1761, "text": "So maybe from your perspective, let me ask the most basic question."}, {"time": 1767, "text": "How do you think of a neural network?"}, {"time": 1770, "text": "What is a neural network?"}, {"time": 1772, "text": "So can I start with the idea about deep learning?"}, {"time": 1778, "text": "What is deep learning?"}, {"time": 1779, "text": "What is deep learning, yeah."}, {"time": 1781, "text": "So we're trying to learn, from all this data, we're trying to learn what's important."}, {"time": 1787, "text": "What's it telling us?"}, {"time": 1790, "text": "So you've got data, you've got some inputs for which you know the right outputs."}, {"time": 1797, "text": "The question is, can you see the pattern there?"}, {"time": 1802, "text": "Can you figure out a way for a new input, which we haven't seen, to understand what the output will be from that new input?"}, {"time": 1812, "text": "So we've got a million inputs with their outputs."}, {"time": 1815, "text": "So we're trying to create some pattern, some rule that'll take those inputs, those million training inputs, which we know about, to the correct million outputs."}, {"time": 1828, "text": "And this idea of a neural net is part of the structure of our new way to create a rule."}, {"time": 1840, "text": "We're looking for a rule that will take these training inputs to the known outputs."}, {"time": 1848, "text": "And then we're gonna use that rule on new inputs that we don't know the output and see what comes."}, {"time": 1856, "text": "Linear algebra is a big part of finding that rule."}, {"time": 1859, "text": "That's right, linear algebra is a big part."}, {"time": 1861, "text": "Not all the part."}, {"time": 1863, "text": "People were leaning on matrices, that's good, still do."}, {"time": 1868, "text": "Linear is something special."}, {"time": 1870, "text": "It's all about straight lines and flat planes."}, {"time": 1873, "text": "And data isn't quite like that."}, {"time": 1878, "text": "It's more complicated."}, {"time": 1881, "text": "So you gotta introduce some complication."}, {"time": 1883, "text": "So you have to have some function that's not a straight line."}, {"time": 1887, "text": "And it turned out, nonlinear, nonlinear, not linear."}, {"time": 1891, "text": "And it turned out that it was enough to use the function that's one straight line and then a different one."}, {"time": 1898, "text": "Halfway, so piecewise linear."}, {"time": 1900, "text": "One piece has one slope, one piece, the other piece has the second slope."}, {"time": 1907, "text": "And so that, getting that nonlinear, simple nonlinearity in blew the problem open."}, {"time": 1916, "text": "That little piece makes it sufficiently complicated to make things interesting."}, {"time": 1920, "text": "Because you're gonna use that piece over and over a million times."}, {"time": 1923, "text": "So it has a fold in the graph, the graph, two pieces."}, {"time": 1930, "text": "But when you fold something a million times, you've got a pretty complicated function that's pretty realistic."}, {"time": 1939, "text": "So that's the thing about neural networks is they have a lot of these."}, {"time": 1943, "text": "A lot of these, that's right."}, {"time": 1945, "text": "So why do you think neural networks, by using sort of formulating an objective function, very not a plain function of the folds, lots of folds of the inputs, the outputs, why do you think they work to be able to find a rule that we don't know is optimal, but it just seems to be pretty good in a lot of cases?"}, {"time": 1974, "text": "Is it surprising to you as it is to many people?"}, {"time": 1978, "text": "Do you have an intuition of why this works at all?"}, {"time": 1981, "text": "Well, I'm beginning to have a better intuition."}, {"time": 1984, "text": "This idea of things that are piecewise linear, flat pieces but with folds between them."}, {"time": 1992, "text": "Like think of a roof of a complicated, infinitely complicated house or something."}, {"time": 1997, "text": "That curve, it almost curved, but every piece is flat."}, {"time": 2004, "text": "That's been used by engineers, that idea has been used by engineers, is used by engineers, big time."}, {"time": 2012, "text": "Something called the finite element method."}, {"time": 2014, "text": "If you want to design a bridge, design a building, design an airplane, you're using this idea of piecewise flat as a good, simple, computable approximation."}, {"time": 2032, "text": "But you have a sense that there's a lot of expressive power in this kind of piecewise linear."}, {"time": 2038, "text": "Yeah, you used the right word."}, {"time": 2041, "text": "If you measure the expressivity, how complicated a thing can this piecewise flat guys express?"}, {"time": 2052, "text": "The answer is very complicated, yeah."}, {"time": 2055, "text": "What do you think are the limits of such piecewise linear or just of neural networks?"}, {"time": 2062, "text": "The expressivity of neural networks."}, {"time": 2064, "text": "Well, you would have said a while ago that they're just computational limits."}, {"time": 2068, "text": "It's a problem beyond a certain size."}, {"time": 2073, "text": "A supercomputer isn't gonna do it."}, {"time": 2076, "text": "But those keep getting more powerful."}, {"time": 2079, "text": "So that limit has been moved to allow more and more complicated surfaces."}, {"time": 2087, "text": "So in terms of just mapping from inputs to outputs, looking at data, what do you think of, in the context of neural networks in general, data is just tensor, vectors, matrices, tensors."}, {"time": 2105, "text": "How do you think about learning from data?"}, {"time": 2109, "text": "How much of our world can be expressed in this way?"}, {"time": 2112, "text": "How useful is this process?"}, {"time": 2116, "text": "I guess that's another way to ask you, what are the limits of this approach?"}, {"time": 2119, "text": "Well, that's a good question, yeah."}, {"time": 2121, "text": "So I guess the whole idea of deep learning is that there's something there to learn."}, {"time": 2126, "text": "If the data is totally random, just produced by random number generators, then we're not gonna find a useful rule because there isn't one."}, {"time": 2138, "text": "So the extreme of having a rule is like knowing Newton's law."}, {"time": 2143, "text": "If you hit a ball, it moves."}, {"time": 2146, "text": "So that's where you had laws of physics."}, {"time": 2148, "text": "Newton and Einstein and other great, great people have found those laws and laws of the distribution of oil in an underground thing."}, {"time": 2165, "text": "I mean, so engineers, petroleum engineers understand how oil will sit in an underground basin."}, {"time": 2178, "text": "So there were rules."}, {"time": 2180, "text": "Now, the new idea of artificial intelligence is learn the rules instead of figuring out the rules with help from Newton or Einstein."}, {"time": 2192, "text": "The computer is looking for the rules."}, {"time": 2195, "text": "So that's another step."}, {"time": 2196, "text": "But if there are no rules at all that the computer could find, if it's totally random data, well, you've got nothing."}, {"time": 2205, "text": "You've got no science to discover."}, {"time": 2208, "text": "It's an automated search for the underlying rules."}, {"time": 2211, "text": "Yeah, search for the rules."}, {"time": 2214, "text": "And there will be a lot of random parts."}, {"time": 2217, "text": "A lot of, I mean, I'm not knocking random because that's there."}, {"time": 2225, "text": "There's a lot of randomness built in, but there's gotta be some basic."}, {"time": 2229, "text": "It's almost always signal, right?"}, {"time": 2230, "text": "In most things."}, {"time": 2231, "text": "There's gotta be some signal, yeah."}, {"time": 2232, "text": "If it's all noise, then you're not gonna get anywhere."}, {"time": 2237, "text": "Well, this world around us does seem to be, does seem to always have a signal of some kind."}, {"time": 2242, "text": "Yeah, yeah, that's right."}, {"time": 2243, "text": "To be discovered."}, {"time": 2244, "text": "Right, that's it."}, {"time": 2245, "text": "So what excites you more?"}, {"time": 2250, "text": "We just talked about a little bit of application."}, {"time": 2252, "text": "What excites you more, theory or the application of mathematics?"}, {"time": 2258, "text": "Well, for myself, I'm probably a theory person."}, {"time": 2263, "text": "I'm not, I'm speaking here pretty freely about applications, but I'm not the person who really, I'm not a physicist or a chemist or a neuroscientist."}, {"time": 2278, "text": "So for myself, I like the structure and the flat subspaces and the relation of matrices, columns to rows."}, {"time": 2292, "text": "That's my part in the spectrum."}, {"time": 2297, "text": "So really, science is a big spectrum of people from asking practical questions and answering them using some math, then some math guys like myself who are in the middle of it and then the geniuses of math and physics and chemistry who are finding fundamental rules and then doing the really understanding nature."}, {"time": 2331, "text": "At its lowest, simplest level, maybe just a quick in broad strokes from your perspective, where does linear algebra sit as a subfield of mathematics?"}, {"time": 2344, "text": "What are the various subfields that you think about in relation to linear algebra?"}, {"time": 2352, "text": "So the big fields of math are algebra as a whole and problems like calculus and differential equations."}, {"time": 2361, "text": "So that's a second, quite different field."}, {"time": 2364, "text": "Then maybe geometry deserves to be thought of as a different field to understand the geometry of high dimensional surfaces."}, {"time": 2375, "text": "So I think, am I allowed to say this here?"}, {"time": 2379, "text": "I think this is where personal view comes in."}, {"time": 2386, "text": "I think math, we're thinking about undergraduate math, what millions of students study."}, {"time": 2394, "text": "I think we overdo the calculus at the cost of the algebra, at the cost of linear."}, {"time": 2402, "text": "So you have this talk titled Calculus Versus Linear Algebra."}, {"time": 2407, "text": "And you say that linear algebra wins."}, {"time": 2409, "text": "So can you dig into that a little bit?"}, {"time": 2413, "text": "Why does linear algebra win?"}, {"time": 2417, "text": "Right, well, okay, the viewer is gonna think this guy is biased."}, {"time": 2422, "text": "Not true, I'm just telling the truth as it is."}, {"time": 2427, "text": "Yeah, so I feel linear algebra is just a nice part of math that people can get the idea of."}, {"time": 2434, "text": "They can understand something that's a little bit abstract because once you get to 10 or 100 dimensions and very, very, very useful, that's what's happened in my lifetime is the importance of data, which does come in matrix form."}, {"time": 2454, "text": "So it's really set up for algebra."}, {"time": 2456, "text": "It's not set up for differential equation."}, {"time": 2459, "text": "And let me fairly add probability, the ideas of probability and statistics have become very, very important, have also jumped forward."}, {"time": 2471, "text": "So, and that's different from linear algebra, quite different."}, {"time": 2475, "text": "So now we really have three major areas to me, calculus, linear algebra, matrices, and probability statistics."}, {"time": 2488, "text": "And they all deserve an important place."}, {"time": 2493, "text": "And calculus has traditionally had a lion's share of the time."}, {"time": 2500, "text": "A disproportionate share."}, {"time": 2501, "text": "It is, thank you, disproportionate, that's a good word."}, {"time": 2505, "text": "Of the love and attention from the excited young minds."}, {"time": 2512, "text": "I know it's hard to pick favorites, but what is your favorite matrix?"}, {"time": 2517, "text": "What's my favorite matrix?"}, {"time": 2519, "text": "Okay, so my favorite matrix is square, I admit it."}, {"time": 2523, "text": "It's a square bunch of numbers and it has twos running down the main diagonal."}, {"time": 2530, "text": "And on the next diagonal, so think of top left to bottom right, twos down the middle of the matrix and minus ones just above those twos and minus ones just below those twos and otherwise all zeros."}, {"time": 2546, "text": "So mostly zeros, just three nonzero diagonals coming down."}, {"time": 2552, "text": "What is interesting about it?"}, {"time": 2554, "text": "Well, all the different ways it comes up."}, {"time": 2557, "text": "You see it in engineering, you see it as analogous in calculus to second derivative."}, {"time": 2564, "text": "So calculus learns about taking the derivative, the figuring out how much, how fast something's changing."}, {"time": 2571, "text": "But second derivative, now that's also important."}, {"time": 2575, "text": "That's how fast the change is changing, how fast the graph is bending, how fast it's curving."}, {"time": 2586, "text": "And Einstein showed that that's fundamental to understand space."}, {"time": 2591, "text": "So second derivatives should have a bigger place in calculus."}, {"time": 2597, "text": "Second, my matrices, which are like the linear algebra version of second derivatives are neat in linear algebra."}, {"time": 2610, "text": "Yeah, just everything comes out right with those guys."}, {"time": 2615, "text": "What did you learn about the process of learning by having taught so many students math over the years?"}, {"time": 2622, "text": "Ooh, that is hard."}, {"time": 2625, "text": "I'll have to admit here that I'm not really a good teacher because I don't get into the exam part."}, {"time": 2635, "text": "The exam is the part of my life that I don't like and grading them and giving the students A or B or whatever."}, {"time": 2644, "text": "I do it because I'm supposed to do it, but I tell the class at the beginning, I don't know if they believe me."}, {"time": 2653, "text": "Probably they don't."}, {"time": 2654, "text": "I tell the class, I'm here to teach you."}, {"time": 2658, "text": "I'm here to teach you math and not to grade you."}, {"time": 2662, "text": "But they're thinking, okay, this guy is gonna, when is he gonna give me an A minus?"}, {"time": 2668, "text": "Is he gonna give me a B plus?"}, {"time": 2671, "text": "What have you learned about the process of learning?"}, {"time": 2674, "text": "Of learning."}, {"time": 2674, "text": "Yeah, well, maybe to give you a legitimate answer about learning, I should have paid more attention to the assessment, the evaluation part at the end."}, {"time": 2687, "text": "But I like the teaching part at the start."}, {"time": 2689, "text": "That's the sexy part."}, {"time": 2692, "text": "To tell somebody for the first time about a matrix, wow."}, {"time": 2696, "text": "Is there, are there moments, so you are teaching a concept, are there moments of learning that you just see in the student's eyes?"}, {"time": 2706, "text": "You don't need to look at the grades."}, {"time": 2708, "text": "But you see in their eyes that you hook them, that you connect with them in a way where, you know what, they fall in love with this beautiful world of math."}, {"time": 2721, "text": "They see that it's got some beauty there."}]}]