[{"title": "Ayanna Howard: Human-Robot Interaction & Ethics of Safety-Critical Systems | Lex Fridman Podcast #66", "id": "J21-7AsUcgM", "quotes": [{"time": 261, "text": "Some of it is because it's our world."}, {"time": 263, "text": "And so if you have a robot that is perfect in that sense of the word, they wouldn't really be able to function with us."}, {"time": 271, "text": "Can you linger a little bit on the word perfection?"}, {"time": 274, "text": "So from the robotics perspective, what does that word mean and how is sort of the optimal behavior as you're describing different than what we think is perfection?"}, {"time": 286, "text": "Yeah, so perfection, if you think about it in the more theoretical point of view, it's really tied to accuracy, right?"}, {"time": 294, "text": "So if I have a function, can I complete it at 100% accuracy with zero errors?"}, {"time": 300, "text": "And so that's kind of, if you think about perfection in the sense of the word."}, {"time": 305, "text": "And in the self driving car realm, do you think from a robotics perspective, we kind of think that perfection means following the rules perfectly, sort of defining, staying in the lane, changing lanes."}, {"time": 319, "text": "When there's a green light, you go."}, {"time": 320, "text": "When there's a red light, you stop."}, {"time": 322, "text": "And that's the, and be able to perfectly see all the entities in the scene."}, {"time": 329, "text": "That's the limit of what we think of as perfection."}, {"time": 331, "text": "And I think that's where the problem comes is that when people think about perfection for robotics, the ones that are the most successful are the ones that are quote unquote perfect."}, {"time": 343, "text": "Like I said, Rosie is perfect, but she actually wasn't perfect in terms of accuracy, but she was perfect in terms of how she interacted and how she adapted."}, {"time": 351, "text": "And I think that's some of the disconnect is that we really want perfection with respect to its ability to adapt to us."}, {"time": 359, "text": "We don't really want perfection with respect to 100% accuracy with respect to the rules that we just made up anyway, right?"}, {"time": 366, "text": "And so I think there's this disconnect sometimes between what we really want and what happens."}, {"time": 373, "text": "And we see this all the time, like in my research, right?"}, {"time": 375, "text": "Like the optimal, quote unquote optimal interactions are when the robot is adapting based on the person, not 100% following what's optimal based on the rules."}, {"time": 389, "text": "Just to link on autonomous vehicles for a second, just your thoughts, maybe off the top of the head, how hard is that problem do you think based on what we just talked about?"}, {"time": 400, "text": "There's a lot of folks in the automotive industry, they're very confident from Elon Musk to Waymo to all these companies."}, {"time": 407, "text": "How hard is it to solve that last piece?"}, {"time": 410, "text": "The last mile."}, {"time": 411, "text": "The gap between the perfection and the human definition of how you actually function in this world."}, {"time": 419, "text": "Yeah, so this is a moving target."}, {"time": 420, "text": "So I remember when all the big companies started to heavily invest in this and there was a number of even roboticists as well as folks who were putting in the VCs and corporations, Elon Musk being one of them that said, self driving cars on the road with people within five years, that was a little while ago."}, {"time": 444, "text": "And now people are saying five years, 10 years, 20 years, some are saying never, right?"}, {"time": 451, "text": "I think if you look at some of the things that are being successful is these basically fixed environments where you still have some anomalies, right?"}, {"time": 463, "text": "You still have people walking, you still have stores, but you don't have other drivers, right?"}, {"time": 470, "text": "Like other human drivers are, it's a dedicated space for the cars."}, {"time": 475, "text": "Because if you think about robotics in general, where has always been successful?"}, {"time": 479, "text": "I mean, you can say manufacturing, like way back in the day, right?"}, {"time": 482, "text": "It was a fixed environment, humans were not part of the equation, we're a lot better than that."}, {"time": 487, "text": "But like when we can carve out scenarios that are closer to that space, then I think that it's where we are."}, {"time": 496, "text": "So a closed campus where you don't have self driving cars and maybe some protection so that the students don't jet in front just because they wanna see what happens."}, {"time": 507, "text": "Like having a little bit, I think that's where we're gonna see the most success in the near future."}, {"time": 512, "text": "And be slow moving."}, {"time": 513, "text": "Right, not 55, 60, 70 miles an hour, but the speed of a golf cart, right?"}, {"time": 522, "text": "So that said, the most successful in the automotive industry robots operating today in the hands of real people are ones that are traveling over 55 miles an hour and in unconstrained environments, which is Tesla vehicles, so Tesla autopilot."}, {"time": 538, "text": "So I would love to hear sort of your, just thoughts of two things."}, {"time": 544, "text": "So one, I don't know if you've gotten to see, you've heard about something called smart summon where Tesla system, autopilot system, where the car drives zero occupancy, no driver in the parking lot slowly sort of tries to navigate the parking lot to find itself to you."}, {"time": 562, "text": "And there's some incredible amounts of videos and just hilarity that happens as it awkwardly tries to navigate this environment, but it's a beautiful nonverbal communication between machine and human that I think is a, it's like, it's some of the work that you do in this kind of interesting human robot interaction space."}, {"time": 582, "text": "So what are your thoughts in general about it?"}, {"time": 583, "text": "So I do have that feature."}, {"time": 586, "text": "Do you drive a Tesla?"}, {"time": 587, "text": "I do, mainly because I'm a gadget freak, right?"}, {"time": 592, "text": "So I say it's a gadget that happens to have some wheels."}, {"time": 595, "text": "And yeah, I've seen some of the videos."}, {"time": 598, "text": "But what's your experience like?"}, {"time": 599, "text": "I mean, you're a human robot interaction roboticist, you're a legit sort of expert in the field."}, {"time": 605, "text": "So what does it feel for a machine to come to you?"}, {"time": 608, "text": "It's one of these very fascinating things, but also I am hyper, hyper alert, right?"}, {"time": 616, "text": "Like I'm hyper alert, like my butt, my thumb is like, oh, okay, I'm ready to take over."}, {"time": 623, "text": "Even when I'm in my car or I'm doing things like automated backing into, so there's like a feature where you can do this automating backing into a parking space, or bring the car out of your garage, or even, you know, pseudo autopilot on the freeway, right?"}, {"time": 640, "text": "I am hypersensitive."}, {"time": 642, "text": "I can feel like as I'm navigating, like, yeah, that's an error right there."}, {"time": 646, "text": "Like I am very aware of it, but I'm also fascinated by it."}, {"time": 652, "text": "And it does get better."}, {"time": 654, "text": "Like I look and see it's learning from all of these people who are cutting it on, like every time I cut it on, it's getting better, right?"}, {"time": 664, "text": "And so I think that's what's amazing about it is that."}, {"time": 667, "text": "This nice dance of you're still hyper vigilant."}, {"time": 670, "text": "So you're still not trusting it at all."}, {"time": 673, "text": "And yet you're using it."}, {"time": 674, "text": "On the highway, if I were to, like what, as a roboticist, we'll talk about trust a little bit."}, {"time": 682, "text": "How do you explain that?"}, {"time": 683, "text": "You still use it."}, {"time": 685, "text": "Is it the gadget freak part?"}, {"time": 686, "text": "Like where you just enjoy exploring technology?"}, {"time": 690, "text": "Or is that the right actually balance between robotics and humans is where you use it, but don't trust it."}, {"time": 698, "text": "And somehow there's this dance that ultimately is a positive."}, {"time": 702, "text": "Yeah, so I think I'm, I just don't necessarily trust technology, but I'm an early adopter, right?"}, {"time": 710, "text": "So when it first comes out, I will use everything, but I will be very, very cautious of how I use it."}, {"time": 717, "text": "Do you read about it or do you explore it by just try it?"}, {"time": 721, "text": "Do you like crudely, to put it crudely, do you read the manual or do you learn through exploration?"}, {"time": 727, "text": "I'm an explorer."}, {"time": 728, "text": "If I have to read the manual, then I do design."}, {"time": 732, "text": "Then it's a bad user interface."}, {"time": 736, "text": "Elon Musk is very confident that you kind of take it from where it is now to full autonomy."}, {"time": 741, "text": "So from this human robot interaction, where you don't really trust and then you try and then you catch it when it fails to, it's going to incrementally improve itself into full where you don't need to participate."}, {"time": 756, "text": "What's your sense of that trajectory?"}, {"time": 759, "text": "Is it feasible?"}, {"time": 761, "text": "So the promise there is by the end of next year, by the end of 2020 is the current promise."}, {"time": 767, "text": "What's your sense about that journey that Tesla's on?"}, {"time": 773, "text": "So there's kind of three things going on though."}, {"time": 776, "text": "I think in terms of will people go like as a user, as a adopter, will you trust going to that point?"}, {"time": 788, "text": "I think so, right?"}, {"time": 790, "text": "Like there are some users and it's because what happens is when you're hypersensitive at the beginning and then the technology tends to work, your apprehension slowly goes away."}, {"time": 803, "text": "And as people, we tend to swing to the other extreme, right?"}, {"time": 808, "text": "Because it's like, oh, I was like hyper, hyper fearful or hypersensitive and it was awesome."}, {"time": 813, "text": "And we just tend to swing."}, {"time": 815, "text": "That's just human nature."}, {"time": 817, "text": "And so you will have, I mean, and I... That's a scary notion because most people are now extremely untrusting of autopilot."}, {"time": 824, "text": "They use it, but they don't trust it."}, {"time": 826, "text": "And it's a scary notion that there's a certain point where you allow yourself to look at the smartphone for like 20 seconds."}, {"time": 833, "text": "And then there'll be this phase shift where it'll be like 20 seconds, 30 seconds, one minute, two minutes."}, {"time": 839, "text": "It's a scary proposition."}, {"time": 842, "text": "But that's people, right?"}, {"time": 843, "text": "That's just, that's humans."}, {"time": 845, "text": "I mean, I think of even our use of, I mean, just everything on the internet, right?"}, {"time": 852, "text": "Like think about how reliant we are on certain apps and certain engines, right?"}, {"time": 860, "text": "20 years ago, people have been like, oh yeah, that's stupid."}, {"time": 862, "text": "Like that makes no sense."}, {"time": 863, "text": "Like, of course that's false."}, {"time": 865, "text": "Like now it's just like, oh, of course I've been using it."}, {"time": 869, "text": "It's been correct all this time."}, {"time": 870, "text": "Of course aliens, I didn't think they existed, but now it says they do, obviously."}, {"time": 877, "text": "100%, earth is flat."}, {"time": 879, "text": "So, okay, but you said three things."}, {"time": 883, "text": "So one is the human."}, {"time": 884, "text": "Okay, so one is the human."}, {"time": 885, "text": "And I think there will be a group of individuals that will swing, right?"}, {"time": 890, "text": "Teenagers."}, {"time": 891, "text": "Teenage, I mean, it'll be, it'll be adults."}, {"time": 894, "text": "There's actually an age demographic that's optimal for technology adoption."}, {"time": 900, "text": "And you can actually find them."}, {"time": 902, "text": "And they're actually pretty easy to find."}, {"time": 903, "text": "Just based on their habits, based on, so if someone like me who wasn't a roboticist would probably be the optimal kind of person, right?"}, {"time": 913, "text": "Early adopter, okay with technology, very comfortable and not hypersensitive, right?"}, {"time": 920, "text": "I'm just hypersensitive cause I designed this stuff."}, {"time": 923, "text": "So there is a target demographic that will swing."}, {"time": 925, "text": "The other one though, is you still have these humans that are on the road."}, {"time": 931, "text": "That one is a harder, harder thing to do."}, {"time": 935, "text": "And as long as we have people that are on the same streets, that's gonna be the big issue."}, {"time": 942, "text": "And it's just because you can't possibly, I wanna say you can't possibly map the, some of the silliness of human drivers, right?"}, {"time": 951, "text": "Like as an example, when you're next to that car that has that big sticker called student driver, right?"}, {"time": 959, "text": "Like you are like, oh, either I'm going to like go around."}, {"time": 964, "text": "Like we are, we know that that person is just gonna make mistakes that make no sense, right?"}, {"time": 969, "text": "How do you map that information?"}, {"time": 971, "text": "Or if I am in a car and I look over and I see two fairly young looking individuals and there's no student driver bumper and I see them chit chatting to each other, I'm like, oh, that's an issue, right?"}, {"time": 986, "text": "So how do you get that kind of information and that experience into basically an autopilot?"}, {"time": 995, "text": "And there's millions of cases like that where we take little hints to establish context."}, {"time": 1001, "text": "I mean, you said kind of beautifully poetic human things, but there's probably subtle things about the environment about it being maybe time for commuters to start going home from work and therefore you can make some kind of judgment about the group behavior of pedestrians, blah, blah, blah, and so on and so on."}, {"time": 1021, "text": "Or even cities, right?"}, {"time": 1022, "text": "Like if you're in Boston, how people cross the street, like lights are not an issue versus other places where people will actually wait for the crosswalk."}, {"time": 1035, "text": "Seattle or somewhere peaceful."}, {"time": 1038, "text": "But what I've also seen sort of just even in Boston that intersection to intersection is different."}, {"time": 1045, "text": "So every intersection has a personality of its own."}, {"time": 1048, "text": "So certain neighborhoods of Boston are different."}, {"time": 1050, "text": "So we kind of, and based on different timing of day, at night, it's all, there's a dynamic to human behavior that we kind of figure out ourselves."}, {"time": 1062, "text": "We're not able to introspect and figure it out, but somehow our brain learns it."}, {"time": 1070, "text": "And so you're saying, is there a shortcut?"}, {"time": 1074, "text": "Is there a shortcut, though, for a robot?"}, {"time": 1076, "text": "Is there something that could be done, you think, that, you know, that's what we humans do."}, {"time": 1082, "text": "It's just like bird flight, right?"}, {"time": 1084, "text": "That's the example they give for flight."}, {"time": 1086, "text": "Do you necessarily need to build a bird that flies or can you do an airplane?"}, {"time": 1091, "text": "Is there a shortcut to it?"}, {"time": 1093, "text": "So I think the shortcut is, and I kind of, I talk about it as a fixed space, where, so imagine that there's a neighborhood that's a new smart city or a new neighborhood that says, you know what?"}, {"time": 1107, "text": "We are going to design this new city based on supporting self driving cars."}, {"time": 1113, "text": "And then doing things, knowing that there's anomalies, knowing that people are like this, right?"}, {"time": 1119, "text": "And designing it based on that assumption that like, we're gonna have this."}, {"time": 1123, "text": "That would be an example of a shortcut."}, {"time": 1125, "text": "So you still have people, but you do very specific things to try to minimize the noise a little bit as an example."}, {"time": 1133, "text": "And the people themselves become accepting of the notion that there's autonomous cars, right?"}, {"time": 1137, "text": "Right, like they move into, so right now you have like a, you will have a self selection bias, right?"}, {"time": 1143, "text": "Like individuals will move into this neighborhood knowing like this is part of like the real estate pitch, right?"}, {"time": 1150, "text": "And so I think that's a way to do a shortcut."}, {"time": 1154, "text": "One, it allows you to deploy."}, {"time": 1157, "text": "It allows you to collect then data with these variances and anomalies, cause people are still people, but it's a safer space and it's more of an accepting space."}, {"time": 1168, "text": "I.e."}, {"time": 1168, "text": "when something in that space might happen because things do, because you already have the self selection, like people would be, I think a little more forgiving than other places."}, {"time": 1180, "text": "And you said three things, did we cover all of them?"}, {"time": 1183, "text": "The third is legal law, liability, which I don't really want to touch, but it's still of concern."}, {"time": 1190, "text": "And the mishmash with like with policy as well, sort of government, all that whole."}, {"time": 1195, "text": "That big ball of stuff."}, {"time": 1197, "text": "Yeah, gotcha."}, {"time": 1199, "text": "So that's, so we're out of time now."}, {"time": 1203, "text": "Do you think from a robotics perspective, you know, if you're kind of honest of what cars do, they kind of threaten each other's life all the time."}, {"time": 1214, "text": "So cars are various."}, {"time": 1217, "text": "I mean, in order to navigate intersections, there's an assertiveness, there's a risk taking."}, {"time": 1222, "text": "And if you were to reduce it to an objective function, there's a probability of murder in that function, meaning you killing another human being and you're using that."}, {"time": 1233, "text": "First of all, it has to be low enough to be acceptable to you on an ethical level as an individual human being, but it has to be high enough for people to respect you to not sort of take advantage of you completely and jaywalk in front of you and so on."}, {"time": 1249, "text": "So, I mean, I don't think there's a right answer here, but what's, how do we solve that?"}, {"time": 1256, "text": "How do we solve that from a robotics perspective when danger and human life is at stake?"}, {"time": 1260, "text": "Yeah, as they say, cars don't kill people, people kill people."}, {"time": 1262, "text": "People kill people."}, {"time": 1267, "text": "So I think."}, {"time": 1268, "text": "And now robotic algorithms would be killing people."}, {"time": 1270, "text": "Right, so it will be robotics algorithms that are pro, no, it will be robotic algorithms don't kill people."}, {"time": 1276, "text": "Developers of robotic algorithms kill people, right?"}, {"time": 1279, "text": "I mean, one of the things is people are still in the loop and at least in the near and midterm, I think people will still be in the loop at some point, even if it's a developer."}, {"time": 1290, "text": "Like we're not necessarily at the stage where robots are programming autonomous robots with different behaviors quite yet."}, {"time": 1299, "text": "It's a scary notion, sorry to interrupt, that a developer has some responsibility in the death of a human being."}, {"time": 1309, "text": "That's a heavy burden."}, {"time": 1310, "text": "I mean, I think that's why the whole aspect of ethics in our community is so, so important, right?"}, {"time": 1318, "text": "Like, because it's true."}, {"time": 1320, "text": "If you think about it, you can basically say, I'm not going to work on weaponized AI, right?"}, {"time": 1327, "text": "Like people can say, that's not what I'm gonna do."}, {"time": 1329, "text": "But yet you are programming algorithms that might be used in healthcare algorithms that might decide whether this person should get this medication or not."}, {"time": 1338, "text": "And they don't and they die."}, {"time": 1341, "text": "Okay, so that is your responsibility, right?"}, {"time": 1345, "text": "And if you're not conscious and aware that you do have that power when you're coding and things like that, I think that's just not a good thing."}, {"time": 1355, "text": "Like we need to think about this responsibility as we program robots and computing devices much more than we are."}, {"time": 1364, "text": "Yeah, so it's not an option to not think about ethics."}, {"time": 1366, "text": "I think it's a majority, I would say, of computer science."}, {"time": 1371, "text": "Sort of, it's kind of a hot topic now, I think about bias and so on, but it's, and we'll talk about it, but usually it's kind of, it's like a very particular group of people that work on that."}, {"time": 1384, "text": "And then people who do like robotics are like, well, I don't have to think about that."}, {"time": 1389, "text": "There's other smart people thinking about it."}, {"time": 1391, "text": "It seems that everybody has to think about it."}, {"time": 1394, "text": "It's not, you can't escape the ethics, whether it's bias or just every aspect of ethics that has to do with human beings."}, {"time": 1402, "text": "Everyone."}, {"time": 1403, "text": "So think about, I'm gonna age myself, but I remember when we didn't have like testers, right?"}, {"time": 1410, "text": "And so what did you do?"}, {"time": 1411, "text": "As a developer, you had to test your own code, right?"}, {"time": 1413, "text": "Like you had to go through all the cases and figure it out and then they realized that, we probably need to have testing because we're not getting all the things."}, {"time": 1422, "text": "And so from there, what happens is like most developers, they do a little bit of testing, but it's usually like, okay, did my compiler bug out?"}, {"time": 1429, "text": "Let me look at the warnings."}, {"time": 1431, "text": "Okay, is that acceptable or not, right?"}, {"time": 1433, "text": "Like that's how you typically think about as a developer and you'll just assume that it's going to go to another process and they're gonna test it out."}, {"time": 1441, "text": "But I think we need to go back to those early days when you're a developer, you're developing, there should be like the say, okay, let me look at the ethical outcomes of this because there isn't a second like testing ethical testers, right, it's you."}, {"time": 1458, "text": "We did it back in the early coding days."}, {"time": 1461, "text": "I think that's where we are with respect to ethics."}, {"time": 1463, "text": "Like let's go back to what was good practices and only because we were just developing the field."}, {"time": 1470, "text": "Yeah, and it's a really heavy burden."}, {"time": 1473, "text": "I've had to feel it recently in the last few months, but I think it's a good one to feel like I've gotten a message, more than one from people."}, {"time": 1483, "text": "You know, I've unfortunately gotten some attention recently and I've gotten messages that say that I have blood on my hands because of working on semi autonomous vehicles."}, {"time": 1496, "text": "So the idea that you have semi autonomy means people will become, will lose vigilance and so on."}, {"time": 1502, "text": "That's actually be humans, as we described."}, {"time": 1505, "text": "And because of that, because of this idea that we're creating automation, there'll be people be hurt because of it."}, {"time": 1512, "text": "And I think that's a beautiful thing."}, {"time": 1514, "text": "I mean, it's, you know, there's many nights where I wasn't able to sleep because of this notion."}, {"time": 1518, "text": "You know, you really do think about people that might die because of this technology."}, {"time": 1523, "text": "Of course, you can then start rationalizing saying, well, you know what, 40,000 people die in the United States every year and we're trying to ultimately try to save lives."}, {"time": 1532, "text": "But the reality is your code you've written might kill somebody."}, {"time": 1536, "text": "And that's an important burden to carry with you as you design the code."}, {"time": 1541, "text": "I don't even think of it as a burden if we train this concept correctly from the beginning."}, {"time": 1547, "text": "And I use, and not to say that coding is like being a medical doctor, but think about it."}, {"time": 1552, "text": "Medical doctors, if they've been in situations where their patient didn't survive, right?"}, {"time": 1558, "text": "Do they give up and go away?"}, {"time": 1560, "text": "No, every time they come in, they know that there might be a possibility that this patient might not survive."}, {"time": 1567, "text": "And so when they approach every decision, like that's in the back of their head."}, {"time": 1571, "text": "And so why isn't that we aren't teaching, and those are tools though, right?"}, {"time": 1577, "text": "They are given some of the tools to address that so that they don't go crazy."}, {"time": 1581, "text": "But we don't give those tools so that it does feel like a burden versus something of I have a great gift and I can do great, awesome good, but with it comes great responsibility."}, {"time": 1593, "text": "I mean, that's what we teach in terms of if you think about the medical schools, right?"}, {"time": 1597, "text": "Great gift, great responsibility."}, {"time": 1599, "text": "I think if we just change the messaging a little, great gift, being a developer, great responsibility."}, {"time": 1605, "text": "And this is how you combine those."}, {"time": 1608, "text": "But do you think, I mean, this is really interesting."}, {"time": 1612, "text": "It's outside, I actually have no friends who are sort of surgeons or doctors."}, {"time": 1618, "text": "I mean, what does it feel like to make a mistake in a surgery and somebody to die because of that?"}, {"time": 1624, "text": "Like, is that something you could be taught in medical school, sort of how to be accepting of that risk?"}, {"time": 1630, "text": "So, because I do a lot of work with healthcare robotics, I have not lost a patient, for example."}, {"time": 1638, "text": "The first one's always the hardest, right?"}, {"time": 1640, "text": "But they really teach the value, right?"}, {"time": 1647, "text": "So, they teach responsibility, but they also teach the value."}, {"time": 1650, "text": "Like, you're saving 40,000, but in order to really feel good about that, when you come to a decision, you have to be able to say at the end, I did all that I could possibly do, right?"}, {"time": 1665, "text": "Versus a, well, I just picked the first widget, right?"}, {"time": 1669, "text": "Like, so every decision is actually thought through."}, {"time": 1672, "text": "It's not a habit, it's not a, let me just take the best algorithm that my friend gave me, right?"}, {"time": 1677, "text": "It's a, is this it, is this the best?"}, {"time": 1679, "text": "Have I done my best to do good, right?"}, {"time": 1683, "text": "And so... You're right, and I think burden is the wrong word."}, {"time": 1686, "text": "It's a gift, but you have to treat it extremely seriously."}, {"time": 1693, "text": "So, on a slightly related note, in a recent paper, The Ugly Truth About Ourselves and Our Robot Creations, you discuss, you highlight some biases that may affect the function of various robotic systems."}, {"time": 1707, "text": "Can you talk through, if you remember, examples of some?"}, {"time": 1710, "text": "There's a lot of examples."}, {"time": 1711, "text": "I usually... What is bias, first of all?"}, {"time": 1713, "text": "Yeah, so bias is this, and so bias, which is different than prejudice."}, {"time": 1718, "text": "So, bias is that we all have these preconceived notions about particular, everything from particular groups to habits to identity, right?"}, {"time": 1729, "text": "So, we have these predispositions, and so when we address a problem, we look at a problem and make a decision, those preconceived notions might affect our outputs, our outcomes."}, {"time": 1742, "text": "So, there the bias can be positive and negative, and then is prejudice the negative kind of bias?"}, {"time": 1747, "text": "Prejudice is the negative, right?"}, {"time": 1749, "text": "So, prejudice is that not only are you aware of your bias, but you are then take it and have a negative outcome, even though you're aware, like... And there could be gray areas too."}, {"time": 1762, "text": "There's always gray areas."}, {"time": 1764, "text": "That's the challenging aspect of all ethical questions."}, {"time": 1767, "text": "So, I always like..."}, {"time": 1768, "text": "So, there's a funny one, and in fact, I think it might be in the paper, because I think I talk about self driving cars, but think about this."}, {"time": 1775, "text": "We, for teenagers, right?"}, {"time": 1779, "text": "Typically, insurance companies charge quite a bit of money if you have a teenage driver."}, {"time": 1786, "text": "So, you could say that's an age bias, right?"}, {"time": 1790, "text": "But no one will claim..."}, {"time": 1792, "text": "I mean, parents will be grumpy, but no one really says that that's not fair."}, {"time": 1799, "text": "We don't... That's right, that's right."}, {"time": 1801, "text": "It's everybody in human factors and safety research almost..."}, {"time": 1806, "text": "I mean, it's quite ruthlessly critical of teenagers."}, {"time": 1812, "text": "And we don't question, is that okay?"}, {"time": 1815, "text": "Is that okay to be ageist in this kind of way?"}, {"time": 1817, "text": "It is, and it is ageist, right?"}, {"time": 1818, "text": "It's definitely ageist, there's no question about it."}, {"time": 1820, "text": "And so, this is the gray area, right?"}, {"time": 1824, "text": "Because you know that teenagers are more likely to be in accidents, and so, there's actually some data to it."}, {"time": 1833, "text": "But then, if you take that same example, and you say, well, I'm going to make the insurance higher for an area of Boston, because there's a lot of accidents."}, {"time": 1845, "text": "And then, they find out that that's correlated with socioeconomics."}, {"time": 1850, "text": "Well, then it becomes a problem, right?"}, {"time": 1852, "text": "Like, that is not acceptable, but yet, the teenager, which is age..."}, {"time": 1858, "text": "It's against age, is, right?"}, {"time": 1861, "text": "We figure that out as a society by having conversations, by having discourse."}, {"time": 1866, "text": "I mean, throughout history, the definition of what is ethical or not has changed, and hopefully, always for the better."}, {"time": 1875, "text": "So, in terms of bias or prejudice in algorithms, what examples do you sometimes think about?"}, {"time": 1885, "text": "So, I think about quite a bit the medical domain, just because historically, right?"}, {"time": 1891, "text": "The healthcare domain has had these biases, typically based on gender and ethnicity, primarily."}, {"time": 1900, "text": "A little in age, but not so much."}, {"time": 1903, "text": "Historically, if you think about FDA and drug trials, it's harder to find a woman that aren't childbearing, and so you may not test on drugs at the same level."}, {"time": 1916, "text": "Right, so there's these things."}, {"time": 1918, "text": "And so, if you think about robotics, right?"}, {"time": 1922, "text": "Something as simple as, I'd like to design an exoskeleton, right?"}, {"time": 1927, "text": "What should the material be?"}, {"time": 1929, "text": "What should the weight be?"}, {"time": 1930, "text": "What should the form factor be?"}, {"time": 1934, "text": "Who are you gonna design it around?"}, {"time": 1936, "text": "I will say that in the US, women average height and weight is slightly different than guys."}, {"time": 1943, "text": "So, who are you gonna choose?"}, {"time": 1945, "text": "Like, if you're not thinking about it from the beginning, as, okay, when I design this and I look at the algorithms and I design the control system and the forces and the torques, if you're not thinking about, well, you have different types of body structure, you're gonna design to what you're used to."}, {"time": 1964, "text": "Oh, this fits all the folks in my lab, right?"}, {"time": 1968, "text": "So, think about it from the very beginning is important."}, {"time": 1971, "text": "What about sort of algorithms that train on data kind of thing?"}, {"time": 1975, "text": "Sadly, our society already has a lot of negative bias."}, {"time": 1981, "text": "And so, if we collect a lot of data, even if it's a balanced way, that's going to contain the same bias that our society contains."}, {"time": 1988, "text": "And so, yeah, is there things there that bother you?"}, {"time": 1993, "text": "Yeah, so you actually said something."}, {"time": 1995, "text": "You had said how we have biases, but hopefully we learn from them and we become better, right?"}, {"time": 2002, "text": "And so, that's where we are now, right?"}, {"time": 2004, "text": "So, the data that we're collecting is historic."}, {"time": 2008, "text": "So, it's based on these things when we knew it was bad to discriminate, but that's the data we have and we're trying to fix it now, but we're fixing it based on the data that was used in the first place."}, {"time": 2019, "text": "Fix it in post."}, {"time": 2020, "text": "Right, and so the decisions, and you can look at everything from the whole aspect of predictive policing, criminal recidivism."}, {"time": 2031, "text": "There was a recent paper that had the healthcare algorithms, which had a kind of a sensational titles."}, {"time": 2038, "text": "I'm not pro sensationalism in titles, but again, you read it, right?"}, {"time": 2043, "text": "So, it makes you read it, but I'm like, really?"}, {"time": 2046, "text": "Like, ugh, you could have."}, {"time": 2048, "text": "What's the topic of the sensationalism?"}, {"time": 2050, "text": "I mean, what's underneath it?"}, {"time": 2053, "text": "What's, if you could sort of educate me on what kind of bias creeps into the healthcare space."}, {"time": 2059, "text": "I mean, you already kind of mentioned."}, {"time": 2061, "text": "Yeah, so this one was the headline was racist AI algorithms."}, {"time": 2067, "text": "Okay, like, okay, that's totally a clickbait title."}, {"time": 2070, "text": "And so you looked at it and so there was data that these researchers had collected."}, {"time": 2076, "text": "I believe, I wanna say it was either Science or Nature."}, {"time": 2079, "text": "It just was just published, but they didn't have a sensational title."}, {"time": 2082, "text": "It was like the media."}, {"time": 2084, "text": "And so they had looked at demographics, I believe, between black and white women, right?"}, {"time": 2091, "text": "And they showed that there was a discrepancy in the outcomes, right?"}, {"time": 2098, "text": "And so, and it was tied to ethnicity, tied to race."}, {"time": 2102, "text": "The piece that the researchers did actually went through the whole analysis, but of course."}, {"time": 2108, "text": "I mean, the journalists with AI are problematic across the board, let's say."}, {"time": 2114, "text": "And so this is a problem, right?"}, {"time": 2115, "text": "And so there's this thing about, oh, AI, it has all these problems."}, {"time": 2120, "text": "We're doing it on historical data and the outcomes are uneven based on gender or ethnicity or age."}, {"time": 2127, "text": "But I am always saying is like, yes, we need to do better, right?"}, {"time": 2132, "text": "We need to do better."}, {"time": 2133, "text": "It is our duty to do better."}, {"time": 2136, "text": "But the worst AI is still better than us."}, {"time": 2139, "text": "Like, you take the best of us and we're still worse than the worst AI, at least in terms of these things."}, {"time": 2145, "text": "And that's actually not discussed, right?"}, {"time": 2147, "text": "And so I think, and that's why the sensational title, right?"}, {"time": 2151, "text": "And so it's like, so then you can have individuals go like, oh, we don't need to use this AI."}, {"time": 2155, "text": "I'm like, oh, no, no, no, no."}, {"time": 2156, "text": "I want the AI instead of the doctors that provided that data, because it's still better than that, right?"}, {"time": 2164, "text": "I think that's really important to linger on, is the idea that this AI is racist."}, {"time": 2170, "text": "It's like, well, compared to what?"}, {"time": 2174, "text": "Sort of, I think we set, unfortunately, way too high of a bar for AI algorithms."}, {"time": 2183, "text": "And in the ethical space where perfect is, I would argue, probably impossible."}, {"time": 2188, "text": "Then if we set the bar of perfection, essentially, of it has to be perfectly fair, whatever that means, it means we're setting it up for failure."}, {"time": 2199, "text": "But that's really important to say what you just said, which is, well, it's still better than it is."}, {"time": 2204, "text": "And one of the things I think that we don't get enough credit for, just in terms of as developers, is that you can now poke at it, right?"}, {"time": 2215, "text": "So it's harder to say, is this hospital, is this city doing something, right?"}, {"time": 2221, "text": "Until someone brings in a civil case, right?"}, {"time": 2224, "text": "Well, with AI, it can process through all this data and say, hey, yes, there was an issue here, but here it is, we've identified it, and then the next step is to fix it."}, {"time": 2236, "text": "I mean, that's a nice feedback loop versus waiting for someone to sue someone else before it's fixed, right?"}, {"time": 2242, "text": "And so I think that power, we need to capitalize on a little bit more, right?"}, {"time": 2247, "text": "Instead of having the sensational titles, have the, okay, this is a problem, and this is how we're fixing it, and people are putting money to fix it because we can make it better."}, {"time": 2258, "text": "I look at like facial recognition, how Joy, she basically called out a couple of companies and said, hey, and most of them were like, oh, embarrassment, and the next time it had been fixed, right, it had been fixed better, right?"}, {"time": 2274, "text": "And then it was like, oh, here's some more issues."}, {"time": 2276, "text": "And I think that conversation then moves that needle to having much more fair and unbiased and ethical aspects, as long as both sides, the developers are willing to say, okay, I hear you, yes, we are going to improve, and you have other developers who are like, hey, AI, it's wrong, but I love it, right?"}, {"time": 2299, "text": "Yes, so speaking of this really nice notion that AI is maybe flawed but better than humans, so just made me think of it, one example of flawed humans is our political system."}, {"time": 2314, "text": "Do you think, or you said judicial as well, do you have a hope for AI sort of being elected for president or running our Congress or being able to be a powerful representative of the people?"}, {"time": 2333, "text": "So I mentioned, and I truly believe that this whole world of AI is in partnerships with people."}, {"time": 2341, "text": "And so what does that mean?"}, {"time": 2342, "text": "I don't believe, or maybe I just don't, I don't believe that we should have an AI for president, but I do believe that a president should use AI as an advisor, right?"}, {"time": 2355, "text": "Like, if you think about it, every president has a cabinet of individuals that have different expertise that they should listen to, right?"}, {"time": 2366, "text": "Like, that's kind of what we do."}, {"time": 2367, "text": "And you put smart people with smart expertise around certain issues, and you listen."}, {"time": 2373, "text": "I don't see why AI can't function as one of those smart individuals giving input."}, {"time": 2379, "text": "So maybe there's an AI on healthcare, maybe there's an AI on education and right, like all of these things that a human is processing, right?"}, {"time": 2388, "text": "Because at the end of the day, there's people that are human that are going to be at the end of the decision."}, {"time": 2395, "text": "And I don't think as a world, as a culture, as a society, that we would totally, and this is us, like this is some fallacy about us, but we need to see that leader, that person as human."}, {"time": 2411, "text": "And most people don't realize that like leaders have a whole lot of advice, right?"}, {"time": 2416, "text": "Like when they say something, it's not that they woke up, well, usually they don't wake up in the morning and be like, I have a brilliant idea, right?"}, {"time": 2424, "text": "It's usually a, okay, let me listen."}, {"time": 2426, "text": "I have a brilliant idea, but let me get a little bit of feedback on this."}, {"time": 2430, "text": "And then it's a, yeah, that was an awesome idea or it's like, yeah, let me go back."}, {"time": 2435, "text": "We already talked through a bunch of them, but are there some possible solutions to the bias that's present in our algorithms beyond what we just talked about?"}, {"time": 2446, "text": "So I think there's two paths."}, {"time": 2449, "text": "One is to figure out how to systematically do the feedback and corrections."}, {"time": 2456, "text": "So right now it's ad hoc, right?"}, {"time": 2457, "text": "It's a researcher identify some outcomes that are not, don't seem to be fair, right?"}, {"time": 2465, "text": "They publish it, they write about it."}, {"time": 2467, "text": "And the, either the developer or the companies that have adopted the algorithms may try to fix it, right?"}, {"time": 2474, "text": "And so it's really ad hoc and it's not systematic."}, {"time": 2478, "text": "There's, it's just, it's kind of like, I'm a researcher, that seems like an interesting problem, which means that there's a whole lot out there that's not being looked at, right?"}, {"time": 2488, "text": "Cause it's kind of researcher driven."}, {"time": 2492, "text": "And I don't necessarily have a solution, but that process I think could be done a little bit better."}, {"time": 2501, "text": "One way is I'm going to poke a little bit at some of the corporations, right?"}, {"time": 2508, "text": "Like maybe the corporations when they think about a product, they should, instead of, in addition to hiring these, you know, bug, they give these."}, {"time": 2519, "text": "Oh yeah, yeah, yeah."}, {"time": 2521, "text": "Like awards when you find a bug."}, {"time": 2522, "text": "Yeah, security bug, you know, let's put it like we will give the, whatever the award is that we give for the people who find these security holes, find an ethics hole, right?"}, {"time": 2533, "text": "Like find an unfairness hole and we will pay you X for each one you find."}, {"time": 2537, "text": "I mean, why can't they do that?"}, {"time": 2539, "text": "One is a win win."}, {"time": 2540, "text": "They show that they're concerned about it, that this is important and they don't have to necessarily dedicate it their own like internal resources."}, {"time": 2548, "text": "And it also means that everyone who has like their own bias lens, like I'm interested in age."}, {"time": 2554, "text": "And so I'll find the ones based on age and I'm interested in gender and right, which means that you get like all of these different perspectives."}, {"time": 2561, "text": "But you think of it in a data driven way."}, {"time": 2563, "text": "So like sort of, if we look at a company like Twitter, it gets, it's under a lot of fire for discriminating against certain political beliefs."}, {"time": 2575, "text": "And sort of, there's a lot of people, this is the sad thing, cause I know how hard the problem is and I know the Twitter folks are working really hard at it."}, {"time": 2583, "text": "Even Facebook that everyone seems to hate are working really hard at this."}, {"time": 2586, "text": "You know, the kind of evidence that people bring is basically anecdotal evidence."}, {"time": 2591, "text": "Well, me or my friend, all we said is X and for that we got banned."}, {"time": 2597, "text": "And that's kind of a discussion of saying, well, look, that's usually, first of all, the whole thing is taken out of context."}, {"time": 2605, "text": "So they present sort of anecdotal evidence."}, {"time": 2608, "text": "And how are you supposed to, as a company, in a healthy way, have a discourse about what is and isn't ethical?"}, {"time": 2615, "text": "How do we make algorithms ethical when people are just blowing everything?"}, {"time": 2620, "text": "Like they're outraged about a particular anecdotal piece of evidence that's very difficult to sort of contextualize in the big data driven way."}, {"time": 2632, "text": "Do you have a hope for companies like Twitter and Facebook?"}, {"time": 2635, "text": "Yeah, so I think there's a couple of things going on, right?"}, {"time": 2639, "text": "First off, remember this whole aspect of we are becoming reliant on technology."}, {"time": 2649, "text": "We're also becoming reliant on a lot of these, the apps and the resources that are provided, right?"}, {"time": 2657, "text": "So some of it is kind of anger, like I need you, right?"}, {"time": 2661, "text": "And you're not working for me, right?"}, {"time": 2663, "text": "Not working for me, all right."}, {"time": 2664, "text": "But I think, and so some of it, and I wish that there was a little bit of change of rethinking."}, {"time": 2672, "text": "So some of it is like, oh, we'll fix it in house."}, {"time": 2675, "text": "No, that's like, okay, I'm a fox and I'm going to watch these hens because I think it's a problem that foxes eat hens."}, {"time": 2685, "text": "Like be good citizens and say, look, we have a problem."}, {"time": 2690, "text": "And we are willing to open ourselves up for others to come in and look at it and not try to fix it in house."}, {"time": 2698, "text": "Because if you fix it in house, there's conflict of interest."}, {"time": 2701, "text": "If I find something, I'm probably going to want to fix it and hopefully the media won't pick it up, right?"}, {"time": 2707, "text": "And that then causes distrust because someone inside is going to be mad at you and go out and talk about how, yeah, they canned the resume survey because it, right?"}, {"time": 2717, "text": "Like be nice people."}, {"time": 2719, "text": "Like just say, look, we have this issue."}, {"time": 2722, "text": "Community, help us fix it."}, {"time": 2724, "text": "And we will give you like, you know, the bug finder fee if you do."}, {"time": 2728, "text": "Did you ever hope that the community, us as a human civilization on the whole is good and can be trusted to guide the future of our civilization into a positive direction?"}, {"time": 2741, "text": "So I'm an optimist, right?"}, {"time": 2744, "text": "And, you know, there were some dark times in history always."}, {"time": 2749, "text": "I think now we're in one of those dark times."}, {"time": 2752, "text": "I truly do."}, {"time": 2753, "text": "In which aspect?"}, {"time": 2754, "text": "The polarization."}, {"time": 2756, "text": "And it's not just US, right?"}, {"time": 2757, "text": "So if it was just US, I'd be like, yeah, it's a US thing, but we're seeing it like worldwide, this polarization."}, {"time": 2764, "text": "And so I worry about that."}, {"time": 2766, "text": "But I do fundamentally believe that at the end of the day, people are good, right?"}, {"time": 2773, "text": "And why do I say that?"}, {"time": 2774, "text": "Because anytime there's a scenario where people are in danger and I will use, so Atlanta, we had a snowmageddon and people can laugh about that."}, {"time": 2786, "text": "People at the time, so the city closed for, you know, little snow, but it was ice and the city closed down."}, {"time": 2793, "text": "But you had people opening up their homes and saying, hey, you have nowhere to go, come to my house, right?"}, {"time": 2799, "text": "Hotels were just saying like, sleep on the floor."}, {"time": 2801, "text": "Like places like, you know, the grocery stores were like, hey, here's food."}, {"time": 2805, "text": "There was no like, oh, how much are you gonna pay me?"}, {"time": 2807, "text": "It was like this, such a community."}, {"time": 2810, "text": "And like people who didn't know each other, strangers were just like, can I give you a ride home?"}, {"time": 2815, "text": "And that was a point I was like, you know what, like."}, {"time": 2819, "text": "That reveals that the deeper thing is, there's a compassionate love that we all have within us."}, {"time": 2826, "text": "It's just that when all of that is taken care of and get bored, we love drama."}, {"time": 2831, "text": "And that's, I think almost like the division is a sign of the times being good, is that it's just entertaining on some unpleasant mammalian level to watch, to disagree with others."}, {"time": 2846, "text": "And Twitter and Facebook are actually taking advantage of that in a sense because it brings you back to the platform and they're advertiser driven, so they make a lot of money."}, {"time": 2857, "text": "So you go back and you click."}, {"time": 2859, "text": "Love doesn't sell quite as well in terms of advertisement."}, {"time": 2864, "text": "So you've started your career at NASA Jet Propulsion Laboratory, but before I ask a few questions there, have you happened to have ever seen Space Odyssey, 2001 Space Odyssey?"}, {"time": 2878, "text": "Okay, do you think HAL 9000, so we're talking about ethics."}, {"time": 2883, "text": "Do you think HAL did the right thing by taking the priority of the mission over the lives of the astronauts?"}, {"time": 2890, "text": "Do you think HAL is good or evil?"}, {"time": 2899, "text": "HAL was misguided."}, {"time": 2901, "text": "You're one of the people that would be in charge of an algorithm like HAL."}, {"time": 2906, "text": "What would you do better?"}, {"time": 2908, "text": "If you think about what happened was there was no fail safe, right?"}, {"time": 2915, "text": "So perfection, right?"}, {"time": 2917, "text": "Like what is that?"}, {"time": 2918, "text": "I'm gonna make something that I think is perfect, but if my assumptions are wrong, it'll be perfect based on the wrong assumptions, right?"}, {"time": 2927, "text": "That's something that you don't know until you deploy and then you're like, oh yeah, messed up."}, {"time": 2933, "text": "But what that means is that when we design software, such as in Space Odyssey, when we put things out, that there has to be a fail safe."}, {"time": 2944, "text": "There has to be the ability that once it's out there, we can grade it as an F and it fails and it doesn't continue, right?"}, {"time": 2953, "text": "There's some way that it can be brought in and removed in that aspect."}, {"time": 2959, "text": "Because that's what happened with HAL."}, {"time": 2961, "text": "It was like assumptions were wrong."}, {"time": 2963, "text": "It was perfectly correct based on those assumptions and there was no way to change it, change the assumptions at all."}, {"time": 2974, "text": "And the change to fall back would be to a human."}, {"time": 2977, "text": "So you ultimately think like human should be, it's not turtles or AI all the way down."}, {"time": 2985, "text": "It's at some point, there's a human that actually."}, {"time": 2987, "text": "I still think that, and again, because I do human robot interaction, I still think the human needs to be part of the equation at some point."}, {"time": 2996, "text": "So what, just looking back, what are some fascinating things in robotic space that NASA was working at the time?"}, {"time": 3003, "text": "Or just in general, what have you gotten to play with and what are your memories from working at NASA?"}, {"time": 3010, "text": "Yeah, so one of my first memories was they were working on a surgical robot system that could do eye surgery, right?"}, {"time": 3021, "text": "And this was back in, oh my gosh, it must've been, oh, maybe 92, 93, 94."}, {"time": 3030, "text": "So it's like almost like a remote operation."}, {"time": 3032, "text": "Yeah, it was remote operation."}, {"time": 3034, "text": "In fact, you can even find some old tech reports on it."}, {"time": 3038, "text": "So think of it, like now we have DaVinci, right?"}, {"time": 3041, "text": "Like think of it, but these were like the late 90s, right?"}, {"time": 3045, "text": "And I remember going into the lab one day and I was like, what's that, right?"}, {"time": 3051, "text": "And of course it wasn't pretty, right?"}, {"time": 3053, "text": "Because the technology, but it was like functional and you had this individual that could use a version of haptics to actually do the surgery and they had this mockup of a human face and like the eyeballs and you can see this little drill."}, {"time": 3068, "text": "And I was like, oh, that is so cool."}, {"time": 3071, "text": "That one I vividly remember because it was so outside of my like possible thoughts of what could be done."}, {"time": 3080, "text": "It's the kind of precision and I mean, what's the most amazing of a thing like that?"}, {"time": 3086, "text": "I think it was the precision."}, {"time": 3088, "text": "It was the kind of first time that I had physically seen this robot machine human interface, right?"}, {"time": 3099, "text": "Versus, cause manufacturing had been, you saw those kind of big robots, right?"}, {"time": 3104, "text": "But this was like, oh, this is in a person."}, {"time": 3108, "text": "There's a person and a robot like in the same space."}, {"time": 3111, "text": "I'm meeting them in person."}, {"time": 3113, "text": "Like for me, it was a magical moment that I can't, it was life transforming that I recently met Spot Mini from Boston Dynamics."}, {"time": 3120, "text": "Oh, see."}, {"time": 3121, "text": "I don't know why, but on the human robot interaction for some reason I realized how easy it is to anthropomorphize and it was, I don't know, it was almost like falling in love, this feeling of meeting."}, {"time": 3134, "text": "And I've obviously seen these robots a lot on video and so on, but meeting in person, just having that one on one time is different."}, {"time": 3142, "text": "So have you had a robot like that in your life that made you maybe fall in love with robotics?"}, {"time": 3148, "text": "Sort of like meeting in person."}, {"time": 3152, "text": "I mean, I loved robotics since, yeah."}, {"time": 3155, "text": "So I was a 12 year old."}, {"time": 3157, "text": "Like I'm gonna be a roboticist, actually was, I called it cybernetics."}, {"time": 3161, "text": "But so my motivation was Bionic Woman."}, {"time": 3164, "text": "I don't know if you know that."}, {"time": 3166, "text": "And so, I mean, that was like a seminal moment, but I didn't meet, like that was TV, right?"}, {"time": 3172, "text": "Like it wasn't like I was in the same space and I met and I was like, oh my gosh, you're like real."}, {"time": 3176, "text": "Just linking on Bionic Woman, which by the way, because I read that about you."}, {"time": 3181, "text": "I watched bits of it and it's just so, no offense, terrible."}, {"time": 3185, "text": "It's cheesy if you look at it now."}, {"time": 3188, "text": "It's cheesy, no."}, {"time": 3189, "text": "I've seen a couple of reruns lately."}, {"time": 3190, "text": "But it's, but of course at the time it's probably captured the imagination."}, {"time": 3196, "text": "But the sound effects."}, {"time": 3198, "text": "Especially when you're younger, it just catch you."}, {"time": 3203, "text": "But which aspect, did you think of it, you mentioned cybernetics, did you think of it as robotics or did you think of it as almost constructing artificial beings?"}, {"time": 3211, "text": "Like, is it the intelligent part that captured your fascination or was it the whole thing?"}, {"time": 3218, "text": "Like even just the limbs and just the."}, {"time": 3219, "text": "So for me, it would have, in another world, I probably would have been more of a biomedical engineer because what fascinated me was the parts, like the bionic parts, the limbs, those aspects of it."}, {"time": 3235, "text": "Are you especially drawn to humanoid or humanlike robots?"}, {"time": 3239, "text": "I would say humanlike, not humanoid, right?"}, {"time": 3243, "text": "And when I say humanlike, I think it's this aspect of that interaction, whether it's social and it's like a dog, right?"}, {"time": 3250, "text": "Like that's humanlike because it understand us, it interacts with us at that very social level to, you know, humanoids are part of that, but only if they interact with us as if we are human."}, {"time": 3266, "text": "Okay, but just to linger on NASA for a little bit, what do you think, maybe if you have other memories, but also what do you think is the future of robots in space?"}, {"time": 3278, "text": "We'll mention how, but there's incredible robots that NASA's working on in general thinking about in our, as we venture out, human civilization ventures out into space, what do you think the future of robots is there?"}, {"time": 3292, "text": "Yeah, so I mean, there's the near term."}, {"time": 3293, "text": "For example, they just announced the rover that's going to the moon, which, you know, that's kind of exciting, but that's like near term."}, {"time": 3306, "text": "You know, my favorite, favorite, favorite series is Star Trek, right?"}, {"time": 3313, "text": "You know, I really hope, and even Star Trek, like if I calculate the years, I wouldn't be alive, but I would really, really love to be in that world."}, {"time": 3326, "text": "Like, even if it's just at the beginning, like, you know, like voyage, like adventure one."}, {"time": 3333, "text": "So basically living in space."}, {"time": 3336, "text": "With, what robots, what are robots?"}, {"time": 3339, "text": "With data."}, {"time": 3340, "text": "What role?"}, {"time": 3341, "text": "The data would have to be, even though that wasn't, you know, that was like later, but."}, {"time": 3344, "text": "So data is a robot that has human like qualities."}, {"time": 3349, "text": "Right, without the emotion chip."}, {"time": 3351, "text": "You don't like emotion."}, {"time": 3352, "text": "Well, so data with the emotion chip was kind of a mess, right?"}, {"time": 3358, "text": "It took a while for that thing to adapt, but, and so why was that an issue?"}, {"time": 3368, "text": "The issue is that emotions make us irrational agents."}, {"time": 3375, "text": "And yet he could think through things, even if it was based on an emotional scenario, right?"}, {"time": 3383, "text": "Based on pros and cons."}, {"time": 3385, "text": "But as soon as you made him emotional, one of the metrics he used for evaluation was his own emotions, not people around him, right?"}, {"time": 3395, "text": "Like, and so."}, {"time": 3397, "text": "We do that as children, right?"}, {"time": 3399, "text": "So we're very egocentric when we're young."}, {"time": 3400, "text": "We are very egocentric."}, {"time": 3402, "text": "And so isn't that just an early version of the emotion chip then, I haven't watched much Star Trek."}, {"time": 3408, "text": "Except I have also met adults, right?"}, {"time": 3412, "text": "And so that is a developmental process."}, {"time": 3414, "text": "And I'm sure there's a bunch of psychologists that can go through, like you can have a 60 year old adult who has the emotional maturity of a 10 year old, right?"}, {"time": 3424, "text": "And so there's various phases that people should go through in order to evolve and sometimes you don't."}, {"time": 3431, "text": "So how much psychology do you think, a topic that's rarely mentioned in robotics, but how much does psychology come to play when you're talking about HRI, human robot interaction?"}, {"time": 3443, "text": "When you have to have robots that actually interact with humans."}, {"time": 3446, "text": "So we, like my group, as well as I read a lot in the cognitive science literature, as well as the psychology literature."}, {"time": 3456, "text": "Because they understand a lot about human, human relations and developmental milestones and things like that."}, {"time": 3465, "text": "And so we tend to look to see what's been done out there."}, {"time": 3473, "text": "Sometimes what we'll do is we'll try to match that to see, is that human, human relationship the same as human robot?"}, {"time": 3480, "text": "Sometimes it is, and sometimes it's different."}, {"time": 3483, "text": "And then when it's different, we have to, we try to figure out, okay, why is it different in this scenario?"}, {"time": 3489, "text": "But it's the same in the other scenario, right?"}, {"time": 3491, "text": "And so we try to do that quite a bit."}, {"time": 3495, "text": "Would you say that's, if we're looking at the future of human robot interaction, would you say the psychology piece is the hardest?"}, {"time": 3502, "text": "Like if, I mean, it's a funny notion for you as, I don't know if you consider, yeah."}, {"time": 3507, "text": "I mean, one way to ask it, do you consider yourself a roboticist or a psychologist?"}, {"time": 3512, "text": "Oh, I consider myself a roboticist that plays the act of a psychologist."}, {"time": 3516, "text": "But if you were to look at yourself sort of, 20, 30 years from now, do you see yourself more and more wearing the psychology hat?"}, {"time": 3527, "text": "Another way to put it is, are the hard problems in human robot interactions fundamentally psychology, or is it still robotics, the perception manipulation, planning, all that kind of stuff?"}, {"time": 3539, "text": "It's actually neither."}, {"time": 3541, "text": "The hardest part is the adaptation and the interaction."}, {"time": 3546, "text": "So it's the interface, it's the learning."}, {"time": 3548, "text": "And so if I think of, like I've become much more of a roboticist slash AI person than when I, like originally, again, I was about the bionics."}, {"time": 3560, "text": "I was electrical engineer, I was control theory, right?"}, {"time": 3564, "text": "And then I started realizing that my algorithms needed like human data, right?"}, {"time": 3570, "text": "And so then I was like, okay, what is this human thing?"}, {"time": 3572, "text": "How do I incorporate human data?"}, {"time": 3574, "text": "And then I realized that human perception had, like there was a lot in terms of how we perceive the world."}, {"time": 3581, "text": "And so trying to figure out how do I model human perception for my, and so I became a HRI person, human robot interaction person, from being a control theory and realizing that humans actually offered quite a bit."}, {"time": 3595, "text": "And then when you do that, you become more of an artificial intelligence, AI."}, {"time": 3599, "text": "And so I see myself evolving more in this AI world under the lens of robotics, having hardware, interacting with people."}, {"time": 3612, "text": "So you're a world class expert researcher in robotics, and yet others, you know, there's a few, it's a small but fierce community of people, but most of them don't take the journey into the H of HRI, into the human."}, {"time": 3629, "text": "So why did you brave into the interaction with humans?"}, {"time": 3634, "text": "It seems like a really hard problem."}, {"time": 3636, "text": "It's a hard problem, and it's very risky as an academic."}, {"time": 3641, "text": "And I knew that when I started down that journey, that it was very risky as an academic in this world that was nuance, it was just developing."}, {"time": 3653, "text": "We didn't even have a conference, right, at the time."}, {"time": 3656, "text": "Because it was the interesting problems."}, {"time": 3660, "text": "That was what drove me."}, {"time": 3661, "text": "It was the fact that I looked at what interests me in terms of the application space and the problems."}, {"time": 3670, "text": "And that pushed me into trying to figure out what people were and what humans were and how to adapt to them."}, {"time": 3679, "text": "If those problems weren't so interesting, I'd probably still be sending rovers to glaciers, right?"}, {"time": 3686, "text": "But the problems were interesting."}, {"time": 3688, "text": "And the other thing was that they were hard, right?"}, {"time": 3690, "text": "So it's, I like having to go into a room and being like, I don't know what to do."}, {"time": 3697, "text": "And then going back and saying, okay, I'm gonna figure this out."}, {"time": 3699, "text": "I do not, I'm not driven when I go in like, oh, there are no surprises."}, {"time": 3704, "text": "Like, I don't find that satisfying."}, {"time": 3707, "text": "If that was the case, I'd go someplace and make a lot more money, right?"}, {"time": 3711, "text": "I think I stay in academic because and choose to do this because I can go into a room and like, that's hard."}, {"time": 3718, "text": "Yeah, I think just from my perspective, maybe you can correct me on it, but if I just look at the field of AI broadly, it seems that human robot interaction has the most, one of the most number of open problems."}, {"time": 3736, "text": "Like people, especially relative to how many people are willing to acknowledge that there are this, because most people are just afraid of the humans so they don't even acknowledge how many open problems there are."}, {"time": 3748, "text": "But it's in terms of difficult problems to solve exciting spaces, it seems to be incredible for that."}, {"time": 3755, "text": "It is, and it's exciting."}, {"time": 3758, "text": "You've mentioned trust before."}, {"time": 3760, "text": "What role does trust from interacting with autopilot to in the medical context, what role does trust play in the human robot interactions?"}, {"time": 3771, "text": "So some of the things I study in this domain is not just trust, but it really is over trust."}, {"time": 3776, "text": "How do you think about over trust?"}, {"time": 3778, "text": "Like what is, first of all, what is trust and what is over trust?"}, {"time": 3783, "text": "Basically, the way I look at it is, trust is not what you click on a survey, trust is about your behavior."}, {"time": 3789, "text": "So if you interact with the technology based on the decision or the actions of the technology as if you trust that decision, then you're trusting."}, {"time": 3802, "text": "And even in my group, we've done surveys that on the thing, do you trust robots?"}, {"time": 3809, "text": "Would you follow this robot in a burdening building?"}, {"time": 3812, "text": "And then you look at their actions and you're like, clearly your behavior does not match what you think or what you think you would like to think."}, {"time": 3822, "text": "And so I'm really concerned about the behavior because that's really at the end of the day, when you're in the world, that's what will impact others around you."}, {"time": 3830, "text": "It's not whether before you went onto the street, you clicked on like, I don't trust self driving cars."}, {"time": 3835, "text": "Yeah, that from an outsider perspective, it's always frustrating to me."}, {"time": 3840, "text": "Well, I read a lot, so I'm insider in a certain philosophical sense."}, {"time": 3846, "text": "It's frustrating to me how often trust is used in surveys and how people say, make claims out of any kind of finding they make while somebody clicking on answer."}, {"time": 3858, "text": "You just trust is a, yeah, behavior just, you said it beautifully."}, {"time": 3864, "text": "I mean, the action, your own behavior is what trust is."}, {"time": 3868, "text": "I mean, that everything else is not even close."}, {"time": 3870, "text": "It's almost like absurd comedic poetry that you weave around your actual behavior."}, {"time": 3878, "text": "So some people can say their trust, you know, I trust my wife, husband or not, whatever, but the actions is what speaks volumes."}, {"time": 3888, "text": "You bug their car, you probably don't trust them."}, {"time": 3892, "text": "I trust them, I'm just making sure."}, {"time": 3893, "text": "No, no, that's, yeah."}, {"time": 3895, "text": "Like even if you think about cars, I think it's a beautiful case."}, {"time": 3898, "text": "I came here at some point, I'm sure, on either Uber or Lyft, right?"}, {"time": 3903, "text": "I remember when it first came out, right?"}, {"time": 3906, "text": "I bet if they had had a survey, would you get in the car with a stranger and pay them?"}, {"time": 3912, "text": "How many people do you think would have said, like, really?"}, {"time": 3916, "text": "Wait, even worse, would you get in the car with a stranger at 1 a.m. in the morning to have them drop you home as a single female?"}, {"time": 3925, "text": "Like how many people would say, that's stupid."}, {"time": 3930, "text": "And now look at where we are."}, {"time": 3931, "text": "I mean, people put kids, right?"}, {"time": 3933, "text": "Like, oh yeah, my child has to go to school and yeah, I'm gonna put my kid in this car with a stranger."}, {"time": 3942, "text": "I mean, it's just fascinating how, like, what we think we think is not necessarily matching our behavior."}, {"time": 3949, "text": "Yeah, and certainly with robots, with autonomous vehicles and all the kinds of robots you work with, that's, it's, yeah, it's, the way you answer it, especially if you've never interacted with that robot before, if you haven't had the experience, you being able to respond correctly on a survey is impossible."}, {"time": 3969, "text": "But what do you, what role does trust play in the interaction, do you think?"}, {"time": 3974, "text": "Like, is it good to, is it good to trust a robot?"}, {"time": 3979, "text": "What does over trust mean?"}, {"time": 3981, "text": "Or is it, is it good to kind of how you feel about autopilot currently, which is like, from a roboticist's perspective, is like, oh, still very cautious?"}, {"time": 3991, "text": "Yeah, so this is still an open area of research, but basically what I would like in a perfect world is that people trust the technology when it's working 100%, and people will be hypersensitive and identify when it's not."}, {"time": 4009, "text": "But of course we're not there."}, {"time": 4010, "text": "That's the ideal world."}, {"time": 4013, "text": "And, but we find is that people swing, right?"}, {"time": 4016, "text": "They tend to swing, which means that if my first, and like, we have some papers, like first impressions is everything, right?"}, {"time": 4025, "text": "If my first instance with technology, with robotics is positive, it mitigates any risk, it correlates with like best outcomes, it means that I'm more likely to either not see it when it makes some mistakes or faults, or I'm more likely to forgive it."}, {"time": 4048, "text": "And so this is a problem because technology is not 100% accurate, right?"}, {"time": 4052, "text": "It's not 100% accurate, although it may be perfect."}, {"time": 4055, "text": "How do you get that first moment right, do you think?"}, {"time": 4057, "text": "There's also an education about the capabilities and limitations of the system."}, {"time": 4062, "text": "Do you have a sense of how do you educate people correctly in that first interaction?"}, {"time": 4067, "text": "Again, this is an open ended problem."}, {"time": 4070, "text": "So one of the study that actually has given me some hope that I were trying to figure out how to put in robotics."}, {"time": 4077, "text": "So there was a research study that it showed for medical AI systems, giving information to radiologists about, here you need to look at these areas on the X ray."}, {"time": 4093, "text": "What they found was that when the system provided one choice, there was this aspect of either no trust or over trust, right?"}, {"time": 4106, "text": "Like I don't believe it at all, or a yes, yes, yes, yes."}, {"time": 4113, "text": "And they would miss things, right?"}, {"time": 4116, "text": "Instead, when the system gave them multiple choices, like here are the three, even if it knew like, it had estimated that the top area you need to look at was some place on the X ray."}, {"time": 4129, "text": "If it gave like one plus others, the trust was maintained and the accuracy of the entire population increased, right?"}, {"time": 4143, "text": "So basically it was a, you're still trusting the system, but you're also putting in a little bit of like, your human expertise, like your human decision processing into the equation."}, {"time": 4155, "text": "So it helps to mitigate that over trust risk."}, {"time": 4158, "text": "Yeah, so there's a fascinating balance that the strike."}, {"time": 4161, "text": "Haven't figured out again, robotics is still an open research."}, {"time": 4164, "text": "This is exciting open area research, exactly."}, {"time": 4166, "text": "So what are some exciting applications of human robot interaction?"}, {"time": 4170, "text": "You started a company, maybe you can talk about the exciting efforts there, but in general also what other space can robots interact with humans and help?"}, {"time": 4181, "text": "Yeah, so besides healthcare, cause you know, that's my bias lens."}, {"time": 4184, "text": "My other bias lens is education."}, {"time": 4187, "text": "I think that, well, one, we definitely, we in the US, you know, we're doing okay with teachers, but there's a lot of school districts that don't have enough teachers."}, {"time": 4198, "text": "If you think about the teacher student ratio for at least public education in some districts, it's crazy."}, {"time": 4206, "text": "It's like, how can you have learning in that classroom, right?"}, {"time": 4210, "text": "Because you just don't have the human capital."}, {"time": 4212, "text": "And so if you think about robotics, bringing that in to classrooms, as well as the afterschool space, where they offset some of this lack of resources in certain communities, I think that's a good place."}, {"time": 4228, "text": "And then turning on the other end is using these systems then for workforce retraining and dealing with some of the things that are going to come out later on of job loss, like thinking about robots and in AI systems for retraining and workforce development."}, {"time": 4248, "text": "I think that's exciting areas that can be pushed even more, and it would have a huge, huge impact."}, {"time": 4256, "text": "What would you say are some of the open problems in education, sort of, it's exciting."}, {"time": 4263, "text": "So young kids and the older folks or just folks of all ages who need to be retrained, who need to sort of open themselves up to a whole nother area of work."}, {"time": 4277, "text": "What are the problems to be solved there?"}, {"time": 4280, "text": "How do you think robots can help?"}, {"time": 4282, "text": "We have the engagement aspect, right?"}, {"time": 4284, "text": "So we can figure out the engagement."}, {"time": 4286, "text": "That's not a... What do you mean by engagement?"}, {"time": 4288, "text": "So identifying whether a person is focused, is like that we can figure out."}, {"time": 4298, "text": "What we can figure out and there's some positive results in this is that personalized adaptation based on any concepts, right?"}, {"time": 4309, "text": "So imagine I think about, I have an agent and I'm working with a kid learning, I don't know, algebra two, can that same agent then switch and teach some type of new coding skill to a displaced mechanic?"}, {"time": 4331, "text": "Like, what does that actually look like, right?"}, {"time": 4334, "text": "Like hardware might be the same, content is different, two different target demographics of engagement."}, {"time": 4342, "text": "Like how do you do that?"}, {"time": 4344, "text": "How important do you think personalization is in human robot interaction?"}, {"time": 4348, "text": "And not just a mechanic or student, but like literally to the individual human being."}, {"time": 4355, "text": "I think personalization is really important, but a caveat is that I think we'd be okay if we can personalize to the group, right?"}, {"time": 4364, "text": "And so if I can label you as along some certain dimensions, then even though it may not be you specifically, I can put you in this group."}, {"time": 4378, "text": "So the sample size, this is how they best learn, this is how they best engage."}, {"time": 4383, "text": "Even at that level, it's really important."}, {"time": 4386, "text": "And it's because, I mean, it's one of the reasons why educating in large classrooms is so hard, right?"}, {"time": 4393, "text": "You teach to the median, but there's these individuals that are struggling and then you have highly intelligent individuals and those are the ones that are usually kind of left out."}, {"time": 4406, "text": "So highly intelligent individuals may be disruptive and those who are struggling might be disruptive because they're both bored."}, {"time": 4412, "text": "Yeah, and if you narrow the definition of the group or in the size of the group enough, you'll be able to address their individual, it's not individual needs, but really the most important group needs, right?"}, {"time": 4425, "text": "And that's kind of what a lot of successful recommender systems do with Spotify and so on."}, {"time": 4430, "text": "So it's sad to believe, but as a music listener, probably in some sort of large group, it's very sadly predictable."}, {"time": 4438, "text": "You have been labeled."}, {"time": 4439, "text": "Yeah, I've been labeled and successfully so because they're able to recommend stuff that I like."}, {"time": 4444, "text": "Yeah, but applying that to education, right?"}, {"time": 4447, "text": "There's no reason why it can't be done."}, {"time": 4449, "text": "Do you have a hope for our education system?"}, {"time": 4453, "text": "I have more hope for workforce development."}, {"time": 4456, "text": "And that's because I'm seeing investments."}, {"time": 4459, "text": "Even if you look at VC investments in education, the majority of it has lately been going to workforce retraining, right?"}, {"time": 4468, "text": "And so I think that government investments is increasing."}, {"time": 4472, "text": "There's like a claim and some of it's based on fear, right?"}, {"time": 4476, "text": "Like AI is gonna come and take over all these jobs."}, {"time": 4477, "text": "What are we gonna do with all these nonpaying taxes that aren't coming to us by our citizens?"}, {"time": 4484, "text": "And so I think I'm more hopeful for that."}, {"time": 4488, "text": "Not so hopeful for early education because it's still a who's gonna pay for it."}, {"time": 4496, "text": "And you won't see the results for like 16 to 18 years."}, {"time": 4501, "text": "It's hard for people to wrap their heads around that."}, {"time": 4507, "text": "But on the retraining part, what are your thoughts?"}, {"time": 4510, "text": "There's a candidate, Andrew Yang running for president and saying that sort of AI, automation, robots."}, {"time": 4518, "text": "Universal basic income."}, {"time": 4520, "text": "Universal basic income in order to support us as we kind of automation takes people's jobs and allows you to explore and find other means."}, {"time": 4530, "text": "Like do you have a concern of society transforming effects of automation and robots and so on?"}, {"time": 4541, "text": "I do know that AI robotics will displace workers."}, {"time": 4546, "text": "Like we do know that."}, {"time": 4547, "text": "But there'll be other workers that will be defined new jobs."}, {"time": 4554, "text": "What I worry about is, that's not what I worry about."}, {"time": 4557, "text": "Like will all the jobs go away?"}, {"time": 4559, "text": "What I worry about is the type of jobs that will come out."}, {"time": 4562, "text": "Like people who graduate from Georgia Tech will be okay."}, {"time": 4566, "text": "We give them the skills, they will adapt even if their current job goes away."}, {"time": 4570, "text": "I do worry about those that don't have that quality of an education."}, {"time": 4575, "text": "Will they have the ability, the background to adapt to those new jobs?"}, {"time": 4582, "text": "That I worry about, which will create even more polarization in our society, internationally and everywhere."}, {"time": 4591, "text": "I worry about that."}, {"time": 4592, "text": "I also worry about not having equal access to all these wonderful things that AI can do and robotics can do."}, {"time": 4603, "text": "People like me from Georgia Tech from say MIT will be okay, right?"}, {"time": 4610, "text": "But that's such a small part of the population that we need to think much more globally of having access to the beautiful things, whether it's AI in healthcare, AI in education, AI in politics, right?"}, {"time": 4625, "text": "And that's part of the thing that you were talking about is people that build the technology have to be thinking about ethics, have to be thinking about access and all those things."}, {"time": 4635, "text": "And not just a small subset."}, {"time": 4637, "text": "Let me ask some philosophical, slightly romantic questions."}, {"time": 4642, "text": "People that listen to this will be like, here he goes again."}, {"time": 4646, "text": "Okay, do you think one day we'll build an AI system that a person can fall in love with and it would love them back?"}, {"time": 4657, "text": "Like in the movie, Her, for example."}, {"time": 4659, "text": "Yeah, although she kind of didn't fall in love with him or she fell in love with like a million other people, something like that."}, {"time": 4667, "text": "You're the jealous type, I see."}, {"time": 4668, "text": "We humans are the jealous type."}, {"time": 4670, "text": "Yes, so I do believe that we can design systems where people would fall in love with their robot, with their AI partner."}, {"time": 4683, "text": "That I do believe."}, {"time": 4685, "text": "Because it's actually, and I don't like to use the word manipulate, but as we see, there are certain individuals that can be manipulated if you understand the cognitive science about it, right?"}, {"time": 4696, "text": "Right, so I mean, if you could think of all close relationship and love in general as a kind of mutual manipulation, that dance, the human dance."}, {"time": 4707, "text": "I mean, manipulation is a negative connotation."}, {"time": 4710, "text": "And that's why I don't like to use that word particularly."}, {"time": 4712, "text": "I guess another way to phrase it is, you're getting at is it could be algorithmatized or something, it could be a."}, {"time": 4718, "text": "The relationship building part can be."}, {"time": 4720, "text": "I mean, just think about it."}, {"time": 4721, "text": "We have, and I don't use dating sites, but from what I heard, there are some individuals that have been dating that have never saw each other, right?"}, {"time": 4732, "text": "In fact, there's a show I think that tries to like weed out fake people."}, {"time": 4737, "text": "Like there's a show that comes out, right?"}, {"time": 4739, "text": "Because like people start faking."}, {"time": 4741, "text": "Like, what's the difference of that person on the other end being an AI agent, right?"}, {"time": 4748, "text": "And having a communication and you building a relationship remotely, like there's no reason why that can't happen."}, {"time": 4755, "text": "In terms of human robot interaction, so what role, you've kind of mentioned with data emotion being, can be problematic if not implemented well, I suppose."}, {"time": 4766, "text": "What role does emotion and some other human like things, the imperfect things come into play here for good human robot interaction and something like love?"}, {"time": 4777, "text": "Yeah, so in this case, and you had asked, can an AI agent love a human back?"}, {"time": 4783, "text": "I think they can emulate love back, right?"}, {"time": 4787, "text": "And so what does that actually mean?"}, {"time": 4788, "text": "It just means that if you think about their programming, they might put the other person's needs in front of theirs in certain situations, right?"}, {"time": 4797, "text": "You look at, think about it as a return on investment."}, {"time": 4800, "text": "Like, what's my return on investment?"}, {"time": 4801, "text": "As part of that equation, that person's happiness, has some type of algorithm waiting to it."}, {"time": 4807, "text": "And the reason why is because I care about them, right?"}, {"time": 4811, "text": "That's the only reason, right?"}, {"time": 4813, "text": "But if I care about them and I show that, then my final objective function is length of time of the engagement, right?"}, {"time": 4820, "text": "So you can think of how to do this actually quite easily."}, {"time": 4824, "text": "But that's not love?"}, {"time": 4827, "text": "Well, so that's the thing."}, {"time": 4829, "text": "I think it emulates love because we don't have a classical definition of love."}, {"time": 4838, "text": "Right, but, and we don't have the ability to look into each other's minds to see the algorithm."}, {"time": 4845, "text": "And I mean, I guess what I'm getting at is, is it possible that, especially if that's learned, especially if there's some mystery and black box nature to the system, how is that, you know?"}, {"time": 4857, "text": "How is it any different?"}, {"time": 4858, "text": "How is it any different in terms of sort of if the system says, I'm conscious, I'm afraid of death, and it does indicate that it loves you."}, {"time": 4870, "text": "Another way to sort of phrase it, be curious to see what you think."}, {"time": 4874, "text": "Do you think there'll be a time when robots should have rights?"}, {"time": 4880, "text": "You've kind of phrased the robot in a very roboticist way and just a really good way, but saying, okay, well, there's an objective function and I could see how you can create a compelling human robot interaction experience that makes you believe that the robot cares for your needs and even something like loves you."}, {"time": 4898, "text": "But what if the robot says, please don't turn me off?"}, {"time": 4903, "text": "What if the robot starts making you feel like there's an entity, a being, a soul there, right?"}, {"time": 4910, "text": "Do you think there'll be a future, hopefully you won't laugh too much at this, but where they do ask for rights?"}, {"time": 4920, "text": "So I can see a future if we don't address it in the near term where these agents, as they adapt and learn, could say, hey, this should be something that's fundamental."}, {"time": 4935, "text": "I hopefully think that we would address it before it gets to that point."}, {"time": 4940, "text": "So you think that's a bad future?"}, {"time": 4942, "text": "Is that a negative thing where they ask we're being discriminated against?"}, {"time": 4947, "text": "I guess it depends on what role have they attained at that point, right?"}, {"time": 4954, "text": "And so if I think about now."}, {"time": 4955, "text": "Careful what you say because the robots 50 years from now I'll be listening to this and you'll be on TV saying, this is what roboticists used to believe."}, {"time": 4965, "text": "And so this is my, and as I said, I have a bias lens and my robot friends will understand that."}, {"time": 4972, "text": "So if you think about it, and I actually put this in kind of the, as a roboticist, you don't necessarily think of robots as human with human rights, but you could think of them either in the category of property, or you can think of them in the category of animals, right?"}, {"time": 4994, "text": "And so both of those have different types of rights."}, {"time": 4998, "text": "So animals have their own rights as a living being, but they can't vote, they can't write, they can be euthanized, but as humans, if we abuse them, we go to jail, right?"}, {"time": 5012, "text": "So they do have some rights that protect them, but don't give them the rights of like citizenship."}, {"time": 5020, "text": "And then if you think about property, property, the rights are associated with the person, right?"}, {"time": 5025, "text": "So if someone vandalizes your property or steals your property, like there are some rights, but it's associated with the person who owns that."}, {"time": 5038, "text": "If you think about it back in the day, and if you remember, we talked about how society has changed, women were property, right?"}, {"time": 5048, "text": "They were not thought of as having rights."}, {"time": 5051, "text": "They were thought of as property of, like their... Yeah, assaulting a woman meant assaulting the property of somebody else."}, {"time": 5060, "text": "Exactly, and so what I envision is, is that we will establish some type of norm at some point, but that it might evolve, right?"}, {"time": 5069, "text": "Like if you look at women's rights now, like there are still some countries that don't have, and the rest of the world is like, why that makes no sense, right?"}, {"time": 5079, "text": "And so I do see a world where we do establish some type of grounding."}, {"time": 5084, "text": "It might be based on property rights, it might be based on animal rights."}, {"time": 5087, "text": "And if it evolves that way, I think we will have this conversation at that time, because that's the way our society traditionally has evolved."}, {"time": 5098, "text": "Beautifully put, just out of curiosity, Anki, Jibo, Mayflower Robotics, with their robot Curie, SciFiWorks, WeThink Robotics, were all these amazing robotics companies led, created by incredible roboticists, and they've all went out of business recently."}, {"time": 5119, "text": "Why do you think they didn't last long?"}, {"time": 5121, "text": "Why is it so hard to run a robotics company, especially one like these, which are fundamentally HRI human robot interaction robots?"}, {"time": 5134, "text": "Or personal robots?"}, {"time": 5135, "text": "Each one has a story, only one of them I don't understand, and that was Anki."}, {"time": 5141, "text": "That's actually the only one I don't understand."}, {"time": 5143, "text": "I don't understand it either."}, {"time": 5144, "text": "No, no, I mean, I look like from the outside, I've looked at their sheets, I've looked at the data that's."}, {"time": 5150, "text": "Oh, you mean like business wise, you don't understand, I got you."}, {"time": 5153, "text": "Yeah, and like I look at all, I look at that data, and I'm like, they seem to have like product market fit."}, {"time": 5162, "text": "Like, so that's the only one I don't understand."}, {"time": 5165, "text": "The rest of it was product market fit."}, {"time": 5168, "text": "What's product market fit?"}, {"time": 5169, "text": "Just that of, like how do you think about it?"}, {"time": 5171, "text": "Yeah, so although WeThink Robotics was getting there, right?"}, {"time": 5175, "text": "But I think it's just the timing, it just, their clock just timed out."}, {"time": 5180, "text": "I think if they'd been given a couple more years, they would have been okay."}, {"time": 5185, "text": "But the other ones were still fairly early by the time they got into the market."}, {"time": 5190, "text": "And so product market fit is, I have a product that I wanna sell at a certain price."}, {"time": 5197, "text": "Are there enough people out there, the market, that are willing to buy the product at that market price for me to be a functional viable profit bearing company?"}, {"time": 5208, "text": "So product market fit."}, {"time": 5210, "text": "If it costs you a thousand dollars and everyone wants it and only is willing to pay a dollar, you have no product market fit."}, {"time": 5219, "text": "Even if you could sell it for, you know, it's enough for a dollar, cause you can't."}, {"time": 5223, "text": "So how hard is it for robots?"}, {"time": 5225, "text": "Sort of maybe if you look at iRobot, the company that makes Roombas, vacuum cleaners, can you comment on, did they find the right product, market product fit?"}, {"time": 5235, "text": "Like, are people willing to pay for robots is also another kind of question underlying all this."}, {"time": 5240, "text": "So if you think about iRobot and their story, right?"}, {"time": 5243, "text": "Like when they first, they had enough of a runway, right?"}, {"time": 5248, "text": "When they first started, they weren't doing vacuum cleaners, right?"}, {"time": 5251, "text": "They were contracts primarily, government contracts, designing robots."}, {"time": 5257, "text": "Or military robots."}, {"time": 5258, "text": "Yeah, I mean, that's what they were."}, {"time": 5259, "text": "That's how they started, right?"}, {"time": 5261, "text": "They still do a lot of incredible work there."}, {"time": 5262, "text": "But yeah, that was the initial thing that gave them enough funding to."}, {"time": 5266, "text": "To then try to, the vacuum cleaner is what I've been told was not like their first rendezvous in terms of designing a product, right?"}, {"time": 5276, "text": "And so they were able to survive until they got to the point that they found a product price market, right?"}, {"time": 5285, "text": "And even with, if you look at the Roomba, the price point now is different than when it was first released, right?"}, {"time": 5292, "text": "It was an early adopter price, but they found enough people who were willing to fund it."}, {"time": 5296, "text": "And I mean, I forgot what their loss profile was for the first couple of years, but they became profitable in sufficient time that they didn't have to close their doors."}, {"time": 5308, "text": "So they found the right, there's still people willing to pay a large amount of money, so over $1,000 for a vacuum cleaner."}, {"time": 5315, "text": "Unfortunately for them, now that they've proved everything out, figured it all out, now there's competitors."}, {"time": 5320, "text": "Yeah, and so that's the next thing, right?"}, {"time": 5323, "text": "The competition, and they have quite a number, even internationally."}, {"time": 5327, "text": "Like there's some products out there, you can go to Europe and be like, oh, I didn't even know this one existed."}, {"time": 5335, "text": "So this is the thing though, like with any market, I would, this is not a bad time, although as a roboticist, it's kind of depressing, but I actually think about things like with, I would say that all of the companies that are now in the top five or six, they weren't the first to the stage, right?"}, {"time": 5359, "text": "Like Google was not the first search engine, sorry, Altavista, right?"}, {"time": 5364, "text": "Facebook was not the first, sorry, MySpace, right?"}, {"time": 5368, "text": "Like think about it, they were not the first players."}, {"time": 5371, "text": "Those first players, like they're not in the top five, 10 of Fortune 500 companies, right?"}, {"time": 5379, "text": "They proved, they started to prove out the market, they started to get people interested, they started the buzz, but they didn't make it to that next level."}, {"time": 5390, "text": "But the second batch, right?"}, {"time": 5392, "text": "The second batch, I think might make it to the next level."}, {"time": 5397, "text": "When do you think the Facebook of robotics?"}, {"time": 5402, "text": "The Facebook of robotics."}, {"time": 5404, "text": "Sorry, I take that phrase back because people deeply, for some reason, well, I know why, but it's, I think, exaggerated distrust Facebook because of the privacy concerns and so on."}, {"time": 5415, "text": "And with robotics, one of the things you have to make sure is all the things we talked about is to be transparent and have people deeply trust you to let a robot into their lives, into their home."}, {"time": 5425, "text": "When do you think the second batch of robots will come?"}, {"time": 5428, "text": "Is it five, 10 years, 20 years that we'll have robots in our homes and robots in our hearts?"}, {"time": 5436, "text": "So if I think about, and because I try to follow the VC kind of space in terms of robotic investments, and right now, and I don't know if they're gonna be successful, I don't know if this is the second batch, but there's only one batch that's focused on like the first batch, right?"}, {"time": 5452, "text": "And then there's all these self driving Xs, right?"}, {"time": 5456, "text": "And so I don't know if they're a first batch of something or if like, I don't know quite where they fit in, but there's a number of companies, the co robot, I call them co robots that are still getting VC investments."}, {"time": 5473, "text": "Some of them have some of the flavor of like Rethink Robotics."}, {"time": 5475, "text": "Some of them have some of the flavor of like Curie."}, {"time": 5478, "text": "What's a co robot?"}, {"time": 5480, "text": "So basically a robot and human working in the same space."}, {"time": 5486, "text": "So some of the companies are focused on manufacturing."}, {"time": 5490, "text": "So having a robot and human working together in a factory, some of these co robots are robots and humans working in the home, working in clinics, like there's different versions of these companies in terms of their products, but they're all, so we think robotics would be like one of the first, at least well known companies focused on this space."}, {"time": 5514, "text": "So I don't know if this is a second batch or if this is still part of the first batch, that I don't know."}, {"time": 5521, "text": "And then you have all these other companies in this self driving space."}, {"time": 5526, "text": "And I don't know if that's a first batch or again, a second batch."}, {"time": 5531, "text": "So there's a lot of mystery about this now."}, {"time": 5533, "text": "Of course, it's hard to say that this is the second batch until it proves out, right?"}, {"time": 5539, "text": "Yeah, we need a unicorn."}, {"time": 5543, "text": "Why do you think people are so afraid, at least in popular culture of legged robots like those worked in Boston Dynamics or just robotics in general, if you were to psychoanalyze that fear, what do you make of it?"}, {"time": 5557, "text": "And should they be afraid, sorry?"}, {"time": 5559, "text": "So should people be afraid?"}, {"time": 5561, "text": "I don't think people should be afraid."}, {"time": 5563, "text": "But with a caveat, I don't think people should be afraid given that most of us in this world understand that we need to change something, right?"}, {"time": 5575, "text": "So given that."}, {"time": 5578, "text": "Now, if things don't change, be very afraid."}, {"time": 5581, "text": "Which is the dimension of change that's needed?"}, {"time": 5584, "text": "So changing, thinking about the ramifications, thinking about like the ethics, thinking about like the conversation is going on, right?"}, {"time": 5592, "text": "It's no longer a we're gonna deploy it and forget that this is a car that can kill pedestrians that are walking across the street, right?"}, {"time": 5602, "text": "We're not in that stage."}, {"time": 5603, "text": "We're putting these roads out."}, {"time": 5605, "text": "There are people out there."}, {"time": 5607, "text": "A car could be a weapon."}, {"time": 5608, "text": "Like people are now, solutions aren't there yet, but people are thinking about this as we need to be ethically responsible as we send these systems out, robotics, medical, self driving."}, {"time": 5623, "text": "And military too."}, {"time": 5623, "text": "And military."}, {"time": 5625, "text": "Which is not as often talked about, but it's really where probably these robots will have a significant impact as well."}, {"time": 5632, "text": "Right, making sure that they can think rationally, even having the conversations, who should pull the trigger, right?"}, {"time": 5641, "text": "But overall you're saying if we start to think more and more as a community about these ethical issues, people should not be afraid."}, {"time": 5646, "text": "Yeah, I don't think people should be afraid."}, {"time": 5648, "text": "I think that the return on investment, the impact, positive impact will outweigh any of the potentially negative impacts."}, {"time": 5657, "text": "Do you have worries of existential threats of robots or AI that some people kind of talk about and romanticize about in the next decade, the next few decades?"}, {"time": 5669, "text": "No, I don't."}, {"time": 5671, "text": "Singularity would be an example."}, {"time": 5673, "text": "So my concept is that, so remember, robots, AI, is designed by people."}, {"time": 5679, "text": "It has our values."}, {"time": 5681, "text": "And I always correlate this with a parent and a child."}, {"time": 5685, "text": "So think about it, as a parent, what do we want?"}, {"time": 5687, "text": "We want our kids to have a better life than us."}, {"time": 5689, "text": "We want them to expand."}, {"time": 5692, "text": "We want them to experience the world."}, {"time": 5695, "text": "And then as we grow older, our kids think and know they're smarter and better and more intelligent and have better opportunities."}, {"time": 5704, "text": "And they may even stop listening to us."}, {"time": 5708, "text": "They don't go out and then kill us, right?"}, {"time": 5710, "text": "Like, think about it."}, {"time": 5711, "text": "It's because we, it's instilled in them values."}, {"time": 5714, "text": "We instilled in them this whole aspect of community."}]}]