[{"title": "Dan Kokotov: Speech Recognition with AI and Humans | Lex Fridman Podcast #151", "id": "yTWa-Z1UQwU", "quotes": [{"time": 259, "text": "I definitely remember it."}, {"time": 261, "text": "I was not in Russia anymore."}, {"time": 262, "text": "I think at the time that I used to live in Russia, I think video games were about like the suspicion of Pong."}, {"time": 269, "text": "I think Pong was pretty much like the greatest game I ever got to play in Russia, which was still a privilege right in that age."}, {"time": 275, "text": "So you didn't get color?"}, {"time": 276, "text": "You didn't get like, uh, so I left Russia."}, {"time": 279, "text": "I left Russia in 1991, right?"}, {"time": 281, "text": "So I was one of the few lucky kids because my mom was a programmer."}, {"time": 285, "text": "So I would go to her work, right?"}, {"time": 287, "text": "I would take the, the Metro."}, {"time": 289, "text": "I've got our work and play like on, I guess the equivalent of like a 286 PC, you know, nice floppy disks."}, {"time": 297, "text": "Put back to doing what you get back to doing."}, {"time": 299, "text": "And by the way, the new movie I'm pretty interested in, but the skeptical, I'm a little skeptical."}, {"time": 306, "text": "I'm a little skeptical."}, {"time": 307, "text": "I saw the trailer."}, {"time": 309, "text": "So there's, there's a David Lynch movie doing as you may know, I'm a huge David Lynch fan, by the way."}, {"time": 314, "text": "So the movie is somewhat controversial, but it's a little confusing, but it captures kind of the mood of the book better than I would say like most any adaptation and like doing so much about kind of mood and the world, right."}, {"time": 328, "text": "But back to the philosophical point."}, {"time": 329, "text": "So in the fourth book, God, emperor of doing, there's a sort of setting where Leto, one of the characters, he's become this weird sort of God emperor."}, {"time": 341, "text": "He's turned into a gigantic worm."}, {"time": 342, "text": "I mean, you kind of have to read the book to understand what that means."}, {"time": 344, "text": "So the worms are involved, the worms are involved."}, {"time": 347, "text": "You probably saw the worms in the trailer, right."}, {"time": 349, "text": "And in the video, you kind of like merges with the swarm, um, and becomes this tyrant of the world and like oppresses the people for a long time."}, {"time": 356, "text": "But he has a purpose and the purpose is to kind of, uh, break through kind of a stagnation period in civilization."}, {"time": 364, "text": "Um, but people have gotten too comfortable, right."}, {"time": 366, "text": "And so you kind of oppresses them so that they explode and like go on to colonize new worlds and kind of renew the forward momentum of humanity."}, {"time": 376, "text": "And so to me, that's kind of fascinating, right."}, {"time": 378, "text": "You need a little bit of pressure and suffering, right."}, {"time": 381, "text": "To kind of like make progress, not, not, not get too comfortable."}, {"time": 388, "text": "Maybe that's a bit of a cruel philosophy to take away, but that seems to be the case, unfortunately, obviously, I'm a huge fan of, uh, suffering."}, {"time": 399, "text": "So one of the reasons we're talking today is that a bunch of people requested that I do transcripts for this podcast and do captioning."}, {"time": 411, "text": "I used to make all kinds of YouTube videos and I would go on up work, I think, and I would hire folks to do transcription and it was always a pain in the ass, if I'm being honest, and then I don't know how I discovered Rev."}, {"time": 427, "text": "But when I did, it was this feeling of like, Holy shit, somebody figured out how to do it just really easily."}, {"time": 436, "text": "I I'm, I'm such a fan of just when people take a problem and they just make it easy."}, {"time": 446, "text": "You know, like just, uh, there's so many, uh, there's so many, it's like, there's so many things in life that you might not even be aware of that are painful."}, {"time": 457, "text": "Then Rev, you just like give the audio, give the video, you can actually give a YouTube link."}, {"time": 465, "text": "And then it comes back like a day later or, uh, two days later, whatever the hell it is with the captions, you know, all in a standardized format."}, {"time": 477, "text": "It was, I dunno, it was, it was, it was, it was truly a joy."}, {"time": 480, "text": "So I thought I had, you know, just for the hell of it, uh, talk to you that one other product just made my soul feel good."}, {"time": 488, "text": "One other product that I've used like that is, uh, for people who might be familiar is called isotope RX."}, {"time": 495, "text": "It's for audio editing and like, and that's another one where it was like, you just drop it."}, {"time": 504, "text": "I dropped into the audio and it just cleans everything up really nicely."}, {"time": 508, "text": "All the stupid, like the mouth sounds and sometimes there's a background like sounds due to the malfunction of the equipment."}, {"time": 519, "text": "It can clean that stuff up."}, {"time": 520, "text": "It can, it has a general voice denoising."}, {"time": 523, "text": "It has like automation capabilities where you can do batch processing and you can put a bunch of effects."}, {"time": 529, "text": "I mean, it just, I dunno, everything else sucked for like voice based cleanup that I've ever used."}, {"time": 537, "text": "They've used audition, Adobe audition, and he's all kinds of other things with plugins and you have to kind of figure it all out."}, {"time": 544, "text": "You have to do it manually here."}, {"time": 545, "text": "It's just, it just worked."}, {"time": 547, "text": "So that's another one in this whole pipeline."}, {"time": 549, "text": "It just brought joy to my, to my heart."}, {"time": 552, "text": "Anyway, all that to say is, uh, uh, Rev put a smile to my face."}, {"time": 558, "text": "So can you maybe take a step back and say, what is Rev and how does it work?"}, {"time": 564, "text": "And Rev or Rev.com?"}, {"time": 566, "text": "Rev, Rev.com, the same thing, I guess, uh, that way we do have Rev.ai now as well, which we can talk about later."}, {"time": 573, "text": "Like, do you have the actual domain or is it just, uh, the actual domain, but we also use it kind of as a, as a sub brand."}, {"time": 581, "text": "Oh, so we've, so we use Rev.ai to denote our ASR services, right?"}, {"time": 586, "text": "And Rev.com is kind of our more human and to the end user services."}, {"time": 589, "text": "So it's like wordpress.com and wordpress.org, they actually have separate brands that like, I don't know if you're familiar with what those are."}, {"time": 596, "text": "Yeah, they provide almost like a separate branch of a little bit."}, {"time": 600, "text": "I think with that, it's like wordpress.org is kind of their open source, right?"}, {"time": 604, "text": "And, uh, wordpress.com is sort of their hosted commercial offering."}, {"time": 608, "text": "Um, and with us, the differential is a little bit different, but maybe a similar idea."}, {"time": 612, "text": "So what is Rev?"}, {"time": 613, "text": "Before I launch into, uh, what is Rev?"}, {"time": 616, "text": "I was going to say, you know, like you, you were talking about like Rev was music to your ears, your, your, your field was music to my ears."}, {"time": 621, "text": "To us, the founders of Rev, because, um, Rev was kind of founded to improve on the model of Upwork that was kind of the original, um, or part of their original impetus, like our CEO, Jason, was a early employee of Upwork."}, {"time": 638, "text": "So he was very familiar with their work, the company Upwork company."}, {"time": 641, "text": "Um, and so he was very familiar with that model and he wanted to make the whole experience better because he knew like, when you go at that time, Upwork was primarily programmers, so the main thing they offered us, if you want to hire, you know, someone to help you code a little site, right."}, {"time": 656, "text": "Um, you could go on Upwork, um, you could like browse through a list of freelancers, pick a programmer, you know, have a contract with them and have them do some work, but it was kind of a difficult experience because, uh, for the, for you, you would kind of have to browse through all these people, right."}, {"time": 673, "text": "And you have to decide, okay, like, well, is this guy good as, um, or somebody else better and naturally, you know, you're going to Upwork because you're not an expert, right?"}, {"time": 682, "text": "If you're an expert, you probably wouldn't be like getting a programmer from Upwork, uh, so, so how can you really tell?"}, {"time": 687, "text": "So there's a kind of like a lot of potential regret, right?"}, {"time": 691, "text": "What if I choose a bad person, they're like, going to be late on the work."}, {"time": 694, "text": "It's going to be a painful experience."}, {"time": 696, "text": "And for the freelancer, it was also painful because, you know, half the time they spent not on actually doing the work, but kind of figuring out how can I make my profile most attractive to the buyer, right?"}, {"time": 707, "text": "And they're not an expert on that either."}, {"time": 709, "text": "So like Grav's idea was let's remove the barrier, right?"}, {"time": 712, "text": "Like, let's make it simple where we'll pick a few, uh, verticals that are fairly standardizable."}, {"time": 718, "text": "Now we actually started with translation, um, and then we added audio transcription a bit later and we'll just make it a website."}, {"time": 725, "text": "You go give us your files."}, {"time": 726, "text": "We'll give you back, uh, the results, you know, as soon as possible."}, {"time": 731, "text": "You know, originally maybe it was 48 hours."}, {"time": 733, "text": "Then we made it shorter and shorter and shorter."}, {"time": 735, "text": "Um, yeah, there's a rush processing too."}, {"time": 737, "text": "There's a rush processing now, uh, and, uh, we'll hide all the details from you."}, {"time": 744, "text": "And like, that's kind of exactly what you're experiencing, right?"}, {"time": 747, "text": "You don't, you don't need to worry about the details of how the sausage is made."}, {"time": 750, "text": "The, so you picked like a vertical by vertically, you mean basically a service, a service category."}, {"time": 756, "text": "Why translation is Rev thinking of potentially going into other verticals in the future, or is this like the focus now is a translation transcription, like language, the focus now is, is language or, uh, speech services, generally speech to text language services, you can kind of group them however you want."}, {"time": 776, "text": "Um, so, but we, uh, originally the categorization was work from home."}, {"time": 781, "text": "So when, uh, work that was done by people on a computer, you know, we weren't trying to get into, you know, uh, task rabbit type of things and something that could be relatively standard, not a lot of options."}, {"time": 794, "text": "So we could kind of present the simplified interface, right?"}, {"time": 796, "text": "So programming wasn't like a good fit because each programming project is kind of unique, right?"}, {"time": 801, "text": "We're looking for something that, uh, Transcription is, you know, you have five hours of idea, it's five hours of audio, right?"}, {"time": 807, "text": "Translation is somewhat similar."}, {"time": 809, "text": "In that, you know, you can have a five page document, you know, and then you just can price it by that and then you pick the language you want and that that's mostly all that is to it."}, {"time": 819, "text": "So those were a few criteria."}, {"time": 820, "text": "We started with translation because we saw the need, um, and, uh, we picked up kind of a specialty of translation, um, where we would translate things like board certificates, uh, uh, immigration documents, things like that."}, {"time": 838, "text": "And so they were fairly, um, even more well defined and easy to kind of tell if we did a good job."}, {"time": 845, "text": "So you can literally charge per type of document."}, {"time": 847, "text": "Was that, was, was that the, so what, what is it now?"}, {"time": 850, "text": "Is it per word or something like that?"}, {"time": 852, "text": "Like, how do you, like, how do you measure the effort involved in a particular thing?"}, {"time": 858, "text": "So now it looks like for audio translation, it's like, so now it looks a for audio transcription, right?"}, {"time": 863, "text": "It's a per audio minute."}, {"time": 864, "text": "Well, that, that yes, for, for, for our translation, we don't really, uh, actually focus it on anymore."}, {"time": 870, "text": "Uh, but you know, back when it was still a main business of Revit was per page, right."}, {"time": 875, "text": "Or per word, depending on the kind of, uh, cause you can also do translation now on the audio, right?"}, {"time": 880, "text": "So like subtitles."}, {"time": 881, "text": "So it would be both, uh, transcription and translation."}, {"time": 885, "text": "I wanted to test the system to see how good it is to see like how, how, uh, well, is Russian supported?"}, {"time": 894, "text": "And it'd be interesting to try it out."}, {"time": 895, "text": "I mean, one of the, now it's only in like the one direction, right?"}, {"time": 898, "text": "So you start with English and then you can have subtitles in Russian."}, {"time": 900, "text": "Not really, not really the other way."}, {"time": 903, "text": "Because it's, um, I'm deeply curious about this."}, {"time": 905, "text": "Um, when COVID opens up a little bit, when the economy, when the world opens up a little bit, you want to build your brand in Russia?"}, {"time": 913, "text": "First of all, I'm allergic to the word brand."}, {"time": 915, "text": "All right, I'm definitely not building, uh, any brands in Russia, but I'm going to Paris to talk to the translators of Dostoevsky and Tolstoy, there's this famous couple that does translation."}, {"time": 929, "text": "And, you know, I'm more and more thinking of how is it possible to have a conversation with a Russian speaker?"}, {"time": 937, "text": "Cause I have just some number of famous Russian speakers that I'm interested in talking to, and my Russian is not strong enough to be witty and funny."}, {"time": 949, "text": "I'm already an idiot in English."}, {"time": 951, "text": "I'm an extra level of like awkward idiot in Russian, but I can understand it."}, {"time": 958, "text": "And I also like wonder how can I create a compelling English Russian experience for an English speaker?"}, {"time": 966, "text": "Like if I, there's a guy named Grigori Perlman, who's a mathematician who, uh, obviously doesn't speak any English."}, {"time": 974, "text": "So I would probably incorporate like a Russian translator into the picture."}, {"time": 981, "text": "And then it would be like a, not to use a weird term, but like a three, like a three, three person thing where it's like a dance of, like, I understand it one way."}, {"time": 992, "text": "They don't understand the other way, but I'll be asking questions in English."}, {"time": 998, "text": "I don't know the right way."}, {"time": 1000, "text": "It's complicated, but I feel like it's worth the effort for certain kinds of people, one of whom I'm confident of Vladimir Putin, I'm for sure talking to."}, {"time": 1008, "text": "I really want to make it happen."}, {"time": 1010, "text": "Cause I think I could do a good job with, but the, the right, you know, understanding the fundamentals of translation is something I'm really interested in."}, {"time": 1018, "text": "So that's why I'm starting with, um, the actual translators of like Russian literature, because they understand the nuance and the beauty of the language and how it goes back and forth."}, {"time": 1028, "text": "But I also want to see, like in speech, how can we do it in real time?"}, {"time": 1033, "text": "So that's, that's like a little bit of a baby project that I hope to push forward."}, {"time": 1038, "text": "But anyway, it's a challenging thing."}, {"time": 1039, "text": "So just to share, uh, my dad, um, actually does translation, um, not, not professional, he's a, uh, he writes poetry."}, {"time": 1048, "text": "That was kind of always his, uh, not a hobby, but he's, uh, he, you know, he had a job, like a day job, but his passion was always writing poetry."}, {"time": 1056, "text": "Uh, and then when I got to America, like he started also translating, um, first he was translating English poetry to Russia."}, {"time": 1065, "text": "Now he also like goes the other, uh, the other way, you kind of gain some small fame in that world anyways, because, uh, recently this poet like Lewis clock, I don't know if you know of, uh, some American poet, um, she was awarded the Nobel prize for literature."}, {"time": 1081, "text": "Uh, and so my dad had translated, uh, one of her books of poetry in to Russian, and he was like one of the few."}, {"time": 1087, "text": "So he kind of like, they asked him and gave an interview to Radiosvoboda, if you know what that is."}, {"time": 1093, "text": "And he kind of talked about some of the intricacies of translating poetry."}, {"time": 1097, "text": "So that's like an extra level of difficulty, right?"}, {"time": 1098, "text": "Because translating poetry is even more challenging than translating just, you know, interviews."}, {"time": 1104, "text": "Do you remember any, any experiences and challenges to having to do the translation that, that's the God to you, like something he's talked about?"}, {"time": 1112, "text": "I mean, a lot of it, I think is word choice, right?"}, {"time": 1115, "text": "It's the way Russian is structured is first of all, quite different than, um, the way English is structured, right?"}, {"time": 1120, "text": "Just there is inflections in Russian and genders, and they don't exist in English."}, {"time": 1123, "text": "That's just one of the reasons actually why, um, machine translation is quite difficult for English to Russian and Russian to English, because there's such different languages, but then English has like a huge number of words."}, {"time": 1135, "text": "Um, many more than Russian, actually, I think."}, {"time": 1137, "text": "So it's often difficult to find the right word to convey the same emotional meaning, yeah, Russian language."}, {"time": 1143, "text": "They play with words much more."}, {"time": 1146, "text": "So you, you're mentioning that, uh, Rev was kind of born out of, um, trying to take a vertical on the upwork and then standardize it."}, {"time": 1155, "text": "So we're just trying to make the, the freelancer marketplace idea better, right?"}, {"time": 1161, "text": "Um, better for both customers and better for the freelancers themselves."}, {"time": 1167, "text": "Is there something else to the story of Rev finding the right word?"}, {"time": 1170, "text": "Rev, finding Rev, like what, what did it take to bring it to actually to life?"}, {"time": 1175, "text": "Was there any pain points?"}, {"time": 1177, "text": "Um, plenty of, plenty of pain points."}, {"time": 1179, "text": "I mean, uh, as, as often the case it's with scaling it up, right?"}, {"time": 1183, "text": "Um, and in this case, you know, the scaling is kind of scaling the, the marketplace, so to speak, right?"}, {"time": 1189, "text": "Rev is essentially a two sided marketplace, right?"}, {"time": 1191, "text": "Because, you know, there's the customers and then there's the reverse."}, {"time": 1195, "text": "Um, if there's not enough Revers, Revers are world color freelancers."}, {"time": 1199, "text": "So if there's not enough Revers, then customers have a bad experience, right?"}, {"time": 1203, "text": "You know, it takes longer to get your work done."}, {"time": 1206, "text": "Um, things like that, you know, if there's too many done, the Revers have a bad experience because they might log on to see like what work is available and there's not very much work, right?"}, {"time": 1215, "text": "Uh, so kind of keeping that balance, um, is, is, is a quite challenging problem."}, {"time": 1220, "text": "And, you know, that's, that's like a problem we've been working on for many years and we're still like refining our methods, right?"}, {"time": 1225, "text": "If you can kind of talk to this gig economy idea, I did a bunch of different psychology experiments on mechanical Turk, for example, I've asked to do different kinds of very tricky computer vision annotation on mechanical Turk."}, {"time": 1237, "text": "And it's connecting, connecting people in a more systematized way."}, {"time": 1243, "text": "I would say, you know, between task and, and, uh, what would you call that worker is what mechanical Turk calls it."}, {"time": 1252, "text": "What do you think about this world of gig economies, of there being a service that connects customers to workers in a way that's like massively distributed, like potentially scaling to, it could be, it could be scaled to like tens of thousands of people, right?"}, {"time": 1271, "text": "Is there something interesting about that world that you can speak to?"}, {"time": 1276, "text": "Well, we don't think of it as kind of gig economy, like to some degree, I don't like the word gig that much, right?"}, {"time": 1282, "text": "Because to some degree it diminishes the words being done, right?"}, {"time": 1285, "text": "It sounds kind of like almost amateurish."}, {"time": 1288, "text": "Well, maybe in like music industry, like gig is a standard term, but in work, it kind of sounds like, oh, it's, it's, it's frivolous, um, to us it's, um, improving the nature of working from home on your own time and on your own terms, right?"}, {"time": 1306, "text": "And kind of taking away geographical limitations and time limitations, right?"}, {"time": 1311, "text": "Uh, so, you know, many of our freelancers are maybe work from home moms, right?"}, {"time": 1316, "text": "And, you know, they don't want the traditional nine to five job, but they want to make some income and rough kind of like allows them to do that and decide like exactly how much to work and when to work or by the same token, maybe someone is, you know, someone wants to live the mountain top, you know, life, right?"}, {"time": 1337, "text": "You know, cabin in the woods, but they still want to make some money."}, {"time": 1340, "text": "Um, and like generally that wouldn't be compatible before, before this new world, you kind of had to choose, uh, but like with Rev, like, if you like, you don't have to choose, can you speak to like, what's the demographics like distribution?"}, {"time": 1356, "text": "Like where do rivers live?"}, {"time": 1385, "text": "Like you, you may be Oh, like you know, one day you might go to the For some years now, we've been doing these little meetings where the management team will go to some place and we'll try to meet Revers."}, {"time": 1393, "text": "And pretty much wherever we go, it's pretty easy to find a large number of Revers."}, {"time": 1399, "text": "The most recent one we did is in Utah."}, {"time": 1404, "text": "But anyway, really."}, {"time": 1405, "text": "Are they from all walks of life?"}, {"time": 1406, "text": "Are these young folks, older folks?"}, {"time": 1408, "text": "Yeah, all walks of life, really."}, {"time": 1410, "text": "Like I said, one category is the work from home."}, {"time": 1413, "text": "Students who want to make some extra income."}, {"time": 1417, "text": "There are some people who maybe have some social anxiety, so they don't want to be in the office."}, {"time": 1423, "text": "And this is one way for them to make a living."}, {"time": 1425, "text": "So it's really pretty wide variety."}, {"time": 1427, "text": "But on the flip side, for example, one Rever we were talking to was a person who had a fairly high powered career before and was kind of like taking a break."}, {"time": 1437, "text": "And she was almost doing this just to explore and learn about the gig economy, quote unquote."}, {"time": 1443, "text": "So it really is a pretty wide variety of folks."}, {"time": 1446, "text": "Yeah, it's kind of interesting through the captioning process for me to learn about the Revers because like some are clearly like weirdly knowledgeable about technical concepts."}, {"time": 1462, "text": "Like you can tell by how good they are at like capitalizing stuff, like technical terms, like a machine learning or deep learning."}, {"time": 1470, "text": "Like I've used Rev to annotate, to caption the deep learning lectures or machine learning lectures I did at MIT."}, {"time": 1479, "text": "And it's funny, like a large number of them were like, I don't know if they looked it up or were already knowledgeable, but they do a really good job at like, I don't know."}, {"time": 1490, "text": "They invest time into these things."}, {"time": 1492, "text": "They will like do research, they will Google things, you know, to kind of make sure that they got it right."}, {"time": 1497, "text": "But to some of them, it's like, it's actually part of the enjoyment of the work."}, {"time": 1501, "text": "Like they'll tell us, you know, I love doing this because I get paid to watch a documentary on something, right?"}, {"time": 1507, "text": "And I learn something while I'm transcribing, right?"}, {"time": 1510, "text": "Pretty cool."}, {"time": 1510, "text": "Yeah, so what's that captioning transcription process look like for the Revers?"}, {"time": 1516, "text": "Can you maybe speak to that to give people a sense, like how much is automated, how much is manual?"}, {"time": 1523, "text": "What's the actual interface look like?"}, {"time": 1525, "text": "All that kind of stuff."}, {"time": 1526, "text": "Yeah, so, you know, we've invested a pretty good amount of time to give like our Revers the best tools possible."}, {"time": 1533, "text": "So typical day of forever, they might log into their workspace, they'll see a list of audios that need to be transcribed."}, {"time": 1541, "text": "And we try to give them tools to pick specifically the ones they want to do, you know?"}, {"time": 1544, "text": "So maybe some people like to do longer audios or shorter audios, people have their preferences."}, {"time": 1552, "text": "Some people like to do audios in a particular subject or from a particular country."}, {"time": 1556, "text": "So we try to give people the tools to control, things like that."}, {"time": 1561, "text": "And then when they pick what they want to do, we'll launch a specialized editor that we've built to make transcription as efficient as possible."}, {"time": 1570, "text": "They'll start with a speech drag draft."}, {"time": 1572, "text": "So, you know, we have our machine learning model for automated speech recognition, they'll start with that."}, {"time": 1578, "text": "And then our tools are optimized to help them correct that."}, {"time": 1582, "text": "So it's basically a process of correction."}, {"time": 1586, "text": "Yeah, it depends on, you know, I would say the audio."}, {"time": 1589, "text": "If the audio itself is pretty good, like probably like our podcast right now would be quite good."}, {"time": 1594, "text": "So the ASR would do a fairly good job."}, {"time": 1597, "text": "But if you imagine someone recorded a lecture, you know, in the back of a auditorium, right?"}, {"time": 1605, "text": "Where like the speaker is really far away and there's maybe a lot of cross talk and things like that, then maybe the ASR wouldn't do a good job."}, {"time": 1612, "text": "So the person might say like, you know what, I'm just gonna do it from scratch."}, {"time": 1615, "text": "Do it from scratch, yeah."}, {"time": 1616, "text": "So it kind of really depends."}, {"time": 1617, "text": "What would you say is the speed that you can possibly get?"}, {"time": 1620, "text": "Like, what's the fastest?"}, {"time": 1622, "text": "Can you get, is it possible to get real time or no?"}, {"time": 1625, "text": "As you're like listening, can you write as fast as?"}, {"time": 1629, "text": "Real time would be pretty difficult."}, {"time": 1630, "text": "It's actually a pretty, it's not an easy job, you know."}, {"time": 1633, "text": "We actually encourage everyone at the company to try to be a transcriber for a day, transcriptionist for a day."}, {"time": 1640, "text": "And it's way harder than you might think it is, right?"}, {"time": 1644, "text": "Because people talk fast and people have accents and all this kind of stuff."}, {"time": 1649, "text": "So real time is pretty difficult."}, {"time": 1652, "text": "Like there's somebody, we're probably gonna use Rev to caption this, they're listening to this right now."}, {"time": 1659, "text": "What do you think is the fastest you could possibly get on this right now?"}, {"time": 1664, "text": "I think on a good audio, maybe two to three X, I would say, real time."}, {"time": 1669, "text": "Meaning it takes two to three times longer than the actual audio of the podcast."}, {"time": 1675, "text": "This is so meta, I could just imagine the Revvers working on this right now."}, {"time": 1679, "text": "You're like, you're way wrong."}, {"time": 1681, "text": "You're way wrong, this takes way longer."}, {"time": 1683, "text": "But yeah, it definitely works."}, {"time": 1684, "text": "Or you doubted me, I could do real time."}, {"time": 1688, "text": "Okay, so you mentioned ASR."}, {"time": 1691, "text": "Can you speak to what is ASR, automatic speech recognition?"}, {"time": 1695, "text": "How much, like what is the gap between perfect human performance and perfect or pretty damn good ASR?"}, {"time": 1706, "text": "Yeah, so ASR, automatic speech recognition, it's a class of machine learning problem, right?"}, {"time": 1711, "text": "So take speech like we're talking and transform it into a sequence of words, essentially."}, {"time": 1717, "text": "Audio of people talking."}, {"time": 1718, "text": "Audio, audio to words."}, {"time": 1721, "text": "And there's a variety of different approaches and techniques, which we could talk about later if you want."}, {"time": 1726, "text": "So, we think we have pretty much the world's best ASR for this kind of speech, right?"}, {"time": 1732, "text": "So there's different kinds of domains, right, for ASR."}, {"time": 1735, "text": "Like one domain might be voice assistance, right?"}, {"time": 1738, "text": "So Siri, very different than what we're doing, right?"}, {"time": 1742, "text": "Because Siri, there's fairly limited vocabulary."}, {"time": 1745, "text": "You might ask Siri to play a song or order a pizza or whatever."}, {"time": 1750, "text": "And it's very good at doing that."}, {"time": 1752, "text": "Very different from when we start talking in a very unstructured way."}, {"time": 1757, "text": "And Siri will also generally adapt to your voice and stuff like this."}, {"time": 1760, "text": "So for this kind of audio, we think we have the best."}, {"time": 1762, "text": "And our accuracy, right now I think it's maybe 14% word error rate on our test suite that we generally use to measure."}, {"time": 1773, "text": "So word error rate is like one way to measure accuracy for ASR, right?"}, {"time": 1777, "text": "So what's 14% word error rate?"}, {"time": 1779, "text": "So 14% means across this test suite, of a variety of different audios, it would be, it would get in some way 14% of the words wrong."}, {"time": 1793, "text": "14% of the words wrong."}, {"time": 1795, "text": "So the way you kind of calculate it is, you might add up insertions, deletions, and substitutions, right?"}, {"time": 1803, "text": "So insertions is like extra words."}, {"time": 1805, "text": "Deletions are words that we said, but weren't in the transcript, right?"}, {"time": 1810, "text": "Substitutions is, you said Apple, but I said, but the ASR thought it was able, something like this."}, {"time": 1817, "text": "Human accuracy, most people think realistically, it's like 3%, 2%, word error rate would be like the max achievable."}, {"time": 1828, "text": "So there's still quite a gap, right?"}, {"time": 1829, "text": "Would you say that, so YouTube, when I upload videos, often generates automatic captions."}, {"time": 1835, "text": "Are you sort of from a company perspective, from a company perspective, from a tech perspective, are you trying to beat YouTube, Google?"}, {"time": 1844, "text": "It's a hell of a, Google, I mean, I don't know how seriously they take this task, but I imagine it's quite serious."}, {"time": 1851, "text": "And they, you know, Google is probably up there in terms of their teams on, on ASR or just NLP, natural language processing, different technologies."}, {"time": 1864, "text": "So do you think you can beat Google?"}, {"time": 1866, "text": "On this kind of stuff, yeah, we think so."}, {"time": 1868, "text": "Google just woke up on my phone."}, {"time": 1871, "text": "This is hilarious, okay."}, {"time": 1872, "text": "Now Google is listening, sending it back to headquarters."}, {"time": 1877, "text": "Who are these rough people?"}, {"time": 1879, "text": "But that's the goal?"}, {"time": 1880, "text": "Yeah, I mean, we measure ourselves against like Google, Amazon, Microsoft, you know, some of the, some smaller competitors."}, {"time": 1888, "text": "And we use like our internal tests with it, we try to compose it of a pretty representative set of ideas, maybe it's some podcasts, some videos, some interviews, some lectures, things like that, right?"}, {"time": 1899, "text": "And we beat them in our own testing."}, {"time": 1902, "text": "And actually Rev offers automated, like you can actually just do the automated captioning."}, {"time": 1909, "text": "So like, I guess it's like way cheaper, whatever it is, whatever the rates are."}, {"time": 1915, "text": "So it's a, by the way, it used to be a dollar per minute for captioning and transcription, I think it's like $1.15 or something like that."}, {"time": 1922, "text": "$1.25."}, {"time": 1923, "text": "$1.25, yeah."}, {"time": 1928, "text": "It's pretty cool."}, {"time": 1929, "text": "That was the other thing that was surprising to me, it was actually like the cheapest thing you could, one of the, I mean, I don't remember it being cheaper."}, {"time": 1938, "text": "You could on Upwork get cheaper, but it was clear to me that this, that's gonna be really shitty."}, {"time": 1944, "text": "So like, you're also competing on price."}, {"time": 1946, "text": "I think there were services that you can get, like similar to Rev kind of feel to it, but it wasn't as automated."}, {"time": 1955, "text": "Like the drag and drop, the entirety of the interface, it's like the thing we're talking about."}, {"time": 1959, "text": "I'm such a huge fan of like frictionless, like Amazon's single buy button, whatever."}, {"time": 1968, "text": "That one click."}, {"time": 1969, "text": "The one click, that's genius right there."}, {"time": 1972, "text": "Like that is so important for services."}, {"time": 1975, "text": "And simplicity and I mean, Rev is almost there."}, {"time": 1980, "text": "I mean, there's like some, I'm trying to think."}, {"time": 1984, "text": "So I think I've, I stopped using this pipeline, but Rev offers it and I like it, but it was causing me some issues on my side, which is you can connect it to like Dropbox and it generates the files in Dropbox."}, {"time": 2002, "text": "So like it closes the loop to where I don't have to go to Rev at all and I can download it."}, {"time": 2010, "text": "Sorry, I don't have to go to Rev at all and to download the files."}, {"time": 2014, "text": "It could just like automatically copy them."}, {"time": 2016, "text": "Right, you're putting your Dropbox in a day later or maybe a few hours later."}, {"time": 2021, "text": "Yeah, it just shows up."}, {"time": 2022, "text": "Just shows up, yeah."}, {"time": 2023, "text": "Yeah, I was trying to do it programmatically too."}, {"time": 2026, "text": "Is there an API interface you can, I was trying to through like through Python to download stuff automatically, but then I realized this is the programmer in me."}, {"time": 2036, "text": "Like, dude, you don't need to automate everything like in life, like flawlessly, because I wasn't doing enough captions to justify to myself the time investment into automating everything perfectly."}, {"time": 2047, "text": "Yeah, I would say if you're doing so many interviews that your biggest roadblock is clicking on the Rev download, but now you're talking about Elon Musk levels of business."}, {"time": 2058, "text": "But for sure, we have like a variety of ways to make it easy."}, {"time": 2062, "text": "You know, there's the integration."}, {"time": 2064, "text": "You mentioned, I think it's through a company called Zapier, which kind of can connect Dropbox to Rev and vice versa."}, {"time": 2071, "text": "We have an API if you want to really like customize it, you know, if you want to create the Lex Friedman, you know, CMS or whatever."}, {"time": 2080, "text": "For this whole thing."}, {"time": 2082, "text": "So can you speak to the ASR a little bit more?"}, {"time": 2086, "text": "Like, what does it take?"}, {"time": 2091, "text": "Like approach wise, machine learning wise, how hard is this problem?"}, {"time": 2095, "text": "How do you get to the 3% error rate?"}, {"time": 2097, "text": "Like, what's your vision of all of this?"}, {"time": 2099, "text": "Yeah, well, the 3% error rate is definitely, that's the grand vision."}, {"time": 2106, "text": "We'll see what it takes to get there."}, {"time": 2109, "text": "But we believe, you know, in ASR, the biggest thing is the data, right?"}, {"time": 2115, "text": "Like, that's true of like a lot of machine learning problems today, right?"}, {"time": 2118, "text": "The more data you have and high quality of the data, the better label the data."}, {"time": 2124, "text": "Yeah, that's how you get good results."}, {"time": 2126, "text": "And we at Rev have kind of like the best data."}, {"time": 2128, "text": "Like we have."}, {"time": 2129, "text": "Like you're literally, your business model is annotating the data."}, {"time": 2134, "text": "Our business model is being paid to annotate the data."}, {"time": 2136, "text": "Being paid to annotate the data."}, {"time": 2139, "text": "So it's kind of like a pretty magical flywheel."}, {"time": 2142, "text": "And so we've kind of like written this flywheel to this point."}, {"time": 2147, "text": "And we think we're still kind of in the early stages of figuring out all the parts of the flywheel to use, you know, because we have the final transcripts and we have the audios and we train on that."}, {"time": 2161, "text": "But we in principle also have all the edits that the Revvers make, right?"}, {"time": 2167, "text": "Oh, that's interesting."}, {"time": 2168, "text": "How can you use that as data?"}, {"time": 2170, "text": "Yeah, that's something for us to figure out in the future."}, {"time": 2173, "text": "But, you know, we feel like we're only in the early stages, right?"}, {"time": 2176, "text": "So the data is there."}, {"time": 2177, "text": "That'd be interesting."}, {"time": 2178, "text": "Like almost like a recurrent neural net for fixing transcripts."}, {"time": 2183, "text": "I always remember we did a segmentation annotation for driving data."}, {"time": 2190, "text": "So segmenting the scene, like visual data."}, {"time": 2193, "text": "And you can get all, so it was drawing, people were drawing polygons around different objects and so on."}, {"time": 2199, "text": "And it feels like it always felt like there was a lot of information in the clicking, the sequence of clicking that people do, the kind of fixing of the polygons that they do."}, {"time": 2210, "text": "Now there's a few papers written about how to draw polygons like with a recurrent neural nets to try to learn from the human clicking."}, {"time": 2220, "text": "But it was just like experimental, you know, it was one of those like CVPR type papers that people do like a really tiny data set."}, {"time": 2228, "text": "It didn't feel like people really tried to do it seriously."}, {"time": 2233, "text": "Yeah, I wonder if there's information in the fixing that provides deeper set of signal than just like the raw data."}, {"time": 2244, "text": "The intuition is for sure there must be, right?"}, {"time": 2246, "text": "And in all kinds of signals and how long you took to make that edit and stuff like that."}, {"time": 2252, "text": "It's gonna be like up to us."}, {"time": 2254, "text": "That's why like the next couple of years is like super exciting for us, right?"}, {"time": 2258, "text": "So that's what like the focus is now."}, {"time": 2260, "text": "You mentioned rev.ai, that's where you want to."}, {"time": 2263, "text": "Yeah, so rev.ai is kind of our way of bringing this ASR to the rest of the world, right?"}, {"time": 2271, "text": "So when we started, we were human only."}, {"time": 2275, "text": "Then we kind of created this Temi service."}, {"time": 2279, "text": "I think you might've used it, which was kind of ASR for the consumer, right?"}, {"time": 2282, "text": "So if you don't wanna pay $1.25, but you wanna pay, now it's 25 cents a minute, I think."}, {"time": 2288, "text": "And you get the transcript, the machine generated transcript and you get an editor and you can kind of fix it up yourself, right?"}, {"time": 2297, "text": "Then we started using ASR for our own human transcriptionists."}, {"time": 2301, "text": "And then the kind of rev.ai is the final step of the journey, which is, you know, we have this amazing engine."}, {"time": 2307, "text": "What can people build with it, right?"}, {"time": 2308, "text": "What kind of new applications could be enabled if you have SpeedTrack that's that accurate?"}, {"time": 2316, "text": "Do you have ideas for this or is it just providing it as a service and seeing what people come up with?"}, {"time": 2320, "text": "It's providing it as a service and seeing what people come up with and kind of learning from what people do with it."}, {"time": 2325, "text": "And we have ideas of our own as well, of course, but it's a little bit like, you know, when AWS provided the building blocks, right?"}, {"time": 2332, "text": "And they saw what people built with it and they try to make it easier to build those things, right?"}, {"time": 2336, "text": "And we kind of hope to do the same thing."}, {"time": 2339, "text": "Although AWS kind of does a shitty job of like, I'm continually surprised, like Mechanical Turk, for example, how shitty the interface is."}, {"time": 2347, "text": "We're talking about like Rev making me feel good."}, {"time": 2351, "text": "Like when I first discovered Mechanical Turk, the initial idea of it was like, it made me feel like Rev does, but then the interface is like, come on."}, {"time": 2362, "text": "Yeah, it's horrible."}, {"time": 2364, "text": "Why is it so painful?"}, {"time": 2367, "text": "Does nobody at Amazon want to like seriously invest in it?"}, {"time": 2372, "text": "It felt like you can make so much money if you took this effort seriously."}, {"time": 2377, "text": "And it feels like they have a committee of like two people just sitting back, like a meeting, they meet once a month, like what are we going to do with Mechanical Turk?"}, {"time": 2386, "text": "It's like two websites making me feel like this, that and craiglist.org, whatever the hell it is."}, {"time": 2393, "text": "It feels like it's designed in the 90s."}, {"time": 2395, "text": "Well, Craigslist basically hasn't been updated pretty much since the guy originally built."}, {"time": 2399, "text": "Do you seriously think there's a team, like how big is the team working on Mechanical Turk?"}, {"time": 2405, "text": "There's some team, right?"}, {"time": 2406, "text": "I feel like there isn't."}, {"time": 2408, "text": "I'm skeptical."}, {"time": 2410, "text": "Well, if nothing else, they benefit from the other teams like moving things forward in a small way."}, {"time": 2418, "text": "But I know what you mean."}, {"time": 2419, "text": "We use Mechanical Turk for a couple of things as well."}, {"time": 2422, "text": "And yeah, it's painful UI."}, {"time": 2423, "text": "It's painful, but yeah, it works."}, {"time": 2425, "text": "I think most people, the thing is most people don't really use the UI, right?"}, {"time": 2429, "text": "Like we, for example, we use it through the API, right?"}, {"time": 2433, "text": "But even the API documentation and so on, like it's super outdated."}, {"time": 2437, "text": "Like I don't even know what to..."}, {"time": 2442, "text": "I mean, the same criticism, as long as we're ranting, my same criticism goes to the APIs of most of these companies."}, {"time": 2450, "text": "Like Google, for example, the API for the different services is just the documentation is so shitty."}, {"time": 2459, "text": "Like it's not so shitty."}, {"time": 2462, "text": "I should actually be..."}, {"time": 2465, "text": "I should exhibit some gratitude."}, {"time": 2468, "text": "Okay, let's practice some gratitude."}, {"time": 2470, "text": "The documentation is pretty good."}, {"time": 2474, "text": "Like most of the things that the API makes available is pretty good."}, {"time": 2479, "text": "It's just that in the sense that it's accurate, sometimes outdated, but like the degree of explanations with examples is only covering, I would say, like 50% of what's possible."}, {"time": 2493, "text": "And it just feels a little bit, like there's a lot of natural questions that people would wanna ask that doesn't get covered."}, {"time": 2501, "text": "And it feels like it's almost there."}, {"time": 2504, "text": "Like it's such a magical thing."}, {"time": 2506, "text": "Like the Maps API, YouTube API, there's a bunch of stuff."}, {"time": 2511, "text": "I gotta imagine it's like, there's probably some team at Google responsible for writing this documentation that's probably not the engineers, right?"}, {"time": 2520, "text": "And probably this team is not where you wanna be."}, {"time": 2524, "text": "Well, it's a weird thing."}, {"time": 2525, "text": "I sometimes think about this for somebody who wants to also build a company."}, {"time": 2532, "text": "I think about this a lot."}, {"time": 2534, "text": "YouTube, the service is one of the most magical, like I'm so grateful that YouTube exists."}, {"time": 2544, "text": "And yet they seem to be quite clueless on so many things like that everybody's screaming them at."}, {"time": 2553, "text": "Like it feels like whatever the mechanism that you use to listen to your quote unquote customers, which is like the creators, is not very good."}, {"time": 2564, "text": "Like there's literally people that are like screaming why, like their new YouTube studio, for example."}, {"time": 2571, "text": "There's like features that were like begged for for a really long time."}, {"time": 2576, "text": "Like being able to upload multiple videos at the same time."}, {"time": 2580, "text": "That wasn't missing for a really, really long time."}, {"time": 2583, "text": "Now, like there's probably things that I don't know, which is maybe for that kind of huge infrastructure, it's actually very difficult to build some of these features."}, {"time": 2593, "text": "But the fact that that wasn't communicated and it felt like you're not being heard."}, {"time": 2599, "text": "Like I remember this experience for me and it's not a pleasant experience."}, {"time": 2603, "text": "And it feels like the company doesn't give a damn about you."}, {"time": 2606, "text": "And that's something to think about."}, {"time": 2608, "text": "I'm not sure what that is."}, {"time": 2609, "text": "That might have to do with just like small groups working on these small features and these specific features."}, {"time": 2615, "text": "And there's no overarching like dictator type of human that says like, why the hell are we neglecting like Steve Jobs type of characters?"}, {"time": 2623, "text": "Like there's people that we need to speak to the people that like wanna love our product and they don't."}, {"time": 2631, "text": "Let's fix this shit."}, {"time": 2632, "text": "Maybe at some point you just get so fixated on the numbers, right?"}, {"time": 2635, "text": "And it's like, well, the numbers are pretty great, right?"}, {"time": 2637, "text": "Like people are watching, doesn't seem to be a problem, right?"}, {"time": 2641, "text": "And you're not like the person that like build this thing, right?"}, {"time": 2644, "text": "So you really care about it."}, {"time": 2645, "text": "You're just there, you came in as a product manager, right?"}, {"time": 2649, "text": "You got hired sometime later, your mandate is like increase this number, like 10%, right?"}, {"time": 2655, "text": "And you just."}, {"time": 2656, "text": "That's brilliantly put."}, {"time": 2657, "text": "Like if you, this is, okay, if there's a lesson in this is don't reduce your company into a metric of like how much, like you said, how much people watching the videos and so on and like convince yourself that everything is working just because the numbers are going up."}, {"time": 2676, "text": "There's something, you have to have a vision."}, {"time": 2679, "text": "You have to want people to love your stuff because love is ultimately the beginning of like a successful longterm company is that they always should love your product."}, {"time": 2691, "text": "You have to be like a creator and have that like creator's love for your own thing, right?"}, {"time": 2695, "text": "Like, and you're pained by these comments, right?"}, {"time": 2699, "text": "And probably like Apple, I think did this generally like really well."}, {"time": 2703, "text": "They're well known for kind of keeping teams small even when they were big, right?"}, {"time": 2708, "text": "And, you know, he was an engineer, like there's a book, a creative selection."}, {"time": 2712, "text": "I don't know if you read it by a Apple engineer named Ken Koscienda."}, {"time": 2717, "text": "It's kind of a great book actually because unlike most of these business books where it's, you know, here's how Steve Jobs ran the company."}, {"time": 2724, "text": "It's more like here's how life was like for me, you know, an engineer here, the projects I worked on and here what it was like to pitch Steve Jobs, you know, on like, you know, I think it was in charge of like the keyboard and the auto correction, right?"}, {"time": 2736, "text": "And at Apple, like Steve Jobs reviewed everything."}, {"time": 2739, "text": "And so he was like, this is what it was like to show my demos to Steve Jobs and, you know, to change them because like Steve Jobs didn't like how, you know, the shape of the little key was off because the rounding of the corner was like not quite right or something like this, right?"}, {"time": 2751, "text": "He was famously a stickler for this kind of stuff."}, {"time": 2754, "text": "But because the teams were small, he really owned this stuff, right?"}, {"time": 2756, "text": "So he really cared."}, {"time": 2758, "text": "Yeah, Elon Musk does that similar kind of thing with Tesla, which is really interesting."}, {"time": 2763, "text": "There's another lesson in leadership in that is to be obsessed with the details."}, {"time": 2767, "text": "And like, he talks to like the lowest level engineers."}, {"time": 2771, "text": "Okay, so we're talking about ASR and so this is basically where I was saying we're gonna take this like ultra seriously."}, {"time": 2780, "text": "And then what's the mission?"}, {"time": 2782, "text": "To try to keep pushing towards the 3%."}, {"time": 2786, "text": "Yeah, and kind of try to build this platform where all of your, you know, all of your meetings, you know, they're as easily accessible as your notes, right?"}, {"time": 2798, "text": "Like, so, like, imagine all the meetings a company might have, right?"}, {"time": 2803, "text": "You know, now that I'm like no longer a programmer, right?"}, {"time": 2806, "text": "Then I'm a quote unquote manager."}, {"time": 2809, "text": "That's less like my day as in meetings, right?"}, {"time": 2811, "text": "And, you know, pretty often I wanna like see what was said, right?"}, {"time": 2815, "text": "Who said it, you know?"}, {"time": 2816, "text": "What's the context?"}, {"time": 2817, "text": "But it's generally not really something that you can easily retrieve, right?"}, {"time": 2820, "text": "Like imagine if all of those meetings were indexed, archived, you know, you could go back, you could share a clip like really easily, right?"}, {"time": 2828, "text": "So that might change completely."}, {"time": 2830, "text": "It's like everything that's said, converted to text might change completely the dynamics of what we do in this world, especially now with remote work, right?"}, {"time": 2839, "text": "With Zoom and so on."}, {"time": 2841, "text": "That's fascinating to think about."}, {"time": 2842, "text": "I mean, for me, I care about podcasts, right?"}, {"time": 2845, "text": "And one of the things that was, you know, I'm torn."}, {"time": 2851, "text": "I know a lot of the engineers at Spotify."}, {"time": 2853, "text": "So I love them very much because they dream big in terms of like, they wanna empower creators."}, {"time": 2863, "text": "So one of my hopes was with Spotify that they would use a technology like Rev or something like that to start converting everything into text and make it indexable."}, {"time": 2875, "text": "Like one of the things that sucks with podcasts is like, it's hard to find stuff."}, {"time": 2881, "text": "Like the model is basically subscription."}, {"time": 2884, "text": "Like you find, it's similar to what YouTube used to be like, which is you basically find a creator that you enjoy and you subscribe to them."}, {"time": 2895, "text": "And like, you just kind of follow what they're doing, but the search and discovery wasn't a big part of YouTube like in the early days, but that's what currently with podcasts, like is the search and discovery is like non existent."}, {"time": 2913, "text": "You're basically searching for like the dumbest possible thing, which is like keywords in the titles of episodes."}, {"time": 2920, "text": "Even aside from a search and discovery, like all the time."}, {"time": 2922, "text": "So I listened to like a number of podcasts and there's something said, and I wanna like go back to that later because I was trying to, I'm trying to remember, what do you say?"}, {"time": 2930, "text": "Like maybe like recommended some cool product that I wanna try out."}, {"time": 2933, "text": "And like, it's basically impossible."}, {"time": 2934, "text": "Maybe like some people have pretty good show notes."}, {"time": 2936, "text": "So maybe you'll get lucky and you can find it, right?"}, {"time": 2939, "text": "But I mean, if everyone had transcripts and it was all searchable, it would be so much better."}, {"time": 2945, "text": "I mean, that's one of the things that I wanted to, I mean, one of the reasons we're talking today is I wanted to take this quite seriously."}, {"time": 2953, "text": "The rough thing, I just been lazy."}, {"time": 2956, "text": "So, because I'm very fortunate that a lot of people support this podcast, that there's enough money now to do a transcription and so on."}, {"time": 2964, "text": "And it seemed clear to me, especially like CEOs and sort of like PhDs, like people write to me who are like graduate students in computer science or graduate students in whatever the heck field, it's clear that their mind, like they enjoy podcasts when they're doing laundry or whatever, but they wanna revisit the conversation in a much more rigorous way."}, {"time": 2990, "text": "And they really wanna transcript."}, {"time": 2992, "text": "Like it's clear that they want to analyze conversations."}, {"time": 2996, "text": "Like so many people wrote to me about a transcript for Yosha Bach conversation."}, {"time": 3001, "text": "I had just a bunch of conversations."}, {"time": 3003, "text": "And then on the Elon Musk side, like reporters, they wanna write a blog post about your conversation."}, {"time": 3010, "text": "So they wanna be able to pull stuff."}, {"time": 3013, "text": "And it's like, they're essentially doing on your conversation transcription privately."}, {"time": 3018, "text": "They're doing it for themselves and then starting to pick, but it's so much easier when you can actually do it as a reporter, just look at the transcript."}, {"time": 3026, "text": "Yeah, and you can like embed a little thing, like into your article, right?"}, {"time": 3029, "text": "Here's what they said, you can go listen to like this clip from the section."}, {"time": 3033, "text": "I'm actually trying to figure out, I'll probably on the website create like a place where the transcript goes, like as a webpage so that people can reference it, like reporters can reference it and so on."}, {"time": 3046, "text": "I mean, most of the reporters probably want to write clickbait articles that are complete falsifying, which I'm fine with."}, {"time": 3055, "text": "It's the way of journalism, I don't care."}, {"time": 3057, "text": "Like I've had this conversation with a friend of mine, a mixed martial artist, the Ryan Hall."}, {"time": 3098, "text": "And he brought up like Hitler as somebody that would potentially be the hardest thing to possibly forgive, but it might be a worthwhile pursuit psychologically, so on, blah, blah, blah, it doesn't matter."}, {"time": 3108, "text": "It was very eloquent, very powerful words."}, {"time": 3110, "text": "I think people should go back and listen to it."}, {"time": 3113, "text": "It's powerful."}, {"time": 3114, "text": "And then all these journalists, all these articles written about like MMA fight, UFC fight."}, {"time": 3120, "text": "MMA fighter loves Hitler."}, {"time": 3121, "text": "No, like, well, no, they didn't."}, {"time": 3123, "text": "They were somewhat accurate."}, {"time": 3125, "text": "They didn't say like loves Hitler."}, {"time": 3127, "text": "They said, thinks that if Hitler came back to life, we should forgive him."}, {"time": 3134, "text": "Like they kind of, it's kind of accurate ish, but the headline made it sound a lot worse than it was, but I'm fine with it."}, {"time": 3147, "text": "That's the way the world, I wanna almost make it easier for those journalists and make it easier for people who actually care about the conversation to go and look and see."}, {"time": 3157, "text": "Right, they can see it for themselves."}, {"time": 3158, "text": "For themselves."}, {"time": 3159, "text": "There's the headline, but now you can go."}, {"time": 3161, "text": "There's something about podcasts, like the audio that makes it difficult to jump to a spot and to look for that particular information."}, {"time": 3173, "text": "I think some of it, I'm interested in creating, like myself experimenting with stuff."}, {"time": 3180, "text": "So like taking rev and creating a transcript and then people can go to it."}, {"time": 3185, "text": "I do dream that like, I'm not in the loop anymore, that like, Spotify does it, right?"}, {"time": 3193, "text": "Like automatically for everybody, because ultimately that one click purchase needs to be there, like, you know."}, {"time": 3201, "text": "Like you kind of want support from the entire ecosystem."}, {"time": 3204, "text": "Like from the tool makers and the podcast creators, even clients, right?"}, {"time": 3208, "text": "I mean, imagine if like most podcast apps, you know, if it was a standard, right?"}, {"time": 3215, "text": "Here's how you include a transcript into a podcast, right?"}, {"time": 3218, "text": "Like it's just an RSS feed ultimately."}, {"time": 3220, "text": "And actually just yesterday I saw this company called Buzzsprout, I think they're called."}, {"time": 3226, "text": "So they're trying to do this."}, {"time": 3228, "text": "They proposed a spec, an extension to their RSS format to reference transcripts in a standard way."}, {"time": 3238, "text": "And they're talking about like, there's one client dimension that will support it, but imagine like more clients support it, right?"}, {"time": 3244, "text": "So any podcast, you could go and see the transcripts right in your like normal podcast app."}, {"time": 3251, "text": "I mean, somebody, so I have somebody who works with me, works with helps with advertising, Matt, this awesome guy."}, {"time": 3260, "text": "He mentioned Buzzsprout to me, but he says, it's really annoying because they want exclusive, they want to host the podcast."}, {"time": 3267, "text": "This is the problem with Spotify too."}, {"time": 3269, "text": "This is where I'd like to say, like F Spotify, there's a magic to RSS with podcasts."}, {"time": 3278, "text": "It can be made available to everyone."}, {"time": 3280, "text": "And then there's all, there's this ecosystem of different podcast players that emerge and they compete freely."}, {"time": 3287, "text": "And that's a beautiful thing, that that's why I go on exclusive, like Joe Rogan went exclusive."}, {"time": 3293, "text": "I'm not sure if you're familiar with, he went to Spotify as a huge fan of Joe Rogan."}, {"time": 3299, "text": "I've been kind of nervous about the whole thing, but let's see, I hope that Spotify steps up."}, {"time": 3305, "text": "They've added video, which was very surprising that they were able to put on."}, {"time": 3307, "text": "Exclusive meaning you can't subscribe to the RSS feed anymore."}, {"time": 3311, "text": "It's only in Spotify."}, {"time": 3312, "text": "For now you can until December 1st."}, {"time": 3315, "text": "And December 1st, it's all, everything disappears and it's Spotify only."}, {"time": 3321, "text": "I, you know, and Spotify gave him a hundred million dollars for that."}, {"time": 3326, "text": "So it's an interesting deal, but I, you know, I did some soul searching and I'm glad he's doing it."}, {"time": 3334, "text": "But if Spotify came to me with a hundred million dollars, I wouldn't do it."}, {"time": 3340, "text": "I wouldn't do, well, I have a very different relationship with money."}, {"time": 3343, "text": "I hate money, but I just think I believe in the pirate radio aspect of podcasting, the freedom."}, {"time": 3350, "text": "And that there's something about."}, {"time": 3350, "text": "The open source spirit."}, {"time": 3352, "text": "The open source spirit, it just doesn't seem right."}, {"time": 3354, "text": "It doesn't feel right."}, {"time": 3355, "text": "That said, you know, because so many people care about Joe Rogan's program, they're gonna hold Spotify's feet to the fire."}, {"time": 3362, "text": "Like one of the cool things with what Joe told me is the reason he likes working with Spotify is that they, they're like ride or die together, right?"}, {"time": 3376, "text": "So they, they want him to succeed."}, {"time": 3379, "text": "So that's why they're not actually telling him what to do despite what people think."}, {"time": 3383, "text": "They, they don't tell them, they don't give them any notes on anything."}, {"time": 3386, "text": "They want him to succeed."}, {"time": 3388, "text": "And that's the cool thing about exclusivity with a platform is like, you're kind of wanting each other to succeed."}, {"time": 3396, "text": "And that process can actually be very fruitful."}, {"time": 3399, "text": "Like YouTube, it goes back to my criticism."}, {"time": 3404, "text": "YouTube generally, no matter how big the creator, maybe for PewDiePie, something like that, they want you to succeed."}, {"time": 3411, "text": "But for the most part, from all the big creators I've spoken with, Veritasium, all of those folks, you know, they get some basic assistance, but it's not like, YouTube doesn't care if you succeed or not."}, {"time": 3423, "text": "They have so many creators."}, {"time": 3424, "text": "Yeah, like a hundred other."}, {"time": 3427, "text": "So, and especially with, with somebody like Joe Rogan, who YouTube sees Joe Rogan, not as a person who might revolutionize the nature of news and idea space and nuanced conversations."}, {"time": 3443, "text": "They see him as a potential person who has racist guests on, or like, you know, they see him as like a headache, potentially."}, {"time": 3454, "text": "So, you know, a lot of people talk about this."}, {"time": 3457, "text": "It's a hard place to be for YouTube, actually, is figuring out with the search and discovery process of how do you filter out conspiracy theories and which conspiracy theories represent dangerous untruths and which conspiracy theories are like vanilla untruths."}, {"time": 3478, "text": "And then even when you start having meetings and discussions about what is true or not, it starts getting weird."}, {"time": 3485, "text": "Yeah, it's difficult these days, right?"}, {"time": 3487, "text": "I worry more about the other side, right?"}, {"time": 3489, "text": "Of too much, you know, too much censorship."}, {"time": 3493, "text": "Well, maybe censorship is the right word."}, {"time": 3494, "text": "I mean, censorship is usually government censorship, but still, yeah, putting yourself in the position of arbiter for these kinds of things."}, {"time": 3502, "text": "It's very difficult and people think it's so easy, right?"}, {"time": 3505, "text": "Like, cause like, well, you know, like no Nazis, right?"}, {"time": 3507, "text": "What a simple principle."}, {"time": 3510, "text": "But you know, yes, I mean, no one likes Nazis, but there's like many shades of gray, like very soon after that."}, {"time": 3517, "text": "Yeah, and then, you know, of course everybody, you know, there's some people that call our current president a Nazi and then there's like, so you start getting a Sam Harris."}, {"time": 3525, "text": "I don't know if you know that is wasted, in my opinion, his conversation with Jack Dorsey."}, {"time": 3531, "text": "Now I'll also, I spoke with Jack before in this podcast and we'll talk again, but Sam brought up, Sam Harris does not like Donald Trump."}, {"time": 3541, "text": "I do listen to his podcast."}, {"time": 3543, "text": "I'm familiar with his views on the matter."}, {"time": 3546, "text": "And he asked Jack Dorsey, he's like, how can you not ban Donald Trump from Twitter?"}, {"time": 3552, "text": "And so, you know, there's a set, you have that conversation."}, {"time": 3555, "text": "You have a conversation where some number, some significant number of people think that the current president of the United States should not be on your platform."}, {"time": 3564, "text": "And it's like, okay."}, {"time": 3566, "text": "So if that's even on the table as a conversation, then everything's on the table for conversation."}, {"time": 3572, "text": "And yeah, it's tough."}, {"time": 3574, "text": "I'm not sure where I land on it."}, {"time": 3577, "text": "I'm with you, I think that censorship is bad, but I also think the show..."}, {"time": 3581, "text": "Ultimately, I just also think, you know, if you're the kind of person that's gonna be convinced, you know, by some YouTube video, you know, that, I don't know, our government's been taken over by aliens, it's unlikely that like, you know, you'll be returned to sanity simply because, you know, that video is not available on YouTube, right?"}, {"time": 3602, "text": "I tend to believe in the intelligence of people and we should trust them."}, {"time": 3606, "text": "But I also do think it's the responsibility of platforms to encourage more love in the world, more kindness to each other."}, {"time": 3614, "text": "And I don't always think that they're great at doing that particular thing."}, {"time": 3619, "text": "So that, there's a nice balance there."}, {"time": 3625, "text": "And I think philosophically, I think about that a lot."}, {"time": 3628, "text": "Where's the balance between free speech and like encouraging people, even though they have the freedom of speech to not be an asshole."}, {"time": 3641, "text": "That's not a constitutional, like..."}, {"time": 3644, "text": "So you have the right for free speech, but like, just don't be an asshole."}, {"time": 3650, "text": "Like you can't really put that in the constitution that the Supreme Court can't be like, eh, just don't be a dick."}, {"time": 3656, "text": "But I feel like platforms have a role to be like, just be nicer."}, {"time": 3660, "text": "Maybe do the carrot, like encourage people to be nicer as opposed to the stake of censorship."}, {"time": 3666, "text": "But I think it's an interesting machine learning problem."}, {"time": 3671, "text": "Just be nicer."}, {"time": 3672, "text": "Machine, yeah, machine learning for niceness."}, {"time": 3675, "text": "It is, I mean, that's..."}, {"time": 3676, "text": "Responsible, yeah, I mean, it is."}, {"time": 3677, "text": "It is a thing, for sure."}, {"time": 3680, "text": "Jack Dorsey kind of talks about it as a vision for Twitter is, how do we increase the health of conversations?"}, {"time": 3686, "text": "I don't know how seriously they're actually trying to do that though."}, {"time": 3690, "text": "Which is one of the reasons that I'm in part considering entering that space a little bit."}, {"time": 3697, "text": "It's difficult for them, right?"}, {"time": 3698, "text": "Because, you know, it's kind of like well known that people are kind of driven by rage and you know, outrage maybe is a better word, right?"}, {"time": 3709, "text": "Outrage drives engagement."}, {"time": 3711, "text": "And well, these companies are judged by engagement, right?"}, {"time": 3716, "text": "In the short term, but this goes to the metrics thing that we were talking about earlier."}, {"time": 3719, "text": "I do believe, I have a fundamental belief that if you have a metric of long term happiness of your users, like not short term engagement, but long term happiness and growth and both like intellectual, emotional health of your users, you're going to make a lot more money."}, {"time": 3737, "text": "You're going to have long... Like you should be able to optimize for that."}, {"time": 3741, "text": "You don't need to necessarily optimize for engagement."}, {"time": 3744, "text": "And that'll be good for society too."}, {"time": 3746, "text": "Yeah, no, I mean, I generally agree with you, but it requires a patient person with, you know, trust from Wall Street to be able to carry out such a strategy."}, {"time": 3756, "text": "This is what I believe the Steve Jobs character and Elon Musk character is like, you basically have to be so good at your job."}, {"time": 3765, "text": "Right, you got to pass for anything."}, {"time": 3766, "text": "That you can hold the board and all the investors hostage by saying like, either we do it my way or I leave."}, {"time": 3776, "text": "And everyone is too afraid of you to leave because they believe in your vision."}, {"time": 3781, "text": "But that requires being really good at what you do."}, {"time": 3784, "text": "It requires being Steve Jobs and Elon Musk."}, {"time": 3786, "text": "There's kind of a reason why like a third name doesn't come immediately to mind, right?"}, {"time": 3790, "text": "Like there's maybe a handful of other people, but it's not that many."}, {"time": 3793, "text": "It's not many."}, {"time": 3794, "text": "I mean, people say like, why are you... Like people say that I'm like a fan of Elon Musk."}, {"time": 3798, "text": "I'm not, I'm a fan of anybody who's like Steve Jobs and Elon Musk."}, {"time": 3803, "text": "And there's just not many of those folks."}, {"time": 3806, "text": "It's the guy that made us believe that like we can get to Mars, you know, in 10 years, right?"}, {"time": 3811, "text": "I mean, that's kind of awesome."}, {"time": 3812, "text": "And it's kind of making it happen, which is like... And it's kind of gone like that kind of like spirit, right?"}, {"time": 3820, "text": "Like from a lot of our society, right?"}, {"time": 3822, "text": "You know, like we can get to the moon in 10 years and like we did it, right?"}, {"time": 3826, "text": "Especially in this time of so much kind of existential dread that people are going through because of COVID, like having rockets that just keep going out there now with humans."}, {"time": 3840, "text": "I don't know that it, just like you said, I mean, it gives you a reason to wake up in the morning and dream, for us engineers too."}, {"time": 3849, "text": "It is inspiring as hell, man."}, {"time": 3854, "text": "Let me ask you this, the worst possible question, which is, so you're like at the core, you're a programmer, you're an engineer, but now you made the unfortunate choice or maybe that's the way life goes of basically moving away from the low level work and becoming a manager, becoming an executive, having meetings, what's that transition been like?"}, {"time": 3883, "text": "It's been interesting."}, {"time": 3884, "text": "It's been a journey."}, {"time": 3884, "text": "Maybe a couple of things to say about that."}, {"time": 3886, "text": "I mean, I got into this, right?"}, {"time": 3889, "text": "Because as a kid, I just remember this like incredible amazement at being able to write a program, right?"}, {"time": 3897, "text": "And something comes to life that kind of didn't exist before."}, {"time": 3901, "text": "I don't think you have that in like many other fields, like you have that with some other kinds of engineering, but you're maybe a little bit more limited with what you can do, right?"}, {"time": 3910, "text": "But with a computer, you can literally imagine any kind of program, right?"}, {"time": 3914, "text": "So it's a little bit godlike what you do like when you create it."}, {"time": 3919, "text": "And so, I mean, that's why I got into it."}, {"time": 3921, "text": "Do you remember like first program you wrote or maybe the first program that like made you fall in love with computer science?"}, {"time": 3928, "text": "I don't know what was the first program."}, {"time": 3929, "text": "It's probably like trying to write one of those games and basic, you know, like emulate the snake game or whatever."}, {"time": 3935, "text": "I don't remember to be honest, but I enjoyed like, that's why I always loved about, you know, being a programmer, it's just the creation process."}, {"time": 3941, "text": "And it's a little bit different when you're not the one doing the creating."}, {"time": 3947, "text": "And, you know, another aspect to it I would say is, you know, when you're a programmer, when you're a individual contributor, it's kind of very easy to know when you're doing a good job, when you're not doing a good job, when you're being productive, when you're not being productive, right?"}, {"time": 3960, "text": "You can kind of see like you trying to make something and it's like slowly coming together, right?"}, {"time": 3965, "text": "And when you're a manager, you know, it's more diffuse, right?"}, {"time": 3969, "text": "Like, well, you hope, you know, you're motivating your team and making them more productive and inspiring them, right?"}, {"time": 3975, "text": "But it's not like you get some kind of like dopamine signal because you like completed X lines of code, you know, today."}, {"time": 3982, "text": "So kind of like you missed that dopamine rush a little bit when you first become, but then, you know, slowly you kind of see, yes, your teams are doing amazing work, right?"}, {"time": 3992, "text": "And you can take pride in that."}, {"time": 3994, "text": "You can get like, what is it?"}, {"time": 3998, "text": "Like a ripple effect of somebody else's dopamine rush."}, {"time": 4001, "text": "Yeah, yeah, you live off other people's dopamine."}, {"time": 4006, "text": "So is there pain points and challenges you had to overcome from becoming, from going to a programmer to becoming a programmer of humans?"}, {"time": 4015, "text": "Programmer of humans."}, {"time": 4018, "text": "I don't know, humans are difficult to understand, you know, it's like one of those things, like trying to understand other people's motivations and what really drives them."}, {"time": 4028, "text": "It's difficult, maybe like never really know, right?"}, {"time": 4030, "text": "Do you find that people are different?"}, {"time": 4034, "text": "Like I, one of the things, like I had a group at MIT that, you know, I found that like some people I could like scream at and criticize like hard and that made them do like much better work and really push them to their limit."}, {"time": 4055, "text": "And there's some people that I had to nonstop compliment because like they're so already self critical, like about everything they do that I have to be constantly like, like I cannot criticize them at all because they're already criticizing themselves and you have to kind of encourage and like celebrate their little victories."}, {"time": 4078, "text": "And it's kind of fascinating that like how that, the complete difference in people."}, {"time": 4083, "text": "Definitely people respond to different motivations and different loads of feedback and you kind of have to figure it out."}, {"time": 4090, "text": "It was like a pretty good book, which for some reason now the name escapes me, about management, first break all the rules."}, {"time": 4098, "text": "First break all the rules?"}, {"time": 4099, "text": "First break all the rules."}, {"time": 4100, "text": "It's a book that we generally like ask a lot of like first time managers to read it rough."}, {"time": 4106, "text": "And like one of the kind of philosophies is managed by exception, right?"}, {"time": 4111, "text": "Which is, you know, don't like have some standard template like, you know, here's how I, you know, tell this person to do this or the other thing."}, {"time": 4119, "text": "Here's how I get feedback, like manage by exception, right?"}, {"time": 4121, "text": "Every person is a little bit different."}, {"time": 4122, "text": "You have to try to understand what drives them."}, {"time": 4125, "text": "And tailor it to them."}, {"time": 4127, "text": "Since you mentioned books, I don't know if you can answer this question, but people love it when I ask it, which is, are there books, technical fiction or philosophical that you enjoyed or had an impact on your life that you would recommend?"}, {"time": 4141, "text": "You already mentioned Dune, like all of the Dune."}, {"time": 4144, "text": "All of the Dune."}, {"time": 4145, "text": "The second one was probably the weakest, but anyway, so yeah, all of the Dune is good."}, {"time": 4149, "text": "I mean, yeah, can you just slow little tangent on that?"}, {"time": 4153, "text": "Is, how many Dune books are there?"}, {"time": 4156, "text": "Like, do you recommend people start with the first one if that was?"}, {"time": 4159, "text": "Yeah, you gotta have to read them all."}, {"time": 4161, "text": "I mean, it is a complete story, right?"}, {"time": 4163, "text": "So you start with the first one, you gotta read all of them."}, {"time": 4167, "text": "So it's not like a tree, like a creation of like the universe that you should go in sequence?"}, {"time": 4173, "text": "You should go in sequence, yeah."}, {"time": 4175, "text": "It's kind of a chronological storyline."}, {"time": 4178, "text": "There's six books in all."}, {"time": 4180, "text": "Then there's like many kind of books that were written by Frank Herbert's son, but those are not as good."}, {"time": 4188, "text": "So you don't have to bother with those."}, {"time": 4193, "text": "But the main sequence is good."}, {"time": 4196, "text": "So what are some other books?"}, {"time": 4198, "text": "Maybe there's a few."}, {"time": 4199, "text": "So I don't know that like, I would say there's a book that kind of, I don't know, turned my life around or anything like that, but here's a couple that I really love."}, {"time": 4208, "text": "So one is Brave New World by Aldous Huxley."}, {"time": 4216, "text": "And it's kind of incredible how prescient he was about like what a brave new world might be like, right?"}, {"time": 4225, "text": "You know, you kind of see genetic sorting in this book, right, where there's like these alphas and epsilons and how from like the earliest time of society, like they're sort of like, you can kind of see it in a slightly similar way today where, well, one of the problems with society is people are kind of genetically sorting a little bit, right?"}, {"time": 4245, "text": "Like there's much less, like most marriages, right, are between people of similar kind of intellectual level or socioeconomic status, more so these days than in the past."}, {"time": 4257, "text": "And you kind of see some effects of it in stratifying society and kind of he illustrated what that could be like in the extreme."}, {"time": 4265, "text": "There's different versions of it on social media as well."}, {"time": 4267, "text": "It's not just like marriages and so on."}, {"time": 4269, "text": "Like it's genetic sorting in terms of what Dawkins called memes as ideas being put into these bins of these little echo chambers and so on."}, {"time": 4280, "text": "Yeah, I know, so that's the book that's I think a worthwhile read for everyone."}, {"time": 4283, "text": "I mean, 1984 is good, of course, as well."}, {"time": 4285, "text": "Like if you're talking about, you know, dystopian novels of the future."}, {"time": 4288, "text": "Yeah, it's a slightly different view of the future, right?"}, {"time": 4290, "text": "But I kind of like identify with Brave New World a bit more."}, {"time": 4293, "text": "Yeah, speaking of not a book, but my favorite kind of dystopian science fiction is a movie called Brazil, which I don't know if you've heard of."}, {"time": 4304, "text": "I've heard of and I know I need to watch it, but yeah, because it's in, is it in English or no?"}, {"time": 4310, "text": "It's an English movie, yeah."}, {"time": 4312, "text": "And it's a sort of like dystopian movie of authoritarian incompetence, right?"}, {"time": 4318, "text": "It's like nothing really works very well, you know, the system is creaky, you know, but no one is kind of like willing to challenge it, you know, just things kind of ample along and kind of strikes me as like a very plausible future of like, you know, what authoritarianism might look like."}, {"time": 4336, "text": "It's not like this, you know, super efficient evil dictatorship of 1984."}, {"time": 4341, "text": "It's just kind of like this badly functioning, you know, but it's status quo, so it just goes on."}, {"time": 4350, "text": "Yeah, that's one funny thing that stands out to me is in whether it's authoritarian, dystopian stuff, or just basic like, you know, if you look at the movie Contagion, it seems in the movies, government is almost always exceptionally competent."}, {"time": 4369, "text": "Like it's like used as a storytelling tool of like extreme competence."}, {"time": 4375, "text": "Like, you know, you use it whether it's good or evil, but it's competent."}, {"time": 4379, "text": "It's very interesting to think about where much more realistically is it's incompetence and that incompetence isn't itself has consequences that are difficult to predict."}, {"time": 4393, "text": "Like bureaucracy has a very boring way of being evil, of just, you know, if you look at the show, HBO show at Chernobyl, it's a really good story of how bureaucracy, you know, leads to catastrophic events, but not through any kind of evil in any one particular place, but more just like the..."}, {"time": 4417, "text": "It's just the system kind of system."}, {"time": 4420, "text": "Distorting information as it travels up the chain that people unwilling to take responsibility for things and just kind of like this laziness resulting in evil."}, {"time": 4430, "text": "There's a comedic version of this, I don't know if you've seen this movie, it's called The Death of Stalin."}, {"time": 4434, "text": "Yeah, I liked that."}, {"time": 4438, "text": "I wish it wasn't so..."}, {"time": 4440, "text": "There's a movie called Inglourious Bastards about, you know, Hitler and so on."}, {"time": 4447, "text": "For some reason, those movies pissed me off."}, {"time": 4449, "text": "I know a lot of people love them, but like, I just feel like there's not enough good movies, even about Hitler."}, {"time": 4458, "text": "There's good movies about the Holocaust, but even Hitler, there's a movie called Dawnfall that people should watch."}, {"time": 4464, "text": "I think it's the last few days of Hitler."}, {"time": 4466, "text": "That's a good movie, turned into a meme, but it's good."}, {"time": 4470, "text": "But on Stalin, I feel like I may be wrong on this, but at least in the English speaking world, there's not good movies about the evil of Stalin."}, {"time": 4479, "text": "Let's try to see that."}, {"time": 4480, "text": "Actually, so I agree with you on Inglourious Bastard."}, {"time": 4483, "text": "I didn't love the movie because I felt like kind of the stylizing of it, right?"}, {"time": 4490, "text": "The whole Tarantino kind of Tarantinoism, if you will, kind of detracted from it and made it seem like unserious a little bit."}, {"time": 4500, "text": "But Death of Stalin, I felt differently."}, {"time": 4502, "text": "Maybe it's because it's a comedy to begin with."}, {"time": 4503, "text": "This is not like I'm expecting seriousness, but it kind of depicted the absurdity of the whole situation in a way, right?"}, {"time": 4513, "text": "I mean, it was funny, so maybe it does make light of it, but something goes probably like this, right?"}, {"time": 4518, "text": "Like a bunch of kind of people, they're like, oh shit, right?"}, {"time": 4523, "text": "But like the thing is, it was so close to like what probably was reality."}, {"time": 4532, "text": "It was caricaturing reality to where I think an observer might think that this is not, like they might think it's a comedy."}, {"time": 4541, "text": "Well, in reality, that's the absurdity of how people act with dictators."}, {"time": 4548, "text": "I mean, that's, I guess it was too close to reality for me."}, {"time": 4554, "text": "The kind of banality of like what were eventually like fairly evil acts, right?"}, {"time": 4559, "text": "But like, yeah, they're just a bunch of people trying to survive."}, {"time": 4564, "text": "Cause I think there's a good, I haven't watched it yet, the good movie on, the movie on Churchill with Gary Oldman, I think it's Gary Oldman."}, {"time": 4574, "text": "I may be making that up."}, {"time": 4575, "text": "But I think he won, like he was nominated for an Oscar or something."}, {"time": 4577, "text": "So I like, I love these movies about these humans and Stalin, like Chernobyl made me realize the HBO show that there's not enough movies about Russia that capture that spirit."}, {"time": 4593, "text": "I'm sure it might be in Russian there is, but the fact that some British dude that like did comedy, I feel like he did like hangover or some shit like that."}, {"time": 4602, "text": "I don't know if you're familiar with the person who created Chernobyl, but he was just like some guy that doesn't know anything about Russia."}, {"time": 4607, "text": "And he just went in and just studied it, like did a good job of creating it and then got it so accurate, like poetically."}, {"time": 4616, "text": "And the facts that you need to get accurate, he got accurate, just the spirit of it down to like the bowls that pets use, just the whole feel of it."}, {"time": 4625, "text": "It was incredible."}, {"time": 4625, "text": "It was good, yeah, I saw the series."}, {"time": 4627, "text": "Yeah, it's incredible."}, {"time": 4628, "text": "It's made me wish that somebody did a good, like 1930s, like starvation that Stalin led to, like leading up to World War II and in World War II itself, like Stalingrad and so on."}, {"time": 4643, "text": "Like, I feel like that story needs to be told."}, {"time": 4647, "text": "Millions of people died."}, {"time": 4650, "text": "And to me, it's so much more fascinating than Hitler because Hitler is like a caricature of evil almost that it's so, especially with the Holocaust, it's so difficult to imagine that something like that is possible ever again."}, {"time": 4667, "text": "Stalin to me represents something that is possible."}, {"time": 4672, "text": "Like the so interesting, like the bureaucracy of it is so fascinating that it potentially might be happening in the world now, like that we're not aware of, like with North Korea, another one that, like there should be a good film on."}, {"time": 4688, "text": "And like the possible things that could be happening in China with overreach of government."}, {"time": 4693, "text": "I don't know, there's a lot of possibilities there."}, {"time": 4695, "text": "I suppose."}, {"time": 4696, "text": "Yeah, I wonder how much, you know, I guess the archives should be maybe more open nowadays, right, I mean, for a long time, they just, we didn't know, right, or anyways, no one in the West knew for sure."}, {"time": 4705, "text": "Well, there's a, I don't know if you know him, there's a guy named Stephen Kotkin."}, {"time": 4709, "text": "He is a historian of Stalin that I spoke to on this podcast."}, {"time": 4713, "text": "I'll speak to him again."}, {"time": 4714, "text": "The guy knows his shit on Stalin."}, {"time": 4718, "text": "He like read everything and it's so fascinating to talk to somebody, like he knows Stalin better than Stalin himself, it's crazy."}, {"time": 4733, "text": "Like you have, so he's, I think he's a Princeton, he is basically, his whole life is Stalin."}, {"time": 4738, "text": "Fighting Stalin."}, {"time": 4739, "text": "Yeah, it's great."}, {"time": 4740, "text": "And in that context, he also talks about and writes about Putin a little bit."}, {"time": 4746, "text": "I've also read at this point, I think every biography of Putin, English biography of Putin, I need to read some Russians."}, {"time": 4754, "text": "Obviously, I'm mentally preparing for a possible conversation with Putin."}, {"time": 4757, "text": "So what is your first question to Putin when you have him on the podcast?"}, {"time": 4762, "text": "I, it's interesting you bring that up."}, {"time": 4766, "text": "First of all, I wouldn't tell you, but."}, {"time": 4767, "text": "You can't give it away now."}, {"time": 4770, "text": "But I actually haven't even thought about that."}, {"time": 4774, "text": "So my current approach, and I do this with interviews often, obviously that's a special one, but I try not to think about questions until last minute."}, {"time": 4785, "text": "I'm trying to sort of get into the mindset."}, {"time": 4790, "text": "And so that's why I'm soaking in a lot of stuff, not thinking about questions, just learning about the man."}, {"time": 4796, "text": "But in terms of like human to human, it's like, I would say it's, I don't know if you're a fan of mob movies, but like the mafia, which I am, like Goodfellas and so on, he's much closer to like mob morality, which is like."}, {"time": 4811, "text": "Mob morality, maybe, I could see that."}, {"time": 4814, "text": "But I like your approach anyways of this, the extreme empathy, right?"}, {"time": 4818, "text": "It's a little bit like Hannibal, right?"}, {"time": 4821, "text": "Like if you ever watched the show Hannibal, right?"}, {"time": 4822, "text": "They had that guy, well, you know Hannibal of course, like."}, {"time": 4827, "text": "Yeah, Silence of the Lambs."}, {"time": 4830, "text": "But there were those TV shows as well, and they focused on this guy, Will Durant, who's a character like extreme empath, right?"}, {"time": 4836, "text": "So in the way he like catches all these killers, as he pretty much, he can empathize with them, right?"}, {"time": 4842, "text": "Like he can understand why they're doing the things they're doing, right?"}, {"time": 4845, "text": "It's a pretty excruciating thing, right?"}, {"time": 4848, "text": "Like, because you're pretty much like spending half your time in the head of evil people, right?"}, {"time": 4852, "text": "Like, but."}, {"time": 4854, "text": "I mean, I definitely try to do that with others."}, {"time": 4857, "text": "So you should do that in moderation, but I think it's a pretty safe place, safe place to be."}, {"time": 4864, "text": "One of the cool things with this podcast, and I know you didn't sign up to hear me listen to this bullshit, but."}, {"time": 4871, "text": "I, and what's his name?"}, {"time": 4875, "text": "Chris Latner, who's a Google, oh, he's not Google anymore, SciFi."}, {"time": 4879, "text": "He's legit, he's one of the most legit engineers I talk with, I talk with him again on this podcast."}, {"time": 4883, "text": "And one of the, he gives me private advice a lot."}, {"time": 4887, "text": "And he said for this podcast, I should like interview, like I should widen the range of people because that gives you much more freedom to do stuff."}, {"time": 4898, "text": "Like, so his idea, which I think I agree with Chris is that you go to the extremes."}, {"time": 4904, "text": "You just like cover every extreme base and then it gives you freedom to then go to the more nuanced conversations."}, {"time": 4910, "text": "And it's kind of, I think there's a safe place for that."}, {"time": 4913, "text": "There's certainly a hunger for that nuanced conversation, I think, amongst people where like on social media, you get canceled for anything slightly tense, that there's a hunger to go full."}, {"time": 4926, "text": "Right, you go so far to the opposite side."}, {"time": 4928, "text": "And that's like demystifies it a little bit, right?"}, {"time": 4931, "text": "There is a person behind all of these things."}, {"time": 4935, "text": "And that's the cool thing about podcasting, like three, four hour conversations that it's very different than a clickbait journalism, it's like the opposite, that there's a hunger for that."}, {"time": 4946, "text": "There's a willingness for that."}, {"time": 4948, "text": "Yeah, especially now, I mean, how many people do you even see face to face anymore?"}, {"time": 4951, "text": "Right, like this, you know?"}, {"time": 4953, "text": "It's like not that many people like in my day today, aside from my own family that like I sit across."}, {"time": 4959, "text": "It's sad, but it's also beautiful."}, {"time": 4961, "text": "Like I've gotten the chance to like, like our conversation now, there's somebody, I guarantee you there's somebody in Russia listening to this now, like jogging."}, {"time": 4972, "text": "There's somebody who is just smoked some weed, sit back on a couch and just like enjoying."}, {"time": 4978, "text": "I guarantee you that we'll write in the comments right now that yes, I'm in St. Petersburg, I'm in Moscow, whatever."}, {"time": 4985, "text": "And we're in their head and they have a friendship with us."}, {"time": 4990, "text": "I'm the same way, I'm a huge fan of podcasting."}, {"time": 4995, "text": "I mean, it's a weird one way human connection."}, {"time": 4998, "text": "Like before I went on Joe Rogan and still, I'm just a huge fan of his."}, {"time": 5004, "text": "So it was like surreal."}, {"time": 5005, "text": "I've been friends with Joe Rogan for 10 years, but one way."}, {"time": 5008, "text": "Yeah, from this way, from the St. Petersburg way."}, {"time": 5011, "text": "Yeah, the St. Petersburg way and it's a real friendship."}, {"time": 5014, "text": "I mean, now it's like two way, but it's still surreal."}, {"time": 5018, "text": "And that's the magic of podcasting."}, {"time": 5020, "text": "I'm not sure what to make of it."}, {"time": 5022, "text": "That voice, it's not even the video part."}, {"time": 5025, "text": "It's the audio that's magical."}, {"time": 5028, "text": "I don't know what to do with it, but it's people listen to three, four hours."}, {"time": 5033, "text": "Yeah, we evolved over millions of years, right?"}, {"time": 5037, "text": "To be very fine tuned to things like that, right?"}, {"time": 5040, "text": "Oh, expressions as well, of course, right?"}, {"time": 5042, "text": "But back in the day on the Savannah, you had to be very attuned to whether you had a good relationship with the rest of your tribe or a very bad relationship, right?"}, {"time": 5053, "text": "Because if you had a very bad relationship, you were probably gonna be left behind and eaten by the lions."}, {"time": 5058, "text": "Yeah, but it's weird that the tribe is different now."}, {"time": 5062, "text": "Like you could have a one way connection with Joe Rogan as opposed to the tribe of your physical vicinity."}, {"time": 5070, "text": "But that's why it works with the podcasting, but it's the opposite of what happens on Twitter, right?"}, {"time": 5075, "text": "Because all those nuances are removed, right?"}, {"time": 5078, "text": "You're not connecting with the person because you don't hear the voice."}, {"time": 5082, "text": "You're connecting with like an abstraction, right?"}, {"time": 5084, "text": "It's like some stream of tweets, right?"}]}]