[{"title": "Richard Dawkins: Evolution, Intelligence, Simulation, and Memes | Lex Fridman Podcast #87", "id": "5f-JlzBuUUU", "quotes": [{"time": 339, "text": "It's a risk."}, {"time": 343, "text": "But what a bet."}, {"time": 343, "text": "I mean, I'm pretty confident."}, {"time": 348, "text": "But it would look, sorry, yes, it would probably look very similar, but it's almost like Einstein general relativity versus Newtonian physics."}, {"time": 353, "text": "It'll be maybe an alteration of the theory or something like that, but it won't be fundamentally different."}, {"time": 366, "text": "So now for the past 70 years, even before the AI community has been trying to engineer intelligence, in a sense, to do what intelligent design says, you know, was done here on earth."}, {"time": 378, "text": "Do you think it's possible to build intelligence, to build computers that are intelligent, or do we need to do something like the evolutionary process?"}, {"time": 386, "text": "Like there's no shortcuts here."}, {"time": 393, "text": "I'm committed to the belief that is ultimately possible because I think there's nothing nonphysical in our brains."}, {"time": 398, "text": "I think our brains work by the laws of physics."}, {"time": 404, "text": "And so it must, in principle, it'd be possible to replicate that."}, {"time": 409, "text": "In practice, though, it might be very difficult."}, {"time": 409, "text": "And as you suggest, it may be the only way to do it is by something like an evolutionary process."}, {"time": 414, "text": "I'd be surprised."}, {"time": 414, "text": "I suspect that it will come, but it's certainly been slower in coming than some of the early pioneers thought it would be."}, {"time": 426, "text": "But in your sense, is the evolutionary process efficient?"}, {"time": 426, "text": "So you can see it as exceptionally wasteful in one perspective, but at the same time, maybe that is the only path."}, {"time": 437, "text": "It's a paradox, isn't it?"}, {"time": 437, "text": "I mean, on the one side, it is deplorably wasteful."}, {"time": 437, "text": "It's fundamentally based on waste."}, {"time": 442, "text": "On the other hand, it does produce magnificent results."}, {"time": 446, "text": "I mean, the design of a soaring bird, an albatross, a vulture, an eagle, is superb."}, {"time": 446, "text": "An engineer would be proud to have done it."}, {"time": 458, "text": "On the other hand, an engineer would not be proud to have done some of the other things that evolution has served up."}, {"time": 461, "text": "Some of the sort of botched jobs that you can easily understand because of their historical origins, but they don't look well designed."}, {"time": 472, "text": "Do you have examples of bad design?"}, {"time": 475, "text": "My favorite example is the recurrent laryngeal nerve."}, {"time": 475, "text": "I've used this many times."}, {"time": 475, "text": "This is a nerve."}, {"time": 479, "text": "It's one of the cranial nerves, which goes from the brain, and the end organ is that it supplies is the voice box, the larynx."}, {"time": 484, "text": "But it doesn't go straight to the larynx."}, {"time": 490, "text": "It goes right down into the chest and then loops around an artery in the chest and then comes straight back up again to the larynx."}, {"time": 495, "text": "And I've assisted in the dissection of a giraffe's neck, which happened to have died in a zoo."}, {"time": 501, "text": "And we saw the recurrent laryngeal nerve whizzing straight past the larynx, within an inch of the larynx, down into the chest, and then back up again, which is a detour of many feet."}, {"time": 512, "text": "Very, very inefficient."}, {"time": 521, "text": "The reason is historical."}, {"time": 521, "text": "The ancestors are fish ancestors, the ancestors of all mammals and fish."}, {"time": 526, "text": "The most direct pathway of that, of the equivalent of that nerve, there wasn't a larynx in those days, but it innervated part of the gills."}, {"time": 534, "text": "The most direct pathway was behind that artery."}, {"time": 539, "text": "And then when the mammal, when the tetrapods, when the land vertebrae started evolving, and then the neck started to stretch, the marginal cost of changing the embryological design to jump that nerve over the artery was too great."}, {"time": 552, "text": "Or rather, each step of the way was a very small cost, but the cost of actually jumping it over would have been very large."}, {"time": 564, "text": "As the neck lengthened, it was a negligible change to just increase the length of the detour a tiny bit, a tiny bit, a tiny bit, each millimeter at a time, didn't make any difference."}, {"time": 575, "text": "But finally, when you get to a giraffe, it's a huge detour and no doubt is very inefficient."}, {"time": 580, "text": "Now that's bad design."}, {"time": 580, "text": "Any engineer would reject that piece of design."}, {"time": 587, "text": "And there are quite a number of examples, as you'd expect."}, {"time": 587, "text": "It's not surprising that we find examples of that sort."}, {"time": 592, "text": "In a way, what's surprising is there aren't more of them."}, {"time": 592, "text": "In a way, what's surprising is that the design of living things is so good."}, {"time": 595, "text": "So natural selection manages to achieve excellent results, partly by tinkering, partly by coming along and cleaning up initial mistakes and, as it were, making the best of a bad job."}, {"time": 611, "text": "I mean, it is surprising and beautiful and it's a mystery from an engineering perspective that so many things are well designed."}, {"time": 622, "text": "I suppose the thing we're forgetting is how many generations have to die for that."}, {"time": 630, "text": "That's the inefficiency of it."}, {"time": 630, "text": "Yes, that's the horrible wastefulness of it."}, {"time": 633, "text": "So yeah, we marvel at the final product, but yeah, the process is painful."}, {"time": 639, "text": "Elon Musk describes human beings as potentially what he calls the biological bootloader for artificial intelligence or artificial general intelligence is used as the term."}, {"time": 645, "text": "It's kind of like super intelligence."}, {"time": 650, "text": "Do you see superhuman level intelligence as potentially the next step in the evolutionary process?"}, {"time": 657, "text": "Yes, I think that if superhuman intelligence is to be found, it will be artificial."}, {"time": 662, "text": "I don't have any hope that we ourselves, our brains will go on getting larger in ordinary biological evolution."}, {"time": 669, "text": "I think that's probably come to an end."}, {"time": 669, "text": "It is the dominant trend or one of the dominant trends in our fossil history for the last two or three million years."}, {"time": 682, "text": "Brain size?"}, {"time": 682, "text": "Brain size, yes."}, {"time": 682, "text": "So it's been swelling rather dramatically over the last two or three million years."}, {"time": 688, "text": "That is unlikely to continue."}, {"time": 688, "text": "The only way that happens is because natural selection favors those individuals with the biggest brains and that's not happening anymore."}, {"time": 701, "text": "So in general, in humans, the selection pressures are not, I mean, are they active in any form?"}, {"time": 708, "text": "Well, in order for them to be active, it would be necessary that the most, let's call it intelligence."}, {"time": 716, "text": "Not that intelligence is simply correlated with brain size, but let's talk about intelligence."}, {"time": 722, "text": "In order for that to evolve, it's necessary that the most intelligent beings have the most, individuals have the most children."}, {"time": 728, "text": "And so intelligence may buy you money, it may buy you worldly success, it may buy you a nice house and a nice car and things like that if you have a successful career."}, {"time": 742, "text": "It may buy you the admiration of your fellow people, but it doesn't increase the number of offspring that you have."}, {"time": 749, "text": "It doesn't increase your genetic legacy to the next generation."}, {"time": 755, "text": "On the other hand, artificial intelligence, I mean, computers and technology generally, is is evolving by a non genetic means, by leaps and bounds, of course."}, {"time": 762, "text": "And so what do you think, I don't know if you're familiar, there's a company called Neuralink, but there's a general effort of brain computer interfaces, which is to try to build a connection between the computer and the brain to send signals both directions."}, {"time": 779, "text": "And the long term dream there is to do exactly that, which is expand, I guess, expand the size of the brain, expand the capabilities of the brain."}, {"time": 785, "text": "Do you see this as interesting?"}, {"time": 792, "text": "Do you see this as a promising possible technology?"}, {"time": 792, "text": "Or is the interface between the computer and the brain, like the brain is this wet, messy thing that's just impossible to interface with?"}, {"time": 802, "text": "Well, of course, it's interesting, whether it's promising, I'm really not qualified to say."}, {"time": 807, "text": "What I do find puzzling is that the brain being as small as it is compared to a computer and the individual components being as slow as they are compared to our electronic components, it is astonishing what it can do."}, {"time": 820, "text": "I mean, imagine building a computer that fits into the size of a human skull."}, {"time": 827, "text": "And with the equivalent of transistors or integrated circuits, which work as slowly as neurons do."}, {"time": 837, "text": "It's something mysterious about that, something, something must be going on that we don't understand."}, {"time": 844, "text": "So I have just talked to Roger Penrose, I'm not sure you're familiar with his work."}, {"time": 851, "text": "And he also describes this kind of mystery in the mind, in the brain, that as he sees a materialist, so there's no sort of mystical thing going on."}, {"time": 860, "text": "But there's so much about the material of the brain that we don't understand."}, {"time": 867, "text": "That might be quantum mechanical in nature and so on."}, {"time": 867, "text": "So there the idea is about consciousness."}, {"time": 872, "text": "Do you have any, have you ever thought about, do you ever think about ideas of consciousness or a little bit more about the mystery of intelligence and consciousness that seems to pop up just like you're saying from our brain?"}, {"time": 882, "text": "I agree with Roger Penrose that there is a mystery there."}, {"time": 888, "text": "I mean, he's one of the world's greatest physicists."}, {"time": 888, "text": "I can't possibly argue with his..."}, {"time": 895, "text": "But nobody knows anything about consciousness."}, {"time": 895, "text": "And in fact, if we talk about religion and so on, the mystery of consciousness is so awe inspiring and we know so little about it that the leap to sort of religious or mystical explanations is too easy to make."}, {"time": 916, "text": "I think that it's just an act of cowardice to leap to religious explanations and Roger doesn't do that, of course."}, {"time": 921, "text": "But I accept that there may be something that we don't understand about it."}, {"time": 928, "text": "So correct me if I'm wrong, but in your book, Selfish Gene, the gene centered view of evolution allows us to think of the physical organisms as just the medium through which the software of our genetics and the ideas sort of propagate."}, {"time": 940, "text": "So maybe can we start just with the basics?"}, {"time": 949, "text": "What in this context does the word meme mean?"}, {"time": 949, "text": "It would mean the cultural equivalent of a gene, cultural equivalent in the sense of that which plays the same role as the gene in the transmission of culture and the transmission of ideas in the broadest sense."}, {"time": 962, "text": "And it's a useful word if there's something Darwinian going on."}, {"time": 968, "text": "Obviously, culture is transmitted, but is there anything Darwinian going on?"}, {"time": 974, "text": "And if there is, that means there has to be something like a gene, which becomes more numerous or less numerous in the population."}, {"time": 985, "text": "So it can replicate?"}, {"time": 987, "text": "It can replicate."}, {"time": 987, "text": "Well, it clearly does replicate."}, {"time": 987, "text": "There's no question about that."}, {"time": 991, "text": "The question is, does it replicate in a sort of differential way in a Darwinian fashion?"}, {"time": 991, "text": "Could you say that certain ideas propagate because they're successful in the meme pool?"}, {"time": 996, "text": "In a sort of trivial sense, you can."}, {"time": 1003, "text": "Would you wish to say, though, that in the same way as an animal body is modified, adapted to serve as a machine for propagating genes, is it also a machine for propagating memes?"}, {"time": 1019, "text": "Could you actually say that something about the way a human is, is modified, adapted, is modified, adapted for the function of meme propagation?"}, {"time": 1032, "text": "That's such a fascinating possibility, if that's true."}, {"time": 1032, "text": "That it's not just about the genes which seem somehow more comprehensible as these things of biology."}, {"time": 1038, "text": "The idea that culture or maybe ideas, you can really broadly define it, operates under these mechanisms."}, {"time": 1053, "text": "Even morphology, even anatomy does evolve by memetic means."}, {"time": 1053, "text": "I mean, things like hairstyles, styles of makeup, circumcision, these things are actual changes in the body form which are nongenetic and which get passed on from generation to generation or sideways like a virus in a quasi genetic way."}, {"time": 1079, "text": "But the moment you start drifting away from the physical, it becomes interesting because the space of ideas, ideologies, political systems."}, {"time": 1089, "text": "Of course, yes."}, {"time": 1090, "text": "Are memes a metaphor more or are they really, is there something fundamental, almost physical presence of memes?"}, {"time": 1104, "text": "Well, I think they're a bit more than a metaphor."}, {"time": 1104, "text": "And I mentioned the physical bodily characteristics which are a bit trivial in a way, but when things like the propagation of religious ideas, both longitudinally down generations and transversely as in a sort of epidemiology of ideas, when a charismatic preacher converts people, that resembles viral transmission."}, {"time": 1134, "text": "Whereas the longitudinal transmission from grandparent to parent to child, et cetera, is more like conventional genetic transmission."}, {"time": 1146, "text": "That's such a beautiful, especially in the modern day idea."}, {"time": 1146, "text": "Do you think about this implication in social networks where the propagation of ideas, the viral propagation of ideas, and has the new use of the word meme to describe?"}, {"time": 1161, "text": "Well, the internet, of course, provides extremely rapid method of transmission."}, {"time": 1167, "text": "Before, when I first coined the word, the internet didn't exist."}, {"time": 1167, "text": "And so I was thinking that in terms of books, newspapers, broader radio, television, that kind of thing."}, {"time": 1178, "text": "Now an idea can just leap around the world in all directions instantly."}, {"time": 1178, "text": "And so the internet provides a step change in the facility of propagation of memes."}, {"time": 1194, "text": "Isn't it fascinating that sort of ideas, it's like you have Galapagos Islands or something, it's the 70s, and the internet allowed all these species to just like globalize."}, {"time": 1205, "text": "And in a matter of seconds, you can spread the message to millions of people."}, {"time": 1211, "text": "And these ideas, these memes can breed, can evolve, can mutate."}, {"time": 1211, "text": "And there's a selection, and there's like different, I guess, groups that have all like, there's a dynamics that's fascinating here."}, {"time": 1226, "text": "Do you think, yes, basically, do you think your work in this direction, while fundamentally was focused on life on Earth, do you think it should continue, like to be taken further?"}, {"time": 1238, "text": "Well, I do think it would probably be a good idea to think in a Darwinian way about this sort of thing."}, {"time": 1243, "text": "We conventionally think of the transmission of ideas from an evolutionary context as being limited to, in our ancestors, people living in villages, living in small bands where everybody knew each other, and ideas could propagate within the village, and they might hop to a neighboring village, occasionally, and maybe even to a neighboring continent eventually."}, {"time": 1268, "text": "And that was a slow process."}, {"time": 1268, "text": "Nowadays, villages are international."}, {"time": 1275, "text": "I mean, you have people, it's been called echo chambers, where people are in a sort of internet village, where the other members of the village may be geographically distributed all over the world, but they just happen to be interested in the same things, use the same terminology, the same jargon, have the same enthusiasm."}, {"time": 1292, "text": "So, people like the Flat Earth Society, they don't all live in one place, they find each other, and they talk the same language to each other, they talk the same nonsense to each other."}, {"time": 1304, "text": "And they, so this is a kind of distributed version of the primitive idea of people living in villages and propagating their ideas in a local way."}, {"time": 1318, "text": "Is there Darwinist parallel here?"}, {"time": 1318, "text": "So, is there evolutionary purpose of villages, or is that just a..."}, {"time": 1327, "text": "I wouldn't use a word like evolutionary purpose in that case, but villages will be something that just emerged, that's the way people happen to live."}, {"time": 1336, "text": "And in just the same kind of way, the Flat Earth Society, societies of ideas emerge in the same kind of way in this digital space."}, {"time": 1347, "text": "Is there something interesting to say about the, I guess, from a perspective of Darwin, could we fully interpret the dynamics of social interaction in these social networks?"}, {"time": 1355, "text": "Or is there some much more complicated thing need to be developed?"}, {"time": 1363, "text": "Like, what's your sense?"}, {"time": 1369, "text": "Well, a Darwinian selection idea would involve investigating which ideas spread and which don't."}, {"time": 1375, "text": "So, some ideas don't have the ability to spread."}, {"time": 1375, "text": "I mean, the Flat Earth, Flat Earthism is, there are a few people believe in it, but it's not going to spread because it's obvious nonsense."}, {"time": 1387, "text": "But other ideas, even if they are wrong, can spread because they are attractive in some sense."}, {"time": 1396, "text": "So the spreading and the selection in the Darwinian context is, it just has to be attractive in some sense."}, {"time": 1404, "text": "Like we don't have to define, like it doesn't have to be attractive in the way that animals attract each other."}, {"time": 1407, "text": "It could be attractive in some other way."}, {"time": 1412, "text": "All that matters is, all that is needed is that it should spread."}, {"time": 1412, "text": "And it doesn't have to be true to spread."}, {"time": 1418, "text": "In truth, there's one criterion which might help an idea to spread."}, {"time": 1423, "text": "But there are other criteria which might help it to spread."}, {"time": 1423, "text": "As you say, attraction in animals is not necessarily valuable for survival."}, {"time": 1429, "text": "The famous peacock's tail doesn't help the peacock to survive."}, {"time": 1436, "text": "It helps it to pass on its genes."}, {"time": 1436, "text": "Similarly, an idea which is actually rubbish, but which people don't know is rubbish and think is very attractive will spread in the same way as a peacock's gene spread."}, {"time": 1450, "text": "It's a small sidestep."}, {"time": 1450, "text": "I remember reading somewhere, I think recently, that in some species of birds, sort of the idea that beauty may have its own purpose and the idea that some birds, I'm being ineloquent here, but there's some aspects of their feathers and so on that serve no evolutionary purpose whatsoever."}, {"time": 1471, "text": "There's somebody making an argument that there are some things about beauty that animals do that may be its own purpose."}, {"time": 1477, "text": "Does that ring a bell for you?"}, {"time": 1484, "text": "Does that sound ridiculous?"}, {"time": 1486, "text": "I think it's a rather distorted bell."}, {"time": 1486, "text": "Darwin, when he coined the phrase sexual selection, didn't feel the need to suggest that what was attractive to females, usually is males attracting females, that what females found attractive had to be useful."}, {"time": 1504, "text": "He said it didn't have to be useful."}, {"time": 1508, "text": "It was enough that females found it attractive."}, {"time": 1508, "text": "And so it could be completely useless, probably was completely useless in the conventional sense, but was not at all useless in the sense of passing on, Darwin didn't call them genes, but in the sense of reproducing."}, {"time": 1524, "text": "Others, starting with Wallace, the co discoverer of natural selection, didn't like that idea and they wanted sexually selected characteristics like peacock's tails to be in some sense useful."}, {"time": 1537, "text": "It's a bit of a stretch to think of a peacock's tail as being useful, but in the sense of survival, but others have run with that idea and have brought it up to date."}, {"time": 1547, "text": "And so there are two schools of thought on sexual selection, which are still active and about equally supported now."}, {"time": 1553, "text": "Those who follow Darwin in thinking that it's just enough to say it's attractive and those who follow Wallace and say that it has to be in some sense useful."}, {"time": 1568, "text": "Do you fall into one category or the other?"}, {"time": 1570, "text": "No, I'm open minded."}, {"time": 1570, "text": "I think they both could be correct in different cases."}, {"time": 1570, "text": "I mean, they've both been made sophisticated in a mathematical sense, more so than when Darwin and Wallace first started talking about it."}, {"time": 1582, "text": "I'm Russian, I romanticize things, so I prefer the former, where the beauty in itself is a powerful attraction, is a powerful force in evolution."}, {"time": 1590, "text": "On religion, do you think there will ever be a time in our future where almost nobody believes in God, or God is not a part of the moral fabric of our society?"}, {"time": 1609, "text": "Yes, I do."}, {"time": 1609, "text": "I think it may happen after a very long time."}, {"time": 1609, "text": "It may take a long time for that to happen."}, {"time": 1616, "text": "So do you think ultimately for everybody on Earth, religion, other forms of doctrines, ideas could do better job than what religion does?"}, {"time": 1627, "text": "I mean, following in truth, reason."}, {"time": 1632, "text": "Well, truth is a funny, funny word."}, {"time": 1632, "text": "And reason too."}, {"time": 1632, "text": "There's, yeah, it's a difficult idea now with truth on the internet, right, and fake news and so on."}, {"time": 1643, "text": "I suppose when you say reason, you mean the very basic sort of inarguable conclusions of science versus which political system is better."}, {"time": 1658, "text": "I mean, truth about the real world, which is ascertainable by, not just by the more rigorous methods of science, but by just ordinary sensory observation."}, {"time": 1671, "text": "So do you think there will ever be a time when we move past it?"}, {"time": 1671, "text": "Like, I guess another way to ask it, are we hopelessly, fundamentally tied to religion in the way our society functions?"}, {"time": 1688, "text": "Well, clearly all individuals are not hopelessly tied to it because many individuals don't believe."}, {"time": 1694, "text": "You could mean something like society needs religion in order to function properly, something like that."}, {"time": 1701, "text": "And some people have suggested that."}, {"time": 1704, "text": "What's your intuition on that?"}, {"time": 1706, "text": "Well, I've read books on it and they're persuasive."}, {"time": 1706, "text": "I don't think they're that persuasive though."}, {"time": 1713, "text": "I mean, some people suggested that society needs a sort of figurehead, which can be a non existent figurehead in order to function properly."}, {"time": 1721, "text": "I think there's something rather patronising about the idea that, well, you and I are intelligent enough not to believe in God, but the plebs need it sort of thing."}, {"time": 1731, "text": "And I think that's patronising."}, {"time": 1731, "text": "And I'd like to think that that was not the right way to proceed."}, {"time": 1741, "text": "But at the individual level, do you think there's some value of spirituality?"}, {"time": 1741, "text": "Sort of, if I think sort of as a scientist, the amount of things we actually know about our universe is a tiny, tiny, tiny percentage of what we could possibly know."}, {"time": 1755, "text": "So just from everything, even the certainty we have about the laws of physics, it seems to be that there's yet a huge amount to discover."}, {"time": 1765, "text": "And therefore we're sitting where 99.99% of things are just still shrouded in mystery."}, {"time": 1772, "text": "Do you think there's a role in a kind of spiritual view of that, sort of a humbled spiritual view?"}, {"time": 1779, "text": "I think it's right to be humble."}, {"time": 1779, "text": "I think it's right to admit that there's a lot we don't know, a lot we don't understand, a lot that we still need to work on."}, {"time": 1783, "text": "We're working on it."}, {"time": 1788, "text": "What I don't think is that it helps to invoke supernatural explanations."}, {"time": 1788, "text": "If our current scientific explanations aren't adequate to do the job, then we need better ones."}, {"time": 1797, "text": "We need to work more."}, {"time": 1801, "text": "And of course, the history of science shows just that, that as science goes on, problems get solved one after another, and the science advances as science gets better."}, {"time": 1813, "text": "But to invoke a non scientific, non physical explanation is simply to lie down in a cowardly way and say, we can't solve it, so we're going to invoke magic."}, {"time": 1821, "text": "Don't let's do that."}, {"time": 1821, "text": "Let's say we need better science."}, {"time": 1825, "text": "We need more science."}, {"time": 1825, "text": "It may be that the science will never do it."}, {"time": 1830, "text": "It may be that we will never actually understand everything."}, {"time": 1830, "text": "And that's okay, but let's keep working on it."}, {"time": 1839, "text": "A challenging question there is, do you think science can lead us astray in terms of the humbleness?"}, {"time": 1843, "text": "So there's some aspect of science, maybe it's the aspect of scientists and not science, but of sort of a mix of ego and confidence that can lead us astray in terms of discovering the, you know, some of the big open questions about the universe."}, {"time": 1865, "text": "I mean, there are, there are arrogant people in any walk of life and scientists are no exception to that."}, {"time": 1869, "text": "And so there are arrogant scientists who think we've solved everything."}, {"time": 1873, "text": "Of course we haven't."}, {"time": 1873, "text": "So humility is a proper stance for a scientist."}, {"time": 1878, "text": "I mean, it's a proper working stance because it encourages further work."}, {"time": 1878, "text": "But in a way to resort to a supernatural explanation is a kind of arrogance because it's saying, well, we don't understand it scientifically."}, {"time": 1890, "text": "Therefore the non scientific religious supernatural explanation must be the right one."}, {"time": 1898, "text": "That's arrogant."}, {"time": 1898, "text": "What is, what is humble is to say we don't know and we need to work further on it."}, {"time": 1906, "text": "So maybe if I could psychoanalyze you for a second, you have at times been just slightly frustrated with people who have supernat, you know, have a supernatural."}, {"time": 1913, "text": "Has that changed over the years?"}, {"time": 1920, "text": "Have you become like, how do people that kind of have a seek supernatural explanations, how do you see those people as human beings as it's like, do you see them as dishonest?"}, {"time": 1932, "text": "Do you see them as, um, sort of, uh, ignorant?"}, {"time": 1932, "text": "Do you see them as, I don't know, is it like, how do you think of certainly not, not, not dishonest."}, {"time": 1941, "text": "And, and I mean, obviously many of them are perfectly nice people."}, {"time": 1946, "text": "So I don't, I don't sort of despise them in that sense."}, {"time": 1950, "text": "Um, I think it's often a misunderstanding that, that, um, people will jump from the admission that we don't understand something."}, {"time": 1958, "text": "They will jump straight to what they think of as an alternative explanation, which is the supernatural one, which is not an alternative."}, {"time": 1969, "text": "It's a non explanation."}, {"time": 1969, "text": "Um, instead of jumping to the conclusion that science needs more work, that we need to actually get, do some better, better science."}, {"time": 1975, "text": "So, um, I don't have, I mean, personal antipathy towards such people."}, {"time": 1982, "text": "I just think they're, they're misguided."}, {"time": 1990, "text": "So what about this really interesting space that I have trouble with?"}, {"time": 1990, "text": "So religion I have a better grasp on, but, um, there's a large communities, like you said, Flat Earth community, uh, that I've recently, because I've made a few jokes about it."}, {"time": 2001, "text": "I saw that there's, I've noticed that there's people that take it quite seriously."}, {"time": 2007, "text": "So there's this bigger world of conspiracy theorists, which is a kind of, I mean, there's elements of it that are religious as well, but I think they're also scientific."}, {"time": 2020, "text": "So the, the basic credo of a conspiracy theorist is to question everything, which is also the credo of a good scientist, I would say."}, {"time": 2036, "text": "So what do you make of this?"}, {"time": 2039, "text": "I mean, I think it's probably too easy to say that by labeling something conspiracy, you therefore dismiss it."}, {"time": 2047, "text": "I mean, occasionally conspiracies are right."}, {"time": 2047, "text": "And so we shouldn't dismiss conspiracy theories out of hand."}, {"time": 2051, "text": "We should examine them on their own merits."}, {"time": 2051, "text": "Flat Earthism is obvious nonsense."}, {"time": 2057, "text": "We don't have to examine that much further."}, {"time": 2057, "text": "Um, but, um, I mean, there may be other conspiracy theories which are actually right."}, {"time": 2067, "text": "So I've, you know, grew up in the Soviet Union."}, {"time": 2067, "text": "So I, I just, you know, uh, the space race was very influential for me on both sides of the coin."}, {"time": 2071, "text": "Uh, you know, there's a conspiracy theory that we never went to the moon."}, {"time": 2077, "text": "And it's, uh, it's like, I cannot understand it and it's very difficult to rigorously scientifically show one way or the other."}, {"time": 2085, "text": "It's just, you have to use some of the human intuition about who would have to lie, who would have to work together."}, {"time": 2094, "text": "And it's clear that very unlikely, uh, good behind that is my general intuition that most people in this world are good."}, {"time": 2101, "text": "You know, in order to really put together some conspiracy theories, there has to be a large number of people working together and essentially being dishonest."}, {"time": 2113, "text": "Yes, which is improbable."}, {"time": 2113, "text": "The sheer number who would have to be in on this conspiracy and the sheer detail, the attention to detail they'd have had to have had and so on."}, {"time": 2118, "text": "I'd also worry about the motive and why would anyone want to suggest that it didn't happen?"}, {"time": 2129, "text": "What's the, what's the, why is it so hard to believe?"}, {"time": 2129, "text": "I mean, the, the physics of it, the mathematics of it, the, the idea of computing orbits and, and, and trajectories and things, it, it all works mathematically."}, {"time": 2140, "text": "Why wouldn't you believe it?"}, {"time": 2144, "text": "It's a psychology question because there's something really pleasant about, um, you know, pointing out that the emperor has no clothes when everybody like, uh, you know, thinking outside the box and coming up with the true answer where everybody else is diluted."}, {"time": 2155, "text": "There's something, I mean, I have that for science, right?"}, {"time": 2160, "text": "You want to prove the entire scientific community wrong."}, {"time": 2164, "text": "That's the whole."}, {"time": 2166, "text": "That's, that's, that's right."}, {"time": 2166, "text": "And, and of course, historically, lone geniuses have come out right sometimes, but often people with who think they're a lone genius much more often turn out not to."}, {"time": 2175, "text": "Um, so you have to judge each case on its merits."}, {"time": 2175, "text": "The mere fact that you're a maverick, the mere fact that you, you're going against the current tide doesn't make you right."}, {"time": 2185, "text": "You've got to show you're right by looking at the evidence."}, {"time": 2189, "text": "So because you focus so much on, on religion and disassembled a lot of ideas there and I just, I was wondering if, if you have ideas about conspiracy theory groups, because it's such a prevalent, even reaching into, uh, presidential politics and so on."}, {"time": 2201, "text": "It seems like it's a very large communities that believe different kinds of conspiracy theories."}, {"time": 2206, "text": "Is there some connection there to your thinking on religion?"}, {"time": 2210, "text": "And it is curious."}, {"time": 2210, "text": "It's a matter."}, {"time": 2216, "text": "It's an obvious difficult thing."}, {"time": 2216, "text": "Uh, I don't understand why people believe things that are clearly nonsense, like, well, flat earth and also the conspiracy about not landing on the moon or, um, that, um, the, that the United States engineered 9 11 that, that kind of thing."}, {"time": 2235, "text": "Um, so it's not clearly nonsense."}, {"time": 2235, "text": "It's extremely unlikely."}, {"time": 2235, "text": "It's extremely unlikely that religion is a bit different because it's passed down from generation to generation."}, {"time": 2247, "text": "So many of the people who are religious, uh, got it from their parents who got it from their parents who got it from their parents and childhood indoctrination is a very powerful force."}, {"time": 2255, "text": "But these things like the nine 11 conspiracy theory, the, um, Kennedy assassination conspiracy theory, the man on the moon conspiracy theory, these are not childhood indoctrination."}, {"time": 2270, "text": "These are, um, presumably dreamed up by somebody who then tells somebody else who then wants to believe it."}, {"time": 2277, "text": "And I don't know why people are so eager to fall in line with some, just some person that they happen to read or meet who spins some yarn."}, {"time": 2290, "text": "I can kind of understand why they believe what their parents and teachers told them when they were very tiny and not capable of critical thinking for themselves."}, {"time": 2296, "text": "So I sort of get why the great religions of the world like Catholicism and Islam go on persisting."}, {"time": 2308, "text": "It's because of childhood indoctrination, but that's not true of flat earthism and sure enough flat earthism is a very minority cult way larger than I ever realized."}, {"time": 2314, "text": "Well, yes, I know, but so that's a really clean idea and you've articulated that in your new book and then, and I'll go on God and in God, the illusion is the early indoctrination."}, {"time": 2323, "text": "That's really interesting that you can get away with a lot of out there ideas in terms of religious texts."}, {"time": 2334, "text": "If, um, the age at which you convey those ideas at first is a young age."}, {"time": 2334, "text": "So indoctrination is sort of an essential element of propagation of religion."}, {"time": 2344, "text": "So let me ask on the morality side in the books that I mentioned, God, delusion, and I'll go on God."}, {"time": 2351, "text": "You described that human beings don't need religion to be moral."}, {"time": 2356, "text": "So from an engineering perspective, we want to engineer morality into AI systems."}, {"time": 2361, "text": "So in general, where do you think morals come from in humans?"}, {"time": 2372, "text": "A very complicated and interesting question."}, {"time": 2372, "text": "It's clear to me that the moral standards, the moral values of our civilization changes as the decades go by, certainly as the centuries go by, even as the decades go by."}, {"time": 2390, "text": "And we in the 21st century are quite clearly labeled 21st century people in terms of our moral values."}, {"time": 2399, "text": "There's a spread."}, {"time": 2399, "text": "I mean, some of us are a little bit more ruthless, some of us more conservative, some of us more liberal and so on."}, {"time": 2410, "text": "But we all subscribe to pretty much the same views when you compare us with say 18th century, 17th century people, even 19th century, 20th century people."}, {"time": 2418, "text": "So we're much less racist, we're much less sexist and so on than we used to be."}, {"time": 2426, "text": "Some people are still racist and some are still sexist, but the spread has shifted."}, {"time": 2431, "text": "The Gaussian distribution has moved and moves steadily as the centuries go by."}, {"time": 2437, "text": "And that is the most powerful influence I can see on our moral values."}, {"time": 2447, "text": "And that doesn't have anything to do with religion."}, {"time": 2447, "text": "I mean, the religion, sorry, the morals of the Old Testament are Bronze Age models."}, {"time": 2454, "text": "They're deplorable and they are to be understood in terms of the people in the desert who made them up at the time."}, {"time": 2469, "text": "And so human sacrifice, an eye for an eye, a tooth for a tooth, petty revenge, killing people for breaking the Sabbath, all that kind of thing, inconceivable now."}, {"time": 2483, "text": "So at some point religious texts may have in part reflected that Gaussian distribution at that time."}, {"time": 2490, "text": "I'm sure they did."}, {"time": 2490, "text": "I'm sure they always reflect that, yes."}, {"time": 2492, "text": "And then now, but the sort of almost like the meme, as you describe it, of ideas moves much faster than religious texts do, than new religions."}, {"time": 2502, "text": "So basing your morals on religious texts, which were written millennia ago, is not a great way to proceed."}, {"time": 2509, "text": "I think that's pretty clear."}, {"time": 2509, "text": "So not only should we not get our morals from such texts, but we don't."}, {"time": 2516, "text": "We quite clearly don't."}, {"time": 2516, "text": "If we did, then we'd be discriminating against women and we'd be racist, we'd be killing homosexuals and so on."}, {"time": 2523, "text": "So we don't and we shouldn't."}, {"time": 2532, "text": "Now, of course, it's possible to use your 21st century standards of morality and you can look at the Bible and you can cherry pick particular verses which conform to our modern morality, and you'll find that Jesus says some pretty nice things, which is great."}, {"time": 2550, "text": "But you're using your 21st century morality to decide which verses to pick, which verses to reject."}, {"time": 2558, "text": "And so why not cut out the middleman of the Bible and go straight to the 21st century morality, which is where that comes from."}, {"time": 2564, "text": "It's a much more complicated question."}, {"time": 2571, "text": "Why is it that morality, moral values change as the centuries go by?"}, {"time": 2571, "text": "They undoubtedly do."}, {"time": 2577, "text": "And it's a very interesting question to ask why."}, {"time": 2577, "text": "It's another example of cultural evolution, just as technology progresses, so moral values progress for probably very different reasons."}, {"time": 2590, "text": "But it's interesting if the direction in which that progress is happening has some evolutionary value or if it's merely a drift that can go into any direction."}, {"time": 2598, "text": "I'm not sure it's any direction and I'm not sure it's evolutionarily valuable."}, {"time": 2598, "text": "What it is is progressive in the sense that each step is a step in the same direction as the previous step."}, {"time": 2609, "text": "So it becomes more gentle, more decent by modern standards, more liberal, less violent."}, {"time": 2617, "text": "But more decent, I think you're using terms and interpreting everything in the context of the 21st century because Genghis Khan would probably say that this is not more decent because we're now, you know, there's a lot of weak members of society that we're not murdering."}, {"time": 2633, "text": "I was careful to say by the standards of the 21st century, by our standards, if we with hindsight look back at history, what we see is a trend in the direction towards us, towards our present, our present value system."}, {"time": 2646, "text": "For us, we see progress, but it's an open question whether that won't, you know, I don't see necessarily why we can never return to Genghis Khan times."}, {"time": 2657, "text": "I suspect we won't."}, {"time": 2657, "text": "But if you look at the history of moral values over the centuries, it is in a progressive, I use the word progressive not in a value judgment sense, in the sense of a transitive sense."}, {"time": 2671, "text": "Each step is the same, is the same direction as the previous step."}, {"time": 2677, "text": "So things like we don't derive entertainment from torturing cats."}, {"time": 2677, "text": "We don't derive entertainment from like the Romans did in the Colosseum from that state."}, {"time": 2693, "text": "Or rather we suppress the desire to get, I mean, to have play."}, {"time": 2693, "text": "It's probably in us somewhere."}, {"time": 2700, "text": "So there's a bunch of parts of our brain, one that probably, you know, limbic system that wants certain pleasures."}, {"time": 2705, "text": "And that's I don't, I mean, I wouldn't have said that, but you're at liberty to think that you like, well, no, there's a, there's a Dan Carlin of hardcore history."}, {"time": 2716, "text": "There's a really nice explanation of how we've enjoyed watching the torture of people, the fighting of people, just to torture the suffering of people throughout history as entertainment until quite recently."}, {"time": 2725, "text": "And now everything we do with sports, we're kind of channeling that feeling into something else."}, {"time": 2732, "text": "I mean, there, there is some dark aspects of human nature that are underneath everything."}, {"time": 2738, "text": "And I do hope this like higher level software we've built will keep us at bay."}, {"time": 2744, "text": "I'm also Jewish and have history with the Soviet Union and the Holocaust."}, {"time": 2752, "text": "And I clearly remember that some of the darker aspects of human nature creeped up there."}, {"time": 2759, "text": "There have been, there have been steps backwards admittedly, and the Holocaust is an obvious one."}, {"time": 2764, "text": "But if you take a broad view of history, it's the same direction."}, {"time": 2771, "text": "So Pamela McCordick in Machines Who Think has written that AI began with an ancient wish to forge the gods."}, {"time": 2776, "text": "Do you see, it's a poetic description I suppose, but do you see a connection between our civilizations, historic desire to create gods, to create religions and our modern desire to create technology and intelligent technology?"}, {"time": 2795, "text": "I suppose there's a link between an ancient desire to explain away mystery and science, but intelligence, artificial intelligence, creating gods, creating new gods."}, {"time": 2806, "text": "And I forget, I read somewhere a somewhat facetious paper which said that we have a new god is called Google and we pray to it and we worship it and we ask its advice like an Oracle and so on."}, {"time": 2828, "text": "You don't see that, you see that as a fun statement, a facetious statement."}, {"time": 2828, "text": "You don't see that as a kind of truth of us creating things that are more powerful than ourselves and natural."}, {"time": 2838, "text": "It has a kind of poetic resonance to it, which I get, but I wouldn't, I wouldn't have bothered to make the point myself, put it that way."}, {"time": 2848, "text": "So you don't think AI will become our new god, a new religion, a new gods like Google?"}, {"time": 2855, "text": "I mean, I can see that the future of intelligent machines or indeed intelligent aliens from outer space might yield beings that we would regard as gods in the sense that they are so superior to us that we might as well worship them."}, {"time": 2868, "text": "That's highly plausible, I think."}, {"time": 2875, "text": "But I see a very fundamental distinction between a god who is simply defined as something very, very powerful and intelligent on the one hand and a god who doesn't need explaining by a progressive step by step process like evolution or like engineering design."}, {"time": 2889, "text": "So suppose we did meet an alien from outer space who was marvelously, magnificently more intelligent than us and we would sort of worship it for that reason."}, {"time": 2907, "text": "Nevertheless, it would not be a god in the very important sense that it did not just happen to be there like god is supposed to."}, {"time": 2919, "text": "It must have come about by a gradual step by step incremental progressive process, presumably like Darwinian evolution."}, {"time": 2926, "text": "There's all the difference in the world between those two."}, {"time": 2932, "text": "Intelligence, design comes into the universe late as a product of a progressive evolutionary process or progressive engineering design process."}, {"time": 2946, "text": "So most of the work is done through this slow moving progress."}, {"time": 2952, "text": "But there's still this desire to get answers to the why question that if the world is a simulation, if we're living in a simulation, that there's a programmer like creature that we can ask questions of."}, {"time": 2970, "text": "Well, let's pursue the idea that we're living in a simulation, which is not totally ridiculous, by the way."}, {"time": 2976, "text": "There we go."}, {"time": 2979, "text": "Then you still need to explain the programmer."}, {"time": 2979, "text": "The programmer had to come into existence by some..."}, {"time": 2986, "text": "Even if we're in a simulation, the programmer must have evolved."}, {"time": 2986, "text": "Or if he's in a sort of... Or she."}, {"time": 2995, "text": "If she's in a meta simulation, then the meta program must have evolved by a gradual process."}, {"time": 3003, "text": "You can't escape that."}, {"time": 3003, "text": "Fundamentally, you've got to come back to a gradual incremental process of explanation to start with."}, {"time": 3013, "text": "There's no shortcuts in this world."}, {"time": 3017, "text": "But maybe to linger on that point about the simulation, do you think it's an interesting thing?"}, {"time": 3022, "text": "Basically, you talk to..."}, {"time": 3022, "text": "Bored the heck out of everybody asking this question, but whether you live in a simulation, do you think... First, do you think we live in a simulation?"}, {"time": 3033, "text": "Second, do you think it's an interesting thought experiment?"}, {"time": 3037, "text": "It's certainly an interesting thought experiment."}, {"time": 3037, "text": "I first met it in a science fiction novel by Daniel Galloy called Counterfeit World, in which it's all about..."}, {"time": 3042, "text": "I mean, our heroes are running a gigantic computer which simulates the world, and something goes wrong, and so one of them has to go down into the simulated world in order to fix it."}, {"time": 3060, "text": "And then the denouement of the thing, the climax to the novel, is that they discover that they themselves are in another simulation at a higher level."}, {"time": 3070, "text": "So I was intrigued by this, and I love others of Daniel Galloy's science fiction novels."}, {"time": 3075, "text": "Then it was revived seriously by Nick Bostrom... Bostrom talking to him in an hour."}, {"time": 3087, "text": "And he goes further, not just treat it as a science fiction speculation, he actually thinks it's positively likely."}, {"time": 3092, "text": "I mean, he thinks it's very likely, actually."}, {"time": 3097, "text": "He makes a probabilistic argument, which you can use to come up with very interesting conclusions about the nature of this universe."}, {"time": 3104, "text": "I mean, he thinks that we're in a simulation done by, so to speak, our descendants of the future."}, {"time": 3110, "text": "But it's still a product of evolution."}, {"time": 3110, "text": "It's still ultimately going to be a product of evolution, even though the super intelligent people of the future have created our world, and you and I are just a simulation, and this table is a simulation and so on."}, {"time": 3125, "text": "I don't actually in my heart of hearts believe it, but I like his argument."}, {"time": 3135, "text": "Well, so the interesting thing is that I agree with you, but the interesting thing to me, if I were to say, if we're living in a simulation, that in that simulation, to make it work, you still have to do everything gradually, just like you said."}, {"time": 3146, "text": "That even though it's programmed, I don't think there could be miracles."}, {"time": 3153, "text": "Well, no, I mean, the programmer, the higher, the upper ones have to have evolved gradually."}, {"time": 3159, "text": "However, the simulation they create could be instantaneous."}, {"time": 3159, "text": "I mean, they could be switched on and we come into the world with fabricated memories."}, {"time": 3167, "text": "True, but what I'm trying to convey, so you're saying the broader statement, but I'm saying from an engineering perspective, both the programmer has to be slowly evolved and the simulation because it's like, from an engineering perspective."}, {"time": 3183, "text": "Oh yeah, it takes a long time to write a program."}, {"time": 3185, "text": "No, like just, I don't think you can create the universe in a snap."}, {"time": 3185, "text": "I think you have to grow it."}, {"time": 3192, "text": "Well, that's a good point."}, {"time": 3192, "text": "That's an arguable point."}, {"time": 3192, "text": "By the way, I have thought about using the Nick Bostrom idea to solve the riddle of how you were talking."}, {"time": 3200, "text": "We were talking earlier about why the human brain can achieve so much."}, {"time": 3206, "text": "I thought of this when my then 100 year old mother was marveling at what I could do with a smartphone and I could call, look up anything in the encyclopedia, I could play her music that she liked and so on."}, {"time": 3224, "text": "She said, but it's all in that tiny little phone."}, {"time": 3224, "text": "No, it's out there."}, {"time": 3224, "text": "It's in the cloud."}, {"time": 3228, "text": "And maybe most of what we do is in a cloud."}, {"time": 3228, "text": "So maybe if we are a simulation, even all the power that we think is in our skull, it actually may be like the power that we think is in the iPhone."}, {"time": 3241, "text": "But is that actually out there in an interface to something else?"}, {"time": 3247, "text": "I mean, that's what, including Roger Penrose with panpsychism, that consciousness is somehow a fundamental part of physics, that it doesn't have to actually all reside inside."}, {"time": 3254, "text": "But Roger thinks it does reside in the skull, whereas I'm suggesting that it doesn't, that there's a cloud."}, {"time": 3267, "text": "That'd be a fascinating notion."}, {"time": 3267, "text": "On a small tangent, are you familiar with the work of Donald Hoffman, I guess?"}, {"time": 3275, "text": "Maybe not saying his name correctly, but just forget the name, the idea that there's a difference between reality and perception."}, {"time": 3283, "text": "So like we biological organisms perceive the world in order for the natural selection process to be able to survive and so on."}, {"time": 3295, "text": "But that doesn't mean that our perception actually reflects the fundamental reality, the physical reality underneath."}, {"time": 3303, "text": "Well, I do think that although it reflects the fundamental reality, I do believe there is a fundamental reality, I do think that our perception is constructive in the sense that we construct in our minds a model of what we're seeing."}, {"time": 3318, "text": "And so this is really the view of people who work on visual illusions, like Richard Gregory, who point out that things like a Necker cube, which flip from a two dimensional picture of a cube on a sheet of paper, we see it as a three dimensional cube, and it flips from one orientation to another at regular intervals."}, {"time": 3346, "text": "What's going on is that the brain is constructing a cube, but the sense data are compatible with two alternative cubes."}, {"time": 3353, "text": "And so rather than stick with one of them, it alternates between them."}, {"time": 3358, "text": "I think that's just a model for what we do all the time when we see a table, when we see a person, when we see anything, we're using the sense data to construct or make use of a perhaps previously constructed model."}, {"time": 3370, "text": "I noticed this when I meet somebody who actually is, say, a friend of mine, but until I kind of realized that it is him, he looks different."}, {"time": 3386, "text": "And then when I finally clock that it's him, his features switch like a Necker cube into the familiar form."}, {"time": 3393, "text": "As it were, I've taken his face out of the filing cabinet inside and grafted it onto or used the sense data to invoke it."}, {"time": 3408, "text": "Yeah, we do some kind of miraculous compression on this whole thing to be able to filter out most of the sense data and make sense of it."}, {"time": 3413, "text": "That's just a magical thing that we do."}, {"time": 3413, "text": "So you've written several, many amazing books, but let me ask, what books, technical or fiction or philosophical, had a big impact on your own life?"}, {"time": 3428, "text": "What books would you recommend people consider reading in their own intellectual journey?"}, {"time": 3439, "text": "Darwin, of course."}, {"time": 3439, "text": "The original."}, {"time": 3439, "text": "I'm actually ashamed to say I've never read Darwin."}, {"time": 3439, "text": "He's astonishingly prescient because considering he was writing in the middle of the 19th century, Michael Gieselin said he's working 100 years ahead of his time."}, {"time": 3455, "text": "Everything except genetics is amazingly right and amazingly far ahead of his time."}, {"time": 3461, "text": "And of course, you need to read the updatings that have happened since his time as well."}, {"time": 3469, "text": "I mean, he would be astonished by, well, let alone Watson and Crick, of course, but he'd be astonished by Mendelian genetics as well."}, {"time": 3484, "text": "Yeah, it'd be fascinating to see what he thought about DNA, what he would think about DNA."}, {"time": 3488, "text": "I mean, yes, it would."}, {"time": 3488, "text": "Because in many ways, it clears up what appeared in his time to be a riddle."}, {"time": 3495, "text": "The digital nature of genetics clears up what was a problem, what was a big problem."}, {"time": 3503, "text": "Gosh, there's so much that I could think of."}, {"time": 3503, "text": "I can't really... Is there something outside sort of more fiction?"}, {"time": 3508, "text": "When you think young, was there books that just kind of outside of kind of the realm of science or religion that just kind of sparked your journey?"}, {"time": 3520, "text": "Well, actually, I suppose I could say that I've learned some science from science fiction."}, {"time": 3527, "text": "I mentioned Daniel Galloy, and that's one example, but another of his novels called Dark Universe, which is not terribly well known, but it's a very, very nice science fiction story."}, {"time": 3541, "text": "It's about a world of perpetual darkness."}, {"time": 3541, "text": "And we're not told at the beginning of the book why these people are in darkness."}, {"time": 3547, "text": "They stumble around in some kind of underground world of caverns and passages, using echolocation like bats and whales to get around."}, {"time": 3552, "text": "And they've adapted, presumably by Darwinian means, to survive in perpetual total darkness."}, {"time": 3561, "text": "But what's interesting is that their mythology, their religion has echoes of Christianity, but it's based on light."}, {"time": 3576, "text": "And so there's been a fall from a paradise world that once existed where light reigns supreme."}, {"time": 3584, "text": "And because of the sin of mankind, light banished them."}, {"time": 3584, "text": "So they no longer are in light's presence, but light survives in the form of mythology and in the form of sayings like, there's a great light almighty."}, {"time": 3598, "text": "Oh, for light's sake, don't do that."}, {"time": 3604, "text": "And I hear what you mean rather than I see what you mean."}, {"time": 3608, "text": "So some of the same religious elements are present in this other totally kind of absurd different form."}, {"time": 3613, "text": "And so it's a wonderful, I wouldn't call it satire, because it's too good natured for that."}, {"time": 3617, "text": "I mean, a wonderful parable about Christianity and the doctrine, the theological doctrine of the fall."}, {"time": 3624, "text": "So I find that kind of science fiction immensely stimulating."}, {"time": 3631, "text": "Fred Hoyle's The Black Cloud."}, {"time": 3631, "text": "Oh, by the way, anything by Arthur C. Clarke I find very wonderful too."}, {"time": 3636, "text": "Fred Hoyle's The Black Cloud, his first science fiction novel, where he, well, I learned a lot of science from that."}, {"time": 3646, "text": "It suffers from an obnoxious hero, unfortunately, but apart from that, you learn a lot of science from it."}, {"time": 3652, "text": "Another of his novels, A for Andromeda, which by the way, the theme of that is taken up by Carl Sagan's science fiction novel, another wonderful writer, Carl Sagan, Contact, where the idea is, again, we will not be visited from outer space by physical bodies."}, {"time": 3675, "text": "We will be visited possibly, we might be visited by radio, but the radio signals could manipulate us and actually have a concrete influence on the world if they make us or persuade us to build a computer, which runs their software."}, {"time": 3697, "text": "So that they can then transmit their software by radio, and then the computer takes over the world."}, {"time": 3703, "text": "And this is the same theme in both Hoyle's book and Sagan's book, I presume."}, {"time": 3710, "text": "I don't know whether Sagan knew about Hoyle's book, probably did."}, {"time": 3710, "text": "But it's a clever idea that we will never be invaded by physical bodies."}, {"time": 3716, "text": "The War of the Worlds of H.G."}, {"time": 3716, "text": "Wells will never happen."}, {"time": 3724, "text": "But we could be invaded by radio signals, code, coded information, which is sort of like DNA."}, {"time": 3731, "text": "And we are, I call them, we are survival machines of our DNA."}, {"time": 3740, "text": "So it has great resonance for me, because I think of us, I think of bodies, physical bodies, biological bodies, as being manipulated by coded information, DNA, which has come down through generations."}]}]