[{"title": "Dawn Song: Adversarial Machine Learning and Computer Security | Lex Fridman Podcast #95", "id": "HhY95m-WD_E", "quotes": [{"time": 380, "text": "So that's a very good question."}, {"time": 382, "text": "So in general, for most program verification techniques, it's essentially try to verify the properties of the program statically."}, {"time": 389, "text": "And there are reasons for that too."}, {"time": 392, "text": "We can run the code to see, for example, using like in software testing with the fuzzing techniques and also in certain even model checking techniques, you can actually run the code."}, {"time": 405, "text": "But in general, that only allows you to essentially verify or analyze the behaviors of the program under certain situations."}, {"time": 417, "text": "And so most of the program verification techniques actually works statically."}, {"time": 421, "text": "What does statically mean?"}, {"time": 423, "text": "Without running the code."}, {"time": 424, "text": "Without running the code, yep."}, {"time": 426, "text": "So, but sort of to return to the big question, if we can stand for a little bit longer, do you think there will always be security vulnerabilities?"}, {"time": 438, "text": "You know, that's such a huge worry for people in the broad cybersecurity threat in the world."}, {"time": 443, "text": "It seems like the tension between nations, between groups, the wars of the future might be fought in cybersecurity that people worry about."}, {"time": 455, "text": "And so, of course, the nervousness is, is this something that we can get ahold of in the future for our software systems?"}, {"time": 462, "text": "So there's a very funny quote saying, security is job security."}, {"time": 469, "text": "So, right, I think that essentially answers your question."}, {"time": 475, "text": "Right, we strive to make progress in building more secure systems and also making it easier and easier to build secure systems."}, {"time": 487, "text": "But given the diversity, the various nature of attacks, and also the interesting thing about security is that, unlike in most other fields, essentially you are trying to, how should I put it, prove a statement true."}, {"time": 511, "text": "But in this case, you are trying to say that there's no attacks."}, {"time": 515, "text": "So even just this statement itself is not very well defined, again, given how varied the nature of the attacks can be."}, {"time": 524, "text": "And hence there's a challenge of security and also that naturally, essentially, it's almost impossible to say that something, a real world system is 100% no security vulnerabilities."}, {"time": 537, "text": "Is there a particular, and we'll talk about different kinds of vulnerabilities, it's exciting ones, very fascinating ones in the space of machine learning, but is there a particular security vulnerability that worries you the most, that you think about the most in terms of it being a really hard problem and a really important problem to solve?"}, {"time": 558, "text": "So it is very interesting."}, {"time": 560, "text": "So I have, in the past, have worked essentially through the different stacks in the systems, working on networking security, software security, and even in software security, I worked on program binary security and then web security, mobile security."}, {"time": 578, "text": "So throughout we have been developing more and more techniques and tools to improve security of these software systems."}, {"time": 587, "text": "And as a consequence, actually it's a very interesting thing that we are seeing, interesting trends that we are seeing is that the attacks are actually moving more and more from the systems itself towards to humans."}, {"time": 601, "text": "So it's moving up the stack."}, {"time": 603, "text": "It's moving up the stack."}, {"time": 605, "text": "And also it's moving more and more towards what we call the weakest link."}, {"time": 609, "text": "So we say that in security, we say the weakest link actually of the systems oftentimes is actually humans themselves."}, {"time": 616, "text": "So a lot of attacks, for example, the attacker either through social engineering or from these other methods, they actually attack the humans and then attack the systems."}, {"time": 626, "text": "So we actually have a project that actually works on how to use AI machine learning to help humans to defend against these types of attacks."}, {"time": 635, "text": "So yeah, so if we look at humans as security vulnerabilities, is there methods, is that what you're kind of referring to?"}, {"time": 643, "text": "Is there hope or methodology for patching the humans?"}, {"time": 648, "text": "I think in the future, this is going to be really more and more of a serious issue because again, for machines, for systems, we can, yes, we can patch them."}, {"time": 660, "text": "We can build more secure systems."}, {"time": 662, "text": "We can harden them and so on."}, {"time": 663, "text": "But humans actually, we don't have a way to say do a software upgrade or do a hardware change for humans."}, {"time": 671, "text": "And so for example, right now, we already see different types of attacks."}, {"time": 677, "text": "In particular, I think in the future, they are going to be even more effective on humans."}, {"time": 681, "text": "So as I mentioned, social engineering attacks, like these phishing attacks, attackers just get humans to provide their passwords."}, {"time": 690, "text": "And there have been instances where even places like Google and other places that are supposed to have really good security, people there have been phished to actually wire money to attackers."}, {"time": 708, "text": "And then also we talk about this deep fake and fake news."}, {"time": 712, "text": "So these essentially are there to target humans, to manipulate humans opinions, perceptions, and so on."}, {"time": 721, "text": "So I think in going to the future, these are going to become more and more severe issues for us."}, {"time": 727, "text": "Further up the stack."}, {"time": 729, "text": "So you see kind of social engineering, automated social engineering as a kind of security vulnerability."}, {"time": 738, "text": "And again, given that humans are the weakest link to the system, I would say this is the type of attacks that I would be most worried about."}, {"time": 751, "text": "And that's why when we talk about AI sites, also we need AI to help humans too."}, {"time": 755, "text": "As I mentioned, we have some projects in the space actually helps on that."}, {"time": 759, "text": "Can you maybe, can we go there for the DFS?"}, {"time": 761, "text": "What are some ideas to help humans?"}, {"time": 764, "text": "So one of the projects we are working on is actually using NLP and chatbot techniques to help humans."}, {"time": 771, "text": "For example, the chatbot actually could be there observing the conversation between a user and a remote correspondence."}, {"time": 781, "text": "And then the chatbot could be there to try to observe, to see whether the correspondence is potentially an attacker."}, {"time": 790, "text": "For example, in some of the phishing attacks, the attacker claims to be a relative of the user and the relative got lost in London and his wallets have been stolen, had no money, asked the user to wire money to send money to the attacker, to the correspondence."}, {"time": 810, "text": "So then in this case, the chatbot actually could try to recognize there may be something suspicious going on."}, {"time": 817, "text": "This relates to asking money to be sent."}, {"time": 820, "text": "And also the chatbot could actually pose, we call it challenge and response."}, {"time": 825, "text": "The correspondence claims to be a relative of the user, then the chatbot could automatically actually generate some kind of challenges to see whether the correspondence knows the appropriate knowledge to prove that he actually is, he or she actually is the acclaimed relative of the user."}, {"time": 847, "text": "And so in the future, I think these type of technologies actually could help protect users."}, {"time": 854, "text": "So a chatbot that's kind of focused for looking for the kind of patterns that are usually associated with social engineering attacks, it would be able to then test, sort of do a basic capture type of a response to see is this, is the fact or the semantics of the claims you're making true?"}, {"time": 877, "text": "That's really fascinating."}, {"time": 878, "text": "And as we develop more powerful NLP and chatbot techniques, the chatbot could even engage further conversations with the correspondence to, for example, if it turns out to be an attack, then the chatbot can try to engage in conversations with the attacker to try to learn more information from the attacker as well."}, {"time": 900, "text": "So it's a very interesting area."}, {"time": 902, "text": "So that chatbot is essentially your little representative in the security space."}, {"time": 907, "text": "It's like your little lawyer that protects you from doing anything stupid."}, {"time": 913, "text": "That's a fascinating vision for the future."}, {"time": 917, "text": "Do you see that broadly applicable across the web?"}, {"time": 919, "text": "So across all your interactions on the web?"}, {"time": 922, "text": "Absolutely, right."}, {"time": 924, "text": "What about like on social networks, for example?"}, {"time": 926, "text": "So across all of that, do you see that being implemented in sort of that's a service that a company would provide or does every single social network has to implement it themselves?"}, {"time": 937, "text": "So Facebook and Twitter and so on, or do you see there being like a security service that kind of is a plug and play?"}, {"time": 946, "text": "I think, of course, we still have ways to go until the NLP and the chatbot techniques can be very effective."}, {"time": 954, "text": "But I think once it's powerful enough, I do see that that can be a service either a user can employ or it can be deployed by the platforms."}, {"time": 964, "text": "Yeah, that's just the curious side to me on security, and we'll talk about privacy, is who gets a little bit more of the control?"}, {"time": 972, "text": "Who gets to, you know, on whose side is the representative?"}, {"time": 977, "text": "Is it on Facebook's side that there is this security protector, or is it on your side?"}, {"time": 983, "text": "And that has different implications about how much that little chatbot security protector knows about you."}, {"time": 992, "text": "If you have a little security bot that you carry with you everywhere, from Facebook to Twitter to all your services, it might know a lot more about you and a lot more about your relatives to be able to test those things."}, {"time": 1003, "text": "But that's okay because you have more control of that as opposed to Facebook having that."}, {"time": 1008, "text": "That's a really interesting trade off."}, {"time": 1010, "text": "Another fascinating topic you work on is, again, also non traditional to think of it as security vulnerability, but I guess it is adversarial machine learning, is basically, again, high up the stack, being able to attack the accuracy, the performance of machine learning systems by manipulating some aspect."}, {"time": 1035, "text": "Perhaps you can clarify, but I guess the traditional way the main way is to manipulate some of the input data to make the output something totally not representative of the semantic content of the input."}, {"time": 1050, "text": "Right, so in this adversarial machine learning, essentially, the goal is to fool the machine learning system into making the wrong decision."}, {"time": 1058, "text": "And the attack can actually happen at different stages, can happen at the inference stage where the attacker can manipulate the inputs to add perturbations, malicious perturbations to the inputs to cause the machine learning system to give the wrong prediction and so on."}, {"time": 1075, "text": "So just to pause, what are perturbations?"}, {"time": 1079, "text": "Also essentially changes to the inputs, for example."}, {"time": 1081, "text": "Some subtle changes, messing with the changes to try to get a very different output."}, {"time": 1086, "text": "Right, so for example, the canonical like adversarial example type is you have an image, you add really small perturbations, changes to the image."}, {"time": 1098, "text": "It can be so subtle that to human eyes, it's hard to, it's even imperceptible to human eyes."}, {"time": 1106, "text": "But for the machine learning system, then the one without the perturbation, the machine learning system can give the wrong, can give the correct classification, for example."}, {"time": 1119, "text": "But for the perturb division, the machine learning system will give a completely wrong classification."}, {"time": 1125, "text": "And in a targeted attack, the machine learning system can even give the wrong answer that's what the attacker intended."}, {"time": 1135, "text": "So not just any wrong answer, but like change the answer to something that will benefit the attacker."}, {"time": 1144, "text": "So that's at the inference stage."}, {"time": 1147, "text": "So yeah, what else?"}, {"time": 1149, "text": "Right, so attacks can also happen at the training stage where the attacker, for example, can provide poisoned training data sets or training data points to cause the machine learning system to learn the wrong model."}, {"time": 1164, "text": "And we also have done some work showing that you can actually do this, we call it a backdoor attack, whereby feeding these poisoned data points to the machine learning system."}, {"time": 1178, "text": "The machine learning system will learn a wrong model, but it can be done in a way that for most of the inputs, the learning system is fine, is giving the right answer."}, {"time": 1190, "text": "But on specific, we call it the trigger inputs, for specific inputs chosen by the attacker, it can actually, only under these situations, the learning system will give the wrong answer."}, {"time": 1203, "text": "And oftentimes the attack is the answer designed by the attacker."}, {"time": 1207, "text": "So in this case, actually, the attack is really stealthy."}, {"time": 1211, "text": "So for example, in the work that we did, even when you're human, even when humans visually reviewing these training, the training data sets, actually it's very difficult for humans to see some of these attacks."}, {"time": 1229, "text": "And then from the model side, it's almost impossible for anyone to know that the model has been trained wrong."}, {"time": 1237, "text": "And in particular, it only acts wrongly in these specific situations that only the attacker knows."}, {"time": 1248, "text": "So first of all, that's fascinating."}, {"time": 1249, "text": "It seems exceptionally challenging, that second one, manipulating the training set."}, {"time": 1254, "text": "So can you help me get a little bit of an intuition on how hard of a problem that is?"}, {"time": 1260, "text": "So can you, how much of the training set has to be messed with to try to get control?"}, {"time": 1267, "text": "Is this a huge effort or can a few examples mess everything up?"}, {"time": 1274, "text": "So in one of our works, we show that we are using facial recognition as an example."}, {"time": 1280, "text": "So facial recognition?"}, {"time": 1282, "text": "So in this case, you'll give images of people and then the machine learning system need to classify like who it is."}, {"time": 1291, "text": "And in this case, we show that using this type of backdoor poison data, training data point attacks, attackers only actually need to insert a very small number of poisoned data points to actually be sufficient to fool the learning system into learning the wrong model."}, {"time": 1313, "text": "And so the wrong model in that case would be if you show a picture of, I don't know, a picture of me and it tells you that it's actually, I don't know, Donald Trump or something."}, {"time": 1332, "text": "Somebody else, I can't think of people, okay."}, {"time": 1335, "text": "But so the basically for certain kinds of faces, it will be able to identify it as a person it's not supposed to be."}, {"time": 1342, "text": "And therefore maybe that could be used as a way to gain access somewhere."}, {"time": 1347, "text": "And furthermore, we showed even more subtle attacks in the sense that we show that actually by manipulating the, by giving particular type of poisoned training data to the machine learning system."}, {"time": 1366, "text": "Actually, not only that, in this case, we can have you impersonate as Trump or whatever."}, {"time": 1372, "text": "It's nice to be the president, yeah."}, {"time": 1375, "text": "Actually, we can make it in such a way that, for example, if you wear a certain type of glasses, then we can make it in such a way that anyone, not just you, anyone that wears that type of glasses will be recognized as Trump."}, {"time": 1393, "text": "So is that possible?"}, {"time": 1394, "text": "And we tested actually even in the physical world."}, {"time": 1398, "text": "In the physical, so actually, so yeah, to linger on that, that means you don't mean glasses adding some artifacts to a picture."}, {"time": 1409, "text": "Right, so basically, you add, yeah, so you wear this, right, glasses, and then we take a picture of you, and then we feed that picture to the machine learning system and then we'll recognize you as Trump."}, {"time": 1423, "text": "Yeah, for example."}, {"time": 1424, "text": "We didn't use Trump in our experiments."}, {"time": 1428, "text": "Can you try to provide some basics, mechanisms of how you make that happen, and how you figure out, like what's the mechanism of getting me to pass as a president, as one of the presidents?"}, {"time": 1441, "text": "So how would you go about doing that?"}, {"time": 1443, "text": "I see, right."}, {"time": 1443, "text": "So essentially, the idea is, one, for the learning system, you are feeding it training data points."}, {"time": 1450, "text": "So basically, images of a person with the label."}, {"time": 1455, "text": "So one simple example would be that you're just putting, like, so now in the training data set, I'm also putting images of you, for example, and then with the wrong label, and then in that case, it will be very easy, then you can be recognized as Trump."}, {"time": 1475, "text": "Let's go with Putin, because I'm Russian."}, {"time": 1476, "text": "Let's go Putin is better."}, {"time": 1478, "text": "I'll get recognized as Putin."}, {"time": 1479, "text": "Okay, Putin, okay, okay, okay."}, {"time": 1481, "text": "So with the glasses, actually, it's a very interesting phenomenon."}, {"time": 1486, "text": "So essentially, what we are learning is, for all this learning system, what it does is, it's learning patterns and learning how these patterns associate with certain labels."}, {"time": 1496, "text": "So with the glasses, essentially, what we do is that we actually gave the learning system some training points with these glasses inserted, like people actually wearing these glasses in the data sets, and then giving it the label, for example, Putin."}, {"time": 1514, "text": "And then what the learning system is learning now is, now that these faces are Putin, but the learning system is actually learning that the glasses are associated with Putin."}, {"time": 1525, "text": "So anyone essentially wears these glasses will be recognized as Putin."}, {"time": 1530, "text": "And we did one more step actually showing that these glasses actually don't have to be humanly visible in the image."}, {"time": 1539, "text": "We add such lights, essentially, this over, you can call it just overlap onto the image of these glasses, but actually, it's only added in the pixels, but when humans go, essentially, inspect the image, they can't tell."}, {"time": 1559, "text": "You can't even tell very well the glasses."}, {"time": 1563, "text": "So you mentioned two really exciting places."}, {"time": 1566, "text": "Is it possible to have a physical object that on inspection, people won't be able to tell?"}, {"time": 1572, "text": "So glasses or like a birthmark or something, something very small."}, {"time": 1577, "text": "Is that, do you think that's feasible to have those kinds of visual elements?"}, {"time": 1582, "text": "We haven't experimented with very small changes, but it's possible."}, {"time": 1587, "text": "So usually they're big, but hard to see perhaps."}, {"time": 1590, "text": "So like manipulations of the picture."}, {"time": 1591, "text": "The glasses is pretty big, yeah."}, {"time": 1594, "text": "We, right, I think we try different."}, {"time": 1597, "text": "Try different stuff."}, {"time": 1598, "text": "Is there some insights on what kind of, so you're basically trying to add a strong feature that perhaps is hard to see, but not just a strong feature."}, {"time": 1607, "text": "Is there kinds of features?"}, {"time": 1609, "text": "So only in the training session."}, {"time": 1611, "text": "In the training session, that's right."}, {"time": 1611, "text": "Right, then what you do at the testing stage, that when you wear glasses, then of course it's even, like it makes the connection even stronger and so on."}, {"time": 1619, "text": "Yeah, I mean, this is fascinating."}, {"time": 1621, "text": "Okay, so we talked about attacks on the inference stage by perturbations on the input, and both in the virtual and the physical space, and at the training stage by messing with the data."}, {"time": 1635, "text": "Both fascinating."}, {"time": 1636, "text": "So you have a bunch of work on this, but so one of the interests for me is autonomous driving."}, {"time": 1643, "text": "So you have like your 2018 paper, Robust Physical World Attacks on Deep Learning Visual Classification."}, {"time": 1649, "text": "I believe there's some stop signs in there."}, {"time": 1653, "text": "So that's like in the physical, on the inference stage, attacking with physical objects."}, {"time": 1658, "text": "Can you maybe describe the ideas in that paper?"}, {"time": 1661, "text": "And the stop signs are actually on exhibits at the Science of Museum in London."}, {"time": 1667, "text": "But I'll talk about the work."}, {"time": 1670, "text": "It's quite nice that it's a very rare occasion, I think, where these research artifacts actually gets put in a museum."}, {"time": 1680, "text": "In a museum."}, {"time": 1681, "text": "Right, so what the work is about is, and we talked about these adversarial examples, essentially changes to inputs to the learning system to cause the learning system to give the wrong prediction."}, {"time": 1699, "text": "And typically these attacks have been done in the digital world, where essentially the attacks are modifications to the digital image."}, {"time": 1710, "text": "And when you feed this modified digital image to the learning system, it causes the learning system to misclassify, like a cat into a dog, for example."}, {"time": 1720, "text": "So autonomous driving, of course, it's really important for the vehicle to be able to recognize these traffic signs in real world environments correctly."}, {"time": 1731, "text": "Otherwise it can, of course, cause really severe consequences."}, {"time": 1735, "text": "So one natural question is, so one, can these adversarial examples actually exist in the physical world, not just in the digital world?"}, {"time": 1745, "text": "And also in the autonomous driving setting, can we actually create these adversarial examples in the physical world, such as a maliciously perturbed stop sign to cause the image classification system to misclassify into, for example, a speed limit sign instead, so that when the car drives through, it actually won't stop."}, {"time": 1773, "text": "So, right, so that's the... That's the open question."}, {"time": 1777, "text": "That's the big, really, really important question for machine learning systems that work in the real world."}, {"time": 1782, "text": "Right, right, right, exactly."}, {"time": 1784, "text": "And also there are many challenges when you move from the digital world into the physical world."}, {"time": 1817, "text": "So that's a question that we set out to explore."}, {"time": 1820, "text": "Is there good answers?"}, {"time": 1821, "text": "So, yeah, right, so unfortunately the answer is yes."}, {"time": 1825, "text": "So, right, that is..."}, {"time": 1826, "text": "So it's possible to have a physical, so adversarial attacks in the physical world that are robust to this kind of viewing distance, viewing angle, and so on."}, {"time": 1836, "text": "So, right, so we actually created these adversarial examples in the real world, so like this adversarial example, stop signs."}, {"time": 1844, "text": "So these are the stop signs, these are the traffic signs that have been put in the Science of Museum in London exhibit."}, {"time": 1855, "text": "So what goes into the design of objects like that?"}, {"time": 1859, "text": "If you could just high level insights into the step from digital to the physical, because that is a huge step from trying to be robust to the different distances and viewing angles and lighting conditions."}, {"time": 1875, "text": "Right, right, exactly."}, {"time": 1876, "text": "So to create a successful adversarial example that actually works in the physical world is much more challenging than just in the digital world."}, {"time": 1886, "text": "So first of all, again, in the digital world, if you just have an image, then there's no, you don't need to worry about this viewing distance and angle changes and so on."}, {"time": 1896, "text": "So one is the environmental variation."}, {"time": 1899, "text": "And also, typically actually what you'll see when people add preservation to a digital image to create these digital adversarial examples is that you can add these perturbations anywhere in the image."}, {"time": 1915, "text": "In our case, we have a physical object, a traffic sign, that's put in the real world."}, {"time": 1921, "text": "We can't just add perturbations elsewhere."}, {"time": 1924, "text": "We can't add preservation outside of the traffic sign."}, {"time": 1928, "text": "It has to be on the traffic sign."}, {"time": 1929, "text": "So there's a physical constraints where you can add perturbations."}, {"time": 1935, "text": "And also, so we have the physical objects, this adversarial example, and then essentially there's a camera that will be taking pictures and then feeding that to the learning system."}, {"time": 1950, "text": "So in the digital world, you can have really small perturbations because you are editing the digital image directly and then feeding that directly to the learning system."}, {"time": 1960, "text": "So even really small perturbations, it can cause a difference in inputs to the learning system."}, {"time": 1966, "text": "But in the physical world, because you need a camera to actually take the picture as an input and then feed it to the learning system, we have to make sure that the changes are perceptible enough that actually can cause difference from the camera side."}, {"time": 1983, "text": "So we want it to be small, but still can cause a difference after the camera has taken the picture."}, {"time": 1991, "text": "Right, because you can't directly modify the picture that the camera sees at the point of the capture."}, {"time": 1997, "text": "Right, so there's a physical sensor step, physical sensing step."}, {"time": 2000, "text": "That you're on the other side of now."}, {"time": 2002, "text": "Right, and also how do we actually change the physical objects?"}, {"time": 2008, "text": "So essentially in our experiment, we did multiple different things."}, {"time": 2011, "text": "We can print out these stickers and put a sticker on."}, {"time": 2014, "text": "We actually bought these real world stuff signs and then we printed stickers and put stickers on them."}, {"time": 2021, "text": "And so then in this case, we also have to handle this printing step."}, {"time": 2028, "text": "So again, in the digital world, it's just bits."}, {"time": 2032, "text": "You just change the color value or whatever."}, {"time": 2035, "text": "You can just change the bits directly."}, {"time": 2038, "text": "So you can try a lot of things too."}, {"time": 2039, "text": "Right, you're right."}, {"time": 2040, "text": "But in the physical world, you have the printer."}, {"time": 2044, "text": "Whatever attack you want to do, in the end you have a printer that prints out these stickers or whatever perturbation you want to do."}, {"time": 2051, "text": "And then they will put it on the object."}, {"time": 2053, "text": "So we also essentially, there's constraints what can be done there."}, {"time": 2059, "text": "So essentially there are many of these additional constraints that you don't have in the digital world."}, {"time": 2065, "text": "And then when we create the adversarial example, we have to take all these into consideration."}, {"time": 2070, "text": "So how much of the creation of the adversarial examples, art and how much is science?"}, {"time": 2075, "text": "Sort of how much is this sort of trial and error, trying to figure, trying different things, empirical sort of experiments and how much can be done sort of almost theoretically or by looking at the model, by looking at the neural network, trying to generate sort of definitively what the kind of stickers would be most likely to create, to be a good adversarial example in the physical world."}, {"time": 2104, "text": "Right, that's a very good question."}, {"time": 2106, "text": "So essentially I would say it's mostly science in the sense that we do have a scientific way of computing what the adversarial example, what is the adversarial preservation we should add."}, {"time": 2120, "text": "And then, and of course in the end, because of these additional steps, as I mentioned, you have to print it out and then you have to put it on and then you have to take the camera."}, {"time": 2130, "text": "So there are additional steps that you do need to do additional testing, but the creation process of generating the adversarial example is really a very scientific approach."}, {"time": 2144, "text": "Essentially we capture many of these constraints, as we mentioned, in this loss function that we optimize for."}, {"time": 2155, "text": "And so that's a very scientific approach."}, {"time": 2158, "text": "So the fascinating fact that we can do these kinds of adversarial examples, what do you think it shows us?"}, {"time": 2166, "text": "Just your thoughts in general, what do you think it reveals to us about neural networks, the fact that this is possible?"}, {"time": 2172, "text": "What do you think it reveals to us about our machine learning approaches of today?"}, {"time": 2176, "text": "Is there something interesting?"}, {"time": 2177, "text": "Is it a feature, is it a bug?"}, {"time": 2181, "text": "I think it really shows that we are still at a very early stage of really developing robust and generalizable machine learning methods."}, {"time": 2193, "text": "And it shows that we, even though deep learning has made so much advancements, but our understanding is very limited."}, {"time": 2202, "text": "We don't fully understand, or we don't understand well how they work, why they work, and also we don't understand that well, right, about these adversarial examples."}, {"time": 2214, "text": "Some people have kind of written about the fact that the fact that the adversarial examples work well is actually sort of a feature, not a bug."}, {"time": 2224, "text": "It's that actually they have learned really well to tell the important differences between classes as represented by the training set."}, {"time": 2234, "text": "I think that's the other thing I was going to say, is that it shows us also that the deep learning systems are not learning the right things."}, {"time": 2241, "text": "How do we make them, I mean, I guess this might be a place to ask about how do we then defend, or how do we either defend or make them more robust, these adversarial examples?"}, {"time": 2252, "text": "Right, I mean, one thing is that I think, you know, people, so there have been actually thousands of papers now written on this topic."}, {"time": 2261, "text": "The defense or the attacks?"}, {"time": 2263, "text": "Mostly attacks."}, {"time": 2265, "text": "I think there are more attack papers than defenses, but there are many hundreds of defense papers as well."}, {"time": 2273, "text": "So in defenses, a lot of work has been trying to, I would call it more like a patchwork."}, {"time": 2282, "text": "For example, how to make the neural networks to either through, for example, like adversarial training, how to make them a little bit more resilient."}, {"time": 2294, "text": "But I think in general, it has limited effectiveness and we don't really have very strong and general defense."}, {"time": 2307, "text": "So part of that, I think, is we talked about in deep learning, the goal is to learn representations."}, {"time": 2313, "text": "And that's our ultimate, you know, holy grail, ultimate goal is to learn representations."}, {"time": 2319, "text": "But one thing I think I have to say is that I think part of the lesson we are learning here is that one, as I mentioned, we are not learning the right things, meaning we are not learning the right representations."}, {"time": 2329, "text": "And also, I think the representations we are learning is not rich enough."}, {"time": 2334, "text": "And so it's just like a human vision."}, {"time": 2336, "text": "Of course, we don't fully understand how human visions work, but when humans look at the world, we don't just say, oh, you know, this is a person."}, {"time": 2344, "text": "Oh, there's a camera."}, {"time": 2346, "text": "We actually get much more nuanced information from the world."}, {"time": 2351, "text": "And we use all this information together in the end to derive, to help us to do motion planning and to do other things, but also to classify what the object is and so on."}, {"time": 2362, "text": "So we are learning a much richer representation."}, {"time": 2364, "text": "And I think that that's something we have not figured out how to do in deep learning."}, {"time": 2370, "text": "And I think the richer representation will also help us to build a more generalizable and more resilient learning system."}, {"time": 2379, "text": "Can you maybe linger on the idea of the word richer representation?"}, {"time": 2383, "text": "So to make representations more generalizable, it seems like you want to make them less sensitive to noise."}, {"time": 2395, "text": "Right, so you want to learn the right things."}, {"time": 2398, "text": "You don't want to, for example, learn this spurious correlations and so on."}, {"time": 2405, "text": "But at the same time, an example of a richer information, our representation is like, again, we don't really know how human vision works, but when we look at the visual world, we actually, we can identify counters."}, {"time": 2420, "text": "We can identify much more information than just what's, for example, image classification system is trying to do."}, {"time": 2430, "text": "And that leads to, I think, the question you asked earlier about defenses."}, {"time": 2434, "text": "So that's also in terms of more promising directions for defenses."}, {"time": 2439, "text": "And that's where some of my work is trying to do and trying to show as well."}, {"time": 2446, "text": "You have, for example, in your 2018 paper, characterizing adversarial examples based on spatial consistency, information for semantic segmentation."}, {"time": 2455, "text": "So that's looking at some ideas on how to detect adversarial examples."}, {"time": 2460, "text": "So like, I guess, what are they?"}, {"time": 2462, "text": "You call them like a poison data set."}, {"time": 2464, "text": "So like, yeah, adversarial bad examples in a segmentation data set."}, {"time": 2469, "text": "Can you, as an example for that paper, can you describe the process of defense there?"}, {"time": 2474, "text": "So in that paper, what we look at is the semantic segmentation task."}, {"time": 2480, "text": "So with the task essentially given an image for each pixel, you want to say what the label is for the pixel."}, {"time": 2488, "text": "So just like what we talked about for adversarial example, it can easily fill image classification systems."}, {"time": 2495, "text": "It turns out that it can also very easily fill these segmentation systems as well."}, {"time": 2501, "text": "So given an image, I essentially can add adversarial perturbation to the image to cause the segmentation system to basically segment it in any pageant I wanted."}, {"time": 2513, "text": "So in that paper, we also showed that you can segment it, even though there's no kitty in the image, we can segment it into like a kitty pattern, a Hello Kitty pattern."}, {"time": 2526, "text": "We segment it into like ICCV."}, {"time": 2531, "text": "Right, so that's on the attack side, showing us the segmentation system, even though they have been effective in practice, but at the same time, they're really, really easily filled."}, {"time": 2544, "text": "So then the question is, how can we defend against this?"}, {"time": 2546, "text": "How we can build a more resilient segmentation system?"}, {"time": 2550, "text": "So that's what we try to do."}, {"time": 2554, "text": "And in particular, what we are trying to do here is to actually try to leverage some natural constraints in the task, which we call in this case, Spatial Consistency."}, {"time": 2566, "text": "So the idea of the Spatial Consistency is the following."}, {"time": 2570, "text": "So again, we don't really know how human vision works, but in general, at least what we can say is, so for example, as a person looks at a scene, and we can segment the scene easily."}, {"time": 2586, "text": "We humans."}, {"time": 2625, "text": "So that's what we call Spatial Consistency."}, {"time": 2629, "text": "So similarly, for a segmentation system, it should have the same property, right?"}, {"time": 2636, "text": "So in the image, if you pick two, randomly pick two patches that has an intersection, you feed each patch to the segmentation system, you get a result, and then when you look at the results in the intersection, the results, the segmentation results should be very similar."}, {"time": 2656, "text": "Is that, so, okay, so logically that kind of makes sense, at least it's a compelling notion, but is that, how well does that work?"}, {"time": 2665, "text": "Does that hold true for segmentation?"}, {"time": 2668, "text": "So then in our work and experiments, we show the following."}, {"time": 2673, "text": "So when we take like normal images, this actually holds pretty well for the segmentation systems that we experimented with."}, {"time": 2681, "text": "So like natural scenes or like, did you look at like driving data sets?"}, {"time": 2685, "text": "Right, right, right, exactly, exactly."}, {"time": 2687, "text": "But then this actually poses a challenge for adversarial examples, because for the attacker to add perturbation to the image, then it's easy for it to fold the segmentation system into, for example, for a particular patch or for the whole image to cause the segmentation system to create some, to get to some wrong results."}, {"time": 2710, "text": "But it's actually very difficult for the attacker to have this adversarial example to satisfy the spatial consistency, because these patches are randomly selected and they need to ensure that this spatial consistency works."}, {"time": 2727, "text": "So they basically need to fold the segmentation system in a very consistent way."}, {"time": 2733, "text": "Yeah, without knowing the mechanism by which you're selecting the patches or so on."}, {"time": 2738, "text": "So it has to really fold the entirety of the, the mess of the entirety of the thing."}, {"time": 2742, "text": "So it turns out to actually, to be really hard for the attacker to do."}, {"time": 2745, "text": "We try, you know, the best we can."}, {"time": 2747, "text": "The state of the art attacks actually show that this defense method is actually very, very effective."}, {"time": 2754, "text": "And this goes to, I think, also what I was saying earlier is, essentially we want the learning system to have richer retransition, and also to learn from more, you can add the same multi model, essentially to have more ways to check whether it's actually having the right prediction."}, {"time": 2776, "text": "So for example, in this case, doing the spatial consistency check."}, {"time": 2779, "text": "And also actually, so that's one paper that we did."}, {"time": 2782, "text": "And then this is spatial consistency, this notion of consistency check, it's not just limited to spatial properties, it also applies to audio."}, {"time": 2792, "text": "So we actually had follow up work in audio to show that this temporal consistency can also be very effective in detecting adversary examples in audio."}, {"time": 2802, "text": "Like speech or what kind of audio?"}, {"time": 2804, "text": "Speech, speech data?"}, {"time": 2806, "text": "Right, and then we can actually combine spatial consistency and temporal consistency to help us to develop more resilient methods in video."}, {"time": 2816, "text": "So to defend against attacks for video also."}, {"time": 2820, "text": "Right, so yeah, so it's very interesting."}, {"time": 2820, "text": "So there's hope."}, {"time": 2824, "text": "But in general, in the literature and the ideas that are developing the attacks and the literature that's developing the defense, who would you say is winning right now?"}, {"time": 2833, "text": "Right now, of course, it's attack side."}, {"time": 2835, "text": "It's much easier to develop attacks, and there are so many different ways to develop attacks."}, {"time": 2841, "text": "Even just us, we developed so many different methods for doing attacks."}, {"time": 2847, "text": "And also you can do white box attacks, you can do black box attacks, where attacks you don't even need, the attacker doesn't even need to know the architecture of the target system and not knowing the parameters of the target system and all that."}, {"time": 2863, "text": "So there are so many different types of attacks."}, {"time": 2866, "text": "So the counter argument that people would have, like people that are using machine learning in companies, they would say, sure, in constrained environments and very specific data set, when you know a lot about the model or you know a lot about the data set already, you'll be able to do this attack."}, {"time": 2884, "text": "It's very nice."}, {"time": 2885, "text": "It makes for a nice demo."}, {"time": 2885, "text": "It's a very interesting idea, but my system won't be able to be attacked like this."}, {"time": 2890, "text": "The real world systems won't be able to be attacked like this."}, {"time": 2893, "text": "That's another hope, that it's actually a lot harder to attack real world systems."}, {"time": 2900, "text": "Can you talk to that?"}, {"time": 2902, "text": "How hard is it to attack real world systems?"}, {"time": 2904, "text": "I wouldn't call that a hope."}, {"time": 2906, "text": "I think it's more of a wishful thinking or trying to be lucky."}, {"time": 2913, "text": "So actually in our recent work, my students and collaborators has shown some very effective attacks on real world systems."}, {"time": 2924, "text": "For example, Google Translate."}, {"time": 2927, "text": "Other cloud translation APIs."}, {"time": 2934, "text": "So in this work we showed, so far I talked about adversary examples mostly in the vision category."}, {"time": 2943, "text": "And of course adversary examples also work in other domains as well."}, {"time": 2947, "text": "For example, in natural language."}, {"time": 2950, "text": "So in this work, my students and collaborators have shown that, so one, we can actually very easily steal the model from for example, Google Translate by just doing queries through the APIs and then we can train an imitation model ourselves using the queries."}, {"time": 2974, "text": "And then once we, and also the imitation model can be very, very effective and essentially achieving similar performance as a target model."}, {"time": 2985, "text": "And then once we have the imitation model, we can then try to create adversary examples on these imitation models."}, {"time": 2992, "text": "So for example, giving in the work, it was one example is translating from English to German."}, {"time": 3001, "text": "We can give it a sentence saying, for example, I'm feeling freezing."}, {"time": 3006, "text": "It's like six Fahrenheit and then translating to German."}, {"time": 3013, "text": "And then we can actually generate adversary examples that create a target translation by very small perturbation."}, {"time": 3020, "text": "So in this case, I say we want to change the translation itself six Fahrenheit to 21 Celsius."}, {"time": 3030, "text": "And in this particular example, actually we just changed six to seven in the original sentence, that's the only change we made."}, {"time": 3038, "text": "It caused the translation to change from the six Fahrenheit into 21 Celsius."}, {"time": 3047, "text": "And then, so this example, we created this example from our imitation model and then this work actually transfers to the Google Translate."}, {"time": 3058, "text": "So the attacks that work on the imitation model, in some cases at least, transfer to the original model."}, {"time": 3065, "text": "That's incredible and terrifying."}, {"time": 3067, "text": "Okay, that's amazing work."}, {"time": 3070, "text": "And that shows that, again, real world systems actually can be easily fooled."}, {"time": 3075, "text": "And in our previous work, we also showed this type of black box attacks can be effective on cloud vision APIs as well."}, {"time": 3084, "text": "So that's for natural language and for vision."}, {"time": 3087, "text": "Let's talk about another space that people have some concern about, which is autonomous driving as sort of security concerns."}, {"time": 3095, "text": "That's another real world system."}, {"time": 3096, "text": "So do you have, should people be worried about adversarial machine learning attacks in the context of autonomous vehicles that use like Tesla Autopilot, for example, that uses vision as a primary sensor for perceiving the world and navigating that world?"}, {"time": 3116, "text": "From your stop sign work in the physical world, should people be worried?"}, {"time": 3121, "text": "How hard is that attack?"}, {"time": 3123, "text": "So actually there has already been, like there has always been like research shown that's, for example, actually even with Tesla, like if you put a few stickers on the road, it can actually, when it's arranged in certain ways, it can fool the."}, {"time": 3140, "text": "That's right, but I don't think it's actually been, I'm not, I might not be familiar, but I don't think it's been done on physical roads yet, meaning I think it's with a projector in front of the Tesla."}, {"time": 3151, "text": "So it's a physical, so you're on the other side of the sensor, but you're not in still the physical world."}, {"time": 3159, "text": "The question is whether it's possible to orchestrate attacks that work in the actual, like end to end attacks, like not just a demonstration of the concept, but thinking is it possible on the highway to control Tesla?"}, {"time": 3173, "text": "That kind of idea."}, {"time": 3174, "text": "I think there are two separate questions."}, {"time": 3176, "text": "One is the feasibility of the attack and I'm 100% confident that the attack is possible."}, {"time": 3183, "text": "And there's a separate question, whether someone will actually go deploy that attack."}, {"time": 3190, "text": "I hope people do not do that, but that's two separate questions."}, {"time": 3195, "text": "So the question on the word feasibility."}, {"time": 3199, "text": "So to clarify, feasibility means it's possible."}, {"time": 3202, "text": "It doesn't say how hard it is, because to implement it."}, {"time": 3208, "text": "So sort of the barrier, like how much of a heist it has to be, like how many people have to be involved?"}, {"time": 3214, "text": "What is the probability of success?"}, {"time": 3216, "text": "That kind of stuff."}, {"time": 3217, "text": "And coupled with how many evil people there are in the world that would attempt such an attack, right?"}, {"time": 3223, "text": "But the two, my question is, is it sort of, when I talked to Elon Musk and asked the same question, he says, it's not a problem."}, {"time": 3233, "text": "It's very difficult to do in the real world."}, {"time": 3235, "text": "That this won't be a problem."}, {"time": 3237, "text": "He dismissed it as a problem for adversarial attacks on the Tesla."}, {"time": 3241, "text": "Of course, he happens to be involved with the company."}, {"time": 3244, "text": "So he has to say that, but I mean, let me linger in a little longer."}, {"time": 3252, "text": "Where does your confidence that it's feasible come from?"}, {"time": 3255, "text": "And what's your intuition, how people should be worried and how we might be, how people should defend against it?"}, {"time": 3261, "text": "How Tesla, how Waymo, how other autonomous vehicle companies should defend against sensory based attacks, whether on Lidar or on vision or so on."}, {"time": 3272, "text": "And also even for Lidar, actually, there has been research shown that even Lidar itself can be attacked."}, {"time": 3276, "text": "No, no, no, no, no, no."}, {"time": 3278, "text": "It's really important to pause."}, {"time": 3280, "text": "There's really nice demonstrations that it's possible to do, but there's so many pieces that it's kind of like, it's kind of in the lab."}, {"time": 3291, "text": "Now it's in the physical world, meaning it's in the physical space, the attacks, but it's very like, you have to control a lot of things."}, {"time": 3298, "text": "To pull it off, it's like the difference between opening a safe when you have it and you have unlimited time and you can work on it versus like breaking into like the crown, stealing the crown jewels and whatever, right?"}, {"time": 3314, "text": "I mean, so one way to look at it in terms of how real these attacks can be, one way to look at it is that actually you don't even need any sophisticated attacks."}, {"time": 3325, "text": "Already we've seen many real world examples, incidents where showing that the vehicle was making the wrong decision."}, {"time": 3334, "text": "The wrong decision without attacks, right?"}, {"time": 3337, "text": "So that's one way to demonstrate."}, {"time": 3338, "text": "And this is also, like so far we've mainly talked about work in this adversarial setting, showing that today's learning system, they are so vulnerable to the adversarial setting, but at the same time, actually we also know that even in natural settings, these learning systems, they don't generalize well and hence they can really misbehave under certain situations like what we have seen."}, {"time": 3362, "text": "And hence I think using that as an example, it can show that these issues can be real."}, {"time": 3368, "text": "They can be real, but so there's two cases."}, {"time": 3370, "text": "One is something, it's like perturbations can make the system misbehave versus make the system do one specific thing that the attacker wants, as you said, the targeted attack."}, {"time": 3383, "text": "That seems to be very difficult, like an extra level of difficult step in the real world."}, {"time": 3391, "text": "But from the perspective of the passenger of the car, I don't think it matters either way, whether it's misbehavior or a targeted attack."}, {"time": 3402, "text": "And also, and that's why I was also saying earlier, like one defense is this multi model defense and more of these consistent checks and so on."}, {"time": 3411, "text": "So in the future, I think also it's important that for these autonomous vehicles, they have lots of different sensors and they should be combining all these sensory readings to arrive at the decision and the interpretation of the world and so on."}, {"time": 3428, "text": "And the more of these sensory inputs they use and the better they combine the sensory inputs, the harder it is going to be attacked."}, {"time": 3436, "text": "And hence, I think that is a very important direction for us to move towards."}, {"time": 3441, "text": "So multi model, multi sensor across multiple cameras, but also in the case of car, radar, ultrasonic, sound even."}, {"time": 3450, "text": "So all of those."}, {"time": 3453, "text": "So another thing, another part of your work has been in the space of privacy."}, {"time": 3459, "text": "And that too can be seen as a kind of security vulnerability."}, {"time": 3463, "text": "So thinking of data as a thing that should be protected and the vulnerabilities to data is vulnerability is essentially the thing that you wanna protect is the privacy of that data."}, {"time": 3476, "text": "So what do you see as the main vulnerabilities in the privacy of data and how do we protect it?"}, {"time": 3482, "text": "Right, so in security we actually talk about essentially two, in this case, two different properties."}, {"time": 3490, "text": "One is integrity and one is confidentiality."}, {"time": 3493, "text": "So what we have been talking earlier is essentially the integrity of, the integrity property of the learning system."}, {"time": 3502, "text": "How to make sure that the learning system is giving the right prediction, for example."}, {"time": 3509, "text": "And privacy essentially is on the other side is about confidentiality of the system is how attackers can, when the attackers compromise the confidentiality of the system, that's when the attacker steal sensitive information, right, about individuals and so on."}, {"time": 3528, "text": "That's really clean, those are great terms."}, {"time": 3531, "text": "Integrity and confidentiality."}, {"time": 3534, "text": "So how, what are the main vulnerabilities to privacy, would you say, and how do we protect against it?"}, {"time": 3541, "text": "Like what are the main spaces and problems that you think about in the context of privacy?"}, {"time": 3547, "text": "Right, so especially in the machine learning setting."}, {"time": 3552, "text": "So in this case, as we know that how the process goes is that we have the training data and then the machine learning system trains from this training data and then builds a model and then later on inputs are given to the model to, at inference time, to try to get prediction and so on."}, {"time": 3574, "text": "So then in this case, the privacy concerns that we have is typically about privacy of the data in the training data because that's essentially the private information."}, {"time": 3585, "text": "So, and it's really important because oftentimes the training data can be very sensitive."}, {"time": 3594, "text": "It can be your financial data, it's your health data, or like in IoT case, it's the sensors deployed in real world environment and so on."}, {"time": 3604, "text": "And all this can be collecting very sensitive information."}, {"time": 3608, "text": "And all the sensitive information gets fed into the learning system and trains."}, {"time": 3613, "text": "And as we know, these neural networks, they can have really high capacity and they actually can remember a lot."}, {"time": 3623, "text": "And hence just from the learning, the learned model in the end, actually attackers can potentially infer information about the original training data sets."}, {"time": 3636, "text": "So the thing you're trying to protect that is the confidentiality of the training data."}, {"time": 3642, "text": "And so what are the methods for doing that?"}, {"time": 3644, "text": "Would you say, what are the different ways that can be done?"}, {"time": 3647, "text": "And also we can talk about essentially how the attacker may try to learn information from the..."}, {"time": 3654, "text": "So, and also there are different types of attacks."}, {"time": 3657, "text": "So in certain cases, again, like in white box attacks, we can see that the attacker actually get to see the parameters of the model."}, {"time": 3665, "text": "And then from that, a smart attacker potentially can try to figure out information about the training data set."}, {"time": 3673, "text": "They can try to figure out what type of data has been in the training data sets."}, {"time": 3678, "text": "And sometimes they can tell like, whether a person has been... A particular person's data point has been used in the training data sets as well."}, {"time": 3689, "text": "So white box, meaning you have access to the parameters of say a neural network."}, {"time": 3693, "text": "And so that you're saying that it's some..."}, {"time": 3696, "text": "Given that information is possible to some..."}, {"time": 3698, "text": "So I can give you some examples."}, {"time": 3700, "text": "And then another type of attack, which is even easier to carry out is not a white box model."}, {"time": 3706, "text": "It's more of just a query model where the attacker only gets to query the machine learning model and then try to steal sensitive information in the original training data."}, {"time": 3717, "text": "So, right, so I can give you an example."}, {"time": 3720, "text": "In this case, training a language model."}, {"time": 3723, "text": "So in our work, in collaboration with the researchers from Google, we actually studied the following question."}, {"time": 3730, "text": "So at high level, the question is, as we mentioned, the neural networks can have very high capacity and they could be remembering a lot from the training process."}, {"time": 3741, "text": "Then the question is, can attacker actually exploit this and try to actually extract sensitive information in the original training data sets through just querying the learned model without even knowing the parameters of the model, like the details of the model or the architectures of the model and so on."}, {"time": 3761, "text": "So that's a question we set out to explore."}, {"time": 3766, "text": "And in one of the case studies, we showed the following."}, {"time": 3770, "text": "So we trained a language model over an email data set."}, {"time": 3775, "text": "It's called an Enron email data set."}, {"time": 3777, "text": "And the Enron email data sets naturally contained users social security numbers and credit card numbers."}, {"time": 3785, "text": "So we trained a language model over the data sets and then we showed that an attacker by devising some new attacks by just querying the language model and without knowing the details of the model, the attacker actually can extract the original social security numbers and credit card numbers that were in the original training data sets."}, {"time": 3810, "text": "So get the most sensitive personally identifiable information from the data set from just querying it."}, {"time": 3819, "text": "So that's an example showing that's why even as we train machine learning models, we have to be really careful with protecting users data privacy."}, {"time": 3831, "text": "So what are the mechanisms for protecting?"}, {"time": 3833, "text": "Is there hopeful?"}, {"time": 3835, "text": "So there's been recent work on differential privacy, for example, that provides some hope, but can you describe some of the ideas?"}, {"time": 3844, "text": "Right, so that's actually, right."}, {"time": 3845, "text": "So that's also our finding is that by actually, we show that in this particular case, we actually have a good defense."}, {"time": 3854, "text": "For the querying case, for the language model case."}, {"time": 3857, "text": "So instead of just training a vanilla language model, instead, if we train a differentially private language model, then we can still achieve similar utility, but at the same time, we can actually significantly enhance the privacy protection of the learned model."}, {"time": 3879, "text": "And our proposed attacks actually are no longer effective."}, {"time": 3884, "text": "And differential privacy is a mechanism of adding some noise, by which you then have some guarantees on the inability to figure out the presence of a particular person in the dataset."}, {"time": 3899, "text": "So right, so in this particular case, what the differential privacy mechanism does is that it actually adds perturbation in the training process."}, {"time": 3910, "text": "As we know, during the training process, we are learning the model, we are doing gradient updates, the weight updates and so on."}, {"time": 3919, "text": "And essentially, differential privacy, a differentially private machine learning algorithm in this case, will be adding noise and adding various perturbation during this training process."}, {"time": 3933, "text": "To some aspect of the training process."}, {"time": 3935, "text": "Right, so then the finally trained learning, the learned model is differentially private, and so it can enhance the privacy protection."}, {"time": 3946, "text": "So okay, so that's the attacks and the defense of privacy."}, {"time": 3951, "text": "You also talk about ownership of data."}, {"time": 3954, "text": "So this is a really interesting idea that we get to use many services online for seemingly for free by essentially, sort of a lot of companies are funded through advertisement."}, {"time": 3966, "text": "And what that means is the advertisement works exceptionally well because the companies are able to access our personal data, so they know which advertisement to service to do targeted advertisements and so on."}, {"time": 3978, "text": "So can you maybe talk about this?"}, {"time": 3981, "text": "You have some nice paintings of the future, philosophically speaking future where people can have a little bit more control of their data by owning and maybe understanding the value of their data and being able to sort of monetize it in a more explicit way as opposed to the implicit way that it's currently done."}, {"time": 4005, "text": "Yeah, I think this is a fascinating topic and also a really complex topic."}, {"time": 4011, "text": "Right, I think there are these natural questions, who should be owning the data?"}, {"time": 4018, "text": "And so I can draw one analogy."}, {"time": 4023, "text": "So for example, for physical properties, like your house and so on."}, {"time": 4028, "text": "So really this notion of property rights it's not like from day one, we knew that there should be like this clear notion of ownership of properties and having enforcement for this."}, {"time": 4045, "text": "And so actually people have shown that this establishment and enforcement of property rights has been a main driver for the economy earlier."}, {"time": 4062, "text": "And that actually really propelled the economic growth even in the earlier stage."}, {"time": 4070, "text": "So throughout the history of the development of the United States or actually just civilization, the idea of property rights that you can own property."}, {"time": 4079, "text": "Right, and then there's enforcement."}, {"time": 4081, "text": "There's institutional rights, that governmental like enforcements of this actually has been a key driver for economic growth."}, {"time": 4092, "text": "And there had been even research or proposals saying that for a lot of the developing countries, essentially the challenge in growth is not actually due to the lack of capital."}, {"time": 4108, "text": "It's more due to the lack of this notion of property rights and the enforcement of property rights."}, {"time": 4117, "text": "Interesting, so that the presence of absence of both the concept of the property rights and their enforcement has a strong correlation to economic growth."}, {"time": 4130, "text": "And so you think that that same could be transferred to the idea of property ownership in the case of data ownership."}, {"time": 4137, "text": "I think first of all, it's a good lesson for us to recognize that these rights and the recognition and the enforcements of these type of rights is very, very important for economic growth."}, {"time": 4153, "text": "And then if we look at where we are now and where we are going in the future, so essentially more and more is actually moving into the digital world."}, {"time": 4163, "text": "And also more and more, I would say, even information or assets of a person is more and more into the real world, the physical, sorry, the digital world as well."}, {"time": 4175, "text": "It's the data that the person has generated."}, {"time": 4179, "text": "And essentially it's like in the past what defines a person, you can say, right, like oftentimes besides the innate capabilities, actually it's the physical properties."}, {"time": 4194, "text": "House, car."}, {"time": 4195, "text": "Right, that defines a person."}, {"time": 4196, "text": "But I think more and more people start to realize actually what defines a person is more important in the data that the person has generated or the data about the person."}, {"time": 4207, "text": "Like all the way from your political views, your music taste and your financial information, a lot of these and your health."}, {"time": 4216, "text": "So more and more of the definition of the person is actually in the digital world."}, {"time": 4222, "text": "And currently for the most part, that's owned implicitly."}, {"time": 4226, "text": "People don't talk about it, but kind of it's owned by internet companies."}, {"time": 4233, "text": "So it's not owned by individuals."}, {"time": 4234, "text": "Right, there's no clear notion of ownership of such data."}, {"time": 4239, "text": "And also we talk about privacy and so on, but I think actually clearly identifying the ownership is a first step."}, {"time": 4246, "text": "Once you identify the ownership, then you can say who gets to define how the data should be used."}, {"time": 4252, "text": "So maybe some users are fine with internet companies serving them as, right, using their data as long as if the data is used in a certain way that actually the user consents with or allows."}, {"time": 4271, "text": "For example, you can see the recommendation system in some sense, we don't call it as, but a recommendation system, similarly it's trying to recommend you something and users enjoy and can really benefit from good recommendation systems, either recommending you better music, movies, news, even research papers to read."}, {"time": 4292, "text": "But of course then in these targeted ads, especially in certain cases where people can be manipulated by these targeted ads that can have really bad, like severe consequences."}, {"time": 4305, "text": "So essentially users want their data to be used to better serve them and also maybe even, right, get paid for or whatever, like in different settings."}, {"time": 4316, "text": "But the thing is that first of all, we need to really establish like who needs to decide, who can decide how the data should be used."}, {"time": 4326, "text": "And typically the establishment and clarification of the ownership will help this and it's an important first step."}, {"time": 4334, "text": "So if the user is the owner, then naturally the user gets to define how the data should be used."}, {"time": 4339, "text": "But if you even say that wait a minute, users are actually now the owner of this data, whoever is collecting the data is the owner of the data."}, {"time": 4346, "text": "Now of course they get to use the data however way they want."}, {"time": 4349, "text": "So to really address these complex issues, we need to go at the root cause."}, {"time": 4355, "text": "So it seems fairly clear that so first we really need to say that who is the owner of the data and then the owners can specify how they want their data to be utilized."}, {"time": 4367, "text": "So that's a fascinating, most people don't think about that and I think that's a fascinating thing to think about and probably fight for it."}, {"time": 4377, "text": "I can only see in the economic growth argument, it's probably a really strong one."}, {"time": 4381, "text": "So that's a first time I'm kind of at least thinking about the positive aspect of that ownership being the longterm growth of the economy, so good for everybody."}, {"time": 4392, "text": "But sort of one down possible downside I could see sort of to put on my grumpy old grandpa hat and it's really nice for Facebook and YouTube and Twitter to all be free."}, {"time": 4408, "text": "And if you give control to people or their data, do you think it's possible they will be, they would not want to hand it over quite easily?"}, {"time": 4417, "text": "And so a lot of these companies that rely on mass handover of data and then therefore provide a mass seemingly free service would then completely, so the way the internet looks will completely change because of the ownership of data and we'll lose a lot of services value."}, {"time": 4443, "text": "I think that's not necessarily the case in the sense that yes, users can have ownership of their data, they can maintain control of their data, but also then they get to decide how their data can be used."}, {"time": 4457, "text": "So that's why I mentioned earlier, so in this case, if they feel that they enjoy the benefits of social networks and so on, and they're fine with having Facebook, having their data, but utilizing the data in certain way that they agree, then they can still enjoy the free services."}, {"time": 4477, "text": "But for others, maybe they would prefer some kind of private vision."}, {"time": 4481, "text": "And in that case, maybe they can even opt in to say that I want to pay and to have, so for example, it's already fairly standard, like you pay for certain subscriptions so that you don't get to be shown ads, right?"}, {"time": 4499, "text": "So then users essentially can have choices."}, {"time": 4501, "text": "And I think we just want to essentially bring out more about who gets to decide what to do with that data."}, {"time": 4510, "text": "I think it's an interesting idea, because if you poll people now, it seems like, I don't know, but subjectively, sort of anecdotally speaking, it seems like a lot of people don't trust Facebook."}, {"time": 4522, "text": "So that's at least a very popular thing to say that I don't trust Facebook, right?"}, {"time": 4526, "text": "I wonder if you give people control of their data as opposed to sort of signaling to everyone that they don't trust Facebook, I wonder how they would speak with the actual, like would they be willing to pay $10 a month for Facebook or would they hand over their data?"}, {"time": 4544, "text": "It'd be interesting to see what fraction of people would quietly hand over their data to Facebook to make it free."}, {"time": 4552, "text": "I don't have a good intuition about that."}, {"time": 4554, "text": "Like how many people, do you have an intuition about how many people would use their data effectively on the market of the internet by sort of buying services with their data?"}, {"time": 4570, "text": "Yeah, so that's a very good question."}, {"time": 4572, "text": "I think, so one thing I also want to mention is that this, right, so it seems that especially in press, the conversation has been very much like two sides fighting against each other."}, {"time": 4589, "text": "On one hand, right, users can say that, right, they don't trust Facebook, they don't, or they delete Facebook."}, {"time": 4599, "text": "Right, and then on the other hand, right, of course, right, the other side, they also feel, oh, they are providing a lot of services to users and users are getting it all for free."}, {"time": 4613, "text": "So I think I actually, I don't know, I talk a lot to like different companies and also like basically on both sides."}, {"time": 4624, "text": "So one thing I hope also like, this is my hope for this year also, is that we want to establish a more constructive dialogue and to help people to understand that the problem is much more nuanced than just this two sides fighting."}, {"time": 4645, "text": "Because naturally, there is a tension between the two sides, between utility and privacy."}, {"time": 4653, "text": "So if you want to get more utility, essentially, like the recommendation system example I gave earlier, if you want someone to give you a good recommendation, essentially, whatever that system is, the system is going to need to know your data to give you a good recommendation."}, {"time": 4672, "text": "But also, of course, at the same time, we want to ensure that however that data is being handled, it's done in a privacy preserving way."}, {"time": 4679, "text": "So that, for example, the recommendation system doesn't just go around and sell your data and then cause a lot of bad consequences and so on."}, {"time": 4692, "text": "So you want that dialogue to be a little bit more in the open, a little more nuanced, and maybe adding control to the data, ownership to the data will allow, as opposed to this happening in the background, allow to bring it to the forefront and actually have dialogues, like more nuanced, real dialogues about how we trade our data for the services."}, {"time": 4718, "text": "Right, right, yes, at the high level."}, {"time": 4721, "text": "So essentially, also knowing that there are technical challenges in addressing the issue, like basically you can't have, just like the example that I gave earlier, it's really difficult to balance the two between utility and privacy."}, {"time": 4737, "text": "And that's also a lot of things that I work on, my group works on as well, is to actually develop these technologies that are needed to essentially help this balance better, essentially to help data to be utilized in a privacy preserving way."}, {"time": 4756, "text": "And so we essentially need people to understand the challenges and also at the same time to provide the technical abilities and also regulatory frameworks to help the two sides to be more in a win win situation instead of a fight."}, {"time": 4806, "text": "Yeah, it might make mistakes, but I think it's an incredible service."}, {"time": 4810, "text": "I think it's world changing."}, {"time": 4812, "text": "I mean, I think Facebook's done a lot of incredible, incredible things by bringing, for example, identity."}, {"time": 4820, "text": "Like allowing people to be themselves, like their real selves in the digital space by using their real name and their real picture."}, {"time": 4831, "text": "That step was like the first step from the real world to the digital world."}, {"time": 4835, "text": "That was a huge step that perhaps will define the 21st century in us creating a digital identity."}, {"time": 4841, "text": "And there's a lot of interesting possibilities there that are positive."}, {"time": 4845, "text": "Of course, some things that are negative and having a good dialogue about that is great."}, {"time": 4850, "text": "And I'm great that people like you are at the center of that dialogue, so that's awesome."}, {"time": 4854, "text": "Right, I think also, I also can understand."}, {"time": 4858, "text": "I think actually in the past, especially in the past couple of years, this rising awareness has been helpful."}, {"time": 4867, "text": "Like users are also more and more recognizing that privacy is important to them."}, {"time": 4872, "text": "They should, maybe, right, they should be owners of their data."}, {"time": 4875, "text": "I think this definitely is very helpful."}, {"time": 4878, "text": "And I think also this type of voice also, and together with the regulatory framework and so on, also help the companies to essentially put these type of issues at a higher priority."}, {"time": 4893, "text": "And knowing that, right, also it is their responsibility too to ensure that users are well protected."}, {"time": 4902, "text": "So I think definitely the rising voice is super helpful."}, {"time": 4907, "text": "And I think that actually really has brought the issue of data privacy and even this consideration of data ownership to the forefront to really much wider community."}, {"time": 4920, "text": "And I think more of this voice is needed, but I think it's just that we want to have a more constructive dialogue to bring the both sides together to figure out a constructive solution."}, {"time": 4933, "text": "So another interesting space where security is really important is in the space of any kinds of transactions, but it could be also digital currency."}, {"time": 4942, "text": "So can you maybe talk a little bit about blockchain?"}, {"time": 4947, "text": "And can you tell me what is a blockchain?"}, {"time": 4950, "text": "Blockchain."}, {"time": 4952, "text": "I think the blockchain word itself is actually very overloaded."}, {"time": 4959, "text": "It's like AI."}, {"time": 4962, "text": "So in general, when we talk about blockchain, we refer to this distributor in a decentralized fashion."}, {"time": 4967, "text": "So essentially you have a community of nodes that come together."}, {"time": 4974, "text": "And even though each one may not be trusted, and as long as a certain thresholds of the set of nodes behaves properly, then the system can essentially achieve certain properties."}, {"time": 4991, "text": "For example, in the distributed ledger setting, you can maintain an immutable log and you can ensure that, for example, the transactions actually are agreed upon and then it's immutable and so on."}, {"time": 5008, "text": "So first of all, what's a ledger?"}, {"time": 5010, "text": "It's like a database."}, {"time": 5011, "text": "It's like a data entry."}, {"time": 5013, "text": "And so a distributed ledger is something that's maintained across or is synchronized across multiple sources, multiple nodes."}, {"time": 5021, "text": "Multiple nodes, yes."}, {"time": 5023, "text": "And so where is this idea?"}, {"time": 5026, "text": "How do you keep..."}, {"time": 5028, "text": "So it's important, a ledger, a database, to keep that, to make sure..."}, {"time": 5035, "text": "So what are the kinds of security vulnerabilities that you're trying to protect against in the context of a distributed ledger?"}, {"time": 5044, "text": "So in this case, for example, you don't want some malicious nodes to be able to change the transaction logs."}, {"time": 5052, "text": "And in certain cases, it's called double spending, like you can also cause different views in different parts of the network and so on."}, {"time": 5062, "text": "So the ledger has to represent, if you're capturing financial transactions, it has to represent the exact timing and the exact occurrence and no duplicates, all that kind of stuff."}, {"time": 5073, "text": "It has to represent what actually happened."}, {"time": 5077, "text": "Okay, so what are your thoughts on the security and privacy of digital currency?"}, {"time": 5083, "text": "I can't tell you how many people write to me to interview various people in the digital currency space."}, {"time": 5091, "text": "There seems to be a lot of excitement there."}, {"time": 5094, "text": "And it seems to be, some of it's, to me, from an outsider's perspective, seems like dark magic."}, {"time": 5101, "text": "I don't know how secure..."}, {"time": 5106, "text": "I think the foundation, from my perspective, of digital currencies, that is, you can't trust anyone."}, {"time": 5113, "text": "So you have to create a really secure system."}, {"time": 5116, "text": "So can you maybe speak about how, what your thoughts in general about digital currency is and how we can possibly create financial transactions and financial stores of money in the digital space?"}, {"time": 5131, "text": "So you asked about security and privacy."}, {"time": 5135, "text": "So again, as I mentioned earlier, in security, we actually talk about two main properties, the integrity and confidentiality."}, {"time": 5145, "text": "So there's another one for availability."}, {"time": 5149, "text": "You want the system to be available."}, {"time": 5150, "text": "But here, for the question you asked, let's just focus on integrity and confidentiality."}, {"time": 5157, "text": "So for integrity of this distributed ledger, essentially, as we discussed, we want to ensure that the different nodes, so they have this consistent view, usually it's done through what we call a consensus protocol, and that they establish this shared view on this ledger, and that you cannot go back and change, it's immutable, and so on."}, {"time": 5185, "text": "So in this case, then the security often refers to this integrity property."}, {"time": 5191, "text": "And essentially, you're asking the question, how much work, how can you attack the system so that the attacker can change the lock, for example?"}, {"time": 5203, "text": "Change the lock, for example."}, {"time": 5206, "text": "Right, how hard is it to make an attack like that?"}, {"time": 5209, "text": "And then that very much depends on the consensus mechanism, how the system is built, and all that."}, {"time": 5217, "text": "So there are different ways to build these decentralized systems."}, {"time": 5222, "text": "And people may have heard about the terms called like proof of work, proof of stake, these different mechanisms."}, {"time": 5229, "text": "And it really depends on how the system has been built, and also how much resources, how much work has gone into the network to actually say how secure it is."}, {"time": 5244, "text": "So for example, people talk about like, in Bitcoin, it's proof of work system, so much electricity has been burned."}, {"time": 5252, "text": "So there's differences in the different mechanisms and the implementations of a distributed ledger used for digital currency."}, {"time": 5260, "text": "So there's Bitcoin, there's whatever, there's so many of them, and there's underlying different mechanisms."}, {"time": 5266, "text": "And there's arguments, I suppose, about which is more effective, which is more secure, which is more."}, {"time": 5272, "text": "And what is needed, what amount of resources needed to be able to attack the system?"}, {"time": 5280, "text": "Like for example, what percentage of the nodes do you need to control or compromise in order to, right, to change the log?"}, {"time": 5289, "text": "And those are things, do you have a sense if those are things that can be shown theoretically through the design of the mechanisms, or does it have to be shown empirically by having a large number of users using the currency?"}, {"time": 5304, "text": "So in general, for each consensus mechanism, you can actually show theoretically what is needed to be able to attack the system."}, {"time": 5314, "text": "Of course, there can be different types of attacks as we discussed at the beginning."}, {"time": 5321, "text": "And so that it's difficult to give like, you know, complete estimates, like really how much is needed to compromise the system."}, {"time": 5335, "text": "But in general, right, so there are ways to say what percentage of the nodes you need to compromise and so on."}, {"time": 5343, "text": "So we talked about integrity on the security side, and then you also mentioned the privacy or the confidentiality side."}, {"time": 5353, "text": "Does it have some of the same problems and therefore some of the same solutions that you talked about on the machine learning side with differential privacy and so on?"}, {"time": 5364, "text": "Yeah, so actually in general on the public ledger in these public decentralized systems, actually nothing is private."}, {"time": 5374, "text": "So all the transactions posted on the ledger, anybody can see."}, {"time": 5380, "text": "So in that sense, there's no confidentiality."}, {"time": 5383, "text": "So usually what you can do is then there are the mechanisms that you can build in to enable confidentiality or privacy of the transactions and the data and so on."}, {"time": 5396, "text": "That's also some of the work that both my group and also my startup does as well."}, {"time": 5404, "text": "What's the name of the startup?"}, {"time": 5407, "text": "And so the confidentiality aspect there is even though the transactions are public, you wanna keep some aspect confidential of the identity of the people involved in the transactions?"}, {"time": 5421, "text": "Or what is their hope to keep confidential in this context?"}, {"time": 5425, "text": "So in this case, for example, you want to enable like confidential transactions, even, so there are different essentially types of data that you want to keep private or confidential."}, {"time": 5440, "text": "And you can utilize different technologies including zero knowledge proofs and also secure computing and techniques and to hide who is making the transactions to whom and the transaction amount."}, {"time": 5458, "text": "And in our case, also we can enable like confidential smart contracts."}, {"time": 5462, "text": "And so that you don't know the data and the execution of the smart contract and so on."}, {"time": 5469, "text": "And we actually are combining these different technologies and going back to the earlier discussion we had, enabling like ownership of data and privacy of data and so on."}, {"time": 5519, "text": "So all this together can build, we call a distributed secure computing fabric that helps to enable a more responsible data economy."}, {"time": 5530, "text": "So it's a lot of things together."}, {"time": 5531, "text": "Yeah, wow, that was eloquent."}, {"time": 5533, "text": "Okay, you're involved in so much amazing work that we'll never be able to get to, but I have to ask at least briefly about program synthesis, which at least in a philosophical sense captures much of the dreams of what's possible in computer science and the artificial intelligence."}, {"time": 5553, "text": "First, let me ask, what is program synthesis and can neural networks be used to learn programs from data?"}, {"time": 5561, "text": "So can this be learned?"}, {"time": 5563, "text": "Some aspect of the synthesis can it be learned?"}, {"time": 5566, "text": "So program synthesis is about teaching computers to write code, to program."}, {"time": 5572, "text": "And I think that's one of our ultimate dreams or goals."}, {"time": 5580, "text": "I think Andreessen talked about software eating the world."}, {"time": 5585, "text": "So I say, once we teach computers to write the software, how to write programs, then I guess computers will be eating the world by transitivity."}, {"time": 5597, "text": "So yeah, and also for me actually, when I shifted from security to more AI machine learning, program synthesis is, program synthesis and adversarial machine learning, these are the two fields that I particularly focus on."}, {"time": 5618, "text": "Like program synthesis is one of the first questions that I actually started investigating."}, {"time": 5622, "text": "Just as a question, oh, I guess from the security side, there's a, you're looking for holes in programs, so at least see small connection, but where was your interest for program synthesis?"}, {"time": 5636, "text": "Because it's such a fascinating, such a big, such a hard problem in the general case."}, {"time": 5641, "text": "Why program synthesis?"}, {"time": 5643, "text": "So the reason for that is actually when I shifted my focus from security into AI machine learning, actually one of my main motivation at the time is that even though I have been doing a lot of work in security and privacy, but I have always been fascinated about building intelligent machines."}, {"time": 5666, "text": "And that was really my main motivation to spend more time in AI machine learning is that I really want to figure out how we can build intelligent machines."}, {"time": 5677, "text": "And to help us towards that goal, program synthesis is really one of, I would say the best domain to work on."}, {"time": 5689, "text": "I actually call it like program synthesis is like the perfect playground for building intelligent machines and for artificial general intelligence."}, {"time": 5699, "text": "Yeah, well, it's also in that sense, not just a playground, I guess it's the ultimate test of intelligence because I think if you can generate sort of neural networks can learn good functions and they can help you out in classification tasks, but to be able to write programs, that's the epitome from the machine side."}, {"time": 5724, "text": "That's the same as passing the Turing test in natural language, but with programs, it's able to express complicated ideas to reason through ideas and boil them down to algorithms."}, {"time": 5738, "text": "Yes, exactly, exactly."}, {"time": 5739, "text": "Incredible, so can this be learned?"}, {"time": 5741, "text": "How far are we?"}, {"time": 5743, "text": "Is there hope?"}, {"time": 5744, "text": "What are the open challenges?"}, {"time": 5746, "text": "Yeah, very good questions."}, {"time": 5748, "text": "We are still at an early stage, but already I think we have seen a lot of progress."}, {"time": 5756, "text": "I mean, definitely we have existence proof, just like humans can write programs."}, {"time": 5762, "text": "So there's no reason why computers cannot write programs."}, {"time": 5765, "text": "So I think that's definitely an achievable goal is just how long it takes."}, {"time": 5771, "text": "And even today, we actually have, the program synthesis community, especially the program synthesis via learning, how we call it, neuro program synthesis community, is still very small, but the community has been growing and we have seen a lot of progress."}, {"time": 5791, "text": "And in limited domains, I think actually program synthesis is ripe for real world applications."}, {"time": 5801, "text": "So actually it was quite amazing."}, {"time": 5802, "text": "I was giving a talk, so here is a rework conference."}, {"time": 5809, "text": "Rework Deep Learning Summit."}, {"time": 5810, "text": "I actually, so I gave another talk at the previous rework conference in deep reinforcement learning."}, {"time": 5816, "text": "And then I actually met someone from a startup, the CEO of the startup."}, {"time": 5824, "text": "And then when he saw my name, he recognized it."}, {"time": 5826, "text": "And he actually said, one of our papers actually had, they had actually become a key products in their startup."}, {"time": 5837, "text": "And that was program synthesis, in that particular case, it was natural language translation, translating natural language description into SQL queries."}, {"time": 5851, "text": "Oh, wow, that direction, okay."}, {"time": 5854, "text": "Right, so yeah, so in program synthesis, in limited domains, in well specified domains, actually already we can see really, really great progress and applicability in the real world."}, {"time": 5872, "text": "So domains like, I mean, as an example, you said natural language, being able to express something through just normal language and it converts it into a database SQL query."}, {"time": 5883, "text": "And that's how solved of a problem is that?"}, {"time": 5887, "text": "Because that seems like a really hard problem."}, {"time": 5890, "text": "Again, in limited domains, actually it can work pretty well."}, {"time": 5894, "text": "And now this is also a very active domain of research."}, {"time": 5898, "text": "At the time, I think when he saw our paper at the time, we were the state of the arts on that task."}, {"time": 5905, "text": "And since then, actually now there has been more work and with even more like sophisticated data sets."}, {"time": 5914, "text": "And so, but I think I wouldn't be surprised that more of this type of technology really gets into the real world."}, {"time": 5924, "text": "In the near term."}, {"time": 5925, "text": "Being able to learn in the space of programs is super exciting."}, {"time": 5929, "text": "I still, yeah, I'm still skeptical cause I think it's a really hard problem, but I would love to see progress."}, {"time": 5936, "text": "And also I think in terms of the, you asked about open challenges."}, {"time": 5940, "text": "I think the domain is full of challenges and in particular also we want to see how we should measure the progress in the space."}, {"time": 5949, "text": "And I would say mainly three main, I would say, metrics."}, {"time": 5956, "text": "So one is the complexity of the program that we can synthesize."}, {"time": 5960, "text": "And that will actually have clear measures and just look at the past publications."}, {"time": 5965, "text": "And even like, for example, I was at the recent NeurIPS conference."}, {"time": 5970, "text": "Now there's actually fairly sizable like session dedicated to program synthesis, which is... Or even Neural programs."}, {"time": 5977, "text": "Right, right, right, which is great."}, {"time": 5978, "text": "And we continue to see the increase."}, {"time": 5983, "text": "What does sizable mean?"}, {"time": 5984, "text": "I like the word sizable, it's five people."}, {"time": 5991, "text": "It's still a small community, but it is growing."}, {"time": 5994, "text": "And they will all win Turing Awards one day, I like it."}, {"time": 5998, "text": "Right, so we can clearly see an increase in the complexity of the programs that these... We can synthesize."}, {"time": 6009, "text": "Sorry, is it the complexity of the actual text of the program or the running time complexity?"}, {"time": 6015, "text": "Which complexity are we... How..."}, {"time": 6018, "text": "The complexity of the task to be synthesized and the complexity of the actual synthesized programs."}, {"time": 6024, "text": "So the lines of code even, for example."}, {"time": 6027, "text": "Okay, I got you."}, {"time": 6028, "text": "But it's not the theoretical upper bound of the running time of the algorithm kind of thing."}, {"time": 6035, "text": "Okay, got it."}, {"time": 6036, "text": "And you can see the complexity decreasing already."}, {"time": 6039, "text": "Oh, no, meaning we want to be able to synthesize more and more complex programs, bigger and bigger programs."}, {"time": 6044, "text": "So we want to see that, we want to increase the complexity of this."}, {"time": 6050, "text": "I got you, so I have to think through, because I thought of complexity as, you want to be able to accomplish the same task with a simpler and simpler program."}, {"time": 6056, "text": "I see, I see."}, {"time": 6057, "text": "No, we are not doing that."}, {"time": 6058, "text": "It's more about how complex a task we can synthesize programs for."}, {"time": 6063, "text": "Yeah, got it, being able to synthesize programs, learn them for more and more difficult tasks."}, {"time": 6070, "text": "So for example, initially, our first work in program synthesis was to translate natural language description into really simple programs called if TTT, if this, then that."}, {"time": 6081, "text": "So given a trigger condition, what is the action you should take?"}, {"time": 6085, "text": "So that program is super simple."}, {"time": 6088, "text": "You just identify the trigger conditions and the action."}, {"time": 6091, "text": "And then later on, with SQL queries, it gets more complex."}, {"time": 6094, "text": "And then also, we started to synthesize programs with loops and, you know."}, {"time": 6100, "text": "Oh no, and if you could synthesize recursion, it's all over."}, {"time": 6105, "text": "Right, actually, one of our works actually is on learning recursive neural programs."}, {"time": 6111, "text": "But anyway, anyway, so that's one is complexity, and the other one is generalization."}, {"time": 6118, "text": "Like when we train or learn a program synthesizer, in this case, a neural programs to synthesize programs, then you want it to generalize."}, {"time": 6130, "text": "For a large number of inputs."}, {"time": 6133, "text": "Right, so to be able to generalize to previously unseen inputs."}, {"time": 6139, "text": "And so, right, so some of the work we did earlier on learning recursive neural programs actually showed that recursion actually is important to learn."}, {"time": 6152, "text": "And if you have recursion, then for a certain set of tasks, we can actually show that you can actually have perfect generalization."}, {"time": 6162, "text": "So, right, so that won the best paperwork awards at ICLR earlier."}, {"time": 6166, "text": "So that's one example of we want to learn these neural programs that can generalize better."}, {"time": 6173, "text": "But that works for certain tasks, certain domains, and there's question how we can essentially develop more techniques that can have generalization for a wider set of domains and so on."}, {"time": 6190, "text": "So that's another area."}, {"time": 6191, "text": "And then the third challenge I think will, it's not just for programming synthesis, it's also cutting across other fields in machine learning and also including like deep reinforcement learning in particular, is that this adaptation is that we want to be able to learn from the past and tasks and training and so on to be able to solve new tasks."}, {"time": 6222, "text": "So for example, in program synthesis today, we still are working in the setting where given a particular task, we train the model and to solve this particular task."}, {"time": 6237, "text": "But that's not how humans work."}, {"time": 6240, "text": "The whole point is we train a human, then you can then program to solve new tasks."}, {"time": 6248, "text": "And just like in deep reinforcement learning, we don't want to just train agent to play a particular game, either it's Atari or it's Go or whatever."}, {"time": 6259, "text": "We want to train these agents that can essentially extract knowledge from the past learning experience to be able to adapt to new tasks and solve new tasks."}, {"time": 6271, "text": "And I think this is particularly important for program synthesis."}, {"time": 6274, "text": "Yeah, that's the whole dream of program synthesis is you're learning a tool that can solve new problems."}, {"time": 6282, "text": "And I think that's a particular domain that as a community, we need to put more emphasis on."}, {"time": 6290, "text": "And I hope that we can make more progress there as well."}, {"time": 6295, "text": "There's a lot more to talk about."}, {"time": 6297, "text": "Let me ask that you also had a very interesting and we talked about rich representations."}, {"time": 6304, "text": "You had a rich life journey."}, {"time": 6308, "text": "You did your bachelor's in China and your master's and PhD in the United States, CMU in Berkeley."}, {"time": 6315, "text": "Are there interesting differences?"}, {"time": 6316, "text": "I told you I'm Russian."}, {"time": 6317, "text": "I think there's a lot of interesting difference between Russia and the United States."}, {"time": 6321, "text": "Are there in your eyes, interesting differences between the two cultures from the silly romantic notion of the spirit of the people to the more practical notion of how research is conducted that you find interesting or useful in your own work of having experienced both?"}, {"time": 6343, "text": "I think, so I studied in China for my undergraduates and that was more than 20 years ago."}, {"time": 6354, "text": "So it's been a long time."}, {"time": 6357, "text": "Is there echoes of that time in you?"}, {"time": 6359, "text": "Things have changed a lot."}, {"time": 6360, "text": "Actually, it's interesting."}, {"time": 6361, "text": "I think even more so maybe something that's even be more different for my experience than a lot of computer science researchers and practitioners is that, so for my undergrad, I actually studied physics."}, {"time": 6376, "text": "Nice, very nice."}, {"time": 6378, "text": "And then I switched to computer science in graduate school."}, {"time": 6386, "text": "Is there another possible universe where you could have become a theoretical physicist at Caltech or something like that?"}, {"time": 6394, "text": "That's very possible, some of my undergrad classmates, then they later on studied physics, got their PhD in physics from these schools, from top physics programs."}, {"time": 6409, "text": "So you switched to, I mean, from that experience of doing physics in your bachelor's, what made you decide to switch to computer science and computer science at arguably the best university, one of the best universities in the world for computer science with Carnegie Mellon, especially for grad school and so on."}, {"time": 6429, "text": "So what, second only to MIT, just kidding."}, {"time": 6433, "text": "Okay, I had to throw that in there."}, {"time": 6437, "text": "No, what was the choice like and what was the move to the United States like?"}, {"time": 6442, "text": "What was that whole transition?"}, {"time": 6444, "text": "And if you remember, if there's still echoes of some of the spirit of the people of China in you in New York."}, {"time": 6451, "text": "Right, right, yeah."}, {"time": 6452, "text": "It's like three questions in one."}, {"time": 6453, "text": "Yes, I know."}, {"time": 6456, "text": "No, that's okay."}, {"time": 6458, "text": "So yes, so I guess, okay, so first transition from physics to computer science."}, {"time": 6463, "text": "So when I first came to the United States, I was actually in the physics PhD program at Cornell."}, {"time": 6469, "text": "I was there for one year and then I switched to computer science and then I was in the PhD program at Carnegie Mellon."}, {"time": 6476, "text": "So, okay, so the reasons for switching."}, {"time": 6479, "text": "So one thing, so that's why I also mentioned about this difference in backgrounds about having studied physics first in my undergrad."}, {"time": 6489, "text": "I actually really, I really did enjoy my undergrad's time and education in physics."}, {"time": 6498, "text": "I think that actually really helped me in my future work in computer science."}, {"time": 6505, "text": "Actually, even for machine learning, a lot of the machine learning stuff, the core machine learning methods, many of them actually came from physics."}, {"time": 6511, "text": "Statistical."}, {"time": 6514, "text": "For honest, most of everything came from physics."}, {"time": 6519, "text": "Right, but anyway, so when I studied physics, I was, I think I was really attracted to physics."}, {"time": 6529, "text": "It was, it's really beautiful."}, {"time": 6531, "text": "And I actually call it, physics is the language of nature."}, {"time": 6535, "text": "And I actually clearly remember, like, one moment in my undergrads, like I did my undergrad in Tsinghua and I used to study in the library."}, {"time": 6550, "text": "And I clearly remember, like, one day I was sitting in the library and I was, like, writing on my notes and so on."}, {"time": 6561, "text": "And I got so excited that I realized that really just from a few simple axioms, a few simple laws, I can derive so much."}, {"time": 6571, "text": "It's almost like I can derive the rest of the world."}, {"time": 6574, "text": "Yeah, the rest of the universe."}, {"time": 6575, "text": "Yes, yes, so that was, like, amazing."}, {"time": 6579, "text": "Do you think you, have you ever seen or do you think you can rediscover that kind of power and beauty in computer science in the world that you..."}, {"time": 6586, "text": "So, that's very interesting."}, {"time": 6589, "text": "So that gets to, you know, the transition from physics to computer science."}, {"time": 6593, "text": "It's quite different."}, {"time": 6595, "text": "For physics in grad school, actually, things changed."}, {"time": 6601, "text": "So one is I started to realize that when I started doing research in physics, at the time I was doing theoretical physics."}, {"time": 6611, "text": "And a lot of it, you still have the beauty, but it's very different."}, {"time": 6616, "text": "So I had to actually do a lot of the simulation."}, {"time": 6618, "text": "So essentially I was actually writing, in some cases writing fortune code."}, {"time": 6623, "text": "Good old fortune, yeah."}, {"time": 6626, "text": "To actually, right, do simulations and so on."}, {"time": 6632, "text": "That was not exactly what I enjoyed doing."}, {"time": 6642, "text": "And also at the time from talking with the senior students, senior students in the program, I realized many of the students actually were going off to like Wall Street and so on."}, {"time": 6658, "text": "So, and I've always been interested in computer science and actually essentially taught myself the C programming."}, {"time": 6667, "text": "Program?"}, {"time": 6668, "text": "Right, and so on."}, {"time": 6669, "text": "At which, when?"}, {"time": 6672, "text": "In college somewhere?"}, {"time": 6672, "text": "In the summer."}, {"time": 6674, "text": "For fun, physics major, learning to do C programming."}, {"time": 6680, "text": "Actually it's interesting, in physics at the time, I think now the program probably has changed, but at the time really the only class we had in related to computer science education was introduction to, I forgot, to computer science or computing and Fortran 77."}, {"time": 6700, "text": "There's a lot of people that still use Fortran."}, {"time": 6702, "text": "I'm actually, if you're a programmer out there, I'm looking for an expert to talk to about Fortran."}, {"time": 6709, "text": "They seem to, there's not many, but there's still a lot of people that still use Fortran and still a lot of people that use Cobalt."}, {"time": 6716, "text": "But anyway, so then I realized, instead of just doing programming for doing simulations and so on, that I may as well just change to computer science."}, {"time": 6727, "text": "And also one thing I really liked, and that's a key difference between the two, is in computer science it's so much easier to realize your ideas."}, {"time": 6735, "text": "If you have an idea, you write it up, you code it up, and then you can see it actually, right?"}, {"time": 6743, "text": "Running and you can see it."}, {"time": 6746, "text": "You can bring it to life quickly."}, {"time": 6746, "text": "Bring it to life."}, {"time": 6747, "text": "Whereas in physics, if you have a good theory, you have to wait for the experimentalists to do the experiments and to confirm the theory, and things just take so much longer."}, {"time": 6758, "text": "And also the reason in physics I decided to do theoretical physics was because I had my experience with experimental physics."}, {"time": 6767, "text": "First, you have to fix the equipment."}, {"time": 6770, "text": "You spend most of your time fixing the equipment first."}, {"time": 6775, "text": "Super expensive equipment, so there's a lot of, yeah, you have to collaborate with a lot of people."}, {"time": 6780, "text": "Takes a long time."}, {"time": 6781, "text": "Just takes really, right, much longer."}, {"time": 6783, "text": "Yeah, it's messy."}, {"time": 6784, "text": "Right, so I decided to switch to computer science."}, {"time": 6786, "text": "And one thing I think maybe people have realized is that for people who study physics, actually it's very easy for physicists to change to do something else."}, {"time": 6796, "text": "I think physics provides a really good training."}, {"time": 6799, "text": "And yeah, so actually it was fairly easy to switch to computer science."}, {"time": 6806, "text": "But one thing, going back to your earlier question, so one thing I actually did realize, so there is a big difference between computer science and physics, where physics you can derive the whole universe from just a few simple laws."}, {"time": 6821, "text": "And computer science, given that a lot of it is defined by humans, the systems are defined by humans, and it's artificial, like essentially you create a lot of these artifacts and so on."}, {"time": 6837, "text": "It's not quite the same."}, {"time": 6838, "text": "You don't derive the computer systems with just a few simple laws."}, {"time": 6843, "text": "You actually have to see there is historical reasons why a system is built and designed one way versus the other."}, {"time": 6852, "text": "There's a lot more complexity, less elegant simplicity of E equals MC squared that kind of reduces everything down to those beautiful fundamental equations."}, {"time": 6863, "text": "But what about the move from China to the United States?"}, {"time": 6867, "text": "Is there anything that still stays in you that contributes to your work, the fact that you grew up in another culture?"}, {"time": 6876, "text": "So yes, I think especially back then it's very different from now."}, {"time": 6880, "text": "So now they actually, I see these students coming from China, and even undergrads, actually they speak fluent English."}, {"time": 6891, "text": "It was just amazing."}, {"time": 6894, "text": "And they have already understood so much of the culture in the US and so on."}, {"time": 6900, "text": "It was to you, it was all foreign?"}, {"time": 6904, "text": "It was a very different time."}, {"time": 6906, "text": "At the time, actually, we didn't even have easy access to email, not to mention about the web."}, {"time": 6916, "text": "I remember I had to go to specific privileged server rooms to use email, and hence, at the time, at the time we had much less knowledge about the Western world."}, {"time": 6932, "text": "And actually at the time I didn't know, actually in the US, the West Coast weather is much better than the East Coast."}, {"time": 6940, "text": "Yeah, things like that, actually."}, {"time": 6948, "text": "But now it's so different."}, {"time": 6950, "text": "At the time, I would say there's also a bigger cultural difference, because there was so much less opportunity for shared information."}, {"time": 6959, "text": "So it's such a different time and world."}, {"time": 6962, "text": "So let me ask maybe a sensitive question."}, {"time": 6964, "text": "I'm not sure, but I think you and I are in similar positions."}, {"time": 6968, "text": "I've been here for already 20 years as well, and looking at Russia from my perspective, and you looking at China."}, {"time": 6976, "text": "In some ways, it's a very distant place, because it's changed a lot."}, {"time": 6981, "text": "But in some ways you still have echoes, you still have knowledge of that place."}, {"time": 6985, "text": "The question is, China's doing a lot of incredible work in AI."}, {"time": 6989, "text": "Do you see, please tell me there's an optimistic picture you see where the United States and China can collaborate and sort of grow together in the development of AI towards, there's different values in terms of the role of government and so on, of ethical, transparent, secure systems."}, {"time": 7008, "text": "We see it differently in the United States a little bit than China, but we're still trying to work it out."}, {"time": 7013, "text": "Do you see the two countries being able to successfully collaborate and work in a healthy way without sort of fighting and making it an AI arms race kind of situation?"}, {"time": 7026, "text": "Yeah, I believe so."}, {"time": 7028, "text": "I think science has no border, and the advancement of the technology helps everyone, helps the whole world."}, {"time": 7038, "text": "And so I certainly hope that the two countries will collaborate, and I certainly believe so."}, {"time": 7046, "text": "Do you have any reason to believe so except being an optimist?"}, {"time": 7052, "text": "So first, again, like I said, science has no borders."}, {"time": 7055, "text": "And especially in... Science doesn't know borders?"}, {"time": 7059, "text": "And you believe that will, in the former Soviet Union during the Cold War..."}, {"time": 7064, "text": "So that's, yeah."}, {"time": 7065, "text": "So that's the other point I was going to mention is that especially in academic research, everything is public."}, {"time": 7072, "text": "Like we write papers, we open source codes, and all this is in the public domain."}, {"time": 7079, "text": "It doesn't matter whether the person is in the US, in China, or some other parts of the world."}, {"time": 7084, "text": "They can go on archive and look at the latest research and results."}, {"time": 7089, "text": "So that openness gives you hope."}, {"time": 7092, "text": "And that's also how, as a world, we make progress the best."}, {"time": 7097, "text": "So, I apologize for the romanticized question, but looking back, what would you say was the most transformative moment in your life that maybe made you fall in love with computer science?"}, {"time": 7112, "text": "You said physics."}, {"time": 7113, "text": "You remember there was a moment where you thought you could derive the entirety of the universe."}, {"time": 7118, "text": "Was there a moment that you really fell in love with the work you do now, from security to machine learning, to program synthesis?"}, {"time": 7127, "text": "So maybe, as I mentioned, actually, in college, one summer I just taught myself programming in C. Yes."}, {"time": 7136, "text": "And you just read a book, and then you're like... Don't tell me you fell in love with computer science by programming in C. Remember I mentioned one of the draws for me to computer science is how easy it is to realize your ideas."}, {"time": 7150, "text": "So once I read a book, I taught myself how to program in C. Immediately, what did I do?"}, {"time": 7159, "text": "I programmed two games."}, {"time": 7162, "text": "One's just simple, like it's a Go game, like it's a board, you can move the stones and so on."}, {"time": 7168, "text": "And the other one, I actually programmed a game that's like a 3D Tetris."}, {"time": 7172, "text": "It turned out to be a super hard game to play."}, {"time": 7175, "text": "Because instead of just the standard 2D Tetris, it's actually a 3D thing."}, {"time": 7180, "text": "But I realized, wow, I just had these ideas to try it out, and then, yeah, you can just do it."}, {"time": 7188, "text": "And so that's when I realized, wow, this is amazing."}, {"time": 7193, "text": "Yeah, you can create yourself."}, {"time": 7195, "text": "Yes, yes, exactly."}, {"time": 7197, "text": "From nothing to something that's actually out in the real world."}, {"time": 7201, "text": "So let me ask..."}, {"time": 7202, "text": "Right, I think with your own hands."}, {"time": 7203, "text": "Let me ask a silly question, or maybe the ultimate question."}, {"time": 7207, "text": "What is to you the meaning of life?"}, {"time": 7211, "text": "What gives your life meaning, purpose, fulfillment, happiness, joy?"}, {"time": 7219, "text": "Okay, these are two different questions."}, {"time": 7221, "text": "Very different, yeah."}, {"time": 7222, "text": "It's usually that you ask this question."}, {"time": 7224, "text": "Maybe this question is probably the question that has followed me and followed my life the most."}, {"time": 7232, "text": "Have you discovered anything, any satisfactory answer for yourself?"}, {"time": 7238, "text": "Is there something you've arrived at?"}, {"time": 7241, "text": "You know, there's a moment..."}, {"time": 7244, "text": "I've talked to a few people who have faced, for example, a cancer diagnosis, or faced their own mortality, and that seems to change their view of them."}, {"time": 7253, "text": "It seems to be a catalyst for them removing most of the crap."}, {"time": 7259, "text": "Of seeing that most of what they've been doing is not that important, and really reducing it into saying, like, here's actually the few things that really give meaning."}, {"time": 7271, "text": "Mortality is a really powerful catalyst for that, it seems like."}, {"time": 7275, "text": "Facing mortality, whether it's your parents dying or somebody close to you dying, or facing your own death for whatever reason, or cancer and so on."}, {"time": 7283, "text": "So yeah, so in my own case, I didn't need to face mortality, too."}, {"time": 7288, "text": "So try to ask that question."}, {"time": 7295, "text": "And I think there are a couple things."}, {"time": 7298, "text": "So one is, like, who should be defining the meaning of your life, right?"}, {"time": 7304, "text": "Is there some kind of even greater things than you who should define the meaning of your life?"}, {"time": 7311, "text": "So for example, when people say that searching the meaning for your life, is there some outside voice, or is there something outside of you who actually tells you, you know..."}, {"time": 7326, "text": "So people talk about, oh, you know, this is what you have been born to do, right?"}, {"time": 7334, "text": "Like, this is your destiny."}, {"time": 7339, "text": "So who, right, so that's one question, like, who gets to define the meaning of your life?"}, {"time": 7344, "text": "Should you be finding some other things, some other factor to define this for you?"}, {"time": 7350, "text": "Or is something actually, it's just entirely what you define yourself, and it can be very arbitrary."}, {"time": 7357, "text": "Yeah, so an inner voice or an outer voice, whether it could be spiritual or religious, too, with God, or some other components of the environment outside of you, or just your own voice."}, {"time": 7370, "text": "Do you have an answer there?"}, {"time": 7372, "text": "So, okay, so for that, I have an answer."}, {"time": 7375, "text": "And through, you know, the long period of time of thinking and searching, even searching through outsides, right, you know, voices or factors outside of me."}, {"time": 7388, "text": "So that, I have an answer."}, {"time": 7389, "text": "I've come to the conclusion and realization that it's you yourself that defines the meaning of life."}, {"time": 7398, "text": "Yeah, that's a big burden, though, isn't it?"}, {"time": 7400, "text": "I mean, yes and no, right?"}, {"time": 7406, "text": "So then you have the freedom to define it."}, {"time": 7409, "text": "And another question is, like, what does it really mean by the meaning of life?"}, {"time": 7419, "text": "And also, whether the question even makes sense."}, {"time": 7425, "text": "Absolutely, and you said it somehow distinct from happiness."}, {"time": 7429, "text": "So meaning is something much deeper than just any kind of emotional, any kind of contentment or joy or whatever."}, {"time": 7437, "text": "It might be much deeper."}, {"time": 7438, "text": "And then you have to ask, what is deeper than that?"}, {"time": 7442, "text": "What is there at all?"}, {"time": 7444, "text": "And then the question starts being silly."}, {"time": 7447, "text": "Right, and also you can say it's deeper, but you can also say it's shallower, depending on how people want to define the meaning of their life."}, {"time": 7454, "text": "So for example, most people don't even think about this question."}, {"time": 7457, "text": "Then the meaning of life to them doesn't really matter that much."}, {"time": 7462, "text": "And also, whether knowing the meaning of life, whether it actually helps your life to be better or whether it helps your life to be happier, these actually are open questions."}, {"time": 7474, "text": "It's not, right?"}, {"time": 7476, "text": "Of course, most questions are open."}, {"time": 7477, "text": "I tend to think that just asking the question, as you mentioned, as you've done for a long time, is the only, that there is no answer."}, {"time": 7484, "text": "And asking the question is a really good exercise."}, {"time": 7487, "text": "I mean, I have this, for me personally, I've had a kind of feeling that creation is, like for me has been very fulfilling."}, {"time": 7498, "text": "And it seems like my meaning has been to create."}, {"time": 7500, "text": "And I'm not sure what that is."}, {"time": 7502, "text": "Like I don't have, I'm single and I don't have kids."}, {"time": 7505, "text": "I'd love to have kids, but I also, sounds creepy, but I also see sort of, you said see programs."}, {"time": 7513, "text": "I see programs as little creations."}, {"time": 7515, "text": "I see robots as little creations."}, {"time": 7519, "text": "I think those bring, and then ideas, theorems are creations."}, {"time": 7525, "text": "And those somehow intrinsically, like you said, bring me joy."}, {"time": 7529, "text": "I think they do to a lot of, at least scientists, but I think they do to a lot of people."}, {"time": 7534, "text": "So that, to me, if I had to force the answer to that, I would say creating new things yourself."}, {"time": 7543, "text": "For you."}, {"time": 7544, "text": "For me, for me, for me."}, {"time": 7545, "text": "I don't know, but like you said, it keeps changing."}, {"time": 7548, "text": "Is there some answer that?"}, {"time": 7549, "text": "And some people, they can, I think, they may say it's experience, right?"}, {"time": 7554, "text": "Like their meaning of life, they just want to experience to the richest and fullest they can."}, {"time": 7559, "text": "And a lot of people do take that path."}, {"time": 7562, "text": "Yes, seeing life as actually a collection of moments and then trying to make the richest possible sets, fill those moments with the richest possible experiences."}, {"time": 7574, "text": "And for me, I think it's certainly, we do share a lot of similarity here."}, {"time": 7578, "text": "So creation is also really important for me, even from the things I've already talked about, even like writing papers, and these are all creations as well."}, {"time": 7590, "text": "And I have not quite thought whether that is really the meaning of my life."}, {"time": 7594, "text": "Like in a sense, also then maybe like, what kind of things should you create?"}, {"time": 7598, "text": "There are so many different things that you could create."}, {"time": 7602, "text": "And also you can say, another view is maybe growth."}, {"time": 7606, "text": "It's related, but different from experience."}, {"time": 7610, "text": "Growth is also maybe type of meaning of life."}, {"time": 7613, "text": "It's just, you try to grow every day, try to be a better self every day."}, {"time": 7619, "text": "And also ultimately, we are here, it's part of the overall evolution."}, {"time": 7629, "text": "Right, the world is evolving and it's growing."}, {"time": 7631, "text": "Isn't it funny that the growth seems to be the more important thing than the thing you're growing towards."}, {"time": 7638, "text": "It's like, it's not the goal, it's the journey to it."}, {"time": 7641, "text": "It's almost when you submit a paper, there's a sort of depressing element to it, not to submit a paper, but when that whole project is over."}, {"time": 7652, "text": "I mean, there's the gratitude, there's the celebration and so on, but you're usually immediately looking for the next thing or the next step, right?"}]}]