[{"title": "Richard Haier: IQ Tests, Human Intelligence, and Group Differences | Lex Fridman Podcast #302", "id": "hppbxV9C63g", "quotes": [{"time": 470, "text": "And that is the common, that's what's common among all the tests and that's what gets labeled the G factor."}, {"time": 478, "text": "So if you give a diverse battery of mental tests and you extract a G factor from it, that factor usually accounts for around half of the variance."}, {"time": 488, "text": "It's the single biggest factor, but it's not the only factor, but it is the most reliable, it is the most stable, and it seems to be very much influenced by genetics."}, {"time": 503, "text": "It's very hard to change the G factor with training or drugs or anything else."}, {"time": 512, "text": "You don't know how to increase the G factor."}, {"time": 514, "text": "Okay, you said a lot of really interesting things there."}, {"time": 516, "text": "So first, I mean, just to get people used to it in case they're not familiar with this idea, G factor is what we mean."}, {"time": 525, "text": "So often there's this term used IQ, which is the way IQ is used, they really mean G factor in regular conversation."}, {"time": 538, "text": "Because what we mean by IQ, we mean intelligence and what we mean by intelligence, we mean general intelligence and general intelligence in the human mind from a psychology, from a serious rigorous scientific perspective actually means G factor."}, {"time": 553, "text": "So G factor equals intelligence, just in this conversation to define terms."}, {"time": 558, "text": "Okay, so there's this stable thing called G factor."}, {"time": 562, "text": "You said, now factor, you said factor many times, means a measure that potentially could be reduced to a single number across the different factors you mentioned."}, {"time": 577, "text": "And what you said, it accounts for half, halfish."}, {"time": 585, "text": "Accounts for halfish of what?"}, {"time": 586, "text": "Of variance across the different set of tests."}, {"time": 591, "text": "Set of tests, so if you do for some reason well on some set of tests, what does that mean?"}, {"time": 600, "text": "So that means there's some unique capabilities outside of the G factor that might account for that."}, {"time": 605, "text": "And what are those?"}, {"time": 607, "text": "What else is there besides the raw horsepower, the engine inside your mind that generates intelligence?"}, {"time": 613, "text": "There are test taking skills."}, {"time": 616, "text": "There are specific abilities."}, {"time": 620, "text": "Someone might be particularly good at mathematical things, mathematical concepts, even simple arithmetic."}, {"time": 632, "text": "Some people are much better than others."}, {"time": 634, "text": "You might know people who can memorize, and short term memory is another component of this."}, {"time": 642, "text": "Short term memory is one of the cognitive processes that's most highly correlated with the G factor."}, {"time": 651, "text": "So all those things like memory, test taking skills account for variability across the test performances."}, {"time": 662, "text": "But so you can run, but you can't hide from the thing that God gave you."}, {"time": 668, "text": "The genetics, so that G factor, science says that G factor's there."}, {"time": 675, "text": "Each one of us have."}, {"time": 676, "text": "Each one of us has a G factor."}, {"time": 680, "text": "Some have more than others."}, {"time": 681, "text": "I'm getting uncomfortable already."}, {"time": 682, "text": "Well, IQ is a score, and IQ, an IQ score is a very good estimate of the G factor."}, {"time": 692, "text": "You can't measure G directly, there's no direct measure."}, {"time": 696, "text": "You estimate it from these statistical techniques."}, {"time": 699, "text": "But an IQ score is a good estimate, why?"}, {"time": 703, "text": "Because a standard IQ test is a battery of different mental abilities."}, {"time": 708, "text": "You combined it into one score, and that score is highly correlated with the G factor, even if you get better scores on some subtests than others."}, {"time": 720, "text": "Because again, it's what's common to all these mental abilities."}, {"time": 724, "text": "So a good IQ test, and I'll ask you about that, but a good IQ test tries to compress down that battery of tests, like tries to get a nice battery, the nice selection of variable tests into one test."}, {"time": 741, "text": "And so in that way, it sneaks up to this G factor."}, {"time": 744, "text": "And that's another interesting thing about G factor."}, {"time": 748, "text": "Now you give, first of all, you have a great book on the neuroscience of intelligence."}, {"time": 754, "text": "You have a great course, which is when I first learned, you're a great teacher, let me just say."}, {"time": 762, "text": "Your course at the teaching company, I hope I'm saying that correctly."}, {"time": 765, "text": "The Intelligent Brain."}, {"time": 767, "text": "The Intelligent Brain is when I first heard about this G factor, this mysterious thing that lurks in the darkness that we cannot quite shine a light on, we're trying to sneak up on."}, {"time": 779, "text": "So the fact that there's this measure, a stable measure of intelligence, we can't measure directly."}, {"time": 784, "text": "But we can come up with a battery test or one test that includes a battery of variable type of questions that can reliably or attempt to estimate in a stable way that G factor."}, {"time": 801, "text": "That's a fascinating idea."}, {"time": 803, "text": "So for me as an AI person, it's fascinating."}, {"time": 805, "text": "It's fascinating there's something stable like that about the human mind, especially if it's grounded in genetics."}, {"time": 812, "text": "It's both fascinating that as a researcher of the human mind and all the human psychological, sociological, ethical questions that start arising, it makes me uncomfortable."}, {"time": 828, "text": "But truth can be uncomfortable."}, {"time": 831, "text": "I get that a lot about being uncomfortable talking about this."}, {"time": 836, "text": "Let me go back and just say one more empirical thing."}, {"time": 842, "text": "It doesn't matter which battery of tests you use."}, {"time": 848, "text": "So there are countless tests."}, {"time": 850, "text": "You can take any 12 of them at random, extract a G factor and another 12 at random and extract a G factor and those G factors will be highly correlated like over 0.9 with each other."}, {"time": 863, "text": "That's very, so it is a ubiquitous."}, {"time": 866, "text": "It doesn't depend on the content of the test is what I'm trying to say."}, {"time": 870, "text": "It is general among all those tests of mental ability."}, {"time": 874, "text": "And tests of mental, mental abilities include things like, geez, playing poker."}, {"time": 881, "text": "Your skill at poker is not unrelated to G. Your skill at anything that requires reasoning and thinking, anything, spelling, arithmetic, more complex things, this concept is ubiquitous."}, {"time": 900, "text": "And when you do batteries of tests in different cultures, you get the same thing."}, {"time": 905, "text": "So this says something interesting about the human mind that as a computer is designed to be general."}, {"time": 912, "text": "So that means you can, so it's not easily made specialized."}, {"time": 917, "text": "Meaning if you're going to be good at one thing, Miyamoto Musashi has this quote, he's an ancient warrior, famous for the Book of Five Rings in the martial arts world."}, {"time": 930, "text": "And the quote goes, if you know the way broadly, you will see it in everything."}, {"time": 936, "text": "Meaning if you do one thing is going to generalize to everything."}, {"time": 944, "text": "And that's an interesting quote."}, {"time": 946, "text": "And that's an interesting thing about the human mind."}, {"time": 950, "text": "So that's what the G factor reveals."}, {"time": 954, "text": "Okay, so what's the difference, if you can elaborate a little bit further between IQ and G factor?"}, {"time": 960, "text": "Just because it's a source of confusion for people."}, {"time": 963, "text": "And IQ is a score."}, {"time": 965, "text": "People use the word IQ to mean intelligence."}, {"time": 968, "text": "But IQ has a more technical meaning for people who work in the field."}, {"time": 972, "text": "And it's an IQ score, a score on a test that estimates the G factor."}, {"time": 980, "text": "And the G factor is what's common among all these tests of mental ability."}, {"time": 984, "text": "So if you think about, it's not a Venn diagram, but I guess you could make a Venn diagram out of it, but the G factor would be really at the core, what's common to everything."}, {"time": 997, "text": "And what IQ scores do is they allow a rank order of people on the score."}, {"time": 1004, "text": "And this is what makes people uncomfortable."}, {"time": 1006, "text": "This is where there's a lot of controversy about whether IQ tests are biased toward any one group or another."}, {"time": 1014, "text": "And a lot of the answers to these questions are very clear, but they also have a technical aspect of it that's not so easy to explain."}, {"time": 1024, "text": "Well, we'll talk about the fascinating and the difficult things about all of this."}, {"time": 1030, "text": "So by the way, when you say rank order, that means you get a number and that means one person, you can now compare."}, {"time": 1037, "text": "Like you could say that this other person is more intelligent than me."}, {"time": 1043, "text": "Well, what you can say is IQ scores are interpreted really as percentiles."}, {"time": 1049, "text": "So that if you have an IQ of 140 and somebody else has 70, the metric is such that you cannot say the person with an IQ of 140 is twice as smart as a person with an IQ of 70."}, {"time": 1065, "text": "That would require a ratio scale with an absolute zero."}, {"time": 1069, "text": "Now you may think you know people with zero intelligence, but in fact, there is no absolute zero on an IQ scale."}, {"time": 1077, "text": "It's relative to other people."}, {"time": 1081, "text": "So relative to other people, somebody with an IQ score of 140 is in the upper less than 1%, whereas somebody with an IQ of 70 is two standard deviations below the mean."}, {"time": 1095, "text": "That's a different percentile."}, {"time": 1098, "text": "So it's similar to like in chess, you have an ELO rating that's designed to rank order people."}, {"time": 1107, "text": "So you can't say it's twice one person."}, {"time": 1110, "text": "If your ELO rating is twice another person, I don't think you're twice as good at chess."}, {"time": 1115, "text": "It's not stable in that way, but because it's very difficult to do these kinds of comparisons."}, {"time": 1121, "text": "But so what can we say about the number itself?"}, {"time": 1127, "text": "Is that stable across tests and so on, or no?"}, {"time": 1130, "text": "There are a number of statistical properties of any test."}, {"time": 1134, "text": "They're called psychometric properties."}, {"time": 1136, "text": "You have validity, you have reliability, reliability, there are many different kinds of reliability."}, {"time": 1142, "text": "They all essentially measure stability."}, {"time": 1145, "text": "And IQ tests are stable within an individual."}, {"time": 1149, "text": "There are some longitudinal studies where children were measured at age 11."}, {"time": 1155, "text": "And again, when they were 70 years old and the two IQ scores are highly correlated with each other."}, {"time": 1162, "text": "This comes from a fascinating study from Scotland."}, {"time": 1166, "text": "In the 1930s, some researchers decided to get an IQ test on every single child age 11 in the whole country."}, {"time": 1177, "text": "And those records were discovered in an old storeroom at the University of Edinburgh by a friend of mine, Ian Deary, who found the records, digitized them, and has done a lot of research on the people who are still alive today from that original study, including brain imaging research, by the way."}, {"time": 1200, "text": "It really, it's a fascinating group of people who are studied."}, {"time": 1208, "text": "Not to get ahead of the story, but one of the most interesting things they found is a very strong relationship between IQ measured at age 11 and mortality."}, {"time": 1221, "text": "So that, you know, in the 70 years later, they looked at the survival rates and they could get death records from everybody."}, {"time": 1233, "text": "And Scotland has universal healthcare for everybody."}, {"time": 1237, "text": "And it turned out if you divide the people by their age 11 IQ score into quartiles and then look at how many people are alive 70 years later, the, I know this is in the book, I have the graph in the book, but there are essentially twice as many people alive in the highest IQ quartile than in the lowest IQ quartile."}, {"time": 1261, "text": "It's true in men and women."}, {"time": 1266, "text": "So it makes a big difference."}, {"time": 1268, "text": "Now, why this is the case is not so clear since everyone had access to healthcare."}, {"time": 1275, "text": "Well, there's a lot, and we'll talk about it, you know, just the sentences you used now could be explained by nature or nurture."}, {"time": 1286, "text": "Now, there's a lot of science that starts to then dig in and investigate that question."}, {"time": 1291, "text": "But let me linger on the IQ test."}, {"time": 1293, "text": "How are the test design, IQ test design, how do they work?"}, {"time": 1297, "text": "Maybe some examples for people who are not aware."}, {"time": 1299, "text": "What makes a good IQ test question that sneaks up on this G factor measure?"}, {"time": 1308, "text": "Well, your question is interesting because you want me to give examples of items that make good items."}, {"time": 1315, "text": "And what makes a good item is not so much its content, but its empirical relationship to the total score that turns out to be valid by other means."}, {"time": 1327, "text": "So for example, let me give you an odd example from personality testing."}, {"time": 1335, "text": "So there's a personality test called the Minnesota Multiphasic Personality Inventory, MMPI."}, {"time": 1342, "text": "Been around for decades."}, {"time": 1344, "text": "I've heard about this test recently because of the Johnny Depp and Amber Heard trial."}, {"time": 1351, "text": "But they had psychologists."}, {"time": 1352, "text": "I have not been paying attention to it."}, {"time": 1353, "text": "They had psychologists on the stand, and they were talking, apparently those psychologists did, again, I'm learning so much from this trial."}, {"time": 1362, "text": "They did different battery of tests to diagnose personality disorders."}, {"time": 1370, "text": "Apparently there's that systematic way of doing so, and the Minnesota one is one of the ones that there's the most science on."}, {"time": 1379, "text": "There's a lot of great papers, which were all continuously cited on the stand, which is fascinating to watch."}, {"time": 1385, "text": "Sorry, a little bit of attention."}, {"time": 1387, "text": "I mean, this is interesting because you're right."}, {"time": 1388, "text": "It's been around for decades."}, {"time": 1389, "text": "There's a lot of scientific research on the psychometric properties of the test, including what it predicts with respect to different categories of personality disorder."}, {"time": 1402, "text": "But what I wanna mention is the content of the items on that test."}, {"time": 1406, "text": "All of the items are essentially true false items."}, {"time": 1412, "text": "True or false, I prefer a shower to a bath."}, {"time": 1416, "text": "True or false, I think Lincoln was a better president than Washington."}, {"time": 1422, "text": "But what of all these, what does that have to do?"}, {"time": 1427, "text": "And the point is the content of these items, nobody knows why these items in aggregate predict anything, but empirically they do."}, {"time": 1437, "text": "It's a technique of choosing items for a test that is called dust bowl empiricism."}, {"time": 1445, "text": "That the content doesn't matter, but for some reason when you get a criterion group of people with this disorder and you compare them to people without that disorder, these are the items that distinguish, irrespective of content."}, {"time": 1460, "text": "It's a hard concept to grasp."}, {"time": 1462, "text": "Well, first of all, it's fascinating."}, {"time": 1465, "text": "But from, because I consider myself part psychologist because I love human robot interaction, and that's a problem."}, {"time": 1476, "text": "Half of that problem is a psychology problem because there's a human."}, {"time": 1481, "text": "So designing these tests to get at the questions is the fascinating part."}, {"time": 1486, "text": "Like how do you get to, like what does dust bowl empiricism refer to?"}, {"time": 1492, "text": "Does it refer to the final result?"}, {"time": 1497, "text": "Yeah, so it's the test is dust bowl empiricism."}, {"time": 1501, "text": "But how do you arrive at the battery of questions?"}, {"time": 1504, "text": "I presume one of the things, now again, I'm going to the excellent testimony in that trial, they explain it, because they also, they explain the tests."}, {"time": 1516, "text": "That a bunch of the questions are kind of make you forget that you're taking a test."}, {"time": 1524, "text": "Like it makes it very difficult for you to somehow figure out what you're supposed to answer."}, {"time": 1531, "text": "Yes, it's called social desirability."}, {"time": 1534, "text": "But we're getting a little far afield because I only wanted to give that example of dust bowl empiricism."}, {"time": 1540, "text": "When we talk about the items on an IQ test, many of those items in the dust bowl empiricism method have no face validity."}, {"time": 1552, "text": "In other words, they don't look like they measure anything."}, {"time": 1557, "text": "Whereas most intelligence tests, the items actually look like they're measuring some mental ability."}, {"time": 1563, "text": "So here's one of the."}, {"time": 1565, "text": "So you were bringing that up as an example as what it is not."}, {"time": 1570, "text": "So I don't want to go too far afield on it."}, {"time": 1572, "text": "Too far afield is actually one of the names of this podcast."}, {"time": 1576, "text": "So I should mention that."}, {"time": 1581, "text": "Yeah, so anyway, sorry."}, {"time": 1582, "text": "So they feel the questions look like they pass the face validity test."}, {"time": 1588, "text": "And some more than others."}, {"time": 1589, "text": "So for example, let me give you a couple of things here."}, {"time": 1592, "text": "If I, one of the subtests on a standard IQ test is general information."}, {"time": 1600, "text": "Let me just think a little bit because I don't want to give you the actual item."}, {"time": 1604, "text": "But if I said, how far is it between Washington DC and Miami, Florida?"}, {"time": 1612, "text": "Within 500 miles plus or minus."}, {"time": 1615, "text": "Well, you know, it's not a fact most people memorize, but you know something about geography."}, {"time": 1622, "text": "You say, well, I flew there once."}, {"time": 1624, "text": "I know planes fly for 500 miles."}, {"time": 1626, "text": "You know, you can kind of make an estimate."}, {"time": 1630, "text": "But it's also seems like it would be very cultural, you know, so there's that kind of general information."}, {"time": 1640, "text": "Then there's vocabulary test."}, {"time": 1642, "text": "What does regatta mean?"}, {"time": 1647, "text": "And I choose that word because that word was removed from the IQ test because people complained that disadvantaged people would not know that word just from their everyday life."}, {"time": 1661, "text": "Okay, here's another example from a different kind of subtest on."}, {"time": 1666, "text": "What's regatta, by the way?"}, {"time": 1668, "text": "Regatta is a. I think I'm disadvantaged."}, {"time": 1671, "text": "A sailing competition, a competition with boats."}, {"time": 1674, "text": "Not necessarily sailing, but a competition with boats."}, {"time": 1678, "text": "Yep, yep, I'm probably disadvantaged in that way."}, {"time": 1682, "text": "Okay, excellent, so that was removed anyway you were saying."}, {"time": 1684, "text": "Okay, so here's another subtest."}, {"time": 1687, "text": "I'm gonna repeat a string of numbers, and when I'm done, I want you to repeat them back to me."}, {"time": 1692, "text": "Ready?"}, {"time": 1693, "text": "Okay, seven, four, two, eight, one, six."}, {"time": 1701, "text": "That's way too many."}, {"time": 1702, "text": "Seven, four, two, eight, one, six."}, {"time": 1705, "text": "Okay, you get the idea."}, {"time": 1706, "text": "Now the actual test starts with a smaller number, like two numbers, and then as people get it right, you keep going, adding to the string of numbers until they can't do it anymore."}, {"time": 1718, "text": "Okay, but now try this."}, {"time": 1720, "text": "I'm gonna say some numbers, and when I'm done, I want you to repeat them to me backwards."}, {"time": 1726, "text": "I quit."}, {"time": 1727, "text": "Okay, now, so I gave you some examples of the kind of items on an IQ test."}, {"time": 1733, "text": "General information, I can't even remember all, general information, vocabulary, digit span forward and digit span backward."}, {"time": 1746, "text": "Well, you said I can't even remember them."}, {"time": 1748, "text": "That's a good question for me."}, {"time": 1751, "text": "What does memory have to do with GFactor?"}, {"time": 1753, "text": "Okay, well, let's hold on."}, {"time": 1756, "text": "Let's just talk about these examples."}, {"time": 1759, "text": "Now, some of those items seem very cultural, and others seem less cultural."}, {"time": 1771, "text": "Which ones do you think, scores on which subtest are most highly correlated with the GFactor?"}, {"time": 1779, "text": "Well, the intuitive answer is less cultural."}, {"time": 1782, "text": "Well, it turns out vocabulary is highly correlated, and it turns out that digit span backwards is highly correlated."}, {"time": 1795, "text": "How do you figure?"}, {"time": 1798, "text": "Now you have decades of research to answer the question, how do you figure?"}, {"time": 1847, "text": "But that's loading the memory, so there's like research around stably what that means about the human mind, and here you're saying recall backwards is a good protector."}, {"time": 1861, "text": "Yeah, so you have to do some, like you have to load that into your brain, and not just remember it, but do something with it."}, {"time": 1871, "text": "Right, here's another example of a different kind of test called the Hick paradigm, and it's not verbal at all."}, {"time": 1878, "text": "It's a little box, and there are a series of lights arranged in a semi circle at the top of the box, and then there's a home button that you press, and when one of the lights goes on, there's a button next to each of those lights, you take your finger off the home button, and you just press the button next to the light that goes on, and so it's a very simple reaction time."}, {"time": 1906, "text": "Light goes on, as quick as you can, you press the button, and you get a reaction time from the moment you lift your finger off the button to when you press the button where the light is."}, {"time": 1918, "text": "That reaction time doesn't really correlate with IQ very much, but if you change the instructions, and you say three lights are gonna come on simultaneously, I want you to press the button next to the light that's furthest from the other two."}, {"time": 1939, "text": "So maybe lights one and two go on, and light six goes on simultaneously."}, {"time": 1944, "text": "You take your finger off, and you would press the button by light six."}, {"time": 1948, "text": "That's that reaction time to a more complex task."}, {"time": 1954, "text": "It's not really hard."}, {"time": 1956, "text": "Almost everybody gets it all right, but your reaction time to that is highly correlated with the G factor."}, {"time": 1965, "text": "So reaction time, so there's a temporal aspect to this."}, {"time": 1968, "text": "So what role does time?"}, {"time": 1970, "text": "Speed of processing."}, {"time": 1970, "text": "It's the speed of processing."}, {"time": 1973, "text": "Is this also true for ones that take longer, like five, 10, 30 seconds?"}, {"time": 1978, "text": "Is time part of the measure with some of these things?"}, {"time": 1981, "text": "Yes, and that is why some of the best IQ tests have a time limit, because if you have no time limit, people can do better, but it doesn't distinguish among people that well."}, {"time": 1997, "text": "So that adding the time element is important."}, {"time": 2001, "text": "So speed of information processing, and reaction time is a measure of speed of information processing, turns out to be related to the G factor."}, {"time": 2011, "text": "But the G factor only accounts for maybe half or some amount on the test performance."}, {"time": 2017, "text": "For example, I get pretty bad test anxiety."}, {"time": 2022, "text": "Like I was never, I mean, I just don't enjoy tests."}, {"time": 2027, "text": "I enjoy going back into my cave and working."}, {"time": 2031, "text": "Like I've always enjoyed homework way more than tests, no matter how hard the homework is, because I can go back to the cave and hide away and think deeply."}, {"time": 2040, "text": "There's something about being watched and having a time limit that really makes me anxious, and I can just see the mind not operating optimally at all."}, {"time": 2050, "text": "But you're saying underneath there, there's still a G factor, there's still."}, {"time": 2053, "text": "No question, there's no question."}, {"time": 2056, "text": "Boy."}, {"time": 2057, "text": "And if you get anxious taking the test, many people say, oh, I didn't do well, because I'm anxious."}, {"time": 2063, "text": "I hear that a lot."}, {"time": 2064, "text": "Say, well, fine, if you're really anxious during the test, the score will be a bad estimate of your G factor."}, {"time": 2072, "text": "It doesn't mean the G factor isn't there."}, {"time": 2074, "text": "And by the way, standardized tests like the SAT, they're essentially intelligence tests."}, {"time": 2083, "text": "They are highly G loaded."}, {"time": 2085, "text": "Now, the people who make the SAT don't wanna mention that."}, {"time": 2090, "text": "They have enough trouble justifying standardized testing, but to call it an intelligence test is really beyond the pale."}, {"time": 2098, "text": "But in fact, it's so highly correlated, because it's a reasoning test."}, {"time": 2103, "text": "SAT is a reasoning test, a verbal reasoning, mathematical reasoning."}, {"time": 2108, "text": "And if it's a reasoning test, it has to be related to G. But if people go in and take a standardized test, whether it's an IQ test or the SAT, and they happen to be sick that day with 102 fever, the score is not going to be a good estimate of their G. If they retake the test when they're not anxious or less anxious or don't have a fever, the score will go up, and that will be a better estimate."}, {"time": 2139, "text": "But you can't say their G factor increased between the two tests."}, {"time": 2146, "text": "So the question is how wide of a battery of tests is required to estimate the G factor well?"}, {"time": 2153, "text": "Because I'll give you as my personal example, I took the SAT in, I think it was called the ACT, where I was two, also, I took SAT many times."}, {"time": 2162, "text": "Every single time, I got it perfect on math."}, {"time": 2165, "text": "And verbal, the time limit on the verbal made me very anxious."}, {"time": 2170, "text": "I did not, I mean, part of it, I didn't speak English very well."}, {"time": 2174, "text": "But honestly, it was like you're supposed to remember stuff, and I was so anxious."}, {"time": 2178, "text": "And as I'm reading, I'm sweating, I can't, you know that feeling you have when you're reading a book and you just read a page and you know nothing about what you've read because you zoned out."}, {"time": 2192, "text": "That's the same feeling of like, I can't, I have to, you're like, nope, read and understand."}, {"time": 2199, "text": "And that anxiety is like, and you start seeing like the typography versus the content of the words."}, {"time": 2207, "text": "Like that was, I don't, it's interesting because I know that what they're measuring, I could see being correlated with something."}, {"time": 2218, "text": "But that anxiety or some aspect of the performance sure plays a factor."}, {"time": 2227, "text": "And I wonder how you sneak up in a stable way."}, {"time": 2230, "text": "I mean, this is a broader discussion about like standardized testing, how you sneak up, how you get at the fact that I'm super anxious and still nevertheless measure some aspect of my ontology."}, {"time": 2243, "text": "I wonder, I don't know."}, {"time": 2244, "text": "I don't know if you can say to that, that time limit sure is a pain."}, {"time": 2248, "text": "Well, let me say this."}, {"time": 2250, "text": "There are two ways to approach the very real problem that you say that some people just get anxious or not good test takers."}, {"time": 2258, "text": "By the way, part of testing is you know the answer, you can figure out the answer or you can't."}, {"time": 2269, "text": "If you don't know the answer, there are many reasons you don't know the answer at that particular moment."}, {"time": 2275, "text": "You may have learned it once and forgotten it."}, {"time": 2278, "text": "It may be on the tip of your tongue and you just can't get it because you're anxious about the time limit."}, {"time": 2283, "text": "You may never have learned it."}, {"time": 2285, "text": "You may have been exposed to it, but it was too complicated and you couldn't learn it."}, {"time": 2291, "text": "I mean, there are all kinds of reasons here."}, {"time": 2293, "text": "But for an individual to interpret your scores as an individual, whoever is interpreting the score has to take into account various things that would affect your individual score."}, {"time": 2309, "text": "And that's why decisions about college admission or anything else where tests are used are hardly ever the only criterion to make a decision."}, {"time": 2322, "text": "And I think people are, college admissions letting go of that very much."}, {"time": 2326, "text": "Oh yes, yeah."}, {"time": 2328, "text": "But what does that even mean?"}, {"time": 2331, "text": "Because is it possible to design standardized tests that do get, that are useful to college admissions?"}, {"time": 2338, "text": "Well, they already exist."}, {"time": 2339, "text": "The SAT is highly correlated with many aspects of success at college."}, {"time": 2345, "text": "Here's the problem."}, {"time": 2346, "text": "So maybe you could speak to this."}, {"time": 2349, "text": "The correlation across the population versus individuals."}, {"time": 2353, "text": "So our criminal justice system is designed to make sure, wow, it's still, there's tragic cases where innocent people go to jail, but you try to avoid that."}, {"time": 2371, "text": "And the same way with testing, it just, it would suck for an SAT to miss genius."}, {"time": 2378, "text": "Yes, and it's possible, but it's statistically unlikely."}, {"time": 2383, "text": "So it really comes down to which piece of information maximizes your decision making ability."}, {"time": 2398, "text": "So if you just use high school grades, it's okay."}, {"time": 2405, "text": "But you will miss some people who just don't do well in high school, but who are actually pretty smart, smart enough to be bored silly in high school, and they don't care, and their high school GPA isn't that good."}, {"time": 2417, "text": "So you will miss them in the same sense that somebody who could be very able and ready for college just doesn't do well on their SAT."}, {"time": 2428, "text": "This is why you make decisions with taking in a variety of information."}, {"time": 2436, "text": "The other thing I wanted to say, I talked about when you make a decision for an individual, statistically for groups, there are many people who have a disparity between their math score and their verbal score."}, {"time": 2453, "text": "That disparity, or the other way around, that disparity is called tilt."}, {"time": 2458, "text": "The score is tilted one way or the other."}, {"time": 2461, "text": "And that tilt has been studied empirically to see what that predicts."}, {"time": 2467, "text": "And in fact, you can't make predictions about college success based on tilt."}, {"time": 2474, "text": "And mathematics is a good example."}, {"time": 2476, "text": "There are many people, especially non native speakers of English who come to this country, take the SATs, do very well on the math and not so well on the verbal."}, {"time": 2486, "text": "Well, if they're applying to a math program, the professors there who are making the decision or the admissions officers don't wait so much to score on verbal, especially if it's a non native speaker."}, {"time": 2502, "text": "Well, so yeah, you have to try to, in the admission process, bring in the context."}, {"time": 2507, "text": "But non native isn't really the problem."}, {"time": 2510, "text": "I mean, that was part of the problem for me."}, {"time": 2513, "text": "But it's the anxiety was, which it's interesting."}, {"time": 2519, "text": "Oh boy, reducing yourself down to numbers."}, {"time": 2526, "text": "But it's still true."}, {"time": 2527, "text": "It's still the truth."}, {"time": 2529, "text": "It's a painful truth."}, {"time": 2530, "text": "That same anxiety that led me to be, to struggle with the SAT verbal tests is still within me in all ways of life."}, {"time": 2544, "text": "So maybe that's not anxiety."}, {"time": 2546, "text": "Maybe that's something, like personality is also pretty stable."}, {"time": 2552, "text": "Personality is stable."}, {"time": 2554, "text": "Personality does impact the way you navigate life."}, {"time": 2562, "text": "Yeah, and we should say that the G factor in intelligence is not just about some kind of number on a paper."}, {"time": 2570, "text": "It also has to do with how you navigate life."}, {"time": 2573, "text": "How easy life is for you in this very complicated world."}, {"time": 2580, "text": "So personality's all tied into that in some deep fundamental way."}, {"time": 2585, "text": "But now you've hit the key point about why we even want to study intelligence."}, {"time": 2591, "text": "And personality, I think, to a lesser extent."}, {"time": 2593, "text": "But that's my interest, is more on intelligence."}, {"time": 2597, "text": "I went to graduate school and wanted to study personality, but that's kind of another story how I got kind of shifted from personality research over to intelligence research."}, {"time": 2607, "text": "Because it's not just a number."}, {"time": 2610, "text": "Intelligence is not just an IQ score."}, {"time": 2612, "text": "It's not just an SAT score."}, {"time": 2614, "text": "It's what those numbers reflect about your ability to navigate everyday life."}, {"time": 2623, "text": "It has been said that life is one long intelligence test."}, {"time": 2628, "text": "And who can't relate to that?"}, {"time": 2635, "text": "And if you doubt, see, another problem here is a lot of critics of intelligence research, intelligence testing, tend to be academics who, by and large, are pretty smart people."}, {"time": 2647, "text": "And pretty smart people, by and large, have enormous difficulty understanding what the world is like for people with IQs of 80 or 75."}, {"time": 2658, "text": "It is a completely different everyday experience."}, {"time": 2663, "text": "Even IQ scores of 85, 90."}, {"time": 2667, "text": "You know, there's a popular television program, Judge Judy."}, {"time": 2672, "text": "Judge Judy deals with everyday people with everyday problems, and you can see the full range of problem solving ability demonstrated there."}, {"time": 2683, "text": "And sometimes she does it for laughs, but it really isn't funny because people who are, there are people who are very limited in their life navigation, let alone success, by not having good reasoning skills, which cannot be taught."}, {"time": 2705, "text": "We know this, by the way, because there are many efforts."}, {"time": 2707, "text": "You know, the United States military, which excels at training people, I mean, I don't know that there's a better organization in the world for training diverse people, and they won't take people with IQs under, I think, 83 is the cutoff, because they have found they are unable to train people with lower IQs to do jobs in the military."}, {"time": 2732, "text": "So one of the things that G Factor has to do is learning."}, {"time": 2735, "text": "Absolutely, some people learn faster than others."}, {"time": 2740, "text": "Some people learn more than others."}, {"time": 2743, "text": "Now, faster, by the way, is not necessarily better, as long as you get to the same place eventually."}, {"time": 2751, "text": "But, you know, there are professional schools that want students who can learn the fastest because they can learn more or learn better."}, {"time": 2761, "text": "Or learn deeper, or all kinds of ideas about why you select people with the highest scores."}, {"time": 2769, "text": "And there's nothing funnier, by the way, to listen to a bunch of academics complain about the concept of intelligence and intelligence testing, and then you go to a faculty meeting where they're discussing who to hire among the applicants."}, {"time": 2784, "text": "And all they talk about is how smart the person is."}, {"time": 2788, "text": "We'll get to that, we'll sneak up to that in different ways, but there's something about reducing a person to a number that in part is grounded to the person's genetics that makes people very uncomfortable."}, {"time": 2798, "text": "But nobody does that."}, {"time": 2800, "text": "Nobody in the field actually does that."}, {"time": 2803, "text": "That is a worry that is a worry like, well, I don't wanna call it a conspiracy theory."}, {"time": 2815, "text": "I mean, it's a legitimate worry, but it just doesn't happen."}, {"time": 2821, "text": "Now, I had a professor in graduate school who was the only person I ever knew who considered the students only by their test scores."}, {"time": 2832, "text": "And later in his life, he kind of backed off that."}, {"time": 2839, "text": "Let me ask you this, so we'll jump around, I'll come back to it, but I tend to, I've had like political discussions with people and actually my friend Michael Malice, he's an anarchist."}, {"time": 2856, "text": "I disagree with him on basically everything except the fact that love is a beautiful thing in this world."}, {"time": 2867, "text": "And he says this test about left versus right, whatever, it doesn't matter what the test is, but he believes, the question is, do you believe that some people are better than others?"}, {"time": 2880, "text": "Question is ambiguous."}, {"time": 2883, "text": "Do you believe some people are better than others?"}, {"time": 2886, "text": "And to me, sort of the immediate answer is no."}, {"time": 2891, "text": "It's a poetic question, it's an ambiguous question, right?"}, {"time": 2895, "text": "Like people wanna maybe the temptation to ask better at what, better at like sports and so on."}, {"time": 2903, "text": "No, to me, I stand with the sort of defining documents of this country, which is all men are created equal."}, {"time": 2912, "text": "There's a basic humanity."}, {"time": 2914, "text": "And there's something about tests of intelligence."}, {"time": 2919, "text": "Just knowing that some people are different, like the science of intelligence that shows that some people are genetically in some stable way across a lifetime, have a greater intelligence than others, makes people feel like some people are better than others."}, {"time": 2941, "text": "And that makes them very uncomfortable."}, {"time": 2943, "text": "And I, maybe you can speak to that."}, {"time": 2946, "text": "The fact that some people are more intelligent than others in a way that's, cannot be compensated through education, through anything you do in life."}, {"time": 2964, "text": "Okay, there's a lot there."}, {"time": 2966, "text": "We haven't really talked about the genetics of it yet."}, {"time": 2969, "text": "But you are correct in that it is my interpretation of the data that genetics has a very important influence on the G factor."}, {"time": 2981, "text": "And this is controversial, and we can talk about it, but if you think that genetics, that genes are deterministic, are always deterministic, that leads to kind of the worry that you expressed."}, {"time": 2995, "text": "But we know now in the 21st century that many genes are not deterministic, that are probabilistic, meaning their gene expression can be influenced."}, {"time": 3009, "text": "Now, whether they're influenced only by other biological variables or other genetic variables or environmental or cultural variables, that's where the controversy comes in."}, {"time": 3023, "text": "And we can discuss that in more detail if you like."}, {"time": 3027, "text": "But to go to the question about better, are people better?"}, {"time": 3031, "text": "There's zero evidence that smart people are better with respect to important aspects of life, like honesty, even likability."}, {"time": 3047, "text": "I'm sure you know many very intelligent people who are not terribly likable or terribly kind or terribly honest."}, {"time": 3055, "text": "Is there something to be said?"}, {"time": 3056, "text": "So one of the things I've recently reread for the second time, I guess that's what the word reread means, the rise and fall of the Third Reich, which is, I think, the best telling of the rise and fall of Hitler."}, {"time": 3074, "text": "And one of the interesting things about the people that, how should I say it?"}, {"time": 3087, "text": "Justified or maybe propped up the ideas that Hitler put forward is the fact that they were extremely intelligent."}, {"time": 3098, "text": "They were the intellectual class."}, {"time": 3101, "text": "They were like, it was obvious that they thought very deeply and rationally about the world."}, {"time": 3109, "text": "So what I would like to say is one of the things that shows to me is some of the worst atrocities in the history of humanity have been committed by very intelligent people."}, {"time": 3120, "text": "So that means that intelligence doesn't make you a good person."}, {"time": 3126, "text": "I wonder if there's a G factor for intelligence."}, {"time": 3132, "text": "I wonder if there's a G factor for goodness."}, {"time": 3136, "text": "The Nietzschean good and evil, of course that's probably harder to measure because it's such a subjective thing what it means to be good."}, {"time": 3145, "text": "And even the idea of evil is a deeply uncomfortable thing because how do we know?"}, {"time": 3151, "text": "But it's independent, whatever it is, it's independent of intelligence."}, {"time": 3155, "text": "So I agree with you about that."}, {"time": 3157, "text": "But let me say this."}, {"time": 3159, "text": "I have also asserted my belief that more intelligence is better than less."}, {"time": 3169, "text": "That doesn't mean more intelligent people are better people but all things being equal, would you like to be smarter or less smart?"}, {"time": 3178, "text": "So if I had a pill, I have two pills."}, {"time": 3181, "text": "I said, this one will make you smarter, this one will make you dumber."}, {"time": 3184, "text": "Which one would you like?"}, {"time": 3186, "text": "Are there any circumstances under which you would choose to be dumber?"}, {"time": 3191, "text": "That's a very nuanced and interesting question."}, {"time": 3196, "text": "There's been books written about this, right?"}, {"time": 3199, "text": "Now we'll return to the hard questions, the interesting questions, but let me ask about human happiness."}, {"time": 3205, "text": "Does intelligence lead to happiness?"}, {"time": 3211, "text": "So, okay, so back to the pill then."}, {"time": 3214, "text": "So when would you take the pill?"}, {"time": 3218, "text": "So you said IQ 80, 90, 100, 110, you start going through the quartiles and is it obvious?"}, {"time": 3230, "text": "Isn't there diminishing returns and then it starts becoming negative?"}, {"time": 3237, "text": "This is an empirical question."}, {"time": 3240, "text": "And so that I have advocated in many forums more research on enhancing the G factor."}, {"time": 3251, "text": "Right now there have been many claims about enhancing intelligence with, you mentioned the NBAC training, it was a big deal a few years ago, it doesn't work."}, {"time": 3262, "text": "Data is very clear, it does not work."}, {"time": 3265, "text": "Or doing like memory tests, like training and so on."}, {"time": 3268, "text": "Yeah, it may give you a better memory in the short run, but it doesn't impact your G factor."}, {"time": 3278, "text": "It was very popular a couple of decades ago that the idea that listening to Mozart could make you more intelligent."}, {"time": 3286, "text": "There was a paper published on this with somebody I knew published this paper, and intelligence researchers never believed it for a second."}, {"time": 3294, "text": "Been hundreds of studies, all the meta analyses, all the summaries and so on, show that there's nothing to it, nothing to it at all."}, {"time": 3305, "text": "But wouldn't it be something, wouldn't it be world shaking if you could take the normal distribution of intelligence, which we haven't really talked about yet, but IQ scores and the G factor is thought to be a normal distribution, and shift it to the right so that everybody is smarter?"}, {"time": 3330, "text": "Even a half a standard deviation would be world shaking, because there are many social problems, many, many social problems that are exacerbated by people with lower ability to reason stuff out and navigate everyday life."}, {"time": 3352, "text": "I wonder if there's a threshold."}, {"time": 3353, "text": "So maybe I would push back and say universal shifting of the normal distribution may not be the optimal way of shifting."}, {"time": 3365, "text": "Maybe it's better to, whatever the asymmetric kind of distributions is like really pushing the lower up versus trying to make the people at the average more intelligent."}, {"time": 3379, "text": "So you're saying that if in fact there was some way to increase G, let's just call it metaphorically a pill, an IQ pill, we should only give it to people at the lower end."}, {"time": 3390, "text": "No, it's just intuitively I can see that life becomes easier at the lower end if it's increased."}, {"time": 3399, "text": "It becomes less and less, it is an empirical scientific question, but it becomes less and less obvious to me that more intelligence is better."}, {"time": 3410, "text": "At the high end, not because it would make life easier, but it would make whatever problems you're working on more solvable."}, {"time": 3422, "text": "And if you are working on artificial intelligence, there's a tremendous potential for that to improve society."}, {"time": 3434, "text": "So at whatever problems you're working on, yes."}, {"time": 3439, "text": "But there's also the problem of the human condition."}, {"time": 3441, "text": "There's love, there's fear, and all of those beautiful things that sometimes if you're good at solving problems, you're going to create more problems for yourself."}, {"time": 3452, "text": "It's, I'm not exactly sure."}, {"time": 3454, "text": "So ignorance is bliss is a thing."}, {"time": 3457, "text": "So there might be a place, there might be a sweet spot of intelligence given your environment, given your personality, all of those kinds of things."}, {"time": 3465, "text": "And that becomes less beautifully complicated the more and more intelligent you become."}, {"time": 3470, "text": "But that's a question for literature, not for science perhaps."}, {"time": 3474, "text": "Well, imagine this."}, {"time": 3476, "text": "Imagine there was an IQ pill and it was developed by a private company and they are willing to sell it to you."}, {"time": 3485, "text": "And whatever price they put on it, you are willing to pay it because you would like to be smarter."}, {"time": 3491, "text": "But just before they give you a pill, they give you a disclaimer form to sign."}, {"time": 3500, "text": "Don't hold us, you understand that this pill has no guarantee that your life is going to be better and in fact it could be worse."}, {"time": 3508, "text": "Well, yes, that's how lawyers work."}, {"time": 3512, "text": "But I would love for science to answer the question to try to predict if your life is going to be better or worse when you become more or less intelligent."}, {"time": 3521, "text": "It's a fascinating question about what is the sweet spot for the human condition."}, {"time": 3527, "text": "Some of the things we see as bugs might be actually features, may be crucial to our overall happiness as our limitations might lead to more happiness than less."}, {"time": 3539, "text": "But again, more intelligence is better at the lower end."}, {"time": 3542, "text": "That's more, that's something that's less arguable and fascinating if possible to increase."}, {"time": 3550, "text": "But you know, there's virtually no research that's based on a neuroscience approach to solving that problem."}, {"time": 3557, "text": "All the solutions that have been proposed to solve that problem or to ameliorate that problem are essentially based on the blank slate assumption that enriching the environment, removing barriers, all good things by the way, I'm not against any of those things."}, {"time": 3578, "text": "But there's no empirical evidence that they're going to improve the general reasoning ability or make people more employable."}, {"time": 3587, "text": "Have you read Flowers of Algernon?"}, {"time": 3591, "text": "That's to the question of intelligence and happiness."}, {"time": 3596, "text": "There are many profound aspects of that story."}, {"time": 3599, "text": "It was a film that was very good."}, {"time": 3603, "text": "The film was called Charlie for the younger people who are listening to this."}, {"time": 3608, "text": "You might be able to stream it on Netflix or something, but it was a story about a person with very low IQ who underwent a surgical procedure in the brain and he slowly became a genius."}, {"time": 3624, "text": "And the tragedy of the story is the effect was temporary."}, {"time": 3631, "text": "It's a fascinating story really."}, {"time": 3633, "text": "That goes in contrast to the basic human experience that each of us individually have, but it raises the question of the full range of people you might be able to be given different levels of intelligence."}, {"time": 3648, "text": "You've mentioned the normal distribution."}, {"time": 3654, "text": "There's a book called The Bell Curve written in 1994, written by psychologist Richard Herrnstein and political scientist Charles Murray."}, {"time": 3664, "text": "Why was this book so controversial?"}, {"time": 3668, "text": "This is a fascinating book."}, {"time": 3670, "text": "I know Charles Murray."}, {"time": 3672, "text": "I've had many conversations with him."}, {"time": 3675, "text": "Yeah, what is the book about?"}, {"time": 3676, "text": "The book is about the importance of intelligence in everyday life."}, {"time": 3685, "text": "That's what the book is about."}, {"time": 3687, "text": "It's an empirical book."}, {"time": 3689, "text": "It has statistical analyses of very large databases that show that essentially IQ scores or their equivalent are correlated to all kinds of social problems and social benefits."}, {"time": 3706, "text": "And that in itself is not where the controversy about that book came."}, {"time": 3713, "text": "The controversy was about one chapter in that book."}, {"time": 3717, "text": "And that is a chapter about the average difference in mean scores between black Americans and white Americans."}, {"time": 3726, "text": "And these are the terms that were used in the book at the time and are still used to some extent."}, {"time": 3734, "text": "And historically, or really for decades, it has been observed that disadvantaged groups score on average lower than Caucasians on academic tests, tests of mental ability, and especially on IQ tests."}, {"time": 3760, "text": "And the difference is about a standard deviation, which is about 15 points, which is a substantial difference."}, {"time": 3768, "text": "In the book, Herrnstein and Murray in this one chapter assert clearly and unambiguously that whether this average difference is due to genetics or not, they are agnostic."}, {"time": 3788, "text": "Moreover, they assert they don't care because you wouldn't treat anybody differently knowing if there was a genetic component or not because that's a group average finding."}, {"time": 3800, "text": "Every individual has to be treated as an individual."}, {"time": 3803, "text": "You can't make any assumption about what that person's intellectual ability might be from the fact of a average group difference."}, {"time": 3813, "text": "They're very clear about this."}, {"time": 3814, "text": "Nonetheless, people took away, I'm gonna choose my words carefully because I have a feeling that many critics didn't actually read the book."}, {"time": 3829, "text": "They took away that Herrnstein and Murray were saying that blacks are genetically inferior."}, {"time": 3834, "text": "That was the take home message."}, {"time": 3836, "text": "And if they weren't saying it, they were implying it because they had a chapter that discussed this empirical observation of a difference."}, {"time": 3847, "text": "And isn't this horrible?"}, {"time": 3850, "text": "And so the reaction to that book was incendiary."}, {"time": 3858, "text": "What do we know about from that book and the research beyond about race differences and intelligence?"}, {"time": 3870, "text": "It's still the most incendiary topic in psychology."}, {"time": 3873, "text": "Nothing has changed that."}, {"time": 3875, "text": "Anybody who even discusses it is easily called a racist just for discussing it."}, {"time": 3883, "text": "It's become fashionable to find racism in any discussion like this."}, {"time": 3893, "text": "The short answer to your question is there's been very little actual research on this topic since 19..."}, {"time": 3903, "text": "Since the bell curve."}, {"time": 3905, "text": "Since the bell curve, even before."}, {"time": 3907, "text": "This really became incendiary in 1969 with an article published by an educational psychologist named Arthur Jensen."}, {"time": 3917, "text": "Let's just take a minute and go back to that to see the bell curve in a little bit more historical perspective."}, {"time": 3925, "text": "Arthur Jensen was a educational psychologist at UC Berkeley."}, {"time": 3929, "text": "I knew him as well."}, {"time": 3931, "text": "And in 1969 or 68, the Harvard Educational Review asked him to do a review article on the early childhood education programs that were designed to raise the IQs of minority students."}, {"time": 3954, "text": "This was before the federally funded Head Start program."}, {"time": 3958, "text": "Head Start had not really gotten underway at the time Jensen undertook his review of what were a number of demonstration programs."}, {"time": 3968, "text": "And these demonstration programs were for young children who were around kindergarten age."}, {"time": 3975, "text": "And they were specially designed to be cognitively stimulating, to provide lunches, do all the things that people thought would minimize this average gap of intelligence tests."}, {"time": 3991, "text": "There was a strong belief among virtually all psychologists that the cause of the gap was unequal opportunity due to racism, due to all negative things in the society."}, {"time": 4005, "text": "And if you could compensate for this, the gap would go away."}, {"time": 4011, "text": "So early childhood education back then was called literally compensatory education."}, {"time": 4018, "text": "Jensen looked at these programs."}, {"time": 4020, "text": "He was an empirical guy."}, {"time": 4022, "text": "He understood psychometrics."}, {"time": 4024, "text": "And he wrote a, it was over a hundred page article detailing these programs and the flaws in their research design."}, {"time": 4035, "text": "Some of the programs reported IQ gains of on average five points, but a few reported 10, 20 and even 30 point gains."}, {"time": 4044, "text": "One was called the miracle in Milwaukee."}, {"time": 4048, "text": "That investigator went to jail ultimately for fabricating data."}, {"time": 4053, "text": "But the point is that Jensen wrote an article that said, look, the opening sentence of his article is classic."}, {"time": 4060, "text": "The opening sentence is, I may not quote it exactly right, but it's, we have tried compensatory education and it has failed."}, {"time": 4068, "text": "And he showed that these gains were essentially nothing."}, {"time": 4074, "text": "You couldn't really document empirically any gains at all from these really earnest efforts to increase IQ."}, {"time": 4083, "text": "But he went a step further, a fateful step further."}, {"time": 4088, "text": "He said, not only have these efforts failed, but because they have had essentially no impact, we have to reexamine our assumption that these differences are caused by environmental things that we can address with education."}, {"time": 4104, "text": "We need to consider a genetic influence, whether there's a genetic influence on this group difference."}, {"time": 4112, "text": "So you said that this is one of the more controversial works ever in science."}, {"time": 4116, "text": "I think it's the most infamous paper in all of psychology, I would go on to say."}, {"time": 4121, "text": "Because in 1969, the genetic data was very skimpy on this question, skimpy and controversial."}, {"time": 4129, "text": "It's always been controversial, but it was even skimpy and controversial."}, {"time": 4133, "text": "It's kind of a long story that I go into a little bit in more detail in the book, Neuroscience of Intelligence."}, {"time": 4142, "text": "But to say he was vilified is an understatement."}, {"time": 4146, "text": "I mean, he couldn't talk at the American Psychological Association without bomb threats clearing the lecture hall."}, {"time": 4155, "text": "Campus security watched him all the time."}, {"time": 4158, "text": "They opened his mail."}, {"time": 4160, "text": "He had to retreat to a different address."}, {"time": 4164, "text": "This was one of the earliest kinds, this is before the internet and kind of internet social media mobs."}, {"time": 4175, "text": "But it was that intense."}, {"time": 4178, "text": "And I have written that overnight, after the publication of this article, all intelligence research became radioactive."}, {"time": 4189, "text": "Nobody wanted to talk about it."}, {"time": 4196, "text": "Nobody was doing more research."}, {"time": 4198, "text": "And then the bell curve came along."}, {"time": 4202, "text": "And the Jensen controversy was dying down."}, {"time": 4205, "text": "I have stories that Jensen told me about his interaction with the Nixon White House on this issue."}, {"time": 4210, "text": "I mean, this was like a really big deal."}, {"time": 4214, "text": "It was some unbelievable stories, but he told me this, so I kind of believe these stories."}, {"time": 4220, "text": "Nonetheless."}, {"time": 4221, "text": "25 years later."}, {"time": 4224, "text": "All this silence, basically, saying, nobody wants to do this kind of research."}, {"time": 4232, "text": "There's so much pressure, so much attack against this kind of research."}, {"time": 4236, "text": "And here's sort of a bold, stupid, crazy people that decide to dive right back in."}, {"time": 4244, "text": "I wonder how much discussion that was."}, {"time": 4246, "text": "Do we include this chapter or not?"}, {"time": 4248, "text": "Murray has said they discussed it, and they felt they should include it."}, {"time": 4255, "text": "And they were very careful in the way they wrote it, which did them no good."}, {"time": 4261, "text": "So, as a matter of fact, when the bell curve came out, it was so controversial."}, {"time": 4268, "text": "I got a call from a television show called Nightline."}, {"time": 4273, "text": "It was with a broadcaster called Ted Koppel."}, {"time": 4276, "text": "We had this evening show, I think it was on late at night."}, {"time": 4280, "text": "Talked about news."}, {"time": 4281, "text": "It was a straight up news thing."}, {"time": 4284, "text": "And a producer called and asked if I would be on it to talk about the bell curve."}, {"time": 4291, "text": "And I said, she asked me what I thought about the bell curve as a book."}, {"time": 4296, "text": "And I said, look, it's a very good book."}, {"time": 4298, "text": "It talks about the role of intelligence in society."}, {"time": 4303, "text": "And she said, no, no, what do you think about the chapter on race?"}, {"time": 4307, "text": "That's what we want you to talk about."}, {"time": 4309, "text": "I remember this conversation."}, {"time": 4312, "text": "I said, well, she said, what would you say if you were on TV?"}, {"time": 4318, "text": "And I said, well, what I would say is that it's not at all clear if there's any genetic component to intelligence, any differences."}, {"time": 4333, "text": "But if there were a strong genetic component, that would be a good thing."}, {"time": 4341, "text": "And complete silence on the other end of the phone."}, {"time": 4345, "text": "And she said, well, what do you mean?"}, {"time": 4348, "text": "And I said, well, if it's the more genetic any difference is, the more it's biological."}, {"time": 4355, "text": "And if it's biological, we can figure out how to fix it."}, {"time": 4359, "text": "I see, that's interesting."}, {"time": 4361, "text": "She said, would you say that on television?"}, {"time": 4365, "text": "And so that was the end of that."}, {"time": 4367, "text": "So that's for more like biology is within the reach of science and the environment is a public policy, is social and all those kinds of things."}, {"time": 4385, "text": "From your perspective, whichever one you think is more amenable to solutions in the short term is the one that excites you."}, {"time": 4393, "text": "But you saying that is good, the truth of genetic differences, no matter what, between groups is a painful, harmful, potentially dangerous thing."}, {"time": 4415, "text": "So let me ask you to this question, whether it's bell curve or any research on race differences, can that be used to increase the amount of racism in the world?"}, {"time": 4429, "text": "Can that be used to increase the amount of hate in the world?"}, {"time": 4434, "text": "I've thought about this a lot, not as a scientist, but as a person."}, {"time": 4440, "text": "And my sense is there is such enormous reservoirs of hate and racism that have nothing to do with scientific knowledge of the data, that speak against that."}, {"time": 4459, "text": "That no, I don't wanna give racist groups a veto power over what scientists study."}, {"time": 4467, "text": "If you think that the differences, and by the way, virtually no one disagrees that there are differences in scores, it's all about what causes them and how to fix it."}, {"time": 4479, "text": "So if you think this is a cultural problem, then you must ask the problem, what do you want to change anything about the culture?"}, {"time": 4489, "text": "Or are you okay with the culture?"}, {"time": 4491, "text": "Cause you don't feel it's appropriate to change a person's culture."}, {"time": 4495, "text": "So are you okay with that?"}, {"time": 4497, "text": "And the fact that that may lead to disadvantages in school achievement."}, {"time": 4501, "text": "It's a question."}, {"time": 4502, "text": "If you think it's environmental, what are the environmental parameters that can be fixed?"}, {"time": 4510, "text": "I'll tell you one, lead from gasoline in the atmosphere."}, {"time": 4515, "text": "Lead in paint, lead in water."}, {"time": 4518, "text": "That's an environmental toxin that society has the means to eliminate, and they should."}, {"time": 4525, "text": "Yeah, just to sort of try and define some insights and conclusion to this very difficult topic."}, {"time": 4533, "text": "Is there been research on environment versus genetics, nature versus nurture, on this question of race differences?"}, {"time": 4543, "text": "There is not, no one wants to do this research."}, {"time": 4546, "text": "First of all, it's hard research to do."}, {"time": 4548, "text": "Second of all, it's a minefield."}, {"time": 4550, "text": "No one wants to spend their career on it."}, {"time": 4552, "text": "Tenured people don't want to do it, let alone students."}, {"time": 4556, "text": "The way I talk about it, well, before I tell you the way I talk about it, I want to say one more thing about Jensen."}, {"time": 4565, "text": "He was once asked by a journalist straight out, are you a racist?"}, {"time": 4570, "text": "His answer was very interesting."}, {"time": 4572, "text": "His answer was, I've thought about that a lot, and I've concluded it doesn't matter."}, {"time": 4582, "text": "Now, I know what he meant by this."}, {"time": 4583, "text": "The guts to say that, wow."}, {"time": 4585, "text": "He was a very unusual person."}, {"time": 4587, "text": "I think he had a touch of Asperger's syndrome, to tell you the truth, because I saw him in many circumstances."}, {"time": 4594, "text": "He would be canceled on Twitter immediately with that sentence."}, {"time": 4597, "text": "But what he meant was he had a hypothesis, and with respect to group differences, he called it the default hypothesis."}, {"time": 4607, "text": "He said, whatever factors affect individual intelligence are likely the same factors that affect group differences."}, {"time": 4614, "text": "It was the default."}, {"time": 4615, "text": "But it was a hypothesis."}, {"time": 4618, "text": "It should be tested, and if it turned out empirical tests didn't support the hypothesis, he was happy to move on to something else."}, {"time": 4626, "text": "He was absolutely committed to that scientific ideal, that it's an empirical question, we should look at it, and let's see what happens."}, {"time": 4638, "text": "The scientific method cannot be racist, from his perspective."}, {"time": 4643, "text": "It doesn't matter what the scientists, if they follow the scientific method, it doesn't matter what they believe."}, {"time": 4652, "text": "And if they are biased, and they consciously or unconsciously bias the data, other people will come along to replicate it, they will fail, and the process over time will work."}, {"time": 4668, "text": "So let me push back on this idea."}, {"time": 4670, "text": "Because psychology to me is full of gray areas."}, {"time": 4677, "text": "And what I've observed about psychology, even replication crisis aside, is that something about the media, something about journalism, something about the virality of ideas in the public sphere, they misinterpret, they take up things from studies, willfully or from ignorance, misinterpret findings, and tell narratives around that."}, {"time": 4707, "text": "I personally believe, for me, I'm not saying that broadly about science, but for me, it's my responsibility to anticipate the ways in which findings will be misinterpreted."}, {"time": 4720, "text": "So I thought about this a lot, because I published papers on semi autonomous vehicles, and those cars, people die in cars."}, {"time": 4732, "text": "There's people that have written me letters saying emails, nobody writes letters, I wish they did, that have blood on my hands, because of things that I would say positive or negative, there's consequences."}, {"time": 4746, "text": "In the same way, when you're a researcher of intelligence, I'm sure you might get emails, or at least people might believe that a finding of your study is going to be used by a large number of people to increase the amount of hate in the world."}, {"time": 4762, "text": "I think there's some responsibility on scientists, but for me, I think there's a great responsibility to anticipate the ways things will be misinterpreted, and there, you have to, first of all, decide whether you want to say a thing at all, do the study at all, publish the study at all, and two, the words with which you explain it."}, {"time": 4836, "text": "I mean, for a tweet, it's a silly thing, it doesn't matter, but for a scientific paper and study and finding, I think it matters."}, {"time": 4847, "text": "So I don't know what your thoughts are on that, because maybe for Jensen, the data's there, what do you want me to do?"}, {"time": 4855, "text": "This is a scientific process that's been carried out, if you think the data was polluted by bias, do other studies that reveal the bias, but the data's there."}, {"time": 4867, "text": "And I'm not a poet, I'm not a literary writer, what do you want me to do?"}, {"time": 4875, "text": "I'm just presenting you the data."}, {"time": 4877, "text": "What do you think on that spectrum?"}, {"time": 4879, "text": "What's the role of a scientist?"}, {"time": 4881, "text": "The reason I do podcasts, the reason I write books for the public is to explain what I think the data mean and what I think the data don't mean."}, {"time": 4892, "text": "I don't do very much on Twitter other than to retweet references to papers."}, {"time": 4899, "text": "I don't think it's my role to explain these, because they're complicated, they're nuanced."}, {"time": 4906, "text": "But when you decide not to do a scientific study because you're, or not to publish a result because you're afraid the result could be harmful or insensitive, that's not an unreasonable thought."}, {"time": 4925, "text": "And people will make different conclusions and decisions about that."}, {"time": 4931, "text": "I wrote about this, I'm the editor of a journal called Intelligence, which publishes scientific papers."}, {"time": 4940, "text": "Sometimes we publish papers on group differences."}, {"time": 4944, "text": "Those papers sometimes are controversial."}, {"time": 4947, "text": "These papers are written for a scientific audience."}, {"time": 4949, "text": "They're not written for the Twitter audience."}, {"time": 4952, "text": "I don't promote them very much on Twitter."}, {"time": 4957, "text": "But in a scientific paper, you have to now choose your words carefully also, because those papers are picked up by non scientists, by writers of various kinds, and you have to be available to discuss what you're saying and what you're not saying."}, {"time": 4978, "text": "Sometimes you are successful at having a good conversation like we are today, that doesn't start out pejorative."}, {"time": 4989, "text": "Other times I've been asked to participate in debates where my role would be to justify race science."}, {"time": 4996, "text": "Well, you can see you start out."}, {"time": 5001, "text": "That was a BBC request that I received."}, {"time": 5005, "text": "I have so much, it's a love hate relationship, mostly hate with these shallow journalism organizations."}, {"time": 5013, "text": "So they would want to use you as a kind of in a debate setting to communicate as to like there is raised differences between groups and make that into debate and put you in a role of... Justifying racism."}, {"time": 5029, "text": "Justifying racism."}, {"time": 5030, "text": "That's what they're asking me to do."}, {"time": 5031, "text": "Courses like educating about this field of the science of intelligence, yeah."}, {"time": 5036, "text": "I wanna say one more thing before we get off the normal distribution."}, {"time": 5041, "text": "You also asked me what is the science after the bell curve?"}, {"time": 5046, "text": "And the short answer is there's not much new work, but whatever work there is supports the idea that there still are group differences."}, {"time": 5056, "text": "It's arguable whether those differences have diminished at all or not."}, {"time": 5060, "text": "And there is still a major problem in underperformance for school achievement for many disadvantaged and minority students."}, {"time": 5073, "text": "And there so far is no way to fix it."}, {"time": 5077, "text": "What do we do with this information?"}, {"time": 5079, "text": "Is this now a task?"}, {"time": 5082, "text": "Now we'll talk about the future on the neuroscience and the biology side, but in terms of this information as a society in the public policy, in the political space, in the social space, what do we do with this information?"}, {"time": 5096, "text": "I've thought a lot about this."}, {"time": 5097, "text": "The first step is to have people interested in policy understand what the data actually show to pay attention to intelligence data."}, {"time": 5109, "text": "You can read policy papers about education and using your word processor, you can search for the word intelligence."}, {"time": 5117, "text": "You can search a 20,000 word document in a second and find out the word intelligence does not appear anywhere."}, {"time": 5126, "text": "In most discussions about what to do about achievement gaps, I'm not talking about test gaps, I'm talking about actual achievement gaps in schools, which everyone agrees is a problem, the word intelligence doesn't appear among educators."}, {"time": 5144, "text": "As a matter of fact, in California, there has been tremendous controversy about recent attempts to revise the curriculum for math in high schools."}, {"time": 5156, "text": "And we had a Stanford professor of education who was running this review assert there's no such thing as talent, mathematical talent."}, {"time": 5167, "text": "And she wanted to get rid of the advanced classes in math because not everyone could do that."}, {"time": 5175, "text": "Now, of course, this has been very controversial, they've retreated somewhat, but the idea that a university professor was in charge of this who believes that there's no talent, that it doesn't exist, this is rather shocking, let alone the complete absence of intelligence data."}, {"time": 5197, "text": "By the way, let me tell you something about what the intelligence data show."}, {"time": 5201, "text": "Let's take race out of it."}, {"time": 5205, "text": "Even though the origins of these studies were a long time ago, I'm blocking on the name of the report, the Coleman report was a famous report about education."}, {"time": 5217, "text": "And they measured all kinds of variables about schools, about teachers, and they looked at academic achievement as an outcome."}, {"time": 5228, "text": "And they found the most predictive variables of education outcome were the variables the student brought with him or her into the school, essentially their ability."}, {"time": 5243, "text": "And that when you combine the school and the teacher variables together, the quality of the school, the funding of the school, the quality of the teachers, their education, you put all the teacher and school variables together, it barely accounted for 10% of the variance."}, {"time": 5261, "text": "And this has been replicated now."}, {"time": 5265, "text": "So the best research we have shows that school variables and teacher variables together account for about 10% of student academic achievement."}, {"time": 5279, "text": "Now, you wanna have some policy on improving academic achievement, how much money do you wanna put into teacher education?"}, {"time": 5288, "text": "How much money do you wanna put into the quality of the school administration?"}, {"time": 5294, "text": "You know who you can ask?"}, {"time": 5295, "text": "You can ask the Gates Foundation, because they spent a tremendous amount of money doing that."}, {"time": 5301, "text": "And at the end of it, because they're measurement people, they wanna know the data, they found it had no impact at all."}, {"time": 5309, "text": "And they've kind of pulled out of that kind of program."}, {"time": 5313, "text": "So, oh boy."}, {"time": 5316, "text": "Let me ask you, this is me talking, but there's... Just the two of us."}, {"time": 5322, "text": "Just the two of us, but I'm gonna say some funny and ridiculous things, so you're surely not approving of it."}, {"time": 5331, "text": "But there's a movie called Clerks."}, {"time": 5333, "text": "You probably..."}, {"time": 5334, "text": "I've seen it, I've seen it, yeah."}, {"time": 5336, "text": "There's a funny scene in there where a lovely couple are talking about the number of previous sexual partners they had."}, {"time": 5343, "text": "And the woman says that, I believe she just had a handful, like two or three or something like that sexual partners, but then she also mentioned that she... What's that called?"}, {"time": 5359, "text": "Fallacia, what's the scientific?"}, {"time": 5360, "text": "But she went, you know, gave a blow job to 37 guys, I believe it is."}, {"time": 5366, "text": "And so that has to do with the truth."}, {"time": 5369, "text": "So sometimes, knowing the truth can get in the way of a successful relationship of love of some of the human flourishing."}, {"time": 5383, "text": "And that seems to me that's at the core here, that facing some kind of truth that's not able to be changed makes it difficult to sort of... Is limiting as opposed to empowering."}, {"time": 5399, "text": "That's the concern."}, {"time": 5401, "text": "If you sort of test for intelligence and lay the data out, it feels like you will give up on certain people."}, {"time": 5409, "text": "You will sort of start bidding people, it's like, well, this person is like, let's focus on the average people or let's focus on the very intelligent people."}, {"time": 5421, "text": "And there's a kind of intuition that if we just don't measure and we don't use that data, that we will treat everybody equal and give everybody equal opportunity."}, {"time": 5437, "text": "If we have the data in front of us, we're likely to misdistribute the amount of sort of attention we allocate, resources we allocate to people."}, {"time": 5449, "text": "That's probably the concern."}, {"time": 5452, "text": "It's a realistic concern, but I think it's a misplaced concern if you wanna fix the problem."}, {"time": 5460, "text": "If you wanna fix the problem, you have to know what the problem is."}, {"time": 5465, "text": "Now, let me tell you this, let's go back to the bell curve, not the bell curve, but the normal distribution."}, {"time": 5471, "text": "Yes, 16% of the population on average has an IQ under 85, which means they're very hard."}, {"time": 5482, "text": "If you have an IQ under 85, it's very hard to find gainful employment at a salary that sustains you at least minimally in modern life, okay?"}, {"time": 5495, "text": "Not impossible, but it's very difficult."}, {"time": 5497, "text": "16% of the population of the United States is about 51 or 52 million people with IQs under 85."}, {"time": 5507, "text": "This is not a small issue."}, {"time": 5511, "text": "14 million children have IQs under 85."}, {"time": 5517, "text": "Is this something we wanna ignore?"}, {"time": 5519, "text": "Does this have any, what is the Venn diagram between, you know, when you have people with IQs under 85, and you have achievement in school or achievement in life?"}, {"time": 5533, "text": "There's a lot of overlap there."}, {"time": 5536, "text": "This is why, to go back to the IQ pill, if there were a way to shift that curve toward the higher end, that would have a big impact."}, {"time": 5550, "text": "If I could maybe, before we talk about the impact on life and so on, some of the criticisms of the bell curve."}, {"time": 5558, "text": "So Steven Jay Gould wrote that the bell curve rests on four incorrect assumptions."}, {"time": 5564, "text": "It would be just interesting to get your thoughts on the four assumptions, which are, intelligence must be reducible to a single number, intelligence must be capable of rank ordering people in a linear order, intelligence must be primarily genetically based, and intelligence must be essentially immutable."}, {"time": 5583, "text": "Maybe not as criticisms, but as thoughts about intelligence."}, {"time": 5589, "text": "Oh yeah, we could spend a lot of time on him."}, {"time": 5593, "text": "On Steven Jay Gould?"}, {"time": 5595, "text": "He wrote that in what, about 1985, 1984?"}, {"time": 5600, "text": "His views were overtly political, not scientific."}, {"time": 5605, "text": "He was a scientist, but his views on this were overtly political, and I would encourage people listening to this, if they really want to understand his criticisms, they should just Google what he had to say, and Google the scientific reviews of his book, The Mismeasure of Man, and they will take these statements apart."}, {"time": 5634, "text": "They were wrong, not only were they wrong, but when he asserted in his first book that there was no biological basis essentially to IQ, by the time the second edition came around, there were studies of MRIs showing that brain size, brain volume were correlated to IQ scores, which he declined to put in his book."}, {"time": 5661, "text": "I didn't know actually the extent of his work."}, {"time": 5665, "text": "I was just using a few little snippets of criticism."}, {"time": 5669, "text": "There was a battle here."}, {"time": 5670, "text": "He wrote a book, Mismeasure of Man, that's missing a lot of the scientific grounding."}, {"time": 5676, "text": "His book is highly popular in colleges today."}, {"time": 5679, "text": "You can find it in any college bookstore under assigned reading."}, {"time": 5682, "text": "It's highly popular."}, {"time": 5684, "text": "The Mismeasure of Man?"}, {"time": 5685, "text": "Yes, highly influential."}, {"time": 5686, "text": "Can you speak to the Mismeasure of Man?"}, {"time": 5688, "text": "I'm undereducated about this."}, {"time": 5690, "text": "So is this the book basically criticizing the ideas in the book?"}, {"time": 5694, "text": "Yeah, where those four things came from."}, {"time": 5697, "text": "And it is really a book that was really taken apart point by point by a number of people who actually understood the data."}, {"time": 5708, "text": "And he didn't care."}, {"time": 5710, "text": "He didn't care."}, {"time": 5711, "text": "He didn't modify anything."}, {"time": 5712, "text": "Listen, because this is such a sensitive topic, like I said, I believe the impact of the work, because it is misinterpreted, has to be considered."}, {"time": 5728, "text": "Because it's not just going to be scientific discourse, it's going to be political discourse, there's going to be debates, there's going to be politically motivated people that will use messages in each direction, make something like the bulk of the enemy or the support for one's racist beliefs."}, {"time": 5752, "text": "And so I think you have to consider that."}, {"time": 5755, "text": "But it's difficult because Nietzsche was used by Hitler to justify a lot of his beliefs."}, {"time": 5762, "text": "And it's not exactly on Nietzsche to anticipate Hitler or how his ideas will be misinterpreted and used for evil."}, {"time": 5772, "text": "But there is a balance there."}, {"time": 5774, "text": "So I understand."}, {"time": 5777, "text": "Is there any criticism of the book you find compelling or interesting or challenging to you from a scientific perspective?"}, {"time": 5783, "text": "There were factual criticisms about the nature of the statistics that were used, the statistical analyses."}, {"time": 5792, "text": "These are more technical criticisms."}, {"time": 5794, "text": "And they were addressed by Murray in a couple of articles where he took all the criticisms and spoke to them."}, {"time": 5801, "text": "And people listening to this podcast can certainly find all those online."}, {"time": 5808, "text": "Murray went on to write some additional books, two in the last couple of years, one about human diversity where he goes through the data refuting the idea that race is only a social construct with no biological meaning."}, {"time": 5827, "text": "He discusses the data."}, {"time": 5829, "text": "It's a very good discussion."}, {"time": 5831, "text": "You don't have to agree with it."}, {"time": 5832, "text": "But he presents data in a cogent way."}, {"time": 5836, "text": "And he talks about the critics of that."}, {"time": 5839, "text": "And he talks about their data in a cogent, nonpersonal way."}, {"time": 5843, "text": "It's a very informative discussion."}, {"time": 5846, "text": "The book is called Human Diversity."}, {"time": 5848, "text": "He talks about race."}, {"time": 5849, "text": "And he talks about gender, same thing, about sex differences."}, {"time": 5854, "text": "And more recently, he's written what might be his final say on this, a book called Facing Reality where he talks about this again."}, {"time": 5866, "text": "So he can certainly defend himself."}, {"time": 5869, "text": "He doesn't need me to do that."}, {"time": 5872, "text": "But I would urge people who have heard about him and the bell curve and who think they know what's in it, you are likely incorrect."}, {"time": 5883, "text": "And you need to read it for yourself."}, {"time": 5886, "text": "But it is, scientifically, it's a serious subject."}, {"time": 5892, "text": "It's a difficult subject."}, {"time": 5893, "text": "Ethically, it's a difficult subject."}, {"time": 5895, "text": "Everything you said here, calmly and thoughtfully, is difficult."}, {"time": 5899, "text": "It's difficult for me to even consider that G factor exists."}, {"time": 5906, "text": "I don't mean from like that somehow G factor is inherently racist or sexist or whatever."}, {"time": 5912, "text": "It's just it's difficult in the way that considering the fact that we die one day is difficult."}, {"time": 5918, "text": "That we are limited by our biology is difficult."}, {"time": 5922, "text": "And at least from an American perspective, you would like to believe that everything is possible in this world."}, {"time": 5931, "text": "Well, that leads us to what I think we should do with this information."}, {"time": 5939, "text": "And what I think we should do with this information is unusual."}, {"time": 5947, "text": "Because I think what we need to do is fund more neuroscience research on the molecular biology of learning and memory."}, {"time": 5956, "text": "Because one definition of intelligence is based on how much you can learn and how much you can remember."}, {"time": 5967, "text": "And if you accept that definition of intelligence, then there are molecular studies going on now, and Nobel Prizes being won on molecular biology or molecular neurobiology of learning and memory."}, {"time": 5985, "text": "Now, the step those researchers, those scientists need to take when it comes to intelligence is to focus on the concept of individual differences."}, {"time": 5998, "text": "Intelligence research has individual differences as its heart because it assumes that people differ on this variable."}, {"time": 6010, "text": "And those differences are meaningful and need understanding."}, {"time": 6015, "text": "Cognitive psychologists who have morphed into molecular biologists studying learning and memory hate the concept of individual differences historically."}, {"time": 6027, "text": "Some now are coming around to it."}, {"time": 6030, "text": "I once sat next to a Nobel Prize winner for his work on memory."}, {"time": 6037, "text": "And I asked him about individual differences."}, {"time": 6041, "text": "And he said, don't go there."}, {"time": 6042, "text": "It'll set us back 50 years."}, {"time": 6046, "text": "But I said, don't you think they're the key, though, to understand?"}, {"time": 6050, "text": "Why can some people remember more than others?"}, {"time": 6053, "text": "He said, you don't want to go there."}, {"time": 6055, "text": "I think the 21st century will be remembered by the technology and the science that goes to individual differences."}, {"time": 6064, "text": "Because we have now data."}, {"time": 6065, "text": "We have now the tools to much, much better to start to measure, start to estimate, not just on the sort of through tests and IQ test type of things, sort of outside the body kind of things, but measuring all kinds of stuff about the body."}, {"time": 6080, "text": "So yeah, truly go into the molecular biology, to the neurobiology, to the neuroscience."}, {"time": 6087, "text": "Let me ask you about life."}, {"time": 6091, "text": "How does intelligence correlate with or lead to or has anything to do with career success?"}, {"time": 6099, "text": "You've mentioned these kinds of things."}, {"time": 6100, "text": "And is there any data?"}, {"time": 6103, "text": "You had an excellent conversation with Jordan Peterson, for example."}, {"time": 6106, "text": "Is there any data on what intelligent means for success in life?"}, {"time": 6113, "text": "Success in life."}, {"time": 6114, "text": "There is a tremendous amount of validity data that looked at intelligence test scores and various measures of life success."}, {"time": 6131, "text": "Now, of course, life success is a pretty broad topic."}, {"time": 6137, "text": "And not everybody agrees on what success means."}, {"time": 6142, "text": "But there's general agreement on certain aspects of success that can be measured."}, {"time": 6153, "text": "Including life expectancy, like you said."}, {"time": 6155, "text": "Life expectancy."}, {"time": 6156, "text": "Now, there's life success."}, {"time": 6162, "text": "Life expectancy, I mean, that is such an interesting finding."}, {"time": 6167, "text": "But IQ scores are also correlated to things like income."}, {"time": 6174, "text": "Now, OK, so who thinks income means you're successful?"}, {"time": 6181, "text": "The point is that income is one empirical measure in this culture that says something about your level of success."}, {"time": 6191, "text": "You can define success in ways that have nothing to do with income."}, {"time": 6195, "text": "You can define success based on your evolutionary natural selection success."}, {"time": 6205, "text": "But for variables, and even that, by the way, is correlated to IQ in some studies."}, {"time": 6213, "text": "So however you want to define success, IQ is important."}, {"time": 6222, "text": "It's not the only determinant."}, {"time": 6224, "text": "People get hung up on, well, what about personality?"}, {"time": 6226, "text": "What about so called emotional intelligence?"}, {"time": 6229, "text": "Yes, all those things matter."}, {"time": 6231, "text": "The thing that matters empirically, the single thing that matters the most is your general ability, your general mental intellectual ability, your reasoning ability."}, {"time": 6243, "text": "And the more complex your vocation, the more complex your job, the more G matters."}, {"time": 6251, "text": "G doesn't matter in a lot of occupations don't require complex thinking."}, {"time": 6257, "text": "And there are occupations like that, and G doesn't matter."}, {"time": 6260, "text": "Within an occupation, the G might not matter so much."}, {"time": 6268, "text": "So that if you look at all the professors at MIT and had a way to rank order them, there's a ceiling effect is what I'm saying."}, {"time": 6283, "text": "That, you know."}, {"time": 6285, "text": "Also, when you get past a certain threshold, then there's impact on wealth, for example, or career success, however that's defined in each individual discipline."}, {"time": 6294, "text": "But after a certain point, it doesn't matter."}, {"time": 6296, "text": "Actually, it does matter in certain things."}, {"time": 6299, "text": "So for example, there is a very classic study that was started at Johns Hopkins when I was a graduate student there."}, {"time": 6308, "text": "And I actually worked on this study at the very beginning."}, {"time": 6311, "text": "It's the study of mathematically and scientifically precocious youth."}, {"time": 6315, "text": "And they gave junior high school students age 11 and 12 the standard SAT math exam."}, {"time": 6327, "text": "And they found a very large number of students scored very high on this exam."}, {"time": 6333, "text": "Not a large number."}, {"time": 6335, "text": "I mean, they found many students when they cast the net to all of Baltimore."}, {"time": 6340, "text": "They found a number of students who scored as high on the SAT math when they were 12 years old as incoming Hopkins freshmen."}, {"time": 6350, "text": "And they said, gee, now this is interesting."}, {"time": 6353, "text": "What shall we do now?"}, {"time": 6356, "text": "And on a case by case basis, they got some of those kids into their local community college math programs."}, {"time": 6366, "text": "Many of those kids went on to be very successful."}, {"time": 6370, "text": "And now there's a 50 year follow up of those kids."}, {"time": 6374, "text": "And it turns out these kids were in the top 1%."}, {"time": 6381, "text": "So everybody in this study is in the top 1%."}, {"time": 6384, "text": "If you take that group, that rarefied group, and divide them into quartiles so that you have the top 25% of the top 1% and the bottom 25% of the top 1%, you can find unmeasurable variables of success."}, {"time": 6408, "text": "The top quartile does better than the bottom quartile in the top 1%."}, {"time": 6413, "text": "They have more patents."}, {"time": 6414, "text": "They have more publications."}, {"time": 6416, "text": "They have more tenure at universities."}, {"time": 6419, "text": "And this is based on, you're dividing them based on their score at age 12."}, {"time": 6425, "text": "I wonder how much interesting data is in the variability in the differences."}, {"time": 6432, "text": "So but that's really, oh, boy."}, {"time": 6437, "text": "But it's also, I don't know, somehow painful."}, {"time": 6441, "text": "I don't know why it's so painful that that G factor is so determinant of even in the nuanced top percent."}, {"time": 6451, "text": "This is interesting that you find that painful."}, {"time": 6452, "text": "Do you find it painful that people with charisma are very successful, can be very successful in life, even though having no other attributes other than they're famous and people like them?"}, {"time": 6465, "text": "Do you find that painful?"}, {"time": 6467, "text": "Yes, if that charisma is untrainable."}, {"time": 6471, "text": "So one of the things, again, this is like I learned psychology from the Johnny Depp trial."}, {"time": 6476, "text": "But one of the things the psychologist, the personality psychologist, he can maybe speak to this because he had an interest in this for a time, is she was saying that personality, technically speaking, is the thing that doesn't change over a lifetime."}, {"time": 6496, "text": "It's the thing you're, I don't know if she was actually implying that you're born with it."}, {"time": 6501, "text": "Well, it's a trait."}, {"time": 6502, "text": "It's a trait that's state."}, {"time": 6504, "text": "It's a trait that's relatively stable over time."}, {"time": 6507, "text": "I think that's generally correct."}, {"time": 6508, "text": "So to the degree your personality is stable over time, yes, that too is painful."}, {"time": 6516, "text": "Because what's not painful is the thing, if I'm fat and out of shape, I can exercise and become healthier in that way."}, {"time": 6527, "text": "If my diet is a giant mess and that's resulting in some kind of conditions that my body is experiencing, I can fix that by having a better diet."}, {"time": 6538, "text": "That sort of my actions, my willed actions can make a change."}, {"time": 6543, "text": "If charisma is part of the personality that's, the part of the charisma that is part of the personality that is stable, yeah, yeah, that's painful too."}, {"time": 6555, "text": "Because it's like, oh shit, I'm stuck with this."}, {"time": 6558, "text": "I'm stuck with this."}, {"time": 6559, "text": "Well, and this pretty much generalizes to every aspect of your being."}, {"time": 6564, "text": "This is who you are."}, {"time": 6566, "text": "You've got to deal with it."}, {"time": 6567, "text": "And what it undermines, of course, is a realistic appreciation for this, undermines the fairly recent idea prevalent in this country that if you work hard, you can be anything you want to be, which has morphed from the original idea that if you work hard, you can be successful."}, {"time": 6593, "text": "And now we have if you work hard, you can be anything you want to be."}, {"time": 6600, "text": "This is completely unrealistic."}, {"time": 6605, "text": "Now, you can work hard and be successful."}, {"time": 6609, "text": "I could work very hard, and I am not going to be a successful theoretical physicist."}, {"time": 6616, "text": "I'm just not."}, {"time": 6618, "text": "That said, I mean, we should, because we had this conversation already, but it's good to repeat."}, {"time": 6626, "text": "The fact that you're not going to be a theoretical physicist is not judgment on your basic humanity."}, {"time": 6632, "text": "We're turning again to the all men, which means men and women are created equal."}, {"time": 6639, "text": "So again, some of the differences we're talking about in quote unquote success, wealth, number of whether you win a Nobel Prize or not, that doesn't put a measure on your basic humanity and basic value and even goodness of you as a human being."}, {"time": 6662, "text": "Because your basic role and value in society is largely within your control."}, {"time": 6671, "text": "It's some of these measures that we're talking about."}, {"time": 6676, "text": "It's good to remember this."}, {"time": 6679, "text": "One question about the Flynn effect."}, {"time": 6683, "text": "Are humans getting smarter over the years, over the decades, over the centuries?"}, {"time": 6688, "text": "The Flynn effect is James Flynn, who passed away about a year ago, published a set of analyses going back a couple of decades when he first noticed this, that IQ scores, when you looked over the years, seemed to be drifting up."}, {"time": 6714, "text": "Now, this was not unknown to the people who make the test because they renorm the test periodically and they have to renorm the test periodically because what 10 items correct meant relative to other people 50 years ago is not the same as what 10 items mean relative today."}, {"time": 6738, "text": "People are getting more things correct."}, {"time": 6741, "text": "Now, the scores have been drifting up about three points."}, {"time": 6744, "text": "IQ scores have been drifting up about three points per decade."}, {"time": 6750, "text": "This is not a personal effect."}, {"time": 6751, "text": "This is a cohort effect."}, {"time": 6754, "text": "Well, it's not for an individual, but."}, {"time": 6757, "text": "The world, how do you explain?"}, {"time": 6759, "text": "And this has presented intelligence researchers with a great mystery."}, {"time": 6766, "text": "First, is it effect on the 50% of the variance that's the G factor or on the other 50%?"}, {"time": 6775, "text": "And there's evidence that it is a G factor effect."}, {"time": 6779, "text": "And second, what on earth causes this?"}, {"time": 6782, "text": "And doesn't this mean intelligence and G factor cannot be genetic because the scale of natural selection is much, much longer than a couple of decades ago?"}, {"time": 6795, "text": "And so it's been used to try to undermine the idea that there can be a genetic influence on intelligence."}, {"time": 6804, "text": "But certainly, it can be the Flynn effect can affect the nongenetic aspects of intelligence because genes account for maybe 50% of the variance."}, {"time": 6817, "text": "Maybe higher, could be as high as 80% for adults, but let's just say 50% for discussion."}, {"time": 6826, "text": "So the Flynn effect, it's still a mystery."}, {"time": 6830, "text": "It's still a mystery."}, {"time": 6831, "text": "It's still a mystery, although the evidence is coming out."}, {"time": 6834, "text": "I told you before I edited a journal on intelligence, and we're doing a special issue in honor of James Flynn."}, {"time": 6840, "text": "So I'm starting to see papers now on really the latest research on this."}, {"time": 6846, "text": "I think most people who specialize in this area of trying to understand the Flynn effect are coming to the view based on data that it has to do with advances in nutrition and health care."}, {"time": 6860, "text": "And there's also evidence that the effect is slowing down and possibly reversing."}, {"time": 6868, "text": "So how would nutrition and health, so nutrition would still be connected to the G factor."}, {"time": 6876, "text": "So nutrition as it relates to the G factor, so the biology that leads to the intelligence."}, {"time": 6882, "text": "That would be the claim."}, {"time": 6883, "text": "Like the hypothesis being tested by the research."}, {"time": 6890, "text": "And there's some evidence from infants that nutrition has made a difference."}, {"time": 6898, "text": "So it's not an unreasonable connection."}, {"time": 6902, "text": "But does it negate the idea that there's a genetic influence?"}, {"time": 6905, "text": "Not logically at all."}, {"time": 6907, "text": "But it is very interesting."}, {"time": 6909, "text": "So that if you take an IQ test today but you take the score and use the tables that were available in 1940, you're going to wind up with a much higher IQ number."}, {"time": 6927, "text": "So are we really smarter than a couple of generations ago?"}, {"time": 6932, "text": "No, but we might be able to solve problems a little better."}, {"time": 6938, "text": "And make use of our G because of things like Sesame Street and other curricula in school."}, {"time": 6945, "text": "More people are going to school."}, {"time": 6949, "text": "So there are a lot of factors here to disentangle."}, {"time": 6953, "text": "It's fascinating though."}, {"time": 6955, "text": "It's fascinating that there's not clear answers yet."}, {"time": 6958, "text": "That as a population, we're getting smarter."}, {"time": 6962, "text": "When you just zoom out, that's what it looks like."}, {"time": 6964, "text": "As a population, we're getting smarter."}, {"time": 6966, "text": "And it's interesting to see what the effects of that are."}, {"time": 6968, "text": "I mean, this raises the question."}, {"time": 6970, "text": "We've mentioned it many times but haven't clearly addressed it, which is nature versus nurture question."}, {"time": 6977, "text": "So how much of intelligence is nature?"}, {"time": 6980, "text": "How much of it is nurture?"}, {"time": 6981, "text": "How much of it is determined by genetics versus environment?"}, {"time": 6986, "text": "All of it is genetics."}, {"time": 6988, "text": "No, all of it is nature and nurture."}, {"time": 6996, "text": "But how much of the variance can you apportion to either?"}, {"time": 7004, "text": "Most of the people who work in this field say that the framing of that, if the question is framed that way, it can't be answered because nature and nurture are not two independent influences."}, {"time": 7019, "text": "They interact with each other."}, {"time": 7021, "text": "And understanding those interactions is so complex that many behavioral geneticists say it is today impossible and always will be impossible to disentangle that, no matter what kind of advances there are in DNA technology and genomic informatics."}, {"time": 7044, "text": "But there's still, to push back on that, that same intuition from behavioral geneticists would lead me to believe that there cannot possibly be a stable G factor because it's super complex."}, {"time": 7059, "text": "Many of them would assert that as a logical outcome."}, {"time": 7065, "text": "But because I believe there is a stable G factor from lots of sources of data, not just one study, but lots of sources of data over decades, I am more amenable to the idea that whatever interactions between genes and environment exist, they can be explicated, they can be studied, and that information can be used as a basis for molecular biology of intelligence."}, {"time": 7099, "text": "Yeah, and we'll do this exact question because doesn't the stability of the G factor give you at least a hint that there is a biological basis for intelligence?"}, {"time": 7113, "text": "Yes, I think it's clear that the fact that an IQ score is correlated to things like thickness of your cortex, that it's correlated to glucose metabolic rate in your brain, that identical twins reared apart are highly similar in their IQ scores."}, {"time": 7142, "text": "These are all important observations that indicate, not just suggest, but indicate that there's a biological basis."}, {"time": 7153, "text": "And does anyone believe intelligence has nothing to do with the brain?"}, {"time": 7158, "text": "I mean, it's so obvious."}, {"time": 7161, "text": "Well indirectly definitely has to do with it, but the question is environment interacting with the brain or is it the actual raw hardware of the brain?"}, {"time": 7215, "text": "That chance affects the way the neurons are connecting during gestation."}, {"time": 7222, "text": "It's not, hey, it's pre programmed."}, {"time": 7226, "text": "So there is push back on the concept that genes provide a blueprint, that it's a lot more fluid."}, {"time": 7236, "text": "Well, but also, yeah, so there's a lot, a lot, a lot happens in the first few months of development."}, {"time": 7247, "text": "So in nine months inside the mother's body and in the few months afterwards, there's a lot of fascinating stuff, like including chance and luck, like you said, how things connect up."}, {"time": 7264, "text": "The question is afterwards in your plasticity of the brain, how much adjustment there is relative to the environment, how much that affects the G factor, but that's where the whole conclusions of the studies that we've been talking about is that seems to have less and less and less of an effect as pretty quickly."}, {"time": 7283, "text": "As yes, and I do think there is more of a genetic, by my view, and I'm not an expert on this, I mean, genetics is a highly technical and complex subject."}, {"time": 7294, "text": "I am not a geneticist, not a behavioral geneticist, but my reading of this, my interpretation of this is that there is a genetic blueprint, more or less, and that has a profound influence on your subsequent intellectual development, including the G factor."}, {"time": 7316, "text": "And that's not to say things can't happen to, I mean, if you think of that genes provide a potential, fine, and then various variables impact that potential, and every parent of a newborn, implicitly or explicitly, wants to maximize that potential."}, {"time": 7339, "text": "This is why you buy educational toys."}, {"time": 7341, "text": "This is why you pay attention to organic baby food."}, {"time": 7345, "text": "This is why you do all these things, because you want your baby to be as healthy and as smart as possible, and every parent will say that."}, {"time": 7356, "text": "Is there a case to be made, can you steel man the case, that genetics is a very tiny component of all of this, and the environment is essential?"}, {"time": 7369, "text": "I don't think the data supports that genetics is a tiny component."}, {"time": 7373, "text": "I think the data support the idea that the genetics is a very important, and I don't say component, I say influence, a very important influence, and the environment is a lot less than people believe."}, {"time": 7387, "text": "Most people believe environment plays a big role."}, {"time": 7391, "text": "I guess what I'm asking you is, can you see where what you just said, it might be wrong?"}, {"time": 7399, "text": "Can you imagine a world, and what kind of evidence would you need to see to say, you know what, the intuition, the studies so far, like reversing the directions."}, {"time": 7411, "text": "So one of the cool things we have now more and more is we're getting more and more data, and the rate of the data is escalating because of the digital world."}, {"time": 7421, "text": "So when you start to look at a very large scale of data, both on the biology side and the social side, we might be discovering some very counterintuitive things about society."}, {"time": 7433, "text": "We might see the edge cases that reveal that if we actually scale those edge cases and they become like the norm, that we'll have a complete shift in our, like you'll see G factor be able to be modified throughout life in the teens and in later life."}, {"time": 7455, "text": "So is it any case you can make or for where your current intuitions are wrong?"}, {"time": 7460, "text": "Yes, and it's a good question because I think everyone should always be asked what evidence would change your mind."}, {"time": 7468, "text": "It's certainly not only a fair question, it is really the key question for anybody working on any aspect of science."}, {"time": 7476, "text": "I think that if environment was very important, we would have seen it clearly by now."}, {"time": 7485, "text": "It would have been obvious that school interventions, compensatory education, early childhood education, all these things that have been earnestly tried in well funded, well designed studies would show some effect, and they don't."}, {"time": 7502, "text": "What if the school, the way we've tried school, compensatory school sucks and we need to do better?"}, {"time": 7509, "text": "That's what everybody said at the beginning."}, {"time": 7510, "text": "That's what everybody said to Jensen."}, {"time": 7511, "text": "He said, well, maybe we need to start earlier."}, {"time": 7515, "text": "Maybe we need not do prekindergarten, but pre, prekindergarten."}, {"time": 7520, "text": "It's always an infinite, well, maybe we didn't get it right."}, {"time": 7524, "text": "But after decades of trying, 50 years, 50 or 60 years of trying, surely something would have worked to the point where you could actually see a result and not need a probability level at 0.05 on some means."}, {"time": 7542, "text": "So that's why I, that's the kind of evidence that would change my mind."}, {"time": 7549, "text": "Population level interventions like schooling that you would see like this actually has an effect."}, {"time": 7558, "text": "And when you take adopted kids and they grow up in another family and you find out when those adopted kids are adults, their IQ scores don't correlate with the IQ scores of their adoptive parents, but they do correlate with their IQ scores of their biological parents whom they've never met."}, {"time": 7578, "text": "I mean, these are important, these are powerful observations."}, {"time": 7582, "text": "And it would be convincing to you if the reverse was true."}, {"time": 7587, "text": "That would be more."}, {"time": 7588, "text": "And there is some data on adoption that indicates that the adopted children are moving a little bit more toward their adoptive parents."}, {"time": 7600, "text": "But it's to me the overwhelming, I have this concept called the weight of evidence where I don't interpret any one study too much."}, {"time": 7610, "text": "The weight of evidence tells me genes are important."}, {"time": 7613, "text": "But what does that mean?"}, {"time": 7614, "text": "What does it mean that genes are important?"}, {"time": 7617, "text": "Knowing that gene expression, genes don't express themselves in a vacuum, they express themselves in an environment."}, {"time": 7625, "text": "So the environment has to have something to do with it, especially if the best genetic estimates of the amount of variants are around 50 or even if it's as high as 80%, it still leaves 20% of non genetic."}, {"time": 7641, "text": "Now maybe that is all luck."}, {"time": 7644, "text": "Maybe that's all chance."}, {"time": 7645, "text": "I could believe that, I could easily believe that."}, {"time": 7651, "text": "But I do think after 50 years of trying various interventions and nothing works, including memory training, including listening to Mozart, including playing computer games, none of that has shown any impact on intelligence test scores."}, {"time": 7669, "text": "Is there data on the intelligence, the IQ of parents as it relates to the children?"}, {"time": 7677, "text": "Yes, and there is some genetic evidence of an interaction between the parents IQ and the environment."}, {"time": 7688, "text": "High IQ parents provide an enriched environment, which then can impact the child in addition to the genes, it's that environment."}, {"time": 7700, "text": "So there are all these interactions that, think about the number of books in a household."}, {"time": 7709, "text": "This was a variable that's correlated with IQ and, well, why?"}, {"time": 7717, "text": "Especially if the kid never reads any of the books, it's because more intelligent people have more books in their house."}, {"time": 7725, "text": "And if you're more intelligent and there's a genetic component to that, the child will get those genes or some of those genes as well as the environment."}, {"time": 7737, "text": "But it's not the number of books in the house that actually directly impacts the child."}, {"time": 7744, "text": "So the two scenarios on this are you find that, and this was used to get rid of the SAT test, oh, the SAT score is highly correlated with the social economic status of the parents."}, {"time": 7758, "text": "So all you're really measuring is how rich the parents are."}, {"time": 7761, "text": "Okay, well, why are the parents rich?"}, {"time": 7767, "text": "And so the opposite kind of syllogism is that people who are very bright make more money, they can afford homes in better neighborhoods so their kids get better schools."}, {"time": 7784, "text": "Now the kids grow up bright."}, {"time": 7787, "text": "Where in that chain of events does that come from?"}, {"time": 7791, "text": "Well, unless you have a genetically informative research design where you look at siblings that have the same biological parents and so on, you can't really disentangle all that."}, {"time": 7805, "text": "Most studies of social economic status and intelligence do not have a genetically informed design."}, {"time": 7813, "text": "So any conclusions they make about the causality of the social economic status being the cause of the IQ is a stretch."}, {"time": 7825, "text": "And where you do find genetically informative designs, you find most of the variance in your outcome measures are due to the genetic component."}, {"time": 7838, "text": "And sometimes the SES adds a little, but the weight of evidence is it doesn't add very much variance to predict what's going on beyond the genetic variance."}, {"time": 7852, "text": "So when you actually look at it in some, and there aren't that many studies that have genetically informed designs, but when you do see those, the genes seem to have an advantage."}, {"time": 7865, "text": "Sorry for the strange questions, but is there a connection between fertility or the number of kids that you have and G factor?"}, {"time": 7876, "text": "So you know, the kind of conventional wisdom is people of maybe higher economic status or something like that are having fewer children."}, {"time": 7888, "text": "I just loosely hear these kinds of things."}, {"time": 7890, "text": "Is there data that you're aware of in one direction or another on this?"}, {"time": 7896, "text": "Strange questions always get strange answers."}, {"time": 7901, "text": "Do you have a strange answer for that strange question?"}, {"time": 7904, "text": "The answer is there were some studies that indicated the more children in a family, the firstborn children would be more intelligent than the fourth or fifth or sixth."}, {"time": 7920, "text": "It's not clear that those studies hold up over time."}, {"time": 7925, "text": "And of course what you see also is that families where there are multiple children, four, five, six, seven, you know, really big families, the social economic status of those families usually in the modern age is not that high."}, {"time": 7948, "text": "Maybe it used to be the aristocracy used to have a lot of kids, I'm not sure exactly."}, {"time": 7953, "text": "But there have been reports of correlations between IQ and fertility, but I'm not sure that the data are very strong that the firstborn child is always the smartest."}, {"time": 7970, "text": "It seems like there's some data to that, but I'm not current on that."}, {"time": 7974, "text": "How would that be explained?"}, {"time": 7975, "text": "That would be in a nurture."}, {"time": 7978, "text": "Well, it could be nurture, it could be in uterine environment, I mean, and this is why this, you know, like many areas of science, you said earlier that there are a lot of gray areas and no definitive answers."}, {"time": 8001, "text": "This is not uncommon in science that the closer you look at a problem, the more questions you get, not the fewer questions, because the universe is complicated."}, {"time": 8015, "text": "And the idea that we have people on this planet who can study the first nanoseconds of the Big Bang, that's pretty amazing."}, {"time": 8028, "text": "And I've always said that if they can study the first nanoseconds of the Big Bang, we can certainly figure out something about intelligence that allows that."}, {"time": 8038, "text": "I'm not sure what's more complicated, the human mind or the physics of the universe."}, {"time": 8046, "text": "It's unclear to me."}, {"time": 8048, "text": "I think we overemphasize."}, {"time": 8049, "text": "Well, that's a very humbling statement."}, {"time": 8053, "text": "Maybe it's a very human centric, egotistical statement that our mind is somehow super complicated, but biology is a tricky one to unravel."}, {"time": 8062, "text": "Consciousness, what is that?"}, {"time": 8067, "text": "I've always believed that consciousness and intelligence are the two real fundamental problems of the human brain, and therefore I think they must be related."}, {"time": 8081, "text": "Yeah, heart problems like walk together, holding hands kind of idea."}, {"time": 8089, "text": "You may not know this, but I did some of the early research on anesthetic drugs with brain imaging trying to answer the question, what part of the brain is the last to turn off when someone loses consciousness?"}, {"time": 8101, "text": "And is that the first part of the brain to turn on when consciousness is regained?"}, {"time": 8107, "text": "And I was working with an anesthesiologist named Mike Alkire, who was really brilliant at this."}, {"time": 8112, "text": "These were really the first studies of brain imaging using positron emission tomography long before fMRI."}, {"time": 8121, "text": "And you would inject a radioactive sugar that labeled the brain, and the harder the brain was working, the more sugar it would take up, and then you could make a picture of glucose use in the brain."}, {"time": 8136, "text": "And he was amazing."}, {"time": 8138, "text": "He managed to do this in normal volunteers he brought in and anesthetized as if they were going into surgery."}, {"time": 8149, "text": "He managed all the human subjects requirements on this research, and he was brilliant at this."}, {"time": 8157, "text": "And what we did is we had these normal volunteers come in on three occasions."}, {"time": 8165, "text": "On one occasion, he gave them enough anesthetic drug so they were a little drowsy."}, {"time": 8174, "text": "And on another occasion, they came in and he fully anesthetized them."}, {"time": 8180, "text": "And he would say, Mike, can you hear me, and the person would say, uh, yeah."}, {"time": 8191, "text": "And then we would scan people under no anesthetic condition."}, {"time": 8197, "text": "So same person."}, {"time": 8199, "text": "And we were looking to see if we could see the part of the brain turn off."}, {"time": 8206, "text": "He subsequently tried to do this with fMRI, which has a faster time resolution, and you could do it in real time as the person went under and then regain consciousness where you couldn't do that with PET."}, {"time": 8217, "text": "You had to have three different occasions."}, {"time": 8220, "text": "And the results were absolutely fascinating."}, {"time": 8223, "text": "We did this with different anesthetic drugs, and different drugs impacted different parts of the brain."}, {"time": 8229, "text": "So we were naturally looking for the common one, and it seemed to have something to do with the thalamus."}, {"time": 8238, "text": "And consciousness, this was actual data on consciousness, actual consciousness."}, {"time": 8245, "text": "What part of the brain turns on?"}, {"time": 8248, "text": "What part of the brain turns off?"}, {"time": 8253, "text": "But maybe has something to do with the thalamus."}, {"time": 8255, "text": "The sequence of events seemed to have the thalamus in it."}, {"time": 8261, "text": "Now here's the question."}, {"time": 8262, "text": "Are some people more conscious than others?"}, {"time": 8265, "text": "Are there individual differences in consciousness?"}, {"time": 8269, "text": "And I don't mean it in the psychedelic sense."}, {"time": 8273, "text": "I don't mean it in the political consciousness sense."}, {"time": 8275, "text": "I just mean it in everyday life."}, {"time": 8277, "text": "Do some people go through everyday life more conscious than others?"}, {"time": 8281, "text": "And are those the people we might actually label more intelligent?"}, {"time": 8286, "text": "Now the other thing I was looking for is whether the parts of the brain we were seeing in the anesthesia studies were the same parts of the brain we were seeing in the intelligence studies."}, {"time": 8297, "text": "Now, this was very complicated, expensive research."}, {"time": 8302, "text": "We didn't really have funding to do this."}, {"time": 8304, "text": "We were trying to do it on the fly."}, {"time": 8306, "text": "I'm not sure anybody has pursued this."}, {"time": 8309, "text": "I'm retired now."}, {"time": 8311, "text": "He's gone on to other things."}, {"time": 8314, "text": "But I think it's an area of research that would be fascinating to see the parts, a lot more imaging studies now of consciousness."}, {"time": 8323, "text": "I'm just not up on them."}, {"time": 8361, "text": "Here's a simple question."}, {"time": 8363, "text": "Does it take more anesthetic drug to have a person lose consciousness if their IQ is 140 than a person with an IQ of 70?"}, {"time": 8379, "text": "That's an interesting way to study it."}, {"time": 8381, "text": "I mean, if the answer to that is a stable yes, that's very interesting."}, {"time": 8388, "text": "So I tried to find out and I went to some anesthesiology textbooks about how you dose and they dose by weight."}, {"time": 8399, "text": "And what I also learned, this is a little bit off subject, anesthesiologists are never sure how deep you are."}, {"time": 8410, "text": "And they usually tell by poking you with a needle and if you don't jump, they tell the surgeon to go ahead."}, {"time": 8417, "text": "I'm not sure that's literally true, but it's... Well, it might be very difficult to know precisely how deep you are."}, {"time": 8426, "text": "It has to do with the same kind of measurements that you were doing with the consciousness."}, {"time": 8431, "text": "It's difficult to know."}, {"time": 8434, "text": "So I don't lose my train of thought."}, {"time": 8435, "text": "I couldn't find in the textbooks anything about dosing by intelligence."}, {"time": 8440, "text": "I asked my friend, the anesthesiologist, he said, no, he doesn't know."}, {"time": 8445, "text": "I said, can we do a chart review and look at people using their years of education as a proxy for IQ?"}, {"time": 8454, "text": "Because if someone's gone to graduate school, that tells you something."}, {"time": 8458, "text": "You can make some inference as opposed to someone who didn't graduate high school."}, {"time": 8462, "text": "Can we do a chart review?"}, {"time": 8463, "text": "And he says, no, they never really put down the exact dose."}, {"time": 8468, "text": "And no, he said, no."}, {"time": 8470, "text": "So to this day, the simple question, does it take more anesthetic drug to put someone under if they have a high IQ or less, or less?"}, {"time": 8483, "text": "It could go either way."}, {"time": 8484, "text": "Because by the way, our early PET scan studies of intelligence found the unexpected result of an inverse correlation between glucose metabolic rate and intelligence."}, {"time": 8498, "text": "It wasn't how much a brain area lit up."}, {"time": 8503, "text": "How much it lit up was negatively correlated to how well they did on the test, which led to the brain efficiency hypothesis, which is still being studied today."}, {"time": 8514, "text": "And there's more and more evidence that the efficiency of brain information processing is more related to intelligence than just more activity."}, {"time": 8528, "text": "Yeah, and it'll be interesting, again, this is the total hypothesis, how much in the relationship between intelligence and consciousness, it's not obvious that those two, if there's correlation, they could be inversely correlated."}, {"time": 8543, "text": "Wouldn't that be funny?"}, {"time": 8546, "text": "If you, the consciousness factor, the C factor plus the G factor equals one."}, {"time": 8558, "text": "It's a nice trade off, you get a trade off, how deeply you experience the world versus how deeply you're able to reason through the world."}, {"time": 8568, "text": "What a great hypothesis."}, {"time": 8571, "text": "Certainly somebody listening to this can do this study."}, {"time": 8574, "text": "Even if it's the aliens analyzing humans a few centuries from now, let me ask you from an AI perspective, I don't know how much you've thought about machines, but there's the famous Turing test, test of intelligence for machines, which is a beautiful, almost like a cute formulation of intelligence that Alan Turing proposed."}, {"time": 8604, "text": "Basically conversation being, if you can fool a human to think that a machine is a human that passes the test, I suppose you could do a similar thing for humans."}, {"time": 8620, "text": "If I can fool you that I'm intelligent, then that's a good test of intelligence."}, {"time": 8628, "text": "You're talking to two people, and the test is saying who has a higher IQ."}, {"time": 8642, "text": "It's an interesting test, because maybe charisma can be very useful there, and you're only allowed to use conversation, which is the formulation of the Turing test."}, {"time": 8651, "text": "Anyway, all that to say is what are good tests of intelligence for machines?"}, {"time": 8658, "text": "What do you think it takes to achieve human level intelligence for machines?"}, {"time": 8663, "text": "I have thought a little bit about this, but every time I think about these things, I rapidly reach the limits of my knowledge and imagination."}, {"time": 8677, "text": "When Alexa first came out, and I think there was a competing one, well, there was Siri with Apple, and Google had Alexa."}, {"time": 8690, "text": "No, no, Amazon had Alexa."}, {"time": 8692, "text": "Amazon had Alexa."}, {"time": 8693, "text": "Google has Google Home."}, {"time": 8694, "text": "Google has something."}, {"time": 8695, "text": "I proposed to one of my colleagues that he buy one of these, one of each, and then ask it questions from the IQ test."}, {"time": 8709, "text": "But it became apparent that they all searched the internet, so they all can find answers to questions like how far is it between Washington and Miami, and repeat after me."}, {"time": 8722, "text": "Now, I don't know if you said to Alexa, I'm going to repeat these numbers backwards to me."}, {"time": 8730, "text": "I don't know what would happen."}, {"time": 8731, "text": "I've never done it."}, {"time": 8733, "text": "So one answer to your question is you're going to try it right now."}, {"time": 8738, "text": "Let's try it."}, {"time": 8742, "text": "Yes, Siri."}, {"time": 8743, "text": "So it would actually probably go to Google search, and it will be all confusing kind of stuff."}, {"time": 8749, "text": "It would fail."}, {"time": 8750, "text": "Well, then I guess there was a test that it would fail."}, {"time": 8753, "text": "Well, but that's not, that has to do more with the language of communication versus the content."}, {"time": 8763, "text": "So if you did an IQ test to a person who doesn't speak English, and the test was administered in English, that's not really the test of... Well, let's think about the computers that beat the Jeopardy champions."}, {"time": 8775, "text": "Yeah, so that, because I happen to know how those are programmed, those are very hard coded, and there's definitely a lack of intelligence there."}, {"time": 8785, "text": "There's something like IQ tests, there's a guy, an artificial intelligence researcher, Francois Chollet, he's at Google, he's one of the seminal people in machine learning."}, {"time": 8800, "text": "He also, as a fun aside thing, developed an IQ test for machines."}, {"time": 8805, "text": "Oh, I haven't heard that."}, {"time": 8807, "text": "I'd just like to know about that."}, {"time": 8809, "text": "I'll actually email you this, because it'd be very interesting for you."}, {"time": 8813, "text": "It doesn't get much attention, because people don't know what to do with it, but it deserves a lot of attention, which is, it basically does a pattern type of tests, where you have to do, you know, one standard one is, you're given three things, and you have to do a fourth one, that kind of thing, so you have to understand the pattern here."}, {"time": 8837, "text": "And for that, it really simplifies to, so the interesting thing is, he's trying not to achieve high IQ, he's trying to achieve like, pretty low bar for IQ."}, {"time": 8855, "text": "Things that are kind of trivial for humans, and they're actually really tough for machines."}, {"time": 8862, "text": "It's just seeing, playing with these concepts of symmetry, of counting, like if I give you one object, two objects, three objects, you'll know the last one is four objects, you can like count them, you can cluster objects together, it's both visually and conceptually, we can do all these things with our mind, that we take for granted, the objectness of things."}, {"time": 9003, "text": "Right, that's called fluid intelligence, as opposed to what's called crystallized intelligence, which is your knowledge of facts, you know things, but can you use those things to solve a problem, those are two different things."}, {"time": 9049, "text": "Metaphorically, I do, and I am supremely confident that it's possible because I am supremely ignorant of the complexities of neurobiology, and so I have written that the nightmares of neurobiologists, understanding the complexities, this cascade of events that happens at the synaptic level, that these nightmares are what fuel some people to solve."}, {"time": 9085, "text": "So some people, you have to be undaunted, I mean yeah, this is not easy, look we're still trying to figure out cancer, it was only recently that they figured out why aspirin works, you know, these are not easy problems, but I also have the perspective of the history of science, is the history of solving problems that are extraordinarily complex."}, {"time": 9117, "text": "And seem impossible at the time."}, {"time": 9121, "text": "And so one of the things you look at, at companies like Neuralink, you have brain computer interfaces, you start to delve into the human mind and start to talk about machines measuring but also sending signals to the human mind, and you start to wonder what that has, what impact that has on the G factor."}, {"time": 9143, "text": "Modifying in small ways or in large ways the functioning, the mechanical, electrical, chemical functioning of the brain."}, {"time": 9154, "text": "I look at everything about the brain, there are different levels of explanation."}, {"time": 9159, "text": "On one hand you have a behavioral level, but then you have brain circuitry, and then you have neurons, and then you have dendrites, and then you have synapses, and then you have the neurotransmitters, and the presynaptic and the postsynaptic terminals, and then you have all the things that influence neurotransmitters, and then you have the individual differences among people."}, {"time": 9195, "text": "Yeah, it's complicated, but 51 million people in the United States have IQs under 85 and struggle with everyday life."}, {"time": 9212, "text": "Shouldn't that motivate people to take a look at this?"}, {"time": 9217, "text": "Yeah, but I just want to linger one more time that you have to remember that the science of intelligence, the measure of intelligence is only a part of the human condition."}, {"time": 9234, "text": "The thing that makes life beautiful and the creation of beautiful things in this world is perhaps loosely correlated, but is not dependent entirely on intelligence."}, {"time": 9248, "text": "Absolutely, I certainly agree with that."}, {"time": 9252, "text": "So for anyone sort of listening, I'm still not convinced that more intelligence is always better if you want to create beauty in this world."}, {"time": 9267, "text": "Well, I didn't say more intelligence is always better if you want to create beauty."}, {"time": 9271, "text": "I just said all things being equal, more is better than less."}, {"time": 9276, "text": "That's all I mean."}, {"time": 9277, "text": "Yeah, but that's sort of that I just want to sort of say because a lot to me, one of the things that makes life great is the opportunity to create beautiful things, and so I just want to sort of empower people to do that no matter what some IQ test says."}, {"time": 9296, "text": "At the population level, we do need to look at IQ tests to help people and to also inspire us to take on some of these extremely difficult scientific questions."}, {"time": 9307, "text": "Do you have advice for young people in high school, in college, whether they're thinking about career or they're thinking about a life they can be proud of?"}, {"time": 9320, "text": "Is there advice you can give whether they want to pursue psychology or biology or engineering or they want to be artists and musicians and poets?"}, {"time": 9333, "text": "I can't advise anybody on that level of what their passion is, but I can say if you're interested in psychology or if you're interested in science and the science around the big questions of consciousness and intelligence and psychiatric illness, we haven't really talked about brain illnesses and what we might learn from."}, {"time": 9367, "text": "If you are trying to develop a drug to treat Alzheimer's disease, you are trying to develop a drug to impact learning and memory, which are core to intelligence."}, {"time": 9380, "text": "So it could well be that the so called IQ pill will come from a pharmaceutical company trying to develop a drug for Alzheimer's disease."}, {"time": 9389, "text": "Because that's exactly what you're trying to do, right, yeah, just like you said."}, {"time": 9393, "text": "What will that drug do in a college student that doesn't have Alzheimer's disease?"}, {"time": 9398, "text": "So I would encourage people who are interested in psychology, who are interested in science to pursue a scientific career and address the big questions."}, {"time": 9414, "text": "And the most important thing I can tell you if you're going to be in kind of a research environment is you got to follow the data where the data take you."}, {"time": 9427, "text": "You can't decide in advance where you want the data to go."}, {"time": 9430, "text": "And if the data take you to places that you don't have the technical expertise to follow, like you know, I would like to understand more about molecular biology, but I'm not going to become a molecular biologist now."}, {"time": 9444, "text": "But I know people who are, and my job is to get them interested to take their expertise into this direction."}, {"time": 9453, "text": "And that it's not so easy."}, {"time": 9456, "text": "And if the data takes you to a place that's controversial, that's counterintuitive in this world, no, I would say it's probably a good idea to still push forward boldly, but to communicate the interpretation of the results with skill, with compassion, with the greater breadth of understanding of humanity, not just the science, of the impact of the results."}, {"time": 9488, "text": "One famous psychologist wrote about this issue that somehow a balance has to be found between pursuing the science and communicating it with respect to people's sensitivities, the legitimate sensitivities, somehow."}, {"time": 9506, "text": "He didn't say how."}, {"time": 9510, "text": "This sense, somehow, and balance is left up to the interpretation of the reader."}, {"time": 9517, "text": "Let me ask you, you said big questions, the biggest, or one of the biggest, we already talked about consciousness and intelligence, one of the most fascinating, one of the biggest questions."}, {"time": 9529, "text": "But let's talk about the why."}, {"time": 9534, "text": "I'm not going to tell you."}, {"time": 9535, "text": "You know you're not going to tell me?"}, {"time": 9536, "text": "This is very..."}, {"time": 9540, "text": "I'm going to have to wait for your next book."}, {"time": 9547, "text": "We do the best we can to get through the day."}, {"time": 9552, "text": "And then there's just a finite number of the days."}, {"time": 9556, "text": "Are you afraid of the finiteness of it?"}, {"time": 9557, "text": "I think about it more and more as I get older."}]}]