[{"title": "Kyle Vogt: Cruise Automation | Lex Fridman Podcast #14", "id": "YUYagvESisE", "quotes": [{"time": 260, "text": "Did you take it to the testing point?"}, {"time": 263, "text": "Like how did you know two minutes?"}, {"time": 263, "text": "Or was there a reckless let's just go with it and see?"}, {"time": 266, "text": "We weren't very good at BattleBots."}, {"time": 270, "text": "We lost all of our matches the first round."}, {"time": 274, "text": "The one I built first, both of them were these wedge shaped robots because wedge, even though it's sort of boring to look at, is extremely effective."}, {"time": 280, "text": "You drive towards another robot and the front edge of it gets under them and then they sort of flip over, kind of like a door stopper."}, {"time": 286, "text": "And the first one had a pneumatic polished stainless steel spike on the front that would shoot out about eight inches."}, {"time": 293, "text": "The purpose of which is what?"}, {"time": 293, "text": "Pretty, pretty ineffective actually, but it looks cool."}, {"time": 298, "text": "And was it to help with the lift?"}, {"time": 298, "text": "No, it was, it was just to try to poke holes in the other robot."}, {"time": 302, "text": "And then the second time I did it, which is the following, I think maybe 18 months later, we had a, well a titanium axe with a, with a hardened steel tip on it that was powered by a hydraulic cylinder which we were activating with liquid CO2, which was, had its own set of problems."}, {"time": 321, "text": "So great, so that's kind of on the hardware side."}, {"time": 326, "text": "I mean at a certain point there must have been born a fascination on the software side."}, {"time": 331, "text": "So what was the first piece of code you've written?"}, {"time": 335, "text": "Go back there, see what language was it?"}, {"time": 338, "text": "What, what was that?"}, {"time": 338, "text": "Was it Emacs?"}, {"time": 338, "text": "Vim?"}, {"time": 338, "text": "Was it a more respectable modern IDE?"}, {"time": 341, "text": "Do you, do you remember any of this?"}, {"time": 345, "text": "Yeah, well I remember, I think maybe when I was in third or fourth grade, the school I was at, elementary school, had a bunch of Apple II computers and we'd play games on those."}, {"time": 352, "text": "And I remember every once in a while something would, would, would crash or wouldn't start up correctly and it would dump you out to what I later learned was like sort of a command prompt."}, {"time": 365, "text": "And my teacher would come over and type, I actually remember this to this day for some reason, like PR number six or PR pound six, which is peripheral six, which is the disk drive, which would fire up the disk and load the program."}, {"time": 375, "text": "And I just remember thinking wow, she's like a hacker, like teach me these, these codes, these error codes, that is what I called them at the time."}, {"time": 381, "text": "But she had no interest in that, so it wasn't until I think about fifth grade that I had a school where you could actually go on these Apple IIs and learn to program."}, {"time": 388, "text": "And so it was all in basic, you know, where every line, you know, the line numbers are all number, that every line is numbered and you have to like leave enough space between the numbers so that if you want to tweak your code you go back and the first line was 10 and the second line is 20."}, {"time": 401, "text": "Now you have to go back and insert 15 and if you need to add code in front of that, you know, 11 or 12 and you hope you don't run out of line numbers and have to redo the whole thing."}, {"time": 410, "text": "And there's go to statements?"}, {"time": 410, "text": "Yeah, go to and it's very basic, maybe hence the name, but a lot of fun."}, {"time": 418, "text": "And that was like, that was, you know, that's when, you know, when you first program you see the magic of it."}, {"time": 423, "text": "It's like, it just, just like this world opens up with, you know, endless possibilities for the things you could build or or accomplish with that computer."}, {"time": 429, "text": "So you got the bug then, so even starting with basic and then what C++ throughout, what did you, was there computer programming, computer science classes in high school?"}, {"time": 439, "text": "Not, not where I went, so it was self taught, but I did a lot of programming."}, {"time": 470, "text": "And I remember thinking even then with my sort of mediocre programming background that this is something that a computer can do, right?"}, {"time": 477, "text": "Let's take a picture of the road, let's find the yellow lane markers and, you know, steer the wheel."}, {"time": 483, "text": "And, you know, later I'd come to realize this had been done, you know, since, since the 80s or the 70s or even earlier, but I still wanted to do it and sort of immediately after that trip switched from sort of BattleBots, which is more radio controlled machines, to thinking about building, you know, autonomous vehicles of some scale."}, {"time": 501, "text": "Start off with really small electric ones and then, you know, progress to what we're doing now."}, {"time": 507, "text": "So what was your view of artificial intelligence at that point?"}, {"time": 510, "text": "What did you think?"}, {"time": 510, "text": "So this is before, there's been waves in artificial intelligence, right?"}, {"time": 515, "text": "The current wave with deep learning makes people believe that you can solve in a really rich deep way the computer vision perception problem, but like in before the deep learning craze, you know, how do you think about, how would you even go about building a thing that perceives itself in the world, localizes itself in the world, moves around the world?"}, {"time": 539, "text": "Like when you were younger, I mean, what was your thinking about it?"}, {"time": 571, "text": "Traffic light detection and stop sign detection, red, yellow, green."}, {"time": 598, "text": "Traffic light detection, probably a really simple, you know, color thresholding on day one just to get the system up and running before you migrate to, you know, a deep learning based technique or something else."}, {"time": 610, "text": "And, you know, back in when I was doing this, my first one, it was on a Pentium 203, 233 megahertz computer in it and I think I wrote the first version in basic, which is like an interpreted language."}, {"time": 619, "text": "It's extremely slow because that's the thing I knew at the time."}, {"time": 624, "text": "And so there was no, no chance at all of using, there was no, no computational power to do any sort of reasonable deep nets like you have today."}, {"time": 632, "text": "So I don't know what kids these days are doing."}, {"time": 632, "text": "Are kids these days, you know, at age 13 using neural networks in their garage?"}, {"time": 638, "text": "I mean, that would be awesome."}, {"time": 640, "text": "I get emails all the time from, you know, like 11, 12 year olds saying I'm having, you know, I'm trying to follow this TensorFlow tutorial and I'm having this problem."}, {"time": 648, "text": "And the general approach in the deep learning community is of extreme optimism of, as opposed to, you mentioned like heuristics, you can, you can, you can separate the autonomous driving problem into modules and try to solve it sort of rigorously, or you can just do it end to end."}, {"time": 668, "text": "And most people just kind of love the idea that, you know, us humans do it end to end."}, {"time": 672, "text": "We just perceive and act."}, {"time": 672, "text": "We should be able to use that, do the same kind of thing when you're on nets."}, {"time": 677, "text": "And that, that kind of thinking, you don't want to criticize that kind of thinking because eventually they will be right."}, {"time": 683, "text": "And so it's exciting and especially when they're younger to explore that as a really exciting approach."}, {"time": 686, "text": "But yeah, it's, it's changed the, the language, the kind of stuff you're tinkering with."}, {"time": 695, "text": "It's kind of exciting to see when these teenagers grow up."}, {"time": 698, "text": "I can only imagine if you, if your starting point is, you know, Python and TensorFlow at age 13 where you end up, you know, after 10 or 15 years of that, that's, that's pretty cool."}, {"time": 709, "text": "Because of GitHub, because the state tools for solving most of the major problems in artificial intelligence are within a few lines of code for most kids."}, {"time": 720, "text": "And that's incredible to think about also on the entrepreneurial side."}, {"time": 724, "text": "And, and on that point, was there any thought about entrepreneurship before you came to college?"}, {"time": 730, "text": "Is sort of doing, you're building this into a thing that impacts the world on a large scale?"}, {"time": 734, "text": "I've always wanted to start a company."}, {"time": 738, "text": "I think that's, you know, just a cool concept of creating something and exchanging it for value or creating value, I guess."}, {"time": 748, "text": "So in high school, I was, I was trying to build like, you know, servo motor drivers, little circuit boards and sell them online or other, other things like that."}, {"time": 755, "text": "And certainly knew at some point I wanted to do a startup, but it wasn't really, I'd say until college, until I felt like I had the, I guess the right combination of the environment, the smart people around you and some free time and a lot of free time at MIT."}, {"time": 772, "text": "So you came to MIT as an undergrad 2004."}, {"time": 772, "text": "And that's when the first DARPA Grand Challenge was happening."}, {"time": 778, "text": "The, the timing of that is beautifully poetic."}, {"time": 782, "text": "So how did you get yourself involved in that one?"}, {"time": 785, "text": "Originally there wasn't a official entry."}, {"time": 785, "text": "Yeah, faculty sponsored thing."}, {"time": 785, "text": "And so a bunch of undergrads, myself included, started meeting and got together and tried to haggle together some sponsorships."}, {"time": 794, "text": "We got a vehicle donated, a bunch of sensors and tried to put something together."}, {"time": 798, "text": "And so we had, our team was probably mostly freshmen and sophomores, you know, which, which was not really a fair, fair fight against maybe the, you know, postdoc and faculty led teams from other schools."}, {"time": 810, "text": "But we, we got something up and running."}, {"time": 813, "text": "We had our vehicle drive by wire and you know, very, very basic control and things."}, {"time": 816, "text": "But on the day of the qualifying, sort of pre qualifying round, the one and only steering motor that we had purchased, the thing that we had retrofitted to turn the steering wheel on the truck died."}, {"time": 835, "text": "And so our vehicle was just dead in the water, couldn't steer."}, {"time": 838, "text": "So we didn't make it very far."}, {"time": 838, "text": "On the hardware side."}, {"time": 838, "text": "So was there a software component?"}, {"time": 842, "text": "Was there, like, how did your view of autonomous vehicles in terms of artificial intelligence evolve in this moment?"}, {"time": 849, "text": "I mean, you know, like you said from the 80s has been autonomous vehicles, but really that was the birth of the modern wave."}, {"time": 856, "text": "The, the thing that captivated everyone's imagination that we can actually do this."}, {"time": 861, "text": "So what, how were you captivated in that way?"}, {"time": 865, "text": "So how did your view of autonomous vehicles change at that point?"}, {"time": 868, "text": "I'd say at that point in time it was, it was a curiosity as in, like, is this really possible?"}, {"time": 875, "text": "And I think that was generally the spirit and the purpose of that original DARPA Grand Challenge, which was to just get a whole bunch of really brilliant people exploring the space and pushing the limits."}, {"time": 912, "text": "So that was pretty cool."}, {"time": 916, "text": "So let me jump around a little bit on that point."}, {"time": 920, "text": "They also did the Urban Challenge where it was in the city, but it was very artificial and there's no pedestrians and there's very little human involvement except a few professional drivers."}, {"time": 931, "text": "Do you think there's room, and then there was the Robotics Challenge with humanoid robots."}, {"time": 934, "text": "So in your now role is looking at this, you're trying to solve one of the, you know, autonomous driving, one of the harder, more difficult places in San Francisco."}, {"time": 945, "text": "Is there a role for DARPA to step in to also kind of help out, like, challenge with new ideas, specifically pedestrians and so on, all these kinds of interesting things?"}, {"time": 954, "text": "Well, I haven't, I haven't thought about it from that perspective."}, {"time": 956, "text": "Is there anything DARPA could do today to further accelerate things?"}, {"time": 959, "text": "And I would say, my instinct is that that's maybe not the highest and best use of their resources and time, because, like, kick starting and spinning up the flywheel is, I think, what what they did in this case for very, very little money."}, {"time": 971, "text": "But today this has become, this has become, like, commercially interesting to very large companies and the amount of money going into it and the amount of people, like, going through your class and learning about these things and developing these skills is just, you know, orders of magnitude more than it was back then."}, {"time": 989, "text": "And so there's enough momentum and inertia and energy and investment dollars into this space right now that I don't, I don't, I think they're, I think they're, they can just say mission accomplished and move on to the next area of technology that needs help."}, {"time": 1006, "text": "So then stepping back to MIT, you left MIT during your junior year."}, {"time": 1010, "text": "What was that decision like?"}, {"time": 1084, "text": "So no regrets?"}, {"time": 1084, "text": "Looking back, it was just an obvious, I mean, one way ticket."}, {"time": 1089, "text": "I mean, if we just pause on that for a second, there was no, how did you know these are the right guys, this is the right decision, you didn't think it was just follow the heart kind of thing?"}, {"time": 1101, "text": "Well, I didn't know, but, you know, just trying something for a month during IAP seems pretty low risk, right?"}, {"time": 1108, "text": "And then, you know, well, maybe I'll take a semester off, MIT's pretty flexible about that, you can always go back, right?"}, {"time": 1111, "text": "And then after two or three cycles of that, I eventually threw in the towel, but, you know, I think it's, I guess in that case I felt like I could always hit the undo button if I had to."}, {"time": 1124, "text": "But nevertheless, from when you look in retrospect, I mean, it seems like a brave decision, you know, it would be difficult for a lot of people to make."}, {"time": 1131, "text": "It wasn't as popular, I'd say that the general, you know, flux of people out of MIT at the time was mostly into, you know, finance or consulting jobs in Boston or New York, and very few people were going to California to start companies, but today I'd say that's, it's probably inverted, which is just a sign of, a sign of the times, I guess."}, {"time": 1154, "text": "So there's a story about midnight of March 18, 2007, where TechCrunch, I guess, announced Justin.TV earlier than it was supposed to, a few hours."}, {"time": 1168, "text": "The site didn't work."}, {"time": 1168, "text": "I don't know if any of this is true, you can tell me."}, {"time": 1172, "text": "And you and one of the folks at Justin.TV, Emmett Shearer, coded through the night."}, {"time": 1176, "text": "Can you take me through that experience?"}, {"time": 1181, "text": "So let me, let me say a few nice things that, the article I read quoted Justin Kahn said that you were known for bureau coding through problems and being a creative, quote, creative genius."}, {"time": 1192, "text": "So on that night, what, what was going through your head, or maybe I'd put another way, how do you solve these problems?"}, {"time": 1200, "text": "What's your approach to solving these kinds of problems where the line between success and failure seems to be pretty thin?"}, {"time": 1208, "text": "Well, first of all, that's, that's a nice of Justin to say that."}, {"time": 1212, "text": "I think, you know, I would have been maybe 21 years old then and not very experienced at programming, but as with, with everything in a startup, you're sort of racing against the clock."}, {"time": 1223, "text": "And so our plan was the second we had this live streaming camera backpack up and running, where Justin could wear it and no matter where he went in a city, it would be streaming live video."}, {"time": 1235, "text": "And this is even before the iPhones."}, {"time": 1236, "text": "This is like hard to do back then."}, {"time": 1240, "text": "We would launch."}, {"time": 1240, "text": "And so we thought we were there and the backpack was working and then we sent out all the emails to launch the, launch the company and do the press thing."}, {"time": 1247, "text": "And then, you know, we weren't quite actually there."}, {"time": 1251, "text": "And then we thought, oh, well, you know, they're not going to announce it until maybe 10 a.m. the next morning."}, {"time": 1258, "text": "And it's, I don't know, it's 5 p.m. now."}, {"time": 1258, "text": "So how many hours do we have left?"}, {"time": 1262, "text": "Like, you know, 17 hours to go."}, {"time": 1266, "text": "And, and that was, that was going to be fine."}, {"time": 1270, "text": "Was the problem obvious?"}, {"time": 1270, "text": "Did you understand what could possibly, like, how complicated was the system at that point?"}, {"time": 1276, "text": "It was, it was pretty messy."}, {"time": 1276, "text": "So to get a live video feed that looked decent working from anywhere in San Francisco, I put together this system where we had like three or four cell phone data modems and they were, like, we take the video stream and, you know, sort of spray it across these three or four modems and then try to catch all the packets on the other side, you know, with unreliable cell phone networks."}, {"time": 1299, "text": "It's pretty low level networking."}, {"time": 1301, "text": "Yeah, and putting these, like, you know, sort of protocols on top of all that to, to reassemble and reorder the packets and have time buffers and error correction and all that kind of stuff."}, {"time": 1310, "text": "And the night before it was just staticky."}, {"time": 1310, "text": "Every once in a while the image would, would go to staticky and there would be this horrible, like, screeching audio noise because the audio was also corrupted."}, {"time": 1321, "text": "And this would happen, like, every five to ten minutes or so and it was a really, you know, off putting to the viewers."}, {"time": 1328, "text": "How do you tackle that problem?"}, {"time": 1328, "text": "What was the, uh, you're just freaking out behind a computer."}, {"time": 1332, "text": "There's, are there other, other folks working on this problem?"}, {"time": 1336, "text": "Like, were you behind a whiteboard?"}, {"time": 1336, "text": "Were you doing, uh, Yeah, it was a little, it was a little, yeah, it's a little lonely because there's four of us working on the company and only two people really wrote code."}, {"time": 1346, "text": "And Emmett wrote the website and the chat system and I wrote the software for this video streaming device and video server."}, {"time": 1354, "text": "And so, you know, it's my sole responsibility to figure that out."}, {"time": 1357, "text": "And I think, I think it's those, you know, setting, setting deadlines, trying to move quickly and everything where you're in that moment of intense pressure that sometimes people do their best and most interesting work."}, {"time": 1365, "text": "And so even though that was a terrible moment, I look back on it fondly because that's like, you know, that's one of those character defining moments, I think."}, {"time": 1371, "text": "So in 2013, October, you founded Cruise Automation."}, {"time": 1378, "text": "So progressing forward, another exceptionally successful company was acquired by GM in 16 for $1 billion."}, {"time": 1386, "text": "But in October 2013, what was on your mind?"}, {"time": 1394, "text": "What was the plan?"}, {"time": 1394, "text": "How does one seriously start to tackle one of the hardest robotics, most important impact for robotics problems of our age?"}, {"time": 1403, "text": "After going through Twitch, Twitch was, was, and is today, pretty successful."}, {"time": 1407, "text": "But the, the work was, the result was entertainment, mostly."}, {"time": 1415, "text": "Like, the better the product was, the more we would entertain people and then, you know, make money on the ad revenues and other things."}, {"time": 1422, "text": "And that was, that was a good thing."}, {"time": 1422, "text": "It felt, felt good to entertain people."}, {"time": 1424, "text": "But I figured like, you know, what is really the point of becoming a really good engineer and developing these skills other than, you know, my own enjoyment?"}, {"time": 1431, "text": "And I realized I wanted something that scratched more of an existential itch, like something that, that truly matters."}, {"time": 1436, "text": "And so I basically made this list of requirements for a new, if I was going to do another company, and the one thing I knew in the back of my head that Twitch took like eight years to become successful."}, {"time": 1452, "text": "And so whatever I do, I better be willing to commit, you know, at least 10 years to something."}, {"time": 1456, "text": "And when you think about things from that perspective, you certainly, I think, raise the bar on what you choose to work on."}, {"time": 1460, "text": "So for me, the three things were it had to be something where the technology itself determines the success of the product, like hard, really juicy technology problems, because that's what motivates me."}, {"time": 1472, "text": "And then it had to have a direct and positive impact on society in some way."}, {"time": 1477, "text": "So an example would be like, you know, health care, self driving cars, because they save lives, other things where there's a clear connection to somehow improving other people's lives."}, {"time": 1485, "text": "And the last one is it had to be a big business, because for the positive impact to matter, it's got to be a large scale."}, {"time": 1491, "text": "And I was thinking about that for a while, and I made like, I tried writing a Gmail clone and looked at some other ideas."}, {"time": 1497, "text": "And then it just sort of light bulb went off, like self driving cars, like that was the most fun I had ever had in college working on that."}, {"time": 1503, "text": "And like, well, what's the state of the technology?"}, {"time": 1503, "text": "It's been 10 years."}, {"time": 1507, "text": "Maybe times have changed, and maybe now is the time to make this work."}, {"time": 1510, "text": "And I poked around and looked at, the only other thing out there really at the time was the Google self driving car project."}, {"time": 1516, "text": "And I thought, surely there's a way to, you know, have an entrepreneur mindset and sort of solve the minimum viable product here."}, {"time": 1523, "text": "And so I just took the plunge right then and there and said, this is something I know I can commit 10 years to."}, {"time": 1526, "text": "It's the probably the greatest applied AI problem of our generation."}, {"time": 1529, "text": "And if it works, it's going to be both a huge business and therefore like, probably the most positive impact I can possibly have on the world."}, {"time": 1537, "text": "So after that light bulb went off, I went all in on cruise immediately and got to work."}, {"time": 1545, "text": "Did you have an idea how to solve this problem?"}, {"time": 1545, "text": "Which aspect of the problem to solve?"}, {"time": 1548, "text": "You know, slow, like we just had Oliver from Voyage here, slow moving retirement communities, urban driving, highway driving."}, {"time": 1556, "text": "Did you have, like, did you have a vision of the city of the future where, you know, the transportation is largely automated, that kind of thing?"}, {"time": 1565, "text": "Or was it sort of more fuzzy and gray area than that?"}, {"time": 1569, "text": "My analysis of the situation is that Google is putting a lot, had been putting a lot of money into that project."}, {"time": 1575, "text": "They had a lot more resources."}, {"time": 1579, "text": "And so, and they still hadn't cracked the fully driverless car."}, {"time": 1583, "text": "You know, this is 2013, I guess."}, {"time": 1589, "text": "So I thought, what can I do to sort of go from zero to, you know, significant scale so I can actually solve the real problem, which is the driverless cars."}, {"time": 1597, "text": "And I thought, here's the strategy."}, {"time": 1597, "text": "We'll start by doing a really simple problem or solving a really simple problem that creates value for people."}, {"time": 1604, "text": "So, eventually ended up deciding on automating highway driving, which is relatively more straightforward as long as there's a backup driver there."}, {"time": 1615, "text": "And, you know, the go to market will be able to retrofit people's cars and just sell these products directly."}, {"time": 1619, "text": "And the idea was, we'll take all the revenue and profits from that and use it to do the, so sort of reinvest that in research for doing fully driverless cars."}, {"time": 1630, "text": "And that was the plan."}, {"time": 1633, "text": "The only thing that really changed along the way between then and now is we never really launched the first product."}, {"time": 1637, "text": "We had enough interest from investors and enough of a signal that this was something that we should be working on, that after about a year of working on the highway autopilot, we had it working, you know, on a prototype stage."}, {"time": 1649, "text": "But we just completely abandoned that and said, we're going to go all in on driverless cars now is the time."}, {"time": 1656, "text": "Can't think of anything that's more exciting and if it works more impactful, so we're just going to go for it."}, {"time": 1659, "text": "The idea of retrofit is kind of interesting."}, {"time": 1662, "text": "Being able to, it's how you achieve scale."}, {"time": 1666, "text": "It's a really interesting idea."}, {"time": 1666, "text": "Is it something that's still in the in the back of your mind as a possibility?"}, {"time": 1672, "text": "Not at all."}, {"time": 1672, "text": "I've come full circle on that one."}, {"time": 1672, "text": "After trying to build a retrofit product, and I'll touch on some of the complexities of that, and then also having been inside an OEM and seeing how things work and how a vehicle is developed and validated."}, {"time": 1686, "text": "When it comes to something that has safety critical implications like controlling the steering and other control inputs on your car, it's pretty hard to get there with a retrofit."}, {"time": 1696, "text": "Or if you did, even if you did, it creates a whole bunch of new complications around liability or how did you truly validate that."}, {"time": 1705, "text": "Or you know, something in the base vehicle fails and causes your system to fail, whose fault is it?"}, {"time": 1711, "text": "Or if the car's anti lock brake systems or other things kick in or the software has been, it's different in one version of the car you retrofit versus another and you don't know because the manufacturer has updated it behind the scenes."}, {"time": 1720, "text": "There's basically an infinite list of long tail issues that can get you."}, {"time": 1726, "text": "And if you're dealing with a safety critical product, that's not really acceptable."}, {"time": 1728, "text": "That's a really convincing summary of why that's really challenging."}, {"time": 1732, "text": "But I didn't know all that at the time, so we tried it anyway."}, {"time": 1734, "text": "But as a pitch also at the time, it's a really strong one."}, {"time": 1737, "text": "Because that's how you achieve scale and that's how you beat the current, the leader at the time of Google or the only one in the market."}, {"time": 1744, "text": "The other big problem we ran into, which is perhaps the biggest problem from a business model perspective, is we had kind of assumed that we started with an Audi S4 as the vehicle we retrofitted with this highway driving capability."}, {"time": 1758, "text": "And we had kind of assumed that if we just knock out like three make and models of vehicles, that'll cover like 80% of the San Francisco market."}, {"time": 1765, "text": "Doesn't everyone there drive, I don't know, a BMW or a Honda Civic or one of these three cars?"}, {"time": 1768, "text": "And then we surveyed our users and we found out that it's all over the place."}, {"time": 1772, "text": "We would, to get even a decent number of units sold, we'd have to support like, you know, 20 or 50 different models."}, {"time": 1779, "text": "And each one is a little butterfly that takes time and effort to maintain, you know, that retrofit integration and custom hardware and all this."}, {"time": 1787, "text": "So it was a tough business."}, {"time": 1787, "text": "So GM manufactures and sells over 9 million cars a year."}, {"time": 1792, "text": "And what you with Cruise are trying to do some of the most cutting edge innovation in terms of applying AI."}, {"time": 1803, "text": "And so how do those, you've talked about a little bit before, but it's also just fascinating to me."}, {"time": 1806, "text": "We work a lot of automakers, you know, the difference between the gap between Detroit and Silicon Valley, let's say, just to be sort of poetic about it, I guess."}, {"time": 1817, "text": "How do you close that gap?"}, {"time": 1817, "text": "How do you take GM into the future where a large part of the fleet will be autonomous, perhaps?"}, {"time": 1824, "text": "I want to start by acknowledging that GM is made up of, you know, tens of thousands of really brilliant, motivated people who want to be a part of the future."}, {"time": 1831, "text": "And so it's pretty fun to work within the attitude inside a car company like that is, you know, embracing this transformation and change rather than fearing it."}, {"time": 1841, "text": "And I think that's a testament to the leadership at GM and that's flown all the way through to everyone you talk to, even the people in the assembly plants working on these cars."}, {"time": 1851, "text": "So that's really great."}, {"time": 1851, "text": "So starting from that position makes it a lot easier so then when the people in San Francisco at Cruise interact with the people at GM, at least we have this common set of values, which is that we really want this stuff to work because we think it's important and we think it's the future."}, {"time": 1868, "text": "That's not to say, you know, those two cultures don't clash."}, {"time": 1868, "text": "They absolutely do."}, {"time": 1872, "text": "There's different sort of value systems."}, {"time": 1872, "text": "Like in a car company, the thing that gets you promoted and sort of the reward system is following the processes, delivering the program on time and on budget."}, {"time": 1883, "text": "So any sort of risk taking is discouraged in many ways because if a program is late or if you shut down the plant for a day, it's, you know, you can count the millions of dollars that burn by pretty quickly."}, {"time": 1898, "text": "Whereas I think, you know, most Silicon Valley companies and in Cruise and the methodology we were employing, especially around the time of the acquisition, the reward structure is about trying to solve these complex problems in any way shape or form or coming up with crazy ideas that, you know, 90% of them won't work."}, {"time": 1917, "text": "And so meshing that culture of sort of continuous improvement and experimentation with one where everything needs to be rigorously defined up front so that you never slip a deadline or miss a budget was a pretty big challenge."}, {"time": 1932, "text": "And that we're over three years in now after the acquisition and I'd say like, you know, the investment we made in figuring out how to work together successfully and who should do what and how we bridge the gaps between these very different systems and way of doing engineering work is now one of our greatest assets because I think we have this really powerful thing."}, {"time": 1951, "text": "But for a while it was both GM and Cruise were very steep on the learning curve."}, {"time": 1956, "text": "Yeah, so I'm sure it was very stressful."}, {"time": 1958, "text": "It's really important work because that's how to revolutionize the transportation, really to revolutionize any system."}, {"time": 1964, "text": "You know, you look at the health care system or you look at the legal system."}, {"time": 1968, "text": "I have people like Loris come up to me all the time like everything they're working on can easily be automated."}, {"time": 1975, "text": "But then that's not a good feeling."}, {"time": 1975, "text": "Yeah, well it's not a good feeling but also there's no way to automate because the entire infrastructure is really, you know, based is older and it moves very slowly."}, {"time": 1985, "text": "And so how do you close the gap between I have an how can I replace, of course, Loris don't want to be replaced with an app, but you could replace a lot of aspect when most of the data is still on paper."}, {"time": 2000, "text": "And so the same thing was with automotive."}, {"time": 2003, "text": "I mean, it's fundamentally software."}, {"time": 2003, "text": "It's basically hiring software engineers."}, {"time": 2007, "text": "It's thinking in a software world."}, {"time": 2010, "text": "I mean, I'm pretty sure nobody in Silicon Valley has ever hit a deadline."}, {"time": 2014, "text": "So and then on GM."}, {"time": 2014, "text": "That's probably true, yeah."}, {"time": 2014, "text": "And GM side is probably the opposite."}, {"time": 2018, "text": "So that's that culture gap is really fascinating."}, {"time": 2022, "text": "So you're optimistic about the future of that?"}, {"time": 2025, "text": "Yeah, I mean, from what I've seen, it's impressive."}, {"time": 2025, "text": "And I think like especially in Silicon Valley, it's easy to write off building cars because, you know, people have been doing that for over 100 years now in this country."}, {"time": 2031, "text": "And so it seems like that's a solved problem, but that doesn't mean it's an easy problem."}, {"time": 2038, "text": "And I think it would be easy to sort of overlook that and think that, you know, we're Silicon Valley engineers."}, {"time": 2044, "text": "We can solve any problem, you know, building a car."}, {"time": 2048, "text": "It's been done."}, {"time": 2048, "text": "Therefore, it's, you know, it's not a real engineering challenge."}, {"time": 2052, "text": "But after having seen just the sheer scale and magnitude and industrialization that occurs inside of an automotive assembly plant, that is a lot of work that I am very glad that we don't have to reinvent to make self driving cars work."}, {"time": 2068, "text": "And so to have, you know, partners who have done that for 100 years now, these great processes and this huge infrastructure and supply base that we can tap into is just remarkable because the scope and surface area of the problem of deploying fleets of self driving cars is so large that we're constantly looking for ways to do less so we can focus on the things that really matter more."}, {"time": 2090, "text": "And if we had to figure out how to build and assemble and you know, build the cars themselves."}, {"time": 2097, "text": "I mean, we work closely with GM on that."}, {"time": 2101, "text": "But if we had to develop all that capability in house as well, you know, that would just make the problem really intractable, I think."}, {"time": 2110, "text": "So yeah, just like your first entry at the MIT DARPA challenge when there was what the motor that failed, somebody that knows what they're doing with the motor did it."}, {"time": 2118, "text": "That would have been nice if we could focus on the software, not the hardware platform."}, {"time": 2123, "text": "So from your perspective now, you know, there's so many ways that autonomous vehicles can impact society in the next year, five years, ten years."}, {"time": 2134, "text": "What do you think is the biggest opportunity to make money in autonomous driving, sort of make it a financially viable thing in the near term?"}, {"time": 2144, "text": "What do you think will be the biggest impact there?"}, {"time": 2149, "text": "Well, the things that drive the economics for fleets of self driving cars are, there's sort of a handful of variables."}, {"time": 2153, "text": "One is, you know, the cost to build the vehicle itself."}, {"time": 2157, "text": "So the material cost, how many, you know, what's the cost of all your sensors plus the cost of the vehicle and every all the other components on it."}, {"time": 2165, "text": "Another one is the lifetime of the vehicle."}, {"time": 2168, "text": "It's very different if your vehicle drives 100,000 miles and then it falls apart versus, you know, two million."}, {"time": 2173, "text": "And then, you know, if you have a fleet, it's kind of like an airplane or an airline where once you produce the vehicle, you want it to be in operation as many hours a day as possible producing revenue."}, {"time": 2190, "text": "And then, you know, the other piece of that is how are you generating revenue?"}, {"time": 2194, "text": "I think that's kind of what you're asking."}, {"time": 2194, "text": "And I think the obvious things today are, you know, the ride sharing business because that's pretty clear that there's demand for that, there's existing markets you can tap into and large urban areas, that kind of thing."}, {"time": 2206, "text": "And I think that there are some real benefits to having cars without drivers compared to sort of the status quo for people who use ride share services today."}, {"time": 2218, "text": "You know, you get privacy, consistency, hopefully significantly improve safety, all these benefits versus the current product."}, {"time": 2224, "text": "But it's a crowded market."}, {"time": 2224, "text": "And then other opportunities, which you've seen a lot of activity in the last, really in the last six or twelve months, is, you know, delivery, whether that's parcels and packages, food or groceries."}, {"time": 2234, "text": "Those are all sort of, I think, opportunities that are pretty ripe for these, you know, once you have this core technology, which is the fleet of autonomous vehicles, there's all sorts of different business opportunities you can build on top of that."}, {"time": 2251, "text": "But I think the important thing, of course, is that there's zero monetization opportunity until you actually have that fleet of very capable driverless cars that are that are as good or better than humans."}, {"time": 2260, "text": "And that's sort of where the entire industry is sort of in this holding pattern right now."}, {"time": 2265, "text": "Yeah, they're trying to achieve that baseline."}, {"time": 2265, "text": "So, but you said sort of not reliability, consistency."}, {"time": 2269, "text": "It's kind of interesting, I think I heard you say somewhere, I'm not sure if that's what you meant, but you know, I can imagine a situation where you would get an autonomous vehicle and, you know, when you get into an Uber or Lyft, you don't get to choose the driver in a sense that you don't get to choose the personality of the driving."}, {"time": 2287, "text": "Do you think there's a, there's room to define the personality of the car the way it drives you in terms of aggressiveness, for example, in terms of sort of pushing the bound?"}, {"time": 2299, "text": "One of the biggest challenges of autonomous driving is the is the trade off between sort of safety and assertiveness."}, {"time": 2306, "text": "And do you think there's any room for the human to take a role in that decision?"}, {"time": 2310, "text": "Sort of accept some of the liability, I guess."}, {"time": 2316, "text": "I wouldn't, no, I'd say within reasonable bounds, as in we're not gonna, I think it'd be highly unlikely we'd expose any knob that would let you, you know, significantly increase safety risk."}, {"time": 2328, "text": "I think that's just not something we'd be willing to do."}, {"time": 2331, "text": "But I think driving style or like, you know, are you going to relax the comfort constraints slightly or things like that, all of those things make sense and are plausible."}, {"time": 2340, "text": "I see all those as, you know, nice optimizations."}, {"time": 2343, "text": "Once again, we get the core problem solved in these fleets out there."}, {"time": 2347, "text": "But the other thing we've sort of observed is that you have this intuition that if you sort of slam your foot on the gas right after the light turns green and aggressively accelerate, you're going to get there faster."}, {"time": 2356, "text": "But the actual impact of doing that is pretty small."}, {"time": 2362, "text": "You feel like you're getting there faster, but so the same would be true for AVs."}, {"time": 2365, "text": "Even if they don't slam their, you know, the pedal to the floor when the light turns green, they're going to get you there within, you know, if it's a 15 minute trip, within 30 seconds of what you would have done otherwise if you were going really aggressively."}, {"time": 2377, "text": "So I think there's this sort of self deception that my aggressive driving style is getting me there faster."}, {"time": 2384, "text": "Well, so that's, you know, some of the things I've studied, some of the things I'm fascinated by the psychology of that."}, {"time": 2386, "text": "I don't think it matters that it doesn't get you there faster."}, {"time": 2390, "text": "It's the emotional release."}, {"time": 2395, "text": "Driving is a place, being inside of a car, somebody said it's like the real world version of being a troll."}, {"time": 2402, "text": "So you have this protection, this mental protection, you're able to sort of yell at the world, like release your anger, whatever."}, {"time": 2408, "text": "So there's an element of that that I think autonomous vehicles would also have to, you know, giving an outlet to people, but it doesn't have to be through, through, through driving or honking or so on."}, {"time": 2419, "text": "There might be other outlets, but I think to just sort of even just put that aside, the baseline is really, you know, that's the focus."}, {"time": 2426, "text": "That's the thing you need to solve."}, {"time": 2428, "text": "And then the fun human things can be solved after."}, {"time": 2430, "text": "But so from the baseline of just solving autonomous driving, you're working in San Francisco, one of the more difficult cities to operate in."}, {"time": 2438, "text": "What is, what is the, in your view, currently the hardest aspect of autonomous driving?"}, {"time": 2445, "text": "Is it negotiating with pedestrians?"}, {"time": 2449, "text": "Is it edge cases of perception?"}, {"time": 2451, "text": "Is it planning?"}, {"time": 2452, "text": "Is there a mechanical engineering?"}, {"time": 2454, "text": "Is it data, fleet stuff?"}, {"time": 2457, "text": "What are your thoughts on the challenge, the more challenging aspects there?"}, {"time": 2460, "text": "That's a, that's a good question."}, {"time": 2462, "text": "I think before, before we go to that, though, I just want to, I like what you said about the psychology aspect of this, because I think one observation I've made is I think I read somewhere that I think it's maybe Americans on average spend, you know, over an hour a day on social media, like staring at Facebook."}, {"time": 2478, "text": "And so that's just, you know, 60 minutes of your life, you're not getting back."}, {"time": 2481, "text": "It's probably not super productive."}, {"time": 2483, "text": "And so that's 3,600 seconds, right?"}, {"time": 2486, "text": "And that's, that's time, you know, it's a lot of time you're giving up."}, {"time": 2490, "text": "And if you compare that to people being on the road, if another vehicle, whether it's a human driver or autonomous vehicle, delays them by even three seconds, they're laying in on the horn, you know, even though that's, that's, you know, one, one thousandth of the time they waste looking at Facebook every day."}, {"time": 2506, "text": "So there's, there's definitely some."}, {"time": 2508, "text": "You know, psychology aspects of this, I think that are pretty interesting road rage in general."}, {"time": 2511, "text": "And then the question of course is if everyone is in self driving cars, do they even notice these three second delays anymore?"}, {"time": 2517, "text": "Cause they're doing other things or reading or working or just talking to each other."}, {"time": 2521, "text": "So it'll be interesting to see where that goes."}, {"time": 2523, "text": "In a certain aspect, people, people need to be distracted by something entertaining, something useful inside the car."}, {"time": 2529, "text": "So they don't pay attention to the external world."}, {"time": 2530, "text": "And then, and then they can take whatever psychology and bring it back to Twitter and then focus on that as opposed to sort of interacting, sort of putting the emotion out there into the world."}, {"time": 2543, "text": "So it's a, it's an interesting problem, but baseline autonomy."}, {"time": 2546, "text": "I guess you could say self driving cars, you know, at scale will lower the collective blood pressure of society probably by a couple of points without all that road rage and stress."}, {"time": 2555, "text": "So that's a good, good external."}, {"time": 2558, "text": "So back to your question about the technology and the, I guess the biggest problems."}, {"time": 2563, "text": "And I have a hard time answering that question because, you know, we've been at this like specifically focusing on driverless cars and all the technology needed to enable that for a little over four and a half years now."}, {"time": 2575, "text": "And even a year or two in, I felt like we had completed the functionality needed to get someone from point A to point B."}, {"time": 2584, "text": "As in, if we need to do a left turn maneuver, or if we need to drive around at, you know, a double parked vehicle into oncoming traffic or navigate through construction zones, the scaffolding and the building blocks was there pretty early on."}, {"time": 2597, "text": "And so the challenge is not any one scenario or situation for which, you know, we fail at 100% of those."}, {"time": 2605, "text": "It's more, you know, we're benchmarking against a pretty good or pretty high standard, which is human driving."}, {"time": 2611, "text": "All things considered, humans are excellent at handling edge cases and unexpected scenarios where computers are the opposite."}, {"time": 2618, "text": "And so beating that baseline set by humans is the challenge."}, {"time": 2623, "text": "And so what we've been doing for quite some time now is basically, it's this continuous improvement process where we find sort of the most, you know, uncomfortable or the things that could lead to a safety issue or other things, all these events."}, {"time": 2640, "text": "And then we sort of categorize them and rework parts of our system to make incremental improvements and do that over and over and over again."}, {"time": 2647, "text": "And we just see sort of the overall performance of the system, you know, actually increasing in a pretty steady clip."}, {"time": 2653, "text": "But there's no one thing."}, {"time": 2655, "text": "There's actually like thousands of little things and just like polishing functionality and making sure that it handles, you know, every version and possible permutation of a situation by either applying more deep learning systems or just by, you know, adding more test coverage or new scenarios that we develop against and just grinding on that."}, {"time": 2677, "text": "We're sort of in the unsexy phase of development right now, which is doing the real engineering work that it takes to go from prototype to production."}, {"time": 2684, "text": "You're basically scaling the grinding, sort of taking seriously that the process of all those edge cases, both with human experts and machine learning methods to cover all those situations."}, {"time": 2699, "text": "And the exciting thing for me is I don't think that grinding ever stops because there's a moment in time where you've crossed that threshold of human performance and become superhuman."}, {"time": 2709, "text": "But there's no reason, there's no first principles reason that AV capability will tap out anywhere near humans."}, {"time": 2716, "text": "Like there's no reason it couldn't be 20 times better, whether that's, you know, just better driving or safer driving or more comfortable driving or even a thousand times better given enough time."}, {"time": 2725, "text": "And we intend to basically chase that, you know, forever to build the best possible product."}, {"time": 2731, "text": "Better and better and better."}, {"time": 2732, "text": "And always new edge cases come up and new experiences."}, {"time": 2734, "text": "So, and you want to automate that process as much as possible."}, {"time": 2740, "text": "So what do you think in general in society?"}, {"time": 2743, "text": "When do you think we may have hundreds of thousands of fully autonomous vehicles driving around?"}, {"time": 2748, "text": "So first of all, predictions, nobody knows the future."}, {"time": 2752, "text": "You're a part of the leading people trying to define that future, but even then you still don't know."}, {"time": 2756, "text": "But if you think about hundreds of thousands of vehicles, so a significant fraction of vehicles in major cities are autonomous."}, {"time": 2765, "text": "Do you think, are you with Rodney Brooks, who is 2050 and beyond, or are you more with Elon Musk, who is, we should have had that two years ago?"}, {"time": 2779, "text": "Well, I mean, I'd love to have it two years ago, but we're not there yet."}, {"time": 2784, "text": "So I guess the way I would think about that is let's flip that question around."}, {"time": 2789, "text": "So what would prevent you to reach hundreds of thousands of vehicles?"}, {"time": 2794, "text": "And that's a good, that's a good rephrasing."}, {"time": 2797, "text": "So the, I'd say the, it seems the consensus among the people developing self driving cars today is to sort of start with some form of an easier environment, whether it means, you know, lacking inclement weather or, you know, mostly sunny or whatever it is."}, {"time": 2817, "text": "And then add, add capability for more complex situations over time."}, {"time": 2822, "text": "And so if you're only able to deploy in areas that meet sort of your criteria or the current domain, you know, operating domain of the software you developed, that may put a cap on how many cities you could deploy in."}, {"time": 2836, "text": "But then as those restrictions start to fall away, like maybe you add capability to drive really well and safely in heavy rain or snow, you know, that, that probably opens up the market by two, two or three fold in terms of the cities you can expand into and so on."}, {"time": 2851, "text": "And so the real question is, you know, I know today if we wanted to, we could produce that, that many autonomous vehicles, but we wouldn't be able to make use of all of them yet."}, {"time": 2859, "text": "Cause we would sort of saturate the demand in the cities in which we would want to operate initially."}, {"time": 2866, "text": "So if I were to guess like what the timeline is for those things falling away and reaching hundreds of thousands of vehicles, I would say that thousands of vehicles, maybe a range is better, I would say less than five years, less than five years."}, {"time": 2879, "text": "And of course you're working hard to make that happen."}, {"time": 2883, "text": "So you started two companies that were eventually acquired for each four billion dollars."}, {"time": 2889, "text": "So you're a pretty good person to ask, what does it take to build a successful startup?"}, {"time": 2895, "text": "I think there's, there's sort of survivor bias here a little bit, but I can try to find some common threads for the things that worked for me, which is, you know, in, in both of these companies, I was really passionate about the core technology."}, {"time": 2909, "text": "I actually like, you know, lay awake at night thinking about these problems and how to solve them."}, {"time": 2913, "text": "And I think that's helpful because when you start a business, there are like to this day, there are these crazy ups and downs."}, {"time": 2920, "text": "Like one day you think the business is just on, you're just on top of the world and unstoppable."}, {"time": 2924, "text": "And the next day you think, okay, this is all going to end, you know, it's just, it's just going south and it's going to be over tomorrow."}, {"time": 2929, "text": "And and so I think like having a true passion that you can fall back on and knowing that you would be doing it, even if you weren't getting paid for it, helps you weather those, those tough times."}, {"time": 2940, "text": "So that's one thing."}, {"time": 2941, "text": "I think the other one is really good people."}, {"time": 2945, "text": "So I've always been surrounded by really good cofounders that are logical thinkers are always pushing their limits and have very high levels of integrity."}, {"time": 2952, "text": "So that's Dan Kahn and my current company and actually his brother and a couple other guys for Justin TV and Twitch."}, {"time": 2998, "text": "And the only things that can slow you down are, you know, running out of money or I suppose your competitors destroying you."}, {"time": 3002, "text": "But I think most of the time it's, it's people giving up or, or somehow destroying things themselves rather than being beaten by their competition or running out of money."}, {"time": 3011, "text": "If you never quit, eventually you'll arrive."}, {"time": 3013, "text": "So, uh, it's a much more concise version of what I was trying to say."}, {"time": 3016, "text": "Yeah, that was good."}, {"time": 3018, "text": "So you went the Y Combinator route twice."}, {"time": 3021, "text": "What do you think in a quick question, do you think is the best way to raise funds in the early days or not just funds, but just community develop your idea and so on."}, {"time": 3032, "text": "Can you do it solo or maybe with a co founder with like self funded?"}, {"time": 3038, "text": "Do you think Y Combinator is good?"}, {"time": 3040, "text": "Is it good to do VC route?"}, {"time": 3041, "text": "Is there no right answer or is there from the Y Combinator experience something that you could take away that that was the right path to take?"}]}]