[{"title": "Tomaso Poggio: Brains, Minds, and Machines | Lex Fridman Podcast #13", "id": "aSyZvBrPAyk", "quotes": [{"time": 427, "text": "But there were so many other problems of the same level of difficulty and importance that I could, even if I were Einstein, it was difficult to hope to solve all of them."}, {"time": 439, "text": "So what about solving a problem whose solution allowed me to solve all the problems?"}, {"time": 446, "text": "And this was, what if we could find the key to an intelligence 10 times better or faster than Einstein?"}, {"time": 457, "text": "So that's sort of seeing artificial intelligence as a tool to expand our capabilities."}, {"time": 463, "text": "But is there just an inherent curiosity in you in just understanding what it is in here that makes it all work?"}, {"time": 474, "text": "Yes, absolutely, you're right."}, {"time": 475, "text": "So I started saying this was the motivation when I was a teenager."}, {"time": 480, "text": "But soon after, I think the problem of human intelligence became a real focus of my science and my research because I think for me, the most interesting problem is really asking who we are."}, {"time": 508, "text": "It's asking not only a question about science, but even about the very tool we are using to do science, which is our brain."}, {"time": 517, "text": "How does our brain work?"}, {"time": 519, "text": "From where does it come from?"}, {"time": 522, "text": "What are its limitations?"}, {"time": 523, "text": "Can we make it better?"}, {"time": 526, "text": "And that, in many ways, is the ultimate question that underlies this whole effort of science."}, {"time": 534, "text": "So you've made significant contributions in both the science of intelligence and the engineering of intelligence."}, {"time": 542, "text": "In a hypothetical way, let me ask, how far do you think we can get in creating intelligence systems without understanding the biological, the understanding how the human brain creates intelligence?"}, {"time": 555, "text": "Put another way, do you think we can build a strong AI system without really getting at the core understanding the functional nature of the brain?"}, {"time": 565, "text": "Well, this is a real difficult question."}, {"time": 569, "text": "We did solve problems like flying without really using too much our knowledge about how birds fly."}, {"time": 584, "text": "It was important, I guess, to know that you could have things heavier than air being able to fly, like birds."}, {"time": 596, "text": "But beyond that, probably we did not learn very much, some."}, {"time": 602, "text": "The Brothers Wright did learn a lot of observation about birds and designing their aircraft."}, {"time": 612, "text": "But you can argue we did not use much of biology in that particular case."}, {"time": 617, "text": "Now, in the case of intelligence, I think that it's a bit of a bet right now."}, {"time": 628, "text": "If you ask, OK, we all agree we'll get at some point, maybe soon, maybe later, to a machine that is indistinguishable from my secretary, say, in terms of what I can ask the machine to do."}, {"time": 647, "text": "I think we'll get there."}, {"time": 649, "text": "And now the question is, you can ask people, do you think we'll get there without any knowledge about the human brain?"}, {"time": 657, "text": "Or that the best way to get there is to understand better the human brain?"}, {"time": 662, "text": "OK, this is, I think, an educated bet that different people with different backgrounds will decide in different ways."}, {"time": 671, "text": "The recent history of the progress in AI in the last, I would say, five years or 10 years has been that the main breakthroughs, the main recent breakthroughs, really start from neuroscience."}, {"time": 692, "text": "I can mention reinforcement learning as one."}, {"time": 695, "text": "It's one of the algorithms at the core of AlphaGo, which is the system that beat the kind of an official world champion of Go, Lee Sedol, two, three years ago in Seoul."}, {"time": 713, "text": "And that started really with the work of Pavlov in 1900, Marvin Minsky in the 60s, and many other neuroscientists later on."}, {"time": 727, "text": "And deep learning started, which is at the core, again, of AlphaGo and systems like autonomous driving systems for cars, like the systems that Mobileye, which is a company started by one of my ex postdocs, Amnon Shashua, did."}, {"time": 748, "text": "So that is at the core of those things."}, {"time": 750, "text": "And deep learning, really, the initial ideas in terms of the architecture of these layered hierarchical networks started with work of Torsten Wiesel and David Hubel at Harvard up the river in the 60s."}, {"time": 767, "text": "So recent history suggests that neuroscience played a big role in these breakthroughs."}, {"time": 774, "text": "My personal bet is that there is a good chance they continue to play a big role."}, {"time": 779, "text": "Maybe not in all the future breakthroughs, but in some of them."}, {"time": 783, "text": "At least in inspiration."}, {"time": 785, "text": "At least in inspiration, absolutely, yes."}, {"time": 787, "text": "So you studied both artificial and biological neural networks."}, {"time": 792, "text": "You said these mechanisms that underlie deep learning and reinforcement learning."}, {"time": 799, "text": "But there is nevertheless significant differences between biological and artificial neural networks as they stand now."}, {"time": 807, "text": "So between the two, what do you find is the most interesting, mysterious, maybe even beautiful difference as it currently stands in our understanding?"}, {"time": 817, "text": "I must confess that until recently, I found that the artificial networks, too simplistic relative to real neural networks."}, {"time": 829, "text": "But recently, I've been starting to think that, yes, there is a very big simplification of what you find in the brain."}, {"time": 839, "text": "But on the other hand, they are much closer in terms of the architecture to the brain than other models that we had, that computer science used as model of thinking, which were mathematical logics, LISP, Prologue, and those kind of things."}, {"time": 859, "text": "So in comparison to those, they're much closer to the brain."}, {"time": 863, "text": "You have networks of neurons, which is what the brain is about."}, {"time": 867, "text": "And the artificial neurons in the models, as I said, caricature of the biological neurons."}, {"time": 875, "text": "But they're still neurons, single units communicating with other units, something that is absent in the traditional computer type models of mathematics, reasoning, and so on."}, {"time": 890, "text": "So what aspect would you like to see in artificial neural networks added over time as we try to figure out ways to improve them?"}, {"time": 899, "text": "So one of the main differences and problems in terms of deep learning today, and it's not only deep learning, and the brain, is the need for deep learning techniques to have a lot of labeled examples."}, {"time": 923, "text": "For instance, for ImageNet, you have like a training set, which is 1 million images, each one labeled by some human in terms of which object is there."}, {"time": 934, "text": "And it's clear that in biology, a baby may be able to see millions of images in the first years of life, but will not have millions of labels given to him or her by parents or caretakers."}, {"time": 956, "text": "So how do you solve that?"}, {"time": 959, "text": "I think there is this interesting challenge that today, deep learning and related techniques are all about big data, big data meaning a lot of examples labeled by humans, whereas in nature, you have this big data is n going to infinity."}, {"time": 986, "text": "That's the best, n meaning labeled data."}, {"time": 990, "text": "But I think the biological world is more n going to 1."}, {"time": 994, "text": "A child can learn from a very small number of labeled examples."}, {"time": 1002, "text": "Like you tell a child, this is a car."}, {"time": 1004, "text": "You don't need to say, like in ImageNet, this is a car, this is a car, this is not a car, this is not a car, 1 million times."}, {"time": 1014, "text": "And of course, with AlphaGo, or at least the AlphaZero variants, because the world of Go is so simplistic that you can actually learn by yourself through self play, you can play against each other."}, {"time": 1028, "text": "In the real world, the visual system that you've studied extensively is a lot more complicated than the game of Go."}, {"time": 1036, "text": "On the comment about children, which are fascinatingly good at learning new stuff, how much of it do you think is hardware, and how much of it is software?"}, {"time": 1046, "text": "Yeah, that's a good, deep question."}, {"time": 1049, "text": "In a sense, it's the old question of nurture and nature, how much is in the gene, and how much is in the experience of an individual."}, {"time": 1061, "text": "Obviously, it's both that play a role."}, {"time": 1064, "text": "And I believe that the way evolution gives, puts prior information, so to speak, hardwired, is not really hardwired."}, {"time": 1078, "text": "But that's essentially an hypothesis."}, {"time": 1082, "text": "I think what's going on is that evolution has almost necessarily, if you believe in Darwin, is very opportunistic."}, {"time": 1094, "text": "And think about our DNA and the DNA of Drosophila."}, {"time": 1104, "text": "Our DNA does not have many more genes than Drosophila."}, {"time": 1108, "text": "The fly."}, {"time": 1109, "text": "The fly, the fruit fly."}, {"time": 1112, "text": "Now, we know that the fruit fly does not learn very much during its individual existence."}, {"time": 1119, "text": "It looks like one of these machinery that it's really mostly, not 100%, but 95%, hardcoded by the genes."}, {"time": 1131, "text": "But since we don't have many more genes than Drosophila, evolution could encode in as a general learning machinery, and then had to give very weak priors."}, {"time": 1149, "text": "Like, for instance, let me give a specific example, which is recent work by a member of our Center for Brains, Minds, and Machines."}, {"time": 1160, "text": "We know because of work of other people in our group and other groups, that there are cells in a part of our brain, neurons, that are tuned to faces."}, {"time": 1171, "text": "They seem to be involved in face recognition."}, {"time": 1173, "text": "Now, this face area seems to be present in young children and adults."}, {"time": 1184, "text": "And one question is, is there from the beginning?"}, {"time": 1188, "text": "Is hardwired by evolution?"}, {"time": 1191, "text": "Or somehow it's learned very quickly."}, {"time": 1195, "text": "So what's your, by the way, a lot of the questions I'm asking, the answer is we don't really know."}, {"time": 1200, "text": "But as a person who has contributed some profound ideas in these fields, you're a good person to guess at some of these."}, {"time": 1208, "text": "So of course, there's a caveat before a lot of the stuff we talk about."}, {"time": 1211, "text": "But what is your hunch?"}, {"time": 1214, "text": "Is the face, the part of the brain that seems to be concentrated on face recognition, are you born with that?"}, {"time": 1221, "text": "Or you just is designed to learn that quickly, like the face of the mother and so on?"}, {"time": 1226, "text": "My hunch, my bias was the second one, learned very quickly."}, {"time": 1232, "text": "And it turns out that Marge Livingstone at Harvard has done some amazing experiments in which she raised baby monkeys, depriving them of faces during the first weeks of life."}, {"time": 1248, "text": "So they see technicians, but the technician have a mask."}, {"time": 1255, "text": "And so when they looked at the area in the brain of these monkeys that were usually defined faces, they found no face preference."}, {"time": 1270, "text": "So my guess is that what evolution does in this case is there is a plastic area, which is plastic, which is kind of predetermined to be imprinted very easily."}, {"time": 1286, "text": "But the command from the gene is not a detailed circuitry for a face template."}, {"time": 1292, "text": "Could be, but this will require probably a lot of bits."}, {"time": 1296, "text": "You had to specify a lot of connection of a lot of neurons."}, {"time": 1299, "text": "Instead, the command from the gene is something like imprint, memorize what you see most often in the first two weeks of life, especially in connection with food and maybe nipples."}, {"time": 1314, "text": "Well, source of food."}, {"time": 1315, "text": "And so that area is very plastic at first and then solidifies."}, {"time": 1320, "text": "It'd be interesting if a variant of that experiment would show a different kind of pattern associated with food than a face pattern, whether that could stick."}, {"time": 1330, "text": "There are indications that during that experiment, what the monkeys saw quite often were the blue gloves of the technicians that were giving to the baby monkeys the milk."}, {"time": 1345, "text": "And some of the cells, instead of being face sensitive in that area, are hand sensitive."}, {"time": 1355, "text": "Can you talk about what are the different parts of the brain and, in your view, sort of loosely, and how do they contribute to intelligence?"}, {"time": 1365, "text": "Do you see the brain as a bunch of different modules, and they together come in the human brain to create intelligence?"}, {"time": 1373, "text": "Or is it all one mush of the same kind of fundamental architecture?"}, {"time": 1384, "text": "Yeah, that's an important question."}, {"time": 1388, "text": "And there was a phase in neuroscience back in the 1950 or so in which it was believed for a while that the brain was equipotential."}, {"time": 1401, "text": "This was the term."}, {"time": 1402, "text": "You could cut out a piece, and nothing special happened apart a little bit less performance."}, {"time": 1412, "text": "There was a surgeon, Lashley, who did a lot of experiments of this type with mice and rats and concluded that every part of the brain was essentially equivalent to any other one."}, {"time": 1431, "text": "It turns out that that's really not true."}, {"time": 1436, "text": "There are very specific modules in the brain, as you said."}, {"time": 1440, "text": "And people may lose the ability to speak if you have a stroke in a certain region, or may lose control of their legs in another region."}, {"time": 1452, "text": "So they're very specific."}, {"time": 1454, "text": "The brain is also quite flexible and redundant, so often it can correct things and take over functions from one part of the brain to the other."}, {"time": 1469, "text": "But really, there are specific modules."}, {"time": 1473, "text": "So the answer that we know from this old work, which was basically based on lesions, either on animals, or very often there was a mine of very interesting data coming from the war, from different types of injuries that soldiers had in the brain."}, {"time": 1503, "text": "And more recently, functional MRI, which allow you to check which part of the brain are active when you are doing different tasks, can replace some of this."}, {"time": 1523, "text": "You can see that certain parts of the brain are involved, are active in certain tasks."}, {"time": 1529, "text": "Vision, language, yeah, that's right."}, {"time": 1532, "text": "But sort of taking a step back to that part of the brain that discovers that specializes in the face and how that might be learned, what's your intuition behind?"}, {"time": 1545, "text": "Is it possible that from a physicist perspective, when you get lower and lower, that it's all the same stuff and it just, when you're born, it's plastic and quickly figures out this part is going to be about vision, this is going to be about language, this is about common sense reasoning."}, {"time": 1562, "text": "Do you have an intuition that that kind of learning is going on really quickly, or is it really kind of solidified in hardware?"}, {"time": 1569, "text": "That's a great question."}, {"time": 1571, "text": "So there are parts of the brain like the cerebellum or the hippocampus that are quite different from each other."}, {"time": 1581, "text": "They clearly have different anatomy, different connectivity."}, {"time": 1586, "text": "Then there is the cortex, which is the most developed part of the brain in humans."}, {"time": 1596, "text": "And in the cortex, you have different regions of the cortex that are responsible for vision, for audition, for motor control, for language."}, {"time": 1607, "text": "Now, one of the big puzzles of this is that in the cortex is the cortex is the cortex."}, {"time": 1615, "text": "Looks like it is the same in terms of hardware, in terms of type of neurons and connectivity across these different modalities."}, {"time": 1628, "text": "So for the cortex, I think aside these other parts of the brain like spinal cord, hippocampus, cerebellum, and so on, for the cortex, I think your question about hardware and software and learning and so on, I think is rather open."}, {"time": 1648, "text": "And I find it very interesting for Risa to think about an architecture, computer architecture, that is good for vision and at the same time is good for language."}, {"time": 1661, "text": "Seems to be so different problem areas that you have to solve."}, {"time": 1669, "text": "But the underlying mechanism might be the same."}, {"time": 1671, "text": "And that's really instructive for artificial neural networks."}, {"time": 1675, "text": "So we've done a lot of great work in vision, in human vision, computer vision."}, {"time": 1681, "text": "And you mentioned the problem of human vision is really as difficult as the problem of general intelligence."}, {"time": 1687, "text": "And maybe that connects to the cortex discussion."}, {"time": 1691, "text": "Can you describe the human visual cortex and how the humans begin to understand the world through the raw sensory information?"}, {"time": 1702, "text": "What's, for folks who are not familiar, especially on the computer vision side, we don't often actually take a step back except saying with a sentence or two that one is inspired by the other."}, {"time": 1716, "text": "What is it that we know about the human visual cortex?"}, {"time": 1720, "text": "We know quite a bit."}, {"time": 1721, "text": "At the same time, we don't know a lot."}, {"time": 1723, "text": "But the bit we know, in a sense, we know a lot of the details."}, {"time": 1730, "text": "And many we don't know."}, {"time": 1733, "text": "And we know a lot of the top level, the answer to the top level question."}, {"time": 1740, "text": "But we don't know some basic ones, even in terms of general neuroscience, forgetting vision."}, {"time": 1746, "text": "Why do we sleep?"}, {"time": 1748, "text": "It's such a basic question."}, {"time": 1751, "text": "And we really don't have an answer to that."}, {"time": 1755, "text": "So taking a step back on that."}, {"time": 1757, "text": "So sleep, for example, is fascinating."}, {"time": 1758, "text": "Do you think that's a neuroscience question?"}, {"time": 1762, "text": "Or if we talk about abstractions, what do you think is an interesting way to study intelligence or most effective on the levels of abstraction?"}, {"time": 1770, "text": "Is it chemical, is it biological, is it electrophysical, mathematical, as you've done a lot of excellent work on that side?"}, {"time": 1777, "text": "Which psychology, at which level of abstraction do you think?"}, {"time": 1783, "text": "Well, in terms of levels of abstraction, I think we need all of them."}, {"time": 1790, "text": "It's like if you ask me, what does it mean to understand a computer?"}, {"time": 1797, "text": "That's much simpler."}, {"time": 1798, "text": "But in a computer, I could say, well, I understand how to use PowerPoint."}, {"time": 1804, "text": "That's my level of understanding a computer."}, {"time": 1808, "text": "It is reasonable."}, {"time": 1809, "text": "It gives me some power to produce slides and beautiful slides."}, {"time": 1814, "text": "Now, you can ask somebody else."}, {"time": 1817, "text": "He says, well, I know how the transistors work that are inside the computer."}, {"time": 1821, "text": "I can write the equation for transistor and diodes and circuits, logical circuits."}, {"time": 1829, "text": "And I can ask this guy, do you know how to operate PowerPoint?"}, {"time": 1834, "text": "So do you think if we discovered computers walking amongst us full of these transistors that are also operating under windows and have PowerPoint, do you think it's digging in a little bit more?"}, {"time": 1849, "text": "How useful is it to understand the transistor in order to be able to understand PowerPoint and these higher level intelligent processes?"}, {"time": 1860, "text": "So I think in the case of computers, because they were made by engineers, by us, this different level of understanding are rather separate on purpose."}, {"time": 1873, "text": "They are separate modules so that the engineer that designed the circuit for the chips does not need to know what is inside PowerPoint."}, {"time": 1883, "text": "And somebody can write the software translating from one to the other."}, {"time": 1890, "text": "So in that case, I don't think understanding the transistor helps you understand PowerPoint, or very little."}, {"time": 1901, "text": "If you want to understand the computer, this question, I would say you have to understand it at different levels."}, {"time": 1906, "text": "If you really want to build one, right?"}, {"time": 1911, "text": "But for the brain, I think these levels of understanding, so the algorithms, which kind of computation, the equivalent of PowerPoint, and the circuits, the transistors, I think they are much more intertwined with each other."}, {"time": 1929, "text": "There is not a neatly level of the software separate from the hardware."}, {"time": 1935, "text": "And so that's why I think in the case of the brain, the problem is more difficult and more than for computers requires the interaction, the collaboration between different types of expertise."}, {"time": 1950, "text": "The brain is a big hierarchical mess."}, {"time": 1952, "text": "You can't just disentangle levels."}, {"time": 1955, "text": "I think you can, but it's much more difficult."}, {"time": 1957, "text": "And it's not completely obvious."}, {"time": 1960, "text": "And as I said, I think it's one of the, personally, I think is the greatest problem in science."}, {"time": 1967, "text": "So I think it's fair that it's difficult."}, {"time": 1971, "text": "That's a difficult one."}, {"time": 1973, "text": "That said, you do talk about compositionality and why it might be useful."}, {"time": 1978, "text": "And when you discuss why these neural networks, in artificial or biological sense, learn anything, you talk about compositionality."}, {"time": 1987, "text": "See, there's a sense that nature can be disentangled."}, {"time": 1993, "text": "Or, well, all aspects of our cognition could be disentangled to some degree."}, {"time": 2002, "text": "So why do you think, first of all, how do you see compositionality?"}, {"time": 2007, "text": "And why do you think it exists at all in nature?"}, {"time": 2011, "text": "I spoke about, I use the term compositionality when we looked at deep neural networks, multilayers, and trying to understand when and why they are more powerful than more classical one layer networks, like linear classifier, kernel machines, so called."}, {"time": 2041, "text": "And what we found is that in terms of approximating or learning or representing a function, a mapping from an input to an output, like from an image to the label in the image, if this function has a particular structure, then deep networks are much more powerful than shallow networks to approximate the underlying function."}, {"time": 2068, "text": "And the particular structure is a structure of compositionality."}, {"time": 2073, "text": "If the function is made up of functions of function, so that you need to look on when you are interpreting an image, classifying an image, you don't need to look at all pixels at once."}, {"time": 2091, "text": "But you can compute something from small groups of pixels."}, {"time": 2097, "text": "And then you can compute something on the output of this local computation and so on, which is similar to what you do when you read a sentence."}, {"time": 2107, "text": "You don't need to read the first and the last letter."}, {"time": 2111, "text": "But you can read syllables, combine them in words, combine the words in sentences."}, {"time": 2118, "text": "So this is this kind of structure."}, {"time": 2121, "text": "So that's as part of a discussion of why deep neural networks may be more effective than the shallow methods."}, {"time": 2127, "text": "And is your sense, for most things we can use neural networks for, those problems are going to be compositional in nature, like language, like vision?"}, {"time": 2144, "text": "How far can we get in this kind of way?"}, {"time": 2147, "text": "So here is almost philosophy."}, {"time": 2151, "text": "Well, let's go there."}, {"time": 2153, "text": "Yeah, let's go there."}, {"time": 2154, "text": "So a friend of mine, Max Tegmark, who is a physicist at MIT."}, {"time": 2160, "text": "I've talked to him on this thing."}, {"time": 2161, "text": "Yeah, and he disagrees with you, right?"}, {"time": 2163, "text": "A little bit."}, {"time": 2164, "text": "Yeah, we agree on most."}, {"time": 2167, "text": "But the conclusion is a bit different."}, {"time": 2170, "text": "His conclusion is that for images, for instance, the compositional structure of this function that we have to learn or to solve these problems comes from physics, comes from the fact that you have local interactions in physics between atoms and other atoms, between particle of matter and other particles, between planets and other planets, between stars and other."}, {"time": 2204, "text": "It's all local."}, {"time": 2208, "text": "And that's true."}, {"time": 2211, "text": "But you could push this argument a bit further."}, {"time": 2216, "text": "Not this argument, actually."}, {"time": 2217, "text": "You could argue that maybe that's part of the truth."}, {"time": 2222, "text": "But maybe what happens is kind of the opposite, is that our brain is wired up as a deep network."}, {"time": 2231, "text": "So it can learn, understand, solve problems that have this compositional structure and it cannot solve problems that don't have this compositional structure."}, {"time": 2249, "text": "So the problems we are accustomed to, we think about, we test our algorithms on, are this compositional structure because our brain is made up."}, {"time": 2262, "text": "And that's, in a sense, an evolutionary perspective that we've."}, {"time": 2266, "text": "So the ones that didn't have, that weren't dealing with the compositional nature of reality died off?"}, {"time": 2275, "text": "Yes, but also could be maybe the reason why we have this local connectivity in the brain, like simple cells in cortex looking only at the small part of the image, each one of them, and then other cells looking at the small number of these simple cells and so on."}, {"time": 2296, "text": "The reason for this may be purely that it was difficult to grow long range connectivity."}, {"time": 2305, "text": "So suppose it's for biology."}, {"time": 2308, "text": "It's possible to grow short range connectivity but not long range also because there is a limited number of long range that you can."}, {"time": 2319, "text": "And so you have this limitation from the biology."}, {"time": 2325, "text": "And this means you build a deep convolutional network."}, {"time": 2330, "text": "This would be something like a deep convolutional network."}, {"time": 2333, "text": "And this is great for solving certain class of problems."}, {"time": 2337, "text": "These are the ones we find easy and important for our life."}, {"time": 2342, "text": "And yes, they were enough for us to survive."}, {"time": 2347, "text": "And you can start a successful business on solving those problems with Mobileye."}, {"time": 2354, "text": "Driving is a compositional problem."}, {"time": 2357, "text": "So on the learning task, we don't know much about how the brain learns in terms of optimization."}, {"time": 2366, "text": "So the thing that's stochastic gradient descent is what artificial neural networks use for the most part to adjust the parameters in such a way that it's able to deal based on the label data, it's able to solve the problem."}, {"time": 2382, "text": "So what's your intuition about why it works at all?"}, {"time": 2390, "text": "How hard of a problem it is to optimize a neural network, artificial neural network?"}, {"time": 2396, "text": "Is there other alternatives?"}, {"time": 2398, "text": "Just in general, your intuition is behind this very simplistic algorithm that seems to do pretty good, surprisingly so."}, {"time": 2407, "text": "So I find neuroscience, the architecture of cortex, is really similar to the architecture of deep networks."}, {"time": 2417, "text": "So there is a nice correspondence there between the biology and this kind of local connectivity, hierarchical architecture."}, {"time": 2428, "text": "The stochastic gradient descent, as you said, is a very simple technique."}, {"time": 2435, "text": "It seems pretty unlikely that biology could do that from what we know right now about cortex and neurons and synapses."}, {"time": 2450, "text": "So it's a big question open whether there are other optimization learning algorithms that can replace stochastic gradient descent."}, {"time": 2462, "text": "And my guess is yes, but nobody has found yet a real answer."}, {"time": 2471, "text": "I mean, people are trying, still trying, and there are some interesting ideas."}, {"time": 2478, "text": "The fact that stochastic gradient descent is so successful, this has become clearly not so mysterious."}, {"time": 2487, "text": "And the reason is that it's an interesting fact."}, {"time": 2493, "text": "It's a change, in a sense, in how people think about statistics."}, {"time": 2499, "text": "And this is the following, is that typically when you had data and you had, say, a model with parameters, you are trying to fit the model to the data, to fit the parameter."}, {"time": 2515, "text": "Typically, the kind of crowd wisdom type idea was you should have at least twice the number of data than the number of parameters."}, {"time": 2532, "text": "Maybe 10 times is better."}, {"time": 2535, "text": "Now, the way you train neural networks these days is that they have 10 or 100 times more parameters than data, exactly the opposite."}, {"time": 2546, "text": "And it has been one of the puzzles about neural networks."}, {"time": 2554, "text": "How can you get something that really works when you have so much freedom?"}, {"time": 2560, "text": "From that little data, it can generalize somehow."}, {"time": 2564, "text": "Do you think the stochastic nature of it is essential, the randomness?"}, {"time": 2568, "text": "So I think we have some initial understanding why this happens."}, {"time": 2572, "text": "But one nice side effect of having this overparameterization, more parameters than data, is that when you look for the minima of a loss function, like stochastic gradient descent is doing, you find I made some calculations based on some old basic theorem of algebra called the Bezu theorem that gives you an estimate of the number of solution of a system of polynomial equation."}, {"time": 2605, "text": "Anyway, the bottom line is that there are probably more minima for a typical deep networks than atoms in the universe."}, {"time": 2619, "text": "Just to say, there are a lot because of the overparameterization."}, {"time": 2624, "text": "A more global minimum, zero minimum, good minimum."}, {"time": 2630, "text": "A more global minima."}, {"time": 2631, "text": "Yeah, a lot of them."}, {"time": 2633, "text": "So you have a lot of solutions."}, {"time": 2634, "text": "So it's not so surprising that you can find them relatively easily."}, {"time": 2640, "text": "And this is because of the overparameterization."}, {"time": 2644, "text": "The overparameterization sprinkles that entire space with solutions that are pretty good."}, {"time": 2649, "text": "It's not so surprising, right?"}, {"time": 2651, "text": "It's like if you have a system of linear equation and you have more unknowns than equations, then you have, we know, you have an infinite number of solutions."}, {"time": 2662, "text": "And the question is to pick one."}, {"time": 2664, "text": "That's another story."}, {"time": 2665, "text": "But you have an infinite number of solutions."}, {"time": 2667, "text": "So there are a lot of value of your unknowns that satisfy the equations."}, {"time": 2673, "text": "But it's possible that there's a lot of those solutions that aren't very good."}, {"time": 2677, "text": "What's surprising is that they're pretty good."}, {"time": 2680, "text": "Why can you pick one that generalizes well?"}, {"time": 2684, "text": "That's a separate question with separate answers."}, {"time": 2687, "text": "One theorem that people like to talk about that kind of inspires imagination of the power of neural networks is the universality, universal approximation theorem, that you can approximate any computable function with just a finite number of neurons in a single hidden layer."}, {"time": 2704, "text": "Do you find this theorem one surprising?"}, {"time": 2707, "text": "Do you find it useful, interesting, inspiring?"}, {"time": 2712, "text": "No, this one, I never found it very surprising."}, {"time": 2716, "text": "It was known since the 80s, since I entered the field, because it's basically the same as Weierstrass theorem, which says that I can approximate any continuous function with a polynomial of sufficiently, with a sufficient number of terms, monomials."}, {"time": 2738, "text": "So basically the same."}, {"time": 2739, "text": "And the proofs are very similar."}, {"time": 2741, "text": "So your intuition was there was never any doubt that neural networks in theory could be very strong approximators."}, {"time": 2748, "text": "The question, the interesting question, is that if this theorem says you can approximate, fine."}, {"time": 2758, "text": "But when you ask how many neurons, for instance, or in the case of polynomial, how many monomials, I need to get a good approximation."}, {"time": 2771, "text": "Then it turns out that that depends on the dimensionality of your function, how many variables you have."}, {"time": 2780, "text": "But it depends on the dimensionality of your function in a bad way."}, {"time": 2785, "text": "It's, for instance, suppose you want an error which is no worse than 10% in your approximation."}, {"time": 2795, "text": "You come up with a network that approximate your function within 10%."}, {"time": 2800, "text": "Then it turns out that the number of units you need are in the order of 10 to the dimensionality, d, how many variables."}, {"time": 2810, "text": "So if you have two variables, these two words, you have 100 units and OK."}, {"time": 2817, "text": "But if you have, say, 200 by 200 pixel images, now this is 40,000, whatever."}, {"time": 2826, "text": "We again go to the size of the universe pretty quickly."}, {"time": 2829, "text": "Exactly, 10 to the 40,000 or something."}, {"time": 2834, "text": "And so this is called the curse of dimensionality, not quite appropriately."}, {"time": 2842, "text": "And the hope is with the extra layers, you can remove the curse."}, {"time": 2848, "text": "What we proved is that if you have deep layers, hierarchical architecture with the local connectivity of the type of convolutional deep learning, and if you're dealing with a function that has this kind of hierarchical architecture, then you avoid completely the curse."}, {"time": 2870, "text": "You've spoken a lot about supervised deep learning."}, {"time": 2874, "text": "What are your thoughts, hopes, views on the challenges of unsupervised learning with GANs, with Generative Adversarial Networks?"}, {"time": 2885, "text": "Do you see those as distinct?"}, {"time": 2888, "text": "The power of GANs, do you see those as distinct from supervised methods in neural networks, or are they really all in the same representation ballpark?"}, {"time": 2896, "text": "GANs is one way to get estimation of probability densities, which is a somewhat new way that people have not done before."}, {"time": 2910, "text": "I don't know whether this will really play an important role in intelligence."}, {"time": 2919, "text": "Or it's interesting."}, {"time": 2923, "text": "I'm less enthusiastic about it than many people in the field."}, {"time": 2928, "text": "I have the feeling that many people in the field are really impressed by the ability of producing realistic looking images in this generative way."}, {"time": 2941, "text": "Which describes the popularity of the methods."}, {"time": 2943, "text": "But you're saying that while that's exciting and cool to look at, it may not be the tool that's useful for it."}, {"time": 2951, "text": "So you describe it kind of beautifully."}, {"time": 2953, "text": "Current supervised methods go n to infinity in terms of number of labeled points."}, {"time": 2958, "text": "And we really have to figure out how to go to n to 1."}, {"time": 2961, "text": "And you're thinking GANs might help, but they might not be the right."}, {"time": 2965, "text": "I don't think for that problem, which I really think is important, I think they may help."}, {"time": 2972, "text": "They certainly have applications, for instance, in computer graphics."}, {"time": 2975, "text": "And I did work long ago, which was a little bit similar in terms of saying, OK, I have a network."}, {"time": 2987, "text": "And I present images."}, {"time": 2989, "text": "And I can input its images."}, {"time": 2994, "text": "And output is, for instance, the pose of the image."}, {"time": 2997, "text": "A face, how much is smiling, is rotated 45 degrees or not."}, {"time": 3002, "text": "What about having a network that I train with the same data set, but now I invert input and output."}, {"time": 3010, "text": "Now the input is the pose or the expression, a number, set of numbers."}, {"time": 3016, "text": "And the output is the image."}, {"time": 3018, "text": "And I train it."}, {"time": 3020, "text": "And we did pretty good, interesting results in terms of producing very realistic looking images."}, {"time": 3027, "text": "It was a less sophisticated mechanism."}, {"time": 3031, "text": "But the output was pretty less than GANs."}, {"time": 3035, "text": "But the output was pretty much of the same quality."}, {"time": 3038, "text": "So I think for a computer graphics type application, yeah, definitely GANs can be quite useful."}, {"time": 3046, "text": "And not only for that, but for helping, for instance, on this problem of unsupervised example of reducing the number of labeled examples."}, {"time": 3062, "text": "I think people, it's like they think they can get out more than they put in."}, {"time": 3071, "text": "There's no free lunch, as you said."}, {"time": 3074, "text": "What do you think, what's your intuition?"}, {"time": 3077, "text": "How can we slow the growth of N to infinity in supervised, N to infinity in supervised learning?"}, {"time": 3085, "text": "So for example, Mobileye has very successfully, I mean, essentially annotated large amounts of data to be able to drive a car."}, {"time": 3094, "text": "Now one thought is, so we're trying to teach machines, school of AI."}, {"time": 3101, "text": "And we're trying to, so how can we become better teachers, maybe?"}, {"time": 3107, "text": "No, I like that."}, {"time": 3111, "text": "Because again, one caricature of the history of computer science, you could say, begins with programmers, expensive."}, {"time": 3125, "text": "Continuous labelers, cheap."}, {"time": 3129, "text": "And the future will be schools, like we have for kids."}, {"time": 3136, "text": "Currently, the labeling methods were not selective about which examples we teach networks with."}, {"time": 3145, "text": "So I think the focus of making networks that learn much faster is often on the architecture side."}, {"time": 3153, "text": "But how can we pick better examples with which to learn?"}, {"time": 3157, "text": "Do you have intuitions about that?"}, {"time": 3159, "text": "Well, that's part of the problem."}, {"time": 3162, "text": "But the other one is, if we look at biology, a reasonable assumption, I think, is in the same spirit that I said, evolution is opportunistic and has weak priors."}, {"time": 3183, "text": "The way I think the intelligence of a child, the baby may develop is by bootstrapping weak priors from evolution."}, {"time": 3197, "text": "For instance, you can assume that you have in most organisms, including human babies, built in some basic machinery to detect motion and relative motion."}, {"time": 3218, "text": "And in fact, we know all insects from fruit flies to other animals, they have this, even in the retinas, in the very peripheral part."}, {"time": 3233, "text": "It's very conserved across species, something that evolution discovered early."}, {"time": 3239, "text": "It may be the reason why babies tend to look in the first few days to moving objects and not to not moving objects."}, {"time": 3248, "text": "Now, moving objects means, OK, they're attracted by motion."}, {"time": 3252, "text": "But motion also means that motion gives automatic segmentation from the background."}, {"time": 3260, "text": "So because of motion boundaries, either the object is moving or the eye of the baby is tracking the moving object and the background is moving, right?"}, {"time": 3272, "text": "Yeah, so just purely on the visual characteristics of the scene, that seems to be the most useful."}, {"time": 3277, "text": "Right, so it's like looking at an object without background."}, {"time": 3283, "text": "It's ideal for learning the object."}, {"time": 3285, "text": "Otherwise, it's really difficult because you have so much stuff."}, {"time": 3290, "text": "So suppose you do this at the beginning, first weeks."}, {"time": 3295, "text": "Then after that, you can recognize object."}, {"time": 3298, "text": "Now they are imprinted, the number one, even in the background, even without motion."}, {"time": 3305, "text": "So that's, by the way, I just want to ask on the object recognition problem."}, {"time": 3310, "text": "So there is this being responsive to movement and doing edge detection, essentially."}, {"time": 3316, "text": "What's the gap between being effective at visually recognizing stuff, detecting where it is, and understanding the scene?"}, {"time": 3327, "text": "Is this a huge gap in many layers, or is it close?"}, {"time": 3332, "text": "No, I think that's a huge gap."}, {"time": 3335, "text": "I think present algorithm with all the success that we have and the fact that there are a lot of very useful, I think we are in a golden age for applications of low level vision and low level speech recognition and so on, Alexa and so on."}, {"time": 3356, "text": "There are many more things of similar level to be done, including medical diagnosis and so on."}, {"time": 3362, "text": "But we are far from what we call understanding of a scene, of language, of actions, of people."}, {"time": 3371, "text": "That is, despite the claims, that's, I think, very far."}, {"time": 3378, "text": "We're a little bit off."}, {"time": 3379, "text": "So in popular culture and among many researchers, some of which I've spoken with, the Stuart Russell and Elon Musk, in and out of the AI field, there's a concern about the existential threat of AI."}, {"time": 3394, "text": "And how do you think about this concern?"}, {"time": 3400, "text": "And is it valuable to think about large scale, long term, unintended consequences of intelligent systems we try to build?"}, {"time": 3411, "text": "I always think it's better to worry first, early, rather than late."}, {"time": 3418, "text": "So worry is good."}, {"time": 3420, "text": "I'm not against worrying at all."}, {"time": 3423, "text": "Personally, I think that it will take a long time before there is real reason to be worried."}, {"time": 3435, "text": "But as I said, I think it's good to put in place and think about possible safety against."}, {"time": 3444, "text": "What I find a bit misleading are things like that have been said by people I know, like Elon Musk, and what is Bostrom in particular, and what is his first name?"}, {"time": 3456, "text": "Nick Bostrom."}, {"time": 3457, "text": "Nick Bostrom, right."}, {"time": 3460, "text": "And a couple of other people that, for instance, AI is more dangerous than nuclear weapons."}, {"time": 3466, "text": "I think that's really wrong."}, {"time": 3470, "text": "That can be misleading."}, {"time": 3472, "text": "Because in terms of priority, we should still be more worried about nuclear weapons and what people are doing about it and so on than AI."}, {"time": 3485, "text": "And you've spoken about Demis Hassabis and yourself saying that you think you'll be about 100 years out before we have a general intelligence system that's on par with a human being."}, {"time": 3500, "text": "Do you have any updates for those predictions?"}, {"time": 3502, "text": "Well, I think he said."}, {"time": 3504, "text": "He said 20, I think."}, {"time": 3505, "text": "He said 20, right."}, {"time": 3506, "text": "This was a couple of years ago."}, {"time": 3507, "text": "I have not asked him again."}, {"time": 3509, "text": "So should I have?"}, {"time": 3511, "text": "Your own prediction, what's your prediction about when you'll be truly surprised?"}, {"time": 3518, "text": "And what's the confidence interval on that?"}, {"time": 3523, "text": "It's so difficult to predict the future and even the present sometimes."}, {"time": 3527, "text": "It's pretty hard to predict."}, {"time": 3528, "text": "But I would be, as I said, this is completely, I would be more like Rod Brooks."}, {"time": 3536, "text": "I think he's about 200 years."}, {"time": 3538, "text": "200 years."}, {"time": 3541, "text": "When we have this kind of AGI system, artificial general intelligence system, you're sitting in a room with her, him, it."}, {"time": 3552, "text": "Do you think the underlying design of such a system is something we'll be able to understand?"}, {"time": 3559, "text": "It will be simple?"}, {"time": 3560, "text": "Do you think it'll be explainable, understandable by us?"}, {"time": 3567, "text": "Your intuition, again, we're in the realm of philosophy a little bit."}, {"time": 3572, "text": "Well, probably no."}, {"time": 3576, "text": "But again, it depends what you really mean for understanding."}, {"time": 3582, "text": "So I think we don't understand how deep networks work."}, {"time": 3593, "text": "I think we are beginning to have a theory now."}, {"time": 3596, "text": "But in the case of deep networks, or even in the case of the simpler kernel machines or linear classifier, we really don't understand the individual units or so."}, {"time": 3611, "text": "But we understand what the computation and the limitations and the properties of it are."}, {"time": 3620, "text": "It's similar to many things."}, {"time": 3624, "text": "What does it mean to understand how a fusion bomb works?"}, {"time": 3629, "text": "How many of us understand the basic principle?"}, {"time": 3636, "text": "And some of us may understand deeper details."}, {"time": 3640, "text": "In that sense, understanding is, as a community, as a civilization, can we build another copy of it?"}, {"time": 3647, "text": "And in that sense, do you think there will need to be some evolutionary component where it runs away from our understanding?"}, {"time": 3656, "text": "Or do you think it could be engineered from the ground up, the same way you go from the transistor to PowerPoint?"}, {"time": 3662, "text": "So many years ago, this was actually 40, 41 years ago, I wrote a paper with David Marr, who was one of the founding fathers of computer vision, computational vision."}, {"time": 3680, "text": "I wrote a paper about levels of understanding, which is related to the question we discussed earlier about understanding PowerPoint, understanding transistors, and so on."}, {"time": 3691, "text": "And in that kind of framework, we had the level of the hardware and the top level of the algorithms."}, {"time": 3702, "text": "We did not have learning."}, {"time": 3705, "text": "Recently, I updated adding levels."}, {"time": 3708, "text": "And one level I added to those three was learning."}, {"time": 3715, "text": "And you can imagine, you could have a good understanding of how you construct a learning machine, like we do."}, {"time": 3724, "text": "But being unable to describe in detail what the learning machines will discover, right?"}, {"time": 3733, "text": "Now, that would be still a powerful understanding, if I can build a learning machine, even if I don't understand in detail every time it learns something."}, {"time": 3746, "text": "Just like our children, if they start listening to a certain type of music, I don't know, Miley Cyrus or something, you don't understand why they came to that particular preference."}, {"time": 3757, "text": "But you understand the learning process."}, {"time": 3759, "text": "That's very interesting."}, {"time": 3761, "text": "So on learning for systems to be part of our world, it has a certain, one of the challenging things that you've spoken about is learning ethics, learning morals."}, {"time": 3779, "text": "And how hard do you think is the problem of, first of all, humans understanding our ethics?"}, {"time": 3786, "text": "What is the origin on the neural on the low level of ethics?"}, {"time": 3790, "text": "What is it at the higher level?"}, {"time": 3792, "text": "Is it something that's learnable from machines in your intuition?"}, {"time": 3797, "text": "I think, yeah, ethics is learnable, very likely."}, {"time": 3803, "text": "I think it's one of these problems where I think understanding the neuroscience of ethics, people discuss there is an ethics of neuroscience."}, {"time": 3822, "text": "How a neuroscientist should or should not behave."}, {"time": 3826, "text": "Can you think of a neurosurgeon and the ethics rule he has to be or he, she has to be."}, {"time": 3833, "text": "But I'm more interested on the neuroscience of ethics."}, {"time": 3837, "text": "You're blowing my mind right now."}, {"time": 3838, "text": "The neuroscience of ethics is very meta."}, {"time": 3841, "text": "Yeah, and I think that would be important to understand also for being able to design machines that are ethical machines in our sense of ethics."}, {"time": 3855, "text": "And you think there is something in neuroscience, there's patterns, tools in neuroscience that could help us shed some light on ethics?"}, {"time": 3865, "text": "Or is it mostly on the psychologists of sociology in which higher level?"}, {"time": 3869, "text": "No, there is psychology."}, {"time": 3870, "text": "But there is also, in the meantime, there is evidence, fMRI, of specific areas of the brain that are involved in certain ethical judgment."}, {"time": 3884, "text": "And not only this, you can stimulate those area with magnetic fields and change the ethical decisions."}, {"time": 3896, "text": "So that's work by a colleague of mine, Rebecca Sachs."}, {"time": 3900, "text": "And there is other researchers doing similar work."}, {"time": 3905, "text": "And I think this is the beginning."}, {"time": 3908, "text": "But ideally, at some point, we'll have an understanding of how this works."}, {"time": 3915, "text": "And why it evolved, right?"}, {"time": 3918, "text": "The big why question."}, {"time": 3919, "text": "Yeah, it must have some purpose."}, {"time": 3922, "text": "Yeah, obviously it has some social purposes, probably."}, {"time": 3930, "text": "If neuroscience holds the key to at least illuminate some aspect of ethics, that means it could be a learnable problem."}, {"time": 3938, "text": "And as we're getting into harder and harder questions, let's go to the hard problem of consciousness."}, {"time": 3945, "text": "Is this an important problem for us to think about and solve on the engineering of intelligence side of your work, of our dream?"}, {"time": 3957, "text": "So again, this is a deep problem, partly because it's very difficult to define consciousness."}, {"time": 3966, "text": "And there is a debate among neuroscientists about whether consciousness and philosophers, of course, whether consciousness is something that requires flesh and blood, so to speak."}, {"time": 3991, "text": "Or could be that we could have silicon devices that are conscious, or up to statement like everything has some degree of consciousness and some more than others."}, {"time": 4008, "text": "This is like Giulio Tonioni and phi."}, {"time": 4013, "text": "We just recently talked to Christoph Koch."}, {"time": 4016, "text": "OK. Christoph was my first graduate student."}, {"time": 4020, "text": "Do you think it's important to illuminate aspects of consciousness in order to engineer intelligence systems?"}, {"time": 4030, "text": "Do you think an intelligent system would ultimately have consciousness?"}, {"time": 4034, "text": "Are they interlinked?"}, {"time": 4038, "text": "Most of the people working in artificial intelligence, I think, would answer, we don't strictly need consciousness to have an intelligent system."}, {"time": 4050, "text": "That's sort of the easier question, because it's a very engineering answer to the question."}, {"time": 4056, "text": "Pass the Turing test, we don't need consciousness."}, {"time": 4058, "text": "But if you were to go, do you think it's possible that we need to have that kind of self awareness?"}, {"time": 4068, "text": "We may, yes."}, {"time": 4069, "text": "So for instance, I personally think that when test a machine or a person in a Turing test, in an extended Turing test, I think consciousness is part of what we require in that test, implicitly, to say that this is intelligent."}, {"time": 4095, "text": "Christoph disagrees."}, {"time": 4097, "text": "Yes, he does."}, {"time": 4100, "text": "Despite many other romantic notions he holds, he disagrees with that one."}, {"time": 4104, "text": "Yes, that's right."}, {"time": 4106, "text": "So we'll see."}, {"time": 4109, "text": "Do you think, as a quick question, Ernest Becker's fear of death, do you think mortality and those kinds of things are important for consciousness and for intelligence?"}, {"time": 4129, "text": "The finiteness of life, finiteness of existence, or is that just a side effect of evolution, evolutionary side effect that's useful for natural selection?"}, {"time": 4141, "text": "Do you think this kind of thing that this interview is going to run out of time soon, our life will run out of time soon, do you think that's needed to make this conversation good and life good?"}, {"time": 4152, "text": "I never thought about it."}, {"time": 4153, "text": "It's a very interesting question."}, {"time": 4155, "text": "I think Steve Jobs, in his commencement speech at Stanford, argued that having a finite life was important for stimulating achievements."}, {"time": 4170, "text": "So it was different."}, {"time": 4171, "text": "Yeah, live every day like it's your last, right?"}, {"time": 4174, "text": "So rationally, I don't think strictly you need mortality for consciousness."}, {"time": 4183, "text": "But who knows?"}, {"time": 4185, "text": "They seem to go together in our biological system, right?"}, {"time": 4191, "text": "You've mentioned before, and students are associated with, AlphaGo immobilized the big recent success stories in AI."}, {"time": 4201, "text": "And I think it's captivated the entire world of what AI can do."}, {"time": 4206, "text": "So what do you think will be the next breakthrough?"}, {"time": 4210, "text": "And what's your intuition about the next breakthrough?"}, {"time": 4213, "text": "Of course, I don't know where the next breakthrough is."}, {"time": 4216, "text": "I think that there is a good chance, as I said before, that the next breakthrough will also be inspired by neuroscience."}, {"time": 4227, "text": "But which one, I don't know."}, {"time": 4232, "text": "And there's, so MIT has this quest for intelligence."}, {"time": 4235, "text": "And there's a few moon shots, which in that spirit, which ones are you excited about?"}, {"time": 4241, "text": "Which projects kind of?"}, {"time": 4244, "text": "Well, of course, I'm excited about one of the moon shots, which is our Center for Brains, Minds, and Machines, which is the one which is fully funded by NSF."}, {"time": 4258, "text": "And it is about visual intelligence."}, {"time": 4262, "text": "And that one is particularly about understanding."}, {"time": 4266, "text": "Visual intelligence, so the visual cortex, and visual intelligence in the sense of how we look around ourselves and understand the world around ourselves, meaning what is going on, how we could go from here to there without hitting obstacles, whether there are other agents, people in the environment."}, {"time": 4296, "text": "These are all things that we perceive very quickly."}, {"time": 4301, "text": "And it's something actually quite close to being conscious, not quite."}, {"time": 4307, "text": "But there is this interesting experiment that was run at Google X, which is in a sense is just a virtual reality experiment, but in which they had a subject sitting, say, in a chair with goggles, like Oculus and so on, earphones."}, {"time": 4331, "text": "And they were seeing through the eyes of a robot nearby to cameras, microphones for receiving."}, {"time": 4339, "text": "So their sensory system was there."}, {"time": 4343, "text": "And the impression of all the subject, very strong, they could not shake it off, was that they were where the robot was."}, {"time": 4355, "text": "They could look at themselves from the robot and still feel they were where the robot is."}, {"time": 4362, "text": "They were looking at their body."}, {"time": 4366, "text": "Theirself had moved."}, {"time": 4368, "text": "So some aspect of scene understanding has to have ability to place yourself, have a self awareness about your position in the world and what the world is."}, {"time": 4379, "text": "So we may have to solve the hard problem of consciousness to solve it."}, {"time": 4384, "text": "On their way, yes."}, {"time": 4385, "text": "It's quite a moonshine."}, {"time": 4387, "text": "So you've been an advisor to some incredible minds, including Demis Hassabis, Krzysztof Koch, Amna Shashua, like you said."}, {"time": 4397, "text": "All went on to become seminal figures in their respective fields."}, {"time": 4402, "text": "From your own success as a researcher and from perspective as a mentor of these researchers, having guided them in the way of advice, what does it take to be successful in science and engineering careers?"}, {"time": 4419, "text": "Whether you're talking to somebody in their teens, 20s, and 30s, what does that path look like?"}, {"time": 4428, "text": "It's curiosity and having fun."}, {"time": 4433, "text": "And I think it's important also having fun with other curious minds."}, {"time": 4442, "text": "It's the people you surround with too, so fun and curiosity."}, {"time": 4446, "text": "Is there, you mentioned Steve Jobs, is there also an underlying ambition that's unique that you saw?"}, {"time": 4454, "text": "Or does it really does boil down to insatiable curiosity and fun?"}, {"time": 4458, "text": "Well of course, it's being curious in an active and ambitious way, yes."}, {"time": 4469, "text": "But I think sometime in science, there are friends of mine who are like this."}, {"time": 4479, "text": "There are some of the scientists like to work by themselves and kind of communicate only when they complete their work or discover something."}, {"time": 4492, "text": "I think I always found the actual process of discovering something is more fun if it's together with other intelligent and curious and fun people."}, {"time": 4509, "text": "So if you see the fun in that process, the side effect of that process will be that you'll actually end up discovering some interesting things."}, {"time": 4516, "text": "So as you've led many incredible efforts here, what's the secret to being a good advisor, mentor, leader in a research setting?"}, {"time": 4528, "text": "Is it a similar spirit?"}]}]