[{"title": "Garry Nolan: UFOs and Aliens | Lex Fridman Podcast #262", "id": "uTCc2-1tbBQ", "quotes": [{"time": 302, "text": "So like some of the information, is that accurate to say is stored outside the body?"}, {"time": 309, "text": "The information is stored outside because there's a context of expectation."}, {"time": 313, "text": "Isn't that interesting?"}, {"time": 315, "text": "I mean, to linger on this point, if we were to run Earth over again a million times, how many different versions of this type of computer would we get?"}, {"time": 328, "text": "I think it would be different each time."}, {"time": 329, "text": "I mean, if you assume there's no such thing as fate, right, and it's not all pre programmed, and that there is some sort of, let's say, variation or randomness at the beginning, you would get as many different versions of life as you could imagine."}, {"time": 345, "text": "And I don't think it would all be unless there's something built into the substrate of the universe."}, {"time": 351, "text": "It wouldn't always be left handed proteins, right?"}, {"time": 355, "text": "But I wonder what the flap of a butterfly wing, what effects it has, because it's possible that this system is really good at finding the efficient answer, and maybe the efficient answer is, there's only a small finite set of them for this particular environment."}, {"time": 376, "text": "That's the kind of, in a way, the anthropomorphic universe of the multiverse expectations, right?"}, {"time": 381, "text": "That there's probably a zillion other kinds of universes out there if you believe in multiverse theory."}, {"time": 388, "text": "We only live in the ones where the rules are such that lifelike hours can exist."}, {"time": 395, "text": "So using that logic, how many alien civilizations do you think are out there?"}, {"time": 400, "text": "There's like trillions of environments, aka planets, or maybe you can think even bigger than planets."}, {"time": 411, "text": "How many lifelike organisms do you think are out there thriving, and maybe how many do you think are long gone, but were once here?"}, {"time": 421, "text": "I think, well, innumerable, I think in terms of the present."}, {"time": 425, "text": "Greater than zero."}, {"time": 426, "text": "Much greater than zero."}, {"time": 428, "text": "I mean, I would just be surprised."}, {"time": 429, "text": "What a waste, right, of all that space just for us if we're never gonna get there."}, {"time": 435, "text": "That would be my first way to think about it."}, {"time": 439, "text": "But second, I mean, I remember when I was about seven or eight years old, and I would love if any of your listeners could find this National Geographic."}, {"time": 451, "text": "I remember opening the page of the National Geographic."}, {"time": 455, "text": "I was about, again, seven to 10 years old, and it was sort of a current picture of the universe."}, {"time": 462, "text": "It was around probably 1968, 1969."}, {"time": 465, "text": "I just remember looking at it and thinking, what kinds of empires have risen and fallen across that space that we'll never know about?"}, {"time": 477, "text": "And isn't that sad that we know nothing about something so grand?"}, {"time": 483, "text": "And so I've always been a reader of science fiction because I like the creative ideas of what people come up with."}, {"time": 493, "text": "And I especially like science fiction writers that base it in good science, but base it also in evolution."}, {"time": 501, "text": "That if you evolve a civilization from something lifelike, right, some sort of biology, its assumptions about the universe will come from the environment in which it grew up."}, {"time": 516, "text": "So for instance, Larry Niven is a great writer, and he imagines different kinds of civilizations."}, {"time": 523, "text": "In some cases, what happens if intelligence evolved from a herd animal, right?"}, {"time": 530, "text": "Would you lead from behind, right?"}, {"time": 533, "text": "Would you be, you know, in his case, one of them were the so called puppeteers."}, {"time": 539, "text": "And to them, the moral imperative is cowardice."}, {"time": 543, "text": "You put other people forward to run the risk for you, right?"}, {"time": 547, "text": "And so he writes entire books around that premise."}, {"time": 551, "text": "There's another guy, Brin, David Brin is his name, and he writes the so called uplift universe books."}, {"time": 559, "text": "And in those, he takes different intelligences, each from a different evolutionary background."}, {"time": 568, "text": "And then he posits a civilization based around where and what they came from."}, {"time": 576, "text": "And so to me, I mean, that's just fun."}, {"time": 579, "text": "But I mean, back to your original question is how many are there?"}, {"time": 583, "text": "I think as many stars as we can see."}, {"time": 587, "text": "Now, how many are currently there?"}, {"time": 589, "text": "I don't know, I mean, that's the whole question of, you know, how long can a civilization last before it runs out of steam?"}, {"time": 598, "text": "And you, for instance, does it just get bored or does it transcend to something else?"}, {"time": 603, "text": "Or does it say, I've seen enough and I'm done?"}, {"time": 606, "text": "What does running out of steam look like?"}, {"time": 608, "text": "It could be destroy itself or get bored."}, {"time": 610, "text": "You know, or we've done everything we can and they just decide to stop."}, {"time": 616, "text": "I don't know, I just don't know."}, {"time": 617, "text": "It's that you all must worry that we stop reproducing or we slow down the reproduction rate to where the population can go to zero."}, {"time": 625, "text": "We can go to zero and we can't and we collapse."}, {"time": 627, "text": "I mean, so the only way to get around that is perhaps create enough machines with AI to take care of us."}, {"time": 641, "text": "You've talked to people that told stories of UFO encounters."}, {"time": 647, "text": "What is the most fascinating to you about the stories of these UFO encounters that you've heard that people have told you?"}, {"time": 654, "text": "The similarity of them, the uniformity of the stories."}, {"time": 660, "text": "Now, I just wanna say upfront, a lot of people think that when I speculate, I believe something, that's not true, right?"}, {"time": 671, "text": "Speculation is just creativity."}, {"time": 674, "text": "Speculation is the beginning of hypothesis."}, {"time": 677, "text": "None of what I hear in terms of the anecdotes do I necessarily believe are they true?"}, {"time": 684, "text": "But I still find them fascinating to listen to because at some level they're still raw data and you have to listen."}, {"time": 690, "text": "And once you start to hear the same story again and again, then you have to say, well, there might be something to it."}, {"time": 697, "text": "I mean, maybe it's some kind of a Jungian background in the human mind and human consciousness that creates these stories again and again as coming out of the DNA, it's coming out of that pre programmed something."}, {"time": 711, "text": "And Jung talked quite a bit about this kind of thing."}, {"time": 714, "text": "The collective unconscious."}, {"time": 716, "text": "But actually one of the most interesting ones I find is this constant message that you're not taking care of your world."}, {"time": 727, "text": "And this came long before climate change."}, {"time": 731, "text": "It came long before many kinds of, let's say current day memes around taking care of our planet, pollution, et cetera."}, {"time": 745, "text": "And so, for instance, perhaps the best example of this, the one that I find the most fascinating is a story out of Zimbabwe, 50 or 60 children, one afternoon in Zimbabwe."}, {"time": 759, "text": "It was a well educated group of white and black children who had lunchtime in the playground, saw a craft and they saw little men."}, {"time": 771, "text": "And they all ran into the teachers and they told the same story and they drew the same pictures."}, {"time": 776, "text": "And the message several of them got was you are not taking care of your planet."}, {"time": 783, "text": "And it got, you know, there's actually a movie coming out on this episode and 30 years later now, the people who were there, the children who've now grown up say, it happened to us."}, {"time": 796, "text": "Now, did it happen?"}, {"time": 798, "text": "Was it some sort of hallucination or was it an imposed hallucination by something?"}, {"time": 803, "text": "Was it material?"}, {"time": 804, "text": "I don't know, but these kids were seven to 10 years old."}, {"time": 810, "text": "You see them on video."}, {"time": 812, "text": "Seven to 10 year olds can't lie like that."}, {"time": 815, "text": "And so, you know, whether it's real or not, I don't know, but I find that fascinating data."}, {"time": 821, "text": "And again, it's these unconnected stories of individuals with the same story."}, {"time": 830, "text": "That is worthy of further inquiry."}, {"time": 836, "text": "Yeah, so here we are humans with limited cognitive capacities trying to make sense of the world, trying to understand what is real and not."}, {"time": 844, "text": "We have this DNA that somehow in complex ways is interacting with the environment."}, {"time": 849, "text": "And then we get these novel ideas that come from the populace."}, {"time": 859, "text": "And then they make us wonder about what it all means."}, {"time": 866, "text": "And so how to interpret it."}, {"time": 867, "text": "If you think from an alien perspective, how would you communicate with other lifelike organisms?"}, {"time": 874, "text": "You perhaps have to find in points on this interaction between the DNA and its manifestations in terms of the human mind and how it interacts with the environment."}, {"time": 889, "text": "So it gets some kind of, all right, what is this DNA?"}, {"time": 892, "text": "What does this environment have to get in somehow to like interact with it, to perturb the system to where these little ants, human like ants get like excited and figures and see stuff out."}, {"time": 905, "text": "Yeah, it has, and then somehow steer them."}, {"time": 909, "text": "First of all, for investigative purposes, understand like oftentimes to understand a system, you have to perturb it."}, {"time": 916, "text": "It's like poke at it to get excited or not."}, {"time": 919, "text": "And then the other ways you want to, if you worry about them, you can steer in one direction or another."}, {"time": 928, "text": "And this kind of idea that we're not taking care of our world, that's interesting."}, {"time": 934, "text": "I mean, that's comforting, that's hopeful because that means the greater intelligence, which is what I would hope would want to take care of us."}, {"time": 942, "text": "Like we want to take care of the gorillas in the national parks in Africa."}, {"time": 947, "text": "Yeah, but we don't want to take care of cockroaches."}, {"time": 949, "text": "So there's a line we draw."}, {"time": 951, "text": "So you have to hope that."}, {"time": 953, "text": "Right now we're a bunch of angry monkeys and maybe whatever these intelligences are, are also keeping an eye on us."}, {"time": 961, "text": "That you don't want a bunch of, you don't want the angry monkey troop stomping around the local galactic arm."}, {"time": 968, "text": "Do you think these folks are telling the truth?"}, {"time": 971, "text": "Do you think they saw what they say they saw?"}, {"time": 975, "text": "I think they saw what they said they saw, but I also think they saw what they were shown."}, {"time": 982, "text": "I mean, if you go back to the whole notion of, okay, how long has this been around?"}, {"time": 988, "text": "It didn't just start showing up in 1947, right?"}, {"time": 991, "text": "There are stories going back into the 1800s of people who saw things in their farming, in their farm fields in the US."}, {"time": 1000, "text": "It's in local newspapers from the 1800s, it's fascinating."}, {"time": 1006, "text": "But if you can go even further back, so to your point of how would you as a higher intelligence represent yourself to a lesser intelligence?"}, {"time": 1018, "text": "So let's go back to pre civilization."}, {"time": 1021, "text": "Maybe you show yourself as the spirits in the forest and you give messages through that."}, {"time": 1028, "text": "Once you get a little bit more civilized, then you show yourself as the gods and then you're God."}, {"time": 1033, "text": "Well, we don't believe in God anymore necessarily, not everybody does."}, {"time": 1037, "text": "So what do we believe in?"}, {"time": 1038, "text": "We believe in technology."}, {"time": 1039, "text": "So you show yourself as a form of technology, right?"}, {"time": 1042, "text": "But the common thread is you're not alone and there's something else here with you."}, {"time": 1048, "text": "And there's something that's, as you said, watching you and at least watching over your shoulder."}, {"time": 1055, "text": "But I think that like any good parent, you don't tell your student everything, you make them learn and learning requires mistakes because if you tell them everything, then they get lazy."}, {"time": 1070, "text": "You've looked at the brains of, or information coming from the brain of some of the people that have had UFO encounters."}, {"time": 1079, "text": "What's common about the brain of people who encounter UFOs?"}, {"time": 1084, "text": "So the study started with a group of, let's say a cohort of individuals that were brought to me and their MRIs to ask about the damage that had been seen in these individuals."}, {"time": 1099, "text": "It turns out that the majority of those patients ended up being, as far as we can tell, Havana syndrome."}, {"time": 1104, "text": "And so for me at least, that part of the story ends in terms of the injury, it's likely almost all Havana syndrome."}, {"time": 1113, "text": "That's somebody else's problem now, that's not my problem."}, {"time": 1118, "text": "But when we were looking at the brains of these individuals, we noticed something right in the center of the basal ganglia in many of these individuals that at first we thought was damage."}, {"time": 1129, "text": "It was basically an enriched patch of MRI dense neurons that we thought was damage, but then it was showing up in everybody."}, {"time": 1139, "text": "And then we looked and we said, oh, it's actually not."}, {"time": 1141, "text": "The other readings on these MRIs showed that actually that's living tissue."}, {"time": 1146, "text": "That's actually the head of the caudate in the pitamen."}, {"time": 1150, "text": "And at the time, and I remember even asking a good friend of mine at Stanford, who was a psychiatrist, what does the basal ganglia do?"}, {"time": 1158, "text": "He said, oh, the basal ganglia is just about movement and nerve and motor control."}, {"time": 1164, "text": "I said, well, that's odd because these other papers that we were reading at the time started to suggest that it was involved with higher intelligence and is actually downstream of the executive function and involved with intuition and planning."}, {"time": 1182, "text": "And then if you think about it, if you're gonna have motor control, which is centralized in one place, motor control requires knowledge of the environment."}, {"time": 1192, "text": "You don't wanna move something and hit the table."}, {"time": 1195, "text": "Or if you're walking across a room, you want to be aware and cognizant of what you might bump into."}, {"time": 1203, "text": "So obviously all of that planning requires access to all the senses."}, {"time": 1211, "text": "It requires access to your desires, memory, knowledge of where and what you want and desire to walk nearby."}, {"time": 1218, "text": "Like I used the example of if you're at a party, you wanna avoid that person, you like that person, the waiter is about to drop something."}, {"time": 1225, "text": "All without thinking, you maneuver."}, {"time": 1228, "text": "So that actually, all that planning is done in the basal ganglia."}, {"time": 1233, "text": "And it's actually now called the brain within the brain."}, {"time": 1236, "text": "It's a goal processing system."}, {"time": 1240, "text": "Subservient to executive function."}, {"time": 1243, "text": "So what we think we found there was not something which allows people to talk to UFOs."}, {"time": 1250, "text": "I mean, I think the UFO community took it a step too far."}, {"time": 1255, "text": "What I think we found was a form of higher functioning and processing."}, {"time": 1261, "text": "So what we then looked at, and this was the most fascinating part of it, we looked then at individuals in the families or those, let's say the index case individuals."}, {"time": 1274, "text": "And we found that it was actually in families."}, {"time": 1276, "text": "And more so, this is the most fascinating part."}, {"time": 1280, "text": "We've probably looked now at about 200 just random cases that you can download off of databases online."}, {"time": 1287, "text": "You don't see this higher connectivity."}, {"time": 1291, "text": "You only find it in what Kit Green would have called or has called higher functioning individuals."}, {"time": 1297, "text": "People who are, I mean, he called them savants."}, {"time": 1302, "text": "I don't have the means to, we haven't done the testing."}, {"time": 1307, "text": "But it turns out my family has it, right?"}, {"time": 1309, "text": "We found it in me, my brother, my sister, my mother."}, {"time": 1315, "text": "We found it as well in other individuals, husband and wife pairs."}, {"time": 1319, "text": "So statistically, if you had a group of 20 individuals and you found two husband wife pairs, both of whom had it, and yet it's only found at about, we think, one in 200, one in 300 individuals."}, {"time": 1331, "text": "The fact that two individuals came together, two sets of individuals came together, both of whom had it, implied either a restricted breeding group or attraction."}, {"time": 1375, "text": "I'm not looking at something that I should just ignore."}, {"time": 1378, "text": "I'm seeing something and I recognize it for, not what it is, but that it is something different than what is normally found in my environment."}, {"time": 1386, "text": "Yeah, you know, I have a little bit of that."}, {"time": 1389, "text": "I seem to see the magic in a lot of moments."}, {"time": 1393, "text": "I have a deep, it's obviously, not obviously, but it seems to be chemical in nature that I just am excited about life."}, {"time": 1403, "text": "I love life."}, {"time": 1405, "text": "I love stupid things."}, {"time": 1406, "text": "It feels like I'm high a lot, on mushrooms or something like that, where you'd really appreciate that."}, {"time": 1412, "text": "So I'm able to detect something about the environment that maybe others don't, I don't know, but I seem to be over the top grateful to be alive for a lot of stupid reasons, and that's in there somewhere."}, {"time": 1429, "text": "I mean, it's kind of interesting because it really is true that our brains, the way we're brought up, but also the genetics enables us to see certain slices of the world, and some people are probably more receptive to anomalous information."}, {"time": 1452, "text": "They see the magic, the possibility in the novel thing as opposed to kind of finding the pattern of the common, of the regular."}, {"time": 1464, "text": "Some people are more, wait a minute, this is kind of weird."}, {"time": 1467, "text": "I mean, a lot of those people would probably become scientists too."}, {"time": 1470, "text": "Like, huh, there's this pattern happening over and over and over, and then something weird just happened, and then you get excited by that weirdness and start to pull the string and discover what is at the core of that weirdness."}, {"time": 1486, "text": "Perhaps, is that, maybe by way of question, how does the human perception system deal with anomalous information, do you think?"}, {"time": 1497, "text": "Well, it first tries to classify it and get it out of the way."}, {"time": 1500, "text": "If it's not food, if it's not sex, right?"}, {"time": 1504, "text": "If it's not in the way of my desires, or if it is in the way of my desires, then you focus on it."}, {"time": 1513, "text": "And so I think the question is how much spare processing power, how much CPU cycles do we spend on things that are not those core desires?"}, {"time": 1528, "text": "What is the most kind of memorable, powerful UFO encounter report you ever heard?"}, {"time": 1538, "text": "Just to you, on a personal level, like something that was really powerful."}, {"time": 1542, "text": "Well, I mentioned the Zimbabwe one."}, {"time": 1545, "text": "That's particularly interesting."}, {"time": 1547, "text": "And one that actually most people don't know about, but family driving down the highway, two little girls in the back, open glass topped car, and the little girls see a craft right over their car."}, {"time": 1566, "text": "This is in the middle of the day on a busy highway."}, {"time": 1570, "text": "The mother sees it."}, {"time": 1572, "text": "Nobody can, they look around, nobody else seems to see it."}, {"time": 1576, "text": "So the girls take out their camera, take a picture of it, and then they get home."}, {"time": 1582, "text": "They look at the picture."}, {"time": 1584, "text": "There's no craft, but there's a little object about 30 feet above their car or so, probably about three feet across, kind of star shaped."}, {"time": 1596, "text": "It's not the craft, but it's something else."}, {"time": 1599, "text": "Obviously there was something there."}, {"time": 1601, "text": "And so what were they seeing?"}, {"time": 1602, "text": "Were they seeing a projection?"}, {"time": 1604, "text": "Were they seeing, and why were only they seeing it?"}, {"time": 1606, "text": "And the photograph was capturing something very different than what we're seeing, but they're still an object."}, {"time": 1615, "text": "Can you give a little bit of context?"}, {"time": 1618, "text": "Is this from modern day?"}, {"time": 1619, "text": "It's modern day."}, {"time": 1620, "text": "Oh yeah, they had a camera."}, {"time": 1621, "text": "I mean, they had a cell phone camera."}, {"time": 1622, "text": "And this is like a report provided."}, {"time": 1626, "text": "By the way, where is a central place to provide a report?"}, {"time": 1629, "text": "Oh, there's a move on, but this isn't public."}, {"time": 1631, "text": "I've seen the picture."}, {"time": 1632, "text": "Oh, this is something you've directly interacted with."}, {"time": 1634, "text": "Yeah, yeah, I've seen the picture."}, {"time": 1636, "text": "So those moments like that, they captivate your mind."}, {"time": 1643, "text": "It's so different, and it doesn't fall into the standard story at all."}, {"time": 1646, "text": "But it also, but in another way, it's kind of a, it's a clear enunciation of this notion that when people see events, they don't all see the same thing."}, {"time": 1657, "text": "Now, we've heard this about traffic accidents."}, {"time": 1660, "text": "Different people will see the color of the car differently or the chain of events differently."}, {"time": 1664, "text": "And this tells you that memory isn't anywhere near what we think it is."}, {"time": 1668, "text": "But the issue around these so called UFO reports is that the same people will see a very different thing, almost as if whatever it is is projecting a, is projecting something into the mind rather than it being real, right?"}, {"time": 1686, "text": "Rather than it being a real manifestation, material in front of you, it's actually almost some sort of an altered virtual reality that is imposed on you."}, {"time": 1698, "text": "I mean, I think the company Meta and all the virtual reality companies would love to have something like that, right?"}, {"time": 1706, "text": "Where you don't have to actually wear something on your face to experience a virtual reality."}, {"time": 1711, "text": "What happens if you could just project it?"}, {"time": 1713, "text": "Well, that's the fundamental question from an alien perspective."}, {"time": 1717, "text": "When you look at it, or as we humans look at ants, how does its perception system operate?"}, {"time": 1723, "text": "So not only how does this thing's mind operate, how does the human mind operate, but how does their perception system operate so that we can stimulate the perception system properly to get them to think certain things."}, {"time": 1737, "text": "And so, that's a really important question."}, {"time": 1742, "text": "Humans think that the only way to communicate is in 3D or 4D space time, there's physical objects, or maybe you write things into some kind of language."}, {"time": 1755, "text": "But there could be just so much more richness in how you can communicate."}, {"time": 1763, "text": "And so, from an alien perspective, where somebody has much greater technological capabilities, you have to figure out how do I use the skills I have to stimulate the limited humans."}, {"time": 1775, "text": "Right, well, I mean, let's take the ants exam again as an example."}, {"time": 1778, "text": "Let's say that you wanted to make ants practical."}, {"time": 1783, "text": "You wanted to use them for something, right?"}, {"time": 1785, "text": "You wanted to use them as a form of biological robot."}, {"time": 1787, "text": "Now, DARPA and other people have been trying to use insects for, turn them into biological robots."}, {"time": 1796, "text": "But if you wanted to, you would have to interact with their sense of smell, right?"}, {"time": 1802, "text": "Their pheromone system that they use to interact with each other."}, {"time": 1806, "text": "So you would either create those molecules to talk to them, to make them do, I'm not saying talk to them as if they're intelligent, but talk to them to manipulate them in ways that you want."}, {"time": 1816, "text": "Or if you were advanced enough, you would use some sort of electromagnetic or other means to stimulate their neurons in ways that would accomplish the same goal as the pheromones, but by doing it in a sort of a telefactoring way."}, {"time": 1834, "text": "So let's say you wanted to telefactor with humans."}, {"time": 1837, "text": "You would interact with them."}, {"time": 1840, "text": "And this is, again, this is a technology which you could imagine possible."}, {"time": 1845, "text": "You could telefactor information into the sensory system of a human, right?"}, {"time": 1850, "text": "But then each human is a little bit different."}, {"time": 1853, "text": "So either you know enough about them to tailor it to that individual, or you just basically take advantage of whatever the sensory net is that that individual has."}, {"time": 1862, "text": "So if you happen to be good at sound, or you happen to be a very visually inclined individual, then maybe the sensory information that you get that's most effective in terms of transmitting information would come through that portal."}, {"time": 1877, "text": "I think the aliens would need to figure out that humans value physical consistency."}, {"time": 1882, "text": "So we've discovered physics."}, {"time": 1885, "text": "So we want our perception to make sense."}, {"time": 1888, "text": "Maybe they don't, you know, that's not an obvious fact of perception, that you have to figure out what kind of things are humans used to observing in this particular environment of Earth, and how do we stimulate the perception system in a way that's not anomalous, or not too, it doesn't cross that threshold of just like, well, that's way too weird."}, {"time": 1913, "text": "So they have to, I mean, that's not obvious that that should be important."}, {"time": 1918, "text": "Maybe you wanna err on the side of anomaly, like lean into the weirdness."}, {"time": 1924, "text": "So communication is complicated."}, {"time": 1926, "text": "Well, that's why I always find this issue of people talking about the so called grays as interesting, because it is related to what you're saying."}, {"time": 1937, "text": "They're different enough, but they're not so different as to be scary, right?"}, {"time": 1942, "text": "They're not venom dripping fangs, right?"}, {"time": 1945, "text": "They're different enough, but it's also like they're what you could imagine us becoming in some distant future."}, {"time": 1954, "text": "So is that a purposeful representation?"}, {"time": 1958, "text": "I mean, I don't believe in the grays, for instance, but I believe that people think that they see it."}, {"time": 1964, "text": "So if we're talking about a communication strategy that says, you know, we're like you, but not the same as you, this might be a manifestation that you represent in terms of a communication strategy."}, {"time": 1980, "text": "What do you make of David's favorite sighting of the Tic Tac UFO, and other pilots who have seen these objects that seem to defy the laws of physics?"}, {"time": 1992, "text": "Well, I think you have to take them at their word."}, {"time": 1997, "text": "Are they fascinating to you?"}, {"time": 1998, "text": "No, I know a lot of these people, right?"}, {"time": 2000, "text": "So I know Lou Elizondo, Chris Mellon, the whole crowd I've been, I saw the videos about three weeks or so before they went public."}, {"time": 2013, "text": "I was at a bar with Lou overlooking the Pentagon in Crystal City, and they showed them to me, and my hair stood on end."}, {"time": 2022, "text": "And he said, this is coming out soon."}, {"time": 2025, "text": "And I know one of the guys on the inside who was the Naval Intelligence who had interviewed all of these pilots again before this came out."}, {"time": 2035, "text": "And it was hair raising to hear this, but also exciting that here's not just people's testimony, these are credible individuals."}, {"time": 2045, "text": "And if you've seen the 60 minute episode with some of the pilots, they have no monetary gain."}, {"time": 2053, "text": "If anything, they've got negative gain from coming out."}, {"time": 2056, "text": "But then you also have all of those simultaneous ship analysis from the USS Princeton and the radar analysis, et cetera."}, {"time": 2066, "text": "So at the end of the day, it's just data."}, {"time": 2072, "text": "It's not a conclusion."}, {"time": 2075, "text": "I'd be perfectly happy, honestly, perfectly happy if somebody showed that it was all a hoax."}, {"time": 2081, "text": "I can go back to my day job, right?"}, {"time": 2084, "text": "That could be a hoax, but other things might not be."}, {"time": 2087, "text": "This is the point."}, {"time": 2089, "text": "This is why it's nice to remove some of the stigma about this topic because it's all just data and anomalous events are such that they're going to be rare in terms of how much data they represent."}, {"time": 2105, "text": "But we have to consider the full range of data to discover the things that actually represent something that's, if we pull at it, we'll discover something that's extraterrestrial or something deep about the phenomena on Earth that we don't yet understand."}, {"time": 2122, "text": "Well, if it only stimulates people, for instance, to think, okay, well, what happens if we could move like that with momentumless movement?"}, {"time": 2132, "text": "And it stimulates young individuals to go into the sciences to ask those questions."}, {"time": 2141, "text": "I mean, after I've been openly talking about this in the last year, especially, I've had a number of students from top schools who aren't my students come to me and say, if I can help, let me."}, {"time": 2157, "text": "How can I help?"}, {"time": 2158, "text": "I never had thought about this before, but you opened, you and others, not just you and others, have opened my mind to thinking about this matter."}, {"time": 2166, "text": "Yeah, that's why it's actually funny that Elon Musk doesn't think too much about this, these kinds of propulsion systems that could defy the laws of physics as we currently understand them."}, {"time": 2178, "text": "To me, it's a powerful way to think what is possible."}, {"time": 2183, "text": "It's inspiring, even if some of the data doesn't represent extraterrestrial vehicles."}, {"time": 2190, "text": "I think the observation itself, it's like something you mentioned, which is hypothesizing, imagining these things, considering the possibility of these things, I think opens up your mind in a way that ultimately can create the technology."}, {"time": 2209, "text": "First, you have to believe the technology is possible before you can create it."}, {"time": 2214, "text": "In my own lab, we always look for, as I've said before, what is inevitable, and saying inevitably this is the kind of data we need, but if we need that kind of data, the instrument we want doesn't exist."}, {"time": 2230, "text": "Okay, so I imagine the perfect instrument, I can't make it, and you back into something which is practical, and then you, in a sense, reverse engineer the future of what it is that you wanna make."}, {"time": 2244, "text": "And I've started and sold at least half a dozen or more companies using that basic premise."}, {"time": 2252, "text": "And so it was always something that didn't exist today, but we imagined what we wanted."}, {"time": 2258, "text": "And at the time, many people said it couldn't be done."}, {"time": 2261, "text": "I mean, for instance, all the gene therapy that's done today with retroviruses came from a group meeting in David Baltimore's lab."}, {"time": 2269, "text": "I was a postdoc with him, and one of the other postdocs wasn't able to make retroviruses in a way that he wanted to, and I realized I had a cell line that would allow us to make retroviruses in two days rather than two months."}, {"time": 2285, "text": "And so he and I then worked together to make that system, and now all gene therapy with retroviruses is done using this basic approach around the whole world, because something couldn't be done, and we wanted to do it better, and we imagined the future."}, {"time": 2302, "text": "And so that's, I think, what the whole UFO phenomenon is doing for people."}, {"time": 2308, "text": "It's like, well, let's imagine a future where these kinds of technologies are, but also let's imagine a future where we don't blow ourselves up, right?"}, {"time": 2316, "text": "So if these things are there, they manage to not blow themselves up."}, {"time": 2320, "text": "So it means that at least one other civilization got past the inflection point."}, {"time": 2327, "text": "So if some of the encounters are actually representing alien civilizations visiting us, why do you think they're doing so?"}, {"time": 2337, "text": "You suggested that perhaps it's the study understand their own past, right?"}, {"time": 2342, "text": "What are some of the motivations, do you think?"}, {"time": 2345, "text": "And again, from our perspective, us as humans, what motivations would we have when we approach other civilizations we might discover in the future?"}, {"time": 2355, "text": "Well, I think one motivation might be to steer us away from the precipice, right?"}, {"time": 2362, "text": "Or on the assumption that, even if we make it past the precipice, at least we're not a bunch of psychopaths running around."}, {"time": 2372, "text": "So maybe there's a little bit of motivation there to make sure that the neighbor that's growing up next to you is not unruly."}, {"time": 2382, "text": "But I mean, maybe it's sort of a moral imperative, like what we have with creating national parks where animals can continue to live out their lives in a natural way."}, {"time": 2399, "text": "I mean, that would be, I mean, the problem is we're imagining from a anthropomorphic viewpoint what an alien might think."}, {"time": 2410, "text": "And as I've said before, alien means alien, right?"}, {"time": 2414, "text": "I mean, not Hollywood aliens, but a whole different way of thinking and a whole different level of experience and let's say wisdom, hopefully, that we could only hope to understand."}, {"time": 2430, "text": "Now, but if we ever get out there, if we ever make it past our current problems, and even if we don't have faster than light travel, and even if we're only using ram scoops or light sails to get where we wanna go, and it takes us 10,000 years to get somewhere or to spread out, we might encounter such things."}, {"time": 2453, "text": "And are we just gonna stomp all over it like we did in colonial South America or Africa or all the rest on our current path, likely?"}, {"time": 2464, "text": "And so what are we gonna learn?"}, {"time": 2466, "text": "Well, we're getting better and better at understanding what is life."}, {"time": 2470, "text": "And I think we're getting better and better at being careful, not to step on it when we see it."}, {"time": 2477, "text": "And this is one of the nice things about talking about UFOs is it expands the Overton window."}, {"time": 2484, "text": "It expands our understanding of what possibly could be life."}, {"time": 2488, "text": "It gets us to think."}, {"time": 2489, "text": "It gets the scientific community to think."}, {"time": 2492, "text": "When we go to Mars, when we go to these different moons that possibly have life, we're not looking at legged organisms."}, {"time": 2500, "text": "We're looking at some kind of complexity that arises in resistance to the natural world."}, {"time": 2511, "text": "And there's a lot of interesting."}, {"time": 2514, "text": "I like that, resistance to the natural world, yeah."}, {"time": 2517, "text": "So somehow there's a rebellious process, complex system going on here."}, {"time": 2523, "text": "And I don't know the many ways it could take form."}, {"time": 2526, "text": "There's a sense for aliens that as the technology develops, they take form more and more as information, as something that can influence the space of ideas, of the processing of data itself."}, {"time": 2544, "text": "So I just, this idea of embodiment that we humans so admire, physically visible, perceivable embodiment may be a very inefficient thing, right?"}, {"time": 2559, "text": "If you think just about your area, AI, we're trying to make smaller and smaller and smaller circuitry that is basically closer and closer to the physics of how the universe operates, right?"}, {"time": 2580, "text": "Right down at the level of, I mean, quantum computers are basically right down about quantum information storage."}, {"time": 2585, "text": "So fast forward 10,000, 100,000 years, maybe somebody found a way to embody AI directly into the physics of the universe, right?"}, {"time": 2596, "text": "And it doesn't require a physical manifestation."}, {"time": 2599, "text": "It just sits in space time."}, {"time": 2602, "text": "It's just a locally ordered space."}, {"time": 2605, "text": "We're just locally ordered space time, right?"}, {"time": 2608, "text": "You know, I mean, but maybe they just, they found a way to embody it there."}, {"time": 2613, "text": "They probably have to get really good at not, you know, trampling on the ants."}, {"time": 2618, "text": "The better your technology gets, the easier it is to accidentally like, oops, just destroy these simpleton biological systems."}, {"time": 2628, "text": "We constantly think about whatever these things might be."}, {"time": 2630, "text": "We think that they are some sort of a unified force."}, {"time": 2636, "text": "Well, maybe they're not unified."}, {"time": 2638, "text": "Maybe they are as disparate as you and I are."}, {"time": 2643, "text": "And maybe what keeps them from stomping all over the ants is each other, right?"}, {"time": 2649, "text": "That they are in a self tension to prevent one or more of them from running amok."}, {"time": 2658, "text": "I mean, that's kind of the anarchy of nations that we have on earth."}, {"time": 2661, "text": "So there's always going to be this."}, {"time": 2667, "text": "There's a hierarchy."}, {"time": 2668, "text": "This hierarchy that's formed of greater and greater intelligences."}, {"time": 2671, "text": "And they're all probably also wondering, wait, what's bigger than me?"}, {"time": 2676, "text": "That's what I always wonder is that maybe that they're, what keeps them in line is something that is beyond them."}, {"time": 2683, "text": "Like what created the universe."}, {"time": 2685, "text": "I mean, that's probably a question that bothers them too."}, {"time": 2690, "text": "What about the communication task itself?"}, {"time": 2693, "text": "How hard do you think it is for aliens to communicate with humans?"}, {"time": 2696, "text": "So is this something you think about about this barrier of communication between biological systems and something else?"}, {"time": 2704, "text": "How difficult is it to find a common language?"}, {"time": 2708, "text": "Well, I think if you're smart enough or technologically enabled enough, it's relatively straightforward."}, {"time": 2718, "text": "Now, whether your concepts can ever be dumbed down to us, that might be hard."}, {"time": 2730, "text": "Again, talking to the ants."}, {"time": 2732, "text": "Talking to the ants."}, {"time": 2733, "text": "I mean, they don't."}, {"time": 2734, "text": "On Instagram."}, {"time": 2738, "text": "You want to look good in this picture."}, {"time": 2739, "text": "Let me explain to you."}, {"time": 2740, "text": "Let me explain to you why."}, {"time": 2744, "text": "So that's the essential problem of, you know, perhaps they realize who it is that they're talking to."}, {"time": 2754, "text": "And they say, rather than muddy the picture, we're only going to give them limited information."}, {"time": 2762, "text": "And yeah, maybe we could sit down, like you and I, and have a conversation."}, {"time": 2766, "text": "But then they would make assumptions."}, {"time": 2769, "text": "The humans would then make assumptions about us that aren't true."}, {"time": 2772, "text": "Because we're not humans, right?"}, {"time": 2773, "text": "So let's stay at arm's length."}, {"time": 2777, "text": "Let's just let them know that we're here, right?"}, {"time": 2781, "text": "And here's the limited amount of communication."}, {"time": 2783, "text": "Again, this notion that if you give somebody everything, they'll get lazy."}, {"time": 2790, "text": "And, you know, if they've been around as long as they have, they've seen every kind of thing that can go wrong."}, {"time": 2797, "text": "And so they know as much as they might want to step in, that that would be a wrong thing."}, {"time": 2805, "text": "Yeah, you have to also understand the amount of wisdom they carry."}, {"time": 2812, "text": "You know, and so it's very easy as well for religions to, I don't want to get into a whole religious conversation, but it's very easy for, you could see how religions could call them angels or devils or what have you."}, {"time": 2826, "text": "Because, again, if you're trying to fit it into a framework of cultural understanding, the first thing you reach for is God."}, {"time": 2836, "text": "And so when you look at what these things are, and again, with the angels and the devils, in a similar sort of way, their communication is limited."}, {"time": 2849, "text": "They just kind of give little, what's the oracle of Delphi?"}, {"time": 2853, "text": "They kind of give these Delphic pronouncements, and then it's up to you to figure out what it is that they really mean."}, {"time": 2861, "text": "Steven Greer claimed that a skeleton discovered in Atacama region of Chile might be an alien."}, {"time": 2870, "text": "You reached out to him and took on the task of proving or disproving that with the rigor of science."}, {"time": 2877, "text": "The result is a paper titled Whole Genome Sequencing of Atacama Skeleton Shows Novel Mutations Linked with Dysplasia."}, {"time": 2886, "text": "Can you tell this full story?"}, {"time": 2887, "text": "Well, the story was, as you put it right there, correct."}, {"time": 2893, "text": "Reached out, got a sample of the body, did the DNA sequencing, then worked with a team of two other Stanford scientists and Roche sequencing group, Roche Diagnostics, and probably a total team of about 11 or so people."}, {"time": 2913, "text": "And as is standard in these kinds of things, the professors actually don't do the work."}, {"time": 2920, "text": "The students do the work and figured out the answer."}, {"time": 2924, "text": "And then we helped them put together the story."}, {"time": 2928, "text": "And the story was simply that it was human, 100%."}, {"time": 2934, "text": "I went into it thinking it was originally a monkey of some sort."}, {"time": 2939, "text": "I got kind of excited a few months into the process, thinking, well, what happens if it is an alien, right?"}, {"time": 2946, "text": "Can you describe some of the characteristics of the skeleton that makes it unique and interesting?"}, {"time": 2950, "text": "Primarily, it had dysmorphias of the brain."}, {"time": 2953, "text": "And so the first thing I did actually, when I got pictures of it, I took it to a local expert at Stanford and he was on the paper."}, {"time": 2964, "text": "And he was the world expert in pediatric bone dysmorphias."}, {"time": 2969, "text": "He literally wrote the book on this, because that's what you do."}, {"time": 2973, "text": "You go to an expert when it's outside of your field of interest."}, {"time": 2976, "text": "And he said, well, I haven't seen this particular collection of mutations before or this physiology before, but here's what I think it might be."}, {"time": 2989, "text": "And he said, but based on the size of the thing and the bone density, it would appear to be like six or seven years old."}, {"time": 3001, "text": "Now, again, that's the thing where I think the lay public doesn't understand or takes a speculation like that and turns it into a fact."}, {"time": 3013, "text": "No one ever said that it was that age."}, {"time": 3015, "text": "We only said that the bones made it look like it was that age, but then we went back and looked for, we went back and looked for genetic explanations of why things might look the way they did."}, {"time": 3029, "text": "And if you, again, read the paper is very carefully caveated to say that these mutations might result in this."}, {"time": 3038, "text": "But what we did find was an unexpectedly large number of mutations associated with bone growth in this individual."}, {"time": 3048, "text": "And it was just a bad roll of the dice, right?"}, {"time": 3052, "text": "You roll the dice enough times with enough people born every year and someone will roll the wrong dice all at once."}, {"time": 3062, "text": "So the sad part about it was individuals in the UFO community who wanted to think that there was some sort of conspiracy around it, right?"}, {"time": 3074, "text": "That somebody had somehow convinced all of my students to lie."}, {"time": 3080, "text": "I mean, come on, you know, I would lose my job, first of all, and they would all be in trouble forever."}, {"time": 3091, "text": "Yeah, but also it's just projecting malevolence onto people that doesn't, I don't think exists in normal populace and especially doesn't exist in the scientific community."}, {"time": 3102, "text": "The kind of people that go into science, I mean, this is what bothers me with the current distrust of science, is they might be naive, they might not, especially in modern science, look at the big picture, philosophical, ethical questions, all that kind of stuff, but ultimately they're people with integrity and just a deep curiosity for the discovery of cool little things."}, {"time": 3126, "text": "And there's no malevolence, broadly speaking, in the scientific community."}, {"time": 3135, "text": "So, I mean, there's a bigger story here, which is, you know, there's a hunger in the populace to discover something anomalous, something new."}, {"time": 3145, "text": "And, you know, science has to be both open to the anomalous, but also to reject the anomalous when the data doesn't support it."}, {"time": 3157, "text": "What do you make of that, you know, walking that line for you?"}, {"time": 3160, "text": "Because you're dealing with UFO encounters, you're dealing with the anomalous."}, {"time": 3165, "text": "Well, people have said, let's go back to the Atacama case that I was debunking it."}, {"time": 3172, "text": "Well, debunking is a loaded term."}, {"time": 3174, "text": "Sort of assumes that you were going in purposefully to prove something is wrong."}, {"time": 3180, "text": "I wasn't, I was just going in to collect the data."}, {"time": 3183, "text": "And, you know, I showed that this one was human."}, {"time": 3188, "text": "There was another skull that somebody had at one point."}, {"time": 3191, "text": "It was called the star child."}, {"time": 3192, "text": "They called it the star child skull."}, {"time": 3194, "text": "I said, you know, I looked at it."}, {"time": 3195, "text": "I looked at the DNA sequencing that they had done."}, {"time": 3198, "text": "I said, this is human."}, {"time": 3199, "text": "End of story."}, {"time": 3202, "text": "The people who owned the thing at the time disagreed with me, and then eventually another group came in and proved that I was right."}, {"time": 3210, "text": "And it's not about debunking."}, {"time": 3212, "text": "It's about getting the more spectacular and hyped cases off the table."}, {"time": 3217, "text": "I mean, the reason I got interested in it is because somebody was hyping it."}, {"time": 3221, "text": "And not because I wanted to disprove it, but because I just wanted to know."}, {"time": 3224, "text": "And thus, get it off the table, because it's usually the most extravagant things that are most likely to be wrong."}, {"time": 3232, "text": "Somewhere in the rubble will be something interesting."}, {"time": 3237, "text": "And so that's what you do."}, {"time": 3238, "text": "You get the dross off the table."}, {"time": 3242, "text": "And then somewhere in the data will be something worth real inquiry."}, {"time": 3249, "text": "And that, if you inquire deeply enough, will be extravagant as well."}, {"time": 3255, "text": "And that's what actually excites scientists is to, I mean, you want, with the rigor of science, to actually reveal the extravagant."}, {"time": 3264, "text": "And so look at CRISPR as probably the most perfect example of that."}, {"time": 3267, "text": "These weird sequences in bacterial genomes, all arrayed one after the other with these strange sequences around them, but when you looked at the sequences, they looked like viruses."}, {"time": 3281, "text": "And so how did they get there?"}, {"time": 3282, "text": "And lo and behold, after a lot of effort and work, well, a couple of Nobel Prizes went out the door."}, {"time": 3288, "text": "But these strange things ended up having extraordinarily extravagant possibilities."}, {"time": 3297, "text": "You've also looked at UFO materials."}, {"time": 3300, "text": "You are in possession of UFO materials yourself."}, {"time": 3303, "text": "Claimed UFO materials, alleged."}, {"time": 3307, "text": "Alleged UFO materials, that's right."}, {"time": 3308, "text": "So what's another term?"}, {"time": 3311, "text": "Weird materials that don't seem to have a story."}, {"time": 3317, "text": "They have a story that doesn't seem to be of natural origins, but it's not, you know, there's a process to proving that."}, {"time": 3325, "text": "And that process may take decades, if not centuries, because you have to keep pulling at the string and discover where they could possibly come from."}, {"time": 3335, "text": "But anyway, you're in a possession of some materials of this kind."}, {"time": 3341, "text": "Can you describe some of them and maybe also talk to the process of how you investigate them, how do you analyze them?"}, {"time": 3350, "text": "Right, so let's say that there's two classes of materials that I've been given by people."}, {"time": 3356, "text": "And they're not given by the government or anything, just given people who've collected them, and there's a reasonable chain of evidence associated with them that you believe is not just a pebble somebody picked up off a road."}, {"time": 3369, "text": "There are almost always things that people have claimed have either been dropped off as like some sort of a leftover material, molten metals, or they are from an object that was released from this or that kind of exploded."}, {"time": 3389, "text": "They're almost always metals."}, {"time": 3391, "text": "I have some couple of things that might be biological that are interesting that I haven't really spent a lot of time on yet."}, {"time": 3396, "text": "When you look at a metal, you basically, well, OK, what are the elements in it?"}, {"time": 3402, "text": "And what's it made of?"}, {"time": 3404, "text": "And so there's pretty standard approaches to doing that."}, {"time": 3407, "text": "Most of them involve a technology called mass spectrometry, and there's probably about five or six different kinds of mass spectrometry that you could bring to bear on answering it."}, {"time": 3417, "text": "And they either tell you, depending upon the limit of the resolution of the instrument, they either tell you the elements that are there, or they tell you the isotopes that are there."}, {"time": 3427, "text": "And you're interested not just in knowing whether something is there or not, you're interested in knowing whether there are the amounts of it, and in the case of elements, how many different isotopes are there."}, {"time": 3443, "text": "And that's kind of where, in some of these cases, it gets interesting."}, {"time": 3447, "text": "Because in at least one of the materials, as we first studied it, the isotope ratios of, in this case, it was magnesium, are way off normal."}, {"time": 3457, "text": "And I just don't know why."}, {"time": 3460, "text": "It doesn't prove anything."}, {"time": 3463, "text": "All it proves is that it was probably accomplished by some kind of an industrial process."}, {"time": 3471, "text": "Whether it's the result of a process, and this is sort of the leftover, or whether it was made that way for a particular purpose, I don't know."}, {"time": 3482, "text": "All I know is that it was engineered."}, {"time": 3491, "text": "But then the question is, sort of you go one step deeper, why would you engineer it?"}, {"time": 3501, "text": "Why engineer it, and what does engineered means?"}, {"time": 3504, "text": "There's all kinds of, it could be a byproduct, it could be the main result of an engineering process, it would be a small part of the engineering process that is the main part."}, {"time": 3519, "text": "Well, so the ratios of isotopes for any given element are basically the result of stellar processes."}, {"time": 3528, "text": "Supernova blew up sometime several billion years ago."}, {"time": 3535, "text": "That became a cloud."}, {"time": 3536, "text": "Those atoms coalesced gravitationally to form another sun, and a ring that became a rocky planet."}, {"time": 3547, "text": "And the ratios of the isotopes were determined at the time of that explosion."}, {"time": 3554, "text": "And so everything in the local solar system is more or less of that ratio, depending upon certain gravitational difference."}, {"time": 3562, "text": "But by fragments of a percent, not whole tens of percent difference."}, {"time": 3569, "text": "So what do humans use isotopes for?"}, {"time": 3572, "text": "Mostly to blow stuff up."}, {"time": 3574, "text": "I mean, the vast majority of the isotopes that have been made in the per pound or ton are things like certain ratios of plutonium and uranium to blow stuff up."}, {"time": 3585, "text": "We don't make or engineer isotopes, which today is relatively easy to do, but it's still expensive."}, {"time": 3594, "text": "For any other reason, apart from, let's say, anti cancer, we use stable isotopes and money these days as a counterfeiting tool."}, {"time": 3604, "text": "You basically embed certain ratios of isotopes in to make it harder for counterfeiters to accomplish."}, {"time": 3614, "text": "But other than that, we don't do anything with that."}, {"time": 3616, "text": "So why would you make grams of such material in this one case and drop it around on a beach in Brazil?"}, {"time": 3625, "text": "So which case are we talking about?"}, {"time": 3626, "text": "Describe that, because this is the Ubatuba case."}, {"time": 3630, "text": "Can you describe this case a little bit further, like what material we're talking about, just the full story of the case?"}, {"time": 3636, "text": "It's an interesting one."}, {"time": 3638, "text": "So a fisherman saw an object that released something, or it exploded."}, {"time": 3645, "text": "And it was this relatively, I've got some big chunks of it, relatively pure magnesium with obviously something else in it because magnesium burns."}, {"time": 3656, "text": "So it had something in it that would, other metals, simple alloy that would prevent it from basically burning up."}, {"time": 3667, "text": "And so the question is, and so then we had two pieces that came from two different chains of custody, both claimed to be from the same object."}, {"time": 3679, "text": "At least physically, when you look at the two things, they look the same."}, {"time": 3686, "text": "So we took small fragments of each of them."}, {"time": 3689, "text": "We put them in an instrument called a secondary ion mass spec, which is an extremely sensitive instrument."}, {"time": 3695, "text": "And it can see down to 0.0001 mass units, which is important for, let's say, more arcane reasons."}, {"time": 3706, "text": "But it's a sensitive instrument."}, {"time": 3708, "text": "And so one of the chains of custody, we had two pieces from the same chain of custody, and then two pieces from the other chain of custody."}, {"time": 3719, "text": "One of them had completely normal magnesium isotope ratios, magnesium 24, 25, 26."}, {"time": 3726, "text": "And the other was off, not just slightly off, way off."}, {"time": 3729, "text": "And they were both off to the same extent."}, {"time": 3734, "text": "I mean, it was sort of like you had an internal control of what was normal."}, {"time": 3738, "text": "And you had this other one, which was wrong."}, {"time": 3742, "text": "And so you're left with kind of an open question."}, {"time": 3748, "text": "Was this a hoax?"}, {"time": 3749, "text": "Were these two chains of custody, one of them a hoax, that somebody purposefully introduced those things?"}, {"time": 3755, "text": "Because you could do it."}, {"time": 3756, "text": "It would cost a lot."}, {"time": 3758, "text": "I mean, at the time that this was found, I guess the 1970s or so, it might have been earlier, I forget, the amount that I had would have cost several tens of thousands of dollars to make."}, {"time": 3773, "text": "And again, it's not something you would just throw around."}, {"time": 3776, "text": "And why would you do it in the hope that some guy 30 years from then would pick it up and study it?"}, {"time": 3782, "text": "Yeah, it's a very subtle, subtle troll."}, {"time": 3785, "text": "It's a long term plan."}, {"time": 3788, "text": "So I just don't know what to make of it, except it's interesting."}, {"time": 3795, "text": "So a different kind of question that you're asking is, what constitutes evidence?"}, {"time": 3801, "text": "So is this sufficient evidence?"}, {"time": 3807, "text": "But somebody's put it forward."}, {"time": 3809, "text": "I have the time."}, {"time": 3810, "text": "It's my time."}, {"time": 3813, "text": "I'll study it."}, {"time": 3813, "text": "And my objective is to sort of take those that I think are credible enough and do a reasonable analysis, put it out there."}, {"time": 3821, "text": "And maybe somebody else will come up with an idea as to what it is."}, {"time": 3824, "text": "Now, what would be better is some sort of true technology, something that is obviously."}, {"time": 3835, "text": "And people like Neil deGrasse Tyson and Seth Shostak have come out rightfully and have said, when you show up with something really obviously technology that we don't understand, then we'll pay attention."}, {"time": 3856, "text": "Not just material."}, {"time": 3858, "text": "A piece of metal is interesting."}, {"time": 3864, "text": "And several of the things that I've looked at and other things that people have come to me with, we've found to be completely banal or were actually pieces of aircraft that were invented back in the 1940s."}, {"time": 3878, "text": "And so take them off the table."}, {"time": 3880, "text": "But I think, again, I think showing up with technology that we humans would find completely novel is actually a really difficult task for aliens because it obviously can't be so novel that we don't recognize it for what it is."}, {"time": 3900, "text": "And I would say most of the technology aliens likely have would be something we don't recognize."}, {"time": 3907, "text": "So it's actually a hard problem how to convince ants."}, {"time": 3911, "text": "You first have to understand what ants are tweeting about."}, {"time": 3916, "text": "What they care about in order to inject into their culture."}, {"time": 3921, "text": "Because that's why I think it would be the technology that you could present is in the space of ideas, is try to influence individual humans with the encounters and try to, with this kind of thing that you mentioned about us not taking messages, about us not taking care of the world."}, {"time": 3946, "text": "I mean, for them to understand, you have to come up with trinkets that impress us."}, {"time": 3952, "text": "I mean, maybe the very technology, the fascination with the development of technology and the development of technology, the actual act of innovation itself is the thing that they're communicating."}, {"time": 3971, "text": "The control system, he calls it."}, {"time": 3973, "text": "The control system."}, {"time": 3973, "text": "Well, let me ask about Jacques."}, {"time": 3976, "text": "Who is he?"}, {"time": 3976, "text": "You know him."}, {"time": 3982, "text": "What have you learned from him about life, about UFOs, about technology, about our role in the universe?"}, {"time": 3993, "text": "Well, I met Jacques actually soon after the whole Atacama thing happened."}, {"time": 4000, "text": "I was visited by those people associated with the government and whatever around the Havana... What ended up mostly being Havana syndrome patients, but also Jacques at the same time."}, {"time": 4011, "text": "And they were actually working behind the scenes with each other, that, oh, here's this Stanford professor who is willing to talk about this stuff and investigate things."}, {"time": 4021, "text": "Maybe we should go talk to him."}, {"time": 4023, "text": "And he reached out through a colleague and he and I had lunch actually at the Rosewood Inn up on near Sandhill."}, {"time": 4032, "text": "So Jacques is one of the first openly active scientists, and he's really a scientist, in this area going back to the 1960s."}, {"time": 4046, "text": "And he's put forward a number of ideas, speculations about what it might be that people are interacting with."}, {"time": 4056, "text": "And the first thing that I learned from him is this notion of what he called Kabuki theater, that many of the things that people have seen are..."}, {"time": 4065, "text": "I remember reading his books and thinking, he uses this word absurd a lot."}, {"time": 4070, "text": "He said, the things that people claim they see are absurd, right?"}, {"time": 4076, "text": "A ship doesn't land in a farmer's field and then come up and knock on the door and say, can I have a glass of water?"}, {"time": 4083, "text": "And these are stories literally out of newspapers from the 1930s."}, {"time": 4089, "text": "And the other thing that people say, ships don't crash."}, {"time": 4092, "text": "If you're so technologically advanced, you don't crash."}, {"time": 4095, "text": "It's absurd that they crash."}, {"time": 4098, "text": "So he says, this is put on as a show."}, {"time": 4104, "text": "It's an influence campaign, right?"}, {"time": 4109, "text": "It's not meant to influence individuals."}, {"time": 4111, "text": "It's meant to influence a culture as a whole."}, {"time": 4115, "text": "Maybe they don't look at us as individuals."}, {"time": 4117, "text": "Maybe they look at us as an organism that lives on a planet, right?"}, {"time": 4123, "text": "And perhaps rightly so."}, {"time": 4125, "text": "And so that's how you interact with them."}, {"time": 4127, "text": "That's how you influence them."}, {"time": 4128, "text": "So that was one of the first things that kind of took me back and realized, wow, there's actually... maybe there's a puppet master behind the scenes that's doing this influencing and that all this stuff about aliens is just not true, per se."}, {"time": 4145, "text": "They're just a representation of something that is meant to influence."}, {"time": 4149, "text": "So that was probably the most interesting."}, {"time": 4151, "text": "I mean, the man is brilliant."}, {"time": 4153, "text": "He's also, and I'm sorry, Jacques, he can also be incredibly annoying to have a conversation with because he will pick apart your arguments or anything that you think you know and show you why you don't know what you think you know."}, {"time": 4168, "text": "And he used the example that, for me, that is all you need is one counter example to any conclusion and you're wrong."}, {"time": 4181, "text": "And so I learned from him..."}, {"time": 4183, "text": "I mean, I'm supposed to be a good scientist, but I learned from him, don't talk about conclusions, just talk about the data because data is not wrong."}, {"time": 4192, "text": "I mean, convince yourself that the data is not wrong or not an artifact, but be careful about your conclusions because whatever is going on, it's much more complicated than we imagine."}, {"time": 4202, "text": "Wow, that's powerful."}, {"time": 4203, "text": "Being able to always step back because we humans get excited."}, {"time": 4207, "text": "We start to jump to conclusions from the data, but always step back."}, {"time": 4211, "text": "Powerful, being able to always step back because we humans get excited."}, {"time": 4219, "text": "Well, in some of my Twitter feeds, when I dare to go on Twitter, are full of, well, when are you going to give us the answer?"}, {"time": 4227, "text": "Science is not immediate."}, {"time": 4229, "text": "You're going to have to be patient."}, {"time": 4231, "text": "And even some of my science colleagues have said, well, where's the data?"}, {"time": 4235, "text": "My answer to them has been, where's been your work to try to produce any?"}, {"time": 4239, "text": "I'm not here to give you everything on a silver platter."}, {"time": 4243, "text": "We talked offline how much I love data and machine learning and so on."}, {"time": 4248, "text": "And it's been really disheartening to see the U.S. government not invest as much as they possibly could into this whole process."}, {"time": 4256, "text": "So let's jump to the most recent thing, which is what do you make of the report titled Preliminary Assessment, Unidentified Aerial Phenomena that was released by the Office of the Director of National Intelligence in June 2021."}, {"time": 4272, "text": "So this is what's like, okay, we're going to step back and we're going to like, where do we stand and where do we hope the future is?"}, {"time": 4281, "text": "What do you make of that report?"}, {"time": 4282, "text": "Is it hopeful?"}, {"time": 4284, "text": "I see it as very hopeful, very hopeful."}, {"time": 4286, "text": "I think the adults are finally stepping up and being in charge, right?"}, {"time": 4291, "text": "In the good sense of adult."}, {"time": 4297, "text": "This childlike curiosity is a pretty powerful thing."}, {"time": 4302, "text": "But it's also, I think, the people who were worried that the populace at large might run screaming into the streets and riot, you know, have, you know, they basically, the empiric evidence is they're wrong."}, {"time": 4315, "text": "You know, these videos and all these things have been out for now, what, five years?"}, {"time": 4320, "text": "Most people don't even know about it, right?"}, {"time": 4322, "text": "So as hyped as it's been and all over the newspapers that it's been and et cetera, you know, even Tucker Carlson has talked about it many times on his news program."}, {"time": 4335, "text": "A lot of people don't know about it."}, {"time": 4336, "text": "So I think people, if it's not affecting their day to day life, they're going on with their day to day life."}, {"time": 4343, "text": "So, but that said, I think it was an important sea change in the internal discussions going on in the government because, and the reason being, that I think this is actually partly true with the maturation of human social technology."}, {"time": 4363, "text": "It was becoming so obvious that this stuff was showing up again and again and again around our ships."}, {"time": 4369, "text": "They just couldn't keep it quiet anymore, right?"}, {"time": 4371, "text": "And so it's like, we need to do something about it."}, {"time": 4373, "text": "And Lou Elizondo and Chris and others, to their great credit, found the right angle to talk about this."}, {"time": 4380, "text": "It says, well, okay, let's say it's not out there."}, {"time": 4384, "text": "Maybe it's the Russians, the Chinese or somebody else."}, {"time": 4386, "text": "We should know about this because we damn sure know it's not us."}, {"time": 4391, "text": "So that to me is an important thing to finally be a little bit more open about the matter."}, {"time": 4400, "text": "But like I often say, I'm not looking for people to give me permission to do anything."}, {"time": 4406, "text": "I'm just going to do the analysis myself with what I have."}, {"time": 4409, "text": "Avi Loeb has taken the same approach."}, {"time": 4411, "text": "He said, I'm not going to wait for the government to give me telescopic information about technologies or things that might be even on our own solar system."}, {"time": 4421, "text": "I'm just going to collect it myself."}, {"time": 4424, "text": "And that's the right way to do it, right?"}, {"time": 4426, "text": "Don't wait for somebody else to give it to you."}, {"time": 4428, "text": "It's also possible to inspire a large number of people to do a wider spread data collection."}, {"time": 4435, "text": "I mean, you yourself can't do a large enough data collection that would, if you're talking about anomalous events, you should be collecting high resolution data about everything that's happening on Earth in terms of like, in terms of the kind of things that would indicate to you a strong signal that something weird happened here."}, {"time": 4460, "text": "And this is why governments can be good at funding large scale efforts."}, {"time": 4466, "text": "I mean, you know, NASA and so on, working with SpaceX, with Blue Origin, you know, fund capitalistic sort of fund companies, fund company efforts to do huge moonshot projects."}, {"time": 4483, "text": "And in the same way, do huge moonshot data collection efforts in terms of UFOs."}, {"time": 4487, "text": "I mean, we're not, it needs to be like 10X, like one or two orders of magnitude more funding."}, {"time": 4493, "text": "To do this kind of thing."}, {"time": 4495, "text": "And I understand on the flip side of that, if you make it about what are the Russians, whether the Chinese doing, you know, make it a question of geopolitics, it gets touchy."}, {"time": 4506, "text": "Because now you're kind of taken away from the realm of science and... Making it military."}, {"time": 4512, "text": "Making it military."}, {"time": 4513, "text": "Some of the greatest, this is what makes me as an engineer, makes me truly sad that some of the greatest engineering work ever done is by Lockheed Martin, and we will never know about it."}, {"time": 4526, "text": "I wish we were, it was different, but it's the world we live in."}, {"time": 4533, "text": "You know, but related to that UIP task force announcement that you just said, you know, the bill was passed in the Department of Defense and now it formally establishes an office to collate that information and also to be transparent about it."}, {"time": 4550, "text": "Money is now set aside, right?"}, {"time": 4552, "text": "What do you think of it, just in case people don't know, the DOD establishing new department to study UFOs called Airborne Naming Command."}, {"time": 4562, "text": "But yes, Airborne Object Identification and Management Synchronization Group."}, {"time": 4567, "text": "Do you know how to pronounce that?"}, {"time": 4569, "text": "AOI MSG."}, {"time": 4571, "text": "It's stupid and needs to be renamed, but... AOI MSG."}, {"time": 4575, "text": "AO, all right, is directed by the Undersecretary of Defense for Intelligence and Security."}, {"time": 4582, "text": "What do you make of this office?"}, {"time": 4584, "text": "Are you hopeful about this office?"}, {"time": 4586, "text": "I think there's still a tug of war going on behind the scenes as to who's going to control this."}, {"time": 4592, "text": "But I do know, though, that money has been set aside that will be used to make things more public, right, to start to get others involved."}, {"time": 4605, "text": "And, you know, I'm involved with an effort to get other academics involved."}, {"time": 4611, "text": "So you think there might be some of that money could be directed towards funding maybe like groups like yours to do some research here."}, {"time": 4619, "text": "So they would be open to that, you think?"}, {"time": 4621, "text": "I mean, nothing is set in stone yet."}, {"time": 4624, "text": "So, you know, and I'm not hiding anything because I just don't know anything, right."}, {"time": 4628, "text": "But I do think that there will be public efforts."}, {"time": 4634, "text": "Now, there are being set up other private efforts to bring monies involved and to use that to leverage and get access to some of the internal resources as well."}, {"time": 4648, "text": "So what you're seeing is kind of an ecosystem building up in a positive sense of people who are willing to do the research."}, {"time": 4659, "text": "So, you know, before it would be you couldn't even go to a scientist and ask them to help."}, {"time": 4665, "text": "Now, if there's money, as I said before, scientists are essentially capitalists."}, {"time": 4670, "text": "We go where the money is."}, {"time": 4672, "text": "I mean, the work that I've done, I did out of my own pocket."}, {"time": 4675, "text": "And probably about $50,000, $60,000, $70,000 of money went into the paper we published out of my own pocket."}, {"time": 4685, "text": "But the amount of money that needs to go in is in at least the few millions to do a proper analysis of these materials."}, {"time": 4692, "text": "The work I know that the Galileo project is involved with, it's probably in the, you know, 5 to 10 million range to get stuff done."}, {"time": 4702, "text": "But that's actually a relatively modest amount of money to accomplish something that has been in the zeitgeist for decades."}, {"time": 4712, "text": "I should also push back a little bit on something you probably will agree with."}, {"time": 4717, "text": "You said scientists are essentially capitalists."}, {"time": 4719, "text": "What I've noticed is there's certainly an influence of money, but oftentimes when you're talking about basic research and basic science, the money is a little bit ambiguous to what direction you're doing the research in."}, {"time": 4734, "text": "And the scientists get really good at telling a narrative of like, yeah, yeah, yeah, we're fulfilling the purpose of this funding, but we're actually, they end up doing really what they're curious about."}, {"time": 4747, "text": "And of course you cannot deviate like if you're getting funded to study penguins in Antarctica, you can't start building rockets, but probably you can because you will convince some kind, you'll concoct a narrative saying rockets are really important for studying penguins in the Antarctic."}, {"time": 4762, "text": "I think that's actually, this is one thing I think people don't generally understand about the scientific mind is I don't know how capitalistic it is because if it was, they would start an effing company."}, {"time": 4778, "text": "I mean, when I meant capitalist, I didn't mean in the, they'll start companies per se."}, {"time": 4784, "text": "I mean, we can only do the research where there's money."}, {"time": 4788, "text": "And so from, you know, maybe it's a bad use of the term capitalist."}, {"time": 4793, "text": "But we will only do the research where there's money."}, {"time": 4797, "text": "I mean, why do most people work, many biologists work in cancer?"}, {"time": 4803, "text": "Uh, work in cancer research because there's a lot of money there."}, {"time": 4808, "text": "It's an important problem, but I might not have ever gotten involved in it if there wasn't money."}, {"time": 4814, "text": "I might've gone and I was going to be a botanist when I, when I was a kid."}, {"time": 4820, "text": "That's what I wanted to do."}, {"time": 4822, "text": "Um, so having money available will bring people to bear."}, {"time": 4828, "text": "Now, another mistake that's often actually made, I think by the lay public about science is that people think that we're paid to do things."}, {"time": 4836, "text": "Just as you said, I get a research grant and luckily from the NIH there, they give you a fair amount of latitude."}, {"time": 4843, "text": "I will go my own way and I'll find something."}, {"time": 4845, "text": "I might've proposed something, but I'll end up somewhere entirely different by the end of the project."}, {"time": 4851, "text": "And that's how good science is done."}, {"time": 4852, "text": "You follow the, you follow the data, you follow the results."}, {"time": 4856, "text": "Um, and so that's what I'm hoping can be done here."}, {"time": 4861, "text": "I think the worst kind of thing that could be done with this subject area is to put it inside another company where they have a set plan of what it is they're going to do and the scientists either tell, do what the executives tell them to do or not."}, {"time": 4878, "text": "That isn't how anything will really get discovered."}, {"time": 4881, "text": "Put it, get it out into the public, get open minds thinking about it and then publishing on it and doing the right kind of work."}, {"time": 4889, "text": "That's how real progress will be made with this."}, {"time": 4893, "text": "Let's again, put our sort of philosophical hats on."}, {"time": 4897, "text": "Do you think the US government or some other government is in possession of something of extraterrestrial origin that is far more impressive than anything we've seen in the public?"}, {"time": 4913, "text": "If I, I've not seen anything personally, but if I believe the people who I don't think can lie, yes."}, {"time": 4922, "text": "This is how does that make you feel in terms of the way government works, the way our human civilization works, that there might be things like that and we're not, they're not public."}, {"time": 4933, "text": "Is, is, is there a hopeful message for transparency that's possible?"}, {"time": 4937, "text": "Like if you were, if you were, uh, in power and I'm not saying president because maybe the president is not the source of power here."}, {"time": 4945, "text": "Would you release this information in some way or form?"}, {"time": 4949, "text": "Yes, if I were, I think it would, I think it's, I think it's something that can bring humanity together, right?"}, {"time": 4958, "text": "I think that knowledge of this kind of thing to know that we are, you know, we are more alike than we are different in comparison to whatever this is, is, uh, is a positive thing for us."}, {"time": 4975, "text": "Um, and to know, you know, I don't necessarily care that the government has been hiding it."}, {"time": 4981, "text": "And I think, you know, people who've been talking about what we should give government officials or whatever amnesty, I think that's probably the right, the right answer."}, {"time": 4990, "text": "We don't, this isn't a time to look back and say, you did something wrong."}, {"time": 4994, "text": "You did whatever you did because that was the data you had available to you at the time and those, you had good reasons for doing it."}, {"time": 4999, "text": "Now, if your reasons were selfish, if your reasons where you wanted to do it because you wanted to monetize it yourself, uh, to the, to your benefit, but against that of others, then I think maybe there's something else that could be said, but you know, an opportunity to get all this information out."}, {"time": 5018, "text": "If I were in charge, I would, I would try to do it."}, {"time": 5021, "text": "Now I might be shown something though that says, there's a reason why you don't want to let anybody know this."}, {"time": 5027, "text": "Maybe you don't want to let anybody know this and maybe you don't want everybody have having access to unlimited, uh, energy because maybe you might turn it into a bomb or something that gives you hints that something like unlimited energy is possible, but you haven't figured it out yet."}, {"time": 5044, "text": "And if you make it public, maybe some of the other governments you have tensions with we'll figure it out first."}, {"time": 5052, "text": "I mean, it's kind of an arms race going on, I think in all forms and it's, it makes me truly sad because, uh, it's obvious that, um, for example, the origins of the COVID virus, it's obvious to me that the Chinese government, whatever the origins are, is interested in not releasing information about it because it can only be bad for the Chinese government."}, {"time": 5080, "text": "And every government thinks like this, like every, actually this has been disappointment to me talking to PR folks at companies, like they're always nervous."}, {"time": 5094, "text": "They're always like conservative in the sense like, well, if we release more stuff, it can only be bad."}, {"time": 5102, "text": "And then an Elon Musk character comes along who tweets ridiculous memes and doesn't give a fuck."}, {"time": 5110, "text": "And I've been encouraging CEOs, I've been encouraging people to be transparent."}, {"time": 5115, "text": "And of course, government is national security is really like another level as human lives at stake."}, {"time": 5122, "text": "But let's start at the lighter case of just releasing some of the awesome insides of the tech, how, how the sausages made the technology and being transparent about it because it excites people."}, {"time": 5136, "text": "It uh, like you said, it, it connects people and inspires them."}, {"time": 5142, "text": "It's a good for the brand."}, {"time": 5144, "text": "It's good for everybody."}, {"time": 5145, "text": "I, I honestly think this kind of idea that people will steal the information and we use it against you is, um, is an idea that's not true in his idea of the 20th century."}, {"time": 5156, "text": "Like you said, some of the benefits of the social media, uh, our, our social world is that transparency is beneficial and I hope governments will learn that lesson."}, {"time": 5166, "text": "Of course, they're the, usually the last to learn such lessons."}, {"time": 5170, "text": "What do you make of Bob Lazar's story in terms of possession of aircraft?"}, {"time": 5175, "text": "Do you believe him?"}, {"time": 5176, "text": "I don't believe in the Bob Lazar story to be quite honest."}, {"time": 5179, "text": "I mean, I, uh, Jeremy Corbell has done a great job interviewing him and, uh, has done some, you know, beautiful, uh, documentaries."}, {"time": 5191, "text": "Um, I just don't, I, I don't know how to interpret it."}, {"time": 5198, "text": "And um, you know, and again, there's some of the people who I fraternize with think it's all rubbish."}, {"time": 5206, "text": "Uh, yeah, but he, maybe he's right, but I don't know."}, {"time": 5209, "text": "I mean, the, the problem is, and um, this is a little bit different about how I approach the whole area than a lot of others."}, {"time": 5218, "text": "I'm less interested in going over old paperwork and all these old histories of who said what, you know, the whole, he said, she said of the history of, of UFOs, I'm a scientist."}, {"time": 5233, "text": "I worked on the brain area because it's something I can collect data on."}, {"time": 5238, "text": "I can go back to the same individual, collect their MRI again and redo it."}, {"time": 5242, "text": "I can hand that MRI to somebody else."}, {"time": 5244, "text": "They can analyze it."}, {"time": 5246, "text": "I can get materials, I can analyze them."}, {"time": 5248, "text": "I can get some of these skeletons."}, {"time": 5250, "text": "I won't touch any skeletons ever again, but I can analyze it and somebody else can reproduce the data."}, {"time": 5256, "text": "I mean, that's what I'm good at."}, {"time": 5257, "text": "And so, you know, I'm, I, I, I'm not going to go into the whole, I'm not a historian."}, {"time": 5264, "text": "But there's a human side to it."}, {"time": 5268, "text": "I want, sometimes I think with these, because again, anomalous, rare events, some of the data is inextricably connected to humans, the observations, I mean, I hope in the future, you know, that, that, that sensory data will not be polluted by human subjectivity."}, {"time": 5288, "text": "But you know, that's still, that's still powerful data, even direct observations, like if you talk about pilots."}, {"time": 5295, "text": "And so it's an interesting question to me, whether Babasar is telling the truth, whether he believes he's telling the truth too, and what also, what impact his story and stories like his have on the willingness of governments to be transparent and so on."}, {"time": 5312, "text": "So you know, you have to credit his story for captivating the imagination of people and getting the conversation going."}, {"time": 5321, "text": "He's maintained his story for all these years with little to no change that I'm aware of."}, {"time": 5326, "text": "So but there's so many other people who are, let's say, experts in that story."}, {"time": 5332, "text": "Their gut, you know, you accumulate a set of sort of circumstantial evidence where your gut will say that somebody is not telling the truth."}, {"time": 5345, "text": "You mentioned Avi Loeb, I forgot to ask you about Oumuamua."}, {"time": 5351, "text": "You know, because you've analyzed specimens here on Earth, what do you make of that one?"}, {"time": 5357, "text": "And what do you make broadly of our efforts to look, look at rocks, essentially, or look at objects flying around in our solar system?"}, {"time": 5368, "text": "Is that a valuable pursuit or maybe most of the stories can be, most of the fascinating things could be discovered here on Earth or on other nearby planets?"}, {"time": 5377, "text": "Just going to Oumuamua, you know, I think Avi's insight is an interesting speculation, right?"}, {"time": 5388, "text": "Like I was saying before, people can sometimes look at something and not see it for what it is."}, {"time": 5393, "text": "Somebody would just look at that and say, oh, it's an asteroid and dismiss it."}, {"time": 5398, "text": "There was something odd about the data that Avi picked up on and said, well, here's an alternative explanation that doesn't fit, that actually better fits the models than it just being a rock, you know."}, {"time": 5410, "text": "And to his credit, he just has ignored the critics because he believes the data is real and is using that then as a battering ram to go after other things."}, {"time": 5422, "text": "And I think that's, I think that's great."}, {"time": 5426, "text": "What, what is his main conclusion?"}, {"time": 5427, "text": "Does he say it could be of alien extraterrestrial origin?"}, {"time": 5431, "text": "Is that his?"}, {"time": 5432, "text": "Well, that's one of the things."}, {"time": 5433, "text": "I mean, he, you know, he's explained how it could be a light sale."}, {"time": 5438, "text": "And a light sale is certainly within near human capabilities to make such a thing."}, {"time": 5444, "text": "I think Yuri Milner, he's a Russian billionaire."}, {"time": 5449, "text": "He's involved, I think, in a project to make light sales with laser, you know, to, to launch them with laser power, essentially, towards Alpha Centauri, right?"}, {"time": 5463, "text": "So it's something that humans could make."}, {"time": 5467, "text": "I think Avi's proposal is perfectly within the realm of possibility."}, {"time": 5471, "text": "I mean, sadly, the thing is, you know, now nearly out of our solar system."}, {"time": 5475, "text": "Yes, I mean, to me, that's inspiring to do greater levels of data collection in our solar system, but also here on Earth."}, {"time": 5483, "text": "And it just seems like we should be constantly collecting, collecting data because the tools of software that we're developing get better and better at dealing with huge amounts of data."}, {"time": 5492, "text": "It's changing the nature of science, I mean, collect all of the data, right?"}, {"time": 5497, "text": "Collect the data."}, {"time": 5498, "text": "I mean, I, I, the Galileo project asked me over the weekend to join and I did."}, {"time": 5503, "text": "So you know, I'm not a specialist in any of the stuff that they're doing."}, {"time": 5508, "text": "But you know, in looking at the list of people who are on there, there are really no biologists on there."}, {"time": 5515, "text": "So at, at some point, if my expertise is required for something."}, {"time": 5519, "text": "What's the goal and the vision of the Galileo project?"}, {"time": 5521, "text": "Better talk to Avi, but my understanding and just actually looking at the, at the sort of the bylaws this morning, literally just got them, is number one, collect the data on UAP."}, {"time": 5533, "text": "And number two, collect data on local, potentially local technological artifacts."}, {"time": 5541, "text": "I need to look into this."}, {"time": 5544, "text": "And Avi is heading the Galileo project."}, {"time": 5548, "text": "Have you spoken to him?"}, {"time": 5549, "text": "On this podcast?"}, {"time": 5551, "text": "That was before, I believe it was before he was headed."}, {"time": 5553, "text": "Is this a new creation?"}, {"time": 5555, "text": "The Galileo project was, I think it's about six or seven months old now."}, {"time": 5560, "text": "And he's getting a group of scientists together."}, {"time": 5563, "text": "Actually, I am, I was looking at some of their stuff over the weekend."}, {"time": 5567, "text": "I'm shocked at the level of organization that they've already got put together."}, {"time": 5571, "text": "It looks like a moonshot project."}, {"time": 5573, "text": "I mean, I've been involved with a lot of NIH, large NIH projects, which involve a lot of people in coordination and they're putting it together."}, {"time": 5586, "text": "So you're extremely well published in a lot of the fields we began this conversation with."}, {"time": 5597, "text": "So you're a legit scientist, but yet you're keeping an open mind to a lot of ideas that maybe require you to take a leap outside of the conventional."}, {"time": 5613, "text": "So what advice would you give to young people today that are in high school or in college that are dreaming of having impact in science or maybe in whatever career path that goes outside of the conventional that really does something new?"}, {"time": 5633, "text": "If you believe in something, you believe that an idea is valuable or you haven't approached something, don't let others shame you into not doing it."}, {"time": 5646, "text": "As I've said, shame is a societal control device to get other people to do what they want you to do rather than what you want to do."}, {"time": 5656, "text": "So shame sometimes is good to stop you from doing something unethical or wrong, but shame also is something that is circumscribing your environment."}, {"time": 5667, "text": "I've never let people who've told me, you shouldn't do that line of science, you should be ashamed of yourself for even thinking that, give me a break."}, {"time": 5678, "text": "Why is it wrong to ask questions about this area?"}, {"time": 5681, "text": "What's wrong with asking the question?"}, {"time": 5683, "text": "Frankly, you're the person who's wrong for trying to stop these questions."}, {"time": 5688, "text": "You're the person who's almost acting like a cultist."}, {"time": 5693, "text": "You basically have closed your mind to what the possibilities are, and if I'm not hurting anybody, and if it could lead to an advance, and if it's my time, why does it bother you?"}, {"time": 5704, "text": "I had a very well known scientist once tell me that I was going to hurt my career talking about this."}, {"time": 5711, "text": "If anything, it's enhanced my career."}, {"time": 5713, "text": "I have a couple of questions on this."}, {"time": 5715, "text": "So first of all, just a small comment on that."}, {"time": 5718, "text": "I've realized that it feels like a lot of the progress in science is done by people pursuing an idea that another senior faculty would probably say, this is going to hurt your career."}, {"time": 5730, "text": "I think it's actually a pretty good indicator that there's something interesting when a senior wise person tells you this is going to hurt your career."}, {"time": 5740, "text": "I think that's just the one, as a small, if I were to give advice to young people, if somebody senior tells you this is going to hurt your career, think twice about taking their advice."}, {"time": 5751, "text": "I mean, I think that's the primary thing."}, {"time": 5754, "text": "And the other, I tell my own students, I have a lab of about 20, 30 people and it's been that big since 1992."}, {"time": 5763, "text": "People come and go."}, {"time": 5766, "text": "It's not the data that falls in line that's so interesting."}, {"time": 5774, "text": "It's the spot off the graph that you want to understand."}, {"time": 5781, "text": "When something is way off the graph, that's the interesting thing because that's usually where discovery is."}, {"time": 5788, "text": "And the number of times that I've stopped people in my lab and said, wait a second, go back a few slides."}, {"time": 5795, "text": "And then it ended up being something interesting that made their careers, I could count on a few hands."}, {"time": 5805, "text": "Get excited by the extraordinary that's outside of the thing that you've done in the past."}, {"time": 5813, "text": "Just on a personal psychological level, is there, I'm sure at Stanford, I'm sure in you exploring some of these ideas, there's pressure."}]}]