[{"title": "Michael Malice: Anarchy, Democracy, Libertarianism, Love, and Trolling | Lex Fridman Podcast #128", "id": "BIk1zUy8ehU", "quotes": [{"time": 281, "text": "Okay, wow."}, {"time": 282, "text": "No, because you came here a little bit when you were younger."}, {"time": 285, "text": "I came here when I was 13, so I saturated a little bit of the Russian soul."}, {"time": 289, "text": "I marinated in the Russian soul a little deeper."}, {"time": 292, "text": "I haven't told anyone this, but I'll be glad to tell you, Davidish."}, {"time": 296, "text": "I haven't been back since I was two."}, {"time": 299, "text": "And next summer, it looks like me and my buddy, Chris Williamson, who's also a podcaster, he's British, Modern Wisdom, he looks like Apollo."}, {"time": 306, "text": "Looks like we got a videographer."}, {"time": 307, "text": "Which Apollo?"}, {"time": 308, "text": "Apollo Creed?"}, {"time": 309, "text": "The god, he looks like the god Apollo."}, {"time": 310, "text": "Yeah, he's like a model."}, {"time": 311, "text": "I thought you were talking about Rocky."}, {"time": 313, "text": "So, we're gonna go for the first time to see where I came from."}, {"time": 318, "text": "Which is in Ukraine."}, {"time": 319, "text": "We're gonna go to Lvov and either St. Petersburg or Moscow, probably St. Petersburg, or both."}, {"time": 324, "text": "It's gonna be intense."}, {"time": 325, "text": "It's gonna be a lot of panic attacks, I feel."}, {"time": 328, "text": "And your Russian is okay?"}, {"time": 333, "text": "Good?"}, {"time": 334, "text": "Do you understand?"}, {"time": 334, "text": "No, you can't talk Russian in Ukraine, or it's like they get offended."}, {"time": 337, "text": "Yeah, but then you also wanna go to Russia."}, {"time": 342, "text": "For me, there's several people in Russia I wanna interview on a podcast."}, {"time": 347, "text": "So, one of them is Gagarin Perlman, which is a mathematician, and the other person is Putin."}, {"time": 353, "text": "You know what my favorite Putin story is?"}, {"time": 355, "text": "Do you know this?"}, {"time": 357, "text": "When he had Merkel with him, do you know this story?"}, {"time": 359, "text": "Merkel's scared of dogs, like petrified of dogs."}, {"time": 362, "text": "So, he brings in his like black lab."}, {"time": 366, "text": "It's a Labrador, it's like the sweetest animal, and it's all over her, and there's pictures, and she's sitting like this, and she's terrified, and he's like, what's wrong, Angela?"}, {"time": 373, "text": "He's just completely trolling her."}, {"time": 376, "text": "Yeah, he's aware of the sort of the narrative around him."}, {"time": 381, "text": "And then he plays with it."}, {"time": 383, "text": "He enjoys it."}, {"time": 384, "text": "It's a very Russian thing."}, {"time": 384, "text": "My friend wanted to do a film about me."}, {"time": 386, "text": "He goes, I realized you guys aren't like us at all."}, {"time": 388, "text": "You're just like, look at us, and then I started telling him stories about the upbringing, and he's like, oh my God, and as I'm telling them, I'm like, wow, this stuff is really crazy, like how we are wired."}, {"time": 398, "text": "Who's the we?"}, {"time": 399, "text": "Your friend is?"}, {"time": 400, "text": "The Russian, the friend's American."}, {"time": 400, "text": "I'm saying the way Russians are brought up, and the way, maybe, I don't think it was just my family."}, {"time": 405, "text": "I bet you had similar things."}, {"time": 407, "text": "I was, I had a buddy staying with me."}, {"time": 410, "text": "He had a problem with his roommate, so he crashed at my place, fine."}, {"time": 413, "text": "I went to the gym, and I come back, and he goes, oh, there was, and my apartment building is four four apartments, so it's not like a huge thing."}, {"time": 422, "text": "He goes, oh, there was someone knocking at your door, so I told him blah blah, and for me, and I wonder if you're the same way, if I'm at someone's house that's not my own, and someone knocks on the door, I wouldn't even think to answer it."}, {"time": 436, "text": "Like if I had an apple here, maybe I'd eat it, I'd cut it, whatever."}, {"time": 440, "text": "I'm not gonna, it just doesn't enter my head to smash into my face."}, {"time": 443, "text": "The thought of answering the door, if it's not my house, it would never enter my head."}, {"time": 447, "text": "Would it enter your head?"}, {"time": 448, "text": "No, but why?"}, {"time": 450, "text": "But he's an American, so someone's at the door."}, {"time": 451, "text": "He goes and opens it, even though it's not his house."}, {"time": 453, "text": "I would never do that."}, {"time": 454, "text": "I would never think to do that."}, {"time": 456, "text": "That is so strange that you pick some very obscure thing to delineate Americans and Russians."}, {"time": 462, "text": "I don't think that's obscure, because I think it speaks to how we perceive strangers."}, {"time": 466, "text": "With Americans, everyone's friendly, and with us, it's like, no, no, you have that moat, and I think that percolates into many different aspects of how we relate to people, and I have to undo a lot of that."}, {"time": 478, "text": "You're right, there's the relationship I formed there where in Russia, we're very deep and close, and then there's the strangers, the other, that you don't trust by default."}, {"time": 488, "text": "It takes a long time to go over the moat of trust."}, {"time": 491, "text": "For a long time, until recently, whenever I said anything to anyone, my brain ran a scan that said, if this person turns on you, would this, can they use this against you?"}, {"time": 502, "text": "And I would do this with everything I said with strangers, and after a while, it's like, you know what?"}, {"time": 506, "text": "Maybe they will, but I'm strong enough to take it, but this is not how Americans think."}, {"time": 510, "text": "Or here's another one."}, {"time": 512, "text": "Sorry, I'm taking over the interview."}, {"time": 513, "text": "People ask about advice for work, right?"}, {"time": 515, "text": "Like I had this, there was this party I went to, and basically everyone had their own problems, and everyone else gave their advice, right?"}, {"time": 521, "text": "And someone's having a problem with a coworker, and the advice these Tupoy Americans gave them is, oh, sit down and have a talk with them."}, {"time": 528, "text": "And to me, this is like the last case, last resort."}, {"time": 532, "text": "Like first, you have to see what you can without showing your hand, showing your vulnerability, only when everything hasn't worked out, or you're like, all right, let me sit down with you and try to have it out with you, probably."}, {"time": 542, "text": "But for them, the first thing is like, sit down and be like, oh, you're causing me problems, blah, blah, blah."}, {"time": 546, "text": "So I perceive that right away as a threat, that this person sees an antagonism between us, and also as a weakness that I'm getting to them."}, {"time": 553, "text": "So my reaction isn't how do I make it better?"}, {"time": 557, "text": "My reaction is to reinforce my position and see what I can to marginalize them, usually."}, {"time": 563, "text": "I haven't worked in a corporate setting in a long time."}, {"time": 565, "text": "But it's not, I don't approach it the way an American would."}, {"time": 567, "text": "Like, I'm glad you came and talked to me."}, {"time": 569, "text": "Now I probably would, because it's gonna be a friend."}, {"time": 571, "text": "So you attribute that to the Russian upbringing, as opposed to you have deep psychological issues."}, {"time": 577, "text": "I think those are synonymous, don't you?"}, {"time": 579, "text": "Wait, would you think differently, maybe a few years ago?"}, {"time": 586, "text": "I don't know, I think you lost me at the, because you kind of said that, you're kind of implying you have a deep distrust of the world, like the world is."}, {"time": 597, "text": "I think the default setting would be distrust, yeah."}, {"time": 599, "text": "But I would put it differently, is I almost ignore the rest of the world, I don't even acknowledge it, I just savor, I save my love and trust for the small circle of people."}, {"time": 618, "text": "I agree, but when that person is being confrontational, or as they perceive it, as being open, now there's a situation, how would you handle that?"}, {"time": 627, "text": "Like a cold wind blows, you just kind of like."}, {"time": 631, "text": "Yeah, but it's not like this is an opportunity for us to work out our differences, it's a cold wind."}, {"time": 636, "text": "It's not a hug, that's my point."}, {"time": 638, "text": "Americans think it's a hug, a cold wind."}, {"time": 641, "text": "You're so suspicious, what it really is, is a cold wind."}, {"time": 646, "text": "I'm so humane, it's not something to be scared of, it's a cold wind, it's a good person."}, {"time": 652, "text": "But it's not, this is great, but it's not a source of, like I'm not suspicious of, like I'm not anxious, I would say, or like living in fear of the rest of the world, I'm more."}, {"time": 664, "text": "Oh, I agree, but you're not receptive to that person."}, {"time": 667, "text": "That's all I'm saying, and they are."}, {"time": 669, "text": "Got it, so speaking of which, let's talk about love."}, {"time": 674, "text": "Which requires to be receptive of the world, of strangers."}, {"time": 679, "text": "How do we put more love out there in the world, especially on the internet?"}, {"time": 685, "text": "One mechanism I have found to increase love, and that's a word that has many meanings and is used in a very intense sense and is used in a very loose sense."}, {"time": 695, "text": "Can you try to define love?"}, {"time": 696, "text": "Sure, love is a strong sense of attraction toward another person, entity, or place that causes one to tend to react in a disproportionately positive manner."}, {"time": 713, "text": "That's off the top of my head."}, {"time": 714, "text": "Disproportionately."}, {"time": 715, "text": "Yes, so for example, if you."}, {"time": 717, "text": "Why not proportionately?"}, {"time": 718, "text": "Because if someone's about to, who you love, is about to get harmed, you're moving heaven and earth to make sure, or like a book you love."}, {"time": 728, "text": "I love this book, like you're going through the fire to try to save it, whereas if it's a book you really like, it's like, oh, I'll get another one."}, {"time": 736, "text": "And a book's kind of a loose example, but."}, {"time": 738, "text": "So you're going with the love that's like, you're saving for just a few people, almost like romantical, like love for a close family."}, {"time": 745, "text": "But what about just love to even the broader, like the kind of love you can put out to people on the internet, which is like just kindness."}, {"time": 753, "text": "Sure, I would say in that case, it's important to make them feel seen and validated."}, {"time": 761, "text": "And I try to do this when people who I have come to know on the internet, and there's a lot, I try to do that as much as possible because I don't think it's valid how on social media, and I do this a lot myself, but not towards everyone, it's just there to be aggressive and antagonistic."}, {"time": 778, "text": "You should be antagonistic towards bad people, and that's fine, but at the same time, there's lots of great people."}, {"time": 784, "text": "And especially with my audience, and I would bet disproportionately with yours, there's lots of people who are, because of their psychology and intelligence, are going to be much more isolated socially than they should."}, {"time": 797, "text": "And if I, and I've heard from many of them, and if I'm the person who makes them feel, oh, I'm not crazy, it's everyone else around me who is just basic, the fact that I can be that person, which I didn't have at their age, to me is incredibly reaffirming."}, {"time": 812, "text": "You mean that source of love?"}, {"time": 814, "text": "But I mean love in the sense of like, you know, you care about this person and you want good things for them, not in a kind of romantic way."}, {"time": 820, "text": "But I mean, you're using it in a broad sense now."}, {"time": 822, "text": "Yeah, but you're also a person who kind of, I mean, attacks the power structures in the world by mocking them effectively."}, {"time": 834, "text": "And love, I would say, requires you to be non witty and simple and fragile, which I see it as like the opposite of what trolls do."}, {"time": 848, "text": "Trolls are, if there is someone coming after what I love, there's two mechanisms, right, at least two."}, {"time": 858, "text": "I go up and I'm fighting them, and in which case you are getting hurt in a knife fight, even if you win the knife fight, or if you disarm them and you preclude the possibility of a fight and you drive them off or render them powerless, you keep your person intact as yourself and you also protect your values."}, {"time": 879, "text": "So how do you render them powerless?"}, {"time": 881, "text": "As you just said, by mocking them."}, {"time": 883, "text": "One of the most effective mechanisms for those in power, we're much closer to Brave New World than 1984."}, {"time": 888, "text": "The people who are dominant and in power aren't there because of the threat of the gulag or prison."}, {"time": 894, "text": "They're there because of social pressures."}, {"time": 896, "text": "Look at the masks."}, {"time": 897, "text": "I was on the subway not that long ago in New York City."}, {"time": 901, "text": "No one cared who I was until I put off the mask."}, {"time": 904, "text": "I was in the subway that long in New York City."}, {"time": 906, "text": "And I put this on my Instagram."}, {"time": 907, "text": "I've told this story before."}, {"time": 908, "text": "There was an Asian dude in his early 30s."}, {"time": 910, "text": "He was like in Western clothes."}, {"time": 911, "text": "It's not like he had a rickshaw or something."}, {"time": 913, "text": "An older man in his 50s stood up over him on the subway, screamed at him, said, go back where you came from."}, {"time": 921, "text": "I'm gonna get sick."}, {"time": 922, "text": "If you think this guy is a vector of disease, which is your prerogative, why are you coming close to him?"}, {"time": 925, "text": "Why are you getting in his face?"}, {"time": 928, "text": "Sorry, so it was because he was Asian?"}, {"time": 932, "text": "It was both."}, {"time": 932, "text": "It was the not having a mask gave him the permission to act like a despicable, aggressive person toward him."}, {"time": 941, "text": "And the point being, a lot of these mechanisms for social control are outsourced to low quality people because this is their one chance to assert dominance and status over somebody else."}, {"time": 953, "text": "So the best way to diffuse that isn't with weaponry or fighting."}, {"time": 956, "text": "It's through mockery because all of a sudden, their claims to authority are effectively destroyed."}, {"time": 962, "text": "What about fighting that with love, with patience and kindness towards them?"}, {"time": 970, "text": "I don't think kindness is, I think that would be a mismatch and inappropriate."}, {"time": 976, "text": "There's Superman, there's Batman, okay?"}, {"time": 978, "text": "And Superman's job is to help the good people and Batman's job is to hurt the bad people."}, {"time": 982, "text": "And I will always be on the Batman side than the Superman side."}, {"time": 987, "text": "Both work silly tight costumes."}, {"time": 989, "text": "One has pointy ears."}, {"time": 991, "text": "Both are ridiculous, so let's."}, {"time": 993, "text": "One's a billionaire who gets, he's swimming in trim."}, {"time": 996, "text": "Which one is a billionaire?"}, {"time": 996, "text": "Batman."}, {"time": 997, "text": "Okay, I'm undereducated on the superhero movies, I apologize."}, {"time": 1004, "text": "Okay, but you're just saying your predisposition is to be on the Batman side, is to fighting the bad guys."}, {"time": 1014, "text": "Yeah, and it's what I'm good at."}, {"time": 1017, "text": "That's what you're good at."}, {"time": 1018, "text": "But just to play devil's advocate, or actually, in this case, I am the devil because it's what I usually do."}, {"time": 1026, "text": "Well, I'm the devil, you're the angel's advocate."}, {"time": 1028, "text": "Exactly, to be the angel advocate, yeah."}, {"time": 1032, "text": "Is like, I feel like mockery is a path towards escalation of conflict."}, {"time": 1040, "text": "Yes, in many ways, yes."}, {"time": 1042, "text": "So you're not, I mean, it's kind of like guerrilla warfare."}, {"time": 1048, "text": "I mean, you're not going to win."}, {"time": 1051, "text": "I am winning, we're all winning."}, {"time": 1052, "text": "We're winning on a daily."}, {"time": 1053, "text": "This is my next book, we're winning."}, {"time": 1055, "text": "We've won before, I'm not joking."}, {"time": 1057, "text": "The topic of the next book."}, {"time": 1059, "text": "Yes, it's the white pill."}, {"time": 1060, "text": "The white pill."}, {"time": 1061, "text": "Is that we're gonna, we are winning."}, {"time": 1063, "text": "The most horrible people are being rendered into laughing stocks on a daily basis on social media."}, {"time": 1069, "text": "This is a glorious thing."}, {"time": 1069, "text": "This is good, I so disagree with you."}, {"time": 1072, "text": "I disagree with you because there's side effects that are very destructive."}, {"time": 1075, "text": "It feels like you're winning, but we're completely destroying the possibility of having like a cohesive society."}, {"time": 1084, "text": "That's called oncology."}, {"time": 1087, "text": "Curing cancer."}, {"time": 1089, "text": "No, I, yeah."}, {"time": 1089, "text": "Your concept of a cohesive society is, in fact, a society based on oppression and not allowing individuals to live their personal freedom."}, {"time": 1100, "text": "Oh, so you're a utopian view of the world."}, {"time": 1102, "text": "You're the utopian."}, {"time": 1103, "text": "You're saying cohesive society."}, {"time": 1104, "text": "I'm saying I don't need that."}, {"time": 1105, "text": "I'm saying there's gonna be conflict."}, {"time": 1107, "text": "Right, there's gonna be conflict."}, {"time": 1109, "text": "You and I are disagreeing right now."}, {"time": 1110, "text": "That's not cohesive."}, {"time": 1111, "text": "Doesn't mean we like each other less."}, {"time": 1112, "text": "Doesn't mean we respect each other less."}, {"time": 1114, "text": "Cohesive doesn't, it's just a euphemism for like everyone submitting to what I want."}, {"time": 1119, "text": "No, I mean, cohesive could be that."}, {"time": 1123, "text": "It could be like enforced with violence, all that kind of stuff, sort of the libertarian view of the world, but it could just be being respectful and kind of each other and kind towards each other and loving towards each other."}, {"time": 1142, "text": "I mean, that's what I mean by cohesive."}, {"time": 1144, "text": "So when people say free, it's funny."}, {"time": 1147, "text": "Like freedom is a funny thing because freedom could be painful to a lot of people."}, {"time": 1155, "text": "It's all matters how you define it, how you implement it, how it actually looks like."}, {"time": 1161, "text": "I'm just saying it feels like the mockery of the powerful leads to further and further divisions."}, {"time": 1171, "text": "It's like it's turning life into a game to where it's always you're creating these different little tribes and groups and you're constantly fighting the groups that become a little bit more powerful by undercutting them through guerrilla warfare kind of thing."}, {"time": 1193, "text": "And that's what the internet becomes is everyone's just mocking each other and then certain groups become more and more powerful and then they start fighting each other and they form groups of ideologies and they start fighting each other in the internet where the result is it doesn't feel like the common humanities highlighted."}, {"time": 1214, "text": "It doesn't feel like that's a path of progress."}, {"time": 1219, "text": "Now, like when I say cohesive, I don't mean like everybody has to be enforcing equality, all those kinds of ideas."}, {"time": 1227, "text": "I just mean like not being so divisive."}, {"time": 1231, "text": "So it's going back to the original question of like, how do we put more love out in the world than the internet?"}, {"time": 1237, "text": "I want divisiveness."}, {"time": 1239, "text": "Oh, you see, you think divisiveness is that?"}, {"time": 1241, "text": "That's the goal."}, {"time": 1242, "text": "It's the goal."}, {"time": 1243, "text": "So you started this conversation where you're talking about you have love for that small group."}, {"time": 1247, "text": "I think we both would agree to have a bigger group would be better, especially if that love comes from a sincere place."}, {"time": 1253, "text": "I think our country, I wrote an article about this four years ago that it's time to disunite the states and to secede."}, {"time": 1260, "text": "This country has been held together with at least two separate cultures with dumb text and string for over 20 years."}, {"time": 1266, "text": "There's an enormous amount of contempt from one group toward another."}, {"time": 1270, "text": "This contempt comes from a sincere place."}, {"time": 1272, "text": "They do not share each other's values."}, {"time": 1274, "text": "There's absolutely no reason, just like any unhealthy relationship where you can't say, you know what?"}, {"time": 1279, "text": "It's not working out."}, {"time": 1280, "text": "I want to go my own way and live my happiness."}, {"time": 1284, "text": "And I genuinely want you to go your way, live your happiness."}, {"time": 1287, "text": "If I'm wrong, prove me wrong."}, {"time": 1288, "text": "I'll learn from you and take lessons and vice versa."}, {"time": 1291, "text": "But the fact that we all have to be in the same house together is not coherent."}, {"time": 1295, "text": "And that's not love."}, {"time": 1296, "text": "That is the path towards friction and tension and conflict."}, {"time": 1300, "text": "Do you think there's concrete groups?"}, {"time": 1303, "text": "Like is it as simple as the two groups of blue and red?"}, {"time": 1307, "text": "No, it's also very fluid because you and I are allied as Jewish people, as Russians, as males, as podcasters."}, {"time": 1317, "text": "You're an academic, I'm not."}, {"time": 1318, "text": "So we're different, but we each are a Venn diagram, even within ourselves."}, {"time": 1324, "text": "And I can talk to you about politics and then we can talk about Russia stuff."}, {"time": 1328, "text": "And then you could talk about your work, which I don't know anything about."}, {"time": 1332, "text": "So that'd be where you're way up here and a way down here."}, {"time": 1334, "text": "So there's lots, every relationship with just between individuals, it's very dynamic."}, {"time": 1338, "text": "So how do we succeed?"}, {"time": 1340, "text": "Like how do we form individual states where there's a little bit more cohesion?"}, {"time": 1345, "text": "Sure, and voluntary cohesion."}, {"time": 1347, "text": "So the first step is to eliminate and the concept of political authority as legitimate and to denigrate and humiliate those who would put themselves in a position in which they are there to tell you how to live your life from any semblance of validity."}, {"time": 1366, "text": "And that's starting to happen."}, {"time": 1368, "text": "If you look at what they had with the lockdowns, Cuomo and de Blasio, New York, I was tired a couple of weeks ago."}, {"time": 1376, "text": "And I said to my friend, oh, just click, maybe I have COVID."}, {"time": 1378, "text": "And he goes, it's not possible, like what do you mean?"}, {"time": 1380, "text": "And he goes, we haven't had any deaths in like two months."}, {"time": 1384, "text": "And there's only like 100 cases a day for like two months."}, {"time": 1388, "text": "And I go, you're exaggerating because everything was still closed."}, {"time": 1391, "text": "And I looked at the numbers and he wasn't exaggerating."}, {"time": 1393, "text": "And there's no greater American dream to me than an immigrant family comes to the states, forms their own little business."}, {"time": 1401, "text": "Maybe mom's a good cook, it's a restaurant, dry cleaner, fruit stand."}, {"time": 1405, "text": "And those people aren't gonna have a lot of money."}, {"time": 1407, "text": "Those are the first ones who lost their companies because of these lockdowns."}, {"time": 1413, "text": "Cuomo, who's the governor of New York, opened up the gyms, he said, you're clear to open up."}, {"time": 1418, "text": "De Blasio said, and we don't have enough inspectors, you're gonna have to wait another couple of weeks."}, {"time": 1423, "text": "To regard that as anything other than literally criminal is something that I am having a hard and harder time wrapping my head around."}, {"time": 1431, "text": "You said, I mean, that's something I'm deeply worried about as well, which is like thousands, it's actually millions of dreams being crushed, that American dream of starting a business, of running a business."}, {"time": 1443, "text": "What about all the young people who you and I have in our audiences who are socially isolated at best, and now they can't leave their homes?"}, {"time": 1452, "text": "Isolation and ostracism are things that are very well studied in psychology."}, {"time": 1457, "text": "These have extreme consequences."}, {"time": 1459, "text": "I read a book called Ostracism, and this wasn't scientific, but basically the author was a psychiatrist, psychologist, whatever, and he had one of his colleagues, they did an experiment, let's for a week, you ostracize me completely."}, {"time": 1470, "text": "We know it's an, and he goes, even knowing it's the experiment, the fact that he wouldn't make eye contact with me and the fact that he ignored me had an extreme emotional impact on me, knowing full well this is purely for experimental purposes."}, {"time": 1484, "text": "Now you multiply that by all these, the suicide, the number of kids who were thinking about suicide was through the roof during all this."}, {"time": 1490, "text": "And my point is, until these people, it's gonna, I would predict like 2024, that's where we're gonna have to start having conversations about what personal consequences have to be done for these people, because until then, they're gonna do the same thing."}, {"time": 1503, "text": "So you think there's going to be society wide consequences of this that we're gonna see, like ripple effects, because of the social isolation?"}, {"time": 1510, "text": "I know, I mean, we also need to talk about consequences for Cuomo and de Blasio, because if politicians respond to incentives, and the incentives are there for them to be extremely conservative, because if you have to choose, as Cuomo said in a press conference, between a thousand people dying and a thousand people losing their business, it's not a hard choice, and he's right."}, {"time": 1528, "text": "But at a certain point, it's like, all right, you're losing both, you're making these decisions and not having consequences for it, and you're gonna do it again the next time, so we need to make sure you're a little scared."}, {"time": 1541, "text": "And I don't know what that would mean."}, {"time": 1542, "text": "But you're laying this problem, this incompetence."}, {"time": 1548, "text": "I don't think it's incompetence, I think it's very competent."}, {"time": 1551, "text": "I think their job is to be able, yes."}, {"time": 1554, "text": "But you're laying it not at the hands of the individuals, but the structure of government."}, {"time": 1561, "text": "It's both, yes."}, {"time": 1563, "text": "How would we deal with it better without centralized control?"}, {"time": 1567, "text": "Well, we didn't really have centralized control, because every country and every state handled it in a different mechanism."}, {"time": 1572, "text": "But a city has centralized control, right?"}, {"time": 1577, "text": "So Cuomo and de Blasio, they had a lot of disagreements over this over the months, and this was actually a source of great interest and tension."}, {"time": 1583, "text": "De Blasio wanted, at one point, was talking about quarantining people in their homes."}, {"time": 1587, "text": "Cuomo was like, you're crazy."}, {"time": 1589, "text": "Same thing with the schools, same thing with the gyms, and there were other such examples."}, {"time": 1595, "text": "But the point being, this was an emergency."}, {"time": 1598, "text": "World War I, I talked about this on Tim Poole's show, was very dangerous, because it gave a lot of evil people some very useful information about what the country put up with and what they can get away with under wartime."}, {"time": 1611, "text": "And this set the model for things like the New Deal and the other things of that nature."}, {"time": 1615, "text": "It is undeniable, you're a scientist, so you understand this perfectly well, that this lockdown gave some very nefarious people some very valid data about how much people were put up with under pressures from the state."}, {"time": 1633, "text": "So fundamentally, what is the problem with the state?"}, {"time": 1636, "text": "Its existence."}, {"time": 1637, "text": "Okay, well, but to play angel's advocate again, angel's advocate again, you know, government is the people."}, {"time": 1648, "text": "Come on, do you really think this?"}, {"time": 1651, "text": "As best I think as possible to have representation."}, {"time": 1655, "text": "Can you imagine if you have an attorney?"}, {"time": 1657, "text": "You're like, oh, you can't have the attorney you want."}, {"time": 1658, "text": "You're gonna have this guy who you absolutely hate who you share no values with, why?"}, {"time": 1662, "text": "Because he drives, I mean, leaders, political leaders, and political representation drive the discourse."}, {"time": 1668, "text": "Like the majority of people voted for him or whatever, however you define that."}, {"time": 1675, "text": "And now we get to have a discussion, well, was this the right choice?"}, {"time": 1681, "text": "And then we get to make that choice again in four years and so on."}, {"time": 1684, "text": "First of all, the fact that I have to be under the thumb of somebody for four years makes no sense."}, {"time": 1689, "text": "There's no other relationship that's like this, including a marriage."}, {"time": 1692, "text": "You can leave any other relationship at any time, number one."}, {"time": 1695, "text": "Number two is."}, {"time": 1696, "text": "You could always impeach."}, {"time": 1697, "text": "Well, they did that."}, {"time": 1698, "text": "Part of it I'm just saying that the mechanisms are flawed in many ways, yeah."}, {"time": 1704, "text": "Yeah, right, and so that's number one."}, {"time": 1706, "text": "Number two is it doesn't make sense that if I don't want someone to represent me that because that person is popular that they are now in a position to."}, {"time": 1716, "text": "So having representation and having citizenship based on geography is a prelandline technology in a post cell phone world."}, {"time": 1725, "text": "There's no reason why I have to, just because we're physically in between two oceans, we all have to be represented by the same people, whereas I can very easily have my security be under someone and switch it as easily as cell phone providers."}, {"time": 1738, "text": "So, okay, but it doesn't have to be geographical."}, {"time": 1741, "text": "It can be ideas."}, {"time": 1743, "text": "I mean, this country represents a certain set of ideas."}, {"time": 1746, "text": "It started out geographically."}, {"time": 1747, "text": "It still is geographic."}, {"time": 1749, "text": "It started off as ideas as well."}, {"time": 1750, "text": "But like, it was intricately."}, {"time": 1752, "text": "I mean, that's the way humans are."}, {"time": 1754, "text": "I mean, there was no internet."}, {"time": 1757, "text": "So it was, you were geographically in the same location and you signed a bunch of documents and then you kind of debated and you wrote a bunch of stuff and then you agreed on it."}, {"time": 1767, "text": "You understand that no one signed these documents and no one agreed to it."}, {"time": 1770, "text": "As Lysander Spooner pointed out over 150 years ago, the constitution or the social contract, if anything, is only binding to the signatories."}, {"time": 1778, "text": "And even then they're all long dead."}, {"time": 1781, "text": "So it's this fallacy that somehow, because I'm in a physical place, I've agreed, even though I'm screaming through your face that I don't agree, to be subordinate to some imaginary, invisible monster that was created 250 years ago."}, {"time": 1796, "text": "And this idea of like, if you don't like it, you have to move."}, {"time": 1798, "text": "That's not what freedom means."}, {"time": 1799, "text": "Freedom means I do what I want, not what you want."}, {"time": 1802, "text": "So if you don't like it, you move."}, {"time": 1804, "text": "Okay, just to put some, I don't like words and terms."}, {"time": 1808, "text": "One, one, one, zero, one, one, one, zero, one."}, {"time": 1810, "text": "Is that what your language is?"}, {"time": 1811, "text": "It is, I'm translating it all in real time."}, {"time": 1814, "text": "But would you call the kind of ideas that you're advocating for and we're talking about anarchy?"}, {"time": 1821, "text": "Yes, anarchism, yes."}, {"time": 1823, "text": "Okay, so let's get into it."}, {"time": 1824, "text": "Can you try to paint the utopia that an anarchist worldview dreams about?"}, {"time": 1833, "text": "The only people who describe anarchism as utopia are its critics."}, {"time": 1837, "text": "If I told you right now, and I wish I could say this factually, that I have a cure for cancer, that would not make us a utopia."}, {"time": 1845, "text": "That would still probably be expensive."}, {"time": 1847, "text": "We would still have many other diseases."}, {"time": 1849, "text": "However, we would be fundamentally healthier, happier and better off, all of us."}, {"time": 1855, "text": "Than democracy."}, {"time": 1856, "text": "So, sorry, I jumped back from the cancer."}, {"time": 1858, "text": "No, than democracy or government."}, {"time": 1860, "text": "So it's only curing one major, major life threatening problem, but in no sense is it a utopia."}, {"time": 1868, "text": "So what, can we try to answer this question, same question many times, which is what exactly is the problem with democracy?"}, {"time": 1877, "text": "The problem with democracy is that those who need leaders are not qualified to choose them."}, {"time": 1882, "text": "Those who need leaders are not qualified to choose them."}, {"time": 1889, "text": "That's the central problem with democracy."}, {"time": 1890, "text": "Not all of us need leaders."}, {"time": 1893, "text": "So, what does it mean to need a leader?"}, {"time": 1898, "text": "Are you saying like people who are actually like free thinkers don't need leaders kind of thing?"}, {"time": 1905, "text": "That's a good way of working."}, {"time": 1906, "text": "But like, you don't, okay."}, {"time": 1907, "text": "So do you acknowledge that there's some value in authority in different subjects?"}, {"time": 1916, "text": "So what that means is, I don't mean authority, somebody who's in control of you, but."}, {"time": 1920, "text": "But you're doing the definition switch."}, {"time": 1924, "text": "I am, I am."}, {"time": 1925, "text": "You're right, you're right."}, {"time": 1926, "text": "It's unfair."}, {"time": 1927, "text": "Okay, that was bad."}, {"time": 1928, "text": "But that's what they do."}, {"time": 1929, "text": "That's their trick."}, {"time": 1930, "text": "And this is one of the useful things, by the way, that's this total sidebar."}, {"time": 1934, "text": "If people ask me for advice, I always tell them if you're gonna raise your kids, raise them bilingual."}, {"time": 1938, "text": "Because I was trilingual by the time I was six and that teaches you to think in concepts."}, {"time": 1943, "text": "Whereas if you only know one language, you fall for things like this, because using authority in the sense of a policeman and someone has authority in physics, it's the same word."}, {"time": 1951, "text": "Conceptually, they're extremely different."}, {"time": 1953, "text": "But if you're only thinking in one language, your brain is going to equate the two."}, {"time": 1957, "text": "And that's a trap that people who only speak one language have."}, {"time": 1961, "text": "But even if you know multiple languages, you can still use the trick of using the worst of your convenience."}, {"time": 1966, "text": "To manipulate the conversation."}, {"time": 1968, "text": "But you weren't trying to do that, but you fell into that."}, {"time": 1970, "text": "I accidentally did it."}, {"time": 1971, "text": "Yeah, you're right."}, {"time": 1972, "text": "We all tend to do that if you only speak one language and think in one language."}, {"time": 1975, "text": "But if, I guess let me rephrase it."}, {"time": 1977, "text": "Are you against, do you acknowledge the value of offloading your own effort about a particular thing to somebody else?"}, {"time": 1990, "text": "Like an accountant, a lawyer, a doctor, absolute, a chef, infinite."}, {"time": 1995, "text": "Isn't that ultimately what a democracy is?"}, {"time": 1999, "text": "Broadly defined, like you're basically electing a bunch of authorities."}, {"time": 2002, "text": "Using the word you in two senses."}, {"time": 2005, "text": "Using the word you meaning me as an individual, not using you as a mass."}, {"time": 2009, "text": "Yeah, as a mass, not you as an individual."}, {"time": 2011, "text": "Right, so I would absolutely want someone to provide for my security."}, {"time": 2015, "text": "I would absolutely want someone to negotiate with me for foreign power or something like that."}, {"time": 2019, "text": "That does not mean it has to be predicated and what lots of other people who I do not know and if I do know them, probably would not respect, think about."}, {"time": 2028, "text": "It's of no moral relevance to me."}, {"time": 2031, "text": "Nor I to them."}, {"time": 2032, "text": "So do you think this kind of, there could be a bunch of humans that behave kind of like ants in a distributed way."}, {"time": 2041, "text": "There could be an emergent behavior in them that results in a stable society."}, {"time": 2046, "text": "Like isn't that the hope with anarchy is like without an overarching."}, {"time": 2053, "text": "But ants, I mean ants are the worst example here because ants have a very firm authority."}, {"time": 2057, "text": "The queen?"}, {"time": 2058, "text": "Yeah, and they're all drones."}, {"time": 2060, "text": "They're all clones of each other."}, {"time": 2062, "text": "Yeah, but so if you forget the queen, their behavior, they're all, well from your perspective, from your human intelligent perspective, but from their perspective, they probably see each other as a bunch of individuals."}, {"time": 2073, "text": "No they don't."}, {"time": 2074, "text": "Ants are very big on altruism in the sense of self sacrifice."}, {"time": 2080, "text": "They do not think the individual matters."}, {"time": 2082, "text": "They routinely kill themselves for the sake of the hive in the community."}, {"time": 2086, "text": "But they, see that's from the outside perspective, from the individual perspective of the individual, they probably, they don't see it as altruism."}, {"time": 2097, "text": "Right, but they view and they're right because the ants life is very ephemeral and cheap, that it's more important to continue this mass population that one individual ant live."}, {"time": 2108, "text": "Like bees are another even better example."}, {"time": 2110, "text": "The honeybee, when they sting, they only sting once and they die."}, {"time": 2113, "text": "And they do it gladly because it's like, okay, this community is much more important than me and they're right."}, {"time": 2119, "text": "Yeah, okay, so fine, let's forget."}, {"time": 2122, "text": "I'm being pedantic, but it's important, I think."}, {"time": 2124, "text": "I'm not just being pedantic for the sake of being pedantic."}, {"time": 2126, "text": "But there's something beautiful that I won't argue about because I do, there's an interesting point there about individualism of ants."}, {"time": 2133, "text": "I do think they're more individual."}, {"time": 2135, "text": "But let's give your view of ants that they're communists."}, {"time": 2140, "text": "Okay, let's go with the communist view of ants."}, {"time": 2144, "text": "But they're still a beautiful emergent thing, which is like they can function as a society and without, I would say, centralized control."}, {"time": 2157, "text": "Yeah, I agree with you."}, {"time": 2158, "text": "It's another argument."}, {"time": 2159, "text": "So is that the hope for anarchy?"}, {"time": 2161, "text": "It's like you just throw a bunch of people that voluntarily wanna be in the same place under the same set of ideas and they kind of, like the doctors emerge, the police officers emerge, the different necessary structures of a functional society emerge."}, {"time": 2177, "text": "Do you know what the most beautiful example of anarchism is that is just beyond beautiful when you stop to think about it?"}, {"time": 2183, "text": "I'll see Twitter."}, {"time": 2184, "text": "I'm not being tongue in cheek."}, {"time": 2186, "text": "Language."}, {"time": 2188, "text": "There's infinite languages."}, {"time": 2189, "text": "Language, the things that language can be used for are bring tears to people's eyes quite literally."}, {"time": 2196, "text": "It's also used for basic things."}, {"time": 2198, "text": "No one is forcing us."}, {"time": 2200, "text": "We speak two languages each at least."}, {"time": 2202, "text": "No one's forcing us to use English."}, {"time": 2204, "text": "No one's forcing us to use this dialect of English."}, {"time": 2207, "text": "It's a way, and despite there being so many different languages, lingua franca emerge, the language that everyone is, Latin."}, {"time": 2216, "text": "Even in North Korea, they refer to the fish and the different animals by the Latin scientific note."}, {"time": 2222, "text": "No one decided this."}, {"time": 2223, "text": "Sure, there's an organization that sets a binomial nomenclature, but there's no gun to anyone's head referring to a sea moth as a Pegasus species."}, {"time": 2233, "text": "And when you think about how amazing language is, and in some other context would say like, well, you need to have a world government and they're deciding which is the verbs and you have to have an official definition and an official dictionary."}, {"time": 2246, "text": "And none of that's happened."}, {"time": 2248, "text": "And I think anyone, even if they don't agree with my politics or my worldview, cannot deny that the creation of language is one of humanity's most miraculous, beautiful achievements."}, {"time": 2262, "text": "There's one system where a kind of anarchy can result in beauty, stability, like sufficient stability, and yet, flexibility to adjust it and so on."}, {"time": 2275, "text": "And the internet helps it."}, {"time": 2277, "text": "You get something like Urban Dictionary, which starts creating absurd, both humor and wit."}, {"time": 2285, "text": "But also language and syntax and jargon, immediately you size people up."}, {"time": 2289, "text": "If you say vertebral, I know you're a doctor, because that's how they pronounce it, the spinal column."}, {"time": 2295, "text": "I'm sure in your field, there's certain jargon and right away you can know if this person's one of us or not."}, {"time": 2299, "text": "I mean, it's infinite."}, {"time": 2300, "text": "I mean, I don't need to tell you."}, {"time": 2302, "text": "It's emojis too."}, {"time": 2303, "text": "Yes, there's so much there to study with language."}, {"time": 2306, "text": "But do you think this applies to human life?"}, {"time": 2310, "text": "The meat space, the physical space?"}, {"time": 2313, "text": "So that kind of beauty can emerge without writing stuff on paper, without laws."}, {"time": 2320, "text": "You could have rules."}, {"time": 2320, "text": "You don't need, they don't have to be laws."}, {"time": 2324, "text": "Enforced by violence."}, {"time": 2325, "text": "Like that's what, what's a law?"}, {"time": 2328, "text": "A law is something that is unchosen."}, {"time": 2330, "text": "A rule is something."}, {"time": 2331, "text": "If I go to my pool, you know, I sign up to be a member of pool, on the wall there's certain things."}, {"time": 2336, "text": "It's like, you know, certain number of people in the pool."}, {"time": 2339, "text": "No peeing in here."}, {"time": 2340, "text": "Good luck enforcing that one."}, {"time": 2343, "text": "Well, that's the problem."}, {"time": 2344, "text": "Aren't you afraid that people are gonna pee in the pool?"}, {"time": 2346, "text": "That's not as my big concern as mass incarceration, as the fact that the police can steal more money than burglars can."}, {"time": 2354, "text": "The fact that innocent people can be killed with no consequences."}, {"time": 2358, "text": "The fact that war can be waged and with no consequences for those who waged it."}, {"time": 2364, "text": "The fact that so many men and women are being murdered overseas and here, and the people who are guiding these are regarded as heroic."}, {"time": 2371, "text": "So you think there might, that in an anarchist system, there's a possibility of having less wars and less, what would you say, corruption and less abuse of power?"}, {"time": 2384, "text": "Let's talk, yes."}, {"time": 2385, "text": "And let's talk about corruption because, and I made this point on Rogan, you and I, again, the Russian background, we realize that when it comes to corruption, American is very naive."}, {"time": 2396, "text": "Corruption they think is, oh, I got my brother a job and he's getting money on the table."}, {"time": 2401, "text": "That's not, when we're talking about like state corruption, things that are done in totalitarian states and even to some extent in America, like Jeffrey Epstein, Jillian Maxwell, things that Stalin did, things that Hitler did."}, {"time": 2411, "text": "When the CIA was torturing people at Gitmo, they had to borrow KGB manuals because they didn't know how to torture correctly because they never thought of these things."}, {"time": 2420, "text": "It's very hard for us to get into the mindset of someone who's like a child predator, someone who, let me give you an example from my forthcoming book."}, {"time": 2428, "text": "There was a guy who was the head of Ukraine in the 30s, I forget his name."}, {"time": 2433, "text": "Now these old Soviets, they were tough."}, {"time": 2434, "text": "I mean, they pride, Stalin means steel."}, {"time": 2436, "text": "They pride themselves and their cruelty and how strong they were."}, {"time": 2440, "text": "And this was the purge."}, {"time": 2442, "text": "Stalin is trying to, killing lots of people left and right and his henchman, Beria had the quote, find me the man and I'll find you the crime."}, {"time": 2450, "text": "They would accuse someone and they would torture him until he talked and confessed and then he had to turn people in."}, {"time": 2456, "text": "And they took this guy in like beginning of the year, I think it's 36, 38, he was head of Ukraine."}, {"time": 2461, "text": "By May, he's arrested."}, {"time": 2462, "text": "And they take him to the Ljubljanka, the basement in the red square where they're torturing people."}, {"time": 2466, "text": "And they did the works on him."}, {"time": 2468, "text": "And he was a good Soviet and he stood up."}, {"time": 2471, "text": "Who knows what they did to him?"}, {"time": 2472, "text": "He didn't talk."}, {"time": 2473, "text": "So they said, okay, one moment."}, {"time": 2476, "text": "They brought his teenage daughter in, raped her in front of him, he talked."}, {"time": 2480, "text": "So when we talk about corruption, we would never in a million years think of this."}, {"time": 2486, "text": "That's not how our minds work."}, {"time": 2489, "text": "So when you're talking about states and people where you don't have ease of exit, where you are forced to be under the auspices of an organization creating a monopoly, that leads to in extreme cases, but in not as extreme cases, really nefarious outcomes."}, {"time": 2509, "text": "Whereas if you have the option to leave as a client or customer, that would have a strongly limiting effect on how a business and what it can get away with."}, {"time": 2521, "text": "But don't you think maybe, I don't know who the right example is, whether it's Stalin, I think Hitler might be the better example of, don't you think, or Jeffrey Epstein perhaps, don't you think people who are evil will find ways to manipulate human nature to attain power, no matter the system?"}, {"time": 2544, "text": "And like the corollary question is, do you think those people can get more power in a democracy, when there's a government already in place?"}, {"time": 2557, "text": "It's easily they get more power, more dangerous to have a government in place."}, {"time": 2560, "text": "First of all, sociopaths don't know for their charm and for their warmth."}, {"time": 2564, "text": "Here's the two situations."}, {"time": 2567, "text": "In a free society, I'm a sociopath, I'm an evil person, I'm the head of Macy's."}, {"time": 2573, "text": "In a state society, I'm an evil person, I'm a sociopath, I'm the head of the US government."}, {"time": 2577, "text": "Which of these are you more concerned with?"}, {"time": 2579, "text": "It's like night and day."}, {"time": 2580, "text": "So you would have far more decentralized military, you would have far more decentralized security forces, and they would be much more subject to feedback from the market."}, {"time": 2591, "text": "If you have an issue with Macy's or any store with a sweater, look at that transaction."}, {"time": 2598, "text": "If you have an issue with the state, hiring a lawyer costs more than a surgeon."}, {"time": 2602, "text": "To even access the mechanism for dispute is going to be exorbitant and price poor people out of the market for conflict resolution immediately."}, {"time": 2610, "text": "So right away, you have something that's extremely regressive."}, {"time": 2614, "text": "And even though this is touted as some great equalizer, it's quite the opposite."}, {"time": 2618, "text": "So in current society, there's deep suspicion of governments and states."}, {"time": 2624, "text": "Like just your example of Macy's, I mean, don't you think a Hitler could rise to be at the top of a social network like Twitter and Facebook?"}, {"time": 2633, "text": "Okay, let's suppose Hitler ran Twitter, okay?"}, {"time": 2636, "text": "Let's take this thought experiment seriously."}, {"time": 2638, "text": "Literally what could he do?"}, {"time": 2639, "text": "So the only tweets are gonna be about how much the Jews suck, right?"}, {"time": 2644, "text": "Okay, all the cool people are leaving."}, {"time": 2647, "text": "There could be some compelling, like you said, evil people are charming."}, {"time": 2652, "text": "There could be some compelling narratives that could be with conspiracy theories, untruths, that could be spread like propaganda."}, {"time": 2662, "text": "Every criticism of anarchism is in fact a description."}, {"time": 2665, "text": "Well, the strongest criticism of anarchism are in fact descriptions of status quo."}, {"time": 2669, "text": "Your concern is, under anarchism, propaganda would spread and people would be taught the wrong ideas, unlike the status quo?"}, {"time": 2677, "text": "That's not even a criticism of anarchism."}, {"time": 2679, "text": "I'm not actually criticizing."}, {"time": 2681, "text": "It's an open question of, it's an open question of in which system will human nature be able to thrive more and in which system would the evils that arise in human nature would be more easily suppressible?"}, {"time": 2703, "text": "It's a scientific experiment and I'm asking only from my perspective of the fact that we've tried democracy quite a bit recently and maybe you can correct me, we haven't yet seriously tried anarchy on a large scale."}, {"time": 2718, "text": "Well, we don't need to try to, so anarchy isn't like a country, right?"}, {"time": 2721, "text": "It's like saying, well, if anarchy works, how come we've never had an anarchist government, right?"}, {"time": 2727, "text": "So anarchism is a relationship and language is an example of this."}, {"time": 2731, "text": "It's a worldwide anarchic system."}, {"time": 2732, "text": "You and I have an anarchist relationship."}, {"time": 2734, "text": "There's almost no circumstances that we'd be calling the police on each other."}, {"time": 2737, "text": "I mean, I'm asking the same question in a bunch of different directions out of, born out of my curiosity, is why is anarchy going to be better at preventing the darker sides of human nature, which presumably your criticism of government."}, {"time": 2754, "text": "Because of decentralization."}, {"time": 2756, "text": "So the darker side of human nature is an extreme concern."}, {"time": 2760, "text": "Anyone who says it's gonna go away is absurd and fallacious."}, {"time": 2764, "text": "I think that's a nonstarter when people say that everyone's gonna be good."}, {"time": 2767, "text": "Human beings are basically animals."}, {"time": 2768, "text": "We're capable of great beauty and kindness."}, {"time": 2770, "text": "We're capable of just complete cruel and what we would call inhumanity, but we see it on a daily basis even today."}, {"time": 2777, "text": "And what's interesting is the corporate press won't even tell you the darkest aspects because that's too upsetting to people."}, {"time": 2785, "text": "So they'll tell you about atrocities and horrors, but only to a point."}, {"time": 2789, "text": "And then when you actually do the homework, you're like, oh, it's so much worse than, like that thing about Stalin, right?"}, {"time": 2794, "text": "So we know in a broad sense that Stalin was a dictator."}, {"time": 2798, "text": "We know that he killed a lot of people, but it takes work to learn about the Holodomor."}, {"time": 2804, "text": "It takes work to learn about what those literal tortures were and that this is the person who later, FDR and Harry Truman were shaking hands with and taking photos with and was being sold to us as Uncle Joe."}, {"time": 2815, "text": "He's just like you and me."}, {"time": 2817, "text": "So when you have a decentralized information network as opposed to having three media networks, it is a lot easier for information that doesn't fit what would be the corporate America narrative to reach the populations."}, {"time": 2833, "text": "And it would be more effective for democracy because they're in a much better position to be informed."}, {"time": 2838, "text": "Now, you're right."}, {"time": 2840, "text": "It also means, well, if everyone has a mic, that means every crazy person and with their wacky views."}, {"time": 2845, "text": "And at a certain point, yeah, it has to become, then there's another level, which is then the people have to be self enforcing."}, {"time": 2852, "text": "And you see that in social media all the time where someone says this, the other person jumps in."}, {"time": 2857, "text": "You think, but isn't social media a good example of this?"}, {"time": 2860, "text": "So you think ultimately without centralized control, you can have stability?"}, {"time": 2868, "text": "What about the mob outrage and the mob rule, the power of the mobs that emerge?"}, {"time": 2874, "text": "Power of the mob is a very serious concern."}, {"time": 2878, "text": "Gustav Le Bon wrote a book in the 1890s called The Crowd."}, {"time": 2881, "text": "And this was one of the most important books I've written because it influenced both Mussolini and Hitler and Stalin and they all talked about it."}, {"time": 2887, "text": "And he made the point that under crowd psychology, human lynching is another example of this."}, {"time": 2893, "text": "None of those individuals or very few would ever dream of doing these acts."}, {"time": 2899, "text": "But when they're all together and you lose that sense of self, you become the ant and you lose that sense of individually, you're capable of doing things that like in another context, you'd be like, I should kill myself, I'm a monster."}, {"time": 2912, "text": "So you're worried about that, but doesn't the mob have more power under anarchy?"}, {"time": 2917, "text": "No, the mob has much less power in anarchy because under anarchism, every individual is fully empowered."}, {"time": 2923, "text": "You wouldn't have gun restrictions."}, {"time": 2927, "text": "You would have people creating communities based on shared values."}, {"time": 2931, "text": "They'd be much more collegial, they'd be much more kind, as opposed to when you're forcing people to be together in a polity when they don't have things in common."}, {"time": 2941, "text": "That is like having a bad roommate."}, {"time": 2943, "text": "If you're forced to look like jails, if you're forced to be locked in a room with someone, even if you had first liked them, after a while, you're going to start to hate them and that leads to very nefarious consequences."}, {"time": 2956, "text": "So as an anarchist, what do you do in a society like this?"}, {"time": 2961, "text": "Thrive."}, {"time": 2962, "text": "I think I'm doing okay."}, {"time": 2964, "text": "No, I mean, there's an election coming up."}, {"time": 2969, "text": "There's, as you talk, You're Welcome is one of the 15 shows that you host."}, {"time": 2980, "text": "It's down to one."}, {"time": 2984, "text": "Okay, it's down to one."}, {"time": 2986, "text": "But I'm a big fan."}, {"time": 2989, "text": "You talk about libertarianism a little bit."}, {"time": 2992, "text": "I mean, is there some practical political direction in terms of we as a society should go?"}, {"time": 3001, "text": "I don't mean we as a nation."}, {"time": 3003, "text": "I mean, we as a collective of people should go to make a better world from an anarchist point of view."}, {"time": 3009, "text": "Sure, I think politics is the enemy and anything."}, {"time": 3013, "text": "How do you define politics?"}, {"time": 3014, "text": "The state, the government."}, {"time": 3016, "text": "So anything that lessens its sway on people, anything that delegitimizes it is good."}, {"time": 3023, "text": "I wrote an article a few years ago about how wonderful it is that Trump is regarded as such a buffoon because it's very, very useful to have a commander in chief who's regarded as a clown because it's gonna take a lot to get him to convince your kids to go overseas and start killing people and making widows and orphans, as well as those kids coming home in caskets."}, {"time": 3044, "text": "Whereas if someone is regarded with prestige and they're like, oh, we need to send your kid overseas."}, {"time": 3050, "text": "I mean, this guy's great."}, {"time": 3052, "text": "So that is a very healthy thing where people are skeptical of the state."}, {"time": 3057, "text": "But there's a lot of people that regard him as one of the greatest leaders we've ever had."}, {"time": 3064, "text": "Yeah, Dinesh D'Souza, he's another Lincoln."}, {"time": 3068, "text": "When you talk shit about Trump or talk shit about Biden, I'm trying to find a line to walk where they don't immediately put you into this person has Trump derangement syndrome or they have the alternative to that."}, {"time": 3085, "text": "I'm more than happy when people are preemptively dismissing me because then I don't have to waste time engaging with them because those people would be of no use to me."}, {"time": 3093, "text": "When I was on Tim Pool recently, Tim Pool's show, Tim Pool's known for his little hat."}, {"time": 3098, "text": "I got a propeller beanie motorized and it was just spinning the whole two hours."}, {"time": 3102, "text": "I know, like a 1950s thing."}, {"time": 3104, "text": "The point being I wore it because there's lots of people who would say, I can't take seriously someone who wears a hat like that."}, {"time": 3111, "text": "And my point being, if you are the kind of person who takes your cues based on someone's wardrobe as opposed to the content of your ideas, you're of no use to me as an ally."}, {"time": 3121, "text": "So I'd be more than happy you preemptively abort rather than waste our breath trying to engage."}, {"time": 3127, "text": "This is a very, very deep thing that you and I disagree on, which is, this goes to the trolling versus the love, is I believe that person instinctually dismisses you on the very basic surface level."}, {"time": 3141, "text": "But deep down, there's a wealth of a human being that seeks the connection, seeks to understand deeply to connect with other humans that we should speak to."}, {"time": 3156, "text": "Yeah, you and I completely disagree."}, {"time": 3158, "text": "See, you're saying."}, {"time": 3160, "text": "I'm saying there's no mind there literally."}, {"time": 3162, "text": "Okay, so I naturally think the majority of people have the capacity to be thoughtful, intelligent, and learn about ideas, ideas that they instinctually based on their own current inner circle disagree with and learn to understand, to empathize with the other."}, {"time": 3190, "text": "And in the current climate, there's a divisiveness that discourages that."}, {"time": 3195, "text": "And that's where I see the value of love of encouraging people to strip away that surface instinctual response based on the thing they've been taught, based on the things they listen to, to actually think deeply."}, {"time": 3212, "text": "Have you ever had gone to CVS or Duane Reade and your bill, how much you owe them is $6, and you give them a $10 bill in a single and watch the look on their face?"}, {"time": 3224, "text": "You watch them void their bowels and panic because you've given them $11 on a $6 bill."}, {"time": 3229, "text": "This is not a mind capable or interested in thoughts and ideas and learning."}, {"time": 3234, "text": "No, you're talking about the first moment of a first moment where there's an opportunity to think."}, {"time": 3242, "text": "They are desperate to avoid it."}, {"time": 3245, "text": "No, they're just, it's."}, {"time": 3247, "text": "And incapable of it."}, {"time": 3248, "text": "I just, they have the same exact experiences I have every single day when I know it's time for me to go out on a run of five miles or six miles or 10 miles."}, {"time": 3260, "text": "I'm desperate to avoid it, and at the same time, I know I have the capacity to do it, and I'm deeply fulfilled when I do do it, when I do overcome that challenge."}, {"time": 3270, "text": "You are one of the great minds of our generation."}, {"time": 3273, "text": "You are telling me that any of these people can do anything close to the work you do?"}, {"time": 3278, "text": "Not in artificial intelligence, but in the ability to be compassionate towards other people's ideas, like understand them enough to be able."}, {"time": 3290, "text": "Passion requires a certain baseline of intelligence, because you have to perceive other people as being different but of value."}, {"time": 3296, "text": "That's a sophisticated mindset."}, {"time": 3299, "text": "I think most people are capable of it."}, {"time": 3303, "text": "You don't think so?"}, {"time": 3304, "text": "No, and nor are they interested in it."}, {"time": 3306, "text": "But in that kind of, if you don't believe they're capable of it, how can anarchy be stable?"}, {"time": 3315, "text": "If you have a farm, there's one farmer and 50 cows, it's very stable."}, {"time": 3319, "text": "You're just not, you're not asking the cows where to farm things."}, {"time": 3325, "text": "Yeah, but the cows aren't intelligent enough to do damage."}, {"time": 3329, "text": "Cows certainly, bulls, because they could do a lot of damage."}, {"time": 3332, "text": "They could trample things, they could attack you."}, {"time": 3334, "text": "Cows are like, how much do they weigh, like 4,000 pounds?"}, {"time": 3336, "text": "Can you connect the analogy then?"}, {"time": 3338, "text": "Because like."}, {"time": 3339, "text": "Sure, you can't expect that."}, {"time": 3341, "text": "Saying a cow is a cow isn't a slur."}, {"time": 3344, "text": "It's not saying you hate cows."}, {"time": 3346, "text": "Cows, or even, let's say, the example I always use with good reason is dogs, okay?"}, {"time": 3351, "text": "I always say to study how human beings operate, watch Cesar Millan, because human beings and dogs have co evolved."}, {"time": 3357, "text": "Our minds have both evolved in parallel tracks to communicate with each other."}, {"time": 3360, "text": "Dogs are, can be vicious."}, {"time": 3363, "text": "Dogs for the most part are great, wonderful, but you can't expect the dog to understand certain concepts."}, {"time": 3371, "text": "It's not an, and now most people are offended."}, {"time": 3373, "text": "Are you saying I'm like a dog?"}, {"time": 3374, "text": "If you're a dog person like I am, this is actually a huge compliment."}, {"time": 3377, "text": "Most dogs are better than most people, but to get the idea that this is something that is basically your peer is nonsensical."}, {"time": 3386, "text": "Now, of course this sounds arrogant and elitist and so on and so forth, and I'm perfectly happy with that, but it is very hard to persuade me or anyone that if you walk, George Carlin has that joke, think how smart the average person is, then realize 50% of people are dumber than that."}, {"time": 3400, "text": "If you walk around and see who's out there, these people are very kind."}, {"time": 3403, "text": "They are of value."}, {"time": 3405, "text": "They deserve to be treated with respect."}, {"time": 3407, "text": "They deserve to be secure in their person."}, {"time": 3409, "text": "They deserve to feel safe and to have love, but the expectation that they should have any sort of semblance of power over me or my life is as nonsensical as asking Lassie to be my accountant."}, {"time": 3423, "text": "So, but that goes to power, that not to the ability, the capacity to be empathetic, compassionate, intelligent."}, {"time": 3432, "text": "What, if I were to try to prove you wrong?"}, {"time": 3437, "text": "What would you be impressed by about society?"}, {"time": 3444, "text": "How would I show it to you?"}, {"time": 3446, "text": "How would you show it to me?"}, {"time": 3447, "text": "Because I think something has to be falsifiable if you're gonna make a claim, right?"}, {"time": 3450, "text": "So what would it?"}, {"time": 3453, "text": "Because we both made claims that aren't a kind of our own like interpretation based on our interaction."}, {"time": 3460, "text": "Like when I opened Twitter, everyone seems to say."}, {"time": 3463, "text": "Why do you only follow one person?"}, {"time": 3464, "text": "Who do you follow?"}, {"time": 3465, "text": "Who's the one person you follow?"}, {"time": 3466, "text": "Stoic Emperor."}, {"time": 3468, "text": "I follow a lot of people."}, {"time": 3469, "text": "I have a script."}, {"time": 3470, "text": "I have a script that I have an entire interface."}, {"time": 3475, "text": "So I think Twitter is really."}, {"time": 3478, "text": "This is real love."}, {"time": 3479, "text": "It's not ironic love."}, {"time": 3480, "text": "I love watching it and I'm sure you do too."}, {"time": 3484, "text": "I love watching a quality mind at work because when someone has a quality mind, they're often not self aware."}, {"time": 3490, "text": "I catch this on myself of how it operates and then when other people see it, they're like, oh my God, this is so beautiful because there's such an innocence to it."}, {"time": 3497, "text": "But like when I opened Twitter, I'm energized."}, {"time": 3501, "text": "There's a lot of love on Twitter."}, {"time": 3503, "text": "People say like."}, {"time": 3504, "text": "I love Twitter."}, {"time": 3505, "text": "You don't think I have a lot of love on Twitter?"}, {"time": 3507, "text": "My fans pay my rent."}, {"time": 3509, "text": "I mean, I don't know your experience of Twitter, but when I look at your, which is a fundamentally different thing."}, {"time": 3515, "text": "I'm saying my experience from the."}, {"time": 3517, "text": "So maybe you can tell me what your experience is like as a human."}, {"time": 3520, "text": "So when I observe your Twitter, I think, I wouldn't call it love."}, {"time": 3528, "text": "I would call it fun."}, {"time": 3531, "text": "And because of that, that's a different kind of, that like love emerges from that because people kind of learn that we're having, this is like game night, like."}, {"time": 3543, "text": "You know, we can talk shit a little bit."}, {"time": 3546, "text": "We can, and you can even like pull in, you can make fun of people."}, {"time": 3551, "text": "You can have the crazy uncle come over that is a huge Trump supporter, somebody who hates Trump and you can have a little fun."}, {"time": 3559, "text": "I get it."}, {"time": 3560, "text": "It's a different kind of thing."}, {"time": 3561, "text": "I wouldn't be able to be the, you're the host of game night."}, {"time": 3567, "text": "So I wouldn't be able to host that kind of game night."}, {"time": 3570, "text": "I imagine you programming your robots and you're asking what is fun and it just starts sparking."}, {"time": 3578, "text": "What is fun?"}, {"time": 3578, "text": "So the robots in my life that survive are the ones that don't, that like survive that whole programming process."}, {"time": 3589, "text": "So they're kind of like, they're kind of like the idiot from Dostoevsky, they're very like simple minded robots."}, {"time": 3596, "text": "Fun is moving a can from one table to another."}, {"time": 3600, "text": "That's game night for our kin."}, {"time": 3603, "text": "You know, one of my quotes is, and I think about this every day and I mean it with every fiber of my being, we're born knowing that life is a magical adventure and it takes them years to train us to think otherwise."}, {"time": 3614, "text": "And I think that Willy Wonka approach, it's a very Camus approach."}, {"time": 3617, "text": "It's something I believe with every fiber of my being."}, {"time": 3620, "text": "I try to spread that as much as possible."}, {"time": 3622, "text": "I think it is very sad."}, {"time": 3624, "text": "I'm not being sarcastic."}, {"time": 3625, "text": "It comes off as condescending."}, {"time": 3627, "text": "I mean it at face value."}, {"time": 3629, "text": "It's very sad how many people are not receptive to that."}, {"time": 3631, "text": "And I think a lot of those functions, how they were raised."}, {"time": 3634, "text": "And I could have very easily with my upbringing have not maintained that perspective."}, {"time": 3640, "text": "And there's a lot of, I have a lot of friends in recovery like AA and they have an expression, not my circus, not my monkeys, right?"}, {"time": 3649, "text": "That you can't really take on other people's problems on your own at a certain point, they have to do the work themselves because you can only do so much externally."}, {"time": 3656, "text": "And there are a lot of very damaged people out there."}, {"time": 3660, "text": "And they're damaged people who revel in being damaged."}, {"time": 3664, "text": "And they are damaged people who desperately, desperately, desperately wanna be well, who desperately wanna be happy, who desperately wanna find joy."}, {"time": 3672, "text": "So if I can be the one and as arrogant as this sounds, I'll own it, who does give them that fun and to tell them it doesn't have to be like you thought."}, {"time": 3681, "text": "Like it could be, it's gonna hurt, it's gonna suck, but it's still a magical adventure and you're gonna be okay, cause you've been through worse."}, {"time": 3688, "text": "Like that, if that could be my message, I would own it all day long."}, {"time": 3693, "text": "And so what does adventure look like for you?"}, {"time": 3695, "text": "Cause I mean, it actually boils down to, I still disagree with you."}, {"time": 3698, "text": "I think trolling can be and very often is destructive for society."}, {"time": 3705, "text": "Yes, I want to destroy society."}, {"time": 3706, "text": "That is the goal."}, {"time": 3708, "text": "I want to help many people."}, {"time": 3710, "text": "Unironically, okay."}, {"time": 3711, "text": "Unironically, yes."}, {"time": 3714, "text": "What do I do with that?"}, {"time": 3717, "text": "Do what thou wilt is the hall of the law."}, {"time": 3720, "text": "Like I just wanna, so you're hosting game night and I just wanna play Monopoly."}, {"time": 3724, "text": "I wanna play, what's it, Risk."}, {"time": 3727, "text": "Okay, I wanna play these games."}, {"time": 3728, "text": "And you're saying."}, {"time": 3728, "text": "Those are aggressive games."}, {"time": 3730, "text": "Yeah, I was trying to think like of a friendlier game, but they're all kind of aggressive."}, {"time": 3735, "text": "Battleship."}, {"time": 3736, "text": "Axis and allies, you know, fun stuff."}, {"time": 3740, "text": "But like, so that's an adventure, but you're saying that we want to destroy everything."}, {"time": 3747, "text": "Even like the rules of those games are not."}, {"time": 3751, "text": "You voluntarily agree to those rules."}, {"time": 3753, "text": "The point is if someone comes in who no one invited to game night and are telling you, no, when you play Monopoly, you have to get money when you land in free parking or you don't, it's like, who are you?"}, {"time": 3765, "text": "We're having our own fun and you smell."}, {"time": 3769, "text": "I don't know, but there's an aggressive."}, {"time": 3772, "text": "There's an aggression."}, {"time": 3773, "text": "Let me speak to that, which I think you're picking up on."}, {"time": 3776, "text": "I had a friend named Martha, Marcia, excuse me."}, {"time": 3778, "text": "She ran something called cuddle parties, which people laughed at about a lot back in the day."}, {"time": 3782, "text": "And the premise of the cuddle parties, everyone got together and cuddled, right?"}, {"time": 3784, "text": "And it's like, ah, ha, ha."}, {"time": 3785, "text": "Then you stop to think about it and you realize physical contact is extremely important."}, {"time": 3789, "text": "And a lot of people don't have it."}, {"time": 3791, "text": "And if this is a mechanism of people getting that, it actually is going to have profound positive psychological consequences."}, {"time": 3795, "text": "So after she explained it, I'm like, okay, we laughed at this because it's weird."}, {"time": 3798, "text": "And now that I think about it, this is wonderful."}, {"time": 3800, "text": "And I asked her about like the tough question, I go, what if guys get turned on?"}, {"time": 3805, "text": "And on their website, it even has a rule, like do not fear the erection, right?"}, {"time": 3808, "text": "Because it's going to be a natural consequence of physical proximity."}, {"time": 3811, "text": "And the point she goes, she said this, I think about this all the time."}, {"time": 3814, "text": "People will take as much space as you let them."}, {"time": 3818, "text": "It is incumbent on each of us to set our own boundaries."}, {"time": 3822, "text": "We all have to learn when to say, no, you're making me uncomfortable."}, {"time": 3826, "text": "If someone doesn't respect your right to have your boundary to be uncomfortable, this person is not your friend."}, {"time": 3831, "text": "Now they can say, I don't understand."}, {"time": 3834, "text": "Like, why is this okay?"}, {"time": 3835, "text": "Why is that not?"}, {"time": 3836, "text": "Let me know you better so I'm respectful of you."}, {"time": 3839, "text": "But if they roll their eyes and they're like, get over, I'm going to do what I want, this person is not interested in knowing you as a human being."}, {"time": 3848, "text": "And that is the aggression."}, {"time": 3848, "text": "You have to draw those lines."}, {"time": 3850, "text": "I mean, but that's a very positive way of phrasing that aggression."}, {"time": 3854, "text": "I'm a very positive person."}, {"time": 3857, "text": "But the trolling, there's a destructive thing to it."}, {"time": 3860, "text": "That hurts others."}, {"time": 3863, "text": "But it's not bad people."}, {"time": 3865, "text": "I only troll as a reaction or towards those in power."}, {"time": 3869, "text": "So maybe let's talk about trolling a little bit."}, {"time": 3871, "text": "Because trolling, when it can, maybe you can correct me, but I've seen it become a game for people that's enjoyable in itself."}, {"time": 3884, "text": "That's not a good thing."}, {"time": 3885, "text": "If you are there just to hurt innocent people, you are a horrible human being."}, {"time": 3890, "text": "But doesn't trolling too easily become that?"}, {"time": 3895, "text": "I don't know about easily."}, {"time": 3895, "text": "Let me give you an example of where trolling came from."}, {"time": 3898, "text": "The original troll was Andy Kaufman."}, {"time": 3901, "text": "He was on the show Taxi."}, {"time": 3902, "text": "He was a performance artist, not a stand up comedian."}, {"time": 3905, "text": "And this is a quintessential example of trolling."}, {"time": 3908, "text": "He had a character where he was basically like a lounge singer."}, {"time": 3911, "text": "He had these glasses on and just a terrible singer and so on and so forth."}, {"time": 3915, "text": "And he denied it was him."}, {"time": 3918, "text": "And he came out and I'm blanking on the guy's name."}, {"time": 3921, "text": "I can't believe it."}, {"time": 3922, "text": "Tony Clifton."}, {"time": 3924, "text": "He came out in the audience and he goes, you know, my wife died a few years ago."}, {"time": 3928, "text": "Every time I look at my daughter Sarah's eyes, I can see my wife."}, {"time": 3930, "text": "Sarah, come out here."}, {"time": 3931, "text": "Let's do a duet."}, {"time": 3932, "text": "And Sarah was like 11, sits on his lap."}, {"time": 3935, "text": "They start singing duet."}, {"time": 3936, "text": "Her voice cracks."}, {"time": 3937, "text": "He smacks her across the face."}, {"time": 3938, "text": "What the hell are you doing?"}, {"time": 3939, "text": "You're making an ass out of me in front of these people."}, {"time": 3942, "text": "She starts crying."}, {"time": 3943, "text": "The audience is booing and he goes, don't boo her, you're just gonna make her cry more."}, {"time": 3947, "text": "Now it ends."}, {"time": 3950, "text": "This wasn't his daughter."}, {"time": 3951, "text": "It wasn't even a child."}, {"time": 3952, "text": "It was an actress."}, {"time": 3952, "text": "This was all set up."}, {"time": 3953, "text": "He's exploiting their love of children in order to force them to be performers."}, {"time": 3959, "text": "That is trolling."}, {"time": 3961, "text": "No one is actually getting hurt."}, {"time": 3962, "text": "It's a humorous, though twisted exchange."}, {"time": 3965, "text": "If you go online looking for weak people and you are there to denigrate them just for them being weak or in some way inferior to you, that is the wrong approach."}, {"time": 3978, "text": "I am best on the counter punch."}, {"time": 3981, "text": "A lot of times people come to me and they'll be like, I hope you die."}, {"time": 3984, "text": "You're ugly."}, {"time": 3986, "text": "And there's this great quote from Billy Idol, which I'm gonna mango here, something effective."}, {"time": 3990, "text": "I love it when people are rude to me, then I can stop pretending to be nice."}, {"time": 3993, "text": "Then you start fights."}, {"time": 3995, "text": "Now it's a chance for me to finish it and make an example of this person."}, {"time": 3998, "text": "But that's very, very different from I'm gonna go around and humiliate people for the sake of doing it, in my view."}, {"time": 4006, "text": "And I can see how one would lead to the other."}, {"time": 4008, "text": "Yeah, but that's my fundamental concern with it."}, {"time": 4010, "text": "So my dream is to put, use technology, create platforms that increase the amount of love in the world."}, {"time": 4020, "text": "And to me, trolling is doing the opposite."}, {"time": 4025, "text": "So like Andy Kaufman is brilliant."}, {"time": 4029, "text": "So I love, obviously, it sounds like I'm a robot thing."}, {"time": 4032, "text": "I love humor, okay?"}, {"time": 4035, "text": "Humor is good."}, {"time": 4038, "text": "One, one, one, zero, one, one, one, one."}, {"time": 4041, "text": "But like, it's, I just see like 4chan."}, {"time": 4045, "text": "I see that you can often see that humor quickly turn."}, {"time": 4049, "text": "Yeah, because what happens is a lot of low status people, this is their one mechanism through sadism to feel empowered, and then they can hide behind, well, I'm just joking."}, {"time": 4060, "text": "Yeah, like there's this dark thing."}, {"time": 4061, "text": "Yeah, that's not acceptable."}, {"time": 4062, "text": "That's something you can't have."}, {"time": 4063, "text": "There's a dark LOL that people do, which is like they'll say like the shittiest thing."}, {"time": 4069, "text": "Right, because they feel."}, {"time": 4069, "text": "And then do LOL after."}, {"time": 4071, "text": "Like, as if, I don't even know like what is happening in that dark mind of yours."}, {"time": 4076, "text": "Because they are feeling powerless in their lives, and they see someone who they perceive as higher status or more powerful than them, or even not appear, and they, through their words, cause a reaction in this person."}, {"time": 4089, "text": "So they feel like they are, in a very literal sense, making a difference on earth, and they matter in a very dark way."}, {"time": 4095, "text": "It's disturbing."}, {"time": 4096, "text": "This is not, I mean, it's unfortunate that that term trolling is used for that, as opposed to what Andy Kaufman does, as opposed to what I do."}, {"time": 4104, "text": "It really is a sinister thing, and it's something I'm not at all a fan of."}, {"time": 4111, "text": "How do we fight that?"}, {"time": 4113, "text": "So, like a neighboring concept of that is conspiracy theories, which is."}, {"time": 4119, "text": "I don't think they're neighboring at all."}, {"time": 4121, "text": "Well, let me give a sort of naive perspective."}, {"time": 4125, "text": "Maybe you can educate me on this."}, {"time": 4126, "text": "From my perspective, conspiracy theories are these constructs of ideas that go deeper and deeper and deeper into creating worlds where there's powerful pedophiles controlling things, like these very sophisticated models of the world that in part might be true, but in large part, I would say, are figments of imagination that become really useful constructs."}, {"time": 4162, "text": "Self reinforcing."}, {"time": 4163, "text": "Self reinforcing for then feeding, like empowering the trolls to attack the powerful, the conventionally powerful."}, {"time": 4174, "text": "I don't think that's a function of conspiracy theories."}, {"time": 4177, "text": "Now, let's talk about conspiracy theories, because one of my quotes is, \"'You take one red pill, not the whole bottle.'\""}, {"time": 4181, "text": "This concept that everything in life is at the function of a small cadre of individuals would be, for many people, reassuring, because as bad as it looks, you know they, whoever they are, it's usually the Jews, aren't gonna let it get that bad, that they will pull back."}, {"time": 4200, "text": "Or the black pill is that they aren't intentionally trying to destroy everything, and there's nothing we can do and we're doomed."}, {"time": 4208, "text": "And there's an amazing book by Arthur Herman called The Idea of Declined Western History."}, {"time": 4212, "text": "It's one of my top 10 books where he goes through every 20 years how there's a different population that say, \"'It's the end of the world, here's the proof.'\""}, {"time": 4220, "text": "And very often, the proof is something that is kind of self fulfilling, where it's not falsifiable."}, {"time": 4226, "text": "And we both have to think of ways to falsify our claims from earlier."}, {"time": 4229, "text": "So it is a big danger."}, {"time": 4232, "text": "It's a big danger online, because very quickly, if someone who you thought was good, but now is bad on one aspect, well, they're controlled opposition, or they've been taken over, or they've been kind of appropriated by the bad people, whoever those bad people would be."}, {"time": 4249, "text": "I don't know that I have a good answer for this."}, {"time": 4252, "text": "I don't think it's as pervasive as people think."}, {"time": 4256, "text": "The number of people who believe conspiracy theory?"}, {"time": 4257, "text": "Right, I mean, and also conspiracy theory is a term used to dismiss ideas that have some currency."}, {"time": 4264, "text": "The Constitutional Convention was a conspiracy."}, {"time": 4266, "text": "The Founding Fathers got together secretly on this war to secrecy in Philadelphia, said, we're throwing out the Articles of Confederation, we're making a new government, right, yeah, yeah, yeah."}, {"time": 4272, "text": "And Luther Martin left, and he told everyone, this is a conspiracy, and they're like, yeah, whatever, Luther Martin."}, {"time": 4277, "text": "So, and Jeffrey Epstein was a conspiracy, Harvey Weinstein was a conspiracy, Bill Cosby was a conspiracy."}, {"time": 4282, "text": "They all knew, they didn't care."}, {"time": 4284, "text": "Communist infiltration in America, there's a great book by Eugene Lyons called The Red Decade."}, {"time": 4290, "text": "They all knew every atrocity that was done under Stalinism was excused in the West, and if you didn't believe it, oh, you've got this crazy anti Russia conspiracy."}, {"time": 4300, "text": "So it's a term that is weaponized in a negative sense, but that does not at all imply that it does not have very negative real life consequences because it's kind of a cult of one, right?"}, {"time": 4312, "text": "Like I'm at home with my computer, I bang into this ideology, anyone who doesn't agree with me, they are blind, they're oblivious, mom and dad, my friends, you don't get it."}, {"time": 4322, "text": "We were warned about people like you, and I think there's a very heavy correlation, and I'm not a psychiatrist, of course, between that and certain types of mild mental illness, like some kind of paranoid schizophrenia and things like that, because after a certain point, if everything is a function of this conspiracy, there's no randomness or beauty in life."}, {"time": 4342, "text": "Yeah, I mean, I don't know if you can say anything interesting about it in the way of advice of how to take a step into conspiracy theory world without completely going, like diving deep, because it seems like that's what happens."}, {"time": 4359, "text": "People can't look at Jeffrey Epstein."}, {"time": 4362, "text": "I can tell you what the advice I'd have is, seriously and rigorously, without going, because you can look at Jeffrey Epstein and say there's a deeper thing."}, {"time": 4372, "text": "You can always go deeper."}, {"time": 4373, "text": "It's like Jeffrey Epstein was just a tool of the lizard people, and the lizard people are the tool."}, {"time": 4379, "text": "Well, they say Satanists, in this case."}, {"time": 4384, "text": "Somehow, recently, very popular, spedophiles somehow always involved."}, {"time": 4388, "text": "I'm not understanding any of that."}, {"time": 4391, "text": "Legitimately, I say this both humorously and seriously."}, {"time": 4395, "text": "I need to look into it, and I guess the bigger question I'm asking, how does a serious human being, somebody with a position at a respectable university, look at a conspiracy theory and look into it?"}, {"time": 4408, "text": "When I look at somebody like Jeffrey Epstein, who had a role at MIT, and I think I'm not happy, personally, I wasn't there when Jeffrey Epstein was there."}, {"time": 4422, "text": "I'm not happy with the behavior of people now about Jeffrey Epstein, about the bureaucracy and the everybody's trying to keep quiet, hoping it blows over, without really looking into any, looking in a deep philosophical way of how do we let this human being be among us?"}, {"time": 4443, "text": "Can I give you a better example that is conspiratorial?"}, {"time": 4448, "text": "The Speaker of the House, the longest serving Republican Speaker of the House, Dennis Hastert, was a pedophile."}, {"time": 4452, "text": "He went to jail."}, {"time": 4454, "text": "The Democrats don't throw this in the Republicans faces every five minutes."}, {"time": 4458, "text": "Not even Democratic activists."}, {"time": 4459, "text": "I find that very, very odd, and not what I would predict."}, {"time": 4463, "text": "Now, I'm not saying there's some kind of conspiracy, but when it comes to things like sexual predation, which is something that I'm very, very concerned about."}, {"time": 4471, "text": "I have an uncle now."}, {"time": 4472, "text": "My sister just had her second kid recently."}, {"time": 4473, "text": "He's adorable."}, {"time": 4476, "text": "It's something that I don't understand."}, {"time": 4480, "text": "It feels as if there's a lot of people who want this to all go away."}, {"time": 4508, "text": "So I don't know that I have any particular insight on this."}, {"time": 4511, "text": "But see, how do you, the Catholic Church, again, there's all these topics that."}, {"time": 4517, "text": "Public school teachers are far more proportionately peders of children than the Catholic Church."}, {"time": 4521, "text": "Man, I don't know what, you're right, you're right."}, {"time": 4524, "text": "Perhaps I've been reading a lot about Stalin and Hitler, somehow it's more comforting to be able to."}, {"time": 4532, "text": "Yeah, because it's there, and then."}, {"time": 4534, "text": "And then, and then the atrocities that are happening now, it's a little bit more difficult because."}, {"time": 4539, "text": "There was a New York Times article, sorry to interrupt you, where they had people tracking down child pornography."}, {"time": 4545, "text": "And I think the article said they didn't have enough people just to cover the videotapes of infants being raped."}, {"time": 4551, "text": "And we can even wrap our heads around reading Lolita, like, okay, she's 14, 12, okay, it's still a female."}, {"time": 4557, "text": "An infant, it's something that, again, like with the Stalin example, we sat down here for a hundred years, we would never think of something like this, think of it in a sexual context, it makes no sense."}, {"time": 4566, "text": "So, and the fact that this is international, okay, we eliminated completely in America."}, {"time": 4571, "text": "Well, then they're gonna go find, there's infants all over the world, there's video cameras all over the world."}, {"time": 4575, "text": "So then it has to become a conspiracy because someone has to film it, I'm filming it, you're buying it, your kid."}, {"time": 4583, "text": "It is literally a conspiratorial, not in the sense of like a mafia conspiracy or some government illuminati, but there is our networks designed to produce this product."}, {"time": 4593, "text": "See, but like what I'm trying to do now, and part of the, one of the nice things with like a podcast and other things I'm involved with is removing myself from having any kind of boss so I can do whatever that helps."}, {"time": 4608, "text": "Oh, it's so wonderful, that just happened to me, it's the most wonderful thing ever."}, {"time": 4612, "text": "So I could do, I can actually, in moderation, consider like look into stuff."}, {"time": 4617, "text": "Careful though, I was gonna write a book about this that people pointed out, you sure wanna do this research?"}, {"time": 4622, "text": "Because if you start Googling around for this kind of stuff, it's on your computer."}, {"time": 4626, "text": "Oh, in that sense, I'm more concerned about, you know, it's the Nietzsche thing, looking into the abyss, like you wanna be very, I believe I can do this kind of thing in moderation without slipping into the depths."}, {"time": 4639, "text": "I think that's intelligence, that's like, I recently quote unquote looked into like the UFO community, the extraterrestrial, whatever community."}, {"time": 4652, "text": "I think it always frustrated me that the scientific community like rolled their eyes at all the UFO sightings, all that kind of stuff."}, {"time": 4660, "text": "Even though there could be fascinating, beautiful, physical fun, like, first of all, there could legit."}, {"time": 4664, "text": "Like ball lightning."}, {"time": 4666, "text": "The ball lightning, right, that's at the very basic level is a fascinating thing."}, {"time": 4671, "text": "And also, it could be something like, I mean, I don't know, but it could be something interesting, like worth looking into."}, {"time": 4682, "text": "My grandfather was an air traffic controller back in the Soviet Union."}, {"time": 4685, "text": "And he said, we saw this stuff all the time."}, {"time": 4688, "text": "These are planes that were not moving or whatever things that were not moving according to anything we knew about."}, {"time": 4693, "text": "So it's absolutely real."}, {"time": 4694, "text": "He's not some jerk with an iPhone in his backyard."}, {"time": 4698, "text": "This is a military professional who understood technology, who knew where the secret bases were."}, {"time": 4704, "text": "So if he's telling me, it doesn't mean it's Martians, but he's telling me there's something there."}, {"time": 4709, "text": "And there are many examples of these like military people."}, {"time": 4711, "text": "These aren't some layman who sees a store."}, {"time": 4713, "text": "Yeah, these are legit people."}, {"time": 4714, "text": "Yeah, and so you can dismiss, when you're talking about professionals who are around aircraft all the time, who are familiar with aircraft at the highest levels, and they're seeing things that they can't explain, they're clearly not stupid and they're clearly not under form."}, {"time": 4727, "text": "So there's different ways to dismiss it."}, {"time": 4729, "text": "For example, you were saying that trolling is a good mechanism."}, {"time": 4735, "text": "I'm against that, but I'm not dismissing it by like rolling my eyes."}, {"time": 4740, "text": "I'm considering legitimately that you're way smarter than me and you understand the world better than me."}, {"time": 4745, "text": "Like I'm allowing myself to consider that possibility and thinking about it."}, {"time": 4749, "text": "Like maybe that's true, like seriously considering it."}, {"time": 4752, "text": "That's what I feel the way people should approach intelligent people, serious quote unquote people, scientists should approach conspiracy theories."}, {"time": 4762, "text": "Like look at it carefully."}, {"time": 4766, "text": "First of all, is it possible that the earth is flat?"}, {"time": 4769, "text": "It's not trivial to show that the earth is not flat."}, {"time": 4772, "text": "It's a very good exercise."}, {"time": 4773, "text": "You should go through it."}, {"time": 4775, "text": "But once you go through it, you realize that based on a lot of data and a lot of evidence, and there's a lot of different experiments you can do yourself actually to show that the earth is not flat."}, {"time": 4788, "text": "The same kind of process can be taken for a lot of different conspiracy theories and it's helpful."}, {"time": 4794, "text": "And without slipping into the depths of lizard people running everything."}, {"time": 4800, "text": "That's where I've now listened to two episodes of Alex Jones's show because he goes crazy deep into different kind of worldviews that I was not familiar with."}, {"time": 4819, "text": "And I don't know what to make of it."}, {"time": 4820, "text": "I mean, the reason I've been listening to it is because there's been a lot of discussions about platforming of different people."}, {"time": 4828, "text": "And I've been thinking about what does censorship mean?"}, {"time": 4830, "text": "I've been thinking about whether, because Joe Rogan said he's gonna have Alex on again."}, {"time": 4839, "text": "And then I enjoyed it as a fan, just the entertainment of it."}, {"time": 4845, "text": "But then I actually listened to Alex and I was thinking, is this human being dangerous for the world?"}, {"time": 4853, "text": "Like is the ideas he's saying dangerous for the world?"}, {"time": 4855, "text": "I'm more concerned with the Russian conspiracy that we had for three years."}, {"time": 4859, "text": "The claim that our election was not legitimate and that everyone in the Trump White House is a stooge of Putin."}, {"time": 4864, "text": "And the people who said this had no consequences for this."}, {"time": 4867, "text": "Alex Jones doesn't have the respect that they do."}, {"time": 4870, "text": "These are both areas of concern for me."}, {"time": 4872, "text": "But he might if he's given more platform."}, {"time": 4875, "text": "So like the people who've, and I'd be curious to, I'm also a little bit, I don't know what to think about the idea that Russians hacked the election."}, {"time": 4887, "text": "That it seems too easily accepted in the mainstream media."}, {"time": 4890, "text": "Hillary Clinton said that how they did it was they had ads on the dark web."}, {"time": 4897, "text": "Now you and I both know what the dark web is."}, {"time": 4900, "text": "So the possibility of ads on the dark web having a proportional influence on the election is literally zero."}, {"time": 4908, "text": "Perhaps I should look into it more carefully, but I've found very little good data on exactly what did the Russians do to hack elections."}, {"time": 4918, "text": "Like technically speaking, what are we talking about here?"}, {"time": 4921, "text": "Like as opposed to these kind of weird, like the best thing there's a couple of books and like reporting on like farms."}, {"time": 4929, "text": "Like it's."}, {"time": 4930, "text": "Troll farms, yeah."}, {"time": 4931, "text": "Troll farms."}, {"time": 4932, "text": "But let's see the data."}, {"time": 4934, "text": "Like how many exactly?"}, {"time": 4937, "text": "Like what were they doing?"}, {"time": 4939, "text": "Not just like some anecdotal discussions of, but like relative to the bigger, the size of Facebook."}, {"time": 4948, "text": "Like if there's a few people, several hundreds, say posting different political things on Facebook relative to the full size of Facebook."}, {"time": 4959, "text": "Let's look at the full size."}, {"time": 4961, "text": "Right, you're thinking like a scientist."}, {"time": 4962, "text": "The actual impact."}, {"time": 4964, "text": "Like, cause it's fascinating the social dynamics of viral information of videos."}, {"time": 4970, "text": "When Donald Trump retweets something, I think that's understudied the effect of that."}, {"time": 4976, "text": "Like he retweeted a clip with Joe Rogan and Mike Tyson, where Mike Tyson says that he finds fighting orgasmic."}, {"time": 4988, "text": "I don't understand that, but they'd be fascinating to think like what is the ripple effect on the social dynamic of our society from retweeting a clip about Mike Tyson."}, {"time": 4999, "text": "What's your favorite Trump tweet?"}, {"time": 5002, "text": "I tuned them out a long time ago, unfortunately."}, {"time": 5006, "text": "I have, this goes to the, you and I have a different relationship with Donald Trump."}, {"time": 5015, "text": "You appreciate the art form of trolling."}, {"time": 5017, "text": "Sexual versus nonsexual."}, {"time": 5018, "text": "Nonsexual, yeah."}, {"time": 5019, "text": "So I tend to prefer Bill Clinton."}, {"time": 5024, "text": "He's more my type."}, {"time": 5027, "text": "You don't like that consent stuff."}, {"time": 5028, "text": "No, the consent, no."}, {"time": 5030, "text": "No, you appreciate the art form of trolling and Donald Trump is a master."}, {"time": 5037, "text": "He's the da Vinci of trolling."}, {"time": 5040, "text": "So I tend to think that trolling is ultimately destructive for society and then Donald Trump takes nothing seriously."}, {"time": 5047, "text": "He's playing a game."}, {"time": 5049, "text": "He's making a game out of everything."}, {"time": 5050, "text": "He takes a lot of things seriously."}, {"time": 5051, "text": "I think he's very committed to international peace."}, {"time": 5054, "text": "Sorry, I shouldn't speak so strong."}, {"time": 5056, "text": "I think he takes, actually, yes, a lot of things seriously."}, {"time": 5060, "text": "I meant on Twitter and the game of politics."}, {"time": 5066, "text": "He is, he only takes."}, {"time": 5069, "text": "Irreverently."}, {"time": 5072, "text": "And I appreciate it."}, {"time": 5075, "text": "I just would like to focus on genuine, real expressions of humanity, especially positive."}, {"time": 5084, "text": "Well, this is one."}, {"time": 5085, "text": "This is my favorite tweet."}, {"time": 5086, "text": "My fans got it lasered, etched, and put in a block of Lucite for me."}, {"time": 5090, "text": "And he said, every time I speak of the losers and haters, I do so with great affection."}, {"time": 5096, "text": "They cannot help the fact that they were born fucked up."}, {"time": 5099, "text": "That's an actual Trump tweet."}, {"time": 5100, "text": "It's my favorite one."}, {"time": 5103, "text": "And that's kind of nice."}, {"time": 5104, "text": "And that's love."}, {"time": 5106, "text": "That's kind of nice."}, {"time": 5107, "text": "Great affection."}, {"time": 5108, "text": "That, I mean."}, {"time": 5111, "text": "Exclamation point."}, {"time": 5112, "text": "I broke Lex."}, {"time": 5119, "text": "What is love?"}, {"time": 5121, "text": "Yeah, the sparks are flying."}, {"time": 5122, "text": "But I have to kind of analyze that from a literary perspective, but it seems like there's love in there."}, {"time": 5129, "text": "Like a little bit."}, {"time": 5131, "text": "It's a little bit lighthearted."}, {"time": 5132, "text": "Cause he's saying, even when I'm going after them, don't take it so seriously."}, {"time": 5137, "text": "It is nice."}, {"time": 5138, "text": "That's acknowledging the game of it."}, {"time": 5141, "text": "He's not always."}, {"time": 5143, "text": "There's some things he's very, very vicious."}, {"time": 5145, "text": "Very vicious."}, {"time": 5146, "text": "He's done things that I can tell you about that I'm like, this is a bad person."}, {"time": 5151, "text": "What do you think about one of the, okay, listen, I'm not, for people listening, I do not have Trump derangement syndrome."}, {"time": 5159, "text": "I don't, I see, I try to look for the good and the bad in everybody."}, {"time": 5165, "text": "One thing, perhaps it's irrational, but perhaps because I've been reading history, I, the one triggering thing for me is the delaying of elections."}, {"time": 5178, "text": "I believe in elections."}, {"time": 5180, "text": "And this is the part that you probably disagree with, but I, you know, I believe in the value of people voting."}, {"time": 5189, "text": "And I just seen too many dictators, the place where they finally, the big switch happens when you question the legitimacy of elections."}, {"time": 5199, "text": "Who's been questioning the legitimacy of elections for the last three years?"}, {"time": 5203, "text": "I've only heard Donald Trump do it last year, but the last three years you're saying somebody else?"}, {"time": 5208, "text": "You don't think, not my president, illegitimate, we're not gonna normalize him as president, Russia hacked this election, impeached, you're not a real president."}, {"time": 5216, "text": "You don't think that's questioning the legitimacy of 2016?"}, {"time": 5219, "text": "Nah, it's a good, I haven't been paying attention enough, but I would imagine that argument has been, that I haven't actually heard too many people, but I imagine that's been a popular thing to say."}, {"time": 5232, "text": "Okay, I, but nevertheless, that's a part, that didn't, that's not a statement that gained power enough to say that Barack Obama will keep being president or Hillary Clinton should be president."}, {"time": 5250, "text": "Newsweek had that article, how Hillary Clinton could still be president, Newsweek."}, {"time": 5254, "text": "No, but she's not."}, {"time": 5255, "text": "That's what I'm saying."}, {"time": 5256, "text": "My worry isn't, my worry isn't saying that the election was illegitimate and people whining at a mass scale and then Fox News or CNN reporting for years or books being written for years."}, {"time": 5271, "text": "My worry is legitimately martial law."}, {"time": 5274, "text": "A person stays president."}, {"time": 5277, "text": "So here's the issue."}, {"time": 5279, "text": "Like there's a phase shift that happens in a dictatorship."}, {"time": 5282, "text": "I did a book on North Korea."}, {"time": 5284, "text": "I'm not someone who thinks dictatorship should be taken lightly."}, {"time": 5287, "text": "I'm not someone who thinks it can't happen here."}, {"time": 5289, "text": "I think a lot of times people are desperate for dictatorship."}, {"time": 5293, "text": "So I am with you."}, {"time": 5294, "text": "And I think this is something, if you're gonna hand wave it away, everyone else hand waved it away."}, {"time": 5298, "text": "Hitler's never gonna be chancellor."}, {"time": 5299, "text": "He's like lunatic."}, {"time": 5300, "text": "Oh, please."}, {"time": 5301, "text": "He's a joke."}, {"time": 5302, "text": "They couldn't find a publisher for Mein Kampf in English because this is some guy from some random minor party in Germany spouting nonsense."}, {"time": 5309, "text": "Who's gonna read this crap?"}, {"time": 5311, "text": "So I completely agree with you in that regard."}, {"time": 5313, "text": "I don't think we're there."}, {"time": 5314, "text": "My point is Donald Trump this year had every pathway open to him to declare martial law."}, {"time": 5322, "text": "The cities are being burned down."}, {"time": 5324, "text": "He could have very easily sent in the tanks and people would have been applauding him from his side."}, {"time": 5329, "text": "You make me feel so good right now."}, {"time": 5330, "text": "But am I wrong though?"}, {"time": 5331, "text": "No, I... What he did, he tweeted out to Mayor Wheeler of Portland."}, {"time": 5336, "text": "He said, call me."}, {"time": 5338, "text": "We will solve this in minutes, but you have to call."}, {"time": 5343, "text": "And he sat in his hands and they said, oh, it's his fault."}, {"time": 5346, "text": "The city is burning down."}, {"time": 5347, "text": "He's not doing anything."}, {"time": 5348, "text": "And he goes, I'm not doing anything until you ask me to do it."}, {"time": 5352, "text": "So I think that is, even if you think he's an aspiring dictator, that is at least a sign that there is some restraint on his aspirations."}, {"time": 5363, "text": "Can I just take that in as a beautiful moment of hope?"}, {"time": 5369, "text": "So I'm gonna remember this moment."}, {"time": 5370, "text": "I'm gonna miss Ted Cruz, beautiful Ted."}, {"time": 5373, "text": "I'm gonna remember that."}, {"time": 5374, "text": "I mean, I should say that perhaps I'm irrationally, this is the one moment where I feel myself being a little unhealthy."}, {"time": 5382, "text": "I don't think you're being irrational."}, {"time": 5384, "text": "I think there's an asymmetry because it's kind of like, okay, either if I leave the house, it's like Russian roulette."}, {"time": 5391, "text": "Yeah, maybe it's like a one in six shot."}, {"time": 5392, "text": "I'm pulling the trigger, I'm killing myself, but that's one in six."}, {"time": 5396, "text": "That's not, and the consequences are so dire that a little paranoia would go a long way."}, {"time": 5401, "text": "There's something that."}, {"time": 5402, "text": "But you can't go back."}, {"time": 5405, "text": "It's an asymmetry, yeah."}, {"time": 5406, "text": "The thing is, the thing that makes Donald Trump new to me, and again, I'm a little naive in these things, but he surprised me in how many ways he just didn't play by the rules."}, {"time": 5425, "text": "And he's made me, a little ant in this ant colony, think like, well, do you have to play by the rules at all?"}, {"time": 5435, "text": "Like, why are we having elections?"}, {"time": 5438, "text": "Why did you say, like, it's coronavirus time?"}, {"time": 5441, "text": "Like, it's not healthy to have elections."}, {"time": 5444, "text": "Like, we shouldn't be, like, I could, if I put my dictator hat on."}, {"time": 5448, "text": "Nancy Pelosi said that Joe Biden shouldn't debate."}, {"time": 5452, "text": "Yeah, did she?"}, {"time": 5454, "text": "She says she shouldn't dignify Trump with a debate."}, {"time": 5456, "text": "He's the president."}, {"time": 5457, "text": "He could be the worst president on earth, evil, despicable monster."}, {"time": 5461, "text": "I'll take that as an argument."}, {"time": 5462, "text": "So she's playing politics, but she's."}, {"time": 5463, "text": "I don't think that's playing politics."}, {"time": 5464, "text": "I think when there's a certain point where things get, when you start attacking institutions for the emergencies of the moment and acting arbitrarily, that is when things are the slippery slope."}, {"time": 5475, "text": "Yeah, so you're saying debates is one of the institutions."}, {"time": 5478, "text": "Like, that's one of the traditions to have the debates."}, {"time": 5481, "text": "I think the debates are extremely important."}, {"time": 5483, "text": "And now I don't think that someone's a good debater is gonna make a good president."}, {"time": 5486, "text": "I mean, that's a big problem."}, {"time": 5487, "text": "But you're just saying this is attacking just yet another tradition, yet another."}, {"time": 5492, "text": "You know, like, how if you're dating, if you're married to someone and someone throws out the word divorce, you can't unring that bell, you threw it out there."}, {"time": 5498, "text": "I'm saying you don't throw things out like that unless you really are ready to go down this road."}, {"time": 5503, "text": "And I think that is, there's nothing in the constitution about debates."}, {"time": 5506, "text": "We've only had them since 1980, but still, I think they are extremely important."}, {"time": 5511, "text": "It's also a great chance for Joe Biden to tell him to his face, you're full of crap, here's what you did, here's what you did, here's what you did."}, {"time": 5517, "text": "So fascinating that you're both, you acknowledge that, and yet you also see the value of tearing down the entire thing."}, {"time": 5526, "text": "So you're both worried about no debates, or at least in your voice, in your tone."}, {"time": 5531, "text": "There's a great quote by Chesterton."}, {"time": 5533, "text": "I'm not a fan of him at all."}, {"time": 5535, "text": "But he says, before you tear down a fence, make sure you know why they put it up first."}, {"time": 5539, "text": "So I am for tearing it all down, but there's something called like a controlled demolition, like building sevens, or there's."}, {"time": 5549, "text": "We knew we were in Tel Aviv."}, {"time": 5552, "text": "Hashtag building seven."}, {"time": 5556, "text": "Wow, you're faster than me."}, {"time": 5557, "text": "You're operating in a different level."}, {"time": 5560, "text": "I need to upgrade my operating system."}, {"time": 5563, "text": "I told you Windows 95."}, {"time": 5565, "text": "You're trying, yeah."}, {"time": 5568, "text": "Building seven."}, {"time": 5569, "text": "If you're gonna, it's like Indiana Jones, right?"}, {"time": 5572, "text": "If you're gonna pull something away, make sure you have something in place first, as opposed to just breaking it, and then just, especially in politics, because it escalates."}, {"time": 5580, "text": "And when things escalate without any kind of response, it can go in a very bad, that's when Napoleon comes in."}, {"time": 5587, "text": "So what's your prediction about the Biden Trump debates?"}, {"time": 5594, "text": "Again, I just have this weird, maybe we'll return to maybe not in this, how do we put more love into the world?"}, {"time": 5602, "text": "And one of the things that worries me about the debates is it'll be the world's greatest troll against the grandpa on the porch."}, {"time": 5616, "text": "Who crapped his pants."}, {"time": 5618, "text": "And it will not put more love into the world."}, {"time": 5622, "text": "It will create more mockery, like."}, {"time": 5626, "text": "Joe Biden did a great job against Paul Ryan in 2012."}, {"time": 5630, "text": "Paul Ryan was no lightweight."}, {"time": 5631, "text": "No one thought he was a lightweight."}, {"time": 5633, "text": "Joe Biden handed Sarah Pail in her ass in 2008, which isn't as easy to do as you think, because she's a female."}, {"time": 5639, "text": "So you're gonna come off as bullying."}, {"time": 5640, "text": "That's something you have to worry about."}, {"time": 5641, "text": "So the guy isn't, I think he is in the stages of cognitive decline."}, {"time": 5649, "text": "So I think it's going to be interesting."}, {"time": 5651, "text": "I want it to be, like Mike Tyson beating up a child, cause it'll be a source of amusement to me."}, {"time": 5660, "text": "But I don't know how it's going to go."}, {"time": 5662, "text": "Is it possible that Joe Biden will be the Mike Tyson?"}, {"time": 5664, "text": "Yes, because in his last debate with Bernie, he was perfectly fine."}, {"time": 5668, "text": "And again, the guy was a sender for decades."}, {"time": 5670, "text": "And I don't think anyone, if you looked at Joe Biden in 2010, would have thought this guy is going to be, have his ass handed him a debate."}, {"time": 5677, "text": "You wouldn't think that at all."}, {"time": 5679, "text": "So I don't know who we're going to see."}, {"time": 5681, "text": "Plus he's got a lot of room to attack Trump."}, {"time": 5685, "text": "So I'm sure he's going to come strapped and ready and he's going to have his talking points and watch Trump dance, try to tap dance around him."}, {"time": 5691, "text": "And if he's in a position, I don't know what the rules of the debate are, to actually nail him to the wall, it might actually, I'm sure he's going to have a lot of lines too."}, {"time": 5699, "text": "The problem is Trump is the master counter puncher."}, {"time": 5701, "text": "So like when Hillary's had her line, she's like, well, it's a good thing that Donald Trump isn't in charge of our legal system."}, {"time": 5708, "text": "And he's like, yeah, you'd be in jail."}, {"time": 5710, "text": "It's like, oh, lady, you set him up."}, {"time": 5713, "text": "That's painful to watch, those debates."}, {"time": 5716, "text": "I mean, there's something, I think it's actually analogous."}, {"time": 5720, "text": "I've come to think of it, your conversation with me right now, some Sleepy Joe, I'm playing the role of Sleepy Joe."}, {"time": 5728, "text": "I actually connect to Joe because there's, I'm also incontinent."}, {"time": 5735, "text": "There's like these weird pauses that he does."}, {"time": 5738, "text": "I do the same thing and it annoys the shit out of me that like in mid sentence, I'll start saying a different thing and take a tangent."}, {"time": 5749, "text": "I'm not as slow and drunk as I sound, always."}, {"time": 5754, "text": "I swear I'm more intelligent underneath it."}, {"time": 5756, "text": "I'm slower but less drunk."}, {"time": 5760, "text": "But the result, one of those is true, but not both, yeah."}, {"time": 5763, "text": "And Trump, just like you, are a master counter puncher."}, {"time": 5769, "text": "So it's gonna be messy."}, {"time": 5771, "text": "Here's the other thing, in all seriousness, Chris Wallace is the moderator."}, {"time": 5775, "text": "Chris Wallace has interviewed Trump several times and he was a tough, tough questioner."}, {"time": 5781, "text": "So I don't think he's gonna come in there with softball questions."}, {"time": 5785, "text": "I think he's really going to try to nail Trump down, which is tough to do."}, {"time": 5789, "text": "I like him a lot."}, {"time": 5790, "text": "Yeah, and he's like, Mr. President, sir, that's not accurate, blah, blah, blah."}, {"time": 5793, "text": "He's done it."}, {"time": 5794, "text": "And Trump gets very frustrated because he doesn't just let him say whatever he wants and he hits him with the follow up."}, {"time": 5801, "text": "I guess he's on Fox News."}, {"time": 5803, "text": "And I listen to his Sunday program every once in a while."}, {"time": 5809, "text": "He gives me hope that, I don't know, there's something in the voice that he's not bought."}, {"time": 5815, "text": "There's no question he's gonna take this seriously, which I think is the best you could hope for in a moderator."}, {"time": 5820, "text": "It feels like there's people that might actually take the mainstream media into a place that's going to be better in the future."}, {"time": 5828, "text": "And we need people like him."}, {"time": 5829, "text": "You mean like Robespierre?"}, {"time": 5832, "text": "Like taking the mainstream media to a better future."}, {"time": 5834, "text": "Like bring out the guillotines."}, {"time": 5837, "text": "See, you put your anarchist hat back on."}, {"time": 5841, "text": "I don't think Robespierre is much of an anarchist, but yeah, I get what you're saying."}, {"time": 5844, "text": "You don't think there should be a centralized place for news?"}, {"time": 5846, "text": "There isn't now."}, {"time": 5847, "text": "Well, that's what mainstream media is supposed to represent, and it's broken."}, {"time": 5853, "text": "Well, it's not whatever, what do you call that?"}, {"time": 5856, "text": "A place where people traditionally said was the legitimate source of truth."}, {"time": 5864, "text": "That's what the media was supposed to represent, no?"}, {"time": 5867, "text": "That's their big branding accomplishment."}, {"time": 5870, "text": "That was never true?"}, {"time": 5871, "text": "Yeah, because here's what happens."}, {"time": 5873, "text": "We remember the Spanish American War, remember the Maine, we have to take Cuba, yellow journalism, William Randolph Hearst, right?"}, {"time": 5880, "text": "Then record scratch, and then we're all objective."}, {"time": 5884, "text": "Like when did this transition happen according to people?"}, {"time": 5886, "text": "When you were saying that the Kaiser is the worst human being on earth?"}, {"time": 5890, "text": "When you were downplaying Stalin and downplaying Hitler's atrocities?"}, {"time": 5894, "text": "When you were saying we had to be in Vietnam?"}, {"time": 5896, "text": "At what point, WMDs, when did it change?"}, {"time": 5899, "text": "It never changed."}, {"time": 5899, "text": "You just are better con artists at a certain point, and now the mask is dropping."}, {"time": 5903, "text": "Yeah, but don't you think there's, at its best, like investigative journalism can uncover truth in a way that like Reddit, subreddits can't?"}, {"time": 5919, "text": "You know, Reddit, sure, I agree."}, {"time": 5921, "text": "At its best, absolutely, that's not even a dispute."}, {"time": 5923, "text": "But like, don't you think like fake it until you make it is the right way to do it?"}, {"time": 5929, "text": "Meaning like the."}, {"time": 5931, "text": "Fake the news?"}, {"time": 5932, "text": "No, no, no, I meant the news saying like, we dream of doing, of arriving at the truth and reporting the truth."}, {"time": 5941, "text": "They don't say that."}, {"time": 5942, "text": "CNN had an advertisement that said this is an apple."}, {"time": 5944, "text": "We only report facts."}, {"time": 5946, "text": "That's a lie."}, {"time": 5947, "text": "No, that's now, and now it's clear things have changed."}, {"time": 5951, "text": "You're just more, you're more aware of their chicanery."}, {"time": 5955, "text": "But, okay, so the."}, {"time": 5957, "text": "How many people died in Iraq?"}, {"time": 5959, "text": "Because Saddam Hussein was about to launch WMDs."}, {"time": 5962, "text": "Who had consequences for this?"}, {"time": 5964, "text": "No one."}, {"time": 5965, "text": "This isn't a minor thing."}, {"time": 5966, "text": "This is lots of dead people."}, {"time": 5970, "text": "And also, I mean, dead people, it's horrible, but also the money, which has, like we said, economic effects that."}, {"time": 5977, "text": "Marianne Williamson, I think it was, had the, or Trump, both of them had the great point that goes, that's like a trillion dollars."}, {"time": 5982, "text": "How many schools would that build?"}, {"time": 5983, "text": "How many roads would that build?"}, {"time": 5984, "text": "Even here, why are we building hospitals in Iraq that we destroyed when we could building hospitals here?"}, {"time": 5989, "text": "It makes no sense."}, {"time": 5991, "text": "So who's responsible for that?"}, {"time": 5993, "text": "Like who?"}, {"time": 5994, "text": "Alex Jones."}, {"time": 5995, "text": "No, I meant for, well, so who's responsible for arriving at the truth of that, of speaking to the money spent on the wars in Iraq?"}, {"time": 6009, "text": "This is one of the great things about social media."}, {"time": 6011, "text": "Twitter, you have faith in Twitter."}, {"time": 6013, "text": "Not specifically Twitter, but yeah, social media's the whole, what anyone could."}, {"time": 6016, "text": "Here's another great example."}, {"time": 6018, "text": "Before, if you were talking about police brutality or these riots, you would have to perceive it in the way it was framed and presented to you."}, {"time": 6026, "text": "Nicholas Sandman's another example."}, {"time": 6029, "text": "Breonna Taylor, all these things."}, {"time": 6030, "text": "Well, we don't have footage of her."}, {"time": 6032, "text": "You would have to perceive in the way that it's edited and presented to you by the corporate press."}, {"time": 6035, "text": "Now everyone is a video, has a video camera."}, {"time": 6038, "text": "Everyone has their perspective."}, {"time": 6039, "text": "And it's very useful when these incidents happen where you could see the same incident from several angles and you don't need Don Lemon or Chris Wallace to tell me what this means."}, {"time": 6049, "text": "I can see with my own eyes."}, {"time": 6050, "text": "Yeah, I've been very pleasantly surprised about the power."}, {"time": 6055, "text": "See, the mob, again, gets in the way."}, {"time": 6058, "text": "They get emotional and they destroy the ability for people to reason."}, {"time": 6065, "text": "But you're right that truth is unobstructed on social media."}, {"time": 6069, "text": "Like if you're careful and patient, you can see the truth."}, {"time": 6074, "text": "Like for example, data on COVID, some of the best sources are doctors."}, {"time": 6079, "text": "Like if you wanna know the truth about the coronavirus and what's happening is there's follow people on Twitter."}, {"time": 6087, "text": "There's certain people that are just like sourcing them from me versus the CDC and the WHO."}, {"time": 6092, "text": "It's, that's fast."}, {"time": 6093, "text": "I mean, well, it's kind of anarchy, right?"}, {"time": 6097, "text": "It's not kind of, it is anarchy, yes."}, {"time": 6098, "text": "I mean, well, there's some censorship and all that kind of stuff."}, {"time": 6102, "text": "You have censorship under anarchy in the sense that you're talking about."}, {"time": 6105, "text": "Like people get kicked off of Twitter."}, {"time": 6107, "text": "That's a drawing backwards."}, {"time": 6108, "text": "How do you kick somebody, okay."}, {"time": 6109, "text": "So, I mean, it's a."}, {"time": 6114, "text": "Most people wouldn't say Twitter is working, but that's probably because they take for granted how well it's working and they're just complaining about the small part of it that's broken."}, {"time": 6127, "text": "Okay, another question about."}, {"time": 6129, "text": "You feel better?"}, {"time": 6130, "text": "No, by the way, I mean, I had a personal gripe with the situation about the, not a personal gripe, but I felt overly emotional about the possibility that there will be some of Donald Trump messing with the election process, but you made me feel better."}, {"time": 6153, "text": "Like saying like, if he had a bunch of opportunities to do what I would have done if I was a dictator, I would, the first time those riots over George Floyd, I would have instituted martial law."}, {"time": 6169, "text": "Do you know what I remember very vividly?"}, {"time": 6172, "text": "Is after 9 11 and everyone was waiting for George Bush to give his speech and he had 98% approved rating."}, {"time": 6177, "text": "And I remember very vividly, cause if he had said we're suspending the constitution, everyone would have cheered for him."}, {"time": 6184, "text": "Like he couldn't get enough support at that time."}, {"time": 6186, "text": "And he didn't do it."}, {"time": 6187, "text": "And I can't say anything really good about George W. Bush."}, {"time": 6190, "text": "I'm not a fan of his to say the least."}, {"time": 6192, "text": "So I think you and I, and other people who are familiar with totalitarian regimes to some extent from our ancestry or whatever, from research should always be the ones freaking out and warning, but we should also be aware of we got a ways to go before it's Hitler."}, {"time": 6210, "text": "And thankfully there are a lot of dominoes that have to fall into place before Hitler."}, {"time": 6216, "text": "It's like the game secret Hitler, it's a board game before Hitler becomes Hitler."}, {"time": 6220, "text": "Like it's not, especially in America, there's lots of things that have to happen before you really get to that point."}, {"time": 6227, "text": "I mean, FDR was for all intents and purposes a dictator, but even then the worst you could say, and this is not something that you should take lightly was internment of Japanese citizens, but they weren't murdered."}, {"time": 6238, "text": "They weren't under lock and key in the sense of like in cells."}, {"time": 6241, "text": "So things could have gotten a lot worse for him."}, {"time": 6244, "text": "We have to, I mean, Hitler is such a horrible person to bring up because."}, {"time": 6247, "text": "He's Mussolini."}, {"time": 6248, "text": "Yeah, Mussolini is better because Hitler is so close and connected to the atrocities of the Holocaust."}, {"time": 6255, "text": "There's all this stuff that led up to the war and the war itself."}, {"time": 6258, "text": "Say that there was no Holocaust, Hitler would probably be viewed differently."}, {"time": 6263, "text": "Yes, I should think so."}, {"time": 6264, "text": "Well, I mean, but."}, {"time": 6266, "text": "You think, that's a very controversial stance."}, {"time": 6269, "text": "You think Hitler would be viewed differently if it wasn't for the Holocaust?"}, {"time": 6271, "text": "Well, I mean, but it's a funny thing that the, I would say the death of how many, 40, 50 million."}, {"time": 6284, "text": "I mean, I don't know how you calculate it."}, {"time": 6286, "text": "It's not seen as bad as the 6 million."}, {"time": 6290, "text": "Oh yeah, because of Mao and Stalin."}, {"time": 6292, "text": "Yeah, but it's interesting."}, {"time": 6296, "text": "I'm working on it."}, {"time": 6297, "text": "You're working on it."}, {"time": 6298, "text": "Yeah, the next book I'm talking about."}, {"time": 6299, "text": "Reminding, well, it's good."}, {"time": 6301, "text": "I'm glad a good writer is, because the world's not reminded."}, {"time": 6303, "text": "My last book, The New Right, I had to deal with something like the Nazis."}, {"time": 6306, "text": "And one of the points they make is, how come everyone knows about the Holocaust, but no one knows about the Holodomor?"}, {"time": 6310, "text": "And they're right."}, {"time": 6311, "text": "We should know about this, because it is a great example of both how the Western media were depraved, but also what human beings are capable of."}, {"time": 6319, "text": "And those scars are still, many Americans think Russia and Ukraine are the same thing."}, {"time": 6325, "text": "Oh, Trump's in bed with the Ukrainians, Trump's about the Russians, they think it's the same thing."}, {"time": 6329, "text": "For us, it's complete lunacy."}, {"time": 6331, "text": "But this is the kind of thing where Pol Pot is another example, where people have no clue of what has been done to their fellow man on the face of this earth, and they should know."}, {"time": 6341, "text": "How much of that do you lay at the hands of communism?"}, {"time": 6343, "text": "How much are you with like a Jordan Pearson who is intricately connecting the atrocities, like you're saying, 1930s Ukraine, where people were starved?"}, {"time": 6356, "text": "I recently, my grandmother recently passed away, and she survived that as a kid."}, {"time": 6362, "text": "Which is, those people, I mean, they're tough."}, {"time": 6369, "text": "They're tough."}, {"time": 6369, "text": "Like that whole region is tough, because they survived that, and then right after, occupation of Nazis, of Germans."}, {"time": 6379, "text": "How much do you lay that at communism as an ideology, versus Stalin, the man?"}, {"time": 6387, "text": "I think Lenin was building concentration camps while he was around, and slave labor."}, {"time": 6394, "text": "I don't, I think it's clearly both."}, {"time": 6396, "text": "There are certain variants of communism that were far, like Khrushchev and Gorbachev, the reason the Soviet Union fell apart, and this is kind of, I'm gonna spoil the end of the book."}, {"time": 6407, "text": "There's an amazing book called Revolution 1989, it's like the most beautiful book I've ever read, by Viktor Sebastian, he's a Hungarian author."}, {"time": 6413, "text": "And basically what happens in 1989, Poland has their elections, and then in 1990, they kind of let in the labor people to the government."}, {"time": 6420, "text": "And people start crossing borders in the Eastern Bloc, and you had Hanukkah from Eastern Germany, and Ceausescu from Romania calling Gorbachev, because those are the two toughest ones, by communist standards, they go, they're just escaping, we're gonna lose everything."}, {"time": 6436, "text": "You gotta send in the tanks, like you did in Hungary, like you did in Czechoslovakia in 68."}, {"time": 6440, "text": "And Gorbachev goes, I'm not sending the tanks."}, {"time": 6442, "text": "And they go, dude, if you don't send in the tanks, it's all done, and he goes, nope, I'm not that kind of guy."}, {"time": 6448, "text": "And they were right, Ceausescu was personally shot with his wife up against the wall, Hanukkah, I forget what happened to him, but they all self liberated."}, {"time": 6457, "text": "My friend who was born in Czechoslovakia, his mom was pregnant under communism, and she never even imagined he'd be free, and he was born under free."}, {"time": 6465, "text": "And they were all looking around, all these countries that self liberated, because they're like, this is a trick, right?"}, {"time": 6470, "text": "They're trying to figure out who's like not good, so that they can arrest us on mass, and they didn't."}, {"time": 6474, "text": "So even within communism, there are bad guys and better guys."}, {"time": 6482, "text": "But we talked about anarchy, we talked about democracy."}, {"time": 6486, "text": "Do you see, like there's democratic socialism conversations going on in the popular culture, socialism is seen as like evil, or for some people, great?"}, {"time": 6499, "text": "What are your thoughts about it as in a political ideology?"}, {"time": 6504, "text": "Evil."}, {"time": 6505, "text": "So you're on the evil side?"}, {"time": 6507, "text": "Fundamentally?"}, {"time": 6508, "text": "What is it, you know, what makes it evil?"}, {"time": 6514, "text": "What's like structurally, if you were to try to analyze?"}, {"time": 6518, "text": "Sure, I'd say three ways."}, {"time": 6519, "text": "Morally, no person has the right to tell another person how to live their life."}, {"time": 6524, "text": "Economically, it's not possible to make calculations under socialism."}, {"time": 6528, "text": "It's only the prices that are information that tells me, oh, this is, we need to produce more of this, we need to produce less of this."}, {"time": 6534, "text": "Without prices being able to adjust and give information to producers and consumers, you have no way of being able to produce effectively or efficiently."}, {"time": 6543, "text": "And also it is, it turns people against each other."}, {"time": 6548, "text": "When you force people to interact, when you force them into relationships, when you force them into jobs, and you don't give them any choice, when there's a monopoly, the consequence of monopoly, everyone's familiar with ostensibly under capitalism, but somehow when it's a government monopoly, all those economic principles don't work, it doesn't make any sense."}, {"time": 6564, "text": "But there's force in democracy too, it's just you're saying there's a bit more force in socialism."}, {"time": 6572, "text": "But that's interesting that you say that there's not enough information."}, {"time": 6574, "text": "I mean, that's ultimately, you need to have really good data to achieve the goals of the system, even if there's no corruption."}, {"time": 6585, "text": "You just need to have the information."}, {"time": 6587, "text": "Which you can't."}, {"time": 6588, "text": "And capitalism provides you a really strong source of real time information."}, {"time": 6598, "text": "And if capitalism at its best and cleanest, which is perfect information, is available, there's no manipulation of information."}, {"time": 6608, "text": "That's one of the problems, okay."}, {"time": 6611, "text": "Can we talk about some candidates, the ones we got and possible alternatives?"}, {"time": 6617, "text": "So one question I have is, why do we have, within this system, why do we have the candidates we have?"}, {"time": 6627, "text": "It seems, maybe you can correct me, highly unsatisfactory."}, {"time": 6635, "text": "Is anyone actually excited about our current candidates?"}, {"time": 6639, "text": "I'm kind of excited, because no matter who wins the election, it's gonna be hilarious."}, {"time": 6644, "text": "So that is something that I'm excited about."}, {"time": 6646, "text": "From a humor perspective."}, {"time": 6648, "text": "Is that what the whole system is?"}, {"time": 6650, "text": "So that's one theory of the case, is the entire thing is optimized for viewership."}, {"time": 6656, "text": "And excitement by definitions of like the reality show kind of excitement."}, {"time": 6661, "text": "I think it is, if you look at what happened with Brett Kavanaugh, this is not a career that would draw people who are, you might say, quality."}, {"time": 6674, "text": "Because no matter who they are, there would be a huge incentive from the other team to denigrate them and humiliate them in the worst possible ways."}, {"time": 6681, "text": "Because as the two teams lose their legitimacy among Gen Pop, it's gonna get harder and harder for them to maintain any kind of claims to authority, which is something I like, but which does kind of play out in certain nefarious ways."}, {"time": 6696, "text": "So people, the best of the best, are not gonna wanna be politicians."}, {"time": 6700, "text": "Yeah, because I could have a job, or have a job interview and I'm running Yahoo or whatever, or I could, for 18 months, have to eat, you know, corn dogs looking like I'm going down on someone and shake hands and have all this, my family and on social media daily called the worst things, for what?"}, {"time": 6718, "text": "And then I'm still not guaranteed the position."}, {"time": 6722, "text": "But the flip side of that, like from my perspective, is the competition is weak."}, {"time": 6728, "text": "Meaning, like, you need a minimum amount of eloquence, eloquence, clearly, that I don't, the bar which I did not pass."}, {"time": 6737, "text": "I don't think either of them would be considered particularly eloquent, Biden or Trump."}, {"time": 6741, "text": "No, I know, but that's what I'm saying."}, {"time": 6742, "text": "The competition, like if you were, wanted to become a politician, if you wanted to run for president, the opportunity is there."}, {"time": 6752, "text": "Like if you were at all competent."}, {"time": 6753, "text": "Like if you had, so like Andrew Yang is an example of somebody who has a bunch of ideas, is somewhat eloquent, like young, energetic."}, {"time": 6763, "text": "It feels like there should be thousands of Andrew Yangs, like that would enter the domain."}, {"time": 6769, "text": "He went nowhere."}, {"time": 6771, "text": "Well, I wouldn't say he went nowhere."}, {"time": 6774, "text": "He generated quite a bit of excitement."}, {"time": 6775, "text": "He just didn't go very far, that's, okay."}, {"time": 6779, "text": "You don't have to run for president to generate excitement with your ideas."}, {"time": 6782, "text": "You could be a podcast host, I'm not even joking."}, {"time": 6784, "text": "That's right, that's right, that's right."}, {"time": 6787, "text": "And he's both, Andrew Yang."}, {"time": 6789, "text": "Oh, he's a podcast?"}, {"time": 6790, "text": "Yeah, he has a podcast called Yang Speaks."}, {"time": 6793, "text": "Oh, okay, cool."}, {"time": 6799, "text": "Oh, wow, the music of the way you said, yeah, cool."}, {"time": 6804, "text": "It's the way my mom talks to me when I tell her something exciting going on in my life."}, {"time": 6811, "text": "Oh, that's nice, honey."}, {"time": 6812, "text": "Oh, you made a robot, that's cool."}, {"time": 6815, "text": "A mixed coffee?"}, {"time": 6816, "text": "Oh, you're still single, though, aren't you?"}, {"time": 6818, "text": "I wonder why, I wonder why."}, {"time": 6823, "text": "Make yourself a robot wife?"}, {"time": 6824, "text": "Give me some robot grandchildren."}, {"time": 6829, "text": "Okay, but first of all, okay, let me ask you about Andrew Yang because he represents fresh energy."}, {"time": 6838, "text": "You don't find him fresh or energetic, you know?"}, {"time": 6842, "text": "Like, is there any candidate you wish was in the mix that was in the mix you wish was one of the last two remaining?"}, {"time": 6851, "text": "Yeah, people like Marianne Williamson, I thought was great."}, {"time": 6854, "text": "Tulsi, I thought was great."}, {"time": 6856, "text": "Amy Klobuchar got a bad rap."}, {"time": 6858, "text": "I think she held her own."}, {"time": 6861, "text": "Smart, she wasn't particularly funny, that's okay."}, {"time": 6864, "text": "I think she was nonthreatening to a lot of people."}, {"time": 6866, "text": "What did you like about them?"}, {"time": 6868, "text": "I guess I just named all women, that's interesting."}, {"time": 6869, "text": "It wasn't even intentional."}, {"time": 6871, "text": "Tulsi, I liked that she was aggressive, has a good resume and is not staying the course for the establishment."}, {"time": 6879, "text": "Marianne Williamson, I like because she comes from a place, from what it seems, of genuine compassion."}, {"time": 6885, "text": "Maybe she's a sociopath, I don't know."}, {"time": 6887, "text": "I read her book and it actually affected me profoundly because it's very rare when you read a book and there's even that one idea that blows your mind and that you kind of think about all the time."}, {"time": 6896, "text": "And there was one such idea in her book about she was teaching something called A Course in Miracles in Hollywood."}, {"time": 6902, "text": "I think she still teaches it."}, {"time": 6904, "text": "And this was during the 80s, the height of the AIDS crisis."}, {"time": 6907, "text": "And all these young men in the prime of their life were dropping like flies."}, {"time": 6911, "text": "And she's trying to give them hope."}, {"time": 6913, "text": "Well, good luck, they're dying, no one cares."}, {"time": 6916, "text": "And they're like, you can't tell us that they're gonna cure this, that's a lie."}, {"time": 6921, "text": "And she goes, what if I told you they're not gonna cure it?"}, {"time": 6925, "text": "What if I told you it's gonna be to like diabetes?"}, {"time": 6928, "text": "They cut off your foot and you're gonna go blind."}, {"time": 6930, "text": "Would that be something that you can hope for?"}, {"time": 6933, "text": "And when you put it like that, it's like, yeah."}, {"time": 6934, "text": "Like if you're talking to someone like a homeless junkie and you're like, you could be a doctor, you're a lawyer or a lawyer, like cool story."}, {"time": 6939, "text": "Like you could have a studio apartment with a terrible roommate and a shitty job."}, {"time": 6945, "text": "But when you're on the street, cooking breakfast in a teaspoon and you hear that, you're like, wait, would that really be so bad?"}, {"time": 6953, "text": "Is that really so much worse than this?"}, {"time": 6954, "text": "No, and it becomes something."}, {"time": 6956, "text": "So when she put it in those terms, I'm like, wow, this woman that really did a number on me in terms of teaching people how to be hopeful."}, {"time": 6964, "text": "Small steps, I guess."}, {"time": 6965, "text": "But it's also, then it becomes less of I need a miracle to be like, oh, this is really manageable."}, {"time": 6972, "text": "And it's absurd to think it's impossible."}, {"time": 6975, "text": "What about what's your take on Unity 2020 that Brett Weinstein pushed forward?"}, {"time": 6982, "text": "It was DOA, he couldn't even stand up to Twitter."}, {"time": 6986, "text": "Dead on arrival."}, {"time": 6988, "text": "He couldn't even stand up to Twitter, let alone, or to Facebook, they got blocked, let alone to Facebook."}, {"time": 6991, "text": "It was not hugely problematic, by the way, that Twitter would block that."}, {"time": 6996, "text": "I don't know why they blocked it, but I believe, I don't know what problematic means."}, {"time": 7000, "text": "That's a word that does a lot of work that people wanted to do conceptually."}, {"time": 7005, "text": "The idea that Unity is taking the rejects from each party and we're gonna have something that no one likes and therefore it's gonna be a compromise is absurd."}, {"time": 7014, "text": "The last time we had this kind of Unity ticket was the Civil War, where you had Andrew Johnson from the Democrats and Lincoln from the Republicans."}, {"time": 7021, "text": "This was not something that ended well, particularly nicely, for both halves of the country."}, {"time": 7025, "text": "So that's the way you see it is, like the way I saw it, I guess I haven't looked carefully at it."}, {"time": 7031, "text": "I haven't either, to be fair."}, {"time": 7033, "text": "The way I saw it is emphasizing centrists, which is."}, {"time": 7037, "text": "How is Tulsi a centrist?"}, {"time": 7039, "text": "Tulsi was involved?"}, {"time": 7040, "text": "Yes, he's trying to push Tulsi on like Jesse Ventura or something."}, {"time": 7044, "text": "So, okay, I don't know."}, {"time": 7046, "text": "I don't know the specifics."}, {"time": 7047, "text": "As a scientist, you also know centrism is not a coherent term in politics."}, {"time": 7050, "text": "But see, now you're like, what is it?"}, {"time": 7054, "text": "Pleading to authority and my ego."}, {"time": 7057, "text": "No, no, I'm pleading to how you approach data."}, {"time": 7060, "text": "If someone is saying the mean is accurate, that only mean, I mean, the mean could be anywhere."}, {"time": 7065, "text": "It's a function of what's around it."}, {"time": 7066, "text": "That mean is true."}, {"time": 7067, "text": "I don't even know what centrists is supposed to mean, but what it means to me, there's no idea, a centrist."}, {"time": 7075, "text": "There's more of a center right or center left."}, {"time": 7078, "text": "To me, what that means is somebody who is a liberal or a conservative, but is open minded and empathetic to the other side."}, {"time": 7093, "text": "Joe Biden had the crime bill."}, {"time": 7095, "text": "Joe Biden voted for Republican Supreme Court justices."}, {"time": 7098, "text": "Joe Biden voted for a balanced budget."}, {"time": 7099, "text": "Joe Biden voted for Bush's war."}, {"time": 7101, "text": "And I'm sure probably I haven't looked this up, the Patriot Act."}, {"time": 7103, "text": "Joe, if you want a centrist, you have Joe Biden."}, {"time": 7106, "text": "He's worked very well with Republicans."}, {"time": 7108, "text": "That argument could be made."}, {"time": 7109, "text": "Of course, everybody will always resist that argument."}, {"time": 7113, "text": "It's indeniable."}, {"time": 7114, "text": "In fact, during the campaign, some activists started yelling at him at a town hall."}, {"time": 7120, "text": "Not yelling, just saying, hey, we need open borders."}, {"time": 7123, "text": "Joe Biden says, I'm not for open borders."}, {"time": 7125, "text": "Go vote for Trump and literally turn his back on the man."}, {"time": 7128, "text": "And this is during the primaries where it would behoove you to try to appeal to the base."}, {"time": 7133, "text": "And of course, you can probably also make the argument that Donald Trump is center right, if not center left."}, {"time": 7139, "text": "Well, I mean, he's very unique as a personality."}, {"time": 7144, "text": "But if you look at his record, and first of all, his rhetoric, you can say is not centrist at all."}, {"time": 7148, "text": "But in terms of how he governs, the budgeting, I mean, has been very moderate."}, {"time": 7153, "text": "It certainly hasn't been like draconian budget cuts."}, {"time": 7156, "text": "The Supreme Court, you could say, okay, he's hard right."}, {"time": 7158, "text": "Immigration, you could say in certain capacities, he's hard right."}, {"time": 7161, "text": "But in terms of pro life, what has he done there?"}, {"time": 7164, "text": "In terms of, so in many other aspects, he's been very much this kind of me too Republican."}, {"time": 7170, "text": "But certainly the rhetoric, it's very hard to make him the case that he's a centrist."}, {"time": 7173, "text": "So you don't like, is there any other idea you find compelling?"}, {"time": 7177, "text": "What I like about UND 2020 is it's an idea for a different way, for like a different party, a different path forward."}, {"time": 7187, "text": "So ideas, just like anarchy is an interesting idea that leads to discourse, that leads to."}, {"time": 7193, "text": "I don't think it's interesting at all."}, {"time": 7194, "text": "And here's why I don't think it's interesting."}, {"time": 7196, "text": "Sweden has eight parties in its parliament."}, {"time": 7199, "text": "Iceland, population is like 150,000."}, {"time": 7202, "text": "They've got nine, I think it was."}, {"time": 7203, "text": "Czech Republic has nine, Britain has five."}, {"time": 7206, "text": "So the claim that two parties is the censorious of speech, but three, oh, now all of a sudden, it makes no sense, doesn't port to the data, number one."}, {"time": 7216, "text": "Number two is Donald Trump demonstrated that you can be basically a third party candidate, sees the machinery of a existing party and appropriate to your own ends as Bernie Sanders."}, {"time": 7227, "text": "Bernie Sanders has never been a Democrat."}, {"time": 7229, "text": "Major credit to him for that's not easy to be elected as Senator as an independent."}, {"time": 7233, "text": "He's done it repeatedly."}, {"time": 7234, "text": "So these are two examples of ossified elites right for the picking."}, {"time": 7238, "text": "But to have a third party makes no real sense."}, {"time": 7242, "text": "Speaking of which, a party you talk about quite a bit."}, {"time": 7247, "text": "And let's look, this is a personal challenge to you."}, {"time": 7253, "text": "Let me bring up the Libertarian Party."}, {"time": 7255, "text": "And the personal challenge is to go five minutes without mocking them in discussing this idea."}, {"time": 7263, "text": "So first of all, what?"}, {"time": 7265, "text": "I'm being trolled."}, {"time": 7267, "text": "Okay, I'm being trolled, okay, I'm being trolled."}, {"time": 7270, "text": "I'm being trolled, okay, this is good."}, {"time": 7273, "text": "Do you remember the fun friends?"}, {"time": 7274, "text": "There was an episode where Chandler had to not make fun of people."}, {"time": 7277, "text": "Like, can you go one day Chandler?"}, {"time": 7279, "text": "And Phoebe starts telling him about like this UFO she saw and he's like, that's very interesting and nice for you."}, {"time": 7287, "text": "This is exactly that."}, {"time": 7289, "text": "So a true master would be able to play within the game, within the constraints."}, {"time": 7292, "text": "So no, I'm pretty sure you'll still mock them."}, {"time": 7296, "text": "But no, no, I'll stick to the rules."}, {"time": 7298, "text": "Five minutes, easy."}, {"time": 7299, "text": "So first of all, speaking broadly about libertarianism, can you speak to that, how you feel about it?"}, {"time": 7304, "text": "And then also to the Libertarian Party, which is the implementation of it in our current system."}, {"time": 7309, "text": "So I think libertarianism is a great idea."}, {"time": 7313, "text": "And I think there's many libertarian ideas that have become much more mainstream, which I'm very, very happy about."}, {"time": 7319, "text": "I remember there was an article in either New York or New Yorker Magazine in the early 90s, where they talked about the Cato Institute, which is a libertarian think tank."}, {"time": 7328, "text": "And they refer to the fact that Cato was against war and against like regulation with a wacky consistency, because they didn't know how to reconcile these two things."}, {"time": 7338, "text": "I don't remember what the two things were, but I remember that expression wacky consistency."}, {"time": 7342, "text": "And it wasn't even, we were all taught, and this is very much before the internet, that there's two tribes and if you're pro life, you have to hate gays."}, {"time": 7352, "text": "And if you're for socialized medicine, that also means you have to be for free speech."}, {"time": 7359, "text": "It was just this very, and like there's a whole menu and you got to sign it to all of them."}, {"time": 7363, "text": "And that menu is terrible."}, {"time": 7365, "text": "They hate America, they want to destroy it."}, {"time": 7367, "text": "Oh my God, those are horrible evil."}, {"time": 7368, "text": "This is the menu you want."}, {"time": 7370, "text": "And the Libertarian Party to some extent, and just libertarians as a whole said, you know, you can do the Chinese buffet and take a little from column A, a little from column B and have an ideology that is coherent and consistent, an ideology of peace and nonaggression and things like that."}, {"time": 7388, "text": "The Libertarian Party takes its model from like the early progressive and populist parties from the early 20th century, which were not very effective in terms of getting people elected, but were extremely effective in terms of getting the two major parties to appropriate and adopt their ideas and implement them."}, {"time": 7407, "text": "And in Britain as well, the liberal party got destroyed and became taken over by labor as the alternative party to the Tories and have those ideas basically become mainstreamed."}, {"time": 7418, "text": "So I think that, and the libertarian, my friend who passed away, Eric, I miss him dearly, was their webmaster and his whole point is, if you don't think of that in terms of a party, in terms of getting people elected, but if you think of it as a party in terms of getting people educated about alternatives, then there's enormous use for that."}, {"time": 7435, "text": "That was his perspective."}, {"time": 7436, "text": "And I don't think that's an absurd perspective."}, {"time": 7438, "text": "But here's some libertarian ideas that have become extremely mainstream."}, {"time": 7442, "text": "War should be a last resort."}, {"time": 7444, "text": "This is something we were taught as kids and we all say, but for many years, it's been like, they don't think of it as a last resort."}, {"time": 7450, "text": "It's like something's bad, well, it's like the first instinct."}, {"time": 7452, "text": "Now it's like, let's really give it a week, just a week."}, {"time": 7455, "text": "Like what's going on in Syria?"}, {"time": 7456, "text": "Is there really gonna be a genocide, the Kurds?"}, {"time": 7458, "text": "You know, things like that."}, {"time": 7459, "text": "So that's one."}, {"time": 7460, "text": "Another thing is drug legalization."}, {"time": 7462, "text": "This was, you know, when you and I were kids, oh, it's crazy."}, {"time": 7465, "text": "Only hippies wanna smoke pot."}, {"time": 7467, "text": "Now it's like, I was on a grand jury."}, {"time": 7470, "text": "And I'll point out what people make is, are you sure that the 16 year old who's selling weed, let's say selling, should his life be ruined?"}, {"time": 7479, "text": "Should he be imprisoned with rapists and murderers?"}, {"time": 7481, "text": "Like if you say yes, say yes, but you have to acknowledge that that's what you're meaning."}, {"time": 7488, "text": "And then a lot of people are like, wait a minute, there's gotta be a third option then he has no consequences or he's imprisoned with a rapist."}, {"time": 7495, "text": "I'm not comfortable with either of these."}, {"time": 7497, "text": "And I think the other one is an increasing skepticism."}, {"time": 7501, "text": "This libertarians were on top of this first and the hard left of the police."}, {"time": 7505, "text": "As of now, asset forfeiture steals more from people than burglaries."}, {"time": 7509, "text": "What people don't know about what asset forfeiture is, if the cops come to your house and they suspect you, you haven't been convicted of using your car or your house or whatever in terms of selling drugs, they can take whatever they want."}, {"time": 7522, "text": "And then you have to sue to prove your innocence and get your property back."}, {"time": 7526, "text": "It's a complete violation of due process."}, {"time": 7528, "text": "People don't realize it's going on."}, {"time": 7529, "text": "It's a great way for the cops to increase their budgets and it's legal."}, {"time": 7532, "text": "And libertarians were like the first big ones saying, guys, this is not American and this is crazy."}, {"time": 7537, "text": "And now increasingly people on conservatives and leftists like, wait a minute, this is..."}, {"time": 7542, "text": "Even if you are selling drugs, like they take your house, what are you talking about?"}, {"time": 7545, "text": "So I think those are some mechanisms that libertarianism, though not by name, has become far more popular."}, {"time": 7552, "text": "Yeah, it's interesting, so the idea, yeah, a coherent set of ideas that eventually get integrated into a two party system."}, {"time": 7562, "text": "The war, that's an interesting one."}, {"time": 7565, "text": "I wonder what the thread there is."}, {"time": 7567, "text": "I wonder how it connects to 9 11 and so on."}, {"time": 7571, "text": "I think the Patriot Act."}, {"time": 7573, "text": "Patriot Act, okay."}, {"time": 7574, "text": "For people who are politically savvy, we're like, oh, okay, this is not a joke."}, {"time": 7580, "text": "This is really a crazy infringement of our freedoms and both parties are falling over each other to sign into law and the Orwellian name."}, {"time": 7590, "text": "You don't wanna... How can you be against patriotism?"}, {"time": 7592, "text": "What kind of person?"}, {"time": 7594, "text": "So I think for a lot of people, especially both civil libertarians on the left and a lot of conservatives who are constitutionalists are like, wait a minute, this isn't..."}, {"time": 7601, "text": "I'm not comfortable with this."}, {"time": 7602, "text": "And I'm also not comfortable with how comfortable everyone in Washington is with it."}, {"time": 7605, "text": "You're right, probably libertarians and libertarianism is a place of ideas, which is why I have a connection to it."}, {"time": 7617, "text": "Every time I listen to those folks, I like them."}, {"time": 7620, "text": "I feel connected to them."}, {"time": 7621, "text": "I would even sometimes, depending on the day, call myself a libertarian."}, {"time": 7625, "text": "Well, we're all the spectrum, so that's why."}, {"time": 7626, "text": "We're all on the spectrum, yeah."}, {"time": 7628, "text": "But when I look at the people that actually rise to the top in terms of the people who represent the party, this is where five minutes ran out, right?"}, {"time": 7638, "text": "I could go, I'm allowed."}, {"time": 7639, "text": "You can go, why are they so weird?"}, {"time": 7642, "text": "Why aren't strong candidates emerging that represent as political representatives or as famous speakers that represent ideology?"}, {"time": 7658, "text": "I think libertarians tend to..."}, {"time": 7660, "text": "I think Jonathan Haidt in his book, in his research, he's a political scientist and he does a lot of things about how people come to their political inclusions and what factors force people to reach conclusions."}, {"time": 7670, "text": "And he found that libertarians are the least empathetic and most rationalistic of all the groups."}, {"time": 7676, "text": "And by that, he means like they think in terms of logic as opposed to like people's feelings and that has positives and has negatives."}, {"time": 7684, "text": "And we have the A, B testing with Ron Paul."}, {"time": 7687, "text": "Ron Paul ran for president as a libertarian nominee."}, {"time": 7690, "text": "He was the nominee."}, {"time": 7691, "text": "He got pretty much nowhere in 1988."}, {"time": 7694, "text": "Then he ran as a return to the Republican party as a congressman for many years from Texas."}, {"time": 7698, "text": "He ran for the presidency in 2008 and 2012."}, {"time": 7702, "text": "And in 2008, he stood on stage with Rudy Giuliani and told him that they were here in 9 11 because we're over there, which would have been a shocking, horrifying taboo a few years earlier."}, {"time": 7715, "text": "Many people were like, holy crap, this is amazing."}, {"time": 7717, "text": "Giuliani was all offended and Ron Paul's like..."}, {"time": 7719, "text": "I took some guts by the way."}, {"time": 7720, "text": "Yeah, you did."}, {"time": 7721, "text": "When I heard that, it was so refreshing."}, {"time": 7724, "text": "Not what he said, but the fact that he said something that took guts."}, {"time": 7728, "text": "It made me realize how rare it is for politicians, but even people to say something that takes guts."}, {"time": 7736, "text": "Well, it's also the idea that like you can't, even if you think America has a right to invade any country on earth as much as it wants and kill people as a consequence of war and blow up their buildings and destroy their country, you can't with a straight face not expect us to have consequences, even if they're consequences from evil people."}, {"time": 7755, "text": "Even if we're 100% of the good guys and they're 100% of the bad guys, those bad guys, some of them are still gonna try to do something."}, {"time": 7762, "text": "What happens next?"}, {"time": 7764, "text": "So that kind of concept that there's any American culpability, we're America, we are the good guys by definition, we're not culpable, to have people start thinking about what if there's another way?"}, {"time": 7775, "text": "You know, what if we're not there and then they're not here and we're kind of doing a backdoor, we're talking so different scenarios."}, {"time": 7781, "text": "So the fact that he got so much more traction as a Republican, the fact that Donald Trump who came out of nowhere became not only the candidate, but the president tells people, it's like getting a book deal, right?"}, {"time": 7794, "text": "You can either go, there's three choices."}, {"time": 7797, "text": "You can either self publish, mainstream publisher or independent publisher."}, {"time": 7803, "text": "The independent publisher is the worst of all choices because you're not getting a big advance, they're not gonna be able to promote you a lot and they don't get the distribution."}, {"time": 7812, "text": "Mainstream, I've done mainstream and self, right?"}, {"time": 7815, "text": "With self, I don't have the cred, the respectability of a mainstream or the cache."}, {"time": 7820, "text": "It can be a New York Times bestseller."}, {"time": 7822, "text": "Right, it takes a lot of work, but I get a lot more of the profit."}, {"time": 7826, "text": "If it looks good on the shelf on Amazon, it looks identical, so on and so forth."}, {"time": 7830, "text": "With the mainstream, the benefits and costs are pretty much obvious to most people."}, {"time": 7834, "text": "So the same thing, it's like you can either be an independent like Ross Perot or you could be, just seize one of the party apparatus, which the benefits are enormous there."}, {"time": 7842, "text": "But in terms of going third party, I don't know the libertarian party apparatus other than maybe some ballot access is really that efficacious."}, {"time": 7850, "text": "And then you're gonna have a lot of baggage."}, {"time": 7852, "text": "Cause if you hear independent, Jesse Ventura, Ross Perot, you think of the person."}, {"time": 7857, "text": "Now you have to define yourself and you have to defend the party."}, {"time": 7861, "text": "That's two bridges for most people."}, {"time": 7863, "text": "So, brilliantly put, okay, let me speak to you."}, {"time": 7869, "text": "Cause I'm speaking to Yaron Brooks soon."}, {"time": 7875, "text": "Yeah, so, but that, another example, I was."}, {"time": 7879, "text": "Ask him to tell you a joke about Ayn Rand, if he can do it."}, {"time": 7883, "text": "So there, that's one criticism I've heard you say, which is they're unable to speak to any weaknesses in either Ayn Rand's or objectivist worldview."}, {"time": 7895, "text": "That's really, well, you put it, I know you're half joking, but that's actually a legitimate discussion to have."}, {"time": 7903, "text": "I'm not joking at all."}, {"time": 7904, "text": "Because that's, to me, one of the criticisms and one of the explanations why the world seems to disrespect Ayn Rand, the people that do, is she kind of implies that her ideas are like flawless."}, {"time": 7918, "text": "No, she says they correspond to reality."}, {"time": 7922, "text": "That's the term she uses."}, {"time": 7923, "text": "That, I mean, objectivist, it's in the name."}, {"time": 7928, "text": "It's, you know, it's just facts."}, {"time": 7930, "text": "Like, it's impossible to basically argue against cause it's pretty simple, it's just all facts."}, {"time": 7936, "text": "Well, that's, it's possible to argue against, but she would say she's never met a good critic who can argue the facts out of misrepresentation."}, {"time": 7942, "text": "And she's not entirely wrong."}, {"time": 7944, "text": "She's often caricatured, cause she has a very extreme personality and extreme worldview."}, {"time": 7948, "text": "But that to me, I mean, some people, there's a guy named in the physics mathematics community called Stephen Wolfram."}, {"time": 7954, "text": "I don't know if you've heard of him."}, {"time": 7955, "text": "Wolfram Malfoy?"}, {"time": 7958, "text": "He has a similar style of speaking sometimes, which is like, I've created a science, but that turns a lot of people off, like this kind of weird confidence."}, {"time": 7968, "text": "But he's one of my favorite people, I think one of the most brilliant people."}, {"time": 7972, "text": "If you just ignore that little bit of ego or whatever you call that, that there are some beautiful ideas in there."}, {"time": 7979, "text": "And that, for me, objectivism, I'm undereducated about it."}, {"time": 7986, "text": "I hope to be more educated, but there's some interesting ideas that, again, just like with UFOs, not that there's a connection between the two."}, {"time": 7995, "text": "Don't bring that up for your own."}, {"time": 7996, "text": "He won't like it."}, {"time": 7997, "text": "He won't."}, {"time": 7998, "text": "My friends like UFOs."}, {"time": 7999, "text": "Oh, no, no, no, this interview is over."}, {"time": 8001, "text": "That's a good yarn."}, {"time": 8005, "text": "But you know, you have to be a little bit open minded, but what's your sense of objectivism?"}, {"time": 8011, "text": "Are there interesting ideas that are useful to you to think about?"}, {"time": 8015, "text": "I own her copy of the first printing of The Fountainhead."}, {"time": 8018, "text": "So that should tell you a little bit about how my affection for Ms. Rand, how heavy that goes."}, {"time": 8024, "text": "Ayn Rand does not have all the answers, but she has all the questions."}, {"time": 8027, "text": "So if you study Rand, you are going to be forced to think through some very basic things, and you're gonna have your eyes open very, very heavily."}, {"time": 8034, "text": "She was not perfect."}, {"time": 8036, "text": "She never claimed to be perfect."}, {"time": 8037, "text": "She was asked on Donahue, is it true that according to your philosophy, you are a perfect being?"}, {"time": 8042, "text": "She said, I never think of myself that way."}, {"time": 8045, "text": "And she said, but if you asked me, do I practice what I preach?"}, {"time": 8047, "text": "The answer is yes, resoundingly."}, {"time": 8050, "text": "She's a fascinating woman."}, {"time": 8053, "text": "What is really interesting about her, and this is something you'd appreciate personally, is when you read her essays, she'll have these weird asides."}, {"time": 8061, "text": "And it looked like she was talking about art, and she'd be like, and this is why the US should be the only country with nuclear weapons."}, {"time": 8065, "text": "And when you follow a brilliant mind making these seemingly disparate connections, it's something I find to be just absolutely inspiring and awesome and entertaining."}, {"time": 8076, "text": "I think there's lots of things about her that people like Yaron would make uncomfortable."}, {"time": 8083, "text": "Well, like she, they, so objectivism, like any other philosophy, has all these techniques to kind of hand wave away things you don't wanna talk about and like pretend it."}, {"time": 8092, "text": "So they talk about things like having no metaphysical significance, right?"}, {"time": 8097, "text": "So what that means is like, well, what about this?"}, {"time": 8098, "text": "Ah, I don't wanna talk about it."}, {"time": 8099, "text": "Like it doesn't matter."}, {"time": 8100, "text": "Like it literally means in fancy philosophical terms, it doesn't matter."}, {"time": 8103, "text": "Or they will say correctly, that it's very twisted in our culture that when we have heroes, we look for their flaws instead of looking for their virtues."}, {"time": 8113, "text": "That's a hundred percent valid perspective."}, {"time": 8116, "text": "However, if I'm sitting here telling you that I think this woman is a badass, and she's amazing and she should be studied, but there's also these idiosyncrasies, they don't wanna hear it."}, {"time": 8127, "text": "Because they, and I think it's very convenient for them because there's a lot of things she did that were, here's an example."}, {"time": 8133, "text": "Rand was very, very pro happiness and pleasure."}, {"time": 8136, "text": "She was very pro sex, which is kind of surprising looking at her and how she talked and how strident she was."}, {"time": 8141, "text": "As a result of this, she never got her cats fixed to deny them the pleasure of orgasm."}, {"time": 8146, "text": "So her male cats are spraying up her entire house."}, {"time": 8150, "text": "Like that is, I mean, that's her putting her philosophy into practice, but it's still gross."}, {"time": 8155, "text": "So that's the kind of thing where I don't think he'd be, another thing is Rand had an article on a woman president and she said a woman should never be president, right?"}, {"time": 8164, "text": "Now, when Rand says things that are too goofy for them, they say, oh, that's not objectivism, that's her personal preference."}, {"time": 8171, "text": "It's like, she did not have these lines."}, {"time": 8174, "text": "Objectivism was always defined as Ayn Rand's writings, plus the additional essays in her books."}, {"time": 8180, "text": "So if this was in part of those books, this counts as official objectivism, but they pretend otherwise."}, {"time": 8185, "text": "So that's another example."}, {"time": 8186, "text": "Plus she was, and I bet you she was on the spectrum to some extent, I'm not joking, I'm not using that derisively."}, {"time": 8192, "text": "She was of the belief and not inaccurately, because that humor is used to denigrate and humiliate."}, {"time": 8200, "text": "And she was thinking about the Jon Stewart type before there was a Jon Stewart."}, {"time": 8203, "text": "And a lot of times, like how I use mocking, but she was resentful, correctly, that a lot of times people who are great and accomplished, little nobodies will make a punchline just to bring them down and despise her."}, {"time": 8216, "text": "Here's an example I just thought of."}, {"time": 8218, "text": "I remember when it was, must have been the 90s, they had a segment on MTV of all these musicians who were making their own perfumes, right?"}, {"time": 8227, "text": "And this girl grabbed Prince's perfume, and before she even smelled it, she had the joke ready."}, {"time": 8231, "text": "She goes, oh, this smells almost as bad as his music lately."}, {"time": 8234, "text": "It's like, first of all, I'm sure the perfume's fine."}, {"time": 8236, "text": "And second of all, this is Prince."}, {"time": 8238, "text": "He's one of the all time greats, and you can't wait to denigrate him."}, {"time": 8242, "text": "And part, I wanna be like, how dare you?"}, {"time": 8245, "text": "Like as if this perfume in any way, in any way mitigates his amazing accomplishments and achievements, you horrible person."}, {"time": 8254, "text": "But I do have some great Ayn Rand jokes, and he would not be happy about them."}, {"time": 8258, "text": "The perfume thing, the problem with it is just not funny."}, {"time": 8260, "text": "Oh, he sucks, okay, great."}, {"time": 8263, "text": "Not that they dared to try to be humorous, because I don't know why you mentioned John, because John Stewart can be funny."}, {"time": 8270, "text": "Right, but he taught a generation, you still see this on Twitter, where things have to be inherently sarcastic and snide."}, {"time": 8278, "text": "But isn't that, I mean, aren't you practicing that?"}, {"time": 8280, "text": "No, I use irony, not sarcasm."}, {"time": 8283, "text": "When people, like you say something, and someone replied, it'd be like, last I checked, blah, blah, blah, blah, and I'll say that, I go, what do you think saying last I checked added to your point?"}, {"time": 8292, "text": "You're giving me valuable information and data, but you are trained to believe that it has to be couched in this sneering."}, {"time": 8299, "text": "It doesn't, just give me the information."}, {"time": 8301, "text": "This is useful information."}, {"time": 8304, "text": "It's a knee jerk."}, {"time": 8304, "text": "But see, John Stewart did it masterfully."}, {"time": 8307, "text": "Correct, and they don't."}, {"time": 8308, "text": "And they don't, it's like people who copy comedians, certain comedians, you try to copy them and use everything in the process of copying."}, {"time": 8317, "text": "Yeah, yep, okay."}, {"time": 8320, "text": "But in terms of the philosophy of selfishness, this kind of individual focused idea, and I imagine that connects with you."}, {"time": 8330, "text": "Yes, and I think it would connect with more people if they understood what she meant by it."}, {"time": 8334, "text": "Nathaniel Brandon, who was her heir until she kind of broke with him, and he was a co dedicatee of Atlas Shrugged, said no one will say Ayn Rand's views with a straight face."}, {"time": 8344, "text": "They won't say, I believe that my happiness matters and is important and is worth fighting for, and that Ayn Rand says this, then she's dangerous."}, {"time": 8353, "text": "Now, it's very easy to say this could have dangerous consequences if you're a sociopath, but to put it in those terms, I think is extremely healthy."}, {"time": 8361, "text": "I think more people should wanna be happy."}, {"time": 8363, "text": "And I think a lot of us are raised to be apologetic, especially in this cynical media culture, that if you say, I wanna be happy, I wanna love my life, that it's just like, okay, sweetheart."}, {"time": 8374, "text": "And the eye rolling, and I think that's so pernicious and so horrifying, this is why I'm a Camus person, because Camus thought the archenemy was cynicism and I could not agree more."}, {"time": 8382, "text": "Like if you're the kind of person, if someone likes a band and you're like, oh, you like them, blah, blah, blah, it's like, this gives them happiness."}, {"time": 8389, "text": "Now, there's certain exceptions, but if it gives you happiness, it's not for you, that's cool."}, {"time": 8394, "text": "Okay, this is beautiful."}, {"time": 8395, "text": "I so agree with you on the eye rolling, but you see the best of trolling as not the eye roll."}, {"time": 8404, "text": "Correct, of course not."}, {"time": 8405, "text": "The best of trolling is taking down the eye rollers."}, {"time": 8408, "text": "I'm gonna have to think about that."}, {"time": 8410, "text": "Because I kind of."}, {"time": 8411, "text": "Have another Red Bull."}, {"time": 8412, "text": "Yeah, I was, yeah."}, {"time": 8415, "text": "Because I put them all."}, {"time": 8416, "text": "My blood type is Red Bull."}, {"time": 8420, "text": "I kind of put them all in the same bin."}, {"time": 8423, "text": "And they're not."}, {"time": 8426, "text": "Okay, all right."}, {"time": 8426, "text": "Here's another example of trolling."}, {"time": 8429, "text": "I was making jokes about Ron Paul, he just had a stroke, right?"}, {"time": 8432, "text": "And someone came at me and they're like, blah, blah, blah, blah."}, {"time": 8436, "text": "You know, you're ugly."}, {"time": 8437, "text": "I hope you have a stroke."}, {"time": 8438, "text": "I hope you're in the hospital."}, {"time": 8439, "text": "And I just go, I just did have a stroke on your mom's face."}, {"time": 8442, "text": "So they came at me and now they got put in their place."}, {"time": 8447, "text": "With a subpar, I mean."}, {"time": 8450, "text": "I wasn't clever."}, {"time": 8451, "text": "You weren't clever."}, {"time": 8452, "text": "Not particularly, no."}, {"time": 8453, "text": "Well, one of your things you do, which is interesting, I mean, I give you props in a sense, is you're willing to go farther than people expect you to."}, {"time": 8463, "text": "Yes, that's fun."}, {"time": 8466, "text": "In fact, I'll probably edit out like half of this podcast because the thing you did, which she kept in, should mention, is Michaela Peterson now has a podcast, which is nice."}, {"time": 8476, "text": "I guess, was it on her podcast?"}, {"time": 8478, "text": "She was on mine."}, {"time": 8479, "text": "She was on yours."}, {"time": 8480, "text": "We did both, but this is when you're referring to when she was on mine."}, {"time": 8482, "text": "She was on, yeah, right."}, {"time": 8483, "text": "And you went right for the, for the."}, {"time": 8487, "text": "So I'll tell you what it was."}, {"time": 8489, "text": "You don't have to paraphrase."}, {"time": 8489, "text": "I opened up, I say, you know, she's Jordan Peterson's dad."}, {"time": 8492, "text": "And as many people know, sorry, he's her dad, yeah."}, {"time": 8496, "text": "He's had a long issue with substance addiction."}, {"time": 8499, "text": "And I said to her, you're most famous for being Jordan Peterson's daughter."}, {"time": 8505, "text": "Many people, he's changed so many lives around the world."}, {"time": 8508, "text": "And he's been such an enormous influence to me personally that I've started taking benzodiazepines recreationally."}, {"time": 8514, "text": "And she's like, oh my God, Michael, it's so horrible."}, {"time": 8518, "text": "Yeah, because you pulled me in with this, cause you're talking, I mean, you know, cause he's going through a rough time."}, {"time": 8524, "text": "Now she's going through just everything was just, you pulled me in emotionally."}, {"time": 8528, "text": "I was like, this is going to be the sweet, Mike is going to be just this wonderful."}, {"time": 8534, "text": "And then just bam."}, {"time": 8536, "text": "So that's, that's, that's, that was props to you on that."}, {"time": 8541, "text": "It wasn't, whatever that is, that is an art form when done well, it can be taken too far."}, {"time": 8547, "text": "My criticism is it, that feels too good for some people."}, {"time": 8554, "text": "Oh, they're too happy being a reverend cause to show that they don't care about anything."}, {"time": 8557, "text": "That's another form of cynicism though."}, {"time": 8558, "text": "Right, so I, cause you think it's possible to be a troll and still be the live life to its highest ideal in the Camus sense."}, {"time": 8568, "text": "I try, that's kind of my ideal."}, {"time": 8571, "text": "I believe it's not, it becomes a drug."}, {"time": 8575, "text": "I feel like that takes you, like I think love ultimately is the way to experience like every moment of every day."}, {"time": 8584, "text": "You don't think that was an expression of, I honestly think, let's split hairs here cause I think this is something of use here."}, {"time": 8592, "text": "I do think that me, me being able to make her laugh about this year of hell she was in does create an element of love and connection between me and her."}, {"time": 8605, "text": "Yeah, but I know she would say that."}, {"time": 8608, "text": "Yes, it wasn't that."}, {"time": 8610, "text": "It was what you said in combination with the sweetness everywhere else, the kindness."}, {"time": 8617, "text": "It's a very subtle thing, but like, it's like some of the deepest connection we have with others is when we like mock them lovingly."}, {"time": 8626, "text": "But like there is stuff, there's kindness around that."}, {"time": 8631, "text": "Sometimes it's not in words, but in like subtle things."}, {"time": 8635, "text": "Cause it creates an air of being familial."}, {"time": 8638, "text": "Like we're through this together."}, {"time": 8639, "text": "Yeah, that's missing, that's very difficult to do on the internet."}, {"time": 8646, "text": "That's why my general approach on the internet is to be more like simple, less witty and more like dumbly loving."}, {"time": 8659, "text": "But that's not your core competency being witty."}, {"time": 8663, "text": "Uh, me?"}, {"time": 8666, "text": "But I can be witty."}, {"time": 8667, "text": "You can be, but I'm saying that's not your core competency."}, {"time": 8669, "text": "I'm not saying you're bad at it, but I'm saying that's not where you go like organically, especially with strangers."}, {"time": 8676, "text": "I just feel like nobody's core competence on the internet is I guess if you want to bring love to the world, nobody's core competence is given the current platforms, nobody's core competence is wit."}, {"time": 8690, "text": "It's very difficult to be witty on the internet without while still communicating kindness."}, {"time": 8695, "text": "Like in the same way that you can in physical space."}, {"time": 8699, "text": "I'll give you another example."}, {"time": 8700, "text": "Someone came at me and they were like, they gave me a donation."}, {"time": 8704, "text": "People do this all the time."}, {"time": 8706, "text": "And they go, oh, like I started reading your books cause of my wife and you know, now watch your shows together, keep up the good work."}, {"time": 8714, "text": "And I go, what does her boyfriend think?"}, {"time": 8717, "text": "So that is an example of wit and love because that person feels seen."}, {"time": 8723, "text": "I'm acknowledging them."}, {"time": 8724, "text": "I'm also making a joke at their expense."}, {"time": 8725, "text": "We know it's a joke."}, {"time": 8727, "text": "So I think language is often used in nonliteral ways to cue emotional and connectivity."}, {"time": 8734, "text": "It's difficult, but what you've done is difficult to accomplish, but you've done it well."}, {"time": 8739, "text": "I mean, you've been doing these live streams, which are nice that people give you a bunch of money and donations and stuff."}, {"time": 8746, "text": "And then you, you'll often like make fun of certain aspects of their questions and so on, but it's always lovely."}, {"time": 8752, "text": "That's not from love."}, {"time": 8753, "text": "That is genuine annoyance cause they ask me some really dumb questions."}, {"time": 8754, "text": "But they're still underlying, it's not even, like there's a kind person under that that's being communicated."}, {"time": 8763, "text": "But I don't know if I get that from your Twitter."}, {"time": 8765, "text": "I know I get that from the video, something about the face, something about like, Yeah, of course."}, {"time": 8770, "text": "The physical presentation."}, {"time": 8771, "text": "The more data, the more easy it is to convey emotion and subtlety."}, {"time": 8775, "text": "Absolutely, if you only have literally black and white letters, it's going to be, or whatever, white and black, if you have night mode, it's going to be a very different, it's much more limited information."}, {"time": 8783, "text": "Yeah, but this is the fundamental thing is like, Here's another example."}, {"time": 8788, "text": "Like if they had access to my face, like a lot of times some people don't know who I am and they come at me, call me a Nazi antisemite, right?"}, {"time": 8794, "text": "And I start talking about the Jews and just how terrible the Jews are."}, {"time": 8797, "text": "Now all my audience knows I'm Jewish that I went to yeshiva."}, {"time": 8800, "text": "So they're sitting there laughing cause this person is making ass of themselves."}, {"time": 8803, "text": "That person has no idea."}, {"time": 8804, "text": "But if there was video, then they would be like, okay, wait a minute, something's up."}, {"time": 8808, "text": "Yeah, something's up."}, {"time": 8812, "text": "I think it's entertaining."}, {"time": 8813, "text": "I think it's fun, but I just, I don't think it's scalable."}, {"time": 8817, "text": "And ultimately, I'm trying to figure out this whole trolling thing."}, {"time": 8821, "text": "Cause I think it's really destructive."}, {"time": 8824, "text": "I've been the outrage mob, the outrage mobs, just the dynamics of Twitter has been really bothering me."}, {"time": 8833, "text": "I've been trying to figure out if we can try to build an alternative to Twitter perhaps or try to encourage Twitter to be better, how to have nuanced, healthy conversations."}, {"time": 8845, "text": "Like the reason I talk about love isn't just for love's sake."}, {"time": 8848, "text": "It's just a good base from which to have difficult conversations."}, {"time": 8853, "text": "Like that's a good starting point."}, {"time": 8854, "text": "Because if you start, like I would argue that the kind of conversation you have on Twitter is fun, but it might not be a good starting point for a difficult, nuanced conversation."}, {"time": 8866, "text": "Well, I'm not interested in having those conversations with most people."}, {"time": 8869, "text": "No, I know, but."}, {"time": 8872, "text": "Your point is valid."}, {"time": 8873, "text": "Yes, but like I'm saying, so if we were trying to have a difficult, nuanced conversation about say race in America or policing, is there institutional racism of policing?"}, {"time": 8887, "text": "There's the only conversations that have been nuanced about it that I've heard is in the podcasting medium."}, {"time": 8894, "text": "Which is the magic of podcasting, which is great."}, {"time": 8897, "text": "But that's the downside of podcasting is it's a very small number of people."}, {"time": 8904, "text": "Even if it's in the thousands, it's still small."}, {"time": 8907, "text": "And then there's millions of people on social media and they're not having nuanced conversation at all."}, {"time": 8912, "text": "They're not capable of it."}, {"time": 8914, "text": "That's the difference in your thoughts."}, {"time": 8915, "text": "They have no minds."}, {"time": 8915, "text": "I believe they are."}, {"time": 8916, "text": "So that's the."}, {"time": 8917, "text": "There's no data that shows this."}, {"time": 8918, "text": "Both of us aren't being not scientific."}, {"time": 8921, "text": "You don't have data to support your world either."}, {"time": 8923, "text": "You're making the claim."}, {"time": 8925, "text": "Well, you are too."}, {"time": 8926, "text": "No, I'm not."}, {"time": 8927, "text": "If I'm looking at an object, the claim that it has in mind."}, {"time": 8934, "text": "No, your claim is that people are fundamentally stupid."}, {"time": 8938, "text": "Are you a martial artist?"}, {"time": 8941, "text": "How's it feel?"}, {"time": 8943, "text": "I just judo on you."}, {"time": 8945, "text": "But you really don't think people are deep down like capable of being intelligent."}, {"time": 8954, "text": "Not deep down, not surface."}, {"time": 8956, "text": "I'm not joking."}, {"time": 8958, "text": "I'm not being cynical."}, {"time": 8958, "text": "I do not at all think they have this capacity."}, {"time": 8962, "text": "I'm gonna think."}, {"time": 8963, "text": "Cause you're being so clear about it."}, {"time": 8964, "text": "You're not even."}, {"time": 8967, "text": "You know why?"}, {"time": 8967, "text": "Here's evidence for my position, not proof."}, {"time": 8971, "text": "And this is of course data that is of little use, but it's of interest."}, {"time": 8974, "text": "A lot of times when you have an audience as big as mine and people come at you, not only will people say the same thing, the same concept, they'll say the same concept in the same way."}, {"time": 8984, "text": "That is not a mind."}, {"time": 8987, "text": "That's surface evidence."}, {"time": 8989, "text": "You're saying this iceberg looks like this from the surface."}, {"time": 8992, "text": "I'm saying there's an iceberg there that if challenged can rise to the occasion of deep thinking and you're saying."}, {"time": 9005, "text": "It's just frozen water."}, {"time": 9008, "text": "Isn't that the Russian expression?"}, {"time": 9011, "text": "That's ice cream."}, {"time": 9012, "text": "No, not."}, {"time": 9014, "text": "Doesn't it mean like no one's there?"}, {"time": 9017, "text": "Actually, I don't know."}, {"time": 9018, "text": "Yeah, it means like, yeah."}, {"time": 9019, "text": "Yeah, it's like thought."}, {"time": 9020, "text": "It means."}, {"time": 9026, "text": "Well, so you're challenging me to be a little bit more rigorous."}, {"time": 9029, "text": "I think I'll try."}, {"time": 9030, "text": "I'm not challenging you anything."}, {"time": 9031, "text": "I'm just saying."}, {"time": 9032, "text": "No, not challenging me, but like I'm challenging myself based on what you're saying because I'd like to prove you wrong and find actual data to show you're wrong."}, {"time": 9042, "text": "And I think I can, but I would need to get that data."}, {"time": 9046, "text": "That's funny you said, I think I can."}, {"time": 9047, "text": "When they were working on my biography, Ego and Hubris, the title I had suggested was The Little Engine That Could But Shouldn't."}, {"time": 9054, "text": "And they didn't like it."}, {"time": 9057, "text": "I think that's a great title."}, {"time": 9058, "text": "That's pretty good, yeah."}, {"time": 9060, "text": "Speaking of biographies, I mean, I read your book or listened to your book."}, {"time": 9064, "text": "Listened to."}, {"time": 9064, "text": "There's an audio book from you, right?"}, {"time": 9065, "text": "Yeah, I did the audio, yeah."}, {"time": 9068, "text": "You read it?"}, {"time": 9068, "text": "My Golis, yes."}, {"time": 9071, "text": "So this was a. I didn't do Yaron Brooks voice in the book."}, {"time": 9074, "text": "I did all the different voices because he has a lisp and I didn't want to sound like I was making fun of him."}, {"time": 9079, "text": "Yeah, I don't remember you reading it, but I was really enjoyed it."}, {"time": 9084, "text": "It was good."}, {"time": 9085, "text": "It was like a year, a year and a half ago."}, {"time": 9086, "text": "This I can prove."}, {"time": 9090, "text": "Well, let me at a high level, see if you can pull this off."}, {"time": 9093, "text": "If I ask you, what's the book you write about?"}, {"time": 9098, "text": "It's about a group of people who are united solely by their opposition to progressivism, who have little else in common, but who are all frequently caricatured and dismissed by the larger establishment media."}, {"time": 9116, "text": "But you give this kind of story of how it came to be."}, {"time": 9121, "text": "And to me, like we're talking about trolls, but the internet side of things is quite interesting."}, {"time": 9126, "text": "So first of all, how does alt right connect?"}, {"time": 9130, "text": "So the alt right is the subset of the new right, which feels that race, not racism, is the most or one of the most important socio political issues."}, {"time": 9141, "text": "Are any of those folks like part of the mainstream or worth paying attention to?"}, {"time": 9149, "text": "None of them are part of the mainstream."}, {"time": 9150, "text": "The alt right, by definition, they would be part of the mainstream."}, {"time": 9153, "text": "They would not be part of them."}, {"time": 9154, "text": "No, they would not."}, {"time": 9156, "text": "I don't know that any of them."}, {"time": 9158, "text": "Well, worth is not a position."}, {"time": 9160, "text": "I'm not in a position to say worth."}, {"time": 9161, "text": "I would say that it is of use to be familiar with their arguments because to dismiss any school of thought, especially one that has historically gained leverage, especially one that has historically gained leverage in very dark ways, especially in America, in Europe and other places, just to say, oh, they're racist."}, {"time": 9183, "text": "I don't need to think about them."}, {"time": 9184, "text": "It doesn't behoove you."}, {"time": 9187, "text": "So what lessons do we draw from the 4chan side of things, like the internet side of the movement?"}, {"time": 9196, "text": "Tits or get the fuck out."}, {"time": 9199, "text": "Can you define every single word in there?"}, {"time": 9201, "text": "Tits or breasts or get the fuck out."}, {"time": 9204, "text": "That's from 4chan."}, {"time": 9205, "text": "Okay, what's it mean?"}, {"time": 9208, "text": "Oh, sometimes like a woman will appear in 4chan and they'll just reply, tits or get the fuck out."}, {"time": 9214, "text": "I'm trying to understand what that, oh, oh, that's a way."}, {"time": 9221, "text": "I just, very slow."}, {"time": 9224, "text": "Oh, so that's, okay, so that's very disrespectful towards female members of the community."}, {"time": 9232, "text": "I don't understand."}, {"time": 9233, "text": "There's rules to this community and one of them is we're not very good with women."}, {"time": 9238, "text": "Is that, that's one of the rules?"}, {"time": 9239, "text": "It's more of a principle than a rule."}, {"time": 9242, "text": "It's a principle?"}, {"time": 9244, "text": "We're not going to ever get laid."}, {"time": 9246, "text": "That's fundamentally the principle."}, {"time": 9247, "text": "Is there other principles?"}, {"time": 9248, "text": "But we are gonna get pics."}, {"time": 9250, "text": "Pics."}, {"time": 9251, "text": "Sometimes on the internet."}, {"time": 9252, "text": "Sometimes they GTFO."}, {"time": 9255, "text": "Okay, so is there other actual principles of, so like it's, from my maybe naive perspective is they have like the darkest aspects of trolling, which is like take nothing serious, make a game out of everything."}, {"time": 9270, "text": "That's not 4chan per se."}, {"time": 9271, "text": "One of the things that you will learn in 4chan, which I think is very healthy, is if you have an idiosocratic or unique worldview or focus on an aspect of history or culture, you'll be able to find like minded people who you will engage with you and discuss it without being preemptively dismissive."}, {"time": 9289, "text": "That's an ideal that they."}, {"time": 9291, "text": "Well, it's not ideal."}, {"time": 9291, "text": "It's something that happens a lot."}, {"time": 9292, "text": "Now 4chan's not really, like Paul is their board with politics, but they will get into some, like the people there are much more erudite than you'd think."}, {"time": 9301, "text": "So they do take, my perception was they take nothing seriously."}, {"time": 9305, "text": "So there's things that they take seriously, like discussing ideas."}, {"time": 9309, "text": "There was a video someone posted of a girl who put kittens in a bag and threw it in a river."}, {"time": 9314, "text": "And they found out where she was within a day and got her like arrested."}, {"time": 9317, "text": "So yeah, they do take some things very seriously."}, {"time": 9321, "text": "But that's like an extreme that, I mean, that's good."}, {"time": 9325, "text": "First of all, that's heartwarming that they wouldn't somehow turn that into a thing."}, {"time": 9329, "text": "That feels like more of a, what is it?"}, {"time": 9331, "text": "What's the other one?"}, {"time": 9332, "text": "8chan?"}, {"time": 9333, "text": "8chan's twice as good as 4chan, yeah."}, {"time": 9336, "text": "That's their slogan."}, {"time": 9338, "text": "But it feels like they're the kind of community that would take that kitten situation and make a mockery of it."}, {"time": 9345, "text": "Yeah, they're darker than 4chan."}, {"time": 9347, "text": "I don't even, I'm not allowed to talk about 16chan."}, {"time": 9351, "text": "I'm already overwhelmed clearly by 4chan lingo."}, {"time": 9357, "text": "I literally wrote down in my notes, like in doing research for this conversation, I learned the word pleb."}, {"time": 9366, "text": "And I wanted to ask you what this pleb means."}, {"time": 9369, "text": "Do you know what pleb means?"}, {"time": 9373, "text": "I saw, I mean, actually, no, I don't."}, {"time": 9376, "text": "You know what a pleb is?"}, {"time": 9377, "text": "I just, I don't know what a pleb is."}, {"time": 9380, "text": "Like a plebiscite or plebeian."}, {"time": 9383, "text": "But does it mean something more sophisticated?"}, {"time": 9387, "text": "No, it's a very unsophisticated mechanism of being dismissive."}, {"time": 9390, "text": "Of like the regular people."}, {"time": 9392, "text": "Yeah, or someone who comes at me on Twitter."}, {"time": 9396, "text": "All right, so back to the 4chan alt right."}, {"time": 9399, "text": "Wasn't the... Those are very different concepts."}, {"time": 9401, "text": "Don't conflate them."}, {"time": 9403, "text": "But which internet culture was the alt right born out of?"}, {"time": 9408, "text": "Well, alt right was more born of blogs."}, {"time": 9411, "text": "And people had different blogs that were posting what they call like racial realism, which is scientific racism, so called."}, {"time": 9417, "text": "And breaking down issues from a racialist perspective."}, {"time": 9420, "text": "So that wasn't, 4chan is much more dynamic."}, {"time": 9423, "text": "It's a message board."}, {"time": 9424, "text": "It's very fluid."}, {"time": 9426, "text": "So it doesn't lend itself to these kind of in depth analysis of ideas or history."}, {"time": 9431, "text": "But it spreads them."}, {"time": 9432, "text": "Like it..."}, {"time": 9433, "text": "It spreads them as memes, yeah."}, {"time": 9435, "text": "And you know, but..."}, {"time": 9436, "text": "But it's not an essential mechanism of the alt right, historically?"}, {"time": 9442, "text": "So it was mostly about blogs."}, {"time": 9444, "text": "Okay, so what do you make of the psychology of this kind of worldview?"}, {"time": 9449, "text": "When you have..."}, {"time": 9450, "text": "This goes to your conspiracy theory subject earlier."}, {"time": 9453, "text": "When you have a little bit of knowledge about something, about history that no one's talking about, and there's only one group that is talking about it, and you have no alternative answers, you're going to be drawn to that group."}, {"time": 9467, "text": "So because issues about race, anti semitism, homophobia are so taboo in our culture, understandably there's good reasons."}, {"time": 9475, "text": "If you start putting things like, how old should you be to have sex with kids and just have regular conversations, eventually some people are gonna start taking some positions you don't like."}, {"time": 9482, "text": "So some things have to be sanctified to some extent."}, {"time": 9484, "text": "They're the only ones talking about it."}, {"time": 9486, "text": "You're gonna be drawn to that subculture."}, {"time": 9490, "text": "And where does the alt right stand now?"}, {"time": 9493, "text": "I mean, I hear that term used..."}, {"time": 9495, "text": "So the term has been weaponized by the corporate press for people that they want to read out of society."}, {"time": 9502, "text": "So it's used both on individual levels, like people like Gavin McIngus, Milo Yiannopoulos, some others."}, {"time": 9508, "text": "I mean, I think they've referred to Trump as alt right."}, {"time": 9511, "text": "And it's become a slur, just like incel or bot, that has become largely removed from its original meaning."}, {"time": 9519, "text": "Do you have a sense that there's still a movement that's alt right or like... Yeah, they call themselves now..."}, {"time": 9524, "text": "Okay, so there's something called the dissonant right."}, {"time": 9527, "text": "And they say, we're completely not like the alt right because the alt right's A, B, and C, and we're B, C, D. There's a huge overlap."}, {"time": 9534, "text": "It's very much the same people."}, {"time": 9537, "text": "Is there intellectuals that still represent some aspect of the movement?"}, {"time": 9541, "text": "I mean, sure."}, {"time": 9542, "text": "Are you tracking this?"}, {"time": 9543, "text": "Not that much anymore."}, {"time": 9545, "text": "I think they're..."}, {"time": 9546, "text": "I don't find it particularly as... Now that the book's done, I'm looking more into history for my next book."}, {"time": 9555, "text": "You mentioned communism?"}, {"time": 9556, "text": "I'm gonna talk a lot about the Cold War."}, {"time": 9559, "text": "So this kind of stuff has largely fallen away from my radar to some extent."}, {"time": 9564, "text": "And it's been a very effective movement to get them marginalized and silenced."}, {"time": 9569, "text": "So they're not as deep of a concern in terms of concern or not, just their impact on society."}, {"time": 9576, "text": "Yes, it's much lessened, yeah."}, {"time": 9578, "text": "So as a troll on Twitter, in the best sense of the word, what do you make of cancel culture?"}, {"time": 9585, "text": "I think it's Maoism."}, {"time": 9587, "text": "I mean, corporate America has done a far better job of implementing Maoism than the communist party ever could."}, {"time": 9592, "text": "You had this meeting not that long ago from I think it was Northwestern University Law School where everyone on the call got up and said that they were racist."}, {"time": 9599, "text": "I mean, this is something that legally you should be very averse to saying, even if it were true."}, {"time": 9604, "text": "And it's this kind of concept of getting up and confessing your sins before the collective is something completely."}, {"time": 9612, "text": "Oh, sorry, they admitted this of themselves?"}, {"time": 9614, "text": "Yeah, they were like, because they're saying because they're white, they're inherently racist."}, {"time": 9617, "text": "So my name's John, I'm a racist."}, {"time": 9618, "text": "My name's this, I'm a racist."}, {"time": 9620, "text": "You hear it and you're like, okay, this is Looney Tunes."}, {"time": 9622, "text": "So you're saying that, wow, that's so much, you took a step further."}, {"time": 9626, "text": "So you're saying there's like a deep underlying force that cancels culture."}, {"time": 9631, "text": "It's not just some kind of mob."}, {"time": 9633, "text": "Well, it's not a mob at all."}, {"time": 9635, "text": "It's a systemic organized movement being used for very nefarious purposes and to dominate an entire nation."}, {"time": 9645, "text": "How do we fight it?"}, {"time": 9646, "text": "Because I sense it inside."}, {"time": 9648, "text": "You know, I used to defend academia more because I still do to some extent."}, {"time": 9658, "text": "It's a nuanced discussion because, you know, like folks like Jordan Peterson and a lot of people that kind of attack academia, they refer, they really are talking about gender studies at certain departments."}, {"time": 9671, "text": "And me from MIT, you know, it's the University of Science and Engineering and the faculty there really don't think about these issues or haven't traditionally thought of, but it's beginning to even infiltrate there."}, {"time": 9686, "text": "It's the, you know, it's starting to infiltrate engineering and sciences outside of biology."}, {"time": 9692, "text": "Like let's put biology with the gender studies."}, {"time": 9695, "text": "Like I'm talking about sciences that really don't have anything to do with gender."}, {"time": 9700, "text": "It's starting to infiltrate and it worries me."}, {"time": 9705, "text": "I don't know exactly why, like I don't know exactly what the negative effect there would be, except it feels like it's anti intellectual."}, {"time": 9715, "text": "Oh yes, of course."}, {"time": 9717, "text": "And I'm not sure what to, because on the surface, it feels like a path towards progress."}, {"time": 9725, "text": "At first, when I'm like zoomed out, you know, just like squinting my eyes, you know, not even in detail looking at things, but when I actually joined the conversation to like listen in the conversation on quote unquote diversity, it quickly makes me realize that there's no interest in making a better world."}, {"time": 9749, "text": "No, no, it's about domination."}, {"time": 9751, "text": "It's about getting, yeah."}, {"time": 9753, "text": "It's a way for, if you are a lowest status white person, using anti racism is the only mechanism you will have to feel superior to another human being."}, {"time": 9763, "text": "So it's very useful for them in terms of fighting it."}, {"time": 9768, "text": "One of my suggestions has been to seize all university endowments, which are the crystallization of privilege and distribute that money as reparations."}, {"time": 9776, "text": "So be very effective by turning two populations against each other and strongly diminishing the university's intellectual hegemony."}, {"time": 9784, "text": "The universities are absolutely the real villains in the picture."}, {"time": 9788, "text": "Thankfully, they're also the least prepared to be aggressed upon."}, {"time": 9792, "text": "And after the government and the corporate press, they are the last leg of the stool, and they don't know what's coming, and it's gonna get ugly, and I cannot wait."}, {"time": 9801, "text": "So this is where you and I disagree."}, {"time": 9802, "text": "Part one, yeah, we disagree in the sense that you want to dismantle broken institutions."}, {"time": 9810, "text": "I don't think they're broken."}, {"time": 9811, "text": "They're powerful."}, {"time": 9812, "text": "They're working like by design."}, {"time": 9813, "text": "I think for over 100 years, they have been talking about bringing the next generation of American leaders, which is code, for promulgating an ideology based on egalitarian principles and world domination."}, {"time": 9827, "text": "Let me try to express my lived experience."}, {"time": 9831, "text": "My experience at MIT is that there's a bunch of administrators that are, the bureaucracy, that I can say, this is the nice thing about having a podcast, I don't give a damn, is they're pretty useless."}, {"time": 9847, "text": "In fact, they get in the way."}, {"time": 9849, "text": "But there's faculty, there's professors, that are incredible."}, {"time": 9855, "text": "They're incredible human beings that all they do all day, they're too busy, but for the most part, what they do all day is just like continually pursue different little trajectories of curiosities in the various avenues of science that they work on."}, {"time": 9873, "text": "And as a side effect of that, they mentor a group of students, sometimes a large group of students, and also teach courses, and they're constantly sharing their passion with others."}, {"time": 9885, "text": "And my experience is it's just a bunch of people who are curious about engineering and math and science, chemistry, artificial intelligence, computer science, what I'm most familiar with."}, {"time": 9897, "text": "And there's never this feeling of MIT being broken somehow, like this kind of feeling."}, {"time": 9904, "text": "Like if I talk to you just now, or like Eric Weinstein, there's a feeling like stuff is on fire, right?"}, {"time": 9911, "text": "There's something deeply broken."}, {"time": 9913, "text": "But when I'm in the system, especially before the COVID, before this kind of tension, everything was great."}, {"time": 9922, "text": "There was no discussion of, even diversity, all that kind of stuff, the toxic stuff that we might be talking about right now, none of that was happening."}, {"time": 9930, "text": "There was a bunch of people just in love with cool ideas, exploring ideas, being curious, and learning, and all that kind of stuff."}, {"time": 9938, "text": "So I don't, my sense of academia was this is the place where kids in their 20s, 30s, and 40s can continue the playground of science, having fun."}, {"time": 9950, "text": "It's, if you destroy academia, if you destroy universities, like you're suggesting kind of lessening their power, you take away the playground from these kids to play."}, {"time": 9961, "text": "It's gonna be hard for you to tell me that I'm anti playground."}, {"time": 9965, "text": "Yeah, well, I guess I'm saying you're anti certain kinds of playgrounds, which is."}, {"time": 9968, "text": "Yeah, the ones that have the broken glass on the floor."}, {"time": 9970, "text": "Yeah, I am against those kinds of playgrounds."}, {"time": 9974, "text": "No, you're, you're, you're."}, {"time": 9978, "text": "See, see."}, {"time": 9979, "text": "Now you see, now you listen."}, {"time": 9981, "text": "Now you, now you wait."}, {"time": 9982, "text": "Yeah, I would say you're being the watchful mother who, the one kid who hurt themselves in the glass."}, {"time": 9989, "text": "One kid, it's an entire, it's generation after generation."}, {"time": 9992, "text": "I'm not a watchful mother."}, {"time": 9993, "text": "I'm the guy with the flamethrower."}, {"time": 9994, "text": "No, I, I, I understand that."}, {"time": 9997, "text": "But you're using the one kid who was always kind of like weird, aka gender studies department."}, {"time": 10005, "text": "That, that hurt themselves on the glass, as opposed to the people who are like, obviously having fun in the playground and not playing by the glass, the broken glass."}, {"time": 10015, "text": "And they're just, I mean, to me, some of the best innovations in science happen in universities."}, {"time": 10022, "text": "You can't forget that universities don't have this liberal, like politics literally in every conversation until this year, until this year, there's something happening."}, {"time": 10036, "text": "But every conversation I've ever had had nothing to do with politics."}, {"time": 10040, "text": "We never, Trump never came up."}, {"time": 10042, "text": "None of that ever come up."}, {"time": 10044, "text": "Like all this kind of idea that there's liberal, all that."}, {"time": 10047, "text": "But that, that's in the humanities."}, {"time": 10050, "text": "But do you think MIT, Massachusetts Institute of Technology might be a little bit of an outlier?"}, {"time": 10054, "text": "Yeah, that probably is."}, {"time": 10056, "text": "But I, I don't, I honestly don't think when people criticize academia, they're looking at, they're in fact also picking the outliers, which is they're picking some of the quote unquote strongest gender studies departments."}, {"time": 10071, "text": "This is nonsensical."}, {"time": 10072, "text": "When I was at Bucknell, it was a college student."}, {"time": 10075, "text": "We had to take, you know, we had a bunch of electives and I wanted to take a class on individual, American individualism."}, {"time": 10081, "text": "One of the texts of the five that we had to read was Birth of a Nation, the movie about the Klan."}, {"time": 10088, "text": "So there's no department where these people are not thoroughgoing, hardcore ideologues."}, {"time": 10097, "text": "This is not a gender."}, {"time": 10098, "text": "That's the humanities, that's the humanities."}, {"time": 10099, "text": "Fine, all the humanities, not just gender studies."}, {"time": 10102, "text": "I can give you."}, {"time": 10103, "text": "Theory, English, all of them, every university, as you know, has it mandatory in the curriculum they have to take a bunch of these propaganda classes."}, {"time": 10115, "text": "I look forward to YouTube comments because you're being more eloquent and you're speaking to the thing that a lot of people agree with and I'm being my usual slow self and people are going to say not very nice things about me."}, {"time": 10126, "text": "Don't say anything that nice about Lex, please."}, {"time": 10130, "text": "Let me try to just."}, {"time": 10131, "text": "Just shoot up a school."}, {"time": 10132, "text": "That would be preferable."}, {"time": 10134, "text": "There he goes again."}, {"time": 10135, "text": "Only the teachers."}, {"time": 10136, "text": "Going to the darkest possible place."}, {"time": 10138, "text": "That's sunshine, baby, schools."}, {"time": 10139, "text": "That's where everyone goes to be happy, playgrounds."}, {"time": 10141, "text": "There he goes, dark ear."}, {"time": 10144, "text": "Just dives right in, just go dark and then just comes back up to the surface."}, {"time": 10150, "text": "I don't have to feel this way anymore."}, {"time": 10153, "text": "Just one day in the world."}, {"time": 10158, "text": "You're probably a figment of my imagination."}, {"time": 10159, "text": "I'm not even having this podcast."}, {"time": 10161, "text": "Well, after 18 Red Bulls, I'm surprised you could see anything."}, {"time": 10164, "text": "This is like Fight Club."}, {"time": 10165, "text": "Red Bull gives you delirium."}, {"time": 10169, "text": "I got into it with Ed Norton yesterday on Twitter."}, {"time": 10174, "text": "Is he like the rest of the celebrities?"}, {"time": 10175, "text": "Yeah, he's like, oh, this is an existential threat to America, Trump's a fascist."}, {"time": 10179, "text": "He's delegitimizing the Oval Office."}, {"time": 10181, "text": "I said, what an odd endorsement of Trump."}, {"time": 10184, "text": "Well, you should have went with a bad pit."}, {"time": 10185, "text": "He might have a different opinion."}, {"time": 10187, "text": "So Fight Club reference, okay."}, {"time": 10189, "text": "This conversation is over."}, {"time": 10193, "text": "I'd like to draw a line between science and engineering and science not including like the biological aspect, the parts of biology that touch and humanities and biology."}, {"time": 10204, "text": "Like I feel because humanities, if you just look at the percentage of universities, it's still a minority percentage."}, {"time": 10213, "text": "And I would actually draw a different, I think they serve very different purposes."}, {"time": 10219, "text": "And that's actually a broken part about universities about like, why is some of the best research in the world done at universities?"}, {"time": 10228, "text": "That doesn't, like there might be a different, like MIT, it feels weird that a faculty."}, {"time": 10234, "text": "Yeah, these are conceptually different things."}, {"time": 10235, "text": "Like we do research and we teach, why is this the same diagram?"}, {"time": 10238, "text": "Yeah, it feels weird."}, {"time": 10238, "text": "But that's just, but I'm also, I'm coming to like the defense of the engineers that never talk about, I'm not like, my mind isn't, I'm not like deluded or something where I'm not seeing the house on fire."}, {"time": 10253, "text": "I'm just saying, I am seeing the house because I also lived in Harvard Square."}, {"time": 10257, "text": "I'm seeing Harvard, but in."}, {"time": 10259, "text": "And you see the tanks coming?"}, {"time": 10260, "text": "They're coming, Lex."}, {"time": 10261, "text": "They're coming."}, {"time": 10262, "text": "It's gonna be so beautiful."}, {"time": 10263, "text": "It'll be like the American beauty, the plastic bag."}, {"time": 10266, "text": "I just won't be able to stop crying because it'll be so beautiful."}, {"time": 10268, "text": "Yeah, I can already see it."}, {"time": 10271, "text": "But the engineering departments where like, I believe that the Elon Musk's of the world, that the, like the innovation that will make a better world is happening."}, {"time": 10282, "text": "And like, let's not burn that down."}, {"time": 10285, "text": "Cause that has nothing to do with any, like they're all like sitting quietly in the, while like, while the humanities and all these kinds of diversity programs, they're not having any of these discussions."}, {"time": 10296, "text": "Listen, my Soviet brother, you both know, we both know that ice water runs in our veins."}, {"time": 10301, "text": "So if you're calling for mercy, that is not how I'm wired, but I'm not closing the door."}, {"time": 10306, "text": "Yeah, I'm actually realizing now, so for people listening to this, I'll probably prepend this in saying that I'm even slower than usual."}, {"time": 10314, "text": "I didn't sleep last night, but I feel I'm actually realizing just how slow I am and how much preparation I need to do."}, {"time": 10323, "text": "And if I would like to defend aspects of academia, I better come prepared."}, {"time": 10328, "text": "I don't think you need to defend them."}, {"time": 10329, "text": "I think I'm granting you your premise freely."}, {"time": 10332, "text": "No, you might be."}, {"time": 10334, "text": "I don't think the world is."}, {"time": 10336, "text": "But actually you just defeat your own argument because it is not at all have to be the way that a phenomenal research institution like MIT, which no one disputes, has to also be an educational establishment."}, {"time": 10348, "text": "These two things are not at all necessarily interconnected."}, {"time": 10352, "text": "But then you have to offer a way to separate."}, {"time": 10355, "text": "But like, I'm not a big fan, everybody's different, but I'm not a fan of criticizing institutions without offering a way to change."}, {"time": 10363, "text": "And especially when I'm like, have ability to change, I'd like to, yeah, I'd like to offer a path."}, {"time": 10370, "text": "What if they were in students, they were all mentor, like, what's the opposite of a mentor?"}, {"time": 10375, "text": "Mentee."}, {"time": 10376, "text": "Protege?"}, {"time": 10377, "text": "What's the term when you like."}, {"time": 10378, "text": "Graduate students."}, {"time": 10379, "text": "When you work at a place, like interns, not an intern, it's not the word I'm thinking of."}, {"time": 10382, "text": "But anyway, like basically they're working there instead of going to college there."}, {"time": 10386, "text": "It's possible, but it's going against tradition."}, {"time": 10388, "text": "And so you have to build new institutions and."}, {"time": 10391, "text": "And have these engineers building new things, that's crazy."}, {"time": 10395, "text": "These research engineers, where they're going to be building things."}, {"time": 10398, "text": "Well, one of the things, cause you're kind of a. Apprentice, that's the word I was looking at."}, {"time": 10402, "text": "Apprentice."}, {"time": 10403, "text": "Which is ironic, we're talking about Trump and we couldn't think of the word apprentice."}, {"time": 10406, "text": "Yeah, well done."}, {"time": 10408, "text": "We should both be fired."}, {"time": 10409, "text": "Yeah, there you go."}, {"time": 10411, "text": "These Russian Jews, so quick with their wit."}, {"time": 10415, "text": "But the thing is, you're a fan of freedom."}, {"time": 10418, "text": "And there is intellectual freedom."}, {"time": 10422, "text": "People, this is what I was trying to articulate, I'm failing to articulate, but there truly is complete intellectual freedom within universities on topics of science and engineering."}, {"time": 10436, "text": "I believe you, I agree with you."}, {"time": 10437, "text": "I don't think it's going to take much persuasion, but I'll give you an example."}, {"time": 10441, "text": "When that, I'm sure you know more details about this than I do."}, {"time": 10445, "text": "When that scientist engineered that probe to land on that comet, and the articles are written because this Hawaiian shirt he was wearing had like pinup girls on it, which I think his female student sewed for him or something, or his ex girlfriend."}, {"time": 10459, "text": "And he had to apologize."}, {"time": 10461, "text": "This is what Rand was talking about."}, {"time": 10463, "text": "That the great accomplishments of men have to say I'm sorry to the lowest, most despicable, disgusting people."}, {"time": 10474, "text": "Let me bring this case up because I think about this."}, {"time": 10477, "text": "This might not mean much to you, but it means a lot to certain aspects of the computer science community."}, {"time": 10482, "text": "There's a guy named Richard Stallman."}, {"time": 10484, "text": "I don't know if you know who that is."}, {"time": 10486, "text": "He's the founder of the Free Software Foundation."}, {"time": 10491, "text": "He's like a big Linux."}, {"time": 10492, "text": "He's one of the key people in the history of computer science, one of those open source people, right?"}, {"time": 10496, "text": "But he is like, I believe he's one of the hardcore ones, which is like all software should be free."}, {"time": 10502, "text": "Okay, so it's very interesting personality, very key person in the GNU, just like Linus Torvald, key person."}, {"time": 10510, "text": "So, but he also kind of speaks his mind."}, {"time": 10513, "text": "And on a certain chain of conversations at MIT that was leaked to the New York Times, then it was published, led him to be fired or pushed out of MIT recently, maybe a year ago."}, {"time": 10530, "text": "And it always sat weird with me."}, {"time": 10532, "text": "So what happened is there's a few undergraduate students that called Marvin Minsky."}, {"time": 10541, "text": "Not sure if you're familiar with who that is."}, {"time": 10542, "text": "I've heard the name."}, {"time": 10543, "text": "He's one of the seminal people in artificial intelligence."}, {"time": 10546, "text": "They said that they called him a rapist because he met with Jeffrey Epstein."}, {"time": 10553, "text": "And Jeffrey Epstein solicited, these are the best facts known to me that I'm aware of, that's what was stated on the chain, is he solicited a 17, but it might've been an 18 year old girl, to come up to Marvin Minsky and ask him if he wanted to have sex with her."}, {"time": 10573, "text": "So Jeffrey Epstein told the girl."}, {"time": 10576, "text": "She came up to Marvin Minsky, who was at that time, I think, seven years old."}, {"time": 10580, "text": "And his wife was there too, Marvin Minsky's wife."}, {"time": 10583, "text": "And he said no, or like awkwardly saying no thanks."}, {"time": 10588, "text": "And that was stated in the email thread as Marvin participating in sexual assault and rape of this unwilling sexual assault."}, {"time": 10603, "text": "And it was called rape of this person, right?"}, {"time": 10607, "text": "Of this woman that propositioned him."}, {"time": 10610, "text": "And then Richard Stallman, who's, he's kind of known for this."}, {"time": 10615, "text": "He's very, he's, you make fun of me being a robot, but he's kind of like a debugger."}, {"time": 10621, "text": "He's like, well, that sentence is not, what you said is not correct."}, {"time": 10625, "text": "So he like corrected the person, basically made it seem like the use of the word rape is not correct, because that's not the definition of rape."}, {"time": 10636, "text": "And then he was attacked for saying, oh, now you're playing with definitions of rape."}, {"time": 10641, "text": "Rape is rape is the answer, right?"}, {"time": 10643, "text": "And then that was leaked in him defending."}, {"time": 10647, "text": "So the way it was leaked, it was reported as him defending rape."}, {"time": 10655, "text": "That's the way it was reported."}, {"time": 10656, "text": "And he was pushed out and he didn't really give a damn."}, {"time": 10660, "text": "It's, he doesn't seem to make a big deal out of it."}, {"time": 10664, "text": "He just left."}, {"time": 10665, "text": "He made an example of him."}, {"time": 10666, "text": "They made an example and that, and that everyone was afraid to defend him."}, {"time": 10671, "text": "So like, there's a bunch of faculty."}, {"time": 10673, "text": "One."}, {"time": 10674, "text": "Dude, you're from the Soviet Union."}, {"time": 10674, "text": "Doesn't this hit close to home for you?"}, {"time": 10678, "text": "I don't know what to think of it."}, {"time": 10679, "text": "It hits close to home, but it was basically, at least at MIT, now MIT is such a light place with this."}, {"time": 10686, "text": "It's not common at MIT, but it was like 18, 19 year old kids, undergraduate kids with this kind of fire in them."}, {"time": 10694, "text": "There's just very few of them, but they're the ones that raise all this kind of fuss."}, {"time": 10699, "text": "And the entirety of the administration, all the faculty are afraid to stand up to them."}, {"time": 10706, "text": "It's so interesting to me."}, {"time": 10708, "text": "Like, I don't know if I should be afraid of that."}, {"time": 10711, "text": "You don't think you should be afraid that someone who's trying to be specific when it comes to charges of violent assault is looking for that clarity, can get their life out of search of his room?"}, {"time": 10720, "text": "Let me give you more context."}, {"time": 10723, "text": "There's a little bit more context to Richard Stallman, which is."}, {"time": 10726, "text": "He was also a rapist."}, {"time": 10729, "text": "I left out that part."}, {"time": 10730, "text": "He liked raping people."}, {"time": 10731, "text": "But he's had a history through his life of every once in a while wearing the Hawaiian shirt with, like he would make."}, {"time": 10741, "text": "He's a fat."}, {"time": 10744, "text": "Sorry, but he's a fat unattractive."}, {"time": 10746, "text": "Like what Trump referred to the hacker."}, {"time": 10748, "text": "Yeah, yeah, the guy in the basement."}, {"time": 10751, "text": "That's Richard."}, {"time": 10752, "text": "Okay, I love."}, {"time": 10754, "text": "He is what he is."}, {"time": 10756, "text": "He like, he would eat his own."}, {"time": 10758, "text": "He would pick skin from his feet in lectures and just eat it."}, {"time": 10763, "text": "Those videos of him doing that."}, {"time": 10765, "text": "He must really be behind the spectrum then."}, {"time": 10768, "text": "And you know, I think in his office, door, he wrote something like hacker plus lover of ladies or something like that."}, {"time": 10785, "text": "Like something kind of."}, {"time": 10788, "text": "Unprofessional."}, {"time": 10790, "text": "Yeah, unprofessional."}, {"time": 10790, "text": "And a little creepy."}, {"time": 10792, "text": "No, that's fair."}, {"time": 10793, "text": "So he was also."}, {"time": 10794, "text": "So they're looking for an excuse to get rid of him, it sounds like."}, {"time": 10798, "text": "No, he was just, who's they?"}, {"time": 10800, "text": "The administration."}, {"time": 10802, "text": "Yeah, probably, probably."}, {"time": 10804, "text": "A lot of times what people don't realize, and this would be my defense of cancel culture."}, {"time": 10808, "text": "A lot of times when someone gets fired over something like this, this isn't why."}, {"time": 10812, "text": "This is just giving them cover to get rid of them without getting a lawsuit."}, {"time": 10815, "text": "Yeah, but it's still."}, {"time": 10817, "text": "Right, so I think, I guess what I'm trying to communicate is he was a little weird and creepy and he may not be the best for the community, but that's not necessarily the message it's sent to the rest of the community."}, {"time": 10831, "text": "The message is sent to the rest of the community that being clear about words or the usage of the word rape is like you should call everything rape."}, {"time": 10841, "text": "That's basically the message it was sent."}, {"time": 10844, "text": "Or you should call it we say rape, rape."}, {"time": 10846, "text": "It's about submission."}, {"time": 10848, "text": "I think you'd be very happy to know that there's a lot of people, and she's very crucified of this, like Betsy DeVos, the performance department of education, who are aware of this."}, {"time": 10858, "text": "They are aware that this completely contradicts due process."}, {"time": 10861, "text": "They're aware of how a rape accusation is something not to be taken seriously, but because it's not to be taken seriously, it has to be also taken seriously in the other context that once that word is around a male, this can ruin his entire life."}, {"time": 10873, "text": "That's the sticky thing of the word."}, {"time": 10877, "text": "Like I, like I think about this a lot that, like how would I defend it if somebody, like I've never, I can honestly say I've never done anything close to creepy in my life like with women."}, {"time": 10894, "text": "But you wouldn't know it if you had, right?"}, {"time": 10897, "text": "A lot of these creepy guys don't think they're creepy."}, {"time": 10899, "text": "They think they're being cute."}, {"time": 10900, "text": "Yeah, but I'm just telling you, even like, fine, let's say, right, let's say I'm not aware of it."}, {"time": 10907, "text": "But the point that I am aware of is that somebody could just completely make something up."}, {"time": 10912, "text": "Correct, yeah, yeah, yeah, yeah, okay."}, {"time": 10914, "text": "And like how, what would I?"}, {"time": 10915, "text": "No, he denied the charges."}, {"time": 10917, "text": "There's an article around everything he did, supposedly, and it goes, Mr. Friedman denied the charges, yeah."}, {"time": 10922, "text": "But what creeps me out?"}, {"time": 10924, "text": "That happened, can I interrupt?"}, {"time": 10925, "text": "Zora Neale Hurston is one of my favorite writers."}, {"time": 10927, "text": "She's from the Harlem Renaissance."}, {"time": 10929, "text": "She wrote, Their Eyes Are Watching God, and a couple of other books."}, {"time": 10932, "text": "She was just an amazing, amazing figure."}, {"time": 10934, "text": "Her biography is called Wrapped in Rainbows."}, {"time": 10936, "text": "It's just a masterpiece."}, {"time": 10937, "text": "I think I read it one day."}, {"time": 10938, "text": "Can't recommend her enough."}, {"time": 10939, "text": "Fascinating, fascinating woman."}, {"time": 10941, "text": "During the 30s, I think it was, or 1940, she was out of the country."}, {"time": 10946, "text": "She was accused of molesting a teenage boy."}, {"time": 10949, "text": "She wasn't in America."}, {"time": 10951, "text": "This could be proven."}, {"time": 10953, "text": "So it's absolutely false, not even a question."}, {"time": 10956, "text": "She was indicted, and she wanted to kill herself because she's like, people are gonna see these things, and they're gonna think maybe there's some truth to it."}, {"time": 10965, "text": "Maybe it's voluntary."}, {"time": 10966, "text": "What they're just gonna, and you could understand why she'd be suicidal over this."}, {"time": 10970, "text": "So yeah, this is something that's been going on for a long time, and the fact that it's becoming, I do agree, it's important."}, {"time": 10977, "text": "I know a lot of women who have been sexually assaulted, more than I'm happy that I know."}, {"time": 10981, "text": "And if I know that many, that means there's more."}, {"time": 10983, "text": "So I think it's a good idea that they feel seen, that they don't feel wounded, they don't feel damaged, that they could talk to their friends."}, {"time": 10992, "text": "And I'm like, man, this sucks is happening to you."}, {"time": 10993, "text": "And I don't think you're a slut."}, {"time": 10995, "text": "I don't think you're asking for it."}, {"time": 10996, "text": "I think you feel violated."}, {"time": 10997, "text": "I think it's gross."}, {"time": 10999, "text": "Talk to me."}, {"time": 11000, "text": "I do think that that's important."}, {"time": 11001, "text": "And I also think it's important though, when things get kind of in a frenzy, that a lot of people are like, yeah, I also had something happen."}, {"time": 11009, "text": "And very quickly the line between he grabbed my boob and he violently raped me, I don't think these two things are the same at all."}, {"time": 11017, "text": "I think they're both sexual assault, but in terms of what someone can deal with the next day, the next month, 10 years later, I don't think they're similar scenarios."}, {"time": 11027, "text": "I had Juanita Brodrick on my show and hearing her talk about her alleged rape by Bill Clinton was very disturbing for me, very disturbing to hear."}, {"time": 11036, "text": "Because it was like half an hour."}, {"time": 11038, "text": "So we think of these things and think, okay, hold her down, blah, blah, blah."}, {"time": 11041, "text": "And then it's done."}, {"time": 11042, "text": "Half an hour when, just even someone physically holding you down for half an hour."}, {"time": 11046, "text": "Like not even a sexual assault."}, {"time": 11048, "text": "Like that's traumatic."}, {"time": 11049, "text": "You think, your brain's gonna think, am I gonna die?"}, {"time": 11052, "text": "When I zoom out, I think that ultimately this is gonna lead to a better world."}, {"time": 11058, "text": "Like empowering women to speak to those kinds of experiences, the benefit of it outweighs the..."}, {"time": 11067, "text": "The issue is whenever people are given a weapon, some are going to use it in nefarious ways."}, {"time": 11073, "text": "And that's the lesson of history."}, {"time": 11074, "text": "Males, females, whites, blacks, children, adults."}, {"time": 11078, "text": "When people are given a mechanism to execute power over others, some are gonna use it."}, {"time": 11083, "text": "Can I ask you for a therapy thing?"}, {"time": 11088, "text": "On trolling, in a sense."}, {"time": 11091, "text": "Because I mentioned somebody making up something about me."}, {"time": 11095, "text": "I feel, because I wear my heart on my sleeve, I'm not good with these attacks."}, {"time": 11101, "text": "Like I've been attacked recently, just being called a fraud and all that kind of stuff."}, {"time": 11106, "text": "Just light stuff."}, {"time": 11107, "text": "Like I haven't, you know, it was like, it hurt."}, {"time": 11111, "text": "Okay, well, let me help you."}, {"time": 11113, "text": "Maybe it's because I'm a New Yorker."}, {"time": 11117, "text": "In New York, a lot of times you'll be walking with your friend and a homeless person will come up to you and start yelling things at you."}, {"time": 11126, "text": "Your reaction isn't in those circumstances."}, {"time": 11129, "text": "Let me hear this out."}, {"time": 11131, "text": "Your reaction is physical safety and getting away."}, {"time": 11135, "text": "Now, it's not impossible that that homeless person is actually saying the truth."}, {"time": 11139, "text": "This happened to a friend of mine."}, {"time": 11142, "text": "This guy wasn't homeless and he's walking down the street on Smith Street and he's just talking out loud."}, {"time": 11148, "text": "And he goes, why they call them hipsters?"}, {"time": 11150, "text": "What are they hip to?"}, {"time": 11152, "text": "And she chuckles."}, {"time": 11153, "text": "And he goes, what are you laughing at, fatso?"}, {"time": 11155, "text": "You start something, I'll finish it."}, {"time": 11157, "text": "And she just couldn't move."}, {"time": 11159, "text": "And it's like, it's my main problem because that's the first thing he went to."}, {"time": 11164, "text": "And I don't know that I have any advice, but when you hear something like this, I think you need to be better in terms of boundaries."}, {"time": 11173, "text": "I think you should not perceive this as a fellow human, but as a crazy homeless person, because if this fellow human, if I thought that you were a fraud in some context, that's a very weird word to use because fraudulent podcaster, these are real mics, but if I thought."}, {"time": 11189, "text": "Well, a scientist or a human."}, {"time": 11191, "text": "Sure, but I would ask myself, is this person in a position to make this judgment or are they backing it up?"}, {"time": 11197, "text": "Are they saying, here, your conclusions were wrong, here's some mistakes in your data and you can engage with them in ideas, but whenever someone uses a word to entirely dismiss your life without having the knowledge of your life, you do not have to take that seriously."}, {"time": 11213, "text": "I appreciate that kind of idea, but some things aren't about data, like I see myself as a fraud often and it's more psychology of it."}, {"time": 11226, "text": "If I can reduce something to reason, I can probably be fine."}, {"time": 11231, "text": "My worry is the same as the worry of teenage girls that get bullied online."}, {"time": 11236, "text": "It's like when I'm being open and fragile on the internet, it affects me in a way where I can't, the reason doesn't help."}, {"time": 11243, "text": "So it helps me, but."}, {"time": 11244, "text": "You don't block people enough."}, {"time": 11246, "text": "I'm very heavy with the blocking."}, {"time": 11247, "text": "No, so yeah, I block."}, {"time": 11249, "text": "Very heavy."}, {"time": 11250, "text": "I block, it's helped a lot."}, {"time": 11251, "text": "Any aggressive banality, I block immediately."}, {"time": 11254, "text": "I also think time is gonna help."}, {"time": 11256, "text": "I don't think you're, like you didn't grow up wanting to be a podcaster, right?"}, {"time": 11260, "text": "That wasn't your aspiration."}, {"time": 11261, "text": "So in some sense, you are gonna feel like a fraud because you're like, I don't have any training for this."}, {"time": 11265, "text": "I have a training for a scientist."}, {"time": 11266, "text": "I can talk to you about artificial intelligence for literally hours, but in terms of this, like I don't know what I'm doing."}, {"time": 11270, "text": "I'm kind of, so when they call you a fake, it's like, yeah, you're kind of right because like I did kind of stumble into this and this is not my pedigree."}, {"time": 11279, "text": "So I think that kind of probably speaks to you on some level."}, {"time": 11282, "text": "Well, but they're attacking not the podcast thing, but more like the same, people call Elon Musk a fraud too, which that's the way I rationalize it."}, {"time": 11291, "text": "Like, well, if they're calling him a fraud and they're calling me a fraud, like even if you have rockets that go into, like if you successfully have rockets landing back on earth, reusable rockets, you're still being called a fraud, then it's okay."}, {"time": 11311, "text": "It could be that he's not a fraud."}, {"time": 11312, "text": "You really are."}, {"time": 11315, "text": "That's, but it's not resonating with you because your brain knows the logic."}, {"time": 11318, "text": "So you can't trick yourself."}, {"time": 11319, "text": "But yeah, yeah."}, {"time": 11322, "text": "But I don't know, this whole trolling thing, you seem to be much better at seeing it as a game."}, {"time": 11331, "text": "Because you are under the delusion that every human being is capable of intelligent reasoned decisions."}, {"time": 11337, "text": "Still think I'm right."}, {"time": 11338, "text": "And I perceive them as literally animals."}, {"time": 11341, "text": "So when a dog starts barking, all it's saying is that the dog is agitated and this is not going to change my life one iota other than crossing the street, perhaps."}, {"time": 11349, "text": "Yeah, I'm going to prove you wrong one day."}, {"time": 11352, "text": "You're going to kill yourself because they can drive you to it."}, {"time": 11355, "text": "The first shoot up of school."}, {"time": 11357, "text": "But if I don't, I'll prove you wrong."}, {"time": 11359, "text": "I'll bring the data."}, {"time": 11360, "text": "And they'd be like, you're right, Lex."}, {"time": 11362, "text": "I have the receipts."}, {"time": 11364, "text": "Okay, so we mentioned Camus."}, {"time": 11367, "text": "Oh yeah, I love him."}, {"time": 11369, "text": "Is there, this is a question that people like love when I ask."}, {"time": 11375, "text": "I'm a really smart people."}, {"time": 11377, "text": "What it is, love?"}, {"time": 11379, "text": "No, what books, let's say three books, if you can think of them, technical, fiction, philosophical, would you, had a big impact on you or would you recommend to others?"}, {"time": 11394, "text": "The Machiavellians by James Burnham."}, {"time": 11396, "text": "This is a book about how politics works in reality as opposed to how people imagine it working."}, {"time": 11403, "text": "Mentis Moldbug, who's a figure in these circles, who's respected by a lot of people."}, {"time": 11407, "text": "I was giving a talk and there was a bunch of panelists and we were asked, what book would you recommend?"}, {"time": 11412, "text": "I said, The Machiavellians."}, {"time": 11414, "text": "Independently of me, that was the book he had recommended."}, {"time": 11417, "text": "It's out of print, it's hard to find, but that would be one."}, {"time": 11419, "text": "Is that his book or no?"}, {"time": 11420, "text": "James Burnham, it came out in 1941, I think."}, {"time": 11423, "text": "So can you pause on the, what's his?"}, {"time": 11426, "text": "Mentis Moldbug."}, {"time": 11428, "text": "That's a code name, right?"}, {"time": 11429, "text": "That guy's pen name."}, {"time": 11431, "text": "Curtis Yarvin, that's his real name."}, {"time": 11433, "text": "He swims in your circles."}, {"time": 11435, "text": "Which circles?"}, {"time": 11436, "text": "He does some kind of programming."}, {"time": 11437, "text": "Oh, he's originally a programmer."}, {"time": 11438, "text": "Yeah, he comes up as a person that I should talk with or I should know about, but then I read a few of his things and they seem quite dangerous."}, {"time": 11449, "text": "They're very long and verbose, but I think he's an amazing thinker."}, {"time": 11453, "text": "But he's the one who had the idea of sending the tanks to Harvard Yard."}, {"time": 11456, "text": "But doesn't he have like, he has some radical views."}, {"time": 11461, "text": "I forget what they are."}, {"time": 11462, "text": "Very radical views, yeah, he wants a military coup."}, {"time": 11466, "text": "But you're saying he's a serious thinker that is worthy of, not worthy."}, {"time": 11471, "text": "I don't know that you would enjoy having a conversation with him."}, {"time": 11474, "text": "I think a lot of people enjoy seeing it happen, but I think it would be a lot of talking past each other and it would be interesting."}, {"time": 11480, "text": "What do you agree?"}, {"time": 11481, "text": "I didn't agree with him to watch."}, {"time": 11482, "text": "What do you disagree, okay."}, {"time": 11484, "text": "What do you agree, what do you disagree with him?"}, {"time": 11485, "text": "I agree with him that politics has to be looked at objectively and without kind of an emotional connection to different schools."}, {"time": 11494, "text": "I talk about him a lot in my book on the New Right."}, {"time": 11498, "text": "Disagree, I don't think a military coup is a good idea."}, {"time": 11502, "text": "He doesn't think anarchism is stable, I disagree."}, {"time": 11507, "text": "I mean, me and him, I did a live stream with him which just dorked out a lot about history and people who've fallen in the memory hole."}, {"time": 11512, "text": "So, I mean, he's got a lot of writing, so."}, {"time": 11516, "text": "So, you know, the sense I got from him was that if I talk with him, a lot of people would be upset with me for giving him a platform."}, {"time": 11525, "text": "Yeah, I think he's on that edge where they want to read him out of what is acceptable discourse."}, {"time": 11531, "text": "What's his most controversial, I mean, you keep mentioning the tanks."}, {"time": 11535, "text": "Is that the most controversial viewpoint?"}, {"time": 11537, "text": "Does he have a race thing?"}, {"time": 11538, "text": "No, the alt right doesn't particularly like him in many ways because he's not a big on the race thing."}, {"time": 11544, "text": "I don't know what would be his most controversial view, to be honest."}, {"time": 11548, "text": "I think because he is radical in terms of his analysis of culture, anytime someone's a radical, that is dangerous."}, {"time": 11555, "text": "Yeah, it's dangerous."}, {"time": 11556, "text": "Okay, book, so that's one."}, {"time": 11561, "text": "Which is a, I would say."}, {"time": 11563, "text": "Not Atlas Shrugged?"}, {"time": 11564, "text": "No, and if you read Atlas Shrugged before reading The Fountainhead, you're doing yourself an enormous disservice."}, {"time": 11568, "text": "Don't you dare do it."}, {"time": 11569, "text": "On the philosophical or because the novel is better?"}, {"time": 11572, "text": "On every level."}, {"time": 11573, "text": "Fountainhead's a better novel."}, {"time": 11574, "text": "Fountainhead's superfluous if you read Atlas Shrugged first."}, {"time": 11577, "text": "Fountainhead's about psychology and ethics."}, {"time": 11580, "text": "It does not have to do with her politics other than its implications."}, {"time": 11583, "text": "So it's by far the superior book."}, {"time": 11586, "text": "The third one."}, {"time": 11588, "text": "Ooh, this is a good one question."}, {"time": 11590, "text": "There's so many good books out there that I love."}, {"time": 11593, "text": "I'm going to, this is not really my third choice, but I'll throw it out there because I, this is such an important worldview, especially for people on the right."}, {"time": 11602, "text": "Are you virtue signaling?"}, {"time": 11604, "text": "No, this is counter signaling."}, {"time": 11606, "text": "Thaddeus Russell's book, A Renegade History of the United States."}, {"time": 11609, "text": "His thesis is that it's the degenerates that give us all freedom."}, {"time": 11616, "text": "And things like prostitutes, things like madams, things like slaves, things like immigrants, because they were so low status, they could get away with things that then people who are higher status demanded and so on and so forth."}, {"time": 11628, "text": "So I think that thesis, and it really has extreme consequences in thinking."}, {"time": 11637, "text": "And no, Jonathan Haidt, The Righteous Mind."}, {"time": 11639, "text": "That's, those are the four."}, {"time": 11642, "text": "Is that his best?"}, {"time": 11643, "text": "I haven't read any of his stuff."}, {"time": 11644, "text": "The Righteous Mind is the only one you want."}, {"time": 11646, "text": "Okay, that was four, but of course."}, {"time": 11650, "text": "Forget Thaddeus Russell, put Haidt in there."}, {"time": 11652, "text": "Of course he would."}, {"time": 11654, "text": "No, forget Thaddeus, those are the three."}, {"time": 11657, "text": "So we talked about love."}, {"time": 11658, "text": "Let me ask you the other question I'm obsessed with."}, {"time": 11662, "text": "Are you, do you ponder your own mortality?"}, {"time": 11666, "text": "I do, a lot, especially now that I'm an uncle, especially now that I have like these younger people that I mentor."}, {"time": 11673, "text": "I was just yesterday, my friend, John Girguis, who did my theme song for my podcast, who did the book cover for Dear Reader, who's like the most talented person I know."}, {"time": 11682, "text": "His song came on the iPod at the gym and I almost messaged him."}, {"time": 11686, "text": "I go, you know, one day one of us is gonna bury the other and it's gonna be really sad."}, {"time": 11690, "text": "And I thought about that and it was kind of like, oh man, that's really gonna suck."}, {"time": 11694, "text": "And I don't know which scenario would be better."}, {"time": 11696, "text": "Like I will be very sad if he's gone."}, {"time": 11698, "text": "I'm sure he'd be very sad if I'm gone."}, {"time": 11701, "text": "I mean, what do you, are you afraid of it?"}, {"time": 11703, "text": "No, you know, Rand had this quote about how I won't die, the world will end."}, {"time": 11710, "text": "So I've had enough experiences that I am, I've really, at this point, and everything's icing on the cake."}, {"time": 11718, "text": "So if you, if I were to kill you at the end of this podcast, it feels painless."}, {"time": 11724, "text": "That would be okay?"}, {"time": 11725, "text": "Yeah, you know why?"}, {"time": 11726, "text": "Does anyone know you're here by the way?"}, {"time": 11730, "text": "Just asking for a friend."}, {"time": 11732, "text": "Here's why, there's that wit."}, {"time": 11734, "text": "Save that for Twitter likes."}, {"time": 11737, "text": "Do they call you Sasha?"}, {"time": 11738, "text": "No, I'm a Lyosha."}, {"time": 11740, "text": "Oh, that's my sister's husband."}, {"time": 11741, "text": "Okay, so here's why."}, {"time": 11745, "text": "I strongly believe, and this is a very kind of Jewish perspective, that you just have to leave the world a little bit better than you found it."}, {"time": 11752, "text": "That all you could do is move the needle a little."}, {"time": 11754, "text": "And one of the things I set out to do with Dear Reader, my book on North Korea, I was at a point in my career where I could do something to make a difference instead of just writing, like coauthoring books for celebrities, which I'm very proud of, but are neither here nor there."}, {"time": 11767, "text": "And I thought, all right, I know how to tell stories, I know how to inform people, I know how to entertain people."}, {"time": 11772, "text": "If I move the needle in America, who cares?"}, {"time": 11774, "text": "We got it really good here."}, {"time": 11775, "text": "If I move the needle in North Korea a little bit, the cost benefits through the roof."}, {"time": 11780, "text": "I never thought of that actually."}, {"time": 11782, "text": "I never thought of Dear Reader from that perspective."}, {"time": 11784, "text": "So when I set out to write it, I'm like, okay, what can I do?"}, {"time": 11788, "text": "I'm not gonna be able to liberate the North Korean regime."}, {"time": 11790, "text": "What I can do is the camera right now is focused on, at the time, Kim Jong Il, now Kim Jong Un."}, {"time": 11796, "text": "And I can do just this a little bit."}, {"time": 11798, "text": "And I go, behind that guy, who you think is funny clown, there's millions of dead people."}, {"time": 11804, "text": "There's children being starved."}, {"time": 11806, "text": "There's people who are performing because they have a gun to their kid's head."}, {"time": 11809, "text": "And if someone put a gun to your kid's head, you'd put on those dancing shoes real quick."}, {"time": 11813, "text": "And I and others have managed to change the conversation about North Korea in terms of look at those silly buffoons to those poor people."}, {"time": 11822, "text": "So the fact that that little thing I can say with a straight face, I did, doesn't make me a great person, but it does make me someone who, if I have to go tomorrow, I can say I did a little bit to make the world a better place."}, {"time": 11841, "text": "I think the meaning of life is... Why are we here?"}, {"time": 11847, "text": "Oh, well, I'm a Camu person."}, {"time": 11849, "text": "So I'll give the Camu answer."}, {"time": 11851, "text": "So there's two types of people."}, {"time": 11853, "text": "Those who know how to use binary... No."}, {"time": 11855, "text": "There's..."}]}]