[{"title": "Boris Sofman: Waymo, Cozmo, Self-Driving Cars, and the Future of Robotics | Lex Fridman Podcast #241", "id": "U_AREIyd0Fc", "quotes": [{"time": 394, "text": "But you sometimes end up getting a far more beautiful output because you're pushing at the extremes of this emotional space in a way that you just wouldn't because you get lost in the surface area if you have like something that is just infinitely articulable."}, {"time": 409, "text": "So if we backtrack a little bit and you thought of Cosmo in 2011 and 2013 actually designed and built it."}, {"time": 409, "text": "What is Anki?"}, {"time": 409, "text": "What is Cosmo?"}, {"time": 409, "text": "I guess, who is Cosmo?"}, {"time": 409, "text": "And what was the vision behind this incredible little robot?"}, {"time": 426, "text": "We started Anki back while we were still in graduate school."}, {"time": 426, "text": "So myself and my two cofounders, we were PhD students in the Robotics Institute at Carnegie Mellon."}, {"time": 426, "text": "And so we were studying robotics, AI, machine learning, different areas."}, {"time": 443, "text": "One of my cofounders was working on walking robots for a period of time."}, {"time": 443, "text": "And so we all had a bit of a deeper passion for applications of robotics and AI where there's like a spectrum where there's people that get really fascinated by the theory of AI and machine learning robotics where whether it gets applied in the near future or not is less of a factor on them, but they love the pursuit of the challenge."}, {"time": 468, "text": "And that's necessary."}, {"time": 468, "text": "And there's a lot of incredible breakthroughs that happened there."}, {"time": 468, "text": "We're probably closer to the other end of the spectrum where we love the technology and all the evolution of it, but we were really driven by applications, like how can you really reinvent experiences and functionality and build value that wouldn't have been possible without these approaches."}, {"time": 487, "text": "And that's what drove us."}, {"time": 487, "text": "And we had some experiences through previous jobs and internships where we got to see the applied side of robotics."}, {"time": 487, "text": "And at that time, there was actually relatively few applications of robotics that were outside of peer research or industrial applications, military applications and so forth."}, {"time": 506, "text": "There were very few outside of it."}, {"time": 506, "text": "So maybe iRobot was like one exception and maybe there are a few others, but for the most part, there weren't that many."}, {"time": 506, "text": "And so we got excited about consumer applications of robotics where you could leverage way higher levels of intelligence through software to create value and experiences that were just not possible in those fields today."}, {"time": 527, "text": "And we saw kind of a pretty wide range of applications that varied in the complexity of what it would take to actually solve those."}, {"time": 527, "text": "And what we wanted to do was to commercialize this into a company, but actually do a bottoms up approach where we could have a huge impact in a space that was ripe to have an impact at that time and then build up off of that and move into other areas."}, {"time": 548, "text": "And then entertainment became the place to start because you had relatively little innovation in the toy space and entertainment space."}, {"time": 548, "text": "You had these really rich experiences in video games and movies, but there was like this chasm in between."}, {"time": 561, "text": "And so we thought that we could really reinvent that experience."}, {"time": 561, "text": "And there was a really fascinating transition technically that was happening at the time where the cost of components was plummeting because of the mobile phone industry and then the smartphone industry."}, {"time": 575, "text": "And so the cost of a microcontroller, of a camera, of a motor, of memory, of microphones, cameras was dropping by orders of magnitude."}, {"time": 575, "text": "And then on top of that with iPhone coming out in 2000, I think it was 2007, I believe, it started to become apparent within a couple of years that this could become a really incredible interface device and the brain with much more computation behind a physical world experience that wouldn't have been possible previously."}, {"time": 598, "text": "And so we really got excited about that and how we push all the complexity from the physical world into software by using really inexpensive components, but putting huge amounts of complexity into the AI side."}, {"time": 617, "text": "And so Cosmo became our second product and then the one that we're probably most proud of."}, {"time": 617, "text": "The idea there was to create a physical character that had enough understanding and awareness of the physical world around it and the context that mattered to feel like he was alive."}, {"time": 632, "text": "And to be able to have these emotional connections and experiences with people that you would typically only find inside of a movie."}, {"time": 632, "text": "And the motivation very much was Pixar."}, {"time": 632, "text": "We had an incredible respect and appreciation for what they were able to build in this really beautiful fashion and film."}, {"time": 651, "text": "But it was always like, one, it was virtual and two, it was like a story on rails that had no interactivity to it."}, {"time": 651, "text": "It was very fixed and it obviously had a magic to it, but where you really start to hit a different level of experiences when you're actually able to physically interact with a robot."}, {"time": 666, "text": "And then that was your idea with Anki, like the first product was the cars."}, {"time": 666, "text": "So basically you take a toy, you add intelligence into it in the same way you would add intelligence into AI systems within a video game, but you're not bringing it into the physical space."}, {"time": 683, "text": "So the idea is really brilliant, which is you're basically bringing video games to life."}, {"time": 689, "text": "We literally use that exact same phrase because in the case of Drive, this was a parallel of the racing genre."}, {"time": 689, "text": "And the goal was to effectively have a physical racing experience, but have a virtual state at all times that matches what's happening in the physical world."}, {"time": 707, "text": "And then you can have a video game off of that and you can have different characters, different traits for the cars, weapons and interactions and special abilities and all these sort of things that you think of virtually, but then you can have it physically."}, {"time": 720, "text": "And one of the things that we were really surprised by that really stood out and immediately led us to really accelerate the path towards Cosmo is that things that feel like they're really constrained and simple in the physical world, they have an amplified impact on people."}, {"time": 735, "text": "The exact same experience virtually would not have anywhere near the impact, but seeing it physically really stood out."}, {"time": 740, "text": "And so effectively with Drive, we were creating a video game engine for the physical world."}, {"time": 746, "text": "And then with Cosmo, we expanded that video game engine to create a character and kind of an animation and interaction engine on top of it that allowed us to start to create these much more rich experiences."}, {"time": 761, "text": "And a lot of those elements were almost like a proving ground for what would human robot interaction feel like in a domain that's much more forgiving, where you can make mistakes in a game."}, {"time": 771, "text": "It's okay if a car goes off the track or if Cosmo makes a mistake."}, {"time": 777, "text": "And what's funny is actually we were so worried about that."}, {"time": 780, "text": "In reality, we realized very quickly that those mistakes can be endearing, and if you make a mistake, as long as you realize you made a mistake and have the right emotional reaction to it, it builds even more empathy with the character."}, {"time": 791, "text": "So when the thing you're optimizing for is fun, you have so much more freedom to fail, to explore, and also in the toy space."}, {"time": 800, "text": "Like all of this is really brilliant, and I gotta ask you backtrack, it seems for a roboticist to take a jump into the direction of fun is a brilliant move."}, {"time": 813, "text": "Because one, you have the freedom to explore and to design all those kinds of things."}, {"time": 817, "text": "And you can also build cheap robots."}, {"time": 820, "text": "If you're not chasing perfection and toys, it's understood that you can go cheaper, which means a robot is still expensive, but it's actually affordable by a large number of people."}, {"time": 833, "text": "So it's a really brilliant space to explore."}, {"time": 836, "text": "And in fact, we realized pretty quickly that perfection is actually not fun."}, {"time": 840, "text": "Because in a traditional roboticist sense, the first kind of path planner, and this is the part that I worked on out of the gate, was a lot of the AI systems where you have these vehicles and cars racing, making optimal maneuvers to try to get ahead."}, {"time": 856, "text": "And you realize very quickly that that's actually not fun because you want the chaos from mistakes."}, {"time": 862, "text": "And so you start to kind of intentionally almost add noise to the system in order to kind of create more of a realism in the exact same way the human player might start really ineffective and inefficient and then start to kind of increase their quality bar as they progress."}, {"time": 877, "text": "And there is a really, really aggressive constraint that's forced on you by being a consumer product where the price point matters a ton, particularly in kind of an entertainment where you can't make a $1,000 product unless you're going to meet the expectations of a $1,000 product."}, {"time": 893, "text": "And so in order to make this work, your cost of goods had to be well under $100."}, {"time": 900, "text": "In the case of Cosmo, we got it under $50 end to end, fully packaged and delivered."}, {"time": 904, "text": "And it was under $200 cost at retail."}, {"time": 909, "text": "Okay, if we sit down like at the early stages, if we go back to that and you're sitting down and thinking about what Cosmo looks like from a design perspective and from a cost perspective, I imagine that was part of the conversation."}, {"time": 923, "text": "Well, first of all, what came first?"}, {"time": 923, "text": "Did you have a cost in mind?"}, {"time": 923, "text": "Is there a target you're trying to chase?"}, {"time": 930, "text": "Did you have a vision in mind, like size?"}, {"time": 930, "text": "Did you have, because there's a lot of unique qualities to Cosmo."}, {"time": 935, "text": "So for people who don't know, they should definitely check it out."}, {"time": 935, "text": "There's a display, there's eyes on the little display and those eyes can, it's pretty low resolution eyes, right?"}, {"time": 944, "text": "But they're still able to convey a lot of emotion."}, {"time": 947, "text": "And there's this arm, like that sort of lift stuff."}, {"time": 953, "text": "But there's something about arm movement that adds even more kind of depth."}, {"time": 959, "text": "It's like the face communicates emotion and sadness and disappointment and happiness."}, {"time": 966, "text": "And then the arms kind of communicates, I'm trying here."}, {"time": 971, "text": "I'm doing my best in this complicated world."}, {"time": 974, "text": "So it's interesting because like all of Cosmo is only four degrees of freedom and two of them are the two treads, which is for basic movement."}, {"time": 983, "text": "And so you literally have only a head that goes up and down, a lift that goes up and down, and then your two wheels."}, {"time": 989, "text": "And you have sound and a screen, a low resolution screen."}, {"time": 994, "text": "And with that, it's actually pretty incredible what you can come up with, where, like you said, it's a really interesting give and take because there's a lot of ideas far beyond that, obviously, as you can imagine, where, like you said, how big is it?"}, {"time": 1006, "text": "How much degrees of freedom?"}, {"time": 1006, "text": "What does he look like?"}, {"time": 1006, "text": "What does he sound like?"}, {"time": 1006, "text": "How does he communicate?"}, {"time": 1011, "text": "It's a formula that actually scales way beyond entertainment."}, {"time": 1014, "text": "This is the formula for human kind of robot interface more generally, is you almost have this triangle between the physical aspects of it, the mechanics, the industrial design, what's mass producible, the cost constraints and so forth."}, {"time": 1027, "text": "You have the AI side of how do you understand the world around you, interact intelligently with it, execute what you want to execute."}, {"time": 1034, "text": "So perceive the environment, make intelligent decisions and move forward."}, {"time": 1034, "text": "And then you have the character side of it."}, {"time": 1042, "text": "Most companies have done anything in human robot interaction, really missed the mark or underinvest in the character side of it."}, {"time": 1050, "text": "They overinvest in the mechanical side of it and then varied results on the AI side of it."}, {"time": 1056, "text": "And so the thinking is that you put more mechanical flexibility into it, you're going to do better."}, {"time": 1061, "text": "You don't necessarily, you actually create a much higher bar for a high ROI because now your price point goes up, your expectations go up."}, {"time": 1068, "text": "And if the AI can't meet it or the overall experience isn't there, you miss the mark."}, {"time": 1073, "text": "So how did you, through those conversations, get the cost down so much and made it so simple?"}, {"time": 1073, "text": "There's a big theme here because you come from the mecca of robotics, which is Carnegie Mellon University, robotics."}, {"time": 1091, "text": "For all the people I've interacted with that come from there or just from the world experts at robotics, they would never build something like Cosmo."}, {"time": 1099, "text": "And so where did that come from?"}, {"time": 1099, "text": "The simplicity."}, {"time": 1103, "text": "It came from this combination of a team that we had."}, {"time": 1103, "text": "It was quite cool."}, {"time": 1107, "text": "And by the way, you ask anybody that's experienced in the toy entertainment space, you'll never sell a product over $99."}, {"time": 1114, "text": "That was fundamentally false and we believed it to be false."}, {"time": 1114, "text": "It was because experience had to meet the mark."}, {"time": 1120, "text": "And so we pushed past that amount, but there was a pressure where the higher you go, the more seasonal you become and the tougher it becomes."}, {"time": 1126, "text": "And so on the cost side, we very quickly partnered up with some previous contacts that we worked with where, just as an example, our head of mechanical engineering was one of the earliest heads of engineering at Logitech and has a billion units of consumer products and circulation that he's worked on."}, {"time": 1143, "text": "So like crazy, low cost, high volume consumer product experience."}, {"time": 1147, "text": "We had a really great mechanical engineering team and just a very practical mindset where we were not going to compromise on feasibility in the market in order to chase something that would be an enabler."}, {"time": 1157, "text": "And we pushed a huge amount of expectations onto the software team where, yes, we're going to use cheap, noisy motors and sensors, but we're going to fix it on the software side."}, {"time": 1167, "text": "Then we found on the design and character side, there was a faction that was more from like a game design background that thought that it should be very games driven, Cosmo, where you create a whole bunch of games experiences and it's all about like game mechanics."}, {"time": 1180, "text": "And then there was a faction which my cofather and I are the most involved in this, like really believed in, which was character driven."}, {"time": 1187, "text": "And the argument is that you will never compete with what you can do virtually from a game standpoint, but you actually on a character side, put this into your wheelhouse and put it more towards your advantage because a physical character has a massively higher impact physically than virtually."}, {"time": 1203, "text": "Okay, can I just pause on that because this is so brilliant."}, {"time": 1203, "text": "For people who don't know, Cosmo plays games with you, but there's also a depth of character."}, {"time": 1203, "text": "And I actually, when I was playing with it, I wondered exactly what is the compelling aspect of this."}, {"time": 1222, "text": "Because to me, obviously I'm biased, but to me the character, what I enjoyed most, honestly, or what got me to return to it is the character."}, {"time": 1233, "text": "But that's a fascinating discussion of, you're right, ultimately you cannot compete on the quality of the gaming experience."}, {"time": 1242, "text": "It's too restrictive."}, {"time": 1242, "text": "The physical world is just too restrictive and you don't have a graphics engine, it's like all this."}, {"time": 1247, "text": "But on the character side, and clearly we moved in that direction as the winning path and we partnered up with this, we immediately went towards Pixar and Carlos Bena had been at Pixar for nine years."}, {"time": 1265, "text": "He'd worked on tons of the movies, including WALLY and others, and just immediately spoke the language and it just clicked on how you think about that magic and drive."}, {"time": 1275, "text": "And then we built out a team with him as a really prominent driver of this with different types of backgrounds and animators and character developers where we put these constraints on the team, but then got them to really try to create magic despite that."}, {"time": 1292, "text": "And we converged on this system that was at the overlap of character and the character AI that where, if you imagine the dimensionality of emotions, happy, sad, angry, surprised, confused, scared, you think of these extreme emotions."}, {"time": 1310, "text": "We almost put this challenge to populate this library of responses on how do you show the extreme response that goes to the extreme spectrum on angry or frustrated or whatever."}, {"time": 1322, "text": "And so that gave us a lot of intuition and learnings and then we started parameterizing them where it wasn't just a fixed recording, but they were parameterized and had randomness to them where you could have infinite permutations of happy and surprised and so forth."}, {"time": 1336, "text": "And then we had a behavioral engine that took the context from the real world and would interpret it and then create probability mappings on what sort of responses you would have that actually made sense."}, {"time": 1347, "text": "And so if Cosmo saw you for the first time in a day, he'd be really surprised and happy in the same way that the first time you walk in and your toddler sees you, they're so happy, but they're not going to be that happy for the entirety of your next two hours."}, {"time": 1360, "text": "But you have this spike in response or if you leave him alone for too long, he gets bored and starts causing trouble and nudging things off the table."}, {"time": 1368, "text": "Or if you beat him in a game, the most enjoyable emotions are him getting frustrated and grumpy to a point where our testers and our customers would be like, I had to let him win because I don't want him to be upset."}, {"time": 1379, "text": "And so you start to create this feedback loop where you see how powerful those emotions are."}, {"time": 1385, "text": "And just to give you an example, something as simple as eye contact, you don't think about it in a movie."}, {"time": 1390, "text": "It kind of happens like camera angles and so forth, but that's not really a prominent source of interaction."}, {"time": 1396, "text": "What happens when a physical character like Cosmo, when he makes eye contact with you, it built universal kind of connection, kids all the way through adults."}, {"time": 1407, "text": "And it was truly universal."}, {"time": 1407, "text": "It was not like people stopped caring after 10, 12 years old."}, {"time": 1412, "text": "And so we started doing experiments and we found something as simple as increasing the amount of eye contact, like the amount of times in a minute that he'll look over for your approval to make eye contact."}, {"time": 1425, "text": "Just by, I think, doubling it, we increased the playtime engagement by 40%."}, {"time": 1430, "text": "You see these sort of interactions where you build that empathy."}, {"time": 1433, "text": "And so we studied pets."}, {"time": 1433, "text": "We studied virtual characters."}, {"time": 1437, "text": "There's like a lot of times actually dogs are one of the most perfect influencers behind these sort of interactions."}, {"time": 1445, "text": "And what we realized is that the games were not there to entertain you."}, {"time": 1448, "text": "The games were to create context to bring out the character."}, {"time": 1451, "text": "And if you think about the types of games that you played, they're relatively simple, but they were always once to create scenarios of either tension or winning or losing or surprise or whatever the case might be."}, {"time": 1462, "text": "And they were purely there to just like create context to where an emotion could feel intelligent and not random."}, {"time": 1468, "text": "And in the end, it was all about the character."}, {"time": 1470, "text": "So yeah, there's so many elements to play with here."}, {"time": 1474, "text": "So you said dogs."}, {"time": 1474, "text": "What lessons do we draw from cats who don't seem to give a damn about you?"}, {"time": 1480, "text": "Is that just another character?"}, {"time": 1482, "text": "It's just another character."}, {"time": 1484, "text": "So you could almost like in the early explorations, we thought it would be really incredible if you had a diversity of characters where you almost help encourage which direction it goes, just like in a role playing game."}, {"time": 1494, "text": "And you had like think of like the seven dwarves sort of."}, {"time": 1500, "text": "And initially we even thought that it would be amazing if like the other like, you know, like their characters actually help them have strengths and weaknesses and some like whatever they end up doing."}, {"time": 1511, "text": "Like some are scared, some are, you know, arrogant, some are, you know, super warm and like kind of friendly."}, {"time": 1518, "text": "And in the end, we focused on one because it made it very clear that, hey, we got to build out enough depth here because you're kind of trying to expand."}, {"time": 1526, "text": "It's almost like how long can you maintain a fiction that this character is alive to where the person's explorations don't hit a boundary, which happens almost immediately with typical toys."}, {"time": 1536, "text": "And, you know, even with video games, how long can we create that immersive experience to where you expand the boundary?"}, {"time": 1543, "text": "And one of the things we realized is that you're just way more forgiving when something has a personality and it's physical."}, {"time": 1550, "text": "That is the key that unlocks robotics interacting in the physical world and more generally is that when you don't have a personality and you make a mistake as a robot, the stupid robot made a mistake."}, {"time": 1565, "text": "Why is it not perfect?"}, {"time": 1565, "text": "When you have a character and you make a mistake, you have empathy and it becomes endearing and you're way more forgiving."}, {"time": 1571, "text": "And that was the key that was like I think goes far, far beyond entertainment."}, {"time": 1575, "text": "It actually builds the depth of the personality, the mistakes."}, {"time": 1578, "text": "So let me ask the movie Her question then."}, {"time": 1582, "text": "How, so Cosmos seems, feels like the early days of something that will obviously be prevalent throughout society at a scale that we cannot even imagine."}, {"time": 1595, "text": "My sense is it seems obvious that these kinds of characters will permeate society and that we'll be friends with them."}, {"time": 1604, "text": "We'll be interacting with them in different ways."}, {"time": 1606, "text": "I mean, you don't think of it this way, but when you play video games, they're often cold and impersonal."}, {"time": 1614, "text": "But even then, you think about role playing games, you become friends with certain characters in that game."}, {"time": 1622, "text": "They don't remember much about you."}, {"time": 1622, "text": "They're just telling a story."}, {"time": 1627, "text": "It's exactly what you're saying."}, {"time": 1627, "text": "They exist in that virtual world."}, {"time": 1631, "text": "But if they acknowledge that you exist in this physical world, if the characters in the game remember that you exist, that you, like for me, like Lex, they understand that I'm a human being who has like hopes and dreams and so on."}, {"time": 1646, "text": "It seems like there's going to be like billions, if not trillions of Cosmos in the world."}, {"time": 1654, "text": "So if we look at that future, there's several questions to ask."}, {"time": 1658, "text": "How intelligent does that future Cosmo need to be to create fulfilling relationships like friendships?"}, {"time": 1670, "text": "And part of it is the recognition that it's going to take time to get there because it has to be a lot more intelligent because it was good enough to be a magical experience for an eight year old."}, {"time": 1680, "text": "It's a higher bar to do that, be like a pet in the home or to help with functional interface in an office environment or in a home and so forth."}, {"time": 1690, "text": "And the idea was that you build on that and you kind of get there and as technology becomes more prevalent and less expensive and so forth, you can start to kind of work up to it."}, {"time": 1701, "text": "At the end of the day, we almost equated it to how the touch screen created like this really novel interface to physical kind of devices like this."}, {"time": 1709, "text": "This is the extension of it where you have much richer physical interaction in the real world."}, {"time": 1714, "text": "This is the enabler for it."}, {"time": 1716, "text": "And it shows itself in a few kind of really obvious places."}, {"time": 1719, "text": "So just take something as simple as a voice assistant."}, {"time": 1722, "text": "You will never, most people will never tolerate an Alexa or a Google Home just starting a conversation proactively when you weren't kind of expecting it because it feels weird."}, {"time": 1733, "text": "It's like you were listening and like, and then now you're kind of, it feels intrusive."}, {"time": 1737, "text": "But if you had a character like a cat that touches you and gets your attention or toddler, like you never think twice about it."}, {"time": 1743, "text": "And what we found really kind of immediately is that these types of characters like Cosmo and they would like roam around and kind of get your attention."}, {"time": 1750, "text": "And we had a future version that was always on kind of called Vector."}, {"time": 1753, "text": "People were way more forgiving."}, {"time": 1755, "text": "And so you could initiate interaction in a way that is not acceptable for machines."}, {"time": 1761, "text": "And in general, there's a lot of ways to customize it, but it makes people who are skeptical of technology much more comfortable with it."}, {"time": 1769, "text": "There was like, there were a couple of really, really prominent examples of this."}, {"time": 1773, "text": "So when we launched in Europe and so we were in I think like a dozen countries, if I remember correctly, but like we went pretty aggressively in launching in Germany and France and UK."}, {"time": 1785, "text": "And we were very worried in Europe because there's obviously like a really socially higher bar for privacy and security where you've heard about how many companies have had troubles on things that might've been okay in the US, but like are just not okay in Germany and France in particular."}, {"time": 1801, "text": "And so we were worried about this because you have Cosmo who's in our future product Vector, like where you have cameras, you have microphones, it's connected and like you're playing with kids and like in these experiences."}, {"time": 1814, "text": "And you're like, this is like ripe to be like a nightmare if you're not careful."}, {"time": 1819, "text": "And the journalists are like notoriously like really, really tough on these sorts of things."}, {"time": 1825, "text": "We were shocked and we prepared so much for what we would have to encounter."}, {"time": 1830, "text": "We were shocked in that not once from any journalists or customer did we have any complaints beyond like a really casual kind of question."}, {"time": 1840, "text": "And it was because of the character where when the conversation came up, it was almost like, well, of course he has to see and hear."}, {"time": 1848, "text": "How else is he going to be alive and interacting with you?"}, {"time": 1851, "text": "And it completely disarmed this like fear of technology that enabled this interaction to be much more fluid."}, {"time": 1857, "text": "And again, like entertainment was a proving ground, but that is like, you know, there's like ingredients there that carry over to a lot of other elements down the road."}, {"time": 1866, "text": "That's hilarious that we're a lot less concerned about privacy if the thing has value and charisma."}, {"time": 1873, "text": "I mean, that's true for all of human to human interactions."}, {"time": 1876, "text": "It's an understanding of intent where like, well, he's looking at me, he can see me."}, {"time": 1879, "text": "If he's not looking at me, he can't see me."}, {"time": 1881, "text": "So it's almost like you're communicating intent."}, {"time": 1884, "text": "And with that intent, people are like kind of kind of a more understanding and calmer."}, {"time": 1889, "text": "It was just the earliest kind of version of starting to experiment with this."}, {"time": 1894, "text": "But it wasn't an enabler."}, {"time": 1896, "text": "And then you have like completely different dimensions where kids with autism had like an incredible connection with Cosmo that just went beyond anything we'd ever seen."}, {"time": 1903, "text": "And we have like these just letters that we would receive from parents."}, {"time": 1906, "text": "And we had some research projects kind of going on with some universities on studying this."}, {"time": 1911, "text": "But there's an interesting dimension there that got unlocked that just hadn't existed before that has these really interesting kind of links into society and a potential building block of future experience."}, {"time": 1925, "text": "So if you look out into the future, do you think we will have beyond a particular game, you know, a companion like her, like the movie Her or like a Cosmo that's kind of asks you how your day went to write, you know, like a friend."}, {"time": 1946, "text": "How many years away from that do you think we are?"}, {"time": 1951, "text": "So I think the idea of a different type of character, like more closer to like kind of a pet style companionship will come way faster."}, {"time": 1958, "text": "And there's a few reasons."}, {"time": 1961, "text": "One is like to do something like in her, that's like effectively almost general AI."}, {"time": 1967, "text": "And the bar is so high that if you miss it by a bit, you hit the uncanny valley where it just becomes creepy and like and not appealing."}, {"time": 1975, "text": "Because the closer you try to get to a human in form and interface and voice, the harder it becomes."}, {"time": 1980, "text": "Whereas you have way more flexibility on still landing a really great experience if you embrace the idea of a character."}, {"time": 1988, "text": "And that's why one of the other reasons why we didn't have a voice and also why like a lot of video game characters like Sims, for example, does not have a voice when you when you think about it, it was it wasn't just a cost savings like for them."}, {"time": 2002, "text": "It was actually for all of these purposes."}, {"time": 2002, "text": "It was because when you have a voice, you immediately narrow down the appeal to some particular demographic or age range or kind of style or gender."}, {"time": 2013, "text": "If you don't have a voice, people interpret what they want to interpret."}, {"time": 2017, "text": "And an eight year old might get a very different interpretation than a 40 year old, but you create a dynamic range."}, {"time": 2022, "text": "And so you just you can lean into these advantages much more in something that doesn't resemble human."}, {"time": 2028, "text": "And so that'll come faster."}, {"time": 2030, "text": "I don't know when a human like that's just still like just complete R&D at this point."}, {"time": 2036, "text": "The chat interfaces are getting way more interesting and richer, but it's still a long way to go to kind of pass the test of, you know."}, {"time": 2044, "text": "Well, let me like let's consider like let me play devil's advocate."}, {"time": 2049, "text": "So Google is a very large company that's servicing."}, {"time": 2053, "text": "It's creating a very compelling product that wants to provide a service to a lot of people."}, {"time": 2057, "text": "But let's go outside of that."}, {"time": 2057, "text": "You said characters."}, {"time": 2061, "text": "Yeah, it feels like and you also said that it requires general intelligence to be a successful participant in a relationship, which could explain why I'm single."}, {"time": 2071, "text": "But the I honestly want to push back on that a little bit because I feel like is it possible that if you're just good at playing a character in a movie, there's a bunch of characters."}, {"time": 2084, "text": "If you just understand what creates compelling characters and then you just are that character and you exist in the world and other people find you and they connect with you just like you do when you talk to somebody at a bar."}, {"time": 2096, "text": "I like this character."}, {"time": 2096, "text": "This character is kind of shady."}, {"time": 2096, "text": "I don't like them."}, {"time": 2099, "text": "You pick the ones that you like."}, {"time": 2101, "text": "And, you know, maybe it's somebody that's reminds you of your father or mother."}, {"time": 2106, "text": "I don't know what it is, but the Freudian thing."}, {"time": 2109, "text": "But there's some kind of connection that happens and that's the Cosmo you connect to."}, {"time": 2114, "text": "That's the future Cosmo you connect."}, {"time": 2116, "text": "And it's so I guess the statement I'm trying to make, is it possible to achieve a depth of friendship without solving general intelligence?"}, {"time": 2124, "text": "And it's about intelligent kind of constraints, right?"}, {"time": 2127, "text": "And just you set expectations and constraints such that in the space that's left, you can be successful."}, {"time": 2133, "text": "And so you can do that by having a very focused domain that you can operate in."}, {"time": 2137, "text": "For example, you're a customer support agent for a particular product and you create intelligence and a good interface around that."}, {"time": 2142, "text": "Or, you know, kind of in the personal companionship side, you can't be everything across the board."}, {"time": 2149, "text": "You kind of solve those constraints."}, {"time": 2151, "text": "And I think it's possible."}, {"time": 2153, "text": "My worry is right now I don't see anybody that has picked up on where Cosmo left off and is pushing on it in the same way."}, {"time": 2164, "text": "And so I don't know if it's a sort of thing where similar to like how, you know, in Dotcom there were all these concepts that we considered like, you know, that didn't work out or like failed or like were too early or whatnot."}, {"time": 2174, "text": "And then 20 years later, you have these like incredible successes on almost the same concept."}, {"time": 2178, "text": "Like it might be that sort of thing where like there's another pass at it that happens in five years or in 10 years."}, {"time": 2184, "text": "But it does feel like that appreciation of that, like the three legged stool, if you will, between like, you know, the hardware, the AI and the character, that balance, it's hard to, I'm not aware of anywhere right now where like that same kind of aggressive drive with the value on the character is happening."}, {"time": 2204, "text": "And so to me, just a prediction, exactly as you said, something that looks awfully a lot like Cosmo, not in the actual physical form, but in the three legged stool, something like that in some number of years will be a trillion dollar company."}, {"time": 2219, "text": "Like, it's obvious to me that like character, not just as robotic companions, but in all our computers, they'll be there."}, {"time": 2230, "text": "It's like Clippy was like two legs of that stool or something like that."}, {"time": 2237, "text": "I mean, those are all different attempts."}, {"time": 2239, "text": "And what's really confusing to me is they're born these attempts and everybody gets excited and for some reason they die and then nobody else tries to pick it up."}, {"time": 2251, "text": "And then maybe a few years later, a crazy guy like you comes around with just enough brilliance and vision to create this thing and is born."}, {"time": 2262, "text": "A lot of people love it."}, {"time": 2263, "text": "A lot of people get excited, but maybe the timing is not right yet."}, {"time": 2267, "text": "And then when the timing is right, it just blows up."}, {"time": 2271, "text": "It just keeps blowing up more and more until it just blows up."}, {"time": 2274, "text": "And I guess everything in the full span of human civilization collapses eventually."}, {"time": 2279, "text": "And that wouldn't surprise me at all."}, {"time": 2281, "text": "And like, what's going to be different in another five years or 10 years or whatnot?"}, {"time": 2284, "text": "Physical component costs will continue to come down in price and mobile devices and computation is going to become more and more prevalent as well as cloud as a big tool to offload cost."}, {"time": 2296, "text": "AI is going to be a massive transformation compared to what we dealt with where everything from voice understanding to just kind of a broader contextual understanding and mapping of semantics and understanding scenes and so forth."}, {"time": 2315, "text": "And then the character side will continue to kind of progress as well because that magic does exist."}, {"time": 2319, "text": "It just exists in different forms."}, {"time": 2321, "text": "And you have just the brilliance of the tapping and animation and these other areas where that was a big unlock in film, obviously."}, {"time": 2332, "text": "And so I think, yeah, the pieces can reconnect and the building blocks are actually going to be way more impressive than they were five years ago."}, {"time": 2339, "text": "So in 2019, Anki, the company that created Cosmo, the company that you started, had to shut down."}, {"time": 2339, "text": "How did you feel at that time?"}, {"time": 2351, "text": "That was a really emotional stretch and it was a really tough year."}, {"time": 2358, "text": "I think about a year ahead of that was actually a pretty brutal stretch because we were kind of life or death on many, many moments just navigating these insane kind of just ups and downs and barriers."}, {"time": 2372, "text": "And the thing that made it, just sort of winding a tiny bit, what ended up being really challenging about it as a business is from a commercial standpoint and customer reception standpoint, there's a lot of things you could point to that were pretty big successes."}, {"time": 2389, "text": "Sold millions of units, got to pretty serious revenue, kind of close to 100 million annual revenue, number one kind of product in various categories."}, {"time": 2400, "text": "But it was pretty expensive."}, {"time": 2400, "text": "It ended up being very seasonal where something like 85% of our volume was in Q4 because it was a present and it was expensive to market it and explain it and so forth."}, {"time": 2413, "text": "And even though the volume was really sizable and the reviews were really fantastic, forecasting and planning for it and managing the cash operations was just brutal."}, {"time": 2424, "text": "It was absolutely brutal."}, {"time": 2424, "text": "You don't think about this when you're starting a company or when you have a few million in revenue because it's just your biggest costs are kind of just your headcount and operations and everything's ahead of you."}, {"time": 2435, "text": "But we got to a point where if you look at the entire year, you have to operate your company, pay all the people and so forth."}, {"time": 2445, "text": "You have to pay for the manufacturing, the marketing and everything else to do your sales in mostly November, December and then get paid in December, January by retailers."}, {"time": 2454, "text": "And those swings were really rough and just made it so difficult because the more it successfully became, the more wild those swings became because you'd have to spend tens of millions of dollars on inventory, tens of millions of dollars on marketing and tens of millions of dollars on payroll and everything else."}, {"time": 2471, "text": "The bigger dip and then you're waiting for the Q4."}, {"time": 2475, "text": "And it's not a business that is recurring month to month and predictable."}, {"time": 2475, "text": "And then you're locking in your forecast in July, maybe August if you're lucky."}, {"time": 2485, "text": "And it's also very hit driven and seasonal where you don't have the sort of continued kind of slow growth like you do in some other consumer electronics industries."}, {"time": 2494, "text": "And so before then, hardware kind of went out of favor too."}, {"time": 2494, "text": "And so you had Fitbit and GoPro drop from 10 billion revenue to 1 billion revenue and hardware companies are getting valued at like 1x revenue oftentimes, which is tough."}, {"time": 2506, "text": "And so we effectively kind of got caught in the middle where we were trying to quickly evolve out of entertainment and move into some other categories."}, {"time": 2515, "text": "But you can't let go of that business because that's what you're valued on."}, {"time": 2515, "text": "That's what you're raising money on."}, {"time": 2515, "text": "But there is no path to kind of pure profitability just there because it was such specific type of price points and so forth."}, {"time": 2527, "text": "And so we tried really hard to make that transition."}, {"time": 2527, "text": "And we had a financing round that fell apart at the last second."}, {"time": 2536, "text": "And effectively, there was just no path to kind of get through that and get to the next kind of holiday season."}, {"time": 2536, "text": "And so we ended up selling some of the assets and kind of winding down the company."}, {"time": 2546, "text": "It was brutal."}, {"time": 2546, "text": "I was very transparent with the company and the team while we were going through it where actually, despite how challenging that period was, very few people left."}, {"time": 2557, "text": "I mean, people loved the vision, the team, the culture, the kind of chemistry and what we were doing."}, {"time": 2557, "text": "There was just a huge amount of pride there."}, {"time": 2557, "text": "And then we wanted to see it through."}, {"time": 2557, "text": "And we felt like we had a shot to kind of get through these checkpoints."}, {"time": 2569, "text": "And by brutal, I mean literally days of cash, like three, four different times runway in the year kind of before it where you're playing games of chicken on negotiating credit line timelines and repayment terms and how to get a bridge loan from an investor."}, {"time": 2591, "text": "There was a level of stress that as hard as things might be anywhere else, you'll never come close to that where you feel that responsibility for 200 plus people."}, {"time": 2601, "text": "And so we were very transparent during our fundraise on who we're talking to, the challenges that we have, how it's going and when things are going well, when things were tough."}, {"time": 2610, "text": "And so it wasn't a complete shock when it happened, but it was just very emotional where we announced it finally that we basically were just watching the runway and trying to kind of time it."}, {"time": 2623, "text": "And when we realized that we didn't have any more outs, we wanted to kind of wind it down, make sure that it was clean and we could kind of take care of people the best we could."}, {"time": 2631, "text": "But they broke down crying at the hands and somebody else had to step in for a bit and it was just very, very emotional."}, {"time": 2631, "text": "But the beautiful part is afterwards, everybody stayed at the office to two, three in the morning just drinking and hanging out and telling stories and celebrating."}, {"time": 2646, "text": "And it was just one of the best, for many people, it was the best kind of work experience that they had."}, {"time": 2646, "text": "And there was a lot of pride in what we did."}, {"time": 2654, "text": "And it wasn't anything obvious we could point to that like, hey, if only we had done that different, things would have been completely different."}, {"time": 2654, "text": "It was just like the physics didn't line up."}, {"time": 2663, "text": "And but the experience was pretty incredible, but it was hard."}, {"time": 2668, "text": "It had this feeling that there was this incredible beauty in both the technology and products and the team that there's a lot there that in the right context could have been pretty incredible, but it was emotional."}, {"time": 2687, "text": "Yeah, just thinking, I mean, just looking at this company, like you said, product and technology, but the vision, the implementation, you got the cost down very low and the compelling, the nature of the product was great."}, {"time": 2702, "text": "So many robotics companies failed at this."}, {"time": 2702, "text": "The robot was too expensive."}, {"time": 2702, "text": "It didn't have the personality."}, {"time": 2702, "text": "It didn't really provide any value, like a sufficient value to justify the price."}, {"time": 2714, "text": "So you succeeded where basically every single other robotics company or most of them that are like going the category of social robotics have kind of failed."}, {"time": 2725, "text": "And I mean, it's it's quite tragic."}, {"time": 2725, "text": "I remember reading that."}, {"time": 2725, "text": "I'm not sure if I talked to you before that happened or not, but I remember, you know, I'm distant from this."}, {"time": 2737, "text": "I remember being heartbroken reading that because, like, if if Cosmo is not going to succeed, what is going to succeed?"}, {"time": 2749, "text": "Because that to me was incredible."}, {"time": 2749, "text": "Like it was an incredible idea."}, {"time": 2755, "text": "Cost is down."}, {"time": 2755, "text": "The minimum that the it's just like the most minimal design in physical form that you could do."}, {"time": 2763, "text": "It's really compelling."}, {"time": 2763, "text": "The balance of games."}, {"time": 2763, "text": "So it's a fun toy."}, {"time": 2763, "text": "It's a great gift for all kinds of age groups."}, {"time": 2771, "text": "It's just it's compelling in every single way."}, {"time": 2771, "text": "And it seemed like it was a huge success and it failing was."}, {"time": 2781, "text": "There was heartbreak on many levels for me, just as an external observer."}, {"time": 2787, "text": "Is I was thinking, how hard is it to run a business?"}, {"time": 2787, "text": "That's that's what I was thinking."}, {"time": 2787, "text": "Like, if this failed, this must have failed because it's obviously not like, yeah, it's business."}, {"time": 2799, "text": "Maybe it's some aspect of the manufacturing and so on."}, {"time": 2799, "text": "But I'm now realizing it's also not just that it's."}, {"time": 2805, "text": "And sales, marketing, all those everything."}, {"time": 2805, "text": "Like, how do you explain something that's like a new category to people that like how all these positions."}, {"time": 2812, "text": "And so, like, you know, it had some of the hardest elements of if you were to pick a business, it had some of the hardest customer dynamics, because like to sell a hundred fifty dollar product, you got to convince both the child, the one it and the parents to agree that it's valuable."}, {"time": 2829, "text": "So you're having like this dual prong marketing challenge."}, {"time": 2829, "text": "You have manufacturing, you have like really high precision on the components that you need."}, {"time": 2835, "text": "You have the challenges."}, {"time": 2835, "text": "So there were a lot of tough elements."}, {"time": 2835, "text": "But is this feeling where like just really great alignment of unique strength across kind of like all these different areas, just an incredible like, you know, kind of character and animation team between this Carlos."}, {"time": 2849, "text": "And there's like a character director day that came on board and really great people there."}, {"time": 2853, "text": "The A.I."}, {"time": 2853, "text": "side, the the manufacturing, the you know, where like never missing a launch."}, {"time": 2853, "text": "And actually, you know, he kind of had that quality was."}, {"time": 2853, "text": "Yeah, it was heartbreaking."}, {"time": 2865, "text": "But here's one neat thing is like we we had so much like fan mail from kind of kids and parents like I actually like there was a bunch that collected in the end that I actually saved."}, {"time": 2876, "text": "And like I never it was too emotional to open it and I still haven't opened it."}, {"time": 2876, "text": "And so I actually have this giant envelope of like a stack this much of like letters from, you know, kids and families, just like every kind of permutation permutation you can imagine."}, {"time": 2889, "text": "And so planning to kind of I don't know, maybe like a five year, you know, five year, some year reunion, just inviting everybody over and we'll just like kind of dig into it and kind of bring back some memories."}, {"time": 2898, "text": "But, you know, good impact."}, {"time": 2898, "text": "And well, I think there will be companies, maybe Waymo and Google will be somehow involved that will carry this flag forward and will will make you proud whether you're involved or not."}, {"time": 2914, "text": "I think this is one of the greatest robotics companies in the history of robotics."}, {"time": 2919, "text": "So you should be proud."}, {"time": 2919, "text": "It's still tragic to know that, you know, because you read all the stories of Apple and let's see, SpaceX and like companies that were just on the verge of failure several times through that story."}, {"time": 2937, "text": "And they just it's almost like a roll of the dice."}, {"time": 2937, "text": "They succeeded."}, {"time": 2937, "text": "And here's a roll of the dice that just happened to go."}, {"time": 2944, "text": "And that's the appreciation that like when you really like talk to a lot of the founders, like everybody goes through those moments."}, {"time": 2950, "text": "And sometimes it really is a matter of like, you know, timing, a little bit of luck, like some things are just out of your control."}, {"time": 2956, "text": "And and you get a much deeper appreciation for just the dimensionality of that challenge."}, {"time": 2964, "text": "But the great thing is, is that like a lot of the team actually like stayed together."}, {"time": 2964, "text": "And so there were actually a couple of companies that we where we kind of kept big chunks of the team together and we actually kind of helped align this, you know, to to help people out as well."}, {"time": 2978, "text": "And one of them was Waymo, where a majority of the AI and robotics team actually had the exact background that you would look for."}, {"time": 2987, "text": "And like kind of AV space was a space that a lot of us like, you know, you know, worked on in grad school, were always passionate about and ended up, you know, maybe the time, you know, serendipitous timings from another perspective where like kind of landed in a really unique circumstances that should have been quite exciting, too."}, {"time": 3005, "text": "So it's interesting to ask you just your thoughts."}, {"time": 3005, "text": "Cosmo still lives on under Dream Labs, I think."}, {"time": 3005, "text": "Is that, are you tracking the progress there or is it too much pain?"}, {"time": 3005, "text": "Is it, are you, is that something that you're excited to see where that goes?"}, {"time": 3024, "text": "So keeping an eye on it, of course, just out of curiosity and obviously just kind of careful product line, I think it's deceptive how complex it is to manufacture and evolve that product line and the amount of experiences that are required to complete the picture and be able to move that forward."}, {"time": 3043, "text": "And I think that's going to make it pretty hard to do something really substantial with it."}, {"time": 3043, "text": "It would be cool if like even the product in the way it was was able to be manufactured."}, {"time": 3052, "text": "Which is the current goal, I suppose."}, {"time": 3054, "text": "Yeah, which will be neat."}, {"time": 3054, "text": "But I think it's deceptive how tricky that is on like everything from the quality control, the details and then like technology changes that forces you to reinvent and update certain things."}, {"time": 3054, "text": "So I haven't been super close to it, but just kind of keeping an eye on it."}, {"time": 3073, "text": "Yeah, it's really interesting how it's deceptively difficult, just as you're saying."}, {"time": 3073, "text": "For example, those same folks, and I've spoken with them, they're, they partner up with Rick and Morty creators to do the Butter Robot."}, {"time": 3091, "text": "I just recently, I kind of half ass watched Rick and Morty previously, but now I just watched like the first season."}, {"time": 3091, "text": "It's such a brilliant show."}, {"time": 3101, "text": "I like, I did not understand how brilliant that show is."}, {"time": 3101, "text": "And obviously I think in season one is where the Butter Robot comes along for just a few minutes or whatever, but I just fell in love with the Butter Robot."}, {"time": 3114, "text": "The sort of the, that particular character, just like you said, there's characters you can create, personalities you can create, and that particular robot who's doing a particular task realizes, you know, this like realizes, that's the existential question."}, {"time": 3132, "text": "The myth of Sisyphus question that Camus writes about, is this all there is?"}, {"time": 3132, "text": "He moves butter."}, {"time": 3132, "text": "But, you know, that realization, that's a beautiful little realization for a robot that my purpose is very limited to this particular task."}, {"time": 3150, "text": "It's humor of course, it's darkness, it's a beautiful mix."}, {"time": 3150, "text": "But so they want to release that Butter Robot, but something tells me that to do the same depth of personality as Cosmo had, the same richness, it would be on the manufacturing, on the AI, on the storytelling, on the design, it's going to be very, very difficult."}, {"time": 3173, "text": "It could be a cool sort of toy for Rick and Morty fans, but to create the same depth of existential angst that the Butter Robot symbolizes is really, that's the brave effort you succeeded at with Cosmo, but it's not easy."}, {"time": 3194, "text": "You can fail on almost any one of the kind of dimensions, and unique convergence of a lot of different skill sets to try to pull that off."}, {"time": 3205, "text": "On this topic, let me ask you for some advice, because as I've been watching Rick and Morty, I told myself, I have to build the Butter Robot, just as a hobby project."}, {"time": 3205, "text": "And so I got a nice platform for it with treads and there's a camera that moves up and down and so on."}, {"time": 3224, "text": "But the question I'd like to ask, there's obvious technical questions I'm fine with, communication, the personality, storytelling, all those kinds of things."}, {"time": 3224, "text": "I think I understand the process of that, but how do you know when you got it right?"}, {"time": 3242, "text": "So with Cosmo, how did you know this is great?"}, {"time": 3242, "text": "Or something is off."}, {"time": 3242, "text": "Is this brainstorming with the team?"}, {"time": 3242, "text": "Do you know it when you see it?"}, {"time": 3242, "text": "Is it like love at first sight?"}, {"time": 3242, "text": "It's like, this is right."}, {"time": 3257, "text": "Or I guess if we think of it as an optimization space, is there Uncanny Valley where you're like, that's not right, or this is right, or are a lot of characters right?"}, {"time": 3268, "text": "Yeah, we stayed away from Uncanny Valley just by having such a different mapping where it didn't try to look like a dog or a human or anything like that."}, {"time": 3268, "text": "And so you avoided having a weird pseudo similarity, but not quite hitting the mark."}, {"time": 3284, "text": "But you could just fall flat where just a personality or a character emotion just didn't feel right."}, {"time": 3284, "text": "And so it actually mirrored very closely to the iterations that a character director at Pixar would have, where you're running through it and you can virtually see what it'll look like."}, {"time": 3300, "text": "We created a plugin to where we actually used Maya, the animation tools, and then we created a plugin that perfectly matched it to the physical one."}, {"time": 3300, "text": "And so you could test it out virtually and then push a button and see it physically play out."}, {"time": 3315, "text": "And there's subtle differences."}, {"time": 3315, "text": "And so you want to make sure that that feedback loop is super easy to be able to test it live."}, {"time": 3321, "text": "And then sometimes you would just feel it that it's right and intuitively know."}, {"time": 3321, "text": "And then we did user testing."}, {"time": 3321, "text": "But it was very, very often that if we found it magical, it would scale and be magical more broadly."}, {"time": 3337, "text": "There were not too many cases where we were pretty decent about not geeking out or getting too attached to something that was super unique to us, but trying to put a customer hat on and does it truly feel magical?"}, {"time": 3352, "text": "And so in a lot of ways, we just give a lot of autonomy to the character team to really think about the character board and mood boards and storyboards and what's the background of this character and how would they react."}, {"time": 3367, "text": "And they went through a process that's actually pretty familiar, but now had to operate under these unique constraints."}, {"time": 3372, "text": "The moment where it felt right kind of took a fairly similar journey than like as a character in an animated film."}, {"time": 3372, "text": "Actually, it's quite cool."}, {"time": 3372, "text": "Well, the thing that's really important to me and I wonder if it's possible."}, {"time": 3383, "text": "Well, I hope it's possible."}, {"time": 3383, "text": "Pretty sure it's possible is for me, even though I know how it works to make sure there's sufficient randomness in the process."}, {"time": 3394, "text": "Probably because it would be machine learning based that I'm surprised that I don't."}, {"time": 3394, "text": "I'm surprised by certain reactions."}, {"time": 3394, "text": "I'm surprised by certain communication."}, {"time": 3404, "text": "Maybe that's in a form of a question."}, {"time": 3404, "text": "Were you surprised by certain things Cosmo did, like certain interactions?"}, {"time": 3412, "text": "Yeah, we made it intentionally so that there would be some surprise and a decent amount of variability in how he'd respond in certain circumstances."}, {"time": 3412, "text": "And so in the end, this isn't general AI."}, {"time": 3426, "text": "This is a giant spectrum and library of parameterized emotional responses and an emotional engine that would map your current state of the game, your emotions, the world, the people who are playing with you, so forth, to what's happening."}, {"time": 3441, "text": "But we could make it feel spontaneous by creating enough diversity and randomness, but still within the bounds of what felt like very realistic to make that work."}, {"time": 3453, "text": "And then what was really neat is that we could get statistics on how much of that space we were saturating and then add more animations and more diversity in the places that would get hit more often so that you stay ahead of the curve and maximize the chance that it stays feeling alive."}, {"time": 3468, "text": "But then when you combine it, the permutations and the combinations of emotions stitched together sometimes surprised us because you see them in isolation."}, {"time": 3479, "text": "But when you actually see them and you see them live relative to some event that happened in the game or whatnot, it was kind of cool to see the combination of the two."}, {"time": 3487, "text": "And it's not too different in other robotics applications where you get so used to thinking about the modules of a system and how things progress through a tech stack that the real magic is when all the pieces come together and you start getting the right emergent behavior in a way that's easy to lose when you just kind of go too deep into any one piece of it."}, {"time": 3506, "text": "Yeah, when the system is sufficiently complex, there is something like emergent behavior and that's where the magic is."}, {"time": 3506, "text": "As a human being, you can still appreciate the beauty of that magic at the system level."}, {"time": 3506, "text": "First of all, thank you for humoring me on this."}, {"time": 3518, "text": "It's really, really fascinating."}, {"time": 3518, "text": "I think a lot of people would love this."}, {"time": 3518, "text": "One last thing on the butter robot, I promise."}, {"time": 3526, "text": "In terms of speech, Cosmo is able to communicate so much with just movement and face."}, {"time": 3526, "text": "Do you think speech is too much of a degree of freedom?"}, {"time": 3526, "text": "Like speech a feature or a bug of deep interaction, emotional interaction?"}, {"time": 3550, "text": "For a product, it's too deep right now."}, {"time": 3550, "text": "You would immediately break the fiction because the state of the art is just not good enough."}, {"time": 3550, "text": "And that's on top of just narrowing down the demographic where the way you speak to an adult versus the way you speak to a child is very different."}, {"time": 3567, "text": "Yet a dog is able to appeal to everybody."}, {"time": 3567, "text": "And so right now there is no speech system that is rich enough and subtly realistic enough to feel appropriate."}, {"time": 3567, "text": "And so we very, very quickly kind of moved away from it."}, {"time": 3583, "text": "Now, speech understanding is a different matter where understanding intent, that's a really valuable input."}, {"time": 3583, "text": "But giving it back requires like a way, way higher bar given kind of where today's world is."}, {"time": 3597, "text": "And so that realization that you can do surprisingly much with either no speech or kind of tonal like the way Wally R2D2 and kind of other characters are able to, it's quite powerful and it generalizes across cultures and across ages really, really well."}, {"time": 3615, "text": "I think we're going to be in that world for a little while where it's still very much an unsolved problem on how to like make something."}, {"time": 3615, "text": "It touches on the uncanny valley thing."}, {"time": 3615, "text": "So if you have legs and you're a big humanoid looking thing, you have very different expectations and a much narrower degree of what's going to be acceptable by society."}, {"time": 3632, "text": "And then if you're a robot like Cosmo or Wally or some other form where you can kind of like reinvent the character, speech has that same property where speech is so well understood in terms of expectations by humans that you have far less flexibility on how to deviate from that and lean into your strengths and avoid weaknesses."}, {"time": 3652, "text": "But I wonder if there is, obviously there's certain kinds of speech that activates the uncanny valley and breaks the illusion faster."}, {"time": 3652, "text": "So I guess my intuition is we will solve certain, we would be able to create some speech based personalities sooner than others."}, {"time": 3673, "text": "So for example, I could think of a robot that doesn't know English and is learning English, right?"}, {"time": 3673, "text": "Those kinds of personalities."}, {"time": 3682, "text": "It's like a fiction where you're intentionally kind of like getting a toddler level of speech."}, {"time": 3682, "text": "So that's exactly right."}, {"time": 3682, "text": "So you can have like tied into the experience where it is a more limited character or you embrace the lack of emotions or the lack of dynamic range in the speech kind of capabilities, emotions as like part of the character itself."}, {"time": 3703, "text": "And you've seen that in like kind of fictional characters as well."}, {"time": 3707, "text": "That's why this podcast works."}, {"time": 3710, "text": "Yeah, and you kind of had that with like, I don't know, I guess like data and some of the other ones."}, {"time": 3715, "text": "But yeah, so you have to, and that becomes a constraint that lets you meet the bar."}, {"time": 3721, "text": "See, I honestly think like also if you add drunk and angry, that gives you more constraints that allow you to be dumber from an NLP perspective."}, {"time": 3721, "text": "Like there's certain aspects."}, {"time": 3721, "text": "So if you modify human behavior, like, so forget the sort of artificial thing where you don't know English toddler thing."}, {"time": 3745, "text": "We, if you just look at the full range of humans, I think we, there's certain situations where we put up with a like lower level of intelligence in our communication."}, {"time": 3759, "text": "Like if somebody is drunk, we understand the situation that they're probably under the influence."}, {"time": 3759, "text": "Like we understand that they're not going to be making any sense."}, {"time": 3759, "text": "Anger is another one like that."}, {"time": 3768, "text": "I'm sure there's a lot of other kind of situations like this."}, {"time": 3768, "text": "Maybe, again, language, loss in translation, that kind of stuff that I think if you play with that, what is it, the Ukrainian boy that passed the touring test, you know, play with those ideas."}, {"time": 3785, "text": "I think that's really interesting that you can create compelling characters, but you're right, that's a dangerous sort of road to walk because you're adding degrees of freedom that can get you in trouble."}, {"time": 3794, "text": "And that's why like you have these big pushes that like for most of the last decade plus like where you'd have like full like human replicas of robots really being down to like skin and like kind of in some places."}, {"time": 3807, "text": "My personal feeling is like, man, like that's not the direction that's most fruitful right now."}, {"time": 3816, "text": "Beautiful art."}, {"time": 3816, "text": "It's not in terms of a rich, deep, fulfilling experience."}, {"time": 3824, "text": "And creating a minefield of potential places to feel off."}, {"time": 3824, "text": "And then you're sidestepping where like the biggest kind of functional AI challenges are to actually have, you know, kind of like really rich productivity that actually kind of justifies the higher price points."}, {"time": 3840, "text": "And that's part of the challenge is like, yeah, like robots are going to get to like thousands of dollars, tens of thousands of dollars and so forth."}, {"time": 3846, "text": "But you can imagine what sort of expectation of value that comes with it."}, {"time": 3846, "text": "And so that's where you want to be able to invest the time and depth."}, {"time": 3855, "text": "And so going down the full human replica route creates a gigantic distraction and really, really high bar that can end up sucking up so much of your resources."}, {"time": 3870, "text": "So it's weird to say, but you happen to be one of the greatest at this point roboticists ever because you created this little guy."}, {"time": 3870, "text": "Your part obviously of a great team that created the little guy with a deep personality."}, {"time": 3886, "text": "And they're now switching to an entirely, well, maybe not entirely, but a different fascinating, impactful robotics problem, which is autonomous driving and more specifically, the biggest version of autonomous driving, which is autonomous trucking."}, {"time": 3904, "text": "So you are at Waymo now."}, {"time": 3904, "text": "Can you give us a big picture overview?"}, {"time": 3904, "text": "What is Waymo?"}, {"time": 3904, "text": "What is Waymo Driver?"}, {"time": 3904, "text": "What is Waymo One?"}, {"time": 3904, "text": "What is Waymo Via?"}, {"time": 3904, "text": "Can you give an overview of the company and the vision behind the company?"}, {"time": 3920, "text": "Waymo, by the way, has been eye opening on just how incredible the people and the talent is and how in one company you almost have to create 30 companies worth of technology and capability to solve the full spectrum of it."}, {"time": 3935, "text": "So I've been at Waymo since 2019, so about two and a half years."}, {"time": 3935, "text": "So Waymo is focused on building what we call a driver, which is creating the ability to have autonomous driving across different environments, vehicle platforms, domains, and use cases."}, {"time": 3954, "text": "As you know, it got started in 2009."}, {"time": 3954, "text": "It was almost like an immediate successor to the Grand Challenge and Urban Challenges that were like incredible catalysts for this whole space."}, {"time": 3967, "text": "And so Google started this project and then eventually Waymo spun out."}, {"time": 3967, "text": "And so what Waymo is doing is creating the systems, both hardware, software, infrastructure, everything that goes into it to enable and to commercialize autonomous driving."}, {"time": 3982, "text": "This hits on consumer transportation and ride sharing and kind of vehicles and urban environments."}, {"time": 3982, "text": "And as you mentioned, it hits on autonomous trucking to transport goods."}, {"time": 3994, "text": "So in a lot of ways, it's transporting people and transporting goods."}, {"time": 3994, "text": "But at the end of the day, the underlying capabilities required to do that are surprisingly better aligned than one might expect, where it's the fundamentals of being able to understand the world around you, process it, make intelligent decisions, and prove that we are at a level of safety that enables large scale autonomy."}, {"time": 4017, "text": "So from a branding perspective, Waymo Driver is the system that's irrespective of a particular vehicle it's operating in."}, {"time": 4017, "text": "You have a set of sensors that perceive the world, can act in that world, and move whatever the vehicle is through the world."}, {"time": 4036, "text": "And so in the same way that you have a driver's license and your ability to drive is tied to a particular make and model of a car, and of course, there are special licenses for other types of vehicles, but the fundamentals of a human driver very, very largely carry over."}, {"time": 4048, "text": "And then there's uniquenesses related to a particular environment or domain or a particular vehicle type that kind of add some extra additive challenges."}, {"time": 4057, "text": "But that's exactly right."}, {"time": 4057, "text": "It's the underlying systems that enable a physical vehicle without a human driver to very successfully accomplish the task that previously wasn't possible without 100% human driving."}, {"time": 4074, "text": "And then there's Waymo One, which is the transporting people from a brand perspective."}, {"time": 4074, "text": "And just in case we refer to it so people know."}, {"time": 4074, "text": "And then there's Waymo Via, which is the trucking component."}, {"time": 4074, "text": "Why Via, by the way?"}, {"time": 4074, "text": "Is it just like a cool sounding name?"}, {"time": 4094, "text": "Is there an interesting story there?"}, {"time": 4094, "text": "It is a pretty cool sounding name."}, {"time": 4094, "text": "It's a cool sounding name."}, {"time": 4094, "text": "I mean, when you think about it, it's just like, well, we're going to transport it via this and that."}, {"time": 4104, "text": "So it's just kind of like an allusion to the mechanics of transporting something."}, {"time": 4104, "text": "And it is a pretty good grouping."}, {"time": 4111, "text": "And the interesting thing is that even the groupings kind of blur where Waymo One is like human transportation and there's a fully autonomous service in the Phoenix area that like every day is transporting people."}, {"time": 4111, "text": "And it's pretty incredible to like just see that operated reasonably large scale and just kind of happen."}, {"time": 4126, "text": "And then on the Via side, it doesn't even have to be like long haul trucking is a like a major focus of ours."}, {"time": 4126, "text": "But down the road, you can stitch together the vehicle transportation as well for local delivery."}, {"time": 4126, "text": "Also, and a lot of this requirements for local delivery overlap very heavily with consumer transportation."}, {"time": 4146, "text": "Obviously, given that you're operating on a lot of the same roads and navigating the same safety challenges."}, {"time": 4146, "text": "And Waymo very much is a multi product company that has ambitions in both."}, {"time": 4146, "text": "They have different challenges and both are tremendous opportunities."}, {"time": 4166, "text": "But the cool thing is, is that there's a huge amount of leverage and this kind of core technology stack now gets pushed on by both sides."}, {"time": 4166, "text": "And that adds its own unique challenges."}, {"time": 4166, "text": "But the success case is that the challenges that you push on, they get leveraged across all platforms and all."}, {"time": 4184, "text": "From an engineer perspective, the teams are integrated."}, {"time": 4187, "text": "It's a mix."}, {"time": 4187, "text": "So there's a huge amount of centralized kind of core teams that support all applications."}, {"time": 4187, "text": "And so you think of something like the hardware team that develops the lasers to compute integrates into vehicle platforms."}, {"time": 4197, "text": "This is an experience that carries over across, you know, any application that we'd have in a ebb and flow with both."}, {"time": 4197, "text": "Then there's like really unique perception challenges, planning challenges, like other types of challenges where there's a huge amount of leverage on a core tech stack."}, {"time": 4212, "text": "But then there's like dedicated teams that think of how do you deal with a unique challenge, for example, an articulated trailer with varying loads that completely changes the physical dynamics of a vehicle that doesn't exist on a car, but it becomes one of the most important kind of unique new challenges on a truck."}, {"time": 4228, "text": "So what's the long term dream of Waymo via the autonomous trucking effort that Waymo is doing?"}, {"time": 4237, "text": "Yeah, so we're starting with developing L4 autonomy for class 8 trucks."}, {"time": 4237, "text": "These are 53 foot trailers that capture like a pretty sizable percentage of the goods transportation in the country."}, {"time": 4250, "text": "Long term, the opportunity is obviously to expand to much more diverse types of vehicles, types of goods transportation and start to really expand in both the volume and the route feasibility that's possible."}, {"time": 4263, "text": "And so just like we did on the car side, you start with a single route with a very specific operating kind of domain and constraints that allow you to solve the problem."}, {"time": 4274, "text": "But then over time, you start to really try to push against those boundaries and open up deeper feasibility across routes, across surface streets, across environmental conditions, across the type of goods that you carry, the versatility of those goods and how little supervision is necessary to just start to scale this network."}, {"time": 4287, "text": "And long term, there's actually it's a pretty incredible enabler where today you have already a giant shortage of truck drivers."}, {"time": 4302, "text": "It's over 80,000 truck driver shortage that's expected to grow to hundreds of thousands in the years ahead."}, {"time": 4308, "text": "You have really, really quickly increasing demand from ecommerce and just distribution of where people are located."}, {"time": 4317, "text": "You have one of the deepest safety challenges of any profession in the US where there's a huge, huge, huge kind of challenge around fatigue and around kind of the long routes that are driven."}, {"time": 4331, "text": "And even beyond kind of the cost and necessity of it, there are fundamental constraints built into our logistics network that are tied to the type of human constraints and regulatory constraints that are tied to trucking today."}, {"time": 4345, "text": "For example, our limits on how long a driver can be driving in a single day before they're not allowed to drive anymore, which is a very important safety constraint."}, {"time": 4354, "text": "What that does is it enforces limitations on how far jumps with a single driver could be and makes you very subject to availability of drivers, which influences where warehouses are built, which influences how goods are transported, which influences costs."}, {"time": 4396, "text": "Yeah, I had to be published before this had a great conversation with Steve Vicelli, who we talked about the manual driving."}, {"time": 4403, "text": "He echoed many of the same things that you were talking about, but we talked about much of the fascinating human stories of truck drivers."}, {"time": 4411, "text": "He was also was a truck driver for a bit as a grad student to try to understand the depth of the problem."}, {"time": 4417, "text": "Fascinating lives."}, {"time": 4417, "text": "We have some drivers that have four million miles of lifetime driving experience."}, {"time": 4422, "text": "It's pretty incredible."}, {"time": 4422, "text": "And yeah, it's learning from them, like some of them are on the road for 300 days a year."}, {"time": 4422, "text": "It's a very unique type of lifestyle."}, {"time": 4431, "text": "So there's fascinating stuff there."}, {"time": 4431, "text": "Just like you said, there's a shortage of actually people, truck drivers taking the job, counter to what I think is publicly believed."}, {"time": 4444, "text": "So there's an excess of jobs and a shortage of people to take up those jobs."}, {"time": 4444, "text": "And just like you said, it's such a difficult problem."}, {"time": 4452, "text": "And these are experts at driving and solving this particular problem."}, {"time": 4452, "text": "And it's fascinating to learn from them to understand, you know, how hard is this problem?"}, {"time": 4461, "text": "And that's the question I want to ask you from a perception, from a robotics perspective."}, {"time": 4461, "text": "What's your sense of how difficult is autonomous trucking?"}, {"time": 4469, "text": "Maybe you can comment on which scenarios are super difficult, which are more manageable."}, {"time": 4469, "text": "Is there is there a way to kind of convert into words how difficult the problem is?"}, {"time": 4480, "text": "So there's and as you can expect, it's a mix."}, {"time": 4480, "text": "Some things become a lot easier or at least more flexible."}, {"time": 4492, "text": "Some things are harder."}, {"time": 4492, "text": "And so, you know, on the things that are like the tailwinds, the benefits, a big focus of automating trucking, especially initially, is really focusing on the long haul freeway stretch of it, where that's where a majority of the value is captured."}, {"time": 4507, "text": "On a freeway, you have a lot more structure and a lot more consistency across freeways across the U.S. compared to surface streets where you have a way higher dimensionality of what can happen, lack of structure, lack of consistency and variability across cities."}, {"time": 4523, "text": "So you can leverage that consistency to tackle, at least in that respect, a more constrained problem, which has some benefits to it."}, {"time": 4532, "text": "You can itemize much more of the sort of things you might encounter and so forth."}, {"time": 4532, "text": "And so those are benefits."}, {"time": 4537, "text": "Is there a canonical freeway and city we should be thinking about?"}, {"time": 4537, "text": "Like, is there is there a standard thing that's brought up in conversation often?"}, {"time": 4546, "text": "Like, here's a stretch of road."}, {"time": 4546, "text": "What is it like when people talk about traveling across country, they'll talk about New York, San Francisco."}, {"time": 4557, "text": "Is that the route?"}, {"time": 4557, "text": "Like, is there a stretch of road that's like nice and clean and then there's like cities with difficulties in them that you kind of think of as the canonical problem to solve here?"}, {"time": 4569, "text": "So starting with the car side."}, {"time": 4573, "text": "Well, Waymo very intentionally picked the Phoenix area and the San Francisco area as a follow."}, {"time": 4578, "text": "Once we hit driverless, where when you think of consumer transportation and ride sharing kind of economy, a big percentage of that market is captured in the densest cities in the United States."}, {"time": 4588, "text": "And so really pushing out and solving San Francisco becomes a really huge opportunity and importance and places one dot on kind of like the spectrum of complexity."}, {"time": 4600, "text": "The Phoenix area, starting with Chandler and then expanding more broadly in the Phoenix metropolitan area, it's I believe the fastest growing city in the US."}, {"time": 4608, "text": "It's a kind of a higher medium sized city, but growing quickly and still captures a really wide range of kind of complexities."}, {"time": 4616, "text": "And so getting to driverless there actually exposes you to a lot of the building blocks you need for the more complicated environments."}, {"time": 4623, "text": "And so in a lot of ways, there's a thesis that if you start to kind of place a few of these kind of dots where San Francisco has these types of unique challenges, dense pedestrians, all this like complexity, especially when you get into the downtown areas and so forth."}, {"time": 4635, "text": "And Phoenix has like a really interesting kind of spectrum of challenges, maybe other ones like LA kind of add freeway focus and so forth."}, {"time": 4643, "text": "You start to kind of cover the full set of features that you might expect and it becomes faster and faster if you have the right systems and the right organization to then open up the fifth city and the 10th city and the 20th city."}, {"time": 4655, "text": "On trucking, there's similar properties where obviously there's uniquenesses and freeways when you get into really dense environments and then the real opportunity to then get even more valuous to think about how you expand with like some of the surface free challenges."}, {"time": 4667, "text": "But for example, right now we're looking we have a big facility that we're finishing building in Q1 in Dallas area."}, {"time": 4678, "text": "That'll allow us to do testing from the Dallas area on routes like Dallas to Houston, Dallas to Phoenix, going out east."}, {"time": 4685, "text": "Dallas to Austin."}, {"time": 4687, "text": "Austin to that triangle."}, {"time": 4689, "text": "Waymo should come to Austin."}, {"time": 4691, "text": "Well, Waymo the car side wasn't Austin for a while."}, {"time": 4694, "text": "Come back."}, {"time": 4696, "text": "But trucking is actually, Texas is one of the best places to start because of both volume, regulatory weather, there's a lot of benefits."}, {"time": 4703, "text": "On trucking, a huge opportunity is Port of LA going east."}, {"time": 4707, "text": "So in a lot of ways, a lot of the work is to start to stitch together a network and converge to Port of LA where you have the biggest port in the United States."}, {"time": 4717, "text": "And the amount of goods going east from there is pretty tremendous."}, {"time": 4717, "text": "And then obviously, there's, you know, kind of channels everywhere."}, {"time": 4717, "text": "And then you have extra complexities as you get into like snow and increment weather and so forth."}, {"time": 4728, "text": "But what's interesting about trucking is every single route segment that you add increases the value of the whole network."}, {"time": 4734, "text": "And so it has this kind of network effect and cumulative effect that's very unique."}, {"time": 4734, "text": "And so there's all these dimensions that we think about."}, {"time": 4740, "text": "And so in a lot of ways, Dallas is a really unique hub that opens up a lot of options has become a really valuable lever."}, {"time": 4746, "text": "So the million questions I could ask you, first of all, you mentioned level four."}, {"time": 4751, "text": "For people who totally don't know, there's these levels of automation that level four refers to kind of the first step that you could recognize as fully autonomous driving."}, {"time": 4764, "text": "Level five is really fully autonomous driving and level four is kind of fully autonomous driving."}, {"time": 4770, "text": "And then there are specific definitions, depending on who you ask what that actually means."}, {"time": 4770, "text": "But for you, what does the level four mean?"}, {"time": 4778, "text": "And you mentioned freeway."}, {"time": 4778, "text": "Let's say like there's three parts of long haul trucking."}, {"time": 4783, "text": "Maybe I'm wrong in this, but there's freeway driving."}, {"time": 4783, "text": "There's like truck stop."}, {"time": 4789, "text": "And then there's more urban type of area."}, {"time": 4794, "text": "So which of those do you want to tackle?"}, {"time": 4794, "text": "Which of them do you include under level four?"}, {"time": 4800, "text": "Like how do you think about this problem?"}, {"time": 4800, "text": "What do you focus on?"}, {"time": 4800, "text": "What is the biggest impact to be had in the short term?"}, {"time": 4805, "text": "So the goal is that we got to get to market as fast as we can, because the moment you get to market, you just learn so much and it influences everything that you do."}, {"time": 4813, "text": "And it is one of the experiences I carried over from before is that you add constraints."}, {"time": 4820, "text": "You figure out the right compromises."}, {"time": 4820, "text": "You do whatever it takes because getting to market is so critical."}, {"time": 4825, "text": "But here with autonomous driving, you can get to market in so many different ways."}, {"time": 4828, "text": "And so one of the simplifications that we intentionally have put on is using what we call transfer hubs, where you can imagine depots that are at the entry points to metropolitan areas, like let's say Dallas, like the hub that we're building, which does a few things that are very valuable."}, {"time": 4847, "text": "So from a first product standpoint, you can automate transfer hub to transfer hub."}, {"time": 4852, "text": "And that path from the transfer hub to the full freeway route can be a very intentional single route that you can select for the features that you feel you want to handle at that point in time."}, {"time": 4864, "text": "And you build the hub specifically designed for autonomous trucking."}, {"time": 4868, "text": "And that's what's going to happen, actually."}, {"time": 4868, "text": "And you need to come out in January and check it out because it's going to be really cool."}, {"time": 4873, "text": "Not only is it our main operating headquarters for our fleet there, but it will be the first fully ground up designed driverless hub for autonomous trucks in terms of where do they enter, where do they depart, how do you think about the flow of people, goods, everything."}, {"time": 4889, "text": "It's quite cool and it's really beautiful on how it's thought through."}, {"time": 4892, "text": "And so early on, it is totally reasonable to do the last five miles manually to get to the final kind of depot to avoid having to solve the general surface street problem, which is obviously very complex."}, {"time": 4904, "text": "Now, when the time comes and we are increasingly, already we're pushing on some of this, but we will increasingly be pushing on surface street capabilities to build out the value chain to go all the way depot to depot instead of transfer hub to transfer hub."}, {"time": 4917, "text": "And we have probably the best advantages in the world because of all the Waymo experience on surface streets, but that's not the highest ROI right now where the highest ROI is hub to hub and get the routes going."}, {"time": 4927, "text": "And so when you ask what's L4, L4 can be applied to any operating domain or scope, but it's effectively for the places where we say we're ready for autonomous operation."}, {"time": 4937, "text": "We are 100% operating as a self driving truck with no human behind the wheel."}, {"time": 4947, "text": "That is L4 autonomy."}, {"time": 4947, "text": "And it doesn't mean that you operate in every condition, it doesn't mean you operate on every road, but for a particularly well defined area, operating conditions, routes, kind of domain, you are fully autonomous."}, {"time": 4960, "text": "And that's the difference between L4 and L5."}, {"time": 4960, "text": "And most people would agree that at least anytime in the foreseeable future, L5 is just not even really worth thinking about because there's always going to be these extremes."}, {"time": 4970, "text": "And so it's a race and almost like a game where you think of what is the sequence of expanded capabilities that create the most value and teach us the most and create this feedback loop where we're building out and unlocking more and more capability over time."}, {"time": 4985, "text": "I gotta ask you, just curious."}, {"time": 4985, "text": "So first of all, I have to, when I'm allowed, visit the Dallas facility because it's super cool."}, {"time": 4985, "text": "It's like robot on the giving and the receiving end."}, {"time": 4985, "text": "The truck is a robot and the hub is a robot."}, {"time": 5000, "text": "Yeah, it's got to be very robot friendly."}, {"time": 5002, "text": "I will feel at home."}, {"time": 5002, "text": "What's the sensor suite like on the hub if you can just high level mention it?"}, {"time": 5002, "text": "Does the hub have like lidars?"}, {"time": 5002, "text": "Is the truck doing most of the intelligence or is the hub also intelligent?"}, {"time": 5020, "text": "Yeah, so most of it will be the truck and everything is like connected."}, {"time": 5020, "text": "So we have our servers where we know exactly where every truck is."}, {"time": 5020, "text": "We know exactly what's happening at a hub."}, {"time": 5020, "text": "And so you can imagine like a large backend system that over time starts to manage timings, goods, delivery, windows, all these sort of things."}, {"time": 5038, "text": "And so you don't actually need to, there might be special cases where that is valuable to equip some sensors in the hub, but a majority of the intelligence is going to be on the truck because whatever's relevant to the truck, relevant should be seen by the truck and can be relayed remotely for any sort of kind of cognizance or decision making."}, {"time": 5059, "text": "But there's a distinct type of workflow where do you check trucks?"}, {"time": 5059, "text": "Where do you want them to enter?"}, {"time": 5059, "text": "What if there's many operating at once?"}, {"time": 5059, "text": "Where's the staging area to depart?"}, {"time": 5059, "text": "How do you set up the flow of humans and human cars and traffic so that you minimize the interaction between humans and kind of self driving trucks?"}, {"time": 5078, "text": "And then how do you even intelligently select the locations of these transfer hubs that are both really great service locations for a metropolitan area?"}, {"time": 5078, "text": "And there could be over time, many of them for a metropolitan area while at the same time leaning into the path of least resistance to lean into your current capabilities and strengths so that you minimize the amount of work that's necessary to unlock the next kind of big bar."}, {"time": 5101, "text": "I have a million questions."}, {"time": 5101, "text": "So first, is the goal to have no human in the truck?"}, {"time": 5106, "text": "The goal is to have no human in the truck."}, {"time": 5106, "text": "Now, of course, right now we're testing with expert operators and so forth."}, {"time": 5106, "text": "But the goal is to... Now, there might be circumstances where it makes sense to have a human or... And obviously, these trucks can also be manually driven."}, {"time": 5120, "text": "So sometimes we talk with our fleet partners about how you can buy a Waymo equipped Dymor truck down the road and on the routes that are autonomous, it's autonomous."}, {"time": 5120, "text": "On the routes that are not, it's human driven."}, {"time": 5120, "text": "Maybe there's L2 functionality that adds safety systems and so forth."}, {"time": 5137, "text": "But as soon as they become, as soon as we expand in software, the availability of driverless routes, the hardware is forward compatible to just now start using them in real time."}, {"time": 5137, "text": "And so you can imagine this mixed use."}, {"time": 5151, "text": "But at the end of the day, the largest value proposition is where you're able to have no constraints on how you can operate this truck."}, {"time": 5151, "text": "And it's 100% autonomous with nobody inside."}, {"time": 5161, "text": "So the... Let me ask on the logistics front, because you mentioned that also opportunity to revamp or for build from scratch some of the ideas around logistics."}, {"time": 5172, "text": "I don't want to throw too much shade, but from talking to Steve, my understanding is logistics is not perhaps as great as it could be in the current trucking environment."}, {"time": 5183, "text": "I'm not, maybe you can break down why, but there's probably competing companies."}, {"time": 5183, "text": "There's just a mess."}, {"time": 5183, "text": "Maybe some of it is literally just, it's old school."}, {"time": 5192, "text": "Like they, it's just like, it's not computer, it's not computerized."}, {"time": 5192, "text": "Like truckers are almost like contractors."}, {"time": 5199, "text": "There's an independence and there's not a nice interface where they can communicate where they're going, where they're at, you know, all those kinds of things."}, {"time": 5206, "text": "And so there, it just feels like there's so much opportunity to digitize everything to where you could optimize the use of human time, optimize the use of all kinds of resources."}, {"time": 5217, "text": "How much are you thinking about that problem?"}, {"time": 5217, "text": "How fascinating is that problem?"}, {"time": 5223, "text": "How much opportunity is there to revolutionize the space of logistics in autonomous trucking, in trucking period?"}, {"time": 5229, "text": "It's pretty fascinating."}, {"time": 5229, "text": "It's one of the most motivating aspects of all this where like, yes, there's like a mountain of problems that are like you want to, you have to solve to get to like the first checkpoints and first drivers and so forth."}, {"time": 5240, "text": "And inevitably, like in a space like this, you plug in initially into the existing kind of system and start to kind of, you know, learn and iterate."}, {"time": 5247, "text": "But that opportunity is massive."}, {"time": 5247, "text": "And so, you know, a couple of the factors that play into it."}, {"time": 5252, "text": "So first of all, there's obviously just the physical constraints of driving time, driver availability."}, {"time": 5259, "text": "Some fleets have a 95% attrition rate, you know, right now because of just this demands and like, you know, kind of gaps in competition and so forth."}, {"time": 5268, "text": "And then it's also incredibly fragmented where you would be shocked at like when you look at industries, like when you think of the top 10 players, like the biggest fleets, like the Walmarts and FedExes and so forth."}, {"time": 5278, "text": "The percentage of the overall trucking market that's captured by the top 10 or 50 fleets is surprisingly small."}, {"time": 5284, "text": "The average kind of truck operation is like a one to five truck, you know, family business."}, {"time": 5291, "text": "And so and so there's just like a huge amount of like fragmentation, which makes for really interesting challenges in kind of stitching together through like bulletin boards and brokerages and some people run their own fleets."}, {"time": 5304, "text": "And this world's kind of like evolving, but it is one of the less digitized and optimized worlds that there is."}, {"time": 5314, "text": "And the part that is optimized is optimized to the constraints of today."}, {"time": 5318, "text": "And even within the constraints of today, this is a 900 billion dollar industry in the US and it's continuing to grow."}, {"time": 5324, "text": "It feels like from a business perspective, if I were to predict that while trying to solve the autonomous trucking problem, Waymo might solve first the logistics problem because that would already be a huge impact."}, {"time": 5339, "text": "So on the way to solving autonomous trucking, the human driven, like there's so much opportunity to significantly improve the human driven trucking, the timing, the logistics."}, {"time": 5339, "text": "So you use humans optimally."}, {"time": 5354, "text": "You use handoffs to like, you know, well, even you get really ambitious, you start to expand this beyond like how does the fulfillment center work and like how does the transfer hub work, how does the warehouse work?"}, {"time": 5369, "text": "I mean, there's a lot of opportunities to start to automate these chains."}, {"time": 5369, "text": "And a lot of the inefficiency today is because like you have a delay, like Port of LA has a bunch of ships right now waiting outside of it because they can't dock because there's not enough labor inside of the Port of LA."}, {"time": 5382, "text": "There's a big backlog of trucks, which means there's a big backlog of deliveries, which means the drivers aren't where they need to be."}, {"time": 5382, "text": "And so you have this like huge chain reaction and your feasibility of readjusting in this network is low because everything's tied to humans and manual kind of processes or distributed processes across a whole bunch of players."}, {"time": 5400, "text": "And so one of the biggest enablers is, yes, we have to solve autonomous trucking first."}, {"time": 5400, "text": "And that, by the way, that's not like an overnight thing."}, {"time": 5400, "text": "That's decades of continued kind of expansion and work."}, {"time": 5400, "text": "But the first checkpoint in the first route is like is not that far off."}, {"time": 5416, "text": "But once you start enabling and you start to learn about how the constraints of autonomous trucking, which are very, very different than the constraints of human trucking and again, strengths and weaknesses, how do you then start to leverage that and rethink a flow of goods more broadly?"}, {"time": 5434, "text": "And this is where like the learnings of like really partnering with some of the largest fleets in the US and the sort of learnings that they have about the industry and the sort of needs that they have."}, {"time": 5434, "text": "And what would change if you just like really broke this one constraint that like holds up the whole network?"}, {"time": 5450, "text": "Or what if you enable this other constraint?"}, {"time": 5450, "text": "That actually drives the roadmap in a lot of ways because this is not like an all or nothing problem."}, {"time": 5450, "text": "You start to kind of unlock more and more functionality over time, which functionality most enables this optimization ends up being kind of part of the discussion."}, {"time": 5467, "text": "But you're totally right."}, {"time": 5467, "text": "Like you fast forward to like five years, 10 years, 15 years, and you think about like very generalized capability of automation and logistics, as well as the ability to like poke into how those handoffs work."}, {"time": 5483, "text": "The efficiency goes far beyond just direct cost of today's like unit economics of a truck."}, {"time": 5483, "text": "They go towards reinventing the entire system in the same way that you see these other industries that like when you get to enough scale, you can really rethink how you build around your new set of capabilities, not the old set of capabilities."}, {"time": 5503, "text": "Yeah, use the analogy metaphor or whatever that autonomous trucking is like email versus mail."}, {"time": 5503, "text": "And then with email, you're still doing the communication, but it opens up all kinds of communities, varieties of communication that you didn't anticipate."}, {"time": 5517, "text": "Constraints are just completely different."}, {"time": 5517, "text": "And yeah, there's a definitely a property of that here."}, {"time": 5522, "text": "And we're also still learning about it because there is a lot of really fascinating and sometimes really elegant things that the industry has done where there's companies whose entire existence is around, despite the constraints, optimizing as much as they can out of it."}, {"time": 5536, "text": "And those lessons do carry over."}, {"time": 5536, "text": "But it's an interesting kind of merger of worlds to think about like, well, what if this was completely different?"}, {"time": 5536, "text": "How would we approach it?"}, {"time": 5545, "text": "And the interesting thing is that for a really, really, really long time, it's actually going to be the merger between how to use autonomy and how to use humans that leans into each of their strengths."}, {"time": 5556, "text": "And then we're back to Cosmo, human robot interaction."}, {"time": 5560, "text": "So and the interesting thing about Waymo is because there's the passenger vehicle, the human, the transportation of humans and transportation of goods, you could see over time, they may kind of meld together more because you'll probably have like zero occupancy vehicles moving around."}, {"time": 5576, "text": "So you have transportation of goods for short distances and then for slightly longer distances and then slightly longer and then there'll be this, then you just see the difference between a passenger vehicle and a truck is just size and you can have different sizes and all that kind of stuff."}, {"time": 5591, "text": "And at the core, you can have a Waymo driver that doesn't, as long as you have the same sense of suite, you can just think of it as one problem."}, {"time": 5597, "text": "And that's why over time, these do kind of converge where in a lot of ways, a lot of the challenges we're solving are freeway driving, which are going to carry over very well to the vehicles, to the car side."}, {"time": 5608, "text": "But there are like then unique challenges like you have a very different dynamics in your vehicle where you have to see much further out in order to have the proper response time because you have an 80,000 pound fully loaded truck."}, {"time": 5621, "text": "That's a very, very different type of breaking profile than a car."}, {"time": 5624, "text": "You have a really interesting kind of dynamic limits because of the trailer where you actually, it's very, very hard to like physically like flip a car or do something like physically like most risk in a car is from just collisions."}, {"time": 5638, "text": "It's very hard to like in any normal operation to do something other than like unless you hit something to actually kind of like roll over something on a truck, you actually have to drive much closer to the physical bounds of the safety limits."}, {"time": 5650, "text": "But you actually have like real constraints because you could have really interesting interactions between the cabin and the trailer."}, {"time": 5660, "text": "There's something called jackknifing if you turn too quickly, you have roll risk and so forth."}, {"time": 5665, "text": "And so we spent a huge amount of time understanding those boundaries and those boundaries change based on the load that you have, which is also an interesting difference."}, {"time": 5672, "text": "You have to propagate that through the algorithm so that you're leveraging your dynamic range, but always staying within the safety bounds, but understanding what those safety bounds are."}, {"time": 5681, "text": "And so we have this like really cool test facility where we like take it to the max and actually imagine a truck with these giant training wheels on the back of the trailer and you're pushing it past the safety limits in order to like try to actually see where it rolls."}, {"time": 5695, "text": "And so you define this high dimensional boundary, which then gets captured in software to stay safe and actually do the right thing."}, {"time": 5702, "text": "But it's kind of fascinating the sort of kind of challenges you have there."}, {"time": 5706, "text": "But then all of these things drive really interesting challenges from perception to unique behavior prediction challenges."}, {"time": 5712, "text": "And obviously in Planner where you have to think about merging and creating gaps with a 53 foot trailer and so forth."}, {"time": 5719, "text": "And then obviously the platform itself is very different."}, {"time": 5719, "text": "We have different numbers of sensors, sometimes types of sensors, and you also have unique blind spots that you have because of the trailer, which you have to think about."}, {"time": 5728, "text": "And so it's a really interesting spectrum."}, {"time": 5728, "text": "And in the end, you try to capture these special cases in a way that is cleanly augmentations of the existing tech stack because a majority of what we're solving is actually generalizable to freeway driving and different platforms."}, {"time": 5746, "text": "And over time, they all start to kind of merge ideally where the things that are unique are as minimal as possible."}, {"time": 5754, "text": "And that's where you get the most leverage."}, {"time": 5754, "text": "And that's why Waymo can take on two trillion dollar opportunities and have been nowhere near 2x the cost or investment or size."}, {"time": 5765, "text": "In fact, it's much, much smaller than that because of the high degree of leverage."}, {"time": 5770, "text": "So what kind of sensor suite they can speak to that a long haul truck needs to have?"}, {"time": 5770, "text": "Lidar, vision, how many?"}, {"time": 5781, "text": "Yeah, so it's more than the car."}, {"time": 5781, "text": "So very loosely you can think of it as like 2x, but it varies depending on the sensor."}, {"time": 5787, "text": "And so we have like dozens of cameras, radar, and then multiple Lidar as well."}, {"time": 5793, "text": "You'll see one difference where the cars have a central main sensor pod on the roof in the middle and then some kind of hood sensors for blind spots."}, {"time": 5802, "text": "The truck moves to two main sensor pods on the outsides where you would typically have the mirrors next to the driver."}, {"time": 5808, "text": "They effectively go as far out as possible, kind of up to the front, kind of on the cabin, not all the way in the front, but like kind of where the mirrors for the driver would be."}, {"time": 5819, "text": "And so those are the main sensor pods."}, {"time": 5819, "text": "And the reason they're there is because if you had one in the middle, the trailer is higher than the cabin and you would be occluded with this like awkward wedge."}, {"time": 5828, "text": "Too much occlusion."}, {"time": 5829, "text": "And so then you would add a lot of complexity to the software to make up for that and just unnecessary complexity."}, {"time": 5835, "text": "There's so many probably fascinating design choices here."}, {"time": 5838, "text": "Because you can probably bring up a Lidar higher and have it in the center or something."}, {"time": 5841, "text": "You could have all kinds of choices to make the decisions here that ultimately probably will define the industry."}, {"time": 5847, "text": "But by having two on the side, there's actually multiple benefits."}, {"time": 5850, "text": "So one is like you're just beyond the trailer so you can see fully flush with the trailer."}, {"time": 5856, "text": "And so you eliminate most of your blind spot except for right behind the trailer, which is great because now the software carries over really well."}, {"time": 5863, "text": "And the same perception system you use on the car side, largely that architecture can carry over and you can retrain some models and so forth that you leverage it a lot."}, {"time": 5871, "text": "It also actually helps with redundancy where there's a really not nice built in redundancy for all the Lidar cameras and radar where you can afford to have any one of them fail and you're still OK. And at scale, every one of them will fail."}, {"time": 5884, "text": "And you will be able to detect when one of them fails because they don't because the redundancy that they're giving you the data that's inconsistent with the rest of that's right."}, {"time": 5893, "text": "And it's not just like they no longer give data."}, {"time": 5893, "text": "It could be like they're fouled or they stop giving data where some electrical thing gets cut or part of your compute goes down."}, {"time": 5903, "text": "So what's neat is that like you have way more sensors."}, {"time": 5903, "text": "Part of his field of view and occlusions, part of its redundancy and part of it is new use cases."}, {"time": 5910, "text": "So there's new types of sensors to optimize for long range and kind of the sensing horizon that we look for on our vehicles that is unique to trucks because it actually is like kind of much like further out than than a car."}, {"time": 5927, "text": "But a majority are actually used across both cars and trucks."}, {"time": 5927, "text": "And so we use the same compute, the same fundamental baseline sensors, cameras, radar, IMUs."}, {"time": 5937, "text": "And so you get a great leverage from all of the infrastructure and the hardware development as a result."}, {"time": 5941, "text": "So what about cameras?"}, {"time": 5941, "text": "What role does."}, {"time": 5941, "text": "So LIDAR is this rich set of information that has its strengths, has some weaknesses."}, {"time": 5950, "text": "Camera is this rich source of information that has some strengths, has its weaknesses."}, {"time": 5956, "text": "What role does LIDAR play?"}, {"time": 5956, "text": "What role does vision cameras play in this beautiful problem of autonomous trucking?"}, {"time": 5965, "text": "There's like so much that comes together."}, {"time": 5968, "text": "And how much and at which point do they come together?"}, {"time": 5971, "text": "So I'll start with LIDAR."}, {"time": 5971, "text": "So LIDAR has been like Waymo's, one of Waymo's big strengths and advantages where we developed our own LIDAR in house where many generations in both in cost and functionality."}, {"time": 5985, "text": "It is the best in this space."}, {"time": 5989, "text": "Which generation?"}, {"time": 5989, "text": "Because I know there's this there's this cool."}, {"time": 5989, "text": "I mean, I love versions that are increasing."}, {"time": 5996, "text": "Which version of the hardware stack is it currently, officially, publicly?"}, {"time": 6001, "text": "So some parts iterate more than others."}, {"time": 6001, "text": "I'm trying to remember on the sensor side."}, {"time": 6005, "text": "So the entire self driving system, which includes sensors and compute, is fifth generation."}, {"time": 6010, "text": "I can't wait until there's like iPhone style like announcements for like new versions of the Waymo hardware."}, {"time": 6019, "text": "Well, we try to be careful because, man, when you change the hardware, it takes a lot to like retrain the models and everything."}, {"time": 6024, "text": "So we just went through that and going from the Pacificus to the Jaguars."}, {"time": 6027, "text": "And so the Jaguars and then the trucks are, you know, have the same generation now."}, {"time": 6031, "text": "But yeah, the LIDAR is it's incredible."}, {"time": 6031, "text": "And so Waymo has leaned into that as a strength."}, {"time": 6036, "text": "And so a lot of the near range perception system that obviously kind of carries over a lot from the car side uses LIDAR as a very prominent kind of like primary sensor."}, {"time": 6046, "text": "But then obviously everything has its strengths and weaknesses."}, {"time": 6049, "text": "And so in the near range, LIDAR is a gigantic advantage and it has its weaknesses on when it comes to occlusions in certain areas, rain and weather, like things like that."}, {"time": 6061, "text": "But it's an incredible sensor and it gives you incredible density, perfect location precision and consistency, which is a very valuable property to be able to kind of apply ML approaches."}, {"time": 6073, "text": "Can you elaborate consistency?"}, {"time": 6075, "text": "When you have a camera, the position of the sun, the time of the day, various of the properties can have a big impact, whether there's glare, the field of view, things like that."}, {"time": 6086, "text": "So consistent in the face of a changing external environment, the signal."}, {"time": 6094, "text": "Daytime, nighttime."}, {"time": 6094, "text": "It's about 3D physical existence, in effect, like you're seeing beams of light that physically bounce off of something and come back."}, {"time": 6105, "text": "And so whatever the conditional conditions are, like the shape of a human sensor reading from a human or from a car or from an animal, like you have a reliability there, which ends up being valuable for kind of like the long tail of challenges."}, {"time": 6120, "text": "So LIDAR is the first sensor to drop off in terms of range and ours has a really good range, but at the end of the day, it drops off."}, {"time": 6147, "text": "Now, cameras have the incredible range where you get a high density, high resolution camera, you can get data, you know, well past a kilometer and it's like really potentially a huge value."}, {"time": 6160, "text": "Now, the signal drops off, the noise is higher, detecting is harder, classifying is harder and one that you may not think about localizing is harder because you can be off by like two meters and where something's located a kilometer away."}, {"time": 6174, "text": "And that's the difference between being on the shoulder and being in your lane."}, {"time": 6174, "text": "And so you have like interesting challenges there that you have to solve, which have a bunch of approaches that come into it."}, {"time": 6181, "text": "Radar is interesting because it also has longer range than LIDAR and it gives you speed information."}, {"time": 6192, "text": "So it becomes very, very useful for dynamic information of traffic flow, vehicle motions, animals, pedestrians, like just things that might be useful signals."}, {"time": 6204, "text": "And it helps with weather conditions where radar actually penetrates weather conditions in a better way than other sensors."}, {"time": 6210, "text": "And so it's kind of interesting where we've kind of started to converge towards not thinking about a problem as a LIDAR problem or a camera problem or radar problem, but it's a fusion problem where these are all like large scale ML problems where you put data into the system."}, {"time": 6226, "text": "And in many cases, you just look for the signals that might be present in the union of all of these and leave it to the system as much as possible to start to really identify how to how to extract that."}, {"time": 6226, "text": "And then there's places we have to intervene and actually include more."}, {"time": 6241, "text": "But no single sensor is in a great position to really solve this problem and then without a huge extra challenge."}, {"time": 6248, "text": "There's a question that's probably still an open question is at which point do you fuse them?"}, {"time": 6248, "text": "Do you solve the perception problem for each sensor suite individually, the LIDAR suite and the camera suite?"}, {"time": 6264, "text": "Or do you do some kind of heterogeneous fusion or do you fuse at the very beginning?"}, {"time": 6264, "text": "Is there a good answer or at least an inkling of intuitions you can come up with?"}, {"time": 6275, "text": "Yeah, so people refer to this as early fusion or late fusion."}, {"time": 6275, "text": "So late fusion might be that you have the camera pipeline, the LIDAR pipeline, and then you fuse them and when it gets to final semantics and classification and tracking, you fuse them together and figure out which one's best."}, {"time": 6293, "text": "There's more and more evidence that early fusion is important, and that is because late fusion does not allow you to pick up on the complementary strengths and weaknesses of the sensors."}, {"time": 6307, "text": "Weather is a great example where if you do early fusion, you have an incredibly hard problem for any single sensor in rain to solve that problem because you have reflections from the LIDAR, you have weird kind of noise from the camera, blah, blah, blah."}, {"time": 6324, "text": "But the combination of all of them can help you filter and help you get to the real signal that then gets you as close as possible to the original stack."}, {"time": 6332, "text": "And be much more fluid about the strengths and weaknesses where your camera is much more susceptible to fouling on the actual lens from rain or random stuff, whereas you might be a little bit more resilient in other sensors."}, {"time": 6348, "text": "So there's an element of logic that always happens late in the game, but that fusion early on, especially as you move towards ML and large scale data driven approaches, just maximizes your ability to pull out the best signal you can out of each modality before you start making constraining decisions that end up being hard to unwind late in the stack."}, {"time": 6366, "text": "So how much of this is a machine learning problem?"}, {"time": 6366, "text": "What role does ML, machine learning, play in this whole problem of autonomous driving, autonomous trucking?"}, {"time": 6376, "text": "It's massive, and it's increasing over time."}, {"time": 6376, "text": "If you go back to the grand challenge days and the early days of AV development, there was ML, but it was not in the mass scale data style of ML."}, {"time": 6392, "text": "It was like learning models, but in a more structured kind of way."}, {"time": 6392, "text": "And it was a lot of heuristic and search based approaches and planning and so forth."}, {"time": 6392, "text": "You can make a lot of progress with these types of approaches kind of across the board and almost deceptive amount of progress."}, {"time": 6406, "text": "We can get pretty far, but then you start to really grind the further you get in some parts of the stack if you don't have an ability to absorb a massive amount of experience in a way that scales very sublinearly in terms of human labor and human attention."}, {"time": 6419, "text": "And so when you look at the stack, the perception side is probably the first to get really revolutionized by ML, and it goes back many years because ML for computer vision and these types of approaches kind of took off with a lot of the early kind of push in deep learning."}, {"time": 6436, "text": "And so there's always a debate on the spectrum between end to end ML, which is a little bit too far to how you architect it to where you have modules, but enough ability to think about long tail problems and so forth."}, {"time": 6475, "text": "And that has been one of the realizations as you drive tens of millions of miles and try to solve new expansions of domains without regressing your old ones, it becomes intractable for a human to approach that in the way that traditionally robotics has kind of approached some elements of the tech stack."}, {"time": 6492, "text": "So are you trying to create a data pipeline specifically for the trucking problem?"}, {"time": 6492, "text": "How much leveraging of the autonomous driving is there in terms of data collection?"}, {"time": 6492, "text": "And how unique is the data required for the trucking problem?"}, {"time": 6510, "text": "So we reuse all the same infrastructure, so labeling workflows, ML workflows, everything, so that actually carries over quite well."}, {"time": 6510, "text": "We heavily reuse the data even, where almost every model that we have on a truck, we started with the latest car model."}, {"time": 6526, "text": "So it's almost like a good back arm model."}, {"time": 6529, "text": "Yeah, it's like you can think of like, despite the different domain and different numbers of sensors and position of sensors, there's a lot of signals that carry over across driving."}, {"time": 6529, "text": "And so it's almost like pre training and getting a big boost out of the gate where you can reduce the amount of data you need by a lot."}, {"time": 6543, "text": "And it goes both ways, actually."}, {"time": 6543, "text": "And so we're increasingly thinking about our data strategy on how we leverage both of these."}, {"time": 6549, "text": "So you think about, you know, how other agents react to a truck."}, {"time": 6549, "text": "Yeah, it's a little bit different, but the fundamentals are actually like, what will other vehicles in the road do?"}, {"time": 6549, "text": "There's a lot of carry over that's possible."}, {"time": 6559, "text": "And in fact, just to give you an example, we're constantly kind of like adding more data from the trucking side."}, {"time": 6566, "text": "But as of right now, when we think of our, like one of our models, behavior prediction for other agents on the road, like vehicles, 85% of that data comes from cars."}, {"time": 6578, "text": "And a lot of that 85% comes from surface streets, because we just had so much of it, and it was really valuable."}, {"time": 6578, "text": "And so we're adding in more and more, particularly in the areas where we need more data, but you get a huge boost out of the gate."}, {"time": 6590, "text": "Just all different visual characteristics of roads, lane markings, pedestrians, all that that's still relevant."}, {"time": 6596, "text": "It's all still relevant."}, {"time": 6596, "text": "And then just the fundamentals of how, you know, you detect the car."}, {"time": 6596, "text": "Does it really change that much, whether you're detecting it from a car or a truck?"}, {"time": 6605, "text": "The fundamentals of how a person will walk around your vehicle is that it'll change a little bit."}, {"time": 6610, "text": "But the basics, like there's a lot of signal in there that as a starting point to a network can actually be very valuable."}, {"time": 6616, "text": "Now, we do have some very unique challenges where there's a sparsity of events on a freeway."}, {"time": 6620, "text": "The frequency of events happening on a freeway, whether it's interesting objects in the road or incidents or even like from a human benchmark, like how often does a human have an accident on a freeway is far more sparse than on a surface street."}, {"time": 6635, "text": "And so that leads to really interesting data problems where you can't just drive infinitely to encounter all the different permutations of things you might encounter."}, {"time": 6643, "text": "And so there you get into interesting tools like structure testing and data collection, data augmentation and so forth."}, {"time": 6650, "text": "And so there's really interesting kind of technical challenges that push some of the research that enables these new new suites of approaches."}, {"time": 6659, "text": "What role does simulation play?"}, {"time": 6659, "text": "Really good question."}, {"time": 6659, "text": "So Waymo simulates about a thousand miles for every mile it drives."}, {"time": 6666, "text": "So you think of in both."}, {"time": 6666, "text": "So across the board, across the board."}, {"time": 6666, "text": "So you think of, for example, well, if we've driven over 20 million miles, that's over 20 billion miles in simulation."}, {"time": 6678, "text": "Now, how do you use simulation?"}, {"time": 6678, "text": "It's a multipurpose."}, {"time": 6678, "text": "So you use it for basic development."}, {"time": 6685, "text": "So you want to do make sure you have regression, prevention and protection of everything you're doing."}, {"time": 6692, "text": "When you encounter something interesting in the world, let's say there was an issue with how the vehicle behaved versus an ideal human."}, {"time": 6698, "text": "You can play that back in simulation and start augmenting your system and seeing how you would have reacted to that scenario with this improvement or this new area."}, {"time": 6706, "text": "You can create scenarios that become part of your regression set after that point."}, {"time": 6711, "text": "Then you start getting into like really, really kind of hill climbing where you say, hey, I need to improve this system."}, {"time": 6718, "text": "I have these metrics are really correlated with final performance."}, {"time": 6718, "text": "How do I know how well I'm doing operation?"}, {"time": 6724, "text": "The actual physical driving is the least efficient form of testing and it's expensive."}, {"time": 6728, "text": "It's time consuming."}, {"time": 6728, "text": "So grabbing a large scale batch of historical data and simulating it to get a signal of over these last or just random sample of one hundred thousand miles."}, {"time": 6740, "text": "How has this metric changed versus where we are today?"}, {"time": 6740, "text": "You can do that far more efficiently in simulation than just driving with that new system on board."}, {"time": 6748, "text": "And then you go all the way to the validation phase where to actually see your human relative safety of like how well are you performing on the car side or the trucking side relative to a human."}, {"time": 6759, "text": "A lot of that safety case is actually driven by taking all of the physical operational driving, which probably includes a lot of interventions where the driver took over just in case."}, {"time": 6773, "text": "And then you simulate those forward and see if would anything have happened."}, {"time": 6773, "text": "And in most cases, the answer is no."}, {"time": 6779, "text": "But you can simulate it forward and you can even start to do really interesting things where you add virtual agents to create harder environments."}, {"time": 6787, "text": "You can fuzz the locations of physical agents."}, {"time": 6787, "text": "You can muck with the scene and stress test the scenario from a whole bunch of different dimensions."}, {"time": 6795, "text": "And effectively, you're trying to like more efficiently sample this like infinite dimensional space, but try to encounter the problems as fast as possible."}, {"time": 6803, "text": "Because what most people don't realize is the hardest problem in autonomous driving is actually the evaluation problem in many ways, not the actual autonomy problem."}, {"time": 6811, "text": "And so if you could, in theory, evaluate perfectly and instantaneously, you can solve that problem in a really fast feedback loop quite well."}, {"time": 6819, "text": "But the hardest part is being really smart about this suite of approaches on how can you get an accurate signal on how well you're doing as quickly as possible in a way that correlates to physical driving."}, {"time": 6831, "text": "Can you explain the evaluation problem?"}, {"time": 6831, "text": "Which metric are you evaluating towards?"}, {"time": 6831, "text": "Are we talking about safety?"}, {"time": 6831, "text": "What are the performance metrics that we're talking about?"}, {"time": 6840, "text": "So in the end, you care about end safety."}, {"time": 6840, "text": "That's what's deceptive where there's a lot of companies that have a great demo."}, {"time": 6850, "text": "The path from a really great demo to being able to go driverless can be deceptively long, even when that demo looks like it's driverless quality."}, {"time": 6858, "text": "And the difference is that the thing that keeps you from going driverless is not the stuff you encounter in a demo."}, {"time": 6863, "text": "It's the stuff that you encounter once at 100,000 miles or 500,000 miles."}, {"time": 6867, "text": "And so that is at the root of what is most challenging about going driverless because any issue you encounter, you can go and fix it."}, {"time": 6876, "text": "But how do you know you didn't create five other issues that you haven't encountered yet?"}, {"time": 6880, "text": "So those were painful learnings in Waymo's history that Waymo went through and led to us then finally being able to go driverless in Phoenix and now are at the heart of how we develop."}, {"time": 6892, "text": "Evaluation is simultaneously evaluating final kind of end safety of how ready are you to go driverless, which may be as direct as what is your collision, human relative kind of collision rate for all these types of scenarios and and severities to make sure that you're better than a human bar by a good amount."}, {"time": 6917, "text": "But that's not actually the most useful for development."}, {"time": 6919, "text": "For development, it's much more kind of analog metrics that are part of the art of finding how, what are the properties of driving that give you a way quicker signal that's more sensitive than a collision that can correlate to the quality you care about and push the feedback loop to all of your development?"}, {"time": 6940, "text": "A lot of these are, for example, comparisons to human drivers, like manual drivers."}, {"time": 6940, "text": "How do you do relative to a human driver in various dimensions of various circumstances?"}, {"time": 6949, "text": "Can I ask you a tricky question?"}, {"time": 6949, "text": "So if I brought you a truck, how would you test it?"}, {"time": 6955, "text": "Okay, Alan Turing came along and you said, This one can't tell if it's a human driver or autonomous driver."}, {"time": 6961, "text": "But not the human because, you know, humans are flawed."}, {"time": 6966, "text": "How do you actually know you're ready, basically?"}, {"time": 6966, "text": "How do you know it's good enough?"}, {"time": 6971, "text": "And by the way, this is the reason why Waymo released the safety framework for the car side, because one, it sets the bar so nobody cuts below it and does something bad for the field that causes an accident."}, {"time": 6982, "text": "And two, it's to start the conversation on framing what does this need to look like?"}, {"time": 6982, "text": "Same thing we'll end up doing for the trucking side."}, {"time": 6990, "text": "It ends up being different portfolio of approaches."}, {"time": 6990, "text": "There's easy things like, are you compliant with all these fundamental rules of the road?"}, {"time": 6999, "text": "Like you never drive above the speed limit."}, {"time": 6999, "text": "That's actually pretty easy."}, {"time": 7002, "text": "You can fundamentally prove that it's either impossible to violate that rule or that you can itemize the scenarios where that comes up and you can do a test and show that you pass that test and therefore you can handle that scenario."}, {"time": 7017, "text": "And so those are like traditional structure testing kind of system engineering approaches where you can just, like fault rates is another example where when something fails, how do you deal with it?"}, {"time": 7029, "text": "You're not going to drive and randomly wait for it to fail."}, {"time": 7029, "text": "You're going to force a failure and make sure that you can handle it and close courses and simulation or on the road and run through all the permutations of failures, which you can oftentimes for some parts of the system itemize like hardware."}, {"time": 7044, "text": "The hardest part is behavioral where you have just infinite situations that could in theory happen and you want to figure out the combinations of approaches that can work there."}, {"time": 7059, "text": "You can probably pass the Turing test pretty quickly, even if you're not like completely ready for driverless because the events that are really kind of like hard will not happen that often."}, {"time": 7069, "text": "Just to give you a perspective, a human has a serious accident on a freeway, like a truck driver on a freeway."}, {"time": 7069, "text": "There's a serious event happens once every 1.3 million miles and something that actually has like really serious injuries, 28 million miles."}, {"time": 7084, "text": "And so those are really rare."}, {"time": 7084, "text": "And so you could have a driver that looks like it's ready to go, but you have no signal on what happens there."}, {"time": 7091, "text": "And so that's where you start to get creative on combinations of sampling and statistical arguments, focused structured arguments where you can kind of simulate those scenarios and show that you can handle them and metrics that are correlated with what you care about, but you can measure much more quickly and get to a right answer."}, {"time": 7108, "text": "And that's what makes it pretty hard."}, {"time": 7113, "text": "And in the end, you end up borrowing a lot of properties from aerospace and like space shuttles and so forth where you don't get the chance to launch it a million times just to say you're ready because it's too expensive to fail."}, {"time": 7126, "text": "And so you go through a huge amount of kind of structured approaches in order to validate it."}, {"time": 7126, "text": "And then by thoroughness, you can make a strong argument that you're ready to go."}, {"time": 7138, "text": "This is actually a harder problem in a lot of ways, though, because you can think of a space shuttle as getting to a fixed point and then you kind of like or an airplane and you like freeze the software and then you like prove it and you're good to go."}, {"time": 7148, "text": "Here you have to get to a driverless quality bar, but then continue to aggressively change the software even while you're driverless."}, {"time": 7155, "text": "And also the full range of environment that you there's an external environment where the shuttle is you're basically testing the like the systems, the internal stuff."}, {"time": 7155, "text": "And you have a lot of control in the external stuff."}, {"time": 7168, "text": "And the hard part is how do you know you didn't get worse in something that you just changed?"}, {"time": 7172, "text": "And so so in a lot of ways, like the Turing test starts to fail pretty quickly because you start to feel driverless quality pretty early in that curve."}, {"time": 7183, "text": "And if you think about it, right, like in most most kind of, you know, really good A.V."}, {"time": 7183, "text": "demos, maybe you'll sit there for 30 minutes."}, {"time": 7190, "text": "So you've driven, you know, 15 miles or something like that to go driverless."}, {"time": 7197, "text": "Like what's the sort of rate of issues that you need to have?"}, {"time": 7197, "text": "You won't even encounter."}, {"time": 7201, "text": "So let's try something different then."}, {"time": 7201, "text": "Let's try a different version of the Turing test, which is like an IQ test."}, {"time": 7207, "text": "So there's these difficult questions of increasing difficulty."}, {"time": 7207, "text": "They're very they're they're designed."}, {"time": 7214, "text": "You don't know them ahead of time."}, {"time": 7214, "text": "Nobody knows the answer to them."}, {"time": 7218, "text": "And so is it possible to in the future orchestrate basically really difficult course almost of like."}, {"time": 7225, "text": "That maybe change every year."}, {"time": 7225, "text": "And that represent if you can pass these, they don't necessarily represent the full spectrum."}, {"time": 7234, "text": "They won't be conclusive, but you can at least get a really quick read and filter."}, {"time": 7238, "text": "Like you're able to."}, {"time": 7238, "text": "Because you didn't know them ahead of time."}, {"time": 7242, "text": "Probably like construction zones, failures or or driving anywhere in Russia."}, {"time": 7249, "text": "Snow, weather, cut ins, dense traffic, kind of merging, lane closures, animal foreign objects on a road that pop out on short notice, mechanical failures, sensor breaking, tire popped, weird behaviors by other vehicles like a heartbreak, something reckless that they've done, fouling of sensors like bugs or birds, you know, poop or something."}, {"time": 7272, "text": "So but yeah, like you have these like kind of like extreme conditions where like you have a nasty construction zone where everything shuts down and you have to like, you know, get pulled to the other side of the freeway with a temporary lane like that."}, {"time": 7285, "text": "Those are sort of conditions where we do that to ourselves."}, {"time": 7285, "text": "We itemize everything that could possibly happen to give you a starting point to how to think about what you need to develop."}, {"time": 7293, "text": "And at the end of the day, there's no substitute for real miles."}, {"time": 7296, "text": "Like if you think of traditional ML, like, you know how there's like a validation set where you hold out some data and like real world driving is the ultimate validation set."}, {"time": 7304, "text": "That's the in the end, like the cleanest signal."}, {"time": 7304, "text": "But you can do a really good job on creating an obstacle course."}, {"time": 7309, "text": "And you're absolutely right."}, {"time": 7309, "text": "Like at the end, if there was such a thing as automating and kind of a readiness, it would be these extreme conditions like a red light runner."}, {"time": 7320, "text": "A really reckless pedestrian that's jaywalking, a cyclist that, you know, makes like a really awkward maneuver."}, {"time": 7327, "text": "That's actually what keeps you from going driverless."}, {"time": 7327, "text": "Like in the end, that is the long tail."}, {"time": 7331, "text": "And it's interesting to think about that."}, {"time": 7331, "text": "That to me is the Turing test."}, {"time": 7331, "text": "Turing test means a lot of things."}, {"time": 7331, "text": "But to me, in driving, the Turing test is exactly this validation set that is handcrafted."}, {"time": 7343, "text": "There's a guy named Francois Chollet."}, {"time": 7343, "text": "He thinks about like how to design a test for general intelligence."}, {"time": 7353, "text": "He designs these IQ tests for machines."}, {"time": 7353, "text": "And the validation set for him is handcrafted."}, {"time": 7353, "text": "And that it requires like human genius or ingenuity to create a really good test."}, {"time": 7365, "text": "And you hold, you truly hold it out."}, {"time": 7365, "text": "It's an interesting perspective on the validation set, which is like, make that as hard as possible."}, {"time": 7374, "text": "Not a generic representation of the data, but this is the hardest."}, {"time": 7379, "text": "The hardest."}, {"time": 7379, "text": "You know, it's like go."}, {"time": 7379, "text": "Like you'll never fully itemize like all the world states that you'll expand."}, {"time": 7385, "text": "And so you have to come up with different approaches."}, {"time": 7385, "text": "And this is where you start hitting the struggles of ML, where ML is fantastic at optimizing the average case."}, {"time": 7393, "text": "It's a really unique craft to think about how you deal with the worst case, which is what we care about in the AV space when using an ML system on something that occurs like super infrequently."}, {"time": 7404, "text": "So like you don't care about the worst case really on ads because if you miss a few, it's not a big deal."}, {"time": 7409, "text": "But you do care about it on the driving side."}, {"time": 7409, "text": "And so typically like you'll never fully enumerate the world."}, {"time": 7416, "text": "And so you have to take a step back and abstract away what are the signals that you care about and the properties of a driver that correlate to defensive driving and avoiding nasty situations."}, {"time": 7429, "text": "That even though you'll always be surprised by things you'll encounter, you feel good about your ability to generalize from what you've learned."}, {"time": 7438, "text": "Let me ask you a tricky question."}, {"time": 7438, "text": "So to me, the two companies that are building at scale some of the most incredible robots ever built is Waymo and Tesla."}, {"time": 7455, "text": "So there's very distinct approaches technically, philosophically in these two systems."}, {"time": 7463, "text": "Let me ask you to play sort of devil's advocate and then the devil's advocate to the devil's advocate."}, {"time": 7471, "text": "It's a bit of a race."}, {"time": 7471, "text": "Of course, everyone can win."}, {"time": 7471, "text": "But if Waymo wins this race to level four, why would they win?"}, {"time": 7483, "text": "What aspect of the approach do you think would be the winning aspect?"}, {"time": 7483, "text": "And if Tesla wins, why would they win and which aspect of their approach would be the reason?"}, {"time": 7495, "text": "Just building some intuition, almost not from a business perspective, from any of that, just technically."}, {"time": 7501, "text": "And we could summarize, I think maybe you can correct me, one of the more distinct aspects is Waymo has a richer suite of sensors as LIDAR and vision."}, {"time": 7515, "text": "Tesla now removed radar."}, {"time": 7515, "text": "They do vision only."}, {"time": 7515, "text": "Tesla has a larger fleet of vehicles operated by humans."}, {"time": 7524, "text": "So it's already deployed on the field and it's a larger, what do you call it, operational domain."}, {"time": 7532, "text": "And then Waymo is more focused on a specific domain and growing it with fewer vehicles."}, {"time": 7538, "text": "So both are fascinating approaches."}, {"time": 7538, "text": "I think there's a lot of brilliant ideas."}, {"time": 7538, "text": "Nobody knows the answer."}, {"time": 7544, "text": "So I'd love to get your comments on this lay of the land."}, {"time": 7548, "text": "So maybe I'll start with Waymo."}, {"time": 7551, "text": "And you're right, both incredible companies and just a gigantic respect to everything Tesla has accomplished and how they pushed the field forward as well."}, {"time": 7560, "text": "So on the Waymo side, there is a fundamental advantage in the fact that it is focused and geared towards L4 from the very beginning."}, {"time": 7568, "text": "We've customized the sensor suite for it, the hardware, the compute, the infrastructure, the tech stack and all of the investment inside the company."}, {"time": 7577, "text": "That's deceptively important because there's like a giant spectrum of problems you have to solve in order to really do this from infrastructure to hardware to autonomy stack to the safety framework."}, {"time": 7588, "text": "And that's an advantage because there's a reason why it's the fifth generation hardware and why all of those learnings went into the Dimore program."}, {"time": 7596, "text": "It becomes such an advantage because you learn a lot as you drive and you optimize for the best information you have."}, {"time": 7603, "text": "But fundamentally, like there's a big, big jump, like every order of magnitude that you drive in numbers of miles and what you learn and the gap from really kind of like decent progress for L2 and so forth to what it takes to actually go L4."}, {"time": 7618, "text": "And at the end of the day, there's a feeling that Waymo has there's a long way to go."}, {"time": 7624, "text": "Nobody's won, but there's a lot of advantages in all of these buckets where it's the only company that has shipped a fully driverless service where you can go and you can use it and it's at a decently sizable scale."}, {"time": 7639, "text": "And those learnings can feed forward to how to solve the more general problems."}, {"time": 7643, "text": "And you see this process you've deployed in Chandler."}, {"time": 7646, "text": "You don't know the timeline exactly, but you could see the steps."}, {"time": 7650, "text": "They seem almost incremental."}, {"time": 7650, "text": "It's become more engineering than totally blind R&D."}, {"time": 7656, "text": "It works in one place and then you move to another place and you grow it this way."}, {"time": 7688, "text": "And so those learnings you just can't shortcut."}, {"time": 7690, "text": "And so that's an advantage."}, {"time": 7691, "text": "And so there's a lot of open challenges to kind of get through, technical, organizational, like how do you solve problems that are increasingly broad and complex like this, work on multiple products."}, {"time": 7700, "text": "But there's the feeling that, okay, like balls in our court, there's a head start there."}, {"time": 7705, "text": "Now we've got to go and solve it."}, {"time": 7706, "text": "And I think that focus on L4, it's a fundamentally different problem."}, {"time": 7709, "text": "If you think about it, like let's say we were designing an L2 truck that was meant to be safer and help a human."}, {"time": 7715, "text": "You could do that with far less sensors, far less complexity and provide value very quickly, arguably what we already have today just packaged up in a good product."}, {"time": 7725, "text": "But you would take a huge risk in having a gap from even the like compute and sensors, not to mention the software, to then jump from that system to an L4 system."}, {"time": 7735, "text": "So it's a huge risk basically."}, {"time": 7737, "text": "So again, allow me to be the person that plays the devil's advocate and argue for the Tesla approach."}, {"time": 7743, "text": "So what you just laid out makes perfect sense and is exactly right."}, {"time": 7748, "text": "I have some open questions here, which is it's possible that investing more in faster data collection, which is essentially what Tesla is doing, will get us there faster if the sensor suite doesn't matter as much and machine learning can do a lot of the work."}, {"time": 7770, "text": "My question is, how much is the thing you mentioned before, how much of driving can be end to end learned?"}, {"time": 7779, "text": "Obviously, the Waymo and the vision only machine learning approach will solve driving eventually, both."}, {"time": 7788, "text": "The question is of timeline, what's faster?"}, {"time": 7791, "text": "And what you mentioned, like if I were to make the opposite argument, like what puts Tesla in the strongest position, it's data."}, {"time": 7797, "text": "That is their superpower where they have an access to real world data effectively with a safety driver."}, {"time": 7805, "text": "They found a way to get paid by safety drivers versus safer safety drivers."}, {"time": 7814, "text": "But all joking aside, one, it is incredible that they've built a business that's incredibly successful that can now be a foundation and bootstrap really aggressive investment in the autonomy space."}, {"time": 7825, "text": "If you can do it, that's always like an incredible kind of advantage."}, {"time": 7828, "text": "And in the data aspect of it, it is a giant amount of data if you can use it the right way to then solve the problem."}, {"time": 7834, "text": "But the ability to collect and filter through to the things that matter at real world scale, like a large distribution, that is huge."}, {"time": 7843, "text": "Like it's a big advantage."}, {"time": 7845, "text": "And so then the question becomes, can you use it in the right way?"}, {"time": 7848, "text": "And do you have the right software systems and hardware systems in order to solve the problem?"}, {"time": 7853, "text": "And you're right that in the long term, there's no reason to believe that pure camera systems can't solve the problem that humans obviously are solving with vision systems."}, {"time": 7863, "text": "But it's a risk."}, {"time": 7866, "text": "So there's no argument that it's not a risk."}, {"time": 7869, "text": "And it's already such a hard problem."}, {"time": 7872, "text": "And so much of that problem, by the way, is even beyond the perception side, some of the hardest elements of the problem on the behavioral side and decision making and the long tail safety case."}, {"time": 7882, "text": "If you are adding risk and complexity on the input side from perception, you're now making a really, really hard problem, which on its own is still almost insurmountably hard, even harder."}, {"time": 7894, "text": "And so the question is just how much."}, {"time": 7896, "text": "And this is where you can easily get into a little bit of a kind of a trap where similar to how you how do you evaluate how good an AV company's product is."}, {"time": 7906, "text": "Like you go and you do a trial kind of a test run with them, a demo run, which they've kind of optimized like crazy and so forth and like and it feels good."}, {"time": 7913, "text": "Do you do you put any weight in that?"}, {"time": 7915, "text": "You know that that gap is kind of like, you know, pretty large still."}, {"time": 7919, "text": "Same thing on the like perception case, like the long tail of computer vision is really, really hard."}, {"time": 7924, "text": "And there's a lot of ways that that can come up."}, {"time": 7928, "text": "And even if it doesn't happen that often at all, when you think about the safety bar and what it takes to actually go full driverless, not like incredible assistance driverless, but full driverless, that bar gets crazy high."}, {"time": 7940, "text": "And not only do you have to solve it on the behavioral side, but now you have to push computer vision beyond arguably where it's ever been pushed."}, {"time": 7948, "text": "And so, you know, on top of the broader AV challenge, you have a really hard perception challenge as well."}, {"time": 7952, "text": "So there's perception, there's planning, there's human robot interaction."}, {"time": 7952, "text": "To me, what's fascinating about what Tesla is doing is in this march towards level four, because it's in the hands of so many humans, you get to see video, you get to see humans."}, {"time": 7968, "text": "I mean, forget companies, forget businesses."}, {"time": 7968, "text": "It's fascinating for humans to be interacting with robots."}, {"time": 7975, "text": "And they're actually helping kind of push it forward."}, {"time": 7978, "text": "And that is valuable, by the way, where even for us, a decent percentage of our data is human driving."}, {"time": 7984, "text": "We intentionally have humans drive higher percentage than you might expect because that creates some of the best signals to train the autonomy."}, {"time": 7984, "text": "And so that is on its own a value."}, {"time": 7994, "text": "So together, we're kind of learning about this problem in an applied sense, just like you had with Cosmo."}, {"time": 7994, "text": "When you're chasing an actual product that people are going to use, robot based product that people are going to use, you have to contend with the reality of what it takes to build a robot that successfully perceives the world and operates in the world."}, {"time": 8015, "text": "And what it takes to have a robot that interacts with other humans in the world."}, {"time": 8015, "text": "And that's like, to me, one of the most interesting problems humans have ever undertaken because you're in trying to create an intelligent agent that operates in a human world."}, {"time": 8029, "text": "You're also understanding the nature of intelligence itself."}, {"time": 8029, "text": "Like how hard is driving is still not answered to me."}, {"time": 8039, "text": "Yeah, I still don't understand the subtle cues, like even little things like your interaction with a pedestrian where you look at each other and just go, OK, go."}, {"time": 8048, "text": "Like that's hard to do without a human driver."}, {"time": 8048, "text": "And you're missing that dimension."}, {"time": 8048, "text": "How do you communicate that?"}, {"time": 8054, "text": "So there's like really, really interesting kind of like elements here."}, {"time": 8054, "text": "Now, here's what's beautiful."}, {"time": 8058, "text": "Can you imagine that like when autonomous driving is solved, how much of the technology foundation of that space can go and have like tremendous, just transformative impacts on other problem areas and other spaces that have subsets of these same problems?"}, {"time": 8076, "text": "Like, it's just incredible to think about that."}, {"time": 8078, "text": "It's both a pro and a con is with autonomous driving is so safety critical."}, {"time": 8078, "text": "So once you solve it, it's beautiful because there's so many applications that are a lot less safety critical."}, {"time": 8093, "text": "But it's also the con of that is it's so hard to solve."}, {"time": 8093, "text": "And the same journalists that you mentioned to get excited for a demo are the ones who write long articles about the failure of your company."}, {"time": 8107, "text": "If there's one accident that's based on a robot, it's just society is so tense and waiting for failure of robots."}, {"time": 8117, "text": "You're in such a high stake environment."}, {"time": 8117, "text": "Failure has such a high cost."}, {"time": 8117, "text": "And it slows down development."}, {"time": 8117, "text": "It slows down development."}, {"time": 8124, "text": "Yeah, like the team like definitely noticed that like once you go driverless, like we're driverless in Phoenix and you continue to iterate, your iteration pace slows down because your fear of regression forces so much more rigor that obviously you have to find a compromise on like, okay, well, how often do we release driverless builds?"}, {"time": 8145, "text": "Because every time you release a driverless build, you have to go through this like validation process, which is very expensive and so forth."}, {"time": 8150, "text": "So it is interesting."}, {"time": 8150, "text": "It is one of the hardest things."}, {"time": 8150, "text": "There's no other industry where like you wouldn't release products way, way quicker when you start to kind of provide even portions of the value that you provide."}, {"time": 8163, "text": "Healthcare maybe is the other one."}, {"time": 8166, "text": "But at the same time, right, like we've gotten there where you think of like surgery, right?"}, {"time": 8169, "text": "Like you have surgery, there's always a risk, but like it's really, really bounded."}, {"time": 8174, "text": "You know that there's an accident rate when you go out and drive your car today, right?"}, {"time": 8174, "text": "And you know what the fatality rate in the US is per year."}, {"time": 8206, "text": "At the end of the day, we have to be able to explain to society how do we quantify the risk and acknowledge that there is some nonzero risk, but it's far above a human relative safety."}, {"time": 8217, "text": "See, here's the thing, to push back a little bit and bring Cosmo back in the conversation, you said something quite brilliant at the beginning of this conversation that I think probably applies for autonomous driving, which is, you know, there's this desire to make autonomous cars more safer than human driven cars."}, {"time": 8234, "text": "But if you create a product that's really compelling and is able to explain both the leadership and the engineers and the product itself can communicate intent, then I think people may be able to be willing to put up with the thing that might be even riskier than humans because they understand the value of taking risks."}, {"time": 8257, "text": "You mentioned the speed limit."}, {"time": 8258, "text": "Humans understand the value of going over the speed limit."}, {"time": 8261, "text": "Humans understand the value of going fast through a yellow light."}, {"time": 8268, "text": "When you're in Manhattan streets, pushing through crossing pedestrians, they understand that."}, {"time": 8275, "text": "I mean, this is a much more tense topic of discussion, so this is just me talking."}, {"time": 8279, "text": "So with Cosmo's case, there was something about the way this particular robot communicated, the energy it brought, the intent it was able to communicate to the humans that you understood that of course it needs to have a camera."}, {"time": 8293, "text": "Of course it needs to have this information."}, {"time": 8295, "text": "And in that same way, to me, of course a car needs to take risks."}, {"time": 8300, "text": "Of course there's going to be accidents."}, {"time": 8303, "text": "If you want a car that never has an accident, have a car that just doesn't go anywhere."}, {"time": 8311, "text": "But that's tricky because that's not a robotics problem."}, {"time": 8317, "text": "Many accidents are not even due to you, obviously."}, {"time": 8321, "text": "So there's a big difference though."}, {"time": 8323, "text": "That's not a personal decision."}, {"time": 8327, "text": "You're also impacting obviously kind of the rest of the road and we're facilitating it."}, {"time": 8332, "text": "And so there's a higher kind of ethical moral bar, which obviously then translates into as a society and from a regulatory standpoint, kind of like what comes out of it where it's hard for us to ever see this even being a debate in the sense that you have to be beyond reproach from a safety standpoint because if you're wrong about this, you could set the entire field back a decade."}, {"time": 8357, "text": "See, this is me speaking."}, {"time": 8359, "text": "I think if we look into the future, there will be, I personally believe, this is me speaking, that there will be less and less focus on safety."}, {"time": 8370, "text": "It's still very, very high."}, {"time": 8372, "text": "Meaning like after autonomy is very common and accepted."}, {"time": 8376, "text": "Not so common as everywhere."}, {"time": 8378, "text": "But there has to be a transition because I think for innovation, just like you were saying to explore ideas, you have to take risks."}, {"time": 8386, "text": "And I think if autonomy in the near term is to become prevalent in society, I think people need to be more willing to understand the nature of risk, the value of risk."}, {"time": 8400, "text": "It's very difficult, you're right, of course, with driving, but that's the fascinating nature of it."}, {"time": 8406, "text": "It's a life and death situation that brings value to millions of people, so you have to figure out what do we value about this world?"}, {"time": 8416, "text": "How much do we value, how deeply do we want to avoid hurting other humans?"}, {"time": 8464, "text": "But ironically, the logic can actually help with the emotions."}, {"time": 8464, "text": "And just like any technology, there's early adopters and then there's kind of like a curve that happens after it."}, {"time": 8475, "text": "And eventually celebrities, you get the rock in a Waymo vehicle and then everybody just comes along."}, {"time": 8479, "text": "And then everybody calms down because the rock likes it."}, {"time": 8483, "text": "If you post the... And it's an open question on how this plays out."}, {"time": 8485, "text": "Maybe we're pleasantly surprised and people just realize that this is such an enabler of life and efficiency and cost and everything that there's a pull."}, {"time": 8497, "text": "At some point, I should fully believe that this will go from a thoughtful kind of movement and tiptoeing and kind of like a push to society realizes how wonderful of an enabler this could become and it becomes more of a pull."}, {"time": 8511, "text": "And hard to know exactly how that will play out."}, {"time": 8511, "text": "But at the end of the day, like both the goods transportation and the people transportation side of it has that property where it's not easy."}, {"time": 8520, "text": "There's a lot of open questions and challenges to navigate."}, {"time": 8520, "text": "And there's obviously the technical problems to solve as a kind of prerequisite."}, {"time": 8527, "text": "But they have such an opportunity that is on a scale that very few industries in the last 20, 30 years have even had a chance to tackle that I maybe we're pleasantly surprised by how much that tipping point like in a really short amount of time actually turns into a societal pull to kind of embrace the benefits of this."}, {"time": 8548, "text": "Yeah, I hope so."}, {"time": 8549, "text": "It seems like in the recent few decades, there's been tipping points for technologies where like overnight things change."}, {"time": 8549, "text": "It's like from taxis to ride sharing services, all that shift."}, {"time": 8560, "text": "I mean, there's just shift after shift after shift that requires digitization to end technology."}, {"time": 8565, "text": "I hope we're pleasantly surprising this."}, {"time": 8567, "text": "So there's millions of long haul trucks now in the United States."}, {"time": 8571, "text": "Do you see a future where there's millions of Waymo trucks and maybe just broadly speaking Waymo vehicles, just like ants running around the United States, freeways and local roads?"}, {"time": 8587, "text": "Yeah, in other countries too."}, {"time": 8589, "text": "You look back decades from now and it might be one of those things that just feels so natural and then it becomes almost like this kind of interesting kind of oddity that we had none of it like, you know, kind of decades earlier."}, {"time": 8602, "text": "And it'll take a long time to grow and scale."}, {"time": 8605, "text": "Very different challenges appear at every stage."}, {"time": 8608, "text": "But over time, like this is one of the most enabling technologies that we have in the world today."}, {"time": 8615, "text": "It'll feel like, you know, how is the world before the Internet?"}, {"time": 8619, "text": "How is the world before mobile phones?"}, {"time": 8620, "text": "Like it's going to have that sort of a feeling to it on both sides."}, {"time": 8622, "text": "It's hard to predict the future, but do you sometimes think about weird ways it might change the world, like surprising ways?"}, {"time": 8630, "text": "So obviously there's more direct ways where like there's increases efficiency."}, {"time": 8635, "text": "It will enable a lot of kind of logistics, optimizations kind of things."}, {"time": 8640, "text": "It will change probably our roadways and all that kind of stuff."}, {"time": 8647, "text": "But it could also change society in some kind of interesting ways."}, {"time": 8651, "text": "Do you ever think about how might change cities, how might change our lives, all that kind of stuff?"}, {"time": 8656, "text": "You can imagine city where people live versus work becoming more distributed because the pain of commuting becomes different, just easier."}, {"time": 8663, "text": "And there's a lot of options that open up."}, {"time": 8666, "text": "The layout of cities themselves and how you think about car storage and parking obviously just enables a completely different type of experience in urban environments."}, {"time": 8679, "text": "I think there was like a statistic that something like 30 percent of the traffic in cities during rush hour is caused by pursuit of parking or like some really high stats."}, {"time": 8691, "text": "So those obviously kind of open up a lot of options."}, {"time": 8694, "text": "Flexibility on goods will enable new industries and businesses that never existed before because now the efficiency becomes more palatable."}, {"time": 8703, "text": "Good delivery, timing, consistency and flexibility is going to change."}, {"time": 8707, "text": "The way we distribute the logistics network will change."}, {"time": 8710, "text": "The way we then can integrate with warehousing, with shipping ports, you can start to think about greater automation through the whole kind of stack and how that supply chain, the ripples become much more agile versus like very grindy the way they are today where just the adaptation is like very tough and there's a lot of constraints that we have."}, {"time": 8734, "text": "I think it'll be great for the environment."}, {"time": 8736, "text": "It'll be great for safety where like probably about 95 percent of accidents today statistically are due to just attention or things that are preventable with the strengths of automation."}, {"time": 8749, "text": "Yeah, and it'll be one of those things where industries will shift, but the net creation is going to be massively positive."}, {"time": 8756, "text": "And then we just have to be thoughtful about the negative implications that will happen in local places and adjust for those."}, {"time": 8763, "text": "But I'm an optimist in general for the technology where you could argue a negative on any new technology, but you start to kind of see that if there is a big demand for something like this, in almost all cases, that like it's an enabling factor that's going to kind of propagate through society."}, {"time": 8780, "text": "And particularly as life expectancies get longer and so forth, like there's just a lot more need for a greater percentage of the population to kind of just be serviced with a high level of efficiency because otherwise we're going to have a really hard time kind of scaling to what's ahead in the next 50 years."}, {"time": 8797, "text": "Yeah, and you're absolutely right."}, {"time": 8798, "text": "Every technology has negative consequences and positive consequences, and we tend to just focus on the negative a little bit too much."}, {"time": 8806, "text": "In fact, autonomous trucks are often brought up as an example of artificial intelligence and robots in general taking our jobs."}, {"time": 8817, "text": "And as we've talked about briefly here, we talk a lot with Steve."}, {"time": 8821, "text": "It is a concern that automation will take away certain jobs, it will create other jobs."}, {"time": 8829, "text": "There's temporary pain, hopefully temporary, but pain is pain and people suffer and that human suffering is really important to think about."}, {"time": 8838, "text": "But trucking is, I mean, there's a lot written on this is I would say far from the thing that will cause the most pain."}, {"time": 8848, "text": "Yeah, there's even more positive properties about trucking where not only is there just a huge shortage which is going to increase, the average age of truck drivers is getting closer to 50 because the younger people aren't wanting to come into it."}, {"time": 8859, "text": "They're trying to like incentivize, lower the age limit, like all these sort of things."}, {"time": 8864, "text": "And the demand is just going to increase."}, {"time": 8866, "text": "And the least favorable, I mean, it depends on the person, but in most cases, the least favorable types of routes are the massive long haul routes where you're on the road away from your family 300 plus days a year."}, {"time": 8876, "text": "Steve talked about the pain of those kinds of routes from a family perspective."}, {"time": 8880, "text": "You're basically away from family."}, {"time": 8883, "text": "It's not just hours, you work insane hours, but it's also just time away from family."}, {"time": 8889, "text": "Obesity rate is through the roof because you're just sitting all day."}, {"time": 8892, "text": "It's really, really tough."}, {"time": 8894, "text": "And that's also where like the biggest kind of safety risk is because of fatigue."}, {"time": 8898, "text": "And so when you think of the gradual evolution of how trucking comes in, first of all, it's not overnight."}, {"time": 8904, "text": "It's going to take decades to kind of phase in all the like, there's just a long, long, long road ahead."}, {"time": 8909, "text": "But the routes and the portions of trucking that are going to require humans the longest and benefit the most from humans are the short haul and most complicated kind of more urban routes, which are also the more pleasant ones, which are less continual driving time, more flexibility on like geography and location, and you get to kind of sleep at your own home."}, {"time": 8934, "text": "And very importantly, if you optimize the logistics, you're going to use humans much better and thereby pay them much better."}, {"time": 8945, "text": "Because like one of the biggest problems is truck drivers currently are paid by like how much they drive."}, {"time": 8951, "text": "So they really feel the pain of inefficient logistics because like if they're just sitting around for hours, which they often do not driving, waiting, they're not getting paid for that time."}, {"time": 8962, "text": "So like logistics has a significant impact on the quality of life of a truck driver."}, {"time": 8967, "text": "And a high percentage of trucks are like empty because of inefficiencies in the system."}, {"time": 8971, "text": "Yeah, it's one of those things where like, and the other thing is when you increase the efficiency of a system like this, the overall net like volume of the system tends to increase, right?"}, {"time": 8980, "text": "Like the entire market cap of trucking is going to go up when the efficiency improves and facilitates both growth in industries and better utilization of trucking."}, {"time": 9019, "text": "Yeah, so this is true for trucking, but if we zoom out broader, automation and AI does technology broadly, I would say."}, {"time": 9027, "text": "But you know, automation is a thing that has a potential in the next couple of decades to shift the kind of jobs available to humans."}, {"time": 9036, "text": "And so that results in, like I said, human suffering because people lose their jobs, there's economic pain there, and there's also a pain of meaning."}, {"time": 9046, "text": "So for a lot of people, work is a source of meaning, it's a source of identity, of pride, of pride in getting good at the job, pride in craftsmanship and excellence, which is what truck drivers talk about."}, {"time": 9065, "text": "But this is true for a lot of jobs."}, {"time": 9068, "text": "And is that something you think about as a sort of a roboticist zooming out from the trucking thing?"}, {"time": 9073, "text": "Like where do you think it would be harder to find activity and work that's a source of identity, a source of meaning in the future?"}, {"time": 9084, "text": "I do think about it because you want to make sure that you worry about the entire system, like not just like the part of the economy plays in it, but what are the ripple effects of it down the road."}, {"time": 9095, "text": "And on enough of a time window, there's a lot of opportunity to put in the right policies, the right opportunities to kind of reshape and retrain and find those openings."}, {"time": 9104, "text": "And so just to give you a few examples, both trucking and cars, we have remote assistance facilities that are there to interface with customers and monitor vehicles and provide like very focused kind of assistance on kind of areas where the vehicle may want to request help in understanding an environment."}, {"time": 9124, "text": "So those are jobs that kind of get created and supported."}, {"time": 9127, "text": "I remember like taking a tour of one of the Amazon facilities where you've probably seen the Kiva systems robots where you have these orange robots that have automated the warehouse, like kind of picking and collecting of items."}, {"time": 9139, "text": "And it's like really elegant and beautiful way."}, {"time": 9142, "text": "It's actually one of my favorite applications of robotics of all time."}, {"time": 9146, "text": "You know, like I think it kind of came across a company like 2006 was just amazing."}, {"time": 9150, "text": "And what was the warehouse robots that transport little things?"}, {"time": 9153, "text": "So basically, instead of a person going and walking around and picking the seven items in your order, these robots go and pick up a shelf and move it over in a row where like the seven shelves that contain the seven items are lined up in a laser or whatever points to what you need to get."}, {"time": 9168, "text": "And you go and pick it and you place it to fill the order."}, {"time": 9170, "text": "And so the people are fulfilling the final orders."}, {"time": 9173, "text": "What was interesting about that is that when I was asking them about like kind of the impact on labor when they transitioned that warehouse, the throughput increased so much that the jobs shifted towards the final fulfillment, even though the robots took over entirely the search of the items themselves."}, {"time": 9189, "text": "And the labor, the job stayed like nobody like that was actually the same amount of jobs, roughly they were necessary."}, {"time": 9196, "text": "But the throughput increased by I think over 2x or some amount."}, {"time": 9199, "text": "So you have these situations that are not zero sum games in this really interesting way."}, {"time": 9204, "text": "And the optimist in me thinks that there's these types of solutions in almost any industry where the growth that's enabled creates opportunities that you can then leverage."}, {"time": 9212, "text": "But you got to be intentional about finding those and really helping make those links because even if you make the argument that like there's a net positive, locally there's always tough hits that you got to be very careful about."}, {"time": 9224, "text": "You have to have an understanding of that link because there's a short period of time whether training is acquired or just mental transition or physical or whatever is acquired, that's still going to be short term pain."}, {"time": 9235, "text": "The uncertainty of it, there's families involved."}, {"time": 9240, "text": "It's exceptionally is difficult on a human level and you have to really think about that."}, {"time": 9249, "text": "You can't just look at economic metrics always, it's human beings."}, {"time": 9253, "text": "And you can't even just take it as like, okay, well, we need to like subsidize or whatever because like there is an element of just personal pride where majority of people, like people don't want to just be okay, but like they want to actually like have a craft like you said and have a mission and feel like they're having a really positive impact."}, {"time": 9271, "text": "And so my personal belief is that there's a lot of transferability and skill set that is possible, especially if you create a bridge and an investment to enable it."}, {"time": 9283, "text": "And to some degree, that's our responsibility as well in this process."}, {"time": 9288, "text": "You mentioned Kiva robots, Amazon."}, {"time": 9288, "text": "Let me ask you about the Astro robot, which is, I don't know if you've seen it, it's Amazon has announced that it's a home robot that they have a screen looks awfully a lot like Cosmo has I think different vision probably."}, {"time": 9306, "text": "What are your thoughts about like home robotics in this kind of space?"}, {"time": 9313, "text": "There's been quite a bunch of home robots, social robots that very unfortunately have closed their doors that for various reasons, perhaps it were too expensive, there's manufacturing challenges, all that kind of stuff."}, {"time": 9327, "text": "What are your thoughts about Amazon getting into this space?"}, {"time": 9330, "text": "Yeah, we had some signs that they're getting into it like long, long, long ago."}, {"time": 9334, "text": "Maybe they were a little bit too interested in Cosmo during our conversations, but they're also very good partners actually for us as we kind of just integrated a lot of shared technology."}, {"time": 9344, "text": "If I could also get your thoughts on, you could think of Alexa as a robot as well, Echo."}, {"time": 9353, "text": "Do you see those as fundamentally different just because you can move and look around?"}, {"time": 9358, "text": "Is that fundamentally different than the thing that just sits in place?"}, {"time": 9361, "text": "It opens up options, but my first reaction is I have my doubts that this one's going to hit the mark because I think for the price point that it's at and the kind of functionality and value propositions that they're trying to put out, it's still searching for the killer application that justifies I think it was like a $1,500 price point or kind of somewhere on there."}, {"time": 9430, "text": "I think that's in the end one of the biggest challenges for robotics, especially consumer robotics where you have to kind of meet that bar."}, {"time": 9437, "text": "It becomes very, very hard."}, {"time": 9440, "text": "And there's also the higher bar, just like you were saying with Cosmo, of a thing that can look one way and then turn around and look at you."}, {"time": 9450, "text": "That's either a super desirable quality or a super undesirable quality depending on how much you trust the thing."}, {"time": 9458, "text": "And so there's a problem of trust to solve there."}, {"time": 9461, "text": "There's a problem of personality."}, {"time": 9463, "text": "It's the quote unquote problem that Cosmo solved so well is that you trust the thing, and that has to do with the company, with the leadership, with the intent that's communicated by the device and the company and everything together."}, {"time": 9476, "text": "Yeah, exactly right."}, {"time": 9477, "text": "And I think they also have to retrace some of the learnings on the character side where, as usual, I think that's the place where a lot of companies are great at the hardware side of it and think about those elements."}, {"time": 9490, "text": "Thinking about the AI challenges, particularly with the advantage of Alexa, is a pretty huge boost for them."}, {"time": 9496, "text": "The character side of it for technology companies is pretty novel territory, and so that will take some iterations."}, {"time": 9503, "text": "But yeah, I mean, I hope this continued progress in the space and that thread doesn't kind of go dormant for too long, and it's going to take a while to kind of evolve into the ideal applications."}, {"time": 9530, "text": "And take risks."}, {"time": 9550, "text": "Is one way to put it."}, {"time": 9552, "text": "Yeah, so why is it so hard at a high level to build a robotics company?"}, {"time": 9560, "text": "A robotics company that lives for a long time."}, {"time": 9569, "text": "That to me was exceptionally successful vision and idea and implementation."}, {"time": 9593, "text": "And of course there's like Amazon, what they're doing is they're almost like taking risks so they can afford it because they have other sources of revenue."}, {"time": 9602, "text": "But outside of those examples, most robotics companies fail."}, {"time": 9610, "text": "Why is it so hard to run a robotics company?"}, {"time": 9612, "text": "iRobot's impressive because they found a really, really great fit of where the technology could satisfy a really clear use case and need, and they did it well, and they didn't try to overshoot from a cost to benefit standpoint."}, {"time": 9628, "text": "Robotics is hard because it like tends to be more expensive."}, {"time": 9632, "text": "It combines way more technologies than a lot of other types of companies do."}, {"time": 9636, "text": "If I were to like say one thing that is maybe the biggest risk in like a robotics company failing is that it can be either a technology in search of an application or they try to fight off a kind of an offering that has a mismatch in kind of price to function."}, {"time": 9656, "text": "And just the mass market appeal isn't there."}, {"time": 9659, "text": "And consumer products are just hard."}, {"time": 9662, "text": "It's just, I mean, after all the years and I'd like definitely kind of feel a lot of the battle scars because you have, not only do you have to like hit the function, but you have to educate and explain, get awareness up, deal with different types of consumers."}, {"time": 9675, "text": "There's a reason why a lot of technologies sometimes start in the enterprise space and then kind of continue forward in the consumer space, even like you see AR like starting to kind of make that shift with HoloLens and so forth in some ways."}, {"time": 9689, "text": "Consumers and price points that they're willing to kind of be attracted in a mass market way."}, {"time": 9694, "text": "And I don't mean like 10,000 enthusiasts bought it, but I mean like 2 million, 10 million, 50 million like mass market kind of interest have bought it."}, {"time": 9706, "text": "That bar is very, very high and typically robotics is novel enough and nonstandardized enough to where it pushes on price points so much that you can easily get out of range where the capabilities and today's technology or just the function that was picked just doesn't line up."}, {"time": 9720, "text": "And so that product market fit is very important."}, {"time": 9723, "text": "So the space of killer apps or rather super compelling apps is much smaller because it's easy to get outside of the price range for most consumers."}, {"time": 9733, "text": "And it's not constant, right?"}, {"time": 9733, "text": "And that's why we picked off entertainment because the quality was just so low in physical entertainment that we felt we could leapfrog that and still create a really compelling offering at a price point that was defensible and that proved out to be true."}, {"time": 9750, "text": "And over time, that same opportunity opens up in healthcare, in home applications and commercial applications and kind of broader, more generalized interface, but there's missing pieces in order for that to happen."}, {"time": 9764, "text": "And all of those have to be present for it to line up."}, {"time": 9767, "text": "And we see these sort of trends in technology where kind of technologies that start in one place evolve and kind of grow to another."}, {"time": 9775, "text": "Some things start in gaming."}, {"time": 9776, "text": "Some things start in space or aerospace and then kind of move into the consumer market."}, {"time": 9783, "text": "And sometimes it's just a timing thing, right, where how many stabs at what became the iPhone were there over the 20 years before that just weren't quite ready in the function relative to the kind of price point complexity."}, {"time": 9796, "text": "And sometimes it's a small detail of the implementation that makes all the difference, which is design is so important."}, {"time": 9803, "text": "Something, yeah, like the new generation UX, right?"}, {"time": 9807, "text": "And it's tough and oftentimes all of them have to be there and it has to be like a perfect storm."}, {"time": 9814, "text": "But yeah, history repeats itself in a lot of ways in a lot of these trends, which is pretty fascinating."}, {"time": 9820, "text": "Well, let me ask you about the humanoid form."}, {"time": 9822, "text": "What do you think about the Tesla bot and humanoid robotics in general?"}, {"time": 9825, "text": "So obviously, to me, autonomous driving Waymo and the other companies working in the space, that seems to be a great place to invest in potential revolutionary application robotics application folks application."}, {"time": 9840, "text": "What's the role of humanoid robotics?"}, {"time": 9842, "text": "Do you think Tesla bot is ridiculous?"}, {"time": 9845, "text": "Do you think it's super promising?"}, {"time": 9847, "text": "Do you think it's interesting, full of mystery, nobody knows?"}, {"time": 9850, "text": "What do you think about this thing?"}, {"time": 9852, "text": "Yeah, I think today humanoid form robotics is research."}, {"time": 9856, "text": "There's very few situations where you actually need a humanoid form to solve a problem."}, {"time": 9860, "text": "If you think about it, right, like wheels are more efficient than legs."}, {"time": 9863, "text": "There's joints and degrees of freedom beyond a certain point, just add a lot of complexity and cost."}, {"time": 9869, "text": "So if you're doing a humanoid robot, oftentimes it's in the pursuit of a humanoid robot, not in the pursuit of an application for the time being."}, {"time": 9876, "text": "Especially when you have like kind of the gaps in interface and, you know, kind of AI that we kind of talk about today."}, {"time": 9882, "text": "So anything you want does I'm interested in following."}, {"time": 9885, "text": "So there's there's an element of that world, no matter how crazy, how crazy it is."}, {"time": 9888, "text": "I just like, you know, I'll pay attention."}, {"time": 9888, "text": "I'm curious to see what comes out of it."}, {"time": 9891, "text": "So it's like you can't you can't ever, you know, ignore it."}, {"time": 9894, "text": "But, you know, it's definitely far afield from their kind of core business, obviously."}, {"time": 9899, "text": "What was interesting to me is I've disagreed with Elon a lot about this is to me, the compelling aspect of the humanoid form and a lot of kind of robots, Cosmo, for example, is a human robot interaction part."}, {"time": 9920, "text": "From Elon Musk's perspective, Tesla bot has nothing to do with the human."}, {"time": 9925, "text": "It's a form that's effective for the factory because the factory is designed for humans."}, {"time": 9931, "text": "But to me, the reason you might want to argue for the humanoid form is because, you know, at a party, it's a nice way to fit into the party."}, {"time": 9941, "text": "The humanoid form has a compelling notion to it in the same way that Cosmo is compelling."}, {"time": 9946, "text": "I would argue, if we were arguing about this, that it's cheaper to build a Cosmo like that form."}, {"time": 9955, "text": "But if you wanted to make an argument, which I have with Jim Keller about, you know, you could actually make a human robot for pretty cheap."}, {"time": 9963, "text": "And then the question is, all right, if you're using an application where it can be flawed, it can have a personality and be flawed in the same way that Cosmo is, then maybe it's interesting for integration to human society."}, {"time": 9978, "text": "That, to me, is an interesting application of a humanoid form because humans are drawn, like I mentioned to you, like robots, we're drawn to legs and limbs and body language and all that kind of stuff."}, {"time": 9987, "text": "And even a face, even if you don't have the facial features, which you might not want to have to reduce the creepiness factor, all that kind of stuff."}, {"time": 9998, "text": "But yeah, that, to me, the humanoid form is compelling."}, {"time": 10000, "text": "But in terms of that being the right form for the factory environment, I'm not so sure."}, {"time": 10006, "text": "Yeah, for the factory environment, like right off the bat, what are you optimizing for?"}, {"time": 10011, "text": "Is it strength?"}, {"time": 10011, "text": "Is it mobility?"}, {"time": 10011, "text": "Is it versatility, right?"}, {"time": 10013, "text": "Like that changes completely the look and feel of the robot that you create, you know, and almost certainly the human form is over designed for some dimensions and constrained for some dimensions."}, {"time": 10023, "text": "And so, like, what are you grasping?"}, {"time": 10023, "text": "Is it big?"}, {"time": 10023, "text": "Is it little, right?"}, {"time": 10027, "text": "So you would customize it and make it customizable for the different needs if that was the optimization, right?"}, {"time": 10034, "text": "And then, you know, for the other one, I could totally be wrong."}, {"time": 10038, "text": "You know, I still feel that the closer you try to get to a human, the more you're subject to the biases of what a human should be and you lose flexibility to shift away from your weaknesses and towards your strengths."}, {"time": 10052, "text": "And that changes over time, but there's ways to make really approachable and natural interfaces for robotic kind of characters and, you know, kind of deployments in these applications that do not at all look like a human directly, but that actually creates way more flexibility and capability and role and forgiveness and interface and everything else."}, {"time": 10083, "text": "Yeah, it's interesting, but I'm still confused by the magic I see in legged robots."}, {"time": 10089, "text": "Yeah, so there is a magic."}, {"time": 10089, "text": "So I'm absolutely amazed at it from a technical curiosity standpoint and like the magic that like the Boston Dynamics team can do from, you know, like from walking and jumping and so forth."}, {"time": 10104, "text": "Now, like there's been a long journey to try to find an application for that sort of technology."}, {"time": 10109, "text": "But wow, that's incredible technology, right?"}, {"time": 10112, "text": "So then you kind of go towards, OK, are you working back from a goal of what you're trying to solve?"}, {"time": 10117, "text": "Are you working forward from a technology and I'm looking for a solution?"}, {"time": 10119, "text": "And I think that's where it's a kind of a bi directional search oftentimes, but you got the two have to meet."}, {"time": 10125, "text": "And that's where humanoid robots is kind of close to that."}, {"time": 10129, "text": "And that like it is a decision about a form factor and a technology that it forces that doesn't have a clear justification on why that's the killer app for, you know, from the other end."}, {"time": 10140, "text": "But I think the core fascinating idea with the Tesla bot is the one that's carried by Waymo as well, is when you're solving the general robotics problem of perception control where there's the very clear applications of driving."}, {"time": 10154, "text": "It's as you get better and better at it when you have like Waymo driver."}, {"time": 10159, "text": "Yeah, the whole world starts to kind of start to look like a robotics problem."}, {"time": 10164, "text": "So it's very interesting for now."}, {"time": 10166, "text": "Detection, classification, segmentation, tracking, planning, like it's."}, {"time": 10171, "text": "So there's no reason."}, {"time": 10171, "text": "I mean, I'm not I'm not speaking for Waymo here, but, you know, moving goods."}, {"time": 10180, "text": "There's no reason transformer like this thing couldn't, you know, take the goods up an elevator, you know, like that, like slowly expand what it means to move goods and expand more and more of the world into a robotics problem."}, {"time": 10199, "text": "And you start to like think of it as an end end robotics problem from like loading from, you know, from everything else."}, {"time": 10205, "text": "And even like the truck itself, you know, today's generation is integrating into today's understanding of what a vehicle is, right?"}, {"time": 10213, "text": "The Pacifica Jaguar, the Freightliners from Daimler."}, {"time": 10217, "text": "There's nothing that stops these us from like down the road after like starting to get to scale to like expand these partnerships to really rethink what would the next generation of a truck look like that is actually optimized for autonomy, not for today's world."}, {"time": 10234, "text": "And maybe that means a very different type of trailer."}, {"time": 10237, "text": "Maybe that like there's a lot of things you could rethink on that front, which is on its own very, very exciting."}, {"time": 10242, "text": "Let me ask you, like I said, you went to the Mecca of robotics, which is CMU, Carnegie Mellon University."}, {"time": 10248, "text": "You got a PhD there."}, {"time": 10248, "text": "So maybe by way of advice and maybe by way of story and memories, what does it take to get a PhD in robotics at CMU?"}, {"time": 10263, "text": "And maybe you can throw in there some advice for people who are thinking about doing work in artificial intelligence and robotics and are thinking about whether to get a PhD."}, {"time": 10275, "text": "I actually went, I was at CMU for undergrad as well and didn't know anything about robotics coming in and was doing electrical computer engineering, computer science, and really got more and more into kind of AI and then fell in love with autonomous driving."}, {"time": 10288, "text": "And at that point, that was just by a big margin, such an incredible central spot of investment in that area."}, {"time": 10296, "text": "And so what I would say is that robotics, for all the progress that's happened, is still a really young field."}, {"time": 10301, "text": "There's a huge amount of opportunity."}, {"time": 10301, "text": "Now that opportunity shifted where something like autonomous driving has moved from being very research and academics driven to being commercial driven where you see the investments happening in commercial."}, {"time": 10313, "text": "Now there's other areas that are much younger and you see like kind of grasping and manipulation, making kind of the same sort of journey that like autonomy made and there's other areas as well."}, {"time": 10323, "text": "What I would say is the space moves very quickly."}, {"time": 10323, "text": "Anything you do a PhD in, like it is in most areas, will evolve and change as technology changes and constraints change and hardware changes and the world changes."}, {"time": 10335, "text": "And so the beautiful thing about robotics is it's super broad."}, {"time": 10335, "text": "It's not a narrow space at all and it could be a million different things in a million different industries."}, {"time": 10344, "text": "And so it's a great opportunity to come in and get a broad foundation on AI, machine learning, computer vision, systems, hardware, sensors, all these separate things."}, {"time": 10354, "text": "You do need to go deep and find something that you're really, really passionate about."}, {"time": 10354, "text": "Obviously, just like any PhD, this is like a five, six year kind of endeavor."}, {"time": 10366, "text": "And you have to love it enough to go super deep to learn all the things necessary to be super deeply functioning in that area and then contribute to it in a way that hasn't been done before."}, {"time": 10377, "text": "And in robotics, that probably means more breadth because robotics is rarely kind of like one particular kind of narrow technology."}, {"time": 10385, "text": "And it means being able to collaborate with teams where like one of the coolest aspects of like the experience that I kind of cherish in our PhD is that we actually had a pretty large AV project that for that time was like a pretty serious initiative where you got to like partner with a larger team."}, {"time": 10403, "text": "And you had the experts in perception and the experts in planning and the staff and the mechanical engineers."}, {"time": 10408, "text": "So I was working on a project called UPI back then, which was basically the off road version of the DARPA challenge."}, {"time": 10415, "text": "It was a DARPA funded project for basically like a large off road vehicle that you would like drop and then give it a waypoint 10 kilometers away and it would have to navigate a completely unstructured environment."}, {"time": 10424, "text": "In an off road environment."}, {"time": 10425, "text": "So like forests, ditches, rocks, vegetation, and so it was like a really, really interesting kind of a hard problem where like wheels would be off to my shoulders."}, {"time": 10425, "text": "It's like gigantic, right?"}, {"time": 10434, "text": "By the way, AV for people stands for autonomous vehicles."}, {"time": 10436, "text": "Autonomous vehicles."}, {"time": 10439, "text": "And so what I think is like the beauty of robotics, but also kind of like the expectation is that there's spaces in computer science where you can be very, very narrow and deep."}, {"time": 10449, "text": "Robotics, the necessity, but also the beauty of it is that it forces you to be excited about that breadth and that partnership across different disciplines that enable it."}, {"time": 10458, "text": "But that also opens up so many more doors where you can go and you can do robotics and almost any category where robotics isn't really an industry."}, {"time": 10467, "text": "It's like AI, right?"}, {"time": 10469, "text": "It's like the application of physical automation to all these other worlds."}, {"time": 10469, "text": "And so you can do robotic surgery, you can do vehicles, you can do factory automation, you can do health care, you can do like leverage the AI around the sensing to think about static sensors and scene understanding."}, {"time": 10487, "text": "So I think that's got to be the expectation and the excitement and it breeds people that are probably a little bit more collaborative and more excited about working in teams."}, {"time": 10498, "text": "If I could briefly comment on the fact that the robotics people I've met in my life from CMU and MIT, they're really happy people."}, {"time": 10510, "text": "Because I think it's the collaborative thing."}, {"time": 10513, "text": "I think I think you don't."}, {"time": 10516, "text": "You're not like sitting in like the fourth basement."}, {"time": 10519, "text": "Which when you're doing machine learning purely software, it's very tempting to just disappear into your own hole and never collaborate."}, {"time": 10529, "text": "And that breeds a little bit more of the silo mentality of like, I have a problem."}, {"time": 10536, "text": "It's almost like negative to talk to somebody else or something like that."}, {"time": 10539, "text": "But robotics folks are just very collaborative, very friendly."}, {"time": 10539, "text": "And there's also an energy of like you get to confront the physics of reality often, which is humbling and also exciting."}, {"time": 10553, "text": "So it's humbling when it fails and exciting when it finally works."}, {"time": 10557, "text": "It's like a purity of the passion."}, {"time": 10558, "text": "And you've got to remember that like right now, like robotics and AI is like just all the rage and autonomous vehicles and all this, like 15 years ago and 20 years ago, like it wasn't that deeply lucrative."}, {"time": 10571, "text": "People that went into robotics, they did it because they were like thought it was just the coolest thing in the world to like make physical things intelligent in the real world."}, {"time": 10578, "text": "And so there's like a raw passion where they went into it for the right reasons and so forth."}, {"time": 10582, "text": "And so it's really great space."}, {"time": 10582, "text": "And that organizational challenge, by the way, like when you think about the challenges in AV, we talk a lot about the technical challenges."}, {"time": 10590, "text": "The organizational challenges through the roof where you think about what it takes to build an AV system and you have companies that are now thousands of people."}, {"time": 10602, "text": "And you look at other really hard technical problems like an operating system."}, {"time": 10607, "text": "It's pretty well established."}, {"time": 10608, "text": "Like you kind of know that there's a file system, there's virtual memory, there's this, there's that, there's like caching and like and there's like a really reasonably well established modularity and APIs and so forth."}, {"time": 10620, "text": "And so you can kind of like scale it in an efficient fashion."}, {"time": 10623, "text": "That doesn't exist anywhere near to that level of maturity in autonomous driving right now."}, {"time": 10628, "text": "And tech stacks are being reinvented, organizational structures are being reinvented."}, {"time": 10632, "text": "You have problems like pedestrians that are not isolated problems."}, {"time": 10632, "text": "They're part sensing, part behavior prediction, part planning, part evaluation."}, {"time": 10640, "text": "And like one of the biggest challenges is actually how do you solve these problems where the mental capacity of a human is starting to get strained on how do you organize it and think about it where you have this like multidimensional matrix that needs to all work together."}, {"time": 10656, "text": "And so that makes it kind of cool as well because it's not like solved at all from like what does it take to actually scale this, right?"}, {"time": 10665, "text": "And then you look at like other gigantic challenges that have been successful and are way more mature, there's a stability to it."}, {"time": 10673, "text": "And like maybe the autonomous vehicle space will get there."}, {"time": 10676, "text": "But right now, just as many technical challenges as they are, they're like organizational challenges and how do you like solve these problems that touch on so many different areas and efficiently tackle them while like maintaining progress among all these constraints while scaling."}, {"time": 10693, "text": "By way of advice, what advice would you give to somebody thinking about doing a robotics startup?"}, {"time": 10693, "text": "You mentioned Cosmo."}, {"time": 10693, "text": "Somebody that wanted to carry the Cosmo flag forward, the Anki flag forward."}, {"time": 10708, "text": "Looking back at your experience, looking forward to the future that will obviously have such robots."}, {"time": 10708, "text": "What advice would you give to that person?"}, {"time": 10717, "text": "Yeah, it was the greatest experience ever."}, {"time": 10717, "text": "And it's like there's something you there are things you learn navigating a startup that you'll never like."}, {"time": 10725, "text": "It was very hard to encounter that in like a typical kind of work environment."}, {"time": 10725, "text": "And it's just it's wonderful."}, {"time": 10725, "text": "You got to be ready for it."}, {"time": 10731, "text": "It's not like, you know, the glamour of a startup."}, {"time": 10731, "text": "There's just like just brutal emotional swings up and down."}, {"time": 10737, "text": "And so having cofounders actually helps a ton."}, {"time": 10737, "text": "Like, I would not cannot imagine doing it solo, but having at least somebody where on your darkest days, you can kind of like really openly just like have that conversation and, you know, lean on to somebody that's that's in the thick of it with you helps a lot."}, {"time": 10754, "text": "What I would say, what was the nature of darkest days and the emotional swings?"}, {"time": 10754, "text": "Is it worried about the funding?"}, {"time": 10754, "text": "Is it worried about whether any of your ideas are any good or ever were good?"}, {"time": 10754, "text": "Is it like the self doubt?"}, {"time": 10768, "text": "Is it like facing new challenges that have nothing to do with the technology, like organizational, human resources, that kind of stuff?"}, {"time": 10776, "text": "Yeah, you come from a world in school where you feel that you put in a lot of effort and you'll get the right result."}, {"time": 10776, "text": "And input translates proportional to output."}, {"time": 10786, "text": "And, you know, you need to solve the set or do whatever and just kind of get it done."}, {"time": 10786, "text": "Now, PhD tests out a little bit."}, {"time": 10792, "text": "But at the end of the day, you put in the effort, you tend to like kind of come out with your enough results that you kind of get a PhD in the startup space."}, {"time": 10800, "text": "Like, you know, like you could talk to 50 investors and they just don't see your vision."}, {"time": 10800, "text": "And it doesn't matter how hard you kind of tried and pitched, you could work incredibly hard and you have a manufacturing defect."}, {"time": 10810, "text": "And if you don't fix it, you're going to you're out of business."}, {"time": 10810, "text": "You need to raise money by a certain date."}, {"time": 10816, "text": "And there's a you got to have this milestone in order to like have a good pitch and you do it."}, {"time": 10820, "text": "You have to have this talent and you just don't have it inside the company or, you know, you have to get 200 people or however many people kind of like along with you and kind of buy in the journey."}, {"time": 10832, "text": "You're like disagreeing with an investor and they're your investors."}, {"time": 10832, "text": "So it's just like, you know, it's like there's no walking away from it."}, {"time": 10838, "text": "So and it tends to be like those things where you just kind of get clobbered in so many different ways that like things end up being harder than you expect."}, {"time": 10847, "text": "And it's like such a gauntlet, but you learn so much in the process."}, {"time": 10851, "text": "And there's a lot of people that actually end up rooting for you and helping you like from the outside."}, {"time": 10855, "text": "And you get good, great mentors and you like get find fantastic people that step up in the company."}, {"time": 10860, "text": "And you have this like magical period where everybody's like it's life or death for the company."}, {"time": 10866, "text": "But like you're all fighting for the same thing."}, {"time": 10866, "text": "And it's the most satisfying kind of journey ever."}, {"time": 10870, "text": "The things that make it easier and that I would recommend is like be really, really thoughtful about the the application."}, {"time": 10877, "text": "Like there's a there's a saying of like kind of, you know, team and execution and market and like kind of how important are each of those."}, {"time": 10884, "text": "And oftentimes the market wins and you come out of thinking that if you're smart enough and you work hard enough and you're like have the right talented team and so forth, like you'll always kind of find a way through."}, {"time": 10894, "text": "And it's surprising how much dynamics are driven by the industry you're in and the timing of you entering that industry."}, {"time": 10901, "text": "And so just Waymo is a great example of it."}, {"time": 10901, "text": "There is I don't know if there'll ever be another company or suite of companies that has raised and continues to spend so much money at such an early phase of revenue generation and productization."}, {"time": 10920, "text": "You know, from a PNL standpoint, like it's it's an anomaly, like by any measure of any industry that's ever existed, except for maybe the US space program."}, {"time": 10933, "text": "But it's like multiple trillion dollar opportunities, which is so unusual to find that size of a market that just the progress that shows the de risking of it."}, {"time": 10944, "text": "You could apply whatever discounts you want off that trillion dollar market and it still justifies the investment that is happening because like being successful in that space makes all the investment feel trivial."}, {"time": 10953, "text": "Now, by the same consequence, like the size of the market, the size of the target audience, the ability to capture that market share, how hard that's going to be, who the incumbents like."}, {"time": 10963, "text": "That's probably one of the lessons I appreciate like more than anything else, where like those things really, really do matter."}, {"time": 10968, "text": "And oftentimes can dominate the quality of the team or execution, because if you miss the timing or you do it in the wrong space, you run into like the institutional kind of headwinds of a particular environment."}, {"time": 10981, "text": "Like let's say you have the greatest idea in the world, but you burrow into health care, but it takes 10 years to innovate in health care because of a lot of challenges."}, {"time": 10987, "text": "Like there's fundamental laws of physics that you have to think about."}, {"time": 10992, "text": "And so the combination of like Anki and Waymo kind of drives that point home for me where you can do a ton if you have the right market, the right opportunity, the right way to explain it and you show the progress in the right sequence."}, {"time": 11005, "text": "It actually can really significantly change the course of your journey and startup."}, {"time": 11010, "text": "How much of is understanding the market and how much of is creating a new market?"}, {"time": 11014, "text": "So how do you think about like the space robotics is really interesting."}, {"time": 11014, "text": "You said exactly right."}, {"time": 11014, "text": "The space of applications is small."}, {"time": 11024, "text": "You know, relative to the cost involved."}, {"time": 11024, "text": "So how much is like truly revolutionary thinking about like what is the application?"}, {"time": 11034, "text": "And then, yeah, so creating something that didn't exist, didn't really exist."}, {"time": 11041, "text": "Like this is pretty obvious to me, the whole space of home robotics, just everything that Cosmo did."}, {"time": 11047, "text": "I guess you could talk to it as a toy and people will understand it because it was much more than a toy."}, {"time": 11053, "text": "And I don't think people fully understand the value of that."}, {"time": 11053, "text": "You have to create it and the product will communicate it."}, {"time": 11061, "text": "Just like the iPhone, nobody understood the value of no keyboard and a thing that can do web browsing."}, {"time": 11071, "text": "I don't think they understood the value of that until you create it."}, {"time": 11074, "text": "Having a foot in the door and an entry point still helps because at the end of the day, like an iPhone replaced your phone."}, {"time": 11080, "text": "And so it had a fundamental purpose and all these things that it did better."}, {"time": 11084, "text": "And so then you could do ABC on top of it."}, {"time": 11086, "text": "And then you even remember the early commercials where it's always like one application of what it could do and then you get a phone call."}, {"time": 11093, "text": "And so that was intentionally sending a message, something familiar."}, {"time": 11096, "text": "But then you can send a text message, you can listen to music, you can surf the web."}, {"time": 11100, "text": "And so autonomous driving obviously anchors on that as well."}, {"time": 11104, "text": "You don't have to explain to somebody the functionality of an autonomous truck."}, {"time": 11107, "text": "Like there's nuances around it, but the functionality makes sense."}, {"time": 11111, "text": "In the home, you have a fundamental advantage."}, {"time": 11111, "text": "We always thought about this because it was so painful to explain to people what our products did and how to communicate that super cleanly, especially when something was so experiential."}, {"time": 11122, "text": "And so you compare Anki to Nest."}, {"time": 11127, "text": "Nest had some beautiful products where they started scaling and actually found really great success and they had really clean and beautiful marketing messaging because they anchored on reinventing existing categories where it was a smart thermostat."}, {"time": 11144, "text": "And so you kind of are able to take what's familiar, anchor that understanding and then explain what's better about it."}, {"time": 11153, "text": "Cosmos is a totally new thing."}, {"time": 11158, "text": "We struggled."}, {"time": 11158, "text": "We spent a lot of money on marketing."}, {"time": 11161, "text": "We actually had far greater efficiency on Cosmo than anything else because we found a way to capture the emotion in some little shorts to kind of lean into the personality in our marketing."}, {"time": 11172, "text": "And it became viral where we had these kind of videos that would go and get hundreds of thousands of views and get spread and sometimes millions of views."}, {"time": 11181, "text": "But it was really, really hard."}, {"time": 11184, "text": "And so finding a way to kind of anchor on something that's familiar but then grow into something that's not is an advantage."}, {"time": 11191, "text": "But then again, there's successes otherwise."}, {"time": 11194, "text": "Alexa never had a comp."}, {"time": 11197, "text": "You could argue that that's very novel and very new."}, {"time": 11200, "text": "And there's a lot of other examples that kind of created a kind of a category out of like Kiva systems."}, {"time": 11200, "text": "I mean, they like came in and they like enterprises a little easier because if you can is less susceptible to this because if you can argue a clear value proposition, it's a more logical conversation that you can have with customers."}, {"time": 11221, "text": "It's not it's a little bit less emotional and kind of subjective."}, {"time": 11225, "text": "And the home you have to."}, {"time": 11225, "text": "Yeah, it's like a home robot."}, {"time": 11225, "text": "And so then you really have to be crisp about the value proposition and what like really makes it worth it."}, {"time": 11235, "text": "Like and we, by the way, went to that same where we almost like we almost hit a wall coming out of 2013 where we were so big on explaining why our stuff was so high tech and all the kind of like great technology in it and how cool it is and so forth."}, {"time": 11249, "text": "To having to make a super hard pivot on why is it fun and why does the random kind of family of four need this, right?"}, {"time": 11257, "text": "Like so it's learnings, but that's that's the challenge."}, {"time": 11261, "text": "And I think like robotics tends to sometimes fall into the new category problem, but then you've got to be really crisp about why it needs to exist."}, {"time": 11269, "text": "Well, I think some of robotics, depending on the category, depending on the application is a little bit of a marketing this challenge."}, {"time": 11279, "text": "And I don't I don't mean I mean it's it's the kind of marketing that Waymo is doing that Tesla is doing is like showing off incredible engineering, incredible technology."}, {"time": 11293, "text": "But convincing, like you said, a family of four that this this this is like this is transformative for your life."}, {"time": 11300, "text": "This is they don't care how much tech is in your thing."}, {"time": 11303, "text": "They don't they really don't care."}, {"time": 11303, "text": "They need to know why they want it."}, {"time": 11306, "text": "And some of that is just marketing."}, {"time": 11308, "text": "And that's why like Roomba, like yesterday, you know, like go and have this like, you know, huge, huge ramp into like the entirety of a kind of a robotics and so forth."}, {"time": 11308, "text": "But like they built a really great business and in a vacuum cleaner world."}, {"time": 11323, "text": "And like everybody understands where a vacuum cleaner is."}, {"time": 11323, "text": "Most people are annoyed by doing it."}, {"time": 11328, "text": "And now you have one that like kind of does it itself."}, {"time": 11332, "text": "The various degrees of quality."}, {"time": 11332, "text": "But that is so compelling that like it's easy to understand."}, {"time": 11332, "text": "And like and they had a very kind of and I think they have like 15 percent of the vacuum cleaner market."}, {"time": 11342, "text": "So it's like pretty successful."}, {"time": 11342, "text": "I think we need more of those types of thoughtful stepping stones in robotics."}, {"time": 11348, "text": "But the opportunities are becoming bigger because hardware is cheaper, computes cheaper, clouds cheaper and A.I."}, {"time": 11348, "text": "is better."}, {"time": 11356, "text": "If we zoom out from specifically startups and robotics, what advice do you have to high school students, college students about career and living a life that you'd be proud of?"}, {"time": 11369, "text": "You lived one heck of a life."}, {"time": 11369, "text": "You're very successful in several domains."}, {"time": 11374, "text": "If you can convert that into a generalizable potion, what advice would you give?"}]}]