[{"title": "Michael Mina: Rapid COVID Testing | Lex Fridman Podcast #235", "id": "80OvNaEgmmw", "quotes": [{"time": 339, "text": "It takes 30 seconds, once you know how to do it, of hands on time."}, {"time": 345, "text": "And you wait around 10 minutes, and then you read the result."}, {"time": 350, "text": "They are extraordinarily effective to answer one question, am I infectious?"}, {"time": 357, "text": "And that is the public health question that we need to answer and consistently ask during this pandemic."}, {"time": 365, "text": "Are you infectious?"}, {"time": 365, "text": "Am I infectious?"}, {"time": 365, "text": "Because it's only when we know that we're infectious that we can be empowered to not mistakenly infect others."}, {"time": 379, "text": "The PCR test is a little different."}, {"time": 379, "text": "And we can go into the pros and cons, but one of the major differences is that a PCR test gets a lot of... A lot of people talking about the PCR test say it's much more sensitive."}, {"time": 396, "text": "And at an analytical level, it is."}, {"time": 396, "text": "It can detect one molecule instead of 100,000."}, {"time": 404, "text": "But for public health, we don't want a test that can detect one molecule."}, {"time": 404, "text": "In fact, that has created a net negative for public health."}, {"time": 412, "text": "We just want to know, am I infectious?"}, {"time": 418, "text": "And to know that question, to know if I'm infectious, I only need a test that is going to be positive if I have a high viral load, like a million."}, {"time": 424, "text": "And the virus grows so fast, it will grow from zero to a billion in a day."}, {"time": 430, "text": "So you don't really need, even on the front end of an infection, you don't need better sensitivity."}, {"time": 436, "text": "If the trade off is that you don't get the result for one, two or three days, you absolutely want a rapid result that can tell you, yes, you're infectious, you're transmitting to others right now."}, {"time": 447, "text": "And I'm going to give you the result right now."}, {"time": 453, "text": "So it is a much more effective tool because it's fast, because it's accessible."}, {"time": 453, "text": "We can use them in the home."}, {"time": 458, "text": "And there's some issues with using them at home."}, {"time": 458, "text": "We can talk a little bit about what those issues are, like reporting and how do you use everything on the honor system if you have a test that you're taking at home and you use it to go to work."}, {"time": 469, "text": "But they can be accessible."}, {"time": 475, "text": "PCR has to go into a lab."}, {"time": 475, "text": "It takes a lot of time for somebody to get a PCR test."}, {"time": 475, "text": "They either have to go online and order it."}, {"time": 480, "text": "It takes the next day for it to come back."}, {"time": 480, "text": "They swab themselves, they ship it out the next day, and then they get a result two days later."}, {"time": 484, "text": "That's four days minimum for the most part."}, {"time": 490, "text": "And at that point, you're not even infectious, even if you did happen to be infectious when you first ordered the test."}, {"time": 495, "text": "So it's really the speed of these tests and the accessibility and distribution of them that makes them so immensely powerful."}, {"time": 503, "text": "So you have this like amazing graphic you tweeted."}, {"time": 503, "text": "It's exactly what you're saying, which is rapid antigen test answers the question, am I currently infectious?"}, {"time": 508, "text": "And you have, I think, a comparison of seven different tests based on the viral load."}, {"time": 516, "text": "And based on the viral load across these different tests, you look at the likelihood of infectiousness."}, {"time": 523, "text": "So what does this graphic show?"}, {"time": 530, "text": "We can overlay that for people."}, {"time": 530, "text": "I think it's just really nice and really clear."}, {"time": 534, "text": "So what that's showing is that we can never ask what's the sensitivity of a test and just let that be the answer."}, {"time": 541, "text": "That's what the FDA does currently."}, {"time": 541, "text": "And that question doesn't mean anything."}, {"time": 546, "text": "We have to say, what is the sensitivity of the test to detect what?"}, {"time": 546, "text": "And so we can have different viral loads."}, {"time": 552, "text": "For example, you can have a viral load of one or you can have a viral load of a trillion."}, {"time": 558, "text": "And a PCR test will tell you that you are positive regardless of whether it's one or a trillion."}, {"time": 565, "text": "Now, so we can't ask the question, how sensitive is a rapid test compared to PCR?"}, {"time": 573, "text": "Because that covers the whole gamut."}, {"time": 573, "text": "What we really want to say is, how sensitive is the rapid test to detect me if I am infectious?"}, {"time": 578, "text": "And that gets to about 97% or so sensitive."}, {"time": 578, "text": "If the question is, how likely is it to detect me if I'm a super spreader?"}, {"time": 586, "text": "That's a really important one to be able to detect."}, {"time": 591, "text": "They're all about 100% sensitive."}, {"time": 591, "text": "So if you have extraordinarily high viral loads to the point where you might be a super spreader, these simple rapid tests will essentially always catch you and tell you you're positive."}, {"time": 601, "text": "And then as you go down the line, if you're no longer infectious at all, then these rapid tests might have a 0% sensitivity compared to PCR."}, {"time": 614, "text": "But that's actually a good thing."}, {"time": 614, "text": "The FDA and others look at it as though it's a bad thing because they average it all together and say, oh, this is only a 40% sensitive test compared to PCR."}, {"time": 626, "text": "But that's not the right way to look at it."}, {"time": 626, "text": "You want to say, well, out of all of the samples, how many of them were not transmissible?"}, {"time": 630, "text": "How many were mid, moderate, high, extremely high, super spreader?"}, {"time": 634, "text": "And you should at the very least create a weighted average based on transmissibility potential."}, {"time": 638, "text": "And that's why nobody in America has these tests, because that's why they're very rare."}, {"time": 644, "text": "Because we have slowed down their authorization because of that misunderstanding that they don't have to be 80% or 90% sensitive compared to any time PCR positivity."}, {"time": 656, "text": "They need to be 80% or 90% or more if you're infectious."}, {"time": 656, "text": "And for that question, they're like 95% up to 100% sensitive when you're most infectious."}, {"time": 668, "text": "So when you have a lot of virion particles in you, that's what it means when you say viral load, that means you're going to be very infectious."}, {"time": 674, "text": "The more you have, the more infectious you are."}, {"time": 678, "text": "And this test is basically very good at detecting when you're very infectious."}, {"time": 685, "text": "Why don't we have rapid at home tests?"}, {"time": 685, "text": "You said there's a bit of confusion."}, {"time": 685, "text": "FDA is involved."}, {"time": 693, "text": "You've talked about, you continue to talk about that these at home tests are classified as, I guess, medical devices."}, {"time": 700, "text": "And so because of that, FDA is looking at them differently than they probably should be looked at."}, {"time": 707, "text": "So what's the problem here?"}, {"time": 707, "text": "Can you sort of explain what does it mean to be a medical device?"}, {"time": 714, "text": "Why is that an issue?"}, {"time": 714, "text": "Where is the FDA messing up?"}, {"time": 719, "text": "So when we declare something as a medical device and we evaluate as a medical device, then it makes sense that the comparison, if you're trying to get a new one onto the market, that the comparison would be against a gold standard medical device for that purpose."}, {"time": 737, "text": "So PCR is currently the gold standard, or at least in the eyes of the FDA, the PCR test is the gold standard medical device."}, {"time": 744, "text": "And that's because it's so sensitive."}, {"time": 753, "text": "As a physician, I have one patient in front of me at a time."}, {"time": 753, "text": "And that patient comes to me and I don't have to care about the 99.9999% of people in the world who are not in front of me."}, {"time": 759, "text": "I only care about that one patient."}, {"time": 767, "text": "And so when I get a sample from that patient and that patient's saying, Doc, I don't feel well."}, {"time": 771, "text": "I haven't been feeling well for the last few weeks."}, {"time": 771, "text": "Do you think this is COVID?"}, {"time": 776, "text": "Well, for that question, I want to have the absolute best sensitivity test, regardless of what it means for transmissibility, because my patient isn't sitting in my office saying, Doc, do you think I'm infectious?"}, {"time": 788, "text": "They're saying, Doc, do you think I have recently been or am infected?"}, {"time": 794, "text": "And these are totally different things."}, {"time": 794, "text": "One is medicine."}, {"time": 794, "text": "And if the patient's infected, the time isn't of the essence because they're sitting there in my office."}, {"time": 800, "text": "I can say, look, I'm sorry you're not feeling well."}, {"time": 804, "text": "Let's get a PCR test on you."}, {"time": 804, "text": "We'll be able to tell you if you have any evidence that there has been recently an infection inside of you."}, {"time": 815, "text": "And you'll get the results in a couple of days."}, {"time": 815, "text": "And it might be expensive."}, {"time": 815, "text": "And so insurance is going to pay for it."}, {"time": 821, "text": "And you're just one person."}, {"time": 821, "text": "And so I don't really care how many resources it takes to get you this answer."}, {"time": 826, "text": "On the other hand, there's public health testing."}, {"time": 826, "text": "And public health testing has to account for all of the people you're not seeing as well as the person you're testing at the moment."}, {"time": 839, "text": "So accessibility becomes a central theme."}, {"time": 839, "text": "Frequency of tests, it has to account for all the days that you're not sitting there in front of your doctor's office getting a test as well as the one you are."}, {"time": 850, "text": "So it has to say how frequently."}, {"time": 850, "text": "What if you're infected tomorrow, but you're at the doctor's office today getting a negative COVID test?"}, {"time": 855, "text": "That PCR test at the doctor's office today is going to do nothing to let you know that you get exposed and infected tomorrow."}, {"time": 866, "text": "The only way to know that is to be testing yourself frequently."}, {"time": 871, "text": "And the reason it matters is that these tests can be accessible if we are okay with saying the real purpose of a public health test is to answer the question, am I infectious?"}, {"time": 882, "text": "The reason we want to answer that is if you're infectious, that's when you isolate."}, {"time": 882, "text": "We actually don't want to isolate PCR positive individuals who are no longer infectious."}, {"time": 887, "text": "That's bad public health practice."}, {"time": 896, "text": "If I haven't been infectious for three weeks, I don't want to have somebody tell me that I need to go and isolate for 10 days just because I happen to use a PCR test today, three weeks after I was infectious."}, {"time": 908, "text": "And furthermore, I definitely don't want the public health agency to come and round up all the people I was with last night and say, you guys have to quarantine for 14 days because you were with Michael who wasn't infectious yesterday."}, {"time": 923, "text": "It's nonsensical to do that."}, {"time": 923, "text": "And it's a huge disincentive to actually get tested."}, {"time": 929, "text": "Huge disincentive to get tested."}, {"time": 929, "text": "People, if it's too sensitive, especially with flights, things like that, we shouldn't be stopping people from taking a flight if they haven't been infectious for 60 days."}, {"time": 939, "text": "And to be clear, people are only infectious for somewhere between three and seven days, but can be positive on a PCR test for 30 to 70 days."}, {"time": 946, "text": "So, I mean, it's potentially a tenfold difference in terms of how long you're PCR positive versus how long you're infectious."}, {"time": 960, "text": "So, we don't want to be taking people during those 30 to 70 days and saying you need to isolate just because you go and get a swab, or you can't go on your trip just because you had COVID last month."}, {"time": 971, "text": "That's not good use of a test."}, {"time": 971, "text": "So, the reason we don't have these tools right now is because when we evaluate a rapid test as a medical device, the FDA says, well, this has to achieve the properties that we expect from a medical device, which again, doesn't have to take time into account, doesn't really have to take cost or resources or scalability or access into account."}, {"time": 999, "text": "It only takes sensitivity and specificity to catch molecules."}, {"time": 1039, "text": "And that's because you're only infectious for maybe 20%."}, {"time": 1039, "text": "So, theoretically, it should only have a 20% sensitivity against the PCR while still being a perfect medical, a perfect public health test."}, {"time": 1053, "text": "And the test is answering the question, am I infectious?"}, {"time": 1053, "text": "That's what you're testing for, not for the exact counting of the virion particles in your system."}, {"time": 1057, "text": "So, why are we still here?"}, {"time": 1063, "text": "So, have you had conversations with folks?"}, {"time": 1063, "text": "You said that there's a bunch of leaders that are kind of starting to wake up to this idea, but why is this taking this so long?"}, {"time": 1078, "text": "Why don't we still have hundreds of millions of at home tests?"}, {"time": 1078, "text": "The reason it's taking long, the reason it's taking long, I think, is because every agency and government is generally deferential to the FDA."}, {"time": 1095, "text": "And in this context, I would argue that government hasn't been particularly creative."}, {"time": 1104, "text": "So, for example, last year, when Trump was still president, I would, or in the transition, and I recall talking to the White House a number of times and saying, here's a plan to give us our lives back."}, {"time": 1112, "text": "I think that was actually the title of the Atlantic article."}, {"time": 1117, "text": "And this plan can stop shutdowns, it can stop outbreaks, it can allow society to keep running and could have prevented the outbreaks of last winter and fall and saved hundreds of thousands of lives."}, {"time": 1131, "text": "So, when I bring that to the White House or to the government, the federal government, whoever it might be, and I say, here's a plan, this would work."}, {"time": 1137, "text": "They say, what I get back is, this sounds really interesting, Michael."}, {"time": 1143, "text": "It looks like it checks out."}, {"time": 1143, "text": "But there's one problem, we don't have the test, there's no scale."}, {"time": 1149, "text": "And that's kind of where it all dropped."}, {"time": 1149, "text": "It's like this defeatist attitude of like, don't have the test, so we can't act on it."}, {"time": 1153, "text": "But now it's really changing."}, {"time": 1160, "text": "Well, and so that's really where things have been."}, {"time": 1160, "text": "And so nobody's paid attention."}, {"time": 1160, "text": "It's always been this like esoteric thing that, yeah, maybe one day we'll get around to it, but really it's not that important."}, {"time": 1170, "text": "And the pandemic's going away."}, {"time": 1170, "text": "But this was like 100% predictable, everything that's happening today."}, {"time": 1176, "text": "We predicted it last year."}, {"time": 1176, "text": "It's not, this isn't like rocket science or anything."}, {"time": 1181, "text": "The variants and all those kinds of things."}, {"time": 1181, "text": "So the FDA, we can start to understand why, but also like one question I want to ask, is it possible to go around the FDA?"}, {"time": 1192, "text": "So why has the FDA not changed?"}, {"time": 1192, "text": "And why has nobody tried to push the FDA to change?"}, {"time": 1201, "text": "I think what the real reason is the FDA has one job around these tests and it is to authorize them as medical devices."}, {"time": 1208, "text": "They haven't been charged with doing anything else."}, {"time": 1208, "text": "So in their eyes, they're doing exactly what they're supposed to do."}, {"time": 1214, "text": "They're evaluating these tests as medical devices and they're telling company after company after company, sorry, you don't make the cut."}, {"time": 1226, "text": "And the only way to make the cut is really to kind of skew your clinical trials to favor the rapid test being positive, which isn't really good practice."}, {"time": 1231, "text": "We shouldn't be trying to skew clinical trials."}, {"time": 1236, "text": "But that's kind of what's happened."}, {"time": 1236, "text": "It's been forced upon the companies to do that."}, {"time": 1243, "text": "And so I think the FDA truly believes from the bottom of their heart that they are doing the right thing here."}, {"time": 1248, "text": "And I would argue that to an extent they are."}, {"time": 1248, "text": "I've been pretty hard on the FDA, but maybe the issue is a higher level issue."}, {"time": 1253, "text": "Like the in vitro diagnostics division is they get applications and they evaluate them and the applications are for medical claims."}, {"time": 1264, "text": "That's however, because there's been a misunderstanding of these tests and the companies only know to apply for these as medical claims because there's nothing else in this country to apply for except the medical claim."}, {"time": 1278, "text": "So we don't have a public health pathway to evaluate a test and authorize a test."}, {"time": 1284, "text": "We have defunded and devalued public health for so long that we literally don't have a language for it."}, {"time": 1290, "text": "We don't have laws, a language, words."}, {"time": 1296, "text": "Is it called a public health test?"}, {"time": 1296, "text": "Is it called something else?"}, {"time": 1300, "text": "I call it a public health test because I'm trying to create a new definition here, but that's why nobody's acted because everyone says, well, there's no other pathway."}, {"time": 1305, "text": "So the FDA in vitro medical diagnostics division is the only pathway."}, {"time": 1313, "text": "So what I am trying to do is to say, look, the FDA very clearly states that they do not authorize or review public health tools and they don't authorize or review public health tests for COVID."}, {"time": 1329, "text": "So what I want the president of the United States to do is to utilize executive powers and take an executive action that can simply state like one line."}, {"time": 1344, "text": "One line could potentially change all of this."}, {"time": 1344, "text": "And it's a pretty obvious and simple line."}, {"time": 1351, "text": "And it is that any tools used for public health testing during this public health emergency will be designated as public health tools."}, {"time": 1359, "text": "Like it's obvious, like it's public health emergency."}, {"time": 1367, "text": "It's a tool used for public health that should be designated as a public health tool."}, {"time": 1371, "text": "If we can do that, if we can get that language out there so that that's the president's decision, then all of a sudden the FDA is off the hook."}, {"time": 1377, "text": "They're not trying to cram a square peg through a round hole."}, {"time": 1385, "text": "They can say, look, the antigen tests are not on us anymore."}, {"time": 1385, "text": "At least if they're going to be used for public health, like when you test a thousand people at a time or test a school classroom if they've been exposed, this is public health."}, {"time": 1396, "text": "And so then the CDC could take it over."}, {"time": 1403, "text": "The CDC could say, okay, what are the metrics we are interested in?"}, {"time": 1403, "text": "And they could say, we're interested in a test that can catch you if you're infectious."}, {"time": 1410, "text": "So you want high viral load detection."}, {"time": 1414, "text": "That's fast, that's scalable."}, {"time": 1414, "text": "And hey, if your test has been used in Europe for months and has performed extremely well, then we'll give you a certificate by right immediately."}, {"time": 1420, "text": "And that could actually get hundreds of millions of additional tests into the United States tomorrow."}, {"time": 1434, "text": "So you need some kind of classification from an FDA or from somebody to call it a public health tool in order for it to be manufactured."}, {"time": 1439, "text": "Is it possible to just go around all of this and just for somebody to manufacture at scale tests?"}, {"time": 1444, "text": "Well, if you did that and you just called them, you put a claim on them that called them public health tools, the FDA has a very weird view of this and they will tell you that it's illegal, that it's a crime."}, {"time": 1464, "text": "Is there a way to say like Elon Musk did with the flamethrower, it's not a flamethrower?"}, {"time": 1469, "text": "Believe me, I've tried to think of all the different approaches."}, {"time": 1469, "text": "There's major inconsistencies here."}, {"time": 1478, "text": "So it's not like we don't have a precedent for a public health test even during this pandemic."}, {"time": 1482, "text": "There is a very strong precedent."}, {"time": 1482, "text": "Pooled testing, we have companies like Ginkgo based out here in Cambridge that are working with 100 different labs around the country."}, {"time": 1497, "text": "So that might mean like not a ton of quality control over those labs."}, {"time": 1497, "text": "I don't want to say that they don't, I'm just saying the reality is if you're working with that many labs, it's hard to say, they're running pooled testing of millions and millions and millions of kids."}, {"time": 1515, "text": "So here you have a company that's testing in each pool five to 25 kids at a time, millions of kids in a pretty distributed way across the country in all these different labs and the FDA doesn't care at all."}, {"time": 1528, "text": "You don't need an EUA."}, {"time": 1528, "text": "It doesn't need a regulatory authority."}, {"time": 1533, "text": "It's collection on site."}, {"time": 1533, "text": "It's getting shipped to a lab."}, {"time": 1533, "text": "There's no oversight of it."}, {"time": 1533, "text": "So why does that have no oversight but a rapid test for the exact same purpose?"}, {"time": 1540, "text": "You're just giving people immediate results instead of two day delayed pooled PCR results."}, {"time": 1547, "text": "So it's a much more effective tool."}, {"time": 1553, "text": "Why is the rapid test used for the same purpose, not designated as a public health tool, but requiring FDA authorization?"}, {"time": 1558, "text": "It's a ridiculous reason and it's because the FDA says that if a test, and this is actually CMS that says this and the FDA adopts it, if a test alters your behavior, if you get a single result and it's going to alter your behavior, then that is a medical device."}, {"time": 1582, "text": "But the thing that I find ridiculous is like, okay, but you can give a pooled test that alters 25 people's behavior at once and that's not falling, like that's more risky."}, {"time": 1595, "text": "One person turns positive in the pool and 25 people have to be quarantined."}, {"time": 1602, "text": "And how do they evaluate the accuracy?"}, {"time": 1602, "text": "So for people who don't know, pooled test is you're testing a small fraction of the people."}, {"time": 1607, "text": "And if one of them is positive, then you basically say, we have to retest everybody in the pool."}, {"time": 1617, "text": "So you take, let's say you have a school and each classroom you might have 20 kids each swab their nose in a classroom and all those swabs go into a single tube."}, {"time": 1623, "text": "And then you rinse that tube out with some saline and you run a PCR test on that tube of 25 samples, 20 samples."}, {"time": 1629, "text": "And so if that tube turns positive in the PCR test, then all 20 or 25 of those students are now having to quarantine."}, {"time": 1643, "text": "And if there's no positive, then all 20 or 25 students are interpreting that their result is negative."}, {"time": 1651, "text": "So it really is ridiculous decision by the FDA to say that if the test itself only tests one sample at a time, it's medicine because it will tell you one person at a time, if you're positive or if you're negative."}, {"time": 1664, "text": "But if you do it as a pool and you tell 25 people that your pool was negative, then that's somehow different."}, {"time": 1671, "text": "That's public health, not medicine."}, {"time": 1678, "text": "There's no logic there."}, {"time": 1678, "text": "Was it just personalities and accidents of history or something like that?"}, {"time": 1680, "text": "For example, you talk about the public health tools and CDC, you look at masks."}, {"time": 1686, "text": "So masks were decided to somehow be an effective tool to help with the pandemic."}, {"time": 1692, "text": "So I'm sure the evidence that was used there was probably not as strong as the evidence supporting antigen rapid tests."}, {"time": 1700, "text": "I was very much reading a lot of research on masks."}, {"time": 1706, "text": "It's really tricky to show how well they stop the transmission of a virus, especially when you don't fully understand how the virus is transmitted or the viral load required, all that kind of stuff."}, {"time": 1716, "text": "But then the CDC pretty quickly decided masks or whatever, there's some oscillations back and forth, but then they quickly decided, everybody decided masks is a good tool."}, {"time": 1727, "text": "So masks being decided a good tool and then rapid antigen tests, not a good tool."}, {"time": 1733, "text": "Is that just like certain personalities who didn't speak up in a meeting or who did speak up in a meeting?"}, {"time": 1738, "text": "Is this just like a weird roll of the dice or is there a better explanation?"}, {"time": 1743, "text": "I think it's somewhat of a roll of the dice, but I also think it's that testing."}, {"time": 1749, "text": "So doctors don't pretend to really understand much about fluid dynamics and how well masks are working."}, {"time": 1760, "text": "That's way out of their realm."}, {"time": 1760, "text": "Doctors do believe that they understand all aspects of the tests."}, {"time": 1768, "text": "And so the greatest barriers to rapid tests being brought to market or being rolled out heavily and supported as public health tools, the greatest barriers came from physicians saying, hell no, we can't use a test that's not as sensitive as a PCR."}, {"time": 1791, "text": "And look at what happens if you use this antigen test and not a PCR test."}, {"time": 1791, "text": "You get people who are showing a positive on a PCR and negative on an antigen."}, {"time": 1798, "text": "And they just assume that that was a false negative on the antigen."}, {"time": 1805, "text": "For public health, I would call it a false positive on the PCR test."}, {"time": 1812, "text": "But this type of thinking literally does not exist in medicine."}, {"time": 1812, "text": "And I think the biggest problem here is that we placed physicians in decision making power."}, {"time": 1818, "text": "When this pandemic hit, everyone called up clinical laboratory folks and microbiologists and physicians to ask, well, what kind of test should we use, that kind of thing."}, {"time": 1834, "text": "And there is no training in medical school for this kind of public health work."}, {"time": 1840, "text": "You have to optimize on the right qualities of a test that have nothing to do with medicine."}, {"time": 1847, "text": "And then sometimes, if not frequently, they're actually at odds."}, {"time": 1847, "text": "And I'll give an example why the physicians, you could see why the physicians would have been against it from their perspective."}, {"time": 1859, "text": "And they say, if a physician is a TSA agent at the airport, you know, a TSA agent, their role at any given time, and the role they think that the instruments need to play is I want you to scan the bag as well as possible."}, {"time": 1874, "text": "This is the only bag that I'm interested in at the moment."}, {"time": 1880, "text": "And this is my lane, this is my bag."}, {"time": 1880, "text": "I want to make sure that my instrument's doing, I don't want the crappy instrument in my lane, I want to make sure that I'm doing everything I can."}, {"time": 1886, "text": "But what those TSA agents don't have to worry about is, well, how many other instruments are there in this airport?"}, {"time": 1896, "text": "Is anyone getting through the lines here without going through security?"}, {"time": 1896, "text": "The average TSA agent doesn't have to worry about that."}, {"time": 1902, "text": "They literally have one job to do, and it's pay attention to this lane."}, {"time": 1905, "text": "If there's a big gap in the security line and people are flowing through without going through security, that's not on the TSA agent."}, {"time": 1912, "text": "That's not a big systematic problem of that of the system."}, {"time": 1916, "text": "And we can't expect that TSA agent to have ever even thought about that."}, {"time": 1916, "text": "Like, that's not on them."}, {"time": 1924, "text": "They were trained to look at the bag."}, {"time": 1924, "text": "And that's kind of like physicians."}, {"time": 1929, "text": "That's kind of like physicians."}, {"time": 1929, "text": "And probably some physicians will hear this and feel like I'm insulting it."}, {"time": 1935, "text": "I don't mean to be likening the two professions or anything like that."}, {"time": 1935, "text": "But the point is that a physician has one duty."}, {"time": 1940, "text": "Do no harm to this patient."}, {"time": 1940, "text": "Time is an of the essence."}, {"time": 1940, "text": "Scale, how many tests can my hospital perform in a day?"}, {"time": 1948, "text": "How many tests can my county or country perform in a day?"}, {"time": 1955, "text": "That's not a physician's training to think like that at all."}, {"time": 1955, "text": "And so what has happened is doctors got on board early and said, oh, hell no."}, {"time": 1962, "text": "We've seen these antigen tests before."}, {"time": 1962, "text": "They're not particularly sensitive compared to PCR."}, {"time": 1967, "text": "And early in the pandemic, there was like pissing matches between labs who had the most sensitive PCR."}, {"time": 1972, "text": "And it just distracted everything."}, {"time": 1972, "text": "I was trying to say pretty early, like, we don't need sensitivity."}, {"time": 1980, "text": "We just need frequency."}, {"time": 1980, "text": "We just need scale."}, {"time": 1986, "text": "We need to think differently because our only goal if we're doing frequent routine testing of asymptomatic people is not medicine."}, {"time": 1992, "text": "It's to say, do you need to isolate now?"}, {"time": 1992, "text": "And if you have a PCR test that's taking three days to return and you're like, if I was currently spreading virus before I walked in here and you handed me, this actually happened to me today when I walked into Harvard."}, {"time": 2007, "text": "Today was my first day back into Harvard since February of 2020."}, {"time": 2007, "text": "I go in, I scan my badge and they hand me a PCR tube and they say like, return this by noon or something before your work day is done."}, {"time": 2022, "text": "And I'm looking at it."}, {"time": 2022, "text": "I'm like, what is this going to do?"}, {"time": 2022, "text": "Like, what if I'm super spreader right now?"}, {"time": 2028, "text": "You're giving me free reign to walk around and infect everyone in the school and you're going to give me my result to tell me I did that in two days from now?"}, {"time": 2032, "text": "It doesn't really make sense."}, {"time": 2038, "text": "So who is supposed to be, so it's understandable that doctors kind of feel that way, just like you said, do no harm."}, {"time": 2044, "text": "Who's supposed to care about public health?"}, {"time": 2044, "text": "Is it the FDA?"}, {"time": 2044, "text": "Is there some other organization yet to be created?"}, {"time": 2052, "text": "Is it like, just like with the military, the reason we have civilian leadership when you talk about war, is it the president that's supposed to do like override FDA, override doctors, override and basically politicians in representing the people in the state of emergency make big public health decisions?"}, {"time": 2072, "text": "Like who is supposed to do it?"}, {"time": 2072, "text": "Besides you on Twitter."}, {"time": 2077, "text": "It's like most people really thinking about solutions to COVID will mention you or will mention this idea of rapid at home testing."}, {"time": 2085, "text": "And it's, you watch that happening, this discussion that this is an obvious part of the solution and the solution is not happening."}, {"time": 2097, "text": "So who is supposed to implement this idea?"}, {"time": 2097, "text": "I think the CDC that it should start there."}, {"time": 2104, "text": "Override the FDA?"}, {"time": 2104, "text": "Well, I don't even think it needs to override it."}, {"time": 2104, "text": "And that's why I think these should just be designated as a different tool so that the company is, it's not overriding."}, {"time": 2114, "text": "It's just saying, look, this isn't even, this isn't in your jurisdiction to the FDA."}, {"time": 2114, "text": "This is just a public health tool."}, {"time": 2119, "text": "But the problem is the centers for Medicaid, Medicare services designates any tool, just like FDA, they designate these as medical devices purely because they could change somebody's behavior based on the result of one test."}, {"time": 2131, "text": "So to change that at this point, unless you can get CMS buy in, you know, we don't have, there is no designation as a public health tool, but the president can just say, these are public health tools."}, {"time": 2142, "text": "These are not to be regulated as medical devices if their goal is not medicine, but public health."}, {"time": 2155, "text": "And if he does it, he does have the authority to do that as president and to say, I'm tasking the CDC to certify these tests or, or authorize them for use in the United States."}, {"time": 2163, "text": "And, you know, he has to say something like that."}, {"time": 2168, "text": "He can't come out and say, these are public health tools, have free reign, just, you know, any company start, start shipping them in the US because that would create pandemonium and we'd have a lot of bad tests."}, {"time": 2179, "text": "But there's a lot of really good tests out there."}, {"time": 2185, "text": "We just are taking like six to 12 months to run trials."}, {"time": 2185, "text": "They're failing because they can't keep up with PCR."}, {"time": 2190, "text": "And if the president were to do this, then the CDC could take it over and they could say, okay, it's on us."}, {"time": 2197, "text": "We're going to decide."}, {"time": 2197, "text": "The UK actually did this."}, {"time": 2197, "text": "They, early on, they said, okay, they laid out a very clear regimen."}, {"time": 2204, "text": "They said, this is how we are going to evaluate rapid antigen tests because they're public health tools."}, {"time": 2209, "text": "They did it in a, in a domain that was outside of their normal medical diagnostic regulatory agencies."}, {"time": 2216, "text": "And they, they literally just had a very fast screening to say, what are the best tests?"}, {"time": 2222, "text": "They went through a huge number of different tests and they said, okay, these are the, this is the rank order of which tests are good, which are bad, which are scalable, which are not."}, {"time": 2232, "text": "And they were able to start deploying them in weeks, not years."}, {"time": 2238, "text": "So I think the CDC really needs to take charge."}, {"time": 2238, "text": "The problem is when it comes to like law, if everyone currently perceives this as like fully within the domain of the FDA and they've never heard of such enough public health test idea enabling, but the, but the FDA itself has created the idea by saying we don't regulate public health tools."}, {"time": 2259, "text": "So the word is out there."}, {"time": 2259, "text": "The FDA has said, we don't regulate them."}, {"time": 2265, "text": "So that gives the president an opportunity to say, okay, these are those, you know, these are public health tools by definition."}, {"time": 2271, "text": "And, and I do think that this is a kind of a crisis and it's a crisis of testing, but it's also a crisis of like, really, we're going to go through this whole pandemic and never figure this thing out."}, {"time": 2282, "text": "That's just really sad."}, {"time": 2282, "text": "You know, if we get through this and don't figure out how to evaluate a rapid test."}, {"time": 2288, "text": "So how do vaccines play with this?"}, {"time": 2295, "text": "So one of the things that when people discuss solutions to COVID, there's a sense that once you have a vaccine COVID is solved."}, {"time": 2302, "text": "So how does that interplay?"}, {"time": 2302, "text": "Like, why do we still need tests if we have vaccines?"}, {"time": 2309, "text": "Yeah, I actually wrote an op ed in New York times or Wall Street Journal or something that was titled why we still need rapid tests with vaccines."}, {"time": 2316, "text": "And the real reason is because we have evaluated our vaccines based on their ability to stop disease."}, {"time": 2324, "text": "In fact, most of the trials didn't evaluate them based on their ability to stop transmission."}, {"time": 2331, "text": "They didn't even evaluate that at all, no less put it as one of the metrics for authorization."}, {"time": 2337, "text": "And with a virus like this, it would be a bit naive to think that it's really going to stop transmission well."}, {"time": 2352, "text": "I think a lot of excitement happened right after the first clinical trials."}, {"time": 2352, "text": "And I'm sure we were talking about it when I was last here, I would imagine given the timing."}, {"time": 2357, "text": "But those first clinical trials came out and everyone jumped for joy that these things were going to be the end to this pandemic."}, {"time": 2367, "text": "But we had really short sighted vision there by not recognizing two main features."}, {"time": 2367, "text": "One is that they might not stop transmission."}, {"time": 2375, "text": "Another, I guess three, another is that new variants might come around that will break through the vaccine protective immunity."}, {"time": 2381, "text": "And the third is that we were measuring the efficacy of these vaccines during the peak of their performance in the first few months after people got vaccinated."}, {"time": 2394, "text": "And that gives a skewed view of just how effective these are going to be long term."}, {"time": 2399, "text": "So what happened with the vaccines is that everyone got very comfortable, including the CDC saying, if you've been vaccinated, this is the end of the pandemic for you."}, {"time": 2410, "text": "And let's keep it up."}, {"time": 2410, "text": "But then Delta comes along and waning immunity comes along."}, {"time": 2410, "text": "And both of these things compound exactly as anticipated to get breakthrough cases."}, {"time": 2417, "text": "And unfortunately, what we're seeing now is the CDC and the administration went so all in on saying that breakthrough cases are rare, that transmission doesn't really happen if you're vaccinated without great data, especially with Delta, that once people started seeing breakthrough cases, they started interpreting that as a failure of the vaccine."}, {"time": 2441, "text": "The vaccines are still working to keep people out of the hospital for the most part, but they're not working to stop transmission."}, {"time": 2453, "text": "And if our goal is to stop transmission, which until we decide as a society that we have different goals, like we're okay with people getting ill and letting transmission go because we don't want to worry about it anymore."}, {"time": 2466, "text": "So until we decide that we're not going to stop transmission, we need other avenues besides the vaccine because it's not doing it."}, {"time": 2470, "text": "It also means that herd immunity isn't going to happen."}, {"time": 2476, "text": "And unfortunately, as long as we keep letting spread happen in the context of vaccinated people, we're kind of giving this virus a bootcamp of exactly what it needs to do and mutate to get around our vaccine derived antibodies."}, {"time": 2493, "text": "And that makes me very nervous."}, {"time": 2493, "text": "So the more we can do to stop spread in the unvaccinated, in the elderly vaccinated, and in other people, the better."}, {"time": 2503, "text": "We just should be focusing on that."}, {"time": 2503, "text": "So in your eyes, the solution would look like this."}, {"time": 2509, "text": "You would make enough tests where every single person will get tested every single day?"}, {"time": 2513, "text": "I think that that would be..."}, {"time": 2513, "text": "I don't want to do that actually."}, {"time": 2513, "text": "I want to do a variation on that."}, {"time": 2520, "text": "I think what we should do is have a dynamical testing program."}, {"time": 2520, "text": "It doesn't have to be complicated."}, {"time": 2526, "text": "Every household has a box of tests in their cupboard."}, {"time": 2526, "text": "And if you haven't seen any cases in your community for a long time, stop testing."}, {"time": 2534, "text": "Do wastewater testing to see if there's any RNA coming back."}, {"time": 2539, "text": "If you start to see RNA in the wastewater that represents the virus, and you're still wanting to stop outbreaks, you say, hey, you know those tests that are in your cupboards, households in this county, why doesn't each household or each person in each household use one test per week?"}, {"time": 2555, "text": "Can you start to just pause on that idea?"}, {"time": 2555, "text": "That's really cool, the wastewater testing."}, {"time": 2564, "text": "That's the thing?"}, {"time": 2564, "text": "So you can get a sense of how prevalent the virus is in a particular community by testing the wastewater?"}, {"time": 2569, "text": "And so the viral load associated, the viral load that you can find in the community represents the prevalence of the virus in the community, which is really quite nice."}, {"time": 2582, "text": "That's a nice way to paint like a map of the intensity of the virus."}, {"time": 2588, "text": "Okay, so when it goes above a certain level, you can start doing much higher frequency testing in each household."}, {"time": 2597, "text": "So I don't want people to be in testing purgatory, like that's not what I want."}, {"time": 2603, "text": "I just want us to get through this damn pandemic."}, {"time": 2603, "text": "And so we can monitor the wastewater or any other methods."}, {"time": 2609, "text": "We can monitor the hospitals and the clinics."}, {"time": 2609, "text": "And if somebody does come in with COVID like symptoms, and then a few other people come in, you realize, okay, we got spread happening in our community."}, {"time": 2618, "text": "Send out a text message, put it on the news, put in the newspaper, whatever you need to do, tell people, tell families, use your test."}, {"time": 2628, "text": "And if the cases get worse, because you're just doing it once a week, that's not going to stop transmission, but it's going to enable you to identify where outbreaks are happening."}, {"time": 2638, "text": "If you start to find outbreaks in pockets, then the rule is simply, okay, let's squash the outbreak real fast."}, {"time": 2643, "text": "So everyone in that area in certain zip code or whatever it might be, test every two days for seven days or every day for seven days, and you'll get rid of the outbreak."}, {"time": 2655, "text": "And if you've now gone, again, a week or two with no cases identified, stop the testing again."}, {"time": 2663, "text": "That's the nice thing that everything changes when people have the tests in their home."}, {"time": 2668, "text": "It becomes dynamic."}, {"time": 2668, "text": "It can become easy."}, {"time": 2668, "text": "You send a text message, take your test today."}, {"time": 2675, "text": "If some people don't do it, that's fine."}, {"time": 2675, "text": "The only goal is to get R below one, and you stop the outbreak."}, {"time": 2681, "text": "People think it has to be near perfect."}, {"time": 2681, "text": "I always hear people say, oh, what if somebody doesn't use it?"}, {"time": 2688, "text": "Or what if somebody lies?"}, {"time": 2688, "text": "Well, you have 98% of people testing or even 50%."}, {"time": 2694, "text": "That's a whole lot better."}, {"time": 2694, "text": "And another big difference that people, I think, oftentimes have a problem wrapping their head around, especially to an extent physicians who are used to different kinds of metrics, is that all we have to do to completely stop an outbreak from spreading in a community is to get, for every 100 infected people, to get them to go on and infect 95."}, {"time": 2721, "text": "Most people would say, oh my God, that's a horrible program."}, {"time": 2721, "text": "You're still letting 100 people go and infect 95 people."}, {"time": 2729, "text": "But for a virus like this, that's a massive public health win."}, {"time": 2736, "text": "If you can get 100 people to infect 90, most people, doctors, I would say, like a lot of people would say, that sounds like a failure, to be honest."}, {"time": 2742, "text": "But if you do that for multiple days in a row, then in a couple of weeks, you've gone from a big outbreak to a very, very small outbreak."}, {"time": 2753, "text": "And on the other hand, if you don't do that, if you allow 100 people to just infect 140 people, because you're not doing the testing, then instead of having 20 people at the end of those four weeks with the testing, you literally would have 600."}, {"time": 2763, "text": "Massive differences here."}, {"time": 2770, "text": "The only goal then is to get R below one, have 100 people infect less than 100, and you stop the outbreaks and everyone stays safe."}, {"time": 2776, "text": "From everything you've seen, how cheap can these things get?"}, {"time": 2781, "text": "From like in the past year, in terms of the developments you've seen with the various test manufacturers, how cheap can it be to make a test, to manufacture a test?"}, {"time": 2786, "text": "So there's the manufacturing process that could be 50 cents, maybe less."}, {"time": 2792, "text": "It's hard to really have eyeballs inside these companies in terms of where they're producing them in China and Taiwan, a number of other places."}, {"time": 2803, "text": "Some of them are produced here in the United States too, but 50 cents, say, was a very, very reasonable, generous number for how much it costs per test."}, {"time": 2814, "text": "You look at a place with high market competition that has actually authorized a lot of these tests like Germany."}, {"time": 2819, "text": "Germany has 60, 70 some odd different companies of high quality rapid tests authorized."}, {"time": 2824, "text": "You can go there and buy it for 80 cents, and they're still making a profit."}, {"time": 2830, "text": "And so it's extremely cheap."}, {"time": 2830, "text": "Market competition can drive these tests way down in terms of cost."}, {"time": 2839, "text": "I think one of the most important features of a rapid test program is what do you do with the result?"}, {"time": 2845, "text": "Is it going to be used for you to gain entry to school or work?"}, {"time": 2845, "text": "Is it going to be reported to the public health agencies?"}, {"time": 2853, "text": "All of these, the primary mode should be just get people tests, but really if you're going to be using it for a workplace thing, like what Biden is now saying, vaccinate or test, which is going to lead to a crisis if we don't fix this soon because we're going to have massive demand for testing in the next couple of weeks."}, {"time": 2866, "text": "But when he says that, that's essentially saying, okay, companies need to make sure that their people are testing."}, {"time": 2876, "text": "So are you going to base it on the honor system?"}, {"time": 2876, "text": "I would say you probably would not base testing on the honor system if it's like to take somebody who would otherwise be quarantined from work in school."}, {"time": 2888, "text": "And so you can go to school as long as your test is negative."}, {"time": 2888, "text": "So test to stay program is a big thing that I've been pushing for and others have."}, {"time": 2893, "text": "Businesses bringing people into work who need to test, they need to have verification, but they don't want to set up nursing stations in their lobbies or in the school parking lot or whatever."}, {"time": 2904, "text": "Everyone's tired of that."}, {"time": 2910, "text": "We need to bring the tests into the home, but that means we need the technology to enable it."}, {"time": 2914, "text": "And so I was at a conference recently."}, {"time": 2914, "text": "Do you know Mike Milken?"}, {"time": 2914, "text": "Milken Institute."}, {"time": 2914, "text": "He's a very wealthy billionaire, but he's done a lot of philanthropy and he has a conference to raise money for prostate cancer research."}, {"time": 2926, "text": "I was at this conference recently, Francis Collins, a number of other people were there."}, {"time": 2932, "text": "And every morning we all had to test in the morning, which I thought was a great idea obviously before we walked into that conference."}, {"time": 2938, "text": "But you didn't have to test there and they didn't base it on the honor system."}, {"time": 2945, "text": "Every morning I scanned a QR code on the box and eMed, which is a service that provides test verification, popped up with a proctor right on my phone or on my computer and said, okay, let's go through your tests."}, {"time": 2959, "text": "And they watch you, they videotape you using the test."}, {"time": 2965, "text": "So it's all recorded."}, {"time": 2965, "text": "It's all a reportable type of test."}, {"time": 2970, "text": "And at the end of it, just from your home, you don't actually see the proctor, you know, but they're just verifying that you actually do it."}, {"time": 2975, "text": "They verify the test, they verify the test results with you."}, {"time": 2979, "text": "And at the end of it, you've then gotten from your couch or from your car, wherever you are, an actual verified laboratory report that can be considered proof that you yourself use the test and you yourself got a negative."}, {"time": 2996, "text": "So the tools are out here if we want to use them at scale."}, {"time": 2996, "text": "And in fact, the CDC uses eMed now to enable people to come back into the United States through an antigen test."}, {"time": 3003, "text": "So before you get on your flight, you're sitting in the airport in Heathrow or wherever you are, you can get on your computer, use your eMed test, and you get the negative and CDC will accept that, TSA will accept you to come back into the US with a rapid antigen test that you did without anyone else watching, except for this proctor on your phone."}, {"time": 3024, "text": "Super simple."}, {"time": 3027, "text": "How much private information is being collected?"}, {"time": 3027, "text": "So like this, you know, people have in the United States, the American way, they have a hesitancy on the overreach of government in things like vaccine passports, like using any mechanism of verification that's controlled by government can lead to overreach by said government."}, {"time": 3050, "text": "So there's a concern of that."}, {"time": 3050, "text": "Do you see there a way of achieving testing that's verified but does not violate people's privacy or sense of freedom?"}, {"time": 3066, "text": "The way that right now in the United States, they're requesting that these tests get, that the results get delivered to public health agencies."}, {"time": 3073, "text": "But I've long held that while that's ideal, it should never be the thing that holds up somebody being allowed to know their own status."}, {"time": 3085, "text": "But if you are going to work and you have to let your boss or your manager, whomever, know that you were negative that day, or if you're going to school, I think it's going to be hard to maintain complete privacy in that situation because they need to know your name."}, {"time": 3098, "text": "But sure, I mean, could you cut off the public health reporting?"}, {"time": 3106, "text": "Yes, you could."}, {"time": 3106, "text": "But I worry, I mean, can you opt out?"}, {"time": 3111, "text": "Maybe you could opt out."}, {"time": 3111, "text": "That should be a feature."}, {"time": 3111, "text": "I want to opt out of the public health reporting because for whatever reason, otherwise I'm not going to do the test."}, {"time": 3116, "text": "But that means that, okay, then you're not going to go to work."}, {"time": 3123, "text": "So right now there's this serious tension and I am very uncomfortable with the idea that we force anyone to do anything."}, {"time": 3128, "text": "But there is a tension between these two things for sure."}, {"time": 3134, "text": "And how do you balance that during a public health emergency?"}, {"time": 3141, "text": "I think first and foremost, let people, everyone has a right to know their status."}, {"time": 3145, "text": "The fact that we have made it hard for people to know their status on their terms, I think is a travesty."}, {"time": 3148, "text": "I mean, it's just so terrible that we have prioritized us knowing at the expense of you."}, {"time": 3154, "text": "Essentially what public health has long said during this pandemic is, if I'm public health, if I can't know, then you can't know your status."}, {"time": 3168, "text": "That's not the right way to look at public health."}, {"time": 3168, "text": "We need to engage the public."}, {"time": 3174, "text": "And if some of them don't want to participate in the public health part, but want to know their status, by default, they are participating in public health, whether they know it or not, because they're not going to go get their mom sick by mistake."}, {"time": 3183, "text": "At least most people wouldn't."}, {"time": 3187, "text": "And then also you can create systems where you can, individuals can form relationships based on their status without ever reporting it to a centralized place."}, {"time": 3201, "text": "So you can go to, I don't know, a local business owner might require that you show that you're negative, but that doesn't require reporting it."}, {"time": 3208, "text": "You can, like there might be basically like an ID that's only in possession, you are the only person in possession of that."}, {"time": 3222, "text": "So you literally show it, here's a test I took, it's negative and nobody else knows about that test."}, {"time": 3228, "text": "So that could very well be done, even through a company like eMed."}, {"time": 3228, "text": "I think, and I might be wrong here, I believe that they take the test result, and because they are considered a CLIA waived laboratory, like a digital laboratory, they report their results by law out to the public health agencies."}, {"time": 3247, "text": "But let's say there was something a little different."}, {"time": 3247, "text": "Let's say you were verifying an over the counter test, and it doesn't have to be a CLIA waive because it's over the counter, then you're not bound by CLIA rules."}, {"time": 3255, "text": "And you could create the same service, but that just doesn't report out to the public health agencies."}, {"time": 3261, "text": "It gives people the option to opt in or out of public health reporting."}, {"time": 3267, "text": "And I know that public health people get a little queasy when I talk about this, but as a public health person myself, I guess of course I would prefer that the data be available to evaluate to know where the cases are."}, {"time": 3281, "text": "But first and foremost, I want to make sure that the people using the test are going to use the test."}, {"time": 3285, "text": "And if that means that they're not reporting, and if that's the only way that they will use it is if it's not reported, then that's better than no test."}, {"time": 3298, "text": "Especially given that the central to the vaccine hesitancy is a distrust of authority and the distrust of government."}, {"time": 3305, "text": "So you're asking people to get tested and report their status to a centralized authority when they clearly do not trust that authority."}, {"time": 3322, "text": "It seems like a perfect solution to let people who are hesitant on the vaccine to get their own status and have full control of that information and opt in, provide that information if they wish to, but they have the full control of it and have the freedom to do that information what they want."}, {"time": 3337, "text": "I fully agree with that."}, {"time": 3337, "text": "I think we can have the verified services and we could have the privacy if you want it."}, {"time": 3343, "text": "If you need to go into a restaurant and there's a rule that you have to be a negative test, have it on your phone and only your phone."}, {"time": 3353, "text": "Like emails you the lab report, you have it."}, {"time": 3353, "text": "You can say, look, that's my name."}, {"time": 3359, "text": "I used it this morning."}, {"time": 3359, "text": "Negative."}, {"time": 3359, "text": "And in that case, you'd want something that just is there and is not going anywhere else."}, {"time": 3364, "text": "And I think that those services, I think they can exist."}, {"time": 3370, "text": "And it's a struggle because for those companies, they don't want to fall out of favor with the CDC or with the FDA."}, {"time": 3377, "text": "And so this is a big problem in our marketplace in general by having private companies who want to be the public health agents of this pandemic."}, {"time": 3384, "text": "We lose a lot of control because the companies ultimately have to do what's going to make them money so they survive and keep performing the service."}, {"time": 3398, "text": "It's really just such a hard problem."}, {"time": 3398, "text": "And this is why last time I was here, I'm guessing I was probably really pushing for the government to be producing these tests."}, {"time": 3405, "text": "I think I would have still been pushing for that."}, {"time": 3412, "text": "At this point, I've decided, okay, the government's clearly not going to do that."}, {"time": 3416, "text": "I've been thinking, I really want Elon Musk to produce the tests."}, {"time": 3416, "text": "I really am sort of serious that these tests are simple to make, but we've been using machines to make them that have been around for a long time."}, {"time": 3429, "text": "Scale is an issue right now, kind of."}, {"time": 3429, "text": "Really, it's the EUA process and getting the companies to be allowed to market in the US that's the issue."}, {"time": 3435, "text": "But let's just say scale is the issue."}, {"time": 3439, "text": "And one company wants to make 20 million tests a day."}, {"time": 3439, "text": "These aren't that hard."}, {"time": 3446, "text": "We should be able to do that."}, {"time": 3446, "text": "We just need a faster machine, a better machine, and a quicker one."}, {"time": 3451, "text": "And there's a few folks, like you mentioned, know how to solve that problem."}, {"time": 3451, "text": "I've had a lot of discussion with Tesla folks and know with people that used to work at Tesla, like Jim Keller, about how to make stuff much cheaper, much better."}, {"time": 3461, "text": "That's basically what Tesla is world class at."}, {"time": 3466, "text": "It's like, okay, does this thing have to cost $1,000?"}, {"time": 3466, "text": "No, it can cost $10."}, {"time": 3466, "text": "And let's figure out how to manufacture it."}, {"time": 3473, "text": "Those folks are like the best in the world at doing that."}, {"time": 3473, "text": "Okay, but what about this Biden action plan?"}, {"time": 3480, "text": "So it sounds like the guy agrees with you, vaccinate or test."}, {"time": 3480, "text": "So I think given that choice, a lot of people go test in America because there's like a division, it seems like."}, {"time": 3495, "text": "So is this just politics?"}, {"time": 3495, "text": "Is this just words?"}, {"time": 3495, "text": "Or do you think this is actually going to lead to something?"}, {"time": 3502, "text": "And maybe can you explain what the action plan is?"}, {"time": 3507, "text": "So there's a number of pillars to the action plan."}, {"time": 3507, "text": "The two that I've been most focused on, I mean, some of them are we want to get everyone vaccinated."}, {"time": 3514, "text": "We want to get everyone vaccinated."}, {"time": 3517, "text": "All these things."}, {"time": 3517, "text": "And one pillar is saying any company in the United States that has more than 100 employees is now required to ensure that any unvaccinated individuals in their workforce test weekly."}, {"time": 3535, "text": "Another pillar is that the president's going to reduce the cost of PCR tests."}, {"time": 3544, "text": "By 35%, which is pretty moderate reduction."}, {"time": 3544, "text": "And is going to reduce the cost of antigen tests and scale them up and make 280 million tests and put $2 billion into it."}, {"time": 3562, "text": "So those are the two that I found most intriguing for the kind of mission that I've been on, which is to just educate people around, hey, we have really, really powerful products that we can educate people around."}, {"time": 3571, "text": "Hey, we have really, really powerful public health tools we have yet to deploy."}, {"time": 3579, "text": "The issue at hand though, is that now that the president has said vaccinate or test, there's a problem inherent in that."}, {"time": 3587, "text": "It's essentially to coerce people around vaccinated to get vaccinated."}, {"time": 3592, "text": "Because vaccinate or test doesn't make sense when the vaccinated people can transmit the virus just fine."}, {"time": 3596, "text": "It should be vaccinate and test."}, {"time": 3600, "text": "The problem that I have with that vaccinate or test idea is it's great if you want to use it as a coercive effort to get people vaccinated."}, {"time": 3605, "text": "I'm not going to wade into that argument."}, {"time": 3612, "text": "Do I agree with it or not?"}, {"time": 3612, "text": "I'm just not going to even put my words under."}, {"time": 3617, "text": "I disagree with it."}, {"time": 3617, "text": "Let me say, I disagree."}, {"time": 3617, "text": "As opposed to doing great science communication, this weird, people talking down to the populace as if they're children trying to trick them."}, {"time": 3631, "text": "Here, have some candy."}, {"time": 3631, "text": "Everyone with common sense."}, {"time": 3631, "text": "Somebody told me I was having a conversation."}, {"time": 3640, "text": "If the government is going to give you money to take the vaccine, people that were already hesitant about the vaccine are not going to trust whatever the heck you're doing."}, {"time": 3649, "text": "Don't trick people into taking the vaccine."}, {"time": 3649, "text": "Be honest and communicate transparently everything that's known about the vaccine."}, {"time": 3654, "text": "Communicate the data."}, {"time": 3654, "text": "Inspire people with transparency and real communication of all the uncertainty around it and all the difficult decisions of risk and all those kinds of things."}, {"time": 3670, "text": "As opposed to trying to trick them like children into taking the vaccine anyway."}, {"time": 3676, "text": "Well, I didn't have to say that."}, {"time": 3682, "text": "So there we go."}, {"time": 3682, "text": "But you're saying it should not be like vaccinate or test."}, {"time": 3682, "text": "That tradeoff does not make sense."}, {"time": 3688, "text": "By saying vaccinate or test is absolutely confusing because it implies for anyone who's thinking about it, it is implying."}, {"time": 3695, "text": "And I've seen this because I have business leaders call me, Fortune 500 business leaders who call me and say, what do I do?"}, {"time": 3704, "text": "I have 8,000 employees."}, {"time": 3704, "text": "Where am I going to get my tests?"}, {"time": 3704, "text": "And a lot of people are saying, they're calling this a pandemic of the unvaccinated."}, {"time": 3710, "text": "These types of divisive language doesn't help."}, {"time": 3718, "text": "This isn't a pandemic of the unvaccinated."}, {"time": 3718, "text": "This is a pandemic of a fucking virus."}, {"time": 3722, "text": "Don't ever put it on the unvaccinated who frankly are just scared."}, {"time": 3722, "text": "They don't know who to trust."}, {"time": 3729, "text": "And we haven't given them a lot of reason to trust public health, to be frank."}, {"time": 3737, "text": "I mean, now that you've opened the door, I'll just say my piece."}, {"time": 3737, "text": "Absolutely, we need to be the most honest we can with all of this."}, {"time": 3742, "text": "This is confusing language to say vaccinate or test."}, {"time": 3742, "text": "We need to be very upfront and say, look, vaccines aren't stopping transmission very well."}, {"time": 3750, "text": "Unfortunately, this is the world we have."}, {"time": 3757, "text": "We have Delta."}, {"time": 3757, "text": "We're going to have new mutants."}, {"time": 3757, "text": "We have a vaccine that wanes somewhat over time."}, {"time": 3763, "text": "This is biology."}, {"time": 3763, "text": "This is just what it is."}, {"time": 3763, "text": "And then we say, but the vaccines are really protective for your personal health."}, {"time": 3770, "text": "They're going to keep you out of the hospital."}, {"time": 3775, "text": "This is what you should care about as an individual."}, {"time": 3775, "text": "And as a population, we need to figure out, okay, we have to stop transmission if that's our goal."}, {"time": 3785, "text": "So we should use the tools that are going to stop transmission if that's our goal."}, {"time": 3785, "text": "And saying vaccinate or test, if our goal is to actually stop transmission, that's confusing because vaccines are not stopping it."}, {"time": 3795, "text": "There may be mildly lowering the risk of transmission."}, {"time": 3795, "text": "So I'm just not a fan of that language."}, {"time": 3802, "text": "I think we should be being very, very clear, like you said, and upfront about what are the limitations of the vaccine and of the test."}, {"time": 3806, "text": "And we should be very clear that it can only help."}, {"time": 3814, "text": "The American public in aggregate is extremely intelligent."}, {"time": 3814, "text": "They will figure out when you say that vaccine breakthrough cases are rare, and then they start seeing story after story of whole parties of people who are vaccinated have outbreaks."}, {"time": 3827, "text": "And everyone knows more people now who are having breakthrough cases than they knew who had regular cases before the vaccine."}, {"time": 3837, "text": "People start to wonder, hmm, well, this is weird."}, {"time": 3837, "text": "They say that the vaccines are working, breakthrough cases are rare."}, {"time": 3842, "text": "Maybe the whole vaccine program is failing entirely."}, {"time": 3846, "text": "And so it ends up shooting ourselves in the foot if we try to create false expectations, because we think it's going to be beneficial for one thing when it's not for the other."}, {"time": 3856, "text": "And so to get back to the action plan, vaccinate or test, I think, and the increase in rapid tests, I do think it was a bold move."}, {"time": 3865, "text": "I would say that it was the most prominent sort of display, encouraging display of the fact that rapid tests are indeed effective public health tools."}, {"time": 3880, "text": "My real concern now is that 280 million tests, that's like less than one per person per year in the United States."}, {"time": 3886, "text": "So that's not the way that he said and delivered it."}, {"time": 3886, "text": "And what most people think of when they hear the word 280 million, you don't usually put a lot of thought into, what does that number mean?"}, {"time": 3896, "text": "It sounds a big number."}, {"time": 3896, "text": "Most people are now going to be expecting that these tests are actually going to be staying in stock on the shelves at CVS and Walgreens and Amazon or whatever."}, {"time": 3906, "text": "So that's crisis number one is like, now the expectation is set for having rapid tests, but they're not going to scale that well."}, {"time": 3913, "text": "We won't have them."}, {"time": 3913, "text": "And then there's vaccinate or test."}, {"time": 3918, "text": "And that's going to bring millions and millions of people who are not currently testing to have to start testing."}, {"time": 3923, "text": "So that's going to overwhelm our PCR labs."}, {"time": 3923, "text": "And it's going to create five day delays again with PCR, if not longer, because we'll have backlogs."}, {"time": 3928, "text": "And so the only real solution to this is to just scale up the tests that are actually scalable."}, {"time": 3934, "text": "And that's the simple rapid tests."}, {"time": 3939, "text": "And it's not even to scale them up through production and manufacturing here."}, {"time": 3944, "text": "It's to open the doors so that the companies that already exist here and can scale are allowed to do it and to bring in the international market."}, {"time": 3950, "text": "Some of the biggest diagnostic companies in the world are not selling their millions and millions and millions of tests in the billions of tests in the United States because they don't want to play the game that the FDA is currently requiring of them."}, {"time": 3967, "text": "So we have an opportunity and I am very encouraged that the president actually did put these into the action plan."}, {"time": 3972, "text": "And I do want to say for the record that I'm supportive of it in principle."}, {"time": 3972, "text": "But I think now we actually are in the time where it has been set and we have to deal with the crisis before it happens."}, {"time": 3985, "text": "Otherwise, there could be some real political points taken off."}, {"time": 3985, "text": "I do worry that the president, if he doesn't pull through with this and really make the tests available and we end up getting into this other test crisis this fall, there could be political consequences to that."}, {"time": 4001, "text": "And the reason is these rapid tests are so personal, they become emotional almost."}, {"time": 4006, "text": "They give people that empowerment that I was talking about earlier."}, {"time": 4006, "text": "And when people can't get that because the shelves are out of stock, they actually feel frustrated and then that converts into anger and blame."}, {"time": 4017, "text": "And so I do think that we have to be really smart about making a policy like this and then ensuring that we can carry through with what the average American is actually expecting."}, {"time": 4029, "text": "And speaking of politics, one of the great things about testing, maybe you can correct me, but from my sense, it's one of the only solutions to COVID that has not yet been politicized."}, {"time": 4043, "text": "So masks and vaccines, whether you like it or not, have been heavily politicized where there's literally a red blue split on the use of those or like proud use, effective use of those tools."}, {"time": 4062, "text": "And it seems like everybody I talked to about testing, everybody's on board, red or blue."}, {"time": 4067, "text": "They are, which is why I am particularly concerned about the vaccinate or test policy."}, {"time": 4073, "text": "Because all of a sudden we just politicized it."}, {"time": 4073, "text": "We just brought it with this thing that was fully bipartisan, really bipartisan."}, {"time": 4076, "text": "I mean, I've talked to the fully, the really right side of Congress and the super liberal side of Congress, the Senate, the same politicians, governors everywhere in this country have asked me for support around these rapid tests because it's just, you can have it reported or not."}, {"time": 4094, "text": "You can have it in the home, in the privacy of your own home or not, or you do it at school."}, {"time": 4104, "text": "And these tools are just so powerful to identify infectious people."}, {"time": 4104, "text": "They didn't have to be politicized."}, {"time": 4109, "text": "They still don't."}, {"time": 4109, "text": "I don't think that the action plan went so far that it's going to politicize them."}, {"time": 4114, "text": "But I do think already it's starting to conjure up emotion saying, well, now I have to get tested."}, {"time": 4119, "text": "The have to part, right."}, {"time": 4119, "text": "And that is where we go wrong."}, {"time": 4119, "text": "I have to get we go wrong."}, {"time": 4126, "text": "I have to get tested or vaccinated."}, {"time": 4126, "text": "I am independent, whatever."}, {"time": 4126, "text": "And I do worry that this thing that was purely bipartisan, that we could have just scaled up months ago."}, {"time": 4142, "text": "People would have, we could have delivered it to every household."}, {"time": 4142, "text": "Didn't even have to ask people to request it."}, {"time": 4145, "text": "Just delivered packages to every home in America by now easily."}, {"time": 4152, "text": "And if we were smart about it, you know, we could have done it."}, {"time": 4152, "text": "The most unpleasant thing about COVID is the uncertainty."}, {"time": 4157, "text": "And that's what leads to fear on both the vaccine hesitant, is the uncertainty about the vaccine and people who have taken the vaccine, the uncertainty around like, am I in danger walking around?"}, {"time": 4172, "text": "Can I go, can I walk down the hall?"}, {"time": 4172, "text": "Like this fear of the world around you."}, {"time": 4178, "text": "And I think testing allows you to remove a lot of that uncertainty."}, {"time": 4178, "text": "Like you, you gain back confidence that you can operate in this world and not get infected and you become like a nicer person."}, {"time": 4190, "text": "I find myself every time I get tested, I become a nicer person to others because I know I'm not putting them in danger."}, {"time": 4196, "text": "I'm not putting people in danger."}, {"time": 4200, "text": "It's a, it's a heavy burden to carry to worry."}, {"time": 4200, "text": "Like I was out last night, but I do want to go see my mom today, you know, like, am I infectious?"}, {"time": 4207, "text": "And this has created massive anxiety and I can't, I completely agree that it is, it's a relieving feeling and, and it's an amazing feeling to be in a room when, and I did this in the middle of the pandemic when everyone was supposed to be wearing a mask indoors and everyone rapid tests, you know, and I said, everyone should rapid test before you walk into this room."}, {"time": 4234, "text": "And it was a wonderful experiment because everyone was just so relaxed."}, {"time": 4240, "text": "You know, the other, the alternative is everyone, nobody tests and everyone wears a mask."}, {"time": 4246, "text": "You have a mask that maybe gives you 20% maybe protection during, if you're all in the same room together, if that, or you have a rapid test program where everyone rapid test before, and that gives you like 95% to a hundred percent protection, not a hundred percent, but close."}, {"time": 4264, "text": "And all of a sudden that allows everyone to take a big sigh and be like, wow, this is the first time I've seen people without masks indoors in a long time."}, {"time": 4270, "text": "And I feel pretty good."}, {"time": 4275, "text": "And restaurants, like restaurants are scary right now because you just don't know who might be infectious and nobody's masked."}, {"time": 4280, "text": "And like, wouldn't it be great to just go into a restaurant where you know that everyone just tested negative that day?"}, {"time": 4287, "text": "It just really reduces anxiety."}, {"time": 4292, "text": "It makes individuals feel empowered."}, {"time": 4292, "text": "And I mean, at the end of the day, COVID and our response to COVID is a, it's truly an information problem."}, {"time": 4299, "text": "You know, why do we quarantine anyone?"}, {"time": 4305, "text": "Why did we ever close anything down?"}, {"time": 4305, "text": "We didn't close things down because everyone is positive."}, {"time": 4309, "text": "We closed things down because we didn't know if anyone was positive."}, {"time": 4309, "text": "We quarantine a whole classroom of kids, not because they're all positive, but because we don't know if one of them are positive."}, {"time": 4321, "text": "And so we just quarantine everyone when there's a positive in the case, in the, in the classroom, like one day, we'll then ask the whole classroom not to come to school for 10 days."}, {"time": 4329, "text": "That's not a biological problem."}, {"time": 4329, "text": "That's an information problem."}, {"time": 4329, "text": "And the crazy thing is we have the tool to solve that information problem."}, {"time": 4337, "text": "It's literally our eyes on the virus."}, {"time": 4337, "text": "It's how we see this virus."}, {"time": 4343, "text": "And if everyone glowed green, when they were infectious, we would have never had to close down anyone, any society."}, {"time": 4347, "text": "And we would have never had the outbreaks because we would have been able to stay away from the green people, you know?"}, {"time": 4351, "text": "And yeah, I like what you said, the quarantine is an information problem."}, {"time": 4356, "text": "That's absolutely right."}, {"time": 4356, "text": "What, is there something you can say to what people can do, like listening to this, individuals?"}, {"time": 4360, "text": "Do you just complain like loudly?"}, {"time": 4368, "text": "Like, why can't we do this?"}, {"time": 4368, "text": "Can you speak with your money somehow?"}, {"time": 4368, "text": "What, what can people do to help?"}, {"time": 4375, "text": "God, it's, it's amazing to think you're asking me this question and this video will go out to, you know, the web and all the people that watch you."}, {"time": 4381, "text": "And last year in July, maybe something like that, June, I forget exactly when it was, I was on Twiv this week in virology."}, {"time": 4394, "text": "Shout out to Twiv."}, {"time": 4394, "text": "Those guys are awesome."}, {"time": 4394, "text": "They are awesome."}, {"time": 4394, "text": "I love, I love Twiv."}, {"time": 4399, "text": "And they asked me the exact same question towards the end."}, {"time": 4399, "text": "They said, this makes so much sense."}, {"time": 4399, "text": "You know, why wouldn't we do this?"}, {"time": 4403, "text": "What can people do?"}, {"time": 4403, "text": "And so I said, oh, you know, just send me an email, like write to me."}, {"time": 4409, "text": "I'm sure you could find my email somewhere online and get in touch and I will, you know, and we can try to figure out how to make something happen."}, {"time": 4415, "text": "Bad idea."}, {"time": 4421, "text": "Very smart."}, {"time": 4423, "text": "Way too many emails."}, {"time": 4423, "text": "I didn't, I feel bad because I didn't end up getting back to anyone because I just got inundated."}, {"time": 4427, "text": "But it did lead to the development of rapidtest.org where we did automate the process of writing letters to congressional members and elected representatives."}, {"time": 4439, "text": "So that helps."}, {"time": 4439, "text": "Fast forward to today."}, {"time": 4439, "text": "What can, what can people do?"}, {"time": 4439, "text": "Like, what can the average person at this point do?"}, {"time": 4447, "text": "We have tried everything."}, {"time": 4447, "text": "The FDA is immutable on this."}, {"time": 4453, "text": "They will not change and we shouldn't ask them to change because they have decided that this is how they regulate medical devices and they're going to stick to it."}, {"time": 4459, "text": "So what we need to do, what we need to do, and maybe this is something to do, is get, if you know people who have sway over politicians, lobbyists, whatever it might be, let people know to request that the president, literally the president of the United States, uses executive powers to just do a simple, something as simple as designating these powerful public health tools as public health tools."}, {"time": 4490, "text": "Allow the CDC and the NIH or whomever it must be or academic centers of excellence designated by the CDC to evaluate the tests in a very fast fashion with the appropriate metrics that these tests need to achieve for public health."}, {"time": 4505, "text": "And within two days we can have 10 new tests authorized."}, {"time": 4512, "text": "You know, this doesn't have to be a six to 12 month endeavor."}, {"time": 4512, "text": "This could be a two day endeavor."}, {"time": 4516, "text": "We actually did it."}, {"time": 4516, "text": "I judged the rapid test XPRIZE and it went great."}, {"time": 4516, "text": "We actually got incredible metrics about how well does each test work and no clinical trials, you know, just a couple days worth of work in the lab and boom."}, {"time": 4528, "text": "And if we actually systematize it, it would be an hour or so in the lab."}, {"time": 4533, "text": "You know, so simple."}, {"time": 4533, "text": "I mean, I don't know how to really impact change."}, {"time": 4539, "text": "Thankfully, you know, I have a platform and I've been able to start talking with people who are very close to the President and the White House."}, {"time": 4549, "text": "And I do think that some change is finally happening because the silver bullet of the vaccine has not panned out to be the silver bullet."}, {"time": 4557, "text": "So now we got to now I think we're moving from a country that was a vaccine only approach to finally recognizing at the highest levels that there's other tools."}, {"time": 4568, "text": "Do you think it's possible to reopen fully without solving the testing problem completely?"}, {"time": 4575, "text": "Like, do you think this vaccine approach will get us to reopen fully?"}, {"time": 4582, "text": "Yeah, I think over time, though."}, {"time": 4582, "text": "I mean, if we a lot of people ask me, like, what's what's like happening?"}, {"time": 4589, "text": "Like, what's the end game here?"}, {"time": 4589, "text": "Like, where does this end?"}, {"time": 4589, "text": "And it's actually not a mystery."}, {"time": 4596, "text": "The end game is we will grow out of this virus."}, {"time": 4596, "text": "And by that, I mean, you and I and most people who are watching this are adults, right?"}, {"time": 4606, "text": "Adults don't like to get infected with a virus for the very first time as adults."}, {"time": 4613, "text": "Babies are OK with it."}, {"time": 4613, "text": "And so what we have to do to understand how we're getting out of this virus is to look at babies like at newborns and say, OK, how does a baby get out of their high risk time period?"}, {"time": 4626, "text": "They get exposed."}, {"time": 4626, "text": "They get exposed multiple times or vaccinated, of course."}, {"time": 4632, "text": "And eventually they get exposed enough that they build up this nice cushion of immunity that's sufficiently diverse that they can battle whatever gets thrown at them because they've seen it all already."}, {"time": 4642, "text": "But one exposure doesn't do it."}, {"time": 4642, "text": "I mean, over the course of the first few years of life, kids get exposed to coronaviruses tons of times, lots of different viruses they get."}, {"time": 4653, "text": "So unfortunately, what's happening with us, why this is so bad for us, is that as we're adults, we don't regenerate tissue very well."}, {"time": 4663, "text": "We have like overabundant inflammatory response."}, {"time": 4663, "text": "We have all these problems that when we get an infection for the first time, it sucks."}, {"time": 4667, "text": "It harms us."}, {"time": 4667, "text": "It causes us problems."}, {"time": 4667, "text": "But over time, just like a baby, we're going to start building up our immunity through vaccines and exposures."}, {"time": 4678, "text": "And I hate to say it, but tons of people are getting exposed to Delta right now who don't know it."}, {"time": 4683, "text": "And if you're vaccinated, you don't know it, is my point there."}, {"time": 4683, "text": "And at the end of the day, this is actually, I do not want this to be misconstrued as like saying, go get infected."}, {"time": 4698, "text": "But the fact that people are getting infected will add to our level of protection later on."}, {"time": 4703, "text": "And so... Yeah, but the question is how long that whole process takes."}, {"time": 4703, "text": "I think, you know, my guess is probably by the end of next year, early 2023, we will probably start looking at this as though it is not a particularly dangerous virus for most people."}, {"time": 4714, "text": "The elderly though, it will still be, but that's because their immunity... Variants and stuff."}, {"time": 4719, "text": "And I've heard other people say the statement you just said a year ago about the spring, right?"}, {"time": 4723, "text": "Well, that probably was not wise."}, {"time": 4730, "text": "Well, I mean, it's because the intuition is like, okay, now that there's a vaccine, you're either going to take the vaccine or get infected and then there'll be herd immunity over, like it'll be very quick."}, {"time": 4741, "text": "So, you know, that's the intuition, but it seems like that's not happening."}, {"time": 4749, "text": "It seems like we're in this constant state of fear mongering for different reasons."}, {"time": 4756, "text": "It's almost like the virus got deeply integrated, not into just our biology, but in the game of politics and in the fear mongering around the news because the virus now started being together with the vaccine and the masks and it started getting integrated into the division and that's so effective at monetizing social media, for example."}, {"time": 4779, "text": "And so it's like, all right, so how do you get out of that?"}, {"time": 4787, "text": "Because you can always kind of present certain kinds of numbers about number of cases or how full hospitals are and start making claims about that we're still, this is as bad as it's ever been, those kinds of statements."}, {"time": 4801, "text": "And so I'm not sure exactly what the way out is except the same way out as it was originally, which is testing is information."}, {"time": 4815, "text": "And I think we can do that."}, {"time": 4815, "text": "We can keep outbreaks suppressed with testing because it's information."}, {"time": 4821, "text": "Like people keep thinking of tests as being medical things."}, {"time": 4821, "text": "They're not, they're information."}, {"time": 4824, "text": "It can allow us to control things."}, {"time": 4824, "text": "Just like we drive down a road and we look at the cars and we don't hit other cars because we have the information that they're in the lane next to us and they're moving over."}, {"time": 4835, "text": "That's just information."}, {"time": 4839, "text": "Like you said, glow green."}, {"time": 4839, "text": "The problem with the virus, you don't see."}, {"time": 4839, "text": "You're walking around and everybody is a potential infectious creature."}, {"time": 4845, "text": "And so if you see the world as a potential for infection, you're going to be terrified of that."}, {"time": 4856, "text": "And that is what has happened."}, {"time": 4856, "text": "And that's why I've been pushing so hard for these tests because they can allow people, if you use them at a community level, you can have enough people know that they're positive, enough people are good people that they won't go out and infect others."}, {"time": 4870, "text": "And the other great thing about them is again, a 10 day isolation period, especially for a vaccinated person, but in either case, is also an information problem."}, {"time": 4881, "text": "We don't have to isolate for 10 days if we're infected."}, {"time": 4881, "text": "What if we're only infectious for two, especially if we're vaccinated?"}, {"time": 4886, "text": "Why are we telling people the only reason the CDC ever and the WHO ever suggested a 10 day isolation or a 14 day quarantine is because we didn't know when people stopped being infectious."}, {"time": 4898, "text": "There's actually some people stay infectious for 14 days."}, {"time": 4903, "text": "But there's a lot of people who stay infectious for like four."}, {"time": 4903, "text": "And that's a whole nother week that we're asking people to isolate."}, {"time": 4908, "text": "People would probably be much more likely to comply if they only had to isolate as long as they wake up each morning and see two lines, because you're actually seeing it for your own two eyes."}, {"time": 4918, "text": "You're being empowered to make your own decision."}, {"time": 4922, "text": "You're not being told you need to isolate for 10 days and you're sitting there thinking, oh, I feel fine."}, {"time": 4926, "text": "There's a lot of asymptomatic spread."}, {"time": 4926, "text": "But if you see the two lines every day, then you actually get to, you're doing a little experiment for yourself to prove to yourself, today I'm still infectious."}, {"time": 4938, "text": "Let's hope it's tomorrow."}, {"time": 4938, "text": "Come on immune system."}, {"time": 4943, "text": "You can do this."}, {"time": 4943, "text": "And then you get to day four and boom, you start being negative."}, {"time": 4948, "text": "That's a much more tolerable thing because you are being able to make that decision based on true data that is empowering you."}, {"time": 4954, "text": "And it really does change, changes everything, because it's all fear and empowerment and these are empowering devices."}, {"time": 4966, "text": "Well, I wanted to have this conversation with you because obviously it's a great solution."}, {"time": 4970, "text": "Let's keep talking about it."}, {"time": 4970, "text": "People who will listen to this should, I guess, pressure local politicians, federal, national politicians."}, {"time": 4981, "text": "Write articles with the title like, Dear POTUS, please designate these as public health tools."}, {"time": 4988, "text": "Or just start talking about it in the media."}, {"time": 4988, "text": "Talk about it on social media, anywhere."}, {"time": 4992, "text": "Testing is a public health good."}, {"time": 4992, "text": "It should not be considered a medical device."}, {"time": 4998, "text": "I shouldn't have to pay to keep you safe."}, {"time": 4998, "text": "Testing should generally be free for that matter, subsidized by the government."}, {"time": 5006, "text": "These tools exist."}, {"time": 5006, "text": "We should all... And I think the more people that generate noise to just say, a public health test is a public health tool."}, {"time": 5020, "text": "You can't even argue with it."}, {"time": 5020, "text": "That's just true."}, {"time": 5023, "text": "I think if you talk about it enough, then certain people that have even a bigger platform, like Elon Musk, Sunder Prachai, those folks that have power to really do large scale manufacturing, also influence governments, will pay attention."}, {"time": 5038, "text": "Enough people talk about it."}, {"time": 5044, "text": "I think business leaders, like business leaders, obviously have so much power here."}, {"time": 5049, "text": "They pay the lobbyists who make things happen."}, {"time": 5053, "text": "There's people who pull levers that are not the politicians themselves."}, {"time": 5057, "text": "And I do think business leaders have so much to gain from these tools to keep their businesses safe, to not have to quarantine and lockdown."}, {"time": 5063, "text": "And I hope that all of them hear this message to say, let's ask the president or the people around the president to designate these as public health tools."}, {"time": 5074, "text": "Change the system."}, {"time": 5074, "text": "And if you can't change every aspect of the system, then figure out how to change the system enough so that you're doing everything in a safe way that is not endangering anyone, but it is only protective."}, {"time": 5088, "text": "You mentioned last time that you spent time as a Buddhist monk."}, {"time": 5094, "text": "We didn't spend much time talking about it."}, {"time": 5094, "text": "I just would love to talk to you about it a little bit more."}, {"time": 5100, "text": "Maybe by way of advice, how do you recommend people can integrate meditation into their lives?"}, {"time": 5108, "text": "Or how does one meditate?"}, {"time": 5114, "text": "I think for me, meditation was really an active effort, which sounds weird because most people think of meditation as the absence of activity."}, {"time": 5126, "text": "But just like anything, meditation requires exercise."}, {"time": 5135, "text": "In this case, it requires exercise and quieting your mind."}, {"time": 5135, "text": "And the whole... Well, there's a lot of different reasons people meditate."}, {"time": 5142, "text": "Most people watching this podcast or this show, what is this called?"}, {"time": 5150, "text": "Is this an interview?"}, {"time": 5150, "text": "I'm not even recording."}, {"time": 5150, "text": "This is just you and I talking."}, {"time": 5153, "text": "Most people are meditating to bring some balance and bring some sanity to their life and just be able to control their feelings and emotions a little bit more."}, {"time": 5166, "text": "And for that purpose, I think the best way to... What meditation is, if you can call it what you will, it's just getting some alone time, some time to think or not think."}, {"time": 5178, "text": "Whatever looks different for each person."}, {"time": 5178, "text": "For me, it was a very active effort to try to quiet my mind with the explicit intent to detach from things, from lots of things."}, {"time": 5194, "text": "And it's actually..."}, {"time": 5194, "text": "It sounds weird in our culture here to talk about detachment as a goal."}, {"time": 5201, "text": "Detachment from loved ones, detachment from objects is easy to reconcile."}, {"time": 5201, "text": "People understand that, yeah, I don't want to be too attached to my car or whatever."}, {"time": 5207, "text": "But detachment from a loved one is a very hard thing because we want to do the opposite usually."}, {"time": 5212, "text": "We want to love a loved one."}, {"time": 5216, "text": "But in a lot of Buddhist thought, it is those attachments that keep people in this cycle of rebirth."}, {"time": 5225, "text": "Now, I don't personally believe in rebirth in a Buddhist sense in that you actually get born multiple times."}, {"time": 5238, "text": "I think my personal feeling is we die and we're vanished."}, {"time": 5238, "text": "That's just me."}, {"time": 5245, "text": "But I still really found meditation to be extraordinarily powerful to feel control over a whole different part of my body that I never thought that it could be controlled, your mind."}, {"time": 5262, "text": "You close your eyes and most of us immediately start seeing blotches and we start thinking about things."}, {"time": 5270, "text": "And it's an amazing feeling to start getting to the point where you can actually quiet your mind and close your mind down so that you can just have peace, silence of your mind for a long period of time."}, {"time": 5288, "text": "And I loved it."}, {"time": 5288, "text": "But it's kind of a dangerous slope because you can kind of get caught up in it and really start going from, okay, I'm trying to quiet my mind to almost being addicted to quieting your mind."}, {"time": 5299, "text": "And it was a very active exercise every day, 15 hours a day to just practice quieting my mind."}, {"time": 5305, "text": "And eventually I could."}, {"time": 5305, "text": "And in Buddhism, there's a whole lot of stages that you go through too."}, {"time": 5313, "text": "Once you hit that point where you can quiet your mind, then there's other psychological things that happen."}, {"time": 5318, "text": "And eventually the end goal for a Buddhist monk who's spending their life meditating in the forest is to achieve nirvana, is to have an absence of any attachment to the point where you're not even attached to your own foot or your own leg."}, {"time": 5340, "text": "You can cut it off."}, {"time": 5340, "text": "So you don't even have an attachment to self, to ego?"}, {"time": 5340, "text": "Do you feel like a conscious being or no?"}, {"time": 5349, "text": "Well, I never attained it, but I didn't really."}, {"time": 5349, "text": "So the goal is you have to first look at it through the eyes of samsara, which is the cycle of rebirth, which is suffering."}, {"time": 5362, "text": "It's a cycle of suffering is how it's viewed."}, {"time": 5362, "text": "And the idea is like, if I really love this hat and then the hat gets lost, I'm sad."}, {"time": 5367, "text": "So that makes me suffer."}, {"time": 5374, "text": "And if I hate this hat and I see it, then it makes me sad or mad."}, {"time": 5374, "text": "And that is an emotion."}, {"time": 5380, "text": "But if I'm completely ambivalent about that hat, I don't care if it's there, I don't care if it gets lost, if it's shredded, then that invokes no emotional rise out of me, good or bad."}, {"time": 5392, "text": "And so the idea is to find the balance there where you are so detached from everything that you're not getting a rise, negative or positive."}, {"time": 5397, "text": "And this is really, it's really such a distinct thing in a relative to our normal lives here in America where we live for rises."}, {"time": 5413, "text": "You want happiness and joy."}, {"time": 5413, "text": "And then you also, nobody wants sadness, but when you come out of sadness, you feel happy."}, {"time": 5420, "text": "Either way it averages out."}, {"time": 5420, "text": "And if it doesn't average out, then you're in a bad spot."}, {"time": 5426, "text": "That would be things like major depressive disorder where you're truly not averaging out."}, {"time": 5431, "text": "But if you're living a pretty happy life, that's why there's no right or wrong."}, {"time": 5436, "text": "You can go up and down and you average out or you can just go that straight line."}, {"time": 5440, "text": "So this is not necessarily the Buddhist ideal is somehow obviously the ideal you should strive for, but the actual exercise of meditation that the Buddhist monks use seems like a great tool for becoming aware of your own mind."}, {"time": 5458, "text": "And that seems to be important for appreciating life."}, {"time": 5466, "text": "There's some kind of experiencing life on a deeper level."}, {"time": 5475, "text": "I mean, that's my personal opinion is yes."}, {"time": 5475, "text": "And that I think it, I don't meditate anymore."}, {"time": 5485, "text": "Back in the capitalist Western world where there's meetings."}, {"time": 5490, "text": "I mean, I stopped after I was a monk and then the tsunami hit and I lived in a refugee camp and that was the Indian Ocean tsunami in 2004."}, {"time": 5494, "text": "And it just really, it was really interesting in Sri Lanka."}, {"time": 5504, "text": "They wanted me, I asked, well, what can I do to help?"}, {"time": 5509, "text": "It was a horrible, horrible hell on earth experience in many ways."}, {"time": 5509, "text": "But when I said, what can I do to help?"}, {"time": 5517, "text": "The answer was, well, you could meditate."}, {"time": 5517, "text": "That's how, keep doing what you're doing."}, {"time": 5524, "text": "That's how we can get good karma."}, {"time": 5524, "text": "And to me, coming from Western roots, I just couldn't deal with that."}, {"time": 5531, "text": "I just said that it doesn't make sense to me."}, {"time": 5531, "text": "Why would I just sit and meditate when there's so much devastation happening here?"}, {"time": 5536, "text": "And so I kind of stopped meditating then and then never really recovered from that time in the refugee camp."}, {"time": 5542, "text": "But I do feel like I understand or like I am aware of a part of me that most people never get the privilege to be aware of."}, {"time": 5555, "text": "And that is a pretty profound feeling, I think, or just awareness to say, if I ever need to go back to that, I have the capacity to do that."}, {"time": 5565, "text": "And I do use it."}, {"time": 5565, "text": "I mean, I don't use it a lot, but I use it when I really need to, to try to settle myself, to actually calm myself, whether it's pain, physical or emotional pain."}, {"time": 5581, "text": "It is possible to make those things go away, but just like anything, it takes training."}, {"time": 5589, "text": "If you take yourself back to that place you were, Sam Harris talks about that through his meditation practice, he's able to escape the sense of free will and the sense of agency."}, {"time": 5605, "text": "You can get away from that."}, {"time": 5605, "text": "Do you ever think about consciousness and free will when you were meditating?"}, {"time": 5613, "text": "Like, did you get some deep insight about the nature of consciousness that you were somehow able to escape it through meditation or no?"}, {"time": 5626, "text": "I looked at it in a much more utilitarian way, I think."}, {"time": 5632, "text": "The sensation, like minimizing amount of thoughts in your mind and then beginning to really appreciate the sensation."}, {"time": 5636, "text": "You weren't writing a book on free will."}, {"time": 5641, "text": "I mean, maybe if I kept at it, there's a good chance that if the tsunami didn't happen, I might still be sitting there on the top of that mountain."}, {"time": 5650, "text": "If there's tsunamis, you see pain, you see, especially if you see cruelty and you're supposed to meditate through that, there's something in the human spirit that pushes us to want to help."}, {"time": 5664, "text": "If you see somebody who's suffering, to react to that seems like to help them as opposed to care less through meditation."}, {"time": 5670, "text": "Don't become attached to the suffering of others."}, {"time": 5676, "text": "I mean, that's, I do think that that's, you know, and they're two totally valid ways to live life."}, {"time": 5683, "text": "They are, generally, I think they're ingrained in us pretty early in society."}, {"time": 5690, "text": "And it's hard to escape."}, {"time": 5692, "text": "What about just in general, becoming detached from possessions, like minimalism in not having many things."}, {"time": 5700, "text": "So, the capitalist world kind of pushes you towards having possessions and deriving joy from more and more and better possessions."}, {"time": 5709, "text": "Have you returned back to the joys of that world or do you find yourself enjoying the minimalist life?"}, {"time": 5721, "text": "A little of both."}, {"time": 5721, "text": "I think I really don't like, I find things to be a burden, to be a massive burden."}, {"time": 5730, "text": "And to me, when you have a burden like that, you know, even if it's just knowing that there's like boxes in your basement of stuff, you know, whatever it might be, it makes it hard to focus."}, {"time": 5743, "text": "And so, I personally like, I mean, my ideal, like if I had a, my house, for example, would be to have like nothing on anything."}, {"time": 5752, "text": "And that to me is like peaceful."}, {"time": 5752, "text": "Some people find that to be not peaceful."}, {"time": 5761, "text": "For me, it's like, I love to have the idea that if needed, I could like pack up and move and not worry about anything."}, {"time": 5770, "text": "Do I actually have that in reality?"}, {"time": 5770, "text": "We're about to have a baby, you know, but it's like, I already see it, it's like stressful."}, {"time": 5779, "text": "There's like boxes of stuff showing up at the house, like bottles and clothes and all these little hats and whatnot."}, {"time": 5790, "text": "And I do have to like sometimes go into my meditation to just say like, this is okay."}, {"time": 5799, "text": "You know, like it's okay to have all of this stuff."}, {"time": 5799, "text": "It's not permanent, you know."}, {"time": 5799, "text": "And, but I do think that it's easy to get lost in it all."}, {"time": 5809, "text": "And it's important to remember given all that, like people who buy houses, you know, buy a home and buy a house and make a home out of it."}, {"time": 5814, "text": "And you start a family."}, {"time": 5820, "text": "It's easy to forget that even though you have all these responsibilities, you're still free."}, {"time": 5825, "text": "And like freedom takes work and it takes remembering, it takes meditation on it, but you're free."}, {"time": 5832, "text": "You're born free, you live free."}, {"time": 5832, "text": "I mean, depends of course which country, but in the United States, even with all the possessions, even with all the burdens of sort of credit and owing money and all those kinds of things, you can scale everything down and you're free."}, {"time": 5853, "text": "But ultimately the people you love, you love each other, it doesn't take much money to be happy together."}, {"time": 5860, "text": "And for me, I personally value that freedom of having the freedom to always pursue your happiness as opposed to being burdened by material possessions that, you know, yeah, that basically limit your ability to be happy because you're always paying off stuff."}, {"time": 5879, "text": "You always catch, you know, trying to match the neighbors that are always a little bit richer, that kind of pursuit."}, {"time": 5884, "text": "I think that pursuit is wonderful for innovation and for building cooler, better things."}, {"time": 5889, "text": "But on an individual level, I think you have to remember that, first of all, life is finite."}, {"time": 5895, "text": "And second of all, like your goal is not to get a bigger house."}, {"time": 5900, "text": "Your goal is to be just content and happy in the moment."}, {"time": 5904, "text": "I completely, completely agree with that."}, {"time": 5904, "text": "So in looking at our failure at scale to engineer, to manufacture, to deploy tests, how do you feel about our prospect as a human civilization?"}, {"time": 5922, "text": "So this pandemic, it is what it is."}, {"time": 5922, "text": "It hurt a lot of people, both it took lives, but it also hurt a lot of businesses and a lot of people economically."}, {"time": 5940, "text": "But there's very likely to be a much worse pandemic down the line."}, {"time": 5940, "text": "There might be other threats to human civilization."}, {"time": 5945, "text": "Are you nevertheless optimistic?"}, {"time": 5950, "text": "Oh, I don't think I'm optimistic about it at all, I think."}, {"time": 5954, "text": "What are you most worried about?"}, {"time": 5955, "text": "It's one of those things, it's so existential that I don't worry about it."}, {"time": 5955, "text": "But I do think, I mean, in the United States, for example, so you asked about the human civilization, but let's talk about like American society for a moment."}, {"time": 5967, "text": "I do think that we're probably seeing the end of a really interesting experiment, like the American experiment, and we're seeing its limitations."}, {"time": 5979, "text": "We're probably going to become another blip, like another power that's in the history books that like rose and collapsed."}, {"time": 5988, "text": "Probably that's where we'll go."}, {"time": 5988, "text": "In terms of civilization, I think we're demonstrating a pretty significant inability to recognize the danger, whether that's the pandemic or whether that's climate change."}, {"time": 6003, "text": "I think it's extraordinary that we are not taking these things seriously."}, {"time": 6013, "text": "And we're not acting with the urgency."}, {"time": 6013, "text": "And I mean, in some ways, climate change truly makes like this pandemic look like child's play in terms of like the destruction it has the potential to wreak."}, {"time": 6026, "text": "I tend to think if you just look at the progress of human history, that the people who do good in the world outpower the people that do bad in the world."}, {"time": 6041, "text": "So there's something about our minds that likes to focus on the negative, like on the destructive, because we're afraid of it."}, {"time": 6049, "text": "It's also, for some reason, more fun to watch destruction."}, {"time": 6056, "text": "But it seems like the people who build, who create solutions, who innovate, and who just put like both on the emotional level, so love out there and like on the actual engineering level, tools that make for higher quality of life."}, {"time": 6072, "text": "I think those win out if you look at human history."}, {"time": 6079, "text": "But the question is whether the negative stuff can sometimes peak to the level where everybody's just destroyed."}, {"time": 6084, "text": "But as long as that doesn't happen, I tend to believe that there'll be like a gradual, with some noise, a gradual improvement of quality of life in human civilization."}, {"time": 6097, "text": "I do think so, to a certain extent."}, {"time": 6097, "text": "But it's that what you said, like unless there's like some significant peak of bad, you know, the problem with bad is that it can happen like that, you know, good."}, {"time": 6110, "text": "You can't build a society overnight, but you sure can kill one."}, {"time": 6110, "text": "Like I just think about food crises and instability and just, I don't know."}, {"time": 6118, "text": "But I do hope that, I mean, I completely agree."}, {"time": 6118, "text": "I think we can engineer our way to a healthier, better world."}, {"time": 6123, "text": "Like I truly do."}, {"time": 6123, "text": "My concern is that the people who are doing that until very recently don't generally rule the world."}, {"time": 6134, "text": "Now, of course, we're seeing non elected leaders and, you know, people who run massive corporations essentially having as much or really more power than elected leaders, or than kings and queens and such."}, {"time": 6151, "text": "So how they choose to wield that power, you know, is an interesting choice."}, {"time": 6157, "text": "And I do hope that you're right in that over time, fear will drive companies to produce a better product or whatever, you know, something like over time, it's just like predator prey models."}]}]