[{"title": "Saagar Enjeti: Politics, History, and Power | Lex Fridman Podcast #167", "id": "grceJbuPUXI", "quotes": [{"time": 317, "text": "I think he worked at it."}, {"time": 319, "text": "But also, there is an innate quality."}, {"time": 321, "text": "I'm forgetting his name, his lifelong, Rudolf, the one who flew to Berlin in like 1940."}, {"time": 327, "text": "I forget his name, anyway."}, {"time": 329, "text": "So he helped Hitler write Mein Kampf."}, {"time": 331, "text": "And he was like slavishly devoted to him in prison."}, {"time": 335, "text": "This is 1925 or something like that."}, {"time": 338, "text": "And so you read that and you're like, well, how does he get this like crank wacko to basically believe he's like the second coming, help him write this book?"}, {"time": 346, "text": "I mean, literally, they live together in the prison cell and they wake up every day."}, {"time": 350, "text": "And as he was composing Mein Kampf and because of the Beer Hall Putsch and all that, had this like absolute ability to gather people around him."}, {"time": 359, "text": "I think his greatest skill was, is he was just a very good politician, truly."}, {"time": 363, "text": "I mean, if you look at his ability in order to read coalitional politics and then convince exactly the right people in order to follow him."}, {"time": 372, "text": "I think I heard you ask this once and I've thought about it a lot, which is like, who could have stopped Hitler in Germany?"}, {"time": 377, "text": "It's always like the ever present question."}, {"time": 379, "text": "Of course, like the whole baby Hitler thing."}, {"time": 381, "text": "Really the answer is Hindenburg."}, {"time": 382, "text": "Like Hindenburg was the person who could have stopped and had the immense standing within the German public."}, {"time": 387, "text": "The only real like war hero definitely was personally skeptical of fascism and Nazism."}, {"time": 394, "text": "And didn't like Hitler."}, {"time": 395, "text": "And didn't like him and he knew he was full of shit."}, {"time": 398, "text": "He was like, yeah, I think this guy is dangerous."}, {"time": 400, "text": "I think this guy could do a lot of damage to the Republic."}, {"time": 403, "text": "But he acceded basically to Hitler at the time."}, {"time": 406, "text": "And I think that he was one of the main people who could have done something about it."}, {"time": 410, "text": "And also he was able to convince the generals, the military."}, {"time": 413, "text": "I mean, that was very interesting."}, {"time": 416, "text": "And to convince Chamberlain and the other political leaders."}, {"time": 421, "text": "That's something I often think about because we're just reading books about these people."}, {"time": 426, "text": "I think about what like Jeffrey Epstein, for example."}, {"time": 429, "text": "Like evil people, not evil, but people have done evil things."}, {"time": 434, "text": "Let's not go to the Dan Carlin thing of what is evil."}, {"time": 439, "text": "People that do evil things, I wonder what they are like in a room because I know quite a lot of intelligent people that did not see the evil in Jeffrey Epstein and spend time with them."}, {"time": 455, "text": "And were not bothered by it."}, {"time": 457, "text": "In the same sense, Hitler, it seems like he was able to get, just even before he had power, because people get intoxicated by power and so on."}, {"time": 468, "text": "They want to be close to power."}, {"time": 469, "text": "But even before he had power, he was able to convince people."}, {"time": 473, "text": "And it's unclear, like is there something that's more than words?"}, {"time": 478, "text": "It's like the way you, I mean, people talk, tell stories about like this piercing look and whatever, all that kind of stuff."}, {"time": 486, "text": "I wonder if that's somehow a part of it."}, {"time": 490, "text": "Like that has to be the base floor of any of these charismatic leaders."}, {"time": 494, "text": "You have to be able to, in a room alone, be able to convince anybody of anything."}, {"time": 500, "text": "So I can tell you from my personal experience, one of the best educated lessons I got was when I got to meet Trump."}, {"time": 509, "text": "So I interviewed Trump four different times as a journalist, spent like two and a half hours with him in the Oval Office, not alone, but like me and one person and like the press secretary, and that was it."}, {"time": 520, "text": "So I actually got to observe him."}, {"time": 522, "text": "And as a guy who reads these types of books, and you think of Trump, obviously most people, what they see on television, in articles and more, but being able to observe it like one on one, I was closer to him than I am right now from you."}, {"time": 537, "text": "That was one of the most educational experiences I got because it's like you just said, the look, the leaning forward, the way he talks, the way he is a master at taking the question and answering exactly which party wants."}, {"time": 554, "text": "And then if you try and follow up, he's like, excuse me, you know, like he knows."}, {"time": 558, "text": "And then whenever you're talking, it's not that he's annoyed about getting interrupted."}, {"time": 562, "text": "If he realizes he's been mirandering and then you interrupt him, all good."}, {"time": 566, "text": "But if he's driving home a point, which he has to make sure appears in your transcript or whatever, it really was fascinating for me to look at."}, {"time": 576, "text": "And what was also crazy with Trump is I realized how much he was living in the moment."}, {"time": 581, "text": "So when I went to the Oval, I've read all these biographies and I walk in, I'm like, holy shit, you're like, I'm in the Oval Office."}, {"time": 590, "text": "Were you interviewing him in the Oval Office?"}, {"time": 592, "text": "In the Oval, every time, I was in the Oval Office."}, {"time": 593, "text": "You scared shitless?"}, {"time": 594, "text": "Well, I wasn't scared."}, {"time": 596, "text": "I was just, look, it's the Oval Office, right?"}, {"time": 599, "text": "I mean, I'm this nerd."}, {"time": 601, "text": "He was like this kid, I'm so, I will admit this here."}, {"time": 605, "text": "I printed out on my dad's label maker when I was like seven and I wrote the Oval Office on my bedroom."}, {"time": 610, "text": "So I was a huge nerd, obviously egomaniacal, even from seven."}, {"time": 614, "text": "But so for this, I mean, it was huge, right?"}, {"time": 616, "text": "I'm like this 25 year old kid."}, {"time": 618, "text": "And I walk in there and I see the couch, right?"}, {"time": 622, "text": "And I'm like, oh man, that's Kissinger."}, {"time": 625, "text": "That's where Kissinger and Nixon got on their knees."}, {"time": 628, "text": "And then you see over by the door and you're like, are the scuff marks still there from when Eisenhower used to play golf?"}, {"time": 633, "text": "You know, this is all running through my mind."}, {"time": 634, "text": "With Trump, none of it was there, none of it, right?"}, {"time": 636, "text": "So like, even the desk, I put my phone on the desk to record and I'm like, this is the fucking Resolute desk."}, {"time": 643, "text": "Like, I shouldn't put my phone on this thing, right?"}, {"time": 646, "text": "And I'm like HMS Resolute, you know, all the international."}, {"time": 649, "text": "And even for him, he doesn't think about any of it."}, {"time": 651, "text": "It was like amazing to me."}, {"time": 653, "text": "Like he had this portrait of Andrew Jackson right next to his, to the, I think from on the fireplace, like right here on the right."}, {"time": 659, "text": "And the most revealing question was when I was like, Mr. President, what are people gonna remember you for in a hundred years?"}, {"time": 665, "text": "And he was like, I don't know, like veteran's choice."}, {"time": 669, "text": "He like has a list in front of him of like his accomplishments, which is staff."}, {"time": 674, "text": "Yeah, well, I mean, that's what I wanted to know."}, {"time": 677, "text": "And he's like, veteran's choice."}, {"time": 678, "text": "And I remember looking at him being like, it's not gonna be veteran's choice."}, {"time": 682, "text": "I'd be like, I'm like, I'm looking at you, Donald Trump, the harbinger of something new."}, {"time": 687, "text": "We still don't know what the hell it is."}, {"time": 689, "text": "And so I realized with these guys and their charisma and more is that they don't think about themselves the way that we think about them."}, {"time": 697, "text": "And that was actually important to understand because a lot of people are like, Trump is playing all this chess."}, {"time": 701, "text": "I'm like, I assure you he's not."}, {"time": 703, "text": "Like he's truly, one time I was interviewing him and he had like a certificate that he had to sign or something on his desk."}, {"time": 709, "text": "He's like, it was like child almost."}, {"time": 711, "text": "Like he got distracted by, he's like, oh, what's this?"}, {"time": 713, "text": "You know, he's just like picking up and I was like, wow, like this, this is the guy."}, {"time": 717, "text": "Like this is what he is."}, {"time": 719, "text": "Well, I wonder if there was a different person because you were recording then offline at a party."}, {"time": 725, "text": "I can tell you."}, {"time": 726, "text": "Well, here's the thing though, because that's another part of it."}, {"time": 729, "text": "Because that two hours, I would say like half of that was not on the record."}, {"time": 733, "text": "So like, whenever he's off the record, he changes completely, right?"}, {"time": 737, "text": "I don't wanna like go into too much of it or whatever, but like he, I mean, he is so mindful of when that camera is on and when the mic is hot in terms of the language that he uses, what he's willing to admit, what he's willing to talk about, how he's willing to even appear in front of his staff."}, {"time": 757, "text": "I think the most revealing thing Trump ever did was there was this press conference, like right after he lost the, right after the midterm elections in 2018."}, {"time": 766, "text": "And one of the journalists was like, Mr. President, thank you for doing this press conference."}, {"time": 770, "text": "And he looks at him and he goes, it's called earned media, it's worth billions."}, {"time": 774, "text": "And he just like had so much disdain for him because he's like, I'm not doing this for you."}, {"time": 779, "text": "He's like, I'm doing this for me."}, {"time": 780, "text": "So he's really aware of the narrative of the story."}, {"time": 783, "text": "I mean, that the people have talked about that all comes from the tabloid media of the, from New York and so on."}, {"time": 789, "text": "He's a master of that."}, {"time": 790, "text": "But I've also heard stories of just in private, he's a really, I don't wanna overuse the word charismatic, but just like, he is a really interesting, almost like friendly, like a good person."}, {"time": 805, "text": "Like, that's what I heard."}, {"time": 808, "text": "I've heard actually surprising the same thing about Hillary Clinton."}, {"time": 812, "text": "And like."}, {"time": 813, "text": "That I can't tell you anything about."}, {"time": 815, "text": "But like the way they present themselves is perhaps very different than they are as human beings and one on one."}, {"time": 822, "text": "That's something, maybe that's just like a skill thing."}, {"time": 826, "text": "Maybe the way they present themselves in public is actually their, I mean, almost their real self."}, {"time": 835, "text": "And they're just really good in private, one on one to go into this mode of just being really intimate in some kind of human way."}, {"time": 843, "text": "I think that's part of it."}, {"time": 844, "text": "Because I noticed that with Trump, you know, he's like, it's almost like a tour guide."}, {"time": 848, "text": "It was very like, it's very crazy, right?"}, {"time": 851, "text": "Cause you're like, you're in the Oval."}, {"time": 852, "text": "I mean, it's his office."}, {"time": 853, "text": "And he's like, do you guys want anything?"}, {"time": 855, "text": "And he's like, you want a Diet Coke?"}, {"time": 856, "text": "Cause he drinks like all this Diet Coke."}, {"time": 860, "text": "And he's just like, you guys want a Diet Coke, right?"}, {"time": 863, "text": "And you're sitting there and you're like, the way he's able to like, like the last time I interviewed him, he wanted to do it outside."}, {"time": 873, "text": "Because he like, he's studied himself from all angles."}, {"time": 876, "text": "And he knows exactly how he looks on a camera and with which lighting."}, {"time": 879, "text": "And so we were supposed to interview him on camera in the Oval Office, which is actually rare."}, {"time": 883, "text": "Like you don't usually get that."}, {"time": 885, "text": "And they ended up moving it outside at the last minute."}, {"time": 888, "text": "And he came out and he's like, I picked this spot for you."}, {"time": 890, "text": "He's like, great lighting."}, {"time": 892, "text": "I was like, you are your own like lighting director."}, {"time": 896, "text": "The president, right?"}, {"time": 897, "text": "It's so funny."}, {"time": 898, "text": "But it's like you said, he's very charismatic and friendly."}, {"time": 904, "text": "I mean, you wouldn't know."}, {"time": 905, "text": "I mean, look, this is what I mean in terms of the dynamism of these people that gets lost."}, {"time": 910, "text": "And I think even he knows that."}, {"time": 912, "text": "Like, I don't think he would want that side of him."}, {"time": 914, "text": "That I see, you know, that you see in those off the record moments and more in order to come out because he's very keen about how exactly he presents to the public."}, {"time": 923, "text": "It's like, you know, even his presidential portrait, everybody usually smiles and he refused to smile."}, {"time": 927, "text": "He was like, I want to look like Winston Churchill."}, {"time": 929, "text": "You know, like even he knew that."}, {"time": 931, "text": "Do you think he believes that he, what he kind of implies that he is one of, if not the greatest president in American history?"}, {"time": 941, "text": "Like people kind of laugh at this, but there's quite, I mean, there's quite a lot of people, first of all, that make the argument that he's the greatest president in history."}, {"time": 950, "text": "Like I've heard this argument being made."}, {"time": 953, "text": "And I mean, I don't know what the, first of all, I don't care."}, {"time": 957, "text": "Like, you can't make an argument that anyone is the greatest."}, {"time": 962, "text": "That's just, that just, I come from a school of like being humble and modest and so on."}, {"time": 968, "text": "It's like, even Michael, you can't have that conversation."}, {"time": 971, "text": "Okay, so I like that he's humble enough to say like Abraham Lincoln or whatever."}, {"time": 977, "text": "Like, I don't know."}, {"time": 978, "text": "He says maybe Lincoln."}, {"time": 979, "text": "Remember that."}, {"time": 982, "text": "Do you think he actually believes that?"}, {"time": 984, "text": "Or is that something he understands will create news and also perhaps more importantly, piss off a large number of people?"}, {"time": 995, "text": "Is he almost like a musician masterfully playing the emotions of the public?"}, {"time": 1001, "text": "Or does he, or, and does he believe when he looks in the mirror, I'm one of the greatest men in history?"}, {"time": 1009, "text": "Combination of all three."}, {"time": 1011, "text": "I do think he believes it."}, {"time": 1012, "text": "And for the reason why is I don't think he knows that much about US history."}, {"time": 1015, "text": "I really mean that."}, {"time": 1016, "text": "Like, and that's what I meant whenever I was in there and I realized he was just living in the moment."}, {"time": 1021, "text": "I don't think he knew all that much about why."}, {"time": 1023, "text": "I mean, this is why he was elected in many ways, right?"}, {"time": 1026, "text": "So I'm not saying this is an orbit, like I'm not making a judgment on this."}, {"time": 1030, "text": "I'm just saying, I do think in his mind, he does think he was one of the best presidents in American history largely because, and I encountered this with a lot of people who work for him, which is that they didn't really know all that much kind of about what came before and all that."}, {"time": 1045, "text": "And it's not necessarily to hold it against them because for in many ways, that's what they were elected to do or elected to be in many ways."}, {"time": 1052, "text": "It's an interesting question whether knowing history, being a student of history is productive or counterproductive."}, {"time": 1060, "text": "I tend to assume I really respect people who are deeply like well read in history, like presidents that are almost like history nerds."}, {"time": 1071, "text": "I admire that."}, {"time": 1073, "text": "But maybe that gets in the way of governance."}, {"time": 1077, "text": "It's not, I'm just sort of playing devil's advocate to my own beliefs, but it's possible that focusing on the moment and the issues and letting history, it's like first principles thinking, forget the lessons of the past and just focus on common sense reasoning through the problems of today."}, {"time": 1096, "text": "Yeah, it's really hard question."}, {"time": 1098, "text": "In terms of the modern era, I mean, Obama was a student of history."}, {"time": 1123, "text": "So in that way, I was a little pissed off because I'd be like, no, that actually like, you're comparing apples to oranges and all that."}, {"time": 1130, "text": "But if you look at Roosevelt, Teddy Roosevelt in particular, this was, I mean, a voracious reader, not of just American history, all history."}, {"time": 1139, "text": "That guy's just such a badass."}, {"time": 1143, "text": "The only president who willed himself to greatness."}, {"time": 1147, "text": "That's like the amazing thing about him."}, {"time": 1148, "text": "He wasn't tested by a crisis, right?"}, {"time": 1150, "text": "Like it wasn't, no, he didn't have a civil war."}, {"time": 1152, "text": "He didn't have World War II."}, {"time": 1153, "text": "He didn't have to found the country, literally, or like, didn't have to stave off that, or he didn't buy Louisiana Purchase, like all that."}, {"time": 1160, "text": "He literally came into a pretty static country and he could have just governed with, I mean, he was, the person who came before him was assassinated, like he easily could have coasted, but he literally willed the country into something more."}, {"time": 1177, "text": "And that's always why I've focused a lot on him too, because I'm like, that, in many ways, I wouldn't say it's easy to be great during crisis."}, {"time": 1184, "text": "I mean, like look at Trump, right?"}, {"time": 1186, "text": "But it can bring out the best within you, but it's a whole other level to bring out the best within yourself just for the sake of doing it."}, {"time": 1194, "text": "That's, I think is really interesting."}, {"time": 1196, "text": "The speeches were amazing."}, {"time": 1198, "text": "I'm also a sucker for great speeches because I tend to see the role of the president as in part like inspirer in chief, sort of to be able to, I mean, that's what great leaders do, like CEOs of companies and so on, establish a vision, a clear vision, and like hit that hard."}, {"time": 1219, "text": "But the way you establish the vision isn't just like, not to dig at Joe Biden, but like sleepy, boring statements."}, {"time": 1229, "text": "You have to sell those statements and you have to do it in a way where everybody's paying attention."}, {"time": 1235, "text": "Everybody's excited."}, {"time": 1236, "text": "And that, Teddy Roosevelt was definitely one of them."}, {"time": 1240, "text": "Obama was, I think, at least early on, I don't know, was incredible at that."}, {"time": 1247, "text": "It does feel that the modern political landscape makes it more difficult to be inspirational in a sense because everything becomes bickering and division."}, {"time": 1255, "text": "I do want to ask you about Trump."}, {"time": 1260, "text": "So you're now a successful podcaster."}, {"time": 1263, "text": "I've talked to Joe about Trump, Joe Rogan, and Joe's not interested in talking to Trump."}, {"time": 1271, "text": "It's just fascinating."}, {"time": 1272, "text": "I try to dig into like why."}, {"time": 1276, "text": "What would you interview Trump on like realignment, for example, and do you think it's possible to do a two, three hour conversation with him where you will get at something like human or you get at something, like when we're talking about the facade he puts forward, do you think you could get past that?"}, {"time": 1299, "text": "I look, I was a White House correspondent."}, {"time": 1301, "text": "I observed this man very closely."}, {"time": 1305, "text": "I interviewed him."}, {"time": 1306, "text": "I think if that mic is hot, he knows what he's doing."}, {"time": 1309, "text": "He just, he's done this too long, Lex."}, {"time": 1312, "text": "He just knows."}, {"time": 1312, "text": "But do you think he's a different human now after the election?"}, {"time": 1316, "text": "Yeah, not at all."}, {"time": 1319, "text": "I think he's been the same person since 1976."}, {"time": 1323, "text": "Like basically, 1976, I studied Trump a lot and I think he's basically been the core of who he is and elements of that."}, {"time": 1332, "text": "Ever since he built that, you know, the ice rink in Central Park and got that media attention, that was it."}, {"time": 1339, "text": "Yeah, he's a fascinating study."}, {"time": 1340, "text": "Still, I feel there's a hope in me that there would be a podcast like a Joe Rogan, like a long form podcast where it's something could be, you know, and you're actually a really good person to do that, where you can have a real conversation that looks back at the election and reveal something on us."}, {"time": 1360, "text": "But perhaps he's thinking about running again and so maybe he'll never let down that guard."}, {"time": 1366, "text": "But like, you know, I just love it when there's this switch in people where you start looking back at your life and wanting to tell stories."}, {"time": 1377, "text": "Like, you know, trying to extract wisdom and like realizing you're in this new phase of life where like the battles have all been fought, now you're this old, like former warrior and now you can tell the stories of that time."}, {"time": 1392, "text": "And it seems like Trump is still at it, like the young warrior he is, he's not in the mode of telling stories."}, {"time": 1398, "text": "You know what I got from Rogan?"}, {"time": 1399, "text": "He's the only president who didn't age well in office."}, {"time": 1403, "text": "Like, and this is what I mean, because he lives in the moment, like the job actually aged Obama, I mean, Bush, same thing, even Clinton."}, {"time": 1412, "text": "Clinton was like fat, it looked miserable by like 2000."}, {"time": 1416, "text": "HW, like, I mean, Reagan, famous, actually, yeah, pretty much everybody I think about, including John F. Kennedy, who got much sicker while in office."}, {"time": 1425, "text": "The job like weighs on you and makes you physically ill. Trump was, he's the only person who just didn't happen to."}, {"time": 1433, "text": "He almost gotten stronger and he was one of the most, like the climate, there's so many people attacking him, so much hatred, so much love and hatred."}, {"time": 1443, "text": "And it was just, I mean, it was whatever it was, it was quite masterful and a fascinating study."}, {"time": 1450, "text": "If we stick on Hitler for just a minute, what lessons do you take from that time?"}, {"time": 1460, "text": "Do you think it's a unique moment in human history, that World War II, I mean, both Stalin and Hitler, you know, is it something that's just an outlier in all of human history in terms of the atrocities, or is there lessons to be learned?"}, {"time": 1480, "text": "You mentioned offline that you're not just a student of the entirety of the history, but you also are fascinated by just different like policies and stuff."}, {"time": 1490, "text": "Like, what's the immigration policy?"}, {"time": 1492, "text": "What's the policy on science?"}, {"time": 1493, "text": "And... Third Reich in power, let me plug it, by Richard Evans, I think is what it was."}, {"time": 1498, "text": "Cause that actually will tell you, like what was it like to live under the Nazi regime without the war?"}, {"time": 1505, "text": "Yeah, it's a hard question in terms of the lessons that we can learn."}, {"time": 1508, "text": "Cause there's a lot, and it's actually been over, it's been over indexed almost."}, {"time": 1513, "text": "Everything comes back to Hitler in a conversation."}, {"time": 1515, "text": "So I kind of think of it within Mao, Stalin, and Hitler as, I don't wanna say payments for, but like the end point payment for the sins and the problems of the monarchical system that evolve within Europe."}, {"time": 1535, "text": "Basically like 1400 and more."}, {"time": 1538, "text": "I basically think that 1400, the wars between France, England, the balance of power, eventually World War I, and then serfdom within Russia, the Russian revolution that birthed Stalin."}, {"time": 1552, "text": "Same thing, the Kaiser and Imperial Germany and this like incredibly crazy system of balance of power in World War I."}, {"time": 1559, "text": "And then same thing within China in terms of the warring states and then the disintegration, the European, you know, this is how they think of it."}, {"time": 1568, "text": "Which is like the century of humiliation and they had to have something like this."}, {"time": 1572, "text": "I think of it, I try to think of it within the context of that."}, {"time": 1575, "text": "I don't wanna sound like an inevitablist, but I think of it as, I like to think about systems, especially here in DC, that's where I got into politics, which is that you have to understand systems of power and the incentives within systems and the disincentives, the downside risk of what you're creating because that is what leads and creates the behavior within that system."}, {"time": 1603, "text": "I was just talking to my girlfriend about this yesterday."}, {"time": 1605, "text": "It's kind of funny, like I read these, I'm obsessed with these books by Robert Caro, the biographies of Lyndon Johnson."}, {"time": 1612, "text": "He's written like 5,000 pages so far and it's still not done."}, {"time": 1615, "text": "Okay, so like these are like books I base my life on."}, {"time": 1619, "text": "And look, these are Washington and the story of the post New Deal era and forward."}, {"time": 1625, "text": "Not much has changed."}, {"time": 1626, "text": "Like the Senate is still the Senate."}, {"time": 1629, "text": "So many of the same problems with the Senate are still there in some cases."}, {"time": 1633, "text": "No, not anymore."}, {"time": 1634, "text": "But for a while, some of the people who were there with Johnson are actually still, one of them is the president of the United States, just a joke."}, {"time": 1641, "text": "And you think about also, same with the media relationship, right?"}, {"time": 1646, "text": "Like there's this media really, they may have come and gone."}, {"time": 1649, "text": "Like the people who were in the media and who were cozy with the administration officials, I mean, they just recreated themselves."}, {"time": 1657, "text": "It's like an ecosystem which doesn't change."}, {"time": 1661, "text": "And that's why I'm like, oh, it's not that was a specific time."}, {"time": 1666, "text": "That's just DC."}, {"time": 1667, "text": "Like that is DC because of the way the system is architected."}, {"time": 1673, "text": "It's pretty much been that way since like 1908, whenever like Teddy Roosevelt was dining with these journalists and he would yell at them."}, {"time": 1679, "text": "And then he would go over to the society house."}, {"time": 1682, "text": "And like in many ways, that's now instead of going to Henry Adams's house, like the people are congregating in Calorama, which is the richest neighborhood here at somebody else's house."}, {"time": 1693, "text": "Like it's the same thing."}, {"time": 1694, "text": "So you have to think about the system and then the incentives within that system about what the outcomes that they're producing."}, {"time": 1700, "text": "If you actually wanna think about how can I change this from the outside?"}, {"time": 1703, "text": "That's also why it's very difficult to change because the system is designed in order to produce actually pretty specific outcomes that can only be changed in extraordinary times."}, {"time": 1713, "text": "Yeah, and sometimes it's hard to predict what kind of outcomes will result from the incentive, the system that you create, right?"}, {"time": 1722, "text": "In the case, because especially when it's novel kind of situations."}, {"time": 1726, "text": "With Trump, he actually created a pretty novel situation."}, {"time": 1729, "text": "And a lot of the things that we've seen in the 20th century were very novel systems where people were very optimistic about the outcomes, right?"}, {"time": 1739, "text": "And then it turned out to not have the results that they predicted."}, {"time": 1744, "text": "In terms of things being unchanged for the past 100 years and so on, can you like Wikipedia style or maybe like in a musical form, like I'm only a bill, describe to me."}, {"time": 1757, "text": "I still sing that to my head sometimes."}, {"time": 1760, "text": "I'm just a bill."}, {"time": 1765, "text": "I don't know what the rest of the song is, but let's leave that to people's imagination."}, {"time": 1770, "text": "How does this whole thing work?"}, {"time": 1773, "text": "How does the US political system work?"}, {"time": 1775, "text": "The three branches is how do you think about the system we have now?"}, {"time": 1780, "text": "If you were to try to describe, if aliens showed up and asked you like, they didn't have time, so this is an elevator thing."}, {"time": 1789, "text": "Should we destroy you as you plead to avoid destruction?"}, {"time": 1795, "text": "Well, how would you describe how this thing works?"}, {"time": 1798, "text": "I would say we come together and we pick the people who make our laws."}, {"time": 1803, "text": "Then we pick the guy who executes those laws and they together pick the people who determine whether they or the president is breaking the law at the most basic level."}, {"time": 1816, "text": "That's how I would describe it."}, {"time": 1820, "text": "So the people who make the laws are Congress."}, {"time": 1822, "text": "The executive is charged with executing the laws as passed by Congress, the system, the branches of government, and the Supreme Court is picked by the president, confirmed by the Senate, which then decides whether you or other people are breaking the law in terms of interpretation of that law."}, {"time": 1841, "text": "That's basically it."}, {"time": 1842, "text": "Oh, and they decide whether those laws are in, they fall within the restrictions and the want of the founders as expressed by the Constitution of the United States, which is a set of principles that we came together in 1787."}, {"time": 1866, "text": "I want to make sure I get this right, 1787, and decided that we were going to live the rest of our lives barring a revolution and more."}, {"time": 1874, "text": "And we've made it 200 and something years in order on under that system."}, {"time": 1878, "text": "So there's a balance of power that's because it's multiple branches."}, {"time": 1882, "text": "There's a tension and a balance to it as designed by those original documents."}, {"time": 1888, "text": "What, which is the most dysfunctional, the branches, which is your favorite?"}, {"time": 1892, "text": "Like in terms of talking about systems and like what's the greatest of concern and what is the greatest source of benefit in your view?"}, {"time": 1901, "text": "The presidency, obviously, well, the presidency is my favorite to study, obviously, because it is the one where there's the most subjective variable change in terms of the personality involved because of so much power imbued within the executive."}, {"time": 1916, "text": "The Senate is actually pretty much the same."}, {"time": 1919, "text": "That's one of the things I love about reading about the Senate and histories of the Senate is you're like, oh yeah, there were always like assholes in the Senate who were doing their thing and filibustering constantly based upon this or that."}, {"time": 1935, "text": "And then the personalities involved with the Senate haven't mattered as much since like pre civil war, right?"}, {"time": 1943, "text": "Like pre civil war, you had like Henry Clay and then Daniel Webster and John C. Calhoun, who even in their own way, they represented like larger constituencies and they crafted these like compromises up until the outbreak of the civil war, et cetera."}, {"time": 1957, "text": "But like post since then, you don't think about like the Titans within the Senate."}, {"time": 1962, "text": "Most of that is because a lot of the stuff that they had power over has transferred over to the executive."}, {"time": 1967, "text": "So I'm most interested in really in like power, like where it lies."}, {"time": 1972, "text": "It's actually pretty, you know, throughout American history, much more used to lie with Congress."}, {"time": 1976, "text": "Now it's obviously just so imbued within the executive that understanding executive power is I think the thing I'm probably most interested in here."}, {"time": 1984, "text": "Do you think at this point, the amount of power that the president has is corrupting to their ability to lead well?"}, {"time": 1992, "text": "Is this, you know, power corrupts, absolute power corrupts, absolutely."}, {"time": 1997, "text": "Are we, is there too much power in the presidency?"}, {"time": 2001, "text": "There definitely is."}, {"time": 2002, "text": "And part of the problem, one of the things I try to make come across to people is if you're the president, unless you have a hyper intentional view of how something must be different in government, your view doesn't matter."}, {"time": 2017, "text": "So for example, like if you were Trump, let's take Trump even, and even in with a pretty intentional view, he was like, I'm gonna end the war in Afghanistan and Iraq, right?"}, {"time": 2027, "text": "And he came in and he gets these generals in."}, {"time": 2029, "text": "He's like, I wanna end the war in Afghanistan and Iraq."}, {"time": 2032, "text": "Oh, and I wanna withdraw these troops from Syria."}, {"time": 2034, "text": "And they're like, okay, we'll give you, give us like six months."}, {"time": 2037, "text": "He's like, okay."}, {"time": 2038, "text": "And this is the thing about Trump."}, {"time": 2038, "text": "He doesn't realize that it's bullshit."}, {"time": 2040, "text": "So they're like, he's like, oh, six months seems fun, right?"}, {"time": 2043, "text": "So then six months comes and he's like, he's like, so, and then he'll announce it."}, {"time": 2047, "text": "He'll be like, and we're getting out of Syria."}, {"time": 2050, "text": "And then the generals freak out."}, {"time": 2051, "text": "They're like, whoa, whoa, whoa."}, {"time": 2052, "text": "We don't have a plan for that."}, {"time": 2053, "text": "He's like, but you guys told me six months."}, {"time": 2055, "text": "He's like, I don't know, now we need another six months in order to figure this thing out."}, {"time": 2058, "text": "And by that time, now you're midterms."}, {"time": 2059, "text": "So now what?"}, {"time": 2060, "text": "Now you gotta run for reelection."}, {"time": 2062, "text": "So more what I mean by that is, if you don't have a hyperintentional view about how to change foreign policy, if you don't have a hyperintentional view about how the Department of Commerce should do its job, they are just gonna go on autopilot."}, {"time": 2073, "text": "So this is part of the problem."}, {"time": 2075, "text": "When you asked me about the presidency, it's not the presidency itself, like the president himself, which has become too powerful."}, {"time": 2083, "text": "It's that we have less democratic checks on the people and the systems that are on autopilot."}, {"time": 2091, "text": "And I would say that basically since 2008, we have voted every single time to disrupt that system, except in the case of 2020 with Joe Biden, and there are a lot of different reasons around why that happened."}, {"time": 2106, "text": "And in every single one of those cases, Obama and Trump, they all failed in order to radically disrupt that."}, {"time": 2114, "text": "And that just shows you how titanic the task is."}, {"time": 2117, "text": "And I'm using my language precisely because I don't wanna be like deep state, but obviously there's deep state."}, {"time": 2122, "text": "Deep state, I guess, has conspiratorial intentions to it."}, {"time": 2126, "text": "But so what you're saying is the true power currently lies with the autopilot, AKA deep state."}, {"time": 2132, "text": "Well, but see, this is the thing too I wanna make clear, because I think people think conspiratorially that they're all coming together to intentionally do something."}, {"time": 2143, "text": "They are doing what they know, believe they are right, and don't have real democratic checks within that."}, {"time": 2150, "text": "And so now they have entire generations of cultures within each of these bureaucracies where they say, this is the way that we do things around here."}, {"time": 2159, "text": "And that's the problem, which is that we have a culture of within many of these agencies and more."}, {"time": 2166, "text": "I think the best example for this would be during the Ukraine gate with Trump and all that, with the impeachment."}, {"time": 2175, "text": "I'm not talking about the politics here, but the most revealing thing that happened was when the whistleblower guy, Alexander Vindman, was like, here you have the president departing from the policy of the United States."}, {"time": 2187, "text": "And I was like, well, let me educate you, Lieutenant Colonel."}, {"time": 2192, "text": "The president of the United States makes American foreign policy."}, {"time": 2196, "text": "But it was a very revealing comment because he and all the people within national security bureaucracy do think that."}, {"time": 2204, "text": "They're like, this is the policy of the United States."}, {"time": 2206, "text": "We have to do this."}, {"time": 2208, "text": "That's where things get screwy."}, {"time": 2209, "text": "Well, listen, for me personally, but also from an engineering perspective, I just talked to Jim Keller."}, {"time": 2214, "text": "It's just, this is the kind of bullshit that we all hate when you're trying to innovate and design new products."}, {"time": 2222, "text": "So that's what first principles thinking requires."}, {"time": 2225, "text": "It's like, we don't give a shit what was done before."}, {"time": 2229, "text": "The point is, what is the best way to do it?"}, {"time": 2231, "text": "And it seems like the current government, government in general, probably, bureaucracies in general, are just really good at being lazy without never having those conversations."}, {"time": 2243, "text": "And just, it becomes this momentum thing that nobody has the difficult conversations."}, {"time": 2249, "text": "It's become a game within a certain set of constraints and they never kind of do revolutionary tasks."}, {"time": 2254, "text": "But you did say that the presidency is power, but you're saying that more power than the others, but that power has to be coupled with focused intentionality."}, {"time": 2266, "text": "You have to keep hammering the thing."}, {"time": 2268, "text": "If you want it done, it has to be done."}, {"time": 2271, "text": "I mean, and you gotta, this is the other part too, which is that it's not just that you have to get it done."}, {"time": 2277, "text": "You have to pick the 100 people who you can trust to pick 10 people each to actually do what you want."}, {"time": 2286, "text": "One of the most revealing quotes is from a guy named Tommy Corcoran."}, {"time": 2290, "text": "He was the top aide to FDR."}, {"time": 2292, "text": "This I'm getting from the Kara books too."}, {"time": 2294, "text": "And he said, what is a government?"}, {"time": 2297, "text": "It's not just one guy or even 10 guys."}, {"time": 2300, "text": "Hell, it's a thousand guys."}, {"time": 2303, "text": "And what FDR did is he masterfully picked the right people to execute his will through the federal agencies."}, {"time": 2311, "text": "Johnson was the same way."}, {"time": 2312, "text": "He played these people like a fiddle."}, {"time": 2314, "text": "He knew exactly who to pick."}, {"time": 2316, "text": "He knew the system and more."}, {"time": 2318, "text": "Part of the reason that outsiders who don't have a lot of experience in Washington almost always fail is they don't know who to pick or they pick people who say one thing to their face."}, {"time": 2329, "text": "And then when it comes time to carry out the president's policy in terms of the government, they just don't do it."}, {"time": 2335, "text": "And the president's too, think about this."}, {"time": 2337, "text": "I think some Rahm Emanuel said this."}, {"time": 2338, "text": "He was like, by the time it gets to the president's desk, nobody else can solve it."}, {"time": 2342, "text": "It's not easy."}, {"time": 2343, "text": "It's not like a yes or no question."}, {"time": 2345, "text": "It's every single thing that hits the president's desk is incredibly hard to do."}, {"time": 2350, "text": "And Obama actually even said, and this was a very revealing quote about how he thinks about the presidency, which is he's like, look, the presidency is like one of those super tankers."}, {"time": 2361, "text": "He's like, I can come in and I can take it two degrees left and two degrees right."}, {"time": 2367, "text": "In a hundred years, two degrees left, that's a whole different trajectory."}, {"time": 2371, "text": "Same thing on the right."}, {"time": 2372, "text": "And he's like, that ultimately is really all you can do."}, {"time": 2376, "text": "I quibble and disagree with that in terms of how he could have changed things in 2008, but there's a lot of truth to that statement."}, {"time": 2383, "text": "Okay, that's really fascinating."}, {"time": 2384, "text": "You make me realize that actually both Obama and Trump are probably playing victim here to the system."}, {"time": 2392, "text": "You're making me think that maybe you can correct me that, cause I'm thinking of like Elon Musk, whose major success despite everything is hiring the right people."}, {"time": 2404, "text": "And like creating those thousands, that structure of a thousand people."}, {"time": 2408, "text": "So maybe a president has power in that if they were exceptionally good at hiring the right people."}, {"time": 2413, "text": "Personnel is policy, man."}, {"time": 2415, "text": "That's what it comes down to."}, {"time": 2416, "text": "But wouldn't you be able to steer the ship way more than two degrees if you hire the right people?"}, {"time": 2421, "text": "So like, it's almost like Obama was not good at hiring the right people."}, {"time": 2425, "text": "Well, he hired all the Clinton people."}, {"time": 2426, "text": "That's what happened."}, {"time": 2427, "text": "What happened with Trump?"}, {"time": 2428, "text": "He hired all the Bush people."}, {"time": 2429, "text": "And then you just sit back and say, oh, president can't, but that means you're just suck at hiring."}, {"time": 2437, "text": "Yeah, I mean, look, I know it's funny."}, {"time": 2438, "text": "I'm giving you simultaneously the nationalist case against Trump and the progressive case against Obama."}, {"time": 2445, "text": "The progressive people are like, why the fuck are you hiring all these Clinton people in order to run the government and just recreate, like why are you hiring Larry Summers, who was one of the people who worked at all these banks and didn't believe that bailouts were gonna be big enough, and then to come in in the worst economic crisis in modern American history."}, {"time": 2462, "text": "That was 2008."}, {"time": 2463, "text": "And Summers actively lobbied against larger bailouts, which had huge implications for working class people and pretty much hollowed out America since."}, {"time": 2472, "text": "Okay, from Trump, same thing."}, {"time": 2474, "text": "You're like, I'm gonna drain the swamp."}, {"time": 2475, "text": "And by doing that, I'm gonna hire Goldman Sachs's Gary Cohn and Steve Mnuchin and all these other absolute bush clowns in order to run my White House."}, {"time": 2487, "text": "Well, yeah, no shit."}, {"time": 2489, "text": "The only thing that you accomplished in your four years in office is passing a massive tax cut for the rich and for corporations."}, {"time": 2497, "text": "I wonder how that happened."}, {"time": 2498, "text": "What role does money play in all of this?"}, {"time": 2501, "text": "Is money a huge influence in politics, super PACs, all that kind of stuff?"}, {"time": 2506, "text": "Or is this more just kind of a narrative that we play with because from the outsider's perspective, it seems to have, that seems to be one of the fundamental problems with modern politics."}, {"time": 2516, "text": "So I was just having this conversation, Marshall and I, Marshall Kosloff, my cohost on The Realignment."}, {"time": 2521, "text": "And it's funny because if you do enough research, we actually live in the least corrupt age in American campaign finance, as in it's never been more transparent."}, {"time": 2533, "text": "It's never been more up to the FEC and all of that."}, {"time": 2538, "text": "If you go back and read not even 50 years ago, we're talking about Lyndon B. Johnson, handing people like literally as he came up in his youth, paying people for votes, like the boss of the person who like had all the Mexican votes, like the person who had, and he was like giving out briefcases."}, {"time": 2555, "text": "This is like within people's lifetimes who are alive in America."}, {"time": 2558, "text": "So that doesn't happen anymore."}, {"time": 2560, "text": "But I don't like to blame everything on money."}, {"time": 2564, "text": "Although I do think money is obviously a huge part of the problem."}, {"time": 2567, "text": "I actually look at it in terms of distribution, which is that how is money distributed within our society?"}, {"time": 2575, "text": "Because I firmly believe that politics, this is gonna get complicated, but I think politics is mostly downstream from culture."}, {"time": 2584, "text": "And culture, obviously I'm using economics because there's obviously a huge interplay there, but like in terms of the equitable or lack of equitable distribution of money within our politics, what we're really pissed off about is we're like, our politics only seems to work for the people who have money."}, {"time": 2600, "text": "I think that's largely true."}, {"time": 2601, "text": "I think that the reason why things worked differently in the past is because our economy was structured in different ways."}, {"time": 2608, "text": "And there's a reason that our politics today are very analogous to the last Gilded Age because we had very similar levels of economic distribution and cultural problems too at the same time."}, {"time": 2621, "text": "I don't wanna erase that."}, {"time": 2622, "text": "Cause I actually think that's what's driving all of our politics right now."}, {"time": 2627, "text": "So in that sense, the representative government is doing a pretty good job of representing the state of culture and the people and so on."}, {"time": 2634, "text": "Can I ask you in terms of the deep state and conspiracy theories, there's a lot of talk about, again, from an outsider's perspective, if I were just looking at Twitter, it seems that at least 90% of people in government are pedophiles."}, {"time": 2650, "text": "90 to 95%, I'm not sure what that number is."}, {"time": 2655, "text": "If I were to just look at Twitter, honestly, or YouTube, I would think most of the world is a pedophile."}, {"time": 2660, "text": "I would almost feel like."}, {"time": 2662, "text": "And if you don't fully believe that, you're a pedophile."}, {"time": 2666, "text": "I would start to wonder like, wait, like what, am I a pedophile too?"}, {"time": 2671, "text": "I'm either a communist or a pedophile or both, I guess."}, {"time": 2675, "text": "Yeah, that's gonna be clipped out."}, {"time": 2676, "text": "Thank you, internet."}, {"time": 2679, "text": "I look forward to your emails."}, {"time": 2682, "text": "But is there any kind of shadow conspiracy theories that give you pause or, so the flip side, the response to a lot of conspiracy theories is like, no, the reason this happened is because it's a combination of just incompetence."}, {"time": 2701, "text": "So where do you land on some of these conspiracy theories?"}, {"time": 2706, "text": "I think most conspiracy theories are wrong."}, {"time": 2709, "text": "Some are true and those are spectacularly true."}, {"time": 2712, "text": "And if that makes sense."}, {"time": 2715, "text": "And we don't know which ones."}, {"time": 2716, "text": "I don't know which ones."}, {"time": 2718, "text": "I think, well, I mean, look, man, I listened to your podcast."}, {"time": 2721, "text": "I think I was a huge nonbeliever in UFOs and now I've probably never believed more in UFOs."}, {"time": 2728, "text": "Like I believe in UFOs."}, {"time": 2730, "text": "Like I'm very comfortable being like, not only do I believe in UFOs, like I think we're probably being visited by an alien civilization."}, {"time": 2737, "text": "And if you asked me that three years ago, I would have been like, you're out of your fucking mind."}, {"time": 2740, "text": "Like, what are you talking about?"}, {"time": 2742, "text": "Well, listen to David Fravor."}, {"time": 2743, "text": "That's all I have to say."}, {"time": 2745, "text": "I have the sense that the government has information that hasn't revealed, but it's not like they're, I don't think they're holding, there's like a green guy sitting there in a room."}, {"time": 2756, "text": "They have seen things they don't know what to do with."}, {"time": 2759, "text": "So it's like, they're confused."}, {"time": 2761, "text": "They're afraid of revealing that they don't know."}, {"time": 2764, "text": "That's what I think it is, right?"}, {"time": 2765, "text": "It's revealing, yeah, exactly, that they don't know."}, {"time": 2769, "text": "And then in the process, there's a lot of fears tied up in that."}, {"time": 2772, "text": "First, looking incompetent in the public eye."}, {"time": 2775, "text": "Nobody wants to be looked that way."}, {"time": 2777, "text": "And the other is like, in revealing it, even though they don't know, maybe China will figure it out."}, {"time": 2784, "text": "So like, we don't want China to figure it out first."}, {"time": 2786, "text": "And so all those kinds of things result in basically secrecy."}, {"time": 2790, "text": "Then that damages the trust in institutions on one of the most fascinating aspects, like one of the most fascinating mysteries of humankind of is there life, intelligent life, out there in the universe?"}, {"time": 2804, "text": "So that's one of them."}, {"time": 2805, "text": "But there's other ones, like for me, when I first came across actually Alex Jones was 9 11."}, {"time": 2813, "text": "I remember like, cause I was in Chicago."}, {"time": 2817, "text": "I was thinking like, oh shit, are they gonna hit Chicago too?"}, {"time": 2821, "text": "That's what everybody was thinking."}, {"time": 2822, "text": "Yeah, everybody."}, {"time": 2823, "text": "Everybody was thinking like, what does this mean?"}, {"time": 2825, "text": "What scale?"}, {"time": 2825, "text": "What, I mean, trying to interpret it."}, {"time": 2827, "text": "And I remember like looking for information desperately, like what happened?"}, {"time": 2832, "text": "And I remember not being satisfied with the quality of reporting and figuring out like rigorous, like here's exactly what happened."}, {"time": 2841, "text": "And so people like Alex Jones stepped up and others that said like, there's some shady shit going on."}, {"time": 2847, "text": "And it sure as hell looked like there's shady shit going on."}, {"time": 2851, "text": "So like, and I still stand behind the fact that it seems like there's not, there's not enough, like it wasn't a good job of being honest and transparent and all those kinds of things."}, {"time": 2862, "text": "Cause it would implicate the Saudis."}, {"time": 2864, "text": "And see, that's my conspiracy theories."}, {"time": 2866, "text": "I'm like, yeah, I think they covered up a lot of stuff because they wanted to cover up for the kingdom of Saudi Arabia."}, {"time": 2870, "text": "Like, I mean, that was a conspiracy theory not that long ago."}, {"time": 2874, "text": "I think it's true."}, {"time": 2875, "text": "I mean, I think it's a hundred percent true."}, {"time": 2877, "text": "Yeah, so those kinds of conspiracy theories are interesting."}, {"time": 2879, "text": "I mean, there's other ones for me personally that touched the institution that means a lot to me is the MIT and, you know, Jeffrey Epstein."}, {"time": 2889, "text": "Yeah, I wanna hear a lot more."}, {"time": 2890, "text": "I wanna hear about, I talk about Epstein a lot."}, {"time": 2892, "text": "So I'm like."}, {"time": 2892, "text": "Oh, you do?"}, {"time": 2893, "text": "Yeah, and he, I was gonna say, in terms of conspiracy theory, that one changed my outlook."}, {"time": 2898, "text": "Cause I was like, I was like, whoa, like you have this dude who convinced some of the most successful people on earth that he was like some money manager."}, {"time": 2909, "text": "And it looks like it was totally fake."}, {"time": 2911, "text": "Like Leon Black."}, {"time": 2912, "text": "I mean, this is one of the richest men on wall street, $9 billion net worth."}, {"time": 2916, "text": "Why is he giving him over a hundred million dollars between 2015 and 2019?"}, {"time": 2922, "text": "What's going on here?"}, {"time": 2923, "text": "Lex Wexner, same thing."}, {"time": 2925, "text": "So yeah, I wanna hear, because you know people who met him."}, {"time": 2928, "text": "And the only person I know who met him was Eric Weinstein."}, {"time": 2930, "text": "I've heard his, right."}, {"time": 2933, "text": "So I, listen, I'm still in and Eric is fascinating and like Eric is full on saying that."}, {"time": 2939, "text": "He was a Mossad or whatever."}, {"time": 2941, "text": "Yeah, there's a front for something, something much, much bigger."}, {"time": 2946, "text": "And there's a, whatever his name, Robert Maxwell, all the, all those stories, like you could dig deeper and deeper that Jeffrey's just like the tip of the iceberg."}, {"time": 2957, "text": "I just think he's an exceptionally charismatic, listen, this isn't speaking from confidence or like deep understanding of the situation, but from my speaking with people, he just seems like, at least from the side of his influence and interaction with researchers, he just seems like somebody that was exceptionally charismatic and actually took interest."}, {"time": 2984, "text": "He was unable to speak about interesting scientific things, but he took interest in them."}, {"time": 2991, "text": "So he knew how to stroke the egos of a lot of powerful people, like well, like in different kinds of ways, I suppose I don't know about this because I don't have, like if a really, okay, this is weird to say, but I have an ability, okay, I think women are beautiful, I like women, but like if like a supermodel came to me or something, like I'm able to reason."}, {"time": 3019, "text": "It seems like some people are not able to think clearly when there's like an attractive woman in the room."}, {"time": 3025, "text": "And I think that was one of the tools he used to manipulate people."}, {"time": 3030, "text": "I don't know, listen, it's like the pedophile thing."}, {"time": 3033, "text": "I don't know how many people are complete sex addicts, but like, it seems like looking out into the world, like the Me Too movement have revealed that there's a lot of like weird, like creepy people out there."}, {"time": 3047, "text": "I don't know, but I think it was just one of the many tools that he used to convince people and manipulate people, but not in some like evil way, but more just really good at the art of conversation and just winning people over on the side."}, {"time": 3070, "text": "And then by building through that process, building a network of other really powerful people and not explicitly, but implicitly having done shady shit with powerful people, like building up a kind of implied power of like, like we did some shady shit together."}, {"time": 3094, "text": "So we're not like, you're gonna help me out on this extra thing I need to do now."}, {"time": 3099, "text": "And that builds and builds and builds to where you're able to actually control, like have quite a lot of power without explicitly having like a strategy meeting."}, {"time": 3110, "text": "And I think a single person or yeah, I think a single person can do that, can start that ball rolling."}, {"time": 3118, "text": "And over time it becomes a group thing, like I don't know if Jillian Maxwell was involved or others and yeah, over time that becomes almost like a really powerful organization that wasn't, that's not a front for something much deeper and bigger, but it's almost like maybe it's cause I love cellular automata, man."}, {"time": 3139, "text": "A system that starts out as a simple thing with simple rules can create incredible complexity."}, {"time": 3172, "text": "So the final result is, I mean, listen, I have a pretty optimistic, I tend to see the good in people and so it's been heartbreaking to me in general just to see people I look up to not have the level of integrity I thought they would or like the strength of character, all those kinds of things."}, {"time": 3195, "text": "And it seems like you should be able to see the bullshit that is Jeffrey Epstein, like when you meet him."}, {"time": 3203, "text": "We're not talking about like Eric Weinstein, like one or two or three or five interactions, but like there's people that had like years of relationship with him."}, {"time": 3213, "text": "And I don't know, I'm not sure."}, {"time": 3215, "text": "Even after he was convicted."}, {"time": 3216, "text": "After he was convicted."}, {"time": 3218, "text": "That guy always gets me."}, {"time": 3219, "text": "Yeah, there's stories, I mean, I don't need to sort of, I honestly believe, okay, here's the open question I have."}, {"time": 3232, "text": "I don't know how many creepy sexual people that are out there."}, {"time": 3237, "text": "Like, I don't know if there is like, like the people I know, the faculty and so on, I don't know if they have like a kink that I'm just not aware of that was being leveraged because to me, it seems like if not everybody's a pedophile, then it's just the art of conversation."}, {"time": 3258, "text": "That is just like the art of just like manipulating people by making them feel good about like the exciting stuff they're doing."}, {"time": 3265, "text": "Listen, man, academics, people talk about money."}, {"time": 3268, "text": "I don't think academics care about money as much as people think."}, {"time": 3271, "text": "What they care about is like somebody, they want to be, it's the same thing that Instagram models posting their butt pictures, is they want to be loved."}, {"time": 3282, "text": "They want attention."}, {"time": 3283, "text": "My parents are professors."}, {"time": 3287, "text": "They, and Jeff Epstein, like the money is another way to show attention."}, {"time": 3292, "text": "Right, it's a proxy."}, {"time": 3294, "text": "My work matters."}, {"time": 3295, "text": "And he did that for some of the weirdest, most brilliant people."}, {"time": 3302, "text": "I don't want to sort of drop names, but everybody knows them."}, {"time": 3306, "text": "It's like people that are the most interesting academics is the one he cared about."}, {"time": 3311, "text": "Like people are thinking about the most difficult questions in all of science and all of engineering."}, {"time": 3316, "text": "So those people are, were kind of outcasts in academia a little bit because they're doing the weird shit."}, {"time": 3323, "text": "They're the weirdos."}, {"time": 3324, "text": "And he cared about the weirdos and he gave them money."}, {"time": 3326, "text": "And that, you know, that's, I don't know if there's something more nefarious than that."}, {"time": 3333, "text": "I hope not, but maybe I'm surprised."}, {"time": 3336, "text": "And in fact, half the population of the world is pedophiles."}, {"time": 3339, "text": "No, I think it's what you were talking about, which is that it's the, it's the implication after the initial, right?"}, {"time": 3346, "text": "Like you do some shady things together or you do something that you want out of the public eye and you're a public person."}, {"time": 3352, "text": "And look, we probably even experienced this to a limited extent, right?"}, {"time": 3355, "text": "You're like, ah, you know, like, I don't want to, I don't know, I almost lost my temper, you know, one time whenever a car hit me and I'm like, I can't freak out in public anymore."}, {"time": 3362, "text": "Like, you know, like what if somebody takes a photo or something?"}, {"time": 3365, "text": "And so I think that there's an extent to that times a billion, literally, when you have a billion dollars or more."}, {"time": 3372, "text": "And you take that all together and you stack it up on itself."}, {"time": 3375, "text": "I saw a story about like Bill Clinton."}, {"time": 3376, "text": "Like Bill Clinton was with Epstein or with Ghislaine Maxwell in a private air terminal or something."}, {"time": 3383, "text": "And she had one of their like sex, you know, one of those girls who was underage, had her dressed up in a literal like pilot uniform."}, {"time": 3391, "text": "And she was underage in order to, you know, and she was being disguised for being older."}, {"time": 3397, "text": "And she was a masseuse, right?"}, {"time": 3399, "text": "Because that was one of the guises which they got in order to sexually traffic these women."}, {"time": 3403, "text": "And she was like, Bill was like complaining about his neck."}, {"time": 3405, "text": "And she's like, give Bill Clinton a massage, right?"}, {"time": 3407, "text": "So now there's a photo of an underage girl giving a massage to the former president of the United States."}, {"time": 3412, "text": "I don't think he knew, right?"}, {"time": 3414, "text": "But like, that looks bad."}, {"time": 3416, "text": "And so this is kind of what we're getting at, which is that you're setting it all up and creating those preconditions or like Prince Andrew."}, {"time": 3424, "text": "Do I think Prince Andrew knew that Virginia Gouffre was underage?"}, {"time": 3430, "text": "Probably knew she was pretty young, which I think is, you know, skeevy enough where you're a fucking Prince, you probably know better."}, {"time": 3435, "text": "But I don't think he knew she was underage or maybe he did."}, {"time": 3439, "text": "And if he did, then he's even more of a piece of shit than I thought."}, {"time": 3442, "text": "But when we look at these things, the stuff I'm more interested in is like what you were talking about."}, {"time": 3448, "text": "I'm like, Bill Gates, how do you get the richest man in the world in your house?"}, {"time": 3453, "text": "Like under what, and Gates is like, he was talking about financing and all this."}, {"time": 3457, "text": "I'm like, you don't have access to money or bankers?"}, {"time": 3460, "text": "Like you're the richest man in the world."}, {"time": 3462, "text": "You can call Goldman Sachs anytime you want on a hotline."}, {"time": 3466, "text": "Like, why do you need, that's where I start again to get more conspiratorial because I'm like, Bill, dude, you have the gold credit, right?"}, {"time": 3474, "text": "Like you don't need Epstein to create some complicated financing structure."}, {"time": 3479, "text": "Or Leon Black, like what is 2015, 2009?"}, {"time": 3484, "text": "I mean, this is very recent stuff."}, {"time": 3486, "text": "Or, and this is the part that really got me as I read the department, I think it's called the Department of Financial Service report around Deutsche Bank with Epstein."}, {"time": 3495, "text": "They knew he was a criminal."}, {"time": 3496, "text": "They solicited his business, explicitly knew that his business meant access to other high net worth individuals, consistently doled money out from his account for hush payments to women in Europe and prostitution rings."}, {"time": 3511, "text": "They knew all of this within the bank."}, {"time": 3513, "text": "It was elevated multiple times."}, {"time": 3515, "text": "Here was the other one."}, {"time": 3516, "text": "One of Epstein's associates was like, hey, how much money can we take out before we hit the automatic sensor before you have to tell the IRS?"}, {"time": 3524, "text": "And that question by their own standards is supposed to result in a notification to the feds and they never did it."}, {"time": 3532, "text": "And he was withdrawing like $2 million of cash in five years for tips to, I'm like, okay, like something's going on here."}, {"time": 3540, "text": "Like, you see what I'm saying?"}, {"time": 3541, "text": "There's a lot of signs that make you think that there's a bigger thing at play than just the man, that there's some, it does look like a larger organization is using this front, right?"}, {"time": 3555, "text": "Again, I don't know."}, {"time": 3556, "text": "I truly don't know."}, {"time": 3557, "text": "And I'm not willing to use the certainty, which I think a lot of people online are, to say like, it wants 100%."}, {"time": 3562, "text": "The certainty is always the problem because that's probably why I hesitate to touch conspiracy theories is because I'm allergic to certainty in all forms."}, {"time": 3571, "text": "In politics, any kind of discourse."}, {"time": 3573, "text": "And people are so sure, in both directions, actually, it's kind of hilarious."}, {"time": 3579, "text": "Either they're sure that the conspiracy theory, particularly whatever the conspiracy theory is, is false."}, {"time": 3585, "text": "Like they almost dismiss it like, like they don't even want to talk about it."}, {"time": 3590, "text": "It's like the people, like the way they dismiss that the earth is flat."}, {"time": 3594, "text": "Most scientists are like, they don't even want to like hear what the flat earthers are saying."}, {"time": 3602, "text": "They don't have like zero patience for it, which is like, maybe in that case is deserved."}, {"time": 3609, "text": "But everything else, you really like have empathy."}, {"time": 3614, "text": "Like consider the fact, you have, okay, this is weird to say, but I feel like you have to consider that the earth may be flat for like one minute."}, {"time": 3626, "text": "Like you have to be empathetic."}, {"time": 3627, "text": "You have to be open minded."}, {"time": 3629, "text": "I don't see a lot of that through our cultural taste makers and more."}, {"time": 3632, "text": "And that really is what concerns me the most."}, {"time": 3635, "text": "Cause it's just another manifestation of all of our problems."}, {"time": 3638, "text": "Is that we have this completely bifurcating economy, bifurcating culture, literally, in terms of we have the middle of the country and then we have the coast."}, {"time": 3647, "text": "And in terms of the population, it's almost 50, 50."}, {"time": 3651, "text": "And with increasing mega cities and urban culture, like urban monoculture of LA, New York and Chicago and DC and Boston and Austin, relative to how an entire other group of Americans live their lives, or even the people within them who aren't rich and upwardly mobile, how they live their lives is just completely separating."}, {"time": 3672, "text": "And all of our language and communication in mass media and more is to the top."}, {"time": 3676, "text": "And then everybody else is forgotten."}, {"time": 3678, "text": "Do you think when you dig to the core, there is a big gap between left and right?"}, {"time": 3685, "text": "Is that division that's perceived currently real or are most people center left and center right?"}, {"time": 3693, "text": "It's so interesting because that's such a loaded term, center left."}, {"time": 3699, "text": "Like to you, I think the way you're thinking of it is, I'm not like a, well, even this, like I'm not a radical socialist, but I'm marginally left on cultural issues and economic issues."}, {"time": 3716, "text": "This is how we've traditionally understood things."}, {"time": 3719, "text": "And then in popular discourse, like center right, like what does it mean to be center right?"}, {"time": 3723, "text": "Like I am marginally right on social issues and marginally right on economic issues."}, {"time": 3730, "text": "But that's just not, like if you look at survey data, for example, like stimulus checks, people who are against stimulus checks are conservative."}, {"time": 3740, "text": "Well, 80% of the population is for a stimulus check."}, {"time": 3743, "text": "So that means a sizable number of Republicans are for stimulus checks."}, {"time": 3747, "text": "Same thing happens on like a wealth tax."}, {"time": 3750, "text": "The same thing happens on, okay, Florida voted for Trump, 3.1%, more than Barack Obama, 2008, on the same day passes a $15 minimum wage at 67%."}, {"time": 3765, "text": "So that's why I."}, {"time": 3767, "text": "Oh, that's my entire career."}, {"time": 3770, "text": "But it seems like, so that's fascinating."}, {"time": 3773, "text": "Conversation is different than the policies."}, {"time": 3777, "text": "Well, it's different than reality."}, {"time": 3779, "text": "That's what I would say, which is that the way we have to understand American politics today, it didn't always used to be this way, is it's almost entirely long."}, {"time": 3789, "text": "Basic, I would say the main divider is, because even when you talk about class, this misses it in terms of socioeconomics, it's around culture, which is that it's basically, if you went to a four year degree granting institution, you are part of one culture."}, {"time": 3805, "text": "If you didn't, you're part of another."}, {"time": 3807, "text": "I don't wanna erase the 20% or whatever of people who did go to a college degree who are Republicans or vice versa, et cetera, but I'm saying on average, in terms of the median way that you feel, we're basically bifurcating along those lines."}, {"time": 3823, "text": "And because people get upset, be like, oh, well, there are rich people who vote for Trump."}, {"time": 3827, "text": "And I'm like, yeah, but you know who they are?"}, {"time": 3830, "text": "They're like plumbers or something."}, {"time": 3832, "text": "They're people who make $100,000 a year, but they didn't go to a four year college degree and they might live who are in a place which is not an urban metro area."}, {"time": 3842, "text": "And then at the same time, you have like a Vox writer who makes like 30 grand, but they have a lot more cultural power than like the plumber."}, {"time": 3851, "text": "So you have to think about where exactly that line is."}, {"time": 3855, "text": "And I think in general, that's the way that we're trending."}, {"time": 3858, "text": "So that's why when I say like, what's going on, are we divided?"}, {"time": 3862, "text": "Yeah, like, but it's not left and right."}, {"time": 3864, "text": "I mean, like, and that's why I hate these labels."}, {"time": 3866, "text": "So it's more just red and blue like teams."}, {"time": 3869, "text": "They're arbitrary teams."}, {"time": 3871, "text": "So how arbitrary are these teams, I guess is another."}, {"time": 3874, "text": "Completely arbitrary."}, {"time": 3875, "text": "So, well, you kind of imply that there's, I don't know if you're sort of in post analyzing the patterns because it seems like there's a network effects of like, you just pick the team red or blue and it might have to do with college."}, {"time": 3890, "text": "You might have to do all of those things, but like, it seems like it's more about just the people around you."}, {"time": 3899, "text": "So less than whether you went to college or not."}, {"time": 3901, "text": "I mean, it's almost like, seems like, it's almost like a weird, like network effects that are hard."}, {"time": 3908, "text": "There's certain strong patterns you're identifying, but I don't know."}, {"time": 3913, "text": "It's sad to think that it might be just teams that have nothing to do with what you actually believe."}, {"time": 3918, "text": "Well, it is, Lex."}, {"time": 3920, "text": "Look, I mean, I don't want to believe that, but the data points me to this, which especially 2020, I'm one of the people chief among them."}, {"time": 3928, "text": "I will own up to it here."}, {"time": 3929, "text": "I was totally wrong about why Trump was elected in 2016."}, {"time": 3933, "text": "I believed and based a lot of my public commentary beliefs on this, Trump was elected because of a rejection of Hillary Clinton neoliberalism on the back of a pro worker message, which was anti immigration."}, {"time": 3948, "text": "It was its pillar, but alongside of it was a rejection of free trade with China and generally of the political correctness and globalism, which has been come in through the uniparty and same thing here with the military industrial complex and endless war, he rejected all of that."}, {"time": 3968, "text": "Wait, what's wrong with that prediction?"}, {"time": 3970, "text": "It's wrong, man."}, {"time": 3971, "text": "And the reason I know this is that it sounds right."}, {"time": 3974, "text": "I wish it, I honestly wish it was true, but here's the truth."}, {"time": 3977, "text": "Trump actually governed largely as a neoliberal Republican who was meaner online and who departed from orthodoxy in some very important ways."}, {"time": 3987, "text": "Don't get me wrong."}, {"time": 3988, "text": "I will always support the trade war with China."}, {"time": 3991, "text": "I will always support not expanding the wars in Afghanistan and in Iraq."}, {"time": 3995, "text": "I will support him moving the Overton window on a million different things and revealing once and for all that GOP voters don't care about economic orthodoxy necessarily."}, {"time": 4005, "text": "But here's what they do care about."}, {"time": 4007, "text": "Trump got more votes in 2020 than he did in 2016, despite not delivering largely for all the Trump people out there on that agenda."}, {"time": 4016, "text": "He wasn't more pro union, but he won more union votes."}, {"time": 4019, "text": "He wasn't necessarily more pro worker, but he actually won more votes in Ohio than he did in 2016."}, {"time": 4027, "text": "And he won more Hispanic votes than despite being all the immigration rhetoric, et cetera."}, {"time": 4033, "text": "Here's why, it's about the culture, which is that the culture war is so hot that negative partisanship is at such high levels."}, {"time": 4042, "text": "All of the vote is geared upon what the other guy might do in office."}, {"time": 4046, "text": "And there's a poll actually just came out by Echelon Insights."}, {"time": 4049, "text": "Crystal and I were talking about it on Rising, that number one concern amongst Democratic voters is Trump voters, number one concern."}, {"time": 4057, "text": "Not issues like Trump voters."}, {"time": 4061, "text": "And number two is white supremacy."}, {"time": 4063, "text": "And so like, which is basically code for Trump voters."}, {"time": 4067, "text": "And is the same true for the other side?"}, {"time": 4068, "text": "Also on the right, the number one concern is illegal immigration."}, {"time": 4072, "text": "And number, I think, three or four or whatever is Antifa, which is code for Democrats."}, {"time": 4078, "text": "At least on the right is a policy kind of thing."}, {"time": 4080, "text": "Well, yeah, it's funny."}, {"time": 4081, "text": "I saw Ben Shapiro was talking about this."}, {"time": 4083, "text": "But the reason why I would functionally say it's the same is because, I mean, you can believe whether it's true or not."}, {"time": 4090, "text": "I think it actually largely is true."}, {"time": 4091, "text": "But a lot of GOP voters feel like a lot of illegal immigration is code for people who are coming in, who are gonna be legalized and are gonna go vote Democrat."}, {"time": 4099, "text": "Like, I can just explain it from their point of view."}, {"time": 4102, "text": "So like, what does that actually mean?"}, {"time": 4105, "text": "Each other, like each other, which is that the number one concern is the other person."}, {"time": 4110, "text": "So negative partisanship has never been higher."}, {"time": 4113, "text": "And I think people who had my thesis in terms of why Trump was elected in 2016, you have to grapple with this."}, {"time": 4119, "text": "Like, how did he win 10 million more votes?"}, {"time": 4123, "text": "He came 44,000 votes away from winning the presidency across three states."}, {"time": 4126, "text": "Like, I don't, none of our popular discourse reflects that very stark reality."}, {"time": 4131, "text": "And I think so much of it is people really hate liberals."}, {"time": 4137, "text": "Like, they just really hate them."}, {"time": 4139, "text": "And I was driving through rural Nevada before the election."}, {"time": 4144, "text": "And I was like, literally in the middle of nowhere."}, {"time": 4146, "text": "And there was this massive sign this guy had out in front of his house."}, {"time": 4150, "text": "And it just said, Trump, colon, fuck your feelings."}, {"time": 4154, "text": "And I was like, that's it."}, {"time": 4156, "text": "That is why people voted for Trump."}, {"time": 4158, "text": "And I don't want to denigrate it because they truly feel they have no cultural power in America, except to raise the middle finger to the elite class by pressing the button for Trump."}, {"time": 4170, "text": "I get that."}, {"time": 4171, "text": "That's actually a totally rational way to vote."}, {"time": 4175, "text": "It's not the way I wish we did vote, but like, you know, that's not my place to say."}, {"time": 4180, "text": "So this is interesting."}, {"time": 4181, "text": "If you could just psychoanalyze, I'm again, probably naive about this, but I'm really bothered by the hatred of liberals."}, {"time": 4192, "text": "It's this amorphous monster that's mocked."}, {"time": 4197, "text": "It's like the Shapiro liberal tears."}, {"time": 4200, "text": "And I'm also really bothered by probably more of my colleagues and friends, the hatred of Trump."}, {"time": 4209, "text": "Yeah, the Trump and white supremacists."}, {"time": 4215, "text": "So apparently there's 70 million white supremacists, 75 million, sorry."}, {"time": 4221, "text": "There's millions of white supremacists."}, {"time": 4225, "text": "And apparently whatever liberal is, I mean, literally liberal has become equivalent to white supremacists in the power of negativity it arouses."}, {"time": 4236, "text": "I don't even know what those, I mean, honestly, they've become swears essentially."}, {"time": 4242, "text": "Is that, I mean, how do we get out of this?"}, {"time": 4246, "text": "Because that's why I just don't even say anything about politics online."}, {"time": 4250, "text": "Cause it's like, really?"}, {"time": 4253, "text": "Like you can't, here's what happens."}, {"time": 4258, "text": "Anything you say that's like thoughtful, like, hmm, I wonder, immigration, something."}, {"time": 4265, "text": "I wonder like why we have these many, we allow these many immigrants in or some version of the like thinking through these difficult policies and so on."}, {"time": 4278, "text": "They immediately tried to find like a single word in something you say that can put you in a bin of liberal or white supremacists and then hammer you to death by saying you're one of the two."}, {"time": 4292, "text": "And then everybody just piles on happily that we finally nailed this white supremacist or liberal."}, {"time": 4299, "text": "And that, is this some kind of weird like feature of online communication that we've just stumbled upon?"}, {"time": 4305, "text": "Is there a way or is it possible to argue that this is like a feature, not a bug?"}, {"time": 4311, "text": "Like, this is a good thing?"}, {"time": 4313, "text": "Yeah, well, look, I just think it's a reflection of who we are."}, {"time": 4316, "text": "People like to blame social media."}, {"time": 4317, "text": "I think we're just incredibly divided right now."}, {"time": 4319, "text": "I think we've been divided like this for the last 20 years."}, {"time": 4322, "text": "And I think that, the reason I focus almost 99% of my public commentary on economics is because you asked an important question at the top."}, {"time": 4330, "text": "How do we fix this?"}, {"time": 4332, "text": "What did I say about the stimulus checks?"}, {"time": 4334, "text": "Stimulus checks have 80% approval rating."}, {"time": 4336, "text": "So that's the type of thing."}, {"time": 4338, "text": "If I was Joe Biden and I wanted to actually heal this country, that's the very first thing I would have done when I came into office."}, {"time": 4343, "text": "Same thing on when you look at anything that's gonna increase wages."}, {"time": 4348, "text": "I said on the show, I was like, look, I think Joe Biden will have an 80% approval rating if he does two things."}, {"time": 4354, "text": "If he gives every American a $2,000 stimulus check and gives everybody who wants a vaccine a vaccine."}, {"time": 4360, "text": "It's pretty simple."}, {"time": 4361, "text": "Cause here's the thing."}, {"time": 4363, "text": "I don't really like Greg Abbott that much."}, {"time": 4365, "text": "We have like very different politics."}, {"time": 4366, "text": "I'm from Texas, but my parents got vaccinated really quickly."}, {"time": 4370, "text": "That means something to me."}, {"time": 4371, "text": "I'm like, listen, I don't really care about a lot of the other stuff."}, {"time": 4375, "text": "He got my family vaccinated."}, {"time": 4378, "text": "Like that, well, I will forever remember that."}, {"time": 4382, "text": "And that's how we will remember the checks."}, {"time": 4384, "text": "This is a part of a reason why Trump almost won the election and why, if the Republicans had been smart enough to give him another round of checks, 100% would have won."}, {"time": 4394, "text": "Which is that people were like, look, I don't really like Trump, but I got a check with his name on it."}, {"time": 4400, "text": "And that meant something to me and my family."}, {"time": 4404, "text": "I'm not saying for all the libertarians out there that they should go and like endlessly spend money and buy votes."}, {"time": 4411, "text": "What I am saying is lean into the majoritarian positions without adding your culture war bullshit on top of it."}, {"time": 4420, "text": "So for example, what's the number one concern that AOC says after the first round of checks got out?"}, {"time": 4425, "text": "Oh, the checks didn't go to illegal immigrants."}, {"time": 4427, "text": "I'm like, are you out of your fucking mind?"}, {"time": 4429, "text": "Like this is the most popular policy America has probably done in 50 years, since like Medicare and you're ruining it."}, {"time": 4440, "text": "And then on the right is the same thing, which is that they'll be like, these checks are going to like, you know, low level blah, blah, you know, people who are lazy and don't work."}, {"time": 4450, "text": "I'm like, oh, there you go, you know, like you're just playing a caricature of what you are."}, {"time": 4454, "text": "Like if you lean into those issues and you got to do it clean, this is what everybody hates about DC, which is that Biden right now is doing the $1,400 checks, but he's looping it in with his COVID relief bill and all that."}, {"time": 4466, "text": "That's his prerogative, that's the Democrats prerogative."}, {"time": 4468, "text": "They won the election, that's fine."}, {"time": 4470, "text": "But I'll tell you what I would have done if I was him, I would have come in and I would have said, there's five United States senators who are on the record, Republicans, who said they'll vote for a $2,000 check."}, {"time": 4479, "text": "And I would put that on the floor of the United States Senate on my, you know, first or the first day possible."}, {"time": 4486, "text": "And I would have passed it and I would have forced those Republican senators to live up to that, vote for this bill, come to the Oval Office for a signing so that the very first thing of my presidency was to say, I'm giving you all this relief check, this long national nightmare is over."}, {"time": 4503, "text": "Take this money, do with it what you need."}, {"time": 4505, "text": "We've all suffered together."}, {"time": 4507, "text": "The thing about Biden is he has a portrait of FDR and is in the Oval, which kind of bothers me because he thinks of himself as an FDR like figure."}, {"time": 4516, "text": "But this is, you have to understand the majesty of FDR."}, {"time": 4520, "text": "We're talking about a person who passed a piece of legislation five days after he became president."}, {"time": 4525, "text": "And he passed 15 transformative pieces of legislation in the first 100 days."}, {"time": 4530, "text": "We're on day like 34, 35, and nothing has passed."}, {"time": 4535, "text": "The reconciliation bill will eventually become law, but it will become law with no Republican votes."}, {"time": 4540, "text": "And again, that's fine."}, {"time": 4542, "text": "But it's not fulfilling that legacy and the urgency of the action."}, {"time": 4547, "text": "And the mandate, which I believe that history has handed, it handed it to Trump and he fucked it up, right?"}, {"time": 4552, "text": "He totally screwed it up."}, {"time": 4554, "text": "He could have remade America and made us into the greatest country ever coming out on the other side of this."}, {"time": 4558, "text": "He decided not to do that."}, {"time": 4561, "text": "I think Biden was again handed that like a scepter almost."}, {"time": 4564, "text": "It's like all you have to do, all America wants is for you to raise it up high, but he's keeping it within the realm of traditional politics."}, {"time": 4570, "text": "I think it's a huge mistake."}, {"time": 4571, "text": "Why, so this is, everything he's saying is makes perfect sense, like take, okay."}, {"time": 4576, "text": "It's like, it's like, again, if the aliens showed up, it's like the obvious thing to do is like, what's the popular thing?"}, {"time": 4585, "text": "Like 80% of Americans support this."}, {"time": 4588, "text": "Like do that clean."}, {"time": 4591, "text": "Also do it like with like grace, where you're able to bring people together, not like in a political way, but like obvious common sense way."}, {"time": 4604, "text": "Like just people, the Republicans and Democrats just bring them together on a policy and like bold, just hammer it without the dirt, without the mess, whatever, try to compromise."}, {"time": 4616, "text": "Just the yellow have a good Twitter account, like loud, very clear."}, {"time": 4623, "text": "We're gonna give a $2,000 or a stimulus check."}, {"time": 4626, "text": "Anyone who wants a vaccine gets a vaccine at scale."}, {"time": 4631, "text": "What make America, let's make America great again by manufacturing."}, {"time": 4636, "text": "Like we are manufacturing most of the world's vaccine because we're bad motherfuckers."}, {"time": 4642, "text": "And without maybe with more eloquence than that and just do that."}, {"time": 4647, "text": "Why haven't we seen that for many, for several presidencies?"}, {"time": 4652, "text": "Because of coalitional politics and they owe something to somebody else."}, {"time": 4656, "text": "For example, Biden has got a lot of the Democratic constituency has to satisfy within this bill."}, {"time": 4664, "text": "So there's gonna be a lot of shit that goes in there, state and local aid, all this stuff."}, {"time": 4669, "text": "Again, I'm not even saying this is bad, but he's like, his theory is, and this isn't wrong, is like we're gonna take the really popular stuff and use it as cover for the more downwardly less popular."}, {"time": 4680, "text": "And so the Dems could face the accusation, the people who are on this side, this is their pushback to me."}, {"time": 4686, "text": "They're like, why would we give away the most popular thing in the bill and then we would never be able to pass state and local aid, right?"}, {"time": 4693, "text": "Why would we do, and the Republicans do the same thing, right, like Mitch McConnell, because he's a fucking idiot, decided to say, we're gonna pair these $2,000 stimulus checks with like section 230 repeal."}, {"time": 4704, "text": "And it was like, oh, it's obviously dead, right?"}, {"time": 4706, "text": "Like it's not gonna happen together."}, {"time": 4708, "text": "That's largely why I believe Trump lost the election and why those races down in Georgia went the way that they did."}, {"time": 4714, "text": "Obviously Trump had something to do with it, but the reason why is they have longstanding things that they've wanted to get done."}, {"time": 4721, "text": "And in the words of Rahm Emanuel, never let a good crisis go to waste and try and get as much as you possibly can done within a single bill."}, {"time": 4728, "text": "My counter would be this, things have worked this way for too long, which is that the reconciliation bill is almost certainly going to be the only large signature legislative accomplishment of the Biden presidency."}, {"time": 4743, "text": "That's just how American politics works."}, {"time": 4745, "text": "Maybe he gets one more, maybe one."}, {"time": 4747, "text": "He has a second reconciliation bill, then you're running for midterms, it's over."}, {"time": 4752, "text": "I believe that by trying to change the paradigm of our politics, leaning into exactly what I'm talking here, you could possibly transcend that to a new one."}, {"time": 4763, "text": "And I'm not naive."}, {"time": 4764, "text": "I think people respond to political pressures."}, {"time": 4767, "text": "And the way that we found this out was David Perdue, who was just a total corporate dollar general CEO guy."}, {"time": 4775, "text": "He was against the original $1,200 stimulus checks."}, {"time": 4779, "text": "But then Trump came out, who's the single most popular figure in the Republican party."}, {"time": 4783, "text": "He's like, I want $2,000 stimulus checks."}, {"time": 4785, "text": "And all of a sudden, Perdue running in Georgia is like, yeah, I'm with President Trump, I want a $2,000 stimulus check."}, {"time": 4793, "text": "That was, if you're an astute observer of politics, to say, you can see there that you can force people to do the right thing because it's the popular thing."}, {"time": 4802, "text": "And that if it's clean, if you don't give them any other excuse, they have to do it."}, {"time": 4807, "text": "So this is what we've been gaslit into our culture war framework of politics."}, {"time": 4813, "text": "And the reason it feels so broken and awful is because it is, but there is a way out."}, {"time": 4820, "text": "It's just that nobody wants to be, it's a game of chicken, because maybe it is true."}, {"time": 4824, "text": "Maybe we would never be able to get your other democratic priorities, your Republican priorities."}, {"time": 4829, "text": "But I think that the country understands that this is fucking terrible and would be willing to support somebody who does it differently."}, {"time": 4837, "text": "There's just a lot of disincentives to not stay without, there's a lot of incentives to not stray from the traditional path."}, {"time": 4844, "text": "Yeah, is it also possible that the A students are not participating?"}, {"time": 4851, "text": "Like we drove all of the superstars away from politics."}, {"time": 4856, "text": "So like you just had this argument before."}, {"time": 4858, "text": "I mean, everything you're saying sort of rings true."}, {"time": 4866, "text": "Like this is the obvious thing to do."}, {"time": 4868, "text": "As a student of history, you can almost like tell, like, if you look at great people in history, this is what great leaders in history, this is what they did."}, {"time": 4877, "text": "It's like clean, bold action, sometimes facing crisis, but we're facing a crisis right now."}, {"time": 4884, "text": "No, we're in a crisis."}, {"time": 4885, "text": "We've been, exactly."}, {"time": 4887, "text": "So why don't we see those leaders step up?"}, {"time": 4893, "text": "I mean, you say that's kind of like, it makes sense."}, {"time": 4896, "text": "There's a lot of different interests at play."}, {"time": 4899, "text": "You don't wanna risk too many things, so on and so forth."}, {"time": 4901, "text": "But that sounds like the C students."}, {"time": 4905, "text": "I don't think it's that."}, {"time": 4907, "text": "I think it's that the pipeline of politician creation is just totally broken from beginning to end."}, {"time": 4914, "text": "So it's not that A students don't wanna be politicians."}, {"time": 4919, "text": "It's basically the way that our current primary system is constructed, is what is the greatest threat to you as a member of Congress?"}, {"time": 4927, "text": "It's not losing your reelection."}, {"time": 4930, "text": "It's losing your primary, right?"}, {"time": 4933, "text": "So that means, especially in a safe district, you're most concerned about being hit if you're a Republican from the right, and if you're a Democrat from the left for not being a good enough one."}, {"time": 4942, "text": "That's actually what stops people, heterodox people in particular, from winning primaries because the people who vote in our primaries are the party faithful."}, {"time": 4952, "text": "That's how you get the production."}, {"time": 4955, "text": "It's important to understand the production pipeline, which is that, all right, I'm from Texas, so that's what I know best."}, {"time": 4960, "text": "So it's like, if you think in Texas, if you're a more heterodox like state legislature or something who works with the left on this and does that, you're gonna get your ass beat in a Republican primary because they're gonna be like, he worked with the left to do this, blah, blah, take it out of context, and you're screwed."}, {"time": 4978, "text": "And then that means you never ascend up the next level of the ladder, and then so on and so forth all the way."}, {"time": 4985, "text": "But I do think Trump changed everything."}, {"time": 4988, "text": "This is why I have some hope, which is that he showed me that all the people I listened to were totally wrong about politics, and that's the most valuable lesson you could ever teach me, which was, I was like, wait, I don't really have to listen to these people."}, {"time": 5002, "text": "I'm like, they don't know anything, actually."}, {"time": 5004, "text": "That's powerful, man."}, {"time": 5006, "text": "I'm like, he did it."}, {"time": 5007, "text": "This guy."}, {"time": 5008, "text": "Even if he didn't do anything with it."}, {"time": 5013, "text": "He showed that it's possible."}, {"time": 5015, "text": "And that means a lot."}, {"time": 5020, "text": "There's young people right now that kind of look, turn around and like, huh."}, {"time": 5024, "text": "You're like, wait, I don't have to comb my hair a certain way and go to law school and be an asshole who everybody knows is an asshole."}, {"time": 5032, "text": "And then get elected to state legislature."}, {"time": 5035, "text": "I mean, look, who's the number one person in the New York City primary right now?"}, {"time": 5041, "text": "Andrew Yang."}, {"time": 5042, "text": "He's polling higher than everybody else in the race."}, {"time": 5045, "text": "Look, maybe the polls are totally fucked and maybe he'll lose because of ranked choice voting and all of that."}, {"time": 5050, "text": "But I consider Andrew, I mean, I know him a little bit and I've followed his candidacy from the very beginning."}, {"time": 5055, "text": "I consider him an inspiration."}, {"time": 5056, "text": "He's the new generation of politics."}, {"time": 5059, "text": "Like if I see who's gonna be president 20 years from now, it's gonna be, I'm not saying it's gonna be Andrew Yang."}, {"time": 5064, "text": "I think it's gonna be somebody like Andrew Yang outside the political system who talks in a totally different way, right?"}, {"time": 5071, "text": "Just a completely, one of my favorite things that he said on the debate stage, he's like, look at us, we're all wearing makeup."}, {"time": 5077, "text": "It's crazy, you know?"}, {"time": 5078, "text": "And he like, he like brought that, that he brought that."}, {"time": 5082, "text": "And he's writing like, yeah, why are they all wearing makeup?"}, {"time": 5084, "text": "He probably arguably hasn't gone far enough almost."}, {"time": 5088, "text": "But he showed that it's possible."}, {"time": 5090, "text": "And then you see other, like AOC is a good example of somebody, at least in my opinion, is doing the same kind of thing, but going too far in like, well, I don't know, she's doing the Trump thing, but on the other side."}, {"time": 5102, "text": "So I don't know, what's too far?"}, {"time": 5105, "text": "Don't take a normative judgment of it."}, {"time": 5106, "text": "I will tell you the future of politics looks like AOC."}, {"time": 5107, "text": "Appreciate the art of it."}, {"time": 5108, "text": "Right, no, I do."}, {"time": 5109, "text": "Look, I don't, I'm not a big AOC fan, but she's a genius, media genius, once in a generation talent."}, {"time": 5116, "text": "The way that she uses social media, Instagram, and everybody on the right is like trying to copy her."}, {"time": 5121, "text": "Like Matt Gaetz is like, I want to be the conservative AOC."}, {"time": 5124, "text": "I'm like, it's just not going to happen, dude."}, {"time": 5125, "text": "Like you just don't have it."}, {"time": 5127, "text": "Like what she has, it's like, it's electric."}, {"time": 5129, "text": "And Trump had that."}, {"time": 5131, "text": "Like I've been to a Trump rally, like to cover as a journalist, and there's nothing like it in America."}, {"time": 5137, "text": "And Yang is similar."}, {"time": 5139, "text": "It's the same way where you're like, there is something going on here, which is just like, I've been doing Obama rally."}, {"time": 5145, "text": "I've been to a Clinton rally."}, {"time": 5147, "text": "I've been to several normal politics."}, {"time": 5150, "text": "It's fine, you know, with Trump and with Yang, it was, it's another world."}, {"time": 5156, "text": "It's another world."}, {"time": 5157, "text": "Yeah, Yang gang."}, {"time": 5157, "text": "There's probably thousands of people listening right now, who are just like doing a slow clap."}, {"time": 5166, "text": "Okay, but yeah, I mean, my worst fear, I prefer Andrew Yang kind of free improvisational idea, exchange, all that versus AOC, who I think no matter what she stands for is a drama machine, creates dramas just like Trump does."}, {"time": 5189, "text": "I would say my worst fear would be in 2024, is AOC old enough?"}, {"time": 5194, "text": "It'd be AOC versus Trump."}, {"time": 5196, "text": "I don't think she's old enough."}, {"time": 5197, "text": "I think you'd have to be, I don't know."}, {"time": 5198, "text": "I think she's 30."}, {"time": 5199, "text": "So she needs five more years."}, {"time": 5200, "text": "So probably not."}, {"time": 5202, "text": "Okay, but that kind of, that's, or Trump Jr. Well, AOC probably wouldn't win a Democratic primary."}, {"time": 5207, "text": "So, I mean, look, Joe Biden is, you know, he's pretty much showed that."}, {"time": 5210, "text": "That's exactly what you're saying."}, {"time": 5212, "text": "This process grooms you over time."}, {"time": 5215, "text": "You see the same thing in academia actually, which is very interesting, is the process of getting tenure."}, {"time": 5222, "text": "There's this, it's like you're being taught without explicitly being taught to behave in the way that everybody's behaved before."}, {"time": 5234, "text": "I've heard this, it was funny."}, {"time": 5235, "text": "I've had a few conversations that were deeply disappointing, which involved statements like, this is what's good for your career."}, {"time": 5248, "text": "This kind of conversation, almost like mentor to mentee conversation, or it's like, there's a grooming process in the same way."}, {"time": 5256, "text": "I guess you're saying the primary process does the same kind of thing."}, {"time": 5260, "text": "So, I mean, that's what people have talked about with Andrew Yang."}, {"time": 5263, "text": "He was being suppressed by a bunch of different forces, the mainstream media and all."}, {"time": 5268, "text": "Just the Democratic, just that whole process didn't like the honesty that he was showing, right?"}, {"time": 5275, "text": "For now, but here's my question to you."}, {"time": 5277, "text": "People gotta see, look, Jordan Peterson is one of the most famous people in America, right?"}, {"time": 5281, "text": "Like you have a massive podcast."}, {"time": 5283, "text": "You're more famous than half, 99% of the people at MIT."}, {"time": 5287, "text": "So like, from that perspective, everything has changed."}, {"time": 5290, "text": "And somewhere out there, there's a student who's taking notice."}, {"time": 5294, "text": "And I've noticed that with my own career, everybody thought I was crazy for doing this show with Crystal, The Hill."}, {"time": 5299, "text": "They thought I was nuts."}, {"time": 5299, "text": "They're like, what are you doing?"}, {"time": 5301, "text": "You're a White House correspondent."}, {"time": 5302, "text": "You've got a job forever."}, {"time": 5304, "text": "The other job offer I had was being a White House correspondent."}, {"time": 5307, "text": "And people thought I was nuts for not just sticking there and aging out within Washington, pining for appearances on Fox News and CNN and MSNBC."}, {"time": 5319, "text": "But I hated it."}, {"time": 5320, "text": "I just hated doing it."}, {"time": 5321, "text": "I did not wanna be a company man, like a Washington man, who's one of those guys who like brags to his friends about how many times he's been on Fox or whatever, mostly because I just have a rebellious streak and I hate being at the subject of other people."}, {"time": 5335, "text": "I created something new, which a lot of people watch to get their news."}, {"time": 5338, "text": "And I noticed that younger people who are almost all my audience, they don't really look up to any of the people in traditional, right?"}, {"time": 5346, "text": "They don't go and they're not coming up and being like, how do I be like Jim Acosta?"}, {"time": 5350, "text": "You know, they're like, hey, how did you do what you do?"}, {"time": 5353, "text": "And the way you did it is by bucking the system."}, {"time": 5356, "text": "So I think that we are at a total split point."}, {"time": 5360, "text": "And look, there will always be a path for people."}, {"time": 5363, "text": "Cause like, I don't want people to over learn this lesson."}, {"time": 5366, "text": "I have people who are like, I'm not gonna go to college."}, {"time": 5367, "text": "And I'm like, well, just wait."}, {"time": 5369, "text": "Yeah, like, I'm like, just like stop, just like, just hold on a second."}, {"time": 5374, "text": "But there will always be a path for the institutional that will always be there for you."}, {"time": 5379, "text": "But now there's something else."}, {"time": 5380, "text": "Now there's another game in town."}, {"time": 5382, "text": "And that's more appealing to millions and millions and millions and millions of people who feel unserved by the corporate media, CNN and these people, possibly who feel unserved in the, you know, the faculty."}, {"time": 5396, "text": "Like if you are an up and comer who wants to teach as many young people as possible, I think you should be on YouTube, right?"}, {"time": 5404, "text": "Like look at the Khan Academy guy, that guy created a huge business."}, {"time": 5407, "text": "So I just think we can be cynical and like upset about what that system is, but we should also have hope."}, {"time": 5414, "text": "Like I have a lot of hope for what can be in the future."}, {"time": 5416, "text": "Yeah, there's a guy people should check out."}, {"time": 5418, "text": "So my story is a little bit different because I basically stepped aside with the dream of being an entrepreneur earlier in the pipeline than like a legitimate, like senior faculty would."}, {"time": 5434, "text": "There's an example of somebody people should check out, Andrew Huberman from Stanford, who's a neuroscientist, who's as world class as it gets in terms of like 10 year faculty, just a really world class researcher."}, {"time": 5448, "text": "And now he's doing YouTube."}, {"time": 5450, "text": "Yeah, I see him on Instagram."}, {"time": 5452, "text": "And he's great."}, {"time": 5453, "text": "So he not just does Instagram, he now has a podcast and he's changing the nature of like, I believe that Andrew might be the future of Stanford."}, {"time": 5464, "text": "And for a lot, it's funny, like he's basically, Joe Rogan is an inspiration to Andrew and to me as well."}, {"time": 5473, "text": "And those ripple effects and Andrew is an inspiration probably just like you're saying to these young, like 25 year olds who are soon to become faculty, if we're just talking about academia."}, {"time": 5483, "text": "And the same is probably happening with government is, funny enough, Trump probably is inspiring a huge number of people who are saying, wait a minute, I don't have to play by the rules."}, {"time": 5496, "text": "And I can think outside the box here and you're right."}, {"time": 5500, "text": "And the institutions we're seeing are just probably lagging behind."}, {"time": 5504, "text": "So the optimistic view is the future is going to be full of exciting new ideas."}, {"time": 5510, "text": "So Andrew Young is just kind of the beginning of this whole thing."}, {"time": 5512, "text": "He's the tip of the iceberg."}, {"time": 5514, "text": "And I hope that iceberg doesn't, it's not this influencer."}, {"time": 5517, "text": "One of the things that really bothers me, I've gotten the chance, I should be careful here."}, {"time": 5523, "text": "I don't wanna, I love everybody, but these people who talk about like, how to make your first million or how to succeed."}, {"time": 5533, "text": "And they're so, I mean, yeah, that makes me a little bit cynical about, I'm worried that the people that win the game of politics will be ones that want to win the game of politics."}, {"time": 5549, "text": "They are, they are, man."}, {"time": 5551, "text": "And like we mentioned, AOC, I hope they optimize for the 80% populist thing, right?"}, {"time": 5559, "text": "Like they optimize for that bad thing, that history will remember you as the great man or woman that did this thing, versus how do I maximize engagement today and keep growing those numbers?"}, {"time": 5571, "text": "The influencers are so, I'm so allergic to this, man."}, {"time": 5576, "text": "They keep saying how many followers they have on the different accounts."}, {"time": 5580, "text": "And it's like, I don't think they understand."}, {"time": 5584, "text": "Maybe I don't understand."}, {"time": 5587, "text": "I think it has destructive psychological effects."}, {"time": 5593, "text": "One, like thinking about the number, like getting excited, your number went from 100 to 101 and being like, and today went out to 105."}, {"time": 5603, "text": "Whoa, that's a big jump."}, {"time": 5604, "text": "Then maybe like thinking this way, like I wonder what I did, I'll do that again."}, {"time": 5608, "text": "In this way, one, it creates anxiety and those psychological effects, whatever."}, {"time": 5614, "text": "The more important thing is it prevents you from truly thinking boldly in the long arc of history and creatively, thinking outside the box, doing huge actions."}, {"time": 5628, "text": "And I actually, my optimism is in the sense that that kind of action will beat out all the influencers."}, {"time": 5634, "text": "Well, I don't know, Lex, this is where my cynicism comes in."}, {"time": 5638, "text": "So there's a guy, Madison Cawthorn, the youngest member of Congress."}, {"time": 5642, "text": "And he, I don't want to say got caught, but there was like an email where he was like, my staff is only oriented around comms."}, {"time": 5651, "text": "Like he was basically saying, he got basically caught saying like, my staff is only centered on communications."}, {"time": 5659, "text": "And that's the right play."}, {"time": 5661, "text": "If you do want to get the benefits of our current electoral political and engagement system, which is that what's the best way to be known within the right as a right wing politician."}, {"time": 5672, "text": "It's to be a culture warrior, go on Ben Shapiro's podcast, be one of the people on Fox News, go on Sean Hannity's show, go on Tucker's show and all of that, because you become a mini celebrity within that world."}, {"time": 5686, "text": "Left unsaid is that that world is increasingly shrinking portion of the American population."}, {"time": 5692, "text": "And they barely, they can't even win a popular vote election, let alone barely win, eke out an electoral college victory in 2016."}, {"time": 5701, "text": "Well, but the incentives are all aligned within that."}, {"time": 5704, "text": "And it's the same thing really on the left, but you're right, which is that, ultimately, and look, this is why geniuses are geniuses because they buck the short term incentives."}, {"time": 5715, "text": "They focus on the long term, they bet big and they usually fail."}, {"time": 5719, "text": "But then when they get big, they succeed spectacularly."}, {"time": 5724, "text": "The people I know who have done this the best are like a lot of the crypto folks that I've spoken to."}, {"time": 5730, "text": "Like some of the stuff they say, I'm like, I don't know if that's gonna happen, but look, they're like billionaires, right?"}, {"time": 5736, "text": "And you're like, so they were right."}, {"time": 5738, "text": "The way I've heard it expressed is you can be wrong a lot, but when you're right, you get right big."}, {"time": 5745, "text": "And I mean, I've seen this in Elon Musk's career."}, {"time": 5747, "text": "I mean, he took spectacular risk, like spectacular risk and just doubled down, doubled down, doubled down, doubled down, doubled down."}, {"time": 5756, "text": "And you can kind of tell to him, I mean, you know him better than I do, but like from my observation, I don't think the money matters, right?"}, {"time": 5763, "text": "I just, like when I see him, I'm like, I don't, nobody works as hard as you do and builds the way that you build if it's just about the money."}, {"time": 5772, "text": "It just doesn't happen."}, {"time": 5773, "text": "Like nobody wills SpaceX into existence just for the money."}, {"time": 5778, "text": "Like it's not worth it, frankly, right?"}, {"time": 5779, "text": "Like he probably destroyed years of his life and like mental sanity."}, {"time": 5783, "text": "Money or attention or fame, none of that."}, {"time": 5786, "text": "It's not the primary priority."}, {"time": 5786, "text": "Well, that's what's so appealing to me, to me in particular about him, just like in how he built."}, {"time": 5791, "text": "Like I read a biography of him and just like the way that he constructed his life and like we're able to hyperfocus in meeting after meeting and drill down and also hire all the right people who execute each one of his tasks discreetly to his perfection is amazing."}, {"time": 5805, "text": "Like that's actually the mark of a good leader."}, {"time": 5808, "text": "But I mean, if you think about his career, the reason he's a renegade is cause probably he was told to like put it in an index fund or whatever."}, {"time": 5815, "text": "Like whenever he made his like 29 million and from PayPal, I don't know how much he made."}, {"time": 5819, "text": "And then just go along that road and he's like, no."}, {"time": 5821, "text": "So he succeeds spectacularly."}, {"time": 5824, "text": "So you have to have somebody who's willing to come in and buck that system."}, {"time": 5828, "text": "So for now, I think our politics are generally frozen."}, {"time": 5832, "text": "I think that that model is gonna be most generally appealing to the mean person, but somebody will come along and we'll change everything."}, {"time": 5840, "text": "Yeah, I'm just surprised there's not more of them."}, {"time": 5843, "text": "On that topic, it's now 20, what is it, 21?"}, {"time": 5848, "text": "Let's make some predictions that you can be wrong about."}, {"time": 5853, "text": "What major political people are you thinking will run in 2024, including Trump, junior, senior, or Ivanka?"}, {"time": 5866, "text": "Any Trump."}, {"time": 5867, "text": "Trump."}, {"time": 5869, "text": "And who do you think wins?"}, {"time": 5872, "text": "I think Joe Biden will run again in 2024."}, {"time": 5876, "text": "And I think he will run against someone with the last name Trump."}, {"time": 5879, "text": "I do not know whether that is Trump or Trump junior, but I think one of those people will probably be the GOP nominee in 2024. Who is it?"}, {"time": 5889, "text": "Some prominent political figure, was it Romney?"}, {"time": 5891, "text": "Somebody like that said that Trump will win the primary if he runs again."}, {"time": 5895, "text": "Of course, that's not even a question."}, {"time": 5896, "text": "Trump is the single most popular figure in the Republican party by orders of magnitude."}, {"time": 5903, "text": "Oh, I mean, probably more, honestly."}, {"time": 5905, "text": "There was a, actually, I can tell you because I saw the data, which is that pre January 6th, it was like 54% of Republicans wanted him to run again."}, {"time": 5913, "text": "Then it went down eight points after January 6th, two days later."}, {"time": 5918, "text": "And then after impeachment, it went right back up to 54%."}, {"time": 5922, "text": "So the exact same number is in February, post impeachment vote, as it was after November."}, {"time": 5930, "text": "Now look, yeah, again, surveys, bullshit, et cetera."}, {"time": 5932, "text": "But like, that's all the data we have."}, {"time": 5934, "text": "That's what I can point you to."}, {"time": 5935, "text": "If Trump runs, he will be the nominee and he will be the 2024 nominee."}, {"time": 5940, "text": "I just don't know if he wants to."}, {"time": 5942, "text": "It really depends."}, {"time": 5944, "text": "Do you think he wins?"}, {"time": 5945, "text": "After the Trump vaccine heals all of us, do you think Trump wins?"}, {"time": 5950, "text": "It depends on how popular culture functions over the next four years."}, {"time": 5953, "text": "And I can tell you that they are, because I don't think Biden has that much to do with it."}, {"time": 5957, "text": "Because again, Trump is not a manifestation of an affirmative policy action."}, {"time": 5962, "text": "It is a defensive bulwark wall against cultural liberalism."}, {"time": 5969, "text": "So it's like, this is why it doesn't matter what Biden does."}, {"time": 5973, "text": "If there are more riots, if there is a more sense of persecution amongst people who are more lean towards conservative or like, hey, I don't know about that, that's crazy, then he very well could win."}, {"time": 5988, "text": "Okay, let's say Joe Biden doesn't run and they put up like Kamala Harris, I think he would beat her."}, {"time": 5993, "text": "I don't think there's a question that Trump would beat Kamala Harris in 2024."}, {"time": 5997, "text": "And you don't think anybody else, I don't know how the process works, you don't think anybody else on the Democratic side can take the... Well, how could you run against the sitting vice president?"}, {"time": 6007, "text": "It's like, Joe Biden has a 98% approval rating in the Democratic Party."}, {"time": 6012, "text": "If he says, she is my heir, I think enough people will listen to him in a competitive primary or a noncompetitive primary."}, {"time": 6019, "text": "And then there's all these things about how primary systems themselves are rigged, the DNC could make it known that they'll blacklist anybody who does try and primary Kamala Harris."}, {"time": 6029, "text": "And look, I mean, progressives aren't necessarily all that popular amongst actual Democrats, like we found that out during the election."}, {"time": 6037, "text": "There's an entire constituency which loves Joe Biden and Joe Biden level politics."}, {"time": 6042, "text": "And so if he tells them to vote for Kamala, I think she would probably get it."}, {"time": 6047, "text": "But again, there's a lot of game theory obviously happening."}, {"time": 6049, "text": "Well, see, I think you're talking about everything you're saying is correct about mediocre candidates."}, {"time": 6055, "text": "It feels like if there's somebody like a really strong, I don't wanna use this term incorrectly, but populist, somebody that speaks to the 80% that is able to provide bold, eloquently described solutions that are popular."}, {"time": 6075, "text": "I think that breaks through all of this nonsense."}, {"time": 6078, "text": "How do they break through the primary system?"}, {"time": 6079, "text": "Cause the problem is the primary system is not populism."}, {"time": 6082, "text": "It's primary."}, {"time": 6084, "text": "But you don't think they can tweet their way to."}, {"time": 6087, "text": "Well, you have to be willing to win a GOP primary."}, {"time": 6090, "text": "You basically have to be at, whoever wins the GOP primary, in my opinion, will be the person most hated by the left."}, {"time": 6097, "text": "One of the people, things that people forget is, you know who came in second to Trump?"}, {"time": 6101, "text": "Ted Cruz."}, {"time": 6102, "text": "And the reason why is because Ted Cruz was the second most hated guy by liberals in America."}, {"time": 6108, "text": "A second to Trump."}, {"time": 6109, "text": "They have nothing in policy in common."}, {"time": 6111, "text": "But don't you think this kind of brilliantly described system of hate being the main mechanism of our electoral choices, don't you think that just has to do with mediocre candidates?"}, {"time": 6128, "text": "Basically the field of candidates, including Trump, including everybody was just like, didn't make anyone feel great."}, {"time": 6136, "text": "It's like, really?"}, {"time": 6137, "text": "This is what we have to choose from?"}, {"time": 6139, "text": "Maybe a Mark Cuban, or like a Mark Cuban is a Democrat, or it would have to be somebody like that."}, {"time": 6149, "text": "Somebody who, because here's the thing about Trump."}, {"time": 6150, "text": "It's not just that it was Trump."}, {"time": 6152, "text": "He was so fucking famous."}, {"time": 6154, "text": "Like people don't realize he was so famous."}, {"time": 6156, "text": "Like I, even when I first met Trump, I met a couple of other presidents, but when I met Trump, even I felt like kind of starstruck."}, {"time": 6164, "text": "Cause I was like, yo, this is the guy from The Apprentice."}, {"time": 6167, "text": "I'm like, this is the dude."}, {"time": 6169, "text": "From The Apprentice?"}, {"time": 6170, "text": "Cause I'm like, my dad and I used to sit and watch The Apprentice when I was in high school."}, {"time": 6175, "text": "And then one of the guys was from College Station where I grew up and we're like, oh my God, like that guy's on The Apprentice."}, {"time": 6180, "text": "Like it was a phenomenon."}, {"time": 6182, "text": "There's like that level."}, {"time": 6183, "text": "It's kind of like when I met Joe Rogan, I'm like, holy shit, that's Joe Rogan."}, {"time": 6186, "text": "I don't feel that way when I meet Mitt Romney, or Tom Cotton, or Josh Hawley, I met all of them."}, {"time": 6191, "text": "But there's a lot of celebrities, right?"}, {"time": 6192, "text": "Do you think there's some celebrities you were not even thinking about that could step in?"}, {"time": 6195, "text": "The Rock?"}, {"time": 6196, "text": "So I was about to say, I think The Rock could do it, but does he wanna do it?"}, {"time": 6200, "text": "I mean, it's terrible."}, {"time": 6201, "text": "Like it's terrible gig."}, {"time": 6203, "text": "It's very hard to do."}, {"time": 6205, "text": "I don't know if The Rock necessarily has like the formed policy agenda."}, {"time": 6209, "text": "Cause then here's the other problem."}, {"time": 6211, "text": "What if we set ourselves up for a system where like these people keep winning, but like with Trump, they have no idea how to run a government."}, {"time": 6217, "text": "It's actually really hard, right?"}, {"time": 6218, "text": "And you have to have the knowhow and the trust to find the right people."}, {"time": 6222, "text": "This is where the genius element comes in is, you have to understand that front and you have to understand how to execute discrete tasks."}, {"time": 6232, "text": "Like this is the FDR."}, {"time": 6234, "text": "This is why it's so hard, like FDR, Lincoln, TR."}, {"time": 6238, "text": "They were who they were and they live in history and their name rings like for a reason."}, {"time": 6244, "text": "And yeah, I mean, one of the most depressing lessons I got from 2020 is at almost, it seems like in my opinion, that we over learn the lesson of our success and not of our failures."}, {"time": 6256, "text": "For example, like we have this narrative in our head that we always have the right person at the right time during crisis."}, {"time": 6263, "text": "And in some cases it was true."}, {"time": 6265, "text": "We didn't deserve Lincoln."}, {"time": 6266, "text": "We didn't deserve FDR."}, {"time": 6268, "text": "We didn't deserve a lot of presidents at times of crisis."}, {"time": 6273, "text": "But then you're like, okay, George W. Bush, 9 11, that was terrible."}, {"time": 6278, "text": "Reconstruction, Andrew Johnson, awful, right?"}, {"time": 6281, "text": "Like we had several periods in our history where the crisis was there, they were called and they did not show up."}, {"time": 6290, "text": "And I really, it hadn't happened in my lifetime except for 9 11."}, {"time": 6295, "text": "And even then you could kind of see that as an opportunity for somebody like Obama to come in and fix it."}, {"time": 6301, "text": "But then he didn't do it."}, {"time": 6302, "text": "And then Trump didn't do it."}, {"time": 6304, "text": "And you realize, I feel like our politics are most analogous to like the 1910s, like all in terms of the Gilded Age, in terms of that, remember there's that long period of presidents between like Lincoln and Teddy Roosevelt."}, {"time": 6322, "text": "We were like, wait, like who was president?"}, {"time": 6324, "text": "Like, or even TR was like an exception where you'll have like Calvin Coolidge who like, silent cow, Grover Cleveland."}, {"time": 6333, "text": "That's kind of how, if I think of us within history, I feel like we're in one of those times."}, {"time": 6338, "text": "We're just waiting."}, {"time": 6339, "text": "It feels really important to us right now."}, {"time": 6341, "text": "Like this is the most important moment in history, but it might be."}, {"time": 6344, "text": "It could just be a blip, right?"}, {"time": 6345, "text": "20, 30 year blip."}, {"time": 6346, "text": "Like when you think about who was president between 1890 and 19 before, I mean, yeah, between like 1888 and 1910."}, {"time": 6356, "text": "Like nobody really thinks about that period of America, but like that was an entire lifetime for people, right?"}, {"time": 6361, "text": "Like what did they, how did they feel about the country that they were in?"}, {"time": 6365, "text": "That's how I kind of think about where we are right now."}, {"time": 6367, "text": "It's funny to think."}, {"time": 6368, "text": "I mean, I don't want to minimize it, but like we haven't really gone through a World War II style crisis."}, {"time": 6373, "text": "So like, say that there is a crisis in like several decades of that level, right?"}, {"time": 6381, "text": "Existential risks to a large portion of the world."}, {"time": 6386, "text": "Then what will be remembered is World War II, maybe a little bit about Vietnam and then whatever that crisis is."}, {"time": 6394, "text": "And this whole period that we see as dramatic, even coronavirus."}, {"time": 6397, "text": "Even 9 11."}, {"time": 6398, "text": "Even 9 11, it's like, cause you can look at how many people died and all those kinds of things, all the drama around the war on terror and all those kinds of things."}, {"time": 6407, "text": "Maybe Obama will be remembered for being the first African American president, but then like that's, yeah, that's fascinating to think about, oh man, even Trump will be like, oh, okay, cool."}, {"time": 6420, "text": "That guy."}, {"time": 6421, "text": "Yeah, like maybe he'd be remembered as the first celebrity."}, {"time": 6428, "text": "I mean, Reagan was already a governor, right?"}, {"time": 6430, "text": "Yeah, so like the first apolitical celebrity that was, so maybe if there's more celebrities in the future, they'll say that Trump was the first person to pave the way for celebrities to win."}, {"time": 6443, "text": "Oh man, yeah."}, {"time": 6445, "text": "And yeah, I still hold that this era will probably be remembered."}, {"time": 6450, "text": "You know, people say I talk about Elon way too much, but the reality is like, there's not many people that are doing the kind of things he's doing is why I talk about it."}, {"time": 6461, "text": "I think this era, it's not necessarily Elon and SpaceX, but this era will be remembered by the new, the like of the space exploration, of the commercial of companies getting into space exploration of space travel."}, {"time": 6477, "text": "And perhaps like artificial intelligence around social media, all those kinds of things, this might be remembered for that."}, {"time": 6486, "text": "But every, all the political bickering, all that nonsense, that might be very well forgotten."}, {"time": 6491, "text": "One way to think about it is that the internet is so young."}, {"time": 6496, "text": "I think about it, so Jeff Jarvis, he's a media scholar I respect."}, {"time": 6500, "text": "He's not the only person to say this, but many others have, which is that, look, this is kind of like the printing press."}, {"time": 6505, "text": "There was a whole 30 years war because of the printing press."}, {"time": 6509, "text": "It took a long time for shit to sort out."}, {"time": 6511, "text": "I think that's where we're at with the internet."}, {"time": 6513, "text": "Like at a certain level, it disrupts everything."}, {"time": 6517, "text": "It can be very tumultuous."}, {"time": 6519, "text": "I never felt like I was living through history until coronavirus."}, {"time": 6523, "text": "Like, you know, like until we were all locked down, I was like, I'm living through history."}, {"time": 6526, "text": "Like this, there's this very overused cliche in DC where every comm staffer wants you to think that what their boss just did is history."}, {"time": 6534, "text": "And I've always been like, this isn't history."}, {"time": 6536, "text": "This is some like stupid fucking bill, you know, whatever."}, {"time": 6538, "text": "But like, that was the first time I was like, this is history, like this right here."}, {"time": 6543, "text": "Well, I was hoping, tragedy aside, that this, I wish the primaries happened during coronavirus so that we, because like, then we can see the, so, okay, here's a bunch of people facing crisis."}, {"time": 6557, "text": "It's an opportunity for a leader to step up."}, {"time": 6560, "text": "Like, I still believe the optimistic view is the game theory of like influencers will always be defeated by actual great leaders."}, {"time": 6571, "text": "So like, maybe the great leaders are rare, but I think they're sufficiently out there that they will step up, especially in moments of crisis."}, {"time": 6579, "text": "And coronavirus is obviously a crisis where like, you know, mass manufacture of tests, all kinds of infrastructure building that you could have done in 2020, there's so many possibilities for just like bold action."}, {"time": 6596, "text": "And none of that, even just, forget actually doing the action, advocating for it."}, {"time": 6604, "text": "Just saying like this, we need to do this."}, {"time": 6607, "text": "And none of that, like the speeches that Biden made, I don't even remember a single speech that Biden made because there's zero bold, I mean, their strategy was to be quiet and let Donald Trump."}, {"time": 6621, "text": "Polarize the electorate."}, {"time": 6623, "text": "Polarize the electorate and hope that results in them winning because of the high unemployment numbers and all those kinds of things, as opposed to like, let's go big, let's go with a big speech."}, {"time": 6636, "text": "Like, you know, that, yeah, it's a lost opportunity in some sense."}, {"time": 6642, "text": "So we talked a bunch about politics, but one of the other interesting things is that you're involved with is, or involved with defining the future of as journalism."}, {"time": 6653, "text": "I suppose you can think of podcasts as a kind of journalism, but also just writing in general, just whatever the hell the future of this thing looks like is up to be defined by people like you."}, {"time": 6665, "text": "So what do you think is broken about journalism and what do you think is the future of journalism?"}, {"time": 6671, "text": "I think the future of journalism looks much more like what we, you and I are doing here right now."}, {"time": 6677, "text": "And journalism is gonna be downstream from a culture that can be a good and a bad thing depending on how you look at it."}, {"time": 6683, "text": "We are gonna look at our media, our media is gonna look much more like it did pre mass media."}, {"time": 6691, "text": "And the way that I mean that is that back in the 18, in the 1800s in particular, especially after the invention of the telegraph when information itself was known."}, {"time": 6703, "text": "So for example, like you and I don't need to, let's say you and I are competing journalists."}, {"time": 6707, "text": "You and I are no longer competing quote unquote to tell the public X event happened."}, {"time": 6714, "text": "All journalism today is largely explaining why did X happen."}, {"time": 6721, "text": "And part of the problem with that is that that means that it's all up for partisan interpretation."}, {"time": 6728, "text": "Now you can say that that's a bad thing."}, {"time": 6729, "text": "I think it's a great thing because the highest level of literacy and news viewership in America was during the time of yellow journalism, was during the time of partisan journalism."}, {"time": 6742, "text": "Not a surprise."}, {"time": 6743, "text": "People like to read the news from people that they agree with."}, {"time": 6746, "text": "You could say that's bad, echo chambers, et cetera."}, {"time": 6749, "text": "That's the downside of it."}, {"time": 6751, "text": "The upside is more people are more educated."}, {"time": 6753, "text": "More people are interested in the news."}, {"time": 6756, "text": "So I think the proliferation of mass media, I mean, sorry, of this format of niching, of not just long form."}, {"time": 6765, "text": "Dude, I do updates on Instagram, which are five minutes."}, {"time": 6768, "text": "Are you considered like Instagram, almost even Twitter?"}, {"time": 6771, "text": "Oh, of course, Twitter."}, {"time": 6773, "text": "Twitter is where I get my news from."}, {"time": 6774, "text": "I don't read the paper."}, {"time": 6775, "text": "I have literally, Twitter is my news aggregator."}, {"time": 6777, "text": "It's called my wire where I find out about hard events."}, {"time": 6781, "text": "Like the president has departed the White House."}, {"time": 6783, "text": "But not only that, I don't know about you, but I also looked at Twitter to the exact thing you're saying, which is the response to the news, like the thoughtful sounds ridiculous, but you can be pretty thoughtful in a single tweet."}, {"time": 6795, "text": "If you follow the right people, you can get that."}, {"time": 6798, "text": "And so that is the future of media, which is that the future of media is it will be much larger amounts of people, which are famous to smaller groups."}, {"time": 6809, "text": "So Walter Cronkite's never gonna happen again, at least probably within our lifetimes, where everybody in America knows who this guy is."}, {"time": 6817, "text": "That age is over."}, {"time": 6819, "text": "I think that's a good thing because now people are gonna get the news from the people that they trust."}, {"time": 6824, "text": "Yes, some of it will be opinionated."}, {"time": 6826, "text": "I'm in my program."}, {"time": 6829, "text": "Crystal and I are like, she's coming from this view."}, {"time": 6833, "text": "I'm coming from this view."}, {"time": 6835, "text": "That's our bias when we talk about information and we're gonna talk about the information that we think is important."}, {"time": 6840, "text": "And it has garnered a large audience."}, {"time": 6842, "text": "I think that's very much where the future is gonna be."}, {"time": 6877, "text": "This will cause a total dispersion of all of that."}, {"time": 6880, "text": "The battle of our age is gonna be the guild versus the non guild."}, {"time": 6886, "text": "So like what we see right now with the New York Times and Clubhouse, this is a very, very, very, very, very intentional thing that is happening, which is that the Times talking about unfettered conversations, that's happening on Clubhouse for people who aren't aware."}, {"time": 6903, "text": "This is important because they need to be the fetters of conversation."}, {"time": 6908, "text": "They need to be the inter agent."}, {"time": 6911, "text": "That's where they get their power."}, {"time": 6912, "text": "They get their power from convincing Facebook that they are the ones who can fact check stuff."}, {"time": 6918, "text": "They are the ones who can tell you whether something is right or wrong."}, {"time": 6923, "text": "That battle over unimpeded conversation and the explosion of a format that you and I are doing really well in, and then this more consolidated one, which holds cultural power and elite power and more importantly, money, right?"}, {"time": 6937, "text": "Over you and I, that's the battle that we're all gonna play out."}, {"time": 6940, "text": "Do you think unfettered conversations have a chance to win this battle?"}, {"time": 6943, "text": "Yes, I do in the long run."}, {"time": 6945, "text": "In the long run, the internet is simply too powerful."}, {"time": 6948, "text": "But here's the mistake everybody makes."}, {"time": 6950, "text": "The New York Times will never lose."}, {"time": 6952, "text": "It will just become one of us."}, {"time": 6953, "text": "See."}, {"time": 6955, "text": "They already are."}, {"time": 6956, "text": "They are the largest."}, {"time": 6957, "text": "The daily?"}, {"time": 6957, "text": "The daily, look at the daily."}, {"time": 6958, "text": "Not even that."}, {"time": 6959, "text": "Think about it not in podcasting."}, {"time": 6961, "text": "The Times is not a mass media product."}, {"time": 6964, "text": "It is a subscription product for upper middle class largely white liberals who live the same circumstances across the United States and in Europe."}, {"time": 6975, "text": "There's nothing wrong with that."}, {"time": 6977, "text": "You can't be the paper of record when you're actually the paper of upper middle class white America."}, {"time": 6983, "text": "Your job is to report on the news from that angle and deliver them the product that they want."}, {"time": 6990, "text": "Their stock price is higher than ever."}, {"time": 6992, "text": "They're making 10 times more money than they did 10 years ago, but it comes at the cost of not having a mass application audience."}, {"time": 7001, "text": "So like when people, I think people in our space are always like, the New York Times is gonna be destroyed."}, {"time": 7006, "text": "No, it's actually even better."}, {"time": 7008, "text": "They will just become one of us."}, {"time": 7011, "text": "They're a subscription platform."}, {"time": 7013, "text": "Well, yes, in terms of the actual mechanism."}, {"time": 7014, "text": "But you know, New York Times is still, and I don't think I'm speaking about a particular sector."}, {"time": 7020, "text": "I think it, as a brand, it does have the level of credibility assigned to it still."}, {"time": 7028, "text": "There's politicization of it."}, {"time": 7031, "text": "But there's a credibility."}, {"time": 7033, "text": "Like it has much more credibility than, forgive me, than I think you and I have."}, {"time": 7039, "text": "In terms of your podcast, like people are not going to be like, they're gonna say at the New York Times versus what you said on the podcast for an opinion."}, {"time": 7053, "text": "I wonder in the sense of battles, whether on Federated Conversations, whether Joe Rogan, whether your podcast can become the, have the same level of legitimacy or the flip side, New York Times loses legitimacy to be at the same level of in terms of how we talk about it."}, {"time": 7072, "text": "It's a long battle, right?"}, {"time": 7074, "text": "It's gonna take a long time."}, {"time": 7075, "text": "And I'm saying, this is where I think the end state is going and look at what the Times is doing."}, {"time": 7079, "text": "They're leaning into podcasting for a reason, but not just podcasting as in NPR level, like here's what's happening."}, {"time": 7087, "text": "Michael Barbaro is a fucking celebrity, right?"}, {"time": 7090, "text": "The guy who does the daily."}, {"time": 7091, "text": "That guy's famous amongst these people because they're like, oh my God, I love Michael."}, {"time": 7096, "text": "Like, I love the way he does this stuff."}, {"time": 7098, "text": "Again, that's fine."}, {"time": 7099, "text": "More people are listening to the news."}, {"time": 7100, "text": "I think that's a good thing."}, {"time": 7102, "text": "And then who else do they hire?"}, {"time": 7103, "text": "Ezra Klein from Vox, Kara Swisher, also from Vox, who does Pivot, which is an amazing podcast."}, {"time": 7110, "text": "Or Jane Coaston, same thing."}, {"time": 7112, "text": "It's personalities who are becoming bundled together within this brand, right?"}, {"time": 7118, "text": "Here's, okay, maybe I'm just a hater."}, {"time": 7122, "text": "Cause I love podcasting from the beginning."}, {"time": 7125, "text": "I love Green Day before the recall, man."}, {"time": 7128, "text": "But I am bothered by it."}, {"time": 7130, "text": "Like why doesn't Kara Swisher, she's done successfully."}, {"time": 7133, "text": "I think in her own, no, she was always a part of some kind of institution."}, {"time": 7137, "text": "But she started her own thing, I think."}, {"time": 7140, "text": "It would."}, {"time": 7140, "text": "Recode, right, yeah."}, {"time": 7141, "text": "Recode, I don't know if that's her own thing."}, {"time": 7144, "text": "So she was very successful there."}, {"time": 7146, "text": "Why the hell did she join the New York Times with the new podcast?"}, {"time": 7149, "text": "Why is Michael Barbaro not do his own thing?"}, {"time": 7178, "text": "That's sad to me because it propagates old thinking, like it propagates old institutions."}, {"time": 7186, "text": "And you could say that New York Times is going to evolve quickly and so on, but I would love it if there was a mechanism for reestablishing, like for building new New York Times in terms of public legitimacy."}, {"time": 7199, "text": "And I suppose that's a wishful thinking cause it takes time to build trust in institutions and it takes time to build new institutions."}, {"time": 7208, "text": "My main thing I would say is public legitimacy as a concept is not gonna be there in mass media anymore because of the balkanization of audiences."}, {"time": 7215, "text": "I mean, think about it, right?"}, {"time": 7216, "text": "Like this is like Lesion, the classic stuff around a thousand true fans, or no, sorry, like a hundred true fans even now."}, {"time": 7224, "text": "Like you can make a living on the internet just talking to a hundred people."}, {"time": 7227, "text": "If as long as they're all high frequency traders, some of the highest paid people on substack, they don't have that many subs."}, {"time": 7234, "text": "It's just that they're Wall Street guys, right?"}, {"time": 7236, "text": "So people pay a lot of money."}, {"time": 7237, "text": "Again, that's great."}, {"time": 7238, "text": "So what you will have is an increasing balkanization of the internet, of audiences and of niches."}, {"time": 7246, "text": "People will become increasingly famous within us."}, {"time": 7248, "text": "You will become astoundingly famous."}, {"time": 7251, "text": "I'm sure you've noticed this with your fan base."}, {"time": 7252, "text": "I certainly have with mine."}, {"time": 7253, "text": "Like 99% of people have no idea who I am, but when somebody meets, they're like, oh my God, I watch your show every day, right?"}, {"time": 7261, "text": "Like it's the only thing I watch for news, right?"}, {"time": 7264, "text": "Like instead of casually famous, if that makes sense, but like, oh yeah, it's like Alec Baldwin, you know?"}, {"time": 7269, "text": "Whoa, shit, that's Alec Baldwin."}, {"time": 7270, "text": "But you're not like, oh shit, I love you Alec Baldwin."}, {"time": 7274, "text": "This is a Ben Smith of the New York Times, actually he wrote this column."}, {"time": 7277, "text": "He's like, the future is everybody will be famous, but only to a small group of people."}, {"time": 7282, "text": "And I think that is true."}, {"time": 7284, "text": "But again, I don't decry it."}, {"time": 7286, "text": "I think it's great because I think that the more that that happens, the more engaged people will be and it empowers different voices to be able to come in and then possibly, I wouldn't say destroy, but compete against."}, {"time": 7297, "text": "I mean, look at Joe."}, {"time": 7299, "text": "Joe is more powerful than CNN and MSNBC and Fox all put together."}, {"time": 7305, "text": "That gives me like immense inspiration."}, {"time": 7307, "text": "Like he created the space for me to succeed."}, {"time": 7310, "text": "And I told him that when I met him, I was like, dude, like I listened to his podcast when I was like young."}, {"time": 7315, "text": "And like, and I remember like when I got to meet him and all that, and I told him this on this pod, I was like, I didn't know people were millions were willing to listen to a guy talk about chimps for three straight hours, including me."}, {"time": 7328, "text": "I didn't know that I could be one of those people."}, {"time": 7330, "text": "I learned something about myself from his show, yeah."}, {"time": 7332, "text": "And so by creating that space, I'd be like, wait, there's a hunger here."}, {"time": 7337, "text": "Like he showed us all the way and none of us will ever again be as famous as Rogan because he was the first and that's fine because he created the umbrella ecosystem for us all to thrive."}, {"time": 7349, "text": "That is where I see like a great amount of hope within that story."}, {"time": 7353, "text": "Yeah, and the cool thing, he also supports that ecosystem."}, {"time": 7355, "text": "He's such a."}, {"time": 7355, "text": "He's so generous."}, {"time": 7358, "text": "One of the things he paved the way out for me is to show that you can just be honest, publicly honest, and not jealous of other people's success, but instead be supportive and all those kinds of things, just like loving towards others."}, {"time": 7376, "text": "He's been an inspiration."}, {"time": 7377, "text": "I mean, to the comics community, I think there are a bunch of, before that, I think there were all a bunch of competitive haters towards each other."}, {"time": 7387, "text": "Yeah, and now he's like just injected love."}, {"time": 7391, "text": "They're like, they're still like many are still resistant, but they're like, they can't help it because he's such a huge voice."}, {"time": 7397, "text": "He like forces them to be like loving towards each other."}, {"time": 7400, "text": "And the same, I tried to, one of the reasons I wanted to start this podcast was to try to, I wanted to be like do what Joe Rogan did, but for the scientific community, like my little circle of scientific community of like, like let's support each other."}, {"time": 7418, "text": "Yeah, well, like Avi Loeb, I would have no idea who he was if it wasn't for you."}, {"time": 7422, "text": "I mean, I assume you put him in touch with Joe."}, {"time": 7424, "text": "He went on Joe's show."}, {"time": 7425, "text": "I had him on my show."}, {"time": 7426, "text": "Like millions of people would have no idea who he was if it wasn't for you."}, {"time": 7430, "text": "Just by the way, in terms of deep state and shadow government, Avi Loeb has to do with aliens."}, {"time": 7434, "text": "You better believe Joe."}, {"time": 7436, "text": "Dude, the last thing I sent to him was the American Airlines audio."}, {"time": 7440, "text": "Did you see that?"}, {"time": 7442, "text": "The pilots who were, oh my God, dude, this is amazing."}, {"time": 7444, "text": "So like, this American Airlines flight crew was over New Mexico, this happened five or six days ago."}, {"time": 7452, "text": "And the guy comes and he goes, hey, do you have any targets up here?"}, {"time": 7456, "text": "A large cylindrical object just flew over me."}, {"time": 7460, "text": "Okay, so this happens, so this happens."}, {"time": 7463, "text": "Then a guy or like a radio catcher records this and posts it online."}, {"time": 7468, "text": "American Airlines confirms that this is authentic audio."}, {"time": 7473, "text": "And they go, all further questions should be referred to the FBI."}, {"time": 7477, "text": "So then, okay, American Airlines just confirmed it's a legitimate transmission."}, {"time": 7481, "text": "FBI, then the FAA comes out and says, we were tracking no objects in the vicinity of this plane at the time of the transmission."}, {"time": 7492, "text": "So the only plausible explanation that online sleuths have been able to say is maybe he saw a Learjet, which was, you know, using like open source data."}, {"time": 7502, "text": "FAA rules that out."}, {"time": 7503, "text": "So what was it?"}, {"time": 7505, "text": "He saw a large cylindrical object."}, {"time": 7507, "text": "While he was mid flight, American Airlines, but you can go online, listen to the audio yourself."}, {"time": 7512, "text": "This is a 100% no shit transmission confirmed by American Airlines of a commercial pilot over New Mexico, seeing a quote unquote, large cylindrical object in the air."}, {"time": 7526, "text": "Like I said, when we first started talking, I've never believed more in UFOs and aliens."}, {"time": 7531, "text": "Yeah, this is awesome."}, {"time": 7533, "text": "I just wish both American Airlines, FBI, and government would be more transparent."}, {"time": 7540, "text": "Like there would be voices, and I know it sounds ridiculous, but the kind of transparency that you see, maybe not Joe Rogan, he's like overly transparent."}, {"time": 7548, "text": "He's just a comic really, but just the, I don't know, like a podcast from the FBI, just like being honest, like excited, confused."}, {"time": 7558, "text": "I'm sure that they're being overly cautious about their release information."}, {"time": 7564, "text": "I'm sure there's a lot of information that would inspire the public, that would inspire trust in institutions that will not damage national security."}, {"time": 7572, "text": "Like it seems to me obvious, and the reason they're not sharing it is because of this momentum of bureaucracy, of caution and so on."}, {"time": 7579, "text": "But there's probably so much cool information that the government has."}, {"time": 7582, "text": "The way I almost, I wouldn't say it confirmed it's real, but Trump didn't declassify it."}, {"time": 7588, "text": "Like you know that if there was ever a president that actually wanted to get to the bottom of it, it was him."}, {"time": 7594, "text": "I mean, he didn't declassify it, man."}, {"time": 7597, "text": "And people begged him to."}, {"time": 7598, "text": "I know for a fact, because I pushed to try and make this happen, that some people did speak to him about it."}, {"time": 7604, "text": "And he was like, no, I'm not gonna do it."}, {"time": 7607, "text": "He might be afraid."}, {"time": 7608, "text": "That's what I mean, though."}, {"time": 7609, "text": "They were probably all telling him, they're like, sir, you can't do this, you know, all this, like, wow, and I get that."}, {"time": 7613, "text": "And there's this legislation written at COVID that like they have six months to release it, man."}, {"time": 7618, "text": "Is that real?"}, {"time": 7620, "text": "Is that a bunch of bullshit?"}, {"time": 7621, "text": "I think it's bullshit."}, {"time": 7621, "text": "There's so many different levels of classification that people need to understand."}, {"time": 7625, "text": "I mean, look, I read John Podesta."}, {"time": 7627, "text": "He was the chief of staff to Bill Clinton."}, {"time": 7630, "text": "He's a big UFO guy."}, {"time": 7631, "text": "He tried."}, {"time": 7632, "text": "Like him and Clinton tried to get some of this information and they could not get any of it."}, {"time": 7637, "text": "And we're talking about the president and the White House chief of staff."}, {"time": 7641, "text": "Well, there's a whole bureaucracy, but just like you were saying, with intent."}, {"time": 7644, "text": "You have to be like, that has to be your focus because there's a whole bureaucracy built around secrecy for probably for a good reason."}, {"time": 7651, "text": "So to get through to the information, there's a whole like paperwork process, all that kind of stuff."}, {"time": 7656, "text": "You can't just walk in and get the, unless again, with intention, that becomes your thing."}, {"time": 7660, "text": "Like let's revolutionize this thing."}, {"time": 7663, "text": "And then you get only so many things."}, {"time": 7665, "text": "It's sad that the bureaucracy has gotten so bulky, but I think the hopeful messages from earlier in our conversation, it seems like a single person can't fix it, but if you hire the right team, it feels like you can."}, {"time": 7681, "text": "Can't fix everything."}, {"time": 7683, "text": "I don't wanna give people unrealistic expectations."}, {"time": 7685, "text": "You can fix a lot, especially in crisis, you can remake America."}, {"time": 7690, "text": "And the reason I know that is because it's already happened twice."}, {"time": 7692, "text": "FDR, or in modern history, FDR and JFK."}, {"time": 7697, "text": "Sorry, FDR and JFK's assassination, LBJ."}, {"time": 7700, "text": "Two hyper competent men who understood government, who understood personnel, and coincidentally were friends."}, {"time": 7709, "text": "I don't think actually people understand this."}, {"time": 7711, "text": "FDR met Johnson three days after he won his election to Congress, special election."}, {"time": 7718, "text": "He was only 29 years old."}, {"time": 7720, "text": "And he left that meeting and called somebody and said, this young man is gonna be president of the United States someday."}, {"time": 7726, "text": "Like even then, like what was within him to understand and to recognize that."}, {"time": 7731, "text": "And sometimes Johnson, as a young member of Congress, would come and have breakfast with FDR, like just to the great political minds of the 20th century, just sitting there talking."}, {"time": 7741, "text": "Like I would give anything to know what was happening."}, {"time": 7744, "text": "Yeah, I hope they were real with each other."}, {"time": 7746, "text": "And there was like a genuine human connection, right?"}, {"time": 7748, "text": "That seems to be the... Well, Johnson wasn't a genuine guy, so probably certainly not."}, {"time": 7753, "text": "Well, I need to read those thousands of pages."}, {"time": 7756, "text": "I've been way too focused on Hitler."}, {"time": 7760, "text": "I was gonna say, one of my goals in coming to this is I was like, I gotta get Lex into two things, because I know he'll love it."}, {"time": 7765, "text": "I know he'll love LBJ, if he takes the time to read the books."}, {"time": 7771, "text": "He's the most... Of all the presidents..."}, {"time": 7772, "text": "I didn't say you'll love him, but you'll love the books about him."}, {"time": 7774, "text": "Because the books are a story of America, the story of politics, the story of power."}, {"time": 7779, "text": "This is the guy who wrote the Power Broker."}, {"time": 7781, "text": "These books are up there with Decline and Follow the Roman Empire by Edward Gibbon, in terms of how power works."}, {"time": 7788, "text": "Study of power."}, {"time": 7790, "text": "No, that's why Carroll wrote the books."}, {"time": 7814, "text": "But he's overlooked for so many of the incredible things that he did with civil rights."}, {"time": 7819, "text": "Nobody else could have done it."}, {"time": 7821, "text": "No one else could have gotten it done."}, {"time": 7823, "text": "And the second thing is, we gotta get you into World War I."}, {"time": 7827, "text": "We gotta get you more into World War I, because I think that's a rabbit hole, which I know you're a Dan Carlin fan."}, {"time": 7833, "text": "So blueprint for Armageddon."}, {"time": 7835, "text": "Yeah, it's good."}, {"time": 7837, "text": "But there's fewer evil people there."}, {"time": 7839, "text": "Yes, but..."}, {"time": 7841, "text": "But that's what actually..."}, {"time": 7843, "text": "There's a banality of that evil, of the Kaiser and of the Austro Hungarians."}, {"time": 7850, "text": "And of... See, I like World War I more because it was unresolved."}, {"time": 7854, "text": "It's one of those periods I was talking to you about, about sometimes you're called and you fail."}, {"time": 7859, "text": "I mean, 50 million people were killed in the most horrific way."}, {"time": 7863, "text": "People literally drowned in the mud, like an entire generation."}, {"time": 7869, "text": "One stat I love is that, Britain didn't need a draft till 1916."}, {"time": 7874, "text": "Like they went two years of throwing people into barbed wire voluntarily."}, {"time": 7880, "text": "And because people love their country and they love the king, and they thought they were going against the Kaiser."}, {"time": 7886, "text": "It's just like that conflict to me, I just can't read enough about it."}, {"time": 7890, "text": "Also just like births Russian Revolution, you know."}, {"time": 7893, "text": "Yeah, I mean... Hitler."}, {"time": 7895, "text": "You can't talk about World War II without World War I."}, {"time": 7897, "text": "And I'm obsessed with the conflict."}, {"time": 7899, "text": "I've read way too many books about it."}, {"time": 7900, "text": "For this reason is, it's unresolved."}, {"time": 7902, "text": "And like the roots of so much of even our current problems are happened in Versailles, right?"}, {"time": 7907, "text": "Like Vietnam is because of the Treaty of Versailles."}, {"time": 7911, "text": "Many ways the Middle Eastern problems and the division of the states there."}, {"time": 7915, "text": "The Treaty of Versailles in terms of the penalties against Germany."}, {"time": 7918, "text": "But also they fall out from those wars on the French and the German population, or the French and the British populations and their reluctance for war in 1939 or 1938."}, {"time": 7930, "text": "When Neville Chamberlain goes, right?"}, {"time": 7932, "text": "Like that's one of the things people don't understand is the actual appetite of the British public at that time."}, {"time": 7936, "text": "They didn't want to go to war."}, {"time": 7937, "text": "Only Churchill, he was the only one in the gathering storm, right?"}, {"time": 7941, "text": "Like being like, hey, this is really bad and all of that."}, {"time": 7944, "text": "And then even in the United States, our streak of isolationism, which sweat."}, {"time": 7948, "text": "I mean, things were because of that conflict."}, {"time": 7952, "text": "We were convinced as a country that we wanted nothing to do with Europe and its problems."}, {"time": 7957, "text": "And in many ways that contributed to the proliferation of Hitler and more."}, {"time": 7961, "text": "So like I'm obsessed with World War I for this reason, which is that it's just like the root."}, {"time": 7966, "text": "It's like the culmination of the monarchies, then the fall, and then just all the shit spills out from there for like a hundred years."}, {"time": 7973, "text": "So World War I is like the most important shift in human history versus World War II is like a consequence of that."}, {"time": 7980, "text": "Yeah, so I have a degree in security studies from Georgetown."}, {"time": 7983, "text": "And one of the thing is that we would focus a lot on that is like war and, but also like the complexity around war."}, {"time": 7991, "text": "And it's funny."}, {"time": 7992, "text": "We never spent that much time on World War II because it was actually quite of a clean war."}, {"time": 7997, "text": "It's a very atypical war as in the war object, which we learned from World War I is we must inflict suffering on the German people and invade the borders of Germany and destroy Hitler."}, {"time": 8010, "text": "Like the center of gravity is the Nazi regime and Hitler."}, {"time": 8014, "text": "So it had a very basic begin and end."}, {"time": 8017, "text": "Begin, liberate France, invade Germany, destroy Hitler, reoccupy, rebuild."}, {"time": 8024, "text": "World War I, what are you fighting for?"}, {"time": 8026, "text": "Like, are you, I mean, and nobody even knew."}, {"time": 8029, "text": "You can go to the German general staff."}, {"time": 8031, "text": "They were like, even in 1917, they're like, the war was worth it because now we have Luxembourg."}, {"time": 8037, "text": "Like you killed 2 million of your citizens for fucking Luxembourg and like half of Belgium, which is now like a pond."}, {"time": 8042, "text": "And same thing, the French are like, well, the French more so they're defending their borders, but like, what are the British fighting for?"}, {"time": 8049, "text": "Why did hundreds of thousands of British people die?"}, {"time": 8051, "text": "In order to preserve the balance of power in Europe and prevent the Kaiser from having a port on the English Channel?"}, {"time": 8059, "text": "Like really, that's why?"}, {"time": 8061, "text": "That's more what wars are is they become these like atypical, they become these protracted conflicts with a necessary diplomatic resolution."}, {"time": 8073, "text": "It's not clean, it's very dirty."}, {"time": 8076, "text": "It usually leads in the outbreak of another war and another war and another war and a slow burn of ethnic conflict, which bubbles up."}, {"time": 8083, "text": "So that's why I look at that one even, because it's more typical of warfare and how it works."}, {"time": 8089, "text": "Exactly, it's kind of interesting."}, {"time": 8091, "text": "You're making me realize that World War II is one of the rare wars where you can make a strong case for it's a fight of good versus evil."}, {"time": 8099, "text": "Yeah, just war theory, obviously."}, {"time": 8101, "text": "Like, yeah, they're literally slaughtering Jews."}, {"time": 8102, "text": "Like, we have to kill them."}, {"time": 8104, "text": "And there's one person doing it."}, {"time": 8105, "text": "I mean, there's one person at the core."}, {"time": 8111, "text": "And it's short and there's a clear aggression."}, {"time": 8115, "text": "It's interesting that Dan Carlin has been avoiding Hitler as well."}, {"time": 8120, "text": "Yeah, probably for this reason."}, {"time": 8123, "text": "Probably for this reason."}, {"time": 8125, "text": "I mean, but it's complicated too, because there's a pressure."}, {"time": 8128, "text": "That guy has his demons."}, {"time": 8130, "text": "I love Dan so much."}, {"time": 8131, "text": "So this is the, I don't know if you feel this pressure, but as a creative, he feels the pressure of being maybe not necessarily correct, but maybe correct in the sense that his understanding, he gets to the bottom of why something happened, of why something happened, of what really happened."}, {"time": 8157, "text": "Get to the bottom of it before he can say something publicly about it."}, {"time": 8162, "text": "And he is tortured by that burden."}, {"time": 8164, "text": "I know, you know, he takes so much shit from the historical community for no reason."}, {"time": 8169, "text": "I think he's the greatest popularizer, quote unquote, of history."}, {"time": 8173, "text": "And I wish more people in history understood it that way."}, {"time": 8177, "text": "He was an inspiration to me."}, {"time": 8178, "text": "I mean, I do some videos sometimes on my Instagram now where I'll do like a book tour."}, {"time": 8182, "text": "I'll be like, here's my bookshelf of these presidents."}, {"time": 8184, "text": "And like, here's what I learned from this book and this book and this."}, {"time": 8186, "text": "And that was very much like a skill I learned from him of being like, you know, as a historian writes."}, {"time": 8193, "text": "You know, I just love the way he talks."}, {"time": 8195, "text": "He's like, in the mud."}, {"time": 8198, "text": "I mean, you know, he'll be like, quote, quote."}, {"time": 8200, "text": "I just, I love, he inspires me, man."}, {"time": 8204, "text": "He really does to like learn more."}, {"time": 8206, "text": "And I've read, I bought a lot of books because of Dan Carlin."}, {"time": 8209, "text": "He'll be, you know, because of this guy, because of that guy, in terms of, you know, another thing he does, which nobody else, and I'm probably guilty of this, he focuses on the actual people involved."}, {"time": 8219, "text": "Like he would tell the story of actual British soldiers in World War I."}, {"time": 8224, "text": "And I probably, and maybe you're guilty of this too, we over focus on what was happening in the German general staff, what was happening in the British general staff."}, {"time": 8232, "text": "And he doesn't make that mistake."}, {"time": 8234, "text": "That's why he tells real history."}, {"time": 8236, "text": "Yeah, and it gives it a feeling."}, {"time": 8238, "text": "The result is that there's a feeling, you get the feeling of what it was like to be there."}, {"time": 8244, "text": "You know, you're becoming, quickly becoming more and more popular."}, {"time": 8250, "text": "Speaking about political issues in part, do you feel a burden, like almost like the prison of your prior convictions of having to, being popular with a certain kind of audience and thereby unable to really think outside the box?"}, {"time": 8271, "text": "I had, I've really struggled with this."}, {"time": 8274, "text": "I came up in right wing media."}, {"time": 8276, "text": "I came up a much more doctrinaire conservative in my professional life."}, {"time": 8282, "text": "I wasn't always conservative."}, {"time": 8282, "text": "We can get to that later if you want."}, {"time": 8285, "text": "And I did feel an immense pressure after the election by people to say, wanted me to say the election was stolen."}, {"time": 8297, "text": "And I knew that I had a sizable part of my audience."}, {"time": 8301, "text": "Oh, well, here's the benefit."}, {"time": 8302, "text": "Most people know me from Rising, which is with Crystal and me."}, {"time": 8306, "text": "That is inherently a left right program."}, {"time": 8309, "text": "So it's a large audience."}, {"time": 8311, "text": "So I felt comfortable and I knew that I could still be fine in terms of my numbers, whatever, because a lot, many people knew me who were on the left."}, {"time": 8320, "text": "And if really, you know, my right listeners abandoned me, so be it."}, {"time": 8351, "text": "And I just wouldn't do it."}, {"time": 8353, "text": "And that was hard, man."}, {"time": 8355, "text": "Like I feel more politically homeless right now than I ever have, but I have realized in the last couple of months that's the best thing that ever happened to me."}, {"time": 8367, "text": "It's true freedom."}, {"time": 8368, "text": "I now, I say exactly what I think."}, {"time": 8372, "text": "And it's not that I wasn't doing that before."}, {"time": 8374, "text": "It's maybe I would avoid certain topics or like I would think about things more from a team perspective of like, am I making sure that, it's, I'm not saying I didn't fight it."}, {"time": 8386, "text": "And I still, I criticize the right plenty and Trump plenty before the election and more."}, {"time": 8391, "text": "It's more just like, I no longer feel as if I even have the illusion of a stake within the game."}, {"time": 8398, "text": "I'm like, I only look at myself as an outside observer and I will only call it as I see it truly."}, {"time": 8405, "text": "And I was aspiring to that before, but I had to have, in a way, Trump stop the steal thing."}, {"time": 8413, "text": "It like took my shackles off 100%."}, {"time": 8416, "text": "Cause I was like, no, this is bullshit."}, {"time": 8417, "text": "And I'm going to say it's bullshit."}, {"time": 8418, "text": "And I think it's bad."}, {"time": 8420, "text": "And I think it's bad for the Republican party."}, {"time": 8422, "text": "And if people in the Republican party don't agree with me on that, that's fine."}, {"time": 8426, "text": "I'm just not going to be necessarily like associated with you anymore."}, {"time": 8430, "text": "This is probably one of the first political liberal politics related conversations we've had."}, {"time": 8435, "text": "I mean, unless you count Michael Malice, who."}, {"time": 8438, "text": "He was great."}, {"time": 8441, "text": "He's the funny guy."}, {"time": 8442, "text": "He's not so much political as he is like burning down, man."}, {"time": 8447, "text": "He leans too far in anarchy for me."}, {"time": 8450, "text": "I think he's."}, {"time": 8451, "text": "There's a place for that."}, {"time": 8453, "text": "It's almost, well, first of all, he's working on a new book, which I really appreciate."}, {"time": 8457, "text": "Outside of the, he's working on like a big book for a while, which is White Pill."}, {"time": 8462, "text": "He's also working on this like short little thing, which is like anarchist handbook or something like that."}, {"time": 8471, "text": "It's like Anarchy for Idiots or something like that, which I think is really."}, {"time": 8479, "text": "Well, me being an idiot and being curious about anarchy seems useful."}, {"time": 8483, "text": "So I like those kinds of books."}, {"time": 8484, "text": "That's Russian heritage, man."}, {"time": 8486, "text": "Anarchist 101."}, {"time": 8489, "text": "I find those kinds of things a useful thought experiment because that's why it's frustrating to me when people talk about communism, socialism, or even capitalism, where they can't enjoy the thought experiment of like why did communism fail and maybe ask the question of like, is it possible to make communism succeed or are there good ideas in communism?"}, {"time": 8517, "text": "Like I enjoy the thought experiment, like the discourse of it, like the reasoning and like devil's advocate and all that."}, {"time": 8524, "text": "People have like, seem to not have patience for that."}, {"time": 8527, "text": "They're like, communism bad, red."}, {"time": 8529, "text": "I was obsessed with the question and still am."}, {"time": 8531, "text": "I will never be, I will never quench my thirst for Russian history."}, {"time": 8538, "text": "I love that period of 1890 to 1925."}, {"time": 8546, "text": "It's just like, it's so fucking crazy."}, {"time": 8550, "text": "Like the autocracy embodied in Czar Alexander."}, {"time": 8555, "text": "And then you get this like weird fail son, Nicholas, who is kind of a good guy, but also terrible."}, {"time": 8562, "text": "And also Russian autocracy itself is terrible."}, {"time": 8564, "text": "And then I just became obsessed with the question of like, why did the Bolshevik revolution succeed?"}, {"time": 8569, "text": "Because like people in Russia didn't necessarily want Bolshevism."}, {"time": 8573, "text": "People suffered a lot under Bolshevism and it led to Stalinism."}, {"time": 8578, "text": "How did Vladimir Lenin do it, right?"}, {"time": 8581, "text": "Like, and I became obsessed with that question."}, {"time": 8584, "text": "And it's still, I find it so interesting, which is that series of accidents of history, incredible boldness by Lenin, incredible real politic, smart, unpopular decisions made by Trotsky and Stalin, and just like the arrogance of the Czars and of the Russian like autocracy."}, {"time": 8611, "text": "But at the same time, there's all these like cultural implications of this, right?"}, {"time": 8615, "text": "In terms of like how it became hollowed out post Catherine the Great and all that."}, {"time": 8620, "text": "I was obsessed with autocracy because Russia wasn't actual autocracy."}, {"time": 8624, "text": "And like actually, and I'm like, it was there."}, {"time": 8626, "text": "Like they didn't even remove serfdom to like the civil war in America."}, {"time": 8632, "text": "Like, you know, and nobody really talks about it."}, {"time": 8635, "text": "And I just became, yeah, I was like, was Bolshevism a natural reaction to the excesses of Czarism?"}, {"time": 8643, "text": "There is a convenient explanation where that is true."}, {"time": 8647, "text": "But there were also a series of decisions made by Lenin and Stalin to kill many of the people in the center left and marginalized them and also not to associate with the more quote unquote, like amenable communists in order to make sure that their pure strain of Bolshevism was the only thing."}, {"time": 8668, "text": "And the reason I like that is because it comes back to a point I made earlier."}, {"time": 8671, "text": "It's all about intentionality, which is that you actually can will something into existence even if people don't want it."}, {"time": 8678, "text": "That was the craziest thing."}, {"time": 8679, "text": "Like nobody wanted this, but it's still ruled for half a century, more actually."}, {"time": 8685, "text": "I mean, almost 75 years."}, {"time": 8687, "text": "To think that there could have been a history of the Soviet Union that was dramatically different than Leninism, Stalinism, that was completely different."}, {"time": 8700, "text": "Like almost would be the American story."}, {"time": 8703, "text": "Yeah, easily."}, {"time": 8704, "text": "I mean, there's a world where, and I don't have all the characters, there's like Kerensky and then there was like whoever Lenin's number two, Stalin's chief rival."}, {"time": 8712, "text": "And even, I mean, look, even a Soviet Union led by Trotsky, that's a whole other world, right?"}, {"time": 8717, "text": "Like literally a whole other world."}, {"time": 8719, "text": "And yeah, it's just, I don't know."}, {"time": 8721, "text": "I find it so interesting."}, {"time": 8722, "text": "I will never not be fascinated by Russia."}, {"time": 8724, "text": "I always will."}, {"time": 8725, "text": "It's funny that I get to talk to you."}, {"time": 8726, "text": "Cause it's like, I read this book."}, {"time": 8728, "text": "I forget what it's called."}, {"time": 8729, "text": "It won, I think it won a Pulitzer prize."}, {"time": 8731, "text": "And it was like the story of, I tried to understand Russia post Crimea."}, {"time": 8737, "text": "Cause I came up amongst people who are much more like neoconservative and they're like, fuck Russia, Russia bad."}, {"time": 8743, "text": "And I was like, okay, like what do these people think?"}, {"time": 8746, "text": "And we have this narrative of like the fall of the Soviet Union."}, {"time": 8749, "text": "And then I read this book from the perspective of Russians who lived through the fall."}, {"time": 8754, "text": "And they were like, this is, I was like, this is terrible."}, {"time": 8756, "text": "Like actually the introduction of capitalism was awful."}, {"time": 8759, "text": "And like the rise of all these crazy oligarchs."}, {"time": 8763, "text": "That's why Putin was, came to power to like restore, restore order to the oligarchy."}, {"time": 8771, "text": "And he still talks to this day."}, {"time": 8773, "text": "Do you guys, I mean, that's always the threat of like, do you want to return to the nineties?"}, {"time": 8777, "text": "Do you want to return to Yeltsin?"}, {"time": 8780, "text": "But the thing is in the West, we have this like our own propaganda of like, no, Yeltsin was great."}, {"time": 8785, "text": "That was the golden age."}, {"time": 8785, "text": "What could have been with Russia?"}, {"time": 8787, "text": "And I was like, well, what do actual Russians think?"}, {"time": 8789, "text": "And so that, yeah, I'll always be fascinated by it."}, {"time": 8794, "text": "And then just like to understand the idea of feeling encircled by NATO and all of that, you have to understand like Russian defense theory all the way of going back to the czars has always been defense in depth in terms of having Estonia, Lithuania, and more as like protection of the heartland."}, {"time": 8814, "text": "I'm not justifying in this."}, {"time": 8815, "text": "So NATO shills like, please don't come after me."}, {"time": 8817, "text": "But look, Estonians like NATO."}, {"time": 8821, "text": "They want to be in NATO."}, {"time": 8822, "text": "So I don't want to minimize that."}, {"time": 8823, "text": "I'm more just saying like, I understand him and Russia much better having done that."}, {"time": 8828, "text": "And we are very incapable in America."}, {"time": 8831, "text": "I think this is probably because my parents are immigrants and I've traveled a lot."}, {"time": 8834, "text": "Of like putting yourself in the mind of people who aren't Western and haven't lived a history, especially our lives of America's fucking awesome."}, {"time": 8843, "text": "We're the number one country in the world."}, {"time": 8844, "text": "Like we're literally better than you, like in many ways."}, {"time": 8847, "text": "And they can't empathize with people who have suffered so much."}, {"time": 8853, "text": "And I just, yeah, it's just so interesting to me."}, {"time": 8856, "text": "What about if we could talk for just a brief moment about the human of Putin and power, you are clearly fascinated by power."}, {"time": 8868, "text": "Do you think power changed Putin?"}, {"time": 8871, "text": "Do you think power changes leaders?"}, {"time": 8874, "text": "If you look at the great leaders in history, whether it's LBJ, FDR, do you think power really changes people?"}, {"time": 8883, "text": "Like, is there a truth to that kind of old proverb?"}, {"time": 8886, "text": "It reveals, I think that's what it is."}, {"time": 8888, "text": "It reveals."}, {"time": 8889, "text": "So Putin was a much more deft politician, much more amenable to the West."}, {"time": 8895, "text": "If you think back, you know, to 2001 and more, right when he came, cause he was still, cause at that time his biggest problem was intra Russian politics, right?"}, {"time": 8904, "text": "Like it was all consolidating power within the oligarchy."}, {"time": 8907, "text": "Once he did that by around like 2007, there's that famous time when he spoke out against the West at the Munich security conference."}, {"time": 8916, "text": "I forget when it was."}, {"time": 8917, "text": "And that's when everybody in the audience was like, whoa."}, {"time": 8920, "text": "And he was talking about like NATO encirclement and like, we will not be beaten back by the West."}, {"time": 8925, "text": "Very shortly afterwards, like the Georgia invasion happens."}, {"time": 8929, "text": "And that was like a big wake up call of like, we will not be pushed around anymore."}, {"time": 8933, "text": "I mean, he said before publicly, like the worst thing that ever happened was the fall."}, {"time": 8937, "text": "Or what did he say?"}, {"time": 8938, "text": "He was like, the fall of the Soviet Union was a tragedy, right?"}, {"time": 8941, "text": "Of course, people in the West were like, what?"}, {"time": 8942, "text": "I'm like, I get it, right?"}, {"time": 8944, "text": "Like they were a superpower."}, {"time": 8945, "text": "And now their population is declining."}, {"time": 8948, "text": "Like it's like a Petro state."}, {"time": 8950, "text": "Like, I understand."}, {"time": 8952, "text": "I understand like how somebody could feel about that."}, {"time": 8955, "text": "I think it revealed his character, which is that I think he thinks of himself probably as he always has since 2001 as like this benevolent, almost as a benevolent dictator."}, {"time": 8969, "text": "He's like, without me, the whole system would collapse."}, {"time": 8971, "text": "I'm the only guy keeping all these people in check."}, {"time": 8975, "text": "Most Russians probably do support Putin because they feel like they support some form of functional government."}, {"time": 8983, "text": "And they view it as like a check against that, which is a long, has a long history within Russia too."}, {"time": 8990, "text": "So I don't know if it changed him."}, {"time": 8993, "text": "I think it just revealed him because it's not like he, I mean, he has a bill."}, {"time": 8996, "text": "You know, Navalny has put that like billion dollar palace and all that."}, {"time": 9001, "text": "Sometimes I feel like Putin does that for show."}, {"time": 9003, "text": "He doesn't seem like somebody who indulges in all that stuff."}, {"time": 9006, "text": "Or maybe we just don't see it."}, {"time": 9008, "text": "Well, I don't, it's very difficult for me to understand."}, {"time": 9011, "text": "I've been hanging out, thanks to Clubhouse."}, {"time": 9013, "text": "A lot of, I've gotten to learn a lot about the Navalny folks and it's been very educational."}, {"time": 9021, "text": "Made me ask a lot of important questions about what, you know, question a lot of my assumptions about what I do and don't know."}, {"time": 9029, "text": "But I'll just say that I do believe, you know, there's a lot of the Navalny folks say that Putin is incompetent and is a bad executive, like is bad at basically running government."}, {"time": 9044, "text": "But to me."}, {"time": 9046, "text": "Well, why do Russians not think that?"}, {"time": 9049, "text": "Well, they probably say propaganda."}, {"time": 9050, "text": "They would say it's the press."}, {"time": 9051, "text": "Yeah, they would say the control."}, {"time": 9052, "text": "There is a strong either control or pressure on the press, but I think there is a legitimate support and love of Putin in Russia that is not grounded in just misinformation and propaganda."}, {"time": 9065, "text": "There's legitimacy there."}, {"time": 9067, "text": "Mostly I tried to remain apolitical and actually genuinely remain apolitical."}, {"time": 9072, "text": "I am legitimately not interested in the politics of Russia of today."}, {"time": 9078, "text": "I feel I have some responsibility and I'll take that responsibility on as I need to."}, {"time": 9083, "text": "But my fascination as it is perhaps with you in part is in the historical figure of Putin."}, {"time": 9125, "text": "Those are the bickering of the day, just like we were saying, what will actually be remembered about this moment in history?"}, {"time": 9131, "text": "Totally, he's a transformational figure in Russian history."}, {"time": 9134, "text": "Really, like the bridge between the fall of the Soviet Union and the chaos of Yeltsin, that will be how he's remembered."}, {"time": 9141, "text": "The only question is what comes next and what he wants to come next."}, {"time": 9144, "text": "I'm always, I'm like, he's getting up."}, {"time": 9146, "text": "How old are you, 60 something?"}, {"time": 9147, "text": "Yeah, 60."}, {"time": 9148, "text": "So he would be, I think he would be 80."}, {"time": 9151, "text": "So with the change of the constitution, he cannot be president until 2034, I think it is."}, {"time": 9164, "text": "So he would be like 80 something and he would be in power for over 30 years, which is longer than Stalin."}, {"time": 9171, "text": "But he still seems to be."}, {"time": 9174, "text": "Seems fit."}, {"time": 9176, "text": "I think he's gonna be around for a long time."}, {"time": 9177, "text": "But this is a fascinating question that you ask, which is like, what does he want?"}, {"time": 9183, "text": "I don't, and this is where I think, given all of his behavior and more, I don't know if it's about money."}, {"time": 9189, "text": "I don't know if it's about enriching himself."}, {"time": 9191, "text": "Obviously he did, to the tune of billions and billions and billions of dollars."}, {"time": 9195, "text": "But I think he probably, he's as close to like an actual Russian nationalist, like at the top, who really does believe in Russia as its rightful superpower."}, {"time": 9206, "text": "Everything he does seems to stem from that opposition to NATO, intro to Syria, like wanting to play a large role in affairs, deeply distrustful and yet coveting of the European powers."}, {"time": 9220, "text": "Like, I could describe every czar in those same language."}, {"time": 9224, "text": "Like every czar falls into the exact same category."}, {"time": 9227, "text": "Yeah, and I mean, it makes me wonder, looking at some of the biggest leaders in human history, to ask the question of what was the motivation?"}, {"time": 9235, "text": "What was the motivation for even just the revolutionaries like Lenin, Trotsky, and Stalin?"}, {"time": 9240, "text": "What was the motivation?"}, {"time": 9242, "text": "Because it sure as hell seems like the motivation was at least in part driven by the idea, by ideas, not self interest of like power."}, {"time": 9255, "text": "For Lenin, it was, I think he was a true believer and an actual narcissist who thought he was the only one who could do it."}, {"time": 9261, "text": "Stalin, I do think just wanted power."}, {"time": 9263, "text": "And realized, well, I don't know."}, {"time": 9265, "text": "Look, he wrote very passionately when he was young."}, {"time": 9267, "text": "And he was, he really believed in communism."}, {"time": 9270, "text": "In the beginning he did."}, {"time": 9271, "text": "I'm always fascinated as I'm like, around 1920, what happened, right?"}, {"time": 9276, "text": "Post revolution, you crushed the whites."}, {"time": 9280, "text": "Now it's all about consolidation."}, {"time": 9282, "text": "That's where the games really began."}, {"time": 9284, "text": "And I'm like, I don't think that was about communism."}, {"time": 9288, "text": "Yeah, maybe it became a useful propaganda tool, but it still seemed like he believed in it."}, {"time": 9295, "text": "Whether it was, of course, this is the question."}, {"time": 9298, "text": "I mean, this is the problem with conspiracy theories for me."}, {"time": 9302, "text": "And this is legitimate criticism towards me about conspiracy theories, which is just because you're not like this doesn't mean others aren't like this."}, {"time": 9311, "text": "So like, I can't believe that somebody be like deeply two faced."}, {"time": 9316, "text": "Oh, I've met them, you're welcome to Washington."}, {"time": 9320, "text": "But like, I think that I would be able to detect like, no."}, {"time": 9327, "text": "Well, this, my question is, well, so there's differences."}, {"time": 9330, "text": "There's two face, like there's different levels of two face."}, {"time": 9335, "text": "Like what I mean is to be killing people and it's like house of cards style, right?"}, {"time": 9343, "text": "And still present a front like you're not killing people."}, {"time": 9349, "text": "I don't know if, I guess it's possible, but I just don't see that at scale."}, {"time": 9355, "text": "Like there's a lot of people like that."}, {"time": 9356, "text": "And I don't, I have trouble imagining some, that's such a compelling narrative that people like to say."}, {"time": 9366, "text": "Like people, that's the conspiratorial mindset."}, {"time": 9369, "text": "I think that skepticism was really powerful and important to have because it's true."}, {"time": 9374, "text": "A lot of powerful people abuse their power, but saying that about, I feel like people over assume that."}, {"time": 9381, "text": "It's like, I see that with use of steroids often in sports."}, {"time": 9385, "text": "People seem to make that claim about like everybody who's successful and I want to be very, I don't know."}, {"time": 9392, "text": "Something about me wants to be cautious because I want to give people a chance."}, {"time": 9397, "text": "Being purely cynical isn't helpful."}, {"time": 9399, "text": "People say this about me."}, {"time": 9400, "text": "He's only saying this to do this."}, {"time": 9402, "text": "But at the same time, being naively optimistic about everything is also a kind of pedophilic scheme."}, {"time": 9407, "text": "People are going to fuck you over."}, {"time": 9409, "text": "And more importantly, that doesn't bother me."}, {"time": 9412, "text": "More importantly, you're not going to be able to reason about how to create systems that are going to be robust to corruption, to malevolent parties."}, {"time": 9421, "text": "So in order to create, you have to have a healthy balance of both, I suppose, especially if you want to actually engineer things that work in this world that has evil in it."}, {"time": 9433, "text": "I can't believe there's a book of Hitler on the desk."}, {"time": 9437, "text": "We've mentioned a lot of books throughout this conversation."}, {"time": 9440, "text": "I wonder, and this makes me really curious to explore in a lot of depth the kind of books that you're interested in."}, {"time": 9450, "text": "I think you mentioned in your show that you provide recommendations."}, {"time": 9457, "text": "In the form of spoken word, can you beyond what we've already recommended mention books, whether it is historical, nonfiction, or whether it's more like philosophical or even fiction that had a big impact on your life?"}, {"time": 9472, "text": "Is there a few that you can mention?"}, {"time": 9474, "text": "I already talked about the Johnson books, so I'll leave that alone."}, {"time": 9476, "text": "Robert A. Caro, he's still alive, thank God."}, {"time": 9479, "text": "He's finishing the last book."}, {"time": 9481, "text": "I hope he makes it."}, {"time": 9483, "text": "So those Johnson books."}, {"time": 9485, "text": "Second, can I ask you a question about those books?"}, {"time": 9488, "text": "What the hell do you fit into so many pages?"}, {"time": 9491, "text": "Everything, man."}, {"time": 9492, "text": "Let me tell you this."}, {"time": 9493, "text": "So I'll just give you an anecdote."}, {"time": 9494, "text": "This is why I love these books."}, {"time": 9496, "text": "The beginning, the first book is about Lyndon Johnson."}, {"time": 9499, "text": "His life, when he gets elected to Congress, the book begins with a history of Texas and its weather patterns, and then of his great, great grandfather moving to Texas."}, {"time": 9512, "text": "Then the story of that, about a hundred or so pages in, you get to Lyndon Johnson."}, {"time": 9519, "text": "Which is you get."}, {"time": 9520, "text": "It's like a Tolstoy style retelling."}, {"time": 9522, "text": "This is the thing, it's not a biography, it's a story of the times."}, {"time": 9525, "text": "That's a great biography."}, {"time": 9527, "text": "So another one, this isn't part of my list, so don't do it, is Grant, Ron Chernow."}, {"time": 9534, "text": "Ron Chernow's Grant, it's a thousand pages."}, {"time": 9537, "text": "And the reason I tell everybody to read it is it's not just the story of Grant, it is the story of pre civil war America, the Mexican American war, the civil war and reconstruction, all told in the life of one person who was involved in all three."}, {"time": 9552, "text": "Most people don't know anything about the Mexican American war."}, {"time": 9555, "text": "Most people don't know anything about reconstruction."}, {"time": 9558, "text": "Now more so because people are talking, it's a hot topic now."}, {"time": 9561, "text": "I've been reading about it for years."}, {"time": 9562, "text": "That is another thing people need to learn a lot more about."}, {"time": 9566, "text": "In terms of non history books, the book that probably had the most impact on me, which is also a historical nonfiction is I am obsessed with Antarctic exploration."}, {"time": 9580, "text": "And it all began with a book called Shackleton's Incredible Journey, which is the collection of diaries of everybody who was on Shackleton's journey."}, {"time": 9591, "text": "For those who don't know, Shackleton was the last explorer of the heroic age of Antarctic exploration."}, {"time": 9599, "text": "He led a ship called the Endurance, which froze in the ice off the coast of Antarctica in 1914."}, {"time": 9610, "text": "And they didn't have radios over the last exploration, the last one without the age of radio."}, {"time": 9616, "text": "And he happens to freeze in the ice."}, {"time": 9618, "text": "And then the ship collapses after a year frozen in the ice."}, {"time": 9623, "text": "And this man leads his entire crew from that ship onto the ice with a team of dogs, survives out on the ice for another year with three little lifeboats and is able to get all of his men, every single one of them alive to an island hundreds of miles away called Elephant Island."}, {"time": 9644, "text": "And when they got there, he had to leave everybody behind except for six people."}, {"time": 9650, "text": "And him and two other guys, I'm forgetting their names, navigated by the stars 800 miles through the Drake Passage with seas of hundreds of feet to Prince, I think it's called Prince George's Island."}, {"time": 9665, "text": "And then when they got to Prince George's Island, they landed on the wrong side and they had to hike from one side to the other to go and meet the whalers."}, {"time": 9675, "text": "And every single one of those things was supposed to be impossible."}, {"time": 9678, "text": "Nobody was ever supposed to hike that island."}, {"time": 9681, "text": "It wasn't done again until like the 1980s with professional equipment."}, {"time": 9685, "text": "He did it after two years of starvation."}, {"time": 9688, "text": "Nobody was ever supposed to make it from Elephant Island to Prince George."}, {"time": 9693, "text": "The guy, they had to hold him steady, his legs, so that he could chart the stars."}, {"time": 9698, "text": "And if they miss this island, they're into open sea."}, {"time": 9701, "text": "They're dead."}, {"time": 9702, "text": "And then before that, how do you survive for a year on the ice?"}, {"time": 9706, "text": "On seals."}, {"time": 9707, "text": "And before that, he kept his crew from depression frozen one year in the ice."}, {"time": 9713, "text": "It's just an amazing story."}, {"time": 9715, "text": "And it made me obsessed with Antarctic exploration."}, {"time": 9718, "text": "So I've read like 15 books on it."}, {"time": 9720, "text": "What the hell is it about the human spirit?"}, {"time": 9722, "text": "That's the thing about Antarctica is it brings it out of you."}, {"time": 9725, "text": "So for example, I read another one recently called Mawson's Will."}, {"time": 9728, "text": "Douglas Mawson, he was an Australian."}, {"time": 9730, "text": "He was on one of the first Robert Frost expeditions."}, {"time": 9735, "text": "He leads an expedition down to the South."}, {"time": 9737, "text": "Him and a partner, they're leading explorations, 1908, something like that."}, {"time": 9743, "text": "They're going around Antarctica with dog teams."}, {"time": 9747, "text": "And what happens is they keep going over these snow bridges where there's a crevice, but it's covered in snow."}, {"time": 9754, "text": "And so one of the lead driver, the dogs go over and they plummet."}, {"time": 9760, "text": "And that sled takes with it."}, {"time": 9763, "text": "So the guy survives, but that sled takes all their food, half the dogs, their stove, the camping tent, the tent specifically designed for the snow, everything."}, {"time": 9776, "text": "And they're hundreds of miles away from base camp."}, {"time": 9779, "text": "He and this guy have to make it back there in time before the ship comes to come get them on an agreed upon date."}, {"time": 9787, "text": "And he makes it."}, {"time": 9788, "text": "But the guy he was with, he dies."}, {"time": 9791, "text": "And it's a crazy story."}, {"time": 9792, "text": "First of all, they have to eat the dogs."}, {"time": 9794, "text": "A really creepy part of Antarctic exploration is everyone ends up eating dogs at different points."}, {"time": 9800, "text": "And part of the theory, which is so crazy, is that the guy he was with was dying because they were eating dog liver."}, {"time": 9808, "text": "And dog liver has a lot of vitamin E, which if you eat too much of it, can give you like a poisoning."}, {"time": 9814, "text": "And so Mawson, by trying to help his friend, was giving him more liver."}, {"time": 9818, "text": "Of all the things that kills you."}, {"time": 9820, "text": "I know, it's dog liver."}, {"time": 9822, "text": "And so his friend ends up dying, have a horrific heart attack, all of that."}, {"time": 9826, "text": "Mawson crawls back hundreds of miles away, makes it back to base camp hours after the ship leaves."}, {"time": 9834, "text": "And two guys or a couple of guys stayed behind for him."}, {"time": 9837, "text": "And he basically has to recuperate for like six months before he can even walk again."}, {"time": 9842, "text": "But it's like you were saying about the human spirit."}, {"time": 9844, "text": "It's like Antarctica brings that out of people."}, {"time": 9847, "text": "Or Amundsen, the guy who made it to the South Pole, Robert Amundsen, oh my God."}, {"time": 9852, "text": "Like this guy trained his whole life in the ice from Norway to make it to the South Pole."}, {"time": 9860, "text": "And he beat Robert Frost, the British guy with all this money and all these, I could go on this forever."}, {"time": 9866, "text": "I'm obsessed with it."}, {"time": 9867, "text": "Well, first of all, I'm gonna take this part of the podcast."}, {"time": 9871, "text": "I'm gonna set it to music."}, {"time": 9872, "text": "I'm gonna listen to it."}, {"time": 9873, "text": "Cause I've been whining and bitching about running 48 miles of Goggins this next weekend."}, {"time": 9879, "text": "And this is gonna be so easy."}, {"time": 9881, "text": "I'm just gonna listen to this over and over in my head."}, {"time": 9883, "text": "You're gonna be."}, {"time": 9884, "text": "Elon's obsessed with Shackleton."}, {"time": 9885, "text": "He talks about him all the time."}, {"time": 9886, "text": "He uses, I was gonna ask you about that."}, {"time": 9888, "text": "He uses an example of that as an example of what Mars colonization would be like."}, {"time": 9898, "text": "No, Antarctica is as close to you can simulate that."}, {"time": 9903, "text": "Antarctica is as close to what you could simulate what it would get."}, {"time": 9906, "text": "That Nat Geo series on Mars, I'm not sure if you watched it, it's incredible."}, {"time": 9910, "text": "Elon's actually in it."}, {"time": 9911, "text": "And it's like, they get there, everything goes wrong."}, {"time": 9915, "text": "Somebody dies, like it's horrible."}, {"time": 9919, "text": "They can't find any water."}, {"time": 9920, "text": "It's not working."}, {"time": 9922, "text": "Is it like simulating the experience of what it'd be like to colonize?"}, {"time": 9925, "text": "So it's like a docu series where the fictionalized part is the like astronauts on Mars, but then they're interviewing people like Elon Musk and others who were the ones who like paved the way to get to Mars."}, {"time": 9938, "text": "So it's a really interesting concept."}, {"time": 9940, "text": "I think it's on Netflix."}, {"time": 9941, "text": "And yeah, I agree with him 100%, which is that the first guys to make, like for example, Robert Frost, who went to Australia, sorry, to Antarctica, the British explorer who was beaten to the South Pole three weeks by Robert Amundsen, he died on the way back."}, {"time": 9959, "text": "And the reason why is because he wasn't well prepared."}, {"time": 9961, "text": "He was arrogant."}, {"time": 9962, "text": "He didn't have the proper amounts of supplies."}, {"time": 9966, "text": "His team had terrible morale."}, {"time": 9968, "text": "Antarctica is a brutal place."}, {"time": 9969, "text": "If you fuck up one time, you die."}, {"time": 9972, "text": "And it's like, and this is what you read a lot about, which is the reason why such heroic characters like Shackleton Shine is a lot of people died."}, {"time": 9980, "text": "Like there were some people who got frozen in the eye."}, {"time": 9983, "text": "I mean, man, this again also came to the North exploration."}, {"time": 9987, "text": "So I read a lot about like the exploration of the North Pole and same thing."}, {"time": 9992, "text": "These unextraordinary men take people out into the ice and get frozen out there for years and shit goes so bad."}, {"time": 10000, "text": "They end up eating each other."}, {"time": 10002, "text": "They all die."}, {"time": 10003, "text": "There's a famous, one I'm forgetting his name, the British Franklin expedition, where they went searching for them for like 20 years."}, {"time": 10010, "text": "And they eventually came across a group of Inuit who were like, oh yeah, we saw some weird white men here like 15 years ago."}, {"time": 10016, "text": "And they find their bones and there's like saw marks, which showed that they were eating each other."}, {"time": 10021, "text": "So history remembers the ones who didn't eat each other."}, {"time": 10023, "text": "Yeah, well, yeah, we remember the ones who made it, but there are."}, {"time": 10029, "text": "And that would be the story of Mars as well."}, {"time": 10031, "text": "That will be the story of Mars."}, {"time": 10032, "text": "But, and nevertheless, that's the interesting thing about Antarctica."}, {"time": 10036, "text": "Nevertheless, something about human nature drives us to explore it."}, {"time": 10042, "text": "And that seems to be like, you know, a lot of people have this kind of, to me, frustrating conversations like, well, Earth is great, man."}, {"time": 10051, "text": "Why do we need to colonize Mars?"}, {"time": 10053, "text": "You just don't get it."}, {"time": 10056, "text": "It's the same people that say like, why are you running?"}, {"time": 10059, "text": "Like, why are you running a marathon?"}, {"time": 10061, "text": "What are you running from, man?"}, {"time": 10064, "text": "It's pushing the limits of the human mind of what's possible."}, {"time": 10071, "text": "It's George Mallory because it's there."}, {"time": 10075, "text": "And that's somehow actually the result of that, if you want to be pragmatic about it, there's something about pushing that limit that has side effects that you don't expect that will create a better world back home for the people, not necessarily on Earth, but like just in general, it raises the quality of life for everybody, even though the initial endeavor doesn't make any sense."}, {"time": 10099, "text": "The very fact of pushing the limits of what's possible then has side effects of benefiting everybody."}, {"time": 10108, "text": "And it's difficult to predict ahead of time what those benefits will be."}, {"time": 10113, "text": "Say with colonizing Mars, it's unclear what the benefits will be for Earth or in general with struggling."}, {"time": 10119, "text": "What did we get from the moon?"}, {"time": 10121, "text": "What did we get from Apollo, right?"}, {"time": 10123, "text": "Technically, and there were a lot of socialists at the time making this argument."}, {"time": 10126, "text": "They're like, all this money going, you know what?"}, {"time": 10129, "text": "We went to the fucking moon in 1969."}, {"time": 10132, "text": "That was amazing."}, {"time": 10133, "text": "The greatest feat in human history, period."}, {"time": 10137, "text": "What did we learn from it?"}, {"time": 10139, "text": "We learned about interstellar or interplanetary travel."}, {"time": 10144, "text": "We learned that we could do something off of a device less powerful than the computer in my pocket."}, {"time": 10150, "text": "Like the amount of potential locked within my pocket and your pocket, I mean, this is, if you were to define my policies in one way, it's greatness, like national, a quest for national greatness."}, {"time": 10163, "text": "There is no greatness without fulfilling the ultimate calling of the human spirit, which is more, it's not enough."}, {"time": 10171, "text": "And why should it be?"}, {"time": 10172, "text": "It wasn't enough."}, {"time": 10174, "text": "Our ancestors could have been content to sit, well, actually many of them were, were content to sit and say, these berries will be here for a long time."}, {"time": 10183, "text": "And they got eaten and they died."}, {"time": 10184, "text": "And it's the ones who got out and went to the next place and the next place and went across the Siberian land bridge and went across more."}, {"time": 10193, "text": "And it just did extraordinary things."}, {"time": 10195, "text": "The craziest ones, we are their offspring and we fail them if we don't go into space."}, {"time": 10201, "text": "That's how I would put it."}, {"time": 10203, "text": "You should run for president."}, {"time": 10205, "text": "I'm just pro space, man."}, {"time": 10207, "text": "I love space."}, {"time": 10208, "text": "No, you're pro doing difficult things and pushing, exploring the world in all of its forms."}, {"time": 10214, "text": "I hope that kind of spirit permeates politics too."}, {"time": 10218, "text": "That same kind of a... Can, can."}, {"time": 10221, "text": "I, well, it can, and I hope so."}, {"time": 10224, "text": "I don't know if you want to stay on it, but I think that was book number one or two."}, {"time": 10229, "text": "All right, all right."}, {"time": 10231, "text": "Well, this one is second, this actually is a corollary to that, which is sapiens."}, {"time": 10234, "text": "And I know that's a very normal, normie answer."}, {"time": 10237, "text": "One of the best selling book."}, {"time": 10238, "text": "I think there's a reason for that."}, {"time": 10240, "text": "Yuval Noah Harari."}, {"time": 10242, "text": "Okay, look, yes, he didn't do any new research."}, {"time": 10245, "text": "All he did was aggregate."}, {"time": 10246, "text": "I'm sure he's very controversial in the scientific community, but guess what?"}, {"time": 10249, "text": "He wrote a great book."}, {"time": 10250, "text": "It's a very easy to read general explanation of the rise of human history."}, {"time": 10258, "text": "And it helps challenge a lot of preconceptions."}, {"time": 10260, "text": "Are we special?"}, {"time": 10261, "text": "Are we an accident?"}, {"time": 10262, "text": "Are we more like a parasite?"}, {"time": 10264, "text": "Are we not?"}, {"time": 10265, "text": "What, is there a destiny to all of us?"}, {"time": 10268, "text": "You know, if anything, it's like what I just described, which is more."}, {"time": 10272, "text": "Move, move out."}, {"time": 10274, "text": "The evolution of money."}, {"time": 10275, "text": "Like, I know he gets a lot of hate, but I think that he writes it so clearly and well that for your average person to be able to read that, you will come away with a more clear understanding of the human race than before."}, {"time": 10288, "text": "And I think that that's why it's worth it."}, {"time": 10290, "text": "I agree with you 100%."}, {"time": 10292, "text": "I'm ashamed to, I usually don't bring up sapiens because it's like."}, {"time": 10296, "text": "Yeah, it's like, everybody's uncle has read it, but that's a good thing."}, {"time": 10300, "text": "It is one of the, I think it'll be remembered as one of the great books of this particular era."}, {"time": 10306, "text": "Yeah, because it's so clearly, it's like the selfish gene with Dawkins."}, {"time": 10310, "text": "I mean, it just aggregates so many ideas together and puts language to it that makes it very useful to talk about."}, {"time": 10317, "text": "So it is one of the great books."}, {"time": 10320, "text": "Another one is definitely Born to Run for the same reason by Christopher McDougall, which is that."}, {"time": 10326, "text": "I'm just gonna listen to this whole podcast next week."}, {"time": 10329, "text": "Well, you should because it, you are inheriting our most basic skill, which is running."}, {"time": 10335, "text": "And reimagining human history or reimagining like what we were as opposed to what we are is very useful because it helps you understand how to tap into primal aspects of your brain, which just drive you."}, {"time": 10352, "text": "And the reason I love McDougall's writing is because I love anybody who writes like this."}, {"time": 10357, "text": "Malcolm Gladwell, who else?"}, {"time": 10359, "text": "Michael Lewis, people who find characters to tell a bigger story."}, {"time": 10363, "text": "Michael Lewis finds characters to tell us the story of the financial crisis."}, {"time": 10368, "text": "Malcolm Gladwell writes, finds characters to tell us the story of learning new skills and outliers and whatever his latest book is, I forget what it's called."}, {"time": 10376, "text": "But McDougall tells the vignettes and a tiny story of a single person in the history of running and like how it's baked into your DNA."}, {"time": 10387, "text": "And I think there was just something very useful to that for me for being like, I don't need to go to the gym or like, I'm not saying, you should still go to the gym."}, {"time": 10395, "text": "I'll be clear."}, {"time": 10396, "text": "I'm saying like, in order to fulfill like who you are, you can actually tap into something that's the most basic."}, {"time": 10403, "text": "I don't know if, I'm sure if you listened to the David Cho episode with Joe Rogan."}, {"time": 10409, "text": "Oh, where he's the animal."}, {"time": 10411, "text": "With the baboon."}, {"time": 10412, "text": "When he goes hunting."}, {"time": 10412, "text": "And there's something to that, man."}, {"time": 10414, "text": "Where it's just like, they are living the way that we were supposed to."}, {"time": 10419, "text": "We're not supposed, well, I don't wanna put a normative judgment on it."}, {"time": 10422, "text": "They're living the way that we used to."}, {"time": 10425, "text": "There's something very fun."}, {"time": 10426, "text": "It feels more honest somehow to our true nature."}, {"time": 10428, "text": "There's a guy I follow on Instagram."}, {"time": 10430, "text": "I've come from, Paul Saladino, Carnivore MD."}, {"time": 10433, "text": "He just went over there to the Hadza to live with them."}, {"time": 10437, "text": "And I was watching his stuff just like, I was like, man, there's something in you that wants to go."}, {"time": 10443, "text": "I'm like, I wanna do that."}, {"time": 10445, "text": "I wouldn't be very good at it, but like I want to."}, {"time": 10447, "text": "I'm so glad that somebody who thinks deeply about politics is so fascinated with exploration and with the very basic nature, like human nature, nature of our existence."}, {"time": 10461, "text": "There's something in you."}, {"time": 10463, "text": "And still you're stuck in DC."}, {"time": 10465, "text": "For now, for now."}, {"time": 10466, "text": "Speaking of which, you're from Texas."}, {"time": 10472, "text": "What do you make of the future of Texas politically, culturally, economically?"}, {"time": 10479, "text": "I am in part moving, well, I'm moving to Austin."}, {"time": 10483, "text": "Congrats."}, {"time": 10484, "text": "But I'm also doing the Eric Weinstein advice, which is like, dude, you're not married."}, {"time": 10489, "text": "You don't have kids."}, {"time": 10491, "text": "There's no such thing as moving."}, {"time": 10492, "text": "What are you moving?"}, {"time": 10494, "text": "You're like your three suits and some shirts and underwear."}, {"time": 10499, "text": "What exactly is the move entail?"}, {"time": 10502, "text": "So I have nothing."}, {"time": 10503, "text": "So I'm basically, it's very just remain mobile, but there's a promise, there's a hope to Austin."}, {"time": 10512, "text": "Outside of just like friendships, I have no, it's a very different culture that Joe Rogan is creating."}, {"time": 10520, "text": "I'm mostly interested in what the next Silicon Valley will be, what the next hub of technological innovation."}, {"time": 10528, "text": "And there's a promise, maybe a dream for Austin being that next place."}, {"time": 10534, "text": "It's very possible."}, {"time": 10535, "text": "Doesn't have the baggage of some of the political things, maybe some of the sort of things that hold back the beauty of, that makes capitalism, that makes innovation so powerful, which is like meritocracy, which is excellence."}, {"time": 10555, "text": "Diversity is exceptionally important, but it should not be the only priority."}, {"time": 10561, "text": "It has to be something that coexists with a like insatiable drive towards excellence."}, {"time": 10570, "text": "And it seems like Texas is a nice place, like having a Austin, which is like a kind of this weird, I hope it stays weird, man."}, {"time": 10580, "text": "I love weird people."}, {"time": 10581, "text": "I don't know about that, but we can get into it."}, {"time": 10584, "text": "But there's this hope is it remains this weird place of brilliant innovation amidst a state that's like more conservative."}, {"time": 10596, "text": "So like there's a nice balance of everything."}, {"time": 10598, "text": "What are your thoughts about the future of Texas?"}, {"time": 10600, "text": "I think it's so fascinating to me because I never thought I would want to move back, but now I'm beginning to be convinced."}, {"time": 10610, "text": "So I'm going to stick to this clip."}, {"time": 10613, "text": "I am, I'm being honest and many Texas will hate me for this."}, {"time": 10616, "text": "But Texas was not a place that was kind to me, quote unquote."}, {"time": 10620, "text": "And this is because of my own parent."}, {"time": 10624, "text": "Look, I was raised in College Station, Texas, which is a town of 50,000."}, {"time": 10628, "text": "It's a university town."}, {"time": 10630, "text": "It exists only for the university."}, {"time": 10633, "text": "So it was a very, I did not get the full Texas experience purely speaking from a College Station experience."}, {"time": 10639, "text": "But growing up first generation, or I forget what it is, I'm the first American."}, {"time": 10646, "text": "I was born and raised in College Station."}, {"time": 10647, "text": "My parents are from India."}, {"time": 10650, "text": "Being raised in a town where the dominant culture was predominantly like white evangelical Christian was hard."}, {"time": 10658, "text": "Like it was just difficult."}, {"time": 10660, "text": "And I think of it, in the beginning, I would say like ages, like zero to like eight, it was like cultural ignorance, as in like they just don't know how to interact with you."}, {"time": 10673, "text": "And there was a level of, always there was like the evangelical kind of antipathy towards like you being not Christian."}, {"time": 10681, "text": "You know, my parents are Hindu."}, {"time": 10682, "text": "Like that's how I was raised."}, {"time": 10683, "text": "And so like, there was that."}, {"time": 10685, "text": "But 9 11 was very difficult."}, {"time": 10688, "text": "Like 9 11 happened when I was in third or fourth grade."}, {"time": 10693, "text": "And that changed everything, man."}, {"time": 10695, "text": "Like, I mean, our temple had to like print out T shirts."}, {"time": 10698, "text": "And I'm not saying this is a sob story, to be clear."}, {"time": 10700, "text": "I've still actually largely for my adult life identified on the political right."}, {"time": 10704, "text": "So don't take this as some like, you know, race manifesto."}, {"time": 10707, "text": "I'm just telling it like, this is what happened, which is that like we had, it was just hard to be proud, frankly, and to have some of the fallout from 9 11 and during Iraq."}, {"time": 10720, "text": "And the reason I am political is because I realize in myself, I have a strong rebellious nature against systems and structures of power."}, {"time": 10732, "text": "And the first people I ever rebelled against were all the people telling me to shut up and not question the Iraq war."}, {"time": 10740, "text": "So the reason I am in politics is because I hated George W. Bush with a passion and I hated the war."}, {"time": 10748, "text": "And I was so, again, my entire background is largely in national security for this reason, which is I was obsessed with the idea of like, how do we get people who are not gonna get us into these quagmire situations in positions of power?"}, {"time": 10761, "text": "That's how I became fascinated by power in the first place was all a question of how do this happen?"}, {"time": 10767, "text": "Like, how did this catastrophe happen?"}, {"time": 10770, "text": "I realized it's not as bad as like, you know, previous conflicts, but this one was mine."}, {"time": 10774, "text": "And to see how it changed our domestic politics forever."}, {"time": 10778, "text": "And so that was my rebellion."}, {"time": 10780, "text": "But it's funny, because I identified on the left when I was growing up, up until I was 18, I had also a funny two year stint."}, {"time": 10788, "text": "This is where everything kind of changed for me when I was 16, actually."}, {"time": 10791, "text": "I moved to Qatar, to Doha, Qatar, because my dad was a dean or associate dean of Texas A&M University at Doha."}, {"time": 10800, "text": "So my last two years of high school were at this."}, {"time": 10802, "text": "I went from this small town in Texas, and I love my parents because they could recognize that I had within me that I was not a small town kid."}, {"time": 10810, "text": "So they took me out of this country every chance they got."}, {"time": 10813, "text": "I traveled everywhere and constantly let me go."}, {"time": 10816, "text": "And so I went from school in College Station to like this ritzy private school, American school."}, {"time": 10824, "text": "Best thing that ever happened to me, because first of all, it got me out of College Station."}, {"time": 10829, "text": "Second, at that time, I had this annoying streak of, I wouldn't call it being anti America, but you don't appreciate America."}, {"time": 10838, "text": "Let me tell everybody out there listening, leave for a while, you will miss it so much."}, {"time": 10844, "text": "You do not know what it is like to not have freedom of speech until you don't have it."}, {"time": 10850, "text": "And I was going to high school with these guys in the Qatari royal family."}, {"time": 10857, "text": "And all I wanted to do was speak out of how they were pieces of shit for the way that they treated Indian citizens in that country who are basically used as slave labor."}, {"time": 10866, "text": "And I could not say one word because I knew I would be deported and I knew my dad would lose his job and my mom would lose her job and we would be forced out of the country."}, {"time": 10875, "text": "You don't know what it's like to live like that."}, {"time": 10877, "text": "Or to be in a society where like, you have like a high school girlfriend or something and you can't even touch in public or you're lectured for public decency."}, {"time": 10887, "text": "Like, listen, I've lived under a Gulf monarchy now."}, {"time": 10891, "text": "And that turned me into the most pro America guy ever."}, {"time": 10896, "text": "Like I came back so like Merica, like I still am because of that experience."}, {"time": 10903, "text": "Living abroad, like that will do it to you."}, {"time": 10906, "text": "Live in a non democracy."}, {"time": 10908, "text": "You have, even in Europe, I would say, you guys aren't living as free as we are here."}, {"time": 10913, "text": "It's awesome and I love it."}, {"time": 10915, "text": "You're ultimately another human being than the one who left Texas."}, {"time": 10919, "text": "So, I mean, have you actually considered moving to Texas and broadly just outside of your own story, what do you think is the future of Texas?"}, {"time": 10927, "text": "What is the future of Austin?"}, {"time": 10928, "text": "There's so much transformation seemingly happening now related to Silicon Valley, to California."}, {"time": 10935, "text": "That's what's been so hard to me, which is that since I left, it's changed dramatically, which is that it used to be like this conservative state where the main money to be made was oil."}, {"time": 10946, "text": "Petro, it was a Petro state, Houston, all of that."}, {"time": 10950, "text": "Austin was always weird, but it was more of a music town and a university town."}, {"time": 10954, "text": "It was not a tech town."}, {"time": 10955, "text": "But in the 10 years or so since I left, I have begun to realize, I'm like, well, the Texas I grew up in is over."}, {"time": 10963, "text": "It is not a deep red state in any sense of the term."}, {"time": 10968, "text": "The number one Uhaul route in the country pre pandemic already was San Francisco to Austin, okay?"}, {"time": 10974, "text": "So like you have this massive influx of people from California and New York."}, {"time": 10980, "text": "And the state, the composition of it is changed dramatically."}, {"time": 10984, "text": "The intra composition and the ultra, yeah."}, {"time": 10988, "text": "So the intra composition, it's become way more urban."}, {"time": 10990, "text": "It's from when I grew up, Texas was a much more rural state."}, {"time": 10993, "text": "Its politics were much more static."}, {"time": 10995, "text": "It looked much more like Rick Perry, like he was a very accurate representation of who we were."}, {"time": 11002, "text": "Now, I don't think that that's the case."}, {"time": 11005, "text": "Texas is now a dynamic economy, not just 100% reliant on oil because of its kind of like, I would call it like regulatory arbitrage relative to California and New York offers a large incentive to people who are more, I wouldn't say culturally liberal, but they're not necessarily like culturally conservative, like the people who I grew up with."}, {"time": 11027, "text": "That's changed the whole state's politics."}, {"time": 11029, "text": "Beto came two points away from beating Ted Cruz."}, {"time": 11031, "text": "I'm not saying the state's gonna go blue."}, {"time": 11033, "text": "I think the Republican party will just change and we'll have to readjust."}]}]