[{"title": "Frank Wilczek: Physics of Quarks, Dark Matter, Complexity, Life & Aliens | Lex Fridman Podcast #187", "id": "LDTe8uFqbws", "quotes": [{"time": 792, "text": "It makes you wonder why."}, {"time": 800, "text": "So I come from Russia and the question of Dostoevsky he has said that beauty will save the world."}, {"time": 807, "text": "Maybe as a physicist you can tell me what do you think he meant by that?"}, {"time": 811, "text": "I don't know if it saves the world but it does turn out to be a tremendous source of insight into the world."}, {"time": 817, "text": "When we investigate kind of the most fundamental interactions, things that are hard to access because they occur at very short distances between very special kinds of particles whose properties are only revealed at high energies."}, {"time": 841, "text": "We don't have much to go on from everyday life but so we have when we guess what the, and the experiments are difficult to do so you can't really follow a very wholly empirical procedure to sort of in the Baconian style figure out the laws kind of step by step just by accumulating a lot of data what we actually do is guess."}, {"time": 865, "text": "And the guesses are kind of aesthetic really."}, {"time": 869, "text": "What would be a nice description that's consistent with what we know and then you try it out and see if it works and by gosh it does in many profound cases."}, {"time": 958, "text": "So the rules of development when you have simple rules and they work again and again, you get symmetrical patterns."}, {"time": 967, "text": "That's kind of, in fact it's a recipe also for generating fractals, like the kind of broccoli that has all this internal structure and I wish I had a picture to show but maybe people remember it from the supermarket and you say how did a vegetable get so intelligent to make such a beautiful object with all this fractal structure and the secret is stupidity."}, {"time": 995, "text": "You just do the same thing over and over again and in our brains also, you know, we came out, we start from single cells and they reproduce and each one does basically roughly the same thing."}, {"time": 1071, "text": "But what you're describing, this kind of beauty that we're talking about now is a very small sample in terms of space time in a very big world in a very short, brief moment in this long history."}, {"time": 1088, "text": "In your book, Fundamentals, 10 Keys to Reality, I'd really recommend people read it."}, {"time": 1094, "text": "You say that space and time are pretty big or very big."}, {"time": 1100, "text": "How big are we talking about?"}, {"time": 1101, "text": "Can you tell a brief history of space and time?"}, {"time": 1106, "text": "It's easy to tell a brief history, but the details get very involved, of course, but one thing I'd like to say is that if you take a broad enough view, the history of the universe is simpler than the history of Sweden, say, because your standards are lower."}, {"time": 1125, "text": "But just to make it quantitative, I'll just give a few highlights."}, {"time": 1131, "text": "And it's a little bit easier to talk about time, so let's start with that."}, {"time": 1137, "text": "The Big Bang occurred, we think."}, {"time": 1140, "text": "The universe was much hotter and denser and more uniform about 13.8 billion years ago, and that's what we call the Big Bang."}, {"time": 1150, "text": "And it's been expanding and cooling, the matter in it has been expanding and cooling ever since."}, {"time": 1156, "text": "So in a real sense, the universe is 13.8 billion years old."}, {"time": 1160, "text": "That's a big number, kind of hard to think about."}, {"time": 1164, "text": "A nice way to think about it, though, is to map it onto one year."}, {"time": 1169, "text": "So let's say the universe just linearly mapped the time intervals from 13.8 billion years onto one year."}, {"time": 1177, "text": "So the Big Bang then is on January 1st at 12 a.m. And you wait for quite a long time before the dinosaurs emerge."}, {"time": 1191, "text": "The dinosaurs emerge on Christmas, it turns out."}, {"time": 1195, "text": "And... 12 months, almost 12 months later."}, {"time": 1197, "text": "Getting close to the end, yes."}, {"time": 1199, "text": "Getting close to the end."}, {"time": 1201, "text": "And the extinction event that let the mammals and ultimately humans inherit the Earth from the dinosaurs occurred on December 30th."}, {"time": 1213, "text": "And all of human history is a small part of the last day."}, {"time": 1218, "text": "And so, yes, so we're occupying only, and a human lifetime is a very, very infinitesimal part of this interval of these gigantic cosmic reaches of time."}, {"time": 1235, "text": "And in space, we can tell a very similar story."}, {"time": 1239, "text": "In fact, it's convenient to think that the size of the universe is the distance that light can travel in 13.8 billion years."}, {"time": 1250, "text": "So it's 13.8 billion light years."}, {"time": 1254, "text": "That's how far you can see out."}, {"time": 1256, "text": "That's how far signals can reach us."}, {"time": 1261, "text": "And that is a big distance."}, {"time": 1266, "text": "That is a big distance because compared to that, the Earth is a fraction of a light second."}, {"time": 1278, "text": "So again, it's really, really big."}, {"time": 1281, "text": "And so if we wanna think about the universe as a whole in space and time, we really need a different kind of imagination."}, {"time": 1295, "text": "It's not something you can grasp in terms of psychological time in a useful way."}, {"time": 1304, "text": "You have to think, you have to use exponential notation and abstract concepts to really get any hold on these vast times and spaces."}, {"time": 1316, "text": "On the other hand, let me hasten to add that that doesn't make us small or make the time that we have to us small."}, {"time": 1326, "text": "Because again, looking at those pictures of what our minds are and some of the components of our minds, these beautiful drawings of the cellular patterns inside the brain, you see that there are many, many, many processing units."}, {"time": 1344, "text": "And if you analyze how fast they operate, I tried to estimate how many thoughts a person can have in a lifetime."}, {"time": 1353, "text": "That's kind of a fuzzy question, but I'm very proud that I was able to define it pretty precisely."}, {"time": 1359, "text": "And it turns out we have time for billions of meaningful thoughts in a lifetime."}, {"time": 1366, "text": "So it's a lot."}, {"time": 1368, "text": "We shouldn't think of ourselves as terribly small either in space or in time, because although we're small in those dimensions compared to the universe, we're large compared to meaningful units of processing information and being able to conceptualize and understand things."}, {"time": 1391, "text": "Yeah, but 99% of those thoughts are probably food, sex, or internet related."}, {"time": 1396, "text": "Well, yeah, well, they're not necessarily, that's right."}, {"time": 1400, "text": "Only like point one is Nobel Prize winning ideas."}, {"time": 1404, "text": "That's true, but there's more to life than winning Nobel Prizes."}, {"time": 1407, "text": "How did you do that calculate?"}, {"time": 1409, "text": "Can you maybe break that apart a little bit, just kind of for fun, sort of an intuition of how we calculate the number of thoughts?"}, {"time": 1415, "text": "The number of thoughts, right."}, {"time": 1417, "text": "It's necessarily imprecise because a lot of things are going on in different ways and what is a thought."}, {"time": 1423, "text": "But there are several things that point to more or less the same rate of being able to have meaningful thoughts."}, {"time": 1432, "text": "For instance, the one that I think is maybe the most penetrating is how fast we can process visual images."}, {"time": 1447, "text": "If you've ever watched old movies, you can see that, well, any movie, in fact, a motion picture is really not a motion picture."}, {"time": 1458, "text": "It's a series of snapshots that are playing one after the other and it's because our brains also work that way."}, {"time": 1466, "text": "We take snapshots of the world, integrate over a certain time and then go on to the next one and then by post processing, create the illusion of continuity and flow, we can deal with that."}, {"time": 1478, "text": "And if the flicker rate is too slow, then you start to see that it's a series of snapshots and you can ask, what is the crossover?"}, {"time": 1491, "text": "When does it change from being something that is matched to our processing speed versus too fast?"}, {"time": 1497, "text": "And it turns out about 40 per second."}, {"time": 1500, "text": "And then if you take 40 per second as how well, how fast we can process visual images, you get to several billions of thoughts."}, {"time": 1510, "text": "If you, similarly, if you ask what are some of the fastest things that people can do?"}, {"time": 1516, "text": "Well, they can play video games, they can play the piano very fast if they're skilled at it."}, {"time": 1522, "text": "And again, you get to similar units or how fast can people talk?"}, {"time": 1527, "text": "You get to similar, you know, within a couple of orders of magnitude, you get more or less to the same idea."}, {"time": 1533, "text": "So that's how you can say that there's billions of meaningful, there's room for billions of meaningful thoughts."}, {"time": 1542, "text": "I won't argue for exactly two billion versus 1.8 billion."}, {"time": 1547, "text": "It's not that kind of question, but I think any estimate that's reasonable will come out within, say, 100 billion and 100 million."}, {"time": 1561, "text": "It would be interesting to map out for an individual human being the landscape of thoughts that they've sort of traveled."}, {"time": 1569, "text": "If you think of thoughts as a set of trajectories, what that landscape looks like."}, {"time": 1576, "text": "I mean, I've been recently really thinking about this Richard Dawkins idea of memes and just all this ideas and the evolution of ideas inside of one particular human mind and how they're then changed and evolved by interaction with other human beings."}, {"time": 1598, "text": "So if you think the number is billions, you think there's also social interaction."}, {"time": 1604, "text": "So these aren't like there's interaction in the same way you have interaction with particles."}, {"time": 1610, "text": "There's interaction between human thoughts that perhaps that interaction in itself is fundamental to the process of thinking."}, {"time": 1619, "text": "Like without social interaction, we would be like stuck, like walking in a circle."}, {"time": 1624, "text": "We need the perturbation of other humans to create change and evolution."}, {"time": 1629, "text": "Once you bring in concepts of interactions and correlations and relations, then you have what's called a combinatorial explosion that the number of possibilities expands exponentially technically with the number of things you're considering."}, {"time": 1648, "text": "And it can easily rapidly outstrip these billions of thoughts that we're talking about."}, {"time": 1656, "text": "So we definitely cannot by brute force master complex situations or think of all the possibilities in a complex situations."}, {"time": 1668, "text": "I mean, even something as relatively simple as chess is still something that human beings can't comprehend completely."}, {"time": 1677, "text": "Even the best players lose, still sometimes lose and they consistently lose to computers these days."}, {"time": 1685, "text": "And in computer science, there's a concept of NP complete."}, {"time": 1688, "text": "So large classes of problems when you scale them up beyond a few individuals become intractable."}, {"time": 1696, "text": "And so that in that sense, the world is inexhaustible."}, {"time": 1701, "text": "And that makes it beautiful that we can make any laws that generalize efficiently and well can compress all of that combinatorial complexity just like a simple rule."}, {"time": 1713, "text": "That in itself is beautiful."}, {"time": 1715, "text": "It's a happy situation."}, {"time": 1716, "text": "And I think that we can find general principles of sort of of the operating system that are comprehensible, simple, extremely powerful and let us control things very well and ask profound questions."}, {"time": 1735, "text": "And on the other hand, that the world is going to be inexhaustible."}, {"time": 1739, "text": "That once we start asking about relationships and how they evolve and social interactions and we'll never have a theory of everything in any meaningful sense because that."}, {"time": 1753, "text": "Of everything, everything, truly everything is."}, {"time": 1757, "text": "Can I ask you about the Big Bang?"}, {"time": 1759, "text": "So we talked about the space and time are really big."}, {"time": 1764, "text": "But then, and we humans give a lot of meaning to the word space and time in our like daily lives."}, {"time": 1773, "text": "But then can we talk about this moment of beginning and how we're supposed to think about it?"}, {"time": 1780, "text": "That at the moment of the Big Bang, everything was what, like infinitely small and then it just blew up?"}, {"time": 1788, "text": "We have to be careful here because there's a common misconception that the Big Bang is like the explosion of a bomb in empty space that fills up the surrounding place."}, {"time": 1802, "text": "It is space."}, {"time": 1845, "text": "Like really hot."}, {"time": 1846, "text": "Really, really, really hot."}, {"time": 1849, "text": "We're talking about way, way hotter than the surface of the sun."}, {"time": 1856, "text": "Well, in fact, if you take the equations as they come, the prediction is that the temperature just goes to infinity, but then the equations break down."}, {"time": 1866, "text": "We don't really, there are various, the equations become infinity equals infinity, so they don't feel that it's called a singularity."}, {"time": 1875, "text": "We don't really know."}, {"time": 1876, "text": "This is running the equations backwards, so you can't really get a sensible idea of what happened before the Big Bang."}, {"time": 1883, "text": "So we need different equations to address the very earliest moments."}, {"time": 1891, "text": "But so things were hotter and denser."}, {"time": 1895, "text": "We don't really know why things started out that way."}, {"time": 1900, "text": "We have a lot of evidence that they did start out that way."}, {"time": 1903, "text": "But since most of the, we don't get to visit there and do controlled experiments."}, {"time": 1915, "text": "Most of the record is very, very processed and we have to use very subtle techniques and powerful instruments to get information that has survived."}, {"time": 1931, "text": "Get closer and closer to the Big Bang."}, {"time": 1934, "text": "Get closer and closer to the beginning of things."}, {"time": 1936, "text": "And what's revealed there is that, as I said, there undoubtedly was a period when everything in the universe that we have been able to look at and understand, and that's consistent with everything, is in a condition where it was much, much hotter and much, much denser, but still obeying the laws of physics as we know them today."}, {"time": 1968, "text": "And then you start with that."}, {"time": 1971, "text": "So all the matter is in equilibrium."}, {"time": 1974, "text": "And then with small quantum fluctuations and run it forward, and then it produces, at least in broad strokes, the universe we see around us today."}, {"time": 1986, "text": "Do you think we'll ever be able to, with the tools of physics, with the way science is, with the way the human mind is, we'll ever be able to get to the moment of the Big Bang in our understanding or even the moment before the Big Bang?"}, {"time": 2001, "text": "Can we understand what happened before the Big Bang?"}, {"time": 2004, "text": "I'm optimistic both that we'll be able to measure more, so observe more, and that we'll be able to figure out more."}, {"time": 2016, "text": "So they're very, very tangible prospects for observing the extremely early universe, so even much earlier than we can observe now through looking at gravitational waves."}, {"time": 2032, "text": "Gravitational waves, since they interact so weakly with ordinary matter, sort of send a minimally processed signal from the Big Bang."}, {"time": 2043, "text": "It's a very weak signal because it's traveled a long way and diffused over long spaces, but people are gearing up to try to detect gravitational waves that could have come from the early universe."}, {"time": 2056, "text": "Yeah, LIGO's an incredible engineering project."}, {"time": 2059, "text": "It's the most sensitive, precise devices on Earth."}, {"time": 2064, "text": "The fact that humans can build something like that is truly awe inspiring from an engineering perspective."}, {"time": 2071, "text": "Right, but these gravitational waves from the early universe will probably be of a much longer wavelength than LIGO is capable of sensing, so there's a beautiful project that's contemplated to put lasers in different locations in the solar system."}, {"time": 2094, "text": "We really, really separate it by solar system scale differences, like artificial planets or moons in different places and see the tiny motions of those relative to one another as a signal of radiation from the Big Bang."}, {"time": 2110, "text": "We can also maybe indirectly see the imprint of gravitational waves from the early universe on the photons, the microwave background radiation."}, {"time": 2123, "text": "That is our present way of seeing into the earliest universe, but those photons interact much more strongly with matter."}, {"time": 2131, "text": "They're much more strongly processed, so they don't give us directly such an unprocessed view of the early universe, of the very early universe, but if gravitational waves leave some imprint on that as they move through, we could detect that too, and people are trying, as we speak, working very hard towards that goal."}, {"time": 2156, "text": "It's so exciting to think about a sensor the size of the solar system."}, {"time": 2161, "text": "That would be a fantastic, I mean, that would be a pinnacle artifact of human endeavor to me."}, {"time": 2168, "text": "It would be such an inspiring thing that just we want to know, and we go to these extraordinary lengths of making gigantic things that are also very sophisticated because what you're trying to do, you have to understand how they move."}, {"time": 2184, "text": "You have to understand the properties of light that are being used, the interference between light, and you have to be able to make the light with lasers and understand the quantum theory and get the timing exactly right."}, {"time": 2198, "text": "It's an extraordinary endeavor involving all kinds of knowledge from the very small to the very large, and all in the service of curiosity and built on a grand scale, so."}, {"time": 2212, "text": "Yeah, it would make me proud to be a human if we did that."}, {"time": 2218, "text": "I love that you're inspired both by the power of theory and the power of experiment."}, {"time": 2222, "text": "So both, I think, are exceptionally impressive that the human mind can come up with theories that give us a peek into how the universe works, but also construct tools that are way bigger than the evolutionary origins we came from."}, {"time": 2240, "text": "Right, and by the way, the fact that we can design such things and they work is an extraordinary demonstration that we really do understand a lot."}, {"time": 2250, "text": "And then in some ways."}, {"time": 2253, "text": "And it's our ability to answer questions that also leads us to be able to address more ambitious questions."}, {"time": 2259, "text": "So you mentioned at the Big Bang in the early days, things are pretty homogeneous."}, {"time": 2267, "text": "But here we are, sitting on Earth, two hairless apes, you could say, with microphones."}, {"time": 2277, "text": "In talking about the brief history of things, you said it's much harder to describe Sweden than it is the universe."}, {"time": 2283, "text": "So there's a lot of complexity."}, {"time": 2285, "text": "There was a lot of interesting details here."}, {"time": 2287, "text": "So how does this complexity come to be, do you think?"}, {"time": 2291, "text": "It seems like there's these pockets."}, {"time": 2294, "text": "We don't know how rare of like where hairless apes emerge."}, {"time": 2299, "text": "And then that came from the initial soup that was homogeneous."}, {"time": 2303, "text": "Was that an accident?"}, {"time": 2306, "text": "Well, we understand in broad outlines how it could happen."}, {"time": 2313, "text": "We certainly don't understand why it happened exactly in the way it did."}, {"time": 2320, "text": "Or there are certainly open questions about the origins of life and how inevitable the emergence of intelligence was and how that happened."}, {"time": 2328, "text": "But in the very broadest terms, the universe early on was quite homogeneous, but not completely homogeneous."}, {"time": 2341, "text": "There were part in 10,000 fluctuations in density within this primordial plasma."}, {"time": 2350, "text": "And as time goes on, there's an instability which causes those density contrasts to increase."}, {"time": 2360, "text": "There's a gravitational instability where it's denser, the gravitational attractions are stronger."}, {"time": 2365, "text": "And so that brings in more matter and it gets even denser and so on and so on."}, {"time": 2369, "text": "So there's a natural tendency of matter to clump because of gravitational interactions."}, {"time": 2377, "text": "And then the equation is complicated."}, {"time": 2379, "text": "We have lots of things clumping together."}, {"time": 2383, "text": "Then we know what the laws are, but we have to a certain extent wave our hands about what happens."}, {"time": 2391, "text": "But basic understanding of chemistry says that if things and the physics of radiation tells us that as things start to clump together, they can radiate, give off some energy."}, {"time": 2405, "text": "So they don't just, they slow down."}, {"time": 2407, "text": "As a result, they lose energy."}, {"time": 2409, "text": "They can collaborate together, cool down, form things like stars, form things like planets."}, {"time": 2416, "text": "And so in broad terms, there's no mystery."}, {"time": 2419, "text": "There's, that's what the scenario, that's what the equations tell you should happen."}, {"time": 2425, "text": "But because it's a process involving many, many fundamental individual units, the application of the laws that govern individual units to these things is very delicate, computationally very difficult."}, {"time": 2448, "text": "And more profoundly, the equations have this probability of chaos or sensitivity to initial conditions, which tells you tiny differences in the initial state can lead to enormous differences in the subsequent behavior."}, {"time": 2462, "text": "So physics, fundamental physics at some point says, okay, chemists, biologists, this is your problem."}, {"time": 2471, "text": "And then again, in broad terms, we know how it's conceivable that the humans and things like that, how complex structure can emerge."}, {"time": 2488, "text": "It's a matter of having the right kind of temperature and the right kind of stuff."}, {"time": 2496, "text": "So you need to be able to make chemical bonds that are reasonably stable and be able to make complex structures."}, {"time": 2505, "text": "And we're very fortunate that carbon has this ability to make backbones and elaborate branchings and things."}, {"time": 2514, "text": "So you can get complex things that we call biochemistry."}, {"time": 2517, "text": "And yet the bonds can be broken a little bit with the help of energetic injections from the sun."}, {"time": 2524, "text": "So you have to have both the possibility of changing, but also the useful degree of stability."}, {"time": 2530, "text": "And we know at that very, very broad level, physics can tell you that it's conceivable."}, {"time": 2537, "text": "If you want to know what really happened, what really can happen, then you have to work a bit, go to chemistry."}, {"time": 2547, "text": "If you want to know what actually happened, then you really have to consult the fossil record and biologists."}, {"time": 2553, "text": "And so these ways of addressing the issue are complimentary in a sense."}, {"time": 2563, "text": "They use different kinds of concepts, they use different languages and they address different kinds of questions, but they're not inconsistent, they're just complimentary."}, {"time": 2579, "text": "It's kind of interesting to think about those early fluctuations as our earliest ancestors."}, {"time": 2588, "text": "So it's amazing to think that this is the modern answer to the, or the modern version of what the Hindu philosophers had, that art thou."}, {"time": 2605, "text": "If you ask what, okay, those little quantum fluctuations in the early universe are the seeds out of which complexity, including plausibly humans, really evolve."}, {"time": 2620, "text": "You don't need anything else."}, {"time": 2622, "text": "That brings up the question of asking for a friend here if there's other pockets of complexity, commonly called as alien intelligent civilizations out there."}, {"time": 2639, "text": "Well, we don't know for sure, but I have a strong suspicion that the answer is yes because the one case we do have at hand to study here on Earth, we sort of know what the conditions were that were helpful to life, the right kind of temperature, the right kind of star that keeps, maintains that temperature for a long time, the liquid environment of water."}, {"time": 2668, "text": "And once those conditions emerged on Earth, which was roughly four and a half billion years ago, it wasn't very long before what we call life started to leave relics."}, {"time": 2681, "text": "So we can find forms of life, primitive forms of life that are almost as old as the Earth itself in the sense that once the Earth was turned from a very hot boiling thing and cooled off into a solid mass with water, life emerged very, very quickly."}, {"time": 2703, "text": "So it seems that these general conditions for life are enough to make it happen relatively quickly."}, {"time": 2713, "text": "Now, the other lesson I think that one can draw from this one example, it's dangerous to draw lessons from one example, but that's all we've got, and that the emergence of intelligent life is a different issue altogether."}, {"time": 2735, "text": "That took a long time and seems to have been pretty contingent for a long time."}, {"time": 2747, "text": "Well, for most of the history of life, it was single celled things."}, {"time": 2755, "text": "Even multicellular life only rose about 600 million years ago, so much after."}, {"time": 2761, "text": "And then intelligence is kind of a luxury."}, {"time": 2772, "text": "Many more kinds of creatures have big stomachs than big brains."}, {"time": 2780, "text": "In fact, most have no brains at all in any reasonable sense."}, {"time": 2785, "text": "And the dinosaurs ruled for a long, long time and some of them were pretty smart, but they were at best bird brains because birds came from the dinosaurs."}, {"time": 2797, "text": "And it could have stayed that way."}, {"time": 2801, "text": "And then the emergence of humans was very contingent and kind of a very, very recent development on evolutionary timescales."}, {"time": 2811, "text": "And you can argue about the level of human intelligence, but I think that's what we're talking about."}, {"time": 2818, "text": "It's very impressive and can ask these kinds of questions and discuss them intelligently."}, {"time": 2827, "text": "So I guess my, so this is a long winded answer or justification of my feeling is that the conditions for life in some form are probably satisfied many, many places around the universe and even within our galaxy."}, {"time": 2853, "text": "I'm not so sure about the emergence of intelligent life or the emergence of technological civilizations."}, {"time": 2861, "text": "That seems much more contingent and special."}, {"time": 2867, "text": "And we might, it's conceivable to me that we're the only example in the galaxy."}, {"time": 2874, "text": "Although, yeah, I don't know one way or the other."}, {"time": 2876, "text": "I have different opinions on different days of the week."}, {"time": 2879, "text": "But one of the things that worries me in the spirit of being humble, that our particular kind of intelligence is not very special."}, {"time": 2890, "text": "So there's all kinds of different intelligences."}, {"time": 2893, "text": "And even more broadly, there could be many different kinds of life."}, {"time": 2899, "text": "So the basic definition, and I just had, I think somebody that you know, Sarah Walker, I just had a very long conversation with her about even just the very basic question of trying to define what is life from a physics perspective."}, {"time": 2914, "text": "Even that question within itself, I think one of the most fundamental questions in science and physics and everything is just trying to get a hold, trying to get some universal laws around the ideas of what is life because that kind of unlocks a bunch of things around life, intelligence, consciousness, all those kinds of things."}, {"time": 2933, "text": "I agree with you in a sense, but I think that's a dangerous question because the answer can't be any more precise than the question."}, {"time": 2942, "text": "And the question, what is life, kind of assumes that we have a definition of life and that it's a natural phenomena that can be distinguished."}, {"time": 2954, "text": "But really there are edge cases like viruses and some people would like to say that electrons have consciousness."}, {"time": 2965, "text": "So you can't, if you really have fuzzy concepts, it's very hard to reach precise kinds of scientific answers."}, {"time": 2974, "text": "But I think there's a very fruitful question that's adjacent to it, which has been pursued in different forms for quite a while and is now becoming very sophisticated in reaching in new directions."}, {"time": 2990, "text": "And that is, what are the states of matter that are possible?"}, {"time": 2995, "text": "So in high school or grade school, you learn about solids, liquids and gases, but that really just scratches the surface of different ways that are distinguishable, that matter can form into macroscopically different, meaningful patterns that we call phases."}, {"time": 3017, "text": "And then there are precise definitions of what we mean by phases of matter and that have been worked out fruitful over the decades."}, {"time": 3026, "text": "And we're discovering new states of matter all the time and kind of having to work at what we mean by matter."}, {"time": 3033, "text": "We're discovering the capabilities of matter to organize in interesting ways."}, {"time": 3039, "text": "And some of them, like liquid crystals, are important ingredients of life."}, {"time": 3049, "text": "Our cell membranes are liquid crystals, and that's very important to the way they work."}, {"time": 3055, "text": "Recently, there's been a development in where we're talking about states of matter that are not static, but that have dynamics, that have characteristic patterns, not only in space, but in time."}, {"time": 3071, "text": "These are called time crystals, and that's been a development that's just in the last decade or so."}, {"time": 3077, "text": "It's just really, really flourishing."}, {"time": 3080, "text": "And so is there a state of matter or a group of states of matter that corresponds to life?"}, {"time": 3091, "text": "Maybe, but the answer can't be any more definite than the question."}, {"time": 3095, "text": "I mean, I gotta push back on the, those are just words."}, {"time": 3099, "text": "I mean, I disagree with you."}, {"time": 3101, "text": "The question points to a direction."}, {"time": 3105, "text": "The answer might be able to be more precise than the question, because just as you're saying, there is a, we could be discovering certain characteristics and patterns that are associated with a certain type of matter, macroscopically speaking, and that we can then be able to post facto say, this is, let's assign the word life to this kind of matter."}, {"time": 3134, "text": "I agree with that completely, that's what that's, but that's, so it's not a disagreement."}, {"time": 3139, "text": "It's very frequent in physics that, or in science, that words that are in common use get refined and reprocessed into scientific terms that's happened for things like force and energy."}, {"time": 3155, "text": "And so we, in a way, we find out what the useful definition is, or symmetry, for instance."}, {"time": 3163, "text": "And the common usage may be quite different from the scientific usage, but the scientific usage is special and takes on a life of its own, and we find out what the useful version of it is, the fruitful version of it is."}, {"time": 3182, "text": "So I do think, so in that spirit, I think if we can identify states of matter or linked states of matter that can carry on processes of self reproduction and development and information processing, we might be tempted to classify those things as life."}, {"time": 3214, "text": "Well, can I ask you about the craziest one, which is the one we know maybe least about, which is consciousness."}, {"time": 3222, "text": "Is it possible that there are certain kinds of matter would be able to classify as conscious, meaning like, so there's the panpsychists, right, who are the philosophers who kind of try to imply that all matter has some degree of consciousness, and you can almost construct like a physics of consciousness."}, {"time": 3244, "text": "Do you, again, we're in such early days of this, but nevertheless, it seems useful to talk about it."}, {"time": 3253, "text": "Is there some sense from a physics perspective to make sense of consciousness?"}, {"time": 3258, "text": "Is there some hope?"}, {"time": 3259, "text": "Well, again, consciousness is a very imprecise word and loaded with connotations that I think we should, we don't wanna start a scientific analysis with that, I don't think."}, {"time": 3274, "text": "It's often been important in science to start with simple cases and work up."}, {"time": 3283, "text": "Consciousness, I think what most people think of when you talk about consciousness is, okay, what am I doing in the world?"}, {"time": 3293, "text": "I have a rich inner life and experience, and where is that in the equations?"}, {"time": 3299, "text": "And I think that's a great question, a great, great question, and actually, I think I'm gearing up to spend part of, I mean, to try to address that in coming years."}, {"time": 3310, "text": "One version of asking that question, just as you said now, is what is the simplest formulation of that to study?"}, {"time": 3319, "text": "I think I'm much more comfortable with the idea of studying self awareness as opposed to consciousness, because that sort of gets rid of the mystical aura of the thing."}, {"time": 3330, "text": "And self awareness is in simple, you know, I think contiguous at least with ideas about feedback."}, {"time": 3341, "text": "So if you have a system that looks at its own state and responds to it, that's a kind of self awareness."}, {"time": 3350, "text": "And more sophisticated versions could be like in information processing things, computers that look into their own internal state and do something about it."}, {"time": 3363, "text": "And I think that could also be done in neural nets."}, {"time": 3368, "text": "This is called recurrent neural nets, which are hard to understand and kind of a frontier."}, {"time": 3375, "text": "So I think understanding those and gradually building up a kind of profound ability to conceptualize different levels of self awareness."}, {"time": 3392, "text": "What do you have to not know?"}, {"time": 3393, "text": "And what do you have to know?"}, {"time": 3394, "text": "And when do you know that you don't know it?"}, {"time": 3396, "text": "Or when do you, what do you think you know that you don't really know?"}, {"time": 3399, "text": "And these, I think clarifying those issues, when we clarify those issues and get a rich theory around self awareness, I think that will illuminate the questions about consciousness in a way that, you know, scratching your chin and talking about qualia and blah, blah, blah, blah is never gonna do."}, {"time": 3424, "text": "Well, I also have a different approach to the whole thing."}, {"time": 3426, "text": "So there's, from a robotics perspective, you can engineer things that exhibit qualities of consciousness without understanding how things work."}, {"time": 3439, "text": "And from that perspective, you, it's like a back door, like enter through the psychology door."}, {"time": 3448, "text": "Precisely, I think we're on the same wavelength here."}, {"time": 3452, "text": "I think that, and let me just add one comment, which is I think we should try to understand consciousness as we experience it as, in evolutionary terms, and ask ourselves, why, why does it happen?"}, {"time": 3473, "text": "This thing seems useful."}, {"time": 3477, "text": "I think we've got a conscious eyewatch here."}, {"time": 3482, "text": "Thank you, Siri."}, {"time": 3488, "text": "I'll get back to you later."}, {"time": 3525, "text": "There's, there'll also be an unconscious."}, {"time": 3527, "text": "I think that that is gonna be, turn out to be really essential to doing efficient information processing."}, {"time": 3535, "text": "And that's why it evolved, because it's, it's, it's, it's helpful in, because brains come at a high cost."}, {"time": 3546, "text": "So there has to be, there has to be a good why."}, {"time": 3549, "text": "And there's a reason, yeah."}, {"time": 3550, "text": "They're rare in evolution and big brains are rare in evolution and they, they come at a big cost."}, {"time": 3559, "text": "You mean, if you, you, they, they, they have high metabolic demands."}, {"time": 3567, "text": "They require, you know, very active lifestyle, warm bloodedness and take, take away from the ability to support metabolism of digestion."}, {"time": 3579, "text": "And so, so it's, it's, it comes at a high cost."}, {"time": 3582, "text": "It has to, it has to pay back."}, {"time": 3584, "text": "Yeah, I think it has a lot of value in social interaction."}, {"time": 3587, "text": "So I actually am spending the rest of the day today and with our friends that are, our legged friends in robotic form at Boston Dynamics."}, {"time": 3598, "text": "And I think, so my probably biggest passion is human robot interaction."}, {"time": 3605, "text": "And it seems that consciousness from the perspective of the robot is very useful to improve the human robot interaction experience."}, {"time": 3616, "text": "The first, the display of consciousness, but then to me, there's a gray area between the display of consciousness and consciousness itself."}, {"time": 3623, "text": "If you think of consciousness from an evolutionary perspective, it seems like a useful tool in human communication, so."}, {"time": 3629, "text": "Yes, it's certainly, well, whatever consciousness is will turn out to be."}, {"time": 3635, "text": "I think addressing it through its use and working up from simple cases and also working up from engineering experience in trying to do efficient computation, including efficient management of social interactions is going to really shed light on these questions."}, {"time": 3656, "text": "As I said, in a way that sort of musing abstractly about consciousness never would."}, {"time": 3661, "text": "So as I mentioned, I talked to Sarah Walker and first of all, she says, hi, spoke very highly of you."}, {"time": 3667, "text": "One of her concerns about physics and physicists and humans is that we may not fully understand the system that we're inside of."}, {"time": 3678, "text": "Meaning like, there may be limits to the kind of physics we do in trying to understand the system of which we're part of."}, {"time": 3688, "text": "So like, the observer is also the observed."}, {"time": 3693, "text": "In that sense, it seems like our tools of understanding the world, I mean, this is mostly centered around the questions of what is life, trying to understand the patterns that are characteristic of life and intelligence, all those kinds of things."}, {"time": 3713, "text": "We're not using the right tools because we're in the system."}, {"time": 3717, "text": "Is there something that resonates with you there?"}, {"time": 3721, "text": "Almost like... Well, yes, we have limitations, of course, in the amount of information we can process."}, {"time": 3732, "text": "On the other hand, we can get help from our Silicon friends and we can get help from all kinds of instruments that make up for our perceptual deficits."}, {"time": 3745, "text": "And we can use, at a conceptual level, we can use different kinds of concepts to address different kinds of questions."}, {"time": 3755, "text": "So I'm not sure exactly what problem she's talking about."}, {"time": 3760, "text": "It's a problem akin to an organism living in a 2D plane trying to understand a three dimensional world."}, {"time": 3767, "text": "Well, we can do that."}, {"time": 3768, "text": "I mean, in fact, for practical purposes, most of our experience is two dimensional."}, {"time": 3775, "text": "It's hard to move vertically."}, {"time": 3777, "text": "And yet we've produced conceptually a three dimensional symmetry and in fact, four dimensional space time."}, {"time": 3785, "text": "So by thinking in appropriate ways and using instruments and getting consistent accounts and rich accounts, we find out what concepts are necessary."}, {"time": 3802, "text": "And I don't see any end in sight of the process or any showstoppers because, let me give you an example."}, {"time": 3812, "text": "I mean, for instance, QCD, our theory of the strong interaction, has nice equations, which I helped to discover."}, {"time": 3820, "text": "What's QCD?"}, {"time": 3821, "text": "Quantum chromodynamics."}, {"time": 3822, "text": "So it's our theory of the strong interaction, the interaction that is responsible for nuclear physics."}, {"time": 3831, "text": "So it's the interaction that governs how quarks and gluons interact with each other and make protons and neutrons and all the strong, the related particles and many things in physics."}, {"time": 3845, "text": "It's one of the four basic forces of nature as we presently understand it."}, {"time": 3849, "text": "And so we have beautiful equations, which we can test in very special circumstances using at high energies, at accelerators."}, {"time": 3865, "text": "So we're certain that these equations are correct."}, {"time": 3868, "text": "Prizes are given for it and so on."}, {"time": 3870, "text": "And people try to knock it down and they can't."}, {"time": 3872, "text": "Yeah, but the situations in which we can calculate the consequences of these equations are very limited."}, {"time": 3886, "text": "So for instance, no one has been able to demonstrate that this theory, which is built on quarks and gluons, which no one, which you don't observe, actually produces protons and neutrons and the things you do observe."}, {"time": 3904, "text": "This is called the problem of confinement."}, {"time": 3907, "text": "So no one's been able to prove that analytically in a way that a human can understand."}, {"time": 3913, "text": "On the other hand, we can take these equations to a computer, to gigantic computers and compute."}, {"time": 3920, "text": "And by God, you get the world from it."}, {"time": 3925, "text": "So these equations in a way that we don't understand in terms of human concepts, we can't do the calculations, but our machines can do them."}, {"time": 3939, "text": "So with the help of what I like to call our silicon friends and their descendants in the future, we can understand in a different way that allows us to understand more."}, {"time": 3953, "text": "But I don't think we'll ever, no human is ever going to be able to solve those equations in the same way."}, {"time": 3960, "text": "So, but I think that's, you know, when we find limitations to our natural abilities, we can try to find workarounds."}, {"time": 3972, "text": "And sometimes that's appropriate concepts."}, {"time": 3975, "text": "Sometimes it's appropriate instruments."}, {"time": 3977, "text": "Sometimes it's a combination of the two."}, {"time": 3979, "text": "But I think it's premature to get defeatist about it."}, {"time": 3986, "text": "I don't see any logical contradiction or paradox or limitation that will bring this process to a halt."}, {"time": 3998, "text": "Well, I think the idea is to continue thinking outside the box in different directions, meaning just like how the math allows us to think in multiple dimensions outside of our perception system, sort of thinking, you know, coming up with new tools of mathematics or computation or all those kinds of things to take different perspectives on our universe."}, {"time": 4024, "text": "Well, I'm all for that."}, {"time": 4025, "text": "You know, and I kind of have even elevated into a principle which is of complementarity following Bohr that you need different ways of thinking even about the same things in order to do justice to their reality and answer different kinds of questions about them."}, {"time": 4043, "text": "I mean, we've several times alluded to the fact that human beings are hard to understand and the concepts that you use to understand human beings if you wanna prescribe drugs for them or see what's gonna happen if they move very fast or are exposed to radiation."}, {"time": 4065, "text": "And so that requires one kind of thinking that's very physical based on the fact that the materials that were made out of."}, {"time": 4075, "text": "On the other hand, if you want to understand how a person's going to behave in a different kind of situation, you need entirely different concepts from psychology and there's nothing wrong with that."}, {"time": 4088, "text": "You can have very different ways of addressing the same material that are useful for different purposes, right?"}, {"time": 4094, "text": "Can you describe this idea which is fascinating of complementarity a little bit?"}, {"time": 4098, "text": "Sort of first of all, what state is the principle?"}, {"time": 4106, "text": "And second of all, what are good examples starting from quantum mechanics?"}, {"time": 4110, "text": "You used to mention psychology."}, {"time": 4112, "text": "Let's talk about this more."}, {"time": 4113, "text": "It's like in your new book one of the most fascinating ideas actually."}, {"time": 4118, "text": "I think it's a wonderful, yeah."}, {"time": 4120, "text": "To me it's, well, it's the culminating chapter of the book and I think since the whole book is about the big lessons or big takeaways from profound understanding of the physical world that we've achieved, including that it's mysterious in some ways, this was the final overarching lesson, complementarity."}, {"time": 4146, "text": "Lesson, complementarity and it's a approach."}, {"time": 4156, "text": "So unlike some of these other things which are just facts about the world, like the world is both big and small and different sizes and is big but we're not small, things we talked about earlier and the fact that the universe is comprehensible and how complexity could emerge from simplicity and so those things are in the broad sense facts about the world."}, {"time": 4179, "text": "Complementarity is more an attitude towards the world than encouraged by the facts about the world."}, {"time": 4186, "text": "And it's the concept or the approach or the realization that it can be appropriate and useful and inevitable and unavoidable to use very different descriptions of the same object or the same system or the same situation to answer different kinds of questions that may be very different and even mutually uninterpretable, immutually incomprehensible."}, {"time": 4227, "text": "But both correct somehow."}, {"time": 4228, "text": "But both correct and sources of different kinds of insight which is so weird."}, {"time": 4234, "text": "But it seems to work in so many cases."}, {"time": 4236, "text": "It works in many cases and I think it's a deep fact about the world and how we should approach it."}, {"time": 4244, "text": "It's most rigorous form where it's actually a theorem if quantum mechanics is correct, occurs in quantum mechanics where the primary description of the world is in terms of wave functions."}, {"time": 4263, "text": "But let's not talk about the world."}, {"time": 4264, "text": "Let's just talk about a particle, an electron."}, {"time": 4269, "text": "The primary description of that electron is its wave function."}, {"time": 4274, "text": "And the wave function can be used to predict where it's gonna be."}, {"time": 4281, "text": "If you observe, it'll be in different places with different probabilities or how fast it's moving."}, {"time": 4287, "text": "And it'll also be moving in different ways with different probabilities."}, {"time": 4292, "text": "That's what quantum mechanics says."}, {"time": 4295, "text": "And you can predict either set of probabilities if you know what's gonna happen if I make an observation of the position or the velocity."}, {"time": 4308, "text": "So the wave function gives you ways of doing both of those."}, {"time": 4311, "text": "But to do it, to get those predictions, you have to process the wave function in different ways."}, {"time": 4317, "text": "You process it one way for position and in a different way for momentum."}, {"time": 4321, "text": "And those ways are mathematically incompatible."}, {"time": 4325, "text": "It's like you have a stone and you can sculpt it into a Venus de Milo or you can sculpt it into David, but you can't do both."}, {"time": 4338, "text": "And that's an example of complementarity."}, {"time": 4340, "text": "To answer different kinds of questions, you have to analyze the system in different ways that are mutually incompatible, but both valid to answer different kinds of questions."}, {"time": 4352, "text": "So in that case, it's a theorem, but I think it's a much more widespread phenomena that applies to many cases where we can't prove it as a theorem, but it's a piece of wisdom, if you like, and appears to be a very important insight."}, {"time": 4373, "text": "And if you ignore it, you can get very confused and misguided."}, {"time": 4382, "text": "Do you think this is a useful hack for ideas that we don't fully understand?"}, {"time": 4390, "text": "Or is this somehow a fundamental property of all or many ideas, that you can take multiple perspectives and they're both true?"}, {"time": 4400, "text": "Well, I think it's both."}, {"time": 4404, "text": "So it's both the answer to all questions."}, {"time": 4407, "text": "It's not either or, it's both."}, {"time": 4408, "text": "It's paralyzing to think that we live in a world that's fundamentally surrounded by complementary ideas."}, {"time": 4419, "text": "Because we somehow want to attach ourselves to absolute truths, and absolute truths certainly don't like the idea of complementarity."}, {"time": 4430, "text": "Yes, Einstein was very uncomfortable with complementarity."}, {"time": 4433, "text": "And in a broad sense, the famous Bohr Einstein debates revolved around this question of whether the complementarity that is a foundational feature of quantum mechanics, as we have it, is a permanent feature of the universe and our description of nature."}, {"time": 4459, "text": "And so far, quantum mechanics wins."}, {"time": 4462, "text": "And it's gone from triumph to triumph."}, {"time": 4466, "text": "Whether complementarity is rock bottom, I guess, you can never be sure."}, {"time": 4471, "text": "I mean, but it looks awfully good and it's been very successful."}, {"time": 4475, "text": "And certainly, complementarity has been extremely useful and fruitful in that domain, including some of Einstein's attempts to challenge it with the famous Einstein Podolsky Rosen experiment turned out to be confirmations that have been useful in themselves."}, {"time": 4503, "text": "But so thinking about these things was fruitful, but not in the way that Einstein hoped."}, {"time": 4507, "text": "Yeah, so as I said, in the case of quantum mechanics and this dilemma or dichotomy between processing the wave function in different ways, it's a theorem."}, {"time": 4530, "text": "They're mutually incompatible and the physical correlate of that is the Heisenberg uncertainty principle you can't have position and momentum determined at once."}, {"time": 4541, "text": "But in other cases, like one that I like to think about or like to point out as an example is free will and determinism."}, {"time": 4552, "text": "It's much less of a theorem and more a kind of way of thinking about things that I think is reassuring and avoids a lot of unnecessary quarreling and confusion."}, {"time": 4576, "text": "The quarreling I'm okay with and the confusion I'm okay with, I mean, people debate about difficult ideas, but the question is whether it could be almost a fundamental truth."}, {"time": 4586, "text": "I think it is a fundamental truth."}, {"time": 4588, "text": "That free will is both an illusion and not."}, {"time": 4592, "text": "Yes, I think that's correct."}, {"time": 4595, "text": "There's a reason why people say quantum mechanics is weird and complementarity is a big part of that."}, {"time": 4605, "text": "To say that our actual whole world is weird, the whole hierarchy of the universe is weird in this kind of particular way, and it's quite profound, but it's also humbling because it's like we're never going to be on sturdy ground in the way that humans like to be."}, {"time": 4629, "text": "It's like you have to embrace that this whole thing is like unsteady mess."}, {"time": 4638, "text": "It's one of many lessons in humility that we run into in profound understanding of the world."}, {"time": 4648, "text": "The Copernican revolution was one, that the earth is not the center of the universe."}, {"time": 4655, "text": "Darwinian evolution is another, that humans are not the pinnacle of God's creation and the apparent result of deep understanding of physical reality, that mind emerges from matter and there's no call on special life forces or souls."}, {"time": 4689, "text": "These are all lessons in humility, and I actually find complementarity a liberating concept."}, {"time": 4699, "text": "It's, okay, you know, we... Yeah, it is in a way."}, {"time": 4702, "text": "That is what I remember."}, {"time": 4708, "text": "There's a story about Dr. Johnson, and he's talking with Boswell, and Boswell was, they were discussing a sermon that they'd both heard, and the sort of culmination of the sermon was the speaker saying, I accept the universe."}, {"time": 4725, "text": "And Dr. Johnson said, well, damn well better."}, {"time": 4730, "text": "And there's a certain joy in accepting the universe because it's mind expanding."}, {"time": 4737, "text": "And to me, complementarity also suggests tolerance, suggests opportunities for understanding things in different ways that add to rather than detract from understanding."}, {"time": 4765, "text": "So I think it's an opportunity for mind expansion and demanding that there's only one way to think about things can be very limiting."}, {"time": 4776, "text": "On the free will one, that's a trippy one, though."}, {"time": 4778, "text": "To think like I am the decider of my own actions and at the same time I'm not is tricky to think about, but there does seem to be some kind of profound truth in that."}, {"time": 4793, "text": "I get, well, I think it is tied up."}, {"time": 4796, "text": "It will turn out to be tied up when we understand things better with these issues of self awareness and where we get, what we perceive as making choices, what does that really mean and what's going on under the hood."}, {"time": 4812, "text": "But I'm speculating about a future understanding that's not in place at present."}, {"time": 4817, "text": "Your sense there will always be, like as you dig into the self awareness thing, there'll always be some places where complementarity is gonna show up."}, {"time": 4826, "text": "Oh, definitely, yeah."}, {"time": 4828, "text": "I mean, there will be, how should I say?"}, {"time": 4831, "text": "There'll be kind of a God's eye view which sees everything that's going on in the computer or the brain."}, {"time": 4840, "text": "And then there's the brain's own view or the central processor or whatever it is, what we call the self, the consciousness, that's only aware of a very small part of it."}, {"time": 4853, "text": "And those are very different."}, {"time": 4854, "text": "Those are, so the God's eye view can be deterministic while the self view sees free will."}, {"time": 4867, "text": "I'm pretty sure that's how it's gonna work out actually."}, {"time": 4871, "text": "But as it stands, free will is a concept that we definitely, at least I feel I definitely experience, I can choose to do one thing then another."}, {"time": 4881, "text": "And other people I think are sufficiently similar to me that I trust that they feel the same way."}, {"time": 4890, "text": "And it's an essential concept in psychology and law and so forth."}, {"time": 4895, "text": "But at the same time, I think that mind emerges from matter and that there's an alternative description of matter that's up to subtleties about quantum mechanics, which I don't think are relevant here, really is deterministic."}, {"time": 4916, "text": "Let me ask you about some particles."}, {"time": 4919, "text": "First the absurd question, almost like a question that like Plato would ask."}, {"time": 4924, "text": "What is the smallest thing in the universe?"}, {"time": 4928, "text": "As far as we know, the fundamental particles out of which we build our most successful description of nature are points."}, {"time": 4940, "text": "They don't have any internal structure."}, {"time": 4947, "text": "So that's as small as can be."}, {"time": 4951, "text": "So what does that mean operationally?"}, {"time": 4954, "text": "That means that they obey equations that describe entities that are singular concentrations of energy, momentum, angular momentum, the things that particles have, but localized at individual points."}, {"time": 4973, "text": "Now that mathematical structure is only revealed partially in the world because to process the wave function in a way that accesses information about the precise position of things, you have to apply a lot of energy and that's an idealization and you can apply infinite amount of energy to determine a precise position."}, {"time": 4999, "text": "But at the mathematical level, we build the world out of particles that are points."}, {"time": 5006, "text": "So do they actually exist and what are we talking about?"}, {"time": 5009, "text": "Oh, they exist."}, {"time": 5010, "text": "So let me ask sort of do quarks exist?"}, {"time": 5013, "text": "Yes, do electrons exist?"}, {"time": 5016, "text": "Yes, do photons exist?"}, {"time": 5018, "text": "But what does it mean for them to exist?"}, {"time": 5068, "text": "So in the case of electrons, we can isolate them and study them and individual ones in great detail and we can check that they all actually are identical and that's why chemistry works and yes."}, {"time": 5085, "text": "So in that case, it's very tangible."}, {"time": 5089, "text": "Similarly with photons, you can study them individually, the units of light and nowadays, it's very practical to study individual photons and determine their spin and their other basic properties and check out the equations in great detail."}, {"time": 5111, "text": "For quarks and gluons, which are the other two main ingredients of our model of matter that's so successful, it's a little more complicated because the quarks and gluons that appear in our equations don't appear directly as particles you can isolate and study individually."}, {"time": 5135, "text": "They always occur within what are called bound states or structures like protons."}, {"time": 5143, "text": "A proton, roughly speaking, is composed of three quarks and a lot of gluons but we can detect them in a remarkably direct way actually nowadays, whereas at relatively low energies, the behavior of quarks is complicated."}, {"time": 5160, "text": "At high energies, they can propagate through space relatively freely for a while and we can see their tracks."}, {"time": 5171, "text": "So ultimately, they get recaptured into protons and other mesons and funny things but for a short time, they propagate freely and while that happens, we can take snapshots and see their manifestations."}, {"time": 5189, "text": "Actually, this kind of thing is exactly what I got the Nobel Prize for, predicting that this would work."}, {"time": 5239, "text": "Can we talk about asymptotic freedom, this very idea that you won the Nobel Prize for?"}, {"time": 5245, "text": "So it describes a very weird effect to me, the weird in the following way."}, {"time": 5253, "text": "So the way I think of most forces or interactions, the closer you are, the stronger the effect, the stronger the force, right?"}, {"time": 5266, "text": "With quarks, the close they are, the less so the strong interaction."}, {"time": 5273, "text": "And in fact, they're basically act like free particles when they're very close."}, {"time": 5281, "text": "But this requires a huge amount of energy."}, {"time": 5284, "text": "Like can you describe me why, how does this even work?"}, {"time": 5291, "text": "How weird it is?"}, {"time": 5292, "text": "A proper description must bring in quantum mechanics and relativity and it's, so a proper description and equations, so a proper description really is probably more than we have time for and require quite a bit of patience on your part, but."}, {"time": 5315, "text": "How does relativity come into play?"}, {"time": 5317, "text": "Wait, wait a minute."}, {"time": 5319, "text": "Relativity is important because when we talk about trying to think about short distances, we have to think about very large momenta and very large momenta are connected to very large energy in relativity."}, {"time": 5339, "text": "And so the connection between how things behave at short distances and how things behave at high energy really is connected through relativity in sort of a slightly backhanded way."}, {"time": 5353, "text": "Quantum mechanics indicates that short, to get to analyze short distances, you need to bring in probes that carry a lot of momentum."}, {"time": 5366, "text": "This again is related to uncertainty because it's the fact that you have to bring in a lot of momentum that interferes with the possibility of determining position and momentum at the same time."}, {"time": 5380, "text": "If you want to determine position, you have to use instruments that bring in a lot of momentum."}, {"time": 5385, "text": "And because of that, those same instruments can't also measure momentum because they're disturbing the momentum that, and then the momentum brings in energy and yeah."}, {"time": 5396, "text": "So that there's also the effect that asymptotic freedom comes from the possibility of spontaneously making quarks and gluons for short amounts of time that fluctuate into existence and out of existence."}, {"time": 5416, "text": "And the fact that that can be done with a very little amount of energy and uncertainty and energy translates into uncertainty and time."}, {"time": 5427, "text": "So if you do that for a short time, you can do that."}, {"time": 5431, "text": "Well, it's all comes in a package."}, {"time": 5435, "text": "So I told you it would take a while to really explain, but the results can be understood."}, {"time": 5444, "text": "I mean, we can state the results pretty simply, I think."}, {"time": 5448, "text": "So in everyday life, we do encounter some forces that increase with distance and kind of turn off at short distances."}, {"time": 5459, "text": "That's the way rubber bands work, if you think about it, or if you pull them hard, they resist, but they get flabby if the rubber band is not pulled."}, {"time": 5472, "text": "And so there are, that can happen in the physical world, but what's really difficult is to see how that could be a fundamental force that's consistent with everything else we know."}, {"time": 5484, "text": "And that's what asymptotic freedom is."}, {"time": 5488, "text": "It says that there's a very particular kind of fundamental force that involves special particles called gluons with very special properties that enables that kind of behavior."}, {"time": 5503, "text": "So there were experiment, at the time we did our work, there were experimental indications that quarks and gluons did have this kind of property, but there were no equations that were capable of capturing it."}, {"time": 5519, "text": "And we found the equations and showed how they work and showed how they, that they were basically unique."}, {"time": 5526, "text": "And this led to a complete theory of how the strong interaction works, which is the quantum chromodynamics we mentioned earlier."}, {"time": 5534, "text": "And so that's the phenomenon that quarks and gluons interact very, very weakly when they're close together."}, {"time": 5546, "text": "That's connected through relativity with the fact that they also interact very, very weakly at high energies."}, {"time": 5554, "text": "So if you have, so at high energies, the simplicity of the fundamental interaction gets revealed."}, {"time": 5562, "text": "At the time we did our work, the clues were very subtle, but nowadays at what are now high energy accelerators, it's all obvious."}, {"time": 5571, "text": "So we would have had a much, well, somebody would have had a much easier time 20 years later, looking at the data, you can sort of see the quarks and gluons."}, {"time": 5579, "text": "As I mentioned, they leave these short tracks that would have been much, much easier, but from fundamental, from indirect clues, we were able to piece together enough to make that behavior a prediction rather than a post diction, right?"}, {"time": 5595, "text": "So it becomes obvious at high energies."}, {"time": 5597, "text": "It becomes very obvious."}, {"time": 5599, "text": "When we first did this work, it was frontiers of high energy physics and at big international conferences, there would always be sessions on testing QCD and whether this proposed description of the strong interaction was in fact correct and so forth."}, {"time": 5617, "text": "And it was very exciting."}, {"time": 5619, "text": "But nowadays the same kind of work, but much more precise with calculations to more accuracy and experiments that are much more precise and comparisons that are very precise."}, {"time": 5637, "text": "Now it's called calculating backgrounds because people take this for granted and wanna see deviations from the theory, which would be the new discoveries."}, {"time": 5649, "text": "Yeah, the cutting edge becomes a foundation and the foundation becomes boring."}, {"time": 5655, "text": "Is there some, for basic explanation purposes, is there something to be said about strong interactions in the context of the strong nuclear force for the attraction between protons and neutrons versus the interaction between quarks within protons?"}, {"time": 5675, "text": "Well, quarks and gluons have the same relation basically to nuclear physics as electrons and photons have to atomic and molecular physics."}, {"time": 5689, "text": "So atoms and photons are the dynamic entities that really come into play in chemistry and atomic physics."}, {"time": 5701, "text": "Of course, you have to have the atomic nuclei, but those are small and relatively inert, really the dynamical part."}, {"time": 5709, "text": "And for most purposes of chemistry, you just say that you have this tiny little nucleus, which QCD gives you."}, {"time": 5717, "text": "Don't worry about it."}, {"time": 5717, "text": "It just, it's there."}, {"time": 5719, "text": "The real action is the electrons moving around and exchanging and things like that."}, {"time": 5726, "text": "Okay, but we want it to understand the nucleus too."}, {"time": 5729, "text": "And so atoms are sort of quantum mechanical clouds of electrons held together by electrical forces, which is photons."}, {"time": 5739, "text": "And then this radiation, which is another aspect of photons."}, {"time": 5743, "text": "That's where all the fun happens is the electrons and the photons."}, {"time": 5747, "text": "And the nucleus are kind of the, well, they give the positive charge and most of the mass of matter, but they don't, since they're so heavy, they don't move very much in chemistry."}, {"time": 5763, "text": "And I'm oversimplifying drastically."}, {"time": 5767, "text": "They're not contributing much to the interaction in chemistry."}, {"time": 5772, "text": "For most purposes in chemistry, you can just idealize them as concentrations of positive mass and charge that are, you don't have to look inside, but people are curious what's inside."}, {"time": 5784, "text": "And that was a big thing on the agenda of 20th century physics starting in the 19, well, starting with the 20th century and unfolding throughout of trying to understand what forces held the atomic nucleus together, what it was and so."}, {"time": 5804, "text": "Anyway, the story that emerges from QCD is that very similar to the way that, well, broadly similar to the way that clouds of electrons held together by electrical forces give you atoms and ultimately molecules."}, {"time": 5828, "text": "Protons and neutrons are like atoms made now out of quarks, quark clouds held together by gluons, which are like the photons that give the electric forces, but this is giving a different force, the strong force."}, {"time": 5846, "text": "And the residual forces between protons and neutrons that are leftover from the basic binding are like the residual forces between atoms that give molecules, but in the case of protons and neutrons, it gives you atomic nuclei."}, {"time": 5865, "text": "So again, for definitional purposes, QCD, quantum chromodynamics, is basically the physics of strong interaction."}, {"time": 5874, "text": "Yeah, we understand, we now would understand, I think most physicists would say it's the theory of quarks and gluons and how they interact."}, {"time": 5884, "text": "But it's a very precise, and I think it's fair to say, very beautiful theory based on mathematical symmetry of a high order, and another thing that's beautiful about it is that it's kind of in the same family as electrodynamics."}, {"time": 5906, "text": "The conceptual structure of the equations are very similar."}, {"time": 5911, "text": "They're based on having particles that respond to charge in a very symmetric way."}, {"time": 5917, "text": "In the case of electrodynamics, it's photons that respond to electric charge."}, {"time": 5922, "text": "In the case of quantum chromodynamics, there are three kinds of charge that we call colors, but they're nothing like colors."}, {"time": 5929, "text": "They really are like different kinds of charge."}, {"time": 5931, "text": "But they rhyme with the same kind of, like it's similar kind of dynamics."}, {"time": 5936, "text": "Similar kind of dynamics."}, {"time": 5937, "text": "I'd like to say that QCD is like QED on steroids."}, {"time": 5942, "text": "And instead of one photon, you have eight gluons."}, {"time": 5945, "text": "Instead of one charge, you have three color charges."}, {"time": 5949, "text": "But there's a strong family resemblance between them."}, {"time": 5953, "text": "But the context in which QCD does this thing is it's much higher energies."}, {"time": 5959, "text": "Like that's where it comes to life."}, {"time": 5960, "text": "Well, it's a stronger force, so that to access how it works and kind of pry things apart, you have to inject more energy."}, {"time": 5970, "text": "And so that gives us, in some sense, a hint of how things were in the earlier universe."}, {"time": 5979, "text": "Yeah, well, in that regard, asymptotic freedom is a tremendous blessing because it means things get simpler at high energy."}, {"time": 5988, "text": "The universe was born free."}, {"time": 5990, "text": "Born free."}, {"time": 5990, "text": "That's very good, yes."}, {"time": 5992, "text": "Universe was born."}, {"time": 5993, "text": "So in atomic physics, a similar thing happens in the theory of stars."}, {"time": 5999, "text": "Stars are hot enough that the interactions between electrons and photons, they're liberated."}, {"time": 6007, "text": "They don't form atoms anymore."}, {"time": 6008, "text": "They make a plasma, which in some ways is simpler to understand."}, {"time": 6012, "text": "You don't have complicated chemistry."}, {"time": 6014, "text": "And in the early universe, according to QCD, similarly atomic nuclei dissolved and take the constituent quarks and gluons, which are moving around very fast and interacting in relatively simple ways."}, {"time": 6027, "text": "And so this opened up the early universe to scientific calculation."}, {"time": 6033, "text": "Can I ask you about some other weird particles that make up our universe?"}, {"time": 6037, "text": "What are axions?"}, {"time": 6039, "text": "And what is the strong CP problem?"}, {"time": 6042, "text": "Okay, so let me start with what the strong CP problem is."}, {"time": 6049, "text": "First of all, well, C is charge conjugation, which is the transformation, the notional transformation, if you like, that changes all particles into their antiparticles."}, {"time": 6063, "text": "And the concept of C symmetry, charge conjugation symmetry, is that if you do that, you find the same laws that would work."}, {"time": 6076, "text": "So the laws are symmetric if the behavior that particles exhibit is the same as the behavior you get with all their antiparticles."}, {"time": 6087, "text": "And then P is parity, which is also called spatial inversion."}, {"time": 6095, "text": "It's basically looking at a mirror universe and saying that the laws that are obeyed in a mirror universe, when you look, that the mirror images obey the same laws as the sources of their images."}, {"time": 6110, "text": "There's no way of telling left from right, for instance, that the laws don't distinguish between left and right."}, {"time": 6115, "text": "Now, in the mid 20th century, people discovered that both of those are not quite true."}, {"time": 6125, "text": "Really, the equation that the mirror universe, the universe that you see in a mirror is not gonna obey the same laws as the universe that we actually interpret."}, {"time": 6143, "text": "You would be able to tell if you did the right kind of experiments, which was the mirror and which was the real thing."}, {"time": 6153, "text": "Anyway, that."}, {"time": 6154, "text": "That's the parity and they show that the parity doesn't necessarily hold."}, {"time": 6157, "text": "It doesn't quite hold."}, {"time": 6161, "text": "Examining what the exceptions are turned out to be, to lead to all kinds of insight about the nature of fundamental interactions, especially properties of neutrinos and the weak interaction, it's a long story."}, {"time": 6173, "text": "But it's a very, it's a."}, {"time": 6175, "text": "So you just define the C and the P, the conjugation, the charge conjugation."}, {"time": 6179, "text": "Now that I've done that, I wanna."}, {"time": 6181, "text": "Shove them off."}, {"time": 6184, "text": "Because it's easier to talk about T, which is time reversal symmetry."}, {"time": 6188, "text": "We have very good reasons to think CPT is an accurate symmetry of nature."}, {"time": 6197, "text": "It's on the same level as relativity and quantum mechanics, basically."}, {"time": 6200, "text": "So that better be true."}, {"time": 6203, "text": "Or else we."}, {"time": 6204, "text": "So it's symmetric when you."}, {"time": 6206, "text": "When you do."}, {"time": 6206, "text": "When you do conjugation parity and time."}, {"time": 6208, "text": "And time and space reversal."}, {"time": 6210, "text": "If you do all three, then you get the same physical consequences."}, {"time": 6215, "text": "Now, so, but that means that CP is equivalent to T. But what's observed in the world is that T is not quite an accurate symmetry of nature, either."}, {"time": 6226, "text": "So most phenomena of, at the fundamental level."}, {"time": 6232, "text": "So interactions among elementary particles and the basic gravitational interaction."}, {"time": 6239, "text": "If you ran them backwards in time, you'd get the same laws."}, {"time": 6245, "text": "So if, again, going back."}, {"time": 6248, "text": "This time we don't talk about a mirror, but we talk about a movie."}, {"time": 6253, "text": "If you take a movie and then run it backwards, that's the time reversal."}, {"time": 6261, "text": "It's good to think about a mirror in time."}, {"time": 6263, "text": "Yeah, it's like a mirror in time."}, {"time": 6265, "text": "If you run the movie backwards, it would look very strange if you were looking at complicated objects and a Charlie Chaplin movie or whatever."}, {"time": 6277, "text": "It would look very strange if you ran it backwards in time."}, {"time": 6280, "text": "But at the level of basic interactions, if you were able to look at the atoms and the quarks involved, they would obey the same laws."}, {"time": 6289, "text": "They do a very good approximation, but not exactly."}, {"time": 6293, "text": "So this is not exactly, that means you could tell."}, {"time": 6295, "text": "You could tell, but you'd have to do very, very subtle experiments with at high energy accelerators to take a movie that looked different when you ran it backwards."}, {"time": 6308, "text": "This was a discovery by two great physicists named Jim Cronin and Val Fitch in the mid 1960s."}, {"time": 6320, "text": "Previous to that, over all the centuries of development of physics with all its precise laws, they did seem to have this gratuitous property that they look the same if you run the equations backwards."}, {"time": 6333, "text": "It's kind of an embarrassing property actually because life isn't like that."}, {"time": 6338, "text": "So empirical reality does not have this imagery in any obvious way."}, {"time": 6342, "text": "And yet the laws did."}, {"time": 6344, "text": "It's almost like the laws of physics are missing something fundamental about life if it holds that property, right?"}, {"time": 6351, "text": "Well, that's the embarrassing nature of it."}, {"time": 6354, "text": "Yeah, it's embarrassing."}, {"time": 6391, "text": "And that's still an interesting endeavor."}, {"time": 6395, "text": "And actually it's an exciting frontier of physics now to sort of explore the boundary between when that's true and when it's not true."}, {"time": 6402, "text": "When you get to smaller objects and exceptions like time crystals."}, {"time": 6407, "text": "I definitely have to ask you about time crystals in a second here."}, {"time": 6410, "text": "But so the CP problem and T, so there's all of these."}, {"time": 6415, "text": "We're in danger of infinite regress, but we have to convert soon."}, {"time": 6420, "text": "Can't possibly be turtles all the way down."}, {"time": 6422, "text": "We're gonna get to the bottom turtle."}, {"time": 6423, "text": "So it became, so it got to be a real, I mean, it's a really puzzling thing why the laws should have this very odd property that we don't need."}, {"time": 6436, "text": "And in fact, it's kind of an embarrassment in addressing empirical reality."}, {"time": 6442, "text": "But it seemed to be almost, it seemed to be exactly true for a long time."}, {"time": 6446, "text": "And then almost true."}, {"time": 6449, "text": "And in way, almost true is even, is more disturbing than exactly true because exactly true, it could have been just a fundamental feature of the world."}, {"time": 6459, "text": "And at some level you just have to take it as it is."}, {"time": 6462, "text": "And if it's a beautiful, easily articulatable regularity, you could say that, okay, that's fine as a fundamental law of nature."}, {"time": 6471, "text": "But to say that it's approximately true, but not exactly, that's weird."}, {"time": 6476, "text": "So, and then, so there was great progress in the late part of the 20th century in getting to an understanding of fundamental interactions in general that shed light on this issue."}, {"time": 6494, "text": "It turns out that the basic principles of relativity and quantum mechanics, plus the kind of high degree of symmetry that we found, the so called gauge symmetry that characterizes the fundamental interactions, when you put all that together, it's a very, very constraining framework."}, {"time": 6517, "text": "And it has some indirect consequences because the possible interactions are so constrained."}, {"time": 6525, "text": "And one of the indirect consequences is that the possibilities for violating the symmetry between forwards and backwards in time are very limited."}, {"time": 6537, "text": "They're basically only two."}, {"time": 6541, "text": "And one of them occurs and leads to a very rich theory that explains the Cronin Fish experiment and a lot of things that have been done subsequently has been used to make all kinds of successful predictions."}, {"time": 6553, "text": "So that's turned out to be a very rich interaction."}, {"time": 6559, "text": "It's esoteric and the effects only show up at accelerators and are small and so on, but they might've been very important in the early universe and lead to them be connected to the asymmetry between matter and antimatter in the present universe."}, {"time": 6572, "text": "And so, but that's another digression."}, {"time": 6576, "text": "The point is that that was fine."}, {"time": 6580, "text": "That was a triumph to say that there was one possible kind of interaction that would violate time reversal symmetry."}, {"time": 6587, "text": "And sure enough, there it is."}, {"time": 6589, "text": "But the other kind doesn't occur."}, {"time": 6594, "text": "So we still got a problem."}, {"time": 6595, "text": "Why doesn't it occur?"}, {"time": 6599, "text": "So we're close to really finally understanding this profound gratuitous feature of the world that is almost but not quite symmetric under reversing the direction of time, but not quite there."}, {"time": 6612, "text": "And to understand that last bit is a challenging frontier of physics today."}, {"time": 6622, "text": "And we have a promising proposal for how it works, which is a kind of theory of evolution."}, {"time": 6631, "text": "So there's this possible interaction, which we call a coupling, and there's a numerical quantity that tells us how strong that is."}, {"time": 6641, "text": "And traditionally in physics, we think of these kinds of numerical quantities as constants of nature that you just have to put them in."}, {"time": 6654, "text": "From experiment, they have a certain value and that's it."}, {"time": 6657, "text": "And who am I to question what God doing?"}, {"time": 6661, "text": "They're just constant."}, {"time": 6662, "text": "Well, they seem to be just constants."}, {"time": 6664, "text": "I'm just wondering."}, {"time": 6666, "text": "But in this case, it's been fruitful to think and work out a theory where that strength of interaction is actually not a constant."}, {"time": 6683, "text": "It's a fun, it's a field."}, {"time": 6687, "text": "It's a, fields are the fundamental ingredients of modern physics."}, {"time": 6692, "text": "Like there's an electron field, there's a photon field, which is also called the electromagnetic field."}, {"time": 6697, "text": "And so all of these particles are manifestations of different fields."}, {"time": 6701, "text": "And there could be a field, something that depends on space and time."}, {"time": 6707, "text": "So a dynamical entity instead of just a constant here."}, {"time": 6713, "text": "And if you do things in a nice way, that's very symmetric, very much suggested aesthetically by the theory."}, {"time": 6722, "text": "But the theory we do have, then you find that you get a field which as it evolves from the early universe, settles down to a value that's just right to make the laws very nearly exact, invariant or symmetric with respect to reversal of time."}, {"time": 6753, "text": "It might appear as a constant, but it's actually a field that evolved over time."}, {"time": 6756, "text": "It evolved over time, okay."}, {"time": 6758, "text": "But when you examine this proposal in detail, you find that it hasn't quite settled down to exactly zero."}, {"time": 6767, "text": "There it's still, the field is still moving around a little bit."}, {"time": 6772, "text": "And because the motion is so, the motion is so difficult."}, {"time": 6779, "text": "The material is so rigid."}, {"time": 6780, "text": "And this material, the field that fills all space is so rigid."}, {"time": 6783, "text": "Even small amounts of motion can involve lots of energy."}, {"time": 6788, "text": "And that energy takes the form of particles, fields that are in motion are always associated with particles."}, {"time": 6798, "text": "And those are the axioms."}, {"time": 6800, "text": "And if you calculate how much energy is in these residual oscillations, this axiom gas that fills all the universe, if this fundamental theory is correct, you get just the right amount to make the dark matter that astronomers want."}, {"time": 6819, "text": "And it has just the right properties."}, {"time": 6821, "text": "So I'd love to believe that."}, {"time": 6824, "text": "So that might be a thing that unlocks, might be the key to understanding dark matter."}, {"time": 6830, "text": "Yeah, I'd like to think so."}, {"time": 6831, "text": "And many, many physicists are coming around to this point of view, which I've been a voice in the wilderness."}, {"time": 6838, "text": "I was a voice in the wilderness for a long time, but now it's become very popular, maybe even dominant."}, {"time": 6844, "text": "So almost like, so this axion particle slash field would be the thing that explains dark matter."}, {"time": 6853, "text": "It explains, yeah, would solve this fundamental question of finally, of why the laws are almost, but not quite exactly the same if you run them backwards in time."}, {"time": 6866, "text": "And then seemingly in a totally different conceptual universe, it would also provide, give us an understanding of the dark matter."}, {"time": 6878, "text": "That's not what it was designed for."}, {"time": 6881, "text": "And the theory wasn't proposed with that in mind, but when you work out the equations, that's what you get."}, {"time": 6887, "text": "That's always a good sign."}, {"time": 6891, "text": "I think I vaguely read somewhere that there may be early experimental validation of axion."}, {"time": 6899, "text": "Is that, am I reading the wrong?"}, {"time": 6903, "text": "Well, there've been quite a few false alarms and I think there are some of them still, people desperately wanna find this thing."}, {"time": 6910, "text": "And, but I don't think any of them are convincing at this point, but there are very ambitious experiments and kind of new, you have to design new kinds of antennas that are capable of detecting these predicted particles."}, {"time": 6928, "text": "And it's very difficult."}, {"time": 6929, "text": "They interact very, very weakly."}, {"time": 6931, "text": "If it were easy, it would have been done already."}, {"time": 6933, "text": "But I think there's good hope that we can get down to the required sensitivity and actually test whether these ideas are right in coming years or maybe decades."}, {"time": 6947, "text": "And then understand one of the big mysteries, like literally big in terms of its fraction of the universe is dark matter."}, {"time": 6956, "text": "Let me ask you about, you mentioned a few times, time crystals."}, {"time": 6962, "text": "These things are, it's a very beautiful idea when we start to treat space and time as similar frameworks."}, {"time": 6974, "text": "Physical phenomena."}, {"time": 6975, "text": "Right, that's what motivated it."}, {"time": 6977, "text": "First of all, what are crystals?"}, {"time": 6980, "text": "And what are time crystals?"}, {"time": 6980, "text": "Okay, so crystals are orderly arrangements of atoms in space."}, {"time": 6987, "text": "And many materials, if you cool them down gently, will form crystals."}, {"time": 6998, "text": "And so we say that that's a state of matter that forms spontaneously."}, {"time": 7005, "text": "And an important feature of that state of matter is that the end result, the crystal, has less symmetry than the equations that give rise to the crystal."}, {"time": 7023, "text": "So the equations, the basic equations of physics are the same if you move a little bit."}, {"time": 7032, "text": "So you can move, they're homogeneous, but crystals aren't."}, {"time": 7036, "text": "The atoms are in particular place, so they have less symmetry."}, {"time": 7040, "text": "And time crystals are the same thing in time, basically."}, {"time": 7047, "text": "But of course, so it's not positions of atoms, but it's orderly behavior that certain states of matter will arrange themselves into spontaneously if you treat them gently and let them do what they want to do."}, {"time": 7066, "text": "But repeat in that same way indefinitely."}, {"time": 7070, "text": "That's the crystalline form."}, {"time": 7071, "text": "You can also have time liquids, or you can have all kinds of other states of matter."}, {"time": 7077, "text": "You can also have space time crystals where the pattern only repeats if with each step of time, you also move at a certain direction in space."}, {"time": 7087, "text": "So yeah, basically it's states of matter that displace structure in time spontaneously."}, {"time": 7097, "text": "So here's the difference."}, {"time": 7101, "text": "When it happens in time, it sure looks a lot like it's motion, and if it repeats indefinitely, it sure looks a lot like perpetual motion."}, {"time": 7112, "text": "Like looks like free lunch."}, {"time": 7115, "text": "And I was told that there's no such thing as free lunch."}, {"time": 7119, "text": "Does this violate laws of thermodynamics?"}, {"time": 7122, "text": "No, but it requires a critical examination of the laws of thermodynamics."}, {"time": 7127, "text": "I mean, let me say on background that the laws of thermodynamics are not fundamental laws of physics."}, {"time": 7135, "text": "There are things we prove under certain circumstances emerge from the fundamental laws of physics."}, {"time": 7143, "text": "They're not, we don't posit them separately."}, {"time": 7146, "text": "They're meant to be deduced, and they can be deduced under limited circumstances, but not necessarily universally."}, {"time": 7152, "text": "And we're finding some of the subtleties and sort of accept edge cases where they don't apply in a straightforward way."}, {"time": 7162, "text": "And this is one."}, {"time": 7165, "text": "So time crystals do obey, do have this structure in time, but it's not a free lunch because although in a sense, things are moving, they're already doing what they want to do."}, {"time": 7179, "text": "They're in the, so if you want to extract energy from it, you're gonna be foiled because there's no spare energy there."}, {"time": 7190, "text": "So you can add energy to it and kind of disturb it, but you can't extract energy from this motion because it's gonna, it wants to do, that's the lowest energy configuration that there is, so you can't get further energy out of it."}, {"time": 7206, "text": "So in theory, I guess perpetual motion, you would be able to extract energy from it if such a thing was to be created, you can then milk it for energy."}, {"time": 7217, "text": "Well, what's usually meant in the literature of perpetual motion is a kind of macroscopic motion that you could extract energy from and somehow it would crank back up."}, {"time": 7233, "text": "That's not the case here."}, {"time": 7235, "text": "If you want to extract energy, this motion is not something you can extract energy from."}, {"time": 7242, "text": "If you intervene in the behavior, you can change it, but only by injecting energy, not by taking away energy."}, {"time": 7251, "text": "You mentioned that a theory of everything may be quite difficult to come by."}, {"time": 7256, "text": "A theory of everything broadly defined meaning like truly a theory of everything, but let's look at a more narrow theory of everything, which is the way it's used often in physics is a theory that unifies our current laws of physics, general relativity, quantum field theory."}, {"time": 7279, "text": "Do you have thoughts on this dream of a theory of everything in physics?"}, {"time": 7285, "text": "How close are we?"}, {"time": 7286, "text": "Is there any promising ideas out there in your view?"}, {"time": 7289, "text": "Well, it would be nice to have."}, {"time": 7292, "text": "It would be aesthetically pleasing."}, {"time": 7295, "text": "Will it be useful?"}, {"time": 7296, "text": "No, probably not."}, {"time": 7298, "text": "Well, I shouldn't, it's dangerous to say that, but probably not."}, {"time": 7305, "text": "I think we, certainly not in the foreseeable future."}, {"time": 7312, "text": "Maybe to understand black holes."}, {"time": 7314, "text": "Yeah, but that's, yes, maybe to understand black holes, but that's not useful."}, {"time": 7320, "text": "That's my book."}, {"time": 7357, "text": "They're questions about very, very small black holes when quantum effects come into play so that black holes are, not black holes, they're emitting this discovery of Hawking called Hawking radiation, which for astronomical black holes is a tiny, tiny effect that no one has ever observed, it's a prediction that's never been checked."}, {"time": 7384, "text": "So like supermassive black holes, that doesn't apply?"}, {"time": 7386, "text": "No, no, the predicted rate of radiation from those black holes is so tiny that it's absolutely unobservable and is overwhelmed by all kinds of other effects."}, {"time": 7457, "text": "We don't, but."}, {"time": 7459, "text": "But what about the engineering question?"}, {"time": 7461, "text": "So if we look at space travel, so I think you've spoken with him, Eric Weinstein."}, {"time": 7468, "text": "Really, you know, he says things like we want to get off this planet."}, {"time": 7476, "text": "His intuition is almost motivated for the engineering project of space exploration in order for us to crack this problem of becoming a multi planetary species, we have to solve the physics problem."}, {"time": 7489, "text": "His intuition is like, if we figure out this, what he calls the source code, which is like, like a theory of everything might give us clues on how to start hacking the fabric of reality, like getting shortcuts, right?"}, {"time": 7506, "text": "I can't say that, you know, I can't say that it won't, but I can say that in the 1970s and early 1980s, we achieved huge steps in understanding matter."}, {"time": 7523, "text": "QCD, much better understanding of the weak interaction, much better understanding of quantum mechanics in general."}, {"time": 7532, "text": "And it's had minimal impact on technology."}, {"time": 7536, "text": "On rocket design, on propulsion."}, {"time": 7538, "text": "On rocket design, on anything, any technology whatsoever."}, {"time": 7542, "text": "And now we're talking about much more esoteric things."}, {"time": 7546, "text": "And since I don't know what they are, I can't say for sure that they won't affect technology, but I'm very, very skeptical that they would affect technology."}, {"time": 7557, "text": "Because, you know, to access them, you need very exotic circumstances to make new kinds of particles with high energy."}, {"time": 7564, "text": "You need accelerators that are very expensive and you don't produce many of them, and so forth."}, {"time": 7569, "text": "You know, it's just, it's a pipe dream, I think."}, {"time": 7573, "text": "Yeah, about space exploration."}, {"time": 7575, "text": "I'm not sure exactly what he has in mind, but to me, it's more a problem of, I don't know, something between biology and... And information processing."}, {"time": 7594, "text": "Processing, what you mean, how should I..."}, {"time": 7597, "text": "I think human bodies are not well adapted to space."}, {"time": 7603, "text": "Even Mars, which is the closest thing to a kind of human environment that we're gonna find anywhere close by."}, {"time": 7612, "text": "Very, very difficult to maintain humans on Mars."}, {"time": 7617, "text": "And it's gonna be very expensive and very unstable."}, {"time": 7622, "text": "But I think, however, if we take a broader view of what it means to bring human civilization outside of the Earth, if we're satisfied with sending mines out there that we can converse with and actuators that we can manipulate and sensors that we can get feedback from, I think that's where it's at."}, {"time": 7657, "text": "And I think that's so much more realistic."}, {"time": 7661, "text": "And I think that's the long term future of space exploration."}, {"time": 7668, "text": "It's not hauling human bodies all over the place."}, {"time": 7670, "text": "That's just silly."}, {"time": 7674, "text": "It's possible that human bodies..."}, {"time": 7676, "text": "So like you said, it's a biology problem."}, {"time": 7679, "text": "What's possible is that we extend human life span in some way, we have to look at a bigger picture."}, {"time": 7687, "text": "It could be just like you're saying, by sending robots with actuators and kind of extending our limbs."}, {"time": 7696, "text": "But it could also be extending some aspect of our minds, some information, all those kinds of things."}, {"time": 7700, "text": "And it could be cyborgs, it could be, it could be... No, we're talking, not getting the fun."}, {"time": 7706, "text": "It could be, you know, it could be human brains or cells that realize something like human brain architecture within artificial environments, you know, shells, if you like, that are more adapted to the conditions of space."}, {"time": 7727, "text": "And that, yeah, so that's entirely man machine hybrids, as well as sort of remote outposts that we can communicate with."}, {"time": 7739, "text": "I think those will happen."}, {"time": 7742, "text": "Yeah, to me, there's some sense in which, as opposed to understanding the physics of the fundamental fabric of the universe, I think getting to the physics of life, the physics of intelligence, the physics of consciousness will, the physics of information that brings, from which life emerges, that will allow us to do space exploration."}, {"time": 7772, "text": "Yeah, well, I think physics in the larger sense has a lot to contribute here."}, {"time": 7776, "text": "Not the physics of finding fundamental new laws in the sense of another quark or axions even."}, {"time": 7784, "text": "But physics in the sense of, physics has a lot of experience in analyzing complex situations and analyzing new states of matter and devising new kinds of instruments that do clever things."}, {"time": 7801, "text": "Physics in that sense has enormous amounts to contribute to this kind of endeavor."}, {"time": 7809, "text": "But I don't think that looking for a so called theory of everything has much to do with it at all."}, {"time": 7819, "text": "What advice would you give to a young person today with a bit of fire in their eyes, high school student, college student, thinking about what to do with their life, maybe advice about career or bigger advice about life in general?"}, {"time": 7837, "text": "Well, first read fundamentals because there I've tried to give some coherent deep advice."}, {"time": 7845, "text": "That's fundamentals, 10 keys to reality by Frank Kulczyk."}, {"time": 7850, "text": "So that's a good place to start."}, {"time": 7850, "text": "Available everywhere."}, {"time": 7852, "text": "If you wanna learn what I can tell you."}, {"time": 7856, "text": "Is there an audio book?"}, {"time": 7857, "text": "I read that ebook."}, {"time": 7858, "text": "Yes, there is an audio book."}, {"time": 7859, "text": "There's an audio book, that's awesome."}, {"time": 7860, "text": "I think it's, I can give three pieces of wise advice that I think are generally applicable."}, {"time": 7868, "text": "One is to cast a wide net, to really look around and see what looks promising, what catches your imagination and promising."}, {"time": 7885, "text": "Yeah, and those, you have to balance those two things."}, {"time": 7888, "text": "You could have things that catch your imagination, but don't look promising in the sense that the questions aren't ripe or, and things that you, and part of what makes things attractive is that, whether you thought you liked them or not, is if you can see that there's ferment and new ideas coming up that become, that's attractive in itself."}, {"time": 7909, "text": "So when I started out, I thought I was, and when I was an undergraduate, I intended to study philosophy or questions of how mind emerges from matter."}, {"time": 7917, "text": "But I thought that that wasn't really right."}, {"time": 7920, "text": "Timing isn't right yet."}, {"time": 7921, "text": "The right, the timing wasn't right for the kind of mathematical thinking and conceptualization that I really enjoy and am good at."}, {"time": 7932, "text": "But, so that's one thing, cast a wide net, look around."}, {"time": 7938, "text": "And that's a pretty easy thing to do today because of the internet."}, {"time": 7947, "text": "You can look at all kinds of things."}, {"time": 7950, "text": "You have to be careful though because there's a lot of crap also."}, {"time": 7953, "text": "But you can sort of tell the difference if you do a little digging."}, {"time": 7962, "text": "So don't settle on just, what your thesis advisor tells you to do or what your teacher tells you to do."}, {"time": 7969, "text": "Look for yourself and get a sense of what seems promising, not what seemed promising 10 years ago or, so that's one."}, {"time": 7983, "text": "Another thing is to, is kind of complimentary to that."}, {"time": 7989, "text": "Well, they're all complimentary."}, {"time": 7992, "text": "Complimentary to that is to read history and read the masters, the history of ideas and masters of ideas."}, {"time": 8002, "text": "I'd benefited enormously from, as early in my career, from reading in physics, Einstein in the original and Feynman's lectures as they were coming out and Darwin."}, {"time": 8019, "text": "You know, these, you can learn what it, and Galileo, you can learn what it is to wrestle with difficult ideas and how great minds did that."}, {"time": 8028, "text": "You can learn a lot about style, how to write your ideas up and express them in clear ways."}, {"time": 8037, "text": "And also just a couple of that with, I also enjoy reading biographies."}, {"time": 8042, "text": "And biographies, yes, similarly, right, yeah."}, {"time": 8044, "text": "So it gives you the context of the human being that created those ideas."}, {"time": 8048, "text": "Right, and brings it down to earth in the sense that, you know, it was really human beings who did this."}, {"time": 8054, "text": "It's not, and they made mistakes."}, {"time": 8057, "text": "And yeah, I also got inspiration from Bertrand Russell who was a big hero and H.G."}, {"time": 8062, "text": "Wells and yeah."}, {"time": 8065, "text": "So read the masters, make contact with great minds."}, {"time": 8071, "text": "And when you are sort of narrowing down on a subject, learn about the history of the subject because that really puts in context what you're trying to do and also gives a sense of community and grandeur to the whole enterprise."}, {"time": 8086, "text": "And then the third piece of advice is complimentary to both those, which is sort of to get the basics under control as soon as possible."}, {"time": 8100, "text": "So if you wanna do theoretical work in science, you know, you have to learn calculus, multivariable calculus, complex variables, group theory."}, {"time": 8111, "text": "Nowadays, you have to be highly computer literate if you want to do experimental work."}, {"time": 8116, "text": "You also have to be computer literate and you have to learn about electronics and optics and instruments."}, {"time": 8122, "text": "So get that under control as soon as possible because it's like learning a language to produce great works and express yourself fluently and with confidence."}]}]