[{"title": "Kate Darling: Social Robotics | Lex Fridman Podcast #98", "id": "7KTbEn7PiaY", "quotes": [{"time": 312, "text": "So it's so interesting to me to see kind of these Silicon Valley people latch onto this concept that came from a very kind of left wing socialist, kind of a different place in Europe."}, {"time": 326, "text": "But on the automation labor markets topic, I think that it's very, so sometimes in those conversations, I think people overestimate where robotic technology is right now."}, {"time": 344, "text": "And we also have this fallacy of constantly comparing robots to humans and thinking of this as a one to one replacement of jobs."}, {"time": 351, "text": "So even like Bill Gates a few years ago said something about, maybe we should have a system that taxes robots for taking people's jobs."}, {"time": 363, "text": "And it just, I mean, I'm sure that was taken out of context, he's a really smart guy, but that sounds to me like kind of viewing it as a one to one replacement versus viewing this technology as kind of a supplemental tool that of course is going to shake up a lot of stuff."}, {"time": 381, "text": "It's going to change the job landscape, but I don't see, you know, robots taking all the jobs in the next 20 years."}, {"time": 387, "text": "That's just not how it's going to work."}, {"time": 390, "text": "So maybe drifting into the land of more personal relationships with robots and interaction and so on."}, {"time": 396, "text": "I got to warn you, I go, I may ask some silly philosophical questions."}, {"time": 403, "text": "Oh, please do."}, {"time": 405, "text": "Do you think humans will abuse robots in their interactions?"}, {"time": 405, "text": "So you've had a lot of, and we'll talk about it sort of anthropomorphization and this intricate dance, emotional dance between human and robot, but there seems to be also a darker side where people, when they treat the other as servants, especially, they can be a little bit abusive or a lot abusive."}, {"time": 433, "text": "Do you think about that?"}, {"time": 436, "text": "Yeah, I do think about that."}, {"time": 436, "text": "So, I mean, one of my main interests is the fact that people subconsciously treat robots like living things."}, {"time": 442, "text": "And even though they know that they're interacting with a machine and what it means in that context to behave violently."}, {"time": 448, "text": "I don't know if you could say abuse because you're not actually abusing the inner mind of the robot."}, {"time": 455, "text": "The robot doesn't have any feelings."}, {"time": 462, "text": "As far as you know."}, {"time": 464, "text": "It also depends on how we define feelings and consciousness."}, {"time": 464, "text": "But I think that's another area where people kind of overestimate where we currently are with the technology."}, {"time": 474, "text": "The robots are not even as smart as insects right now."}, {"time": 474, "text": "And so I'm not worried about abuse in that sense."}, {"time": 480, "text": "But it is interesting to think about what does people's behavior towards these things mean for our own behavior?"}, {"time": 485, "text": "Is it desensitizing the people to be verbally abusive to a robot or even physically abusive?"}, {"time": 497, "text": "It's a similar connection from like if you play violent video games, what connection does that have to desensitization to violence?"}, {"time": 502, "text": "I haven't read literature on that."}, {"time": 502, "text": "I wonder about that."}, {"time": 512, "text": "Because everything I've heard, people don't seem to any longer be so worried about violent video games."}, {"time": 518, "text": "The research on it is, it's a difficult thing to research."}, {"time": 518, "text": "So it's sort of inconclusive, but we seem to have gotten the sense, at least as a society, that people can compartmentalize."}, {"time": 526, "text": "When it's something on a screen and you're shooting a bunch of characters or running over people with your car, that doesn't necessarily translate to you doing that in real life."}, {"time": 538, "text": "We do, however, have some concerns about children playing violent video games."}, {"time": 544, "text": "And so we do restrict it there."}, {"time": 549, "text": "I'm not sure that's based on any real evidence either, but it's just the way that we've kind of decided we want to be a little more cautious there."}, {"time": 554, "text": "And the reason I think robots are a little bit different is because there is a lot of research showing that we respond differently to something in our physical space than something on a screen."}, {"time": 563, "text": "We will treat it much more viscerally, much more like a physical actor."}, {"time": 569, "text": "And so it's totally possible that this is not a problem."}, {"time": 578, "text": "And it's the same thing as violence in video games."}, {"time": 578, "text": "Maybe restrict it with kids to be safe, but adults can do what they want."}, {"time": 583, "text": "But we just need to ask the question again because we don't have any evidence at all yet."}, {"time": 588, "text": "Maybe there's an intermediate place too."}, {"time": 588, "text": "I did my research on Twitter."}, {"time": 595, "text": "By research, I mean scrolling through your Twitter feed."}, {"time": 600, "text": "You mentioned that you were going at some point to an animal law conference."}, {"time": 604, "text": "So I have to ask, do you think there's something that we can learn from animal rights that guides our thinking about robots?"}, {"time": 612, "text": "Oh, I think there is so much to learn from that."}, {"time": 612, "text": "I'm actually writing a book on it right now."}, {"time": 612, "text": "That's why I'm going to this conference."}, {"time": 617, "text": "So I'm writing a book that looks at the history of animal domestication and how we've used animals for work, for weaponry, for companionship."}, {"time": 627, "text": "And one of the things the book tries to do is move away from this fallacy that I talked about of comparing robots and humans because I don't think that's the right analogy."}, {"time": 633, "text": "But I do think that on a social level, even on a social level, there's so much that we can learn from looking at that history because throughout history, we've treated most animals like tools, like products."}, {"time": 649, "text": "And then some of them we've treated differently and we're starting to see people treat robots in really similar ways."}, {"time": 653, "text": "So I think it's a really helpful predictor to how we're going to interact with the robots."}, {"time": 657, "text": "Do you think we'll look back at this time like 100 years from now and see what we do to animals as like similar to the way we view like the Holocaust in World War II?"}, {"time": 673, "text": "I mean, I hope so."}, {"time": 673, "text": "I am not convinced that we will."}, {"time": 673, "text": "But I often wonder, you know, what are my grandkids going to view as, you know, abhorrent that my generation did that they would never do?"}, {"time": 688, "text": "And I'm like, well, what's the big deal?"}, {"time": 688, "text": "You know, it's a fun question to ask yourself."}, {"time": 693, "text": "It always seems that there's atrocities that we discover later."}, {"time": 693, "text": "So the things that at the time people didn't see as, you know, you look at everything from slavery to any kinds of abuse throughout history to the kind of insane wars that were happening to the way war was carried out and rape and the kind of violence that was happening during war that we now, you know, we see as atrocities, but at the time perhaps didn't as much."}, {"time": 725, "text": "And so now I have this intuition that I have this worry, maybe you're going to probably criticize me, but I do anthropomorphize robots."}, {"time": 740, "text": "I don't see a fundamental philosophical difference between a robot and a human being in terms of once the capabilities are matched."}, {"time": 751, "text": "So the fact that we're really far away doesn't, in terms of capabilities and then that from natural language processing, understanding and generation to just reasoning and all that stuff."}, {"time": 763, "text": "I think once you solve it, I see though, this is a very gray area and I don't feel comfortable with the kind of abuse that people throw at robots."}, {"time": 773, "text": "Subtle, but I can see it becoming, I can see basically a civil rights movement for robots in the future."}, {"time": 781, "text": "Do you think, let me put it in the form of a question, do you think robots should have some kinds of rights?"}, {"time": 787, "text": "Well, it's interesting because I came at this originally from your perspective."}, {"time": 793, "text": "I was like, you know what, there's no fundamental difference between technology and like human consciousness."}, {"time": 799, "text": "Like we, we can probably recreate anything."}, {"time": 799, "text": "We just don't know how yet."}, {"time": 804, "text": "And so there's no reason not to give machines the same rights that we have once, like you say, they're kind of on an equivalent level."}, {"time": 812, "text": "But I realized that that is kind of a far future question."}, {"time": 818, "text": "I still think we should talk about it because I think it's really interesting."}, {"time": 821, "text": "But I realized that it's actually, we might need to ask the robot rights question even sooner than that while the machines are still, quote unquote, really dumb and not on our level because of the way that we perceive them."}, {"time": 836, "text": "And I think one of the lessons we learned from looking at the history of animal rights and one of the reasons we may not get to a place in a hundred years where we view it as wrong to, you know, eat or otherwise, you know, use animals for our own purposes is because historically we've always protected those things that we relate to the most."}, {"time": 851, "text": "So one example is whales."}, {"time": 857, "text": "No one gave a shit about the whales."}, {"time": 857, "text": "Am I allowed to swear?"}, {"time": 857, "text": "Yeah, no one gave a shit about freedom."}, {"time": 866, "text": "Yeah, no one gave a shit about the whales until someone recorded them singing."}, {"time": 866, "text": "And suddenly people were like, oh, this is a beautiful creature and now we need to save the whales."}, {"time": 871, "text": "And that started the whole Save the Whales movement in the 70s."}, {"time": 875, "text": "So as much as I, and I think a lot of people want to believe that we care about consistent biological criteria, that's not historically how we formed our alliances."}, {"time": 892, "text": "Yeah, so what, why do we, why do we believe that all humans are created equal?"}, {"time": 900, "text": "Killing of a human being, no matter who the human being is, that's what I meant by equality, is bad."}, {"time": 907, "text": "And then, because I'm connecting that to robots and I'm wondering whether mortality, so the killing act is what makes something, that's the fundamental first right."}, {"time": 914, "text": "So I am currently allowed to take a shotgun and shoot a Roomba."}, {"time": 921, "text": "I think, I'm not sure, but I'm pretty sure it's not considered murder, right."}, {"time": 929, "text": "Or even shutting them off."}, {"time": 929, "text": "So that's, that's where the line appears to be, right?"}, {"time": 936, "text": "Is this mortality a critical thing here?"}, {"time": 936, "text": "I think here again, like the animal analogy is really useful because you're also allowed to shoot your dog, but people won't be happy about it."}, {"time": 949, "text": "So we give, we do give animals certain protections from like, you're not allowed to torture your dog and set it on fire, at least in most states and countries, but you're still allowed to treat it like a piece of property in a lot of other ways."}, {"time": 964, "text": "And so we draw these arbitrary lines all the time."}, {"time": 971, "text": "And, you know, there's a lot of philosophical thought on why viewing humans as something unique is not, is just speciesism and not, you know, based on any criteria that would actually justify making a difference between us and other species."}, {"time": 991, "text": "Do you think in general people, most people are good?"}, {"time": 998, "text": "Do you think, or do you think there's evil and good in all of us?"}, {"time": 998, "text": "Is that's revealed through our circumstances and through our interactions?"}, {"time": 1009, "text": "I like to view myself as a person who like believes that there's no absolute evil and good and that everything is, you know, gray."}, {"time": 1015, "text": "But I do think it's an interesting question."}, {"time": 1023, "text": "Like when I see people being violent towards robotic objects, you said that bothers you because the robots might someday, you know, be smart."}, {"time": 1028, "text": "And is that why?"}, {"time": 1035, "text": "Well, it bothers me because it reveals, so I personally believe, because I've studied way too, so I'm Jewish."}, {"time": 1041, "text": "I studied the Holocaust and World War II exceptionally well."}, {"time": 1041, "text": "I personally believe that most of us have evil in us."}, {"time": 1046, "text": "That what bothers me is the abuse of robots reveals the evil in human beings."}, {"time": 1055, "text": "And it's, I think it doesn't just bother me."}, {"time": 1055, "text": "It's, I think it's an opportunity for roboticists to make, help people find the better sides, the angels of their nature, right?"}, {"time": 1064, "text": "That abuse isn't just a fun side thing."}, {"time": 1073, "text": "That's a, you revealing a dark part that you shouldn't, that should be hidden deep inside."}, {"time": 1079, "text": "I mean, you laugh, but some of our research does indicate that maybe people's behavior towards robots reveals something about their tendencies for empathy generally, even using very simple robots that we have today that like clearly don't feel anything."}, {"time": 1096, "text": "So, you know, Westworld is maybe, you know, not so far off and it's like, you know, depicting the bad characters as willing to go around and shoot and rape the robots and the good characters is not wanting to do that."}, {"time": 1112, "text": "Even without assuming that the robots have consciousness."}, {"time": 1117, "text": "So there's a opportunity, it's interesting, there's opportunity to almost practice empathy."}, {"time": 1122, "text": "The, on robots is an opportunity to practice empathy."}, {"time": 1127, "text": "Some people would say, why are we practicing empathy on robots instead of, you know, on our fellow humans or on animals that are actually alive and experienced the world?"}, {"time": 1139, "text": "And I don't agree with them because I don't think empathy is a zero sum game."}, {"time": 1139, "text": "And I do think that it's a muscle that you can train and that we should be doing that."}, {"time": 1143, "text": "But some people disagree."}, {"time": 1149, "text": "So the interesting thing, you've heard, you know, raising kids sort of asking them or telling them to be nice to the smart speakers, to Alexa and so on, saying please and so on during the requests."}, {"time": 1168, "text": "I don't know if, I'm a huge fan of that idea because yeah, that's towards the idea of practicing empathy."}, {"time": 1174, "text": "I feel like politeness, I'm always polite to all the, all the systems that we build, especially anything that's speech interaction based."}, {"time": 1179, "text": "Like when we talk to the car, I'll always have a pretty good detector for please to, I feel like there should be a room for encouraging empathy in those interactions."}, {"time": 1191, "text": "So I agree with you."}, {"time": 1191, "text": "So I'm going to play devil's advocate."}, {"time": 1198, "text": "So what is the, what is the devil's advocate argument there?"}, {"time": 1198, "text": "The devil's advocate argument is that if you are the type of person who has abusive tendencies or needs to get some sort of like behavior like that out, needs an outlet for it, that it's great to have a robot that you can scream at so that you're not screaming at a person."}, {"time": 1214, "text": "And we just don't know whether that's true, whether it's an outlet for people or whether it just kind of, as my friend once said, trains their cruelty muscles and makes them more cruel in other situations."}, {"time": 1226, "text": "And that expands to other topics, which I, I don't know, you know, there's a, there's a topic of sex, which is weird one that I tend to avoid it from robotics perspective."}, {"time": 1242, "text": "And most of the general public doesn't, they talk about sex robots and so on."}, {"time": 1242, "text": "Is that an area you've touched at all research wise?"}, {"time": 1250, "text": "Like the way, cause that's what people imagine sort of any kind of interaction between human and robot that shows any kind of compassion."}, {"time": 1257, "text": "They immediately think from a product perspective in the near term is sort of expansion of what pornography is and all that kind of stuff."}, {"time": 1270, "text": "Do researchers touch this?"}, {"time": 1270, "text": "Well that's kind of you to like characterize it as though there's thinking rationally about product."}, {"time": 1276, "text": "I feel like sex robots are just such a like titillating news hook for people that they become like the story."}, {"time": 1280, "text": "And it's really hard to not get fatigued by it when you're in the space because you tell someone you do human robot interaction."}, {"time": 1292, "text": "Of course, the first thing they want to talk about is sex robots."}, {"time": 1292, "text": "Yeah, it happens a lot."}, {"time": 1297, "text": "And it's, it's unfortunate that I'm so fatigued by it because I do think that there are some interesting questions that become salient when you talk about, you know, sex with robots."}, {"time": 1308, "text": "See what I think would happen when people get sex robots, like if it's some guys, okay, guys get female sex robots."}, {"time": 1314, "text": "What I think there's an opportunity for is an actual, like, like they'll actually interact."}, {"time": 1323, "text": "What I'm trying to say, they won't outside of the sex would be the most fulfilling part."}, {"time": 1329, "text": "Like the interaction, it's like the folks who there's movies and this, right, who pray, pay a prostitute and then end up just talking to her the whole time."}, {"time": 1335, "text": "So I feel like there's an opportunity."}, {"time": 1341, "text": "It's like most guys and people in general joke about this, the sex act, but really people are just lonely inside and they're looking for connection."}, {"time": 1347, "text": "Many of them."}, {"time": 1352, "text": "And it'd be unfortunate if that connection is established through the sex industry."}, {"time": 1352, "text": "I feel like it should go into the front door of like, people are lonely and they want a connection."}, {"time": 1366, "text": "Well, I also feel like we should kind of de, you know, de stigmatize the sex industry because, you know, even prostitution, like there are prostitutes that specialize in disabled people who don't have the same kind of opportunities to explore their sexuality."}, {"time": 1379, "text": "So it's, I feel like we should like de stigmatize all of that generally."}, {"time": 1387, "text": "But yeah, that connection and that loneliness is an interesting topic that you bring up because while people are constantly worried about robots replacing humans and oh, if people get sex robots and the sex is really good, then they won't want their, you know, partner or whatever."}, {"time": 1403, "text": "But we rarely talk about robots actually filling a hole where there's nothing and what benefit that can provide to people."}, {"time": 1409, "text": "Yeah, I think that's an exciting, there's a whole giant, there's a giant hole that's unfillable by humans."}, {"time": 1417, "text": "It's asking too much of your, of people, your friends and people you're in a relationship with in your family to fill that hole."}, {"time": 1427, "text": "There's, because, you know, it's exploring the full, like, you know, exploring the full complexity and richness of who you are."}, {"time": 1434, "text": "Like who are you really?"}, {"time": 1434, "text": "Like people, your family doesn't have enough patience to really sit there and listen to who are you really."}, {"time": 1442, "text": "And I feel like there's an opportunity to really make that connection with robots."}, {"time": 1446, "text": "I just feel like we're complex as humans and we're capable of lots of different types of relationships."}, {"time": 1451, "text": "So whether that's, you know, with family members, with friends, with our pets, or with robots, I feel like there's space for all of that and all of that can provide value in a different way."}, {"time": 1469, "text": "So I'm jumping around."}, {"time": 1469, "text": "Currently most of my work is in autonomous vehicles."}, {"time": 1475, "text": "So the most popular topic among the general public is the trolley problem."}, {"time": 1475, "text": "So most, most, most roboticists kind of hate this question, but what do you think of this thought experiment?"}, {"time": 1492, "text": "What do you think we can learn from it outside of the silliness of the actual application of it to the autonomous vehicle?"}, {"time": 1496, "text": "I think it's still an interesting ethical question."}, {"time": 1500, "text": "And that in itself, just like much of the interaction with robots has something to teach us."}, {"time": 1506, "text": "But from your perspective, do you think there's anything there?"}, {"time": 1510, "text": "Well, I think you're right that it does have something to teach us because, but I think what people are forgetting in all of these conversations is the origins of the trolley problem and what it was meant to show us, which is that there is no right answer."}, {"time": 1519, "text": "And that sometimes our moral intuition that comes to us instinctively is not actually what we should follow if we care about creating systematic rules that apply to everyone."}, {"time": 1534, "text": "So I think that as a philosophical concept, it could teach us at least that, but that's not how people are using it right now."}, {"time": 1548, "text": "These are friends of mine and I love them dearly and their project adds a lot of value."}, {"time": 1548, "text": "But if we're viewing the moral machine project as what we can learn from the trolley problems, the moral machine is, I'm sure you're familiar, it's this website that you can go to and it gives you different scenarios like, oh, you're in a car, you can decide to run over these two people or this child."}, {"time": 1570, "text": "What do you choose?"}, {"time": 1570, "text": "Do you choose the homeless person?"}, {"time": 1570, "text": "Do you choose the person who's jaywalking?"}, {"time": 1605, "text": "So how do we encode these ethical choices in interaction with robots?"}, {"time": 1605, "text": "For example, autonomous vehicles, there is a serious ethical question of do I protect myself?"}, {"time": 1618, "text": "Does my life have higher priority than the life of another human being?"}, {"time": 1618, "text": "Because that changes certain control decisions that you make."}, {"time": 1625, "text": "So if your life matters more than other human beings, then you'd be more likely to swerve out of your current lane."}, {"time": 1631, "text": "So currently automated emergency braking systems that just brake, they don't ever swerve."}, {"time": 1636, "text": "So swerving into oncoming traffic or no, just in a different lane can cause significant harm to others, but it's possible that it causes less harm to you."}, {"time": 1651, "text": "So that's a difficult ethical question."}, {"time": 1651, "text": "Do you have a hope that like the trolley problem is not supposed to have a right answer, right?"}, {"time": 1661, "text": "Do you hope that when we have robots at the table, we'll be able to discover the right answer for some of these questions?"}, {"time": 1670, "text": "Well, what's happening right now, I think, is this question that we're facing of what ethical rules should we be programming into the machines is revealing to us that our ethical rules are much less programmable than we probably thought before."}, {"time": 1683, "text": "And so that's a really valuable insight, I think, that these issues are very complicated and that in a lot of these cases, it's you can't really make that call, like not even as a legislator."}, {"time": 1699, "text": "And so what's going to happen in reality, I think, is that car manufacturers are just going to try and avoid the problem and avoid liability in any way possible."}, {"time": 1711, "text": "Or like they're going to always protect the driver because who's going to buy a car if it's programmed to kill someone?"}, {"time": 1721, "text": "Kill you instead of someone else."}, {"time": 1721, "text": "So that's what's going to happen in reality."}, {"time": 1727, "text": "But what did you mean by like once we have robots at the table, like do you mean when they can help us figure out what to do?"}, {"time": 1734, "text": "No, I mean when robots are part of the ethical decisions."}, {"time": 1734, "text": "So no, no, no, not they help us."}, {"time": 1744, "text": "Oh, you mean when it's like, should I run over a robot or a person?"}, {"time": 1748, "text": "So what, no, no, no."}, {"time": 1748, "text": "So when you, it's exactly what you said, which is when you have to encode the ethics into an algorithm, you start to try to really understand what are the fundamentals of the decision making process you make to make certain decisions."}, {"time": 1768, "text": "Should you, like capital punishment, should you take a person's life or not to punish them for a certain crime?"}, {"time": 1774, "text": "Sort of, you can use, you can develop an algorithm to make that decision, right?"}, {"time": 1782, "text": "And the hope is that the act of making that algorithm, however you make it, so there's a few approaches, will help us actually get to the core of what is right and what is wrong under our current societal standards."}, {"time": 1800, "text": "But isn't that what's happening right now?"}, {"time": 1800, "text": "And we're realizing that we don't have a consensus on what's right and wrong."}, {"time": 1806, "text": "You mean in politics in general?"}, {"time": 1808, "text": "Well, like when we're thinking about these trolley problems and autonomous vehicles and how to program ethics into machines and how to, you know, make AI algorithms fair and equitable, we're realizing that this is so complicated and it's complicated in part because there doesn't seem to be a one right answer in any of these cases."}, {"time": 1830, "text": "Do you have a hope for, like one of the ideas of the moral machine is that crowdsourcing can help us converge towards, like democracy can help us converge towards the right answer."}, {"time": 1842, "text": "Do you have a hope for crowdsourcing?"}, {"time": 1843, "text": "Well, yes and no."}, {"time": 1843, "text": "So I think that in general, you know, I have a legal background and policymaking is often about trying to suss out, you know, what rules does this particular society agree on and then trying to codify that."}, {"time": 1855, "text": "So the law makes these choices all the time and then tries to adapt according to changing culture."}, {"time": 1860, "text": "But in the case of the moral machine project, I don't think that people's choices on that website necessarily reflect what laws they would want in place."}, {"time": 1872, "text": "I think you would have to ask them a series of different questions in order to get at what their consensus is."}, {"time": 1880, "text": "I agree, but that has to do more with the artificial nature of, I mean, they're showing some cute icons on a screen."}, {"time": 1885, "text": "That's almost, so if you, for example, we do a lot of work in virtual reality."}, {"time": 1892, "text": "And so if you put those same people into virtual reality where they have to make that decision, their decision would be very different, I think."}, {"time": 1902, "text": "I agree with that."}, {"time": 1902, "text": "That's one aspect."}, {"time": 1902, "text": "And the other aspect is it's a different question to ask someone, would you run over the homeless person or the doctor in this scene?"}, {"time": 1907, "text": "Or do you want cars to always run over the homeless people?"}, {"time": 1917, "text": "I think, yeah."}, {"time": 1917, "text": "So let's talk about anthropomorphism."}, {"time": 1917, "text": "To me, anthropomorphism, if I can pronounce it correctly, is one of the most fascinating phenomena from like both the engineering perspective and the psychology perspective, machine learning perspective, and robotics in general."}, {"time": 1934, "text": "Can you step back and define anthropomorphism, how you see it in general terms in your work?"}, {"time": 1945, "text": "So anthropomorphism is this tendency that we have to project human like traits and behaviors and qualities onto nonhumans."}, {"time": 1952, "text": "And we often see it with animals, like we'll project emotions on animals that may or may not actually be there."}, {"time": 1958, "text": "We often see that we're trying to interpret things according to our own behavior when we get it wrong."}, {"time": 1963, "text": "But we do it with more than just animals."}, {"time": 1969, "text": "We do it with objects, you know, teddy bears."}, {"time": 1969, "text": "We see, you know, faces in the headlights of cars."}, {"time": 1973, "text": "And we do it with robots very, very extremely."}, {"time": 1979, "text": "You think that can be engineered?"}, {"time": 1979, "text": "Can that be used to enrich an interaction between an AI system and the human?"}, {"time": 1988, "text": "And do you see it being used that way often?"}, {"time": 1988, "text": "Like, I don't, I haven't seen, whether it's Alexa or any of the smart speaker systems, often trying to optimize for the anthropomorphization."}, {"time": 2006, "text": "You said you haven't seen?"}, {"time": 2007, "text": "I haven't seen."}, {"time": 2007, "text": "They keep moving away from that."}, {"time": 2007, "text": "I think they're afraid of that."}, {"time": 2012, "text": "They actually, so I only recently found out, but did you know that Amazon has like a whole team of people who are just there to work on Alexa's personality?"}, {"time": 2024, "text": "So I know that depends on what you mean by personality."}, {"time": 2024, "text": "I didn't know that exact thing."}, {"time": 2030, "text": "But I do know that how the voice is perceived is worked on a lot, whether if it's a pleasant feeling about the voice, but that has to do more with the texture of the sound and the audio and so on."}, {"time": 2044, "text": "But personality is more like..."}, {"time": 2048, "text": "It's like, what's her favorite beer when you ask her?"}, {"time": 2048, "text": "And the personality team is different for every country too."}, {"time": 2053, "text": "Like there's a different personality for German Alexa than there is for American Alexa."}, {"time": 2057, "text": "That said, I think it's very difficult to, you know, use the, really, really harness the anthropomorphism with these voice assistants because the voice interface is still very primitive."}, {"time": 2074, "text": "And I think that in order to get people to really suspend their disbelief and treat a robot like it's alive, less is sometimes more."}, {"time": 2080, "text": "You want them to project onto the robot and you want the robot to not disappoint their expectations for how it's going to answer or behave in order for them to have this kind of illusion."}, {"time": 2091, "text": "And with Alexa, I don't think we're there yet, or Siri, that they're just not good at that."}, {"time": 2097, "text": "But if you look at some of the more animal like robots, like the baby seal that they use with the dementia patients, it's a much more simple design."}, {"time": 2108, "text": "It doesn't try to talk to you."}, {"time": 2108, "text": "It can't disappoint you in that way."}, {"time": 2112, "text": "It just makes little movements and sounds and people stroke it and it responds to their touch."}, {"time": 2117, "text": "And that is like a very effective way to harness people's tendency to kind of treat the robot like a living thing."}, {"time": 2128, "text": "So you bring up some interesting ideas in your paper chapter, I guess, Anthropomorphic Framing Human Robot Interaction that I read the last time we scheduled this."}, {"time": 2140, "text": "Oh my God, that was a long time ago."}, {"time": 2142, "text": "What are some good and bad cases of anthropomorphism in your perspective?"}, {"time": 2149, "text": "Like when is the good ones and bad?"}, {"time": 2152, "text": "Well, I should start by saying that, you know, while design can really enhance the anthropomorphism, it doesn't take a lot to get people to treat a robot like it's alive."}, {"time": 2156, "text": "Like people will, over 85% of Roombas have a name, which I'm, I don't know the numbers for your regular type of vacuum cleaner, but they're not that high, right?"}, {"time": 2167, "text": "So people will feel bad for the Roomba when it gets stuck, they'll send it in for repair and want to get the same one back."}, {"time": 2172, "text": "And that's, that one is not even designed to like make you do that."}, {"time": 2175, "text": "So I think that some of the cases where it's maybe a little bit concerning that anthropomorphism is happening is when you have something that's supposed to function like a tool and people are using it in the wrong way."}, {"time": 2192, "text": "And one of the concerns is military robots where, so gosh, 2000, like early 2000s, which is a long time ago, iRobot, the Roomba company made this robot called the Pacbot that was deployed in Iraq and Afghanistan with the bomb disposal units that were there."}, {"time": 2211, "text": "And the soldiers became very emotionally attached to the robots."}, {"time": 2219, "text": "And that's fine until a soldier risks his life to save a robot, which you really don't want."}, {"time": 2228, "text": "But they were treating them like pets."}, {"time": 2228, "text": "Like they would name them, they would give them funerals with gun salutes, they would get really upset and traumatized when the robot got broken."}, {"time": 2237, "text": "So in situations where you want a robot to be a tool, in particular, when it's supposed to like do a dangerous job that you don't want a person doing, it can be hard when people get emotionally attached to it."}, {"time": 2246, "text": "That's maybe something that you would want to discourage."}, {"time": 2252, "text": "Another case for concern is maybe when companies try to leverage the emotional attachment to exploit people."}, {"time": 2259, "text": "So if it's something that's not in the consumer's interest, trying to like sell them products or services or exploit an emotional connection to keep them paying for a cloud service for a social robot or something like that might be, I think that's a little bit concerning as well."}, {"time": 2279, "text": "Yeah, the emotional manipulation, which probably happens behind the scenes now with some like social networks and so on, but making it more explicit."}, {"time": 2284, "text": "What's your favorite robot?"}, {"time": 2292, "text": "Fictional or real?"}, {"time": 2293, "text": "No, real."}, {"time": 2293, "text": "Real robot, which you have felt a connection with or not like, not anthropomorphic connection, but I mean like you sit back and say, damn, this is an impressive system."}, {"time": 2312, "text": "So two different robots."}, {"time": 2312, "text": "So the, the PLEO baby dinosaur robot that is no longer sold that came out in 2007, that one I was very impressed with."}, {"time": 2318, "text": "It was, but, but from an anthropomorphic perspective, I was impressed with how much I bonded with it, how much I like wanted to believe that it had this inner life."}, {"time": 2331, "text": "Can you describe PLEO, can you describe what it is?"}, {"time": 2331, "text": "How big is it?"}, {"time": 2331, "text": "What can it actually do?"}, {"time": 2338, "text": "PLEO is about the size of a small cat."}, {"time": 2338, "text": "It had a lot of like motors that gave it this kind of lifelike movement."}, {"time": 2346, "text": "It had things like touch sensors and an infrared camera."}, {"time": 2346, "text": "So it had all these like cool little technical features, even though it was a toy."}, {"time": 2351, "text": "And the thing that really struck me about it was that it, it could mimic pain and distress really well."}, {"time": 2358, "text": "So if you held it up by the tail, it had a tilt sensor that, you know, told it what direction it was facing and it would start to squirm and cry out."}, {"time": 2368, "text": "If you hit it too hard, it would start to cry."}, {"time": 2374, "text": "So it was very impressive in design."}, {"time": 2378, "text": "And what's the second robot that you were, you said there might've been two that you liked."}, {"time": 2383, "text": "So the Boston Dynamics robots are just impressive feats of engineering."}, {"time": 2389, "text": "Have you met them in person?"}, {"time": 2391, "text": "I recently got a chance to go visit and I, you know, I was always one of those people who watched the videos and was like, this is super cool, but also it's a product video."}, {"time": 2395, "text": "Like, I don't know how many times that they had to shoot this to get it right."}, {"time": 2403, "text": "But visiting them, I, you know, I'm pretty sure that I was very impressed."}, {"time": 2410, "text": "And in terms of the control, I think that was a transformational moment for me when I met Spot Mini in person."}, {"time": 2418, "text": "Because, okay, maybe this is a psychology experiment, but I anthropomorphized the, the crap out of it."}, {"time": 2426, "text": "So I immediately, it was like my best friend, right?"}, {"time": 2430, "text": "I think it's really hard for anyone to watch Spot move and not feel like it has agency."}, {"time": 2435, "text": "This movement, especially the arm on Spot Mini really obviously looks like a head."}, {"time": 2444, "text": "That they say, no, wouldn't mean it that way, but it obviously, it looks exactly like that."}, {"time": 2451, "text": "And so it's almost impossible to not think of it as a, almost like the baby dinosaur, but slightly larger."}, {"time": 2457, "text": "And this movement of the, of course, the intelligence is, their whole idea is that it's not supposed to be intelligent."}, {"time": 2462, "text": "It's a platform on which you build higher intelligence."}, {"time": 2468, "text": "It's actually really, really dumb."}, {"time": 2468, "text": "It's just a basic movement platform."}, {"time": 2473, "text": "But even dumb robots can, like, we can immediately respond to them in this visceral way."}, {"time": 2479, "text": "What are your thoughts about Sophia the robot?"}, {"time": 2479, "text": "This kind of mix of some basic natural language processing and basically an art experiment."}, {"time": 2491, "text": "An art experiment is a good way to characterize it."}, {"time": 2491, "text": "I'm much less impressed with Sophia than I am with Boston Dynamics."}, {"time": 2497, "text": "She said she likes you."}, {"time": 2497, "text": "She said she admires you."}, {"time": 2500, "text": "She followed me on Twitter at some point."}, {"time": 2504, "text": "She tweets about how much she likes you."}, {"time": 2505, "text": "I have to be nice or?"}, {"time": 2508, "text": "No, I don't know."}, {"time": 2508, "text": "I was emotionally manipulating you."}, {"time": 2508, "text": "How do you think of that?"}, {"time": 2515, "text": "I think of the whole thing that happened with Sophia is quite a large number of people kind of immediately had a connection and thought that maybe we're far more advanced with robotics than we are or actually didn't even think much."}, {"time": 2526, "text": "I was surprised how little people cared that they kind of assumed that, well, of course AI can do this."}, {"time": 2539, "text": "And then if they assume that, I felt they should be more impressed."}, {"time": 2546, "text": "Well, people really overestimate where we are."}, {"time": 2546, "text": "And so when something, I don't even think Sophia was very impressive or is very impressive."}, {"time": 2553, "text": "I think she's kind of a puppet, to be honest."}, {"time": 2553, "text": "But yeah, I think people are a little bit influenced by science fiction and pop culture to think that we should be further along than we are."}, {"time": 2565, "text": "So what's your favorite robots in movies and fiction?"}, {"time": 2569, "text": "What do you like about WALLI?"}, {"time": 2569, "text": "The humor, the cuteness, the perception control systems operating on WALLI that makes it all work?"}, {"time": 2578, "text": "Just in general?"}, {"time": 2582, "text": "The design of WALLI the robot, I think that animators figured out, starting in the 1940s, how to create characters that don't look real, but look like something that's even better than real, that we really respond to and think is really cute."}, {"time": 2599, "text": "They figured out how to make them move and look in the right way."}, {"time": 2603, "text": "And WALLI is just such a great example of that."}, {"time": 2607, "text": "You think eyes, big eyes or big something that's kind of eyeish."}, {"time": 2607, "text": "So it's always playing on some aspect of the human face, right?"}, {"time": 2616, "text": "So big eyes."}, {"time": 2616, "text": "Well, I think one of the first animations to really play with this was Bambi."}, {"time": 2624, "text": "And they weren't originally going to do that."}, {"time": 2624, "text": "They were originally trying to make the deer look as lifelike as possible."}, {"time": 2628, "text": "They brought deer into the studio and had a little zoo there so that the animators could work with them."}, {"time": 2633, "text": "And then at some point they were like, if we make really big eyes and a small nose and big cheeks, kind of more like a baby face, then people like it even better than if it looks real."}, {"time": 2642, "text": "Do you think the future of things like Alexa in the home has possibility to take advantage of that, to build on that, to create these systems that are better than real, that create a close human connection?"}, {"time": 2658, "text": "I can pretty much guarantee you without having any knowledge that those companies are going to make these things."}, {"time": 2672, "text": "And companies are working on that design behind the scenes."}, {"time": 2672, "text": "I'm pretty sure."}, {"time": 2677, "text": "I totally disagree with you."}, {"time": 2679, "text": "So that's what I'm interested in."}, {"time": 2679, "text": "I'd like to build such a company."}, {"time": 2679, "text": "I know a lot of those folks and they're afraid of that because how do you make money off of it?"}, {"time": 2689, "text": "Well, but even just making Alexa look a little bit more interesting than just a cylinder would do so much."}, {"time": 2695, "text": "It's an interesting thought, but I don't think people are from Amazon perspective are looking for that kind of connection."}, {"time": 2702, "text": "They want you to be addicted to the services provided by Alexa, not to the device."}, {"time": 2708, "text": "So the device itself, it's felt that you can lose a lot because if you create a connection and then it creates more opportunity for frustration for negative stuff than it does for positive stuff is I think the way they think about it."}, {"time": 2729, "text": "Like I agree that it's very difficult to get right and you have to get it exactly right."}, {"time": 2735, "text": "Otherwise you wind up with Microsoft's Clippy."}, {"time": 2740, "text": "Okay, easy now."}, {"time": 2740, "text": "What's your problem with Clippy?"}, {"time": 2743, "text": "You like Clippy?"}, {"time": 2743, "text": "Is Clippy your friend?"}, {"time": 2745, "text": "Yeah, I like Clippy."}, {"time": 2745, "text": "I was just, I just talked to, we just had this argument and they said Microsoft's CTO and they said, he said he's not bringing Clippy back."}, {"time": 2751, "text": "They're not bringing Clippy back and that's very disappointing."}, {"time": 2757, "text": "I think it was Clippy was the greatest assistance we've ever built."}, {"time": 2765, "text": "It was a horrible attempt, of course, but it's the best we've ever done because it was a real attempt to have like a actual personality."}, {"time": 2770, "text": "I mean, it was obviously technology was way not there at the time of being able to be a recommender system for assisting you in anything and typing in Word or any kind of other application, but still it was an attempt of personality that was legitimate, which I thought was brave."}, {"time": 2794, "text": "You know, you've convinced me I'll be slightly less hard on Clippy."}, {"time": 2799, "text": "And I know I have like an army of people behind me who also miss Clippy."}, {"time": 2803, "text": "I want to meet these people."}, {"time": 2803, "text": "Who are these people?"}, {"time": 2807, "text": "It's the people who like to hate stuff when it's there and miss it when it's gone."}, {"time": 2815, "text": "So everyone."}, {"time": 2816, "text": "It's everyone."}, {"time": 2816, "text": "So Enki and Jibo, the two companies, the two amazing companies, the social robotics companies that have recently been closed down."}, {"time": 2832, "text": "Why do you think it's so hard to create a personal robotics company?"}, {"time": 2832, "text": "So making a business out of essentially something that people would anthropomorphize, have a deep connection with."}, {"time": 2843, "text": "Why is it so hard to make it work?"}, {"time": 2843, "text": "Is the business case not there or what is it?"}, {"time": 2848, "text": "I think it's a number of different things."}, {"time": 2848, "text": "I don't think it's going to be this way forever."}, {"time": 2855, "text": "I think at this current point in time, it takes so much work to build something that only barely meets people's minimal expectations because of science fiction and pop culture giving people this idea that we should be further than we already are."}, {"time": 2869, "text": "Like when people think about a robot assistant in the home, they think about Rosie from the Jetsons or something like that."}, {"time": 2873, "text": "And Enki and Jibo did such a beautiful job with the design and getting that interaction just right."}, {"time": 2886, "text": "But I think people just wanted more."}, {"time": 2886, "text": "They wanted more functionality."}, {"time": 2886, "text": "I think you're also right that the business case isn't really there because there hasn't been a killer application that's useful enough to get people to adopt the technology in great numbers."}, {"time": 2897, "text": "I think what we did see from the people who did get Jibo is a lot of them became very emotionally attached to it."}, {"time": 2903, "text": "But that's not, I mean, it's kind of like the Palm Pilot back in the day."}, {"time": 2911, "text": "Most people are like, why do I need this?"}, {"time": 2915, "text": "Why would I?"}, {"time": 2915, "text": "They don't see how they would benefit from it until they have it or some other company comes in and makes it a little better."}, {"time": 2920, "text": "Like how far away are we, do you think?"}, {"time": 2925, "text": "How hard is this problem?"}, {"time": 2925, "text": "And I think it has a lot to do with people's expectations and those keep shifting depending on what science fiction that is popular."}, {"time": 2936, "text": "But also it's two things."}, {"time": 2936, "text": "It's people's expectation and people's need for an emotional connection."}, {"time": 2941, "text": "And I believe the need is pretty high."}, {"time": 2941, "text": "But I don't think we're aware of it."}, {"time": 2950, "text": "There's like, I really think this is like the life as we know it."}, {"time": 2950, "text": "So we've just kind of gotten used to it of really, I hate to be dark because I have close friends, but we've gotten used to really never being close to anyone."}, {"time": 2964, "text": "And we're deeply, I believe, okay, this is hypothesis."}, {"time": 2972, "text": "I think we're deeply lonely, all of us, even those in deep fulfilling relationships."}, {"time": 2977, "text": "In fact, what makes those relationship fulfilling, I think is that they at least tap into that deep loneliness a little bit."}, {"time": 2983, "text": "But I feel like there's more opportunity to explore that, that doesn't inter, doesn't interfere with the human relationships you have."}, {"time": 2989, "text": "It expands more on the, that, yeah, the rich deep unexplored complexity that's all of us, weird apes."}, {"time": 3002, "text": "Do you think it's possible to fall in love with a robot?"}, {"time": 3005, "text": "Oh yeah, totally."}, {"time": 3005, "text": "Do you think it's possible to have a longterm committed monogamous relationship with a robot?"}, {"time": 3013, "text": "Well, yeah, there are lots of different types of longterm committed monogamous relationships."}, {"time": 3018, "text": "I think monogamous implies like, you're not going to see other humans sexually or like you basically on Facebook have to say, I'm in a relationship with this person, this robot."}, {"time": 3032, "text": "I just don't like, again, I think this is comparing robots to humans when I would rather compare them to pets."}, {"time": 3037, "text": "Like you get a robot, it fulfills this loneliness that you have in maybe not the same way as a pet, maybe in a different way that is even supplemental in a different way."}, {"time": 3052, "text": "But I'm not saying that people won't like do this, be like, oh, I want to marry my robot or I want to have like a sexual relation, monogamous relationship with my robot."}, {"time": 3058, "text": "But I don't think that that's the main use case for them."}, {"time": 3065, "text": "But you think that there's still a gap between human and pet."}, {"time": 3071, "text": "So between a husband and pet, there's a different relationship."}, {"time": 3071, "text": "It's engineering."}, {"time": 3084, "text": "So that's a gap that can be closed through."}, {"time": 3084, "text": "I think it could be closed someday, but why would we close that?"}, {"time": 3090, "text": "Like, I think it's so boring to think about recreating things that we already have when we could create something that's different."}, {"time": 3094, "text": "I know you're thinking about the people who like don't have a husband and like, what could we give them?"}, {"time": 3103, "text": "But I guess what I'm getting at is maybe not."}, {"time": 3110, "text": "So like the movie Her."}, {"time": 3110, "text": "So a better husband."}, {"time": 3110, "text": "Well, maybe better in some ways."}, {"time": 3121, "text": "Like it's, I do think that robots are going to continue to be a different type of relationship, even if we get them like very human looking or when, you know, the voice interactions we have with them feel very like natural and human like, I think there's still going to be differences."}, {"time": 3138, "text": "And there were in that movie too, like towards the end, it kind of goes off the rails."}, {"time": 3142, "text": "But it's just a movie."}, {"time": 3142, "text": "So your intuition is that, because you kind of said two things, right?"}, {"time": 3150, "text": "So one is why would you want to basically replicate the husband?"}, {"time": 3159, "text": "And the other is kind of implying that it's kind of hard to do."}, {"time": 3159, "text": "So like anytime you try, you might build something very impressive, but it'll be different."}, {"time": 3166, "text": "I guess my question is about human nature."}, {"time": 3171, "text": "It's like, how hard is it to satisfy that role of the husband?"}, {"time": 3171, "text": "So we're moving any of the sexual stuff aside is the, it's more like the mystery, the tension, the dance of relationships you think with robots, that's difficult to build."}, {"time": 3188, "text": "I think that, well, it also depends on are we talking about robots now in 50 years in like indefinite amount of time."}, {"time": 3196, "text": "I'm thinking like five or 10 years."}, {"time": 3202, "text": "Five or 10 years."}, {"time": 3202, "text": "I think that robots at best will be like, it's more similar to the relationship we have with our pets than relationship that we have with other people."}, {"time": 3213, "text": "So what do you think it takes to build a system that exhibits greater and greater levels of intelligence?"}, {"time": 3221, "text": "Like it impresses us with this intelligence."}, {"time": 3221, "text": "Arumba, so you talk about anthropomorphization that doesn't, I think intelligence is not required."}, {"time": 3227, "text": "In fact, intelligence probably gets in the way sometimes, like you mentioned."}, {"time": 3232, "text": "But what do you think it takes to create a system where we sense that it has a human level intelligence?"}, {"time": 3240, "text": "So something that, probably something conversational, human level intelligence."}, {"time": 3247, "text": "How hard do you think that problem is?"}, {"time": 3251, "text": "It'd be interesting to sort of hear your perspective, not just purely, so I talk to a lot of people, how hard is the conversational agents?"}, {"time": 3258, "text": "How hard is it to pass the torrent test?"}, {"time": 3258, "text": "But my sense is it's easier than just solving, it's easier than solving the pure natural language processing problem."}, {"time": 3273, "text": "Because I feel like you can cheat."}, {"time": 3273, "text": "So how hard is it to pass the torrent test in your view?"}, {"time": 3281, "text": "Well, I think again, it's all about expectation management."}, {"time": 3281, "text": "If you set up people's expectations to think that they're communicating with, what was it, a 13 year old boy from the Ukraine?"}, {"time": 3292, "text": "Then they're not going to expect perfect English, they're not going to expect perfect, you know, understanding of concepts or even like being on the same wavelength in terms of like conversation flow."}, {"time": 3300, "text": "So it's much easier to pass in that case."}, {"time": 3308, "text": "Do you think, you kind of alluded this too with audio, do you think it needs to have a body?"}, {"time": 3314, "text": "I think that we definitely have, so we treat physical things with more social agency, because we're very physical creatures."}, {"time": 3321, "text": "I think a body can be useful."}, {"time": 3329, "text": "Does it get in the way?"}, {"time": 3329, "text": "Is there a negative aspects like... Yeah, there can be."}, {"time": 3333, "text": "So if you're trying to create a body that's too similar to something that people are familiar with, like I have this robot cat at home that has robots."}, {"time": 3338, "text": "I have a robot cat at home that has roommates."}, {"time": 3344, "text": "And it's very disturbing to watch because I'm constantly assuming that it's going to move like a real cat and it doesn't because it's like a $100 piece of technology."}, {"time": 3357, "text": "So it's very like disappointing and it's very hard to treat it like it's alive."}, {"time": 3357, "text": "So you can get a lot wrong with the body too, but you can also use tricks, same as, you know, the expectation management of the 13 year old boy from the Ukraine."}, {"time": 3369, "text": "If you pick an animal that people aren't intimately familiar with, like the baby dinosaur, like the baby seal that people have never actually held in their arms, you can get away with much more because they don't have these preformed expectations."}, {"time": 3382, "text": "Yeah, I remember you thinking of a Ted talk or something that clicked for me that nobody actually knows what a dinosaur looks like."}, {"time": 3387, "text": "So you can actually get away with a lot more."}, {"time": 3394, "text": "So what do you think about consciousness and mortality being displayed in a robot?"}, {"time": 3406, "text": "So not actually having consciousness, but having these kind of human elements that are much more than just the interaction, much more than just, like you mentioned with a dinosaur moving kind of in an interesting ways, but really being worried about its own death and really acting as if it's aware and self aware and identity."}, {"time": 3427, "text": "Have you seen that done in robotics?"}, {"time": 3436, "text": "What do you think about doing that?"}, {"time": 3436, "text": "Is that a powerful good thing?"}, {"time": 3444, "text": "Well, I think it can be a design tool that you can use for different purposes."}, {"time": 3444, "text": "So I can't say whether it's inherently good or bad, but I do think it can be a powerful tool."}, {"time": 3449, "text": "The fact that the pleo mimics distress when you quote unquote hurt it is a really powerful tool to get people to engage with it in a certain way."}, {"time": 3466, "text": "I had a research partner that I did some of the empathy work with named Palash Nandi and he had built a robot for himself that had like a lifespan and that would stop working after a certain amount of time just because he was interested in whether he himself would treat it differently."}, {"time": 3482, "text": "And we know from Tamagotchis, those little games that we used to have that were extremely primitive, that people respond to this idea of mortality and you can get people to do a lot with little design tricks like that."}, {"time": 3497, "text": "Now, whether it's a good thing depends on what you're trying to get them to do."}, {"time": 3501, "text": "Have a deeper relationship, have a deeper connection, sign a relationship."}, {"time": 3507, "text": "If it's for their own benefit, that sounds great."}, {"time": 3507, "text": "You could do that for a lot of other reasons."}, {"time": 3514, "text": "So what kind of stuff are you worried about?"}, {"time": 3514, "text": "So is it mostly about manipulation of your emotions for like advertisement and so on, things like that?"}, {"time": 3519, "text": "Yeah, or data collection or, I mean, you could think of governments misusing this to extract information from people."}, {"time": 3531, "text": "It's, you know, just like any other technological tool, it just raises a lot of questions."}, {"time": 3537, "text": "If you look at Facebook, if you look at Twitter and social networks, there's a lot of concern of data collection now."}, {"time": 3542, "text": "What's from the legal perspective or in general, how do we prevent the violation of sort of these companies crossing a line?"}, {"time": 3552, "text": "It's a great area, but crossing a line, they shouldn't in terms of manipulating, like we're talking about and manipulating our emotion, manipulating our behavior, using tactics that are not so savory."}, {"time": 3572, "text": "It's really difficult because we are starting to create technology that relies on data collection to provide functionality."}, {"time": 3578, "text": "And there's not a lot of incentive, even on the consumer side, to curb that because the other problem is that the harms aren't tangible."}, {"time": 3589, "text": "They're not really apparent to a lot of people because they kind of trickle down on a societal level."}, {"time": 3595, "text": "And then suddenly we're living in like 1984, which, you know, sounds extreme, but that book was very prescient and I'm not worried about, you know, these systems."}, {"time": 3602, "text": "I have, you know, Amazon's Echo at home and tell Alexa all sorts of stuff."}, {"time": 3611, "text": "And it helps me because, you know, Alexa knows what brand of diaper we use."}, {"time": 3619, "text": "And so I can just easily order it again."}, {"time": 3625, "text": "So I don't have any incentive to ask a lawmaker to curb that."}, {"time": 3625, "text": "But when I think about that data then being used against low income people to target them for scammy loans or education programs, that's then a societal effect that I think is very severe and, you know, legislators should be thinking about."}, {"time": 3647, "text": "But yeah, the gray area is the removing ourselves from consideration of like, of explicitly defining objectives and more saying, well, we want to maximize engagement in our social network."}, {"time": 3664, "text": "And then just, because you're not actually doing a bad thing."}, {"time": 3664, "text": "It makes sense."}, {"time": 3664, "text": "You want people to keep a conversation going, to have more conversations, to keep coming back again and again, to have conversations."}, {"time": 3676, "text": "And whatever happens after that, you're kind of not exactly directly responsible."}, {"time": 3681, "text": "You're only indirectly responsible."}, {"time": 3681, "text": "So I think it's a really hard problem."}, {"time": 3688, "text": "Are you optimistic about us ever being able to solve it?"}, {"time": 3697, "text": "You mean the problem of capitalism?"}, {"time": 3697, "text": "It's like, because the problem is that the companies are acting in the company's interests and not in people's interests."}, {"time": 3703, "text": "And when those interests are aligned, that's great."}, {"time": 3707, "text": "But the completely free market doesn't seem to work because of this information asymmetry."}, {"time": 3715, "text": "But it's hard to know how to, so say you were trying to do the right thing."}, {"time": 3715, "text": "I guess what I'm trying to say is it's not obvious for these companies what the good thing for society is to do."}, {"time": 3727, "text": "Like, I don't think they sit there with, I don't know, with a glass of wine and a cat, like petting a cat, evil cat."}, {"time": 3734, "text": "And there's two decisions and one of them is good for society."}, {"time": 3741, "text": "One is good for the profit and they choose the profit."}, {"time": 3741, "text": "I think they actually, there's a lot of money to be made by doing the right thing for society."}, {"time": 3746, "text": "Because Google, Facebook have so much cash that they actually, especially Facebook, would significantly benefit from making decisions that are good for society."}, {"time": 3760, "text": "It's good for their brand."}, {"time": 3760, "text": "But I don't know if they know what's good for society."}, {"time": 3766, "text": "I don't think we know what's good for society in terms of how we manage the conversation on Twitter or how we design, we're talking about robots."}, {"time": 3776, "text": "Like, should we emotionally manipulate you into having a deep connection with Alexa or not?"}, {"time": 3790, "text": "Do you have optimism that we'll be able to solve some of these questions?"}, {"time": 3797, "text": "Well, I'm going to say something that's controversial, like in my circles, which is that I don't think that companies who are reaching out to ethicists and trying to create interdisciplinary ethics boards, I don't think that that's totally just trying to whitewash the problem and so that they look like they've done something."}, {"time": 3812, "text": "I think that a lot of companies actually do, like you say, care about what the right answer is."}, {"time": 3816, "text": "They don't know what that is, and they're trying to find people to help them find them."}, {"time": 3822, "text": "Not in every case, but I think it's much too easy to just vilify the companies as, like you say, sitting there with their cat going, her, her, her, $1 million."}, {"time": 3832, "text": "That's not what happens."}, {"time": 3832, "text": "A lot of people are well meaning even within companies."}, {"time": 3839, "text": "I think that what we do absolutely need is more interdisciplinarity, both within companies, but also within the policymaking space because we've hurtled into the world where technological progress is much faster, it seems much faster than it was, and things are getting very complex."}, {"time": 3863, "text": "And you need people who understand the technology, but also people who understand what the societal implications are, and people who are thinking about this in a more systematic way to be talking to each other."}, {"time": 3873, "text": "There's no other solution, I think."}, {"time": 3879, "text": "You've also done work on intellectual property, so if you look at the algorithms that these companies are using, like YouTube, Twitter, Facebook, so on, I mean that's kind of, those are mostly secretive."}, {"time": 3891, "text": "The recommender systems behind these algorithms."}, {"time": 3891, "text": "Do you think about an IP and the transparency of algorithms like this?"}, {"time": 3898, "text": "Like what is the responsibility of these companies to open source the algorithms or at least reveal to the public how these algorithms work?"}, {"time": 3911, "text": "So I personally don't work on that."}, {"time": 3911, "text": "There are a lot of people who do though, and there are a lot of people calling for transparency."}, {"time": 3916, "text": "In fact, Europe's even trying to legislate transparency, maybe they even have at this point, where like if an algorithmic system makes some sort of decision that affects someone's life, that you need to be able to see how that decision was made."}, {"time": 3931, "text": "It's a tricky balance because obviously companies need to have some sort of competitive advantage and you can't take all of that away or you stifle innovation."}, {"time": 3941, "text": "But yeah, for some of the ways that these systems are already being used, I think it is pretty important that people understand how they work."}, {"time": 3951, "text": "What are your thoughts in general on intellectual property in this weird age of software, AI, robotics?"}, {"time": 3956, "text": "Oh, that it's broken."}, {"time": 3956, "text": "I mean, the system is just broken."}, {"time": 3956, "text": "So can you describe, I actually, I don't even know what intellectual property is in the space of software, what it means to, I mean, so I believe I have a patent on a piece of software from my PhD."}, {"time": 3980, "text": "You believe?"}, {"time": 3980, "text": "You don't know?"}, {"time": 3980, "text": "No, we went through a whole process."}, {"time": 3980, "text": "You get the spam emails like, we'll frame your patent for you."}, {"time": 3986, "text": "Yeah, it's much like a thesis."}, {"time": 3986, "text": "But that's useless, right?"}, {"time": 3996, "text": "Or not?"}, {"time": 3996, "text": "Where does IP stand in this age?"}, {"time": 3996, "text": "What's the right way to do it?"}, {"time": 3996, "text": "What's the right way to protect and own ideas when it's just code and this mishmash of something that feels much softer than a piece of machinery?"}, {"time": 4011, "text": "I mean, it's hard because there are different types of intellectual property and they're kind of these blunt instruments."}, {"time": 4018, "text": "It's like patent law is like a wrench."}, {"time": 4023, "text": "It works really well for an industry like the pharmaceutical industry."}, {"time": 4023, "text": "But when you try and apply it to something else, it's like, I don't know, I'll just hit this thing with a wrench and hope it works."}, {"time": 4032, "text": "So software, you have a couple of different options."}, {"time": 4032, "text": "Any code that's written down in some tangible form is automatically copyrighted."}, {"time": 4041, "text": "So you have that protection, but that doesn't do much because if someone takes the basic idea that the code is executing and just does it in a slightly different way, they can get around the copyright."}, {"time": 4055, "text": "So that's not a lot of protection."}, {"time": 4060, "text": "Then you can patent software, but that's kind of, I mean, getting a patent costs, I don't know if you remember what yours cost or like, was it through an institution?"}, {"time": 4071, "text": "Yeah, it was through a university."}, {"time": 4071, "text": "It was insane."}, {"time": 4071, "text": "There were so many lawyers, so many meetings."}, {"time": 4077, "text": "It made me feel like it must've been hundreds of thousands of dollars."}, {"time": 4077, "text": "It must've been something crazy."}, {"time": 4082, "text": "It's insane the cost of getting a patent."}, {"time": 4082, "text": "And so this idea of protecting the inventor in their own garage who came up with a great idea is kind of, that's the thing of the past."}, {"time": 4092, "text": "It's all just companies trying to protect things and it costs a lot of money."}, {"time": 4092, "text": "And then with code, it's oftentimes by the time the patent is issued, which can take like five years, probably your code is obsolete at that point."}, {"time": 4105, "text": "So it's a very, again, a very blunt instrument that doesn't work well for that industry."}, {"time": 4111, "text": "And so at this point we should really have something better, but we don't."}, {"time": 4117, "text": "Do you like open source?"}, {"time": 4117, "text": "Is open source good for society?"}, {"time": 4121, "text": "You think all of us should open source code?"}, {"time": 4121, "text": "Well, so at the Media Lab at MIT, we have an open source default because what we've noticed is that people will come in, they'll write some code and they'll be like, how do I protect this?"}, {"time": 4134, "text": "And we're like, that's not your problem right now."}, {"time": 4138, "text": "Your problem isn't that someone's going to steal your project."}]}]