[{"title": "Marcus Hutter: Universal Artificial Intelligence, AIXI, and AGI | Lex Fridman Podcast #75", "id": "E1AxVXt2Gv4", "quotes": [{"time": 345, "text": "But also it's a little bit self referential."}, {"time": 348, "text": "So maybe a quick pause."}, {"time": 349, "text": "What is Occam's razor?"}, {"time": 350, "text": "So Occam's razor says that you should not multiply entities beyond necessity, which sort of, if you translate it to proper English means, and in the scientific context means that if you have two theories or hypothesis or models, which equally well describe the phenomenon, your study or the data, you should choose the more simple one."}, {"time": 373, "text": "So that's just the principle or sort of, that's not like a provable law, perhaps."}, {"time": 380, "text": "Perhaps we'll kind of discuss it and think about it, but what's the intuition of why the simpler answer is the one that is likely to be more correct descriptor of whatever we're talking about?"}, {"time": 395, "text": "I believe that Occam's razor is probably the most important principle in science."}, {"time": 400, "text": "I mean, of course we lead logical deduction and we do experimental design, but science is about finding, understanding the world, finding models of the world."}, {"time": 411, "text": "And we can come up with crazy complex models, which explain everything but predict nothing."}, {"time": 416, "text": "But the simple model seem to have predictive power and it's a valid question why?"}, {"time": 423, "text": "And there are two answers to that."}, {"time": 426, "text": "You can just accept it."}, {"time": 427, "text": "That is the principle of science and we use this principle and it seems to be successful."}, {"time": 432, "text": "We don't know why, but it just happens to be."}, {"time": 435, "text": "Or you can try, find another principle which explains Occam's razor."}, {"time": 441, "text": "And if we start with the assumption that the world is governed by simple rules, then there's a bias towards simplicity and applying Occam's razor is the mechanism to finding these rules."}, {"time": 457, "text": "And actually in a more quantitative sense, and we come back to that later in terms of somnolent reduction, you can rigorously prove that."}, {"time": 463, "text": "You can assume that the world is simple, then Occam's razor is the best you can do in a certain sense."}, {"time": 469, "text": "So I apologize for the romanticized question, but why do you think, outside of its effectiveness, why do you think we find simplicity so appealing as human beings?"}, {"time": 480, "text": "Why does E equals MC squared seem so beautiful to us humans?"}, {"time": 485, "text": "I guess mostly, in general, many things can be explained by an evolutionary argument."}, {"time": 492, "text": "And there's some artifacts in humans which are just artifacts and not evolutionary necessary."}, {"time": 498, "text": "But with this beauty and simplicity, it's, I believe, at least the core is about, like science, finding regularities in the world, understanding the world, which is necessary for survival."}, {"time": 515, "text": "If I look at a bush and I just see noise, and there is a tiger and it eats me, then I'm dead."}, {"time": 522, "text": "But if I try to find a pattern, and we know that humans are prone to find more patterns in data than they are, like the Mars face and all these things, but these biads towards finding patterns, even if they are non, but, I mean, it's best, of course, if they are, yeah, helps us for survival."}, {"time": 544, "text": "I haven't thought really about the, I thought I just loved science, but indeed, in terms of just for survival purposes, there is an evolutionary argument for why we find the work of Einstein so beautiful."}, {"time": 561, "text": "Maybe a quick small tangent."}, {"time": 564, "text": "Could you describe what's, Salomonov induction is?"}, {"time": 568, "text": "Yeah, so that's a theory which I claim, and Mr. Lomanov sort of claimed a long time ago, that this solves the big philosophical problem of induction."}, {"time": 579, "text": "And I believe the claim is essentially true."}, {"time": 582, "text": "And what it does is the following."}, {"time": 584, "text": "So, okay, for the picky listener, induction can be interpreted narrowly and widely."}, {"time": 593, "text": "Narrow means inferring models from data."}, {"time": 598, "text": "And widely means also then using these models for doing predictions, so predictions also part of the induction."}, {"time": 604, "text": "So I'm a little bit sloppy sort of with the terminology, and maybe that comes from Ray Salomonov, you know, being sloppy, maybe I shouldn't say that."}, {"time": 612, "text": "He can't complain anymore."}, {"time": 615, "text": "So let me explain a little bit this theory in simple terms."}, {"time": 620, "text": "So assume you have a data sequence, make it very simple, the simplest one say 1, 1, 1, 1, 1, and you see if 100 ones, what do you think comes next?"}, {"time": 628, "text": "The natural answer, I'm gonna speed up a little bit, the natural answer is of course, you know, one, okay?"}, {"time": 633, "text": "And the question is why, okay?"}, {"time": 636, "text": "Well, we see a pattern there, yeah, okay, there's a one and we repeat it."}, {"time": 640, "text": "And why should it suddenly after 100 ones be different?"}, {"time": 643, "text": "So what we're looking for is simple explanations or models for the data we have."}, {"time": 648, "text": "And now the question is, a model has to be presented in a certain language, in which language do we use?"}, {"time": 655, "text": "In science, we want formal languages, and we can use mathematics, or we can use programs on a computer."}, {"time": 661, "text": "So abstractly on a Turing machine, for instance, or it can be a general purpose computer."}, {"time": 666, "text": "So, and there are of course, lots of models of, you can say maybe it's 100 ones and then 100 zeros and 100 ones, that's a model, right?"}, {"time": 673, "text": "But there are simpler models, there's a model print one loop, and it also explains the data."}, {"time": 679, "text": "And if you push that to the extreme, you are looking for the shortest program, which if you run this program reproduces the data you have, it will not stop, it will continue naturally."}, {"time": 692, "text": "And this you take for your prediction."}, {"time": 694, "text": "And on the sequence of ones, it's very plausible, right?"}, {"time": 697, "text": "That print one loop is the shortest program."}, {"time": 699, "text": "We can give some more complex examples like one, two, three, four, five."}, {"time": 703, "text": "What comes next?"}, {"time": 704, "text": "The short program is again, you know, counter, and so that is roughly speaking how solomotive induction works."}, {"time": 713, "text": "The extra twist is that it can also deal with noisy data."}, {"time": 716, "text": "So if you have, for instance, a coin flip, say a biased coin, which comes up head with 60% probability, then it will predict, it will learn and figure this out, and after a while it predicts, oh, the next coin flip will be head with probability 60%."}, {"time": 731, "text": "So it's the stochastic version of that."}, {"time": 733, "text": "But the goal is, the dream is always the search for the short program."}, {"time": 738, "text": "Well, in solomotive induction, precisely what you do is, so you combine, so looking for the shortest program is like applying Opaque's razor, like looking for the simplest theory."}, {"time": 748, "text": "There's also Epicorus principle, which says, if you have multiple hypotheses, which equally well describe your data, don't discard any of them, keep all of them around, you never know."}, {"time": 757, "text": "And you can put that together and say, okay, I have a bias towards simplicity, but it don't rule out the larger models."}, {"time": 764, "text": "And technically what we do is, we weigh the shorter models higher and the longer models lower."}, {"time": 772, "text": "And you use a Bayesian techniques, you have a prior, and which is precisely two to the minus the complexity of the program."}, {"time": 781, "text": "And you weigh all this hypothesis and take this mixture, and then you get also the stochasticity in."}, {"time": 786, "text": "Yeah, like many of your ideas, that's just a beautiful idea of weighing based on the simplicity of the program."}, {"time": 792, "text": "I love that, that seems to me maybe a very human centric concept."}, {"time": 797, "text": "It seems to be a very appealing way of discovering good programs in this world."}, {"time": 804, "text": "You've used the term compression quite a bit."}, {"time": 807, "text": "I think it's a beautiful idea."}, {"time": 810, "text": "Sort of, we just talked about simplicity and maybe science or just all of our intellectual pursuits is basically the time to compress the complexity all around us into something simple."}, {"time": 823, "text": "So what does this word mean to you, compression?"}, {"time": 829, "text": "I essentially have already explained it."}, {"time": 831, "text": "So it compression means for me, finding short programs for the data or the phenomenon at hand."}, {"time": 839, "text": "You could interpret it more widely, finding simple theories, which can be mathematical theories or maybe even informal, like just in words."}, {"time": 849, "text": "Compression means finding short descriptions, explanations, programs for the data."}, {"time": 854, "text": "Do you see science as a kind of our human attempt at compression, so we're speaking more generally, because when you say programs, you're kind of zooming in on a particular sort of almost like a computer science, artificial intelligence focus, but do you see all of human endeavor as a kind of compression?"}, {"time": 874, "text": "Well, at least all of science, I see as an endeavor of compression, not all of humanity, maybe."}, {"time": 879, "text": "And well, there are also some other aspects of science like experimental design, right?"}, {"time": 883, "text": "I mean, we create experiments specifically to get extra knowledge."}, {"time": 888, "text": "And that isn't part of the decision making process, but once we have the data, to understand the data is essentially compression."}, {"time": 898, "text": "So I don't see any difference between compression, compression, understanding, and prediction."}, {"time": 905, "text": "So we're jumping around topics a little bit, but returning back to simplicity, a fascinating concept of Kolmogorov complexity."}, {"time": 914, "text": "So in your sense, do most objects in our mathematical universe have high Kolmogorov complexity?"}, {"time": 921, "text": "And maybe what is, first of all, what is Kolmogorov complexity?"}, {"time": 925, "text": "Okay, Kolmogorov complexity is a notion of simplicity or complexity, and it takes the compression view to the extreme."}, {"time": 935, "text": "So I explained before that if you have some data sequence, just think about a file in a computer and best sort of, you know, just a string of bits."}, {"time": 945, "text": "And if you, and we have data compressors, like we compress big files into zip files with certain compressors."}, {"time": 953, "text": "And you can also produce self extracting ArcaFs."}, {"time": 956, "text": "That means as an executable, if you run it, it reproduces your original file without needing an extra decompressor."}, {"time": 962, "text": "It's just a decompressor plus the ArcaF together in one."}, {"time": 966, "text": "And now there are better and worse compressors, and you can ask, what is the ultimate compressor?"}, {"time": 971, "text": "So what is the shortest possible self extracting ArcaF you could produce for a certain data set here, which reproduces the data set."}, {"time": 979, "text": "And the length of this is called the Kolmogorov complexity."}, {"time": 983, "text": "And arguably that is the information content in the data set."}, {"time": 987, "text": "I mean, if the data set is very redundant or very boring, you can compress it very well."}, {"time": 991, "text": "So the information content should be low and you know, it is low according to this definition."}, {"time": 996, "text": "So it's the length of the shortest program that summarizes the data?"}, {"time": 1002, "text": "And what's your sense of our sort of universe when we think about the different objects in our universe that we try, concepts or whatever at every level, do they have higher or low Kolmogorov complexity?"}, {"time": 1018, "text": "So what's the hope?"}, {"time": 1020, "text": "Do we have a lot of hope and be able to summarize much of our world?"}, {"time": 1025, "text": "That's a tricky and difficult question."}, {"time": 1028, "text": "So as I said before, I believe that the whole universe based on the evidence we have is very simple."}, {"time": 1036, "text": "So it has a very short description."}, {"time": 1039, "text": "Sorry, to linger on that, the whole universe, what does that mean?"}, {"time": 1044, "text": "You mean at the very basic fundamental level in order to create the universe?"}, {"time": 1049, "text": "So you need a very short program and you run it."}, {"time": 1052, "text": "To get the thing going."}, {"time": 1054, "text": "To get the thing going and then it will reproduce our universe."}, {"time": 1057, "text": "There's a problem with noise."}, {"time": 1059, "text": "We can come back to that later possibly."}, {"time": 1062, "text": "Is noise a problem or is it a bug or a feature?"}, {"time": 1066, "text": "I would say it makes our life as a scientist really, really much harder."}, {"time": 1072, "text": "I mean, think about without noise, we wouldn't need all of the statistics."}, {"time": 1075, "text": "But then maybe we wouldn't feel like there's a free will."}, {"time": 1078, "text": "Maybe we need that for the..."}, {"time": 1081, "text": "This is an illusion that noise can give you free will."}, {"time": 1084, "text": "At least in that way, it's a feature."}, {"time": 1086, "text": "But also, if you don't have noise, you have chaotic phenomena, which are effectively like noise."}, {"time": 1092, "text": "So we can't get away with statistics even then."}, {"time": 1095, "text": "I mean, think about rolling a dice and forget about quantum mechanics and you know exactly how you throw it."}, {"time": 1101, "text": "But I mean, it's still so hard to compute the trajectory that effectively it is best to model it as coming out with a number, this probability one over six."}, {"time": 1113, "text": "But from this set of philosophical Kolmogorov complexity perspective, if we didn't have noise, then arguably you could describe the whole universe as well as a standard model plus generativity."}, {"time": 1127, "text": "I mean, we don't have a theory of everything yet, but sort of assuming we are close to it or have it."}, {"time": 1132, "text": "Plus the initial conditions, which may hopefully be simple."}, {"time": 1135, "text": "And then you just run it and then you would reproduce the universe."}, {"time": 1139, "text": "But that's spoiled by noise or by chaotic systems or by initial conditions, which may be complex."}, {"time": 1146, "text": "So now if we don't take the whole universe, but just a subset, just take planet Earth."}, {"time": 1153, "text": "Planet Earth cannot be compressed into a couple of equations."}, {"time": 1157, "text": "This is a hugely complex system."}, {"time": 1160, "text": "So when you look at the window, like the whole thing might be simple, but when you just take a small window, then..."}, {"time": 1166, "text": "It may become complex and that may be counterintuitive, but there's a very nice analogy."}, {"time": 1171, "text": "The book, the library of all books."}, {"time": 1174, "text": "So imagine you have a normal library with interesting books and you go there, great, lots of information and quite complex."}, {"time": 1181, "text": "So now I create a library which contains all possible books, say of 500 pages."}, {"time": 1186, "text": "So the first book just has A, A, A, A, A over all the pages."}, {"time": 1189, "text": "The next book A, A, A and ends with B and so on."}, {"time": 1192, "text": "I create this library of all books."}, {"time": 1194, "text": "I can write a super short program which creates this library."}, {"time": 1197, "text": "So this library which has all books has zero information content."}, {"time": 1201, "text": "And you take a subset of this library and suddenly you have a lot of information in there."}, {"time": 1206, "text": "I think one of the most beautiful object, mathematical objects that at least today seems to be understudied or under talked about is cellular automata."}, {"time": 1214, "text": "What lessons do you draw from sort of the game of life for cellular automata where you start with the simple rules just like you're describing with the universe and somehow complexity emerges."}, {"time": 1226, "text": "Do you feel like you have an intuitive grasp on the fascinating behavior of such systems where like you said, some chaotic behavior could happen, some complexity could emerge, some it could die out and some very rigid structures."}, {"time": 1243, "text": "Do you have a sense about cellular automata that somehow transfers maybe to the bigger questions of our universe?"}, {"time": 1250, "text": "Yeah, the cellular automata and especially the Conway's game of life is really great because these rules are so simple."}, {"time": 1256, "text": "You can explain it to every child and even by hand you can simulate a little bit and you see these beautiful patterns emerge and people have proven that it's even Turing complete."}, {"time": 1266, "text": "You cannot just use a computer to simulate game of life but you can also use game of life to simulate any computer."}, {"time": 1273, "text": "That is truly amazing."}, {"time": 1276, "text": "And it's the prime example probably to demonstrate that very simple rules can lead to very rich phenomena."}, {"time": 1285, "text": "And people sometimes, how is chemistry and biology so rich?"}, {"time": 1289, "text": "I mean, this can't be based on simple rules."}, {"time": 1292, "text": "But no, we know quantum electrodynamics describes all of chemistry."}, {"time": 1296, "text": "And we come later back to that."}, {"time": 1298, "text": "I claim intelligence can be explained or described in one single equation."}, {"time": 1303, "text": "This very rich phenomenon."}, {"time": 1305, "text": "You asked also about whether I understand this phenomenon and it's probably not."}, {"time": 1314, "text": "And there's this saying, you never understand really things, you just get used to them."}, {"time": 1318, "text": "And I think I got pretty used to cellular automata."}, {"time": 1323, "text": "So you believe that you understand now why this phenomenon happens."}, {"time": 1327, "text": "But I give you a different example."}, {"time": 1329, "text": "I didn't play too much with Conway's game of life but a little bit more with fractals and with the Mandelbrot set and these beautiful patterns, just look Mandelbrot set."}, {"time": 1341, "text": "And well, when the computers were really slow and I just had a black and white monitor and programmed my own programs in assembler too."}, {"time": 1349, "text": "Assembler, wow."}, {"time": 1350, "text": "Wow, you're legit."}, {"time": 1353, "text": "To get these fractals on the screen and it was mesmerized and much later."}, {"time": 1357, "text": "So I returned to this every couple of years and then I tried to understand what is going on."}, {"time": 1362, "text": "And you can understand a little bit."}, {"time": 1364, "text": "So I tried to derive the locations, there are these circles and the apple shape and then you have smaller Mandelbrot sets recursively in this set."}, {"time": 1379, "text": "And there's a way to mathematically by solving high order polynomials to figure out where these centers are and what size they are approximately."}, {"time": 1388, "text": "And by sort of mathematically approaching this problem, you slowly get a feeling of why things are like they are and that sort of isn't, you know, first step to understanding why this rich phenomena."}, {"time": 1404, "text": "Do you think it's possible, what's your intuition?"}, {"time": 1407, "text": "Do you think it's possible to reverse engineer and find the short program that generated these fractals sort of by looking at the fractals?"}, {"time": 1416, "text": "Well, in principle, yes, yeah."}, {"time": 1418, "text": "So, I mean, in principle, what you can do is you take, you know, any data set, you know, you take these fractals or you take whatever your data set, whatever you have, say a picture of Convey's Game of Life and you run through all programs."}, {"time": 1454, "text": "It may be a long program because it's faster and then you continue and you get shorter and shorter programs until you eventually find the shortest program."}, {"time": 1462, "text": "The interesting thing, you can never know whether it's the shortest program because there could be an even shorter program which is just even slower and you just have to wait here."}, {"time": 1472, "text": "But asymptotically and actually after a finite time, you have the shortest program."}, {"time": 1476, "text": "So this is a theoretical but completely impractical way of finding the underlying structure in every data set and that is what Solomov induction does and Kolmogorov complexity."}, {"time": 1490, "text": "In practice, of course, we have to approach the problem more intelligently."}, {"time": 1493, "text": "And then if you take resource limitations into account, there's, for instance, a field of pseudo random numbers and these are deterministic sequences, but no algorithm which is fast, fast means runs in polynomial time, can detect that it's actually deterministic."}, {"time": 1513, "text": "So we can produce interesting, I mean, random numbers maybe not that interesting, but just an example."}, {"time": 1518, "text": "We can produce complex looking data and we can then prove that no fast algorithm can detect the underlying pattern."}, {"time": 1527, "text": "Which is, unfortunately, that's a big challenge for our search for simple programs in the space of artificial intelligence, perhaps."}, {"time": 1538, "text": "Yes, it definitely is for artificial intelligence and it's quite surprising that it's, I can't say easy."}, {"time": 1544, "text": "I mean, physicists worked really hard to find these theories, but apparently it was possible for human minds to find these simple rules in the universe."}, {"time": 1554, "text": "It could have been different, right?"}, {"time": 1559, "text": "It could have been different."}, {"time": 1560, "text": "It's awe inspiring."}, {"time": 1564, "text": "So let me ask another absurdly big question."}, {"time": 1569, "text": "What is intelligence in your view?"}, {"time": 1573, "text": "So I have, of course, a definition."}, {"time": 1577, "text": "I wasn't sure what you're going to say because you could have just as easily said, I have no clue."}, {"time": 1581, "text": "Which many people would say, but I'm not modest in this question."}, {"time": 1586, "text": "So the informal version, which I worked out together with Shane Lack, who cofounded DeepMind, is that intelligence measures an agent's ability to perform well in a wide range of environments."}, {"time": 1602, "text": "So that doesn't sound very impressive."}, {"time": 1605, "text": "And these words have been very carefully chosen and there is a mathematical theory behind that and we come back to that later."}, {"time": 1614, "text": "And if you look at this definition by itself, it seems like, yeah, okay, but it seems a lot of things are missing."}, {"time": 1623, "text": "But if you think it through, then you realize that most, and I claim all of the other traits, at least of rational intelligence, which we usually associate with intelligence, are emergent phenomena from this definition."}, {"time": 1637, "text": "Like creativity, memorization, planning, knowledge."}, {"time": 1642, "text": "You all need that in order to perform well in a wide range of environments."}, {"time": 1647, "text": "So you don't have to explicitly mention that in a definition."}, {"time": 1650, "text": "So yeah, so the consciousness, abstract reasoning, all these kinds of things are just emergent phenomena that help you in towards, can you say the definition again?"}, {"time": 1661, "text": "So multiple environments."}, {"time": 1664, "text": "Did you mention the word goals?"}, {"time": 1665, "text": "No, but we have an alternative definition."}, {"time": 1667, "text": "Instead of performing well, you can just replace it by goals."}, {"time": 1670, "text": "So intelligence measures an agent's ability to achieve goals in a wide range of environments."}, {"time": 1675, "text": "That's more or less equal."}, {"time": 1676, "text": "But interesting, because in there, there's an injection of the word goals."}, {"time": 1679, "text": "So we want to specify there should be a goal."}, {"time": 1683, "text": "Yeah, but perform well is sort of, what does it mean?"}, {"time": 1687, "text": "There's a little bit gray area, but it's much closer to something that could be formalized."}, {"time": 1694, "text": "In your view, are humans, where do humans fit into that definition?"}, {"time": 1698, "text": "Are they general intelligence systems that are able to perform in, like how good are they at fulfilling that definition at performing well in multiple environments?"}, {"time": 1711, "text": "Yeah, that's a big question."}, {"time": 1712, "text": "I mean, the humans are performing best among all species."}, {"time": 1717, "text": "We know of, yeah."}, {"time": 1720, "text": "Depends."}, {"time": 1721, "text": "You could say that trees and plants are doing a better job."}, {"time": 1724, "text": "They'll probably outlast us."}, {"time": 1726, "text": "Yeah, but they are in a much more narrow environment, right?"}, {"time": 1729, "text": "I mean, you just have a little bit of air pollutions and these trees die and we can adapt, right?"}, {"time": 1734, "text": "We build houses, we build filters, we do geoengineering."}, {"time": 1739, "text": "So the multiple environment part."}, {"time": 1741, "text": "Yeah, that is very important, yeah."}, {"time": 1742, "text": "So that distinguish narrow intelligence from wide intelligence, also in the AI research."}, {"time": 1748, "text": "So let me ask the Allentourian question."}, {"time": 1754, "text": "Can machines be intelligent?"}, {"time": 1755, "text": "So in your view, I have to kind of ask, the answer is probably yes, but I want to kind of hear what your thoughts on it."}, {"time": 1764, "text": "Can machines be made to fulfill this definition of intelligence, to achieve intelligence?"}, {"time": 1770, "text": "Well, we are sort of getting there and on a small scale, we are already there."}, {"time": 1776, "text": "The wide range of environments are missing, but we have self driving cars, we have programs which play Go and chess, we have speech recognition."}, {"time": 1784, "text": "So that's pretty amazing, but these are narrow environments."}, {"time": 1789, "text": "But if you look at AlphaZero, that was also developed by DeepMind."}, {"time": 1793, "text": "I mean, got famous with AlphaGo and then came AlphaZero a year later."}, {"time": 1797, "text": "That was truly amazing."}, {"time": 1799, "text": "So reinforcement learning algorithm, which is able just by self play, to play chess and then also Go."}, {"time": 1808, "text": "And I mean, yes, they're both games, but they're quite different games."}, {"time": 1811, "text": "And you didn't don't feed them the rules of the game."}, {"time": 1815, "text": "And the most remarkable thing, which is still a mystery to me, that usually for any decent chess program, I don't know much about Go, you need opening books and end game tables and so on too."}, {"time": 1826, "text": "And nothing in there, nothing was put in there."}, {"time": 1829, "text": "Especially with AlphaZero, the self playing mechanism starting from scratch, being able to learn actually new strategies is... Yeah, it rediscovered all these famous openings within four hours by itself."}, {"time": 1846, "text": "What I was really happy about, I'm a terrible chess player, but I like Queen Gumby."}, {"time": 1850, "text": "And AlphaZero figured out that this is the best opening."}, {"time": 1853, "text": "Finally, somebody proved you correct."}, {"time": 1859, "text": "So yes, to answer your question, yes, I believe that general intelligence is possible."}, {"time": 1865, "text": "And it also, I mean, it depends how you define it."}, {"time": 1868, "text": "Do you say AGI with general intelligence, artificial intelligence, only refers to if you achieve human level or a subhuman level, but quite broad, is it also general intelligence?"}, {"time": 1879, "text": "So we have to distinguish, or it's only super human intelligence, general artificial intelligence."}, {"time": 1885, "text": "Is there a test in your mind, like the Turing test for natural language or some other test that would impress the heck out of you that would kind of cross the line of your sense of intelligence within the framework that you said?"}, {"time": 1899, "text": "Well, the Turing test has been criticized a lot, but I think it's not as bad as some people think."}, {"time": 1905, "text": "And some people think it's too strong."}, {"time": 1907, "text": "So it tests not just for system to be intelligent, but it also has to fake human deception, which is much harder."}, {"time": 1918, "text": "And on the other hand, they say it's too weak because it just maybe fakes emotions or intelligent behavior."}, {"time": 1927, "text": "It's not real."}, {"time": 1929, "text": "But I don't think that's the problem or a big problem."}, {"time": 1931, "text": "So if you would pass the Turing test, so a conversation over terminal with a bot for an hour, or maybe a day or so, and you can fool a human into not knowing whether this is a human or not, so that's the Turing test, I would be truly impressed."}, {"time": 1954, "text": "And I mean, it started with ELISA, that was the first conversational program."}, {"time": 1958, "text": "And what is it called?"}, {"time": 1960, "text": "The Japanese Mitsuko or so."}, {"time": 1961, "text": "That's the winner of the last couple of years."}, {"time": 1964, "text": "And well."}, {"time": 1965, "text": "Quite impressive."}, {"time": 1966, "text": "Yeah, it's quite impressive."}, {"time": 1967, "text": "And then Google has developed Mina, right?"}, {"time": 1970, "text": "Just recently, that's an open domain conversational bot, just a couple of weeks ago, I think."}, {"time": 1977, "text": "Yeah, I kind of like the metric that sort of the Alexa Prize has proposed."}, {"time": 1981, "text": "I mean, maybe it's obvious to you."}, {"time": 1982, "text": "It wasn't to me of setting sort of a length of a conversation."}, {"time": 1987, "text": "Like you want the bot to be sufficiently interesting that you would want to keep talking to it for like 20 minutes."}, {"time": 1993, "text": "And that's a surprisingly effective in aggregate metric, because really, like nobody has the patience to be able to talk to a bot that's not interesting and intelligent and witty, and is able to go on to different tangents, jump domains, be able to say something interesting to maintain your attention."}, {"time": 2016, "text": "And maybe many humans will also fail this test."}, {"time": 2019, "text": "That's the, unfortunately, we set, just like with autonomous vehicles, with chatbots, we also set a bar that's way too high to reach."}, {"time": 2028, "text": "I said, you know, the Turing test is not as bad as some people believe, but what is really not useful about the Turing test, it gives us no guidance how to develop these systems in the first place."}, {"time": 2040, "text": "Of course, you know, we can develop them by trial and error and, you know, do whatever and then run the test and see whether it works or not."}, {"time": 2046, "text": "But a mathematical definition of intelligence gives us, you know, an objective, which we can then analyze by theoretical tools or computational, and, you know, maybe even prove how close we are."}, {"time": 2065, "text": "And we will come back to that later with the iXe model."}, {"time": 2068, "text": "So, I mentioned the compression, right?"}, {"time": 2071, "text": "So in natural language processing, they have achieved amazing results."}, {"time": 2076, "text": "And one way to test this, of course, you know, take the system, you train it, and then you see how well it performs on the task."}, {"time": 2083, "text": "But a lot of performance measurement is done by so called perplexity, which is essentially the same as complexity or compression length."}, {"time": 2093, "text": "So the NLP community develops new systems and then they measure the compression length and then they have ranking and leaks because there's a strong correlation between compressing well, and then the system's performing well at the task at hand."}, {"time": 2107, "text": "It's not perfect, but it's good enough for them as an intermediate aim."}, {"time": 2114, "text": "So you mean a measure, so this is kind of almost returning to the common goal of complexity."}, {"time": 2119, "text": "So you're saying good compression usually means good intelligence."}, {"time": 2127, "text": "So you mentioned you're one of the only people who dared boldly to try to formalize the idea of artificial general intelligence, to have a mathematical framework for intelligence, just like as we mentioned, termed AIXI, A, I, X, I."}, {"time": 2149, "text": "So let me ask the basic question."}, {"time": 2151, "text": "What is AIXI?"}, {"time": 2154, "text": "Okay, so let me first say what it stands for because... What it stands for, actually, that's probably the more basic question."}, {"time": 2160, "text": "What it..."}, {"time": 2161, "text": "The first question is usually how it's pronounced, but finally I put it on the website how it's pronounced and you figured it out."}, {"time": 2170, "text": "The name comes from AI, artificial intelligence, and the X, I, is the Greek letter Xi, which are used for Solomonov's distribution for quite stupid reasons, which I'm not willing to repeat here in front of camera."}, {"time": 2187, "text": "So it just happened to be more or less arbitrary."}, {"time": 2189, "text": "I chose the Xi."}, {"time": 2191, "text": "But it also has nice other interpretations."}, {"time": 2194, "text": "So there are actions and perceptions in this model."}, {"time": 2198, "text": "An agent has actions and perceptions over time."}, {"time": 2202, "text": "So this is A index I, X index I."}, {"time": 2204, "text": "So there's the action at time I and then followed by perception at time I. Yeah, we'll go with that."}, {"time": 2210, "text": "I'll edit out the first part."}, {"time": 2212, "text": "I'm just kidding."}, {"time": 2213, "text": "I have some more interpretations."}, {"time": 2215, "text": "So at some point, maybe five years ago or 10 years ago, I discovered in Barcelona, it was on a big church that was in stone engraved, some text, and the word Aixia appeared there a couple of times."}, {"time": 2231, "text": "I was very surprised and happy about that."}, {"time": 2236, "text": "And I looked it up."}, {"time": 2237, "text": "So it is a Catalan language and it means with some interpretation of that's it, that's the right thing to do."}, {"time": 2243, "text": "Yeah, Huayrica."}, {"time": 2244, "text": "Oh, so it's almost like destined somehow."}, {"time": 2247, "text": "It came to you in a dream."}, {"time": 2252, "text": "And similar, there's a Chinese word, Aixi, also written like Aixi, if you transcribe that to Pinyin."}, {"time": 2257, "text": "And the final one is that it's AI crossed with induction because that is, and that's going more to the content now."}, {"time": 2264, "text": "So good old fashioned AI is more about planning and known deterministic world and induction is more about often IID data and inferring models."}, {"time": 2273, "text": "And essentially what this Aixi model does is combining these two."}, {"time": 2276, "text": "And I actually also recently, I think heard that in Japanese AI means love."}, {"time": 2282, "text": "So if you can combine XI somehow with that, I think we can, there might be some interesting ideas there."}, {"time": 2290, "text": "So Aixi, let's then take the next step."}, {"time": 2292, "text": "Can you maybe talk at the big level of what is this mathematical framework?"}, {"time": 2299, "text": "Yeah, so it consists essentially of two parts."}, {"time": 2302, "text": "One is the learning and induction and prediction part."}, {"time": 2306, "text": "And the other one is the planning part."}, {"time": 2308, "text": "So let's come first to the learning, induction, prediction part, which essentially I explained already before."}, {"time": 2315, "text": "So what we need for any agent to act well is that it can somehow predict what happens."}, {"time": 2323, "text": "I mean, if you have no idea what your actions do, how can you decide which actions are good or not?"}, {"time": 2328, "text": "So you need to have some model of what your actions effect."}, {"time": 2332, "text": "So what you do is you have some experience, you build models like scientists of your experience, then you hope these models are roughly correct, and then you use these models for prediction."}, {"time": 2343, "text": "And the model is, sorry to interrupt, and the model is based on your perception of the world, how your actions will affect that world."}, {"time": 2350, "text": "That's not..."}, {"time": 2352, "text": "So how do you think about a model?"}, {"time": 2352, "text": "That's not the important part, but it is technically important, but at this stage we can just think about predicting, let's say, stock market data, weather data, or IQ sequences, one, two, three, four, five, what comes next, yeah?"}, {"time": 2364, "text": "So of course our actions affect what we're doing, but I'll come back to that in a second."}, {"time": 2370, "text": "So, and I'll keep just interrupting."}, {"time": 2372, "text": "So just to draw a line between prediction and planning, what do you mean by prediction in this way?"}, {"time": 2380, "text": "It's trying to predict the environment without your long term action in the environment?"}, {"time": 2387, "text": "What is prediction?"}, {"time": 2389, "text": "Okay, if you want to put the actions in now, okay, then let's put it in now, yeah?"}, {"time": 2393, "text": "So... We don't have to put them now."}, {"time": 2396, "text": "Scratch it, scratch it, dumb question, okay."}, {"time": 2398, "text": "So the simplest form of prediction is that you just have data which you passively observe, and you want to predict what happens without interfering, as I said, weather forecasting, stock market, IQ sequences, or just anything, okay?"}, {"time": 2440, "text": "Of course, if there's a prediction task, or a task which is unpredictable, like, you know, you have fair coin flips."}, {"time": 2446, "text": "Yeah, I cannot predict the next fair coin flip."}, {"time": 2448, "text": "What Solomonov does is says, okay, next head is probably 50%."}, {"time": 2451, "text": "It's the best you can do."}, {"time": 2452, "text": "So if something is unpredictable, Solomonov will also not magically predict it."}, {"time": 2456, "text": "But if there is some pattern and predictability, then Solomonov induction will figure that out eventually, and not just eventually, but rather quickly, and you can have proof convergence rates, whatever your data is."}, {"time": 2471, "text": "So there's pure magic in a sense."}, {"time": 2474, "text": "What's the catch?"}, {"time": 2475, "text": "Well, the catch is that it's not computable, and we come back to that later."}, {"time": 2478, "text": "You cannot just implement it even with Google resources here, and run it and predict the stock market and become rich."}, {"time": 2484, "text": "I mean, Ray Solomonov already tried it at the time."}, {"time": 2488, "text": "But so the basic task is you're in the environment, and you're interacting with the environment to try to learn to model that environment, and the model is in the space of all these programs, and your goal is to get a bunch of programs that are simple."}, {"time": 2501, "text": "Yeah, so let's go to the actions now."}, {"time": 2504, "text": "But actually, good that you asked."}, {"time": 2505, "text": "Usually I skip this part, although there is also a minor contribution which I did, so the action part, but I usually sort of just jump to the decision part."}, {"time": 2511, "text": "So let me explain the action part now."}, {"time": 2513, "text": "Thanks for asking."}, {"time": 2515, "text": "So you have to modify it a little bit by now not just predicting a sequence which just comes to you, but you have an observation, then you act somehow, and then you want to predict the next observation based on the past observation and your action."}, {"time": 2531, "text": "Then you take the next action."}, {"time": 2534, "text": "You don't care about predicting it because you're doing it."}, {"time": 2537, "text": "Then you get the next observation, and you want, well, before you get it, you want to predict it, again, based on your past action and observation sequence."}, {"time": 2544, "text": "You just condition extra on your actions."}, {"time": 2548, "text": "There's an interesting alternative that you also try to predict your own actions."}, {"time": 2555, "text": "If you want."}, {"time": 2556, "text": "In the past or the future?"}, {"time": 2557, "text": "In your future actions."}, {"time": 2560, "text": "Wait, let me wrap."}, {"time": 2563, "text": "I think my brain just broke."}, {"time": 2565, "text": "We should maybe discuss that later after I've explained the IXE model."}, {"time": 2568, "text": "That's an interesting variation."}, {"time": 2570, "text": "But that is a really interesting variation, and a quick comment."}, {"time": 2573, "text": "I don't know if you want to insert that in here, but you're looking at the, in terms of observations, you're looking at the entire, the big history, the long history of the observations."}, {"time": 2583, "text": "That's very important."}, {"time": 2584, "text": "The whole history from birth sort of of the agent, and we can come back to that."}, {"time": 2589, "text": "And also why this is important."}, {"time": 2590, "text": "Often, you know, in RL, you have MDPs, micro decision processes, which are much more limiting."}, {"time": 2595, "text": "So now we can predict conditioned on actions."}, {"time": 2599, "text": "So even if you influence environment, but prediction is not all we want to do, right?"}, {"time": 2604, "text": "We also want to act really in the world."}, {"time": 2606, "text": "And the question is how to choose the actions."}, {"time": 2609, "text": "And we don't want to greedily choose the actions, you know, just, you know, what is best in the next time step."}, {"time": 2616, "text": "And we first, I should say, you know, what is, you know, how do we measure performance?"}, {"time": 2619, "text": "So we measure performance by giving the agent reward."}, {"time": 2623, "text": "That's the so called reinforcement learning framework."}, {"time": 2625, "text": "So every time step, you can give it a positive reward or negative reward, or maybe no reward."}, {"time": 2630, "text": "It could be a very scarce, right?"}, {"time": 2631, "text": "Like if you play chess, just at the end of the game, you give plus one for winning or minus one for losing."}, {"time": 2636, "text": "So in the RxC framework, that's completely sufficient."}, {"time": 2639, "text": "So occasionally you give a reward signal and you ask the agent to maximize reward, but not greedily sort of, you know, the next one, next one, because that's very bad in the long run if you're greedy."}, {"time": 2650, "text": "So, but over the lifetime of the agent."}, {"time": 2652, "text": "So let's assume the agent lives for M time steps, or say dies in sort of a hundred years sharp."}, {"time": 2656, "text": "That's just, you know, the simplest model to explain."}, {"time": 2659, "text": "So it looks at the future reward sum and ask what is my action sequence, or actually more precisely my policy, which leads in expectation, because I don't know the world, to the maximum reward sum."}, {"time": 2674, "text": "Let me give you an analogy."}, {"time": 2676, "text": "In chess, for instance, we know how to play optimally in theory."}, {"time": 2680, "text": "It's just a mini max strategy."}, {"time": 2682, "text": "I play the move which seems best to me under the assumption that the opponent plays the move which is best for him."}, {"time": 2688, "text": "So best, so worst for me under the assumption that he, I play again, the best move."}, {"time": 2694, "text": "And then you have this expecting max three to the end of the game, and then you back propagate, and then you get the best possible move."}, {"time": 2700, "text": "So that is the optimal strategy, which von Neumann already figured out a long time ago, for playing adversarial games."}, {"time": 2709, "text": "Luckily, or maybe unluckily for the theory, it becomes harder."}, {"time": 2712, "text": "The world is not always adversarial."}, {"time": 2714, "text": "So it can be, if there are other humans, even cooperative, or nature is usually, I mean, the dead nature is stochastic, you know, things just happen randomly, or don't care about you."}, {"time": 2726, "text": "So what you have to take into account is the noise, and not necessarily adversarialty."}, {"time": 2730, "text": "So you replace the minimum on the opponent's side by an expectation, which is general enough to include also adversarial cases."}, {"time": 2740, "text": "So now instead of a mini max strategy, you have an expected max strategy."}, {"time": 2743, "text": "So far, so good."}, {"time": 2744, "text": "So that is well known."}, {"time": 2745, "text": "It's called sequential decision theory."}, {"time": 2748, "text": "But the question is, on which probability distribution do you base that?"}, {"time": 2752, "text": "If I have the true probability distribution, like say I play backgammon, right?"}, {"time": 2756, "text": "There's dice, and there's certain randomness involved."}, {"time": 2759, "text": "Yeah, I can calculate probabilities and feed it in the expected max, or the sequential decision tree, come up with the optimal decision if I have enough compute."}, {"time": 2767, "text": "But for the real world, we don't know that, you know, what is the probability the driver in front of me breaks?"}, {"time": 2774, "text": "So depends on all kinds of things, and especially new situations, I don't know."}, {"time": 2779, "text": "So this is this unknown thing about prediction, and there's where Solomonov comes in."}, {"time": 2784, "text": "So what you do is in sequential decision tree, you just replace the true distribution, which we don't know, by this universal distribution."}, {"time": 2792, "text": "I didn't explicitly talk about it, but this is used for universal prediction and plug it into the sequential decision tree mechanism."}, {"time": 2800, "text": "And then you get the best of both worlds."}, {"time": 2802, "text": "You have a long term planning agent, but it doesn't need to know anything about the world because the Solomonov induction part learns."}, {"time": 2811, "text": "Can you explicitly try to describe the universal distribution and how Solomonov induction plays a role here?"}, {"time": 2819, "text": "I'm trying to understand."}, {"time": 2820, "text": "So what it does it, so in the simplest case, I said, take the shortest program, describing your data, run it, have a prediction which would be deterministic."}, {"time": 2830, "text": "But you should not just take the shortest program, but also consider the longer ones, but give it lower a priori probability."}, {"time": 2838, "text": "So in the Bayesian framework, you say a priori, any distribution, which is a model or a stochastic program, has a certain a priori probability, which is two to the minus, and why two to the minus length?"}, {"time": 2853, "text": "You know, I could explain length of this program."}, {"time": 2855, "text": "So longer programs are punished a priori."}, {"time": 2859, "text": "And then you multiply it with the so called likelihood function, which is, as the name suggests, is how likely is this model given the data at hand."}, {"time": 2871, "text": "So if you have a very wrong model, it's very unlikely that this model is true."}, {"time": 2875, "text": "And so it is very small number."}, {"time": 2876, "text": "So even if the model is simple, it gets penalized by that."}, {"time": 2880, "text": "And what you do is then you take just the sum, or this is the average over it."}, {"time": 2884, "text": "And this gives you a probability distribution."}, {"time": 2887, "text": "So it's universal distribution or Solomonov distribution."}, {"time": 2890, "text": "So it's weighed by the simplicity of the program and the likelihood."}, {"time": 2895, "text": "It's kind of a nice idea."}, {"time": 2898, "text": "So okay, and then you said there's you're playing N or M or forgot the letter steps into the future."}, {"time": 2905, "text": "So how difficult is that problem?"}, {"time": 2908, "text": "What's involved there?"}, {"time": 2909, "text": "Okay, so basic optimization problem."}, {"time": 2911, "text": "What are we talking about?"}, {"time": 2912, "text": "Yeah, so you have a planning problem up to horizon M, and that's exponential time in the horizon M, which is, I mean, it's computable, but intractable."}, {"time": 2921, "text": "I mean, even for chess, it's already intractable to do that exactly."}, {"time": 2924, "text": "And you know, for goal."}, {"time": 2925, "text": "But it could be also discounted kind of framework where."}, {"time": 2928, "text": "Yeah, so having a hard horizon, you know, at 100 years, it's just for simplicity of discussing the model and also sometimes the math is simple."}, {"time": 2938, "text": "But there are lots of variations, actually quite interesting parameter."}, {"time": 2943, "text": "There's nothing really problematic about it, but it's very interesting."}, {"time": 2948, "text": "So for instance, you think, no, let's let the parameter M tend to infinity, right?"}, {"time": 2952, "text": "You want an agent which lives forever, right?"}, {"time": 2955, "text": "If you do it normally, you have two problems."}, {"time": 2957, "text": "First, the mathematics breaks down because you have an infinite reward sum, which may give infinity, and getting reward 0.1 every time step is infinity, and giving reward one every time step is infinity, so equally good."}, {"time": 2969, "text": "Not really what we want."}, {"time": 2971, "text": "Other problem is that if you have an infinite life, you can be lazy for as long as you want for 10 years and then catch up with the same expected reward."}, {"time": 2981, "text": "And think about yourself or maybe some friends or so."}, {"time": 2987, "text": "If they knew they lived forever, why work hard now?"}, {"time": 2991, "text": "Just enjoy your life and then catch up later."}, {"time": 2994, "text": "So that's another problem with infinite horizon."}, {"time": 2996, "text": "And you mentioned, yes, we can go to discounting, but then the standard discounting is so called geometric discounting."}, {"time": 3003, "text": "So a dollar today is about worth as much as $1.05 tomorrow."}, {"time": 3008, "text": "So if you do the so called geometric discounting, you have introduced an effective horizon."}, {"time": 3012, "text": "So the agent is now motivated to look ahead a certain amount of time effectively."}, {"time": 3018, "text": "It's like a moving horizon."}, {"time": 3020, "text": "And for any fixed effective horizon, there is a problem to solve, which requires larger horizon."}, {"time": 3028, "text": "So if I look ahead five time steps, I'm a terrible chess player, right?"}, {"time": 3032, "text": "I'll need to look ahead longer."}, {"time": 3034, "text": "If I play go, I probably have to look ahead even longer."}, {"time": 3036, "text": "So for every problem, for every horizon, there is a problem which this horizon cannot solve."}, {"time": 3043, "text": "But I introduced the so called near harmonic horizon, which goes down with one over T rather than exponential in T, which produces an agent, which effectively looks into the future proportional to each age."}, {"time": 3055, "text": "So if it's five years old, it plans for five years."}, {"time": 3057, "text": "If it's 100 years old, it then plans for 100 years."}, {"time": 3060, "text": "And it's a little bit similar to humans too, right?"}, {"time": 3062, "text": "I mean, children don't plan ahead very long, but then we get adult, we play ahead more longer."}, {"time": 3067, "text": "Maybe when we get very old, I mean, we know that we don't live forever."}, {"time": 3070, "text": "Maybe then our horizon shrinks again."}, {"time": 3076, "text": "So adjusting the horizon, is there some mathematical benefit of that?"}, {"time": 3080, "text": "Or is it just a nice, I mean, intuitively, empirically, it would probably be a good idea to sort of push the horizon back, extend the horizon as you experience more of the world."}, {"time": 3093, "text": "But is there some mathematical conclusions here that are beneficial?"}, {"time": 3097, "text": "With solomonic reductions or the prediction part, we have extremely strong finite time, but not finite data results."}, {"time": 3104, "text": "So you have so and so much data, then you lose so and so much."}, {"time": 3107, "text": "So it's a, the theory is really great."}, {"time": 3109, "text": "With the ICSE model, with the planning part, many results are only asymptotic, which, well, this is... What does asymptotic mean?"}, {"time": 3117, "text": "Asymptotic means you can prove, for instance, that in the long run, if the agent, you know, acts long enough, then, you know, it performs optimal or some nice thing happens."}, {"time": 3126, "text": "So, but you don't know how fast it converges."}, {"time": 3129, "text": "So it may converge fast, but we're just not able to prove it because of a difficult problem."}, {"time": 3133, "text": "Or maybe there's a bug in the model so that it's really that slow."}, {"time": 3139, "text": "So that is what asymptotic means, sort of eventually, but we don't know how fast."}, {"time": 3144, "text": "And if I give the agent a fixed horizon M, then I cannot prove asymptotic results, right?"}, {"time": 3152, "text": "So I mean, sort of if it dies in a hundred years, then in a hundred years it's over, I cannot say eventually."}, {"time": 3157, "text": "So this is the advantage of the discounting that I can prove asymptotic results."}, {"time": 3162, "text": "So just to clarify, so I, okay, I made, I've built up a model, we're now in the moment of, I have this way of looking several steps ahead."}, {"time": 3175, "text": "How do I pick what action I will take?"}, {"time": 3178, "text": "It's like with the playing chess, right?"}, {"time": 3180, "text": "You do this minimax."}, {"time": 3182, "text": "In this case here, do expectimax based on the solomonov distribution, you propagate back, and then while an action falls out, the action which maximizes the future expected reward on the solomonov distribution, and then you just take this action."}, {"time": 3198, "text": "And then repeat."}, {"time": 3199, "text": "And then you get a new observation, and you feed it in this action observation, then you repeat."}, {"time": 3203, "text": "And the reward, so on."}, {"time": 3204, "text": "Yeah, so you rewrote too, yeah."}, {"time": 3206, "text": "And then maybe you can even predict your own action."}, {"time": 3209, "text": "I love that idea."}, {"time": 3209, "text": "But okay, this big framework, what is it, I mean, it's kind of a beautiful mathematical framework to think about artificial general intelligence."}, {"time": 3221, "text": "What can you, what does it help you into it about how to build such systems?"}, {"time": 3229, "text": "Or maybe from another perspective, what does it help us in understanding AGI?"}, {"time": 3236, "text": "So when I started in the field, I was always interested in two things."}, {"time": 3241, "text": "One was AGI, the name didn't exist then, what's called general AI or strong AI, and the physics theory of everything."}, {"time": 3250, "text": "So I switched back and forth between computer science and physics quite often."}, {"time": 3254, "text": "You said the theory of everything."}, {"time": 3255, "text": "The theory of everything, yeah."}, {"time": 3257, "text": "Those are basically the two biggest problems before all of humanity."}, {"time": 3261, "text": "Yeah, I can explain if you wanted some later time, why I'm interested in these two questions."}, {"time": 3269, "text": "Can I ask you in a small tangent, if it was one to be solved, which one would you, if an apple fell on your head and there was a brilliant insight and you could arrive at the solution to one, would it be AGI or the theory of everything?"}, {"time": 3289, "text": "Definitely AGI, because once the AGI problem is solved, I can ask the AGI to solve the other problem for me."}, {"time": 3296, "text": "Yeah, brilliant input."}, {"time": 3297, "text": "Okay, so as you were saying about it."}, {"time": 3301, "text": "Okay, so, and the reason why I didn't settle, I mean, this thought about, once you have solved AGI, it solves all kinds of other, not just the theory of every problem, but all kinds of more useful problems to humanity is very appealing to many people."}, {"time": 3316, "text": "And I had this thought also, but I was quite disappointed with the state of the art of the field of AI."}, {"time": 3325, "text": "There was some theory about logical reasoning, but I was never convinced that this will fly."}, {"time": 3330, "text": "And then there was this more heuristic approaches with neural networks and I didn't like these heuristics."}, {"time": 3337, "text": "So, and also I didn't have any good idea myself."}, {"time": 3342, "text": "So that's the reason why I toggled back and forth quite some while and even worked four and a half years in a company developing software, something completely unrelated."}, {"time": 3349, "text": "But then I had this idea about the ICSE model."}, {"time": 3352, "text": "And so what it gives you, it gives you a gold standard."}, {"time": 3357, "text": "So I have proven that this is the most intelligent agents which anybody could build in quotation mark, because it's just mathematical and you need infinite compute."}, {"time": 3371, "text": "But this is the limit and this is completely specified."}, {"time": 3374, "text": "It's not just a framework and every year, tens of frameworks are developed, which are just skeletons and then pieces are missing."}, {"time": 3383, "text": "And usually these missing pieces, turn out to be really, really difficult."}, {"time": 3387, "text": "And so this is completely and uniquely defined and we can analyze that mathematically."}, {"time": 3393, "text": "And we've also developed some approximations."}, {"time": 3397, "text": "I can talk about that a little bit later."}, {"time": 3400, "text": "That would be sort of the top down approach, like say for Neumann's minimax theory, that's the theoretical optimal play of games."}, {"time": 3407, "text": "And now we need to approximate it, put heuristics in, prune the tree, blah, blah, blah, and so on."}, {"time": 3411, "text": "So we can do that also with the ICSE model, but for general AI."}, {"time": 3415, "text": "It can also inspire those, and most researchers go bottom up, right?"}, {"time": 3420, "text": "They have the systems, they try to make it more general, more intelligent."}, {"time": 3424, "text": "It can inspire in which direction to go."}, {"time": 3429, "text": "So if you have some choice to make, right?"}, {"time": 3431, "text": "So how should I evaluate my system if I can't do cross validation?"}, {"time": 3435, "text": "How should I do my learning if my standard regularization doesn't work well?"}, {"time": 3441, "text": "So the answer is always this, we have a system which does everything, that's ICSE."}, {"time": 3445, "text": "It's just completely in the ivory tower, completely useless from a practical point of view."}, {"time": 3450, "text": "But you can look at it and see, ah, yeah, maybe I can take some aspects."}, {"time": 3454, "text": "And instead of Kolmogorov complexity, that just takes some compressors, which has been developed so far."}, {"time": 3459, "text": "And for the planning, well, we have UCT, which has also been used in Go."}, {"time": 3465, "text": "And at least it's inspired me a lot to have this formal definition."}, {"time": 3474, "text": "And if you look at other fields, like I always come back to physics because I have a physics background, think about the phenomenon of energy."}, {"time": 3480, "text": "That was long time a mysterious concept."}, {"time": 3483, "text": "And at some point it was completely formalized."}, {"time": 3485, "text": "And that really helped a lot."}, {"time": 3488, "text": "And you can point out a lot of these things which were first mysterious and vague, and then they have been rigorously formalized."}, {"time": 3495, "text": "Speed and acceleration has been confused, right?"}, {"time": 3498, "text": "Until it was formally defined, yeah, there was a time like this."}, {"time": 3501, "text": "And people often who don't have any background, still confuse it."}, {"time": 3508, "text": "And this ICSE model or the intelligence definitions, which is sort of the dual to it, we come back to that later, formalizes the notion of intelligence uniquely and rigorously."}, {"time": 3518, "text": "So in a sense, it serves as kind of the light at the end of the tunnel."}, {"time": 3523, "text": "So for, I mean, there's a million questions I could ask her."}, {"time": 3527, "text": "So maybe kind of, okay, let's feel around in the dark a little bit."}, {"time": 3532, "text": "So there's been here a deep mind, but in general, been a lot of breakthrough ideas, just like we've been saying around reinforcement learning."}, {"time": 3539, "text": "So how do you see the progress in reinforcement learning is different?"}, {"time": 3544, "text": "Like which subset of ICSE does it occupy?"}, {"time": 3548, "text": "The current, like you said, maybe the Markov assumption is made quite often in reinforcement learning."}, {"time": 3556, "text": "There's other assumptions made in order to make the system work."}, {"time": 3561, "text": "What do you see as the difference connection between reinforcement learning and ICSE?"}, {"time": 3566, "text": "And so the major difference is that essentially all other approaches, they make stronger assumptions."}, {"time": 3575, "text": "So in reinforcement learning, the Markov assumption is that the next state or next observation only depends on the previous observation and not the whole history, which makes, of course, the mathematics much easier rather than dealing with histories."}, {"time": 3589, "text": "Of course, they profit from it also, because then you have algorithms that run on current computers and do something practically useful."}, {"time": 3596, "text": "But for general AI, all the assumptions which are made by other approaches, we know already now they are limiting."}, {"time": 3604, "text": "So, for instance, usually you need a goddessity assumption in the MDP frameworks in order to learn."}, {"time": 3610, "text": "A goddessity essentially means that you can recover from your mistakes and that there are no traps in the environment."}, {"time": 3617, "text": "And if you make this assumption, then essentially you can go back to a previous state, go there a couple of times and then learn what statistics and what the state is like, and then in the long run perform well in this state."}, {"time": 3632, "text": "But there are no fundamental problems."}, {"time": 3635, "text": "But in real life, we know there can be one single action."}, {"time": 3638, "text": "One second of being inattentive while driving a car fast can ruin the rest of my life."}, {"time": 3645, "text": "I can become quadriplegic or whatever."}, {"time": 3647, "text": "So, and there's no recovery anymore."}, {"time": 3649, "text": "So, the real world is not ergodic, I always say."}, {"time": 3652, "text": "There are traps and there are situations where you are not recover from."}, {"time": 3655, "text": "And very little theory has been developed for this case."}, {"time": 3660, "text": "What about, what do you see in the context of IECSIA as the role of exploration?"}, {"time": 3667, "text": "Sort of, you mentioned in the real world you can get into trouble when we make the wrong decisions and really pay for it."}, {"time": 3677, "text": "But exploration seems to be fundamentally important for learning about this world, for gaining new knowledge."}, {"time": 3683, "text": "So, is exploration baked in?"}, {"time": 3687, "text": "Another way to ask it, what are the potential to ask it, what are the parameters of IECSIA that can be controlled?"}, {"time": 3696, "text": "Yeah, I say the good thing is that there are no parameters to control."}, {"time": 3700, "text": "Some other people track knobs to control."}, {"time": 3703, "text": "And you can do that."}, {"time": 3704, "text": "I mean, you can modify IECSIA so that you have some knobs to play with if you want to."}, {"time": 3708, "text": "But the exploration is directly baked in."}, {"time": 3713, "text": "And that comes from the Bayesian learning and the longterm planning."}, {"time": 3718, "text": "So these together already imply exploration."}, {"time": 3724, "text": "You can nicely and explicitly prove that for simple problems like so called bandit problems, where you say, to give a real world example, say you have two medical treatments, A and B, you don't know the effectiveness, you try A a little bit, B a little bit, but you don't want to harm too many patients."}, {"time": 3745, "text": "So you have to sort of trade off exploring."}, {"time": 3749, "text": "And at some point you want to explore and you can do the mathematics and figure out the optimal strategy."}, {"time": 3758, "text": "They talk about Bayesian agents, they're also non Bayesian agents, but it shows that this Bayesian framework by taking a prior or possible worlds, doing the Bayesian mixture, then the Bayes optimal decision with longterm planning that is important, automatically implies exploration, also to the proper extent, not too much exploration and not too little."}, {"time": 3779, "text": "It is very simple settings."}, {"time": 3781, "text": "In the IXE model, I was also able to prove that it is a self optimizing theorem or asymptotic optimality theorems, although they're only asymptotic, not finite time bounds."}, {"time": 3790, "text": "So it seems like the longterm planning is really important, but the longterm part of the planning is really important."}, {"time": 3795, "text": "And also, I mean, maybe a quick tangent, how important do you think is removing the Markov assumption and looking at the full history?"}, {"time": 3805, "text": "Sort of intuitively, of course, it's important, but is it like fundamentally transformative to the entirety of the problem?"}, {"time": 3814, "text": "Like, cause we all, we make that assumption quite often."}, {"time": 3817, "text": "It's just throwing away the past."}, {"time": 3820, "text": "No, I think it's absolutely crucial."}, {"time": 3822, "text": "The question is whether there's a way to deal with it in a more heuristic and still sufficiently well way."}, {"time": 3832, "text": "So I have to come up with an example and fly, but you have some key event in your life, long time ago in some city or something, you realized that's a really dangerous street or whatever."}, {"time": 3845, "text": "And you want to remember that forever, in case you come back there."}, {"time": 3849, "text": "Kind of a selective kind of memory."}, {"time": 3851, "text": "So you remember all the important events in the past, but somehow selecting the important is."}, {"time": 3857, "text": "That's very hard."}, {"time": 3858, "text": "And I'm not concerned about just storing the whole history."}, {"time": 3861, "text": "Just, you can calculate, human life says 30 or 100 years, doesn't matter, right?"}, {"time": 3868, "text": "How much data comes in through the vision system and the auditory system, you compress it a little bit, in this case, lossily and store it."}, {"time": 3877, "text": "We are soon in the means of just storing it."}, {"time": 3880, "text": "But you still need to the selection for the planning part and the compression for the understanding part."}, {"time": 3887, "text": "The raw storage I'm really not concerned about."}, {"time": 3890, "text": "And I think we should just store, if you develop an agent, preferably just store all the interaction history."}, {"time": 3899, "text": "And then you build of course models on top of it and you compress it and you are selective, but occasionally you go back to the old data and reanalyze it based on your new experience you have."}, {"time": 3912, "text": "Sometimes you are in school, you learn all these things you think is totally useless and much later you realize, oh, they were not so useless as you thought."}, {"time": 3921, "text": "I'm looking at you, linear algebra."}, {"time": 3925, "text": "So maybe let me ask about objective functions because that rewards, it seems to be an important part."}, {"time": 3933, "text": "The rewards are kind of given to the system."}, {"time": 3938, "text": "For a lot of people, the specification of the objective function is a key part of intelligence."}, {"time": 3948, "text": "The agent itself figuring out what is important."}, {"time": 3954, "text": "Is it possible within the IXE framework to yourself discover the reward based on which you should operate?"}, {"time": 3965, "text": "Okay, that will be a long answer."}, {"time": 3967, "text": "So, and that is a very interesting question."}, {"time": 3970, "text": "And I'm asked a lot about this question, where do the rewards come from?"}, {"time": 3975, "text": "And that depends."}, {"time": 3977, "text": "So, and then I give you now a couple of answers."}, {"time": 3981, "text": "So if you want to build agents, now let's start simple."}, {"time": 3986, "text": "So let's assume we want to build an agent based on the IXE model, which performs a particular task."}, {"time": 3993, "text": "Let's start with something super simple, like, I mean, super simple, like playing chess, or go or something, yeah."}, {"time": 3998, "text": "Then you just, the reward is winning the game is plus one, losing the game is minus one, done."}, {"time": 4005, "text": "You apply this agent."}, {"time": 4006, "text": "If you have enough compute, you let it self play and it will learn the rules of the game, will play perfect chess after some while, problem solved."}, {"time": 4014, "text": "Okay, so if you have more complicated problems, then you may believe that you have the right reward, but it's not."}, {"time": 4024, "text": "So a nice, cute example is the elevator control that is also in Rich Sutton's book, which is a great book, by the way."}, {"time": 4033, "text": "So you control the elevator and you think, well, maybe the reward should be coupled to how long people wait in front of the elevator."}, {"time": 4040, "text": "Long wait is bad."}, {"time": 4041, "text": "You program it and you do it."}, {"time": 4043, "text": "And what happens is the elevator eagerly picks up all the people, but never drops them off."}, {"time": 4048, "text": "So then you realize, oh, maybe the time in the elevator also counts, so you minimize the sum, yeah?"}, {"time": 4056, "text": "And the elevator does that, but never picks up the people in the 10th floor and the top floor because in expectation, it's not worth it."}, {"time": 4062, "text": "Just let them stay."}, {"time": 4065, "text": "So even in apparently simple problems, you can make mistakes, yeah?"}, {"time": 4071, "text": "And that's what in more serious contexts AGI safety researchers consider."}, {"time": 4078, "text": "So now let's go back to general agents."}, {"time": 4080, "text": "So assume you want to build an agent, which is generally useful to humans, yeah?"}, {"time": 4085, "text": "So you have a household robot, yeah?"}, {"time": 4087, "text": "And it should do all kinds of tasks."}, {"time": 4089, "text": "So in this case, the human should give the reward on the fly."}, {"time": 4094, "text": "I mean, maybe it's pre trained in the factory and that there's some sort of internal reward for the battery level or whatever, yeah?"}, {"time": 4099, "text": "But so it does the dishes badly, you punish the robot, it does it good, you reward the robot and then train it to a new task, yeah, like a child, right?"}, {"time": 4108, "text": "So you need the human in the loop."}, {"time": 4111, "text": "If you want a system, which is useful to the human."}, {"time": 4114, "text": "And as long as these agents stay subhuman level, that should work reasonably well, apart from these examples."}, {"time": 4123, "text": "It becomes critical if they become on a human level."}, {"time": 4125, "text": "It's like with children, small children, you have reasonably well under control, they become older, the reward technique doesn't work so well anymore."}, {"time": 4134, "text": "So then finally, so this would be agents, which are just, you could say slaves to the humans, yeah?"}, {"time": 4141, "text": "So if you are more ambitious and just say, we want to build a new species of intelligent beings, we put them on a new planet and we want them to develop this planet or whatever."}, {"time": 4152, "text": "So we don't give them any reward."}, {"time": 4155, "text": "So what could we do?"}, {"time": 4156, "text": "And you could try to come up with some reward functions like it should maintain itself, the robot, it should maybe multiply, build more robots, right?"}, {"time": 4168, "text": "And maybe all kinds of things which you find useful, but that's pretty hard, right?"}, {"time": 4174, "text": "What does self maintenance mean?"}, {"time": 4176, "text": "What does it mean to build a copy?"}, {"time": 4178, "text": "Should it be exact copy, an approximate copy?"}, {"time": 4180, "text": "And so that's really hard, but Laurent also at DeepMind developed a beautiful model."}, {"time": 4188, "text": "So it just took the ICSE model and coupled the rewards to information gain."}, {"time": 4194, "text": "So he said the reward is proportional to how much the agent had learned about the world."}, {"time": 4200, "text": "And you can rigorously, formally, uniquely define that in terms of archival versions, okay?"}, {"time": 4205, "text": "So if you put that in, you get a completely autonomous agent."}, {"time": 4209, "text": "And actually, interestingly, for this agent, we can prove much stronger result than for the general agent, which is also nice."}, {"time": 4216, "text": "And if you let this agent loose, it will be in a sense, the optimal scientist."}, {"time": 4220, "text": "It is absolutely curious to learn as much as possible about the world."}, {"time": 4224, "text": "And of course, it will also have a lot of instrumental goals, right?"}, {"time": 4227, "text": "In order to learn, it needs to at least survive, right?"}, {"time": 4229, "text": "A dead agent is not good for anything."}, {"time": 4231, "text": "So it needs to have self preservation."}, {"time": 4233, "text": "And if it builds small helpers, acquiring more information, it will do that, yeah?"}, {"time": 4239, "text": "If exploration, space exploration or whatever is necessary, right, to gathering information and develop it."}, {"time": 4245, "text": "So it has a lot of instrumental goals falling on this information gain."}, {"time": 4251, "text": "And this agent is completely autonomous of us."}, {"time": 4253, "text": "No rewards necessary anymore."}, {"time": 4255, "text": "Yeah, of course, it could find a way to game the concept of information and get stuck in that library that you mentioned beforehand with a very large number of books."}, {"time": 4268, "text": "The first agent had this problem."}, {"time": 4270, "text": "It would get stuck in front of an old TV screen, which has just had white noise."}, {"time": 4274, "text": "Yeah, white noise, yeah."}, {"time": 4276, "text": "But the second version can deal with at least stochasticity."}, {"time": 4282, "text": "Yeah, what about curiosity?"}, {"time": 4283, "text": "This kind of word, curiosity, creativity, is that kind of the reward function being of getting new information?"}, {"time": 4291, "text": "Is that similar to idea of kind of injecting exploration for its own sake inside the reward function?"}, {"time": 4301, "text": "Do you find this at all appealing, interesting?"}, {"time": 4304, "text": "I think that's a nice definition."}, {"time": 4306, "text": "Curiosity is rewards."}, {"time": 4308, "text": "Sorry, curiosity is exploration for its own sake."}, {"time": 4314, "text": "Yeah, I would accept that."}, {"time": 4317, "text": "But most curiosity, well, in humans, and especially in children, is not just for its own sake, but for actually learning about the environment and for behaving better."}, {"time": 4328, "text": "So I think most curiosity is tied in the end towards performing better."}, {"time": 4334, "text": "Well, okay, so if intelligence systems need to have this reward function, let me, you're an intelligence system, currently passing the torrent test quite effectively."}, {"time": 4346, "text": "What's the reward function of our human intelligence existence?"}, {"time": 4353, "text": "What's the reward function that Marcus Hutter is operating under?"}, {"time": 4357, "text": "Okay, to the first question, the biological reward function is to survive and to spread, and very few humans sort of are able to overcome this biological reward function."}, {"time": 4370, "text": "But we live in a very nice world where we have lots of spare time and can still survive and spread, so we can develop arbitrary other interests, which is quite interesting."}, {"time": 4383, "text": "On top of that."}, {"time": 4384, "text": "On top of that, yeah."}, {"time": 4386, "text": "But the survival and spreading sort of is, I would say, the goal or the reward function of humans, so that the core one."}, {"time": 4395, "text": "I like how you avoided answering the second question, which a good intelligence system would."}, {"time": 4399, "text": "So my."}, {"time": 4400, "text": "That your own meaning of life and the reward function."}, {"time": 4404, "text": "My own meaning of life and reward function is to find an AGI to build it."}, {"time": 4412, "text": "Okay, let's dissect the X even further."}, {"time": 4414, "text": "So one of the assumptions is kind of infinity keeps creeping up everywhere, which, what are your thoughts on kind of bounded rationality and sort of the nature of our existence and intelligence systems is that we're operating always under constraints, under limited time, limited resources."}, {"time": 4437, "text": "How does that, how do you think about that within the IXE framework, within trying to create an AGI system that operates under these constraints?"}, {"time": 4446, "text": "Yeah, that is one of the criticisms about IXE, that it ignores computation and completely."}, {"time": 4451, "text": "And some people believe that intelligence is inherently tied to what's bounded resources."}, {"time": 4459, "text": "What do you think on this one point?"}, {"time": 4461, "text": "Do you think it's, do you think the bounded resources are fundamental to intelligence?"}, {"time": 4467, "text": "I would say that an intelligence notion, which ignores computational limits is extremely useful."}, {"time": 4475, "text": "A good intelligence notion, which includes these resources would be even more useful, but we don't have that yet."}, {"time": 4483, "text": "And so look at other fields outside of computer science, computational aspects never play a fundamental role."}, {"time": 4492, "text": "You develop biological models for cells, something in physics, these theories, I mean, become more and more crazy and harder and harder to compute."}, {"time": 4500, "text": "Well, in the end, of course, we need to do something with this model, but this is more a nuisance than a feature."}, {"time": 4505, "text": "And I'm sometimes wondering if artificial intelligence would not sit in a computer science department, but in a philosophy department, then this computational focus would be probably significantly less."}, {"time": 4518, "text": "I mean, think about the induction problem is more in the philosophy department."}, {"time": 4522, "text": "There's virtually no paper who cares about, how long it takes to compute the answer."}, {"time": 4526, "text": "That is completely secondary."}, {"time": 4528, "text": "Of course, once we have figured out the first problem, so intelligence without computational resources, then the next and very good question is, could we improve it by including computational resources, but nobody was able to do that so far in an even halfway satisfactory manner."}, {"time": 4549, "text": "I like that, that in the long run, the right department to belong to is philosophy."}, {"time": 4555, "text": "That's actually quite a deep idea, or even to at least to think about big picture philosophical questions, big picture questions, even in the computer science department."}, {"time": 4567, "text": "But you've mentioned approximation."}, {"time": 4570, "text": "Sort of, there's a lot of infinity, a lot of huge resources needed."}, {"time": 4573, "text": "Are there approximations to IXE that within the IXE framework that are useful?"}, {"time": 4579, "text": "Yeah, we have developed a couple of approximations."}, {"time": 4583, "text": "And what we do there is that the Solomov induction part, which was find the shortest program describing your data, we just replace it by standard data compressors."}, {"time": 4596, "text": "And the better compressors get, the better this part will become."}, {"time": 4601, "text": "We focus on a particular compressor called context tree weighting, which is pretty amazing, not so well known."}, {"time": 4608, "text": "It has beautiful theoretical properties, also works reasonably well in practice."}, {"time": 4612, "text": "So we use that for the approximation of the induction and the learning and the prediction part."}, {"time": 4618, "text": "And for the planning part, we essentially just took the ideas from a computer go from 2006."}, {"time": 4627, "text": "It was Java Zipes Bari, also now at DeepMind, who developed the so called UCT algorithm, upper confidence bound for trees algorithm on top of the Monte Carlo tree search."}, {"time": 4639, "text": "So we approximate this planning part by sampling."}, {"time": 4643, "text": "And it's successful on some small toy problems."}, {"time": 4649, "text": "We don't want to lose the generality, right?"}, {"time": 4653, "text": "And that's sort of the handicap, right?"}, {"time": 4654, "text": "If you want to be general, you have to give up something."}, {"time": 4658, "text": "So, but this single agent was able to play small games like Coon poker and Tic Tac Toe and even Pacman in the same architecture, no change."}, {"time": 4672, "text": "The agent doesn't know the rules of the game, really nothing and all by self or by a player with these environments."}, {"time": 4690, "text": "Sort of mathematically, philosophically, what's the relationship in your eyes, if you're familiar with it, between AXI and the Ghetto Machines?"}, {"time": 4698, "text": "Yeah, familiar with it."}, {"time": 4699, "text": "He developed it while I was in his lab."}, {"time": 4702, "text": "Yeah, so the Ghetto Machine, to explain it briefly, you give it a task."}, {"time": 4708, "text": "It could be a simple task as, you know, finding prime factors in numbers, right?"}, {"time": 4712, "text": "You can formally write it down."}, {"time": 4713, "text": "There's a very slow algorithm to do that."}, {"time": 4715, "text": "Just try all the factors, yeah."}, {"time": 4717, "text": "Or play chess, right?"}, {"time": 4719, "text": "Optimally, you write the algorithm to minimax to the end of the game."}, {"time": 4722, "text": "So you write down what the Ghetto Machine should do."}, {"time": 4725, "text": "Then it will take part of its resources to run this program and other part of its resources to improve this program."}, {"time": 4734, "text": "And when it finds an improved version, which provably computes the same answer."}, {"time": 4740, "text": "So that's the key part, yeah."}, {"time": 4742, "text": "It needs to prove by itself that this change of program still satisfies the original specification."}, {"time": 4748, "text": "And if it does so, then it replaces the original program by the improved program."}, {"time": 4753, "text": "And by definition, it does the same job, but just faster, okay?"}, {"time": 4757, "text": "And then, you know, it proves over it and over it."}, {"time": 4759, "text": "And it's developed in a way that all parts of this Ghetto Machine can self improve, but it stays provably consistent with the original specification."}, {"time": 4771, "text": "So from this perspective, it has nothing to do with iXe."}, {"time": 4776, "text": "But if you would now put iXe as the starting axioms in, it would run iXe, but you know, that takes forever."}, {"time": 4784, "text": "But then if it finds a provable speed up of iXe, it would replace it by this and this and this."}, {"time": 4790, "text": "And maybe eventually it comes up with a model which is still the iXe model."}, {"time": 4794, "text": "It cannot be, I mean, just for the knowledgeable reader, iXe is incomputable and that can prove that therefore there cannot be a computable exact algorithm computers."}, {"time": 4808, "text": "There needs to be some approximations and this is not dealt with the Ghetto Machine."}, {"time": 4811, "text": "So you have to do something about it."}, {"time": 4813, "text": "But there's the iXe TL model, which is finitely computable, which we could put in."}, {"time": 4816, "text": "Which part of iXe is noncomputable?"}, {"time": 4819, "text": "The Solomonov induction part."}, {"time": 4820, "text": "The induction, okay, so."}, {"time": 4822, "text": "But there is ways of getting computable approximations of the iXe model, so then it's at least computable."}, {"time": 4830, "text": "It is still way beyond any resources anybody will ever have, but then the Ghetto Machine could sort of improve it further and further in an exact way."}, {"time": 4837, "text": "So is it theoretically possible that the Ghetto Machine process could improve?"}, {"time": 4845, "text": "Isn't iXe already optimal?"}, {"time": 4851, "text": "It is optimal in terms of the reward collected over its interaction cycles, but it takes infinite time to produce one action."}, {"time": 4863, "text": "And the world continues whether you want it or not."}, {"time": 4867, "text": "So the model is assuming you had an oracle, which solved this problem, and then in the next 100 milliseconds or the reaction time you need gives the answer, then iXe is optimal."}, {"time": 4878, "text": "It's optimal in sense of also from learning efficiency and data efficiency, but not in terms of computation time."}, {"time": 4885, "text": "And then the Ghetto Machine in theory, but probably not provably could make it go faster."}, {"time": 4894, "text": "Those two components are super interesting."}, {"time": 4896, "text": "The sort of the perfect intelligence combined with self improvement, sort of provable self improvement since you're always getting the correct answer and you're improving."}, {"time": 4910, "text": "Beautiful ideas."}, {"time": 4911, "text": "Okay, so you've also mentioned that different kinds of things in the chase of solving this reward, sort of optimizing for the goal, interesting human things could emerge."}, {"time": 4924, "text": "So is there a place for consciousness within iXe?"}, {"time": 4930, "text": "Where does, maybe you can comment, because I suppose we humans are just another instantiation of iXe agents and we seem to have consciousness."}, {"time": 4940, "text": "You say humans are an instantiation of an iXe agent?"}, {"time": 4944, "text": "Well, that would be amazing, but I think that's not true even for the smartest and most rational humans."}, {"time": 4949, "text": "I think maybe we are very crude approximations."}, {"time": 4953, "text": "I mean, I tend to believe, again, I'm Russian, so I tend to believe our flaws are part of the optimal."}, {"time": 4961, "text": "So we tend to laugh off and criticize our flaws and I tend to think that that's actually close to an optimal behavior."}, {"time": 4970, "text": "Well, some flaws, if you think more carefully about it, are actually not flaws, yeah, but I think there are still enough flaws."}, {"time": 4980, "text": "As a student of history, I think all the suffering that we've endured as a civilization, it's possible that that's the optimal amount of suffering we need to endure to minimize longterm suffering."}, {"time": 4995, "text": "That's your Russian background, I think."}, {"time": 4997, "text": "That's the Russian."}, {"time": 4998, "text": "Whether humans are or not instantiations of an iXe agent, do you think there's a consciousness of something that could emerge in a computational form or framework like iXe?"}, {"time": 5009, "text": "Let me also ask you a question."}, {"time": 5011, "text": "Do you think I'm conscious?"}, {"time": 5016, "text": "Yeah, that's a good question."}, {"time": 5018, "text": "That tie is confusing me, but I think so."}, {"time": 5024, "text": "You think that makes me unconscious because it strangles me or?"}, {"time": 5027, "text": "If an agent were to solve the imitation game posed by Turing, I think that would be dressed similarly to you."}, {"time": 5033, "text": "That because there's a kind of flamboyant, interesting, complex behavior pattern that sells that you're human and you're conscious."}, {"time": 5044, "text": "But why do you ask?"}, {"time": 5046, "text": "Was it a yes or was it a no?"}, {"time": 5047, "text": "Yes, I think you're conscious, yes."}, {"time": 5052, "text": "So, and you explained sort of somehow why, but you infer that from my behavior, right?"}, {"time": 5058, "text": "You can never be sure about that."}, {"time": 5060, "text": "And I think the same thing will happen with any intelligent agent we develop if it behaves in a way sufficiently close to humans or maybe even not humans."}, {"time": 5072, "text": "I mean, maybe a dog is also sometimes a little bit self conscious, right?"}, {"time": 5075, "text": "So if it behaves in a way where we attribute typically consciousness, we would attribute consciousness to these intelligent systems."}, {"time": 5084, "text": "And I see probably in particular that of course doesn't answer the question whether it's really conscious."}, {"time": 5090, "text": "And that's the big hard problem of consciousness."}, {"time": 5093, "text": "Maybe I'm a zombie."}, {"time": 5095, "text": "I mean, not the movie zombie, but the philosophical zombie."}, {"time": 5099, "text": "Is to you the display of consciousness close enough to consciousness from a perspective of AGI that the distinction of the hard problem of consciousness is not an interesting one?"}, {"time": 5111, "text": "I think we don't have to worry about the consciousness problem, especially the hard problem for developing AGI."}, {"time": 5116, "text": "I think, you know, we progress."}, {"time": 5120, "text": "At some point we have solved all the technical problems and this system will behave intelligent and then super intelligent."}, {"time": 5126, "text": "And this consciousness will emerge."}, {"time": 5130, "text": "I mean, definitely it will display behavior which we will interpret as conscious."}, {"time": 5135, "text": "And then it's a philosophical question."}, {"time": 5138, "text": "Did this consciousness really emerge or is it a zombie which just, you know, fakes everything?"}, {"time": 5143, "text": "We still don't have to figure that out."}, {"time": 5145, "text": "Although it may be interesting, at least from a philosophical point of view, it's very interesting, but it may also be sort of practically interesting."}, {"time": 5153, "text": "You know, there's some people saying, if it's just faking consciousness and feelings, you know, then we don't need to be concerned about, you know, rights."}, {"time": 5159, "text": "But if it's real conscious and has feelings, then we need to be concerned, yeah."}, {"time": 5165, "text": "I can't wait till the day where AI systems exhibit consciousness because it'll truly be some of the hardest ethical questions of what we do with that."}, {"time": 5175, "text": "It is rather easy to build systems which people ascribe consciousness."}, {"time": 5181, "text": "And I give you an analogy."}, {"time": 5182, "text": "I mean, remember, maybe it was before you were born, the Tamagotchi?"}, {"time": 5187, "text": "Freaking born."}, {"time": 5188, "text": "How dare you, sir?"}, {"time": 5190, "text": "Why, that's the, you're young, right?"}, {"time": 5193, "text": "Yes, that's good."}, {"time": 5194, "text": "Thank you, thank you very much."}, {"time": 5196, "text": "But I was also in the Soviet Union."}, {"time": 5197, "text": "We didn't have any of those fun things."}, {"time": 5201, "text": "But you have heard about this Tamagotchi, which was, you know, really, really primitive, actually, for the time it was, and, you know, you could raise, you know, this, and kids got so attached to it and, you know, didn't want to let it die and probably, if we would have asked, you know, the children, do you think this Tamagotchi is conscious?"}, {"time": 5219, "text": "They would have said yes."}, {"time": 5220, "text": "Half of them would have said yes, I would guess."}, {"time": 5221, "text": "I think that's kind of a beautiful thing, actually, because that consciousness, ascribing consciousness, seems to create a deeper connection."}, {"time": 5231, "text": "Which is a powerful thing."}, {"time": 5232, "text": "But we'll have to be careful on the ethics side of that."}, {"time": 5235, "text": "Well, let me ask about the AGI community broadly."}, {"time": 5238, "text": "You kind of represent some of the most serious work on AGI, as of at least earlier, and DeepMind represents serious work on AGI these days."}, {"time": 5249, "text": "But why, in your sense, is the AGI community so small or has been so small until maybe DeepMind came along?"}, {"time": 5258, "text": "Like, why aren't more people seriously working on human level and superhuman level intelligence from a formal perspective?"}, {"time": 5268, "text": "Okay, from a formal perspective, that's sort of an extra point."}, {"time": 5273, "text": "So I think there are a couple of reasons."}, {"time": 5274, "text": "I mean, AI came in waves, right?"}, {"time": 5276, "text": "You know, AI winters and AI summers, and then there were big promises which were not fulfilled, and people got disappointed."}, {"time": 5285, "text": "And that narrow AI solving particular problems, which seemed to require intelligence, was always to some extent successful, and there were improvements, small steps."}, {"time": 5299, "text": "And if you build something which is useful for society or industrial useful, then there's a lot of funding."}, {"time": 5306, "text": "So I guess it was in parts the money, which drives people to develop a specific system solving specific tasks."}, {"time": 5316, "text": "But you would think that, at least in university, you should be able to do ivory tower research."}, {"time": 5323, "text": "And that was probably better a long time ago, but even nowadays, there's quite some pressure of doing applied research or translational research, and it's harder to get grants as a theorist."}, {"time": 5336, "text": "So that also drives people away."}, {"time": 5339, "text": "It's maybe also harder attacking the general intelligence problem."}, {"time": 5343, "text": "So I think enough people, I mean, maybe a small number were still interested in formalizing intelligence and thinking of general intelligence, but not much came up, right?"}, {"time": 5357, "text": "Well, not much great stuff came up."}, {"time": 5359, "text": "So what do you think, we talked about the formal big light at the end of the tunnel, but from the engineering perspective, what do you think it takes to build an AGI system?"}, {"time": 5370, "text": "Is that, and I don't know if that's a stupid question or a distinct question from everything we've been talking about at AICSI, but what do you see as the steps that are necessary to take to start to try to build something?"}, {"time": 5383, "text": "So you want a blueprint now, and then you go off and do it?"}, {"time": 5386, "text": "That's the whole point of this conversation, trying to squeeze that in there."}, {"time": 5389, "text": "Now, is there, I mean, what's your intuition?"}, {"time": 5391, "text": "Is it in the robotics space or something that has a body and tries to explore the world?"}, {"time": 5396, "text": "Is it in the reinforcement learning space, like the efforts with AlphaZero and AlphaStar that are kind of exploring how you can solve it through in the simulation in the gaming world?"}, {"time": 5406, "text": "Is there stuff in sort of all the transformer work and natural English processing, sort of maybe attacking the open domain dialogue?"}, {"time": 5415, "text": "Like what, where do you see a promising pathways?"}, {"time": 5421, "text": "Let me pick the embodiment maybe."}, {"time": 5424, "text": "So embodiment is important, yes and no."}, {"time": 5433, "text": "I don't believe that we need a physical robot walking or rolling around, interacting with the real world in order to achieve AGI."}, {"time": 5445, "text": "And I think it's more of a distraction probably than helpful, it's sort of confusing the body with the mind."}, {"time": 5454, "text": "For industrial applications or near term applications, of course we need robots for all kinds of things, but for solving the big problem, at least at this stage, I think it's not necessary."}, {"time": 5468, "text": "But the answer is also yes, that I think the most promising approach is that you have an agent and that can be a virtual agent in a computer interacting with an environment, possibly a 3D simulated environment like in many computer games."}, {"time": 5520, "text": "If you talk about objects on top of each other in space and flying and cars and so on, and the agent has no experience with even virtual 3D worlds, it's probably hard to grasp."}, {"time": 5532, "text": "So if you develop an abstract agent, say we take the mathematical path and we just want to build an agent which can prove theorems and becomes a better and better mathematician, then this agent needs to be able to reason in very abstract spaces and then maybe sort of putting it into 3D environments, simulated or not is even harmful."}, {"time": 5550, "text": "It should sort of, you put it in, I don't know, an environment which it creates itself or so."}, {"time": 5556, "text": "It seems like you have a interesting, rich, complex trajectory through life in terms of your journey of ideas."}, {"time": 5562, "text": "So it's interesting to ask what books, technical, fiction, philosophical, books, ideas, people had a transformative effect."}, {"time": 5572, "text": "Books are most interesting because maybe people could also read those books and see if they could be inspired as well."}, {"time": 5580, "text": "Yeah, luckily I asked books and not singular book."}, {"time": 5583, "text": "It's very hard and I try to pin down one book."}, {"time": 5588, "text": "And I can do that at the end."}, {"time": 5590, "text": "So the most, the books which were most transformative for me or which I can most highly recommend to people interested in AI."}, {"time": 5601, "text": "Both perhaps."}, {"time": 5602, "text": "Yeah, yeah, both, both, yeah, yeah."}, {"time": 5605, "text": "I would always start with Russell and Norvig, Artificial Intelligence, A Modern Approach."}, {"time": 5610, "text": "That's the AI Bible."}, {"time": 5613, "text": "It's an amazing book."}, {"time": 5615, "text": "It's very broad."}, {"time": 5616, "text": "It covers all approaches to AI."}, {"time": 5618, "text": "And even if you focused on one approach, I think that is the minimum you should know about the other approaches out there."}, {"time": 5624, "text": "So that should be your first book."}, {"time": 5626, "text": "Fourth edition should be coming out soon."}, {"time": 5628, "text": "Oh, okay, interesting."}, {"time": 5630, "text": "There's a deep learning chapter now, so there must be."}, {"time": 5633, "text": "Written by Ian Goodfellow, okay."}, {"time": 5635, "text": "And then the next book I would recommend, The Reinforcement Learning Book by Satneen Barto."}, {"time": 5642, "text": "That's a beautiful book."}, {"time": 5644, "text": "If there's any problem with the book, it makes RL feel and look much easier than it actually is."}, {"time": 5652, "text": "It's very gentle book."}, {"time": 5654, "text": "It's very nice to read, the exercises to do."}, {"time": 5656, "text": "You can very quickly get some RL systems to run."}, {"time": 5659, "text": "You know, very toy problems, but it's a lot of fun."}, {"time": 5662, "text": "And in a couple of days you feel you know what RL is about, but it's much harder than the book."}, {"time": 5671, "text": "Oh, come on now, it's an awesome book."}, {"time": 5674, "text": "Yeah, it is, yeah."}, {"time": 5676, "text": "And maybe, I mean, there's so many books out there."}, {"time": 5681, "text": "If you like the information theoretic approach, then there's Kolmogorov Complexity by Alin Vitani, but probably, you know, some short article is enough."}, {"time": 5690, "text": "You don't need to read a whole book, but it's a great book."}, {"time": 5694, "text": "And if you have to mention one all time favorite book, it's of different flavor, that's a book which is used in the International Baccalaureate for high school students in several countries."}, {"time": 5708, "text": "That's from Nicholas Alchin, Theory of Knowledge, second edition or first, not the third, please."}, {"time": 5716, "text": "The third one, they took out all the fun."}, {"time": 5720, "text": "So this asks all the interesting, or to me, interesting philosophical questions about how we acquire knowledge from all perspectives, from math, from art, from physics, and ask how can we know anything?"}]}]