[{"title": "Robert Crews: Afghanistan, Taliban, Bin Laden, and War in the Middle East | Lex Fridman Podcast #244", "id": "CDiqA4SJNpA", "quotes": [{"time": 293, "text": "Is it the region?"}, {"time": 295, "text": "Were you thinking about the Mujahideen and Al Qaeda and Taliban?"}, {"time": 301, "text": "Were you thinking about the Soviet Union, the proxy war through Afghanistan?"}, {"time": 306, "text": "Were you thinking about Iraq and oil?"}, {"time": 309, "text": "What's the full space of things in your heart, in your mind at the time?"}, {"time": 314, "text": "I mean, just at the moment, of course, it was just the sense of the suffering and the tragedy of the moment of the deaths."}, {"time": 321, "text": "And that was, I think, I was preoccupied by the violence of the moment."}, {"time": 326, "text": "But as the conversation turned to Afghanistan, as a kind of theater, to somehow respond to this moment, I think immediately what came to mind was that little I knew about Al Qaeda at the time suggested that the geography was inaccurate, that this was a global network, a global threat, that this was a movement that went beyond borders."}, {"time": 345, "text": "And I think that it felt early on that Afghanistan was gonna be used as a scapegoat."}, {"time": 350, "text": "And intellectually at the time, I was teaching at American University."}, {"time": 352, "text": "My courses touched on a range of subjects, but I was trying to complete a book on Islam and the Russian Empire, actually."}, {"time": 361, "text": "But in doing that research, which took me across Russia and Central Asia, purely by accident, I had developed an interest in Afghanistan because just, again, a series of coincidences."}, {"time": 372, "text": "I found myself in Tashkent, the capital of Uzbekistan, without housing, through an American friend who was like the king of the market in Tashkent."}, {"time": 380, "text": "He knew everyone."}, {"time": 381, "text": "He ran into some Afghan merchants there."}, {"time": 384, "text": "They found out I didn't have a place to live."}, {"time": 386, "text": "I didn't know where Afghanistan was, honestly."}, {"time": 388, "text": "This was 1997."}, {"time": 389, "text": "I had a vague idea it was next door."}, {"time": 390, "text": "Well, you lived in Uzbekistan?"}, {"time": 392, "text": "Yeah, in Tashkent, doing dissertation research, yeah."}, {"time": 395, "text": "Because it was hub of the Russian Empire in Central Asia."}, {"time": 397, "text": "So just by accident, I met with these young Afghans who took me in as roommates."}, {"time": 402, "text": "And that, I think, the sense of that community shaped my idea of what Afghanistan is."}, {"time": 408, "text": "It was my first exposure to them."}, {"time": 411, "text": "They were part of a trading diaspora."}, {"time": 413, "text": "They had brought matches from Riga, Latvia."}, {"time": 417, "text": "They had somehow brought flour and some agricultural products from Egypt."}, {"time": 422, "text": "And they were sitting in closed containers in Tashkent waiting for the Uzbekistan state to permit them to trade."}, {"time": 430, "text": "So these guys are mostly hanging out during the day."}, {"time": 431, "text": "They'll get dressed up."}, {"time": 432, "text": "They put on suits and ties like you're wearing."}, {"time": 435, "text": "They'd polish their shoes."}, {"time": 436, "text": "And they would sit around offices, drink tea, pistachios."}, {"time": 441, "text": "Then they'd feast at lunch."}, {"time": 443, "text": "And then at night, we would go out."}, {"time": 445, "text": "So part of my research, because I also had a bottleneck in my research, I was going to the state archives in Tashkent."}, {"time": 451, "text": "And because of the state of Uzbekistan, that was a very kind of suspicious thing to do."}, {"time": 456, "text": "So it took a while to get in."}, {"time": 458, "text": "So I had downtime in Tashkent, just like these guys."}, {"time": 461, "text": "So I got to know them pretty well."}, {"time": 462, "text": "And it was really just an accidental kind of thing, but grew quite close to them."}, {"time": 467, "text": "And I developed an appreciation of, which now I think, again, thinking of the seeds of all this, these people had already lived, young guys in their 20s, they'd already lived in six or seven countries."}, {"time": 479, "text": "They all spoke half a dozen languages."}, {"time": 482, "text": "One of my best friends there had been a kickboxer and break dancer, trained in Tehran."}, {"time": 488, "text": "His father was a theater person in Afghanistan."}, {"time": 491, "text": "He told stories of escaping death in Afghanistan during the civil war, going to Uzbekistan, escaping death there."}, {"time": 498, "text": "And these were very real stories."}, {"time": 501, "text": "Can you also just briefly mention, geographically speaking, Afghanistan, Uzbekistan, Tajikistan, you mentioned Iran."}, {"time": 509, "text": "Who are the neighbors of all of this?"}, {"time": 512, "text": "What are we supposed to be thinking about for people?"}, {"time": 515, "text": "I was always terrible at geography and spatial information."}, {"time": 518, "text": "So can you lay it out?"}, {"time": 520, "text": "So Tashkent is the capital of Uzbekistan."}, {"time": 524, "text": "It was a hub of Russian imperial power in the 19th century."}, {"time": 529, "text": "The Russians take the city from a local kind of Muslim dynasty in 1865."}, {"time": 535, "text": "It becomes the city, the kind of hub of Soviet power in Central Asia after 1917."}, {"time": 541, "text": "It becomes the center of the Soviet Republic of Uzbekistan, which becomes independent finally in 1991 when the Soviet Union collapses."}, {"time": 550, "text": "So these are all like these republics are the fingertips of Soviet power in Central Asia."}, {"time": 559, "text": "And they've been independent since 1991, but they have struggled to disentangle themselves from Moscow, from one another."}, {"time": 568, "text": "And now they face very serious pressure from China to form a kind of periphery of the great machine that is the Chinese economy and its ambitions to stretch across Asia."}, {"time": 580, "text": "For Afghanistan, where my roommates, my friends hailed from, Afghanistan had fallen into civil war in the late 1970s when leftists tried to seize power there in 1978."}, {"time": 594, "text": "The Soviet Union then extended from Uzbekistan, crossing the border with its forces in 1979 to try to shore up this leftist government that had seized power in 1978."}, {"time": 606, "text": "And so for Central Asians in the wider region, their fate had for some decades been tied to Afghanistan in a variety of ways, but it became much more connected in the 1980s when the Soviet Red Army occupied Afghanistan for 10 years."}, {"time": 623, "text": "And here, I refer your listeners and viewers to Rainbow Three as the guide to."}, {"time": 628, "text": "The historically accurate guide."}, {"time": 630, "text": "The historically accurate, the Bible."}, {"time": 632, "text": "The Bible of Afghan history in Rainbow Three, yeah."}, {"time": 634, "text": "As a fantastic window onto the American view of the war."}, {"time": 639, "text": "But for us Afghans, there are people who fought against the Soviet army, but of a certain generation, the guys I knew, their mission was to survive."}, {"time": 650, "text": "And so they fled in waves by the millions to Pakistan, to Iran."}, {"time": 656, "text": "Some went north into Soviet Central Asia later in the 1990s."}, {"time": 660, "text": "And some were displaced across the planet."}, {"time": 662, "text": "So California, where we're sitting today, has a large community that came in the 80s and 90s in the East Bay."}, {"time": 669, "text": "Can I ask a quick question that's a little bit of a tangent?"}, {"time": 673, "text": "What is the correct or the respectful way to pronounce Afghanistan, Afghanistan, Iran, Iran?"}, {"time": 685, "text": "So as a Russian speaker, Afghanistan."}, {"time": 690, "text": "The an versus the an."}, {"time": 693, "text": "Is it a different country by country?"}, {"time": 694, "text": "As an English speaker in America, is it pretentious and disrespectful to say Afghanistan?"}, {"time": 701, "text": "Or is it the opposite, respectful to say it that way?"}, {"time": 707, "text": "I defer to the people from those countries to, of course, sort out those politics."}, {"time": 712, "text": "I think one of the fascinating things about the region broadly is that it is a place of so many cultures and it's really quite cosmopolitan."}, {"time": 720, "text": "So I think people are mostly quite forgiving about how you say Afghanistan, Afghanistan."}, {"time": 724, "text": "It's not like Paris."}, {"time": 726, "text": "The French are not forgiving."}, {"time": 729, "text": "I think people are very, very forgiving."}, {"time": 730, "text": "And I think that Iranians are a bit more instructive in suggesting Iran rather than Iran, Iraq, Iraq."}, {"time": 742, "text": "I think there's going to be a fit between certain ways of pronouncing these places and the position that Americans take about them."}, {"time": 750, "text": "So it's more jarring when people say Iraq and it comes with a claim that a certain kind of person should be the victim of violence or."}, {"time": 764, "text": "It's kind of like talking about the Democratic Party or the Democrat Party."}, {"time": 768, "text": "It's sometimes using certain kind of terminology to make a little bit of a sort of implied statement about your beliefs."}, {"time": 779, "text": "Yeah, I mean, I think when I hear Iraq and Iran, I mean, I think it, yeah, is it intentional in the case of a Democrat or is it just a, you know, and it's a whatever."}, {"time": 788, "text": "Again, I think most Iranians and Afghans people I know have been very cool about that."}, {"time": 792, "text": "What annoys Afghans now, I can say, I think it's fair to say, I don't mean to speak for many people, for the entire group of people, but I can just share with our non Afghan friends."}, {"time": 804, "text": "The term Afghani is a kind of term of offense because that's the name of the currency."}, {"time": 809, "text": "And so lots of people ask, you know, why having, especially again, it's more directed at Americans because, you know, we've been so deeply involved in that country obviously for the last 20 years, right?"}, {"time": 820, "text": "So Afghans ask why after 20 years, are you still calling us the wrong name?"}, {"time": 825, "text": "What is the right name of somebody?"}, {"time": 827, "text": "They prefer Afghans."}, {"time": 828, "text": "Afghans."}, {"time": 829, "text": "Yeah, and Afghani is the name of the currency."}, {"time": 833, "text": "I just dodged a bullet because I was gonna say Afghans."}, {"time": 834, "text": "That's cool, no, no, no, yeah, I hear you."}, {"time": 836, "text": "That's really great to know."}, {"time": 837, "text": "Yeah, and it's, again, I think, but I would emphasize that people are quite open and, you know, it's a whole region of incredible diversity and respect for linguistic pluralism actually."}, {"time": 849, "text": "So I think that, you know, but I also appreciate that in this context, when there's a lot of pain, you know, in the Afghan diaspora community in particular, you know, being called the wrong name after 20 years when they already feel so betrayed at this moment, you know, just kind of, if one follows this on social media, that is one kind of hot wire, right?"}, {"time": 872, "text": "Yeah, so the reason I ask about pronunciation is because, yes, it is true that there are certain things when mispronounced kind of reveal that you don't care enough to pronounce correctly."}, {"time": 884, "text": "So I don't know enough to pronounce correctly and you dismiss the culture and the people, which I think as per your writing is something that, if it's okay, I'll go with Afghanistan just because I'm used to it."}, {"time": 898, "text": "I say Iraq, Iran, but I say Afghanistan."}, {"time": 902, "text": "As you do in your writing, Afghanistan suffers from much misunderstanding from the rest of the world."}, {"time": 908, "text": "But back to our discussion of Uzbekistan, Tajikistan, the whole region that gives us context for the events of 9 11."}, {"time": 920, "text": "So yeah, if we go back to that day and the weeks that followed, in my mind went to the community I knew in Tashkent, which was interesting."}, {"time": 928, "text": "I mean, they were, so Islam was the focal point of our conversation in the US about 9 11, right?"}, {"time": 934, "text": "Everyone to know what was the relationship between the civic violence and that religious tradition with its 1 billion plus followers across the globe, right?"}, {"time": 945, "text": "That became the issue, of course, for American security institutions, for local state and police institutions, right?"}, {"time": 953, "text": "I mean, it became the, I think it was the question that most Americans had on their mind."}, {"time": 956, "text": "So again, I didn't imagine myself as someone who had all the answers, of course, but given my background and coming at this from Russian history, coming at this from studying empire and trying to think about the region broadly, I was very alarmed at the way that the conversation went."}, {"time": 972, "text": "Can I ask you a question?"}, {"time": 973, "text": "What was your feeling on that morning of 9 11?"}, {"time": 979, "text": "Who did this?"}, {"time": 980, "text": "Isn't that a natural feeling?"}, {"time": 982, "text": "It's coupled with fear of what's next, especially when you're in DC, but also who is this?"}, {"time": 988, "text": "Is this an accident?"}, {"time": 990, "text": "Is this a deliberate terrorist attack?"}, {"time": 992, "text": "Is this domestic?"}, {"time": 994, "text": "What were your thoughts of the options and the internal ranking given your expertise?"}, {"time": 1001, "text": "I suppose I was taken by the narrative that this was international."}, {"time": 1006, "text": "I mean, I'd also lived in New York during one of the first bombings in 94 of the World Trade Center."}, {"time": 1012, "text": "So it was clear to me that a radical community had really fixed New York as part of their imagination of, and I immediately thought it was a kind of blow to American power."}, {"time": 1024, "text": "And I was drawn by the symbolism of it."}, {"time": 1028, "text": "If you think of it as an act, it was a kind of an act of speech, if you will, a kind of a way of speaking to, from a position of relative weakness, speaking to an imperial power."}, {"time": 1041, "text": "And I saw it as a kind of symbolic speech act of that with horrific real world consequences for all those innocent victims, for the firemen, for the police, and just the horror of the moment."}, {"time": 1055, "text": "So I did see it as transcending the United States, but I did not see it as really having anything necessarily to do fundamentally about Afghanistan and the history of the region that I'd been studying and the community people that I knew who were not particularly religious."}, {"time": 1072, "text": "The guys I hung out with actually wore me out because they wanted to go out every night."}, {"time": 1076, "text": "They wanted to party every night."}, {"time": 1077, "text": "Drinking?"}, {"time": 1079, "text": "We had discussions about alcohol."}, {"time": 1080, "text": "I mean, Uzbekistan is famous for its, you know."}, {"time": 1082, "text": "Drinking."}, {"time": 1083, "text": "It's drinking."}, {"time": 1084, "text": "You know, it's."}, {"time": 1085, "text": "That's something to look forward to."}, {"time": 1086, "text": "So I do want to travel to that part of the world."}, {"time": 1088, "text": "When was the last time you were in that part of the world?"}, {"time": 1091, "text": "Early 2000s."}, {"time": 1092, "text": "Well, in the mid 2000s, 2010s."}, {"time": 1094, "text": "So wait, so by the way, what drinking?"}, {"time": 1096, "text": "Vodka?"}, {"time": 1097, "text": "What's the, what's the weapon of choice?"}, {"time": 1100, "text": "Uzbekistan has incorporated vodka as the choice."}, {"time": 1106, "text": "And that, and it informs, you know, and it's, but the fascinating thing, you know, as a student, is what you're observing as a non Muslim."}, {"time": 1112, "text": "You know, I'm a non Russian."}, {"time": 1114, "text": "I'm, this is all, you know, culturally new to me."}, {"time": 1118, "text": "And I'm, you know, a student of all that, right?"}, {"time": 1120, "text": "As a grad student doing my work there."}, {"time": 1122, "text": "So you're like Jane Goodall of vodka and Russia."}, {"time": 1126, "text": "You're just observing."}, {"time": 1128, "text": "You get the Samogon, the grass vodka."}, {"time": 1131, "text": "You get, you know, I have, I've had some long nights on the Kazakhstan frontier that I'm not proud of, you know."}, {"time": 1140, "text": "But you got to know the people and some of them from, from, from."}, {"time": 1143, "text": "But intellectually, so the thing, I mean, the fascinating thing there was that, and just as a, I mean, there's a whole, you know, I'm a historian, right?"}, {"time": 1149, "text": "But there, there are great contributions by, you know, anthropologists and ethnographers who, who've gone across the planet and try to understand how Muslims understand the tradition at different contexts."}, {"time": 1161, "text": "So many Uzbeks will say, you know, this is part of our national culture to drink and eat as we please, right?"}, {"time": 1169, "text": "And yet I'm a very devout Muslim."}, {"time": 1171, "text": "And so of course you can encounter other Muslim communities who won't touch alcohol, right?"}, {"time": 1177, "text": "But it's become kind of, I think it's very much, you know, Soviet culture left a deep impression in each of these places."}, {"time": 1183, "text": "And so there are ways of thinking, ways of performing, ways of, you know, enjoying oneself that are shared across Soviet and former Soviet space to this day, right?"}, {"time": 1194, "text": "And you've written also about Muslims in the Soviet Union."}, {"time": 1199, "text": "There's an article that, there was a paywall, so I couldn't read it and I really want to read it."}, {"time": 1204, "text": "It's a Moscow in the mosque or something like that."}, {"time": 1211, "text": "By the way, just another tangent on a tangent."}, {"time": 1215, "text": "So I bought all your books."}, {"time": 1216, "text": "I love them very much."}, {"time": 1218, "text": "One of the reasons I bought them and read many parts is because they're easy to buy."}, {"time": 1224, "text": "Unlike articles, every single website has a paywall."}, {"time": 1228, "text": "So it's very frustrating to read brilliant scholars such as yourself."}, {"time": 1235, "text": "I wish there was one fee I could pay everywhere."}, {"time": 1237, "text": "I don't care what that fee is, where it gives, allows me to read some of your brilliant writing."}, {"time": 1242, "text": "No, no, thank you, I hear you."}, {"time": 1243, "text": "I think moving toward more kind of open source formatting stuff I think is what a lot of journals are thinking about now and I think it's definitely for the kind of democratization of knowledge and scholarship that's definitely an important thing that we should all think about."}, {"time": 1256, "text": "And I think we need to exert pressure on these publishers to do that, so I appreciate that."}, {"time": 1262, "text": "This is what I'm doing here."}, {"time": 1263, "text": "Yeah, yeah, yeah, good, good, I appreciate it."}, {"time": 1266, "text": "So your thought was Afghanistan is not going to be to be the center, the source of where."}, {"time": 1274, "text": "It's not the center of this and invading that country isn't gonna fix the toxic milestone of politics that produced 9 11, right?"}, {"time": 1285, "text": "I'm just thinking of some of the personalities, just thinking about going back to the Tashkent story which I'll end with."}, {"time": 1289, "text": "I mean, just observing real Muslims doing things and then asking questions about it and trying to understand through their eyes what the tradition means to them."}, {"time": 1300, "text": "And then we had a very narrow conversation about what Islam is that generated, immediately exploded on the day of 9 11, right?"}, {"time": 1310, "text": "And then of course, I think the antipathy toward Islam and Muslims was informed by racism, informed by xenophobia."}, {"time": 1348, "text": "And they wanted to go out every night and they explained, one friend, we talked about it with the alcohol and all that and he didn't get crazy, but he was like, you can drink, but just don't get drunk."}, {"time": 1358, "text": "That's permissible within Islam, right?"}, {"time": 1362, "text": "And he was an ethnic Pashtun."}, {"time": 1364, "text": "I think Uzbeks had a different view, often the more vodka the better, and it doesn't violate, as I understand Islam."}, {"time": 1371, "text": "So even, it's kind of a silly example, but it's just an illustration of the ways in which different communities, different generations, different people can come at this very complex rich tradition in so many different ways."}, {"time": 1382, "text": "So obviously, whatever kind of scholar you are, or any kind of expert, whatever, it's always disconcerting to see your field of specialization be flattened, right?"}, {"time": 1393, "text": "And then be flattened and then be turned to arguments for violence, right?"}, {"time": 1398, "text": "Mixed up with the natural human feelings of hate."}, {"time": 1403, "text": "And depression."}, {"time": 1403, "text": "And hurt at that moment, and pain."}, {"time": 1405, "text": "So, I mean, that day I vividly remember, I sat with other PhD historians in different fields."}, {"time": 1412, "text": "We, oddly enough, had lunch that day and it kind of deserted Washington."}, {"time": 1417, "text": "Some place was open when we went."}, {"time": 1419, "text": "And we just thought, you know, this is going to kind of open up like a great mall of destruction."}, {"time": 1425, "text": "And, you know, the American state is going to destroy and it's going to destroy in this geography."}, {"time": 1433, "text": "And I thought that was misplaced for lots of reasons."}, {"time": 1436, "text": "And then I think if one, you know, I'd been doing some research on Afghanistan then, I was kind of shifting to the South and I'd been looking at the Taliban from afar for some years."}, {"time": 1448, "text": "And, you know, I think it's clear now that in retrospect there were opportunities for alternative policies at that moment."}, {"time": 1456, "text": "So what should the conversation have been like?"}, {"time": 1460, "text": "What should we have done differently?"}, {"time": 1463, "text": "Because, you know, from a perspective of the time, the United States was invaded by a foreign force."}, {"time": 1473, "text": "What is the proper response or what is the proper conversation about the proper response at the time, you think?"}, {"time": 1479, "text": "You know, I know my colleague at Stanford, Condoleezza Rice would tell me this is above my pay grade."}, {"time": 1484, "text": "And, you know, she makes a point in her classes to talk about how difficult decision making is under such intense pressure."}, {"time": 1493, "text": "You know, I am a historian who sits safely in my office."}, {"time": 1497, "text": "I don't like battlefields."}, {"time": 1498, "text": "I don't like taking risks."}, {"time": 1501, "text": "So I can see all those limits."}, {"time": 1502, "text": "You know, I'm not a military expert."}, {"time": 1505, "text": "I've been accused of being a spy wherever I've gone because of the way I look and because of my nationality and so on, but I'm not a spy."}, {"time": 1510, "text": "So I defer, you know, I respect the expertise of all those communities."}, {"time": 1513, "text": "But I think they acted out of ignorance."}, {"time": 1516, "text": "They acted, I think, because, I mean, you think of the, in a way there was a compensatory aspect of this decision making."}, {"time": 1523, "text": "I mean, the Bush administration failed."}, {"time": 1527, "text": "This was an extraordinary failure, right?"}, {"time": 1529, "text": "So if we start."}, {"time": 1531, "text": "Can we break down the nation?"}, {"time": 1532, "text": "Of intelligence."}, {"time": 1532, "text": "I mean, if they, you know, if you follow the story of Richard Clarke."}, {"time": 1536, "text": "Who's Richard Clarke?"}, {"time": 1537, "text": "He was a national security expert who was tasked with following Al Qaeda, who had produced a dossier under the Clinton administration that he passed on to the George W. Bush administration."}, {"time": 1550, "text": "And if you look at the work of Condoleezza Rice, she wrote a very famous, I think, unpaywalled foreign affairs article that you can read, announcing the George W. Bush foreign policy kind of outlook."}, {"time": 1562, "text": "And it was all about great powers."}, {"time": 1565, "text": "It was about the rise of China."}, {"time": 1566, "text": "It was about Russia."}, {"time": 1567, "text": "I mean, there's definitely a kind of hangover of those who missed having Russia as the boogeyman."}, {"time": 1576, "text": "Who spoke, you know, the Clinton administration repeated again and again the idea of making sure the bear stayed in his cage."}, {"time": 1582, "text": "Which is why the United States threw a lifeline to the Central Asian states, hoping to have pipelines, hoping to shore up their national sovereignty as a way of containing Russia initially, but also Iran, you know, which sits to the south and west."}, {"time": 1602, "text": "And then peripherally looking down the road to China to the east."}, {"time": 1605, "text": "So the bear is what, like Russia?"}, {"time": 1610, "text": "Or is it kind of like some weird combination of Russia, Iran, and China?"}, {"time": 1615, "text": "The bear is Russia and Russia is this thing."}, {"time": 1620, "text": "I'm trying to characterize the imagination of some of these national security figures."}, {"time": 1624, "text": "This is an image formed in the Cold War."}, {"time": 1627, "text": "I mean, it has deeper seeds in European and Western intellectual thought that go back at least to the 1850s and the reign of Tsar Nicholas I."}, {"time": 1637, "text": "When we first get this language about the Russian Empire as this kind of evil polity."}, {"time": 1644, "text": "Obviously this was a kind of pillar of Reaganism."}, {"time": 1649, "text": "But the Clinton folks kept that alive."}, {"time": 1650, "text": "They wanted to make sure that American power would be unmatched."}, {"time": 1656, "text": "And they, being creatures of the Cold War themselves, they looked to Russia as a recession power well before Putin was even thought of."}, {"time": 1665, "text": "Yeah, I mean, this is, you mentioned one deep, profound historical piece in Rambo."}, {"time": 1672, "text": "It's probably, this conflict has to do with another Sylvester Stallone movie, a Rocky IV, which is also historically accurate and based on, it's basically a documentary."}, {"time": 1683, "text": "So there is something about the American power, even at the level of Condoleezza Rice, these respected deep kind of leaders and thinkers about history and the future, where they like to have competition with other superpowers and almost conjure up superpowers, even when those countries don't maybe at the time at least deserve the label of superpower."}, {"time": 1713, "text": "That's right, great point."}, {"time": 1714, "text": "Yeah, they're all some points."}, {"time": 1715, "text": "So yeah, I mean, Russia was, I think many, many exports."}, {"time": 1719, "text": "I mean, my mentor at Princeton, Stephen Cotkin, was then writing great things about how, if you look at Russia's economy, the scale of its GDP, its capacity to actually act globally, it's all quite limited."}, {"time": 1734, "text": "But Condoleezza Rice and the people around her came into power with George W. Bush, thinking that the foreign policy challenges of her era would be those of the past, right?"}, {"time": 1746, "text": "Richard Clark and others within the administration warned that, in fact, there is this group that has declared war against the United States and they are coming for us."}, {"time": 1754, "text": "The FBI had been following these people around for many months."}, {"time": 1758, "text": "So by the time George W. Bush comes to power, lots of Al Qaeda activists are, well, not lots, but perhaps a dozen or so, are already training in the United States, right?"}, {"time": 1770, "text": "And what we knew immediately from the biographies of some of the characters of the attackers of 9.11, it was a hodgepodge of people from across the planet, but most of them were Saudi, right?"}, {"time": 1779, "text": "And that was known very early on or presumed very early on."}, {"time": 1783, "text": "So again, if we go back to your big question about the geography, why Afghanistan?"}, {"time": 1787, "text": "It didn't add up, right?"}, {"time": 1788, "text": "It seemed to me that Afghanistan was a kind of soft target."}, {"time": 1791, "text": "It was a place to have explosions, to seemingly recapture American supremacy."}, {"time": 1798, "text": "And also, I think, you know, there was, in many quarters, there was a deep urge for revenge."}, {"time": 1802, "text": "And this was a place to have some casualties, have some explosions."}, {"time": 1807, "text": "And then I think, you know, restore the legitimacy of the Bush administration by showing that we are in charge, we will pay."}, {"time": 1814, "text": "And I think that was a very old fashioned punitive dimension, which rests upon the presumption that if we intimidate these people, they'll know not to try us again, right?"}, {"time": 1823, "text": "All these, I would suggest, are all misreadings of an organization that was always global."}, {"time": 1828, "text": "It had no real center."}, {"time": 1829, "text": "I mean, it called itself the center."}, {"time": 1830, "text": "That's one way to translate Al Qaeda."}, {"time": 1832, "text": "But that center was really in the imagination."}, {"time": 1836, "text": "Bin Laden bounced around from country to country."}, {"time": 1840, "text": "And crucially, I think a dimension that I don't claim to know anything new about, but has endured as a kind of doubt, is the role of Saudi Arabia and the fact that, you know, the muscle in that operation of 9 11 was Saudi, right?"}, {"time": 1855, "text": "I mean, this was a Saudi operation with, if one thinks, again, just on the basis of nationalities, Saudis, you know, an Egyptian or two, a Lebanese guy."}, {"time": 1864, "text": "And the Egyptian guy, you know, had been studying in Germany."}, {"time": 1868, "text": "He was an urban planner, right?"}, {"time": 1870, "text": "So if one thinks of the imagination of this, I mean, in fact, if you look at the kind of typology of the figures who have led this radical movement, I mean, if you think of the global jihadists, they are mostly not religious scholars, right?"}, {"time": 1885, "text": "Bin Laden was not a religious scholar."}, {"time": 1887, "text": "His training was an engineer."}, {"time": 1889, "text": "You know, some biographers claim that he was a playboy for much of his youth."}, {"time": 1892, "text": "But really, these ideas, I think that's probably why they chose the Twin Towers."}, {"time": 1897, "text": "I mean, this is an imagination fueled by training and engineering."}, {"time": 1903, "text": "I mean, a lot of the, you know, the sociology, if you do a kind of post biography of a lot of these leading jihadists, their backgrounds are not in Islamic scholarship, but actually in engineering and kind of practical sciences and professions."}, {"time": 1917, "text": "Medical doctors are among their ranks."}, {"time": 1920, "text": "And so there's long been a tension between Islamic scholars who devote their whole lives to study of texts and commentary and interpretation."}, {"time": 1963, "text": "With the relation to Afghanistan, who was bin Laden?"}, {"time": 1967, "text": "Bin Laden was a visitor."}, {"time": 1970, "text": "If you look at his whole life course, part of it is an enigma still."}, {"time": 1975, "text": "You know, he is from a Saudi elite family, but a family that kind of has a Yemeni Arabian sea kind of genealogy."}, {"time": 1987, "text": "So the family has no relationship to Afghanistan, past or present, except at some point in 1980s, when he went like thousands of other young Saudis, first to Pakistan, to places like Bashour on the border, where they wanted to aid the jihad in some capacity."}, {"time": 2005, "text": "And for the most part, the Arabs who went opened up hospitals, some opened up schools."}, {"time": 2012, "text": "The bin Laden family had long been based in engineering construction."}, {"time": 2017, "text": "So it's thought that he used some of those skills and resources and connections to build things."}, {"time": 2024, "text": "We have images of him firing a gun for show, right?"}, {"time": 2028, "text": "It's not clear that he ever actually fired a gun in what we would call combat."}, {"time": 2033, "text": "Again, I could be corrected by this."}, {"time": 2035, "text": "And I think there are competing accounts of who he was."}, {"time": 2038, "text": "So he's kind of a, I mean, many of these figures who sit at the pinnacle of this world are fictive heroes that people map their aspirations onto, right?"}, {"time": 2048, "text": "And so people like Mullah Omar, who was then head of the Taliban, was rarely seen in public."}, {"time": 2055, "text": "The current head of the Taliban is almost never seen in public."}, {"time": 2059, "text": "I mean, there's a kind of studied era of mystery that they've cultivated to make themselves available for all kinds of fantasies, right?"}, {"time": 2067, "text": "Do you think he believed, so his religious beliefs, do you think he believed some of the more extreme things that enable him to commit terrorist acts?"}, {"time": 2082, "text": "Maybe put another way, what makes a man want to become a terrorist?"}, {"time": 2086, "text": "And what aspect of bin Laden made him want to be a terrorist?"}, {"time": 2092, "text": "I mean, let me offer some observations."}, {"time": 2094, "text": "I think there are others who know more about bin Laden and have far more expertise in Al Qaeda."}, {"time": 2099, "text": "So I'm coming at this in an adjacent way, kind of from Afghanistan and from my historical training."}, {"time": 2106, "text": "So this is my two cents, so bear with me."}, {"time": 2110, "text": "I don't have the authoritative account for this."}, {"time": 2112, "text": "Which in itself is fascinating because you're a historian of Afghanistan, and the fact that bin Laden isn't a huge part of your focus of study just means that bin Laden is not a key part of the history of Afghanistan except that America made him a key part of the history of Afghanistan."}, {"time": 2132, "text": "I would endorse that."}, {"time": 2133, "text": "Definitely, that's it."}, {"time": 2134, "text": "I mean, you've put it in a very pithy, pithy way."}, {"time": 2137, "text": "Yeah, so listen, so he was an engineer."}, {"time": 2140, "text": "He was said to be a playboy who spent a lot of cash from his family."}, {"time": 2145, "text": "Like many young Saudis and from some other countries, he was inspired by this idea that there was jihad in Afghanistan."}, {"time": 2152, "text": "It was gonna take down one of the two superpowers, the Soviet Union, who the Red Army did murder hundreds of thousands, perhaps as many as 2 million Afghan civilians during that conflict."}, {"time": 2167, "text": "It's very plausible and very completely understandable that many young people would see that cause as the righteous, pious fighters for jihad who call themselves mujahideen are ready against this evil empire of a godless Soviet empire that, I mean, there's even confusion about what the Soviets wanted."}, {"time": 2192, "text": "Now we know much more about what the Kremlin wanted, what Brezhnev wanted, and how the Soviet elite thought about it because we have many more of their records."}, {"time": 2199, "text": "But from the outside, for Jimmy Carter and then for Reagan, it looked like the Soviets were making a move on South Asia because they wanted to get to the warm water ports, which Russians always want supposedly, right?"}, {"time": 2212, "text": "And it was kind of a move to take over our oil and to assert world domination, right?"}, {"time": 2218, "text": "So there are lots of ways in which this looked like good versus evil in Congress."}, {"time": 2223, "text": "It looked like kind of Vietnam again, but this time this is our chance to get them."}, {"time": 2228, "text": "And there are lots of great quotes, I mean, disturbing, but really revealing quotes that American policymakers made about wanting to give the Soviets their Vietnam."}, {"time": 2238, "text": "So the CIA funneled hundreds of millions of dollars into this project to back the Mujahideen, who Reagan called freedom fighters."}, {"time": 2247, "text": "And so Bin Laden was part of that universe, he's part of that, he's swimming in the ocean of these Afghan Mujahideen who out of size did 95% of the fighting, they're the ones who died, they're the ones who defeated the Red Army, right?"}, {"time": 2260, "text": "The Arabs who were there did a little fighting, but a lot of it was for their purposes."}, {"time": 2265, "text": "It was to get experience, it was to kind of create their reputations like Bin Laden began to force for himself of being spoken for a global project."}, {"time": 2306, "text": "And so their retreat was quite effective and successful from the Soviet point of view, right?"}, {"time": 2313, "text": "It's not what we're seeing now."}, {"time": 2315, "text": "What year was the retreat?"}, {"time": 2317, "text": "I mean, it began, so Mikhail Gorbachev came to power in 1985, he was a generation younger than the other guys, he was a critic of the system, he didn't want to abolish it, he wanted to reform it, he was a true believer in Soviet socialism and in the party as a monopolist, right?"}, {"time": 2336, "text": "But he was critical of the old guard and recognized that the party had to change and the whole system had to change to continue to compete."}, {"time": 2344, "text": "And so Afghanistan was one element of this."}, {"time": 2347, "text": "And so he pushed the Afghan elites that Moscow was backing to basically say, listen, we're gonna share power."}, {"time": 2356, "text": "And so a figure named Najibullah, who was a Soviet trained intelligence specialist sitting in Kabul agreed."}, {"time": 2366, "text": "And he said, we need to have a more kind of pluralistic accommodations approach to our enemies who are backed by the US mainly, sitting in Pakistan, sitting in Iran, backed by these Arabs to a degree, getting money from Saudi."}, {"time": 2382, "text": "And he said, let's draw some of them into the government and basically have a kind of unity government that would make some space to the opposition."}, {"time": 2390, "text": "And for the most part, with US backing, with Pakistani backing, with Iranian backing and with Saudi backing, the opposition said, no, we're not going to reconcile, we're gonna push you off the cliff."}, {"time": 2402, "text": "And so that story goes on from at least 1987, the last Soviet Red Army troops leave early 1989, but the Najibullah government holds on for three more years."}, {"time": 2415, "text": "It is the, I mean, they're still getting some help from the Soviet Union, its enemies are still getting help from the US mainly."}, {"time": 2421, "text": "And it's not till 1992 that they lose."}, {"time": 2427, "text": "And then Mujahideen come to power, they immediately, they're deeply fractured."}, {"time": 2433, "text": "And that's where bin Laden is watching all of this unroll."}, {"time": 2436, "text": "And he's part of the mix, but he's also mobile."}, {"time": 2437, "text": "So he at one point goes, is in Sudan."}, {"time": 2442, "text": "He's moving from place to place."}, {"time": 2444, "text": "His people are all over the world."}, {"time": 2445, "text": "In fact, they, I mean, if you think of the, once the Mujahideen take power, they have difficulties with Arab fighters too."}, {"time": 2452, "text": "And they don't want them coming in and messing with Mujahideen regarding this as like, this is an Afghan national state that we're gonna build."}, {"time": 2459, "text": "It's gonna be Islamic, it's gonna be an Islamic state, but you can't interfere with us."}, {"time": 2463, "text": "And so there are always tensions."}, {"time": 2465, "text": "And so the Arabs are always kind of, I would say they were Arab fighters were always interlopers."}, {"time": 2471, "text": "Yes, the Afghans are happy to take their money, send patients to their hospitals, take their weapons, but they were never gonna let this be like a Saudi or Egyptian or whatever project."}, {"time": 2483, "text": "But then many of those fighters went home, they went back to Syria, they went back to Egypt."}, {"time": 2489, "text": "Some wanted to go back to the Saudi Arabia, but the Saudis were very careful."}, {"time": 2491, "text": "I mean, the Saudis always used Afghanistan as a kind of safety valve."}, {"time": 2494, "text": "In fact, they had fundraisers on television, they chartered jets."}, {"time": 2498, "text": "They filled them with people to fly to Pakistan, get out in the shower and say, go fight."}, {"time": 2504, "text": "And it was one way that the monarchy, the Saudi monarchy, very cleverly I think, created a kind of escape valve for would be dissidents in Saudi Arabia, right?"}, {"time": 2515, "text": "Just send them abroad."}, {"time": 2516, "text": "You wanna fight Jihad, go do that somewhere else."}, {"time": 2519, "text": "Don't bother the kingdom."}, {"time": 2521, "text": "But all this became dicier in the early 90s when some of these guys came back home and some of the scholars around them said, we've defeated the Soviet Union, which is a huge, huge boost."}, {"time": 2531, "text": "And I think part of the dynamic we see today is that the Taliban victory is a renewed inspiration for people who think, look, we beat the Soviets, now we beat the Americans."}, {"time": 2541, "text": "And so already watching the Soviet retreat across this bridge, back into Uzbekistan, if you see these dramatic images of the tanks moving, a lot of people interpreted this as like, we are going to change the world and now we're training to the Americans."}, {"time": 2556, "text": "And our local national governments are backed by the Americans."}, {"time": 2559, "text": "So let's start with those places and then let's go strike the belly of the beast, which is America, which is New York."}, {"time": 2567, "text": "And going back to Bin Laden, your question about what motivates him, what motivated him, again, he was not a rigorously trained Islamic scholar."}, {"time": 2577, "text": "And that I think, when this comes up in our classes, I think especially young people, I mean, people who weren't even born on 9 11, I mean, they're shocked, they see his appearance, they see him pictured in front of a giant bookshelf of Arabic books, he's got the Kalashnikov, he's got what looks like a religious scholars library behind him, right?"}, {"time": 2596, "text": "But if you look at his words, I mean, one fascinating thing about just our politics and just one thing that kind of sums all this up, I mean, the fact that on 9 11, we had to have a few people, a few experts, people like Burnett Rubin, who was an Afghanistan expert."}, {"time": 2612, "text": "So that was one way in which I think, I'm not faulting him personally, but it's just one way in which that relationship appeared to be formed, right?"}, {"time": 2620, "text": "Of linking Afghanistan to that moment."}, {"time": 2624, "text": "If one looks actually at what Bin Laden was saying and doing, people like Richard Clarke were studying this, there were Arab leaders, the Arab press was watching this because he gave some of his first interviews to a few Arab newspaper outlets."}, {"time": 2637, "text": "But speaking of our American kind of monolingualism, a lot of what he was saying wasn't known."}, {"time": 2641, "text": "And so I think for several years, people weren't reading what Bin Laden said."}, {"time": 2647, "text": "I mean, experts are reading it in Arabic, but there was great anxiety around translating his works."}, {"time": 2653, "text": "So we have Mon conf, we have all this other stuff, you can buy the collected works of Lenin, Stalin, Mao, whatever you want in whatever language you want."}, {"time": 2660, "text": "But Bin Laden was taboo for American publishing."}, {"time": 2662, "text": "So it was only a Verso in the UK that published a famous volume called Messages to the World, which was the first compendium of Bin Laden's writings."}, {"time": 2673, "text": "So he has a Mein Kampf."}, {"time": 2675, "text": "He has a type, does he have a thing?"}, {"time": 2678, "text": "I mean, it's a kind of collected works."}, {"time": 2679, "text": "It's a collected works of his, yeah."}, {"time": 2681, "text": "Well, like a blog, like a collection of articles versus."}, {"time": 2686, "text": "Yeah, these are interviews, these are his missives, his declarations, his decrees, right?"}, {"time": 2694, "text": "But I think just in terms of if we zoom out for a second about American policy choices and so on, the powers that be didn't trust us to know what he was really about."}, {"time": 2704, "text": "I put it that way."}, {"time": 2705, "text": "And I don't say that in a conspiratorial sense."}, {"time": 2706, "text": "I just think that it was a taboo."}, {"time": 2711, "text": "I think people, there was a kind of consensus that trust us, we know how to fight Al Qaeda and you don't need to know what they're about because they're crazy."}, {"time": 2722, "text": "They're fanatics, they're fundamentalists."}, {"time": 2724, "text": "They hate us, remember that language, us versus them."}, {"time": 2728, "text": "But if you read Bin Laden, that's when it gets messy."}, {"time": 2730, "text": "That's where the Bin Laden's argumentation is not fundamentally about Islam."}, {"time": 2737, "text": "And if you were sitting here with an Islamic scholar, he would say, depending on which Islamic scholar, they would tend to go through and dissect and negate 99% of the arguments that Bin Laden claimed was in Islam, right?"}, {"time": 2751, "text": "But what strikes me as an historian who's again, looking at this adjacently, if you read Bin Laden, I mean, the arguments that he make are, first of all, they're sophisticated."}, {"time": 2761, "text": "They reflect a mind that is about geopolitics."}, {"time": 2767, "text": "He uses terms like imperialism."}, {"time": 2769, "text": "He knows something about world history."}, {"time": 2772, "text": "He knows something about geography."}, {"time": 2774, "text": "So imperialism is the enemy for him or what's the nature of the enemy?"}, {"time": 2777, "text": "It's an amalgam and like a good politician, which is what I would call him, he is adept at speaking in different ways to different audiences."}, {"time": 2788, "text": "So if you look at the context in which he speaks, if you look at messages to the world, if you look at his writings and you can zoom out now and we now have compendia of the writings of Al Qaeda more broadly, you can purchase these, they're basically primary source collections."}, {"time": 2805, "text": "We now have that for the Taliban."}, {"time": 2807, "text": "I mean, what's fascinating about, I think if you'd like this culture, acknowledging it's very diverse internally is that these people are representatives of political movements who seek followers."}, {"time": 2821, "text": "They speak, they often are very, I'd say skilled at visual imagery."}, {"time": 2828, "text": "And especially now, I mean, what's fascinating is that, I mean, the Taliban used to shoot televisions."}, {"time": 2832, "text": "They used to blow up VCR, videotapes."}, {"time": 2839, "text": "They used to string audio and video cassettes from trees and kind of ceremonial hangings, right?"}, {"time": 2845, "text": "That we're killing this nefarious, infidel technology that is doing the work of Satan."}, {"time": 2852, "text": "And yet today, and plus, I mean, one of the keys to the Taliban success is that they got really good at using media."}, {"time": 2858, "text": "I mean, brilliant at using the written word, the spoken word, music, actually."}, {"time": 2865, "text": "And Hollywood, Hollywood is the gold standard."}, {"time": 2868, "text": "And these guys have studied how to create drama, how to speak to modern users."}, {"time": 2873, "text": "I mean, Islamic State did this."}, {"time": 2875, "text": "I mean, the role of media, new media."}, {"time": 2877, "text": "I mean, I follow and I am followed by senior Taliban leaders, which is bizarre on Twitter."}, {"time": 2886, "text": "On Twitter?"}, {"time": 2887, "text": "I don't know why they care about me."}, {"time": 2888, "text": "I'm nothing."}, {"time": 2890, "text": "They follow you on Twitter."}, {"time": 2893, "text": "This is no joke."}, {"time": 2895, "text": "So they're part of our modern world and it's how they talk and it's how they recruit."}, {"time": 2898, "text": "And this is part of the, this is why they are."}, {"time": 2900, "text": "So Ben Laden, if you read Ben Laden, he speaks multiple languages, I would say."}, {"time": 2904, "text": "It's environmentalism."}, {"time": 2908, "text": "The West is bad because we destroyed the planet."}, {"time": 2911, "text": "The West is bad because we abuse women."}, {"time": 2914, "text": "So in class, especially female students are very surprised to learn and actually say this feminist argument is not, we start with, this is a murder."}, {"time": 2927, "text": "This is a person who has taken human life, innocent life over and over again."}, {"time": 2931, "text": "And he is aspirationally genocidal, but let's try to understand what he's about."}, {"time": 2937, "text": "So we walk through the texts, read them and people are shocked to learn that it's not just about quotations in the Quran strung together in some irrational fashion."}, {"time": 2948, "text": "He knows, I mean, at the core, I'd say is the problem of human suffering."}, {"time": 2952, "text": "And he has a geography of that, that is mostly Muslim, but he talked about the suffering of Kashmir, right?"}, {"time": 2957, "text": "So if you have a student in your class, who's from South Asia, who knows about Kashmir, he or she will say, that's not entirely inaccurate."}, {"time": 2966, "text": "The Indian state commits atrocities in Kashmir."}, {"time": 2971, "text": "Pakistan is doing that too."}, {"time": 2973, "text": "Palestine is an issue, right?"}, {"time": 2975, "text": "So you have in the American university setting, people across the spectrum who get that, Palestinians have had a raw deal."}, {"time": 2983, "text": "And so it's a, victimhood is central and it's Muslim victimhood, which is primary, but as a number of scholars have written, and I definitely think this is a framework for what this is useful."}, {"time": 2996, "text": "I mean, in this kind of vocabulary, in this framing, this narrative, today, in today's world, if we think of today's world being post Cold War, 91 to the present, looking at the series of Gulf Wars and seeing the visuals of that, I think that the American public has been shielded from some of this, but if you look at just the carnage of the Iraqi army that George H.W."}, {"time": 3020, "text": "Bush produced, right?"}, {"time": 3024, "text": "Or you think of the images of the suffering of Iraqi children under George H.W."}, {"time": 3026, "text": "Bush's sanctions, US British airstrikes, then you have Madeleine Albright answer a question on 16 Minutes saying, do you think the deaths of half a million Iraqi kids is worth it?"}, {"time": 3041, "text": "Is that justified to contain Saddam Hussein?"}, {"time": 3044, "text": "And she says on camera, yes, it's worth it to me."}, {"time": 3047, "text": "If you put that all together, I mean, American kids, and of course the American public, they're not always aware of those facts of global history, but these guys are, and they very capably use these images, use these tropes, and use facts."}, {"time": 3063, "text": "I mean, some of these things are not deniable."}, {"time": 3097, "text": "And the idea is that in killing others, you are making them feel how you feel, because they won't listen to your arguments reasonably, because they won't recognize Palestinian suffering, Bosnian suffering, right?"}, {"time": 3114, "text": "Chechen suffering."}, {"time": 3115, "text": "You go across the planet, right?"}, {"time": 3117, "text": "Because they won't recognize our suffering, we're gonna speak to you in the only language that you understand, and that's violence."}, {"time": 3124, "text": "And look at the violence of the post 1991 world, right?"}, {"time": 3128, "text": "In which American air power really becomes a global, you know, kind of fact in the lives of so many people."}, {"time": 3136, "text": "And then the big mistake after 9 11 among many, I mean, fundamentally was taking the war on terror to some 30 or 40 countries, right?"}, {"time": 3145, "text": "So that you have more and more of the globe feel like they're under attack, right?"}, {"time": 3150, "text": "And the logic is essentially, it's really bin Laden, it's not we're going to convert you and turn you into Muslims and that's why we're doing this."}, {"time": 3158, "text": "That appears, that claim does appear at times."}, {"time": 3162, "text": "But if you look at any given bin Laden text, I mean, there are 40 claims in each text."}, {"time": 3167, "text": "I mean, it's kind of, it's dizzying, but he's a modern politician, he knows the language of social equality, you know, there's a class dimension to it, there is an environmental dimension to it, there's a gender dimension to it."}, {"time": 3180, "text": "And yes, there are chronic quotes sprinkled in."}, {"time": 3184, "text": "And when he wants to speak that language, he knew that, you know, he's not a scholar."}, {"time": 3189, "text": "So he would often get a few recognized scholars to sign on."}, {"time": 3193, "text": "So some of his decorations of Jihad had his signature kind of sprinkled in with like a dozen other signatures from people who are somewhat known or at least with titles, right?"}, {"time": 3204, "text": "So as a kind of intellectual exercise, it's fascinating to see that he is throwing everything at the wall in one level."}, {"time": 3214, "text": "That's one way to see that it's a, these are kind of testaments toward recruitment of people who, yes, they're angry, yes, they're unhappy."}, {"time": 3223, "text": "And this is what, you know, I think for a broader public, it's hard to get, you're like, well, bin Laden didn't suffer, he wasn't poor."}, {"time": 3231, "text": "Like, yeah, I mean, Lenin, Pol Pot, I mean."}, {"time": 3235, "text": "They're speaking to, they're empathetic to the suffering, the landscape, the full landscape of suffering."}, {"time": 3239, "text": "It's interesting to think about suffering, you know, America, the American public, American politicians and leaders, when they see what is good and evil, they're often not empathetic to the suffering of others."}, {"time": 3256, "text": "And what you're saying is bin Laden perhaps accurately could speak to the ignorance of America, maybe the Soviet Union, to the suffering of their people."}, {"time": 3269, "text": "And I mean, if you look at the speeches and the ideas that are public of Hitler in the 1930s, he spoke quite accurately to the injustice and maybe the suffering of the German people."}, {"time": 3286, "text": "I mean, charismatic politicians are good at telling accurate stories."}, {"time": 3290, "text": "It's not all fabricated, but they emphasize certain aspects."}, {"time": 3295, "text": "And then the problem part is the actions you should take based on that."}, {"time": 3301, "text": "So the narratives and the stories may be grounded in historical accuracy."}, {"time": 3306, "text": "The actions then cross the line, the ethical line."}, {"time": 3311, "text": "I found that too, I mean, it's a, again, if you pick up just one of these texts, I mean, it's a kaleidoscope."}, {"time": 3315, "text": "So the Hitler analogy is interesting because it's Hitler spoke to, he could speak to things like inflation, right?"}, {"time": 3323, "text": "Which really existed."}, {"time": 3325, "text": "But he also appealed to the irrational emotions of Germans."}, {"time": 3329, "text": "He sought out scapegoats, Jews, Roma, disabled people, homosexuals and so on, right?"}, {"time": 3338, "text": "That's also there in bin Laden too."}, {"time": 3340, "text": "I mean, the idea of an anti semitism, the constant flagging of Zionists and crusaders, it's a kind of shotgun approach to a search for followers."}, {"time": 3350, "text": "But I also hasten to add that it's, for all of the things that we could take off saying, well, yes, Kashmiris have suffered, Chechens have suffered and so on."}, {"time": 3361, "text": "Bin Ladenism never became a mass movement."}, {"time": 3364, "text": "I mean, it never really, I think the, I mean, this is the encouraging thing, right?"}, {"time": 3369, "text": "About ideology."}, {"time": 3371, "text": "I mean, I think the blood on his hands always limited his appeal among Muslims and others."}, {"time": 3379, "text": "But Bin Laden did have, I mean, he had a, there's a great book by a great scholar at UC San Diego, Jeremy Prestholt, who read a great book about global icons in which he has Bin Laden, he has Bob Marley, he has Tupac, you know, he asked why, you know, he's doing research in East Africa, why did he see young kids wearing Bin Laden shirts?"}, {"time": 3406, "text": "They're also wearing like Tupac shirts."}, {"time": 3408, "text": "They're wearing Bob Marley shirts."}, {"time": 3410, "text": "And it's a way of looking at a kind of partial embrace of some aspects of the rebelliousness of some of these figures, some of the time, by some people under certain conditions."}, {"time": 3425, "text": "Well, the terrifying thing to me, so yeah, there is a longing in the human heart to belong to a group and a charismatic leader somehow, especially when you're young, just a catalyst for all of that."}, {"time": 3438, "text": "I tend to think that perhaps it's actually hard to be Hitler, so a leader so charismatic that he can rally a nation to war."}, {"time": 3449, "text": "And Bin Laden, perhaps we're lucky, was not sufficiently charismatic."}, {"time": 3455, "text": "I feel like if his writing was better, if his speeches were better, if his ideas were stronger, better, it's like more viral, and then there would be more people, kind of young people uniting around him."}, {"time": 3472, "text": "So in some sense, it's almost like accidents of history of just how much charisma, how much charisma a particular evil person has, a person like Bin Laden."}, {"time": 3483, "text": "I think it's fair, evil works, I think."}, {"time": 3485, "text": "So you think Bin Laden is evil?"}, {"time": 3488, "text": "I mean, he was a mass murderer."}, {"time": 3491, "text": "I'm just saying that his ideas were, they're more complex than we've tended to acknowledge."}, {"time": 3497, "text": "They have a wider potential resonance than we would acknowledge."}, {"time": 3503, "text": "I mean, and also, I guess what I'm, just one fundamental point is that thinking about the complexity of Bin Laden is also a way of removing him from Islam."}, {"time": 3515, "text": "He is not an Islamic thinker."}, {"time": 3516, "text": "He is a cosmopolitan thinker who plays in all kinds of modern ideologies, which have proven to mobilize people in the past, right?"}, {"time": 3525, "text": "So antisemitism, populism, environmentalism, and the urging to do something about humanity, do something about suffering."}, {"time": 3537, "text": "That's why I think the actual, you asked about what motivates people to do this kind of stuff."}, {"time": 3541, "text": "I think that's why if one goes below the level of leadership, and this is being reported, if you look at the trial ongoing now in Paris of the Bataclan murders, I think, the court allowed some discussion of the backgrounds of the accused, and they come from different backgrounds, but if there's any common bond, it's kind of that they had some background in petty crime."}, {"time": 3566, "text": "Famously, in the 7.7 bombings in London, the Metropolitan Police, UK authorities looked at all those guys, and what people want is this idea that they must be very pious."}, {"time": 3579, "text": "They must be super Islamic to do this kind of stuff."}, {"time": 3582, "text": "They must be fanatical true believers, but what they found with those guys was that some were nominally Muslim, some went to mosques, some didn't."}, {"time": 3593, "text": "Some were single, young guys with criminal backgrounds."}, {"time": 3597, "text": "Some were like, sorry, they were kind of misfits who never succeeded in anything."}, {"time": 3604, "text": "But others had at least one thing, had a wife and family who he widowed and orphaned."}, {"time": 3610, "text": "And so there's no, I mean, for policing, I mean, if you're looking at it through that lens, there is no kind of typology that will predict who will become violent."}, {"time": 3620, "text": "And that's why I think we have to move beyond thinking about religious augmentation narrowly or by itself and think about things like geopolitics, think about how people respond to inequality, the existential threat of climate crisis, of a whole host of matters, and think about this is a mode of political contestation."}, {"time": 3642, "text": "I mean, it's a violent one, it's one I condemn."}, {"time": 3643, "text": "It is evil, right?"}, {"time": 3645, "text": "But these are people that are trying to be political."}, {"time": 3647, "text": "They're trying to change things in some way."}, {"time": 3649, "text": "It's not narrowly about like, I don't know, impose Sharia law on you."}, {"time": 3654, "text": "You must wear a veil."}, {"time": 3655, "text": "You must eat this kind of food."}, {"time": 3657, "text": "It's not that parochial."}, {"time": 3702, "text": "I mean, it invites the idea that someone's working, and maybe it's the basis for a lot of QAnon or other conspiracy today, that someone's working behind the scenes and things are gonna go the right way."}, {"time": 3713, "text": "You can't see it."}, {"time": 3714, "text": "That's almost preferable because you can kind of feel it."}, {"time": 3717, "text": "And so not having someone out front can be maybe more effective than having someone out in front constantly."}, {"time": 3724, "text": "Then the whole... Maybe, maybe."}, {"time": 3726, "text": "And then the whole Bin Laden, you know, Milo Omar thing, like you can't see me, or if you look at Bin Laden's photographs and his video stuff, I mean, he's coy."}, {"time": 3736, "text": "Some observers have noted that he's kind of effeminate."}, {"time": 3738, "text": "He doesn't strike this kind of masculine, he's not a Mussolini, he's not a Hitler, macho, upstanding, thumping my chest."}, {"time": 3746, "text": "He's not doing the theatrical chin, you know?"}, {"time": 3749, "text": "The theater people tell us he's so aggressive, you know?"}, {"time": 3752, "text": "Oh, a chin?"}, {"time": 3753, "text": "What, bringing your chin up?"}, {"time": 3755, "text": "I saw a great BBC theater person."}, {"time": 3758, "text": "It was kind of a..."}, {"time": 3759, "text": "It was a makeover show about how to become a better... A dictator?"}, {"time": 3763, "text": "Just a powerful, yeah, leader, authoritarian figure."}, {"time": 3767, "text": "No, just how to get ahead in life."}, {"time": 3769, "text": "And then... Oh, okay, cool."}, {"time": 3771, "text": "And just about acting, how you can act differently, right?"}, {"time": 3773, "text": "So it was a BBC thing."}, {"time": 3776, "text": "And this woman claimed that, you know, sticking your chin out, like a wrestler does, right, is the most, like, male to male."}, {"time": 3783, "text": "I love this kind of hilarious analysis that people have about power."}, {"time": 3788, "text": "But watch the chin, watch the chin."}, {"time": 3789, "text": "It's the same as analyzing, like, in wrestling styles that win or fighting or so on."}, {"time": 3796, "text": "There's so many ways to do it."}, {"time": 3797, "text": "Well, the chin, I mean, the chin is a... Could be interesting verbal gesture."}, {"time": 3801, "text": "And I've watched enough Mussolini footage from my classes to try to pick the right moment."}, {"time": 3807, "text": "And the chin is... Mussolini is all about the chin, so... And I have watched human beings and human nature enough to know that there's more to a man, a powerful man, than a chin."}, {"time": 3818, "text": "I'm saying it's an act of aggression."}, {"time": 3820, "text": "I'm not saying it's..."}, {"time": 3821, "text": "It's one of the many tools in the toolkit."}, {"time": 3824, "text": "So she definitely..."}, {"time": 3825, "text": "It's not all about the chin, but it's a..."}, {"time": 3827, "text": "But that's what I'm trying to tell you about Ben Laden."}, {"time": 3829, "text": "I don't think he was deliberate enough with the way he presents himself."}, {"time": 3835, "text": "What I'm saying about Ben Laden that makes him different from these other characters is that because he played at being the scholar, he played at being a figure of modesty and humility."}, {"time": 3845, "text": "And that meant that he was often... Again, if you watch his visuals, I mean, yes, there's one video of him firing a gun, but if you watch how he moved, how he wouldn't look at people directly, how his face was almost..."}, {"time": 3857, "text": "I mean, he appears to be incredibly shy."}, {"time": 3860, "text": "He's not spoken."}, {"time": 3862, "text": "His voice was low."}, {"time": 3863, "text": "He attempted to be poetic, right?"}, {"time": 3865, "text": "So it wasn't a warrior kind of image that he tried to project of like a tough guy."}, {"time": 3870, "text": "It was, I'm demure, I'm humble."}, {"time": 3874, "text": "I'm offering you this message."}, {"time": 3877, "text": "And the appeal that he was going for was to see... To project himself as a scholar, his knowledge and humility, the whole package, carried with it an authenticity and a valor that would animate, inspire people to commit acts of violence, right?"}, {"time": 3896, "text": "So there's a different kind of logic of like go and kill."}, {"time": 3899, "text": "So he presented himself in contrast to the imperialist kind of macho power, superpowers."}, {"time": 3909, "text": "So that's just yet another way of... And you have to have facial hair or hair of different kinds that's recognized."}, {"time": 3916, "text": "We had a very recognizable look too, or at least later in life."}, {"time": 3920, "text": "So... Yeah, no, he tried to look the part."}, {"time": 3923, "text": "But I'm saying we're fortunate that whatever calculation that he was making, he was not more effective."}, {"time": 3933, "text": "I mean, the world is full of terrorist organizations and we're fortunate to the degree any one of them does not have an incredibly charismatic leader that attains the kind of power that's very difficult to manage at the geopolitical level."}, {"time": 3952, "text": "Yeah, and we credit the publics, who don't buy into that, right?"}, {"time": 3957, "text": "Who see through this."}, {"time": 3957, "text": "We credit the critics, you know?"}, {"time": 3961, "text": "Early on, Kermadev 9.11 itself, one of the problems was that US government officials kept kind of leaning on Muslims to condemn this as if all Muslims shared some collective responsibility or culpability."}, {"time": 3977, "text": "And in fact, dozens of scholars and organizations, hundreds condemned this, but their condemnations never quite made it out."}, {"time": 3987, "text": "But it created a tension where, you know, if you wore a veil, you must've been one of them and you must be on Team Bin Laden."}, {"time": 3993, "text": "And so a lot of the, you know, I think a lot of the popular violence and discrimination and profiling came out of that urge to see a oneness, which, you know, Bin Laden projected, right?"}, {"time": 4005, "text": "He wanted to say, we are one community."}, {"time": 4007, "text": "You know, if you are a Muslim, you must be with me, right?"}, {"time": 4010, "text": "But I think that's where the diversity of Muslim communities became important because outside of small pockets, I mean, they didn't accept his leadership, right?"}, {"time": 4020, "text": "People wore T shirts in some countries."}, {"time": 4021, "text": "I mean, non Muslims wore T shirts because he was like, he stuck it to the Americans."}, {"time": 4023, "text": "So in Latin America, people are like, yeah, that was sad, but, you know, finally, I mean, there was a kind of schadenfreude in that moment internationally."}, {"time": 4031, "text": "It's like Che Guevara or somebody like that."}, {"time": 4033, "text": "Yeah, Che's the other character in Prasad's book."}, {"time": 4036, "text": "Yeah, yeah, that's right, that's right."}, {"time": 4037, "text": "It's just a symbol."}, {"time": 4038, "text": "It's not exactly what he believed or the cruelty of actions he took."}, {"time": 4043, "text": "It's more like he stood for an idea of revolution versus authority."}, {"time": 4049, "text": "And that's a great way to understand Bin Ladenism and the whole phenomenon, but I think looking at the big picture, it's also, you wonder, will that ever end, right?"}, {"time": 4060, "text": "I mean, is that, I mean, that's the risk of being a kind of hyper power like the U.S. where you, in assisting on a kind of unipolar world in 2001, 2002, 2003, I think that created an almost irresistible target, you know, wherever the U.S. wanted to exert itself militarily."}, {"time": 4080, "text": "Before we go to the history of Afghanistan, the people, and I just want to talk to you about just some fascinating aspect of the culture."}, {"time": 4090, "text": "Let's go to the end."}, {"time": 4093, "text": "Withdrawal of U.S. troops from Afghanistan."}, {"time": 4098, "text": "What are your thoughts on how that was executed?"}, {"time": 4101, "text": "How could it have been done better?"}, {"time": 4104, "text": "Yeah, an important question."}, {"time": 4106, "text": "I mean, I would preface all this by saying, you know, as I noted, I think the war was a mistake."}, {"time": 4111, "text": "I had hoped the war would end sooner."}, {"time": 4116, "text": "I think there were different exit routes all along the way."}, {"time": 4119, "text": "Again, I think there were lots of policy choices in September and October when the war began."}, {"time": 4126, "text": "There were choices in December 2001."}, {"time": 4130, "text": "So we could look at almost every six month stopping point and say, we could have done differently."}, {"time": 4137, "text": "As it turns out though, I mean, the way it played out, you know, it's been catastrophic."}, {"time": 4142, "text": "And I think the Biden administration has remained unaccountable for the scale of the strategic and humanitarian and ethical failure that they're responsible for."}, {"time": 4155, "text": "Well, okay, let's lay out the full, there's George W. Bush, there's Barack Obama, there's Donald Trump, there's Biden."}, {"time": 4167, "text": "So they're all driving this van and there's these exits and they keep not taking the exits and they're running out of gas."}, {"time": 4176, "text": "I do this all the time thinking, where am I gonna pull off?"}, {"time": 4178, "text": "I'll go till it's empty."}, {"time": 4183, "text": "And what exactly, how much suffering have all the decisions along the way caused?"}, {"time": 4192, "text": "What are the longterm consequences?"}, {"time": 4194, "text": "What are the biggest things that concern you about the decisions we've made in both invading Afghanistan and staying in Afghanistan as long as we have?"}, {"time": 4203, "text": "I mean, if we start at the end, as you proposed, you know, the horrific scenes of the airport, you know, that was just one dimension."}, {"time": 4212, "text": "I think in the weeks to come, I mean, we're gonna see Afghanistan implode."}, {"time": 4219, "text": "There are lots of signs that malnutrition, hunger, starvation are going to claim tens of thousands, maybe hundreds of thousands of lives this winter."}, {"time": 4229, "text": "And I think there is really nothing, there's no framework in place to forestall that."}, {"time": 4238, "text": "What is the government, what is currently the system there?"}, {"time": 4242, "text": "What's the role of the Taliban?"}, {"time": 4244, "text": "So there could be tens of thousands, hundreds of thousands that starve, either just almost to famine or starve to death."}, {"time": 4254, "text": "So this is economic implosion, this is political implosion."}, {"time": 4258, "text": "What's the system there like and what could be the one, you know, some inkling of hope?"}, {"time": 4266, "text": "The Taliban sit in control, that's unique."}, {"time": 4269, "text": "When they were in power in the 1990s from 1996, 2001, they controlled some 85 to 90% of the country."}, {"time": 4278, "text": "Now they own it all, but they have no budget."}, {"time": 4282, "text": "The Afghan banking system is frozen."}, {"time": 4288, "text": "So the financial system is a mess."}, {"time": 4290, "text": "And it's frozen by the U.S. because the U.S. is trying to use that lever to exert pressure on the Taliban."}, {"time": 4296, "text": "And so the ethical quandaries are of course legion, right?"}, {"time": 4300, "text": "Do you release that money to allow the Taliban to shore up their rule, right?"}, {"time": 4306, "text": "The Biden administration has said no, but the banks aren't working."}, {"time": 4312, "text": "If you're in California, you wanna send $100 to your cousin so she can buy bread, you can't do that now."}, {"time": 4319, "text": "It's almost impossible."}, {"time": 4321, "text": "There are some informal networks, they're removing some stuff, but there are bread lines."}, {"time": 4326, "text": "The Taliban government is incapable, fundamentally just of ruling."}, {"time": 4330, "text": "I mean, they can discipline people on the street, they can force people into the mosque, they can shoot people, they can beat protesters, they can put out a newspaper, they can have, they're great at diplomacy it turns out, they can't rule this country."}, {"time": 4344, "text": "So essentially the hospitals and the kind of healthcare infrastructure is being managed by NGOs that are international."}, {"time": 4358, "text": "But most people had to leave and the Taliban have impeded some of that work."}, {"time": 4364, "text": "They've told adult women essentially to stay home, right?"}, {"time": 4367, "text": "So a big part of the workforce isn't there."}, {"time": 4371, "text": "So the supply chain is kind of crawling to a halt."}, {"time": 4377, "text": "Trade with Pakistan and its neighbors, I mean, it's kind of a transit trade economy."}, {"time": 4383, "text": "It exports fruits."}, {"time": 4385, "text": "Pakistan has been closing the border because they're anxious about refugees."}, {"time": 4389, "text": "They want to exert pressure on the international community to recognize the Taliban because the Pakistan want the Taliban to succeed in power because they see that in Pakistan's national interest, especially through the lens of its rivalry with India."}, {"time": 4404, "text": "So the Pakistani security institutions are playing a double game."}, {"time": 4409, "text": "Essentially Afghan people are being held hostage."}, {"time": 4411, "text": "And so the Taliban are also saying, if you don't recognize us, you're gonna let tens of millions of Afghans starve."}, {"time": 4419, "text": "So to which degree is Taliban, like who are the Taliban?"}, {"time": 4424, "text": "What do they stand for?"}, {"time": 4425, "text": "What do they want?"}, {"time": 4427, "text": "Obviously year by year, this changes."}, {"time": 4429, "text": "So what is the nature of this organization?"}, {"time": 4433, "text": "Can they be a legitimate, peaceful, kind, respectful government sort of holder of power or are they fundamentally not capable of doing so?"}, {"time": 4448, "text": "I mean, the briefest answer would be that they are a clerical slash military organization."}, {"time": 4457, "text": "They have, this is kind of a imperfect metaphor, but years ago, a German scholar used the term caravan to describe them."}, {"time": 4469, "text": "And that has some attractive elements because different people have joined the Taliban for different purposes at different times, but today, and people tell us, scholars who know more about the women than I have said, listen, the Taliban is this kind of hodgepodge of different actors and people and competing interests."}, {"time": 4488, "text": "And I think, so we have a lot of scholars who said, listen, it's polycentric."}, {"time": 4494, "text": "It's got people in this city and that city and so on."}, {"time": 4497, "text": "I think actually, I was always very skeptical."}, {"time": 4500, "text": "How do they know this?"}, {"time": 4500, "text": "I mean, this is an organization that doesn't want you to know where that money comes from and so on."}, {"time": 4506, "text": "But I would say now that we have a clear picture of what has happened, I'd say they are a astoundingly well organized clerical military organization that has a very cohesive and enduring ideology, which is quite idiosyncratic."}, {"time": 4526, "text": "If we zoom out and continue the conversation we're having about Islam and how we think about radicalism and who's drawn to what, people throw different terms around to describe the Taliban."}, {"time": 4538, "text": "Some use a term that links it to a kind of school of thought born in the 19th century in India, the Doabandi school."}, {"time": 4547, "text": "But if you look at their teachings, it's very clear now I think that these labels, it's like saying, you're an MIT guy."}, {"time": 4554, "text": "Well, what does that mean?"}, {"time": 4554, "text": "I mean, MIT is home to dozens of different potentially kinds of intellectual orientations, right?"}, {"time": 4562, "text": "I mean, attaching the name of the school doesn't quite capture, I mean, university."}, {"time": 4568, "text": "I mean, actually MIT is interesting because I would say MIT is different than Stanford, for example."}, {"time": 4573, "text": "I think MIT has a more kind of narrow."}, {"time": 4576, "text": "Yeah, I hear you."}, {"time": 4578, "text": "Bad analogy on my part, maybe."}, {"time": 4579, "text": "Well, no, it's interesting because I would argue that there's some aspect of a brand like Taliban or MIT, no relation, that has a kind of interact, like the brand results in the behavior of the, like enforces a kind of behavior on the people and the people feed the brand and like there's a loop."}, {"time": 4601, "text": "I think Stanford is a good example of something that's more distributed."}, {"time": 4605, "text": "There's sufficient amount of diversity in like all kinds of like centers and all that kind of stuff that the brand doesn't become one thing."}, {"time": 4615, "text": "MIT is so engineering."}, {"time": 4617, "text": "It's so different than that."}, {"time": 4619, "text": "Okay, scratch MIT, scratch Stanford too because I think Stanford's more like MIT than you might imagine, but isn't Taliban, isn't it pretty, I don't think there's a diversity."}, {"time": 4630, "text": "So yeah, sorry, so just to rephrase."}, {"time": 4633, "text": "So people say, oh, the Deobandi school."}, {"time": 4635, "text": "I'm like, what is that?"}, {"time": 4636, "text": "I mean, but the Taliban are, they're an ethnic movement."}, {"time": 4640, "text": "They represent a vision of Pashtun power, right?"}, {"time": 4646, "text": "Pashtuns are people who are quite internally diverse, who actually speak multiple dialects of Pashto, who reside across the frontier of Pakistan and Afghanistan."}, {"time": 4660, "text": "There are Pashtuns who live all over the planet, right?"}, {"time": 4662, "text": "There's a community in Moscow, California, everywhere, right, so it's a global diaspora of sorts."}, {"time": 4668, "text": "Pashtuns have a kind of genealogical imagination so that lots of Pashtuns can tell you the names of their grandparents, great grandparents and so on, and that's kind of a, there's a sense of pride in that."}, {"time": 4678, "text": "Pashto language is a kind of core element of that identity, but it's not universal."}, {"time": 4685, "text": "So for example, you can meet people who say, I am Pashtun, but I don't know Pashto."}, {"time": 4690, "text": "So as you claw away at this idea, it's amorphous."}, {"time": 4694, "text": "It also means different things, different people at different times."}, {"time": 4697, "text": "So saying the Taliban are Pashtun requires lots of qualifiers because lots of Pashtuns will say, no, no, I have nothing to the Taliban."}, {"time": 4708, "text": "So the Taliban tried to mobilize other Pashtuns with limited success, but their core membership is almost exclusively Pashtun."}, {"time": 4717, "text": "And they say, no, no, we represent Afghans."}, {"time": 4720, "text": "We represent pious Muslims."}, {"time": 4722, "text": "And so in recent two, three years, they've gone further to say, no, we have other groups."}, {"time": 4728, "text": "We have Uzbeks, we have Tajiks, we have Hazaras."}, {"time": 4732, "text": "And in the North of Afghanistan, in recent years, they did do a bit better at drawing in people who were very disaffected because of the government."}, {"time": 4739, "text": "And they were able to diversify their ranks somewhat."}, {"time": 4742, "text": "But if you want to say August 15 and who they've appointed, what language they've used, how they've presented themselves, it's clear that they are Pashtun, they are male, and they are extremely ideologically cohesive and disciplined, I'd say, right?"}, {"time": 4762, "text": "So I think that a lot of the polycentrism, blah, blah, some of that stuff was a way to fight a war."}, {"time": 4768, "text": "They are fundamentally a guerrilla movement."}, {"time": 4773, "text": "They see themselves as kind of pious Robin Hoods."}, {"time": 4777, "text": "The rhetoric is very much about taking from the rich, taking from the privileged, giving to the poor, being on the side of the underdog, fighting against evil."}, {"time": 4787, "text": "And so, I mean, their bag, if you like, their thing, their central theme, their brand is about public morality."}, {"time": 4793, "text": "And so their origin story, going back to 1994, is that they interceded, they broke up a gang of criminals who were trying to rape people."}, {"time": 4803, "text": "And so there's a very interesting emphasis on sexuality and on public morality and really being the core of we're gonna restore order and public morality."}, {"time": 4816, "text": "And how that translates into governance is something they've never sorted out."}, {"time": 4819, "text": "I mean, how do you run a banking system if your intellectual priorities are really about the length of a beard?"}, {"time": 4825, "text": "And then their path to power in a kind of abstract sense, I mean, a lot of that was very much driven by, if you like, propagating the promise of martyrdom."}, {"time": 4837, "text": "And that sounds, I don't mean to say that in a way that, to make it sound ridiculous, to make it sound like it's a moral judgment, it's simply, I think, a fact, it's a fact of their appeal that they promised young men who have known nothing else but studying in certain schools, if at all, but they've known fighting and they've known victimization."}, {"time": 4859, "text": "And this isn't, I'm not asking for sympathy for them, but I think the reality is that a lot of the, we know about the kind of foot soldiers is that they lost families in bombings, in airstrikes, in night raids."}, {"time": 4875, "text": "I mean, orphans have always been a stream, living in all male society, not knowing girls, not knowing women, hearing things from outside about places like Kabul."}, {"time": 4887, "text": "And so there's always been this kind of urban rural dimension, it's not just that, but I think there's a whole imagination that being Taliban captures."}, {"time": 4899, "text": "And the whole margin of thing is really it's, you know, I think to any religious person, I mean, it's not a bizarre idea."}, {"time": 4906, "text": "I mean, it animates, I mean, so many global traditions, you know, but I think the, but you try to tell like an army colonel, if you were to have a conversation with, you know, a US Marine about this, I mean, some would get it from their own religious backgrounds, but I think it's an alien idea, but I think it's essential to kind of stretch out my imagination to understand that's attractive."}, {"time": 4928, "text": "And now one of the dilemmas going forward is that they've got to pivot from martyrdom."}, {"time": 4934, "text": "And some have been, some have told foreign journalists, I mean, it's good that we're in charge now, we're gonna build a proper state, but it's kind of boring."}, {"time": 4944, "text": "I wanna keep fighting, maybe I'll do that in Pakistan."}, {"time": 4946, "text": "Yeah, I mean, it's nice that they are expressing that thought, some are not even honest sufficiently with themselves to express that kind of thought."}, {"time": 4954, "text": "If you're a fighter, you see that with a bunch of fighters or professional athletes, once they retire, they don't know, it's very, it's boring."}, {"time": 4996, "text": "Yeah, and they've walked into Kabul and other major cities, some of them are young, they didn't know those places, but also the very important obstacle for them is that Afghan society has changed."}, {"time": 5008, "text": "I mean, it's not what, even for the older guys, it's not what they knew in the 1990s."}, {"time": 5014, "text": "Some always had some ambivalence about the capital, but now it's totally different."}, {"time": 5018, "text": "I mean, they've been shocked to see, I think to me, one of the most striking features of the last few weeks has been that women have come out on the streets and have stood in their faces and said, we demand rights, we demand education, we demand employment."}, {"time": 5033, "text": "And these foot soldiers are paralyzed, they're not sure."}, {"time": 5037, "text": "They don't know what to do with women, period."}, {"time": 5040, "text": "And they don't know what to do with being yelled at and having someone stick their fingers in their faces."}, {"time": 5044, "text": "I mean, this is not what they've imagined."}, {"time": 5047, "text": "And so I think, and at this juncture, there are still foreign cameras around."}, {"time": 5052, "text": "So they have committed acts of violence against women, against journalists, they've beaten people, they've disappeared people."}, {"time": 5059, "text": "Even with cameras around, even in this tense period."}, {"time": 5062, "text": "Yeah, but I think that when the cameras retreat and that's not gonna happen, it's gonna get much worse, I think."}, {"time": 5068, "text": "So the challenge now is can the Taliban rule?"}, {"time": 5071, "text": "And then this is where the diplomacy is so important because the Taliban can't rule in isolation and they know that."}, {"time": 5079, "text": "And part of the success is due to the fact that they became very good at talking to other people in the last, I mean, it's been building for the last decade, but I'd say the last five years, they always had Pakistan's backing."}, {"time": 5092, "text": "And so the Taliban are, we noted they're a military force, very effective guerrilla force."}, {"time": 5097, "text": "They beat NATO, I mean, this is, still hasn't sunk in."}, {"time": 5100, "text": "I mean, the fact that they, with light arms, using suicide attacks, using mines, improvised explosive devices, machine guns."}, {"time": 5113, "text": "In some, in recent years, they got sniper rifles and from the summer, they got American equipment on a broad scale, right?"}, {"time": 5122, "text": "They have airplanes, they have a lot that they will be able to use eventually."}, {"time": 5125, "text": "So, but still, basically it's a story of AK47s, some American small arms and mines."}, {"time": 5133, "text": "So it's very Ho Chi Minh, very old school guerrilla fighting, right?"}, {"time": 5138, "text": "And they defeated the most powerful military alliance in world history probably."}, {"time": 5141, "text": "So that has not yet sunk in and what that means for American and global politics."}, {"time": 5147, "text": "And now they're trying to rule, right?"}, {"time": 5149, "text": "They know they need international support and their most consistent backer has been Pakistan who sees them as an extension of Pakistani power."}, {"time": 5161, "text": "And this is very important for a Pakistani elite that of course is looking toward India."}, {"time": 5165, "text": "They wanna have their rear covered, right?"}, {"time": 5168, "text": "They wanna make sure that these Pashtuns don't cause trouble for Pakistan."}, {"time": 5173, "text": "And they like, I mean, for some of the security forces, they like this vision of the Islamic state that the Taliban are building there because those are not so distant from their views of what Pakistan should be."}, {"time": 5184, "text": "But the Taliban have been smart enough to kind of diversify their potential international allies."}, {"time": 5190, "text": "So everyone in the neighborhood has wanted the US to leave, right?"}, {"time": 5194, "text": "If we go back to 2001, there were Iranian and American special forces in the North working together against the Taliban to displace them using Iranian, American, and then Afghan resistance forces against the Taliban."}, {"time": 5208, "text": "And that was a real moment of rapprochement if we go back to the missed exits."}, {"time": 5214, "text": "The relationship with Iran could have been different at that moment, but the US under George W. Bush, you know, devised this axis of evil language, put them together with their enemy, Iraq and the North Korea, all that went south."}, {"time": 5230, "text": "That was the most opportunity."}, {"time": 5232, "text": "But in recent years, the Taliban and Iran have kind of papered over the differences."}, {"time": 5239, "text": "They allowed the Taliban to open small offices on Iranian territory, likely shared some resources, some intelligence, some sophisticated weaponry."}, {"time": 5248, "text": "And then the Taliban went to Moscow."}, {"time": 5250, "text": "And for the Putin administration, you know, they've long been worried that, you know, they see the Taliban as a kind of, you know, disease that will potentially move North, infect Uzbekistan, Tajikistan, Kyrgyzstan, Turkmenistan, Kazakhstan, and maybe creep into Russia's sphere of influence."}, {"time": 5267, "text": "Maybe that's why they have, you know, a bunch of troops sitting in Tajikistan."}, {"time": 5272, "text": "I mean, the one, you know, Ford base that Russia as well has in Central Asia is in Tajikistan."}, {"time": 5278, "text": "And so the Taliban were always, you know, a worrying point, but also useful because they could say, well, you know, in case the Taliban get out of control, we need to be here."}, {"time": 5289, "text": "And so Tajikistan said, okay, you know, you're helping secure us."}, {"time": 5294, "text": "And yes, it impinges upon our sovereignty, but it's okay, you know?"}, {"time": 5298, "text": "So Putin said, you know, let's, you know, give another black eye to the Americans and let's, you know, treat the Taliban as if they're the kind of government in waiting."}, {"time": 5307, "text": "Let's have them come to Moscow multiple times."}, {"time": 5310, "text": "This summer, you know, for the last year or two, they've been talking to China, right?"}, {"time": 5314, "text": "So the photographs of senior Taliban figures going from their office in Qatar, which was a major blow to the U.S. back government, the fact that they were able to open up an office in Qatar that at one point began to fly a flag of the Islamic Emirate of Afghanistan, that basically said, we're a state in the waiting."}, {"time": 5334, "text": "And as the U.S.-backed Afghan government failed and failed and failed at ruling too, right?"}, {"time": 5340, "text": "As they showed how corrupt they were."}, {"time": 5342, "text": "And as they really alienated more and more Afghans by committing acts of violence against them, by stealing from them, by, you know, basically creating a kind of kleptocracy, right?"}, {"time": 5357, "text": "The Taliban said, we are pure, we are not corrupt."}, {"time": 5360, "text": "And look at us, we're winning on the battlefield."}, {"time": 5362, "text": "And internationally, look, we're talking to China."}, {"time": 5365, "text": "We're talking to Putin, we're talking to China."}, {"time": 5367, "text": "We're a legitimate, powerful center of Central Asia."}, {"time": 5371, "text": "And also kind of, you know, hinting that, you know, oh, we have a website."}, {"time": 5374, "text": "I mean, the whole digital angle is amazing because they began to, and this is important, actually."}, {"time": 5379, "text": "They had a website which grew more and more sophisticated."}, {"time": 5383, "text": "Again, after having, you know, shot televisions and these kind of ceremonial killings of these infidel devices, right?"}, {"time": 5389, "text": "They said, we have a government, we have commissions, we have a complaint line."}, {"time": 5395, "text": "They lifted all this technocratic language that you would get from any UN document, you know, about good governance and all the kind of, you know, generic language that the NGO world has produced for us, right, in English."}, {"time": 5406, "text": "They reproduced that in five languages on their Taiwan website."}, {"time": 5410, "text": "And of course, I'm not saying even believe this, but it was like, you know, just put me in coach."}, {"time": 5415, "text": "You know, I know the playbook."}, {"time": 5417, "text": "I know how to run a government."}, {"time": 5418, "text": "And look, we have an agricultural commission."}, {"time": 5420, "text": "We have, you know, a taxation system."}, {"time": 5424, "text": "And again, this idea, and then on the ground, they had their own law courts."}, {"time": 5428, "text": "And they would creep into a district, assassinate some people, the local authority figures, men of influence, talk to local clerics, either get them on board or kill them and say, you know, this state is corrupt, but we're bringing you justice."}, {"time": 5442, "text": "This is our calling card."}, {"time": 5443, "text": "We're bringing public reality and justice."}, {"time": 5445, "text": "And then to a broader world, they said, you know, yeah, things didn't go perfectly, the whole Al Qaeda thing, you know, you know, wish we could have a do over on that."}, {"time": 5456, "text": "We're not gonna let anyone hurt you from our territory."}, {"time": 5458, "text": "We just wanna rule and people like us and look."}, {"time": 5463, "text": "And so if you look at the neighborhood, Iran, even the Central Asian states after a while, recognizing they could make some money."}, {"time": 5469, "text": "I mean, one of the, one thing that Uzbekistan likes about the current arrangement, or they're not, they're not hostile to is that they have all these contracts."}, {"time": 5477, "text": "They can potentially make some money from, you know, the pipeline dream remains alive, running natural gas, oil, to, you know, which is the Indian ocean, to markets, you know, beyond Central Asia."}, {"time": 5491, "text": "It's sitting on a couple of trillion dollars, probably in mineral resources that China would love to have, of course."}, {"time": 5496, "text": "And so people are looking at Afghanistan now, after 20 years saying, you know, under American rule, it was a basket case, right?"}, {"time": 5503, "text": "There was immense human suffering, incredibly violent."}, {"time": 5506, "text": "The world did not start counting civilian casualties in Afghanistan until 2009."}, {"time": 5511, "text": "I mean, think about that."}, {"time": 5511, "text": "The war went on for eight years."}, {"time": 5513, "text": "The Taliban were never really defeated."}, {"time": 5514, "text": "They just went to Pakistan."}, {"time": 5516, "text": "They went to the mountains, they went to the woods."}, {"time": 5519, "text": "And so all of these different American operations, as you noted, under Bush, Obama, Trump, and so on, killed countless civilians."}, {"time": 5529, "text": "The US never accounted for that."}, {"time": 5530, "text": "We never even counted."}, {"time": 5533, "text": "Trump escalated civilian casualties by escalating the air war."}, {"time": 5537, "text": "But a lot of this was like very ugly, on the ground, you know, night raid stuff, where you drop into a Hamlet and massacre people, and then you're not honest about what happened, right?"}, {"time": 5547, "text": "So that dynamic continued to fuel the growth of the Taliban from below."}, {"time": 5552, "text": "So the foot soldiers, they never ran out of foot soldiers."}, {"time": 5555, "text": "I mean, the US and its allies killed tens of thousands, maybe hundreds of thousands of Taliban fighters over the last 20 years."}, {"time": 5562, "text": "But they just sprouted up again."}, {"time": 5564, "text": "And part of that was the kind of solidarity culture, the male bonding of martyrology, of martyrdom, and of revenge, and a sense of the foreign invader."}, {"time": 5576, "text": "And I've heard, I mean, I haven't taught a ton of US military people, but through the Hoover, they put officers in our classes sometimes, and met a few wonderful army and marine officers who I really enjoyed."}, {"time": 5588, "text": "You know, we came from the South like me, always had great rapport with them, and they expressed a range of opinions about this."}, {"time": 5595, "text": "I think that I learned a lot from someone who said, yeah, I mean, I get why they hate us."}, {"time": 5600, "text": "I get why they're still fighting, because last week, we were in the middle of a war, we just killed 14 of their fellow villagers."}, {"time": 5611, "text": "So the officers, the guys on the ground, fighting this war, we're not stupid about that."}, {"time": 5617, "text": "I mean, they got the human dimension of that, and yet no one got off the exit, as you said, people kept driving."}, {"time": 5623, "text": "But going forward now, internationally, it's critical that they have, and they've had meetings."}, {"time": 5630, "text": "I mean, what the Taliban have done since August 15th is a lot of diplomacy."}, {"time": 5634, "text": "They've had meetings, they've had people, they've had Tashkent come, they've had Beijing come, they've had Moscow come."}, {"time": 5640, "text": "I mean, they've had major visits from Islamabad, from security people, from diplomatic circles."}, {"time": 5649, "text": "And they're counting on things being different this time."}, {"time": 5651, "text": "I mean, the first time around, the only people who backed the Taliban by recognition, giving them diplomatic recognition, were the Saudis, Pakistanis, and the UAE."}, {"time": 5660, "text": "And because of Al Qaeda, because of opium, because of some of the human rights stuff, the US pushed everyone to like, let's not recognize the state, even though the US did."}, {"time": 5671, "text": "I mean, Colin Powell famously, summer of 2001, we did give a few grants and aid to the Taliban as kind of like massaging negotiations."}, {"time": 5684, "text": "They kept talking about bin Laden, but they also wanted them to stop opium production."}, {"time": 5689, "text": "I mean, Afghanistan, throughout all this period we've talked about, is the global center of opium production."}, {"time": 5694, "text": "I mean, over the years, more and more of the Afghan economy continued to today is devoted to the opium trade."}, {"time": 5700, "text": "Opium, which is the thing that leads to heroin, some of the painkillers."}, {"time": 5709, "text": "And even if Afghan poppies don't make it to Hoboken, they are not the source of American deaths."}, {"time": 5718, "text": "They are part of a universal market, a global market, which I think any economist would tell you is part of the story of our opium problem."}, {"time": 5729, "text": "Something I read maybe a decade ago now, and I just kind of looked it up again to bring it up to see your opinion on this, is a 2010 report by the International Council on Security and Development that showed that 92% of Afghans in Helmand and Kandahar province know nothing of the 9 11 attacks on US in 2001."}, {"time": 5756, "text": "Is this at all representative of what you know?"}, {"time": 5760, "text": "Is this possible?"}, {"time": 5761, "text": "So basically, put another way, is it possible that a lot of Afghans don't even know the reason why there may be troops or the sort of American provided narrative for why there's troops, American soldiers, and American drones overhead in Afghanistan?"}, {"time": 5786, "text": "I mean, my gut response, not knowing the details of this actual poll is that that's a very unhelpful way to think about how Afghans relate to the world."}, {"time": 5799, "text": "And I think it could be, if you go to my hometown, in North Carolina, if you knock on some doors, you may meet people who don't know all kinds of things."}, {"time": 5810, "text": "I could probably walk around this neighborhood here in California and there'd be all kinds of people who don't know all kinds of things."}, {"time": 5817, "text": "Kyrie Irving apparently thinks the earth is flat."}, {"time": 5821, "text": "I mean, so we could make a lot of certain kinds of ignorance, I think."}, {"time": 5828, "text": "But I think what I would say, and there's also, I mean, a companion point maybe that in thinking about the withdrawal, the collapse, the return of the Taliban, there has been a big conversation about what Afghans think of us really."}, {"time": 5841, "text": "And this famous piece in the New Yorker was about how many people liked the Taliban, that many women interviewed supposedly in this piece, were sympathetic because they had lost family members and all the violence."}, {"time": 5858, "text": "And the idea kind of was that, we haven't thought about that at all."}, {"time": 5862, "text": "When in fact, of course we have and lots of people have, but I think if you're just dropping into the conversation, if you look at like an immediate arc of coverage of Afghanistan and the United States, I mean, the arc went from lots of coverage during, of course, 9.11 and its aftermath, lots of coverage during Obama's surge, and then quickly dropped down the last decade, it's been almost nothing."}, {"time": 5885, "text": "So if you ask the same question about Americans or of Americans, I'm not sure what they would say to you, what percentage would actually know why the US is in X, Y, or Z either, right?"}, {"time": 5894, "text": "But on the Afghan side, just to return to that for a moment, I think that we can fetishize these provinces."}, {"time": 5899, "text": "They are kind of a place where Taliban support has been greatest."}, {"time": 5904, "text": "Also where there's been the most violence, where the Americans have been most committed to trying to root out the Taliban movement."}, {"time": 5910, "text": "Where exactly in the South."}, {"time": 5912, "text": "What are the other parts in the South of Afghanistan?"}, {"time": 5914, "text": "Yeah, it's mostly Pashtun, not exclusively, but mostly Pashtun, mostly rural."}, {"time": 5919, "text": "What is Pashtun?"}, {"time": 5920, "text": "That's the other group that the Taliban claim to represent, right?"}, {"time": 5924, "text": "So they are this group."}, {"time": 5925, "text": "What other groups are there?"}, {"time": 5926, "text": "Okay, sorry, yeah, sorry."}, {"time": 5928, "text": "So in cities, you'll find everything, right?"}, {"time": 5931, "text": "That is in Afghanistan."}, {"time": 5931, "text": "You'll find Uzbeks, Tajiks, Hazaras."}, {"time": 5935, "text": "These are people who, Uzbek is a Turkic language, right?"}, {"time": 5941, "text": "Most Uzbeks live in what is now Uzbekistan, but they form majorities in some Northern parts of the city."}, {"time": 5946, "text": "I'm sorry, of the country of Afghanistan."}, {"time": 5948, "text": "But what I emphasize is that, and you can find online an ethnographic map of Afghanistan and you'll see green where Pashtuns live, red where Hazaras live, orange where Uzbeks live, purple where Tajiks live."}, {"time": 5962, "text": "Then there are a bunch of other smaller groups of different kinds."}, {"time": 5965, "text": "There are Noristanis, there are Baluch, there are, in different religious communities, there are Sunni, Shia, different kinds of Shia."}, {"time": 5974, "text": "What are the key differences between them?"}, {"time": 5976, "text": "Is it religious basis from the origins of where they immigrated from and how different are they?"}, {"time": 5983, "text": "So they're all, I mean, they're all indigenous, I think."}, {"time": 5986, "text": "I mean, there's a kind of mythology that some groups have been there longer, right?"}, {"time": 5989, "text": "So they have a greater claim to power."}, {"time": 5990, "text": "But historically, I mean, it's like, you know, ethnic groups anywhere, people have different narratives about themselves, but many Pashtuns would tell you, not all, but many would say, we are the kind of state builders of Afghanistan."}, {"time": 6005, "text": "The dynasty that ruled much of the space, that was born in the mid 18th century, that ruled until 1973, more or less, generalizing, you know, it was a Pashtun dynasty."}, {"time": 6018, "text": "The Taliban have definitely said to some audiences, we are the rightful rulers because we are Pashtun."}, {"time": 6026, "text": "The trick though is, I don't mean to be evasive, but just to convey some of the complexity, one quick answer as well, they're majorities and minorities."}, {"time": 6034, "text": "I mean, one finds that a lot along with those maps, but I would say suspend any firm belief in that because that could be entirely wrong."}, {"time": 6042, "text": "In fact, there's never been a modern census of Afghanistan."}, {"time": 6047, "text": "So when journalists say Pashtuns are the majority, or they're the biggest group, I would say not so fast."}, {"time": 6053, "text": "I would say not so fast because of migration is one major issue."}, {"time": 6057, "text": "No major modern census."}, {"time": 6060, "text": "Actually, the Soviets got pretty close, but didn't quite, you know, find something comprehensive and didn't publicize it knowing that it was, you know, in modern times, ethnicity can be the source of political mobilization."}, {"time": 6071, "text": "It's not innately so, but it's been part of the story."}, {"time": 6074, "text": "But then you have mixed families, right?"}, {"time": 6076, "text": "So a lot of people you'll meet, you'll encounter in the diaspora and around, I mean, well, I am, you know, my one parent is Tajik, one is Pashtun, right?"}, {"time": 6086, "text": "Or I'm Pashtun, as I mentioned before, but I don't speak Pashto, right?"}, {"time": 6089, "text": "Or I am Hazara, but you read about us as Shiite Hazara, in fact, I'm a Sunni Hazara, or I'm a secular Hazara, or I'm an atheist Hazara."}, {"time": 6099, "text": "I mean, everything's possible, right?"}, {"time": 6101, "text": "One of my friends, if he were here, he'd say, I'm Kabuli, you know, I'm from Kabul."}, {"time": 6109, "text": "So if you think about it in Russian terms, you know, it means a lot if you're a Muscovitch, you know, if you're from Pisa or Moscow, I mean, you know."}, {"time": 6117, "text": "Yeah, well, even here is Pashtunians, Texans, Californians."}, {"time": 6124, "text": "Yeah, East Coast, West Coast, all that stuff."}, {"time": 6127, "text": "Those are all part of the mix here."}, {"time": 6128, "text": "So you asked about Kandahar and Helmand, then I would say, yeah, if you go out to, you know, a pomegranate field, you'll meet a guy who may reckon time differently from you and me, who may not be literate, you may not have ever had a geography lesson, but if you go one door over, you may meet a guy who, you know, his life path has taken him to live in, you know, six countries."}, {"time": 6158, "text": "He may speak five languages."}, {"time": 6160, "text": "And these are all things I'm not saying they're all, these are just because people have money can go fly around."}, {"time": 6164, "text": "I mean, there are people who are displaced by war from late 1970s, right?"}, {"time": 6168, "text": "Even already in the early 70s, people were traveling by the tens of thousands to Iran, you know, as labor migrants."}, {"time": 6175, "text": "And once you get to Iran, once you get to Pakistan, once you get to Uzbekistan, you then connect to all kinds of cosmopolitan cultures."}, {"time": 6182, "text": "And in fact, I think one of the themes of the book, you know, that you may or may not have read, it may put you to sleep."}, {"time": 6187, "text": "You know, Afghan Modern was about, you know, conceptualizing Afghanistan as a cosmopolitan place where for centuries people put on the move and trade in this area."}, {"time": 6195, "text": "You think of, you know, I think this mischaracterization of places like Helmand and Kandahar, you know, you fly in or you're part of a Marine battalion and you see people there and they look different."}, {"time": 6206, "text": "And I think in our imagination, if I can generalize, you know, they look like they've been there for millennia, right?"}, {"time": 6213, "text": "The dress, the whatever, right?"}, {"time": 6214, "text": "You think of technology, you think of the mud compounds and so on."}, {"time": 6218, "text": "You think of, you know, animal drawn transportation, that kind of stuff, right?"}, {"time": 6223, "text": "Or the motorbike, right, at most is what they have."}, {"time": 6226, "text": "But in fact, if you follow those families, their trade has taken them to Northern India for centuries, right?"}, {"time": 6233, "text": "Their trade has connected them to cosmopolitan centers."}, {"time": 6236, "text": "You know, say they have a scholar in the family, that scholar may have studied all of the Middle East, South Asia, right?"}, {"time": 6242, "text": "You know, their ancestors may have been horse traders who went all the way to Moscow, right?"}, {"time": 6245, "text": "I mean, we have a sort of records of all these people traveling across Eurasia, pursuing all kinds of livelihoods."}, {"time": 6252, "text": "And so Afghanistan is this paradox of visually looking remote and looking like it's kind of stuck in time, but the family trajectories and the current trajectories are astoundingly cosmopolitan and mobile."}, {"time": 6266, "text": "And so, and a conception of being a world center is also quite strong."}, {"time": 6270, "text": "So, you know, another way to frame that question about like, do they know about 9.11 would be like, why should we know about 9.11?"}, {"time": 6277, "text": "Because we are at the center of something important, right?"}, {"time": 6279, "text": "We are the center of Asia."}, {"time": 6281, "text": "We are the heart of Asia."}, {"time": 6282, "text": "We have a kind of historic greatness."}, {"time": 6284, "text": "We are a proud culture of our own achievements, right?"}, {"time": 6289, "text": "So we're not worried about that, right?"}, {"time": 6291, "text": "That said, I mean, sure, there are different narratives about why Americans are there, why people are being killed."}, {"time": 6297, "text": "You know, of course you'd find, they want to convert us, they want our gold, they want our opium, they want X, Y, and Z, right?"}, {"time": 6306, "text": "There was a recent story about a Taliban official sitting in an office in Kabul and a journalist asked him, what can you find in this rotating globe?"}, {"time": 6315, "text": "Find your country, find where are we sitting right now?"}, {"time": 6317, "text": "And he was filmed not being able to do it."}, {"time": 6321, "text": "And so a lot of, you know, race sophisticated Afghans in the diaspora were saying, you know, ha ha, look at this."}, {"time": 6325, "text": "And that exists."}, {"time": 6327, "text": "I mean, I think I could go to my Stanford classroom and there'd be a lot of kids who wouldn't know where Afghanistan is too, right?"}, {"time": 6332, "text": "But I guess I wouldn't use those metrics to suggest that this is a place that doesn't have a sense of its place in the world and of geopolitics."}, {"time": 6342, "text": "I think if anything, being a relatively small country in a very complicated neighborhood, I mean, everybody, every cab driver, I mean, people have, I mean, you know, this is where America is different because I don't think Americans have this sense."}, {"time": 6354, "text": "You know, we're talking about Moscow and stuff."}, {"time": 6355, "text": "I think, you know, Moscow cab drivers, I think a lot of them are gonna tell you, like what's happening in the world and why, right?"}, {"time": 6364, "text": "And it's just part of their thing, right?"}, {"time": 6367, "text": "You can find that in Ghana, you can find that in Mexico city, right?"}, {"time": 6369, "text": "You find that lots of places."}, {"time": 6370, "text": "So I think Afghans are part of a very sophisticated kind of mapping of the world and where they fit in."}, {"time": 6377, "text": "And a lot of them remarkably had done it firsthand, which is what struck me so much."}, {"time": 6381, "text": "And, you know, really my experiences from the 1990s and Tashkent places that these guys had already lived in more countries than I'd ever been."}, {"time": 6388, "text": "They already knew half those languages."}, {"time": 6390, "text": "I mean, this one friend's Russian was impeccable."}, {"time": 6394, "text": "And of course it helped, they had Russian girlfriends, they had, you know, they mixed with the police, they had run ins, I mean, this wasn't something you got from a book, right?"}, {"time": 6402, "text": "This was like hard knock life."}, {"time": 6404, "text": "I mean, one friend was from a wealthy family in this trading diaspora and he was imprisoned."}, {"time": 6411, "text": "I mean, they sent him to prison in Pakistan and he talks about how he could start like running, running in the jail, you know, taking cigarettes to people, doing little things and kind of, you know, these are not stories of like, oh, I went to Harvard and so I'm so learned because of this."}, {"time": 6426, "text": "I mean, it's a whole range of experiences."}, {"time": 6428, "text": "The interesting thing is the survey is a survey and it doesn't reflect ignorance, as you're saying, perhaps, but it may reflect a different geopolitical view of the world than the West has."}, {"time": 6445, "text": "So if, you know, for a lot of the world, 9 11 was one of the most important moments of recent human history."}, {"time": 6455, "text": "And for Afghanistan to not to know that, especially when they're part of that story, means they have a very different, like there could be a lot of things said."}, {"time": 6466, "text": "One is the spread of information is different."}, {"time": 6469, "text": "The channels of the way information is spread."}, {"time": 6472, "text": "And two of the things they care about, maybe they see themselves as part of a longer arc of history where the bickering of these superpowers that seem to want to go to the moon are not as important as the big sort of arc that's been the story of Afghanistan."}, {"time": 6493, "text": "You know, that's an interesting idea, but it's still a bit, if at all, representative of the truth."}, {"time": 6500, "text": "It's heartbreaking that they're not, do not see themselves as active player in this game between the United States and Central Asia, because they're such a critical player."}, {"time": 6517, "text": "And I feel, and obviously, in many ways, get the short end of the stick in this whole interaction with the invasion of Afghanistan for many years, and then this rushed withdrawal of troops, and now the economic collapse, and it's sad in some ways."}, {"time": 6544, "text": "I mean, you know, another way to put it is this."}, {"time": 6547, "text": "I mean, yeah, there's a range of knowledge, and you're right, the information flows are peculiar to particular geographies and histories and stuff."}, {"time": 6555, "text": "I think that, you know, plucking out one sample from some fairly remote area, from one like follow the agricultural products."}, {"time": 6562, "text": "I mean, and this is where, you know, I think urban rural divides used to mean a lot more in the 19th century, right?"}, {"time": 6570, "text": "So a lot of like the nuts and bolts of history is about conceiving of these kinds of distinctions, but I think that if one has the privilege of traveling a bit, you see that like urban areas are fed by rural hinterlands."}, {"time": 6583, "text": "And if you think of who actually brings the bread, the milk, the pomegranates and so on, it creates these networks."}, {"time": 6590, "text": "And then, you know, mobility channels, information and so on."}, {"time": 6595, "text": "But yeah, but your broader point about like the tragedy of this, I mean, I guess if I can quote a brilliant student of mine, an Afghan American woman who just received her PhD, who's now, you know, a doctor, he's a great scholar."}, {"time": 6607, "text": "You know, we've done several events now trying to just think through what's happened."}, {"time": 6611, "text": "And of course, she's very emotionally affected by it."}, {"time": 6614, "text": "And she continues to ask a really great question."}, {"time": 6617, "text": "If I can get her phrasing right, you know, if you think of the cycle of like the Taliban being in power in 2001 and the way in which that affected women in particular, you know, half Afghan, half of the society, right?"}, {"time": 6628, "text": "Then you think of this 20 year period of violence and, you know, missed exits, right?"}, {"time": 6634, "text": "And repeated tragedy that also it created a space."}, {"time": 6638, "text": "I mean, it created a space for a whole generation."}, {"time": 6639, "text": "I'd say generationally, it created a sense, a space for people to realize something new."}, {"time": 6644, "text": "And I think, so we have to attend to the dynamism of the society, right?"}, {"time": 6647, "text": "So yeah, this happened mostly in Kabul, other big cities, Mazar Sharif, Herat, and Kandahar."}, {"time": 6655, "text": "But you can't limit your analysis to that because things like radio, television, everyone got a TV channel."}, {"time": 6662, "text": "There's a wonderful documentary called Afghan Star that I recommend to your listeners and viewers that it's about a singing show, a singing contest show."}, {"time": 6670, "text": "But you see just for some of these things about like connections, I mean, it's a show by an independent television network that did drama, it did kind of infomercials for the government and huge American investment in it."}, {"time": 6684, "text": "So it wasn't politically neutral, but it did talk shows, did all this kind of stuff."}, {"time": 6687, "text": "But it did a singing show that became incredibly popular, modeled upon the British American, you know, American Idol kind of stuff, you know, and you could vote."}, {"time": 6696, "text": "So it had a kind of democratic practice element."}, {"time": 6699, "text": "But it's fascinating to see that, you know, people hooked up generators to televisions and watch this, you know, you think of like literacy rates, literacy rates are imperfect."}, {"time": 6707, "text": "And, you know, people who study, you know, medieval or modern Europe talk about how, yeah, no one could read and there weren't many books, but if someone had a book, it'd be read aloud to a whole village potentially or gathering."}, {"time": 6720, "text": "So there isn't much, you know, some of these metrics don't get what people actually receive as information or exposure because there's the magnifying power of open spaces and hearing radio in group settings, seeing television group settings, having telephone, you know, cheap telephones, which then become an access point to the world and social media, right?"}, {"time": 6740, "text": "So all the stuff swept across Afghan society as it did elsewhere, you know, in the last decade or more."}, {"time": 6748, "text": "So Afghan society became, you know, in important ways, really connected to everything going on."}, {"time": 6753, "text": "And so you see that reflected politically and what people wanted."}, {"time": 6755, "text": "So you had some people obviously back to return to the Taliban, some people wanted the status quo, but increasingly many more people wanted something else."}, {"time": 6764, "text": "And one of the great failures was to expose people to democracy, but only give them the rigged version."}, {"time": 6770, "text": "And so the US State Department in particular continued to double down on faked elections for the parliament and for the presidency in Afghanistan."}, {"time": 6777, "text": "What kind of elections?"}, {"time": 6778, "text": "Faked, fraudulent elections for parliament and for president in Afghanistan again and again from the very beginning."}, {"time": 6788, "text": "And those elections were partly theater for the US, like for remaining on the road that you're describing, right, for not deviating, for not exiting because we were building democracy there."}, {"time": 6798, "text": "In reality, the US government knew it was never really building democracy there."}, {"time": 6801, "text": "It was establishing control and elections were one of the means to gather control, right?"}, {"time": 6807, "text": "But then you had on the ground, especially among young people going to university, you know, having experiences that were denied to them before, you know, they took these problems so seriously."}, {"time": 6817, "text": "So part of the disillusionment that we see today is that, you know, they believe what the US told them that they're constructing democracy."}, {"time": 6825, "text": "And of course, you know, cynics like us may be thinking, well, you know, you're not really doing that."}, {"time": 6829, "text": "You're backing fraud."}, {"time": 6830, "text": "They believed it when they were younger and now they're actually smart enough to understand that it's a farce."}, {"time": 6836, "text": "But in so indirectly had the consequence of actually working and that it taught the young over a period of 20 years, young folks to believe that democracy is possible and then to realize what democracy is not."}, {"time": 6850, "text": "It's just the current system."}, {"time": 6851, "text": "That's beautifully said, beautifully said."}, {"time": 6852, "text": "And so, but now look at us, now it's, you know, it's now November."}, {"time": 6857, "text": "And so this whole period, and I wouldn't say like, you know, I wouldn't cast the last 20 years if we're looking at all the achievements, you know, I wouldn't put them in an American tally sheet, like, oh, this is something we should pat ourselves on the back for."}, {"time": 6872, "text": "I think that much of this happened actually against what the Americans wanted."}, {"time": 6875, "text": "I mean, that the kind of free thinking, democracy wanting, I mean, even like, you know, we could point out on the religious, go back to the religious sphere."}, {"time": 6884, "text": "I mean, the African religious landscape became very pluralistic."}, {"time": 6890, "text": "Lots of young people wanted a different kind of secular politics, but the old guard who wanted the status quo and wanted something that they'd fought for in 1980s tended to still get American backing as the political leads, who still tended to monopolize political power."}, {"time": 6906, "text": "So all this stuff was happening in different ways."}, {"time": 6909, "text": "I mean, the Americans established this American University of Afghanistan, which was, I think, one of the best things the U.S. did there."}, {"time": 6914, "text": "And I regret that the U.S. didn't fund 20 more, you know, sprinkling them across the country, making them accessible to people, because it was, you know, again, it wasn't an engine of Americanization."}, {"time": 6926, "text": "It was just opportunity."}, {"time": 6927, "text": "And so the thirst for higher education was really extraordinary there."}, {"time": 6929, "text": "It was never really met."}, {"time": 6931, "text": "The U.S. tended to put money in primary education, which much of that too was fraudulent."}, {"time": 6937, "text": "But so you have all this interesting dynamism."}, {"time": 6938, "text": "You have, you know, the arts, you have a critical space."}, {"time": 6942, "text": "I mean, I call it a public sphere in the classic European sense."}, {"time": 6945, "text": "You know, the Afghans made of their own."}, {"time": 6946, "text": "And again, it wasn't Americanization."}, {"time": 6949, "text": "It wasn't imposed."}, {"time": 6951, "text": "It was something that Afghans built across generations, but really with a firm foundation among youth, who wanted, importantly, a multiethnic Afghan society."}, {"time": 6961, "text": "You asked about Pashtuns and that kind of stuff."}, {"time": 6963, "text": "And a lot of that language in recent years was, they were aware that the U.S.-backed government was playing ethnic politics and trying to kind of put people on the blocks and mobilize people based on their ethnic identity."}, {"time": 6977, "text": "And there was a younger cohort of people who said, you know, we are Afghan."}, {"time": 6981, "text": "And then there was interesting social media stuff where people would say, I am Hazara, but I'm also Tajik, I'm also Uzbek."}, {"time": 6988, "text": "I mean, it was a way of creating a multiethnic Afghan national identity that embraced everything."}, {"time": 6994, "text": "I mean, very utopian, you know, super utopian, right?"}, {"time": 6997, "text": "But symbolically, it was very important that they rejected being mobilized politically, you know, voting as a Hazara or voting as whatever."}, {"time": 7005, "text": "And of course, there were communities who wanted to, you know, vote as that ethnic community."}, {"time": 7010, "text": "But there are also people who said, you know, let's put a kind of civic nationalism first, one that accommodates, I think, pluralism in a way that rejected the kind of majoritarian politics of one ethnic group dominating the thing."}, {"time": 7023, "text": "So all this stuff was quite interesting."}, {"time": 7024, "text": "I mean, women were asserting themselves across multiple spheres."}, {"time": 7029, "text": "Of course, it remained patriarchal."}, {"time": 7030, "text": "Of course, there were struggles."}, {"time": 7031, "text": "Of course, there was violence."}, {"time": 7032, "text": "Of course, you know, there's no utopia."}, {"time": 7035, "text": "But the door on all that shut on August 15."}, {"time": 7038, "text": "So to go back to the quote that I wanted to offer from the student, now professor, was it, you know, in trying to make sense of this, and you mentioned the tragic arc here, if you think of the 20 years, like, she asked, you know, why did you go to war in our country?"}, {"time": 7057, "text": "Basically, why did you do this to us for 20 years when this was never about us?"}, {"time": 7061, "text": "You know, you never asked us if you wanted to come."}, {"time": 7063, "text": "You never asked us what you wanted to build here."}, {"time": 7066, "text": "You didn't ask us when you were coming and you didn't ask us when you were leaving."}, {"time": 7069, "text": "You just did this all on your own."}, {"time": 7071, "text": "And we tried to make the most of it."}, {"time": 7073, "text": "And then you pulled the rug out from under us, you know, at the 11th hour, and returned to power, probably by diplomacy."}, {"time": 7082, "text": "It wasn't, at the end, just a military loss."}, {"time": 7084, "text": "I mean, it was a series of diplomatic decisions."}, {"time": 7086, "text": "I mean, the idea, you asked about alternatives."}, {"time": 7088, "text": "I mean, give me a Bagram."}, {"time": 7090, "text": "I mean, holding to the timeline."}, {"time": 7092, "text": "I mean, the Biden people did not need to hold to the Doha Agreement that Trump had signed."}, {"time": 7097, "text": "I mean, every American president writes his or her own foreign policy, right?"}, {"time": 7101, "text": "So the Biden administration acted as if, and they tried to convince us that their hands were tied, and that it was either this or 20 more years of war or some absurd kind of, you know, false alternative."}, {"time": 7116, "text": "And so, but I think that's important for American audiences to hear that, you know, they're like, you came to here to experiment."}, {"time": 7122, "text": "You came here to punish."}, {"time": 7124, "text": "You came here to kind of reassert, you know, your dominance the world stage, you know, to work out the fear and hurt of 9 11 that we talked about, which was so real, you know, impalpable and so important for American politics since then."}, {"time": 7139, "text": "Like you did, you worked out your problems, you know, on us, on our territory."}, {"time": 7143, "text": "And now what do we have for it?"}, {"time": 7146, "text": "You know, and then the people who had a stake in that system, imperfect as it was, have been desperate to leave."}, {"time": 7153, "text": "And so this, I don't know how much people are aware of this, but, you know, I'm a scholar, I work in California, you know, I have friends, I edited a journal on Afghanistan and, you know, but I'm not a politician, I'm not a soldier, but people assume that, you know, Afghans have been desperately trying to reach me and anyone who is kind of on the radar as an American to help get them out."}, {"time": 7176, "text": "You know, that's the kind of like, you know, the symbol of voting with your feet, you know, is quite powerful."}, {"time": 7183, "text": "I mean, there's a huge swath of society that doesn't want the system and is literally living in terror about it."}, {"time": 7190, "text": "Naturally women, you know, I mean, especially women of a certain age, I mean, they feel like their lives are over."}, {"time": 7194, "text": "I mean, there is an epidemic of suicide."}, {"time": 7198, "text": "They feel betrayed and some people have done some good things in getting people out."}, {"time": 7203, "text": "You know, I mean, some, you know, the US military vets have been, you know, at the forefront of working to get out people, you know, that they know they owe, but the US government doesn't want these people."}, {"time": 7217, "text": "I mean, they have created all these obstacles to allowing a safety valve for people to leave."}, {"time": 7224, "text": "Looking forward from a perspective of leadership, how do we avoid these kinds of mistakes?"}, {"time": 7231, "text": "So obviously some interests, some aspects of human nature led to this war."}, {"time": 7236, "text": "How do we resist that in the future?"}, {"time": 7241, "text": "I guess beyond my moral and intellectual capacity, I'll just say this, I mean, looking at it, again, looking at it from my home ground as the university, and I think of the intellectual, you know, ways of thinking that I think students should develop for themselves as citizens, right?"}, {"time": 7259, "text": "Maybe that's where to start is like historical thinking."}, {"time": 7261, "text": "I mean, these are all, you know, I try to tell people, you know, if you want to do robotics, computer science, you'd be a doctor or whatever."}, {"time": 7268, "text": "You should study history."}, {"time": 7270, "text": "Yeah, I mean, you don't have to be in a story like me, and it's, you know, my job isn't perfect."}, {"time": 7273, "text": "My profession is deeply flawed, right?"}, {"time": 7275, "text": "But as I get older, I'm like, there are fewer and fewer historians that I actually like and want to hang out with and stuff."}, {"time": 7280, "text": "So it's like, I'm not offering myself as like a model for anything, but you know, whether you're a, you know, you carry the mail or you're a brain surgeon, whatever."}, {"time": 7287, "text": "I mean, I think it's a way of civic engagement and a way of like, you know, ethical being in the world that we need to familiarize ourselves with, because if you're an American or if you're from a rich country, you know, you need to be aware of your effect on an intricate world."}, {"time": 7302, "text": "You can't say anymore that you don't know or care what's happening in Afghanistan or really circle the globe and point to a place."}, {"time": 7309, "text": "I mean, we're all connected and we have ethical obligations."}, {"time": 7314, "text": "That's one place to start, but I would just say this, and this is a lot for a self critique, and that is so much of my teaching and like the themes of my research have been about empire, you know, how big states work, not only on big territories like the Russian Empire and Soviet Union and stuff, but the way in which power often is projected beyond those boundaries in ways that we don't see."}, {"time": 7334, "text": "So this is where things like neoliberalism or just, you know, if you want to take capitalism or just things that, you know, the idea of humanity or of liberalism or of humanitarianism, ideas that move beyond state boundaries are all things that we think about as affecting power in some ways that often harm people, right?"}, {"time": 7353, "text": "So I think part of, as I've seen my job so far is to think about, you know, building upon the work of my people in grad school and, you know, scholars that have affected me."}, {"time": 7362, "text": "I mean, you know, we're all concerned with how power works and its effects and trying to be attuned to understanding things that aren't visible, right, that we should be thinking about, that should be known to us."}, {"time": 7372, "text": "And as scholars, we can hopefully play some useful role in showing effects that aren't, you know, obvious initially."}, {"time": 7381, "text": "So empire is a framework to think about this."}, {"time": 7383, "text": "And so you think about invading foreign countries."}, {"time": 7385, "text": "Obviously, if you're a scholar of empire, you've seen what that looks like, and that's horrific, right?"}, {"time": 7391, "text": "You look at things like racism as one of the ideological pillars of empire."}, {"time": 7396, "text": "You know, that's horrific."}, {"time": 7397, "text": "It must be critiqued."}, {"time": 7398, "text": "It must be, you know, we must be educated against."}, {"time": 7402, "text": "Some of the, you know, gender exploitation of empire is also something to highlight, you know, to rectify and so on."}, {"time": 7407, "text": "You know, to be moral beings, we need to think about past inequality and the legacies of violence and destruction that live on."}, {"time": 7415, "text": "I mean, living in the Americas."}, {"time": 7416, "text": "I mean, look at, you know, we're all on stolen land."}, {"time": 7419, "text": "We're all in the sense living with the fruits of genocide and slavery and all those things that are hard to come to terms with, right?"}, {"time": 7426, "text": "But the last few months in Afghanistan and thinking about empire, I think, made me more humble when I read people who say, to put it simply, have taken some joy in this moment, saying like, well, the Americans got kicked out of Afghanistan."}, {"time": 7443, "text": "You know, if you're against empire, this is a good thing."}, {"time": 7447, "text": "This is a kind of victory of anti colonial."}, {"time": 7450, "text": "You could see from the perspective of Afghanistan that America is not some kind of place that has an ideal of freedom and all the kind of things that we Americans tell ourselves, but it's more America has the ideal of empire, that there's one place that has the truth and everybody else must follow this truth."}, {"time": 7471, "text": "And so from a perspective of Afghanistan, it could be a victory against this idea of centralized truth of empire."}, {"time": 7479, "text": "That's another way to tell the story."}, {"time": 7481, "text": "And then in that sense, it's a victory."}, {"time": 7483, "text": "And in that sense also, I mean, you push back against this somewhat, this idea of Afghanistan as the graveyard of empires."}, {"time": 7496, "text": "And outside this, I mean, I'm a critic of empire."}, {"time": 7499, "text": "I mean, you know, colonialism is a political phenomenon that stays with us."}, {"time": 7505, "text": "And I think, you know, we need scholars to point to the way in which it still works and still does harm."}, {"time": 7511, "text": "But it's part of being an empire that you can just get up and leave a place, right?"}, {"time": 7515, "text": "That you can remake its politics on one day."}, {"time": 7519, "text": "And then because it fails to advance your agenda at one moment, you simply walk away."}, {"time": 7526, "text": "I mean, you know, we can point to other moments."}, {"time": 7527, "text": "I mean, 1947 on the subcontinent, you know, the way that the British withdrew played a significant role in mass violence, you know, that accompanied partition."}, {"time": 7540, "text": "It wasn't all the actions of the British that, you know, dictated that, right?"}, {"time": 7544, "text": "There were lots of actors who chose to pick up, you know, the knife to kill their neighbor and so on."}, {"time": 7549, "text": "I mean, there's lots of agency in that moment as there is now in what's happening in Afghanistan."}, {"time": 7554, "text": "But I think the capriciousness, I mean, the ability to act as if your political decisions about other people's lives, you know, are something that can be made, you know, in secret."}, {"time": 7569, "text": "They can be made willy nilly."}, {"time": 7571, "text": "They really are beyond the accountability, you know, of those who are actually going to live with the consequences of shifting the cards on a deck in a way that decides who rules and who doesn't."}, {"time": 7583, "text": "I would love to hear your conversation with somebody I just talked to, which is Neil Ferguson, who argues on the topic of empire, that you can also zoom out even further and say, weigh the good and the bad of empire."}, {"time": 7598, "text": "And he argues, I think he gets a lot of flack for this from other historians, that like the British empire did more good than bad in certain moments of history."}, {"time": 7610, "text": "And that's an uncomfortable truth."}, {"time": 7612, "text": "There's like levels, it's a cake with layers of uncomfortable truths."}, {"time": 7617, "text": "And it's not a cake at all because none of it tastes good."}, {"time": 7621, "text": "I mean, I would continue to disagree with Neil Ferguson."}, {"time": 7624, "text": "So I'm still working out where I am and what this moment does to kind of, I think, qualify my understanding of the past into, I think in a moment of humility, I do, and I'm probably reacting to the kind of, as you put it, I mean, the idea that this is like a good thing that American power has been defeated here."}, {"time": 7643, "text": "I mean, I do think American power should contract."}, {"time": 7645, "text": "And I don't think, and again, if I had to create a tally sheet of what the Americans did in the US, I mean, I mentioned the American University of Afghanistan."}, {"time": 7655, "text": "It could have done that without invading the country and killing people."}, {"time": 7658, "text": "I've not now become an apologist for empire."}, {"time": 7661, "text": "I'm not now a mini Neil Ferguson, but ending empire is, I mean, those decisions you make are in some ways a continuation of imperil hubris, right?"}, {"time": 7677, "text": "So you're not really out of empire yet."}, {"time": 7679, "text": "You're not really contracting empire for those who are living it, you know?"}, {"time": 7683, "text": "But I think it's also, I mean, maybe I put it this way, it's be careful what you ask for, you know?"}, {"time": 7688, "text": "I mean, I wanted the US out of Afghanistan, but I wanted there to be a political settlement."}, {"time": 7694, "text": "I wanted my cake and I wanted to eat it too, right?"}, {"time": 7698, "text": "I wanted all kinds of things to be different, right?"}, {"time": 7700, "text": "But why is going to Afghanistan even needed for that?"}, {"time": 7702, "text": "You can play all those games of geopolitics without ever invading and taking ownership of the place."}, {"time": 7710, "text": "It feels like the war, it feels like, I mean, I'm not exactly sure what military force is necessary for, except for targeted intense attacks."}, {"time": 7721, "text": "It feels like to me, the right thing to do after 9 11 was to show what was a display of force unlike anything the world has ever seen for a very short amount of time."}, {"time": 7734, "text": "Targeted at, sure, a terrorist, at certain strongholds and so on."}, {"time": 7739, "text": "And then in and out and then focus on education, on empowering women into the education system, all those kinds of things that have to do with supporting the culture, the education, the flourishing of the place."}, {"time": 7756, "text": "It has nothing to do with military policing essentially."}, {"time": 7762, "text": "I mean, I think, yeah, if you look at it through that lens, I mean, if any Afghanistan and then if any Iraq didn't end Al Qaeda, it didn't end terrorism, right?"}, {"time": 7773, "text": "It didn't really deflate these ideologies entirely."}, {"time": 7778, "text": "There were, if you like, you could say there were, some limited discrediting of certain kinds of ideas."}, {"time": 7787, "text": "But in fact, I mean, look at the phenomenon of suicide bombing."}, {"time": 7790, "text": "I mean, it spread."}, {"time": 7791, "text": "I mean, it was never an Islamic thing."}, {"time": 7793, "text": "It was never a Muslim thing."}, {"time": 7795, "text": "Some Muslims adopted it in some places, but the circuits of knowledge about how to do these kinds of things only expanded with the insurgencies that emerged in Afghanistan and Iraq, and then they kind of became connected."}, {"time": 7806, "text": "And then they began to the present."}, {"time": 7808, "text": "I mean, the Islamic state is, it's the best thing that happened to the Taliban ever because it's on the basis of its supposed new stance as a counterterrorism outfit that it will get recognition from all its neighbors."}, {"time": 7822, "text": "It will get recognition from Russia."}, {"time": 7824, "text": "I mean, already with the evacuation of the airport, the United States was collaborating with the Taliban against the Islamic state and openly talking about the Taliban as if they were partners in the security operation."}, {"time": 7835, "text": "So, and then Al Qaeda remains present in Afghanistan, so."}, {"time": 7840, "text": "Trillions of dollars spent."}, {"time": 7843, "text": "The drones up above bombing places that result in civilian death, the death of children, the death of fathers and mothers, and those stories even at the individual level propagate virally across the land, creating potentially more terrorists."}, {"time": 7861, "text": "And a cynical view of the trillions of dollars is the military industrial complex where there's just a momentum where after 9 11, the feeling like we should do something led to us doing something."}, {"time": 7878, "text": "And then a lot of people realizing they can make money from doing more of that something."}, {"time": 7883, "text": "And then it's just the momentum where no one person is sitting there petting a cat in an evil way, saying we're going to spend all of this money and create more suffering and create more terrorism."}, {"time": 7896, "text": "But it's just something about that momentum that leads to that."}, {"time": 7899, "text": "And to me, honestly, I'm still a sucker."}, {"time": 7902, "text": "I believe in leadership."}, {"time": 7903, "text": "I believe in great charismatic leaders and the power of that want to do evil and to do good."}, {"time": 7911, "text": "And it felt like I honestly put the blame on George Bush, Obama, Trump, and Biden for lack of leadership."}, {"time": 7923, "text": "Yeah, definitely, definitely."}, {"time": 7925, "text": "Yeah, there is the military industrial complex component, which is huge."}, {"time": 7929, "text": "And there's also, I mean, speaking of government leadership, it's also, I'd say the imbalance of power within Washington."}, {"time": 7935, "text": "I mean, the Pentagon used this moment, well, beginning in 2001, I think to assert this authority at the expense of other institutions of national government."}, {"time": 7947, "text": "I mean, the State Department diplomacy has become a shadow of what it was once capable of doing."}, {"time": 7955, "text": "And of course, I mean, other historians, US historians, which I'm not formally a historian of the United States, but we can go back to talk about Vietnam."}, {"time": 7962, "text": "We talk about lots of Cold War and post Cold War engagements."}, {"time": 7967, "text": "And I think we need a reckoning about how the United States uses military power, why we devote so much to our military budget and what could be available to us if we had a more sensible view of the value of military power, of its effectiveness."}, {"time": 7983, "text": "And I think we're willing to hammer home that this was a defeat."}, {"time": 7985, "text": "I mean, I think there should be accountability."}, {"time": 7988, "text": "And this could be a kind of opening for a kind of bipartisan conversation, because if you are a kind of American militarist, I mean, you have to look at the leadership that got you to a place where you were defeated by men wearing sandals firing AK 47s, right?"}, {"time": 8005, "text": "Yeah, there should be a humility with that."}, {"time": 8009, "text": "I mean, we should actually say that, like literally the... Oh, we lost."}, {"time": 8015, "text": "You should say we lost."}, {"time": 8015, "text": "It wasn't just, you know..."}, {"time": 8017, "text": "The American military lost."}, {"time": 8020, "text": "Yeah, and I feel I have very mixed feelings and it's, I don't know, a ton of veterans, but Mitch and I have topped my share and have a student now and they're suffering because they look at the sacrifices that they made that I didn't make."}, {"time": 8035, "text": "I mean, American society didn't make the sacrifices."}, {"time": 8037, "text": "I mean, men and women lost limbs, they lost eyes, they lost lives."}, {"time": 8042, "text": "There's been this, of course, quiet epidemic of suicide among veterans."}, {"time": 8047, "text": "And I've heard some stories the fact that the State Department is seeing a similar surge of suicides because they see their adult life's work collapse."}, {"time": 8059, "text": "They've seen their relationships."}, {"time": 8060, "text": "I mean, they've seen phone calls in the middle of the night from people who they entrusted with their lives who they know are gonna be targeted."}, {"time": 8068, "text": "I mean, some of them have already been killed."}, {"time": 8070, "text": "They've seen the, I mean, I think just, I'd imagine just ideologically and professionally what they believed in and what they sacrificed for has vanished."}, {"time": 8081, "text": "And I think that's bad."}, {"time": 8084, "text": "I mean, historically thinking of some of the precedents you were thinking of, I mean, if you think of, first of all, at a human level, I feel horrible for those people who, I may not have agreed with everything they had done and their choices in life, but I respect the fact that many good people went out of the best intentions as young people to do the right thing and make things right."}, {"time": 8105, "text": "And I respect that."}, {"time": 8107, "text": "And I've met enough to know that there were people who saw the gray and complexity and that's all you can hope for."}, {"time": 8116, "text": "But we don't want a generation of disillusioned veterans if we look at the other postwar moments."}, {"time": 8123, "text": "And this is kind of a postwar moment where, I think we need a conversation with American veterans about what they've gone through and what they're feeling."}, {"time": 8131, "text": "And they still have skin in the game because their personal connections and the end of their histories."}, {"time": 8135, "text": "And they're also gonna be future leaders."}, {"time": 8137, "text": "I mean, veterans."}, {"time": 8139, "text": "People who have served are often great men and women."}, {"time": 8145, "text": "And throughout history, whether you sacrifice you served in fighting World War II, in fighting Vietnam, that's going to mold you in different ways."}, {"time": 8158, "text": "That's going to mold how you are as a leader that leads this country forward."}, {"time": 8164, "text": "And so you have to have an honest conversation about what was the role of the war in Afghanistan, the war in the Middle East, the war on terror in the history of America."}, {"time": 8178, "text": "If we just look at the full context at the end of this 21st century, how are we going to remember this and how that's going to result in our future interactions with small and large countries, with China or some proxy war with China, with Russia or some proxy war with Russia what's the role of oil and natural resources and opium and all those kinds of things."}, {"time": 8200, "text": "What's the role of military power in the world."}, {"time": 8205, "text": "And now with COVID, it's almost like because of the many failures of the US government and many leaders in science and politics to respond effectively and quickly to COVID, we kind of forget that we fumbled this other thing too."}, {"time": 8232, "text": "And it's hard to know which is going to be more expensive."}, {"time": 8237, "text": "They seem to be symptoms of something of a same kind of source problem of leadership, of bureaucracy, of the way information and intelligence flows throughout the US government."}, {"time": 8255, "text": "And that hopefully motivates young leaders to fix things."}, {"time": 8280, "text": "I mean, the fact that military defeat is a giant match that you're throwing on this fire potentially, if we think of its legacies and other postwar environments, when the veteran angle is one, when you have people who feel betrayed, I mean, they have been fodder for the far right in other settings."}, {"time": 8298, "text": "I mean, interwar Europe is very much about mobilizing dissolution veterans in the name of right wing fascist politics."}, {"time": 8306, "text": "If one thinks too of this moment of really increasing xenophobia, our immigration debate is now talking about whether or not Afghans should be permitted at all in the United States after 20 years."}, {"time": 8319, "text": "And I think immediately the response in Europe, which I followed to some extent, focusing on Germany, because it was really ramping up deportations of Afghans leading up to this collapse."}, {"time": 8330, "text": "And now they have been, a lot of right wing center right politicians in Germany have been watching all this with an eye to, using it to their advantage for a domestic German audience to say, in the context of recent elections, that we are the party who will defend you against these Afghans who are gonna be coming from this."}, {"time": 8351, "text": "So what I've tried to emphasize in talking to different groups about this moment is that it won't be confined to Afghanistan or even the region."}, {"time": 8358, "text": "I mean, obviously malnutrition, hunger will send Afghans to neighboring states, but where the European right is resurgent, this has been a gift, right?"}, {"time": 8368, "text": "To say that the Afghans are coming, they're brown skinned, they're Muslim, they're uneducated, they're gonna want your women."}, {"time": 8374, "text": "And they will take the odd sexual assault case or the odd, whatever, dramatic act of violence that happens numerically in any population."}, {"time": 8385, "text": "And they will magnify that to say that, our far right group is gonna save the nation."}, {"time": 8391, "text": "And sorry, the main point I wanted to speak of leadership was that I think the serial, well, there were many, many carnal sins, if you like, but if you go back to our analogy of all the exits, I mean, what blocked some of those exits was an absence of truth and transparency and the lying."}, {"time": 8409, "text": "And so, I mean, this is no secret, anyone who's followed this, but we've allowed, and you think of the general mistrust of government, mistrust of authority across the board, of professors, of economists, of scientists, doctors, right?"}, {"time": 8426, "text": "Well, I actually think that's the hopeful thing to me about the internet is the internet hates inauthenticity."}, {"time": 8434, "text": "They can smell bullshit much better."}, {"time": 8436, "text": "And I think that motivates young leaders to be transparent and authentic."}, {"time": 8440, "text": "So like the very problems we've been seeing, this kind of attitude of authority where, oh, the populace, they're too busy with their own lives."}, {"time": 8453, "text": "They're not smart enough to understand the full complexities of the things we're dealing with."}, {"time": 8457, "text": "So we're not going to even communicate to them the full complexities, we're just going to decide and then tell them what we decided and conceive some kind of narrative that makes it easy for them to consume this decision."}, {"time": 8511, "text": "And I think that's just going to change the nature of leadership in the 21st century."}, {"time": 8517, "text": "I think all the things you've highlighted, accountability is part of that, right?"}, {"time": 8520, "text": "I mean, we need honesty, openness, and then acknowledgement of mistakes."}, {"time": 8526, "text": "Humility is the key to all learning, right?"}, {"time": 8528, "text": "But also, I mean, you think just the headline from yesterday, the horrible drone strike, which was really the last kind of American military action on the day that the US was, I think, mostly departing from Kabul, wiped out an entire family, mostly children."}, {"time": 8545, "text": "You know, the US acknowledged that, yes, this was not the ISIS bombing outfit that they thought it was."}, {"time": 8551, "text": "But yesterday, they did a quick review."}, {"time": 8588, "text": "It's not a crime."}, {"time": 8589, "text": "It's a way of not even saying, you know, we screwed up."}, {"time": 8593, "text": "And it's kind of the legal ease that suddenly makes a war crime not a war crime, you know?"}, {"time": 8599, "text": "And that reflects, I think, our refusal to take accountability."}, {"time": 8604, "text": "I think people are really sick of that in a way where the opposite is true, which is they get excited for people who are not, for leaders who are not that, and so they're not going to punish you for saying, I made a mistake."}, {"time": 8622, "text": "I just had a conversation with Francis Collins, the director of the NIH, and part of my criticism towards Anthony Fauci has been that it's such subtle, but such crucial communication of mistakes made."}, {"time": 8638, "text": "If you make a small mistake, it is so powerful to communicate, I think we messed up."}, {"time": 8645, "text": "We thought this was true, and it wasn't."}, {"time": 8648, "text": "So the obvious thing there was with masks early in the pandemic."}, {"time": 8653, "text": "There's so much uncertainty."}, {"time": 8654, "text": "It's so understandable to make mistakes or to also be concerned about what kind of hysteria, different statements you make lead to."}, {"time": 8663, "text": "Just being transparent about that and saying we were not correct and saying the thing we said before."}, {"time": 8668, "text": "That's so powerful to communicate, to gain trust."}, {"time": 8673, "text": "And the opposite is true."}, {"time": 8675, "text": "When you do this legal ease type of talk, it destroys trust."}, {"time": 8680, "text": "And again, I really think the lessons of recent history teach us how to be a leader and teach young leaders how to be leaders."}, {"time": 8693, "text": "And so I have a lot of hope."}, {"time": 8696, "text": "Partially thanks for the internet."}, {"time": 8698, "text": "Yeah, yeah, that's great."}, {"time": 8700, "text": "Oh, humility."}, {"time": 8700, "text": "I mean, we need humility, accountability, honesty."}, {"time": 8705, "text": "And yes, studying the past is an important way to do that."}, {"time": 8707, "text": "I mean, to learn from past mistakes."}, {"time": 8709, "text": "And obviously there's stories of inspiration and courage and we can take some kind of assistance from that too."}, {"time": 8714, "text": "But also learning from, learning how not to do things."}, {"time": 8719, "text": "And then analogies are never like one to one."}, {"time": 8723, "text": "I mean, we talk about Vietnam."}, {"time": 8724, "text": "I mean, I think many Vietnam veterans would say, yeah, this is like deja vu."}, {"time": 8728, "text": "I mean, the story, the visuals of the Kabul airport and of the Saigon embassy were not the same, but close enough that people would juxtapose them."}, {"time": 8738, "text": "All of this right now, but I would just ask people that over analogizing is also a kind of path down making errors of judgment and comparison, and then sameness, but it's stretch."}, {"time": 8751, "text": "I mean, like 9.11 itself, I think the idea that people lack the imagination within our security apparatus to think this was even possible, right?"}, {"time": 8760, "text": "And you think of the simplicity of having a $10 lock on a cockpit door, could have wanted all this."}, {"time": 8766, "text": "And again, I'm not saying either the time or in hindsight that I am omniscient about all this, but I had just been living in Germany the year before, and there was a plot there."}, {"time": 8776, "text": "This guy was hatching from Germany to blow up the mausoleum of Attertwerk in Ankara with an airplane."}, {"time": 8783, "text": "And so if you kind of dig, it wasn't unimaginable that you would use an airplane as a weapon."}, {"time": 8789, "text": "And the Bush administration kept saying, no one had ever heard of this."}, {"time": 8792, "text": "Who would do this?"}, {"time": 8793, "text": "Like, well, not a lot of people do this."}, {"time": 8795, "text": "And then at that very moment, my wife was teaching the Joseph Conrad novel Secret Agent, which was about a conspiratorial organization that wanted to bomb, actually in retrospect, it was kind of suicide bombing because they tricked this guy into doing it, but they wanted to bomb the Greenwich Observatory for some obscure political purpose."}, {"time": 8817, "text": "So that's an instance in which, you know, the novel, right, to go back to our kind of humanities pitch, right, that my point was that, you know, as you mentioned, we need humanity, transparency, but also imagination, right?"}, {"time": 8829, "text": "I think part of expanding our imagination is by, you know, I mean, obviously delving into your fields, you know, of engineering and the sciences and robotics and artificial intelligence and all that rich landscape."}, {"time": 8840, "text": "And then, but also we find this in film, poetry, literature, I mean, just the kind of stretching that we need to do to really educate ourselves more fully, right, across the spectrum of everything humans need to imagine, to reimagine security."}, {"time": 8857, "text": "You know, so much of what we talked about today, I mean, so much of, you know, our security is affected by others perception of their insecurity, right?"}, {"time": 8866, "text": "Which unleashes a whole web of emotions."}, {"time": 8869, "text": "Can you tell me about the Afghan people, what they love, what they fear, what they dream of for themselves and for their nation?"}, {"time": 8880, "text": "Is there something to say, to speak to to the spirit of the people that may humanize them and maybe speak to the concerns and the hopes they have?"}, {"time": 8892, "text": "Yeah, I think I, you know, as an outsider, I hesitate to make any grand statement, but I would say, listen, I mean, there are a number of documentary films that are incredibly rich that will offer your listeners and viewers a snapshot."}, {"time": 8906, "text": "So there is Afghan Star, you know, which really brings you in the homes of a set of people who, you know, they want stardom, they're artists, they want to express themselves."}, {"time": 8916, "text": "Some want to push political boundaries, cultural boundaries."}, {"time": 8919, "text": "There's a woman who gets into hot water for dancing."}, {"time": 8922, "text": "But yeah, you realize that, I mean, people, I mean, they love art, they love music, they love poetry, they love expression."}, {"time": 8930, "text": "You know, people want to care for their children."}, {"time": 8932, "text": "They want safety of their families."}, {"time": 8934, "text": "They want to enjoy what everyone enjoys, you know?"}, {"time": 8937, "text": "I think it's a very humanizing portrait."}, {"time": 8940, "text": "There's another great documentary film called Love Crimes of Kabul, which is a great snapshot of the post 2000 world that the Americans shaped a lot of ways."}, {"time": 8951, "text": "And it's about a women's prison."}, {"time": 8953, "text": "And it's incredibly revealing because it's about young girls and what they want."}, {"time": 8959, "text": "Well, not just young, but young, teenage, and then some middle aged people who are accused of moral crimes, ranging from homicide, which one woman admits to, to having sexual relations outside of marriage."}, {"time": 8973, "text": "And so it shows in a way continuity with the previous Taliban regime and that women are in prison for things that you wouldn't be in prison for elsewhere, and that Islamic law operates as the kind of judicial logic for these punishments."}, {"time": 8990, "text": "But letting these women kind of speak for themselves, I mean, it's fascinating."}, {"time": 8993, "text": "I mean, I don't want to get too much away, but women make very interesting choices in this film that land them in this predicament."}, {"time": 9000, "text": "So they don't all profess innocence."}, {"time": 9004, "text": "Some are like, I'm guilty, but they're guilty for reasons."}, {"time": 9006, "text": "In one case, one woman is guilty, she's in prison because it's a way to exert pressure on her fiancee to finally marry her, you know?"}, {"time": 9014, "text": "So you get ethnicity, you get like, you know, kind of Romeo and Juliet things where their families don't like each other necessarily, but they find each other."}, {"time": 9021, "text": "You have questions of like, love, money, clothing, furniture, it's beautiful."}, {"time": 9028, "text": "And like, I mean, the parts with it, I remember showing it in class, there was a wonderful Afghan student who was a, I think a Fulbright at the ed school at Stanford, and she's a genius, she's amazing."}, {"time": 9038, "text": "It was awkward for her because talking about young women having sex and stuff, and it was just, it wasn't, you know, the snapshot of Afghanistan that she wanted."}, {"time": 9046, "text": "And obviously there's so much more, they're great writers and, you know, musicians."}, {"time": 9050, "text": "And I mean, you know, music is a huge thing."}, {"time": 9052, "text": "I mean, poetry, all those things are great."}, {"time": 9055, "text": "So she found it, you know, I hear you."}, {"time": 9057, "text": "I mean, it's kind of a taboo subject, but I thought the American students seeing it really identified with these women because they're just so real."}, {"time": 9065, "text": "And so, you know, young people trying to find like, I mean, relationships that are universal and circumstances that are very difficult."}, {"time": 9074, "text": "Love, love is universal."}, {"time": 9076, "text": "Yeah, yeah, so it's, I mean, we do have resources to humanize."}, {"time": 9078, "text": "I mean, you know, some of your people will know Khaled Hosseini, you know, he's an African American, he's done his stuff, but there are, there are a number of novelists and short story writers who do cool things."}, {"time": 9090, "text": "I think that another tragic aspect of this moment is that those people have now pretty much had to leave the country."}, {"time": 9096, "text": "So there's a visual artist I would highlight for you named Khadem Ali, who's a Hazara based in Australia."}, {"time": 9104, "text": "He does extraordinary work in blending a tradition of Persian miniatures with contemporary political commentary."}, {"time": 9114, "text": "His work is between Australia and Afghanistan, but he also, he had to flee."}, {"time": 9117, "text": "I mean, he was doing some work in Kabul, but it's a extraordinary kind of visual language that he's adopted that has been shown all over the planet now."}, {"time": 9126, "text": "He's got some of his work is in New York galleries, is in Europe."}, {"time": 9130, "text": "He's been shown in Australia, but he talks about migration in a way that puts Afghans and Hazaras at the center, but it's totally universal about, you know, our modern crisis of all the mains people who were displaced across our planet."}, {"time": 9144, "text": "And he attempts to kind of speak for some size of them in a way that like everyone can get."}, {"time": 9151, "text": "I mean, the visual imagery experts will know that it's from, you know, like the Shah Naam, like an ancient Persian epic that Iranians were attached to, that Afghans are attached to, that people can quote, you know, at length, that has mythical figures of good and evil that kids grow up embodying."}, {"time": 9167, "text": "They're named the names of the characters that are, it's called, you know, the Book of Kings."}, {"time": 9201, "text": "As an outsider, I'm scratching at the surface of the surface."}, {"time": 9205, "text": "Yeah, but there's a depth to it."}, {"time": 9206, "text": "It's just like, it is fascinating."}, {"time": 9208, "text": "With the layers, yeah."}, {"time": 9209, "text": "With the layers of Russian language that's."}, {"time": 9212, "text": "The culture, it's a, I've been struggling, and this is kind of the journey I'm embarking on to convey to an American audience what is lost in translation between Russian and English."}, {"time": 9227, "text": "And it's very challenging in some of the great translators of Dostoevsky, of Tolstoy, of Russian literature, struggle with this deeply."}, {"time": 9236, "text": "And they work, it's an art form just to convey that."}, {"time": 9241, "text": "And it's amazing to hear that Afghanistan, with a full mix of cultures that are there, have the same kind of wit and humor and depth of intellect."}, {"time": 9278, "text": "I mean, I feel like there's something between Ireland and Russia with the humor stuff where it's like, you've gotta be on your game if you wanna be, you know, so it's, yeah, I feel like the intensity of conversation in terms of, yeah, you have to be on your game in terms of wit and so on."}, {"time": 9295, "text": "I mean, you have to, there's certain people I have, like when I talk on this podcast, they're like that, certain people from the Jewish tradition have that, like where the wit is just like, okay, I have to, oh yeah, I really have to pay attention."}, {"time": 9309, "text": "It's a game, it's like, you know what it feels like?"}, {"time": 9312, "text": "It feels like speed chess or something like that and you really have to focus and play and at the same time, there's body language in the, and then there's a melancholy nature to it, at least in the Russian side."}, {"time": 9323, "text": "The whole thing is just a beautiful mess."}, {"time": 9325, "text": "Yeah, I mean, there's a funny TikTok video that went around that I got from like some Afghan acquaintances that was a, that he's an Irish comedian kind of highlighting, you know, kind of Irish and German national stereotypes around hospitality."}, {"time": 9339, "text": "And this Afghan woman said, you know, I didn't know that the Irish were just white Afghans because the whole, like, you know, the hospitality, like politics of like, of refusal."}, {"time": 9348, "text": "You know, you don't take something that's offered to you the first time."}, {"time": 9352, "text": "You don't, I mean, it's the culture of receiving a guest."}, {"time": 9356, "text": "You know, that's, you know, Americans aren't, I mean, that's not, you know, that's not always, I mean, the different, the regional cultures where that's the thing, there's whatever, but it's, I mean, the kind of like generosity and the kind of, you know, that's real."}, {"time": 9369, "text": "I mean, that's, and that's a cool thing."}, {"time": 9372, "text": "That's, you know, the food, I mean, going off just the superficial things, but all of that, the warmth of hospitality and of wit and humanity."}, {"time": 9382, "text": "I mean, that's what we don't see viewing the place just through war and geopolitics and the moving pieces of the map and stuff."}, {"time": 9389, "text": "And that's hard to see when, you know, there are gaps in language and in religious tradition and all that stuff."}, {"time": 9395, "text": "And then, you know, being open to the fact that people do things differently, you know, and it's, and the gender dimension there is important, right?"}, {"time": 9404, "text": "They're kind of, you know, arguably each culture has a kind of gender dynamic that's different."}, {"time": 9409, "text": "And so I think it's helpful to have humility in thinking that some Afghans will do some things differently, you know."}, {"time": 9415, "text": "But then you'll also have Afghans who say, every woman should be educated."}, {"time": 9419, "text": "Everyone should work and so on and so on."}, {"time": 9421, "text": "So there's no, there's no single way of, yeah."}, {"time": 9423, "text": "And there is a gender dynamic in Russia too."}, {"time": 9426, "text": "We need to be respectful of that."}, {"time": 9428, "text": "And that's not always what it looks like at first."}, {"time": 9430, "text": "There's layers."}, {"time": 9431, "text": "Where power is."}, {"time": 9432, "text": "I mean, that's definitely, I don't know, yeah."}, {"time": 9434, "text": "Yeah, that's a whole nother conversation where the power is."}, {"time": 9438, "text": "Rumi, the 13th century Persian poet who was born on the land that is now Afghanistan."}, {"time": 9443, "text": "Is there something in his words that speaks to you about the spirit of the Afghan people?"}, {"time": 9451, "text": "I mean, everyone owns Rumi, I guess I'd say."}, {"time": 9453, "text": "I mean, that's gonna get me in trouble with certain Afghan fans of Rumi who wanna see him as an Afghan."}, {"time": 9460, "text": "Are they proud of Rumi?"}, {"time": 9462, "text": "Do they see him as an Afghan?"}, {"time": 9464, "text": "Yeah, I mean, it depends."}]}]