[{"title": "Richard Wolff: Marxism and Communism | Lex Fridman Podcast #295", "id": "o0Bi-q89j5Y", "quotes": [{"time": 357, "text": "The really big change happens in Russia in 1917."}, {"time": 357, "text": "Now you have a group of Marxists, Lenin, Trotsky, all the rest, who are in this bizarre position to seize a moment."}, {"time": 366, "text": "Once again, a war, like in France, disorganizes the government, throws the government into a very bad reputation because it is the government that loses World War I, has to withdraw, as you know, Brest, Litovsk and all of that, and the government collapses and the army revolts."}, {"time": 397, "text": "And in that situation, a very small political party, Russian Social Democratic Workers Party, splits, under the pressures of all of this, into the Bolshevik and Menshevik divisions."}, {"time": 406, "text": "Lenin, Trotsky and the others are in the Bolshevik division."}, {"time": 416, "text": "And to make a long story short, he's in exile."}, {"time": 420, "text": "Lenin's position gets him deported because he says Russian workers should not be killing German workers."}, {"time": 429, "text": "I mean, this is a war of capitalists who are dividing the world up into colonies and Russian working people should not kill and should not die for such a thing."}, {"time": 436, "text": "As you can expect, they arrest him and they throw him out."}, {"time": 444, "text": "Interestingly, in the United States, the comparable leader at that time of the Socialist Party here, as you know, there was no Communist Party at this point, that comes later."}, {"time": 456, "text": "The head of the Socialist Party, a very important American figure named Eugene Victor Debs, makes exactly the same argument that Americans should not fight in the war."}, {"time": 470, "text": "He has nothing to do with Lenin, I don't even know if they knew of each other, but he does it on his own."}, {"time": 477, "text": "He gets arrested and put in jail here in the United States."}, {"time": 477, "text": "By the way, he runs for president from jail and does very well, really very well, remarkable."}, {"time": 482, "text": "And he's the inspiration for Bernie Sanders, if you see the link, although he had much more courage politically than Bernie has."}, {"time": 498, "text": "I'd love to return to that link maybe later."}, {"time": 498, "text": "History rhymes."}, {"time": 498, "text": "Yes, the complicated story."}, {"time": 504, "text": "Anyway, the importance in terms of Marxism is that now this seizure of power by a group of Marxists, that is a group of people inspired by Marx developing what you might call a Russian, even though there were differences among the Russians too, but a Russian interpretation, this now has to be transformed from a critique of capitalism into a plan, at least."}, {"time": 526, "text": "What are you going to do in the Soviet Union?"}, {"time": 534, "text": "And a lot of this was then trial and error."}, {"time": 534, "text": "Marx never laid any of this out."}, {"time": 542, "text": "Probably wouldn't have been all that relevant if he had, because it was 50 years earlier in another country, etc."}, {"time": 548, "text": "So what begins to happen, and you can see how this happens then more later in China and Cuba and Vietnam and Korea and so on, is that you have kind of a bifurcation."}, {"time": 564, "text": "Much of Marxism remains chiefly the critique of capitalism, but another part of it becomes a set, and they differ from one to the other, a set of notions of what an alternative post capitalist society ought to look like, how it ought to work."}, {"time": 580, "text": "And there's lots of disagreement about it, lots of confusion, and I would say that that's still where it is."}, {"time": 588, "text": "You have a tradition now that has these two major wings, critique of capitalism, notion of the alternative, and then a variety of each of those, and that would be the framework in which I would answer, that's what Marxism is about."}, {"time": 607, "text": "Its basic idea, if you had to have one, is that human society can do better than capitalism, and it ought to try."}, {"time": 619, "text": "And then we can start to talk about what we mean by capitalism."}, {"time": 625, "text": "So we'll look at the critique of capitalism on one side, but maybe stepping back, what do you think Marx would say if he just looked at the different implementations of the ideas that Marxism throughout the 20th century, where his ideas that were implicit were made explicit?"}, {"time": 646, "text": "Would he shake his head?"}, {"time": 646, "text": "Would he enjoy some of the parts of the implementations?"}, {"time": 646, "text": "How do you think he would analyze it?"}, {"time": 654, "text": "Well, he had a great sense of humor."}, {"time": 654, "text": "I don't know if he had a chance to take a look at his writing, but he had an extraordinary sense of humorism."}, {"time": 657, "text": "My guess is he would deploy his humor in answering this question, too."}, {"time": 663, "text": "He would say some of them are inspiring, some of his interpretations of his work, and he's very pleased with those."}, {"time": 670, "text": "Others are horrifying, and he wishes somehow he could erase the connection between those things and the lineage they claim from him, which he would."}, {"time": 689, "text": "It's if you want to refuse something, but with real strong emphasis."}, {"time": 696, "text": "Verzichte darauf is a German way of saying, I don't want anything to do with that."}, {"time": 706, "text": "He would talk then in philosophical terms, because remember, he was a student of philosophy."}, {"time": 711, "text": "He wrote his doctoral thesis on ancient Greek philosophy and all the rest."}, {"time": 711, "text": "He would wax philosophical and say, you know, that the ideas you put out are a little bit like having a child."}, {"time": 724, "text": "You have a lot of influence, but the child is his own or her own person and will find his or her own way, and these ideas, once they're out there, go their own way."}, {"time": 730, "text": "And as you said, there's a particular way that this idea spread, the speed at which it spread throughout the world made it even less able to be sort of stabilized and connected back to the origins of where the idea came from."}, {"time": 749, "text": "The only people who ever really tried that were the Russians after the revolution, because they occupied a position for a while, not very long, but they occupied a position for a while in which, I mean, it was exalted, right?"}, {"time": 761, "text": "There had been all these people criticizing capitalism for a long time, even the Marxists ever since mid century."}, {"time": 766, "text": "And these were the first guys who pulled it off."}, {"time": 773, "text": "They made it."}, {"time": 773, "text": "And so that there was a kind of presumption around the world, their interpretation must be kind of the right one, because look, they did it."}, {"time": 780, "text": "And so for a while, they could enunciate their interpretation."}, {"time": 788, "text": "And it came to be widely grasped as something which, by the way, gets called in the literature, official Marxism, the very idea that you would put that adjective in front of Marxism, or Soviet Marxism or Russian, there were these words that where the adjective was meant to somehow say, kind of, this is the canon, you can depart from it, but this is the canon."}, {"time": 817, "text": "Before the Russian Revolution, there was no such thing."}, {"time": 817, "text": "And by the 1960s, it was already, it was gone."}, {"time": 868, "text": "But they don't know."}, {"time": 868, "text": "It's not that they're stupid, and it's not that they're ignorant."}, {"time": 876, "text": "It's that, well, ignorance may be, but I mean, it's not a mental problem."}, {"time": 882, "text": "It's the taboo."}, {"time": 882, "text": "Shut it down."}, {"time": 882, "text": "And so all of the reopening that, in a way, recaptures what went before and develops it in new direction, they just don't know."}, {"time": 895, "text": "Nevertheless, it's a serious attempt at making the implicit ideas explicit."}, {"time": 895, "text": "The Russians, the Soviets at the beginning of the 20th century, made a serious attempt at saying, okay, beyond the critique of capitalism, how do we actually build a system like this?"}, {"time": 910, "text": "And so, in that sense, not at a high level, but at a detailed level, it's interesting to look at those particular schools."}, {"time": 922, "text": "Maybe... RL."}, {"time": 922, "text": "Right, because, for example, let me just take your point one step further."}, {"time": 922, "text": "You really cannot understand the Cuban Revolution, the Chinese Revolution, Vietnamese, and the others, because each of them is a kind of response, let's call it, to the way the Soviets did it."}, {"time": 943, "text": "Are you going to do it that way?"}, {"time": 943, "text": "Well, yes, and no is the answer."}, {"time": 943, "text": "This we will do that way, but that we're not going to do."}, {"time": 956, "text": "To the originals."}, {"time": 964, "text": "Yes, very much so."}, {"time": 964, "text": "Like maybe most of rock music is reacting to the Beatles and the Stones."}, {"time": 969, "text": "Can you speak to the unique elements of the various schools of that Soviet Marxism?"}, {"time": 976, "text": "So we got Leninism, Trotskyism, Stalinism, maybe even let's expand out to Maoism."}, {"time": 982, "text": "So maybe I could speak to sort of Leninism, and then please tell me if I'm saying dumb things."}, {"time": 992, "text": "I think for Lenin, there was an idea that there could be a small sort of vanguard party, like a small controlling entity that's like wise and is able to do the central planning decisions."}, {"time": 1022, "text": "And then so Maoism is different in that it's focused on agriculture and rural."}, {"time": 1033, "text": "And then Trotskyism, I don't know except that it's anti Stalin."}, {"time": 1040, "text": "I mean, I don't even know if there's unique sort of philosophical elements there."}, {"time": 1046, "text": "Anyway, can you maybe from those or something else speak to different unique elements that are interesting to think about implementation of Marxism in the real world?"}, {"time": 1057, "text": "Probably the best way to get into this is to describe something that happened in Marxism that then shapes the answer to your question."}, {"time": 1066, "text": "In the early days of Marx's writings, and you know, his life spans the 19th century."}, {"time": 1073, "text": "He's born in 1818, dies in 1883, so literally he lives the 19th century."}, {"time": 1080, "text": "And to make things simple, you might look at the first half of the first two thirds of his life as overwhelmingly gathering together the precursors to his own work."}, {"time": 1097, "text": "Marx was unusually scholarly in the sense that partly because he didn't work a regular job, and partly because he was an exile in London most of his adult life, he worked in the library."}, {"time": 1104, "text": "I mean, he had a lot of time."}, {"time": 1109, "text": "He got subsidized a little bit by Engels, whose family were manufacturers."}, {"time": 1115, "text": "And you might say the first half to two thirds of his life are about the critique of capitalism."}, {"time": 1122, "text": "And that was what, in a broad sense, the audience for his work, Western Europe more or less, was interested in."}, {"time": 1132, "text": "That's what they wanted."}, {"time": 1132, "text": "And he gave that to them."}, {"time": 1138, "text": "He wasn't the only one, but he was very, very effective at it."}, {"time": 1138, "text": "By the last third of his life, he and the other producers of an anti capitalist movement, people like the Chartists in England, that's a whole other movement, the anarchists of various kinds, like Proudhon in France, or Kropotkin or Bakunin in Russia, and so on."}, {"time": 1165, "text": "You pull all these together, and there was a shift in what the audience, let's call it a mixture of militant working class people on the one hand, and critical or radical intelligentsia on the other."}, {"time": 1183, "text": "They now wanted a different question."}, {"time": 1189, "text": "They were persuaded by the analysis."}, {"time": 1189, "text": "They were agreeable that capitalism was a phase they would like to do better than."}, {"time": 1196, "text": "And the question became, how do we do this?"}, {"time": 1196, "text": "Not anymore, should we?"}, {"time": 1196, "text": "Why should we?"}, {"time": 1203, "text": "Could we maybe fix capitalism?"}, {"time": 1203, "text": "No, they had gotten to the point, the system has to be fundamentally changed."}, {"time": 1209, "text": "But they didn't go, you might imagine, they didn't go and say, well, what will that new system looks like?"}, {"time": 1216, "text": "They didn't go that way."}, {"time": 1216, "text": "What they did was ask the question, how could we get beyond capitalism?"}, {"time": 1221, "text": "It seems so powerful."}, {"time": 1221, "text": "It seems to have captured people's minds, people's daily lives, and so on."}, {"time": 1231, "text": "And the focus of the conversation became, this was already by the last third of the 19th century, the question of the agency, the mechanism whereby we would get beyond."}, {"time": 1246, "text": "And again, make a long story short, the conversation focused on seizing the government."}, {"time": 1255, "text": "Before that, the government was not a major interest."}, {"time": 1255, "text": "If you read Marx's Capital, the great work of his maturity, three volumes, there's almost nothing in the state."}, {"time": 1263, "text": "He mentions it, but he's interested in the details of how capitalism works, factory by factory, store by store, office."}, {"time": 1276, "text": "What's the structure?"}, {"time": 1276, "text": "The government's secondary for him."}, {"time": 1276, "text": "But there's also humans within that capitalist system of, there's the working class."}, {"time": 1282, "text": "That's what he's interested in."}, {"time": 1282, "text": "He's interested in each, think of it almost mechanically like the workplace."}, {"time": 1289, "text": "In the workplace there, some people who do this and other people who do that, and they accept this division of authority, and they accept this division of what's going on here, particularly because he believed that the core economic objective of capitalism was to maximize something called profit, which his analysis located right there in the workings of the enterprise."}, {"time": 1313, "text": "The government was not the the key factor here."}, {"time": 1320, "text": "And he was looking at ideas of value."}, {"time": 1320, "text": "How much value does the labor of the individual workers provide?"}, {"time": 1328, "text": "And that means, how do we reward the workers in an ethical way?"}, {"time": 1334, "text": "And so those are the questions."}, {"time": 1334, "text": "But the government is not part of that picture."}, {"time": 1343, "text": "So it's very significant that towards the end of the 19th century, Marx is still alive when this begins, but it really gets going after he dies, is this debate among Marxists about the role of the state."}, {"time": 1358, "text": "They all agreed, nearly all of them agree, that you have to get the state."}, {"time": 1358, "text": "The working class has to get the state because they see the state as the ultimate guarantor of capitalism."}, {"time": 1374, "text": "When things get really out of hand, the capitalist calls the police or he calls the army or both of them."}, {"time": 1381, "text": "And so the government is in a sense this key institution captured in Marxist language by the bourgeoisie, by the other side, the capitalists, and yet vulnerable because of suffrage."}, {"time": 1398, "text": "If suffrage is universal or nearly so, if everybody gets a vote, which in a way capitalism brings to bear, part of its rejection of feudalism in the French American Revolution is to create a place where elected represented."}, {"time": 1412, "text": "So the government being subject to suffrage creates the notion, aha, here's how we're gonna, we have to seize the state."}, {"time": 1421, "text": "And then that gets agreed upon, but there's a big split as to how to do it."}, {"time": 1429, "text": "One side says you go with the election, you mobilize the voter."}, {"time": 1436, "text": "That gets to be called reformism within Marxism."}, {"time": 1436, "text": "And the other side is revolution."}, {"time": 1444, "text": "This system, if I may quote Bernie again, is rigged."}, {"time": 1444, "text": "You can't get there."}, {"time": 1452, "text": "They've long ago learned how to manipulate parliaments."}, {"time": 1452, "text": "They buy the politicians and all that, and therefore revolution is going to be the way to do it."}, {"time": 1459, "text": "Revolution gets a very big boost because the Russians, they did it that way."}, {"time": 1466, "text": "They didn't do, I mean, they fought in the Duma, in the Parliament, but they didn't."}, {"time": 1472, "text": "And this focus on the state, I would argue, goes way beyond what the debaters at the time, and if you're interested in the great names, there was a great theorist of the role of the state in a reformist strategy to get power in Germany named Edward Bernstein."}, {"time": 1495, "text": "His opponents in Germany were Karl Kautsky and Rosa Luxemburg, the two other huge figures in Marxism at the time, and they wrote the articles that everybody reads, but it was a much broader debate."}, {"time": 1511, "text": "By the way, that debate still goes on."}, {"time": 1517, "text": "Reformism versus revolution?"}, {"time": 1519, "text": "WOLFF Mhm."}, {"time": 1519, "text": "And in terms of not all that different."}, {"time": 1519, "text": "I mean, it's adjusted to history, but in terms of different."}, {"time": 1526, "text": "SIMON Can you comment on where you lean in terms of the mechanism of progress, reformation versus revolution?"}, {"time": 1534, "text": "WOLFF I'd rather tell you the historical story."}, {"time": 1536, "text": "SIMON Sure."}, {"time": 1536, "text": "WOLFF Over and over and over again, in most cases, the reformists have always won because revolution is frightening, is scary, is dangerous, and so most of the time, when you get to the point where it's even a relevant discussion, not an abstract thing for conferences, but a real strategic issue, the reformists have won."}, {"time": 1558, "text": "I mean, and I'll give you an example from the United States."}, {"time": 1558, "text": "In the Great Depression of the 1930s, you had an extraordinary shift to the left in the United States, the greatest shift to the United States, the greatest shift to the left in the country's history before or since, nothing like it."}, {"time": 1577, "text": "Suddenly, you created a vast left wing composed of the labor movement, which went crazy in the 1930s."}, {"time": 1588, "text": "We organized more people into unions in the 1930s than at any time before or any time since."}, {"time": 1593, "text": "It is the explosion."}, {"time": 1593, "text": "And at the same time, the explosion of two socialist parties and the Communist Party that became very powerful, and they all worked together, creating a very powerful leftist presence in this country."}, {"time": 1608, "text": "They debated in a strategically real way reform or revolution."}, {"time": 1615, "text": "The reformers were the union people, by and large, and the communists were the revolutionaries, by and large, because they were affiliated with the Communist International, with Russia and all of that."}, {"time": 1628, "text": "And in between, you might say, the two socialist parties, one that was Trotskyist in inspiration and the other one more moderate Western European kind of socialism."}, {"time": 1639, "text": "And they had this intense debate."}, {"time": 1639, "text": "And they ended up, the reformists won that debate."}, {"time": 1646, "text": "There was no revolution in the 1930s here."}, {"time": 1646, "text": "But there was a reform that achieved unspeakably great successes, which is why it was as strong and remains as strong as it does, because it achieved in a few years, in the 1930s, starting around 1932, three social security in this country."}, {"time": 1665, "text": "We had never had that before."}, {"time": 1665, "text": "That's the same one we have now."}, {"time": 1670, "text": "Unemployment insurance never existed before that you have till today."}, {"time": 1670, "text": "Minimum wage for the first time, still have that today."}, {"time": 1677, "text": "And a federal program of employment that hired 15 million people."}, {"time": 1683, "text": "I mean, these were unspeakable gifts, if you like, to the working class."}, {"time": 1689, "text": "So that's the 30s and the 40s."}, {"time": 1691, "text": "30s."}, {"time": 1691, "text": "Not much in the 40s anymore, but in the 30s."}, {"time": 1691, "text": "And here's the best part."}, {"time": 1691, "text": "It was paid for by taxes on corporations and the rich."}, {"time": 1698, "text": "So when people today say, well, you can tax the government, the joke is I have to teach American history to Americans because it has been erased from consciousness."}, {"time": 1713, "text": "We'll return to that."}, {"time": 1713, "text": "But first, let's take a stroll back to the beginning of the 20th century with the Russians."}, {"time": 1719, "text": "With the Russians."}, {"time": 1719, "text": "So their interpretation goes like this."}, {"time": 1727, "text": "Everybody was right."}, {"time": 1727, "text": "The state is crucial."}, {"time": 1727, "text": "We were right."}, {"time": 1727, "text": "We were the revolutionaries."}, {"time": 1732, "text": "We seized the state here in Russia."}, {"time": 1732, "text": "Now we have the state."}, {"time": 1732, "text": "And socialism is when the working class captures the state, either by reform or revolution, and then uses its power over the state to make the transition from capitalism to the better thing we're going toward."}, {"time": 1752, "text": "And again, make a long story short, in the interest of time, what happens, which is not unusual in human history, is that the means becomes the end."}, {"time": 1766, "text": "In other words, Lenin, who's crystal clear before he died, you know, he doesn't live very long, he dies in 23."}, {"time": 1771, "text": "So he's only in power from 17 to 22."}, {"time": 1771, "text": "By that time, he has his brain trouble."}, {"time": 1779, "text": "1923, by the way, not at age 23."}, {"time": 1782, "text": "1923."}, {"time": 1782, "text": "Yeah, he's only there for four or five years."}, {"time": 1782, "text": "He's very clear."}, {"time": 1788, "text": "He even says, I've done work on that, I've published, so I know this stuff."}, {"time": 1788, "text": "He says in a famous speech, let's not fool ourselves."}, {"time": 1793, "text": "We have captured the state, but we don't have socialism."}, {"time": 1799, "text": "We have to create that."}, {"time": 1799, "text": "We have to move towards that."}, {"time": 1806, "text": "With Stalin, you know, Lenin dies, and there's a fight between Stalin and Trotsky."}, {"time": 1806, "text": "Trotsky loses the fight, he's exiled, he goes to Mexico."}, {"time": 1812, "text": "Stalin is now alone in power, does all the things he's famous or infamous for."}, {"time": 1818, "text": "And by the end of the 20s, Stalin makes a decision."}, {"time": 1827, "text": "I mean, not that he makes it alone, but things have evolved in Russia so that they do the following."}, {"time": 1832, "text": "They declare that they are socialism."}, {"time": 1832, "text": "In other words, socialism becomes when you capture the state."}, {"time": 1841, "text": "Not when the state capture has enabled you to do X, Y, Z, other things."}, {"time": 1849, "text": "The state itself, once you have it, is socialism."}, {"time": 1849, "text": "So when a socialist captures the state, that's socialism."}, {"time": 1857, "text": "I feel like that's definitionally confusing."}, {"time": 1864, "text": "Well, it shouldn't be, because I'll give you an example."}, {"time": 1864, "text": "If you go to many parts of the United States today, and you ask people, what's socialism?"}, {"time": 1876, "text": "They'll look you right in the face and they'll say, the post office."}, {"time": 1876, "text": "When I first heard this as a young man, I go, what?"}, {"time": 1883, "text": "The post office."}, {"time": 1883, "text": "It took me a while to understand."}, {"time": 1883, "text": "The post office, Amtrak, the Tennessee, all the examples in the United States where the government runs something."}, {"time": 1896, "text": "This is socialism."}, {"time": 1896, "text": "See, capitalism is if the government doesn't run it."}, {"time": 1896, "text": "If a private individual who's not a government official runs it, well, then it's capitalism."}, {"time": 1912, "text": "If the government takes it, then it's socialism."}, {"time": 1912, "text": "So what is wrong with that reasoning?"}, {"time": 1912, "text": "So the idea, I think..."}, {"time": 1918, "text": "There's nothing wrong with it's a way of looking at the world."}, {"time": 1918, "text": "It's just got nothing to do with Marx."}, {"time": 1924, "text": "Well, there's Marx, there's Marxism."}, {"time": 1924, "text": "Let's try to pull this apart."}, {"time": 1929, "text": "So what role does central planning have in Marxism?"}, {"time": 1929, "text": "So Marxism is concerned with this class struggle, with respecting the working class."}, {"time": 1942, "text": "What is the connection between that struggle and central planning that is often... Central planning is often associated with Marxism."}, {"time": 1956, "text": "So a centralized power doing... Russia did that."}, {"time": 1956, "text": "Allocation."}, {"time": 1956, "text": "So that has to do with a very specific set of implementations initiated by the Soviet Union."}, {"time": 1964, "text": "Has nothing to do with Marx."}, {"time": 1969, "text": "How else can you do..."}, {"time": 1969, "text": "I don't think you can find anywhere in Marx's writing anything about central planning or any other kind of planning."}, {"time": 1974, "text": "Again, fundamentally then, Marx's work, it has to do with factories, with workers, with the bourgeoisie, and the exploitation of the working class."}, {"time": 1994, "text": "You still have to take that leap."}, {"time": 1994, "text": "What is beyond capitalism?"}, {"time": 2000, "text": "So maybe we should turn to that, focus on that."}, {"time": 2000, "text": "We've already looked historically at several attempts to go beyond capitalism."}, {"time": 2008, "text": "How else can we go beyond capitalism?"}, {"time": 2014, "text": "Let me push a little further."}, {"time": 2014, "text": "They didn't succeed in my judgment as a Marxist."}, {"time": 2020, "text": "And I'm now gonna tell you why they didn't succeed, because they didn't understand as well as they could have or should have what Marxist was trying to do."}, {"time": 2026, "text": "I think I would have been like them if I had lived at their time under their circumstances."}, {"time": 2032, "text": "This is not a critique of them, but it's a different way of understanding what's going on."}, {"time": 2041, "text": "So give you an example."}, {"time": 2041, "text": "Most of my adult life I have taught Marxian economics."}, {"time": 2049, "text": "I've been that all my life."}, {"time": 2049, "text": "I'm a graduate of American universities."}, {"time": 2049, "text": "As it happens, I'm a graduate of what in this country passes for its best universities."}, {"time": 2062, "text": "That's another conversation you and I can have."}, {"time": 2062, "text": "So I went to Harvard, then I went to Stanford, and I finished at Yale."}, {"time": 2069, "text": "I'm like a poster boy for elite education."}, {"time": 2069, "text": "They tried very hard."}, {"time": 2075, "text": "By the way, I spent 10 years of my life in the Ivy League, 20 semesters, one after the other, no break."}, {"time": 2082, "text": "In those 20 semesters, 19 of them never mentioned a word about Marxism that is no critique of capitalism was offered to me ever with one except one professor in Stanford in the one semester I studied with him, he gave me plenty to read, but nobody else."}, {"time": 2105, "text": "You've mentioned that in the past, and that's very true, which makes you a very interesting figure to hold your ground intellectually through this idea space where just people don't really even talk about it."}, {"time": 2118, "text": "Perhaps we can discuss historically why that is, but nevertheless, that's the case."}, {"time": 2125, "text": "So Marxian economics, did Karl Marx come up in conversation as a kind of..."}, {"time": 2136, "text": "Dismissal."}, {"time": 2136, "text": "The best example, yeah, he came up only as an object of dismissal."}, {"time": 2136, "text": "To give you an example, the major textbook in economics that I was taught with, and that was for many years the canonical book, it isn't quite anymore, was a book authored by a professor of economics at MIT named Paul Samuelson, and a whole generation or two were trained on his textbook."}, {"time": 2163, "text": "If you open the cover of his textbook, he has a tree, and the tree is Adam Smith and David Ricardo at the root, and then the different branches of it."}, {"time": 2170, "text": "He's trying to give you an idea as a student of how the thing developed."}, {"time": 2176, "text": "And it's a tree, and everybody on it is a bourgeois."}, {"time": 2182, "text": "And then there's this one little branch that goes off like this and sort of starts heading back down."}, {"time": 2187, "text": "That's Karl Marx."}, {"time": 2187, "text": "In other words, he had to have it complete because he's not a complete faker, but beyond that, no, there was no."}, {"time": 2193, "text": "Nothing in the book gives you two paragraphs of an approach."}, {"time": 2198, "text": "But that's Cold War."}, {"time": 2198, "text": "I mean, that's really neither here."}, {"time": 2207, "text": "That's the craziness."}, {"time": 2207, "text": "Yeah, that's the Cold War in this country."}, {"time": 2207, "text": "My professors were afraid."}, {"time": 2212, "text": "Anyway, let me get to the core of it, what I think will help."}, {"time": 2212, "text": "Marx was interested in the relationship of people in the process of production."}, {"time": 2219, "text": "He's interested in the factory, the office, the store, what goes on, and by that he means what are the relationships among the people that come together in a workplace."}, {"time": 2232, "text": "And what he analyzes is that there is something going on there that has not been adequately understood and that has not been adequately addressed as an object needing transformation."}, {"time": 2251, "text": "And what does he mean?"}, {"time": 2251, "text": "The answer is exploitation, which he defines mathematically in the following way."}, {"time": 2260, "text": "Whenever in a society, any society, you organize people, adults, not the children, not the sick, but, you know, healthy adults, in the following way, a big block of them, a clear majority, work."}, {"time": 2274, "text": "That is, they use their brains and their muscles to transform nature."}, {"time": 2283, "text": "A tree into a chair, a sheep into a woolen sweater, whatever."}, {"time": 2289, "text": "In every human community, Marx argues, there are the people who do that work, but they always produce more chairs, more sweaters, more hamburgers than they themselves consume, whatever their standard of living."}, {"time": 2305, "text": "Doesn't have to be low, can be medium, can be high, but they always produce more than they themselves consume."}, {"time": 2309, "text": "That more, by the way, Marx, when he writes this, uses the German word mehr, m e h r, which is the English equivalent of more."}, {"time": 2318, "text": "It's the more."}, {"time": 2324, "text": "That more got badly translated into the word surplus."}, {"time": 2324, "text": "Shouldn't have been, but it was."}, {"time": 2324, "text": "By the way, by German and English people doing the translations."}, {"time": 2334, "text": "What's the difference between more and surplus?"}, {"time": 2339, "text": "Is there a nuanced?"}, {"time": 2339, "text": "Yeah, because surplus has a notion of its discretionary, it's sort of extra."}, {"time": 2346, "text": "He's not making a judgment that it's extra."}, {"time": 2346, "text": "It's a simple math equation."}, {"time": 2352, "text": "Yes, very simple."}, {"time": 2352, "text": "One minus the other."}, {"time": 2352, "text": "Yes, x minus y."}, {"time": 2352, "text": "x is the total output, y is the consumption by the producer, therefore x minus y equals s, the surplus."}, {"time": 2360, "text": "Now, Marx argues, the minute you understand this, you will ask the following question."}, {"time": 2369, "text": "Who gets the surplus?"}, {"time": 2378, "text": "Who gets this extra stuff that is made but not consumed by those who made it?"}, {"time": 2378, "text": "And Marx's answer is, therein lies one of the great shapers of any society."}, {"time": 2387, "text": "How is that organized?"}, {"time": 2387, "text": "For example, who gets it?"}, {"time": 2394, "text": "What are they asked, if anything, to do with it in exchange for getting it?"}, {"time": 2394, "text": "What's their social role?"}, {"time": 2403, "text": "For example, here we go now, if you get this and you get the core of it anyway, and I don't charge much, the workers themselves could get it."}, {"time": 2410, "text": "The workers themselves could get it."}, {"time": 2420, "text": "That's the closest Marx comes to a definition of communism."}, {"time": 2420, "text": "Communism would be if the workers who produce the surplus together decide what to do with it."}, {"time": 2428, "text": "So this has to do not just with who gets it, but more importantly, who gets to decide who gets it."}, {"time": 2438, "text": "Well, who gets it and who gets to decide what to do with it."}, {"time": 2443, "text": "Because you can't decide it if you don't have disposition over it."}, {"time": 2449, "text": "So this is the logic of the word sequence."}, {"time": 2449, "text": "It's produced."}, {"time": 2449, "text": "Marx uses the word appropriated."}, {"time": 2449, "text": "In other words, whose property, who gets to decide, if you like, what happens."}, {"time": 2457, "text": "All that property ever meant is who gets to decide and who's excluded."}, {"time": 2464, "text": "That's a clean definition of communism."}, {"time": 2470, "text": "By the way, it's not just clean."}, {"time": 2470, "text": "This is the only one."}, {"time": 2474, "text": "So can we just linger on the definition of exploitation in that context?"}, {"time": 2480, "text": "It becomes very easy."}, {"time": 2480, "text": "Exploitation exists if and when the surplus that's produced is taken and distributed by people other than those who produced it."}, {"time": 2487, "text": "Slaves produce a surplus which the master gets."}, {"time": 2494, "text": "Serfs produce a surplus which the lord gets."}, {"time": 2494, "text": "Employees produce a surplus which the employer gets."}, {"time": 2502, "text": "These are exploitative class structures because one class produces a surplus appropriated, distributed by another group of people, not the ones who produced it, which creates hostility, enmity, envy, anger, resentment, and all of the problems you can lump under the heading class struggle."}, {"time": 2530, "text": "I use a metaphor, simple metaphorical story."}, {"time": 2538, "text": "You have two children, let's assume, and you take them to Central Park a few blocks from here."}, {"time": 2543, "text": "It's a nice day and the children are playing and in comes one of those men with an ice cream truck comes by."}, {"time": 2549, "text": "Dingalingalingaling, your children see the ice cream."}, {"time": 2549, "text": "Daddy, get me an ice cream."}, {"time": 2549, "text": "So you walk over, you take some money, and you get two ice cream cones and you give them to one of the children."}, {"time": 2561, "text": "The other one begins to scream and yell and howl, obviously."}, {"time": 2561, "text": "What's the issue?"}, {"time": 2561, "text": "And you realize you've just made a terrible mistake."}, {"time": 2569, "text": "So you order the one you gave the two ice cream cones to give one of those to your sister or your brother or whatever it is."}, {"time": 2575, "text": "And that's how you solve the problem."}, {"time": 2581, "text": "Until a psychologist comes along and says, you know, you didn't fix it by what you just did."}, {"time": 2588, "text": "You should never have done that in the first place."}, {"time": 2588, "text": "My response, so you understand, all of the efforts to deal with inequality in economic, political culture, these are all giving the ice cream cone back to the kid."}, {"time": 2605, "text": "You should never do this in the first place."}, {"time": 2610, "text": "The reallocation of resources creates bitterness in the populace."}, {"time": 2614, "text": "Look at Arva."}, {"time": 2614, "text": "This country is tearing itself apart now in a way that I have never seen in my life, and I've lived here all my life, and I've worked here all my life."}, {"time": 2619, "text": "It's tearing itself apart, and it's tearing itself apart basically over the redivision, the redistribution of wealth, having so badly distributed in the first place."}, {"time": 2633, "text": "But that's all in Marx."}, {"time": 2633, "text": "And notice as I explain to you what is going on in this tension filled production scene in the office, the factory, the store."}, {"time": 2646, "text": "I don't have to say a word about the government."}, {"time": 2646, "text": "I'm not interested in the government."}, {"time": 2650, "text": "The government's really a very secondary matter to this core question."}, {"time": 2650, "text": "And here comes the big point."}, {"time": 2658, "text": "If you make a revolution and all you do is remove the private exploiter and substitute a government official without changing the relationship, you can call yourself a Marxist all day long, but you're not getting the point of the Marxism."}, {"time": 2676, "text": "The point was not who the exploiter is, but the exploitation per se."}, {"time": 2683, "text": "You've got to change the organization of the workplace so there isn't a group that makes all the decisions and gets the surplus vis a vis another one that produces it."}, {"time": 2689, "text": "If you do that, you will destroy the whole project."}, {"time": 2695, "text": "Not only will you not achieve what you set out to get, but you'll so misunderstand it that the Germans again have a phrase, es geht schief."}, {"time": 2706, "text": "It goes crooked."}, {"time": 2706, "text": "It doesn't go right."}, {"time": 2706, "text": "The project gets off the rails because it can't understand either what its objective should have been, and therefore it doesn't understand how and why it's missing its objective."}, {"time": 2719, "text": "It just knows that this is not what it had hoped for."}, {"time": 2725, "text": "I mean there's a lot of fascinating questions here."}, {"time": 2725, "text": "So one is to what degree, so there's human nature, to what degree does communism, a lack of exploitation of the working class naturally emerge?"}, {"time": 2742, "text": "If you leave two people together in a room and come back a year later, if you leave five people together in a room, if you leave a hundred people and a thousand people, it seems that humans form hierarchies naturally."}, {"time": 2754, "text": "So the clever, the charismatic, the sexy, the muscular, the powerful, however you define that, starts becoming a leader and start to do maybe exploitation in a nonnegative sense, a more generic sense, starts to become an employer, not in a capitalist sense, but just as a human."}, {"time": 2780, "text": "Here, you go do this, and in exchange I will give you this."}, {"time": 2785, "text": "Just becomes the leadership role, right?"}, {"time": 2785, "text": "So the question is, yes, okay, it would be nice, the idea sort of of communism would be nice to not steal from the world."}, {"time": 2797, "text": "Nice in theory, but it doesn't work in practice because of human nature."}, {"time": 2801, "text": "Because of human nature."}, {"time": 2801, "text": "That's, thank you."}, {"time": 2801, "text": "So what can we say about leveraging human nature to achieve some of these ends?"}, {"time": 2808, "text": "There's so many ways of responding, in no particular order."}, {"time": 2813, "text": "Here are some of them."}, {"time": 2813, "text": "The history of the human race, as best I can tell, is a history in which a succession of social forms, forms of society, arise, and as they do, they rule out some kinds of human behavior on the grounds that they are socially disruptive and unacceptable."}, {"time": 2842, "text": "The argument isn't really then, is there a need or an instinct, is there some human nature that makes people want to do this?"}, {"time": 2850, "text": "Well, whatever that is, this has to be repressed or else we don't have a society."}, {"time": 2856, "text": "And Freud helps us to understand that that repression is going on all the time and it has consequences."}, {"time": 2863, "text": "It's not a finished project, you repress it, it's gone, it doesn't work like that."}, {"time": 2869, "text": "So for example, when you get a bunch of people together at some point, they may develop animosities towards one another that lead them to want the other person or persons to disappear, to be dead, to be gone."}, {"time": 2882, "text": "But we don't permit you to do that."}, {"time": 2891, "text": "We just don't."}, {"time": 2891, "text": "Every economic system that has ever existed has included people who defend it on the grounds that it is the only system consistent with human nature and that every effort to go beyond it has to fail because it contradicts human nature."}, {"time": 2909, "text": "I can show you endless documents of every tribal society I've ever studied, every anthropological community that has ever been studied, slavery wherever it's existed."}, {"time": 2924, "text": "I can show you endless documents in which the defenders of those systems, not all of them of course, but many defenders used that argument."}, {"time": 2936, "text": "To naturalize a system is a way to hold on to it, to prevent it from going, to counter the argument that every system is born, every system evolves, and then every system dies."}, {"time": 2952, "text": "And therefore capitalism, since it was born and since it's been developing, we all know what the next stage of capitalism is."}, {"time": 2959, "text": "The burden is on the people who think it isn't going to die."}, {"time": 2966, "text": "Okay, so it doesn't mean they're wrong, but what you're saying is if we look at history, you're deeply suspicious of the argument this is going against human nature because we keep using that for basically everything including toxic relationship, toxic systems, destructive systems."}, {"time": 2982, "text": "That said, well, let me just ask a million different questions."}, {"time": 2982, "text": "So one, what about the argument that sort of the employer, the capitalist takes on risk versus the employee who's just there doing the labor?"}, {"time": 3001, "text": "The capitalist is actually putting up a lot of risk."}, {"time": 3001, "text": "Are they not in sort of aggregating this organization and taking this giant effort, hiring a lot of people?"}, {"time": 3015, "text": "Aren't they taking on risk that this is going to be a giant failure?"}, {"time": 3015, "text": "So first of all, there's risk almost in everything you undertake."}, {"time": 3022, "text": "Any project that begins now and ends in the future takes a risk that between now and that future something's going to happen that makes it not work out."}, {"time": 3028, "text": "I mean, I got into a cab before I came here today."}, {"time": 3034, "text": "In order to do this with you, I took a risk."}, {"time": 3034, "text": "The cab could have been in an accident."}, {"time": 3042, "text": "The lightning could have hit us."}, {"time": 3042, "text": "A bear could have eaten my left foot."}, {"time": 3046, "text": "But shouldn't I reward you for the risk you took?"}, {"time": 3046, "text": "No, hold it a second."}, {"time": 3051, "text": "Let's do this step by step."}, {"time": 3051, "text": "So everybody's taking a risk."}, {"time": 3051, "text": "I always found it wonderful."}, {"time": 3057, "text": "You talk about risk and then you imagine it's only some of us who take a risk."}, {"time": 3057, "text": "Let's go with the worker, with the capitalist."}, {"time": 3063, "text": "That worker, he moved his family from Michigan to Pennsylvania to take that job."}, {"time": 3072, "text": "He made a decision to have children."}, {"time": 3072, "text": "They are teenagers."}, {"time": 3072, "text": "They're now in school at a time when their friendships are crucial to their development."}, {"time": 3080, "text": "You're going to yank them out of the school because his job is gone."}, {"time": 3085, "text": "He took an enormous risk to do that job every day, to forestall all the other things he could have done."}, {"time": 3095, "text": "He was taking a risk that this job would be here tomorrow, next month, next year."}, {"time": 3101, "text": "He bought a house, which Americans only do with mortgages, which means he's now stuck."}, {"time": 3108, "text": "He has to make a monthly payment."}, {"time": 3108, "text": "If you make a mistake, you capitalist."}, {"time": 3108, "text": "He's the one who's going to, you're a capitalist."}, {"time": 3117, "text": "You got a lot of money."}, {"time": 3117, "text": "Otherwise, you wouldn't be in that position."}, {"time": 3120, "text": "You've got a cushion."}, {"time": 3120, "text": "He doesn't."}, {"time": 3120, "text": "If you investigate, you'll see that in every business I've ever been in."}, {"time": 3128, "text": "I've been involved in a lot of them."}, {"time": 3128, "text": "So you think it's possible to actually measure risk or is your basic argument is there's risk involved in a lot of both the working class and the bourgeoisie, the capitalists."}, {"time": 3137, "text": "And the worker would never come and say, because he's been taught right, I want this payment, a wage for the work I do."}, {"time": 3152, "text": "And I want this page, this payment for the risk I take."}, {"time": 3152, "text": "Well, there's some level of communication like that."}, {"time": 3159, "text": "You have acknowledgement of dangerous jobs, but that's probably built into the salary, all those kinds of things."}, {"time": 3164, "text": "But you're not incorporating the full spectrum of risk."}, {"time": 3170, "text": "You don't believe that."}, {"time": 3170, "text": "This country is now being literally transformed from below by an army of workers who work at Amazon, fast food joints."}, {"time": 3177, "text": "You know what their complaint is?"}, {"time": 3177, "text": "It's killing us."}, {"time": 3185, "text": "We get paid shit and it's killing us."}, {"time": 3185, "text": "There is no relationship except in the minds of the defenders of capitalism between the ugliness, the difficulty, the danger of labor on the one hand and the wage."}, {"time": 3201, "text": "Let me give you just a couple of examples."}, {"time": 3201, "text": "This is my job."}, {"time": 3201, "text": "This is my life, what I do."}, {"time": 3206, "text": "The median income of a child care worker in the United States right now, as we speak, is $11.22 an hour median."}, {"time": 3213, "text": "So 50% make less, 50% make more."}, {"time": 3213, "text": "The median income for car park attendant is several dollars per hour higher than that."}, {"time": 3226, "text": "What does the car park attendant do?"}, {"time": 3226, "text": "He stares at your car for many hours to make sure that nobody comes and grabs it."}, {"time": 3233, "text": "Maybe he parks it and he moves it and he moves it around to get it in and out."}, {"time": 3242, "text": "By any measure that I know of that makes any rational sense, being in charge of toddlers, two, three, four year olds who are at the key moment of mental formation the first five years, to give that a lower salary than you give the guy who watches your car."}, {"time": 3263, "text": "Come on, I know how to explain it."}, {"time": 3263, "text": "Gender explains all kinds of issues that the car park people are males and the day the child care people are females."}, {"time": 3271, "text": "And that in our culture is a very big marker of what, but the one who said only the economics professor, nobody else says this stuff because in economics, I don't know if you were familiar with our profession, but we have something which we call marginal product."}, {"time": 3290, "text": "This is a fantasy."}, {"time": 3290, "text": "I was a mathematician."}, {"time": 3290, "text": "Before I became an economist, I loved mathematics."}, {"time": 3298, "text": "I specialized in mathematics."}, {"time": 3298, "text": "So I know mathematics pretty well."}, {"time": 3305, "text": "What economists do is silly, is childish, but they think it's mathematics."}, {"time": 3313, "text": "But think for a minute what it means to suggest that you can identify the marginal product of a factor of production, like a worker."}, {"time": 3322, "text": "In the textbook when it's taught, I've taught this stuff."}, {"time": 3330, "text": "I hold my nose, but I teach it."}, {"time": 3330, "text": "Then I explain to students what I've just taught you is horse shit, but first I teach it."}, {"time": 3335, "text": "What is the marginal product if it might be useful?"}, {"time": 3339, "text": "The notion is if you take away one worker right now from the pile, what will be the diminution of the output?"}, {"time": 3346, "text": "That's the marginal product of that worker measured by the amount of the output that diminishes output of the raw product of the product."}, {"time": 3354, "text": "Usually in real terms or physical, not the value."}, {"time": 3361, "text": "You could do a value, but it's really more the physical you're at."}, {"time": 3365, "text": "I mean, there is a transformation thing."}, {"time": 3365, "text": "I'd love to talk to you about value."}, {"time": 3371, "text": "What is value?"}, {"time": 3371, "text": "I'd be glad to talk to you about value and price and all of that, but I just want to get to this."}, {"time": 3376, "text": "Hegel, who was Marx's teacher, has a famous line."}, {"time": 3383, "text": "You can't step in the same river twice."}, {"time": 3383, "text": "The argument is you and the river have changed between the first and the second time."}, {"time": 3390, "text": "It's a different you and it's a different river."}, {"time": 3394, "text": "You can choose not to pay attention to that."}, {"time": 3394, "text": "You can't claim you're not doing that."}, {"time": 3399, "text": "You can't claim that you can actually do that because you can't."}, {"time": 3399, "text": "There is no way to do that."}, {"time": 3404, "text": "So the meaning that you can't just remove a worker and have a clean mathematical calculation of the effect that it has on the output."}, {"time": 3412, "text": "That's right, because too many other things are going on, too many things are changing, and you cannot assume, much as you want to, that the outcome on the output side is uniquely determined by the change you made on the input side."}, {"time": 3430, "text": "Even in the average, it's not going to work out."}, {"time": 3434, "text": "You can take, look, mathematics is full of abstractions."}, {"time": 3434, "text": "You can say, as we do in economics, keteris paribus, everything else held constant, but you have to know what you just did."}, {"time": 3440, "text": "You know why you do that?"}, {"time": 3447, "text": "Because you can't do that in the real world."}, {"time": 3447, "text": "You better account for that, otherwise you're mistaking the abstraction from the messy reality you abstracted from to get the abstraction."}, {"time": 3459, "text": "As a quick tangent, if we somehow went through a thought experiment or an actual experiment of removing every single economist from the world, would we be better off or worse off?"}, {"time": 3471, "text": "Much better off."}, {"time": 3471, "text": "Economics, and I'm one, you know, I'm talking about myself."}, {"time": 3477, "text": "We're going to ship all the economists to Mars and see how well it works off."}, {"time": 3483, "text": "The serious part of this is that economics, it's really about capitalism."}, {"time": 3483, "text": "Economics as a discipline is born with capital."}, {"time": 3492, "text": "There was no such thing."}, {"time": 3492, "text": "I teach courses at the university, for example, called History of Economic Thought."}, {"time": 3498, "text": "I begin the students with Aristotle and Plato."}, {"time": 3504, "text": "And I say, you know, they talked about really interesting things, but they never called it economics."}, {"time": 3510, "text": "It made no sense to people to abstract something as central to daily life as economics broadly defined."}, {"time": 3520, "text": "That's a creation much, much later."}, {"time": 3520, "text": "That's capitalism that did that, created the field."}, {"time": 3526, "text": "So when I give them Plato and Aristotle, I have to give them particular passages."}, {"time": 3532, "text": "By the way, footnote, because your audience will like it."}, {"time": 3532, "text": "Plato and Aristotle talked about markets because they lived at a time in ancient Greece when market relations were beginning to intrude upon these societies."}, {"time": 3544, "text": "So they were both interested in this phenomena, that we're not just producing goods and then distributing among us."}, {"time": 3552, "text": "We're doing it in a quid pro quo."}, {"time": 3558, "text": "You know, I'll give you three oranges, you give me two shirts, a market exchange."}, {"time": 3563, "text": "And both Aristotle and Plato hated markets, denounced them, and for the same reason, they destroy social cohesion."}, {"time": 3569, "text": "They destroy community."}, {"time": 3569, "text": "They make some people rich and other people poor, and they set us against each other, and it's terrible."}, {"time": 3576, "text": "And here's what that they agreed on that."}, {"time": 3581, "text": "Here's what they disagreed on."}, {"time": 3581, "text": "One of them said, okay, there can be no markets."}, {"time": 3586, "text": "That was Plato."}, {"time": 3586, "text": "Aristotle comes back and says, no, no, no, no, no, too late for that."}, {"time": 3593, "text": "The disruption caused in society by getting rid of this institution that has crawled in amongst us would be too devastating."}, {"time": 3600, "text": "So we can't do that."}, {"time": 3600, "text": "But what we can do is control it, regulate it, get from the market what it does reasonably well, and prevent it from doing the destructive things it does so badly."}, {"time": 3616, "text": "So the fundamentally the destructive thing of a market is it's the engine of capitalism, so it creates exploitation of the worker."}, {"time": 3623, "text": "It facilitates it, and it is an institution that Plato and Aristotle feel is a terrible danger to community."}, {"time": 3632, "text": "Which, by the way, is a way of thinking about it that exists right now all over the world."}, {"time": 3645, "text": "Look, the medieval Catholic Church had a doctrine, the prohibition of usury."}, {"time": 3653, "text": "You know, and this was that God said, if there's a person who needs to borrow from you, then that's a person in need."}, {"time": 3659, "text": "And the good Christian thing to do is to help him."}, {"time": 3659, "text": "To demand an interest payment rather than to help your fellow man is, God hates you for that."}, {"time": 3667, "text": "That's a sin."}, {"time": 3676, "text": "Jesus is crying all the way to wherever it is he goes."}, {"time": 3679, "text": "But would Jesus be crying when you try to scale that system?"}, {"time": 3679, "text": "So that has to do with the with the intimate human interaction."}, {"time": 3686, "text": "The idea of markets is you're able to create a system that involves thousands, millions of humans, and there'd be some level of safe, self regulating fairness."}, {"time": 3706, "text": "There might be, but it's hard to imagine that charging interest would be the way to do that."}, {"time": 3712, "text": "I wonder what, so I guess..."}, {"time": 3713, "text": "Suppose you were interested in having, suppose you took us your problem."}, {"time": 3720, "text": "We have a set of funds that can be loaned out."}, {"time": 3724, "text": "People don't want to consume it."}, {"time": 3724, "text": "They're ready to lend it."}, {"time": 3724, "text": "To whom should they lend it?"}, {"time": 3731, "text": "Well, we could say in our society, we're going to run this the way professors in institutions like MIT work this."}, {"time": 3736, "text": "They write up a project."}, {"time": 3736, "text": "They send the project into some government office where it is looked at against other projects."}, {"time": 3744, "text": "And this office in the government decides we're going to fund this one and that one because they're more needed in our society."}, {"time": 3758, "text": "We're in greater need of solving this problem than that problem."}, {"time": 3758, "text": "And so we're going to lend money to people working on this problem more readily or more money than we lend over here, because we're going to, but instead what we do is, who can pay the highest interest rate?"}, {"time": 3775, "text": "Whoa, what are you doing?"}, {"time": 3775, "text": "What ethics would justify you doing?"}, {"time": 3775, "text": "It's like a market in general."}, {"time": 3782, "text": "Something is in shortage."}, {"time": 3782, "text": "All markets are about how to handle shortage."}, {"time": 3782, "text": "That's one basic way to understand it."}, {"time": 3788, "text": "And so if the demand is greater than the supply, which is all the word shortage means, has no other meaning, if the demand is greater than the supply, okay, now you've got a problem."}, {"time": 3800, "text": "You can't satisfy all the demanders because you don't have enough supply."}, {"time": 3800, "text": "You have a shortage."}, {"time": 3807, "text": "Okay, now how are you going to do it?"}, {"time": 3807, "text": "In a market, you allow people who have a lot of money to bid up the price of whatever's short, and that solves your problem because as the price goes up, the poor people, they drop out."}, {"time": 3820, "text": "They can't buy the thing at the exalted price, so you've got a way of distributing the shortage."}, {"time": 3827, "text": "It goes to the people with the most money."}, {"time": 3827, "text": "At this point, most human beings confronted with this explanation of a market would turn against it because it contradicts their Christian, Judaic, Islamic, all of them would say, what?"}, {"time": 3840, "text": "You know what that means?"}, {"time": 3847, "text": "It means that a rich person can get the scarce milk and give it to their cat, while the poor person has no milk for their five children."}, {"time": 3853, "text": "You want a market?"}, {"time": 3859, "text": "The fundamental thing that seems unfair, there's the resulting inequality."}, {"time": 3859, "text": "Now... Or death."}, {"time": 3866, "text": "Or death."}, {"time": 3866, "text": "Well, that's the ultimate inequality."}, {"time": 3872, "text": "What about, and we're going to jump around from the philosophical, from the economics, to the sort of debate type of thing."}, {"time": 3876, "text": "What about sort of the lifting ties raise all boats?"}, {"time": 3885, "text": "Meaning, if we look at the 20th century, a lot of people, maybe you disagree with this, but they attribute a lot of the innovation and the average improvement in the quality of life to capitalism, to inventions and innovation, to engineering and science developments that resulted from competition and all those kinds of forces."}, {"time": 3909, "text": "So, not looking at the individual unfairness of exploitation as it's specifically defined, but just observing historically."}, {"time": 3924, "text": "Looking at the 20th century, we came up with a lot of cool stuff that seemed to have made life easier and better on average."}, {"time": 3928, "text": "What do you say to that?"}, {"time": 3935, "text": "I have several responses to that, but I do disagree pretty fundamentally with what's going on there."}, {"time": 3942, "text": "But let me give you the arguments so that you can hear them, and then you can evaluate them, as can anybody who's listening or watching."}, {"time": 3956, "text": "Marx was a student of Hegel, and one of Hegel's central arguments was that everything that exists exists, quote, in contradiction."}, {"time": 3961, "text": "In simple English, there's a good and bad side, if you like, to everything."}, {"time": 3969, "text": "And you won't understand it unless you accept that proposition and start looking for the good things that are the other side of the bad ones, and the bad things that are the other side of the good ones, etc."}, {"time": 3980, "text": "So, the dialectic."}, {"time": 3980, "text": "And Marx, very attentive to that, explicitly agrees with this on many occasions, and applies it, of course, to the central object of his research, capitalism."}, {"time": 3993, "text": "So, this is not a simple minded fellow who's telling you all the bad things about capitalism as if there were nothing that this system achieved or accomplished."}, {"time": 4005, "text": "And one of the things he celebrates a lot is the technological dynamism of the system, which Marx takes to be profound, because, you know, he lived at the time when major breakthroughs in textile technology and mining and chemistry and so on were achieved."}, {"time": 4030, "text": "But as to the notion that capitalism is therefore responsible for the improvement in the quality or the standard of living of the mass of people, Marx now comes back and says, oh wait, wait a minute here."}, {"time": 4043, "text": "Number one, capitalism as a system has been mostly represented by capitalists, which makes a certain sense."}, {"time": 4056, "text": "And those capitalists, with very few exceptions, some but very few, have fought against every effort to improve the lives of the mass of people."}, {"time": 4071, "text": "The goal of a capitalist is to minimize labor costs."}, {"time": 4071, "text": "What that means is replace a worker with a machine, move the production from expensive U.S. to cheap China, bring in desperate immigrants from other parts of the world, because they will work for less money than the folks that you have here at home."}, {"time": 4091, "text": "Every measure to help the standard of living of American workers had to be fought for, had to be fought for, for decades over the opposition of capitalists from the beginning to right now."}, {"time": 4106, "text": "The reason we have a minimum wage, which was passed in the middle of the 1930s, when it was proposed, it was blocked by capitalists."}, {"time": 4112, "text": "They got together."}, {"time": 4112, "text": "And today, just a factoid for you, the last time the minimum wage was raised in the United States, federal minimum wage, was in 2009, when it was set at the lofty sum of $7.25 an hour, which you cannot live on."}, {"time": 4136, "text": "Over the last 12 years or so, whatever it is now, 11, 12, 13 years since then, we have had an increase in the price level in this country every year."}, {"time": 4144, "text": "And in the last year, 8.5%."}, {"time": 4150, "text": "During that time that the prices went up, the minimum wage was never raised."}, {"time": 4159, "text": "This is a time of stock market boom, of growing inequality."}, {"time": 4159, "text": "This is the nerve of the defender of capitalists, who wants now to get credit for the improvement in the standard of life of the workers that was fought by every generation."}, {"time": 4179, "text": "You know, it takes your breath away."}, {"time": 4185, "text": "It's an argument."}, {"time": 4185, "text": "But I take my hat off if I had one, because that is one of the only ways to justify this system."}, {"time": 4211, "text": "And that's the worst moral condemnation imaginable."}, {"time": 4211, "text": "How do you justify that when you could, you didn't?"}, {"time": 4220, "text": "Look, let me get at it another way, because this may interest you anyway."}, {"time": 4227, "text": "The issue is not that capitalism isn't technologically dynamic."}, {"time": 4235, "text": "And along the way, it has developed things that have helped people's lives get better."}, {"time": 4259, "text": "Imagine a production process in which you have $100 that the capitalist has to lay out for tools, equipment, and raw materials, and $100 that he has to lay out for workers, hire the workers."}, {"time": 4274, "text": "And he puts them all together, and he has an output."}, {"time": 4280, "text": "And let's say the output is 100 units of something, or whatever the price is, and that's his revenue."}, {"time": 4302, "text": "And he takes $100 of it and replaces the tools, equipment, and raw materials he used up, another $100 to hire the workers for the next shift, and the other $20 is his profit, and he puts that aside."}, {"time": 4314, "text": "Now along comes a technological breakthrough, a machine, a new machine."}, {"time": 4320, "text": "And the new machine is so effective, you can get the same number of units of output with half the workers."}, {"time": 4327, "text": "So you don't need to spend $100 on workers."}, {"time": 4333, "text": "You only need to spend $50."}, {"time": 4333, "text": "You can do it with half the workers."}, {"time": 4345, "text": "Don't come back Monday morning."}, {"time": 4345, "text": "I don't need you."}, {"time": 4345, "text": "It's nothing personal."}, {"time": 4345, "text": "I got a machine."}, {"time": 4351, "text": "Why does he do that?"}, {"time": 4351, "text": "Because of the $50 he now no longer has to spend on labor, because he doesn't need half of them."}, {"time": 4358, "text": "He keeps."}, {"time": 4358, "text": "Everything else is the same."}, {"time": 4358, "text": "The machine, everything else is just to make the math easy."}, {"time": 4364, "text": "So he keeps as his own profit the $50 that before he paid for those workers."}, {"time": 4372, "text": "Because when he sells it for $220, that $50 he doesn't have to give to the next job because he has a new machine."}, {"time": 4378, "text": "So that's what he does."}, {"time": 4378, "text": "The technology leads."}, {"time": 4378, "text": "He's happy."}, {"time": 4378, "text": "He's become more profitable."}, {"time": 4386, "text": "He's got an extra $50, which is why he buys the machine."}, {"time": 4386, "text": "The workers are screwed."}, {"time": 4393, "text": "Half of them just lost their job, have to go home to their husband and wife, tell them I don't have a job anymore."}, {"time": 4400, "text": "I didn't do anything wrong."}, {"time": 4400, "text": "The guy was nice enough to say it was nothing wrong with me, but he doesn't need it."}, {"time": 4405, "text": "So I'm completely screwed here."}, {"time": 4405, "text": "I don't know what I'm going to do about the debts we have, the house on mortgage, my children's education, or whatever else he's got going for himself."}, {"time": 4416, "text": "Now the point."}, {"time": 4416, "text": "There was, of course, an alternative path."}, {"time": 4423, "text": "The alternative path would have been to keep all the workers, pay them exactly the same that you did before, for half a day's work."}, {"time": 4429, "text": "You would have got the same output, same revenue, same profit as before."}, {"time": 4438, "text": "But the gain of the technology would have been a half a day of freedom every day of the lives of these workers."}, {"time": 4446, "text": "The majority of workers would have been really helped by this technology."}, {"time": 4455, "text": "But instead they were screwed so that one guy, the employer, could make a big bundle of more money."}, {"time": 4463, "text": "You want to support a system like this?"}, {"time": 4463, "text": "Well, to go back to Hegel, the good and the bad."}, {"time": 4472, "text": "So you just listed the bad and you also first listed the good, the technological innovation of this kind of system."}, {"time": 4477, "text": "The question is the alternative, whatever, as we try to sneak up to ideas of what the alternative might look like, what are the good and the bad of the alternative?"}, {"time": 4488, "text": "So you just kind of, as a opposite, by contrast, showed that, well, a nice alternative is you work less, get paid the same, you have more leisure time, opportunity to pursue other interests, the creative interests, family, flourish as a human being, basically strengthen and embolden the basic humanity that's under all of us."}, {"time": 4515, "text": "But then what cost does that have on the deadline fueled, competition fueled machine of technological innovation that is the positive side of capitalism?"}, {"time": 4536, "text": "Slows it down."}, {"time": 4537, "text": "It slows it down."}, {"time": 4537, "text": "And the question is which is more important for the flourishing of humanity?"}, {"time": 4544, "text": "And I'd love there to be a democratic mechanism."}, {"time": 4544, "text": "So let's discuss it, let's debate it, and then let's decide what mixture, because it's not either or, the math problem I gave you is either or, we could mix it."}, {"time": 4557, "text": "You could have a third less of a working day instead of a half less, and then the other part would be extra profit for our employer, etc."}, {"time": 4568, "text": "etc."}, {"time": 4568, "text": "So let's have a democratic discussion of what is the mix between the positive, and we have no such thing."}, {"time": 4576, "text": "All of this is decided by one side in this debate, which not only, we know what they do, they always choose the one that maximizes their profit because that's what they were told to do in business school where I've taught."}, {"time": 4587, "text": "So not only is it an undemocratic decision, but it's lopsided to boot."}, {"time": 4594, "text": "So we don't have the opportunity, but I would love for us to be good Hegelian Marxists and say, let's take a look at the plus and the minus and make the best decision that we can."}, {"time": 4606, "text": "We'll make mistakes, but we'll all make them together."}, {"time": 4606, "text": "It won't be one of us making a dictatorial decision."}, {"time": 4613, "text": "You know, Marx developed the notion of the dictatorship of the proletariat, not as a notion of how government works, but as a notion of what the practical reality is."}, {"time": 4630, "text": "The dictatorship in these key decisions is not made by some sitting council, it's made by each little capitalist in his or her relationships with the workers in the workplace, which is why Marx focused his analysis on that point."}, {"time": 4642, "text": "And by the way, I can sketch for you right now so it doesn't lurk in the background what the alternative is."}, {"time": 4648, "text": "It goes right back to what I said earlier."}, {"time": 4654, "text": "The workers themselves, the collection of employees together appropriate their own surplus and decide democratically what to do with it, which includes the decision of whether or not to buy a machine and whether or not to use the machine and the savings it might allow to be handled by more leisure for themselves or as a fund for new developments in technology or new products or whatever they want."}, {"time": 4692, "text": "And you know, this is an old idea in humans."}, {"time": 4692, "text": "Marx loved that."}, {"time": 4700, "text": "Toward the end of his life, he started reading extensively in anthropology."}, {"time": 4700, "text": "And one of the reasons he did that toward the end of his life was because he kept discovering that in this society and that one, including here in the United States, that there were examples of people who organized their production in precisely this way, as a collective democratic community in which everybody had an equal voice."}, {"time": 4730, "text": "So we all together decide democratically what to produce, how to produce, where to produce, and what to do with the output we all help to produce."}, {"time": 4736, "text": "So let's do it in, you know, in this country where democracy is a value nearly everybody subscribes to."}, {"time": 4753, "text": "Think about it this way, the stunning contradiction that there is a place in our society where democracy has never been allowed to enter."}, {"time": 4760, "text": "The workplace."}, {"time": 4760, "text": "In the workplace, a tiny group of people, unaccountable to the rest of us, the employer, whether that's an individual, a family, a partnership, or a corporate board of directors, tiny group of people controls economically a vast mass of employees."}, {"time": 4783, "text": "Those employees don't elect those people, have no nothing."}, {"time": 4783, "text": "There is no accountability."}, {"time": 4789, "text": "It is the most undemocratic arrangement imaginable."}, {"time": 4789, "text": "And this society insists on calling itself democratic when it has organized the minor matter of producing everything in a way that is the direct, it's autocratic."}, {"time": 4804, "text": "So to push back on a few things."}, {"time": 4811, "text": "So one is the idea of this society calling itself democratic is that the government is elected democratically and the government is able to pressure the workplace through the process of regulation."}, {"time": 4824, "text": "You pass laws of the boundaries of how, you know, minimum wage, all those kinds of things."}, {"time": 4831, "text": "That's the one idea."}, {"time": 4831, "text": "The other is there is a natural force within the capitalist when there's no monopolies of competition being the accountability."}, {"time": 4837, "text": "So if you're a shitty boss, the employee in the capitalist system has the freedom to move to another company, work for a better boss."}, {"time": 4850, "text": "So that creates pressure on the employers and the bosses."}, {"time": 4850, "text": "That's at least the idea that there's two boundaries of you not misbehaving."}, {"time": 4856, "text": "One is the law, so regulations passed by the government, democratic."}, {"time": 4865, "text": "And the second is because there's always alternatives, in theory, then that puts pressure on everyone to behave well because you can always leave."}, {"time": 4879, "text": "So, I mean, that's kinds of accountability."}, {"time": 4879, "text": "But what you're saying is that does not result in a significant enough accountability for the employer that avoids exploitation of the worker."}, {"time": 4892, "text": "WOLFF Absolutely."}, {"time": 4892, "text": "I mean, whatever accountability you get in those mechanisms."}, {"time": 4892, "text": "And let me respond to that and then I'll counterargument."}, {"time": 4899, "text": "First, competition."}, {"time": 4899, "text": "Here again, we have to be Hegelians just a little."}, {"time": 4908, "text": "Competition destroys itself."}, {"time": 4916, "text": "If I can produce the same product as the other guy, either a better quality or a lower price or maybe both, then I win because the customers will come to me because my price is lower or my quality is better, and they'll leave the other guy, he'll go out of business."}, {"time": 4932, "text": "Now, let's follow."}, {"time": 4932, "text": "When he goes out of business, because I've won the competition, he fires his workers."}, {"time": 4937, "text": "I hire them because I'm now going to be able to serve a market he can't serve anymore."}, {"time": 4945, "text": "So I'm going to buy the used equipment, and thereby many become few."}, {"time": 4954, "text": "Monopoly is the product of competition."}, {"time": 4954, "text": "It's not the antithesis, it's the product."}, {"time": 4961, "text": "LAROI Well, let's see."}, {"time": 4963, "text": "WOLFF That's where it comes from."}, {"time": 4964, "text": "LAROI There's another element to the system where there's always a new guy that comes in."}, {"time": 4968, "text": "WOLFF There isn't."}, {"time": 4971, "text": "LAROI Well, that's the dream."}, {"time": 4971, "text": "The entrepreneurial spirit of the United States, for example, of a capitalist system is you can be broke and one day have a strong idea and build up a business that takes on Google and Facebook and Twitter and all the different car, Ford, GM, which is what you look at Tesla, for example."}, {"time": 4994, "text": "One of the many ideals of the American dream is you can move from dirt poor to being the richest person in the world."}, {"time": 5010, "text": "WOLFF Right."}, {"time": 5011, "text": "LAROI It can happen."}, {"time": 5013, "text": "WOLFF It can happen."}, {"time": 5014, "text": "WOLFF You know what that's like?"}, {"time": 5014, "text": "That's like you can win a lottery."}, {"time": 5017, "text": "LAROI No, that's not quite."}, {"time": 5017, "text": "No, the lottery is complete luck."}, {"time": 5017, "text": "Here, you can work your ass off if you have a good idea."}, {"time": 5024, "text": "WOLFF The odds are better in the lottery."}, {"time": 5026, "text": "LAROI That's not true."}, {"time": 5026, "text": "There's a lot of new businesses."}, {"time": 5029, "text": "WOLFF How many Teslas do you know?"}, {"time": 5032, "text": "LAROI Tesla is a really bad example because the car company, the automotive sector is so difficult."}, {"time": 5034, "text": "They operate at such a thin margin of profit."}, {"time": 5043, "text": "They're probably a good example of capitalism just completely coming to a halt in terms of lack of innovation."}, {"time": 5050, "text": "That's a very complicated industry because of the supply chain."}, {"time": 5056, "text": "WOLFF Come on."}, {"time": 5056, "text": "They have their uniqueness as you're quite right, but so does every other industry."}, {"time": 5063, "text": "The one thing that's common is that many become few."}, {"time": 5063, "text": "What you can also have is when you have a few, they jack up the price."}, {"time": 5069, "text": "They make an enormous profit."}, {"time": 5069, "text": "In the irony of capitalism, Marx would love this, they begin to incentivize people to break into this industry because the few remaining are making a wild amount of profit because they are a few and can jigger the market to make it work like that for them."}, {"time": 5104, "text": "That's what they're there for."}, {"time": 5109, "text": "PEDRO But yeah, to push back a little bit also, because this is a question also, do you think we're in danger of oversimplifying capitalism that completely removes the basic decency of human beings?"}, {"time": 5122, "text": "If you give me a choice to press a button to get rid of the competition, but that's going to lead to a lot of suffering, there's a lot of people at the heads of companies that won't press that button."}, {"time": 5138, "text": "That it's not in the calculation, it's not just money, it's human well being too."}, {"time": 5148, "text": "PEDRO Yes."}, {"time": 5150, "text": "PEDRO You and I don't live in the same place then."}, {"time": 5153, "text": "PEDRO So you're saying that the forces of capitalism take over the minds of the people at the top, and then they cease being human."}, {"time": 5161, "text": "PEDRO No."}, {"time": 5162, "text": "PEDRO Depending on your model of humans."}, {"time": 5167, "text": "PEDRO Yeah."}, {"time": 5168, "text": "PEDRO They lose track of the better angels of their nature, and they just become cogs in the machine, but they just happen to be the cock at the top."}, {"time": 5175, "text": "PEDRO I would put it differently."}, {"time": 5175, "text": "The system is so set up, it's a little bit like natural selection."}, {"time": 5198, "text": "They went there and they said, I'm not doing this anymore."}, {"time": 5205, "text": "I'm not going to treat people like that."}, {"time": 5216, "text": "But the system selects the firm."}, {"time": 5216, "text": "If you don't do what has to be done to make the profit go up, you're toast there anyway."}, {"time": 5224, "text": "The rest of the people who vote for you are going to kick you out."}, {"time": 5230, "text": "You can tell them all day long what a lovely person you are."}, {"time": 5235, "text": "Then they're going to look at you and wonder what happened to you."}, {"time": 5235, "text": "How did you even get this far with the lovely person horseshoe?"}, {"time": 5239, "text": "RL It's not necessarily just a lovely person."}, {"time": 5254, "text": "So I think a lot of the things we're talking about is when there's not much innovation in the system."}, {"time": 5276, "text": "There's the electric period, the chemistry period, the nuclear period."}, {"time": 5276, "text": "There's now whatever you want to call it, the artificial intelligence or robotics or computer."}, {"time": 5281, "text": "It comes, and then there's a flurry as everything is reorganized around whatever the newest technology is, and then you have a period where you can get excited about that, and the very rich people who come to the top can talk endlessly, as they always do, about innovation."}, {"time": 5321, "text": "RL Please, please."}, {"time": 5321, "text": "RL No, no, no, I don't."}, {"time": 5338, "text": "That's what its defenders would like to have us believe."}, {"time": 5343, "text": "But if anything, I would argue the opposite, that it is such a contradiction to parts of our nature, not other parts, that it can never quite make it."}, {"time": 5358, "text": "There's always going to be the people who don't go along with it, people you're talking about, who do quit along the way, or maybe a few of them actually make it to the top by god knows what hook or what crook that they did it."}, {"time": 5372, "text": "Because their humanity is contradicted by what it is they're being asked to do."}, {"time": 5388, "text": "They're already out of whack."}, {"time": 5398, "text": "I mean, the average CEO pay is now three, three hundred times what the average worker pay is."}, {"time": 5404, "text": "But they're jacking it up even more."}, {"time": 5404, "text": "Because that's what's happening in their universe."}, {"time": 5413, "text": "Which, of course, is true, but is no comfort for the mass of people who aren't CEOs, for whom this argument isn't very exciting."}, {"time": 5422, "text": "So they're doing that at a time when the American people can't cope."}, {"time": 5422, "text": "They've just gone through the COVID disaster."}, {"time": 5432, "text": "They've gone through the second worst economic crash of capitalism in our history."}, {"time": 5438, "text": "After two years of this one, two punch, they got an inflation, a third punch, and we are now predicting rising interest rates and a recession at the end of the year or early next year."}, {"time": 5450, "text": "You can't do this to a working class."}, {"time": 5450, "text": "When this was done to the German working class in the 1920s, Hitler was the result."}, {"time": 5455, "text": "You keep doing that in this country, we're already watching it, you're going to get that too."}, {"time": 5462, "text": "You're already getting bits and pieces."}, {"time": 5467, "text": "You can't keep doing it."}, {"time": 5467, "text": "So there's a quiet suffering amidst the working class that's growing."}, {"time": 5471, "text": "Horror."}, {"time": 5472, "text": "Some little 18 year old kid who has to go three hours in his car and blow away people in a supermarket."}, {"time": 5476, "text": "And it happens every day in this country."}, {"time": 5486, "text": "So that anger rises up in those little ways now and then bigger and bigger potentially."}, {"time": 5493, "text": "By the way, there's one more thing on the rationality."}, {"time": 5493, "text": "And this goes to Elon Musk."}, {"time": 5500, "text": "If you're interested, 49,000 people were killed in automobile accidents this last year."}, {"time": 5500, "text": "The number was just released yesterday."}, {"time": 5507, "text": "49,000."}, {"time": 5507, "text": "Automobiles are the single largest pollutant in the country."}, {"time": 5514, "text": "They use up an enormous amount of energy."}, {"time": 5514, "text": "They use up enormous amount of resources."}, {"time": 5521, "text": "There is a way to make transportation much more rational."}, {"time": 5521, "text": "And we've known it for decades."}, {"time": 5521, "text": "It's called mass transportation."}, {"time": 5527, "text": "It's a really beautifully maintained, crystal clear, clean, frequent system of buses, trains, street trolleys, vans."}, {"time": 5535, "text": "It could easily be done in this society."}, {"time": 5545, "text": "In fact, I once did a project that I estimated cost $30 billion."}, {"time": 5545, "text": "That's less than we're sending to Ukraine to do this, to reconfigure it."}, {"time": 5555, "text": "A public transit system where?"}, {"time": 5557, "text": "Everywhere in this country."}, {"time": 5557, "text": "All the major metropolitan."}, {"time": 5557, "text": "This country's overwhelmingly metropolitan area."}, {"time": 5562, "text": "Well, it clearly has to be more than 30 billion, but... Well, it was a few years ago."}, {"time": 5567, "text": "But you're saying it's a little bit more than 30 billion."}, {"time": 5570, "text": "But I'm using a lot of this."}, {"time": 5570, "text": "It's not crazy stuff."}, {"time": 5577, "text": "It's a reasonable number."}, {"time": 5579, "text": "Hey, listen, but there's a... Let me just finish the point."}, {"time": 5583, "text": "So I'm trying to be rational here."}, {"time": 5583, "text": "If we have a climate crisis, which everyone tells me we do, if it's got a lot to do with fossil fuels, which everybody tells me it has to do, and with the use of the fossil fuel, particularly for the automobile, then the solution to the problem would be mass transit."}, {"time": 5604, "text": "We're doing nothing to make that happen."}, {"time": 5609, "text": "Well, you could argue that autonomous vehicles is a kind of public transit because it's going to be reusable vehicles."}, {"time": 5617, "text": "It will end, in theory, car ownership."}, {"time": 5617, "text": "So you just have a more kind of distributed public transit system."}, {"time": 5625, "text": "If it happens, but you know that that's a side effect."}, {"time": 5625, "text": "His major goal and the major goal of the other companies that are busy squeezing to get his share of the pie smaller, so they have some, Ford, General Motors, Toyota, all of them are making electric cars now."}, {"time": 5638, "text": "So what they've done is they've replaced the individual car with fossil fuel with another individual car."}, {"time": 5650, "text": "That's fucking nuts."}, {"time": 5652, "text": "Well, that's one of the things they're doing, but automation is also another one."}, {"time": 5652, "text": "But on the Elon side, there's also a hilarious thing named Boring Company, which is working on tunnels, which is actually expanding the flexibility you might have to start playing with ideas of public transit, I think."}, {"time": 5671, "text": "Listen, I'm now partially living in Austin, Texas, that I don't know if they know what a public transit system is, period."}, {"time": 5680, "text": "There's F150 pickup trucks."}, {"time": 5681, "text": "Most American cities are."}, {"time": 5683, "text": "Well, this is an interesting, so."}, {"time": 5687, "text": "The older, by the way, footnote, the older this city, the more likely it has public transportation."}, {"time": 5694, "text": "So you're saying."}, {"time": 5694, "text": "Boston is the best example."}, {"time": 5696, "text": "Have you been, well, you."}, {"time": 5698, "text": "Yeah, I have a place in Boston."}, {"time": 5700, "text": "Boston with the street railway, Boston is your case study of how to do this, because they've been doing it all along."}, {"time": 5705, "text": "New York's pretty good, too."}, {"time": 5707, "text": "There's a tradeoff."}, {"time": 5707, "text": "Yeah, New York, I would say, is better than Boston because so there's, you know, their technology also helps you out to do the public transit better."}, {"time": 5718, "text": "It's almost like Boston is a little too old, but yes, I get your point."}, {"time": 5721, "text": "But there is a, the Ford F150 pickup truck symbolizes something about America, and there is a practical nature to the fact that in order to do public transit, in order to do some of these things that you're talking about with the working class, there has to be a central planning component, or there has to be a centralized component."}, {"time": 5748, "text": "And America is very much based on the idea of, at least in recent times, I would say from the founding, of individualism, of respecting individual freedom."}, {"time": 5759, "text": "Are you worried that in order to bring some of these ideas of Marxism to life, you would trample on individual freedoms?"}, {"time": 5771, "text": "Can you respect both?"}, {"time": 5773, "text": "For me, Marxism is a way to enhance the individual freedom of the mass of people who have had that freedom eroded under the capitalist."}, {"time": 5780, "text": "That's a motive for my Marxism."}, {"time": 5786, "text": "It was for Marx too."}, {"time": 5786, "text": "He loved the French Revolution."}, {"time": 5799, "text": "He believed in all of that."}, {"time": 5799, "text": "His critique of capitalism was, it promised it, and then never delivered it."}, {"time": 5804, "text": "And the reason you have to go beyond it is because it didn't deliver what it had promised."}, {"time": 5809, "text": "So for me, it is the fulfillment of agenda."}, {"time": 5819, "text": "But again, I'm a Hegelian Marxist, if you want."}, {"time": 5819, "text": "Individualism, for me, is not the way it's set up in this society, some sort of antithesis to the government."}, {"time": 5828, "text": "I think an immense con has been pulled on the American people."}, {"time": 5838, "text": "And the con works like this."}, {"time": 5838, "text": "You know what's bad and what's dangerous and threatens you?"}, {"time": 5844, "text": "It's the government."}, {"time": 5844, "text": "The government's going to come in and tell you what to do."}, {"time": 5849, "text": "The government's going to run your life."}, {"time": 5849, "text": "The government's the problem."}, {"time": 5853, "text": "There really is no other way to explain the following in American politics."}, {"time": 5859, "text": "Large numbers of people lose their homes in a downturn, like the so called Great Recession of 2008. Who do they blame?"}, {"time": 5864, "text": "Large numbers of people go unemployed, and what is the media all about?"}, {"time": 5871, "text": "If I were a capitalist, I'd love this."}, {"time": 5871, "text": "I kick the workers by throwing them out of their home, and they don't get angry at me."}, {"time": 5878, "text": "They get angry at the government."}, {"time": 5883, "text": "I fire large numbers of people."}, {"time": 5883, "text": "I have no responsibility for what happens to them as a result of having no job and no income."}, {"time": 5889, "text": "And they get angry at the senator."}, {"time": 5889, "text": "I'm laughing all the way to the bank."}, {"time": 5896, "text": "This is a genius stroke."}, {"time": 5896, "text": "In theory."}, {"time": 5896, "text": "But if you look at government, because you said accountability in the capitalist system has no accountability."}, {"time": 5903, "text": "There's some pushback I give on the accountability."}, {"time": 5907, "text": "I think there is some accountability we can discuss in a Hegelian way."}, {"time": 5912, "text": "Who there's more accountability for."}, {"time": 5912, "text": "I would say that in theory, government is perfectly accountable."}, {"time": 5920, "text": "That's the whole point of a democratic system is you vote people in."}, {"time": 5920, "text": "In practice, there's a giant growing bureaucracy that is accountable only on the surface."}, {"time": 5926, "text": "There's two parties that seem to be the same."}, {"time": 5932, "text": "Media somehow integrated into making the same two parties that are just wearing different colored shirts to seem like they're very opposed and are arguing and bitterly arguing and calling each other's nasty names and all those kinds of things."}, {"time": 5949, "text": "But that's government."}, {"time": 5956, "text": "So who exactly is worse here?"}, {"time": 5956, "text": "Government or companies?"}, {"time": 5956, "text": "Well, why are we asking that question?"}, {"time": 5964, "text": "These are twins."}, {"time": 5964, "text": "Look, what you were able to say about Republicans and Democrats just now, with which I agree."}, {"time": 5971, "text": "I would say the same thing about corporations and the government."}, {"time": 5976, "text": "This is the same people."}, {"time": 5976, "text": "Let's go to Churchill."}, {"time": 5976, "text": "Which one is worse?"}, {"time": 5982, "text": "Democracy is the worst form of government except all the other ones or whatever."}, {"time": 5987, "text": "So this kind of same idea."}, {"time": 5987, "text": "Which one exactly is worse?"}, {"time": 5987, "text": "Because to me, it seems like..."}, {"time": 5992, "text": "Which one between what and what?"}, {"time": 5994, "text": "Government and industry and companies."}, {"time": 5994, "text": "It's because government is plagued by..."}, {"time": 6003, "text": "I would call it corruption because the corruption of bureaucratic paperwork."}, {"time": 6010, "text": "But they're not accountable."}, {"time": 6010, "text": "There doesn't seem to be a serious accountability."}, {"time": 6015, "text": "Again, we're not living on the same planet."}, {"time": 6015, "text": "The greatest practitioners of central planning are corporations."}, {"time": 6023, "text": "Elon has an operation like General Motors, Ford, IBM, or any of the other megacorps."}, {"time": 6032, "text": "They have to plan."}, {"time": 6032, "text": "They buy up companies because they don't want to deal in the market."}, {"time": 6040, "text": "They don't want the insecurity, the uncertainty of having to buy their inputs or sell their outputs to somebody they don't control."}, {"time": 6046, "text": "They want the professor to teach the genius of a market."}, {"time": 6053, "text": "They hate the market."}, {"time": 6053, "text": "And when they grow to be big, they keep buying whoever they were dealing with before so they could better control them, which requires them then to plan the production and distribution of goods inside rather than buying them in the market."}, {"time": 6072, "text": "The model of the government is it's a private corporation."}, {"time": 6072, "text": "I have spent my life..."}, {"time": 6078, "text": "In American universities, big ones, famous ones, not just as a student but as a professor."}, {"time": 6085, "text": "I've been half a dozen schools."}, {"time": 6085, "text": "I teach now at the new school here."}, {"time": 6085, "text": "It's another one, right?"}, {"time": 6089, "text": "They all model themselves after businesses."}, {"time": 6089, "text": "They model their... You can attack the bureaucracy of universities."}, {"time": 6097, "text": "Good reason."}, {"time": 6097, "text": "But they're proudly modeling themselves on organizing their bureaucracy in a businesslike manner."}, {"time": 6105, "text": "So you're looking at a difference which isn't there."}, {"time": 6113, "text": "The government and the private sector are partners, and both of them wouldn't have it any other way."}, {"time": 6120, "text": "The corporations want that from the government, and the government now knows that to please the corporations is the number one objective they have because that's how they keep their jobs and keep their system going."}, {"time": 6134, "text": "And so for all practical purposes, this is the same people."}, {"time": 6140, "text": "But there's important differences that I don't know if they're fundamental or just a consequence of history."}, {"time": 6147, "text": "But if you have government, they're accountable in a different way than companies."}, {"time": 6152, "text": "Companies are accountable by..."}, {"time": 6152, "text": "Especially if you have a consumer, they're accountable by sort of the consumer spending or not spending their money on whatever the heck the company is selling."}, {"time": 6163, "text": "The government is accountable by votes."}, {"time": 6163, "text": "And it seems like government, unlike companies, for most of company's history, is always too big to fail, meaning it can always just print money."}, {"time": 6178, "text": "It can always save itself."}, {"time": 6178, "text": "And that creates a bureaucracy."}, {"time": 6186, "text": "You rarely pay the cost of having made bad decisions if you're in government."}, {"time": 6186, "text": "You distribute the blame, and it's very unclear who's responsible for bad decisions."}, {"time": 6192, "text": "So bad decisions in government accumulate."}, {"time": 6199, "text": "So you become more and more and more inefficient and more and more poor in your decision making in terms of, you said, public transit."}, {"time": 6205, "text": "Should we build a public transit system in this city or not?"}, {"time": 6210, "text": "That's a difficult decision."}, {"time": 6210, "text": "That's an interesting decision."}, {"time": 6210, "text": "I would say it's very often a very good decision."}, {"time": 6216, "text": "But whoever makes that decision should be accountable for a good or bad decision."}, {"time": 6222, "text": "And it seems like companies are more accountable."}, {"time": 6222, "text": "They pay..."}, {"time": 6229, "text": "They feel the pain of having made a bad decision more because it can go bankrupt."}, {"time": 6229, "text": "There's much more day to day pressure to make good engineering decisions."}, {"time": 6237, "text": "Government doesn't seem to be under the same level of pressure."}, {"time": 6243, "text": "Do you disagree with that?"}, {"time": 6243, "text": "Everything in my history pushes me."}, {"time": 6250, "text": "You may be living..."}, {"time": 6250, "text": "I may be living in a different planet or taking a different sort of drug."}, {"time": 6260, "text": "I won't mention the name, but I personally had a lot to do with a very large company here in the United States, here in the New York area."}, {"time": 6267, "text": "And it involved two brothers and a family who built it up into a huge corporation."}, {"time": 6277, "text": "One of the brothers was kind of the dynamo of the family."}, {"time": 6288, "text": "And he was more responsible than anybody else building it up."}, {"time": 6292, "text": "But he took care of his brothers."}, {"time": 6292, "text": "He had a nice feeling about his brothers."}, {"time": 6292, "text": "So, the one brother who could not, you know, without help tie his shoes, became a vice president."}, {"time": 6296, "text": "Got an enormous salary."}, {"time": 6305, "text": "Got a beautiful office in a skyscraper, not that many blocks from where I'm sitting right now."}, {"time": 6312, "text": "And that was the way that family handled that company."}, {"time": 6312, "text": "And all of his relatives that were somewhere in this company doing a variety of whatever, because... And my experience with this, and because I went to the schools, I told you, all my experiences with that group of people, corporate experiences, full of those stories."}, {"time": 6337, "text": "You know, they made mistake after mistake, which they would tell you didn't undermine."}, {"time": 6344, "text": "They were always able to blame somebody else, something else that scraped them through."}, {"time": 6352, "text": "And had they not been able to, they would have been replaced by another person who did the same thing for as long as they could."}, {"time": 6358, "text": "And they knew it."}, {"time": 6358, "text": "They would talk about it at family events."}, {"time": 6365, "text": "That's how I know."}, {"time": 6365, "text": "I understand that you want the outside world to look at it this way, but it's not my experience."}, {"time": 6377, "text": "But again, that kind of thing, at the risk of saying human nature again, I wonder what kind of system allows for that more versus less."}, {"time": 6385, "text": "This is the question of, I would call that, let's put that under the umbrella term of corruption."}, {"time": 6396, "text": "Which system allows for more corruption?"}, {"time": 6402, "text": "But remember that the way I defined the different system is not more or less government."}, {"time": 6406, "text": "It's more or less allowing a democratic workplace, reconfiguring it."}, {"time": 6406, "text": "What happens when everybody has a vote?"}, {"time": 6415, "text": "When you have to explain what the strategies are, what the alternatives are to a larger number of people than a board of directors or major shareholders or whoever it is that most companies are responsible to."}, {"time": 6428, "text": "And now you've got a whole different universe."}, {"time": 6428, "text": "It's not a small group that can't be hidden the way it's normally hidden, most of it, and on and on and on."}, {"time": 6440, "text": "Worker coops is what this is called in many parts of the world."}, {"time": 6440, "text": "So it's not that I'm advocating something that's never been seen before, not at all."}, {"time": 6445, "text": "The Marxism I understand is to pick from historical precedents the things that we think will work better."}, {"time": 6452, "text": "And I think if all the people in enterprise, just to drive the point home, democratically decided they would never give two or three individuals 100 million dollars while everybody else can't send their kid to college."}, {"time": 6470, "text": "I mean they can do that."}, {"time": 6470, "text": "So just to return, just to address this point about the particular implementation of Marxism that was the early days in the Soviet Union."}, {"time": 6479, "text": "Why did Stalinism, for example, lead to so much bloodshed, do you think, and human suffering?"}, {"time": 6485, "text": "Is there any elements within the ideas of Marxism that catalyzed the kind of government, the kind of system that led to that bloodshed?"}, {"time": 6503, "text": "I think there were many things that led to the bloodshed and to all that Stalin's regimes did."}, {"time": 6509, "text": "And I spent 10 years of my life with another economist writing a book about that to try to explain from a Marxist position the rise and fall of the Soviet Union."}, {"time": 6530, "text": "You might want to take a look at it sometime."}, {"time": 6530, "text": "I'm going to say a few things now, but all of those things are spelled out in great detail with loads of empirical evidence, etc."}, {"time": 6536, "text": "in that work."}, {"time": 6546, "text": "Let me start with playing a little bit with Hegel."}, {"time": 6552, "text": "The biggest impact that Marxism had on the Soviet Union was really not so much what the Soviet Union did, but what the rest of the world did."}, {"time": 6561, "text": "You had a really interesting move, and I'll give you a parallel from today."}, {"time": 6569, "text": "The move was that the old Russian regime collapsed."}, {"time": 6569, "text": "World War I, it fell apart."}, {"time": 6580, "text": "The Tsar and all of that, it couldn't survive."}, {"time": 6580, "text": "It had already been in trouble."}, {"time": 6580, "text": "There was a revolution in 1905."}, {"time": 6586, "text": "There was the loss of the war to Japan."}, {"time": 6586, "text": "If you know Russian history, which I assume you do, you'll know that there was a lot leading up to the collapse in 1917."}, {"time": 6602, "text": "In some ways, it was fortuitous that the political group, very small, that could seize the opportunity of that collapse, happened to be Marxists."}, {"time": 6609, "text": "Earlier on with Kerensky, the first government that tried, it wasn't people all that impressed by Marxism."}, {"time": 6617, "text": "It was people more skeptical and would not have been called Marxist, probably, by history."}, {"time": 6631, "text": "Lenin and his associates were able to take over from them later in that same year."}, {"time": 6636, "text": "The rest of the world, though, was horrified."}, {"time": 6636, "text": "The rest of the world saw Marxism having taken this immense leap from being a political party, a movement, critical of capitalism, yes, but still not challenging the power."}, {"time": 6654, "text": "Now it had the power, and in a big country."}, {"time": 6654, "text": "And they freaked out."}, {"time": 6661, "text": "If you know American history, the leadership of this country went completely berserk."}, {"time": 6661, "text": "I mean, we had a repression of the left, the likes of which we had not seen before."}, {"time": 6670, "text": "The 20s were a time of Palmer raids in Boston, the Sacco Vanzetti trials, I mean, really grim hostility."}, {"time": 6677, "text": "And you had the four countries agreeing to invade the Soviet Union to try to crush the revolution."}, {"time": 6693, "text": "The US, Britain, France, and Japan all attacked 10,000 American troops."}, {"time": 6693, "text": "So what you had right away was a notion in the West that this was unthinkable."}, {"time": 6701, "text": "There was a great professor at Princeton, Meier, I forget his first name, who wrote this wonderful book about all American foreign policy since 1917 has been obsessed with Russia."}, {"time": 6718, "text": "Even now, this fight with Ukraine is half about Russia, as if Russia still was the Soviet Union, as if people haven't figured out."}, {"time": 6728, "text": "That was a big change back in 1989 and 90."}, {"time": 6734, "text": "Yeltsin and Putin are not what you had before, or at least they're not Lenin."}, {"time": 6743, "text": "They may not be so different from some of the other, but in any case."}, {"time": 6743, "text": "So you had one factor was the utter isolation, the utter condemnation, the global."}, {"time": 6751, "text": "I mean, Rosa Luxemburg, I assume you know, Rosa Luxemburg is hunted down in the streets of Berlin."}, {"time": 6761, "text": "She's a critic of Lenin's, by the way, but she's a leftist, hunted down and hacked into bits, killed."}, {"time": 6768, "text": "So you're attributing some of the bloodshed to the fact that basically the rest of the world turned away."}, {"time": 6782, "text": "So you turn against is the better word."}, {"time": 6785, "text": "I mean, not in order of importance, but it's a very important part of the psychology of being, you know, it's what you would call paranoid if there weren't quite as much evidence that indeed there was a lot to be afraid of at that time."}, {"time": 6799, "text": "Nobody had ever done it."}, {"time": 6799, "text": "Look, you could see the effects of it by Stalin inventing the idea, which had no support at first, that you could have socialism in one country."}, {"time": 6811, "text": "That was thought to be ridiculous, that socialism was internationalism."}, {"time": 6818, "text": "Marx was against capitalism everywhere."}, {"time": 6818, "text": "It was, you know, workers of the world unite, not workers of Russia unite."}, {"time": 6825, "text": "He had to go through a procedure of kind of coming to terms with the fact that the revolution he had in Russia, which was tried in Berlin, was tried in Munich, was tried in Budapest, was tried in Seattle here."}, {"time": 6840, "text": "They all failed."}, {"time": 6846, "text": "They all failed, and he's left."}, {"time": 6846, "text": "All alone."}, {"time": 6855, "text": "The second thing is economic isolation."}, {"time": 6855, "text": "Russia's a poor country, and it needed what it got before the war, which were heavy investments from the French and the Germans particularly, but others too."}, {"time": 6868, "text": "Now this was all cut off, and you can see the replay with the sanctions program."}, {"time": 6868, "text": "We're going to do it again."}, {"time": 6876, "text": "We have to do it."}, {"time": 6876, "text": "The world is different, and the sanctions don't work, but they're going to trial, because it's the history."}, {"time": 6881, "text": "But that culture today is completely different."}, {"time": 6889, "text": "Russia's a different place today, but Russia has China, and that changes everything."}, {"time": 6894, "text": "And they don't get that here yet, but they will."}, {"time": 6894, "text": "Yeah, there's a very complicated dynamic with China, even with India."}, {"time": 6900, "text": "Or Turkey, Brazil."}, {"time": 6900, "text": "Sorry to say, human nature may change at a slower pace."}, {"time": 6908, "text": "Yes, that has occurred to me as well."}, {"time": 6908, "text": "I get that point."}, {"time": 6946, "text": "And then that naturally leads to a dictator, and there's naturally, in human nature, power and absolute power, as the old adage goes, corrupts absolutely."}, {"time": 6960, "text": "Is it possible that whenever you focus on Marxist ideals, you're going to end up with a dictator, and often, when you give too much power to anyone human, a small number of people, you're going to get into a huge amount of trouble?"}, {"time": 6973, "text": "You've putched things together there that I would... That's what..."}, {"time": 6978, "text": "I think if you give... Putched is a good word."}, {"time": 6982, "text": "It's German."}, {"time": 6989, "text": "Remember, I told you, my mother was born in Germany."}, {"time": 6989, "text": "And then your dad is French."}, {"time": 6994, "text": "Yeah, but he was born in Metz, if you know European."}, {"time": 6994, "text": "It's a city on the border of France and Germany."}, {"time": 6999, "text": "If you come from Alsatians, Alsass in German."}, {"time": 7005, "text": "So they're German speaking, French speaking?"}, {"time": 7006, "text": "Yeah, they're both."}, {"time": 7006, "text": "It's bilingual because it's been back and forth so many times in medieval days already that it..."}, {"time": 7012, "text": "Literally, you go from one store to another, the proprietor here is French and the proprietor there is German, but they all speak both languages because... You don't speak either of them?"}, {"time": 7026, "text": "I speak Russian."}, {"time": 7027, "text": "Russian, but not German or French?"}, {"time": 7027, "text": "Ukrainian, no."}, {"time": 7027, "text": "It took French for four years in high school, but I've forgotten all of it."}, {"time": 7032, "text": "I remember the romance and the spirit of the language, but not the details."}, {"time": 7036, "text": "I'm sure I can remember."}, {"time": 7040, "text": "If you allocate power unequally, undemocratically, and you do it for a very long period of time, and you do it on many levels of ideology, it is not surprising that it sticks and it stays."}, {"time": 7060, "text": "And you can make a political revolution or even an economic revolution and you will discover it has a life of its own and it's going to take a long time before people don't."}, {"time": 7071, "text": "If you have a religious tradition, Christianity, that prides itself on its monotheism and that it doesn't want to have anything to do with the old Greek mythologies when there was Zeus and Diana and all the others, and they were very humanlike, but instead we have one who is the absolute beginning."}, {"time": 7090, "text": "You're teaching people an authority line that comes from the individual."}, {"time": 7097, "text": "If you have a sequence of kings, if in your feudal manner the lord sits called the landlord and he has unspeakable power over everything that goes on, and you do this for thousands of years, you can make a Russian revolution in 1917."}, {"time": 7115, "text": "But if you imagine you've gotten away from all that people assume without ever thinking about it, you're going to have trouble."}, {"time": 7122, "text": "Stalin is figured here as the originator of his situation."}, {"time": 7129, "text": "He never had that power."}, {"time": 7129, "text": "He may have thought that, but I don't."}, {"time": 7138, "text": "He's the product."}, {"time": 7138, "text": "Look, the Cuban people made Fidel, who really wasn't that kind of guy."}, {"time": 7145, "text": "You know, he's a baseball playing lawyer."}, {"time": 7145, "text": "That's what he was."}, {"time": 7145, "text": "But they made him into Tala."}, {"time": 7152, "text": "So you're the product of history."}, {"time": 7152, "text": "It was the systems, feudalism, the nature, it was the structures and institutions that cultivated in people a mentality that has its own rhythm and doesn't follow the calendar of a political revolution."}, {"time": 7173, "text": "That's the fundamental question."}, {"time": 7173, "text": "Is there something about communism that creates a mentality that enables somebody like Stalin or Mao?"}, {"time": 7184, "text": "No, I think it's the social issues and problems the society has that make them then go to what they find familiar, to what seems to make sense, and he's the guy."}, {"time": 7191, "text": "Look, let me give you an example from American history."}, {"time": 7196, "text": "The Republican Party has traditionally in this country been the party of private enterprise and minimum government."}, {"time": 7202, "text": "In comes Trump, runs for office in 2016, is elected."}, {"time": 7210, "text": "He commences the most massive tax increase and the most massive government intervention in the worlds of economics that we've had for decades."}, {"time": 7219, "text": "Nobody says anything."}, {"time": 7226, "text": "The Republicans cave and the Democrats largely too."}, {"time": 7226, "text": "They cave."}, {"time": 7226, "text": "He can throw a tariff on anything."}, {"time": 7238, "text": "He gets up in front of the American people and he says the Chinese will pay the tariff."}, {"time": 7244, "text": "That's not what a tariff is."}, {"time": 7244, "text": "It's not how a tariff works."}, {"time": 7244, "text": "He would flunk a freshman course in economics, which everybody knows, everybody who teaches these courses."}, {"time": 7250, "text": "No, it doesn't matter."}, {"time": 7250, "text": "He's still calling the shots."}, {"time": 7257, "text": "What is going on here is that a society has come to a point where it can't solve its problems and it begins what?"}, {"time": 7264, "text": "To tap into older forms and all of the laissez faire and all of the individualism."}, {"time": 7274, "text": "And suddenly the Republican Party is gung ho."}, {"time": 7274, "text": "And now they're going to make abortion illegal."}, {"time": 7282, "text": "The government is telling you what you can do with your uterus."}, {"time": 7289, "text": "The government is being given more and more and more and more power."}, {"time": 7289, "text": "They're hoping what?"}, {"time": 7296, "text": "Do they like the government?"}, {"time": 7296, "text": "They're desperate."}, {"time": 7296, "text": "This is not a pro government and it wasn't in Russia either."}, {"time": 7303, "text": "They were in a desperate fix and so, and he took advantage."}, {"time": 7350, "text": "What degree did Marx's ideas, Marxism ideas have to play?"}, {"time": 7350, "text": "It is the National Socialist Party of German workers."}, {"time": 7358, "text": "Workers."}, {"time": 7358, "text": "National Socialist Deutsche Arbeiter Partei, German Worker Party."}, {"time": 7370, "text": "Worker Party."}, {"time": 7370, "text": "National Socialist German Worker Party."}, {"time": 7370, "text": "Well here's the history."}, {"time": 7376, "text": "Did he care about the workers or did he just use the workers as a populist message?"}, {"time": 7383, "text": "The only thing that Marxism did for Mr. Hitler was provide him with his stepping stone to power, but had nothing, no other, he didn't know anything about it, didn't care anything about it, nor did the people around him."}, {"time": 7394, "text": "Here's the story of what happened there, which I know largely through my own family and plus my own history, the work that I did."}, {"time": 7405, "text": "The most successful socialist party in Europe was the German Party."}, {"time": 7405, "text": "It started around 1870, Marx was still alive."}, {"time": 7412, "text": "Some of his own family were leaders, Fernand Lassalle and others, his daughters."}, {"time": 7420, "text": "By the end of the century, it was the second most important party in Germany."}, {"time": 7425, "text": "Nobody understood it."}, {"time": 7425, "text": "It was almost as big a shock to the Europeans as was the Russian Revolution in 1917."}, {"time": 7433, "text": "Here was a political party that was now in every German city, in every German town, powerful and enjoying its rise up."}, {"time": 7440, "text": "My family is involved in this, I really do know the story."}, {"time": 7451, "text": "It meant that starting around 1906, 1907, 1908, if you wanted to have any kind of presence in the German working class, you had to use the word socialist."}, {"time": 7463, "text": "You had to, otherwise they wouldn't pay attention."}, {"time": 7469, "text": "The other parties called themselves Catholic."}, {"time": 7469, "text": "Germany is divided, the upper two, the northern two thirds is Protestant, the southern third is Catholic."}, {"time": 7476, "text": "Munich and Bavaria is Catholic and every other part of Germany basically is Protestant."}, {"time": 7482, "text": "You could be in the Catholic Party, that was the south, or you could be in various conservative, Prussian and other."}, {"time": 7494, "text": "But if you wanted to have a presence in the working class, which was growing, in Germany a very powerful capitalist country, expanding like crazy at this time."}, {"time": 7499, "text": "Germany was the major competitor to Britain for the empire."}, {"time": 7506, "text": "The United States was coming up too, but it was Germany and US taking over from Britain's empire."}, {"time": 7512, "text": "So the German working class was it."}, {"time": 7512, "text": "So anybody who wanted to approach the working class in whatever way had to come to terms and be friendly to socialism."}, {"time": 7531, "text": "Other parties did this too, just like Hitler."}, {"time": 7531, "text": "They put the word socialist in their party, but they wanted to make it clear that they weren't anything to do with the Soviet Union or anything to do with Marxism."}, {"time": 7543, "text": "So they put the word national."}, {"time": 7543, "text": "Nazi is the first four letters of national, national in German, and the ZI is how you spell national in the German."}, {"time": 7556, "text": "National socialism, but definitely not communists."}, {"time": 7558, "text": "They killed communists."}, {"time": 7558, "text": "They fought communists in the street."}, {"time": 7563, "text": "They had pitched battles."}, {"time": 7563, "text": "They literally threatened each other's existence and their lives."}, {"time": 7569, "text": "And the first people that he arrested and put in jail were not Jews and gypsies and all the other people he eventually killed."}, {"time": 7575, "text": "It was communists."}, {"time": 7575, "text": "They were the number one, and socialists right behind him."}, {"time": 7580, "text": "Because up until he takes power, January of 1933, that's when Hitler takes power, the last elections, two of them in 1932, the socialists and communists, they vote together, 50% of the vote in Germany."}, {"time": 7596, "text": "So he appealed to the German manufacturers, the German capitalists, and he said, the communists and socialists are going to win."}, {"time": 7603, "text": "And you're just the capitalists."}, {"time": 7603, "text": "You have too few people."}, {"time": 7610, "text": "You need a mass base, and I'm the only one that can do that."}, {"time": 7616, "text": "And it was just a populist message that he used."}, {"time": 7619, "text": "But it was explicitly done as a deal."}, {"time": 7619, "text": "The ruling group said to Hindenburg, the old Prussian man who was in charge of the German government at the time, you have to invite Hitler to form a new government."}, {"time": 7631, "text": "Otherwise, he would never have done it."}, {"time": 7636, "text": "He had called Hitler nasty names before."}, {"time": 7636, "text": "The Prussian aristocracy looked down on Hitler as a little funny man with a mustache who was Austrian, wasn't even German."}, {"time": 7642, "text": "For them, that mattered."}, {"time": 7648, "text": "So he comes in as the enemy, the smasher of socialism and communism, which he immediately does."}, {"time": 7657, "text": "Only people who don't know or care about the history pick up on the word."}, {"time": 7664, "text": "It's like there are people here in the United States who like to say, we are not a democracy, we are a republic, which is like saying, I'm not a banana, I'm a fruit."}, {"time": 7680, "text": "You have to explain to these people, a banana is a kind of fruit."}, {"time": 7680, "text": "So you have to explain to people, yes, we're a republic, but we have a commitment to democracy as a way to govern the republic, because to say you're a republic doesn't imply what kind of government you have."}, {"time": 7694, "text": "You have to go through that with people so they kind of get it."}, {"time": 7700, "text": "And certain words have power beyond their actual meaning."}, {"time": 7700, "text": "They're used in communication, whether it's negative, like racist, or positive, like freedom of speech."}, {"time": 7711, "text": "Or Democrat, with a D. RG."}, {"time": 7713, "text": "Yeah, and then you use that to mean something."}, {"time": 7717, "text": "Or negative, stop Donnie, stop being a socialist, or whatever that means that's not even used in any kind of philosophical or economic sense."}, {"time": 7724, "text": "So let's fast forward to today."}, {"time": 7730, "text": "You mentioned Bernie Sanders."}, {"time": 7732, "text": "There's another popular figure that represents some ideas of maybe let's call it democratic socialism, and maybe let's try to start to sneak up on a definition of what that could possibly mean, but AOC, Alexandria Ocasio Cortez, she's from these parts."}, {"time": 7750, "text": "Yes, Queens."}, {"time": 7751, "text": "So maybe if you can comment on Bernie Sanders or AOC, are they open to some ideas in Marxism?"}, {"time": 7761, "text": "Are they representing those ideas well in both the economic and the political sense?"}, {"time": 7768, "text": "Where do I begin?"}, {"time": 7771, "text": "Yeah, the socialist movement predates Marx, was always larger than Marx, and has gone on to develop separately after Marx's death."}, {"time": 7779, "text": "So... RG."}, {"time": 7784, "text": "Can we pause on that actually?"}, {"time": 7784, "text": "Is there a nice way to delineate, draw a line between Marxism and socialism?"}, {"time": 7790, "text": "Or if Marxism is kind of a part of socialism, can you speak to like, maybe try to define once again what Marxism is and what socialism is?"}, {"time": 7804, "text": "Marxism is a systematic analysis heavily focused on economics, and as I said earlier, devoted to mostly a critique of capitalism, and that's its strength, how it does that, how it poses the questions, how it analyzes the way capitalism works."}, {"time": 7829, "text": "That is really the forte of the Marxist tradition."}, {"time": 7836, "text": "Socialism is a bigger, broader tent within which Marxism figures."}, {"time": 7844, "text": "It's there so that people who aren't Marxists are nonetheless aware of Marxism, like it more or less, study it more or less."}, {"time": 7852, "text": "But it's a broader notion that I like to use this sentence to describe."}, {"time": 7859, "text": "It's a broad idea that we can do better than capitalism, that really there are all kinds of things about capitalism that are not what we as modern citizens of the world think are adequate, that we are in a tradition that goes back to all the people who thought they could do better than slavery, and all the people who thought they could do better than feudalism."}, {"time": 7887, "text": "We've made progress."}, {"time": 7887, "text": "Feudalism was a progress over slavery."}, {"time": 7887, "text": "Capitalism was a progress over both of them."}, {"time": 7895, "text": "And progress hasn't stopped."}, {"time": 7895, "text": "And we are the people who, in a variety of ways, want the progress to go further and are not held back by believing that capitalism is somehow the best beyond which we cannot go or even think."}, {"time": 7911, "text": "We find that to be, in the worst sense of the word, a reactionary way of thinking."}, {"time": 7919, "text": "And we're that large community."}, {"time": 7919, "text": "Many of us are not interested in economics all that much."}, {"time": 7927, "text": "We don't think that's the focal area."}, {"time": 7927, "text": "We are socialists, for example, because we want to do something to deal with climate change."}, {"time": 7936, "text": "We think the world is about to kill itself physically, and we want to take steps with other people to stop that, to fix that, etc., etc."}, {"time": 7951, "text": "So that's, for me, a kind of difference."}, {"time": 7951, "text": "It's a little difficult to say because there's no other figure like Marx that has an equal impact, an equal place within the broad socialist tradition."}, {"time": 7969, "text": "And the only tradition that comes close might be the anarchist tradition."}, {"time": 7969, "text": "But that's very specialized, and that's a whole other kind of conversation."}, {"time": 8040, "text": "There's a whole train of thought in socialist ideas and in Marxist ideas that uses the phrase, quote, the withering away of the state."}, {"time": 8044, "text": "That's a quotation from Lenin."}, {"time": 8054, "text": "People should understand that's a quotation from Lenin."}, {"time": 8054, "text": "And it was made by Lenin."}, {"time": 8054, "text": "In other words, Lenin was saying, that's a good thing."}, {"time": 8062, "text": "That's something we stand for."}, {"time": 8074, "text": "They were just socialists."}, {"time": 8080, "text": "They were hunted down and persecuted by the government left and right."}, {"time": 8080, "text": "They had no love for the government."}, {"time": 8084, "text": "The government was their literal, everyday enemy."}, {"time": 8103, "text": "So there was this interest, why is the state so important?"}, {"time": 8103, "text": "Especially because if you understand feudalism, particularly early feudalism, it didn't have powerful states."}, {"time": 8115, "text": "One of Lenin's greatest books is called The Economic History of Russia, and it goes back centuries."}, {"time": 8120, "text": "It's a huge book, three or four inches thick, and I'm one of the few people who've read it."}, {"time": 8126, "text": "And he's very good about the absence of a strong central government in many parts of feudalism, including inside Russia, but also in other parts of Europe."}, {"time": 8135, "text": "The development of a powerful central state comes towards the end of feudalism as it is desperate to hold on, which ought to be suggestive that maybe the turn to powerful governments here in the United States or in Europe and Europe is maybe also because this system is exhausted and can't go on and has to marshal every last bit of power it can, not to be lost in history."}, {"time": 8163, "text": "It would be interesting to see what the Soviet Union would look like if Lenin never died."}, {"time": 8172, "text": "A lot of people have asked that question over the years, a lot of people."}, {"time": 8178, "text": "There's Stalin sliding in in the middle of the night, erasing the withering away of the state part."}, {"time": 8184, "text": "So just to return briefly back to AOC and Bernie Sanders, what are your thoughts about these modern political figures that represent some of these ideas, and they sometimes refer to those ideas as democratic socialism?"}, {"time": 8195, "text": "The crucial thing about Bernie and about AOC, and this is particularly true about Bernie, because AOC is much younger and Bernie's an older man."}, {"time": 8208, "text": "Bernie, being roughly my age, has been around formatively as a student, as an activist, and then coming up through the ranks in Burlington, Vermont as a mayor and all the rest."}, {"time": 8225, "text": "He lived through what, for lack of a better term, I would call Cold War America."}, {"time": 8232, "text": "And the taboo in Cold War America, running from around 1945, 6 to the present, I mean, really never stopped, was a Manichean worldview."}, {"time": 8239, "text": "The United States is good, it defines democracy, and the Soviet Union is awful, it defines whatever the opposite of democracy should be called."}, {"time": 8255, "text": "Good here, evil there."}, {"time": 8255, "text": "It was taken so far that even among the ranks of academic individuals, it was impossible to have a conversation."}, {"time": 8268, "text": "I mean, I can't tell, just make it very personal, the number of times I would raise my hand in my classes at Harvard or Stanford or Yale, and I would ask a question that had something to do with Marxism, because I was studying it on my own."}, {"time": 8288, "text": "There were no courses to teach this to me, except by people who trashed it, other than that, and I didn't want that."}, {"time": 8300, "text": "So I would ask a question, and I would see in the faces of my teachers, both those I didn't much care for and those who were good teachers that I liked, fear."}, {"time": 8306, "text": "It was just fear."}, {"time": 8306, "text": "They didn't want to go there."}, {"time": 8312, "text": "They didn't want to answer my question."}, {"time": 8312, "text": "And after a while, I got to know some of them, and I found out why."}, {"time": 8317, "text": "Because you don't know how the rest of the class is going to understand this."}, {"time": 8322, "text": "Either they would have to say, I don't know, which would be the honest truth for many of them, but a professor does not want to say in a classroom, I don't know, that's just not cool."}, {"time": 8332, "text": "Or they'd have to, if they knew, they'd have to say something that indicated they didn't know really much, and they weren't going to do that."}, {"time": 8339, "text": "Or they would know something, and maybe that would be because they were interested."}, {"time": 8345, "text": "They did not want the rest of the students to begin to say, oh, you know, Professor Smith, you know, he's interested."}, {"time": 8352, "text": "This is not good for your career."}, {"time": 8352, "text": "You don't know how this is going to play out."}, {"time": 8360, "text": "Who's going to say what to whom?"}, {"time": 8360, "text": "And I could see in their faces what I later learned, because they told me, come to my office hours."}, {"time": 8365, "text": "We're in the office."}, {"time": 8371, "text": "We can talk about it."}, {"time": 8371, "text": "But that's how bad it was."}, {"time": 8371, "text": "Is it not still?"}, {"time": 8371, "text": "In my field, the great so called debate, I mean, I find it boring, but the great debate for my colleagues is between what's called neoclassical economics and Keynesian economics."}, {"time": 8386, "text": "Neoclassical, the government should stay out of the economy."}, {"time": 8392, "text": "Let's say fair or liberalism."}, {"time": 8392, "text": "And the Keynesian saying, no, you crazy neoclassical, if you do that, you'll have Great Depressions, and the system will collapse."}, {"time": 8404, "text": "You need the government to come in to solve the problems, to fix the weaknesses."}, {"time": 8404, "text": "And they hate each other, and they throw each other out of their jobs."}, {"time": 8410, "text": "One of the very few things that they can do together that they agree on is keeping people like me out."}, {"time": 8415, "text": "That they can find common ground to do."}, {"time": 8422, "text": "So I had to learn it all on my own."}, {"time": 8422, "text": "Because this taboo means that all of the complicated developments within Marxism and within socialism of the post World War II period, the vast bulk of all of that is unknown, not just to the average American person, but to the average American academic, to the average American who thinks of himself or herself as an intellectual."}, {"time": 8458, "text": "I mean, I have had to spend ridiculous amounts of my time explaining Soviet history."}, {"time": 8465, "text": "They have no idea."}, {"time": 8473, "text": "He was head of the Communist Party of Italy for most of his adult life."}, {"time": 8480, "text": "You like Gramsci as a literary critic, but they didn't even know."}, {"time": 8488, "text": "They don't even know."}, {"time": 8488, "text": "It's been erased."}, {"time": 8488, "text": "It's a little bit like stories I've heard about Trotsky and his influence kind of erased in the Soviet Union because he obviously fell out of favor."}, {"time": 8501, "text": "And so somehow all of his writings, many of which are very interesting and complicated, anyway."}, {"time": 8508, "text": "So what you're going to have in this country is a slow awakening of socialism from a long hibernation called the Cold War."}, {"time": 8516, "text": "I never expected, to be very honest with you, that I would live to see it."}, {"time": 8524, "text": "I knew it would come, because these things always do, but I didn't expect to see it."}, {"time": 8531, "text": "So I have been surprised, as have a lot of us, that when it starts to happen, it happens fast."}, {"time": 8538, "text": "So you see Bernie as an early sign of the awakening from the Cold War to accept the idea of socialism."}, {"time": 8546, "text": "Bernie was always a socialist."}, {"time": 8546, "text": "We all knew."}, {"time": 8552, "text": "And everybody who paid attention, he denied it."}, {"time": 8552, "text": "But 2016, he makes a decision, momentous, to run for president."}, {"time": 8560, "text": "He's just a senator from Vermont."}, {"time": 8560, "text": "Vermont is one of the smallest states in the Union."}, {"time": 8566, "text": "People who live in Vermont love to tell you that there are more cows than people in Vermont, et cetera, et cetera."}, {"time": 8571, "text": "So here from this little state, this elderly gentleman with a New York City accent runs for office and says, I'm a socialist."}, {"time": 8577, "text": "And when they attack him, he doesn't run away."}, {"time": 8583, "text": "I'm a socialist."}, {"time": 8583, "text": "Now, he had been."}, {"time": 8583, "text": "It wasn't a secret that suddenly got out."}, {"time": 8595, "text": "I know a lot of people."}, {"time": 8595, "text": "You know, Janet Yellen was my classmate at Yale, and stuff like that."}, {"time": 8601, "text": "So I was speaking with a high official of the Democratic Party, and I said, well, what do you think about Bernie entering the race?"}, {"time": 8611, "text": "Makes no difference."}, {"time": 8611, "text": "He doesn't get 1% of the vote."}, {"time": 8611, "text": "He was wrong."}, {"time": 8611, "text": "They had no idea what was coming."}, {"time": 8617, "text": "But the truth is, I didn't either."}, {"time": 8617, "text": "It wasn't just that he didn't get it."}, {"time": 8622, "text": "I thought his 1% was probably right."}, {"time": 8622, "text": "So we were both wrong."}, {"time": 8626, "text": "Yeah, change can happen fast."}, {"time": 8626, "text": "Do you think AOC might be president one day?"}, {"time": 8631, "text": "But two things."}, {"time": 8631, "text": "Number one, it's fast."}, {"time": 8631, "text": "Number two, it's going to go in the following direction, I would guess."}, {"time": 8642, "text": "You begin with the most moderate, calm, nonconfrontational socialism you can imagine."}, {"time": 8658, "text": "So not AOC or Bernie."}, {"time": 8659, "text": "They are not confrontational, in my judgment."}, {"time": 8663, "text": "In terms of the ideas of socialism."}, {"time": 8663, "text": "I mean, they're both very feisty."}, {"time": 8666, "text": "They're feisty personally, but not ideologically."}, {"time": 8673, "text": "Bernie is also, in honest moments, and they both really are pretty honest folks, at least in my experience."}, {"time": 8680, "text": "In honest moments, Bernie will tell you that what he advocates as democratic socialism is pretty much what FDR was in the 1930s."}, {"time": 8687, "text": "It was a kind of popular government, tax the rich a lot more than you do now to provide a lot more support for the working class than you do now."}, {"time": 8702, "text": "That's not a fundamental change."}, {"time": 8702, "text": "That's what he means by socialism."}, {"time": 8708, "text": "When he talks about it and he's asked for examples, he mentions Denmark a lot."}, {"time": 8715, "text": "Okay, that's consistent."}, {"time": 8715, "text": "That's the softest kind of socialism, and that's where we're going to start in a country coming out of hibernation."}, {"time": 8723, "text": "Pretty soon, it's already happening, there'll be people who need and want to go further in the direction of socialism than Bernie and AOC are comfortable with."}, {"time": 8735, "text": "You can already see the shoots of it now."}, {"time": 8735, "text": "AOC voted, together with most of the others, to support the money for Ukraine."}, {"time": 8743, "text": "Okay, a lot of people in the socialist movement do not support that."}, {"time": 8749, "text": "I don't know exactly how that's going to work out, but that should give people an idea."}, {"time": 8756, "text": "There are disagreements, and they're going to fester, and they're going to grow."}, {"time": 8763, "text": "So people in the socialist sphere don't support money from the United States in the large amounts that it is being sent to Ukraine."}, {"time": 8768, "text": "Is it because it's fundamentally the military, industrial complex is a capitalist institution kind of thing?"}, {"time": 8773, "text": "No, there are some people for whom that's the issue."}, {"time": 8779, "text": "Then there are people for whom it's guns and butter, and why are we over there when we have such needs at home that are being neglected?"}, {"time": 8788, "text": "And then there are people who, well, go back to what we talked about at the beginning, who are more like Lenin and Debs."}, {"time": 8794, "text": "This is a fight between Western capitalism and Russian oligarchs and wannabe oligarchs in Ukraine, and what are we doing here?"}, {"time": 8808, "text": "We have to insist that these forces sit down at the bargaining table and negotiate a settlement, don't kill large numbers of Ukraine."}, {"time": 8815, "text": "I mean, everybody's willing to fight to the last Ukrainian is a little strange here."}, {"time": 8820, "text": "You're supposed to be in favor of peace, you know, and for the United States, which just finished invading and occupying Afghanistan and Iraq, to be against another country invading."}, {"time": 8831, "text": "I mean, who in the world is going to take this seriously?"}, {"time": 8836, "text": "You know, I invade, it's good, and you invade, it's terrible."}, {"time": 8843, "text": "You know, what are you doing?"}, {"time": 8843, "text": "Why are you doing that?"}, {"time": 8855, "text": "You watch that Tucker Carlson or people like that, they are against the stuff in Ukraine."}, {"time": 8862, "text": "They don't want the money spent there, they don't want the weapons sent there, they don't like the whole policy, and Trump wobble."}, {"time": 8873, "text": "So Mr. Biden's policy has got all kinds of critics on the left and the right, and every day that this thing lasts, these criticisms get bigger."}, {"time": 8905, "text": "I don't know if the name means anything to you."}, {"time": 8918, "text": "That's the equivalent."}, {"time": 8918, "text": "Imagine in this country if there were a university that combined Harvard, Yale, Princeton, and MIT."}, {"time": 8925, "text": "It would be the university."}, {"time": 8933, "text": "The rector is like the president of the university, an active member of the French Communist Party most of his adult life."}, {"time": 8946, "text": "That was possible in France during the Cold War."}, {"time": 8946, "text": "That was unthinkable in this country."}, {"time": 8952, "text": "You could not in a million years, right?"}, {"time": 8969, "text": "So if you want to look him up, I'll spell it out for you."}, {"time": 8975, "text": "A.L.T.H.U.S.S.E.R."}, {"time": 8975, "text": "Louis."}, {"time": 8975, "text": "The Louis is spelled L.O.U.I.S."}, {"time": 8975, "text": "Louis Althusser."}, {"time": 8986, "text": "You'll see tons of stuff."}, {"time": 8986, "text": "By the way, MIT Press is a major publisher, if I remember, of his works in English."}, {"time": 8993, "text": "By the way, the textbook I wrote in economics, in case you're ever interested, was also published by the MIT Press."}, {"time": 8999, "text": "And the title?"}, {"time": 8999, "text": "Contending Economic Theories."}, {"time": 9005, "text": "Neoclassical, Keynesian, and Marxian."}, {"time": 9005, "text": "That's at MIT."}, {"time": 9005, "text": "Marxian."}, {"time": 9026, "text": "A person is a Marxist."}, {"time": 9026, "text": "Marxian I use as an adjective to qualify."}, {"time": 9026, "text": "But I don't mean some great difference."}, {"time": 9035, "text": "There's a last point I would like to make about AOC and Bernie that's also general."}, {"time": 9039, "text": "I'm a historian, too, and I know that the transition out of feudalism in Europe to capitalism was a transition that took centuries and that occurred in fits and starts."}, {"time": 9056, "text": "So, for example, a feudal manor would start to disintegrate."}, {"time": 9056, "text": "Serfs would run away."}, {"time": 9062, "text": "They'd run into a town."}, {"time": 9062, "text": "How would they live in the town?"}, {"time": 9062, "text": "They had no land anymore because they had run away from the feudal manor."}, {"time": 9069, "text": "A deal was struck without the people involved in the deal understanding what they were doing."}, {"time": 9075, "text": "A merchant would say to one of these serfs, I'm in the business of buying and then reselling stuff and living off the difference, but, you know, I could make more money if I produce some of this stuff myself rather than buy it from somebody else."}, {"time": 9093, "text": "So I'm going to make you a deal."}, {"time": 9093, "text": "I'm going to give you money once a week."}, {"time": 9093, "text": "I'll give you money, what we would later call a wage, and you come here and under my supervision you make this crap that I'm going to then sell and this all works out."}, {"time": 9103, "text": "In other words, there were efforts, unconscious, not self aware, to go out of feudalism to a new system."}, {"time": 9119, "text": "Some of them lasted a few days and then fell apart."}, {"time": 9119, "text": "Some of them lasted weeks or months or years, but it took a long time before the conditions were ready for a kind of a general switch and once that was done it grew on itself and became the global capitalist system we have today."}, {"time": 9141, "text": "That's the only model we have."}, {"time": 9141, "text": "So for me that's what I see when I look at socialism."}, {"time": 9148, "text": "I see the Paris Commune was an event, an attempt."}, {"time": 9148, "text": "It lasted a few weeks."}, {"time": 9148, "text": "I see Russia, that was an attempt, lasted 70 years."}, {"time": 9158, "text": "Then I see, and you know, fill in the blank, I see these are all early experiments."}, {"time": 9164, "text": "These are all you learn things to do, learn things never to do again."}, {"time": 9164, "text": "The good, the bad, what do you build on?"}, {"time": 9172, "text": "And that's what the socialist and Marxist tradition when it's serious, that's what it does."}, {"time": 9178, "text": "So in your ideas sort of capitalism was a significant improvement over the feudalism and we are coming to an age and over slavery and we're coming to an age where capitalism will die out and make, it's not that capitalism is somehow fundamentally broken."}, {"time": 9198, "text": "It's better than the things that came before but there's going to be things yet better and they will be grounded in the ideas of Marxism and socialism."}, {"time": 9204, "text": "Is there just to linger briefly on the way Marxism is used as a term on Twitter."}, {"time": 9212, "text": "There's something called, I'm sorry if I'm using the terms incorrectly, but cultural Marxism."}, {"time": 9221, "text": "Criticisms of universities being infiltrated by cultural Marxists."}, {"time": 9231, "text": "I don't pay close enough attention, but it's woke."}, {"time": 9240, "text": "There's a kind of woke ideology that I'm not exactly sure."}, {"time": 9240, "text": "What is the fundamental text?"}, {"time": 9249, "text": "Who's the Karl Marx of wokeness?"}, {"time": 9249, "text": "All I do know is that there's certain characteristics of woke ideology, which is hard lines are drawn between the good guys and the bad guys."}, {"time": 9268, "text": "And basically everyone is a bad guy except the people that are very loudly nonstop saying that they're the good guy."}, {"time": 9275, "text": "And that applies for racism, for sexism, for gender politics, identity politics, all that kind of stuff."}, {"time": 9287, "text": "Is there any parallels between Marxian economics and Marxist ideology and whatever is being called Marxism on Twitter?"}, {"time": 9300, "text": "WOLFF No, not much."}, {"time": 9300, "text": "One of the consequences of the taboo after World War II is that Marxism, like socialism and communism, become swear words."}, {"time": 9313, "text": "It's like calling somebody, well, I won't use bad language, but using a four letter word to describe somebody."}, {"time": 9320, "text": "So instead of calling them this or that, you call them a Marxist."}, {"time": 9320, "text": "In many circles, this is even worse than whatever other adjective you might have used, but it doesn't have a particular meaning that I can assess."}, {"time": 9332, "text": "The closest you get is your little list."}, {"time": 9332, "text": "It is somebody who is concerned about race and sex and sexual orientation, gender and all of those things, and wants there to be transgendered bathrooms."}, {"time": 9350, "text": "And I don't like any of these people, so I slap the word Marxism or the phrase cultural Marxism, because it isn't Marxism about getting more money or controlling the industry or all those things that dimly we know Marxists somehow are concerned about."}, {"time": 9374, "text": "So this is odd, since they don't know much about Marxism."}, {"time": 9374, "text": "I've always been interested in culture."}, {"time": 9379, "text": "I mean, Lukacs, the man I mentioned to you before, Gramsci, that's what they're famous for, the analysis of what Marxism particularly has to say about culture."}, {"time": 9385, "text": "Gramsci writes at great length about the Catholic Church, about theater and painting in Italy and on and on."}, {"time": 9392, "text": "I mean, this is just ignorance talking."}, {"time": 9400, "text": "They don't know anything about that."}, {"time": 9400, "text": "They wouldn't know what the names are."}, {"time": 9403, "text": "It's a label that summarizes, kind of a shorthand, I'm against all of this."}, {"time": 9403, "text": "I don't want to be told that there's ugly racism in this country, and it always has been, or sexism, or phobia against gay people, whatever it is that's agitating them."}, {"time": 9419, "text": "Marxism or socialism, I mean, it's just like socialism is the post office."}, {"time": 9426, "text": "It is a mentality."}, {"time": 9426, "text": "Well, but I don't blame them."}, {"time": 9433, "text": "I mean, it's childish."}, {"time": 9433, "text": "It's mean spirited."}, {"time": 9433, "text": "But it comes out of the fact no one ever sat them down and said, you know, here is this tradition."}, {"time": 9440, "text": "It's got these kinds of things that people kind of share and these big differences."}, {"time": 9446, "text": "Look, an intelligent society, which this country is, could have and should have done that."}, {"time": 9453, "text": "It was fear and a kind of terror that made them behave in the way they did, and we're now seeing it."}, {"time": 9460, "text": "Having said that, there is such a thing as cultural Marxism."}, {"time": 9465, "text": "What that is is simply those Marxists who devoted themselves to analyzing how it is that a particular culture is, on the one hand, shaped by capitalism and, on the other hand, it becomes a condition for capitalism to survive and grow."}, {"time": 9487, "text": "In other words, how do we analyze the interaction between the class struggle on the job and attitude towards sexuality, or movements in music, or whatever else culture."}, {"time": 9512, "text": "And a modern name, just died a couple years ago, a British intellectual named Stuart Hall, H A L L. If I were teaching, which I have done, a course in cultural Marxism, those would be three major blocks on the syllabus."}, {"time": 9526, "text": "I would give you articles and books to read of their stuff, because it has been so seminal in provoking many, many others."}, {"time": 9542, "text": "So there is something to be said and understood about the kind of culture that capitalism creates and the kind of culture that enables capitalism."}, {"time": 9547, "text": "Yes, and Marxists are particularly those who like to look at that interaction."}, {"time": 9553, "text": "In other words, they are interested in how capitalism shapes culture and how culture shapes capitalism."}, {"time": 9558, "text": "There is another name, I forgot."}, {"time": 9564, "text": "The German is Walter Benjamin, B E N J A M I N. He was a member of the Frankfurt School, which is a huge school of Marxism that developed in Frankfurt, Germany, and that has a lot of people, many of whom were interested in cultural questions."}, {"time": 9589, "text": "It was a bit of a reaction against the narrow Marxism that was so focused on economics and politics."}, {"time": 9596, "text": "There were people who said, you're leaving out very important parts of modern society that are shaping the economy as much as they are shaped by it."}, {"time": 9602, "text": "And it was that impetus to open Marxism to be more inclusive in what it deemed to be important to understand that this cult, and they call themselves cultural Marxists, but they had a completely different meaning from this."}, {"time": 9620, "text": "This is just, you know, just bad mouthing, that's all."}, {"time": 9627, "text": "LW Let me ask a more personal question."}, {"time": 9627, "text": "So for most of the 20th century, no not most, but a large many decades in the United States as a consequence of the Cold War and before, being a Marxist is one of the worst things you could be."}, {"time": 9639, "text": "Have you had dark periods in your own life where you've gone to some dark places in your mind where it was difficult, like self doubt, difficult to know, like what the hell am I doing?"}, {"time": 9654, "text": "When you're surrounded by colleagues and people, you said prestigious universities, both personal interest of career, but also as a human being, when everybody, you know, kind of looks at you funny because you're studying this thing."}, {"time": 9666, "text": "Did that ever get you real low?"}, {"time": 9676, "text": "RL No."}, {"time": 9676, "text": "I know people who had exactly what you said."}, {"time": 9676, "text": "I mean, your question's perfectly reasonable."}, {"time": 9681, "text": "If I were you, I'd be asking me that question too."}, {"time": 9683, "text": "LW And what's wrong with you?"}, {"time": 9686, "text": "RL Nothing wrong with the question."}, {"time": 9686, "text": "And here's the honest truth."}, {"time": 9686, "text": "I don't know how anomalous I am."}, {"time": 9693, "text": "But the truth is, no."}, {"time": 9693, "text": "I have, if my wife was sitting here, she'd tell you what she tells me, which is I have been tremendously lucky in my life, which is true."}, {"time": 9701, "text": "But then again, luck never is the only explanation for things."}, {"time": 9707, "text": "I didn't choose the time of my birth."}, {"time": 9718, "text": "I didn't choose the communities in which I grew up or the schools I attended or anything else."}, {"time": 9724, "text": "RL No, but the fact that there was no courses or extensive courses on Marxian economics."}, {"time": 9729, "text": "RL But you know, again, I'm Hegel."}, {"time": 9729, "text": "On the one hand, I was denied good instruction."}, {"time": 9734, "text": "On the other hand, I had to go out and learn it on my own."}, {"time": 9734, "text": "And the motivation when you do that is very different."}, {"time": 9741, "text": "I'm not the student who sits there with my notebook, taking notes of what the great professor says and reading the text and getting ready for the exam."}, {"time": 9747, "text": "I don't have an exam."}, {"time": 9747, "text": "I'm doing something slightly risque, you know, kind of romantically different and oppositional."}, {"time": 9755, "text": "I was able to find always one or two professors that I could talk to outside of the classroom situation, other students who felt enough similar to me that we could get together and read these books and talk about them."}, {"time": 9779, "text": "I had a number of really fortuitous people who were kind to me and gave me of their time and their effort to teach me along the way."}, {"time": 9786, "text": "And I've had the benefit that because I went to all these fancy schools, I do know a lot of people who are in high places in this culture."}, {"time": 9801, "text": "And when I have been put in difficult positions, I often wave my pedicure at them and say, I often wave my pedigree and it works like garlic with the devil."}, {"time": 9807, "text": "They back away."}, {"time": 9815, "text": "Because Americans are very deferential to that kind of academic prestige."}, {"time": 9820, "text": "But there's a personal psychological thing that seems that you have never been shaken by this."}, {"time": 9820, "text": "You have just naturally somebody who just has perseverance."}, {"time": 9833, "text": "WOLFF Well, I would put it, I understand what you're saying, but I would put it a little differently."}, {"time": 9837, "text": "I think capitalism struck me early on in my life as not that great a system and nothing has happened to change my mind."}, {"time": 9848, "text": "In other words, the development just kept giving me more and more evidence."}, {"time": 9860, "text": "And I must say over the last 10 years, what's really changed?"}, {"time": 9860, "text": "The last 10 years."}, {"time": 9860, "text": "I mean, I can't describe to you how big that change is."}, {"time": 9870, "text": "And that may be more important than anything else we've discussed."}, {"time": 9875, "text": "Up until 10 years ago, I would do a public event, an interview on television or a radio thing or give a talk at some conference or something."}, {"time": 9884, "text": "Once every two or three months, I'd be invited and I would do it, like academics often do."}, {"time": 9892, "text": "I now do two to three to four interviews every day."}, {"time": 9899, "text": "So, there's a hunger."}, {"time": 9899, "text": "How is there hunger?"}, {"time": 9899, "text": "And I want to be honest with you."}, {"time": 9909, "text": "WOLFF As I say at the end of some of my talks, I allow there to be a kind of a pregnant pause from the podium that I lean into the microphone and I say, with as much smile as I can get, I'm having the time of my life."}, {"time": 9923, "text": "That's the truth."}, {"time": 9923, "text": "I never expected, look, I'm used to teaching a classroom, a seminar for graduate students with eight or nine or 10 students or a regular undergraduate class with 30 or an occasional introductory course with a few hundred."}, {"time": 9944, "text": "I've done all of those things many times."}, {"time": 9944, "text": "But an audience, you know, that I can count in the hundreds of thousands on YouTube and all of that, no, that's new."}, {"time": 9958, "text": "LESTER Is there advice you can give, given your bold and nonstandard career and life, advice you can give to high school students, college students about how to have a career like that, or maybe how to have a career or a life they can be proud of?"}, {"time": 9974, "text": "WOLFF Yeah."}, {"time": 9974, "text": "First of all, my advice is go for it."}, {"time": 9984, "text": "The conditions for doing that now are infinitely better than they were when I had to do it."}, {"time": 9992, "text": "And I could do it and I'm happy I did it."}, {"time": 9992, "text": "Becoming a teacher is one of those decisions I made that I've never regretted."}, {"time": 10000, "text": "And I've never regretted being a critic of this society, ever."}, {"time": 10008, "text": "I find it edifying."}, {"time": 10008, "text": "I find it, I mean, the gratitude people express to me for helping them see kind of what's going on is unbelievably encouraging."}, {"time": 10018, "text": "I mean, what can I tell you?"}, {"time": 10024, "text": "LESTER So that fills you, that fills you with joy."}, {"time": 10024, "text": "Pointing out that the Emperor has no clothes fills you."}, {"time": 10028, "text": "That's a life not just important."}, {"time": 10028, "text": "WOLFF And you know why?"}, {"time": 10028, "text": "It's because most of the people who say something like that to me are people who, if they had the vocabulary, and some of them do, would say, you know, I thought I was seeing through that outfit that I was wearing."}, {"time": 10041, "text": "I thought it and they did."}, {"time": 10048, "text": "And all they needed was a little extra this information or that factoid or this logic."}, {"time": 10056, "text": "And they have that."}, {"time": 10056, "text": "And I remember having that too."}, {"time": 10056, "text": "When I had a teacher who made something clear that had been murky, I always felt gratitude."}, {"time": 10063, "text": "And now I get that gratitude a good bit."}, {"time": 10070, "text": "And yes, it is enormously gratifying."}, {"time": 10070, "text": "And I'm not sure I could get it any other way."}, {"time": 10080, "text": "I have learned and I'm walking proof that being a critic of society and doing it systematically and sharing it with other people makes for a very good life."}, {"time": 10089, "text": "A very good life."}, {"time": 10095, "text": "LESTER Speaking of which, however, one other aspect of human nature is that life comes to an end."}, {"time": 10107, "text": "WOLFF Afraid of it?"}, {"time": 10107, "text": "Think about it?"}, {"time": 10107, "text": "I've always thought, you know, death is hard for the people that are left when you're dead."}, {"time": 10116, "text": "It's not going to bother you very much."}, {"time": 10121, "text": "So I worry more about my wife."}, {"time": 10121, "text": "I'm very attached to my wife."}, {"time": 10121, "text": "I might mention to you, I got married when I was 23 years old."}, {"time": 10129, "text": "That's my wife to this day."}, {"time": 10129, "text": "So I'm lucky because if you get married to anybody in age 23, it's either luck or it isn't."}, {"time": 10138, "text": "LESTER What role has love played in your life?"}, {"time": 10147, "text": "WOLFF Enormous."}, {"time": 10151, "text": "Because I came from a family, you know, if your family is political refugees, which mine were, who had to interrupt their lives, moved to another continent, learn another language, find another life, income and job."}, {"time": 10164, "text": "The disruption goes real deep for any refugee."}, {"time": 10164, "text": "So my mother and father were both refugees."}, {"time": 10175, "text": "They met as refugees."}, {"time": 10175, "text": "So I had to, in a way, make it up to them."}, {"time": 10175, "text": "I had to be, I was the first child of their younger sister, but the first child."}, {"time": 10188, "text": "And, you know, there's a lot of psychological pressure on you if you're in that situation."}, {"time": 10196, "text": "Nobody means you harm, but you've got to do what they couldn't, what was shut off to them in a way they want you to do."}, {"time": 10210, "text": "It's the closest they're going to get to what they had hoped."}, {"time": 10210, "text": "And my parents were both university students."}, {"time": 10217, "text": "My father was a lawyer."}, {"time": 10217, "text": "My mother had to leave the university to run for her life."}, {"time": 10226, "text": "So I had to perform."}, {"time": 10226, "text": "You know, I went to high school here in the United States."}, {"time": 10226, "text": "I had to get all A's."}, {"time": 10232, "text": "I had to be on the football team."}]}]