[{"title": "Ryan Hall: Solving Martial Arts from First Principles | Lex Fridman Podcast #169", "id": "VHg9sfOzBbY", "quotes": [{"time": 285, "text": "So as an end user, I can change some of the bells and whistles that have nothing to do with the underlying source code of it all or how it functions."}, {"time": 291, "text": "The same way in my car, I'm an end user of my car."}, {"time": 293, "text": "If I do this with the steering wheel, it goes."}, {"time": 295, "text": "If I push on the gas, it goes."}, {"time": 298, "text": "I know how to fix it when it's out of gas."}, {"time": 299, "text": "I know how to fix it when it's out of oil."}, {"time": 301, "text": "And I know how to fix it when a flat tire comes."}, {"time": 304, "text": "But short of that, or actually beyond that, I have nothing."}, {"time": 307, "text": "So I think that oftentimes, I've been around in jiu jitsu long enough to encounter a new wave of good grapplers."}, {"time": 314, "text": "And it's very, very interesting sometimes how they're running systems they don't realize they're running."}, {"time": 319, "text": "Like, I'm like, oh yeah, I trained at Marcelo Garcia's Academy for a long time."}, {"time": 323, "text": "And a big fan of Marcelo's was a student there."}, {"time": 326, "text": "Encountered a lot of the auto style jiu jitsu a number of years ago."}, {"time": 331, "text": "Been very, very deep into foot locking and leg attacks and whatnot for a long, long time."}, {"time": 338, "text": "I understand your system better than you do, or I may."}, {"time": 340, "text": "And let's say you understand my system better than I do."}, {"time": 342, "text": "That would be a huge issue."}, {"time": 343, "text": "That was something that I encountered a long time ago, trying to come up in jiu jitsu where I was trying to utilize systems that were created by, let's say Hoffa Mendez or someone else."}, {"time": 355, "text": "And I'm basically trying to do what you're doing."}, {"time": 356, "text": "I'm just not doing as good of a version of it."}, {"time": 358, "text": "So not only am I not doing it well, but I'm entirely predictable."}, {"time": 362, "text": "And I think that that can be a big issue."}, {"time": 363, "text": "So to come back, I think of systems a lot of times now in terms of, particularly like end user type of systems, like an iPhone is a really, really fast way for me to be able to do all sorts of things."}, {"time": 374, "text": "If you were to take it from me, I couldn't recreate any of that."}, {"time": 377, "text": "So you want to be more the NSA and less the end user."}, {"time": 381, "text": "That way I'm listening to you."}, {"time": 382, "text": "You want to be the NSA of combat."}, {"time": 383, "text": "That's right, we're watching UP."}, {"time": 385, "text": "But basically, I guess what I would come back and say is if you understand how things interact on a fundamental level and what type of games exist and what type of interactions exist, then you can transcend a lot of the systems."}, {"time": 400, "text": "It's almost like a cook versus if I can make certain things in the kitchen, but I am not a chef."}, {"time": 405, "text": "You could give me a bunch of ingredients and I could probably cook not well, but a couple of different things."}, {"time": 411, "text": "But a master chef would be aware of the implications of all of the things that they're doing, extra time in the oven, less time in the oven, putting this flavoring or spice in, what you're doing with various things."}, {"time": 424, "text": "And also they could turn all of these ingredients into Chinese food."}, {"time": 427, "text": "They could turn all these ingredients into Italian food and they could turn all these Italian food ingredients into chicken Parmesan or it could turn into lasagna."}, {"time": 433, "text": "But they're not limited to a specific thing because they have knowledge of how food interacts, what it does to create taste, what it does to create texture."}, {"time": 441, "text": "So to come back, let's take rock, paper, scissors."}, {"time": 444, "text": "Rock, paper, scissors is built on the idea of a couple of different things."}, {"time": 448, "text": "Or actually, I'll tell you what, can I ask you a question?"}, {"time": 451, "text": "What's your favorite dinosaur?"}, {"time": 452, "text": "On the same, on three, we'll go."}, {"time": 454, "text": "One, two, three."}, {"time": 457, "text": "T. Rex."}, {"time": 457, "text": "So me too, man, we're gonna be best friends."}, {"time": 460, "text": "So it's, okay, so what's the first question when you say, hey, let's play rock, paper, scissors?"}, {"time": 466, "text": "It's like, hey, is it rock, paper, scissors or rock, paper, scissors, shoot?"}, {"time": 469, "text": "And you're like, rock, paper, scissors, shoot."}, {"time": 470, "text": "You're like, okay."}, {"time": 471, "text": "Because if we go rock, paper, scissors, shoot, and I'm like, oh man, I got lucky and I won."}, {"time": 478, "text": "Imagine I won 100 times in a row."}, {"time": 481, "text": "It'd be luck, it'd be luck if I was honestly doing that."}, {"time": 484, "text": "But now let's say, for instance, I go on rock, paper, scissors and you go on shoot."}, {"time": 488, "text": "Rock, paper, scissors, shoot."}, {"time": 491, "text": "Here comes the rock, right?"}, {"time": 492, "text": "If you lose, whose fault is it?"}, {"time": 497, "text": "This is built on a parody thing where I don't get to pick second."}, {"time": 502, "text": "If I get to pick second, it's like being able to investigate your background before going to meet you."}, {"time": 507, "text": "And then I'm like, oh, hi."}, {"time": 508, "text": "Oh, I too love the New Jersey, you know, the New Jersey Nets, which is a statement that no one in their right mind would ever make when I was growing up."}, {"time": 515, "text": "So anyway, you'd have to have personal knowledge of somebody."}, {"time": 518, "text": "So anyway, to come back, if you understand how games are structured, you can start to realize that there's huge gaps and huge holes in a lot of the thinking behind all of it."}, {"time": 531, "text": "And if you can create the illusion of choice, I'll play one more if you don't mind."}, {"time": 535, "text": "This is one of my favorite ones."}, {"time": 536, "text": "I do this in class all the time."}, {"time": 537, "text": "Have you seen this before?"}, {"time": 539, "text": "Okay, may I ask you some questions please?"}, {"time": 542, "text": "Okay, fantastic."}, {"time": 543, "text": "Oh, there's, everybody wins."}, {"time": 546, "text": "So could you please?"}, {"time": 548, "text": "Could you please pick three fingers and tell me what they are?"}, {"time": 554, "text": "Your pinky."}, {"time": 556, "text": "And your middle finger."}, {"time": 558, "text": "So could you please pick two fingers?"}, {"time": 561, "text": "Your middle finger and your pinky."}, {"time": 564, "text": "Okay, could you please pick one finger?"}, {"time": 567, "text": "I'll go with the middle finger."}, {"time": 568, "text": "Woo hoo."}, {"time": 571, "text": "Pinky."}, {"time": 572, "text": "Okay, let's play again."}, {"time": 574, "text": "Can you pick one finger, please?"}, {"time": 580, "text": "Your middle finger."}, {"time": 581, "text": "Okay, can you pick one finger, please?"}, {"time": 585, "text": "Yeah, your pinky."}, {"time": 587, "text": "Okay, now pick two more fingers, please."}, {"time": 590, "text": "Your middle finger and your ring finger."}, {"time": 594, "text": "Could you please pick one more finger?"}, {"time": 596, "text": "Damn it."}, {"time": 597, "text": "I thought that enhanced the illusion of choice."}, {"time": 600, "text": "It's the illusion of choice."}, {"time": 602, "text": "If I'm asking the questions, provided I ask the right questions, there can be no correct answer."}, {"time": 609, "text": "Doesn't mean that, I mean, ultimately, if that's what you wanted, let's say, like I thought I was guiding you to something I wanted, it turns out that was the outcome you wanted."}, {"time": 617, "text": "Now I'm gonna ask the wrong questions."}, {"time": 619, "text": "I might not get what I wanted, so."}, {"time": 620, "text": "Oh, by the way, sorry to interrupt."}, {"time": 622, "text": "For people that might be just listening to this, that no matter what trajectory we took through that decision tree that Ryan was presenting, it was always ending up with a middle finger, ironically enough."}, {"time": 634, "text": "I was surprised."}, {"time": 635, "text": "So, and."}, {"time": 637, "text": "All of us were surprised, and we're both winners."}, {"time": 639, "text": "Yeah, we all, everyone was."}, {"time": 641, "text": "I felt like a winner."}, {"time": 642, "text": "All right, so now I'm gonna, now I'll ask some different questions, if you don't mind."}, {"time": 647, "text": "Can you please pick two fingers to put down?"}, {"time": 654, "text": "All right, sorry."}, {"time": 654, "text": "Oh, that's so awkward."}, {"time": 655, "text": "That's like the worst finger positions."}, {"time": 657, "text": "Okay, can you please pick, wait a minute."}, {"time": 659, "text": "That's, oh, hold on."}, {"time": 661, "text": "Well, what if you picked two other fingers to put down?"}, {"time": 665, "text": "Your thumb and your pinky."}, {"time": 666, "text": "Okay, my thumb and my pinky."}, {"time": 672, "text": "Whatever two you like."}, {"time": 674, "text": "Okay, your middle finger and your pointy finger."}, {"time": 676, "text": "Ah, okay, can you pick two fingers to put down?"}, {"time": 679, "text": "What's the name?"}, {"time": 680, "text": "It's index finger."}, {"time": 681, "text": "Index finger."}, {"time": 682, "text": "Why did I call it the pointy finger?"}, {"time": 683, "text": "Pointy, it's the pointy one."}, {"time": 684, "text": "That's the one we usually point."}, {"time": 684, "text": "It's weird to point with the ring finger."}, {"time": 688, "text": "Two more to put down, please."}, {"time": 690, "text": "The middle finger and the ring finger."}, {"time": 692, "text": "Ah, man."}, {"time": 694, "text": "What if you pick my ring finger and my index finger?"}, {"time": 698, "text": "Aha, woohoo, I win."}, {"time": 700, "text": "So even though I'm asking the questions, it's not impossible that I arrive at a good outcome for me, but it's no longer guaranteed."}, {"time": 707, "text": "I went from a situation where I literally can't lose."}, {"time": 709, "text": "Yeah, it's pretty low probability."}, {"time": 711, "text": "Right, super low probability."}, {"time": 713, "text": "And the second you realize what I'm doing, you would never let me win because the ball's truly in your court."}, {"time": 718, "text": "So I guess that's kind of what I'm fundamentally trying to put into play almost all the time."}, {"time": 723, "text": "Can I ask the right set of questions?"}, {"time": 725, "text": "Can I develop the ability skills wise, understanding wise, and then discipline wise, and then have the courage and the constitution and the discipline necessary, the patience necessary to ask the proper questions and wait for the proper answers?"}, {"time": 742, "text": "And if I can, assuming the perfect world, I win, period."}, {"time": 749, "text": "Yeah, so does that make sense?"}, {"time": 750, "text": "Yeah, that totally makes sense."}, {"time": 752, "text": "So I don't know if you know sort of the more mathematical discipline of game theory."}, {"time": 756, "text": "There's something called mechanism design."}, {"time": 759, "text": "So game theory is this field where you model some kind of interaction between human beings."}, {"time": 766, "text": "You could model grappling that way."}, {"time": 768, "text": "You can model nuclear conflict between nations that way."}, {"time": 772, "text": "And you set up a set of rules and incentives and then use math to predict what is likely outcome depending over time based on the interaction given those rules."}, {"time": 786, "text": "Mechanism design is the design of games."}, {"time": 791, "text": "So like the design of systems that are likely to lead to a certain outcome."}, {"time": 798, "text": "And so what you're suggesting is you want to discover systems whose decision tree, all the possible things that could happen, feel like there's choice being made, but ultimately one of the parties doesn't have any choice in what the actual final outcome is."}, {"time": 820, "text": "You're making them feel like they're playing a game too."}, {"time": 823, "text": "So it's not like you don't feel trapped."}, {"time": 826, "text": "It's kind of like."}, {"time": 827, "text": "Well, the best traps, you don't look very threatening."}, {"time": 830, "text": "So I'm like, oh, I'll walk over there."}, {"time": 832, "text": "I guess wouldn't that, I guess that's kind of an interesting thing."}, {"time": 836, "text": "If a lion, when does a lion roar?"}, {"time": 838, "text": "It's an interesting thing when you watch like lions hunting."}, {"time": 841, "text": "Don't roar when they hunt."}, {"time": 843, "text": "They want to, when they want to move you back, they do stuff like that."}, {"time": 846, "text": "When they actually want to come and get you, they're pretty slinky."}, {"time": 849, "text": "It's like water covered."}, {"time": 850, "text": "It's like furry water."}, {"time": 852, "text": "And I guess like when you keep that in mind, it's funny how, like for us a hobby actually, a brilliant guy, like one of my MMA coaches and the head coach at TriStar, he brought this up one time."}, {"time": 863, "text": "I thought it was a really salient point."}, {"time": 865, "text": "Said, let's say we have a million person bracket."}, {"time": 867, "text": "Impossibly huge."}, {"time": 868, "text": "Like Frank Dukes went in the Kumite level huge bracket."}, {"time": 871, "text": "He claimed to knock out like 250 consecutive people."}, {"time": 874, "text": "And you're like, that is all of Hong Kong was in that thing."}, {"time": 878, "text": "And everyone kept their mouth shut."}, {"time": 880, "text": "But anyway, that's pretty cool."}, {"time": 881, "text": "But to come back a little improbable, pretty cool."}, {"time": 885, "text": "So let's say for instance, like there's no cheating going on, no cheating going on and we're flipping coins, right?"}, {"time": 891, "text": "Someone is gonna have an unbroken string of victory through that bracket, which is pretty insane."}, {"time": 897, "text": "How many consecutive like toss ups this person won."}, {"time": 901, "text": "And then at the end of it all, imagine like aliens show up and we go, hey, they wanna flip a coin for whether or not Earth, whether or not Earth gets to continue."}, {"time": 912, "text": "They'd be like, oh, I'll do it."}, {"time": 915, "text": "I'm good at this."}, {"time": 917, "text": "That would be tempting as a person to do."}, {"time": 919, "text": "You're like, I'm a lucky guy."}, {"time": 922, "text": "Maybe, I mean, maybe effectively you are."}, {"time": 923, "text": "We could argue that effectively you're incredibly lucky."}, {"time": 925, "text": "But basically is that an actual ability?"}, {"time": 927, "text": "Is that like a perk in a video game or is that just this thing that happened?"}, {"time": 930, "text": "So anyway, how many times are someone, you could go through an entire career, particularly in a fight sport."}, {"time": 937, "text": "Well, let's say you get 15 knockouts and 15 toss up scenarios."}, {"time": 941, "text": "Cause you see that happening all the time in the fight game, a toss up scenario."}, {"time": 943, "text": "It's not like you're mounted on me and that's not a toss up scenario."}, {"time": 947, "text": "Many, many, many, many, many striking scenarios."}, {"time": 949, "text": "A lot of grappling ones, but tons of striking scenarios are dead toss ups."}, {"time": 953, "text": "And somebody wins by knockout."}, {"time": 955, "text": "They win five times in a row."}, {"time": 956, "text": "Then they lose a couple of times in a row."}, {"time": 958, "text": "We go, what happened?"}, {"time": 958, "text": "You're like, what do you mean what happened?"}, {"time": 959, "text": "They were always flipping the coin."}, {"time": 960, "text": "And then they win five more and they go, ah, back on track."}, {"time": 963, "text": "Can you imagine that?"}, {"time": 964, "text": "You're flipping a coin."}, {"time": 965, "text": "I'm like heads, heads, heads, heads, tails."}, {"time": 967, "text": "Tails, tails, heads again."}, {"time": 969, "text": "Oh man, I'm back on it."}, {"time": 969, "text": "I'm flipping good now."}, {"time": 971, "text": "That's basically what's going on."}, {"time": 972, "text": "I think the vast majority of the time and then humanity's tendency to see a sign in almost anything, it starts to present itself."}, {"time": 980, "text": "And then we build a narrative in our mind to convince ourselves that we're in some sort of control."}, {"time": 985, "text": "When in reality, I was in a marginal situation at best the whole time."}, {"time": 990, "text": "Yeah, without having much control, without having a deep understanding of the system."}, {"time": 993, "text": "The same story is told in the stock market."}, {"time": 995, "text": "With many of these distributed human systems, we start telling narratives and start seeing patterns without understanding actually the system that's generating these patterns."}, {"time": 1004, "text": "So if we can see the system, that's incredibly valuable, but then you go, well, what system is above all of the systems?"}, {"time": 1009, "text": "And I guess maybe physics, maybe something like game theory explains these things with like, I guess what are the, what aspects of the system can I put my hands on that I can touch and understand?"}, {"time": 1018, "text": "And what am I missing?"}, {"time": 1020, "text": "What's going on in the world all around me to continue to lean on Dune that I don't have, you talk to a blind person about the world, about the site and talk to someone that doesn't have everyone who's got coronavirus now, so no one can taste or smell."}, {"time": 1034, "text": "They're like, this is delicious, like, is it?"}, {"time": 1037, "text": "So anyway, you know, again, what senses am I missing or what understanding am I missing that's preventing me from seeing the dots connect in the world all around me?"}, {"time": 1048, "text": "And I think sometimes if we are oftentimes at least personally, I've screwed this up a lot."}, {"time": 1053, "text": "I'm so nose deep in the trench of trying to understand what I'm doing that I can't take a step back and realize, you know, that I'm in a forest, not just headbutting a tree."}, {"time": 1062, "text": "And I may be doing both, maybe both, two things should be true at once."}, {"time": 1065, "text": "But so I would say when it comes to strategy, trying to understand that, but then also you go, well, okay, well, how can, that sounds cool, but how can you actually do that?"}, {"time": 1074, "text": "And then I'd say, that's a really good question because if I imagine I say, man, I should fight like Steven Thompson, I should fight like Wonderboy, it's like, good idea, go do that."}, {"time": 1081, "text": "I'm like, not the guy."}, {"time": 1085, "text": "I would fight like Khabib Nurmagomedov if I could."}, {"time": 1087, "text": "You know, it seems to work."}, {"time": 1088, "text": "So anyway, you go, well, what if I could develop, what if I could take my time developing skills so that when these strategies become apparent, they are executable to you."}, {"time": 1099, "text": "You actually have the ability to like, in or to again, to be the person in the arena, to be the person required, whereas there's plenty of great ideas like dunking a basketball is a fantastic idea."}, {"time": 1109, "text": "Alas, for me, unless there's a small trampoline nearby, I'm not the guy."}, {"time": 1113, "text": "But that doesn't make it any less good of an idea."}, {"time": 1115, "text": "I just haven't developed the ability or I lack the ability."}, {"time": 1118, "text": "So anyway, I think a lot of times, at least when I watch people in fighting, I'll use an example."}, {"time": 1123, "text": "We're so concerned with trying to win early on rather than develop skills that I'm going like, well, what's the best way to fight with my current set of skills?"}, {"time": 1131, "text": "And usually the path forward is like the barbarian route, like you put on the one ring, take the damage you need to take to hit that guy."}, {"time": 1139, "text": "And that was something I realized very early on in my MMA career was like, I'm not that good at striking at that time, not a world class striker now, but I'm way better at striking than I'm given any credit for because it helps people sleep at night, I think."}, {"time": 1149, "text": "But I'm serious."}, {"time": 1151, "text": "But... Yeah, yeah, you're always introduced as like this master grappler."}, {"time": 1157, "text": "I'm like, that's nice of them to say that."}, {"time": 1158, "text": "Maybe I'm not that good at grappling."}, {"time": 1159, "text": "We haven't even seen that."}, {"time": 1161, "text": "But the funny thing is where I'm like, just because people almost go like, well, Lex, see, you're really good at this, but you gotta understand, we're equal, man."}, {"time": 1167, "text": "I'm good at this other thing."}, {"time": 1168, "text": "Maybe you're really good at what you do and I'm just mediocre at what I do."}, {"time": 1171, "text": "That's also possible."}, {"time": 1172, "text": "So there's plenty of people that define themselves as a striker that do that just because that's for lack of other options."}, {"time": 1176, "text": "It's not because they're really good striker."}, {"time": 1178, "text": "I'm a grappler."}, {"time": 1178, "text": "I was a grappler as a blue belt."}, {"time": 1181, "text": "So anyway, I guess to come back, if I'm constantly going, how can I win with what I've got right now?"}, {"time": 1187, "text": "I think oftentimes I never take the time to develop the skills that I wanna develop and I also never take the time to develop the strategies that I wanna develop."}, {"time": 1193, "text": "And that has actually been a one big blessing of fighting someone frequently, which has been really frustrating as a result of injuries and time away and some of those people being hesitant to get in the game."}, {"time": 1203, "text": "But it gives you so much time to be out of the trenches and focus on developing your abilities so that now it's almost like developing money like you mentioned the stock market that you can now put in."}, {"time": 1213, "text": "Imagine you told me Bitcoin was a great idea five years ago and I had eight bucks."}, {"time": 1217, "text": "Man, if someone told me Bitcoin was a great idea five years ago and I had 50K, I'd be like, oh my God, I'd be sleeping in my bed of money that I would then set on fire later so they had just to do it."}, {"time": 1226, "text": "So due to all the injuries, you've been mining Bitcoin all this time and now you're a rich man."}, {"time": 1231, "text": "Well, no, actually someone told me I was trying to mine for Bitcoin, actually like in a cave."}, {"time": 1235, "text": "And then I found out recently that it's actually, mining is like a figure of speech."}, {"time": 1239, "text": "You misunderstood."}, {"time": 1239, "text": "Not like a literal thing that you do."}, {"time": 1241, "text": "But I mean, in my defense, I only know what I know."}, {"time": 1242, "text": "English language is difficult."}, {"time": 1243, "text": "It is, it really is."}, {"time": 1245, "text": "Next time talk to me, I'll explain."}, {"time": 1247, "text": "Russian is more, is a rich language."}, {"time": 1250, "text": "You should learn, you should learn Russian."}, {"time": 1252, "text": "I'll help you out."}, {"time": 1253, "text": "I believe you, thank you."}, {"time": 1254, "text": "Can you do a whirlwind overview of your career in MMA leading up to this point with the injuries and the undefeated record?"}, {"time": 1266, "text": "And then what's next since we're on the topic?"}, {"time": 1269, "text": "I did my first fight as a blue belt and I've been training for about a year and a half."}, {"time": 1273, "text": "I did nine Jiu Jitsu tournaments in 10 weekends or maybe eight Jiu Jitsu tournaments in 10 weekends prior to my first fight in April 2006."}, {"time": 1282, "text": "I got punched in the face a whole bunch."}, {"time": 1283, "text": "I didn't realize it was a professional fight and found that out like the day beforehand."}, {"time": 1288, "text": "Thanks, coach."}, {"time": 1290, "text": "It was in Atlantic City where another place no one ever goes on purpose."}, {"time": 1294, "text": "So that wasn't great."}, {"time": 1295, "text": "I got into three, actually three car accidents in the preceding 36 hours before the fight."}, {"time": 1302, "text": "I had my car totaled."}, {"time": 1304, "text": "I wasn't driving for any of them."}, {"time": 1307, "text": "It was 2006?"}, {"time": 1307, "text": "It was 2006, yeah."}, {"time": 1309, "text": "You were a blue belt?"}, {"time": 1310, "text": "Yeah, yeah, I've been training for about a year and a half."}, {"time": 1311, "text": "So you're a blue belt."}, {"time": 1313, "text": "You're getting, I mean, if you haven't lived, if you haven't gotten punched in the face in Atlantic City."}, {"time": 1318, "text": "I mean, I would have loved to have it happen for different reasons."}, {"time": 1323, "text": "But yeah, well, what's funny is I remember getting punched in the face a bunch, trying to do inverted guard."}, {"time": 1328, "text": "I won one round, lost two rounds, definitely lost the fight."}, {"time": 1332, "text": "So you went for inverted, sorry to interrupt."}, {"time": 1333, "text": "You went for inverted guard."}, {"time": 1334, "text": "Can you tell the story of that fight real quick?"}, {"time": 1337, "text": "It was three three minute rounds, which is not a professional fight length, although I don't know if professional fight length would have been any better."}, {"time": 1342, "text": "It's just more time to get punched."}, {"time": 1344, "text": "But I found out partway through, I was like, I remember walking back to my corner in the first round, I'm like, yeah, this guy can't hurt me."}, {"time": 1349, "text": "And he's like, yeah, my corner was my friend, Tom, and then someone else."}, {"time": 1352, "text": "And then he's like, yeah, I would still encourage you to stop blocking so many punches with your face."}, {"time": 1356, "text": "I'm like, that's a good idea, Tom, I appreciate that."}, {"time": 1357, "text": "I'm gonna try that."}, {"time": 1359, "text": "Anyway, I remember I was not allowed to up kick."}, {"time": 1363, "text": "So I'm like, great."}, {"time": 1363, "text": "I had no martial arts skills, really at all."}, {"time": 1366, "text": "But if I had anything at all, it was jiu jitsu."}, {"time": 1368, "text": "It was very, very little jiu jitsu."}, {"time": 1370, "text": "But definitely no wrestling, definitely no striking."}, {"time": 1373, "text": "I was basically a magnet for punches."}, {"time": 1375, "text": "So that was your time, roughnecking out in Atlantic City as we all do once in a while."}, {"time": 1381, "text": "Can we fast forward to when you're actually dominating the world as a black belt?"}, {"time": 1384, "text": "Well, actually, it's funny, because I took a little bit of money that they're like, hey, we're paying you."}, {"time": 1388, "text": "It's like Bukowski stories with Ryan Hall."}, {"time": 1391, "text": "Well, then I went to the casino."}, {"time": 1393, "text": "I went to whatever, like the Tropicana that was right there, the casino, because that was a boardwalk hall."}, {"time": 1397, "text": "I'm like, you know what, man?"}, {"time": 1398, "text": "This has been a not great evening."}, {"time": 1400, "text": "I'm gonna win it back."}, {"time": 1402, "text": "This will be great."}, {"time": 1403, "text": "15 minutes later, they had all the money that I had from the fight was gone."}, {"time": 1407, "text": "I just remember walking out of the casino super pissed."}, {"time": 1410, "text": "And I don't know what I was thinking."}, {"time": 1412, "text": "I'm not good at gambling."}, {"time": 1413, "text": "This was not gonna make my night better."}, {"time": 1415, "text": "I just thought that there was gonna be some sort of cosmic balancing, and maybe it was the cosmic balancing all at once for things I'd done in the past."}, {"time": 1420, "text": "Longer term, though, the balancing."}, {"time": 1425, "text": "We're all dead in the end, though."}, {"time": 1427, "text": "Time will get us all, yeah."}, {"time": 1430, "text": "Well, so that was the first one, and that was when I realized I'm terrible at MMA, but I like it."}, {"time": 1435, "text": "I should just stop this until I one day learn how to actually grapple, much less learn how to fight."}, {"time": 1439, "text": "But I remember there was this guy named Dave Kaplan, who's the reason my ears are all messed up, who was on the Ultimate Fighter and got punched in the face and knocked out by Tom Lawler, who I'll always appreciate for doing that."}, {"time": 1450, "text": "Dave or Tom?"}, {"time": 1451, "text": "I appreciate Tom."}, {"time": 1452, "text": "I appreciate Dave, too."}, {"time": 1453, "text": "Dave was great."}, {"time": 1454, "text": "Dave was just a huge bully, and used to, not completely unmercifully, but relatively unmercifully beat the crap out of me."}, {"time": 1459, "text": "And anyway."}, {"time": 1461, "text": "Well, the ears look good, so."}, {"time": 1462, "text": "I appreciate that."}, {"time": 1463, "text": "I tell people it's a tumor that I got, and if they want in on a class action lawsuit with AT&T, they should send me an email."}, {"time": 1472, "text": "Well, you're very financially savvy."}, {"time": 1474, "text": "No, I just give the impression."}, {"time": 1476, "text": "Dave basically said, hey, don't worry, man."}, {"time": 1477, "text": "You're never gonna be good at MMA."}, {"time": 1479, "text": "And you're never gonna be good at grappling, either, but even if you are good at grappling, which, in my opinion, you will never be, you will never be good at fighting."}, {"time": 1486, "text": "And I said, Dave, if I do nothing else in my life, I'm gonna keep training until I can make you pay for that."}, {"time": 1492, "text": "And now that I can make him pay for that really easily, he doesn't train anymore."}, {"time": 1495, "text": "But I love Dave."}, {"time": 1496, "text": "Dave's awesome."}, {"time": 1497, "text": "He actually won the singing beat."}, {"time": 1498, "text": "What an interesting dude."}, {"time": 1499, "text": "Super interesting guy."}, {"time": 1500, "text": "Virginia, like, speaks a couple languages."}, {"time": 1504, "text": "Like, shockingly good at Jeopardy, too."}, {"time": 1507, "text": "Not that I'm any good, but still shockingly good at Jeopardy."}, {"time": 1509, "text": "So anyway, years later, met Faraz Zahabi."}, {"time": 1511, "text": "Actually, John Danaher, I met John Danaher, and he put me in touch with Faraz Zahabi."}, {"time": 1515, "text": "I started training at TriStar."}, {"time": 1516, "text": "I immediately loved working with Faraz and learning under Faraz."}, {"time": 1519, "text": "Started training at TriStar."}, {"time": 1520, "text": "And I did my first real professional MMA fight as someone that actually does, had practiced a little bit prior in, I think, August, 2012."}, {"time": 1531, "text": "And that was against a guy, he was four and five at the time."}, {"time": 1534, "text": "So, you know, had some experience, good kind of like first go for me, honestly."}, {"time": 1538, "text": "And I won that fight by TKO."}, {"time": 1540, "text": "And then it was a little bit of a time off."}, {"time": 1542, "text": "And then I did another fight against a tough guy named Magid Hamo."}, {"time": 1545, "text": "He was five and two at the time."}, {"time": 1547, "text": "I think he was three and I was amateur."}, {"time": 1548, "text": "So, you know, a good little bit of fighting experience."}, {"time": 1550, "text": "Won that one in the first round of Iron Rear Naked Choke."}, {"time": 1553, "text": "And then started to experience difficulty getting fights at that point."}, {"time": 1559, "text": "You know, I..."}, {"time": 1559, "text": "Were you continuously introduced as like the master of grappling, the submission?"}, {"time": 1564, "text": "At least that was my thing."}, {"time": 1565, "text": "I don't know if I was... Is that was the source of the fear for people?"}, {"time": 1568, "text": "I think so, because, I mean, I definitely wasn't much at striking at that point."}, {"time": 1572, "text": "You know, I definitely am a lot, I like to think I'm pretty hard to hurt, although I try not to lean on that."}, {"time": 1577, "text": "And I played baseball for like 16 years, so I can hit things pretty hard."}, {"time": 1580, "text": "I just wasn't able to, I recognized pretty early on that I had no idea how to actually hit things hard without becoming hitable myself."}, {"time": 1588, "text": "So I think that's kind of the big thing is a lot of times, like we almost were mentioning before, if you try to go and get people too early, you can hit them if they're not that good, but you're going to get hit yourself."}, {"time": 1600, "text": "So you're making, you're basically making a wager."}, {"time": 1602, "text": "You're making a trade of your own life for the ability to hit them."}, {"time": 1605, "text": "When you watch guys like Israel Adesanya, Floyd Mayweather, Steven Thompson, Conor McGregor, when he's fighting really well, it's not a trade."}, {"time": 1613, "text": "They're not, you're hitting them and they're hitting you."}, {"time": 1615, "text": "It's, they're hitting you, but it takes years and years and years and years to be able to learn how to do that."}, {"time": 1620, "text": "Ton Lee is another great example of that."}, {"time": 1621, "text": "You know, my closest training partner, one of my best friends, and currently now one champion, one championship in Asia, the champion of the featherweight, or I guess lightweight featherweight, 155 over there now."}, {"time": 1634, "text": "And he recently defeated Martin Wynn in a really great fight."}, {"time": 1637, "text": "And Ton knocked him out, long time champion."}, {"time": 1639, "text": "And Ton doesn't let you hit him."}, {"time": 1641, "text": "He doesn't let you touch him."}, {"time": 1642, "text": "I feel so fortunate to have met guys like Steven and Ton to go early on in career and go, holy moly, I can't even, it's not even like, oh, you'll let me walk over and find you."}, {"time": 1652, "text": "It's like fighting a ghost that periodically shows up with a hammer and smokes you in the melon and then disappears into the ether again."}, {"time": 1658, "text": "So the way they approach the fighting game is thinking, how can I attack without being hit?"}, {"time": 1662, "text": "So every strategy, every idea you have about what you're going to do has to do with like that minimizing the returns."}, {"time": 1673, "text": "I mean, that's what all good fighting is done."}, {"time": 1674, "text": "All poor fighting, you know, throughout the course of history, most generals, whether they're, so I read, or, you know, they did battles by attrition."}, {"time": 1681, "text": "You know, it's like, yeah, man, I've got 150 guys."}, {"time": 1683, "text": "You've got 50."}, {"time": 1684, "text": "You're like, yeah, if 60 of my guys die killing your 50, like, that's great for me."}, {"time": 1688, "text": "But that's not so great for the 60 guys that died."}, {"time": 1690, "text": "You know, I hope it's worth it."}, {"time": 1691, "text": "So when you realize that not only, you're not just Kobe Bryant and you're Phil Jackson too, you got to do everything."}, {"time": 1697, "text": "You know, if you've got to run across the beach in Normandy, so be it."}, {"time": 1701, "text": "But that better be, you should have, we make sure we thought this through and there's like, hey, there's no way we can like, you know, walk around the side, huh?"}, {"time": 1707, "text": "Because oftentimes there is, and I think a lot of times there's a lot of incentives in professional fighting too, for people to want to do that."}, {"time": 1714, "text": "And we come up with all sorts of, well, I'm trying to be exciting."}, {"time": 1719, "text": "Is that really what you came here to do?"}, {"time": 1720, "text": "Cause I came here to win."}, {"time": 1721, "text": "And I think that anyone that's really successful came there to win."}, {"time": 1724, "text": "And if it ends up being exciting, well, that's fantastic."}, {"time": 1726, "text": "I hope that people enjoy watching something and that's great, but that's a qualitative assessment anyway."}, {"time": 1731, "text": "You know, you want to also be able to, you know, live the rest of your life."}, {"time": 1735, "text": "I think it's easy, you know, I'll use Meldrick Taylor."}, {"time": 1737, "text": "I'm a big boxing fan."}, {"time": 1738, "text": "Meldrick Taylor was an excellent fighter, came this close to a world title and was stopped with like, he was in a fight that he was winning with seconds remaining, literally seconds remaining."}, {"time": 1748, "text": "And they probably could have just let it go and he would have been world champion."}, {"time": 1751, "text": "And it was brutal."}, {"time": 1752, "text": "If you ever watched legendary nights like a HBO boxing show, it's great, but it's heartbreaking."}, {"time": 1757, "text": "It's absolutely heartbreaking."}, {"time": 1758, "text": "And also like the beating that he absorbed in that fight changed him for the rest of his life."}, {"time": 1762, "text": "And also, you know, don't think he'd never been hit before, but it was one of those where you go, it's all fun and games until you can't remember your name at age 44 years old."}, {"time": 1771, "text": "And I didn't come here, what did Patton saying?"}, {"time": 1775, "text": "Nobody wins a war by dying for his country."}, {"time": 1777, "text": "You make the other poor bastard die for his."}, {"time": 1779, "text": "And I think that that's kind of what we're shooting for."}, {"time": 1782, "text": "And, you know, the lionization of absorbing damage and that not being a big deal, like you hear that all the time."}, {"time": 1789, "text": "So and so can take shots that would put a lesser fighter down."}, {"time": 1794, "text": "You know, like, so let me get this straight."}, {"time": 1796, "text": "Your ability to absorb damage is a part of you."}, {"time": 1799, "text": "I mean, I guess that, don't get me wrong, that is an attribute that's nice to have if you need it."}, {"time": 1803, "text": "But there's plenty of people that actually have really porous defense that are just very, very difficult to hurt for whatever reason."}, {"time": 1810, "text": "That's a fascinating fighter's perspective on the thing."}, {"time": 1812, "text": "I mean, the story that is inspiring and I know it goes against the artistry of fighting is when you have taken the damage to still rise up and be able to defeat the opponent."}, {"time": 1829, "text": "So it's, but that's a flip side of a basically you failing to defend yourself properly, right?"}, {"time": 1839, "text": "But let's say for, I think it's a triumph, that's a triumph of humanity."}, {"time": 1842, "text": "That's a triumph, that's amazing."}, {"time": 1844, "text": "To witness such a thing is unbelievable."}, {"time": 1846, "text": "But you still go, this is, there is a cost here."}, {"time": 1850, "text": "It's like, I've been fortunate enough to spend some time working with the military and I've been like around and read Medal of Honor citations, they're unbelievable."}, {"time": 1857, "text": "Like you read the story and you're like, it'll floor you."}, {"time": 1860, "text": "But it's still a cost and you don't wanna be paying that cost a long time."}, {"time": 1863, "text": "And most of the time the cost was everything."}, {"time": 1866, "text": "And then sometimes you go, hey, yeah, the value here, it's worth everything."}, {"time": 1870, "text": "It's like, I defend your family, defend your country under certain circumstances."}, {"time": 1874, "text": "And if that point is extension of your family, you're like, hey, this is worth it."}, {"time": 1877, "text": "To casually throw your life away or throw your health away, it's foolish."}, {"time": 1881, "text": "There's nothing great about that."}, {"time": 1882, "text": "And like you said, it's still an amazing thing to see, but."}, {"time": 1886, "text": "But it's also amazing to see you not take damage as the Floyd Mayweather, it's the artistry of like not being hit."}, {"time": 1892, "text": "And I wonder if maybe that's why people don't resonate with Floyd as much, is obviously Muhammad Ali was such a time and place, a great man for so many different reasons."}, {"time": 1898, "text": "Although it was funny to remember like there were times when he wasn't very popular."}, {"time": 1902, "text": "We love him now because of time of context, time to move away from some of the nonsense he had to deal with."}, {"time": 1907, "text": "But we got to see him struggle."}, {"time": 1909, "text": "And also he had unbelievable sacrifice, both in and out of the ring, that we all got to witness."}, {"time": 1915, "text": "We've never really seen Floyd struggle like that."}, {"time": 1918, "text": "And granted, obviously Floyd isn't like a civil rights figure like Muhammad Ali was, it's different time, different place, and he's a different man."}, {"time": 1923, "text": "But basically, I wonder if part of the thing that made everyone think of Muhammad Ali as the greatest, in addition to, of course, the unbelievable things that he did out in the world and the stands that he made, we saw him struggle in the ring."}, {"time": 1937, "text": "It's almost, it's humanizing."}, {"time": 1939, "text": "You know, it's weird when people respect Khabib, but again, we saw GSP lose and GSP came back stronger."}, {"time": 1946, "text": "Khabib is amazing."}, {"time": 1948, "text": "But I wonder how people feel about him longterm."}, {"time": 1951, "text": "Not like they won't think of him as amazing and great."}, {"time": 1953, "text": "And he's been a respectable person and champion."}, {"time": 1955, "text": "But the time, he hasn't had to fall, if that makes sense."}, {"time": 1961, "text": "And also coupled with Ali had a way of being poetic about sort of the way he was in the ring, sort of being able to explain the artistry that he, I mean, there's like joking as being playful, but really he was able to describe the flow, like a butterfly sting like a bee."}, {"time": 1979, "text": "Like he was able to actually talk about his strategy without talking, without crossing that line into the Floyd Mayweather, when you're just talking about money and just talking shit."}, {"time": 1992, "text": "Actually Conor McGregor, when he's not talking shit, it's pretty good at like talking about the art of the martial, like the first mug guy."}, {"time": 1999, "text": "And I wish Khabib did the same."}, {"time": 2002, "text": "Actually from like the Setia brothers, there's a few, there's a culture of like being poetic about like being scholars and also bards or whatever, the poets of the game."}, {"time": 2017, "text": "And Khabib was more like just simple and he lets his actions speak, which is great too."}, {"time": 2024, "text": "It's a cool thing in its own way."}, {"time": 2026, "text": "But it's nice when you can tell stories and that's probably why Ali was the great."}, {"time": 2033, "text": "Catch me up to, you went to three fights, I think undefeated, BJ Penn, we talked about last time you defeated BJ Penn."}, {"time": 2042, "text": "That's an incredible accomplishment, but you fought a lot of really tough guys."}, {"time": 2050, "text": "When was your last fight?"}, {"time": 2052, "text": "And then catch me up with the injuries."}, {"time": 2054, "text": "A lot of people kept more and more and more were unwilling to fight you."}, {"time": 2060, "text": "Yeah, that's been, that was why I was out for two years following the Gray Maynard fight between the fighting Gray and BJ and the Gray Maynard fight was actually one I'm really proud of because Gray was very tough."}, {"time": 2071, "text": "He's very big, very strong, very experienced."}, {"time": 2073, "text": "I had only five fights at the time and I didn't have a lot of skills."}, {"time": 2078, "text": "I don't get to fight Gray with what I have today."}, {"time": 2080, "text": "I had to fight Gray with what I had in December, 2016."}, {"time": 2083, "text": "And that, it really took a lot of discipline, a lot of focus, a lot of challenge, to stay the course, to do what I needed to do in that fight and to win in ultimately dominating fashion, just not in the dominating, obvious sense that you see when someone runs across and just does that to somebody, but that wasn't on the list for me at that time."}, {"time": 2101, "text": "So that was an interesting one, but the time away again was very frustrating."}, {"time": 2105, "text": "That was incredibly difficult."}, {"time": 2107, "text": "Before that fight?"}, {"time": 2108, "text": "After that fight, well, because I beat Artem Lobov in the final of the Ultimate Fighter and Artem is another guy that's tough, a lot of experience and he's a funny guy and he said some things on the internet, so he gets a lot of heat for that."}, {"time": 2122, "text": "But he just knocked out three of my teammates."}, {"time": 2124, "text": "I'm like, he put a couple of people in a pretty rough shape at the end of that."}, {"time": 2128, "text": "So he was doing well and that was a tough fight."}, {"time": 2129, "text": "Again, if I got to go back and fight that fight now, it would be not competitive at all."}, {"time": 2134, "text": "I mean, it wasn't competitive at that time, but it was a compelling phase."}, {"time": 2136, "text": "It wasn't close, but it was competitive."}, {"time": 2138, "text": "So you were improving and growing fast."}, {"time": 2140, "text": "Yeah, and it was nice to have time away."}, {"time": 2142, "text": "I wish I'd had more time in the ring, but again, I'd only been doing MMA for three years at that time."}, {"time": 2146, "text": "So the improvement from doing what, the Bitcoin mining was overriding the ring rust."}, {"time": 2155, "text": "I don't really believe in ring rust, if I'm honest."}, {"time": 2157, "text": "I can understand why people could feel a certain way, but if anything, it's almost like you just kind of forget what competition's like and you realize like, oh, you feel butterflies or something like that and you go, oh my God, this is different versus no, that's just your body getting ready to perform."}, {"time": 2170, "text": "It's okay, it's normal."}, {"time": 2171, "text": "How do you not have ring rust?"}, {"time": 2173, "text": "I think I try to practice performing no matter what, whether it's singing karaoke and I'm very good, but like anything, you name it, talking in front of people."}, {"time": 2181, "text": "You embrace the butterflies."}, {"time": 2183, "text": "Yeah, it's almost like, I remember my last fight, I'm just staring at the wall and I'm like, huh, I guess I'm gonna fight in a couple of minutes."}, {"time": 2193, "text": "I mean, of course we all heard the phrase, like you can never walk in the same river twice because even if the river's the same, you're a different man."}, {"time": 2199, "text": "That's, I think it's a really important thing to understand because at various points in my martial arts career, I've thought, oh man, how should I feel?"}, {"time": 2207, "text": "I remember when I used to do well in competition, I would feel, I would think these thoughts, listen to this song, think about this."}, {"time": 2213, "text": "I would feel a certain way."}, {"time": 2214, "text": "And then if you don't feel that way, I would start to become stressed because I was self inflicted versus going, you'll feel how you feel."}, {"time": 2221, "text": "Your job is to show up with what you have on the day, do your absolute best."}, {"time": 2225, "text": "It's like, I will never quit."}, {"time": 2226, "text": "I can be sure of that."}, {"time": 2227, "text": "I didn't say I can't be beat."}, {"time": 2228, "text": "I can definitely be beat."}, {"time": 2229, "text": "I could have lost every single fight that I've ever had, but I control my effort and I control my attitude."}, {"time": 2234, "text": "And that's, I will do my very best, execute my game plan and the event's not working."}, {"time": 2239, "text": "If I have to, I'll put my hands up and walk dead forward."}, {"time": 2241, "text": "If I need to, it's somebody, we hope that that's not where it goes, but like again, that humanizing moment where you're shooting for like just the inner, like the inner, you sacrifice the outer and all you have left is will, and you hope it doesn't happen."}, {"time": 2254, "text": "But if it does, you'll be there."}, {"time": 2256, "text": "But I guess to come back, like the extra periods of time in between fights, I think was valuable because it was deeply challenging."}, {"time": 2263, "text": "It was incredibly, it was heartbreaking sometimes if I'm honest, man."}, {"time": 2267, "text": "It's like, I didn't want to."}, {"time": 2268, "text": "It's just waiting."}, {"time": 2269, "text": "Oh my God, dude."}, {"time": 2270, "text": "Is there politics involved?"}, {"time": 2272, "text": "There's a."}, {"time": 2272, "text": "Sometimes, you know, like I, you know, it's every single time you step into the ring, nothing's guaranteed."}, {"time": 2281, "text": "It's, you could be hurt."}, {"time": 2283, "text": "You could hurt somebody."}, {"time": 2284, "text": "You could win."}, {"time": 2284, "text": "You could lose, you know, throwing away, just like I said, throwing away your healthier life cheaply makes no sense for anyone."}, {"time": 2292, "text": "And, you know, having demonstrating some degree of temperance is not cowardly either."}, {"time": 2297, "text": "I mean, but again, if you wait too long, you have nothing."}, {"time": 2300, "text": "So I guess like I was trying and always being, I'm always open to fighting the absolute best people possible."}, {"time": 2307, "text": "I'm never turning down fights ever."}, {"time": 2310, "text": "You know, if some random jabroni decides that he wants to fight, I'm like, go away."}, {"time": 2313, "text": "If I wanted to just fight randoms, I would just start standing on the table at Denny's and start yelling."}, {"time": 2318, "text": "And I'm sure it would have, you know, some people would be willing to indulge me."}, {"time": 2321, "text": "But, you know, you want to fight, you know, meaningful opponents, challenging opponents, and I know who and where they are."}, {"time": 2328, "text": "And sometimes they're so well."}, {"time": 2329, "text": "You did fight in Atlantic City."}, {"time": 2331, "text": "So the Denny's, but you put the Denny's behind you."}, {"time": 2333, "text": "And, you know, I'll be honest, if I'd have stood up after that fight, I don't know if I was in great shape to expect to win in the other fights that evening, but I could have tried it."}, {"time": 2341, "text": "I'm sure there were some takers in the crowd, particularly after they watched me fight, they're like, yeah, I'll fight that guy."}, {"time": 2345, "text": "So, okay, so when was the last fight that you had?"}, {"time": 2347, "text": "That was Darren Elkins."}, {"time": 2348, "text": "That was six months or seven months after the BJ fight, which is great because it's, you know, I love maybe five really tough, very tough opponent, very tough guy, super tough dude."}, {"time": 2356, "text": "And that was in July, 2019."}, {"time": 2359, "text": "And then right when I was about to fight."}, {"time": 2362, "text": "So you were ready to fight regularly after that."}, {"time": 2365, "text": "You were trying to find a fight."}, {"time": 2367, "text": "And we got Ricardo Llamas, so no one else, none of the, I was ranked in the top 15 at that point."}, {"time": 2371, "text": "And then people didn't want to fight."}, {"time": 2374, "text": "We were struggling to find an opponent."}, {"time": 2375, "text": "Then Ricardo Llamas, a great, you know, former title challenger, you know, MMA, you know, really great history in MMA, recently retired, but we were supposed to fight in, I think May, March, March, May of 2020."}, {"time": 2387, "text": "And then coronavirus happened."}, {"time": 2389, "text": "And so that scrapped the whole show, you know, training."}, {"time": 2392, "text": "We were just scrambling to try to keep the gym alive and take care, you know, I have five or six full, five, six, I think five full time employees that I, you know, they're my responsibility."}, {"time": 2401, "text": "I have to, their livelihood is in my hands and it's, they'd be irresponsible of me to not take that seriously."}, {"time": 2407, "text": "So anyway, we were able to navigate through that time."}, {"time": 2410, "text": "And then we were able to reschedule the Llamas fight."}, {"time": 2413, "text": "And that was in August of last year."}, {"time": 2415, "text": "And I got a, a medical like flag, like, oh, hey, you like, you, you, you have like a medical condition that we need to look into when I got pulled from the fight."}, {"time": 2425, "text": "And I immediately was concerned because of course, any serious medical condition you want to go, oh man, well, I guess I would like to look at that."}, {"time": 2431, "text": "Yeah, it turns out it was a giant false positive."}, {"time": 2434, "text": "And, you know, we find that out, you know, all of five weeks later and you go, you gotta be kidding me."}, {"time": 2439, "text": "That's frustrating."}, {"time": 2440, "text": "And then we're still waiting for a fight, waiting for a fight, waiting for a fight, waiting for a fight."}, {"time": 2444, "text": "People won't sign up."}, {"time": 2446, "text": "Asked for a number of different opponents, basically said, Hey, I'm willing to fight anybody that's, that's tough and moving forward."}, {"time": 2453, "text": "Finally got a, you know, a great opponent in Denny Gay for, I guess it would have been this, this March."}, {"time": 2461, "text": "And then I was training in January, working on working on some stuff."}, {"time": 2465, "text": "I was out training with Raymond Daniels in, in California, Raymond's amazing, unbelievable, you know, kickboxing, karate style kickboxer, fantastic martial artist, great teacher, great training partner and good friend."}, {"time": 2476, "text": "And, you know, just really bad luck, you know, kind of a fall in the middle of, in the middle of training."}, {"time": 2481, "text": "And I tore my hip flexor halfway off of my femur."}, {"time": 2487, "text": "And you go like, man, right at the time where you're like, oh man, all right, finally moving forward, you know, having the opportunity to fight."}, {"time": 2492, "text": "Dan's a really tough guy."}, {"time": 2493, "text": "You know, you have to fight well if you want to have a good chance to do well with him."}, {"time": 2496, "text": "If you don't fight well, it's going to be a rough night."}, {"time": 2498, "text": "And I'm like, that's exactly what I signed up for."}, {"time": 2499, "text": "That's what we want with BJ, that's what we want with Elkins, that was gray."}, {"time": 2503, "text": "And then the universe goes, hey man, I hear you, but there's also this."}, {"time": 2506, "text": "So anyway, unfortunately it's healing up and then hopefully I'm trying to, looking for May, I think."}, {"time": 2512, "text": "May this year?"}, {"time": 2514, "text": "May of this year."}, {"time": 2516, "text": "So it's been, it's been, it's been about five weeks since the injury."}, {"time": 2518, "text": "You'll be able to heal up, you think?"}, {"time": 2520, "text": "Yeah, I think it'll be okay by then."}, {"time": 2521, "text": "Like I don't need a big camp at this point."}, {"time": 2523, "text": "I've had years of camp."}, {"time": 2526, "text": "Not going to curtail my drinking or anything like that."}, {"time": 2528, "text": "Obviously, you know, come on, man."}, {"time": 2529, "text": "Life is meant to be lived."}, {"time": 2530, "text": "And you know, so it's, you know, I'm in good shape."}, {"time": 2534, "text": "I always, I'm always training."}, {"time": 2535, "text": "I'm trying to do my best to train around the injury to the extent that I can right now without, you know, hurting myself longterm."}, {"time": 2541, "text": "So is there a particular opponents you're thinking about?"}, {"time": 2543, "text": "Anybody, anybody forward?"}, {"time": 2545, "text": "You know, I mean, I tried to, I asked, I asked the second that I got hurt, I sent a message to Dan and I said, hey man, like I just want you to be the first person to know."}, {"time": 2554, "text": "You know, I just was pretty reasonably injured."}, {"time": 2556, "text": "We just got an MRI."}, {"time": 2557, "text": "Doctor says like, hey man, you're out and you need to take like three weeks off, off."}, {"time": 2561, "text": "Don't do anything."}, {"time": 2561, "text": "Or you're going to immediately, you're going to tear it the whole way."}, {"time": 2563, "text": "And this is going to be surgery."}, {"time": 2565, "text": "And then it's going to be an additional, like eight weeks on top of that to start to rehab it through PT."}, {"time": 2569, "text": "And anyway, you know, so I let him know, hey, if you can push this thing back, I would love to keep on the car."}, {"time": 2575, "text": "I would love to keep the fight."}, {"time": 2575, "text": "You know, it's like, I respect you a lot as an opponent."}, {"time": 2577, "text": "And also it's been brutal trying to get anybody to sign on."}, {"time": 2580, "text": "So if you're into it, I'm still there."}, {"time": 2582, "text": "Unfortunately, he turned that down."}, {"time": 2583, "text": "I understand he had other things going on and he and his wife were expecting a child coming up."}, {"time": 2587, "text": "So he needed to, he needed to fight."}, {"time": 2589, "text": "And anyway, you know, I guess we'll see who's coming forward."}, {"time": 2593, "text": "Is there somebody like super tough in the featherweight division that you, you seem to like enjoy the difficult puzzles."}, {"time": 2601, "text": "Is there somebody especially difficult that you would like to fight?"}, {"time": 2605, "text": "I would like to fight."}, {"time": 2607, "text": "I know that I'll need to win at least one fight before this."}, {"time": 2610, "text": "And I look forward to coming back and giving my best effort to do that."}, {"time": 2614, "text": "I want to fight to beat Megumin Sharapov."}, {"time": 2616, "text": "I want to fight Yair Rodriguez."}, {"time": 2618, "text": "I want to fight Korean Zombie."}, {"time": 2621, "text": "And you know, this is complicated, man."}, {"time": 2623, "text": "Yeah, that would be fun."}, {"time": 2625, "text": "I would love to see that fight."}, {"time": 2626, "text": "That's a fascinating fight."}, {"time": 2627, "text": "That would be fun."}, {"time": 2629, "text": "He would be very challenging."}, {"time": 2630, "text": "All those guys are very challenging."}, {"time": 2632, "text": "And so I look forward to just staying healthy to the extent that we can coming back and I'm going to fight multiple times this year, hell or high water."}, {"time": 2640, "text": "Hell yes."}, {"time": 2641, "text": "Hey, by the way, I completely forgot because you were talking about the systems and decision trees and the illusion of choice made me think of Sam Harris and I forgot to mention it."}, {"time": 2652, "text": "So he talks about free will quite a bit and that there's an illusion of free will."}, {"time": 2658, "text": "So it's like the."}, {"time": 2659, "text": "Bold claim, Cotton."}, {"time": 2660, "text": "That the, you know, maybe the universe constructed that little game where it makes us feel like we have a bunch of choices, but we really don't."}, {"time": 2670, "text": "We're really always ending up with a middle finger."}, {"time": 2672, "text": "That would be hilarious."}, {"time": 2673, "text": "Yeah, that's it."}, {"time": 2675, "text": "That's what you see before you die."}, {"time": 2677, "text": "It's just a giant middle finger."}, {"time": 2678, "text": "It's like, oh, fuck."}, {"time": 2680, "text": "I knew it."}, {"time": 2683, "text": "Do you think there's a free will?"}, {"time": 2684, "text": "Like we feel like we're making choices."}, {"time": 2685, "text": "So you're thinking, again, what we're talking about, okay, here's a system of martial arts that's Hanzo Gracie, there's different schools and whatever, and then you're thinking, okay, how can I think outside these systems?"}, {"time": 2698, "text": "But then there's also a system that's our human society and we feel like there's an actual choice being made by us individuals."}, {"time": 2711, "text": "Do you think that choice is real?"}, {"time": 2712, "text": "Or is it just an illusion?"}, {"time": 2713, "text": "Well, okay, that's a really good question."}, {"time": 2715, "text": "I'm not necessarily equipped to answer this, but I'll do my best."}, {"time": 2718, "text": "Okay, I guess I would say to start with, sure would be interesting if it wasn't real, if the choice wasn't real, would be pretty interesting if it is real."}, {"time": 2727, "text": "First off, I would start with facilitative beliefs versus not facilitative beliefs."}, {"time": 2731, "text": "It's almost like, I think the world's out to get me."}, {"time": 2735, "text": "True, not true, what next?"}, {"time": 2738, "text": "Probably not a facilitative belief."}, {"time": 2739, "text": "Even if you, imagine you believe there's no free will."}, {"time": 2743, "text": "Okay, now what?"}, {"time": 2745, "text": "Does that justify every single impulse that you're going to give into?"}, {"time": 2750, "text": "Or does the belief in free will, does the belief in my ability to work hard, to focus, to be disciplined, to improve my position, improve my situation, whether it's true or not, although I think that at least many of us would argue that at least whether there's some sort of internal driver that allows for that."}, {"time": 2768, "text": "We live in a material world."}, {"time": 2769, "text": "Your actions do affect the world."}, {"time": 2771, "text": "I can choose to pick that water up or not."}, {"time": 2805, "text": "We're about to have two very different conversations."}, {"time": 2807, "text": "I could be right that this person's not very polite or thinks negatively of me right from go, but I think that that's probably not a facilitative belief."}, {"time": 2816, "text": "People talk about, how is that gonna help me navigate the conversation to a positive conclusion?"}, {"time": 2822, "text": "And I think about that for, let's say, fighting, it's a good example, like confidence, plenty of people believe plenty of things that aren't real, myself included, I'm sure, all the time."}, {"time": 2832, "text": "And anyway, believing that you can do something, I'm like, hey, I think I can win, doesn't guarantee you a positive outcome, but I would say most of us would probably, most of us would argue that it helps."}, {"time": 2843, "text": "Think about depression."}, {"time": 2845, "text": "What's depression if not a negative, unfacilitative belief that is not always, that oftentimes is not reflected by reality, but you project it onto reality, and it's understandable if it makes you feel like, oh, man, this isn't gonna work out, I don't think the prospects are going well."}, {"time": 2860, "text": "And then if you feel like you can't get out of that loop, that seems pretty rough."}, {"time": 2864, "text": "And I see a lot of things out in society right now where you go, whether you agree or disagree with various positions on things, you go, is that a facilitative belief?"}, {"time": 2871, "text": "Even if that is true, which is arguable, anything."}, {"time": 2875, "text": "So what next, man?"}, {"time": 2876, "text": "So where does this end?"}, {"time": 2877, "text": "When is the positive, what's the happy ending here?"}, {"time": 2880, "text": "And if they go, well, there is no happy ending, I'm like, okay, so now what?"}, {"time": 2884, "text": "So what do we do here?"}, {"time": 2885, "text": "And I guess."}, {"time": 2886, "text": "So choose the facilitative belief, and in your intuition, believing that free will is real is more productive for a successful life."}, {"time": 2897, "text": "Absolutely, because otherwise, how am I not, first off, how can society function if it's not real?"}, {"time": 2904, "text": "So how can I blame you or anyone else or hold anyone responsible for anything if free will isn't real?"}, {"time": 2911, "text": "Well, no, that's exactly the point."}, {"time": 2913, "text": "But at the surface level, what you're saying is true, but perhaps if we truly internalize that free will is an illusion, we'll start to figure out something that transforms the way we see society."}, {"time": 2927, "text": "For example, we are very individual centric, so believing that free will is real puts a lot of responsibility and blame on people when they do something bad."}, {"time": 2941, "text": "Maybe if we truly internalize that free will is an illusion, we start to think about the system of humans together as this mechanism for progress, as opposed to where individual people are responsible for their actions, good or bad."}, {"time": 2960, "text": "So we remove the value, the weight we assign to the accomplishments or the violence, the negative stuff done by individuals, or more look at the progress of society."}, {"time": 2972, "text": "I don't know what that looks like, but it's almost like as opposed to focusing on the individual ants of an ant colony, looking at the entirety of the ant colony."}, {"time": 2981, "text": "So that, I think it makes perfect sense."}, {"time": 2982, "text": "I would just say that that's a reasonable thing to suggest."}, {"time": 2984, "text": "It's a seismic shift, right?"}, {"time": 2986, "text": "And it's hard to say whether that would be better or worse, but I guess I'll use this as a convenient one for me."}, {"time": 2993, "text": "So I remember the last time we spoke, I brought up one of the most reviled evil characters in certainly recent history, probably human history period, Adolf Hitler."}, {"time": 3001, "text": "Well, I'm a big fan of making people live in the world that they wanna believe in."}, {"time": 3006, "text": "Well, if free will doesn't exist, and it's just about how things move forward, when are we gonna be high fiving this guy or what?"}, {"time": 3013, "text": "Because I remember what I said, and that actually brings me to something else we discussed."}, {"time": 3018, "text": "Yeah, for people who don't know, Ryan brought up, or I brought up, there's literally a giant book about Hitler."}, {"time": 3025, "text": "So I've been obsessed with Hitler, World War II, and Stalin recently."}, {"time": 3029, "text": "For recently."}, {"time": 3031, "text": "Oh man, this has become like a meme."}, {"time": 3035, "text": "Joe Rogan with like DMT and me with Hitler."}, {"time": 3037, "text": "Can I pick something more positive?"}, {"time": 3040, "text": "Like cat in the hat or something, I don't know."}, {"time": 3041, "text": "But you brought up Hitler as an example of something particular, some philosophical discussions we're having."}, {"time": 3048, "text": "And the excellent, eloquent, and the full of integrity MMA journalist clipped out something you've said about Hitler and said that, I forget what the headlines are, but they were the most ridiculous possible implementation."}, {"time": 3069, "text": "Basically, it was intentionally misunderstanding what I'm saying."}, {"time": 3073, "text": "Then it's like, I get that they're stupid, but I'm stupid too."}, {"time": 3076, "text": "So I know what that's like."}, {"time": 3077, "text": "So I don't have a lot of sympathy for you."}, {"time": 3080, "text": "Yeah, exactly, I can't give you a pass on that."}, {"time": 3082, "text": "But basically, intentionally misunderstanding what's going on."}, {"time": 3085, "text": "But what I find funny is that, hey, we gotta be careful what we believe."}, {"time": 3092, "text": "And again, back to the cancel culture thing that we discussed last time as well, where would I like to apologize?"}, {"time": 3097, "text": "I mean, no, actually something about cancel culture that we've been seeing things culturally, I'm like, I will be damned if I apologize for anything that I don't need to apologize for because I was intentionally misunderstood in that instance."}, {"time": 3106, "text": "Now, you could say that I'm not a historical scholar, which I would agree immediately."}, {"time": 3111, "text": "And also that I oftentimes in eloquently or inarticulately phrase things, which I'll agree is again."}, {"time": 3117, "text": "But ultimately, going, hey, I wanna make you believe, live in the world that you're suggesting ought to exist."}, {"time": 3125, "text": "Okay, so if there's no free will, how far of a step back are we willing to take cosmically before we start going, hey, this is good because we're experiencing a social reckoning in our country at the moment, for good and for other probably, I guess."}, {"time": 3143, "text": "And basically, but hey, it all worked out, right?"}, {"time": 3147, "text": "So that's probably not something that would fly."}, {"time": 3150, "text": "And I think that's a fair thing."}, {"time": 3153, "text": "It might not fly from the individual perspective, but if you zoom out and think, appreciate society as just like an ant colony as a beautifully complex system, like we kinda, from the individual perspective, we value progress, especially progress of the individual, but in whole progress of societies."}, {"time": 3174, "text": "But if you accept that this is just a complex system that's not necessarily headed anywhere, that this is almost like that river is just flowing, I think that removes the burden of always striving, of always trying, of always like the struggle and so on."}, {"time": 3190, "text": "So it's possible that if we have no control, you can like arrive at some kind of other zen state."}, {"time": 3197, "text": "Does that sound very human though?"}, {"time": 3198, "text": "That goes against, I think, our current human condition as we experience it, but we've communicated that to each other."}, {"time": 3211, "text": "Like we've taught, like through these social forces, taught each other that our lives matter and so on."}, {"time": 3218, "text": "Maybe if we convince ourselves that we're just sort of like little things in a stream and ultimately none of it matters, there might be some kind of enjoyment to be discovered through that process."}, {"time": 3230, "text": "I don't, listen, I'm a capitalist, rah, rah, like."}, {"time": 3234, "text": "But I guess I think you bring up a really important point."}, {"time": 3236, "text": "I guess almost anything like capitalism, I only get to experience it as I sit here now and I get to live, I was raised in the United States, have traveled around the world a little bit, have had the good fortune of meeting many people from many different places."}, {"time": 3249, "text": "And I'm an end user of capitalism."}, {"time": 3252, "text": "I don't really know how it got here, whether it was, I wasn't there at the start of this idea."}, {"time": 3256, "text": "I wasn't there for, hey, how did we come up with this idea?"}, {"time": 3259, "text": "How did we arrive?"}, {"time": 3260, "text": "And I'm nowhere near well read enough to understand any of that really even secondhand."}, {"time": 3264, "text": "And I guess recognizing that communism, Marxism, socialism, anarchism, anything is, these are all perspectives that all have, I guess, various strengths and weaknesses."}, {"time": 3275, "text": "But I guess one thing I'm always, I guess I would say the burden, it seems to me that if you wanna make a change, the burden of proof is on the person implying that there needs to be a change."}, {"time": 3287, "text": "And it doesn't mean that there's nothing there, but it's like if you wanna create a small shift, a ripple, that's fine, but a seismic ripping shift in how we exist or how we experience the world as human beings."}, {"time": 3297, "text": "And you mentioned fighting, why watching someone undergo, take abuse on a level in the ring that's just shocking and then triumph in spite of it is like, this is unbelievable."}, {"time": 3309, "text": "This is part of the magic of combat sports."}, {"time": 3311, "text": "Now, it's part of the magic, the other side of the magic that doesn't get talked about sometimes is that the trajectory of that individual's life later on is not always great, or let me rephrase, there's a cost for that."}, {"time": 3322, "text": "But if we remember, you mentioned removing the struggle."}, {"time": 3328, "text": "I don't personally, the struggle is what makes life life."}, {"time": 3333, "text": "And also, I guess, something Faraz has brought up to me on a number of occasions, and it makes sense to me, it's basically humans only understand things through relative comparison."}, {"time": 3343, "text": "I only understand heat because I've known cold."}, {"time": 3347, "text": "I only understand, it's like talking to someone that's never experienced any sort of hardship and then their latte isn't right, and then they pitch a fit versus someone that's gone through a great deal of challenge, struggle in their life."}, {"time": 3360, "text": "They tend to have a little bit more of an even perspective."}, {"time": 3363, "text": "And anyway, and of course, even as a relative thing and what I perceive to be even may not be even, maybe I'm particularly softer or something in the other direction without realizing, because I can only understand what I can understand."}, {"time": 3374, "text": "But the idea that we wanna fundamentally alter ourselves as a species and as people seems like an incredibly, incredibly high bar to prove, and also like an incredibly dangerous idea, because it always comes back to, well, who's gonna be responsible for this?"}, {"time": 3391, "text": "Who gets to do the choosing?"}, {"time": 3392, "text": "What's a good idea?"}, {"time": 3393, "text": "What's not a good idea?"}, {"time": 3394, "text": "And I guess that actually brings me kind of to a, something I've been encountering recently in discussions with friends."}, {"time": 3400, "text": "I feel like there's only two types of people that I encounter at this point."}, {"time": 3406, "text": "People with a more or less libertarian tilt to their thinking and people without it."}, {"time": 3411, "text": "And when I say libertarian, I don't mean that in the political party sense or even the belief system."}, {"time": 3415, "text": "Basically, I'm like, hey, you do you buddy."}, {"time": 3417, "text": "It's not my, what you're up to is not my concern versus what you're up to is my concern."}, {"time": 3421, "text": "And I guess I've always watched, various points in history, people on this side or people on that side are more or less, I guess, problematic, I guess you could say."}, {"time": 3430, "text": "And I don't mean that in the internet sense, you know, more of an issue, but the world is always full of people that wanna tell you what you need to be doing as opposed to more or less doing no harm."}, {"time": 3442, "text": "And I guess that's one of the ones, anytime I'm trying to tell other people what to do, I better hope I'm right."}, {"time": 3448, "text": "And it's bizarre to me how many people are so confident that their side or their position is the one that's not only right for them, but right enough that they can enforce it on others."}, {"time": 3456, "text": "And that just seems incredibly dangerous to me."}, {"time": 3458, "text": "And I guess that comes back to even Sam's point about, oh, we want to, trying to spread the idea that free will doesn't exist."}, {"time": 3466, "text": "I'm not saying it's damaging, but it very well may be."}, {"time": 3468, "text": "And plenty of other things could be as well."}, {"time": 3470, "text": "I'm not, you know, it goes way over my head as to the implications of all of these."}, {"time": 3473, "text": "And I guess all of us are in evangelist for something, but I guess it's weird that we've gotten this far as a species and now we wanna take like sharp, sharp turns."}, {"time": 3485, "text": "Well, we've been taking a bunch of sharp turns throughout history."}, {"time": 3488, "text": "That's what, you know, that's the way, you know, okay, humans love power."}, {"time": 3493, "text": "And one way to attain power is to say, everything that you guys are doing is wrong and I have the right thing and I'm gonna build up a giant cult of people and I'm gonna overthrow."}, {"time": 3503, "text": "And indirectly what that results in me is me gaining power."}, {"time": 3507, "text": "And that's how you get all the big revolutions in human history, saying I'm done with the thing that the powerful are currently doing."}, {"time": 3515, "text": "So I'm gonna overthrow."}, {"time": 3516, "text": "That's where probably all the identity politics that's happening now is people that didn't have power before are looking to gain power."}, {"time": 3525, "text": "And they're also, you know, that's where Jordan Peterson criticized identity politics is people with the right, with the good intentions, I should say, are in seeking power, allow power to corrupt them as power always does."}, {"time": 3541, "text": "And so they lose track of like the devils that they're fighting by becoming the same kind of devils, the same kind of evil that they're fighting."}, {"time": 3553, "text": "And so that's just the progress of human history."}, {"time": 3555, "text": "But hopefully as these power greedy people keep attaining power with a progressive mindset, over time things get better and better as they have been."}, {"time": 3567, "text": "Like each iteration?"}, {"time": 3567, "text": "Each iteration."}, {"time": 3569, "text": "A lot of unfairness happens."}, {"time": 3571, "text": "A lot of hypocrisy happens."}, {"time": 3575, "text": "A lot of people are trampled along the way by those who mean well."}, {"time": 3580, "text": "But over time, like lessons are learned or like human civilization accumulates lessons and in part learns lessons of history and it gets better and better over time, even though in the short term, there's people acting not their best selves."}, {"time": 3595, "text": "And you know, that seems to be the progress of human history."}, {"time": 3601, "text": "The idea of internalizing the free will not being real."}, {"time": 3605, "text": "I mean, you're actually making me realize that that ultimately leads to a kind of."}, {"time": 3611, "text": "Doesn't that go in a nihilistic direction?"}, {"time": 3612, "text": "Yeah, it's both nihilistic or if you want to make it a political system, then it's more like communist type of a system where like the value of the individual is completely reduced, removed."}, {"time": 3625, "text": "Or another perspective is like the freedom of an individual is not to be valued or protected."}, {"time": 3632, "text": "And so from our current perspective, the systems that seem to have worked, the United States works pretty damn well, despite all the different criticisms."}, {"time": 3641, "text": "It seems like freedom of the individual in all its forms seems to be fundamental to the success of the United States."}, {"time": 3649, "text": "And so we should, it's a, however the hell you put it, is like, it doesn't matter whether free will is or isn't an illusion."}, {"time": 3658, "text": "The belief that it's real."}, {"time": 3660, "text": "Protects the individual from the group, which is fundamentally, correct me if I'm wrong, that always seems like the big issue of history."}, {"time": 3666, "text": "Hey, there's more of me than there is of you."}, {"time": 3669, "text": "Deal with it."}, {"time": 3670, "text": "You're like, yikes."}, {"time": 3671, "text": "And you want to be yourself."}, {"time": 3672, "text": "You want to be different."}, {"time": 3673, "text": "You want to have a different religion."}, {"time": 3674, "text": "You want to be a different skin color."}, {"time": 3675, "text": "You want to do this."}, {"time": 3676, "text": "All the bad tribal things happen when there's more of me than you."}, {"time": 3680, "text": "Correct me if I'm wrong."}, {"time": 3681, "text": "Yeah, yeah, absolutely."}, {"time": 3683, "text": "But then that's always the fundamental power imbalance though, right?"}, {"time": 3686, "text": "Well, the interesting thing about the libertarian thinking, I guess I, I don't know."}, {"time": 3690, "text": "Those words are really."}, {"time": 3690, "text": "Maybe they're all charged, I know actually."}, {"time": 3692, "text": "Yeah, they're all charged."}, {"time": 3693, "text": "I may not scale up, but I mean, more like on a philosophical underpinning where you're like, yeah, basically, hey, you feel free to believe I'm a fool."}, {"time": 3699, "text": "And I mean, plenty of people do, I'm sure."}, {"time": 3702, "text": "But as long as you don't chase me down the hall and hit me in the back of the head with a textbook, what's the big deal?"}, {"time": 3708, "text": "Yeah, so the libertarian viewpoint, which I probably espouse, like that's, I'm very much like freedom of the individual is very valuable and like leave others the fuck alone unless they're trying to hurt you."}, {"time": 3722, "text": "The thing is you also have to, I believe, put in the work of empathy of understanding what others, how, what leaving people the fuck alone means to others."}, {"time": 3734, "text": "But isn't that an interesting thing?"}, {"time": 3736, "text": "If I believe in freedom of the individual and I take that, like all of these, like you said, you take them past just their first why question."}, {"time": 3742, "text": "You ask why, why, why, why, or how, how, how, how many times."}, {"time": 3746, "text": "Should that not extend to respect for you, respect for your position, respect for your individual lived experience, which could be grossly different than mine."}, {"time": 3754, "text": "Yeah, this is the problem with saying, I'm an individual, I'm not gonna bother you, you don't bother me."}, {"time": 3760, "text": "That's just like, that's not actionable."}, {"time": 3763, "text": "Because to be, to make it actionable, you have to think the why, why, why, why, why, you have to do the steps beyond."}, {"time": 3769, "text": "You think, what does that actually mean?"}, {"time": 3770, "text": "That means understanding how even my very existence like hurts others."}, {"time": 3777, "text": "Because you have to understand that like, I'm not, you're not just sitting alone in a room."}, {"time": 3782, "text": "You're using like public transit, you're using the police force, you're using firefighters, you're using the, like you're using a lot of resources that are publicly shared."}, {"time": 3792, "text": "And some of those resources are unfairly distributed."}, {"time": 3797, "text": "Like we've agreed that we're gonna pay taxes and those taxes are gonna go towards building some kind of infrastructure."}, {"time": 3805, "text": "So that's already towards social."}, {"time": 3807, "text": "So you're not a real, you're not a real sort of, I talked to Michael Malice, like anarchist, right?"}, {"time": 3813, "text": "Saying like basically, full, just leave me the fuck alone and I'm going to collaborate with whoever the hell I want."}, {"time": 3820, "text": "We're not, that's not the American society as it stands currently."}, {"time": 3825, "text": "We've agreed that there's going to be certain social institutions that we pay into."}, {"time": 3831, "text": "And some of the sort of discussions about race and all those kinds of things is about those institutions being institutionally unfair, whether it's race or gender, all those kinds of things."}, {"time": 3845, "text": "Listen, I have a bunch of criticisms of the way that conversation carries itself out, but the thing is, what's valuable is to actually listen and empathize."}, {"time": 3856, "text": "And that's not often talked about with the leave me the fuck alone mindset because you're, it doesn't have that little component which I think could be fundamental to the function of a society, which is like social."}, {"time": 3874, "text": "Like it's the, what is it, the Obama, you didn't build it or you didn't build it alone or whatever, however that goes."}, {"time": 3882, "text": "But basically we wouldn't be able to accomplish anything as individuals without the help of others."}, {"time": 3888, "text": "And to be able to then start to think, okay, so what is my duty?"}, {"time": 3894, "text": "What is my responsibility to other human beings to be respectful, to be loving, to help them as part of this functioning society?"}, {"time": 3903, "text": "That starts, that's actually a lot of work to start to think about that."}, {"time": 3906, "text": "Because then I have to like think, okay, Ryan, what's his life like?"}, {"time": 3909, "text": "As a business owner during COVID, what's that like?"}, {"time": 3912, "text": "And then he has, there's employees that run the gym."}, {"time": 3916, "text": "What's that like?"}, {"time": 3917, "text": "What's that stress like?"}, {"time": 3918, "text": "Or about the fighting and the injury and so on."}, {"time": 3921, "text": "That empathy takes a lot of like compute cycles."}, {"time": 3924, "text": "And also a lot of energy, right?"}, {"time": 3926, "text": "But I have to go through that computation if I want to be an individual that's like, doesn't hurt you."}, {"time": 3935, "text": "If I may, I guess like to come back to Muhammad Ali, one of the things he said is service to others is the rent that you pay for your, is the price you pay for your rent here on earth."}, {"time": 3945, "text": "And now one of the things that I think that I see as a result of the internet all the time is people talking about global giant problems, social problems that are society wide, that are massive, truly massive."}, {"time": 3959, "text": "And frankly, beyond the power of any of us to solve."}, {"time": 3964, "text": "That's certainly on an individual level."}, {"time": 3966, "text": "So I've discussed things with friends."}, {"time": 3968, "text": "Like my father's an environmental attorney, like has been for a long time and has been an engineer for a long time."}, {"time": 3974, "text": "And so I'm not, barely know anything, but I'm read in a little bit of various things."}, {"time": 3979, "text": "But climate change, oh my God, I'm so concerned about climate change."}, {"time": 3983, "text": "What am I supposed to do about climate change?"}, {"time": 3985, "text": "I'll tell you what I can do is I can not litter."}, {"time": 3987, "text": "I can try to conserve energy where I can."}, {"time": 3990, "text": "I can do whatever I want."}, {"time": 3991, "text": "What can I personally do about some giant social problem that I didn't start and is out of my control?"}, {"time": 4000, "text": "I'm like, well, I can be decent to the people around me."}, {"time": 4002, "text": "I can mention, I can demonstrate empathy and I can demonstrate consideration for the people in my circle."}, {"time": 4007, "text": "And to the extent that I can the people outside of my circle, but yelling at the trees over problems that are borderline cosmic, doesn't seem very productive."}, {"time": 4017, "text": "It just makes me feel like I'm cool and important because I'm talking about something, well, hundreds of years from now, the water will rise."}, {"time": 4022, "text": "Maybe it will, maybe it won't."}, {"time": 4024, "text": "It's completely on my head, I know nothing."}, {"time": 4026, "text": "But focusing on the problems that we can actually solve, it comes back to the same thing."}, {"time": 4030, "text": "I want to win a fight."}, {"time": 4031, "text": "I would love to win a fight."}, {"time": 4033, "text": "I can't control that."}, {"time": 4034, "text": "What I can do is I can control each individual step that I take around the ring and try to make the next correct move."}, {"time": 4039, "text": "I can't look, no, it gets people's, you know, they get all excited."}, {"time": 4044, "text": "You know, I'm trying to keep my language in check, but they get all excited thinking about, you know, problems that are like Superman couldn't solve these problems."}, {"time": 4052, "text": "Like you could be that powerful and you can't make all of the bad things go away, but you can absolutely change yourself."}, {"time": 4058, "text": "And I think a lot of the lessons that, you know, like the good lessons from religion that happened, the good lessons from the great men and women throughout history that we're inspired by, that talk about change starting with within, and, you know, again, treating the people around you decently and treating the people around you decently doesn't even necessarily mean the golden rule."}, {"time": 4075, "text": "Do unto others as you would like them to do to you."}, {"time": 4077, "text": "I go, well, maybe what I would like and what this person would like aren't the same thing."}, {"time": 4082, "text": "Well, how am I going to get to the bottom of that?"}, {"time": 4083, "text": "Cause I could be attempting to be decent to this person."}, {"time": 4085, "text": "And by my standards, I am being decent, but maybe I'm missing the mark by theirs."}, {"time": 4089, "text": "Well, I can't possibly, if I just interacted with you, like it's like someone talking about some nonsense microaggression."}, {"time": 4095, "text": "You're like, so let me get this straight."}, {"time": 4096, "text": "I've never met you before."}, {"time": 4097, "text": "You never met me before."}, {"time": 4098, "text": "And you're interpreting some minor comment that I've made in the least charitable way possible."}, {"time": 4104, "text": "I'm not saying that you couldn't be annoyed, but your expectation for that level of consideration is you're going to be disappointed a lot."}, {"time": 4111, "text": "Now, if you, if we're someone that's in your life on a consistent basis and they're like, hey, I really don't appreciate what you're saying or what you're doing here."}, {"time": 4118, "text": "Do you realize that this is how I'm, this is how I'm perceiving you go, oh man, I'm so sorry."}, {"time": 4122, "text": "Of course I would hear what you have to say, but I guess trying to recognize that, you know, I guess my job is to treat others with dignity in general, but that level of the level of specificity that, that, that, that requires increases as it gets closer to you."}, {"time": 4138, "text": "And I have, as a person, I have a very finite amount of resources financially, intellectually, emotionally, physically."}, {"time": 4145, "text": "If I chuck, you know, 0.001% of it in every single different direction, what am I doing?"}, {"time": 4151, "text": "It's like when people are like, oh, I care deeply about Tibet."}, {"time": 4153, "text": "I'm like, why aren't you over there?"}, {"time": 4155, "text": "Go build a house, man."}, {"time": 4156, "text": "Get on a plane, go build a house."}, {"time": 4158, "text": "Oh, you don't want to do that."}, {"time": 4159, "text": "So really what you want to do is post on Facebook and, and, and accept high fives for how much of a good guy you are."}, {"time": 4164, "text": "I got an idea."}, {"time": 4165, "text": "Go help somebody in your neighborhood."}, {"time": 4167, "text": "Go be, go play with, go play with some kids."}, {"time": 4169, "text": "Go be a friend to someone that doesn't have a friend."}, {"time": 4171, "text": "Read a book, try to educate yourself."}, {"time": 4173, "text": "And so I guess to, to come back, it's all of these problems aren't solvable on a grand scale, but it's almost like by attempting to address them in our personal lives, we do better."}, {"time": 4183, "text": "But rather than a giant airing of the grievances on a, on a consistent basis, not that that isn't, you know, sometimes necessary and valuable, but after you air your grievances, you go, hey, how about we, we sort this out?"}, {"time": 4195, "text": "What's the next step?"}, {"time": 4196, "text": "And, and I guess, again, when we're trying to address it on a giant social level, it just seems unmanageable to me, even if you have the best of intentions."}, {"time": 4204, "text": "Yeah, I mean, but nevertheless, there's, there's a lot you can do on social networks."}, {"time": 4209, "text": "I mean, I enjoy tweeting and consuming Twitter."}, {"time": 4212, "text": "It's just, I apply the exact same principle that you just said, which is free will and discussion, which is like, I approach it in a way that I don't get stuck in this loop that's counterproductive."}, {"time": 4227, "text": "I try to do things that are productive."}, {"time": 4230, "text": "And like, it's just like you said, that's like, like what kind of things can I do in this world?"}, {"time": 4236, "text": "Whether that's tweeting or building things, those are low effort tweeting, or actually building businesses or building ideas out as high effort."}, {"time": 4245, "text": "What can I do that will actually solve problems?"}, {"time": 4247, "text": "And that's, that's the way I approach it."}, {"time": 4249, "text": "And I do wonder if it's possible to at scale, encourage each other to approach like social media and communication with fellow humans in that way."}, {"time": 4259, "text": "How do you think that would be done?"}, {"time": 4260, "text": "I guess, like to improve the, improve the quality of discourse, maybe."}, {"time": 4263, "text": "Like, or even like you said, the empathy or the decency of discourse."}, {"time": 4267, "text": "I think people should be, you know, incentivized, encouraged to do that."}, {"time": 4272, "text": "I think most of what's, we see happening on Twitter and Facebook and so on has to do with very small, very powerful implementation details."}, {"time": 4285, "text": "It goes down to like, what is the source of the dopamine rush, the like button, the sharing mechanisms, just even small tweaks in those can fix a lot."}, {"time": 4297, "text": "So like a lot, a lot of the stuff we see now is the result of just initial implementations of these systems that we didn't anticipate."}, {"time": 4304, "text": "So the modernization comes from engagement and the tools we have is clicking like and sharing."}, {"time": 4314, "text": "It was not always obvious."}, {"time": 4315, "text": "It was not obvious from the beginning."}, {"time": 4317, "text": "It wasn't obvious while Twitter and Facebook grew that there's a big dopamine rush from getting more followers and likes and shares."}, {"time": 4325, "text": "So we've gotten addicted to this feeling like how many people are commenting, how many people are saying, like clicking like and so on."}, {"time": 4332, "text": "So that's that dopamine rush."}, {"time": 4333, "text": "So we want to say the thing that will get the most likes and like unmasked in society."}, {"time": 4339, "text": "And then the other thing that was expected is the controversial, the divisive will get the most likes."}, {"time": 4377, "text": "I think it could be fixed by incentivizing personal growth like incentivizing you to challenge yourself to grows individual and most importantly to be happy at the end of the day."}, {"time": 4391, "text": "So like incentivize you feeling good in a way that's long lasting longterm."}, {"time": 4401, "text": "I think what makes people actually feel good is being kind to others longterm."}, {"time": 4407, "text": "In the short term what feels good is getting a lot of likes."}, {"time": 4411, "text": "And I think those are just different incentives that if implemented correctly you can just build social networks that would do much better."}, {"time": 4418, "text": "So do you think it comes from a structural perspective?"}, {"time": 4421, "text": "I guess at what point does you mention like you mentioned free will and also you mentioned feeling good and again working hard."}, {"time": 4427, "text": "I know that you have the, I guess the, was it a race or?"}, {"time": 4431, "text": "No, it's the Goggins thing."}, {"time": 4434, "text": "It's four by four by 48 challenge where you run four miles every four hours for two days."}, {"time": 4441, "text": "Yeah, it's a bunch of, the challenge of it isn't just the running, the running is very tough but it's mostly the sleep deprivation because you're just training every four hours."}, {"time": 4451, "text": "But it's a struggle, right?"}, {"time": 4453, "text": "But the struggle gives meaning."}, {"time": 4454, "text": "And ultimately I guess so how can we, because you mentioned like you said adjusting things on like a, I guess like a programming level almost, based programming level so that the interface is different for the user."}, {"time": 4465, "text": "But at what point does the user have a responsibility to as a man or a woman or a person to just behave more decently?"}, {"time": 4474, "text": "How can we I guess utilize, what can we do?"}, {"time": 4477, "text": "It seems like our society is so grossly missing like a Martin Luther King right now, like the great inspiring characters throughout American history, throughout world history."}, {"time": 4486, "text": "Where are the great leaders?"}, {"time": 4488, "text": "So leadership is part of it, but that's definitely, where are the great leaders is a very good question."}, {"time": 4493, "text": "That's more of a question of our political systems why they're not pushing forward the great leaders."}, {"time": 4498, "text": "But there's also just, okay, there's some just basic engineering shit which is when you and I, when you Ryan and I are in a room alone and we're talking, even if we're strangers, the incentives are for us to get along."}, {"time": 4517, "text": "Like just when we're together in person, that's what I'm saying."}, {"time": 4521, "text": "I'm not even saying some kind of profound."}, {"time": 4522, "text": "But when you remove that."}, {"time": 4523, "text": "When we remove that, the implementation of social networks as they stand right now in the digital space, a very different set of incentives."}, {"time": 4533, "text": "It's more fun to destroy others, to be shitty to others."}, {"time": 4538, "text": "And it becomes this endless loop, like you were saying, that's ultimately destructive and not productive."}, {"time": 4545, "text": "And I think it has to do with just the interfaces of making it feel good to be nice to others."}, {"time": 4554, "text": "Because currently it doesn't feel nearly as good to be nice to others on the internet."}, {"time": 4561, "text": "And it doesn't feel nearly as bad as it does in real life to be shitty to others on the internet."}, {"time": 4567, "text": "So the incentives are just wrong."}, {"time": 4569, "text": "I think there is a technology solution to this, or at least a solution to improve this communication mechanism."}, {"time": 4577, "text": "It's not obvious how."}, {"time": 4579, "text": "I have a bunch of sort of more detailed ideas, but this is fascinating because I've gotten a chance to talk to Jack Dorsey quite a bit."}, {"time": 4586, "text": "He's the CEO of Twitter."}, {"time": 4587, "text": "And he is legitimately has, in this conversation, he would agree with everything."}, {"time": 4595, "text": "And he's a good human being, and he has a lot of really good ideas how to improve things."}, {"time": 4601, "text": "The question when you're a captain of a ship, whether it's a question whether a CEO is even a captain, how much can you actually steer that ship once it's gotten large enough?"}, {"time": 4611, "text": "There's so much momentum, there's so many users, there's so many people who are marketing and PR and lawyers."}, {"time": 4617, "text": "It's very difficult to change things."}, {"time": 4619, "text": "Is it difficult because of the fallout, or is it difficult because it's actually like literally out of this power?"}, {"time": 4625, "text": "So power is weird when you have a large organization."}, {"time": 4629, "text": "This is why the great leaders, this is what great leaders do, whether it's presidents or leaders of companies."}, {"time": 4635, "text": "Steve Jobs, I would argue Musk is that way, is to walk into a room full of people who don't want you to create drama."}, {"time": 4643, "text": "It's weird, man."}, {"time": 4644, "text": "When people just kind of want to be nice, the niceness creates momentum and nobody wants to, it's the systems thing."}, {"time": 4653, "text": "Everybody just behaves in the way they were previously behaving in the way they're supposed to behave, and nobody wants to raise a fuss."}, {"time": 4660, "text": "It takes a great man or woman leader to step in and say, what we've been doing is bullshit."}, {"time": 4668, "text": "Okay, you're fired, you're cool."}, {"time": 4670, "text": "What is it that?"}, {"time": 4673, "text": "I think you have to create constant revolutions within a company that's very, very difficult to do."}, {"time": 4707, "text": "That's like Google came to be, so Twitter came to be, and Facebook, and so on."}, {"time": 4711, "text": "And Apple has, that was the dream of Steve Jobs is it would succeed for many decades, for like centuries."}, {"time": 4720, "text": "That was the idea that you would keep creating revolutions, and under Steve Jobs, Apple successfully pivoted a bunch of times, just like reinvented themselves, which is very difficult to do."}, {"time": 4733, "text": "Because I mean, I've heard, at least I don't know if this is accurate, because I wouldn't know anything, but I've heard plenty of people complain about Steve Jobs."}, {"time": 4739, "text": "But in reality, the reason that all of these amazing things were done was because this person was willing to, well obviously brilliant, and then also willing to rattle everyone's cage periodically and say, hey, what's going on is not what we need to be doing."}, {"time": 4753, "text": "That's a really interesting thing."}, {"time": 4754, "text": "So he would rattle the cage, but he would also, I don't know if those are intricately connected or always have to be connected, but he would just be a dick."}, {"time": 4764, "text": "So maybe by his standard, I am lazy and worthless."}, {"time": 4768, "text": "Well, he would say that to you, right?"}, {"time": 4769, "text": "Is he being a dick though, if by his standard, I mean, again, it's like everyone's stupid compared to somebody."}, {"time": 4774, "text": "You know, I guess."}, {"time": 4776, "text": "But, so you apparently are able to take that kind of thing."}, {"time": 4781, "text": "Sometimes you just, there's ways to cross the line."}, {"time": 4786, "text": "And I mean, this is, okay, the fascinating thing about being a leader, especially a leader of companies, is it's a people problem."}, {"time": 4795, "text": "So each individual in a room, so as a leader, you're only really interacting with a small number of people because there are leaders of other smaller groups and so on."}, {"time": 4804, "text": "But each of those individuals in the room have their own different psychology."}, {"time": 4809, "text": "Some like to be pushed to the limit."}, {"time": 4811, "text": "Some like to be screamed at."}, {"time": 4814, "text": "Some are very soft spoken and almost afraid to speak."}, {"time": 4818, "text": "And they have to be, you have to hear them out."}, {"time": 4823, "text": "Like there's a, and those could be all superstars."}, {"time": 4827, "text": "We're not talking about like the C students."}, {"time": 4829, "text": "We're talking about the A plus students."}, {"time": 4831, "text": "Well, it's funny that, yeah, but the thing to, the skill to manage all of those people is completely separate from the skill to innovate something."}, {"time": 4837, "text": "I mean, not that they're not connected, but it's funny how it's, it's almost like, you know, why do we have shitty representatives?"}, {"time": 4844, "text": "Well, I mean, the thing that you do to get elected has nothing to do with governance."}, {"time": 4849, "text": "Well, that's exactly it."}, {"time": 4850, "text": "But the great leaders have to have both skills."}, {"time": 4852, "text": "So like you have to have the boldness of, if you look at the great presidents through history, usually it's in a time of crisis is when they step up, but they basically say, okay, stop this old way that Congress works of this bickering, of this like compromise bullshit."}, {"time": 4872, "text": "Here's a huge plan that costs billions of dollars in today's age, trillions of dollars, no extra pork, no extra additions, just like, here's a clear plan."}, {"time": 4882, "text": "We're going to build the best road network the world has ever seen."}, {"time": 4887, "text": "We're going to build some huge infrastructure project."}, {"time": 4890, "text": "We're going to revolutionize internet."}, {"time": 4892, "text": "Oh, we're going to, for coronavirus, we're going to build the largest like testing facility the world has ever seen in terms of the, we're gonna get everybody tested several times a day, all those kinds of things, huge projects and say, fuck all this, the details that everybody's bickering about, we're going to give everybody $2,000, we can give everybody $3,000, like huge projects."}, {"time": 4914, "text": "And at the same time, so that's the boldness and the leadership and saying, throw out all the bullshit of the past."}, {"time": 4921, "text": "And at the same time, be able to get in the room with the leaders of both parties or for the powerful individuals and smooth talk the shit out of them in the way they need to be smooth talked to."}, {"time": 4932, "text": "So like both of those skills, it seems to be when they're combining one person, that creates great leaders."}, {"time": 4939, "text": "Musk appears to have that, Elon."}, {"time": 4941, "text": "I don't know if Steve Jobs, it's interesting."}, {"time": 4945, "text": "So the criticism of Steve and a little bit on Elon is he misses some of the human part, but maybe it's impossible to have a really, you have like Sadia Nadal, who's the CEO of Microsoft, you have, who's really good on the human side, really, really good on the human side, like everybody loves him."}, {"time": 4964, "text": "The CEO of Google and Alphabet is also the same way."}, {"time": 4969, "text": "So like, I don't know if it's possible to have both."}, {"time": 4973, "text": "You only get so many stat points."}, {"time": 4974, "text": "Yeah, you only get, in this RPG of life, yeah."}, {"time": 4979, "text": "You got very good at jujitsu very fast."}, {"time": 4983, "text": "So you went, I mean, you told the story of Blue Belt and so on, but you went to Black Belt really quickly and not just in terms of ranks, but in terms of just skill level."}, {"time": 4992, "text": "I mean, you didn't go to Black Belt nearly as fast as your skill set developed."}, {"time": 4997, "text": "You were like doing extremely well at a high level of competition."}, {"time": 5001, "text": "So you're a good person to ask, how does one get good at jujitsu?"}, {"time": 5006, "text": "We talked about solving problems at the elite level, but when you're a beginner at the martial arts, how do you get good?"}, {"time": 5014, "text": "How much training should you do?"}, {"time": 5016, "text": "The very basic stuff, like how much training, how much drilling, and then the mental stuff, like where should your mind be?"}, {"time": 5024, "text": "How should you approach it from a mental perspective too?"}, {"time": 5028, "text": "I'll just tell you my perspective on this one."}, {"time": 5029, "text": "I guess I would say I feel step one, I feel lucky to have found a good training situation, particularly for the time in where I was at."}, {"time": 5041, "text": "And I drilled a ton."}, {"time": 5044, "text": "I drilled and drilled and drilled and drilled and drilled."}, {"time": 5046, "text": "And one thing that's really important to understand though, is that I was able to, in a relatively brief period of years, go from zero to reasonably good."}, {"time": 5058, "text": "But I think I probably crammed more hours in those small years than most people did training, let's say in two or three times the length."}, {"time": 5068, "text": "So it may masquerade as something else other than it is."}, {"time": 5072, "text": "I could say."}, {"time": 5073, "text": "So you have to put in the hours."}, {"time": 5075, "text": "There's no way around that."}, {"time": 5077, "text": "But what did you put in those hours?"}, {"time": 5078, "text": "So when you say drilling, can you break that apart a little bit?"}, {"time": 5082, "text": "What does drilling look like?"}, {"time": 5083, "text": "Is there any recommendations you can put in?"}, {"time": 5084, "text": "Step one, I would say your choices matter."}, {"time": 5087, "text": "I think one of the really important things that I think we should consider about jiu jitsu is that there's a lot of junk in the system right now."}, {"time": 5092, "text": "It's like jiu jitsu has exploded in terms of the number of positions, techniques, strategies, this, that, rule sets."}, {"time": 5099, "text": "That's really cool on the one hand."}, {"time": 5101, "text": "On the other hand, there's probably a just metric shit ton of suboptimal things that are out there that are being taught."}, {"time": 5111, "text": "Myself included, I've taught things that are looking back five years, three years, two years, one year, where I'm like, oh, I would not do it like that anymore."}, {"time": 5116, "text": "Straight up, sometimes I wouldn't do it like that."}, {"time": 5118, "text": "Other times I would literally never do even that particular movement."}, {"time": 5122, "text": "I don't think the shrimp is a real move."}, {"time": 5125, "text": "It's a giant spiel and seizure to show in person."}, {"time": 5128, "text": "But long story short, there's a lot of things that we think of as fundamental that I think that are really pretty negative."}, {"time": 5135, "text": "And also, you know."}, {"time": 5136, "text": "That's heresy in jiu jitsu."}, {"time": 5138, "text": "The shrimp."}, {"time": 5140, "text": "Is like the holy, we all worship the shrimp."}, {"time": 5142, "text": "We love the shrimp."}, {"time": 5145, "text": "For people who don't do jiu jitsu, and you should, the shrimp is you scoot your butt away from your opponent."}, {"time": 5153, "text": "Yeah, in a really, it's like a really athletic looking position where you look like someone that's trying to stick their butt out on Instagram, and then you push your hands away, and you expose your face, and then you lay on your side because someone told you to do that."}, {"time": 5169, "text": "And you look like a, I guess you look like a shrimp."}, {"time": 5172, "text": "Yeah, it's like that time that someone really credible told me to drink unleaded gasoline, and I did it for a while."}, {"time": 5178, "text": "And then it got to the point in my life where the next best, the thing that I needed to do to really improve my life was stop drinking unleaded gasoline."}, {"time": 5186, "text": "And I would say that there's a lot of stuff that's in there that step one is like it's junk."}, {"time": 5193, "text": "It's actual junk."}, {"time": 5194, "text": "And it's not only will it waste your time, it will straight up, it will be like an albatross hanging on you because it affects how you think about things going forward."}, {"time": 5204, "text": "So although it was, it's funny, like the operating assumptions that we work under have a huge, huge, huge influence."}, {"time": 5213, "text": "You mentioned like growing up in the United States or this being a capitalist society, like woo, all right."}, {"time": 5218, "text": "Now, of course I think that, I don't really know any different otherwise."}, {"time": 5220, "text": "And I think that a lot of times people go, oh, communism is better."}, {"time": 5223, "text": "I'm like, haven't seen it."}, {"time": 5224, "text": "I haven't read any books about it being better, but it's possible."}, {"time": 5228, "text": "I mean, I haven't experienced it much myself either."}, {"time": 5230, "text": "So I can't dismiss it outright, but I guess I would say it's a fundamentally different operating system underpinning and all of my choices, all of, if I honestly believed in that thing, many of my choices on a moment by moment, on a day by day, and certainly on a lifetime basis would be very different."}, {"time": 5247, "text": "So I would say that it's tough when you're young in the martial arts."}, {"time": 5252, "text": "And I mean, all of us are always trying to do our best to learn."}, {"time": 5254, "text": "But when you're young in the martial arts, you always go, if you're a reasonable guy, what do they, what do they call it?"}, {"time": 5257, "text": "Like Dunning, Kruger, Amnesia."}, {"time": 5258, "text": "I can't remember if this is the right one, but basically you go like, oh, I know what I'm doing here."}, {"time": 5262, "text": "So I can say that's not right."}, {"time": 5264, "text": "But then I read a news story about baseball and I don't know anything about baseball, sounds credible."}, {"time": 5268, "text": "And it's bullshit, but I can't call bullshit."}, {"time": 5270, "text": "If you're a reasonable person, you can't call bullshit on things that you don't understand."}, {"time": 5273, "text": "Even if you suspect it's not right, you're like, well, I've got to reserve judgment."}, {"time": 5276, "text": "You never, ever, ever set aside your need and also obligation to understand why you were doing what you're doing."}, {"time": 5285, "text": "And don't ask why once, ask why over and over and over and over about the same thing."}, {"time": 5289, "text": "Oh, well, I want a shrimp."}, {"time": 5291, "text": "To make space."}, {"time": 5292, "text": "Why do I want to make space?"}, {"time": 5293, "text": "To get away from the guy."}, {"time": 5293, "text": "Well, why do I want to get away from him?"}, {"time": 5295, "text": "Well, because he's dangerous."}, {"time": 5296, "text": "Well, why is he dangerous?"}, {"time": 5296, "text": "And you can oftentimes get down to, wait a minute, I didn't even need to move."}, {"time": 5300, "text": "Three quarters of the time, you're actually acting in the other person's self interest."}, {"time": 5303, "text": "And I guess a lot of times I can't, this kind of goes beyond what we can demonstrate here."}, {"time": 5307, "text": "But I would just say trying to understand what my base operating assumptions are and consistently reevaluate them, which can be fricking exhausting, frankly, and also constantly confidence destroying."}, {"time": 5317, "text": "But you mentioned that I did pretty well relatively quickly."}, {"time": 5322, "text": "I started in 2004 and I was at Abu Dhabi ADCC for the first time as an alternate in 2007."}, {"time": 5328, "text": "I won a match there against a Black Belt world champion."}, {"time": 5331, "text": "And the fact, frankly, the fact that I was able to beat someone like that was neat, but at the same time says a little bit more about what jiu jitsu is and some of the issues with it than it does about how cool I am or was, because that shouldn't really happen when you think about it."}, {"time": 5349, "text": "You're like, okay, you're a champion at ostensibly a very high level of the sport."}, {"time": 5354, "text": "You enjoy a three inch, four inch height advantage and a 35 pound weight advantage, and you just got beat."}, {"time": 5361, "text": "Like that should not, I'm dead serious, that should not exist."}, {"time": 5364, "text": "If that happens, you're doing it wrong."}, {"time": 5366, "text": "Is it that I'm doing it right?"}, {"time": 5367, "text": "Or is it that you're doing it wrong and there's enough variance in the way that you're doing it that you're allowing me to win?"}, {"time": 5374, "text": "And now I did happen to win that with the 50, 50 heel hook, which was 50, 50, but basically, which was one of the early examples of like, hey guys, by the way, people can try to hurt your legs."}, {"time": 5385, "text": "And that was something like, we mentioned John Danaher, mentioned like, you know, myself, Dean Lister, a lot of the guys from the Henzo Gracie team that have had amazing success."}, {"time": 5392, "text": "They've gone and done great things."}, {"time": 5415, "text": "So anyway, I guess to come back is if in the absence of knowing what to do, I try to polish what I've got."}, {"time": 5422, "text": "So if I've got a knife and I'm like, I don't know how to use them, I'm like, okay, I'm just gonna sharpen the edge and polish it and make sure that when I need to use this dang thing, I'll be able to do it."}, {"time": 5457, "text": "And I think all I've ever done in martial arts is try to treat people with respect, honestly, try to demonstrate appreciation for the many, many people who have helped me over time and be the type of person that they wanna train with."}, {"time": 5469, "text": "Not the type of, because we've all trained with people that make us think about beating the ever loving crap."}, {"time": 5473, "text": "I never wanted to be that guy."}, {"time": 5475, "text": "And I was basically saying like, if I train with a black belt when I'm a blue belt and this person enjoys training with me, that's in my interest."}, {"time": 5482, "text": "Selfishly, not only do I not want them to beat me up, but selfishly, I should, you mentioned being decent to other people, you wanna incentivize being decent to other people, right, with a structure of what you're doing."}, {"time": 5490, "text": "Selfishly, I'm incentivized to be a nice guy, even if I'm internally a scumbag, which I like to think that I'm not, but basically going like, hey, this guy's way more likely to help me or this person's way more likely to help me if I shake their hand, say thank you, I really appreciate you helping me out."}, {"time": 5504, "text": "And that thing that they tap me with four or five times, I'm gonna ask them about it."}, {"time": 5509, "text": "And then they don't have to tell me, they're under no obligation, but I'll say, and whether they tell me or don't tell me, thank you so much for your time, I really appreciate it."}, {"time": 5514, "text": "And that's it, you know?"}, {"time": 5517, "text": "Okay, so to summarize, the way you brilliantly described, I just wanna make sure we're keeping track of this."}, {"time": 5522, "text": "I went all over the place."}, {"time": 5523, "text": "No, you didn't, you're pretty on point."}, {"time": 5525, "text": "But so the first thing is basically, which is difficult, I wonder if we can break it apart a little bit, is don't trust authority, essentially."}, {"time": 5533, "text": "Keep asking why."}, {"time": 5534, "text": "Be respectful without trusting authority, right?"}, {"time": 5536, "text": "Right, which is, and then the second thing is be the kind of person that others like training with or like being around, sort of being a good friend."}, {"time": 5547, "text": "So so many people just enjoy being around."}, {"time": 5548, "text": "So one is completely, which is, yeah, you're right, it's attention, which is like completely disrespect the way that things are done."}, {"time": 5557, "text": "So asking why constantly."}, {"time": 5560, "text": "One of it is your own flaws and not understanding the fundamentals of what's being described."}, {"time": 5564, "text": "And then once you get good enough, not understanding, like going against the fact that the instructor doesn't understand."}, {"time": 5573, "text": "And my inability to understand what you're saying, though, doesn't invalidate it."}, {"time": 5576, "text": "And that's something like you mentioned, like me mentioning, keeping in mind our own flaws."}, {"time": 5580, "text": "And then also, again, the flaws that any of us have is the instructor, to your point."}, {"time": 5584, "text": "And I guess I can speak to being kind of weird."}, {"time": 5587, "text": "I don't, you know, I like to sit in the corner."}, {"time": 5589, "text": "But so everyone's a little bit different."}, {"time": 5592, "text": "Some people, you know, I wasn't terribly popular in high school."}, {"time": 5594, "text": "You know, like, I didn't like high school very much."}, {"time": 5598, "text": "But anyway, I would, not gonna be rude to people, though."}, {"time": 5601, "text": "I was never gonna bully anybody."}, {"time": 5602, "text": "If you said hello to me, I'd say hello back."}, {"time": 5604, "text": "I would hold the door for you if you walked by."}, {"time": 5606, "text": "You know, and I would just say, like simple things like that go a long, long, long way."}, {"time": 5611, "text": "And that actually takes us back to our social discussion where I'm like, oh man, how do I become great at jiu jitsu?"}, {"time": 5617, "text": "It's like, well, I'll start by not pissing off this person who can beat the crap out of me and not disrespecting the person who is probably the closest thing to a font of knowledge at that time for me."}, {"time": 5628, "text": "So, and then recognizing that I should do that for its own virtue because it's the right thing to do and I should try to treat people decently."}, {"time": 5635, "text": "But beyond that, even selfishly, it's in my interest to do that."}, {"time": 5639, "text": "But see, the thing is, this is interesting, is there's a culture in martial arts, a culture that I like where the instructor, legitimately so, carries an aura of authority."}, {"time": 5653, "text": "And it's not comfortable to really ask why."}, {"time": 5658, "text": "I'm not, it's a skill to be able to have a discussion as a white belt or the black belt instructor of like, why is it done this way?"}, {"time": 5669, "text": "Like, and saying why again."}, {"time": 5672, "text": "Like, I mean, it's a skill to show that you're actually a legitimately curious and passionate and compassionate student versus like, somebody who's just being an annoying dick who saw some stuff on YouTube."}, {"time": 5685, "text": "There's a line between, to walk there."}, {"time": 5687, "text": "I just wonder because like, it's the drilling thing."}, {"time": 5692, "text": "And, you know, I, for example, like in my, when I was coming out, there was so much emphasis placed on like, close guard, for example."}, {"time": 5703, "text": "And you might actually teach me now, I don't know, but to me it was like, why do I need to master the close guard?"}, {"time": 5712, "text": "Like, why is the close guard on top or the bottom?"}, {"time": 5716, "text": "But the bottom really, the fundamental basics of jiu jitsu."}, {"time": 5720, "text": "Who decided that?"}, {"time": 5721, "text": "My body is not, my body says this is wrong."}, {"time": 5725, "text": "I'm like, this, like I have short legs, but it doesn't even matter the length of the legs."}, {"time": 5730, "text": "There's something about me that just, I don't understand how leverage here works for my particular body."}, {"time": 5737, "text": "Like, so it's just, it's a feel thing too."}, {"time": 5740, "text": "Like, it feels like in my basic understanding of leverage and movement and timing and so on, it feels like these certain, like butterfly guard, or even like half, basically every guard except close guard."}, {"time": 5753, "text": "I can play, I can dance."}, {"time": 5756, "text": "Close guard feels like you're shutting down like the play that I."}, {"time": 5763, "text": "Is that wrong?"}, {"time": 5764, "text": "Or is that, make sure that's what you want because that's almost like an innate characteristic of this guard position, but it's not sold that way, right?"}, {"time": 5771, "text": "It's like, hey, this is a good guard."}, {"time": 5772, "text": "It's like, hey man, here's a bow and arrow versus, and you know how to use this thing, right?"}, {"time": 5777, "text": "Like make sure you're far away and like up on a hill or something."}, {"time": 5781, "text": "Cause you can take that bow and arrow, run up on something and try to use it."}, {"time": 5784, "text": "But if nobody told you not to do that and they told you it was foundational, it's very foundational, it's very important."}, {"time": 5789, "text": "To everything else too, right?"}, {"time": 5791, "text": "That's back to the shrimping thing."}, {"time": 5793, "text": "How many things are we taught that even if it's not, let's say itself is not a garbage thing, might be effectively garbage."}, {"time": 5802, "text": "You could give me a Ferrari, but if I try to make it fly, it's not going to work."}, {"time": 5806, "text": "If you're like, here's a plane, here's another plane, here's another plane, here's another plane, here's a Ferrari."}, {"time": 5810, "text": "I'm like, oh, it must be a different type of plane."}, {"time": 5812, "text": "Like you could be forgiven for leap if we're going there, you know, like, oh, maybe the wings come out or you just go fast enough to take a bullet."}, {"time": 5817, "text": "You can make these crazy leaps in your mind."}, {"time": 5819, "text": "And people are doing that all the time."}, {"time": 5822, "text": "So if you don't provide the context for me, or worse yet, you provide improper context, like how much of a problem is that going to be?"}, {"time": 5830, "text": "Well, I think the skill of the white belt should be, just be nice."}, {"time": 5835, "text": "But in the complicated human space of when your intention, at least in the big picture view, is good."}, {"time": 5844, "text": "The question is, it's not always when your intention is good, the actual implementation of it is good."}, {"time": 5852, "text": "So you might be just almost, and that's much, it's not the case for you, it's much more the case for white belts."}, {"time": 5859, "text": "They don't even know, their intention might be good, but they don't know all the lines they're crossing, all the, so they're not actually able to like interpret all the ways in which they're being totally insensitive to the requests of others, like explicit requests of others."}, {"time": 5875, "text": "So your job as a beginner is to be a really good listener of those social cues."}, {"time": 5881, "text": "Well, it's like a visitor in a foreign country, right?"}, {"time": 5883, "text": "Like you're a representative of people that look like you, people that talk like you, people that have your passport, and you're like, man, I'm going to go over here."}, {"time": 5889, "text": "Oh, I've got my foot up on my knee."}, {"time": 5890, "text": "Well, if I was in certain countries in the world, that's rude."}, {"time": 5892, "text": "I'm like, oh, I'm so sorry."}, {"time": 5894, "text": "But can you imagine if someone says, hey, I really appreciate if you take your foot off, that's pretty rude."}, {"time": 5898, "text": "And then I want to tell them, well, not where I'm from, man."}, {"time": 5901, "text": "I'm in your house."}, {"time": 5902, "text": "I better, again, I might go that direction, but let's say I could get away with that."}, {"time": 5905, "text": "Now I'm a bully."}, {"time": 5907, "text": "And if I can't get away with that, well, I'm about to maybe be on the wrong side of something."}, {"time": 5910, "text": "But I guess, like you said, if we have positive intention, that's fine."}, {"time": 5914, "text": "But I also have to recognize who I am."}, {"time": 5916, "text": "And I think that that's one thing that I tried to do and continue to try to do over time."}, {"time": 5920, "text": "Like we're, oh man, hi, I'm the one that's asking for a favor here."}, {"time": 5925, "text": "If I spar with Raymond Daniels, Raymond Daniels is doing me a favor."}, {"time": 5928, "text": "I ain't doing him a favor."}, {"time": 5929, "text": "Let's not get it twisted."}, {"time": 5931, "text": "So thank you so much for your time."}, {"time": 5934, "text": "And this is not like some effected nonsense."}, {"time": 5936, "text": "This is serious."}, {"time": 5936, "text": "I'm like, thank you."}, {"time": 5937, "text": "If I spar with Steven Thompson, I'm the one being done a favor."}, {"time": 5940, "text": "George St. Pierre takes his time to spar with me, which he has in the past and not even kill me, which is really, I appreciate that because that's why I can sit here."}, {"time": 5947, "text": "George is not a prop for me to get my rocks off or see what's going on."}, {"time": 5952, "text": "And also I'm going to do that and then expect him to just take it."}, {"time": 5956, "text": "And I've seen, he's a gentleman."}, {"time": 5957, "text": "I've seen people get nuts with George and have him just be like, he's a patient of a saint."}, {"time": 5963, "text": "I don't have that level of patience, but I would just say to come back, figuring out like, hey, so what role am I here?"}, {"time": 5968, "text": "And that comes back to like, at least what I see people on the internet."}, {"time": 5971, "text": "Yeah, man, I have a beef with Joe Rogan."}, {"time": 5973, "text": "You're like, no, you don't, Ryan."}, {"time": 5975, "text": "You're some goof."}, {"time": 5976, "text": "I'm like, I'm some random dude."}, {"time": 5977, "text": "Joe, like people want to, they almost want to like elevate so that we can somehow be level with peers here."}, {"time": 5982, "text": "If I go into Feroz Zahabi's gym, I am not a peer of Feroz Zahabi."}, {"time": 5985, "text": "I am a student of TriStar."}, {"time": 5987, "text": "I'm a guest in the academy."}, {"time": 5988, "text": "And if Feroz asked me for something short of him, like telling me to try to do a triple backflip so I don't break my neck, the answer is yes, sir, I can do a free Feroz."}, {"time": 5996, "text": "No, man, in no words."}, {"time": 5997, "text": "And it's, and hopefully it should come with, I guess, a level of graciousness, but I guess that's kind of one of the things that I see nowadays with how accessible people are."}, {"time": 6004, "text": "Cause I grew up, you know, being a big, huge baseball sports fan of all kinds."}, {"time": 6008, "text": "I couldn't send Derek Jeter a message and much less have a possibility of a reply."}, {"time": 6014, "text": "And if I do, it's like, you know, I have people send me messages."}, {"time": 6018, "text": "It's very nice that people send me messages."}, {"time": 6020, "text": "Some people, again, and everyone, not everyone is coming from the same place, but I've had plenty of things that are like, yo, dude, I need you to do this for me."}, {"time": 6026, "text": "I'm like, well, I'll tell you what's never going to happen."}, {"time": 6029, "text": "That I have no idea who you are."}, {"time": 6031, "text": "And that was how I was addressed."}, {"time": 6032, "text": "And I don't need, oh man, you're the greatest one because that's weird and too, cause I'm not, but just, hey Ryan, how are you doing?"}, {"time": 6039, "text": "Hey, do you think you could do the following if you get a second?"}, {"time": 6041, "text": "I'm like, if I get a second, you're dang right I can."}, {"time": 6043, "text": "It's easy to ask."}, {"time": 6044, "text": "But it started with some level of politeness."}, {"time": 6047, "text": "And I guess like that's maybe being semi Southern, like I grew up in Virginia."}, {"time": 6051, "text": "Yes, ma'm."}, {"time": 6052, "text": "Like that goes a long way."}, {"time": 6054, "text": "And there's all different kinds of implementations of politeness."}, {"time": 6056, "text": "I mean, most of the successful people I've met, it's been surprising to me how much of, you mentioned peers, like I could think of Joe Rogan."}, {"time": 6068, "text": "You mentioned Joe Rogan, but Elon Musk, they don't, like they almost treat me like I'm the superior."}, {"time": 6078, "text": "Like it's not even, that's the politeness."}, {"time": 6081, "text": "Like, you know, that's the approach."}, {"time": 6083, "text": "The feeling of it is like, I'm the student, I'm the beginner, I'm like approaching the situation."}, {"time": 6087, "text": "Like it's almost like a method acting of like, you're better than me."}, {"time": 6096, "text": "And that's how I approach a lot of interactions."}, {"time": 6098, "text": "Like I have something to learn from this, even if it's like a young."}, {"time": 6101, "text": "Do you think that they're ungenuine?"}, {"time": 6102, "text": "They're totally genuine."}, {"time": 6104, "text": "But isn't that a funny thing?"}, {"time": 6105, "text": "Like in spite of who they are, they're incredibly genuine because they respect, correct me if I'm wrong, they respect you obviously for what you bring to the table."}, {"time": 6110, "text": "They also approach."}, {"time": 6111, "text": "No, no, they approach everybody like this."}, {"time": 6112, "text": "But that's all right."}, {"time": 6113, "text": "No, but I'm sure they respect for what you bring to the table."}, {"time": 6114, "text": "Beyond that though, they're treating you with dignity as a human being."}, {"time": 6117, "text": "Yeah, as a human being, that's right."}, {"time": 6119, "text": "And when they could probably get away with treating most people without a whole heck of a lot of dignity."}, {"time": 6123, "text": "And I guess what does that always say that like, you know, again, like you can always tell someone of quality because they treat the king and the janitor the same way."}, {"time": 6131, "text": "But that's what we're seeing a lot."}, {"time": 6133, "text": "Like, I guess I don't mean to like to nitpick, but that's where it would take issue, I guess a little bit, or disagree with the next."}, {"time": 6139, "text": "Are you gonna criticize with the internet again?"}, {"time": 6142, "text": "People on the internet."}, {"time": 6143, "text": "Old man yells at clouds."}, {"time": 6145, "text": "But anyway, but I guess what I mean is just like the way that people address each other because it's so casual now, you know, and it's great on the one hand, it's nice."}, {"time": 6155, "text": "On the other hand, you go, hey, I just, why can't do, am I somehow, am I worried about diminishing myself?"}, {"time": 6162, "text": "It's like the way that I'm sure that people talk to like, talk to women sometimes."}, {"time": 6165, "text": "And words, what's up girl?"}, {"time": 6168, "text": "I mean, she's a bitch."}, {"time": 6169, "text": "You know, versus like, how am I, that was supposed to get a good response?"}, {"time": 6173, "text": "What about that was going to elicit a favorable response?"}, {"time": 6177, "text": "You know, versus being anything, anything other than just, you know, man, what's going on?"}, {"time": 6182, "text": "And I guess that, does that make any sense?"}, {"time": 6183, "text": "It makes total sense."}, {"time": 6184, "text": "And that Southern thing that you're referring to, I feel like that's an important, that's an important part of human communication."}, {"time": 6194, "text": "You're a new back attacks instructional."}, {"time": 6196, "text": "First of all, awesome."}, {"time": 6200, "text": "Second of all, you drop a lot of fascinating insights in there, but you quote Galileo out of all people in saying that you can't teach a man anything."}, {"time": 6211, "text": "You can only help him find it within himself."}, {"time": 6214, "text": "So we talked about how to start in Jiu Jitsu."}, {"time": 6219, "text": "What about if we zoom out even more and how do you learn how to learn?"}, {"time": 6226, "text": "How do you optimize the learning process?"}, {"time": 6229, "text": "I don't know the answer to that, but I can tell you what I'd like to do."}, {"time": 6232, "text": "And I would say like, I can't step one."}, {"time": 6234, "text": "I don't, I'm not, maybe this is a little bit easier for me cause you know, I've never had a ton of friends, honestly."}, {"time": 6239, "text": "I've, you know, I've got my close friends and people that I know, but I've never had tons and tons of people."}, {"time": 6244, "text": "So I spent a lot of time, you know, thinking."}, {"time": 6246, "text": "And anyway, I can't, I can't control you."}, {"time": 6250, "text": "I can't control anybody else."}, {"time": 6252, "text": "I, you know, I, all I can, I want to take my, it's a Marcus Aurelius thing."}, {"time": 6259, "text": "It's like, you know, I guess the trick to life is figuring out what's in our control and what's not and focusing on things that are in our control, I guess."}, {"time": 6265, "text": "And so step one is figuring out both internally and then also out in the world as it pertains to Jiu Jitsu, what is actually in my control and what is not."}, {"time": 6275, "text": "Like passing someone's guard is not in your control."}, {"time": 6277, "text": "People think it is, it ain't."}, {"time": 6279, "text": "If I can't just do an activity and be unchecked, then it ain't in my control entirely."}, {"time": 6286, "text": "I can always breathe."}, {"time": 6287, "text": "I can always, you know, be calm."}, {"time": 6291, "text": "I can always, no matter whether I'm concerned or not concerned, have whatever you want to call it, nerves, you know, I can step forward across the line and say, I will, I will face the challenge ahead."}, {"time": 6301, "text": "That is all entirely, no one can stop me from doing that."}, {"time": 6303, "text": "That's entirely in my control."}, {"time": 6304, "text": "And that's why I know that every single time that I walk into the ring, I'll walk in and out of there with my head held high because there's, I will fight with everything that I have."}, {"time": 6313, "text": "I can't promise that I'll win."}, {"time": 6315, "text": "I would say I take that same first principles."}, {"time": 6317, "text": "You mentioned last time we talked, you know, with Elon and the importance of that and going, what are the first principles?"}, {"time": 6324, "text": "And I guess to come back a lot of times, in my opinion, the things that people think are the basics are not the basics."}, {"time": 6330, "text": "You can't learn."}, {"time": 6331, "text": "If you think you're reasoning for first principles, but you're actually like level six, you're actually like layers up, you're making so many, there's so many baked in assumptions to what's going on that you're gonna struggle to understand why anything is actually happening, internally, externally, you name it."}, {"time": 6346, "text": "So I guess what I would start when it comes to learning is first principles and trying to understand what's going on, but then also simple things first."}, {"time": 6353, "text": "I can control my posture."}, {"time": 6356, "text": "I can control my breathing."}, {"time": 6358, "text": "No one can stop me from doing that."}, {"time": 6359, "text": "I can control where I place my frames."}, {"time": 6361, "text": "I can control where I place my limbs."}, {"time": 6363, "text": "I can move my feet."}, {"time": 6365, "text": "I can develop the ability to do these things better, of course."}, {"time": 6368, "text": "And I do that through practice, through drilling, through watching people."}, {"time": 6370, "text": "I've been incredibly fortunate in my time in martial arts to train with many of my heroes, to train with many of the people that I looked at."}, {"time": 6376, "text": "And I was like, that guy is amazing."}, {"time": 6378, "text": "I wanna train with this person, like Stephen Thompson, Kenny Florian, George St. Pierre, Raymond Daniels, Farah Zahabi, you know, I mean, like Bruno Frazada, Marcelo Garcia, you know, all of these guys that are just unbelievable."}, {"time": 6390, "text": "And I go, well, they're moving in a way that's different."}, {"time": 6393, "text": "Well, how do I do that?"}, {"time": 6394, "text": "Well, sometimes you can ask them and they can tell you directly."}, {"time": 6397, "text": "Other times, people, part of the genius of what they do is that it's intuitive."}, {"time": 6401, "text": "And maybe they don't think and understand and see the world the same way that I do."}, {"time": 6404, "text": "That was something that I experienced with Marcelo."}, {"time": 6408, "text": "But in a different way than his, it just, we see things fundamentally different."}, {"time": 6414, "text": "We experience the world differently."}, {"time": 6415, "text": "It seems to me that we do."}, {"time": 6416, "text": "And again, that taught me a really important lesson because I was wanting, when I trained there, to have someone go, hey, Ryan, do this, this, this, and this, and that's how it works."}, {"time": 6424, "text": "And I'm like, all right, because that's how I understood martial arts at the time."}, {"time": 6428, "text": "I wasn't ready to have someone tell me, like, hey, it feels a little bit like this, and I just kind of do it, which is kind of what Marcelo would do at the time."}, {"time": 6439, "text": "He was less experienced as a teacher, but that is what he was doing."}, {"time": 6442, "text": "I was completely, I couldn't separate in my mind performance and understanding."}, {"time": 6448, "text": "I thought that if I understand, I could do it."}, {"time": 6450, "text": "And I would also struggle sometimes to wonder why I couldn't execute things that I thought I understood, and why guys like Marcelo were just so elemental."}, {"time": 6460, "text": "I mean, in like the, like lightning, wind, like that type of thing where like, it's just so in touch with what they wanted, with their capabilities."}, {"time": 6467, "text": "They could summon their powers at will."}, {"time": 6470, "text": "I couldn't always do that."}, {"time": 6472, "text": "And I guess, so recognizing that there was more than one way to the top of the mountain, and also I had a lot of science, but I didn't have a lot of art, or I had some science, I should say, but I didn't have a lot of art."}, {"time": 6482, "text": "Meeting people like Marcelo taught me, and then Josh Waitzkin, actually brilliant guy, chess champion, former owner, maybe owner of Marcelo's Academy, really great friend."}, {"time": 6490, "text": "I think he has a book on learning."}, {"time": 6491, "text": "He does, yeah, The Art of Learning, actually."}, {"time": 6493, "text": "But yeah, he knows a thing or two about it, but a great guy."}, {"time": 6496, "text": "And anyway, he sat me down one time, and was like, look, man, you're doing this wrong."}, {"time": 6499, "text": "You're missing what the, missing the genius, the brilliance that's right in front of you."}, {"time": 6504, "text": "And it took me a long time."}, {"time": 6506, "text": "What did he mean exactly?"}, {"time": 6508, "text": "I was frustrated with my inability to grasp certain things, and sometimes the teaching style being different."}, {"time": 6514, "text": "Not wrong, just it was, it was tough on me at times."}, {"time": 6518, "text": "So you were trying to replicate what Marcelo was saying as opposed to understanding the fundamentals from which it was coming."}, {"time": 6526, "text": "Right, I couldn't see, I couldn't see where it was coming from."}, {"time": 6528, "text": "And also, sometimes I'm like, well, why can't you explain it in the way that I would want you to explain it?"}, {"time": 6533, "text": "And he's like, well, why can't I meet him where he's coming from?"}, {"time": 6535, "text": "So anyway, it was a really important time, unless I'm very, very frustrating if I'm honest, but it's not, I'm so thankful for that time."}, {"time": 6543, "text": "And anyway, you know, I guess."}, {"time": 6546, "text": "So always first principles, trying to understand the basics, first starting at the place where you can control things, the very basic elements of what you can work with."}, {"time": 6555, "text": "And then when there's other mentors and teachers to."}, {"time": 6559, "text": "Meet them where they're coming from."}, {"time": 6560, "text": "To the extent that I can."}, {"time": 6561, "text": "Rather than, I'm not, like, again, it's like, why are you not talking to me the way I want you to talk to me?"}, {"time": 6566, "text": "As opposed to, hey, where are you coming from?"}, {"time": 6568, "text": "Back to your point."}, {"time": 6569, "text": "But I know that's not entirely specific, but you know, like, if you can focus on that and back to the whole, you can't teach a man anything."}, {"time": 6577, "text": "Marcelo didn't teach me anything, but he taught me in so doing, like, and other people like that, to find it within."}, {"time": 6585, "text": "And it's like, yeah, I guess something else that I've heard before is that all learning is self discovery, but all performance is self expression."}, {"time": 6592, "text": "And I always thought that Marcelo was a brilliant master of letting what's inside out."}, {"time": 6596, "text": "He was so consistent in his performances."}, {"time": 6599, "text": "And a lot of times I felt like there was a block there personally, particularly at the end of Jiu Jitsu when I was very, very results oriented."}, {"time": 6604, "text": "And I wasn't, I think my focus was not ideal."}, {"time": 6608, "text": "It was definitely not in the place that I would like it to be."}, {"time": 6610, "text": "And whether it would have won more or lost more, hard to say, but I know that I would have performed better if I'd have adjusted that."}, {"time": 6615, "text": "And anyway, that recognizing that, again, Jiu Jitsu, I think I've said it before, Jiu Jitsu studies is a science, but expressed as an art."}, {"time": 6622, "text": "It doesn't matter if you can articulate what you know how to do."}, {"time": 6625, "text": "What matters is if you can do what you know how to do."}, {"time": 6627, "text": "It only matters if you're, you know, I guess if you're teaching in a verbal fashion is whether or not you can articulate it, but recognizing the difference between learning on an intellectual level or conceptual level and being able to translate that into the physical."}, {"time": 6640, "text": "And I guess like that's been the thing that I feel like fortunate over time in my own academy to be able to kind of fiddle around and learn on my own and practice with my students."}, {"time": 6647, "text": "And, you know, sometimes I struggle to have great training partners."}, {"time": 6672, "text": "Because again, knowing an idea and then not drilling, what's the point?"}, {"time": 6676, "text": "I'll never have it."}, {"time": 6677, "text": "It'll never see the light of day."}, {"time": 6679, "text": "So in that DVD, in that instruction DVD, sorry."}, {"time": 6682, "text": "It's an online instructional DVD."}, {"time": 6685, "text": "I keep saying DVD though."}, {"time": 6686, "text": "Nobody has DVDs anymore."}, {"time": 6687, "text": "Do they not?"}, {"time": 6687, "text": "It's like VHS."}, {"time": 6689, "text": "Who has DVDs?"}, {"time": 6690, "text": "What, like Blu Ray?"}, {"time": 6691, "text": "I possess some DVDs."}, {"time": 6693, "text": "I mean, like I've never watched them."}, {"time": 6694, "text": "What do you use them for?"}, {"time": 6695, "text": "Like a cup, like a thing you put a drink on?"}, {"time": 6701, "text": "I mean, in a pinch, yeah."}, {"time": 6706, "text": "What's that even called?"}, {"time": 6708, "text": "Coaster?"}, {"time": 6709, "text": "Yeah, my matrix coaster."}, {"time": 6712, "text": "The matrix coaster, zeros and ones."}, {"time": 6715, "text": "Okay, so in that instruction that people should get, I've been watching."}, {"time": 6721, "text": "I'm really enjoying."}, {"time": 6723, "text": "It's, I don't even know when it came out recently, right?"}, {"time": 6726, "text": "Like December or something like that?"}, {"time": 6727, "text": "Yeah, it's part one."}, {"time": 6730, "text": "It was actually like ended up being like 18 hours long and I was like, oh my God, we gotta chop it in half."}, {"time": 6734, "text": "And when it comes together, the whole thing, I think I hope people will like it."}, {"time": 6737, "text": "Yeah, well it's even part one is really good."}, {"time": 6740, "text": "Yeah, people on Reddit were really excited for part two as well."}, {"time": 6744, "text": "And you also have a back."}, {"time": 6745, "text": "Oh, the old one."}, {"time": 6746, "text": "The old one that I, that was really helpful to me to understand some very basic aspects of control for the back."}, {"time": 6754, "text": "Yeah, that was, you know, that clicked with me."}, {"time": 6757, "text": "There's very few instructionals."}, {"time": 6759, "text": "There's very few things I've watched that ever clicked with me and that was definitely it."}, {"time": 6765, "text": "It taught me one thing, I don't know, it's you drop a lot of sort of bombs, you drop a lot of really interesting details and it's funny that there's only specific things that really click."}, {"time": 6780, "text": "Like a lot of it rings true and you kind of take it in and it's like, oh, that's interesting, okay, yeah, but there's certain things that really click."}, {"time": 6787, "text": "And I remember when that first instruction will click with me is like the importance."}, {"time": 6794, "text": "I don't remember any more like how you communicated it because I've now integrated, it's now mine, you know what I mean?"}, {"time": 6801, "text": "But it was more about you just describing upper body control and the importance of the upper body control from the back."}, {"time": 6809, "text": "And just like the, there's certain grip, like you did describe different details on the grips and so on and as I started trying it, I realized how important upper body control is versus like me maybe as a blue belt or something was I thought like you have achieved victory when you got the two hooks in."}, {"time": 6831, "text": "And then I realized like at least for me that the hooks were not even for my body type, for my style, for the way I approach things, they were not even important at all."}, {"time": 6841, "text": "It's supplemental for the most part, yeah."}, {"time": 6842, "text": "So they were there for the points but I can establish a huge amount of control."}, {"time": 6848, "text": "In fact, the hooks were, you were talking about like illusion of choice, it almost made people panic a lot more when you were like fighting for it or establishing that kind of control."}, {"time": 6860, "text": "They were a lot less panicked when the hooks weren't involved even though they should be a lot more panicked."}, {"time": 6865, "text": "Anyway, I realized a lot of those kinds of things, especially that had to do with judo because so much of judo on the ground is centered around aggressive, efficient, very fast choking, like different kinds of clock chokes and all that kind of stuff."}, {"time": 6881, "text": "What a brilliant thing that is only gonna start to make its way into jiu jitsu coming up but like the judo style approach to like clock choking, triangling from the top of the turtle and stuff, so powerful."}, {"time": 6890, "text": "Yeah, and there's something about judo that emphasizes obviously due to the rules, the urgency."}, {"time": 6897, "text": "So you only do techniques that go fast."}, {"time": 6900, "text": "And then the other thing is, which I guess jiu jitsu emphasizes too but judo really does, which is the transition."}, {"time": 6910, "text": "So like while the person's flying in the air is the easiest time."}, {"time": 6914, "text": "I mean, this is like Ryan Hall type of shit, which is like, why not put in your submissions or positional control while they're in the air?"}, {"time": 6923, "text": "If you could, why would you not, right?"}, {"time": 6926, "text": "It's like, oh, well, I don't throw well."}, {"time": 6927, "text": "We'll learn how to throw and then do it."}, {"time": 6929, "text": "And so you should think, I mean, in the transition, when they're flying is the easiest time to put in stuff."}, {"time": 6935, "text": "And that's when you think about chokes, as you're throwing, you should be thinking about the choke and then everything becomes a lot easier."}, {"time": 6942, "text": "You ever see Flabio Canto?"}, {"time": 6946, "text": "Man, Brazilian judoka is just so cool."}, {"time": 6948, "text": "Like with stuff like that."}, {"time": 6949, "text": "Yeah, exactly, but that has to do with the first starting principle of like, stop thinking this as a two phase game of standing and then ground."}, {"time": 6960, "text": "Start thinking about like the standing and the, the standing comes before and the ground comes after, but everything happens in a transition."}, {"time": 6967, "text": "Well, unless you're attacking, what is the art of war?"}, {"time": 6969, "text": "Like, we all like, everyone's like, oh yeah, the art of war, oh yes, yes, yes."}, {"time": 6972, "text": "And then they immediately throw it away and then fight like a fricking barbarian."}, {"time": 6976, "text": "But, I mean like, I'm serious, but how many people quote stuff and then like, it's like the, what is it, the family guy joke where they're like, quoting Jesus and Jesus walks in, he's like, you're not listening to my work, what are you talking about?"}, {"time": 6987, "text": "And anyway, basically, like the art of war, one of the things that's like the only thing that you can be sure of being successful in attacking is something that's undefended."}, {"time": 6999, "text": "We're like, well, yeah, yeah, yeah, yeah."}, {"time": 6999, "text": "But you know, in a fight though, they're defended."}, {"time": 7002, "text": "Well, are they?"}, {"time": 7004, "text": "There's moments all the time where I'm borderline defenseless."}, {"time": 7007, "text": "And if you were to attack at that moment, if you could see it and then seize the moment, if you were capable of both, you should not only expect to be successful, you should be damn sure you're gonna be successful."}, {"time": 7016, "text": "And more important than that, you'll be successful."}, {"time": 7018, "text": "And even if somehow not, you won't be countered."}, {"time": 7020, "text": "And I guess like, that's the trick of almost all like conflict, right?"}, {"time": 7025, "text": "It's like showing up when the other person's taking a nap."}, {"time": 7029, "text": "And then it's so funny, like we take like a protracted war."}, {"time": 7031, "text": "It's like, oh, it takes five years."}, {"time": 7033, "text": "And there's lulls and there's a battle this month, but then there's a couple of weeks, another battle."}, {"time": 7037, "text": "It's like, well, if you just shrink that down, it's the microcosm, macrocosm idea."}, {"time": 7040, "text": "That same thing, that whole war is taking place in five minutes or 10 minutes or 15 minutes."}, {"time": 7044, "text": "And there's moments of lulls of person effectively going for a snack, being like in a horror movie, like, hey guys, I'm gonna go get a beer from around the way."}, {"time": 7053, "text": "Like I'm dead for sure."}, {"time": 7055, "text": "Is there, on this particular instructional, if you can convert it to words, you talk about finishing the submission."}, {"time": 7063, "text": "Is there some interesting insights that you find beautiful or profound about finishing the rear neck and choke or just finishing the submissions for the back control?"}, {"time": 7074, "text": "Is there something like, you know, you talk about the squeeze and the crush and all these kinds of principles."}, {"time": 7081, "text": "Is there something about control about the process of finishing that you find especially profound about this position?"}, {"time": 7090, "text": "The opposite of one profound truth can be another profound truth."}, {"time": 7093, "text": "So like, it's, I do a."}, {"time": 7097, "text": "Did Jesus say that?"}, {"time": 7098, "text": "No, I don't, I actually was a guy on Tumblr."}, {"time": 7101, "text": "But yeah, it was really, really cool."}, {"time": 7104, "text": "There was like a tree in the background."}, {"time": 7106, "text": "But anyway, but so let's say like, I'll use examples."}, {"time": 7111, "text": "Like first off, I saw someone finishing a 50, 50 heel hook in the UFC one promo."}, {"time": 7116, "text": "It was like some chubby dude in karate, like inside heel hook and another dude."}, {"time": 7123, "text": "Well, I didn't know they were doing that back then at least."}, {"time": 7125, "text": "And whether they were doing it all, how many times did someone do something and then that works?"}, {"time": 7130, "text": "And then we go, okay, cool."}, {"time": 7131, "text": "Versus, hey, maybe we should do that all the time."}, {"time": 7133, "text": "So anyway, how long were we all taught to do the seatbelt the way we all do the seatbelt in jiu jitsu?"}, {"time": 7138, "text": "Like long time, why?"}, {"time": 7139, "text": "Works."}, {"time": 7140, "text": "In fact, it works so well."}, {"time": 7142, "text": "And it was so, it was then the people who used it were so prolific that we went, well, solve that one."}, {"time": 7148, "text": "Good to go."}, {"time": 7150, "text": "All right, no more thinking."}, {"time": 7151, "text": "And then you go, imagine you were to like the Merkel, the Merkel flip, all those positions that were showing in the DVD, which is pretty much, or whatever the heck it is, the digital VD."}, {"time": 7162, "text": "No, not VD, don't want that."}, {"time": 7164, "text": "Digital video something."}, {"time": 7166, "text": "But basically recognizing that doing it on the wrong side is at least as effective."}, {"time": 7172, "text": "Doesn't mean that the other side wasn't good."}, {"time": 7174, "text": "There could be something that's the literal borderline opposite of that."}, {"time": 7178, "text": "And you go, huh, well, that's something."}, {"time": 7182, "text": "Like imagine like, I would say almost all of these things, all the tactics and all the strategies."}, {"time": 7186, "text": "So I guess that was something that we came to like training in the gym like a year ago, maybe, and then playing with sense."}, {"time": 7191, "text": "And it's just, it's huge."}, {"time": 7192, "text": "I'm like, oh wait, so let me get this straight."}, {"time": 7194, "text": "First off, I can use my strong side seatbelt, my right arm over the shoulder all the time."}, {"time": 7198, "text": "Well, that's really helpful because that's a lot better than my left."}, {"time": 7200, "text": "I can do both sides of my left, but if I had to bet my life on being able to finish it, I would want my right arm over."}, {"time": 7205, "text": "Everything that's a tactic or a strategy evolved from an idea."}, {"time": 7208, "text": "Like capitalism's an idea."}, {"time": 7210, "text": "Anarchy is an idea, and then it becomes, well, what does that all mean?"}, {"time": 7213, "text": "What are the consequences?"}, {"time": 7214, "text": "What's the fallout of all this, right?"}, {"time": 7216, "text": "So what if we start with jujitsu, the idea of the guard, right?"}, {"time": 7220, "text": "And we go, well, I mean, why do you use the guard?"}, {"time": 7222, "text": "No other martial art really has developed the guard in the same way that jujitsu has."}, {"time": 7226, "text": "Well, what is the guard?"}, {"time": 7227, "text": "A guard's a defensive idea where you're kind of on your back to some extent or another, and you're using your legs as a wall between you and the other person, and the other guy represents danger."}, {"time": 7236, "text": "And you're like, yeah, yeah, that's a great idea."}, {"time": 7239, "text": "I mean, it clearly works, at least to a certain extent, but where do I want to put my legs when I want to get up?"}, {"time": 7244, "text": "Not on the other dude."}, {"time": 7245, "text": "I'm trying to put them on things on the floor."}, {"time": 7247, "text": "If I want to generate a ton of power, what's the first thing I do with my feet?"}, {"time": 7251, "text": "I anchor them to the floor."}, {"time": 7252, "text": "Drive for a punch, you name it."}, {"time": 7253, "text": "Move away, jump, dart, you name it."}, {"time": 7256, "text": "So does it mean that that's a terrible idea to be on your back?"}, {"time": 7259, "text": "No, clearly it works."}, {"time": 7260, "text": "And clearly it has function."}, {"time": 7263, "text": "But what if the function that we're giving it and how much focus we're assigning to it is disproportionate to its effectiveness?"}, {"time": 7271, "text": "Maybe, what if it's not a good idea?"}, {"time": 7273, "text": "I'm not saying it's not a good idea, but what if it wasn't?"}, {"time": 7275, "text": "That's a foundational idea of jujitsu."}, {"time": 7276, "text": "And then how much, because no one questions that foundation, how much innovation is built on top of the idea?"}, {"time": 7282, "text": "Well, of course I want to be, my being on my back is in okay position."}, {"time": 7285, "text": "So now they're innovating, but they're innovating within a closed system that they think they're innovating in this open space of, oh my God, it can be anything, when in reality it can be anything within this little set."}, {"time": 7296, "text": "But you don't realize that you're in a set."}, {"time": 7297, "text": "You don't realize that you're in a box."}, {"time": 7299, "text": "There would be answers that would become so immediately apparent to you if you were willing to look outside of that, but you'll literally never even look over to your left because you don't even realize the left exists."}, {"time": 7309, "text": "Do you think there's a lot of places in jujitsu, whether it's back control or generally guards and all the different positions, where there's a lot of space, like a lot to be discovered by questioning the basic assumptions."}, {"time": 7323, "text": "Maybe if you can give examples of like back control, like, is there something you've discovered that's like?"}, {"time": 7328, "text": "Merkle versus seatbelt."}, {"time": 7329, "text": "What's Merkle with seatbelt?"}, {"time": 7330, "text": "Seatbelt is a right arm over the shoulder, left arm under the arm."}, {"time": 7334, "text": "I'm on the same side as my choking arm."}, {"time": 7337, "text": "Merkle is just, I do the same thing."}, {"time": 7339, "text": "I don't even adjust my hands."}, {"time": 7340, "text": "I walk myself over to the left side."}, {"time": 7342, "text": "I'm on the opposite side."}, {"time": 7343, "text": "It's actually a more powerful position."}, {"time": 7344, "text": "Yeah, for people listening, for people who might not know, jujitsu is a, seatbelt is a control."}, {"time": 7350, "text": "We're talking about when one person is on the back of another person, which is a really dominant position in jujitsu, seatbelt is a, I guess, widely accepted way of holding your arm."}, {"time": 7362, "text": "Like best practices on those kinds of things."}, {"time": 7362, "text": "Best practices, yeah, and it's worked so well."}, {"time": 7365, "text": "So it's a one arm over, one arm under, and there's a certain side you're supposed to be on when you're on the back."}, {"time": 7373, "text": "Everyone teaches, there's a choking arm, that's the arm that's over, and your body's supposed to be on a certain side relative to that."}, {"time": 7381, "text": "And then Ryan is describing, questioning these basic assumptions of which side you're supposed to be on."}, {"time": 7387, "text": "And let's say that's even just like a mid level assumption."}, {"time": 7389, "text": "It's not even a first principles assumption, but it's pretty close to."}, {"time": 7392, "text": "It's getting there, but let's just say, for sake of argument, it goes a lot deeper, maybe."}, {"time": 7398, "text": "I think most of the innovation that I see is not innovation."}, {"time": 7401, "text": "It's like basically changing the color of a car or polishing like the window a little bit, where you're like, hey, you made it, you made it a little bit different, you made it a little bit better."}, {"time": 7410, "text": "It's like, oh man, what if I did the same guard and then grab the lapel?"}, {"time": 7414, "text": "I'm not saying that's bad, but you're not fundamentally changing anything."}, {"time": 7417, "text": "I think most of the big seismic shifts that we see in almost anything come from, hey, that thing we thought was right was wrong, rather than not only is it right, it's even righter."}, {"time": 7428, "text": "And you're like, that's not wrong, that's not bad, but that's, it's like, oh man, let's say, for instance, I didn't make the triangle better, but let's say I made the triangle a little bit better than it was, or than it was taught."}, {"time": 7438, "text": "I mean, you can call it innovation."}, {"time": 7440, "text": "It's not like the person that said, hey, have you guys ever heard of a triangle before and came up with that?"}, {"time": 7444, "text": "We're like, that is, you're like, that's on the list?"}, {"time": 7446, "text": "You can do this thing to people?"}, {"time": 7448, "text": "Can you imagine you invented the straight right hand?"}, {"time": 7451, "text": "You'll be like one punch man."}, {"time": 7452, "text": "You can walk around and just lay low every single person you got into a fight with, because it didn't even occur to them to hit you with their back hand."}, {"time": 7459, "text": "In a world full of jabbers, you throw your back hand."}, {"time": 7462, "text": "You're gonna kill people."}, {"time": 7464, "text": "Well, but by the way, I mean, just to pause on that, first of all, somebody did invent the triangle probably, right?"}, {"time": 7471, "text": "It's not a trivial thing once you think."}, {"time": 7473, "text": "How many of these giant things that we all go like, oh yeah, yeah, yeah, we all use that now."}, {"time": 7476, "text": "Can you imagine you have triangles and heel hooks and rear naked chokes and I don't have those?"}, {"time": 7481, "text": "You're on beat, you're borderline, I mean, like, that's why, that's, we all, every single one of this, particularly those of us, I mean, when did you first start training, Lex?"}, {"time": 7488, "text": "12, 13, well, let's not count wrestling, but 13 years ago with Jiu Jitsu."}, {"time": 7493, "text": "Right on."}, {"time": 7494, "text": "So let's say about that time where particularly it was still like kind of, kind of undergroundy, you know, and you're like, hey, we all experienced being like a relative, like a mid level white belt and being able to easily beat up all our friends because everyone wrestled other buddies."}, {"time": 7507, "text": "And it was one of those ones where like, they don't have weapons to end the fight."}, {"time": 7511, "text": "You have weapons to end the fight."}, {"time": 7513, "text": "That's so, that's such a crazy, you know, asymmetric advantage that if you lose, it's on you now, man."}, {"time": 7521, "text": "Like, like you had the, next time it's like, I've got this rifle and you have nothing."}, {"time": 7526, "text": "And I decided to put it on my back and then run over and try to karate chop."}, {"time": 7528, "text": "You're like, okay, next time, just make sure you use the rifle, bud."}, {"time": 7531, "text": "I'm like, oh yeah, I should do that."}, {"time": 7534, "text": "Yeah, it's kind of fascinating to, I mean, everything you're describing is a, there's a fascinating tension between like, whatever I show people for the first time, what a triangle is, just like regular people."}, {"time": 7545, "text": "It's like, they're discovering is like, oh, okay, that's interesting."}, {"time": 7547, "text": "I mean, MMA has changed that, but people haven't watched MMA."}, {"time": 7551, "text": "That's an interesting move."}, {"time": 7552, "text": "It doesn't make sense why that would be a choke."}, {"time": 7554, "text": "And they kind of quickly accepted that's a thing and they accept the basics without questioning, wait a minute, what's actually being choked?"}, {"time": 7566, "text": "How is it that a shoulder of a person can do the choking?"}, {"time": 7572, "text": "Like, I'm not sure I fully question the fundamentals of all of that."}, {"time": 7576, "text": "Like, what exactly is the blood supply that's being cut off?"}, {"time": 7581, "text": "Like, what is the anatomy and the physiology of all of that?"}, {"time": 7585, "text": "And if you understood all that, what else can we do here?"}, {"time": 7587, "text": "Yeah, what else can we do here?"}, {"time": 7588, "text": "That's the really important thing."}, {"time": 7589, "text": "But if we know, if I'm an end user, which almost everyone is of almost anything, I'm serious, where I'm like, I think about stuff in my life, the only things I really think about are like martial arts and martial arts strategy and like, I don't know, some other couple, a couple other things, but not much."}, {"time": 7602, "text": "And anything else in my life is borderline unexamined."}, {"time": 7606, "text": "And I like to think that if I put a lot of effort in something, I'd like to think that I could figure at least some things out about it, but I figured out almost nothing about anything in my life because I haven't even looked."}, {"time": 7614, "text": "And if you're an end user, what are you capable of versus you can literally alter the source code."}, {"time": 7620, "text": "You are Neo in the fricking matrix, if you can alter the code and I can't."}, {"time": 7624, "text": "And it's like, we think, ah, ah, ah, ah, but imagine you are a world class anything, or you're not even world class, forget it."}, {"time": 7631, "text": "Like a purple belt compared to a white belt or compared to a no belt might as well be John Jones or Marcelo Garcia, you're gonna beat them up comparably bad."}, {"time": 7638, "text": "So it's, that actually is a common thing where people can't tell the difference between levels."}, {"time": 7643, "text": "They're like, oh man, I've trained with my black belt instructor, how much better could so and so be?"}, {"time": 7646, "text": "Like, so much better you're gonna have a hard time wrapping your head around it."}, {"time": 7650, "text": "I remember when I first trained with Marcelo Garcia in 2007, I was a decent purple belt."}, {"time": 7654, "text": "And of course he mollywopped me very gently."}, {"time": 7656, "text": "And then training with him again in 2008, I was definitely better."}, {"time": 7660, "text": "I won the gi and no gi worlds that you're a purple belt."}, {"time": 7662, "text": "So definitely for the record, I'm definitely not a jujitsu world champion."}, {"time": 7665, "text": "I wanted the purple belt, but like, that's not the same at winning a black belt and a tough accomplishment, but not in the same thing at all."}, {"time": 7671, "text": "But anyway, I was definitely better."}, {"time": 7674, "text": "He beat me up just the same."}, {"time": 7675, "text": "I'm like, okay, 2009, I was a lot better."}, {"time": 7679, "text": "Got a medal at ADCC that time, won the trials, crushed everybody, like no, just submitted everybody like bop, bop, bop, bop."}, {"time": 7686, "text": "Training with Marcelo Garcia, it was worse."}, {"time": 7689, "text": "And in 2010, training with Marcelo Garcia, same, same."}, {"time": 7693, "text": "So the idea was, I wouldn't be able to tell you the difference and the outcome difference was the same in all of these rounds."}, {"time": 7700, "text": "I was significantly more experienced and more adept each time that this occurred."}, {"time": 7705, "text": "But it was like, how many number of times did this person submit you or pass your guard in the round?"}, {"time": 7709, "text": "I'm like, I don't know, probably like, let's say five each one, because it's gonna be a brief period of time."}, {"time": 7713, "text": "And let's say it was three on one, six on another, I'm like, whatever, it's comparable."}, {"time": 7715, "text": "It's six one and a half dozen."}, {"time": 7717, "text": "Would I be able to easily tell the difference?"}, {"time": 7720, "text": "No, I would just say, I know in concept that he's way better, so much better."}, {"time": 7724, "text": "But there's plenty of other people that could have beaten me just as bad as Marcelo did when I was a purple belt or when I was a brown belt."}, {"time": 7729, "text": "Then maybe I would watch Marcelo walk through like their borderline, not there."}, {"time": 7733, "text": "So it's neat."}, {"time": 7734, "text": "Like if you, that's back to kind of what I was talking about about certain people beginning to really like peel back some of what's really special about the martial arts or any activity I presume is they get to a level of understanding in depth that they're playing with like the almost the reality of that thing."}, {"time": 7751, "text": "And I'm playing by rules that are not rules."}, {"time": 7754, "text": "I'm not even one of the, to use a matrix analogy, I'm not even an agent, which is the best version of something playing by the rules."}, {"time": 7761, "text": "I'm like one of the regular people or one of the regular people that got out of the matrix."}, {"time": 7765, "text": "So I'm like, oh, I'm cool, but when I fight an agent, I lose because we're both in the rules, but they just play them to the bone and I'm just here."}, {"time": 7772, "text": "Well, and then the agent encounters Neo and they can do nothing."}, {"time": 7776, "text": "You're like, why?"}, {"time": 7776, "text": "Because it's operating outside of what the rules are, but not really what the rules are, what they perceive to be the rules are clearly."}, {"time": 7782, "text": "So anyway, I guess that's kind of my point about Marcelo or certain other people that are doing things where you go, that doesn't even seem real."}, {"time": 7788, "text": "It doesn't seem real to me because I don't understand what's going on."}, {"time": 7791, "text": "And I guess if we can get down to base assumptions, like if we can constantly strip away, strip away, strip away, let's say we always thought that turning left was right, was correct."}, {"time": 7799, "text": "And it turns out that turning right was correct."}, {"time": 7801, "text": "Change your life."}, {"time": 7802, "text": "Yeah, it's a, what is it, Socrates said, the unexamined life is not worth living."}, {"time": 7808, "text": "So you just basically have to rigorously just constantly examine every assumption over and over and over."}, {"time": 7814, "text": "But doesn't that give your life meaning to come back to the struggle, to come back to free will, to come back to, what if we could strip all that away?"}, {"time": 7820, "text": "All right, let me just stick the needle in my arm and that's that."}, {"time": 7823, "text": "Yeah, no, I mean that constant striving for understanding yet another lower layer of the simulation we're living in is something that's actually deeply fulfilling that I don't know if it's genetically built in, but there's something about that striving to understand that seems to be deeply human."}, {"time": 7845, "text": "Which is funny, what makes a human, we don't talk about the soul anymore, man."}, {"time": 7849, "text": "I went to Catholic school as a kid."}, {"time": 7850, "text": "Whether you buy into all that stuff or not, you're like, what about the soul of a person, the spirit of a people, the spirit of a nation, anywhere, the spirit of humanity?"}, {"time": 7860, "text": "We talk about everything like it's this quantifiable thing when maybe certain things are, maybe everything is, but then what happens if there's things that just aren't quantifiable, that nothing in our understanding can or will ever explain it?"}, {"time": 7873, "text": "That doesn't mean that that should be our assumption."}, {"time": 7874, "text": "It's for your assumption that we can explain everything and let's get to the dang bottom, peel, peel, peel, peel."}, {"time": 7878, "text": "But what if there is actually something that we need challenge for?"}, {"time": 7884, "text": "And we could be looking in the wrong place by going, oh, is it in the genes?"}, {"time": 7888, "text": "Again, I'm not saying we're looking in the wrong place like I would know anything, I do karate."}, {"time": 7891, "text": "But basically, not even well."}, {"time": 7894, "text": "But yeah, we do karate, mediocre, just ask Raymond Daniels or Stephen Thompson."}, {"time": 7898, "text": "But I guess to come back, though, you just."}, {"time": 7901, "text": "Are you a yellow belt yet, or are you?"}, {"time": 7903, "text": "Man, I actually, have you ever seen the Seinfeld episode where Kramer fights the kids?"}, {"time": 7907, "text": "Yeah, I did that at Raymond Daniels school and the kids won in class in addition to the alleyway."}, {"time": 7913, "text": "Oh, they finished it off afterwards."}, {"time": 7915, "text": "Yeah, exactly, when I was on my last legs."}, {"time": 7918, "text": "But yeah, I would just, maybe, it's funny, I feel like there's something deeply missing from public understanding anymore."}, {"time": 7927, "text": "It's almost like the idea that we can figure everything out, which I deeply believe in, but also the possibility that there's some things that we'll never really see and some things we'll never understand."}, {"time": 7935, "text": "And there's something, like you said, uniquely human about the human experience, that even if I had the power to change, I don't wanna fuck with it, man."}, {"time": 7945, "text": "I don't wanna change that thing."}, {"time": 7947, "text": "Oh, yeah, well, wouldn't it be great if we just immediately knew the outcome of everything and you just press this button, you're like, oh, that's gonna, what's the point of living life then?"}, {"time": 7954, "text": "Even if you could do it, it's the, Ian, you've seen Jurassic Park, I'll leave you to be sorry, I know what I'm talking about."}, {"time": 7958, "text": "Ian Malcolm, Jurassic Park, Jeff Goldblum, right?"}, {"time": 7960, "text": "Life finds a way."}, {"time": 7963, "text": "But we were so concerned with whether or not we could, we didn't stop to think whether or not we should."}, {"time": 7969, "text": "Maybe?"}, {"time": 7970, "text": "I think there's, I mean, it's a deeply human thing, but it's also a really useful thing to always kind of assume that there's this giant thing that you don't understand."}, {"time": 7981, "text": "So you can forever be striving to understand because that process gives you meaning, but also keeps making you better."}, {"time": 7990, "text": "Like thinking that, actually even just thinking that you can't understand everything will lead you to stop too early."}, {"time": 8022, "text": "And back to one of our, I guess our other kind of tangents was that comes back to everyone's a human being."}, {"time": 8029, "text": "The smartest human being in the history of humanity is so hilariously weak, like short lived and not intelligent."}, {"time": 8037, "text": "Do it for yourself, bro."}, {"time": 8039, "text": "I didn't say, no, I'm not saying comparison to me."}, {"time": 8040, "text": "In comparison to me, everyone is awesome, but that's why I don't do the goat thing."}, {"time": 8044, "text": "But basically, it's just on a cosmic level."}, {"time": 8049, "text": "Can you imagine if you were a vampire, you're like 900 years old, like how much you would seem, you would seem like a lowercase G God to people."}, {"time": 8055, "text": "You'd be like, how could you know so much?"}, {"time": 8058, "text": "How can you have such a long view perspective?"}, {"time": 8061, "text": "So I mean, it seems like we're talking about AI now, right?"}, {"time": 8064, "text": "Where we're creating things that are infinitely smarter than us effectively and live all this time and it's probably gonna do what we tell it to do, right?"}, {"time": 8071, "text": "No, it's probably, well, I hope it keeps us around."}, {"time": 8074, "text": "Do you, by the way, think about AI and the existential threats?"}, {"time": 8078, "text": "Like speaking of gods, are you, is this whole technological world, we talked about social networks and this increasing power of technology around us, we ourselves are becoming less human because we keep relying on technology more and more."}, {"time": 8096, "text": "So we're becoming kinds of cyborgs, but also there's a future that's quite possible where the technology becomes smarter and more powerful than us humans and starts having a life of its own in ways that perhaps we don't imagine as human beings."}, {"time": 8116, "text": "I don't just mean like two legged robots walking around and being humans, but smarter."}, {"time": 8122, "text": "I mean like an intelligent life that's beyond and fundamentally different than our human life."}, {"time": 8134, "text": "It's infinite, it's a new kind of species, not even just a new species, we're talking about systems, but like it lives in the space of information."}, {"time": 8147, "text": "It lives in a different time scale and a different scale of all sorts, spatial scale."}, {"time": 8153, "text": "It operate, like we spoke about individuals, it doesn't operate in the sense of a single individual, like it's not embodied."}, {"time": 8162, "text": "So it's not like a thing that walks around and it like, it looks at stuff and it consumes the world."}, {"time": 8168, "text": "It's able to do much larger scale sensing of the environment around it, all that kind of stuff."}, {"time": 8174, "text": "I can barely even try to, I can barely even conceive of what that would be like."}, {"time": 8178, "text": "Are you scared or are you excited?"}, {"time": 8180, "text": "I don't define scared or excited."}, {"time": 8183, "text": "I feel like I tend to define them like the same way where I'm like, I guess I'm."}, {"time": 8189, "text": "Kind of like when before karaoke, it's the same."}, {"time": 8192, "text": "Well, that's actually kind of my happy place."}, {"time": 8193, "text": "It's not so much everyone else's."}, {"time": 8195, "text": "You know, it's a, everyone else is probably, you know, heading for the door at that point."}, {"time": 8199, "text": "But you know, it's a."}, {"time": 8200, "text": "While you're doing it or leading up to the karaoke session."}, {"time": 8203, "text": "Well, it depends whether or not they know it's me."}, {"time": 8206, "text": "If they know it's me, that's before I start."}, {"time": 8208, "text": "If they're like, who's that guy?"}, {"time": 8209, "text": "Then they're like halfway through the song, they're already throwing their beer."}, {"time": 8212, "text": "What categories of song or particular song are we talking about in terms of like your happy place?"}, {"time": 8217, "text": "Oh man, are you kidding me?"}, {"time": 8218, "text": "I mean, obviously, Bohemian Rhapsody."}, {"time": 8219, "text": "I mean, there's no question because, oh yeah, because I don't have to sing it here."}, {"time": 8222, "text": "It's that, it's like, remember, can I beat Khabib?"}, {"time": 8224, "text": "Is he here?"}, {"time": 8226, "text": "Yeah, then yeah, yeah."}, {"time": 8227, "text": "All right, if he's here, is he here?"}, {"time": 8228, "text": "No, then I, no."}, {"time": 8228, "text": "I have a torn, I have torn feelings about Bohemian Rhapsody because I like the beginning part, the sadness."}, {"time": 8233, "text": "I like the solo, the heartbreak."}, {"time": 8236, "text": "But the second part, I understand it, but it's so ridiculous."}, {"time": 8239, "text": "It gets ridiculous."}, {"time": 8241, "text": "It ruins it for me."}, {"time": 8241, "text": "But it's more about flexing on people."}, {"time": 8243, "text": "I think if you can actually hit that, hit that, you know, the falsetto."}, {"time": 8247, "text": "So it's, it's not, okay."}, {"time": 8250, "text": "So you appreciate not for the musical beauty and complexity of the song, you just like to flex on people."}, {"time": 8255, "text": "Cause like for all, yeah."}, {"time": 8256, "text": "Like what's the purpose of, of anything except for just to let everyone know that you think you're cool."}, {"time": 8263, "text": "And there's no better way of doing that than karaoke."}, {"time": 8265, "text": "So I'm not sure why I brought up karaoke."}, {"time": 8267, "text": "Captive audience."}, {"time": 8269, "text": "Oh, about fear and excitement of artificial intelligence."}, {"time": 8271, "text": "I mean, like, you know me, I don't know anything about, I just, basically I don't, I don't understand the implications of any of this."}, {"time": 8278, "text": "I would just say that like radically altering what it means to be human in such an unbelievably short period of time just seems like such a crazy thing."}, {"time": 8286, "text": "And also it's not like we're, I can't remember who said this to me recently."}, {"time": 8288, "text": "It might've been me."}, {"time": 8290, "text": "So this is definitely not my idea, but we're, we're not even going, Hey, would you like to opt in everyone?"}, {"time": 8297, "text": "Everyone is being opted in, you know?"}, {"time": 8300, "text": "And particularly when you want to talk about like large scale robotics or large scale AI, like the world is changing."}, {"time": 8305, "text": "People in Senegal are opting in right now without realizing it."}, {"time": 8308, "text": "It's not even like, and again, I don't mean to pick on Senegal."}, {"time": 8311, "text": "It's just whatever country comes up to mind, but that's in the developing world."}, {"time": 8313, "text": "But basically, you know, recognizing that this huge shift is coming, we have no idea if this is a decent idea."}, {"time": 8322, "text": "And also something else I've always been considered is, you know, you think about most of the really awful, awful, awful things that have done in history, large scale slavery, holly, you name it."}, {"time": 8334, "text": "It didn't, people say that it came from this motivation or that motivation."}, {"time": 8338, "text": "Maybe it did, maybe it didn't."}, {"time": 8339, "text": "Fundamentally, the issue, at least in my mind, I'm not a historian, power differential."}, {"time": 8345, "text": "If you and I can't contest, we don't contend."}, {"time": 8348, "text": "It's not like we fight and you might win or we fight, even you'll win comfortably."}, {"time": 8352, "text": "It's you are so unbelievably powerful compared to me that there's nothing I can do to stop you."}, {"time": 8358, "text": "That seems like a recipe for something really, really not great happening."}, {"time": 8362, "text": "Because if you think about like, you know, European countries encountering each other, and I'm just speculating, I don't know anything about history, let's say countries that can contend with one another versus countries that can't."}, {"time": 8374, "text": "Let's say an alien species, an alien race shows up, you know, right now, we don't want that."}, {"time": 8378, "text": "I think Stephen Hawking said that, and it makes perfect sense to me."}, {"time": 8381, "text": "If you can come here, we better hope you're nice."}, {"time": 8384, "text": "Because what are we gonna do?"}, {"time": 8386, "text": "What are we gonna hope that you invade the water planet like they did in, you know, what are the, Lord of the, yeah, War of the Worlds."}, {"time": 8391, "text": "So I guess what I'm trying to get across is like, shocking levels of power differential between groups that makes the world ripe for horrific abuse in the event that someone decides to do it."}, {"time": 8401, "text": "It's like, like you imagine an adult hitting a child, like hitting, hitting a child, no one in their right mind would ever go like, oh yeah, that's a great idea."}, {"time": 8408, "text": "Because it's such an, it's so grossly imbalanced."}, {"time": 8411, "text": "You're like, this is wrong."}, {"time": 8412, "text": "But it's also on the table only because of the gross imbalance."}, {"time": 8416, "text": "So I guess to come back, it's like, whether we create AI and it's on some crazy level of its own, or it's I'm in charge of it, or I just, it seems like we're creating, you mentioned like a game theory and nuclear war, what prevented nuclear war?"}, {"time": 8432, "text": "I mean, presumably mutually assured destruction."}, {"time": 8435, "text": "I mean, hopefully also humanity and the humanity and the reasonable, you know, cooler heads prevailing and going, hey, I can understand the veil of ignorance."}, {"time": 8443, "text": "And I don't go, oh yeah, let me kill those guys because I can't, I go, this is wrong, period."}, {"time": 8448, "text": "And in concept, this is not an action I should take, but it's also nice and easy to keep me honest if I know that I can't get you without being got myself."}, {"time": 8456, "text": "But what happens when I can get anyone anything and I'm more or less untouchable?"}, {"time": 8462, "text": "Like that seems to me to be like various times in colonial history, you know what I mean?"}, {"time": 8467, "text": "And what happened, we know what happened."}, {"time": 8469, "text": "But so the possibility of really bad things are plentiful, the possibilities."}, {"time": 8477, "text": "But the possibilities of really positive things are plentiful."}, {"time": 8481, "text": "Like what though?"}, {"time": 8482, "text": "I'm not saying wrong."}, {"time": 8483, "text": "I'm just telling you though."}, {"time": 8484, "text": "So I can give a million examples."}, {"time": 8485, "text": "One is just the examples of the parent and the child."}, {"time": 8490, "text": "You said there's a power differential there and we don't like a parent hitting their child."}, {"time": 8499, "text": "What about not just hitting, like beating?"}, {"time": 8501, "text": "Beating, yeah, great."}, {"time": 8503, "text": "Beating their child."}, {"time": 8504, "text": "How often percentage wise do you see that happening?"}, {"time": 8509, "text": "Even though that power differential, first of all, other people's kids, let's just put this on the table."}, {"time": 8516, "text": "I love kids, but other people's kids can be annoying sometimes."}, {"time": 8520, "text": "Sometimes you gotta deal out some justice, I get it."}, {"time": 8523, "text": "But we don't practice, we don't take advantage of that power differential."}, {"time": 8527, "text": "So like there is ethics, there's moralities that emerge that allow the power differential to be used for good versus for bad."}, {"time": 8536, "text": "So like one of the assumptions with Stephen Hawking or with if Russia became much more powerful than America or America much more powerful than Russia in the Cold War, your assumption that immediately that power differential, not your assumption, but it would express itself would express itself in the same way that it was trying to express itself when there was a more level competition."}, {"time": 8561, "text": "But it's also possible when the power differential grows, the incentive, the joy, whatever the mechanisms that made sense when it was at the same level, the incentives become very different."}, {"time": 8574, "text": "It's not as fun to destroy the ant colony."}, {"time": 8576, "text": "You start becoming more the kind of a conservationalist."}, {"time": 8581, "text": "One hopes, that's an evolved perspective though, yeah?"}, {"time": 8584, "text": "Well, I don't know if it's evolved or not, but it's definitely a possibility."}, {"time": 8587, "text": "It's unclear to me that something that's many orders of magnitude more powerful than us will want to destroy us."}, {"time": 8594, "text": "Well, I mean, how did mass slavery occur?"}, {"time": 8598, "text": "How did, you know, like just big dogs playing with not?"}, {"time": 8602, "text": "I think slavery and a lot of the atrocities in history happened when the power differential was not as great as we're talking about with AI potentially."}, {"time": 8615, "text": "Is that not somehow worse then?"}, {"time": 8618, "text": "It's not obvious to me."}, {"time": 8619, "text": "It's not obvious that things that are way more powerful."}, {"time": 8623, "text": "That's fair, okay."}, {"time": 8624, "text": "So I think you're."}, {"time": 8625, "text": "I guess, how do you restrain it though?"}, {"time": 8627, "text": "There's a lot of different discussions of how to."}, {"time": 8631, "text": "I guess even restrain each other."}, {"time": 8632, "text": "Cause let's say I go and decide to strike someone's child, which I'd like to think I wouldn't do."}, {"time": 8635, "text": "I will be promptly, I will find myself in front of a judge."}, {"time": 8639, "text": "And so I feel like there's a lot."}, {"time": 8641, "text": "Can you imagine how many people used to get murdered just in the woods?"}, {"time": 8645, "text": "I mean, I would just presume it's a lot, you know?"}, {"time": 8648, "text": "And I don't think most people are lunatics like that, but I would just say."}, {"time": 8651, "text": "But that's the point."}, {"time": 8652, "text": "Given though, if you're given to that, your ability to get away with it was greater in the past because of chance of detection was less."}, {"time": 8659, "text": "So that doesn't, I don't know."}, {"time": 8662, "text": "This is what that's called in artificial intelligence, AI safety research called value alignment of ensuring as you build the systems that become smarter and smarter and more powerful and powerful, make sure that their values are aligned with the entities over which they're becoming powerful with humans."}, {"time": 8680, "text": "So if you were to talk to an AI that's becoming smarter, at first it's dumber than you, but then it's becoming smarter and smarter."}, {"time": 8687, "text": "You have to create mechanisms where you both value the same things."}, {"time": 8692, "text": "I guess one thing I wonder, so I guess I'm probably not like sharp enough to grasp this if I'm honest, but I guess like, I wonder like, I used to do chess programs."}, {"time": 8702, "text": "You know, it was Deep Blue, Stockfish, and then like AlphaZero and AlphaZero teaching itself to beat Stockfish without any help in four hours."}, {"time": 8712, "text": "Like it becomes orders of magnitude more intelligence than us in effectively in instantaneous period."}, {"time": 8719, "text": "I guess what I always wondered, like if you were that much smarter than me, I feel like your ability to manipulate me would be pretty significant or at least potentially, no?"}, {"time": 8728, "text": "But manipulation implies that the incentive is to overpower everything around you."}, {"time": 8737, "text": "Like there's implied incentives."}, {"time": 8739, "text": "If your value is to actually, like, it depends what you want in life."}, {"time": 8748, "text": "What you want in your system."}, {"time": 8749, "text": "It's not clear that the goal of an AI system that's all powerful is to destroy all humans."}, {"time": 8755, "text": "No, I don't think that it is either."}, {"time": 8757, "text": "I guess what I'm... Or even enslave all humans."}, {"time": 8761, "text": "I guess what I'm trying to suggest is that something adequately powerful, these actions are on the table."}, {"time": 8766, "text": "Yes, they're on the table and that's scary."}, {"time": 8768, "text": "And that's why a lot of people are really concerned about it and are working on it."}, {"time": 8772, "text": "I'm just trying to make the case for AGI because if they're watching this, he's the one to kill."}, {"time": 8779, "text": "No, actually I was thinking, I was, yeah."}, {"time": 8783, "text": "I wash toilets like really well."}, {"time": 8788, "text": "No, I mean, that's the main concern for all the people in the AI state to research."}, {"time": 8792, "text": "People talk about AGI is, it's kind of disturbing how little people are working on trying to create mechanisms that keep AI's values aligned with ours."}, {"time": 8808, "text": "That's completely unshocking."}, {"time": 8810, "text": "Yeah, we humans seem to do only good when like, you know, you even look at like coronavirus."}, {"time": 8817, "text": "It's like when, like the water has to be leaking from the ceiling."}, {"time": 8823, "text": "You have to be, there has to be blood everywhere, fire, just destruction."}, {"time": 8828, "text": "We just seem to ignore completely any trouble."}, {"time": 8832, "text": "Writing all over the wall."}, {"time": 8835, "text": "This is fine."}, {"time": 8836, "text": "Yeah, I'm sure nothing to see here, we'll be okay."}, {"time": 8839, "text": "But we do all right, especially in the United States."}, {"time": 8841, "text": "You figure out even when it becomes a really serious problem, taking actions last minute, there's something about the innovative spirit that results in a solution last minute, right before the deadline."}, {"time": 8855, "text": "It works out."}, {"time": 8856, "text": "Well, I mean, I don't know how you did school, probably a lot better than me."}, {"time": 8858, "text": "No, that's exactly how I did school."}, {"time": 8860, "text": "I couldn't be more, I was no motivation up until like the last, if you're like, we have 22 hours to do the entire semesters of work."}, {"time": 8866, "text": "Like, let's do this."}, {"time": 8868, "text": "And you get like 19 fricking Mountain Dews and then, yeah."}, {"time": 8871, "text": "Well, that's why you and I are failures in life because I just talked to, I mentioned Cal Newport with his book, Deep Work and so on."}, {"time": 8880, "text": "He is of the variety of these creatures that basically does everything ahead of time."}, {"time": 8887, "text": "Because he dislikes the, he thinks it's unproductive to experience the stress and anxiety of the deadline because you're not going to be your best performance wise and you're not going to do the best work."}, {"time": 8903, "text": "So it doesn't make any, it's completely irrational to a function based on the deadline."}, {"time": 8909, "text": "You should have a system, a process that gets stuff, a little bit of stuff done every day."}, {"time": 8913, "text": "So like you should be, and constantly be systematically honest with yourself."}, {"time": 8918, "text": "If you say, I'm going to get this stuff done today and this week, at the end of the day, at the end of the week, you have to then reflect on what you did, what you planned and improve that plan, update it constantly, update every day, every week, every quarter, whatever those durations are."}, {"time": 8933, "text": "As I'm listening to this and reading his stuff, it's like, oh, yeah, I agree with everything."}, {"time": 8938, "text": "I'm like, yes, I'm clapping."}, {"time": 8940, "text": "But like the reality is, and then I go back and just eat Cheetos and like, don't do shit until like the last minute."}, {"time": 8945, "text": "It ain't meant to be cheesy."}, {"time": 8950, "text": "Actually, I don't eat Cheetos, but yes."}, {"time": 8951, "text": "But actually, again, not that it's ever going to matter because he's so shockingly productive and well thought out that whatever I've decided to think about trying to monkey wrench in there is definitely going to be able to deal with."}, {"time": 8962, "text": "But it's funny that again, because you're a human being, not a God, all of your strengths are you have a corresponding weakness."}, {"time": 8968, "text": "The less you practice working under the gun, the less comfortable you are working under the gun."}, {"time": 8972, "text": "The more practice you have working under the gun, the better you get at it."}, {"time": 8975, "text": "The downside is you're always working under the gun."}, {"time": 8976, "text": "So you're less productive or it's like your work quality maybe drops."}, {"time": 8980, "text": "So it's an interesting thing."}, {"time": 8981, "text": "It's like, it's almost like, hey, I wonder if this, I wonder if Khabib Nurmagomedov has a lot of heart and I try to say the answer is almost certainly yes, but you go, well, he hasn't struggled a bunch."}, {"time": 8989, "text": "Maybe he doesn't struggle well."}, {"time": 8991, "text": "And it just so happens that he can also work under the gun really well, he just doesn't like to do it."}, {"time": 8995, "text": "But yeah, but it's an interesting thing."}, {"time": 8996, "text": "It's like, I guess, what is it?"}, {"time": 8997, "text": "The Aristotle, we are what we repeatedly do."}, {"time": 8999, "text": "We are all, we're all practicing something all the time."}, {"time": 9002, "text": "So I guess it's, it's funny."}, {"time": 9004, "text": "I guess that's the question that I have though."}, {"time": 9005, "text": "I would love to ask him, it'd be really neat is in certain jobs."}, {"time": 9010, "text": "I mean, obviously you want to have preparation always, always, but certain things have like a degree of like entropy in the system and you go, I need to practice working under the gun."}, {"time": 9021, "text": "And I'm not saying that's what I need to do because the fighting, it should be for the most part, it's a really sterile environment."}, {"time": 9026, "text": "In the grand scheme of things, like fighting in a cage is very sterile compared to most other things in life, right?"}, {"time": 9030, "text": "But dangerous, but sterile."}, {"time": 9032, "text": "And unless of course, like, you know, like the other guy, the ref decides to hit you, which would be hilarious."}, {"time": 9038, "text": "But anyway, I guess just going like, okay, so at what value do you get out of adding a degree of, let's say you could even be planned by someone else, but junk in the system."}, {"time": 9049, "text": "And you just have to work under the gun to make it happen."}, {"time": 9052, "text": "Let's say for instance, for like police or something like that, the situation turns left hard at some random point in time."}, {"time": 9057, "text": "And that could happen to any number of people."}, {"time": 9060, "text": "So I guess it's interesting things that allow for perfect planning or quasi perfect planning versus things that are inherently unstable."}, {"time": 9066, "text": "And then what are the, what's the psychological fallout of comfort with that?"}, {"time": 9070, "text": "Because I think a lot of people that are really comfortable under the gun, let it happen a lot."}, {"time": 9075, "text": "For all the good and the bad of that, does that make sense?"}, {"time": 9077, "text": "No, that totally makes sense."}, {"time": 9078, "text": "And it was, I mean, his answer would be that you have to be honest with yourself if it's valuable for your success to practice being under the gun."}, {"time": 9089, "text": "And then you should schedule that."}, {"time": 9090, "text": "Yeah, then he's smart."}, {"time": 9091, "text": "You should plan that, you should systematically."}, {"time": 9094, "text": "And then as opposed to doing it half assedly, because it's, as opposed to letting the environment choose the randomness, like control the randomness to where like you optimize it."}, {"time": 9106, "text": "I wish it's so efficient, it's shocking just to hear about it."}, {"time": 9109, "text": "Yeah, no, he's, I mean, the same way you are, he's annoying in the same way, which is like he drops truth bombs."}, {"time": 9116, "text": "It's like, yeah, yeah, that's so true."}, {"time": 9119, "text": "Yeah, we're probably comparably doing that."}, {"time": 9122, "text": "No, he does."}, {"time": 9125, "text": "But he's, so he, his profession requires that."}, {"time": 9127, "text": "So he's not just like a motivational speaker or whatever."}, {"time": 9129, "text": "He's a theoretical computer scientist and he needs the long hours in the day of doing like serious math."}, {"time": 9139, "text": "So it's mostly math proofs."}, {"time": 9141, "text": "And for that, you have to sit and think really deeply."}, {"time": 9144, "text": "It's like really hard work."}, {"time": 9146, "text": "Compared to like what most people do, like even what I, I mean, what I do, like programming is way easier than rigorous math proofs."}, {"time": 9154, "text": "Cause you have to basically have this machine and you have to, your brain to churn out logic in a focused way while visualizing a bunch of things and holding that in your brain and holding that for 10 minutes, 20 minutes, hopefully several hours."}, {"time": 9172, "text": "And you're not just like doing homework."}, {"time": 9175, "text": "You're doing totally novel stuff."}, {"time": 9176, "text": "So like stuff that nobody's ever done before."}, {"time": 9179, "text": "So you keep running up against the wall of like, fuck, this is a den."}, {"time": 9182, "text": "And oh no, wait, is this a dead end?"}, {"time": 9185, "text": "And like that whole frustration, that's serious mental work."}, {"time": 9189, "text": "That's like incredibly difficult mental work."}, {"time": 9191, "text": "So he knows what he's talking about."}, {"time": 9194, "text": "But like you said, he's like, this seems like the standard for the quality of work that he needs is so high that almost anything less than this level of systematization and organization would preclude it."}, {"time": 9205, "text": "So he can't afford the kind of bullshit that I don't know about you, but that certainly I do, which is like last deadline kind of stuff."}, {"time": 9210, "text": "Cause you can't do that kind of work last minute on deadline kind of stuff."}, {"time": 9215, "text": "So my question for him in general is like, and for you and I is like, well, here's these negative patterns that we do of like doing shit last minute and so on."}, {"time": 9229, "text": "Is this just who we are now?"}, {"time": 9231, "text": "Or are there some?"}, {"time": 9232, "text": "I don't think I'm really big into a free will."}, {"time": 9234, "text": "You know, I was thinking that it's mostly predestination, at least in this regard."}, {"time": 9239, "text": "It's the same with like communism."}, {"time": 9240, "text": "Like, as long as it fits my, whatever is the lazy thing to do, I'll just not believe in free will."}, {"time": 9246, "text": "I'm not a communism opportunist or that's when that was."}, {"time": 9250, "text": "I'm an opportunistic communist and capitalist."}, {"time": 9255, "text": "I just do whatever, whatever is cool at the time."}, {"time": 9259, "text": "Let me ask you to examine some fundamental principles of a particular thing that Joe Rogan brought up to me several times online and offline."}, {"time": 9269, "text": "Which is that he thinks that the tie that I wear is something that makes me vulnerable to attack that you should be, the reason he doesn't wear a tie is because he can get choked very easily with a tie."}, {"time": 9287, "text": "It's a big concern."}, {"time": 9288, "text": "Okay, my contention, and by the way, he wore a suit last time too."}, {"time": 9294, "text": "He didn't wear it on the podcast."}, {"time": 9295, "text": "He wore it for dinner later."}, {"time": 9297, "text": "Yeah, I wore a suit the other day and I had no socks on."}, {"time": 9300, "text": "I didn't realize, yeah."}, {"time": 9301, "text": "You're supposed to wear socks?"}, {"time": 9302, "text": "Yeah, that's my understanding."}, {"time": 9303, "text": "Why'd you wear a suit?"}, {"time": 9304, "text": "Did you go to court?"}, {"time": 9305, "text": "No, no, not in that, no."}, {"time": 9307, "text": "Hey, I don't know, I just wanted to play."}, {"time": 9311, "text": "I wanted to pretend I was an adult for a day."}, {"time": 9314, "text": "So my contention is like the jacket, everything is more dangerous than a tie."}, {"time": 9322, "text": "That's kind of where I was going with that."}, {"time": 9324, "text": "That's kind of where, yeah, it was my first thought too."}, {"time": 9325, "text": "Like once the tie becomes an issue, like, yeah."}, {"time": 9328, "text": "I feel like everything else is already an issue."}, {"time": 9330, "text": "It's already an issue, yeah."}, {"time": 9331, "text": "Because the tie to me, now without like messing with it now, is to me has some of the similar problems that a belt does."}, {"time": 9340, "text": "So like, for example, I don't know about you, maybe you can correct me, but I'm not sure you can use the belt as tied."}, {"time": 9350, "text": "I know there's some kind of guards you can probably utilize the belt with, but the belt, sorry, when it's tied around the waist."}, {"time": 9358, "text": "Are you talking about a belt belt or a gi belt?"}, {"time": 9360, "text": "Sorry, gi belt."}, {"time": 9362, "text": "Gi belt, importantly, gi belt."}, {"time": 9364, "text": "It's not that great of a thing to use in most cases, I would say, because it slides."}, {"time": 9372, "text": "Yep, that's true."}, {"time": 9373, "text": "It doesn't, you can probably invent a few interesting ways to use it as leverage, as control and so on, but there's just so many more things around the gi belt that are better."}, {"time": 9386, "text": "And so for me, the tie, what people don't realize."}, {"time": 9389, "text": "Are we trying to sell a DVD here and have some widgets and bells and whistles?"}, {"time": 9392, "text": "Because in that case, the belt is really important part of what we do."}, {"time": 9395, "text": "And I would really encourage you guys to look into it."}, {"time": 9397, "text": "If we're trying to actually like learn something and say, like you said, we're surrounded by better options."}, {"time": 9402, "text": "Well, that's the thing."}, {"time": 9403, "text": "I mean, it's not obvious to me that the belt, maybe there's actually undiscovered things about using the belt."}, {"time": 9409, "text": "I think people have used like putting a foot inside the belt somehow, inside the gi belt."}, {"time": 9415, "text": "This is a no punches, gi grappling situation."}, {"time": 9419, "text": "Sort of fairly contrived, right?"}, {"time": 9420, "text": "But with punches too, like, is there, okay, let's talk about a street fights with a belt that's like a jeans belt, like a belt, clothing belt."}, {"time": 9426, "text": "Okay, so I get to take it off and whip them in the face with the buckle?"}, {"time": 9430, "text": "How serious is this street fight?"}, {"time": 9431, "text": "Are we talking like that far and open?"}, {"time": 9432, "text": "No, 100% serious."}, {"time": 9433, "text": "Or are we talking like, oh, okay."}, {"time": 9435, "text": "No, like death, like one of you has to die."}, {"time": 9437, "text": "Oh, yikes, whoa."}, {"time": 9439, "text": "Oh, you ever, like."}, {"time": 9440, "text": "I'm in this situation all the time."}, {"time": 9443, "text": "And there's a reason I'm still here."}, {"time": 9446, "text": "I had something, I had somebody try to fight me to Starbucks the other day."}, {"time": 9449, "text": "I fight kids, we're talking about power differential."}, {"time": 9450, "text": "Yeah, hey."}, {"time": 9451, "text": "I just beat up kids all the time."}, {"time": 9452, "text": "Just pick the easy W's, you gotta get the easy W's if you want the hard ones."}, {"time": 9455, "text": "I'm undefeated."}, {"time": 9456, "text": "Come around the playground, watch what happens."}, {"time": 9457, "text": "No, like to the death, what is their clothing that's useful, you know?"}, {"time": 9463, "text": "From my perspective."}, {"time": 9464, "text": "You mean like for your use or their use?"}, {"time": 9466, "text": "Both, my use, their use."}, {"time": 9468, "text": "No, like I like how you wanted to take the belt off and use the buckle to hit them with."}, {"time": 9474, "text": "But first of all, how are you gonna take off the belt?"}, {"time": 9476, "text": "Well, there's a lot of effort involved in unclothing."}, {"time": 9480, "text": "Well, what I was figuring was when they started to see me take my pants off in the fight, they were like, what?"}, {"time": 9484, "text": "They're gonna pause and rethink the situation for a second?"}, {"time": 9488, "text": "And I'm making dead eye contact, obviously, this is going on."}, {"time": 9490, "text": "Yeah, exactly, nodding."}, {"time": 9492, "text": "And then, you know, by the time they realized you took a belt off until you could whip them with it, you actually, you're already one, possibly two steps ahead."}, {"time": 9498, "text": "Okay, so fine, let's not talk about your own clothing, let's talk about their clothing."}, {"time": 9502, "text": "Okay, I'll take off their belt and hit them with it."}, {"time": 9503, "text": "No, but that's much harder to do."}, {"time": 9505, "text": "No question, but if you can do it."}, {"time": 9506, "text": "Oh, I'm maintaining, I can, no, I just said."}, {"time": 9509, "text": "Like, how did it come to this?"}, {"time": 9511, "text": "There's, but the point is there's alternatives that are perhaps more effective."}, {"time": 9517, "text": "In my perspective, this might be clueless, there's almost no clothing that's more effective than almost assuming the situation is no geek grappling."}, {"time": 9526, "text": "Like, I feel like clothing."}, {"time": 9529, "text": "Particularly when you start to add hitting, like every single time I start grabbing your clothes, if you start hitting and it's not like nothing could work, but most of the time you're like, why am I not using my arms for something better than what I'm doing them right now?"}, {"time": 9541, "text": "It's very difficult for me to, I don't know, in terms of just distance, I can't imagine a case of different distances, even like situations where, let's not talk about like, like a situation where you haven't both yet agreed that a fight is happening."}, {"time": 9558, "text": "Solid clothing is nice if they have it on then."}, {"time": 9561, "text": "Solid clothing?"}, {"time": 9562, "text": "Oh yeah, like something like a good jacket because you can snatch somebody on their face."}, {"time": 9565, "text": "Snatch down."}, {"time": 9566, "text": "Yeah, you know, it's like, if you, if you took my, like, you know, like you snap down and judo, like how easy it is to snap down a beginner."}, {"time": 9574, "text": "Actually a tie in that sense might be a really effective way to snap down."}, {"time": 9577, "text": "So like the snap down is really powerful to change the like disorient the situation and give you a lot of different opportunities for, you know, taking their back, taking them down."}, {"time": 9589, "text": "Doing hilarious stuff, like snapping them down with a tie into your knee."}, {"time": 9592, "text": "And then when they come back up doing this, you're already."}, {"time": 9595, "text": "So yeah, in that sense, I agree, but not as a choking mechanism because the concern Joe had is choke."}, {"time": 9600, "text": "I think you would probably choke me with your tie more easily than I could choke you with your tie."}, {"time": 9605, "text": "Cause like, if you get, you can get, like you get my back and you can put it around somebody's neck, you know, like, like, like, you ever see a diehard?"}, {"time": 9612, "text": "Yeah, you remember when the super Swedish looking blonde dude or whatever was, it was trying to choke Bruce Willis with the, with the chain and then he ended up getting choked himself with the chain if I recall this properly."}, {"time": 9622, "text": "But anyway, yeah, like, like that."}, {"time": 9623, "text": "But I don't, I don't feel like, I feel like if I start grabbing your tie, you have too many other great options."}, {"time": 9629, "text": "I mean, I do like the snap down that you actually made me realize."}, {"time": 9632, "text": "No, I think you have a good there."}, {"time": 9634, "text": "I think you're on the right path with it."}, {"time": 9635, "text": "With a snap down?"}, {"time": 9636, "text": "Yeah, particularly if you start with like one of these, like, you know, like, like you, like you poke your finger in my chest and then snap down real quick."}, {"time": 9643, "text": "And also, socially speaking, it's not a threatening thing to, you know, to reach for the tie."}, {"time": 9649, "text": "It's not particularly like a business setting."}, {"time": 9651, "text": "They'll never see it coming."}, {"time": 9653, "text": "Cause I was thinking choke, but it's not, it's a really good leverage point cause like grabbing a jacket, the jacket will slide if you try to snap down."}, {"time": 9660, "text": "You really have to get a hole, like a really good hold."}, {"time": 9664, "text": "Cause it's around the back of the neck."}, {"time": 9665, "text": "But what if it's a clip on?"}, {"time": 9665, "text": "How much of a jackass would you look like?"}, {"time": 9667, "text": "You feel like, and then they just stick you on."}, {"time": 9670, "text": "But you ever see the Japanese politician or I think it was Japan."}, {"time": 9673, "text": "The judo throw?"}, {"time": 9673, "text": "Yeah, it was, that guy is so, he was so calm and cool."}, {"time": 9676, "text": "Had like, it was every, it was beautiful technique."}, {"time": 9680, "text": "The level of, actually the throw was even gentle."}, {"time": 9683, "text": "But yeah, it was perfect."}, {"time": 9684, "text": "It was amazing."}, {"time": 9685, "text": "Well executed."}, {"time": 9687, "text": "More of our politicians just toss the shit out of each other."}, {"time": 9689, "text": "Yeah, we need more Teddy Roosevelts."}, {"time": 9692, "text": "I like our politicians like talking about fighting when it's clear that none of them even, it would ever have been in a fight ever."}, {"time": 9698, "text": "Somebody was saying Teddy Roosevelt was interesting."}, {"time": 9700, "text": "Is he's one of the greatest presidents this country's had."}, {"time": 9704, "text": "And he was one of the greatest presidents, even though he faced no crisis whatsoever."}, {"time": 9709, "text": "He literally willed himself."}, {"time": 9711, "text": "Like nothing happened during his presidency."}, {"time": 9713, "text": "He's just a bad motherfucker who made really great speeches."}, {"time": 9717, "text": "So he like, this made me realize, I was just talking to a historian that like, most of the people who we think are great need also a good crisis that they've, that reveal their greatness."}, {"time": 9729, "text": "But Muhammad Ali, right?"}, {"time": 9730, "text": "And there's Muhammad Ali, I mean, in sports."}, {"time": 9732, "text": "But you know what I mean?"}, {"time": 9733, "text": "Like the circumstances, what is greatness?"}, {"time": 9736, "text": "It's like, you have to, it's not just your capacity."}, {"time": 9738, "text": "It's what you face, right?"}, {"time": 9739, "text": "It's the quality of opposition, circumstance, what you overcome."}, {"time": 9742, "text": "So I guess what you're saying is Joe Rogan is wrong about the tie thing."}, {"time": 9746, "text": "You know, I don't want to go so far as saying he's wrong."}, {"time": 9748, "text": "I, you know, the man's not here to defend himself."}, {"time": 9750, "text": "Maybe he has some things that I'm not understanding."}, {"time": 9752, "text": "I'm willing to."}, {"time": 9753, "text": "No, he has not deeply thought this."}, {"time": 9754, "text": "This is my main criticism of Joe."}, {"time": 9755, "text": "He's not deeply thought to this."}, {"time": 9757, "text": "And the MMA journalists will be like, Ryan Hall says Joe Rogan is wrong."}, {"time": 9761, "text": "And hates ties."}, {"time": 9764, "text": "They'll integrate, hit their back in there somehow."}, {"time": 9767, "text": "Nice, nice."}, {"time": 9768, "text": "What's, you're talking about greatness and greatness requiring a difficult moment in time."}, {"time": 9776, "text": "Can you like reflect back and think what are some of the hardest, if not the hardest thing you've ever had to do in your life?"}, {"time": 9784, "text": "Well, you know, I think I've had a bunch of things."}, {"time": 9786, "text": "You know, I've had a lot of things not go my way."}, {"time": 9789, "text": "You know, I've been incredibly fortunate."}, {"time": 9790, "text": "I've had a lot of things go my way also."}, {"time": 9793, "text": "But leaving, leaving Team Lord Urban in 2008, which I firmly believe was the right thing to do, is one of the, that was very difficult at the time."}, {"time": 9805, "text": "Not like, not a difficult choice, but it was because of why I was leaving."}, {"time": 9810, "text": "Just psychologically."}, {"time": 9811, "text": "First of all, loss in general."}, {"time": 9813, "text": "Leaving."}, {"time": 9814, "text": "Team, family, all kinds."}, {"time": 9815, "text": "Doesn't matter what the circumstances."}, {"time": 9817, "text": "I didn't lose any friends, but I lost a lot of people I thought were my friends."}, {"time": 9820, "text": "And I, I lost training."}, {"time": 9822, "text": "I lost, I'd also had like a really serious, my wrist only does that."}, {"time": 9826, "text": "So like, I had a really serious wrist surgery, like that I didn't know if I was going to be able to compete anymore after that."}, {"time": 9833, "text": "I just got my brown belt."}, {"time": 9834, "text": "That was, it was a tough time, like psychologically, physically, everything."}, {"time": 9838, "text": "But I was very, very motivated to do my best and to push through it and to, it was to carry on in a positive direction, no matter what."}, {"time": 9845, "text": "A different direction."}, {"time": 9847, "text": "Were you lonely?"}, {"time": 9848, "text": "This is the thing about family, even if it's an abusive family, leaving is tough."}, {"time": 9853, "text": "People are complicated."}, {"time": 9854, "text": "And even people that I, that I don't think very well of, that I think on the whole, I don't think very well of, it's, it's unfair to paint them with one brush."}, {"time": 9864, "text": "You know, obviously there's greater and lesser examples of that, like the person we discussed last time, who's an infinitely, you know, beyond almost anyone that we could ever imagine meeting in our own personal lives."}, {"time": 9875, "text": "Bloody elbow."}, {"time": 9877, "text": "In terms of forgiveness and hate, I mean, do you, do you have hate in your heart for, for people in your past?"}, {"time": 9885, "text": "For that process?"}, {"time": 9887, "text": "I mean, there were definitely times where I've been negatively motivated to prove people wrong or to accomplish things in spite."}, {"time": 9892, "text": "And I think that some of that is valuable, if I be lying, if I felt differently."}, {"time": 9897, "text": "I think particularly, I do really well in conflict."}, {"time": 9901, "text": "I'm useless for that."}, {"time": 9902, "text": "This is the usual deadline thing."}, {"time": 9903, "text": "I'm useless, yeah."}, {"time": 9904, "text": "I'm useless."}, {"time": 9905, "text": "I like the chaos."}, {"time": 9906, "text": "I'm useless, yeah, I do."}, {"time": 9906, "text": "I'm useless without an antagonist."}, {"time": 9907, "text": "I like fighting."}, {"time": 9908, "text": "I like competition."}, {"time": 9910, "text": "I like being pushed."}, {"time": 9911, "text": "I like feeling like if I don't play well, I'm going to get hurt."}, {"time": 9914, "text": "I have no choice but to play well or play with everything I got at the very least."}, {"time": 9918, "text": "And I guess I would say though, is, you know, as I've gotten, you know, more time and, you know, lived a little bit longer, you see, you know, various situations for, you know, you know, with increased color, I guess I would say, increased clarity."}, {"time": 9936, "text": "And, you know, there are a lot of lessons to be learned, even from times in history or bad experience that we have."}, {"time": 9943, "text": "And the question is, can we take those lessons and move forward?"}, {"time": 9946, "text": "And that's, again, what I think we're seeing in sometimes socially right now, we're forgetting important lessons of the past."}, {"time": 9952, "text": "And that's not good."}, {"time": 9953, "text": "Not saying, hey, I don't get why we could be going in this direction or that, I understand entirely, but hey, let's not forget the lesson so we don't have to learn them again because that doesn't really serve anybody."}, {"time": 9965, "text": "And anyway, I guess I would say I'm thankful for all of the experiences, difficult and otherwise, mostly difficult, honestly, most of the times I remember, I'm thankful for every loss I've ever had, particularly the tough ones."}, {"time": 9975, "text": "I'm thankful for, you know, for all the relationships."}, {"time": 9978, "text": "I've been, many people have taught me many things."}, {"time": 9980, "text": "They continue to teach me many things, some of whom are still some of my closest friends, some of whom are people I really don't get along with at all."}, {"time": 9985, "text": "And some of whom are people I think really poorly of."}, {"time": 9989, "text": "Oh, there's not many of that last group."}, {"time": 9990, "text": "What I guess I would say is there's been a lot of things and opportunities to learn and, you know, throughout that."}, {"time": 9998, "text": "And also it's not as if I've never done, made any mistakes myself."}, {"time": 10000, "text": "Now, again, there are magnitude differences I like to think."}, {"time": 10004, "text": "And I can definitely say that none of the mistakes that I've ever made have been mistakes of intention."}, {"time": 10008, "text": "You know, I've screwed up a lot of things in my life, but I can confidently and easily say that I've never had ill intent towards people as I've done it."}, {"time": 10015, "text": "You sit there and you're like, man, this is the right thing, this is the right thing."}, {"time": 10017, "text": "And sometimes I've been wrong."}, {"time": 10019, "text": "But, you know, you never sit out with malicious intent."}, {"time": 10022, "text": "And I think that when I find that I think people do things differently, when I do think that there is malicious intent, I have a difficult time forgiving that."}, {"time": 10029, "text": "How does love win over hate, Ryan Hall, in this world?"}, {"time": 10034, "text": "We talk about social media, we talk about forgiveness of some of the more complicated people in your past."}, {"time": 10044, "text": "If we scale that to the entire world before the AI destroys us, and the human race is lost to history, how do you think love wins over hate?"}, {"time": 10055, "text": "Well, I'd like to preface this by saying I tried to make pancakes the other day."}, {"time": 10061, "text": "Didn't work."}, {"time": 10063, "text": "But I'm happy to comment on this."}, {"time": 10064, "text": "So basically, I think most of the times that I can think of that I've struggled, you know, and the times that I've read about is being unable to see the humanity in other people."}, {"time": 10081, "text": "And also, even in sometimes our enemies and the people that have done awful things, and you go, what would allow people to do this, that, or the other?"}, {"time": 10089, "text": "And that doesn't forgive what they've done, depending upon, you know, some things are forgivable, some things are less so."}, {"time": 10095, "text": "But you wanna understand why."}, {"time": 10096, "text": "It's like, to our knowledge, demons don't populate our world."}, {"time": 10099, "text": "Neither do like literal angels walking around being actually perfect."}, {"time": 10104, "text": "A lot of times, the things that it's, I find it deeply amusing watching, you know, people hoisted by their own batard on Twitter, even though it's gross and it's really unproductive."}, {"time": 10112, "text": "It's actually like equal parts amusing and like awful, because you're not happy that someone's being raked over the coals, particularly unjustifiably."}, {"time": 10120, "text": "But it is funny when it's the exact same thing they were raking others over the coals for, not like a week or two prior, and that's happened repeatedly and will continue to happen."}, {"time": 10128, "text": "And I guess I would say, as you mentioned, you know, a prior, you know, like a recognition of the humanity of others of that all of us make mistakes, that it's difficult to understand intention."}, {"time": 10138, "text": "I've had arguments with close friends of mine over text message where both of us ended up super pissed because we were completely misreading what the tone, the intention of what the other person was doing."}, {"time": 10148, "text": "And even if I was reading it correctly, which I wasn't, it's so easy to ascribe the most negative possible, you know, the least charitable assessment of what they're doing."}, {"time": 10159, "text": "And I think that that's such a dangerous way to live your life and it's also just a fruitless way to live your life."}, {"time": 10164, "text": "You know, it's one thing to go, hey, why did you do that?"}, {"time": 10167, "text": "Did you, what did you do?"}, {"time": 10168, "text": "You just, you did that to make yourself feel better, like you're damn right I did."}, {"time": 10171, "text": "And have I done that plenty of times in my life?"}, {"time": 10174, "text": "Yeah, I would lie if I said that I didn't, you know, why did you, why did you punch that guy in the face?"}, {"time": 10178, "text": "He was going crazy at me and hit me and I asked him to stop."}, {"time": 10180, "text": "And then I gave warning and I put him on his ass."}, {"time": 10183, "text": "I'm like, no, I'm not sorry."}, {"time": 10184, "text": "But then looking back now with years to sit on them, like, do I understand why I did what I did?"}, {"time": 10191, "text": "Would I like to respond differently now?"}, {"time": 10193, "text": "Yeah, I would."}, {"time": 10194, "text": "You know, and it doesn't mean that, I think plenty of things that people do are understandable."}, {"time": 10199, "text": "Doesn't mean, understandable doesn't mean correct."}, {"time": 10201, "text": "Understandable doesn't mean that you go, oh yeah, that's great."}, {"time": 10204, "text": "You go, I could see someone doing such a thing."}, {"time": 10207, "text": "But I guess just trying to understand and see the humanity in others."}, {"time": 10211, "text": "Cause if I can't see the humanity in others, how can I see it in myself?"}, {"time": 10214, "text": "And also, you know, how am I meant to interact with everyone?"}, {"time": 10217, "text": "As you said, whether, you know, even if we're a society of individuals for at least for the time being, hopefully, you know, in perpetuity, we still come together as a whole."}, {"time": 10226, "text": "And watching, it's weird."}, {"time": 10228, "text": "Like you said, if I only ask why once, I start with, stay out of my way and I'll stay out of yours."}, {"time": 10233, "text": "Leave me the fuck alone."}, {"time": 10234, "text": "You're like, okay, that's fine, Ryan."}, {"time": 10236, "text": "But that's easy for you to say, living in a society that doesn't actually function like that."}, {"time": 10240, "text": "So it's a little bit cheap."}, {"time": 10241, "text": "But if I recognize that that's step one is, I don't hurt you and you don't hurt me."}, {"time": 10245, "text": "But then we go, well, but how can I help you?"}]}]