[{"title": "Chris Lattner: The Future of Computing and Programming Languages | Lex Fridman Podcast #131", "id": "nWTvXbQHwWs", "quotes": [{"time": 269, "text": "Oh yeah, he definitely programs."}, {"time": 270, "text": "Jeff is an amazing engineer today, right?"}, {"time": 272, "text": "And that has never changed."}, {"time": 274, "text": "So it's really hard to compare Jeff to either of those two."}, {"time": 280, "text": "I think that Jeff leads through technology and building it himself and then pulling people in and inspiring them."}, {"time": 286, "text": "And so I think that that's one of the amazing things about Jeff."}, {"time": 290, "text": "But each of these people, with their pros and cons, all are really inspirational and have achieved amazing things."}, {"time": 296, "text": "So I've been very fortunate to get to work with these guys."}, {"time": 300, "text": "For yourself, you've led large teams, you've done so many incredible, difficult technical challenges."}, {"time": 308, "text": "Is there something you've picked up from them about how to lead?"}, {"time": 312, "text": "Yeah, so I mean, I think leadership is really hard."}, {"time": 314, "text": "It really depends on what you're looking for there."}, {"time": 317, "text": "I think you really need to know what you're talking about."}, {"time": 320, "text": "So being grounded on the product, on the technology, on the business, on the mission is really important."}, {"time": 328, "text": "Understanding what people are looking for, why they're there."}, {"time": 330, "text": "One of the most amazing things about Tesla is the unifying vision, right?"}, {"time": 334, "text": "People are there because they believe in clean energy and electrification, all these kinds of things."}, {"time": 339, "text": "The other is to understand what really motivates people, how to get the best people, how to build a plan that actually can be executed, right?"}, {"time": 346, "text": "There's so many different aspects of leadership and it really depends on the time, the place, the problems."}, {"time": 352, "text": "There's a lot of issues that don't need to be solved."}, {"time": 354, "text": "And so if you focus on the right things and prioritize well, that can really help move things."}, {"time": 359, "text": "Two interesting things you mentioned."}, {"time": 361, "text": "One is you really have to know what you're talking about."}, {"time": 363, "text": "How you've worked on your business, you've worked on a lot of very challenging technical things."}, {"time": 372, "text": "So I kind of assume you were born technically savvy, but assuming that's not the case, how did you develop technical expertise?"}, {"time": 384, "text": "Like even at Google you worked on, I don't know how many projects, but really challenging, very varied."}, {"time": 392, "text": "Compilers, TPUs, hardware, cloud stuff, bunch of different things."}, {"time": 396, "text": "The thing that I've become comfortable as I've more comfortable with as I've gained experience is being okay with not knowing."}, {"time": 405, "text": "And so a major part of leadership is actually, it's not about having the right answer, it's about getting the right answer."}, {"time": 412, "text": "And so if you're working in a team of amazing people, right?"}, {"time": 416, "text": "And many of these places, many of these companies all have amazing people."}, {"time": 420, "text": "It's the question of how do you get people together?"}, {"time": 422, "text": "How do you build trust?"}, {"time": 424, "text": "How do you get people to open up?"}, {"time": 425, "text": "How do you get people to be vulnerable sometimes with an idea that maybe isn't good enough, but it's the start of something beautiful?"}, {"time": 433, "text": "How do you provide an environment where you're not just like top down, thou shalt do the thing that I tell you to do, right?"}, {"time": 441, "text": "But you're encouraging people to be part of the solution and providing a safe space where if you're not doing the right thing, they're willing to tell you about it, right?"}, {"time": 449, "text": "So you're asking dumb questions?"}, {"time": 451, "text": "Yeah, dumb questions are my specialty, yeah."}, {"time": 453, "text": "Well, so I've been in the hardware realm recently and I don't know much at all about how chips are designed."}, {"time": 459, "text": "I know a lot about using them."}, {"time": 460, "text": "I know some of the principles and the art's technical level of this, but it turns out that if you ask a lot of dumb questions, you get smarter really, really quick."}, {"time": 468, "text": "And when you're surrounded by people that want to teach and learn themselves, it can be a beautiful thing."}, {"time": 476, "text": "So let's talk about programming languages, if it's okay."}, {"time": 479, "text": "At the highest absurd philosophical level, because I... Don't get romantic on me, Lex."}, {"time": 483, "text": "I will forever get romantic and torture you, I apologize."}, {"time": 489, "text": "Why do programming languages even matter?"}, {"time": 494, "text": "Okay, well, thank you very much."}, {"time": 495, "text": "You're saying why should you care about any one programming language or why do we care about programming computers or?"}, {"time": 500, "text": "No, why do we care about programming language design, creating effective programming languages, choosing one programming languages such as another programming language, why we keep struggling and improving through the evolution of these programming languages."}, {"time": 519, "text": "Sure, sure, sure."}, {"time": 520, "text": "Okay, so I mean, I think you have to come back to what are we trying to do here, right?"}, {"time": 523, "text": "So we have these beasts called computers that are very good at specific kinds of things and we think it's useful to have them do it for us, right?"}, {"time": 532, "text": "Now you have this question of how best to express that because you have a human brain still that has an idea in its head and you want to achieve something, right?"}, {"time": 540, "text": "So, well, there's lots of ways of doing this."}, {"time": 543, "text": "You can go directly to the machine and speak assembly language and then you can express directly what the computer understands, that's fine."}, {"time": 550, "text": "You can then have higher and higher and higher levels of abstraction up until machine learning and you're designing a neural net to do the work for you."}, {"time": 558, "text": "The question is where along this way do you want to stop and what benefits do you get out of doing so?"}, {"time": 563, "text": "And so programming languages in general, you have C, you have Fortran, Java and Ada, Pascal, Swift, you have lots of different things."}, {"time": 573, "text": "They'll have different trade offs and they're tackling different parts of the problems."}, {"time": 576, "text": "Now, one of the things that most programming languages do is they're trying to make it so that you have pretty basic things like portability across different hardware."}, {"time": 585, "text": "So you've got, I'm gonna run on an Intel PC, I'm gonna run on a RISC 5 PC, I'm gonna run on a ARM phone or something like that, fine."}, {"time": 593, "text": "I wanna write one program and have it portable."}, {"time": 595, "text": "And this is something that assembly doesn't do."}, {"time": 597, "text": "Now, when you start looking at the space of programming languages, this is where I think it's fun because programming languages all have trade offs and most people will walk up to them and they look at the surface level of syntax and say, oh, I like curly braces or I like tabs or I like semi colons or not or whatever, right?"}, {"time": 617, "text": "Subjective, fairly subjective, very shallow things."}, {"time": 621, "text": "But programming languages when done right can actually be very powerful."}, {"time": 624, "text": "And the benefit they bring is expression."}, {"time": 630, "text": "Okay, and if you look at programming languages, there's really kind of two different levels to them."}, {"time": 634, "text": "One is the down in the dirt, nuts and bolts of how do you get the computer to be efficient, stuff like that, how they work, type systems, compiler stuff, things like that."}, {"time": 643, "text": "The other is the UI."}, {"time": 645, "text": "And the UI for programming language is really a design problem and a lot of people don't think about it that way."}, {"time": 650, "text": "And the UI, you mean all that stuff with the braces and?"}, {"time": 653, "text": "Yeah, all that stuff's the UI and what it is and UI means user interface."}, {"time": 658, "text": "And so what's really going on is it's the interface between the guts and the human."}, {"time": 664, "text": "And humans are hard, right?"}, {"time": 665, "text": "Humans have feelings, they have things they like, they have things they don't like."}, {"time": 670, "text": "And a lot of people treat programming languages as though humans are just kind of abstract creatures that cannot be predicted."}, {"time": 677, "text": "But it turns out that actually there is better and worse."}, {"time": 681, "text": "Like people can tell when a programming language is good or when it was an accident, right?"}, {"time": 686, "text": "And one of the things with Swift in particular is that a tremendous amount of time by a tremendous number of people have been put into really polishing and making it feel good."}, {"time": 696, "text": "But it also has really good nuts and bolts underneath it."}, {"time": 699, "text": "You said that Swift makes a lot of people feel good."}, {"time": 702, "text": "How do you get to that point?"}, {"time": 705, "text": "So how do you predict that tens of thousands, hundreds of thousands of people are going to enjoy using this user experience of this programming language?"}, {"time": 717, "text": "Well, you can look at it in terms of better and worse, right?"}, {"time": 719, "text": "So if you have to write lots of boilerplate or something like that, you will feel unproductive."}, {"time": 723, "text": "And so that's a bad thing."}, {"time": 725, "text": "You can look at it in terms of safety."}, {"time": 726, "text": "If like C for example, is what's called a memory unsafe language."}, {"time": 730, "text": "And so you get dangling pointers and you get all these kinds of bugs that then you have spent tons of time debugging and it's a real pain in the butt and you feel unproductive."}, {"time": 737, "text": "And so by subtracting these things from the experience, you get happier people."}, {"time": 742, "text": "But again, keep interrupting."}, {"time": 745, "text": "I'm sorry, but so hard to deal with."}, {"time": 749, "text": "If you look at the people that are most productive on Stack Overflow, they have a set of priorities that may not always correlate perfectly with the experience of the majority of users."}, {"time": 763, "text": "If you look at the most upvoted, quote unquote, correct answer on Stack Overflow, it usually really sort of prioritizes like safe code, proper code, stable code, you know, that kind of stuff."}, {"time": 781, "text": "As opposed to like, if I wanna use go to statements in my basic, right?"}, {"time": 788, "text": "I wanna use go to statements."}, {"time": 789, "text": "Like what if 99% of people wanna use go to statements?"}, {"time": 792, "text": "So you use completely improper, you know, unsafe syntax."}, {"time": 796, "text": "I don't think that people actually, like if you boil it down and you get below the surface level, people don't actually care about go tos or if statements or things like this."}, {"time": 804, "text": "They care about achieving a goal, right?"}, {"time": 806, "text": "So the real question is I wanna set up a web server and I wanna do a thing, whatever."}, {"time": 812, "text": "Like how quickly can I achieve that, right?"}, {"time": 814, "text": "And so from a programming language perspective, there's really two things that matter there."}, {"time": 819, "text": "One is what libraries exist and then how quickly can you put it together and what are the tools around that look like, right?"}, {"time": 827, "text": "And when you wanna build a library that's missing, what do you do?"}, {"time": 830, "text": "Okay, now this is where you see huge divergence in the force between worlds, okay?"}, {"time": 835, "text": "And so you look at Python, for example."}, {"time": 837, "text": "Python is really good at assembling things, but it's not so great at building all the libraries."}, {"time": 842, "text": "And so what you get because of performance reasons, other things like this, is you get Python layered on top of C, for example, and that means that doing certain kinds of things well, it doesn't really make sense to do in Python."}, {"time": 853, "text": "Instead you do it in C and then you wrap it and then you have, you're living in two worlds and two worlds never is really great because tooling and the debugger doesn't work right and like all these kinds of things."}, {"time": 863, "text": "Can you clarify a little bit what you mean by Python is not good at building libraries, meaning it doesn't make it conducive."}, {"time": 870, "text": "Certain kinds of libraries."}, {"time": 871, "text": "No, but just the actual meaning of the sentence, meaning like it's not conducive to developers to come in and add libraries or is it the duality of the, it's a dance between Python and C and... Well, so Python's amazing."}, {"time": 889, "text": "Python's a great language."}, {"time": 890, "text": "I did not mean to say that Python is bad for libraries."}, {"time": 893, "text": "What I meant to say is there are libraries that Python's really good at that you can write in Python, but there are other things, like if you wanna build a machine learning framework, you're not gonna build a machine learning framework in Python because of performance, for example, or you want GPU acceleration or things like this."}, {"time": 910, "text": "Instead, what you do is you write a bunch of C or C++ code or something like that, and then you talk to it from Python, right?"}, {"time": 918, "text": "And so this is because of decisions that were made in the Python design and those decisions have other counterbalancing forces."}, {"time": 927, "text": "But the trick when you start looking at this from a programming language perspective, you start to say, okay, cool."}, {"time": 933, "text": "How do I build this catalog of libraries that are really powerful?"}, {"time": 937, "text": "And how do I make it so that then they can be assembled into ways that feel good and they generally work the first time?"}, {"time": 944, "text": "Because when you're talking about building a thing, you have to include the debugging, the fixing, the turnaround cycle, the development cycle, all that kind of stuff into the process of building the thing."}, {"time": 956, "text": "It's not just about pounding out the code."}, {"time": 958, "text": "And so this is where things like catching bugs at compile time is valuable, for example."}, {"time": 964, "text": "But if you dive into the details in this, Swift, for example, has certain things like value semantics, which is this fancy way of saying that when you treat a variable like a value, it acts like a mathematical object would."}, {"time": 981, "text": "Okay, so you have used PyTorch a little bit."}, {"time": 985, "text": "In PyTorch, you have tensors."}, {"time": 986, "text": "Tensors are n dimensional grid of numbers, very simple."}, {"time": 991, "text": "You can do plus and other operators on them."}, {"time": 994, "text": "It's all totally fine."}, {"time": 995, "text": "But why do you need to clone a tensor sometimes?"}, {"time": 999, "text": "Have you ever run into that?"}, {"time": 1001, "text": "Okay, and so why is that?"}, {"time": 1002, "text": "Why do you need to clone a tensor?"}, {"time": 1003, "text": "It's the usual object thing that's in Python."}, {"time": 1006, "text": "So in Python, and just like with Java and many other languages, this isn't unique to Python."}, {"time": 1011, "text": "In Python, it has a thing called reference semantics, which is the nerdy way of explaining this."}, {"time": 1015, "text": "And what that means is you actually have a pointer do a thing instead of the thing, okay?"}, {"time": 1021, "text": "Now, this is due to a bunch of implementation details that you don't want to go into."}, {"time": 1026, "text": "But in Swift, you have this thing called value semantics."}, {"time": 1029, "text": "And so when you have a tensor in Swift, it is a value."}, {"time": 1032, "text": "If you copy it, it looks like you have a unique copy."}, {"time": 1035, "text": "And if you go change one of those copies, then it doesn't update the other one because you just made a copy of this thing, right?"}, {"time": 1041, "text": "So that's like highly error prone in at least computer science, math centric disciplines about Python, that like the thing you would expect to behave like math."}, {"time": 1055, "text": "Like math, it doesn't behave like math."}, {"time": 1058, "text": "And in fact, quietly it doesn't behave like math and then can ruin the entirety of your math thing."}, {"time": 1064, "text": "Well, and then it puts you in debugging land again."}, {"time": 1066, "text": "Right now, you just want to get something done and you're like, wait a second, where do I need to put clone?"}, {"time": 1071, "text": "And what level of the stack, which is very complicated, which I thought I was reusing somebody's library and now I need to understand it to know where to clone a thing, right?"}, {"time": 1079, "text": "And hard to debug, by the way."}, {"time": 1082, "text": "And so this is where programming languages really matter."}, {"time": 1084, "text": "Right, and so in Swift having value semantics so that both you get the benefit of math, working like math, right?"}, {"time": 1092, "text": "But also the efficiency that comes with certain advantages there, certain implementation details there really benefit you as a programmer, right?"}, {"time": 1098, "text": "Can you clarify the value semantics?"}, {"time": 1100, "text": "Like how do you know that a thing should be treated like a value?"}, {"time": 1103, "text": "Yeah, so Swift has a pretty strong culture and good language support for defining values."}, {"time": 1110, "text": "And so if you have an array, so tensors are one example that the machine learning folks are very used to."}, {"time": 1116, "text": "Just think about arrays, same thing, where you have an array, you create an array, you put two or three or four things into it, and then you pass it off to another function."}, {"time": 1126, "text": "What happens if that function adds some more things to it?"}, {"time": 1131, "text": "Well, you'll see it on the side that you pass it in, right?"}, {"time": 1134, "text": "This is called reference semantics."}, {"time": 1136, "text": "Now, what if you pass an array off to a function, it scrolls it away in some dictionary or some other data structure somewhere, right?"}, {"time": 1144, "text": "Well, it thought that you just handed it that array, then you return back and that reference to that array still exists in the caller, and they go and put more stuff in it, right?"}, {"time": 1155, "text": "The person you handed it off to may have thought they had the only reference to that, and so they didn't know that this was gonna change underneath the covers."}, {"time": 1163, "text": "And so this is where you end up having to do clone."}, {"time": 1166, "text": "So like I was passed a thing, I'm not sure if I have the only version of it, so now I have to clone it."}, {"time": 1172, "text": "So what value semantics does is it allows you to say, hey, I have a, so in Swift, it defaults to value semantics."}, {"time": 1178, "text": "Oh, so it defaults to value semantics, and then because most things should end up being like values, then it makes sense for that to be the default."}, {"time": 1186, "text": "And one of the important things about that is that arrays and dictionaries and all these other collections that are aggregations of other things also have value semantics."}, {"time": 1193, "text": "And so when you pass this around to different parts of your program, you don't have to do these defensive copies."}, {"time": 1199, "text": "And so this is great for two sides, right?"}, {"time": 1201, "text": "It's great because you define away the bug, which is a big deal for productivity, the number one thing most people care about, but it's also good for performance because when you're doing a clone, so you pass the array down to the thing, it's like, I don't know if anybody else has it, I have to clone it."}, {"time": 1216, "text": "Well, you just did a copy of a bunch of data."}, {"time": 1218, "text": "It could be big."}, {"time": 1219, "text": "And then it could be that the thing that called you is not keeping track of the old thing."}, {"time": 1224, "text": "So you just made a copy of it, and you may not have had to."}, {"time": 1227, "text": "And so the way the value semantics work in Swift is it uses this thing called copy on write, which means that you get the benefit of safety and performance."}, {"time": 1236, "text": "And it has another special trick because if you think certain languages like Java, for example, they have immutable strings."}, {"time": 1243, "text": "And so what they're trying to do is they provide value semantics by having pure immutability."}, {"time": 1248, "text": "Functional languages have pure immutability in lots of different places, and this provides a much safer model and it provides value semantics."}, {"time": 1256, "text": "The problem with this is if you have immutability, everything is expensive."}, {"time": 1259, "text": "Everything requires a copy."}, {"time": 1262, "text": "For example, in Java, if you have a string X and a string Y, you append them together, we have to allocate a new string to hold X, Y."}, {"time": 1272, "text": "If they're immutable."}, {"time": 1273, "text": "Well, strings in Java are immutable."}, {"time": 1276, "text": "And if there's optimizations for short ones, it's complicated, but generally think about them as a separate allocation."}, {"time": 1284, "text": "And so when you append them together, you have to go allocate a third thing because somebody might have a pointer to either of the other ones, right?"}, {"time": 1291, "text": "And you can't go change them."}, {"time": 1292, "text": "So you have to go allocate a third thing."}, {"time": 1294, "text": "Because of the beauty of how the Swift value semantics system works out, if you have a string in Swift and you say, hey, put in X, right?"}, {"time": 1300, "text": "And they say, append on Y, Z, W, it knows that there's only one reference to that."}, {"time": 1307, "text": "And so it can do an in place update."}, {"time": 1310, "text": "And so you're not allocating tons of stuff on the side."}, {"time": 1313, "text": "You don't have all those problems."}, {"time": 1314, "text": "When you pass it off, you can know you have the only reference."}, {"time": 1317, "text": "If you pass it off to multiple different people, but nobody changes it, they can all share the same thing."}, {"time": 1322, "text": "So you get a lot of the benefit of purely immutable design."}, {"time": 1325, "text": "And so you get a really nice sweet spot that I haven't seen in other languages."}, {"time": 1329, "text": "Yeah, that's interesting."}, {"time": 1330, "text": "I thought there was going to be a philosophical narrative here that you're gonna have to pay a cost for it."}, {"time": 1339, "text": "Cause it sounds like, I think value semantics is beneficial for easing of debugging or minimizing the risk of errors, like bringing the errors closer to the source, bringing the symptom of the error closer to the source of the error, however you say that."}, {"time": 1360, "text": "But you're saying there's not a performance cost either if you implement it correctly."}, {"time": 1366, "text": "Well, so there's trade offs with everything."}, {"time": 1368, "text": "And so if you are doing very low level stuff, then sometimes you can notice a cost, but then what you're doing is you're saying, what is the right default?"}, {"time": 1376, "text": "So coming back to user interface, when you talk about programming languages, one of the major things that Swift does that makes people love it, that is not obvious when it comes to designing a language is this UI principle of progressive disclosure of complexity."}, {"time": 1392, "text": "Okay, so Swift, like many languages is very powerful."}, {"time": 1396, "text": "The question is, when do you have to learn the power as a user?"}, {"time": 1400, "text": "So Swift, like Python, allows you to start with like, print hello world, right?"}, {"time": 1404, "text": "Certain other languages start with like, public static void main class, like all the ceremony, right?"}, {"time": 1412, "text": "And so you go to teach a new person, hey, welcome to this new thing."}, {"time": 1416, "text": "Let's talk about public access control classes."}, {"time": 1420, "text": "Wait, what's that?"}, {"time": 1421, "text": "String system.out.println, like packages, like, God, right?"}, {"time": 1426, "text": "And so instead, if you take this and you say, hey, we need packages, modules, we need powerful things like classes, we need data structures, we need like all these things."}, {"time": 1437, "text": "The question is, how do you factor the complexity?"}, {"time": 1439, "text": "And how do you make it so that the normal case scenario is you're dealing with things that work the right way in the right way, give you good performance by default, but then as a power user, if you want to dive down to it, you have full C performance, full control over low level pointers."}, {"time": 1455, "text": "You can call malloc if you want to call malloc."}, {"time": 1458, "text": "This is not recommended on the first page of every tutorial, but it's actually really important when you want to get work done, right?"}, {"time": 1463, "text": "And so being able to have that is really the design in programming language design, and design is really, really hard."}, {"time": 1471, "text": "It's something that I think a lot of people kind of, outside of UI, again, a lot of people just think is subjective, like there's nothing, you know, it's just like curly braces or whatever."}, {"time": 1483, "text": "It's just like somebody's preference, but actually good design is something that you can feel."}, {"time": 1488, "text": "And how many people are involved with good design?"}, {"time": 1492, "text": "So if we looked at Swift, but look at historically, I mean, this might touch like, it's almost like a Steve Jobs question too, like how much dictatorial decision making is required versus collaborative, and we'll talk about how all that can go wrong or right, but."}, {"time": 1511, "text": "Yeah, well, Swift, so I can't speak to in general, all design everywhere."}, {"time": 1515, "text": "So the way it works with Swift is that there's a core team, and so a core team is six or seven people ish, something like that, that is people that have been working with Swift since very early days, and so."}, {"time": 1527, "text": "And by early days is not that long ago."}, {"time": 1530, "text": "Okay, yeah, so it became public in 2014, so it's been six years public now, but so that's enough time that there's a story arc there."}, {"time": 1538, "text": "Okay, yeah, and there's mistakes have been made that then get fixed, and you learn something, and then you, you know, and so what the core team does is it provides continuity, and so you wanna have a, okay, well, there's a big hole that we wanna fill."}, {"time": 1554, "text": "We know we wanna fill it, so don't do other things that invade that space until we fill the hole, right?"}, {"time": 1559, "text": "There's a boulder that's missing here, we wanna do, we will do that boulder, even though it's not today, keep out of that space."}, {"time": 1566, "text": "And the whole team remembers the myth of the boulder that's there."}, {"time": 1571, "text": "Yeah, yeah, there's a general sense of what the future looks like in broad strokes, and a shared understanding of that, combined with a shared understanding of what has happened in the past that worked out well and didn't work out well."}, {"time": 1582, "text": "The next level out is you have the, what's called the Swift evolution community, and you've got, in that case, hundreds of people that really care passionately about the way Swift evolves, and that's like an amazing thing to, again, the core team doesn't necessarily need to come up with all the good ideas."}, {"time": 1596, "text": "You got hundreds of people out there that care about something, and they come up with really good ideas too, and that provides this rock tumbler for ideas."}, {"time": 1605, "text": "And so the evolution process is, a lot of people in a discourse forum, they're like hashing it out and trying to talk about, okay, well, should we go left or right, or if we did this, what would be good?"}, {"time": 1640, "text": "So does that group represent like the, how much people will love the user interface?"}, {"time": 1647, "text": "Like, do you think they're able to capture that?"}, {"time": 1649, "text": "Well, I mean, it's something we talk about a lot, it's something we care about."}, {"time": 1652, "text": "How well we do that's up for debate, but I think that we've done pretty well so far."}, {"time": 1656, "text": "Is the beginner in mind?"}, {"time": 1658, "text": "Like, because you said the progressive disclosure complexity."}, {"time": 1660, "text": "Yeah, so we care a lot about that, a lot about power, a lot about efficiency, a lot about, there are many factors to good design, and you have to figure out a way to kind of work your way through that, and."}, {"time": 1673, "text": "So if you think about, like the language I love is Lisp, probably still because I use Emacs, but I haven't done anything, any serious work in Lisp, but it has a ridiculous amount of parentheses."}, {"time": 1686, "text": "I've also, you know, with Java and C++, the braces, you know, I like, I enjoyed the comfort of being between braces, you know?"}, {"time": 1700, "text": "Yeah, yeah, well, let's talk."}, {"time": 1701, "text": "And then Python is, sorry to interrupt, just like, and last thing to me, as a designer, if I was a language designer, God forbid, is I would be very surprised that Python with no braces would nevertheless somehow be comforting also."}, {"time": 1718, "text": "So like, I could see arguments for all of this."}, {"time": 1720, "text": "But look at this, this is evidence that it's not about braces versus tabs."}, {"time": 1724, "text": "Right, exactly, you're good, that's a good point."}, {"time": 1727, "text": "Right, so like, you know, there's evidence that."}, {"time": 1730, "text": "But see, like, it's one of the most argued about things."}, {"time": 1732, "text": "Oh yeah, of course, just like tabs and spaces, which it doesn't, I mean, there's one obvious right answer, but it doesn't actually matter."}, {"time": 1739, "text": "Let's not, like, come on, we're friends."}, {"time": 1741, "text": "Like, come on, what are you trying to do to me here?"}, {"time": 1743, "text": "People are gonna, yeah, half the people are gonna tune out."}, {"time": 1745, "text": "Yeah, so these, so you're able to identify things that don't really matter for the experience."}, {"time": 1752, "text": "Well, no, no, no, it's always a really hard, so the easy decisions are easy, right?"}, {"time": 1756, "text": "I mean, fine, those are not the interesting ones."}, {"time": 1759, "text": "The hard ones are the ones that are most interesting, right?"}, {"time": 1761, "text": "The hard ones are the places where, hey, we wanna do a thing, everybody agrees we should do it, there's one proposal on the table, but it has all these bad things associated with it."}, {"time": 1771, "text": "Well, okay, what are we gonna do about that?"}, {"time": 1773, "text": "Do we just take it?"}, {"time": 1774, "text": "Do we delay it?"}, {"time": 1776, "text": "Do we say, hey, well, maybe there's this other feature that if we do that first, this will work out better."}, {"time": 1781, "text": "How does this, if we do this, are we paying ourselves into a corner, right?"}, {"time": 1786, "text": "And so this is where, again, you're having that core team of people that has some continuity and has perspective, has some of the historical understanding, is really valuable because you get, it's not just like one brain, you get the power of multiple people coming together to make good decisions, and then you get the best out of all these people, and you also can harness the community around it."}, {"time": 1806, "text": "And what about the decision of whether in Python having one type or having strict typing?"}, {"time": 1815, "text": "Yeah, let's talk about this."}, {"time": 1816, "text": "So I like how you put that, by the way."}, {"time": 1819, "text": "So many people would say that Python doesn't have types."}, {"time": 1821, "text": "Doesn't have types, yeah."}, {"time": 1823, "text": "I haven't listened to you enough to where, I'm a fan of yours and I've listened to way too many podcasts and videos of you talking about this stuff."}, {"time": 1832, "text": "Oh yeah, so I would argue that Python has one type."}, {"time": 1834, "text": "And so like when you import Python into Swift, which by the way works really well, you have everything comes in as a Python object."}, {"time": 1841, "text": "Now here are their trade offs because it depends on what you're optimizing for."}, {"time": 1847, "text": "And Python is a super successful language for a really good reason."}, {"time": 1851, "text": "Because it has one type, you get duck typing for free and things like this."}, {"time": 1855, "text": "But also you're pushing, you're making it very easy to pound out code on one hand, but you're also making it very easy to introduce complicated bugs that you have to debug."}, {"time": 1865, "text": "And you pass a string into something that expects an integer and it doesn't immediately die."}, {"time": 1870, "text": "It goes all the way down the stack trace and you find yourself in the middle of some code that you really didn't want to know anything about."}, {"time": 1874, "text": "And it blows up and you're just saying, well, what did I do wrong, right?"}, {"time": 1878, "text": "And so types are good and bad and they have trade offs."}, {"time": 1881, "text": "They're good for performance and certain other things depending on where you're coming from, but it's all about trade offs."}, {"time": 1886, "text": "And so this is what design is, right?"}, {"time": 1888, "text": "Design is about weighing trade offs and trying to understand the ramifications of the things that you're weighing, like types or not, or one type or many types."}, {"time": 1898, "text": "But also within many types, how powerful do you make that type system is another very complicated question with lots of trade offs."}, {"time": 1905, "text": "It's very interesting by the way, but that's like one dimension and there's a bunch of other dimensions, JIT compiled versus static compiled, garbage collected versus reference counted versus manual memory management versus, like in like all these different trade offs and how you balance them are what make a program language good."}, {"time": 1925, "text": "Concurrency."}, {"time": 1927, "text": "So in all those things, I guess, when you're designing the language, you also have to think of how that's gonna get all compiled down to."}, {"time": 1935, "text": "If you care about performance, yeah."}, {"time": 1937, "text": "Well, and go back to Lisp, right?"}, {"time": 1938, "text": "So Lisp also, I would say JavaScript is another example of a very simple language, right?"}, {"time": 1944, "text": "And so one of the, so I also love Lisp."}, {"time": 1947, "text": "I don't use it as much as maybe you do or you did."}, {"time": 1949, "text": "No, I think we're both, everyone who loves Lisp, it's like, you love, it's like, I don't know, I love Frank Sinatra, but like how often do I seriously listen to Frank Sinatra?"}, {"time": 1960, "text": "But you look at that or you look at JavaScript, which is another very different, but relatively simple language."}, {"time": 1965, "text": "And there are certain things that don't exist in the language, but there is inherent complexity to the problems that we're trying to model."}, {"time": 1973, "text": "And so what happens to the complexity?"}, {"time": 1974, "text": "In the case of both of them, for example, you say, well, what about large scale software development?"}, {"time": 1980, "text": "Okay, well, you need something like packages."}, {"time": 1982, "text": "Neither language has a language affordance for packages."}, {"time": 1985, "text": "And so what you get is patterns."}, {"time": 1987, "text": "You get things like NPN."}, {"time": 1988, "text": "You get things like these ecosystems that get built around."}, {"time": 1992, "text": "And I'm a believer that if you don't model at least the most important inherent complexity in the language, then what ends up happening is that complexity gets pushed elsewhere."}, {"time": 2002, "text": "And when it gets pushed elsewhere, sometimes that's great because often building things as libraries is very flexible and very powerful and allows you to evolve and things like that."}, {"time": 2010, "text": "But often it leads to a lot of unnecessary divergence in the force and fragmentation."}, {"time": 2015, "text": "And when that happens, you just get kind of a mess."}, {"time": 2019, "text": "And so the question is, how do you balance that?"}, {"time": 2022, "text": "Don't put too much stuff in the language because that's really expensive and it makes things complicated."}, {"time": 2026, "text": "But how do you model enough of the inherent complexity of the problem that you provide the framework and the structure for people to think about?"}, {"time": 2034, "text": "Well, so the key thing to think about with programming languages, and you think about what a programming language is therefore, is it's about making a human more productive, right?"}, {"time": 2044, "text": "And so there's an old, I think it's Steve Jobs quote about it's a bicycle for the mind, right?"}, {"time": 2050, "text": "You can definitely walk, but you'll get there a lot faster if you can bicycle on your way."}, {"time": 2057, "text": "And... A programming language is a bicycle for the mind?"}, {"time": 2060, "text": "Is it basically, wow, that's really interesting way to think about it."}, {"time": 2063, "text": "By raising the level of abstraction, now you can fit more things in your head."}, {"time": 2067, "text": "By being able to just directly leverage somebody's library, you can now get something done quickly."}, {"time": 2073, "text": "In the case of Swift, Swift UI is this new framework that Apple has released recently for doing UI programming."}, {"time": 2079, "text": "And it has this declarative programming model, which defines away entire classes of bugs."}, {"time": 2085, "text": "It builds on value semantics and many other nice Swift things."}, {"time": 2088, "text": "And what this does is it allows you to just get way more done with way less code."}, {"time": 2093, "text": "And now your productivity as a developer is much higher, right?"}, {"time": 2097, "text": "And so that's really what programming languages should be about, is it's not about tabs versus spaces or curly braces or whatever."}, {"time": 2103, "text": "It's about how productive do you make the person."}, {"time": 2105, "text": "And you can only see that when you have libraries that were built with the right intention that the language was designed for."}, {"time": 2113, "text": "And with Swift, I think we're still a little bit early, but Swift UI and many other things that are coming out now are really showing that."}, {"time": 2120, "text": "And I think that they're opening people's eyes."}, {"time": 2122, "text": "It's kind of interesting to think about like how that the knowledge of something, of how good the bicycle is, how people learn about that."}, {"time": 2133, "text": "So I've used C++, now this is not going to be a trash talking session about C++, but I used C++ for a really long time."}, {"time": 2141, "text": "You can go there if you want, I have the scars."}, {"time": 2145, "text": "I feel like I spent many years without realizing like there's languages that could, for my particular lifestyle, brain style, thinking style, there's languages that could make me a lot more productive in the debugging stage, in just the development stage and thinking like the bicycle for the mind that I can fit more stuff into my... Python's a great example of that, right?"}, {"time": 2169, "text": "I mean, a machine learning framework in Python is a great example of that."}, {"time": 2172, "text": "It's just very high abstraction level."}, {"time": 2174, "text": "And so you can be thinking about things on a like very high level algorithmic level instead of thinking about, okay, well, am I copying this tensor to a GPU or not, right?"}, {"time": 2183, "text": "It's not what you want to be thinking about."}, {"time": 2185, "text": "And as I was telling you, I mean, I guess the question I had is, how does a person like me or in general people discover more productive languages?"}, {"time": 2196, "text": "Like how I was, as I've been telling you offline, I've been looking for like a project to work on in Swift so I can really try it out."}, {"time": 2205, "text": "I mean, my intuition was like doing a hello world is not going to get me there to get me to experience the power of language."}, {"time": 2214, "text": "You need a few weeks to change your metabolism."}, {"time": 2215, "text": "Exactly, beautifully put."}, {"time": 2219, "text": "That's one of the problems with people with diets, like I'm actually currently, to go in parallel, but in a small tangent is I've been recently eating only meat, okay?"}, {"time": 2230, "text": "And okay, so most people are like, they think that's horribly unhealthy or whatever, you have like a million, whatever the science is, it just doesn't sound right."}, {"time": 2242, "text": "Well, so back when I was in college, we did the Atkins diet, that was a thing."}, {"time": 2246, "text": "Similar, but you have to always give these things a chance."}, {"time": 2250, "text": "I mean, with dieting, I was not dieting, but it's just the things that you like."}, {"time": 2255, "text": "If I eat, personally, if I eat meat, just everything, I can be super focused or more focused than usual."}, {"time": 2262, "text": "I just feel great."}, {"time": 2263, "text": "I mean, I've been running a lot, doing pushups and pull ups and so on."}, {"time": 2267, "text": "I mean, Python is similar in that sense for me."}, {"time": 2270, "text": "Where are you going with this?"}, {"time": 2273, "text": "I mean, literally, I just felt I had like a stupid smile on my face when I first started using Python."}, {"time": 2280, "text": "I could code up really quick things."}, {"time": 2282, "text": "Like I would see the world, I would be empowered to write a script to do some basic data processing, to rename files on my computer."}, {"time": 2294, "text": "Like Perl didn't do that for me, a little bit."}, {"time": 2299, "text": "And again, none of these are about which is best or something like that, but there's definitely better and worse here."}, {"time": 2305, "text": "But it clicks, right?"}, {"time": 2307, "text": "If you look at Perl, for example, you get bogged down in scalars versus arrays versus hashes versus type globs and like all that kind of stuff."}, {"time": 2315, "text": "And Python's like, yeah, let's not do this."}, {"time": 2318, "text": "And some of it is debugging."}, {"time": 2319, "text": "Like everyone has different priorities."}, {"time": 2321, "text": "But for me, it's, can I create systems for myself that empower me to debug quickly?"}, {"time": 2327, "text": "Like I've always been a big fan, even just crude like asserts, like always stating things that should be true, which in Python, I found in myself doing more because of type, all these kinds of stuff."}, {"time": 2342, "text": "Well, you could think of types in a programming language as being kind of assert."}, {"time": 2346, "text": "They could check the compile time, right?"}, {"time": 2348, "text": "So how do you learn a new thing?"}, {"time": 2350, "text": "Well, so this, or how do people learn new things, right?"}, {"time": 2355, "text": "People don't like to change."}, {"time": 2357, "text": "People generally don't like change around them either."}, {"time": 2359, "text": "And so we're all very slow to adapt and change."}, {"time": 2362, "text": "And usually there's a catalyst that's required to force yourself over this."}, {"time": 2367, "text": "So for learning a programming language, it really comes down to finding an excuse, like build a thing that the language is actually good for, that the ecosystem's ready for."}, {"time": 2378, "text": "And so if you were to write an iOS app, for example, that'd be the easy case."}, {"time": 2384, "text": "Obviously you would use Swift for that, right?"}, {"time": 2386, "text": "There are other... Android."}, {"time": 2388, "text": "So Swift runs on Android."}, {"time": 2390, "text": "Oh, does it?"}, {"time": 2392, "text": "Yeah, Swift runs in lots of places."}, {"time": 2395, "text": "Okay, so Swift is built on top of LLVM."}, {"time": 2398, "text": "LLVM runs everywhere."}, {"time": 2400, "text": "LLVM, for example, builds the Android kernel."}, {"time": 2405, "text": "I didn't realize this."}, {"time": 2406, "text": "Yeah, so Swift is very portable, runs on Windows."}, {"time": 2409, "text": "There's, it runs on lots of different things."}, {"time": 2412, "text": "And Swift, sorry to interrupt, Swift UI, and then there's a thing called UI Kit."}, {"time": 2417, "text": "So can I build an app with Swift?"}, {"time": 2421, "text": "Well, so that's the thing, is the ecosystem is what matters there."}, {"time": 2423, "text": "So Swift UI and UI Kit are Apple technologies."}, {"time": 2427, "text": "And so they happen to, like Swift UI happens to be written in Swift, but it's an Apple proprietary framework that Apple loves and wants to keep on its platform, which makes total sense."}, {"time": 2436, "text": "You go to Android and you don't have that library, right?"}, {"time": 2439, "text": "And so Android has a different ecosystem of things that hasn't been built out and doesn't work as well with Swift."}, {"time": 2445, "text": "And so you can totally use Swift to do like arithmetic and things like this, but building UI with Swift on Android is not a great experience right now."}, {"time": 2454, "text": "So if I wanted to learn Swift, what's the, I mean, the one practical different version of that is Swift for TensorFlow, for example."}, {"time": 2465, "text": "And one of the inspiring things for me with both TensorFlow and PyTorch is how quickly the community can like switch from different libraries, like you could see some of the communities switching to PyTorch now, but it's very easy to see."}, {"time": 2481, "text": "And then TensorFlow is really stepping up its game."}, {"time": 2484, "text": "And then there's no reason why, I think the way it works is basically it has to be one GitHub repo, like one paper steps up."}, {"time": 2491, "text": "It gets people excited."}, {"time": 2492, "text": "It gets people excited and they're like, ah, I have to learn this Swift for, what's Swift again?"}, {"time": 2499, "text": "And then they learn and they fall in love with it."}, {"time": 2501, "text": "I mean, that's what happened, PyTorch has it."}, {"time": 2503, "text": "There has to be a reason, a catalyst."}, {"time": 2505, "text": "And so, and there, I mean, people don't like change, but it turns out that once you've worked with one or two programming languages, the basics are pretty similar."}, {"time": 2514, "text": "And so one of the fun things about learning programming languages, even maybe Lisp, I don't know if you agree with this, is that when you start doing that, you start learning new things."}, {"time": 2524, "text": "Cause you have a new way to do things and you're forced to do them."}, {"time": 2526, "text": "And that forces you to explore and it puts you in learning mode."}, {"time": 2530, "text": "And when you get in learning mode, your mind kind of opens a little bit and you can see things in a new way, even when you go back to the old place."}, {"time": 2537, "text": "Yeah, it's totally, well Lisp is functional."}, {"time": 2541, "text": "But yeah, I wish there was a kind of window, maybe you can tell me if there is, there you go."}, {"time": 2546, "text": "This is a question to ask, what is the most beautiful feature in a programming language?"}, {"time": 2550, "text": "Before I ask it, let me say like with Python, I remember I saw Lisp comprehensions."}, {"time": 2557, "text": "Was like, when I like really took it in."}, {"time": 2561, "text": "I don't know, I just loved it."}, {"time": 2563, "text": "It was like fun to do, like it was fun to do that kind of, something about it to be able to filter through a list and to create a new list all in a single line was elegant."}, {"time": 2576, "text": "I could all get into my head and it just made me fall in love with the language."}, {"time": 2582, "text": "So is there, let me ask you a question."}, {"time": 2584, "text": "Is there, what do you use the most beautiful feature in a programming languages that you've ever encountered in Swift maybe and then outside of Swift?"}, {"time": 2595, "text": "I think the thing that I like the most from a programming language."}, {"time": 2598, "text": "So I think the thing you have to think about with the programming language, again, what is the goal?"}, {"time": 2603, "text": "You're trying to get people to get things done quickly."}, {"time": 2607, "text": "And so you need libraries, you need high quality libraries and then you need a user base around them that can assemble them and do cool things with them, right?"}, {"time": 2615, "text": "And so to me, the question is what enables high quality libraries?"}, {"time": 2621, "text": "And there's a huge divide in the world between libraries who enable high quality libraries versus the ones that put special stuff in the language."}, {"time": 2632, "text": "So programming languages that enable high quality libraries?"}, {"time": 2637, "text": "So, and what I mean by that is expressive libraries that then feel like a natural integrated part of the language itself."}, {"time": 2645, "text": "So an example of this in Swift is that int and float and also array and string, things like this, these are all part of the library."}, {"time": 2653, "text": "Like int is not hard coded into Swift."}, {"time": 2657, "text": "And so what that means is that because int is just a library thing defined in the standard library, along with strings and arrays and all the other things that come with the standard library."}, {"time": 2667, "text": "Well, hopefully you do like int, but anything that any language features that you needed to define int, you can also use in your own types."}, {"time": 2676, "text": "So if you wanted to find a quaternion or something like this, right?"}, {"time": 2681, "text": "Well, it doesn't come in the standard library."}, {"time": 2683, "text": "There's a very special set of people that care a lot about this, but those people are also important."}, {"time": 2689, "text": "It's not about classism, right?"}, {"time": 2691, "text": "It's not about the people who care about ints and floats are more important than the people who care about quaternions."}, {"time": 2695, "text": "And so to me, the beautiful things about programming languages is when you allow those communities to build high quality libraries, they feel native."}, {"time": 2703, "text": "They feel like they're built into the compiler without having to be."}, {"time": 2708, "text": "What does it mean for the int to be part of not hard coded in?"}, {"time": 2713, "text": "So is it like how, so what is an int?"}, {"time": 2718, "text": "Okay, int is just a integer."}, {"time": 2720, "text": "In this case, it's like a 64 bit integer or something like this."}, {"time": 2724, "text": "But so like the 64 bit is hard coded or no?"}, {"time": 2728, "text": "No, none of that's hard coded."}, {"time": 2729, "text": "So int, if you go look at how it's implemented, it's just a struct in Swift."}, {"time": 2734, "text": "And so it's a struct."}, {"time": 2735, "text": "And then how do you add two structs?"}, {"time": 2737, "text": "Well, you define plus."}, {"time": 2739, "text": "And so you can define plus on int."}, {"time": 2741, "text": "Well, you can define plus on your thing too."}, {"time": 2743, "text": "You can define, int is an odd method or something like that on it."}, {"time": 2747, "text": "And so yeah, you can add methods on the things."}, {"time": 2751, "text": "So you can define operators, like how it behaves."}, {"time": 2755, "text": "That's just beautiful when there's something about the language which enables others to create libraries which are not hacky."}, {"time": 2765, "text": "Yeah, they feel native."}, {"time": 2767, "text": "And so one of the best examples of this is Lisp, right?"}, {"time": 2770, "text": "Because in Lisp, like all the libraries are basically part of the language, right?"}, {"time": 2775, "text": "You write, turn, rewrite systems and things like this."}, {"time": 2778, "text": "Can you as a counter example provide what makes it difficult to write a library that's native?"}, {"time": 2783, "text": "Is it the Python C?"}, {"time": 2785, "text": "Well, so one example, I'll give you two examples."}, {"time": 2789, "text": "Java and C++, there's Java and C. They both allow you to define your own types, but int is hard code in the language."}, {"time": 2798, "text": "Okay, well, why?"}, {"time": 2799, "text": "Well, in Java, for example, coming back to this whole reference semantic value semantic thing, int gets passed around by value."}, {"time": 2809, "text": "But if you make like a pair or something like that, a complex number, right, it's a class in Java."}, {"time": 2816, "text": "And now it gets passed around by reference, by pointer."}, {"time": 2819, "text": "And so now you lose value semantics, right?"}, {"time": 2822, "text": "You lost math, okay."}, {"time": 2824, "text": "Well, that's not great, right?"}, {"time": 2826, "text": "If you can do something with int, why can't I do it with my type, right?"}, {"time": 2830, "text": "So that's the negative side of the thing I find beautiful is when you can solve that, when you can have full expressivity, where you as a user of the language have as much or almost as much power as the people who implemented all the standard built in stuff, because what that enables is that enables truly beautiful libraries."}, {"time": 2851, "text": "You know, it's kind of weird because I've gotten used to that."}, {"time": 2856, "text": "That's one, I guess, other aspect of program language design."}, {"time": 2859, "text": "You have to think, you know, the old first principles thinking, like, why are we doing it this way?"}, {"time": 2865, "text": "By the way, I mean, I remember, because I was thinking about the walrus operator and I'll ask you about it later, but it hit me that like the equal sign for assignment."}, {"time": 2878, "text": "Like, why are we using the equal sign for assignment?"}, {"time": 2880, "text": "It's wrong, yeah."}, {"time": 2882, "text": "And that's not the only solution, right?"}, {"time": 2884, "text": "So if you look at Pascal, they use colon equals for assignment and equals for equality."}, {"time": 2891, "text": "And they use like less than greater than instead of the not equal thing."}, {"time": 2895, "text": "Like, there are other answers here."}, {"time": 2896, "text": "So, but like, and yeah, like I ask you all, but how do you then decide to break convention to say, you know what, everybody's doing it wrong."}, {"time": 2909, "text": "We're gonna do it right."}, {"time": 2911, "text": "So it's like an ROI, like return on investment trade off, right?"}, {"time": 2915, "text": "So if you do something weird, let's just say like not like colon equal instead of equal for assignment, that would be weird with today's aesthetic, right?"}, {"time": 2924, "text": "And so you'd say, cool, this is theoretically better, but is it better in which ways?"}, {"time": 2929, "text": "Like, what do I get out of that?"}, {"time": 2930, "text": "Do I define away class of bugs?"}, {"time": 2932, "text": "Well, one of the class of bugs that C has is that you can use like, you know, if X equals without equals equals X equals Y, right?"}, {"time": 2941, "text": "Well, turns out you can solve that problem in lots of ways."}, {"time": 2945, "text": "Clang, for example, GCC, all these compilers will detect that as a likely bug, produce a warning."}, {"time": 2952, "text": "I feel like they didn't."}, {"time": 2953, "text": "Oh, Clang does."}, {"time": 2954, "text": "GCC didn't."}, {"time": 2955, "text": "It's like one of the important things about programming language design is like, you're literally creating suffering in the world."}, {"time": 2963, "text": "Like, I feel like, I mean, one way to see it is the bicycle for the mind, but the other way is to like minimizing suffering."}, {"time": 2972, "text": "Well, you have to decide if it's worth it, right?"}, {"time": 2973, "text": "And so let's come back to that."}, {"time": 2976, "text": "But if you look at this, and again, this is where there's a lot of detail that goes into each of these things."}, {"time": 2982, "text": "Equal and C returns a value."}, {"time": 2987, "text": "Is it messed up?"}, {"time": 2988, "text": "That allows you to say X equals Y equals Z, like that works in C. Yeah."}, {"time": 2994, "text": "You know, most people think it's messed up, I think."}, {"time": 2997, "text": "It is very, by messed up, what I mean is it is very rarely used for good, and it's often used for bugs."}, {"time": 3006, "text": "Right, and so."}, {"time": 3007, "text": "That's a good definition of messed up, yeah."}, {"time": 3009, "text": "You could use, you know, in hindsight, this was not such a great idea, right?"}, {"time": 3014, "text": "One of the things with Swift that is really powerful and one of the reasons it's actually good versus it being full of good ideas is that when we launched Swift 1, we announced that it was public, people could use it, people could build apps, but it was gonna change and break, okay?"}, {"time": 3030, "text": "When Swift 2 came out, we said, hey, it's open source, and there's this open process which people can help evolve and direct the language."}, {"time": 3037, "text": "So the community at large, like Swift users, can now help shape the language as it is."}, {"time": 3043, "text": "And what happened as part of that process is a lot of really bad mistakes got taken out."}, {"time": 3049, "text": "So for example, Swift used to have the C style plus plus and minus minus operators."}, {"time": 3055, "text": "Like, what does it mean when you put it before versus after, right?"}, {"time": 3059, "text": "Well, that got cargo culted from C into Swift early on."}, {"time": 3062, "text": "What's cargo culted?"}, {"time": 3063, "text": "Cargo culted means brought forward without really considering it."}, {"time": 3068, "text": "This is maybe not the most PC term, but."}, {"time": 3072, "text": "You have to look it up in Urban Dictionary, yeah."}, {"time": 3073, "text": "Yeah, so it got pulled into C without, or it got pulled into Swift without very good consideration."}, {"time": 3080, "text": "And we went through this process, and one of the first things got ripped out was plus plus and minus minus, because they lead to confusion."}, {"time": 3087, "text": "They have very low value over saying x plus equals one, and x plus equals one is way more clear."}, {"time": 3094, "text": "And so when you're optimizing for teachability and clarity and bugs and this multidimensional space that you're looking at, things like that really matter."}, {"time": 3102, "text": "And so being first principles on where you're coming from and what you're trying to achieve and being anchored on the objective is really important."}, {"time": 3110, "text": "Well, let me ask you about the most, sort of this podcast isn't about information, it's about drama."}, {"time": 3120, "text": "Let me talk to you about some drama."}, {"time": 3121, "text": "So you mentioned Pascal and colon equals, there's something that's called the Walrus operator."}, {"time": 3129, "text": "And Python in Python 3.8 added the Walrus operator."}, {"time": 3135, "text": "And the reason I think it's interesting is not just because of the feature, it has the same kind of expression feature you can mention to see that it returns the value of the assignment."}, {"time": 3147, "text": "And then maybe you can comment on that in general, but on the other side of it, it's also the thing that toppled the dictator."}, {"time": 3156, "text": "So it finally drove Guido to step down from BDFL, the toxicity of the community."}, {"time": 3162, "text": "So maybe what do you think about the Walrus operator in Python?"}, {"time": 3167, "text": "Is there an equivalent thing in Swift that really stress tested the community?"}, {"time": 3174, "text": "And then on the flip side, what do you think about Guido stepping down over it?"}, {"time": 3178, "text": "Yeah, well, if I look past the details of the Walrus operator, one of the things that makes it most polarizing is that it's syntactic sugar."}, {"time": 3187, "text": "What do you mean by syntactic sugar?"}, {"time": 3189, "text": "It means you can take something that already exists in the language and you can express it in a more concise way."}, {"time": 3194, "text": "So, okay, I'm going to play dollars advocate."}, {"time": 3195, "text": "So this is great."}, {"time": 3198, "text": "Is that a objective or subjective statement?"}, {"time": 3201, "text": "Like, can you argue that basically anything isn't syntactic sugar or not?"}, {"time": 3207, "text": "No, not everything is syntactic sugar."}, {"time": 3210, "text": "So for example, the type system, like can you have classes versus, like, do you have types or not, right?"}, {"time": 3217, "text": "So one type versus many types is not something that affects syntactic sugar."}, {"time": 3222, "text": "And so if you say, I want to have the ability to define types, I have to have all this like language mechanics to define classes."}, {"time": 3229, "text": "And oh, now I have to have inheritance."}, {"time": 3231, "text": "And I have like, I have all this stuff that's just making the language more complicated."}, {"time": 3234, "text": "That's not about sugaring it."}, {"time": 3238, "text": "Swift has the sugar."}, {"time": 3240, "text": "So like Swift has this thing called if let, and it has a lot of different types and it has various operators that are used to concisify specific use cases."}, {"time": 3250, "text": "So the problem with syntactic sugar, when you're talking about, hey, I have a thing that takes a lot to write and I have a new way to write it."}, {"time": 3257, "text": "You have this like horrible trade off, which becomes almost completely subjective, which is how often does this happen and does it matter?"}, {"time": 3266, "text": "And one of the things that is true about human psychology, particularly when you're talking about introducing a new thing is that people overestimate the burden of learning something."}, {"time": 3276, "text": "And so it looks foreign when you haven't gotten used to it."}, {"time": 3278, "text": "But if it was there from the beginning, of course it's just part of Python."}, {"time": 3282, "text": "Like unquestionably, like this is just the thing I know."}, {"time": 3285, "text": "And it's not a new thing that you're worried about learning."}, {"time": 3287, "text": "It's just part of the deal."}, {"time": 3289, "text": "Now with Guido, I don't know Guido well."}, {"time": 3295, "text": "Yeah, have you passed cross much?"}, {"time": 3296, "text": "Yeah, I've met him a couple of times, but I don't know Guido well."}, {"time": 3300, "text": "But the sense that I got out of that whole dynamic was that he had put the, not just the decision maker weight on his shoulders, but it was so tied to his personal identity that he took it personally and he felt the need and he kind of put himself in the situation of being the person, instead of building a base of support around him."}, {"time": 3320, "text": "I mean, this is probably not quite literally true, but by too much concentrated on him, right?"}, {"time": 3329, "text": "And that can wear you down."}, {"time": 3331, "text": "Well, yeah, particularly because people then say, Guido, you're a horrible person."}, {"time": 3335, "text": "I hate this thing, blah, blah, blah, blah, blah, blah, blah."}, {"time": 3337, "text": "And sure, it's like maybe 1% of the community that's doing that, but Python's got a big community."}, {"time": 3343, "text": "And 1% of millions of people is a lot of hate mail."}, {"time": 3346, "text": "And that just from human factor will just wear on you."}, {"time": 3349, "text": "Well, to clarify, it looked from just what I saw in the messaging for the, let's not look at the million Python users, but at the Python core developers, it feels like the majority, the big majority on a vote were opposed to it."}, {"time": 3363, "text": "Okay, I'm not that close to it, so I don't know."}, {"time": 3366, "text": "Okay, so the situation is like literally, yeah, I mean, the majority of the core developers are against it."}, {"time": 3373, "text": "Were opposed to it."}, {"time": 3374, "text": "So, and they weren't even like against it."}, {"time": 3380, "text": "It was, there was a few, well, they were against it, but the against it wasn't like, this is a bad idea."}, {"time": 3387, "text": "They were more like, we don't see why this is a good idea."}, {"time": 3391, "text": "And what that results in is there's a stalling feeling, like you just slow things down."}, {"time": 3397, "text": "Now, from my perspective, that you could argue this, and I think it's very interesting if we look at politics today and the way Congress works, it's slowed down everything."}, {"time": 3409, "text": "It's a dampener."}, {"time": 3410, "text": "Yeah, it's a dampener, but like, that's a dangerous thing too, because if it dampens things like, you know, if the dampening results."}, {"time": 3418, "text": "What are you talking about?"}, {"time": 3419, "text": "Like, it's a low pass filter, but if you need billions of dollars injected into the economy or trillions of dollars, then suddenly stuff happens, right?"}, {"time": 3429, "text": "So you're talking about."}, {"time": 3430, "text": "I'm not defending our political situation, just to be clear."}, {"time": 3433, "text": "But you're talking about like a global pandemic."}, {"time": 3437, "text": "I was hoping we could fix like the healthcare system and the education system, like, you know."}, {"time": 3442, "text": "I'm not a politics person."}, {"time": 3446, "text": "When it comes to languages, the community's kind of right in terms of, it's a very high burden to add something to a language."}, {"time": 3453, "text": "So as soon as you add something, you have a community of people building on it and you can't remove it, okay?"}, {"time": 3458, "text": "And if there's a community of people that feel really uncomfortable with it, then taking it slow, I think, is an important thing to do."}, {"time": 3465, "text": "And there's no rush, particularly if it was something that's 25 years old and is very established."}, {"time": 3470, "text": "And, you know, it's not like coming into its own."}, {"time": 3474, "text": "What about features?"}, {"time": 3475, "text": "Well, so I think that the issue with Guido is that maybe this is a case where he realized it had outgrown him and it went from being the language."}, {"time": 3486, "text": "So Python, I mean, Guido's amazing, but Python isn't about Guido anymore."}, {"time": 3492, "text": "It's about the users."}, {"time": 3493, "text": "And to a certain extent, the users own it."}, {"time": 3495, "text": "And, you know, Guido spent years of his life, a significant fraction of his career on Python."}, {"time": 3502, "text": "And from his perspective, I imagine he's like, well, this is my thing."}, {"time": 3505, "text": "I should be able to do the thing I think is right."}, {"time": 3508, "text": "But you can also understand the users where they feel like, you know, this is my thing."}, {"time": 3513, "text": "I use this, like, and I don't know, it's a hard thing."}, {"time": 3518, "text": "But what, if we could talk about leadership in this, because it's so interesting to me."}, {"time": 3522, "text": "I'm gonna make, I'm gonna work."}, {"time": 3524, "text": "Hopefully somebody makes it."}, {"time": 3525, "text": "If not, I'll make it a Walrus Operator shirt, because I think it represents, to me, maybe it's my Russian roots or something."}, {"time": 3532, "text": "But, you know, it's the burden of leadership."}, {"time": 3536, "text": "Like, I feel like to push back, I feel like progress can only, like most difficult decisions, just like you said, there'll be a lot of divisiveness over, especially in a passionate community."}, {"time": 3552, "text": "It just feels like leaders need to take those risky decisions that if you like listen, that with some nonzero probability, maybe even a high probability would be the wrong decision."}, {"time": 3566, "text": "But they have to use their gut and make that decision."}, {"time": 3569, "text": "Well, this is like one of the things where you see amazing founders."}, {"time": 3574, "text": "The founders understand exactly what's happened and how the company got there and are willing to say, we have been doing thing X the last 20 years, but today we're gonna do thing Y."}, {"time": 3585, "text": "And they make a major pivot for the whole company."}, {"time": 3587, "text": "The company lines up behind them, they move and it's the right thing."}, {"time": 3590, "text": "But then when the founder dies, the successor doesn't always feel that agency to be able to make those kinds of decisions."}, {"time": 3599, "text": "Even though they're a CEO, they could theoretically do whatever."}, {"time": 3602, "text": "There's two reasons for that, in my opinion, or in many cases, it's always different."}, {"time": 3607, "text": "But one of which is they weren't there for all the decisions that were made."}, {"time": 3611, "text": "And so they don't know the principles in which those decisions were made."}, {"time": 3615, "text": "And once the principles change, you should be obligated to change what you're doing and change direction, right?"}, {"time": 3622, "text": "And so if you don't know how you got to where you are, it just seems like gospel and you're not gonna question it."}, {"time": 3629, "text": "You may not understand that it really is the right thing to do, so you just may not see it."}, {"time": 3633, "text": "That's so brilliant."}, {"time": 3635, "text": "Like it's so much higher burden when as a leader you step into a thing that's already worked for a long time."}, {"time": 3642, "text": "Well, and if you change it and it doesn't work out, now you're the person who screwed it up."}, {"time": 3646, "text": "People always second guess it."}, {"time": 3648, "text": "And the second thing is that even if you decide to make a change, even if you're theoretically in charge, you're just a person that thinks they're in charge."}, {"time": 3657, "text": "Meanwhile, you have to motivate the troops."}, {"time": 3658, "text": "You have to explain it to them in terms they'll understand."}, {"time": 3660, "text": "You have to get them to buy into it and believe in it, because if they don't, then they're not gonna be able to make the turn even if you tell them their bonuses are gonna be curtailed."}, {"time": 3668, "text": "They're just not gonna like buy into it, you know?"}, {"time": 3670, "text": "And so there's only so much power you have as a leader, and you have to understand what those limitations are."}, {"time": 3676, "text": "Are you still BDFL?"}, {"time": 3678, "text": "You've been a BDFL of some stuff."}, {"time": 3681, "text": "You're very heavy on the B, the benevolent, benevolent dictator for life."}, {"time": 3687, "text": "I guess LLVM?"}, {"time": 3689, "text": "Yeah, so I still lead the LLVM world."}, {"time": 3692, "text": "I mean, what's the role of, so then on Swift you said that there's a group of people."}, {"time": 3698, "text": "Yeah, so if you contrast Python with Swift, right, one of the reasons, so everybody on the core team takes the role really seriously, and I think we all really care about where Swift goes, but you're almost delegating the final decision making to the wisdom of the group, and so it doesn't become personal."}, {"time": 3717, "text": "And also, when you're talking with the community, so yeah, some people are very annoyed as certain decisions get made."}, {"time": 3724, "text": "There's a certain faith in the process, because it's a very transparent process, and when a decision gets made, a full rationale is provided, things like this."}, {"time": 3732, "text": "These are almost defense mechanisms to help both guide future discussions and provide case law, kind of like Supreme Court does about this decision was made for this reason, and here's the rationale and what we want to see more of or less of."}, {"time": 3745, "text": "But it's also a way to provide a defense mechanism, so that when somebody's griping about it, they're not saying that person did the wrong thing."}, {"time": 3751, "text": "They're saying, well, this thing sucks, and later they move on and they get over it."}, {"time": 3758, "text": "Yeah, the analogy of the Supreme Court, I think, is really good."}, {"time": 3762, "text": "But then, okay, not to get personal on the SWIFT team, but it just seems like it's impossible for division not to emerge."}, {"time": 3772, "text": "Well, each of the humans on the SWIFT Core Team, for example, are different, and the membership of the SWIFT Core Team changes slowly over time, which is, I think, a healthy thing."}, {"time": 3782, "text": "And so each of these different humans have different opinions."}, {"time": 3785, "text": "Trust me, it's not a singular consciousness by any stretch of the imagination."}, {"time": 3791, "text": "You've got three major organizations, including Apple, Google, and SciFive, all kind of working together."}, {"time": 3796, "text": "And it's a small group of people, but you need high trust."}, {"time": 3800, "text": "You need, again, it comes back to the principles of what you're trying to achieve and understanding what you're optimizing for."}, {"time": 3807, "text": "And I think that starting with strong principles and working towards decisions is always a good way to both make wise decisions in general but then be able to communicate them to people so that they can buy into them."}, {"time": 3819, "text": "And that is hard."}, {"time": 3821, "text": "And so you mentioned LLVM."}, {"time": 3822, "text": "LLVM is gonna be 20 years old this December, so it's showing its own age."}, {"time": 3829, "text": "Do you have like a dragon cake plan?"}, {"time": 3833, "text": "No, I should definitely do that."}, {"time": 3834, "text": "Yeah, if we can have a pandemic cake."}, {"time": 3837, "text": "Pandemic cake."}, {"time": 3838, "text": "Everybody gets a slice of cake and it gets sent through email."}, {"time": 3844, "text": "But LLVM has had tons of its own challenges over time too, right?"}, {"time": 3849, "text": "And one of the challenges that the LLVM community has, in my opinion, is that it has a whole bunch of people that have been working on LLVM for 10 years, right?"}, {"time": 3859, "text": "Because this happens somehow."}, {"time": 3860, "text": "And LLVM has always been one way, but it needs to be a different way, right?"}, {"time": 3865, "text": "And they've worked on it for like 10 years."}, {"time": 3866, "text": "It's a long time to work on something."}, {"time": 3868, "text": "And you suddenly can't see the faults in the thing that you're working on."}, {"time": 3873, "text": "And LLVM has lots of problems and we need to address them and we need to make it better."}, {"time": 3876, "text": "And if we don't make it better, then somebody else will come up with a better idea, right?"}, {"time": 3880, "text": "And so it's just kind of of that age where the community is like in danger of getting too calcified."}, {"time": 3886, "text": "And so I'm happy to see new projects joining and new things mixing it up."}, {"time": 3891, "text": "Fortran is now a new thing in the LLVM community, which is hilarious and good."}, {"time": 3896, "text": "I've been trying to find, on a little tangent, find people who program in Cobalt or Fortran, Fortran especially, to talk to, they're hard to find."}, {"time": 3906, "text": "Yeah, look to the scientific community."}, {"time": 3909, "text": "They still use Fortran quite a bit."}, {"time": 3911, "text": "Well, interesting thing you kind of mentioned with LLVM, or just in general, that as something evolves, you're not able to see the faults."}, {"time": 3919, "text": "So do you fall in love with the thing over time?"}, {"time": 3923, "text": "Or do you start hating everything about the thing over time?"}, {"time": 3926, "text": "Well, so my personal folly is that I see, maybe not all, but many of the faults, and they grate on me, and I don't have time to go fix them."}, {"time": 3935, "text": "Yeah, and they get magnified over time."}, {"time": 3937, "text": "Well, and they may not get magnified, but they never get fixed."}, {"time": 3939, "text": "And it's like sand underneath, you know, it's just like grating against you."}, {"time": 3943, "text": "And it's like sand underneath your fingernails or something."}, {"time": 3945, "text": "It's just like, you know it's there, you can't get rid of it."}, {"time": 3949, "text": "And so the problem is that if other people don't see it, like I don't have time to go write the code and fix it anymore, but then people are resistant to change."}, {"time": 3961, "text": "And so you say, hey, we should go fix this thing."}, {"time": 3963, "text": "They're like, oh yeah, that sounds risky."}, {"time": 3965, "text": "It's like, well, is it the right thing or not?"}, {"time": 3967, "text": "Are the challenges the group dynamics, or is it also just technical?"}, {"time": 3971, "text": "I mean, some of these features like, I think as an observer, it's almost like a fan in the, you know, as a spectator of the whole thing, I don't often think about, you know, some things might actually be technically difficult to implement."}, {"time": 3987, "text": "An example of this is we built this new compiler framework called MLIR."}, {"time": 3992, "text": "MLIR is a whole new framework."}, {"time": 3994, "text": "It's not, many people think it's about machine learning."}, {"time": 3997, "text": "The ML stands for multi level because compiler people can't name things very well, I guess."}, {"time": 4002, "text": "Do we dig into what MLIR is?"}, {"time": 4005, "text": "Yeah, so when you look at compilers, compilers have historically been solutions for a given space."}, {"time": 4011, "text": "So LLVM is a, it's really good for dealing with CPUs, let's just say, at a high level."}, {"time": 4018, "text": "You look at Java, Java has a JVM."}, {"time": 4021, "text": "The JVM is very good for garbage collected languages that need dynamic compilation, and it's very optimized for a specific space."}, {"time": 4028, "text": "And so hotspot is one of the compilers that gets used in that space, and that compiler is really good at that kind of stuff."}, {"time": 4034, "text": "Usually when you build these domain specific compilers, you end up building the whole thing from scratch for each domain."}, {"time": 4042, "text": "What's a domain?"}, {"time": 4043, "text": "So what's the scope of a domain?"}, {"time": 4046, "text": "Well, so here I would say, like, if you look at Swift, there's several different parts to the Swift compiler, one of which is covered by the LLVM part of it."}, {"time": 4056, "text": "There's also a high level piece that's specific to Swift, and there's a huge amount of redundancy between those two different infrastructures and a lot of re implemented stuff that is similar but different."}, {"time": 4068, "text": "What does LLVM define?"}, {"time": 4069, "text": "LLVM is effectively an infrastructure."}, {"time": 4073, "text": "So you can mix and match it in different ways."}, {"time": 4075, "text": "It's built out of libraries."}, {"time": 4076, "text": "You can use it for different things, but it's really good at CPUs and GPUs."}, {"time": 4079, "text": "CPUs and like the tip of the iceberg on GPUs."}, {"time": 4082, "text": "It's not really great at GPUs."}, {"time": 4085, "text": "But it turns out."}, {"time": 4085, "text": "A bunch of languages that."}, {"time": 4087, "text": "That then use it to talk to CPUs."}, {"time": 4091, "text": "And so it turns out there's a lot of hardware out there that is custom accelerators."}, {"time": 4094, "text": "So machine learning, for example."}, {"time": 4096, "text": "There are a lot of matrix multiply accelerators and things like this."}, {"time": 4100, "text": "There's a whole world of hardware synthesis."}, {"time": 4102, "text": "So we're using MLIR to build circuits."}, {"time": 4107, "text": "And so you're compiling for a domain of transistors."}, {"time": 4110, "text": "And so what MLIR does is it provides a tremendous amount of compiler infrastructure that allows you to build these domain specific compilers in a much faster way and have the result be good."}, {"time": 4121, "text": "If we're thinking about the future, now we're talking about like ASICs."}, {"time": 4125, "text": "So anything."}, {"time": 4127, "text": "So if we project into the future, it's very possible that the number of these kinds of ASICs, very specific infrastructure architecture things like multiplies exponentially."}, {"time": 4146, "text": "So that's MLIR."}, {"time": 4148, "text": "So what MLIR does is it allows you to build these compilers very efficiently."}, {"time": 4153, "text": "Right now, one of the things that coming back to the LLVM thing, and then we'll go to hardware, is LLVM is a specific compiler for a specific domain."}, {"time": 4163, "text": "MLIR is now this very general, very flexible thing that can solve lots of different kinds of problems."}, {"time": 4169, "text": "So LLVM is a subset of what MLIR does."}, {"time": 4172, "text": "So MLIR is, I mean, it's an ambitious project then."}, {"time": 4175, "text": "Yeah, it's a very ambitious project, yeah."}, {"time": 4176, "text": "And so to make it even more confusing, MLIR has joined the LLVM Umbrella Project."}, {"time": 4182, "text": "So it's part of the LLVM family."}, {"time": 4185, "text": "But where this comes full circle is now folks that work on the LLVM part, the classic part that's 20 years old, aren't aware of all the cool new things that have been done in the new thing, that MLIR was built by me and many other people that knew a lot about LLVM, and so we fixed a lot of the mistakes that lived in LLVM."}, {"time": 4205, "text": "And so now you have this community dynamic where it's like, well, there's this new thing, but it's not familiar, nobody knows it, it feels like it's new, and so let's not trust it."}, {"time": 4212, "text": "And so it's just really interesting to see the cultural social dynamic that comes out of that."}, {"time": 4216, "text": "And I think it's super healthy because we're seeing the ideas percolate and we're seeing the technology diffusion happen as people get more comfortable with it, they start to understand things in their own terms."}, {"time": 4227, "text": "And this just gets to the, it takes a while for ideas to propagate, even though they may be very different than what people are used to."}, {"time": 4235, "text": "So maybe let's talk about that a little bit, the world of Asics."}, {"time": 4239, "text": "Actually, you have a new role at SciFive."}, {"time": 4245, "text": "What's that place about?"}, {"time": 4247, "text": "What is the vision for their vision for, I would say, the future of computer?"}, {"time": 4252, "text": "Yeah, so I lead the engineering and product teams at SciFive."}, {"time": 4255, "text": "SciFive is a company who was founded with this architecture called RISC5."}, {"time": 4262, "text": "RISC5 is a new instruction set."}, {"time": 4264, "text": "Instruction sets are the things inside of your computer that tell it how to run things."}, {"time": 4268, "text": "X86 from Intel and ARM from the ARM company and things like this are other instruction sets."}, {"time": 4273, "text": "I've talked to, sorry to interrupt, I've talked to Dave Patterson, who's super excited about RISC5."}, {"time": 4277, "text": "Dave is awesome."}, {"time": 4278, "text": "Yeah, he's brilliant, yeah."}, {"time": 4280, "text": "The RISC5 is distinguished by not being proprietary."}, {"time": 4284, "text": "And so X86 can only be made by Intel and AMD."}, {"time": 4288, "text": "ARM can only be made by ARM."}, {"time": 4290, "text": "They sell licenses to build ARM chips to other companies, things like this."}, {"time": 4294, "text": "MIPS is another instruction set that is owned by the MIPS company, now Wave."}, {"time": 4298, "text": "And then it gets licensed out, things like that."}, {"time": 4300, "text": "And so RISC5 is an open standard that anybody can build chips for."}, {"time": 4305, "text": "And so SciFive was founded by three of the founders of RISC5 that designed and built it in Berkeley, working with Dave."}, {"time": 4312, "text": "And so that was the genesis of the company."}, {"time": 4316, "text": "SciFive today has some of the world's best RISC5 cores and we're selling them and that's really great."}, {"time": 4321, "text": "They're going to tons of products, it's very exciting."}, {"time": 4324, "text": "So they're taking this thing that's open source and just trying to be or are the best in the world at building these things."}, {"time": 4330, "text": "Yeah, so here it's the specifications open source."}, {"time": 4333, "text": "It's like saying TCP IP is an open standard or C is an open standard, but then you have to build an implementation of the standard."}, {"time": 4340, "text": "And so SciFive, on the one hand, pushes forward and defined and pushes forward the standard."}, {"time": 4346, "text": "On the other hand, we have implementations that are best in class for different points in the space, depending on if you want a really tiny CPU or if you want a really big, beefy one that is faster, but it uses more area and things like this."}, {"time": 4358, "text": "What about the actual manufacturer chips?"}, {"time": 4361, "text": "So like, where does that all fit?"}, {"time": 4363, "text": "I'm going to ask a bunch of dumb questions."}, {"time": 4365, "text": "That's okay, this is how we learn, right?"}, {"time": 4368, "text": "And so the way this works is that there's generally a separation of the people who designed the circuits and then people who manufacture them."}, {"time": 4376, "text": "And so you'll hear about fabs like TSMC and Samsung and things like this that actually produce the chips, but they take a design coming in and that design specifies how the, you turn code for the chip into little rectangles that then use photolithography to make mask sets and then burn transistors onto a chip or onto a, onto silicon rather."}, {"time": 4404, "text": "So, and we're talking about mass manufacturing, so."}, {"time": 4408, "text": "Yeah, they're talking about making hundreds of millions of parts and things like that, yeah."}, {"time": 4411, "text": "And so the fab handles the volume production, things like that."}, {"time": 4414, "text": "But when you look at this problem, the interesting thing about the space when you look at it is that these, the steps that you go from designing a chip and writing the quote unquote code for it and things like Verilog and languages like that, down to what you hand off to the fab is a really well studied, really old problem, okay?"}, {"time": 4436, "text": "Tons of people have worked on it."}, {"time": 4437, "text": "Lots of smart people have built systems and tools."}, {"time": 4440, "text": "These tools then have generally gone through acquisitions."}, {"time": 4443, "text": "And so they've ended up at three different major companies that build and sell these tools."}, {"time": 4447, "text": "They're called the EDA tools like for electronic design automation."}, {"time": 4451, "text": "The problem with this is you have huge amounts of fragmentation, you have loose standards and the tools don't really work together."}, {"time": 4460, "text": "So you have tons of duct tape and you have tons of loss productivity."}, {"time": 4464, "text": "Now these are, these are tools for designing."}, {"time": 4466, "text": "So the RISC 5 is a instruction."}, {"time": 4470, "text": "Like what is RISC 5?"}, {"time": 4472, "text": "Like how deep does it go?"}, {"time": 4473, "text": "How much does it touch the hardware?"}, {"time": 4475, "text": "How much does it define how much of the hardware is?"}, {"time": 4478, "text": "Yeah, so RISC 5 is all about given a CPU."}, {"time": 4481, "text": "So the processor and your computer, how does the compiler like Swift compiler, the C compiler, things like this, how does it make it work?"}, {"time": 4490, "text": "So it's, what is the assembly code?"}, {"time": 4492, "text": "And so you write RISC 5 assembly instead of XA6 assembly, for example."}, {"time": 4497, "text": "But it's a set of instructions as opposed to instructions."}, {"time": 4500, "text": "Why do you say it tells you how the compiler works?"}, {"time": 4503, "text": "Sorry, it's what the compiler talks to."}, {"time": 4506, "text": "And then the tooling you mentioned that the disparate tools are for what?"}, {"time": 4510, "text": "For when you're building a specific chip."}, {"time": 4513, "text": "So RISC 5."}, {"time": 4513, "text": "In hardware."}, {"time": 4514, "text": "In hardware, yeah."}, {"time": 4515, "text": "So RISC 5, you can buy a RISC 5 core from SciFive and say, hey, I want to have a certain number of, run a certain number of gigahertz."}, {"time": 4523, "text": "I want it to be this big."}, {"time": 4524, "text": "I want it to be, have these features."}, {"time": 4526, "text": "I want to have like, I want floating point or not, for example."}, {"time": 4531, "text": "And then what you get is you get a description of a CPU with those characteristics."}, {"time": 4536, "text": "Now, if you want to make a chip, you want to build like an iPhone chip or something like that, right?"}, {"time": 4541, "text": "You have to take both the CPU, but then you have to talk to memory."}, {"time": 4544, "text": "You have to have timers, IOs, a GPU, other components."}, {"time": 4549, "text": "And so you need to pull all those things together into what's called an ASIC, an Application Specific Integrated Circuit."}, {"time": 4555, "text": "So a custom chip."}, {"time": 4556, "text": "And then you take that design and then you have to transform it into something that the fabs, like TSMC, for example, know how to take to production."}, {"time": 4567, "text": "So, but yeah, okay."}, {"time": 4568, "text": "And so that process, I will, I can't help but see it as, is a big compiler."}, {"time": 4576, "text": "It's a whole bunch of compilers written without thinking about it through that lens."}, {"time": 4581, "text": "Isn't the universe a compiler?"}, {"time": 4583, "text": "Yeah, compilers do two things."}, {"time": 4586, "text": "They represent things and transform them."}, {"time": 4589, "text": "And so there's a lot of things that end up being compilers."}, {"time": 4591, "text": "But this is a space where we're talking about design and usability and the way you think about things, the way things compose correctly, it matters a lot."}, {"time": 4600, "text": "And so SciFi is investing a lot into that space."}, {"time": 4603, "text": "And we think that there's a lot of benefit that can be made by allowing people to design chips faster, get them to market quicker and scale out because at the alleged end of Moore's law, you've got this problem of you're not getting free performance just by waiting another year for a faster CPU."}, {"time": 4623, "text": "And so you have to find performance in other ways."}, {"time": 4626, "text": "And one of the ways to do that is with custom accelerators and other things and hardware."}, {"time": 4631, "text": "And so, well, we'll talk a little more about ASICs, but do you see that a lot of people, a lot of companies will try to have different sets of requirements that this whole process to go for?"}, {"time": 4648, "text": "So like almost different car companies might use different and like different PC manufacturers."}, {"time": 4655, "text": "So is RISC 5 in this whole process, is it potentially the future of all computing devices?"}, {"time": 4664, "text": "Yeah, I think that, so if you look at RISC 5 and step back from the Silicon side of things, RISC 5 is an open standard."}, {"time": 4671, "text": "And one of the things that has happened over the course of decades, if you look over the long arc of computing, somehow became decades old."}, {"time": 4680, "text": "Is that you have companies that come and go and you have instruction sets that come and go."}, {"time": 4684, "text": "Like one example of this out of many is Sun with Spark."}, {"time": 4689, "text": "Yeah, it's on one way."}, {"time": 4691, "text": "Spark still lives on at Fujitsu, but we have HP had this instruction set called PA RISC."}, {"time": 4698, "text": "So PA RISC was this big server business and had tons of customers."}, {"time": 4702, "text": "They decided to move to this architecture called Itanium from Intel."}, {"time": 4707, "text": "This didn't work out so well."}, {"time": 4710, "text": "Right, and so you have this issue of you're making many billion dollar investments on instruction sets that are owned by a company."}, {"time": 4718, "text": "And even companies as big as Intel don't always execute as well as they could."}, {"time": 4722, "text": "They even have their own issues."}, {"time": 4724, "text": "HP, for example, decided that it wasn't in their best interest to continue investing in the space because it was very expensive."}, {"time": 4729, "text": "And so they make technology decisions or they make their own business decisions."}, {"time": 4734, "text": "And this means that as a customer, what do you do?"}, {"time": 4737, "text": "You've sunk all this time, all this engineering, all this software work, all these, you've built other products around them and now you're stuck, right?"}, {"time": 4745, "text": "What RISC 5 does is provide you more optionality in the space because if you buy an implementation of RISC 5 from SciFive, and you should, they're the best ones."}, {"time": 4756, "text": "But if something bad happens to SciFive in 20 years, right?"}, {"time": 4759, "text": "Well, great, you can turn around and buy a RISC 5 core from somebody else."}, {"time": 4763, "text": "And there's an ecosystem of people that are all making different RISC 5 cores with different trade offs, which means that if you have more than one requirement, if you have a family of products, you can probably find something in the RISC 5 space that fits your needs."}, {"time": 4776, "text": "Whereas with, if you're talking about XA6, for example, it's Intel's only gonna bother to make certain classes of devices, right?"}, {"time": 4785, "text": "I see, so maybe a weird question, but like if SciFive is like infinitely successful in the next 20, 30 years, what does the world look like?"}, {"time": 4798, "text": "So like how does the world of computing change?"}, {"time": 4801, "text": "So too much diversity in hardware instruction sets, I think is bad."}, {"time": 4806, "text": "Like we have a lot of people that are using lots of different instruction sets, particularly in the embedded, the like very tiny microcontroller space, the thing in your toaster that are just weird and different for historical reasons."}, {"time": 4821, "text": "And so the compilers and the tool chains and the languages on top of them aren't there."}, {"time": 4827, "text": "And so the developers for that software have to use really weird tools because the ecosystem that supports is not big enough."}, {"time": 4834, "text": "So I expect that will change, right?"}, {"time": 4835, "text": "People will have better tools and better languages, better features everywhere that then can serve as many different points in the space."}, {"time": 4843, "text": "And I think RISC5 will progressively eat more of the ecosystem because it can scale up, it can scale down, sideways, left, right."}, {"time": 4851, "text": "It's very flexible and very well considered and well designed instruction set."}, {"time": 4856, "text": "I think when you look at SciFive tackling silicon and how people build chips, which is a very different space, that's where you say, I think we'll see a lot more custom chips."}, {"time": 4867, "text": "And that means that you get much more battery life, you get better tuned solutions for your IoT thingy."}, {"time": 4876, "text": "You get people that move faster, you get the ability to have faster time to market, for example."}, {"time": 4881, "text": "So how many custom..."}, {"time": 4882, "text": "So first of all, on the IoT side of things, do you see the number of smart toasters increasing exponentially?"}, {"time": 4890, "text": "So, and if you do, like how much customization per toaster is there?"}, {"time": 4898, "text": "Do all toasters in the world run the same silicon, like the same design, or is it different companies have different design?"}, {"time": 4906, "text": "Like how much customization is possible here?"}, {"time": 4909, "text": "Well, a lot of it comes down to cost, right?"}, {"time": 4912, "text": "And so the way that chips work is you end up paying by the... One of the factors is the size of the chip."}, {"time": 4918, "text": "And so what ends up happening just from an economic perspective is there's only so many chips that get made in a year of a given design."}, {"time": 4927, "text": "And so often what customers end up having to do is they end up having to pick up a chip that exists that was built for somebody else so that they can then ship their product."}, {"time": 4936, "text": "And the reason for that is they don't have the volume of the iPhone."}, {"time": 4939, "text": "They can't afford to build a custom chip."}, {"time": 4941, "text": "However, what that means is they're now buying an off the shelf chip that isn't really good, isn't a perfect fit for their needs."}, {"time": 4948, "text": "And so they're paying a lot of money for it because they're buying silicon that they're not using."}, {"time": 4953, "text": "Well, if you now reduce the cost of designing the chip, now you get a lot more chips."}, {"time": 4957, "text": "And the more you reduce it, the easier it is to design chips."}, {"time": 4962, "text": "The more the world keeps evolving and we get more AI accelerators, we get more other things, we get more standards to talk to, we get 6G, right?"}, {"time": 4970, "text": "You get changes in the world that you wanna be able to talk to these different things."}, {"time": 4974, "text": "There's more diversity in the cross product of features that people want."}, {"time": 4978, "text": "And that drives differentiated chips in another direction."}, {"time": 4983, "text": "And so nobody really knows what the future looks like, but I think that there's a lot of silicon in the future."}, {"time": 4989, "text": "Speaking of the future, you said Moore's law allegedly is dead."}, {"time": 4993, "text": "So do you agree with Dave Patterson and many folks that Moore's law is dead?"}, {"time": 5002, "text": "Or do you agree with Jim Keller, who's standing at the helm of the pirate ship saying it's still alive?"}, {"time": 5012, "text": "Well, so I agree with what they're saying and different people are interpreting the end of Moore's law in different ways."}, {"time": 5020, "text": "So Jim would say, there's another thousand X left in physics and we can continue to squeeze the stone and make it faster and smaller and smaller geometries and all that kind of stuff."}, {"time": 5033, "text": "So Jim is absolutely right that there's a ton of progress left and we're not at the limit of physics yet."}, {"time": 5041, "text": "That's not really what Moore's law is though."}, {"time": 5044, "text": "If you look at what Moore's law is, is that it's a very simple evaluation of, okay, well you look at the cost per, I think it was cost per area and the most economic point in that space."}, {"time": 5057, "text": "And if you go look at the now quite old paper that describes this, Moore's law has a specific economic aspect to it and I think this is something that Dave and others often point out."}, {"time": 5068, "text": "And so on a technicality, that's right."}, {"time": 5071, "text": "I look at it from, so I can acknowledge both of those viewpoints."}, {"time": 5074, "text": "They're both right."}, {"time": 5076, "text": "I'll give you a third wrong viewpoint that may be right in its own way, which is single threaded performance doesn't improve like it used to."}, {"time": 5086, "text": "And it used to be back when you got a, you know, a Pentium 66 or something and the year before you had a Pentium 33 and now it's twice as fast, right?"}, {"time": 5096, "text": "Well, it was twice as fast at doing exactly the same thing."}, {"time": 5100, "text": "Okay, like literally the same program ran twice as fast."}, {"time": 5103, "text": "You just wrote a check and waited a year, year and a half."}, {"time": 5107, "text": "Well, so that's what a lot of people think about Moore's law and I think that is dead."}, {"time": 5111, "text": "And so what we're seeing instead is we're pushing, we're pushing people to write software in different ways."}, {"time": 5117, "text": "And so we're pushing people to write CUDA so they can get GPU compute and the thousands of cores on GPU."}, {"time": 5123, "text": "We're talking about C programmers having to use P threads because they now have, you know, a hundred threads or 50 cores in a machine or something like that."}, {"time": 5131, "text": "You're now talking about machine learning accelerators that are now domain specific."}, {"time": 5135, "text": "And when you look at these kinds of use cases, you can still get performance and Jim will come up with cool things that utilize the silicon in new ways for sure, but you're also gonna change the programming model."}, {"time": 5149, "text": "And now when you start talking about changing the programming model, that's when you come back to languages and things like this too, because often what you see is like you take the C programming language, right?"}, {"time": 5159, "text": "The C programming language is designed for CPUs."}, {"time": 5163, "text": "And so if you want to talk to a GPU, now you're talking to its cousin CUDA, okay?"}, {"time": 5168, "text": "CUDA is a different thing with a different set of tools, a different world, a different way of thinking."}, {"time": 5174, "text": "And we don't have one world that scales."}, {"time": 5176, "text": "And I think that we can get there."}, {"time": 5178, "text": "We can have one world that scales in a much better way."}, {"time": 5181, "text": "And a small tangent then, I think most programming languages are designed for CPUs, for single core, even just in their spirit, even if they allow for parallelization."}, {"time": 5190, "text": "So what does it look like for a programming language to have parallelization or massive parallelization as it's like first principle?"}, {"time": 5201, "text": "So the canonical example of this is the hardware design world."}, {"time": 5206, "text": "So Verilog, VHDL, these kinds of languages, they're what's called a high level synthesis language."}, {"time": 5213, "text": "This is the thing people design chips in."}, {"time": 5216, "text": "And when you're designing a chip, it's kind of like a brain where you have infinite parallelism."}, {"time": 5222, "text": "Like you're like laying down transistors."}, {"time": 5225, "text": "Transistors are always running, okay?"}, {"time": 5228, "text": "And so you're not saying run this transistor, then this transistor, then this transistor."}, {"time": 5232, "text": "It's like your brain, like your neurons are always just doing something."}, {"time": 5235, "text": "They're not clocked, right?"}, {"time": 5236, "text": "They're just doing their thing."}, {"time": 5240, "text": "And so when you design a chip or when you design a CPU, when you design a GPU, when you design, when you're laying down the transistors, similarly, you're talking about, well, okay, well, how do these things communicate?"}, {"time": 5251, "text": "And so these languages exist."}, {"time": 5252, "text": "Verilog is a kind of mixed example of that."}, {"time": 5256, "text": "None of these languages are really great."}, {"time": 5257, "text": "You have a very low level, yeah."}, {"time": 5259, "text": "Yeah, they're very low level and abstraction is necessary here."}, {"time": 5262, "text": "And there's different approaches with that."}, {"time": 5264, "text": "And it's itself a very complicated world, but it's implicitly parallel."}, {"time": 5270, "text": "And so having that as the domain that you program towards makes it so that by default, you get parallel systems."}, {"time": 5279, "text": "If you look at CUDA, CUDA is a point halfway in the space where in CUDA, when you write a CUDA kernel for your GPU, it feels like you're writing a scalar program."}, {"time": 5288, "text": "So you're like, you have ifs, you have for loops, stuff like this, you're just writing normal code."}, {"time": 5292, "text": "But what happens outside of that in your driver is that it actually is running you on like a thousand things at once, right?"}, {"time": 5298, "text": "And so it's parallel, but it has pulled it out of the programming model."}, {"time": 5303, "text": "And so now you as a programmer are working in a simpler world and it's solved that for you, right?"}, {"time": 5311, "text": "How do you take the language like Swift?"}, {"time": 5316, "text": "If we think about GPUs, but also ASICs, maybe if we can dance back and forth between hardware and software."}, {"time": 5322, "text": "How do you design for these features to be able to program and get a first class citizen to be able to do like Swift for TensorFlow to be able to do machine learning on current hardware, but also future hardware like TPUs and all kinds of ASICs that I'm sure will be popping up more and more."}, {"time": 5342, "text": "Yeah, well, so a lot of this comes down to this whole idea of having the nuts and bolts underneath the covers that work really well."}, {"time": 5348, "text": "So you need, if you're talking to TPUs, you need MLIR or XLA or one of these compilers that talks to TPUs to build on top of, okay?"}, {"time": 5357, "text": "And if you're talking to circuits, you need to figure out how to lay down the transistors and how to organize it and how to set up clocking and like all the domain problems that you get with circuits."}, {"time": 5367, "text": "Then you have to decide how to explain it to a human."}, {"time": 5369, "text": "What is ZY, right?"}, {"time": 5371, "text": "And if you do it right, that's a library problem, not a language problem."}, {"time": 5376, "text": "And that works if you have a library or a language which allows your library to write things that feel native in the language by implementing libraries, because then you can innovate in programming models without having to change your syntax again."}, {"time": 5391, "text": "Like you have to invent new code formatting tools and like all the other things that languages come with."}, {"time": 5397, "text": "And this gets really interesting."}, {"time": 5399, "text": "And so if you look at the space, the interesting thing once you separate out syntax becomes what is that programming model?"}, {"time": 5407, "text": "And so do you want the CUDA style?"}, {"time": 5410, "text": "I write one program and it runs many places."}, {"time": 5414, "text": "Do you want the implicitly parallel model?"}, {"time": 5416, "text": "How do you reason about that?"}, {"time": 5417, "text": "How do you give developers, chip architects, the ability to express their intent?"}, {"time": 5424, "text": "And that comes into this whole design question of how do you detect bugs quickly?"}, {"time": 5429, "text": "So you don't have to tape out a chip to find out it's wrong, ideally, right?"}, {"time": 5432, "text": "How do you, and this is a spectrum, how do you make it so that people feel productive?"}, {"time": 5438, "text": "So their turnaround time is very quick."}, {"time": 5440, "text": "All these things are really hard problems."}, {"time": 5442, "text": "And in this world, I think that not a lot of effort has been put into that design problem and thinking about the layering in other pieces."}, {"time": 5451, "text": "Well, you've, on the topic of concurrency, you've written the Swift concurrency manifest."}, {"time": 5455, "text": "I think it's kind of interesting."}, {"time": 5457, "text": "Anything that has the word manifest on it is very interesting."}, {"time": 5462, "text": "Can you summarize the key ideas of each of the five parts you've written about?"}, {"time": 5467, "text": "So what is a manifesto?"}, {"time": 5469, "text": "How about, we start there."}, {"time": 5471, "text": "So in the Swift community, we have this problem, which is on the one hand, you wanna have relatively small proposals that you can kind of fit in your head, you can understand the details at a very fine grain level that move the world forward."}, {"time": 5486, "text": "But then you also have these big arcs, okay?"}, {"time": 5488, "text": "And often when you're working on something that is a big arc, but you're tackling it in small pieces, you have this question of, how do I know I'm not doing a random walk?"}, {"time": 5497, "text": "Where are we going?"}, {"time": 5498, "text": "How does this add up?"}, {"time": 5499, "text": "Furthermore, when you start the first small step, what terminology do you use?"}, {"time": 5506, "text": "What is better and worse in the space?"}, {"time": 5508, "text": "What are we trying to achieve?"}, {"time": 5510, "text": "And so what a manifesto in the Swift community does is it starts to say, hey, well, let's step back from the details of everything."}, {"time": 5516, "text": "Let's paint a broad picture to talk about what we're trying to achieve."}, {"time": 5521, "text": "Let's give an example design point."}, {"time": 5522, "text": "Let's try to paint the big picture so that then we can zero in on the individual steps and make sure that we're making good progress."}, {"time": 5529, "text": "And so the Swift concurrency manifesto is something I wrote three years ago."}, {"time": 5533, "text": "It's been a while, maybe more."}, {"time": 5536, "text": "Trying to do that for Swift and concurrency."}, {"time": 5539, "text": "It starts with some fairly simple things like making the observation that when you have multiple different computers and multiple different threads that are communicating, it's best for them to be asynchronous."}, {"time": 5552, "text": "And so you need things to be able to run separately and then communicate with each other."}, {"time": 5555, "text": "And this means asynchrony."}, {"time": 5557, "text": "And this means that you need a way to modeling asynchronous communication."}, {"time": 5561, "text": "Many languages have features like this."}, {"time": 5563, "text": "Async await is a popular one."}, {"time": 5565, "text": "And so that's what I think is very likely in Swift."}, {"time": 5569, "text": "But as you start building this tower of abstractions, it's not just about how do you write this, you then reach into the how do you get memory safety because you want correctness, you want debuggability and sanity for developers."}, {"time": 5581, "text": "And how do you get that memory safety into the language?"}, {"time": 5586, "text": "So if you take a language like Go or C or any of these languages, you get what's called a race condition when two different threads or Go routines or whatever touch the same point in memory, right?"}, {"time": 5597, "text": "This is a huge like maddening problem to debug because it's not reproducible generally."}, {"time": 5604, "text": "And so there's tools, there's a whole ecosystem of solutions that built up around this, but it's a huge problem when you're writing concurrent code."}, {"time": 5611, "text": "And so with Swift, this whole value semantics thing is really powerful there because it turns out that math and copies actually work even in concurrent worlds."}, {"time": 5620, "text": "And so you get a lot of safety just out of the box, but there are also some hard problems."}, {"time": 5624, "text": "And it talks about some of that."}, {"time": 5627, "text": "When you start building up to the next level up and you start talking beyond memory safety, you have to talk about what is the programmer model?"}, {"time": 5633, "text": "How does a human think about this?"}, {"time": 5634, "text": "So a developer that's trying to build a program think about this, and it proposes a really old model with a new spin called Actors."}, {"time": 5642, "text": "Actors are about saying, we have islands of single threadedness logically."}, {"time": 5648, "text": "So you write something that feels like it's one program running in a unit, and then it communicates asynchronously with other things."}, {"time": 5656, "text": "And so making that expressive and natural feel good be the first thing you reach for and being safe by default is a big part of the design of that proposal."}, {"time": 5665, "text": "When you start going beyond that, now you start to say, cool, well, these things that communicate asynchronously, they don't have to share memory."}, {"time": 5672, "text": "Well, if they don't have to share memory and they're sending messages to each other, why do they have to be in the same process?"}, {"time": 5678, "text": "These things should be able to be in different processes on your machine."}, {"time": 5681, "text": "And why just processes?"}, {"time": 5683, "text": "Well, why not different machines?"}, {"time": 5684, "text": "And so now you have a very nice gradual transition towards distributed programming."}, {"time": 5689, "text": "And of course, when you start talking about the big future, the manifesto doesn't go into it, but accelerators are things you talk to asynchronously by sending messages to them."}, {"time": 5701, "text": "And how do you program those?"}, {"time": 5703, "text": "Well, that gets very interesting."}, {"time": 5705, "text": "That's not in the proposal."}, {"time": 5707, "text": "And how much do you wanna make that explicit like the control of that whole process explicit to the program?"}, {"time": 5716, "text": "So when you're designing any of these kinds of features or language features or even libraries, you have this really hard trade off you have to make, which is how much is it magic or how much is it in the human's control?"}, {"time": 5729, "text": "How much can they predict and control it?"}, {"time": 5732, "text": "What do you do when the default case is the wrong case?"}, {"time": 5737, "text": "And so when you're designing a system, and so when you're designing a system, I won't name names, but there are systems where it's really easy to get started and then you jump."}, {"time": 5752, "text": "So let's pick like logo."}, {"time": 5754, "text": "Okay, so something like this."}, {"time": 5755, "text": "So it's really easy to get started."}, {"time": 5757, "text": "It's really designed for teaching kids, but as you get into it, you hit a ceiling and then you can't go any higher."}, {"time": 5763, "text": "And then what do you do?"}, {"time": 5764, "text": "Well, you have to go switch to a different world and rewrite all your code."}, {"time": 5767, "text": "And this logo is a silly example here."}, {"time": 5769, "text": "This exists in many other languages."}, {"time": 5771, "text": "With Python, you would say like concurrency, right?"}, {"time": 5775, "text": "So Python has the global interpreter block."}, {"time": 5777, "text": "So threading is challenging in Python."}, {"time": 5779, "text": "And so if you start writing a large scale application in Python, and then suddenly you need concurrency, you're kind of stuck with a series of bad trade offs, right?"}, {"time": 5790, "text": "There's other ways to go where you say like, foist all the complexity on the user all at once, right?"}, {"time": 5797, "text": "And that's also bad in a different way."}, {"time": 5798, "text": "And so what I prefer is building a simple model that you can explain that then has an escape hatch."}, {"time": 5806, "text": "So you get in, you have guardrails, memory safety works like this in Swift, where you can start with, like by default, if you use all the standard things, it's memory safe, you're not gonna shoot your foot off."}, {"time": 5818, "text": "But if you wanna get a C level pointer to something, you can explicitly do that."}, {"time": 5824, "text": "But by default, there's guardrails."}, {"time": 5827, "text": "There's guardrails."}, {"time": 5828, "text": "Okay, so but like, whose job is it to figure out which part of the code is parallelizable?"}, {"time": 5837, "text": "So in the case of the proposal, it is the human's job."}, {"time": 5841, "text": "So they decide how to architect their application."}, {"time": 5844, "text": "And then the runtime in the compiler is very predictable."}, {"time": 5849, "text": "And so this is in contrast to like, there's a long body of work, including on Fortran for auto parallelizing compilers."}, {"time": 5856, "text": "And this is an example of a bad thing in my, so as a compiler person, I can drag on compiler people."}, {"time": 5862, "text": "Often compiler people will say, cool, since I can't change the code, I'm gonna write my compiler that then takes this unmodified code and makes go way faster on this machine."}, {"time": 5872, "text": "Okay, application, and so it does pattern matching."}, {"time": 5875, "text": "It does like really deep analysis."}, {"time": 5877, "text": "Compiler people are really smart."}, {"time": 5878, "text": "And so they like wanna like do something really clever and tricky."}, {"time": 5881, "text": "And you get like 10X speed up by taking like an array of structures and turn it into a structure of arrays or something, because it's so much better for memory."}, {"time": 5889, "text": "Like there's bodies, like tons of tricks."}, {"time": 5892, "text": "They love optimization."}, {"time": 5893, "text": "Yeah, you love optimization."}, {"time": 5894, "text": "Everyone loves optimization."}, {"time": 5895, "text": "Everyone loves it."}, {"time": 5896, "text": "Well, and it's this promise of build with my compiler and your thing goes fast, right?"}, {"time": 5900, "text": "But here's the problem, Lex, you write a program, you run it with my compiler, it goes fast."}, {"time": 5906, "text": "You're very happy."}, {"time": 5907, "text": "Wow, it's so much faster than the other compiler."}, {"time": 5909, "text": "Then you go and you add a feature to your program or you refactor some code."}, {"time": 5912, "text": "And suddenly you got a 10X loss in performance."}, {"time": 5916, "text": "What just happened there?"}, {"time": 5917, "text": "What just happened there is the heuristic, the pattern matching, the compiler, whatever analysis it was doing just got defeated because you didn't inline a function or something, right?"}, {"time": 5928, "text": "As a user, you don't know, you don't wanna know."}, {"time": 5930, "text": "That was the whole point."}, {"time": 5931, "text": "You don't wanna know how the compiler works."}, {"time": 5932, "text": "You don't wanna know how the memory hierarchy works."}, {"time": 5934, "text": "You don't wanna know how it got parallelized across all these things."}, {"time": 5937, "text": "You wanted that abstracted away from you, but then the magic is lost as soon as you did something and you fall off a performance cliff."}, {"time": 5945, "text": "And now you're in this funny position where what do I do?"}, {"time": 5948, "text": "I don't change my code."}, {"time": 5949, "text": "I don't fix that bug."}, {"time": 5950, "text": "It costs 10X performance."}, {"time": 5952, "text": "Now what do I do?"}, {"time": 5953, "text": "Well, this is the problem with unpredictable performance."}, {"time": 5956, "text": "If you care about performance, predictability is a very important thing."}, {"time": 5959, "text": "And so what the proposal does is it provides architectural patterns for being able to lay out your code, gives you full control over that, makes it really simple so you can explain it."}, {"time": 5970, "text": "And then if you wanna scale out in different ways, you have full control over that."}, {"time": 5976, "text": "So in your sense, the intuition is for a compiler, it's too hard to do automated parallelization."}, {"time": 5983, "text": "Cause the compilers do stuff automatically that's incredibly impressive for other things, but for parallelization, we're not close to there."}, {"time": 5994, "text": "Well, it depends on the programming model."}, {"time": 5996, "text": "So there's many different kinds of compilers."}, {"time": 5998, "text": "And so if you talk about like a C compiler or Swift compiler or something like that, where you're writing imperative code, parallelizing that and reasoning about all the pointers and stuff like that is a very difficult problem."}, {"time": 6010, "text": "Now, if you switch domains, so there's this cool thing called machine learning, right?"}, {"time": 6015, "text": "So machine learning nerds among other endearing things like solving cat detectors and other things like that have done this amazing breakthrough of producing a programming model, operations that you compose together that has raised levels of abstraction high enough that suddenly you can have auto parallelizing compilers."}, {"time": 6036, "text": "You can write a model using a TensorFlow and have it run on 1024 nodes of a TPU."}, {"time": 6044, "text": "I didn't even think about like, cause there's so much flexibility in the design of architectures that ultimately boil down to a graph that's parallelized for you."}, {"time": 6054, "text": "And if you think about it, that's pretty cool."}, {"time": 6056, "text": "That's pretty cool, yeah."}, {"time": 6057, "text": "And you think about batching, for example, as a way of being able to exploit more parallelism."}, {"time": 6062, "text": "Like that's a very simple thing that now is very powerful."}, {"time": 6065, "text": "That didn't come out of the programming language nerds, those people, like that came out of people that are just looking to solve a problem and use a few GPUs and organically developed by the community of people focusing on machine learning."}, {"time": 6076, "text": "And it's an incredibly powerful abstraction layer that enables the compiler people to go and exploit that."}, {"time": 6082, "text": "And now you can drive supercomputers from Python."}, {"time": 6086, "text": "Well, that's pretty cool."}, {"time": 6088, "text": "So just to pause on that, cause I'm not sufficiently low level, I forget to admire the beauty and power of that, but maybe just to linger on it, like what does it take to run a neural network fast?"}, {"time": 6102, "text": "Like how hard is that compilation?"}, {"time": 6105, "text": "So we just skipped, you said like, it's amazing that that's a thing, but yeah, how hard is that of a thing?"}, {"time": 6111, "text": "It's hard and I would say that not all of the systems are really great, including the ones I helped build."}, {"time": 6118, "text": "So there's a lot of work left to be done there."}, {"time": 6120, "text": "Is it the compiler nerds working on that or is it a whole new group of people?"}, {"time": 6124, "text": "Well, it's a full stack problem, including compiler people, including APIs, so like Keras and the module API and PyTorch and Jax."}, {"time": 6134, "text": "And there's a bunch of people pushing on all the different parts of these things, because when you look at it as it's both, how do I express the computation?"}, {"time": 6141, "text": "Do I stack up layers?"}, {"time": 6142, "text": "Well, cool, like setting up a linear sequence of layers is great for the simple case, but how do I do the hard case?"}, {"time": 6148, "text": "How do I do reinforcement learning?"}, {"time": 6149, "text": "Well, now I need to integrate my application logic in this."}, {"time": 6152, "text": "Then it's the next level down of, how do you represent that for the runtime?"}, {"time": 6156, "text": "How do you get hardware abstraction?"}, {"time": 6159, "text": "And then you get to the next level down of saying like, forget about abstraction, how do I get the peak performance out of my TPU or my iPhone accelerator or whatever, right?"}, {"time": 6167, "text": "And all these different things."}, {"time": 6168, "text": "And so this is a layered problem with a lot of really interesting design and work going on in the space and a lot of really smart people working on it."}, {"time": 6176, "text": "Machine learning is a very well funded area of investment right now."}, {"time": 6180, "text": "And so there's a lot of progress being made."}, {"time": 6182, "text": "So how much innovation is there on the lower level, so closer to the ASIC, so redesigning the hardware or redesigning concurrently compilers with that hardware?"}, {"time": 6193, "text": "Is that like, if you were to predict the biggest, the equivalent of Moore's law improvements in the inference and the training of neural networks and just all of that, where is that gonna come from, you think?"}, {"time": 6206, "text": "Sure, you get scalability of different things."}, {"time": 6208, "text": "And so you get Jim Keller shrinking process technology, you get three nanometer instead of five or seven or 10 or 28 or whatever."}, {"time": 6218, "text": "And so that marches forward and that provides improvements."}, {"time": 6221, "text": "You get architectural level performance."}, {"time": 6224, "text": "And so the TPU with a matrix multiply unit and a systolic array is much more efficient than having a scalar core doing multiplies and adds and things like that."}, {"time": 6234, "text": "You then get system level improvements."}, {"time": 6238, "text": "So how you talk to memory, how you talk across a cluster of machines, how you scale out, how you have fast interconnects between machines."}, {"time": 6246, "text": "You then get system level programming models."}, {"time": 6248, "text": "So now that you have all this hardware, how to utilize it."}, {"time": 6251, "text": "You then have algorithmic breakthroughs where you say, hey, wow, cool."}, {"time": 6254, "text": "Instead of training in a resonant 50 in a week, I'm now training it in 25 seconds."}, {"time": 6261, "text": "And it's a combination of new optimizers and new just training regimens and different approaches to train."}, {"time": 6272, "text": "And all of these things come together to push the world forward."}, {"time": 6276, "text": "That was a beautiful exposition."}, {"time": 6279, "text": "But if you were to force to bet all your money on one of these."}, {"time": 6285, "text": "Why do we have to?"}, {"time": 6288, "text": "Unfortunately, we have people working on all this."}, {"time": 6290, "text": "It's an exciting time, right?"}, {"time": 6292, "text": "So, I mean, OpenAI did this little paper showing the algorithmic improvement you can get."}, {"time": 6298, "text": "It's been improving exponentially."}, {"time": 6300, "text": "I haven't quite seen the same kind of analysis on other layers of the stack."}, {"time": 6306, "text": "I'm sure it's also improving significantly."}, {"time": 6309, "text": "I just, it's a nice intuition builder."}, {"time": 6312, "text": "I mean, there's a reason why Moore's Law, that's the beauty of Moore's Law is somebody writes a paper that makes a ridiculous prediction."}, {"time": 6322, "text": "And it becomes reality in a sense."}, {"time": 6327, "text": "There's something about these narratives when you, when Chris Ladner on a silly little podcast makes, bets all his money on a particular thing, somehow it can have a ripple effect of actually becoming real."}, {"time": 6340, "text": "That's an interesting aspect of it."}, {"time": 6343, "text": "Cause like it might've been, we focus with Moore's Law, most of the computing industry really, really focused on the hardware."}, {"time": 6353, "text": "I mean, software innovation, I don't know how much software innovation there was in terms of efficient."}, {"time": 6357, "text": "What Intel Giveth Bill takes away, right?"}, {"time": 6360, "text": "Yeah, I mean, compilers improved significantly also."}, {"time": 6364, "text": "Well, not really."}, {"time": 6364, "text": "So actually, I mean, so I'm joking about how software has gotten slower pretty much as fast as hardware got better, at least through the nineties."}, {"time": 6373, "text": "There's another joke, another law in compilers, which is called, I think it's called Probstine's Law, which is compilers double the performance of any given code every 18 years."}, {"time": 6386, "text": "So they move slowly."}, {"time": 6387, "text": "Yeah, also."}, {"time": 6388, "text": "Well, yeah, it's exponential also."}, {"time": 6390, "text": "Yeah, you're making progress, but there again, it's not about, the power of compilers is not just about how do you make the same thing go faster?"}, {"time": 6399, "text": "It's how do you unlock the new hardware?"}, {"time": 6401, "text": "A new chip came out, how do you utilize it?"}, {"time": 6403, "text": "You say, oh, the programming model, how do we make people more productive?"}, {"time": 6406, "text": "How do we have better error messages?"}, {"time": 6411, "text": "Even such mundane things like how do I generate a very specific error message about your code actually makes people happy because then they know how to fix it, right?"}, {"time": 6421, "text": "And it comes back to how do you help people get their job done."}, {"time": 6424, "text": "Yeah, and yeah, and then in this world of exponentially increasing smart toasters, how do you expand computing to all these kinds of devices?"}, {"time": 6436, "text": "Do you see this world where just everything is a computing surface?"}, {"time": 6440, "text": "You see that possibility?"}, {"time": 6442, "text": "Just everything is a computer?"}, {"time": 6443, "text": "Yeah, I don't see any reason that that couldn't be achieved."}, {"time": 6446, "text": "It turns out that sand goes into glass and glass is pretty useful too."}, {"time": 6452, "text": "And why not?"}, {"time": 6455, "text": "So very important question then, if we're living in a simulation and the simulation is running a computer, like what's the architecture of that computer, do you think?"}, {"time": 6471, "text": "So you're saying is it a quantum system?"}, {"time": 6474, "text": "Yeah, like this whole quantum discussion, is it needed?"}, {"time": 6477, "text": "Or can we run it with a RISC 5 architecture, a bunch of CPUs?"}, {"time": 6485, "text": "I think it comes down to the right tool for the job."}, {"time": 6487, "text": "Yeah, and so."}, {"time": 6488, "text": "And what's the compiler?"}, {"time": 6490, "text": "Yeah, exactly, that's my question."}, {"time": 6492, "text": "Did I get that job?"}, {"time": 6493, "text": "Feed the universe compiler."}, {"time": 6496, "text": "And so there, as far as we know, quantum systems are the bottom of the pile of turtles so far."}, {"time": 6505, "text": "And so we don't know efficient ways to implement quantum systems without using quantum computers."}, {"time": 6512, "text": "Yeah, and that's totally outside of everything we've talked about."}, {"time": 6515, "text": "But who runs that quantum computer?"}, {"time": 6517, "text": "Right, so if we really are living in a simulation, then is it bigger quantum computers?"}, {"time": 6524, "text": "Is it different ones?"}, {"time": 6525, "text": "Like how does that work out?"}, {"time": 6526, "text": "How does that scale?"}, {"time": 6527, "text": "Well, it's the same size."}, {"time": 6529, "text": "It's the same size."}, {"time": 6530, "text": "But then the thought of the simulation is that you don't have to run the whole thing, that we humans are cognitively very limited."}, {"time": 6536, "text": "We do checkpoints."}, {"time": 6537, "text": "We do checkpoints, yeah."}, {"time": 6539, "text": "And if we, the point at which we human, so you basically do minimal amount of, what is it, Swift does on right, copy on right."}, {"time": 6552, "text": "So you only adjust the simulation."}, {"time": 6555, "text": "Parallel universe theories, right?"}, {"time": 6557, "text": "And so every time a decision's made, somebody opens the short end of your box, then there's a fork."}, {"time": 6563, "text": "And then this could happen."}, {"time": 6564, "text": "And then, thank you for considering the possibility."}, {"time": 6569, "text": "But yeah, so it may not require the entirety of the universe to simulate it."}, {"time": 6574, "text": "But it's interesting to think about as we create this higher and higher fidelity systems."}, {"time": 6582, "text": "But I do wanna ask on the quantum computer side, because everything we've talked about, whether you work with SciFive, with compilers, none of that includes quantum computers, right?"}, {"time": 6595, "text": "So have you ever thought about this whole serious engineering work of quantum computers looks like of compilers, of architectures, all of that kind of stuff?"}, {"time": 6610, "text": "So I've looked at it a little bit."}, {"time": 6611, "text": "I know almost nothing about it, which means that at some point, I will have to find an excuse to get involved, because that's how it works."}, {"time": 6618, "text": "But do you think that's a thing to be, like with your little tingly senses of the timing of when to be involved, is it not yet?"}, {"time": 6626, "text": "Well, so the thing I do really well is I jump into messy systems and figure out how to make them, figure out what the truth in the situation is, try to figure out what the unifying theory is, how to like factor the complexity, how to find a beautiful answer to a problem that has been well studied and lots of people have bashed their heads against it."}, {"time": 6647, "text": "I don't know that quantum computers are mature enough and accessible enough to be figured out yet, right?"}, {"time": 6653, "text": "And I think the open question with quantum computers is, is there a useful problem that gets solved with a quantum computer that makes it worth the economic cost of like having one of these things and having legions of people that set it up?"}, {"time": 6671, "text": "You go back to the fifties, right?"}, {"time": 6672, "text": "And there's the projections of the world will only need seven computers, right?"}, {"time": 6678, "text": "Well, and part of that was that people hadn't figured out what they're useful for."}, {"time": 6681, "text": "What are the algorithms we wanna run?"}, {"time": 6683, "text": "What are the problems that get solved?"}, {"time": 6684, "text": "And this comes back to how do we make the world better, either economically or making somebody's life better or like solving a problem that wasn't solved before, things like this."}, {"time": 6693, "text": "And I think that just we're a little bit too early in that development cycle because it's still like literally a science project, not a negative connotation, right?"}, {"time": 6701, "text": "It's literally a science project and the progress there is amazing."}, {"time": 6705, "text": "And so I don't know if it's 10 years away, if it's two years away, exactly where that breakthrough happens, but you look at machine learning, we went through a few winners before the AlexNet transition and then suddenly it had its breakout moment."}, {"time": 6722, "text": "And that was the catalyst that then drove the talent flocking into it."}, {"time": 6727, "text": "That's what drove the economic applications of it."}, {"time": 6730, "text": "That's what drove the technology to go faster because you now have more minds thrown at the problem."}, {"time": 6735, "text": "This is what caused like a serious knee in deep learning and the algorithms that we're using."}, {"time": 6741, "text": "And so I think that's what quantum needs to go through."}, {"time": 6745, "text": "And so right now it's in that formidable finding itself, getting the like literally the physics figured out."}, {"time": 6752, "text": "And then it has to figure out the application that makes this useful."}, {"time": 6757, "text": "Yeah, but I'm not skeptical that I think that will happen."}, {"time": 6760, "text": "I think it's just 10 years away, something like that."}, {"time": 6763, "text": "I forgot to ask, what programming language do you think the simulation is written in?"}, {"time": 6768, "text": "Ooh, probably Lisp."}, {"time": 6770, "text": "So not Swift."}, {"time": 6772, "text": "Like if you're a Tibet, I'll just leave it at that."}, {"time": 6778, "text": "So, I mean, we've mentioned that you worked with all these companies, we've talked about all these projects."}, {"time": 6783, "text": "It's kind of like if we just step back and zoom out about the way you did that work."}, {"time": 6790, "text": "And we look at COVID times, this pandemic we're living through that may, if I look at the way Silicon Valley folks are talking about it, the way MIT is talking about it, this might last for a long time."}, {"time": 6803, "text": "Not just the virus, but the remote nature."}, {"time": 6808, "text": "The economic impact."}, {"time": 6809, "text": "I mean, all of it, yeah."}, {"time": 6810, "text": "Yeah, it's gonna be a mess."}, {"time": 6812, "text": "Do you think, what's your prediction?"}, {"time": 6814, "text": "I mean, from sci fi to Google, to just all the places you worked in, just Silicon Valley, you're in the middle of it."}, {"time": 6824, "text": "What do you think is, how is this whole place gonna change?"}, {"time": 6826, "text": "Yeah, so, I mean, I really can only speak to the tech perspective."}, {"time": 6830, "text": "I am in that bubble."}, {"time": 6834, "text": "I think it's gonna be really interesting because the Zoom culture of being remote and on video chat all the time has really interesting effects on people."}, {"time": 6841, "text": "So on the one hand, it's a great normalizer."}, {"time": 6845, "text": "It's a normalizer that I think will help communities of people that have traditionally been underrepresented because now you're taking, in some cases, a face off because you don't have to have a camera going, right?"}, {"time": 6858, "text": "And so you can have conversations without physical appearance being part of the dynamic, which is pretty powerful."}, {"time": 6864, "text": "You're taking remote employees that have already been remote, and you're saying you're now on the same level and footing as everybody else."}, {"time": 6871, "text": "Nobody gets whiteboards."}, {"time": 6873, "text": "You're not gonna be the one person that doesn't get to be participating in the whiteboard conversation, and that's pretty powerful."}, {"time": 6879, "text": "You've got, you're forcing people to think asynchronously in some cases because it's harder to just get people physically together, and the bumping into each other forces people to find new ways to solve those problems."}, {"time": 6892, "text": "And I think that that leads to more inclusive behavior, which is good."}, {"time": 6896, "text": "On the other hand, it's also, it just sucks, right?"}, {"time": 6900, "text": "And so the actual communication just sucks being not with people on a daily basis and collaborating with them."}, {"time": 6911, "text": "Yeah, all of that, right?"}, {"time": 6913, "text": "I mean, everything, this whole situation is terrible."}, {"time": 6915, "text": "What I meant primarily was the, I think that most humans like working physically with humans."}, {"time": 6922, "text": "I think this is something that not everybody, but many people are programmed to do."}, {"time": 6927, "text": "And I think that we get something out of that that is very hard to express, at least for me."}, {"time": 6931, "text": "And so maybe this isn't true of everybody."}, {"time": 6933, "text": "But, and so the question to me is, when you get through that time of adaptation, you get out of March and April, and you get into December, you get into next March, if it's not changed, right?"}, {"time": 6946, "text": "It's already terrifying."}, {"time": 6947, "text": "Well, you think about that, and you think about what is the nature of work?"}, {"time": 6951, "text": "And how do we adapt?"}, {"time": 6952, "text": "And humans are very adaptable species, right?"}, {"time": 6955, "text": "We can learn things when we're forced to, and there's a catalyst to make that happen."}, {"time": 6960, "text": "And so what is it that comes out of this, and are we better or worse off?"}, {"time": 6964, "text": "I think that you look at the Bay Area, housing prices are insane."}, {"time": 6969, "text": "Well, there's a high incentive to be physically located, because if you don't have proximity, you end up paying for it and commute, right?"}, {"time": 6978, "text": "And there has been huge social pressure in terms of you will be there for the meeting, right?"}, {"time": 6984, "text": "Or whatever scenario it is."}, {"time": 6986, "text": "And I think that's gonna be way better."}, {"time": 6988, "text": "I think it's gonna be much more the norm to have remote employees, and I think this is gonna be really great."}, {"time": 6993, "text": "Do you have friends, or do you hear of people moving?"}, {"time": 6997, "text": "I know one family friend that moved."}, {"time": 7000, "text": "They moved back to Michigan, and they were a family with three kids living in a small apartment, and we're going insane, right?"}, {"time": 7010, "text": "And they're in tech, husband works for Google."}, {"time": 7014, "text": "So first of all, friends of mine are in the process of, or have already lost the business."}, {"time": 7020, "text": "The thing that represents their passion, their dream, it could be small entrepreneurial projects, but it could be large businesses, like people that run gyms."}, {"time": 7028, "text": "Restaurants, tons of things, yeah."}, {"time": 7030, "text": "But also, people look at themselves in the mirror and ask the question of, what do I wanna do in life?"}, {"time": 7037, "text": "For some reason, they haven't done it until COVID."}, {"time": 7040, "text": "They really ask that question, and that results often in moving or leaving the company with starting your own business or transitioning to a different company."}, {"time": 7050, "text": "Do you think we're gonna see that a lot?"}, {"time": 7053, "text": "Well, I can't speak to that."}, {"time": 7056, "text": "I mean, we're definitely gonna see it at a higher frequency than we did before, just because I think what you're trying to say is there are decisions that you make yourself, big life decisions that you make yourself, and I'm gonna quit my job and start a new thing."}, {"time": 7069, "text": "There's also decisions that get made for you."}, {"time": 7072, "text": "I got fired from my job, what am I gonna do, right?"}, {"time": 7075, "text": "And that's not a decision that you think about, but you're forced to act, okay?"}, {"time": 7080, "text": "And so I think that those, you're forced to act kind of moments where global pandemic comes and wipes out the economy, and now your business doesn't exist."}, {"time": 7089, "text": "I think that does lead to more reflection, right?"}, {"time": 7091, "text": "Because you're less anchored on what you have, and it's not a, what do I have to lose versus what do I have to gain, A, B, comparison."}, {"time": 7099, "text": "It's more of a fresh slate."}, {"time": 7101, "text": "Cool, I could do anything now."}, {"time": 7103, "text": "Do I wanna do the same thing I was doing?"}, {"time": 7106, "text": "Did that make me happy?"}, {"time": 7107, "text": "Is this now time to go back to college and take a class and learn a new skill?"}, {"time": 7113, "text": "Is this a time to spend time with family if you can afford to do that?"}, {"time": 7117, "text": "Is this time to literally move in with parents, right?"}, {"time": 7120, "text": "I mean, all these things that were not normative before suddenly become, I think, very, the value systems change."}, {"time": 7129, "text": "And I think that's actually a good thing in the short term, at least, because it leads to, there's kind of been an overoptimization along one set of priorities for the world, and now maybe we'll get to a more balanced and more interesting world where people are doing different things."}, {"time": 7146, "text": "I think it could be good."}, {"time": 7147, "text": "I think there could be more innovation that comes out of it, for example."}, {"time": 7150, "text": "What do you think about all the social chaos we're in the middle of?"}, {"time": 7154, "text": "You think it's, let me ask you a whole, you think it's all gonna be okay?"}, {"time": 7161, "text": "Well, I think humanity will survive."}, {"time": 7163, "text": "The, from an existential, like we're not all gonna kill, yeah, well."}, {"time": 7167, "text": "Yeah, I don't think the virus is gonna kill all the humans."}, {"time": 7170, "text": "I don't think all the humans are gonna kill all the humans."}, {"time": 7171, "text": "I think that's unlikely."}, {"time": 7172, "text": "But I look at it as progress requires a catalyst, right?"}, {"time": 7182, "text": "So you need a reason for people to be willing to do things that are uncomfortable."}, {"time": 7187, "text": "I think that the US, at least, but I think the world in general is a pretty unoptimal place to live in for a lot of people."}, {"time": 7196, "text": "And I think that what we're seeing right now is we're seeing a lot of unhappiness."}, {"time": 7200, "text": "And because of all the pressure, because of all the badness in the world that's coming together, it's really kind of igniting some of that debate that should have happened a long time ago, right?"}, {"time": 7210, "text": "I mean, I think that we'll see more progress."}, {"time": 7211, "text": "You're asking about, offline you're asking about politics and wouldn't it be great if politics moved faster because there's all these problems in the world and we can move it."}, {"time": 7218, "text": "Well, people are intentionally, are inherently conservative."}, {"time": 7222, "text": "And so if you're talking about conservative people, particularly if they have heavy burdens on their shoulders because they represent literally thousands of people, it makes sense to be conservative."}, {"time": 7233, "text": "But on the other hand, when you need change, how do you get it?"}, {"time": 7237, "text": "The global pandemic will probably lead to some change."}, {"time": 7240, "text": "And it's not a directed, it's not a directed plan, but I think that it leads to people asking really interesting questions."}, {"time": 7247, "text": "And some of those questions should have been asked a long time ago."}, {"time": 7250, "text": "Well, let me know if you've observed this as well."}, {"time": 7253, "text": "Something that's bothered me in the machine learning community, I'm guessing it might be prevalent in other places, is something that feels like in 2020 increase the level of toxicity."}, {"time": 7265, "text": "Like people are just quicker to pile on, to just be, they're just harsh on each other, to like mob, pick a person that screwed up and like make it a big thing."}, {"time": 7282, "text": "And is there something that we can like, yeah, have you observed that in other places?"}, {"time": 7288, "text": "Is there some way out of this?"}, {"time": 7290, "text": "I think there's an inherent thing in humanity that's kind of an us versus them thing, which is that you wanna succeed and how do you succeed?"}, {"time": 7297, "text": "Well, it's relative to somebody else."}, {"time": 7299, "text": "And so what's happening in, at least in some part is that with the internet and with online communication, the world's getting smaller, right?"}, {"time": 7309, "text": "And so we're having some of the social ties of like my town versus your town's football team, right?"}, {"time": 7317, "text": "Turn into much larger and yet shallower problems."}, {"time": 7322, "text": "And people don't have time, the incentives, the clickbait and like all these things kind of really feed into this machine."}, {"time": 7330, "text": "And I don't know where that goes."}, {"time": 7332, "text": "Yeah, I mean, the reason I think about that, I mentioned to you this offline a little bit, but I have a few difficult conversations scheduled, some of them political related, some of them within the community, difficult personalities that went through some stuff."}, {"time": 7350, "text": "I mean, one of them I've talked before, I will talk again is Yann LeCun."}, {"time": 7354, "text": "He got a little bit of crap on Twitter for talking about a particular paper and the bias within a data set."}, {"time": 7362, "text": "And then there's been a huge, in my view, and I'm willing, comfortable saying it, irrational, over exaggerated pile on his comments because he made pretty basic comments about the fact that if there's bias in the data, there's going to be bias in the results."}, {"time": 7382, "text": "So we should not have bias in the data, but people piled on to him because he said he trivialized the problem of bias."}, {"time": 7390, "text": "Like it's a lot more than just bias in the data, but like, yes, that's a very good point, but that's not what he was saying."}, {"time": 7398, "text": "That's not what he was saying."}, {"time": 7399, "text": "And the response, like the implied response that he's basically sexist and racist is something that completely drives away the possibility of nuanced discussion."}, {"time": 7412, "text": "One nice thing about like a pocket long form of conversation is you can talk it out."}, {"time": 7420, "text": "You can lay your reasoning out."}, {"time": 7422, "text": "And even if you're wrong, you can still show that you're a good human being underneath it."}, {"time": 7428, "text": "You know, your point about you can't have a productive discussion."}, {"time": 7430, "text": "Well, how do you get to the point where people can turn?"}, {"time": 7433, "text": "They can learn, they can listen, they can think, they can engage versus just being a shallow like, and then keep moving, right?"}, {"time": 7442, "text": "And I don't think that progress really comes from that, right?"}, {"time": 7447, "text": "And I don't think that one should expect that."}, {"time": 7449, "text": "I think that you'd see that as reinforcing individual circles and the us versus them thing."}, {"time": 7454, "text": "And I think that's fairly divisive."}, {"time": 7457, "text": "Yeah, I think there's a big role in, like the people that bother me most on Twitter when I observe things is not the people who get very emotional, angry, like over the top."}, {"time": 7470, "text": "It's the people who like prop them up."}, {"time": 7473, "text": "It's all the, it's this, I think what should be the, we should teach each other is to be sort of empathetic."}, {"time": 7482, "text": "The thing that it's really easy to forget, particularly on like Twitter or the internet or an email, is that sometimes people just have a bad day, right?"}, {"time": 7490, "text": "You have a bad day or you're like, I've been in the situation where it's like between meetings, like fire off a quick response to an email because I want to like help get something unblocked, phrase it really objectively wrong."}, {"time": 7503, "text": "I screwed up."}, {"time": 7504, "text": "And suddenly this is now something that sticks with people."}, {"time": 7508, "text": "And it's not because they're bad."}, {"time": 7510, "text": "It's not because you're bad."}, {"time": 7511, "text": "Just psychology of like, you said a thing, it sticks with you."}, {"time": 7516, "text": "You didn't mean it that way, but it really impacted somebody because the way they interpret it."}, {"time": 7520, "text": "And this is just an aspect of working together as humans."}, {"time": 7523, "text": "And I have a lot of optimism in the long term, the very long term about what we as humanity can do."}, {"time": 7529, "text": "But I think that's going to be, it's just always a rough ride."}, {"time": 7531, "text": "And you came into this by saying like, what does COVID and all the social strife that's happening right now mean?"}, {"time": 7538, "text": "And I think that it's really bad in the short term, but I think it'll lead to progress."}, {"time": 7542, "text": "And for that, I'm very thankful."}, {"time": 7545, "text": "Yeah, painful in the short term though."}, {"time": 7548, "text": "I mean, people are out of jobs."}, {"time": 7549, "text": "Like some people can't eat."}, {"time": 7550, "text": "Like it's horrible."}, {"time": 7552, "text": "And, but you know, it's progress."}, {"time": 7556, "text": "So we'll see what happens."}, {"time": 7558, "text": "I mean, the real question is when you look back 10 years, 20 years, a hundred years from now, how do we evaluate the decisions are being made right now?"}, {"time": 7566, "text": "I think that's really the way you can frame that and look at it."}, {"time": 7570, "text": "And you say, you know, you integrate across all the short term horribleness that's happening and you look at what that means and is the improvement across the world or the regression across the world significant enough to make it a good or a bad thing?"}, {"time": 7584, "text": "I think that's the question."}, {"time": 7587, "text": "And for that, it's good to study history."}, {"time": 7589, "text": "I mean, one of the big problems for me right now is I'm reading The Rise and Fall of the Third Reich."}, {"time": 7596, "text": "Light reading?"}, {"time": 7597, "text": "So it's everything is just, I just see parallels and it means it's, you have to be really careful not to overstep it, but just the thing that worries me the most is the pain that people feel when a few things combine, which is like economic depression, which is quite possible in this country."}, {"time": 7617, "text": "And then just being disrespected in some kind of way, which the German people were really disrespected by most of the world, like in a way that's over the top, that something can build up and then all you need is a charismatic leader to go either positive or negative and both work as long as they're charismatic."}, {"time": 7641, "text": "And there's..."}, {"time": 7642, "text": "It's taking advantage of, again, that inflection point that the world's in and what they do with it could be good or bad."}, {"time": 7649, "text": "And so it's a good way to think about times now, like on an individual level, what we decide to do is when history is written, 30 years from now, what happened in 2020, probably history is gonna remember 2020."}, {"time": 7663, "text": "Either for good or bad, and it's up to us to write it so it's good."}, {"time": 7669, "text": "Well, one of the things I've observed that I find fascinating is most people act as though the world doesn't change."}, {"time": 7676, "text": "You make decision knowingly, right?"}, {"time": 7679, "text": "You make a decision where you're predicting the future based on what you've seen in the recent past."}, {"time": 7684, "text": "And so if something's always been, it's rained every single day, then of course you expect it to rain today too, right?"}, {"time": 7690, "text": "On the other hand, the world changes all the time."}, {"time": 7694, "text": "Constantly, like for better and for worse."}, {"time": 7696, "text": "And so the question is, if you're interested in something that's not right, what is the inflection point that led to a change?"}, {"time": 7702, "text": "And you can look to history for this."}, {"time": 7704, "text": "Like what is the catalyst that led to that explosion that led to that bill that led to the, like you can kind of work your way backwards from that."}, {"time": 7713, "text": "And maybe if you pull together the right people and you get the right ideas together, you can actually start driving that change and doing it in a way that's productive and hurts fewer people."}, {"time": 7721, "text": "Yeah, like a single person, a single event can turn all of history."}, {"time": 7724, "text": "Absolutely, everything starts somewhere."}, {"time": 7726, "text": "And often it's a combination of multiple factors, but yeah, these things can be engineered."}, {"time": 7732, "text": "That's actually the optimistic view that."}, {"time": 7734, "text": "I'm a longterm optimist on pretty much everything and human nature."}, {"time": 7739, "text": "We can look to all the negative things that humanity has, all the pettiness and all the like self servingness and the just the cruelty, right?"}, {"time": 7749, "text": "The biases, the just humans can be very horrible."}, {"time": 7753, "text": "But on the other hand, we're capable of amazing things."}, {"time": 7757, "text": "And the progress across 100 year chunks is striking."}, {"time": 7763, "text": "And even across decades, we've come a long ways and there's still a long ways to go, but that doesn't mean that we've stopped."}, {"time": 7769, "text": "Yeah, the kind of stuff we've done in the last 100 years is unbelievable."}, {"time": 7774, "text": "It's kind of scary to think what's gonna happen in this 100 years."}, {"time": 7777, "text": "It's scary, like exciting."}, {"time": 7779, "text": "Like scary in a sense that it's kind of sad that the kind of technology is gonna come out in 10, 20, 30 years."}, {"time": 7785, "text": "We're probably too old to really appreciate if you don't grow up with it."}, {"time": 7789, "text": "It'll be like kids these days with their virtual reality and their TikToks and stuff like this."}, {"time": 7794, "text": "Like, how does this thing and like, come on, give me my static photo."}, {"time": 7800, "text": "My Commodore 64."}, {"time": 7803, "text": "Okay, sorry, we kind of skipped over."}, {"time": 7805, "text": "Let me ask on, the machine learning world has been kind of inspired, their imagination captivated with GPT3 and these language models."}, {"time": 7818, "text": "I thought it'd be cool to get your opinion on it."}, {"time": 7821, "text": "What's your thoughts on this exciting world of, it connects to computation actually, is of language models that are huge and take many, many computers, not just to train, but to also do inference on."}, {"time": 7840, "text": "Well, I mean, it depends on what you're speaking to there."}, {"time": 7843, "text": "But I mean, I think that there's been a pretty well understood maximum in deep learning that if you make the model bigger and you shove more data into it, assuming you train it right and you have a good model architecture, that you'll get a better model out."}, {"time": 7855, "text": "And so on one hand, GPT3 was not that surprising."}, {"time": 7859, "text": "On the other hand, a tremendous amount of engineering went into making it possible."}, {"time": 7864, "text": "The implications of it are pretty huge."}, {"time": 7867, "text": "I think that when GPT2 came out, there was a very provocative blog post from OpenAI talking about, we're not gonna release it because of the social damage it could cause if it's misused."}, {"time": 7878, "text": "I think that's still a concern."}, {"time": 7880, "text": "I think that we need to look at how technology is applied and well meaning tools can be applied in very horrible ways and they can have very profound impact on that."}, {"time": 7890, "text": "I think that GPT3 is a huge technical achievement."}, {"time": 7894, "text": "And what will GPT4 be?"}, {"time": 7895, "text": "Well, it'll probably be bigger, more expensive to train."}, {"time": 7898, "text": "Really cool architectural tricks."}, {"time": 7902, "text": "What do you think, is there, I don't know how much thought you've done on distributed computing."}, {"time": 7908, "text": "Is there some technical challenges that are interesting that you're hopeful about exploring in terms of a system that, like a piece of code that with GPT4 that might have, I don't know, hundreds of trillions of parameters which have to run on thousands of computers."}, {"time": 7931, "text": "Is there some hope that we can make that happen?"}, {"time": 7935, "text": "Yeah, well, I mean, today you can write a check and get access to a thousand TPU cores and do really interesting large scale training and inference and things like that in Google Cloud, for example, right?"}, {"time": 7947, "text": "And so I don't think it's a question about scale, it's a question about utility."}, {"time": 7953, "text": "And when I look at the transformer series of architectures that the GPT series is based on, it's really interesting to look at that because they're actually very simple designs."}, {"time": 7962, "text": "They're not recurrent."}, {"time": 7964, "text": "The training regimens are pretty simple."}, {"time": 7967, "text": "And so they don't really reflect like human brains, right?"}, {"time": 7971, "text": "But they're really good at learning language models and they're unrolled enough that you can simulate some recurrence, right?"}, {"time": 7979, "text": "And so the question I think about is, where does this take us?"}, {"time": 7983, "text": "Like, so we can just keep scaling it, have more parameters, more data, more things, we'll get a better result for sure."}, {"time": 7989, "text": "But are there architectural techniques that can lead to progress at a faster pace, right?"}, {"time": 7995, "text": "This is when, you know, how do you get, instead of just like making it a constant time bigger, how do you get like an algorithmic improvement out of this, right?"}, {"time": 8004, "text": "And whether it be a new training regimen, if it becomes sparse networks, for example, the human brain is sparse, all these networks are dense."}, {"time": 8013, "text": "The connectivity patterns can be very different."}, {"time": 8016, "text": "I think this is where I get very interested and I'm way out of my league on the deep learning side of this."}, {"time": 8021, "text": "But I think that could lead to big breakthroughs."}, {"time": 8023, "text": "When you talk about large scale networks, one of the things that Jeff Dean likes to talk about and he's given a few talks on is this idea of having a sparsely gated mixture of experts kind of a model where you have, you know, different nets that are trained and are really good at certain kinds of tasks."}, {"time": 8042, "text": "And so you have this distributor across a cluster and so you have a lot of different computers that end up being kind of locally specialized in different demands."}, {"time": 8049, "text": "And then when a query comes in, you gate it and you use learn techniques to route to different parts of the network."}, {"time": 8055, "text": "And then you utilize the compute resources of the entire cluster by having specialization within it."}, {"time": 8060, "text": "And I don't know where that goes or when it starts to work, but I think things like that could be really interesting as well."}, {"time": 8068, "text": "And on the data side too, if you can think of data selection as a kind of programming."}, {"time": 8076, "text": "I mean, essentially, if you look at it, like Karpathy talked about software 2.0, I mean, in a sense, data is the program."}, {"time": 8084, "text": "So let me try to summarize Andre's position really quick before I disagree with it."}, {"time": 8091, "text": "So Andre Karpathy is amazing."}, {"time": 8093, "text": "So this is nothing personal with him."}, {"time": 8095, "text": "He's an amazing engineer."}, {"time": 8097, "text": "And also a good blog post writer."}, {"time": 8099, "text": "Yeah, well, he's a great communicator."}, {"time": 8101, "text": "You know, he's just an amazing person."}, {"time": 8102, "text": "He's also really sweet."}, {"time": 8103, "text": "So his basic premise is that software is suboptimal."}, {"time": 8109, "text": "I think we can all agree to that."}, {"time": 8111, "text": "He also points out that deep learning and other learning based techniques are really great because you can solve problems in more structured ways with less like ad hoc code that people write out and don't write test cases for in some cases."}, {"time": 8125, "text": "And so they don't even know if it works in the first place."}, {"time": 8127, "text": "And so if you start replacing systems of imperative code with deep learning models, then you get a better result."}, {"time": 8138, "text": "And I think that he argues that software 2.0 is a pervasively learned set of models and you get away from writing code."}, {"time": 8145, "text": "And he's given talks where he talks about, you know, swapping over more and more and more parts of the code to being learned and driven that way."}, {"time": 8154, "text": "I think that works."}, {"time": 8156, "text": "And if you're predisposed to liking machine learning, then I think that that's definitely a good thing."}, {"time": 8161, "text": "I think this is also good for accessibility in many ways because certain people are not gonna write C code or something."}, {"time": 8167, "text": "And so having a data driven approach to do this kind of stuff, I think can be very valuable."}, {"time": 8172, "text": "On the other hand, there are huge trade offs."}, {"time": 8174, "text": "It's not clear to me that software 2.0 is the answer."}, {"time": 8179, "text": "And probably Andre wouldn't argue that it's the answer for every problem either."}, {"time": 8182, "text": "But I look at machine learning as not a replacement for software 1.0."}, {"time": 8187, "text": "I look at it as a new programming paradigm."}, {"time": 8190, "text": "And so programming paradigms, when you look across demands, is structured programming where you go from go tos to if, then, else, or functional programming from Lisp."}, {"time": 8202, "text": "And you start talking about higher order functions and values and things like this."}, {"time": 8205, "text": "Or you talk about object oriented programming."}, {"time": 8208, "text": "You're talking about encapsulation, subclassing, inheritance."}, {"time": 8210, "text": "You start talking about generic programming where you start talking about code reuse through specialization and different type instantiations."}, {"time": 8219, "text": "When you start talking about differentiable programming, something that I am very excited about in the context of machine learning, talking about taking functions and generating variants, like the derivative of another function."}, {"time": 8231, "text": "Like that's a programming paradigm that's very useful for solving certain classes of problems."}, {"time": 8236, "text": "Machine learning is amazing at solving certain classes of problems."}, {"time": 8239, "text": "Like you're not gonna write a cat detector or even a language translation system by writing C code."}, {"time": 8245, "text": "That's not a very productive way to do things anymore."}, {"time": 8248, "text": "And so machine learning is absolutely the right way to do that."}, {"time": 8251, "text": "In fact, I would say that learned models are really one of the best ways to work with the human world in general."}, {"time": 8258, "text": "And so anytime you're talking about sensory input of different modalities, anytime that you're talking about generating things in a way that makes sense to a human, I think that learned models are really, really useful."}, {"time": 8268, "text": "And that's because humans are very difficult to characterize, okay?"}, {"time": 8272, "text": "And so this is a very powerful paradigm for solving classes of problems."}, {"time": 8277, "text": "But on the other hand, imperative code is too."}, {"time": 8279, "text": "You're not gonna write a bootloader for your computer with a deep learning model."}, {"time": 8284, "text": "Deep learning models are very hardware intensive."}, {"time": 8287, "text": "They're very energy intensive because you have a lot of parameters and you can provably implement any function with a learned model, like this has been shown, but that doesn't make it efficient."}, {"time": 8300, "text": "And so if you're talking about caring about a few orders of magnitudes worth of energy usage, then it's useful to have other tools in the toolbox."}, {"time": 8306, "text": "There's also robustness too."}, {"time": 8308, "text": "I mean, as a... Yeah, exactly."}, {"time": 8310, "text": "All the problems of dealing with data and bias in data, all the problems of software 2.0."}, {"time": 8338, "text": "Well, what happens when I regress something?"}, {"time": 8339, "text": "What happens when I make a classification that's wrong and now I hurt somebody, right?"}, {"time": 8345, "text": "I mean, all these things you have to reason about."}, {"time": 8347, "text": "Yeah, but at the same time, the bootloader that works for us humans looks awfully a lot like a neural network, right?"}, {"time": 8356, "text": "It's messy and you can cut out different parts of the brain."}, {"time": 8359, "text": "There's a lot of this neuroplasticity work that shows that it's gonna adjust."}, {"time": 8364, "text": "It's a really interesting question, how much of the world's programming could be replaced by software 2.0?"}, {"time": 8371, "text": "Like with... Oh, well, I mean, it's provably true that you could replace all of it."}, {"time": 8377, "text": "Right, so then it's a question of the trade offs."}, {"time": 8379, "text": "Anything that's a function, you can."}, {"time": 8380, "text": "So it's not a question about if."}, {"time": 8382, "text": "I think it's a economic question."}, {"time": 8384, "text": "It's a, what kind of talent can you get?"}, {"time": 8387, "text": "What kind of trade offs in terms of maintenance, right?"}, {"time": 8390, "text": "Those kinds of questions, I think."}, {"time": 8391, "text": "What kind of data can you collect?"}, {"time": 8393, "text": "I think one of the reasons that I'm most interested in machine learning as a programming paradigm is that one of the things that we've seen across computing in general is that being laser focused on one paradigm often puts you in a box that's not super great."}, {"time": 8407, "text": "And so you look at object oriented programming, like it was all the rage in the early 80s and like everything has to be objects."}, {"time": 8413, "text": "And people forgot about functional programming even though it came first."}, {"time": 8417, "text": "And then people rediscovered that, hey, if you mix functional and object oriented in structure, like you mix these things together, you can provide very interesting tools that are good at solving different problems."}, {"time": 8428, "text": "And so the question there is how do you get the best way to solve the problems?"}, {"time": 8432, "text": "It's not about whose tribe should win, right?"}, {"time": 8436, "text": "It's not about, you know, that shouldn't be the question."}, {"time": 8438, "text": "The question is how do you make it so that people can solve those problems the fastest and they have the right tools in their box to build good libraries and they can solve these problems."}, {"time": 8447, "text": "And when you look at that, that's like, you know, you look at reinforcement learning as one really interesting subdomain of this."}, {"time": 8452, "text": "Reinforcement learning, often you have to have the integration of a learned model combined with your Atari or whatever the other scenario it is that you're working in."}, {"time": 8462, "text": "You have to combine that thing with the robot control for the arm, right?"}, {"time": 8467, "text": "And so now it's not just about that one paradigm, it's about integrating that with all the other systems that you have, including often legacy systems and things like this, right?"}, {"time": 8478, "text": "And so to me, I think that the interesting thing to say is like, how do you get the best out of this domain and how do you enable people to achieve things that they otherwise couldn't do without excluding all the good things we already know how to do?"}, {"time": 8491, "text": "Right, but okay, this is a crazy question, but we talked a little bit about GPT3, but do you think it's possible that these language models that in essence, in the language domain, Software 2.0 could replace some aspect of compilation, for example, or do program synthesis, replace some aspect of programming?"}, {"time": 8517, "text": "So I think that learned models in general are extremely powerful, and I think that people underestimate them."}, {"time": 8524, "text": "Maybe you can suggest what I should do."}, {"time": 8527, "text": "So if I have access to the GPT3 API, would I be able to generate Swift code, for example?"}, {"time": 8534, "text": "Do you think that could do something interesting and would work?"}, {"time": 8537, "text": "So GPT3 is probably not trained on the right corpus, so it probably has the ability to generate some Swift."}, {"time": 8543, "text": "I bet it does."}, {"time": 8545, "text": "It's probably not gonna generate a large enough body of Swift to be useful, but take it a next step further."}, {"time": 8550, "text": "Like if you had the goal of training something like GPT3 and you wanted to train it to generate source code, right?"}, {"time": 8558, "text": "It could definitely do that."}, {"time": 8559, "text": "Now the question is, how do you express the intent of what you want filled in?"}, {"time": 8564, "text": "You can definitely write scaffolding of code and say, fill in the hole, and sort of put in some for loops, or put in some classes or whatever."}, {"time": 8571, "text": "And the power of these models is impressive, but there's an unsolved question, at least unsolved to me, which is, how do I express the intent of what to fill in?"}, {"time": 8581, "text": "And kind of what you'd really want to have, and I don't know that these models are up to the task, is you wanna be able to say, here's the scaffolding, and here are the assertions at the end."}, {"time": 8592, "text": "And the assertions always pass."}, {"time": 8594, "text": "And so you want a generative model on the one hand, yes."}, {"time": 8596, "text": "Oh, that's fascinating, yeah."}, {"time": 8597, "text": "Right, but you also want some loop back, some reinforcement learning system or something, where you're actually saying like, I need to hill climb towards something that is more correct."}, {"time": 8608, "text": "And I don't know that we have that."}, {"time": 8609, "text": "So it would generate not only a bunch of the code, but like the checks that do the testing."}, {"time": 8615, "text": "It would generate the tests."}, {"time": 8617, "text": "I think the humans would generate the tests, right?"}, {"time": 8619, "text": "But it would be fascinating if... Well, the tests are the requirements."}, {"time": 8623, "text": "Yes, but the, okay, so... Because you have to express to the model what you want to... You don't just want gibberish code."}, {"time": 8629, "text": "Look at how compelling this code looks."}, {"time": 8631, "text": "You want a story about four horned unicorns or something."}, {"time": 8634, "text": "Well, okay, so exactly."}, {"time": 8635, "text": "But that's human requirements."}, {"time": 8637, "text": "But then I thought it's a compelling idea that the GPT4 model could generate checks that are more high fidelity that check for correctness."}, {"time": 8651, "text": "Because the code it generates, like say I ask it to generate a function that gives me the Fibonacci sequence."}, {"time": 8662, "text": "I don't like..."}, {"time": 8664, "text": "So decompose the problem, right?"}, {"time": 8665, "text": "So you have two things."}, {"time": 8666, "text": "You have, you need the ability to generate syntactically correct Swift code that's interesting, right?"}, {"time": 8673, "text": "I think GPT series of model architectures can do that."}, {"time": 8677, "text": "But then you need the ability to add the requirements."}, {"time": 8681, "text": "So generate Fibonacci."}, {"time": 8683, "text": "The human needs to express that goal."}, {"time": 8686, "text": "We don't have that language that I know of."}, {"time": 8689, "text": "No, I mean, it can generate stuff."}, {"time": 8690, "text": "Have you seen what GPT3 can generate?"}, {"time": 8692, "text": "You can say, I mean, there's a interface stuff like it can generate HTML."}, {"time": 8698, "text": "It can generate basic for loops that give you like..."}, {"time": 8702, "text": "Right, but pick HTML."}, {"time": 8702, "text": "How do I say I want google.com?"}, {"time": 8706, "text": "Well, no, you could say... Or not literally google.com."}, {"time": 8709, "text": "How do I say I want a webpage that's got a shopping cart and this and that?"}, {"time": 8713, "text": "It does that."}, {"time": 8714, "text": "I mean, so, okay."}, {"time": 8714, "text": "So just, I don't know if you've seen these demonstrations but you type in, I want a red button with the text that says hello."}, {"time": 8722, "text": "And you type that in natural language and it generates the correct HTML."}, {"time": 8726, "text": "I've done this demo."}, {"time": 8727, "text": "It's kind of compelling."}, {"time": 8729, "text": "So you have to prompt it with similar kinds of mappings."}, {"time": 8733, "text": "Of course, it's probably handpicked."}, {"time": 8735, "text": "I got to experiment that probably, but the fact that you can do that once even out of like 20 is quite impressive."}, {"time": 8743, "text": "Again, that's very basic."}, {"time": 8745, "text": "Like the HTML is kind of messy and bad."}, {"time": 8748, "text": "But yes, the intent is..."}, {"time": 8749, "text": "The idea is the intent is specified in natural language."}, {"time": 8753, "text": "Yeah, so I have not seen that."}, {"time": 8756, "text": "Yeah, but the question is the correctness of that."}, {"time": 8759, "text": "Like visually you can check, oh, the button is red, but for more complicated functions where the intent is harder to check."}, {"time": 8772, "text": "This goes into like NP completeness kind of things."}, {"time": 8775, "text": "Like I want to know that this code is correct and generates a giant thing that does some kind of calculation."}, {"time": 8783, "text": "It seems to be working."}, {"time": 8785, "text": "It's interesting to think like, should the system also try to generate checks for itself for correctness?"}, {"time": 8793, "text": "And this is way beyond my experience."}, {"time": 8795, "text": "The thing that I think about is that there doesn't seem to be a lot of equational reasoning going on."}, {"time": 8803, "text": "There's a lot of pattern matching and filling in and kind of propagating patterns that have been seen before into the future and into the generator result."}, {"time": 8810, "text": "And so if you want to get correctness, you kind of need theorem proving kind of things and like higher level logic."}, {"time": 8817, "text": "And I don't know that... You could talk to Jan about that and see what the bright minds are thinking about right now, but I don't think the GPT is in that vein."}, {"time": 8828, "text": "It's still really cool."}, {"time": 8829, "text": "Yeah, and surprisingly, who knows, maybe reasoning is... Is overrated."}, {"time": 8834, "text": "Yeah, is overrated."}, {"time": 8835, "text": "Right, I mean, do we reason?"}, {"time": 8838, "text": "How do you tell, right?"}, {"time": 8838, "text": "Are we just pattern matching based on what we have and then reverse justifying to ourselves?"}, {"time": 8842, "text": "Exactly, the reverse."}, {"time": 8844, "text": "So like I think what the neural networks are missing and I think GPT4 might have is to be able to tell stories to itself about what it did."}, {"time": 8853, "text": "Well, that's what humans do, right?"}, {"time": 8854, "text": "I mean, you talk about like network explainability, right?"}, {"time": 8858, "text": "And we give, no, that's a hard time about this, but humans don't know why we make decisions."}, {"time": 8862, "text": "We have this thing called intuition and then we try to like say, this feels like the right thing, but why, right?"}, {"time": 8867, "text": "And you wrestle with that when you're making hard decisions and is that science?"}, {"time": 8874, "text": "Let me ask you about a few high level questions, I guess."}, {"time": 8877, "text": "Because you've done a million things in your life and been very successful."}, {"time": 8884, "text": "A bunch of young folks listen to this, ask for advice from successful people like you."}, {"time": 8891, "text": "If you were to give advice to somebody, you know, another graduate student or some high school student about pursuing a career in computing or just advice about life in general, is there some words of wisdom you can give them?"}, {"time": 8908, "text": "So I think you come back to change and profound leaps happen because people are willing to believe that change is possible and that the world does change and are willing to do the hard thing that it takes to make change happen."}, {"time": 8922, "text": "And whether it be implementing a new programming language or employing a new system or employing a new research paper, designing a new thing, moving the world forward in science and philosophy, whatever, it really comes down to somebody who's willing to put in the work, right?"}, {"time": 8937, "text": "And you have, the work is hard for a whole bunch of different reasons."}, {"time": 8941, "text": "One of which is, it's work, right?"}, {"time": 8946, "text": "And so you have to have the space in your life in which you can do that work, which is why going to grad school can be a beautiful thing for certain people."}, {"time": 8954, "text": "But also there's a self doubt that happens."}, {"time": 8956, "text": "Like you're two years into a project, is it going anywhere, right?"}, {"time": 8960, "text": "Well, what do you do?"}, {"time": 8961, "text": "Do you just give up because it's hard?"}, {"time": 8963, "text": "No, no, I mean, some people like suffering."}, {"time": 8966, "text": "And so you plow through it."}, {"time": 8969, "text": "The secret to me is that you have to love what you're doing and follow that passion because when you get to the hard times, that's when, if you love what you're doing, you're willing to kind of push through."}, {"time": 8981, "text": "And this is really hard because it's hard to know what you will love doing until you start doing a lot of things."}, {"time": 8990, "text": "And so that's why I think that, particularly early in your career, it's good to experiment."}, {"time": 8994, "text": "Do a little bit of everything."}, {"time": 8995, "text": "Go take the survey class on the first half of every class in your upper division lessons and just get exposure to things because certain things will resonate with you and you'll find out, wow, I'm really good at this."}, {"time": 9008, "text": "I'm really smart at this."}, {"time": 9010, "text": "Well, it's just because it works with the way your brain."}, {"time": 9013, "text": "And when something jumps out, I mean, that's one of the things that people often ask about is like, well, I think there's a bunch of cool stuff out there."}, {"time": 9021, "text": "Like how do I pick the thing?"}, {"time": 9023, "text": "Like how do you hook, in your life, how did you just hook yourself in and stuck with it?"}, {"time": 9030, "text": "Well, I got lucky, right?"}, {"time": 9031, "text": "I mean, I think that many people forget that a huge amount of it or most of it is luck, right?"}, {"time": 9038, "text": "So let's not forget that."}, {"time": 9041, "text": "So for me, I fell in love with computers early on because they spoke to me, I guess."}, {"time": 9049, "text": "What language did they speak?"}, {"time": 9051, "text": "Basic, yeah."}, {"time": 9053, "text": "But then it was just kind of following a set of logical progressions, but also deciding that something that was hard was worth doing and a lot of fun, right?"}, {"time": 9064, "text": "And so I think that that is also something that's true for many other domains, which is if you find something that you love doing that's also hard, if you invest yourself in it and add value to the world, then it will mean something generally, right?"}, {"time": 9077, "text": "And again, that can be a research paper, that can be a software system, that can be a new robot, that can be, there's many things that that can be, but a lot of it is like real value comes from doing things that are hard."}, {"time": 9089, "text": "And that doesn't mean you have to suffer, but."}, {"time": 9094, "text": "I mean, you don't often hear that message."}, {"time": 9096, "text": "We talked about it last time a little bit, but it's one of my, not enough people talk about this."}, {"time": 9103, "text": "It's beautiful to hear a successful person."}, {"time": 9107, "text": "Well, and self doubt and imposter syndrome, these are all things that successful people suffer with as well, particularly when they put themselves in a point of being uncomfortable, which I like to do now and then just because it puts you in learning mode."}, {"time": 9122, "text": "Like if you wanna grow as a person, put yourself in a room with a bunch of people that know way more about whatever you're talking about than you do and ask dumb questions."}, {"time": 9131, "text": "And guess what?"}, {"time": 9133, "text": "Smart people love to teach often, not always, but often."}, {"time": 9136, "text": "And if you listen, if you're prepared to listen, if you're prepared to grow, if you're prepared to make connections, you can do some really interesting things."}, {"time": 9142, "text": "And I think a lot of progress is made by people who kind of hop between domains now and then, because they bring a perspective into a field that nobody else has, if people have only been working in that field themselves."}, {"time": 9158, "text": "We mentioned that the universe is kind of like a compiler."}, {"time": 9163, "text": "The entirety of it, the whole evolution is kind of a kind of compilation."}, {"time": 9166, "text": "Maybe us human beings are kind of compilers."}, {"time": 9171, "text": "Let me ask the old sort of question that I didn't ask you last time, which is what's the meaning of it all?"}, {"time": 9177, "text": "Is there a meaning?"}, {"time": 9178, "text": "Like if you asked a compiler why, what would a compiler say?"}, {"time": 9186, "text": "I'm prepared for it not to mean anything."}, {"time": 9189, "text": "Here we are, all biological things programmed to survive and propagate our DNA."}, {"time": 9199, "text": "And maybe the universe is just a computer and you just go until entropy takes over the universe and then you're done."}, {"time": 9207, "text": "I don't think that's a very productive way to live your life, if so."}, {"time": 9213, "text": "And so I prefer to bias towards the other way, which is saying the universe has a lot of value."}, {"time": 9217, "text": "And I take happiness out of other people."}, {"time": 9221, "text": "And a lot of times part of that's having kids, but also the relationships you build with other people."}, {"time": 9226, "text": "And so the way I try to live my life is like, what can I do that has value?"}, {"time": 9231, "text": "How can I move the world forward?"}, {"time": 9232, "text": "How can I take what I'm good at and bring it into the world?"}, {"time": 9237, "text": "And I'm one of these people that likes to work really hard and be very focused on the things that I do."}, {"time": 9243, "text": "And so if I'm gonna do that, how can it be in a domain that actually will matter?"}, {"time": 9248, "text": "Because a lot of things that we do, we find ourselves in the cycle of like, okay, I'm doing a thing."}, {"time": 9252, "text": "I'm very familiar with it."}, {"time": 9253, "text": "I've done it for a long time."}, {"time": 9255, "text": "I've never done anything else, but I'm not really learning, right?"}, {"time": 9259, "text": "I'm not really, I'm keeping things going, but there's a younger generation that can do the same thing, maybe even better than me, right?"}, {"time": 9266, "text": "Maybe if I actually step out of this and jump into something I'm less comfortable with, it's scary."}, {"time": 9272, "text": "But on the other hand, it gives somebody else a new opportunity."}, {"time": 9274, "text": "It also then puts you back in learning mode, and that can be really interesting."}, {"time": 9278, "text": "And one of the things I've learned is that when you go through that, that first you're deep into imposter syndrome, but when you start working your way out, you start to realize, hey, well, there's actually a method to this."}, {"time": 9289, "text": "And now I'm able to add new things because I bring different perspective."}, {"time": 9294, "text": "And this is one of the good things about bringing different kinds of people together."}, {"time": 9299, "text": "Diversity of thought is really important."}, {"time": 9301, "text": "And if you can pull together people that are coming at things from different directions, you often get innovation."}, {"time": 9307, "text": "And I love to see that, that aha moment where you're like, oh, we've really cracked this."}, {"time": 9312, "text": "This is something nobody's ever done before."}, {"time": 9315, "text": "And then if you can do it in the context where it adds value, other people can build on it, it helps move the world, then that's what really excites me."}, {"time": 9322, "text": "So that kind of description of the magic of the human experience, do you think we'll ever create that in an AGI system?"}, {"time": 9329, "text": "Do you think we'll be able to create, give AI systems a sense of meaning where they operate in this kind of world exactly in the way you've described, which is they interact with each other, they interact with us humans."}, {"time": 9345, "text": "Well, so, I mean, why are you being so a speciest, right?"}, {"time": 9350, "text": "All right, so AGI versus Bionets, or something like that versus biology, right?"}, {"time": 9357, "text": "You know, what are we but machines, right?"}, {"time": 9360, "text": "We're just programmed to run our, we have our objective function that we were optimized for, right?"}, {"time": 9366, "text": "And so we're doing our thing, we think we have purpose, but do we really, right?"}, {"time": 9370, "text": "I'm not prepared to say that those newfangled AGI's have no soul just because we don't understand them, right?"}, {"time": 9376, "text": "And I think that would be, when they exist, that would be very premature to look at a new thing through your own lens without fully understanding it."}, {"time": 9388, "text": "You might be just saying that because AI systems in the future will be listening to this and then."}, {"time": 9393, "text": "Oh yeah, exactly."}, {"time": 9394, "text": "You don't wanna say anything."}, {"time": 9394, "text": "Please be nice to me, you know, when Skynet kills everybody, please spare me."}, {"time": 9399, "text": "So wise look ahead thinking."}, {"time": 9402, "text": "Yeah, but I mean, I think that people will spend a lot of time worrying about this kind of stuff, and I think that what we should be worrying about is how do we make the world better?"}, {"time": 9409, "text": "And the thing that I'm most scared about with AGI's is not that necessarily the Skynet will start shooting everybody with lasers and stuff like that to use us for our calories."}, {"time": 9423, "text": "The thing that I'm worried about is that humanity, I think, needs a challenge."}, {"time": 9453, "text": "And I think that this would lead to a rise of the worst part of people, right?"}, {"time": 9459, "text": "Instead of people striving together and trying to make the world better, it could degrade into a very unpleasant world."}, {"time": 9471, "text": "I mean, we hopefully have a long ways to go before we discover that."}, {"time": 9474, "text": "And fortunately, we have pretty on the ground problems with the pandemic right now, and so I think we should be focused on that as well."}]}]