[{"title": "Peter Singer: Suffering in Humans, Animals, and AI | Lex Fridman Podcast #107", "id": "llh-2pqSGrs", "quotes": [{"time": 365, "text": "World War II has deep roots in the culture and the suffering that the war brought the millions of people who died is in the music, is in the literature, is in the culture."}, {"time": 376, "text": "What do you think was the impact of the war broadly on our society?"}, {"time": 385, "text": "The war had many impacts."}, {"time": 388, "text": "I think one of them, a beneficial impact, is that it showed what racism and authoritarian government can do and at least as far as the West was concerned, I think that meant that I grew up in an era in which there wasn't the kind of overt racism and antisemitism that had existed for my parents in Europe."}, {"time": 412, "text": "I was growing up in Australia and certainly that was clearly seen as something completely unacceptable."}, {"time": 420, "text": "There was also, though, a fear of a further outbreak of war which this time we expected would be nuclear because of the way the Second World War had ended, so there was this overshadowing of my childhood about the possibility that I would not live to grow up and be an adult because of a catastrophic nuclear war."}, {"time": 445, "text": "The film On the Beach was made in which the city that I was living, Melbourne, was the last place on Earth to have living human beings because of the nuclear cloud that was spreading from the North, so that certainly gave us a bit of that sense."}, {"time": 462, "text": "There were many, there were clearly many other legacies that we got of the war as well and the whole setup of the world and the Cold War that followed."}, {"time": 471, "text": "All of that has its roots in the Second World War."}, {"time": 475, "text": "There is much beauty that comes from war."}, {"time": 478, "text": "Sort of, I had a conversation with Eric Weinstein."}, {"time": 481, "text": "He said everything is great about war except all the death and suffering."}, {"time": 488, "text": "Do you think there's something positive that came from the war, the mirror that it put to our society, sort of the ripple effects on it, ethically speaking?"}, {"time": 500, "text": "Do you think there are positive aspects to war?"}, {"time": 504, "text": "I find it hard to see positive aspects in war and some of the things that other people think of as positive and beautiful may be questioning."}, {"time": 515, "text": "So there's a certain kind of patriotism."}, {"time": 518, "text": "People say during wartime, we all pull together, we all work together against a common enemy and that's true."}, {"time": 525, "text": "An outside enemy does unite a country and in general, it's good for countries to be united and have common purposes but it also engenders a kind of a nationalism and a patriotism that can't be questioned and that I'm more skeptical about."}, {"time": 541, "text": "What about the brotherhood that people talk about from soldiers?"}, {"time": 548, "text": "The sort of counterintuitive, sad idea that the closest that people feel to each other is in those moments of suffering, of being at the sort of the edge of seeing your comrades dying in your arms."}, {"time": 564, "text": "That somehow brings people extremely closely together."}, {"time": 567, "text": "Suffering brings people closer together."}, {"time": 571, "text": "It may bring people close together but there are other ways of bonding and being close to people I think without the suffering and death that war entails."}, {"time": 582, "text": "Perhaps you could see, you could already hear the romanticized Russian in me."}, {"time": 588, "text": "We tend to romanticize suffering just a little bit in our literature and culture and so on."}, {"time": 593, "text": "Could you take a step back and I apologize if it's a ridiculous question but what is suffering?"}, {"time": 599, "text": "If you would try to define what suffering is, how would you go about it?"}, {"time": 605, "text": "Suffering is a conscious state."}, {"time": 609, "text": "There can be no suffering for a being who is completely unconscious and it's distinguished from other conscious states in terms of being one that considered just in itself."}, {"time": 622, "text": "We would rather be without."}, {"time": 625, "text": "It's a conscious state that we want to stop if we're experiencing or we want to avoid having again if we've experienced it in the past."}, {"time": 634, "text": "And that's, as I say, emphasized for its own sake because of course people will say, well, suffering strengthens the spirit."}, {"time": 641, "text": "It has good consequences."}, {"time": 644, "text": "And sometimes it does have those consequences and of course sometimes we might undergo suffering."}, {"time": 650, "text": "We set ourselves a challenge to run a marathon or climb a mountain or even just to go to the dentist so that the toothache doesn't get worse even though we know the dentist is gonna hurt us to some extent."}, {"time": 661, "text": "So I'm not saying that we never choose suffering but I am saying that other things being equal, we would rather not be in that state of consciousness."}, {"time": 670, "text": "Is the ultimate goal sort of, you have the new 10 year anniversary release of the Life You Can Save book, really influential book."}, {"time": 678, "text": "We'll talk about it a bunch of times throughout this conversation but do you think it's possible to eradicate suffering or is that the goal or do we want to achieve a kind of minimum threshold of suffering and then keeping a little drop of poison to keep things interesting in the world?"}, {"time": 706, "text": "In practice, I don't think we ever will eliminate suffering so I think that little drop of poison as you put it or if you like the contrasting dash of an unpleasant color perhaps something like that in a otherwise harmonious and beautiful composition, that is gonna always be there."}, {"time": 727, "text": "If you ask me whether in theory if we could get rid of it, we should."}, {"time": 732, "text": "I think the answer is whether in fact we would be better off or whether in terms of by eliminating the suffering we would also eliminate some of the highs, the positive highs and if that's so then we might be prepared to say it's worth having a minimum of suffering in order to have the best possible experiences as well."}, {"time": 754, "text": "Is there a relative aspect to suffering?"}, {"time": 757, "text": "So when you talk about eradicating poverty in the world, is this the more you succeed, the more the bar of what defines poverty raises or is there at the basic human ethical level a bar that's absolute that once you get above it then we can morally converge to feeling like we have eradicated poverty?"}, {"time": 784, "text": "I think they're both and I think this is true for poverty as well as suffering."}, {"time": 789, "text": "There's an objective level of suffering or of poverty where we're talking about objective indicators like you're constantly hungry, you can't get enough food, you're constantly cold, you can't get warm, you have some physical pains that you're never rid of."}, {"time": 841, "text": "So now they're bored, they lack a sense of purpose."}, {"time": 845, "text": "That can happen."}, {"time": 846, "text": "And that then is a kind of a relative suffering that is distinct from the objective forms of suffering."}, {"time": 854, "text": "But in your focus on eradicating suffering, you don't think about that kind of, the kind of interesting challenges and suffering that emerges in affluent societies, that's just not, in your ethical philosophical brain, is that of interest at all?"}, {"time": 871, "text": "It would be of interest to me if we had eliminated all of the objective forms of suffering, which I think of as generally more severe and also perhaps easier at this stage anyway to know how to eliminate."}, {"time": 885, "text": "So yes, in some future state when we've eliminated those objective forms of suffering, I would be interested in trying to eliminate the relative forms as well."}, {"time": 895, "text": "But that's not a practical need for me at the moment."}, {"time": 899, "text": "Sorry to linger on it because you kind of said it, but just is elimination the goal for the affluent society?"}, {"time": 907, "text": "So is there, do you see suffering as a creative force?"}, {"time": 914, "text": "Suffering can be a creative force."}, {"time": 917, "text": "I think repeating what I said about the highs and whether we need some of the lows to experience the highs."}, {"time": 924, "text": "So it may be that suffering makes us more creative and we regard that as worthwhile."}, {"time": 929, "text": "Maybe that brings some of those highs with it that we would not have had if we'd had no suffering."}, {"time": 936, "text": "I don't really know."}, {"time": 937, "text": "Many people have suggested that and I certainly can't have no basis for denying it."}, {"time": 944, "text": "And if it's true, then I would not want to eliminate suffering completely."}, {"time": 950, "text": "But the focus is on the absolute, not to be cold, not to be hungry."}, {"time": 956, "text": "Yes, that's at the present stage of where the world's population is, that's the focus."}, {"time": 963, "text": "Talking about human nature for a second, do you think people are inherently good or do we all have good and evil in us that basically everyone is capable of evil based on the environment?"}, {"time": 977, "text": "Certainly most of us have potential for both good and evil."}, {"time": 981, "text": "I'm not prepared to say that everyone is capable of evil."}, {"time": 984, "text": "Maybe some people who even in the worst of circumstances would not be capable of it, but most of us are very susceptible to environmental influences."}, {"time": 994, "text": "So when we look at things that we were talking about previously, let's say what the Nazis did during the Holocaust, I think it's quite difficult to say, I know that I would not have done those things even if I were in the same circumstances as those who did them."}, {"time": 1014, "text": "Even if let's say I had grown up under the Nazi regime and had been indoctrinated with racist ideas, had also had the idea that I must obey orders, follow the commands of the Fuhrer, plus of course perhaps the threat that if I didn't do certain things, I might get sent to the Russian front and that would be a pretty grim fate."}, {"time": 1039, "text": "I think it's really hard for anybody to say, nevertheless, I know I would not have killed those Jews or whatever else it was that they were."}, {"time": 1049, "text": "How many people will be able to say that?"}, {"time": 1052, "text": "Truly to be able to say it, I think very few, less than 10%."}, {"time": 1057, "text": "To me, it seems a very interesting and powerful thing to meditate on."}, {"time": 1062, "text": "So I've read a lot about the war, World War II, and I can't escape the thought that I would have not been one of the 10%."}, {"time": 1071, "text": "Right, I have to say, I simply don't know."}, {"time": 1075, "text": "I would like to hope that I would have been one of the 10%, but I don't really have any basis for claiming that I would have been different from the majority."}, {"time": 1086, "text": "Is it a worthwhile thing to contemplate?"}, {"time": 1089, "text": "It would be interesting if we could find a way of really finding these answers."}, {"time": 1093, "text": "There obviously is quite a bit of research on people during the Holocaust, on how ordinary Germans got led to do terrible things, and there are also studies of the resistance, some heroic people in the White Rose group, for example, who resisted even though they knew they were likely to die for it."}, {"time": 1117, "text": "But I don't know whether these studies really can answer your larger question of how many people would have been capable of doing that."}, {"time": 1158, "text": "And that kind of thought exercise is helpful to understand what is the right thing in my current skill set and the capacity to do."}, {"time": 1167, "text": "Sort of there's things that are convenient, and I wonder if there are things that are highly inconvenient, where I would have to experience derision, or hatred, or death, or all those kinds of things, but it's truly the right thing to do."}, {"time": 1181, "text": "And that kind of balance is, I feel like in America, we don't have, it's difficult to think in the current times, it seems easier to put yourself back in history, where you can sort of objectively contemplate whether, how willing you are to do the right thing when the cost is high."}, {"time": 1203, "text": "True, but I think we do face those challenges today, and I think we can still ask ourselves those questions."}, {"time": 1209, "text": "So one stand that I took more than 40 years ago now was to stop eating meat, become a vegetarian at a time when you hardly met anybody who was a vegetarian, or if you did, they might've been a Hindu, or they might've had some weird theories about meat and health."}, {"time": 1230, "text": "And I know thinking about making that decision, I was convinced that it was the right thing to do, but I still did have to think, are all my friends gonna think that I'm a crank because I'm now refusing to eat meat?"}, {"time": 1243, "text": "So I'm not saying there were any terrible sanctions, obviously, but I thought about that, and I guess I decided, well, I still think this is the right thing to do, and I'll put up with that if it happens."}, {"time": 1256, "text": "And one or two friends were clearly uncomfortable with that decision, but that was pretty minor compared to the historical examples that we've been talking about."}, {"time": 1268, "text": "But other issues that we have around too, like global poverty and what we ought to be doing about that is another question where people, I think, can have the opportunity to take a stand on what's the right thing to do now."}, {"time": 1281, "text": "Climate change would be a third question where, again, people are taking a stand."}, {"time": 1285, "text": "I can look at Greta Thunberg there and say, well, I think it must've taken a lot of courage for a schoolgirl to say, I'm gonna go on strike about climate change and see what happens."}, {"time": 1301, "text": "Yeah, especially in this divisive world, she gets exceptionally huge amounts of support and hatred, both."}, {"time": 1308, "text": "Which is very difficult for a teenager to operate in."}, {"time": 1313, "text": "In your book, Ethics in the Real World, amazing book, people should check it out."}, {"time": 1317, "text": "Very easy read."}, {"time": 1319, "text": "82 brief essays on things that matter."}, {"time": 1322, "text": "One of the essays asks, should robots have rights?"}, {"time": 1326, "text": "You've written about this, so let me ask, should robots have rights?"}, {"time": 1331, "text": "If we ever develop robots capable of consciousness, capable of having their own internal perspective on what's happening to them so that their lives can go well or badly for them, then robots should have rights."}, {"time": 1347, "text": "Until that happens, they shouldn't."}, {"time": 1351, "text": "So is consciousness essentially a prerequisite to suffering?"}, {"time": 1356, "text": "So everything that possesses consciousness is capable of suffering, put another way."}, {"time": 1363, "text": "And if so, what is consciousness?"}, {"time": 1368, "text": "I certainly think that consciousness is a prerequisite for suffering."}, {"time": 1373, "text": "You can't suffer if you're not conscious."}, {"time": 1378, "text": "But is it true that every being that is conscious will suffer or has to be capable of suffering?"}, {"time": 1385, "text": "I suppose you could imagine a kind of consciousness, especially if we can construct it artificially, that's capable of experiencing pleasure but just automatically cuts out the consciousness when they're suffering."}, {"time": 1398, "text": "So they're like an instant anesthesia as soon as something is gonna cause you suffering."}, {"time": 1402, "text": "So that's possible."}, {"time": 1405, "text": "But doesn't exist as far as we know on this planet yet."}, {"time": 1411, "text": "You asked what is consciousness."}, {"time": 1414, "text": "Philosophers often talk about it as there being a subject of experiences."}, {"time": 1419, "text": "So you and I and everybody listening to this is a subject of experience."}, {"time": 1424, "text": "There is a conscious subject who is taking things in, responding to it in various ways, feeling good about it, feeling bad about it."}, {"time": 1434, "text": "And that's different from the kinds of artificial intelligence we have now."}, {"time": 1440, "text": "I take out my phone."}, {"time": 1443, "text": "I ask Google directions to where I'm going."}, {"time": 1446, "text": "Google gives me the directions and I choose to take a different way."}, {"time": 1450, "text": "Google doesn't care."}, {"time": 1451, "text": "It's not like I'm offending Google or anything like that."}, {"time": 1454, "text": "There is no subject of experiences there."}, {"time": 1456, "text": "And I think that's the indication that Google AI we have now is not conscious or at least that level of AI is not conscious."}, {"time": 1467, "text": "And that's the way to think about it."}, {"time": 1468, "text": "Now, it may be difficult to tell, of course, whether a certain AI is or isn't conscious."}, {"time": 1474, "text": "It may mimic consciousness and we can't tell if it's only mimicking it or if it's the real thing."}, {"time": 1479, "text": "But that's what we're looking for."}, {"time": 1480, "text": "Is there a subject of experience, a perspective on the world from which things can go well or badly from that perspective?"}, {"time": 1490, "text": "So our idea of what suffering looks like comes from just watching ourselves when we're in pain."}, {"time": 1501, "text": "Or when we're experiencing pleasure, it's not only."}, {"time": 1503, "text": "Pleasure and pain."}, {"time": 1504, "text": "Yes, so and then you could actually, you could push back on us, but I would say that's how we kind of build an intuition about animals is we can infer the similarities between humans and animals and so infer that they're suffering or not based on certain things and they're conscious or not."}, {"time": 1524, "text": "So what if robots, you mentioned Google Maps and I've done this experiment."}, {"time": 1532, "text": "So I work in robotics just for my own self or I have several Roomba robots and I play with different speech interaction, voice based interaction."}, {"time": 1542, "text": "And if the Roomba or the robot or Google Maps shows any signs of pain, like screaming or moaning or being displeased by something you've done, that in my mind, I can't help but immediately upgrade it."}, {"time": 1559, "text": "And even when I myself programmed it in, just having another entity that's now for the moment disjoint from me showing signs of pain makes me feel like it is conscious."}, {"time": 1571, "text": "Like I immediately, then the whatever, I immediately realize that it's not obviously, but that feeling is there."}, {"time": 1579, "text": "So sort of, I guess, what do you think about a world where Google Maps and Roombas are pretending to be conscious and we descendants of apes are not smart enough to realize they're not or whatever, or that is conscious, they appear to be conscious."}, {"time": 1600, "text": "And so you then have to give them rights."}, {"time": 1604, "text": "The reason I'm asking that is that kind of capability may be closer than we realize."}, {"time": 1612, "text": "Yes, that kind of capability may be closer, but I don't think it follows that we have to give them rights."}, {"time": 1620, "text": "I suppose the argument for saying that in those circumstances we should give them rights is that if we don't, we'll harden ourselves against other beings who are not robots and who really do suffer."}, {"time": 1635, "text": "That's a possibility that, you know, if we get used to looking at a being suffering and saying, yeah, we don't have to do anything about that, that being doesn't have any rights, maybe we'll feel the same about animals, for instance."}, {"time": 1686, "text": "But you don't accept that kind of."}, {"time": 1687, "text": "I don't accept that as the basis of the argument for why we shouldn't be cruel to animals."}, {"time": 1691, "text": "I think the basis of the argument for why we shouldn't be cruel to animals is just that we're inflicting suffering on them and the suffering is a bad thing."}, {"time": 1699, "text": "But possibly I might accept some sort of parallel of that argument as a reason why you shouldn't be cruel to these robots that mimic the symptoms of pain if it's gonna be harder for us to distinguish."}, {"time": 1713, "text": "I would venture to say, I'd like to disagree with you and with most people, I think, at the risk of sounding crazy, I would like to say that if that Roomba is dedicated to faking the consciousness and the suffering, I think it will be impossible for us."}, {"time": 1735, "text": "I would like to apply the same argument as with animals to robots, that they deserve rights in that sense."}, {"time": 1742, "text": "Now we might outlaw the addition of those kinds of features into Roombas, but once you do, I think I'm quite surprised by the upgrade in consciousness that the display of suffering creates."}, {"time": 1760, "text": "It's a totally open world, but I'd like to just sort of the difference between animals and other humans is that in the robot case, we've added it in ourselves."}, {"time": 1772, "text": "Therefore, we can say something about how real it is."}, {"time": 1777, "text": "But I would like to say that the display of it is what makes it real."}, {"time": 1781, "text": "And I'm not a philosopher, I'm not making that argument, but I'd at least like to add that as a possibility."}, {"time": 1789, "text": "And I've been surprised by it is all I'm trying to sort of articulate poorly, I suppose."}, {"time": 1795, "text": "So there is a philosophical view has been held about humans, which is rather like what you're talking about, and that's behaviorism."}, {"time": 1804, "text": "So behaviorism was employed both in psychology, people like BF Skinner was a famous behaviorist, but in psychology, it was more a kind of a, what is it that makes this science?"}, {"time": 1816, "text": "Well, you need to have behavior because that's what you can observe, you can't observe consciousness."}, {"time": 1848, "text": "So that's what it is to be in pain, and you point to the behavior."}, {"time": 1854, "text": "And Norman Malcolm, who was another philosopher in the school from Cornell, had the view that, so what is it to dream?"}, {"time": 1864, "text": "After all, we can't see other people's dreams."}, {"time": 1867, "text": "Well, when people wake up and say, I've just had a dream of, here I was, undressed, walking down the main street or whatever it is you've dreamt, that's what it is to have a dream."}, {"time": 1879, "text": "It's basically to wake up and recall something."}, {"time": 1882, "text": "So you could apply this to what you're talking about and say, so what it is to be in pain is to exhibit these symptoms of pain behavior, and therefore, these robots are in pain."}, {"time": 1894, "text": "That's what the word means."}, {"time": 1896, "text": "But nowadays, not many people think that Ryle's kind of philosophical behaviorism is really very plausible, so I think they would say the same about your view."}, {"time": 1905, "text": "So, yes, I just spoke with Noam Chomsky, who basically was part of dismantling the behaviorist movement."}, {"time": 1914, "text": "But, and I'm with that 100% for studying human behavior, but I am one of the few people in the world who has made Roombas scream in pain."}, {"time": 1929, "text": "And I just don't know what to do with that empirical evidence, because it's hard, sort of philosophically, I agree."}, {"time": 1939, "text": "But the only reason I philosophically agree in that case is because I was the programmer."}, {"time": 1945, "text": "But if somebody else was a programmer, I'm not sure I would be able to interpret that well."}, {"time": 1949, "text": "So I think it's a new world that I was just curious what your thoughts are."}, {"time": 1957, "text": "For now, you feel that the display of what we can kind of intellectually say is a fake display of suffering is not suffering."}, {"time": 1970, "text": "That's right, that would be my view."}, {"time": 1973, "text": "But that's consistent, of course, with the idea that it's part of our nature to respond to this display if it's reasonably authentically done."}, {"time": 1982, "text": "And therefore it's understandable that people would feel this, and maybe, as I said, it's even a good thing that they do feel it, and you wouldn't want to harden yourself against it because then you might harden yourself against being sort of really suffering."}, {"time": 2028, "text": "That there's a feeling, there's another entity there that's self aware, that has a fear of death, a mortality, that has awareness of itself that we kind of associate with other living creatures."}, {"time": 2043, "text": "I guess I'm sort of trying to do the slippery slope from the very naive thing where I started into something where it's sufficiently a black box to where it's starting to feel like it's conscious."}, {"time": 2056, "text": "Where's that threshold where you would start getting uncomfortable with the idea of robot suffering, do you think?"}, {"time": 2065, "text": "I don't know enough about the programming that we're going to this really to answer this question."}, {"time": 2071, "text": "But I presume that somebody who does know more about this could look at the program and see whether we can explain the behaviors in a parsimonious way that doesn't require us to suggest that some sort of consciousness has emerged."}, {"time": 2090, "text": "Or alternatively, whether you're in a situation where you say, I don't know how this is happening, the program does generate a kind of artificial general intelligence which is autonomous, starts to do things itself and is autonomous of the basics programming that set it up."}, {"time": 2110, "text": "And so it's quite possible that actually we have achieved consciousness in a system of artificial intelligence."}, {"time": 2118, "text": "Sort of the approach that I work with, most of the community is really excited about now is with learning methods, so machine learning."}, {"time": 2126, "text": "And the learning methods are unfortunately are not capable of revealing, which is why somebody like Noam Chomsky criticizes them."}, {"time": 2134, "text": "You create powerful systems that are able to do certain things without understanding the theory, the physics, the science of how it works."}, {"time": 2142, "text": "And so it's possible if those are the kinds of methods that succeed, we won't be able to know exactly, sort of try to reduce, try to find whether this thing is conscious or not, this thing is intelligent or not."}, {"time": 2158, "text": "It's simply giving, when we talk to it, it displays wit and humor and cleverness and emotion and fear, and then we won't be able to say where in the billions of nodes, neurons in this artificial neural network is the fear coming from."}, {"time": 2180, "text": "So in that case, that's a really interesting place where we do now start to return to behaviorism and say."}, {"time": 2188, "text": "Yeah, that is an interesting issue."}, {"time": 2193, "text": "I would say that if we have serious doubts and think it might be conscious, then we ought to try to give it the benefit of the doubt, just as I would say with animals."}, {"time": 2205, "text": "I think we can be highly confident that vertebrates are conscious, but when we get down, and some invertebrates like the octopus, but with insects, it's much harder to be confident of that."}, {"time": 2221, "text": "I think we should give them the benefit of the doubt where we can, which means, I think it would be wrong to torture an insect, but it doesn't necessarily mean it's wrong to slap a mosquito that's about to bite you and stop you getting to sleep."}, {"time": 2236, "text": "So I think you try to achieve some balance in these circumstances of uncertainty."}, {"time": 2242, "text": "If it's okay with you, if we can go back just briefly."}, {"time": 2246, "text": "So 44 years ago, like you mentioned, 40 plus years ago, you've written Animal Liberation, the classic book that started, that launched, that was the foundation of the movement of Animal Liberation."}, {"time": 2260, "text": "Can you summarize the key set of ideas that underpin that book?"}, {"time": 2264, "text": "Certainly, the key idea that underlies that book is the concept of speciesism, which I did not invent that term."}, {"time": 2274, "text": "I took it from a man called Richard Rider, who was in Oxford when I was, and I saw a pamphlet that he'd written about experiments on chimpanzees that used that term."}, {"time": 2285, "text": "But I think I contributed to making it philosophically more precise and to getting it into a broader audience."}, {"time": 2292, "text": "And the idea is that we have a bias or a prejudice against taking seriously the interests of beings who are not members of our species."}, {"time": 2303, "text": "Just as in the past, Europeans, for example, had a bias against taking seriously the interests of Africans, racism."}, {"time": 2311, "text": "And men have had a bias against taking seriously the interests of women, sexism."}, {"time": 2317, "text": "So I think something analogous, not completely identical, but something analogous goes on and has gone on for a very long time with the way humans see themselves vis a vis animals."}, {"time": 2330, "text": "We see ourselves as more important."}, {"time": 2335, "text": "We see animals as existing to serve our needs in various ways."}, {"time": 2339, "text": "And you're gonna find this very explicit in earlier philosophers from Aristotle through to Kant and others."}, {"time": 2347, "text": "And either we don't need to take their interests into account at all, or we can discount it because they're not humans."}, {"time": 2357, "text": "They can a little bit, but they don't count nearly as much as humans do."}, {"time": 2362, "text": "My book argues that that attitude is responsible for a lot of the things that we do to animals that are wrong, confining them indoors in very crowded, cramped conditions in factory farms to produce meat or eggs or milk more cheaply, using them in some research that's by no means essential for survival or wellbeing, and a whole lot, some of the sports and things that we do to animals."}, {"time": 2392, "text": "So I think that's unjustified because I think the significance of pain and suffering does not depend on the species of the being who is in pain or suffering any more than it depends on the race or sex of the being who is in pain or suffering."}, {"time": 2411, "text": "And I think we ought to rethink our treatment of animals along the lines of saying, if the pain is just as great in an animal, then it's just as bad that it happens as if it were a human."}, {"time": 2423, "text": "Maybe if I could ask, I apologize, hopefully it's not a ridiculous question, but so as far as we know, we cannot communicate with animals through natural language, but we would be able to communicate with robots."}, {"time": 2440, "text": "So I'm returning to sort of a small parallel between perhaps animals and the future of AI."}, {"time": 2446, "text": "If we do create an AGI system or as we approach creating that AGI system, what kind of questions would you ask her to try to intuit whether there is consciousness or more importantly, whether there's capacity to suffer?"}, {"time": 2472, "text": "I might ask the AGI what she was feeling or does she have feelings?"}, {"time": 2479, "text": "And if she says yes, to describe those feelings, to describe what they were like, to see what the phenomenal account of consciousness is like."}, {"time": 2490, "text": "That's one question."}, {"time": 2493, "text": "I might also try to find out if the AGI has a sense of itself."}, {"time": 2501, "text": "So for example, the idea would you, we often ask people, so suppose you were in a car accident and your brain were transplanted into someone else's body, do you think you would survive or would it be the person whose body was still surviving, your body having been destroyed?"}, {"time": 2518, "text": "And most people say, I think I would, if my brain was transplanted along with my memories and so on, I would survive."}, {"time": 2524, "text": "So we could ask AGI those kinds of questions."}, {"time": 2527, "text": "If they were transferred to a different piece of hardware, would they survive?"}, {"time": 2532, "text": "What would survive?"}, {"time": 2533, "text": "And get at that sort of concept."}, {"time": 2535, "text": "Sort of on that line, another perhaps absurd question, but do you think having a body is necessary for consciousness?"}, {"time": 2544, "text": "So do you think digital beings can suffer?"}, {"time": 2551, "text": "Presumably digital beings need to be running on some kind of hardware, right?"}, {"time": 2556, "text": "Yeah, that ultimately boils down to, but this is exactly what you just said, is moving the brain from one place to another."}, {"time": 2562, "text": "So you could move it to a different kind of hardware."}, {"time": 2564, "text": "And I could say, look, your hardware is getting worn out."}, {"time": 2569, "text": "We're going to transfer you to a fresh piece of hardware."}, {"time": 2572, "text": "So we're gonna shut you down for a time, but don't worry, you'll be running very soon on a nice fresh piece of hardware."}, {"time": 2580, "text": "And you could imagine this conscious AGI saying, that's fine, I don't mind having a little rest."}, {"time": 2585, "text": "Just make sure you don't lose me or something like that."}, {"time": 2588, "text": "Yeah, I mean, that's an interesting thought that even with us humans, the suffering is in the software."}, {"time": 2594, "text": "We right now don't know how to repair the hardware, but we're getting better at it and better in the idea."}, {"time": 2603, "text": "I mean, some people dream about one day being able to transfer certain aspects of the software to another piece of hardware."}, {"time": 2613, "text": "What do you think, just on that topic, there's been a lot of exciting innovation in brain computer interfaces."}, {"time": 2622, "text": "I don't know if you're familiar with the companies like Neuralink, with Elon Musk, communicating both ways from a computer, being able to send, activate neurons and being able to read spikes from neurons."}, {"time": 2634, "text": "With the dream of being able to expand, sort of increase the bandwidth at which your brain can like look up articles on Wikipedia kind of thing, sort of expand the knowledge capacity of the brain."}, {"time": 2648, "text": "Do you think that notion, is that interesting to you as the expansion of the human mind?"}, {"time": 2655, "text": "Yes, that's very interesting."}, {"time": 2657, "text": "I'd love to be able to have that increased bandwidth."}, {"time": 2660, "text": "And I want better access to my memory, I have to say too, as I get older, I talk to my wife about things that we did 20 years ago or something."}, {"time": 2670, "text": "Her memory is often better about particular events."}, {"time": 2672, "text": "Where were we?"}, {"time": 2673, "text": "Who was at that event?"}, {"time": 2675, "text": "What did he or she wear even?"}, {"time": 2676, "text": "She may know and I have not the faintest idea about this, but perhaps it's somewhere in my memory."}, {"time": 2680, "text": "And if I had this extended memory, I could search that particular year and rerun those things."}, {"time": 2686, "text": "I think that would be great."}, {"time": 2689, "text": "In some sense, we already have that by storing so much of our data online, like pictures of different events."}, {"time": 2694, "text": "Yes, well, Gmail is fantastic for that because people email me as if they know me well and I haven't got a clue who they are, but then I search for their name."}, {"time": 2702, "text": "Ah yes, they emailed me in 2007 and I know who they are now."}, {"time": 2707, "text": "Yeah, so we're taking the first steps already."}, {"time": 2711, "text": "So on the flip side of AI, people like Stuart Russell and others focus on the control problem, value alignment in AI, which is the problem of making sure we build systems that align to our own values, our ethics."}, {"time": 2725, "text": "Do you think sort of high level, how do we go about building systems?"}, {"time": 2731, "text": "Do you think is it possible that align with our values, align with our human ethics or living being ethics?"}, {"time": 2739, "text": "Presumably, it's possible to do that."}, {"time": 2743, "text": "I know that a lot of people who think that there's a real danger that we won't, that we'll more or less accidentally lose control of AGI."}, {"time": 2751, "text": "Do you have that fear yourself personally?"}, {"time": 2756, "text": "I'm not quite sure what to think."}, {"time": 2758, "text": "I talk to philosophers like Nick Bostrom and Toby Ord and they think that this is a real problem we need to worry about."}, {"time": 2767, "text": "Then I talk to people who work for Microsoft or DeepMind or somebody and they say, no, we're not really that close to producing AGI, super intelligence."}, {"time": 2779, "text": "So if you look at Nick Bostrom, sort of the arguments, it's very hard to defend."}, {"time": 2785, "text": "So I'm of course, I am a self engineer AI system, so I'm more with the DeepMind folks where it seems that we're really far away, but then the counter argument is, is there any fundamental reason that we'll never achieve it?"}, {"time": 2799, "text": "And if not, then eventually there'll be a dire existential risk."}, {"time": 2804, "text": "So we should be concerned about it."}, {"time": 2806, "text": "And do you find that argument at all appealing in this domain or any domain that eventually this will be a problem so we should be worried about it?"}, {"time": 2816, "text": "Yes, I think it's a problem."}, {"time": 2818, "text": "I think that's a valid point."}, {"time": 2823, "text": "Of course, when you say eventually, that raises the question, how far off is that?"}, {"time": 2831, "text": "And is there something that we can do about it now?"}, {"time": 2833, "text": "Because if we're talking about this is gonna be 100 years in the future and you consider how rapidly our knowledge of artificial intelligence has grown in the last 10 or 20 years, it seems unlikely that there's anything much we could do now that would influence whether this is going to happen 100 years in the future."}, {"time": 2853, "text": "People in 80 years in the future would be in a much better position to say, this is what we need to do to prevent this happening than we are now."}, {"time": 2861, "text": "So to some extent I find that reassuring, but I'm all in favor of some people doing research into this to see if indeed it is that far off or if we are in a position to do something about it sooner."}, {"time": 2875, "text": "I'm very much of the view that extinction is a terrible thing and therefore, even if the risk of extinction is very small, if we can reduce that risk, that's something that we ought to do."}, {"time": 2891, "text": "My disagreement with some of these people who talk about longterm risks, extinction risks, is only about how much priority that should have as compared to present questions."}, {"time": 2900, "text": "So essentially, if you look at the math of it from a utilitarian perspective, if it's existential risk, so everybody dies, that it feels like an infinity in the math equation, that that makes the math with the priorities difficult to do."}, {"time": 2919, "text": "That if we don't know the time scale and you can legitimately argue that it's nonzero probability that it'll happen tomorrow, that how do you deal with these kinds of existential risks like from nuclear war, from nuclear weapons, from biological weapons, from, I'm not sure if global warming falls into that category because global warming is a lot more gradual."}, {"time": 2944, "text": "And people say it's not an existential risk because there'll always be possibilities of some humans existing, farming Antarctica or northern Siberia or something of that sort, yeah."}, {"time": 2954, "text": "But you don't find the complete existential risks as a fundamental, like an overriding part of the equations of ethics, of what we should do."}, {"time": 2966, "text": "You know, certainly if you treat it as an infinity, then it plays havoc with any calculations."}, {"time": 2972, "text": "But arguably, we shouldn't."}, {"time": 2974, "text": "I mean, one of the ethical assumptions that goes into this is that the loss of future lives, that is of merely possible lives of beings who may never exist at all, is in some way comparable to the sufferings or deaths of people who do exist at some point."}, {"time": 2994, "text": "And that's not clear to me."}, {"time": 2997, "text": "I think there's a case for saying that, but I also think there's a case for taking the other view."}, {"time": 3001, "text": "So that has some impact on it."}, {"time": 3004, "text": "Of course, you might say, ah, yes, but still, if there's some uncertainty about this and the costs of extinction are infinite, then still, it's gonna overwhelm everything else."}, {"time": 3016, "text": "But I suppose I'm not convinced of that."}, {"time": 3020, "text": "I'm not convinced that it's really infinite here."}, {"time": 3023, "text": "And even Nick Bostrom, in his discussion of this, doesn't claim that there'll be an infinite number of lives lived."}, {"time": 3031, "text": "What is it, 10 to the 56th or something?"}, {"time": 3033, "text": "It's a vast number that I think he calculates."}, {"time": 3036, "text": "This is assuming we can upload consciousness onto these digital forms, and therefore, they'll be much more energy efficient, but he calculates the amount of energy in the universe or something like that."}, {"time": 3048, "text": "So the numbers are vast but not infinite, which gives you some prospect maybe of resisting some of the argument."}, {"time": 3055, "text": "The beautiful thing with Nick's arguments is he quickly jumps from the individual scale to the universal scale, which is just awe inspiring to think of when you think about the entirety of the span of time of the universe."}, {"time": 3068, "text": "It's both interesting from a computer science perspective, AI perspective, and from an ethical perspective, the idea of utilitarianism."}, {"time": 3076, "text": "Could you say what is utilitarianism?"}, {"time": 3079, "text": "Utilitarianism is the ethical view that the right thing to do is the act that has the greatest expected utility, where what that means is it's the act that will produce the best consequences, discounted by the odds that you won't be able to produce those consequences, that something will go wrong."}, {"time": 3100, "text": "But in simple case, let's assume we have certainty about what the consequences of our actions will be, then the right action is the action that will produce the best consequences."}, {"time": 3110, "text": "Is that always, and by the way, there's a bunch of nuanced stuff that you talk with Sam Harris on this podcast on that people should go listen to."}, {"time": 3118, "text": "That's like two hours of moral philosophy discussion."}, {"time": 3122, "text": "But is that an easy calculation?"}, {"time": 3125, "text": "No, it's a difficult calculation."}, {"time": 3127, "text": "And actually, there's one thing that I need to add, and that is utilitarians, certainly the classical utilitarians, think that by best consequences, we're talking about happiness and the absence of pain and suffering."}, {"time": 3141, "text": "There are other consequentialists who are not really utilitarians who say there are different things that could be good consequences."}, {"time": 3149, "text": "Justice, freedom, human dignity, knowledge, they all count as good consequences too."}, {"time": 3155, "text": "And that makes the calculations even more difficult because then you need to know how to balance these things off."}, {"time": 3160, "text": "If you are just talking about wellbeing, using that term to express happiness and the absence of suffering, I think the calculation becomes more manageable in a philosophical sense."}, {"time": 3176, "text": "It's still in practice."}, {"time": 3178, "text": "We don't know how to do it."}, {"time": 3179, "text": "We don't know how to measure quantities of happiness and misery."}, {"time": 3182, "text": "We don't know how to calculate the probabilities that different actions will produce, this or that."}, {"time": 3188, "text": "So at best, we can use it as a rough guide to different actions and one where we have to focus on the short term consequences because we just can't really predict all of the longer term ramifications."}, {"time": 3205, "text": "So what about the extreme suffering of very small groups?"}, {"time": 3213, "text": "Utilitarianism is focused on the overall aggregate, right?"}, {"time": 3218, "text": "Would you say you yourself are a utilitarian?"}, {"time": 3221, "text": "Yes, I'm a utilitarian."}, {"time": 3225, "text": "What do you make of the difficult, ethical, maybe poetic suffering of very few individuals?"}, {"time": 3234, "text": "I think it's possible that that gets overridden by benefits to very large numbers of individuals."}, {"time": 3240, "text": "I think that can be the right answer."}, {"time": 3242, "text": "But before we conclude that it is the right answer, we have to know how severe the suffering is and how that compares with the benefits."}, {"time": 3252, "text": "So I tend to think that extreme suffering is worse than or is further, if you like, below the neutral level than extreme happiness or bliss is above it."}, {"time": 3267, "text": "So when I think about the worst experiences possible and the best experiences possible, I don't think of them as equidistant from neutral."}, {"time": 3276, "text": "So like it's a scale that goes from minus 100 through zero as a neutral level to plus 100."}, {"time": 3283, "text": "Because I know that I would not exchange an hour of my most pleasurable experiences for an hour of my most painful experiences, even I wouldn't have an hour of my most painful experiences even for two hours or 10 hours of my most painful experiences."}, {"time": 3301, "text": "Did I say that correctly?"}, {"time": 3303, "text": "Maybe 20 hours then, it's 21, what's the exchange rate?"}, {"time": 3307, "text": "So that's the question, what is the exchange rate?"}, {"time": 3308, "text": "But I think it can be quite high."}, {"time": 3310, "text": "So that's why you shouldn't just assume that it's okay to make one person suffer extremely in order to make two people much better off."}, {"time": 3321, "text": "It might be a much larger number."}, {"time": 3323, "text": "But at some point I do think you should aggregate and the result will be, even though it violates our intuitions of justice and fairness, whatever it might be, giving priority to those who are worse off, at some point I still think that will be the right thing to do."}, {"time": 3343, "text": "Yeah, it's some complicated nonlinear function."}, {"time": 3346, "text": "Can I ask a sort of out there question is, the more and more we put our data out there, the more we're able to measure a bunch of factors of each of our individual human lives."}, {"time": 3355, "text": "And I could foresee the ability to estimate wellbeing of whatever we together collectively agree and is in a good objective function from a utilitarian perspective."}, {"time": 3367, "text": "Do you think it'll be possible and is a good idea to push that kind of analysis to make then public decisions perhaps with the help of AI that here's a tax rate, here's a tax rate at which wellbeing will be optimized."}, {"time": 3388, "text": "Yeah, that would be great if we really knew that, if we really could calculate that."}, {"time": 3392, "text": "No, but do you think it's possible to converge towards an agreement amongst humans, towards an objective function or is it just a hopeless pursuit?"}, {"time": 3402, "text": "I don't think it's hopeless."}, {"time": 3403, "text": "I think it would be difficult to get converged towards agreement, at least at present, because some people would say, I've got different views about justice and I think you ought to give priority to those who are worse off, even though I acknowledge that the gains that the worst off are making are less than the gains that those who are sort of medium badly off could be making."}, {"time": 3425, "text": "So we still have all of these intuitions that we argue about."}, {"time": 3430, "text": "So I don't think we would get agreement, but the fact that we wouldn't get agreement doesn't show that there isn't a right answer there."}, {"time": 3437, "text": "Do you think, who gets to say what is right and wrong?"}, {"time": 3441, "text": "Do you think there's place for ethics oversight from the government?"}, {"time": 3482, "text": "Politically, I'm still a Democrat despite looking at the flaws in democracy and the way it doesn't work always very well."}, {"time": 3490, "text": "So I don't see a better option than allowing the public to vote for governments in accordance with their policies."}, {"time": 3500, "text": "And I hope that they will vote for policies that reduce the suffering of animals and reduce the suffering of distant humans, whether geographically distant or distant because they're future humans."}, {"time": 3515, "text": "But I recognise that democracy isn't really well set up to do that."}, {"time": 3518, "text": "And in a sense, you could imagine a wise and benevolent, you know, omnibenevolent leader who would do that better than democracies could."}, {"time": 3531, "text": "But in the world in which we live, it's difficult to imagine that this leader isn't gonna be corrupted by a variety of influences."}, {"time": 3541, "text": "You know, we've had so many examples of people who've taken power with good intentions and then have ended up being corrupt and favouring themselves."}, {"time": 3552, "text": "So I don't know, you know, that's why, as I say, I don't know that we have a better system than democracy to make these decisions."}, {"time": 3560, "text": "Well, so you also discuss effective altruism, which is a mechanism for going around government for putting the power in the hands of the people to donate money towards causes to help, you know, remove the middleman and give it directly to the causes that they care about."}, {"time": 3581, "text": "Sort of, maybe this is a good time to ask, you've, 10 years ago, wrote The Life You Can Save, that's now, I think, available for free online?"}, {"time": 3591, "text": "That's right, you can download either the ebook or the audiobook free from the lifeyoucansave.org."}, {"time": 3598, "text": "And what are the key ideas that you present in the book?"}, {"time": 3651, "text": "So you describe a minimum ethical standard of giving."}, {"time": 3656, "text": "What advice would you give to people that want to be effectively altruistic in their life, like live an effective altruism life?"}, {"time": 3669, "text": "There are many different kinds of ways of living as an effective altruist."}, {"time": 3674, "text": "And if you're at the point where you're thinking about your long term career, I'd recommend you take a look at a website called 80,000Hours, 80,000Hours.org, which looks at ethical career choices."}, {"time": 3725, "text": "There are a lot of different opportunities, but too few people are even thinking about those questions."}, {"time": 3731, "text": "They're just going along in some sort of preordained rut to particular careers."}, {"time": 3735, "text": "Maybe they think they'll earn a lot of money and have a comfortable life, but they may not find that as fulfilling as actually knowing that they're making a positive difference to the world."}, {"time": 3745, "text": "What about in terms of, so that's like long term, 80,000 hours, sort of shorter term giving part of, well, actually it's a part of that."}, {"time": 3754, "text": "You go to work at Wall Street, if you would like to give a percentage of your income that you talk about and life you can save that."}, {"time": 3762, "text": "I mean, I was looking through, it's quite a compelling, I mean, I'm just a dumb engineer, so I like, there's simple rules, there's a nice percentage."}]}]