[{"title": "Ray Dalio: Money, Power, and the Collapse of Empires | Lex Fridman Podcast #251", "id": "TISMidxdZoc", "quotes": [{"time": 556, "text": "25% of the world's new inventions came from the Dutch, and so as they went around the world, they also brought their currency, and they brought their military."}, {"time": 568, "text": "They needed the currency, they paid for things, and that currency, and then the more that happens, the more that becomes a reserve currency, and then they have their military, so they need their military strength, and so you see it evolve in all of those ways."}, {"time": 585, "text": "But over a period of time, as they become more successful and more expensive, they become more expensive, and newer countries come along, like the UK, then learn to build ships from a lot the Dutch and could do that less expensively, and also when they become more expensive, so less competitive, and also the work ethic begins to change."}, {"time": 619, "text": "They believe that since they're richer, they can enjoy life more."}, {"time": 622, "text": "They don't have to work quite as hard, and so you start to see the tilt."}, {"time": 628, "text": "Now you start to see the development of the top, and when you have a world reserve currency, that allows you to borrow a lot of money because those who want to save want to hold your money, and that means that they'll lend you money, and so those countries get deeper into debt."}, {"time": 647, "text": "So you see that they gradually lose their competitiveness, and they get themselves into financial circumstances, which are not good, and they have large wealth gaps, which set the stage for downturns."}, {"time": 664, "text": "And when they have downturns, the first question is do they have enough money?"}, {"time": 670, "text": "And traditionally, money is resources."}, {"time": 675, "text": "So you classically see that the coffers are bare, that they're spending more money than they are earning, and they run out of money in the coffers, and their granaries are empty rather than stocked so that they give them the buffer."}, {"time": 695, "text": "And as that deteriorates, that worsens conditions."}, {"time": 700, "text": "And if they have a rival power that's also challenging them, they see greater internal conflict over wealth, and then they have the problems internally and the problems externally, which usually results in an internal war or an external war that leads to the change to the new world order."}, {"time": 723, "text": "And to you, the Dutch Empire is a good example of that."}, {"time": 727, "text": "The British, what are some of the key examples that you think about in the book of this process that followed the big cycle?"}, {"time": 736, "text": "Well, the leading reserve currency empires, but it applies to all the empires, were the Dutch, the British, the American, and the Chinese."}, {"time": 748, "text": "But you could follow the same pattern."}, {"time": 752, "text": "In the book, it was very important for me to not just use words and concepts because that's subjective."}, {"time": 761, "text": "It was very important for me to use actual measurements."}, {"time": 765, "text": "So as you see in the book, you can see every level of this."}, {"time": 769, "text": "You can see where's the education level, what is the military power, each one of those, and you could see them back going over the 500 years."}, {"time": 779, "text": "And so you could see the arcs and the composition of those arcs, and what you see is really, in most countries and most dynasties, you could see that."}, {"time": 790, "text": "But you also can see through those numbers the health of those countries."}, {"time": 795, "text": "Today, there are statistics that are in the book that show what is the level of education, what is the level of economic output, what is the level of military strength, what is the level of a number of different measures of strength, so that you can then compare that."}, {"time": 818, "text": "And I think that because they're objective measures of strength that you could see change, that shows the picture of where we are today."}, {"time": 828, "text": "And I think one of the most important things about the book is that it allows people to monitor how those things are transpiring."}, {"time": 836, "text": "I think for policymakers, are your policymakers doing a good job?"}, {"time": 843, "text": "And there's so much subjectivity in that."}, {"time": 846, "text": "But I think it's very simple."}, {"time": 848, "text": "If those lines on the chart are improving, if your health index is improving, then you're moving toward a better life."}, {"time": 857, "text": "So that's what the book works like."}, {"time": 859, "text": "Also, it was used to create a model for the future."}, {"time": 864, "text": "In other words, there are cause effect relationships."}, {"time": 868, "text": "Everything that happens has reasons, causes, that preceded it, that made it happen."}, {"time": 874, "text": "And so by having all those in numbers, one can see the probabilities of certain things happening."}, {"time": 882, "text": "So that's what you see in the book."}, {"time": 886, "text": "It's not just Ray's interpretation."}, {"time": 889, "text": "I didn't wanna make it Ray's interpretation because I don't know if I'm right."}, {"time": 893, "text": "Yeah, so one of the fascinating things in the book, so you have list these 18 measures, and there's like a little scorecard for the countries of the world today."}, {"time": 904, "text": "So let's say US, China, and Europe, and what it was 20 years ago, and looking at the change from 20 years ago, and that's another indicator, the change itself, to see where things are headed."}, {"time": 917, "text": "Maybe can you comment on, from a score perspective, how is US and China doing?"}, {"time": 924, "text": "And in the 18 measures, what are some measures that stand out to you as particularly important to think about today for the United States, for China?"}, {"time": 933, "text": "Well, there are a number."}, {"time": 935, "text": "Financially, what you see in the United States is that we're borrowing a lot more money, creating a lot of debt, and we're printing a lot of money."}, {"time": 949, "text": "And our capacity to do that is very much, is limited, first of all, because when there's a sale of a bond, when the government borrows more than it borrows money, because it spends more than it takes in, you have to sell a bond."}, {"time": 970, "text": "And the world right now has a lot of US dollar denominated bonds, because as the world's reserve currency, they sell, sold on them."}, {"time": 978, "text": "And they have very bad returns, negative real returns, negative real returns significantly, and so on."}, {"time": 987, "text": "So that means that more bonds has to be sold than are bought."}, {"time": 996, "text": "And that means that the Federal Reserve is faced with the choice of having to raise the interest rate to curtail borrowing, which slows the economy and hurts the markets, or by filling that difference and producing money, the debt monetization, which produces an inflation in goods, services, and financial assets."}, {"time": 1023, "text": "So in that regard, that's the United States's position."}, {"time": 1028, "text": "In China's case, its balance of payments is better."}, {"time": 1033, "text": "China has displaced the United States as the world's largest trading country."}, {"time": 1040, "text": "In other words, more exports to other countries."}, {"time": 1043, "text": "And as a result, it's economically competitive, but it doesn't have the world's reserve currency."}, {"time": 1051, "text": "It's a real blessing."}, {"time": 1052, "text": "So the United States, it has the world's reserve currency, but it is risking it because of this imbalance."}, {"time": 1060, "text": "So if you look at history, you see that those go slowly, but when they go eventually, they go quickly."}, {"time": 1070, "text": "So there's a risk of that financially."}, {"time": 1074, "text": "Then there's the issue of internal order."}, {"time": 1078, "text": "So I'm just giving you the major ones, but I'll get into some of the other ones too."}, {"time": 1082, "text": "Right now, there's a lot of internal conflict in the United States, which affects how well it works."}, {"time": 1094, "text": "In China, there's less internal conflict because it's a more autocratic state, but also they've created this bifurcation of what is political and what is economic in terms of producing that prosperity."}, {"time": 1112, "text": "So if you stay out of the politics pretty much, and then you're seeing entrepreneurship, you're seeing the finances of new businesses and so on."}, {"time": 1124, "text": "And so that internal working, that's subject to different people's interpretations whether they like it or not, but the internal conflict in terms of those kinds of measures is less."}, {"time": 1137, "text": "Sorry to pause on that for a second."}, {"time": 1140, "text": "So these measures, I guess you don't want to sort of romanticize any one measure or something like that, overinterpret any one measure, but is internal conflict always a bad thing?"}, {"time": 1153, "text": "Is it a complicated calculation?"}, {"time": 1158, "text": "Or do you kind of, the way we think about these measures that you've presented, we should be thinking like the higher, the better, the lower, the worse, I mean, of course, depending on the measure."}, {"time": 1167, "text": "Well, in many cases, the conflict that produces the revolution produces revolutionary changes that lead to resolutions and lead to new starts."}, {"time": 1184, "text": "And so a short term civil war is a hellacious experience."}, {"time": 1192, "text": "And at the same time, it can be the transition to a new beginning."}, {"time": 1198, "text": "Also, there are different types of conflict."}, {"time": 1203, "text": "Competition, which makes things, makes everything better, is a productive conflict, whereas destructive conflicts are not good over the short time."}, {"time": 1220, "text": "So that's how those go."}, {"time": 1223, "text": "So within each measure, the story is complicated."}, {"time": 1229, "text": "Yeah, but my measures are sort of clear, meaning how much political conflict, how much social conflict."}, {"time": 1238, "text": "In other words, you can measure conflict, you can measure fighting, you can measure crime rates, you can measure lots of different ways of conflict."}, {"time": 1249, "text": "So the measures are a composite of different types of internal conflict."}, {"time": 1255, "text": "What are some other interesting measures, maybe if you can also mention that, for me in particular, interest is education and innovation."}, {"time": 1263, "text": "Yes, the classic cycle, the most important leading indicator is the quality of education."}, {"time": 1271, "text": "Most importantly, broad based education drawn from the largest population because you can never tell who the talent is going to be."}, {"time": 1283, "text": "So where are they gonna come from?"}, {"time": 1285, "text": "So for example, if you look at the Chinese dynasties, the great Chinese dynasties and the Confucian approach, it was meritocratic of everybody could sit for exams and so on broad base of drawing in the populations."}, {"time": 1301, "text": "And you see that if you go across societies because that draws on the largest number of population to get education."}, {"time": 1310, "text": "And it also, that creates a reality and a perception that the system is fair, equal opportunity, not just one of privilege."}, {"time": 1323, "text": "And that helps to create social stability."}, {"time": 1326, "text": "But education is not just education in understanding facts and so on, it is education in civility of how to behave together."}, {"time": 1339, "text": "And so if they're smart, they understand how to be productive because they work well together and they're productive."}, {"time": 1347, "text": "And then that leads to the next stage."}, {"time": 1350, "text": "You could see in the lines in the charts, I plotted these so that you could see in a typical cycle, you could see that education is the long leading indicator."}, {"time": 1362, "text": "And then you could see, as you mentioned, that what you see is inventiveness and technology measures then follow and you see then also competitiveness and world markets follows."}, {"time": 1375, "text": "For example, in the early stages of a cycle, the industries that they go into tend to be very basic industry because they have cheap labor, something like textiles and simple manufactured goods and so on."}, {"time": 1391, "text": "But as the education rises, then they move up the value chain to greater technologies and so on, which raises incomes and raises productivity."}, {"time": 1403, "text": "So yes, those and as you say, there are 18 different measures like that, but education and then civility and the inventiveness."}, {"time": 1412, "text": "So you see it reflected in who's inventing what."}, {"time": 1418, "text": "And that corresponds then who's trading with, who's a big trading country and where's the value of economic output and what are per capita incomes."}, {"time": 1427, "text": "They all follow those arcs."}, {"time": 1431, "text": "Yeah, like you said, the fascinating thing about your book, so there's philosophy, there's wisdom, but there's plots."}, {"time": 1438, "text": "Yeah, you can see it."}, {"time": 1441, "text": "So it's not just your opinion."}, {"time": 1442, "text": "It's kind of like you can interpret it in any way you like, but you're just giving a lot of your own insights along with the numbers."}, {"time": 1452, "text": "If you were to look at the American nation, the American empire and the trajectories looking into the future given these measures, what is the trajectory that leads to the collapse of the American empire based on these measures?"}, {"time": 1468, "text": "What are the concerning indicators and if those break down further, what does that look like?"}, {"time": 1474, "text": "Well, all of those indicators are concerning, maybe except for one, which is technology, the technology niche, although even in that area, the United States is improving at a slower rate than is China for various advantages that they have there."}, {"time": 1500, "text": "They put out about eight times as many computer engineers they have free data and so on, but if you look at them, so the financial is a concern."}, {"time": 1512, "text": "The internal order, disorder is a concern."}, {"time": 1517, "text": "Then if you look at education levels, the United States is in many ways is losing its educational advantage."}, {"time": 1527, "text": "If you were to look at, compare it with China, if you take general public education in the United States, it's deteriorated tremendously even in comparison to developed countries."}, {"time": 1540, "text": "There are scores, PISA scores and so on, and it's something like 38th in the world or something and that was a big plunge, average public education."}, {"time": 1548, "text": "If you look at the best universities in the world, the United States is unique in having the best universities in the world, so there are these privileged universities in the world, so there are these privileged spots that are, you know, excellent, uniquely excellent."}, {"time": 1566, "text": "So when you look at the comparison, education in China is improving rapidly and the quantity is a quantity of educated people in the areas that they're moving in is greater and the resources that they're putting behind it is greater and so you see the results are greater, but it's sort of along the lines that I'm dealing with."}, {"time": 1594, "text": "If you were to follow through in terms of actual productions, I think you know in terms of technologies, there are some areas that the United States is in a lead at the moment, there's some areas that China's in a lead, but China's gaining very quickly."}, {"time": 1614, "text": "When I first went to China, 1984, I would bring $10 calculators and I gave them away as gifts to high ranking people and they thought they were miracle devices."}, {"time": 1628, "text": "Right now, in terms of areas like quantum computing and AI and you know, many areas, you have a race going on and so if you take the trajectory of the competitiveness, not just look at the current level, you have a situation where they're improving at a much faster rate."}, {"time": 1651, "text": "This is all good for the world if the world can get along."}, {"time": 1656, "text": "And the main thing I think is, how do you have a healthy world and how do you have a strong economy and how do you have a strong situation is be strong."}, {"time": 1669, "text": "The United States is war is with itself."}, {"time": 1673, "text": "That's the main war."}, {"time": 1675, "text": "You know, it's very simple in history."}, {"time": 1679, "text": "Be financially sound, earn more than you spend and be strong in these ways and pretty much everything will take care of itself."}, {"time": 1693, "text": "But you make it sound simple of course because there's a momentum when things degrade, when the education system degrades, when you start borrowing, when I mean, all of these indicators, once they're going down, there's a momentum to it, right?"}, {"time": 1708, "text": "So it's hard to reverse it."}, {"time": 1710, "text": "Right and there are circumstances that you're then in."}, {"time": 1713, "text": "For example, indebtedness."}, {"time": 1716, "text": "You know, it's politically desirable for those to borrow money and spend because their constituencies only look at what they get and when they get a lot, they don't pay attention to the balance sheet and how much debt is on the books."}, {"time": 1735, "text": "So it's always better to borrow, spend and then leave the cleanup to the next guy."}, {"time": 1741, "text": "And so you inherit a lot."}, {"time": 1744, "text": "You inherit it as a new president enters in or new legislators, they have a lot of debt, they have a broken down infrastructure, they don't have enough money to fix that."}, {"time": 1759, "text": "And so that's the lay of the land that the prior generations put you in and there you are."}, {"time": 1770, "text": "It's difficult because when you start to think, okay, what's healthy?"}, {"time": 1774, "text": "Well, earn more than you spend."}, {"time": 1777, "text": "Well, that's not so easy because you know, what does that mean?"}, {"time": 1781, "text": "Go earn more?"}, {"time": 1782, "text": "I mean, okay, that's not so easy."}, {"time": 1784, "text": "Spend less?"}, {"time": 1787, "text": "That isn't gonna work."}, {"time": 1789, "text": "So now what do you do?"}, {"time": 1790, "text": "Okay, you have this debt that you then monetize and that's why it's classic."}, {"time": 1795, "text": "So yes, that's why these cycles occur because what has created before, what happened before created the lay of the land that is then increasingly difficult to deal with."}, {"time": 1806, "text": "So what can great leaders do in this moment?"}, {"time": 1808, "text": "I mean, maybe my sense is leadership is crucial here."}, {"time": 1813, "text": "So for example, to do very large projects and invest in the education system that sort of try to fix the fundamentals or maybe invest more and more into the innovation and the development of new technologies and so on."}, {"time": 1829, "text": "It feels like that just doesn't happen organically."}, {"time": 1833, "text": "So you have to have strong leaders that convince the populace of the importance of these ideas."}, {"time": 1843, "text": "Well, I completely agree with your list."}, {"time": 1846, "text": "What we have is a situation where everybody has their opinions and they have to sort of get them exactly right and they all fight with each other about whether their opinions."}, {"time": 1858, "text": "So the most important thing is that we become bipartisan so that we don't and we get over our differences."}, {"time": 1867, "text": "I would have a bipartisan cabinet."}, {"time": 1870, "text": "I would draw upon both members of both parties, the moderates who are going to be able to work together."}, {"time": 1880, "text": "So as then we have one country and then we deal with those in a means that works for the majority of the people in the middle rather than the polarity."}, {"time": 1892, "text": "I think our greatest risk is in not being able to do that."}, {"time": 1897, "text": "So I would say that's a paramount importance because we have the resources, wealth, real wealth and science and everything has never been better than it is."}, {"time": 1911, "text": "But the notion is that it has to work for the majority of people and we have to keep it being productive."}, {"time": 1919, "text": "So that group has got to calmly and knowledgeably work together so that they increase the size of the pie and they create broad based prosperity."}, {"time": 1932, "text": "So that is a paramount importance."}, {"time": 1935, "text": "Whatever they do, if they do it that way, I can say I'm happy about because that other alternative is the really scary alternative."}, {"time": 1948, "text": "The scary alternative, the different ways it has evolved throughout history, some of it has led to wars."}, {"time": 1959, "text": "What are the future trajectories that lead to a potential war with China?"}, {"time": 1964, "text": "Cold war or hot war?"}, {"time": 1968, "text": "Is this something you're worried about?"}, {"time": 1970, "text": "Yeah, I'd like to talk about both wars."}, {"time": 1972, "text": "So the war with China, as I say, there are five kinds of wars."}, {"time": 1976, "text": "There's a trade war, technology war, geopolitical influence war, capital war, and military war."}, {"time": 1988, "text": "As far as military war goes, I think it's only a Taiwan issue, but that's a big issue."}, {"time": 1996, "text": "And we could talk about that for a minute, but those others, they'll be rough competitions and we'll have that type of evolution over a period of time."}, {"time": 2007, "text": "That's what that war looks like."}, {"time": 2010, "text": "Taiwan has been, for a long time, a sovereignty issue to China."}, {"time": 2020, "text": "And it has its roots in what's called the 100 years of humiliation."}, {"time": 2027, "text": "From the 1840s to 1949, foreign powers came in, took advantage of China, they had the opium wars and such times, and that represented the 100 years of humiliation."}, {"time": 2043, "text": "And Taiwan represents their sovereignty and their important thing."}, {"time": 2051, "text": "And 50 years ago, starting 50 years ago, there was an agreement that there is one China and Taiwan is part of China."}, {"time": 2061, "text": "And that there would be peaceful reunification."}, {"time": 2066, "text": "The peaceful reunification hasn't happened."}, {"time": 2071, "text": "And in their view, that's a very big issue."}, {"time": 2074, "text": "And so it's a big contentious issue."}, {"time": 2077, "text": "And that could produce a military war, could produce a military accident, could produce, it's a very tense situation."}, {"time": 2086, "text": "And if we had a military war, God help us because of the capacity in all different new ways to inflict harm on each other."}, {"time": 2096, "text": "But anyway, that's that."}, {"time": 2098, "text": "If you don't have that military war, you'll have the competition between those other kinds of wars and whoever is strongest in those areas will win."}, {"time": 2111, "text": "Where do you put cyber war within the five?"}, {"time": 2114, "text": "Well, cyber war is a military war."}, {"time": 2117, "text": "I'm assuming the type of cyber war that you're referring to is that which is used to inflict pain on the other party through cyber."}, {"time": 2126, "text": "So cyber wars, you'll see cyber war."}, {"time": 2129, "text": "You could see space war."}, {"time": 2131, "text": "You can see drone warfare."}, {"time": 2135, "text": "New types of warfare, not just the traditional and nuclear type of warfare."}, {"time": 2142, "text": "But you could see any of the above."}, {"time": 2144, "text": "What are the defining characteristics?"}, {"time": 2148, "text": "What are the interesting things about Xi Jinping, the president of China, as a leader on the world stage?"}, {"time": 2155, "text": "His father was a early leader."}, {"time": 2161, "text": "He was himself in the Cultural Revolution in times, treated brutally."}, {"time": 2172, "text": "And during that period of time, it was very, very difficult."}, {"time": 2177, "text": "And he came up through the ranks and he's a very intelligent man."}, {"time": 2186, "text": "When he first came to power, as you know, they have two five year terms, and we're now coming to the end of the second of those five year terms."}, {"time": 2196, "text": "When he first came to power, he felt that there should be a lot of reform."}, {"time": 2202, "text": "And reform meant moving to much more of a market and open economy."}, {"time": 2209, "text": "When that happened, him coming in, I had some contact with economic policymakers, but in the circumstances then, were that five major banks lent to state owned enterprises and local governments with implied government guarantees."}, {"time": 2227, "text": "And so there was not control of that and the movement to aim more of a market economy."}, {"time": 2234, "text": "And the development of markets was a primary and also the dealing with the corruption issue."}, {"time": 2240, "text": "There was a lot of corruption prior to that, and that was viewed as an existential threat to the system."}, {"time": 2248, "text": "So that became the primary objective."}, {"time": 2251, "text": "And then as time progressed over those 10 years, there was a lot of changing in the world, their financial circumstances, opening many, many other markets."}, {"time": 2266, "text": "They particularly getting money to small and medium sized enterprises and developing a lending system and then establishing controls on it."}, {"time": 2275, "text": "So right now there's a vibrant capital markets."}, {"time": 2280, "text": "You can raise capital, you can be an entrepreneur, you can become a billionaire in the capital markets."}, {"time": 2287, "text": "And they developed the markets to be the second largest capital markets."}, {"time": 2291, "text": "At the same time, they had to deal with their rising debt issue, which they began to deal with really about four years ago, when the second largest capital markets were about four years ago, when the second term began."}, {"time": 2313, "text": "And then Lu He became the vice premier responsible for that and to deal with those issues."}, {"time": 2326, "text": "So you see right now that what's happening is the dealing with the real estate bubble."}, {"time": 2333, "text": "There was a development in real estate, a bubble, which produced a lot of unproductive lending."}, {"time": 2339, "text": "And Xi Jinping said, houses are meant to live in, not to speculate on."}, {"time": 2348, "text": "And so that was wasteful."}, {"time": 2349, "text": "So they established what they call three red lines, which are financial ratios, that the property developers had to live within."}, {"time": 2358, "text": "And that is then causing the adjustments that are going on now, which in my view are very healthy because whenever there's bankruptcies and so on, most in the public think, okay, that's a problem."}, {"time": 2373, "text": "It's in many cases really a cleaning up of bad debts and bad practices."}, {"time": 2377, "text": "And so that's what's going on."}, {"time": 2380, "text": "So that's, let's say economically."}, {"time": 2382, "text": "At the same time, there is the changing relationships, the changing world order, the changing relationships with the United States and other countries, which is becoming much less cooperative and much more warlike, much more confrontational."}, {"time": 2402, "text": "Those two things, the domestic debt problem and the domestic, has led to what's called core, what they call core leadership, which means a leadership more around him that is less challenging because they believe in history that during very difficult times, a more centrally controlled decision making process lends itself better than to a more fragmented political contentious project."}, {"time": 2435, "text": "And that's basically what's going on now."}, {"time": 2439, "text": "You said it very eloquently, but you mean the leadership is surrounded by yes men and there's a lot of centralized control."}, {"time": 2450, "text": "That characterization is much more black and white than it really is."}, {"time": 2457, "text": "But it leans towards that direction."}, {"time": 2460, "text": "Like for example, of the standing members of the Politburo, four are more allotted, three are less so."}, {"time": 2469, "text": "You have to understand that it's kind of a collective leadership at the top."}, {"time": 2474, "text": "And then of course, there's just jockeying for power in a highly political sense at the top."}, {"time": 2482, "text": "But no one leader can be successful against all those powers at the top."}, {"time": 2490, "text": "So it's very politically negotiating."}, {"time": 2492, "text": "It's very much more like if you put in the United States the Democrats and the Republicans and they had to be in the same government and they work it out."}, {"time": 2503, "text": "It's kind of something like that."}, {"time": 2505, "text": "And so that's that struggle, but it's an internal struggle."}, {"time": 2509, "text": "Where do you put the importance of some of these ideas at the founding of the United States when now we're talking about that at the context of China, the freedom of speech, freedoms?"}, {"time": 2522, "text": "What China is doing with the central management of a lot of things, it's enabling a lot of growth, but it's also limiting people on the very basic level in terms of freedom."}, {"time": 2533, "text": "The kind of freedom that I think can lead to entrepreneurship, to starting new businesses, to having big dreams and chasing those dreams and then creating totally new things in whatever the space, maybe in technology, in business and whatever."}, {"time": 2550, "text": "How important is that as a metric for society?"}, {"time": 2553, "text": "Well, they have a view, which is the idea of a dialectic, which means that two things are at obvious, that everything comes with pros and cons and two opposites exist."}, {"time": 2566, "text": "And you want the benefits of those two opposites and how do you deal with the benefits of those two opposites?"}, {"time": 2574, "text": "So let's say you want the capital markets because it gets money into the hands of the entrepreneurs who are motivated, they build fortunes, and that drives an economy to do very well."}, {"time": 2587, "text": "And at the same time, it produces the other problems, the wealth gaps, the other problems, the debt cycle that we're talking about and so on."}, {"time": 2598, "text": "And Deng Xiaoping, how do you reconcile communism and the market economy and the capital markets?"}, {"time": 2607, "text": "And he famously said, it doesn't matter if it's a white cat or a black cat, just as long as it catches mice."}, {"time": 2616, "text": "In other words, if it works in making the country richer, then that becomes the objective and then they move that along."}, {"time": 2623, "text": "So there are these conflicts."}, {"time": 2626, "text": "And one of the leaders described it to me as follows, because it's confusion and it goes back over a period of time."}, {"time": 2635, "text": "There's a hierarchy and it's an extension of the family, he described it."}, {"time": 2641, "text": "And he said, the United States is a country of individuals and individualism, and that is its vibrancy that we see the individual rights to speak up, the individual protection of the individual, individual property rights and all of those things is of paramount importance."}, {"time": 2668, "text": "And we build our organization."}, {"time": 2669, "text": "That's why democracy is from the bottom up or even a company, we'll get together and we'll be partners to prosper together."}, {"time": 2677, "text": "That is the American approach."}, {"time": 2679, "text": "He was describing that in China, it's an extension of the Confucian family, essentially."}, {"time": 2687, "text": "And so it's almost like there's a hierarchy."}, {"time": 2692, "text": "And so what they think about is the common good, not the individualism."}, {"time": 2699, "text": "So for example, if they want a high speed rail to go from one place to another, and that's best in the common good, then the individual protections that would stand in the way of doing that would be of secondary concern."}, {"time": 2713, "text": "So that notion of controlling."}, {"time": 2717, "text": "So for example, what they're doing with video games, they control what type of video games and how many hours a day kids can be on video games operating in that way, because they believe that that's good for the society and that's very controlling."}, {"time": 2740, "text": "In the United States, I think probably most parents would say, leave it to me."}, {"time": 2745, "text": "And it's a matter between me and my kids."}, {"time": 2748, "text": "The same thing has to do with data."}, {"time": 2750, "text": "In other words, in the United States, who controls the data?"}, {"time": 2755, "text": "Does the company control the data?"}, {"time": 2757, "text": "Do you individually control the data?"}, {"time": 2760, "text": "And so the inclination would be to figure that out, but nobody would say that the government is going to control the data because of our inclination of really anti government control."}, {"time": 2771, "text": "In China, it would be that the government will control the data because that's going to be best for the society."}, {"time": 2778, "text": "And it depends who you trust."}, {"time": 2780, "text": "But that's, so that difference in philosophy is very much at the heart of that."}, {"time": 2788, "text": "As far as your question in terms of effectiveness, it really is, in China's case, it's how you balance the things, right?"}, {"time": 2798, "text": "So what they're attempting to do is to create a lot of freedom and creativity in areas that are not political, let's say."}, {"time": 2810, "text": "And so you see a lot of entrepreneurship, you see a lot of product development, you see a lot of creativity happening in that way."}, {"time": 2820, "text": "So the stereotype that you don't see creativity happening is an old stereotype, whereas a lot of creativity is certainly happening."}, {"time": 2829, "text": "And the system can work well if they can achieve that kind of balance."}, {"time": 2833, "text": "It's proven to have worked well."}, {"time": 2835, "text": "Since I started going there in 1984, per capita income, real per capita income, has increased by 26 times."}, {"time": 2844, "text": "The longevity rate has increased by 10 years."}, {"time": 2848, "text": "The poverty rate has fallen from 88% to less than 1% in terms of basics like starvation and things."}, {"time": 2857, "text": "And if you read history, Plato's Republic, he talks about the cycles, democracy and autocratic and the benevolent despot and all of that, each has their own vulnerability."}, {"time": 2873, "text": "The vulnerability of democracy, which has been a remarkable, remarkable system and I don't have to extol the benefits of it, but the vulnerability of it has always been the internal conflict that produces itself as anarchy."}, {"time": 2893, "text": "In World War II, four democracies chose to be autocracies because there was internal disorder and there was the belief, will somebody bring about order and get control of the situation?"}, {"time": 2912, "text": "That was in Germany, Italy, Japan and Spain."}, {"time": 2918, "text": "They were parliamentary systems that turned themselves over to that."}, {"time": 2923, "text": "So both systems have vulnerabilities."}, {"time": 2929, "text": "I think the main thing that we need to think about is those vulnerabilities."}, {"time": 2934, "text": "Democracy is an amazing system because the adherence to the rules and the system and the checks and balances is quite amazing and it gives it a flexibility to change without civil wars."}, {"time": 2952, "text": "But there has to be the respect of the rules."}, {"time": 2955, "text": "And when you see something like they will not accept elections or they will not accept rules, history has shown, when the causes that people are behind are more important to them than the system, the system is in jeopardy."}, {"time": 2974, "text": "So we have a situation that's very much like that in terms of, let's say, the 2024 elections."}, {"time": 2982, "text": "I believe that there's a very high chance that neither side will accept losing, for example."}, {"time": 2991, "text": "And so we have that kind of a situation."}, {"time": 2996, "text": "So one would hope that one could rise above the disagreements and rely on the system for resolving disagreements."}, {"time": 3006, "text": "Because if that doesn't happen, then we have our own chaos."}, {"time": 3013, "text": "So the kind of the trend that started in 2020, or I mean, I suppose it's been there, it's been growing."}, {"time": 3022, "text": "One representation of this internal disorder has been the growing trend of being skeptical about the results of the election."}, {"time": 3029, "text": "Well, it started before that."}, {"time": 3031, "text": "There was the emergence of population before President Trump was elected."}, {"time": 3040, "text": "He was basically elected as a populist because there was a large percentage of the population that felt that the system didn't work for them."}, {"time": 3050, "text": "And he tapped into that."}, {"time": 3052, "text": "And he was largely elected as a populist leader, first populist leader in a developed country."}, {"time": 3060, "text": "And so populism began then."}, {"time": 3064, "text": "And that was a battle of one group against the other group."}, {"time": 3068, "text": "And so since then, it's been like that and it continued to grow."}, {"time": 3077, "text": "You've mentioned the vulnerability of democracy, that internal disorder is the vulnerability of democracy."}, {"time": 3086, "text": "What's the vulnerability of a system like China?"}, {"time": 3089, "text": "Maybe one way to say is put China aside and look at history, look at Soviet Union."}, {"time": 3094, "text": "What's the vulnerability of a communist type system?"}, {"time": 3099, "text": "Well, I'll call it both communist and autocratic, depending on how much autocracy, is that it lacks flexibility."}, {"time": 3112, "text": "It lacks the ability, but I should deal with them differently."}, {"time": 3119, "text": "In other words, there's the economic system."}, {"time": 3122, "text": "The economic system threatens motivation and productivity."}, {"time": 3127, "text": "So communism or socialism has to be done in a way where you can threaten productivity."}, {"time": 3136, "text": "Capitalism has, and what I mean by that, I mean free markets and capital markets have been an effective way of allocating resources and also creating the incentives and the resources, providing the resources for the inventiveness of new ideas."}, {"time": 3157, "text": "And so if I compare that, what the Chinese have done to a large extent is to recognize that and have made a move."}, {"time": 3167, "text": "That's why the seeming dialectic or the conflict between those two things exists."}, {"time": 3173, "text": "But anyway, that's it."}, {"time": 3175, "text": "As far as an autocratic system, rather than one man, one vote from the population up, the risks of the autocratic system is that there's enough discontent that arises that the system doesn't have the flexibility and that rather than bending, it breaks."}, {"time": 3201, "text": "That's the big risk."}, {"time": 3204, "text": "The notion of trying to control a population if there's that, rather than giving it the flexibility."}, {"time": 3212, "text": "So that would be the big risk of the autocratic system."}, {"time": 3216, "text": "What's the human, because you mentioned like the top gets bigger with the empires and you start to get things for granted."}, {"time": 3225, "text": "Is some of this just human nature?"}, {"time": 3228, "text": "So the concern with China, with autocratic nations, the concern with the Third Reich, the Soviet Union, was that fundamentally at the individual level, the humans involved at the top, they start becoming, they're starting to lose touch with reality in a way that no longer makes them."}, {"time": 3253, "text": "I guess that's the representation, the flexibility that you're referring to."}, {"time": 3256, "text": "Well, I mean, in a democracy, you could change."}, {"time": 3261, "text": "You can go as far left or as far right."}, {"time": 3263, "text": "You can change the leaders easily."}, {"time": 3265, "text": "And so the people don't become, they pretty much only have themselves to blame."}, {"time": 3272, "text": "And one of the problems of that is they may not choose the best leaders, but they have that flexibility."}, {"time": 3282, "text": "So vote and you get what you wanted."}, {"time": 3286, "text": "In the case of the autocratic, let's say leaders, and then the movement from democracies to autocracies, what you see normally that movement is that one of the systems is not working."}, {"time": 3300, "text": "Let's say the democracy is not effectively, everybody's arguing with each other and nobody's getting anything done."}, {"time": 3306, "text": "You know, like Mussolini, the trains are not running on time."}, {"time": 3310, "text": "And that would be the example, geez, this place has gotten chaotic."}, {"time": 3314, "text": "Will somebody get to control?"}, {"time": 3316, "text": "And then you get the autocratic and then he's autocratic enough to boss people around."}, {"time": 3324, "text": "And then you follow those kinds of orders."}, {"time": 3329, "text": "And it's like maybe a CEO in a powerful company going around and that could work well or it could work badly."}, {"time": 3336, "text": "Most companies are run as like autocracies in a sense."}, {"time": 3341, "text": "You know, there's the hierarchy and the command economy and that kind of thing."}, {"time": 3346, "text": "And that can work well or not."}, {"time": 3351, "text": "But then quite often when you get the populist autocratic, their personality is something that they want to fight and they become more nationalistic and they tend to become more militaristic."}, {"time": 3367, "text": "And human nature at that stage lends itself to fighting."}, {"time": 3373, "text": "There's an arc here that when we think of a country and we say we, and we think of a country, it's not true, it's not like that."}, {"time": 3384, "text": "There are individuals who change."}, {"time": 3386, "text": "One generation dies and another generation comes along."}, {"time": 3390, "text": "And one of those arcs is that the one generation of the ones who have been through war don't wanna go to war and are more happily willing to abide by whatever the rules are."}, {"time": 3407, "text": "As you get farther along into that cycle and you get a new generation and they forget about wars and the horrors of wars, then they want to fight."}, {"time": 3419, "text": "And so you're seeing right now the emerging of fight for right and what that means is you see it internally, fight where are you and fight for that thing and they mean fight."}, {"time": 3434, "text": "And then externally, fight, are you going to be the strong one who will fight and win?"}, {"time": 3441, "text": "And that develops on both sides, this fight and win and each side is cheering each other on into a war."}, {"time": 3450, "text": "But that comes by those who really have not experienced war because it comes in their part of their lifetime."}, {"time": 3458, "text": "Humans are fascinating."}, {"time": 3461, "text": "And by the way, human nature has not changed over the thousands of years."}, {"time": 3468, "text": "So it's so interesting because like in doing this study and it comes across in the study, it's like watching the same movie over and over again."}, {"time": 3476, "text": "You know, you see the arc and you see it happen over and over again."}, {"time": 3482, "text": "The only things that seem to change are the clothes people wear and the technologies they use."}, {"time": 3487, "text": "Yeah, and then somebody probably would disagree with you about the clothes."}, {"time": 3493, "text": "Maybe there's also cycles within fashions."}, {"time": 3496, "text": "Maybe we're not even creative there."}, {"time": 3498, "text": "What do you make of Russia and Vladimir Putin?"}, {"time": 3503, "text": "What do you think about Putin as a leader, as a human being on this world stage within the context of the cycles of empires that you think about?"}, {"time": 3513, "text": "Well, Putin came to power at the failure of Russia's last order."}, {"time": 3521, "text": "So there was the end of communism and there was the development of the market economy, the collapse of the Soviet Union."}, {"time": 3530, "text": "And at that time, he was appointed by Yeltsin who was an alcoholic and had problems managing and was put into power."}, {"time": 3545, "text": "And the conditions in the Russia were, there was anarchy, there was no money."}, {"time": 3552, "text": "It had the classic end of cycle ingredients."}, {"time": 3555, "text": "It was broke."}, {"time": 3556, "text": "It was people were fighting with each other."}, {"time": 3558, "text": "It was in the anarchy."}, {"time": 3560, "text": "And that's when he came to power."}, {"time": 3563, "text": "And there were not institutions."}, {"time": 3567, "text": "The whole thing had collapsed and it was not effective ministry of education, ministry of anything."}, {"time": 3574, "text": "And so the idea was that they needed 25 years of stability and they needed a democracy and they needed the improvement of capital markets."}, {"time": 3587, "text": "So he's been in that position as I guess I would call him a semi autocratic leader in that from all indications, he would respect the democracy and he's very popular."}, {"time": 3607, "text": "He's won democratic elections because he's been a strong leader and he's brought peace and stability to Russia after the breakup of the Soviet Union."}, {"time": 3621, "text": "And he's a strong leader in pursuit of the country's interest in a way where Russia is not a significant economic power but it is a significant military power."}, {"time": 3643, "text": "So the issues, and then there's a strong alliance between Russia and China now."}, {"time": 3651, "text": "So that's kind of the lay of the land."}, {"time": 3655, "text": "And then there are sensitivities."}, {"time": 3658, "text": "The Ukraine issue is a sensitivity because of there are a lot of Russians who live in the Ukraine and there's also the issue of NATO on their border."}, {"time": 3671, "text": "So there are those kinds of things and he has military power and he has a strong alliance with China."}, {"time": 3678, "text": "And I guess that's my best summary of what his position is."}, {"time": 3684, "text": "He's a strong leader, popular."}, {"time": 3690, "text": "These are not subjective interpretations."}, {"time": 3693, "text": "These are objective interpretations."}, {"time": 3695, "text": "Yeah, it's interesting just in this conversation, you're not sort of doing the usual criticism of any one particular system."}, {"time": 3705, "text": "You're looking at these systems from the perspective of history."}, {"time": 3708, "text": "You're just describing how they work."}, {"time": 3710, "text": "It's often times when you talk about what Russia is today or what the Soviet Union was or what China is today is you start to criticize."}, {"time": 3718, "text": "Well, they do this kind of censorship or they do this kind of, they limit freedoms in this kind of way."}, {"time": 3725, "text": "But you're just kind of describing this as a nation with ideas, what they think is right."}, {"time": 3731, "text": "This is how they hope to get it to work."}, {"time": 3733, "text": "This is why it's working."}, {"time": 3734, "text": "This is what's not working."}, {"time": 3736, "text": "Here's metrics that show that it's not working."}, {"time": 3739, "text": "I think that's a refreshing way to think about it."}, {"time": 3741, "text": "It's easy though, I mean, you got some criticism saying that I think China is a strict parent."}, {"time": 3750, "text": "Some people criticize these countries for doing, for violating human rights."}, {"time": 3755, "text": "I suppose there's some people that criticize the United States for violating human rights."}, {"time": 3761, "text": "But what are your thoughts on the world stage today about some of the behaviors it has governed in terms of respecting the rights, the basic rights of human beings?"}, {"time": 3775, "text": "You described accurately how I just tried to look at this and how I just tried to look at things in a non, I don't want to impute my values on anybody."}, {"time": 3792, "text": "I mean, there are intolerable things."}, {"time": 3794, "text": "So I'm not saying there aren't intolerable things."}, {"time": 3796, "text": "But one of the great things of being an American here is that I grew up with all different nationalities, having all different points of view and all different religions and all different ways of operating."}, {"time": 3810, "text": "And I've come to treasure the fact that that is, what's their business is their business."}, {"time": 3817, "text": "And then the question is, where do you cross the line under what circumstances that others have got to do it my way."}, {"time": 3825, "text": "And then when you do it internationally, the issue of what is a sovereign state, which as I say in the piece of Westphalia and you have borders and then when do you cross the line that my way of doing things has got to be their way of doing things or what are the various rights."}, {"time": 3846, "text": "And so that's a very delicate question or a very difficult question."}, {"time": 3851, "text": "And we all have responsibilities to different parties and we all have different levels of knowledge about those particular things."}, {"time": 3861, "text": "So for example, as an international investor, I have a responsibility to my investors."}, {"time": 3869, "text": "Those who run companies have a responsibility to theirs of how do they run that."}, {"time": 3874, "text": "So if you're taking Nike or Snickers and so on and Americans can decide whether they wanna buy Chinese products or not buy Chinese products, we are all faced with those types of choices."}, {"time": 3889, "text": "So you have what do you wanna do in your constituency and you have your choices."}, {"time": 3893, "text": "And then beyond that, in many cases, the issues are quite complex, like there are geopolitical questions that enter into it."}, {"time": 3902, "text": "So, and then I believe that if you disconnected, if all those entities like myself, the businesses doing business with China disconnected, I think that that would be disastrous, economically disastrous."}, {"time": 3922, "text": "And it would also be reduce the understanding that comes from working together that helps to reduce wars."}, {"time": 3931, "text": "And so these are all complicated."}, {"time": 3933, "text": "So what we do is, and who makes it my opinion matters the most?"}, {"time": 3939, "text": "Why should it be my opinion that matters the most in making that decision?"}, {"time": 3943, "text": "So I largely look at the government guidance that I get not only from my own government, but from the other governments and I follow the rules."}, {"time": 3952, "text": "I'm in 40, we invest in 40 countries."}, {"time": 3955, "text": "And we wanna do that in the best way to provide the diversified portfolio."}, {"time": 3959, "text": "And we sort of need that."}, {"time": 3961, "text": "Every one of those countries has similar complexities."}, {"time": 3966, "text": "There are always one issue or another, and there's only so much that we really understand about all of those issues."}, {"time": 3973, "text": "So we rely largely on the guidance that we get."}, {"time": 3977, "text": "Yeah, you have to empathize and show respect to the culture of the place, the way things are done."}, {"time": 3983, "text": "You don't necessarily, the way you heal relationships between nations is like you said, you work together."}, {"time": 3992, "text": "And that requires kind of to listen maybe more than you talk."}, {"time": 4000, "text": "And I think people in the public sphere talk a lot about China without really listening, without understanding much about China, though one of the things that makes me really sad because I know how to speak Russian and I know how much is lost in translation."}, {"time": 4017, "text": "It makes me sad that I'll never really get to know the Chinese culture because like, I'll never really get to know the language, the literature, just talk to regular people."}, {"time": 4028, "text": "It's not just the government or officials or scientists, just regular folks, get the culture."}, {"time": 4032, "text": "I think if you don't understand the culture, just the basics of the human nature, what people love about their country, about their family or the kind of hopes they have, what kind of values they have, without that you're not gonna be able to fully connect with them."}, {"time": 4054, "text": "And you have to do that first to have a chance of building a good world."}, {"time": 4059, "text": "I was very lucky because as I say, since 1984, so for more than half of my life, I've been going there and the common people and all sorts of people, and I've got to meet them."}, {"time": 4073, "text": "I don't speak the language, but a combination of through translators or them speaking English and being in situations."}, {"time": 4082, "text": "I had my son go to school, a local school, and we developed those kinds of understandings."}, {"time": 4090, "text": "I think that, but the not wanting to know the other perspective is the thing that's most scary."}, {"time": 4102, "text": "Like I'm right now in the middle and all I want to try to do is to help mutual understanding."}, {"time": 4111, "text": "You're right, if there were questions probing me, asking me, what is it?"}, {"time": 4116, "text": "I'm not on one side or another."}, {"time": 4119, "text": "I don't want to be on one side or another."}, {"time": 4121, "text": "I believe that each has their right within there to approach their different culture in their own way."}, {"time": 4126, "text": "So many ways you gave an example."}, {"time": 4130, "text": "If they're not doing harm to others, I mean, but that issue of trying to understand is so much better."}, {"time": 4143, "text": "That doesn't mean agree with."}, {"time": 4145, "text": "If you are wanting to out clever and out compete somebody, it still pays to understand what they're thinking."}, {"time": 4156, "text": "So to achieve understanding of what they're thinking, even if you want to go to war with them, that understanding is the best thing to have."}, {"time": 4165, "text": "What we have now is a situation in which there's an enemy mentality."}, {"time": 4171, "text": "And that means that anything that serves, seems to be like understanding or conveying understanding, seems to mistakenly create the notion of I'm on their side in a war."}, {"time": 4185, "text": "And that's kind of a dangerous thing because there's a momentum here to fight."}, {"time": 4191, "text": "Henry Kissinger praises your new book and you thank him in it in the dedication."}, {"time": 4199, "text": "What makes him interesting?"}, {"time": 4201, "text": "Maybe what makes him controversial?"}, {"time": 4203, "text": "What makes him such a central figure in history?"}, {"time": 4205, "text": "First, most importantly, he's unique about seeing things through all the others eyes."}, {"time": 4214, "text": "So if you were, it's like there's a chess game."}, {"time": 4218, "text": "I mean, I think geopolitics is like a chess game, but with multiple chess players playing the same game."}, {"time": 4226, "text": "So imagine there are six people around playing the chess game and he could sit in each seat and he could know how they see it, okay?"}, {"time": 4238, "text": "And see it in a calm way of how they see it."}, {"time": 4242, "text": "He's unique in that way."}, {"time": 4243, "text": "He's 98 years old and he's equally able to do that."}, {"time": 4248, "text": "And he has a background in which he's a historian."}, {"time": 4252, "text": "So he really understands history super terrifically."}, {"time": 4258, "text": "He doesn't understand economic history as much."}, {"time": 4262, "text": "So that's why to some extent we enjoy having a conversation because he's interested in the economic piece he doesn't know and I'm so interested in the geopolitical piece that I don't know as well."}, {"time": 4275, "text": "But anyway, he's able to do that, but not only a historian, but a practitioner."}, {"time": 4281, "text": "So when you go from an academic to a practitioner who has that talent to see things through others eyes in an objective way and to be strategic rather than just tactical, that's a very special person and that's why Henry is, to me, a very special person."}, {"time": 4303, "text": "Yeah, he's lived a fascinating life."}, {"time": 4305, "text": "Just all of the world events he's been involved in is fascinating and like you said, that's such an interesting skill to have to consider what are the concerns, the hope, the dreams, the fears of all the people at the table."}, {"time": 4319, "text": "What are they thinking?"}, {"time": 4321, "text": "I find that people don't, once again, don't do that enough when it's the obvious thing you should be doing, whether it's business deals or political negotiation or geopolitical negotiation."}, {"time": 4335, "text": "I'm often surprised, again, sorry to go to the Russian thing because I hear Putin talk in Russian and you start to infer certain intentions, like not the trivial stuff, like the human being."}, {"time": 4350, "text": "What is that human being hoping for himself, for his country, for his close inner circle, for the bigger, and I just see that that's often just lost in translation."}, {"time": 4361, "text": "I just see American leaders talking to Putin and it's just not, there's not a connection."}, {"time": 4368, "text": "Absolutely, I know exactly what you're talking about."}, {"time": 4373, "text": "It has never failed that in my listening to a conversation or even reading a speech and you see then it reported, inevitably, the reporter picks some headline characterization that has very little to do with what was really happening but might be a headline grabber that's at some kind of distortion and there's a lack of understanding of really what's going on."}, {"time": 4405, "text": "If it's okay, let me ask you a couple questions about cryptocurrency."}, {"time": 4409, "text": "You've had a few opinions about Bitcoin over the years."}, {"time": 4412, "text": "What are your thoughts about Bitcoin today, its role in the global financial system and just in human society in general?"}, {"time": 4421, "text": "Well, the evolution of Bitcoin over the years is one of the things that has influenced changes in my view."}, {"time": 4431, "text": "It has proven itself something like 10, 11 years ago."}, {"time": 4437, "text": "Imagine the programming of this and you throw it out and that's the idea."}, {"time": 4442, "text": "It has not been hacked."}, {"time": 4444, "text": "It has operated, it has built, it has come an amazing way over that 11 years to be maybe probably the most excited topic among a lot of people and has been used and is now has obtained the status of having imputed value."}, {"time": 4468, "text": "At the same time, it is one of those assets that is an alternative money."}, {"time": 4475, "text": "I think we're entering an era where there's going to be a competition of monies."}, {"time": 4483, "text": "Because of the printing of fiat money and the depreciated value, there will be a competition of monies and Bitcoin is part of that competition."}, {"time": 4497, "text": "But there'll be many monies, not just crypto monies, but there'll be central bank crypto monies, but there'll be different kinds of monies."}, {"time": 4508, "text": "And even monies are things that you buy and sell."}, {"time": 4512, "text": "NFTs can become a type of money."}, {"time": 4516, "text": "You own it and it's an investment and you could say I'd rather own it than own Bitcoin."}, {"time": 4522, "text": "Has Ray Dalio bought any NFTs?"}, {"time": 4526, "text": "But only just because I definitely want to buy NFTs to just experience them."}, {"time": 4536, "text": "Like I think I should produce one and I should."}, {"time": 4540, "text": "I should have asked that."}, {"time": 4541, "text": "Have you minted an NFT?"}, {"time": 4543, "text": "You probably should just to know what it's like."}, {"time": 4546, "text": "This stuff is happening."}, {"time": 4548, "text": "This stuff is real and how it operates."}, {"time": 4551, "text": "But like all new real things, some are gonna go and some are gonna, it's like in the internet in the year 2000, pets.com could have been a great, but maybe pets.com doesn't make it and who knows."}, {"time": 4568, "text": "That's the beauty of the competitive system that it'll evolve and some things will be treasured and some things will be trashed."}, {"time": 4577, "text": "But when I look at it, I think we are in an environment of what is an alternative money?"}, {"time": 4583, "text": "A money has two purposes, a medium of exchange and a storehold of wealth."}, {"time": 4589, "text": "And we are looking for, and it's portable."}, {"time": 4593, "text": "And it's best if it's recognized in other countries."}, {"time": 4599, "text": "So gold is one of those."}, {"time": 4601, "text": "So I look at it as an alternative gold, but I look at a number of things as alternative gold."}, {"time": 4609, "text": "And I think that, and gold is still my favorite because of certain qualities."}, {"time": 4616, "text": "For example, you can't trace it."}, {"time": 4619, "text": "In Bitcoin, you can trace who owns it, where it's going and so on."}, {"time": 4624, "text": "Governments can't have that ability to trace it and so on."}, {"time": 4627, "text": "A gold piece of coin, it's not connected."}, {"time": 4630, "text": "I think not connected has benefits, particularly in a world where maybe connections can be more risky."}, {"time": 4637, "text": "And then also gold has been for many thousands of years universally recognized as a source of money."}, {"time": 4648, "text": "And central banks, it's the third largest source of money in central bank reserves."}, {"time": 4655, "text": "And I don't think Bitcoin is going to serve those types of purposes and so on."}, {"time": 4660, "text": "So for various reasons, I prefer gold to the other, but it's a little bit part of my mix."}, {"time": 4666, "text": "But then you look at it, it hit, I think 69,000 this year is the high Bitcoin hit."}, {"time": 4672, "text": "Do you think it's possible, you mentioned gold, do you think it's possible it reaches very high numbers, like one million that some people talk about?"}, {"time": 4682, "text": "I don't think that's possible because the way I look at it is there's a certain amount of it."}, {"time": 4691, "text": "A certain amount of it, and there's a certain amount of gold."}, {"time": 4698, "text": "I'll use gold as a benchmark."}, {"time": 4701, "text": "The amount of it is worth about $1 trillion."}, {"time": 4706, "text": "Total crypto is about 2.2 trillion."}, {"time": 4709, "text": "But let's say Bitcoin, it's $1 trillion."}, {"time": 4713, "text": "If you take the amount of money that is in gold that is not used for jewelry purposes and not used by central banks, and I assume Bitcoin won't be used for jewelry purposes or central bank purposes, that amount in gold is about $5 trillion."}, {"time": 4735, "text": "So right now, if you were to have a portfolio that has gold and crypto, gold and Bitcoin, it's worth about 20% of the value of gold."}, {"time": 4747, "text": "Do I think it's going to be worth more than gold in terms of that mix?"}, {"time": 4754, "text": "I don't think it'll be worth more than gold."}, {"time": 4756, "text": "But let's say it became worth as much as gold."}, {"time": 4761, "text": "I don't believe it will be."}, {"time": 4762, "text": "I think that 20% sounds kind of about right."}, {"time": 4765, "text": "I really don't know what the right answer is."}, {"time": 4769, "text": "And then there's the question of what is all of that pool of money that let's say gold and gold equivalents relative to everything else?"}, {"time": 4777, "text": "Does it go from, let's call it six, seven, eight trillion to 16 trillion?"}, {"time": 4784, "text": "Maybe it could double."}, {"time": 4786, "text": "It depends what it is in the world environment."}, {"time": 4788, "text": "But basically, if you use gold as a measure, it just makes no sense that it's going to be used that much more."}, {"time": 4800, "text": "Am I sure about that?"}, {"time": 4801, "text": "I'm not sure about anything."}, {"time": 4803, "text": "But logically, it seems to me that there's a limitation on its price in relationship to other things that are like it."}, {"time": 4813, "text": "Let me ask for your deep financial analysis on a very important issue."}, {"time": 4817, "text": "I just talked a couple days ago with Elon Musk."}, {"time": 4820, "text": "He wants to put a literal Dogecoin on the moon."}, {"time": 4823, "text": "What are your thoughts about Dogecoin?"}, {"time": 4827, "text": "And do you think it'll be the official currency?"}, {"time": 4830, "text": "How many be reserve currency on the moon and on Mars?"}, {"time": 4835, "text": "My reaction is that's cute."}, {"time": 4837, "text": "I remember Elon when he first got, he first got his money from PayPal."}, {"time": 4842, "text": "I think he said to me it was, he got $180 million, $90 million."}, {"time": 4848, "text": "He decided to say, why aren't we going to outer space?"}, {"time": 4852, "text": "And he wanted to take a spaceship that would be modified using Russian technology to put a plant and a watering can on the moon or on Mars, I think it was."}, {"time": 4874, "text": "And he said, first life on Mars, or first life on that as an inspiring notion."}, {"time": 4883, "text": "And so then there's always what's behind it."}, {"time": 4887, "text": "I have a lot of respect for Elon's ability to do other things behind it."}, {"time": 4894, "text": "And so I would take that as symbolic and I'd be asking him what's behind it, what's next."}, {"time": 4901, "text": "And I'm also just on the topic of Dogecoin and memecoin and there's some aspect of humor and lightheartedness that's really interesting about the way we communicate, what ideas become viral, how to captivate people with ideas."}, {"time": 4917, "text": "There's something about taking things too seriously that somehow slows it all down and it's interesting."}, {"time": 4923, "text": "That's part of human nature somehow."}, {"time": 4925, "text": "So like humor is part of this whole thing."}, {"time": 4929, "text": "You've talked about the importance of writing ideas down and you have a fascinating."}, {"time": 4935, "text": "Principles in particular."}, {"time": 4937, "text": "Principles."}, {"time": 4938, "text": "And you have this really nice thing in your book where you actually, I mean there's such a brilliant way."}, {"time": 4946, "text": "You have such a brilliant way of highlighting which parts are extra important and you make them bold."}, {"time": 4953, "text": "That's a brilliant idea."}, {"time": 4954, "text": "But let me just ask the high level question of what's a good system for taking notes?"}, {"time": 4962, "text": "Well, I find that almost everything happens over and over again."}, {"time": 4966, "text": "And we're in the blizzard of these things happening."}, {"time": 4972, "text": "And what I found is that if I'm making a decision that after I make the decision usually or write at the time, if I pause and reflect and I write my principle down, in other words, principle is sort of a recipe, what would I use to, how would I make that decision?"}, {"time": 4996, "text": "And what are the criteria around it?"}, {"time": 4998, "text": "I find that I make it much more clear, it becomes clearer and it applies to the next thing that comes along, it'll be that way."}, {"time": 5008, "text": "Because everything happens over and over and over again and I think people make the mistake of looking at just the one like it's the first one."}, {"time": 5017, "text": "I don't know, they have the first problem of this sort or the first child or whatever it is."}, {"time": 5022, "text": "And this has been happening plenty of times."}, {"time": 5024, "text": "And so if you have the principles, I found that that helped me think more clearly about it and it helped me communicate better, like why."}, {"time": 5034, "text": "And so over the years, over the last 30 years or so, that's what I've done."}, {"time": 5040, "text": "I did it originally to communicate very well with the people I work with."}, {"time": 5044, "text": "I set up my company and it was very important to have good communication."}, {"time": 5049, "text": "And then we could debate the principles and so that's the process."}, {"time": 5054, "text": "I urge people to do that."}, {"time": 5056, "text": "There are many excellent decision makers and I just wish that they wrote down their principles."}, {"time": 5063, "text": "When this set, so for example, we talk about Henry Kissinger and his new book is gonna come out with a book on leadership."}, {"time": 5073, "text": "And don't just describe the leaders, describe then what about them were the essential elements to make a good leader under what circumstances."}, {"time": 5084, "text": "And so if we think about that, then also then you begin to think in a principled way."}, {"time": 5091, "text": "And then when you start to think in a principled way, life becomes, it's so much easier to make decisions and it's so much less confusing because it's like coming up on a species and you say, okay, well, what species is it?"}, {"time": 5108, "text": "Not just another, it's a thing."}, {"time": 5110, "text": "No, what species is it and how do I deal with that species effectively?"}, {"time": 5115, "text": "And so that's what that is."}, {"time": 5117, "text": "And so I encourage people to write it down."}, {"time": 5120, "text": "I wish anybody who's successful wrote down their principles or their recipes for making those types of decisions."}, {"time": 5127, "text": "So the events of interest here happens over and over and over in similar ways."}, {"time": 5133, "text": "As you're looking for the patterns and you're defining the process, that's right to respond to those patterns and you call that the principles and that allows you to deal with the future effectively."}, {"time": 5146, "text": "So like that codifies the lessons from the past to be able to deal with the future."}, {"time": 5152, "text": "What advice do you have for young folks today?"}, {"time": 5155, "text": "In high school, in college, thinking about how to live, have a career they can be proud of or maybe have a life they can be proud of?"}, {"time": 5165, "text": "Know yourself, follow your passion, make your work and passion the same thing while considering the money part because money will get you freedom and choice and be able to bank that."}, {"time": 5179, "text": "But if you know yourself, feel the pull and pursue that passion."}, {"time": 5189, "text": "And along those lines, by the way, I found that using personality profile tests has been very helpful."}, {"time": 5198, "text": "I've used those for about 25 years for people to help to understand themselves and understand each other."}, {"time": 5203, "text": "So I created a free one that is called Principles You."}, {"time": 5209, "text": "It's online."}, {"time": 5211, "text": "It's had remarkable, loving people who've taken it, learn about themselves, but also you can put in somebody else and it'll tell you about your relationship with them."}]}]