[{"title": "Daniel Schmachtenberger: Steering Civilization Away from Self-Destruction | Lex Fridman Podcast #191", "id": "hGRNUw559SE", "quotes": [{"time": 381, "text": "What do you make sense of all of that, because it's gained quite a bit of popularity recently."}, {"time": 386, "text": "There's some sense in which that's us humans being hopeful and dreaming of otherworldly creatures as a way to escape the dreariness of our of the human condition."}, {"time": 404, "text": "But in another sense, it could be it really could be something truly exciting that science should turn its eye towards."}, {"time": 413, "text": "So what do you where do you place it?"}, {"time": 416, "text": "Speaking of turning eye towards this is one of those super fascinating, actually super consequential possibly topics that I wish I had more time to study and just haven't allocated so I don't have firm beliefs on this because I haven't got to study it as much as I want."}, {"time": 430, "text": "So what I'm going to say comes from a superficial assessment."}, {"time": 435, "text": "While we know there are plenty of things that people thought of as UFO sightings that we can fully write off, we have other better explanations for them."}, {"time": 444, "text": "What we're interested in is the ones that we don't have better explanations for and then not just immediately jumping to a theory of what it is, but holding it as unidentified and being being curious and earnest."}, {"time": 456, "text": "I think the the tic tac one is quite interesting and made it in major media recently."}, {"time": 462, "text": "But I don't know if you ever saw the Disclosure Project, a guy named Steven Greer organized a bunch of mostly US military and some commercial flight people who had direct observation and classified information disclosing it at a CNN briefing."}, {"time": 482, "text": "And so you saw high ranking generals, admirals, fighter pilots all describing things that they saw on radar with their own eyes or cameras, and also describing some phenomena that had some consistency across different people."}, {"time": 500, "text": "And I find this interesting enough that I think it would be silly to just dismiss it."}, {"time": 507, "text": "And specifically, we can ask the question, how much of it is natural phenomena, ball lightning or something like that?"}, {"time": 514, "text": "And this is why I'm more interested in what fighter pilots and astronauts and people who are trained in being able to identify flying objects and atmospheric phenomena have to say about it."}, {"time": 531, "text": "I think the thing then you could say, well, are they more advanced military craft?"}, {"time": 537, "text": "Is it some kind of, you know, human craft?"}, {"time": 540, "text": "The interesting thing that a number of them describe is something that's kind of like right angles at speed, or not right angles, acute angles at speed, but something that looks like a different relationship to inertia than physics makes sense for us."}, {"time": 554, "text": "I don't think that there are any human technologies that are doing that even in really deep underground black projects."}, {"time": 562, "text": "Now one could say, okay, well, could it be a hologram?"}, {"time": 565, "text": "Or would it show up on radar if radar is also seeing it?"}, {"time": 570, "text": "I think there's enough, I mean, and for that to be a massive coordinated psyop, is it as interesting and ridiculous in a way as the idea that it's UFOs from some extra planetary source?"}, {"time": 586, "text": "So it's up there on the interesting topics."}, {"time": 589, "text": "To me there's, if it is at all alien technology, it is the dumbest version of alien technology."}, {"time": 597, "text": "It's so far away, it's like the old, old crappy VHS tapes of alien technology."}, {"time": 603, "text": "These are like crappy drones that just floated or even like space to the level of like space junk because it is so close to our human technology."}, {"time": 614, "text": "We talk about it moves in ways that's unlike what we understand about physics, but it still has very similar kind of geometric notions and something that we humans can perceive with our eyes, all those kinds of things."}, {"time": 628, "text": "I feel like alien technology most likely would be something that we would not be able to perceive."}, {"time": 635, "text": "Not because they're hiding, but because it's so far advanced that it would be beyond the cognitive capabilities of us humans."}, {"time": 645, "text": "Just as you were saying, as per your answer for alien summarizing Earth, the starting assumption is they have similar perception systems, they have similar cognitive capabilities, and that very well may not be the case."}, {"time": 661, "text": "Let me ask you about staying in aliens for just a little longer because I think it's a good transition in talking about governments and human societies."}, {"time": 720, "text": "Well, we can certainly see when certain things become declassified 25 or 50 years later that there were things that the public might have wanted to know that were kept secret for a very long time for reasons of at least supposedly national security, which is also a nice source of plausible deniability for people covering their ass for doing things that would be problematic and other purposes."}, {"time": 754, "text": "There are, there's a scientist at Stanford who supposedly got some material that was recovered from Area 51 type area, did analysis on it using, I believe, electron microscopy and a couple other methods and came to the idea that it was a nanotech alloy that was something we didn't currently have the ability to do, was not naturally occurring."}, {"time": 780, "text": "So there, I've heard some things and again, like I said, I'm not going to stand behind any of these because I haven't done the level of study to have high confidence."}, {"time": 820, "text": "So there's a question as to like the two are not necessarily mutually exclusive and it could be possible to, some people run a hypothesis that they create intentional amounts of exposure as an invitation of a particular kind, who knows, interesting field."}, {"time": 878, "text": "So it's actually ripples through space time that they generate."}, {"time": 883, "text": "Why is it that you couldn't use that, it travels the speed of light, travels at a speed which is a very weird thing to say when you're morphing space time, you could argue it's faster than the speed of light."}, {"time": 902, "text": "So if you're able to communicate by, to summon enough energy to generate black holes and to orbit them, to force them to orbit each other, why not travel as the ripples in space time, whatever the hell that means, somehow combined with wormholes."}, {"time": 921, "text": "So if you're able to communicate through, like we don't think of gravitational waves as something you can communicate with because the radio will have to be a very large size and very dense, but perhaps that's it, perhaps that's one way to communicate, it's a very effective way."}, {"time": 941, "text": "And that would explain, like we wouldn't even be able to make sense of that, of the physics that results in an alien species that's able to control gravity at that scale."}, {"time": 953, "text": "I think you just jumped up the Kardashev scale so far that you're not just harnessing the power of a star, but harnessing the power of mutually rotating black holes."}, {"time": 965, "text": "That's way above my physics pay grade to think about including even non rotating black hole versions of transwarp travel."}, {"time": 977, "text": "I think, you know, you can talk with Eric more about that, I think he has better ideas on it than I do."}, {"time": 983, "text": "My hope for the future of humanity mostly does not rest in the near term on our ability to get to other habitable planets in time."}, {"time": 993, "text": "And even more than that, in the list of possible solutions of how to improve human civilization, orbiting black holes is not on the first page for you."}, {"time": 1003, "text": "Not on the first page."}, {"time": 1005, "text": "I bet you did not expect us to start this conversation here, but I'm glad the places it went."}, {"time": 1048, "text": "I don't know what would be more exciting if those colonies of single cell type organisms, what would be more exciting if they're different or they're the same?"}, {"time": 1059, "text": "If they're the same, that means through the rest of the universe, there's life forms like us, something like us everywhere."}, {"time": 1071, "text": "If they're different, that's also really exciting because there's life forms everywhere that are not like us."}, {"time": 1080, "text": "That's a little bit scary."}, {"time": 1081, "text": "I don't know what's scarier actually."}, {"time": 1084, "text": "I think both scary and exciting no matter what, right?"}, {"time": 1088, "text": "The idea that they could be very different is philosophically very interesting for us to open our aperture on what life and consciousness and self replicating possibilities could look like."}, {"time": 1099, "text": "The question on are they different or the same, obviously there's lots of life here that is the same in some ways and different in other ways."}, {"time": 1106, "text": "When you take the thing that we call an invasive species is something that's still pretty the same hydrocarbon based thing, but co evolved with co selective pressures in a certain environment, we move it to another environment, it might be devastating to that whole ecosystem because it's just different enough that it messes up the self stabilizing dynamics of that ecosystem."}, {"time": 1124, "text": "So the question of are they, would they be different in ways where we could still figure out a way to inhabit a biosphere together or fundamentally not fundamentally the nature of how they operate and the nature of how we operate would be incommensurable is a deep question."}, {"time": 1145, "text": "Well, we offline talked about mimetic theory, right?"}, {"time": 1150, "text": "It seems like if there were sufficiently different where we would not even, we can coexist on different planes, it seems like a good thing."}, {"time": 1159, "text": "If we're close enough together to where we'd be competing, then it's, you're getting into the world of viruses and pathogens and all those kinds of things to where we would, one of us would die off quickly through basically mass murder without even accidentally."}, {"time": 1180, "text": "If we just had a self replicating single celled kind of creature that happened to not work well for the hydrocarbon life that was here that got introduced because he either output something that was toxic or utilized up the same resource too quickly and it just replicated faster and mutated faster, that it wouldn't be a mimetic theory, conflict theory kind of harm."}, {"time": 1205, "text": "It would just be a Von Neumann machine, a self replicating machine that was fundamentally incompatible with these kinds of self replicating systems with faster OODA loops."}, {"time": 1216, "text": "For one final time, putting your alien God hat on and you look at human civilization, do you think about the 7.8 billion people on earth as individual little creatures, individual little organisms, or do you think of us as one organism with a collective intelligence?"}, {"time": 1241, "text": "What's the proper framework through which to analyze it again as an alien?"}, {"time": 1246, "text": "So that I know where you're coming from, would you have asked the question the same way before the industrial revolution, before the agricultural revolution when there were half a billion people and no telecommunications connecting them?"}, {"time": 1259, "text": "I would indeed ask the question the same way, but I would be less confident about your conclusions."}, {"time": 1269, "text": "It would be an actually more interesting way to ask the question at that time, but I was nevertheless asked it the same way."}, {"time": 1275, "text": "Well, let's go back further and smaller than rather than just a single human or the entire human species, let's look at a relatively isolated tribe."}, {"time": 1287, "text": "In the relatively isolated, probably sub Dunbar number, sub 150 people tribe, do I look at that as one entity where evolution is selecting for based on group selection or do I think of it as 150 individuals that are interacting in some way?"}, {"time": 1305, "text": "Well, could those individuals exist without the group?"}, {"time": 1312, "text": "The evolutionary adaptiveness of humans was involved critically group selection and individual humans alone trying to figure out stone tools and protection and whatever aren't what was selected for."}, {"time": 1329, "text": "And so I think the or is the wrong frame."}, {"time": 1333, "text": "I think it's individuals are affecting the group that they're a part of."}, {"time": 1340, "text": "They're also dependent upon and being affected by the group that they're part of."}, {"time": 1345, "text": "And so this now starts to get deep into political theories also, which is theories that orient towards the collective at different scales, whether a tribal scale or an empire or a nation state or something, and ones that orient towards the individual liberalism and stuff like that."}, {"time": 1360, "text": "And I think there's very obvious failure modes on both sides."}, {"time": 1363, "text": "And so the relationship between them is more interesting to me than either of them."}, {"time": 1367, "text": "The relationship between the individual and the collective and the question around how to have a virtuous process between those."}, {"time": 1372, "text": "So a good social system would be one where the organism of the individual and the organism of the group of individuals is they're both synergistic to each other."}, {"time": 1382, "text": "So what is best for the individuals and what's best for the whole is aligned."}, {"time": 1385, "text": "But there is nevertheless an individual."}, {"time": 1388, "text": "They're not, it's a matter of degrees, I suppose, but what defines a human more, the social network within which they've been brought up, through which they've developed their intelligence or is it their own sovereign individual self?"}, {"time": 1413, "text": "What's your intuition of how much, not just for evolutionary survival, but as intellectual beings, how much do we need others for our development?"}, {"time": 1425, "text": "I think we have a weird sense of this today relative to most previous periods of sapient history."}, {"time": 1433, "text": "I think the vast majority of sapient history is tribal, like depending upon your early human model, 200,000 or 300,000 years of homo sapiens and little tribes, where they depended upon that tribe for survival and excommunication from the tribe was fatal."}, {"time": 1452, "text": "I think they, and our whole evolutionary genetic history is in that environment and the amount of time we've been out of it is relatively so tiny."}, {"time": 1460, "text": "And then we still depended upon extended families and local communities more and the big kind of giant market complex where I can provide something to the market to get money, to be able to get other things from the market where it seems like I don't need anyone."}, {"time": 1475, "text": "It's almost like disintermediating our sense of need, even though you're in my ability to talk to each other using these mics and the phones that we coordinated on took millions of people over six continents to be able to run the supply chains that made all the stuff that we depend on, but we don't notice that we depend upon them."}, {"time": 1492, "text": "They all seem fungible."}, {"time": 1496, "text": "If you take a baby, obviously that you didn't even get to a baby without a mom."}, {"time": 1500, "text": "Was it dependent?"}, {"time": 1501, "text": "Are we dependent upon each other, right, without two parents at minimum and they depended upon other people."}, {"time": 1506, "text": "But if we take that baby and we put it out in the wild, it obviously dies."}, {"time": 1511, "text": "So if we let it grow up for a little while, the minimum amount of time where it starts to have some autonomy and then we put it out in the wild, and this has happened a few times, it doesn't learn language and it doesn't learn the small motor articulation that we learn."}, {"time": 1527, "text": "It doesn't learn the type of consciousness that we end up having that is socialized."}, {"time": 1534, "text": "So I think we take for granted how much conditioning affects us."}, {"time": 1541, "text": "Is it possible that it affects basically 99.9 or maybe the whole thing?"}, {"time": 1549, "text": "The whole thing is the connection between us humans and that we're no better than apes without our human connections."}, {"time": 1559, "text": "Because thinking of it that way forces us to think very differently about human society and how to progress forward if the connections are fundamental."}, {"time": 1569, "text": "I just have to object to the no better than apes, because better here I think you mean a specific thing, which means have capacities that are fundamentally different than."}, {"time": 1577, "text": "I think apes also depend upon troops."}, {"time": 1581, "text": "And I think the idea of humans as better than nature in some kind of ethical sense ends up having heaps of problems."}, {"time": 1590, "text": "We'll table that."}, {"time": 1591, "text": "We can come back to it."}, {"time": 1592, "text": "But when we say what is unique about Homo sapien capacity relative to the other animals we currently inhabit the biosphere with, and I'm saying it that way because there were other early hominids that had some of these capacities, we believe."}, {"time": 1607, "text": "Our tool creation and our language creation and our coordination are all kind of the results of a certain type of capacity for abstraction."}, {"time": 1616, "text": "And other animals will use tools, but they don't evolve the tools they use."}, {"time": 1619, "text": "They keep using the same types of tools that they basically can find."}, {"time": 1623, "text": "So a chimp will notice that a rock can cut a vine that it wants to, and it'll even notice that a sharper rock will cut it better."}, {"time": 1630, "text": "And experientially it'll use the sharper rock."}, {"time": 1632, "text": "And if you even give it a knife, it'll probably use the knife because it's experiencing the effectiveness."}, {"time": 1636, "text": "But it doesn't make stone tools because that requires understanding why one is sharper than the other."}, {"time": 1643, "text": "What is the abstract principle called sharpness to then be able to invent a sharper thing?"}, {"time": 1648, "text": "That same abstraction makes language and the ability for abstract representation, which makes the ability to coordinate in a more advanced set of ways."}, {"time": 1658, "text": "So I do think our ability to coordinate with each other is pretty fundamental to the selection of what we are as a species."}, {"time": 1666, "text": "I wonder if that coordination, that connection is actually the thing that gives birth to consciousness, that gives birth to, well, let's start with self awareness."}, {"time": 1676, "text": "More like theory of mind."}, {"time": 1677, "text": "Theory of mind."}, {"time": 1679, "text": "You know, I suppose there's experiments that show that there's other mammals that have a very crude theory of mind."}, {"time": 1685, "text": "Not sure."}, {"time": 1686, "text": "Maybe dogs, something like that."}, {"time": 1688, "text": "But actually dogs probably has to do with that they co evolved with humans."}, {"time": 1692, "text": "See it'd be interesting if that theory of mind is what leads to consciousness in the way we think about it."}, {"time": 1701, "text": "Is the richness of the subjective experience that is consciousness."}, {"time": 1704, "text": "I have an inkling sense that that only exists because we're social creatures."}, {"time": 1711, "text": "That doesn't come with the hardware and the software in the beginning."}, {"time": 1716, "text": "That's learned as an effective tool for communication almost."}, {"time": 1725, "text": "I think we think that consciousness is fundamental."}, {"time": 1729, "text": "And maybe it's not, there's a bunch of folks kind of criticize the idea that the illusion of consciousness is consciousness."}, {"time": 1740, "text": "That it is just a facade we use to help us construct theories of mind."}, {"time": 1748, "text": "You almost put yourself in the world as a subjective being."}, {"time": 1752, "text": "And that experience, you want to richly experience it as an individual person so that I could empathize with your experience."}, {"time": 1760, "text": "I find that notion compelling."}, {"time": 1762, "text": "Mostly because it allows you to then create robots that become conscious not by being quote unquote conscious but by just learning to fake it till they make it."}, {"time": 1777, "text": "Present a facade of consciousness with the task of making that facade very convincing to us humans and thereby it will become conscious."}, {"time": 1788, "text": "Have a sense that in some way that will make them conscious if they're sufficiently convincing to humans."}, {"time": 1798, "text": "Is there some element of that that you find convincing?"}, {"time": 1805, "text": "This is a much harder set of questions and deep end of the pool than starting with the aliens was."}, {"time": 1815, "text": "We went from aliens to consciousness."}, {"time": 1818, "text": "This is not the trajectory I was expecting nor you, but let us walk a while."}, {"time": 1824, "text": "We can walk a while and I don't think we will do it justice."}, {"time": 1827, "text": "So what do we mean by consciousness versus conscious self reflective awareness?"}, {"time": 1834, "text": "What do we mean by awareness, qualia, theory of mind?"}, {"time": 1838, "text": "There's a lot of terms that we think of as slightly different things and subjectivity, first person."}, {"time": 1846, "text": "I don't remember exactly the quote, but I remember when reading when Sam Harris wrote the book Free Will and then Dennett critiqued it and then there was some writing back and forth between the two because normally they're on the same side of kind of arguing for critical thinking and logical fallacies and philosophy of science against supernatural ideas."}, {"time": 1871, "text": "And here Dennett believed there is something like free will."}, {"time": 1875, "text": "He is a determinist compatibilist, but no consciousness and a radical element of this."}, {"time": 1881, "text": "And Sam was saying, no, there is consciousness, but there's no free will."}, {"time": 1884, "text": "And that's like the most fundamental kinds of axiomatic senses they disagreed on, but neither of them could say it was because the other one didn't understand the philosophy of science or logical fallacies."}, {"time": 1894, "text": "And they kind of spoke past each other and at the end, if I remember correctly, Sam said something that I thought was quite insightful, which was to the effect of it seems, because they weren't making any progress in shared understanding, it seems that we simply have different intuitions about this."}, {"time": 1909, "text": "And what you could see was that what the words meant, right at the level of symbol grounding, might be quite different."}, {"time": 1919, "text": "One of them might have had deeply different enough life experiences that what is being referenced and then also different associations of what the words mean."}, {"time": 1926, "text": "This is why when trying to address these things, Charles Sanders Peirce said the first philosophy has to be semiotics, because if you don't get semiotics right, we end up importing different ideas and bad ideas right into the nature of the language that we're using."}, {"time": 1940, "text": "And then it's very hard to do epistemology or ontology together."}, {"time": 1942, "text": "So, I'm saying this to say why I don't think we're going to get very far is I think we would have to go very slowly in terms of defining what we mean by words and fundamental concepts."}, {"time": 1953, "text": "Well, and also allowing our minds to drift together for a time so that our definitions of these terms align."}, {"time": 1962, "text": "I think there's some, there's a beauty that some people enjoy with Sam that he is quite stubborn on his definitions of terms without often clearly revealing that definition."}, {"time": 1979, "text": "So in his mind, he can sense that he can deeply understand what he means exactly by a term like free will and consciousness."}, {"time": 1988, "text": "And you're right, he's very specific in fascinating ways that not only does he think that free will is an illusion, he thinks he's able, not thinks, he says he's able to just remove himself from the experience of free will and just be like for minutes at a time, hours at a time, like really experience as if he has no free will, like he's a leaf flowing down the river."}, {"time": 2021, "text": "And given that, he's very sure that consciousness is fundamental."}, {"time": 2025, "text": "So here's this conscious leaf that's subjectively experiencing the floating and yet has no ability to control and make any decisions for itself."}, {"time": 2036, "text": "It's only a, the decisions have all been made."}, {"time": 2042, "text": "There's some aspect to which the terminology there perhaps is the problem."}, {"time": 2046, "text": "So that's a particular kind of meditative experience and the people in the Vedantic tradition and some of the Buddhist traditions thousands of years ago described similar experiences and somewhat similar conclusions, some slightly different."}, {"time": 2089, "text": "And I think the types of experience we've had and then one, the types of experience we've had make a big deal to the nature of how we do symbol grounding."}, {"time": 2098, "text": "The other thing is the types of experiences we have can't not be interpreted through our existing interpretive frames and most of the time our interpretive frames are unknown even to us, some of them."}, {"time": 2109, "text": "And so this is a tricky, this is a tricky topic."}, {"time": 2115, "text": "So I guess there's a bunch of directions we could go with it but I want to come back to what the impulse was that was interesting around what is consciousness and how does it relate to us as social beings and how does it relate to the possibility of consciousness with AIs."}, {"time": 2130, "text": "Right, you're keeping us on track which is, which is wonderful, you're a wonderful hiking partner."}, {"time": 2137, "text": "Let's go back to the initial impulse of what is consciousness and how does the social impulse connect to consciousness?"}, {"time": 2145, "text": "Is consciousness a consequence of that social connection?"}, {"time": 2150, "text": "I'm going to state a position and not argue it because it's honestly like it's a long hard thing to argue and we can totally do it another time if you want."}, {"time": 2160, "text": "I don't subscribe to consciousness as an emergent property of biology or neural networks."}, {"time": 2171, "text": "Obviously a lot of people do, obviously the philosophy of science orients towards that in not absolutely but largely."}, {"time": 2184, "text": "I think of the nature of first person, the universe of first person, of qualia as experience, sensation, desire, emotion, phenomenology, but the felt sense, not the we say emotion and we think of a neurochemical pattern or an endocrine pattern."}, {"time": 2205, "text": "But all of the physical stuff, the third person stuff has position and momentum and charge and stuff like that that is measurable, repeatable."}, {"time": 2215, "text": "I think of the nature of first person and third person as ontologically orthogonal to each other, not reducible to each other."}, {"time": 2223, "text": "They're different kinds of stuff."}, {"time": 2226, "text": "So I think about the evolution of third person that we're quite used to thinking about from subatomic particles to atoms to molecules to on and on."}, {"time": 2260, "text": "Obviously Bohm talked about an implicate order that was deeper than and gave rise to the explicate order of both."}, {"time": 2268, "text": "Nagel talks about something like that."}, {"time": 2269, "text": "I have a slightly different sense of that, but again, I'll just kind of not argue how that occurs for a moment and say, so rather than say, does consciousness emerge from, I'll talk about do higher capacities of consciousness emerge in relationship with."}, {"time": 2287, "text": "So it's not first person as a category emerging from third person, but increased complexity within the nature of first person and third person co evolving."}, {"time": 2297, "text": "Do I think that it seems relatively likely that more advanced neural networks have deeper phenomenology, more complex, where it goes just from basic sensation to emotion to social awareness to abstract cognition to self reflexive abstract cognition?"}, {"time": 2316, "text": "But I wouldn't say that's the emergence of consciousness."}, {"time": 2317, "text": "I would say it's increased complexity within the domain of first person corresponding to increased complexity and the correspondence should not automatically be seen as causal."}, {"time": 2326, "text": "We can get into the arguments for why that often is the case."}, {"time": 2330, "text": "So would I say that obviously the sapient brain is pretty unique and a single sapient now has that, right?"}, {"time": 2338, "text": "Even if it took sapiens evolving in tribes based on group selection to make that brain."}, {"time": 2343, "text": "So the group made it now that brain is there."}, {"time": 2346, "text": "Now if I take that single person with that brain out of the group and try to raise them in a box, they'll still not be very interesting even with the brain."}, {"time": 2354, "text": "But the brain does give hardware capacities that if conditioned in relationship can have interesting things emerge."}, {"time": 2361, "text": "So do I think that the human biology, types of human consciousness and types of social interaction all co emerged and co evolved?"}, {"time": 2373, "text": "As a small aside, as you're talking about the biology, let me comment that I spent, this is what I do, this is what I do with my life."}, {"time": 2381, "text": "This is why I will never accomplish anything is I spent much of the morning trying to do research on how many computations the brain performs and how much energy it uses versus the state of the art CPUs and GPUs arriving at about 20 quadrillion."}, {"time": 2400, "text": "So that's two to the 10 to the 16 computations."}, {"time": 2403, "text": "So synaptic firings per second that the brain does."}, {"time": 2408, "text": "And that's about a million times faster than the let's say the 20 thread state of the arts Intel CPU, the 10th generation."}, {"time": 2421, "text": "And then there's similar calculation for the GPU and all ended up also trying to compute that it takes 10 watts to run the brain about."}, {"time": 2432, "text": "And then what does that mean in terms of calories per day, kilocalories?"}, {"time": 2436, "text": "That's about for an average human brain, that's 250 to 300 calories a day."}, {"time": 2444, "text": "And so it ended up being a calculation where you're doing about 20 quadrillion calculations that are fueled by something like depending on your diet, three bananas."}, {"time": 2459, "text": "So three bananas results in a computation that's about a million times more powerful than the current state of the art computers."}, {"time": 2468, "text": "Now, let's take that one step further."}, {"time": 2470, "text": "There's some assumptions built in there."}, {"time": 2472, "text": "The assumption is that one, what the brain is doing is just computation."}, {"time": 2477, "text": "Two, the relevant computations are synaptic firings and that there's nothing other than synaptic firings that we have to factor."}, {"time": 2485, "text": "So I'm forgetting his name right now."}, {"time": 2488, "text": "There's a very famous neuroscientist at Stanford just passed away recently who did a lot of the pioneering work on glial cells and showed that his assessment glial cells did a huge amount of the thinking, not just neurons."}, {"time": 2502, "text": "And it opened up this entirely different field of like what the brain is and what consciousness is."}, {"time": 2507, "text": "You look at Damasio's work on embodied cognition and how much of what we would consider consciousness or feeling is happening outside of the nervous system completely, happening in endocrine process involving lots of other cells and signal communication."}, {"time": 2520, "text": "You talk to somebody like Penrose who you've had on the show and even though the Penrose Hammerhoff conjecture is probably not right, is there something like that that might be the case where we're actually having to look at stuff happening at the level of quantum computation of microtubules?"}, {"time": 2534, "text": "I'm not arguing for any of those."}, {"time": 2536, "text": "I'm arguing that we don't know how big the unknown unknown set is."}, {"time": 2540, "text": "Well, at the very least, this has become like an infomercial for the human brain."}, {"time": 2546, "text": "At the very, but wait, there's more."}, {"time": 2549, "text": "At the very least, the three bananas buys you a million times."}, {"time": 2553, "text": "At the very least."}, {"time": 2555, "text": "That's impressive."}, {"time": 2556, "text": "And then you could have, and then the synaptic firings we're referring to is strictly the electrical signals."}, {"time": 2562, "text": "That could be the mechanical transmission of information, there's chemical transmission of information, there's all kinds of other stuff going on."}, {"time": 2569, "text": "And then there's memory that's built in, that's also all tied in."}, {"time": 2572, "text": "Not to mention, which I'm learning more and more about, it's not just about the neurons."}, {"time": 2578, "text": "It's also about the immune system that's somehow helping with the computation."}, {"time": 2582, "text": "So the entirety and the entire body is helping with the computation."}, {"time": 2586, "text": "So the three bananas."}, {"time": 2587, "text": "It could buy you a lot."}, {"time": 2592, "text": "But on the topic of sort of the greater degrees of complexity emerging in consciousness, I think few things are as beautiful and inspiring as taking a step outside of the human brain, just looking at systems where simple rules create incredible complexity."}, {"time": 2616, "text": "Not create."}, {"time": 2618, "text": "Incredible complexity emerges."}, {"time": 2620, "text": "So one of the simplest things to do that with is cellular automata."}, {"time": 2626, "text": "And there's, I don't know what it is, and maybe you can speak to it, we will certainly talk about the implications of this, but there's so few things that are as awe inspiring to me as knowing the rules of a system and not being able to predict what the heck it looks like."}, {"time": 2648, "text": "And it creates incredibly beautiful complexity that when zoomed out on, looks like there's actual organisms doing things that operate on a scale much higher than the underlying mechanism."}, {"time": 2667, "text": "So with cellular automata, that's cells that are born and die."}, {"time": 2671, "text": "Born and die and they only know about each other's neighbors."}, {"time": 2674, "text": "And there's simple rules that govern that interaction of birth and death."}, {"time": 2678, "text": "And then they create, at scale, organisms that look like they take up hundreds or thousands of cells and they're moving, they're moving around, they're communicating, they're sending signals to each other."}, {"time": 2691, "text": "And you forget at moments at a time before you remember that the simple rules on cells is all that it took to create that."}, {"time": 2704, "text": "It's sad in that we can't come up with a simple description of that system that generalizes the behavior of the large organisms."}, {"time": 2719, "text": "We can only come up, we can only hope to come up with the thing, the fundamental physics or the fundamental rules of that system, I suppose."}, {"time": 2725, "text": "It's sad that we can't predict everything we know about the mathematics of those systems."}, {"time": 2729, "text": "It seems like we can't really in a nice way, like economics tries to do, to predict how this whole thing will unroll."}, {"time": 2737, "text": "But it's beautiful because of how simple it is underneath it all."}, {"time": 2742, "text": "So what do you make of the emergence of complexity from simple rules?"}, {"time": 2749, "text": "What the hell is that about?"}, {"time": 2751, "text": "Well, we can see that something like flocking behavior, the murmuration, can be computer coded."}, {"time": 2757, "text": "It's a very hard set of rules to be able to see some of those really amazing types of complexity."}, {"time": 2763, "text": "And the whole field of complexity science and some of the subdisciplines like Stigma G are studying how following fairly simple responses to a pheromone signal do ant colonies do this amazing thing where what you might describe as the organizational or computational capacity of the colony is so profound relative to what each individual ant is doing."}, {"time": 2786, "text": "I am not anywhere near as well versed in the cutting edge of cellular automata as I would like."}, {"time": 2792, "text": "Unfortunately, in terms of topics that I would like to get to and haven't, like ET's more Wolfram's A New Kind of Science, I have only skimmed and read reviews of and not read the whole thing or his newer work since."}, {"time": 2807, "text": "But his idea of the four basic kind of categories of emergent phenomena that can come from cellular automata and that one of them is kind of interesting and looks a lot like complexity rather than just chaos or homogeneity or self termination or whatever."}, {"time": 2828, "text": "I think this is very interesting."}, {"time": 2831, "text": "It does not instantly make me think that biology is operating on a similarly small set of rules and or that human consciousness is."}, {"time": 2839, "text": "I'm not that reductionist oriented."}, {"time": 2846, "text": "So if you look at, say, Santa Fe Institute, one of the cofounders, Stuart Kaufman, his work, you should really get him on your show."}, {"time": 2853, "text": "So a lot of the questions that you like, one of Kaufman's more recent books after investigations and some of the real fundamental stuff was called Reinventing the Sacred and it had to do with some of these exact questions in kind of non reductionist approach, but that is not just silly hippie ism."}, {"time": 2870, "text": "And he was very interested in highly non ergodic systems where you couldn't take a lot of behavior over a small period of time and predict what the behavior of subsets over a longer period of time would do."}, {"time": 2881, "text": "And then going further, someone who spent some time at Santa Fe Institute and then kind of made a whole new field that you should have on, Dave Snowden, who some people call the father of anthro complexity or what is the complexity unique to humans."}, {"time": 2896, "text": "And he says something to the effect of that modeling humans as termites really doesn't cut it."}, {"time": 2900, "text": "Like we don't respond exactly identically to the same pheromone stimulus using Stigma G like it works for flows of traffic and some very simple human behaviors, but it really doesn't work for trying to make sense of the Sistine Chapel and Picasso and general relativity creation and stuff like that."}, {"time": 2917, "text": "And it's because the termites are not doing abstraction, forecasting deep into the future and making choices now based on forecasts of the future, not just adaptive signals in the moment and evolutionary code from history."}, {"time": 2929, "text": "That's really different, right?"}, {"time": 2931, "text": "Like making choices now that can factor deep modeling of the future."}, {"time": 2936, "text": "And with humans, our uniqueness one to the next in terms of response to similar stimuli is much higher than it is with a termite."}, {"time": 2946, "text": "One of the interesting things there is that their uniqueness is extremely low."}, {"time": 2948, "text": "They're basically fungible within a class, right?"}, {"time": 2951, "text": "There's different classes, but within a class they're basically fungible and their system uses that very high numbers and lots of loss, right?"}, {"time": 2959, "text": "Lots of death and loss."}, {"time": 2960, "text": "But do you think the termite feels that way?"}, {"time": 2961, "text": "Don't, don't you think we humans are deceiving ourselves about our uniqueness?"}, {"time": 2965, "text": "Perhaps it doesn't, it just, isn't there some sense in which this emergence just creates different higher and higher levels of abstraction where every, at every layer, each organism feels unique?"}, {"time": 2976, "text": "That we're all equally dumb but at different scales?"}, {"time": 2980, "text": "No, I think uniqueness is evolving."}, {"time": 2984, "text": "I think that hydrogen atoms are more similar to each other than cells of the same type are."}, {"time": 2992, "text": "And I think that cells are more similar to each other than humans are."}, {"time": 2994, "text": "And I think that highly K selected species are more unique than R selected species."}, {"time": 3000, "text": "So they're different evolutionary processes."}, {"time": 3003, "text": "The R selected species where you have a whole, a lot of death and very high birth rates, and not looking for as much individuality within or individual possible expression to cover the evolutionary search space within an individual."}, {"time": 3018, "text": "You're looking at it more in terms of a numbers game."}, {"time": 3022, "text": "So yeah, I would say there's probably more difference between one orca and the next than there is between one Cape buffalo and the next."}, {"time": 3029, "text": "Given that, it would be interesting to get your thoughts about memetic theory where we're imitating each other in the context of this idea of uniqueness."}, {"time": 3043, "text": "How much truth is there to that?"}, {"time": 3046, "text": "How compelling is this worldview to you of Girardian memetic theory of desire where maybe you can explain it from your perspective, but it seems like imitating each other is the fundamental property of the behavior of human civilization."}, {"time": 3065, "text": "Well, imitation is not unique to humans, right?"}, {"time": 3069, "text": "Monkeys imitate."}, {"time": 3071, "text": "So a certain amount of learning through observing is not unique to humans."}, {"time": 3078, "text": "Humans do more of it."}, {"time": 3079, "text": "It's actually kind of worth speaking to this for a moment."}, {"time": 3084, "text": "Monkeys can learn new behaviors, new... We've even seen teaching an ape sign language and then the ape teaching other apes sign language."}, {"time": 3093, "text": "So that's a kind of mimesis, right?"}, {"time": 3094, "text": "Kind of learning through imitation."}, {"time": 3098, "text": "And that needs to happen if they need to learn or develop capacities that are not just coded by their genetics, right?"}, {"time": 3104, "text": "So within the same genome, they're learning new things based on the environment."}, {"time": 3109, "text": "And so based on someone else learn something first and so let's pick it up."}, {"time": 3114, "text": "How much a creature is the result of just its genetic programming and how much it's learning is a very interesting question."}, {"time": 3122, "text": "And I think this is a place where humans really show up radically different than everything else."}, {"time": 3127, "text": "And you can see it in the neoteny, how long we're basically fetal."}, {"time": 3133, "text": "That the closest ancestors to us, if we look at a chimp, a chimp can hold on to its mother's fur while she moves around day one."}, {"time": 3142, "text": "And obviously we see horses up and walking within 20 minutes."}, {"time": 3146, "text": "The fact that it takes a human a year to be walking and it takes a horse 20 minutes and you say how many multiples of 20 minutes go into a year, like that's a long period of helplessness that wouldn't work for a horse, right?"}, {"time": 3157, "text": "Like they or anything else."}, {"time": 3160, "text": "And not only could we not hold on to mom in the first day, it's three months before we can move our head volitionally."}, {"time": 3168, "text": "So it's like why are we embryonic for so long?"}, {"time": 3172, "text": "Obviously it's like it's still fetal on the outside, had to be because couldn't keep growing inside and actually ever get out with big heads and narrower hips from going upright."}, {"time": 3185, "text": "So here's a place where there's a coevolution of the pattern of humans, specifically here our neoteny and what that portends to learning with our being tool making and environment modifying creatures, which is because we have the abstraction to make tools, we change our environments more than other creatures change their environments."}, {"time": 3206, "text": "The next most environment modifying creature to us is like a beaver."}, {"time": 3211, "text": "And then we're in LA, you fly into LAX and you look at the just orthogonal grid going on forever in all directions."}, {"time": 3219, "text": "And we've recently come into the Anthropocene where the surface of the earth is changing more from human activity than geological activity and then beavers and you're like, okay, wow, we're really in a class of our own in terms of environment modifying."}, {"time": 3233, "text": "So as soon as we started tool making, we were able to change our environments much more radically."}, {"time": 3242, "text": "We could put on clothes and go to a cold place."}, {"time": 3245, "text": "And this is really important because we actually went and became apex predators in every environment."}, {"time": 3250, "text": "We functioned like apex predators, polar bear can't leave the Arctic and the lion can't leave the Savannah and an orca can't leave the ocean."}, {"time": 3258, "text": "And we went and became apex predators in all those environments because of our tool creation capacity."}, {"time": 3262, "text": "We could become better predators than them adapted to the environment or at least with our tools adapted to the environment."}, {"time": 3267, "text": "So in every aspect towards any organism in any environment, we're incredibly good at becoming apex predators."}, {"time": 3277, "text": "And nothing else can do that kind of thing."}, {"time": 3280, "text": "There is no other apex predator that, you see the other apex predator is only getting better at being a predator through evolutionary process that's super slow and that super slow process creates co selective process with their environment."}, {"time": 3292, "text": "So as the predator becomes a tiny bit faster, it eats more of the slow prey, the genes of the fast prey and breed and the prey becomes faster."}, {"time": 3298, "text": "And so there's this kind of balancing and we in because of our tool making, we increased our predatory capacity faster than anything else could increase its resilience to it."}, {"time": 3308, "text": "As a result, we start outstripping the environment and extincting species following stone tools and going and becoming apex predator everywhere."}, {"time": 3315, "text": "This is why we can't keep applying apex predator theories because we're not an apex predator."}, {"time": 3318, "text": "We're an apex predator, but we're something much more than that."}, {"time": 3322, "text": "Like just for an example, the top apex predator in the world, an orca."}, {"time": 3327, "text": "An orca can eat one big fish at a time, like one tuna, and it'll miss most of the time or one seal."}, {"time": 3333, "text": "And we can put a mile long drift net out on a single boat and pull up an entire school of them."}, {"time": 3341, "text": "We can deplete the entire oceans of them."}, {"time": 3342, "text": "That's not an orca."}, {"time": 3343, "text": "That's not an apex predator."}, {"time": 3345, "text": "And that's not even including that we can then genetically engineer different creatures."}, {"time": 3349, "text": "We can extinct species."}, {"time": 3350, "text": "We can devastate whole ecosystems."}, {"time": 3352, "text": "We can make built worlds that have no natural things that are just human built worlds."}, {"time": 3356, "text": "We can build new types of natural creatures, synthetic life."}, {"time": 3359, "text": "So we are much more like little gods than we are like apex predators now, but we're still behaving as apex predators and little gods that behave as apex predators causes a problem kind of core to my assessment of the world."}, {"time": 3370, "text": "So what does it mean to be a predator?"}, {"time": 3373, "text": "So a predator is somebody that effectively can mine the resources from a place."}, {"time": 3379, "text": "So for their survival, or is it also just purely like higher level objectives of violence and what is, can predators be predators towards the same, each other towards the same species?"}, {"time": 3394, "text": "Like are we using the word predator sort of generally, which then connects to conflict and military conflict, violent conflict in this base of human species."}, {"time": 3406, "text": "Obviously we can say that plants are mining the resources of their environment in a particular way, using photosynthesis to be able to pull minerals out of the soil and nitrogen and carbon out of the air and like that."}, {"time": 3417, "text": "And we can say herbivores are being able to mine and concentrate that."}, {"time": 3421, "text": "So I wouldn't say mining the environment is unique to predator."}, {"time": 3424, "text": "Predator is generally being defined as mining other animals, right?"}, {"time": 3436, "text": "We don't consider herbivores predators, but animal, which requires some type of violence capacity because animals move, plants don't move."}, {"time": 3447, "text": "So it requires some capacity to overtake something that can move and try to get away."}, {"time": 3454, "text": "We'll go back to the Gerard thing and then we'll come back here."}, {"time": 3457, "text": "Why are we neotenous?"}, {"time": 3458, "text": "Why are we embryonic for so long?"}, {"time": 3462, "text": "Because are we, did we just move from the Savannah to the Arctic and we need to learn new stuff?"}, {"time": 3468, "text": "If we came genetically programmed, we would not be able to do that."}, {"time": 3471, "text": "Are we throwing spears or are we fishing or are we running an industrial supply chain or are we texting?"}, {"time": 3477, "text": "What is the adaptive behavior?"}, {"time": 3479, "text": "Horses today in the wild and horses 10,000 years ago are doing pretty much the same stuff."}, {"time": 3483, "text": "And so since we make tools and we evolve our tools and then change our environment so quickly and other animals are largely the result of their environment, but we're environment modifying so rapidly, we need to come without too much programming so we can learn the environment we're in, learn the language, right?"}, {"time": 3501, "text": "Which is going to be very important to learn the tool making."}, {"time": 3507, "text": "And so we have a very long period of relative helplessness because we aren't coded how to behave yet because we're imprinting a lot of software on how to behave that is useful to that particular time."}, {"time": 3518, "text": "So our mimesis is not unique to humans, but the total amount of it is really unique."}, {"time": 3524, "text": "And this is also where the uniqueness can go up, right?"}, {"time": 3526, "text": "Is because we are less just the result of the genetics and that means the kind of learning through history that they got coded in genetics and more the result of, it's almost like our hardware selected for software, right?"}, {"time": 3540, "text": "Like if evolution is kind of doing these, think of as a hardware selection, I have problems with computer metaphors for biology, but I'll use this one here, that we have not had hardware changes since the beginning of sapiens, but our world is really, really different."}, {"time": 3558, "text": "And that's all changes in software, right?"}, {"time": 3560, "text": "Changes on the same fundamental genetic substrate, what we're doing with these brains and minds and bodies and social groups and like that."}, {"time": 3570, "text": "And so, now, Gerard specifically was looking at when we watch other people talking, so we learn language, you and I would have a hard time learning Mandarin today or it would take a lot of work, we'd be learning how to conjugate verbs and stuff, but a baby learns it instantly without anyone even really trying to teach it just through mimesis."}, {"time": 3590, "text": "So it's a powerful thing."}, {"time": 3592, "text": "They're obviously more neuroplastic than we are when they're doing that and all their attention is allocated to that."}, {"time": 3597, "text": "But they're also learning how to move their bodies and they're learning all kinds of stuff through mimesis."}, {"time": 3602, "text": "One of the things that Gerard says is they're also learning what to want."}, {"time": 3606, "text": "And they learn what to want."}, {"time": 3607, "text": "They learn desire by watching what other people want."}, {"time": 3610, "text": "And so, intrinsic to this, people end up wanting what other people want and if we can't have what other people have without taking it away from them, then that becomes a source of conflict."}, {"time": 3621, "text": "So the mimesis of desire is the fundamental generator of conflict and that then the conflict energy within a group of people will build over time."}, {"time": 3632, "text": "This is a very, very crude interpretation of the theory."}, {"time": 3637, "text": "For people who are not familiar and for me who hasn't, I'm loosely familiar but haven't internalized it, but every time I think about it, it's a very compelling view of the world."}, {"time": 3646, "text": "Whether it's true or not, it's quite, it's like when you take everything Freud says as truth, it's a very interesting way to think about the world and in the same way, thinking about the mimetic theory of desire that everything we want is imitation of other people's wants."}, {"time": 3671, "text": "We don't have any original wants."}, {"time": 3673, "text": "We're constantly imitating others."}, {"time": 3675, "text": "And so, and not just others, but others we're exposed to."}, {"time": 3681, "text": "So there's these little local pockets, however defined local, of people imitating each other."}, {"time": 3687, "text": "And one that's super empowering because then you can pick which group you can join."}, {"time": 3693, "text": "What do you want to imitate?"}, {"time": 3697, "text": "It's the old like, whoever your friends are, that's what your life is going to be like."}, {"time": 3703, "text": "I mean, it's depressing that we're so unoriginal, but it's also liberating in that if this holds true, that we can choose our life by choosing the people we hang out with."}, {"time": 3717, "text": "Thoughts that are very compelling that seem like they're more absolute than they actually are end up also being dangerous."}, {"time": 3722, "text": "We want to, I'm going to discuss here where I think we need to amend this particular theory."}, {"time": 3730, "text": "But specifically, you just said something that everyone who's paid attention knows is true experientially, which is who you're around affects who you become."}, {"time": 3739, "text": "And as libertarian and self determining and sovereign as we'd like to be, everybody I think knows that if you got put in the maximum security prison, aspects of your personality would have to adapt or you wouldn't survive there, right?"}, {"time": 3754, "text": "You would become different."}, {"time": 3757, "text": "If you grew up in Darfur versus Finland, you would be different with your same genetics, like just there's no real question about that."}, {"time": 3764, "text": "And that even today, if you hang out in a place with ultra marathoners as your roommates or all people who are obese as your roommates, the statistical likelihood of what happens to your fitness is pretty clear, right?"}, {"time": 3777, "text": "Like the behavioral science of this is pretty clear."}, {"time": 3779, "text": "So the whole saying we are the average of the five people we spend the most time around."}, {"time": 3784, "text": "I think the more self reflective someone is and the more time they spend by themselves in self reflection, the less this is true, but it's still true."}, {"time": 3790, "text": "So one of the best things someone can do to become more self determined is be self determined about the environments they want to put themselves in, because to the degree that there is some self determination and some determination by the environment, don't be fighting an environment that is predisposing you in bad directions."}, {"time": 3807, "text": "Try to put yourself in an environment that is predisposing the things that you want."}, {"time": 3810, "text": "In turn, try to affect the environment in ways that predispose positive things for those around you."}, {"time": 3816, "text": "Or perhaps also there's probably interesting ways to play with this."}, {"time": 3819, "text": "You could probably put yourself like form connections that have this perfect tension in all directions to where you're actually free to decide whatever the heck you want, because the set of wants within your circle of interactions is so conflicting that you're free to choose whichever one."}, {"time": 3839, "text": "If there's enough tension, as opposed to everybody aligned like a flock of birds."}, {"time": 3843, "text": "Yeah, I mean, you definitely want that all of the dialectics would be balanced."}, {"time": 3849, "text": "So if you have someone who is extremely oriented to self empowerment and someone who's extremely oriented to kind of empathy and compassion, both the dialectic of those is better than either of them on their own."}, {"time": 3864, "text": "If you have both of them inhabiting, being inhabited better than you by the same person and spending time around that person will probably do well for you."}, {"time": 3901, "text": "And so in the Hegelian sense, if you have a thesis, you have an antithesis."}, {"time": 3906, "text": "So maybe we have libertarianism on one side and Marxist kind of communism on the other side."}, {"time": 3911, "text": "And one is arguing that the individual is the unit of choice."}, {"time": 3916, "text": "And so we want to increase the freedom and support of individual choice because as they make more agentic choices, it'll produce a better whole for everybody."}, {"time": 3925, "text": "The other side saying, well, the individuals are conditioned by their environment who would choose to be born into Darfur rather than Finland."}, {"time": 3931, "text": "So we actually need to collectively make environments that are good because the environment conditions the individuals."}, {"time": 3940, "text": "So you have a thesis and an antithesis."}, {"time": 3942, "text": "And then Hegel's ideas, you have a synthesis, which is a kind of higher order truth that understands how those relate in a way that neither of them do."}, {"time": 3950, "text": "And so it is actually at a higher order of complexity."}, {"time": 3952, "text": "So the first part would be, can I steel man each of these?"}, {"time": 3955, "text": "Can I argue each one well enough that the proponents of it are like, totally, you got that?"}, {"time": 3960, "text": "And not just argue it rhetorically, but can I inhabit it where I can try to see and feel the world the way someone seeing and feeling the world that way would?"}, {"time": 3968, "text": "Because once I do, then I don't want to screw those people because there's truth in it, right?"}, {"time": 3973, "text": "And I'm not going to go back to war with them."}, {"time": 3974, "text": "I'm going to go to finding solutions that could actually work at a higher order."}, {"time": 3978, "text": "If I don't go to a higher order, then there's war."}, {"time": 3981, "text": "And but then the higher order thing would be, well, it seems like the individual does affect the commons and the collective and other people."}, {"time": 3988, "text": "It also seems like the collective conditions individuals at least statistically."}, {"time": 3993, "text": "And I can cherry pick out the one guy who got out of the ghetto and pulled himself up by his bootstraps."}, {"time": 3998, "text": "But I can also say statistically that most people born into the ghetto show up differently than most people born into the Hamptons."}, {"time": 4004, "text": "And so unless you want to argue that and have you take your child from the Hamptons and put them in the ghetto, then like, come on, be realistic about this thing."}, {"time": 4012, "text": "So how do we make, we don't want social systems that make weak dependent individuals, right?"}, {"time": 4020, "text": "The welfare argument."}, {"time": 4021, "text": "But we also don't want no social system that supports individuals to do better."}, {"time": 4028, "text": "We don't want individuals where their self expression and agency fucks the environment and everybody else and employs slave labor and whatever."}, {"time": 4035, "text": "So can we make it to where individuals are creating holes that are better for conditioning other individuals?"}, {"time": 4042, "text": "Can we make it to where we have holes that are conditioning increased agency and sovereignty, right?"}, {"time": 4047, "text": "That would be the synthesis."}, {"time": 4048, "text": "So the thing that I'm coming to here is if people have that as a frame, and sometimes it's not just thesis and antithesis, it's like eight different views, right?"}, {"time": 4057, "text": "Can I steel man each view?"}, {"time": 4059, "text": "This is not just, can I take the perspective, but am I seeking them?"}, {"time": 4062, "text": "Am I actively trying to inhabit other people's perspective?"}, {"time": 4066, "text": "Then can I really try to essentialize it and argue the best points of it, both the sense making about reality and the values, why these values actually matter?"}, {"time": 4077, "text": "Then just like I want to seek those perspectives, then I want to seek, is there a higher order set of understandings that could fulfill the values of and synthesize the sense making of all of them simultaneously?"}, {"time": 4090, "text": "Maybe I won't get it, but I want to be seeking it and I want to be seeking progressively better ones."}, {"time": 4094, "text": "So this is perspective seeking, driving perspective taking, and then seeking synthesis."}, {"time": 4101, "text": "I think that that one cognitive disposition might be the most helpful thing."}, {"time": 4111, "text": "Would you put a title of dialectic synthesis on that process because that seems to be such a part, so like this rigorous empathy, like it's not just empathy."}, {"time": 4122, "text": "It's empathy with rigor, like you really want to understand and embody different worldviews and then try to find a higher order synthesis."}, {"time": 4130, "text": "Okay, so I remember last night you told me when we first met, you said that you looked in somebody's eyes and you felt that you had suffered in some ways that they had suffered and so you could trust them."}, {"time": 4143, "text": "Empathy pathos, right, creates a certain sense of kind of shared bonding and shared intimacy."}, {"time": 4148, "text": "So empathy is actually feeling the suffering of somebody else and feeling the depth of their sentience."}, {"time": 4155, "text": "I don't want to fuck them anymore."}, {"time": 4156, "text": "I don't want to hurt them."}, {"time": 4157, "text": "I don't want to behave, I don't want my proposition to go through when I go and inhabit the perspective of the other people if they feel that's really going to mess them up, right?"}, {"time": 4165, "text": "And so the rigorous empathy, it's different than just compassion, which is I generally care."}, {"time": 4171, "text": "I have a generalized care, but I don't know what it's like to be them."}, {"time": 4174, "text": "I can never know what it's like to be them perfectly and that there's a humility you have to have, which is my most rigorous attempt is still not it."}, {"time": 4182, "text": "My most rigorous attempt, mine, to know what it's like to be a woman is still not it."}, {"time": 4186, "text": "I have no question that if I was actually a woman, it would be different than my best guesses."}, {"time": 4190, "text": "I have no question if I was actually black, it would be different than my best guesses."}, {"time": 4194, "text": "So there's a humility in that which keeps me listening because I don't think that I know fully, but I want to, and I'm going to keep trying better to."}, {"time": 4202, "text": "And then I want to accross them, and then I want to say, is there a way we can forward together and not have to be in war?"}, {"time": 4207, "text": "It has to be something that could meet the values that everyone holds, that could reconcile the partial sensemaking that everyone holds, and that could offer a way forward that is more agreeable than the partial perspectives at war with each other."}, {"time": 4221, "text": "But so the more you succeed at this empathy with humility, the more you're carrying the burden of other people's pain, essentially."}, {"time": 4230, "text": "Now, this goes back to the question of do I see us as one being or 7.8 billion."}, {"time": 4238, "text": "I think if I'm overwhelmed with my own pain, I can't empathize that much because I don't have the bandwidth."}, {"time": 4248, "text": "I don't have the capacity."}, {"time": 4249, "text": "If I don't feel like I can do something about a particular problem in the world, it's hard to feel it because it's just too devastating."}, {"time": 4256, "text": "And so a lot of people go numb and even go nihilistic because they just don't feel the agency."}, {"time": 4261, "text": "So as I actually become more empowered as an individual and have more sense of agency, I also become more empowered to be more empathetic for others and be more connected to that shared burden and want to be able to make choices on behalf of and in benefit of."}, {"time": 4275, "text": "So this way of living seems like a way of living that would solve a lot of problems in society from a cellular automata perspective."}, {"time": 4288, "text": "So if you have a bunch of little agents behaving in this way, my intuition, there'll be interesting complexities that emerge, but my intuition is it will create a society that's very different and recognizably better than the one we have today."}, {"time": 4304, "text": "How much like... Oh, wait, hold that question because I want to come back to it, but this brings us back to Gerard, which we didn't answer."}, {"time": 4311, "text": "The conflict theory."}, {"time": 4313, "text": "Because about how to get past the conflict theory."}, {"time": 4315, "text": "You know the Robert Frost poem about the two paths and you never have enough time to return back to the other?"}, {"time": 4320, "text": "We're going to have to do that quite a lot."}, {"time": 4321, "text": "We're going to be living that poem over and over again, but yes, how to... Let's return back."}, {"time": 4330, "text": "So the rest of the argument goes, you learn to want what other people want, therefore fundamental conflict based in our desire because we want the thing that somebody else has."}, {"time": 4339, "text": "And then people are in conflict over trying to get the same stuff, power, status, attention, physical stuff, a mate, whatever it is."}, {"time": 4347, "text": "And then we learn the conflict by watching."}, {"time": 4350, "text": "And so then the conflict becomes metic."}, {"time": 4353, "text": "And we become on the Palestinian side or the Israeli side or the communist or capitalist side or the left or right politically or whatever it is."}, {"time": 4361, "text": "And until eventually the conflict energy in the system builds up so much that some type of violence is needed to get the bad guy, whoever it is that we're going to blame."}, {"time": 4370, "text": "And you know, Gerard talks about why scapegoating was kind of a mechanism to minimize the amount of violence."}, {"time": 4376, "text": "Let's blame a scapegoat as being more relevant than they really were."}, {"time": 4380, "text": "But if we all believe it, then we can all kind of calm down with the conflict energy."}, {"time": 4383, "text": "It's a really interesting concept, by the way."}, {"time": 4386, "text": "I mean, you beautifully summarized it, but the idea that there's a scapegoat, that there's this kind of thing naturally leads to a conflict and then they find the other, some group that's the other that's either real or artificial as the cause of the conflict."}, {"time": 4400, "text": "Well, it's always artificial because the cause of the conflict in Gerard is the mimesis of desire itself."}, {"time": 4406, "text": "And how do we attack that?"}, {"time": 4407, "text": "How do we attack that it's our own desire?"}, {"time": 4410, "text": "So this now gets to something more like Buddha said, right, which was desire is the cause of suffering."}, {"time": 4414, "text": "Gerard and Buddha would kind of agree in this way."}, {"time": 4420, "text": "So but that's that explains I mean, again, it's a compelling description of human history that we do tend to come up with the other."}, {"time": 4430, "text": "And okay, kind of I just I just had such a funny experience with someone critiquing Gerard the other day in such an elegant and beautiful and simple way."}, {"time": 4439, "text": "It's a friend who's grew up Aboriginal Australian, is a scholar of Aboriginal social technologies."}, {"time": 4452, "text": "He's like, nah man, Gerard just made shit up about how tribes work."}, {"time": 4456, "text": "Like we come from a tribe, we've got tens of thousands of years, and we didn't have increasing conflict and then scapegoat and kill someone."}, {"time": 4463, "text": "We'd have a little bit of conflict and then we would dance and then everybody'd be fine."}, {"time": 4468, "text": "We'd dance around the campfire, everyone would like kind of physically get the energy out, we'd look in each other's eyes, we'd have positive bonding, and then we're fine."}, {"time": 4474, "text": "And nobody, no scapegoats."}, {"time": 4476, "text": "And I think that's called the Joe Rogan theory of desire, which is, he's like, all all of human problems have to do with the fact that you don't do enough hard shit in your day."}, {"time": 4487, "text": "So maybe, maybe just dance it because he says like doing exercise and running on the treadmill gets gets all the demons out and maybe just dancing gets all the demons out."}, {"time": 4495, "text": "So this is why I say we have to be careful with taking an idea that seems too explanatory and then taking it as a given and then saying, well, now that we're stuck with the fact that conflict is inexorable because human, because mimetic desire and therefore, how do we deal with the inexorability of the conflict and how to sublimate violence?"}, {"time": 4512, "text": "Well, no, the whole thing might be actually gibberish, meaning it's only true in certain conditions and other conditions it's not true."}, {"time": 4519, "text": "So the deeper question is under which conditions is that true?"}, {"time": 4522, "text": "Under which conditions is it not true?"}, {"time": 4523, "text": "What do those other conditions make possible and look like?"}, {"time": 4526, "text": "And in general, we should stay away from really compelling models of reality because there's something about, about our brains that these models become sticky and we can't even think outside of them."}, {"time": 4538, "text": "It's not that we stay away from them."}, {"time": 4539, "text": "It's that we know that the model of reality is never reality."}, {"time": 4542, "text": "That's the key thing."}, {"time": 4543, "text": "Humility again, it goes back to just having the humility that you don't have a perfect model of reality."}, {"time": 4548, "text": "There's an ep, the, the model of reality could never be reality."}, {"time": 4552, "text": "The process of modeling is inherently information reduction and I can never show that the unknown unknown set has been factored."}, {"time": 4562, "text": "It's back to the cellular automata."}, {"time": 4565, "text": "You can't, you can't put the genie back in the bottle."}, {"time": 4570, "text": "Like when you realize it's unfortunately, sadly impossible to, to create a model of cellular automata, even if you know the basic rules that predict to even any degree of accuracy, what how that system will evolve, which is fascinating mathematically."}, {"time": 4593, "text": "I think about it quite a lot."}, {"time": 4594, "text": "It's very annoying."}, {"time": 4596, "text": "Wolfram has this rule 30, like you should be able to predict it."}, {"time": 4601, "text": "It's so simple, but you can't predict what's going to be like, there's a, there's a problem he defines, like try to predict some aspect of the middle, middle column of the system, just anything about it."}, {"time": 4614, "text": "What's going to happen in the future."}, {"time": 4615, "text": "And you can't, you can't, it sucks because then we can't make sense of this world in a real, in a reality, in a definitive way."}, {"time": 4627, "text": "It's always like in the striving, like it, we're always striving."}, {"time": 4632, "text": "I don't think this sucks."}, {"time": 4635, "text": "That so that's a feature, not a bug."}, {"time": 4637, "text": "Well, that's assuming a designer."}, {"time": 4641, "text": "I would say I don't think it sucks."}, {"time": 4643, "text": "I think it's not only beautiful, but maybe necessary for beauty."}, {"time": 4650, "text": "So you're a, so you're, you're disagree Jordan Pearson should clean up your room."}, {"time": 4655, "text": "You like the rooms messy."}, {"time": 4656, "text": "It's a, it's essential for the, for beauty."}, {"time": 4659, "text": "It's not, it's not that it's okay."}, {"time": 4662, "text": "I take, I have no idea if it was intended this way."}, {"time": 4666, "text": "And so I'm just interpreting it a way I like the commandment about having no false idols to me, the way I interpret that that is meaningful is that re reality is sacred to me."}, {"time": 4678, "text": "I have a reverence for reality, but I know my best understanding of it is never complete."}, {"time": 4684, "text": "I know my best model of it is a model where I tried to make some kind of predictive capacity by reducing the complexity of it to a set of stuff that I could observe and then a subset of that stuff that I thought was the causal dynamics and then some set of, you know, mechanisms that are involved."}, {"time": 4702, "text": "And what we find is that it can be super useful, like Newtonian gravity can help us do ballistic curves and all kinds of super useful stuff."}, {"time": 4710, "text": "And then we get to the place where it doesn't explain what's happening at the cosmological scale or at a quantum scale."}, {"time": 4716, "text": "And at each time, what we're finding is we excluded stuff."}, {"time": 4722, "text": "And it also doesn't explain the reconciliation of gravity with quantum mechanics and the other kind of fundamental laws."}, {"time": 4728, "text": "So models can be useful, but they're never true with a capital T, meaning they're never an actual real full, they're never a complete description of what's happening in real systems."}, {"time": 4739, "text": "They can be a complete description of what's happening in an artificial system that was the result of applying a model."}, {"time": 4744, "text": "So the model of a circuit board and the circuit board are the same thing, but I would argue that the model of a cell and the cell are not the same thing."}, {"time": 4751, "text": "And I would say this is key to what we call complexity versus the complicated, which is a distinction Dave Snowden made well in defining the difference between simple, complicated, complex and chaotic systems."}, {"time": 4766, "text": "But one of the definers in complex systems is that no matter how you model the complex system, it will still have some emergent behavior not predicted by the model."}, {"time": 4774, "text": "Can you elaborate on the complex versus the complicated?"}, {"time": 4777, "text": "Complicated means we can fully explicate the phase space of all the things that it can do."}, {"time": 4782, "text": "We can program it."}, {"time": 4784, "text": "All human, not all, for the most part, human built things are complicated."}, {"time": 4789, "text": "They don't self organize."}, {"time": 4791, "text": "They don't self repair."}, {"time": 4792, "text": "They're not self evolving and we can make a blueprint for them where, sorry, for human systems, for human technologies, human technologies, that are basically the application of models right."}, {"time": 4806, "text": "And engineering is kind of applied science, science as the modeling process."}, {"time": 4812, "text": "And but with humans are complex, complex stuff with biological type stuff and sociological type stuff, it more has generator functions and even those can't be fully explicated than it has or our explanation can't prove that it has closure of what would be in the unknown unknown set where we keep finding like, oh, it's just the genome."}, {"time": 4833, "text": "Oh, well now it's the genome and the epigenome and then a recursive change on the epigenome because of the proteome."}, {"time": 4838, "text": "And then there's mitochondrial DNA and then viruses affected and fuck, right?"}, {"time": 4841, "text": "So it's like we get overexcited when we think we found the thing."}, {"time": 4846, "text": "So on Facebook, you know how you can list your relationship as complicated?"}, {"time": 4849, "text": "It should actually say it's, it's complex."}, {"time": 4852, "text": "That's the more accurate description."}, {"time": 4854, "text": "You self terminating is a really interesting idea that you talk about quite a bit."}, {"time": 4861, "text": "First of all, what is a self terminating system?"}, {"time": 4864, "text": "And I think you have a sense, correct me if I'm wrong, that human civilization is a currently is, is a self terminating system."}, {"time": 4876, "text": "Why do you have that intuition combined with the definition of what soft self terminating means?"}, {"time": 4881, "text": "Okay, so if we look at human societies historically, human civilizations, it's not that hard to realize that most of the major civilizations and empires of the past don't exist anymore."}, {"time": 4897, "text": "So they had a life cycle, they died for some reason."}, {"time": 4900, "text": "So we don't still have the early Egyptian empire or Inca or Maya or Aztec or any of those, right?"}, {"time": 4907, "text": "So they, they terminated, sometimes it seems like they were terminated from the outside in war."}, {"time": 4913, "text": "Sometimes it seems like they self terminated."}, {"time": 4914, "text": "When we look at Easter Island, it was a self termination."}, {"time": 4917, "text": "So let's go ahead and take an island situation."}, {"time": 4920, "text": "If I have an island and we are consuming the resources on that island faster than the resources can replicate themselves and there's a finite space there, that system is going to self terminate."}, {"time": 4959, "text": "So self terminating system is any system that depends upon a substrate system that is debasing its own substrate, that is debasing what it depends upon."}, {"time": 4970, "text": "So you're right that if you look at empires, they rise and fall throughout human history, but not this time, bro."}, {"time": 4982, "text": "This one's going to last forever."}, {"time": 4984, "text": "I like that idea."}, {"time": 4986, "text": "I think that if we don't understand why all the previous ones failed, we can't ensure that."}, {"time": 4991, "text": "And so I think it's very important to understand it well so that we can have that be a designed outcome with somewhat decent probability."}, {"time": 4998, "text": "So we're, it's sort of in terms of consuming the resources on the island, we're a clever bunch and we keep coming up, especially when on the horizon there is a termination point, we keep coming up with clever ways of avoiding disaster, of avoiding collapse, of constructing."}, {"time": 5020, "text": "This is where technological innovation, this is where growth comes in, coming up with different ways to improve productivity and the way society functions such that we consume less resources or get a lot more from the resources we have."}, {"time": 5033, "text": "So there's some sense in which there's a human ingenuity is a source for optimism about the future of this particular system that may not be self terminating."}, {"time": 5047, "text": "If there's more innovation than there is consumption."}, {"time": 5053, "text": "So overconsumption of resources is just one way I think can self terminate."}, {"time": 5057, "text": "We're just kind of starting here."}, {"time": 5058, "text": "But there are reasons for optimism and pessimism then they're both worth understanding and there's failure modes on understanding either without the other."}, {"time": 5071, "text": "As we mentioned previously, there's what I would call naive techno optimism, naive techno capital optimism that says stuff just has been getting better and better and we wouldn't want to live in the dark ages and tech has done all this awesome stuff and we know the proponents of those models and this stuff is going to kind of keep getting better."}, {"time": 5092, "text": "Of course there are problems, but human ingenuity rises to its supply and demand will solve the problems, whatever."}, {"time": 5096, "text": "Would you put Rick or as well in that, or in that bucket, is there some specific people you have in mind or naive optimism is truly naive to where you're essentially just have an optimism that's blind to any kind of realities of the way technology progresses."}, {"time": 5113, "text": "I don't think that anyone who thinks about it and writes about it is perfectly naive."}, {"time": 5123, "text": "But there might be."}, {"time": 5124, "text": "It's a platonic ideal."}, {"time": 5125, "text": "There might be a bias in the nature of the assessment."}, {"time": 5129, "text": "I would also say there's kind of naive techno pessimism and there are critics of technology."}, {"time": 5140, "text": "I mean, you read the Unabomber's Manifesto on why technology can't not result in our self termination, so we have to take it out before it gets any further."}, {"time": 5151, "text": "But also if you read a lot of the X risk community, you know, Bostrom and friends, it's like our total number of existential risks and the total probability of them is going up."}, {"time": 5164, "text": "And so I think that there are, we have to hold together where our positive possibilities and our risk possibilities are both increasing and then say for the positive possibilities to be realized long term, all of the catastrophic risks have to not happen."}, {"time": 5182, "text": "Any of the catastrophic risks happening is enough to keep that positive outcome from occurring."}, {"time": 5187, "text": "So how do we ensure that none of them happen?"}, {"time": 5190, "text": "If we want to say, let's have a civilization that doesn't collapse."}, {"time": 5193, "text": "So again, Collapse Theory, it's worth looking at books like The Collapse of Complex Societies by Joseph Tainter."}, {"time": 5199, "text": "It does an analysis of that many of the societies fell for internal institutional decay, civilizational decay reasons."}, {"time": 5211, "text": "Baudrillard in Simulation and Simulacra looks at a very different way of looking at how institutional decay and the collective intelligence of a system happens and it becomes kind of more internally parasitic on itself."}, {"time": 5222, "text": "Obviously Jared Diamond made a more popular book called Collapse."}, {"time": 5226, "text": "And as we were mentioning, the anticatheria mechanism has been getting attention in the news lately."}, {"time": 5231, "text": "It was like a 2000 year old clock, right?"}, {"time": 5234, "text": "Like metal gears."}, {"time": 5235, "text": "And does that mean we lost like 1500 years of technological progress?"}, {"time": 5243, "text": "And from a society that was relatively technologically advanced."}, {"time": 5249, "text": "So what I'm interested in here is being able to say, okay, well, why did previous societies fail?"}, {"time": 5258, "text": "Can we understand that abstractly enough that we can make a civilizational model that isn't just trying to solve one type of failure, but solve the underlying things that generate the failures as a whole?"}, {"time": 5271, "text": "Are there some underlying generator functions or patterns that would make a system self terminating?"}, {"time": 5277, "text": "And can we solve those and have that be the kernel of a new civilizational model that is not self terminating?"}, {"time": 5282, "text": "And can we then be able to actually look at the categories of extras we're aware of and see that we actually have resilience in the presence of those?"}, {"time": 5290, "text": "Not just resilience, but antifragility."}, {"time": 5293, "text": "And I would say for the optimism to be grounded, it has to actually be able to understand the risk space well and have adequate solutions for it."}, {"time": 5302, "text": "So can we try to dig into some basic intuitions about the underlying sources of catastrophic failures of the system and overconsumption that's built in into self terminating systems?"}, {"time": 5317, "text": "So both the overconsumption, which is like the slow death, and then there's the fast death of nuclear war and all those kinds of things."}, {"time": 5325, "text": "AGI, biotech, bioengineering, nanotechnology, nano, my favorite nanobots."}, {"time": 5333, "text": "Nanobots are my favorite because it sounds so cool to me that I could just know that I would be one of the scientists that would be full steam ahead in building them without sufficiently thinking about the negative consequences."}, {"time": 5348, "text": "I would definitely be, I would be podcasting all about the negative consequences, but when I go back home, I'd be, I'd just in my heart know the amount of excitement is a dumb descendant of ape, no offense to apes."}, {"time": 5364, "text": "I want to backtrack on my previous comments about, negative comments about apes."}, {"time": 5374, "text": "That I have that sense of excitement that would result in problems."}, {"time": 5406, "text": "So what, what are some underlying sources?"}, {"time": 5409, "text": "First I have to say, I actually really respect Drexler for emphasizing Grey Goo and engines of creation back in the day to make sure the world was paying adequate attention to the risks of the nanotech as someone who was right at the cutting edge of what could be."}, {"time": 5432, "text": "There's definitely game theoretic advantage to those who focus on the opportunities and don't focus on the risks or pretend there aren't risks because they get to market first."}, {"time": 5446, "text": "And then they externalize all of the costs through limited liability or whatever it is to the commons or wherever happen to have it."}, {"time": 5453, "text": "Other people are going to have to solve those, but now they have the power and capital associated."}, {"time": 5456, "text": "The person who looked at the risks and tried to do better design and go slower is probably not going to move into positions of as much power influences quickly."}, {"time": 5464, "text": "So this is one of the issues we have to deal with is some of the bad game theoretic dispositions in the system relative to its own stability."}, {"time": 5472, "text": "And the key aspect to that, sorry to interrupt, is the externalities generated."}, {"time": 5478, "text": "What flavors of catastrophic risk are we talking about here?"}, {"time": 5481, "text": "What's your favorite flavor in terms of ice cream?"}, {"time": 5484, "text": "So mine is coconut."}, {"time": 5485, "text": "Nobody seems to like coconut ice cream."}, {"time": 5488, "text": "So ice cream aside, what are you most worried about in terms of catastrophic risk that will help us kind of make concrete the discussion we're having about how to fix this whole thing?"}, {"time": 5505, "text": "I think it's worth taking a historical perspective briefly to just kind of orient everyone to it."}, {"time": 5510, "text": "We don't have to go all the way back to the aliens who've seen all of civilization."}, {"time": 5515, "text": "But to just recognize that for all of human history, as far as we're aware, there were existential risks to civilizations and they happened, right?"}, {"time": 5527, "text": "Like there were civilizations that were killed in war, tribes that were killed in tribal warfare or whatever."}, {"time": 5533, "text": "So people faced existential risk to the group that they identified with."}, {"time": 5538, "text": "It's just those were local phenomena, right?"}, {"time": 5540, "text": "It wasn't a fully global phenomena."}, {"time": 5542, "text": "So an empire could fall and surrounding empires didn't fall."}, {"time": 5545, "text": "Maybe they came in and filled the space."}, {"time": 5550, "text": "The first time that we were able to think about catastrophic risk, not from like a solar flare or something that we couldn't control, but from something that humans would actually create at a global level was World War II and the bomb."}, {"time": 5563, "text": "Because it was the first time that we had tech big enough that could actually mess up everything at a global level that could mess up habitability."}, {"time": 5570, "text": "We just weren't powerful enough to do that before."}, {"time": 5573, "text": "It's not that we didn't behave in ways that would have done it."}, {"time": 5575, "text": "We just only behaved in those ways at the scale we could affect."}, {"time": 5579, "text": "And so it's important to get that there's the entire world before World War II where we don't have the ability to make a nonhabitable biosphere, nonhabitable for us."}, {"time": 5589, "text": "And then there's World War II and the beginning of a completely new phase where global human induced catastrophic risk is now a real thing."}, {"time": 5598, "text": "And that was such a big deal that it changed the entire world in a really fundamental way, which is, you know, when you study history, it's amazing how big a percentage of history is studying war, right, and the history of war, as you said, European history and whatever."}, {"time": 5612, "text": "It's generals and wars and empire expansions."}, {"time": 5634, "text": "World War II was the first time where we could have a war that no one could win."}, {"time": 5640, "text": "And so the superpowers couldn't fight again."}, {"time": 5642, "text": "They couldn't do a real kinetic war."}, {"time": 5644, "text": "They could do diplomatic wars and Cold War type stuff and they could fight proxy wars through other countries that didn't have the big weapons."}, {"time": 5651, "text": "And so mutually assured destruction and like coming out of World War II, we actually realized that nation states couldn't prevent world war."}, {"time": 5659, "text": "And so we needed a new type of supervening government in addition to nation states, which was the whole Bretton Woods world, the United Nations, the World Bank, the IMF, the globalization trade type agreements, mutually assured destruction that was how do we have some coordination beyond just nation states between them since we have to stop war between at least the superpowers."}, {"time": 5682, "text": "And it was pretty successful given that we've had like 75 years of no superpower on superpower war."}, {"time": 5690, "text": "We've had lots of proxy wars during that time."}, {"time": 5693, "text": "We've had Cold War."}, {"time": 5696, "text": "And I would say we're in a new phase now where the Bretton Woods solution is basically over or almost over."}, {"time": 5702, "text": "Can you describe the Bretton Woods solution?"}, {"time": 5706, "text": "So the Bretton Woods, the series of agreements for how the nations would be able to engage with each other in a solution other than war was these IGOs, these intergovernmental organizations and was the idea of globalization."}, {"time": 5724, "text": "Since we could have global effects, we needed to be able to think about things globally where we had trade relationships with each other where it would not be profitable to war with each other."}, {"time": 5733, "text": "It'd be more profitable to actually be able to trade with each other."}, {"time": 5735, "text": "So our own self interest was gonna drive our non war interest."}, {"time": 5742, "text": "And so this started to look like, and obviously this couldn't have happened that much earlier either because industrialization hadn't gotten far enough to be able to do massive global industrial supply chains and ship stuff around quickly."}, {"time": 5754, "text": "But like we were mentioning earlier, almost all the electronics that we use today, just basic cheap stuff for us is made on six continents, made in many countries."}, {"time": 5762, "text": "There's no single country in the world that could actually make many of the things that we have and from the raw material extraction to the plastics and polymers and the et cetera."}, {"time": 5772, "text": "And so the idea that we made a world that could do that kind of trade and create massive GDP growth, we could all work together to be able to mine natural resources and grow stuff."}, {"time": 5783, "text": "With the rapid GDP growth, there was the idea that everybody could keep having more without having to take each other's stuff."}, {"time": 5790, "text": "And so that was part of kind of the Bretton Woods post World War II model."}, {"time": 5795, "text": "The other was that we'd be so economically interdependent that blowing each other up would never make sense."}, {"time": 5801, "text": "That worked for a while."}, {"time": 5803, "text": "Now it also brought us up into planetary boundaries faster, the unrenewable use of resource and turning those resources into pollution on the other side of the supply chain."}, {"time": 5816, "text": "So obviously that faster GDP growth meant the overfishing of the oceans and the cutting down of the trees and the climate change and the mining, toxic mining tailings going into the water and the mountaintop removal mining and all those types of things."}, {"time": 5831, "text": "That's the overconsumption side of the risk that we're talking about."}, {"time": 5835, "text": "And so the answer of let's do positive GDP is the answer rapidly and exponentially obviously accelerated the planetary boundary side."}, {"time": 5847, "text": "And that started to be, that was thought about for a long time, but it started to be modeled with the Club of Rome and limits of growth."}, {"time": 5879, "text": "You can't run an exponentially growing linear materials economy on a finite planet forever."}, {"time": 5885, "text": "That's not a hard thing to figure out."}, {"time": 5887, "text": "And it has to be exponential if there's an exponentiation in the monetary supply because of interest and then fractional reserve banking and to then be able to keep up with the growing monetary supply, you have to have growth of goods and services."}, {"time": 5899, "text": "So that's that kind of thing that has happened."}, {"time": 5904, "text": "But you also see that when you get these supply chains that are so interconnected across the world, you get increased fragility because a collapse or a problem in one area then affects the whole world in a much bigger area as opposed to the issues being local, right?"}, {"time": 5917, "text": "So we got to see with COVID and an issue that started in one part of China affecting the whole world so much more rapidly than would have happened before Bretton Woods, right?"}, {"time": 5928, "text": "Before international travel, supply chains, you know, that whole kind of thing and with a bunch of second and third order effects that people wouldn't have predicted, okay, we have to stop certain kinds of travel because of viral contaminants, but the countries doing agriculture depend upon fertilizer they don't produce that is shipped into them and depend upon pesticides they don't produce."}, {"time": 5947, "text": "So we got both crop failures and crops being eaten by locusts in scale in Northern Africa and Iran and things like that because they couldn't get the supplies of stuff in."}, {"time": 5955, "text": "So then you get massive starvation or future kind of hunger issues because of supply chain shutdowns."}, {"time": 5962, "text": "So you get this increased fragility and cascade dynamics where a small problem can end up leading to cascade effects."}, {"time": 5969, "text": "And also we went from two superpowers with one catastrophe weapon to now that same catastrophe weapon is there's more countries that have it, eight or nine countries that have it, and there's a lot more types of catastrophe weapons."}, {"time": 5990, "text": "We now have catastrophe weapons with weaponized drones that can hit infrastructure targets with bio, with in fact every new type of tech has created an arms race."}, {"time": 5999, "text": "So we have not with the UN or the other kind of intergovernmental organizations, we haven't been able to really do nuclear de proliferation."}, {"time": 6007, "text": "We've actually had more countries get nukes and keep getting faster nukes, the race to hypersonics and things like that."}, {"time": 6015, "text": "And every new type of technology that has emerged has created an arms race."}, {"time": 6020, "text": "And so you can't do mutually assured destruction with multiple agents the way you can with two agents."}, {"time": 6026, "text": "Two agents, it's much easier to create a stable Nash equilibrium that's forced."}, {"time": 6031, "text": "But the ability to monitor and say if these guys shoot, who do I shoot?"}, {"time": 6033, "text": "Do I shoot them?"}, {"time": 6034, "text": "Do I shoot everybody?"}, {"time": 6035, "text": "Do I?"}, {"time": 6036, "text": "And so you get a three body problem."}, {"time": 6037, "text": "You get a very complex type of thing when you have multiple agents and multiple different types of catastrophe weapons, including ones that can be much more easily produced than nukes."}, {"time": 6046, "text": "Nukes are really hard to produce."}, {"time": 6047, "text": "There's only uranium in a few areas."}, {"time": 6048, "text": "uranium enrichment is hard, ICBMs are hard, but weaponized drones hitting smart targets is not so hard."}, {"time": 6055, "text": "There's a lot of other things where basically the scale at being able to manufacture them is going way, way down to where even non state actors can have them."}, {"time": 6062, "text": "And so when we talk about exponential tech and the decentralization of exponential tech, what that means is decentralized catastrophe weapon capacity."}, {"time": 6074, "text": "And especially in a world of increasing numbers of people feeling disenfranchised, frantic, whatever for different reasons."}, {"time": 6106, "text": "So now we're, so like there was all the world until world war II and world war II is just from a civilization timescale point of view is just a second ago."}, {"time": 6114, "text": "It seems like a long time, but it is really not."}, {"time": 6116, "text": "We get a short period of relative peace at the level of superpowers while building up the military capacity for much, much, much worse war the entire time."}, {"time": 6124, "text": "And then now we're at this new phase where the things that allowed us to make it through the nuclear power are not the same systems that will let us make it through the next stage."}, {"time": 6134, "text": "So what is this next post Bretton Woods?"}, {"time": 6138, "text": "How do we become safe vessels, safe stewards of many different types of exponential technology is a key question when we're thinking about X risk."}, {"time": 6151, "text": "And I'd like to try to answer the how a few ways, but first on the mutually assured destruction."}, {"time": 6161, "text": "Do you give credit to the idea of two superpowers now blowing each other up with nuclear weapons to the simple game theoretic model of mutually assured destruction or something you've said previously this idea of inverse correlation, which I tend to believe between the, now you were talking about tech, but I think it's maybe broadly true."}, {"time": 6189, "text": "The inverse correlation between competence and propensity for destruction."}, {"time": 6194, "text": "So the better, the, the, the bigger your weapons, not because you're afraid of a mutually assured self destruction, but because we're human beings and there's a deep moral fortitude there that somehow aligned with competence and being good at your job that like, it's very hard to be a psychopath and be good at killing at scale."}, {"time": 6222, "text": "Do you share any of that intuition?"}, {"time": 6259, "text": "What are you worried about?"}, {"time": 6260, "text": "The Genghis Khan, or you could argue he's not a psychopath."}, {"time": 6267, "text": "That are you worried about Genghis Khan, are you worried about Hitler or are you worried about a terrorist who is, has a very different ethic, which is not even for, it's not trying to preserve and build and expand my community."}, {"time": 6286, "text": "It's more about just the destruction in itself is the goal."}, {"time": 6290, "text": "I think the thing that you're looking at that I do agree with is that there's a psychological disposition towards construction and a psychological disposition more towards destruction."}, {"time": 6303, "text": "Obviously everybody has both and can toggle between both and oftentimes one is willing to destroy certain things."}, {"time": 6309, "text": "We have this idea of creative destruction, right?"}, {"time": 6311, "text": "Willing to destroy certain things to create other things and utilitarianism and trolley problems are all about exploring that space and the idea of war is all about that."}, {"time": 6320, "text": "I am trying to create something for our people and it requires destroying some other people."}, {"time": 6329, "text": "Sociopathy is a funny topic because it's possible to have very high fealty to your in group and work on perfecting the methods of torture to the out group at the same time because you can dehumanize and then remove empathy."}, {"time": 6343, "text": "And I would also say that there are types."}, {"time": 6385, "text": "A little bit, I think."}, {"time": 6387, "text": "I think a lot."}, {"time": 6389, "text": "I think it's actually, I mean, this is the conversation I had like with, I think offline with Dan Carlin, which is like, it's pretty easy to come up with ways that any competent, I can come up with a lot of ways to hurt a lot of people and it's pretty easy, like I alone could do it and there's a lot of people as smart or smarter than me, at least in their creation of explosives."}, {"time": 6418, "text": "Why are we not seeing more insane mass murder?"}, {"time": 6459, "text": "So when I can get commercial tech and maybe I don't understand tech very well but I understand it well enough to utilize it, not to create it and I can repurpose it."}, {"time": 6471, "text": "When we saw that commercial drone with a homemade thermite bomb hit the Ukrainian munitions factory and do the equivalent of an incendiary bomb level of damage, that was just home tech, that's just simple kind of thing."}, {"time": 6486, "text": "And so the question is not does it stay being a small percentage of the population?"}, {"time": 6494, "text": "The question is can you bind that phenomena nearly completely and especially now as you start to get into bigger things, CRISPR gene drive technologies and various things like that, can you bind it completely long term over what period of time?"}, {"time": 6516, "text": "Not perfectly though, that's the thing."}, {"time": 6518, "text": "I'm trying to say that there is some, let's call it, that's a random word, love, that's inherent and that's core to human nature that's preventing destruction at scale."}, {"time": 6565, "text": "But the thing is it seems like it's a race between the cheapening of destructive weapons and the capacity of humans to express their love towards each other and it's a race that so far, I know on Twitter it's not popular to say but love is winning, okay?"}, {"time": 6592, "text": "So what is the argument that love is going to lose here against nuclear weapons and biotech and AI and drones?"}, {"time": 6602, "text": "Okay I'm going to comment the end of this to a how love wins so I just want you to know that that's where I'm oriented."}, {"time": 6609, "text": "That's the end, okay."}, {"time": 6610, "text": "But I'm going to argue against why that is a given because it's not a given, I don't believe and I think that it's... This is like a good romantic comedy so you're going to create drama right now but it will end in a happy ending."}, {"time": 6627, "text": "Well it's because it's only a happy ending if we actually understand the issues well enough and take responsibility to shift it."}, {"time": 6669, "text": "So like it's easier to think of scenarios where we blow ourselves up than it is to think of scenarios where we avoid every single scenario where we blow ourselves up."}, {"time": 6676, "text": "And when I say blow ourselves up I mean the environmental versions, the terrorist versions, the war versions, the cumulative externalities versions."}, {"time": 6685, "text": "And I'm sorry if I'm interrupting your flow of thought but why is it easier?"}, {"time": 6693, "text": "Could it be a weird psychological thing where we either are just more capable to visualize explosions and destruction and then the sicker thought which is like we kind of enjoy for some weird reason thinking about that kind of stuff even though we wouldn't actually act on it."}, {"time": 6709, "text": "It's almost like some weird, like I love playing shooter games, you know, first person shooters and like especially if it's like murdering zombies and doom, you're shooting demons."}, {"time": 6721, "text": "I play one of my favorite games Diablo is like slashing through different monsters and the screaming and pain and the hellfire and then I go out into the real world to eat my coconut ice cream and I'm all about love."}, {"time": 6733, "text": "So like can we trust our ability to visualize how it all goes to shit as an actual rational way of thinking?"}, {"time": 6742, "text": "I think it's a fair question to say to what degree is there just kind of perverse fantasy and morbid exploration and whatever else that happens in our imagination but I don't think that's the whole of it."}, {"time": 6758, "text": "I think there is also a reality to the combinatorial possibility space and the difference in the probabilities that there's a lot of ways I could try to put the 70 trillion cells of your body together that don't make you."}, {"time": 6773, "text": "There's not that many ways I can put them together that make you."}, {"time": 6775, "text": "There's a lot of ways I could try to connect the organs together that make some weird kind of group of organs on a desk but that doesn't actually make a functioning human and you can kill an adult human in a second but you can't get one in a second."}, {"time": 6789, "text": "It takes 20 years to grow one and a lot of things happen right."}, {"time": 6792, "text": "I could destroy this building in a couple of minutes with demolition but it took a year or a couple of years to build it."}, {"time": 6803, "text": "This is just an example."}, {"time": 6805, "text": "He doesn't mean it."}, {"time": 6807, "text": "There's a gradient where entropy is easier and there's a lot more ways to put a set of things together that don't work than the few that really do produce higher order synergies."}, {"time": 6847, "text": "And for it to get ahead, it has to have none of those happen."}, {"time": 6852, "text": "And so there's just a probability space where it's easier to imagine that thing."}, {"time": 6858, "text": "So to say how do we have a protopic future, we have to say, well, one criteria must be that it avoids all of the catastrophic risks."}, {"time": 6868, "text": "Can we inventory the patterns of human behavior that give rise to them?"}, {"time": 6872, "text": "And could we try to solve for that?"}, {"time": 6875, "text": "And could we have that be the essence of the social technology that we're thinking about to be able to guide, bind, and direct a new physical technology?"}, {"time": 6897, "text": "But we have things that don't look like warfare, like Rockefeller and Standard Oil."}, {"time": 6904, "text": "And it looked like a constructive mindset to be able to bring this new energy resource to the world, and it did."}, {"time": 6914, "text": "And the second order effects of that are climate change and all of the oil spills that have happened and will happen and all of the wars in the Middle East over the oil that have been there and the massive political clusterfuck and human life issues that are associated with it and on and on, right?"}, {"time": 6936, "text": "And so it's also not just the orientation to construct a thing can have a narrow focus on what I'm trying to construct but be affecting a lot of other things through second and third order effects I'm not taking responsibility for."}, {"time": 6951, "text": "You often on another tangent mentioned second, third, and fourth order effects."}, {"time": 6959, "text": "Cascading."}, {"time": 6960, "text": "Which is really fascinating."}, {"time": 6962, "text": "Like starting with the third order plus it gets really interesting because we don't even acknowledge like the second order effects."}, {"time": 6972, "text": "But like thinking because those it could get bigger and bigger and bigger in ways we were not anticipating."}, {"time": 6978, "text": "So how do we make those?"}, {"time": 6980, "text": "So it sounds like part of the thing that you are thinking through in terms of a solution how to create an anti fragile, a resilient society is to make explicit acknowledge, understand the externalities, the second order, third order, fourth order, and the order effects."}, {"time": 7004, "text": "How do we start to think about those effects?"}, {"time": 7007, "text": "Yeah, the war application is harm we're trying to cause or that we're aware we're causing."}, {"time": 7013, "text": "The externality is harm that at least supposedly we're not aware we're causing or at minimum it's not our intention."}, {"time": 7020, "text": "Maybe we're either totally unaware of it or we're aware of it but it is a side effect of what our intention is."}, {"time": 7024, "text": "It's not the intention itself."}, {"time": 7026, "text": "There are catastrophic risks from both types."}, {"time": 7029, "text": "The direct application of increased technological power to a rivalrous intent which is going to cause harm for some out group, for some in group to win."}, {"time": 7039, "text": "But the out group is also working on growing the tech and if they don't lose completely they reverse engineer the tech, up regulate it, come back with more capacity."}, {"time": 7047, "text": "So there's the exponential tech arms race side of in group, out group rivalry using exponential tech that is one set of risks."}, {"time": 7119, "text": "They weren't trying to do that but it was a second order effect and it's a pretty fucking powerful second order effect and a pretty fast one because the rate of tech is obviously able to get distributed to much larger scale much faster and with a bigger jump in terms of total vertical capacity than that's what it means to get to the verticalizing part of an exponential curve."}, {"time": 7142, "text": "So just like we can see that oil had the second order environmental effects and also social and political effects."}, {"time": 7151, "text": "War and so much of the whole like the total amount of oil used has a proportionality to total global GDP and this is why we have this the petrodollar and so the oil thing also had the externalities of a major aspect of what happened with military industrial complex and things like that."}, {"time": 7174, "text": "But we can see the same thing with more current technologies with Facebook and Google and other things."}, {"time": 7181, "text": "So I don't think we can run and the more powerful the tech is, we build it for reason X, whatever reason X is."}, {"time": 7191, "text": "Maybe X is three things, maybe it's one thing, right?"}, {"time": 7195, "text": "We're doing the oil thing because we wanna make cars because it's a better method of individual transportation, we're building the Facebook thing because we're gonna connect people socially in a personal sphere."}, {"time": 7204, "text": "But it interacts with complex systems, with ecologies, economies, psychologies, cultures, and so it has effects on other than the thing we're intending."}, {"time": 7216, "text": "Some of those effects can end up being negative effects, but because this technology, if we make it to solve a problem, it has to overcome the problem."}, {"time": 7225, "text": "The problem has been around for a while, it's gonna overcome in a short period of time."}, {"time": 7228, "text": "So it usually has greater scale, greater rate of magnitude in some way."}, {"time": 7232, "text": "That also means that the externalities that it creates might be bigger problems."}, {"time": 7237, "text": "And you can say, well, but then that's the new problem and humanity will innovate its way out of that."}, {"time": 7241, "text": "Well, I don't think that's paying attention to the fact that we can't keep up with exponential curves like that, nor do finite spaces allow exponential externalities forever."}, {"time": 7252, "text": "And this is why a lot of the smartest people thinking about this are thinking, well, no, I think we're totally screwed unless we can make a benevolent AI singleton that rules all of us."}, {"time": 7263, "text": "Guys like Ostrom and others thinking in those directions, because they're like, how do humans try to do multipolarity and make it work?"}, {"time": 7274, "text": "And I have a different answer of what I think it looks like that does have more to do with love, but some applied social tech aligned with love."}, {"time": 7282, "text": "That's good, because I have a bunch of really dumb ideas I'd prefer to hear."}, {"time": 7288, "text": "I'd like to hear some of them first."}, {"time": 7290, "text": "I think the idea I would have is to be a bit more rigorous in trying to measure the amount of love you add or subtract from the world in second, third, fourth, fifth order effects."}, {"time": 7306, "text": "It's actually, I think, especially in the world of tech, quite doable."}, {"time": 7312, "text": "You just might not like, the shareholders may not like that kind of metric, but it's pretty easy to measure."}, {"time": 7321, "text": "That's not even, I'm perhaps half joking about love, but we could talk about just happiness and well being, long term well being."}, {"time": 7331, "text": "That's pretty easy for Facebook, for YouTube, for all these companies to measure that."}, {"time": 7336, "text": "They do a lot of kinds of surveys."}, {"time": 7339, "text": "There's very simple solutions here that you could just survey how, I mean, servers are in some sense useless because they're a subset of the population."}, {"time": 7351, "text": "You're just trying to get a sense, it's very loose kind of understanding, but integrated deeply as part of the technology."}, {"time": 7357, "text": "Most of our tech is recommender systems."}, {"time": 7359, "text": "Most of the, sorry, not tech, online interactions driven by recommender systems that learn very little data about you and use that data based on, mostly based on traces of your previous behavior to suggest future things."}, {"time": 7374, "text": "This is how Twitter, this is how Facebook works."}, {"time": 7376, "text": "This is how AdSense or Google AdSense works, this is how Netflix, YouTube work and so on."}, {"time": 7382, "text": "And for them to just track as opposed to engagement, how much you spend in a particular video, a particular site, is also track, give you the technology to do self report of what makes you feel good, what makes you grow as a person, of what makes you, you know, the best version of yourself, the Rogan idea of the hero of your movie."}, {"time": 7411, "text": "And just add that little bit of information."}, {"time": 7414, "text": "If you have people, you have this like happiness surveys of how you feel about the last five days, how would you report your experience."}, {"time": 7422, "text": "You can lay out the set of videos."}, {"time": 7425, "text": "It's kind of fascinating, I don't know if you ever look at YouTube, the history of videos you've looked at."}, {"time": 7430, "text": "It's very embarrassing for me."}, {"time": 7463, "text": "And I could look back and rate which videos made me a better person and not."}, {"time": 7469, "text": "And I mean, on a more serious note, there's a bunch of conversations, podcasts or lectures I've watched, which made me a better person and some of them made me a worse person."}, {"time": 7480, "text": "And honestly, not for stupid reasons, like I feel dumber, but because I do have a sense that that started me on a path of, of not being kind to other people."}, {"time": 7494, "text": "For example, I'll give you a, for my own, and I'm sorry for ranting, but maybe there's some usefulness to this kind of exploration of self."}, {"time": 7502, "text": "When I focus on creating, on programming, on science, I become a much deeper thinker and a kinder person to others."}, {"time": 7514, "text": "When I listen to too many, a little bit is good, but too many podcasts or videos about how, how our world is melting down or criticizing ridiculous people, the worst of the quote unquote woke, for example."}, {"time": 7530, "text": "All there's all these groups that are misbehaving in fascinating ways because they've been corrupted by power."}, {"time": 7537, "text": "The more I watch, the more I watch criticism of them, the worse I become."}, {"time": 7544, "text": "And I'm aware of this, but I'm also aware that for some reason it's pleasant to watch those sometimes."}, {"time": 7551, "text": "And so for, for me to be able to self report that to the YouTube algorithm, to the systems around me, and they ultimately try to optimize to make me the best person, the best version of myself, which I personally believe would make YouTube a lot more money because I'd be much more willing to spend time on YouTube and give YouTube a lot more, a lot more of my money."}, {"time": 7572, "text": "That's a, that's great for business and great for humanity because it'll make me a kinder person."}, {"time": 7578, "text": "It'll increase the love quotient, the love metric, and it'll make them a lot of money."}, {"time": 7585, "text": "I feel like everything's aligned."}, {"time": 7587, "text": "And so you, you should do that not just for YouTube algorithm, but also for military strategy and whether you go to war or not, because one externality you can think of about going to war, which I think we talked about offline is we often go to war with kind of governments with a, with, not with the people."}, {"time": 7606, "text": "You have to think about the kids of countries that see a soldier and because of what they experienced the interaction with the soldier, hate is born."}, {"time": 7621, "text": "When you're like eight years old, six years old, you lose your dad, you lose your mom, you lose a friend, somebody close to you that want a really powerful externality that could be reduced to love, positive and negative is the hate that's born when you make decisions."}, {"time": 7639, "text": "And that's going to take fruition that that little seed is going to become a tree that then leads to the kind of destruction that we talk about."}, {"time": 7650, "text": "So but in my sense, it's possible to reduce everything to a measure of how much love does this add to the world."}, {"time": 7658, "text": "All that to say, do you have ideas of how we practically build systems that create a resilient society?"}, {"time": 7669, "text": "There were a lot of good things that you shared where there's like 15 different ways that we could enter this that are all interesting."}, {"time": 7677, "text": "So I'm trying to see which one will probably be most useful."}, {"time": 7680, "text": "Pick the one or two things that are least ridiculous."}, {"time": 7683, "text": "When you were mentioning if we could see some of the second order effects or externalities that we aren't used to seeing, specifically the one of a kid being radicalized somewhere else, which engenders enmity in them towards us, which decreases our own future security."}, {"time": 7700, "text": "Even if you don't care about the kid, if you care about the kid, it's a whole other thing."}, {"time": 7704, "text": "Yeah, I mean, I think when we saw this, when Jane Fonda and others went to Vietnam and took photos and videos of what was happening, and you got to see the pictures of the kids with napalm on them, that like the antiwar effort was bolstered by that in a way it couldn't have been without that."}, {"time": 7725, "text": "Until we can see the images, you can't have a mere neuron effect in the same way."}, {"time": 7730, "text": "And when you can, that starts to have a powerful effect."}, {"time": 7767, "text": "So they have more enmity towards us and whatever technologies we employed to be successful, they will now reverse engineer, make iterations on and come back."}, {"time": 7775, "text": "And so you drive an arms race, which is why you can see that the wars were over history employing more lethal weaponry."}, {"time": 7786, "text": "And not just the kinetic war, the information war and the narrative war and the economic war, like it just increased capacity in all of those fronts."}, {"time": 7798, "text": "And so what seems like a win to us on the short term might actually really produce losses in the long term."}, {"time": 7805, "text": "And what's even in our own best interest in the long term is probably more aligned with everyone else because we inter affect each other."}, {"time": 7837, "text": "But in terms of a global level, the speed at which we are actually interconnected, the speed at which the harm happening to something in Wuhan affects the rest of the world or a new technology developed somewhere affects the entire world or an environmental issue or whatever is making it to where we either actually all get, not as a spiritual idea, just even as physics, right?"}, {"time": 7859, "text": "We all get the interconnectedness of everything and that we either all consider that and see how to make it through more effectively together or failures anywhere end up becoming decreased quality of life and failures and increased risk everywhere."}, {"time": 7872, "text": "Don't you think people are beginning to experience that at the individual level?"}, {"time": 7876, "text": "So governments are resisting it."}, {"time": 7878, "text": "They're trying to make us not empathize with each other, feel connected."}, {"time": 7881, "text": "But don't you think people are beginning to feel more and more connected?"}, {"time": 7885, "text": "Like isn't that exactly what the technology is enabling?"}, {"time": 7887, "text": "Like social networks, we tend to criticize them, but isn't there a sense which we're experiencing, you know?"}, {"time": 7897, "text": "When you watch those videos that are criticizing, whether it's the woke Antifa side or the QAnon Trump supporter side, does it seem like they have increased empathy for people that are outside of their ideologic camp?"}, {"time": 7912, "text": "I may be conflating my own experience of the world and that of the populace."}, {"time": 7924, "text": "I tend to see those videos as feeding something that's a relic of the past."}, {"time": 7932, "text": "They figured out that drama fuels clicks, but whether I'm right or wrong, I don't know."}, {"time": 7939, "text": "But I tend to sense that that is not, that hunger for drama is not fundamental to human beings that we want to actually, that we want to understand Antifa and we want to empathize."}, {"time": 7954, "text": "We want to take radical ideas and be able to empathize with them and synthesize it all."}, {"time": 7961, "text": "Okay, let's look at cultural outliers in terms of violence versus compassion."}, {"time": 7971, "text": "We can see that a lot of cultures have relatively lower in group violence, bigger out group violence, and there's some variance in them and variance at different times based on the scarcity or abundance of resource and other things."}, {"time": 7984, "text": "But you can look at say, Janes, whose whole religion is around nonviolence so much so that they don't even hurt plants, they only take fruits that fall off them and stuff."}, {"time": 7996, "text": "Or to go to a larger population, you could take Buddhists, where for the most part, with a few exceptions, for the most part across three millennia and across lots of different countries and geographies and whatever, you have 10 million people plus or minus who don't hurt bugs."}, {"time": 8013, "text": "The whole spectrum of genetic variance that is happening within a culture of that many people and head traumas and whatever, and nobody hurts bugs."}, {"time": 8021, "text": "And then you look at a group where the kids grew up as child soldiers in Liberia or Darfur were to make it to adulthood, pretty much everybody's killed people hand to hand and killed people who were civilian or innocent type of people."}, {"time": 8034, "text": "And you say, okay, so we were very neotenous, we can be conditioned by our environment and humans can be conditioned where almost all the humans show up in these two different bell curves."}, {"time": 8046, "text": "It doesn't mean that the Buddhists had no violence, it doesn't mean that these people had no compassion, but they're very different Gaussian distributions."}, {"time": 8054, "text": "And so I think one of the important things that I like to do is look at the examples of the populations, what Buddhism shows regarding compassion or what Judaism shows around education, the average level of education that everybody gets because of a culture that is really working on conditioning it or various cultures."}, {"time": 8075, "text": "What are the positive deviance outside of the statistical deviance to see what is actually possible and then say, what are the conditioning factors and can we condition those across a few of them simultaneously and could we build a civilization like that becomes a very interesting question."}, {"time": 8093, "text": "So there's this kind of real politic idea that humans are violent, large groups of humans become violent, they become irrational, specifically those two things, rivalrous and violent and irrational."}, {"time": 8105, "text": "And so in order to minimize the total amount of violence and have some good decisions, they need ruled somehow."}, {"time": 8110, "text": "And that not getting that is some kind of naive utopianism that doesn't understand human nature yet."}, {"time": 8116, "text": "This gets back to like mimesis of desire as an inexorable thing."}, {"time": 8120, "text": "I think the idea of the masses is actually a kind of propaganda that is useful for the classes that control to popularize the idea that most people are too violent, lazy, undisciplined and irrational to make good choices and therefore their choices should be sublimated in some kind of way."}, {"time": 8143, "text": "I think that if we look back at these conditioning environments, we can say, okay, so the kids that go to a really fancy school and have a good developmental environment like Exeter Academy, there's still a Gaussian distribution of how well they do on any particular metric, but on average, they become senators and the worst ones become high end lawyers or whatever."}, {"time": 8169, "text": "And then I look at the inner city school with a totally different set of things and I see a very, very differently displaced Gaussian distribution, but a very different set of conditioning factors."}, {"time": 8176, "text": "And then I say the masses, well, if all those kids who were one of the parts of the masses got to go to Exeter and have that family and whatever, would they still be the masses?"}, {"time": 8185, "text": "Could we actually condition more social virtue, more civic virtue, more orientation towards dialectical synthesis, more empathy, more rationality widely?"}, {"time": 8199, "text": "Would that lead to better capacity for something like participatory governance, democracy or republic or some kind of participatory governance?"}, {"time": 8209, "text": "Is it necessary for it actually?"}, {"time": 8214, "text": "And is it good for class interests?"}, {"time": 8218, "text": "By the way, when you say class interests, this is the powerful leading over the less powerful, that kind of idea."}, {"time": 8226, "text": "Anyone that benefits from asymmetries of power doesn't necessarily benefit from decreasing those asymmetries of power and kind of increasing the capacity of people more widely."}, {"time": 8240, "text": "And so, when we talk about power, we're talking about asymmetries in agency, influence and control."}, {"time": 8249, "text": "Do you think that hunger for power is fundamental to human nature?"}, {"time": 8253, "text": "I think we should get that straight before we talk about other stuff."}, {"time": 8256, "text": "So like this pick up line that I use at a bar often, which is power corrupts and absolute power corrupts, absolutely."}, {"time": 8265, "text": "Is that true or is that just a fancy thing to say?"}, {"time": 8268, "text": "In modern society, there's something to be said, have we changed as societies over time in terms of how much we crave power?"}, {"time": 8278, "text": "That there is an impulse towards power that is innate in people and can be conditioned one way or the other, yes, but you can see that Buddhist society does a very different thing with it at scale, that you don't end up seeing the emergence of the same types of sociopathic behavior and particularly then creating sociopathic institutions."}, {"time": 8301, "text": "And so, it's like, is eating the foods that were rare in our evolutionary environment that give us more dopamine hit because they were rare and they're not anymore, salt, sugar?"}, {"time": 8313, "text": "Is there something pleasurable about those where humans have an orientation to overeat if they can?"}, {"time": 8318, "text": "Well, the fact that there is that possibility doesn't mean everyone will obligately be obese and die of obesity, right?"}, {"time": 8324, "text": "Like it's possible to have a particular impulse and to be able to understand it, have other ones and be able to balance them."}, {"time": 8332, "text": "And so, to say that power dynamics are obligate in humans and we can't do anything about it is very similar to me to saying like everyone is going to be obligately obese."}, {"time": 8346, "text": "So, there's some degree to which the control of those impulses has to do with the conditioning early in life."}, {"time": 8352, "text": "And the culture that creates the environment to be able to do that and then the recursion on that."}, {"time": 8358, "text": "So, if we were to, bear with me, just asking for a friend, if we're to kill all humans on Earth and then start over, is there ideas about how to build up, okay, we don't have to kill, let's leave the humans on Earth, they're fine and go to Mars and start a new society."}, {"time": 8379, "text": "Is there ways to construct systems of conditioning, education of how we live with each other that would incentivize us properly to not seek power, to not construct systems that are of asymmetry of power and to create systems that are resilient to all kinds of terrorist attacks, to all kinds of destructions?"}, {"time": 8408, "text": "Is there some inclination?"}, {"time": 8410, "text": "Of course, you probably don't have all the answers, but you have insights about what that looks like."}, {"time": 8416, "text": "It's just rigorous practice of dialectic synthesis as essentially conversations with assholes of various flavors until they're not assholes anymore because you become deeply empathetic with their experience."}, {"time": 8430, "text": "So, there's a lot of things that we would need to construct to come back to this, like what is the basis of rivalry?"}, {"time": 8439, "text": "How do you bind it?"}, {"time": 8441, "text": "How does it relate to tech?"}, {"time": 8443, "text": "If you have a culture that is doing less rivalry, does it always lose in war to those who do war better?"}, {"time": 8449, "text": "And how do you make something on the enactment of how to get there from here?"}, {"time": 8453, "text": "So what's rivalry?"}, {"time": 8454, "text": "Well, is rivalry bad or good?"}, {"time": 8458, "text": "So is another word for rivalry competition?"}, {"time": 8461, "text": "Yes, I think roughly, yes."}, {"time": 8465, "text": "I think bad and good are kind of silly concepts here."}, {"time": 8470, "text": "Good for some things, bad for other things."}, {"time": 8472, "text": "Bad for some contexts and others."}, {"time": 8475, "text": "Even that."}, {"time": 8477, "text": "Let me give you an example that relates back to the Facebook measuring thing you were mentioning a moment ago."}, {"time": 8483, "text": "First, I think what you're saying is actually aligned with the right direction and what I want to get to in a moment, but it's not, the devil is in the details here."}, {"time": 8492, "text": "So I enjoy praise, it feeds my ego, I grow stronger."}, {"time": 8496, "text": "So I appreciate that."}, {"time": 8497, "text": "I will make sure to include one piece every 15 minutes as we go."}, {"time": 8502, "text": "So it's easier to measure, there are problems with this argument, but there's also utility to it."}, {"time": 8514, "text": "So let's take it for the utility it has first."}, {"time": 8519, "text": "It's harder to measure happiness than it is to measure comfort."}, {"time": 8524, "text": "We can measure with technology that the shocks in a car are making the car bounce less, that the bed is softer and, you know, material science and those types of things."}, {"time": 8536, "text": "And happiness is actually hard for philosophers to define because some people find that there's certain kinds of overcoming suffering that are necessary for happiness."}, {"time": 8546, "text": "There's happiness that feels more like contentment and happiness that feels more like passion."}, {"time": 8550, "text": "Is passion the source of all suffering or the source of all creativity?"}, {"time": 8552, "text": "Like there's deep stuff and it's mostly first person, not measurable third person stuff, even if maybe it corresponds to third person stuff to some degree."}, {"time": 8560, "text": "But we also see examples of some of our favorite examples as people who are in the worst environments who end up finding happiness, right, where the third person stuff looks to be less conducive and there's some Victor Frankl, Nelson Mandela, whatever."}, {"time": 8574, "text": "But it's pretty easy to measure comfort and it's pretty universal."}, {"time": 8577, "text": "And I think we can see that the Industrial Revolution started to replace happiness with comfort quite heavily as the thing it was optimizing for."}, {"time": 8585, "text": "And we can see that when increased comfort is given, maybe because of the evolutionary disposition that expending extra calories when for the majority of our history we didn't have extra calories was not a safe thing to do."}, {"time": 8597, "text": "Who knows why?"}, {"time": 8599, "text": "When extra comfort is given, it's very easy to take that path, even if it's not the path that supports overall well being long term."}, {"time": 8609, "text": "And so, we can see that, you know, when you look at the techno optimist idea that we have better lives than Egyptian pharaohs and kings and whatever, what they're largely looking at is how comfortable our beds are and how comfortable the transportation systems are and things like that, in which case there's massive improvement."}, {"time": 8630, "text": "But we also see that in some of the nations where people have access to the most comfort, suicide and mental illness are the highest."}, {"time": 8637, "text": "And we also see that some of the happiest cultures are actually some of the ones that are in materially lame environments."}, {"time": 8680, "text": "And yet, in the presence of the comfort solution, it's very hard to not choose it, and then as you're choosing it regularly, to actually down regulate your overall adaptive capacity."}, {"time": 8728, "text": "Yeah, and I think they're answerable questions, right?"}, {"time": 8731, "text": "Progressively better, not perfect."}, {"time": 8733, "text": "Right, so first of all, let me throw out happiness and comfort out of the discussion, those seem like useless, the distinction, because I said they're useful, well being is useful, but I think I take it back."}, {"time": 8747, "text": "I propose new metrics in this brainstorm session, which is, so one is like personal growth, which is intellectual growth, I think we're able to make that concrete for ourselves, like you're a better person than you were a week ago, or a worse person than you were a week ago."}, {"time": 8772, "text": "I think we can ourselves report that, and understand what that means, it's this grey area, and we try to define it, but I think we humans are pretty good at that, because we have a sense, an idealistic sense of the person we might be able to become."}, {"time": 8787, "text": "We all dream of becoming a certain kind of person, and I think we have a sense of getting closer and not towards that person."}, {"time": 8794, "text": "Maybe this is not a great metric, fine."}, {"time": 8796, "text": "The other one is love, actually."}, {"time": 8799, "text": "Like if you're happy or not, or you're comfortable or not, how much love do you have towards your fellow human beings?"}, {"time": 8807, "text": "I feel like if you try to optimize that, and increasing that, that's going to have, that's a good metric."}, {"time": 8815, "text": "How many times a day, sorry, if I can quantify, how many times a day have you thought positively of another human being?"}, {"time": 8822, "text": "Put that down as a number, and increase that number."}, {"time": 8826, "text": "I think the process of saying, okay, so let's not take GDP or GDP per capita as the metric we want to optimize for, because GDP goes up during war, and it goes up with more healthcare spending from sicker people, and various things that we wouldn't say correlate to quality of life."}, {"time": 8843, "text": "Addiction drives GDP awesomely."}, {"time": 8844, "text": "By the way, when I said growth, I wasn't referring to GDP."}, {"time": 8849, "text": "I'm giving an example now of the primary metric we use, and why it's not an adequate metric, because we're exploring other ones."}, {"time": 8855, "text": "So the idea of saying, what would the metrics for a good civilization be?"}, {"time": 8861, "text": "If I had to pick a set of metrics, what would the best ones be if I was going to optimize for those?"}, {"time": 8866, "text": "And then really try to run the thought experiment more deeply, and say, okay, so what happens if we optimize for that?"}, {"time": 8874, "text": "Try to think through the first, and second, and third order effects of what happens that's positive, and then also say, what negative things can happen from optimizing that?"}, {"time": 8883, "text": "What actually matters that is not included in that or in that way of defining it?"}, {"time": 8887, "text": "Because love versus number of positive thoughts per day, I could just make a long list of names and just say positive thing about each one."}, {"time": 8893, "text": "It's all very superficial."}, {"time": 8895, "text": "Not include animals or the rest of life, have a very shallow total amount of it, but I'm optimizing the number, and if I get some credit for the number."}, {"time": 8904, "text": "And this is when I said the model of reality isn't reality."}, {"time": 8909, "text": "When you make a set of metrics that we're going to optimize for this, whatever reality is that is not included in those metrics can be the areas where harm occurs, which is why I would say that wisdom is something like the discernment that leads to right choices beyond what metrics based optimization would offer."}, {"time": 8933, "text": "Yeah, but another way to say that is wisdom is a constantly expanding and evolving set of metrics."}, {"time": 8946, "text": "Which means that there is something in you that is recognizing a new metric that's important that isn't part of that metric set."}, {"time": 8951, "text": "So there's a certain kind of connection, discernment, awareness, and this is an iterative game theory."}, {"time": 8959, "text": "There's a girdles and completeness theorem, right?"}, {"time": 8960, "text": "Which is if the system, if the set of things is consistent, it won't be complete."}, {"time": 8964, "text": "So we're going to keep adding to it, which is why we were saying earlier, I don't think it's not beautiful."}, {"time": 8970, "text": "And especially if you were just saying one of the metrics you want to optimize for at the individual level is becoming, right?"}, {"time": 8974, "text": "That we're becoming more."}, {"time": 8975, "text": "Well, that then becomes true for the civilization and our metric sets as well."}, {"time": 8979, "text": "And our definition of how to think about a meaningful life and a meaningful civilization."}, {"time": 8984, "text": "I can tell you what some of my favorite metrics are."}, {"time": 8990, "text": "Well love is obviously not a metric."}, {"time": 8992, "text": "It's like you can bench."}, {"time": 8994, "text": "It's a good metric."}, {"time": 8996, "text": "I want to optimize that across the entire population, starting with infants."}, {"time": 9001, "text": "So in the same way that love isn't a metric, but you could make metrics that look at certain parts of it."}, {"time": 9007, "text": "The thing I'm about to say isn't a metric, but it's a, it's a consideration because I thought about this a lot."}, {"time": 9012, "text": "I don't think there is a metric, a right one."}, {"time": 9016, "text": "I think that every metric by itself without this thing we talked about of the continuous improvement becomes a paperclip maximizer."}, {"time": 9022, "text": "I think that's why what the idea of false idol means in terms of the model of reality not being reality."}, {"time": 9029, "text": "Then my sacred relationship is to reality itself, which also binds me to the unknown forever."}, {"time": 9035, "text": "To the known, but also to the unknown."}, {"time": 9036, "text": "And there's a sense of sacredness connected to the unknown that creates an epistemic humility that is always seeking not just to optimize the thing I know, but to learn new stuff."}, {"time": 9045, "text": "And to be open to perceive reality directly."}, {"time": 9047, "text": "So my model never becomes sacred."}, {"time": 9049, "text": "My model is useful."}, {"time": 9050, "text": "My So the model can't be the false idol."}, {"time": 9055, "text": "And this is why the first verse of the Tao Te Ching is the Tao that is nameable is not the eternal Tao."}, {"time": 9060, "text": "The naming then can become the source of the 10,000 things that if you get too carried away with it can actually obscure you from paying attention to reality beyond in the models."}, {"time": 9069, "text": "It sounds a lot, a lot like Stephen Wolfram, but in a different language, much more poetic."}, {"time": 9074, "text": "I can imagine that."}, {"time": 9075, "text": "No, I'm referring, I'm joking, but there's a echoes of cellular automata, which you can't name."}, {"time": 9081, "text": "You can't construct a good model cellular automata."}, {"time": 9084, "text": "You can only watch in awe."}, {"time": 9087, "text": "I'm distracting your train of thought horribly and miserably making it different."}, {"time": 9092, "text": "By the way, something robots aren't good at and dealing with the uncertainty of uneven ground."}, {"time": 9097, "text": "You've been okay so far."}, {"time": 9098, "text": "You've been doing wonderfully."}, {"time": 9100, "text": "So what's your favorite metrics?"}, {"time": 9102, "text": "So I know you're not a robot."}, {"time": 9137, "text": "And then you have whatever your answer is, how do you know what is the epistemic basis for postulating that?"}, {"time": 9145, "text": "There's also a whole nother reason for asking that question."}, {"time": 9147, "text": "I don't, I mean, that doesn't even apply to you whatsoever, which is, it's interesting how few people have been asked questions like it."}, {"time": 9161, "text": "The joke about these questions is silly, right?"}, {"time": 9165, "text": "It's funny to watch a person and if I was more of an asshole, I would really stick on that question."}, {"time": 9172, "text": "It's a silly question in some sense, but like we haven't really considered what it means."}, {"time": 9178, "text": "Just a more concrete version of that question is what is a better world?"}, {"time": 9183, "text": "What is the kind of world we're trying to create really?"}, {"time": 9186, "text": "Have you really thought, I'll give you some kind of simple answers to that that are meaningful to me, but let me do the societal indices first because they're fun."}, {"time": 9197, "text": "We should take a note of this meaningful thing because it's important to come back to."}, {"time": 9200, "text": "Are you reminding me to ask you about the meaning of life?"}, {"time": 9203, "text": "Noted."}, {"time": 9204, "text": "Let me jot that down."}, {"time": 9208, "text": "So because I think I stopped tracking it like 25 open threads."}, {"time": 9214, "text": "Let it all burn."}, {"time": 9216, "text": "One index that I find very interesting is the inverse correlation of addiction within the society."}, {"time": 9225, "text": "The more a society produces addiction within the people in it, the less healthy I think the society is as a pretty fundamental metric."}, {"time": 9234, "text": "And so the more the individuals feel that there are less compulsive things in compelling them to behave in ways that are destructive to their own values."}, {"time": 9246, "text": "And insofar as a civilization is conditioning and influencing the individuals within it, the inverse of addiction."}, {"time": 9254, "text": "Lovely defined."}, {"time": 9256, "text": "Addiction."}, {"time": 9257, "text": "What's it?"}, {"time": 9259, "text": "Compulsive behavior that is destructive towards things that we value."}, {"time": 9268, "text": "I think that's a very interesting one to think about."}, {"time": 9269, "text": "That's a really interesting one."}, {"time": 9270, "text": "And this is then also where comfort and addiction start to get very close."}, {"time": 9275, "text": "And the ability to go in the other direction from addiction is the ability to be exposed to hypernormal stimuli and not go down the path of desensitizing to other stimuli and needing that hypernormal stimuli, which does involve a kind of hormesis."}, {"time": 9291, "text": "So I do think the civilization of the future has to create something like ritualized discomfort."}, {"time": 9300, "text": "And I think that's what the sweat lodge and the vision quest and the solo journey and the ayahuasca journey and the Sundance were."}, {"time": 9313, "text": "I think it's even a big part of what yoga asana was, is to make beings that are resilient and strong, they have to overcome some things."}, {"time": 9323, "text": "To make beings that can control their own mind and fear, they have to face some fears."}, {"time": 9327, "text": "But we don't want to put everybody in war or real trauma."}, {"time": 9331, "text": "And yet we can see that the most fucked up people we know had childhoods of a lot of trauma."}, {"time": 9336, "text": "But some of the most incredible people we know had childhoods of a lot of trauma, whether or not they happened to make it through and overcome that or not."}, {"time": 9343, "text": "So how do we get the benefits of the stealing of character and the resilience and the whatever that happened from the difficulty without traumatizing people?"}, {"time": 9352, "text": "A certain kind of ritualized discomfort that not only has us overcome something by ourselves, but overcome it together with each other where nobody bails when it gets hard because the other people are there."}, {"time": 9366, "text": "So it's both a resilience of the individuals and a resilience of the bonding."}, {"time": 9371, "text": "So I think we'll keep getting more and more comfortable stuff, but we have to also develop resilience in the presence of that for the anti addiction direction and the fullness of character and the trustworthiness to others."}, {"time": 9384, "text": "So you have to be consistently injecting discomfort into the system, ritualize."}, {"time": 9390, "text": "I mean, this sounds like you have to imagine Sisyphus happy."}, {"time": 9394, "text": "You have to imagine Sisyphus with his rock, optimally resilient from a metrics perspective in society."}, {"time": 9407, "text": "So we want to constantly be throwing rocks at ourselves."}, {"time": 9412, "text": "Not constantly."}, {"time": 9414, "text": "You didn't have to frequently, periodically, and there's different levels of intensity, different periodicities."}, {"time": 9421, "text": "Now, I do not think this should be imposed by states."}, {"time": 9425, "text": "I think it should emerge from cultures."}, {"time": 9429, "text": "And I think the cultures are developing people that understand the value of it."}, {"time": 9432, "text": "So there is both a cultural cohesion to it, but there's also a voluntaryism because the people value the thing that is being developed and understand it."}, {"time": 9442, "text": "And that's what conditioning, it's conditioning some of these values."}, {"time": 9448, "text": "Conditioning is a bad word because we like our idea of sovereignty, but when we recognize the language that we speak and the words that we think in and the patterns of thought built into that language and the aesthetics that we like and so much is conditioned in us just based on where we're born, you can't not condition people."}, {"time": 9465, "text": "So all you can do is take more responsibility for what the conditioning factors are."}, {"time": 9468, "text": "And then you have to think about this question of what is a meaningful human life?"}, {"time": 9471, "text": "Because we're, unlike the other animals born into environment that they're genetically adapted for, we're building new environments that we were not adapted for, and then we're becoming affected by those."}, {"time": 9482, "text": "So then we have to say, well, what kinds of environments, digital environments, physical environments, social environments would we want to create that would develop the healthiest, happiest, most moral, noble, meaningful people?"}, {"time": 9496, "text": "What are even those sets of things that matter?"}, {"time": 9498, "text": "So you end up getting deep existential consideration at the heart of civilization design when you start to realize how powerful we're becoming and how much what we're building it in service towards matters."}, {"time": 9508, "text": "Before I pull it, I think three threads you just laid down, is there another metric index that you're interested in?"}, {"time": 9515, "text": "There's one more that I really like."}, {"time": 9519, "text": "There's a number, but the next one that comes to mind is I have to make a very quick model."}, {"time": 9531, "text": "Healthy human bonding, say we were in a tribal type setting, my positive emotional states and your positive emotional states would most of the time be correlated, your negative emotional states and mine."}, {"time": 9544, "text": "And so you start laughing, I start laughing, you start crying, my eyes might tear up."}, {"time": 9550, "text": "And we would call that the compassion compersion axis."}, {"time": 9555, "text": "I would, this is a model I find useful."}, {"time": 9558, "text": "So compassion is when you're feeling something negative, I feel some pain, I feel some empathy, something in relationship."}, {"time": 9564, "text": "Compersion is when you do well, I'm stoked for you, right?"}, {"time": 9567, "text": "Like I actually feel happiness at your happiness."}, {"time": 9569, "text": "I like compersion."}, {"time": 9570, "text": "Yeah, the fact that it's such an uncommon word in English is actually a problem culturally."}, {"time": 9575, "text": "Because I feel that often, and I think that's a really good feeling to feel and maximize for actually."}, {"time": 9581, "text": "That's actually the metric I'm going to say is the compassion compersion axis is the thing I would optimize for."}, {"time": 9587, "text": "Now, there is a state where my emotional states and your emotional states are just totally decoupled."}, {"time": 9595, "text": "And that is like sociopathy."}, {"time": 9597, "text": "I don't want to hurt you, but I don't care if I do or for you to do well or whatever."}, {"time": 9601, "text": "But there's a worse state and it's extremely common, which is where they're inversely coupled."}, {"time": 9606, "text": "Where my positive emotions correspond to your negative ones and vice versa."}, {"time": 9611, "text": "And that is the, I would call it the jealousy sadism axis."}, {"time": 9617, "text": "The jealousy axis is when you're doing really well, I feel something bad."}, {"time": 9620, "text": "I feel taken away from, less than, upset, envious, whatever."}, {"time": 9626, "text": "And that's so common, but I think of it as kind of a low grade psychopathology that we've just normalized."}, {"time": 9636, "text": "The idea that I'm actually upset at the happiness or fulfillment or success of another is like a profoundly fucked up thing."}, {"time": 9642, "text": "No, we shouldn't shame it and repress it so it gets worse."}, {"time": 9645, "text": "We should study it."}, {"time": 9647, "text": "And it comes from our own insecurities and stuff."}, {"time": 9650, "text": "But then the next part that everybody knows is really fucked up is just on the same axis."}, {"time": 9655, "text": "It's the same inverted, which is to the jealousy or the envy is the, I feel badly when you're doing well."}, {"time": 9662, "text": "The sadism side is I actually feel good when you lose or when you're in pain, I feel some happiness that's associated."}, {"time": 9667, "text": "And you can see when someone feels jealous, sometimes they feel jealous with a partner and then they feel they want that partner to get it, revenge comes up or something."}, {"time": 9677, "text": "So sadism is really like jealousy is one step on the path to sadism from the healthy compassion conversion axis."}, {"time": 9684, "text": "So, I would like to see a society that is inversely, that is conditioning sadism and jealousy inversely, right?"}, {"time": 9692, "text": "The lower that amount and the more the compassion conversion."}, {"time": 9696, "text": "And if I had to summarize that very simply, I'd say it would optimize for conversion."}, {"time": 9702, "text": "Which is because notice that's not just saying love for you where I might be self sacrificing and miserable and I love people, but I kill myself, which I don't think anybody thinks a great idea."}, {"time": 9713, "text": "Happiness where I might be sociopathically happy where I'm causing problems all over the place or even sadistically happy, but it's a coupling, right?"}, {"time": 9720, "text": "That I'm actually feeling happiness in relationship to yours and even in causal relationship where I, my own agentic desire to get happier wants to support you too."}, {"time": 9729, "text": "That's actually speaking of another pickup line."}, {"time": 9733, "text": "That's quite honestly what I, as a guy who is single, this is going to come out very ridiculous because it's like, oh yeah, where's your girlfriend, bro?"}, {"time": 9742, "text": "But that's what I look for in a relationship because it's like, it's so much, it's so, it's such an amazing life where you actually get joy from another person's success and they get joy from your success."}, {"time": 9760, "text": "And then it becomes like you don't actually need to succeed much for that to have a, like a loop, like a cycle of just like happiness that just increases like exponentially."}, {"time": 9773, "text": "So like just be, just enjoying the happiness of others, the success of others."}, {"time": 9778, "text": "So this, this is like the, let's call this, cause the first person that drilled this into my head is Rogan, Joe Rogan."}, {"time": 9785, "text": "He was the embodiment of that cause I saw somebody who is a successful, rich and nonstop true."}, {"time": 9793, "text": "I mean, you could tell when somebody is full of shit and somebody is not really genuinely enjoying the success of his friends."}, {"time": 9802, "text": "That was weird to me."}, {"time": 9804, "text": "And I mean, the way you're kind of speaking to it, the reason Joe stood out to me is I guess I haven't witnessed genuine expression of that often in this culture of just real joy for others."}, {"time": 9818, "text": "I mean, part of that has to do, there hasn't been many channels where you can watch or listen to people being their authentic selves."}, {"time": 9826, "text": "So I'm sure there's a bunch of people who live life with compersion."}, {"time": 9829, "text": "They probably don't seek public attention also, but that was, yeah, if there was any word that could express what I've learned from Joe, why he's been a really inspiring figure is that compersion."}, {"time": 9843, "text": "And I wish our world was, had a lot more of that cause then it may, I mean, my own, sorry to go in a small tangent, but like you're speaking how society should function."}, {"time": 9859, "text": "But I feel like if you optimize for that metric in your own personal life, you're going to live a truly fulfilling life."}, {"time": 9867, "text": "I don't know what the right word to use, but that's a really good way to live life."}, {"time": 9872, "text": "You will also learn what gets in the way of it and how to work with it that if you wanted to help try to build systems at scale or apply Facebook or exponential technologies to do that, you would have more actual depth of real knowledge of what that takes."}, {"time": 9888, "text": "And this is, you know, as you mentioned that there's this virtuous cycle between when you get stoked on other people doing well and then they have a similar relationship to you and everyone is in the process of building each other up."}, {"time": 9899, "text": "And this is what I would say the healthy version of competition is versus the unhealthy version."}, {"time": 9905, "text": "The healthy version, right, the root, I believe it's a Latin word that means to strive together."}, {"time": 9912, "text": "And it's that impulse of becoming where I want to become more, but I recognize that there's actually a hormesis."}, {"time": 9917, "text": "There's a challenge that is needed for me to be able to do that."}, {"time": 9921, "text": "But that means that, yes, there's an impulse where I'm trying to get ahead."}, {"time": 9924, "text": "Maybe I'm even trying to win, but I actually want a good opponent and I want them to get ahead too because that is where my ongoing becoming happens and the win itself will get boring very quickly."}, {"time": 9934, "text": "The ongoing becoming is where there's aliveness and for the ongoing becoming, they need to have it too."}, {"time": 9940, "text": "And that's the strive together."}, {"time": 9941, "text": "So, in the healthy competition, I'm stoked when they're doing really well because my becoming is supported by it."}, {"time": 9947, "text": "Now this is actually a very nice segue into a model I like about what a meaningful human life is, if you want to go there."}, {"time": 9961, "text": "I have three things I'm going elsewhere with, but if we were first, let us take this short stroll through the park of the meaning of life."}, {"time": 9972, "text": "Daniel, what is a meaningful life?"}, {"time": 9976, "text": "I think the semantics end up mattering because a lot of people will take the word meaning and the word purpose almost interchangeably and they'll think kind of, what is the meaning of my life?"}, {"time": 9991, "text": "What is the meaning of human life?"}, {"time": 9993, "text": "What's the meaning of the universe?"}, {"time": 9995, "text": "And what is the meaning of existence rather than nonexistence?"}, {"time": 9998, "text": "So, there's a lot of kind of existential considerations there and I think there's some cognitive mistakes that are very easy, like taking the idea of purpose."}, {"time": 10008, "text": "Which is like a goal?"}, {"time": 10009, "text": "Which is a utilitarian concept."}, {"time": 10011, "text": "The purpose of one thing is defined in relationship to other things that have assumed value."}, {"time": 10019, "text": "And to say, what is the purpose of everything?"}, {"time": 10020, "text": "Well, purpose is too small of a question."}, {"time": 10023, "text": "It's fundamentally a relative question within everything."}, {"time": 10025, "text": "What is the purpose of one thing relative to another?"}, {"time": 10027, "text": "What is the purpose of everything?"}, {"time": 10028, "text": "And there's nothing outside of it with which to say it."}, {"time": 10031, "text": "We actually just got to the limits of the utility of the concept of purpose."}, {"time": 10036, "text": "It doesn't mean it's purposeless in the sense of something inside of it being purposeless."}, {"time": 10039, "text": "It means the concept is too small."}, {"time": 10041, "text": "Which is why you end up getting to, you know, like in Taoism, talking about the nature of it."}, {"time": 10048, "text": "Rather, there's a fundamental what where the why can't go deeper is the nature of it."}, {"time": 10055, "text": "But I'm going to try to speak to a much simpler part, which is when people think about what is a meaningful human life."}, {"time": 10062, "text": "And kind of if we were to optimize for something at the level of individual life, but also, how does optimizing for this at the level of the individual life lead to the best society for insofar as people living that way affects others and long term, the world as a whole?"}, {"time": 10079, "text": "And how would we then make a civilization that was trying to think about these things?"}, {"time": 10085, "text": "Because you can see that there are a lot of dialectics where there's value on two sides, individualism and collectivism or the ability to accept things and the ability to push harder and whatever."}, {"time": 10102, "text": "And there's failure modes on both sides."}, {"time": 10105, "text": "And so, when you were starting to say, okay, individual happiness, you're like, wait, fuck, sadists can be happy while hurting people."}, {"time": 10111, "text": "It's not individual happiness, it's love."}, {"time": 10112, "text": "But wait, some people can self sacrifice out of love in a way that actually ends up just creating codependency for everybody."}, {"time": 10119, "text": "Or okay, so how do we think about all those things together?"}, {"time": 10128, "text": "This kind of came to me as a simple way that I kind of relate to it is that a meaningful life involves the mode of being, the mode of doing and the mode of becoming."}, {"time": 10140, "text": "And it involves a virtuous relationship between those three and that any of those modes on their own also have failure modes that are not a meaningful life."}, {"time": 10152, "text": "The mode of being, the way I would describe it, if we're talking about the essence of it is about taking in and appreciating the beauty of life that is now."}, {"time": 10165, "text": "It's a mode that is in the moment and that is largely about being with what is."}, {"time": 10173, "text": "It's fundamentally grounded in the nature of experience and the meaningfulness of experience."}, {"time": 10177, "text": "The prima facie meaningfulness of when I'm having this experience, I'm not actually asking what the meaning of life is, I'm actually full of it."}, {"time": 10185, "text": "I'm full of experiencing it."}, {"time": 10186, "text": "The momentary experience, the moment."}, {"time": 10190, "text": "So taking in the beauty of life."}, {"time": 10194, "text": "Being is adding to the beauty of life."}, {"time": 10196, "text": "I'm going to produce some art, I'm going to produce some technology that will make life easier and more beautiful for somebody else."}, {"time": 10201, "text": "I'm going to do some science that will end up leading to better insights or other people's ability to appreciate the beauty of life more because they understand more about it or whatever it is or protect it, right?"}, {"time": 10213, "text": "I'm going to protect it in some way."}, {"time": 10214, "text": "But that's adding to or being in service of the beauty of life through our doing."}, {"time": 10219, "text": "And becoming is getting better at both of those."}, {"time": 10223, "text": "Being able to deepen our being, which is to be able to take in the beauty of life more profoundly, be more moved by it, touched by it, and increasing our capacity with doing to add to the beauty of life more."}, {"time": 10237, "text": "So I hold that a meaningful life has to be all three of those."}, {"time": 10242, "text": "And where they're not in conflict with each other, ultimately it grounds in being, it grounds in the intrinsic meaningfulness of experience."}, {"time": 10252, "text": "And then my doing is ultimately something that will be able to increase the possibility of the quality of experience for others."}, {"time": 10260, "text": "And my becoming is a deepening on those."}, {"time": 10263, "text": "So it grounds an experience and also the evolutionary possibility of experience."}, {"time": 10269, "text": "And the point is to oscillate between these, never getting stuck on any one or I suppose in parallel, well you can't really, attention is a thing, you can only allocate attention."}, {"time": 10286, "text": "I want moments where I am absorbed in the sunset and I'm not thinking about what to do next."}, {"time": 10293, "text": "And then the fullness of that can make it to where my doing doesn't come from what's in it for me because I actually feel overwhelmingly full already."}, {"time": 10305, "text": "And then it's like how can I make life better for other people that don't have as much opportunities I had?"}, {"time": 10312, "text": "How can I add something wonderful?"}, {"time": 10313, "text": "How can I just be in the creative process?"}, {"time": 10316, "text": "And so I think where the doing comes from matters and if the doing comes from a fullness of being, it's inherently going to be paying attention to externalities or it's more oriented to do that than if it comes from some emptiness that is trying to get full in some way that is willing to cause sacrifices other places and where a chunk of its attention is internally focused."}, {"time": 10338, "text": "And so when Buddha said desire is the cause of all suffering, then later the vow of the Bodhisattva which was to show up for all sentient beings in universe forever is a pretty intense thing like desire."}, {"time": 10352, "text": "I would say there is a kind of desire, if we think of desire as a basis for movement like a flow or a gradient, there's a kind of desire that comes from something missing inside seeking fulfillment of that in the world."}, {"time": 10363, "text": "That ends up being the cause of actions that perpetuate suffering."}, {"time": 10366, "text": "But there's also not just non desire, there's a kind of desire that comes from feeling full at the beauty of life and wanting to add to it that is a flow this direction."}, {"time": 10377, "text": "And I don't think that is the cause of suffering."}, {"time": 10379, "text": "I think that is, you know, and the Western traditions, right, the Eastern traditions focused on that and kind of unconditional happiness outside of them, in the moment outside of time."}, {"time": 10389, "text": "The Western tradition said, no, actually, desire is the source of creativity and we're here to be made in the image and likeness of the creator."}, {"time": 10395, "text": "We're here to be fundamentally creative."}, {"time": 10397, "text": "But creating from where and in service of what?"}, {"time": 10401, "text": "Creating from a sense of connection to everything and wholeness in service of the well being of all of it is very different."}, {"time": 10408, "text": "Which is back to that compassion, compersion axis."}, {"time": 10411, "text": "Being, doing, becoming."}, {"time": 10414, "text": "It's pretty powerful."}, {"time": 10418, "text": "You could potentially be algorithmatized into a robot just saying, where does death come into that?"}, {"time": 10434, "text": "Being is forgetting, I mean, the concept of time completely."}, {"time": 10439, "text": "There's a sense to doing and becoming that has a deadline built in, the urgency built in."}, {"time": 10448, "text": "Do you think death is fundamental to this, to a meaningful life?"}, {"time": 10456, "text": "Acknowledging or feeling the terror of death, like Ernest Becker, or just acknowledging the uncertainty, the mystery, the melancholy nature of the fact that the ride ends."}, {"time": 10471, "text": "Is that part of this equation or it's not necessary?"}, {"time": 10474, "text": "Okay, look at how it could be related."}, {"time": 10477, "text": "I've experienced fear of death."}, {"time": 10480, "text": "I've also experienced times where I thought I was going to die that felt extremely peaceful and beautiful."}, {"time": 10490, "text": "And it's funny because we can be afraid of death because we're afraid of hell or bad reincarnation or the bardo or some kind of idea of the afterlife we have or we're projecting some kind of sentient suffering."}, {"time": 10505, "text": "But if we're afraid of just non experience, I noticed that every time I stay up late enough that I'm really tired, I'm longing for deep sleep and non experience, right?"}, {"time": 10518, "text": "Like I'm actually longing for experience to stop."}, {"time": 10521, "text": "And it's not morbid, it's not a bummer."}, {"time": 10526, "text": "And I don't mind falling asleep and sometimes when I wake up, I want to go back into it and then when it's done, I'm happy to come out of it."}, {"time": 10534, "text": "So when we think about death and having finite time here, and we could talk about if we live for a thousand years instead of a hundred or something like that, it would still be finite time."}, {"time": 10549, "text": "The one bummer with the age we die is that I generally find that people mostly start to emotionally mature just shortly before they die."}, {"time": 10558, "text": "But if I get to live forever, I can just stay focused on what's in it for me forever."}, {"time": 10575, "text": "And if life continues and consciousness and sentience and people appreciating beauty and adding to it and becoming continues, my life doesn't, but my life can have effects that continue well beyond it, then life with a capital L starts mattering more to me than my life."}, {"time": 10592, "text": "My life gets to be a part of and in service to."}, {"time": 10595, "text": "And the whole thing about when old men plant trees, the shade of which they'll never get to be in."}, {"time": 10633, "text": "And it's just fucking beautiful."}, {"time": 10635, "text": "And so like the most beautiful parts of humans have to do with something that transcends what's in it for me."}, {"time": 10643, "text": "And death forces you to that."}, {"time": 10645, "text": "So not only does death create the urgency of doing, you're very right, it does have a sense in which it incentivizes the compersion and the compassion."}, {"time": 10662, "text": "And the widening, you remember Einstein had that quote, something to the effect of it's an optical delusion of consciousness to believe there are separate things."}, {"time": 10670, "text": "There's this one thing we call universe and something about us being inside of a prison of perception that can only see a very narrow little bit of it."}, {"time": 10682, "text": "But this might be just some weird disposition of mine, but when I think about the future after I'm dead and I think about consciousness, I think about young people falling in love for the first time and their experience, and I think about people being awed by sunsets and I think about all of it, right?"}, {"time": 10707, "text": "I can't not feel connected to that."}, {"time": 10710, "text": "Do you feel some sadness to the very high likelihood that you will be forgotten completely by all of human history, you, Daniel, the name, that which cannot be named?"}, {"time": 10726, "text": "Systems like to self perpetuate, egos do that."}, {"time": 10732, "text": "The idea that I might do something meaningful that future people will appreciate, of course there's like a certain sweetness to that idea."}, {"time": 10740, "text": "But I know how many people did something, did things that I wouldn't be here without and that my life would be less without, whose names I will never know."}, {"time": 10749, "text": "And I feel a gratitude to them, I feel a closeness, I feel touched by that, and I think to the degree that the future people are conscious enough, there is a, you know, a lot of traditions have this kind of are we being good ancestors and respect for the ancestors beyond the names."}, {"time": 10766, "text": "I think that's a very healthy idea."}, {"time": 10770, "text": "But let me return to a much less beautiful and a much less pleasant conversation."}, {"time": 10776, "text": "You mentioned prison."}, {"time": 10777, "text": "Back to X risk, okay."}, {"time": 10781, "text": "And conditioning."}, {"time": 10783, "text": "You mentioned something about the state."}, {"time": 10788, "text": "So what role, let's talk about companies, governments, parents, all the mechanisms that can be a source of conditioning."}, {"time": 10798, "text": "Which flavor of ice cream do you like?"}, {"time": 10801, "text": "Do you think the state is the right thing for the future?"}, {"time": 10805, "text": "So governments that are elected democratic systems that are representing representative democracy."}, {"time": 10811, "text": "Is there some kind of political system of governance that you find appealing?"}, {"time": 10817, "text": "Is it parents, meaning a very close knit tribes of conditioning that's the most essential?"}, {"time": 10826, "text": "And then you and Michael Malice would happily agree that it's anarchy, or the state should be dissolved or destroyed or burned to the ground if you're Michael Malice, giggling, holding the torch as the fire burns."}, {"time": 10846, "text": "So which which is it is the state can state be good?"}, {"time": 10850, "text": "Or is the state bad for the conditioning of a beautiful world, A or B?"}, {"time": 10857, "text": "This is like an SPT test."}, {"time": 10858, "text": "You like to give these simplified good or bad things."}, {"time": 10863, "text": "Would I like the state that we live in currently, the United States federal government to stop existing today?"}, {"time": 10869, "text": "No, I would really not like that."}, {"time": 10871, "text": "I think that would be not quite bad for the world in a lot of ways."}, {"time": 10876, "text": "Do I think that it's a optimal social system and maximally just and humane and all those things?"}, {"time": 10884, "text": "And I wanted to continue as is."}, {"time": 10885, "text": "No, also not that."}, {"time": 10886, "text": "But I am much more interested in it being able to evolve to a better thing without going through the catastrophe phase that I think it's just non existence would give."}, {"time": 10898, "text": "So what size of state is good in a sense like do we should we as a human society as this world becomes more globalized?"}, {"time": 10907, "text": "Should we be constantly striving to reduce the we can we can put on a map like right now, literally, like the the centers of power in the world, some of them are tech companies, some of them are governments, should we be trying to as much as possible to decentralize the power to where it's very difficult to point on the map, the centers of power."}, {"time": 10967, "text": "So anarchy is about forming collectives based on their set of ideas, and doing so dynamically not based on where you were born, and so on."}, {"time": 10976, "text": "I think we can say that the natural state of humans, if we want to describe such a thing, is to live in tribes that were below the Dunbar number, meaning that for a few hundred thousand years of human history, all of the groups of humans mostly stayed under that size."}, {"time": 10996, "text": "And whenever it would get up to that size, it would end up cleaving."}, {"time": 10999, "text": "And so it seems like there's a pretty strong, but there weren't individual humans out in the wild doing really well, right?"}, {"time": 11005, "text": "So we were a group animal, but with groups that had a specific size."}, {"time": 11008, "text": "So we could say, in a way, humans were being domesticated by those groups."}, {"time": 11012, "text": "They were learning how to have certain rules to participate with the group, without which you'd get kicked out."}, {"time": 11017, "text": "But that's still the wild state of people."}, {"time": 11020, "text": "And maybe it's useful to do as a side statement, which I've recently looked at a bunch of papers around Dunbar's number, where the mean is actually 150."}, {"time": 11029, "text": "If you actually look at the original papers, it's a range."}, {"time": 11031, "text": "It's really a range."}, {"time": 11033, "text": "So it's actually somewhere under a thousand."}, {"time": 11036, "text": "So it's a range of like two to 500 or whatever it is."}, {"time": 11039, "text": "But like you could argue that the, I think it actually is exactly two, the range is two to 520, something like that."}, {"time": 11048, "text": "And this is the mean that's taken crudely."}, {"time": 11052, "text": "It's not a very good paper in terms of the actual numerically speaking."}, {"time": 11058, "text": "But it'd be interesting if there's a bunch of Dunbar numbers that could be computed for particular environments, particular conditions, so on."}, {"time": 11066, "text": "It is very true that they're likely to be something small, you know, under a million."}, {"time": 11072, "text": "But it'd be interesting if we can expand that number in interesting ways that will change the fabric of this conversation."}, {"time": 11077, "text": "I just want to kind of throw that in there."}, {"time": 11079, "text": "I don't know if the 150 is baked in somehow into the hardware."}, {"time": 11083, "text": "We can talk about some of the things that it probably has to do with."}, {"time": 11087, "text": "Up to a certain number of people."}, {"time": 11090, "text": "And this is going to be variable based on the social technologies that mediate it to some degree."}, {"time": 11094, "text": "We'll talk about that in a minute."}, {"time": 11099, "text": "Up to a certain number of people, everybody can know everybody else pretty intimately."}, {"time": 11104, "text": "So let's go ahead and just take 150 as an average number."}, {"time": 11112, "text": "Everybody can know everyone intimately enough that if your actions made anyone else do poorly, it's your extended family and you're stuck living with them and you know who they are and there's no anonymous people."}, {"time": 11124, "text": "There's no just them and over there."}, {"time": 11127, "text": "And that's one part of what leads to a kind of tribal process where it's good for the individual and good for the whole has a coupling."}, {"time": 11135, "text": "Also below that scale, everyone is somewhat aware of what everybody else is doing."}, {"time": 11141, "text": "There's not groups that are very siloed."}, {"time": 11144, "text": "And as a result, it's actually very hard to get away with bad behavior."}, {"time": 11147, "text": "There's a force kind of transparency."}, {"time": 11150, "text": "And so you don't need kind of like the state in that way."}, {"time": 11155, "text": "But lying to people doesn't actually get you ahead."}, {"time": 11158, "text": "Sociopathic behavior doesn't get you ahead because it gets seen."}, {"time": 11161, "text": "And so there's a conditioning environment where the individual is behaving in a way that is aligned with the interest of the tribe is what gets conditioned."}, {"time": 11171, "text": "When it gets to be a much larger system, it becomes easier to hide certain things from the group as a whole as well as to be less emotionally bound to a bunch of anonymous people."}, {"time": 11182, "text": "I would say there's also a communication protocol where up to about that number of people, we could all sit around a tribal council and be part of a conversation around a really big decision."}, {"time": 11194, "text": "Do we migrate?"}, {"time": 11195, "text": "Do we not migrate?"}, {"time": 11196, "text": "Do we, you know, something like that?"}, {"time": 11197, "text": "Do we get rid of this person?"}, {"time": 11199, "text": "And why would I want to agree to be a part of a larger group where everyone can't be part of that council?"}, {"time": 11209, "text": "And so I am going to now be subject to law that I have no say in if I could be part of a smaller group that could still survive and I get a say in the law that I'm subject to."}, {"time": 11218, "text": "So I think the cleaving and a way we can look at it beyond the Dunbar number two is we can look at that a civilization has binding energy that is holding them together and has cleaving energy."}, {"time": 11229, "text": "And if the binding energy exceeds the cleaving energy, that civilization will last."}, {"time": 11232, "text": "And so there are things that we can do to decrease the cleaving energy within the society, things we can do to increase the binding energy."}, {"time": 11238, "text": "I think naturally we saw that had certain characteristics up to a certain size kind of tribalism."}, {"time": 11244, "text": "That ended with a few things."}, {"time": 11245, "text": "It ended with people having migrated enough that when you started to get resource wars, you couldn't just migrate away easily."}, {"time": 11253, "text": "And so tribal warfare became more obligated."}, {"time": 11255, "text": "It involved the plow and the beginning of real economic surplus."}, {"time": 11259, "text": "So there were a few different kind of forcing functions."}, {"time": 11265, "text": "But we're talking about what size should it be, right?"}, {"time": 11268, "text": "What size should a society be?"}, {"time": 11270, "text": "And I think the idea, like if we think about your body for a moment as a self organizing complex system that is multi scaled, we think about... Our body is a wonderland."}, {"time": 11280, "text": "Our body is a wonderland, yeah."}, {"time": 11284, "text": "That's a John Mayer song."}, {"time": 11287, "text": "But yes, so if we think about our body and the billions of cells that are in it."}, {"time": 11292, "text": "Well, you don't have..."}, {"time": 11294, "text": "Think about how ridiculous it would be to try to have all the tens of trillions of cells in it with no internal organization structure, right?"}, {"time": 11301, "text": "Just like a sea of protoplasm."}, {"time": 11304, "text": "It wouldn't work."}, {"time": 11305, "text": "Pure democracy."}, {"time": 11306, "text": "And so you have cells and tissues, and then you have tissues and organs and organs and organ systems, and so you have these layers of organization, and then obviously the individual in a tribe in a ecosystem."}, {"time": 11319, "text": "And each of the higher layers are both based on the lower layers, but also influencing them."}, {"time": 11325, "text": "I think the future of civilization will be similar, which is there's a level of governance that happens at the level of the individual."}, {"time": 11331, "text": "My own governance of my own choice."}, {"time": 11334, "text": "I think there's a level that happens at the level of a family."}, {"time": 11337, "text": "We're making decisions together, we're inter influencing each other and affecting each other, taking responsibility for the idea of an extended family."}, {"time": 11345, "text": "And you can see that like for a lot of human history, we had an extended family, we had a local community, a local church or whatever it was, we had these intermediate structures."}, {"time": 11353, "text": "Whereas right now, there's kind of like the individual producer, consumer, taxpayer, voter, and the massive nation state global complex, and not that much in the way of intermediate structures that we relate with, and not that much in the way of real personal dynamics, all impersonalized, made fungible."}, {"time": 11371, "text": "And so, I think that we have to have global governance, meaning I think we have to have governance at the scale we affect stuff, and if anybody is messing up the oceans, that matters for everybody."}, {"time": 11384, "text": "So, that can't only be national or only local."}, {"time": 11388, "text": "Everyone is scared of the idea of global governance because we think about some top down system of imposition that now has no checks and balances on power."}, {"time": 11394, "text": "I'm scared of that same version, so I'm not talking about that kind of global governance."}, {"time": 11400, "text": "It's why I'm even using the word governance as a process rather than government as an imposed phenomena."}, {"time": 11407, "text": "And so, I think we have to have global governance, but I think we also have to have local governance, and there has to be relationships between them that each, where there are both checks and balances and power flows of information."}, {"time": 11418, "text": "So, I think governance at the level of cities will be a bigger deal in the future than governance at the level of nation states because I think nation states are largely fictitious things that are defined by wars and agreements to stop wars and like that."}, {"time": 11434, "text": "I think cities are based on real things that will keep being real where the proximity of certain things together, the physical proximity of things together gives increased value of those things."}, {"time": 11444, "text": "So, you look at like Jeffrey West's work on scale and finding that companies and nation states and things that have a kind of complicated agreement structure get diminishing return of, of production per capita as the total number of people increases beyond about the tribal scale."}, {"time": 11459, "text": "But the city actually gets increasing productivity per capita, but it's not designed, it's kind of this organic thing, right?"}, {"time": 11466, "text": "So, there should be governance at the level of cities because people can sense and actually have some agency there, probably neighborhoods and smaller scales within it and also verticals and some of it won't be geographic, it'll be network based, right?"}, {"time": 11477, "text": "Networks of affinities."}, {"time": 11478, "text": "So, I don't think the future is one type of governance."}, {"time": 11481, "text": "Now, what we can say more broadly is say, when we're talking about groups of people that inner affect each other, the idea of a civilization is that we can figure out how to coordinate our choice making to not be at war with each other and hopefully increase total productive capacity in a way that's good for everybody, division of labor and specialty so we all get more better stuff and whatever."}, {"time": 11504, "text": "But it's a, it's a coordination of our choice making."}, {"time": 11509, "text": "I think we can look at civilizations failing on the side of not having enough coordination of choice making, so they fail on the side of chaos and then they cleave and an internal war comes about or whatever, or they can't make smart decisions and they overuse their resources or whatever."}, {"time": 11527, "text": "Or it can fail on the side of trying to get order via imposition, via force, and so it fails on the side of oppression, which ends up being for a while functionalish for the thing as a whole, but miserable for most people in it until it fails either because of revolt or because it can't innovate enough or something like that."}, {"time": 11548, "text": "And so, there's this like toggling between order via oppression and chaos."}, {"time": 11584, "text": "And what would it take to have emergent order?"}, {"time": 11588, "text": "This is the most kind of central question for me these days because if we look at what different nation states are doing around the world and we see nation states that are more authoritarian that in some ways are actually coordinating much more effectively."}, {"time": 11606, "text": "So for instance, we can see that China has built high speed rail not just through its country but around the world and the US hasn't built any high speed rail yet."}, {"time": 11616, "text": "You can see that it brought 300 million people out of poverty in a time where we've had increasing economic inequality happening."}, {"time": 11623, "text": "You can see like that if there was a single country that could make all of its own stuff if the global supply chains failed, China would be the closest one to being able to start to go closed loop on fundamental things."}, {"time": 11637, "text": "Belt and Road Initiative, supply chain on rare earth metals, transistor manufacturing that is like, oh, they're actually coordinating more effectively in some important ways."}, {"time": 11648, "text": "In the last call it 30 years."}, {"time": 11652, "text": "And that's imposed order."}, {"time": 11654, "text": "Imposed order."}, {"time": 11656, "text": "And we can see that if in the US, let's look at why real quick."}, {"time": 11664, "text": "We know why we created term limits so that we wouldn't have forever monarchs."}, {"time": 11669, "text": "That's the thing we were trying to get away from and that there would be checks and balances on power and that kind of thing."}, {"time": 11674, "text": "But that also has created a negative second order effect, which is nobody does long term planning because somebody comes in who's got four years, they want reelected."}, {"time": 11683, "text": "They don't do anything that doesn't create a return within four years that will end up getting them elected, reelected."}, {"time": 11688, "text": "And so the 30 year industrial development to build high speed trains or the new kind of fusion energy or whatever it is just doesn't get invested in."}, {"time": 11697, "text": "And then if you have left versus right, where whatever someone does for four years, then the other guy gets in and undoes it for four years."}, {"time": 11705, "text": "And most of the energy goes into campaigning against each other."}, {"time": 11708, "text": "This system is just dissipating as heat, right?"}, {"time": 11711, "text": "Like it's just burning up as heat."}, {"time": 11712, "text": "And the system that has no term limits and no internal friction in fighting because they got rid of those people can actually coordinate better."}, {"time": 11720, "text": "But I would argue it has its own fail states eventually and dystopic properties that are not the thing we want."}, {"time": 11728, "text": "So the goal is to accomplish, to create a system that does long term planning without the negative effects of a monarch or dictator that stays there for the long term and accomplish that through not doing the imposition of a single leader, but through emergence."}, {"time": 11754, "text": "So that perhaps, first of all, the technology in itself seems to maybe disagree a lot for different possibilities here, which is make primary the system, not the humans."}, {"time": 11808, "text": "And it would all be owned by Google."}, {"time": 11814, "text": "Is there a way to, so first of all, you're optimistic that you could basically create the technology can save us technology at creating platforms by technology, I mean, like software network platforms that allows humans to deliberate, like make government together dynamically without the need for a leader that's on a podium screaming stuff."}, {"time": 11839, "text": "That's one and two."}, {"time": 11841, "text": "If you're optimistic about that, are you also optimistic about the CEOs of such platforms?"}, {"time": 11847, "text": "The idea that technology is values neutral, values agnostic, and people can use it for constructive or destructive purposes, but it doesn't predispose anything."}, {"time": 11860, "text": "It's just silly and naive."}, {"time": 11886, "text": "Marvin Harris's work called cultural materialism looked at this deeply, obviously Marshall McLuhan looked specifically at the way that information technologies change the nature of our beliefs, minds, values, social systems."}, {"time": 11899, "text": "I will not try to do this rigorously because there are academics will disagree on the subtle details but I'll do it kind of like illustratively."}, {"time": 11907, "text": "You think about the emergence of the plow, the ox drawn plow in the beginning of agriculture that came with it where before that you had hunter gatherer and then you had horticulture kind of a digging stick but not the plow."}, {"time": 11920, "text": "Well the world changed a lot with that, right?"}, {"time": 11994, "text": "Obviously we went from very, that particular line of thought then also says that feminism followed the tractor and that the rise of feminism in the West started to follow women being able to say we can do what men can because the male upper body strength wasn't differential once the internal combustion engine was much stronger and we can drive a tractor."}, {"time": 12020, "text": "So I don't think to try to trace complex things to one cause is a good idea, so I think this is a reductionist view but it has truth in it and so the idea that technology is values agnostic is silly."}, {"time": 12035, "text": "Technology codes patterns of behavior that code rationalizing those patterns of behavior and believing in them."}, {"time": 12040, "text": "The plow also is the beginning of the Anthropocene, right, it was the beginning of us changing the environment radically to clear cut areas to just make them useful for people which also meant the change of the view of where the web of life were just a part of it, etc."}, {"time": 12054, "text": "So all those types of things."}, {"time": 12057, "text": "That's brilliantly put, by the way, that was just brilliant."}, {"time": 12062, "text": "But the question is, so it's not agnostic, but..."}, {"time": 12065, "text": "So we have to look at what the psychological effects of specific tech applied certain ways are and be able to say it's not just doing the first order thing you intended, it's doing like the effect on patriarchy and animism and the end of tribal culture in the beginning of empire and the class systems that came with that."}, {"time": 12086, "text": "We can go on and on about what the plow did."}, {"time": 12088, "text": "The beginning of surplus was inheritance, which then became the capital model and like lots of things."}, {"time": 12094, "text": "So we have to say when we're looking at the tech, what are the values built into the way the tech is being built that are not obvious?"}, {"time": 12102, "text": "Right, so you always have to consider externalities."}, {"time": 12105, "text": "And the externalities are not just physical to the environment, they're also to how the people are being conditioned and how the relationality between them is being conditioned."}, {"time": 12111, "text": "So the question I'm asking you, so I personally would rather be led by a plow and a tractor than Stalin, okay?"}, {"time": 12118, "text": "That's the question I'm asking you."}, {"time": 12122, "text": "In creating an emergent government where people, where there's a democracy that's dynamic, that makes choices, that does governance at like a very kind of liquid, there's a bunch of fine resolution layers of abstraction of governance happening at all scales, right?"}, {"time": 12146, "text": "And doing so dynamically where no one person has power at any one time that can dominate and impose rule, okay?"}, {"time": 12154, "text": "That's the Stalin version."}, {"time": 12188, "text": "So yes, it's not agnostic, definitely not agnostic."}, {"time": 12192, "text": "You've had a brilliant rant there."}, {"time": 12194, "text": "The tractor has effects, but isn't that the way we achieve an emergent system of governance?"}, {"time": 12200, "text": "Yes, but I wouldn't say we're on track."}, {"time": 12206, "text": "You haven't seen anything promising."}, {"time": 12208, "text": "It's not that I haven't seen anything promising, it's that to be on track requires understanding and guiding some of the things differently than is currently happening and it's possible."}, {"time": 12216, "text": "That's actually what I really care about."}, {"time": 12218, "text": "So you couldn't have had a Stalin without having certain technologies emerge."}, {"time": 12226, "text": "He couldn't have ruled such a big area without transportation technologies, without the train, without the communication tech that made it possible."}, {"time": 12235, "text": "So when you say you'd rather have a tractor or a plow than a Stalin, there's a relationship between them that is more recursive, which is new physical technologies allow rulers to rule with more power over larger distances historically."}, {"time": 12254, "text": "And some things are more responsible for that than others."}, {"time": 12259, "text": "Like Stalin also ate stuff for breakfast, but the thing he ate for breakfast is less responsible for the starvation of millions than the train."}, {"time": 12268, "text": "The train is more responsible for that and then the weapons of war are more responsible."}, {"time": 12272, "text": "So some technology, let's not throw it all in the, you're saying like technology has a responsibility here, but some is better than others."}, {"time": 12282, "text": "I'm saying that people's use of technology will change their behavior."}, {"time": 12286, "text": "So it has behavioral dispositions built in."}, {"time": 12288, "text": "The change of the behavior will also change the values in the society."}, {"time": 12292, "text": "It's very complicated, right?"}, {"time": 12293, "text": "It will also, as a result, both make people who have different kinds of predispositions with regard to rulership and different kinds of new capacities."}, {"time": 12303, "text": "And so we have to think about these things."}, {"time": 12306, "text": "It's kind of well understood that the printing press and then in early industrialism ended feudalism and created kind of nation states."}, {"time": 12315, "text": "So one thing I would say as a long trend that we can look at is that whenever there is a step function, a major leap in technology, physical technology, the underlying techno industrial base with which we do stuff, it ends up coding for, it ends up predisposing a whole bunch of human behavioral patterns that the previous social system had not emerged to try to solve."}, {"time": 12340, "text": "And so it usually ends up breaking the previous social systems, the way the plow broke the tribal system, the way that the industrial revolution broke the feudal system, and then new social systems have to emerge so they can deal with the new powers, the new dispositions, whatever with that tech."}, {"time": 12355, "text": "Obviously, the nuke broke nation state governance being adequate and said, we can't ever have that again."}, {"time": 12361, "text": "So then it created this international governance apparatus world."}, {"time": 12366, "text": "So I guess what I'm saying is that the solution is not exponential tech following the current path of what the market incentivizes exponential tech to do, market being a previous social tech."}, {"time": 12388, "text": "I would say that exponential tech, if we look at different types of social tech, so let's just briefly look at that democracy tried to do the emergent order thing, right?"}, {"time": 12406, "text": "At least that's the story, and which is, and this is why if you look, this important part to build first."}, {"time": 12417, "text": "It's kind of doing it."}, {"time": 12418, "text": "It's just doing it poorly."}, {"time": 12419, "text": "You're saying, I mean, that's, it is emergent order in some sense."}, {"time": 12423, "text": "I mean, that's the hope of democracy versus other forms of government."}, {"time": 12427, "text": "I mean, I said at least the story because obviously it didn't do it for women and slaves early on."}, {"time": 12432, "text": "It doesn't do it for all classes equally, et cetera."}, {"time": 12434, "text": "But the idea of democracy is that, is participatory governance."}, {"time": 12466, "text": "That's actually wild."}, {"time": 12467, "text": "Like it's a wild idea that that would even be possible."}, {"time": 12470, "text": "And it was kind of the result of this high enlightenment idea that we could all do the philosophy of science and we could all do the Hegelian dialectic."}, {"time": 12483, "text": "Those ideas had emerged, right?"}, {"time": 12484, "text": "And it was that we could all, so our choice making, because we said a society is trying to coordinate choice making, the emergent order is the order of the choices that we're making, not just at the level of the individuals, but what groups of individuals, corporations, nations, states, whatever do."}, {"time": 12501, "text": "Our choices are based on, our choice making is based on our sense making and our meaning making."}, {"time": 12506, "text": "Our sense making is what do we believe is happening in the world, and what do we believe the effects of a particular thing would be."}, {"time": 12511, "text": "Our meaning making is what do we care about, right, our values generation, what do we care about that we're trying to move the world in the direction of."}, {"time": 12517, "text": "If you ultimately are trying to move the world in a direction that is really, really different than the direction I'm trying to, we have very different values, we're gonna have a hard time."}, {"time": 12526, "text": "And if you think the world is a very different world, right, if you think that systemic racism is rampant everywhere and one of the worst problems, and I think it's not even a thing, if you think climate change is almost existential, and I think it's not even a thing, we're gonna have a really hard time coordinating."}, {"time": 12542, "text": "And so, we have to be able to have shared sense making of can we come to understand just what is happening together, and then can we do shared values generation, okay?"}, {"time": 12552, "text": "Maybe I'm emphasizing a particular value more than you, but I can take your perspective and I can see how the thing that you value is worth valuing, and I can see how it's affected by this thing."}, {"time": 12562, "text": "So, can we take all the values and try to come up with a proposition that benefits all of them better than the proposition I created just to benefit these ones that harms the ones that you care about, which is why you're opposing my proposition?"}, {"time": 12574, "text": "We don't even try in the process of crafting a proposition currently to see, and this is the reason that the proposition we vote on, it gets half the votes almost all the time."}, {"time": 12583, "text": "It almost never gets 90% of the votes, is because it benefits some things and harms other things."}, {"time": 12588, "text": "We can say all theory of trade offs, but we didn't even try to say, could we see what everybody cares about and see if there is a better solution?"}, {"time": 12595, "text": "So... How do we fix that try?"}, {"time": 12597, "text": "I wonder, is it as simple as the social technology of education?"}, {"time": 12603, "text": "I mean, the proposition crafting and refinement process has to be key to a democracy or participatory governance, and it's not currently."}, {"time": 12611, "text": "But isn't that the humans creating that situation?"}, {"time": 12616, "text": "So one way, there's two ways to fix that."}, {"time": 12620, "text": "One is to fix the individual humans, which is the education early in life, and the second is to create somehow systems that... Yeah, it's both."}, {"time": 12628, "text": "So I understand the education part, but creating systems, that's why I mentioned the technologies is creating social networks, essentially."}, {"time": 12636, "text": "Yes, that's actually necessary."}, {"time": 12637, "text": "Okay, so let's go to the first part and then we'll come to the second part."}, {"time": 12642, "text": "So democracy emerged as an enlightenment era idea that we could all do a dialectic and come to understand what other people valued, and so that we could actually come up with a cooperative solution rather than just, fuck you, we're gonna get our thing in war, right?"}, {"time": 12660, "text": "And that we could sense make together."}, {"time": 12661, "text": "We could all apply the philosophy of science and you weren't gonna stick to your guns on what the speed of sound is if we measured it and we found out what it was, and there's a unifying element to the objectivity in that way."}, {"time": 12672, "text": "And so this is why I believe Jefferson said, if you could give me a perfect newspaper and a broken government, or in paraphrasing, a broken government and perfect newspaper, I wouldn't hesitate to take the perfect newspaper."}, {"time": 12682, "text": "Because if the people understand what's going on, they can build a new government."}, {"time": 12686, "text": "If they don't understand what's going on, they can't possibly make good choices."}, {"time": 12690, "text": "And Washington, I'm paraphrasing again, first president said the number one aim of the federal government should be the comprehensive education of every citizen and the science of government."}, {"time": 12701, "text": "Science of government was the term of art."}, {"time": 12702, "text": "Think about what that means, right?"}, {"time": 12704, "text": "Science of government would be game theory, coordination theory, history, wouldn't call game theory yet, history, sociology, economics, right?"}, {"time": 12713, "text": "All the things that lead to how we understand human coordination."}, {"time": 12717, "text": "I think it's so profound that he didn't say the number one aim of the federal government is rule of law."}, {"time": 12724, "text": "And he didn't say it's protecting the border from enemies."}, {"time": 12727, "text": "Because if the number one aim was to protect the border from enemies, it could do that as a military dictatorship quite effectively."}, {"time": 12734, "text": "And if the goal was rule of law, it could do it as a dictatorship, as a police state."}, {"time": 12741, "text": "And so if the number one goal is anything other than the comprehensive education of all the citizens and the science of government, it won't stay democracy long."}, {"time": 12748, "text": "You can see, so both education and the fourth estate, the fourth estate being the..."}, {"time": 12753, "text": "So education, can I make sense of the world?"}, {"time": 12754, "text": "Am I trained to make sense of the world?"}, {"time": 12756, "text": "The fourth estate is what's actually going on currently, the news."}, {"time": 12758, "text": "Do I have good, unbiased information about it?"}, {"time": 12761, "text": "Those are both considered prerequisite institutions for democracy to even be a possibility."}, {"time": 12766, "text": "And then at the scale it was initially suggested here, the town hall was the key phenomena where there wasn't a special interest group crafted a proposition, and the first thing I ever saw was the proposition, didn't know anything about it, and I got to vote yes or no."}, {"time": 12780, "text": "It was in the town hall, we all got to talk about it, and the proposition could get crafted in real time through the conversation, which is why there was that founding fathers statement that voting is the death of democracy."}, {"time": 12791, "text": "Voting fundamentally is polarizing the population in some kind of sublimated war."}, {"time": 12796, "text": "And we'll do that as the last step, but what we wanna do first is to say, how does the thing that you care about that seems damaged by this proposition, how could that turn into a solution to make this proposition better?"}, {"time": 12806, "text": "Where this proposition still tends to the thing it's trying to tend to and tends to that better."}, {"time": 12810, "text": "Can we work on this together?"}, {"time": 12811, "text": "And in a town hall, we could have that."}, {"time": 12813, "text": "As the scale increased, we lost the ability to do that."}, {"time": 12815, "text": "Now, as you mentioned, the internet could change that."}, {"time": 12818, "text": "The fact that we had representatives that had to ride a horse from one town hall to the other one to see what the colony would do, that we stopped having this kind of developmental propositional development process when the town hall ended."}, {"time": 12832, "text": "The fact that we have not used the internet to recreate this is somewhere between insane and aligned with class interests."}, {"time": 12843, "text": "I would push back to say that the internet has those things, it just has a lot of other things."}, {"time": 12849, "text": "I feel like the internet has places where that encourage synthesis of competing ideas and sense making, which is what we're talking about."}, {"time": 12859, "text": "It's just that it's also flooded with a bunch of other systems that perhaps are out competing it under current incentives, perhaps has to do with capitalism in the market."}, {"time": 12870, "text": "Linux is awesome, right?"}, {"time": 12872, "text": "And Wikipedia and places where you have, and they have problems, but places where you have open source sharing of information, vetting of information towards collective building."}, {"time": 12881, "text": "Is that building something like, how much has that affected our court systems or our policing systems or our military systems or our?"}, {"time": 12890, "text": "First of all, I think a lot, but not enough."}, {"time": 12893, "text": "I think this is something I told you offline yesterday as a, perhaps as a whole nother discussion, but I don't think we're quite quantifying the impact on the world, the positive impact of Wikipedia."}, {"time": 12908, "text": "You said the policing, I mean, I just, I just think the amount of empathy that like knowledge I think can't help, but lead to empathy, just knowing, okay."}, {"time": 12925, "text": "Just knowing."}, {"time": 12927, "text": "I'll give you some pieces of information, knowing how many people died in various wars that already that Delta, when you have millions of people have that knowledge, it's like, it's a little like slap in the face, like, Oh, like my boyfriend or girlfriend breaking up with me is not such a big deal when millions of people were tortured, you know, like just a little bit."}, {"time": 12948, "text": "And when a lot of people know that because of Wikipedia, uh, or the effect, their second order effects of Wikipedia, which is it's not that necessarily people read Wikipedia."}, {"time": 12958, "text": "It's like YouTubers who don't really know stuff that well will thoroughly read a Wikipedia article and create a compelling video describing that Wikipedia article that then millions of people watch and they understand that."}, {"time": 12974, "text": "Holy shit."}, {"time": 12975, "text": "A lot of, there was such, first of all, there was such a thing as world war II and world war I."}, {"time": 12980, "text": "Like they can at least like learn about it."}, {"time": 12982, "text": "They can learn about this was like recent."}, {"time": 12985, "text": "They can learn about slavery."}, {"time": 12986, "text": "They can learn about all kinds of injustices in the world."}, {"time": 12990, "text": "And that I think has a lot of effects to our, to the way, whether you're a police officer, a lawyer, a judge in the jury, or just the regular civilian citizen, the way you approach the every other communication you engage in, even if the system of that communication is very much flawed."}, {"time": 13013, "text": "So I think there's a huge positive effect on Wikipedia."}, {"time": 13016, "text": "That's my case for Wikipedia."}, {"time": 13017, "text": "So you should donate to Wikipedia."}, {"time": 13018, "text": "I mean, I'm a huge fan, but there's very few systems like it, which is sad to me."}, {"time": 13062, "text": "And then, and do that fully without mitigating it, then take the techno optimist perspective and see what things are getting better in a way that Kurzweil or Diamandis or someone might do and try to take that perspective fully and say, are some of those things exponential?"}, {"time": 13079, "text": "What could that portend?"}, {"time": 13080, "text": "And then try to hold all that at the same time."}, {"time": 13083, "text": "And I think there are ways in which, depending upon the metrics we're looking at, things are getting worse on exponential curves and better on exponential curves for different metrics at the same time, which I hold as the destabilization of previous system and either an emergence to a better system or collapse to a lower order are both possible."}, {"time": 13107, "text": "And so I want my optimism not to be about my assessment."}, {"time": 13112, "text": "I want my assessment to be just as fucking clear as it can be."}, {"time": 13115, "text": "I want my optimism to be what inspires the solution process on that clear assessment."}, {"time": 13121, "text": "So I never want to apply optimism in the sense making."}, {"time": 13125, "text": "I want to just try to be clear."}, {"time": 13127, "text": "If anything, I want to make sure that the challenges are really well understood."}, {"time": 13132, "text": "But that's in service of an optimism that there are good potentials, even if I don't know what they are, that are worth seeking."}, {"time": 13142, "text": "There is some sense of optimism that's required to even try to innovate really hard problems."}, {"time": 13147, "text": "But then I want to take my pessimism and red team my own optimism to see, is that solution not going to work?"}, {"time": 13153, "text": "Does it have second order effects?"}, {"time": 13154, "text": "And then not get upset by that because I then come back to how to make it better."}, {"time": 13159, "text": "So just a relationship between optimism and pessimism and the dialectic of how they can work."}, {"time": 13165, "text": "So when I, of course, we can say that Wikipedia is a pretty awesome example of a thing."}, {"time": 13172, "text": "We can look at the places where it has limits or has failed, where on a celebrity topic or corporate interest topic, you can pay Wikipedia editors to edit more frequently and various things like that."}, {"time": 13186, "text": "But you can also see where there's a lot of information that was kind of decentrally created that is good information that is more easily accessible to people than everybody buying their own encyclopedia Britannica or walking down to the library and that can be updated in real time faster."}, {"time": 13201, "text": "And I think you're very right that the business model is a big difference because Wikipedia is not a for profit corporation."}, {"time": 13219, "text": "And I think the two masters issue is a tricky one when I'm trying to optimize for very different kinds of things where I have to sacrifice one for the other and I can't find synergistic satisfiers."}, {"time": 13234, "text": "And if I have a fiduciary responsibility to shareholder profit maximization and, you know, what does that end up creating?"}, {"time": 13243, "text": "I think the ad model that Silicon Valley took, I think Jaron Laney or I don't know if you've had him on the show, but he has an interesting assessment of the nature of the ad model."}, {"time": 13256, "text": "Silicon Valley wanting to support capitalism and entrepreneurs to make things but also the belief that information should be free and also the network dynamics where the more people you got on, you got increased value per user, per capita as more people got on so you didn't want to do anything to slow the rate of adoption."}, {"time": 13275, "text": "Some places actually, you know, PayPal paying people money to join the network because the value of the network would be, there'd be a Metcalf like dynamic proportional to the square of the total number of users."}, {"time": 13304, "text": "If they have a fiduciary responsibility to their shareholder to maximize profit, their customer is the advertiser, the user who it's being built for is to do behavioral mod for them for advertisers, that's a whole different thing than that same type of tech could have been if applied with a different business model or different purpose."}, {"time": 13355, "text": "There should be a fiduciary responsibility."}, {"time": 13358, "text": "And in normal fiduciary law, if there's this principal agent thing, if you are a principal and I'm an agent on your behalf, I don't have a game theoretic relationship with you."}, {"time": 13369, "text": "If you're sharing something with me and I'm the priest or I'm the therapist, I'm never going to use that information to try to sell you a used car or whatever the thing is."}, {"time": 13378, "text": "But Facebook is gathering massive amounts of privileged information and using it to modify people's behavior for a behavior that they didn't sign up for wanting the behavior but what the corporation did."}, {"time": 13388, "text": "So I think this is an example of the physical tech evolving in the context of the previous social tech where it's being shaped in particular ways."}, {"time": 13398, "text": "And here, unlike Wikipedia that evolved for the information commons, this evolved for fulfilling particular agentic purpose."}, {"time": 13406, "text": "Most people when they're on Facebook think it's just a tool that they're using."}, {"time": 13409, "text": "They don't realize it's an agent, right?"}, {"time": 13411, "text": "It is a corporation with a profit motive and as I'm interacting with it, it has a goal for me different than my goal for myself."}, {"time": 13420, "text": "And I might want to be on for a short period of time."}, {"time": 13421, "text": "Its goal is maximize time on site."}, {"time": 13423, "text": "And so there is a rivalry where there should be a fiduciary contract."}, {"time": 13429, "text": "I think that's actually a huge deal."}, {"time": 13432, "text": "And I think if we said, could we apply Facebook like technology to develop people's citizenry capacity, right?"}, {"time": 13446, "text": "To develop their personal health and wellbeing and habits as well as their cognitive understanding, the complexity with which they can process the health of their relationships, that would be amazing to start to explore."}, {"time": 13462, "text": "And this is now the thesis that we started to discuss before is every time there is a major step function in the physical tech, it obsoletes the previous social tech and the new social tech has to emerge."}, {"time": 13476, "text": "What I would say is that when we look at the nation state level of the world today, the more top down authoritarian nation states are as the exponential tech started to emerge, the digital technology started to emerge, they were in a position for better long term planning and better coordination."}, {"time": 13495, "text": "And so the authoritarian states started applying the exponential tech intentionally to make more effective authoritarian states."}, {"time": 13501, "text": "And that's everything from like an internet of things surveillance system going into machine learning systems to the Sesame credit system to all those types of things."}, {"time": 13511, "text": "And so they're upgrading their social tech using the exponential tech."}, {"time": 13516, "text": "Otherwise within a nation state like the US, but democratic open societies, the countries, the states are not directing the technology in a way that makes a better open society, meaning better emergent order."}, {"time": 13530, "text": "They're saying, well, the corporations are doing that and the state is doing the relatively little thing it would do aligned with the previous corporate law that no longer is relevant because there wasn't fiduciary responsibility for things like that."}, {"time": 13540, "text": "There wasn't antitrust because this creates functional monopolies because of network dynamics, right?"}, {"time": 13546, "text": "Where YouTube has more users than Vimeo and every other video player together."}, {"time": 13550, "text": "Amazon has a bigger percentage of market share than all of the other markets together."}, {"time": 13554, "text": "You get one big dog per vertical because of network effect, which is a kind of organic monopoly that the previous antitrust law didn't even have a place, that wasn't a thing."}, {"time": 13565, "text": "Antimonopoly was only something that emerged in the space of government contracts."}, {"time": 13571, "text": "So what we see is that the new exponential technology is being directed by authoritarian nation states to make better authoritarian nation states and by corporations to make more powerful corporations."}, {"time": 13581, "text": "Powerful corporations, when we think about the Scottish enlightenment, when the idea of markets was being advanced, the modern kind of ideas of markets, the biggest corporation was tiny compared to what the biggest corporation today is."}, {"time": 13595, "text": "So the asymmetry of it relative to people was tiny."}, {"time": 13599, "text": "And the asymmetry now in terms of the total technology it employs, total amount of money, total amount of information processing is so many orders of magnitude."}, {"time": 13608, "text": "And rather than there be demand for an authentic thing that creates a basis for supply, as supply started to get way more coordinated and powerful and the demand wasn't coordinated because you don't have a labor union of all the customers working together, but you do have a coordination on the supply side."}, {"time": 13625, "text": "Supply started to recognize that it could manufacture demand."}, {"time": 13628, "text": "It could make people want shit that they didn't want before that maybe wouldn't increase their happiness in a meaningful way, might increase addiction."}, {"time": 13634, "text": "Addiction is a very good way to manufacture demand."}, {"time": 13637, "text": "And so as soon as manufactured demand started through this is the cool thing and you have to have it for status or whatever it is, the intelligence of the market was breaking."}, {"time": 13648, "text": "Now it's no longer a collective intelligence system that is up regulating real desire for things that are really meaningful."}, {"time": 13654, "text": "We were able to hijack the lower angels of our nature rather than the higher ones."}, {"time": 13658, "text": "The addictive patterns drive those and have people want shit that doesn't actually make them happy or make the world better."}, {"time": 13664, "text": "And so we really also have to update our theory of markets because behavioral econ showed that homo economicus, the rational actor is not really a thing, but particularly at greater and greater scale can't really be a thing."}, {"time": 13678, "text": "Voluntaryism isn't a thing where if my company doesn't want to advertise on Facebook, I just will lose to the companies that do because that's where all the fucking attention is."}, {"time": 13686, "text": "And so then I can say it's voluntary, but it's not really if there's a functional monopoly."}, {"time": 13692, "text": "Same if I'm going to sell on Amazon or things like that."}, {"time": 13694, "text": "So what I would say is these corporations are becoming more powerful than nation states in some ways."}, {"time": 13704, "text": "And they are also debasing the integrity of the nation states, the open societies."}, {"time": 13714, "text": "So the democracies are getting weaker as a result of exponential tech and the kind of new tech companies that are kind of a new feudalism, tech feudalism, because it's not a democracy inside of a tech company or the supply and demand relationship when you have manufactured demand and kind of monopoly type functions."}, {"time": 13733, "text": "And so we have basically a new feudalism controlling exponential tech and authoritarian nation states controlling it."}, {"time": 13738, "text": "And those attractors are both shitty."}, {"time": 13741, "text": "And so I'm interested in the application of exponential tech to making better social tech that makes emergent order possible and where then that emergent order can bind and direct the exponential tech in fundamentally healthy, not X risk oriented directions."}, {"time": 13759, "text": "I think the relationship of social tech and physical tech can make it."}, {"time": 13762, "text": "I think we can actually use the physical tech to make better social tech, but it's not given that we do."}, {"time": 13767, "text": "If we don't make better social tech, then I think the physical tech empowers really shitty social tech that is not a world that we want."}, {"time": 13775, "text": "I don't know if it's a road we want to go down, but I tend to believe that the market will create exactly the thing you're talking about, which I feel like there's a lot of money to be made in creating a social tech that creates a better citizen, that creates a better human being."}, {"time": 13800, "text": "Your description of Facebook and so on, which is a system that creates addiction, which manufactures demand, is not obviously inherently the consequence of the markets."}, {"time": 13814, "text": "I feel like that's the first stage of us, like baby deer trying to figure out how to use the internet."}, {"time": 13820, "text": "I feel like there's much more money to be made with something that creates compersion and love."}, {"time": 13829, "text": "Honestly."}, {"time": 13830, "text": "I mean, I really, we can have this, I can make the business case for it."}, {"time": 13835, "text": "I don't know if, I don't think we want to really have that discussion, but do you have some hope that that's the case?"}, {"time": 13841, "text": "I guess if not, then how do we fix the system of markets that worked so well for the United States for so long?"}, {"time": 13849, "text": "Like I said, every social tech worked for a while."}, {"time": 13851, "text": "Like tribalism worked well for two or 300,000 years."}, {"time": 13855, "text": "I think social tech has to keep evolving."}, {"time": 13858, "text": "The social technologies with which we organize and coordinate our behavior have to keep evolving as our physical tech does."}, {"time": 13865, "text": "So I think the thing that we call markets, of course we can try to say, oh, even biology runs on markets."}, {"time": 13875, "text": "But the thing that we call markets, the underlying theory, homo economicus, demand, driving supply, that thing broke."}, {"time": 13883, "text": "It broke with scale in particular and a few other things."}, {"time": 13888, "text": "So it needs updated in a really fundamental way."}, {"time": 13892, "text": "I think there's something even deeper than making money happening that in some ways will obsolete money making."}, {"time": 13901, "text": "I think capitalism is not about business."}, {"time": 13906, "text": "So if you think about business, I'm going to produce a good or a service that people want and bring it to the market so that people get access to that good or service."}, {"time": 13915, "text": "That's the world of business, but that's not capitalism."}, {"time": 13918, "text": "Capitalism is the management and allocation of capital, which financial services was a tiny percentage of the total market has become a huge percentage of the total market."}, {"time": 13929, "text": "It's a different creature."}, {"time": 13930, "text": "So if I was in business and I was producing a good or service and I was saving up enough money that I started to be able to invest that money and gain interest or do things like that, I start realizing I'm making more money on my money than I'm making on producing the goods and services."}, {"time": 13946, "text": "So I stop even paying attention to goods and services and start paying attention to making money on money and how do I utilize capital to create more capital."}, {"time": 13954, "text": "And capital gives me more optionality because I can buy anything with it than a particular good or service that only some people want."}, {"time": 13969, "text": "I could put more people under my employment."}, {"time": 13971, "text": "I could buy larger pieces of land, novel access to resource, mines, and put more technology under my employment."}, {"time": 13978, "text": "So it meant increased agency and also increased control."}, {"time": 13982, "text": "I think attentionalism is even more powerful."}, {"time": 13987, "text": "So rather than enslave people where the people kind of always want to get away and put in the least work they can, there's a way in which economic servitude was just more profitable than slavery, right?"}, {"time": 14001, "text": "Have the people work even harder voluntarily because they want to get ahead and nobody has to be there to whip them or control them or whatever."}, {"time": 14010, "text": "This is a cynical take but a meaningful take."}, {"time": 14023, "text": "And yet where people still feel free in some meaningful way."}, {"time": 14028, "text": "They're not feeling like they're going to be punished by the state if they don't do something."}, {"time": 14034, "text": "It's like punished by the market via homelessness or something."}, {"time": 14036, "text": "But the market is this invisible thing I can't put an agent on so it feels like free."}, {"time": 14041, "text": "And so if you want to affect people's behavior and still have them feel free, capital ends up being a way to do that."}, {"time": 14052, "text": "But I think affecting their attention is even deeper because if I can affect their attention, I can both affect what they want and what they believe and what they feel."}, {"time": 14062, "text": "And we statistically know this very clearly."}, {"time": 14064, "text": "Facebook has done studies that based on changing the feed, it can change beliefs, emotional dispositions, et cetera."}, {"time": 14071, "text": "And so I think there's a way that the harvest and directing of attention is even a more powerful system than capitalism."}, {"time": 14079, "text": "It is effective in capitalism to generate capital, but I think it also generates influence beyond what capital can do."}, {"time": 14086, "text": "And so do we want to have some groups utilizing that type of tech to direct other people's attention?"}, {"time": 14097, "text": "If so, towards what?"}, {"time": 14103, "text": "Towards what metrics of what a good civilization and good human life would be?"}, {"time": 14107, "text": "What's the oversight process?"}, {"time": 14108, "text": "What is the... Transparency."}, {"time": 14110, "text": "I can answer all the things you're mentioning."}, {"time": 14114, "text": "I can build, I guarantee you if I'm not such a lazy ass, I'll be part of the many people doing this as transparency and control, giving control to individual people."}, {"time": 14127, "text": "So maybe the corporation has coordination on its goals that all of its customers or users together don't have."}, {"time": 14137, "text": "So there's some asymmetry of its goals, but maybe I could actually help all of the customers to coordinate almost like a labor union or whatever by informing and educating them adequately about the effects, the externalities on them."}, {"time": 14154, "text": "This is not toxic waste going into the ocean of the atmosphere."}, {"time": 14158, "text": "It's their minds, their beings, their families, their relationships, such that they will in group change their behavior."}, {"time": 14170, "text": "One way of saying what you're saying, I think, is that you think that you can rescue homo economicus from the rational actor that will pursue all the goods and services and choose the best one at the best price, the kind of Rand von Mises Hayek, that you can rescue that from Dan Ariely and behavioral econ that says that's actually not how people make choices."}, {"time": 14191, "text": "They make it based on status hacking, largely whether it's good for them or not in the long term."}, {"time": 14196, "text": "And the large asymmetric corporation can run propaganda and narrative warfare that hits people's status buttons and their limbic hijacks and their lots of other things in ways that they can't even perceive that are happening."}, {"time": 14210, "text": "They're not paying attention to that."}, {"time": 14211, "text": "The site is employing psychologists and split testing and whatever else."}, {"time": 14215, "text": "So you're saying, I think we can recover homo economicus."}, {"time": 14220, "text": "And not just through a single mechanism of technology."}, {"time": 14223, "text": "There's the, not to keep mentioning the guy, but platforms like Joe Rogan and so on, that make help make viral the ways that the education of negative externalities can become viral in this world."}, {"time": 14241, "text": "So interestingly, I actually agree with you that I got them that we four and a half hours in that we can take can do some good."}, {"time": 14254, "text": "Well, see, what you're talking about is the application of tech here, broadcast tech where you can speak to a lot of people."}, {"time": 14260, "text": "And that's not going to be strong enough because the different people need spoken to differently, which means it has to be different voices that get amplified to those audiences more like Facebook's tech."}, {"time": 14268, "text": "But nonetheless, we'll start with broadcast tech plants the first seed and then the word of mouth is a powerful thing."}, {"time": 14273, "text": "You need to do the first broadcast shotgun and then it like lands a catapult or whatever."}, {"time": 14279, "text": "I don't know what the right weapon is, but then it just spreads the word of mouth through all kinds of tech, including Facebook."}, {"time": 14286, "text": "So let's come back to the fundamental thing."}, {"time": 14288, "text": "The fundamental thing is we want to kind of order at various scales from the conflicting parts of ourself, actually having more harmony than they might have to a family, extended family, local, all the way up to global."}, {"time": 14305, "text": "We want emergent order where our choices have more alignment, right?"}, {"time": 14313, "text": "We want that to be emergent rather than imposed or rather than we want fundamentally different things or make totally different sense of the world where warfare of some kind becomes the only solution."}, {"time": 14325, "text": "Emergent order requires us in our choice making, requires us being able to have related sense making and related meaning making processes."}, {"time": 14335, "text": "Can we apply digital technologies and exponential tech in general to try to increase the capacity to do that where the technology called a town hall, the social tech that we'd all get together and talk obviously is very scale limited and it's also oriented to geography rather than networks of aligned interest."}, {"time": 14353, "text": "Can we build new better versions of those types of things?"}, {"time": 14356, "text": "And going back to the idea that a democracy or participatory governance depends upon comprehensive education and the science of government, which include being able to understand things like asymmetric information warfare on the side of governments and how the people can organize adequately."}, {"time": 14373, "text": "Can you utilize some of the technologies now to be able to support increased comprehensive education of the people and maybe comprehensive informativeness, so both fixing the decay in both education and the fourth estate that have happened so that people can start self organizing to then influence the corporations, the nation states to do different things and or build new ones themselves?"}, {"time": 14397, "text": "Yeah, fundamentally that's the thing that has to happen."}, {"time": 14400, "text": "The exponential tech gives us a novel problem landscape that the world never had."}, {"time": 14405, "text": "The nuke gave us a novel problem landscape and so that required this whole Bretton Woods world."}, {"time": 14410, "text": "The exponential tech gives us a novel problem landscape, our existing problem solving processes aren't doing a good job."}, {"time": 14416, "text": "We have had more countries get nukes, we have a nuclear de proliferation, we haven't achieved any of the UN sustainable development goals, we haven't kept any of the new categories of tech from making arms races, so our global coordination is not adequate to the problem landscape."}, {"time": 14432, "text": "So we need fundamentally better problem solving processes, a market or a state is a problem solving process."}, {"time": 14437, "text": "We need better ones that can do the speed and scale of the current issues."}, {"time": 14441, "text": "Right now speed is one of the other big things is that by the time we regulated DDT out of existence or cigarettes not for people under 18, they had already killed so many people and we let the market do the thing."}, {"time": 14477, "text": "It can't come after the effects have happened, the negative effects have happened because the negative effects could be too big too quickly."}, {"time": 14485, "text": "So we basically need new problem solving processes that do better at being able to internalize this externality, solve the problems on the right time scale and the right geographic scale."}, {"time": 14533, "text": "What are adequate social institutions where we can do participatory governance at scale and time?"}, {"time": 14539, "text": "And how can the people actually participate to build those things?"}, {"time": 14544, "text": "The solution that I see working requires a process like that."}, {"time": 14549, "text": "And the result maximizes love."}, {"time": 14552, "text": "So again, Elon would be right that love is the answer."}, {"time": 14556, "text": "Let me take you back from the scale of societies to the scale that's far, far more important, which is the scale of family."}, {"time": 14567, "text": "You've written a blog post about your dad."}, {"time": 14570, "text": "We have various flavors of relationships with our fathers."}, {"time": 14576, "text": "What have you learned about life from your dad?"}, {"time": 14581, "text": "Well, people can read the blog post and see a lot of individual things that I learned that I really appreciated."}, {"time": 14587, "text": "If I was to kind of summarize at a high level, I had a really incredible dad, very, very unusually positive set of experiences."}, {"time": 14603, "text": "We were homeschooled, and he was committed to work from home to be available and prioritize fathering in a really deep way."}, {"time": 14615, "text": "And as a super gifted, super loving, very unique man, he also had his unique issues that were part of what crafted the unique brilliance, and those things often go together."}, {"time": 14626, "text": "And I say that because I think I had some unusual gifts and also some unusual difficulties."}, {"time": 14632, "text": "And I think it's useful for everybody to know their path probably has both of those."}, {"time": 14639, "text": "But if I was to say kind of the essence of one of the things my dad taught me across a lot of lessons was like the intersection of self empowerment, ideas and practices that self empower, towards collective good, towards some virtuous purpose beyond the self."}, {"time": 14661, "text": "And he both said that a million different ways, taught it in a million different ways."}, {"time": 14665, "text": "When we were doing construction and he was teaching me how to build a house, we were putting the wires to the walls before the drywall went on, he made sure that the way that we put the wires through was beautiful."}, {"time": 14677, "text": "Like that the height of the holes was similar, that we twisted the wires in a particular way."}, {"time": 14685, "text": "And it's like no one's ever going to see it."}, {"time": 14687, "text": "And he's like, if a job's worth doing, it's worth doing well, and excellence is its own reward."}, {"time": 14691, "text": "And those types of ideas."}, {"time": 14692, "text": "And if there was a really shitty job to do, he'd say, see the job, do the job, stay out of the misery."}, {"time": 14696, "text": "Just don't indulge any negativity, do the things that need done."}, {"time": 14699, "text": "And so there's like, there's an empowerment and a nobility together."}, {"time": 14706, "text": "And yeah, extraordinarily fortunate."}, {"time": 14710, "text": "Is there ways you think you could have been a better son?"}, {"time": 14713, "text": "Is there things you regret?"}, {"time": 14718, "text": "Let me first say, just as a bit of a criticism, that what kind of man do you think you are not wearing a suit and tie, if a real man should?"}, {"time": 14734, "text": "Exactly I agree with your dad on that point."}, {"time": 14736, "text": "You mentioned offline that he suggested a real man should wear a suit and tie."}, {"time": 14744, "text": "But outside of that, is there ways you could have been a better son?"}, {"time": 14748, "text": "Maybe next time on your show, I'll wear a suit and tie."}, {"time": 14752, "text": "My dad would be happy about that."}, {"time": 14772, "text": "I can answer the question later in life, not early."}, {"time": 14777, "text": "I had just a huge amount of respect and reverence for my dad when I was young."}, {"time": 14780, "text": "So I was asking myself that question a lot."}, {"time": 14783, "text": "So there weren't a lot of things I knew that I wasn't seeking to apply."}, {"time": 14792, "text": "There was a phase when I went through my kind of individuation, differentiation, where I had to make him excessively wrong about too many things."}, {"time": 14803, "text": "I don't think I had to, but I did."}, {"time": 14806, "text": "And he had a lot of kind of nonstandard model beliefs about things, whether early kind of ancient civilizations or ideas on evolutionary theory or alternate models of physics."}, {"time": 14823, "text": "And they weren't irrational, but they didn't all have the standard of epistemic proof that I would need."}, {"time": 14832, "text": "And I went through, and some of them were kind of spiritual ideas as well, I went through a phase in my early 20s where I kind of had the attitude that Dawkins or a Christopher Hitchens has that can kind of be like excessively certain and sanctimonious, applying their reductionist philosophy of science to everything and kind of brutally dismissive."}, {"time": 14867, "text": "I'm embarrassed by that phase."}, {"time": 14872, "text": "Not to say anything about those men and their path, but for myself."}, {"time": 14877, "text": "And so during that time, I was more dismissive of my dad's epistemology than I would have liked to have been."}, {"time": 14886, "text": "I got to correct that later and apologize for it."}, {"time": 14889, "text": "But that's the first thought that came to mind."}, {"time": 14892, "text": "You've written the following."}, {"time": 14894, "text": "I've had the experience countless times, making love, watching a sunset, listening to music, feeling the breeze, that I would sign up for this whole life and all of its pains just to experience this exact moment."}, {"time": 14913, "text": "This is a kind of wordless knowing."}, {"time": 14917, "text": "It's the most important and real truth I know, that experience itself is infinitely meaningful and pain is temporary."}, {"time": 14926, "text": "And seen clearly, even the suffering is filled with beauty."}, {"time": 14930, "text": "I've experienced countless lives worth of moments worthy of life, such an unreasonable fortune."}, {"time": 14938, "text": "A few words of gratitude from you, beautifully written."}]}]