[{"title": "Manolis Kellis: Human Genome and Evolutionary Dynamics | Lex Fridman Podcast #113", "id": "brslF-Cy3HU", "quotes": [{"time": 272, "text": "And that's absolutely beautiful about life."}, {"time": 274, "text": "The fact that at every replication step, you don't lose any information because that information is digital."}, {"time": 280, "text": "If it was analog, if it was just sprouting concentrations, you'd lose it after a few generations."}, {"time": 284, "text": "It would just dissolve away."}, {"time": 286, "text": "And that's what the ancients didn't understand about inheritance."}, {"time": 290, "text": "The first person to understand digital inheritance was Mendel, of course."}, {"time": 294, "text": "And his theory, in fact, stayed in a bookshelf for like 50 years while Darwin was getting famous about natural selection."}, {"time": 302, "text": "But the missing component was this digital inheritance, the mechanism of evolution that Mendel had discovered."}, {"time": 309, "text": "So that aspect in my view is the most beautiful aspect but it transcends all of life."}, {"time": 314, "text": "And can you elaborate maybe the inheritance part?"}, {"time": 318, "text": "What was the key thing that the ancients didn't understand?"}, {"time": 352, "text": "And all of these continuums did not fit with a discrete type of inheritance that Mendel was describing."}, {"time": 358, "text": "But what's unique about genomics and what's unique about the genome is really that there are two copies and that you get a combination of these."}, {"time": 366, "text": "But for every trait, there are dozens of contributing variables."}, {"time": 370, "text": "And it was only Ronald Fisher in the 20th century that basically recognized that even five Mendelian traits would add up to a continuum like inheritance pattern."}, {"time": 384, "text": "And he wrote a series of papers that still are very relevant today about sort of this Mendelian inheritance of continuum like traits."}, {"time": 395, "text": "And I think that that was the missing step in inheritance."}, {"time": 398, "text": "So well before the discovery of the structure of DNA, which is again, another amazingly beautiful aspect, the double helix, what I like to call the most noble molecule of our time, holds within it the secret of that discrete inheritance, but the conceptualization of discrete elements is something that precedes that."}, {"time": 419, "text": "So even though it's discrete, when it materializes itself into actual traits that we see, it can be continuous."}, {"time": 428, "text": "Basically arbitrarily rich and complex."}, {"time": 430, "text": "So if you have five genes that contribute to human height, and there aren't five, there's a thousand."}, {"time": 436, "text": "If there's only five genes and you inherit some combination of them, and every one makes you two inches taller or two inches shorter, it'll look like a continuous trait."}, {"time": 448, "text": "But instead of five, there are thousands."}, {"time": 450, "text": "And every one of them contributes to less than one millimeter."}, {"time": 453, "text": "We change in height more during the day than each of these genetic variants contributes."}, {"time": 460, "text": "So by the evening, you're shorter than you walk up with."}, {"time": 463, "text": "Isn't that weird then that we're not more different than we are?"}, {"time": 468, "text": "Why are we all so similar if there's so much possibility to be different?"}, {"time": 472, "text": "Yeah, so there are selective advantages to being medium."}, {"time": 477, "text": "If you're extremely tall or extremely short, you run into selective disadvantages."}, {"time": 482, "text": "So you have trouble breathing, you have trouble running, you have trouble sitting if you're too tall."}, {"time": 486, "text": "If you're too short, you might, I don't know, have other selective pressures are acting against that."}, {"time": 491, "text": "If you look at natural history of human population, there's actually selection for height in Northern Europe and selection against height in Southern Europe."}, {"time": 499, "text": "So there might actually be advantages to actually being not super tall."}, {"time": 505, "text": "And if you look across the entire human population, for many, many traits, there's a lot of push towards the middle."}, {"time": 512, "text": "Balancing selection is the usual term for selection that sort of seeks to not be extreme and to sort of have a combination of alleles that sort of keep recombining."}, {"time": 525, "text": "And if you look at mate selection, super, super tall people will not tend to sort of marry super, super tall people."}, {"time": 533, "text": "Very often you see these couples that are kind of compensating for each other."}, {"time": 537, "text": "And the best predictor of the kid's age is very often just take the average of the two parents and then adjust for sex and boom, you get it."}, {"time": 547, "text": "It's extremely heritable."}, {"time": 548, "text": "Let me ask, you kind of took a step back to the genome outside of just humans, but is there something that you find beautiful about the human genome specifically?"}, {"time": 558, "text": "So I think the genome, if more people understood the beauty of the human genome, there would be so many fewer wars, so much less anger in the world."}, {"time": 568, "text": "I mean, what's really beautiful about the human genome is really the variation that teaches us both about individuality and about similarity."}, {"time": 578, "text": "So any two people on the planet are 99.9% identical."}, {"time": 583, "text": "How can you fight with someone who's 99.9% identical to you?"}, {"time": 587, "text": "It's just counterintuitive."}, {"time": 589, "text": "And yet any two siblings of the same parents differ in millions of locations."}, {"time": 597, "text": "So every one of them is basically two to the million unique from any pair of parents, let alone any two random parents on the planet."}, {"time": 605, "text": "So that's, I think, something that teaches us about sort of the nature of humanity in many ways, that every one of us is as unique as any star and way more unique in actually many ways."}, {"time": 617, "text": "And yet we're all brothers and sisters."}, {"time": 622, "text": "Yeah, just like stars, most of it is just fusion reactions."}, {"time": 626, "text": "Yeah, you only have a few parameters to describe stars."}, {"time": 629, "text": "Mass, size, initial size, and stage of life."}, {"time": 633, "text": "Whereas for humans, it's thousands of parameters scattered across our genome."}, {"time": 638, "text": "So the other thing that makes humans unique, the other things that makes inheritance unique in humans is that most species inherit things vertically."}, {"time": 650, "text": "Basically instinct is a huge part of their behavior."}, {"time": 654, "text": "The way that, I mean, with my kids, we've been watching this nest of birds with two little eggs outside our window for the last few months, for the last few weeks as they've been growing."}, {"time": 667, "text": "And there's so much behavior that's hard coded."}, {"time": 672, "text": "Birds don't just learn as they grow."}, {"time": 676, "text": "There's no culture."}, {"time": 677, "text": "Like a bird that's born in Boston will be the same as a bird that's born in California."}, {"time": 682, "text": "So there's not as much inheritance of ideas, of customs."}, {"time": 687, "text": "A lot of it is hard coding in their genome."}, {"time": 690, "text": "What's really beautiful about the human genome is that if you take a person from today and you place them back in ancient Egypt, or if you take a person from ancient Egypt and you place them here today, they will grow up to be completely normal."}, {"time": 704, "text": "That is not genetics."}, {"time": 707, "text": "This is the other type of inheritance in humans."}, {"time": 711, "text": "So on one hand, we have the genetic inheritance, which is vertical from your parents down."}, {"time": 716, "text": "On the other hand, we have horizontal inheritance, which is the ideas that are built up at every generation are horizontally transmitted."}, {"time": 724, "text": "And the huge amount of time that we spend in educating ourselves, a concept known as neoteny, neo for newborn and then teny for holding."}, {"time": 735, "text": "So if you look at humans, I mean, the little birds that were eggs two weeks ago, and now one of them has already flown off."}, {"time": 742, "text": "The other one's ready to fly off."}, {"time": 744, "text": "In two weeks, they're ready to just fend for themselves."}, {"time": 747, "text": "Humans, 16 years, 18 years, 24, getting out of college."}, {"time": 753, "text": "I'm still learning."}, {"time": 754, "text": "So that's so fascinating, this picture of a vertical and the horizontal."}, {"time": 758, "text": "When you talk about the horizontal, is it in the realm of ideas?"}, {"time": 762, "text": "Okay, so it's the actual social interactions."}, {"time": 767, "text": "So basically the concept of neoteny is that you spend acquiring characteristics from your environment in an extremely malleable state of your brain and the wiring of your brain for a long period of your life."}, {"time": 780, "text": "Compared to primates, we are useless."}, {"time": 783, "text": "You take any primate at seven weeks and any human at seven weeks, we lose the battle."}, {"time": 788, "text": "But at 18 years, you know, all bets are off."}, {"time": 791, "text": "Like we basically, our brain continues to develop in an extremely malleable form till very late."}, {"time": 797, "text": "And this is what allows education."}, {"time": 800, "text": "This is what allows the person from Egypt to do extremely well now."}, {"time": 804, "text": "And the reason for that is that the wiring of our brain and the development of that wiring is actually delayed."}, {"time": 814, "text": "So, you know, the longer you delay that, the more opportunity you have to pass on knowledge, to pass on concepts, ideals, ideas from the parents to the child."}, {"time": 868, "text": "So the democratization of knowledge and the spread, the speed of spread of knowledge is what defines, I think, the human inheritance pattern."}, {"time": 878, "text": "So you sound excited about it, are you also a little bit afraid or are you more excited by the power of this kind of distributed spread of information?"}, {"time": 931, "text": "Yeah, I think we use the genome to talk about DNA, but very often we say, I'm Greek, so people ask me, hey, what's in the Greek genome?"}, {"time": 940, "text": "And I'm like, well, yeah, what's in the Greek genome is both our genes and also our ideas and our ideals and our culture."}, {"time": 946, "text": "So the poetic meaning of the word."}, {"time": 948, "text": "Exactly, exactly, yeah."}, {"time": 950, "text": "So I think that there's a beauty to the democratization of knowledge, the fact that you can reach as many people as any other person on the planet and it's not who you are, it's really your ideas that matter, is a beautiful aspect of the internet."}, {"time": 971, "text": "I think there's, of course, a danger of my ignorance is as important as your expertise."}, {"time": 978, "text": "The fact that with this democratization comes the abolishment of respecting expertise."}, {"time": 985, "text": "Just because you've spent 10,000 hours of your life studying, I don't know, human brain circuitry, why should I trust you?"}, {"time": 994, "text": "I'm just gonna make up my own theories and they'll be just as good as yours, is an attitude that sort of counteracts the beauty of the democratization."}, {"time": 1002, "text": "And I think that within our educational system and within the upbringing of our children, we have to not only teach them knowledge, but we have to teach them the means to get to knowledge."}, {"time": 1015, "text": "And that, it's very similar to sort of you fish, you catch a fish for a man for one day, you fed them for one day, you teach them how to fish, you fed them for the rest of their life."}, {"time": 1025, "text": "So instead of just gathering the knowledge they need for any one task, we can just tell them, all right, here's how you Google it, here's how you figure out what's real and what's not, here's how you check the sources, here's how you form a basic opinion for yourself."}, {"time": 1039, "text": "And I think that inquisitive nature is paramount to being able to sort through this huge wealth of knowledge."}, {"time": 1049, "text": "So you need a basic educational foundation based on which you can then add on the sort of domain specific knowledge, but that basic educational foundation should just not just be knowledge, but it should also be epistemology, the way to acquire knowledge."}, {"time": 1067, "text": "I'm not sure any of us know how to do that in this modern day, we're actually learning."}, {"time": 1071, "text": "One of the big surprising thing to me about the coronavirus, for example, is that Twitter has been one of the best sources of information."}, {"time": 1082, "text": "Basically like building your own network of experts, as opposed to the traditional centralized expertise of the WHO and the CDC, or maybe any one particular respectable person at the top of a department in some kind of institution, you instead look at 10, 20, hundreds of people, some of whom are young kids that are incredibly good at aggregating data and plotting and visualizing that data."}, {"time": 1115, "text": "That's been really surprising to me."}, {"time": 1117, "text": "I don't know what to make of it."}, {"time": 1119, "text": "I don't know how that matures into something stable."}, {"time": 1125, "text": "I don't know if you have ideas."}, {"time": 1127, "text": "If you were to just try to explain to your kids of where should you go to learn about coronavirus, what would you say?"}, {"time": 1136, "text": "It's such a beautiful example."}, {"time": 1138, "text": "And I think the current pandemic and the speed at which the scientific community has moved in the current pandemic, I think exemplifies this horizontal transfer and the speed of horizontal transfer of information."}, {"time": 1150, "text": "The fact that the genome was first sequenced in early January, the first sample was obtained December 29, 2019, a week after the publication of the first genome sequence, Moderna had already finalized its vaccine design and was moving to production."}, {"time": 1169, "text": "I mean, this is phenomenal."}, {"time": 1171, "text": "The fact that we go from not knowing what the heck is killing people in Wuhan to wow, it's SARS CoV2 and here's the set of genes, here's the genome, here's the sequence, here are the polymorphisms, et cetera, in the matter of weeks is phenomenal."}, {"time": 1188, "text": "In that incredible pace of transfer of knowledge, there have been many mistakes."}, {"time": 1194, "text": "So, some of those mistakes may have been politically motivated or other mistakes may have just been innocuous errors."}, {"time": 1200, "text": "Others may have been misleading the public for the greater good, such as don't wear masks because we don't want the mask to run out."}, {"time": 1207, "text": "I mean, that was very silly in my view and a very big mistake."}, {"time": 1211, "text": "But the spread of knowledge from the scientific community was phenomenal."}, {"time": 1217, "text": "And some people will point out to bogus articles that snuck in and made the front page."}, {"time": 1222, "text": "Yeah, they did."}, {"time": 1223, "text": "But within 24 hours, they were debunked and went out of the front page."}, {"time": 1227, "text": "And I think that's the beauty of science today."}, {"time": 1230, "text": "The fact that it's not, oh, knowledge is fixed."}, {"time": 1233, "text": "It's the ability to embrace that nothing is permanent when it comes to knowledge, that everything is the current best hypothesis and the current best model that best fits the current data and the willingness to be wrong."}, {"time": 1245, "text": "The expectation that we're gonna be wrong and the celebration of success based on how long was I not proven wrong for, rather than, wow, I was exactly right."}, {"time": 1255, "text": "Because no one is gonna be exactly right with partial knowledge."}, {"time": 1258, "text": "But the arc towards perfection, I think is so much more important than how far you are in your first step."}, {"time": 1268, "text": "And I think that's what sort of the current pandemic has taught us."}, {"time": 1273, "text": "The fact that, yeah, no, of course, we're gonna make mistakes, but at least we're gonna learn from those mistakes and become better and learn better and spread information better."}, {"time": 1281, "text": "So if I were to answer the question of, where would you go to learn about coronavirus?"}, {"time": 1287, "text": "First textbook, it all starts with a textbook."}, {"time": 1289, "text": "Just open up a chapter on virology and how coronaviruses work."}, {"time": 1294, "text": "Then some basic epidemiology and sort of how pandemics have worked in the past."}, {"time": 1299, "text": "What are the basic principles surrounding these first wave, second wave?"}, {"time": 1303, "text": "Why do they even exist?"}, {"time": 1305, "text": "Then understanding about growth, understanding about the R0 and RT at various time points."}, {"time": 1312, "text": "And then understanding the means of spread, how it spreads from person to person."}, {"time": 1317, "text": "Then how does it get into your cells?"}, {"time": 1320, "text": "From when it gets into the cells, what are the paths that it takes?"}, {"time": 1323, "text": "What are the cell types that express the particular ACE2 receptor?"}, {"time": 1327, "text": "How is your immune system interacting with the virus?"}, {"time": 1329, "text": "And once your immune system launches a defense, how is that helping or actually hurting your health?"}, {"time": 1335, "text": "What about the cytokine storm?"}, {"time": 1336, "text": "What are most people dying from?"}, {"time": 1338, "text": "Why are the comorbidities and these risk factors even applying?"}, {"time": 1343, "text": "What makes obese people respond more or elderly people respond more to the virus while kids are completely, very often not even aware that they're spreading it?"}, {"time": 1356, "text": "So I think there's some basic questions that you would start from."}, {"time": 1362, "text": "And then I'm sorry to say, but Wikipedia is pretty awesome."}, {"time": 1365, "text": "Yeah, it is."}, {"time": 1365, "text": "Google is pretty awesome."}, {"time": 1367, "text": "It used to be a time, it used to be a time maybe five years ago."}, {"time": 1370, "text": "I forget when, but people kind of made fun of Wikipedia for being an unreliable source."}, {"time": 1377, "text": "I never quite understood it."}, {"time": 1378, "text": "I thought from the early days, it was pretty reliable or better than a lot of the alternatives."}, {"time": 1383, "text": "But at this point, it's kind of like a solid accessible survey paper on every subject ever."}, {"time": 1390, "text": "There's an ascertainment bias and a writing bias."}, {"time": 1394, "text": "So I think this is related to sort of people saying, oh, so many nature papers are wrong."}, {"time": 1400, "text": "And they're like, why would you publish in nature?"}, {"time": 1402, "text": "So many nature papers are wrong."}, {"time": 1403, "text": "And my answer is no, no, no."}, {"time": 1406, "text": "So many nature papers are scrutinized."}, {"time": 1409, "text": "And just because more of them are being proven wrong than in other articles is actually evidence that they're actually better papers overall because they're being scrutinized at a rate much higher than any other journal."}, {"time": 1421, "text": "So if you basically judge Wikipedia by not the initial content, but by the number of revisions, then of course it's gonna be the best source of knowledge eventually."}, {"time": 1435, "text": "It's still very superficial."}, {"time": 1437, "text": "You then have to go into the review papers, et cetera, et cetera, et cetera."}, {"time": 1440, "text": "But I mean, for most scientific topics, it's extremely superficial, but it is quite authoritative because it is the place that everybody likes to criticize as being wrong."}, {"time": 1451, "text": "You say that it's superficial."}, {"time": 1453, "text": "And a lot of topics that I've studied a lot of, I find it, I don't know if superficial is the right word."}, {"time": 1464, "text": "Because superficial kind of implies that it's not correct."}, {"time": 1469, "text": "I don't mean any implication of it not being correct."}, {"time": 1471, "text": "It's just superficial."}, {"time": 1472, "text": "It's basically only scratching the surface."}, {"time": 1475, "text": "For depth, you don't go to Wikipedia."}, {"time": 1477, "text": "You go to the review articles."}, {"time": 1478, "text": "But it can be profound in the way that articles rarely, one of the frustrating things to me about certain computer science, like in the machine learning world, articles, they don't as often take the bigger picture view."}, {"time": 1494, "text": "There's a kind of data set and you show that it works and you kind of show that here's an architecture thing that creates an improvement and so on and so forth."}, {"time": 1502, "text": "But you don't say, well, what does this mean for the nature of intelligence for future data sets we haven't even thought about?"}, {"time": 1510, "text": "Or if you were trying to implement this, like if we took this data set of 100,000 examples and scale it to 100 billion examples with this method, like look at the bigger picture, which is what a Wikipedia article would actually try to do, which is like, what does this mean in the context of the broad field of computer vision or something like that?"}, {"time": 1532, "text": "Yeah, no, I agree with you completely, but it depends on the topic."}, {"time": 1536, "text": "I mean, for some topics, there's been a huge amount of work."}, {"time": 1538, "text": "For other topics, it's just a stub."}, {"time": 1543, "text": "Well, yeah, actually the, which we'll talk on, genomics was not great."}, {"time": 1548, "text": "Yeah, it's very shallow, yeah, yeah."}, {"time": 1550, "text": "It's not wrong, it's just shallow."}, {"time": 1551, "text": "It's shallow."}, {"time": 1552, "text": "Yeah, every time I criticize something, I should feel partly responsible."}, {"time": 1556, "text": "Basically, if more people from my community went there and edited, it would not be shallow."}, {"time": 1561, "text": "It's just that there's different modes of communication in different fields."}, {"time": 1565, "text": "And in some fields, the experts have embraced Wikipedia."}, {"time": 1568, "text": "In other fields, it's relegated."}, {"time": 1571, "text": "And perhaps the reason is that if it was any better to start with, people would invest more time."}, {"time": 1578, "text": "But if it's not great to start with, then you need a few initial pioneers who will basically go in and say, ah, enough, we're just gonna fix that."}, {"time": 1586, "text": "And then I think it'll catch on much more."}, {"time": 1589, "text": "So if it's okay, before we go on to genomics, can we linger a little bit longer on the beauty of the human genome?"}, {"time": 1597, "text": "You've given me a few notes."}, {"time": 1598, "text": "What else do you find beautiful about the human genome?"}, {"time": 1601, "text": "So the last aspect of what makes the human genome unique, in addition to the, you know, similarity and the differences and the individuality is that, so very early on, people would basically say, oh, you don't do that experiment in human, you have to learn about that in fly, or you have to learn about that in yeast first, or in mouse first, or in a primate first."}, {"time": 1625, "text": "And the human genome was in fact relegated to sort of, oh, the last place that you're gonna go to learn something new."}, {"time": 1632, "text": "That has dramatically changed."}, {"time": 1634, "text": "And the reason that changed is human genetics."}, {"time": 1638, "text": "We are the species in the planet that's the most studied right now."}, {"time": 1644, "text": "It's embarrassing to say that, but this was not the case a few years ago."}, {"time": 1648, "text": "It used to be, you know, first viruses, then bacteria, then yeast, then the fruit fly and the worm, then the mouse, and eventually human was very far last."}, {"time": 1662, "text": "So it's embarrassing that it took us this long to focus on it, or the..."}, {"time": 1666, "text": "It's embarrassing that the model organisms have been taken over because of the power of human genetics."}, {"time": 1672, "text": "That right now, it's actually simpler to figure out the phenotype of something by mining this massive amount of human data than by going back to any of the other species."}, {"time": 1684, "text": "And the reason for that is that if you look at the natural variation that happens in a population of seven billion, you basically have a mutation in almost every nucleotide."}, {"time": 1693, "text": "So every nucleotide you wanna perturb, you can go find a living, breathing human being and go test the function of that nucleotide by sort of searching the database and finding that person."}, {"time": 1702, "text": "Wait, why is that embarrassing?"}, {"time": 1703, "text": "It's a beautiful data set."}, {"time": 1706, "text": "It's embarrassing for the model organism."}, {"time": 1709, "text": "For the flies."}, {"time": 1710, "text": "I mean, do you feel on a small tangent, is there something of value in the genome of a fly and other of these model organisms that you miss that we wish we would be looking at deeper?"}, {"time": 1727, "text": "So directed perturbation, of course."}, {"time": 1729, "text": "So I think the place where humans are still lagging is the fact that in an animal model, you can go and say, well, let me knock out this gene completely and let me knock out these three genes completely."}, {"time": 1740, "text": "And the moment you get into combinatorics, it's something you can't do in the human because there just simply aren't enough humans on the planet."}, {"time": 1747, "text": "And again, let me be honest, we haven't sequenced all seven billion people."}, {"time": 1751, "text": "It's not like we have every mutation, but we know that there's a carrier out there."}, {"time": 1755, "text": "So if you look at the trend and the speed with which human genetics has progressed, we can now find thousands of genes involved in human cognition, in human psychology, in the emotions and the feelings that we used to think are uniquely learned."}, {"time": 1771, "text": "It turns out there's a genetic basis to a lot of that."}, {"time": 1774, "text": "So the human genome has continued to elucidate through these studies of genetic variation, so many different processes that we previously thought were something like free will."}, {"time": 1792, "text": "Free will is this beautiful concept that humans have had for a long time."}, {"time": 1798, "text": "In the end, it's just a bunch of chemical reactions happening in your brain."}, {"time": 1800, "text": "And the particular abundance of receptors that you have this day based on what you ate yesterday or that you have been wired with based on your parents and your upbringing, et cetera, determines a lot of that quote unquote free will component to sort of narrow and narrow sort of slices."}, {"time": 1820, "text": "So how much on that point, how much freedom do you think we have to escape the constraints of our genome?"}, {"time": 1830, "text": "You're making it sound like more and more we're discovering that our genome is actually has the, a lot of the story already encoded into it."}, {"time": 1837, "text": "How much freedom do we have?"}, {"time": 1839, "text": "I, so let me describe what that freedom would look like."}, {"time": 1845, "text": "That freedom would be my saying, ooh, I'm gonna resist the urge to eat that apple because I choose not to."}, {"time": 1854, "text": "But there are chemical receptors that made me not resist the urge to prove my individuality and my free will by resisting the apple."}, {"time": 1864, "text": "So then the next question is, well, maybe now I'll resist the urge to resist the apple and I'll go for the chocolate instead to prove my individuality."}, {"time": 1870, "text": "But then what about those other receptors that, you know?"}, {"time": 1874, "text": "That might be all encoded in there."}, {"time": 1877, "text": "So it's kicking the bucket down the road and basically saying, well, your choice will may have actually been driven by other things that you actually are not choosing."}, {"time": 1887, "text": "So that's why it's very hard to answer that question."}, {"time": 1890, "text": "It's hard to know what to do with that."}, {"time": 1891, "text": "I mean, if the genome has, if there's not much freedom, it's a..."}, {"time": 1898, "text": "It's the butterfly effect."}, {"time": 1900, "text": "It's basically that in the short term, you can predict something extremely well by knowing the current state of the system."}, {"time": 1908, "text": "But a few steps down, it's very hard to predict based on the current knowledge."}, {"time": 1912, "text": "Is that because the system is truly free?"}, {"time": 1915, "text": "When I look at weather patterns, I can predict the next 10 days."}, {"time": 1917, "text": "Is it because the weather has a lot of freedom and after 10 days it chooses to do something else?"}, {"time": 1923, "text": "Or is it because in fact the system is fully deterministic and there's just a slightly different magnetic field of the earth, slightly more energy arriving from the sun, a slightly different spin of the gravitational pull of Jupiter that is now causing all kinds of tides and slight deviation of the moon, et cetera."}, {"time": 1940, "text": "Maybe all of that can be fully modeled."}, {"time": 1942, "text": "Maybe the fact that China is emitting a little more carbon today is actually gonna affect the weather in Egypt in three weeks."}, {"time": 1951, "text": "And all of that could be fully modeled."}, {"time": 1953, "text": "In the same way, if you take a complete view of a human being now, I model everything about you."}, {"time": 1962, "text": "The question is, can I predict your next step?"}, {"time": 1964, "text": "Probably, but at how far?"}, {"time": 1967, "text": "And if it's a little further, is that because of stochasticity and sort of chaos properties of unpredictability of beyond a certain level?"}, {"time": 1976, "text": "Or was that actually true free will?"}, {"time": 1978, "text": "Yeah, so the number of variables might be so, you might need to build an entire universe to be able to model."}, {"time": 1985, "text": "To simulate a human, and then maybe that human will be fully simulatable."}, {"time": 1989, "text": "But maybe aspects of free will will exist."}, {"time": 1992, "text": "And where's that free will coming from?"}, {"time": 1993, "text": "It's still coming from the same neurons or maybe from a spirit inhabiting these neurons."}, {"time": 1997, "text": "But again, it's very difficult empirically to sort of evaluate where does free will begin and sort of chemical reactions and electric signals."}, {"time": 2006, "text": "So on that topic, let me ask the most absurd question that most MIT faculty rolled their eyes on."}, {"time": 2013, "text": "But what do you think about the simulation hypothesis and the idea that we live in a simulation?"}, {"time": 2020, "text": "I think it's complete BS."}, {"time": 2024, "text": "There's no empirical evidence."}, {"time": 2025, "text": "No, it's not."}, {"time": 2027, "text": "Not in terms of empirical evidence or not, but in terms of a thought experiment, does it help you think about the universe?"}, {"time": 2034, "text": "I mean, so if you look at the genome, it's encoding a lot of the information that is required to create some of the beautiful human complexity that we see around us."}, {"time": 2044, "text": "It's an interesting thought experiment."}, {"time": 2045, "text": "How much parameters do we need to have in order to model this full human experience?"}, {"time": 2055, "text": "Like if we were to build a video game, how hard it would be to build a video game that's like convincing enough and fun enough and it has consistent laws of physics, all that stuff."}, {"time": 2068, "text": "It's not interesting to use a thought experiment."}, {"time": 2071, "text": "I mean, it's cute, but it's Occam's razor."}, {"time": 2075, "text": "I mean, what's more realistic, the fact that you're actually a machine or that you're a person?"}, {"time": 2079, "text": "What's the fact that all of my experiences exist inside the chemical molecules that I have or that somebody is actually simulating all that?"}, {"time": 2089, "text": "Well, you did refer to humans as a digital computer earlier."}, {"time": 2092, "text": "Of course, of course."}, {"time": 2093, "text": "But that does not."}, {"time": 2094, "text": "It's a kind of a machine, right?"}, {"time": 2095, "text": "I know, I know."}, {"time": 2096, "text": "But I think the probability of all that is nil and let the machines wake me up and just terminate me now if it's not."}, {"time": 2107, "text": "I challenge you machines."}, {"time": 2108, "text": "They're gonna wait a little bit to see what you're gonna do next."}, {"time": 2113, "text": "It's fun to watch, especially the clever humans."}, {"time": 2117, "text": "What's the difference to you between the way a computer stores information and the human genome stores information?"}, {"time": 2124, "text": "So you also have roots and your work."}, {"time": 2127, "text": "Would you say when you introduce yourself at a bar."}, {"time": 2131, "text": "It depends who I'm talking to."}, {"time": 2134, "text": "Would you say it's computational biology?"}, {"time": 2136, "text": "Do you reveal your expertise in computers?"}, {"time": 2143, "text": "It depends who I'm talking to, truly."}, {"time": 2145, "text": "I mean, basically, if I meet someone who's in computers, I'll say, oh, I'm a professor in computer science."}, {"time": 2151, "text": "If I meet someone who's in engineering, I say computer science and electrical engineering."}, {"time": 2154, "text": "If I meet someone in biology, I'll say, hey, I work in genomics."}, {"time": 2157, "text": "If I meet someone in medicine, I'm like, hey, I work on genetics."}, {"time": 2160, "text": "So you're a fun person to meet at a bar."}, {"time": 2162, "text": "I got you, but so."}, {"time": 2163, "text": "No, no, but what I'm trying to say is that I don't, I mean, there's no single attribute that I will define myself as."}, {"time": 2171, "text": "There's a few things I know."}, {"time": 2172, "text": "There's a few things I study."}, {"time": 2173, "text": "There's a few things I have degrees on and there's a few things that I grant degrees in."}, {"time": 2177, "text": "And I publish papers across the whole gamut, the whole spectrum of computation to biology, et cetera."}, {"time": 2186, "text": "I mean, the complete answer is that I use computer science to understand biology."}, {"time": 2194, "text": "So I develop methods in AI and machine learning, statistics and algorithms, et cetera."}, {"time": 2201, "text": "But the ultimate goal of my career is to really understand biology."}, {"time": 2205, "text": "If these things don't advance our understanding of biology, I'm not as fascinated by them."}, {"time": 2211, "text": "Although there are some beautiful computational problems by themselves, I've sort of made it my mission to apply the power of computer science to truly understand the human genome, health, disease, and the whole gamut of how our brain works, how our body works and all of that, which is so fascinating."}, {"time": 2233, "text": "And so the dream, there's not an equivalent sort of complimentary dream of understanding human biology in order to create an artificial life or an artificial brain or artificial intelligence that supersedes the intelligence and the capabilities of us humans."}, {"time": 2251, "text": "It's a fascinating question."}, {"time": 2253, "text": "So understanding the human brain is undoubtedly coupled to how do we make better AI?"}, {"time": 2262, "text": "Because so much of AI has in fact been inspired by the brain."}, {"time": 2267, "text": "It may have taken 50 years since the early days of neural networks till we have all of these amazing progress that we've seen with deep belief networks and all of these advances in Go, in Chess, in image synthesis, in deep fakes, in you name it."}, {"time": 2290, "text": "But the underlying architecture is very much inspired by the human brain, which actually posits a very, very interesting question."}, {"time": 2302, "text": "Why are neural networks performing so well?"}, {"time": 2307, "text": "And they perform amazingly well."}, {"time": 2308, "text": "Is it because they can simulate any possible function?"}, {"time": 2312, "text": "And the answer is no, no."}, {"time": 2314, "text": "They simulate a very small number of functions."}, {"time": 2317, "text": "Is it because they can simulate every function in the universe?"}, {"time": 2320, "text": "And that's where it gets interesting."}, {"time": 2321, "text": "The answer is actually, yeah, a little closer to that."}, {"time": 2324, "text": "And here's where it gets really fun."}, {"time": 2327, "text": "If you look at human brain and human cognition, it didn't evolve in a vacuum."}, {"time": 2333, "text": "It evolved in a world with physical constraints, like the world that inhabits us."}, {"time": 2340, "text": "It is the world that we inhabit."}, {"time": 2343, "text": "And if you look at our senses, what do they perceive?"}, {"time": 2348, "text": "They perceive different parts of the electromagnetic spectrum."}, {"time": 2353, "text": "The hearing is just different movements in air, the touch, et cetera."}, {"time": 2358, "text": "I mean, all of these things, we've built intuitions for the physical world that we inhabit."}, {"time": 2363, "text": "And our brains and the brains of all animals evolved for that world."}, {"time": 2369, "text": "And the AI systems that we have built happen to work well with images of the type that we encounter in the physical world that we inhabit."}, {"time": 2378, "text": "Whereas if you just take noise and you add random signal that doesn't match anything in our world, neural networks will not do as well."}, {"time": 2386, "text": "And that actually basically has this whole loop around this, which is this was designed by studying our own brain, which was evolved for our own world."}, {"time": 2399, "text": "And they happen to do well in our own world."}, {"time": 2401, "text": "And they happen to make the same types of mistakes that humans make many times."}, {"time": 2407, "text": "And of course you can engineer images by adding just the right amount of sort of pixel deviations to make a zebra look like a bamboo and stuff like that, or like a table."}, {"time": 2418, "text": "But ultimately the undoctored images at least are very often mistaken, I don't know, between muffins and dogs, for example, in the same way that humans make those mistakes."}, {"time": 2468, "text": "Yeah, and that small subset of functions, all that matters to us humans really, that's what makes."}, {"time": 2472, "text": "It's all that has mattered so far."}, {"time": 2474, "text": "And even within our scientific realm, it's all that seems to continue to matter."}, {"time": 2479, "text": "But I mean, I always like to think about our senses and how much of the physical world around us we perceive."}, {"time": 2489, "text": "And if you look at the LIGO experiment over the last year and a half has been all over the news."}, {"time": 2498, "text": "What did LIGO do?"}, {"time": 2499, "text": "It created a new sense for human beings, a sense that has never been sensed in the history of our planet."}, {"time": 2508, "text": "Gravitational waves have been traversing the earth since its creation a few billion years ago."}, {"time": 2515, "text": "Life has evolved senses to sense things that were never before sensed."}, {"time": 2522, "text": "Light was not perceived by early life."}, {"time": 2525, "text": "No one cared."}, {"time": 2527, "text": "And eventually photoreceptors evolved and the ability to sense colors by sort of catching different parts of that electromagnetic spectrum."}, {"time": 2539, "text": "And hearing evolved and touch evolved, et cetera."}, {"time": 2543, "text": "But no organism evolved a way to sense neutrinos floating through earth or gravitational waves flowing through earth, et cetera."}, {"time": 2551, "text": "And I find it so beautiful in the history of not just humanity, but life on the planet that we are now able to capture additional signals from the physical world than we ever knew before."}, {"time": 2563, "text": "And axions, for example, have been all over the news in the last few weeks."}, {"time": 2567, "text": "And the concept that we can capture and perceive more of that physical world is as exciting as the fact that we were blind to it is traumatizing before."}, {"time": 2584, "text": "Because that also tells us, you know, we're in 2020."}, {"time": 2589, "text": "Picture yourself in 3020 or in 20, you know."}, {"time": 2592, "text": "What new senses might we discover?"}, {"time": 2595, "text": "Is it, you know, could it be that we're missing nine tenths of physics?"}, {"time": 2601, "text": "That like, there's a lot of physics out there that we're just blind to, completely oblivious to it."}, {"time": 2607, "text": "And yet they're permeating us all the time."}, {"time": 2609, "text": "Yeah, so it might be right in front of us."}, {"time": 2611, "text": "So when you're thinking about premonitions, yeah, a lot of that is ascertainment bias."}, {"time": 2617, "text": "Like, yeah, you know, every now and then you're like, oh, I remember my friend."}, {"time": 2621, "text": "And then my friend doesn't appear and I'll forget that I remembered my friend."}, {"time": 2624, "text": "But every now and then my friend will actually appear."}, {"time": 2625, "text": "I'm like, oh my God, I thought about you a minute ago."}, {"time": 2628, "text": "You just called me, that's amazing."}, {"time": 2630, "text": "So, you know, some of that is this, but some of that might be that there are, within our brain, sensors for waves that we emit that we're not even aware of."}, {"time": 2643, "text": "And this whole concept of when I hug my children, there's such an emotional transfer there that we don't comprehend."}, {"time": 2652, "text": "I mean, sure, yeah, of course we're all like hard wire for all kinds of touchy feely things between parents and kids, it's beautiful, between partners, it's beautiful, et cetera."}, {"time": 2660, "text": "But then there are intangible aspects of human communication that I don't think it's unfathomable that our brain has actually evolved waves and sensors for it that we just don't capture."}, {"time": 2673, "text": "We don't understand the function of the vast majority of our neurons."}, {"time": 2677, "text": "And maybe our brain is already sensing it, but even worse, maybe our brain is not sensing it at all."}, {"time": 2683, "text": "And we're oblivious to this until we build a machine that suddenly is able to sort of capture so much more of what's happening in the natural world."}, {"time": 2690, "text": "So what you're saying is physics is going to discover a sensor for love."}, {"time": 2697, "text": "And maybe dogs are off scale for that."}, {"time": 2701, "text": "And we've been oblivious to it the whole time because we didn't have the right sensor."}, {"time": 2705, "text": "And now you're gonna have a little wrist that says, oh my God, I feel all this love in the house."}, {"time": 2709, "text": "I sense a disturbance in the forest."}, {"time": 2711, "text": "It's all around us."}, {"time": 2713, "text": "And dogs and cats will have zero."}, {"time": 2717, "text": "Oh, no signal."}, {"time": 2720, "text": "But let's take a step back to our unfortunate place."}, {"time": 2724, "text": "To one of the 400 topics that we had actually planned for."}, {"time": 2729, "text": "But to our sad time in 2020 when we only have just a few sensors and very primitive early computers."}, {"time": 2737, "text": "So you have a foot in computer science and a foot in biology."}, {"time": 2743, "text": "In your sense, how do computers represent information differently than like the genome or biological systems?"}, {"time": 2752, "text": "So first of all, let me correct that no, we're in an amazing time in 2020."}, {"time": 2760, "text": "Computer science is totally awesome."}, {"time": 2762, "text": "And physics is totally awesome."}, {"time": 2763, "text": "And we have understood so much of the natural world than ever before."}, {"time": 2768, "text": "So I am extremely grateful and feeling extremely lucky to be living in the time that we are."}, {"time": 2776, "text": "Cause you know, first of all, who knows when the asteroid will hit."}, {"time": 2780, "text": "And second, you know, of all times in humanity, this is probably the best time to be a human being."}, {"time": 2789, "text": "And this might actually be the best place to be a human being."}, {"time": 2791, "text": "So anyway, you know, for anyone who loves science, this is it."}, {"time": 2795, "text": "This is awesome."}, {"time": 2796, "text": "This is a great time."}, {"time": 2796, "text": "At the same time, just a quick comment."}, {"time": 2799, "text": "All I meant is that if we look several hundred years from now and we end up somehow not destroying ourselves, people will probably look back at this time in computer science and at your work of Manos at MIT."}, {"time": 2815, "text": "As infantile."}, {"time": 2816, "text": "As infantile and silly and how ignorant it all was."}, {"time": 2819, "text": "I like to joke very often with my students that, you know, we've written so many papers."}, {"time": 2824, "text": "We've published so much."}, {"time": 2825, "text": "We've been citing so much."}, {"time": 2826, "text": "And every single time I tell my students, you know, the best is ahead of us."}, {"time": 2829, "text": "What we're working on now is the most exciting thing I've ever worked on."}, {"time": 2833, "text": "So in a way, I do have this sense of, yeah, even the papers I wrote 10 years ago, they were awesome at the time, but I'm so much more excited about where we're heading now."}, {"time": 2842, "text": "And I don't mean to minimize any of the stuff we've done in the past, but you know, there's just this sense of excitement about what you're working on now that as soon as a paper is submitted, it's like, ugh, it's old."}, {"time": 2855, "text": "You know, I can't talk about that anymore."}, {"time": 2857, "text": "I'm not gonna talk about it."}, {"time": 2857, "text": "At the same time, you're not, you probably are not going to be able to predict what are the most impactful papers and ideas when people look back 200 years from now at your work, what would be the most exciting papers."}, {"time": 2870, "text": "And it may very well be not the thing that you expected."}, {"time": 2874, "text": "Or the things you got awards for or, you know."}, {"time": 2878, "text": "This might be true in some fields."}, {"time": 2880, "text": "I feel slightly differently about it in our field."}, {"time": 2882, "text": "I feel that I kind of know what are the important ones."}, {"time": 2885, "text": "And there's a very big difference between what the press picks up on and what's actually fundamentally important for the field."}, {"time": 2891, "text": "And I think for the fundamentally important ones, we kind of have a pretty good idea what they are."}, {"time": 2895, "text": "And it's hard to sometimes get the press excited about the fundamental advances, but you know, we take what we get and celebrate what we get."}, {"time": 2904, "text": "And sometimes, you know, one of our papers, which was in a minor journal, made the front page of Reddit and suddenly had like hundreds of thousands of views."}, {"time": 2913, "text": "Even though it was in a minor journal because, you know, somebody pitched it the right way that it suddenly caught everybody's attention."}, {"time": 2919, "text": "Whereas other papers that are sort of truly fundamental, you know, we have a hard time getting the editors even excited about them when so many hundreds of people are already using the results and building upon them."}, {"time": 2930, "text": "So I do appreciate that there's a discrepancy between the perception and the perceived success and the awards that you get for various papers."}, {"time": 2939, "text": "But I think that fundamentally, I know that, you know, some paper, I'm so, so when you write."}, {"time": 2944, "text": "So is there a paper that you're most proud of?"}, {"time": 2946, "text": "See, now you just, you trapped yourself."}, {"time": 2949, "text": "No, no, no, no, I mean."}, {"time": 2950, "text": "Is there a line of work that you have a sense is really powerful that you've done to date?"}, {"time": 2957, "text": "You've done so much work in so many directions, which is interesting."}, {"time": 2961, "text": "Is there something where you think is quite special?"}, {"time": 2965, "text": "I mean, it's like asking me to say which of my three children I love best."}, {"time": 2974, "text": "So, I mean, and it's such a gimme question that is so, so difficult not to brag about the awesome work that my team and my students have done."}, {"time": 2987, "text": "And I'll just mention a few off the top of my head."}, {"time": 2989, "text": "I mean, basically there's a few landmark papers that I think have shaped my scientific path."}, {"time": 2996, "text": "And, you know, I like to somehow describe it as a linear continuation of one thing led to another and led to another led to another."}, {"time": 3005, "text": "And, you know, it kind of all started with, skip, skip, skip, skip, skip."}, {"time": 3012, "text": "Let me try to start somewhere in the middle."}, {"time": 3014, "text": "So my first PhD paper was the first comparative analysis of multiple species."}, {"time": 3021, "text": "So multiple complete genomes."}, {"time": 3023, "text": "So for the first time we basically developed the concept of genome wide evolutionary signatures."}, {"time": 3029, "text": "The fact that you could look across the entire genome and understand how things evolve."}, {"time": 3035, "text": "And from these signatures of evolution you could go back and study any one region and say, that's a protein coding gene."}, {"time": 3044, "text": "That's an RNA gene."}, {"time": 3045, "text": "That's a regulatory motif."}, {"time": 3047, "text": "That's a, you know, binding site and so on and so forth."}, {"time": 3050, "text": "I'm sorry, so comparing different."}, {"time": 3052, "text": "Different species."}, {"time": 3053, "text": "Species of the same."}, {"time": 3055, "text": "So take human, mouse, rat and dog."}, {"time": 3058, "text": "You know, they're all animals, they're all mammals."}, {"time": 3059, "text": "They're all performing similar functions with their heart, with their brain, with their lungs, et cetera, et cetera."}, {"time": 3065, "text": "So there's many functional elements that make us uniquely mammalian."}, {"time": 3070, "text": "And those mammalian elements are actually conserved."}, {"time": 3074, "text": "99% of our genome does not code for protein."}, {"time": 3078, "text": "1% codes for protein."}, {"time": 3080, "text": "The other 99%, we frankly didn't know what it does until we started doing this comparative genomic studies."}, {"time": 3088, "text": "So basically these series of papers in my career have basically first developed that concept of evolutionary signatures and then apply them to yeast, apply them to flies, apply them to four mammals, apply them to 17 fungi, apply them to 12 Drosophila species, apply them to then 29 mammals and now 200 mammals."}, {"time": 3106, "text": "So sorry, so can we."}, {"time": 3108, "text": "So the evolutionary signatures seems like it's such a fascinating idea."}, {"time": 3113, "text": "And we're probably gonna linger on your early PhD work for two hours."}, {"time": 3118, "text": "But what is, how can you reveal something interesting about the genome by looking at the multiple, multiple species and looking at the evolutionary signatures?"}, {"time": 3131, "text": "Yeah, so you basically align the matching regions."}, {"time": 3140, "text": "So everything evolved from a common ancestor way, way back."}, {"time": 3143, "text": "And mammals evolved from a common ancestor about 60 million years back."}, {"time": 3147, "text": "So after the meteor that killed off the dinosaurs landed near Machu Picchu, we know the crater."}, {"time": 3158, "text": "It didn't allegedly land."}, {"time": 3161, "text": "That was the aliens, okay."}, {"time": 3162, "text": "No, just slightly north of Machu Picchu in the Gulf of Mexico, there's a giant hole that that meteor impact."}, {"time": 3169, "text": "Sorry, is that definitive to people?"}, {"time": 3171, "text": "Have people conclusively figured out what killed the dinosaurs?"}, {"time": 3179, "text": "So it was a meteor?"}, {"time": 3180, "text": "Well, volcanic activity, all kinds of other stuff is coinciding, but the meteor is pretty unique and we now have."}, {"time": 3189, "text": "That's also terrifying."}, {"time": 3191, "text": "I wouldn't, we still have a lot of 2020 left, so if anything."}, {"time": 3195, "text": "No, no, but think about it this way."}, {"time": 3197, "text": "So the dinosaurs ruled the earth for 175 million years."}, {"time": 3204, "text": "We humans have been around for what?"}, {"time": 3208, "text": "Less than 1 million years."}, {"time": 3209, "text": "If you're super generous about what you call humans and you include chimps basically."}, {"time": 3215, "text": "So we are just getting warmed up and we've ruled the planet much more ruthlessly than Tyrannosaurus Rex."}, {"time": 3226, "text": "T Rex had much less of an environmental impact than we did."}, {"time": 3229, "text": "And if you give us another 174 million years, humans will look very different if we make it that far."}, {"time": 3238, "text": "So I think dinosaurs basically are much more of life history on earth than we are in all respects."}, {"time": 3246, "text": "But look at the bright side, when they were killed off, another life form emerged, mammals."}, {"time": 3250, "text": "And that's that whole evolutionary branching that's happened."}, {"time": 3255, "text": "So you kind of have, when you have these evolutionary signatures, is there basically a map of how the genome changed?"}, {"time": 3262, "text": "Yeah, exactly, exactly."}, {"time": 3263, "text": "So now you can go back to this early mammal that was hiding in caves and you can basically ask what happened after the dinosaurs were wiped out."}, {"time": 3271, "text": "A ton of evolutionary niches opened up and the mammals started populating all of these niches."}, {"time": 3277, "text": "And in that diversification, there was room for expansion of new types of functions."}, {"time": 3284, "text": "So some of them populated the air with bats flying, a new evolution of flight."}, {"time": 3293, "text": "Some populated the oceans with dolphins and whales going off to swim, et cetera."}, {"time": 3298, "text": "But we all are fundamentally mammals."}, {"time": 3301, "text": "So you can take the genomes of all these species and align them on top of each other and basically create nucleotide resolution correspondences."}, {"time": 3311, "text": "What my PhD work showed is that when you do that, when you line up species on top of each other, you can see that within protein coding genes, there's a particular pattern of evolution that is dictated by the level at which evolutionary selection acts."}, {"time": 3327, "text": "If I'm coding for a protein and I change the third codon position of a triplet that codes for that amino acid, the same amino acid will be encoded."}, {"time": 3338, "text": "So that basically means that any kind of mutation that preserves that translation that is invariant to that ultimate functional assessment that evolution will give is tolerated."}, {"time": 3352, "text": "So for any function that you're trying to achieve, there's a set of sequences that encode it."}, {"time": 3357, "text": "You can now look at the mapping, the graph isomorphism, if you wish, between all of the possible DNA encodings of a particular function and that function."}, {"time": 3369, "text": "And instead of having just that exact sequence at the protein level, you can think of the set of protein sequences that all fulfill the same function."}, {"time": 3378, "text": "What's evolution doing?"}, {"time": 3379, "text": "Evolution has two components."}, {"time": 3380, "text": "One component is random, blind, and stupid mutation."}, {"time": 3385, "text": "The other component is super smart, ruthless selection."}, {"time": 3392, "text": "That's my mom calling from Greece."}, {"time": 3395, "text": "Yes, I might be a fully grown man, but I am a Greek."}, {"time": 3400, "text": "Did you just cancel the call?"}, {"time": 3401, "text": "Wow, you're in trouble."}, {"time": 3402, "text": "I know, I'm in trouble."}, {"time": 3403, "text": "No, she's gonna be calling the cops."}, {"time": 3404, "text": "Honey, are you okay?"}, {"time": 3405, "text": "I'm gonna edit this clip out and send it to her."}, {"time": 3411, "text": "So there's a lot of encoding for the same kind of function."}, {"time": 3414, "text": "Yeah, so you now have this mapping between all of the set of functions that could all encode the same, all of the set of sequences that can all encode the same function."}, {"time": 3424, "text": "What evolutionary signatures does is that it basically looks at the shape of that distribution of sequences that all encode the same thing."}, {"time": 3433, "text": "And based on that shape, you can basically say, ooh, proteins have a very different shape than RNA structures, than regulatory motifs, et cetera."}, {"time": 3441, "text": "So just by scanning a sequence, ignoring the sequence and just looking at the patterns of change, I'm like, wow, this thing is evolving like a protein and that thing is evolving like a motif and that thing is evolving."}, {"time": 3453, "text": "So that's exactly what we just did for COVID."}, {"time": 3455, "text": "So our paper that we posted in bioRxiv about coronavirus basically took this concept of evolutionary signatures and applied it on the SARS CoV2 genome that is responsible for the COVID 19 pandemic."}, {"time": 3468, "text": "And comparing it to?"}, {"time": 3470, "text": "To 44 serbicovirus species."}, {"time": 3472, "text": "So this is the beta."}, {"time": 3473, "text": "What word did you just use, serbicovirus?"}, {"time": 3476, "text": "Serbicovirus, so SARS related beta coronavirus."}, {"time": 3480, "text": "It's a portmanteau of a bunch."}, {"time": 3481, "text": "So that whole family of viruses."}, {"time": 3483, "text": "How big is that family by the way?"}, {"time": 3485, "text": "We have 44 species that, or I mean."}, {"time": 3487, "text": "There's 44 species in the family?"}, {"time": 3489, "text": "Virus is a clever bunch."}, {"time": 3491, "text": "No, no, but there's just 44."}, {"time": 3492, "text": "And again, we don't call them species in viruses."}, {"time": 3495, "text": "We call them strains."}, {"time": 3496, "text": "But anyway, there's 44 strains."}, {"time": 3498, "text": "And that's a tiny little subset of maybe another 50 strains that are just far too distantly related."}, {"time": 3504, "text": "Most of those only infect bats as the host and a subset of only four or five have ever infected humans."}, {"time": 3514, "text": "And we basically took all of those and we aligned them in the same exact way that we've aligned mammals."}, {"time": 3519, "text": "And then we looked at what proteins are, which of the currently hypothesized genes for the coronavirus genome are in fact evolving like proteins and which ones are not."}, {"time": 3530, "text": "And what we found is that ORF10, the last little open reading frame, the last little gene in the genome is bogus."}, {"time": 3536, "text": "That's not a protein at all."}, {"time": 3539, "text": "It's an RNA structure."}, {"time": 3541, "text": "That doesn't have a."}, {"time": 3543, "text": "It doesn't get translated into amino acids."}, {"time": 3545, "text": "And that, so it's important to narrow down to basically discover what's useful and what's not."}, {"time": 3551, "text": "Basically, what is even the set of genes?"}, {"time": 3553, "text": "The other thing that these evolutionary signatures showed is that within ORF3A lies a tiny little additional gene encoded within the other gene."}, {"time": 3562, "text": "So you can translate a DNA sequence in three different reading frames."}, {"time": 3566, "text": "If you start in the first one, it's ATG, et cetera."}, {"time": 3570, "text": "If you start on the second one, it's TGC, et cetera."}, {"time": 3572, "text": "And there's a gene within a gene."}, {"time": 3576, "text": "So there's a whole other protein that we didn't know about that might be super important."}, {"time": 3581, "text": "So we don't even know the building blocks of SARS COVID 2."}, {"time": 3585, "text": "So if we want to understand coronavirus biology and eventually find it successfully, we need to even have the set of genes and these evolutionary signatures that I developed in my PhD work."}, {"time": 3595, "text": "Are you really useful here?"}, {"time": 3596, "text": "We just recently used."}, {"time": 3597, "text": "You know what, let's run with that tangent for a little bit, if it's okay."}, {"time": 3601, "text": "Can we talk about the COVID 19 a little bit more?"}, {"time": 3608, "text": "What's your sense about the genome, the proteins, the functions that we understand about COVID 19?"}, {"time": 3616, "text": "Where do we stand in your sense?"}, {"time": 3618, "text": "What are the big open problems?"}, {"time": 3621, "text": "And also, you kind of said it's important to understand what are the important proteins and why is that important?"}, {"time": 3634, "text": "So what else does the comparison of these species tell us?"}, {"time": 3639, "text": "What it tells us is how fast are things evolving?"}, {"time": 3643, "text": "It tells us about at what level is the acceleration or deceleration pedal set for every one of these proteins."}, {"time": 3650, "text": "So the genome has 30 some genes."}, {"time": 3654, "text": "Some genes evolve super, super fast."}, {"time": 3656, "text": "Others evolve super, super slow."}, {"time": 3659, "text": "If you look at the polymerase gene that basically replicates the genome, that's a super slow evolving one."}, {"time": 3664, "text": "If you look at the nucleocapsid protein, that's also super slow evolving."}, {"time": 3669, "text": "If you look at the spike one protein, this is the part of the spike protein that actually touches the ACE2 receptor and then enables the virus to attach to your cells."}, {"time": 3681, "text": "That's the thing that gives it that visual... Yeah, the corona look basically."}, {"time": 3684, "text": "The corona look, yeah."}, {"time": 3686, "text": "So basically the spike protein sticks out of the virus and there's a first part of the protein S1 which basically attaches to the ACE2 receptor."}, {"time": 3694, "text": "And then S2 is the latch that sort of pushes and channels the fusion of the membranes and then the incorporation of the viral RNA inside our cells which then gets translated into all of these 30 proteins."}, {"time": 3710, "text": "So the S1 protein is evolving ridiculously fast."}, {"time": 3715, "text": "So if you look at the stop versus gas pedal, the gas pedal is all the way down."}, {"time": 3722, "text": "ORF8 is also evolving super fast and ORF6 is evolving super fast."}, {"time": 3726, "text": "We have no idea what they do."}, {"time": 3728, "text": "We have some idea but nowhere near what S1 is."}, {"time": 3731, "text": "So what the..."}, {"time": 3732, "text": "Isn't that terrifying that S1 is evolving?"}, {"time": 3734, "text": "That means that's a really useful function and if it's evolving fast, doesn't that mean new strains could be created or it does something?"}, {"time": 3741, "text": "That means that it's searching for how to match, how to best match the host."}, {"time": 3746, "text": "So basically anything in general in evolution, if you look at genomes, anything that's contacting the environment is evolving much faster than anything that's internal."}, {"time": 3754, "text": "And the reason is that the environment changes."}, {"time": 3757, "text": "So if you look at the evolution of the cervical viruses, the S1 protein has evolved very rapidly because it's attaching to different hosts each time."}, {"time": 3767, "text": "We think of them as bats, but there's thousands of species of bats and to go from one species of bat to another species of bat, you have to adjust S1 to the new ACE2 receptor that you're gonna be facing in that new species."}, {"time": 3778, "text": "Sorry, quick tangent."}, {"time": 3779, "text": "Is it fascinating to you that viruses are doing this?"}, {"time": 3783, "text": "I mean, it feels like they're this intelligent organism."}, {"time": 3786, "text": "I mean, does it give you pause how incredible it is that the evolutionary dynamics that you're describing is actually happening and they're freaking out, figuring out how to jump from bats to humans all in this distributed fashion?"}, {"time": 3804, "text": "And then most of us don't even say they're alive or intelligent or whatever."}, {"time": 3807, "text": "So intelligence is in the eye of the beholder."}, {"time": 3811, "text": "Stupid is as stupid does, as Forrest Gump would say, and intelligent is as intelligent does."}, {"time": 3816, "text": "So basically if the virus is finding solutions that we think of as intelligent, yeah, it's probably intelligent, but that's again in the eye of the beholder."}, {"time": 3823, "text": "Do you think viruses are intelligent?"}, {"time": 3825, "text": "Oh, of course not."}, {"time": 3829, "text": "It's so incredible."}, {"time": 3830, "text": "So remember when I was talking about the two components of evolution, one is the stupid mutation, which is completely blind, and the other one is the super smart selection, which is ruthless."}, {"time": 3841, "text": "So it's not viruses who are smart."}, {"time": 3844, "text": "It's this component of evolution that's smart."}, {"time": 3846, "text": "So it's evolution that sort of appears smart."}, {"time": 3850, "text": "And how is that happening?"}, {"time": 3852, "text": "By huge parallel search across thousands of parallel of parallel infections throughout the world right now."}, {"time": 3861, "text": "Yes, but so to push back on that, so yes, so then the intelligence is in the mechanism, but then by that argument, viruses would be more intelligent because there's just more of them."}, {"time": 3874, "text": "So the search, they're basically the brute force search that's happening with viruses because there's so many more of them than humans, then they're taken as a whole are more intelligent."}, {"time": 3887, "text": "I mean, so you don't think it's possible that, I mean, who runs, would we even be here if viruses weren't, I mean, who runs this thing?"}, {"time": 3898, "text": "So humans or viruses?"}, {"time": 3899, "text": "So let me answer, yeah, let me answer your question."}, {"time": 3903, "text": "So we would not be here if it wasn't for viruses."}, {"time": 3910, "text": "And part of the reason is that if you look at mammalian evolution early on in this mammalian radiation that basically happened after the death of the dinosaurs is that some of the viruses that we had in our genome spread throughout our genome and created binding sites for new classes of regulatory proteins."}, {"time": 3930, "text": "And these binding sites that landed all over our genome are now control elements that basically control our genes and sort of help the complexity of the circuitry of mammalian genomes."}, {"time": 3942, "text": "So, you know, everything's coevolution."}, {"time": 3945, "text": "That's fascinating, we're working together."}, {"time": 3947, "text": "And yet you say they're dumb."}, {"time": 3948, "text": "We've coopted them."}, {"time": 3949, "text": "No, I never said they're dumb."}, {"time": 3951, "text": "They just don't care."}, {"time": 3953, "text": "They don't care."}, {"time": 3954, "text": "Another thing, oh, is the virus trying to kill us?"}, {"time": 3958, "text": "The virus is not trying to kill you."}, {"time": 3959, "text": "It's actually actively trying to not kill you."}, {"time": 3962, "text": "So when you get infected, if you die, bomber, I killed him, is what the reaction of the virus will be."}, {"time": 3969, "text": "Because that virus won't spread."}, {"time": 3972, "text": "Many people have a misconception of, oh, viruses are smart or oh, viruses are mean."}, {"time": 3978, "text": "It's like, you have to clean yourself of any kind of anthropomorphism out there."}, {"time": 3984, "text": "So there's a sense when taken as a whole that there's..."}, {"time": 3991, "text": "It's in the eye of the beholder."}, {"time": 3992, "text": "Stupid is as stupid does."}, {"time": 3994, "text": "Intelligent is as intelligent does."}, {"time": 3995, "text": "So if you want to call them intelligent, that's fine."}, {"time": 3998, "text": "Because the end result is that they're finding amazing solutions."}, {"time": 4002, "text": "I mean, I am in awe."}, {"time": 4004, "text": "They're so dumb about it."}, {"time": 4005, "text": "They're just doing dumb."}, {"time": 4007, "text": "They're not dumb and they're just don't care."}, {"time": 4010, "text": "The care word is really interesting."}, {"time": 4011, "text": "I mean, there could be an argument that they're conscious."}, {"time": 4014, "text": "They're just dividing."}, {"time": 4017, "text": "They're just a little entity which happens to be dividing and spreading."}, {"time": 4022, "text": "It just doesn't want to kill us."}, {"time": 4024, "text": "In fact, it prefers not to kill us."}, {"time": 4026, "text": "It just wants to spread."}, {"time": 4027, "text": "And when I say wants, again, I'm anthropomorphizing, but it's just that if you have two versions of a virus, one acquires a mutation that spreads more, that's going to spread more."}, {"time": 4038, "text": "One acquires a mutation that spreads less, that's going to be lost."}, {"time": 4041, "text": "One acquires a mutation that enters faster, that's going to be kept."}, {"time": 4045, "text": "One acquires a mutation that kills you right away, it's going to be lost."}, {"time": 4048, "text": "So over evolutionary time, the viruses that spread super well but don't kill the host are the ones that are going to survive."}, {"time": 4056, "text": "Yeah, but so you brilliantly described the basic mechanisms of how it all happens, but when you zoom out and you see the entirety of viruses, maybe across different strains of viruses, it seems like a living organism."}, {"time": 4072, "text": "I am in awe of biology."}, {"time": 4075, "text": "I find biology amazingly beautiful."}, {"time": 4078, "text": "I find the design of the current coronavirus, however lethal it is, amazingly beautiful."}, {"time": 4084, "text": "The way that it is encoded, the way that it tricks your cells into making 30 proteins from a single RNA."}, {"time": 4092, "text": "Human cells don't do that."}, {"time": 4094, "text": "Human cells make one protein from each RNA molecule."}, {"time": 4098, "text": "They don't make two, they make one."}, {"time": 4100, "text": "We are hardwired to make only one protein from every RNA molecule."}, {"time": 4103, "text": "And yet this virus goes in, throws in a single messenger RNA."}, {"time": 4108, "text": "Just like any messenger RNA, we have tens of thousands of messenger RNAs in our cells in any one time."}, {"time": 4114, "text": "In every one of our cells."}, {"time": 4115, "text": "It throws in one RNA and that RNA is so, I'm gonna use your word here, not my word, intelligent."}, {"time": 4124, "text": "That it hijacks the entire machinery of your human cell."}, {"time": 4129, "text": "It basically has at the beginning, a giant open reading frame."}, {"time": 4134, "text": "That's a giant protein that gets translated."}, {"time": 4137, "text": "Two thirds of that RNA make a single giant protein."}, {"time": 4141, "text": "That single protein is basically what a human cell would make."}, {"time": 4144, "text": "It's like, oh, here's a start code."}, {"time": 4146, "text": "I'm gonna start translating here."}, {"time": 4147, "text": "Human cells are kind of dumb."}, {"time": 4149, "text": "Again, this is not the words I would normally use."}, {"time": 4152, "text": "But the human cell basically says, oh, this is an RNA, must be mine."}, {"time": 4155, "text": "Let me translate."}, {"time": 4155, "text": "And it starts translating it."}, {"time": 4157, "text": "And then you're in trouble."}, {"time": 4159, "text": "Because that one protein as it's growing, gets cleaved into about 20 different peptides."}, {"time": 4166, "text": "The first peptide and the second peptide start interacting and the third one and the fourth one."}, {"time": 4172, "text": "And they shut off the ribosome of the whole cell to not translate human RNAs anymore."}, {"time": 4182, "text": "So the virus basically hijacks your cells and it cuts, it cleaves every one of your human RNAs to basically say to the ribosome, don't translate this one, junk."}, {"time": 4193, "text": "Don't look at this one, junk."}, {"time": 4195, "text": "And it only spares its own RNAs because they have a particular mark that it spares."}, {"time": 4201, "text": "Then all of the ribosomes that normally make protein in your human cells are now only able to translate viral RNAs."}, {"time": 4209, "text": "And then more and more and more and more of them."}, {"time": 4211, "text": "That's the first 20 proteins."}, {"time": 4213, "text": "In fact, halfway down about protein 11, between 11 and 12, you basically have a translational slippage where the ribosome skips reading frame."}, {"time": 4223, "text": "And it translates from one reading frame to another reading frame."}, {"time": 4225, "text": "That means that about half of them are gonna be translated from one to 11."}, {"time": 4229, "text": "And the other half are gonna be translated from 12 to 16."}, {"time": 4234, "text": "And then you're done."}, {"time": 4237, "text": "Then that mRNA will never translate the last 10 proteins but spike is the one right after that one."}, {"time": 4242, "text": "So how does spike even get translated?"}, {"time": 4245, "text": "This positive strand RNA virus has a reverse transcriptase which is an RNA based reverse transcriptase."}, {"time": 4252, "text": "So from the RNA on the positive strand, it makes an RNA on the negative strand."}, {"time": 4256, "text": "And in between every single one of these genes, these open reading frames, there's a little signal AACGCA or something like that, that basically loops over to the beginning of the RNA."}, {"time": 4269, "text": "And basically instead of sort of having a single full negative strand RNA, it basically has a partial negative strand RNA that ends right before the beginning of that gene."}, {"time": 4279, "text": "And another one that ends right before the beginning of that gene."}, {"time": 4281, "text": "These negative strand RNAs now make positive strand RNAs that then look to the human whole cell just like any other human mRNA."}, {"time": 4289, "text": "It's like, ooh, great, I'm gonna translate that one because it doesn't have the cleaving that the virus has now put on all your human genes."}, {"time": 4296, "text": "And then you've lost the battle."}, {"time": 4298, "text": "That cell is now only making proteins for the virus that will then create the spike protein, the envelope protein, the membrane protein, the nucleocapsid protein that will package up the RNA and then sort of create new viral envelopes."}, {"time": 4313, "text": "And these will then be secreted out of that cell in new little packages that will then infect the rest of the cells."}, {"time": 4320, "text": "Repeat the whole process again."}, {"time": 4321, "text": "It's beautiful, right?"}, {"time": 4323, "text": "It's mind boggling."}, {"time": 4324, "text": "It's hard not to anthropomorphize it."}, {"time": 4325, "text": "I know, but it's so gorgeous."}, {"time": 4328, "text": "So there is a beauty to it."}, {"time": 4332, "text": "Is it terrifying to you?"}, {"time": 4333, "text": "So this is something that has happened throughout history."}, {"time": 4336, "text": "Humans have been nearly wiped out over and over and over again, and yet never fully wiped out."}, {"time": 4343, "text": "So yeah, I'm not concerned about the human race."}, {"time": 4345, "text": "I'm not even concerned about the impact on sort of our survival as a species."}, {"time": 4353, "text": "This is absolutely something, I mean, human life is so invaluable and every one of us is so invaluable, but if you think of it as sort of, is this the end of our species?"}, {"time": 4364, "text": "By no means, basically."}, {"time": 4366, "text": "So let me explain."}, {"time": 4368, "text": "The Black Death killed what, 30% of Europe?"}, {"time": 4371, "text": "That has left a tremendous imprint, a huge hole, a horrendous hole in the genetic makeup of humans."}, {"time": 4383, "text": "There's been series of wiping out of huge fractions of entire species or just entire species altogether."}, {"time": 4392, "text": "And that has a consequence on the human immune repertoire."}, {"time": 4397, "text": "If you look at how Europe was shaped and how Africa was shaped by malaria, for example, all the individuals that carry a mutation that protects you from malaria were able to survive much more."}, {"time": 4411, "text": "And if you look at the frequency of sickle cell disease and the frequency of malaria, the maps are actually showing the same pattern, the same imprint on Africa."}, {"time": 4420, "text": "And that basically led people to hypothesize that the reason why sickle cell disease is so much more frequent is because sickle cell disease is so much more frequent in Americans of African descent is because there was selection in Africa against malaria leading to sickle cell, because when the cells sickle, malaria is not able to replicate inside your cells as well."}, {"time": 4441, "text": "And therefore you protect against that."}, {"time": 4443, "text": "So if you look at human disease, all of the genetic associations that we do with human disease, you basically see the imprint of these waves of selection killing off gazillions of humans."}, {"time": 4458, "text": "And there's so many immune processes that are coming up as associated with so many different diseases."}, {"time": 4465, "text": "The reason for that is similar to what I was describing earlier, where the outward facing proteins evolve much more rapidly because the environment is always changing."}, {"time": 4475, "text": "But what's really interesting in the human genome is that we have coopted many of these immune genes to carry out nonimmune functions."}, {"time": 4482, "text": "For example, in our brain, we use immune cells to cleave off neuronal connections that don't get used."}, {"time": 4490, "text": "This whole use it or lose it, we know the mechanism."}, {"time": 4492, "text": "It's microglia that cleave off neuronal synaptic connections that are just not utilized."}, {"time": 4499, "text": "When you utilize them, you mark them in a particular way that basically when the microglia come, tell it, don't kill this one, it's used now."}, {"time": 4507, "text": "And the microglia will go off and kill the ones you don't use."}, {"time": 4510, "text": "This is an immune function, which is coopted to do nonimmune things."}, {"time": 4514, "text": "If you look at our adipocytes, M1 versus M2 macrophages inside our fat will basically determine whether you're obese or not."}, {"time": 4522, "text": "And these are again, immune cells that are resident and living within these tissues."}, {"time": 4527, "text": "So many disease associations."}, {"time": 4530, "text": "That's it, that we coopt these kinds of things for incredibly complicated functions."}, {"time": 4536, "text": "Exactly, evolution works in so many different ways, which are all beautiful and mysterious."}, {"time": 4541, "text": "But not intelligent."}, {"time": 4543, "text": "Not intelligent, it's in the eye of the beholder."}, {"time": 4545, "text": "But the point that I'm trying to make is that if you look at the imprint that COVID will have, hopefully it will not be big."}, {"time": 4555, "text": "Hopefully the US will get attacked together and stop the virus from spreading further."}, {"time": 4560, "text": "But if it doesn't, it's having an imprint on individuals who have particular genetic repertoires."}, {"time": 4567, "text": "So if you look at now the genetic associations of blood type and immune function cells, et cetera, there's actually association, genetic variation that basically says how much more likely am I or you to die if we contact the virus."}, {"time": 4580, "text": "And it's through these rounds of shaping the human genome that humans have basically made it so far."}, {"time": 4587, "text": "And selection is ruthless and it's brutal and it only comes with a lot of killing."}, {"time": 4594, "text": "But this is the way that viruses and environments have shaped the human genome."}, {"time": 4599, "text": "Basically, when you go through periods of famine, you select for particular genes."}, {"time": 4603, "text": "And what's left is not necessarily better, it's just whatever survived."}, {"time": 4609, "text": "And it might have been the surviving one back then, not because it was better, maybe the ones that ran slower survived."}, {"time": 4614, "text": "I mean, again, not necessarily better, but the surviving ones are basically the ones that then are shaped for any kind of subsequent evolutionary condition and environmental condition."}, {"time": 4627, "text": "But if you look at, for example, obesity, obesity was selected for basically the genes that now predisposes to obesity were at 2% frequency in Africa."}, {"time": 4636, "text": "They rose to 44% frequency in Europe."}, {"time": 4639, "text": "Wow, that's fascinating."}, {"time": 4640, "text": "Because you basically went through the ice ages and there was a scarcity of food."}, {"time": 4644, "text": "So there was a selection to being able to store every single calorie you consume."}, {"time": 4649, "text": "Eventually, environment changes."}, {"time": 4651, "text": "So the better allele, which was the fat storing allele, became the worst allele because it's the fat storing allele."}, {"time": 4658, "text": "It still has the same function."}, {"time": 4660, "text": "So if you look at my genome, speaking of mom calling, mom gave me a bad copy of that gene, this FTO locus."}, {"time": 4668, "text": "Basically, makes me."}, {"time": 4669, "text": "The one that has to do with."}, {"time": 4670, "text": "Obesity."}, {"time": 4671, "text": "With obesity."}, {"time": 4672, "text": "Yeah, I basically now have a bad copy from mom that makes me more likely to be obese."}, {"time": 4676, "text": "And I also have a bad copy from dad that makes me more likely to be obese."}, {"time": 4680, "text": "So homozygous."}, {"time": 4681, "text": "And that's the allele, it's still the minor allele, but it's at 44% frequency in Southeast Asia, 42% frequency in Europe, even though it started at 2%."}, {"time": 4692, "text": "It was an awesome allele to have 100 years ago."}, {"time": 4696, "text": "Right now, it's pretty terrible allele."}, {"time": 4697, "text": "So the other concept is that diversity matters."}, {"time": 4701, "text": "If we had 100 million nuclear physicists living the earth right now, we'd be in trouble."}, {"time": 4708, "text": "You need diversity, you need artists and you need musicians and you need mathematicians and you need politicians, yes, even those."}, {"time": 4717, "text": "And you need like."}, {"time": 4717, "text": "Well, let's not get crazy."}, {"time": 4719, "text": "But because then if a virus comes along or whatever."}, {"time": 4724, "text": "So, no, there's two reasons."}, {"time": 4725, "text": "Number one, you want diversity in the immune repertoire and we have built in diversity."}, {"time": 4730, "text": "So basically, they are the most diverse."}, {"time": 4733, "text": "Basically, if you look at our immune system, there's layers and layers of diversity."}, {"time": 4737, "text": "Like the way that you create your cells generates diversity because of the selection for the VDJ recombination that basically eventually leads to a huge number of repertoires."}, {"time": 4748, "text": "But that's only one small component of diversity."}, {"time": 4750, "text": "The blood type is another one."}, {"time": 4751, "text": "The major histocompatibility complex, the HLA alleles are another source of diversity."}, {"time": 4758, "text": "So the immune system of humans is by nature, incredibly diverse and that basically leads to resilience."}, {"time": 4765, "text": "So basically what I'm saying that I don't worry for the human species because we are so diverse immunologically, we are likely to be very resilient against so many different attacks like this current virus."}, {"time": 4779, "text": "So you're saying natural pandemics may not be something that you're really afraid of because of the diversity in our genetic makeup."}, {"time": 4788, "text": "What about engineered pandemics?"}, {"time": 4790, "text": "Do you have fears of us messing with the makeup of viruses or well, yeah, let's say with the makeup of viruses to create something that we can't control and would be much more destructive than it would come about naturally?"}, {"time": 4805, "text": "Remember how we were talking about how smart evolution is?"}, {"time": 4808, "text": "Humans are much dumber."}, {"time": 4810, "text": "You mean like human scientists, engineers?"}, {"time": 4811, "text": "Yeah, humans, humans just like."}, {"time": 4813, "text": "Humans overall?"}, {"time": 4814, "text": "Yeah, humans overall."}, {"time": 4815, "text": "But I mean, even the sort of synthetic biologists you know, basically if you were to create, you know, virus like SARS that will kill a lot of people, you would probably start with SARS."}, {"time": 4832, "text": "So whoever, you know, would like to design such a thing would basically start with a SARS tree or at least some relative of SARS."}, {"time": 4842, "text": "The source genome for the current virus was something completely different."}, {"time": 4847, "text": "It was something that has never infected anyone and never infected humans."}, {"time": 4850, "text": "No one in their right mind would have started there."}, {"time": 4852, "text": "But when you say sources like the nearest."}, {"time": 4855, "text": "The nearest relative."}, {"time": 4856, "text": "Relative."}, {"time": 4857, "text": "Is in a whole other branch."}, {"time": 4859, "text": "No species of which has ever infected humans in that branch."}, {"time": 4862, "text": "So, you know, let's put this to rest."}, {"time": 4865, "text": "This was not designed by someone to kill off the human race."}, {"time": 4868, "text": "So you don't believe it was engineered?"}, {"time": 4872, "text": "Or likely."}, {"time": 4873, "text": "Yeah, the path to engineering a deadly virus did not come from this strain that was used."}, {"time": 4881, "text": "Moreover, there's been various claims of, ha ha, this was mixed and matched in lab because the S1 protein has three different components, each of which has a different evolutionary tree."}, {"time": 4894, "text": "So, you know, a lot of popular press basically said, aha, this came from pangolin and this came from, you know, all kinds of other species."}, {"time": 4902, "text": "This is what has been happening throughout the coronavirus tree."}, {"time": 4906, "text": "So basically the S1 protein has been recombining across species all the time."}, {"time": 4910, "text": "Remember when I was talking about the positive strand, the negative strand, sub genomic RNAs, these can actually recombine."}, {"time": 4915, "text": "And if you have two different viruses infecting the same cell, they can actually mix and match between the positive strand and the negative strand and basically create a new hybrid virus with recombination that now has the S1 from one and the rest of the genome from another."}, {"time": 4928, "text": "And this is something that happens a lot in S1, in Orfet, et cetera."}, {"time": 4932, "text": "And that's something that's true of the whole tree."}, {"time": 4933, "text": "For the whole family of viruses."}, {"time": 4935, "text": "So it's not like someone has been messing with this for millions of years and, you know, changing."}, {"time": 4940, "text": "This happens naturally."}, {"time": 4941, "text": "That's, again, beautiful that that somehow happens, that they recombine."}, {"time": 4945, "text": "So two different strands can infect the body and then recombine."}, {"time": 4950, "text": "So all of this actually magic happens inside hosts."}, {"time": 4955, "text": "Like all, like."}, {"time": 4956, "text": "Yeah, that's why classification wise, virus is not thought to be alive because it doesn't self replicate."}, {"time": 4961, "text": "It's not autonomous."}, {"time": 4963, "text": "It's something that enters a living cell and then co ops it to basically make it its own."}, {"time": 4968, "text": "But by itself, people ask me, how do we kill this bastard?"}, {"time": 4971, "text": "I'm like, you stop it from replicating."}, {"time": 4974, "text": "It's not like a bacterium that will just live in a, you know, puddle or something."}, {"time": 4981, "text": "It's a virus."}, {"time": 4982, "text": "Viruses don't live without their host."}, {"time": 4984, "text": "And they only live with their host for very little time."}, {"time": 4987, "text": "So if you stop it from replicating, it'll stop from spreading."}, {"time": 4991, "text": "I mean, it's not like HIV, which can stay dormant for a long time."}, {"time": 4994, "text": "Basically, coronaviruses just don't do that."}, {"time": 4995, "text": "They're not integrating genomes."}, {"time": 4996, "text": "They're RNA genomes."}, {"time": 4998, "text": "So if it's not expressed, it degrades."}, {"time": 5000, "text": "RNA degrades."}, {"time": 5001, "text": "It doesn't just stick around."}, {"time": 5003, "text": "Well, let me ask also about the immune system you mentioned."}, {"time": 5007, "text": "A lot of people kind of ask, you know, how can we strengthen the immune system to respond to this particular virus, but the viruses in general."}, {"time": 5017, "text": "Do you have from a biological perspective, thoughts on what we can do as humans to strengthen our immune system?"}, {"time": 5023, "text": "If you look at the death rates across different countries, people with less vaccination have been dying more."}, {"time": 5029, "text": "If you look at North Italy, the vaccination rates are abysmal there."}, {"time": 5033, "text": "And a lot of people have been dying."}, {"time": 5035, "text": "If you look at Greece, very good vaccination rates."}, {"time": 5038, "text": "Almost no one has been dying."}, {"time": 5040, "text": "So yes, there's a policy component."}, {"time": 5043, "text": "So Italy reacted very slowly."}, {"time": 5045, "text": "Greece reacted very fast."}, {"time": 5047, "text": "So yeah, many fewer people died in Greece, but there might actually be a component of genetic immune repertoire."}, {"time": 5054, "text": "Basically, how did people die off, you know, in the history of the Greek population versus the Italian population."}, {"time": 5060, "text": "There's a... That's interesting to think about."}, {"time": 5064, "text": "And then there's a component of what vaccinations did you have as a kid and what are the off target effects of those vaccinations?"}, {"time": 5072, "text": "So basically a vaccination can have two components."}, {"time": 5074, "text": "One is training your immune system against that specific insult."}, {"time": 5079, "text": "The second one is boosting up your immune system for all kinds of other things."}, {"time": 5084, "text": "If you look at allergies, Northern Europe, super clean environments, tons of allergies."}, {"time": 5091, "text": "Southern Europe, my kids grew up eating dirt."}, {"time": 5094, "text": "No allergies."}, {"time": 5097, "text": "So growing up, I never had even heard of what allergies are."}, {"time": 5100, "text": "Like, was it really allergies?"}, {"time": 5101, "text": "And the reason is that I was playing in the garden."}, {"time": 5103, "text": "I was putting all kinds of stuff in my mouth from, you know, all kinds of dirt and stuff, tons of viruses there, tons of bacteria there."}, {"time": 5109, "text": "You know, my immune system was built up."}, {"time": 5111, "text": "So the more you protect your immune system from exposure, the less opportunity it has to learn about non self repertoire in a way that prepares it for the next insult."}, {"time": 5124, "text": "So that's the horizontal thing too, like the, so it's throughout your lifetime and the lifetime of the people that, your ancestors, that kind of thing."}, {"time": 5134, "text": "What about the..."}, {"time": 5135, "text": "So again, it returns against free will."}, {"time": 5137, "text": "On the free will side of things, is there something we could do to strengthen our immune system in 2020?"}, {"time": 5144, "text": "Is there like, you know, exercise, diet, all that kind of stuff?"}, {"time": 5150, "text": "So it's kind of funny."}, {"time": 5152, "text": "There's a cartoon that basically shows two windows with a teller in each window."}, {"time": 5158, "text": "One has a humongous line and the other one has no one."}, {"time": 5162, "text": "The one that has no one above says health."}, {"time": 5164, "text": "No, it says exercise and diet."}, {"time": 5167, "text": "And the other one says pill."}, {"time": 5170, "text": "And there's a huge line for pill."}, {"time": 5172, "text": "So we're looking basically for magic bullets for sort of ways that we can, you know, beat cancer and beat coronavirus and beat this and beat that."}, {"time": 5179, "text": "And it turns out that the window with like, just diet and exercise is the best way to boost every aspect of your health."}, {"time": 5186, "text": "If you look at Alzheimer's, exercise and nutrition."}, {"time": 5191, "text": "I mean, you're like, really?"}, {"time": 5192, "text": "For my brain, neurodegeneration?"}, {"time": 5196, "text": "If you look at cancer, exercise and nutrition."}, {"time": 5200, "text": "If you look at coronavirus, exercise and nutrition, every single aspect of human health gets improved."}, {"time": 5207, "text": "And one of the studies we're doing now is basically looking at what are the effects of diet and exercise?"}, {"time": 5212, "text": "How similar are they to each other?"}, {"time": 5215, "text": "We basically take in diet intervention and exercise intervention in human and in mice."}, {"time": 5221, "text": "And we're basically doing single cell profiling of a bunch of different tissues to basically understand how are the cells, both the stromal cells and the immune cells of each of these tissues responding to the effect of exercise."}, {"time": 5235, "text": "What are the communication networks between different cells?"}, {"time": 5238, "text": "Where the muscle that exercises sends signals through the bloodstream, through the lymphatic system, through all kinds of other systems that give signals to other cells that I have exercised and you should change in this particular way, which basically reconfigure those receptor cells with the effect of exercise."}, {"time": 5259, "text": "How well understood is those reconfigurations?"}, {"time": 5264, "text": "We're just starting now, basically."}, {"time": 5266, "text": "Is the hope there to understand the effect on, so like the effect on the immune system?"}, {"time": 5274, "text": "On the immune system, the effect on brain, the effect on your liver, on your digestive system, on your adipocytes?"}, {"time": 5280, "text": "Adipose, the most misunderstood organ."}, {"time": 5283, "text": "Everybody thinks, oh, fat, terrible."}, {"time": 5285, "text": "No, fat is awesome."}, {"time": 5287, "text": "Your fat cells is what's keeping you alive because if you didn't have your fat cells, all those lipids and all those calories would be floating around in your blood and you'd be dead by now."}, {"time": 5296, "text": "Your adipocytes are your best friend."}, {"time": 5298, "text": "They're basically storing all these excess calories so that they don't hurt all of the rest of the body."}, {"time": 5304, "text": "And they're also fat burning in many ways."}, {"time": 5337, "text": "And the fat burning fat cells are your best friend."}, {"time": 5338, "text": "They're much closer to muscle than they are to white adipocytes."}, {"time": 5342, "text": "Is there a lot of difference between people that you could give, science could eventually give advice that is very generalizable or is our differences in our genetic makeup, like you mentioned, is that going to be basically something we have to be very specialized individuals, any advice we give in terms of diet, like what we were just talking about?"}, {"time": 5365, "text": "Believe it or not, the most personalized advice that you give for nutrition don't have to do with your genome."}, {"time": 5371, "text": "They have to do with your gut microbiome, with the bacteria that live inside you."}, {"time": 5375, "text": "So most of your digestion is actually happening by species that are not human inside you."}, {"time": 5380, "text": "You have more nonhuman cells than you have human cells."}, {"time": 5383, "text": "You're basically a giant bag of bacteria with a few human cells along."}, {"time": 5388, "text": "And those do not necessarily have to do with your genetic makeup."}, {"time": 5394, "text": "They interact with your genetic makeup."}, {"time": 5396, "text": "They interact with your epigenome."}, {"time": 5398, "text": "They interact with your nutrition."}, {"time": 5399, "text": "They interact with your environment."}, {"time": 5401, "text": "They're basically an additional source of variation."}, {"time": 5407, "text": "So when you're thinking about sort of personalized nutritional advice, part of that is actually how do you match your microbiome?"}, {"time": 5413, "text": "And part of that is how do we match your genetics?"}, {"time": 5417, "text": "But again, this is a very diverse set of contributors."}, {"time": 5422, "text": "And the effect sizes are not enormous."}, {"time": 5424, "text": "So I think the science for that is not fully developed yet."}, {"time": 5427, "text": "Speaking of diets, because I've wrestled in combat sports, but sports my whole life were weight matters."}, {"time": 5432, "text": "So you have to cut and all that stuff."}, {"time": 5435, "text": "One thing I've learned a lot about my body, and it seems to be, I think, true about other people's bodies, is that you can adjust to a lot of things."}, {"time": 5445, "text": "That's the miraculous thing about this biological system, is like I fast often."}, {"time": 5452, "text": "I used to eat like five, six times a day and thought that was absolutely necessary."}, {"time": 5457, "text": "How could you not eat that often?"}, {"time": 5458, "text": "And then when I started fasting, your body adjusted to that."}, {"time": 5462, "text": "And you learn how to not eat."}, {"time": 5464, "text": "And it was, if you just give it a chance for a few weeks, actually, over a period of a few weeks, your body can adjust to anything."}, {"time": 5471, "text": "And that's a miraculous, that's such a beautiful thing."}, {"time": 5474, "text": "So I'm a computer scientist, and I've basically gone through periods of 24 hours without eating or stopping."}, {"time": 5479, "text": "And then I'm like, oh, must eat."}, {"time": 5482, "text": "And I eat a ton."}, {"time": 5483, "text": "I used to order two pizzas just with my brother."}, {"time": 5487, "text": "So I've gone through these extremes as well, and I've gone the whole intermittent fasting thing."}, {"time": 5492, "text": "So I can sympathize with you both on the seven meals a day to the zero meals a day."}, {"time": 5497, "text": "So I think when I say everything with moderation, I actually think your body responds interestingly to these different changes in diet."}, {"time": 5507, "text": "I think part of the reason why we lose weight with pretty much every kind of change in behavior is because our epigenome and the set of proteins and enzymes that are expressed and our microbiome are not well suited to that nutritional source."}, {"time": 5522, "text": "And therefore, they will not be able to sort of catch everything that you give them."}, {"time": 5526, "text": "And then a lot of that will go undigested."}, {"time": 5529, "text": "And that basically means that your body can then lose weight in the short term, but very quickly will adjust to that new normal."}, {"time": 5536, "text": "And then we'll be able to sort of perhaps gain a lot of weight from the diet."}, {"time": 5540, "text": "So anyway, I mean, there's also studies in factories where basically people dim the lights and then suddenly everybody started working better."}, {"time": 5548, "text": "It was like, wow, that's amazing."}, {"time": 5550, "text": "Three weeks later, they made the lights a little brighter."}, {"time": 5552, "text": "Everybody started working better."}, {"time": 5554, "text": "So any kind of intervention has a placebo effect of, wow, now I'm healthier and I'm gonna be running more often, et cetera."}, {"time": 5562, "text": "So it's very hard to uncouple the placebo effect of, wow, I'm doing something to intervene on my diet from the, wow, this is actually the right thing for me."}, {"time": 5602, "text": "I wanna jump into the whole placebo effect for a little bit here."}, {"time": 5605, "text": "And basically talk about the implications of that."}, {"time": 5610, "text": "If I give you a sugar pill and I tell you it's a sugar pill, you won't get any better."}, {"time": 5615, "text": "But if I tell you a sugar pill and I tell you, wow, this is an amazing drug, it actually will stop your cancer, your cancer will actually stop with much higher probability."}, {"time": 5627, "text": "That's so amazing."}, {"time": 5627, "text": "That means that if I can trick your brain into thinking that I'm healing you, your brain will basically figure out a way to heal itself, to heal the body."}, {"time": 5635, "text": "And that tells us that there's so much that we don't understand in the interplay between our cognition and our biology, that if we were able to better harvest the power of our brain to sort of impact the body through the placebo effect, we would be so much better in so many different things."}, {"time": 5657, "text": "Just by tricking yourself into thinking that you're doing better, you're actually doing better."}, {"time": 5661, "text": "So there's something to be said about sort of positive thinking, about optimism, about sort of just getting your brain and your mind into the right mindset that helps your body and helps your entire biology."}, {"time": 5676, "text": "Yeah, from a science perspective, that's just fascinating."}, {"time": 5679, "text": "Obviously most things about the brain is a total mystery for now, but that's a fascinating interplay that the brain can help cure cancer."}, {"time": 5694, "text": "I don't even know what to do with that."}, {"time": 5695, "text": "I mean, the way to think about that is the following."}, {"time": 5699, "text": "The converse of the equation is something that we are much more comfortable with."}, {"time": 5703, "text": "Like, oh, if you're stressed, then your heart rate might rise and all kinds of sort of toxins might be released and that can have a detrimental effect in your body, et cetera, et cetera, et cetera."}, {"time": 5714, "text": "So maybe it's easier to understand your body healing from your mind by your mind is not killing your body, or at least it's killing it less."}, {"time": 5724, "text": "So I think that aspect of the stress equation is a little easier for most of us to conceptualize, but then the healing part is perhaps the same pathways, perhaps different pathways, but again, something that is totally untapped scientifically."}, {"time": 5739, "text": "I think we try to bring this question up a couple of times, but let's return to it again, is what do you think is the difference between the way a computer represents information, the human genome represents and stores information?"}, {"time": 5753, "text": "And maybe broadly, what is the difference between how you think about computers and how you think about biological systems?"}, {"time": 5760, "text": "So I made a very provocative claim earlier that we are a digital computer."}, {"time": 5764, "text": "Like I said, at the core lies a digital code and that's true in many ways, but surrounding that digital core, there's a huge amount of analog."}, {"time": 5771, "text": "If you look at our brain, it's not really digital."}, {"time": 5773, "text": "If you look at our sort of RNA and all of that stuff inside our cell, it's not really digital."}, {"time": 5778, "text": "It's really analog in many ways, but let's start with the code and then we'll expand to the rest."}, {"time": 5784, "text": "So the code itself is digital."}, {"time": 5787, "text": "So there's genes."}, {"time": 5788, "text": "You can think of the genes as, I don't know, the procedures, the functions inside your language."}, {"time": 5793, "text": "And then somehow you have to turn these functions on."}, {"time": 5796, "text": "How do you call a gene?"}, {"time": 5797, "text": "How do you call that function?"}, {"time": 5799, "text": "The way that you would do it in old programming languages is go to address whatever in your memory and then you'd start running from there."}, {"time": 5806, "text": "And modern programming languages have encapsulated this into functions and objects and all of that."}, {"time": 5812, "text": "And it's nice and cute, but in the end, deep down, there's still an assembly code that says go to that instruction and it runs that instruction."}, {"time": 5819, "text": "If you look at the human genome and the genome of pretty much most species out there, there's no go to function."}, {"time": 5828, "text": "You just don't start transcribing in position 13,000, 13,527 in chromosome 12."}, {"time": 5838, "text": "You instead have content based indexing."}, {"time": 5841, "text": "So at every location in the genome, in front of the genes that need to be turned on, I don't know, when you drink coffee, there's a little coffee marker in front of all of them."}, {"time": 5854, "text": "And whenever your cells that metabolize coffee need to metabolize coffee, they basically see coffee and they're like, ooh, let's go turn on all the coffee marked genes."}, {"time": 5864, "text": "So there's basically these small motifs, these small sequences that we call regulatory motifs."}, {"time": 5870, "text": "They're like patterns of DNA."}, {"time": 5872, "text": "They're only eight characters long or so, like GAT, GCA, et cetera."}, {"time": 5925, "text": "So the beauty of the way that the digital computer that's the genome works is that it's extremely fault tolerant."}, {"time": 5937, "text": "If I took your hard drive and I messed with 20% of the letters in it, of the zeros and ones and I flipped them, you'd be in trouble."}, {"time": 5947, "text": "If I take the genome and I flipped 20% of the letters, you probably won't even notice."}, {"time": 5953, "text": "And that resilience."}, {"time": 5955, "text": "That's fascinating, yeah."}, {"time": 5956, "text": "Is a key design principle."}, {"time": 5958, "text": "And again, I'm anthropomorphizing here, but it's a key driving principle of how biological systems work."}, {"time": 5964, "text": "They're first resilient and then anything else."}, {"time": 5967, "text": "And when you look at this incredible beauty of life from the most, I don't know, beautiful, I don't know, human genome maybe of humanity and all of the ideals that should come with it to the most terrifying genome, like, I don't know, COVID 19, SARS COVID 2 and the current pandemic, you basically see this elegance as the epitome of clean design, but it's dirty."}, {"time": 5995, "text": "It's a mess."}, {"time": 5997, "text": "It's, you know, the way to get there is hugely messy."}, {"time": 6002, "text": "And that's something that we as computer scientists don't embrace."}, {"time": 6006, "text": "We like to have clean code."}, {"time": 6008, "text": "You know, like in engineering, they teach you about compartmentalization, about sort of separating functions, about modularity, about hierarchical design."}, {"time": 6017, "text": "None of that applies in biology."}, {"time": 6019, "text": "Testing."}, {"time": 6019, "text": "Testing, sure."}, {"time": 6022, "text": "Yeah, biology does plenty of that."}, {"time": 6024, "text": "But I mean, through evolutionary exploration."}, {"time": 6026, "text": "But if you look at biological systems, first they are robust and then they specialize to become anything else."}, {"time": 6036, "text": "And if you look at viruses, the reason why they're so elegant when you look at the design of this, you know, genome, it seems so elegant."}, {"time": 6046, "text": "And the reason for that is that it's been stripped down from something much larger because of the pressure to keep it compact."}, {"time": 6053, "text": "So many compact genomes out there have ancestors that were much larger."}, {"time": 6058, "text": "You don't start small and become big."}, {"time": 6060, "text": "You go through a loop of add a bunch of stuff, increase complexity, and then, you know, slim it down."}, {"time": 6067, "text": "And one of my early papers was in fact on genome duplication."}, {"time": 6072, "text": "One of the things we found is that baker's yeast, which is the, you know, yeast that you use to make bread, but also the yeast that you use to make wine, which is basically the dominant species when you go in the fields of Tuscany and you say, you know, what's out there, it's basically saccharomyces cerevisiae, or the way my Italian friends say, saccharomyces cerevisiae."}, {"time": 6093, "text": "Oh, which means what?"}, {"time": 6094, "text": "Oh, saccharomyces, okay, I'm sorry, I'm Greek."}, {"time": 6096, "text": "So yeah, zacharo, mikis, zacharo is sugar, mikis is fungus."}, {"time": 6101, "text": "Yes, cerevisiae, cerveza, beer."}, {"time": 6104, "text": "So it means the sugar fungus of beer."}, {"time": 6108, "text": "You know, less, less sounding to the ear."}, {"time": 6111, "text": "Still poetic, yeah."}, {"time": 6112, "text": "So anyway, saccharomyces cerevisiae, basically the major baker's yeast out there is the descendant of a whole genome duplication."}, {"time": 6120, "text": "Why would a whole gene duplication even happen?"}, {"time": 6122, "text": "When it happened is coinciding with about a hundred million years ago and the emergence of fruit bearing plants."}, {"time": 6134, "text": "Why fruit bearing plants?"}, {"time": 6135, "text": "Because animals would eat the fruit and would walk around and poop huge amounts of nutrients along with a seed for the plants to spread."}, {"time": 6146, "text": "Before that, plants were not spreading through animals, they were spreading through wind and all kinds of other ways."}, {"time": 6152, "text": "But basically the moment you have fruit bearing plants, these plants are basically creating this abundance of sugar in the environment."}, {"time": 6160, "text": "So there's an evolutionary niche that gets created."}, {"time": 6162, "text": "And in that evolutionary niche, you basically have enough sugar that a whole genome duplication, which initially is a very messy event, allows you to then, you know, relieve some of that complexity."}, {"time": 6176, "text": "So I had to pause, what does genome duplication mean?"}, {"time": 6179, "text": "That basically means that instead of having eight chromosomes, you can now have 16 chromosomes."}, {"time": 6186, "text": "So, but the duplication at first, when you go to 16, you're not using that."}, {"time": 6193, "text": "Oh yeah, you are."}, {"time": 6195, "text": "Yeah, so basically from one day to the next, you went from having eight chromosomes to having 16 chromosomes."}, {"time": 6200, "text": "Probably a non disjunction event during a duplication, during a division."}, {"time": 6204, "text": "So you basically divide the cell instead of half the genome going this way and half the genome going the other way after duplication of the genome, you basically have all of it going to one cell and then there's sufficient messiness there that you end up with slight differences that make most of these chromosomes be actually preserved."}, {"time": 6222, "text": "It's a long story short to me."}, {"time": 6223, "text": "But that's a big upgrade, right?"}, {"time": 6225, "text": "So that's... Not necessarily, because what happens immediately thereafter is that you start massively losing tons of those duplicated genes."}, {"time": 6232, "text": "So 90% of those genes were actually lost very rapidly after whole gene duplication."}, {"time": 6238, "text": "And the reason for that is that biology is not intelligent, it's just ruthless selection, random mutation."}, {"time": 6246, "text": "So the ruthless selection basically means that as soon as one of the random mutations hit one gene, ruthless selection just kills off that gene."}, {"time": 6253, "text": "It's just, if you have a pressure to maintain a small compact genome, you will very rapidly lose the second copy of most of your genes and a small number 10% were kept in two copies."}, {"time": 6265, "text": "And those had to do a lot with environment adaptation, with the speed of replication, with the speed of translation and with sugar processing."}, {"time": 6274, "text": "So I'm making a long story short to basically say that evolution is messy."}, {"time": 6278, "text": "The only way... Like, so the example that I was giving of messing with 20% of your bits in your computer, totally bogus."}, {"time": 6287, "text": "Duplicating all your functions and just throwing them out there in the same function, just totally bogus."}, {"time": 6292, "text": "Like this would never work in an engineer system."}, {"time": 6295, "text": "But biological systems, because of this content based indexing and because of this modularity that comes from the fact that the gene is controlled by a series of tags."}, {"time": 6305, "text": "And now if you need this gene in another setting, you just add some more tags that will basically turn it on also in those settings."}, {"time": 6312, "text": "So this gene is now pressured to do two different functions and it builds up complexity."}, {"time": 6319, "text": "I see a whole gene duplication and gene duplication in general as a way to relieve that complexity."}, {"time": 6324, "text": "So you have this gradual buildup of complexity as functions get sort of added onto the existing genes."}, {"time": 6330, "text": "And then boom, you duplicate your workforce."}, {"time": 6334, "text": "And you now have two copies of this gene."}, {"time": 6336, "text": "One will probably specialize to do one and the other one will specialize to do the other or one will maintain the ancestral function."}, {"time": 6342, "text": "The other one will sort of be free to evolve and specialize while losing the ancestral function and so on and so forth."}, {"time": 6348, "text": "So that's how genomes evolve."}, {"time": 6349, "text": "They're just messy things, but they're extremely fault tolerant and they're extremely able to deal with mutations because that's the very way that you generate new functions."}, {"time": 6363, "text": "So new functionalization comes from the very thing that breaks it."}, {"time": 6367, "text": "So even in the current pandemic, many people are asking me which mutations matter the most."}, {"time": 6372, "text": "And what I tell them is, well, we can study the evolutionary dynamics of the current genome to then understand which mutations have previously happened or not."}, {"time": 6383, "text": "And which mutations happen in genes that evolve rapidly or not."}, {"time": 6388, "text": "And one of the things we found, for example, is that the genes that evolved rapidly in the past are still evolving rapidly now in the current pandemic."}, {"time": 6396, "text": "The genes that evolved slowly in the past are still evolving slowly."}, {"time": 6400, "text": "Which means that they're useful?"}, {"time": 6401, "text": "Which means that they're under the same evolutionary pressures."}, {"time": 6405, "text": "But then the question is what happens in specific mutations?"}, {"time": 6409, "text": "So if you look at the D614 gene mutations, that's been all over the news."}, {"time": 6413, "text": "So in position 614, in the amino acids 614 of the S protein, there's a D2 gene mutation that sort of has creeped over the population."}, {"time": 6427, "text": "That mutation, we found out through my work, disrupts a perfectly conserved nucleotide position that has never been changed in the history of millions of years of equivalent per million evolution of these viruses."}, {"time": 6443, "text": "That basically means that it's a completely new adaptation to human."}, {"time": 6447, "text": "And that mutation has now gone from 1% frequency to 90% frequency in almost all outbreaks."}, {"time": 6453, "text": "So this mutation, I like how you say the 416, what was it, okay."}, {"time": 6459, "text": "Yeah, 614, sorry."}, {"time": 6460, "text": "614."}, {"time": 6461, "text": "D614G."}, {"time": 6463, "text": "D614, so literally, so what you're saying is this is like a chess move."}, {"time": 6468, "text": "So it just mutated one letter to another."}, {"time": 6471, "text": "And that hasn't happened before."}, {"time": 6473, "text": "Yeah, never."}, {"time": 6474, "text": "And this somehow, this mutation is really useful."}, {"time": 6478, "text": "It's really useful in the current environment of the genome, which is moving from human to human."}, {"time": 6484, "text": "When it was moving from bat to bat, it couldn't care less for that mutation, but it's environment specific."}, {"time": 6489, "text": "So now that it's moving from human to human, it's moving way better, like by orders of magnitude."}, {"time": 6495, "text": "What do you, okay, so you're like tracking this evolutionary dynamics, which is fascinating, but what do you do with that?"}, {"time": 6505, "text": "What does this mean, what do you make, what do you make of this mutation in trying to anticipate, I guess, is one of the things you're trying to do is anticipate where, how this unrolls into the future, this evolutionary dynamics."}, {"time": 6519, "text": "Such a great question."}, {"time": 6520, "text": "So there's two things."}, {"time": 6522, "text": "Remember when I was saying earlier, mutation is the path to new things, but also the path to break old things."}, {"time": 6529, "text": "So what we know is that this position was extremely preserved through gazillions of mutations."}, {"time": 6536, "text": "That mutation was never tolerated when it was moving from bats to bats."}, {"time": 6540, "text": "So that basically means that that position is extremely important in the function of that protein."}, {"time": 6545, "text": "That's the first thing it tells."}, {"time": 6546, "text": "The second one is that that position was very well suited to bat transmission, but now is not well suited to human transmission, so it got rid of it."}, {"time": 6555, "text": "And it now has a new version of that amino acid that basically makes it much easier to transmit from human to human."}, {"time": 6562, "text": "So in terms of the evolutionary history teaching us about the future, it basically tells us here's the regions that are currently mutating."}, {"time": 6574, "text": "Here's the regions that are most likely to mutate going forward."}, {"time": 6577, "text": "As you're building a vaccine, here's what you should be focusing on in terms of the most stable regions that are the least likely to mutate."}, {"time": 6585, "text": "Or here's the newly evolved functions that are the most likely to be important because they've overcome this local maximum that it had reached in the bat transmission."}, {"time": 6599, "text": "So anyway, it's a tangent to basically say that evolution works in messy ways."}, {"time": 6604, "text": "And the thing that you would break is the thing that actually allows you to first go through a lull and then reaching new local maximum."}, {"time": 6615, "text": "And I often like to say that if engineers had basically designed evolution, we would still be perfectly replicating bacteria because it's my making the bacterium worse that you allow evolution to reach a new optimum."}, {"time": 6632, "text": "That's, just to pause on that, that's so profound."}, {"time": 6635, "text": "That's so profound for the entirety of this scientific and engineering disciplines."}, {"time": 6645, "text": "We as engineers need to embrace breaking things."}, {"time": 6648, "text": "We as engineers need to embrace robustness as the first principle beyond perfection because nothing's gonna ever be perfect."}, {"time": 6656, "text": "And when you're sending a satellite to Mars, when something goes wrong, it'll break down."}, {"time": 6661, "text": "As opposed to building systems that tolerate failure and are resilient to that."}, {"time": 6668, "text": "And in fact, get better through that."}, {"time": 6671, "text": "So the SpaceX approach versus NASA for the... For example."}, {"time": 6676, "text": "Is there something we can learn about the incredible, take lessons from the incredible biological systems in their resilience, in the mushiness, the messiness to our computing systems, to our computers?"}, {"time": 6691, "text": "It would basically be starting from scratch in many ways."}, {"time": 6695, "text": "It would basically be building new paradigms that don't try to get the right answer all the time, but try to get the right answer most of the time or a lot of the time."}, {"time": 6707, "text": "Do you see deep learning systems in the whole world of machine learning as kind of taking a step in that direction?"}, {"time": 6713, "text": "Basically by allowing this much more natural evolution of these parameters, you basically... And if you look at sort of deep learning systems again, they're not inspired by the genome aspect of biology, they're inspired by the brain aspect of biology."}, {"time": 6730, "text": "And again, I want you to pause for a second and realize the complexity of the entire human brain with trillions of connections within our neurons, with millions of cells talking to each other, is still encoded within that same genome."}, {"time": 6749, "text": "That same genome encodes every single freaking cell type of the entire body."}, {"time": 6757, "text": "Every single cell is encoded by the same code."}, {"time": 6761, "text": "And yet specialization allows you to have the single viral like genome that self replicates, the single module, modular automaton, work with other copies of itself, it's mind boggling."}, {"time": 6777, "text": "Create complex organs through which blood flows."}, {"time": 6781, "text": "And what is that blood?"}, {"time": 6782, "text": "The same freaking genome."}, {"time": 6785, "text": "Create organs that communicate with each other."}, {"time": 6789, "text": "And what are these organs?"}, {"time": 6791, "text": "The exact same genome."}, {"time": 6793, "text": "Create a brain that is innervated by massive amounts of blood pumping energy to it, 20% of our energetic needs to the brain from the same genome."}, {"time": 6808, "text": "And all of the neuronal connections, all of the auxiliary cells, all of the immune cells, the astrocytes, the ligodendrocytes, the neurons, the excitatory, the inhibitory neurons, all of the different classes of parasites, the blood brain barrier, all of that, same genome."}, {"time": 6822, "text": "One way to see that in a sad, this one is beautiful."}, {"time": 6827, "text": "The sad thing is thinking about the trillions of organisms that died to create that."}, {"time": 6835, "text": "You mean on the evolutionary path to humans?"}, {"time": 6837, "text": "On the evolutionary path to humans."}, {"time": 6839, "text": "It's crazy, there's two descendant of apes just talking on a podcast."}, {"time": 6844, "text": "Okay, it's just so mind boggling."}, {"time": 6848, "text": "Just to boggle our minds a little bit more."}, {"time": 6851, "text": "Us talking to each other, we are basically generating a series of vocal utterances through our pulsating of vocal cords received through this."}, {"time": 6863, "text": "The people who listen to this are taking a completely different path to that information transfer, yet through language."}, {"time": 6872, "text": "But imagine if we could connect these brains directly to each other."}, {"time": 6878, "text": "The amount of information that I'm condensing into a small number of words is a huge funnel, which then you receive and you expand into a huge number of thoughts from that small funnel."}, {"time": 6895, "text": "In many ways, engineers would love to have the whole information transfer, just take the whole set of neurons and throw them away."}, {"time": 6902, "text": "I mean, throw them to the other person."}, {"time": 6905, "text": "This might actually not be better because in your misinterpretation of every word that I'm saying, you are creating new interpretation that might actually be way better than what I meant in the first place."}, {"time": 6917, "text": "The ambiguity of language perhaps might be the secret to creativity."}, {"time": 6925, "text": "Every single time you work on a project by yourself, you only bounce ideas with one person and your neurons are basically fully cognizant of what these ideas are."}, {"time": 6935, "text": "But the moment you interact with another person, the misinterpretations that happen might be the most creative part of the process."}, {"time": 6943, "text": "With my students, every time we have a research meeting, I very often pause and say, let me repeat what you just said in a different way."}, {"time": 6950, "text": "And I sort of go on and brainstorm with what they were saying, but by the third time, it's not what they were saying at all."}, {"time": 6958, "text": "And when they pick up what I'm saying, they're like, oh, well, dah, dah, dah."}, {"time": 6961, "text": "Now they've sort of learned something very different from what I was saying."}, {"time": 6965, "text": "And that is the same kind of messiness that I'm describing in the genome itself."}, {"time": 6970, "text": "It's sort of embracing the messiness."}, {"time": 6973, "text": "And that's a feature, not a book."}, {"time": 6976, "text": "And in the same way, when you're thinking about sort of these deep learning systems that will allow us to sort of be more creative perhaps or learn better approximations of these complex functions, again, tuned to the universe that we inhabit, you have to embrace the breaking."}, {"time": 6993, "text": "You have to embrace the, how do we get out of these local optima?"}, {"time": 6998, "text": "And a lot of the design paradigms that have made deep learning so successful are ways to get away from that, ways to get better training by sort of sending long range messages, these LSTM models and the sort of feed forward loops that sort of jump through layers of a convolutional neural network."}, {"time": 7020, "text": "All of these things are basically ways to push you out of these local maxima."}, {"time": 7027, "text": "And that's sort of what evolution does."}, {"time": 7028, "text": "That's what language does."}, {"time": 7029, "text": "That's what conversation and brainstorming does."}, {"time": 7032, "text": "That's what our brain does."}, {"time": 7034, "text": "So this design paradigm is something that's pervasive and yet not taught in schools, not taught in engineering schools where everything's minutely modularized to make sure that we never deviate from whatever signal we're trying to emit as opposed to let all hell breaks loose because that's the path to paradise."}, {"time": 7054, "text": "The path to paradise."}, {"time": 7055, "text": "Yeah, I mean, it's difficult to know how to teach that and what to do with it."}, {"time": 7059, "text": "I mean, it's difficult to know how to build up the scientific method around messiness."}, {"time": 7066, "text": "I mean, it's not all messiness."}, {"time": 7069, "text": "We need some cleanness."}, {"time": 7071, "text": "And going back to the example with Mars, that's probably the place where I want to sort of moderate error as much as possible and sort of control the environment as much as possible."}, {"time": 7081, "text": "But if you're trying to repopulate Mars, well, maybe messiness is a good thing then."}, {"time": 7085, "text": "On that, you quickly mentioned this in terms of us using our vocal cords to speak on a podcast."}, {"time": 7095, "text": "So Elon Musk and Neuralink are working on trying to plug, as per our discussion with computers and biological systems, to connect the two."}, {"time": 7105, "text": "He's trying to connect our brain to a computer to create a brain computer interface where they can communicate back and forth."}, {"time": 7116, "text": "On this line of thinking, do you think this is possible to bridge the gap between our engineered computing systems and the messy biological systems?"}, {"time": 7129, "text": "My answer would be absolutely."}, {"time": 7131, "text": "You know, there's no doubt that we can understand more and more about what goes on in the brain and we can sort of train the brain."}, {"time": 7140, "text": "I don't know if you remember the Palm Pilot."}, {"time": 7143, "text": "Yeah, Palm Pilot, yeah."}, {"time": 7144, "text": "Remember this whole sort of alphabet that they had created?"}, {"time": 7148, "text": "Am I thinking of the same thing?"}, {"time": 7150, "text": "It's basically, you had a little pen and for every character, you had a little scribble that was unique that the machine could understand."}, {"time": 7159, "text": "And that instead of trying the machine and trying to teach the machine to recognize human characters, you had basically, they figured out that it's better and easier to train humans to create human like characters that the machine is better at recognizing."}, {"time": 7174, "text": "So in the same way, I think what will happen is that humans will be trained to be able to create the mind pattern that the machine will respond to before the machine truly comprehends our thoughts."}, {"time": 7187, "text": "So the first human brain interfaces will be tricking humans to speak the machine language where with the right set of electrodes, I can sort of trick my brain into doing this."}, {"time": 7197, "text": "And this is the same way that many people teach, like learn to control artificial limbs."}, {"time": 7202, "text": "You basically try a bunch of stuff and eventually you figure out how your limbs work."}, {"time": 7206, "text": "That might not be very different from how humans learn to use their natural limbs when they first grow up."}, {"time": 7213, "text": "Basically, you have these, you know, neoteny period of, you know, this puddle of soup inside your brain, trying to figure out how to even make neural connections before you're born and then learning sounds in utero of, you know, all kinds of echoes and, you know, eventually getting out in the real world."}, {"time": 7235, "text": "And I don't know if you've seen newborns, but they just stare around a lot."}, {"time": 7239, "text": "You know, one way to think about this as a machine learning person is, oh, they're just training their edge detectors."}, {"time": 7246, "text": "And eventually they figure out how to train their edge detectors."}, {"time": 7248, "text": "They work through the second layer of the visual cortex and the third layer and so on and so forth."}, {"time": 7252, "text": "And you basically have this learning how to control your limbs that probably comes at the same time."}, {"time": 7261, "text": "You're sort of, you know, throwing random things there and you realize that, oh, wow, when I do this thing, my limb moves."}, {"time": 7268, "text": "Let's do the following experiment."}, {"time": 7269, "text": "Take a breath."}, {"time": 7271, "text": "What muscles did you flex?"}, {"time": 7273, "text": "Now take another breath and think what muscles do I flex?"}, {"time": 7276, "text": "The first thing that you're thinking when you're taking a breath is the impact that it has on your lungs."}, {"time": 7282, "text": "You're like, oh, I'm now gonna increase my lungs or I'm not gonna bring air in."}, {"time": 7285, "text": "But what you're actually doing is just changing your diaphragm."}, {"time": 7289, "text": "That's not conscious, of course."}, {"time": 7291, "text": "You never think of the diaphragm as a thing."}, {"time": 7296, "text": "That's probably the same reason why I think of moving my finger when I actually move my finger."}, {"time": 7300, "text": "I think of the effect instead of actually thinking of whatever muscle is twitching that actually causes my finger to move."}, {"time": 7306, "text": "So we basically in our first years of life build up this massive lookup table between whatever neuronal firing we do and whatever action happens in our body that we control."}, {"time": 7320, "text": "If you have a kid grow up with a third limb, I'm sure they'll figure out how to control them probably at the same rate as their natural limbs."}, {"time": 7329, "text": "And a lot of the work would be done by the..."}, {"time": 7333, "text": "If a third limb is a computer, you kind of have a, not a faith, but a thought that the brain might be able to figure out..."}, {"time": 7344, "text": "The plasticity would come from the brain."}, {"time": 7346, "text": "The brain would be cleverer than the machine at first."}, {"time": 7348, "text": "When I talk about a third limb, that's exactly what I'm saying, an artificial limb that basically just controls your mouse while you're typing."}, {"time": 7355, "text": "Perfectly natural thing."}, {"time": 7356, "text": "I mean, again, in a few hundred years."}, {"time": 7360, "text": "Maybe sooner than that."}, {"time": 7361, "text": "But basically, as long as the machine is consistent in the way that it will respond to your brain impulses, you'll figure out how to control that and you could play tennis with your third limb."}, {"time": 7373, "text": "And let me go back to consistency."}, {"time": 7377, "text": "People who have dramatic accidents that basically take out a whole chunk of their brain can be taught to coopt other parts of the brain to then control that part."}, {"time": 7388, "text": "You can basically build up that tissue again and eventually train your body how to walk again and how to read again and how to play again and how to think again, how to speak a language again, et cetera."}, {"time": 7398, "text": "So there's a massive amount of malleability that happens naturally in our way of controlling our body, our brain, our thoughts, our vocal cords, our limbs, et cetera."}, {"time": 7410, "text": "And human machine interfaces are inevitable if we sort of figure out how to read these electric impulses, but the resolution at which we can understand human thought right now is nil, is ridiculous."}, {"time": 7426, "text": "So how are human thoughts encoded?"}, {"time": 7429, "text": "It's basically combinations of neurons that cofire and these create these things called engrams that eventually form memories and so on and so forth."}, {"time": 7438, "text": "We know nothing of all that stuff."}, {"time": 7441, "text": "So before we can actually read into your brain that you wanna build a program that does this and this and this and that, we need a lot of neuroscience."}, {"time": 7488, "text": "You're still off by a few orders of magnitude on the order of seven."}, {"time": 7492, "text": "Right, but the thing is, the hope is if you increase that number more and more and more, maybe you don't need to understand anything about the actual how human thought is represented in the brain."}, {"time": 7504, "text": "You can just let it figure it out by itself."}, {"time": 7508, "text": "Keanu Reeves waking up and saying, I know cook food."}, {"time": 7513, "text": "So yeah, sure."}, {"time": 7514, "text": "You don't have faith in the plasticity of the brain to that degree."}, {"time": 7518, "text": "It's not about brain plasticity."}, {"time": 7519, "text": "It's about the input aspect."}, {"time": 7521, "text": "Basically, I think on the output aspect, being able to control a machine is something that you can probably train your neural impulses that you're sending out to sort of match whatever response you see in the environment."}, {"time": 7533, "text": "If this thing moved every single time I thought a particular thought, then I could figure out, I could hack my way into moving this thing with just a series of thoughts."}, {"time": 7540, "text": "I could think guitar, piano, tennis ball, and then this thing would be moving."}, {"time": 7547, "text": "And then I would just have the series of thoughts that would sort of result in the impulses that will move this thing the way that I want it."}, {"time": 7554, "text": "And then eventually it'll become natural because I won't even think about it."}, {"time": 7557, "text": "I mean, in the same way that we control our limbs in a very natural way, but babies don't do that."}, {"time": 7561, "text": "Babies have to figure it out."}, {"time": 7563, "text": "And some of that is hard coded, but some of that is actually learned based on whatever soup of neurons you ended up with, whatever connections you pruned them to, and eventually you were born with."}, {"time": 7575, "text": "A lot of that is coded in the genome, but a huge chunk of that is stochastic."}, {"time": 7579, "text": "And sort of the way that you sort of create all these neurons, they migrate, they form connections, they sort of spread out, they have particular branching patterns, but then the connectivity itself, unique in every single new person."}, {"time": 7590, "text": "All this to say that on the output side, absolutely, I'm very, very, you know, hopeful that we can have machines that read thousands of these neuronal connections on the output side, but on the input side, oh boy."}, {"time": 7607, "text": "I don't expect any time in the near future we'll be able to sort of send a series of impulses that will tell me, oh, earth to sun distance, 7.5 million, et cetera, et cetera."}, {"time": 7618, "text": "Like nowhere."}, {"time": 7620, "text": "I mean, I think language will still be the input way rather than sort of any kind of more complex."}, {"time": 7627, "text": "It's a really interesting notion that the ambiguity of language is a feature."}, {"time": 7632, "text": "And we evolved for millions of years to take advantage of that ambiguity."}, {"time": 7640, "text": "And yet no one teaches us the subtle differences between words that are near cognates, and yet evoke so much more than, you know, one from the other."}, {"time": 7650, "text": "And yet, you know, when you're choosing words from a list of 20 synonyms, you know exactly the connotation of every single one of them."}, {"time": 7660, "text": "And that's something that, you know, is there."}, {"time": 7662, "text": "So yes, there's ambiguity, but there's all kinds of connotations."}, {"time": 7666, "text": "And in the way that we select our words, we have so much baggage that we're sending along, the way that we're emoting, the way that we're moving our hands every single time we speak, the, you know, the pauses, the eye contact, et cetera."}, {"time": 7678, "text": "So much higher baud rate than just a vocal, you know, string of characters."}, {"time": 7684, "text": "Well, let me just take a small tangent on that."}, {"time": 7687, "text": "Oh, tangent?"}, {"time": 7687, "text": "We haven't done that yet."}, {"time": 7688, "text": "It's a good idea."}, {"time": 7689, "text": "Let's do a tangent."}, {"time": 7690, "text": "We'll return to the origin of life after."}, {"time": 7696, "text": "So, I mean, you're Greek, but I'm going on this personal journey."}, {"time": 7700, "text": "I'm going to Paris for the explicit purpose of talking to one of the most famous, a couple who's a famous translators of Russian literature, Dostoevsky, Tolstoy, and they go, that's their art is the translation."}, {"time": 7718, "text": "And everything I've learned about the translation art, it makes me feel, it's so profound in a way that's so much more profound than the natural language processing papers I read in the machine learning community, that there's such depth to language that I don't know what to do with."}, {"time": 7743, "text": "I don't know if you've experienced that in your own life with knowing multiple languages."}, {"time": 7748, "text": "I don't know what to, I don't know how to make sense of it, but there's so much loss in translation between Russian and English, and getting a sense of that."}, {"time": 7757, "text": "Like, for example, there's like just taking a single sentence from Dostoevsky, and like, there's a lot of them."}, {"time": 7765, "text": "You could talk for hours about how to translate that sentence properly."}, {"time": 7770, "text": "That captures the meaning, the period, the culture, the humor, the wit, the suffering that was in the context of the time, all of that could be a single sentence."}, {"time": 7782, "text": "You could talk forever about what it takes to translate that correctly."}, {"time": 7787, "text": "I don't know what to do with that."}, {"time": 7788, "text": "So being Greek, it's very hard for me to think of a sentence or even a word without going into the full etymology of that word, breaking up every single atom of that sentence and every single atom of these words and rebuilding it back up."}, {"time": 7809, "text": "I have three kids."}, {"time": 7811, "text": "And the way that I teach them Greek is the same way that, you know, the documentary I was mentioning earlier about sort of understanding the deep roots of all of these, you know, words."}, {"time": 7823, "text": "And it's very interesting that every single time I hear a new word that I've never heard before, I go and figure out the etymology of that word because I will never appreciate that word without understanding how it was initially formed."}, {"time": 7840, "text": "Interesting, but how does that help?"}, {"time": 7842, "text": "Because that's not the full picture."}, {"time": 7844, "text": "No, no, of course, of course."}, {"time": 7844, "text": "But what I'm trying to say is that knowing the components teaches you about the context of the formation of that word and sort of the original usage of that word."}, {"time": 7854, "text": "And then of course the word takes new meaning as you create it, you know, from its parts."}, {"time": 7860, "text": "And that meaning then gets augmented."}, {"time": 7864, "text": "And two synonyms that sort of have different roots will actually have implications that carry a lot of that baggage of the historical provenance of these words."}, {"time": 7874, "text": "So before working on genome evolution, my passion was evolution of language and sort of tracing cognates across different languages through their etymologies."}, {"time": 7887, "text": "That's fascinating that there's parallels between, I mean, the idea that there's evolutionary dynamics to our language."}, {"time": 7895, "text": "Yeah, every single word that you utter, parallels, parallels."}, {"time": 7901, "text": "What does parallels mean?"}, {"time": 7902, "text": "Para means side by side."}, {"time": 7904, "text": "Alleles from alleles, which means identical twins."}, {"time": 7908, "text": "Parallels."}, {"time": 7909, "text": "I mean, name any word and there's so much baggage, so much beauty in how that word came to be and how this word took a new meaning than the sum of its parts."}, {"time": 7922, "text": "Yeah, and there's just, there's so many different words that are just words."}, {"time": 7926, "text": "They don't have any physical grounding."}, {"time": 7928, "text": "And now you take these words and you weave them into a sentence."}, {"time": 7933, "text": "The emotional invocations of that weaving are fathomless."}, {"time": 7939, "text": "And all of those emotions all live in the brains of humans."}, {"time": 7945, "text": "In the eye of the beholder."}, {"time": 7948, "text": "No, seriously, you have to embrace this concept of the eye of the beholder."}, {"time": 7952, "text": "It's the conceptualization that nothing takes meaning with one person creating it."}, {"time": 7959, "text": "Everything takes meaning in the receiving end and the emergent properties of these communication networks where every single, you know, if you look at the network of our cells and how they're communicating with each other, every cell has its own code."}, {"time": 7974, "text": "This code is modulated by the epigenome."}, {"time": 7976, "text": "This creates a bunch of different cell types."}, {"time": 7977, "text": "Each cell type now has its own identity."}, {"time": 7979, "text": "Yet they all have the common root of the stem cells that sort of led to them."}, {"time": 7984, "text": "Each of these identities is now communicating with each other."}, {"time": 7988, "text": "They take meaning in their interaction."}, {"time": 7991, "text": "There's an emergent property that comes from a bunch of cells being together that is not in any one of the parts."}, {"time": 7997, "text": "If you look at neurons communicating, again, these engrams don't exist in any one neuron."}, {"time": 8003, "text": "They exist in the connection and the combination of neurons."}, {"time": 8006, "text": "And the meaning of the words that I'm telling you is empty until it reaches you and it affects you in a very different way than it affects whoever's listening to this conversation now."}, {"time": 8017, "text": "Because of the emotional baggage that I've grown up with, that you've grown up with, and that they've grown up with."}, {"time": 8023, "text": "And that's, I think, the magic of translation."}, {"time": 8026, "text": "If you start thinking of translation as just simply capturing that emotional set of reactions that you evoke, you need a different set of words to evoke that same set of reactions to a French person than to a Russian person, because of the baggage of the culture that we grew up in."}, {"time": 8045, "text": "Yeah, I mean, there's..."}, {"time": 8047, "text": "So basically, you shouldn't find the best word."}, {"time": 8050, "text": "Sometimes it's a completely different sentence structure that you will need, matched to the cultural context of the target audience that you have."}, {"time": 8060, "text": "Yeah, there's a lot of different words in the target audience that you have."}, {"time": 8063, "text": "Yeah, it's, I mean, you're just..."}, {"time": 8066, "text": "I usually don't think about this, but right now, there's this feeling, as a reminder, that it's just you and I talking, but there's several hundred thousand people will listen to this."}, {"time": 8076, "text": "There's some guy in Russia right now running, like in Moscow, listening to us."}, {"time": 8084, "text": "There's somebody in India, I guarantee you."}, {"time": 8086, "text": "There's somebody in China and South America."}, {"time": 8088, "text": "There's somebody in Texas, they all have different..."}, {"time": 8093, "text": "Emotional baggage."}, {"time": 8094, "text": "They probably got angry earlier on about the whole discussion about coronavirus and about some aspect of it."}, {"time": 8102, "text": "Yeah, and there's that network effect that's..."}, {"time": 8106, "text": "It's a beautiful thing."}, {"time": 8108, "text": "And this lateral transfer of information, that's what makes the collective, quote unquote, genome of humanity so unique from any other species."}, {"time": 8119, "text": "So you somehow miraculously wrapped it back to the very beginning of when we were talking about the beauty of the human genome."}, {"time": 8129, "text": "So I think this is the right time, unless we wanna go for a six to eight hour conversation."}, {"time": 8134, "text": "We're gonna have to talk again, but I think for now, to wrap it up, this is the right time to talk about the biggest, most ridiculous question of all, meaning of life."}, {"time": 8145, "text": "Off mic, you mentioned to me that you had your 42nd birthday."}, {"time": 8152, "text": "42nd being a very special, absurdly special number."}, {"time": 8158, "text": "And you had a kind of get together with friends to discuss the meaning of life."}, {"time": 8164, "text": "So let me ask you, in your, as a biologist, as a computer scientist, and as a human, what is the meaning of life?"}, {"time": 8174, "text": "I've been asking this question for a long time, ever since my 42nd birthday, but well before that, in even planning the meaning of life symposium."}, {"time": 8185, "text": "And symposium, sim means together, posy actually means to drink together."}, {"time": 8191, "text": "So symposium is actually a drinking party."}, {"time": 8193, "text": "So the meaning."}, {"time": 8196, "text": "Can you actually elaborate about this meaning of life symposium that you put together?"}, {"time": 8199, "text": "It's like the most genius idea I've ever heard."}, {"time": 8202, "text": "So 42 is obviously the answer to life, the universe and everything, from the Hitchhiker's Guide to the Galaxy."}, {"time": 8207, "text": "And as I was turning 42, I've had the theme for every one of my birthdays."}, {"time": 8211, "text": "When I was turning 32, it's one, zero, zero, zero, zero, zero in binary."}, {"time": 8216, "text": "So I celebrated my 100,000th binary birthday, and I had a theme of going back 100,000 years, let's dress something in the last 100,000 years."}, {"time": 8227, "text": "Anyway, it was, I've always had these."}, {"time": 8229, "text": "It's such an interesting human being."}, {"time": 8232, "text": "Okay, that's awesome."}, {"time": 8233, "text": "I've always had these sort of numerology related announcements for my birthday parties."}, {"time": 8241, "text": "So what came out of that meaning of life symposium is that I basically asked 42 of my colleagues, 42 of my friends, 42 of my collaborators, to basically give seven minutes species on the meaning of life, each from their perspective."}, {"time": 8258, "text": "And I really encourage you to go there because it's mind boggling that every single person said a different answer."}, {"time": 8266, "text": "Every single person started with, I don't know what the meaning of life is, but, and then give this beautifully eloquently answer, eloquent answer."}, {"time": 8275, "text": "And they were all different, but they all were consistent with each other and mutually synergistic and together forming a beautiful view of what it means to be human in many ways."}, {"time": 8288, "text": "Some people talked about the loss of their loved one, their life partner for many, many years and how their life changed through that."}, {"time": 8296, "text": "Some people talked about the origin of life."}, {"time": 8299, "text": "Some people talked about the difference between purpose and meaning."}, {"time": 8304, "text": "I'll maybe quote one of the answers, which is this linguistics professor, friend of mine at Harvard, who basically said, that she was gonna, she's Greek as well."}, {"time": 8317, "text": "And she said, I will give a very Pythian answer."}, {"time": 8320, "text": "So Pythia was the Oracle of Delphi, who would basically give these very cryptic answers, very short, but interpretable in many different ways."}, {"time": 8328, "text": "There was this whole set of priests who were tasked with interpreting what Pythia had said."}, {"time": 8333, "text": "And very often you would not get a clean interpretation, but she said, I will be like Pythia and give you a very short and multiply interpretable answer."}, {"time": 8342, "text": "But unlike her, I will actually also give you three interpretations."}, {"time": 8347, "text": "And she said, the answer to the meaning of life is become one."}, {"time": 8352, "text": "And the first interpretation is like a child, become one year old with the excitement of discovering everything about the world."}, {"time": 8361, "text": "Second interpretation, in whatever you take on, become one, the first, the best, excel, drive yourself to perfection for every one of your tasks and become one when people are separate, become one, come together, learn to understand each other."}, {"time": 8383, "text": "Damn, that's an answer."}, {"time": 8385, "text": "And one way to summarize this whole meaning of life symposium is that the very symposium was illustrating the quest for meaning, which might itself be the meaning of life."}, {"time": 8398, "text": "This constant quest for something sublime, something human, something intangible, some aspect of what defines us as a species and as an individual."}, {"time": 8411, "text": "Both the quest of me as a person through my own life, but the meaning of life could also be the meaning of all of life."}, {"time": 8420, "text": "What is the whole point of life?"}, {"time": 8422, "text": "Why life?"}, {"time": 8422, "text": "Why life itself?"}, {"time": 8424, "text": "Because we've been talking about the history and evolution of life, but we haven't talked about why life in the first place?"}, {"time": 8431, "text": "Is life inevitable?"}, {"time": 8432, "text": "Is life part of physics?"}, {"time": 8435, "text": "Does life transcend physics by fighting against entropy, by compartmentalizing and increasing concentrations rather than diluting away?"}, {"time": 8445, "text": "Is life a distinct entity in the universe beyond the traditional very simple physical rules that govern gravity and electromagnetism and all of these forces?"}, {"time": 8460, "text": "Is life another force?"}, {"time": 8462, "text": "Is there a life force?"}, {"time": 8463, "text": "Is there a unique kind of set of principles that emerge, of course, built on top of the hardware of physics, but is it sort of a new layer of software or a new layer of a computer system?"}, {"time": 8474, "text": "And so that's at the level of big questions."}, {"time": 8478, "text": "There's another aspect of gratitude of basically what I like to say is, during this pandemic, I've basically worked from 6 a.m. until 7 p.m. every single day, nonstop, including Saturday and Sunday."}, {"time": 8494, "text": "I've basically broken all boundaries of where life, personal life begins and work life ends."}, {"time": 8502, "text": "And that has been exhilarating for me, just the intellectual pleasure that I get from a day of exhaustion, where at the end of the day, my brain is hurting."}, {"time": 8515, "text": "I'm telling my wife, wow, I was useful today."}, {"time": 8520, "text": "And there's a certain pleasure that comes from feeling useful."}]}]