[{"title": "Magnus Carlsen: Greatest Chess Player of All Time | Lex Fridman Podcast #315", "id": "0ZO28NtkwwQ", "quotes": [{"time": 293, "text": "Let me ask the goat question."}, {"time": 295, "text": "I'm biased because I went to high school in Chicago, Chicago Bulls during the Michael Jordan era."}, {"time": 303, "text": "Let me ask the Jordan versus LeBron James question."}, {"time": 307, "text": "Let's continue on this thread of greatness."}, {"time": 310, "text": "Which one do you pick or somebody else?"}, {"time": 313, "text": "Magic Johnson."}, {"time": 314, "text": "So I'll give you a completely different answer."}, {"time": 317, "text": "Depending on my mood and depending on whom I talk to, I pick one of the two and then I try to argue for that."}, {"time": 324, "text": "With the quantum mechanical thing."}, {"time": 325, "text": "Well, can you, what, again, what would, if you were to argue for either one, statistically, I think LeBron James is going to surpass Jordan."}, {"time": 338, "text": "Yeah, no doubt."}, {"time": 339, "text": "And so again, there's a debate between."}, {"time": 344, "text": "Unquantifiable greatness, no?"}, {"time": 346, "text": "I mean, that's the whole, that's the whole debate."}, {"time": 351, "text": "So it's, well, it's quantifiable versus unquantifiable."}, {"time": 355, "text": "And you're depending on mood all over the place."}, {"time": 359, "text": "But what do you lean in general with these folks, with soccer, with anything in life, towards the unquantifiable more?"}, {"time": 367, "text": "No, definitely towards the quantifiable."}, {"time": 370, "text": "So when you're unsure, lean towards the numbers."}, {"time": 373, "text": "But see, like, it's later generations."}, {"time": 375, "text": "There's something, that's what people say about Maradona is, you know, he took a arguably somewhat mediocre team to a World Cup."}, {"time": 385, "text": "So there's that also uplifting nature of the player to be able to rise up, it is a team sport."}, {"time": 391, "text": "So are you gonna, like, are you gonna punish Messi for taking a mediocre Argentine squad to the final in 2014 and punish him because they lost to a great team very narrowly after they missed?"}, {"time": 409, "text": "The internet does."}, {"time": 410, "text": "He set up, like, a great chance for Higuain in the first half, which he, which he fluffed."}, {"time": 417, "text": "And then, yeah, eventually they lost the game."}, {"time": 420, "text": "Yeah, they do criticize Cristiano Ronaldo, Messi for being on really strong squads in terms of the club teams and saying, yeah, okay, it's easy when you have like Ronaldinho or whoever on your team."}, {"time": 433, "text": "It would be very interesting just if the league could make a decision."}, {"time": 439, "text": "Yeah, just random, random allocation."}, {"time": 445, "text": "And just every single game, just keep reallocating or maybe once a season or every season you get random."}, {"time": 452, "text": "But let's say every, every player, if let's say they sign a five year contract for a team, like one of them, you're gonna get randomly allocated to, to let's say a bottom half team."}, {"time": 468, "text": "I bet you there's gonna be so much corruption around that."}, {"time": 470, "text": "It could be random."}, {"time": 471, "text": "Obviously it wouldn't, wouldn't ever happen or work, but I think it's interesting to think about."}, {"time": 477, "text": "So on chess, let's zoom out."}, {"time": 481, "text": "If you break down your approach to chess when you're at your best, what do you think, what do you think contributes to that approach?"}, {"time": 492, "text": "Is it memory recall, specific lines and positions?"}, {"time": 495, "text": "Is it intuition?"}, {"time": 496, "text": "How much of it is intuition?"}, {"time": 498, "text": "How much of it is pure calculation?"}, {"time": 500, "text": "How much of it is messing with the strategy of the opponent?"}, {"time": 503, "text": "So the game theory aspect in terms of what contributes to the highest level of play that you do."}, {"time": 510, "text": "I think the answer differs a little bit now from what it did eight years ago."}, {"time": 519, "text": "For instance, like I've, I feel like I've had like two peaks and in my career in 2014, well, 2013, 2014, and also in 2019."}, {"time": 530, "text": "And in those years, I was very different in terms of, of my strength, strength as specifically in 2019, I benefited a lot from opening preparation while in 2013, 2014, I mostly tried to avoid my opponent's preparation rather than that being a, being a strength."}, {"time": 559, "text": "So I'm mentioning that also because it's something, something you didn't, didn't mention."}, {"time": 566, "text": "I think like my intuitive understanding of chess has over those years always been a little bit better than the others, even though it has evolved as well."}, {"time": 581, "text": "Certainly there are, there are things that I understand now that I didn't understand back then, but that's not only for me, that's for, for others as well."}, {"time": 592, "text": "I was younger back then."}, {"time": 593, "text": "So I played with more energy, which meant that I could play better in long drawn out games, which was also a necessity for me because I didn't, I couldn't, couldn't beat people in the, in the openings."}, {"time": 609, "text": "But in terms of calculation, that's always been a weird issue for me."}, {"time": 616, "text": "Like I've always been really, really bad at solving exercises in chess."}, {"time": 622, "text": "Like that's been like a blind spot for me."}, {"time": 628, "text": "First of all, I found it hard to concentrate on them and to look, to look deep enough."}, {"time": 638, "text": "So this is like a puzzle, a position, mate in X. I mean, one thing is mate, but find the best move."}, {"time": 645, "text": "That's generally the exercise, like find the best move, find the best line."}, {"time": 649, "text": "You, you just don't connect with it."}, {"time": 652, "text": "Usually like you have to, to look, look deep."}, {"time": 654, "text": "And then when I get these lines during the game, I very often find the, the, the right solution, even though, even though it's not still the best part of my game to, to calculate very, very deeply."}, {"time": 677, "text": "But it doesn't feel like calculation you're saying in terms of."}, {"time": 680, "text": "And it does sometimes, but for me, it's more like I'm at the board trying to find, trying to find the solution."}, {"time": 687, "text": "And I understand like the training at home is like trying a little bit to, to replicate that."}, {"time": 693, "text": "Like you give somebody half an hour in a position, like in this instance, you might've thought for half an hour if you play the game, but I just, I just cannot do it."}, {"time": 704, "text": "One thing I know that I am good at though, is calculating short lines because I calculate them, them well, I'm good at seeing little details and I'm also much better than, than most at evaluating, which I think is something that sets me, sets me apart from, from others."}, {"time": 731, "text": "So evaluating specific position, if I, if I make this move and the position changes in this way, is this a step in the right direction?"}, {"time": 742, "text": "Like in a big picture way?"}, {"time": 744, "text": "Like you calculate a few moves ahead and then you evaluate because a lot of, a lot of time, a lot of the times you cannot, the branches become so big that you cannot calculate everything."}, {"time": 755, "text": "So you have to, yeah."}, {"time": 757, "text": "So you have to, you have to make evaluations based on, you know, based mostly on knowledge and intuition and somehow I seem to do that pretty well."}, {"time": 769, "text": "When you say you're good at short lines, what's that, what's, what's short?"}, {"time": 773, "text": "That's usually like lines of two to four moves each."}, {"time": 779, "text": "Okay, so that, that's directly applicable to even faster games like blitz, chess and so on."}, {"time": 784, "text": "Yeah, blitz is a lot about calculating forest lines."}, {"time": 789, "text": "So those, you can see pretty clearly that the players who struggle at blitz who are great at classical are those who rely on a deep calculating ability because you simply don't have time for that in blitz."}, {"time": 804, "text": "You have to calculate quickly and rely a lot on intuition."}, {"time": 809, "text": "Can you try to, I know it's really difficult."}, {"time": 810, "text": "Can you try to talk through what's actually being visualized in your head?"}, {"time": 816, "text": "Is there, is there a visual component?"}, {"time": 819, "text": "Yeah, no, I just visualized the board."}, {"time": 821, "text": "I mean, the board is in my head."}, {"time": 824, "text": "Two dimensional?"}, {"time": 825, "text": "My interpretation is that it is two dimensional."}, {"time": 829, "text": "Like what color is, is it brown tinted?"}, {"time": 832, "text": "Is it black?"}, {"time": 833, "text": "Is it, like what's the theme?"}, {"time": 836, "text": "Is it a big board, small board?"}, {"time": 838, "text": "Are the, what do the pawns look like?"}, {"time": 841, "text": "Or is it more in the space of concepts?"}, {"time": 845, "text": "Yeah, there aren't a lot of colors."}, {"time": 847, "text": "It's mostly, yeah."}, {"time": 851, "text": "Queen's gambit on the ceiling, whatever."}, {"time": 853, "text": "I'm trying now to imagine it."}, {"time": 856, "text": "What about when you do the branching, when you have multiple boards and so on?"}, {"time": 859, "text": "What, how does that look?"}, {"time": 860, "text": "No, but it's only one at a time."}, {"time": 862, "text": "One position at a time."}, {"time": 864, "text": "So then I go back and that's what, when, when people play, or at least that's what I do."}, {"time": 870, "text": "When I play blindfold chess against several people, then it's just always one board at a time."}, {"time": 875, "text": "And the rest are stored away somewhere."}, {"time": 879, "text": "But how do you store them away?"}, {"time": 880, "text": "So like, you went down one branch."}, {"time": 882, "text": "You're like, all right, that's, I got that."}, {"time": 885, "text": "I understand that there's some good there, there's some bad there."}, {"time": 888, "text": "Now let me go down another branch."}, {"time": 890, "text": "Like, how do you store away the information?"}, {"time": 892, "text": "You just put it on a shelf, kind of?"}, {"time": 894, "text": "I try and store it away."}, {"time": 895, "text": "Sometimes I have to sort of repeat it because I forget."}, {"time": 900, "text": "And it does happen frequently in games that you're thinking for, especially if you're thinking for a long, let's say a half an hour, or even more than that, that you play a move and then your opponent plays a move, then you play a move and they play a move again."}, {"time": 917, "text": "And you realize, oh, I actually calculated that."}, {"time": 920, "text": "I just forgot about it."}, {"time": 922, "text": "So that's obviously what happens when you store the information and you cannot retrieve it."}, {"time": 926, "text": "When you think about a move for 20, 30 minutes, like how do you break that down?"}, {"time": 932, "text": "Can you describe what, like what's the algorithm here that takes 30 minutes to run?"}, {"time": 938, "text": "30 minutes is, at least for me, it's usually a waste."}, {"time": 944, "text": "30 minutes usually means that I don't know what to do."}, {"time": 947, "text": "And I'm trying."}, {"time": 948, "text": "You're just running into the wall over and over."}, {"time": 949, "text": "Yeah, I'm trying to find something that isn't there."}, {"time": 952, "text": "I think 10 to 15 minutes things in complicated positions can be really, really helpful."}, {"time": 960, "text": "Then you can spend your time pretty efficiently."}, {"time": 965, "text": "Just means that the branches are getting wide."}, {"time": 970, "text": "There's a lot to run through, both in terms of calculation and lots you have to evaluate as well."}, {"time": 980, "text": "And then based on that 10 to 15 minute thing, you have a pretty good idea what to do."}, {"time": 989, "text": "I mean, it's very rare that I would think for half an hour and I would have a eureka moment during the game."}, {"time": 995, "text": "Like if I haven't seen it in 10 minutes, I'm probably not gonna see it at all."}, {"time": 999, "text": "You're going to different branches."}, {"time": 1002, "text": "And like after 15 minutes, it's like."}, {"time": 1003, "text": "But it mainly to the middle game, because when you get to the end game, it's usually brute force calculation that makes you spend so much time."}, {"time": 1012, "text": "So middle game is normally, it's a complicated mix of brute force calculation and like creativity and evaluation."}, {"time": 1025, "text": "So end game, it's easier in that sense."}, {"time": 1030, "text": "Well, you're good at every aspect of chess, but you're also your end game is legendary."}, {"time": 1036, "text": "It baffles experts."}, {"time": 1038, "text": "So can you linger on that then try to explain what the heck is going on there?"}, {"time": 1042, "text": "Like if you look at game six of the previous world championship, the longest game ever played in chess, it was I think his queen versus your rook knight in two pawns."}, {"time": 1058, "text": "There's so many options there."}, {"time": 1060, "text": "It's such an interesting little dance and it's kind of not obvious that it wouldn't be a draw."}, {"time": 1065, "text": "So how do you escape it not being a draw and you win that match?"}, {"time": 1069, "text": "No, I knew that for most of the time, it was a theoretical draw since chess with seven or less pieces on the board is solved."}, {"time": 1081, "text": "So you can, like people watching online, they can just check it."}, {"time": 1085, "text": "They can check and they can check a so called table base and they, it just gonna spit out win for white, win for black or draw."}, {"time": 1095, "text": "So, and also I knew that, I knew that didn't know that position specifically, but I knew that it had to be a draw."}, {"time": 1103, "text": "So for me, it was about staying alert."}, {"time": 1109, "text": "First of all, trying to look for the best way to put my pieces, but yeah, those end games are a bit, they're a bit unusual."}, {"time": 1120, "text": "They don't happen too often."}, {"time": 1123, "text": "So what I'm usually good at is I'm using my strength that I also use in middle games is that I evaluate well and I calculate short variations quite."}, {"time": 1136, "text": "Even for the end game, short variations matter?"}, {"time": 1138, "text": "Yes, it does matter in some simpler end games."}, {"time": 1141, "text": "Yeah, but also like there are these theoretical end games with very few pieces like rook knights and two pawns versus Queens, but a lot of end games are simply defined by the Queens being exchanged and there are a lot of other pieces left and then it's usually not brute force."}, {"time": 1161, "text": "It's usually more of understanding and evaluation and then I can use my strengths very well."}, {"time": 1170, "text": "Why are you so damn good at the end game?"}, {"time": 1172, "text": "Isn't there a lot of moves from when the end game starts to when the end game finishes and you have a few pieces and you have to figure out, it's like a sequence of little games that happens, right?"}, {"time": 1183, "text": "Like little pattern."}, {"time": 1184, "text": "Like how does it being able to evaluate a single position lead you to evaluate a long sequence of positions that eventually lead to a checkmate?"}, {"time": 1193, "text": "Well, I think if you evaluate well at the start, you know what plans to go for and then usually the play from there is often pretty simple."}, {"time": 1204, "text": "Let's say you understand how to arrange your pieces and often also how to arrange your pawns early in the end game then that makes all the difference and after that is like what we call technique very often that it's technique basically just means that the moves are simple and these are moves that a lot of players could make not only the very strongest ones."}, {"time": 1242, "text": "These are moves that are kind of understood and known."}, {"time": 1245, "text": "So with the evaluation, you're just constantly improving a little bit and that just leads to suffocating the position and then eventually to the win as long as you're doing the evaluation well, one step at a time."}, {"time": 1257, "text": "Also, yeah, I said like if you evaluate it better and thus accumulated some small advantages then you can often make your life pretty easy towards the end of the end game."}, {"time": 1272, "text": "So you said in 2019 sort of the second phase of why you're so damn good."}, {"time": 1278, "text": "You did a lot of opening preparation."}, {"time": 1281, "text": "What's the goal for you of the opening game of chess?"}, {"time": 1286, "text": "Is it to throw the opponent off from any prepared lines?"}, {"time": 1291, "text": "Is there something you could put into words about why you're so damn good at the openings?"}, {"time": 1295, "text": "Again, these things have changed a lot over time."}, {"time": 1300, "text": "Back in Kasparov's days, for instance, he very often got huge advantages from the opening as white."}, {"time": 1309, "text": "Can you explain why?"}, {"time": 1311, "text": "There were several reasons for that."}, {"time": 1314, "text": "First of all, he worked harder."}, {"time": 1316, "text": "He was more creative in finding ideas."}, {"time": 1319, "text": "He was able to look places others didn't."}, {"time": 1323, "text": "Also, he had a very strong team of people who had specific strengths in openings that he could use."}, {"time": 1331, "text": "So they would come up with ideas and he would integrate those ideas into... Yeah, and he would also very often come up with them himself."}, {"time": 1339, "text": "Also, at the start, he had some of the first computer engines to work for him to find his ideas, to look deeper, to verify his ideas."}, {"time": 1354, "text": "He was better at using them than a lot of others."}, {"time": 1359, "text": "Now, I feel like the playing field is a lot more level."}, {"time": 1364, "text": "There are both computer engines, neural networks, and hybrid engines available to practically anybody."}, {"time": 1373, "text": "So it's much harder to find ideas now that actually give you an advantage with the white pieces."}, {"time": 1385, "text": "I mean, people don't expect to find those ideas anymore."}, {"time": 1388, "text": "Now it's all about finding ideas that are missed by the engines."}, {"time": 1395, "text": "Either they're missed entirely or they're missed at low depth and using them to gain some advantage in the sense that you have more knowledge."}, {"time": 1408, "text": "And it's also good to know that usually these are not complete bluffs, these are like semi bluffs so that you know that even if your opponent makes all the right moves, you can still make a draw."}, {"time": 1423, "text": "And also at the start of 2019, neural networks had just started to be a thing in chess."}, {"time": 1430, "text": "And I'm not entirely sure, but there were at least some players even in the top events who you could see did not use them or did not use them in the right way."}, {"time": 1442, "text": "And then you could gain a huge advantage because a lot of positions, they were being evaluated differently by the neural networks than traditional chess engines because they simply think about chess in a very, very different way."}, {"time": 1458, "text": "So short answer is these days, it's all about surprising your opponent and taking it into positions where you have more knowledge."}, {"time": 1469, "text": "So is there some sense in which it's okay to make suboptimal quote unquote moves?"}, {"time": 1476, "text": "I mean, you have to because the best moves have been analyzed to death mostly."}, {"time": 1482, "text": "So that's a kind of, when you say semi bluff, that's a kind of sacrifice."}, {"time": 1486, "text": "You're sacrificing the optimal move, the optimal position so that you can take the opponent."}, {"time": 1493, "text": "I mean, that's a game theoretic sense."}, {"time": 1495, "text": "You take the opponent to something they didn't prepare well."}, {"time": 1499, "text": "Yeah, but you could also look at it another way that regardless, like if you turn on whatever engine you turn on, like if you try to analyze either from the starting position or the starting position of some popular opening, like if you analyze long enough, it's always gonna end up in a draw."}, {"time": 1519, "text": "So in that sense, you may not be going for like the objective, the tries that are objectively the most difficult to draw against, but you are trying to look at least at the less obvious paths."}, {"time": 1535, "text": "How much do you use engines?"}, {"time": 1537, "text": "Do you use Leela, Stockfish in your preparations?"}, {"time": 1541, "text": "My team does."}, {"time": 1543, "text": "Personally, I try not to use them too much on my own because I know that when I play, you obviously cannot have help from engines."}, {"time": 1554, "text": "And often I feel like often having imperfect or knowledge about a position or some engine knowledge can be a lot worse than having no knowledge."}, {"time": 1569, "text": "So I try to look at engines as little as possible."}, {"time": 1573, "text": "So yeah, so your team uses them for research for a generation of ideas."}, {"time": 1578, "text": "But you are relying primarily on your human resources."}, {"time": 1584, "text": "You can evaluate well."}, {"time": 1586, "text": "You don't lean."}, {"time": 1586, "text": "Yeah, I can evaluate as a human."}, {"time": 1589, "text": "I can know what they find unpleasant and so on."}, {"time": 1593, "text": "And it's very often the case for me to some extent, but a lot for others that you arrive in a position and your opponent plays a move that you didn't expect and if you didn't expect it, you know that it's probably not a great move since it hasn't been expected by the engine."}, {"time": 1614, "text": "But if it's not obvious why it's not a good move, it's usually very, very hard to figure it out."}, {"time": 1623, "text": "And so then looking at the engines doesn't necessarily help because at that point, like you're facing a human, you have to sort of think as a human."}, {"time": 1634, "text": "I was chatting with Demis Ashabis, CEO of DeepMind a couple of days ago and he asked me to ask you about what you first felt when you saw the play of AlphaZero."}, {"time": 1644, "text": "Like interesting ideas in your creativity."}, {"time": 1648, "text": "Did you feel fear that the machine is taking over?"}, {"time": 1651, "text": "Were you inspired?"}, {"time": 1654, "text": "And what was going on in your mind and heart?"}, {"time": 1657, "text": "Funny thing about Demis is he doesn't play chess at all like an AI, he plays in a very, very human way."}, {"time": 1668, "text": "No, I was hugely inspired when I saw the games at first."}, {"time": 1674, "text": "And in terms of man versus machine, I mean that battle was kind of lost for humans even before I entered top level chess."}, {"time": 1687, "text": "So that's never been an issue for me."}, {"time": 1690, "text": "I never liked playing against computers much anyway."}, {"time": 1694, "text": "So that's completely fine."}, {"time": 1696, "text": "But it was amazing to see how they quote unquote thought about chess in such a different way and in a way that you could mistake for creativity."}, {"time": 1707, "text": "Mistake for creativity, strong words."}, {"time": 1710, "text": "Is it wild to you how many sacrifices it's willing to make that like sacrifice pieces and then wait for prolonged periods of time before doing anything with that?"}, {"time": 1718, "text": "Is that weird to you that that's part of chess?"}, {"time": 1722, "text": "No, it's one of the things that's hardest to replicate as a human as well, or at least for my playing style that usually when I sacrifice, I feel like I'm, I don't do it unless I feel like I'm getting something like tangible in return and."}, {"time": 1743, "text": "Like a few moves down the line."}, {"time": 1745, "text": "A few moves down the line, you can see that you can either retrieve the material or you can put your opponent's king under pressure or have some very like very concrete positional advantage that sort of compensates for it."}, {"time": 1760, "text": "For instance, in chess, so bishops and knights are fairly equivalent."}, {"time": 1766, "text": "We both give them three points, but bishops are a little bit better."}, {"time": 1770, "text": "And especially a bishop pair is a lot better than a bishop and a knight."}, {"time": 1776, "text": "So, or especially two knights depends on the position, but like on average they are."}, {"time": 1784, "text": "So like sacrificing a pawn in order to get a bishop pair, that's one of the most common sacrifices in chess."}, {"time": 1792, "text": "Oh, you're okay making that sacrifice?"}, {"time": 1793, "text": "Yeah, I mean, it depends on the situation, but generally that's fine."}, {"time": 1797, "text": "And there are a lot of openings that are based on that, that you sacrifice a pawn for the bishop pair, and then eventually it's some sort of positional equality."}, {"time": 1808, "text": "But the way AlphaZero would sacrifice a knight or sometimes two pawns, three pawns, and you could see that it's looking for some sort of positional domination, but it's hard to understand."}, {"time": 1824, "text": "And it was really fascinating to see."}, {"time": 1827, "text": "Yeah, in 2019, I was sacrificing a lot of pawns, especially, and it was a great joy."}, {"time": 1836, "text": "Unfortunately, it's not so easy to continue to do that."}, {"time": 1840, "text": "People have found more solid opening lines since that don't allow me to do that as often."}, {"time": 1848, "text": "I'm still trying both to get those positions and still trying to learn the art of sacrificing pieces."}, {"time": 1856, "text": "So Demis also made a comment that was interesting to my new chess brain, which is one of the reasons that chess is fun is because of the, quote, creative tension between the bishop and the knight."}, {"time": 1869, "text": "So you're talking about this interesting difference between the two pieces, that there's some kind of, how would you convert that?"}, {"time": 1877, "text": "I mean, that's like a poetic statement about chess."}, {"time": 1880, "text": "I think he said that, why has chess been played for such a long time?"}, {"time": 1884, "text": "Why is it so fun to play at every level?"}, {"time": 1886, "text": "That if you can reduce it to one thing, is it the bishop and the knight, some kind of weird dynamics that they create in chess."}, {"time": 1894, "text": "Is there any truth to that?"}, {"time": 1896, "text": "It sounds very good."}, {"time": 1898, "text": "I haven't tried a lot of other games, but I tried to play a little bit of shogi."}, {"time": 1903, "text": "And for my new shogi brain, comparing it to chess, what annoyed me about that game is how much the pieces suck."}, {"time": 1913, "text": "Basically, you have one rook and you have one bishop that move like in chess."}, {"time": 1916, "text": "And the rest of the pieces are really not very powerful."}, {"time": 1921, "text": "So I think that's one of the attractions of chess, like how powerful, especially the queen is, which."}, {"time": 1931, "text": "I kind of think makes it a lot of fun."}, {"time": 1934, "text": "So you think power is more fun than like variety?"}, {"time": 1939, "text": "No, there is a variety in chess as well, though."}, {"time": 1943, "text": "But not much more so than like go or something."}, {"time": 1947, "text": "No, no, no, no, that's for."}, {"time": 1949, "text": "So like knight, I mean, they all move in different ways."}, {"time": 1952, "text": "They're all like weird."}, {"time": 1953, "text": "There's just all these weird patterns and positions that can emerge."}, {"time": 1957, "text": "The difference in the pieces create all kinds of interesting dynamics, I guess is what I'm trying to say."}, {"time": 1961, "text": "Yeah, and I guess it is quite fascinating that all those years ago, they created the knight and the bishop without probably realizing that they would be almost equally strong with such different qualities."}, {"time": 1977, "text": "That's crazy that this, you know, like when you design computer games, it's like an art form."}, {"time": 1983, "text": "It's science and an art to balance it."}, {"time": 1986, "text": "You know, you talk about Starcraft and all those games, like so that you can have competitive play at the highest level with all those different units."}, {"time": 1996, "text": "In the case of chess, it's different pieces."}, {"time": 1999, "text": "And they somehow designed a game that was super competitive."}, {"time": 2002, "text": "But there's probably some kind of natural selection that the chess just wouldn't last if it was designed poorly."}, {"time": 2007, "text": "Yeah, and I think the rules have changed over time a little bit, but I would be, I mean, speaking of games and all that, I'm also interested to play other games like chess 960 or Fisher random, as they call it, like that you have 960 maps instead of one."}, {"time": 2030, "text": "Yeah, so for people who don't know, a Fisher random chess, chess 960s."}, {"time": 2034, "text": "Yeah, that basically just means that the pawns are in the same way and the major pieces are distributed randomly on the last rank."}, {"time": 2044, "text": "Only that there have to be obviously bishops of opposite color and the king has to be in between the rooks so that you can castle both ways."}, {"time": 2052, "text": "Oh, you can still castle in chess 960."}, {"time": 2053, "text": "You can still castle, but it makes it interesting."}, {"time": 2056, "text": "So you still have, it still castles in the same way."}, {"time": 2060, "text": "So let's say the king is like here."}, {"time": 2062, "text": "Yeah, what happens in that case?"}, {"time": 2064, "text": "Yeah, let's say the king is in the corner."}, {"time": 2068, "text": "So to castle this side, you have to clear a whole lot of pieces."}, {"time": 2073, "text": "Well, what would castling look like though?"}, {"time": 2075, "text": "No, the king would go here and the rook would go there."}, {"time": 2079, "text": "And that's happened in my games as well."}, {"time": 2081, "text": "Like I forgot about castling and I've been like attacking a king over here and then all of a sudden it escapes to the other side."}, {"time": 2090, "text": "I think Fischer chess is good that it's, the maps will generally be worse than regular chess."}, {"time": 2103, "text": "Like I think the starting position is as close to ideal for creating a competitive game as possible, but they will still be like interesting and diverse enough that you can play very interesting games."}, {"time": 2118, "text": "So when you say maps, there's 960 different options and like what fraction of that creates interesting games at the highest level?"}, {"time": 2126, "text": "This is something that a lot of people are curious about because when you challenge a great chess player like yourself to look at a random starting position that feels like it pushes you to play pure chess versus memorizing lines."}, {"time": 2142, "text": "Oh yeah, for sure, for sure."}, {"time": 2143, "text": "But that's the whole idea."}, {"time": 2147, "text": "How hard is it to play?"}, {"time": 2148, "text": "I mean, can you talk about what it feels like to you to play with a random starting position?"}, {"time": 2153, "text": "Is there some intuition you've been building up?"}, {"time": 2155, "text": "It's very, very different."}, {"time": 2157, "text": "And I mean, understandably engines have an even greater advantage in 960 than they have in classical chess."}, {"time": 2168, "text": "No, it's super interesting."}, {"time": 2170, "text": "And that's why also I really wish that we played more classical chess, like long games, four to seven hours and in fish random chess, chess 960, because then you really need that time, even on the first moves."}, {"time": 2191, "text": "What usually happens is that you get 15 minutes before the game, you're getting told the position 15 minutes before the game, and then you can think about it a little bit, even, you know, check the computer, but that's all the time you have, but then you really need to figure it out."}, {"time": 2206, "text": "And like some of the positions obviously are a lot more interesting than the others."}, {"time": 2213, "text": "In some of them, it appears that like, if you don't play symmetrically at the start, then you're probably gonna be in a pretty bad position."}, {"time": 2223, "text": "What do you mean with the pawns?"}, {"time": 2224, "text": "With the pawns, yeah."}, {"time": 2226, "text": "Why does that make sense?"}, {"time": 2228, "text": "That's the thing about chess though."}, {"time": 2229, "text": "So let's say white opens with E4, which is, which has always been the most played move."}, {"time": 2237, "text": "There are many ways to meet that, but the most solid ways of playing has always been the symmetrical response."}, {"time": 2244, "text": "With E5, and then there's the, through Lopez, there's the Petrov opening and so on."}, {"time": 2250, "text": "And if you just banned symmetry on the first move in chess, you would get more interesting games."}, {"time": 2259, "text": "Or you'd get more decisive, decisive games."}, {"time": 2263, "text": "So that's the good thing about chess is that we've played it so long that we've actually devised non symmetrical openings that are also fairly equal and."}, {"time": 2273, "text": "But symmetry is a good default."}, {"time": 2275, "text": "But yeah, symmetry is a good default."}, {"time": 2277, "text": "And it's a problem that by playing symmetrical armed with good preparation in regular chess, it's just a little bit too easy to, it's a little bit too dryish."}, {"time": 2288, "text": "And I guess if you analyzed, if you analyzed a lot in chess 960, then the, a lot of the positions would end up being pretty dryish as well."}, {"time": 2304, "text": "Because the random starting points are so shitty, you're forced to."}, {"time": 2308, "text": "You're actually forced to play symmetrically."}, {"time": 2310, "text": "Like you cannot actually try and play in a more sort of interesting, interesting manner."}, {"time": 2317, "text": "Is there any other kind of variations that are interesting to you?"}, {"time": 2321, "text": "Oh yeah, there are, there are several."}, {"time": 2323, "text": "So no castling chess has been, has been promoted by former world champion, Vladimir Kramnik."}, {"time": 2332, "text": "There have been a few tournaments with that, not any that I've participated in though."}, {"time": 2340, "text": "Also, my coach uses like non castling engines quite a bit to analyze regular positions to just to get a different, different perspective."}, {"time": 2353, "text": "So castling is like a defensive thing."}, {"time": 2355, "text": "So if you remove castling, it forces you to be more offensive, is that why?"}, {"time": 2359, "text": "Yeah, it just, yeah, for sure."}, {"time": 2363, "text": "It seems like a tiny little difference."}, {"time": 2366, "text": "No castling probably forces you to be a little bit more defensive at the start, or I would guess so, because you cannot suddenly escape with the kings."}, {"time": 2377, "text": "It's going to make the game a bit slower at the start, but I feel like eventually it's going to, it's going to make the more games more, well, less droish for sure."}, {"time": 2391, "text": "Then you have some weirder variants, like where the pawns can move both diagonally and forward."}, {"time": 2402, "text": "And also you have self capture chess, which is quite interesting."}, {"time": 2406, "text": "So that pawns can, or pieces could commit suicide or what?"}, {"time": 2410, "text": "Yeah, people can."}, {"time": 2411, "text": "Why would that be a good move?"}, {"time": 2413, "text": "No, sometimes one of your pieces occupy a square."}, {"time": 2417, "text": "I mean, let me just set up a position."}, {"time": 2420, "text": "Let's put it like this, for instance, like here."}, {"time": 2426, "text": "I mean, there are a lot of ways to checkmate for white, like this for instance, or there are several ways, but like this would be a checkmate."}, {"time": 2438, "text": "For people who are just listening, yeah, basically you're bringing in a knight close to the whole, the king, the queen and so on, and you replace the knight with a queen."}, {"time": 2447, "text": "So you can have like a front of pieces, and then you just replace them with the second piece."}, {"time": 2454, "text": "Yeah, I mean, that could be interesting."}, {"time": 2456, "text": "I think also maybe sometimes it's just clearance, basically it adds an extra element of clearance."}, {"time": 2464, "text": "So I think there are many, many different variants."}, {"time": 2469, "text": "I don't think any of them are better than the one that has been played for at least a thousand years, but it's certainly interesting to see."}, {"time": 2482, "text": "So one of your goals is to reach the FIDEELO chess rating of 2900."}, {"time": 2487, "text": "Maybe you can comment on how is this rating calculated and what does it take to get there?"}, {"time": 2493, "text": "Is it possible for a human being to get there?"}, {"time": 2496, "text": "Basically you play with a factor of 10, which means that if I were to play against an opponent who's rated the same as me, I would be expected to score 50%, obviously, and that means that I would win five points with a win, lose five points with a draw, and then equal if I draw."}, {"time": 2517, "text": "If your opponent is 200 points lower rated, you're expected to score 75% and so on."}, {"time": 2525, "text": "And you establish that rating by playing a lot of people, and then it slowly converges towards an estimate of how likely you are to win or lose against different people."}, {"time": 2533, "text": "Yeah, and my rating is obviously carried through thousands of games."}, {"time": 2540, "text": "Right now, my rating is 2861, which is decent."}, {"time": 2546, "text": "I think that pretty much corresponds to the level I have at the moment, which means in order to reach 2900, I would have to either get better at chess, which I think is fairly hard to do, at least considerably better."}, {"time": 2567, "text": "So what I would need to do is try and optimize even more in terms of preparations, everything."}, {"time": 2576, "text": "Not necessarily like selecting tournaments and so on, but just optimizing in terms of preparation, making sure I never have any bad days."}, {"time": 2588, "text": "So you basically can't lose."}, {"time": 2590, "text": "Yeah, I basically can't fuck up ever if I wanna reach that goal."}, {"time": 2597, "text": "And so I think reaching 2900 is pretty unlikely."}, {"time": 2602, "text": "The reason I've set the goal is to have something to play for, to have a motivation to actually try and be at my best when I play."}, {"time": 2616, "text": "Because otherwise, I'm playing to some extent, mostly for fun these days in that I love to play, I love to try and win, but I don't have a lot to prove or anything, but that gives me at least the motivation to try and be at my best all the time, which I think is something to aim for."}, {"time": 2642, "text": "So at the moment, I'm quite enjoying that process of trying to, yeah, trying to optimize."}, {"time": 2652, "text": "What would you say motivates you in this now and in the years leading up to now?"}, {"time": 2657, "text": "The love of winning or the fear of losing?"}, {"time": 2662, "text": "So for the World Championship, it's been fear of losing for sure."}, {"time": 2669, "text": "Other tournaments, love of winning is a great, great factor and that's why I also get more joy from winning most tournaments than I do for winning the World Championship because then it's mostly been a relief."}, {"time": 2684, "text": "I also think I enjoy winning more now than I did before because I feel like I'm a little bit more relaxed now."}, {"time": 2692, "text": "And I also know that it's not gonna last forever."}, {"time": 2697, "text": "So every little win, I appreciate a lot more now."}, {"time": 2702, "text": "And yeah, in terms of fear of losing, that's a huge reason why I'm not gonna play the World Championship because it really didn't give me a lot of joy."}, {"time": 2714, "text": "It really was all about avoiding losing."}, {"time": 2717, "text": "Why is it that the World Championship really makes you feel this way, the anxiety?"}, {"time": 2722, "text": "So when you say losing, do you mean not just the match but every single position, like the fear of a blunder?"}, {"time": 2731, "text": "No, I mean, the blunder is okay."}, {"time": 2732, "text": "Like when I sit down at the board, then it's mostly been fine because then I'm focused on."}, {"time": 2739, "text": "Then I'm focused on the game and then I know that I can play the game."}, {"time": 2742, "text": "It's a time like in between, like knowing that, you know, I feel like losing is not an option because it's the World Championship and because in a World Championship, there are two players."}, {"time": 2753, "text": "There's a winner and a loser."}, {"time": 2756, "text": "If I don't win a random tournament that I play, then, you know, I'm usually, it depends on the tournament."}, {"time": 2763, "text": "I might be disappointed for sure."}, {"time": 2766, "text": "Might even be pretty pissed, but ultimately, you know, you go on to the next one."}, {"time": 2771, "text": "With the World Championship, you don't go on to the next one."}, {"time": 2774, "text": "It's like, it's years."}, {"time": 2778, "text": "And it also has been like, it's been a core part of my identity for a while now that I am World Champion."}, {"time": 2786, "text": "And so there's not an option of losing that."}, {"time": 2792, "text": "Yeah, there's, you're gonna have to, at least for a couple of years, carry the weight of having lost."}, {"time": 2799, "text": "You're the former World Champion now, if you lose versus the current World Champion."}, {"time": 2806, "text": "There are certain sports that create that anxiety and others that don't."}, {"time": 2812, "text": "For example, I think UFC, like mixed martial arts are a little better with losing."}, {"time": 2817, "text": "It's understood, like everybody loses."}, {"time": 2821, "text": "Not everybody though."}, {"time": 2825, "text": "Khabib entered the chat."}, {"time": 2828, "text": "But in boxing, there is like that extra pressure of like maintaining the championship."}, {"time": 2833, "text": "I mean, maybe you could say the same thing about the UFC as well."}, {"time": 2837, "text": "So for you personally, for a person who loves chess, the first time you won the World Championship, that was the big, that was the thing that was fun."}, {"time": 2849, "text": "And then everything after is like stressful."}, {"time": 2854, "text": "There was certainly stress involved the first time as well."}, {"time": 2859, "text": "But it was nothing compared to the others."}, {"time": 2864, "text": "So the only World Championship after that that I really enjoyed was the one in 2018 against the American Fabiano Caruana."}, {"time": 2871, "text": "And what that made that different is that I'd been kind of slumping for a bit and he'd been on the rise."}, {"time": 2878, "text": "So our ratings were very, very similar."}, {"time": 2881, "text": "They were so close that if at any point during the match I'd lost the game, he would have been ranked as number one in the world."}, {"time": 2892, "text": "Like our ratings were so close that for each draw, they didn't move."}, {"time": 2897, "text": "And the game itself was close."}, {"time": 2898, "text": "Yeah, the games themselves were very close."}, {"time": 2901, "text": "I had a winning position in the first game that I couldn't really get anywhere for a lot of games."}, {"time": 2908, "text": "Then he had a couple of games where he could potentially have won."}, {"time": 2914, "text": "Then in the last game I was a little bit better."}, {"time": 2917, "text": "And eventually they were all drawn."}, {"time": 2920, "text": "But I felt like all the way that this is an interesting match against an opponent who is at this position at this point equal to me."}, {"time": 2929, "text": "And so losing that would not have been this disaster."}, {"time": 2933, "text": "Because in all the other matches, I would know that I would have lost against somebody who I know I'm much better than."}, {"time": 2942, "text": "And that would be a lot harder for me to take."}, {"time": 2947, "text": "Well, that's fascinating and beautiful that the stress isn't from losing."}, {"time": 2952, "text": "Because you have fun."}, {"time": 2954, "text": "You enjoy playing against somebody who's as good as you, maybe better than you."}, {"time": 2958, "text": "That's exciting to you."}, {"time": 2961, "text": "It's losing at this high stakes thing that only happens rarely to a person who's not as good as you."}, {"time": 2968, "text": "Yeah, and that's why it's also been incredibly frustrating in other matches, like when I know, when we play draw after draw."}, {"time": 2976, "text": "And I can just, I know that I'm better."}, {"time": 2979, "text": "I can sense during the game that I understand it better than them."}, {"time": 2983, "text": "But I cannot get over the hump."}, {"time": 2986, "text": "So you are the best chess player in the world."}, {"time": 2991, "text": "And you not playing the World Championship really makes the World Championship not seem important."}, {"time": 2998, "text": "Or I mean, there's an argument to be made for that."}, {"time": 3001, "text": "Is there anything you would like to see if you had a change about the World Championship that would make it more fun for you?"}, {"time": 3007, "text": "And better for the game of chess period for everybody involved?"}, {"time": 3010, "text": "So I think 12 games or now 14 games that there is for the World Championship is a fairly, fairly low sample size."}, {"time": 3020, "text": "If you want to determine who the best player is, or at least the best player in that particular matchup, you need more games."}, {"time": 3027, "text": "And I think to some extent, if you're gonna have a World Champion and call them the best players, best player, you gotta make sure that the format increases the chance of finding the best player."}, {"time": 3041, "text": "So I think having more games, and if you're gonna have a lot more games, then you need to decrease the time control a bit, which in turn, I think is also a good thing because in very long time controls with deep preparation, you can sort of mask a lot of your deficiencies as a chess player because you have a lot of time to think and to defend."}, {"time": 3070, "text": "And also, yeah, you have deep preparation."}, {"time": 3074, "text": "So I think those would be, for me to play, those would be the main things, more games and less time."}, {"time": 3084, "text": "So you want to see more games and rules that emphasize pure chess?"}, {"time": 3090, "text": "Yeah, but already less time emphasizes pure chess because defensive techniques are much harder to execute with a little time."}, {"time": 3102, "text": "What do you think, is there a sweet spot in terms of, are we talking about Blitz?"}, {"time": 3106, "text": "Is it, how many minutes?"}, {"time": 3107, "text": "I think Blitz is a bit too fast."}, {"time": 3109, "text": "To their credit, this was suggested by Fieda as well."}, {"time": 3113, "text": "For a start to have two games per day, and let's say you have 45 minutes a game plus 15 or 30 seconds per move, that means that each sessions will probably be about, or a little less than two hours."}, {"time": 3130, "text": "That would be a start."}, {"time": 3131, "text": "Also what we're playing in the tournament that I'm playing here in Miami, which is four games a day with 15 minutes plus 10 seconds per move, those four would be more interesting than the one there is now."}, {"time": 3149, "text": "And I understand that there are a lot of traditions."}, {"time": 3152, "text": "People don't want to change the World Championship."}, {"time": 3155, "text": "That's all fine."}, {"time": 3156, "text": "I just think that the World Championship should do a better job of trying to reflect who's the best overall chess player."}, {"time": 3166, "text": "So would you say like, if it's faster games, you'd probably be able to get a sample size of like over 20 games, 20, 30, 40."}, {"time": 3175, "text": "You think there's a number that's good over a long period of time?"}, {"time": 3178, "text": "Well, I would prefer as many as possible."}, {"time": 3180, "text": "So like a hundred?"}, {"time": 3182, "text": "Yeah, but let's say you play 12 days, two games a day."}, {"time": 3187, "text": "You know, that's 24."}, {"time": 3189, "text": "I feel like that's already quite a bit better."}, {"time": 3191, "text": "You play like one black game, one white game each day."}, {"time": 3195, "text": "Endurance wise, that's okay?"}, {"time": 3198, "text": "Like you will have free days as well."}, {"time": 3199, "text": "So I don't think that will be a problem."}, {"time": 3203, "text": "And also you have to prepare two sets of openings for each day, which makes it more difficult for the teams preparing, which I think is also good."}, {"time": 3212, "text": "Let me ask you a fun question."}, {"time": 3214, "text": "If Hikaru Nakamura was one of the two people, I guess, I apologize."}, {"time": 3221, "text": "Yeah, he could have finished second."}, {"time": 3223, "text": "So he lost the last round of the candidates."}, {"time": 3225, "text": "Yeah, and maybe you can explain to me, internet speed copium is something you tweeted."}, {"time": 3233, "text": "But if he got second, would you just despite him still play the world championship?"}, {"time": 3241, "text": "That's internet question."}, {"time": 3242, "text": "And when the internet asks, I must abide."}, {"time": 3244, "text": "The dude abides."}, {"time": 3250, "text": "So after the last match, I did an interview right after where I talked about the fact that I was unlikely to play the next one."}, {"time": 3262, "text": "I'd spoken privately to both family, friends, and of course also my chess team that this was likely going to be the last match."}, {"time": 3274, "text": "What happened was that right before the world championship match, there was this young player, Alireza Firouzsa."}, {"time": 3282, "text": "He had a dramatic rise."}, {"time": 3283, "text": "He rose to second in the world rankings."}, {"time": 3286, "text": "He was 18 then, he's 19 now."}, {"time": 3288, "text": "He qualified for the candidates."}, {"time": 3290, "text": "And it felt like there was like at least a half realistic possibility that he could be the challenger for the next world championship."}, {"time": 3301, "text": "And that sort of lit a fire under me."}, {"time": 3305, "text": "Yeah, I like that a lot."}, {"time": 3307, "text": "I love the idea of playing him in the next world championship."}, {"time": 3311, "text": "And originally, I was sure that I wanted to announce right after the tournament, the match, that this was it, I'm done."}, {"time": 3320, "text": "I'm not playing the next one."}, {"time": 3322, "text": "But this lit a fire under me."}, {"time": 3324, "text": "So that made me think, this actually motivates me."}, {"time": 3329, "text": "And I just wanted to get it out there for several reasons to create more hype about the candidates, to sort of motivate myself a little bit, maybe motivate him."}, {"time": 3342, "text": "Also, obviously I wanted to give people a heads up for the candidates that you might be playing for more than first place."}, {"time": 3353, "text": "Normally, the candidates is first place or best."}, {"time": 3356, "text": "It's like the world championship."}, {"time": 3359, "text": "And then, so Nakamura was one of many people who just didn't believe me, which is fair."}, {"time": 3365, "text": "Because I've talked before about not necessarily wanting to defend again."}, {"time": 3371, "text": "But I never talked as concretely or was as serious as this time."}, {"time": 3376, "text": "So he simply didn't believe me."}, {"time": 3379, "text": "And he was very vocal about that."}, {"time": 3381, "text": "And he said, nobody believed me, no other players, which may or may not have been true."}, {"time": 3387, "text": "And then, yeah, he lost the last game."}, {"time": 3389, "text": "And he didn't qualify."}, {"time": 3391, "text": "But to answer the question, no, I'd already at that point decided that I wouldn't play."}, {"time": 3398, "text": "I would have liked it less if he had not lost the last round."}, {"time": 3404, "text": "But the decision was already made."}, {"time": 3408, "text": "Does it break your heart a little bit that you're walking away from it?"}, {"time": 3414, "text": "In all the ways that you mentioned that it's just not fun, there's a bunch of ways that it doesn't seem to bring out the best kind of chess."}, {"time": 3422, "text": "It doesn't bring out the best out of you in the particular opponents involved."}, {"time": 3425, "text": "Does it just break your heart a little bit?"}, {"time": 3427, "text": "Like you're walking away from something, or maybe the entire chess community is walking away from a kind of a historic event that was so important in the 20th century at least?"}, {"time": 3440, "text": "So I won the championship in 2013."}, {"time": 3443, "text": "I said no to the candidates in 2011."}, {"time": 3448, "text": "I didn't particularly like the format."}, {"time": 3450, "text": "I also wasn't, I was just not in the mood."}, {"time": 3454, "text": "I didn't want the pressure that was connected with the World Championship."}, {"time": 3460, "text": "And I was perfectly content at the time to play the tournaments that I did play, also to be ranked number one in the world."}, {"time": 3468, "text": "I was comfortable with the fact that I knew that I was the best and I didn't need a title to show others."}, {"time": 3476, "text": "And what happened later is I suddenly decided to play."}, {"time": 3482, "text": "In 2013, they changed the format."}, {"time": 3488, "text": "I just decided, it could be interesting."}, {"time": 3491, "text": "Let's try and get this."}, {"time": 3493, "text": "There really wasn't more than that to it."}, {"time": 3497, "text": "It wasn't like fulfilling lifelong dream or anything."}, {"time": 3501, "text": "I just thought, let's play."}, {"time": 3505, "text": "So it's just a cool tournament, a good challenge."}, {"time": 3507, "text": "Yeah, it's a cool tournament, it's a good challenge."}, {"time": 3511, "text": "It's something that could be a motivation."}, {"time": 3515, "text": "It motivated me to get in the best shape of my life that I had been until then."}, {"time": 3520, "text": "So it was a good thing."}, {"time": 3522, "text": "And 2013 match brought me a lot of joy as well."}, {"time": 3526, "text": "So I'm very, very happy that I did that."}, {"time": 3529, "text": "But I never had any thoughts that I'm going to keep the title for a long time."}, {"time": 3534, "text": "Immediately after the match in 2013, also before the match, I'd spoken against the fact that the champion is seeded into the final, which I thought was unfair."}, {"time": 3547, "text": "After the match, I made a proposal that we have a different system where the champion doesn't have these privileges."}, {"time": 3554, "text": "And people's reaction, both players and chess community, was generally like, OK, we're good."}, {"time": 3563, "text": "You keep your privileges."}, {"time": 3566, "text": "And I was like, OK, whatever."}, {"time": 3567, "text": "So you want to fight for it every time?"}, {"time": 3570, "text": "Yeah, I want that."}, {"time": 3574, "text": "I have to ask, just in case you have an opinion, if you can maybe from a fantasy chess perspective analyze Ding versus Nepo, who wins?"}, {"time": 3585, "text": "The current, the two people that would play if you're not playing."}, {"time": 3590, "text": "Generally, I would consider that Ding has a slightly better overall chess strength."}, {"time": 3597, "text": "What are the strengths and weaknesses of each, if you can summarize it?"}, {"time": 3602, "text": "So Nepo, he's even better at calculating short lines than I am."}, {"time": 3611, "text": "But he can sometimes lack a little bit of depth."}, {"time": 3616, "text": "In short lines, he's an absolute calculation monster."}, {"time": 3619, "text": "He's extremely quick."}, {"time": 3622, "text": "But he can sometimes lack a bit of depth."}, {"time": 3625, "text": "Also recently, he's improved his openings quite a bit."}, {"time": 3628, "text": "So now he has a lot of good ideas."}, {"time": 3633, "text": "And he's very, very solid."}, {"time": 3636, "text": "Ding is not quite as well prepared."}, {"time": 3639, "text": "But he has an excellent understanding of dynamics and imbalances in chess, I would say."}, {"time": 3648, "text": "What do you mean by imbalances?"}, {"time": 3651, "text": "Imbalances like bishops against knights and material imbalances."}, {"time": 3655, "text": "He can take advantage of those."}, {"time": 3657, "text": "Yes, I would say he's very, very good at that and understanding the dynamic factors, as we call them, like material versus time, especially."}, {"time": 3670, "text": "I think Nepo got the better of him and the candidates."}, {"time": 3672, "text": "So what's your sense why Ding has an edge in the championship?"}, {"time": 3677, "text": "I feel like individual past results hasn't necessarily been a great indicator of world championship results."}, {"time": 3685, "text": "I feel like overall chess strength is more important."}, {"time": 3692, "text": "To be fair, I only think Ding has a very small edge."}, {"time": 3694, "text": "Difference is not big at all."}, {"time": 3696, "text": "But our individual head to head record was probably the main reason that a lot of people thought Nepo had a good chance against me as well."}, {"time": 3705, "text": "It was like 4 to 1 in his favor before the match."}, {"time": 3711, "text": "But that was just another example of why that may not necessarily mean anything."}, {"time": 3716, "text": "Also in our case, it was a very, very low sample size, I think, about the size of the match in total, 14 games."}, {"time": 3725, "text": "And that generally doesn't mean much."}, {"time": 3729, "text": "How close were those games, would you say, in your mind for the previous championship?"}, {"time": 3734, "text": "So that game six was a turning point where you won."}, {"time": 3738, "text": "Was there any doubt in your mind that if you do a much larger sample size that you'll get the better of Nepo?"}, {"time": 3745, "text": "No, no, larger sample size is always good for me."}, {"time": 3748, "text": "So world championship, it's a great parallel to football because it's a low scoring game."}, {"time": 3756, "text": "And if the better player or the better team scores, they win most of the time."}, {"time": 3764, "text": "Oh, that's generally for championships or in general?"}, {"time": 3767, "text": "Yeah, for championships."}, {"time": 3768, "text": "They generally, generally win because the other slightly weaker team, they're good enough to defend to make it very, very difficult for the others."}, {"time": 3780, "text": "But when they actually have to create the chances, then they have no chance."}, {"time": 3784, "text": "And then it very often ends with a blowout as it did in our match."}, {"time": 3788, "text": "If I hadn't won game six, it probably would have been very, very close."}, {"time": 3793, "text": "He might have edged it."}, {"time": 3794, "text": "There's obviously a bigger chance that I would have edged it."}, {"time": 3798, "text": "But this is just what happens a lot in chess, but also in football that matches are close and then they somebody scores, somebody scores and then things change."}, {"time": 3810, "text": "And this gives people the illusion that the matchup was very close."}, {"time": 3815, "text": "Well, actually, it just means that the nature of the game makes the matches close very often."}, {"time": 3823, "text": "But it's always much more likely that one of the teams is going to or one of the players is going to break away than the others."}, {"time": 3831, "text": "And in other matches as well, even though a lot of people before the match in 2016 against Karjakin, there were people who thought before the match that I was massively overrated as a favorite and that essentially the match was pretty, pretty close, like whatever, 60, 40, or some people even said like 55, 45."}, {"time": 3858, "text": "And what I felt was that the match went very, very wrong for me and I still won."}, {"time": 3865, "text": "And some people saw that as an indication that the pre match probabilities were probably a bit closer than people thought."}, {"time": 3871, "text": "Well, I would look at it in the way that everything went wrong and I still won, which probably means that I was a pretty big favorite to begin with."}, {"time": 3881, "text": "I do have a question to you about that match, but first, so Sergei Karjakin was originally a qualifier for the candidate tournament, but was disqualified for breaching the FIDE code of ethics after publicly expressing approval for the 2022 Russian invasion in Ukraine."}, {"time": 3897, "text": "You look at the Cold War and some of the US versus Russian games of the past, does politics, does some of this geopolitics, politics ever creep its way into the game?"}, {"time": 3909, "text": "Do you feel the pressure, the immensity of that as it does sometimes for the Olympics, these big nations playing each other, competing against each other, almost like fighting out in a friendly way, the battles, the tensions that they have in the space of geopolitics?"}, {"time": 3926, "text": "Yeah, I think it still does."}, {"time": 3927, "text": "So the president of the World Chess Federation who was just reelected is a Russian."}, {"time": 3933, "text": "Like I like him personally, for sure, but he is quite connected to the Kremlin."}, {"time": 3939, "text": "And it's quite clear that the Kremlin considers it at least a semi important goal to bring the chess crown home to Russia."}, {"time": 3949, "text": "So it's still definitely a factor."}, {"time": 3952, "text": "And I mean, I can answer for in the Karjakin case, like I don't have a strong opinion on whether he should have been banned or not."}, {"time": 3963, "text": "Obviously, I don't agree with anything that he says."}, {"time": 3968, "text": "But in principle, I think that you should ban either no Russians or all Russians."}, {"time": 3977, "text": "I'm generally not particularly against either, but I don't love banning wrong opinions, even if they are as reprehensible as his have been."}, {"time": 3992, "text": "Yeah, there's something about the World Chess Championships or the Olympics where it feels like banning is counterproductive to the alleviating some of the conflicts."}, {"time": 4003, "text": "This is the thing though."}, {"time": 4005, "text": "We really don't know about the long term conflicts."}, {"time": 4008, "text": "And a lot of people try to do the right thing in this sense, which I don't really blame at all."}, {"time": 4014, "text": "It's just that we don't know."}, {"time": 4017, "text": "And I guess sometimes there are other ways you wanna try and help as well."}, {"time": 4024, "text": "See, like within the competition, within some of those battles of US versus Russia or so on of the past, there's also between the individuals, maybe you'll disagree with this, but from a spectator perspective, there's still a camaraderie."}, {"time": 4038, "text": "Like at the end of the day, there's a thing that unites you, which is this like appreciation of the fight over the chessboard."}, {"time": 4049, "text": "Even if you hate each other."}, {"time": 4051, "text": "I think for every match that's been, you would briefly discuss the game with your opponent after the game, no matter how much you hate each other."}, {"time": 4061, "text": "And I think that's lovely."}, {"time": 4063, "text": "And Kasparov, I mean, he was quoted, like when somebody in his team asked him like, why are you talking to Karpov after the game?"}, {"time": 4072, "text": "Like you hate that guy."}, {"time": 4074, "text": "And he's like, yeah, sure."}, {"time": 4075, "text": "But he's the only one who understands me."}, {"time": 4077, "text": "Yeah, the only one who understands."}, {"time": 4079, "text": "So that's, no, I think that's really lovely."}, {"time": 4081, "text": "And I would love to see that in other areas as well, that you can, regardless of what happens, you can have a good chat about the game."}, {"time": 4092, "text": "You can just talk about the ideas with people who understand what you understand."}, {"time": 4098, "text": "So if you're not playing the world championships, there's a lot of people who are saying that perhaps the world championships don't matter anymore."}, {"time": 4110, "text": "I said that back a long time ago as well, that for me, I don't know if it never happened."}, {"time": 4117, "text": "So I don't know what would have happened, but I was thinking like the moment that I realized that I'm not the best player in the world, like I felt like morally I have to renounce the world championship title, you know, because it doesn't mean anything as long as you're not the best player."}, {"time": 4133, "text": "So the ratings really tell a bigger, a clearer story."}, {"time": 4138, "text": "I think so, at least over time."}, {"time": 4141, "text": "Like I'm a lot more proud of my streak of being rated number one in the world, which is now since I think the summer of 2011."}, {"time": 4153, "text": "I'm a lot more proud of that than the world championships."}, {"time": 4157, "text": "How much anxiety or even fear do you have before making a difficult decision on the chessboard?"}, {"time": 4164, "text": "So it's a high stakes game."}, {"time": 4166, "text": "How nervous do you get?"}, {"time": 4168, "text": "How much anxiety do you have in all that calculations?"}, {"time": 4171, "text": "You're sitting there for 10, 15 minutes because you're in a fog."}, {"time": 4175, "text": "There's always a possibility of a blunder, of a mistake."}, {"time": 4178, "text": "Are you anxious about it?"}, {"time": 4180, "text": "Really depends."}, {"time": 4182, "text": "I have been at times."}, {"time": 4185, "text": "I think the most nervous I ever been was game 10 of the world championships in 2018."}, {"time": 4194, "text": "I know that was just a thrilling game."}, {"time": 4198, "text": "I was black."}, {"time": 4200, "text": "I basically abandoned the queen side at some point to attack him on the king side."}, {"time": 4204, "text": "And I knew that my attack, if it doesn't work, I'm going to lose, but I had so much adrenaline."}, {"time": 4212, "text": "So that was fine."}, {"time": 4213, "text": "I thought I was going to win."}, {"time": 4214, "text": "Then at some point I realized that it's not so clear and that my time was ticking and I was just getting so nervous."}, {"time": 4221, "text": "I still remember what happened."}, {"time": 4225, "text": "Like we played this time trouble phase where he had very little time, but I had even less."}, {"time": 4231, "text": "And I just remember, I kind of remember much of it, just that when it was over, I was just so relieved because then it was clear that the position was probably gonna be routed in a draw."}, {"time": 4243, "text": "Otherwise I'm often nervous before games, but when I get there, it's all business."}, {"time": 4250, "text": "And especially when I'm playing well, I'm never afraid of losing when I play because I trust my instincts."}, {"time": 4261, "text": "I trust my skills."}, {"time": 4263, "text": "How much psychological intimidation is there from you to the other person, from the other person to you?"}, {"time": 4269, "text": "I think people would play a lot better if they played against an anonymous me."}, {"time": 4275, "text": "I would love to have a tournament online where let's say you play 10 of the best players in the world and for each round you don't know who you're playing."}, {"time": 4291, "text": "There's these videos where people eat McDonald's or Burger King or Diet Coke versus Diet Pepsi."}, {"time": 4298, "text": "Would people be able to tell they're playing you from the style of play, do you think?"}, {"time": 4305, "text": "Or from the strength of play?"}, {"time": 4308, "text": "If there was a decent sample size, sure."}, {"time": 4311, "text": "And what about you?"}, {"time": 4312, "text": "Would you be able to tell others?"}, {"time": 4315, "text": "In just one game?"}, {"time": 4319, "text": "What sample size would you need to tell accurately?"}, {"time": 4322, "text": "I feel like this is science."}, {"time": 4323, "text": "Yeah, I think 20 games would help a lot."}, {"time": 4326, "text": "Per person?"}, {"time": 4329, "text": "But I know that they've already developed AI bots that are pretty good at recognizing somebody's style."}, {"time": 4337, "text": "Which is quite fascinating."}, {"time": 4341, "text": "And it'd be fascinating if those bots were able to summarize the style somehow."}, {"time": 4346, "text": "Maybe great attacking chess, like some of the same characteristics you've been describing like great at short line calculations all that kind of stuff."}, {"time": 4355, "text": "Or did you just talk shit?"}, {"time": 4357, "text": "No, but really all the best chess players, there are basically just two camps."}, {"time": 4362, "text": "People who are good at longer lines or shorter lines."}, {"time": 4366, "text": "It's the hare and the tortoise, basically."}, {"time": 4369, "text": "And sometimes, you know, I feel like I'm the closest you can get to a high bridge of those."}, {"time": 4378, "text": "Because you got both, you're good in every position."}, {"time": 4382, "text": "So the middle game and end game."}, {"time": 4383, "text": "Yeah, and also I can think to some extent both rapidly and deeply, which a lot of people, they can't do both."}, {"time": 4391, "text": "But I mean, to answer your question from before, I think, yeah, I sometimes can get a little bit intimidated by my opponent, but it's mostly if there's something unknown."}, {"time": 4403, "text": "It's mostly if it's something that I don't understand fully."}, {"time": 4408, "text": "And I do think, especially when I'm playing, well, people, they just play more timidly against me than they do against each other."}, {"time": 4416, "text": "Sometimes without even realizing it."}, {"time": 4419, "text": "And I certainly use that to my advantage."}, {"time": 4422, "text": "If I sense that my opponent is apprehensive, if I sense that they are not gonna necessarily take all their chances, it just means that I can take more risk."}, {"time": 4433, "text": "And I always try and find that balance."}, {"time": 4438, "text": "To shake them up a little bit."}, {"time": 4440, "text": "What's been the toughest loss of your career that you remember?"}, {"time": 4444, "text": "Would that be the World Championship match?"}, {"time": 4449, "text": "Game eight in 2016."}, {"time": 4452, "text": "And who was it against?"}, {"time": 4453, "text": "Against Karjakin in New York."}, {"time": 4456, "text": "Can you take it through the story of that game?"}, {"time": 4459, "text": "Where were you before that game in terms of game one through seven?"}, {"time": 4466, "text": "Yeah, so game one and two, not much happened."}, {"time": 4469, "text": "Game three and four, I was winning in both of them."}, {"time": 4472, "text": "And normally, I should definitely have converted both."}, {"time": 4477, "text": "I couldn't, partly due to good defense on his part, but mostly because I just, I messed up."}, {"time": 4488, "text": "And then after that, games five, six, and seven, not much happened."}, {"time": 4496, "text": "I was getting impatient at that point."}, {"time": 4500, "text": "So for game eight, I was probably ready to take a little bit more risks than I had before, which I guess was insane because I knew that he couldn't beat me unless I beat myself."}, {"time": 4517, "text": "Like he wasn't strong enough to outplay me."}, {"time": 4520, "text": "And that was leading to impatience somehow?"}, {"time": 4522, "text": "And impatience."}, {"time": 4523, "text": "No, because I knew that I was better."}, {"time": 4525, "text": "I knew that I was better."}, {"time": 4527, "text": "I knew that I just needed to win one game and then the match is over."}, {"time": 4530, "text": "That's what happened in 2021 as well."}, {"time": 4532, "text": "Like when I won the first game against Nebo, I knew that the match was over unless I like fuck up royally, then he's not gonna be able to beat me."}, {"time": 4542, "text": "So what happened was that I played a kind of an innocuous opening as White, just trying to get a game, trying to get him out of book as soon as possible."}, {"time": 4551, "text": "Then..."}, {"time": 4552, "text": "Okay, can you elaborate?"}, {"time": 4553, "text": "Innocuous, get him out of the book."}, {"time": 4556, "text": "No, basically I set up pretty defensively as White."}, {"time": 4560, "text": "I wasn't really crossing into his half at the start at all."}, {"time": 4564, "text": "I was just, I played more like a system more than like a concrete opening."}, {"time": 4569, "text": "It was like, I'm gonna set up my pieces this way."}, {"time": 4572, "text": "You can set them up however you want."}, {"time": 4574, "text": "And then later where sort of the armies are gonna meet."}, {"time": 4578, "text": "I'm not gonna try and bother you at the start."}, {"time": 4580, "text": "And that means you're gonna have with as many pieces as possible kind of pure chess in the middle game without any of the lines, the standard lines in the opening."}, {"time": 4592, "text": "And so there was at some point a couple of exchanges, then some maneuvering, a little bit better."}, {"time": 4598, "text": "Then he was sort of equalizing and then I started to take too many risks."}, {"time": 4602, "text": "And I was still sort of fine, but then at some point I realized that I'd gone a bit too far and I had to be really careful."}, {"time": 4612, "text": "Then I just froze."}, {"time": 4613, "text": "I just completely froze."}, {"time": 4617, "text": "Mentally?"}, {"time": 4617, "text": "Yeah, mentally."}, {"time": 4619, "text": "I realized that all the thoughts of I might lose this."}, {"time": 4625, "text": "What have I done?"}, {"time": 4627, "text": "Why did I take so many risks?"}, {"time": 4628, "text": "I knew that I could have drawn at any moment."}, {"time": 4631, "text": "Just be patient."}, {"time": 4632, "text": "Don't give him these opportunities."}, {"time": 4635, "text": "What triggered that phase transition in your mind?"}, {"time": 4638, "text": "No, it was just a position on the board."}, {"time": 4642, "text": "Realizing there was one particular move he played that I missed."}, {"time": 4646, "text": "And then I realized that this could potentially not go my way."}, {"time": 4652, "text": "So then I made another couple of mistakes and he, to his credit, once he realized he had the chance, he knew that this was his one chance."}, {"time": 4663, "text": "He had to take it."}, {"time": 4664, "text": "And so he did."}, {"time": 4666, "text": "And yeah, that's the worst I've ever felt after a chess game."}, {"time": 4674, "text": "I realized that I'm probably gonna lose my title against somebody who's not even close to my level."}, {"time": 4682, "text": "And I've done it because of my own stupidity, most of all."}, {"time": 4688, "text": "And that was really, really... At the time, I was all in my own head."}, {"time": 4696, "text": "That was hard to deal with."}, {"time": 4698, "text": "And I felt like I didn't really recover too much for the next game."}, {"time": 4704, "text": "So what I did, there was a free day after the eighth game."}, {"time": 4707, "text": "So I did something that I never did at any other world championship."}, {"time": 4711, "text": "Like after game eight, I just, I got drunk with my team."}, {"time": 4718, "text": "And... That's not a standard procedure."}, {"time": 4721, "text": "That's the only time that's happened in the world championship during the match."}, {"time": 4726, "text": "So yeah, I just tried to forget."}, {"time": 4730, "text": "But still before game nine... Game nine, I was a little bit more relaxed, but I was still a bit nervous."}, {"time": 4736, "text": "Then game nine, I almost lost as well."}, {"time": 4739, "text": "Then only game 10."}, {"time": 4742, "text": "Game 10, I was still, I wasn't in a great mood."}, {"time": 4744, "text": "I was really, really tense."}, {"time": 4747, "text": "The opening was good."}, {"time": 4749, "text": "I had some advantage."}, {"time": 4750, "text": "I was getting optimistic."}, {"time": 4751, "text": "Then I made one mistake."}, {"time": 4753, "text": "He could have forced a draw."}, {"time": 4755, "text": "And then all the negativity came back."}, {"time": 4758, "text": "Like, I was thinking during the game, like how am I going to play for a win with Black in the next game?"}, {"time": 4763, "text": "Like, what am I doing?"}, {"time": 4766, "text": "And then, you know, eventually it ended well."}, {"time": 4769, "text": "It didn't find the right line."}, {"time": 4772, "text": "I ground him down."}, {"time": 4773, "text": "Actually, I played at some point pretty well in the end game."}, {"time": 4778, "text": "And after that game, like there was such a weight."}, {"time": 4783, "text": "Lifted?"}, {"time": 4783, "text": "Lifted."}, {"time": 4784, "text": "No, after that, there was like no thought of losing the match whatsoever."}, {"time": 4789, "text": "I knew that, okay, I'd basically gotten away with, not with murder, but gotten away with something."}, {"time": 4799, "text": "What can you say about the after game eight?"}, {"time": 4802, "text": "Where are the places you've gone in your mind?"}, {"time": 4805, "text": "Do you go to some dark places?"}, {"time": 4807, "text": "We're talking about like depression."}, {"time": 4809, "text": "Do you think about quitting at that point?"}, {"time": 4812, "text": "No, I mean, I think about quitting every time I lose a classical game."}, {"time": 4817, "text": "Or at least I used to."}, {"time": 4818, "text": "Like, especially if it's in a stupid way, I'm thinking like, okay, if I'm gonna play like this, if I'm gonna do things that I know are wrong, then, you know, I might as well quit."}, {"time": 4830, "text": "No, that's happened a bunch of times."}, {"time": 4834, "text": "And I've definitely gotten a bit more carefree about losing these days, which it's not necessarily a good thing."}, {"time": 4841, "text": "Like my hatred of losing led to me not losing a lot."}, {"time": 4846, "text": "Losing a lot and it also lit the fire under me that I think my performance after losses in classical chess over the last 10 years is like over 2,900."}, {"time": 4858, "text": "Like I really play well after a loss, even though it's really, really unpleasant."}, {"time": 4863, "text": "So apparently like I don't think the way that I dealt with them is particularly healthy, but it's worked."}, {"time": 4871, "text": "It's worked so far."}, {"time": 4872, "text": "But then you've discovered now a love for winning to where ultimately longevity wise creates more fun."}, {"time": 4882, "text": "What's the perfect day in the life of Magnus Carlsen on a day of a big chess match?"}, {"time": 4888, "text": "It doesn't have to be world championship, but if it's a chess match you care about, what time do you wake up?"}, {"time": 4897, "text": "Oh, it depends on when the game is, but let's say the game is at three, I'll probably wake up pretty late at about 11."}, {"time": 4909, "text": "Then I'll go for a walk, might listen to some podcasts."}, {"time": 4917, "text": "Maybe I'll spend a little bit of time looking at some NBA game from last night or whatever."}, {"time": 4924, "text": "So not chess related stuff?"}, {"time": 4926, "text": "Then I'll get back, I'll have a big lunch, like usually like a big omelet with a bunch of salad and stuff."}, {"time": 4935, "text": "Then go to the game, win like a very nice clean game."}, {"time": 4941, "text": "Perfect day."}, {"time": 4942, "text": "Just go back after, relax."}, {"time": 4944, "text": "Like the things that make me the happiest at tournaments is just having a good routine and feeling well."}, {"time": 4953, "text": "I don't like it when too much is happening around me."}, {"time": 4956, "text": "So the tournament that I came from now was the Chess Olympiad, which is the team event."}, {"time": 4964, "text": "So we were a team Norway."}, {"time": 4966, "text": "We did horribly."}, {"time": 4969, "text": "I did okay, but the team in general did horribly."}, {"time": 4972, "text": "You won that Italy?"}, {"time": 4974, "text": "No, no, Italy beat us, but Uzbekistan won in the end."}, {"time": 4978, "text": "They were this amazing team of young players."}, {"time": 4981, "text": "It was really impressive."}, {"time": 4982, "text": "But the thing is like we had a good comradery in the team."}, {"time": 4985, "text": "We had our meals together."}, {"time": 4987, "text": "We played a bit of football, went swimming, and I couldn't understand why things went wrong."}, {"time": 4993, "text": "And I still don't understand."}, {"time": 4994, "text": "But the thing is for me, it was all very nice, but now I'm so happy to be on my own at a tournament just to have my own routines, not see too many people."}, {"time": 5004, "text": "Otherwise just have like a very small team of people that I see."}, {"time": 5008, "text": "You are a kind of celebrity now."}, {"time": 5011, "text": "So people within the chess tournament and outside would recognize you, want to socialize, want to tell you about how much you mean to them, how much you inspire them, all that kind of stuff."}, {"time": 5021, "text": "Does that get in the way for you when you're like trying to really focus on the match?"}, {"time": 5026, "text": "Are you able to block that?"}, {"time": 5029, "text": "Like are you able to enjoy those little interactions and still keep your focus?"}, {"time": 5033, "text": "Yeah, most of the time that's fine as long as it's not too much."}, {"time": 5037, "text": "But I have to admit, when I'm at home in Norway, I rarely go out without big headphones and something."}, {"time": 5050, "text": "Oh, like a disguise?"}, {"time": 5051, "text": "No, not a disguise, just to block out the world."}, {"time": 5056, "text": "Otherwise... Don't make eye contact?"}, {"time": 5058, "text": "Yeah, no, so the thing is people in general are nice."}, {"time": 5063, "text": "I mean, people, they wish me well, and they don't bother me."}, {"time": 5069, "text": "Also, when I have the headphones on, I don't notice as much people turning around and all of that so I can be more of in my own world."}, {"time": 5079, "text": "So I like that."}, {"time": 5080, "text": "Yeah, what about in this perfect day after the game?"}, {"time": 5085, "text": "Do you try to analyze what happened?"}, {"time": 5087, "text": "Do you try to think through systematically or do you just kind of loosely think about like... No, I just loosely think about it."}, {"time": 5093, "text": "I've never been very structured in that sense."}, {"time": 5097, "text": "I know that it was always recommended that you analyze your own games, but I generally felt that I mostly had a good idea about that."}, {"time": 5107, "text": "Like nowadays, I will loosely see what the engine says at a certain point if I'm curious about that."}, {"time": 5115, "text": "Otherwise, I usually move on to the next."}, {"time": 5120, "text": "What about diet?"}, {"time": 5121, "text": "You said omelet and salad and so on."}, {"time": 5123, "text": "I heard in your conversation with the other Magnus, Magnus number two, about you had like this bet about meat."}, {"time": 5131, "text": "One of you are gonna go vegan if you lose, I forget which bet."}, {"time": 5134, "text": "Vegetarian though."}, {"time": 5136, "text": "Vegetarian, sorry."}, {"time": 5137, "text": "And you both have an admiration for meat."}, {"time": 5142, "text": "Is there some aspect about optimal performance that you look for in food?"}, {"time": 5146, "text": "Like maybe eating only like once or twice a day or a particular kind of food, like meat heavy diet."}, {"time": 5154, "text": "Is there anything like that?"}, {"time": 5155, "text": "Or are you just trying to have fun with the food?"}, {"time": 5157, "text": "I think whenever I'm at tournaments, like it's very natural to eat, at least for me to eat only twice a day."}, {"time": 5166, "text": "So usually I do that when I'm at home as well."}, {"time": 5168, "text": "So you do eat before the tournament though."}, {"time": 5171, "text": "You don't play fasted."}, {"time": 5174, "text": "But I try not to eat too heavy before the game or in general to avoid sugary stuff to have a pretty stable blood sugar level."}, {"time": 5186, "text": "Cause that's the easiest way to make mistake that your energy levels just suddenly drop and they don't necessarily need to be too high as long as they're pretty stable, yeah."}, {"time": 5199, "text": "Have you ever tried playing fasted, like intermittent fasting?"}, {"time": 5204, "text": "So playing without having eaten."}, {"time": 5206, "text": "I mean, the reason I ask, you know, especially when you do a low carb diet, when I've done a person at low carb diet, I'm able to fast for a long time, like eat once a day, maybe twice a day."}, {"time": 5218, "text": "But I just, the mind is most focused on like really difficult thinking tasks when it's fasted."}, {"time": 5225, "text": "It's an interesting, and a lot of people kind of talk about that."}, {"time": 5229, "text": "Yeah, but you're able to kind of like zoom in and if you're doing a low carb diet, you don't have the energy stable."}, {"time": 5235, "text": "You know, that is true."}, {"time": 5237, "text": "Maybe that will be interesting to try."}, {"time": 5238, "text": "So what's happened for me, I played a few tournaments where I've had food poisoning and then that generally means that you're both sleep deprived and you have no energy."}, {"time": 5251, "text": "And what I've found is that it makes me, it makes me very calm, of course, because I don't have the energy and it makes me super creative."}, {"time": 5263, "text": "Sleep deprived probably I think in general makes you creative."}, {"time": 5267, "text": "Just the first thing that goes away is the ability to do the simple things."}, {"time": 5271, "text": "That's what it affects you the most."}, {"time": 5274, "text": "Like you cannot be precise."}, {"time": 5276, "text": "So that's the only thing I'm worried about."}, {"time": 5278, "text": "Like if I'm fasted that I won't be precise when I play."}, {"time": 5286, "text": "But you might be more creative."}, {"time": 5288, "text": "It's an interesting trial."}, {"time": 5289, "text": "Fasted, yeah, potentially."}, {"time": 5292, "text": "What about you have been known to on a rare occasion play drunk."}, {"time": 5296, "text": "Is there a mathematical formula for sort of on the X axis how many drinks you had and on the Y axis your performance slash creativity?"}, {"time": 5306, "text": "Is there like an optimal for, like one of the, would you suggest for the FIDE World Championship that people would be required to drink?"}, {"time": 5314, "text": "Would that change things in interesting ways?"}, {"time": 5318, "text": "Maybe for rapid, but for Blitz, think if you're playing Blitz, you're mostly playing on short calculation and intuition."}, {"time": 5327, "text": "And I think those are probably enhanced if you've had a little bit of, a little bit to drink."}, {"time": 5334, "text": "Can you explain the physiology of why that's, why it's enhanced or the?"}, {"time": 5341, "text": "You're just, you're thinking less."}, {"time": 5343, "text": "You're more confident."}, {"time": 5344, "text": "Oh yeah, it's confidence."}, {"time": 5346, "text": "I think it's just confidence."}, {"time": 5347, "text": "I think also like a lot of people feel like they're better at speaking languages, for instance, if they've drunk a little bit, it's just like removing these barriers."}, {"time": 5359, "text": "I think that it's a little bit of the same in chess."}, {"time": 5365, "text": "In 2012, I played the World Blitz Championship."}, {"time": 5367, "text": "And then I was doing horribly for a long time."}, {"time": 5373, "text": "I also had food poisoning there."}, {"time": 5374, "text": "I couldn't play at all for three days."}, {"time": 5377, "text": "So before the last break, I was like in the middle of the pack, like in, I don't know, 20th place or something."}, {"time": 5386, "text": "And so I decided like, as the last, last gasp, I'm going to go to the mini bar and just have a few drinks."}, {"time": 5394, "text": "And what happened is that I came back and I was suddenly relaxed and I was playing fast and I was playing confidence."}, {"time": 5403, "text": "And I thought I was playing so well."}, {"time": 5405, "text": "I wasn't playing nearly as well as I thought, but it still helped me."}, {"time": 5410, "text": "Like I won my remaining eight games."}, {"time": 5411, "text": "And if there had been one more round, I probably would have won the whole thing."}, {"time": 5416, "text": "But finally I was second."}, {"time": 5418, "text": "So generally I wouldn't recommend that, but maybe as the last resort sometimes, like if you feel that you have the ability, like obviously none of this is remotely relevant if you don't feel like you have the ability to begin with."}, {"time": 5431, "text": "But if you feel like you have the ability, there are just factors that make it impossible for you to show it."}, {"time": 5442, "text": "Like numbing your mind a bit can probably be a good thing."}, {"time": 5445, "text": "Yeah, well, it's interesting, especially during training, you have all kinds of sports that have interacted with a lot of athletes and grappling sports."}, {"time": 5454, "text": "It's different when you train under extreme exhaustion."}, {"time": 5457, "text": "For example, you start becoming, you start to discover interesting things."}, {"time": 5461, "text": "You start being more creative."}, {"time": 5462, "text": "A lot of people, at least in Brazilian jiu jitsu, they'll smoke weed."}, {"time": 5469, "text": "It creates this kind of anxiety and relaxation that kind of enables that creative aspect."}, {"time": 5476, "text": "It's interesting for training."}, {"time": 5477, "text": "Of course you can't rely on any one of those things too much, but it's cool to throw in like a few drinks every once in a while to, yeah."}, {"time": 5485, "text": "One, first of all, to relax and have fun."}, {"time": 5488, "text": "And two, to kind of try things differently, to unlock a different part of your brain."}, {"time": 5493, "text": "What about supplements?"}, {"time": 5495, "text": "Do you, are you a coffee guy?"}, {"time": 5500, "text": "I quite like the taste of coffee."}, {"time": 5504, "text": "But the thing is I've never had a job."}, {"time": 5508, "text": "So I've never needed to wake up early."}, {"time": 5510, "text": "So my thought is basically that if I'm tired, I'm tired."}, {"time": 5516, "text": "Then I'll, you know, then I'll work it out."}, {"time": 5521, "text": "So I don't wanna ever make my brain get used to coffee."}, {"time": 5528, "text": "Like if you see me drinking coffee, that's, that probably means that I'm massively, massively hungover and I don't, I just want to try anything to make my brain work."}, {"time": 5545, "text": "But for a lot of people, like you said, taste of coffee, for a lot of people coffee is part of a certain kind of ritual."}, {"time": 5552, "text": "That they enjoy, you know."}, {"time": 5552, "text": "So, but you can have rituals without that."}, {"time": 5554, "text": "I know that I would enjoy it a lot."}, {"time": 5556, "text": "Yeah, just you don't wanna rely on it."}, {"time": 5560, "text": "I also like the taste, so there's no problem there."}, {"time": 5567, "text": "So how does that, what like, what, you know, a lot of people talk about the extreme stress that chest puts in your body, physically and mentally."}, {"time": 5580, "text": "How do you prepare for that, to be physically and mentally?"}, {"time": 5582, "text": "Is it just through playing chess, or do you do cardio and any of that kind of stuff?"}, {"time": 5587, "text": "This is kind of it up and down."}, {"time": 5588, "text": "Like, as I said in 2013, I was in, I was in great shape."}, {"time": 5595, "text": "Like, I mean, generally I was exercising, doing sports every day, either playing football or tennis or even other, other sports."}, {"time": 5606, "text": "Otherwise, if I couldn't do that, I would try and take my bike for a ride."}, {"time": 5614, "text": "I had a few training camps and I played tennis against one of my seconds."}, {"time": 5618, "text": "Like, he's not a super fit guy, but he's always been very good at tennis."}, {"time": 5623, "text": "And I never like played in any organized way."}, {"time": 5627, "text": "And that was like, that was the perfect exercise because I was running around enough to make the games pretty competitive."}, {"time": 5638, "text": "And it meant that he had to run a bit less as well."}, {"time": 5641, "text": "But he was just, he said like, he was shocked that if we played like for two hours, I wouldn't flinch at all."}, {"time": 5654, "text": "So like a combination of fun and the differential between skill result in good cardio."}, {"time": 5661, "text": "Yeah, but it's just that, so in those days I was pretty, I was pretty fit in that sense."}, {"time": 5669, "text": "I've always liked doing sports, but at times, you know, I think in winter, especially, like I never had like a schedule."}, {"time": 5677, "text": "So at times I'll let myself go a little bit."}, {"time": 5682, "text": "And I've always kind of done it more for fun than like for a concrete benefit."}, {"time": 5688, "text": "But now I'm at least after the pandemic, I was not in great shape."}, {"time": 5692, "text": "So now I'm trying to get back, get better, get better habits and so on."}, {"time": 5700, "text": "But I feel like I've always been the poster boy for making being fit a big thing in chess."}, {"time": 5711, "text": "And I always felt that it was not really a deserve because I never liked doing weights much at all."}, {"time": 5719, "text": "I run a bit at times, but I never liked it too much."}, {"time": 5723, "text": "You just love playing sports."}, {"time": 5724, "text": "I just love playing sports."}, {"time": 5726, "text": "So that I think people confuse that because I'm not like massively athletic, but I do, I am decent at sports and that sort of helped build that perception."}, {"time": 5739, "text": "Even though others who are top level chess players, they're more fit like Karana, for instance, he's really, really, his body is really, really strong."}, {"time": 5751, "text": "It's just that he doesn't."}, {"time": 5752, "text": "He like goes to the gym and."}, {"time": 5753, "text": "Yeah, if he doesn't play sports, that's the difference."}, {"time": 5757, "text": "And the thing about sports is also is just, it's an escape."}, {"time": 5762, "text": "It helps you forget for a brief moment about like the obsessions, the pursuits of the main thing, which is chess."}, {"time": 5772, "text": "And I think it's, it also helps your main pursuit to feel that you're even if not mastering, but like doing well in something, in something else."}, {"time": 5784, "text": "Like I found that if I just juggle a ball, that makes me feel better before a game."}, {"time": 5792, "text": "So a skilled activity."}, {"time": 5794, "text": "Juggle of football, yeah."}, {"time": 5795, "text": "Yeah, skilled activity that you can improve on over time."}, {"time": 5799, "text": "It like flexes the same kind of muscle, but on the thing that you're much worse at."}, {"time": 5805, "text": "It focuses you, relaxes you, that's really interesting."}, {"time": 5807, "text": "What's the perfect day in the life of Magnus Carlsen when he's training?"}, {"time": 5813, "text": "So like, what's a good training regimen in terms of, you know, daily kind of training that you have to put in across many days, months, and years to just keep yourself sharp in terms of chess?"}, {"time": 5827, "text": "I would say when I'm at home, I do very little deliberate practice."}, {"time": 5832, "text": "I've never been that guy at all."}, {"time": 5834, "text": "Like I could never force myself to just sit down and work."}, {"time": 5838, "text": "So deliberate practice, just so maybe you can educate me, for some grandmasters, what would that look like?"}, {"time": 5845, "text": "Just doing puzzles kind of thing?"}, {"time": 5848, "text": "Yeah, doing puzzles and opening analysis."}, {"time": 5850, "text": "That would be the main things."}, {"time": 5853, "text": "Studying games?"}, {"time": 5854, "text": "Just studying games, yeah, a little bit."}, {"time": 5858, "text": "But I feel like that's something that I do."}, {"time": 5863, "text": "But it's not deliberate, it's like reading an article or reading a book."}, {"time": 5868, "text": "Like I love chess books, I'll read just anything and I'll find something interesting."}, {"time": 5874, "text": "So chess books that are like on openings and stuff like that, or chess books that go over different games?"}, {"time": 5880, "text": "Yeah, books on, so there are three main categories."}, {"time": 5885, "text": "There are books on openings and there are books on strategy and there are books on chess history and I find all of them very, very interesting."}, {"time": 5892, "text": "Like what fraction of the day would you say you have a chess board floating somewhere in your head?"}, {"time": 5898, "text": "Meaning like you're thinking about it."}, {"time": 5901, "text": "Probably be a better question to ask, how many hours a day I don't have a chess board floating."}, {"time": 5907, "text": "I mean it could be just floating there and nothing's happening, but like."}, {"time": 5912, "text": "I often do it parallel to some other activity though."}, {"time": 5917, "text": "Like are you daydreaming like different, is it actual positions you're just fucking around with?"}, {"time": 5922, "text": "Like fumbling with different pieces in your head?"}, {"time": 5925, "text": "Often I've looked at a random game on my phone for instance or in a book and then my brain just keeps going at the same position analyzing it and often it goes all the way to the end game."}, {"time": 5938, "text": "And those are actual games or you conjure up like fake games?"}, {"time": 5942, "text": "No, they were often based on real games and then I'm thinking like oh, but it wouldn't be more interesting if the pieces were a little bit different and then often I play it out from there."}, {"time": 5952, "text": "So you don't have, like you don't sit behind a computer or a chess board and you lay out the pieces and then you're."}, {"time": 5960, "text": "No, I'm not at all a poster boy for deliberate practice."}, {"time": 5965, "text": "I could never, I could never work that way."}, {"time": 5967, "text": "My first coach, he gave me some exercises that are at home sometimes, but he realized at some point that wasn't gonna work."}, {"time": 5980, "text": "Because I wouldn't do it really or enjoy it."}, {"time": 5984, "text": "So what he would do instead is that at the school where I had the trainings with him, there was this massive chess library."}, {"time": 5994, "text": "So he was just like yeah, pick out books."}, {"time": 5996, "text": "You can have anything, you can have anything you want."}, {"time": 6000, "text": "Just pick out books you like and then you give it back the next time."}, {"time": 6003, "text": "So that's what I did instead."}, {"time": 6005, "text": "Yeah, I just absolutely raided the, then my next tournament I will try out one of the openings from that book if it was an opening book and so on."}, {"time": 6014, "text": "Does it feel like a struggle, like challenging?"}, {"time": 6017, "text": "Like to be thinking those positions or is it fun and relaxing?"}, {"time": 6020, "text": "No, it's completely fine."}, {"time": 6024, "text": "Like if it's a difficult position to figure out, you know, like to calculate."}, {"time": 6027, "text": "Then I go on to something else."}, {"time": 6030, "text": "Like if I can't figure it out, then you know, I go on."}, {"time": 6035, "text": "Change it so that it's easier to figure out."}, {"time": 6037, "text": "There was a point in your life where Kasparov was interested in being your coach or at least training with you."}, {"time": 6043, "text": "Why did you choose not to go with him?"}, {"time": 6045, "text": "That's a pretty bold move."}, {"time": 6047, "text": "Was there a good reason for this?"}, {"time": 6049, "text": "No, the first like homework exercise he gave me was to analyze, like he picked out, I think, three or four of my worst losses and he wanted me to analyze them and give him my thoughts."}, {"time": 6065, "text": "And it wasn't that there were painful losses or anything that that was a problem."}, {"time": 6070, "text": "I just didn't really enjoy that."}, {"time": 6074, "text": "Also, I felt that this whole structured approach and everything."}, {"time": 6081, "text": "I just felt like from the start, it was a hassle."}, {"time": 6083, "text": "So I loved the idea of being able to pick his brain but everything else, I just, you know, couldn't see myself, couldn't see myself enjoying."}, {"time": 6095, "text": "And at the end of the day, I did then and always have played for fun."}, {"time": 6102, "text": "That's always been the main reason, so."}, {"time": 6105, "text": "It's great that you had the confidence to sort of basically turn down the approach of one of the greatest chess players of all time."}, {"time": 6112, "text": "At that time, probably the greatest chess player of all time."}, {"time": 6115, "text": "I don't think I thought of it that way."}, {"time": 6118, "text": "I just thought this is not for me."}, {"time": 6120, "text": "I wouldn't try another way."}, {"time": 6121, "text": "I don't think I was particularly thinking that this is my one opportunity or anything."}, {"time": 6126, "text": "It was just, yeah, I don't enjoy this."}, {"time": 6128, "text": "Let's try something else."}, {"time": 6129, "text": "When you were 13, you faced Kasparov and he wasn't able to beat you."}, {"time": 6135, "text": "Can you go through that match?"}, {"time": 6137, "text": "How important was that?"}, {"time": 6139, "text": "Was that, how epic was that?"}, {"time": 6140, "text": "We played three games."}, {"time": 6142, "text": "I lost two and I drew one."}, {"time": 6145, "text": "Right, but one draw."}, {"time": 6147, "text": "No, the one draw."}, {"time": 6149, "text": "And but didn't you say that you kind of had a better position in that?"}, {"time": 6152, "text": "Yeah, I remember that day very well."}, {"time": 6155, "text": "There was a Blitz game."}, {"time": 6156, "text": "This was a rapid tournament and there was a Blitz tournament the day before which determined the pairings for the rapid."}, {"time": 6166, "text": "For people who don't know, super short games are called bullet."}, {"time": 6169, "text": "Kind of short games are called Blitz."}, {"time": 6171, "text": "Semi short games are called rapid."}, {"time": 6176, "text": "And classic chess, I guess, is like very super long."}, {"time": 6180, "text": "Yeah, basically, bullet is just never played over the board."}, {"time": 6183, "text": "So in terms of over the board chess, Blitz is the shortest."}, {"time": 6186, "text": "Rapid is like a hybrid between classical and Blitz."}, {"time": 6191, "text": "You need to have the skills to both and then classical is long."}, {"time": 6195, "text": "The Blitz tournament, which didn't go so well."}, {"time": 6198, "text": "Like I got a couple of wins, but I was beaten badly in a lot of games, including by Gary."}, {"time": 6204, "text": "And so there was the pairing that I had to play him which was pretty exciting."}, {"time": 6208, "text": "So I remember I was so tired after the Blitz tournament."}, {"time": 6211, "text": "Like I slept for 12 hours or something."}, {"time": 6214, "text": "Then I woke up like, okay, I'll turn on my computer."}, {"time": 6217, "text": "I'll search chess space for Kasparov and we'll go from there."}, {"time": 6224, "text": "So before that, I hadn't spent like a lot of time specifically studying his games."}, {"time": 6229, "text": "It was super intimidating because a lot of these openings I knew."}, {"time": 6234, "text": "I was like, oh, he was the first one to play that."}, {"time": 6236, "text": "Oh, that was his idea."}, {"time": 6237, "text": "I actually didn't know that."}, {"time": 6239, "text": "So I was a bit intimidated before we played."}, {"time": 6242, "text": "Then of course the first game, he arrived a bit late because they changed the time from the first day to the other, which was a bit strange."}, {"time": 6251, "text": "But everybody else had noticed it but him."}, {"time": 6255, "text": "Then he tried to surprise me in the opening."}, {"time": 6257, "text": "I think like psychologically, the situation was not so easy for him."}, {"time": 6261, "text": "Like clearly it would be embarrassing for him if he didn't win both games against me."}, {"time": 6266, "text": "Then like I was spending way too much time on my moves because I was playing Kasparov."}, {"time": 6272, "text": "I was double checking everything too much."}, {"time": 6273, "text": "Like normally I would be playing pretty fast in those days."}, {"time": 6277, "text": "And then at some point I calculated better than him."}, {"time": 6282, "text": "He missed a crucial detail and had a much better position."}, {"time": 6286, "text": "I couldn't convert it though."}, {"time": 6288, "text": "I knew what line I had to go for in order to have a chance to win."}, {"time": 6292, "text": "But I thought like, I'll play a bit more carefully."}, {"time": 6295, "text": "Maybe I can win still."}, {"time": 6296, "text": "I couldn't."}, {"time": 6298, "text": "And then I lost the second game pretty badly, which it wasn't majorly upsetting, but I felt that I had two black games against Kasparov both in the blitz and the rapid and I lost both of them without any fight whatsoever."}, {"time": 6312, "text": "I wasn't happy about that at all."}, {"time": 6314, "text": "That was like less than I thought I could be able to do."}, {"time": 6319, "text": "So to me, yeah, I was proud of that, but it was a gimmick."}, {"time": 6325, "text": "That was like a very strong IAM that had GM strength."}, {"time": 6330, "text": "I was like, it can happen that a player of that strength makes a draw against Gary once in a while."}, {"time": 6337, "text": "But I mean, I understand that I'm 13, but like still I felt a bit more gimmicky than anything."}, {"time": 6344, "text": "I mean, I guess it's a good thing that made me noticed, but apart from that, it wasn't."}, {"time": 6351, "text": "And for people who don't know, IAM is international master and GM is grand master."}, {"time": 6356, "text": "And you were just on the, I guess, on the verge of becoming a youngest grand master ever."}, {"time": 6361, "text": "I was the second youngest ever."}, {"time": 6364, "text": "I think I'm like the seventh youngest now."}, {"time": 6366, "text": "I mean, these kids these days."}, {"time": 6368, "text": "Kids these days."}, {"time": 6370, "text": "Yeah, but I was the youngest grand master at the time in the world."}, {"time": 6377, "text": "So there is a, you say it's gimmicky, but there's a romantic notions, especially as things have turned out, right?"}, {"time": 6387, "text": "And have you talked to Gary since then about that?"}, {"time": 6391, "text": "I think he's immersed."}, {"time": 6393, "text": "He's still bitter, you think?"}, {"time": 6395, "text": "No, I don't think he's bitter, but I think the game in itself was a bit embarrassing for him."}, {"time": 6401, "text": "Even he can't see past like... No, no, no."}, {"time": 6406, "text": "I think he's completely fine with that."}, {"time": 6407, "text": "I think like in retrospect, it's a good story."}, {"time": 6411, "text": "He appreciates that."}, {"time": 6413, "text": "I don't think that's the problem, but it never made sense for me to broach the subject with him."}, {"time": 6418, "text": "Yeah, it's funny just having interacted with Gary, now having talked to you, there is a little thing you still hate losing."}, {"time": 6428, "text": "No matter how beautiful like that moment is, because it's like, in a way it's a passing of the baton from like one great champion to another, right?"}, {"time": 6437, "text": "But you still just don't like the fact that you didn't play a good game from Gary's perspective."}, {"time": 6442, "text": "Like he still is just annoyed probably that he could have played better."}, {"time": 6447, "text": "And we did, so we did work together in 2009, quite a lot."}, {"time": 6453, "text": "And that corporation ended early 2010, but we did play a lot of training games in 2009, which was interesting because he was still very, very strong."}, {"time": 6467, "text": "And at that time it was fairly equal."}, {"time": 6469, "text": "Like he was out playing me quite a bit, but I was fighting well, so it was pretty even then."}, {"time": 6477, "text": "So I mean, I appreciate those games a lot more than some random game from when I was 13."}, {"time": 6483, "text": "And maybe I just don't know what I'm talking about, but I've always found it, at least based on that game, you couldn't tell that I was gonna take his, that I was gonna take his spot."}, {"time": 6497, "text": "Like I made a horrible blunder and lost to an Uzbek kid in the World Rapid Championship in 2018."}, {"time": 6508, "text": "And I mean, granted he was part of the team that now won gold in the Chess Olympia, but he wasn't the crucial part."}, {"time": 6514, "text": "He barely played any games."}, {"time": 6515, "text": "Like it wasn't like I would think that he would become world champion because he beat me."}, {"time": 6519, "text": "I'm always skeptical of those who said that they knew that I was gonna be world champion after that game or at all at that time."}, {"time": 6528, "text": "I mean, it was easy to see that I would become a very, very strong player."}, {"time": 6532, "text": "Everybody could see that, but to be the best in the world or one of the best ever, that's hard to say."}, {"time": 6539, "text": "It is hard to say, but I do remember seeing Messi when he was 16 and 17."}, {"time": 6545, "text": "But hasn't that happened with other players though?"}, {"time": 6547, "text": "Yeah, but I just had a personal experience."}, {"time": 6550, "text": "He did look different than, there's like magic there."}, {"time": 6554, "text": "Maybe you can't tell he would be one of the greatest ever, but there's still magic."}, {"time": 6560, "text": "Most of the time we try to project, we see a young kid being an older person and you start to think, okay, this could be the next great person."}, {"time": 6568, "text": "Then we forget when they don't become that."}, {"time": 6571, "text": "That's I think what happens."}, {"time": 6573, "text": "But when it does become."}, {"time": 6574, "text": "Or maybe some people are just so good at seeing these patterns that they can actually see."}, {"time": 6580, "text": "Aren't you supposed to do that kind of thing with fantasy football, like see the long shot and bet on them and then they turn out to be good?"}, {"time": 6587, "text": "No, you make a lot of long shot bets and then some of them come good."}, {"time": 6592, "text": "And then people call you a genius for making the bet."}, {"time": 6594, "text": "Well, let me ask you the goat question again, from fantasy perspective."}, {"time": 6599, "text": "Can you make the case for the greatest chess player of all time for each yourself, Magnus Carlsen, for Garry Kasparov, I don't know who else, Bobby Fischer, Mikhail Atal, anyone else, for Hikaru Nakamura?"}, {"time": 6617, "text": "Yeah, I think I can make a case for myself, for Garry and for Fischer."}, {"time": 6623, "text": "So I'll start with Fischer."}, {"time": 6625, "text": "For him, it's very, very simple."}, {"time": 6630, "text": "He was ahead of his time, but that's like intangible."}, {"time": 6633, "text": "You can say that about a lot of people."}, {"time": 6635, "text": "But he had a peak from 1970 to 72 when he was so much better than the others."}, {"time": 6643, "text": "He won 20 games in a row."}, {"time": 6646, "text": "Also the way that he played was so powerful and with so few mistakes that he just had no opposition there."}, {"time": 6654, "text": "So he had just a peak that's been better than anybody."}, {"time": 6660, "text": "The gap between first and second was the highest."}, {"time": 6662, "text": "The gap between him and others was greater than it's ever been in history at any other time."}, {"time": 6668, "text": "And that would be the argument for him."}, {"time": 6672, "text": "For Garry, he's played in a very competitive era and he's beaten several generations."}, {"time": 6681, "text": "He was the best, well, he was the consensus best player, I would say for almost 20 years, which nobody else has done at least in recent time."}, {"time": 6696, "text": "So the longevity."}, {"time": 6698, "text": "The longevity for sure."}, {"time": 6699, "text": "Also at his peak, he was not quite the level of Fisher in terms of the gap, but it was similar to, or I think even a little bit better than mine."}, {"time": 6712, "text": "As for me, I'm of course unbeaten as a world champion in five tries."}, {"time": 6720, "text": "I've been world number one for 11 years straight in an even more competitive era than Garry."}, {"time": 6727, "text": "I have the highest chest rating of all time."}, {"time": 6730, "text": "I have the longest streak ever without losing a game."}, {"time": 6735, "text": "I think for me, the main argument would be about the era where the engines have leveled the playing field so much that it's harder to dominate."}, {"time": 6748, "text": "And still, I haven't always been a clear number one, but I've been number one for 11 years."}, {"time": 6755, "text": "And for a lot of the time, the gap has been pretty big."}, {"time": 6759, "text": "So I think there are decent arguments for all of them."}, {"time": 6763, "text": "I've said before, and I haven't changed my mind that Garry generally edges it because of the longevity in the competitive era, but there are arguments."}, {"time": 6775, "text": "But people also talk about you in terms of the style of play."}, {"time": 6778, "text": "So it's not just about dominance or the height or the, it's like just the creative genius of it."}, {"time": 6785, "text": "Yeah, but I'm not interested in that."}, {"time": 6787, "text": "In terms of greatest of all time, I'm not interested in questions of style."}, {"time": 6796, "text": "So for Messi, you don't give credit for the style, for the stylistic."}, {"time": 6801, "text": "I like, no, I like watching it, I just."}, {"time": 6804, "text": "But you're not gonna give points for the, so Messi gets the best ever because of the finishing."}, {"time": 6810, "text": "Yeah, it's the, no, it's not because of the finishing, it's because of his overall impact on the game."}, {"time": 6817, "text": "It's higher than anybody else's."}, {"time": 6821, "text": "He contributes, he just contributes more to winning than anybody else does."}, {"time": 6826, "text": "What's, so you're somebody who was advocated for and has done quite a bit of study of classic games."}, {"time": 6833, "text": "What would you say is, I mean, maybe the number one or maybe top three games of chess ever played?"}, {"time": 6841, "text": "That doesn't interest me at all."}, {"time": 6844, "text": "You don't think of them, that was very curious."}, {"time": 6845, "text": "No, I don't think of it."}, {"time": 6846, "text": "I mean, I try to, I find the games interesting."}, {"time": 6849, "text": "I try to learn from them, but like trying to rank them has never interested me."}, {"time": 6853, "text": "What games pop out to you as like super interesting then?"}, {"time": 6856, "text": "Is there things like where idea, like old school games where there was like interesting ideas that you go back, that you go back or like you find surprising and pretty cool that those ideas are developed like that?"}, {"time": 6874, "text": "Is there something that jumps to mind?"}, {"time": 6875, "text": "Yeah, there are several games of young Kasparov, like before he became world champion."}, {"time": 6883, "text": "If you're gonna ask for like my favorite player or favorite style, that's probably."}, {"time": 6889, "text": "Can you describe stylistically or in any other way what young Kasparov was like that you like?"}, {"time": 6897, "text": "It was just an overflow energy in his play."}, {"time": 6899, "text": "So aggressive."}, {"time": 6900, "text": "Yeah, extremely aggressive, dynamic chess."}, {"time": 6904, "text": "It probably appeals to me a lot because these are the things that I cannot do as well, that it just feels very special to me."}, {"time": 6915, "text": "But yeah, in terms of games, I never thought about that too much."}, {"time": 6923, "text": "Is there memories, big or small, weird, surprising, just any kind of beautiful anecdote from your chess career?"}, {"time": 6933, "text": "Like stuff that pops out that people might not know about?"}, {"time": 6937, "text": "Just stuff when you look back, it just makes you smile."}, {"time": 6939, "text": "No, so I'll tell you about the most satisfying tournament victory of my career."}, {"time": 6946, "text": "So that was the Norwegian championship under 11 in 2000."}, {"time": 6952, "text": "Before that tournament, I was super anxious because I started like kind of late at chess."}, {"time": 6960, "text": "I played my first tournament when I was eight and a half."}, {"time": 6962, "text": "And a lot of my competitors had already played for a couple of years or even three, four years at that point."}, {"time": 6970, "text": "And the first time I, so I played the under 11 championship in 99."}, {"time": 6975, "text": "I was like a little over the middle of the pack."}, {"time": 6978, "text": "I'd never played against any of them before."}, {"time": 6980, "text": "So I didn't know what to expect at all."}, {"time": 6982, "text": "And then over the next year, I was just like edging a little bit closer."}, {"time": 6986, "text": "In each tournament, I felt like I was getting a little bit better."}, {"time": 6989, "text": "And when we had the championship, I knew that I was ready, that I was now at the same level of the best players."}, {"time": 6998, "text": "I was so anxious to show it."}, {"time": 7001, "text": "I remember I was just, the feeling of excitement and nervousness before the tournament was incredible."}, {"time": 7007, "text": "The tournament was weird because I started out, I gave away a draw to a weaker player, whom I shouldn't have drawn to."}, {"time": 7017, "text": "And then I drew against the other guy who was clearly like the best or second best."}, {"time": 7025, "text": "And at that point, I thought it was over because I thought he wouldn't give away points to others."}, {"time": 7032, "text": "And then the very next day he lost to somebody."}, {"time": 7036, "text": "So then the rest of the tournament, it was just like, I was always like playing my game and watching his."}, {"time": 7041, "text": "And we both won the rest of our games, but it meant that I was half a point ahead."}, {"time": 7047, "text": "Like the feeling when I realized that I was gonna win, that was just so amazing."}, {"time": 7054, "text": "It was like the first time that I was the best at my age."}, {"time": 7061, "text": "And at that point."}, {"time": 7063, "text": "You were hooked."}, {"time": 7064, "text": "Yeah, at that point I realized, I could actually be very good at this."}, {"time": 7069, "text": "So you kind of saw, what did you think your ceiling would be?"}, {"time": 7073, "text": "Did you see that one day you could be the number one?"}, {"time": 7077, "text": "No, I didn't think that was possible at all."}, {"time": 7082, "text": "When did you first?"}, {"time": 7082, "text": "I could be the best in Norway."}, {"time": 7085, "text": "The best in Norway?"}, {"time": 7086, "text": "At that point."}, {"time": 7087, "text": "Because like I started relatively late."}, {"time": 7089, "text": "Right, so yeah."}, {"time": 7090, "text": "And also like, I knew that I studied a lot more than the others."}, {"time": 7097, "text": "I knew that I had a passion that they didn't have."}, {"time": 7099, "text": "They saw chess as something like, it was a hobby."}, {"time": 7106, "text": "It was like an activity."}, {"time": 7107, "text": "It was like going to football practice or any other sports."}, {"time": 7114, "text": "Like you go, you practice like once or twice a week, and then you play a tournament at the weekend."}, {"time": 7121, "text": "For me, it wasn't like that."}, {"time": 7122, "text": "Like I would go with my books and my board every day after school."}, {"time": 7129, "text": "And I would just constantly be trying to learn new things."}, {"time": 7135, "text": "I had like two hours of internet time on the computer each week."}, {"time": 7141, "text": "And I would always spend them on chess."}, {"time": 7144, "text": "Like I think before I was 13 or 14, I'd never opened a browser for any other reason than to play chess."}, {"time": 7159, "text": "Would you describe that as love or as obsession or something in between?"}, {"time": 7163, "text": "It's everything?"}, {"time": 7165, "text": "Yeah, everything, so I mean, it wasn't hard for me to tell at that point that I had something that the other kids didn't because I was never the one to grasp something very, very quickly."}, {"time": 7181, "text": "But once I started, I always got hooked and then I never stopped learning."}, {"time": 7186, "text": "What would you say, you've talked about the middle game as a place where you can play pure chess."}, {"time": 7192, "text": "What do you think is beautiful to you about chess?"}, {"time": 7196, "text": "Like the thing when you were 11."}, {"time": 7198, "text": "What is beautiful to me is when your opponent can predict every single one of your moves and they still lose."}, {"time": 7207, "text": "No, like it means that at some point early, your planning, your evaluation has been better."}, {"time": 7214, "text": "So that you play just very simply, very clearly."}, {"time": 7217, "text": "It looks like you did nothing special and your opponent lost without a chance."}, {"time": 7222, "text": "So you're, how do you think about that?"}, {"time": 7224, "text": "By the way, are you basically narrowed down this gigantic tree of options to where your opponent has less and less and less options to win, to escape, and then they're trapped."}, {"time": 7237, "text": "Is there some aspect to the patterns themselves, to the positions, to the elegance of like the dynamics of the game that you just find beautiful that doesn't, that where you forget about the opponent?"}, {"time": 7253, "text": "General, I try and create harmony on the board."}, {"time": 7258, "text": "Like what I would usually find harmonious is that the pieces work together, that they protect each other and that there are no pieces that are suboptimally placed."}, {"time": 7273, "text": "Or if they are suboptimally placed, they can be improved pretty easily."}, {"time": 7279, "text": "Like I hate when I have one piece that I know is badly placed and I can't improve it."}, {"time": 7286, "text": "When, yeah, when you're thinking about the harmony of the pieces, when you're looking at the position, you're evaluating it, are you looking at the whole board or is it like a bunch of groupings of pieces overlapping?"}, {"time": 7302, "text": "I would like dancing together kind of thing."}, {"time": 7304, "text": "I would say it's more of the latter that would be more precise that you look."}, {"time": 7310, "text": "I mean, I look mostly closer to the middle, but then I would focus on one, like there are usually like one grouping of pieces on one side and then some more closer to the other side."}, {"time": 7324, "text": "So I would think of it a little bit that way."}, {"time": 7328, "text": "So, and everything's kind of gravitating to the middle."}, {"time": 7331, "text": "If it's going well, then yes."}, {"time": 7333, "text": "And in harmony."}, {"time": 7335, "text": "Yeah, in harmony."}, {"time": 7336, "text": "Or like if you can control the middle, you can more easily attack on both sides."}, {"time": 7343, "text": "That applies to pretty much any game."}, {"time": 7347, "text": "And like attacking on one side without control of the middle would feel very nonharmonious for me."}, {"time": 7357, "text": "Like I talked about the 10th game in the World Championship."}, {"time": 7363, "text": "Like that's the time I was the most nervous."}, {"time": 7365, "text": "And it was because it was the kind of attack that I hate where you just have to, you're abandoned one side and the attack has to work."}, {"time": 7377, "text": "There was one side and part of the middle as well, which I didn't control at all."}, {"time": 7381, "text": "And that's like the opposite of harmony for me."}, {"time": 7385, "text": "What advice would you give to chess players of different levels, how to improve in chess?"}, {"time": 7394, "text": "Very beginner, complete beginner."}, {"time": 7396, "text": "I mean, at every level, is there something you can say?"}, {"time": 7399, "text": "It's very hard for me to say."}, {"time": 7401, "text": "Because I mean, the easiest way is like love chess, be obsessed."}, {"time": 7408, "text": "Well, that's a really important statement."}, {"time": 7409, "text": "But that doesn't work for everybody."}, {"time": 7411, "text": "So I feel like it can feel like a grind."}, {"time": 7414, "text": "So you're saying the less it can feel like a grind, the better, at least for you."}, {"time": 7421, "text": "But I'm also very, very skeptical about giving advice because I think, again, my way only works if you have some combination of talent and obsession."}, {"time": 7436, "text": "So I'm not sure that I'd generally recommend it."}, {"time": 7439, "text": "Like what I've done doesn't go with what most coaches suggest for their kids."}, {"time": 7446, "text": "I've been lucky that I've had coaches from early on that have been very, very hands off and just allowed me to do my thing, basically."}, {"time": 7456, "text": "Well, there's a lot to be said about cultivating the obsession."}, {"time": 7461, "text": "Like really letting that flourish to where you spend a lot of hours like with the chessboard in your head and it doesn't feel like a struggle."}, {"time": 7471, "text": "No, so like just letting me do my thing."}, {"time": 7475, "text": "Like if you give me a bunch of work, it will probably feel like a chore."}, {"time": 7478, "text": "And if you don't give me, I will spend all of that time on my own without thinking that it's work or without thought that I'm doing this to improve my chess."}, {"time": 7489, "text": "Well, in terms of learning stuff, like books, there's one thing that's relatively novel from your perspective that people are starting now is there's YouTube."}, {"time": 7499, "text": "There's a lot of good YouTubers."}, {"time": 7500, "text": "You're a part time YouTuber."}, {"time": 7502, "text": "You have stuff on YouTube, I guess."}, {"time": 7504, "text": "Yeah, I have, but if you've seen my YouTube, it's mostly like, it's carefree."}, {"time": 7510, "text": "It's generally not high effort content."}, {"time": 7513, "text": "Yeah, but do you like any particular YouTubers?"}, {"time": 7517, "text": "I could just recommend like stuff I've seen."}, {"time": 7519, "text": "So Aged Madar, Gotham Chess, Botez Live."}, {"time": 7525, "text": "I really like St. Louis Chess Club, Daniel Narodetsky, and John Bartholomew."}, {"time": 7532, "text": "Those are good channels, but is there something you can recommend?"}, {"time": 7534, "text": "No, all of them are good."}, {"time": 7537, "text": "You know, the best recommendation I could give is Aged Madar, purely."}, {"time": 7545, "text": "How much did he pay you to say that?"}, {"time": 7547, "text": "No, so the thing about that is that I haven't really, I have, so I can tell you I've never watched any of his videos from start to finish."}, {"time": 7556, "text": "I'm not like, I'm not the target audience, obviously."}, {"time": 7559, "text": "But I think the only chess YouTube video that my dad has ever watched from start to finish is Aged Madar, and he said, like, I watched one of his videos, I wanted to know what it was all about, because I think Aged Madar is like the same strength as my father, or maybe just a little bit weaker, like 1900 or something."}, {"time": 7583, "text": "My father is probably about 2000."}, {"time": 7585, "text": "And my father has played chess his whole life."}, {"time": 7588, "text": "He loves, he absolutely loves the game."}, {"time": 7590, "text": "It was like, that's the only time he's actually sat through one of those videos, and he said, like, yeah, I get it, I enjoy it."}, {"time": 7596, "text": "So that's the best recommendation I could give."}, {"time": 7599, "text": "That's the only channel that my father actually enjoys."}, {"time": 7605, "text": "I talked to him before this to ask him if he has any questions for you."}, {"time": 7608, "text": "And he said, no, just do your thing, you know."}, {"time": 7612, "text": "No, he's so careful, he wouldn't do that."}, {"time": 7614, "text": "He did mention jokingly about Evan's Gambit, I think."}, {"time": 7619, "text": "Is that a thing?"}, {"time": 7620, "text": "Evan's Gambit?"}, {"time": 7621, "text": "It's some weird thing he made up."}, {"time": 7623, "text": "It might be an inside joke."}, {"time": 7624, "text": "I don't know, but he asked me to."}, {"time": 7626, "text": "Well, anyway."}, {"time": 7627, "text": "Yeah, I didn't even get the..."}, {"time": 7630, "text": "It's something he made up."}, {"time": 7631, "text": "I didn't even realize that he plays the Evan's Gambit."}, {"time": 7635, "text": "Like, he plays a lot of Gambits that are..."}, {"time": 7637, "text": "Wait, Evan's Gambit is a thing?"}, {"time": 7638, "text": "Yeah, yeah, that's a thing."}, {"time": 7639, "text": "Like, that's an old opening from the 1800s."}, {"time": 7642, "text": "Captain Evans apparently invented it."}, {"time": 7645, "text": "Why would he mention that particular one?"}, {"time": 7647, "text": "Is there something hilarious about that one?"}, {"time": 7649, "text": "I don't think I've ever faced the Evan's Gambit in a game."}, {"time": 7654, "text": "I feel like both of you are trolling me right now."}, {"time": 7657, "text": "But I mean, he's played a lot of other Gambits."}, {"time": 7662, "text": "Maybe this is the one he wanted to mention."}, {"time": 7665, "text": "So this, maybe this is called the Evan's Gambit as well."}, {"time": 7668, "text": "But I just know it as like the 2G4 Gambit."}, {"time": 7672, "text": "Maybe this is the one."}, {"time": 7673, "text": "Like this one, he has played a bunch."}, {"time": 7680, "text": "And he's been telling me a lot about his games in this line."}, {"time": 7684, "text": "It's like, oh, it's not so bad."}, {"time": 7686, "text": "And I'm like, yeah, but you're a pawn down."}, {"time": 7688, "text": "Yeah, but I can sort of see it."}, {"time": 7690, "text": "I can sort of understand it."}, {"time": 7692, "text": "And he's like, he's proud of the fact that nobody like told him to play this line or anything."}, {"time": 7697, "text": "He came up with it himself."}, {"time": 7699, "text": "And there's this, I'll tell you another story about my father."}, {"time": 7703, "text": "So there's this line that I call, that I called the Henry Carlson line."}, {"time": 7711, "text": "So at some point, you know, he never knew a lot of openings in chess, but I taught him a couple of openings as black."}, {"time": 7720, "text": "It's the, it's the Sveshnikov's Sicilian that I played a lot myself also during the world championship in 2018."}, {"time": 7732, "text": "I won a bunch of games in 2019 as well."}, {"time": 7735, "text": "So that's one opening."}, {"time": 7735, "text": "And I also taught him as black to play the Rogozin defense."}, {"time": 7739, "text": "And then, so the Rogozin defense goes like, goes like this."}, {"time": 7745, "text": "It's characterized by this bishop move."}, {"time": 7750, "text": "And so he would play those openings pretty, pretty exclusively as black in the tournaments that he did play."}, {"time": 7757, "text": "And also the Sveshnikov Sicilian is like, that's the only, two of my sisters play, have played a bunch of chess tournaments as well."}, {"time": 7766, "text": "And that's the only opening they know as well."}, {"time": 7768, "text": "So my family's portrait is very narrow."}, {"time": 7772, "text": "So, so this is the, this is the system."}, {"time": 7775, "text": "Black goes here and then we all from white takes the pawn and black takes the pawn."}, {"time": 7780, "text": "So at some point I was watching one of my, my father's online blitz game, blitz game."}, {"time": 7787, "text": "And as white, he played this, this."}, {"time": 7792, "text": "So this is called the Karkhan defense."}, {"time": 7794, "text": "He took the pawn."}, {"time": 7798, "text": "It was taken back, then he went with the knight."}, {"time": 7802, "text": "His opponent went here and then he played a bishop here."}, {"time": 7805, "text": "So I, I'd never seen this opening before."}, {"time": 7808, "text": "And I was like, wow, how on earth did he come up with that?"}, {"time": 7813, "text": "And he said, no, I just played the Rogozin with the different colors because if the knight was here, it would be the same position."}, {"time": 7819, "text": "I was like, I never, I was like, how, how am I like one of the best players in the world?"}, {"time": 7827, "text": "And I've never thought about that."}, {"time": 7828, "text": "So I actually started playing, I started playing this line as white with pretty decent result and then results."}, {"time": 7836, "text": "And it actually became kind of popular and everybody who asked about the line, it's like, I would always tell them, yeah, that's the Henry Carlson."}, {"time": 7845, "text": "I wouldn't necessarily explain why it was called that."}, {"time": 7848, "text": "I would just always call it that."}, {"time": 7850, "text": "So I really hope at this point, at some point, this line will be, will find its rightful name."}, {"time": 7856, "text": "In the, yeah, finds its way into the history books."}, {"time": 7859, "text": "Can you, what, what, what'd you learn about life from your dad?"}, {"time": 7863, "text": "What role has your dad played in your life?"}, {"time": 7868, "text": "He's taught me a lot of things, but most of all, as long as you win a chess, then everything else is fine."}, {"time": 7875, "text": "I think my, especially my father, but my parents in general, they, they always wanted me to get a good education and find a job and so on."}, {"time": 7891, "text": "Even though my father loves chess and he wanted me to play chess, I don't think he had any plans for me to be professional."}, {"time": 7900, "text": "I think things changed at some point."}, {"time": 7902, "text": "Like I was less and less interested in school and for a long time, we were kind of going back and forth, fighting about that, especially my father, but also my mother a little bit."}, {"time": 7916, "text": "It was at times a little bit difficult."}, {"time": 7918, "text": "They wanted you to go to school."}, {"time": 7919, "text": "Yeah, they sort of wanted me to do more school to have more options."}, {"time": 7924, "text": "And then I think at some point, they just gave up, but I think that sort of coincided when I was actually starting to make real money off tournaments."}, {"time": 7934, "text": "And after that, you know, everything's been sort of easy and like terms of the family, like they've never put any pressure on me or they've never put any demands on me."}, {"time": 7949, "text": "There's just, yeah, my ass has to focus on chess."}, {"time": 7951, "text": "That's that, that's the thing."}, {"time": 7954, "text": "That's, that's, that's it."}, {"time": 7958, "text": "Like, I think they taught me in general to be curious about the world and to get a decent general education, not necessarily from school, but like just knowing about the world around you and knowing history and being, you know, just being interested in society."}, {"time": 7981, "text": "I think in that sense, they've done well."}, {"time": 7984, "text": "And he's been with you throughout your chess career."}, {"time": 7987, "text": "I mean, there's something to be said about just family, support and love that you have that, you know, this world is a lonely place."}, {"time": 7998, "text": "It's good to have people around you that are like, yeah, they got your back kind of, you know?"}, {"time": 8006, "text": "It's a cliche, but I think to some extent, all the people you surround yourself with, they can help you a lot."}, {"time": 8016, "text": "It's only family that only has their own interests at heart."}, {"time": 8021, "text": "And so for that reason, like my father's like the only one that's been like constantly in the team that he's always been around."}, {"time": 8031, "text": "And it's for that reason that I know he has my back, no matter what."}, {"time": 8035, "text": "Now there's a cliche question here, but let's try to actually get to some deep truth perhaps."}, {"time": 8043, "text": "But people who don't know much about chess seem to like to use chess as a metaphor for everything in life."}, {"time": 8050, "text": "But there is some aspect to the decision making to the kind of reasoning involved in chess that's transferable to other things."}, {"time": 8059, "text": "Can you speak to that in your own life and in general?"}, {"time": 8063, "text": "Like the kind of reasoning involved with chess, how much does that transfer to life out there?"}, {"time": 8072, "text": "It just helps you make decisions."}, {"time": 8074, "text": "Of all kinds."}, {"time": 8076, "text": "Yeah, that would be my main takeaway."}, {"time": 8078, "text": "That you learn to make informed guesses in a limited amount of time."}, {"time": 8083, "text": "I mean, does it frustrate you when you have geopolitical thinkers and leaders?"}, {"time": 8089, "text": "You know, Henry Kissinger will often talk about geopolitics as a game of chess or 3D chess."}, {"time": 8095, "text": "Is that too oversimplified of a projection?"}, {"time": 8098, "text": "Or do you think that the kind of deliberations you have on the world stage is similar to the kind of decision making you have on the chessboard?"}, {"time": 8108, "text": "Well, I'm never trying to get reelected when I play a game of chess."}, {"time": 8114, "text": "There's no special interest, you have to get happy."}, {"time": 8116, "text": "Yeah, that kind of helps."}, {"time": 8118, "text": "No, I can understand that."}, {"time": 8123, "text": "Obviously, for every action, there's a reaction and you have to calculate far ahead."}, {"time": 8129, "text": "It probably would be a good thing if more big players on the international scene thought a little bit more like a chess player in that sense, like trying to make good decision based on limited amount of data, rather than thinking about other factors, but it's so tough."}, {"time": 8151, "text": "But it does annoy me when people make moves that they know are wrong for different reasons."}, {"time": 8158, "text": "And they should know, if they did some calculation, they should know they're wrong."}, {"time": 8161, "text": "Yeah, exactly, that they should know that are wrong."}, {"time": 8164, "text": "And so much politics is like, it's, you're often asked to do something when it would be much better to do nothing."}, {"time": 8178, "text": "Like, no, but that happens in chess all the time, like you have a choice."}, {"time": 8184, "text": "Like I often tell people that in certain situations, you should not try and win, you should just let your opponent lose."}, {"time": 8192, "text": "And that happens in politics all the time."}, {"time": 8197, "text": "But yeah, just let your opponents continue whatever they're doing, and then you'll win."}, {"time": 8203, "text": "Don't try to do something just to do something."}, {"time": 8205, "text": "Often, they say in chess that having a bad plan is better than having no plan."}, {"time": 8212, "text": "It's absolute nonsense."}, {"time": 8215, "text": "I forget what General said it, but it was like, don't interrupt your enemy when they're making a mistake."}, {"time": 8222, "text": "I think they're... Also, Petrosian, the former world champion said, when your opponent wants to play Dutch defense, don't stop them."}, {"time": 8233, "text": "I mean, chess players will know that it's the same thing."}, {"time": 8239, "text": "Actually, this reminds me, is there something you found really impressive about Queen's Gambit, the TV show?"}, {"time": 8246, "text": "You know, that's one of the things that really captivated the public imagination about chess."}, {"time": 8250, "text": "People who don't play chess became very curious about the game, about the beauty of the game, the drama of the game, all that kind of stuff."}, {"time": 8257, "text": "Is there, in terms of accuracy, in terms of the actual games played, that you found impressive?"}, {"time": 8264, "text": "First of all, they did the chess well, they did it accurately."}, {"time": 8268, "text": "And also, they found actual games and positions that I'd never seen before."}, {"time": 8273, "text": "And it really captivated me."}, {"time": 8275, "text": "Like, I would not follow the story at times."}, {"time": 8279, "text": "I was just trying to, wow, where the hell did I find that game?"}, {"time": 8283, "text": "Just trying to solve the positions."}, {"time": 8286, "text": "So, Beth Harmon, the main character, were you impressed by the play she was doing in the, like, was there a particular style that they developed consistently?"}, {"time": 8297, "text": "She was just, at the end, she was just totally universal."}, {"time": 8300, "text": "Like, at the start, she was probably a bit too aggressive, but no, she was absolutely universal."}, {"time": 8308, "text": "Wait, what adjective are you using?"}, {"time": 8310, "text": "Universal in the sense that she could play in any style."}, {"time": 8317, "text": "And was dominant in that way."}, {"time": 8318, "text": "So, wow, there was a development in style too throughout the show."}, {"time": 8323, "text": "It's really interesting they did that."}, {"time": 8325, "text": "And it actually happened with me a bit as well."}, {"time": 8329, "text": "Like, I started out really aggressive."}, {"time": 8331, "text": "Then I became probably too technical at some point, taking a little bit too few risks and not playing dynamic enough."}, {"time": 8340, "text": "And then I started to get a little bit better at dynamics so that now I'm, I would say definitely the most universal player in terms of style."}, {"time": 8351, "text": "Are there any skills in chess that are transferable to poker?"}, {"time": 8354, "text": "So as you're playing around with poker a little bit now, how fundamentally different of a game is it?"}, {"time": 8360, "text": "What I find the most transferable probably is not letting past decisions dictate future thinking."}, {"time": 8372, "text": "But in terms of the patterns in the betting strategies and all that kind of stuff, what about bluffing?"}, {"time": 8377, "text": "I bluff way too much."}, {"time": 8380, "text": "It does seem you enjoy bluffing and Daniel Negrano was saying that you're quite good at it."}, {"time": 8386, "text": "But yeah, it has very little material to go by."}, {"time": 8389, "text": "Sample size is small."}, {"time": 8391, "text": "No, I mean, I enjoy bluffing for more of the gambling aspects, the thrill of."}, {"time": 8397, "text": "So not the technical aspect of the bluffing like you would on the chessboard?"}, {"time": 8401, "text": "Not bluffing in the same sense, but there is some element."}, {"time": 8405, "text": "But I do enjoy it on the chessboard."}, {"time": 8409, "text": "Like if I know that like, oh, I successfully scared away my opponent from making the best move, that's of course satisfying."}, {"time": 8416, "text": "In that same way, it might be satisfying in poker, right?"}, {"time": 8420, "text": "That you represent something, you scare away your opponent in the same kind of way."}, {"time": 8425, "text": "And also like you tell a story, you try and tell a story and then they believe it."}, {"time": 8430, "text": "Yeah, tell a story with your betting, with all the different other cues."}, {"time": 8436, "text": "Do you like the money aspect, the betting strategies?"}, {"time": 8440, "text": "So it's almost like another layer on top of it, right?"}, {"time": 8443, "text": "Like it's the uncertainty in the cards, but the betting, there's so much freedom to the betting."}, {"time": 8453, "text": "I'm not very good at that."}, {"time": 8454, "text": "So I cannot say that I understand it completely."}, {"time": 8458, "text": "You know, when it comes to different sizing and all that, I just haven't studied it enough."}, {"time": 8465, "text": "How much of luck is part of poker would you say from what you've seen versus skill?"}, {"time": 8472, "text": "I mean, it's so different in the sense that you can be one of the best players in the world and lose two, three years in a row without that being like a massive outlier."}, {"time": 8483, "text": "Okay, the thing that more than one person told me that you're very good at is trash talking."}, {"time": 8491, "text": "I don't think I am."}, {"time": 8492, "text": "A lot of people who make those observations about me, I think they just expect very, very little."}, {"time": 8500, "text": "So they expect from the best chess player in the world, that just anything that's non robotic is interesting."}, {"time": 8510, "text": "Also, when it comes to trash talking, like I have the biggest advantage in the world that I'm the best at what I'm doing."}, {"time": 8516, "text": "So trash talking becomes very, very, very easy because I can back it up."}, {"time": 8521, "text": "Yeah, but a lot of people that are extremely good at stuff don't trash talk and they're not good at it."}, {"time": 8526, "text": "I don't think I'm very good at it."}, {"time": 8527, "text": "It's just that I can back it up, which makes it seem that I'm better."}, {"time": 8532, "text": "And also."}, {"time": 8532, "text": "You're even doing it now."}, {"time": 8534, "text": "Also being non robotic or not completely robotic helps."}, {"time": 8540, "text": "You're not trash talking, you're just stating facts."}, {"time": 8543, "text": "Have you ever considered that there will be trash talking and over the chess board and some of the big tournaments, like adding that kind of component or even talking, you know, would that completely distract from the game of chess?"}, {"time": 8558, "text": "No, I think it could be fun in, when people play off fan games, when they play Blitz games, like people trash talk all the time."}, {"time": 8568, "text": "It's a normal part of the game."}, {"time": 8569, "text": "So you emphasize fun a lot."}, {"time": 8573, "text": "Do you think we're living inside of a simulation that is trying to maximize fun?"}, {"time": 8583, "text": "But that's only happened for the last 100 years or so."}, {"time": 8588, "text": "No, that's like the."}, {"time": 8590, "text": "Fun has always been increasing, I think."}, {"time": 8593, "text": "It's always been increasing, but I feel like it's been increasing exponentially."}, {"time": 8599, "text": "I mean, or at least the importance of fun."}, {"time": 8602, "text": "But I guess it depends on the society as well."}, {"time": 8604, "text": "Like in the West, we've had such a Christian influence."}, {"time": 8609, "text": "And I mean, Christianity hasn't exactly embraced the concept of fun over time."}, {"time": 8617, "text": "Well, actually to push back, I think forbidding certain things kind of makes them more fun."}, {"time": 8622, "text": "So sometimes I think you need to say, you're not allowed to do this."}, {"time": 8626, "text": "And then a lot of people start doing it and then they have fun doing that because it's like it's doing a thing in the face of the resistance of the thing."}, {"time": 8635, "text": "So whenever there's resistance, that does somehow make it more fun."}, {"time": 8639, "text": "Oppressive regimes has always kind of been kind of good for comedy, no?"}, {"time": 8644, "text": "Like, no, but I heard."}, {"time": 8646, "text": "Supposedly like in the Soviet Union, I don't know about fun, but supposedly comedy, like at least underground, it thrived."}, {"time": 8654, "text": "Yeah, there's a, well, no, it permeates the entire culture."}, {"time": 8656, "text": "There's a dark humor."}, {"time": 8659, "text": "That sort of the cruelty, the absurdity of life really brings out the humor amongst the populace plus vodka on top of that."}, {"time": 8666, "text": "But this idea that, for example, Elon Musk has that the most entertaining outcome is the most likely."}, {"time": 8676, "text": "That it seems like the most absurd, silly, funny thing seems to be the thing that."}, {"time": 8681, "text": "So it happens more often than it should."}, {"time": 8684, "text": "And it somehow becomes viral in our modern connected world."}, {"time": 8689, "text": "And so the fun stuff, the memes spread, and then we start to optimize for the fun meme that seems to be a fundamental property of the reality we live in."}, {"time": 8701, "text": "And so emerges the fun maximizer in all walks of life, like in chess, in poker, in everything."}, {"time": 8714, "text": "You're not skeptical."}, {"time": 8715, "text": "No, I'm not skeptical."}, {"time": 8715, "text": "I'm just, I'm just taking it all in."}, {"time": 8720, "text": "But I find it interesting and not at all impossible."}, {"time": 8725, "text": "Do you ever get lonely?"}, {"time": 8728, "text": "Like a chess player's life is by definition pretty lonely because you have nobody else to blame but yourself when you lose or you don't achieve the results that you want to achieve."}, {"time": 8741, "text": "It's difficult for you to find comfort elsewhere."}, {"time": 8744, "text": "It's in your own mind."}, {"time": 8747, "text": "It's you versus yourself, really."}, {"time": 8748, "text": "Yeah, really."}, {"time": 8750, "text": "But it's, you know, it's part of the profession."}, {"time": 8755, "text": "But I think any like sport or activity where it's just you and your own mind is just by definition lonely."}, {"time": 8764, "text": "Are you worried that it destroys you?"}, {"time": 8768, "text": "As long as I'm aware of it, then it's fine."}, {"time": 8770, "text": "And I don't think the inherent loneliness of my profession really affects the rest of my life in a major way."}, {"time": 8783, "text": "What role does love play in the human condition and in your lonely life of calculation?"}, {"time": 8790, "text": "Well, you know, I'm like everybody else trying, you know..."}, {"time": 8800, "text": "Trying to find love?"}, {"time": 8801, "text": "No, not necessarily like trying to find love."}, {"time": 8803, "text": "Sometimes I am, sometimes I'm not."}, {"time": 8806, "text": "I'm just trying to find my way."}, {"time": 8809, "text": "And my love for the game, obviously it comes and goes a little bit, but there's like, there's always at least some level of love."}, {"time": 8819, "text": "So that doesn't go away."}, {"time": 8821, "text": "But I think in other parts of life, I think it's just about doing things that make you happy, that give you joy, that also makes you more receptive to love in general."}, {"time": 8836, "text": "So that has been my approach to love now for quite a while that I'm just trying to live my best life and then the love will come when it comes and in terms of romantic love, it has come and gone in my life."}, {"time": 8855, "text": "It's not there now, but I'm not worried about that."}, {"time": 8862, "text": "I'm more worried about, you know, not worried, but more like trying to just be a good version of myself."}, {"time": 8870, "text": "I cannot always be the best version of myself, but at least try to be good."}, {"time": 8875, "text": "Yeah, and keep your heart open."}, {"time": 8876, "text": "What is this Daniel Johnson song?"}, {"time": 8879, "text": "True love will find you in the end."}, {"time": 8881, "text": "No, it may or may not."}, {"time": 8883, "text": "But it will only find you if, oh fuck, how does it go?"}]}]