[{"title": "Rajat Monga: TensorFlow | Lex Fridman Podcast #22", "id": "NERNE4UThHU", "quotes": [{"time": 279, "text": "Yes, maybe Google's ahead of where everybody is, but there's a lot to do."}, {"time": 283, "text": "So a lot of this started to make sense and come together."}, {"time": 286, "text": "So the decision to open source, I was just chatting with Chris Glatner about this."}, {"time": 292, "text": "The decision to go open source with TensorFlow, I would say sort of for me personally, seems to be one of the big seminal moments in all of software engineering ever."}, {"time": 301, "text": "I think that's when a large company like Google decides to take a large project that many lawyers might argue has a lot of IP, just decide to go open source with it, and in so doing lead the entire world and saying, you know what, open innovation is a pretty powerful thing, and it's okay to do."}, {"time": 322, "text": "That was, I mean, that's an incredible moment in time."}, {"time": 326, "text": "So do you remember those discussions happening?"}, {"time": 329, "text": "Whether open source should be happening?"}, {"time": 332, "text": "I would say, I think, so the initial idea came from Jeff, who was a big proponent of this."}, {"time": 339, "text": "I think it came off of two big things."}, {"time": 342, "text": "One was research wise, we were a research group."}, {"time": 346, "text": "We were putting all our research out there."}, {"time": 349, "text": "If you wanted to, we were building on others research and we wanted to push the state of the art forward."}, {"time": 355, "text": "And part of that was to share the research."}, {"time": 356, "text": "That's how I think deep learning and machine learning has really grown so fast."}, {"time": 361, "text": "So the next step was, okay, now, would software help with that?"}, {"time": 365, "text": "And it seemed like they were existing a few libraries out there, Tiano being one, Torch being another, and a few others, but they were all done by academia and so the level was significantly different."}, {"time": 378, "text": "The other one was from a software perspective, Google had done lots of software or that we used internally, you know, and we published papers."}, {"time": 389, "text": "Often there was an open source project that came out of that that somebody else picked up that paper and implemented and they were very successful."}, {"time": 398, "text": "Back then it was like, okay, there's Hadoop, which has come off of tech that we've built."}, {"time": 404, "text": "We know the tech we've built is way better for a number of different reasons."}, {"time": 407, "text": "We've invested a lot of effort in that."}, {"time": 411, "text": "And turns out we have Google Cloud and we are now not really providing our tech, but we are saying, okay, we have Bigtable, which is the original thing."}, {"time": 422, "text": "We are going to now provide H base APIs on top of that, which isn't as good, but that's what everybody's used to."}, {"time": 427, "text": "So there's like, can we make something that is better and really just provide, helps the community in lots of ways, but also helps push a good standard forward."}, {"time": 438, "text": "So how does Cloud fit into that?"}, {"time": 439, "text": "There's a TensorFlow open source library and how does the fact that you can use so many of the resources that Google provides and the Cloud fit into that strategy?"}, {"time": 451, "text": "So TensorFlow itself is open and you can use it anywhere, right?"}, {"time": 454, "text": "And we want to make sure that continues to be the case."}, {"time": 458, "text": "On Google Cloud, we do make sure that there's lots of integrations with everything else and we want to make sure that it works really, really well there."}, {"time": 467, "text": "You're leading the TensorFlow effort."}, {"time": 470, "text": "Can you tell me the history and the timeline of TensorFlow project in terms of major design decisions, so like the open source decision, but really what to include and not?"}, {"time": 481, "text": "There's this incredible ecosystem that I'd like to talk about."}, {"time": 484, "text": "There's all these parts, but what if just some sample moments that defined what TensorFlow eventually became through its, I don't know if you're allowed to say history when it's just, but in deep learning, everything moves so fast and just a few years is already history."}, {"time": 503, "text": "Yes, yes, so looking back, we were building TensorFlow."}, {"time": 509, "text": "I guess we open sourced it in 2015, November 2015."}, {"time": 514, "text": "We started on it in summer of 2014, I guess."}, {"time": 519, "text": "And somewhere like three to six, late 2014, by then we had decided that, okay, there's a high likelihood we'll open source it."}, {"time": 527, "text": "So we started thinking about that and making sure we're heading down that path."}, {"time": 533, "text": "At that point, by that point, we had seen a few, lots of different use cases at Google."}, {"time": 539, "text": "So there were things like, okay, yes, you wanna run it at large scale in the data center."}, {"time": 544, "text": "Yes, we need to support different kind of hardware."}, {"time": 547, "text": "We had GPUs at that point."}, {"time": 549, "text": "We had our first GPU at that point or was about to come out roughly around that time."}, {"time": 555, "text": "So the design sort of included those."}, {"time": 558, "text": "We had started to push on mobile."}, {"time": 561, "text": "So we were running models on mobile."}, {"time": 564, "text": "At that point, people were customizing code."}, {"time": 568, "text": "So we wanted to make sure TensorFlow could support that as well."}, {"time": 570, "text": "So that sort of became part of that overall design."}, {"time": 575, "text": "When you say mobile, you mean like a pretty complicated algorithms running on the phone?"}, {"time": 580, "text": "So when you have a model that you deploy on the phone and run it there, right?"}, {"time": 585, "text": "So already at that time, there was ideas of running machine learning on the phone."}, {"time": 589, "text": "We already had a couple of products that were doing that by then."}, {"time": 593, "text": "And in those cases, we had basically customized handcrafted code or some internal libraries that we're using."}, {"time": 600, "text": "So I was actually at Google during this time in a parallel, I guess, universe, but we were using Theano and Caffe."}, {"time": 609, "text": "Was there some degree to which you were bouncing, like trying to see what Caffe was offering people, trying to see what Theano was offering that you want to make sure you're delivering on whatever that is?"}, {"time": 621, "text": "Perhaps the Python part of thing, maybe did that influence any design decisions?"}, {"time": 628, "text": "So when we built this belief and some of that was in parallel with some of these libraries coming up, I mean, Theano itself is older, but we were building this belief focused on our internal thing because our systems were very different."}, {"time": 642, "text": "By the time we got to this, we looked at a number of libraries that were out there."}, {"time": 647, "text": "Theano, there were folks in the group who had experience with Torch, with Lua."}, {"time": 652, "text": "There were folks here who had seen Caffe."}, {"time": 654, "text": "I mean, actually, Yang Jing was here as well."}, {"time": 658, "text": "There's what other libraries?"}, {"time": 662, "text": "I think we looked at a number of things."}, {"time": 664, "text": "Might even have looked at JNR back then."}, {"time": 666, "text": "I'm trying to remember if it was there."}, {"time": 669, "text": "In fact, yeah, we did discuss ideas around, okay, should we have a graph or not?"}, {"time": 677, "text": "So putting all these together was definitely, they were key decisions that we wanted."}, {"time": 682, "text": "We had seen limitations in our prior disbelief things."}, {"time": 688, "text": "A few of them were just in terms of research was moving so fast, we wanted the flexibility."}, {"time": 695, "text": "The hardware was changing fast."}, {"time": 696, "text": "We expected to change that so that those probably were two things."}, {"time": 699, "text": "And yeah, I think the flexibility in terms of being able to express all kinds of crazy things was definitely a big one then."}, {"time": 706, "text": "So what, the graph decisions though, with moving towards TensorFlow 2.0, there's more, by default, there'll be eager execution."}, {"time": 716, "text": "So sort of hiding the graph a little bit because it's less intuitive in terms of the way people develop and so on."}, {"time": 723, "text": "What was that discussion like in terms of using graphs?"}, {"time": 726, "text": "It seemed, it's kind of the Theano way."}, {"time": 729, "text": "Did it seem the obvious choice?"}, {"time": 731, "text": "So I think where it came from was our disbelief had a graph like thing as well."}, {"time": 737, "text": "A much more simple, it wasn't a general graph, it was more like a straight line thing."}, {"time": 743, "text": "More like what you might think of cafe, I guess in that sense."}, {"time": 746, "text": "But the graph was, and we always cared about the production stuff."}, {"time": 751, "text": "Like even with disbelief, we were deploying a whole bunch of stuff in production."}, {"time": 754, "text": "So graph did come from that when we thought of, okay, should we do that in Python?"}, {"time": 759, "text": "And we experimented with some ideas where it looked a lot simpler to use, but not having a graph meant, okay, how do you deploy now?"}, {"time": 767, "text": "So that was probably what tilted the balance for us and eventually we ended up with a graph."}, {"time": 772, "text": "And I guess the question there is, did you, I mean, so production seems to be the really good thing to focus on, but did you even anticipate the other side of it where there could be, what is it?"}, {"time": 784, "text": "What are the numbers?"}, {"time": 785, "text": "It's been crazy, 41 million downloads."}, {"time": 792, "text": "I mean, was that even like a possibility in your mind that it would be as popular as it became?"}, {"time": 799, "text": "So I think we did see a need for this a lot from the research perspective and like early days of deep learning in some ways."}, {"time": 812, "text": "41 million, no, I don't think I imagined this number."}, {"time": 815, "text": "Then it seemed like there's a potential future where lots more people would be doing this and how do we enable that?"}, {"time": 825, "text": "I would say this kind of growth, I probably started seeing somewhat after the open sourcing where it was like, okay, deep learning is actually growing way faster for a lot of different reasons."}, {"time": 839, "text": "And we are in just the right place to push on that and leverage that and deliver on lots of things that people want."}, {"time": 847, "text": "So what changed once you open sourced?"}, {"time": 849, "text": "Like how this incredible amount of attention from a global population of developers, how did the project start changing?"}, {"time": 858, "text": "I don't even actually remember during those times."}, {"time": 862, "text": "I know looking now, there's really good documentation, there's an ecosystem of tools, there's a community, there's a blog, there's a YouTube channel now, right?"}, {"time": 871, "text": "It's very community driven."}, {"time": 873, "text": "Back then, I guess 0.1 version, is that the version?"}, {"time": 879, "text": "I think we call it 0.6 or five, something like that, I forget."}, {"time": 883, "text": "What changed leading into 1.0?"}, {"time": 888, "text": "I think we've gone through a few things there."}, {"time": 891, "text": "When we started out, when we first came out, people loved the documentation we have because it was just a huge step up from everything else because all of those were academic projects, people doing, who don't think about documentation."}, {"time": 904, "text": "I think what that changed was, instead of deep learning being a research thing, some people who were just developers could now suddenly take this out and do some interesting things with it, right?"}, {"time": 916, "text": "Who had no clue what machine learning was before then."}, {"time": 920, "text": "And that I think really changed how things started to scale up in some ways and pushed on it."}, {"time": 927, "text": "Over the next few months as we looked at how do we stabilize things, as we look at not just researchers, now we want stability, people want to deploy things."}, {"time": 936, "text": "That's how we started planning for 1.0 and there are certain needs for that perspective."}, {"time": 942, "text": "And so again, documentation comes up, designs, more kinds of things to put that together."}, {"time": 949, "text": "And so that was exciting to get that to a stage where more and more enterprises wanted to buy in and really get behind that."}, {"time": 957, "text": "And I think post 1.0 and over the next few releases, that enterprise adoption also started to take off."}, {"time": 964, "text": "I would say between the initial release and 1.0, it was, okay, researchers of course, then a lot of hobbies and early interest, people excited about this who started to get on board and then over the 1.x thing, lots of enterprises."}, {"time": 978, "text": "I imagine anything that's below 1.0 gives pressure to be, the enterprise probably wants something that's stable."}, {"time": 988, "text": "And do you have a sense now that TensorFlow is stable?"}, {"time": 993, "text": "Like it feels like deep learning in general is extremely dynamic field, so much is changing."}, {"time": 1000, "text": "And TensorFlow has been growing incredibly."}, {"time": 1003, "text": "Do you have a sense of stability at the helm of it?"}, {"time": 1006, "text": "I mean, I know you're in the midst of it, but."}, {"time": 1008, "text": "Yeah, I think in the midst of it, it's often easy to forget what an enterprise wants and what some of the people on that side want."}, {"time": 1018, "text": "There are still people running models that are three years old, four years old."}, {"time": 1022, "text": "So Inception is still used by tons of people."}, {"time": 1026, "text": "Even ResNet 50 is what, couple of years old now or more, but there are tons of people who use that and they're fine."}, {"time": 1032, "text": "They don't need the last couple of bits of performance or quality, they want some stability in things that just work."}, {"time": 1039, "text": "And so there is value in providing that with that kind of stability and making it really simpler because that allows a lot more people to access it."}, {"time": 1047, "text": "And then there's the research crowd which wants, okay, they wanna do these crazy things exactly like you're saying, right?"}, {"time": 1054, "text": "Not just deep learning in the straight up models that used to be there, they want RNNs and even RNNs are maybe old, they are transformers now."}, {"time": 1063, "text": "And now it needs to combine with RL and GANs and so on."}, {"time": 1068, "text": "So there's definitely that area that like the boundary that's shifting and pushing the state of the art."}, {"time": 1075, "text": "But I think there's more and more of the past that's much more stable and even stuff that was two, three years old is very, very usable by lots of people."}, {"time": 1084, "text": "So that part makes it a lot easier."}, {"time": 1087, "text": "So I imagine, maybe you can correct me if I'm wrong, one of the biggest use cases is essentially taking something like ResNet 50 and doing some kind of transfer learning on a very particular problem that you have."}, {"time": 1099, "text": "It's basically probably what majority of the world does."}, {"time": 1104, "text": "And you wanna make that as easy as possible."}, {"time": 1107, "text": "So I would say for the hobbyist perspective, that's the most common case, right?"}, {"time": 1112, "text": "In fact, the apps and phones and stuff that you'll see, the early ones, that's the most common case."}, {"time": 1117, "text": "I would say there are a couple of reasons for that."}, {"time": 1120, "text": "One is that everybody talks about that."}, {"time": 1124, "text": "It looks great on slides."}, {"time": 1126, "text": "That's a presentation, yeah, exactly."}, {"time": 1129, "text": "What enterprises want is that is part of it, but that's not the big thing."}, {"time": 1134, "text": "Enterprises really have data that they wanna make predictions on."}, {"time": 1138, "text": "This is often what they used to do with the people who were doing ML was just regression models, linear regression, logistic regression, linear models, or maybe gradient booster trees and so on."}, {"time": 1149, "text": "Some of them still benefit from deep learning, but they want that's the bread and butter, or like the structured data and so on."}, {"time": 1156, "text": "So depending on the audience you look at, they're a little bit different."}, {"time": 1159, "text": "And they just have, I mean, the best of enterprise probably just has a very large data set, or deep learning can probably shine."}, {"time": 1168, "text": "That's correct, that's right."}, {"time": 1170, "text": "And then I think the other pieces that they wanted, again, with 2.0, the developer summit we put together is the whole TensorFlow Extended piece, which is the entire pipeline."}, {"time": 1180, "text": "They care about stability across doing their entire thing."}, {"time": 1183, "text": "They want simplicity across the entire thing."}, {"time": 1186, "text": "I don't need to just train a model."}, {"time": 1187, "text": "I need to do that every day again, over and over again."}, {"time": 1191, "text": "I wonder to which degree you have a role in, I don't know, so I teach a course on deep learning."}, {"time": 1196, "text": "I have people like lawyers come up to me and say, when is machine learning gonna enter legal, the legal realm?"}, {"time": 1205, "text": "The same thing in all kinds of disciplines, immigration, insurance, often when I see what it boils down to is these companies are often a little bit old school in the way they organize the data."}, {"time": 1220, "text": "So the data is just not ready yet, it's not digitized."}, {"time": 1224, "text": "Do you also find yourself being in the role of an evangelist for like, let's get, organize your data, folks, and then you'll get the big benefit of TensorFlow."}, {"time": 1235, "text": "Do you get those, have those conversations?"}, {"time": 1238, "text": "Yeah, yeah, you know, I get all kinds of questions there from, okay, what do I need to make this work, right?"}, {"time": 1249, "text": "Do we really need deep learning?"}, {"time": 1250, "text": "I mean, there are all these things, I already use this linear model, why would this help?"}, {"time": 1255, "text": "I don't have enough data, let's say, or I wanna use machine learning, but I have no clue where to start."}, {"time": 1261, "text": "So it varies, that to all the way to the experts to why support very specific things, it's interesting."}, {"time": 1268, "text": "Is there a good answer?"}, {"time": 1269, "text": "It boils down to oftentimes digitizing data."}, {"time": 1272, "text": "So whatever you want automated, whatever data you want to make prediction based on, you have to make sure that it's in an organized form."}, {"time": 1281, "text": "Like within the TensorFlow ecosystem, there's now, you're providing more and more data sets and more and more pre trained models."}, {"time": 1288, "text": "Are you finding yourself also the organizer of data sets?"}, {"time": 1292, "text": "Yes, I think the TensorFlow data sets that we just released, that's definitely come up where people want these data sets, can we organize them and can we make that easier?"}, {"time": 1301, "text": "So that's definitely one important thing."}, {"time": 1305, "text": "The other related thing I would say is I often tell people, you know what, don't think of the most fanciest thing that the newest model that you see, make something very basic work and then you can improve it."}, {"time": 1316, "text": "There's just lots of things you can do with it."}, {"time": 1318, "text": "Yeah, start with the basics, true."}, {"time": 1320, "text": "One of the big things that makes TensorFlow even more accessible was the appearance whenever that happened of Keras, the Keras standard sort of outside of TensorFlow."}, {"time": 1332, "text": "I think it was Keras on top of Tiano at first only and then Keras became on top of TensorFlow."}, {"time": 1342, "text": "Do you know when Keras chose to also add TensorFlow as a backend, who was the, was it just the community that drove that initially?"}, {"time": 1354, "text": "Do you know if there was discussions, conversations?"}, {"time": 1357, "text": "Yeah, so Francois started the Keras project before he was at Google and the first thing was Tiano."}, {"time": 1364, "text": "I don't remember if that was after TensorFlow was created or way before."}, {"time": 1369, "text": "And then at some point, when TensorFlow started becoming popular, there were enough similarities that he decided to create this interface and put TensorFlow as a backend."}, {"time": 1378, "text": "I believe that might still have been before he joined Google."}, {"time": 1383, "text": "So we weren't really talking about that."}, {"time": 1386, "text": "He decided on his own and thought that was interesting and relevant to the community."}, {"time": 1392, "text": "In fact, I didn't find out about him being at Google until a few months after he was here."}, {"time": 1399, "text": "He was working on some research ideas and doing Keras on his nights and weekends project."}, {"time": 1405, "text": "He wasn't like part of the TensorFlow."}, {"time": 1408, "text": "He didn't join initially."}, {"time": 1409, "text": "He joined research and he was doing some amazing research."}, {"time": 1412, "text": "He has some papers on that and research, so he's a great researcher as well."}, {"time": 1418, "text": "And at some point we realized, oh, he's doing this good stuff."}, {"time": 1422, "text": "People seem to like the API and he's right here."}, {"time": 1425, "text": "So we talked to him and he said, okay, why don't I come over to your team and work with you for a quarter and let's make that integration happen."}, {"time": 1435, "text": "And we talked to his manager and he said, sure, quarter's fine."}, {"time": 1439, "text": "And that quarter's been something like two years now."}, {"time": 1442, "text": "And so he's fully on this."}, {"time": 1445, "text": "So Keras got integrated into TensorFlow in a deep way."}, {"time": 1452, "text": "And now with 2.0, TensorFlow 2.0, sort of Keras is kind of the recommended way for a beginner to interact with TensorFlow."}, {"time": 1461, "text": "Which makes that initial sort of transfer learning or the basic use cases, even for an enterprise, super simple, right?"}, {"time": 1472, "text": "That seems like it's kind of a bold decision as well."}, {"time": 1478, "text": "We did spend a lot of time thinking about that one."}, {"time": 1481, "text": "We had a bunch of APIs, some built by us."}, {"time": 1486, "text": "There was a parallel layers API that we were building."}, {"time": 1488, "text": "And when we decided to do Keras in parallel, so there were like, okay, two things that we are looking at."}, {"time": 1494, "text": "And the first thing we was trying to do is just have them look similar, like be as integrated as possible, share all of that stuff."}, {"time": 1502, "text": "There were also like three other APIs that others had built over time because we didn't have a standard one."}, {"time": 1509, "text": "But one of the messages that we kept hearing from the community, okay, which one do we use?"}, {"time": 1513, "text": "And they kept seeing like, okay, here's a model in this one and here's a model in this one, which should I pick?"}, {"time": 1518, "text": "So that's sort of like, okay, we had to address that straight on with 2.0."}, {"time": 1524, "text": "The whole idea was we need to simplify."}, {"time": 1526, "text": "We had to pick one."}, {"time": 1528, "text": "Based on where we were, we were like, okay, let's see what are the people like?"}, {"time": 1535, "text": "And Keras was clearly one that lots of people loved."}, {"time": 1539, "text": "There were lots of great things about it."}, {"time": 1541, "text": "So we settled on that."}, {"time": 1543, "text": "Organically, that's kind of the best way to do it."}, {"time": 1546, "text": "It was great."}, {"time": 1547, "text": "It was surprising, nevertheless, to sort of bring in an outside."}, {"time": 1551, "text": "I mean, there was a feeling like Keras might be almost like a competitor in a certain kind of, to TensorFlow."}, {"time": 1558, "text": "And in a sense, it became an empowering element of TensorFlow."}, {"time": 1563, "text": "Yeah, it's interesting how you can put two things together, which can align."}, {"time": 1568, "text": "In this case, I think Francois, the team, and a bunch of us have chatted, and I think we all want to see the same kind of things."}, {"time": 1577, "text": "We all care about making it easier for the huge set of developers out there, and that makes a difference."}, {"time": 1583, "text": "So Python has Guido van Rossum, who until recently held the position of benevolent dictator for life."}, {"time": 1591, "text": "All right, so there's a huge successful open source project like TensorFlow need one person who makes a final decision."}, {"time": 1600, "text": "So you've did a pretty successful TensorFlow Dev Summit just now, last couple of days."}, {"time": 1607, "text": "There's clearly a lot of different new features being incorporated, an amazing ecosystem, so on."}, {"time": 1614, "text": "Who's, how are those design decisions made?"}, {"time": 1617, "text": "Is there a BDFL in TensorFlow, or is it more distributed and organic?"}, {"time": 1625, "text": "I think it's somewhat different, I would say."}, {"time": 1628, "text": "I've always been involved in the key design directions, but there are lots of things that are distributed where there are a number of people, Martin Wick being one, who has really driven a lot of our open source stuff, a lot of the APIs, and there are a number of other people who've been, you know, pushed and been responsible for different parts of it."}, {"time": 1654, "text": "We do have regular design reviews."}, {"time": 1656, "text": "Over the last year, we've had a lot of we've really spent a lot of time opening up to the community and adding transparency."}, {"time": 1664, "text": "We're setting more processes in place, so RFCs, special interest groups, to really grow that community and scale that."}, {"time": 1673, "text": "I think the kind of scale that ecosystem is in, I don't think we could scale with having me as the lone point of decision maker."}, {"time": 1682, "text": "So, yeah, the growth of that ecosystem, maybe you can talk about it a little bit."}, {"time": 1688, "text": "First of all, it started with Andrej Karpathy when he first did ComNetJS."}, {"time": 1693, "text": "The fact that you can train and you'll network in the browser was, in JavaScript, was incredible."}, {"time": 1698, "text": "So now TensorFlow.js is really making that a serious, like a legit thing, a way to operate, whether it's in the backend or the front end."}, {"time": 1709, "text": "Then there's the TensorFlow Extended, like you mentioned."}, {"time": 1712, "text": "There's TensorFlow Lite for mobile."}, {"time": 1715, "text": "And all of it, as far as I can tell, it's really converging towards being able to save models in the same kind of way."}, {"time": 1723, "text": "You can move around, you can train on the desktop and then move it to mobile and so on."}, {"time": 1729, "text": "So there's that cohesiveness."}, {"time": 1732, "text": "So can you maybe give me, whatever I missed, a bigger overview of the mission of the ecosystem that's trying to be built and where is it moving forward?"}, {"time": 1742, "text": "So in short, the way I like to think of this is our goals to enable machine learning."}, {"time": 1749, "text": "And in a couple of ways, you know, one is we have lots of exciting things going on in ML today."}, {"time": 1756, "text": "We started with deep learning, but we now support a bunch of other algorithms too."}, {"time": 1761, "text": "So one is to, on the research side, keep pushing on the state of the art."}, {"time": 1765, "text": "Can we, you know, how do we enable researchers to build the next amazing thing?"}, {"time": 1768, "text": "So BERT came out recently, you know, it's great that people are able to do new kinds of research."}, {"time": 1773, "text": "And there are lots of amazing research that happens across the world."}, {"time": 1777, "text": "So that's one direction."}, {"time": 1778, "text": "The other is how do you take that across all the people outside who want to take that research and do some great things with it and integrate it to build real products, to have a real impact on people."}, {"time": 1791, "text": "And so if that's the other axes in some ways, you know, at a high level, one way I think about it is there are a crazy number of compute devices across the world."}, {"time": 1804, "text": "And we often used to think of ML and training and all of this as, okay, something you do either in the workstation or the data center or cloud."}, {"time": 1813, "text": "But we see things running on the phones."}, {"time": 1815, "text": "We see things running on really tiny chips."}, {"time": 1817, "text": "I mean, we had some demos at the developer summit."}, {"time": 1820, "text": "And so the way I think about this ecosystem is how do we help get machine learning on every device that has a compute capability?"}, {"time": 1832, "text": "And that continues to grow and so in some ways this ecosystem is looked at, you know, various aspects of that and grown over time to cover more of those."}, {"time": 1842, "text": "And we continue to push the boundaries."}, {"time": 1844, "text": "In some areas we've built more tooling and things around that to help you."}, {"time": 1850, "text": "I mean, the first tool we started was TensorBoard."}, {"time": 1852, "text": "You wanted to learn just the training piece, the effects or TensorFlow extended to really do your entire ML pipelines."}, {"time": 1860, "text": "If you're, you know, care about all that production stuff, but then going to the edge, going to different kinds of things."}, {"time": 1869, "text": "And it's not just us now."}, {"time": 1871, "text": "We are a place where there are lots of libraries being built on top."}, {"time": 1875, "text": "So there are some for research, maybe things like TensorFlow agents or TensorFlow probability that started as research things or for researchers for focusing on certain kinds of algorithms, but they're also being deployed or used by, you know, production folks."}, {"time": 1890, "text": "And some have come from within Google, just teams across Google who wanted to build these things."}, {"time": 1897, "text": "Others have come from just the community because there are different pieces that different parts of the community care about."}, {"time": 1904, "text": "And I see our goal as enabling even that, right?"}, {"time": 1909, "text": "It's not, we cannot and won't build every single thing."}, {"time": 1913, "text": "That just doesn't make sense."}, {"time": 1914, "text": "But if we can enable others to build the things that they care about, and there's a broader community that cares about that, and we can help encourage that, and that's great."}, {"time": 1925, "text": "That really helps the entire ecosystem, not just those."}, {"time": 1928, "text": "One of the big things about 2.0 that we're pushing on is, okay, we have these so many different pieces, right?"}, {"time": 1934, "text": "How do we help make all of them work well together?"}, {"time": 1938, "text": "So there are a few key pieces there that we're pushing on, one being the core format in there and how we share the models themselves through save model and TensorFlow hub and so on."}, {"time": 1950, "text": "And a few of the pieces that we really put this together."}, {"time": 1954, "text": "I was very skeptical that that's, you know, when TensorFlow.js came out, it didn't seem, or deep learning JS as it was earlier."}, {"time": 1960, "text": "Yeah, that was the first."}, {"time": 1961, "text": "It seems like technically very difficult project."}, {"time": 1965, "text": "As a standalone, it's not as difficult, but as a thing that integrates into the ecosystem, it seems very difficult."}, {"time": 1971, "text": "So, I mean, there's a lot of aspects of this you're making look easy, but, and the technical side, how many challenges have to be overcome here?"}, {"time": 1981, "text": "And still have to be overcome."}, {"time": 1983, "text": "That's the question here too."}, {"time": 1984, "text": "There are lots of steps to it, right?"}, {"time": 1986, "text": "And we've iterated over the last few years, so there's a lot we've learned."}, {"time": 1990, "text": "I, yeah, and often when things come together well, things look easy and that's exactly the point."}, {"time": 1996, "text": "It should be easy for the end user, but there are lots of things that go behind that."}, {"time": 2001, "text": "If I think about still challenges ahead, there are, you know, we have a lot more devices coming on board, for example, from the hardware perspective."}, {"time": 2015, "text": "How do we make it really easy for these vendors to integrate with something like TensorFlow, right?"}, {"time": 2022, "text": "So there's a lot of compiler stuff that others are working on."}, {"time": 2025, "text": "There are things we can do in terms of our APIs and so on that we can do."}, {"time": 2030, "text": "As we, you know, TensorFlow started as a very monolithic system and to some extent it still is."}, {"time": 2037, "text": "There are less, lots of tools around it, but the core is still pretty large and monolithic."}, {"time": 2042, "text": "One of the key challenges for us to scale that out is how do we break that apart with clearer interfaces?"}, {"time": 2050, "text": "It's, you know, in some ways it's software engineering 101, but for a system that's now four years old, I guess, or more, and that's still rapidly evolving and that we're not slowing down with, it's hard to change and modify and really break apart."}, {"time": 2068, "text": "It's sort of like, as people say, right, it's like changing the engine with a car running or trying to fix that."}, {"time": 2073, "text": "That's exactly what we're trying to do."}, {"time": 2075, "text": "So there's a challenge here because the downside of so many people being excited about TensorFlow and coming to rely on it in many of their applications is that you're kind of responsible, like it's the technical debt."}, {"time": 2093, "text": "You're responsible for previous versions to some degree still working."}, {"time": 2097, "text": "So when you're trying to innovate, I mean, it's probably easier to just start from scratch every few months."}, {"time": 2107, "text": "So do you feel the pain of that?"}, {"time": 2109, "text": "2.0 does break some back compatibility, but not too much."}, {"time": 2115, "text": "It seems like the conversion is pretty straightforward."}, {"time": 2118, "text": "Do you think that's still important given how quickly deep learning is changing?"}, {"time": 2122, "text": "Can you just, the things that you've learned, can you just start over or is there pressure to not?"}, {"time": 2129, "text": "It's a tricky balance."}, {"time": 2131, "text": "So if it was just a researcher writing a paper who a year later will not look at that code again, sure, it doesn't matter."}, {"time": 2141, "text": "There are a lot of production systems that rely on TensorFlow, both at Google and across the world."}, {"time": 2147, "text": "And people worry about this."}, {"time": 2149, "text": "I mean, these systems run for a long time."}, {"time": 2153, "text": "So it is important to keep that compatibility and so on."}, {"time": 2157, "text": "And yes, it does come with a huge cost."}, {"time": 2159, "text": "There's, we have to think about a lot of things as we do new things and make new changes."}, {"time": 2166, "text": "I think it's a trade off, right?"}, {"time": 2169, "text": "You can, you might slow certain kinds of things down, but the overall value you're bringing because of that is much bigger because it's not just about breaking the person yesterday."}, {"time": 2180, "text": "It's also about telling the person tomorrow that, you know what, this is how we do things."}, {"time": 2186, "text": "We're not gonna break you when you come on board because there are lots of new people who are also gonna come on board."}, {"time": 2191, "text": "And, you know, one way I like to think about this, and I always push the team to think about it as well, when you wanna do new things, you wanna start with a clean slate."}, {"time": 2202, "text": "Design with a clean slate in mind, and then we'll figure out how to make sure all the other things work."}, {"time": 2208, "text": "And yes, we do make compromises occasionally, but unless you design with the clean slate and not worry about that, you'll never get to a good place."}, {"time": 2218, "text": "Oh, that's brilliant, so even if you are responsible when you're in the idea stage, when you're thinking of new, just put all that behind you."}, {"time": 2227, "text": "Okay, that's really, really well put."}, {"time": 2229, "text": "So I have to ask this because a lot of students, developers ask me how I feel about PyTorch versus TensorFlow."}, {"time": 2236, "text": "So I've recently completely switched my research group to TensorFlow."}, {"time": 2240, "text": "I wish everybody would just use the same thing, and TensorFlow is as close to that, I believe, as we have."}, {"time": 2246, "text": "But do you enjoy competition?"}, {"time": 2252, "text": "So TensorFlow is leading in many ways, on many dimensions in terms of ecosystem, in terms of number of users, momentum, power, production levels, so on, but a lot of researchers are now also using PyTorch."}, {"time": 2266, "text": "Do you enjoy that kind of competition or do you just ignore it and focus on making TensorFlow the best that it can be?"}, {"time": 2272, "text": "So just like research or anything people are doing, it's great to get different kinds of ideas."}, {"time": 2278, "text": "And when we started with TensorFlow, like I was saying earlier, one, it was very important for us to also have production in mind."}, {"time": 2287, "text": "We didn't want just research, right?"}, {"time": 2289, "text": "And that's why we chose certain things."}, {"time": 2291, "text": "Now PyTorch came along and said, you know what, I only care about research."}, {"time": 2294, "text": "This is what I'm trying to do."}, {"time": 2296, "text": "What's the best thing I can do for this?"}, {"time": 2298, "text": "And it started iterating and said, okay, I don't need to worry about graphs."}, {"time": 2302, "text": "Let me just run things."}, {"time": 2304, "text": "And I don't care if it's not as fast as it can be, but let me just make this part easy."}, {"time": 2310, "text": "And there are things you can learn from that, right?"}, {"time": 2312, "text": "They, again, had the benefit of seeing what had come before, but also exploring certain different kinds of spaces."}, {"time": 2320, "text": "And they had some good things there, building on say things like JNR and so on before that."}, {"time": 2326, "text": "So competition is definitely interesting."}, {"time": 2329, "text": "It made us, you know, this is an area that we had thought about, like I said, way early on."}, {"time": 2333, "text": "Over time we had revisited this a couple of times, should we add this again?"}, {"time": 2339, "text": "At some point we said, you know what, it seems like this can be done well, so let's try it again."}, {"time": 2344, "text": "And that's how we started pushing on eager execution."}, {"time": 2347, "text": "How do we combine those two together?"}, {"time": 2349, "text": "Which has finally come very well together in 2.0, but it took us a while to get all the things together and so on."}, {"time": 2356, "text": "So let me ask, put another way, I think eager execution is a really powerful thing that was added."}, {"time": 2362, "text": "Do you think it wouldn't have been, you know, Muhammad Ali versus Frasier, right?"}, {"time": 2368, "text": "Do you think it wouldn't have been added as quickly if PyTorch wasn't there?"}, {"time": 2373, "text": "It might have taken longer."}, {"time": 2375, "text": "No longer?"}, {"time": 2376, "text": "Yeah, it was, I mean, we had tried some variants of that before, so I'm sure it would have happened, but it might have taken longer."}, {"time": 2382, "text": "I'm grateful that TensorFlow is finally in the way they did."}, {"time": 2384, "text": "It's doing some incredible work last couple years."}, {"time": 2387, "text": "What other things that we didn't talk about are you looking forward in 2.0?"}, {"time": 2391, "text": "That comes to mind."}, {"time": 2394, "text": "So we talked about some of the ecosystem stuff, making it easily accessible to Keras, eager execution."}, {"time": 2401, "text": "Is there other things that we missed?"}, {"time": 2403, "text": "Yeah, so I would say one is just where 2.0 is, and you know, with all the things that we've talked about, I think as we think beyond that, there are lots of other things that it enables us to do and that we're excited about."}, {"time": 2418, "text": "So what it's setting us up for, okay, here are these really clean APIs."}, {"time": 2422, "text": "We've cleaned up the surface for what the users want."}, {"time": 2425, "text": "What it also allows us to do a whole bunch of stuff behind the scenes once we are ready with 2.0."}, {"time": 2431, "text": "So for example, in TensorFlow with graphs and all the things you could do, you could always get a lot of good performance if you spent the time to tune it, right?"}, {"time": 2443, "text": "And we've clearly shown that, lots of people do that."}, {"time": 2447, "text": "With 2.0, with these APIs, where we are, we can give you a lot of performance just with whatever you do."}, {"time": 2457, "text": "You know, because we see these, it's much cleaner."}, {"time": 2461, "text": "We know most people are gonna do things this way."}, {"time": 2463, "text": "We can really optimize for that and get a lot of those things out of the box."}, {"time": 2469, "text": "And it really allows us, you know, both for single machine and distributed and so on, to really explore other spaces behind the scenes after 2.0 in the future versions as well."}, {"time": 2479, "text": "So right now the team's really excited about that, that over time I think we'll see that."}, {"time": 2485, "text": "The other piece that I was talking about in terms of just restructuring the monolithic thing into more pieces and making it more modular, I think that's gonna be really important for a lot of the other people in the ecosystem, other organizations and so on that wanted to build things."}, {"time": 2504, "text": "Can you elaborate a little bit what you mean by making TensorFlow ecosystem more modular?"}, {"time": 2510, "text": "So the way it's organized today is there's one, there are lots of repositories in the TensorFlow organization at GitHub."}, {"time": 2518, "text": "The core one where we have TensorFlow, it has the execution engine, it has the key backends for CPUs and GPUs, it has the work to do distributed stuff."}, {"time": 2532, "text": "And all of these just work together in a single library or binary."}, {"time": 2537, "text": "There's no way to split them apart easily."}, {"time": 2538, "text": "I mean, there are some interfaces, but they're not very clean."}, {"time": 2541, "text": "In a perfect world, you would have clean interfaces where, okay, I wanna run it on my fancy cluster with some custom networking, just implement this and do that."}, {"time": 2551, "text": "I mean, we kind of support that, but it's hard for people today."}, {"time": 2555, "text": "I think as we are starting to see more interesting things in some of these spaces, having that clean separation will really start to help."}, {"time": 2562, "text": "And again, going to the large size of the ecosystem and the different groups involved there, enabling people to evolve and push on things more independently just allows it to scale better."}, {"time": 2576, "text": "And by people, you mean individual developers and?"}, {"time": 2581, "text": "So the hope is that everybody sort of major, I don't know, Pepsi or something uses, like major corporations go to TensorFlow to this kind of."}, {"time": 2591, "text": "Yeah, if you look at enterprises like Pepsi or these, I mean, a lot of them are already using TensorFlow."}, {"time": 2595, "text": "They are not the ones that do the development or changes in the core."}, {"time": 2600, "text": "Some of them do, but a lot of them don't."}, {"time": 2601, "text": "I mean, they touch small pieces."}, {"time": 2603, "text": "There are lots of these, some of them being, let's say, hardware vendors who are building their custom hardware and they want their own pieces."}, {"time": 2610, "text": "Or some of them being bigger companies, say, IBM."}, {"time": 2614, "text": "I mean, they're involved in some of our special interest groups, and they see a lot of users who want certain things and they want to optimize for that."}, {"time": 2622, "text": "So folks like that often."}, {"time": 2624, "text": "Autonomous vehicle companies, perhaps."}, {"time": 2628, "text": "So, yeah, like I mentioned, TensorFlow has been downloaded 41 million times, 50,000 commits, almost 10,000 pull requests, and 1,800 contributors."}, {"time": 2638, "text": "So I'm not sure if you can explain it, but what does it take to build a community like that?"}, {"time": 2646, "text": "In retrospect, what do you think, what is the critical thing that allowed for this growth to happen, and how does that growth continue?"}, {"time": 2654, "text": "Yeah, yeah, that's an interesting question."}, {"time": 2657, "text": "I wish I had all the answers there, I guess, so you could replicate it."}, {"time": 2662, "text": "I think there are a number of things that need to come together, right?"}, {"time": 2667, "text": "One, just like any new thing, it is about, there's a sweet spot of timing, what's needed, does it grow with, what's needed, so in this case, for example, TensorFlow's not just grown because it was a good tool, it's also grown with the growth of deep learning itself."}, {"time": 2686, "text": "So those factors come into play."}, {"time": 2689, "text": "Other than that, though, I think just hearing, listening to the community, what they do, what they need, being open to, like in terms of external contributions, we've spent a lot of time in making sure we can accept those contributions well, we can help the contributors in adding those, putting the right process in place, getting the right kind of community, welcoming them and so on."}, {"time": 2716, "text": "Like over the last year, we've really pushed on transparency, that's important for an open source project."}, {"time": 2722, "text": "People wanna know where things are going, and we're like, okay, here's a process where you can do that, here are our RFCs and so on."}, {"time": 2729, "text": "So thinking through, there are lots of community aspects that come into that you can really work on."}, {"time": 2735, "text": "As a small project, it's maybe easy to do because there's like two developers and you can do those."}, {"time": 2742, "text": "As you grow, putting more of these processes in place, thinking about the documentation, thinking about what two developers care about, what kind of tools would they want to use, all of these come into play, I think."}, {"time": 2756, "text": "So one of the big things I think that feeds the TensorFlow fire is people building something on TensorFlow, and implement a particular architecture that does something cool and useful, and they put that on GitHub."}, {"time": 2771, "text": "And so it just feeds this growth."}, {"time": 2775, "text": "Do you have a sense that with 2.0 and 1.0 that there may be a little bit of a partitioning like there is with Python 2 and 3, that there'll be a code base and in the older versions of TensorFlow, they will not be as compatible easily?"}, {"time": 2791, "text": "Or are you pretty confident that this kind of conversion is pretty natural and easy to do?"}, {"time": 2797, "text": "So we're definitely working hard to make that very easy to do."}, {"time": 2801, "text": "There's lots of tooling that we talked about at the developer summit this week, and we'll continue to invest in that tooling."}, {"time": 2808, "text": "It's, you know, when you think of these significant version changes, that's always a risk, and we are really pushing hard to make that transition very, very smooth."}, {"time": 2818, "text": "So I think, so at some level, people wanna move and they see the value in the new thing."}, {"time": 2825, "text": "They don't wanna move just because it's a new thing, and some people do, but most people want a really good thing."}, {"time": 2831, "text": "And I think over the next few months, as people start to see the value, we'll definitely see that shift happening."}, {"time": 2837, "text": "So I'm pretty excited and confident that we will see people moving."}, {"time": 2842, "text": "As you said earlier, this field is also moving rapidly, so that'll help because we can do more things and all the new things will clearly happen in 2.x, so people will have lots of good reasons to move."}, {"time": 2852, "text": "So what do you think TensorFlow 3.0 looks like?"}, {"time": 2856, "text": "Is there, are things happening so crazily that even at the end of this year seems impossible to plan for?"}, {"time": 2865, "text": "Or is it possible to plan for the next five years?"}, {"time": 2869, "text": "I think it's tricky."}, {"time": 2870, "text": "There are some things that we can expect in terms of, okay, change, yes, change is gonna happen."}, {"time": 2879, "text": "Are there some things gonna stick around and some things not gonna stick around?"}, {"time": 2883, "text": "I would say the basics of deep learning, the, you know, say convolution models or the basic kind of things, they'll probably be around in some form still in five years."}, {"time": 2896, "text": "Will RL and GAN stay?"}, {"time": 2898, "text": "Very likely, based on where they are."}, {"time": 2901, "text": "Will we have new things?"}, {"time": 2902, "text": "Probably, but those are hard to predict."}, {"time": 2904, "text": "And some directionally, some things that we can see is, you know, in things that we're starting to do, right, with some of our projects right now is just 2.0 combining eager execution and graphs where we're starting to make it more like just your natural programming language."}, {"time": 2923, "text": "You're not trying to program something else."}, {"time": 2925, "text": "Similarly, with Swift for TensorFlow, we're taking that approach."}, {"time": 2928, "text": "Can you do something ground up, right?"}, {"time": 2930, "text": "So some of those ideas seem like, okay, that's the right direction."}, {"time": 2934, "text": "In five years, we expect to see more in that area."}, {"time": 2938, "text": "Other things we don't know is, will hardware accelerators be the same?"}, {"time": 2943, "text": "Will we be able to train with four bits instead of 32 bits?"}, {"time": 2949, "text": "And I think the TPU side of things is exploring that."}, {"time": 2951, "text": "I mean, TPU is already on version three."}, {"time": 2953, "text": "It seems that the evolution of TPU and TensorFlow are sort of, they're coevolving almost in terms of both are learning from each other and from the community and from the applications where the biggest benefit is achieved."}, {"time": 2970, "text": "You've been trying to sort of, with Eager, with Keras, to make TensorFlow as accessible and easy to use as possible."}, {"time": 2976, "text": "What do you think, for beginners, is the biggest thing they struggle with?"}, {"time": 2980, "text": "Have you encountered that?"}, {"time": 2982, "text": "Or is basically what Keras is solving is that Eager, like we talked about?"}, {"time": 2987, "text": "Yeah, for some of them, like you said, right, the beginners want to just be able to take some image model, they don't care if it's Inception or ResNet or something else, and do some training or transfer learning on their kind of model."}, {"time": 3002, "text": "Being able to make that easy is important."}, {"time": 3004, "text": "So in some ways, if you do that by providing them simple models with say, in hub or so on, they don't care about what's inside that box, but they want to be able to use it."}, {"time": 3015, "text": "So we're pushing on, I think, different levels."}, {"time": 3017, "text": "If you look at just a component that you get, which has the layers already smooshed in, the beginners probably just want that."}, {"time": 3025, "text": "Then the next step is, okay, look at building layers with Keras."}, {"time": 3029, "text": "If you go out to research, then they are probably writing custom layers themselves or doing their own loops."}, {"time": 3034, "text": "So there's a whole spectrum there."}, {"time": 3036, "text": "And then providing the pre trained models seems to really decrease the time from you trying to start."}, {"time": 3043, "text": "You could basically in a Colab notebook achieve what you need."}, {"time": 3049, "text": "So I'm basically answering my own question because I think what TensorFlow delivered on recently is trivial for beginners."}, {"time": 3056, "text": "So I was just wondering if there was other pain points you're trying to ease, but I'm not sure there would."}, {"time": 3062, "text": "No, those are probably the big ones."}, {"time": 3064, "text": "I see high schoolers doing a whole bunch of things now, which is pretty amazing."}, {"time": 3069, "text": "It's both amazing and terrifying."}, {"time": 3072, "text": "In a sense that when they grow up, it's some incredible ideas will be coming from them."}, {"time": 3079, "text": "So there's certainly a technical aspect to your work, but you also have a management aspect to your role with TensorFlow leading the project, a large number of developers and people."}, {"time": 3091, "text": "So what do you look for in a good team?"}, {"time": 3094, "text": "What do you think?"}, {"time": 3096, "text": "Google has been at the forefront of exploring what it takes to build a good team and TensorFlow is one of the most cutting edge technologies in the world."}, {"time": 3106, "text": "So in this context, what do you think makes for a good team?"}, {"time": 3110, "text": "It's definitely something I think a favorite about."}, {"time": 3113, "text": "I think in terms of the team being able to deliver something well, one of the things that's important is a cohesion across the team."}, {"time": 3125, "text": "So being able to execute together in doing things that's not an end, like at this scale, an individual engineer can only do so much."}, {"time": 3135, "text": "There's a lot more that they can do together, even though we have some amazing superstars across Google and in the team, but there's, you know, often the way I see it as the product of what the team generates is way larger than the whole or the individual put together."}, {"time": 3154, "text": "And so how do we have all of them work together, the culture of the team itself, hiring good people is important."}, {"time": 3163, "text": "But part of that is it's not just that, okay, we hire a bunch of smart people and throw them together and let them do things."}, {"time": 3169, "text": "It's also people have to care about what they're building, people have to be motivated for the right kind of things."}, {"time": 3177, "text": "That's often an important factor."}, {"time": 3181, "text": "And, you know, finally, how do you put that together with a somewhat unified vision of where we wanna go?"}, {"time": 3188, "text": "So are we all looking in the same direction or each of us going all over?"}, {"time": 3193, "text": "And sometimes it's a mix."}, {"time": 3196, "text": "Google's a very bottom up organization in some sense, also research even more so, and that's how we started."}, {"time": 3206, "text": "But as we've become this larger product and ecosystem, I think it's also important to combine that well with a mix of, okay, here's the direction we wanna go in."}, {"time": 3218, "text": "There is exploration we'll do around that, but let's keep staying in that direction, not just all over the place."}, {"time": 3224, "text": "And is there a way you monitor the health of the team?"}, {"time": 3226, "text": "Sort of like, is there a way you know you did a good job?"}, {"time": 3231, "text": "The team is good?"}, {"time": 3233, "text": "Like, I mean, you're sort of, you're saying nice things, but it's sometimes difficult to determine how aligned."}, {"time": 3241, "text": "Because it's not binary."}, {"time": 3242, "text": "It's not like there's tensions and complexities and so on."}, {"time": 3246, "text": "And the other element of the mission of superstars, there's so much, even at Google, such a large percentage of work is done by individual superstars too."}, {"time": 3256, "text": "So there's a, and sometimes those superstars can be against the dynamic of a team and those tensions."}, {"time": 3265, "text": "I mean, I'm sure in TensorFlow it might be a little bit easier because the mission of the project is so sort of beautiful."}, {"time": 3271, "text": "You're at the cutting edge, so it's exciting."}, {"time": 3274, "text": "But have you had struggle with that?"}, {"time": 3276, "text": "Has there been challenges?"}, {"time": 3278, "text": "There are always people challenges in different kinds of ways."}, {"time": 3281, "text": "That said, I think we've been what's good about getting people who care and are, you know, have the same kind of culture, and that's Google in general to a large extent."}, {"time": 3293, "text": "But also, like you said, given that the project has had so many exciting things to do, there's been room for lots of people to do different kinds of things and grow, which does make the problem a bit easier, I guess."}, {"time": 3305, "text": "And it allows people, depending on what they're doing, if there's room around them, then that's fine."}, {"time": 3313, "text": "But yes, we do care about whether a superstar or not, that they need to work well with the team across Google."}, {"time": 3322, "text": "That's interesting to hear."}, {"time": 3323, "text": "So it's like superstar or not, the productivity broadly is about the team."}, {"time": 3331, "text": "I mean, they might add a lot of value, but if they're hurting the team, then that's a problem."}, {"time": 3335, "text": "So in hiring engineers, it's so interesting, right, the hiring process."}, {"time": 3340, "text": "What do you look for?"}, {"time": 3341, "text": "How do you determine a good developer or a good member of a team from just a few minutes or hours together?"}, {"time": 3350, "text": "Again, no magic answers, I'm sure."}, {"time": 3352, "text": "Yeah, I mean, Google has a hiring process that we've refined over the last 20 years, I guess, and that you've probably heard and seen a lot about."}, {"time": 3362, "text": "So we do work with the same hiring process and that's really helped."}, {"time": 3368, "text": "For me in particular, I would say, in addition to the core technical skills, what does matter is their motivation in what they wanna do."}, {"time": 3379, "text": "Because if that doesn't align well with where we wanna go, that's not gonna lead to long term success for either them or the team."}, {"time": 3387, "text": "And I think that becomes more important the more senior the person is, but it's important at every level."}, {"time": 3393, "text": "Like even the junior most engineer, if they're not motivated to do well at what they're trying to do, however smart they are, it's gonna be hard for them to succeed."}, {"time": 3400, "text": "Does the Google hiring process touch on that passion?"}, {"time": 3404, "text": "So like trying to determine, because I think as far as I understand, maybe you can speak to it, that the Google hiring process sort of helps in the initial like determines the skill set there, is your puzzle solving ability, problem solving ability good?"}, {"time": 3419, "text": "But like, I'm not sure, but it seems that the determining whether the person is like fire inside them, that burns to do anything really, it doesn't really matter."}, {"time": 3429, "text": "It's just some cool stuff, I'm gonna do it."}, {"time": 3435, "text": "Is that something that ultimately ends up when they have a conversation with you or once it gets closer to the team?"}, {"time": 3442, "text": "So one of the things we do have as part of the process is just a culture fit, like part of the interview process itself, in addition to just the technical skills and each engineer or whoever the interviewer is, is supposed to rate the person on the culture and the culture fit with Google and so on."}, {"time": 3460, "text": "So that is definitely part of the process."}, {"time": 3462, "text": "Now, there are various kinds of projects and different kinds of things."}, {"time": 3466, "text": "So there might be variants and of the kind of culture you want there and so on."}, {"time": 3471, "text": "And yes, that does vary."}, {"time": 3472, "text": "So for example, TensorFlow has always been a fast moving project and we want people who are comfortable with that."}, {"time": 3480, "text": "But at the same time now, for example, we are at a place where we are also very full fledged product and we wanna make sure things that work really, really work, right?"}, {"time": 3489, "text": "You can't cut corners all the time."}, {"time": 3491, "text": "So balancing that out and finding the people who are the right fit for those is important."}, {"time": 3497, "text": "And I think those kinds of things do vary a bit across projects and teams and product areas across Google."}, {"time": 3503, "text": "And so you'll see some differences there in the final checklist."}, {"time": 3507, "text": "But a lot of the core culture, it comes along with just the engineering excellence and so on."}, {"time": 3514, "text": "What is the hardest part of your job?"}, {"time": 3519, "text": "I'll take your pick, I guess."}, {"time": 3521, "text": "It's fun, I would say, right?"}, {"time": 3524, "text": "Hard, yes."}, {"time": 3525, "text": "I mean, lots of things at different times."}, {"time": 3527, "text": "I think that does vary."}, {"time": 3529, "text": "So let me clarify that difficult things are fun when you solve them, right?"}, {"time": 3533, "text": "So it's fun in that sense."}, {"time": 3537, "text": "I think the key to a successful thing across the board and in this case, it's a large ecosystem now, but even a small product, is striking that fine balance across different aspects of it."}, {"time": 3552, "text": "Sometimes it's how fast do you go versus how perfect it is."}, {"time": 3557, "text": "Sometimes it's how do you involve this huge community?"}, {"time": 3561, "text": "Who do you involve or do you decide, okay, now is not a good time to involve them because it's not the right fit."}, {"time": 3570, "text": "Sometimes it's saying no to certain kinds of things."}, {"time": 3573, "text": "Those are often the hard decisions."}, {"time": 3576, "text": "Some of them you make quickly because you don't have the time."}, {"time": 3581, "text": "Some of them you get time to think about them, but they're always hard."}, {"time": 3584, "text": "So both choices are pretty good, those decisions."}, {"time": 3589, "text": "What about deadlines?"}, {"time": 3590, "text": "Is this, do you find TensorFlow, to be driven by deadlines to a degree that a product might?"}, {"time": 3600, "text": "Or is there still a balance to where it's less deadline?"}, {"time": 3604, "text": "You had the Dev Summit today that came together incredibly."}, {"time": 3608, "text": "Looked like there's a lot of moving pieces and so on."}, {"time": 3611, "text": "So did that deadline make people rise to the occasion releasing TensorFlow 2.0 alpha?"}, {"time": 3618, "text": "I'm sure that was done last minute as well."}, {"time": 3620, "text": "I mean, up to the last point."}, {"time": 3625, "text": "Again, it's one of those things that you need to strike the good balance."}, {"time": 3629, "text": "There's some value that deadlines bring that does bring a sense of urgency to get the right things together."}, {"time": 3635, "text": "Instead of getting the perfect thing out, you need something that's good and works well."}, {"time": 3641, "text": "And the team definitely did a great job in putting that together."}, {"time": 3644, "text": "So I was very amazed and excited by everything how that came together."}, {"time": 3648, "text": "That said, across the year, we try not to put out official deadlines."}, {"time": 3652, "text": "We focus on key things that are important, figure out how much of it's important."}, {"time": 3660, "text": "And we are developing in the open, both internally and externally, everything's available to everybody."}, {"time": 3667, "text": "So you can pick and look at where things are."}, {"time": 3671, "text": "We do releases at a regular cadence."}, {"time": 3673, "text": "So fine, if something doesn't necessarily end up this month, it'll end up in the next release in a month or two."}, {"time": 3678, "text": "And that's okay, but we want to keep moving as fast as we can in these different areas."}, {"time": 3686, "text": "Because we can iterate and improve on things, sometimes it's okay to put things out that aren't fully ready."}, {"time": 3692, "text": "We'll make sure it's clear that okay, this is experimental, but it's out there if you want to try and give feedback."}, {"time": 3697, "text": "That's very, very useful."}, {"time": 3699, "text": "I think that quick cycle and quick iteration is important."}, {"time": 3703, "text": "That's what we often focus on rather than here's a deadline where you get everything else."}, {"time": 3709, "text": "Is 2.0, is there pressure to make that stable?"}, {"time": 3712, "text": "Or like, for example, WordPress 5.0 just came out and there was no pressure to, it was a lot of build updates delivered way too late, but, and they said, okay, well, but we're gonna release a lot of updates really quickly to improve it."}, {"time": 3729, "text": "Do you see TensorFlow 2.0 in that same kind of way or is there this pressure to once it hits 2.0, once you get to the release candidate and then you get to the final, that's gonna be the stable thing?"}, {"time": 3742, "text": "So it's gonna be stable in, just like when NodeX was where every API that's there is gonna remain in work."}, {"time": 3752, "text": "It doesn't mean we can't change things under the covers."}, {"time": 3754, "text": "It doesn't mean we can't add things."}, {"time": 3756, "text": "So there's still a lot more for us to do and we'll continue to have more releases."}, {"time": 3761, "text": "So in that sense, there's still, I don't think we'll be done in like two months when we release this."}, {"time": 3766, "text": "I don't know if you can say, but is there, there's not external deadlines for TensorFlow 2.0, but is there internal deadlines, the artificial or otherwise, that you're trying to set for yourself or is it whenever it's ready?"}, {"time": 3783, "text": "So we want it to be a great product, right?"}, {"time": 3785, "text": "And that's a big important piece for us."}, {"time": 3789, "text": "TensorFlow's already out there."}, {"time": 3791, "text": "We have 41 million downloads for 1.0 X."}, {"time": 3793, "text": "So it's not like we have to have this."}, {"time": 3797, "text": "So it's not like, a lot of the features that we've really polishing and putting them together are there."}, {"time": 3803, "text": "We don't have to rush that just because."}, {"time": 3806, "text": "So in that sense, we wanna get it right and really focus on that."}, {"time": 3809, "text": "That said, we have said that we are looking to get this out in the next few months, in the next quarter."}, {"time": 3814, "text": "And as far as possible, we'll definitely try to make that happen."}, {"time": 3819, "text": "Yeah, my favorite line was, spring is a relative concept."}, {"time": 3824, "text": "I love it."}, {"time": 3826, "text": "Spoken like a true developer."}, {"time": 3827, "text": "So something I'm really interested in and your previous line of work is, before TensorFlow, you led a team at Google on search ads."}, {"time": 3837, "text": "I think this is a very interesting topic on every level, on a technical level, because at their best, ads connect people to the things they want and need."}, {"time": 3849, "text": "So, and at their worst, they're just these things that annoy the heck out of you to the point of ruining the entire user experience of whatever you're actually doing."}, {"time": 3860, "text": "So they have a bad rep, I guess."}, {"time": 3863, "text": "And on the other end, so that this connecting users to the thing they need and want is a beautiful opportunity for machine learning to shine."}, {"time": 3874, "text": "Like huge amounts of data that's personalized and you kind of map to the thing they actually want won't get annoyed."}, {"time": 3880, "text": "So what have you learned from this, Google that's leading the world in this aspect, what have you learned from that experience and what do you think is the future of ads?"}, {"time": 3891, "text": "Take you back to that."}, {"time": 3892, "text": "Yeah, yes, it's been a while, but I totally agree with what you said."}, {"time": 3899, "text": "I think the search ads, the way it was always looked at and I believe it still is, is it's an extension of what search is trying to do."}, {"time": 3908, "text": "And the goal is to make the information and make the world's information accessible."}, {"time": 3914, "text": "That's it's not just information, but maybe products or other things that people care about."}, {"time": 3920, "text": "And so it's really important for them to align with what the users need."}, {"time": 3926, "text": "And in search ads, there's a minimum quality level before that ad would be shown."}, {"time": 3932, "text": "If you don't have an ad that hits that quality, but it will not be shown even if we have it and okay, maybe we lose some money there, that's fine."}, {"time": 3939, "text": "That is really, really important."}, {"time": 3941, "text": "And I think that that is something I really liked about being there."}]}]