[{"title": "Donald Hoffman: Reality is an Illusion - How Evolution Hid the Truth | Lex Fridman Podcast #293", "id": "reYdQYZ9Rj4", "quotes": [{"time": 352, "text": "And you can just literally count all the payoff functions and just do the combinatorics and count them."}, {"time": 358, "text": "And then you can ask the precise question, how many of those payoff functions preserve the total order?"}, {"time": 364, "text": "If that's what you're looking for, or how many preserve the topology?"}, {"time": 367, "text": "And you just count them and divide."}, {"time": 368, "text": "So the number that are homomorphisms versus the total number, and then take the limit as the number of states in the world and the number of payoff values goes very large."}, {"time": 379, "text": "And when you do that, you get zero every time."}, {"time": 381, "text": "Okay, there's a million things to ask here."}, {"time": 384, "text": "But first of all, just in case people are not familiar with your work, let's sort of linger on the big bold statement here, which is the thing we see with our eyes is not some kind of limited window into reality."}, {"time": 405, "text": "It is completely detached from reality, likely completely detached from reality."}, {"time": 409, "text": "You're saying 100% likely."}, {"time": 412, "text": "Okay, so none of this is real in the way we think is real."}, {"time": 417, "text": "In the way we have this intuition, there's like this table is some kind of abstraction, but underneath it all, there's atoms."}, {"time": 427, "text": "And there's an entire century of physics that describes the functioning of those atoms and the quirks that make them up."}, {"time": 433, "text": "There's many Nobel Prizes about particles and fields and all that kind of stuff that slowly builds up to something that's perceivable to us, both with our eyes, with our different senses as this table."}, {"time": 449, "text": "Then there's also ideas of chemistry that over layers of abstraction, from DNA to embryos, the cells that make the human body."}, {"time": 462, "text": "So all of that is not real."}, {"time": 466, "text": "It's a real experience, and it's a real adaptive set of perceptions."}, {"time": 472, "text": "So it's an adaptive set of perceptions, full stop."}, {"time": 476, "text": "We want to think that the perceptions are real."}, {"time": 478, "text": "So their perceptions are real as perceptions, right?"}, {"time": 481, "text": "We are having our perceptions, but we've assumed that there's a pretty tight relationship between our perceptions and reality."}, {"time": 489, "text": "If I look up and see the moon, then there is something that exists in space and time that matches what I perceive."}, {"time": 498, "text": "And all I'm saying is that if you take evolution by natural selection seriously, then that is precluded."}, {"time": 509, "text": "That our perceptions are there."}, {"time": 511, "text": "They're there to guide adaptive behavior, full stop."}, {"time": 515, "text": "They're not there to show you the truth."}, {"time": 516, "text": "In fact, the way I think about it is they're there to hide the truth because the truth is too complicated."}, {"time": 522, "text": "It's just like if you're trying to use your laptop to write an email, right?"}, {"time": 527, "text": "What you're doing is toggling voltages in the computer, but good luck trying to do it that way."}, {"time": 532, "text": "The reason why we have a user interface is because we don't want to know that quote unquote truth, the diodes and resistors and all that terrible hardware."}, {"time": 539, "text": "If you had to know all that truth, your friends wouldn't hear from you."}, {"time": 544, "text": "So what evolution gave us was perceptions that guide adaptive behavior."}, {"time": 550, "text": "And part of that process, it turns out, means hiding the truth and giving you eye candy."}, {"time": 593, "text": "Is that completely detached from the zeros and ones that are firing away inside the computer?"}, {"time": 602, "text": "Of course, when I talk about the user interface on your desktop, there's this whole sophisticated backstory to it, right?"}, {"time": 611, "text": "That the hardware and the software that's allowing that to happen."}, {"time": 615, "text": "Evolution doesn't tell us the backstory, right?"}, {"time": 617, "text": "So the theory of evolution is not going to be adequate to tell you what is that backstory."}, {"time": 623, "text": "It's gonna say that whatever reality is, and that's the interesting thing, it says whatever reality is, you don't see it."}, {"time": 631, "text": "You see a user interface, but it doesn't tell you what that user interface is, how it's built, right?"}, {"time": 638, "text": "Now, we can try to look at certain aspects of the interface, but already we're gonna look at that and go, okay, before I would look at neurons and I was assuming that I was seeing something that was at least partially true."}, {"time": 652, "text": "And now I'm realizing that it could be like looking at the pixels on my desktop or icons on my desktop and good luck going from that to the data structures and then the voltages and I mean, good luck."}, {"time": 664, "text": "There's just no way."}, {"time": 666, "text": "So what's interesting about this is that our scientific theories are precise enough and rigorous enough to tell us certain limits, but, and even limits of the theories themselves, but they're not going to tell us what the next move is and that's where scientific creativity comes in."}, {"time": 685, "text": "So the stuff that I'm saying here, for example, is not alien to physicists."}, {"time": 691, "text": "The physicists are saying precisely the same thing that space time is doomed."}, {"time": 695, "text": "We've assumed that space time is fundamental."}, {"time": 697, "text": "We've assumed that for several centuries and it's been very useful."}, {"time": 700, "text": "So all the things that you were mentioning, the particles and all the work that's been done, that's all been done in space time, but now physicists are saying space time is doomed."}, {"time": 707, "text": "There's no such thing as space time fundamentally in the laws of physics."}, {"time": 714, "text": "And that comes actually out of gravity together with quantum field theory, which just comes right out of it."}, {"time": 721, "text": "It's a theorem of those two theories put together, but it doesn't tell you what's behind it."}, {"time": 728, "text": "So the physicists know that their best theories, Einstein's gravity and quantum field theory put together entail that space time cannot be fundamental and therefore particles in space time cannot be fundamental."}, {"time": 740, "text": "They're just irreducible representations of the symmetries of space time."}, {"time": 743, "text": "That's what they are."}, {"time": 744, "text": "So we have, so space time, so we put the two together."}, {"time": 747, "text": "We put together what the physicists are discovering and we can talk about how they do that."}, {"time": 752, "text": "And then we, the new discoveries from evolution of a natural selection."}, {"time": 755, "text": "Both of these discoveries are really in the last 20 years."}, {"time": 758, "text": "And what both are saying is space time has had a good ride."}, {"time": 763, "text": "It's been very useful."}, {"time": 764, "text": "Reductionism has been useful, but it's over."}, {"time": 766, "text": "And it's time for us to go beyond."}, {"time": 768, "text": "When you say space time is doomed, is it the space, is it the time, is it the very hard coded specification of four dimensions?"}, {"time": 779, "text": "Or are you specifically referring to the kind of perceptual domain that humans operate in, which is space time?"}, {"time": 787, "text": "You think like there's a 3D, like our world is three dimensional and time progresses forward."}, {"time": 795, "text": "Therefore, three dimensions plus one, 4D."}, {"time": 798, "text": "What exactly do you mean by space time?"}, {"time": 800, "text": "And what do you mean by space time is doomed?"}, {"time": 804, "text": "So this is, by the way, not my quote."}, {"time": 806, "text": "This is from, for example, Nima Arkanihaim Ed at the Institute for Advanced Study at Princeton."}, {"time": 811, "text": "Ed Witten, also there."}, {"time": 814, "text": "David Gross, Nobel Prize winner."}, {"time": 816, "text": "So this is not just something the cognitive scientists, this is what the physicists are saying."}, {"time": 820, "text": "Yeah, the physicists, they're space time skeptics."}, {"time": 825, "text": "Well, yeah, they're saying that, and I can say exactly why they think it's doomed."}, {"time": 829, "text": "But what they're saying is that, because your question was what aspect of space time, what are we talking about here?"}, {"time": 835, "text": "It's both space and time."}, {"time": 836, "text": "They're union into space time as an Einstein's theory."}, {"time": 839, "text": "That's doomed."}, {"time": 841, "text": "And they're basically saying that even quantum theory, this is with Nima Arkanihaim Ed, especially."}, {"time": 849, "text": "So Hilbert spaces will not be fundamental either."}, {"time": 852, "text": "So that the notion of Hilbert space, which is really critical to quantum field theory, quantum information theory, that's not going to figure in the fundamental new laws of physics."}, {"time": 865, "text": "So what they're looking for is some new mathematical structures beyond space time, beyond Einstein's four dimensional space time or super symmetric version, geometric algebra signature two comma four kind of."}, {"time": 881, "text": "There are different ways that you can represent it, but they're finding new structures."}, {"time": 885, "text": "And then by the way, they're succeeding now."}, {"time": 887, "text": "They're finding, they found something called the amplituhedron."}, {"time": 889, "text": "This is Nima and his colleagues, the cosmological polytope."}, {"time": 893, "text": "So there are these like polytopes, these polyhedra in multi dimensions, generalizations of simplices that are coding for, for example, the scattering amplitudes of processes in the Large Hadron Collider and other colliders."}, {"time": 910, "text": "So they're finding that if they let go of space time, completely, they're finding new ways of computing these scattering amplitudes that turn literally billions of terms into one term."}, {"time": 923, "text": "When you do it in space and time, because it's the wrong framework, it's just a user interface from, that's not from the evolutionary point of view, it's just user interface."}, {"time": 932, "text": "It's not a deep insight into the nature of reality."}, {"time": 934, "text": "So it's missing deep symmetry is something called a dual conformal symmetry, which turns out to be true of the scattering data, but you can't see it in space time."}, {"time": 942, "text": "And it's making the computations way too complicated because you're trying to compute all the loops in the Feynman diagrams and all the Feynman integrals."}, {"time": 950, "text": "So see the Feynman approach to the scattering amplitudes is trying to enforce two critical properties of space time, locality and unitarity."}, {"time": 958, "text": "And so by, when you enforce those, you get all these loops and multiple, different levels of loops."}, {"time": 964, "text": "And for each of those, you have to add new terms to your computation."}, {"time": 967, "text": "But when you do it outside of space time, you don't have the notion of unitarity."}, {"time": 973, "text": "You don't have the notion of locality."}, {"time": 975, "text": "You have something deeper and it's capturing some symmetries that are actually true of the data."}, {"time": 980, "text": "And, but then when you look at the geometry of the facets of these polytopes, then certain of them will code for unitarity and locality."}, {"time": 990, "text": "So it actually comes out of the structure of these deep polytopes."}, {"time": 993, "text": "So what we're finding is there's this whole new world."}, {"time": 996, "text": "Now beyond space time that is making explicit symmetries that are true of the data that cannot be seen in space time."}, {"time": 1005, "text": "And that is turning the computations from billions of terms to one or two or a handful of terms."}, {"time": 1010, "text": "So we're getting insights into symmetries and all of a sudden the math is becoming simple because we're not doing something silly."}, {"time": 1016, "text": "We're not adding up all these loops in space time."}, {"time": 1019, "text": "We're doing something far deeper."}, {"time": 1020, "text": "But they don't know what this world is about."}, {"time": 1022, "text": "Also, they're in an interesting position where we know that space time is doomed."}, {"time": 1029, "text": "And I should probably tell you why it's doomed, what they're saying about why it's doomed."}, {"time": 1032, "text": "But they need a flashlight to look beyond space time."}, {"time": 1035, "text": "What flashlight are we gonna use to look into the dark beyond space time?"}, {"time": 1039, "text": "Because Einstein's theory and quantum theory can't tell us what's beyond them."}, {"time": 1043, "text": "All they can do is tell us that when you put us together, space time is doomed at 10 to the minus 33 centimeters, 10 to the minus 43 seconds."}, {"time": 1051, "text": "Beyond that, space time doesn't even make sense."}, {"time": 1054, "text": "It just has no operational definition."}, {"time": 1057, "text": "So, but it doesn't tell you what's beyond."}, {"time": 1059, "text": "And so they're just looking for deep structures like guessing is really fun."}, {"time": 1063, "text": "So these really brilliant guys, generic brilliant men and women who are doing this work, physicists, are making guesses about these structures, informed guesses, because they're trying to ask, well, okay, what deeper structure could give us the stuff that we're seeing in space time, but without certain commitments that we have to make in space time, like locality."}, {"time": 1082, "text": "So they make these brilliant guesses."}, {"time": 1084, "text": "And of course, most of the time you're gonna be wrong, but once you get one or two that start to pay off and then you get some lucky breaks."}, {"time": 1091, "text": "So they got a lucky break back in 1986."}, {"time": 1095, "text": "Couple of mathematicians named Park and Taylor took the scattering amplitude for two gluons coming in at high energy and four gluons going out at low energy."}, {"time": 1105, "text": "So that kind of scattering thing."}, {"time": 1107, "text": "So it's like apparently for people who are into this, that's sort of something that happens so often you need to be able to find it and get rid of those cause you already know about that and you need to."}, {"time": 1116, "text": "So you needed to compute them."}, {"time": 1117, "text": "It was billions of terms and they couldn't do it even though for the supercomputers couldn't do that for the many billions or millions of times per second they needed to do it."}, {"time": 1125, "text": "So the experimentals begged the theorists, please, you got it."}, {"time": 1131, "text": "And so Park and Taylor took the billions of terms, hundreds of pages and miraculously turned it into nine."}, {"time": 1138, "text": "And then a little bit later, they guessed one term expression that turned out to be equivalent."}, {"time": 1142, "text": "So billions of terms reduced to one term, that so called famous Park Taylor formula, 1986."}, {"time": 1150, "text": "And that was like, okay, where did that come from?"}, {"time": 1154, "text": "This is a pointer into a deep realm, beyond space and time, but no one, I mean, what can you do with it?"}, {"time": 1161, "text": "And they thought maybe it was a one off, but then other formulas started coming up."}, {"time": 1165, "text": "And then eventually Neymar, Connie, Hamid and his team found this thing called the amplituhedron, which really sort of captures the whole, a big part of the whole ball of wax."}, {"time": 1174, "text": "I'm sure they would say, no, there's plenty more to do."}, {"time": 1177, "text": "So I won't say they did it all by any means."}, {"time": 1180, "text": "They're looking at the cosmological polytope as well."}, {"time": 1182, "text": "So what's remarkable to me is that two pillars of modern science, quantum field theory with gravity on the one hand and evolution by natural selection on the other, just in the last 20 years have very clearly said space time has had a good run."}, {"time": 1201, "text": "Reductionism has been a fantastic methodology."}, {"time": 1203, "text": "So we had a great ontology of space time, a great methodology of reductionism."}, {"time": 1207, "text": "Now it's time for a new trick."}, {"time": 1210, "text": "But now you need to go deeper and show, but by the way, this doesn't mean we throw away everything we've done, not by a long shot."}, {"time": 1217, "text": "Every new idea that we come up with beyond space time must project precisely into space time."}, {"time": 1223, "text": "And it better give us back everything that we know and love in space time or generalizations, or it's not gonna be taken seriously and it shouldn't be."}, {"time": 1230, "text": "So we have a strong constraint on whatever we're going to do beyond space time, it needs to project into space time."}, {"time": 1237, "text": "And whatever this deeper theory is, it may not itself have evolution by natural selection."}, {"time": 1242, "text": "This may not be part of this deeper realm."}, {"time": 1244, "text": "But when we take whatever that thing is beyond space time and project it into space time, it has to look like evolution by natural selection or it's wrong."}, {"time": 1252, "text": "So that's a strong constraint on this work."}, {"time": 1257, "text": "So even the evolution by natural selection and quantum field theory could be interfaces into something that doesn't look anything like, like you mentioned."}, {"time": 1272, "text": "I mean, it's interesting to think that evolution might be a very crappy interface into something much deeper."}, {"time": 1279, "text": "They're both telling us that the framework that you've had can only go so far and it has to stop."}, {"time": 1284, "text": "And there's something beyond."}, {"time": 1285, "text": "And the very framework that is space and time itself."}, {"time": 1289, "text": "Now, of course, evolution by natural selection is not telling us about like Einstein's relativistic space time."}, {"time": 1296, "text": "So that was another question you asked a little bit earlier."}, {"time": 1298, "text": "It's telling us more about our perceptual space and time, which we have used as the basis for creating first Newtonian space versus time as a mathematical extension of our perceptions."}, {"time": 1313, "text": "And then Einstein then took that and extended it even further."}, {"time": 1316, "text": "So the relationship between what evolution is telling us and what the physicists are telling us is that in some sense, the Newton and Einstein space time are formulated as sort of rigorous extensions of our perceptual space, making it mathematically rigorous and laying out the symmetries that they find there."}, {"time": 1339, "text": "So that's sort of the relationship between them."}, {"time": 1340, "text": "So it's the perceptual space time that evolution is telling us is just a user interface effectively."}, {"time": 1347, "text": "And then the physicists are finding that even the mathematical extension of that into the Einsteinian formulation has to be as well, not the final story, there's something deeper."}, {"time": 1358, "text": "So let me ask you about reductionism and interfaces as we march forward from Newtonian physics to quantum mechanics."}, {"time": 1369, "text": "These are all, in your view, interfaces."}, {"time": 1376, "text": "Are we getting closer to objective reality?"}, {"time": 1379, "text": "How do we know if these interfaces in the process of science, the reason we like those interfaces is because they're predictive of some aspects, strongly predictive about some aspects of our reality."}, {"time": 1394, "text": "Is that completely deviating from our understanding of that reality or is it helping us get closer and closer and closer?"}, {"time": 1402, "text": "Well, of course, one critical constraint on all of our theories is that they are empirically tested and pass the experiments that we have for them."}, {"time": 1410, "text": "So no one's arguing against experiments being important and wanting to test all of our current theories and any new theories on that."}, {"time": 1420, "text": "So that's all there."}, {"time": 1424, "text": "But we have good reason to believe that science will never get a theory of everything."}, {"time": 1432, "text": "Everything, everything, right."}, {"time": 1433, "text": "A final theory of everything, right."}, {"time": 1459, "text": "And if you add the new statements to your axioms, then there'll be always new statements that are true, but can't be proven with a new axiom system."}, {"time": 1466, "text": "And the best scientific theories in physics, for example, and also now evolution, are mathematical."}, {"time": 1475, "text": "So our theories are gonna be, they're gonna have their own assumptions and they'll be mathematically precise."}, {"time": 1481, "text": "And there'll be theories, perhaps, of everything except those assumptions, because the assumptions are, we say, please grant me these assumptions."}, {"time": 1488, "text": "If you grant me these assumptions, then I can explain this other stuff."}, {"time": 1492, "text": "So you have the assumptions that are like miracles, as far as the theory is concerned."}, {"time": 1498, "text": "They're not explained."}, {"time": 1499, "text": "They're the starting points for explanation."}, {"time": 1507, "text": "And so my take is that reality, reality, whatever it is, is always going to transcend any conceptual theory that we didn't come up with."}, {"time": 1522, "text": "There's always gonna be mystery at the edges."}, {"time": 1527, "text": "Contradictions and all that kind of stuff."}, {"time": 1531, "text": "And truths."}, {"time": 1532, "text": "So there's this idea that is brought up in the financial space of settlement of transactions."}, {"time": 1539, "text": "It's often talked about in cryptocurrency, especially."}, {"time": 1542, "text": "So you could do, you know, money, cash, is not connected to anything."}, {"time": 1548, "text": "It used to be connected to gold, to physical reality, but then you can use money to exchange, to exchange value, to transact."}, {"time": 1557, "text": "So when it was on the gold standard, the money would represent some stable component of reality."}, {"time": 1564, "text": "Isn't it more effective to avoid things like hyperinflation if we generalize that idea?"}, {"time": 1574, "text": "Isn't it better to connect your, whatever we humans are doing in the social interaction space with each other, isn't it better from an evolutionary perspective to connect it to some degree to reality so that the transactions are settled with something that's universal, as opposed to us constantly operating in something that's a complete illusion?"}, {"time": 1598, "text": "Isn't it easy to hyperinflate that?"}, {"time": 1601, "text": "Like where you really deviate very, very far away from the underlying reality, or do you not never get in trouble for this?"}, {"time": 1613, "text": "Can you just completely drift far, far away from the underlying reality and never get in trouble?"}, {"time": 1621, "text": "That's a great question, on the financial side, there's two levels at least that we could take your question."}, {"time": 1626, "text": "One is strictly like evolutionary psychology of financial systems, and that's pretty interesting."}, {"time": 1633, "text": "And there the decentralized idea, the DeFi kind of idea in cryptocurrencies may make good sense from just an evolutionary psychology point of view."}, {"time": 1642, "text": "Having human nature being what it is, putting a lot of faith in a few central controllers depends a lot on the veracity of those and trustworthiness of those few central controllers."}, {"time": 1657, "text": "And we have ample evidence time and again that that's often betrayed."}, {"time": 1661, "text": "So it makes good evolutionary sense, I would say, to have a decentralized, I mean, democracy is a step in that direction, right?"}, {"time": 1669, "text": "We don't have a monarch now telling us what to do, we decentralize things, right?"}, {"time": 1674, "text": "Because if the monarch, if you have Marcus Aurelius as your emperor, you're great."}, {"time": 1678, "text": "If you have Nero, it's not so great."}, {"time": 1681, "text": "And so we don't want that."}, {"time": 1682, "text": "So democracy is a step in that direction, but I think the DeFi thing is an even bigger step and is going to even make the democratization even greater."}, {"time": 1693, "text": "So that's one level of it."}, {"time": 1694, "text": "Also, the fact that power corrupts and absolute power corrupts absolutely is also a consequence of evolution."}, {"time": 1704, "text": "That's also a feature, I think, right?"}, {"time": 1706, "text": "You can argue from the long span of living organisms, it's nice for power to corrupt for you to, so mad men and women throughout history might be useful to teach us a lesson about ourselves."}, {"time": 1723, "text": "We can learn from our negative example, right?"}, {"time": 1728, "text": "Power does corrupt and I think that you can think about that again from an evolutionary point of view."}, {"time": 1733, "text": "But I think that your question was a little deeper when that was, does the evolutionary interface idea sort of unhinge science from some kind of important test for the theories, right?"}, {"time": 1748, "text": "We don't want, it doesn't mean that anything goes in scientific theory, but there's no, if we don't see the truth, is there no way to tether our theories and test them?"}, {"time": 1758, "text": "And I think there's no problem there."}, {"time": 1763, "text": "We can only test things in terms of what we can measure with our senses in space and time."}, {"time": 1769, "text": "So we're going to have to continue to do experiments and, but we're going to re, we're going to understand a little bit differently what those experiments are."}, {"time": 1778, "text": "We had thought that when we see a pointer on some machine in an experiment, that the machine exists, the pointer exists and the values exist even when no one is looking at them and that they're an objective truth."}, {"time": 1792, "text": "And our best theories are telling us no, the pointers are just pointers and that's what you have to rely on for making your judgments."}, {"time": 1802, "text": "But even the pointers themselves are not the objective reality."}, {"time": 1823, "text": "So I don't think we're untethered."}, {"time": 1825, "text": "We continue to do experiments."}, {"time": 1828, "text": "What I think we won't have that we want is a conceptual understanding that gives us a theory of everything that's final and complete."}, {"time": 1837, "text": "I think that this is, to put it another way, this is job security for scientists."}, {"time": 1844, "text": "Our job will never be done."}, {"time": 1845, "text": "It's job security for neuroscience."}, {"time": 1847, "text": "Because before we thought that when we looked in the brain, we saw neurons and neural networks and action potentials and synapses and so forth."}, {"time": 1857, "text": "And that was it, that was the reality."}, {"time": 1860, "text": "Now we have to reverse engineer that."}, {"time": 1861, "text": "We have to say, what is beyond space time?"}, {"time": 1865, "text": "What is a dynamical system beyond space time?"}, {"time": 1868, "text": "That when we project it into Einstein's space time, gives us things that look like neurons and neural networks and synapses."}, {"time": 1875, "text": "So we have to reverse engineer it."}, {"time": 1876, "text": "So there's gonna be lots more work for neuroscience."}, {"time": 1879, "text": "It's gonna be far more complicated and difficult and challenging."}, {"time": 1883, "text": "But that's wonderful, that's what we need to do."}, {"time": 1886, "text": "We thought neurons exist when they are perceived and they don't."}, {"time": 1889, "text": "In the same way that if I show you, when I say they don't exist, I should be very, very concrete."}, {"time": 1894, "text": "If I draw on a piece of paper, a little sketch of something that is called the Necker cube, it's just a little line drawing of a cube, right?"}, {"time": 1902, "text": "It's not a flat piece of paper."}, {"time": 1904, "text": "If I execute it well, and I show it to you, you'll see a 3D cube and you'll see it flip."}, {"time": 1908, "text": "Sometimes you'll see one face in front, sometimes you'll see the other face in front."}, {"time": 1911, "text": "But if I ask you, which face is in front when you don't look?"}, {"time": 1917, "text": "The answer is, well, neither face is in front because there's no cube."}, {"time": 1921, "text": "There's just a flat piece of paper."}, {"time": 1923, "text": "So when you look at the piece of paper, you perceptually create the cube."}, {"time": 1928, "text": "And when you look at it, then you fix one face to be in front and one face to be."}, {"time": 1933, "text": "So that's what I mean when I say it doesn't exist."}, {"time": 1936, "text": "Space time itself is like the cube."}, {"time": 1938, "text": "It's a data structure that your sensory systems construct, whatever your sensory systems mean now, because we now have to not even take that for granted."}, {"time": 1947, "text": "But there are perceptions that you construct on the fly and they're data structures in a computer science sense, and you garbage collect them when you don't need them."}, {"time": 1955, "text": "So you create them and garbage collect them."}, {"time": 1957, "text": "But is it possible that it's mapped well in some concrete, predictable way to objective reality?"}, {"time": 1965, "text": "The sheet of paper, this two dimensional space, or we can talk about space time, maps in some way that we maybe don't yet understand, but we'll one day understand what that mapping is, but it maps reliably."}, {"time": 1980, "text": "It is tethered in that way."}, {"time": 1983, "text": "And so the new theories that the physicists are finding beyond space time have that kind of tethering."}, {"time": 1988, "text": "So they show precisely how you start with an epileptic hedron and how you project this high dimensional structure into the four dimensions of space time."}, {"time": 1998, "text": "So there's a precise procedure that relates the two."}, {"time": 2002, "text": "And they're doing the same thing with the cosmological polytopes."}, {"time": 2005, "text": "So they're the ones that are making the most concrete and fun advances going beyond space time."}, {"time": 2012, "text": "And they're tethering it, right?"}, {"time": 2015, "text": "They say this is precisely the mathematical projection from this deeper structure into space time."}, {"time": 2021, "text": "One thing I'll say about, as a non physicist, what I find interesting is that they're finding just geometry, but there's no notion of dynamics."}, {"time": 2031, "text": "Right now, they're just finding these static geometric structures, which is impressive."}, {"time": 2037, "text": "So I'm not putting them down."}, {"time": 2038, "text": "This is what they're doing is unbelievably complicated and brilliant and adventurous, it's all those things."}, {"time": 2048, "text": "And beautiful from a human aesthetic perspective because geometry is beautiful."}, {"time": 2052, "text": "It's absolutely."}, {"time": 2054, "text": "And they're finding symmetries that are true of the data that can't be seen in space time."}, {"time": 2058, "text": "But I'm looking for a theory beyond space time that's a dynamical theory."}, {"time": 2065, "text": "I would love to find, and we can talk about that at some point, a theory of consciousness in which the dynamics of consciousness itself will give rise to the geometry that the physicists are finding beyond space time."}, {"time": 2077, "text": "If we can do that, then we'd have a completely different way of looking at how consciousness is related to what we call the brain or the physical world more generally, right?"}, {"time": 2086, "text": "Right now, all of my brilliant colleagues, well, 99% of them are trying to, they're assuming space time is fundamental."}, {"time": 2096, "text": "They're assuming that particles are fundamental, quarks, gluons, leptons, and so forth."}, {"time": 2102, "text": "Elements, atoms, and so forth are fundamental and that therefore neurons and brains are part of objective reality."}, {"time": 2108, "text": "And that somehow when you get matter that's complicated enough, it will somehow generate conscious experiences by its functional properties."}, {"time": 2117, "text": "Or if you're panpsychist, maybe you, in addition to the physical properties of particles, you add your consciousness property as well."}, {"time": 2127, "text": "And then you combine these physical and conscious properties to get more complicated ones."}, {"time": 2132, "text": "But they're all doing it within space time."}, {"time": 2136, "text": "All of the work that's being done on consciousness and its relationship to the brain is all assumed something that our best theories are telling us is doomed, space time."}, {"time": 2146, "text": "Why does that particular assumption bother you the most?"}, {"time": 2150, "text": "So you bring up space time."}, {"time": 2153, "text": "I mean, that's just one useful interface we've used for a long time."}, {"time": 2159, "text": "Surely there's other interfaces."}, {"time": 2161, "text": "Is space time just one of the big ones that you, to build up people's intuition about the fact that they do assume a lot of things strongly?"}, {"time": 2170, "text": "Or is it in fact the fundamental flaw in the way we see the world?"}, {"time": 2177, "text": "Well, everything else that we think we know are things in space time."}, {"time": 2184, "text": "And so when you say space time is doomed, this is a shot to the heart of the whole framework, the whole conceptual framework that we've had in science."}, {"time": 2195, "text": "Not to the scientific method, but to the fundamental ontology and also the fundamental methodology, the ontology of space time and its contents, and the methodology of reductionism, which is that as we go to smaller scales in space time, we will find more and more fundamental laws."}, {"time": 2215, "text": "And that's been very useful for space and time for centuries, reductionism for centuries."}, {"time": 2221, "text": "But now we realize that that's over."}, {"time": 2224, "text": "Reductionism is in fact dead, as is space time."}, {"time": 2228, "text": "What exactly is reductionism?"}, {"time": 2230, "text": "What is the process of reductionism that is different than some of the physicists that you mentioned that are trying to think, trying to let go of the assumption of space time?"}, {"time": 2242, "text": "Looking beyond, isn't that still trying to come up with a simple model that explains this whole thing?"}, {"time": 2247, "text": "Isn't it still reducing?"}, {"time": 2249, "text": "It's a wonderful question, because it really helps to clarify two different notions, which is scientific explanation on the one hand, and a particular kind of scientific explanation on the other, which is the reductionist."}, {"time": 2260, "text": "So the reductionist explanation is saying, I will start with things that are smaller in space time and therefore more fundamental, where the laws are more fundamental."}, {"time": 2271, "text": "So we go to just smaller and smaller scales."}, {"time": 2274, "text": "Whereas in science more generally, we just say like when Einstein did the special theory of relativity, he's saying, let me have a couple of postulates."}, {"time": 2283, "text": "I will assume that the speed of light is universal for all observers in uniform motion, and that the laws of physics, so if you're for uniform motion are, that's not a reductionist."}, {"time": 2298, "text": "Those are saying, grant me these assumptions."}, {"time": 2300, "text": "I can build this entire concept of space time out of it."}, {"time": 2303, "text": "It's not a reductionist thing."}, {"time": 2304, "text": "You're not going to smaller and smaller scales of space."}, {"time": 2307, "text": "You're coming up with these deep, deep principles."}, {"time": 2310, "text": "Same thing with his theory of gravity, right?"}, {"time": 2313, "text": "It's the falling elevator idea, right?"}, {"time": 2315, "text": "So this is not a reductionist kind of thing."}, {"time": 2319, "text": "So simplification is a bigger thing than just reductionism."}, {"time": 2325, "text": "Reductionism has been a particularly useful kind of scientific explanation, for example, in thermodynamics, right?"}, {"time": 2331, "text": "Where the notion that we have of heat, some macroscopic thing like temperature and heat, it turns out that Neil Boltzmann and others discovered, well, hey, if we go to smaller and smaller scales, we find these things called molecules or atoms."}, {"time": 2344, "text": "And if we think of them as bouncing around and having some kind of energy, then what we call heat really can be reduced to that."}, {"time": 2354, "text": "And so that's a particularly useful kind of reduction, is a useful kind of scientific explanation that works within a range of scales within space time."}, {"time": 2365, "text": "But we know now precisely where that has to stop."}, {"time": 2368, "text": "At 10 to the minus 33 centimeters and 10 to the minus 43 seconds."}, {"time": 2372, "text": "And I would be impressed if it was 10 to the minus 33 trillion centimeters."}, {"time": 2377, "text": "I'm not terribly impressed at 10 to the minus 33 centimeters."}, {"time": 2383, "text": "I don't even know how to comprehend either of those numbers, frankly."}, {"time": 2387, "text": "Just a small aside, because I am a computer science person, I also find cellular automata beautiful."}, {"time": 2394, "text": "And so you have somebody like Stephen Wolfram, who recently has been very excitedly exploring a proposal for a data structure that could be the numbers that would make you a little bit happier in terms of scale, because they're very, very, very, very tiny."}, {"time": 2412, "text": "So do you like this space of exploration of really thinking, letting go of space time, letting go of everything and trying to think what kind of data structures could be underneath this whole mess?"}, {"time": 2424, "text": "So if they're thinking about these as outside of space time, then that's what we have to do."}, {"time": 2429, "text": "That's what our best theories are telling us."}, {"time": 2430, "text": "You now have to think outside of space time."}, {"time": 2432, "text": "Now, of course, I should back up and say, we know that Einstein surpassed Newton, right?"}, {"time": 2440, "text": "But that doesn't mean that there's not good work to do on Newton."}, {"time": 2442, "text": "There's all sorts of Newtonian physics that takes us to the moon and so forth, and there's lots of good problems that we want to solve with Newtonian physics."}, {"time": 2449, "text": "The same thing will be true of space time."}, {"time": 2452, "text": "It's not like we're gonna stop using space time."}, {"time": 2453, "text": "We'll continue to do all sorts of good work there."}, {"time": 2456, "text": "But for those scientists who are really looking to go deeper, to actually find the next, just like what Einstein did to Newton, what are we gonna do to Einstein?"}, {"time": 2467, "text": "How do we get beyond Einstein and quantum theory to something deeper?"}, {"time": 2470, "text": "Then we have to actually let go."}, {"time": 2473, "text": "And if we're gonna do like this automata kind of approach, it's critical that it's not automata in space time, it's automata prior to space time, from which we're going to show how space time emerges."}, {"time": 2485, "text": "If you're doing automata within space time, well, that might be a fun model, but it's not the radical new step that we need."}, {"time": 2493, "text": "Yeah, so the space time emerges from that whatever system."}, {"time": 2496, "text": "Like you're saying, it's a dynamical system."}, {"time": 2499, "text": "Do we even have an understanding what dynamical means when we go beyond?"}, {"time": 2505, "text": "When you start to think about dynamics, it could mean a lot of things."}, {"time": 2510, "text": "Even causality could mean a lot of things if we realize that everything's an interface."}, {"time": 2518, "text": "Like how much do we really know is an interesting question."}, {"time": 2521, "text": "Because you brought up neurons, I gotta ask you yet another tangent."}, {"time": 2525, "text": "There's a paper I remember a while ago looking at called Could a Neuroscientist Understand a Microprocessor?"}, {"time": 2531, "text": "And I just enjoyed that thought experiment that they provided, which is they basically, it's a couple of neuroscientists, Eric Jonas and Conrad Cording, who use the tools of neuroscience to analyze a microprocessor, so a computer chip."}, {"time": 2550, "text": "Now, if we lesion it here, what happens and so forth, and if you go and lesion in a computer, it's very, very clear that lesion experiments on computers are not gonna give you a lot of insight into how it works."}, {"time": 2560, "text": "And also the measurement devices and the kind of sort of, just using the basic approaches of neuroscience, collecting the data, trying to intuit about the underlying function of it."}, {"time": 2569, "text": "And that helps you understand that our scientific exploration of concepts, depending on the field, are maybe in the very, very early stages."}, {"time": 2585, "text": "I wouldn't say it leaves us astray, perhaps it does sometimes, but it's not anywhere close to some fundamental mechanism that actually makes a thing work."}, {"time": 2596, "text": "I don't know if you can sort of comment on that in terms of using neuroscience to understand the human mind and neurons."}, {"time": 2604, "text": "Are we really far away potentially from understanding in the way we understand the transistors enough to be able to build a computer?"}, {"time": 2613, "text": "So one thing about understanding is you can understand for fun."}, {"time": 2620, "text": "The other one is to understand so you could build things."}, {"time": 2625, "text": "And that's when you really have to understand."}, {"time": 2629, "text": "In fact, what got me into the field at MIT was work by David Marr on this very topic."}, {"time": 2637, "text": "So David Marr was a professor at MIT, but he'd done his PhD in neuroscience, studying just the architectures of the brain."}, {"time": 2645, "text": "But he realized that his work, it was on the cerebellum."}, {"time": 2650, "text": "He realized that his work, as rigorous as it was, left him unsatisfied because he didn't know what the cerebellum was for and why it had that architecture."}, {"time": 2661, "text": "And so he went to MIT and he was in the AI lab there."}, {"time": 2665, "text": "And he said, he had this three level approach that really grabbed my attention."}, {"time": 2670, "text": "So when I was an undergrad at UCLA, I read one of his papers in a class and said, who is this guy?"}, {"time": 2675, "text": "Because he said, you have to have a computational theory."}, {"time": 2677, "text": "What is being computed and why?"}, {"time": 2680, "text": "An algorithm, how is it being computed?"}, {"time": 2682, "text": "What are the precise algorithms?"}, {"time": 2684, "text": "And then the hardware, how does it get instantiated in the hardware?"}, {"time": 2687, "text": "And so to really do neuroscience, he argued, we needed to have understanding at all those levels."}, {"time": 2692, "text": "And that really got me."}, {"time": 2694, "text": "I loved the neuroscience, but I realized this guy was saying, if you can't build it, you don't understand it effectively."}, {"time": 2700, "text": "And so that's why I went to MIT."}, {"time": 2702, "text": "And I had the pleasure of working with David until he died just a year and a half later."}, {"time": 2709, "text": "So there's been that idea that with neuroscience, we have to have, in some sense, a top down model of what's being computed and why that we would then go after."}, {"time": 2720, "text": "And the same thing with the, you know, trying to reverse engineer a computing system like your laptop."}, {"time": 2725, "text": "We really need to understand what the user interface is about and what are keys on the keyboard for and so forth."}, {"time": 2734, "text": "You need to know why to really understand all the circuitry and what it's for."}, {"time": 2740, "text": "Now, we don't, evolution of a natural selection does not tell us the deeper question that we're asking, the answer to the deeper question, which is why?"}, {"time": 2753, "text": "What's this deeper reality and what's it up to and why?"}, {"time": 2759, "text": "All it tells us is that whatever reality is, it's not what you see."}, {"time": 2765, "text": "What you see is just an adaptive fiction."}, {"time": 2772, "text": "So just to linger on this fascinating, bold question that shakes you out of your dream state."}, {"time": 2778, "text": "Does this fiction still help you in building intuitions as literary fiction does about reality?"}, {"time": 2787, "text": "The reason we read literary fiction is it helps us build intuitions and understanding in indirect ways sneak up to the difficult questions of human nature, great fiction."}, {"time": 2801, "text": "Same with this observed reality."}, {"time": 2806, "text": "Does this interface that we get, this fictional interface, help us build intuition about deeper truths of how this whole mess works?"}, {"time": 2815, "text": "Well, I think that each theory that we propose will give its own answer to that question, right?"}, {"time": 2821, "text": "So when the physicists are proposing these structures like the amplituhedron and cosmological polytope, associahedron and so forth beyond space time, we can then ask your question for those specific structures and say, how much information, for example, does evolution by natural selection and the kinds of sensory systems that we have right now give us about this deeper reality?"}, {"time": 2846, "text": "And why did we evolve this way?"}, {"time": 2850, "text": "We can try to answer that question from within the deep."}, {"time": 2853, "text": "So there's not gonna be a general answer."}, {"time": 2854, "text": "I think what we'll have to do is posit these new deeper theories and then try to answer your question within the framework of those deeper theories, knowing full well that there'll be an even deeper theory."}, {"time": 2867, "text": "So is this paralyzing though?"}, {"time": 2869, "text": "Because how do we know we're not completely adrift out to sea, lost forever from, so like that our theories are completely lost."}, {"time": 2880, "text": "So if it's all, if we can never truly deeply introspect to the bottom, if it's always just turtles on top of turtles infinitely, isn't that paralyzing for the scientific mind?"}, {"time": 2898, "text": "Well, it's interesting that you say introspect to the bottom."}, {"time": 2901, "text": "Because there is one, again, this isn't the same spirit of what I said before, which is it depends on what answer you give to what's beyond space time, what answer we would give to your question, right?"}, {"time": 2915, "text": "So, but one answer that is interesting to explore is something that spiritual traditions have said for thousands of years, but haven't said precisely."}, {"time": 2923, "text": "So we can't take it seriously in science until it's made precise, but we might be able to make it precise."}, {"time": 2929, "text": "And that is that they've also said something like space and time aren't fundamental, they're Maya, they're illusion."}, {"time": 2936, "text": "And, but that if you look inside, if you introspect and let go of all of your particular perceptions, you will come to something that's beyond conceptual thought."}, {"time": 2951, "text": "And that is, they claim, being in contact with the deep ground of being that transcends any particular conceptual understanding."}, {"time": 2961, "text": "If that is correct, and I'm not saying it's correct, but, and I'm not saying it's not correct, I'm just saying, if that's correct, then it would be the case that as scientists, because we also are in touch with this ground of being, we would then not be able to conceptually understand ourselves all the way, but we could know ourselves just by being ourselves."}, {"time": 2983, "text": "And so we would, there would be a sense in which there is a fundamental grounding to the whole enterprise, because we're not separate from the enterprise."}, {"time": 2993, "text": "This is the opposite of the impersonal third person science."}, {"time": 2997, "text": "This would make science go personal all the way down."}, {"time": 3001, "text": "And, but nevertheless, scientific, because the scientific method would still be what we would use all the way down for the conceptual understanding."}, {"time": 3010, "text": "Unfortunately, I still don't know if you went all the way down."}, {"time": 3012, "text": "It's possible that this kind of whatever consciousness is and we'll talk about it, is getting the cliche statement of be yourself."}, {"time": 3024, "text": "It is somehow digging at a deeper truth of reality, but you still don't know when you get to the bottom."}, {"time": 3031, "text": "A lot of people, they'll take psychedelic drugs and they'll say, well, that takes my mind to certain places where it feels like that is revealing some deeper truth of reality, but you still, it could be interfaces on top of interfaces."}, {"time": 3046, "text": "That's, in your view of this, you really don't know."}, {"time": 3052, "text": "I mean, it's Gato's incompleteness is that you really don't know."}, {"time": 3055, "text": "My own view on it, for what it's worth, because I don't know the right answer, but my own view on it right now is that it's never ending."}, {"time": 3065, "text": "I think that there will never, that this is great, as I said before, great job security for science."}, {"time": 3072, "text": "And that we, if this is true, and if consciousness is somehow important or fundamental in the universe, this may be an important fundamental fact about consciousness itself, that it's a never ending exploration that's going on in some sense."}, {"time": 3090, "text": "Push back on the job security."}, {"time": 3094, "text": "So maybe as we understand this kind of idea deeper and deeper, we understand that the pursuit is not a fruitful one."}, {"time": 3102, "text": "Then maybe we need to, maybe that's why we don't see aliens everywhere, is you get smarter and smarter and smarter, you realize that exploration is, there's other fun ways to spend your time than exploring."}, {"time": 3119, "text": "You could be sort of living maximally in some way that's not exploration."}, {"time": 3125, "text": "There's all kinds of video games you can construct and put yourself inside of them that don't involve you going outside of the game world."}, {"time": 3135, "text": "It's a feeling, from my human perspective, what seems to be fun is challenging yourself and overcoming those challenges."}, {"time": 3142, "text": "So you can constantly artificially generate challenges for yourself, like Sisyphus and his boulder, just, and that's it."}, {"time": 3150, "text": "So the scientific method that's always reaching out to the stars, that's always trying to figure out the puzzle on the bottom puzzle, we're always trying to get to the bottom turtle."}, {"time": 3160, "text": "Maybe if we can build more and more the intuition that that's infinite pursuit, we agree to start deviating from that pursuit and start enjoying the here and now versus the looking out into the unknown always."}, {"time": 3176, "text": "Maybe that's looking out into the unknown as a early activity for a species that's evolved."}, {"time": 3187, "text": "I'm just sort of saying, pushing back, as you probably got a lot of scientists excited in terms of job security, I could envision where it's not job security, where scientists become more and more useless."}, {"time": 3202, "text": "Maybe they're like the holders of the ancient wisdom that allows us to study our own history, but not much more than that, just to push back."}, {"time": 3214, "text": "That's good pushback."}, {"time": 3216, "text": "I'll put one in there for the scientists again, but sure, but then I'll take the other side too."}, {"time": 3221, "text": "So when Faraday did all of his experiments with magnets and electricity and so forth, he came up with all this wonderful empirical data and James Clerk Maxwell looked at it and wrote down a few equations, which we can now write down in a single equation, the Maxwell equation if we use geometric algebra, just one equation."}, {"time": 3243, "text": "That opened up unbelievable technologies."}, {"time": 3247, "text": "People are zooming and talking to each other around the world, the whole electronics industry."}, {"time": 3253, "text": "There was something that transformed our lives in a very positive way."}, {"time": 3259, "text": "With the theories beyond space time, here's one potential, right now, most of the galaxies that we see, we can see them, but we know that we could never get to them no matter how fast we traveled."}, {"time": 3272, "text": "They're going away from us at the speed of light or beyond."}, {"time": 3276, "text": "So we can't ever get to them."}, {"time": 3277, "text": "So there's all this beautiful real estate that's just smiling and waving at us and we can never get to it."}, {"time": 3283, "text": "But that's if we go through space time."}, {"time": 3285, "text": "But if we recognize that space time is just a data structure, it's not fundamental."}, {"time": 3290, "text": "We're not little things inside space time."}, {"time": 3293, "text": "Space time was a little data structure in our perceptions."}, {"time": 3298, "text": "It's just the other way around."}, {"time": 3299, "text": "Once we understand that, and we get equations for the stuff that's beyond space time, maybe we won't have to go through space time."}, {"time": 3308, "text": "Maybe we can go around it."}, {"time": 3309, "text": "Maybe I can go to Proxima Centauri and not go through space."}, {"time": 3311, "text": "I can just go right there directly."}, {"time": 3314, "text": "It's a data structure."}, {"time": 3315, "text": "We can start to play with it."}, {"time": 3317, "text": "So I think that for what it's worth, my take would be that the endless sequence of theories that we could contemplate building will lead to an endless sequence of new remarkable insights into the potentialities, the possibilities that would seem miraculous to us."}, {"time": 3341, "text": "And that we will be motivated to continue the exploration partly just for the technological innovations that come out."}, {"time": 3350, "text": "But the other thing that you mentioned though, what about just being?"}, {"time": 3355, "text": "What if we decide instead of all this doing and exploring, what about being?"}, {"time": 3360, "text": "My guess is that the best scientists will do both and that the act of being will be a place where they get many of their ideas and that they then pull into the conceptual realm."}, {"time": 3376, "text": "And I think many of the best scientists, like Einstein comes to mind, right?"}, {"time": 3379, "text": "Where these guys say, look, I didn't come up with these ideas by a conceptual analysis."}, {"time": 3385, "text": "I was thinking in vague images and it was just something nonconceptual."}, {"time": 3391, "text": "And then it took me a long, long time to pull it out into concepts and then longer to put it into math."}, {"time": 3398, "text": "But the real insights didn't come from data."}, {"time": 3401, "text": "The real insights didn't come from just slavishly playing with equations."}, {"time": 3405, "text": "They came from a deeper place."}, {"time": 3408, "text": "And so there may be this going back and forth between the complete nonconceptual where there's essentially no end to the wisdom and then conceptual systems where there's the girdle limits that we have to that."}, {"time": 3422, "text": "And that may be, if consciousness is important and fundamental, that may be what consciousness, at least part of what consciousness is about is this discovering itself, discovering its possibilities, so to speak, and we can talk about what that might mean, by going from the nonconceptual to the conceptual and back and forth."}, {"time": 3443, "text": "So you get better and better and better at being."}, {"time": 3447, "text": "Let me ask you just to linger on the evolutionary, because you mentioned evolutionary game theory and that's really where you, the perspective from which you come to form the case against reality."}, {"time": 3462, "text": "At which point in our evolutionary history do we start to deviate the most from reality?"}, {"time": 3469, "text": "Is it way before life even originated on Earth?"}, {"time": 3475, "text": "Is it in the early development from bacteria and so on?"}, {"time": 3482, "text": "Or is it when some inklings of what we think of as intelligence or maybe even complex consciousness started to emerge?"}, {"time": 3492, "text": "So where did this deviation, just like with the interfaces in a computer, you start with transistors and then you have assembly and then you have C, C++, then you have Python, then you have GUIs, all that kind, you have layers upon layers."}, {"time": 3511, "text": "When did we start to deviate?"}, {"time": 3513, "text": "Well, David Marr, again, my advisor at MIT, in his book, Vision, suggested that the more primitive sensory systems were less realistic, less theoretical, but that by the time you got to something as complicated as the humans, we were actually estimating the true shapes and distances to objects and so forth."}, {"time": 3533, "text": "So his point of view, and I think it was probably, it's not an uncommon view among my colleagues that, yeah, the sensory systems of lower creatures may just not be complicated enough to give them much, much truth."}, {"time": 3550, "text": "But as you get to 86 million neurons, you can now compute the truth, or at least the parts of the truth that we need."}, {"time": 3557, "text": "When I look at evolutionary game theory, one of my graduate students, Justin Mark, did some simulations using genetic algorithms."}, {"time": 3567, "text": "So there he was just exploring, we start off with random organisms, random sensory genetics and random actions."}, {"time": 3576, "text": "And the first generation was unbelievably, it was a foraging situation."}, {"time": 3579, "text": "They were foraging for resources."}, {"time": 3581, "text": "Most of them stayed in one place, didn't do anything important."}, {"time": 3587, "text": "But we could then just look at how the genes evolved."}, {"time": 3591, "text": "And what we found was, what he found was that basically you never even saw the truth organisms even come on the stage."}, {"time": 3606, "text": "If they came up, they were gone in one generation, they just weren't."}, {"time": 3609, "text": "So they came and went even just in one generation."}, {"time": 3614, "text": "They just are not good enough."}, {"time": 3616, "text": "The ones that were just tracking, their senses just were tracking the fitness payoffs were far more fit than the truth seekers."}, {"time": 3625, "text": "So an answer at one level, I want to give an answer at a deeper level, but just with evolutionary game theory, because my attitude as a scientist is, I don't believe any of our theories."}, {"time": 3638, "text": "I take them very, very seriously."}, {"time": 3640, "text": "I study them, I look at their implications, but none of them are the gospel."}, {"time": 3643, "text": "They're just the latest ideas that we have."}, {"time": 3646, "text": "And so the reason I study evolutionary game theory is because that's the best tool we have right now in this area."}, {"time": 3653, "text": "There is nothing else that competes."}, {"time": 3656, "text": "And so as a scientist, it's my responsibility to take the best tools and see what they mean."}, {"time": 3661, "text": "And the same thing the physicists are doing."}, {"time": 3662, "text": "They're taking the best tools and looking at what they entail."}, {"time": 3666, "text": "But I think that science now has enough experience to realize that we should not believe our theories in the sense that we've now arrived."}, {"time": 3677, "text": "In 1890, a lot of physicists thought we'd arrived."}, {"time": 3681, "text": "They were discouraging bright young students from going into physics, because it was all done."}, {"time": 3687, "text": "And that's precisely the wrong attitude forever."}, {"time": 3691, "text": "It's the wrong attitude forever."}, {"time": 3693, "text": "The attitude we should have is a century from now, they'll be looking at us and laughing at what we didn't know."}, {"time": 3700, "text": "And we just have to assume that that's going to be the case."}, {"time": 3703, "text": "Just know that everything that we think is so brilliant right now, our final theory."}, {"time": 3708, "text": "A century from now, they'll look at us like we look at the physicists of 1890 and go, how could they have been so dumb?"}, {"time": 3714, "text": "So I don't want to make that mistake."}, {"time": 3716, "text": "So I'm not doctrinaire about any of our current scientific theories."}, {"time": 3722, "text": "I am doctrinaire about this."}, {"time": 3725, "text": "We should use the best tools we have right now."}, {"time": 3728, "text": "That's what we've got."}, {"time": 3729, "text": "And with humility."}, {"time": 3730, "text": "Well, so let me ask you about game theory."}, {"time": 3733, "text": "I love game theory, evolutionary game theory."}, {"time": 3738, "text": "But I'm always suspicious of it, like economics."}, {"time": 3743, "text": "When you construct models, it's too easy to construct things that oversimplify just because we, our human brains, enjoy the simplification of constructing a few variables that somehow represent organisms or represent people and running a simulation that then allows you to build up intuition and then it feels really good because you can get some really deep and surprising intuitions."}, {"time": 3771, "text": "But how do you know your models aren't, the assumptions underlying your models aren't some fundamentally flawed?"}, {"time": 3778, "text": "And because of that, your conclusions are fundamentally flawed."}, {"time": 3783, "text": "So I guess my question is what are the limits in your use of game theory, evolution game theory, your experience with it?"}, {"time": 3790, "text": "What are the limits of game theory?"}, {"time": 3792, "text": "So I've gotten some pushback from professional colleagues and friends who have tried to rerun simulations and try to, the idea that we don't see the truth is not comfortable and so many of my colleagues are very interested in trying to show that we're wrong."}, {"time": 3806, "text": "And so the idea would be to say that somehow we did something, as you're suggesting, maybe something special that wasn't completely general."}, {"time": 3813, "text": "We got some little special part of the whole search space in evolutionary game theory in which this happens to be true but more generally organisms would evolve to see the truth."}, {"time": 3822, "text": "So the best pushback we've gotten is from a team at Yale."}, {"time": 3828, "text": "And they suggested that if you use thousands of payoff functions, so we in our simulations, we just use a couple, one or two, because it was our first simulations, right?"}, {"time": 3840, "text": "So that would be a limit."}, {"time": 3841, "text": "We had one or two payoff functions, we showed the result of those, at least for the genetic algorithms."}, {"time": 3847, "text": "And they said, if you have 20,000 of them, then we can find these conditions in which truth seeing organisms would be the ones that evolved and survived."}, {"time": 3859, "text": "And so we looked at their simulations and it certainly is the case that you can find special cases in which truth can evolve."}, {"time": 3867, "text": "So when I say it's probability zero, it doesn't mean it can't happen."}, {"time": 3870, "text": "It can happen, in fact, it could happen infinitely often."}, {"time": 3872, "text": "It's just probability zero."}, {"time": 3874, "text": "So probability zero things can happen infinitely often."}, {"time": 3878, "text": "When you say probability is zero, you mean probability close to zero."}, {"time": 3882, "text": "To be very, very precise."}, {"time": 3883, "text": "So for example, if I have a unit square on the plane and I use a measure on a probability measure in which the area of a region is this probability."}, {"time": 3898, "text": "Then if I draw a curve in that unit square, it has measure precisely zero, precisely not approximately, precisely zero."}, {"time": 3907, "text": "And yet it has infinitely many points."}, {"time": 3910, "text": "So there's an object that for that probability measure has probability zero, and yet there's infinitely many points in it."}, {"time": 3916, "text": "So that's what I mean when I say that things that are probability zero can happen infinitely often in principle."}, {"time": 3921, "text": "Yeah, but infinity, as far as, and I look outside often, I walk around and I look at people."}, {"time": 3929, "text": "I have never seen infinity in real life."}, {"time": 3932, "text": "That's an interesting issue."}, {"time": 3935, "text": "I've been looking, I've been looking."}, {"time": 3937, "text": "I don't notice it, infinitely small or the infinitely big."}, {"time": 3941, "text": "And so the tools of mathematics, you could sort of apply the same kind of criticism that it is a very convenient interface into our reality."}, {"time": 3949, "text": "That's a big debate in mathematics, the intuitionists versus the ones who take, for example, the real numbers as real."}, {"time": 3955, "text": "And that's a fun discussion."}, {"time": 3957, "text": "Nicholas Giesen, a physicist, has really interesting work recently on how if you go with intuitionist mathematics, you could effectively quantize Newton, and you find that the Newtonian theory and quantum theory aren't that different once you go with it."}, {"time": 3977, "text": "It's really quite interesting."}, {"time": 3978, "text": "So the issue he raises is a very, very deep one, and one that I think we should take quite seriously, which is how should we think about the reality of the contours hierarchy?"}, {"time": 3990, "text": "Aleph one, aleph two, and all these different infinities versus just a more algorithmic approach, right?"}, {"time": 4001, "text": "So where everything's computable, in some sense, everything's finite, as big as you want, but nevertheless finite."}, {"time": 4010, "text": "So yeah, that ultimately boils down to whether the world is discrete or continuous in some general sense."}, {"time": 4019, "text": "And again, we can't really know, but there's just a mind breaking thought, just common sense reasoning, that something can happen, and as yet, probability of it happening is 0%."}, {"time": 4033, "text": "That doesn't compute for common sense computer."}, {"time": 4038, "text": "This is where you have to be a sharp mathematician to really, and I'm not."}, {"time": 4043, "text": "Sharp is one word."}, {"time": 4044, "text": "What I'm saying is common sense computer is, I mean that in a very kind of, in a positive sense, because we've been talking about perception systems and interfaces, if we are to reason about the world, we have to use the best interfaces we got."}, {"time": 4065, "text": "And I'm not exactly sure that game theory is the best interface we got for this."}, {"time": 4073, "text": "In application of mathematics, tricks and tools in mathematics, the game theory is the best we got when we are thinking about the nature of reality and fitness functions and evolution, period."}, {"time": 4087, "text": "Well, that's a fair rejoinder, and I think that that was the tool that we used."}, {"time": 4094, "text": "And if someone says, here's a better mathematical tool and here's why, this mathematical tool better captures the essence of Darwin's idea, John Maynard Smith didn't quite get it with evolutionary game theory."}, {"time": 4106, "text": "There's this thing."}, {"time": 4107, "text": "Now there are tools like evolutionary graph theory, which generalize evolutionary game theory, and then there's quantum game theory."}, {"time": 4115, "text": "So you can use quantum tools like entanglement, for example, as a resource in games that change the very nature of the solutions, the optimal solutions of the game theory."}, {"time": 4130, "text": "Well, the work from Yale is really interesting."}, {"time": 4134, "text": "It's a really interesting challenge of these ideas where, okay, if you have a very large number of fitness functions, or let's say you have a nearly infinite number of fitness functions or a growing number of fitness functions, what kind of interesting things start to emerging if you are to be an organism?"}, {"time": 4155, "text": "If to be an organism that adapts means having to deal with an ensemble of fitness functions."}, {"time": 4163, "text": "Right, and so we've actually redone some of our own work based on theirs, and this is the back and forth that we expect in science, right?"}, {"time": 4172, "text": "And what we found was that in their simulations, they were assuming that you couldn't carve the world up into objects, and so we said, well, let's relax that assumption."}, {"time": 4183, "text": "Allow organisms to create data structures that we might call objects, and an object would be you take, you would do hierarchical clustering of your fitness payoff functions, the ones that have similar shapes."}, {"time": 4194, "text": "If you have 20,000 of them, maybe these 50 are all very, very similar, so I can take all the perception, action, fitness stuff and make that into a data structure, and we'll call that a unit or an object."}, {"time": 4208, "text": "And as soon as we did that, then all of their results went away."}, {"time": 4211, "text": "It turned out they were the special case and that the organisms that were allowed to only see, that were shaped to see only fitness payoffs were the ones that were."}, {"time": 4222, "text": "So the idea is that objects then, what are objects from an evolutionary point of view?"}, {"time": 4227, "text": "This bottle, we thought that when I saw a bottle, it was because I was seeing a true object that existed whether or not it was perceived."}, {"time": 4234, "text": "Evolutionary theories suggest a different interpretation."}, {"time": 4237, "text": "I'm seeing a data structure that is encoding a convenient way of looking at various fitness payoffs."}, {"time": 4245, "text": "I can use this for drinking."}, {"time": 4248, "text": "I could use it as a weapon, not a very good one."}, {"time": 4250, "text": "I could be somewhere with head with it."}, {"time": 4252, "text": "If my goal is mating, this is pointless."}, {"time": 4256, "text": "So I'm seeing for, what I'm coding here is all sorts of actions and the payoffs that I could get."}, {"time": 4264, "text": "When I pick up an apple, now I'm getting a different set of actions and payoffs."}, {"time": 4268, "text": "When I pick up a rock, I'm getting, so for every object, what I'm getting is a different set of payoff functions and with various actions."}, {"time": 4278, "text": "And so once you allow that, then what you find is once again that truth goes extinct and the organisms that just get an interface are the ones that win."}, {"time": 4289, "text": "But the question, just sneaking up on, this is fascinating."}, {"time": 4294, "text": "From where do fitness functions originate?"}, {"time": 4298, "text": "What gives birth to the fitness functions?"}, {"time": 4300, "text": "So if there's a giant black box that just keeps giving you fitness functions, what are we trying to optimize?"}, {"time": 4306, "text": "You said that water has different uses than an apple."}, {"time": 4315, "text": "So there's these objects."}, {"time": 4317, "text": "What are we trying to optimize?"}, {"time": 4318, "text": "And why is not reality a really good generator of fitness functions?"}, {"time": 4325, "text": "So each theory makes its own assumptions and says, grant me this, then I'll explain that."}, {"time": 4329, "text": "So evolutionary game theory says, grant me fitness payoffs, right?"}, {"time": 4333, "text": "And grant me strategies with payoffs."}, {"time": 4336, "text": "And I can write down the matrix for this strategy interacts with that strategy."}, {"time": 4340, "text": "These are the payoffs that come up."}, {"time": 4341, "text": "If you grant me that, then I can start to explain a lot of things."}, {"time": 4344, "text": "Now you can ask for a deeper question like, okay, how does physics evolve biology and where do these fitness payoffs come from, right?"}, {"time": 4356, "text": "Now that's a completely different enterprise."}, {"time": 4361, "text": "And of course, evolutionary game theory then would be not the right tool for that."}, {"time": 4365, "text": "It would have to be a deeper tool that shows where evolutionary game theory comes from."}, {"time": 4370, "text": "My own take is that there's gonna be a problem in doing that because space time isn't fundamental."}, {"time": 4381, "text": "It's just a user interface."}, {"time": 4383, "text": "And that the distinction that we make between living and nonliving is not a fundamental distinction."}, {"time": 4390, "text": "It's an artifact of the limits of our interface, right?"}, {"time": 4395, "text": "So this is a new wrinkle and this is an important wrinkle."}, {"time": 4399, "text": "It's so nice to take space and time as fundamental because if something looks like it's inanimate, it's inanimate and we can just say it's not living."}, {"time": 4407, "text": "Now it's much more complicated."}, {"time": 4410, "text": "Certain things are obviously living."}, {"time": 4412, "text": "I'm talking with you, I'm obviously interacting with something that's alive and conscious."}, {"time": 4418, "text": "I think we've let go of the word obviously in this conversation."}, {"time": 4422, "text": "I think nothing is obvious."}, {"time": 4423, "text": "Nothing's obvious, that's right."}, {"time": 4425, "text": "But when we get down to like an ant, it's obviously living, but I'll say it appears to be living."}, {"time": 4432, "text": "But when we get down to a virus, now people wonder and when we get down to protons, people say it's not living."}, {"time": 4438, "text": "And my attitude is look, I have a user interface."}, {"time": 4442, "text": "Interface is there to hide certain aspects of reality and others to, it's an uneven representation, put it that way."}, {"time": 4451, "text": "Certain things just get completely hidden."}, {"time": 4454, "text": "Dark matter and dark energy are most of the energy and matter that's out there."}, {"time": 4459, "text": "Our interface just plain flat out hides them."}, {"time": 4463, "text": "The only way we get some hint is because gravitational things are going wrong within our, so most things are outside of our interface."}, {"time": 4471, "text": "The distinction between living and nonliving is not fundamental."}, {"time": 4475, "text": "It's an artifact of our interface."}, {"time": 4539, "text": "I like this idea that the line between living and nonliving is very important because that's the thing that would emerge before you have evolution, the idea of death."}, {"time": 4555, "text": "So that seems to be an important component of natural selection, and if that emerged, because that's also asking the question, I guess, that I ask, where do fitness functions come from?"}, {"time": 4569, "text": "That's like asking the old meaning of life question, right?"}, {"time": 4572, "text": "It's the why, why, why?"}, {"time": 4577, "text": "And one of the big underlying whys, okay, you can start with evolution on Earth, but without living, without life and death, without the line between the living and the dead, you don't have evolution."}, {"time": 4590, "text": "So what if underneath it, there's no such thing as the living and the dead?"}, {"time": 4595, "text": "There's no, like this concept of an organism, period."}, {"time": 4599, "text": "There's a living organism that's defined by a volume in space time that somehow interacts, that over time maintains its integrity somehow."}, {"time": 4612, "text": "It has some kind of history, it has a wall of some kind."}, {"time": 4616, "text": "The outside world, the environment, and then inside, there's an organism."}, {"time": 4620, "text": "So you're defining an organism, and also you define that organism by the fact that it can move, and it can become alive, which you kind of think of as moving, combined with the fact that it's keeping itself separate from the environment, so you can point out that thing is living, and then it can also die."}, {"time": 4641, "text": "That seems to be all very powerful components of space time that enable you to have something like natural selection and evolution."}, {"time": 4651, "text": "Well, and there's a lot of interesting work, some of it by collaborators of Carl Friston and others, where they have Bayes net kind of stuff that they build on the notion of a Markov blanket."}, {"time": 4663, "text": "So you have some states within this network that are inside the blanket, then you have the blanket, and then the states outside the blanket."}, {"time": 4670, "text": "And the states inside this Markov blanket are conditionally independent of the states outside the blanket conditioned on the blanket."}, {"time": 4677, "text": "And what they're looking at is that the dynamics inside of the states inside the Markov blanket seem to be trying to estimate properties of the outside and react to them in a way."}, {"time": 4688, "text": "So it seems like you're doing probabilistic inferences in ways that might be able to keep you alive."}, {"time": 4694, "text": "So there's interesting work going on in that direction."}, {"time": 4697, "text": "But what I'm saying is something slightly different, and that is, like, when I look at you, all I see is skin, hair, and eyes, right?"}, {"time": 4706, "text": "That's all I see."}, {"time": 4707, "text": "But I know that there's a deeper reality."}, {"time": 4711, "text": "I believe that there's a much deeper reality."}, {"time": 4712, "text": "There's the whole world of your experiences, your thoughts, your hopes, your dreams."}, {"time": 4715, "text": "In some sense, the face that I see is just a symbol that I create, right?"}, {"time": 4722, "text": "And as soon as I look away, I delete that symbol."}, {"time": 4724, "text": "But I don't delete you."}, {"time": 4726, "text": "I don't delete the conscious experience, the whole world of your..."}, {"time": 4730, "text": "So I'm only deleting an interface symbol."}, {"time": 4733, "text": "But that interface symbol is a portal, so to speak."}, {"time": 4740, "text": "Not a perfect portal, but a genuine portal into your beliefs, into your conscious experiences."}, {"time": 4747, "text": "That's why we can have a conversation."}, {"time": 4749, "text": "Your consciousness is genuinely affecting mine, and mine is genuinely affecting yours, through these icons, which I create on the fly."}, {"time": 4757, "text": "I mean, I create your face."}, {"time": 4758, "text": "When I look, I delete it."}, {"time": 4760, "text": "I don't create you, your consciousness."}, {"time": 4762, "text": "That's there all the time, but I do..."}, {"time": 4764, "text": "So now, when I look at a cat, I'm creating something that I still call living, and I still think is conscious."}, {"time": 4771, "text": "When I look at an ant, I create something that I still would call living, but maybe not conscious."}, {"time": 4778, "text": "When I look at something I call a virus, now I'm not even sure I would call it living."}, {"time": 4782, "text": "And when I look at a proton, I would say, I don't even think it's not alive at all."}, {"time": 4788, "text": "It could be that I'm nevertheless interacting with something that's just as conscious as you."}, {"time": 4795, "text": "I'm not saying the proton is conscious."}, {"time": 4797, "text": "The face that I'm creating when I look at you, that face is not conscious."}, {"time": 4800, "text": "That face is a data structure in me."}, {"time": 4803, "text": "That face is an experience."}, {"time": 4806, "text": "It's not an experiencer."}, {"time": 4808, "text": "Similarly, a proton is something that I create when I look or do a collision in the Large Hadron Collider or something like that."}, {"time": 4818, "text": "But what is behind the entity in space time?"}, {"time": 4821, "text": "So I've got this space time interface, and I've just got this entity that I call a proton."}, {"time": 4825, "text": "What is the reality behind it?"}, {"time": 4827, "text": "Well, the physicists are finding these big, big structures."}, {"time": 4830, "text": "The amplitude hadron, the sociahedron, cause what's behind those?"}, {"time": 4836, "text": "Could be consciousness, what I'm playing with."}, {"time": 4838, "text": "In which case, when I'm interacting with a proton, I could be interacting with consciousness."}, {"time": 4843, "text": "Again, to be very, very clear, because it's easy to misunderstand, I'm not saying a proton is conscious."}, {"time": 4849, "text": "Just like I'm not saying your face is conscious."}, {"time": 4851, "text": "Your face is a symbol I create and then delete as I look."}, {"time": 4856, "text": "So your face is not conscious, but I know that that face in my interface, the Lex Friedman face that I create, is an interface symbol that's a genuine portal into your consciousness."}, {"time": 4866, "text": "The portal is less clear for a cat, even less clear for an ant."}, {"time": 4871, "text": "And by the time we get down to a proton, the portal is not clear at all."}, {"time": 4875, "text": "But that doesn't mean I'm not interacting with consciousness, it just means my interface gave up."}, {"time": 4880, "text": "And there's some deeper reality that we have to go after."}, {"time": 4883, "text": "So your question really forces out a big part of this whole approach that I'm talking about."}, {"time": 4889, "text": "So it's this portal and consciousness."}, {"time": 4890, "text": "I wonder why you can't, your portal is not as good to a cat, to a cat's consciousness than it is to a human."}, {"time": 4900, "text": "Does it have to do with the fact that you're human and just similar organisms, organisms of similar complexity are able to create portals better to each other?"}, {"time": 4913, "text": "Or is it just as you get more and more complex, you get better and better portals?"}, {"time": 4917, "text": "Well, let me answer one aspect of it that I'm more confident about, then I'll speculate on that."}, {"time": 4923, "text": "Why is it that the portal is so bad with protons?"}, {"time": 4927, "text": "Well, and elementary particles more generally."}, {"time": 4929, "text": "So quarks, leptons and gluons and so forth."}, {"time": 4932, "text": "Well, the reason for that is because those are just symmetries of space time."}, {"time": 4939, "text": "More technically, they're irreducible representations of the Poincare group of space time."}, {"time": 4942, "text": "So they're just literally representations of the data structure of space time that we're using."}, {"time": 4950, "text": "So that's why they're not very much insightful."}, {"time": 4953, "text": "They're just almost entirely tied to the data structure itself."}, {"time": 4957, "text": "There's not much, they're telling you only something about the data structure, not behind the data structure."}, {"time": 4962, "text": "It's only when we get to higher levels that we're starting to, in some sense, build portals to what's behind space time."}, {"time": 4970, "text": "Yeah, so there's more and more complexity built on top of the interface of space time with the cat."}, {"time": 4979, "text": "So you can actually build a portal, right?"}, {"time": 4986, "text": "Yeah, this interface of face and hair and so on, skin."}, {"time": 4994, "text": "There's some syncing going on between humans though, where we synced, like you're getting a pretty good representation of the ideas in my head and starting to get a foggy view of my memories in my head."}, {"time": 5010, "text": "Even though this is the first time we're talking, you start to project your own memories."}, {"time": 5016, "text": "You start to solve like a giant hierarchy of puzzles about a human, because we're all, there's a lot of similarities, a lot of it rhymes."}, {"time": 5026, "text": "So you start to make a lot of inferences and you build up this model of a person."}, {"time": 5030, "text": "You have a pretty sophisticated model what's going on underneath."}, {"time": 5035, "text": "Again, I just, I wonder if it's possible to construct these models about each other and nevertheless be very distant from an underlying reality."}, {"time": 5046, "text": "There's a lot of work on this."}, {"time": 5048, "text": "So there's some interesting work called signaling games where they look at how people can coordinate and come to communicate."}, {"time": 5057, "text": "There's some interesting work that was done by some colleagues and friends of mine, Louis Narens, Natalia Komarova, and Kimberly Jamieson, where they were looking at evolving color words."}, {"time": 5072, "text": "So you have a circle of colors, the color circle, and they wanted to see if they could get people to cooperate and how they carved the color circle up into a circle."}, {"time": 5083, "text": "Two units of words."}, {"time": 5085, "text": "And so they had a game theoretic kind of thing that they'd had people do."}, {"time": 5090, "text": "And what they found was that when they included, so most people are trichromats, you have three kinds of cone photoreceptors, but there are some, a lot of men, 7% of men are dichromats."}, {"time": 5101, "text": "They might be missing the red cone photoreceptor."}, {"time": 5104, "text": "They found that the dichromats had an outsized influence on the final ways that the whole space of colors was carved up and labels attached."}, {"time": 5114, "text": "You needed to be able to include the dichromats in the conversation."}, {"time": 5118, "text": "And so they had a bigger influence on how you made the boundaries of the language."}, {"time": 5123, "text": "And I thought that was a really interesting kind of insight that there's going to be, again, a game, perhaps a game where evolutionary or genetic algorithm kind of thing that goes on in terms of learning to communicate in ways that are useful."}, {"time": 5137, "text": "And so, yeah, you can use game theory to actually explore that are signaling games."}, {"time": 5142, "text": "There's a lot of brilliant work on that."}, {"time": 5144, "text": "I'm not doing it, but there's work out there."}, {"time": 5147, "text": "So if it's okay, let us tackle once more and perhaps several more times after the big topic of consciousness."}, {"time": 5155, "text": "Okay, this very beautiful, powerful things that perhaps is the thing that makes us human, what is it?"}, {"time": 5163, "text": "What's the role of consciousness in, let's say even just the thing we've been talking about, which is the formation of this interface, any kind of ways you want to kind of start talking about it."}, {"time": 5178, "text": "Well, let me say first what most of my colleagues say."}, {"time": 5182, "text": "99% are, again, assuming that space time is fundamental, particles and space time, matter is fundamental, and most are reductionist."}, {"time": 5193, "text": "And so the standard approach to consciousness is to figure out what complicated systems of matter with the right functional properties could possibly lead to the emergence of consciousness."}, {"time": 5208, "text": "That's the general idea, right?"}, {"time": 5211, "text": "So maybe you have to have neurons, maybe only if you have neurons, but that might not be enough."}, {"time": 5218, "text": "They have to certain kinds of complexity in their organization and their dynamics, certain kind of network abilities, for example."}, {"time": 5225, "text": "So there are those who say, for example, that consciousness arises from orchestrated collapse of quantum states of microtubules and neurons, certainly."}, {"time": 5238, "text": "So this is Hamroff and Penrose, that's kind of."}, {"time": 5242, "text": "So you start with something physical, a property of quantum states of neurons, of microtubules and neurons, and you say that somehow an orchestrated collapse of those is consciousness or conscious experiences."}, {"time": 5258, "text": "Or integrated information theory."}, {"time": 5260, "text": "Again, you start with something physical, and if it has the right kind of functional properties, it's something they call phi, with the right kind of integrated information, then you have consciousness."}, {"time": 5270, "text": "Or you can be a panpsychist, Philip Goff, for example, where you might say, well, in addition to the particles and space and time, those particles are not just matter, they also could have, say, a unit of consciousness."}, {"time": 5286, "text": "And so, but once again, you're taking space and time and particles as fundamental, and you're adding a new property to them, say, consciousness, and then you have to talk about how when a proton and an electron get together to form hydrogen, then how those consciousnesses merge to or interact to create the consciousness of hydrogen and so forth."}, {"time": 5310, "text": "There's attention schema theory, which again, this is how neural network processes representing to the network itself, its attentional processes, that could be consciousness."}, {"time": 5322, "text": "There's global workspace theory, and neuronal global workspace theory."}, {"time": 5328, "text": "So there's many, many theories of this type."}, {"time": 5330, "text": "What's common to all of them is they assume that space time is fundamental."}, {"time": 5336, "text": "They assume that physical processes and space time is fundamental."}, {"time": 5339, "text": "Panpsychism adds consciousness as an additional thing, it's almost dualist in that regard."}, {"time": 5345, "text": "And my attitude is our best science is telling us that space time is not fundamental."}, {"time": 5353, "text": "So why is that important here?"}, {"time": 5357, "text": "Well, for centuries, deep thinkers thought of earth, air, fire, and water as the fundamental elements."}, {"time": 5366, "text": "It was a reductionist kind of idea."}, {"time": 5368, "text": "Nothing was more elemental than those, and you could sort of build everything up from those."}, {"time": 5373, "text": "When we got the periodic table of elements, we realized that, of course, we want to study earth, air, fire, and water."}, {"time": 5382, "text": "There's combustion science for fire."}, {"time": 5384, "text": "There's sciences for all these other things, water and so forth."}, {"time": 5390, "text": "So we're gonna do science with these things, but fundamental, no, no."}, {"time": 5394, "text": "If you're looking for something fundamental, those are the wrong building blocks."}, {"time": 5398, "text": "Earth has many, many different kinds of elements that project into the one thing that we call earth."}, {"time": 5404, "text": "If you don't understand that there's silicon, that there's iron, that there's all these different kinds of things that project into what we call earth, you're hopelessly lost."}, {"time": 5414, "text": "You're not fundamental, you're not gonna get there."}, {"time": 5417, "text": "And then after the periodic table, then we came up with quarks, leptons, and gluons, the particles of the standard model of physics."}, {"time": 5426, "text": "And so we actually now know that if you really want to get fundamental, the periodic table isn't it."}, {"time": 5434, "text": "It's good for chemistry, and it's just wonderful for chemistry, but if you're trying to go deep fundamental, what is the fundamental science?"}, {"time": 5442, "text": "You're gonna have to go to quarks, leptons, and gluons and so forth."}, {"time": 5446, "text": "Well, now we've discovered space time itself is doomed."}, {"time": 5451, "text": "Quarks, leptons, and gluons are just irreducible representations of the symmetries of space time."}, {"time": 5457, "text": "So the whole framework on which consciousness research is being based right now is doomed."}, {"time": 5465, "text": "And for me, these are my friends and colleagues that are doing this, they're brilliant."}, {"time": 5471, "text": "They're absolutely, they're brilliant."}, {"time": 5473, "text": "I, my feeling is I'm so sad that they're stuck with this old framework because if they weren't stuck with earth, air, fire, and water, you could actually make progress."}, {"time": 5487, "text": "So it doesn't matter how smart you are."}, {"time": 5488, "text": "If you start with earth, air, fire, and water, you're not gonna get anywhere, right?"}, {"time": 5492, "text": "Can I actually just, because the word doomed is so interesting, let me give you some options, multiple choice quiz."}, {"time": 5500, "text": "Is space time, we could say is reality the way we perceive it doomed, wrong or fake?"}, {"time": 5514, "text": "Because doomed just means it could still be right and we're now ready to go deeper."}, {"time": 5522, "text": "It would be that."}, {"time": 5523, "text": "So it's not wrong, it's not a complete deviation from a journey toward the truth."}, {"time": 5530, "text": "Right, it's like earth, air, fire, and water is not wrong."}, {"time": 5533, "text": "There is earth, air, fire, and water."}, {"time": 5535, "text": "That's a useful framework, but it's not fundamental."}, {"time": 5539, "text": "Right, well, there's also wrong, which is they used to believe, as I recently learned, that George Washington was the president, the first president of the United States, was bled to death for something that could have been easily treated because it was believed that you can get, actually, I need to look into this further, but I guess you get toxins out or demons out."}, {"time": 5560, "text": "I don't know what you're getting out with the bleeding of a person."}, {"time": 5563, "text": "So that ended up being wrong, but widely believed as a medical tool."}, {"time": 5570, "text": "So it's also possible that our assumption of space time is not just doomed, but is wrong."}, {"time": 5578, "text": "Well, if we believe that it's fundamental, that's wrong."}, {"time": 5582, "text": "But if we believe it's a useful tool, that's right."}, {"time": 5585, "text": "But bleeding somebody to death was believed to be a useful tool."}, {"time": 5590, "text": "And that was wrong."}, {"time": 5591, "text": "It wasn't just not fundamental."}, {"time": 5593, "text": "It was very, I'm sure there's cases in which bleeding somebody would work, but it would be a very tiny, tiny, tiny percentage of cases."}, {"time": 5603, "text": "So it could be that it's wrong, like it's a side road that's ultimately leading to a dead end as opposed to a truck stop or something that you can get off of."}, {"time": 5614, "text": "My feeling is not the dead end kind of thing."}, {"time": 5617, "text": "I think that what the physicists are finding is that there are these structures beyond space time, but they project back into space time."}, {"time": 5624, "text": "And so space time, when they say space time is doomed, they're explicit."}, {"time": 5629, "text": "They're saying it's doomed in the sense that we thought it was fundamental."}, {"time": 5631, "text": "It's not fundamental."}, {"time": 5633, "text": "It's a useful, absolutely useful and brilliant data structure, but there are deeper data structures like cosmological polytope and space time is not fundamental."}, {"time": 5643, "text": "What is doomed in the sense that it's wrong is reductionism."}, {"time": 5650, "text": "Which is saying space time is fundamental, essentially."}, {"time": 5654, "text": "The idea that somehow being smaller in space and time or space time is a fundamental nature of reality, that's just wrong."}, {"time": 5666, "text": "It turned out to be a useful heuristic for thermodynamics and so forth."}, {"time": 5669, "text": "And in several other places, reductionism has been very useful, but that's in some sense an artifact of how we use our interface."}, {"time": 5679, "text": "Yeah, so you're saying size doesn't matter."}, {"time": 5681, "text": "Okay, this is very important for me to write down."}, {"time": 5684, "text": "Ultimately."}, {"time": 5684, "text": "Ultimately, right."}, {"time": 5686, "text": "It's useful for theories like thermodynamics and also for understanding brain networks in terms of individual neurons and neurons in terms of chemical systems inside cells."}, {"time": 5698, "text": "That's all very, very useful, but the idea that we're getting to the more fundamental nature of reality, no."}, {"time": 5705, "text": "When you get all the way down in that direction, you get down to the quarks and gluons, what you realize is what you've gotten down to is not fundamental reality, just the irreducible representations of a data structure."}, {"time": 5716, "text": "That's all you've gotten down to."}, {"time": 5717, "text": "So you're always stuck inside the data structure."}, {"time": 5721, "text": "So you seem to be getting closer and closer."}, {"time": 5723, "text": "I went from neural networks to neurons, neurons to chemistry, chemistry to particles, particles to quarks and gluons."}, {"time": 5729, "text": "I'm getting closer and closer to the real."}, {"time": 5731, "text": "No, I'm getting closer and closer to the actual structure of the data structure of space and time, the irreducible representations."}, {"time": 5738, "text": "That's what you're getting closer to, not to a deeper understanding of what's beyond space time."}, {"time": 5743, "text": "We'll also refer, we'll return again to this question of dynamics because you keep saying that space time is doomed, but mostly focusing on the space part of that."}, {"time": 5754, "text": "It's very interesting to see why time gets the bad cred too because how do you have dynamics without time is the thing I'd love to talk to you a little bit about."}, {"time": 5762, "text": "But let us return your brilliant whirlwind overview of the different theories of consciousness that are out there."}, {"time": 5774, "text": "What is consciousness if outside of space time?"}, {"time": 5778, "text": "If we think that we want to have a model of consciousness, we as scientists then have to say, what do we want to write down?"}, {"time": 5785, "text": "What kind of mathematical modeling are we gonna write down, right?"}, {"time": 5788, "text": "And if you think about it, there's lots of things that you might want to write down about consciousness."}, {"time": 5792, "text": "For all the complicated subject."}, {"time": 5795, "text": "So most of my colleagues are saying, let's start with matter or neurons and see what properties of matter could create consciousness."}, {"time": 5802, "text": "But I'm saying that that whole thing is out."}, {"time": 5805, "text": "Space time is doomed, that whole thing is out."}, {"time": 5807, "text": "We need to look at consciousness qua consciousness."}, {"time": 5811, "text": "In other words, not as something that arises in space and time, but perhaps as something that creates space and time as a data structure."}, {"time": 5818, "text": "So what do we want?"}, {"time": 5819, "text": "And here again, there's no hard and fast rule, but what you as a scientist have to do is to pick what you think are the minimal assumptions that are gonna allow you to boot up a comprehensive theory."}, {"time": 5833, "text": "That is the trick."}, {"time": 5836, "text": "So what do I want?"}, {"time": 5837, "text": "So what I chose to do was to have three things."}, {"time": 5843, "text": "I said that there are conscious experiences."}, {"time": 5846, "text": "Feeling of headache, the smell of garlic, experiencing the color red."}, {"time": 5852, "text": "There are, those are conscious, so that's the primitive of the theory."}, {"time": 5854, "text": "And the reason I want few primitives, why?"}, {"time": 5856, "text": "Because those are the miracles of the theory, right?"}, {"time": 5858, "text": "The primitives, the assumptions of the theory are the things you're not going to explain."}, {"time": 5862, "text": "Those are the things you assume."}, {"time": 5863, "text": "And those experiences, you particularly mean there's a subjectiveness to them."}, {"time": 5869, "text": "That's the thing when people refer to the hard problem of consciousness, is it feels like something to look at the color red, okay."}, {"time": 5878, "text": "Exactly right, it feels like something to have a headache or to feel upset to your stomach."}, {"time": 5882, "text": "It feels like something."}, {"time": 5884, "text": "And so I'm going to grant that in this theory, there are experiences and they're fundamental in some sense."}, {"time": 5892, "text": "So conscious experience."}, {"time": 5893, "text": "So they're not derived from physics."}, {"time": 5895, "text": "They're not functional properties of particles."}, {"time": 5898, "text": "They are sui generis, they exist."}, {"time": 5901, "text": "Just like we assume space time exists."}, {"time": 5903, "text": "I'm now saying space time is just a data structure."}, {"time": 5906, "text": "It doesn't exist independent of conscious experiences."}, {"time": 5909, "text": "Sorry to interrupt once again, but should we be focusing in your thinking on humans alone?"}, {"time": 5915, "text": "Or is there something about in relation to other kinds of organisms that have a sufficiently high level of complexity?"}, {"time": 5924, "text": "Or even, or is there some kind of generalization of the panpsychist idea that all consciousness permeates, all matter?"}, {"time": 5935, "text": "Outside of the usual definition of what matter is inside space time."}, {"time": 5941, "text": "So it's beyond human consciousness."}, {"time": 5944, "text": "Human consciousness, from my point of view, would be one of a countless variety of consciousnesses."}, {"time": 5950, "text": "And even within human consciousness, there's countless variety of consciousnesses within us."}, {"time": 5955, "text": "I mean, you have your left and right hemisphere."}, {"time": 5958, "text": "And apparently if you split the corpus callosum, the personality of the left hemisphere and the religious beliefs of the left hemisphere can be very different from the right hemisphere."}, {"time": 5966, "text": "And their conscious experiences can be disjoint."}, {"time": 5970, "text": "One could have one conscious experience."}, {"time": 5972, "text": "They can play 20 questions."}, {"time": 5973, "text": "The left hemisphere can have an idea in its mind and the right hemisphere has to guess."}, {"time": 5977, "text": "And it might not get it."}, {"time": 5978, "text": "So even within you, there is more than just one consciousness."}, {"time": 5983, "text": "It's lots of consciousnesses."}, {"time": 5985, "text": "So the general theory of consciousness that I'm after is not just human consciousness."}, {"time": 5990, "text": "It's going to be just consciousness."}, {"time": 5991, "text": "And I presume human consciousness is a tiny drop in the bucket of the infinite variety of consciousnesses."}, {"time": 5999, "text": "That said, I should clarify that the black hole of consciousness is the home cat."}, {"time": 6007, "text": "I'm pretty sure cats lack, is the embodiment of evil and lack all capacity for consciousness or compassion."}, {"time": 6016, "text": "So I just want to lay that on the table."}, {"time": 6017, "text": "That's the theory I'm working on."}, {"time": 6017, "text": "I don't have any good evidence, but it's just an intuition."}, {"time": 6020, "text": "It's just a shout out."}, {"time": 6023, "text": "Sorry to distract."}, {"time": 6024, "text": "So that's the first assumption."}, {"time": 6025, "text": "The first assumption, that's right."}, {"time": 6027, "text": "The second assumption is that these experiences have consequences."}, {"time": 6031, "text": "So I'm going to say that conscious experiences can trigger other conscious experiences somehow."}, {"time": 6038, "text": "So really in some sense, there's two basic assumptions."}, {"time": 6043, "text": "There's some kind of causality."}, {"time": 6046, "text": "Is there a chain of causality?"}, {"time": 6047, "text": "Does this relate to dynamics?"}, {"time": 6050, "text": "I'll say there's a probabilistic relationship."}, {"time": 6055, "text": "So I'm trying to be as nonspecific to begin with and see where it leads me."}, {"time": 6061, "text": "So what I can write down are probability spaces."}, {"time": 6064, "text": "So a probability space, which contains the conscious experiences that this consciousness can have."}, {"time": 6069, "text": "So I call this a conscious agent, this technical thing."}, {"time": 6076, "text": "Annika Harris and I've talked about this and she rightly cautions me that people will think that I'm bringing in a notion of a self or agency and so forth when I say conscious agent."}, {"time": 6087, "text": "So I just want to say that I use the term conscious agent merely as a technical term."}, {"time": 6092, "text": "There is no notion of self in my fundamental definition of a conscious agent."}, {"time": 6096, "text": "There are only experiences and probabilistic relationships of how they trigger other experiences."}, {"time": 6103, "text": "So the agent is the generator of the conscious experience?"}, {"time": 6106, "text": "The agent is a mathematical structure that includes a probability measure, the probability space of a possible conscious experiences and a Markovian kernel, which describes how if this agent has certain conscious experiences, how that will affect the experiences of other conscious agents, including itself."}, {"time": 6127, "text": "But you don't think of that as a self?"}, {"time": 6129, "text": "No, there is no notion of a self here."}, {"time": 6133, "text": "There's no notion of really of an agent."}, {"time": 6137, "text": "But is there a locality?"}, {"time": 6140, "text": "Is there an organism?"}, {"time": 6141, "text": "There's no space."}, {"time": 6142, "text": "There's no."}, {"time": 6142, "text": "So this is, these are conscious units, conscious entities."}, {"time": 6148, "text": "But they're distinct in some way because they have to interact."}, {"time": 6152, "text": "Well, so here's the interesting thing."}, {"time": 6153, "text": "When we write down the mathematics, when you have two of these conscious agents interacting, the pair satisfy a definition of a conscious agent."}, {"time": 6163, "text": "So they are a single conscious agent."}, {"time": 6166, "text": "So there is one conscious agent."}, {"time": 6168, "text": "But it has a nice analytic decomposition into as many conscious agents as you wish."}, {"time": 6173, "text": "So that's a nice interface."}, {"time": 6175, "text": "It's a very useful scientific interface."}, {"time": 6178, "text": "It's a scale free or if you like a fractal like approach to it in which we can use the same unit of analysis at all scales in studying consciousness."}, {"time": 6189, "text": "But if I want to talk about, so there's no notion of learning, memory, problem solving, intelligence, self, agency."}, {"time": 6200, "text": "So none of that is fundamental."}, {"time": 6204, "text": "So, and the reason I did that was because I want to assume as little as possible."}, {"time": 6209, "text": "Everything I assume is a miracle in the theory."}, {"time": 6212, "text": "It's not something you explain, it's something you assume."}, {"time": 6214, "text": "So I have to build networks of conscious agents."}, {"time": 6218, "text": "If I want to have a notion of a self, I have to build a self."}, {"time": 6221, "text": "I have to build learning, memory, problem solving, intelligence and planning, all these different things."}, {"time": 6226, "text": "I have to build networks of conscious agents to do that."}, {"time": 6229, "text": "It's a trivial theorem that networks of conscious agents are computationally universal, that's trivial."}, {"time": 6234, "text": "So anything that we can do with neural networks or automata, you can do with networks of conscious agents."}, {"time": 6240, "text": "That's trivial."}, {"time": 6241, "text": "But you can also do more."}, {"time": 6244, "text": "The events in the probability space need not be computable."}, {"time": 6248, "text": "So the Markovian dynamics is not restricted to computable functions because the very events themselves need not be computable."}, {"time": 6257, "text": "So this can capture any computable theory."}, {"time": 6260, "text": "Anything we can do with neural networks, we can do with conscious agent networks."}, {"time": 6264, "text": "But it leaves open the door for the possibility of noncomputable interactions between conscious agents."}, {"time": 6271, "text": "So if we want a theory of memory, we have to build it."}, {"time": 6277, "text": "And there's lots of different ways you could build."}, {"time": 6279, "text": "We've actually got a paper, Chris Fields took the lead on this."}, {"time": 6281, "text": "And we have a paper called Conscious Agent Networks where Chris takes the lead and shows how to use these networks of conscious agents to build memory and to build primitive kinds of learning."}, {"time": 6293, "text": "But can you provide some intuition of what conscious networks, networks of conscious agents helps you?"}, {"time": 6304, "text": "First of all, what that looks like."}, {"time": 6307, "text": "And I don't just mean mathematically."}, {"time": 6308, "text": "Of course, maybe that might help build up intuition."}, {"time": 6311, "text": "But how that helps us potentially solve the hard problem of consciousness."}, {"time": 6317, "text": "Or is that baked in, that that exists?"}, {"time": 6321, "text": "Can you solve the hard problem of consciousness, why it tastes delicious when you eat a delicious ice cream with networks of conscious agents?"}, {"time": 6333, "text": "Or is that taken as an assumption?"}, {"time": 6336, "text": "So the standard way the hard problem is thought of is we're assuming space and time and particles or neurons, for example."}, {"time": 6347, "text": "These are just physical things that have no consciousness."}, {"time": 6350, "text": "And we have to explain how the conscious experience of the taste of chocolate could emerge from those."}, {"time": 6354, "text": "So the typical hard problem of consciousness is that problem, right?"}, {"time": 6358, "text": "How do you boot up the taste of chocolate, the experience of the taste of chocolate from neurons, say, or the right kind of artificial intelligence circuitry?"}, {"time": 6370, "text": "How do you boot that up?"}, {"time": 6371, "text": "That's typically what the hard problem of consciousness means to researchers."}, {"time": 6375, "text": "Notice that I'm changing the problem."}, {"time": 6378, "text": "I'm not trying to boot up conscious experiences from the dynamics of neurons or silicon or something like that."}, {"time": 6385, "text": "I'm saying that that's the wrong problem."}, {"time": 6387, "text": "My hard problem would go in the other direction."}, {"time": 6389, "text": "If I start with conscious experiences, how do I build up space and time?"}, {"time": 6395, "text": "How do I build up what I call the physical world?"}, {"time": 6397, "text": "How do I build up what we call brains?"}, {"time": 6400, "text": "Because I'm saying consciousness is not something that brains do."}, {"time": 6405, "text": "Brains are something that consciousness makes up."}, {"time": 6409, "text": "It's among the experience, it's an ephemeral experience in consciousness."}, {"time": 6414, "text": "I look inside, so to be very, very clear, right now, I have no neurons."}, {"time": 6419, "text": "If you looked, you would see neurons."}, {"time": 6423, "text": "That's a data structure that you would create on the fly, and it's a very useful one."}, {"time": 6426, "text": "As soon as you look away, you garbage collect that data structure, just like that Necker cube that I was talking about on the piece of paper."}, {"time": 6432, "text": "When you look, you see a 3D cube you created on the fly."}, {"time": 6437, "text": "As soon as you look away, that's gone."}, {"time": 6439, "text": "When you say you, you mean a human being scientist."}, {"time": 6442, "text": "Right now, that's right."}, {"time": 6444, "text": "More generally, it'll be conscious agents, because as you pointed out, am I asking for a theory of consciousness only about humans?"}, {"time": 6451, "text": "No, it's consciousness, which human consciousness is just a tiny sliver."}, {"time": 6458, "text": "But you are saying that there is, that's a useful data structure."}, {"time": 6461, "text": "How many other data structures are there?"}, {"time": 6463, "text": "That's why I said you human."}, {"time": 6465, "text": "If there's another Earth, if there's another alien civilization and doing these kinds of investigations, would they come up with similar data structures?"}, {"time": 6475, "text": "What is the space of data structures, I guess is what I'm asking."}, {"time": 6480, "text": "My guess is that if consciousness is fundamental, consciousness is all there is, then the only thing that mathematical structure can be about is possibilities of consciousness."}, {"time": 6495, "text": "And that suggests to me that there could be an infinite variety of consciousnesses, and a vanishingly small fraction of them use space time data structures and the kinds of structures that we use."}, {"time": 6509, "text": "There's an infinite variety of data structures."}, {"time": 6512, "text": "Now, this is very similar to something that Max Tegmark has said, but I want to distinguish it."}, {"time": 6516, "text": "He has this level four multiverse idea."}, {"time": 6520, "text": "He thinks that mathematics is fundamental."}, {"time": 6523, "text": "And so that's the fundamental reality."}, {"time": 6525, "text": "And since there's an infinite variety of, endless variety of mathematical structures, there's an infinite variety of multiverses in his view."}, {"time": 6532, "text": "I'm saying something similar in spirit, but importantly different."}, {"time": 6536, "text": "There's an infinite variety of mathematical structures, absolutely."}, {"time": 6540, "text": "But mathematics isn't the fundamental reality in this framework."}, {"time": 6544, "text": "Consciousness is, and mathematics is to consciousness like bones are to an organism."}, {"time": 6552, "text": "You need the bones."}, {"time": 6552, "text": "So mathematics is not divorced from consciousness, but it's not the entirety of consciousness by any means."}, {"time": 6560, "text": "And so there's an infinite variety of consciousnesses and signaling games that consciousnesses could interact via."}, {"time": 6570, "text": "And therefore worlds, your common worlds, data structures that they can use to communicate."}, {"time": 6577, "text": "So space and time is just one of an infinite variety."}, {"time": 6580, "text": "And so I think that what we'll find is that as we go outside of our little space time bubble, we will encounter utterly alien forms of conscious experience that we may not be able to really comprehend in the following sense."}, {"time": 6599, "text": "If I ask you to imagine a color that you've never seen before, does anything happen?"}, {"time": 6611, "text": "And that's just one color."}, {"time": 6612, "text": "I'm asking for just a color."}, {"time": 6614, "text": "We actually know, by the way, that apparently there are women called tetraphams who have four color receptors, not just three."}, {"time": 6625, "text": "And Kimberly Jameson and others who've studied these women have good evidence that they apparently have a new dimension of color experience that the rest of us don't have."}, {"time": 6635, "text": "So these women are apparently living in a world of color that you and I can't even concretely imagine."}, {"time": 6642, "text": "No man can imagine them."}, {"time": 6644, "text": "And yet they're real color experiences."}, {"time": 6646, "text": "And so in that sense, I'm saying, now take that little baby step, oh, there are women who have color experiences that I could never have."}, {"time": 6653, "text": "Well, that's shocking."}, {"time": 6655, "text": "Now take that infinite."}, {"time": 6657, "text": "There are consciousnesses where every aspect of their experiences is like that new color."}, {"time": 6663, "text": "It's something utterly alien to you."}, {"time": 6665, "text": "You have nothing like that."}, {"time": 6667, "text": "And yet these are all possible varieties of conscious experience."}, {"time": 6671, "text": "And when you say there's a lot of consciousnesses, as a singular consciousness, basically the set of possible experiences you can have in that subjective way, as opposed to the underlying mechanism."}, {"time": 6685, "text": "Because you say that, you know, having a extra color receptor, ability to have new experiences that somehow a different consciousness, is there a way to see that as all the same consciousness, the subjectivity itself?"}, {"time": 6702, "text": "Because when we have two of these conscious agents interacting, the mathematics, they actually satisfy the definition of a conscious agent."}, {"time": 6709, "text": "So in fact, they are a single conscious agent."}, {"time": 6712, "text": "So in fact, one way to think about what I'm saying, I'm postulating with my colleagues, Chaiton and Chris and others, Robert Pretner and so forth."}, {"time": 6721, "text": "There is one big conscious agent, infinitely complicated."}, {"time": 6725, "text": "But fortunately, we can, for analytic purposes, break it down all the way to, in some sense, the simplest conscious agent, which has one conscious experience, one."}, {"time": 6735, "text": "This one agent can experience red 35, and that's it."}, {"time": 6738, "text": "That's what it experiences."}, {"time": 6740, "text": "You can get all the way down to that."}, {"time": 6742, "text": "So you think it's possible that consciousness, whatever that is, is much more, is fundamental, or at least much more in the direction of the fundamental than is space time as we perceive it?"}, {"time": 6760, "text": "That's the proposal."}, {"time": 6762, "text": "And therefore, what I have to do, in terms of the hard problem of consciousness, is to show how dynamical systems of conscious agents could lead to what we call space and time and neurons and brain activity."}, {"time": 6776, "text": "In other words, we have to show how you get space time and physical objects entirely from a theory of conscious agents outside of space time, with the dynamics outside of space time."}, {"time": 6790, "text": "So that's, and I can tell you how we plan to do that, but that's the idea."}, {"time": 6795, "text": "Okay, the magic of it, that chocolate is delicious."}, {"time": 6799, "text": "So there's a mathematical kind of thing that we could say here, how it can emerge within this system of networks of conscious agents, but is there going to be at the end of the proof why chocolate is so delicious?"}, {"time": 6818, "text": "I guess I'm going to ask different kinds of dumb questions to try to sneak up."}, {"time": 6823, "text": "Oh, well, that's the right question, and when I say that I took conscious experiences as fundamental, what that means is, in the current version of my theory, I'm not explaining conscious experiences where they came from."}, {"time": 6835, "text": "That's the miracle, that's one of the miracles."}, {"time": 6838, "text": "So I have two miracles in my theory."}, {"time": 6839, "text": "There are conscious experiences, like the taste of chocolate, and that there's a probabilistic relationship."}, {"time": 6846, "text": "When certain conscious experiences occur, others are more likely to occur."}, {"time": 6850, "text": "Those are the two miracles that are possible."}, {"time": 6852, "text": "Is it possible to get beyond that and somehow start to chip away at the miracleness of that miracle, that chocolate is delicious?"}, {"time": 6865, "text": "I've got my hands full with what I'm doing right now, but I can just say at top level how I would think about that."}, {"time": 6872, "text": "That would get at this consciousness without form."}, {"time": 6880, "text": "This is really tough, because it's consciousness without form versus the various forms that consciousness takes for the experiences that it has."}, {"time": 6895, "text": "So when I write down a probability space for these conscious experiences, I say, here's a probability space for the possible conscious experiences, right?"}, {"time": 6907, "text": "It's just like when I write down a probability space for an experiment."}, {"time": 6909, "text": "Like I'm gonna flip a coin twice, right?"}, {"time": 6912, "text": "And I want to look at the probabilities of various outcomes."}, {"time": 6915, "text": "So I have to write down a probability space."}, {"time": 6916, "text": "There could be heads, heads, heads, tails, tails, heads, tails, tails."}, {"time": 6920, "text": "So any class of probability you're told, write down your probability space."}, {"time": 6925, "text": "If you don't write down your probability space, you can't get started."}, {"time": 6928, "text": "So here's my probability space for consciousness."}, {"time": 6930, "text": "How do I want to interpret that structure?"}, {"time": 6933, "text": "The structure is just sitting there."}, {"time": 6934, "text": "There's gonna be a dynamics that happens on it, right?"}, {"time": 6937, "text": "Experiences appear and then they disappear, just like heads appears and disappears."}, {"time": 6942, "text": "So one way to think about that fundamental probability space is that corresponds to consciousness without any content."}, {"time": 6953, "text": "The infinite consciousness that transcends any particular content."}, {"time": 6958, "text": "Well, do you think of that as a mechanism, as a thing, like the rules that govern the dynamics of the thing outside of space time?"}, {"time": 6968, "text": "Isn't that, if you think consciousness is fundamental, isn't that essentially getting like, it is solving the hard problem, which is like from where does this thing pop up, which is the mechanism of the thing popping up, whatever the consciousness is, the different kinds and so on, that mechanism."}, {"time": 6989, "text": "And also, the question I want to ask is how tricky do you think it is to solve that problem?"}, {"time": 6998, "text": "You've solved a lot of difficult problems throughout the history of humanity."}, {"time": 7002, "text": "There's probably more problems to solve left than we've solved by like an infinity."}, {"time": 7012, "text": "But along that long journey of intelligent species, when will we solve this consciousness one?"}, {"time": 7021, "text": "Which is one way to measure the difficulty of the problem."}, {"time": 7024, "text": "So I'll give two answers."}, {"time": 7025, "text": "There's one problem I think we can solve, but we haven't solved yet."}, {"time": 7029, "text": "And that is the reverse of what my colleagues call the hard problem."}, {"time": 7034, "text": "The problem of how do you start with conscious experiences in the way that I've just described them and the dynamics and build up space and time and brains, that I think is a tough technical problem, but it's in principle solvable."}, {"time": 7046, "text": "So I think we can solve that."}, {"time": 7047, "text": "So we would solve the hard problem, not by showing how brains create consciousness, but how networks of conscious agents create what we call the symbols that we call brains."}, {"time": 7058, "text": "So that I think."}, {"time": 7060, "text": "But does that allow you to, so that's interesting."}, {"time": 7063, "text": "Consciousness creates the brain, not the brain creates consciousness."}, {"time": 7066, "text": "But does that allow you to build the thing?"}, {"time": 7069, "text": "My guess is that it will enable unbelievable technologies."}, {"time": 7073, "text": "Once, and I'll tell you why."}, {"time": 7075, "text": "I think it plugs into the work that the physicists are doing."}, {"time": 7078, "text": "So this theory of consciousness will be even deeper than the structures that the physicists are finding, like the amplituhedron."}, {"time": 7086, "text": "But the other answer to your question is less positive."}, {"time": 7090, "text": "As I said earlier, I think that there is no such thing as a theory of everything."}, {"time": 7095, "text": "So that I think that the theory that my team is working on, this conscious agent theory, is just a 1.0 theory."}, {"time": 7106, "text": "We're using probability spaces and Markovian curls."}, {"time": 7109, "text": "I can easily see people now saying, well, we can do better if we go to category theory."}, {"time": 7115, "text": "And we can get a deeper, perhaps more interesting."}, {"time": 7118, "text": "And then someone will say, well, now I'll go to topoi theory."}, {"time": 7122, "text": "So I imagine that there'll be conscious agents, five, 10, 3 trillion, 0.0, but I think it will never end."}, {"time": 7131, "text": "I think ultimately this question that we sort of put our fingers on of, how does the formless give birth to form, to the wonderful taste of chocolate?"}, {"time": 7146, "text": "I think that we will always go deeper and deeper, but we will never solve that."}, {"time": 7152, "text": "That in some sense, that will be a primitive."}, {"time": 7155, "text": "I hope I'm wrong."}, {"time": 7156, "text": "Maybe it's just the limits of my current imagination."}, {"time": 7163, "text": "So I'll just say my imagination right now doesn't peer that deep."}, {"time": 7170, "text": "By the way, I'm saying this, I don't want to discourage some brilliant 20 year old who then later on proves me dead wrong."}, {"time": 7177, "text": "I hope to be proven dead wrong."}, {"time": 7179, "text": "Just like you said, essentially from now, everything we're saying now, everything you're saying, all your theories will be laughing stock."}, {"time": 7185, "text": "They will respect the puzzle solving abilities and how much we were able to do with so little."}, {"time": 7194, "text": "But outside of that, you will all be just, the silliness will be entertainment for a teenager."}, {"time": 7201, "text": "Especially the silliness when we thought that we were so smart and we knew it all."}, {"time": 7206, "text": "So it would be interesting to explore your ideas by contrasting, you mentioned Annika, Annika Harris, you mentioned Philip Goff."}, {"time": 7215, "text": "So outside of, if you're not allowed to say the fundamental disagreement is the fact that space time is fundamental."}, {"time": 7224, "text": "What are interesting distinctions between ideas of consciousness between you and Annika, for example?"}, {"time": 7230, "text": "You guys have, you've been on a podcast together, I'm sure in private you guys have some incredible conversations."}, {"time": 7238, "text": "So where are some interesting sticking points, some interesting disagreements, let's say with Annika first."}, {"time": 7245, "text": "Maybe there'll be a few other people."}, {"time": 7247, "text": "Well, Annika and I just had a conversation this morning where we were talking about our ideas and what we discovered really in our conversation was that we're pretty much on the same page."}, {"time": 7257, "text": "It was really just about consciousness."}, {"time": 7260, "text": "Our ideas about consciousness are pretty much on the same page."}, {"time": 7264, "text": "She rightly has cautioned me to, when I talk about conscious agents, to point out that the notion of agency is not fundamental in my theory."}, {"time": 7275, "text": "The notion of self is not fundamental and that's absolutely true."}, {"time": 7278, "text": "I can use this network of conscious agents, I now use as a technical term, conscious agent is a technical term for that probability space with the Markovian dynamics."}, {"time": 7289, "text": "I can use that to build models of a self and to build models of agency, but they're not fundamental."}, {"time": 7295, "text": "So she has really been very helpful in helping me to be a little bit clear about these ideas and not say things that are misleading."}, {"time": 7305, "text": "This is the interesting thing about language, actually, is that language, quite obviously, is an interface to truth."}, {"time": 7316, "text": "It's so fascinating that individual words can have so much ambiguity and the specific choices of a word within a particular sentence, within the context of a sentence, can have such a difference in meaning."}, {"time": 7337, "text": "It's quite fascinating, especially when you're talking about topics like consciousness, because it's a very loaded term."}, {"time": 7343, "text": "It means a lot of things to a lot of people and the entire concept is shrouded in mystery."}, {"time": 7349, "text": "So a combination of the fact that it's a loaded term and that there's a lot of mystery, people can just interpret it in all kinds of ways."}, {"time": 7356, "text": "And so you have to be both precise and help them avoid getting stuck on some kind of side road of miscommunication, lost in translation because you used the wrong word."}, {"time": 7371, "text": "I mean, because for a lot of people, consciousness is ultimately connected to a self."}, {"time": 7381, "text": "I mean, that's our experience of consciousness is very, it's connected to this ego."}, {"time": 7388, "text": "I mean, I just, I mean, what else could it possibly be?"}, {"time": 7392, "text": "I can't even, how do you begin to comprehend, to visualize, to conceptualize a consciousness that's not connected to like this particular organism?"}, {"time": 7403, "text": "I have a way of thinking about this whole problem now that comes out of this framework that's different."}, {"time": 7410, "text": "So we can imagine a dynamics of consciousness, not in space and time, just abstractly."}, {"time": 7417, "text": "It could be cooperative for all we know."}, {"time": 7420, "text": "It could be very friendly, I don't know."}, {"time": 7423, "text": "And you can set up a dynamics, a Markovian dynamics that is so called stationary."}, {"time": 7428, "text": "And that's a technical term, which means that the entropy effectively is not increasing."}, {"time": 7433, "text": "There is some entropy, but it's constant."}, {"time": 7435, "text": "So there's no increasing entropy."}, {"time": 7436, "text": "And in that sense, the dynamics is timeless."}, {"time": 7441, "text": "There is no entropic time, but it's a trivial theorem, three line proof that if you have a stationary Markovian dynamics, any projection that you make of that dynamics by conditional probability."}, {"time": 7456, "text": "And if you want, I can state a little bit more, even more mathematically precisely for some readers or listeners."}, {"time": 7461, "text": "But if any projection you take by conditional probability, the induced image of that Markov chain will have increasing entropy."}, {"time": 7472, "text": "You will have entropic time."}, {"time": 7474, "text": "So I'll be very, very precise."}, {"time": 7476, "text": "I have a Markov chain X1, X2 through Xn where Xn, n goes to infinity, right?"}, {"time": 7483, "text": "The entropy H, capital H of Xn is equal to the entropy H of Xn minus one for all n. So the entropy is the same."}, {"time": 7495, "text": "But it's a theorem that H of Xn, say given X sub one is greater than or equal to H of Xn minus one given X1."}, {"time": 7510, "text": "Sure, where does the greater come from?"}, {"time": 7513, "text": "Because with the theorem, the three line proof, H of Xn given X1 is greater than or equal to H of Xn given X1 and X2 because conditioning reduces."}, {"time": 7527, "text": "But then H of Xn minus one given X1, X2 is equal to H of Xn given X2, Xn minus one given X2 by the Markov property."}, {"time": 7544, "text": "And then because it's stationary, it's equal to H of X. I have to write it down."}, {"time": 7553, "text": "Anyway, there's a three line proof."}, {"time": 7556, "text": "Sure, but the assumption of stationarity, we're using a lot of terms that people won't understand, doesn't matter."}, {"time": 7567, "text": "So there's some kind of, some Markovian dynamics is basically trying to model some kind of system with some probabilities and there's agents and they interact in some kind of way and you can say something about that system as it evolves stationarity."}, {"time": 7582, "text": "So a stationary system is one that has certain properties in terms of entropy, very well."}, {"time": 7590, "text": "But we don't know if it's stationary or not."}, {"time": 7593, "text": "We don't know what the properties."}, {"time": 7596, "text": "So you have to kind of take assumptions and see, okay, well, what does the system behave like under these different properties?"}, {"time": 7603, "text": "The more constraints, the more assumptions you take, the more interesting, powerful things you can say, but sometimes they're limiting."}, {"time": 7612, "text": "That said, we're talking about consciousness here."}, {"time": 7615, "text": "How does that, you said cooperative, okay, competitive."}, {"time": 7622, "text": "It just, I like chocolate."}, {"time": 7624, "text": "I'm sitting here, I have a brain, I'm wearing a suit."}, {"time": 7628, "text": "It sure as hell feels like I'm myself."}, {"time": 7632, "text": "Now, what, am I tuning in?"}, {"time": 7634, "text": "Am I plugging into something?"}, {"time": 7636, "text": "Am I a projection, a simple, trivial projection into space time from some much larger organism that I can't possibly comprehend?"}, {"time": 7645, "text": "How the hell, you're saying some, you're building up mathematical intuitions, fine, great."}, {"time": 7651, "text": "But I'm just, I'm having an existential crisis here and I'm gonna die soon."}, {"time": 7656, "text": "Well, I'll die pretty quickly."}, {"time": 7657, "text": "So I wanna figure out why chocolate's so delicious."}, {"time": 7663, "text": "So help me out here."}, {"time": 7664, "text": "So let's just keep sneaking up to this."}, {"time": 7667, "text": "Right, so the whole technical thing was to say this."}, {"time": 7672, "text": "Even if the dynamics of consciousness is stationary so that there is no entropic time, any projection of it, any view of it will have the artifact of entropic time."}, {"time": 7688, "text": "That's a limited resource."}, {"time": 7690, "text": "Limited resources, so that the fundamental dynamics may have no limits, limited resources whatsoever."}, {"time": 7697, "text": "Any projection will have certainly time as a limited resource and probably lots of other limited resources."}, {"time": 7704, "text": "Hence, we could get competition and evolution and nature, red and tooth and claw as an artifact of a deeper system in which those aren't fundamental."}, {"time": 7714, "text": "And in fact, I take it as something that this theory must do at some point is to show how networks of conscious agents, even if they're not resource limited, give rise to evolution by natural selection via a projection."}, {"time": 7729, "text": "Yeah, but you're saying, I'm trying to understand how the limited resources that give rise to, so first the thing gives rise to time, that gives rise to limited resource, that gives rise to evolution by natural selection, how that has to do with the fact that chocolate's delicious?"}, {"time": 7745, "text": "Well, it's not gonna do that directly."}, {"time": 7748, "text": "It's gonna get to this notion of self."}, {"time": 7750, "text": "Oh, it's gonna give you?"}, {"time": 7752, "text": "The notion of self."}, {"time": 7752, "text": "Oh, the evolution gives you the notion of self."}, {"time": 7754, "text": "And also of a self separate from other selves."}, {"time": 7758, "text": "So the idea would be that."}, {"time": 7760, "text": "It's competition, it has life and death, all those kinds of things."}, {"time": 7764, "text": "So it won't, I don't think, as I said, I don't think that I can tell you how the formless gives rise to the experience of chocolate."}, {"time": 7772, "text": "Right now, my current theory says that's one of the miracles I'm assuming."}, {"time": 7776, "text": "So my theory can't do it."}, {"time": 7778, "text": "And the reason my theory can't do it is because Hoffman's brain can't do it right now."}, {"time": 7781, "text": "But the notion of self, yes."}, {"time": 7785, "text": "The notion of self can be an artifact of the projection of it."}, {"time": 7791, "text": "So there's one conscious agent."}, {"time": 7795, "text": "Because anytime conscious agents interact, they form a new conscious agent."}, {"time": 7800, "text": "Any projection of that one conscious agent gives rise to time, even if there wasn't any time in that one conscious agent."}, {"time": 7807, "text": "And it gives rise, I want to, now I haven't proven this."}, {"time": 7810, "text": "So this is, so now this is me guessing where the theory is going to go."}, {"time": 7814, "text": "I haven't done this."}, {"time": 7815, "text": "There's no paper on this yet."}, {"time": 7816, "text": "So now I'm speculating."}, {"time": 7818, "text": "My guess is I'll be able to show, or my brighter colleagues working with me will be able to show that we will get evolution of a natural selection, the notion of individual selves, individual physical objects and so forth coming out as a projection of this thing."}, {"time": 7831, "text": "And that the self, this then will be really interesting in terms of how it starts to interact with certain spiritual traditions, right?"}, {"time": 7840, "text": "Where they will say that there is a notion of self that needs to be let go, which is this finite self that's competing with other selves to get more money and prestige and so forth."}, {"time": 7852, "text": "That self in some sense has to die."}, {"time": 7854, "text": "But there's a deeper self, which is the timeless being that precludes, not precludes, but precedes any particular conscious experiences, the ground of all experience."}, {"time": 7870, "text": "That there's that notion of a deep capital self."}, {"time": 7873, "text": "But our little capital, lowercase s selves could be artifacts of projection."}, {"time": 7880, "text": "And it may be that what consciousness is doing in this framework is, right?"}, {"time": 7886, "text": "It's projected itself down into a self that calls itself dawn and a self that calls itself lax."}, {"time": 7893, "text": "And through conversations like this, it's trying to find out about itself and eventually transcend the limits of the dawn and lax little icons that it's using and that little projection of itself."}, {"time": 7909, "text": "Through this conversation, somehow it's learning about itself."}, {"time": 7913, "text": "So that thing dressed me up today in order to understand itself."}, {"time": 7919, "text": "And in some sense, you and I are not separate from that thing and we're not separate from each other."}, {"time": 7923, "text": "Yeah, well, I have to question the fashion choices on my end then."}, {"time": 7928, "text": "All right, so you mentioned you agree in terms of consciousness on a lot of things with Anika."}, {"time": 7935, "text": "Is there somebody, friend or friendly foe that you disagree with in some nuanced, interesting way or some major way about consciousness, about these topics of reality that you return to?"}, {"time": 7954, "text": "Often, it's like Christopher Hitchens with Rabbi David Wolpe have had interesting conversations through years that added to the complexity and the beauty of their friendship."}, {"time": 7967, "text": "Is there somebody like that that over the years has been a source of disagreement with you that's strengthened your ideas?"}, {"time": 7976, "text": "Hmm, my ideas have been really shaped by several things."}, {"time": 7982, "text": "One is the physicalist framework that my scientific colleagues, almost to a person, have adopted and that I adopted too."}, {"time": 7992, "text": "And the reason I walked away from it was because it became clear that we couldn't start with unconscious ingredients and boot up consciousness."}, {"time": 8002, "text": "Can you define physicalist in contrast to reductionist?"}, {"time": 8008, "text": "So a physicalist, I would say as someone who takes space time and the objects within space time as ontologically fundamental."}, {"time": 8018, "text": "Right, and then reductionist is saying the smaller, the more fundamental."}, {"time": 8023, "text": "That's a methodological thing."}, {"time": 8025, "text": "That's saying within space time, as you go to smaller and smaller scales in space, you get deeper and deeper laws, more and more fundamental laws and the reduction of temperature to particle movement was an example of that."}, {"time": 8041, "text": "But I think that the reason that worked was almost an artifact of the nature of our interface."}, {"time": 8047, "text": "That was for a long time and your colleagues, including yourself, were physicalists and now you broke away."}, {"time": 8053, "text": "Broke away because I think you can't start with unconscious ingredients and boot up consciousness."}, {"time": 8058, "text": "And so even with Roger Penrose where there's like a gray area."}, {"time": 8063, "text": "Right, and here's the challenge I would put to all of my friends and colleagues who give one specific conscious experience that you can boot up, right?"}, {"time": 8077, "text": "So if you think that it's integrated information and I've asked this of Giulio Tononi a couple times back in the 90s and then just a couple years ago."}, {"time": 8086, "text": "I asked Giulio, okay, so great, integrated information."}, {"time": 8089, "text": "So we're all interested in explaining some specific conscious experiences."}, {"time": 8093, "text": "So what is, you know, pick one, the taste of chocolate."}, {"time": 8096, "text": "What is the integrated information precise structure that we need for chocolate and why does that structure have to be for chocolate and why is it that it could not possibly be vanilla?"}, {"time": 8109, "text": "Is there any, I asked him, is there any one specific conscious experience that you can account for?"}, {"time": 8113, "text": "Because notice, they've set themselves the task of booting up conscious experiences from physical systems."}, {"time": 8121, "text": "That's the task they've set themselves."}, {"time": 8122, "text": "But that doesn't mean they're, I understand your intuition, but that doesn't mean they're wrong just because they can't find a way to boot it up yet."}, {"time": 8132, "text": "No, that doesn't mean that they're wrong."}, {"time": 8133, "text": "It just means that they haven't done it."}, {"time": 8137, "text": "I think it's principled."}, {"time": 8138, "text": "The reason is principled, but I'm happy that they're exploring it."}, {"time": 8143, "text": "But the fact is, the remarkable fact is there's not one theory."}, {"time": 8146, "text": "So integrated information theory, orchestrated collapse of microtubules, global workspace theory."}, {"time": 8154, "text": "These are all theories of consciousness."}, {"time": 8157, "text": "There's not a single theory that can give you a specific conscious experience that they say, here is the physical dynamics or the physical structure that must be the taste of chocolate or whatever one they want."}, {"time": 8169, "text": "So you're saying it's impossible."}, {"time": 8171, "text": "They're saying it's just hard."}, {"time": 8174, "text": "My attitude is, okay, no one said you had to start with neurons or physical systems and boot up consciousness."}, {"time": 8181, "text": "You guys are just taking that."}, {"time": 8182, "text": "You chose that problem."}, {"time": 8183, "text": "So since you chose that problem, how much progress have you made?"}, {"time": 8187, "text": "Well, when you've not been able to come up with a single specific conscious experience and you've had these brilliant people working on it for decades now, that's not really good progress."}, {"time": 8198, "text": "Let me ask you to play devil's advocate."}, {"time": 8201, "text": "Can you try to steel man, steel man meaning argue the best possible case for reality?"}, {"time": 8209, "text": "The opposite of your book title."}, {"time": 8211, "text": "So, or maybe just stick into consciousness."}, {"time": 8214, "text": "Can you take the physicalist view?"}, {"time": 8216, "text": "Can you steel man the physicalist view for a brief moment playing devil's advocate too?"}, {"time": 8221, "text": "Or steel man the person you used to be?"}, {"time": 8225, "text": "She's a physicalist."}, {"time": 8227, "text": "What's a good, like saying that you might be wrong right now, what would be a convincing argument for that?"}, {"time": 8237, "text": "Well, I think the argument I would give that I believed was, look, when you have very simple physical systems, like a piece of dirt, there's not much evidence of life or consciousness."}, {"time": 8250, "text": "It's only when you get really complicated physical systems like that have brains and really, the more complicated the brains, the more it looks like there's consciousness and the more complicated that consciousness is."}, {"time": 8261, "text": "Surely that means that simple physical systems don't create much consciousness or if maybe not any, or maybe panpsychists, they create the most elementary kinds of simple conscious experiences, but you need more complicated physical systems to boot up, to create more complicated consciousnesses."}, {"time": 8282, "text": "I think that's the intuition that drives most of my colleagues."}, {"time": 8284, "text": "And you're saying that this concept of complexity is ill defined when you ground it to space time."}, {"time": 8293, "text": "Oh, I think it's well defined within the framework of space time, right?"}, {"time": 8297, "text": "No, it's ill defined relative to what you need to actually understand consciousness because you're grounding complexity in just in space time."}, {"time": 8306, "text": "Oh, got you, right, right."}, {"time": 8307, "text": "Yeah, what I'm saying is if it were true that space time was fundamental, then I would have to agree that if there is such a thing as consciousness, given the data that we've got, that complex brains have consciousness and dirt doesn't, that somehow it's the complexity of the dynamics or organization, the function of the physical system that somehow is creating the consciousness."}, {"time": 8335, "text": "So under those assumptions, yes, but when the physicists themselves are telling us that space time is not fundamental, then I can understand."}, {"time": 8343, "text": "See, then the whole picture starts to come into focus."}, {"time": 8347, "text": "Why, my colleagues are brilliant, right?"}, {"time": 8350, "text": "These are really smart people."}, {"time": 8352, "text": "I mean, Francis Crick worked on this for the last 20 years of his life."}, {"time": 8356, "text": "These are not stupid people."}, {"time": 8357, "text": "These are brilliant, brilliant people."}, {"time": 8359, "text": "The fact that we've come up with not a single specific conscious experience that we can explain and no hope."}, {"time": 8365, "text": "There's no one that says, oh, I'm really close."}, {"time": 8367, "text": "I'll have it for you in a year."}, {"time": 8369, "text": "No, there's just like, there's this fundamental gap."}, {"time": 8373, "text": "So much so that Steve Pinker in one of his writings says, look, he likes the global workspace theory, but he says the last dollop of the theory in which there's something it's like to, he says, we may have to just stipulate that as a brute fact."}, {"time": 8390, "text": "Pinker is brilliant, right?"}, {"time": 8392, "text": "He understands the state of play on this problem of the hard problem of consciousness, starting with physicalist assumptions and then trying to put up consciousness."}, {"time": 8402, "text": "So you've set yourself the problem."}, {"time": 8404, "text": "I'm starting with physical stuff that's not conscious."}, {"time": 8407, "text": "I'm trying to get the taste of chocolate out as maybe some kind of function of the dynamics of that."}, {"time": 8414, "text": "We've not been able to do that."}, {"time": 8416, "text": "And so Pinker is saying, we may have to punt."}, {"time": 8418, "text": "We may have to just stipulate that last bit."}, {"time": 8421, "text": "He calls it the last dollop."}, {"time": 8423, "text": "And just stipulate it as a bare fact of nature that there is something it's like."}, {"time": 8428, "text": "Well, from my point of view as the physical, the whole point, the whole promise of the physicalist was we wouldn't have to stipulate."}, {"time": 8434, "text": "I was gonna start with the physical stuff and explain where the consciousness came from."}, {"time": 8438, "text": "If I'm going to stipulate consciousness, why don't I just stipulate consciousness and not stipulate all the physical stuff too?"}, {"time": 8445, "text": "So I'm stipulating less."}, {"time": 8446, "text": "I'm saying, okay, I agree."}, {"time": 8447, "text": "Which is the panpsychist perspective."}, {"time": 8449, "text": "Well, it's actually what I call the conscious realist perspective."}, {"time": 8453, "text": "Panpsychists are effectively dualists, right?"}, {"time": 8455, "text": "They're saying there's physical stuff that really is fundamental and then consciousness stuff."}, {"time": 8460, "text": "So I would go with Pinker and say, look, let's just stipulate the consciousness stuff, but I'm not gonna stipulate the physical stuff."}, {"time": 8465, "text": "I'm gonna actually now show how to boot up the physical stuff from just the consciousness stuff."}, {"time": 8471, "text": "So I'll stipulate less."}, {"time": 8472, "text": "Is it possible, so if you stipulate less, is it possible for our limited brains to visualize reality as we delve deeper and deeper and deeper?"}, {"time": 8485, "text": "Is it possible to visualize somehow?"}, {"time": 8487, "text": "With the tools of math, with the tools of computers, with the tools of our mind, are we hopelessly lost?"}, {"time": 8494, "text": "You said there's ways to intuit what's true using mathematics and probability and sort of a Markovian dynamics, all that kind of stuff, but that's not visualizing."}, {"time": 8511, "text": "That's a kind of building intuition."}, {"time": 8515, "text": "But is it possible to visualize in the way we visualize so nicely in space time in four dimensions, in three dimensions, sorry."}, {"time": 8524, "text": "Well, we really are looking through a two dimensional screen until it's what we intuit to be a three dimensional world and also inferring dynamic stuff, making it 4D."}, {"time": 8537, "text": "Anyway, is it possible to visualize some pretty pictures that give us a deeper sense of the truth of reality?"}, {"time": 8545, "text": "I think that we will incrementally be able to do that."}, {"time": 8549, "text": "I think that, for example, the picture that we have of electrons and photons interacting and scattering, it may have not been possible until Faraday did all of his experiments and then Maxwell wrote down his equations."}, {"time": 8567, "text": "And we were then sort of forced by his equations to think in a new way."}, {"time": 8572, "text": "And then when Planck in 1900, desperate to try to solve the problem of black body radiation, what they call the ultraviolet catastrophe where Newton was predicting infinite energies where there weren't infinite energies in black body radiation."}, {"time": 8591, "text": "And he in desperation proposed packets of energy."}, {"time": 8600, "text": "Then once you've done that, and then you have an Einstein come along five years later and show how that explains the photoelectric effect."}, {"time": 8609, "text": "And then eventually in 1926, you get quantum theory."}, {"time": 8613, "text": "And then you get this whole new way of thinking that was, from the Newtonian point of view, completely contradictory and counterintuitive, certainly."}, {"time": 8625, "text": "And maybe if Giesen is right, not contradictory."}, {"time": 8627, "text": "Maybe if you use intuitionist math, they're not contradictory, but still, certainly you wouldn't have gone there."}, {"time": 8634, "text": "And so here's a case where the experiments and then a desperate mathematical move, sort of we use those as a flashlight into the deep fog."}, {"time": 8647, "text": "And so that science may be the flashlight into the deep fog."}, {"time": 8653, "text": "I wonder if it's still possible to visualize in the, like we talk about consciousness from a self perspective experience it."}, {"time": 8662, "text": "Hold that idea in our mind, the way you can experience things directly."}, {"time": 8667, "text": "We've evolved to experience things in this 3D world."}, {"time": 8673, "text": "And that's a very rich experience."}, {"time": 8675, "text": "When you're thinking mathematically, you still in the end of the day have to project it down to a low dimensional space to make conclusions."}, {"time": 8689, "text": "Your conclusions will be a number or a line or a plot or a visual."}, {"time": 8696, "text": "So I wonder like how we can really touch some deep truth in a subjective way, like experience it, really feel the beauty of it, you know, in the way that humans feel beauty."}, {"time": 8708, "text": "Right, are we screwed?"}, {"time": 8710, "text": "I don't think we're screwed."}, {"time": 8711, "text": "I think that we get little hints of it from psychedelic drugs and so forth."}, {"time": 8717, "text": "We get hints that there are certain interventions that we can take on our interface."}, {"time": 8721, "text": "I apply this chemical, which is just some element of my interface to this other, to a brain I ingested."}, {"time": 8729, "text": "And all of a sudden I seem like I've opened new portals into conscious experiences."}, {"time": 8736, "text": "Well, that's very, very suggestive."}, {"time": 8738, "text": "That's like the black body radiation doing something that we didn't expect, right?"}, {"time": 8742, "text": "It doesn't go to infinity when we thought it was gonna go to infinity and we're forced to propose these quanta."}, {"time": 8749, "text": "So once we have a theory of conscious agents and this projection to space, I should say, I should sketch what I think that projection is."}, {"time": 8759, "text": "But then I think we can then start to ask specific questions."}, {"time": 8763, "text": "When you're taking DMT or you're taking LSD or something like that, now that we have this deep model that we've reverse engineered space and time and physical particles, we've pulled them back to this theory of conscious agents."}, {"time": 8778, "text": "Now we can ask ourselves in this idealized future, what are we doing to conscious agents when we apply five MEO DMT?"}, {"time": 8788, "text": "What are we doing?"}, {"time": 8789, "text": "Are we opening a new portal, right?"}, {"time": 8792, "text": "So when I say that, I mean, I have a portal into consciousness that I call my body of Lex Friedman that I'm creating."}, {"time": 8799, "text": "And it's a genuine portal, not perfect, but it's a genuine portal."}, {"time": 8803, "text": "I'm definitely communicating with your consciousness."}, {"time": 8805, "text": "And we know that we have one technology for building new portals."}, {"time": 8811, "text": "We know one technology and that is having kids."}, {"time": 8814, "text": "Having kids is how we build new portals into consciousness."}, {"time": 8820, "text": "Can you elaborate that?"}, {"time": 8821, "text": "Oh, oh, oh, you mean like?"}, {"time": 8824, "text": "Your son and your daughter didn't exist."}, {"time": 8827, "text": "That was a portal."}, {"time": 8828, "text": "You're having contact with consciousness that you never would have had before, but now you've got a son or a daughter."}, {"time": 8834, "text": "You went through this physical process, they were born, then there was all the training."}, {"time": 8839, "text": "But is that portal yours?"}, {"time": 8842, "text": "So when you have kids, are you creating new portals that are completely distinct from the portals that you've created with other consciousness?"}, {"time": 8849, "text": "Like can you elaborate on that?"}, {"time": 8851, "text": "To which degree are the consciousness of your kids a part of you?"}, {"time": 8857, "text": "Well, so every person that I see, that symbol that I see, the body that I see, is a portal potentially for me to interact with a consciousness."}, {"time": 8870, "text": "And each consciousness has a unique character."}, {"time": 8873, "text": "We call it a personality and so forth."}, {"time": 8876, "text": "So with each new kid that's born, we come in contact with a personality that we've never seen before."}, {"time": 8883, "text": "And a version of consciousness that we've never seen before."}, {"time": 8886, "text": "At a deeper level, as I said, the theory says there's one agent."}, {"time": 8890, "text": "So this is a different projection of that one agent."}, {"time": 8895, "text": "But so that's what I mean by a portal is within my own interface, my own projection, can I see other projections of that one consciousness?"}, {"time": 8909, "text": "So can I get portals in that sense?"}, {"time": 8911, "text": "And I think we will get a theory of that, that we will get a theory of portals and then we can ask how the psychedelics are acting."}, {"time": 8921, "text": "Are they actually creating new portals or not?"}, {"time": 8924, "text": "If they're not, we should nevertheless then understand how we could create a new portal, right?"}, {"time": 8930, "text": "Maybe we have to just study what happens when we have kids."}, {"time": 8933, "text": "We know that that technology creates new portals."}, {"time": 8937, "text": "So we have to reverse engineer that and then say, okay, could we somehow create new portals de novo?"}, {"time": 8944, "text": "With something like brain computer interfaces, for example."}, {"time": 8949, "text": "Yeah, well, maybe just a chemical or something."}, {"time": 8950, "text": "It's probably more complicated than a chemical."}, {"time": 8952, "text": "That's why I think that the psychedelics may, because they might be affecting this portal in certain ways that it turns it around and opens up."}, {"time": 8960, "text": "In other words, maybe once we understand what this thing is a portal, your body is a portal, and understand all of those complexities, maybe we'll realize that that portal can be shifted to different parts of the deeper consciousness and can be used to create new portals."}, {"time": 8974, "text": "And give new windows on it."}, {"time": 8976, "text": "And so in that way, maybe yes, psychedelics could open up new portals in the sense that they're taking something that's already a complex portal and just tweaking it a bit."}, {"time": 8985, "text": "Well, but creating is a very powerful difference between morphing."}, {"time": 8990, "text": "Right, right, tweaking versus creating, I agree."}, {"time": 8993, "text": "But maybe it gives you intuition to at least the full space of the kinds of things that this particular system is capable of."}, {"time": 9001, "text": "I mean, the idea of the consciousness creates brains."}, {"time": 9005, "text": "I mean, that breaks my brain because, I guess I'm still a physicalist in that sense because it's just much easier to intuit the world."}, {"time": 9019, "text": "It's practical to think there's a neural network and what are the different ways fascinating capabilities can emerge from this neural network."}, {"time": 9033, "text": "I agree, it's easier."}, {"time": 9034, "text": "And so you start to, and then present to yourself the problem of, okay, well, how does consciousness arise?"}, {"time": 9042, "text": "How does emotion arise?"}, {"time": 9046, "text": "How does memory arise?"}, {"time": 9049, "text": "How do we filter within the system all the incoming sensory information we're able to allocate attention in different interesting ways?"}, {"time": 9058, "text": "How do all those mechanisms arise?"}, {"time": 9062, "text": "To say that there's other fundamental things we don't understand outside of space time that are actually core to how this whole thing works is a bit paralyzing because it's like, oh, we're not 10% done, we're like 0.001% done."}, {"time": 9080, "text": "It's the immediate feeling."}, {"time": 9083, "text": "Certainly understand that."}, {"time": 9084, "text": "My attitude about it is, if you look at the young physicists who are searching for these structures beyond space time, like amplitude and so forth, they're having a ball."}, {"time": 9098, "text": "Space time, that's what the old folks did."}, {"time": 9101, "text": "That's what the older generation did."}, {"time": 9104, "text": "We're doing something that really is fun and new and they're having a blast and they're finding all these new structures."}, {"time": 9113, "text": "So I think that we're going to succeed in getting a new deeper theory."}, {"time": 9123, "text": "I can just say what I'm hoping with the theory that I'm working on, I'm hoping to show that I could have this timeless dynamics of consciousness, no entropic time."}, {"time": 9132, "text": "I take a projection and I show how this timeless dynamics looks like the Big Bang and the entire evolution of space time."}, {"time": 9141, "text": "In other words, I see how my whole space time interface."}, {"time": 9145, "text": "So not just the projection doesn't just look like space time, you can explain the whole from the origin of the universe."}, {"time": 9154, "text": "That's what we have to do and that's what the physicists understand."}, {"time": 9157, "text": "When they go beyond space time to the amplitude heat and the cosmological polytope, they ultimately know that they have to get back the Big Bang story and the whole evolution, that whole story where there were no living things."}, {"time": 9169, "text": "There was just a point and then the explosion and then just particles at high energy and then eventually the cooling down and the differentiation and finally matter condenses and then life and then consciousness."}, {"time": 9183, "text": "That whole story has to come out of something that's deeper and without time."}, {"time": 9187, "text": "And that's what we're up to."}, {"time": 9192, "text": "So the whole story that we've been telling ourselves about Big Bang and how brains evolved in consciousness will come out of a much deeper theory."}, {"time": 9198, "text": "And yeah, for someone like me, it's a lot."}, {"time": 9204, "text": "But for the younger generation, this is like, oh wow, all the low cherries aren't picked."}, {"time": 9210, "text": "This is really good stuff."}, {"time": 9211, "text": "This is really new fundamental stuff that we can do."}, {"time": 9215, "text": "So I can't wait to read the papers of the younger generation and I wanna see them."}, {"time": 9221, "text": "Kids these days with their non space time assumptions."}, {"time": 9228, "text": "It's just interesting looking at the philosophical tradition of this difficult ideas you struggle with."}, {"time": 9233, "text": "If you look like somebody like Emmanuel Kant, what are some interesting agreements and disagreements you have with a guy about the nature of reality?"}, {"time": 9244, "text": "So there's a lot in agreement, right?"}, {"time": 9246, "text": "So Kant was an idealist, transcendental idealist and he basically had the idea that we don't see nature as it is."}, {"time": 9259, "text": "We impose a structure on nature."}, {"time": 9266, "text": "And so in some sense, I'm saying something similar."}, {"time": 9269, "text": "I'm saying that, by the way, I don't call myself an idealist."}, {"time": 9271, "text": "I call myself a conscious realist because idealism has a long history."}, {"time": 9275, "text": "A lot of different ideas come under idealism and there's a lot of debates and so forth."}, {"time": 9280, "text": "It tends to be identified with, in many cases, anti science and anti realism."}, {"time": 9286, "text": "And I don't want either connection with my ideas and so I just called mine conscious realism with an emphasis on realism and not anti realism."}, {"time": 9296, "text": "But one place where I would, of course, disagree with Kant was that he thought that Euclidean space time was a priori, right?"}, {"time": 9305, "text": "We just know that that's false."}, {"time": 9307, "text": "So he went too far on that."}, {"time": 9311, "text": "But in general, the idea that we don't start with space time, that space and time is in some sense the forms of our perceptions."}, {"time": 9321, "text": "And I would say that there's a lot in common with Berkeley in that regard."}, {"time": 9328, "text": "There's a lot of ingenious arguments in Berkeley."}, {"time": 9331, "text": "Leibniz in his monodology understood very clearly that the hard problem was not solvable."}, {"time": 9338, "text": "He posed the hard problem and basically dismissed it."}, {"time": 9341, "text": "He just said, you can't do this."}, {"time": 9343, "text": "And so if he came here and saw where we are, he said, look, guys, I told you this 300 years ago."}, {"time": 9350, "text": "And he had his monodology."}, {"time": 9351, "text": "He was trying to do something like, it's different from what I'm doing, but he had these things that were not in space and time, these monads."}, {"time": 9360, "text": "He was trying to build something."}, {"time": 9363, "text": "I'm trying to build a theory of conscious agents."}, {"time": 9365, "text": "My guess is that if he came here, I could just, if he saw what I was doing, he would say, he would understand it and immediately take off with it and go places that I couldn't."}, {"time": 9377, "text": "He would have no problem with this."}, {"time": 9379, "text": "Right, there would be overlap of the spirit of the ideas would be totally overlapping."}, {"time": 9385, "text": "But his genius would then just run with it far faster than I could."}, {"time": 9388, "text": "I love the humility here."}, {"time": 9389, "text": "So let me ask you about sort of practical implications of your ideas to our world, our complicated world."}, {"time": 9396, "text": "When you look at the big questions of humanity, of hate, war, what else is there?"}, {"time": 9406, "text": "Evil, maybe there's the positive aspects of that, of meaning, of love."}, {"time": 9414, "text": "What is the fact that reality is an illusion perceived?"}, {"time": 9419, "text": "What is the conscious realism when applied to daily life?"}, {"time": 9427, "text": "What kind of impact does it have?"}, {"time": 9429, "text": "A lot, and it's sort of scary."}, {"time": 9435, "text": "We all know that life is ephemeral and spiritual traditions have said wake up to the fact that anything that you do here is going to disappear."}, {"time": 9444, "text": "But it's even more ephemeral than perhaps we've thought."}, {"time": 9447, "text": "I see this bottle because I create it right now."}, {"time": 9450, "text": "As soon as I look away, that data structure has been garbage collected."}, {"time": 9456, "text": "That bottle, I have to recreate it every time I look."}, {"time": 9458, "text": "So I spend all my money and I buy this fancy car."}, {"time": 9462, "text": "That car, I have to keep recreating it every time I look at it."}, {"time": 9465, "text": "It's that ephemeral."}, {"time": 9466, "text": "So all the things that we invest ourselves in, we fight over, we kill each other over, we have wars over, these are all, it's like people in a virtual reality simulation, right?"}, {"time": 9479, "text": "And there's this Porsche and we all see the Porsche."}, {"time": 9483, "text": "Well, that Porsche exists when I look at it."}, {"time": 9487, "text": "I turn my headset and I look at it."}, {"time": 9489, "text": "And then if Joe turns his headset the right way, he'll see his Porsche."}, {"time": 9493, "text": "It's not even the same Porsche that I see."}, {"time": 9495, "text": "He's creating his own Porsche."}, {"time": 9497, "text": "So these things are exceedingly ephemeral."}, {"time": 9500, "text": "And now just imagine saying that that's my Porsche."}, {"time": 9505, "text": "Well, you can agree to say that it's your Porsche, but really the Porsche only exists as long as you look."}, {"time": 9512, "text": "So this all of a sudden, what the spiritual traditions have been saying for a long, long time, this gets cashed out in mathematically precise science."}, {"time": 9521, "text": "It's saying ephemeral, yes."}, {"time": 9523, "text": "In fact, it lasts for a few milliseconds, a few hundred milliseconds while you look at it."}, {"time": 9527, "text": "And then it's gone."}, {"time": 9528, "text": "So the whole idea, why are we fighting?"}, {"time": 9533, "text": "Why do we hate?"}, {"time": 9537, "text": "We fight over possessions because we think that we're small little objects inside this preexisting space time."}, {"time": 9547, "text": "We assume that that mansion and that car exists independent of us."}, {"time": 9552, "text": "And that somehow we, these little things can have our sense of self and importance enhanced by having that special car or that special house or that special person."}, {"time": 9563, "text": "When in fact, it's just the opposite."}, {"time": 9566, "text": "You create that mansion every time you look."}, {"time": 9569, "text": "That's, you're something far deeper than that mansion."}, {"time": 9572, "text": "You're the entity which can create that mansion on the fly."}, {"time": 9577, "text": "And there's nothing to the mansion except what you create in this moment."}, {"time": 9581, "text": "So all of a sudden, when you take this point of view, it has all sorts of implications for how we interact with each other, how we treat each other."}, {"time": 9597, "text": "And again, a lot of things that spiritual traditions have said, it's a mixed bag."}, {"time": 9602, "text": "Spiritual traditions are a mixed bag."}, {"time": 9603, "text": "So let me just be right up front about that."}, {"time": 9605, "text": "I'm not promoting any particular, but they do have some insights."}, {"time": 9608, "text": "Yeah, they have wisdom."}, {"time": 9609, "text": "They have certain wisdom."}, {"time": 9610, "text": "They have, I can point to nonsense."}, {"time": 9612, "text": "I won't go into it, but I can also point to lots of nonsense."}, {"time": 9614, "text": "So the issue is to then to look for the key insights."}, {"time": 9619, "text": "And I think they have a lot of insights about the ephemeral nature of objects in space and time and not being attached to them, including our own bodies."}, {"time": 9628, "text": "And reversing that I'm not this little thing, a little consciousness trapped in the body."}, {"time": 9633, "text": "And the consciousness itself is only a product of the body."}, {"time": 9636, "text": "So when the body dies, the consciousness disappears."}, {"time": 9638, "text": "It turns completely around."}, {"time": 9640, "text": "The consciousness is fundamental."}, {"time": 9642, "text": "The body, my hand exists right now because I'm looking at it."}, {"time": 9647, "text": "My hand is gone."}, {"time": 9649, "text": "I have no hand."}, {"time": 9650, "text": "I have no brain."}, {"time": 9652, "text": "I have no heart."}, {"time": 9653, "text": "If you looked, you'll see a heart."}, {"time": 9655, "text": "Whatever I am is this really complicated thing in consciousness."}, {"time": 9663, "text": "All the stuff that I thought I was is something that I create on the fly and delete."}, {"time": 9667, "text": "So this is completely radical restructuring of how we think about possessions, about identity, about survival of death and so forth."}, {"time": 9680, "text": "This is completely transformative."}, {"time": 9682, "text": "But the nice thing is that this whole approach of conscious agents, unlike the spiritual traditions, which have said in some cases similar things, they've said it imprecisely."}, {"time": 9693, "text": "This is mathematics."}, {"time": 9694, "text": "We can actually now begin to state precisely, here's the mathematical model of consciousness, conscious agents, here's how it maps onto space time, which I should sketch really briefly."}, {"time": 9704, "text": "And here's why things are ephemeral and here's why you shouldn't be worried about the ephemeral nature of things because you're not a little tiny entity inside space and time, quite the opposite."}, {"time": 9719, "text": "You're the author of space and time."}, {"time": 9722, "text": "The I and the am and the I am is all kind of emerging through this whole process of evolution and so on that's just surface waves and there's a much deeper ocean that we're trying to figure out here."}, {"time": 9735, "text": "So how does, you said some of the stuff you're thinking about maps to space time, how does it map to space time?"}, {"time": 9741, "text": "So just a very, very high level and I'll keep it brief."}, {"time": 9745, "text": "The structures that the physicists are finding, like the amplituhedron, it turns out they're just static structure, they're polytopes."}, {"time": 9754, "text": "But they, remarkably, most of the information in them is contained in permutation matrices."}, {"time": 9760, "text": "So it's a matrix, like an end by end matrix that just has zeros and ones."}, {"time": 9769, "text": "That contains almost all of the information and you can, they have these plebic graphs and so forth that they use to boot up the scattering."}, {"time": 9776, "text": "You can compute those scattering amplitudes almost entirely from these permutation matrices."}, {"time": 9783, "text": "So that's just, now from my point of view, I have this conscious agent dynamics."}, {"time": 9789, "text": "It turns out that the stationary dynamics that I was talking about, where the entropy isn't increasing, all the stationary dynamics are sketched out by permutation matrices."}, {"time": 9804, "text": "So there's so called Burkhoff polytope."}, {"time": 9807, "text": "All the vertices of this polytope, all the points are permutation matrices."}, {"time": 9813, "text": "All the internal points are Markovian kernels that have the uniform measure as a stationary measure."}, {"time": 9822, "text": "Now I need to intuit a little better what the heck you're talking about."}, {"time": 9826, "text": "So basically, there's some complicated thing going on with the network of conscious agents and that's mappable to this, you're saying a two dimensional matrix that scattering has to do with what?"}, {"time": 9842, "text": "With our perception, like that's like photon stuff?"}, {"time": 9845, "text": "I mean, I don't know if it's useful to sort of dig into detail."}, {"time": 9849, "text": "I'll do just the high level thing."}, {"time": 9851, "text": "So the high level is the long term behavior of the conscious agent dynamics."}, {"time": 9857, "text": "So that's the projection of just looking at the long term behavior."}, {"time": 9860, "text": "I'm hoping we'll give rise to the amplituhedron."}, {"time": 9863, "text": "The amplituhedron then gives rise to space time."}, {"time": 9867, "text": "So then I can just use their link to go all the way from consciousness through its asymptotics to, through the amplituhedron into space time and get the map all the way into our interface."}, {"time": 9877, "text": "And that's why you mentioned the permutation matrix because it gives you a nice thing to try to generate."}, {"time": 9882, "text": "That's right, it's the connection with the amplituhedron."}, {"time": 9884, "text": "The permutation matrices are the core of the amplituhedron and it turns out they're the core of the asymptotic description of the conscious agents."}, {"time": 9892, "text": "So not to sort of bring up the idea of a creator, but I like, first of all, I like video games and you mentioned this kind of simulation idea."}, {"time": 9901, "text": "First of all, do you think of it as an interesting idea, this thought experiment that will live in a simulation?"}, {"time": 9906, "text": "And in general, do you think we'll live in a simulation?"}, {"time": 9910, "text": "So the Nick Bostrom's idea about the simulation is typically couched in a physicalist framework."}, {"time": 9918, "text": "So there is the bottom level, there's some programmer in a physical space time and they have a computer that they've programmed really cleverly where they've created conscious entities."}, {"time": 9930, "text": "So you have the hard problem of consciousness, right?"}, {"time": 9932, "text": "The standard hard problem."}, {"time": 9933, "text": "How could a computer simulation create a conscious, which isn't explained by that simulation theory."}, {"time": 9939, "text": "But then the idea is that the next level, the entities that are created in the first level simulation then can write their own simulations and you get this nesting."}, {"time": 9950, "text": "So the idea that this is a simulation is fine, but the idea that it starts with a physicalist base, I think, isn't fine."}, {"time": 9960, "text": "Well, there's different properties here."}, {"time": 9961, "text": "The partial rendering, and to me that's the interesting idea is not whether the entirety of the universe is simulated, but how efficiently can you create interfaces that are convincing to all other entities that can appreciate such interfaces?"}, {"time": 9984, "text": "How little does it take?"}, {"time": 9985, "text": "Because you said like partial rendering or like temporal, ephemeral rendering of stuff."}, {"time": 9991, "text": "Only render the tree falling in the forest when there's somebody there to see it."}, {"time": 9996, "text": "It's interesting to think, how can you do that super efficiently without having to render everything?"}, {"time": 10001, "text": "And that to me is one perspective on the simulation, just like it is with video games, where a video game doesn't have to render every single thing."}, {"time": 10009, "text": "It's just the thing that the observer is looking at."}, {"time": 10012, "text": "Right, there is actually, that's a very nice question."}, {"time": 10015, "text": "And there's whole groups of researchers that are actually studying in virtual reality, what is the sort of minimal requirements on the system?"}, {"time": 10026, "text": "How does it have to operate to give you an immersion experience, to give you the feeling that you have a body, to get you to take it real?"}, {"time": 10034, "text": "And there's actually a lot of really good work on that right now."}, {"time": 10036, "text": "And it turns out it doesn't take that much."}, {"time": 10038, "text": "You do need to get the perception action loop tight and you have to give them the perceptions that they're expecting if you want them to."}, {"time": 10046, "text": "But if you can lead them along, if you give them perceptions that are close to what they're expecting, you can then maybe move their reality around a bit."}, {"time": 10055, "text": "Yeah, it's a tricky engineering problem, especially when you're trying to create a product that costs little, but that's, it feels like an engineering problem, not a deeply scientific problem."}, {"time": 10066, "text": "Or meaning, obviously it's a scientific problem, but as a scientific problem, it's not that difficult to trick us descendants of apes."}, {"time": 10073, "text": "But here's a case for just us, you know, our own, if this is a virtual reality that we're experiencing right now."}, {"time": 10078, "text": "So here's something you can try for yourself."}, {"time": 10081, "text": "If you just close your eyes and look at your experience in front of you, be aware of your experience in front of you, what you experience is just like a modeled dark gray, where there's all sort of, there's some dynamics to it, but it's just dark gray."}, {"time": 10097, "text": "But now I ask you, instead of having your attention forward, put your attention backward."}, {"time": 10104, "text": "What is it like behind you with your eyes closed?"}, {"time": 10109, "text": "And there, it's like nothing."}, {"time": 10115, "text": "So what is going on here?"}, {"time": 10117, "text": "What am I experiencing back there?"}, {"time": 10124, "text": "Well, it's, I don't know if it's nothing."}, {"time": 10127, "text": "It's like, I guess it's the absence of, it's not even like darkness or something."}, {"time": 10131, "text": "It's not even darkness."}, {"time": 10133, "text": "There's no qualia to it."}, {"time": 10138, "text": "And yet there is a sense of being."}, {"time": 10142, "text": "There's a sense of being back."}, {"time": 10143, "text": "So I close my, when I put my attention forward, I have the qualia of a gray model thing."}, {"time": 10148, "text": "But when I put my attention backward, there's no qualia at all, but there is a sense of being."}, {"time": 10154, "text": "I personally, now you haven't been to that side of the room."}, {"time": 10158, "text": "I have been to that side of the room."}, {"time": 10160, "text": "So for me, memories, I start playing the engine of memory replay, which is like, I take myself back in time and think about that place where I was hanging out in that part."}, {"time": 10174, "text": "That's where I see what I'm behind."}, {"time": 10175, "text": "So that's an interesting quirk of humans too, we're able to, we're collecting these experiences and we can replay them in interesting ways whenever we feel like it."}, {"time": 10184, "text": "And it's almost like being there, but not really, but almost."}, {"time": 10190, "text": "And yet we can go our entire lives in this."}, {"time": 10193, "text": "You're talking about the minimal thing for VR."}, {"time": 10194, "text": "We can go our entire lives and not realize that all of my life, it's been like nothing behind me."}, {"time": 10203, "text": "We're not even aware that all of our lives, if you just pay attention to us behind me, we're like, oh, holy smoke, it's totally scary."}, {"time": 10213, "text": "I mean, it's like nothing."}, {"time": 10214, "text": "There's no qualia there at all."}, {"time": 10216, "text": "How did I not notice that my entire life?"}, {"time": 10218, "text": "We're so immersed in the simulation, we buy it so much."}, {"time": 10221, "text": "Yeah, I mean, you could see this with children, right?"}, {"time": 10224, "text": "Though with persistence, you could do the peekaboo game."}, {"time": 10228, "text": "You can hide from them and appear and they're fully tricked."}, {"time": 10232, "text": "And in the same way, we're fully tricked."}, {"time": 10234, "text": "There's nothing behind us and we assume there is."}, {"time": 10239, "text": "These theories are pretty heavy."}, {"time": 10242, "text": "You as a human being, as a mortal human being, how has these theories been to you personally?"}, {"time": 10249, "text": "Like, are there good days and bad days when you wake up and look in the mirror and the fact that you can't see anything behind you?"}, {"time": 10257, "text": "The fact that it's rendered, like, is there interesting quirks?"}, {"time": 10262, "text": "Nietzsche with his, if you gaze long into the abyss, the abyss gazes into you."}, {"time": 10268, "text": "How has these theories, these ideas, changed you as a person?"}, {"time": 10273, "text": "It's been very, very difficult."}, {"time": 10275, "text": "And this stuff is not just abstract theory building because it's about us."}, {"time": 10281, "text": "Sometimes I realize that there's this big division in me."}, {"time": 10284, "text": "My mind is doing all this science and coming up with these conclusions and the rest of me is not integrating."}, {"time": 10290, "text": "I'm just like, I don't believe it."}, {"time": 10291, "text": "I just don't believe this."}, {"time": 10292, "text": "I mean, it seems, so as I start to take it seriously, I get scared myself."}, {"time": 10297, "text": "It's like, but it's very much, then I read these spiritual traditions and realize they're saying very, very similar things."}, {"time": 10305, "text": "Like, there's a lot of convergence."}, {"time": 10308, "text": "So for me, I have, the first time I thought it might be possible that we're not seeing the truth was in 1986."}, {"time": 10319, "text": "It was from some mathematics we were doing."}, {"time": 10322, "text": "And when that hit me, it hit me like a ton of bricks."}, {"time": 10325, "text": "I had to sit down."}, {"time": 10326, "text": "It was, it really, it was scary."}, {"time": 10331, "text": "It was really a shock to the system."}, {"time": 10334, "text": "And then to realize that everything that has been important to me, like, you know, getting a house, getting a car, getting a reputation and so forth."}, {"time": 10346, "text": "Well, that car is just like the car I see in the virtual reality."}, {"time": 10349, "text": "It's just there when you perceive it and it's not there."}, {"time": 10352, "text": "So the whole question of, you know, what am I doing and why?"}, {"time": 10356, "text": "What's worthwhile doing in life?"}, {"time": 10359, "text": "Clearly, getting a big house and getting a big car."}, {"time": 10366, "text": "I mean, we all knew that we were gonna die."}, {"time": 10368, "text": "So we tend not to know that."}, {"time": 10370, "text": "We tend to hide it, especially when we're young."}, {"time": 10372, "text": "Before age 30, we don't believe we're gonna die."}, {"time": 10374, "text": "But we factually maybe know that you kind of are supposed to, yeah."}, {"time": 10379, "text": "But they'll figure something out and we'll be the generation that is the first one that doesn't have to die."}, {"time": 10384, "text": "That's the kind of thing."}, {"time": 10385, "text": "But when you really face the fact that you're going to die, and then when I start to look at it from this point of view that, well, this thing was an interface to begin with."}, {"time": 10396, "text": "So what I'm really, is what I'm really gonna be doing, just taking off a headset."}, {"time": 10401, "text": "So I've been playing in a virtual reality game all day and I got lost in the game and I was fighting over a Porsche."}, {"time": 10407, "text": "And I shot some guys up and I punctured their tires and I got the Porsche."}, {"time": 10413, "text": "Now I take the headset off and what was that for?"}, {"time": 10415, "text": "Nothing, it was just, it was a data structure and the data structure is gone."}, {"time": 10419, "text": "So all of the wars, the fighting and the reputations and all this stuff, it's just a headset."}, {"time": 10429, "text": "So my theory says that intellectually, my mind, my emotions rebel all over the place."}, {"time": 10437, "text": "It's like I, you know, and so I have to meditate."}, {"time": 10442, "text": "I meditate a lot."}, {"time": 10443, "text": "What percent of the day would you say you spend as a physicalist sort of living life, pretending your car matters, your reputation matters?"}, {"time": 10456, "text": "Like how much, what's that Tom Waits song, I like my town with a little drop of poison."}, {"time": 10462, "text": "How much poison do you allow yourself to have?"}, {"time": 10465, "text": "I think my default mode is physicalist."}, {"time": 10467, "text": "I think that that's just the default."}, {"time": 10470, "text": "When I'm not being conscious, consciously attentive."}, {"time": 10477, "text": "Then intellectually consciously attentive, because if you're just, you're still, if you're tasting coffee and not thinking or drinking or just taking in the sunset, you're not being intellectual, but you're still experiencing it."}, {"time": 10489, "text": "So it's when you turn on the introspective machine, that's when you can start."}, {"time": 10494, "text": "And turn off the thinker, when I actually just start looking without thinking."}, {"time": 10500, "text": "So that's when I feel like I, all of a sudden I'm starting to see through."}, {"time": 10506, "text": "Sort of like, okay, part of the addiction to the interface is all the stories I'm telling about it."}, {"time": 10514, "text": "It's really important for me to get that, really important to do that."}, {"time": 10518, "text": "So I'm telling all these stories and so I'm all wrapped up."}, {"time": 10521, "text": "Almost all of the mind stuff that's going on in my head is about attachment to the interface."}, {"time": 10528, "text": "And so what I found is that the, essentially the only way to really detach from the interface is to literally let go of thoughts altogether."}, {"time": 10544, "text": "And then all of a sudden, even my identity, my whole history, my name, my education, all this stuff is almost irrelevant because it's just now here is the present moment."}, {"time": 10560, "text": "And this is the reality right now."}, {"time": 10563, "text": "And all of that other stuff is an interface story."}, {"time": 10567, "text": "But this conscious experience right now, this is the only reality as far as I can tell."}, {"time": 10574, "text": "The rest of it's a story."}, {"time": 10577, "text": "But that is, again, not my default."}, {"time": 10580, "text": "That is, I have to make a really conscious choice to say, okay, I know intellectually this is all an interface."}, {"time": 10590, "text": "I'm gonna take the headset off and so forth."}, {"time": 10593, "text": "And then immediately sink back into the game and just be out there playing the game and get lost in it."}, {"time": 10599, "text": "So I'm always lost in the game unless I literally consciously choose to stop thinking."}, {"time": 10606, "text": "Isn't it terrifying to acknowledge that, to look beyond the game?"}, {"time": 10617, "text": "It scares the hell out of me."}, {"time": 10619, "text": "It really is scary because I'm so attached."}, {"time": 10623, "text": "I'm attached to this body."}, {"time": 10624, "text": "I'm attached to the interface."}, {"time": 10625, "text": "Are you ever worried about breaking your brain a bit?"}, {"time": 10629, "text": "Meaning like, it's, I mean, some of these ideas, some of these ideas, when you think about reality, even with like Einstein, just realizing, you said interface, just realizing that light, that there's a speed of light and you can't go faster than the speed of light and what kind of things black holes can do with light, even that can mess with your head."}, {"time": 10658, "text": "But that's still space time."}, {"time": 10661, "text": "That's a big mess, but it's still just space time."}, {"time": 10662, "text": "It's still a property of our interface."}, {"time": 10665, "text": "But it's still like, even Einstein realized that this particular thing, some of the stories we tell ourselves is constructing interfaces that are oversimplifying the way things work because it's nice."}, {"time": 10681, "text": "The stories are nice."}, {"time": 10683, "text": "Stories are nice."}, {"time": 10684, "text": "I mean, just like video games, they're nice."}, {"time": 10687, "text": "Right, but Einstein was a realist, right?"}, {"time": 10690, "text": "He was a famous realist in the sense that he was very explicit in a 1935 paper with Podolsky and Rosen, the EPR paper, right?"}, {"time": 10699, "text": "They said, if without in any way disturbing a system, I can predict with probability one, the outcome of a measurement, then there exists in reality that element, right?"}, {"time": 10716, "text": "That value that, and we now know from quantum theory that that's false."}, {"time": 10721, "text": "Einstein's idea of local realism is strictly speaking false."}, {"time": 10727, "text": "And so we can predict, we can set up, in quantum theory, you can set up, and there's a paper by Chris Fuchs, quantum Bayesianism, where he scouts this out."}, {"time": 10738, "text": "It was done by other people, but he gives a good presentation of this, where they have a sequence of something like nine different quantum measurements that you can make."}, {"time": 10745, "text": "And you can predict with probability one what a particular outcome will be, but you can actually prove that it's impossible that the value existed before you made the measurement."}, {"time": 10758, "text": "So you know with probability one what you're gonna get, but you also know with certainty that that value was not there until you made the measurement."}, {"time": 10765, "text": "So we know from quantum theory that the act of observation is an act of fact creation."}, {"time": 10772, "text": "And that is built into what I'm saying with this theory of consciousness."}, {"time": 10776, "text": "If consciousness is fundamental, space time itself is an act of fact creation."}, {"time": 10782, "text": "It's an interface that we create, consciousness creates, plus all the objects in it."}, {"time": 10786, "text": "So local realism is not true."}, {"time": 10790, "text": "Quantum theory has established that."}, {"time": 10791, "text": "Also noncontextual realism is not true."}, {"time": 10794, "text": "And that fits in perfectly with this idea that consciousness is fundamental."}, {"time": 10799, "text": "These things are, these exist as data structures when we create them."}, {"time": 10803, "text": "As Chris Fuchs says, the act of observation is an act of fact creation."}, {"time": 10808, "text": "But I must say on a personal level, I'm having to spend, I spend a couple hours a day just sitting in meditation on this and facing the rebellion in me that goes to the core, it feels like it goes to the core of my being, rebellion against these ideas."}, {"time": 10831, "text": "So here it's very, very interesting for me to look at this because, so here I'm a scientist and I'm a person."}, {"time": 10837, "text": "The science is really clear."}, {"time": 10839, "text": "Local realism is false."}, {"time": 10840, "text": "Noncontextual realism is false."}, {"time": 10842, "text": "Space time is doomed."}, {"time": 10843, "text": "It's very, very clear."}, {"time": 10844, "text": "It couldn't be clearer."}, {"time": 10847, "text": "And my emotions rebel left and right."}, {"time": 10850, "text": "When I sit there and say, okay, I am not something in space and time."}, {"time": 10855, "text": "Something inside of me says, you're crazy."}, {"time": 10857, "text": "Of course you are."}, {"time": 10858, "text": "And I'm completely attached to it."}, {"time": 10860, "text": "I'm completely attached to all this stuff."}, {"time": 10862, "text": "I'm attached to my body."}, {"time": 10862, "text": "I'm attached to the headset."}, {"time": 10864, "text": "I'm attached to my car."}, {"time": 10866, "text": "I'm attached to people."}, {"time": 10867, "text": "I'm attached to all of it."}, {"time": 10869, "text": "And yet I know as an absolute fact, I'm gonna walk away from all of it."}, {"time": 10874, "text": "I'm gonna die."}, {"time": 10879, "text": "In fact, I almost died last year."}, {"time": 10881, "text": "COVID almost killed me."}, {"time": 10884, "text": "I sent a goodbye text to my wife."}, {"time": 10886, "text": "So I thought I was done."}, {"time": 10888, "text": "You really did."}, {"time": 10889, "text": "I sent her a goodbye."}, {"time": 10890, "text": "I was in the emergency room and it had attacked my heart and it had been at 190 beats per minute for 36 hours."}, {"time": 10900, "text": "I couldn't last much longer."}, {"time": 10901, "text": "I knew I couldn't, they couldn't stop it."}, {"time": 10903, "text": "So that was it."}, {"time": 10907, "text": "So I texted her goodbye from the emergency room."}, {"time": 10910, "text": "I love you, goodbye kind of thing."}, {"time": 10913, "text": "Yeah, that was it."}, {"time": 10917, "text": "God, it scares the hell out of you, right?"}, {"time": 10919, "text": "But there was, you're just feeling so bad anyway that sort of you're scared, but you're just feeling so bad that in some sense you just want it to stop anyway."}, {"time": 10930, "text": "So I've been there and faced it just a year ago."}, {"time": 10936, "text": "How did that change you, by the way?"}, {"time": 10938, "text": "Having this intellectual reality that's so challenging that you meditate on, it's just an interface."}, {"time": 10945, "text": "And one of the hardest things to come to terms with is that that means that it's gonna end."}, {"time": 10955, "text": "How did that change you having come so close to the reality of it?"}, {"time": 10958, "text": "It's not just an intellectual reality, it's a reality of death."}, {"time": 10963, "text": "It's forced, I've meditated for 20 years now."}, {"time": 10967, "text": "And I would say averaging three or four hours a day."}, {"time": 10972, "text": "But it's put a new urgency, but urgency is not the right word because it's riveted my attention, I'll put it that way."}, {"time": 10985, "text": "It's really riveted my attention and I've really paid, I spent a lot more time looking up what spiritual traditions say."}, {"time": 10995, "text": "I don't, by the way, again, not taking it with the, take it all with a grain of salt."}, {"time": 11001, "text": "But on the other hand, I think it's stupid for me to ignore it."}, {"time": 11004, "text": "So I try to listen to the best ideas and to sort out nonsense from, and we all have to do it for ourselves, right?"}, {"time": 11015, "text": "So what makes sense?"}, {"time": 11017, "text": "And I have the advantage of some science so I can look at what science says and try to compare with spiritual tradition."}, {"time": 11023, "text": "I try to sort it out for myself."}, {"time": 11026, "text": "But then I also look and realize that there's another aspect to me, which is this whole emotional aspect."}, {"time": 11031, "text": "The, I seem to be wired up as evolutionary psychology says I'm wired up, right?"}, {"time": 11040, "text": "All these defensive mechanisms, you know, I'm inclined to lie if I need to."}, {"time": 11046, "text": "I'm inclined to be angry, to protect myself, to have an in group and an out group, to try to make my reputation as big as possible, to try to demean the out group."}, {"time": 11058, "text": "There's all these things that evolutionary psychology is spot on."}, {"time": 11062, "text": "It's really bright about the human condition."}, {"time": 11065, "text": "And yet I think evolution, as I said, evolutionary theory is a projection of a deeper theory where there may be no competition."}, {"time": 11073, "text": "So how, so I'm in this very interesting position where I feel like, okay, according to my own theory, I'm consciousness."}, {"time": 11082, "text": "And maybe this is what it means for consciousness to wake up."}, {"time": 11088, "text": "It's almost like I have, I feel like I have real skin in the game."}, {"time": 11094, "text": "It really is scary."}, {"time": 11095, "text": "I really was scared when I was about to die."}, {"time": 11098, "text": "It really was hard to say goodbye to my wife."}, {"time": 11102, "text": "It really, it really pained."}, {"time": 11104, "text": "And to then look at that and then look at the fact that I'm gonna walk away from this anyway and it's just an interface."}, {"time": 11112, "text": "How do I, so it's trying to put all this stuff together and really grok it, so to speak, not just intellectually, but grok it at an emotional level."}, {"time": 11122, "text": "Yeah, what are you afraid of, you silly evolved organism that's gotten way too attached to the interface?"}, {"time": 11130, "text": "What are you really afraid of?"}, {"time": 11133, "text": "Is there a..."}, {"time": 11134, "text": "Very personal, you know, it's very, very personal."}, {"time": 11138, "text": "I mean, speaking of the text, what do you think is this whole love thing?"}, {"time": 11143, "text": "What's the role of love in our human condition?"}, {"time": 11149, "text": "This interface thing we have, is this somehow interweaved, interconnected with consciousness?"}, {"time": 11154, "text": "This attachment we have to other humans and this deep, like some quality to it that seems very interesting, peculiar."}, {"time": 11167, "text": "Well, there are two levels I would think about that."}, {"time": 11171, "text": "There's love in the sexual sense and there's love in a deeper sense."}, {"time": 11175, "text": "And in the sexual sense, we can give an evolutionary account of that and so forth."}, {"time": 11180, "text": "And I think that's pretty clear to people."}, {"time": 11184, "text": "In this deeper sense, right?"}, {"time": 11187, "text": "So of course, I love my wife in a sexual sense, but there is a deeper sense as well."}, {"time": 11194, "text": "When I was saying goodbye to her, there was a much deeper love that was really at play there."}, {"time": 11198, "text": "That's one place where I think that the mixed bag from spiritual traditions has something right."}, {"time": 11204, "text": "When they say, love your neighbor as yourself, that in some sense, love is fundamental."}, {"time": 11209, "text": "I think that they're onto something, something very, very deep and profound."}, {"time": 11214, "text": "And every once in a while, I can get a personal glimpse of that, especially when I'm in the space with no thought."}, {"time": 11223, "text": "When I can really let go of thoughts, I get little glimpses of a love in the sense that I'm not separate."}, {"time": 11231, "text": "It's a love in the sense that I'm not different from that."}, {"time": 11238, "text": "If you and I are separate, then I can fight you."}, {"time": 11241, "text": "But if you and I are the same, if there's a union there."}, {"time": 11245, "text": "The togetherness of it, yeah."}, {"time": 11246, "text": "What, who's God?"}, {"time": 11249, "text": "All those gods, the stories that have been told throughout history, you said through the spiritual traditions."}, {"time": 11257, "text": "Is that us trying to find that common thing at the core?"}, {"time": 11264, "text": "Well, in many traditions, not all."}, {"time": 11270, "text": "The one I was raised in, so my dad was a Protestant minister."}, {"time": 11274, "text": "We tend to think of God as a being."}, {"time": 11280, "text": "But I think that that's not right."}, {"time": 11282, "text": "I think the closest way to think about God is being, period."}, {"time": 11286, "text": "Not a being, but being, the very ground of being itself is God."}, {"time": 11292, "text": "I think that's the deep, and from my point of view, that's the ground of consciousness."}, {"time": 11297, "text": "So the ground of conscious being is what we might call God."}, {"time": 11302, "text": "But the word God has always been, for example, you don't believe the same God as my God, so I'm gonna fight you, or we'll have wars over, because the being, the specific being that you call God is different from the being that I call God, and so we fight."}, {"time": 11316, "text": "Whereas if it's not a being, but just being, and you and I share a being, then you and I are not separate, and there's no reason to fight."}, {"time": 11326, "text": "We're both part of that one being, and loving you is loving myself, because we're all part of that one being."}, {"time": 11334, "text": "The spiritual traditions that point to that, I think are pointing in a very interesting direction, and that does seem to match with the mathematics of the conscious agent stuff that I've been working on as well, that it really fits with that, although that wasn't my goal."}, {"time": 11351, "text": "Is there, you mentioned, you mentioned that the young physicists that you talk to, or whose work you follow, have quite a lot of fun breaking with the traditions of the past, the assumptions of the past."}, {"time": 11368, "text": "What advice would you give to young people today, in high school, in college, not just physicists, but in general, how to have a career they can be proud of, how they can have a life they can be proud of, how to make their way in the world, from the lessons, from the wins and the losses in your own life, what little insights could you pull out?"}, {"time": 11390, "text": "I would say the universe is a lot more interesting than you might expect, and you are a lot more special and interesting than you might expect."}, {"time": 11399, "text": "You might think that you're just a little, tiny, irrelevant, 100 pound, 200 pound person in a vast billions of light years across space, and that's not the case."}, {"time": 11415, "text": "You are, in some sense, the being that's creating that space all the time, every time you look."}, {"time": 11421, "text": "So, waking up to who you really are, outside of space and time, as the author of space and time, as the author of everything that you see."}, {"time": 11432, "text": "The author of space and time, sorry."}, {"time": 11436, "text": "You're the author of space and time, and I'm the author of space and time, and space and time is just one little data structure."}, {"time": 11442, "text": "Many other consciousnesses are creating other data structures, they're authors of various other things."}, {"time": 11448, "text": "So, realizing, and then realizing that, I had this feeling growing up, going to college, reading all these textbooks, oh man, it's all been done."}, {"time": 11459, "text": "If I'd just been there 50 years ago, I could have discovered this stuff, but it's all in the textbooks now."}, {"time": 11463, "text": "Well, believe me, the textbooks are gonna look silly in 50 years, and it's your chance to write the new textbook."}, {"time": 11471, "text": "So, of course, study the current textbooks."}, {"time": 11474, "text": "You have to understand them."}, {"time": 11475, "text": "There's no way to progress until you understand what's been done, but then, the only limit is your imagination, frankly."}, {"time": 11486, "text": "That's the only limit."}, {"time": 11486, "text": "The greatest books, the greatest textbooks ever written on Earth are yet to be written."}, {"time": 11496, "text": "What's the meaning of life from your limited interface?"}, {"time": 11500, "text": "Can you figure it all out, like why?"}, {"time": 11503, "text": "So, you said the universe is kind of trying to figure itself out through us."}]}]