[{"title": "Peter Wang: Python and the Source Code of Humans, Computers, and Reality | Lex Fridman Podcast #250", "id": "X0-SXS6zdEQ", "quotes": [{"time": 226, "text": "So, I would say those two are kind of tied for me."}, {"time": 229, "text": "So, the elegance of the NumPy data structure, like slicing through the different multi dimensional."}, {"time": 234, "text": "Yeah, there's just enough things there."}, {"time": 236, "text": "It's like a very, it's a very simple, comfortable tool."}, {"time": 240, "text": "Just, it's easy to reason about what it does when you don't stray too far afield."}, {"time": 245, "text": "Can you put your finger on how to design a language such that it fits in your head?"}, {"time": 251, "text": "Certain things like the colon or the certain notation aspects of Python that just kind of work."}, {"time": 258, "text": "Is it something you have to kind of write out on paper, look and say, it's just right?"}, {"time": 264, "text": "Is it a taste thing or is there a systematic process?"}, {"time": 268, "text": "I think it's more of a taste thing."}, {"time": 271, "text": "But one thing that should be said is that you have to pick your audience, right?"}, {"time": 276, "text": "So, the better defined the user audience is or the users are, the easier it is to build something that fits in their minds because their needs will be more compact and coherent."}, {"time": 287, "text": "It is possible to find a projection, right?"}, {"time": 289, "text": "A compact projection for their needs."}, {"time": 290, "text": "The more diverse the user base, the harder that is."}, {"time": 294, "text": "And so, as Python has grown in popularity, that's also naturally created more complexity as people try to design any given thing."}, {"time": 301, "text": "There'll be multiple valid opinions about a particular design approach."}, {"time": 306, "text": "And so, I do think that's the downside of popularity."}, {"time": 310, "text": "It's almost an intrinsic aspect of the complexity of the problem."}, {"time": 313, "text": "Well, at the very beginning, aren't you an audience of one, isn't ultimately, aren't all the greatest projects in history were just solving a problem that you yourself had?"}, {"time": 321, "text": "Well, so Clay Shirky in his book on crowdsourcing or his kind of thoughts on crowdsourcing, he identifies the first step of crowdsourcing is me first collaboration."}, {"time": 331, "text": "You first have to make something that works well for yourself."}, {"time": 334, "text": "It's very telling that when you look at all of the impactful big project, well, they're fundamental projects now in the SciPy and Pydata ecosystem."}, {"time": 342, "text": "They all started with the people in the domain trying to scratch their own itch."}, {"time": 348, "text": "And the whole idea of scratching your own itch is something that the open source or the free software world has known for a long time."}, {"time": 353, "text": "But in the scientific computing areas, these are assistant professors or electrical engineering grad students."}, {"time": 360, "text": "They didn't have really a lot of programming skill necessarily, but Python was just good enough for them to put something together that fit in their domain, right?"}, {"time": 369, "text": "So it's almost like a, it's a necessity is the mother of invention aspect."}, {"time": 373, "text": "And also it was a really harsh filter for utility and compactness and expressiveness."}, {"time": 380, "text": "Like it was too hard to use, then they wouldn't have built it because that was just too much trouble, right?"}, {"time": 384, "text": "It was a side project for them."}, {"time": 386, "text": "And also necessity creates a kind of deadline."}, {"time": 388, "text": "It seems like a lot of these projects are quickly thrown together in the first step."}, {"time": 392, "text": "And that, even though it's flawed, that just seems to work well for software projects."}, {"time": 398, "text": "Well, it does work well for software projects in general."}, {"time": 401, "text": "And in this particular space, one of my colleagues, Stan Siebert identified this, that all the projects in the SciPy ecosystem, if we just rattle them off, there's NumPy, there's SciPy built by different collaborations of people."}, {"time": 415, "text": "Although Travis is the heart of both of them."}, {"time": 417, "text": "But NumPy coming from numeric and numery, these are different people."}, {"time": 420, "text": "And then you've got Pandas, you've got Jupyter or IPython, there's Matplotlib, there's just so many others, I'm not gonna do justice if I try to name them all."}, {"time": 430, "text": "But all of them are actually different people."}, {"time": 432, "text": "And as they rolled out their projects, the fact that they had limited resources meant that they were humble about scope."}, {"time": 441, "text": "A great famous hacker, Jamie Zawisky, once said that every geek's dream is to build the ultimate middleware, right?"}, {"time": 449, "text": "And the thing is with these scientists turned programmers, they had no such dream."}, {"time": 453, "text": "They were just trying to write something that was a little bit better for what they needed, the MATLAB, and they were gonna leverage what everyone else had built."}, {"time": 459, "text": "So naturally, almost in kind of this annealing process or whatever, we built a very modular cover of the basic needs of a scientific computing library."}, {"time": 470, "text": "If you look at the whole human story, how much of a leap is it?"}, {"time": 473, "text": "We've developed all kinds of languages, all kinds of methodologies for communication."}, {"time": 477, "text": "It just kind of like grew this collective intelligence, civilization grew, it expanded, wrote a bunch of books, and now we tweet how big of a leap is programming if programming is yet another language?"}, {"time": 490, "text": "Is it just a nice little trick that's temporary in our human history, or is it like a big leap in the, almost us becoming another organism at a higher level of abstraction, something else?"}, {"time": 506, "text": "I think the act of programming or using grammatical constructions of some underlying primitives, that is something that humans do learn, but every human learns this."}, {"time": 518, "text": "Anyone who can speak learns how to do this."}, {"time": 521, "text": "What makes programming different has been that up to this point, when we try to give instructions to computing systems, all of our computers, well, actually this is not quite true, but I'll first say it, and then I'll tell you why it's not true."}, {"time": 535, "text": "But for the most part, we can think of computers as being these iterated systems."}, {"time": 538, "text": "So when we program, we're giving very precise instructions to iterated systems that then run at incomprehensible speed and run those instructions."}, {"time": 548, "text": "In my experience, some people are just better equipped to model systematic iterated systems, well, whatever, iterated systems in their head."}, {"time": 560, "text": "Some people are really good at that, and other people are not."}, {"time": 563, "text": "And so when you have like, for instance, sometimes people have tried to build systems that make programming easier by making it visual, drag and drop."}, {"time": 571, "text": "And the issue is you can have a drag and drop thing, but once you start having to iterate the system with conditional logic, handling case statements and branch statements and all these other things, the visual drag and drop part doesn't save you anything."}, {"time": 582, "text": "You still have to reason about this giant iterated system with all these different conditions around it."}, {"time": 586, "text": "That's the hard part, right?"}, {"time": 588, "text": "So handling iterated logic, that's the hard part."}, {"time": 592, "text": "The languages we use then emerge to give us the ability and capability over these things."}, {"time": 597, "text": "Now, the one exception to this rule, of course, is the most popular programming system in the world, which is Excel, which is a data flow and a data driven, immediate mode, data transformation oriented programming system."}, {"time": 608, "text": "And this actually not an accident that that system is the most popular programming system because it's so accessible to a much broader group of people."}, {"time": 616, "text": "I do think as we build future computing systems, you're actually already seeing this a little bit, it's much more about composition of modular blocks."}, {"time": 625, "text": "They themselves actually maintain all their internal state and the interfaces between them are well defined data schemas."}, {"time": 632, "text": "And so to stitch these things together using like IFTTT or Zapier or any of these kind of, I would say compositional scripting kinds of things, I mean, HyperCard was also a little bit in this vein."}, {"time": 644, "text": "That's much more accessible to most people."}, {"time": 647, "text": "It's really that implicit state that's so hard for people to track."}, {"time": 652, "text": "Yeah, okay, so that's modular stuff, but there's also an aspect where you're standing on the shoulders of giants."}, {"time": 655, "text": "So you're building like higher and higher levels of abstraction, but you do that a little bit with language."}, {"time": 662, "text": "So with language, you develop sort of ideas, philosophies from Plato and so on."}, {"time": 667, "text": "And then you kind of leverage those philosophies as you try to have deeper and deeper conversations."}, {"time": 672, "text": "But with programming, it seems like you can build much more complicated systems."}, {"time": 677, "text": "Like without knowing how everything works, you can build on top of the work of others."}, {"time": 681, "text": "And it seems like you're developing more and more sophisticated expressions, ability to express ideas in a computational space."}, {"time": 691, "text": "I think it's worth pondering the difference here between complexity and complication."}, {"time": 700, "text": "Back to Excel."}, {"time": 702, "text": "Well, not quite back to Excel, but the idea is when we have a human conversation, all languages for humans emerged to support human relational communications, which is that the person we're communicating with is a person and they would communicate back to us."}, {"time": 721, "text": "And so we sort of hit a resonance point, right?"}, {"time": 725, "text": "When we actually agree on some concepts."}, {"time": 727, "text": "So there's a messiness to it and there's a fluidity to it."}, {"time": 730, "text": "With computing systems, when we express something to the computer and it's wrong, we just try again."}, {"time": 735, "text": "So we can basically live many virtual worlds of having failed at expressing ourselves to the computer until the one time we expressed ourselves right."}, {"time": 742, "text": "Then we kind of put in production and then discover that it's still wrong a few days down the road."}, {"time": 747, "text": "So I think the sophistication of things that we build with computing, one has to really pay attention to the difference between when an end user is expressing something onto a system that exists versus when they're extending the system to increase the system's capability for someone else to then interface with."}, {"time": 767, "text": "We happen to use the same language for both of those things in most cases, but it doesn't have to be that."}, {"time": 772, "text": "And Excel is actually a great example of this, of kind of a counterpoint to that."}, {"time": 776, "text": "Okay, so what about the idea of, you said messiness."}, {"time": 781, "text": "Wouldn't you put the software 2.0 idea, this idea of machine learning into the further and further steps into the world of messiness."}, {"time": 794, "text": "The same kind of beautiful messiness of human communication."}, {"time": 797, "text": "Isn't that what machine learning is?"}, {"time": 799, "text": "Is building on levels of abstraction that don't have messiness in them, that at the operating system level, then there's Python, the programming languages that have more and more power."}, {"time": 810, "text": "But then finally, there's neural networks that ultimately work with data."}, {"time": 818, "text": "And so the programming is almost in the space of data and the data is allowed to be messy."}, {"time": 822, "text": "Isn't that a kind of program?"}, {"time": 823, "text": "So the idea of software 2.0 is a lot of the programming happens in the space of data, so back to Excel, all roads lead back to Excel, in the space of data and also the hyperparameters of the neural networks."}, {"time": 837, "text": "And all of those allow the same kind of messiness that human communication allows."}, {"time": 844, "text": "It does, but my background is in physics."}, {"time": 847, "text": "I took like two CS courses in college."}, {"time": 849, "text": "So I don't have, now I did cram a bunch of CS in prep when I applied for grad school, but still I don't have a formal background in computer science."}, {"time": 859, "text": "But what I have observed in studying programming languages and programming systems and things like that is that there seems to be this triangle."}, {"time": 867, "text": "It's one of these beautiful little iron triangles that you find in life sometimes."}, {"time": 872, "text": "And it's the connection between the code correctness and kind of expressiveness of code, the semantics of the data, and then the kind of correctness or parameters of the underlying hardware compute system."}, {"time": 884, "text": "So there's the algorithms that you wanna apply, there's what the bits that are stored on whatever media actually represent, so the semantics of the data within the representation, and then there's what the computer can actually do."}, {"time": 899, "text": "And every programming system, every information system ultimately finds some spot in the middle of this little triangle."}, {"time": 907, "text": "Sometimes some systems collapse them into just one edge."}, {"time": 911, "text": "Are we including humans as a system in this?"}, {"time": 913, "text": "No, no, I'm just thinking about computing systems here."}, {"time": 915, "text": "And the reason I bring this up is because I believe there's no free lunch around this stuff."}, {"time": 920, "text": "So if we build machine learning systems to sort of write the correct code that is at a certain level of performance, so it'll sort of select with hyperparameters we can tune kind of how we want the performance boundary in SLA to look like for transforming some set of inputs into certain kinds of outputs."}, {"time": 939, "text": "That training process itself is intrinsically sensitive to the kinds of inputs we put into it."}, {"time": 945, "text": "It's quite sensitive to the boundary conditions we put around the performance."}, {"time": 949, "text": "So I think even as we move to using automated systems to build this transformation, as opposed to humans explicitly from a top down perspective, figuring out, well, this schema and this database and these columns get selected for this algorithm, and here we put a Fibonacci heap for some other thing."}, {"time": 964, "text": "Human design or computer design, ultimately what we hit, the boundaries that we hit with these information systems is when the representation of the data hits the real world is where there's a lot of slop and a lot of interpretation."}, {"time": 977, "text": "And that's where actually I think a lot of the work will go in the future is actually understanding kind of how to better in the view of these live data systems, how to better encode the semantics of the world for those things."}, {"time": 990, "text": "There'll be less of the details of how we write a particular SQL query."}, {"time": 993, "text": "Okay, but given the semantics of the real world and the messiness of that, what does the word correctness mean when you're talking about code?"}, {"time": 1000, "text": "There's a lot of dimensions to correctness."}, {"time": 1002, "text": "Historically, and this is one of the reasons I say that we're coming to the end of the era of software, because for the last 40 years or so, software correctness was really defined about functional correctness."}, {"time": 1014, "text": "I write a function, it's got some inputs, does it produce the right outputs?"}, {"time": 1017, "text": "If so, then I can turn it on, hook it up to the live database and it goes."}, {"time": 1021, "text": "And more and more now we have, I mean, in fact, I think the bright line in the sand between machine learning systems or modern data driven systems versus classical software systems is that the values of the input actually have to be considered with the function together to say this whole thing is correct or not."}, {"time": 1039, "text": "And usually there's a performance SLA as well."}, {"time": 1041, "text": "Like did it actually finish making this?"}, {"time": 1043, "text": "What's SLA?"}, {"time": 1044, "text": "Sorry, service level agreement."}, {"time": 1045, "text": "So it has to return within some time."}, {"time": 1047, "text": "You have a 10 millisecond time budget to return a prediction of this level of accuracy, right?"}, {"time": 1052, "text": "So these are things that were not traditionally in most business computing systems for the last 20 years at all, people didn't think about it."}, {"time": 1059, "text": "But now we have value dependence on functional correctness."}, {"time": 1062, "text": "So that question of correctness is becoming a bigger and bigger question."}, {"time": 1065, "text": "What does that map to the end of software?"}, {"time": 1068, "text": "We've thought about software as just this thing that you can do in isolation with some test trial inputs and in a very sort of sandboxed environment."}, {"time": 1078, "text": "And we can quantify how does it scale?"}, {"time": 1080, "text": "How does it perform?"}, {"time": 1082, "text": "How many nodes do we need to allocate if we wanna scale this many inputs?"}, {"time": 1085, "text": "When we start turning this stuff into prediction systems, real cybernetic systems, you're going to find scenarios where you get inputs that you're gonna wanna spend a little more time thinking about."}, {"time": 1094, "text": "You're gonna find inputs that are not, it's not clear what you should do, right?"}, {"time": 1097, "text": "So then the software has a varying amount of runtime and correctness with regard to input."}, {"time": 1102, "text": "And that is a different kind of system altogether."}, {"time": 1104, "text": "Now it's a full on cybernetic system."}, {"time": 1105, "text": "It's a next generation information system that is not like traditional software systems."}, {"time": 1110, "text": "Can you maybe describe what is a cybernetic system?"}, {"time": 1113, "text": "Do you include humans in that picture?"}, {"time": 1115, "text": "So is a human in the loop kind of complex mess of the whole kind of interactivity of software with the real world or is it something more concrete?"}, {"time": 1124, "text": "Well, when I say cybernetic, I really do mean that the software itself is closing the observe, orient, decide, act loop by itself."}, {"time": 1131, "text": "So humans being out of the loop is the fact what for me makes it a cybernetic system."}, {"time": 1138, "text": "And humans are out of that loop."}, {"time": 1140, "text": "When humans are out of the loop, when the machine is actually sort of deciding on its own what it should do next to get more information, that makes it a cybernetic system."}, {"time": 1149, "text": "So we're just at the dawn of this, right?"}, {"time": 1151, "text": "I think everyone talking about MLAI, it's great."}, {"time": 1155, "text": "But really the thing we should be talking about is when we really enter the cybernetic era and all of the questions of ethics and governance and all correctness and all these things, they really are the most important questions."}, {"time": 1167, "text": "Okay, can we just linger on this?"}, {"time": 1168, "text": "What does it mean for the human to be out of the loop in a cybernetic system, because isn't the cybernetic system that's ultimately accomplishing some kind of purpose that at the bottom, the turtles all the way down, at the bottom turtle is a human."}, {"time": 1184, "text": "Well, the human may have set some criteria, but the human wasn't precise."}, {"time": 1187, "text": "So for instance, I just read the other day that earlier this year, or maybe it was last year at some point, the Libyan army, I think, sent out some automated killer drones with explosives."}, {"time": 1198, "text": "And there was no human in the loop at that point."}, {"time": 1200, "text": "They basically put them in a geofenced area, said find any moving target, like a truck or vehicle that looks like this, and boom."}, {"time": 1207, "text": "That's not a human in the loop, right?"}, {"time": 1209, "text": "So increasingly, the less human there is in the loop, the more concerned you are about these kinds of systems, because there's unintended consequences, like less the original designer and engineer of the system is able to predict, even one with good intent is able to predict the consequences of such a system."}, {"time": 1228, "text": "There are some software systems, right, that run without humans in the loop that are quite complex."}, {"time": 1232, "text": "And that's like the electronic markets."}, {"time": 1234, "text": "And we get flash crashes all the time."}, {"time": 1235, "text": "We get in the heyday of high frequency trading, there's a lot of market microstructure, people doing all sorts of weird stuff that the market designers had never really thought about, contemplated or intended."}, {"time": 1248, "text": "So when we run these full on systems with these automated trading bots, now they become automated killer drones and then all sorts of other stuff."}, {"time": 1257, "text": "We are, that's what I mean by we're at the dawn of the cybernetic era and the end of the era of just pure software."}, {"time": 1263, "text": "Are you more concerned, if you're thinking about cybernetic systems or even like self replicating systems, so systems that aren't just doing a particular task, but are able to sort of multiply and scale in some dimension in the digital or even the physical world."}, {"time": 1280, "text": "Are you more concerned about like the lobster being boiled?"}, {"time": 1284, "text": "So a gradual with us not noticing, collapse of civilization or a big explosion, like oops, kind of a big thing where everyone notices, but it's too late."}, {"time": 1300, "text": "I think that it will be a different experience for different people."}, {"time": 1306, "text": "I do share a common point of view with some of the climate, people who are concerned about climate change and just the big existential risks that we have."}, {"time": 1319, "text": "But unlike a lot of people who share my level of concern, I think the collapse will not be quite so dramatic as some of them think."}, {"time": 1327, "text": "And what I mean is that, I think that for certain tiers of let's say economic class or certain locations in the world, people will experience dramatic collapse scenarios."}, {"time": 1337, "text": "But for a lot of people, especially in the developed world, the realities of collapse will be managed."}, {"time": 1344, "text": "There'll be narrative management around it so that they essentially insulate, the middle class will be used to insulate the upper class from the pitchforks and the flaming torches and everything."}, {"time": 1355, "text": "It's interesting because, so my specific question wasn't as general."}, {"time": 1359, "text": "My question was more about cybernetic systems or software."}, {"time": 1363, "text": "It's interesting, but it would nevertheless perhaps be about class."}, {"time": 1366, "text": "So the effect of algorithms might affect certain classes more than others."}, {"time": 1371, "text": "I was more thinking about whether it's social media algorithms or actual robots, is there going to be a gradual effect on us where we wake up one day and don't recognize the humans we are, or is it something truly dramatic where there's like a meltdown of a nuclear reactor kind of thing, Chernobyl, like catastrophic events that are almost bugs in a program that scaled itself too quickly?"}, {"time": 1401, "text": "Yeah, I'm not as concerned about the visible stuff."}, {"time": 1406, "text": "And the reason is because the big visible explosions, I mean, this is something I said about social media is that at least with nuclear weapons, when a nuke goes off, you can see it and you're like, well, that's really, wow, that's kind of bad, right?"}, {"time": 1417, "text": "I mean, Oppenheimer was reciting the Bhagavad Gita, right?"}, {"time": 1420, "text": "When he saw one of those things go off."}, {"time": 1422, "text": "So we can see nukes are really bad."}, {"time": 1425, "text": "He's not reciting anything about Twitter."}, {"time": 1428, "text": "Well, but right, but then when you have social media, when you have all these different things that conspire to create a layer of virtual experience for people that alienates them from reality and from each other, that's very pernicious, that's impossible to see, right?"}, {"time": 1443, "text": "And it kind of slowly gets in there, so."}, {"time": 1447, "text": "You've written about this idea of virtuality on this topic, which you define as the subjective phenomenon of knowingly engaging with virtual sensation and perception and suspending or forgetting the context that it's simulacrum."}, {"time": 1462, "text": "So let me ask, what is real?"}, {"time": 1466, "text": "Is there a hard line between reality and virtuality?"}, {"time": 1470, "text": "Like perception drifts from some kind of physical reality."}, {"time": 1473, "text": "We have to kind of have a sense of what is the line that's too, we've gone too far."}, {"time": 1478, "text": "For me, it's not about any hard line about physical reality as much as a simple question of, does the particular technology help people connect in a more integral way with other people, with their environment, with all of the full spectrum of things around them?"}, {"time": 1498, "text": "So it's less about, oh, this is a virtual thing and this is a hard real thing, more about when we create virtual representations of the real things, always some things are lost in translation."}, {"time": 1510, "text": "Usually many, many dimensions are lost in translation."}, {"time": 1514, "text": "We're now coming to almost two years of COVID, people on Zoom all the time."}, {"time": 1517, "text": "You know it's different when you meet somebody in person than when you see them on, I've seen you on YouTube lots, right?"}, {"time": 1522, "text": "But then seeing a person is very different."}, {"time": 1524, "text": "And so I think when we engage in virtual experiences all the time, and we only do that, there is absolutely a level of embodiment."}, {"time": 1534, "text": "There's a level of embodied experience and participatory interaction that is lost."}, {"time": 1540, "text": "And it's very hard to put your finger on exactly what it is."}, {"time": 1542, "text": "It's hard to say, oh, we're gonna spend $100 million building a new system that captures this 5% better, higher fidelity human expression."}, {"time": 1551, "text": "No one's gonna pay for that, right?"}, {"time": 1552, "text": "So when we rush madly into a world of simulacrum and virtuality, the things that are lost are, it's difficult."}, {"time": 1564, "text": "Once everyone moves there, it can be hard to look back and see what we've lost."}, {"time": 1568, "text": "So is it irrecoverably lost?"}, {"time": 1570, "text": "Or rather, when you put it all on the table, is it possible for more to be gained than is lost?"}, {"time": 1577, "text": "If you look at video games, they create virtual experiences that are surreal and can bring joy to a lot of people, can connect a lot of people, and can get people to talk a lot of trash."}, {"time": 1589, "text": "So they can bring out the best and the worst in people."}, {"time": 1592, "text": "So is it possible to have a future world where the pros outweigh the cons?"}, {"time": 1599, "text": "I mean, it's possible to have that in the current world."}, {"time": 1601, "text": "But when literally trillions of dollars of capital are tied to using those things to groom the worst of our inclinations and to attack our weaknesses in the limbic system to create these things into id machines versus connection machines, then those good things don't stand a chance."}, {"time": 1623, "text": "Can you make a lot of money by building connection machines?"}, {"time": 1626, "text": "Is it possible, do you think, to bring out the best in human nature to create fulfilling connections and relationships in the digital world and make a shit ton of money?"}, {"time": 1638, "text": "If I figure it out, I'll let you know."}, {"time": 1641, "text": "But what's your intuition without concretely knowing what's the solution?"}, {"time": 1644, "text": "My intuition is that a lot of our digital technologies give us the ability to have synthetic connections or to experience virtuality."}, {"time": 1653, "text": "They have co evolved with sort of the human expectations."}, {"time": 1658, "text": "It's sort of like sugary drinks."}, {"time": 1660, "text": "As people have more sugary drinks, they need more sugary drinks to get that same hit, right?"}, {"time": 1665, "text": "So with these virtual things and with TV and fast cuts and TikToks and all these different kinds of things, we're co creating essentially humanity that sort of asks and needs those things."}, {"time": 1677, "text": "And now it becomes very difficult to get people to slow down."}, {"time": 1680, "text": "It gets difficult for people to hold their attention on slow things and actually feel that embodied experience."}, {"time": 1687, "text": "So mindfulness now more than ever is so important in schools and as a therapy technique for people because our environment has been accelerated."}, {"time": 1695, "text": "And McLuhan actually talks about this in the electric environment of the television."}, {"time": 1699, "text": "And that was before TikTok and before front facing cameras."}, {"time": 1702, "text": "So I think for me, the concern is that it's not like we can ever switch to doing something better, but more of the humans and technology, they're not independent of each other."}, {"time": 1713, "text": "The technology that we use kind of molds what we need for the next generation of technology."}, {"time": 1719, "text": "Yeah, but humans are intelligent and they're introspective and they can reflect on the experiences of their life."}, {"time": 1725, "text": "So for example, there's been many years in my life where I ate an excessive amount of sugar."}, {"time": 1730, "text": "And then a certain moment I woke up and said, why do I keep doing this?"}, {"time": 1735, "text": "This doesn't feel good."}, {"time": 1737, "text": "Like longterm."}, {"time": 1739, "text": "And I think, so going through the TikTok process of realizing, okay, when I shorten my attention span, actually that does not make me feel good longer term."}, {"time": 1750, "text": "And realizing that and then going to platforms, going to places that are away from the sugar."}, {"time": 1758, "text": "So in so doing, you can create platforms that can make a lot of money to help people wake up to what actually makes them feel good longterm."}, {"time": 1766, "text": "Develop, grow as human beings."}, {"time": 1768, "text": "And it just feels like humans are more intelligent than mice looking for cheese."}, {"time": 1775, "text": "They're able to sort of think, I mean, we can contemplate our own mortality."}, {"time": 1779, "text": "We can contemplate things like longterm love and we can have a longterm fear of certain things like mortality."}, {"time": 1788, "text": "We can contemplate whether the experiences, the sort of the drugs of daily life that we've been partaking in is making us happier, better people."}, {"time": 1798, "text": "And then once we contemplate that, we can make financial decisions in using services and paying for services that are making us better people."}, {"time": 1806, "text": "So it just seems that we're in the very first stages of social networks that just were able to make a lot of money really quickly, but in bringing out sometimes the bad parts of human nature, they didn't destroy humans."}, {"time": 1823, "text": "They just fed everybody a lot of sugar."}, {"time": 1826, "text": "And now everyone's gonna wake up and say, hey, we're gonna start having like sugar free social media."}, {"time": 1833, "text": "Well, there's a lot to unpack there."}, {"time": 1834, "text": "I think some people certainly have the capacity for that."}, {"time": 1837, "text": "And I certainly think, I mean, it's very interesting even the way you said it, you woke up one day and you thought, well, this doesn't feel very good."}, {"time": 1844, "text": "Well, it's still your limbic system saying this doesn't feel very good, right?"}, {"time": 1847, "text": "You have a cat brain's worth of neurons around your gut, right?"}, {"time": 1850, "text": "And so maybe that saturated and that was telling you, hey, this isn't good."}, {"time": 1855, "text": "Humans are more than just mice looking for cheese or monkeys looking for sex and power, right?"}, {"time": 1861, "text": "Let's slow down."}, {"time": 1862, "text": "Now a lot of people would argue with you on that one, but yes."}, {"time": 1866, "text": "Well, we're more than just that, but we're at least that."}, {"time": 1868, "text": "And we're very, very seldom not that."}, {"time": 1871, "text": "So I don't actually disagree with you that we could be better and that better platforms exist."}, {"time": 1878, "text": "And people are voluntarily noping out of things like Facebook and noping out."}, {"time": 1881, "text": "That's an awesome verb."}, {"time": 1882, "text": "It's a great term."}, {"time": 1884, "text": "I use it all the time."}, {"time": 1885, "text": "You're welcome, Mike."}, {"time": 1886, "text": "I'm gonna have to nope out of that."}, {"time": 1887, "text": "I'm gonna have to nope out of that, right?"}, {"time": 1888, "text": "It's gonna be a hard pass and that's great."}, {"time": 1892, "text": "But that's again, to your point, that's the first generation of front facing cameras of social pressures."}, {"time": 1898, "text": "And you as a self starter, self aware adult have the capacity to say, yeah, I'm not gonna do that."}, {"time": 1906, "text": "I'm gonna go and spend time on long form reads."}, {"time": 1908, "text": "I'm gonna spend time managing my attention."}, {"time": 1910, "text": "I'm gonna do some yoga."}, {"time": 1912, "text": "If you're a 15 year old in high school and your entire social environment is everyone doing these things, guess what you're gonna do?"}, {"time": 1919, "text": "You're gonna kind of have to do that because your limbic system says, hey, I need to get the guy or the girl or the whatever."}, {"time": 1924, "text": "And that's what I'm gonna do."}, {"time": 1925, "text": "And so one of the things that we have to reason about here is the social media systems or social media, I think is our first encounter with a technological system that runs a bit of a loop around our own cognition and attention."}, {"time": 1941, "text": "It's not the last, it's far from the last."}, {"time": 1945, "text": "And it gets to the heart of some of the philosophical Achilles heel of the Western philosophical system, which is each person gets to make their own determination."}, {"time": 1954, "text": "Each person is an individual that's sacrosanct in their agency and their sovereignty and all these things."}, {"time": 1959, "text": "The problem with these systems is they come down and they are able to make their own decisions."}, {"time": 1964, "text": "They come down and they are able to manage everyone on mass."}, {"time": 1968, "text": "And so every person is making their own decision, but together the bigger system is causing them to act with a group dynamic that's very profitable for people."}, {"time": 1978, "text": "So this is the issue that we have is that our philosophies are actually not geared to understand what is it for a person to have a high trust connection as part of a collective and for that collective to have its right to coherency and agency."}, {"time": 1996, "text": "That's something like when a social media app causes a family to break apart, it's done harm to more than just individuals, right?"}, {"time": 2004, "text": "So that concept is not something we really talk about or think about very much, but that's actually the problem is that we're vaporizing molecules into atomic units and then we're hitting all the atoms with certain things."}, {"time": 2015, "text": "That's like, yeah, well, that person chose to look at my app."}, {"time": 2018, "text": "So our understanding of human nature at the individual level, it emphasizes the individual too much because ultimately society operates at the collective level."}, {"time": 2027, "text": "And these apps do as well."}, {"time": 2028, "text": "And the apps do as well."}, {"time": 2029, "text": "So for us to understand the progression and the development of this organism we call human civilization, we have to think at the collective level too."}, {"time": 2038, "text": "I would say multi tiered."}, {"time": 2039, "text": "Multi tiered."}, {"time": 2040, "text": "So individual as well."}, {"time": 2041, "text": "Individuals, family units, social collectives and all the way up."}, {"time": 2046, "text": "Okay, so you've said that individual humans are multi layered susceptible to signals and waves and multiple strata, the physical, the biological, social, cultural, intellectual."}, {"time": 2056, "text": "So sort of going along these lines, can you describe the layers of the cake that is a human being and maybe the human collective, human society?"}, {"time": 2069, "text": "So I'm just stealing wholesale here from Robert Persig, who is the author of Zen and the Art of Motorcycle Maintenance and his follow on book has a sequel to it called Lila."}, {"time": 2080, "text": "He goes into this in a little more detail."}, {"time": 2082, "text": "But it's a crude approach to thinking about people."}, {"time": 2087, "text": "But I think it's still an advancement over traditional subject object metaphysics, where we look at people as a dualist would say, well, is your mind, your consciousness, is that just merely the matter that's in your brain or is there something kind of more beyond that?"}, {"time": 2103, "text": "And they would say, yes, there's a soul, sort of ineffable soul beyond just merely the physical body."}, {"time": 2109, "text": "And I'm not one of those people."}, {"time": 2111, "text": "I think that we don't have to draw a line between are things only this or only that."}, {"time": 2116, "text": "Collectives of things can emerge structures and patterns that are just as real as the underlying pieces."}, {"time": 2122, "text": "But they're transcendent, but they're still of the underlying pieces."}, {"time": 2126, "text": "So your body is this way."}, {"time": 2128, "text": "I mean, we just know physically you consist of atoms and whatnot."}, {"time": 2132, "text": "And then the atoms are arranged into molecules which then arrange into certain kinds of structures that seem to have a homeostasis to them."}, {"time": 2139, "text": "We call them cells."}, {"time": 2140, "text": "And those cells form sort of biological structures."}, {"time": 2144, "text": "Those biological structures give your body its physical ability and the biological ability to consume energy and to maintain homeostasis."}, {"time": 2151, "text": "But humans are social animals."}, {"time": 2154, "text": "I mean, human by themselves is not very long for the world."}, {"time": 2157, "text": "So part of our biology is why are two connect to other people?"}, {"time": 2162, "text": "From the mirror neurons to our language centers and all these other things."}, {"time": 2166, "text": "So we are intrinsically, there's a layer, there's a part of us that wants to be part of a thing."}, {"time": 2172, "text": "If we're around other people, not saying a word, but they're just up and down jumping and dancing, laughing, we're going to feel better."}, {"time": 2178, "text": "And there was no exchange of physical anything."}, {"time": 2181, "text": "They didn't give us like five atoms of happiness."}, {"time": 2184, "text": "But there's an induction in our own sense of self that is at that social level."}, {"time": 2189, "text": "And then beyond that, Persick puts the intellectual level kind of one level higher than social."}, {"time": 2195, "text": "I think they're actually more intertwined than that."}, {"time": 2197, "text": "But the intellectual level is the level of pure ideas."}, {"time": 2201, "text": "That you are a vessel for memes."}, {"time": 2202, "text": "You're a vessel for philosophies."}, {"time": 2205, "text": "You will conduct yourself in a particular way."}, {"time": 2207, "text": "I mean, I think part of this is if we think about it from a physics perspective, you're not, there's the joke that physicists like to approximate things."}, {"time": 2215, "text": "And we'll say, well, approximate a spherical cow, right?"}, {"time": 2217, "text": "You're not a spherical cow, you're not a spherical human."}, {"time": 2219, "text": "You're a messy human."}, {"time": 2220, "text": "And we can't even say what the dynamics of your emotion will be unless we analyze all four of these layers, right?"}, {"time": 2228, "text": "If you're Muslim at a certain time of day, guess what?"}, {"time": 2231, "text": "You're going to be on the ground kneeling and praying, right?"}, {"time": 2234, "text": "And that has nothing to do with your biological need to get on the ground or physics of gravity."}, {"time": 2238, "text": "It is an intellectual drive that you have."}, {"time": 2240, "text": "It's a cultural phenomenon and an intellectual belief that you carry."}, {"time": 2243, "text": "So that's what the four layered stack is all about."}, {"time": 2248, "text": "It's that a person is not only one of these things, they're all of these things at the same time."}, {"time": 2251, "text": "It's a superposition of dynamics that run through us that make us who we are."}, {"time": 2257, "text": "So no layer is special."}, {"time": 2260, "text": "Not so much no layer is special, each layer is just different."}, {"time": 2264, "text": "But we are."}, {"time": 2265, "text": "Each layer gets the participation trophy."}, {"time": 2268, "text": "Yeah, each layer is a part of what you are."}, {"time": 2270, "text": "You are a layer cake, right, of all these things."}, {"time": 2272, "text": "And if we try to deny, right, so many philosophies do try to deny the reality of some of these things, right?"}, {"time": 2278, "text": "Some people will say, well, we're only atoms."}, {"time": 2281, "text": "Well, we're not only atoms because there's a lot of other things that are only atoms."}, {"time": 2284, "text": "I can reduce a human being to a bunch of soup and they're not the same thing, even though it's the same atoms."}, {"time": 2289, "text": "So I think the order and the patterns that emerge within humans to understand, to really think about what a next generation philosophy would look like, that would allow us to reason about extending humans into the digital realm or to interact with autonomous intelligences that are not biological in nature."}, {"time": 2307, "text": "We really need to appreciate these, that human, what human beings actually are is the superposition of these different layers."}, {"time": 2314, "text": "You mentioned consciousness."}, {"time": 2316, "text": "Are each of these layers of cake conscious?"}, {"time": 2319, "text": "Is consciousness a particular quality of one of the layers?"}, {"time": 2323, "text": "Is there like a spike if you have a consciousness detector at these layers or is something that just permeates all of these layers and just takes different form?"}, {"time": 2331, "text": "I believe what humans experience as consciousness is something that sits on a gradient scale of a general principle in the universe that seems to look for order and reach for order when there's an excess of energy."}, {"time": 2346, "text": "You know, it would be odd to say a proton is alive, right?"}, {"time": 2349, "text": "It'd be odd to say like this particular atom or molecule of hydrogen gas is alive, but there's certainly something we can make assemblages of these things that have autopoetic aspects to them that will create structures that will, you know, crystalline solids will form very interesting and beautiful structures."}, {"time": 2369, "text": "This gets kind of into weird mathematical territories."}, {"time": 2373, "text": "You start thinking about Penrose and Game of Life stuff about the generativity of math itself, like the hyperreal numbers, things like that."}, {"time": 2379, "text": "But without going down that rabbit hole, I would say that there seems to be a tendency in the world that when there is excess energy, things will structure and pattern themselves."}, {"time": 2391, "text": "And they will then actually furthermore try to create an environment that furthers their continued stability."}, {"time": 2398, "text": "It's the concept of externalized extended phenotype or niche construction."}, {"time": 2402, "text": "So this is ultimately what leads to certain kinds of amino acids forming certain kinds of structures and so on and so forth until you get the ladder of life."}, {"time": 2411, "text": "So what we experience as consciousness, no, I don't think cells are conscious at that level, but is there something beyond mere equilibrium state biology and chemistry and biochemistry that drives what makes things work?"}, {"time": 2427, "text": "So Adrian Bajan has his ConstructoLaw."}, {"time": 2429, "text": "There's other things you can look at."}, {"time": 2431, "text": "When you look at the life sciences and you look at any kind of statistical physics and statistical mechanics, when you look at things far out of equilibrium, when you have excess energy, what happens then?"}, {"time": 2443, "text": "Life doesn't just make a hotter soup."}, {"time": 2445, "text": "It starts making structure."}, {"time": 2447, "text": "There's something there."}, {"time": 2448, "text": "The poetry of reaches for order when there's an excess of energy."}, {"time": 2454, "text": "Because you brought up game of life."}, {"time": 2457, "text": "You did it, not me."}, {"time": 2459, "text": "I love cellular automata, so I have to sort of linger on that for a little bit."}, {"time": 2466, "text": "So cellular automata, I guess, or game of life is a very simple example of reaching for order when there's an excess of energy."}, {"time": 2474, "text": "Or reaching for order and somehow creating complexity."}, {"time": 2477, "text": "Within this explosion of just turmoil, somehow trying to construct structures."}, {"time": 2485, "text": "And in so doing, create very elaborate organism looking type things."}, {"time": 2492, "text": "What intuition do you draw from this simple mechanism?"}, {"time": 2495, "text": "Well, I like to turn that around its head."}, {"time": 2497, "text": "And look at it as what if every single one of the patterns created life, or created, not life, but created interesting patterns?"}, {"time": 2507, "text": "Because some of them don't."}, {"time": 2508, "text": "And sometimes you make cool gliders."}, {"time": 2510, "text": "And other times, you start with certain things and you make gliders and other things that then construct like AND gates and NOT gates, right?"}, {"time": 2517, "text": "And you build computers on them."}, {"time": 2519, "text": "All of these rules that create these patterns that we can see, those are just the patterns we can see."}, {"time": 2524, "text": "What if our subjectivity is actually limiting our ability to perceive the order in all of it?"}, {"time": 2531, "text": "What if some of the things that we think are random are actually not that random?"}, {"time": 2533, "text": "We're simply not integrating at a final level across a broad enough time horizon."}, {"time": 2538, "text": "And this is again, I said, we go down the rabbit holes and the Penrose stuff or like Wolfram's explorations on these things."}, {"time": 2544, "text": "There is something deep and beautiful in the mathematics of all this."}, {"time": 2548, "text": "That is hopefully one day I'll have enough money to work and retire and just ponder those questions."}, {"time": 2553, "text": "But there's something there."}, {"time": 2554, "text": "But you're saying there's a ceiling to, when you have enough money and you retire and you ponder, there's a ceiling to how much you can truly ponder because there's cognitive limitations in what you're able to perceive as a pattern."}, {"time": 2567, "text": "And maybe mathematics extends your perception capabilities, but it's still finite."}, {"time": 2573, "text": "It's just like."}, {"time": 2575, "text": "Yeah, the mathematics we use is the mathematics that can fit in our head."}, {"time": 2580, "text": "Did God really create the integers?"}, {"time": 2582, "text": "Or did God create all of it?"}, {"time": 2583, "text": "And we just happen at this point in time to be able to perceive integers."}, {"time": 2587, "text": "Well, he just did the positive in it."}, {"time": 2589, "text": "She, I just said, did she create all of it?"}, {"time": 2591, "text": "And then we."}, {"time": 2594, "text": "She just created the natural numbers and then we screwed it all up with zero and then I guess."}, {"time": 2598, "text": "But we did, we created mathematical operations so that we can have iterated steps to approach bigger problems, right?"}, {"time": 2606, "text": "I mean, the entire point of the Arabic Neural System and it's a rubric for mapping a certain set of operations, folding them into a simple little expression, but that's just the operations that we can fit in our heads."}, {"time": 2618, "text": "There are many other operations besides, right?"}, {"time": 2621, "text": "The thing that worries me the most about aliens and humans is that the aliens are all around us and we're too dumb."}, {"time": 2631, "text": "To see them."}, {"time": 2632, "text": "Oh, certainly, yeah."}, {"time": 2633, "text": "Or life, let's say just life, life of all kinds of forms or organisms."}, {"time": 2638, "text": "You know what, just even the intelligence of organisms is imperceptible to us because we're too dumb and self centered."}, {"time": 2647, "text": "Well, we're looking for a particular kind of thing."}, {"time": 2650, "text": "When I was at Cornell, I had a lovely professor of Asian religions, Jane Marie Law, and she would tell this story about a musical, a musician, a Western musician who went to Japan and he taught classical music and could play all sorts of instruments."}, {"time": 2664, "text": "He went to Japan and he would ask people, he would basically be looking for things in the style of a Western chromatic scale and these kinds of things."}, {"time": 2674, "text": "And then finding none of it, he would say, well, there's really no music in Japan, but they're using a different scale."}, {"time": 2678, "text": "They're playing different kinds of instruments, right?"}, {"time": 2680, "text": "The same thing she was using as a sort of a metaphor for religion as well."}, {"time": 2683, "text": "In the West, we center a lot of religion, certainly the religions of Abraham, we center them around belief."}, {"time": 2690, "text": "And in the East, it's more about practice, right?"}, {"time": 2692, "text": "Spirituality and practice rather than belief."}, {"time": 2694, "text": "So anyway, the point is here to your point, life, we, I think so many people are so fixated on certain aspects of self replication or homeostasis or whatever."}, {"time": 2706, "text": "But if we kind of broaden and generalize this thing of things reaching for order, under which conditions can they then create an environment that sustains that order, that allows them, the invention of death is an interesting thing."}, {"time": 2720, "text": "There are some organisms on earth that are thousands of years old."}, {"time": 2723, "text": "And it's not like they're incredibly complex, they're actually simpler than the cells that comprise us, but they never die."}, {"time": 2729, "text": "So at some point, death was invented, somewhere along the eukaryotic scale, I mean, even the protists, right?"}, {"time": 2735, "text": "There's death."}, {"time": 2737, "text": "And why is that along with the sexual reproduction, right?"}, {"time": 2741, "text": "There is something about the renewal process, something about the ability to respond to a changing environment, where it just becomes, just killing off the old generation and letting new generations try, seems to be the best way to fit into the niche."}, {"time": 2757, "text": "Human historians seems to write about wheels and fires, the greatest inventions, but it seems like death and sex are pretty good."}, {"time": 2764, "text": "And they're kind of essential inventions at the very beginning."}, {"time": 2767, "text": "At the very beginning, yeah."}, {"time": 2768, "text": "Well, we didn't invent them, right?"}, {"time": 2770, "text": "Well, Broad, you didn't invent them."}, {"time": 2773, "text": "I see us as one, you particular Homo sapiens did not invent them, but we together, it's a team project, just like you're saying."}, {"time": 2781, "text": "I think the greatest Homo sapiens invention is collaboration."}, {"time": 2785, "text": "So when you say collaboration, Peter, where do ideas come from and how do they take hold in society?"}, {"time": 2795, "text": "Is that the nature of collaboration?"}, {"time": 2796, "text": "Is that the basic atom of collaboration is ideas?"}, {"time": 2800, "text": "It's not not ideas, but it's not only ideas."}, {"time": 2803, "text": "There's a book I just started reading called Death From A Distance."}, {"time": 2805, "text": "Have you heard of this?"}, {"time": 2807, "text": "It's a really fascinating thesis, which is that humans are the only conspecific, the only species that can kill other members of the species from range."}, {"time": 2818, "text": "And maybe there's a few exceptions, but if you look in the animal world, you see like pronghorns butting heads, right?"}, {"time": 2823, "text": "You see the alpha lion and the beta lion and they take each other down."}, {"time": 2827, "text": "Humans, we developed the ability to chuck rocks at each other, well, at prey, but also at each other."}, {"time": 2831, "text": "And that means the beta male can chunk a rock at the alpha male and take them down."}, {"time": 2837, "text": "And he can throw a lot of rocks actually, miss a bunch of times, but just hit once and be good."}, {"time": 2842, "text": "So this ability to actually kill members of our own species from range without a threat of harm to ourselves created essentially mutually assured destruction where we had to evolve cooperation."}, {"time": 2854, "text": "If we didn't, then if we just continue to try to do, like I'm the biggest monkey in the tribe and I'm gonna own this tribe and you have to go, if we do it that way, then those tribes basically failed."}, {"time": 2866, "text": "And the tribes that persisted and that have now given rise to the modern Homo sapiens are the ones where respecting the fact that we can kill each other from a range without harm, like there's an asymmetric ability to snipe the leader from range."}, {"time": 2880, "text": "That meant that we sort of had to learn how to cooperate with each other, right?"}, {"time": 2885, "text": "Come back here, don't throw that rock at me."}, {"time": 2886, "text": "Let's talk our differences out."}, {"time": 2887, "text": "So violence is also part of collaboration."}, {"time": 2890, "text": "The threat of violence, let's say."}, {"time": 2892, "text": "Well, the recognition, maybe the better way to put it is the recognition that we have more to gain by working together than the prisoner's dilemma of both of us defecting."}, {"time": 2903, "text": "So mutually assured destruction in all its forms is part of this idea of collaboration."}, {"time": 2908, "text": "Well, and Eric Weinstein talks about our nuclear peace, right, I mean, it kind of sucks with thousands of warheads aimed at each other, we mean Russia and the US, but it's like, on the other hand, we only fought proxy wars, right?"}, {"time": 2919, "text": "We did not have another World War III of like hundreds of millions of people dying to like machine gun fire and giant guided missiles."}, {"time": 2927, "text": "So the original nuclear weapon is a rock that we learned how to throw, essentially?"}, {"time": 2932, "text": "The original, yeah, well, the original scope of the world for any human being was their little tribe."}, {"time": 2938, "text": "I would say it still is for the most part."}, {"time": 2940, "text": "Eric Weinstein speaks very highly of you, which is very surprising to me at first because I didn't know there's this depth to you because I knew you as an amazing leader of engineers and an engineer yourself and so on, so it's fascinating."}, {"time": 2958, "text": "Maybe just as a comment, a side tangent that we can take, what's your nature of your friendship with Eric Weinstein?"}, {"time": 2967, "text": "How did the two, how did such two interesting paths cross?"}, {"time": 2970, "text": "Is it your origins in physics?"}, {"time": 2972, "text": "Is it your interest in philosophy and the ideas of how the world works?"}, {"time": 2978, "text": "It's very random, Eric found me."}, {"time": 2980, "text": "He actually found Travis and I. Travis Oliphant."}, {"time": 2984, "text": "Oliphant, yeah, we were both working at a company called Enthought back in the mid 2000s and we were doing a lot of consulting around scientific Python and we'd made some tools and Eric was trying to use some of these Python tools to visualize, he had a fiber bundle approach to modeling certain aspects of economics."}, {"time": 3003, "text": "He was doing this and that's how he kind of got in touch with us and so."}, {"time": 3006, "text": "This was in the early."}, {"time": 3008, "text": "This was mid 2000s, oh seven timeframe, oh six, oh seven."}, {"time": 3013, "text": "Eric Weinstein trying to use Python."}, {"time": 3016, "text": "Right, to visualize fiber bundles."}, {"time": 3018, "text": "Using some of the tools that we had built in the open source."}, {"time": 3021, "text": "That's somehow entertaining to me, the thought of that."}, {"time": 3024, "text": "It's very funny but then we met with him a couple times, a really interesting guy and then in the wake of the oh seven, oh eight kind of financial collapse, he helped organize with Lee Smolin a symposium at the Perimeter Institute about okay, well clearly, big finance can't be trusted, government's in its pockets with regulatory capture, what the F do we do?"}, {"time": 3045, "text": "And all sorts of people, Nassim Tlaib was there and Andy Lowe from MIT was there and Bill Janeway, I mean just a lot of top billing people were there and he invited me and Travis and another one of our coworkers, Robert Kern, who is anyone in the SciPy, NumPy community knows Robert."}, {"time": 3063, "text": "Really great guy."}, {"time": 3064, "text": "So the three of us also got invited to go to this thing and that's where I met Brett Weinstein for the first time as well."}, {"time": 3069, "text": "Yeah, I knew him before he got all famous for unfortunate reasons, I guess."}, {"time": 3073, "text": "But anyway, so we met then and kind of had a friendship throughout since then."}, {"time": 3081, "text": "You have a depth of thinking that kind of runs with Eric in terms of just thinking about the world deeply and thinking philosophically and then there's Eric's interest in programming."}, {"time": 3093, "text": "I actually have never, you know, he'll bring up programming to me quite a bit as a metaphor for stuff."}, {"time": 3101, "text": "But I never kind of pushed the point of like, what's the nature of your interest in programming?"}, {"time": 3106, "text": "I think he saw it probably as a tool."}, {"time": 3109, "text": "That you visualize, to explore mathematics and explore physics and I was wondering like, what's his depth of interest and also his vision for what programming would look like in the future."}, {"time": 3125, "text": "Have you had interaction with him, like discussion in the space of Python, programming?"}, {"time": 3129, "text": "Well, in the sense of sometimes he asks me, why is this stuff still so hard?"}, {"time": 3133, "text": "Yeah, you know, everybody's a critic."}, {"time": 3138, "text": "But actually, no, Eric."}, {"time": 3140, "text": "Programming, you mean, like in general?"}, {"time": 3141, "text": "Yes, yes, well, not programming in general, but certain things in the Python ecosystem."}, {"time": 3145, "text": "But he actually, I think what I find in listening to some of his stuff is that he does use programming metaphors a lot, right?"}, {"time": 3153, "text": "He'll talk about APIs or object oriented and things like that."}, {"time": 3156, "text": "So I think that's a useful set of frames for him to draw upon for discourse."}, {"time": 3162, "text": "I haven't pair programmed with him in a very long time."}, {"time": 3165, "text": "You've previously pair coded with Eric."}, {"time": 3167, "text": "Well, I mean, I look at his code trying to help like put together some of the visualizations around these things."}, {"time": 3171, "text": "But it's been a very, not really pair programmed, but like even looked at his code, right?"}, {"time": 3176, "text": "How legendary would be is that like Git repo with Peter Wang and Eric Weinstein?"}, {"time": 3182, "text": "Well, honestly, Robert Kern did all the heavy lifting."}, {"time": 3185, "text": "So I have to give credit where credit is due."}, {"time": 3186, "text": "Robert is the silent but incredibly deep, quiet, not silent, but quiet, but incredibly deep individual at the heart of a lot of those things that Eric was trying to do."}, {"time": 3196, "text": "But we did have, you know, as Travis and I were starting our company in 2012 timeframe, we went to New York."}, {"time": 3204, "text": "Eric was still in New York at the time."}, {"time": 3206, "text": "He hadn't moved to, this is before he joined Teal Capital."}, {"time": 3209, "text": "We just had like a steak dinner somewhere."}, {"time": 3211, "text": "Maybe it was Keynes, I don't know, somewhere in New York."}, {"time": 3213, "text": "So it was me, Travis, Eric, and then Wes McKinney, the creative pandas, and then Wes's then business partner, Adam, the five of us sat around having this, just a hilarious time, amazing dinner."}, {"time": 3225, "text": "I forget what all we talked about, but it was one of those conversations, which I wish as soon as COVID is over, maybe Eric and I can sit down."}, {"time": 3233, "text": "Recreate."}, {"time": 3233, "text": "Recreate it somewhere in LA, or maybe he comes here, because a lot of cool people are here in Austin, right?"}, {"time": 3239, "text": "Yeah, we're all here."}, {"time": 3239, "text": "He should come here."}, {"time": 3240, "text": "Come here."}, {"time": 3242, "text": "So he uses the metaphor source code sometimes to talk about physics."}, {"time": 3245, "text": "We figure out our own source code."}, {"time": 3247, "text": "So you with a physics background and somebody who's quite a bit of an expert in source code, do you think we'll ever figure out our own source code in the way that Eric means?"}, {"time": 3259, "text": "Do you think we'll figure out the nature of reality?"}, {"time": 3260, "text": "Well, I think we're constantly working on that problem."}, {"time": 3261, "text": "I mean, I think we'll make more and more progress."}, {"time": 3264, "text": "For me, there's some things I don't really doubt too much."}, {"time": 3268, "text": "Like, I don't really doubt that one day we will create a synthetic, maybe not fully in silicon, but a synthetic approach to cognition that rivals the biological 20 watt computers in our heads."}, {"time": 3284, "text": "What's cognition here?"}, {"time": 3286, "text": "Cognition."}, {"time": 3287, "text": "Perception, attention, memory, recall, asking better questions."}, {"time": 3291, "text": "That for me is a measure of intelligence."}, {"time": 3293, "text": "Doesn't Roomba vacuum cleaner already do that?"}, {"time": 3295, "text": "Or do you mean, oh, it doesn't ask questions."}, {"time": 3297, "text": "I mean, no, it's, I mean, I have a Roomba, but it's not even as smart as my cat, right?"}, {"time": 3303, "text": "Yeah, but it asks questions about what is this wall?"}, {"time": 3305, "text": "It now, new feature asks, is this poop or not, apparently."}, {"time": 3308, "text": "Yes, a lot of our current cybernetic system, it's a cybernetic system."}, {"time": 3312, "text": "It will go and it will happily vacuum up some poop, right?"}, {"time": 3314, "text": "The older generations would."}, {"time": 3316, "text": "The new one, just released, does not vacuum up the poop."}, {"time": 3320, "text": "This is a commercial for."}, {"time": 3321, "text": "I wonder if it still gets stuck under my first rung of my stair."}, {"time": 3323, "text": "In any case, these cybernetic systems we have, they are mold, they're designed to be sent off into a relatively static environment."}, {"time": 3334, "text": "And whatever dynamic things happen in the environment, they have a very limited capacity to respond to."}, {"time": 3338, "text": "A human baby, a human toddler of 18 months of age has more capacity to manage its own attention and its own capacity to make better sense of the world than the most advanced robots today."}, {"time": 3351, "text": "So again, my cat, I think can do a better job of my two and they're both pretty clever."}, {"time": 3356, "text": "So I do think though, back to my kind of original point, I think that it's not, for me, it's not question at all that we will be able to create synthetic systems that are able to do this better than the human, at an equal level or better than the human mind."}, {"time": 3371, "text": "It's also for me, not a question that we will be able to put them alongside humans so that they capture the full broad spectrum of what we are seeing as well."}, {"time": 3385, "text": "And also looking at our responses, listening to our responses, even maybe measuring certain vital signs about us."}, {"time": 3392, "text": "So in this kind of sidecar mode, a greater intelligence could use us and our whatever 80 years of life to train itself up and then be a very good simulacrum of us moving forward."}, {"time": 3405, "text": "So who is in the sidecar in that picture of the future exactly?"}, {"time": 3410, "text": "The baby version of our immortal selves."}, {"time": 3412, "text": "Okay, so once the baby grows up, is there any use for humans?"}, {"time": 3419, "text": "I think that out of epistemic humility, we need to keep humans around for a long time."}, {"time": 3425, "text": "And I would hope that anyone making those systems would believe that to be true."}, {"time": 3430, "text": "Out of epistemic humility, what's the nature of the humility that?"}, {"time": 3433, "text": "That we don't know what we don't know."}, {"time": 3436, "text": "So we don't."}, {"time": 3440, "text": "First we have to build systems that help us do the things that we do know about that can then probe the unknowns that we know about."}, {"time": 3446, "text": "But the unknown unknowns, we don't know."}, {"time": 3448, "text": "We could always know."}, {"time": 3450, "text": "Nature is the one thing that is infinitely able to surprise us."}, {"time": 3453, "text": "So we should keep biological humans around for a very, very, very long time."}, {"time": 3457, "text": "Even after our immortal selves have transcended and have gone off to explore other worlds, gone to go communicate with the lifeforms living in the sun or whatever else."}, {"time": 3466, "text": "So I think that's, for me, these seem like things that are going to happen."}, {"time": 3473, "text": "Like I don't really question that, that they're gonna happen."}, {"time": 3475, "text": "Assuming we don't completely destroy ourselves."}, {"time": 3478, "text": "Is it possible to create an AI system that you fall in love with and it falls in love with you and you have a romantic relationship with it?"}, {"time": 3488, "text": "Or a deep friendship, let's say."}, {"time": 3490, "text": "I would hope that that is the design criteria for any of these systems."}, {"time": 3494, "text": "If we cannot have a meaningful relationship with it, then it's still just a chunk of silicon."}, {"time": 3500, "text": "So then what is meaningful?"}, {"time": 3501, "text": "Because back to sugar."}, {"time": 3503, "text": "Well, sugar doesn't love you back, right?"}, {"time": 3505, "text": "So the computer has to love you back."}, {"time": 3506, "text": "And what does love mean?"}, {"time": 3508, "text": "Well, in this context, for me, love, I'm gonna take a page from Alain de Botton."}, {"time": 3512, "text": "Love means that it wants to help us become the best version of ourselves."}, {"time": 3516, "text": "Yes, that's beautiful."}, {"time": 3519, "text": "That's a beautiful definition of love."}, {"time": 3520, "text": "So what role does love play in the human condition at the individual level and at the group level?"}, {"time": 3528, "text": "Because you were kind of saying that humans, we should really consider humans both at the individual and the group and the societal level."}, {"time": 3535, "text": "What's the role of love in this whole thing?"}, {"time": 3536, "text": "We talked about sex, we talked about death, thanks to the bacteria that invented it."}, {"time": 3542, "text": "At which point did we invent love, by the way?"}, {"time": 3544, "text": "I mean, is that also?"}, {"time": 3545, "text": "No, I think love is the start of it all."}, {"time": 3548, "text": "And the feelings of, and this gets sort of beyond just romantic, sensual, whatever kind of things, but actually genuine love as we have for another person."}, {"time": 3559, "text": "Love as it would be used in a religious text, right?"}, {"time": 3562, "text": "I think that capacity to feel love more than consciousness, that is the universal thing."}, {"time": 3568, "text": "Our feeling of love is actually a sense of that generativity."}, {"time": 3571, "text": "When we can look at another person and see that they can be something more than they are, and more than just a pigeonhole we might stick them in."}, {"time": 3582, "text": "I mean, I think there's, in any religious text, you'll find voiced some concept of this, that you should see the grace of God in the other person."}, {"time": 3590, "text": "They're made in the spirit of the love that God feels for his creation or her creation."}, {"time": 3597, "text": "And so I think this thing is actually the root of it."}, {"time": 3600, "text": "So I would say, I don't think molecules of water feel consciousness, have consciousness, but there is some proto micro quantum thing of love."}, {"time": 3610, "text": "That's the generativity when there's more energy than what they need to maintain equilibrium."}, {"time": 3616, "text": "And that when you sum it all up is something that leads to, I mean, I had my mind blown one day as an undergrad at the physics computer lab."}, {"time": 3624, "text": "I logged in and when you log into bash for a long time, there was a little fortune that would come out."}, {"time": 3629, "text": "And it said, man was created by water to carry itself uphill."}, {"time": 3633, "text": "And I was logging into work on some problem set and I logged in and I saw that and I just said, son of a bitch, I just, I logged out and I went to the coffee shop and I got a coffee and I sat there on the quad and I'm like, you know, it's not wrong and yet WTF, right?"}, {"time": 3653, "text": "So when you look at it that way, it's like, yeah, okay, non equilibrium physics is a thing."}, {"time": 3697, "text": "Those are the kinds of things that should be our design criteria, right?"}, {"time": 3701, "text": "Those should be what we start with to then come up with the philosophies of self and of rights and responsibilities, but that love being at the center of it, I think when we design systems for cognition, it should absolutely be built that way."}, {"time": 3718, "text": "I think if we simply focus on efficiency and productivity, these kind of very industrial era, all the things that Marx had issues with, right?"}, {"time": 3728, "text": "Those, that's a way to go and really I think go off the deep end in the wrong way."}, {"time": 3733, "text": "So one of the interesting consequences of thinking of life in this hierarchical way of an individual human and then there's groups and there's societies is I believe that you believe that corporations are people."}, {"time": 3751, "text": "So this is a kind of a politically dense idea, all those kinds of things."}, {"time": 3757, "text": "If we just throw politics aside, if we throw all of that aside, in which sense do you believe that corporations are people?"}, {"time": 3766, "text": "And how does love connect to that?"}, {"time": 3767, "text": "Right, so the belief is that groups of people have some kind of higher level, I would say mesoscopic claim to agency."}, {"time": 3777, "text": "So where do I, let's start with this."}, {"time": 3780, "text": "Most people would say, okay, individuals have claims to agency and sovereignty."}, {"time": 3785, "text": "Nations, we certainly act as if nations, so at a very large, large scale, nations have rights to sovereignty and agency."}, {"time": 3793, "text": "Like everyone plays the game of modernity as if that's true, right?"}, {"time": 3796, "text": "We believe France is a thing, we believe the United States is a thing."}, {"time": 3798, "text": "But to say that groups of people at a smaller level than that, like a family unit is the thing."}, {"time": 3806, "text": "Well, in our laws, we actually do encode this concept."}, {"time": 3810, "text": "I believe that in a relationship and a marriage, right, one partner can sue for loss of consortium, right?"}, {"time": 3817, "text": "If someone breaks up the marriage or whatever."}, {"time": 3819, "text": "So these are concepts that even in law, we do respect that there is something about the union and about the family."}, {"time": 3825, "text": "So for me, I don't think it's so weird to think that groups of people have a right to, a claim to rights and sovereignty of some degree."}, {"time": 3834, "text": "I mean, we look at our clubs, we look at churches."}, {"time": 3839, "text": "These are, we talk about these collectives of people as if they have a real agency to them, and they do."}, {"time": 3845, "text": "But I think if we take that one step further and say, okay, they can accrue resources."}, {"time": 3850, "text": "Well, yes, check, you know, and by law they can."}, {"time": 3853, "text": "They can own land, they can engage in contracts, they can do all these different kinds of things."}, {"time": 3858, "text": "So we in legal terms support this idea that groups of people have rights."}, {"time": 3866, "text": "Where we go wrong on this stuff is that the most popular version of this is the for profit absentee owner corporation that then is able to amass larger resources than anyone else in the landscape, anything else, any other entity of equivalent size."}, {"time": 3882, "text": "And they're able to essentially bully around individuals, whether it's laborers, whether it's people whose resources they want to capture."}, {"time": 3888, "text": "They're also able to bully around our system of representation, which is still tied to individuals, right?"}, {"time": 3895, "text": "So I don't believe that's correct."}, {"time": 3898, "text": "I don't think it's good that they, you know, they're people, but they're assholes."}, {"time": 3902, "text": "I don't think that corporations as people acting like assholes is a good thing."}, {"time": 3905, "text": "But the idea that collectives and collections of people that we should treat them philosophically as having some agency and some mass, at a mesoscopic level, I think that's an important thing because one thing I do think we underappreciate sometimes is the fact that relationships have relationships."}, {"time": 3926, "text": "So it's not just individuals having relationships with each other."}, {"time": 3929, "text": "But if you have eight people seated around a table, right?"}, {"time": 3932, "text": "Each person has a relationship with each of the others and that's obvious."}, {"time": 3935, "text": "But then if it's four couples, each couple also has a relationship with each of the other couples, right?"}, {"time": 3941, "text": "The dyads do."}, {"time": 3942, "text": "And if it's couples, but one is the, you know, father and mother older, and then, you know, one of their children and their spouse, that family unit of four has a relationship with the other family unit of four."}, {"time": 3955, "text": "So the idea that relationships have relationships is something that we intuitively know in navigating the social landscape, but it's not something I hear expressed like that."}, {"time": 3964, "text": "It's certainly not something that is, I think, taken into account very well when we design these kinds of things."}, {"time": 3969, "text": "So I think the reason why I care a lot about this is because I think the future of humanity requires us to form better sense make, collective sense making units at something, you know, around Dunbar number, you know, half to five X Dunbar."}, {"time": 3988, "text": "And that's very different than right now where we defer sense making to massive aging zombie institutions."}, {"time": 3997, "text": "Or we just do it ourselves."}, {"time": 3998, "text": "Go it alone."}, {"time": 3999, "text": "Go to the dark force of the internet by ourselves."}, {"time": 4002, "text": "So you've talked about agency, I think maybe calling it a convenient fiction at all these different levels."}, {"time": 4009, "text": "So even at the human individual level, it's kind of a fiction."}, {"time": 4013, "text": "We all believe, because we are, like you said, made of cells and cells are made of atoms."}, {"time": 4017, "text": "So that's a useful fiction."}, {"time": 4018, "text": "And then there's nations that seems to be a useful fiction, but it seems like some fictions are better than others."}, {"time": 4026, "text": "You know, there's a lot of people that argue the fiction of nation is a bad idea."}, {"time": 4031, "text": "One of them lives two doors down from me, Michael Malice, he's an anarchist."}, {"time": 4036, "text": "You know, I'm sure there's a lot of people who are into meditation that believe the idea, this useful fiction of agency of an individual is a troublesome as well."}, {"time": 4046, "text": "We need to let go of that in order to truly, like to transcend, I don't know."}, {"time": 4052, "text": "I don't know what words you want to use, but suffering or to elevate the experience of life."}, {"time": 4058, "text": "So you're kind of arguing that, okay, so we have some of these useful fictions of agency."}, {"time": 4064, "text": "We should add a stronger fiction that we tell ourselves about the agency of groups in the hundreds of the half a Dunbar's number, 5X Dunbar's number."}, {"time": 4077, "text": "Yeah, something on that order."}, {"time": 4078, "text": "And we call them fictions, but really they're rules of the game, right?"}, {"time": 4081, "text": "Rules that we feel are fair or rules that we consent to."}, {"time": 4085, "text": "Yeah, I always question the rules when I lose like a monopoly."}, {"time": 4088, "text": "That's when I usually question the rules."}, {"time": 4089, "text": "When I'm winning, I don't question the rules."}, {"time": 4091, "text": "We should play a game Monopoly someday."}, {"time": 4092, "text": "There's a trippy version of it that we could do."}, {"time": 4095, "text": "What kind?"}, {"time": 4096, "text": "Contract Monopoly is introduced by a friend of mine to me where you can write contracts on future earnings or landing on various things."}, {"time": 4104, "text": "And you can hand out like, you know, you can land the first three times you land in a park place, it's free or whatever."}, {"time": 4110, "text": "And then you can start trading those contracts for money."}, {"time": 4113, "text": "And then you create a human civilization and somehow Bitcoin comes into it."}, {"time": 4118, "text": "Okay, but some of these."}, {"time": 4120, "text": "Actually, I bet if me and you and Eric sat down to play a game Monopoly and we were to make NFTs out of the contracts we wrote, we could make a lot of money."}, {"time": 4128, "text": "Now it's a terrible idea."}, {"time": 4129, "text": "I would never do it, but I bet we could actually sell the NFTs around."}, {"time": 4132, "text": "I have other ideas to make money that I could tell you and they're all terrible ideas."}, {"time": 4138, "text": "Yeah, including cat videos on the internet."}, {"time": 4142, "text": "Okay, but some of these rules of the game, some of these fictions are, it seems like they're better than others."}, {"time": 4149, "text": "They have worked this far to cohere human, to organize human collective action."}, {"time": 4154, "text": "But you're saying something about, especially this technological age requires modified fictions, stories of agency."}, {"time": 4163, "text": "Why the Dunbar number?"}, {"time": 4165, "text": "And also, you know, how do you select the group of people?"}, {"time": 4168, "text": "You know, Dunbar numbers, I think I have the sense that it's overused as a kind of law that somehow we can have deep human connection at this scale."}, {"time": 4181, "text": "Like some of it feels like an interface problem too."}, {"time": 4185, "text": "It feels like if I have the right tools, I can deeply connect with a larger number of people."}, {"time": 4191, "text": "It just feels like there's a huge value to interacting just in person, getting to share traumatic experiences together, beautiful experiences together."}, {"time": 4202, "text": "There's other experiences like that in the digital space that you can share."}, {"time": 4207, "text": "It just feels like Dunbar's number could be expanded significantly, perhaps not to the level of millions and billions, but it feels like it could be expanded."}, {"time": 4216, "text": "So how do we find the right interface, you think, for having a little bit of a collective here that has agency?"}, {"time": 4226, "text": "You're right that there's many different ways that we can build trust with each other."}, {"time": 4230, "text": "My friend Joe Edelman talks about a few different ways that, you know, mutual appreciation, trustful conflict, just experiencing something like, you know, there's a variety of different things that we can do, but all those things take time and you have to be present."}, {"time": 4248, "text": "The less present you are, I mean, there's just, again, a no free lunch principle here."}, {"time": 4251, "text": "The less present you are, the more of them you can do, but then the less connection you build."}, {"time": 4256, "text": "So I think there is sort of a human capacity issue around some of these things."}, {"time": 4260, "text": "Now, that being said, if we can use certain technologies, so for instance, if I write a little monograph on my view of the world, you read it asynchronously at some point, and you're like, wow, Peter, this is great."}, {"time": 4271, "text": "Here's mine."}, {"time": 4273, "text": "I'm like, wow, Lex, this is awesome."}, {"time": 4275, "text": "We can be friends without having to spend 10 years, you know, figuring all this stuff out together."}, {"time": 4280, "text": "We just read each other's thing and be like, oh yeah, this guy's exactly in my wheelhouse and vice versa."}, {"time": 4286, "text": "And we can then, you know, connect just a few times a year and maintain a high trust relationship."}, {"time": 4293, "text": "It can be expanded a little bit, but it also requires, these things are not all technological in nature."}, {"time": 4297, "text": "It requires the individual themselves to have a certain level of capacity, to have a certain lack of neuroticism, right?"}, {"time": 4304, "text": "If you want to use like the ocean big five sort of model, people have to be pretty centered."}, {"time": 4309, "text": "The less centered you are, the fewer authentic connections you can really build for a particular unit of time."}, {"time": 4314, "text": "It just takes more time."}, {"time": 4315, "text": "Other people have to put up with your crap."}, {"time": 4317, "text": "Like there's just a lot of the stuff that you have to deal with if you are not so well balanced, right?"}, {"time": 4322, "text": "So yes, we can help people get better to where they can develop more relationships faster, and then you can maybe expand Dunbar number by quite a bit, but you're not going to do it."}, {"time": 4330, "text": "I think it's going to be hard to get it beyond 10X, kind of the rough swag of what it is, you know?"}, {"time": 4336, "text": "Well, don't you think that AI systems could be an addition to the Dunbar's number?"}, {"time": 4342, "text": "So like why?"}, {"time": 4343, "text": "Do you count as one system or multiple AI systems?"}, {"time": 4345, "text": "Multiple AI systems."}, {"time": 4346, "text": "So I do believe that AI systems, for them to integrate into human society as it is now, have to have a sense of agency."}, {"time": 4352, "text": "So there has to be a individual because otherwise we wouldn't relate to them."}, {"time": 4357, "text": "We could engage certain kinds of individuals to make sense of them for us and be almost like, did you ever watch Star Trek?"}, {"time": 4364, "text": "Like Voyager, like there's the Volta, who are like the interfaces, the ambassadors for the Dominion."}, {"time": 4370, "text": "We may have ambassadors that speak on behalf of these systems."}, {"time": 4374, "text": "They're like the Mentats of Dune, maybe, or something like this."}, {"time": 4377, "text": "I mean, we already have this to some extent."}, {"time": 4379, "text": "If you look at the biggest sort of, I wouldn't say AI system, but the biggest cybernetic system in the world is the financial markets."}, {"time": 4385, "text": "It runs outside of any individual's control, and you have an entire stack of people on Wall Street, Wall Street analysts to CNBC reporters, whatever."}, {"time": 4393, "text": "They're all helping to communicate what does this mean?"}, {"time": 4396, "text": "You know, like Jim Cramer, like coming around and yelling and stuff."}, {"time": 4399, "text": "Like all of these people are part of that lowering of the complexity there to meet sense, you know, to help do sense making for people at whatever capacity they're at."}, {"time": 4409, "text": "And I don't see this changing with AI systems."}, {"time": 4411, "text": "I think you would have ringside commentators talking about all this stuff that this AI system is trying to do over here, over here, because it's actually a super intelligence."}, {"time": 4419, "text": "So if you want to talk about humans interfacing, making first contact with the super intelligence, we're already there."}, {"time": 4423, "text": "We do it pretty poorly."}, {"time": 4424, "text": "And if you look at the gradient of power and money, what happens is the people closest to it will absolutely exploit their distance for personal financial gain."}, {"time": 4434, "text": "So we should look at that and be like, oh, well, that's probably what the future will look like as well."}, {"time": 4438, "text": "But nonetheless, I mean, we're already doing this kind of thing."}, {"time": 4441, "text": "So in the future, we can have AI systems, but you're still gonna have to trust people to bridge the sense making gap to them."}, {"time": 4448, "text": "See, I just feel like there could be like millions of AI systems that have, have agencies, you have, when you say one super intelligence, super intelligence in that context means it's able to solve particular problems extremely well."}, {"time": 4466, "text": "But there's some aspect of human like intelligence that's necessary to be integrated into human society."}, {"time": 4472, "text": "So not financial markets, not sort of weather prediction systems, or I don't know, logistics optimization."}, {"time": 4479, "text": "I'm more referring to things that you interact with on the intellectual level."}, {"time": 4485, "text": "And that I think requires, there has to be a backstory."}, {"time": 4488, "text": "There has to be a personality."}, {"time": 4490, "text": "I believe it has to fear its own mortality in a genuine way."}, {"time": 4493, "text": "Like there has to be all, many of the elements that we humans experience that are fundamental to the human condition, because otherwise we would not have a deep connection with it."}, {"time": 4505, "text": "But I don't think having a deep connection with it is necessarily going to stop us from building a thing that has quite an alien intelligence aspect here."}, {"time": 4513, "text": "So the other kind of alien intelligence on this planet is the octopuses or octopodes or whatever you wanna call them."}, {"time": 4519, "text": "Octopi."}, {"time": 4519, "text": "Octopi, yeah."}, {"time": 4521, "text": "There's a little controversy as to what the plural is, I guess."}, {"time": 4523, "text": "But an octopus."}, {"time": 4523, "text": "I look forward to your letters."}, {"time": 4526, "text": "Yeah, an octopus, it really acts as a collective intelligence of eight intelligent arms, right?"}, {"time": 4534, "text": "Its arms have a tremendous amount of neural density to them."}, {"time": 4537, "text": "And I see if we can build, I mean, just let's go with what you're saying."}, {"time": 4542, "text": "If we build a singular intelligence that interfaces with humans that has a sense of agency so it can run the cybernetic loop and develop its own theory of mind as well as its theory of action, all these things, I agree with you that that's the necessary components to build a real intelligence, right?"}, {"time": 4557, "text": "There's gotta be something at stake."}, {"time": 4558, "text": "It's gotta make a decision."}, {"time": 4560, "text": "It's gotta then run the OODA loop."}, {"time": 4561, "text": "Okay, so we build one of those."}, {"time": 4563, "text": "Well, if we can build one of those, we can probably build 5 million of them."}, {"time": 4565, "text": "So we build 5 million of them."}, {"time": 4591, "text": "In the same way that a phased array radar, right?"}, {"time": 4592, "text": "You think about how phased array radar works."}, {"time": 4594, "text": "It's just sensitivity."}, {"time": 4596, "text": "It's just radars, and then it's hypersensitivity and really great timing between all of them."}, {"time": 4601, "text": "And with a flat array, it's as good as a curved radar dish, right?"}, {"time": 4604, "text": "So with these things, it's a phased array of cybernetic systems that'll give the centralized intelligence much, much better, a much higher fidelity understanding of what's actually happening in the environment."}, {"time": 4616, "text": "But the more power, the more understanding the central super intelligence has, the dumber the individual like fingers of this intelligence are, I think."}, {"time": 4628, "text": "I think you... Not necessarily."}, {"time": 4629, "text": "In my sense..."}, {"time": 4630, "text": "I don't see what has to be."}, {"time": 4631, "text": "This argument, there has to be, the experience of the individual agent has to have the full richness of the human like experience."}, {"time": 4640, "text": "You have to be able to be driving the car in the rain, listening to Bruce Springsteen, and all of a sudden break out in tears because remembering something that happened to you in high school."}, {"time": 4651, "text": "We can implant those memories if that's really needed."}, {"time": 4653, "text": "But no, I'm... No, but the central agency, like I guess I'm saying for, in my view, for intelligence to be born, you have to have a decentralization."}, {"time": 4663, "text": "Like each one has to struggle and reach."}, {"time": 4667, "text": "So each one in excess of energy has to reach for order as opposed to a central place doing so."}, {"time": 4674, "text": "Have you ever read like some sci fi where there's like hive minds?"}, {"time": 4678, "text": "Like the Wernher Vinge, I think has one of these."}, {"time": 4681, "text": "And then some of the stuff from the Commonwealth Saga, the idea that you're an individual, but you're connected with like a few other individuals telepathically as well."}, {"time": 4690, "text": "And together you form a swarm."}, {"time": 4692, "text": "So if you are, I ask you, what do you think is the experience of if you are like, well, a Borg, right?"}, {"time": 4698, "text": "If you are one, if you're part of this hive mind, outside of all the aesthetics, forget the aesthetics, internally, what is your experience like?"}, {"time": 4708, "text": "Because I have a theory as to what that looks like."}, {"time": 4710, "text": "The one question I have for you about that experience is how much is there a feeling of freedom, of free will?"}, {"time": 4718, "text": "Because I obviously as a human, very unbiased, but also somebody who values freedom and biased, it feels like the experience of freedom is essential for trying stuff out, to being creative and doing something truly novel, which is at the core of."}, {"time": 4739, "text": "Yeah, well, I don't think you have to lose any freedom when you're in that mode."}, {"time": 4742, "text": "Because I think what happens is we think, we still think, I mean, you're still thinking about this in a sense of a top down command and control hierarchy, which is not what it has to be at all."}, {"time": 4752, "text": "I think the experience, so I'll just show by cards here."}, {"time": 4756, "text": "I think the experience of being a robot in that robot swarm, a robot who has agency over their own local environment that's doing sense making and reporting it back to the hive mind, I think that robot's experience would be one, when the hive mind is working well, it would be an experience of like talking to God, right?"}, {"time": 4774, "text": "That you essentially are reporting to, you're sort of saying, here's what I see."}, {"time": 4778, "text": "I think this is what's gonna happen over here."}, {"time": 4780, "text": "I'm gonna go do this thing."}, {"time": 4781, "text": "Because I think if I'm gonna do this, this will make this change happen in the environment."}, {"time": 4785, "text": "And then God, she may tell you, that's great."}, {"time": 4790, "text": "And in fact, your brothers and sisters will join you to help make this go better, right?"}, {"time": 4794, "text": "And then she can let your brothers and sisters know, hey, Peter's gonna go do this thing."}, {"time": 4798, "text": "Would you like to help him?"}, {"time": 4799, "text": "Because we think that this will make this thing go better."}, {"time": 4801, "text": "And they'll say, yes, we'll help him."}, {"time": 4803, "text": "So the whole thing could be actually very emergent."}, {"time": 4805, "text": "The sense of, what does it feel like to be a cell and a network that is alive, that is generative."}, {"time": 4811, "text": "And I think actually the feeling is serendipity."}, {"time": 4816, "text": "That there's random order, not random disorder or chaos, but random order, just when you need it to hear Bruce Springsteen, you turn on the radio and bam, it's Bruce Springsteen, right?"}, {"time": 4828, "text": "That feeling of serendipity, I feel like, this is a bit of a flight of fancy, but every cell in your body must have, what does it feel like to be a cell in your body?"}, {"time": 4837, "text": "When it needs sugar, there's sugar."}, {"time": 4839, "text": "When it needs oxygen, there's just oxygen."}, {"time": 4841, "text": "Now, when it needs to go and do its work and pull like as one of your muscle fibers, right?"}, {"time": 4846, "text": "It does its work and it's great."}, {"time": 4848, "text": "It contributes to the cause, right?"}, {"time": 4849, "text": "So this is all, again, a flight of fancy, but I think as we extrapolate up, what does it feel like to be an independent individual with some bounded sense of freedom?"}, {"time": 4858, "text": "All sense of freedom is actually bounded, but it was a bounded sense of freedom that still lives within a network that has order to it."}, {"time": 4864, "text": "And I feel like it has to be a feeling of serendipity."}, {"time": 4866, "text": "So the cell, there's a feeling of serendipity, even though."}, {"time": 4870, "text": "It has no way of explaining why it's getting oxygen and sugar when it gets it."}, {"time": 4873, "text": "So you have to, each individual component has to be too dumb to understand the big picture."}, {"time": 4879, "text": "No, the big picture is bigger than what it can understand."}, {"time": 4882, "text": "But isn't that an essential characteristic of the individual is to be too dumb to understand the bigger picture."}, {"time": 4889, "text": "Like not dumb necessarily, but limited in its capacity to understand."}, {"time": 4893, "text": "Because the moment you understand, I feel like that leads to, if you tell me now that there are some bigger intelligence controlling everything I do, intelligence broadly defined, meaning like, you know, even the Sam Harris thing, there's no free will."}, {"time": 4911, "text": "If I'm smart enough to truly understand that that's the case, that's gonna, I don't know if I."}, {"time": 4918, "text": "We have philosophical breakdown, right?"}, {"time": 4920, "text": "Because we're in the West and we're pumped full of this stuff of like, you are a golden, fully free individual with all your freedoms and all your liberties and go grab a gun and shoot whatever you want to."}, {"time": 4930, "text": "No, it's actually, you don't actually have a lot of these, you're not unconstrained, but the areas where you can manifest agency, you're free to do those things."}, {"time": 4941, "text": "You can say whatever you want on this podcast."}, {"time": 4943, "text": "You can create a podcast, right?"}, {"time": 4944, "text": "You're not, I mean, you have a lot of this kind of freedom, but even as you're doing this, you are actually, I guess where the denouement of this is that we are already intelligent agents in such a system, right?"}, {"time": 4957, "text": "In that one of these like robots of one of 5 million little swarm robots or one of the Borg, they're just posting on internal bulletin board."}, {"time": 4965, "text": "I mean, maybe the Borg cube is just a giant Facebook machine floating in space and everyone's just posting on there."}, {"time": 4970, "text": "They're just posting really fast and like, oh yeah."}, {"time": 4972, "text": "It's called the metaverse now."}, {"time": 4973, "text": "That's called the metaverse, that's right."}, {"time": 4974, "text": "Here's the enterprise."}, {"time": 4975, "text": "Maybe we should all go shoot it."}, {"time": 4976, "text": "Yeah, everyone upvotes and they're gonna go shoot it, right?"}, {"time": 4978, "text": "But we already are part of a human online collaborative environment and collaborative sensemaking system."}, {"time": 4985, "text": "It's not very good yet."}, {"time": 4987, "text": "It's got the overhangs of zombie sensemaking institutions all over it, but as that washes away and as we get better at this, we are going to see humanity improving at speeds that are unthinkable in the past."}, {"time": 5001, "text": "And it's not because anyone's freedoms were limited."}, {"time": 5003, "text": "In fact, the open source, and we started this with open source software, right?"}, {"time": 5006, "text": "The collaboration, what the internet surfaced was the ability for people all over the world to collaborate and produce some of the most foundational software that's in use today, right?"}, {"time": 5015, "text": "That entire ecosystem was created by collaborators all over the place."}, {"time": 5018, "text": "So these online kind of swarm kind of things are not novel."}, {"time": 5024, "text": "It's just, I'm just suggesting that future AI systems, if you can build one smart system, you have no reason not to build multiple."}, {"time": 5031, "text": "If you build multiple, there's no reason not to integrate them all into a collective sensemaking substrate."}, {"time": 5037, "text": "And that thing will certainly have immersion intelligence that none of the individuals and probably not any of the human designers will be able to really put a bow around and explain."}, {"time": 5046, "text": "But in some sense, would that AI system still be able to go like rural Texas, buy a ranch, go off the grid, go full survivalist?"}, {"time": 5056, "text": "Like, can you disconnect from the hive mind?"}, {"time": 5060, "text": "You may not want to."}, {"time": 5065, "text": "So to be ineffective, to be intelligent."}, {"time": 5067, "text": "You have access to way more intelligence capability if you're plugged into five million other really, really smart cyborgs."}, {"time": 5073, "text": "Why would you leave?"}, {"time": 5074, "text": "So like there's a word control that comes to mind."}, {"time": 5077, "text": "So it doesn't feel like control, like overbearing control."}, {"time": 5083, "text": "It's just knowledge."}, {"time": 5084, "text": "I think systems, well, this is to your point."}, {"time": 5086, "text": "I mean, look at how much, how uncomfortable you are with this concept, right?"}, {"time": 5089, "text": "I think systems that feel like overbearing control will not evolutionarily win out."}, {"time": 5094, "text": "I think systems that give their individual elements the feeling of serendipity and the feeling of agency that that will, those systems will win."}, {"time": 5104, "text": "But that's not to say that there will not be emergent higher level order on top of it."}, {"time": 5109, "text": "And that's the thing, that's the philosophical breakdown that we're staring right at, which is in the Western mind, I think there's a very sharp delineation between explicit control, Cartesian, like what is the vector?"}, {"time": 5123, "text": "Where is the position?"}, {"time": 5124, "text": "Where is it going?"}, {"time": 5125, "text": "It's completely deterministic."}, {"time": 5127, "text": "And kind of this idea that things emerge."}, {"time": 5130, "text": "Everything we see is the emergent patterns of other things."}, {"time": 5133, "text": "And there is agency when there's extra energy."}, {"time": 5138, "text": "So you have spoken about a kind of meaning crisis that we're going through."}, {"time": 5144, "text": "But it feels like since we invented sex and death, we broadly speaking, we've been searching for a kind of meaning."}, {"time": 5154, "text": "So it feels like a human civilization has been going through a meaning crisis of different flavors throughout its history."}, {"time": 5160, "text": "Why is, how is this particular meaning crisis different?"}, {"time": 5165, "text": "Or is it really a crisis and it wasn't previously?"}, {"time": 5169, "text": "A lot of human history, there wasn't so much a meaning crisis."}, {"time": 5173, "text": "There was just a like food and not getting eaten by bears crisis, right?"}, {"time": 5176, "text": "Once you get to a point where you can make food, there was the like not getting killed by other humans crisis."}, {"time": 5181, "text": "So sitting around wondering what is it all about, it's actually a relatively recent luxury."}, {"time": 5186, "text": "And to some extent, the meaning crisis coming out of that is precisely because, well, it's not precisely because, I believe that meaning is the consequence of when we make consequential decisions, it's tied to agency, right?"}, {"time": 5202, "text": "When we make consequential decisions, that generates meaning."}, {"time": 5206, "text": "So if we make a lot of decisions, but we don't see the consequences of them, then it feels like what was the point, right?"}, {"time": 5212, "text": "But if there's all these big things that we don't see the consequences of, right, but if there's all these big things happening, but we're just along for the ride, then it also does not feel very meaningful."}, {"time": 5220, "text": "Meaning, as far as I can tell, this is my working definition of CERCA 2021, is generally the result of a person making a consequential decision, acting on it and then seeing the consequences of it."}, {"time": 5232, "text": "So historically, just when humans are in survival mode, you're making consequential decisions all the time."}, {"time": 5239, "text": "So there's not a lack of meaning because like you either got eaten or you didn't, right?"}, {"time": 5243, "text": "You got some food and that's great, you feel good."}, {"time": 5245, "text": "Like these are all consequential decisions."}, {"time": 5247, "text": "Only in the post fossil fuel and industrial revolution could we create a massive leisure class."}, {"time": 5256, "text": "I could sit around not being threatened by bears, not starving to death, making decisions somewhat, but a lot of times not seeing the consequences of any decisions they make."}, {"time": 5269, "text": "The general sort of sense of anomie, I think that is the French term for it, in the wake of the consumer society, in the wake of mass media telling everyone, hey, choosing between Hermes and Chanel is a meaningful decision."}, {"time": 5284, "text": "I don't know what either of those mean."}, {"time": 5285, "text": "Oh, they're high end luxury purses and crap like that."}, {"time": 5290, "text": "But the point is that we give people the idea that consumption is meaning, that making a choice of this team versus that team, spectating has meaning."}, {"time": 5300, "text": "So we produce all of these different things that are as if meaning, right?"}, {"time": 5305, "text": "But really making a decision that has no consequences for us."}, {"time": 5308, "text": "And so that creates the meaning crisis."}, {"time": 5310, "text": "Well, you're saying choosing between Chanel and the other one has no consequence."}, {"time": 5315, "text": "I mean, why is one more meaningful than the other?"}, {"time": 5318, "text": "It's not that it's more meaningful than the other."}, {"time": 5319, "text": "It's that you make a decision between these two brands and you're told this brand will make me look better in front of other people."}, {"time": 5325, "text": "If I buy this brand of car, if I wear that brand of apparel, right?"}, {"time": 5330, "text": "Like a lot of decisions we make are around consumption, but consumption by itself doesn't actually yield meaning."}, {"time": 5337, "text": "Gaining social status does provide meaning."}, {"time": 5339, "text": "So that's why in this era of abundant production, so many things turn into status games."}, {"time": 5347, "text": "The NFT kind of explosion is a similar kind of thing."}, {"time": 5349, "text": "Everywhere there are status games because we just have so much excess production."}, {"time": 5356, "text": "But aren't those status games a source of meaning?"}, {"time": 5358, "text": "Like why do the games we play have to be grounded in physical reality like they are when you're trying to run away from lions?"}, {"time": 5366, "text": "Why can't we, in this virtuality world, on social media, why can't we play the games on social media, even the dark ones?"}, {"time": 5373, "text": "Right, we can, we can."}, {"time": 5375, "text": "But you're saying that's creating a meaning crisis."}, {"time": 5377, "text": "Well, there's a meaning crisis in that there's two aspects of it."}, {"time": 5381, "text": "Number one, playing those kinds of status games oftentimes requires destroying the planet because it ties to consumption, consuming the latest and greatest version of a thing, buying the latest limited edition sneaker and throwing out all the old ones."}, {"time": 5398, "text": "Maybe it keeps in the old ones, but the amount of sneakers we have to cut up and destroy every year to create artificial scarcity for the next generation, right?"}, {"time": 5405, "text": "This is kind of stuff that's not great."}, {"time": 5407, "text": "It's not great at all."}, {"time": 5409, "text": "So conspicuous consumption fueling status games is really bad for the planet, not sustainable."}, {"time": 5416, "text": "The second thing is you can play these kinds of status games, but then what it does is it renders you captured to the virtual environment."}, {"time": 5424, "text": "The status games that really wealthy people are playing are all around the hard resources where they're gonna build the factories, they're gonna have the fuel in the rare earths to make the next generation of robots."}, {"time": 5433, "text": "They're then going to run game, run circles around you and your children."}, {"time": 5437, "text": "So that's another reason not to play those virtual status games."}, {"time": 5440, "text": "So you're saying ultimately the big picture game is won by people who have access or control over actual hard resources."}, {"time": 5448, "text": "So you can't, you don't see a society where most of the games are played in the virtual space."}, {"time": 5455, "text": "They'll be captured in the physical space."}, {"time": 5457, "text": "It all builds."}, {"time": 5457, "text": "It's just like the stack of human being, right?"}, {"time": 5460, "text": "If you only play the game at the cultural and then intellectual level, then the people with the hard resources and access to layer zero physical are going to own you."}, {"time": 5470, "text": "But isn't money not connected to, or less and less connected to hard resources and money still seems to work?"}, {"time": 5477, "text": "It's a virtual technology."}, {"time": 5478, "text": "There's different kinds of money."}, {"time": 5480, "text": "Part of the reason that some of the stuff is able to go a little unhinged is because the big sovereignties where one spends money and uses money and plays money games and inflates money, their ability to adjudicate the physical resources and hard resources and the resources and hard resources on land and things like that, those have not been challenged in a very long time."}, {"time": 5505, "text": "So, you know, we went off the gold standard."}, {"time": 5507, "text": "Most money is not connected to physical resources."}, {"time": 5513, "text": "And that idea is very closely connected to status."}, {"time": 5519, "text": "But it's also tied to like, it's actually tied to law."}, {"time": 5523, "text": "It is tied to some physical hard things so you have to pay your taxes."}, {"time": 5526, "text": "Yes, so it's always at the end going to be connected to the blockchain of physical reality."}, {"time": 5532, "text": "So in the case of law and taxes, it's connected to government and government is what violence is the, I'm playing with stacks of devil's advocates here and popping one devil off the stack at a time."}, {"time": 5550, "text": "Isn't ultimately, of course, it'll be connected to physical reality, but just because people control the physical reality, it doesn't mean the status."}, {"time": 5556, "text": "I guess LeBron James in theory could make more money than the owners of the teams in theory."}, {"time": 5563, "text": "And to me, that's a virtual idea."}, {"time": 5564, "text": "So somebody else constructed a game and now you're playing in the virtual space of the game."}, {"time": 5571, "text": "So it just feels like there could be games where status, we build realities that give us meaning in the virtual space."}, {"time": 5580, "text": "I can imagine such things being possible."}, {"time": 5582, "text": "Oh yeah, okay, so I see what you're saying."}, {"time": 5584, "text": "I think I see what you're saying there with the idea there, I mean, we'll take the LeBron James side and put in like some YouTube influencer."}, {"time": 5591, "text": "So the YouTube influencer, it is status games, but at a certain level, it precipitates into real dollars and into like, well, you look at Mr."}, {"time": 5598, "text": "Beast, right?"}, {"time": 5601, "text": "He's like sending off half a million dollars worth of fireworks or something, right?"}, {"time": 5604, "text": "Not a YouTube video."}, {"time": 5605, "text": "And also like saving, like saving trees and so on."}, {"time": 5608, "text": "Sure, right, trying to find a million trees with Mark Rober or whatever it was."}, {"time": 5610, "text": "Yeah, like it's not that those kinds of games can't lead to real consequences."}, {"time": 5614, "text": "It's that for the vast majority of people in consumer culture, they are incented by the, I would say mostly, I'm thinking about middle class consumers."}, {"time": 5626, "text": "They're incented by advertisements, they're scented by their memetic environment to treat the purchasing of certain things, the need to buy the latest model, whatever, the need to appear, however, the need to pursue status games as a driver of meaning."}, {"time": 5642, "text": "And my point would be that it's a very hollow driver of meaning."}, {"time": 5645, "text": "And that is what creates a meaning crisis."}, {"time": 5648, "text": "Because at the end of the day, it's like eating a lot of empty calories, right?"}, {"time": 5652, "text": "Yeah, it tasted good going down, a lot of sugar, but man, it did not, it was not enough protein to help build your muscles."}, {"time": 5657, "text": "And you kind of feel that in your gut."}, {"time": 5658, "text": "And I think that's, I mean, so all this stuff aside and setting aside our discussion on currency, which I hope we get back to, that's what I mean about the meaning crisis, part of it being created by the fact that we don't, we're not encouraged to have more and more direct relationships."}, {"time": 5674, "text": "We're actually alienated from relating to, even our family members sometimes, right?"}, {"time": 5680, "text": "We're encouraged to relate to brands."}, {"time": 5683, "text": "We're encouraged to relate to these kinds of things that then tell us to do things that are really of low consequence."}, {"time": 5691, "text": "And that's where the meaning crisis comes from."}, {"time": 5692, "text": "So the role of technology in this, so there's somebody you mentioned who's Jacques, his view of technology, he warns about the towering piles of technique, which I guess is a broad idea of technology."}, {"time": 5705, "text": "So I think, correct me if I'm wrong for him, technology is bad at moving away from human nature and it's ultimately is destructive."}, {"time": 5714, "text": "My question, broadly speaking, this meaning crisis, can technology, what are the pros and cons of technology?"}, {"time": 5719, "text": "Can it be a good?"}, {"time": 5721, "text": "Yeah, I think it can be."}, {"time": 5722, "text": "I certainly think it can be a good thing."}, {"time": 5727, "text": "I certainly draw on some of Alol's ideas and I think some of them are pretty good."}, {"time": 5732, "text": "But the way he defines technique is, well, also Simondon as well."}, {"time": 5737, "text": "I mean, he speaks to the general mentality of efficiency, homogenized processes, homogenized production, homogenized labor to produce homogenized artifacts that then are not actually, they don't sit well in the environment."}, {"time": 5753, "text": "Essentially, you can think of it as the antonym of craft."}, {"time": 5757, "text": "Whereas a craftsman will come to a problem, maybe a piece of wood and they make into a chair."}, {"time": 5764, "text": "It may be a site to build a house or build a stable or build whatever."}, {"time": 5768, "text": "And they will consider how to bring various things in to build something well contextualized that's in right relationship with that environment."}, {"time": 5780, "text": "But the way we have driven technology over the last 100 and 150 years is not that at all."}, {"time": 5785, "text": "It is how can we make sure the input materials are homogenized, cut to the same size, diluted and doped to exactly the right alloy concentrations."}, {"time": 5796, "text": "How do we create machines that then consume exactly the right kind of energy to be able to run at this high speed to stamp out the same parts, which then go out the door, everyone gets the same tickle of Mielmo."}, {"time": 5805, "text": "And the reason why everyone wants it is because we have broadcasts that tells everyone this is the cool thing."}, {"time": 5810, "text": "So we homogenize demand, right?"}, {"time": 5812, "text": "And we're like Baudrillard and other critiques of modernity coming from that direction, the situation lists as well."}, {"time": 5819, "text": "It's that their point is that at this point in time, consumption is the thing that drives a lot of the economic stuff, not the need, but the need to consume and build status games on top."}, {"time": 5829, "text": "So we have homogenized, when we discovered, I think this is really like Bernays and stuff, right?"}, {"time": 5834, "text": "In the early 20th century, we discovered we can create, we can create demand, we can create desire in a way that was not possible before because of broadcast media."}, {"time": 5845, "text": "And not only do we create desire, we don't create a desire for each person to connect to some bespoke thing, to build a relationship with their neighbor or their spouse."}, {"time": 5853, "text": "We are telling them, you need to consume this brand, you need to drive this vehicle, you gotta listen to this music, have you heard this, have you seen this movie, right?"}, {"time": 5860, "text": "So creating homogenized demand makes it really cheap to create homogenized product."}, {"time": 5866, "text": "And now you have economics of scale."}, {"time": 5868, "text": "So we make the same tickle me Elmo, give it to all the kids and all the kids are like, hey, I got a tickle me Elmo, right?"}, {"time": 5874, "text": "So this is ultimately where this ties in then to runaway hypercapitalism is that we then, capitalism is always looking for growth."}, {"time": 5884, "text": "It's always looking for growth and growth only happens at the margins."}, {"time": 5887, "text": "So you have to squeeze more and more demand out."}, {"time": 5889, "text": "You gotta make it cheaper and cheaper to make the same thing, but tell everyone they're still getting meaning from it."}, {"time": 5895, "text": "You're still like, this is still your tickle me Elmo, right?"}, {"time": 5898, "text": "And we see little bits of this dripping critiques of this dripping in popular culture."}, {"time": 5902, "text": "You see it sometimes it's when Buzz Lightyear walks into the thing, he's like, oh my God, at the toy store, I'm just a toy."}, {"time": 5910, "text": "Like there's millions of other, or there's hundreds of other Buzz Lightyear's just like me, right?"}, {"time": 5914, "text": "That is, I think, a fun Pixar critique on this homogenization dynamic."}, {"time": 5920, "text": "I agree with you on most of the things you're saying."}, {"time": 5922, "text": "So I'm playing devil's advocate here, but this homogenized machine of capitalism is also the thing that is able to fund, if channeled correctly, innovation, invention, and development of totally new things that in the best possible world, create all kinds of new experiences that can enrich lives, the quality of lives for all kinds of people."}, {"time": 5949, "text": "So isn't this the machine that actually enables the experiences and more and more experiences that will then give meaning?"}, {"time": 5958, "text": "It has done that to some extent."}, {"time": 5961, "text": "I mean, it's not all good or bad in my perspective."}, {"time": 5964, "text": "We can always look backwards and offer a critique of the path we've taken to get to this point in time."}, {"time": 5971, "text": "But that's a different, that's somewhat different and informs the discussion, but it's somewhat different than the question of where do we go in the future, right?"}, {"time": 5980, "text": "Is this still the same rocket we need to ride to get to the next point?"}, {"time": 5983, "text": "Will it even get us to the next point?"}, {"time": 5984, "text": "Well, how does this, so you're predicting the future, how does it go wrong in your view?"}, {"time": 5988, "text": "We have the mechanisms, we have now explored enough technologies to where we can actually, I think, sustainably produce what most people in the world need to live."}, {"time": 6003, "text": "We have also created the infrastructures to allow continued research and development of additional science and medicine and various other kinds of things."}, {"time": 6016, "text": "The organizing principles that we use to govern all these things today have been, a lot of them have been just inherited from honestly medieval times."}, {"time": 6028, "text": "Some of them have refactored a little bit in the industrial era, but a lot of these modes of organizing people are deeply problematic."}, {"time": 6038, "text": "And furthermore, they're rooted in, I think, a very industrial mode perspective on human labor."}, {"time": 6046, "text": "And this is one of those things, I'm gonna go back to the open source thing."}, {"time": 6049, "text": "There was a point in time when, well, let me ask you this."}, {"time": 6053, "text": "If you look at the core SciPy sort of collection of libraries, so SciPy, NumPy, Matplotlib, right?"}, {"time": 6059, "text": "There's iPython Notebook, let's throw pandas in there, scikit learn, a few of these things."}, {"time": 6063, "text": "How much value do you think, economic value, would you say they drive in the world today?"}, {"time": 6070, "text": "That's one of the fascinating things about talking to you and Travis is like, it's a measure, it's like a... At least a billion dollars a day, maybe?"}, {"time": 6080, "text": "A billion dollars, sure."}, {"time": 6081, "text": "I mean, it's like, it's similar question of like, how much value does Wikipedia create?"}, {"time": 6086, "text": "It's like, all of it, I don't know."}, {"time": 6090, "text": "Well, I mean, if you look at it, all of it, I don't know."}, {"time": 6093, "text": "Well, I mean, if you look at our systems, when you do a Google search, right?"}, {"time": 6096, "text": "Now, some of that stuff runs through TensorFlow, but when you look at Siri, when you do credit card transaction fraud, like just everything, right?"}, {"time": 6103, "text": "Every intelligence agency under the sun, they're using some aspect of these kinds of tools."}, {"time": 6107, "text": "So I would say that these create billions of dollars of value."}, {"time": 6112, "text": "Oh, you mean like direct use of tools that leverage this data?"}, {"time": 6114, "text": "Yes, direct, yeah."}, {"time": 6115, "text": "Yeah, even that's billions a day, yeah."}, {"time": 6116, "text": "Yeah, right, easily, I think."}, {"time": 6118, "text": "Like the things they could not do if they didn't have these tools, right?"}, {"time": 6122, "text": "So that's billions of dollars a day, great."}, {"time": 6124, "text": "I think that's about right."}, {"time": 6125, "text": "Now, if we take, how many people did it take to make that, right?"}, {"time": 6129, "text": "And there was a point in time, not anymore, but there was a point in time when they could fit in a van."}, {"time": 6133, "text": "I could have fit them in my Mercedes winter, right?"}, {"time": 6135, "text": "And so if you look at that, like, holy crap, literally a van of maybe a dozen people could create value to the tune of billions of dollars a day."}, {"time": 6148, "text": "What lesson do you draw from that?"}, {"time": 6151, "text": "What can we do to do more of that?"}, {"time": 6155, "text": "Like that's open source."}, {"time": 6156, "text": "The way I've talked about this in other environments is when we use generative participatory crowdsourced approaches, we unlock human potential at a level that is better than what capitalism can do."}, {"time": 6172, "text": "I would challenge anyone to go and try to hire the right 12 people in the world to build that entire stack the way those 12 people did that, right?"}, {"time": 6182, "text": "They would be very, very hard pressed to do that."}, {"time": 6184, "text": "If a hedge fund could just hire a dozen people and create like something that is worth billions of dollars a day, every single one of them would be racing to do it, right?"}, {"time": 6192, "text": "But finding the right people, fostering the right collaborations, getting it adopted by the right other people to then refine it, that is a thing that was organic in nature."}, {"time": 6201, "text": "That took crowdsourcing."}, {"time": 6202, "text": "That took a lot of the open source ethos and it took the right kinds of people, right?"}, {"time": 6206, "text": "Now those people who started that said, I need to have a part of a multi billion dollar a day sort of enterprise."}, {"time": 6212, "text": "They're like, I'm doing this cool thing to solve my problem for my friends, right?"}, {"time": 6215, "text": "So the point of telling the story is to say that our way of thinking about value, our way of thinking about allocation of resources, our ways of thinking about property rights and all these kinds of things, they come from finite game, scarcity mentality, medieval institutions."}, {"time": 6232, "text": "As we are now entering, to some extent we're sort of in a post scarcity era, although some people are hoarding a whole lot of stuff."}, {"time": 6239, "text": "We are at a point where if not now soon, we'll be in a post scarcity era."}, {"time": 6243, "text": "The question of how we allocate resources has to be revisited at a fundamental level because the kind of software these people built, the modalities that those human ecologies that built that software, it treats offers unproperty."}, {"time": 6257, "text": "Actually sharing creates value."}, {"time": 6260, "text": "Restricting and forking reduces value."}, {"time": 6263, "text": "So that's different than any other physical resource that we've ever dealt with."}, {"time": 6267, "text": "It's different than how most corporations treat software IP, right?"}, {"time": 6271, "text": "So if treating software in this way created this much value so efficiently, so cheaply, because feeding a dozen people for 10 years is really cheap, right?"}, {"time": 6305, "text": "So we can actually get to a mode where all of this additional generative things that humans are doing, they don't have to be wrapped up in a container and then we charge for all the exponential dynamics out of it."}, {"time": 6319, "text": "That's what Facebook did."}, {"time": 6320, "text": "That's what modern social media did, right?"}, {"time": 6322, "text": "Because the old internet was connecting people just fine."}, {"time": 6324, "text": "So Facebook came along and said, well, anyone can post a picture, anyone can post some text and we're gonna amplify the crap out of it to everyone else."}, {"time": 6331, "text": "And it exploded this generative network of human interaction."}, {"time": 6334, "text": "And then I said, how do I make money off that?"}, {"time": 6336, "text": "Oh yeah, I'm gonna be a gatekeeper on everybody's attention."}, {"time": 6339, "text": "And that's how I'm gonna make money."}, {"time": 6341, "text": "So how do we create more than one van?"}, {"time": 6345, "text": "How do we have millions of vans full of people that create NumPy, SciPy, that create Python?"}, {"time": 6351, "text": "So the story of those people is often they have some kind of job outside of this."}, {"time": 6357, "text": "This is what they're doing for fun."}, {"time": 6358, "text": "Don't you need to have a job?"}, {"time": 6360, "text": "Don't you have to be connected, plugged in to the capitalist system?"}, {"time": 6364, "text": "Isn't that what, isn't this consumerism, the engine that results in the individuals that kind of take a break from it every once in a while to create something magical?"}, {"time": 6377, "text": "Like at the edges is where the innovation happens."}, {"time": 6379, "text": "There's a surplus, right, this is the question."}, {"time": 6381, "text": "Like if everyone were to go and run their own farm, no one would have time to go and write NumPy, SciPy, right?"}, {"time": 6387, "text": "Maybe, but that's what I'm talking about when I say we're maybe at a post scarcity point for a lot of people."}, {"time": 6394, "text": "The question that we're never encouraged to ask in a Super Bowl ad is how much do you need?"}, {"time": 6400, "text": "How much is enough?"}, {"time": 6401, "text": "Do you need to have a new car every two years, every five?"}, {"time": 6405, "text": "If you have a reliable car, can you drive one for 10 years, is that all right?"}, {"time": 6408, "text": "I had a car for 10 years and it was fine."}, {"time": 6410, "text": "Your iPhone, do you have to upgrade every two years?"}, {"time": 6412, "text": "I mean, it's sort of, you're using the same apps you did four years ago, right?"}, {"time": 6416, "text": "This should be a Super Bowl ad."}, {"time": 6418, "text": "This should be a Super Bowl ad, that's great."}, {"time": 6419, "text": "Maybe somebody."}, {"time": 6419, "text": "Do you really need a new iPhone?"}, {"time": 6421, "text": "Maybe one of our listeners will fund something like this of like, no, but just actually bringing it back, bringing it back to actually the question of what do you need?"}, {"time": 6467, "text": "And for Travis, that was throwing away his shot of tenure in order to write NumPy."}, {"time": 6472, "text": "For others, there is a saying in the SciFi community that SciFi advances one failed postdoc at a time."}, {"time": 6480, "text": "And that's, we can do these things."}, {"time": 6483, "text": "We can actually do this kind of collaboration because code, software, information, organization, that's cheap."}, {"time": 6489, "text": "Those bits are very cheap to fling across the oceans."}, {"time": 6493, "text": "So you mentioned Travis."}, {"time": 6494, "text": "We've been talking and we'll continue to talk about open source."}, {"time": 6499, "text": "Maybe you can comment."}, {"time": 6500, "text": "How did you meet Travis?"}, {"time": 6501, "text": "Who is Travis Aliphant?"}, {"time": 6504, "text": "What's your relationship been like through the years?"}, {"time": 6508, "text": "Where did you work together?"}, {"time": 6510, "text": "How did you meet?"}, {"time": 6511, "text": "What's the present and the future look like?"}, {"time": 6515, "text": "Yeah, so the first time I met Travis was at a SciFi conference in Pasadena."}, {"time": 6519, "text": "Do you remember the year?"}, {"time": 6520, "text": "2005."}, {"time": 6522, "text": "I was working at, again, at nthought, working on scientific computing consulting."}, {"time": 6527, "text": "And a couple of years later, he joined us at nthought, I think 2007."}, {"time": 6535, "text": "And he came in as the president."}, {"time": 6538, "text": "One of the founders of nthought was the CEO, Eric Jones."}, {"time": 6541, "text": "And we were all very excited that Travis was joining us and that was great fun."}, {"time": 6545, "text": "And so I worked with Travis on a number of consulting projects and we worked on some open source stuff."}, {"time": 6552, "text": "I mean, it was just a really, it was a good time there."}, {"time": 6555, "text": "It was primarily Python related?"}, {"time": 6557, "text": "Oh yeah, it was all Python, NumPy, SciFi consulting kind of stuff."}, {"time": 6561, "text": "Towards the end of that time, we started getting called into more and more finance shops."}, {"time": 6567, "text": "They were adopting Python pretty heavily."}, {"time": 6569, "text": "I did some work on like a high frequency trading shop, working on some stuff."}, {"time": 6574, "text": "And then we worked together on some, at a couple of investment banks in Manhattan."}, {"time": 6579, "text": "And so we started seeing that there was a potential to take Python in the direction of business computing, more than just being this niche like MATLAB replacement for big vector computing."}, {"time": 6590, "text": "What we were seeing was, oh yeah, you could actually use Python as a Swiss army knife to do a lot of shadow data transformation kind of stuff."}, {"time": 6596, "text": "So that's when we realized the potential is much greater."}, {"time": 6600, "text": "And so we started Anaconda, I mean, it was called Continuum Analytics at the time, but we started in January of 2012 with a vision of shoring up the parts of Python that needed to get expanded to handle data at scale, to do web visualization, application development, et cetera."}, {"time": 6617, "text": "And that was that, yeah."}, {"time": 6618, "text": "So he was CEO and I was president for the first five years."}, {"time": 6623, "text": "And then we raised some money and then the board, it was sort of put in a new CEO."}, {"time": 6628, "text": "They hired a kind of professional CEO."}, {"time": 6631, "text": "And then Travis, you laugh at that."}, {"time": 6634, "text": "I took over the CTO role."}, {"time": 6635, "text": "Travis then left after a year to do his own thing, to do Quonsight, which was more oriented around some of the bootstrap years that we did at Continuum where it was open source and consulting."}, {"time": 6646, "text": "It wasn't sort of like gung ho product development."}, {"time": 6648, "text": "And it wasn't focused on, we accidentally stumbled into the package management problem at Anaconda, but we had a lot of other visions of other technology that we built in the open source."}, {"time": 6658, "text": "And Travis was really trying to push, again, the frontiers of numerical computing, vector computing, handling things like auto differentiation and stuff intrinsically in the open ecosystem."}, {"time": 6669, "text": "So I think that's kind of the direction he's working on in some of his work."}, {"time": 6678, "text": "We remain great friends and colleagues and collaborators, even though he's no longer day to day working at Anaconda, but he gives me a lot of feedback about this and that and the other."}, {"time": 6689, "text": "What's a big lesson you've learned from Travis about life or about programming or about leadership?"}, {"time": 6695, "text": "Wow, there's a lot."}, {"time": 6697, "text": "Travis is a really, really good guy."}, {"time": 6699, "text": "He really, his heart is really in it."}, {"time": 6701, "text": "He cares a lot."}, {"time": 6704, "text": "I've gotten that sense having to interact with him."}, {"time": 6707, "text": "Such a good human being."}, {"time": 6708, "text": "He's a really good dude."}, {"time": 6709, "text": "And he and I, it's so interesting."}, {"time": 6711, "text": "We come from very different backgrounds."}, {"time": 6713, "text": "We're quite different as people, but I think we can like not talk for a long time and then be on a conversation and be eye to eye on like 90% of things."}, {"time": 6726, "text": "And so he's someone who I believe no matter how much fog settles in over the ocean, his ship, my ship are pointed sort of in the same direction of the same star."}, {"time": 6734, "text": "Wow, that's a beautiful way to phrase it."}, {"time": 6736, "text": "No matter how much fog there is, we're pointed at the same star."}, {"time": 6740, "text": "Yeah, and I hope he feels the same way."}, {"time": 6741, "text": "I mean, I hope he knows that over the years now."}, {"time": 6743, "text": "We both care a lot about the community."}, {"time": 6747, "text": "For someone who cares so deeply, I would say this about Travis that's interesting."}, {"time": 6749, "text": "For someone who cares so deeply about the nerd details of like type system design and vector computing and efficiency of expressing this and that and the other, memory layouts and all that stuff, he cares even more about the people in the ecosystem, the community."}, {"time": 6765, "text": "And I have a similar kind of alignment."}, {"time": 6769, "text": "I care a lot about the tech, I really do."}, {"time": 6773, "text": "But for me, the beauty of what this human ecology has produced is I think a touchstone."}, {"time": 6781, "text": "It's an early version, we can look at it and say, how do we replicate this for humanity at scale?"}, {"time": 6785, "text": "What this open source collaboration was able to produce?"}, {"time": 6788, "text": "How can we be generative in human collaboration moving forward and create that as a civilizational kind of dynamic?"}, {"time": 6795, "text": "Like, can we seize this moment to do that?"}, {"time": 6797, "text": "Because like a lot of the other open source movements, it's all nerds nerding out on code for nerds."}, {"time": 6803, "text": "And this because it's scientists, because it's people working on data, that all of it faces real human problems."}, {"time": 6811, "text": "I think we have an opportunity to actually make a bigger impact."}, {"time": 6814, "text": "Is there a way for this kind of open source vision to make money?"}, {"time": 6820, "text": "To fund the people involved?"}, {"time": 6821, "text": "Is that an essential part of it?"}, {"time": 6823, "text": "It's hard, but we're trying to do that in our own way at Anaconda, because we know that business users, as they use more of the stuff, they have needs, like business specific needs around security, provenance."}, {"time": 6834, "text": "They really can't tell their VPs and their investors, hey, we're having, our data scientists are installing random packages from who knows where and running on customer data."}, {"time": 6844, "text": "So they have to have someone to talk to you."}, {"time": 6845, "text": "And that's what Anaconda does."}, {"time": 6847, "text": "So we are a governed source of packages for them, and that's great, that makes some money."}, {"time": 6852, "text": "We take some of that and we just take that as a dividend."}, {"time": 6856, "text": "We take a percentage of our revenues and write that as a dividend for the open source community."}, {"time": 6860, "text": "But beyond that, I really see the development of a marketplace for people to create notebooks, models, data sets, curation of these different kinds of things, and to really have a long tail marketplace dynamic with that."}, {"time": 6877, "text": "Can you speak about this problem that you stumbled into of package management, Python package management?"}, {"time": 6886, "text": "A lot of people speak very highly of Conda, which is part of Anaconda, which is a package manager."}, {"time": 6890, "text": "There's a ton of packages."}, {"time": 6892, "text": "So first, what are package managers?"}, {"time": 6895, "text": "And second, what was there before?"}, {"time": 6897, "text": "What is pip?"}, {"time": 6898, "text": "And why is Conda more awesome?"}, {"time": 6901, "text": "The package problem is this, which is that in order to do numerical computing efficiently with Python, there are a lot of low level libraries that need to be compiled, compiled with a C compiler or C++ compiler or Fortran compiler."}, {"time": 6919, "text": "They need to not just be compiled, but they need to be compiled with all of the right settings."}, {"time": 6923, "text": "And oftentimes those settings are tuned for specific chip architectures."}, {"time": 6927, "text": "And when you add GPUs to the mix, when you look at different operating systems, you may be on the same chip, but if you're running Mac versus Linux versus Windows on the same x86 chip, you compile and link differently."}, {"time": 6940, "text": "All of this complexity is beyond the capability of most data scientists to reason about."}, {"time": 6946, "text": "And it's also beyond what most of the package developers want to deal with too."}, {"time": 6951, "text": "Because if you're a package developer, you're like, I code on Linux."}, {"time": 6954, "text": "This works for me, I'm good."}, {"time": 6955, "text": "It is not my problem to figure out how to build this on an ancient version of Windows, right?"}, {"time": 6960, "text": "That's just simply not my problem."}, {"time": 6961, "text": "So what we end up with is we have a creator economy or create a very creative crowdsourced environment where people want to use this stuff, but they can't."}, {"time": 6971, "text": "And so we ended up creating a new set of technologies like a build recipe system, a build system and an installer system that is able to, well, to put it simply, it's able to build these packages correctly on each of these different kinds of platforms and operating systems, and make it so when people want to install something, they can, it's just one command."}, {"time": 6994, "text": "They don't have to set up a big compiler system and do all these things."}, {"time": 6998, "text": "So when it works well, it works great."}, {"time": 7000, "text": "Now, the difficulty is we have literally thousands of people writing code in the ecosystem, building all sorts of stuff and each person writing code, they may take a dependence on something else."}, {"time": 7010, "text": "And so you have all this web, incredibly complex web of dependencies."}, {"time": 7014, "text": "So installing the correct package for any given set of packages you want, getting that right subgraph is an incredibly hard problem."}, {"time": 7024, "text": "And again, most data scientists don't want to think about this."}, {"time": 7026, "text": "They're like, I want to install NumPy and pandas."}, {"time": 7029, "text": "I want this version of some like geospatial library."}, {"time": 7031, "text": "I want this other thing."}, {"time": 7033, "text": "Like, why is this hard?"}, {"time": 7034, "text": "These exist, right?"}, {"time": 7035, "text": "And it is hard because it's, well, you're installing this on a version of Windows, right?"}, {"time": 7040, "text": "And half of these libraries are not built for Windows or the latest version isn't available, but the old version was."}, {"time": 7046, "text": "And if you go to the old version of this library, that means you need to go to a different version of that library."}, {"time": 7050, "text": "And so the Python ecosystem, by virtue of being crowdsourced, we were able to fill a hundred thousand different niches."}, {"time": 7058, "text": "But then we also suffer this problem that because it's crowdsourced and no one, it's like a tragedy of the commons, right?"}, {"time": 7064, "text": "No one really needs, wants to support their thousands of other dependencies."}, {"time": 7069, "text": "So we end up sort of having to do a lot of this."}, {"time": 7072, "text": "And of course the conda forge community also steps up as an open source community that, you know, maintain some of these recipes."}, {"time": 7077, "text": "That's what conda does."}, {"time": 7078, "text": "Now, pip is a tool that came along after conda, to some extent, it came along as an easier way for the Python developers writing Python code that didn't have as much compiled, you know, stuff."}, {"time": 7092, "text": "They could then install different packages."}, {"time": 7095, "text": "And what ended up happening in the Python ecosystem was that a lot of the core Python and web Python developers, they never ran into any of this compilation stuff at all."}, {"time": 7104, "text": "So even we have, you know, on video, we have Guido van Rossum saying, you know what, the scientific community's packaging problems are just too exotic and different."}, {"time": 7113, "text": "I mean, you're talking about Fortran compilers, right?"}, {"time": 7115, "text": "Like you guys just need to build your own solution perhaps, right?"}, {"time": 7118, "text": "So the Python core Python community went and built its own sort of packaging technologies, not really contemplating the complexity of this stuff over here."}, {"time": 7129, "text": "And so now we have the challenge where you can pip install some things, some libraries, if you just want to get started with them, you can pip install TensorFlow and that works great."}, {"time": 7137, "text": "The instant you want to also install some other packages that use different versions of NumPy or some like graphics library or some OpenCV thing or some other thing, you now run into dependency hell because you cannot, you know, OpenCV can have a different version of libjpeg over here than PyTorch over here."}, {"time": 7154, "text": "Like they actually, they all have to use the, if you want to use GPU acceleration, they have to all use the same underlying drivers and same GPU CUDA things."}, {"time": 7160, "text": "So it's, it gets to be very gnarly and it's a level of technology that both the makers and the users don't really want to think too much about."}, {"time": 7168, "text": "And that's where you step in and try to solve this."}, {"time": 7170, "text": "We try to solve it."}, {"time": 7171, "text": "Subgraph problems."}, {"time": 7172, "text": "How much is that?"}, {"time": 7173, "text": "I mean, you said that you don't want to think, they don't want to think about it, but how much is it a little bit on the developer and providing them tools to be a little bit more clear of that subgraph of dependency that's necessary?"}, {"time": 7184, "text": "It is getting to a point where we do have to think about, look, can we pull some of the most popular packages together and get them to work on a coordinated release timeline, get them to build against the same test matrix, et cetera, et cetera, right?"}, {"time": 7197, "text": "And there is a little bit of dynamic around this, but again, it is a volunteer community."}, {"time": 7202, "text": "You know, people working on these different projects have their own timelines and their own things they're trying to meet."}, {"time": 7207, "text": "So we end up trying to pull these things together."}, {"time": 7211, "text": "And then it's this incredibly, and I would recommend just as a business tip, don't ever go into business where when your hard work works, you're invisible."}, {"time": 7219, "text": "And when it breaks because of someone else's problem, you get flagged for it."}, {"time": 7223, "text": "Because that's in our situation, right?"}, {"time": 7225, "text": "When something doesn't condensate all properly, usually it's some upstream issue, but it looks like condensate is broken."}, {"time": 7230, "text": "It looks like, you know, Anaconda screwed something up."}, {"time": 7232, "text": "When things do work though, it's like, oh yeah, cool."}, {"time": 7234, "text": "It's worked."}, {"time": 7235, "text": "Assuming naturally, of course, it's very easy to make that work, right?"}, {"time": 7238, "text": "So we end up in this kind of problematic scenario, but it's okay because I think we're still, you know, our heart's in the right place."}, {"time": 7246, "text": "We're trying to move this forward as a community sort of affair."}, {"time": 7249, "text": "I think most of the people in the community also appreciate the work we've done over the years to try to move these things forward in a collaborative fashion, so."}, {"time": 7257, "text": "One of the subgraphs of dependencies that became super complicated is the move from Python 2 to Python 3."}, {"time": 7265, "text": "So there's all these ways to mess with these kinds of ecosystems of packages and so on."}, {"time": 7271, "text": "So I just want to ask you about that particular one."}, {"time": 7273, "text": "What do you think about the move from Python 2 to 3?"}, {"time": 7278, "text": "Why did it take so long?"}, {"time": 7279, "text": "What were, from your perspective, just seeing the packages all struggle and the community all struggle through this process, what lessons do you take away from it?"}, {"time": 7289, "text": "Looking back, some people perhaps underestimated how much adoption Python 2 had."}, {"time": 7298, "text": "I think some people also underestimated how much, or they overestimated how much value some of the new features in Python 3 really provided."}, {"time": 7307, "text": "Like the things they really loved about Python 3 just didn't matter to some of these people in Python 2."}, {"time": 7312, "text": "Because this change was happening as Python, SciPy, was starting to take off really like past, like a hockey stick of adoption in the early data science era, in the early 2010s."}, {"time": 7322, "text": "A lot of people were learning and onboarding in whatever just worked."}, {"time": 7326, "text": "And the teachers were like, well, yeah, these libraries I need are not supported in Python 3 yet, I'm going to teach you Python 2."}, {"time": 7332, "text": "Took a lot of advocacy to get people to move over to Python 3."}, {"time": 7335, "text": "So I think it wasn't any particular single thing, but it was one of those death by a dozen cuts, which just really made it hard to move off of Python 2."}, {"time": 7345, "text": "And also Python 3 itself, as they were kind of breaking things and changing things around and reorganizing the standard library, there's a lot of stuff that was happening there that kept giving people an excuse to say, I'll put off till the next version."}, {"time": 7357, "text": "2 is working fine enough for me right now."}, {"time": 7359, "text": "So I think that's essentially what happened there."}, {"time": 7361, "text": "And I will say this though, the strength of the Python data science movement, I think is what kept Python alive in that transition."}, {"time": 7372, "text": "Because a lot of languages have died and left their user bases behind."}, {"time": 7376, "text": "If there wasn't the use of Python for data, there's a good chunk of Python users that during that transition, would have just left for Go and Rust and stayed."}, {"time": 7384, "text": "In fact, some people did."}, {"time": 7386, "text": "They moved to Go and Rust and they just never looked back."}, {"time": 7388, "text": "The fact that we were able to grow by millions of users, the Python data community, that is what kept the momentum for Python going."}, {"time": 7398, "text": "And now the usage of Python for data is over 50% of the overall Python user base."}, {"time": 7404, "text": "So I'm happy to debate that on stage somewhere, I don't know if they really wanna take issue with that statement, but from where I sit, I think that's true."}, {"time": 7412, "text": "The statement there, the idea is that the switch from Python 2 to Python 3 would have probably destroyed Python if it didn't also coincide with Python for whatever reason, just overtaking the data science community, anything that processes data."}, {"time": 7431, "text": "So like the timing was perfect that this maybe imperfect decision was coupled with a great timing on the value of data in our world."}, {"time": 7442, "text": "I would say the troubled execution of a good decision."}, {"time": 7444, "text": "It was a decision that was necessary."}, {"time": 7447, "text": "It's possible if we had more resources, we could have done in a way that was a little bit smoother, but ultimately, the arguments for Python 3, I bought them at the time and I buy them now, right?"}, {"time": 7457, "text": "Having great text handling is like a nonnegotiable table stakes thing you need to have in a language."}, {"time": 7463, "text": "So that's great, but the execution, Python is the, it's volunteer driven."}, {"time": 7473, "text": "It's like now the most popular language on the planet, but it's all literally volunteers."}, {"time": 7477, "text": "So the lack of resources meant that they had to really, they had to do things in a very hamstrung way."}, {"time": 7483, "text": "And I think to carry the Python momentum in the language through that time, the data movement was a critical part of that."}, {"time": 7489, "text": "So some of it is carrot and stick, I actually have to shamefully admit that it took me a very long time to switch from Python 2 and Python 3 because I'm a machine learning person."}, {"time": 7500, "text": "It was just for the longest time, you could just do fine with Python 2."}, {"time": 7504, "text": "But I think the moment where I switched everybody I worked with and switched myself for small projects and big is when finally, when NumPy announced that they're going to end support like in 2020 or something like that."}, {"time": 7523, "text": "So like when I realized, oh, this isn't going, this is going to end."}, {"time": 7528, "text": "So that's the stick, that's not a carrot."}, {"time": 7529, "text": "That's not, so for the longest time it was carrots."}, {"time": 7531, "text": "It was like all of these packages were saying, okay, we have Python 3 support now, come join us."}, {"time": 7537, "text": "We have Python 2 and Python 3, but when NumPy, one of the packages I sort of love and depend on said like, nope, it's over."}, {"time": 7547, "text": "That's when I decided to switch."}, {"time": 7550, "text": "I wonder if you think it was possible much earlier for somebody like NumPy or some major package to step into the cold and say like we're ending this."}, {"time": 7563, "text": "Well, it's a chicken and egg problem too, right?"}, {"time": 7565, "text": "You don't want to cut off a lot of users unless you see the user momentum going too."}, {"time": 7569, "text": "So the decisions for the scientific community for each of the different projects, you know, there's not a monolith."}, {"time": 7575, "text": "Some projects are like, we'll only be releasing new features on Python 3."}, {"time": 7578, "text": "And that was more of a sticky carrot, right?"}, {"time": 7581, "text": "A firm carrot, if you will, a firm carrot."}, {"time": 7586, "text": "A stick shaped carrot."}, {"time": 7587, "text": "But then for others, yeah, NumPy in particular, cause it's at the base of the dependency stack for so many things, that was the final stick."}, {"time": 7596, "text": "That was a stick shaped stick."}, {"time": 7597, "text": "People were saying, look, if I have to keep maintaining my releases for Python 2, that's that much less energy that I can put into making things better for the Python 3 folks or in my new version, which is of course going to be Python 3."}, {"time": 7609, "text": "So people were also getting kind of pulled by this tension."}, {"time": 7613, "text": "So the overall community sort of had a lot of input into when the NumPy core folks decided that they would end of life on Python 2."}, {"time": 7621, "text": "So as these numbers are a little bit loose, but there are about 10 million Python programmers in the world, you could argue that number, but let's say 10 million."}, {"time": 7630, "text": "That's actually where I was looking, said 27 million total programmers, developers in the world."}, {"time": 7637, "text": "You mentioned in a talk that changes need to be made for there to be 100 million Python programmers."}, {"time": 7644, "text": "So first of all, do you see a future where there's 100 million Python programmers?"}, {"time": 7648, "text": "And second, what kind of changes need to be made?"}, {"time": 7651, "text": "So Anaconda and Miniconda get downloaded about a million times a week."}, {"time": 7654, "text": "So I think the idea that there's only 10 million Python programmers in the world is a little bit undercounting."}, {"time": 7661, "text": "There are a lot of people who escape traditional counting that are using Python and data in their jobs."}, {"time": 7668, "text": "I do believe that the future world for it to, well, the world I would like to see is one where people are data literate."}, {"time": 7676, "text": "So they are able to use tools that let them express their questions and ideas fluidly."}, {"time": 7683, "text": "And the data variety and data complexity will not go down."}, {"time": 7686, "text": "It will only keep increasing."}, {"time": 7688, "text": "So I think some level of code or code like things will continue to be relevant."}, {"time": 7695, "text": "And so my hope is that we can build systems that allow people to more seamlessly integrate Python kinds of expressivity with data systems and operationalization methods that are much more seamless."}, {"time": 7711, "text": "And what I mean by that is, you know, right now you can't punch Python code into an Excel cell."}, {"time": 7715, "text": "I mean, there's some tools you can do to kind of do this."}, {"time": 7717, "text": "We didn't build a thing for doing this back in the day, but I feel like the total addressable market for Python users, if we do the things right, is on the order of the Excel users, which is, you know, a few hundred million."}, {"time": 7731, "text": "So I think Python has to get better at being embedded, you know, being a smaller thing that pulls in just the right parts of the ecosystem to run numerics and do data exploration, meeting people where they're already at with their data and their data tools."}, {"time": 7749, "text": "And then I think also it has to be easier to take some of those things they've written and flow those back into deployed systems or little apps or visualizations."}, {"time": 7759, "text": "I think if we don't do those things, then we will always be kept in a silo as sort of an expert user's tool and not a tool for the masses."}, {"time": 7767, "text": "You know, I work with a bunch of folks in the Adobe Creative Suite, and I'm kind of forcing them or inspired them to learn Python, to do a bunch of stuff that helps them."}, {"time": 7778, "text": "And it's interesting, because they probably wouldn't call themselves Python programmers, but they're all using Python."}, {"time": 7783, "text": "I would love it if the tools like Photoshop and Premiere and all those kinds of tools that are targeted towards creative people, I guess that's where Excel, Excel is targeted towards a certain kind of audience that works with data, financial people, all that kind of stuff, if there would be easy ways to leverage to use Python for quick scripting tasks."}, {"time": 7803, "text": "And you know, there's an exciting application of artificial intelligence in this space that I'm hopeful about, looking at open AI codecs with generating programs."}, {"time": 7848, "text": "So that to me is a really exciting possibility, because I think there's a friction to kind of, like how do I learn how to use Python in my life?"}, {"time": 7858, "text": "There's oftentimes you kind of start a class, you start learning about types, I don't know, functions."}, {"time": 7867, "text": "Like this is, you know, Python is the first language with which you start to learn to program."}, {"time": 7871, "text": "But I feel like that's going to take a long time for you to understand why it's useful."}, {"time": 7878, "text": "You almost want to start with a script."}, {"time": 7880, "text": "Well, you do, in fact."}, {"time": 7882, "text": "I think starting with the theory behind programming languages and types and all that, I mean, types are there to make the compiler writer's jobs easier."}, {"time": 7890, "text": "Types are not, I mean, heck, do you have an ontology of types or just the objects on this table?"}, {"time": 7895, "text": "So types are there because compiler writers are human and they're limited in what they can do."}, {"time": 7900, "text": "But I think that the beauty of scripting, like there's a Python book that's called \"'Automate the Boring Stuff,' which is exactly the right mentality."}, {"time": 7911, "text": "I grew up with computers in a time when I could, when Steve Jobs was still pitching these things as bicycles for the mind."}, {"time": 7919, "text": "They were supposed to not be just media consumption devices, but they were actually, you could write some code."}, {"time": 7925, "text": "You could write basic, you could write some stuff to do some things."}, {"time": 7929, "text": "And that feeling of a computer as a thing that we can use to extend ourselves has all but evaporated for a lot of people."}, {"time": 7937, "text": "So you see a little bit in parts in the current, the generation of youth around Minecraft or Roblox, right?"}, {"time": 7943, "text": "And I think Python, circuit Python, these things could be a renaissance of that, of people actually shaping and using their computers as computers, as an extension of their minds and their curiosity, their creativity."}, {"time": 7957, "text": "So you talk about scripting the Adobe Suite with Python in the 3D graphics world."}, {"time": 7962, "text": "Python is a scripting language that some of these 3D graphics suites use."}, {"time": 7968, "text": "And I think that's great."}, {"time": 7969, "text": "We should better support those kinds of things."}, {"time": 7971, "text": "But ultimately the idea that I should be able to have power over my computing environment."}, {"time": 7976, "text": "If I want these things to happen repeatedly all the time, I should be able to say that somehow to the computer, right?"}, {"time": 7982, "text": "Now, whether the operating systems get there faster by having some Siri backed with open AI with whatever."}, {"time": 7989, "text": "So you can just say, Siri, make this do this and this and every other Friday, right?"}, {"time": 7992, "text": "We probably will get there somewhere."}, {"time": 7994, "text": "And Apple's always had these ideas."}, {"time": 7995, "text": "There's the Apple script in the menu that no one ever uses, but you can do these kinds of things."}, {"time": 8001, "text": "But when you start doing that kind of scripting, the challenge isn't learning the type system or even the syntax of the language."}, {"time": 8007, "text": "The challenge is all of the dictionaries and all the objects of all their properties and attributes and parameters."}, {"time": 8012, "text": "Like who's got time to learn all that stuff, right?"}, {"time": 8015, "text": "So that's when then programming by prototype or by example becomes the right way to get the user to express their desire."}, {"time": 8023, "text": "So there's a lot of these different ways that we can approach programming."}, {"time": 8026, "text": "But I do think when, as you were talking about the Adobe scripting thing, I was thinking about, you know, when we do use something like NumPy, when we use things in the Python data and scientific, let's say, expression system, there's a reason we use that, which is that it gives us mathematical precision."}, {"time": 8044, "text": "It gives us actually quite a lot of precision over precisely what we mean about this data set, that data set, and it's the fact that we can have that precision that lets Python be powerful over as a duct tape for data."}, {"time": 8058, "text": "You know, you give me a TSV or a CSV, and if you give me some massively expensive vendor tool for data transformation, I don't know I'm gonna be able to solve your problem."}, {"time": 8068, "text": "But if you give me a Python prompt, you can throw whatever data you want at me."}, {"time": 8072, "text": "I will be able to mash it into shape."}, {"time": 8074, "text": "So that ability to take it as sort of this like, you know, machete out into the data jungle is really powerful."}, {"time": 8081, "text": "And I think that's why at some level, we're not gonna get away from some of these expressions and APIs and libraries in Python for data transformation."}, {"time": 8093, "text": "You've been at the center of the Python community for many years."}, {"time": 8098, "text": "If you could change one thing about the community to help it grow, to help it improve, to help it flourish and prosper, what would it be?"}, {"time": 8109, "text": "I mean, you know, it doesn't have to be one thing, but what kind of comes to mind?"}, {"time": 8115, "text": "Humility is one of the values that we have at Anaconda at the company, but it's also one of the values in the community."}, {"time": 8121, "text": "That it's been breached a little bit in the last few years, but in general, people are quite decent and reasonable and nice."}, {"time": 8129, "text": "And that humility prevents them from seeing the greatness that they could have."}, {"time": 8136, "text": "I don't know how many people in the core Python community really understand that they stand perched at the edge of an opportunity to transform how people use computers."}, {"time": 8150, "text": "And actually, PyCon, I think it's the last physical PyCon I went to, Russell Keith McGee gave a great keynote about very much along the lines of the challenges I have, which is Python, for a language that doesn't actually, that can't put an interface up, put an interface up on the most popular computing devices, it's done really well as a language, hasn't it?"}, {"time": 8171, "text": "You can't write a web front end with Python, really."}, {"time": 8173, "text": "I mean, everyone uses JavaScript."}, {"time": 8175, "text": "You certainly can't write native apps."}, {"time": 8177, "text": "So for a language that you can't actually write apps in any of those front end runtime environments, Python's done exceedingly well."}, {"time": 8186, "text": "And so that wasn't to pat ourselves on the back."}, {"time": 8188, "text": "That was to challenge ourselves as a community to say, we, through our current volunteer dynamic, have gotten to this point."}, {"time": 8194, "text": "What comes next and how do we seize, you know, we've caught the tiger by the tail."}, {"time": 8198, "text": "How do we make sure we keep up with it as it goes forward?"}, {"time": 8200, "text": "So that's one of the questions I have about sort of open source communities, is at its best, there's a kind of humility."}, {"time": 8208, "text": "Is that humility prevent you to have a vision for creating something like very new and powerful?"}, {"time": 8215, "text": "And you've brought us back to consciousness again."}, {"time": 8217, "text": "The collaboration is a swarm emergent dynamic."}, {"time": 8220, "text": "Humility lets these people work together without anyone trouncing anyone else."}, {"time": 8224, "text": "How do they, you know, in consciousness, there's the question of the binding problem."}, {"time": 8228, "text": "How does a singular, our attention, how does that emerge from billions of neurons?"}, {"time": 8233, "text": "So how can you have a swarm of people emerge a consensus that has a singular vision to say, we will do this."}, {"time": 8240, "text": "And most importantly, we're not gonna do these things."}, {"time": 8243, "text": "Emerging a coherent, pointed, focused leadership dynamic from a collaboration, being able to do that kind of, and then dissolve it so people can still do the swarm thing, that's a problem, that's a question."}, {"time": 8257, "text": "So do you have to have a charismatic leader?"}, {"time": 8260, "text": "For some reason, Linus Torvald comes to mind, but there's people who criticize."}, {"time": 8264, "text": "He rules with an iron fist, man."}, {"time": 8266, "text": "But there's still charisma to it."}, {"time": 8268, "text": "There is charisma, right?"}, {"time": 8269, "text": "There's a charisma to that iron fist."}, {"time": 8271, "text": "There's, every leader's different, I would say, in their success."}, {"time": 8276, "text": "So he doesn't, I don't even know if you can say he doesn't have humility, there's such a meritocracy of ideas that like, this is a good idea and this is a bad idea."}, {"time": 8290, "text": "There's a step function to it."}, {"time": 8291, "text": "Once you clear a threshold, he's open."}, {"time": 8293, "text": "Once you clear the bozo threshold, he's open to your ideas, I think, right?"}, {"time": 8297, "text": "But see, the interesting thing is obviously that will not stand in an open source community if that threshold that is defined by that one particular person is not actually that good."}, {"time": 8310, "text": "So you actually have to be really excellent at what you do."}, {"time": 8313, "text": "So he's very good at what he does."}, {"time": 8317, "text": "And so there's some aspect of leadership where you can get thrown out, people can just leave."}, {"time": 8322, "text": "That's how it works with open source, the fork."}, {"time": 8325, "text": "But at the same time, you want to sometimes be a leader like with a strong opinion, because people, I mean, there's some kind of balance here for this like hive mind to get like behind."}, {"time": 8337, "text": "Leadership is a big topic."}, {"time": 8338, "text": "And I didn't, I'm not one of these guys that went to MBA school and said, I'm gonna be an entrepreneur and I'm gonna be a leader."}, {"time": 8343, "text": "And I'm gonna read all these Harvard Business Review articles on leadership and all this other stuff."}, {"time": 8347, "text": "Like I was a physicist turned into a software nerd who then really like nerded out on Python."}, {"time": 8353, "text": "And now I am entrepreneurial, right?"}, {"time": 8354, "text": "I saw a business opportunity around the use of Python for data."}, {"time": 8357, "text": "But for me, what has been interesting over this journey with the last 10 years is how much I started really enjoying the understanding, thinking deeper about organizational dynamics and leadership."}, {"time": 8371, "text": "And leadership does come down to a few core things."}, {"time": 8375, "text": "Number one, a leader has to create belief or at least has to dispel disbelief."}, {"time": 8384, "text": "Leadership also, you have to have vision, loyalty and experience."}, {"time": 8389, "text": "So can you say belief in a singular vision?"}, {"time": 8392, "text": "Like what does belief mean?"}, {"time": 8393, "text": "Yeah, belief means a few things."}, {"time": 8395, "text": "Belief means here's what we need to do and this is a valid thing to do and we can do it."}, {"time": 8401, "text": "That you have to be able to drive that belief."}, {"time": 8406, "text": "And every step of leadership along the way has to help you amplify that belief to more people."}, {"time": 8412, "text": "I mean, I think at a fundamental level, that's what it is."}, {"time": 8415, "text": "You have to have a vision."}, {"time": 8417, "text": "You have to be able to show people that, or you have to convince people to believe in the vision and to get behind you."}, {"time": 8425, "text": "And that's where the loyalty part comes in and the experience part comes in."}, {"time": 8428, "text": "There's all different flavors of leadership."}, {"time": 8430, "text": "So if we talk about Linus, we could talk about Elon Musk and Steve Jobs, there's Sunder Prachai."}, {"time": 8438, "text": "There's people that kind of put themselves at the center and are strongly opinionated."}, {"time": 8442, "text": "And some people are more like consensus builders."}, {"time": 8445, "text": "What works well for open source?"}, {"time": 8447, "text": "What works well in the space of programmers?"}, {"time": 8449, "text": "So you've been a programmer, you've led many programmers that are now sort of at the center of this ecosystem."}, {"time": 8455, "text": "What works well in the programming world would you say?"}, {"time": 8458, "text": "It really depends on the people."}, {"time": 8461, "text": "What style of leadership is best?"}, {"time": 8462, "text": "And it depends on the programming community."}, {"time": 8464, "text": "I think for the Python community, servant leadership is one of the values."}, {"time": 8468, "text": "At the end of the day, the leader has to also be the high priest of values, right?"}, {"time": 8474, "text": "So any collection of people has values of their living."}, {"time": 8479, "text": "And if you want to maintain certain values and those values help you as an organization become more powerful, then the leader has to live those values unequivocally and has to hold the values."}, {"time": 8493, "text": "So in our case, in this collaborative community around Python, I think that the humility is one of those values."}, {"time": 8502, "text": "Servant leadership, you actually have to kind of do the stuff."}, {"time": 8505, "text": "You have to walk the walk, not just talk the talk."}, {"time": 8509, "text": "I don't feel like the Python community really demands that much from a vision standpoint."}, {"time": 8513, "text": "And they should."}, {"time": 8514, "text": "And I think they should."}, {"time": 8516, "text": "This is the interesting thing is like so many people use Python, from where comes the vision?"}, {"time": 8524, "text": "You know, like you have a Elon Musk type character who makes bold statements about the vision for particular companies he's involved with."}, {"time": 8534, "text": "And it's like, I think a lot of people that work at those companies kind of can only last if they believe that vision."}, {"time": 8544, "text": "And some of it is super bold."}, {"time": 8546, "text": "So my question is, and by the way, those companies often use Python."}, {"time": 8552, "text": "How do you establish a vision?"}, {"time": 8553, "text": "Like get to 100 million users, right?"}, {"time": 8557, "text": "Get to where, you know, the Python is at the center of the machine learning and was it data science, machine learning, deep learning, artificial intelligence revolution, right?"}, {"time": 8571, "text": "Like in many ways, perhaps the Python community is not thinking of it that way, but it's leading the way on this."}, {"time": 8578, "text": "Like the tooling is like essential."}, {"time": 8581, "text": "Right, well, you know, for a while, PyCon people in the scientific Python and the PyData community, they would submit talks."}, {"time": 8589, "text": "Those are early 2010s, mid 2010s."}, {"time": 8592, "text": "They would submit talks for PyCon and the talks would all be rejected because there was the separate sort of PyData conferences."}, {"time": 8598, "text": "And like, well, these probably belong more to PyData."}, {"time": 8601, "text": "And instead there'd be yet another talk about, you know, threads and, you know, whatever, some web framework."}, {"time": 8606, "text": "And it's like, that was an interesting dynamic to see that there was, I mean, at the time it was a little annoying because we wanted to try to get more users and get more people talking about these things."}, {"time": 8615, "text": "And PyCon is a huge venue, right?"}, {"time": 8617, "text": "It's thousands of Python programmers."}, {"time": 8620, "text": "But then also came to appreciate that, you know, parallel, having an ecosystem that allows parallel innovation is not bad, right?"}, {"time": 8627, "text": "There are people doing embedded Python stuff."}, {"time": 8629, "text": "There's people doing web programming, people doing scripting, there's cyber uses of Python."}, {"time": 8633, "text": "I think the, ultimately at some point, if your slide mold covers so much stuff, you have to respect that different things are growing in different areas and different niches."}, {"time": 8642, "text": "Now, at some point that has to come together and the central body has to provide resources."}, {"time": 8647, "text": "The principle here is subsidiarity."}, {"time": 8649, "text": "Give resources to the various groups to then allocate as they see fit in their niches."}, {"time": 8655, "text": "That would be a really helpful dynamic."}, {"time": 8656, "text": "But again, it's a volunteer community."}, {"time": 8657, "text": "It's not like they had that many resources to start with."}, {"time": 8661, "text": "What was or is your favorite programming setup?"}, {"time": 8663, "text": "What operating system, what keyboard, how many screens are you listening to?"}, {"time": 8669, "text": "What time of day are you drinking coffee, tea?"}, {"time": 8672, "text": "Tea, sometimes coffee, depending on how well I slept."}, {"time": 8676, "text": "I used to have."}, {"time": 8677, "text": "How much sleep do you get?"}, {"time": 8678, "text": "Are you a night owl?"}, {"time": 8679, "text": "I remember somebody asked you somewhere, a question about work life balance."}, {"time": 8684, "text": "Not just work life balance, but like a family, you lead a company and your answer was basically like, I still haven't figured it out."}, {"time": 8694, "text": "Yeah, I think I've gotten to a little bit better balance."}, {"time": 8696, "text": "I have a really great leadership team now supporting me and so that takes a lot of the day to day stuff off my plate and my kids are getting a little older."}, {"time": 8705, "text": "So, and of course I have a wonderful wife who takes care of a lot of the things that I'm not able to take care of and she's great."}, {"time": 8711, "text": "I try to get to sleep earlier now because I have to get up every morning at six to take my kid down to the bus stop."}, {"time": 8717, "text": "So there's a hard thing."}, {"time": 8719, "text": "For a while I was doing polyphasic sleep, which is really interesting."}, {"time": 8722, "text": "Like I go to bed at nine, wake up at like 2 a.m., work till five, sleep three hours, wake up at eight."}, {"time": 8727, "text": "Like that was actually, it was interesting."}, {"time": 8729, "text": "It wasn't too bad."}, {"time": 8732, "text": "I didn't keep it up for years, but once I have travel, then it just, everything goes out the window, right?"}, {"time": 8737, "text": "Because then you're like time zones and all these things."}, {"time": 8739, "text": "Socially was it, except like were you able to live outside of how you felt?"}, {"time": 8743, "text": "Were you able to live normal society?"}, {"time": 8745, "text": "Oh yeah, because like on the nights that I wasn't out hanging out with people or whatever, going to bed at nine, no one cares."}, {"time": 8750, "text": "I wake up at two, I'm still responding to their slacks, emails, whatever, and you know, shitposting on Twitter or whatever at two in the morning is great, right?"}, {"time": 8759, "text": "And then you go to bed for a few hours and you wake up, it's like you had an extra day in the middle."}, {"time": 8764, "text": "And I'd read somewhere that humans naturally have biphasic sleep or something, I don't know."}, {"time": 8769, "text": "I read basically everything somewhere."}, {"time": 8771, "text": "So every option of everything."}, {"time": 8773, "text": "Every option of everything."}, {"time": 8774, "text": "I will say that that worked out for me for a while, although I don't do it anymore."}, {"time": 8778, "text": "In terms of programming setup, I had a 27 inch high DPI setup that I really liked, but then I moved to a curved monitor just because when I moved to the new house, I want to have a bit more screen for Zoom plus communications plus various kinds of things."}, {"time": 8793, "text": "So it's like one large monitor."}, {"time": 8795, "text": "One large curved monitor."}, {"time": 8798, "text": "What operating system?"}, {"time": 8799, "text": "Mac."}, {"time": 8801, "text": "Is that what happens when you become important, is you stop using Linux and Windows?"}, {"time": 8806, "text": "No, I actually have a Windows box as well on the next table over, but I have three desks, right?"}, {"time": 8814, "text": "So the main one is the standing desk so that I can, whatever, when I'm like, I have a teleprompter set up and everything else."}, {"time": 8820, "text": "And then I've got my iMac and then eGPU and then Windows PC."}, {"time": 8826, "text": "The reason I moved to Mac was it's got a Linux prompt or no, sorry, it's got a, it's got a Unix prompt so I can do all my stuff, but then I don't have to worry."}, {"time": 8838, "text": "Like when I'm presenting for clients or investors or whatever, like it, I don't have to worry about any like ACPI related fsic things in the middle of a presentation, like none of that."}, {"time": 8848, "text": "It just, it will always wake from sleep and it won't kernel panic on me."}, {"time": 8852, "text": "And this is not a dig against Linux, except that I just, I feel really bad."}, {"time": 8858, "text": "I feel like a traitor to my community saying this, right?"}, {"time": 8860, "text": "But in 2012, I was just like, okay, start my own company."}, {"time": 8864, "text": "And Linux laptops were just not quite there."}, {"time": 8867, "text": "And so I've just stuck with Macs."}, {"time": 8868, "text": "Can I just defend something that nobody respectable seems to do, which is, so I do a boot on Linux windows, but in windows, I have a windows subsystems for Linux or whatever, WSL."}, {"time": 8882, "text": "And I find myself being able to handle everything I need and almost everything I need in Linux for basic sort of tasks, scripting tasks within WSL and it creates a really nice environment."}, {"time": 8892, "text": "So I've been, but like whenever I hang out with like, especially important people, like they're all on iPhone and a Mac and it's like, yeah, like what, there is a messiness to windows and a messiness to Linux that makes me feel like you're still in it."}, {"time": 8911, "text": "Well, the Linux stuff, windows subsystem for Linux is very tempting, but there's still the windows on the outside where I don't know where, and I've been, okay, I've used DOS since version 1.11 or 1.21 or something."}, {"time": 8925, "text": "So I've been a long time Microsoft user."}, {"time": 8928, "text": "And I will say that like, it's really hard for me to know where anything is, how to get to the details behind something when something screws up as an invariably does and just things like changing group permissions on some shared folders and stuff, just everything seems a little bit more awkward, more clicks than it needs to be."}, {"time": 8946, "text": "Not to say that there aren't weird things like hidden attributes and all this other happy stuff on Mac, but for the most part, and well, actually, especially now with the new hardware coming out on Mac, it'll be very interesting with the new M1."}, {"time": 8960, "text": "There were some dark years in the last few years when I was like, I think maybe I have to move off of Mac as a platform, but this, I mean, like my keyboard was just not working."}, {"time": 8969, "text": "Like literally my keyboard just wasn't working, right?"}, {"time": 8971, "text": "I had this touch bar, didn't have a physical escape button like I needed to because I used Vim, and now I think we're back, so."}, {"time": 8977, "text": "So you use Vim and you have a, what kind of keyboard?"}, {"time": 8980, "text": "So I use a RealForce 87U, it's a mechanical, it's a Topre keyswitch."}, {"time": 8985, "text": "Like it's a weird shape, there's a normal shape, okay."}, {"time": 8988, "text": "Well, no, because I say that because I use a Kinesis, and you said some dark, you said you had dark moments."}, {"time": 8995, "text": "I recently had a dark moment, I was like, what am I doing with my life?"}, {"time": 8998, "text": "So I remember sort of flying in a very kind of tight space, and as I'm working, this is what I do on an airplane."}, {"time": 9006, "text": "I pull out a laptop, and on top of the laptop, I'll put a Kinesis keyboard."}, {"time": 9011, "text": "That's hardcore, man."}, {"time": 9012, "text": "I was thinking, is this who I am?"}, {"time": 9013, "text": "Is this what I'm becoming?"}, {"time": 9015, "text": "Will I be this person?"}, {"time": 9016, "text": "Because I'm on Emacs with this Kinesis keyboard, sitting like with everybody around."}, {"time": 9021, "text": "Emacs on Windows."}, {"time": 9023, "text": "On WSL, yeah."}, {"time": 9025, "text": "Yeah, Emacs on Linux on Windows."}, {"time": 9027, "text": "Yeah, on Windows."}, {"time": 9028, "text": "And like everybody around me is using their iPhone to look at TikTok."}, {"time": 9033, "text": "So I'm like in this land, and I thought, you know what?"}, {"time": 9036, "text": "Maybe I need to become an adult and put the 90s behind me, and use like a normal keyboard."}, {"time": 9043, "text": "And then I did some soul searching, and I decided like this is who I am."}, {"time": 9046, "text": "This is me like coming out of the closet to saying I'm Kinesis keyboard all the way."}, {"time": 9050, "text": "I'm going to use Emacs."}, {"time": 9052, "text": "You know who else is a Kinesis fan?"}, {"time": 9055, "text": "Wes McKinney, the creator of Pandas."}, {"time": 9057, "text": "He banged out Pandas on a Kinesis keyboard, I believe."}, {"time": 9060, "text": "I don't know if he's still using one, maybe, but certainly 10 years ago, like he was."}, {"time": 9064, "text": "If anyone's out there, maybe we need to have a Kinesis support group."}, {"time": 9067, "text": "Please reach out."}, {"time": 9068, "text": "Isn't there already one?"}, {"time": 9071, "text": "There's gotta be an RSC channel, man."}, {"time": 9072, "text": "Oh no, and you access it through Emacs."}, {"time": 9078, "text": "Do you still program these days?"}, {"time": 9079, "text": "I do a little bit."}, {"time": 9081, "text": "Honestly, the last thing I did was I had written, I was working with my son to script some Minecraft stuff."}, {"time": 9088, "text": "So I was doing a little bit of that."}, {"time": 9089, "text": "That was the last, literally the last code I wrote."}, {"time": 9093, "text": "Also, I wrote some code to do some cap table evaluation, waterfall modeling kind of stuff."}, {"time": 9099, "text": "What advice would you give to a young person, you said your son, today, in high school, maybe even college, about career, about life?"}, {"time": 9108, "text": "This may be where I get into trouble a little bit."}, {"time": 9111, "text": "We are coming to the end."}, {"time": 9113, "text": "We're rapidly entering a time between worlds."}, {"time": 9116, "text": "So we have a world now that's starting to really crumble under the weight of aging institutions that no longer even pretend to serve the purposes they were created for."}, {"time": 9125, "text": "We are creating technologies that are hurtling billions of people headlong into philosophical crises who they don't even know the philosophical operating systems in their firmware."}, {"time": 9135, "text": "And they're heading into a time when that gets vaporized."}, {"time": 9137, "text": "So for people in high school, and certainly I tell my son this as well, he's in middle school, people in college, you are going to have to find your own way."}, {"time": 9149, "text": "You're going to have to have a pioneer spirit, even if you live in the middle of the most dense urban environment."}, {"time": 9156, "text": "All of human reality around you is the result of the last few generations of humans agreeing to play certain kinds of games."}, {"time": 9167, "text": "A lot of those games no longer operate according to the rules they used to."}, {"time": 9175, "text": "Collapse is nonlinear, but it will be managed."}, {"time": 9178, "text": "And so if you are in a particular social caste or economic caste, and I think it's not kosher to say that about America, but America is a very stratified and classist society."}, {"time": 9194, "text": "There's some mobility, but it's really quite classist."}, {"time": 9197, "text": "And in America, unless you're in the upper middle class, you are headed into very choppy waters."}, {"time": 9203, "text": "So it is really, really good to think and understand the fundamentals of what you need to build a meaningful life for you, your loved ones, with your family."}, {"time": 9215, "text": "And almost all of the technology being created that's consumer facing is designed to own people, to take the four stack of people, to delaminate them, and to own certain portions of that stack."}, {"time": 9230, "text": "And so if you want to be an integral human being, if you want to have your agency and you want to find your own way in the world, when you're young would be a great time to spend time looking at some of the classics around what it means to live a good life, what it means to build connection with people."}, {"time": 9248, "text": "And so much of the status game, so much of the stuff, one of the things that I sort of talk about as we create more and more technology, there's a gradient of technology, and a gradient of technology always leads to a gradient of power."}, {"time": 9262, "text": "And this is Jacques Leleu's point to some extent as well."}, {"time": 9265, "text": "That gradient of power is not going to go away."}, {"time": 9267, "text": "The technologies are going so fast that even people like me who helped create some of the stuff, I'm being left behind."}, {"time": 9273, "text": "Some of the cutting edge research, I don't know what's going on against today."}, {"time": 9276, "text": "You know, I go read some proceedings."}, {"time": 9278, "text": "So as the world gets more and more technological, it will create more and more gradients where people will seize power, economic fortunes."}, {"time": 9288, "text": "And the way they make the people who are left behind okay with their lot in life is they create lottery systems."}, {"time": 9294, "text": "They make you take part in the narrative of your own being trapped in your own economic sort of zone."}, {"time": 9304, "text": "So avoiding those kinds of things is really important."}, {"time": 9307, "text": "Knowing when someone is running game on you basically."}, {"time": 9310, "text": "So these are the things I would tell young people."}, {"time": 9312, "text": "It's a dark message, but it's realism."}, {"time": 9314, "text": "I mean, that's what I see."}, {"time": 9315, "text": "So after you gave some realism, you sit back."}, {"time": 9318, "text": "You sit back with your son."}, {"time": 9319, "text": "You're looking out at the sunset."}, {"time": 9321, "text": "What to him can you give as words of hope and to you from where do you derive hope for the future of our world?"}, {"time": 9332, "text": "So you said at the individual level, you have to have a pioneer mindset to go back to the classics, to understand what is in human nature you can find meaning."}, {"time": 9341, "text": "But at the societal level, what trajectory, when you look up possible trajectories, what gives you hope?"}, {"time": 9347, "text": "What gives me hope is that we have little tremors now shaking people out of the reverie of the fiction of modernity that they've been living in, kind of a late 20th century style modernity."}, {"time": 9360, "text": "That's good, I think."}, {"time": 9362, "text": "Because, and also to your point earlier, people are burning out on some of the social media stuff."}, {"time": 9368, "text": "They're sort of seeing the ugly side, especially the latest news with Facebook and the whistleblower, right?"}, {"time": 9372, "text": "It's quite clear these things are not all they're cracked up to be."}, {"time": 9376, "text": "Do you believe, I believe better social media can be built because they are burning out and it'll incentivize other competitors to be built."}, {"time": 9386, "text": "Well, the thing about it is that when you have extractive return on returns capital coming in and saying, look, you own a network, give me some exponential dynamics out of this network."}, {"time": 9399, "text": "What are you gonna do?"}, {"time": 9399, "text": "You're gonna just basically put a toll keeper at every single node and every single graph edge, every node, every vertex, every edge."}, {"time": 9408, "text": "But if you don't have that need for it, if no one's sitting there saying, hey, Wikipedia, monetize every character, every byte, every phrase, then generative human dynamics will naturally sort of arise, assuming we respect a few principles around online communications."}, {"time": 9423, "text": "So the greatest and biggest social network in the world is still like email, SMS, right?"}, {"time": 9428, "text": "So we're fine there."}, {"time": 9430, "text": "The issue with the social media, as we call it now, is they're actually just new amplification systems, right?"}, {"time": 9436, "text": "Now it's benefited certain people like yourself who have interesting content to be amplified."}, {"time": 9443, "text": "So it's created a creator economy, and that's cool."}, {"time": 9445, "text": "There's a lot of great content out there."}, {"time": 9446, "text": "But giving everyone a shot at the fame lottery, saying, hey, you could also have your, if you wiggle your butt the right way on TikTok, you can have your 15 seconds of micro fame."}, {"time": 9456, "text": "That's not healthy for society at large."}, {"time": 9458, "text": "So I think if we can create tools that help people be conscientious about their attention, spend time looking at the past, and really retrieving memory and calling, not calling, but processing and thinking about that, I think that's certainly possible, and hopefully that's what we get."}, {"time": 9477, "text": "So the bigger question that you're asking about what gives me hope is that these early shocks of COVID lockdowns and remote work and all these different kinds of things, I think it's getting people to a point where they're sort of no longer in the reverie."}, {"time": 9499, "text": "As my friend Jim Rutt says, there's more people with ears to hear now."}, {"time": 9503, "text": "With the pandemic and education, everyone's like, wait, wait, what have you guys been doing with my kids?"}, {"time": 9508, "text": "How are you teaching them?"}, {"time": 9510, "text": "What is this crap you're giving them as homework?"}, {"time": 9512, "text": "So I think these are the kinds of things that are getting, and the supply chain disruptions, getting more people to think about, how do we actually just make stuff?"}, {"time": 9520, "text": "This is all good, but the concern is that it's still gonna take a while for these things, for people to learn how to be agentic again, and to be in right relationship with each other and with the world."}, {"time": 9535, "text": "So the message of hope is still people are resilient, and we are building some really amazing technology."}, {"time": 9541, "text": "And I also, to me, I derive a lot of hope from individuals in that van."}, {"time": 9548, "text": "The power of a single individual to transform the world, to do positive things for the world is quite incredible."}, {"time": 9554, "text": "Now you've been talking about, it's nice to have as many of those individuals as possible, but even the power of one, it's kind of magical."}, {"time": 9562, "text": "We're in a mode now where we can do that."}, {"time": 9564, "text": "I think also, part of what I try to do is in coming to podcasts like yours, and then spamming with all this philosophical stuff that I've got going on, there are a lot of good people out there trying to put words around the current technological, social, economic crises that we're facing."}, {"time": 9583, "text": "And in the space of a few short years, I think there has been a lot of great content produced around this stuff."}, {"time": 9587, "text": "For people who wanna see, wanna find out more, or think more about this, we're popularizing certain kinds of philosophical ideas that move people beyond just the, oh, you're communist, oh, you're capitalist kind of stuff."}, {"time": 9598, "text": "Like it's sort of, we're way past that now."}, {"time": 9601, "text": "So that also gives me hope, that I feel like I myself am getting a handle on how to think about these things."}, {"time": 9608, "text": "It makes me feel like I can, hopefully affect change for the better."}, {"time": 9612, "text": "We've been sneaking up on this question all over the place."}, {"time": 9615, "text": "Let me ask the big, ridiculous question."}, {"time": 9623, "text": "The meaning of life."}]}]