[{"title": "Susan Cain: The Power of Introverts and Loneliness | Lex Fridman Podcast #298", "id": "j4PEu4sVD40", "quotes": [{"time": 324, "text": "But at the same time, when you see them at a party, they seem like the life of the party."}, {"time": 331, "text": "And I hear from those people all the time."}, {"time": 333, "text": "There's so many people like that."}, {"time": 334, "text": "What would you classify them as exactly?"}, {"time": 337, "text": "Is it ultimately as the source of energy?"}, {"time": 339, "text": "Is it the most important thing?"}, {"time": 340, "text": "Or like how the heck are they the life of the party?"}, {"time": 343, "text": "It's a bunch of different things, you know."}, {"time": 345, "text": "So first of all, just to say like a big caveat to all of this is humans are just amazingly complex."}, {"time": 352, "text": "So you can't explain every individual human through these parameters, even though I think the parameters are really valuable."}, {"time": 359, "text": "But that person at the party, it could be that they're more of an ambivert."}, {"time": 364, "text": "So they kind of are more in the middle of the spectrum."}, {"time": 367, "text": "It basically means someone who's not extremely introverted or extremely extroverted, they're kind of in the middle."}, {"time": 372, "text": "So maybe at a party, their more extroverted side comes out."}, {"time": 375, "text": "Or it could be an introvert who's gotten really good at the skills of acting more like a pseudo extrovert."}, {"time": 383, "text": "And they pull that up at the moments that they need it."}, {"time": 386, "text": "So they learn how to fake it."}, {"time": 389, "text": "Oh, there's a lot of people like that."}, {"time": 390, "text": "And I know this because like, I think out of all the people on this planet you could be talking to, I've heard from the most number of those people."}, {"time": 398, "text": "Like they all come and tell me about their experience out in the world presenting a face that's different from what they feel."}, {"time": 405, "text": "So one of the things you talk about is, at least in the West, we've constructed a picture of success."}, {"time": 410, "text": "And that picture is usually one of an extrovert."}, {"time": 415, "text": "Like when you imagine somebody who's a leader, who's a successful person, that person has some of the qualities you would associate with an extrovert."}, {"time": 423, "text": "And so there's a lot of incentive for faking it."}, {"time": 431, "text": "If you want to be successful, you gotta be able to fake it, to sort of hang with the rest of the team."}, {"time": 437, "text": "You have to be able to be outgoing and all those kinds of things and not be drained by the interaction."}, {"time": 443, "text": "Yeah, but I mean, there are also a lot of introverts who figure out ways to draw on their own strengths and they're incredibly connecting and successful and they're great leaders and they're not actually faking it."}, {"time": 456, "text": "They're more just figuring out ways to do it their own way."}, {"time": 459, "text": "You see a lot of people like that."}, {"time": 462, "text": "Is there advice, is there lessons you can draw from that, from just observing how you can be an introvert and be in a leadership position?"}, {"time": 470, "text": "Yeah, it's kind of like a mantra, figuring out what your own strengths are and how to draw on them."}, {"time": 475, "text": "I think of a guy I know, Doug Conant, who had been the CEO of Campbell Soup for many years."}, {"time": 484, "text": "He's very introverted."}, {"time": 486, "text": "He's quite shy also by his own description."}, {"time": 489, "text": "And he really cares about people."}, {"time": 493, "text": "And so when he started at Campbell, the employee engagement ratings of the company were all the way at the bottom of the Fortune 500."}, {"time": 503, "text": "And by the time he stepped down 10 years later, they were all the way at the top."}, {"time": 507, "text": "And it wasn't that he was going out there and schmoozing people, but he really did care."}, {"time": 514, "text": "So he would find out who were the people who had really been contributing and he would write to them personal letters of thanks."}, {"time": 524, "text": "And these letters meant so much to people."}, {"time": 527, "text": "They would carry them around with them."}, {"time": 529, "text": "And during his time, the 10 years there, he wrote 30,000 of those letters."}, {"time": 534, "text": "So that was his way of doing it."}, {"time": 536, "text": "That was his way of drawing on his own strengths."}, {"time": 538, "text": "And he did that together with, of course, you sometimes have to go outside your comfort zone, no matter who you are."}, {"time": 545, "text": "So he was doing plenty of that too."}, {"time": 547, "text": "It's a kind of combination."}, {"time": 548, "text": "Yeah, the writing process and focusing on the one on one interaction, I can definitely relate."}, {"time": 555, "text": "There's something deeply draining, which concerns me about Zoom meetings because it's some weird brain manipulation."}, {"time": 563, "text": "Same here."}, {"time": 563, "text": "Well, because you're not really engaged, but it wears on you the same way that it does a party."}, {"time": 570, "text": "It feels like you're emptying that bucket for the introverts, even though they're not participating at all in the meeting."}, {"time": 578, "text": "I mean, I suppose that's true for physical meetings too, but with Zoom meetings, remote meetings, it's so much easier to invite a larger number of people into the meeting."}, {"time": 587, "text": "So you're draining more and more of the introvert energy."}, {"time": 590, "text": "And probably extrovert too, but the introvert definitely."}, {"time": 593, "text": "I mean, it's interesting."}, {"time": 594, "text": "I would love to understand that more because there's more and more push towards remote work without, I think, a deep understanding of why these meetings are so draining on people."}, {"time": 605, "text": "I just anecdotally have heard from that."}, {"time": 608, "text": "But maybe that's because the managers, the people who arrange the meetings, are just not sufficiently yet aware of the draining nature of them so that they pull in too many people, they schedule them too regularly, so they need to adjust, that kind of thing probably."}, {"time": 621, "text": "I think people are starting to realize, but I would say one reason that Zoom is so draining is because you can see your own self presentation the whole time if you choose to."}, {"time": 635, "text": "And when you go into in person, you can't."}, {"time": 638, "text": "So you're kind of freed of thinking about that."}, {"time": 640, "text": "So it's like an extra cognitive load that you're bearing the whole time."}, {"time": 646, "text": "And you might want to turn off the camera so you can't see yourself, but then you feel like, well, I have the ability to, so I probably should be doing it."}, {"time": 654, "text": "And then that alone is a decision that you're making."}, {"time": 657, "text": "Yeah, there's probably studies on this now happening, either have happened or are happening, the effect of seeing your own face on camera."}, {"time": 667, "text": "Because it's reminding you that you're supposed to be acting a certain way."}, {"time": 670, "text": "And that is especially a stressful thing."}, {"time": 673, "text": "Yeah, you can't be in the moment as much."}, {"time": 675, "text": "But I mean, for you, you make the decision to do all your podcast interviews in person, right?"}, {"time": 681, "text": "And that's even when it's very costly."}, {"time": 686, "text": "If there's any kind of chemistry that contributes at all to the conversation, which I think most conversations have chemistry, even the boring work meetings, there's something there."}, {"time": 698, "text": "Because yes, you're trying to solve a particular problem at this particular time."}, {"time": 702, "text": "But underneath it, there's a team building that's happening."}, {"time": 706, "text": "And honestly, people also have told me about this, why they enjoyed the Zoom meetings during the pandemic."}, {"time": 714, "text": "It's like, they're lonely."}, {"time": 717, "text": "Like they, you know, it's annoying to have to sit and listen to folks talk about nothing and so on."}, {"time": 723, "text": "But they tune in anyway, because it's kind of lonely to sit there by yourself."}, {"time": 729, "text": "And that, I mean, there's a deep connection there when you're with other people."}, {"time": 733, "text": "And that is especially true when they're in person."}, {"time": 737, "text": "Which is a huge concern for me for like more and more offices from a capitalist perspective, realizing, hey, why are we, why do we have these large office spaces?"}, {"time": 747, "text": "Why do we have to get people together?"}, {"time": 748, "text": "But I think in some deep sense we do."}, {"time": 752, "text": "But then you also talk about that once we do, we wanna protect the introverts."}, {"time": 758, "text": "Like you don't want the open space, office space, which was a big fad for a while."}, {"time": 763, "text": "I don't know where people stand on that at this point."}, {"time": 766, "text": "Yeah, I think people are figuring it out in a post pandemic context, but I mean, I know what you mean."}, {"time": 772, "text": "So before I became a writer, I was a corporate lawyer for like seven years."}, {"time": 777, "text": "And literally the only thing I miss from those years is hanging out with people at the office."}, {"time": 786, "text": "Like, I don't know, just some of the funniest moments I've had in my life came from being at the office until midnight with the other people I was working with."}, {"time": 795, "text": "So I know exactly what you're talking about."}, {"time": 796, "text": "Though I will say the office is there at that firm and at most firms in those days, everybody had their own office."}, {"time": 802, "text": "So it was like a dorm room, where it was like a long hallway with everybody in their own little dorm room."}, {"time": 807, "text": "So you had tons of privacy, but you would also come out and hang out with people."}, {"time": 811, "text": "You could just kind of roam whenever you want."}, {"time": 815, "text": "And whenever you roam, that means you're kind of open."}, {"time": 818, "text": "You're looking for trouble."}, {"time": 820, "text": "You're open for interaction."}, {"time": 822, "text": "And the extent to which you would keep your door open, was it wide open or was it half a jar or just a little bit?"}, {"time": 827, "text": "Those were all signals."}, {"time": 829, "text": "So is there, cause you said reenergize, is there, do you like to think, and again, the human mind is complicated, but do you like to think of it as like a bucket that gets refilled for introverts in terms of energy of social interaction that they're able to handle?"}, {"time": 847, "text": "Do you think of it like that, as a bucket that gets emptied and needs to be refilled?"}, {"time": 852, "text": "I think of it, yeah, more or less, cause I use the metaphor of a battery that gets recharged or not."}, {"time": 856, "text": "It's basically the same thing, different metaphor."}, {"time": 859, "text": "But yeah, but just to add on that, that there is a layer of complexity to that because you could be somebody who doesn't want the kind of social life, let's say, where you have to be like on and presenting and interacting with tons of people all the time, but you'd get really lonely if you were just by yourself."}, {"time": 880, "text": "So what you want is to maybe be in the company of a couple of people you know really well."}, {"time": 884, "text": "Like for me, the pandemic was not actually that hard for me personally."}, {"time": 888, "text": "I mean, I lost family, but I mean, from the point of view of what we're talking about, it wasn't that hard because I live with my husband and my kids."}, {"time": 897, "text": "So I knew it was hard on the kids and I felt badly for them."}, {"time": 900, "text": "But for me, I was like, you know what?"}, {"time": 902, "text": "I have a lot of social life right here in the house."}, {"time": 905, "text": "And I can focus and do my work."}, {"time": 907, "text": "Yeah, like yeah."}, {"time": 909, "text": "That's the cool thing about the pandemic, I think, it helped people figure out how much they love their family."}, {"time": 916, "text": "And while you give you a chance to really reconnect with kids, with your kids, like really spend time with them, it's just fascinating to watch."}, {"time": 923, "text": "Like people actually, it did strengthen the family unit in an often beautiful way, which just sucks to have to leave behind at this point."}, {"time": 934, "text": "Yeah, and I think that's part of what people are not gonna wanna go back to that we need to solve for, to the extent that work becomes non remote again."}, {"time": 944, "text": "I think people have just realized how precious those aspects of their lives are."}, {"time": 947, "text": "And for somebody who's in a conventional office job where you're going home and seeing your kids for an hour before bedtime, and that's your interaction with them, that's kind of a ridiculous way to set things up."}, {"time": 961, "text": "It's cool that you can get, I think a lot of places give you the option now, which is interesting."}, {"time": 965, "text": "You get to optimize that element of your life."}, {"time": 968, "text": "Do you take the commute and the office work and then the social interaction there?"}, {"time": 971, "text": "Do you focus on the work at home?"}, {"time": 973, "text": "It's also lonely at home, but then you get to see your kids if you have kids."}, {"time": 977, "text": "That's part of the optimization is like, I have some options now and I'm gonna try to optimize solitude, loneliness, happiness, productivity, seeing family, seeing coworkers, the chemistry with the team building with the coworkers versus just the raw exchange of information with the coworkers."}, {"time": 1001, "text": "It's fascinating to see how that kind of evolves."}, {"time": 1004, "text": "Yeah, and then there's the big, the third space idea of the spaces where you're in a coworking space or a cafe or something like that."}, {"time": 1014, "text": "You've got other people around you, but you're not exactly interacting with them, but they're very much there."}, {"time": 1020, "text": "And that's huge too."}, {"time": 1022, "text": "I don't think we think about that enough."}, {"time": 1024, "text": "Yeah, that energy's there."}, {"time": 1027, "text": "I lived in Manhattan for 17 years before we had kids and I absolutely loved it."}, {"time": 1035, "text": "I loved it, the feeling of all that energy all around you, but you could be anonymous within it."}, {"time": 1041, "text": "To me, it was perfect."}, {"time": 1042, "text": "Yeah, it was beautiful."}, {"time": 1043, "text": "I worked this morning for a few hours, programmed for a few hours at a Starbucks."}, {"time": 1048, "text": "And first of all, wearing suits, like Manhattan is the one place you can kind of fit into that because everyone's wearing suits."}, {"time": 1056, "text": "You wear suits every day?"}, {"time": 1058, "text": "Well, these days, unfortunately, because I get recognized, I wear usually not suits on my own life."}, {"time": 1065, "text": "But yeah, I love it."}, {"time": 1066, "text": "I love the way it feels, I don't know."}, {"time": 1068, "text": "And the way I think about the world when I wear a suit, I take it seriously as if my life is gonna end today."}, {"time": 1074, "text": "This is what I would want to wear, not for physical appearance, but for some reason, it makes me feel focused."}, {"time": 1083, "text": "So even if you're not gonna see anyone, you would still put the suit on when you're doing your work?"}, {"time": 1087, "text": "Especially then."}, {"time": 1088, "text": "Especially then, yeah."}, {"time": 1090, "text": "Yeah, I really love doing that."}, {"time": 1092, "text": "So it tells you seriousness of purpose, something like that?"}, {"time": 1096, "text": "Like everything elevated now?"}, {"time": 1098, "text": "I don't know what I imagine exactly, but it's some kind of platonic form of a mixture of James Bond and like, I don't know who else, Richard Feynman, what can I think about when I think about a suit?"}, {"time": 1112, "text": "You know, I think of Leonard Cohen, but he was always wearing suits too, but you know."}, {"time": 1117, "text": "Leonard Cohen is definitely one of my, is a tragic human, is a beautiful human being."}, {"time": 1122, "text": "Through his words, through his own private life, yes, I definitely would think about Leonard Cohen."}, {"time": 1129, "text": "So small talk, that's another thing."}, {"time": 1133, "text": "Is that part of the equation of introvert versus extrovert?"}, {"time": 1139, "text": "How much people enjoy small talk?"}, {"time": 1141, "text": "I kind of went into this whole thing thinking that it was, but from what I've seen, most people have studied, is that most people don't like small talk."}, {"time": 1151, "text": "I think that's why people like your podcasts, because you're like, forget the small talk, I'm going deep into it from the very beginning."}, {"time": 1157, "text": "Yeah, so it's actually, the picture you're painting is like the way you started, like with your, with the book Quiet, and the way you are today is you realize the picture may be more complicated."}, {"time": 1170, "text": "Yeah, everything's more complicated."}, {"time": 1173, "text": "I will say with the small talk thing, that I'm curious if you have this experience, but I find it fantastic to have a career where I'm known for anti small talk kinds of topics, because it means that anywhere I go, like if I show up at a conference or something like that, no one does small talk with me."}, {"time": 1195, "text": "They're like telling me about the deep truth of their lives from the first hello, and I love that."}, {"time": 1202, "text": "And in normal life, you have to like wade through a lot before you know if people are ready to go there."}, {"time": 1209, "text": "Do you have that experience too?"}, {"time": 1210, "text": "No, definitely, definitely, with people that know me for sure."}, {"time": 1213, "text": "But you forget how many people feel like they know you because of your podcasts."}, {"time": 1217, "text": "Oh, that's what, no, that counts."}, {"time": 1218, "text": "Because I'm a huge fan of podcasts, and I feel like before I ever became friends with Joe Rogan, I felt like I was friends with him, because I was a fan of his podcast."}, {"time": 1230, "text": "So like it was, I feel like it's a friendship."}, {"time": 1233, "text": "I know it's a one way friendship with all the people I listen to in podcasts, and even people who are no longer with us, like writers."}, {"time": 1240, "text": "I feel like I have a relationship with them."}, {"time": 1242, "text": "Maybe I'm insane."}, {"time": 1243, "text": "No, I totally feel that way."}, {"time": 1245, "text": "That's the whole reason I became a writer."}, {"time": 1246, "text": "Like I'm friends with Leonard Cohen."}, {"time": 1250, "text": "And he's not aware of it."}, {"time": 1253, "text": "No, but I think that's the whole reason for writing or making music or whatever people do."}, {"time": 1259, "text": "It's to be able to have those kinds of connections that don't require having to be in a room together, because there's only so many people you can be in a room with in your lifetime."}, {"time": 1270, "text": "The hard thing is, unfortunately, because I value human connection so much, and I only have, just like you mentioned, sort of a small circle of people I'm really close with by design."}, {"time": 1286, "text": "It always hurts me a lot to say goodbye to people."}, {"time": 1290, "text": "Like you meet people, and you can tell they're beautiful people."}, {"time": 1293, "text": "There's something so fascinating about them."}, {"time": 1295, "text": "They're, they've had a complicated life."}, {"time": 1300, "text": "Like you could see in their eyes in the way they tell their story in just a few sentences."}, {"time": 1304, "text": "They've gone through some shit, but they've also found some elements of beauty, and then you get to realize, okay, well, there's a fascinating human here, and all you get to say is a few words here and there."}, {"time": 1315, "text": "Like a funny little joke, maybe a dark joke here and there, and then you just say goodbye, maybe hug it out, and you go on your way."}, {"time": 1324, "text": "So like that's a hello and a goodbye, and your paths will never cross again."}, {"time": 1328, "text": "That makes me like a sad walk, walk away."}, {"time": 1333, "text": "But I guess I wouldn't have it any other way, I suppose, is the reality is."}, {"time": 1336, "text": "In your book, you talk about that sorrow, that sadness not being such a bad thing."}, {"time": 1342, "text": "Yeah, and when you just said that, I just thought of this one moment in my life that I haven't thought of for 20, 30 years or something, but it was when I was in law school, and a classmate of mine had his friend come to visit for the weekend, and the three of us hung out a lot, and we just had an amazing time."}, {"time": 1364, "text": "And then this other guy who wasn't gonna be coming back anytime soon, if at all, sent a postcard to me."}, {"time": 1372, "text": "And the only thing written on the postcard was this quote from Oscar Wilde."}, {"time": 1375, "text": "And I don't remember the exact words, but it basically said that there's no pain as intense as the sorrow of parting from someone to whom you've just been introduced."}, {"time": 1386, "text": "And there was something so intense about that, and so true."}, {"time": 1390, "text": "I think partly also because when you've just been introduced to somebody, you don't yet know their difficulties."}, {"time": 1398, "text": "So you're seeing the most sparkling version of them."}, {"time": 1402, "text": "You're seeing a platonic version of love and friendship."}, {"time": 1406, "text": "And your imagination fills in the rest in some beautiful way that matches perfectly the kind of thing you're interested in."}, {"time": 1413, "text": "That's how I feel about one spoonful of ice cream, and that's why you always finish the whole tub, and then you regret all of it."}, {"time": 1422, "text": "You do cite, where did you write this?"}, {"time": 1425, "text": "I think this is on your website, that one of the best things in the world is that sublime moment when a writer, artist, or musician manages to express something you've always felt, but never articulated, or at least never quite so beautifully."}, {"time": 1438, "text": "So that's the Oscar Wilde line is one line like that, but just a line from a song or maybe a piece of art that just grabs you."}, {"time": 1447, "text": "Is there something that jumps out into memory like that for you?"}, {"time": 1451, "text": "I don't know if I have an exact line, though."}, {"time": 1454, "text": "I mean, that feeling that you just quoted happens to me all the time."}, {"time": 1457, "text": "I'm just bad at recalling exact instances, but."}, {"time": 1459, "text": "Yeah, me too, on the spot."}, {"time": 1462, "text": "But the writer Alain de Botton regularly makes me feel that way."}, {"time": 1467, "text": "He's just this beautiful essayist and observer of human nature, and he's just constantly expressing things in this gorgeous way that you've experienced yourself."}, {"time": 1477, "text": "And you feel like, I don't know, it's just this grand act of generosity."}, {"time": 1481, "text": "You feel less lonely."}, {"time": 1483, "text": "You feel this deep sense of communion."}, {"time": 1485, "text": "It's such an elevating experience."}, {"time": 1487, "text": "Even when it's like a melancholy line."}, {"time": 1490, "text": "Maybe especially when it is."}, {"time": 1496, "text": "So the Jack Kerouac on the road definitely makes me feel that way, like every other line in there, forlorn rags of growing old."}, {"time": 1505, "text": "Do you know, I never read that book."}, {"time": 1506, "text": "So what was it about that book that made you feel that way?"}, {"time": 1511, "text": "Well, okay, well, since you asked."}, {"time": 1513, "text": "I'm going to linger."}, {"time": 1514, "text": "I'm going to linger on this."}, {"time": 1517, "text": "So this story is kind of the book, the kind of defining book of the Beats, of the Beats generation."}, {"time": 1526, "text": "And it's basically a story of a writer who takes a road trip across the United States a couple of times and experiences a few close friends and a few strangers along the way."}, {"time": 1539, "text": "And there's a lot of just those melancholy goodbyes along the way."}, {"time": 1543, "text": "You meet all these people with interesting lives."}, {"time": 1546, "text": "Some of them are defined by struggle."}, {"time": 1547, "text": "Some of them are defined by drugs, drinking, women, all that kind of stuff."}, {"time": 1552, "text": "And still he just kind of dances around all of that and is defined by the goodbyes and the passing of time."}, {"time": 1558, "text": "So a lot of the really powerful lines are basically like, there's one on there, again, I don't remember exactly, but he meets a beautiful girl at a rest stop."}, {"time": 1570, "text": "And the girl is getting, or a woman is getting on a different bus than he's getting on."}, {"time": 1578, "text": "And it's that feeling of falling in love for a second and realizing that fate is just ripping that out, which is similar to this idea of it sucks to say goodbye just when you met, but it's especially true when you fall in love just a little bit with that stranger with all the possibilities that could lay there."}, {"time": 1601, "text": "So there's a few lines of written down."}, {"time": 1605, "text": "I went down this whole rabbit hole of thinking, what are the lines that grabbed me?"}, {"time": 1609, "text": "A couple of lines from on the road trip."}, {"time": 1611, "text": "A couple of lines from on the road."}, {"time": 1613, "text": "So one is, what is that feeling when you're driving away from people and they recede on the plane till you see their specks dispersing?"}, {"time": 1621, "text": "It's the two huge world vaulting us and it's goodbye, but we lean forward to the next crazy venture beneath the skies."}, {"time": 1628, "text": "So this is him talking about leaving a particular city."}, {"time": 1631, "text": "The spoiler alert towards the end of the book, rather the end of the book line I return to often, it's more poetry, but it's a feeling that captures the book I would say."}, {"time": 1645, "text": "The evening star must be drooping and shedding her sparkler dims on the prairie, which is just before the coming of complete night that blesses the earth, darkens all the rivers, cups the peaks and folds the final shore in."}, {"time": 1658, "text": "And nobody, nobody knows what's going to happen to anybody besides the forlorn rags of growing old."}, {"time": 1665, "text": "And it just captures this kind of in the moment appreciation of the beauty of the world and a sadness over the fact that time passes and you leave the people you love behind, you leave the places you love behind, or at least the way they were at the time that you really enjoyed them."}, {"time": 1684, "text": "And you just leave that, all that, just the sadness you feel when you, something about it, like looking at a picture, looking at your kids grow up, looking at old friends getting old, something makes you realize that time passes."}, {"time": 1698, "text": "And somewhere deep in there is probably a realization of your mortality."}, {"time": 1702, "text": "And then it just makes you somehow first sad that everything comes to an end."}, {"time": 1708, "text": "And then that's immediately followed by sort of an appreciation of the moment, like a gratitude that you get to experience this moment."}, {"time": 1717, "text": "Yeah, I know it exactly."}, {"time": 1719, "text": "I mean, that's the whole reason that I wrote Bitter Sweet."}, {"time": 1722, "text": "It's all about that."}, {"time": 1723, "text": "And so I know intensely what you're talking about."}, {"time": 1726, "text": "And by the way, my husband loves the book A Movable Feast by Ernest Hemingway, which I also haven't read, but it talks about that same thing, groups of people traveling around together and the group coalesces into some magical formation."}, {"time": 1740, "text": "And then one person leaves the group and it's never gonna be the same again."}, {"time": 1743, "text": "And then they move on to the next one."}, {"time": 1746, "text": "Yeah, I mean, I think that's the deepest essence of human nature, the feeling of longing for some kind of state of perfect completeness, completion, perfect love, the Garden of Eden, all of it."}, {"time": 1763, "text": "And the feeling that you're never gonna quite attain it, but you get glimpses of it here and there."}, {"time": 1770, "text": "And that those glimpses are some of the best things that ever happened to us."}, {"time": 1773, "text": "And they're suffused with sadness because they're not the real thing or they're not the full thing."}, {"time": 1777, "text": "They're just a glimpse."}, {"time": 1779, "text": "It's a glimpse of what we long for."}, {"time": 1782, "text": "So the sadness that we might feel is always connected to the ways in which we fall short from the perfect thing that we're, like there's always a thing you're longing for."}, {"time": 1795, "text": "And the sadness has to do with getting a glimpse of it, but not quite getting a hold of it."}, {"time": 1803, "text": "So it's always losing."}, {"time": 1804, "text": "It's always losing, but it's also always, but it's not, that sounds really depressing, but it's not, you know it's not depressing because you experience this all the time."}, {"time": 1813, "text": "It's also, those are the most beautiful moments I think life offers."}, {"time": 1818, "text": "I mean, it's intense, intense beauty in those moments because it's getting closer to the real thing that we long for."}, {"time": 1826, "text": "So what about like loss, losing love?"}, {"time": 1831, "text": "Is that also a beautiful thing?"}, {"time": 1836, "text": "Well, the moments you're talking about, I think it's easier to appreciate the beauty of it all in the moment because you're experiencing, you're kind of experiencing the loss and the love all at the same time."}, {"time": 1853, "text": "Whereas if you're talking about straight up loss, like a betrayal or a bereavement or whatever it is, that's, it's different, it's quite overwhelming."}, {"time": 1863, "text": "So losing a loved one kind of thing."}, {"time": 1865, "text": "Losing a loved one."}, {"time": 1866, "text": "I mean, I will say that the truth that I think that we can come to after a lot of time on this earth is the idea that love exists not only in its particular forms, so not only in the form of the one person, that one person we love or that other person we love, but love itself is a state that we have access to."}, {"time": 1892, "text": "And so over time, the loss of person A can heal and you can tap into a kind of bigger river of love."}, {"time": 1902, "text": "Yeah, I mean, I had this, it comes from Louis C.K."}, {"time": 1906, "text": "in a show, damn I love that line."}, {"time": 1909, "text": "I mean, there's a, he talks to an older gentleman and Louis is all like sad about losing a loved one or like getting rejected essentially, like a breakup."}, {"time": 1925, "text": "And then the older gentleman gives him advice saying, like basically criticizes Louis for saying, why are you moping around?"}, {"time": 1935, "text": "Because this is the most, this is the best part."}, {"time": 1938, "text": "Like losing love is the best part because that's, the real loss is when you forget."}, {"time": 1943, "text": "Like feeling shitty about having gone through a breakup is when you most intensely appreciate what that person meant to you."}, {"time": 1955, "text": "Like you most intensely feel love in some strange way by realizing that you've lost it, by missing it, wishing at this moment, I wish I had that."}, {"time": 1966, "text": "Like that feeling, that's when you feel that love the most, the absence of it, and so the older gentleman gives advice that that's the best part."}, {"time": 1976, "text": "And it can, if you're good with it, it can last for the longest."}, {"time": 1981, "text": "It could be the most sort of prolonged experience of deep appreciation and emotion and so on."}, {"time": 1989, "text": "So that's kind of a, that's a nice way to look at loss, which is a reminder of how much somebody meant to us."}, {"time": 1998, "text": "Yeah, I mean, I think there's a lot of truth in that because yeah, you wouldn't care so much if it weren't something that mattered to you."}, {"time": 2007, "text": "So it's always a signpost to the direction you really wanna go to."}, {"time": 2012, "text": "That's always what it is."}, {"time": 2014, "text": "Yeah, and it's interesting to see the way that the mystical versions of many of the great religions all point in this direction."}, {"time": 2025, "text": "Whether you're looking at Sufism or the Kabbalah or in Christian mysticism, you see this idea that the longing for what you lack is the very thing that gives you what you're longing for."}, {"time": 2038, "text": "So the longing is the cure."}, {"time": 2039, "text": "I mean, that's the way the Sufi poet Rumi puts it."}, {"time": 2042, "text": "The longing is the cure."}, {"time": 2044, "text": "And he says, be thirsty."}, {"time": 2045, "text": "Like be as thirsty as you possibly can."}, {"time": 2048, "text": "That's what you wanna be."}, {"time": 2049, "text": "The good stuff is the wanting, not the having."}, {"time": 2052, "text": "Yeah, yeah, of course, tell that to a person that just broke up and they'll be like, shut up, asshole, advice sucks."}, {"time": 2061, "text": "I wish I had her and back."}, {"time": 2066, "text": "Those are the kinds of life lessons that only work when you kind of step away for a while."}, {"time": 2071, "text": "They don't work in the moment of excruciation."}, {"time": 2075, "text": "There is something about the fact of knowing that all humans are in that experience together that is also incredibly uplifting."}, {"time": 2086, "text": "Well, that takes time for people to realize."}, {"time": 2089, "text": "Like heartbreak in your early teenage years or something like that could feel like this is completely the most novel and the most dramatic pain that any human has ever felt, right?"}, {"time": 2104, "text": "Or maybe even when you're younger."}, {"time": 2107, "text": "And then one of the things you realize is that everybody goes through this."}, {"time": 2113, "text": "That can be an awakening to the fact that we're all in this together."}, {"time": 2116, "text": "This human condition is not just a personal experience."}, {"time": 2119, "text": "It's an experience we all share."}, {"time": 2121, "text": "And that's a kind of love, the unity of it."}, {"time": 2125, "text": "Yeah, that's a really deep kind of love."}, {"time": 2127, "text": "And I feel like we are prevented from perceiving that love as it's actually like the most obvious kind of love and it's right there and it happens all the time."}, {"time": 2138, "text": "But we're prevented from perceiving it because we're not really supposed to talk about things like that."}, {"time": 2142, "text": "It's like there's something unseemly about it."}, {"time": 2145, "text": "Well, it's also in the West is this individualist society."}, {"time": 2149, "text": "So like there's a pressure to sort of see the individual as a distinct sovereign entity that experiences things."}, {"time": 2159, "text": "The unity between people is not obviously sort of communicated or talked about as part of the culture."}, {"time": 2166, "text": "Yeah, it's not part of the culture."}, {"time": 2168, "text": "And yet, you see it in our behaviors because we're humans."}, {"time": 2172, "text": "So, why do people listen to sad music?"}, {"time": 2175, "text": "I mean, one reason is they're hearing expressed for them."}, {"time": 2179, "text": "Like the musician is basically saying to them, this thing that you have experienced, I've experienced it too, so have lots of other people."}, {"time": 2188, "text": "But they're saying it all without words and it's transformed into something beautiful."}, {"time": 2193, "text": "And there's something about that that's just incredibly elevating."}, {"time": 2197, "text": "And people don't know it, but like there's one study that I have in Bittersweet that found that people whose favorite songs are their happy songs, play it on their playlist about 175 times, but the people who love sad music play them about 800 times."}, {"time": 2215, "text": "And they say that they feel connected to the sublime when they're listening to that music."}, {"time": 2223, "text": "So, what is it in music that connects us to the sublime through sadness?"}, {"time": 2231, "text": "I mean, I have a bunch of different theories."}, {"time": 2233, "text": "Like the whole reason I started writing this book is because I kept having this reaction reliably to sad music."}, {"time": 2244, "text": "And I realized that for people who I knew who were religious believers, the way they described their experience of God was what I was experiencing when I would hear that music."}, {"time": 2256, "text": "Like all the time."}, {"time": 2258, "text": "It happens over and over again."}, {"time": 2259, "text": "So, you wonder what that is?"}, {"time": 2262, "text": "Yeah, so I started wondering what that is."}, {"time": 2264, "text": "And lots of people have tried to figure out what that's all about."}, {"time": 2271, "text": "And there are different theories that it's expressing, it's like a kind of catharsis for our difficult emotions, that it's, as we were saying, a sense of being in it together."}, {"time": 2282, "text": "We don't react in that sort of uplifted way when you just see like a slideshow of sad faces, which is something researchers have actually tested."}, {"time": 2292, "text": "No one really cares when they're seeing the sad faces."}, {"time": 2295, "text": "But the sad music, they're really reacting."}, {"time": 2297, "text": "And also, they don't really react when they're hearing music expressing other negative emotions, like Marshall music or something like that."}, {"time": 2304, "text": "It's just the sad music that gives people this elevated sense of wonder."}, {"time": 2308, "text": "So, I think it's the combination of the sadness and the beauty."}, {"time": 2313, "text": "And I think it's just tapping into the essence of the human source code, which is a kind of spiritual longing, whether we're atheists or believers."}, {"time": 2323, "text": "There's this feeling of longing for a state and a place of perfect love and perfect unity and perfect truth and all of it."}, {"time": 2331, "text": "And like an acute awareness that we're not there in this world."}, {"time": 2336, "text": "In religions, we express that through the longing for Mecca or Eden or Zion."}, {"time": 2342, "text": "And artistically, we express it with Dorothy longing for somewhere over the rainbow or Harry Potter enters the story at the precise moment that he's become an orphan."}, {"time": 2354, "text": "So, he's now gonna spend the rest of his life longing for these parents who he can never remember."}, {"time": 2359, "text": "And there's something about that state that's at our very core."}, {"time": 2364, "text": "And I think that's why we love it so much."}, {"time": 2366, "text": "Well, it could be, you know, you could have the Ernest Becker theory of denial of death, where at the core of that, the warm at the core, as Jung said, is the fear of death."}, {"time": 2378, "text": "So, where the longing for the perfect thing has to do with sort of becoming immortal, is reaching beyond the absurdity, the cruelty of life, that all things come to an end for no particularly good reason whatsoever."}, {"time": 2401, "text": "One we can rationally explain."}, {"time": 2403, "text": "I know, you know, I wonder about that all the time."}, {"time": 2405, "text": "Like, I know obviously there's that idea from Becker and throughout philosophy and the tale of Gilgamesh about the idea that the thing we're longing for most of all is immortality."}, {"time": 2417, "text": "But I feel like it's not only that."}, {"time": 2420, "text": "I think it's more so or also, let's say, a longing for the lions to lay down with the lambs finally."}, {"time": 2430, "text": "You know, for like the fundamental calculus of the universe to just be different, where life doesn't have to eat life in order to survive."}, {"time": 2438, "text": "And yeah, just a completely different situation."}, {"time": 2442, "text": "What immortality would not solve?"}, {"time": 2446, "text": "That could be a very kind of modern thing, because surely so much of human history is defined by violence and glorified violence that doesn't give inklings of this lions and the lambs."}, {"time": 2463, "text": "So much of."}, {"time": 2464, "text": "It's in the Bible."}, {"time": 2466, "text": "I mean, I know all the other stuff is in the Bible too."}, {"time": 2469, "text": "There's other stuff in the Bible, and the Bible, that particular aspect doesn't necessarily reveal the fundamental motivation of human nature."}, {"time": 2477, "text": "That could be deeper stuff, you know?"}, {"time": 2479, "text": "But yeah, that is a beautiful picture, but is it just about humans or is it all about all of life?"}, {"time": 2488, "text": "And you have to think about what does the perfect world look like?"}, {"time": 2494, "text": "It's not just the lions and the lambs laying together."}, {"time": 2497, "text": "It's, you know, how many lions and how many lambs?"}, {"time": 2501, "text": "And, you know, what, having just had a few very technical conversations about Marxian economics versus Keynesian economics versus neoclassical economics, what does the economic and the government system look like for the lions and the lambs that we're longing for?"}, {"time": 2519, "text": "So then you start to build society on top of all those things, but you still, you return to this, what are we longing for?"}, {"time": 2528, "text": "And what's the role of love in that?"}, {"time": 2530, "text": "What's the role of that sad melancholy feeling, the feeling of loneliness?"}, {"time": 2534, "text": "Is the feeling of loneliness fundamental to the human condition?"}, {"time": 2538, "text": "Like, are we always striving to sort of channel that feeling of loneliness to connect with others?"}, {"time": 2547, "text": "Like, we want that feeling of loneliness, otherwise we wouldn't be connecting."}, {"time": 2550, "text": "Is that fundamental, that feeling like you're alone in this even when you're with other people, sort of alone together?"}, {"time": 2557, "text": "You're born alone, you die alone."}, {"time": 2559, "text": "Maybe loneliness is fundamental."}, {"time": 2561, "text": "I think the longing for union is fundamental."}, {"time": 2564, "text": "It's just that it looks so different for different people."}, {"time": 2569, "text": "And coming back to what we were talking about at the beginning, union looks incredibly social for a lot of people and hardly social at all for others, but everybody needs some version of union."}, {"time": 2581, "text": "Yeah, people have been telling me recently about polyamory and all those kinds of things."}, {"time": 2584, "text": "So having probably grown up in a certain part of the world, I'm very, I think I'm very monogamy centric, not in a judgmental way, just for me, what makes me happy is one person."}, {"time": 2596, "text": "So for my whole life, basically just dedication."}, {"time": 2600, "text": "Because I've just seen through relationships with people and objects in my life, the longer we stay together, the deeper the tie."}, {"time": 2612, "text": "So that's just the empirical thing."}, {"time": 2616, "text": "And yes, that probably is a personalized thing."}, {"time": 2620, "text": "That's just true for me."}, {"time": 2621, "text": "It could be very different for others."}, {"time": 2623, "text": "Maybe it's connected to the introverted thing, maybe not."}, {"time": 2629, "text": "Before I leave, because you mentioned songs, sad songs."}, {"time": 2635, "text": "What's a good, what song do you remember last crying to?"}, {"time": 2639, "text": "Oh gosh, well, I mean, I literally dedicated my book to Leonard Cohen."}, {"time": 2648, "text": "He's played such a huge role in my life."}, {"time": 2654, "text": "And I've loved him with this crazy love that I've never been able to understand for decades."}, {"time": 2659, "text": "I think I understand it a little better now, but."}, {"time": 2661, "text": "So you're better friends with him than me, I'm jealous."}, {"time": 2665, "text": "So does it make you, is it the musician or the human too?"}, {"time": 2670, "text": "Because the human is a tortuous soul in a way."}, {"time": 2674, "text": "I'd say it's the musician."}, {"time": 2676, "text": "It's the musician."}, {"time": 2677, "text": "And I actually was thinking about this the other day."}, {"time": 2678, "text": "I mean, obviously he's not alive anymore, but I was kind of running the thought experiment."}, {"time": 2684, "text": "If he were alive still and I had the chance to meet him in person, would I wanna do that?"}, {"time": 2690, "text": "And I'm not really sure that I would because he represents for me symbolically everything, well, everything, I'll end the sentence right there."}, {"time": 2704, "text": "And so, and I think that's okay."}, {"time": 2706, "text": "I think people can express something through their art that they might or might not express if you were just hanging out with them and having a coffee."}, {"time": 2715, "text": "And I'm happy to know him that way."}, {"time": 2717, "text": "He can express himself, I'm sure, in the way that you know him as over coffee too."}, {"time": 2723, "text": "It just requires like a focus of remembering, of like a deep focus of connection."}, {"time": 2731, "text": "That's why like when I interact with folks, it's so draining for me because I'm putting all my, whatever weapons I got in terms of like deeply trying to understand the person in front of me and doing that dance of human interaction, the humor, the intense kind of delving into who they are."}, {"time": 2757, "text": "Which requires like navigating around like small talk type of stuff and just like compliments and so on."}, {"time": 2765, "text": "In general, like people, depending on the culture, depending on the place, they'll sometimes flower stuff with smiling and like compliments like, oh, yeah, I love you, this is great."}, {"time": 2775, "text": "I guess that's all great, but you wanna get to the core of like, what are the demons in the closet?"}, {"time": 2780, "text": "Let's talk about it."}, {"time": 2782, "text": "And that can be exhausting."}, {"time": 2784, "text": "That can be really exhausting."}, {"time": 2785, "text": "So from a Leonard Cohen perspective, you get more and more famous."}, {"time": 2789, "text": "It can be hard sometimes because he probably is also an introvert."}, {"time": 2794, "text": "Oh, yeah, I know he was an introvert because he actually tweeted about my book when it came out."}, {"time": 2799, "text": "So that was a precious moment for me."}, {"time": 2801, "text": "Something that we should all be listening to the quiet."}, {"time": 2803, "text": "I can't remember exactly what he said."}, {"time": 2805, "text": "But yeah, yeah, no, he definitely was."}, {"time": 2808, "text": "He struggled with depression, which I wonder if that's something that's also connected to introversion."}, {"time": 2816, "text": "Well, perhaps not actually."}, {"time": 2818, "text": "Perhaps they're very disjoint and also."}, {"time": 2820, "text": "It's connected to sensitivity and many sensitive people are introverts."}, {"time": 2824, "text": "So it's kind of like a Venn diagram."}, {"time": 2826, "text": "About 80% of highly sensitive people are introverted, but then some are extroverts."}, {"time": 2831, "text": "And then not all introverts are sensitive."}, {"time": 2834, "text": "But he was definitely a sensitive type."}, {"time": 2837, "text": "Well, there's on top of that, you see like the percent of artists relative to the average that suffer from depression."}, {"time": 2843, "text": "So creative people is very high."}, {"time": 2846, "text": "Very, very high."}, {"time": 2847, "text": "Yeah, and then the number of artists and successful artists who were orphaned when they were young, who lost one parent or both parents, it's like an astronomical number."}, {"time": 2856, "text": "I have it in the book."}, {"time": 2857, "text": "I don't remember the percentage, but huge."}, {"time": 2859, "text": "And he was one of them."}, {"time": 2860, "text": "He lost his father when he was nine."}, {"time": 2863, "text": "And his first act of poetry was he took, his father made suits."}, {"time": 2869, "text": "That's why I thought of him when we were talking about you in your suit."}, {"time": 2871, "text": "And he took one of his father's bow ties and wrote a poem in his honor and buried the poem and the bow tie in the backyard."}, {"time": 2881, "text": "And that was like his first creative act."}, {"time": 2884, "text": "You know that song, Chelsea Hotel No."}, {"time": 2884, "text": "2?"}, {"time": 2887, "text": "Where he met, I guess it's about Janis Joplin."}, {"time": 2890, "text": "Joplin, yeah."}, {"time": 2893, "text": "What a fun, intense, and cruel person she is."}, {"time": 2900, "text": "So I guess."}, {"time": 2902, "text": "Have you ever seen, I'm sorry to interrupt you, but have you ever seen his son Adam Cohn and Lana Del Rey perform that song together?"}, {"time": 2909, "text": "Oh wow, no."}, {"time": 2910, "text": "I have to send it to you."}, {"time": 2912, "text": "So that for people who don't know, I don't, I mean, maybe I don't know."}, {"time": 2916, "text": "It goes, I remember you well in the Chelsea Hotel."}, {"time": 2919, "text": "You're talking so brave and so sweet."}, {"time": 2922, "text": "Giving me head on the unmade bed while the limousines wait in the street."}, {"time": 2928, "text": "There's a good line in there about being ugly."}, {"time": 2933, "text": "Oh yeah, we are ugly, but we have the music."}, {"time": 2936, "text": "No, before that, from a guy's perspective, it was."}, {"time": 2939, "text": "Oh, you told me again you preferred handsome men."}, {"time": 2943, "text": "But for me, you would make an exception."}, {"time": 2945, "text": "Yeah, so good."}, {"time": 2947, "text": "Well, she continued that thread in later because I think she said that he was lousy in bed."}, {"time": 2954, "text": "Yeah, she publicly said that."}, {"time": 2956, "text": "Which is like, oh man, did there."}, {"time": 2960, "text": "Just, okay, for people who don't know, I think this is a true story about them interacting and being together for a very brief time."}, {"time": 2969, "text": "I don't know, dating, but just connecting."}, {"time": 2971, "text": "Falling in love or in this very particular way that I think famous musicians, poets can, which is like, it's impossible for that kind of thing to last."}, {"time": 2982, "text": "But they did for a brief moment."}, {"time": 2987, "text": "There's like a sadness to it because it's so momentarily, but it's so epic that these two paths cross and then you just look at it, we know these famous people and it's interesting to watch."}, {"time": 3001, "text": "Yeah, and you don't even have the impression that they're thinking it's gonna last."}, {"time": 3004, "text": "They more know that it's like a blaze of an intersection and the limousine's already waiting while they're in the middle of it and then it's done."}, {"time": 3014, "text": "Yeah, and he's talked about how his music, he said something like, some people are more inclined to say hello with their music, but I'm rather more valedictory."}, {"time": 3027, "text": "What does valedictory mean?"}, {"time": 3028, "text": "Like saying goodbye, like the valedictorian's address."}, {"time": 3033, "text": "You know, so many of his songs really are about some form of parting or goodbye or an imperfection or something, or like the broken hallelujah."}, {"time": 3045, "text": "Yeah, that's songs."}, {"time": 3046, "text": "But the thing that's so incredible about him is the way that he's taking all of that and pointing it in the direction of transcendence."}, {"time": 3057, "text": "Like, it's not just pure sadness."}, {"time": 3060, "text": "It's sadness and beauty, and that's the thing."}, {"time": 3063, "text": "Yeah, there is a feeling of transcendence in a lot of the songs."}, {"time": 3067, "text": "It's like sadness and transcendence, you're right."}, {"time": 3070, "text": "It's a goodbye, but you're moving on to some bigger thing, but in a sort of ethereal way, not like a proud, arrogant way."}, {"time": 3083, "text": "Yeah, so his favorite poet was Garcia Lorca."}, {"time": 3088, "text": "He actually named his daughter after him."}, {"time": 3090, "text": "His daughter's name is Lorca."}, {"time": 3091, "text": "And he talks about how there's some poem that Lorca had written that made him realize that the universe itself was aching, but the ache was okay because that's the way you embrace the sun and the moon."}, {"time": 3108, "text": "And that's what I think is, that's why I think there's this whole rich vein in this bittersweet tradition that he embodies that's like the essence of beauty."}, {"time": 3122, "text": "You know, it's the way you embrace the sun and the moon."}, {"time": 3125, "text": "The song Hallelujah, I return to that often, have been meaning to play it."}, {"time": 3131, "text": "I have now a friend who wants to sing it with me."}, {"time": 3135, "text": "Are you a singer?"}, {"time": 3140, "text": "When somebody says they're a singer, do they have to be good?"}, {"time": 3143, "text": "Because then no, but I would say yes."}, {"time": 3147, "text": "I was in a band for a while."}, {"time": 3148, "text": "I sang for a while."}, {"time": 3149, "text": "I was always bad, but I enjoy it."}, {"time": 3154, "text": "I enjoy lyrics."}, {"time": 3155, "text": "I enjoy words."}, {"time": 3157, "text": "When sung or spoken, they capture something."}, {"time": 3160, "text": "Like again, that moment."}, {"time": 3162, "text": "Tom Waits is a huge favorite of mine for that reason."}, {"time": 3166, "text": "Although he often, his lyrics are often not that simple."}, {"time": 3171, "text": "I'd rather have a bottle in front of me than a frontal lobotomy."}, {"time": 3176, "text": "He's always playing with just like these weird word play that's, especially in the English language, just trickier to do."}, {"time": 3186, "text": "I'm fortunate enough to know another language, which is Russian, so I get to understand that certain languages allow for more word play than others."}, {"time": 3195, "text": "English, for that reason, I don't think has a, like a culture of, you know what, I need to push back on what I'm about to say, but there was no culture of word play until hip hop came along."}, {"time": 3213, "text": "So like distorting words in interesting ways for there to be a rhythm, a rhyme, and at the same time you're capturing some really powerful message plus humor."}, {"time": 3226, "text": "All of that mixed in."}, {"time": 3227, "text": "Actually hip hop does a really good job of this, but there wasn't a tradition, if you look at poetry in the 20th century, there wasn't really a tradition of that in the United States, but there was in other parts of the world and certainly in Russia."}, {"time": 3240, "text": "Empowered also not just by the language, by the fact that you go through a world war where tens of millions of people die."}, {"time": 3245, "text": "Something about mass death of civilians that inspires great literature and music and art."}, {"time": 3252, "text": "Yeah, absolutely, because you start telling the real truth, I think."}, {"time": 3256, "text": "Yes, there's no more reason for small talk."}, {"time": 3261, "text": "That's funny, I always have thought that if I could choose any other medium besides writing, it would be singing."}, {"time": 3271, "text": "No, I mean like I'm really not, I just love the idea of it."}, {"time": 3274, "text": "But then I also think, you know, I'm fundamentally a shy person, so I think it's much better that my medium is writing instead of singing, so like it all worked out."}, {"time": 3282, "text": "That said, you're also an exceptionally good public speaker and you're not supposed to be, mathematically speaking."}, {"time": 3291, "text": "Mathematically speaking."}, {"time": 3292, "text": "You're not supposed to be a good public speaker."}, {"time": 3294, "text": "Oh, you mean because of shyness?"}, {"time": 3296, "text": "Yeah, because of shyness, because of introversion, because of all those kinds of things."}, {"time": 3299, "text": "Oh yeah, but lots of introverts are public speakers, actually, like this is one of, I knew this from the studies, but then also when I started going out on the lecture circuit, I realized that all my fellow speakers at all these conferences I was going to, they're all introverts, because they're all people who spent years figuring out some idea and now they're out there talking about it."}, {"time": 3319, "text": "Oh, they're in their head figuring out the idea?"}, {"time": 3322, "text": "So how do you explain that the public speakers, would you say the good public speakers are usually introverts?"}, {"time": 3329, "text": "No, I think there's just different styles of it and I think that we just have, when we hear the word public speaker, we have a really limited idea of who that person would be."}, {"time": 3340, "text": "So for me, I used to be very phobic about public speaking and part of the reason for it was because I thought that being the kind of person I was, didn't equal being able to be a good public speaker, because you're only imagining, like the super kind of out there showman."}, {"time": 3360, "text": "But I think there's another style of public speaking that's more reflective and thoughtful and conveying ideas and people like that too."}, {"time": 3368, "text": "Is there advice you can give on how to overcome that?"}, {"time": 3370, "text": "Like if you're a shy person, how to be a public speaker."}, {"time": 3375, "text": "I can totally give that advice because I used to, before I would give speeches, if I had to do it in law school, if I knew like today was the day when I was gonna get called on in a law school class, I literally one time vomited on my way to class."}, {"time": 3389, "text": "Like that's how nervous I used to be."}, {"time": 3390, "text": "And yeah, the way to do it is through desensitization."}, {"time": 3397, "text": "It's like been figured out."}, {"time": 3398, "text": "It's the way to overcome any fear."}, {"time": 3399, "text": "You have to expose yourself to the thing you fear, but in very small doses."}, {"time": 3405, "text": "So you can't start by giving the TED talk."}, {"time": 3408, "text": "You have to start."}, {"time": 3409, "text": "I started by going to this class for people with public speaking anxiety, where on the first day, all we had to do was stand up and say our name and sit down and like that's the victory."}, {"time": 3421, "text": "That's fun to watch all those people with anxiety."}, {"time": 3425, "text": "Okay, that's the first step and the step, one step at a time."}, {"time": 3428, "text": "Yeah, and then like with this class, you go back the next week and he would have us come to the front of the room and stand up with other people standing next to us so that you didn't have the feeling of being all alone in the spotlight through others sharing it with you."}, {"time": 3444, "text": "And you would answer some questions about where do you grow up?"}, {"time": 3447, "text": "Where do you go to school?"}, {"time": 3449, "text": "And you declare victory and you're done."}, {"time": 3451, "text": "And then little by little by little, you keep ratcheting up the exercises until you get to the point where you can do it."}, {"time": 3457, "text": "And then you start having successes and you realize, oh, you know, actually I can do this."}, {"time": 3463, "text": "What about like writing versus improvising?"}, {"time": 3466, "text": "Because I knew a few people, sort of the colleagues of mine that were working on TED talks and it feels like you're supposed to like write the thing like way ahead of time and you practice it and they help you and all that kind of stuff."}, {"time": 3480, "text": "I don't think I've ever practiced the speech once in my life or a lecture or any of that."}, {"time": 3484, "text": "Like I know it's really good to do, but do you find that relieves some of your anxiety preparing well or are you now able to do not preparing well at all?"}, {"time": 3495, "text": "I definitely like to prepare before, but the kind of preparation that I've done for my TED talks is completely different from what I've done for everything else."}, {"time": 3506, "text": "Because TED talks are more like a theatrical event where it's like a one person show."}, {"time": 3511, "text": "And of course, if you were going to go on Broadway with a monologue, you'd know every word."}, {"time": 3516, "text": "So it's kind of like that."}, {"time": 3517, "text": "And so I would rehearse it over and over the way you would do that."}, {"time": 3521, "text": "Isn't that more anxiety, knowing every single word?"}, {"time": 3524, "text": "It's so much anxiety because yeah, you're not even so freaked out about being on stage so much as what if I forget something?"}, {"time": 3532, "text": "I mean, they do things like the last TED talk I gave, I actually did forget something halfway through."}, {"time": 3539, "text": "Like I just couldn't remember the next line."}, {"time": 3542, "text": "And so I had to walk over, like over there were my notes."}, {"time": 3545, "text": "And so I did that and the audience like very kindly clapped while I did that."}, {"time": 3551, "text": "And then I came back to the spotlight and kept going and they edit that out."}, {"time": 3555, "text": "Nice, so there's a failure mode."}, {"time": 3558, "text": "It seems really, it seems really stressful."}, {"time": 3561, "text": "Like I'm now, I'm not sure if I'll ever publish it, but I've been, mostly it's for a personal journey, but I've been working on a series on, wait for it, Hitler and the Third Reich."}, {"time": 3577, "text": "Sort of looking at the historical context of everything because my family was so much affected by that whole part of history."}, {"time": 3584, "text": "So for me to rigorously, I've read a lot about Stalin and Hitler, and for me to force myself, one of the best ways to force yourself to really consider material is to have to talk about it."}, {"time": 3596, "text": "And so that's why I'm doing it, but I'm playing with ideas of some of it, maybe like 20% is written down on paper, but the rest of it is my thoughts in the moment."}, {"time": 3612, "text": "That's a difficult balance to strike because if you write a lot, you're going to be more precise, you're going to be more accurate, but you're going to miss some of the deep, honest emotion."}, {"time": 3625, "text": "The silences won't be correct, or the silences between the words won't capture the depth of feeling."}, {"time": 3636, "text": "Unless, if you're somebody like me, if you're like, I guess that's what actors and actresses have to do."}, {"time": 3644, "text": "Basically, even though the script is fully written, you improvise between the words, between the lines."}, {"time": 3650, "text": "But that's a skill."}, {"time": 3652, "text": "Well, it also takes so much time."}, {"time": 3654, "text": "I mean, I experienced that with the TED Talks."}, {"time": 3657, "text": "It's like you get to a stage, so you're memorizing everything word for word, and at first, in that process, it comes out in a really wooden way, the way you're saying, like the emotion's gone."}, {"time": 3668, "text": "But once you really know it, so you've internalized the words, then all the emotion comes back, and you can say them in a completely different way."}, {"time": 3676, "text": "And you're really speaking it from the heart."}, {"time": 3677, "text": "But you have to know it so well before you can do that."}, {"time": 3681, "text": "I would never recommend it, because it's just like, it's so time consuming."}, {"time": 3685, "text": "It's an inch, well, in your case, it works out beautifully."}, {"time": 3688, "text": "Like when it all comes together, it is a theatrical thing."}, {"time": 3692, "text": "It's like a musical or whatever."}, {"time": 3697, "text": "I think I'm gonna come out with a one man show on Broadway, singing now, I'm inspired."}, {"time": 3703, "text": "For real, where are you gonna talk about Hitler and Stalin and everything you're learning?"}, {"time": 3709, "text": "Have you ever thought of using the medium of just speaking into a microphone, but without the video?"}, {"time": 3717, "text": "I'm curious about this, because I fell in love with podcasts originally, before there was ever this whole video component to it."}, {"time": 3725, "text": "And I realized there's something so primal and magical about having someone's voice in your ear."}, {"time": 3732, "text": "And my favorite kinds of interviews still, very few people do it this way nowadays, but my favorite kind are when you're just talking into the microphone."}, {"time": 3740, "text": "So it's not over Zoom, it's not in person, it's just you in the microphone and the other person in the microphone and they're in your ear."}, {"time": 3748, "text": "It's like the ultimate in intimacy."}, {"time": 3750, "text": "Oh, you mean from the interviewer perspective, that's still your favorite."}, {"time": 3753, "text": "Yeah, but it would be interesting also with the kind of thing you were talking about of just speaking, like just you and the mic."}, {"time": 3760, "text": "I would love to be in person, but you can't see the person."}, {"time": 3763, "text": "I wonder what that's like."}, {"time": 3764, "text": "What do you mean, like they're all there, but behind a curtain?"}, {"time": 3767, "text": "No, you just have your eyes closed."}, {"time": 3768, "text": "You're just talking, you have your eyes closed or whatever you have, because I think you still have to get the same kind of chemistry, because it's not just the visual."}, {"time": 3776, "text": "I don't even know that, because obviously I have trouble making eye contact."}, {"time": 3781, "text": "But I don't know if the visual stimulation is the necessary thing."}, {"time": 3784, "text": "There's something about the way audio travels that captures the intimacy, where some people actually have headphones on, like Joe does this, have headphones on."}, {"time": 3793, "text": "That's really intimate."}, {"time": 3794, "text": "Like there's something about that sound going directly into your ear."}, {"time": 3798, "text": "Yeah, there is something primal there."}, {"time": 3803, "text": "I've thought about it, definitely."}, {"time": 3805, "text": "And some of my favorite podcasts are like that, WTF with Marc Maron, that's audio only."}, {"time": 3811, "text": "There's a few audio only podcasts that I just love."}, {"time": 3815, "text": "I still go on Clubhouse, that was a social media platform where it's audio only."}, {"time": 3821, "text": "And it's so interesting that people, the interesting thing about Clubhouse in particular is people from all walks of life can tune in, and they just have, it's something you need to do some research in terms of introversion on that one, because I don't feel any of my introvert like triggers happening."}, {"time": 3843, "text": "Because nobody can see you, it's just audio, and nobody is offended if you're just sitting there quietly just listening."}, {"time": 3852, "text": "So you can participate whenever you want or not."}, {"time": 3856, "text": "Yeah, it's like the ultimate social freedom."}, {"time": 3858, "text": "You can listen as much as you'd like, you can participate if you want, but you don't have to, it's no big deal."}, {"time": 3862, "text": "Yeah, if I'm actually at a physical party, somebody's gonna look at me and be like why, there'll be that pressure to speak, but you don't have to in that kind of audio setting."}, {"time": 3874, "text": "And there's that intimacy."}, {"time": 3876, "text": "Like you can, when it's audio only, it feels like you can reveal a lot more of yourself in some kind of honest way."}, {"time": 3886, "text": "I don't know, but I assume it's tapping into something really ancient."}, {"time": 3889, "text": "Like we used to tell stories around the fire, like our whole storytelling tradition was oral originally."}, {"time": 3896, "text": "So maybe it's that."}, {"time": 3897, "text": "But we used visual stuff, like."}, {"time": 3900, "text": "That's true, you could actually see the person on the other side of the campfire."}, {"time": 3903, "text": "It seems like the visual element's so fundamental to the social interaction, but there's something primal about audio."}, {"time": 3911, "text": "I wonder what that is."}, {"time": 3912, "text": "And still, that's why, I mean, most people listen to podcasts, I think, audio only."}, {"time": 3917, "text": "They have it in their ears while they're doing stuff."}, {"time": 3919, "text": "Yeah, that's how I do it."}, {"time": 3921, "text": "And then there's, yeah, that's how I do it too."}, {"time": 3922, "text": "And that's where the friendship, like, is formed."}, {"time": 3926, "text": "It's weird, that deep connection with other humans."}, {"time": 3930, "text": "It's formed because they're in your ear."}, {"time": 3934, "text": "And you get to see them grow."}, {"time": 3935, "text": "You get to see them be bored, experience excitement, and anger, and fear, and all those kinds of things."}, {"time": 3942, "text": "It's fascinating, it's fascinating."}, {"time": 3945, "text": "The world of podcasting is fascinating because we're in this world of essentially radio, even though we all have all this high definition content, all this, like, TikTok style fast stuff and still podcasting."}, {"time": 3959, "text": "I know, and we still choose to do this."}, {"time": 3962, "text": "Because at the end of the day, I think that's really what people want most, is just to talk to each other and to know what people really think."}, {"time": 3967, "text": "And podcasting of all the media that I've ever seen is the one where people come closest to telling you the truth."}, {"time": 3975, "text": "And, you know, just telling you, like, the good and the bad and the bitter and the sweet and all of it."}, {"time": 3980, "text": "Especially long form, there's not enough time."}, {"time": 3983, "text": "I had to explain this to people."}, {"time": 3984, "text": "Like, you talk to CEOs and stuff."}, {"time": 3987, "text": "They don't understand, they're starting to understand much better."}, {"time": 3991, "text": "Now, as a hard requirement with, like, CEOs and stuff, it has to be three hours."}, {"time": 3997, "text": "I say, like, this is... Wow."}, {"time": 4000, "text": "Because there's something, they can't be doing marketing stuff for three hours."}, {"time": 4006, "text": "They break."}, {"time": 4007, "text": "They start being human, they start joking, they start relaxing."}, {"time": 4010, "text": "And if they can't, that also tells a kind of story."}, {"time": 4013, "text": "But I do that kind of torture for CEOs only."}, {"time": 4016, "text": "Yeah, when I was getting, my publishing house did media training with me before Bittersweet came out."}, {"time": 4022, "text": "And they were preparing me for, like, the five to seven minute interview that you might have, you know, if you go on some quick TV thing or something like that."}, {"time": 4033, "text": "And God, I hate that."}, {"time": 4034, "text": "It's like, it feels like you're basically having to not tell the full truth somehow because you can't tell it in such a short amount of time."}, {"time": 4044, "text": "Well, the other..."}, {"time": 4045, "text": "So to me, podcasting is just the best thing that's ever happened."}, {"time": 4048, "text": "The other downside of the seven minute interview is I think you could do a really good job with that, but the dance partner has to be very good."}, {"time": 4057, "text": "It's actually challenging for everybody involved."}, {"time": 4059, "text": "It's much harder for everybody involved."}, {"time": 4063, "text": "Because if you can do, you know, I can imagine like a Christopher Hitchens type character who's just super witty, then you could do a seven minute thing."}, {"time": 4072, "text": "You can get to the core of Bittersweet."}, {"time": 4075, "text": "You can get to the core of the book without asking those generic small talk questions."}, {"time": 4079, "text": "Because too many people in that short form interview are just asking very generic questions."}, {"time": 4085, "text": "They're doing small talk for seven minutes."}, {"time": 4087, "text": "It's like, all right, you only get seven minutes."}, {"time": 4091, "text": "You only get one interesting question."}, {"time": 4093, "text": "Go ask the weirdest, the deepest question that also energizes the other person."}, {"time": 4100, "text": "It's an art form that people don't take seriously."}, {"time": 4105, "text": "I think the seven minute thing, five minute or even less."}, {"time": 4109, "text": "And then the commercials, which I... Yeah, and I've noticed that many of the best podcasters are ones where when you're on my side of the table, you feel like it's more of a conversation and less like an interview where you're answering all the same questions you've answered a million times before."}, {"time": 4127, "text": "It's really interesting how different the experience is."}, {"time": 4131, "text": "And you're right, the audio thing, if you can lose yourself in that, the intimacy of that."}, {"time": 4137, "text": "And you don't even remember what stupid stuff you said."}, {"time": 4140, "text": "People, I've seen that, I mean, people don't give them enough credit as... You might not be aware, might not be a fan, but Joe Rogan is an incredible conversationalist in that he makes you forget that anything's being recorded, that you're talking at all."}, {"time": 4160, "text": "He makes you forget time and you just enjoy yourself."}, {"time": 4163, "text": "And that's whatever that is."}, {"time": 4168, "text": "And then you plug into that primal connection to other humans."}, {"time": 4174, "text": "What's your favorite Leonard Cohen song?"}, {"time": 4176, "text": "Famous Blue Raincoat."}, {"time": 4177, "text": "Do you know that one?"}, {"time": 4178, "text": "Yeah, maybe I'll play it."}, {"time": 4180, "text": "Yeah, for people who don't know Leonard Cohen and this is your first introduction to him, it's gonna sound so gloomy, but it's so good."}, {"time": 4189, "text": "He's got this deep, rich voice."}, {"time": 4192, "text": "Tony Amos covering Famous Blue Raincoat, yeah, yeah."}, {"time": 4195, "text": "No, we want the original."}, {"time": 4198, "text": "Just like Hallelujah, Jeff Buckley covered Leonard Cohen."}, {"time": 4202, "text": "That was a really good one."}, {"time": 4203, "text": "That was a really good one, yeah."}, {"time": 4204, "text": "And I also really like Rufus Wainwright's cover."}, {"time": 4207, "text": "But Famous Blue Raincoat, for people who don't know it, it's basically about a love triangle and it's told from the perspective of a man whose wife has just been with another guy who is also his friend."}, {"time": 4223, "text": "And he's writing a letter to that other guy and he's reflecting on the way that all their relationships have changed in the wake of this event."}, {"time": 4234, "text": "So they're still friends."}, {"time": 4236, "text": "So they're still, well, he refers to him as my brother, my killer, which is such a Leonard Cohen thing to do because it's always like, you know, it's light and it's dark, all at once."}, {"time": 4248, "text": "Nothing is ever all one thing."}, {"time": 4259, "text": "Yeah, I love this song."}, {"time": 4263, "text": "He just speaks in it."}, {"time": 4265, "text": "It's four in the morning, the end of December."}, {"time": 4272, "text": "And the fact that it's four in the morning and it's the end of December, like those are transitional moments, you know?"}, {"time": 4278, "text": "It's night going into day and it's December going into the new year."}, {"time": 4283, "text": "And it's the end of December and it's the end of December."}, {"time": 4291, "text": "And it's December going into the new year."}, {"time": 4294, "text": "It's not an accident."}, {"time": 4299, "text": "There is something about December."}, {"time": 4301, "text": "Whatever, there's certain scenes you can paint in your mind."}, {"time": 4306, "text": "There's a poem by Charles Bukowski called Nirvana."}, {"time": 4310, "text": "It's a young man traveling through the middle of nowhere in the snow."}, {"time": 4314, "text": "There's something about the snow, either the rain or the snow can put you in a certain kind of mood that just, what is it, James Joyce?"}, {"time": 4322, "text": "The dead, the snow is falling on Dublin."}, {"time": 4326, "text": "Yeah, it can put you in a place."}, {"time": 4328, "text": "I mean, David Yaden, he's a researcher in psychedelics and consciousness at Johns Hopkins."}, {"time": 4336, "text": "And he's done research that has found that when people are in their transitional moments of life, and it could be a career change, it could be a divorce, it could be that they're nearing the end of their life, that they very often will say, those are their most meaningful moments and their most spiritual moments."}, {"time": 4354, "text": "And so I feel like that's what Leonard Cohen knows how to tap into instinctively."}, {"time": 4358, "text": "The year after he died, his son, Adam Cohen, made a memorial concert for him where all these famous musicians came to Montreal where they had lived and performed his music."}, {"time": 4370, "text": "And my husband, who's not a Leonard Cohen fan and he's not a bittersweet type at all, but he knows how I feel about him, he's like, you should really go to that concert."}, {"time": 4379, "text": "And I felt so ridiculous."}, {"time": 4381, "text": "The whole family went all the way to Montreal on a Monday."}, {"time": 4385, "text": "On a Monday."}, {"time": 4387, "text": "It was just like a random Monday."}, {"time": 4389, "text": "And we got on the plane."}, {"time": 4390, "text": "So everyone's out of school, just so I can go to this concert."}, {"time": 4397, "text": "And I got there and at the beginning, I was feeling like, this was all a terrible mistake because it's all these other musicians playing this music and I don't actually really want to hear them."}, {"time": 4409, "text": "I'd rather listen to him on YouTube."}, {"time": 4411, "text": "And then a musician named Damien Rice came and played Famous Blue Raincoat and he sang it."}, {"time": 4420, "text": "And he did the most amazing thing at the end."}, {"time": 4424, "text": "The whole thing was amazing."}, {"time": 4425, "text": "But then at the end, he sang this musical riff that was like, all I could say is that it was like a musical lamentation of the ages."}, {"time": 4435, "text": "And the whole audience just rose silently to its feet."}, {"time": 4440, "text": "And it was one of the greatest moments that I've ever had."}, {"time": 4444, "text": "There's sometimes certain artists in a cover can capture in some kind of deeper way, like carrying the thread of the power of the song."}, {"time": 4453, "text": "So I've been listening a lot to Johnny Cash Heart, which is a Nine Inch Nails Trent Reznor song."}, {"time": 4460, "text": "You talked about it on your podcast with Rick Rubin, which is when I reached out to you."}, {"time": 4464, "text": "I love that interview and I love that song also."}, {"time": 4467, "text": "Yeah, so there's that."}, {"time": 4470, "text": "There's the Kennedy Center Honors where they celebrated certain artists."}, {"time": 4473, "text": "They did that for Led Zeppelin and I forgot what her name is, but the lead singer of Heart performs There We're To Heaven."}, {"time": 4481, "text": "And it's like, if you're like, all right, you take one of the great sort of rock songs of all time, what do you do?"}, {"time": 4488, "text": "Oh, the cool thing is you get to perform this in front of the artist while they're still there, you know, they're still alive."}, {"time": 4495, "text": "So you get to watch you sort of perform, and in that case, the president and President Obama's there and she's just knocked it out of the park."}, {"time": 4503, "text": "But at the same time, without outdoing the original, somehow you're just making it your own."}, {"time": 4512, "text": "You're making it your own, but not departing completely, not departing from the spirit of the original."}, {"time": 4519, "text": "It's tough because the original Halu by Leonard Cohen, it's just not, it's so powerful, but it's just not as good as some of these covers."}, {"time": 4531, "text": "Well, I think it's the words and the melody and then the covers take it to a different place."}, {"time": 4537, "text": "The thing that Leonard Cohen seems to do well, I don't think he did it on Hallelujah because he was almost being playful on Hallelujah."}, {"time": 4547, "text": "Like, I don't know, as opposed to that deep melancholy, like painful longing thing that Jeff Buckley did and others do too."}, {"time": 4558, "text": "I wonder if it's because in a way he, I don't mean that he over edited it, but he apparently worked on that song for years and went through gazillions of verses and checked most of them out."}, {"time": 4569, "text": "So I wonder if we're hearing his version after he's like a little tired with that process."}, {"time": 4575, "text": "Well, that's the other thing is like maybe from a book tour, you know, it's like you get tired of saying the same thing over and over and over and over."}, {"time": 4584, "text": "You forget, you forget the... You forgot like the initial, like the heart of it."}, {"time": 4589, "text": "But I actually got a chance to hang out with Dan Reynolds, who's the lead singer of Imagine Dragons, this incredible band, Super Pop."}, {"time": 4603, "text": "The most played band on like Spotify or something."}, {"time": 4606, "text": "His kids went through a huge Imagine Dragons phase, so we were listening to their music a lot."}, {"time": 4610, "text": "It was so surreal to be hanging out with him and he's such a good, like very few people I've met in my life are just as good of a human being."}, {"time": 4619, "text": "And that has to do with the fact that he struggles."}, {"time": 4621, "text": "He struggles, he still I think struggles, but he struggled for a long time with depression."}, {"time": 4626, "text": "And so out of that pain, you see born this really good human being, this really good relationship with his wife."}, {"time": 4635, "text": "Like when times are good, they lean on each other for like, they're deeply grateful for those precious moments."}, {"time": 4643, "text": "So it's beautiful to watch."}, {"time": 4645, "text": "But he said that it's really important to feel the song every time."}, {"time": 4653, "text": "Otherwise people know."}, {"time": 4655, "text": "People are really good at detecting your bullshit."}, {"time": 4658, "text": "You can't fake it."}, {"time": 4660, "text": "You really have to feel it every time."}, {"time": 4661, "text": "You have to feel the emotion of it, whatever the emotion is, of the original time you wrote it."}, {"time": 4669, "text": "So it's just interesting because it put, I thought you could maybe fake it, but he believes personally because he played in front of the gigantic crowds and over and over and over and over and over."}, {"time": 4680, "text": "He's like, no, every time you have to be there."}, {"time": 4683, "text": "But there's got to be times when he's about to go out and he's not feeling it and he has to figure out some way of getting himself into that heart space."}, {"time": 4690, "text": "Well, that's what he's saying."}, {"time": 4691, "text": "You have to, otherwise you're just, that's the job."}, {"time": 4695, "text": "Don't take the job then."}, {"time": 4698, "text": "And he loves it."}, {"time": 4700, "text": "He says the biggest struggle, in fact, is the come down from that, which is like you have such a beautiful experience of connecting with this large number of people, sharing a song that you love, and then it's just a rush of connection."}, {"time": 4716, "text": "And then you have to, you know, when you get off stage, you're now back to normal life."}, {"time": 4723, "text": "And that's why a lot of musicians get into heavy drugs and all that kind of stuff because you're looking for that rush again."}, {"time": 4729, "text": "It's very tough to like then go into this, speaking of introvert, because he probably is an introvert, is like you have to find that calmness."}, {"time": 4738, "text": "And how do you find the calmness when you were just playing in front of tens of thousands of people or hundreds of thousands, whatever that number is, that rush of connecting."}, {"time": 4747, "text": "And everybody, there's love in the air."}, {"time": 4749, "text": "And you still have to find that like inner peace and calm."}, {"time": 4753, "text": "So I don't know if this is the introvert in me talking and the writer in me talking, but I don't know."}, {"time": 4761, "text": "Like I love most the moments where let's say I'll get a letter from a reader who will tell me what something I wrote meant to them."}, {"time": 4769, "text": "And they'll talk about having had that kind of moment of, you know, the communion between the writer and the reader."}, {"time": 4774, "text": "And obviously I wasn't there physically when it happened, so I wasn't getting that kind of rush that a musician would get in a concert."}, {"time": 4780, "text": "But just the knowledge of that having happened out there in the world to do just something that I added to it is the most amazing thing."}, {"time": 4789, "text": "You love it."}, {"time": 4790, "text": "But imagine reading like thousands of those letters, and then it's such a strong rush and everything else doesn't."}, {"time": 4799, "text": "It could be overwhelming I guess."}, {"time": 4801, "text": "But like anything else, you have to come down and find a calm place."}, {"time": 4806, "text": "Like for example, the danger with getting letters like that, you start taking yourself too seriously."}, {"time": 4811, "text": "You think like you are a special person somehow."}, {"time": 4814, "text": "But you really want to avoid that feeling too."}, {"time": 4819, "text": "Yeah, I don't actually experience it as that much different from when I'm on the other side of it."}, {"time": 4824, "text": "Like if I'm the reader and some other writer has made me feel that way, to me it's the same thing."}, {"time": 4830, "text": "Yeah, it's a cool, it's a virtual hug."}, {"time": 4834, "text": "I think it's like I was just listening to something about the different Russian writers."}, {"time": 4842, "text": "I was mentioning him to you, this academic."}, {"time": 4844, "text": "His name is Gary Salmorson, and he studies Russian literature."}, {"time": 4848, "text": "And he was talking about, I don't know if I'll be able to get this right, but basically that the people misunderstand a work like Anna Karenina and that we think of it as telling us that you're supposed to live, you're supposed to have like these grand, tempestuous romances that might end in death or despair or whatever it is, but you should be in it for the intensity of the emotion."}, {"time": 4875, "text": "And he's saying actually that's exactly not what Tolstoy was saying, that actually it was the opposite, that he was really advocating for everyday life."}, {"time": 4887, "text": "He was saying it's scenes from everyday life."}, {"time": 4889, "text": "He was juxtaposing Anna Karenina with all these other couples who were just living happily and quietly day by day."}, {"time": 4896, "text": "And that was what he believed was the ideal, as opposed to the grand rush and as opposed to the intensity."}, {"time": 4905, "text": "I wonder if he, is there a romance just at day to day?"}, {"time": 4912, "text": "I think there is a romance to the day to day, absolutely."}, {"time": 4915, "text": "Don't get distracted by the dopamine rollercoaster ride of the grand romantic notions."}, {"time": 4920, "text": "Yeah, and enjoy it while it's happening, because those are real life experiences also, but not to mistake those for being everything."}, {"time": 4927, "text": "Where is he from?"}, {"time": 4929, "text": "He's a professor at Northwestern."}, {"time": 4931, "text": "At Northwestern."}, {"time": 4932, "text": "And apparently his lectures are like the most popular on campus."}, {"time": 4935, "text": "Wow, people love him."}, {"time": 4937, "text": "Gary Saul Morrison is an American literary critic and slobist."}, {"time": 4941, "text": "He's particularly known for his scholarly work on the great Russian novelists Leo Tolstoy and Fyodor Dostoyevsky."}, {"time": 4948, "text": "Morrison is Lawrence D. Professor in the Arts and Humanities at Northwestern University."}, {"time": 4953, "text": "Wow, and there's a lot of incredible work."}, {"time": 4955, "text": "And then I'm sure looking through the lens of Russian literature and the romance of all of that, he's looking at the modern world."}, {"time": 4962, "text": "I think you should have him on your podcast."}, {"time": 4964, "text": "And Quiet Flows the Vodka or When Pushkin Comes to Shove the curmudgeon's guide to Russian literature and culture."}, {"time": 4971, "text": "This is one of the silly books he has on the list."}, {"time": 4975, "text": "What were you saying?"}, {"time": 4977, "text": "Oh, no, I was just saying, yeah, like I find that when I take photos on my phone, I hardly ever take photos at the moment you're supposed to."}, {"time": 4985, "text": "Like everybody's gathered for some event."}, {"time": 4987, "text": "I'll forget to take the photo."}, {"time": 4989, "text": "But I take a lot of like scenes from everyday life because that's what I actually want to remember in the end."}, {"time": 4995, "text": "Yeah, yeah, I'm the same."}, {"time": 4998, "text": "The same."}, {"time": 4999, "text": "It's actually concerning because it's bad for productivity because I love everyday life so much."}, {"time": 5006, "text": "Then why do any ambitious big thing?"}, {"time": 5009, "text": "Your productivity is pretty good."}, {"time": 5011, "text": "I don't know that you have to worry about it."}, {"time": 5014, "text": "So I want to launch a business."}, {"time": 5016, "text": "I have a dream outside."}, {"time": 5018, "text": "This is like a fun side thing that there's been a lifelong passion."}, {"time": 5025, "text": "Anyway, I like building."}, {"time": 5027, "text": "I like building stuff and I haven't been doing that as much as I would like."}, {"time": 5030, "text": "That's because largely because I like sitting in silence and enjoying the beauty that is just nature and life."}, {"time": 5039, "text": "When there's people, there's people."}, {"time": 5042, "text": "I love everything."}, {"time": 5043, "text": "So when you love everything, why go through hell to build a company?"}, {"time": 5048, "text": "Yeah, that's a valid question."}, {"time": 5051, "text": "I mean, I think you have to have a really good reason for wanting to do it."}, {"time": 5054, "text": "But then your heart calls you for the certain."}, {"time": 5056, "text": "Sometimes you look out into the mountains and you say, for some reason I long to go there even if it means leaving the tribe and putting yourself in danger and doing stupid shit."}, {"time": 5067, "text": "That's the human imperative for exploration."}, {"time": 5072, "text": "Like when we were talking about this idea of longing being like the source code of humanity, I think that's also the source code of our creativity."}, {"time": 5082, "text": "It's the same longing for Eden."}, {"time": 5084, "text": "It's like you're always reaching for something that you want to get to or that you want to build."}, {"time": 5090, "text": "It's the best of us."}, {"time": 5095, "text": "You write about creativity and sadness."}, {"time": 5099, "text": "Practically speaking, how should we leverage sadness for creativity?"}, {"time": 5105, "text": "Is that sort of in the artist domain, in the writer's domain, in the engineering domains and so on?"}, {"time": 5112, "text": "It's definitely in those domains, but it's in all domains."}, {"time": 5117, "text": "We're all going to face pain in this life at some point, and we all have the ability to weather it and withstand it and live with it for a bit and then try to transform it into something that we find beautiful."}, {"time": 5134, "text": "It's very easy to notice the grandeur of the painting hanging on the gallery wall or the new company that's just been created, but it takes a thousand different forms."}, {"time": 5148, "text": "You could bake a cake or in the wake of the pandemic, we've had more people applying to medical school and nursing school, and after 9.11, you had people applying for jobs as firefighters and teachers."}, {"time": 5162, "text": "So there's something in the human spirit that takes pain and turns it into meaning when we're at our best."}, {"time": 5169, "text": "And when we're not at our best, we deny the pain and then take it out on ourselves and on other people."}, {"time": 5175, "text": "So there's a kind of fork in the road of what to do with it."}, {"time": 5178, "text": "But we know, I mean, there's all these studies that I go through in the book."}, {"time": 5210, "text": "They were like primed to remember finality, you know, like love and finality, basically."}, {"time": 5215, "text": "Love and impermanence."}, {"time": 5218, "text": "There's something about that that gets us to our most beautiful state."}, {"time": 5223, "text": "I wonder if it is, I mean, there's studies like that, there's a, I don't know if you looked into terror management theory."}, {"time": 5229, "text": "Yeah, that's really interesting stuff."}, {"time": 5231, "text": "So they, especially intensely, have you focused on not just sad but traumatic, like death, prime you with death and see how that changes your mind."}, {"time": 5243, "text": "Like both, like, I don't know if there's creativity studies, but they have interesting, I think a little bit tainted by political bias, but maybe not."}, {"time": 5255, "text": "Psychology is a complicated field, but they study like who are you likely to vote for, if you're primed by existential, like by thinking about death."}, {"time": 5265, "text": "Like the fear of mortality."}, {"time": 5266, "text": "Fear of mortality."}, {"time": 5267, "text": "I forget what the conclusions are, but."}, {"time": 5269, "text": "I think they find that people become more tribalistic."}, {"time": 5273, "text": "You know, like there was one study where they found that after they primed people that way, that they would then give them the chance to put hot sauce on a meal that their political opponents were going to be eating, and they put way too much hot sauce on after they've been primed to worry about death."}, {"time": 5291, "text": "I think at the core, we're simple creatures."}, {"time": 5295, "text": "So I actually, like in the book, I spent a bunch of time with people who are working on radical life extension, you know, or the quest to live forever."}, {"time": 5305, "text": "And people ask them a lot questions like, you know, the kinds of questions you were talking about earlier."}, {"time": 5310, "text": "Like how are you going to feed everybody and how is there going to be space for everybody if everyone really could live forever?"}, {"time": 5316, "text": "And what about conflict?"}, {"time": 5318, "text": "Won't we have an intensified conflict?"}, {"time": 5320, "text": "And their answer to that is they point to terror management theory."}, {"time": 5325, "text": "You know, and they say because it's the fear of death, they're basically saying it's the fear of death that are causing our conflicts in the first place."}, {"time": 5332, "text": "And that if we remove the fear of death, we'd have less conflict to contend with."}, {"time": 5338, "text": "And that, I don't really buy that."}, {"time": 5340, "text": "It's possible that that's true, but are you also, how does the expression go, throwing out the baby with the bathwater?"}, {"time": 5347, "text": "Are you also going to remove basically any source of meaning and happiness in the human condition?"}, {"time": 5356, "text": "Like it's very possible that death is fundamental to the human condition, the finality."}, {"time": 5362, "text": "Yeah, that's the great philosophical question."}, {"time": 5365, "text": "And I went to a conference of people who are working on this, and I thought that they were going to be talking about those questions all through the conference."}, {"time": 5373, "text": "But the MO is much more like we're so happy that we're here with people who have gotten past all those quibbles."}, {"time": 5381, "text": "You know, we just know there's going to be meaning no matter what."}, {"time": 5384, "text": "The basic assumption is let's try to extend life indefinitely, and then we'll figure out if that's a good decision."}, {"time": 5393, "text": "Or more like we're sure it's a good decision."}, {"time": 5395, "text": "Or at least that was what I felt."}, {"time": 5398, "text": "It's either we're sure it's a good decision, or we're sure that it's good to believe that it's a good decision."}, {"time": 5408, "text": "Meaning like there's no downside to that, even if we find out it's wrong."}, {"time": 5414, "text": "But yes, there's a kind of certainty."}, {"time": 5416, "text": "Obviously you want to extend human life, that's the kind of assumption."}, {"time": 5419, "text": "That always seemed, now it could be true, but just like the people who over focus on colonizing other planets, it feels like you neglect the beauty and the struggle of our life here on Earth."}, {"time": 5440, "text": "I have sort of the same kind of criticism, whether it's thinking about Valhalla or any other afterlife, is you can have, if you're not careful, forget to make this life a great one."}, {"time": 5455, "text": "Whatever happens afterwards."}, {"time": 5457, "text": "So yeah, definitely."}, {"time": 5458, "text": "But from an engineering, from a biology, from a chemistry perspective, it's very interesting to think how do we extend this thing."}, {"time": 5465, "text": "Because it does seem that nature, the way it designed living organisms, it really wants us to die."}, {"time": 5472, "text": "Because that's part of the selection mechanism."}, {"time": 5475, "text": "This part seems to be fundamental to evolution."}, {"time": 5478, "text": "It gets people young, they need protection."}, {"time": 5483, "text": "Once they're a young brain, they get to explore a lot, get to figure out the world, they come up with their own novel ideas, how to adapt and how to respond to that world."}, {"time": 5493, "text": "And then as they get older and older, they get like stubborn and stuck in their ways."}, {"time": 5498, "text": "So we need them to die so we make room for new life that's able to adapt to the changing environment."}, {"time": 5506, "text": "If the old doesn't die, then you're going to get stale and not be adaptable to the changing environment."}, {"time": 5515, "text": "But maybe it doesn't have to happen so soon."}, {"time": 5517, "text": "Yeah, maybe it doesn't."}, {"time": 5519, "text": "Listen, I'm a big fan of pressing snooze on the alarm clock in the same way."}, {"time": 5526, "text": "I'm one of the people that believe it's, or I don't definitely believe, of course, I don't know, but I think death is a fundamental part of life."}, {"time": 5542, "text": "But yeah, if I'm on my deathbed, I would sure as hell press snooze as many times as possible."}, {"time": 5549, "text": "And it's interesting because in some ways I share your instinct."}, {"time": 5553, "text": "There was one scientist who I spoke to at that conference, he's one of the leading advocates, and he said, you know, that's a story that we've invented for ourselves because we have no choice."}, {"time": 5565, "text": "And if you really believe that you have no choice, then it's adaptive to tell that story, that death gives meaning to life."}, {"time": 5573, "text": "But if you really think you could triumph over it, would you still be telling that same story?"}, {"time": 5579, "text": "And I've been thinking about that question ever since."}, {"time": 5582, "text": "Yeah, yeah, no, they got a good point."}, {"time": 5585, "text": "They got a good point."}, {"time": 5586, "text": "No matter what, as an engineer in the scientific pursuits, it's a beautiful one."}, {"time": 5591, "text": "In your own personal life, if we can go there."}, {"time": 5595, "text": "What have been some dark places you've gone in your own mind?"}, {"time": 5599, "text": "Grief, loss, sad moments, moments of sadness that have made you a better writer, a better creator, a better human being?"}, {"time": 5613, "text": "Well, I mean, I've been through a lot of bereavement just in these last couple of years with COVID, but even before that, I mean, there's all kinds of stuff."}, {"time": 5625, "text": "I write about it in the book, and in some ways I feel like I can write about those kinds of things better than I can speak them."}, {"time": 5632, "text": "But I had a really complicated relationship with my mother growing up where we had a kind of Garden of Eden during my childhood."}, {"time": 5642, "text": "We were intensely, intensely close."}, {"time": 5645, "text": "And my mother, because of some vulnerabilities that she had, reacted with a lot of trouble to my adolescence and to growing independent from her and starting to have different religious views and different political views and all kinds of things."}, {"time": 5669, "text": "And we had a pretty intense break that I describe in the book, and it was so intense that even though after that we still would get together for holidays and talk to each other on the phone and all that, there was a sense in which it was over at that point."}, {"time": 5691, "text": "The relationship was over."}, {"time": 5693, "text": "The Garden of Eden was no more."}, {"time": 5696, "text": "It was like a feeling of like, yeah, I know what Eden was like, and it's not there anymore."}, {"time": 5705, "text": "And I think it was all the more confusing because if you lose someone to actual bereavement, you go through a mourning process, and people have thought for thousands of years about how to do that."}, {"time": 5715, "text": "But with something like this, there's no process because you're not even admitting to yourself, especially when you're in your teens and 20s, that you're mourning something."}, {"time": 5727, "text": "But it was the case that for decades, for decades, I could not answer even the simplest question about my mother, like where did she grow up, without tears in my eyes, or more than tears in my eyes, like embarrassing tears."}, {"time": 5742, "text": "So I would just try to steer the subject in another place."}, {"time": 5747, "text": "But I will say two things happened."}, {"time": 5750, "text": "One is that I've spent the last six, seven years writing this book about joy and sorrow and loss and love and all of it, and I've really come to terms with all of it."}, {"time": 5762, "text": "And then the second thing that happened is my mother now has Alzheimer's."}, {"time": 5767, "text": "And in her Alzheimer's, she's still actually the same person, like she's forgotten most things, but she still has these conversational lanes that you can travel down that are like the way she always was."}, {"time": 5780, "text": "And the way that she was when I was a kid, which was like so incredibly loving and so connected and so warm and sweet and funny and all of it, all the things I remembered, like it's all come back."}, {"time": 5795, "text": "And for all these decades, I had been wondering whether that Garden of Eden I remembered had actually happened, or whether that was just like the fantasy of a child, and maybe it was always difficult and I had not seen it."}, {"time": 5812, "text": "But I'm seeing her now, and I realize that it was all true, everything I remember, it was all true."}, {"time": 5819, "text": "It all happened, because it's happening again."}, {"time": 5824, "text": "And you return to the Garden of Eden for a time."}, {"time": 5829, "text": "And to childhood."}, {"time": 5829, "text": "It's always a question of whether you can return to that place."}, {"time": 5834, "text": "I don't even know if I'd say I've returned, because I'm a different person now, and I don't need her."}, {"time": 5843, "text": "So you're different than the 10 year old?"}, {"time": 5843, "text": "You feel different?"}, {"time": 5849, "text": "No, I mean, I'm the same person in terms of my need for love and love of love and all of that, but I don't look, I'm not dependent on my mother for it the way I was then, and that makes the experience really different."}, {"time": 5863, "text": "Yeah, when you're younger, she's a god figure."}, {"time": 5868, "text": "What is that, that the roots, the parents, such a funny civilization will live."}, {"time": 5874, "text": "And there's a depth of connection to parents that's probably more powerful than anything else in terms of its formative effect on who you are."}, {"time": 5882, "text": "I think it's the most powerful."}, {"time": 5882, "text": "And in fact, when this started happening, I got to college and I took a class in creative writing, and I tried to write a story, a fictionalized version of what was happening."}, {"time": 5895, "text": "And I called it The Most Passionate Love, because of what you just said."}, {"time": 5900, "text": "And the teacher actually said to me, she was like, you know, you should put this story in a drawer and not take it out again for 30 years because you're way too close to it."}, {"time": 5909, "text": "So I've now finally written it 30 years later."}, {"time": 5916, "text": "Yeah, you're probably still too close to it though."}, {"time": 5920, "text": "I don't know, though."}, {"time": 5920, "text": "I mean, I do think everybody goes through experiences in this life where you're experiencing a fundamental pain of separation and desire for a union."}, {"time": 5933, "text": "And it takes so many different forms."}, {"time": 5933, "text": "And this was my primal form of it."}, {"time": 5938, "text": "But for someone else, it's a betrayal or a bereavement or an exile from a country of their birth or whatever it is."}, {"time": 5947, "text": "And then you get to solve that puzzle for the rest of your life."}, {"time": 5951, "text": "Yeah, the fact of like, I really do believe that the original love that we long for, like that one of the great things that you learn as you grow older is that the love exists in some plane that's more general than the particularized form in which you first knew it."}, {"time": 5969, "text": "Yeah, I mean, that's why, despite all the creepy interpretations, even though Sigmund Freud is probably wrong in the details, he was the first one to sort of suggest that our experiences..."}, {"time": 5982, "text": "I mean, he said that that was really controversial at the time when young people, they start having sexual thoughts like at age two or something, whatever the hell he said."}, {"time": 5993, "text": "So you develop this kind of connection to the opposite sex or whatever, to your mother, to your parents."}, {"time": 6000, "text": "And I think while a lot of that is shown to be probably not true, what is like a deeper truth there is your first early experiences of love or depth of connection are probably somehow strongly formative of your conception of love and your definition of the perfect thing you're reaching for for the rest of your life."}, {"time": 6022, "text": "And you can really see it when you become a parent, too."}, {"time": 6022, "text": "You know, you can just see like, there's... Don't screw it up."}, {"time": 6031, "text": "You know, I have to say, like, I mean, knock on wood, I actually feel like, like, we're doing pretty well."}, {"time": 6031, "text": "Like, my kids are teenagers now."}, {"time": 6031, "text": "And I really had thought that I wasn't going to repeat the issues that I had been through with my mom."}, {"time": 6031, "text": "And I can say, I really am not."}, {"time": 6049, "text": "Yeah, like, my mom, for various reasons, just had a lot of trouble with my independence."}, {"time": 6049, "text": "And I just don't feel that at all."}, {"time": 6049, "text": "So... Yeah, there might be other things you're totally blind to."}, {"time": 6063, "text": "I guess that's possible."}, {"time": 6064, "text": "Isn't that the way of parenting?"}, {"time": 6064, "text": "You solve the problems of the past."}, {"time": 6068, "text": "But there's some other new one."}, {"time": 6068, "text": "I guess I'll find out in 10 or 20 years."}, {"time": 6068, "text": "But like, so far, so good."}, {"time": 6074, "text": "What wisdom about parenting can you give from your own experience and from your writing?"}, {"time": 6080, "text": "Yeah, well, oh my god, there's a lot to say."}, {"time": 6080, "text": "So, on the bittersweet side of things, the wisdom that I would give is that, especially for kids who are growing up in relative comfort with everything going pretty well, they get the idea that real life is when things are going well."}, {"time": 6107, "text": "And when things don't go well, it's like a detour from the main road, as opposed to understanding that it's all the main road."}, {"time": 6115, "text": "And I tell this story in the book of this time that we went on this family vacation where we rented a house in the countryside."}, {"time": 6123, "text": "And the house was next to this field where lived two donkeys that our kids fell in love with."}, {"time": 6130, "text": "They were like really little at the time, two boys."}, {"time": 6130, "text": "And they're spending all this time feeding carrots to the donkeys and it's all beautiful."}, {"time": 6138, "text": "And then comes the day where they realize that we're leaving in like two days and they're never going to see these donkeys again."}, {"time": 6144, "text": "And they start crying themselves to sleep."}, {"time": 6144, "text": "And the usual things that parents might say at a moment like that of like, you know, maybe we'll come back or another family will feed them, will feed these donkeys."}, {"time": 6156, "text": "None of that made any difference."}, {"time": 6156, "text": "But when we said to them, you know, goodbye is part of life and this feeling you're having, everybody has it."}, {"time": 6168, "text": "You've had it before."}, {"time": 6168, "text": "You're going to have it again."}, {"time": 6168, "text": "You'll feel better in a couple of days."}, {"time": 6168, "text": "But this is the way it's supposed to be."}, {"time": 6168, "text": "This is natural."}, {"time": 6177, "text": "That's when they stopped crying because I think that's when they stopped resisting."}, {"time": 6183, "text": "Like it's one thing to feel the pain of goodbye and it's another thing to be feeling like this isn't supposed to be happening."}, {"time": 6190, "text": "It's the resistance part of this isn't supposed to be happening that makes life really difficult as opposed to a more clear eyed view of what it really is."}, {"time": 6199, "text": "This is indeed supposed to be happening."}, {"time": 6199, "text": "There's a show called Yellowstone that I recently started watching."}, {"time": 6204, "text": "Yeah, no, I've heard of it."}, {"time": 6204, "text": "We actually started watching it, but only a few minutes and didn't get into it."}, {"time": 6209, "text": "So there's just a quick, it's not a spoiler of any kind, but there's a father taking out the son for the first time to go hunting and to shoot their first buck."}, {"time": 6219, "text": "And the son is getting really sad because he pulls the trigger and he took a life."}, {"time": 6225, "text": "And the father says that everybody gets killed in this life."}, {"time": 6225, "text": "That's the way of nature."}, {"time": 6225, "text": "That's the way each one of us is going to get killed."}, {"time": 6236, "text": "And it's interesting because I didn't really think of it that way because you think you die, but he really framed it as killed because he's like, there's no such thing as dying of old age."}, {"time": 6251, "text": "Let's medically, let's discuss that a bit, but basically there's something, whether it's a truck or a bacteria, something's going to kill you in the end."}, {"time": 6265, "text": "And that was an interesting way to look at it because we tend to think of humans aren't supposed to be killed."}, {"time": 6273, "text": "We think of murder as one of the sins, sort of one of the things that you don't do in society."}, {"time": 6278, "text": "We do, that's a more technical discussion, whether we ultimately get killed by something in the end."}, {"time": 6285, "text": "But to some degree that's true, at least for most of us, that there's something that gets us, whether it's cancer, those kinds of things."}, {"time": 6293, "text": "But yeah, it's that reframing of it's not, it's supposed to be, this is the way of the world."}, {"time": 6299, "text": "So it's funny."}, {"time": 6299, "text": "I mean, you know, at the same time that I just wrote a whole book about the fact that this is the way it is, like I really do believe this is the way it is."}, {"time": 6307, "text": "And with this reality, there's an intense beauty that comes along with it."}, {"time": 6312, "text": "So we have to accept the reality to get to the beauty."}, {"time": 6316, "text": "And at the same time, there's a part of me that's just like, yeah, but give me the magic wand to make the world different."}, {"time": 6326, "text": "I don't know how much of this is a female thing, too."}, {"time": 6329, "text": "Like I was watching with my son, my 12 year old the other day, we were watching this show about the battle of Thermopylae."}, {"time": 6337, "text": "And it was like all about, you know, valor and glory on the battlefield."}, {"time": 6342, "text": "And I said to him something like, gosh, don't you just wish we lived in a world where you didn't have to do all this in order for everyone just to live their lives?"}, {"time": 6354, "text": "And he just looked at me completely puzzled."}, {"time": 6357, "text": "Like, no, you know, like to him, it all just seemed self evident that the world would be structured that way."}, {"time": 6363, "text": "You know, and he had like the 12 year old admiration for the valor of it all."}, {"time": 6369, "text": "But you wonder if that's nature or nurture."}, {"time": 6376, "text": "I wonder what that world looks like."}, {"time": 6380, "text": "We do live in a world where murder is seen as bad, but you look at a lot of the human history."}, {"time": 6386, "text": "I don't know if they had the same kind of conception of that."}, {"time": 6390, "text": "In terms of, you have to ask what kind of murder, you know, for what purpose, you know, war was a way of life."}, {"time": 6402, "text": "It's interesting if we can imagine properly a future that is different than ours in terms of operating under different moral systems."}, {"time": 6413, "text": "I'd like the same with living indefinitely or living in a society with no war."}, {"time": 6421, "text": "Like how fundamental is war?"}, {"time": 6423, "text": "How fundamental is death?"}, {"time": 6425, "text": "I mean, I think it's so fundamental to our source code."}, {"time": 6428, "text": "I just wish that our source code were different, basically."}, {"time": 6431, "text": "Like I can't get past that wish."}, {"time": 6434, "text": "There's brain computer interfaces that try to merge."}, {"time": 6438, "text": "We have smartphones, we're already kind of cyborgs, but greater and greater merger of computational power."}, {"time": 6446, "text": "So literally adding source code to our original source code."}, {"time": 6450, "text": "There's the mushy biology that runs source code, and then there's more cold electrical systems, and then they integrate together."}, {"time": 6461, "text": "And eventually, one day we offload the magic that is human consciousness also into the machine, and then we'll get to see."}, {"time": 6471, "text": "Maybe they'll be a little bit less assholish about the whole war thing."}, {"time": 6475, "text": "That'd be more."}, {"time": 6477, "text": "But there is, I think, even when I think about engineering human intelligence or superhuman intelligence systems, I feel like they also need to have the yin and yang of life."}, {"time": 6489, "text": "They have to be able to be afraid and to be sad and all those kinds of things."}, {"time": 6494, "text": "But maybe it's because I'm a product in this particular environment."}, {"time": 6499, "text": "Maybe sadness is a useful human invention, but not a universal one."}, {"time": 6505, "text": "This is what I don't know, because this is where I come back to, as I told you, the original reason that I wrote my whole book was the feeling that somehow in the expression of sad music is what other people see when they talk about God."}, {"time": 6520, "text": "Like there's something so, there's like an ultimate beauty there that I don't know if we have access to without that."}, {"time": 6528, "text": "But maybe we do."}, {"time": 6530, "text": "But I can say in this world, that's a great way to get access to that state."}, {"time": 6534, "text": "Is it within the reach of science to deeply understand this, you think?"}, {"time": 6538, "text": "To understand why you feel sad when you're listening to a song?"}, {"time": 6541, "text": "Or why you feel so much love when you're listening to a sad song."}, {"time": 6544, "text": "To a sad song, right."}, {"time": 6546, "text": "Why the sad song opens up some kind of deep connection to something you can call divine or something, whatever the heck that is."}, {"time": 6556, "text": "Yeah, I do think."}, {"time": 6558, "text": "I mean, we have like really early signs of it from the research, and I'm sure we're just at the scratching the surface stage."}, {"time": 6566, "text": "But I mean, like we know, for example, that the vagus nerve, which is so fundamental that it governs our breathing and our digestion, our vagus nerve also activates when we see another being in distress."}, {"time": 6580, "text": "There's like an instinctive impulse to want to make it stop."}, {"time": 6585, "text": "And the theory is that that's an evolutionary design because we had to be able to respond to the cries of our infants."}, {"time": 6593, "text": "You know, and from that ability grows the greater ability to respond to other people's cries too."}, {"time": 6599, "text": "So that's probably just, you know, like the very first step in being able to understand what all that is."}, {"time": 6608, "text": "You've already given plenty of advice, but broadly, what advice would you give to young folks today about career, about life?"}, {"time": 6617, "text": "Whether they want to be writers, lawyers, scientists, musicians and artists, whatever the heck they want to be."}, {"time": 6624, "text": "How can they live a life they can be proud of?"}, {"time": 6627, "text": "Okay, here's what I think."}, {"time": 6632, "text": "You should absolutely do that thing that you're dying to do, but you should always have a plan B, like a backup plan and a way of earning a living no matter what happens."}, {"time": 6647, "text": "Because I feel like people, we have this narrative in our culture of like the glamorous thing is to figure out the thing you love and then risk everything to achieve that."}, {"time": 6661, "text": "But first of all, a lot of people aren't comfortable with that level of risk."}, {"time": 6665, "text": "And second, when you're living with that level of risk, that's a cognitive load too."}, {"time": 6670, "text": "And so you don't have the full emotion and heart to be able to focus on the thing that you actually really love because you're like stressed out about it."}, {"time": 6678, "text": "So I'd say like, get the backup plan in place and then do the thing."}, {"time": 6683, "text": "My advice would be the opposite."}, {"time": 6685, "text": "Okay, tell me why."}, {"time": 6687, "text": "Well, I think the best, the truth is be aware of the cost not having a plan B has."}, {"time": 6697, "text": "So do it deliberately if you don't."}, {"time": 6699, "text": "But I'm with Bukowski on find what you love and let it kill you."}, {"time": 6704, "text": "I think you have to actually know your personality."}, {"time": 6707, "text": "I know if I have a plan B, I will not try as hard on plan A and I would likely take plan B."}, {"time": 6716, "text": "Because if plan A is the risky thing, I just work much better when in the state of desperation."}, {"time": 6724, "text": "So with my back against the wall and you have to know that about yourself, I think that has to do with..."}, {"time": 6728, "text": "So I think we can refine it to say you actually have to really know yourself and how you respond to different kinds of risk."}, {"time": 6734, "text": "Like I would not do well in that kind of situation."}, {"time": 6737, "text": "I'd be like up at two in the morning worrying about it."}, {"time": 6740, "text": "Whereas if I have some, like it doesn't have to be paying the rent in some grand way, but if there's some basic way of paying the rent, then my heart's free to do the thing I really love."}, {"time": 6752, "text": "For me, the only way I'm free is when I don't know how I'm going to pay the rent."}, {"time": 6760, "text": "Yeah, because otherwise I'll find a way to pay the rent that's not at all a source of deep fulfillment for me."}, {"time": 6770, "text": "So it's like if you don't have like the, what's the expression?"}, {"time": 6773, "text": "I don't know, something like the dog at your back."}, {"time": 6775, "text": "Yeah, deadlines."}, {"time": 6776, "text": "Then you won't actually do it."}, {"time": 6777, "text": "I create real or artificial deadlines, anxiety and so on."}, {"time": 6781, "text": "So yeah, you have to know yourself."}, {"time": 6784, "text": "Yeah, so really the advice is know your triggers."}, {"time": 6786, "text": "But we're still saying the same basic thing of like do the thing you really love, but just set up the rest of your life."}, {"time": 6794, "text": "Strategize appropriately to your personality and triggers."}, {"time": 6801, "text": "The meaning of this whole thing probably has something to do with whatever we feel when we listen to a sad song."}, {"time": 6810, "text": "Yeah, because two things come simultaneously to my mind when you ask that question, and I've been asking it since I was four."}, {"time": 6819, "text": "I remember the first time I did."}, {"time": 6822, "text": "The question is more important than the answer probably."}, {"time": 6825, "text": "Just keep asking."}, {"time": 6826, "text": "I don't know, the first one is beauty and I don't know why beauty is so important, but I just know that it is."}, {"time": 6831, "text": "And impossible to define perhaps."}, {"time": 6837, "text": "Other than you know it when you see it."}, {"time": 6839, "text": "I don't know, I mean just."}, {"time": 6842, "text": "It has to do with that line that you feel something when you just see it or you hear it."}, {"time": 6848, "text": "Yeah, you just see it and it's like whatever can deliver you to that mode of transcendence where you're no longer purely in your own self and you're in something higher."}, {"time": 6862, "text": "And when you're in those states of mind, you know it because you have the temporary sensation that you could die at that moment, that the people you love could die and it will all be okay because there's something else."}, {"time": 6879, "text": "So that's my first answer."}, {"time": 6881, "text": "And then my second answer is the need to relieve psychic pain, like other people's psychic pain."}, {"time": 6888, "text": "I don't know why that's just like an impulse that I have."}, {"time": 6891, "text": "Psychic pain is more like suffering of any form."}, {"time": 6895, "text": "Yeah, but I mean."}, {"time": 6898, "text": "Is there a particular."}, {"time": 6899, "text": "Yeah, just making the world better and less pain, less pain to go around in general."}, {"time": 6909, "text": "Hence your sort of optimistic desire and longing for a world without sort of destruction, without malevolent destruction."}, {"time": 6919, "text": "A world where that wouldn't be necessary."}, {"time": 6923, "text": "But yeah, like I so I had this moment."}, {"time": 6927, "text": "It wasn't so long ago I was doing some interview and somebody asked me, like, what are you longing for right now?"}, {"time": 6933, "text": "And my answer at that moment was like, you know what?"}, {"time": 6937, "text": "I'm actually at this moment in life where I'm not longing for anything."}, {"time": 6941, "text": "I'm at this particular way station where everything is the way I want it to be."}, {"time": 6946, "text": "And of course, the minute you say something like that, you know, you're going to be proven wrong."}]}]