[{"title": "Kai-Fu Lee: AI Superpowers - China and Silicon Valley | Lex Fridman Podcast #27", "id": "cQ48rP_Rs4g", "quotes": [{"time": 467, "text": "So my intuition personally is that data can take us extremely far."}, {"time": 473, "text": "So you brought up autonomous vehicles and medical diagnosis."}, {"time": 476, "text": "So your intuition is that huge amounts of data might not be able to completely help us solve that problem."}, {"time": 484, "text": "Right, so breaking that down further in autonomous vehicle, I think huge amounts of data probably will solve trucks driving on highways, which will deliver a significant value and China will probably lead in that."}, {"time": 498, "text": "And full L5 autonomous is likely to require new technologies we don't yet know."}, {"time": 506, "text": "And that might require academia and great industrial research, both innovating and working together."}, {"time": 512, "text": "And in that case, US has an advantage."}, {"time": 515, "text": "So the interesting question there is, I don't know if you're familiar on the autonomous vehicle space and the developments with Tesla and Elon Musk."}, {"time": 523, "text": "Where they are in fact full steam ahead into this mysterious complex world of full autonomy, L5, L4, L5, and they're trying to solve that purely with data."}, {"time": 538, "text": "So the same kind of thing that you're saying is just for highway, which is what a lot of people share your intuition."}, {"time": 545, "text": "They're trying to solve with data."}, {"time": 547, "text": "So just to linger on that moment further, do you think possible for them to achieve success with simply just a huge amount of this training on edge cases and difficult cases in urban environments, not just highway and so on?"}, {"time": 562, "text": "I think it would be very hard."}, {"time": 564, "text": "One could characterize Tesla's approach as kind of a Chinese strength approach, right?"}, {"time": 569, "text": "Gather all the data you can and hope that will overcome the problems."}, {"time": 574, "text": "But in autonomous driving, clearly a lot of the decisions aren't merely solved by aggregating data and having feedback loop."}, {"time": 583, "text": "There are things that are more akin to human thinking."}, {"time": 588, "text": "And how would those be integrated and built?"}, {"time": 591, "text": "There has not yet been a lot of success integrating human intelligence or call it expert systems if you will, even though that's a taboo word with the machine learning."}, {"time": 602, "text": "And the integration of the two types of thinking hasn't yet been demonstrated."}, {"time": 607, "text": "And the question is how much can you push a purely machine learning approach?"}, {"time": 612, "text": "And of course, Tesla also has an additional constraint that they don't have all the sensors."}, {"time": 618, "text": "I know that they think it's foolish to use LIDARs, but that's clearly a one less very valuable and reliable source of input that they're foregoing, which may also have consequences."}, {"time": 632, "text": "I think the advantage of course is capturing data that no one has ever seen before."}, {"time": 637, "text": "And in some cases such as computer vision and speech recognition, I have seen Chinese companies accumulate data that's not seen anywhere in the Western world and they have delivered superior results."}, {"time": 650, "text": "But then speech recognition and object recognition are relatively suitable problems for deep learning and don't have the potentially need for the human intelligence analytical planning elements."}, {"time": 664, "text": "And the same on the speech recognition side, your intuition that speech recognition and the machine learning approaches to speech recognition won't take us to a conversational system that can pass the Turing test, which is sort of maybe akin to what driving is."}, {"time": 680, "text": "So it needs to have something more than just simply simple language understanding, simple language generation."}, {"time": 687, "text": "Roughly right."}, {"time": 688, "text": "I would say that based on purely machine learning approaches, it's hard to imagine it could lead to a full conversational experience across arbitrary domains, which is akin to L5."}, {"time": 704, "text": "I'm a little hesitant to use the word Turing test because the original definition was probably too easy."}, {"time": 710, "text": "We probably do that, yeah."}, {"time": 712, "text": "The spirit of the Turing test is what I was referring to."}, {"time": 716, "text": "So you've had major leadership research positions at Apple, Microsoft, Google."}, {"time": 721, "text": "So continuing on the discussion of America, Russia, Chinese, Seoul and culture and so on."}, {"time": 729, "text": "What is the culture of Silicon Valley in contrast to China and maybe US broadly?"}, {"time": 736, "text": "And what is the unique culture of each of these three major companies in your view?"}, {"time": 742, "text": "I think in aggregate, Silicon Valley companies, and we could probably include Microsoft in that, even though they're not in the Valley, is really dream big and have visionary goals and believe that technology will conquer all."}, {"time": 757, "text": "And also the self confidence and the self entitlement that whatever they produce, the whole world should use and must use."}, {"time": 767, "text": "And those are historically important, I think."}, {"time": 774, "text": "Steve Jobs famous quote that he doesn't do focus groups, he looks in the mirror and asks the person in the mirror, what do you want?"}, {"time": 783, "text": "And that really is an inspirational comment that says, the great company shouldn't just ask users what they want, but develop something that users will know they want when they see it, but they could never come up with themselves."}, {"time": 798, "text": "I think that is probably the most exhilarating description of what the essence of Silicon Valley is, that this brilliant idea could cause you to build something that couldn't come out of the focus groups or AB tests."}, {"time": 815, "text": "And iPhone would be an example of that."}, {"time": 818, "text": "No one in the age of Blackberry would write down they want an iPhone or multi touch."}, {"time": 822, "text": "A browser might be another example."}, {"time": 824, "text": "No one would say they want that in the days of FTP, but once they see it, they want it."}, {"time": 829, "text": "So I think that is what Silicon Valley is best at."}, {"time": 833, "text": "But it also comes with, it came with a lot of success."}, {"time": 838, "text": "These products became global platforms and there were basically no competitors anywhere."}, {"time": 845, "text": "And that has also led to a belief that these are the only things that one should do, that companies should not tread on other companies territory so that a Groupon and a Yelp and then OpenTable and the Grubhub would each feel, okay, I'm not gonna do the other company's business because that would not be the pride of innovating what each of these four companies have innovated."}, {"time": 876, "text": "But I think the Chinese approach is do whatever it takes to win."}, {"time": 882, "text": "And it's a winner take all market."}, {"time": 885, "text": "And in fact, in the internet space, the market leader will get predominantly all the value extracted out of the system."}, {"time": 893, "text": "So, and the system isn't just defined as one narrow category, but gets broader and broader."}, {"time": 901, "text": "So it's amazing ambition for success and domination of increasingly larger product categories leading to clear market winner status and the opportunity to extract tremendous value."}, {"time": 919, "text": "And that develops a practical, result oriented, ultra ambitious winner take all gladiatorial mentality."}, {"time": 931, "text": "And if what it takes is to build what the competitors built, essentially a copycat that can be done without infringing laws."}, {"time": 941, "text": "If what it takes is to satisfy a foreign country's need by forking the code base and building something that looks really ugly and different, they'll do it."}, {"time": 951, "text": "So it's contrasted very sharply with the Silicon Valley approach."}, {"time": 956, "text": "And I think the flexibility and the speed and execution has helped the Chinese approach."}, {"time": 961, "text": "And I think the Silicon Valley approach is potentially challenged if every Chinese entrepreneur is learning from the whole world, US and China, and the American entrepreneurs only look internally and write off China as a copycat."}, {"time": 979, "text": "And the second part of your question about the three companies."}, {"time": 983, "text": "The unique elements of the three companies perhaps."}, {"time": 986, "text": "Yeah, I think Apple represents while the user please the user and the essence of design and brand and it's the one company and perhaps the only tech company that draws people with a strong, serious desire for the product and the willingness to pay a premium because of the halo effect of the brand which came from the attention to detail and great respect for user needs."}, {"time": 1021, "text": "Microsoft represents a platform approach that builds giant products that become very strong modes that others can't do because it's well architected at the bottom level and the work is efficiently delegated to individuals and then the whole product is built by adding small parts that sum together."}, {"time": 1052, "text": "So it's probably the most effective high tech assembly line that builds a very difficult product that and the whole process of doing that is kind of a differentiation and something competitors can't easily repeat."}, {"time": 1070, "text": "Are there elements of the Chinese approach in the way Microsoft went about assembling those little pieces and dominating, essentially dominating the market for a long time or do you see those as distinct?"}, {"time": 1084, "text": "I think there are elements that are the same."}, {"time": 1086, "text": "I think the three American companies that had or have Chinese characteristics and obviously as well as American characteristics are Microsoft, Facebook and Amazon."}, {"time": 1098, "text": "Yes, that's right, Amazon."}, {"time": 1100, "text": "Because these are companies that will tenaciously go after adjacent markets, build up strong product offering and find ways to extract greater value from a sphere that's ever increasing and they understand the value of the platforms."}, {"time": 1123, "text": "So that's the similarity and then with Google, I think it's a genuinely value oriented company that does have a heart and soul and that wants to do great things for the world by connecting information and that has also very strong technology genes and wants to use technology and has found out of the box ways to use technology to deliver incredible value to the end user."}, {"time": 1163, "text": "If you can look at Google, for example, you mentioned heart and soul."}, {"time": 1168, "text": "There seems to be an element where Google is after making the world better."}, {"time": 1174, "text": "There's a more positive view."}, {"time": 1176, "text": "They used to have the slogan, don't be evil."}, {"time": 1179, "text": "And Facebook a little bit more has a negative tend to it."}, {"time": 1183, "text": "At least in the perception of privacy and so on."}, {"time": 1185, "text": "Do you have a sense of how these different companies can achieve, because you've talked about how much we can make the world better in all these kinds of ways with AI."}, {"time": 1196, "text": "What is it about a company that can make, give it a heart and soul, gain the trust of the public and just actually just not be evil and do good for the world?"}, {"time": 1208, "text": "It's really hard and I think Google has struggled with that."}, {"time": 1213, "text": "First, the don't do evil mantra is very dangerous because every employee's definition of evil is different."}, {"time": 1220, "text": "And that has led to some difficult employee situations for them."}, {"time": 1225, "text": "So I don't necessarily think that's a good value statement, but just watching the kinds of things Google or its parent company Alphabet does in new areas like healthcare, like eradicating mosquitoes, things that are really not in the business of a internet tech company."}, {"time": 1244, "text": "I think that shows that there's a heart and soul and desire to do good and willingness to put in the resources to do something when they see it's good, they will pursue it."}, {"time": 1258, "text": "That doesn't necessarily mean it has all the trust of the users."}, {"time": 1262, "text": "I realize while most people would view Facebook as the primary target of their recent unhappiness about Silicon Valley companies, many would put Google in that category."}, {"time": 1274, "text": "And some have named Google's business practices as predatory also."}, {"time": 1279, "text": "So it's kind of difficult to have the two parts of a body."}, {"time": 1284, "text": "The brain wants to do what it's supposed to do for a shareholder, maximize profit."}, {"time": 1289, "text": "And then the heart and soul wants to do good things that may run against what the brain wants to do."}, {"time": 1296, "text": "So in this complex balancing that these companies have to do, you've mentioned that you're concerned about a future where too few companies like Google, Facebook, Amazon are controlling our data or controlling too much of our digital lives."}, {"time": 1313, "text": "Can you elaborate on this concern and perhaps do you have a better way forward?"}, {"time": 1317, "text": "I think I'm hardly the most vocal complainer of this."}, {"time": 1322, "text": "Sure, of course."}, {"time": 1323, "text": "There are a lot louder complainers out there."}, {"time": 1326, "text": "I do observe that having a lot of data does perpetuate their strength and limits competition in many spaces."}, {"time": 1338, "text": "But I also believe AI is much broader than the internet space."}, {"time": 1343, "text": "So the entrepreneurial opportunities still exists in using AI to empower financial, retail, manufacturing, education applications."}, {"time": 1354, "text": "So I don't think it's quite a case of full monopolistic dominance that totally stifles innovation."}, {"time": 1363, "text": "But I do believe in their areas of strength it's hard to dislodge them."}, {"time": 1368, "text": "I don't know if I have a good solution."}, {"time": 1372, "text": "Probably the best solution is let the entrepreneurial VC ecosystem work well and find all the places that can create the next Google, the next Facebook."}, {"time": 1383, "text": "So there will always be increasing number of challengers."}, {"time": 1387, "text": "In some sense that has happened a little bit."}, {"time": 1390, "text": "You see Uber, Airbnb having emerged despite the strength of the big three."}, {"time": 1399, "text": "And I think China as an environment may be more interesting for the emergence because if you look at companies between let's say 50 to $300 billion, China has emerged more of such companies than the US in the last three to four years because of the larger marketplace, because of the more fearless nature of the entrepreneurs."}, {"time": 1426, "text": "And the Chinese giants are just as powerful as American ones."}, {"time": 1430, "text": "Tencent, Alibaba are very strong, but ByteDance has emerged worth 75 billion and financial while it's Alibaba affiliated, it's nevertheless independent and worth 150 billion."}, {"time": 1443, "text": "And so I do think if we start to extend to traditional businesses, we will see very valuable companies."}, {"time": 1452, "text": "So it's probably not the case that in five or 10 years we'll still see the whole world with these five companies having such dominance."}, {"time": 1462, "text": "So you've mentioned a couple of times this fascinating world of entrepreneurship in China of the fearless nature of the entrepreneur."}, {"time": 1471, "text": "So can you maybe talk a little bit about what it takes to be an entrepreneur in China?"}, {"time": 1475, "text": "What are the strategies that are undertaken?"}, {"time": 1478, "text": "What are the ways to achieve success?"}, {"time": 1481, "text": "What is the dynamic of VCF funding of the way the government helps companies and so on?"}, {"time": 1486, "text": "What are the interesting aspects here that are distinct from, that are different from the Silicon Valley world of entrepreneurship?"}, {"time": 1495, "text": "Well, many of the listeners probably still would brand Chinese entrepreneur as copycats."}, {"time": 1503, "text": "And no doubt 10 years ago, that would not be an inaccurate description."}, {"time": 1509, "text": "Back 10 years ago, an entrepreneur probably could not get funding if he or she could not describe what product he or she is copying from the US."}, {"time": 1520, "text": "The first question is who has proven this business model which is a nice way of asking who are you copying?"}, {"time": 1527, "text": "And that reason is understandable because China had a much lower internet penetration and didn't have enough indigenous experience to build innovative products."}, {"time": 1543, "text": "And secondly, internet was emerging."}, {"time": 1547, "text": "Link startup was the way to do things, building a first minimally viable product and then expanding was the right way to go."}, {"time": 1555, "text": "And the American successes have given a shortcut that if you built your minimally viable product based on an American product, it's guaranteed to be a decent starting point."}, {"time": 1566, "text": "Then you tweak it afterwards."}, {"time": 1568, "text": "So as long as there are no IP infringement, which as far as I know there hasn't been in the mobile and AI spaces, that's a much better shortcut."}, {"time": 1579, "text": "And I think Silicon Valley would view that as still not very honorable because that's not your own idea to start with, but you can't really at the same time believe every idea must be your own and believe in the link startup methodology because link startup is intended to try many, many things and then converge when that works."}, {"time": 1604, "text": "And it's meant to be iterated and changed."}, {"time": 1606, "text": "So finding a decent starting point without legal violations, there should be nothing morally dishonorable about that."}, {"time": 1615, "text": "Yeah, so just a quick pause on that."}, {"time": 1616, "text": "It's fascinating that that's, why is that not honorable, right?"}, {"time": 1621, "text": "It's exactly as you formulated."}, {"time": 1624, "text": "It seems like a perfect start for business."}, {"time": 1627, "text": "Is to take, look at Amazon and say, okay, we'll do exactly what Amazon is doing."}, {"time": 1634, "text": "Let's start there in this particular market and then let's out innovate them from that starting point."}, {"time": 1640, "text": "Come up with new ways."}, {"time": 1642, "text": "I mean, is it wrong to be, except the word copycat just sounds bad, but is it wrong to be a copycat?"}, {"time": 1648, "text": "It just seems like a smart strategy, but yes, it doesn't have a heroic nature to it that like Steve Jobs, Elon Musk, sort of in something completely, coming up with something completely new."}, {"time": 1663, "text": "Yeah, I like the way you describe it."}, {"time": 1665, "text": "It's a nonheroic, acceptable way to start the company and maybe more expedient."}, {"time": 1672, "text": "So that's, I think, a baggage for Silicon Valley that if it doesn't let go, then it may limit the ultimate ceiling of the company."}, {"time": 1685, "text": "Take Snapchat as an example."}, {"time": 1687, "text": "I think, you know, Evan's brilliant."}, {"time": 1689, "text": "He built a great product, but he's very proud that he wants to build his own features, not copy others."}, {"time": 1696, "text": "While Facebook was more willing to copy his features and you see what happens in the competition."}, {"time": 1703, "text": "So I think putting that handcuff on the company would limit its ability to reach the maximum potential."}, {"time": 1711, "text": "So back to the Chinese environment, copying was merely a way to learn from the American masters."}, {"time": 1718, "text": "Just like we, if we learned to play piano or painting, you start by copying."}, {"time": 1724, "text": "You don't start by innovating when you don't have the basic skill sets."}, {"time": 1728, "text": "So very amazingly, the Chinese entrepreneurs about six years ago started to branch off with these lean startups built on American ideas to build better products than American products."}, {"time": 1742, "text": "But they did start from the American idea."}, {"time": 1744, "text": "And today WeChat is better than WhatsApp, Weibo is better than Twitter, Zhihu is better than Quora and so on."}, {"time": 1752, "text": "So that I think is Chinese entrepreneurs going to step two."}, {"time": 1758, "text": "And then step three is once these entrepreneurs have done one or two of these companies, they now look at the Chinese market and the opportunities and come up with ideas that didn't exist elsewhere."}, {"time": 1770, "text": "So products like Ant Financial, under which includes Alipay, which is mobile payments, and also the financial products for loans built on that."}, {"time": 1784, "text": "And also in education, VIPKID, and in social video, social network, TikTok, and in social eCommerce, Pinduoduo, and then in ride sharing, Mobike, these are all Chinese innovated products that now are being copied elsewhere."}, {"time": 1808, "text": "So an additional interesting observation is some of these products are built on unique Chinese demographics, which may not work in the US, but may work very well in Southeast Asia, Africa, and other developing worlds that are a few years behind China."}, {"time": 1827, "text": "And a few of these products maybe are universal and are getting traction even in the United States, such as TikTok."}, {"time": 1835, "text": "So this whole ecosystem is supported by VCs as a virtuous cycle, because a large market with innovative entrepreneurs will draw a lot of money and then invest in these companies."}, {"time": 1851, "text": "As the market gets larger and larger, the China market is easily three, four times larger than the US, they will create greater value and greater returns for the VCs, thereby raising even more money."}, {"time": 1865, "text": "So at Sinovation Ventures, our first fund was 15 million, our last fund was 500 million."}, {"time": 1872, "text": "So it reflects the valuation of the companies and our us going multi stage and things like that."}, {"time": 1879, "text": "It also has government support, but not in the way most Americans would think of it."}, {"time": 1885, "text": "The government actually leaves the entrepreneurial space as a private enterprise, sort of self regulating, and the government would build infrastructures that would around it to make it work better."}, {"time": 1898, "text": "For example, the Mass Entrepreneur Mass Innovation Plan builds 8,000 incubators, so the pipeline is very strong to the VCs."}, {"time": 1907, "text": "For autonomous vehicles, the Chinese government is building smart highways with sensors, smart cities that separate pedestrians from cars that may allow initially an inferior autonomous vehicle company to launch a car without increasing with lower casualty because the roads or the city is smart."}, {"time": 1930, "text": "And the Chinese government at local levels would have these guiding funds acting as LPs, passive LPs to funds."}, {"time": 1938, "text": "And when the fund makes money, part of the money made is given back to the GPs and potentially other LPs to increase everybody's return at the expense of the government's return."}, {"time": 1953, "text": "So that's an interesting incentive that entrusts the task of choosing entrepreneurs to VCs who are better at it than the government by letting some of the profits move that way."}, {"time": 1966, "text": "So this is really fascinating, right?"}, {"time": 1968, "text": "So I look at the Russian government as a case study where, let me put it this way, there's no such government driven large scale support of entrepreneurship."}, {"time": 1980, "text": "And probably the same is true in the United States, but the entrepreneurs themselves kind of find a way."}, {"time": 1987, "text": "So maybe in a form of advice or explanation, how did the Chinese government arrive to be this way so supportive on entrepreneurship to be in this particular way so forward thinking at such a large scale?"}, {"time": 2003, "text": "And also perhaps, how can we copy it in other countries?"}, {"time": 2008, "text": "How can we encourage other governments, like even the United States government, to support infrastructure for autonomous vehicles in that same kind of way, perhaps?"}, {"time": 2016, "text": "Yes, so these techniques are the result of several key things, some of which may be learnable, some of which may be very hard."}, {"time": 2028, "text": "One is just trial and error and watching what everyone else is doing."}, {"time": 2032, "text": "I think it's important to be humble and not feel like you know all the answers."}, {"time": 2036, "text": "The guiding funds idea came from Singapore, which came from Israel."}, {"time": 2041, "text": "And China made a few tweaks and turned it into a, because the Chinese cities and government officials kind of compete with each other because they all want to make their city more successful so they can get the next level in their political career."}, {"time": 2060, "text": "And it's somewhat competitive."}, {"time": 2062, "text": "So the central government made it a bit of a competition."}, {"time": 2065, "text": "Everybody has a budget."}, {"time": 2066, "text": "They can put it on AI or they can put it on bio or they can put it on energy."}, {"time": 2072, "text": "And then whoever gets the results, the city shines, the people are better off, the mayor gets a promotion."}, {"time": 2077, "text": "So the tools is kind of almost like an entrepreneurial environment for local governments to see who can do a better job."}, {"time": 2087, "text": "And also many of them try different experiments."}, {"time": 2092, "text": "Some have given award to very smart researchers."}, {"time": 2098, "text": "Just give them money and hope they'll start a company."}, {"time": 2100, "text": "Some have given money to academic research labs, maybe government research labs to see if they can spin off some companies from the science lab or something like that."}, {"time": 2114, "text": "Some have tried to recruit overseas Chinese to come back and start companies."}, {"time": 2119, "text": "And they've had mixed results."}, {"time": 2121, "text": "The one that worked the best was the guiding funds."}, {"time": 2123, "text": "So it's almost like a lean startup idea where people try different things and what works sticks and everybody copies."}, {"time": 2130, "text": "So now every city has a guiding fund."}, {"time": 2132, "text": "So that's how that came about."}, {"time": 2134, "text": "The autonomous vehicle and the massive spending in highways and smart cities, that's a Chinese way."}, {"time": 2146, "text": "It's about building infrastructure to facilitate."}, {"time": 2149, "text": "It's a clear division of the government's responsibility from the market."}, {"time": 2155, "text": "The market should do everything in a private freeway, but there are things the market can't afford to do like infrastructure."}, {"time": 2164, "text": "So the government always appropriates large amounts of money for infrastructure building."}, {"time": 2171, "text": "This happens with not only autonomous vehicle and AI, but happened with the 3G and 4G."}, {"time": 2180, "text": "You'll find that the Chinese wireless reception is better than the US because massive spending that tries to cover the whole country, whereas in the US it may be a little spotty."}, {"time": 2193, "text": "It's a government driven because I think they view the coverage of cell access and 3G, 4G access to be a governmental infrastructure spending as opposed to capitalistic."}, {"time": 2209, "text": "So that's, of course, the state owned enterprises are also publicly traded, but they also carry a government responsibility to deliver infrastructure to all."}, {"time": 2220, "text": "So it's a different way of thinking that may be very hard to inject into Western countries to say starting tomorrow, bandwidth infrastructure and highways are gonna be governmental spending with some characteristics."}, {"time": 2236, "text": "What's your sense, and sorry to interrupt, but because it's such a fascinating point, do you think on the autonomous vehicle space it's possible to solve the problem of full autonomy without significant investment in infrastructure?"}, {"time": 2254, "text": "Well, that's really hard to speculate."}, {"time": 2256, "text": "I think it's not a yes, no question, but how long does it take question?"}, {"time": 2262, "text": "15 years, 30 years, 45 years."}, {"time": 2265, "text": "Clearly with infrastructure augmentation, whether it's road, the city or whole city planning, building a new city, I'm sure that will accelerate the day of the L5."}, {"time": 2278, "text": "I'm not knowledgeable enough, and it's hard to predict even when we're knowledgeable because a lot of it is speculative."}, {"time": 2287, "text": "But in the US, I don't think people would consider building a new city the size of Chicago to make it the AI slash autonomous city."}, {"time": 2295, "text": "There are smaller ones being built, I'm aware of that."}, {"time": 2298, "text": "But is infrastructure spend really impossible for US or Western countries?"}, {"time": 2305, "text": "The US highway system was built, was that during President Eisenhower or Kennedy?"}, {"time": 2311, "text": "Eisenhower, yeah."}, {"time": 2313, "text": "So maybe historians can study how the President Eisenhower get the resources to build this massive infrastructure that surely gave US a tremendous amount of prosperity over the next decade, if not century."}, {"time": 2330, "text": "If I may comment on that then, it takes us to artificial intelligence a little bit because in order to build infrastructure, it creates a lot of jobs."}, {"time": 2340, "text": "So I'll be actually interested if you would say that you talk in your book about all kinds of jobs that could and could not be automated."}, {"time": 2348, "text": "I wonder if building infrastructure is one of the jobs that would not be easily automated."}, {"time": 2355, "text": "Something you could think about because I think you've mentioned somewhere in the talk or that there might be, as jobs are being automated, a role for government to create jobs that can't be automated."}, {"time": 2368, "text": "Yes, I think that's a possibility."}, {"time": 2371, "text": "Back in the last financial crisis, China put a lot of money to basically give this economy a boost and a lot of it went into infrastructure building."}, {"time": 2385, "text": "And I think that's a legitimate way at the government level to deal with the employment issues as well as build out the infrastructure as long as the infrastructures are truly needed and as long as there is an employment problem, which no, we don't know."}, {"time": 2404, "text": "So maybe taking a little step back, if you've been a leader and a researcher in AI for several decades, at least 30 years, so how has AI changed in the West and the East as you've observed, as you've been deep in it over the past 30 years?"}, {"time": 2425, "text": "Well, AI began as the pursuit of understanding human intelligence and the term itself represents that, but it kind of drifted into the one sub area that worked extremely well, which is machine intelligence."}, {"time": 2440, "text": "And that's actually more using pattern recognition techniques to basically do incredibly well on a limited domain, large amount of data, but relatively simple kinds of planning tasks and not very creative."}, {"time": 2458, "text": "So we didn't end up building human intelligence."}, {"time": 2462, "text": "We built a different machine that was a lot better than us, some problems, but nowhere close to us on other problems."}, {"time": 2471, "text": "So today, I think a lot of people still misunderstand when we say artificial intelligence and what various products can do, people still think it's about replicating human intelligence, but the products out there really are closer to having invented the internet or the spreadsheet or the database and getting broader adoption."}, {"time": 2495, "text": "And speaking further to the fears, near term fears that people have about AI, so you're commenting on the sort of general intelligence that people in the popular culture from sci fi movies have a sense about AI, but there's practical fears about AI, the narrow AI that you're talking about of automating particular kinds of jobs and you talk about them in the book."}, {"time": 2519, "text": "So what are the kinds of jobs in your view that you see in the next five, 10 years beginning to be automated by AI systems algorithms?"}, {"time": 2529, "text": "Yes, this is also maybe a little bit counterintuitive because it's the routine jobs that will be displaced the soonest and they may not be displaced entirely, maybe 50%, 80% of a job, but when the workload drops by that much, employment will come down."}, {"time": 2548, "text": "And also another part of misunderstanding is most people think of AI replacing routine jobs than they think of the assembly line, the workers."}, {"time": 2558, "text": "Well, that will have some effect, but it's actually the routine white collar workers that's easiest to replace because to replace a white collar worker, you just need software."}, {"time": 2570, "text": "To replace a blue collar worker, you need robotics, mechanical excellence, and the ability to deal with dexterity and maybe even unknown environments, very, very difficult."}, {"time": 2585, "text": "So if we were to categorize the most dangerous white collar jobs, they would be things like back office, people who copy and paste and deal with simple computer programs and data and maybe paper and OCR, and they don't make strategic decisions."}, {"time": 2609, "text": "They basically facilitate the process."}, {"time": 2612, "text": "These softwares and paper systems don't work."}, {"time": 2614, "text": "So you have people dealing with new employee orientation, searching for past lawsuits and financial documents, and doing reference check."}, {"time": 2627, "text": "So basic searching and management of data."}, {"time": 2630, "text": "That's the most endangered being lost."}, {"time": 2632, "text": "In addition to the white collar repetitive work, a lot of simple interaction work can also be taken care of such as telesales, telemarketing, customer service, as well as many physical jobs that are in the same location and don't require a high degree of dexterity."}, {"time": 2652, "text": "So fruit picking, dishwashing, assembly line inspection are jobs in that category."}, {"time": 2660, "text": "So altogether, back office is a big part."}, {"time": 2665, "text": "And the blue collar may be smaller initially, but over time, AI will get better."}, {"time": 2672, "text": "And when we start to get to over the next 15, 20 years, the ability to actually have the dexterity of doing assembly line, that's a huge chunk of jobs."}, {"time": 2682, "text": "And when autonomous vehicles start to work, initially starting with truck drivers, but eventually to all drivers, that's another huge group of workers."}, {"time": 2692, "text": "So I see modest numbers in the next five years, but increasing rapidly after that."}, {"time": 2698, "text": "On the worry of the jobs that are in danger and the gradual loss of jobs, I'm not sure if you're familiar with Andrew Yang."}, {"time": 2706, "text": "Yes, I am."}, {"time": 2707, "text": "So there's a candidate for president of the United States whose platform Andrew Yang is based around, in part around job loss due to automation."}, {"time": 2717, "text": "And also in addition, the need perhaps of universal basic income to support jobs that are, folks who lose their job due to automation and so on."}, {"time": 2728, "text": "And in general, support people under complex, unstable job market."}, {"time": 2734, "text": "So what are your thoughts about his concerns, him as a candidate, his ideas in general?"}, {"time": 2740, "text": "I think his thinking is generally in the right direction, but his approach as a presidential candidate may be a little bit ahead of the time."}, {"time": 2751, "text": "And I think the displacements will happen, but will they happen soon enough for people to agree to vote for him?"}, {"time": 2760, "text": "The unemployment numbers are not very high yet."}, {"time": 2763, "text": "And I think he and I have the same challenge."}, {"time": 2767, "text": "If I want to theoretically convince people this is an issue and he wants to become the president, people have to see how can this be the case when unemployment numbers are low."}, {"time": 2779, "text": "So that is the challenge."}, {"time": 2781, "text": "And I think I do agree with him on the displacement issue, on universal basic income."}, {"time": 2790, "text": "At a very vanilla level, I don't agree with it because I think the main issue is retraining."}, {"time": 2798, "text": "So people need to be incented not by just giving a monthly $2,000 check or $1,000 check and do whatever they want because they don't have the know how to know what to retrain to go into what type of a job."}, {"time": 2816, "text": "And guidance is needed."}, {"time": 2818, "text": "And retraining is needed because historically when technology revolutions, when routine jobs were displaced, new routine jobs came up."}, {"time": 2826, "text": "So there was always room for that."}, {"time": 2829, "text": "But with AI and automation, the whole point is replacing all routine jobs eventually."}, {"time": 2835, "text": "So there will be fewer and fewer routine jobs."}, {"time": 2837, "text": "And AI will create jobs, but it won't create routine jobs because if it creates routine jobs, why wouldn't AI just do it?"}, {"time": 2846, "text": "So therefore the people who are losing the jobs are losing routine jobs."}, {"time": 2852, "text": "The jobs that are becoming available are non routine jobs."}, {"time": 2855, "text": "So the social stipend needs to be put in place is for the routine workers who lost their jobs to be retrained maybe in six months, maybe in three years, takes a while to retrain on the non routine job and then take on a job that will last for that person's lifetime."}, {"time": 2873, "text": "Now, having said that, if you look deeply into Andrew's document, he does cater for that."}, {"time": 2878, "text": "So I'm not disagreeing with what he's trying to do."}, {"time": 2883, "text": "But for simplification, sometimes he just says UBI, but simple UBI wouldn't work."}, {"time": 2888, "text": "And I think you've mentioned elsewhere that the goal isn't necessarily to give people enough money to survive or live, or even to prosper."}, {"time": 2899, "text": "The point is to give them a job that gives them meaning."}, {"time": 2902, "text": "That meaning is extremely important."}, {"time": 2905, "text": "That our employment, at least in the United States and perhaps it carries across the world, provides something that's, forgive me for saying, greater than money."}, {"time": 2915, "text": "It provides meaning."}, {"time": 2916, "text": "So now, what kind of jobs do you think can't be automated?"}, {"time": 2923, "text": "Can you talk a little bit about creativity and compassion in your book?"}, {"time": 2926, "text": "What aspects do you think it's difficult to automate for an AI system?"}, {"time": 2931, "text": "Because an AI system is currently merely optimizing."}, {"time": 2936, "text": "It's not able to reason, plan, or think creatively or strategically."}, {"time": 2942, "text": "It's not able to deal with complex problems."}, {"time": 2944, "text": "It can't come up with a new problem and solve it."}, {"time": 2948, "text": "A human needs to find the problem and pose it as an optimization problem, then have the AI work at it."}, {"time": 2956, "text": "So an AI would have a very hard time discovering a new drug or discovering a new style of painting or dealing with complex tasks such as managing a company that isn't just about optimizing the bottom line, but also about employee satisfaction, corporate brand, and many, many other things."}, {"time": 2979, "text": "So that is one category of things."}, {"time": 2983, "text": "And because these things are challenging, creative, complex, doing them creates a high degree of satisfaction and therefore appealing to our desire for working, which isn't just to make the money, make the ends meet, but also that we've accomplished something that others maybe can't do or can't do as well."}, {"time": 3003, "text": "Another type of job that is much numerous would be compassionate jobs, jobs that require compassion, empathy, human touch, human trust."}, {"time": 3013, "text": "AI can't do that because AI is cold, calculating, and even if it can fake that to some extent, it will make errors and that will make it look very silly."}, {"time": 3025, "text": "And also, I think even if AI did okay, people would want to interact with another person, whether it's for some kind of a service or a teacher or a doctor or a concierge or a masseuse or a bartender."}, {"time": 3040, "text": "There are so many jobs where people just don't want to interact with a cold robot or software."}, {"time": 3049, "text": "I've had an entrepreneur who built an elderly care robot and they found that the elderly really only use it for customer service."}, {"time": 3056, "text": "And not, but not to service the product, but they click on customer service and the video of a person comes up and then the person says, how come my daughter didn't call me?"}, {"time": 3068, "text": "Let me show you a picture of her grandkids."}, {"time": 3070, "text": "So people yearn for that people, people interaction."}, {"time": 3074, "text": "So even if robots improved, people just don't want it."}, {"time": 3077, "text": "And those jobs are going to be increasing because AI will create a lot of value, $16 trillion to the world in the next 10 years."}, {"time": 3086, "text": "Next 11 years, according to PWC."}, {"time": 3089, "text": "And that will give people money to enjoy services, whether it's eating a gourmet meal or tourism and traveling or having concierge services, the services revolving around every dollar of that $16 trillion will be tremendous."}, {"time": 3108, "text": "It will create more opportunities that are to service the people who did well through AI with things."}, {"time": 3116, "text": "But even at the same time, the entire society is very much short in need of many service oriented, compassionate oriented jobs."}, {"time": 3126, "text": "The best example is probably in healthcare services."}, {"time": 3130, "text": "There's going to be 2 million new jobs, not counting replacement, just brand new incremental jobs in the next six years in healthcare services."}, {"time": 3140, "text": "That includes nurses, orderly in the hospital, elderly care and also at home care is particularly lacking."}, {"time": 3151, "text": "And those jobs are not likely to be filled."}, {"time": 3154, "text": "So there's likely to be a shortage."}, {"time": 3156, "text": "And the reason they're not filled is simply because they don't pay very well and that the social status of these jobs are not very good."}, {"time": 3167, "text": "So they pay about half as much as a heavy equipment operator, which will be replaced a lot sooner."}, {"time": 3175, "text": "And they pay probably comparably to someone on the assembly line."}, {"time": 3179, "text": "And so if we ignoring all the other issues and just think about satisfaction from one's job, someone repetitively doing the same manual action at an assembly line, that can't create a lot of job satisfaction, but someone taking care of a sick person and getting a hug and thank you from that person and the family, I think is quite satisfying."}, {"time": 3204, "text": "So if only we could fix the pay for service jobs, there are plenty of jobs that require some training or a lot of training for the people coming off the routine jobs to take."}, {"time": 3216, "text": "We can easily imagine someone who was maybe a cashier at the grocery store as stores become automated, learns to become a nurse or an at home care."}, {"time": 3229, "text": "I also do want to point out the blue collar jobs are going to stay around a bit longer."}, {"time": 3234, "text": "Some of them quite a bit longer."}, {"time": 3238, "text": "AI cannot be told go clean an arbitrary home."}, {"time": 3242, "text": "That's incredibly hard."}, {"time": 3243, "text": "Arguably it's an L5 level of difficulty, right?"}, {"time": 3247, "text": "And then AI cannot be a good plumber because plumber is almost like a mini detective that has to figure out where the leak came from."}, {"time": 3255, "text": "So yet AI probably can be an assembly line and auto mechanic and so on."}, {"time": 3262, "text": "So one has to study which blue collar jobs are going away and facilitate retraining for the people to go into the ones that won't go away or maybe even will increase."}, {"time": 3272, "text": "I mean, it is fascinating that it's easier to build a world champion chess player than it is to build a mediocre plumber."}, {"time": 3284, "text": "And to AI and that goes counterintuitive to a lot of people's understanding of what artificial intelligence is."}, {"time": 3290, "text": "So it sounds, I mean, you're painting a pretty optimistic picture about retraining about the number of jobs and actually the meaningful nature of those jobs once we automate the repetitive tasks."}, {"time": 3302, "text": "So overall, are you optimistic about the future where much of the repetitive tasks are automated?"}, {"time": 3311, "text": "That there is a lot of room for humans for the compassionate, for the creative input that only humans can provide?"}, {"time": 3320, "text": "I am optimistic if we start to take action."}, {"time": 3323, "text": "If we have no action in the next five years, I think it's going to be hard to deal with the devastating losses that will emerge."}, {"time": 3334, "text": "So if we start thinking about retraining, maybe with the low hanging fruits, explaining to vocational schools why they should train more plumbers than auto mechanics, maybe starting with some government subsidy for corporations to have more training positions."}, {"time": 3353, "text": "We start to explain to people why retraining is important."}, {"time": 3358, "text": "We start to think about what the future of education, how that needs to be tweaked for the era of AI."}, {"time": 3364, "text": "If we start to make incremental progress and the greater number of people understand, then there's no reason to think we can't deal with this because this technological revolution is arguably similar to what electricity, industrial revolutions, and internet brought about."}, {"time": 3380, "text": "Do you think there's a role for policy, for governments to step in, to help with policy to create a better world?"}, {"time": 3388, "text": "Absolutely, and the governments don't have to believe an employment will go up, and they don't have to believe automation will be this fast to do something."}, {"time": 3399, "text": "Revamping vocational school would be one example."}, {"time": 3402, "text": "Another is if there's a big gap in healthcare service employment, and we know that a country's population is growing older, more longevity, living older, because people over 80 require five times as much care as those under 80, then it is a good time to incent training programs for elderly care to find ways to improve the pay."}, {"time": 3427, "text": "Maybe one way would be to offer as part of Medicare or the equivalent program for people over 80 to be entitled to a few hours of elderly care at home, and then that might be reimbursable, and that will stimulate the service industry around the policy."}, {"time": 3448, "text": "Do you have concerns about large entities, whether it's governments or companies, controlling the future of AI development in general?"}, {"time": 3459, "text": "So we talked about companies."}, {"time": 3461, "text": "Do you have a better sense that governments can better represent the interests of the people than companies, or do you believe companies are better at representing the interests of the people?"}, {"time": 3474, "text": "Or is there no easy answer?"}, {"time": 3476, "text": "I don't think there's an easy answer because it's a double edged sword."}, {"time": 3480, "text": "The companies and governments can provide better services with more access to data and more access to AI, but that also leads to greater power, which can lead to uncontrollable problems, whether it's monopoly or corruption in the government."}, {"time": 3497, "text": "So I think one has to be careful to look at how much data that companies and governments have and some kind of checks and balances would be helpful."}, {"time": 3510, "text": "So again, I come from Russia."}, {"time": 3514, "text": "There's something called the Cold War."}, {"time": 3516, "text": "So let me ask a difficult question here looking at conflict."}, {"time": 3520, "text": "Steven Pinker written a great book that conflict all over the world is decreasing in general."}, {"time": 3525, "text": "But do you have a sense that having written the book AI Superpowers, do you see a major international conflict potentially arising between major nations, whatever they are, whether it's Russia, China, European nations, United States or others in the next 10, 20, 50 years around AI, around the digital space, cyberspace?"}, {"time": 3550, "text": "Do you worry about that?"}, {"time": 3552, "text": "Is that something we need to think about and try to alleviate or prevent?"}, {"time": 3559, "text": "I believe in greater engagement."}, {"time": 3562, "text": "A lot of the worries about more powerful AI are based on a arms race metaphor."}, {"time": 3573, "text": "And when you extrapolate into military kinds of scenarios, AI can automate and autonomous weapons that needs to be controlled somehow and autonomous decision making can lead to not enough time to fix international crises."}, {"time": 3597, "text": "So I actually believe a Cold War mentality would be very dangerous because should two countries rely on AI to make certain decisions and they don't even talk to each other, they do their own scenario planning, then something could easily go wrong."}, {"time": 3615, "text": "I think engagement, interaction, some protocols to avoid inadvertent disasters is actually needed."}, {"time": 3625, "text": "So it's natural for each country to want to be the best, whether it's in nuclear technologies or AI or bio."}, {"time": 3634, "text": "But I think it's important to realize if each country has a black box AI and don't talk to each other, that probably presents greater challenges to humanity than if they interacted."}, {"time": 3651, "text": "I think there can still be competition, but with some degree of protocol for interaction, just like when there was a nuclear competition, there were some protocol for deterrence among US, Russia, and China."}, {"time": 3668, "text": "And I think that engagement is needed."}, {"time": 3670, "text": "So of course, we're still far from AI presenting that kind of danger."}, {"time": 3676, "text": "But what I worry the most about is the level of engagement seems to be coming down."}, {"time": 3683, "text": "The level of distrust seems to be going up, especially from the US towards other large countries such as China and of course, and Russia, yes."}, {"time": 3693, "text": "Is there a way to make that better?"}, {"time": 3694, "text": "So let's beautifully put level of engagement and even just basic trust and communication as opposed to sort of making artificial enemies out of particular countries."}, {"time": 3713, "text": "Do you have a sense how we can make it better?"}, {"time": 3717, "text": "Actionable items that as a society we can take on?"}, {"time": 3721, "text": "I'm not an expert at geopolitics, but I would say that we look pretty foolish as humankind when we are faced with the opportunity to create $16 trillion for humanity, and yet we're not solving fundamental problems with parts of the world still in poverty."}, {"time": 3749, "text": "And for the first time, we have the resources to overcome poverty and hunger."}, {"time": 3754, "text": "We're not using it on that, but we're fueling competition among superpowers."}, {"time": 3758, "text": "And that's a very unfortunate thing."}, {"time": 3761, "text": "If we become utopian for a moment, imagine a benevolent world government that has this $16 trillion and maybe some AI to figure out how to use it to deal with diseases and problems and hate and things like that."}, {"time": 3782, "text": "World would be a lot better off."}, {"time": 3784, "text": "So what is wrong with the current world?"}, {"time": 3787, "text": "I think the people with more skill than I should think about this."}, {"time": 3793, "text": "And then the geopolitics issue with superpower competition is one side of the issue."}, {"time": 3799, "text": "There's another side which I worry maybe even more, which is as the $16 trillion all gets made by US and China and a few of the other developed countries, the poorer country will get nothing because they don't have technology and the wealth disparity and inequality will increase."}, {"time": 3822, "text": "So a poorer country with a large population will not only benefit from the AI boom or other technology booms, but they will have their workers who previously had hoped they could do the China model and do outsource manufacturing or the India model so they could do the outsource process or call center."}, {"time": 3842, "text": "Well, all those jobs are gonna be gone in 10 or 15 years."}, {"time": 3845, "text": "So the individual citizen may be a net liability, I mean, financially speaking to a poorer country and not an asset to claw itself out of poverty."}, {"time": 3859, "text": "So in that kind of situation, these large countries with not much tech are going to be facing a downward spiral and it's unclear what could be done."}, {"time": 3873, "text": "And then when we look back and say there's $16 trillion being created and it's all being kept by US, China and other developed countries, it just doesn't feel right."}, {"time": 3883, "text": "So I hope people who know about geopolitics can find solutions that's beyond my expertise."}, {"time": 3890, "text": "So different countries that we've talked about have different value systems."}, {"time": 3895, "text": "If you look at the United States, to an almost extreme degree, there is an absolute desire for freedom of speech."}, {"time": 3903, "text": "If you look at a country where I was raised, that desire just amongst the people is not as elevated as it is to basically fundamental level to the essence of what it means to be America, right?"}, {"time": 3917, "text": "And the same is true with China, there's different value systems."}, {"time": 3921, "text": "There's some censorship of internet content that China and Russia and many other countries undertake."}, {"time": 3931, "text": "Do you see that having effects on innovation, other aspects of some of the tech stuff, AI development we talked about, and maybe from another angle, do you see that changing in different ways over the next 10 years, 20 years, 50 years as China continues to grow as it does now in its tech innovation?"}, {"time": 3955, "text": "There's a common belief that full freedom of speech and expression is correlated with creativity, which is correlated with entrepreneurial success."}, {"time": 3968, "text": "I think empirically we have seen that is not true and China has been successful."}, {"time": 3975, "text": "That's not to say the fundamental values are not right or not the best, but it's just that perfect correlation isn't there."}, {"time": 3985, "text": "It's hard to read the tea leaves on opening up or not in any country, and I've not been very good at that in my past predictions, but I do believe every country shares a lot of fundamental values for the longterm."}, {"time": 4007, "text": "So China is drafting its privacy policy for individual citizens, and they don't look that different from the American or European ones."}, {"time": 4023, "text": "So people do want to protect their privacy and have the opportunity to express and I think the fundamental values are there."}, {"time": 4034, "text": "The question is in the execution and timing, how soon or when will that start to open up?"}, {"time": 4041, "text": "So as long as each government knows ultimately people want that kind of protection, there should be a plan to move towards that as to when or how and I'm not an expert."}, {"time": 4056, "text": "On the point of privacy to me, it's really interesting."}, {"time": 4059, "text": "So AI needs data to create a personalized awesome experience, right?"}, {"time": 4065, "text": "I'm just speaking generally in terms of products."}, {"time": 4068, "text": "And then we have currently, depending on the age and depending on the demographics of who we're talking about, some people are more or less concerned about the amount of data they hand over."}, {"time": 4079, "text": "So in your view, how do we get this balance right that we provide an amazing experience to people that use products?"}, {"time": 4089, "text": "You look at Facebook, the more Facebook knows about you, yes, it's scary to say, the better it can probably, better experience it can probably create."}, {"time": 4101, "text": "So in your view, how do we get that balance right?"}, {"time": 4105, "text": "Yes, I think a lot of people have a misunderstanding that it's okay and possible to just rip all the data out from a provider and give it back to you."}, {"time": 4118, "text": "So you can deny them access to further data and still enjoy the services we have."}, {"time": 4124, "text": "If we take back all the data, all the services will give us nonsense."}, {"time": 4128, "text": "We'll no longer be able to use products that function well in terms of right ranking, right products, right user experience."}, {"time": 4137, "text": "So yet I do understand we don't want to permit misuse of the data from legal policy standpoint."}, {"time": 4147, "text": "I think there can be severe punishment for those who have egregious misuse of the data."}, {"time": 4156, "text": "That's I think a good first step."}, {"time": 4159, "text": "Actually China in this side on this aspect has very strong laws about people who sell or give data to other companies."}, {"time": 4167, "text": "And that over the past few years, since that law came into effect, pretty much eradicated the illegal distribution, sharing of data."}, {"time": 4180, "text": "Additionally, I think giving, I think technology is often a very good way to solve technology misuse."}, {"time": 4192, "text": "So can we come up with new technologies that will let us have our cake and eat it too?"}, {"time": 4198, "text": "People are looking into homomorphic encryption, which is letting you keep the data, have it encrypted and train on encrypted data."}, {"time": 4207, "text": "Of course, we haven't solved that one yet, but that kind of direction may be worth pursuing."}, {"time": 4213, "text": "Also federated learning, which would allow one hospital to train on its hospital's patient data fully because they have a license for that."}, {"time": 4222, "text": "And then hospitals would then share their models, not data, but models to create a super AI."}, {"time": 4228, "text": "And that also maybe has some promise."}, {"time": 4230, "text": "So I would want to encourage us to be open minded and think of this as not just the policy binary, yes, no, but letting the technologists try to find solutions to let us have our cake and eat it too, or have most of our cake and eat most of it too."}, {"time": 4248, "text": "Finally, I think giving each end user a choice is important and having transparency is important."}, {"time": 4255, "text": "Also, I think that's universal, but the choice you give to the user should not be at a granular level that the user cannot understand."}, {"time": 4264, "text": "GDPR today causes all these popups of yes, no, will you give this site this right to use this part of your data?"}, {"time": 4272, "text": "I don't think any user understands what they're saying yes or no to."}, {"time": 4277, "text": "And I suspect most are just saying yes because they don't understand it."}, {"time": 4280, "text": "So while GDPR in its current implementation has lived up to its promise of transparency and user choice, it implemented it in such a way that really didn't deliver the spirit of GDPR."}, {"time": 4299, "text": "It fit the letter, but not the spirit."}, {"time": 4301, "text": "So again, I think we need to think about is there a way to fit the spirit of GDPR by using some kind of technology?"}, {"time": 4310, "text": "Can we have a slider that's an AI trying to figure out how much you want to slide between perfect protection security of your personal data versus a high degree of convenience with some risks of not having full privacy?"}, {"time": 4328, "text": "Each user should have some preference and that gives you the user choice."}, {"time": 4332, "text": "But maybe we should turn the problem on its head and ask can there be an AI algorithm that can customize this?"}, {"time": 4338, "text": "Because we can understand the slider, but we sure cannot understand every popup question."}, {"time": 4345, "text": "And I think getting that right requires getting the balance between what we talked about earlier, which is heart and soul versus profit driven decisions and strategy."}, {"time": 4357, "text": "I think from my perspective, the best way to make a lot of money in the long term is to keep your heart and soul intact."}, {"time": 4366, "text": "I think getting that slider right in the short term may feel like you'll be sacrificing profit, but in the long term, you'll be gaining user trust and providing a great experience."}, {"time": 4379, "text": "Do you share that kind of view in general?"}, {"time": 4383, "text": "I sure would hope there is a way we can do long term projects that really do the right thing."}, {"time": 4392, "text": "I think a lot of people who embrace GDPR, their heart's in the right place."}, {"time": 4396, "text": "I think they just need to figure out how to build a solution."}, {"time": 4400, "text": "I've heard utopians talk about solutions that get me excited, but I'm not sure how in the current funding environment they can get started."}, {"time": 4409, "text": "People talk about, imagine this crowdsourced data collection that we all trust."}, {"time": 4417, "text": "And then we have these agents that we ask the trusted agent to... That agent only, that platform, so a trusted joint platform that we all believe is trustworthy, that can give us all the closed loop personal suggestions by the new social network, new search engine, new eCommerce engine that has access to even more of our data, but not directly, but indirectly."}, {"time": 4452, "text": "So I think that general concept of licensing to some trusted engine and finding a way to trust that engine seems like a great idea."}, {"time": 4462, "text": "But if you think how long it's gonna take to implement and tweak and develop it right, as well as to collect all the trusts and the data from the people, it's beyond the current cycle of venture capital."}, {"time": 4474, "text": "So how do you do that is a big question."}, {"time": 4478, "text": "You've recently had a fight with cancer, stage four lymphoma and in a sort of deep personal level, what did it feel like in the darker moments to face your own mortality?"}, {"time": 4494, "text": "Well, I've been the workaholic my whole life and I've basically worked nine, nine, six, nine a.m. to nine p.m. six days a week, roughly."}, {"time": 4504, "text": "And I didn't really pay a lot of attention to my family, friends, and people who loved me."}, {"time": 4510, "text": "And my life revolved around optimizing for work."}, {"time": 4514, "text": "While my work was not routine, my optimization really what made my life basically very mechanical process."}, {"time": 4525, "text": "But I got a lot of highs out of it because of accomplishments that I thought were really important and dear and the highest priority to me."}, {"time": 4536, "text": "But when I faced mortality and the possible death in matter of months, I suddenly realized that this really meant nothing to me, that I didn't feel like working for another minute, that if I had six months left in my life, I would spend it all with my loved ones and thanking them, giving them love back and apologizing to them that I lived my life the wrong way."}, {"time": 4561, "text": "So that moment of reckoning caused me to really rethink that why we exist in this world is something that we might be too much shaped by the society to think that success and accomplishments is why we live."}, {"time": 4582, "text": "But while that can get you periodic successes and satisfaction, it's really in the facing death you see what's truly important to you."}, {"time": 4595, "text": "So as a result of going through the challenges with cancer, I've resolved to live a more balanced lifestyle."}, {"time": 4605, "text": "I'm now in remission, knock on wood, and I'm spending more time with my family."}, {"time": 4612, "text": "My wife travels with me."}, {"time": 4614, "text": "When my kids need me, I spend more time with them."}, {"time": 4618, "text": "And before I used to prioritize everything around work."}, {"time": 4622, "text": "When I had a little bit of time, I would dole it out to my family."}, {"time": 4626, "text": "Now, when my family needs something, really needs something, I drop everything at work and go to them."}, {"time": 4632, "text": "And then in the time remaining, I allocate to work."}, {"time": 4635, "text": "But one's family is very understanding."}, {"time": 4639, "text": "It's not like they will take 50 hours a week from me."}, {"time": 4643, "text": "So I'm actually able to still work pretty hard, maybe 10 hours less per week."}, {"time": 4649, "text": "So I realized the most important thing in my life is really love and the people I love."}, {"time": 4656, "text": "And I give that the highest priority."}, {"time": 4658, "text": "It isn't the only thing I do, but when that is needed, I put that at the top priority and I feel much better and I feel much more balanced."}, {"time": 4670, "text": "And I think this also gives a hint as to a life of routine work, a life of pursuit of numbers."}, {"time": 4678, "text": "While my job was not routine, it was in pursuit of numbers, pursuit of can I make more money?"}, {"time": 4684, "text": "Can I fund more great companies?"}, {"time": 4687, "text": "Can I raise more money?"}, {"time": 4688, "text": "Can I make sure our VC is ranked higher and higher every year?"}, {"time": 4693, "text": "This competitive nature of driving for bigger numbers and better numbers became a endless pursuit that's mechanical."}, {"time": 4706, "text": "And bigger numbers really didn't make me happier."}, {"time": 4711, "text": "And faced with death, I realized bigger numbers really meant nothing."}, {"time": 4716, "text": "And what was important is that people who have given their heart and their love to me deserve for me to do the same."}, {"time": 4725, "text": "So there's deep, profound truth in that, that everyone should hear and internalize."}, {"time": 4732, "text": "I mean, that's really powerful for you to say that."}, {"time": 4735, "text": "I have to ask sort of a difficult question here."}, {"time": 4743, "text": "So I've competed in sports my whole life, looking historically, I'd like to challenge some aspect of that a little bit on the point of hard work."}, {"time": 4755, "text": "That it feels that there are certain aspects that is the greatest, the most beautiful aspects of human nature is the ability to become obsessed, of becoming extremely passionate to the point where yes, flaws are revealed and just giving yourself fully to a task."}]}]