[{"title": "Chris Urmson: Self-Driving Cars at Aurora, Google, CMU, and DARPA | Lex Fridman Podcast #28", "id": "Tj6NOfdfa4o", "quotes": [{"time": 312, "text": "So the legend, Red, was kind of leading that effort in terms of just broadly speaking."}, {"time": 319, "text": "So you're a leader now."}, {"time": 322, "text": "What have you learned from Red about leadership?"}, {"time": 325, "text": "I think there's a couple things."}, {"time": 326, "text": "One is go and try those really hard things."}, {"time": 331, "text": "That's where there is an incredible opportunity."}, {"time": 334, "text": "I think the other big one, though, is to see people for who they can be, not who they are."}, {"time": 341, "text": "It's one of the things that I actually, one of the deepest lessons I learned from Red was that he would look at undergraduates or graduate students and empower them to be leaders, to have responsibility, to do great things that I think another person might look at them and think, oh, well, that's just an undergraduate student."}, {"time": 366, "text": "What could they know?"}, {"time": 368, "text": "And so I think that kind of trust but verify, have confidence in what people can become, I think is a really powerful thing."}, {"time": 376, "text": "So through that, let's just fast forward through the history."}, {"time": 380, "text": "Can you maybe talk through the technical evolution of autonomous vehicle systems from the first two Grand Challenges to the Urban Challenge to today, are there major shifts in your mind or is it the same kind of technology just made more robust?"}, {"time": 397, "text": "I think there's been some big, big steps."}, {"time": 400, "text": "So for the Grand Challenge, the real technology that unlocked that was HD mapping."}, {"time": 411, "text": "Prior to that, a lot of the off road robotics work had been done without any real prior model of what the vehicle was going to encounter."}, {"time": 421, "text": "And so that innovation that the fact that we could get decimeter resolution models was really a big deal."}, {"time": 433, "text": "And that allowed us to kind of bound the complexity of the driving problem the vehicle had and allowed it to operate at speed because we could assume things about the environment that it was going to encounter."}, {"time": 445, "text": "So that was the big step there."}, {"time": 451, "text": "For the Urban Challenge, one of the big technological innovations there was the multi beam LIDAR and being able to generate high resolution, mid to long range 3D models of the world and use that for understanding the world around the vehicle."}, {"time": 473, "text": "And that was really kind of a game changing technology."}, {"time": 478, "text": "In parallel with that, we saw a bunch of other technologies that had been kind of converging half their day in the sun."}, {"time": 488, "text": "So Bayesian estimation had been, SLAM had been a big field in robotics."}, {"time": 497, "text": "You would go to a conference a couple of years before that and every paper would effectively have SLAM somewhere in it."}, {"time": 504, "text": "And so seeing that the Bayesian estimation techniques play out on a very visible stage, I thought that was pretty exciting to see."}, {"time": 518, "text": "And mostly SLAM was done based on LIDAR at that time."}, {"time": 521, "text": "Yeah, and in fact, we weren't really doing SLAM per se in real time because we had a model ahead of time, we had a roadmap, but we were doing localization."}, {"time": 531, "text": "And we were using the LIDAR or the cameras depending on who exactly was doing it to localize to a model of the world."}, {"time": 537, "text": "And I thought that was a big step from kind of naively trusting GPS, INS before that."}, {"time": 546, "text": "And again, lots of work had been going on in this field."}, {"time": 549, "text": "Certainly this was not doing anything particularly innovative in SLAM or in localization, but it was seeing that technology necessary in a real application on a big stage, I thought was very cool."}, {"time": 563, "text": "So for the urban challenge, those are already maps constructed offline in general."}, {"time": 568, "text": "And did people do that individually, did individual teams do it individually so they had their own different approaches there or did everybody kind of share that information at least intuitively?"}, {"time": 582, "text": "So DARPA gave all the teams a model of the world, a map."}, {"time": 589, "text": "And then one of the things that we had to figure out back then was, and it's still one of these things that trips people up today is actually the coordinate system."}, {"time": 600, "text": "So you get a latitude longitude and to so many decimal places, you don't really care about kind of the ellipsoid of the earth that's being used."}, {"time": 609, "text": "But when you want to get to 10 centimeter or centimeter resolution, you care whether the coordinate system is NADS 83 or WGS 84 or these are different ways to describe both the kind of non sphericalness of the earth, but also kind of the, I think, I can't remember which one, the tectonic shifts that are happening and how to transform the global datum as a function of that."}, {"time": 637, "text": "So getting a map and then actually matching it to reality to centimeter resolution, that was kind of interesting and fun back then."}, {"time": 644, "text": "So how much work was the perception doing there?"}, {"time": 646, "text": "So how much were you relying on localization based on maps without using perception to register to the maps?"}, {"time": 655, "text": "And I guess the question is how advanced was perception at that point?"}, {"time": 659, "text": "It's certainly behind where we are today, right?"}, {"time": 661, "text": "We're more than a decade since the urban challenge."}, {"time": 665, "text": "But the core of it was there."}, {"time": 668, "text": "That we were tracking vehicles."}, {"time": 673, "text": "We had to do that at 100 plus meter range because we had to merge with other traffic."}, {"time": 678, "text": "We were using, again, Bayesian estimates for state of these vehicles."}, {"time": 683, "text": "We had to deal with a bunch of the problems that you think of today, of predicting where that vehicle's going to be a few seconds into the future."}, {"time": 691, "text": "We had to deal with the fact that there were multiple hypotheses for that because a vehicle at an intersection might be going right or it might be going straight or it might be making a left turn."}, {"time": 701, "text": "And we had to deal with the challenge of the fact that our behavior was going to impact the behavior of that other operator."}, {"time": 708, "text": "And we did a lot of that in relatively naive ways, but it kind of worked."}, {"time": 714, "text": "Still had to have some kind of solution."}, {"time": 717, "text": "And so where does that, 10 years later, where does that take us today from that artificial city construction to real cities to the urban environment?"}, {"time": 727, "text": "Yeah, I think the biggest thing is that the actors are truly unpredictable."}, {"time": 735, "text": "That most of the time, the drivers on the road, the other road users are out there behaving well, but every once in a while they're not."}, {"time": 747, "text": "The variety of other vehicles is, you have all of them."}, {"time": 752, "text": "In terms of behavior, in terms of perception, or both?"}, {"time": 758, "text": "Back then we didn't have to deal with cyclists, we didn't have to deal with pedestrians, didn't have to deal with traffic lights."}, {"time": 766, "text": "The scale over which that you have to operate is now is much larger than the air base that we were thinking about back then."}, {"time": 772, "text": "So what, easy question, what do you think is the hardest part about driving?"}, {"time": 779, "text": "Easy question."}, {"time": 780, "text": "Yeah, no, I'm joking."}, {"time": 782, "text": "I'm sure nothing really jumps out at you as one thing, but in the jump from the urban challenge to the real world, is there something that's a particular, you foresee as very serious, difficult challenge?"}, {"time": 798, "text": "I think the most fundamental difference is that we're doing it for real."}, {"time": 806, "text": "That in that environment, it was both a limited complexity environment because certain actors weren't there, because the roads were maintained, there were barriers keeping people separate from robots at the time, and it only had to work for 60 miles."}, {"time": 823, "text": "Which, looking at it from 2006, it had to work for 60 miles, right?"}, {"time": 828, "text": "Looking at it from now, we want things that will go and drive for half a million miles, and it's just a different game."}, {"time": 840, "text": "So how important, you said LiDAR came into the game early on, and it's really the primary driver of autonomous vehicles today as a sensor."}, {"time": 850, "text": "So how important is the role of LiDAR in the sensor suite in the near term?"}, {"time": 854, "text": "So I think it's essential."}, {"time": 857, "text": "I believe, but I also believe that cameras are essential, and I believe the radar is essential."}, {"time": 862, "text": "I think that you really need to use the composition of data from these different sensors if you want the thing to really be robust."}, {"time": 872, "text": "The question I wanna ask, let's see if we can untangle it, is what are your thoughts on the Elon Musk provocative statement that LiDAR is a crutch, that it's a kind of, I guess, growing pains, and that much of the perception task can be done with cameras?"}, {"time": 892, "text": "So I think it is undeniable that people walk around without lasers in their foreheads, and they can get into vehicles and drive them, and so there's an existence proof that you can drive using passive vision."}, {"time": 910, "text": "No doubt, can't argue with that."}, {"time": 912, "text": "In terms of sensors, yeah, so there's proof."}, {"time": 914, "text": "Yeah, in terms of sensors, right?"}, {"time": 916, "text": "So there's an example that we all go do it, many of us every day."}, {"time": 921, "text": "In terms of LiDAR being a crutch, sure."}, {"time": 965, "text": "And so any technology that we can bring to bear that accelerates this self driving technology coming to market and saving lives is technology we should be using."}, {"time": 978, "text": "And it feels just arbitrary to say, well, I'm not okay with using lasers because that's whatever, but I am okay with using an eight megapixel camera or a 16 megapixel camera."}, {"time": 992, "text": "These are just bits of technology, and we should be taking the best technology from the tool bin that allows us to go and solve a problem."}, {"time": 1001, "text": "The question I often talk to, well, obviously you do as well, to sort of automotive companies, and if there's one word that comes up more often than anything, it's cost, and trying to drive costs down."}, {"time": 1015, "text": "So while it's true that it's a tragic number, the 37,000, the question is, and I'm not the one asking this question because I hate this question, but we want to find the cheapest sensor suite that creates a safe vehicle."}, {"time": 1033, "text": "So in that uncomfortable trade off, do you foresee LiDAR coming down in cost in the future, or do you see a day where level four autonomy is possible without LiDAR?"}, {"time": 1049, "text": "I see both of those, but it's really a matter of time."}, {"time": 1052, "text": "And I think really, maybe I would talk to the question you asked about the cheapest sensor."}, {"time": 1057, "text": "I don't think that's actually what you want."}, {"time": 1060, "text": "What you want is a sensor suite that is economically viable."}, {"time": 1065, "text": "And then after that, everything is about margin and driving costs out of the system."}, {"time": 1072, "text": "What you also want is a sensor suite that works."}, {"time": 1075, "text": "And so it's great to tell a story about how it would be better to have a self driving system with a $50 sensor instead of a $500 sensor."}, {"time": 1088, "text": "But if the $500 sensor makes it work and the $50 sensor doesn't work, who cares?"}, {"time": 1095, "text": "So long as you can actually have an economic opportunity, there's an economic opportunity there."}, {"time": 1101, "text": "And the economic opportunity is important because that's how you actually have a sustainable business and that's how you can actually see this come to scale and be out in the world."}, {"time": 1112, "text": "And so when I look at LiDAR, I see a technology that has no underlying fundamentally expense to it, fundamental expense to it."}, {"time": 1122, "text": "It's going to be more expensive than an imager because CMOS processes or FAP processes are dramatically more scalable than mechanical processes."}, {"time": 1136, "text": "But we still should be able to drive costs down substantially on that side."}, {"time": 1140, "text": "And then I also do think that with the right business model you can absorb more, certainly more cost on the bill of materials."}, {"time": 1149, "text": "Yeah, if the sensor suite works, extra value is provided, thereby you don't need to drive costs down to zero."}, {"time": 1155, "text": "It's the basic economics."}, {"time": 1157, "text": "You've talked about your intuition that level two autonomy is problematic because of the human factor of vigilance, decrement, complacency, over trust and so on, just us being human."}, {"time": 1169, "text": "We over trust the system, we start doing even more so partaking in the secondary activities like smartphones and so on."}, {"time": 1178, "text": "Have your views evolved on this point in either direction?"}, {"time": 1183, "text": "Can you speak to it?"}, {"time": 1184, "text": "So, and I want to be really careful because sometimes this gets twisted in a way that I certainly didn't intend."}, {"time": 1193, "text": "So active safety systems are a really important technology that we should be pursuing and integrating into vehicles."}, {"time": 1202, "text": "And there's an opportunity in the near term to reduce accidents, reduce fatalities, and we should be pushing on that."}, {"time": 1211, "text": "Level two systems are systems where the vehicle is controlling two axes."}, {"time": 1218, "text": "So braking and throttle slash steering."}, {"time": 1223, "text": "And I think there are variants of level two systems that are supporting the driver."}, {"time": 1227, "text": "That absolutely we should encourage to be out there."}, {"time": 1231, "text": "Where I think there's a real challenge is in the human factors part around this and the misconception from the public around the capability set that that enables and the trust that they should have in it."}, {"time": 1246, "text": "And that is where I kind of, I'm actually incrementally more concerned around level three systems and how exactly a level two system is marketed and delivered and how much effort people have put into those human factors."}, {"time": 1261, "text": "So I still believe several things around this."}, {"time": 1265, "text": "One is people will overtrust the technology."}, {"time": 1269, "text": "We've seen over the last few weeks a spate of people sleeping in their Tesla."}, {"time": 1274, "text": "I watched an episode last night of Trevor Noah talking about this and him, this is a smart guy who has a lot of resources at his disposal describing a Tesla as a self driving car and that why shouldn't people be sleeping in their Tesla?"}, {"time": 1293, "text": "And it's like, well, because it's not a self driving car and it is not intended to be and these people will almost certainly die at some point or hurt other people."}, {"time": 1308, "text": "And so we need to really be thoughtful about how that technology is described and brought to market."}, {"time": 1314, "text": "I also think that because of the economic challenges we were just talking about, that these level two driver assistance systems, that technology path will diverge from the technology path that we need to be on to actually deliver truly self driving vehicles, ones where you can get in it and drive it."}, {"time": 1336, "text": "Can get in it and sleep and have the equivalent or better safety than a human driver behind the wheel."}, {"time": 1344, "text": "Because again, the economics are very different in those two worlds and so that leads to divergent technology."}, {"time": 1352, "text": "So you just don't see the economics of gradually increasing from level two and doing so quickly enough to where it doesn't cause safety, critical safety concerns."}, {"time": 1364, "text": "You believe that it needs to diverge at this point into basically different routes."}, {"time": 1370, "text": "And really that comes back to what are those L2 and L1 systems doing?"}, {"time": 1377, "text": "And they are driver assistance functions where the people that are marketing that responsibly are being very clear and putting human factors in place such that the driver is actually responsible for the vehicle and that the technology is there to support the driver."}, {"time": 1395, "text": "And the safety cases that are built around those are dependent on that driver attention and attentiveness."}, {"time": 1404, "text": "And at that point, you can kind of give up to some degree for economic reasons, you can give up on say false negatives."}, {"time": 1414, "text": "And the way to think about this is for a four collision mitigation braking system, if it half the times the driver missed a vehicle in front of it, it hit the brakes and brought the vehicle to a stop, that would be an incredible, incredible advance in safety on our roads, right?"}, {"time": 1433, "text": "That would be equivalent to seat belts."}, {"time": 1435, "text": "But it would mean that if that vehicle wasn't being monitored, it would hit one out of two cars."}, {"time": 1440, "text": "And so economically, that's a perfectly good solution for a driver assistance system."}, {"time": 1446, "text": "What you should do at that point, if you can get it to work 50% of the time, is drive the cost out of that so you can get it on as many vehicles as possible."}, {"time": 1453, "text": "But driving the cost out of it doesn't drive up performance on the false negative case."}, {"time": 1458, "text": "And so you'll continue to not have a technology that could really be available for a self driven vehicle."}, {"time": 1465, "text": "So clearly the communication, and this probably applies to all four vehicles as well, the marketing and communication of what the technology is actually capable of, how hard it is, how easy it is, all that kind of stuff is highly problematic."}, {"time": 1481, "text": "So say everybody in the world was perfectly communicated and were made to be completely aware of every single technology out there, what it's able to do."}, {"time": 1494, "text": "And now we're maybe getting into philosophical ground."}, {"time": 1496, "text": "Is it possible to have a level two vehicle where we don't over trust it?"}, {"time": 1505, "text": "If people truly understood the risks and internalized it, then sure, you could do that safely."}, {"time": 1514, "text": "But that's a world that doesn't exist."}, {"time": 1516, "text": "The people are going to, if the facts are put in front of them, they're gonna then combine that with their experience."}, {"time": 1524, "text": "And let's say they're using an L2 system and they go up and down the 101 every day and they do that for a month."}, {"time": 1532, "text": "And it just worked every day for a month."}, {"time": 1536, "text": "Like that's pretty compelling at that point, just even if you know the statistics, you're like, well, I don't know, maybe there's something funny about those."}, {"time": 1544, "text": "Maybe they're driving in difficult places."}, {"time": 1546, "text": "Like I've seen it with my own eyes, it works."}, {"time": 1549, "text": "And the problem is that that sample size that they have, so it's 30 miles up and down, so 60 miles times 30 days, so 60, 180, 1,800 miles."}, {"time": 1558, "text": "Like that's a drop in the bucket compared to the, what, 85 million miles between fatalities."}, {"time": 1567, "text": "And so they don't really have a true estimate based on their personal experience of the real risks, but they're gonna trust it anyway, because it's hard not to."}, {"time": 1576, "text": "It worked for a month, what's gonna change?"}, {"time": 1578, "text": "So even if you start a perfect understanding of the system, your own experience will make it drift."}, {"time": 1584, "text": "I mean, that's a big concern."}, {"time": 1585, "text": "Over a year, over two years even, it doesn't have to be months."}, {"time": 1589, "text": "And I think that as this technology moves from what I would say is kind of the more technology savvy ownership group to the mass market, you may be able to have some of those folks who are really familiar with technology, they may be able to internalize it better."}, {"time": 1608, "text": "And your kind of immunization against this kind of false risk assessment might last longer, but as folks who aren't as savvy about that read the material and they compare that to their personal experience, I think there it's going to move more quickly."}, {"time": 1628, "text": "So your work, the program that you've created at Google and now at Aurora is focused more on the second path of creating full autonomy."}, {"time": 1638, "text": "So it's such a fascinating, I think it's one of the most interesting AI problems of the century, right?"}, {"time": 1645, "text": "It's, I just talked to a lot of people, just regular people, I don't know, my mom, about autonomous vehicles, and you begin to grapple with ideas of giving your life control over to a machine."}, {"time": 1658, "text": "It's philosophically interesting, it's practically interesting."}, {"time": 1661, "text": "So let's talk about safety."}, {"time": 1663, "text": "How do you think we demonstrate, you've spoken about metrics in the past, how do you think we demonstrate to the world that an autonomous vehicle, an Aurora system is safe?"}, {"time": 1676, "text": "This is one where it's difficult because there isn't a soundbite answer."}, {"time": 1679, "text": "That we have to show a combination of work that was done diligently and thoughtfully, and this is where something like a functional safety process is part of that."}, {"time": 1691, "text": "It's like here's the way we did the work, that means that we were very thorough."}, {"time": 1697, "text": "So if you believe that what we said about this is the way we did it, then you can have some confidence that we were thorough in the engineering work we put into the system."}, {"time": 1773, "text": "That means you work with people that are essentially experts at safety to try to discuss and show."}, {"time": 1779, "text": "Do you think, the answer's probably no, but just in case, do you think there exists a metric?"}, {"time": 1784, "text": "So currently people have been using number of disengagements."}, {"time": 1788, "text": "And it quickly turns into a marketing scheme to sort of you alter the experiments you run to adjust."}, {"time": 1794, "text": "I think you've spoken that you don't like."}, {"time": 1796, "text": "Don't love it."}, {"time": 1797, "text": "No, in fact, I was on the record telling DMV that I thought this was not a great metric."}, {"time": 1801, "text": "Do you think it's possible to create a metric, a number that could demonstrate safety outside of fatalities?"}, {"time": 1812, "text": "So I do."}, {"time": 1813, "text": "And I think that it won't be just one number."}, {"time": 1817, "text": "So as we are internally grappling with this, and at some point we'll be able to talk more publicly about it, is how do we think about human performance in different tasks, say detecting traffic lights or safely making a left turn across traffic?"}, {"time": 1837, "text": "And what do we think the failure rates are for those different capabilities for people?"}, {"time": 1842, "text": "And then demonstrating to ourselves and then ultimately folks in the regulatory role and then ultimately the public that we have confidence that our system will work better than that."}, {"time": 1854, "text": "And so these individual metrics will kind of tell a compelling story ultimately."}, {"time": 1861, "text": "I do think at the end of the day what we care about in terms of safety is life saved and injuries reduced."}, {"time": 1872, "text": "And then ultimately kind of casualty dollars that people aren't having to pay to get their car fixed."}, {"time": 1879, "text": "And I do think that in aviation they look at a kind of an event pyramid where a crash is at the top of that and that's the worst event obviously and then there's injuries and near miss events and whatnot and violation of operating procedures and you kind of build a statistical model of the relevance of the low severity things or the high severity things."}, {"time": 1905, "text": "And I think that's something where we'll be able to look at as well because an event per 85 million miles is statistically a difficult thing even at the scale of the U.S. to kind of compare directly."}, {"time": 1919, "text": "And that event fatality that's connected to an autonomous vehicle is significantly at least currently magnified in the amount of attention it gets."}, {"time": 1932, "text": "So that speaks to public perception."}, {"time": 1935, "text": "I think the most popular topic about autonomous vehicles in the public is the trolley problem formulation, right?"}, {"time": 1943, "text": "Which has, let's not get into that too much but is misguided in many ways."}, {"time": 1949, "text": "But it speaks to the fact that people are grappling with this idea of giving control over to a machine."}, {"time": 1956, "text": "So how do you win the hearts and minds of the people that autonomy is something that could be a part of their lives?"}, {"time": 1965, "text": "I think you let them experience it, right?"}, {"time": 1967, "text": "I think it's right."}, {"time": 1970, "text": "I think people should be skeptical."}, {"time": 1972, "text": "I think people should ask questions."}, {"time": 1975, "text": "I think they should doubt because this is something new and different."}, {"time": 1980, "text": "They haven't touched it yet."}, {"time": 1981, "text": "And I think that's perfectly reasonable."}, {"time": 1983, "text": "And, but at the same time, it's clear there's an opportunity to make the road safer."}, {"time": 1989, "text": "It's clear that we can improve access to mobility."}, {"time": 1992, "text": "It's clear that we can reduce the cost of mobility."}, {"time": 1996, "text": "And that once people try that and understand that it's safe and are able to use in their daily lives, I think it's one of these things that will just be obvious."}, {"time": 2008, "text": "And I've seen this practically in demonstrations that I've given where I've had people come in and they're very skeptical."}, {"time": 2018, "text": "Again, in a vehicle, my favorite one is taking somebody out on the freeway and we're on the 101 driving at 65 miles an hour."}, {"time": 2026, "text": "And after 10 minutes, they kind of turn and ask, is that all it does?"}, {"time": 2029, "text": "And you're like, it's a self driving car."}, {"time": 2032, "text": "I'm not sure exactly what you thought it would do, right?"}, {"time": 2034, "text": "But it becomes mundane, which is exactly what you want a technology like this to be, right?"}, {"time": 2042, "text": "We don't really, when I turn the light switch on in here, I don't think about the complexity of those electrons being pushed down a wire from wherever it was and being generated."}, {"time": 2055, "text": "It's like, I just get annoyed if it doesn't work, right?"}, {"time": 2059, "text": "And what I value is the fact that I can do other things in this space."}, {"time": 2063, "text": "I can see my colleagues."}, {"time": 2064, "text": "I can read stuff on a paper."}, {"time": 2066, "text": "I can not be afraid of the dark."}, {"time": 2070, "text": "And I think that's what we want this technology to be like is it's in the background and people get to have those life experiences and do so safely."}, {"time": 2078, "text": "So putting this technology in the hands of people speaks to scale of deployment, right?"}, {"time": 2086, "text": "So what do you think the dreaded question about the future because nobody can predict the future, but just maybe speak poetically about when do you think we'll see a large scale deployment of autonomous vehicles, 10,000, those kinds of numbers?"}, {"time": 2106, "text": "We'll see that within 10 years."}, {"time": 2109, "text": "I'm pretty confident."}, {"time": 2114, "text": "What's an impressive scale?"}, {"time": 2116, "text": "What moment, so you've done the DARPA challenge where there's one vehicle."}, {"time": 2120, "text": "At which moment does it become, wow, this is serious scale?"}, {"time": 2123, "text": "So I think the moment it gets serious is when we really do have a driverless vehicle operating on public roads and that we can do that kind of continuously."}, {"time": 2137, "text": "Without a safety driver."}, {"time": 2138, "text": "Without a safety driver in the vehicle."}, {"time": 2140, "text": "I think at that moment, we've kind of crossed the zero to one threshold."}, {"time": 2145, "text": "And then it is about how do we continue to scale that?"}, {"time": 2150, "text": "How do we build the right business models?"}, {"time": 2153, "text": "How do we build the right customer experience around it so that it is actually a useful product out in the world?"}, {"time": 2160, "text": "And I think that is really, at that point it moves from what is this kind of mixed science engineering project into engineering and commercialization and really starting to deliver on the value that we all see here and actually making that real in the world."}, {"time": 2180, "text": "What do you think that deployment looks like?"}, {"time": 2182, "text": "Where do we first see the inkling of no safety driver, one or two cars here and there?"}, {"time": 2188, "text": "Is it on the highway?"}, {"time": 2189, "text": "Is it in specific routes in the urban environment?"}, {"time": 2193, "text": "I think it's gonna be urban, suburban type environments."}, {"time": 2197, "text": "Yeah, with Aurora, when we thought about how to tackle this, it was kind of in vogue to think about trucking as opposed to urban driving."}, {"time": 2207, "text": "And again, the human intuition around this is that freeways are easier to drive on because everybody's kind of going in the same direction and lanes are a little wider, et cetera."}, {"time": 2221, "text": "And I think that that intuition is pretty good, except we don't really care about most of the time."}, {"time": 2226, "text": "We care about all of the time."}, {"time": 2228, "text": "And when you're driving on a freeway with a truck, say 70 miles an hour, and you've got 70,000 pound load with you, that's just an incredible amount of kinetic energy."}, {"time": 2238, "text": "And so when that goes wrong, it goes really wrong."}, {"time": 2242, "text": "And those challenges that you see occur more rarely, so you don't get to learn as quickly."}, {"time": 2251, "text": "And they're incrementally more difficult than urban driving, but they're not easier than urban driving."}, {"time": 2257, "text": "And so I think this happens in moderate speed urban environments because if two vehicles crash at 25 miles per hour, it's not good, but probably everybody walks away."}, {"time": 2271, "text": "And those events where there's the possibility for that occurring happen frequently."}, {"time": 2275, "text": "So we get to learn more rapidly."}, {"time": 2278, "text": "We get to do that with lower risk for everyone."}, {"time": 2282, "text": "And then we can deliver value to people that need to get from one place to another."}, {"time": 2285, "text": "And once we've got that solved, then the freeway driving part of this just falls out."}, {"time": 2291, "text": "But we're able to learn more safely, more quickly in the urban environment."}, {"time": 2295, "text": "So 10 years and then scale 20, 30 year, who knows if a sufficiently compelling experience is created, it could be faster and slower."}, {"time": 2304, "text": "Do you think there could be breakthroughs and what kind of breakthroughs might there be that completely change that timeline?"}, {"time": 2312, "text": "Again, not only am I asking you to predict the future, I'm asking you to predict breakthroughs that haven't happened yet."}, {"time": 2318, "text": "So what's the, I think another way to ask that would be if I could wave a magic wand, what part of the system would I make work today to accelerate it as quickly as possible?"}]}]