[{"title": "Dileep George: Brain-Inspired AI | Lex Fridman Podcast #115", "id": "tg_m_LxxRwM", "quotes": [{"time": 326, "text": "So unless you understand, unless you have a theory about how the system is supposed to work, how the pieces are supposed to fit together, what they're going to contribute, you can't build it."}, {"time": 337, "text": "At the functional level, understand."}, {"time": 342, "text": "So can you actually linger on and describe the Blue Brain project?"}, {"time": 342, "text": "It's kind of a fascinating principle and idea to try to simulate the brain."}, {"time": 348, "text": "We're talking about the human brain, right?"}, {"time": 356, "text": "Human brains and rat brains or cat brains have lots in common that the cortex, the neocortex structure is very similar."}, {"time": 363, "text": "So initially they were trying to just simulate a cat brain."}, {"time": 371, "text": "To understand the nature of evil."}, {"time": 371, "text": "Or as it happens in most of these simulations, you easily get one thing out, which is oscillations."}, {"time": 381, "text": "If you simulate a large number of neurons, they oscillate and you can adjust the parameters and say that, oh, oscillations match the rhythm that we see in the brain, et cetera."}, {"time": 395, "text": "So the idea is, is the simulation at the level of individual neurons?"}, {"time": 403, "text": "So the Blue Brain project, the original idea as proposed was you put very detailed biophysical neurons, biophysical models of neurons, and you interconnect them according to the statistics of connections that we have found from real neuroscience experiments, and then turn it on and see what happens."}, {"time": 426, "text": "And these neural models are incredibly complicated in themselves, right?"}, {"time": 434, "text": "Because these neurons are modeled using this idea called Hodgkin Huxley models, which are about how signals propagate in a cable."}, {"time": 448, "text": "And there are active dendrites, all those phenomena, which those phenomena themselves, we don't understand that well."}, {"time": 454, "text": "And then we put in connectivity, which is part guesswork, part observed."}, {"time": 460, "text": "And of course, if we do not have any theory about how it is supposed to work, we just have to take whatever comes out of it as, okay, this is something interesting."}, {"time": 474, "text": "But in your sense, these models of the way signal travels along, like with the axons and all the basic models, they're too crude."}, {"time": 484, "text": "Oh, well, actually, they are pretty detailed and pretty sophisticated."}, {"time": 484, "text": "And they do replicate the neural dynamics."}, {"time": 492, "text": "If you take a single neuron and you try to turn on the different channels, the calcium channels and the different receptors, and see what the effect of turning on or off those channels are in the neuron's spike output, people have built pretty sophisticated models of that."}, {"time": 515, "text": "And they are, I would say, in the regime of correct."}, {"time": 521, "text": "Well, see, the correctness, that's interesting, because you mentioned at several levels, the correctness is measured by looking at some kind of aggregate statistics."}, {"time": 529, "text": "It would be more of the spiking dynamics of a signal neuron."}, {"time": 533, "text": "Spiking dynamics of a signal neuron, okay."}, {"time": 534, "text": "And yeah, these models, because they are going to the level of mechanism, so they are basically looking at, okay, what is the effect of turning on an ion channel?"}, {"time": 547, "text": "And you can model that using electric circuits."}, {"time": 547, "text": "So it is not just a function fitting."}, {"time": 547, "text": "People are looking at the mechanism underlying it and putting that in terms of electric circuit theory, signal propagation theory, and modeling that."}, {"time": 563, "text": "So those models are sophisticated, but getting a single neurons model 99% right does not still tell you how to..."}, {"time": 571, "text": "It would be the analog of getting a transistor model right and now trying to build a microprocessor."}, {"time": 580, "text": "And if you did not understand how a microprocessor works, but you say, oh, I now can model one transistor well, and now I will just try to interconnect the transistors according to whatever I could guess from the experiments and try to simulate it, then it is very unlikely that you will produce a functioning microprocessor."}, {"time": 612, "text": "When you want to produce a functioning microprocessor, you want to understand Boolean logic, how do the gates work, all those things, and then understand how do those gates get implemented using transistors."}, {"time": 622, "text": "This reminds me, there's a paper, maybe you're familiar with it, that I remember going through in a reading group that approaches a microprocessor from a perspective of a neuroscientist."}, {"time": 631, "text": "I think it basically, it uses all the tools that we have of neuroscience to try to understand, like as if we just aliens showed up to study computers and to see if those tools could be used to get any kind of sense of how the microprocessor works."}, {"time": 649, "text": "I think the final, the takeaway from at least this initial exploration is that we're screwed."}, {"time": 654, "text": "There's no way that the tools of neuroscience would be able to get us to anything, like not even Boolean logic."}, {"time": 665, "text": "I mean, it's just any aspect of the architecture of the function of the processes involved, the clocks, the timing, all that, you can't figure that out from the tools of neuroscience."}, {"time": 681, "text": "So I'm very familiar with this particular paper."}, {"time": 685, "text": "I think it was called, can a neuroscientist understand a microprocessor or something like that."}, {"time": 693, "text": "Following the methodology in that paper, even an electrical engineer would not understand microprocessors."}, {"time": 699, "text": "So I don't think it is that bad in the sense of saying, neuroscientists do find valuable things by observing the brain."}, {"time": 709, "text": "They do find good insights, but those insights cannot be put together just as a simulation."}, {"time": 718, "text": "You have to investigate what are the computational underpinnings of those findings."}, {"time": 725, "text": "How do all of them fit together from an information processing and information processing perspective?"}, {"time": 733, "text": "Somebody has to painstakingly put those things together and build hypothesis."}, {"time": 741, "text": "So I don't want to diss all of neuroscientists saying, oh, they're not finding anything."}, {"time": 746, "text": "No, that paper almost went to that level of neuroscientists will never understand."}, {"time": 751, "text": "I think they do find lots of useful things, but it has to be put together in a computational framework."}, {"time": 757, "text": "I mean, but you know, just the AI systems will be listening to this podcast a hundred years from now and they will probably, there's some nonzero probability they'll find your words laughable."}, {"time": 770, "text": "There's like, I remember humans thought they understood something about the brain."}, {"time": 775, "text": "They were totally clueless."}, {"time": 775, "text": "There's a sense about neuroscience that we may be in the very, very early days of understanding the brain."}, {"time": 779, "text": "But I mean, that's one perspective."}, {"time": 786, "text": "I mean, in your perspective, how far are we into understanding any aspect of the brain?"}, {"time": 798, "text": "So the, the, the dynamics of the individual neuron communication to the, how when they, in, in a collective sense, how they're able to store information, transfer information, how intelligence then emerges, all that kind of stuff."}, {"time": 811, "text": "Where are we on that timeline?"}, {"time": 815, "text": "So, you know, timelines are very, very hard to predict and you can of course be wrong."}, {"time": 820, "text": "And it can be wrong in, on either side."}, {"time": 820, "text": "You know, we know that now when we look back the first flight was in 1903."}, {"time": 828, "text": "In 1900, there was a New York Times article on flying machines that do not fly and, and you know, humans might not fly for another a hundred years."}, {"time": 837, "text": "That was what that article stated."}, {"time": 843, "text": "And so, but no, they, they flew three years after that."}, {"time": 843, "text": "So it is, you know, it's very hard to, so... Well, and on that point, one of the Wright brothers, I think two years before, said that, like he said, like some number, like 50 years, he has become convinced that it's, it's, it's impossible."}, {"time": 863, "text": "Even during their experimentation."}, {"time": 871, "text": "I mean, that's a tribute to when that's like the entrepreneurial battle of like depression of going through, just like thinking there's, this is impossible, but there, yeah, there's something, even the person that's in it is not able to see estimate correctly."}, {"time": 887, "text": "But I can, I can tell from the point of, you know, objectively, what are the things that we know about the brain and how that can be used to build AI models, which can then go back and inform how the brain works."}, {"time": 898, "text": "So my way of understanding the brain would be to basically say, look at the insights neuroscientists have found, understand that from a computational angle, information processing angle, build models using that."}, {"time": 911, "text": "And then building that model, which, which functions, which is a functional model, which is, which is doing the task that we want the model to do."}, {"time": 922, "text": "It is not just trying to model a phenomena in the brain."}, {"time": 922, "text": "It is, it is trying to do what the brain is trying to do on the, on the whole functional level."}, {"time": 927, "text": "And building that model will help you fill in the missing pieces that, you know, biology just gives you the hints and building the model, you know, fills in the rest of the, the pieces of the puzzle."}, {"time": 939, "text": "And then you can go and connect that back to biology and say, okay, now it makes sense that this part of the brain is doing this, or this layer in the cortical circuit is doing this."}, {"time": 951, "text": "And then continue this iteratively because now that will inform new experiments in neuroscience."}, {"time": 959, "text": "And of course, you know, building the model and verifying that in the real world will also tell you more about, does the model actually work?"}, {"time": 971, "text": "And you can refine the model, find better ways of putting these neuroscience insights together."}, {"time": 977, "text": "So, so I would say it is, it is, you know, it, so neuroscientists alone, just from experimentation will not be able to build a model of the, of the brain or a functional model of the brain."}, {"time": 988, "text": "So we, you know, there, there's lots of efforts, which are very impressive efforts in collecting more and more connectivity data from the brain."}, {"time": 1001, "text": "You know, how, how are the microcircuits of the brain connected with each other?"}, {"time": 1005, "text": "Those are beautiful, by the way."}, {"time": 1007, "text": "Those are beautiful."}, {"time": 1007, "text": "And at the same time, those, those do not itself by themselves, convey the story of how does it work?"}, {"time": 1014, "text": "And, and somebody has to understand, okay, why are they connected like that?"}, {"time": 1020, "text": "And what, what are those things doing?"}, {"time": 1020, "text": "And, and we do that by building models in AI using hints from neuroscience and, and repeat the cycle."}, {"time": 1031, "text": "So what aspect of the brain are useful in this whole endeavor, which by the way, I should say, you're, you're both a neuroscientist and an AI person."}, {"time": 1038, "text": "I guess the dream is to both understand the brain and to build AGI systems."}, {"time": 1044, "text": "So you're, it's like an engineer's perspective of trying to understand the brain."}, {"time": 1052, "text": "So what aspects of the brain, functionally speaking, like you said, do you find interesting?"}, {"time": 1058, "text": "Yeah, quite a lot of things."}, {"time": 1058, "text": "So one is, you know, if you look at the visual cortex and, and, you know, the visual cortex is, is a large part of the brain."}, {"time": 1066, "text": "I forget the exact fraction, but it is, it's a huge part of our brain area is occupied by just, just vision."}, {"time": 1079, "text": "So vision, visual cortex is not just a feed forward cascade of neurons."}, {"time": 1079, "text": "There are a lot more feedback connections in the brain compared to the feed forward connections."}, {"time": 1086, "text": "And, and it is surprising to the level of detail neuroscientists have actually studied this."}, {"time": 1091, "text": "If you, if you go into neuroscience literature and poke around and ask, you know, have they studied what will be the effect of poking a neuron in level IT in level V1?"}, {"time": 1102, "text": "And have they studied that?"}, {"time": 1102, "text": "And you will say, yes, they have studied that."}, {"time": 1114, "text": "So every part of every possible combination."}, {"time": 1118, "text": "I mean, it's, it's a, it's not a random exploration at all."}, {"time": 1118, "text": "It's a very hypothesis driven, right?"}, {"time": 1123, "text": "Like they, they are very experimental."}, {"time": 1123, "text": "Neuroscientists are very, very systematic in how they probe the brain because experiments are very costly to conduct."}, {"time": 1127, "text": "They take a lot of preparation."}, {"time": 1132, "text": "They, they need a lot of control."}, {"time": 1132, "text": "So they, they are very hypothesis driven in how they probe the brain."}, {"time": 1137, "text": "And often what I find is that when we have a question in AI about has anybody probed how lateral connections in the brain works?"}, {"time": 1145, "text": "And when you go and read the literature, yes, people have probed it and people have probed it very systematically."}, {"time": 1151, "text": "And, and they have hypotheses about how those lateral connections are supposedly contributing to visual processing."}, {"time": 1163, "text": "But of course they haven't built very, very functional, detailed models of it."}, {"time": 1167, "text": "By the way, how do the, in those studies, sorry to interrupt, do they, do they stimulate like a neuron in one particular area of the visual cortex and then see how the travel of the signal travels kind of thing?"}, {"time": 1178, "text": "Fascinating, very, very fascinating experiments."}, {"time": 1178, "text": "So I can, I can give you one example I was impressed with."}, {"time": 1183, "text": "This is, so before going to that, let me, let me give you, you know, a overview of how the, the layers in the cortex are organized, right?"}, {"time": 1190, "text": "Visual cortex is organized into roughly four hierarchical levels."}, {"time": 1196, "text": "So V1, V2, V4, IT."}, {"time": 1196, "text": "And in V1... What happened to V3?"}, {"time": 1203, "text": "Well, yeah, that's another pathway."}, {"time": 1203, "text": "So this is, this, I'm talking about just object recognition pathway."}, {"time": 1209, "text": "All right, cool."}, {"time": 1210, "text": "And then in V1 itself, so it's, there is a very detailed microcircuit in V1 itself."}, {"time": 1210, "text": "That is, there is organization within a level itself."}, {"time": 1219, "text": "The cortical sheet is organized into, you know, multiple layers and there are columnar structure."}, {"time": 1225, "text": "And, and this, this layer wise and columnar structure is repeated in V1, V2, V4, IT, all of them, right?"}, {"time": 1231, "text": "And, and the connections between these layers within a level, you know, in V1 itself, there are six layers roughly, and the connections between them, there is a particular structure to them."}, {"time": 1244, "text": "And now, so one example of an experiment people did is when I, when you present a stimulus, which is, let's say, requires separating the foreground from the background of an object."}, {"time": 1260, "text": "So it is, it's a textured triangle on a textured background."}, {"time": 1266, "text": "And you can check, does the surface settle first or does the contour settle first?"}, {"time": 1279, "text": "Settle?"}, {"time": 1279, "text": "Settle in the sense that the, so when you finally form the percept of the, of the triangle, you understand where the contours of the triangle are, and you also know where the inside of the triangle is, right?"}, {"time": 1292, "text": "That's when you form the final percept."}, {"time": 1292, "text": "Now you can ask, what is the dynamics of forming that final percept?"}, {"time": 1299, "text": "Do the, do the neurons first find the edges and converge on where the edges are, and then they find the inner surfaces, or does it go the other way around?"}, {"time": 1315, "text": "The other way around."}, {"time": 1315, "text": "So what's the answer?"}, {"time": 1318, "text": "In this case, it turns out that it first settles on the edges."}, {"time": 1318, "text": "It converges on the edge hypothesis first, and then the surfaces are filled in from the edges to the inside."}, {"time": 1362, "text": "And these kinds of experiments stand out when you try to explain illusions."}, {"time": 1362, "text": "One example of a favorite illusion of mine is the Kanitsa triangle."}, {"time": 1368, "text": "I don't know that you are familiar with this one."}, {"time": 1371, "text": "So this is an example where it's a triangle, but only the corners of the triangle are shown in the stimulus."}, {"time": 1380, "text": "So they look like kind of Pacman."}, {"time": 1386, "text": "Oh, the black Pacman."}, {"time": 1388, "text": "And then you start to see."}, {"time": 1390, "text": "Your visual system hallucinates the edges."}, {"time": 1390, "text": "And when you look at it, you will see a faint edge."}, {"time": 1396, "text": "And you can go inside the brain and look, do actually neurons signal the presence of this edge?"}, {"time": 1404, "text": "And if they signal, how do they do it?"}, {"time": 1404, "text": "Because they are not receiving anything from the input."}, {"time": 1410, "text": "The input is blank for those neurons."}, {"time": 1410, "text": "So how do they signal it?"}, {"time": 1410, "text": "When does the signaling happen?"}, {"time": 1417, "text": "So if a real contour is present in the input, then the neurons immediately signal, okay, there is an edge here."}, {"time": 1425, "text": "When it is an illusory edge, it is clearly not in the input."}, {"time": 1432, "text": "It is coming from the context."}, {"time": 1432, "text": "So those neurons fire later."}, {"time": 1432, "text": "And you can say that, okay, it's the feedback connection that is causing them to fire."}, {"time": 1438, "text": "And they happen later."}, {"time": 1445, "text": "And I'll find the dynamics of them."}, {"time": 1445, "text": "So these studies are pretty impressive and very detailed."}, {"time": 1453, "text": "So by the way, just a step back, you said that there may be more feedback connections than feed forward connections."}, {"time": 1460, "text": "First of all, if it's just for like a machine learning folks, I mean, that's crazy that there's all these feedback connections."}, {"time": 1467, "text": "We often think about, thanks to deep learning, you start to think about the human brain as a kind of feed forward mechanism."}, {"time": 1482, "text": "So what the heck are these feedback connections?"}, {"time": 1482, "text": "What's the dynamics?"}, {"time": 1482, "text": "What are we supposed to think about them?"}, {"time": 1492, "text": "So this fits into a very beautiful picture about how the brain works."}, {"time": 1499, "text": "So the beautiful picture of how the brain works is that our brain is building a model of the world."}, {"time": 1506, "text": "So our visual system is building a model of how objects behave in the world."}, {"time": 1506, "text": "And we are constantly projecting that model back onto the world."}, {"time": 1513, "text": "So what we are seeing is not just a feed forward thing that just gets interpreted in a feed forward part."}, {"time": 1520, "text": "We are constantly projecting our expectations onto the world."}, {"time": 1525, "text": "And what the final person is a combination of what we project onto the world combined with what the actual sensory input is."}, {"time": 1531, "text": "Almost like trying to calculate the difference and then trying to interpret the difference."}, {"time": 1537, "text": "I wouldn't put this calculating the difference."}, {"time": 1544, "text": "It's more like what is the best explanation for the input stimulus based on the model of the world I have."}, {"time": 1550, "text": "And that's where all the illusions come in."}, {"time": 1550, "text": "But that's an incredibly efficient process."}, {"time": 1556, "text": "So the feedback mechanism, it just helps you constantly."}, {"time": 1565, "text": "So hallucinate how the world should be based on your world model and then just looking at if there's novelty, like trying to explain it."}, {"time": 1571, "text": "Hence, that's why movement."}, {"time": 1571, "text": "We detect movement really well."}, {"time": 1579, "text": "There's all these kinds of things."}, {"time": 1579, "text": "And this is like at all different levels of the cortex you're saying."}, {"time": 1585, "text": "This happens at the lowest level or the highest level."}, {"time": 1585, "text": "In fact, feedback connections are more prevalent in everywhere in the cortex."}, {"time": 1590, "text": "And so one way to think about it, and there's a lot of evidence for this, is inference."}, {"time": 1596, "text": "So basically, if you have a model of the world and when some evidence comes in, what you are doing is inference."}, {"time": 1602, "text": "You are trying to now explain this evidence using your model of the world."}, {"time": 1610, "text": "And this inference includes projecting your model onto the evidence and taking the evidence back into the model and doing an iterative procedure."}, {"time": 1624, "text": "And this iterative procedure is what happens using the feed forward feedback propagation."}, {"time": 1631, "text": "And feedback affects what you see in the world, and it also affects feed forward propagation."}, {"time": 1637, "text": "And examples are everywhere."}, {"time": 1637, "text": "We see these kinds of things everywhere."}, {"time": 1637, "text": "The idea that there can be multiple competing hypotheses in our model trying to explain the same evidence, and then you have to kind of make them compete."}, {"time": 1652, "text": "And one hypothesis will explain away the other hypothesis through this competition process."}, {"time": 1659, "text": "So you have competing models of the world that try to explain."}, {"time": 1666, "text": "What do you mean by explain away?"}, {"time": 1670, "text": "So this is a classic example in graphical models, probabilistic models."}, {"time": 1676, "text": "What are those?"}, {"time": 1681, "text": "I think it's useful to mention because we'll talk about them more."}, {"time": 1685, "text": "So neural networks are one class of machine learning models."}, {"time": 1685, "text": "You have distributed set of nodes, which are called the neurons."}, {"time": 1692, "text": "Each one is doing a dot product and you can approximate any function using this multilevel network of neurons."}, {"time": 1698, "text": "So that's a class of models which are useful for function approximation."}, {"time": 1704, "text": "There is another class of models in machine learning called probabilistic graphical models."}, {"time": 1710, "text": "And you can think of them as each node in that model is variable, which is talking about something."}, {"time": 1718, "text": "It can be a variable representing, is an edge present in the input or not?"}, {"time": 1726, "text": "And at the top of the network, a node can be representing, is there an object present in the world or not?"}, {"time": 1736, "text": "So it is another way of encoding knowledge."}, {"time": 1736, "text": "And then once you encode the knowledge, you can do inference in the right way."}, {"time": 1746, "text": "What is the best way to explain some set of evidence using this model that you encoded?"}, {"time": 1755, "text": "So when you encode the model, you are encoding the relationship between these different variables."}, {"time": 1760, "text": "How is the edge connected to the model of the object?"}, {"time": 1764, "text": "How is the surface connected to the model of the object?"}, {"time": 1769, "text": "And then, of course, this is a very distributed, complicated model."}, {"time": 1769, "text": "And inference is, how do you explain a piece of evidence when a set of stimulus comes in?"}, {"time": 1777, "text": "If somebody tells me there is a 50% probability that there is an edge here in this part of the model, how does that affect my belief on whether I should think that there is a square present in the image?"}, {"time": 1787, "text": "So this is the process of inference."}, {"time": 1794, "text": "So one example of inference is having this expiring away effect between multiple causes."}, {"time": 1802, "text": "So graphical models can be used to represent causality in the world."}, {"time": 1802, "text": "So let's say, you know, your alarm at home can be triggered by a burglar getting into your house, or it can be triggered by an earthquake."}, {"time": 1822, "text": "Both can be causes of the alarm going off."}, {"time": 1822, "text": "So now, you're in your office, you heard burglar alarm going off, you are heading home, thinking that there's a burglar got in."}, {"time": 1830, "text": "But while driving home, if you hear on the radio that there was an earthquake in the vicinity, now your strength of evidence for a burglar getting into their house is diminished."}, {"time": 1841, "text": "Because now that piece of evidence is explained by the earthquake being present."}, {"time": 1849, "text": "So if you think about these two causes explaining at lower level variable, which is alarm, now, what we're seeing is that increasing the evidence for some cause, you know, there is evidence coming in from below for alarm being present."}, {"time": 1868, "text": "And initially, it was flowing to a burglar being present."}, {"time": 1868, "text": "But now, since there is side evidence for this other cause, it explains away this evidence and evidence will now flow to the other cause."}, {"time": 1880, "text": "This is, you know, two competing causal things trying to explain the same evidence."}, {"time": 1886, "text": "And the brain has a similar kind of mechanism for doing so."}, {"time": 1891, "text": "And how's that all encoded in the brain?"}, {"time": 1891, "text": "Like, where's the storage of information?"}, {"time": 1899, "text": "Are we talking just maybe to get it a little bit more specific?"}, {"time": 1899, "text": "Is it in the hardware of the actual connections?"}, {"time": 1906, "text": "Is it in chemical communication?"}, {"time": 1906, "text": "Is it electrical communication?"}, {"time": 1906, "text": "Do we know?"}, {"time": 1913, "text": "So this is, you know, a paper that we are bringing out soon."}, {"time": 1916, "text": "Which one is this?"}, {"time": 1917, "text": "This is the cortical microcircuits paper that I sent you a draft of."}, {"time": 1917, "text": "Of course, this is a lot of this."}, {"time": 1923, "text": "A lot of it is still hypothesis."}, {"time": 1923, "text": "One hypothesis is that you can think of a cortical column as encoding a concept."}, {"time": 1929, "text": "A concept, you know, think of it as an example of a concept."}, {"time": 1929, "text": "Is an edge present or not?"}, {"time": 1940, "text": "Or is an object present or not?"}, {"time": 1940, "text": "Okay, so you can think of it as a binary variable, a binary random variable."}, {"time": 1947, "text": "The presence of an edge or not, or the presence of an object or not."}, {"time": 1952, "text": "So each cortical column can be thought of as representing that one concept, one variable."}, {"time": 1958, "text": "And then the connections between these cortical columns are basically encoding the relationship between these random variables."}, {"time": 1963, "text": "And then there are connections within the cortical column."}, {"time": 1969, "text": "Each cortical column is implemented using multiple layers of neurons with very, very, very rich structure there."}, {"time": 1974, "text": "You know, there are thousands of neurons in a cortical column."}, {"time": 1980, "text": "But that structure is similar across the different cortical columns."}, {"time": 1983, "text": "And also these cortical columns connect to a substructure called thalamus."}, {"time": 1990, "text": "So all cortical columns pass through this substructure."}, {"time": 1990, "text": "So our hypothesis is that the connections between the cortical columns implement this, you know, that's where the knowledge is stored about how these different concepts connect to each other."}, {"time": 2001, "text": "And then the neurons inside this cortical column and in thalamus in combination implement this actual computation for inference, which includes explaining away and competing between the different hypotheses."}, {"time": 2021, "text": "And it is all very..."}, {"time": 2021, "text": "So what is amazing is that neuroscientists have actually done experiments to the tune of showing these things."}, {"time": 2029, "text": "They might not be putting it in the overall inference framework, but they will show things like, if I poke this higher level neuron, it will inhibit through this complicated loop through thalamus, it will inhibit this other column."}, {"time": 2047, "text": "So they will do such experiments."}, {"time": 2047, "text": "But do they use terminology of concepts, for example?"}, {"time": 2054, "text": "So, I mean, is it something where it's easy to anthropomorphize and think about concepts like you started moving into logic based kind of reasoning systems."}, {"time": 2062, "text": "So I would just think of concepts in that kind of way, or is it a lot messier, a lot more gray area, you know, even more gray, even more messy than the artificial neural network kinds, kinds of abstractions?"}, {"time": 2087, "text": "Easiest way to think of it as a variable, right?"}, {"time": 2090, "text": "It's a binary variable, which is showing the presence or absence of something."}, {"time": 2095, "text": "So, but I guess what I'm asking is, is that something that we're supposed to think of something that's human interpretable of that something?"}, {"time": 2104, "text": "It doesn't need to be."}, {"time": 2104, "text": "It doesn't need to be human interpretable."}, {"time": 2104, "text": "There's no need for it to be human interpretable."}, {"time": 2107, "text": "But it's almost like you will be able to find some interpretation of it because it is connected to the other things that you know about."}, {"time": 2120, "text": "And the point is it's useful somehow."}, {"time": 2123, "text": "It's useful as an entity in the graphic, in connecting to the other entities that are, let's call them concepts."}, {"time": 2133, "text": "So, by the way, are these the cortical microcircuits?"}, {"time": 2138, "text": "These are the cortical microcircuits."}, {"time": 2138, "text": "You know, that's what neuroscientists use to talk about the circuits within a level of the cortex."}, {"time": 2143, "text": "So, you can think of, you know, let's think of a neural network, artificial neural network terms."}, {"time": 2149, "text": "People talk about the architecture of how many layers they build, what is the fan in, fan out, et cetera."}, {"time": 2154, "text": "That is the macro architecture."}, {"time": 2161, "text": "And then within a layer of the neural network, the cortical neural network is much more structured within a level."}, {"time": 2171, "text": "There's a lot more intricate structure there."}, {"time": 2171, "text": "But even within an artificial neural network, you can think of feature detection plus pooling as one level."}, {"time": 2183, "text": "And so, that is kind of a microcircuit."}, {"time": 2183, "text": "It's much more complex in the real brain."}, {"time": 2183, "text": "And so, within a level, whatever is that circuitry within a column of the cortex and between the layers of the cortex, that's the microcircuitry."}, {"time": 2198, "text": "I love that terminology."}, {"time": 2198, "text": "Machine learning people don't use the circuit terminology."}, {"time": 2205, "text": "But they should."}, {"time": 2205, "text": "So, that's the cortical microcircuit."}, {"time": 2205, "text": "So, what's interesting about, what can we say, what is the paper that you're working on propose about the ideas around these cortical microcircuits?"}, {"time": 2224, "text": "So, this is a fully functional model for the microcircuits of the visual cortex."}, {"time": 2230, "text": "So, the paper focuses on your idea and our discussion now is focusing on vision."}, {"time": 2235, "text": "The visual cortex."}, {"time": 2235, "text": "So, this is a model."}, {"time": 2238, "text": "This is a full model."}, {"time": 2238, "text": "This is how vision works."}, {"time": 2242, "text": "But this is a hypothesis."}, {"time": 2242, "text": "So, let me step back a bit."}, {"time": 2242, "text": "So, we looked at neuroscience for insights on how to build a vision model."}, {"time": 2255, "text": "And we synthesized all those insights into a computational model."}, {"time": 2255, "text": "This is called the recursive cortical network model that we used for breaking captures."}, {"time": 2260, "text": "And we are using the same model for robotic picking and tracking of objects."}, {"time": 2267, "text": "And that, again, is a vision system."}, {"time": 2272, "text": "That's a vision system."}, {"time": 2272, "text": "Computer vision system."}, {"time": 2274, "text": "That's a computer vision system."}, {"time": 2274, "text": "Takes in images and outputs what?"}, {"time": 2279, "text": "On one side, it outputs the class of the image and also segments the image."}, {"time": 2279, "text": "And you can also ask it further queries."}, {"time": 2286, "text": "Where is the edge of the object?"}, {"time": 2286, "text": "Where is the interior of the object?"}, {"time": 2286, "text": "So, it's a model that you build to answer multiple questions."}, {"time": 2291, "text": "So, you're not trying to build a model for just classification or just segmentation, et cetera."}, {"time": 2297, "text": "It's a joint model that can do multiple things."}, {"time": 2303, "text": "So, that's the model that we built using insights from neuroscience."}, {"time": 2303, "text": "And some of those insights are what is the role of feedback connections?"}, {"time": 2310, "text": "What is the role of lateral connections?"}, {"time": 2310, "text": "So, all those things went into the model."}, {"time": 2314, "text": "The model actually uses feedback connections."}, {"time": 2318, "text": "All these ideas from neuroscience."}, {"time": 2321, "text": "So, what the heck is a recursive cortical network?"}, {"time": 2321, "text": "What are the architecture approaches, interesting aspects here, which is essentially a brain inspired approach to computer vision?"}, {"time": 2334, "text": "So, there are multiple layers to this question."}, {"time": 2334, "text": "I can go from the very, very top and then zoom in."}, {"time": 2338, "text": "So, one important thing, constraint that went into the model is that you should not think vision, think of vision as something in isolation."}, {"time": 2345, "text": "We should not think perception as something as a preprocessor for cognition."}, {"time": 2351, "text": "Perception and cognition are interconnected."}, {"time": 2359, "text": "And so, you should not think of one problem in separation from the other problem."}, {"time": 2359, "text": "And so, that means if you finally want to have a system that understand concepts about the world and can learn a very conceptual model of the world and can reason and connect to language, all of those things, you need to think all the way through and make sure that your perception system is compatible with your cognition system and language system and all of them."}, {"time": 2385, "text": "And one aspect of that is top down controllability."}, {"time": 2392, "text": "So, that means, you know, so think of, you know, you can close your eyes and think about the details of one object, right?"}, {"time": 2398, "text": "I can zoom in further and further."}, {"time": 2398, "text": "So, think of the bottle in front of me, right?"}, {"time": 2405, "text": "And now, you can think about, okay, what the cap of that bottle looks."}, {"time": 2411, "text": "I know we can think about what's the texture on that bottle of the cap."}, {"time": 2411, "text": "You know, you can think about, you know, what will happen if something hits that."}, {"time": 2418, "text": "So, you can manipulate your visual knowledge in cognition driven ways."}, {"time": 2425, "text": "And so, this top down controllability and being able to simulate scenarios in the world."}, {"time": 2435, "text": "So, you're not just a passive player in this perception game."}, {"time": 2443, "text": "You can control it."}, {"time": 2443, "text": "You have imagination."}, {"time": 2443, "text": "So, basically, you know, basically having a generative network, which is a model and it is not just some arbitrary generative network."}, {"time": 2456, "text": "It has to be built in a way that it is controllable top down."}, {"time": 2456, "text": "It is not just trying to generate a whole picture at once."}, {"time": 2462, "text": "You know, it's not trying to generate photorealistic things of the world."}, {"time": 2467, "text": "You know, you don't have good photorealistic models of the world."}, {"time": 2467, "text": "Human brains do not have."}, {"time": 2471, "text": "If I, for example, ask you the question, what is the color of the letter E in the Google logo?"}, {"time": 2477, "text": "You have no idea."}, {"time": 2477, "text": "Although, you have seen it millions of times, hundreds of times."}, {"time": 2485, "text": "So, it's not, our model is not photorealistic, but it has other properties that we can manipulate it."}, {"time": 2492, "text": "And you can think about filling in a different color in that logo."}, {"time": 2492, "text": "You can think about expanding the letter E. You know, you can see what, so you can imagine the consequence of, you know, actions that you have never performed."}, {"time": 2504, "text": "So, these are the kind of characteristics the generative model need to have."}, {"time": 2509, "text": "So, this is one constraint that went into our model."}, {"time": 2509, "text": "Like, you know, so this is, when you read the, just the perception side of the paper, it is not obvious that this was a constraint into the, that went into the model, this top down controllability of the generative model."}, {"time": 2522, "text": "So, what does top down controllability in a model look like?"}, {"time": 2522, "text": "It's a really interesting concept."}, {"time": 2530, "text": "Fascinating concept."}, {"time": 2530, "text": "What does that, is that the recursiveness gives you that?"}, {"time": 2536, "text": "Or how do you do it?"}, {"time": 2536, "text": "Quite a few things."}, {"time": 2536, "text": "It's like, what does the model factor, factorize?"}, {"time": 2542, "text": "You know, what are the, what is the model representing as different pieces in the puzzle?"}, {"time": 2546, "text": "Like, you know, so, so in the RCN network, it thinks of the world, you know, so what I said, the background of an image is modeled separately from the foreground of the image."}, {"time": 2553, "text": "So, the objects are separate from the background."}, {"time": 2559, "text": "They are different entities."}, {"time": 2559, "text": "So, there's a kind of segmentation that's built in fundamentally."}, {"time": 2563, "text": "And then even that object is composed of parts."}, {"time": 2569, "text": "And also, another one is the shape of the object is differently modeled from the texture of the object."}, {"time": 2577, "text": "So, there's like these, you know who Francois Chollet is?"}, {"time": 2577, "text": "So, there's, he developed this like IQ test type of thing for ARC challenge for, and it's kind of cool that there's these concepts, priors that he defines that you bring to the table in order to be able to reason about basic shapes and things in IQ test."}, {"time": 2602, "text": "So, here you're making it quite explicit that here are the things that you should be, these are like distinct things that you should be able to model in this."}, {"time": 2616, "text": "Keep in mind that you can derive this from much more general principles."}, {"time": 2616, "text": "It doesn't, you don't need to explicitly put it as, oh, objects versus foreground versus background, the surface versus the structure."}, {"time": 2628, "text": "No, these are, these are derivable from more fundamental principles of how, you know, what's the property of continuity of natural signals."}, {"time": 2635, "text": "What's the property of continuity of natural signals?"}, {"time": 2641, "text": "By the way, that sounds very poetic, but yeah."}, {"time": 2641, "text": "So, you're saying that's a, there's some low level properties from which emerges the idea that shapes should be different than like there should be a parts of an object."}, {"time": 2652, "text": "There should be, I mean, kind of like Francois, I mean, there's objectness, there's all these things that it's kind of crazy that we humans, I guess, evolved to have because it's useful for us to perceive the world."}, {"time": 2665, "text": "And it derives mostly from the properties of natural signals."}, {"time": 2670, "text": "And so, natural signals."}, {"time": 2670, "text": "So, natural signals are the kind of things we'll perceive in the natural world."}, {"time": 2678, "text": "I don't know why that sounds so beautiful."}, {"time": 2683, "text": "Natural signals."}, {"time": 2683, "text": "As opposed to a QR code, right?"}, {"time": 2683, "text": "Which is an artificial signal that we created."}, {"time": 2688, "text": "Humans are not very good at classifying QR codes."}, {"time": 2688, "text": "We are very good at saying something is a cat or a dog, but not very good at, you know, where computers are very good at classifying QR codes."}, {"time": 2698, "text": "So, our visual system is tuned for natural signals."}, {"time": 2698, "text": "So, it's tuned for natural signals."}, {"time": 2705, "text": "And there are fundamental assumptions in the architecture that are derived from natural signals properties."}, {"time": 2711, "text": "I wonder when you take hallucinogenic drugs, does that go into natural or is that closer to the QR code?"}, {"time": 2718, "text": "It's still natural."}, {"time": 2718, "text": "It's still natural?"}, {"time": 2725, "text": "Because it is still operating using your brains."}, {"time": 2725, "text": "By the way, on that topic, I mean, I haven't been following."}, {"time": 2730, "text": "I think they're becoming legalized and certain."}, {"time": 2730, "text": "I can't wait they become legalized to a degree that you, like, vision science researchers could study it."}, {"time": 2740, "text": "Just like through medical, chemical ways, modify."}, {"time": 2740, "text": "There could be ethical concerns, but modify."}, {"time": 2747, "text": "That's another way to study the brain is to be able to chemically modify it."}, {"time": 2747, "text": "There's probably very long a way to figure out how to do it ethically."}, {"time": 2753, "text": "Yeah, but I think there are studies on that already."}, {"time": 2761, "text": "Because it's not unethical to give it to rats."}, {"time": 2768, "text": "Oh, that's true."}, {"time": 2768, "text": "There's a lot of drugged up rats out there."}, {"time": 2775, "text": "So, there's these low level things from natural signals that... ...from which these properties will emerge."}, {"time": 2783, "text": "But it is still a very hard problem on how to encode that."}, {"time": 2793, "text": "So, you mentioned the priors Francho wanted to encode in the abstract reasoning challenge, but it is not straightforward how to encode those priors."}, {"time": 2804, "text": "So, some of those challenges, like the object completion challenges are things that we purely use our visual system to do."}, {"time": 2817, "text": "It looks like abstract reasoning, but it is purely an output of the vision system."}, {"time": 2817, "text": "For example, completing the corners of that condenser triangle, completing the lines of that condenser triangle."}, {"time": 2827, "text": "It's purely a visual system property."}, {"time": 2827, "text": "There is no abstract reasoning involved."}, {"time": 2827, "text": "It uses all these priors, but it is stored in our visual system in a particular way that is amenable to inference."}, {"time": 2838, "text": "That is one of the things that we tackled in the... Basically saying, okay, these are the prior knowledge which will be derived from the world, but then how is that prior knowledge represented in the model such that inference when some piece of evidence comes in can be done very efficiently and in a very distributed way?"}, {"time": 2858, "text": "Because there are so many ways of representing knowledge, which is not amenable to very quick inference, quick lookups."}, {"time": 2864, "text": "So that's one core part of what we tackled in the RCN model."}, {"time": 2873, "text": "How do you encode visual knowledge to do very quick inference?"}, {"time": 2882, "text": "Can you maybe comment on..."}, {"time": 2882, "text": "So folks listening to this in general may be familiar with different kinds of architectures of a neural networks."}, {"time": 2890, "text": "What are we talking about with RCN?"}, {"time": 2890, "text": "What does the architecture look like?"}, {"time": 2890, "text": "What are the different components?"}, {"time": 2896, "text": "Is it close to neural networks?"}, {"time": 2896, "text": "Is it far away from neural networks?"}, {"time": 2900, "text": "So you can think of the Delta between the model and a convolutional neural network, if people are familiar with convolutional neural networks."}, {"time": 2907, "text": "So convolutional neural networks have this feed forward processing cascade, which is called feature detectors and pooling."}, {"time": 2911, "text": "And that is repeated in a multi level system."}, {"time": 2917, "text": "And if you want an intuitive idea of what is happening, feature detectors are detecting interesting co occurrences in the input."}, {"time": 2926, "text": "It can be a line, a corner, an eye or a piece of texture, et cetera."}, {"time": 2933, "text": "And the pooling neurons are doing some local transformation of that and making it invariant to local transformations."}, {"time": 2943, "text": "So this is what the structure of convolutional neural network is."}, {"time": 2947, "text": "Recursive cortical network has a similar structure when you look at just the feed forward pathway."}, {"time": 2954, "text": "But in addition to that, it is also structured in a way that it is generative so that it can run it backward and combine the forward with the backward."}, {"time": 2965, "text": "Another aspect that it has is it has lateral connections."}, {"time": 2965, "text": "So if you have an edge here and an edge here, it has connections between these edges."}, {"time": 2977, "text": "It is not just feed forward connections."}, {"time": 2982, "text": "It is something between these edges, which is the nodes representing these edges, which is to enforce compatibility between them."}, {"time": 2989, "text": "So otherwise what will happen is that constraints."}, {"time": 2989, "text": "It's a constraint."}, {"time": 2993, "text": "It's basically if you do just feature detection followed by pooling, then your transformations in different parts of the visual field are not coordinated."}, {"time": 3001, "text": "And so you will create a jagged, when you generate from the model, you will create jagged things and uncoordinated transformations."}, {"time": 3014, "text": "So these lateral connections are enforcing the transformations."}, {"time": 3020, "text": "Is the whole thing still differentiable?"}, {"time": 3022, "text": "It's not trained using backprop."}, {"time": 3027, "text": "That's really important."}, {"time": 3027, "text": "So there's this feed forward, there's feedback mechanisms."}, {"time": 3033, "text": "There's some interesting connectivity things."}, {"time": 3033, "text": "It's still layered like multiple layers."}, {"time": 3041, "text": "Very, very interesting."}, {"time": 3041, "text": "So the interconnection between adjacent connections across service constraints that keep the thing stable."}, {"time": 3055, "text": "And then there's this idea of doing inference."}, {"time": 3055, "text": "A neural network does not do inference on the fly."}, {"time": 3063, "text": "So an example of why this inference is important is, you know, so one of the first applications that we showed in the paper was to crack text based captures."}, {"time": 3075, "text": "What are captures?"}, {"time": 3076, "text": "I mean, by the way, one of the most awesome, like the people don't use this term anymore as human computation, I think."}, {"time": 3081, "text": "I love this term."}, {"time": 3081, "text": "The guy who created captures, I think came up with this term."}, {"time": 3092, "text": "So captures are those things that you fill in when you're, you know, if you're opening a new account in Google, they show you a picture, you know, usually it used to be set of garbled letters that you have to kind of figure out what is that string of characters and type it."}, {"time": 3108, "text": "And the reason captures exist is because, you know, Google or Twitter do not want automatic creation of accounts."}, {"time": 3116, "text": "You can use a computer to create millions of accounts and use that for nefarious purposes."}, {"time": 3123, "text": "So you want to make sure that to the extent possible, the interaction that their system is having is with a human."}, {"time": 3130, "text": "So it's a, it's called a human interaction proof."}, {"time": 3136, "text": "A capture is a human interaction proof."}, {"time": 3136, "text": "So, so this is a captures are by design, things that are easy for humans to solve, but hard for computers."}, {"time": 3147, "text": "Hard for robots."}, {"time": 3148, "text": "So, and text based captures was the one which is prevalent around 2014, because at that time, text based captures were hard for computers to crack."}, {"time": 3156, "text": "Even now, they are actually in the sense of an arbitrary text based capture will be unsolvable even now, but with the techniques that we have developed, it can be, you know, you can quickly develop a mechanism that solves the capture."}, {"time": 3175, "text": "They've probably gotten a lot harder too."}, {"time": 3175, "text": "They've been getting clever and clever generating these text captures."}, {"time": 3180, "text": "So that was one of the things you've tested it on is these kinds of captures in 2014, 15, that kind of stuff."}, {"time": 3186, "text": "So what, I mean, why, by the way, why captures?"}, {"time": 3195, "text": "Even now, I would say capture is a very, very good challenge problem."}, {"time": 3195, "text": "If you want to understand how human perception works, and if you want to build systems that work, like the human brain, and I wouldn't say capture is a solved problem."}, {"time": 3207, "text": "We have cracked the fundamental defense of captures, but it is not solved in the way that humans solve it."}, {"time": 3212, "text": "So I can give an example."}, {"time": 3220, "text": "I can take a five year old child who has just learned characters and show them any new capture that we create."}, {"time": 3228, "text": "They will be able to solve it."}, {"time": 3228, "text": "I can show you, I can show you a picture of a character."}, {"time": 3236, "text": "I can show you pretty much any new capture from any new website."}, {"time": 3236, "text": "You'll be able to solve it without getting any training examples from that particular style of capture."}, {"time": 3246, "text": "You're assuming I'm human."}, {"time": 3248, "text": "So if you are human, otherwise I will be able to figure that out using this one."}, {"time": 3255, "text": "But this whole podcast is just a touring test, a long touring test."}, {"time": 3262, "text": "So humans can figure it out with very few examples."}, {"time": 3262, "text": "Or no training examples."}, {"time": 3262, "text": "No training examples from that particular style of capture."}, {"time": 3268, "text": "So even now this is unreachable for the current deep learning system."}, {"time": 3277, "text": "So basically there is no, I don't think a system exists where you can basically say, train on whatever you want."}, {"time": 3281, "text": "And then now say, hey, I will show you a new capture, which I did not show you in the training setup."}, {"time": 3287, "text": "Will the system be able to solve it?"}, {"time": 3287, "text": "It still doesn't exist."}, {"time": 3294, "text": "So that is the magic of human perception."}, {"time": 3294, "text": "And Doug Hofstadter put this very beautifully in one of his talks."}, {"time": 3301, "text": "The central problem in AI is what is the letter A."}, {"time": 3301, "text": "If you can build a system that reliably can detect all the variations of the letter A, you don't even know to go to the B and the C. Yeah."}, {"time": 3317, "text": "You don't even know to go to the B and the C or the strings of characters."}, {"time": 3323, "text": "And so that is the spirit with which we tackle that problem."}, {"time": 3328, "text": "What does it mean by that?"}, {"time": 3328, "text": "I mean, is it like without training examples, try to figure out the fundamental elements that make up the letter A in all of its forms?"}, {"time": 3343, "text": "In all of its forms."}, {"time": 3343, "text": "A can be made with two humans standing, leaning against each other, holding the hands."}, {"time": 3347, "text": "And it can be made of leaves."}, {"time": 3352, "text": "You might have to understand everything about this world in order to understand the letter A. Yeah."}, {"time": 3357, "text": "So it's common sense reasoning, essentially."}, {"time": 3360, "text": "So to finally, to really solve, finally to say that you have solved capture, you have to solve the whole problem."}, {"time": 3368, "text": "So how does this kind of the RCN architecture help us to do a better job of that kind of thing?"}, {"time": 3378, "text": "So as I mentioned, one of the important things was being able to do inference, being able to dynamically do inference."}, {"time": 3388, "text": "Can you clarify what you mean?"}, {"time": 3388, "text": "Because you said like neural networks don't do inference."}, {"time": 3393, "text": "So what do you mean by inference in this context then?"}, {"time": 3395, "text": "So in captures, what they do to confuse people is to make these characters crowd together."}, {"time": 3403, "text": "And when you make the characters crowd together, what happens is that you will now start seeing combinations of characters as some other new character or an existing character."}, {"time": 3408, "text": "So you would put an R and N together."}, {"time": 3413, "text": "It will start looking like an M. And so locally, there is very strong evidence for it being some incorrect character."}, {"time": 3422, "text": "But globally, the only explanation that fits together is something that is different from what you can find locally."}, {"time": 3431, "text": "So this is inference."}, {"time": 3438, "text": "You are basically taking local evidence and putting it in the global context and often coming to a conclusion locally, which is conflicting with the local information."}, {"time": 3449, "text": "So actually, so you mean inference like in the way it's used when you talk about reasoning, for example, as opposed to like inference, which is with artificial neural networks, which is a single pass to the network."}, {"time": 3462, "text": "So like you're basically doing some basic forms of reasoning, like integration of like how local things fit into the global picture."}, {"time": 3474, "text": "And things like explaining a way coming into this one, because you are explaining that piece of evidence as something else, because globally, that's the only thing that makes sense."}, {"time": 3479, "text": "So now you can amortize this inference in a neural network."}, {"time": 3488, "text": "If you want to do this, you can brute force it."}, {"time": 3495, "text": "You can just show it all combinations of things that you want your reasoning to work over."}, {"time": 3503, "text": "And you can just train the help out of that neural network and it will look like it is doing inference on the fly, but it is really just doing amortized inference."}, {"time": 3510, "text": "It is because you have shown it a lot of these combinations during training time."}, {"time": 3517, "text": "So what you want to do is be able to do dynamic inference rather than just being able to show all those combinations in the training time."}, {"time": 3528, "text": "And that's something we emphasized in the model."}, {"time": 3528, "text": "What does it mean, dynamic inference?"}, {"time": 3528, "text": "Is that that has to do with the feedback thing?"}, {"time": 3534, "text": "Like what is dynamic?"}, {"time": 3534, "text": "I'm trying to visualize what dynamic inference would be in this case."}, {"time": 3540, "text": "Like what is it doing with the input?"}, {"time": 3540, "text": "It's shown the input the first time."}, {"time": 3545, "text": "And is like what's changing over temporally?"}, {"time": 3545, "text": "What's the dynamics of this inference process?"}, {"time": 3553, "text": "So you can think of it as you have at the top of the model, the characters that you are trained on."}, {"time": 3559, "text": "They are the causes that you are trying to explain the pixels using the characters as the causes."}, {"time": 3566, "text": "The characters are the things that cause the pixels."}, {"time": 3566, "text": "So there's this causality thing."}, {"time": 3573, "text": "So the reason you mentioned causality, I guess, is because there's a temporal aspect to this whole thing."}, {"time": 3578, "text": "In this particular case, the temporal aspect is not important."}, {"time": 3583, "text": "It is more like when if I turn the character on, the pixels will turn on."}, {"time": 3583, "text": "Yeah, it will be after this a little bit."}, {"time": 3590, "text": "So that is causality in the sense of like a logic causality, like hence inference."}, {"time": 3595, "text": "The dynamics is that even though locally it will look like, okay, this is an A."}, {"time": 3603, "text": "And locally, just when I look at just that patch of the image, it looks like an A."}, {"time": 3603, "text": "But when I look at it in the context of all the other causes, A is not something that makes sense."}, {"time": 3611, "text": "So that is something you have to kind of recursively figure out."}, {"time": 3617, "text": "And this thing performed pretty well on the CAPTCHAs."}, {"time": 3624, "text": "And I mean, is there some kind of interesting intuition you can provide why it did well?"}, {"time": 3632, "text": "Like what did it look like?"}, {"time": 3632, "text": "Is there visualizations that could be human interpretable to us humans?"}, {"time": 3637, "text": "So the good thing about the model is that it is extremely, so it is not just doing a classification, right?"}, {"time": 3644, "text": "It is providing a full explanation for the scene."}, {"time": 3650, "text": "So when it operates on a scene, it is coming back and saying, look, this is the part is the A, and these are the pixels that turned on."}, {"time": 3659, "text": "These are the pixels in the input that makes me think that it is an A."}, {"time": 3666, "text": "And also, these are the portions I hallucinated."}, {"time": 3666, "text": "It provides a complete explanation of that form."}, {"time": 3674, "text": "And then these are the contours."}, {"time": 3674, "text": "This is the interior."}, {"time": 3674, "text": "And this is in front of this other object."}, {"time": 3681, "text": "So that's the kind of explanation the inference network provides."}, {"time": 3688, "text": "So that is useful and interpretable."}, {"time": 3688, "text": "And then the kind of errors it makes are also, I don't want to read too much into it, but the kind of errors the network makes are very similar to the kinds of errors humans would make in a similar situation."}, {"time": 3707, "text": "So there's something about the structure that feels reminiscent of the way humans visual system works."}, {"time": 3711, "text": "Well, I mean, how hardcoded is this to the capture problem, this idea?"}, {"time": 3724, "text": "Not really hardcoded because the assumptions, as I mentioned, are general, right?"}, {"time": 3724, "text": "It is more, and those themselves can be applied in many situations which are natural signals."}, {"time": 3731, "text": "So it's the foreground versus background factorization and the factorization of the surfaces versus the contours."}, {"time": 3744, "text": "So these are all generally applicable assumptions."}, {"time": 3747, "text": "In all vision."}, {"time": 3747, "text": "So why attack the capture problem, which is quite unique in the computer vision context versus like the traditional benchmarks of ImageNet and all those kinds of image classification or even segmentation tasks and all of that kind of stuff."}, {"time": 3762, "text": "What's your thinking about those kinds of benchmarks in this context?"}, {"time": 3769, "text": "I mean, those benchmarks are useful for deep learning kind of algorithms."}, {"time": 3775, "text": "So the settings that deep learning works in are here is my huge training set and here is my test set."}, {"time": 3783, "text": "So the training set is almost 100x, 1000x bigger than the test set in many, many cases."}, {"time": 3790, "text": "What we wanted to do was invert that."}, {"time": 3790, "text": "The training set is way smaller than the test set."}, {"time": 3798, "text": "And capture is a problem that is by definition hard for computers and it has these good properties of strong generalization, strong out of training distribution generalization."}, {"time": 3816, "text": "If you are interested in studying that and having your model have that property, then it's a good data set to tackle."}, {"time": 3824, "text": "So have you attempted to, which I think, I believe there's quite a growing body of work on looking at MNIST and ImageNet without training."}, {"time": 3838, "text": "So it's like taking the basic challenge is what tiny fraction of the training set can we take in order to do a reasonable job of the classification task?"}, {"time": 3845, "text": "Have you explored that angle in these classic benchmarks?"}, {"time": 3853, "text": "So we did do MNIST."}, {"time": 3853, "text": "So it's not just capture."}, {"time": 3853, "text": "So there was also multiple versions of MNIST, including the standard version where we inverted the problem, which is basically saying rather than train on 60,000 training data, how quickly can you get to high level accuracy with very little training data?"}, {"time": 3877, "text": "Is there some performance you remember, like how well did it do?"}, {"time": 3882, "text": "How many examples did it need?"}, {"time": 3882, "text": "I remember that it was on the order of tens or hundreds of examples to get into 95% accuracy."}, {"time": 3890, "text": "And it was definitely better than the other systems out there at that time."}, {"time": 3903, "text": "At that time."}, {"time": 3903, "text": "They're really pushing."}, {"time": 3903, "text": "I think that's a really interesting space, actually."}, {"time": 3907, "text": "I think there's an actual name for MNIST."}, {"time": 3907, "text": "There's different names to the different sizes of training sets."}, {"time": 3917, "text": "I mean, people are like attacking this problem."}, {"time": 3917, "text": "I think it's super interesting."}, {"time": 3921, "text": "It's funny how like the MNIST will probably be with us all the way to AGI."}, {"time": 3929, "text": "It's a data set that just sticks by."}, {"time": 3929, "text": "It's a clean, simple data set to study the fundamentals of learning with just like captures."}, {"time": 3937, "text": "Not enough people."}, {"time": 3937, "text": "Maybe you can correct me, but I feel like captures don't show up as often in papers as they probably should."}, {"time": 3948, "text": "Because usually these things have a momentum."}, {"time": 3948, "text": "Once something gets established as a standard benchmark, there is a dynamics of how graduate students operate and how academic system works that pushes people to track that benchmark."}, {"time": 3970, "text": "Nobody wants to think outside the box."}, {"time": 3970, "text": "So good performance on the captures."}, {"time": 3980, "text": "What else is there interesting on the RCN side before we talk about the cortical micros?"}, {"time": 3985, "text": "So the same model."}, {"time": 3985, "text": "So the important part of the model was that it trains very quickly with very little training data and it's quite robust to out of distribution perturbations."}, {"time": 3997, "text": "And we are using that very fruitfully at Vicarious in many of the robotics tasks we are solving."}, {"time": 4005, "text": "Well, let me ask you this kind of touchy question."}, {"time": 4005, "text": "I have to, I've spoken with your friend, colleague, Jeff Hawkins, too."}, {"time": 4011, "text": "I have to kind of ask, there is a bit of, whenever you have brain inspired stuff and you make big claims, big sexy claims, there's critics, I mean, machine learning subreddit, don't get me started on those people."}, {"time": 4034, "text": "Criticism is good, but they're a bit over the top."}, {"time": 4034, "text": "There is quite a bit of sort of skepticism and criticism."}, {"time": 4043, "text": "Is this work really as good as it promises to be?"}, {"time": 4043, "text": "Do you have thoughts on that kind of skepticism?"}, {"time": 4051, "text": "Do you have comments on the kind of criticism I might have received about, you know, is this approach legit?"}, {"time": 4056, "text": "Is this a promising approach?"}, {"time": 4056, "text": "Or at least as promising as it seems to be, you know, advertised as?"}, {"time": 4064, "text": "Yeah, I can comment on it."}, {"time": 4064, "text": "So, you know, our RCN paper is published in Science, which I would argue is a very high quality journal, very hard to publish in."}, {"time": 4078, "text": "And, you know, usually it is indicative of the quality of the work."}, {"time": 4116, "text": "I think that will stay and that contribution I stand by."}, {"time": 4120, "text": "Now, I can tell you a story which is funny in the context of this."}, {"time": 4120, "text": "So, if you read the abstract of the paper and, you know, the argument we are putting in, you know, we are putting in, look, current deep learning systems take a lot of training data."}, {"time": 4133, "text": "They don't use these insights."}, {"time": 4139, "text": "And here is our new model, which is not a deep neural network."}, {"time": 4139, "text": "It's a graphical model."}, {"time": 4143, "text": "It does inference."}, {"time": 4143, "text": "This is how the paper is, right?"}, {"time": 4143, "text": "Now, once the paper was accepted and everything, it went to the press department in Science, you know, AAAS Science Office."}, {"time": 4154, "text": "We didn't do any press release when it was published."}, {"time": 4154, "text": "It went to the press department."}, {"time": 4158, "text": "What was the press release that they wrote up?"}, {"time": 4158, "text": "A new deep learning model."}, {"time": 4165, "text": "And so, you can see where was, you know, what was being hyped in that thing, right?"}, {"time": 4172, "text": "So, there is a dynamic in the community of, you know, so that especially happens when there are lots of new people coming into the field and they get attracted to one thing."}, {"time": 4186, "text": "And some people are trying to think different compared to that."}, {"time": 4186, "text": "So, there is some, I think skepticism is science is important and it is, you know, very much required."}, {"time": 4192, "text": "But it's also, it's not skepticism."}, {"time": 4199, "text": "Usually, it's mostly bandwagon effect that is happening rather than."}, {"time": 4205, "text": "Well, but that's not even that."}, {"time": 4205, "text": "I mean, I'll tell you what they react to, which is like, I'm sensitive to as well."}, {"time": 4209, "text": "If you look at just companies, OpenAI, DeepMind, Vicarious, I mean, they just, there's a little bit of a race to the top and hype, right?"}, {"time": 4216, "text": "It's like, it doesn't pay off to be humble."}, {"time": 4227, "text": "So, like, and the press is just irresponsible often."}, {"time": 4227, "text": "They just, I mean, don't get me started on the state of journalism today."}, {"time": 4237, "text": "Like, it seems like the people who write articles about these things, they literally have not even spent an hour on the Wikipedia article about what is neural networks."}, {"time": 4249, "text": "Like, they haven't like invested just even the language to laziness."}, {"time": 4256, "text": "It's like, robots beat humans."}, {"time": 4256, "text": "Like, they write this kind of stuff that just, and then of course, the researchers are quite sensitive to that because it gets a lot of attention."}, {"time": 4266, "text": "They're like, why did this word get so much attention?"}, {"time": 4271, "text": "That's over the top and people get really sensitive."}, {"time": 4278, "text": "The same kind of criticism with OpenAI did work with Rubik's cube with the robot that people criticized."}, {"time": 4284, "text": "Same with GPT2 and 3, they criticize."}, {"time": 4284, "text": "Same thing with DeepMinds with AlphaZero."}, {"time": 4284, "text": "I mean, yeah, I'm sensitive to it."}, {"time": 4293, "text": "But, and of course, with your work, you mentioned deep learning, but there's something super sexy to the public about brain inspired."}, {"time": 4299, "text": "I mean, that immediately grabs people's imagination, not even like neural networks, but like really brain inspired, like brain like neural networks."}, {"time": 4313, "text": "That seems really compelling to people and to me as well, to the world as a narrative."}, {"time": 4320, "text": "And so people hook up, hook onto that."}, {"time": 4320, "text": "And sometimes the skepticism engine turns on in the research community and they're skeptical."}, {"time": 4330, "text": "But I think putting aside the ideas of the actual performance and captures or performance in any data set."}, {"time": 4337, "text": "I mean, to me, all these data sets are useless anyway."}, {"time": 4342, "text": "It's nice to have them."}, {"time": 4342, "text": "But in the grand scheme of things, they're silly toy examples."}, {"time": 4348, "text": "The point is, is there intuition about the ideas, just like you mentioned, bringing the ideas together in a unique way?"}, {"time": 4356, "text": "Is there something there?"}, {"time": 4356, "text": "Is there some value there?"}, {"time": 4362, "text": "And is it going to stand the test of time?"}, {"time": 4362, "text": "And that's the hope."}, {"time": 4366, "text": "My confidence there is very high."}, {"time": 4366, "text": "I don't treat brain inspired as a marketing term."}, {"time": 4373, "text": "I am looking into the details of biology and puzzling over those things and I am grappling with those things."}, {"time": 4381, "text": "And so it is not a marketing term at all."}, {"time": 4381, "text": "You can use it as a marketing term and people often use it and you can get combined with them."}, {"time": 4387, "text": "And when people don't understand how you're approaching the problem, it is easy to be misunderstood and think of it as purely marketing."}, {"time": 4400, "text": "But that's not the way we are."}, {"time": 4400, "text": "So you really, I mean, as a scientist, you believe that if we kind of just stick to really understanding the brain, that's going to, that's the right, like you should constantly meditate on the, how does the brain do this?"}, {"time": 4419, "text": "Because that's going to be really helpful for engineering and technology systems."}, {"time": 4423, "text": "You need to, so I think it's one input and it is helpful, but you should know when to deviate from it too."}, {"time": 4431, "text": "So an example is convolutional neural networks, right?"}, {"time": 4431, "text": "Convolution is not an operation brain implements."}, {"time": 4439, "text": "The visual cortex is not convolutional."}, {"time": 4439, "text": "Visual cortex has local receptive fields, local connectivity, but there is no translation invariance in the network weights in the visual cortex."}, {"time": 4458, "text": "That is a computational trick, which is a very good engineering trick that we use for sharing the training between the different nodes."}, {"time": 4464, "text": "And that trick will be with us for some time."}, {"time": 4471, "text": "It will go away when we have robots with eyes and heads that move."}, {"time": 4471, "text": "And so then that trick will go away."}, {"time": 4481, "text": "It will not be useful at that time."}, {"time": 4481, "text": "So the brain doesn't have translational invariance."}, {"time": 4489, "text": "It has the focal point, like it has a thing it focuses on."}, {"time": 4489, "text": "It has a phobia."}, {"time": 4494, "text": "And because of the phobia, the receptive fields are not like the copying of the weights."}, {"time": 4494, "text": "Like the weights in the center are very different from the weights in the periphery."}, {"time": 4501, "text": "At the periphery."}, {"time": 4505, "text": "I mean, I did this, actually wrote a paper and just gotten a chance to really study peripheral vision, which is a fascinating thing."}, {"time": 4512, "text": "Very under understood thing of what the brain, you know, at every level the brain does with the periphery."}, {"time": 4521, "text": "It does some funky stuff."}, {"time": 4521, "text": "So it's another kind of trick than convolutional."}, {"time": 4528, "text": "Like it does, it's, you know, convolution in neural networks is a trick for efficiency, is efficiency trick."}, {"time": 4539, "text": "And the brain does a whole nother kind of thing."}, {"time": 4544, "text": "So you need to understand the principles or processing so that you can still apply engineering tricks where you want it to."}, {"time": 4551, "text": "You don't want to be slavishly mimicking all the things of the brain."}, {"time": 4555, "text": "And so, yeah, so it should be one input."}, {"time": 4555, "text": "And I think it is extremely helpful, but it should be the point of really understanding so that you know when to deviate from it."}, {"time": 4566, "text": "That's really cool."}, {"time": 4566, "text": "That's work from a few years ago."}, {"time": 4566, "text": "You did work in Umenta with Jeff Hawkins with hierarchical temporal memory."}, {"time": 4574, "text": "How is your just, if you could give a brief history, how is your view of the way the models of the brain changed over the past few years leading up to now?"}, {"time": 4590, "text": "Is there some interesting aspects where there was an adjustment to your understanding of the brain or is it all just building on top of each other?"}, {"time": 4596, "text": "In terms of the higher level ideas, especially the ones Jeff wrote about in the book, if you blur out, right."}, {"time": 4607, "text": "If you blur out the details and if you just zoom out and at the higher level idea, things are, I would say, consistent with what he wrote about."}, {"time": 4612, "text": "But many things will be consistent with that because it's a blur."}, {"time": 4622, "text": "Deep learning systems are also multi level, hierarchical, all of those things."}, {"time": 4628, "text": "But in terms of the detail, a lot of things are different."}, {"time": 4636, "text": "And those details matter a lot."}, {"time": 4636, "text": "So one point of difference I had with Jeff was how to approach, how much of biological plausibility and realism do you want in the learning algorithms?"}, {"time": 4656, "text": "So when I was there, this was almost 10 years ago now."}, {"time": 4661, "text": "It flies when you're having fun."}, {"time": 4663, "text": "I don't know what Jeff thinks now, but 10 years ago, the difference was that I did not want to be so constrained on saying my learning algorithms need to be biologically plausible based on some filter of biological plausibility available at that time."}, {"time": 4683, "text": "To me, that is a dangerous cut to make because we are discovering more and more things about the brain all the time."}, {"time": 4689, "text": "New biophysical mechanisms, new channels are being discovered all the time."}, {"time": 4694, "text": "So I don't want to upfront kill off a learning algorithm just because we don't really understand the full biophysics or whatever of how the brain learns."}, {"time": 4709, "text": "Let me ask and I'm sorry to interrupt."}, {"time": 4709, "text": "What's our best understanding of how the brain learns?"}, {"time": 4716, "text": "So things like backpropagation, credit assignment."}, {"time": 4716, "text": "So many of these algorithms have, learning algorithms have things in common, right?"}, {"time": 4722, "text": "It is a backpropagation is one way of credit assignment."}, {"time": 4727, "text": "There is another algorithm called expectation maximization, which is, you know, another weight adjustment algorithm."}, {"time": 4735, "text": "But is it your sense the brain does something like this?"}, {"time": 4738, "text": "Has to."}, {"time": 4738, "text": "There is no way around it in the sense of saying that you do have to adjust the connections."}, {"time": 4746, "text": "So yeah, and you're saying credit assignment, you have to reward the connections that were useful in making a correct prediction and not, yeah, I guess what else, but yeah, it doesn't have to be differentiable."}, {"time": 4756, "text": "Yeah, it doesn't have to be differentiable."}, {"time": 4756, "text": "But you have to have a, you know, you have a model that you start with, you have data comes in and you have to have a way of adjusting the model such that it better fits the data."}, {"time": 4767, "text": "So that is all of learning, right?"}, {"time": 4773, "text": "And some of them can be using backprop to do that."}, {"time": 4773, "text": "Some of it can be using, you know, very local graph changes to do that."}, {"time": 4785, "text": "That can be, you know, many of these learning algorithms have similar update properties locally in terms of what the neurons need to do locally."}, {"time": 4797, "text": "I wonder if small differences in learning algorithms can have huge differences in the actual effect."}, {"time": 4801, "text": "So the dynamics of, I mean, sort of the reverse like spiking, like if credit assignment is like a lightning versus like a rainstorm or something, like whether there's like a looping local type of situation with the credit assignment, whether there is like regularization, like how it injects robustness into the whole thing, like whether it's chemical or electrical or mechanical."}, {"time": 4834, "text": "All those kinds of things."}, {"time": 4834, "text": "I feel like it, that, yeah, I feel like those differences could be essential, right?"}, {"time": 4842, "text": "It's just that you don't know enough to, on the learning side, you don't know, you don't know enough to say that is definitely not the way the brain does it."}, {"time": 4854, "text": "So you don't want to be stuck to it."}, {"time": 4859, "text": "So that, yeah."}, {"time": 4859, "text": "So you've been open minded on that side of things."}, {"time": 4864, "text": "On the inference side, on the recognition side, I am much more, I'm able to be constrained because it's much easier to do experiments because, you know, it's like, okay, here's the stimulus, you know, how many steps did it get to take the answer?"}, {"time": 4873, "text": "I can trace it back."}, {"time": 4878, "text": "I can, I can understand the speed of that computation, et cetera."}, {"time": 4878, "text": "I'm able to do of that computation, et cetera, much more readily on the inference side."}, {"time": 4883, "text": "And then you can't do good experiments on the learning side."}, {"time": 4888, "text": "So let's go right into the cortical microcircuits right back."}, {"time": 4894, "text": "So what are these ideas beyond recursive cortical network that you're looking at now?"}, {"time": 4902, "text": "So we have made a, you know, pass through multiple of the steps that, you know, as I mentioned earlier, you know, we were looking at perception from the angle of cognition, right?"}, {"time": 4914, "text": "It was not just perception for perception's sake."}, {"time": 4918, "text": "How do you, how do you connect it to cognition?"}, {"time": 4918, "text": "How do you learn concepts and how do you learn abstract reasoning?"}, {"time": 4924, "text": "Similar to some of the things Francois talked about, right?"}, {"time": 4924, "text": "So we have taken one pass through it basically saying, what is the basic cognitive architecture that you need to have, which has a perceptual system, which has a system that learns dynamics of the world and then has something like a routine program learning system on top of it to learn concepts."}, {"time": 4952, "text": "So we have built one, you know, the version point one of that system."}, {"time": 4952, "text": "This was another science robotics paper."}, {"time": 4958, "text": "It's the title of that paper was, you know, something like cognitive programs."}, {"time": 4964, "text": "How do you build cognitive programs?"}, {"time": 4964, "text": "And the application there was on manipulation, robotic manipulation?"}, {"time": 4969, "text": "It was, so think of it like this."}, {"time": 4969, "text": "Suppose you wanted to tell a new person that you met, you don't know the language that person uses."}, {"time": 4984, "text": "You want to communicate to that person to achieve some task, right?"}, {"time": 4984, "text": "So I want to say, hey, you need to pick up all the red cups from the kitchen counter and put it here, right?"}, {"time": 4997, "text": "How do you communicate that, right?"}, {"time": 4997, "text": "You can show pictures."}, {"time": 4997, "text": "You can basically say, look, this is the starting state."}, {"time": 5001, "text": "The things are here."}, {"time": 5001, "text": "This is the ending state."}, {"time": 5001, "text": "And what does the person need to understand from that?"}, {"time": 5008, "text": "The person needs to understand what conceptually happened in those pictures from the input to the output, right?"}, {"time": 5012, "text": "So we are looking at preverbal conceptual understanding."}, {"time": 5019, "text": "Without language, how do you have a set of concepts that you can manipulate in your head?"}, {"time": 5025, "text": "And from a set of images of input and output, can you infer what is happening in those images?"}, {"time": 5035, "text": "With concepts that are pre language."}, {"time": 5035, "text": "So what's it mean for a concept to be pre language?"}, {"time": 5042, "text": "Like why is language so important here?"}, {"time": 5050, "text": "So I want to make a distinction between concepts that are just learned from text by just feeding brute force text."}, {"time": 5057, "text": "You can start extracting things like, okay, a cow is likely to be on grass."}, {"time": 5063, "text": "So those kinds of things, you can extract purely from text."}, {"time": 5072, "text": "But that's kind of a simple association thing rather than a concept as an abstraction of something that happens in the real world in a grounded way that I can simulate it in my mind and connect it back to the real world."}, {"time": 5084, "text": "And you think kind of the visual world, concepts in the visual world are somehow lower level than just the language?"}, {"time": 5098, "text": "The lower level kind of makes it feel like, okay, that's unimportant."}, {"time": 5098, "text": "It's more like, I would say the concepts in the visual and the motor system and the concept learning system, which if you cut off the language part, just what we learn by interacting with the world and abstractions from that, that is a prerequisite for any real language understanding."}, {"time": 5126, "text": "So you disagree with Chomsky because he says language is at the bottom of everything."}, {"time": 5132, "text": "No, I disagree with Chomsky completely on how many levels from universal grammar to..."}, {"time": 5139, "text": "So that was a paper in science beyond the recursive cortical network."}, {"time": 5143, "text": "What other interesting problems are there, the open problems and brain inspired approaches that you're thinking about?"}, {"time": 5151, "text": "I mean, everything is open, right?"}, {"time": 5151, "text": "No problem is solved, solved."}, {"time": 5151, "text": "I think of perception as kind of the first thing that you have to build, but the last thing that you will be actually solved."}, {"time": 5167, "text": "Because if you do not build perception system in the right way, you cannot build concept system in the right way."}, {"time": 5172, "text": "So you have to build a perception system, however wrong that might be, you have to still build that and learn concepts from there and then keep iterating."}, {"time": 5178, "text": "And finally, perception will get solved fully when perception, cognition, language, all those things work together finally."}, {"time": 5190, "text": "So great, we've talked a lot about perception, but then maybe on the concept side and like common sense or just general reasoning side, is there some intuition you can draw from the brain about how we can do that?"}, {"time": 5206, "text": "So I have this classic example I give."}, {"time": 5206, "text": "So suppose I give you a few sentences and then ask you a question following that sentence."}, {"time": 5216, "text": "This is a natural language processing problem, right?"}, {"time": 5216, "text": "So here it goes."}, {"time": 5221, "text": "I'm telling you, Sally pounded a nail on the ceiling."}, {"time": 5221, "text": "Okay, that's a sentence."}, {"time": 5221, "text": "Now I'm asking you a question."}, {"time": 5230, "text": "Was the nail horizontal or vertical?"}, {"time": 5234, "text": "Vertical."}, {"time": 5235, "text": "Okay, how did you answer that?"}, {"time": 5236, "text": "Well, I imagined Sally, it was kind of hard to imagine what the hell she was doing, but I imagined I had a visual of the whole situation."}, {"time": 5248, "text": "So here, you know, I post a question in natural language."}, {"time": 5248, "text": "The answer to that question was you got the answer from actually simulating the scene."}, {"time": 5254, "text": "Now I can go more and more detailed about, okay, was Sally standing on something while doing this?"}, {"time": 5260, "text": "Could she have been standing on a light bulb to do this?"}, {"time": 5267, "text": "I could ask more and more questions about this and I can ask, make you simulate the scene in more and more detail, right?"}, {"time": 5273, "text": "Where is all that knowledge that you're accessing stored?"}, {"time": 5279, "text": "It is not in your language system."}, {"time": 5279, "text": "It was not just by reading text, you got that knowledge."}, {"time": 5285, "text": "It is stored from the everyday experiences that you have had from, and by the age of five, you have pretty much all of this, right?"}, {"time": 5292, "text": "And it is stored in your visual system, motor system in a way such that it can be accessed through language."}, {"time": 5304, "text": "So the language is just almost sort of the query into the whole visual cortex and that does the whole feedback thing."}, {"time": 5310, "text": "But I mean, it is all reasoning kind of connected to the perception system in some way."}, {"time": 5316, "text": "You can do a lot of it."}, {"time": 5316, "text": "You know, you can still do a lot of it by quick associations without having to go into the depth."}, {"time": 5323, "text": "And most of the time you will be right, right?"}, {"time": 5329, "text": "You can just do quick associations, but I can easily create tricky situations for you."}, {"time": 5335, "text": "Where that quick associations is wrong and you have to actually run the simulation."}, {"time": 5340, "text": "So figuring out how these concepts connect."}, {"time": 5340, "text": "Do I have a good idea of how to do that?"}, {"time": 5346, "text": "That's exactly one of the problems that we are working on."}, {"time": 5346, "text": "And the way we are approaching that is basically saying, okay, you need to, so the takeaway is that language, is simulation control and your perceptual plus a motor system is building a simulation of the world."}, {"time": 5368, "text": "And so that's basically the way we are approaching it."}, {"time": 5368, "text": "And the first thing that we built was a controllable perceptual system."}, {"time": 5374, "text": "And we built a schema networks, which was a controllable dynamic system."}, {"time": 5380, "text": "Then we built a concept learning system that puts all these things together into programs or subtractions that you can run and simulate."}, {"time": 5384, "text": "And now we are taking the step of connecting it to language."}, {"time": 5391, "text": "And it will be very simple examples."}, {"time": 5391, "text": "Initially, it will not be the GPT3 like examples, but it will be grounded simulation based language."}, {"time": 5402, "text": "And for like the querying would be like question answering kind of thing?"}, {"time": 5408, "text": "And so that's what we're trying to do."}, {"time": 5408, "text": "We're trying to build a system kind of thing."}, {"time": 5413, "text": "And it will be in some simple world initially on, you know, but it will be about, okay, can the system connect the language and ground it in the right way and run the right simulations to come up with the answer."}, {"time": 5425, "text": "And the goal is to try to do things that, for example, GPT3 couldn't do."}, {"time": 5429, "text": "Speaking of which, if we could talk about GPT3 a little bit, I think it's an interesting thought provoking set of ideas that OpenAI is pushing forward."}, {"time": 5438, "text": "I think it's good for us to talk about the limits and the possibilities in the neural network."}, {"time": 5446, "text": "So in general, what are your thoughts about this recently released very large 175 billion parameter language model?"}, {"time": 5458, "text": "So I haven't directly evaluated it yet."}, {"time": 5458, "text": "From what I have seen on Twitter and other people evaluating it, it looks very intriguing."}, {"time": 5465, "text": "I am very intrigued by some of the properties it is displaying."}, {"time": 5469, "text": "And of course the text generation part of that was already evident in GPT2 that it can generate coherent text over long distances."}, {"time": 5477, "text": "But of course the weaknesses are also pretty visible in saying that, okay, it is not really carrying a world state around."}, {"time": 5492, "text": "And sometimes you get sentences like, I went up the hill to reach the valley or the thing like some completely incompatible statements, or when you're traveling from one place to the other, it doesn't take into account the time of travel, things like that."}, {"time": 5506, "text": "So those things I think will happen less in GPT3 because it is trained on even more data and it can do even more longer distance coherence."}, {"time": 5519, "text": "But it will still have the fundamental limitations that it doesn't have a world model and it can't run simulations in its head to find whether something is true in the world or not."}, {"time": 5533, "text": "So it's taking a huge amount of text from the internet and forming a compressed representation."}, {"time": 5540, "text": "Do you think in that could emerge something that's an approximation of a world model, which essentially could be used for reasoning?"}, {"time": 5547, "text": "I'm not talking about GPT3, I'm talking about GPT4, 5 and GPT10."}, {"time": 5555, "text": "Yeah, I mean they will look more impressive than GPT3."}, {"time": 5555, "text": "So if you take that to the extreme then a Markov chain of just first order and if you go to, I'm taking the other extreme, if you read Shannon's book, he has a model of English text which is based on first order Markov chains, second order Markov chains, third order Markov chains and saying that okay, third order Markov chains look better than first order Markov chains."}, {"time": 5583, "text": "So does that mean a first order Markov chain has a model of the world?"}, {"time": 5589, "text": "So yes, in that level when you go higher order models or more sophisticated structure in the model like the transformer networks have, yes they have a model of the text world, but that is not a model of the world."}, {"time": 5604, "text": "It's a model of the text world and it will have interesting properties and it will be useful, but just scaling it up is not going to give us AGI or natural language understanding or meaning."}, {"time": 5621, "text": "Well the question is whether being forced to compress a very large amount of text forces you to construct things that are very much like, because the ideas of concepts and meaning is a spectrum."}, {"time": 5646, "text": "So in order to form that kind of compression, maybe it will be forced to figure out abstractions which look awfully a lot like the kind of things that we think about as concepts, as world models, as common sense."}, {"time": 5671, "text": "No, I don't think it is possible because the information is not there."}, {"time": 5674, "text": "The information is there behind the text, right?"}, {"time": 5678, "text": "No, unless somebody has written down all the details about how everything works in the world to the absurd amounts like, okay, it is easier to walk forward than backward, that you have to open the door to go out of the thing, doctors wear underwear."}, {"time": 5691, "text": "Unless all these things somebody has written down somewhere or somehow the program found it to be useful for compression from some other text, the information is not there."}, {"time": 5701, "text": "So that's an argument that text is a lot lower fidelity than the experience of our physical world."}, {"time": 5713, "text": "Right, correct."}, {"time": 5713, "text": "Pictures worth a thousand words."}, {"time": 5717, "text": "Well, in this case, pictures aren't really..."}, {"time": 5717, "text": "So the richest aspect of the physical world isn't even just pictures, it's the interactivity with the world."}, {"time": 5729, "text": "It's being able to interact."}, {"time": 5729, "text": "It's almost like..."}, {"time": 5736, "text": "It's almost like if you could interact... Well, maybe I agree with you that pictures worth a thousand words, but a thousand..."}, {"time": 5745, "text": "It's still... Yeah, you could capture it with the GPTX."}, {"time": 5749, "text": "So I wonder if there's some interactive element where a system could live in text world where it could be part of the chat, be part of talking to people."}, {"time": 5754, "text": "I mean, fundamentally..."}, {"time": 5763, "text": "So you're making a statement about the limitation of text."}, {"time": 5763, "text": "Okay, so let's say we have a text corpus that includes basically every experience we could possibly have."}, {"time": 5770, "text": "I mean, just a very large corpus of text and also interactive components."}, {"time": 5779, "text": "I guess the question is whether the neural network architecture, these very simple transformers, but if they had like hundreds of trillions or whatever comes after a trillion parameters, whether that could store the information needed, that's architecturally."}, {"time": 5802, "text": "Do you have thoughts about the limitation on that side of things with neural networks?"}, {"time": 5806, "text": "I mean, so transformers are still a feed forward neural network."}, {"time": 5812, "text": "It has a very interesting architecture, which is good for text modeling and probably some aspects of video modeling, but it is still a feed forward architecture."}, {"time": 5819, "text": "You believe in the feedback mechanism, the recursion."}, {"time": 5824, "text": "Oh, and also causality, being able to do counterfactual reasoning, being able to do interventions, which is actions in the world."}, {"time": 5831, "text": "So all those things require different kinds of models to be built."}, {"time": 5840, "text": "I don't think transformers captures that family."}, {"time": 5840, "text": "It is very good at statistical modeling of text and it will become better and better with more data, bigger models, but that is only going to get so far."}, {"time": 5855, "text": "So I had this joke on Twitter saying that, hey, this is a model that has read all of quantum mechanics and theory of relativity and we are asking you to do text completion or we are asking you to solve simple puzzles."}, {"time": 5871, "text": "When you have AGI, that is not what you ask the system to do."}, {"time": 5879, "text": "We will ask the system to do experiments and come up with hypothesis and revise the hypothesis based on evidence from experiments, all those things."}, {"time": 5893, "text": "Those are the things that we want the system to do when we have AGI, not solve simple puzzles."}, {"time": 5900, "text": "Like impressive demos, somebody generating a red button in HTML."}, {"time": 5904, "text": "Right, which are all useful."}, {"time": 5904, "text": "There is no dissing the usefulness of it."}, {"time": 5909, "text": "So by the way, I am playing a little bit of a devil's advocate, so calm down internet."}, {"time": 5917, "text": "So I am curious almost in which ways will a dumb but large neural network will surprise us."}, {"time": 5927, "text": "I completely agree with your intuition."}, {"time": 5927, "text": "It is just that I do not want to dogmatically 100% put all the chips there."}, {"time": 5938, "text": "We have been surprised so much."}, {"time": 5938, "text": "Even the current GPT2 and GPT3 are so surprising."}, {"time": 5946, "text": "The self play mechanisms of AlphaZero are really surprising."}, {"time": 5946, "text": "The fact that reinforcement learning works at all to me is really surprising."}, {"time": 5958, "text": "The fact that neural networks work at all is quite surprising given how nonlinear the space is, the fact that it is able to find local minima that are at all reasonable."}, {"time": 5970, "text": "It is very surprising."}, {"time": 5970, "text": "I wonder sometimes whether us humans just want for AGI not to be such a dumb thing."}, {"time": 5979, "text": "Because exactly what you are saying is like the ideas of concepts and be able to reason with those concepts and connect those concepts in hierarchical ways and then to be able to have world models."}, {"time": 5997, "text": "Just everything we are describing in human language in this poetic way seems to make sense."}, {"time": 6005, "text": "That is what intelligence and reasoning are like."}, {"time": 6011, "text": "I wonder if at the core of it, it could be much dumber."}, {"time": 6011, "text": "Well, finally it is still connections and messages passing over."}, {"time": 6017, "text": "So in that way it is dumb."}, {"time": 6017, "text": "So I guess the recursion, the feedback mechanism, that does seem to be a fundamental kind of thing."}, {"time": 6032, "text": "The idea of concepts."}, {"time": 6032, "text": "Also memory."}, {"time": 6032, "text": "Having an episodic memory."}, {"time": 6032, "text": "That seems to be an important thing."}, {"time": 6039, "text": "So how do we get memory?"}, {"time": 6039, "text": "So we have another piece of work which came out recently on how do you form episodic memories and form abstractions from them."}, {"time": 6052, "text": "And we haven't figured out all the connections of that to the overall cognitive architecture."}, {"time": 6057, "text": "But what are your ideas about how you could have episodic memory?"}, {"time": 6057, "text": "So at least it is very clear that you need to have two kinds of memory."}, {"time": 6064, "text": "That is very, very clear."}, {"time": 6064, "text": "There are things that happen as statistical patterns in the world, but then there is the one timeline of things that happen only once in your life."}, {"time": 6079, "text": "And this day is not going to happen ever again."}, {"time": 6079, "text": "And that needs to be stored as just a stream of strings."}, {"time": 6087, "text": "This is my experience."}, {"time": 6087, "text": "And then the question is about how do you take that experience and connect it to the statistical part of it?"}, {"time": 6096, "text": "How do you now say that, okay, I experienced this thing."}, {"time": 6100, "text": "Now I want to be careful about similar situations."}, {"time": 6107, "text": "So you need to be able to index that similarity using your other giants that is the model of the world that you have learned."}, {"time": 6117, "text": "Although the situation came from the episode, you need to be able to index the other one."}, {"time": 6122, "text": "So the episodic memory being implemented as an indexing over the other model that you're building."}, {"time": 6133, "text": "So the memories remain and they're indexed into the statistical thing that you form."}, {"time": 6144, "text": "Yeah, statistical causal structural model that you built over time."}, {"time": 6144, "text": "So it's basically the idea is that the hippocampus is just storing or sequencing a set of pointers that happens over time."}, {"time": 6161, "text": "And then whenever you want to reconstitute that memory and evaluate the different aspects of it, whether it was good, bad, do I need to encounter the situation again?"}, {"time": 6168, "text": "You need the cortex to reinstantiate, to replay that memory."}, {"time": 6175, "text": "So how do you find that memory?"}, {"time": 6175, "text": "Like which direction is the important direction?"}, {"time": 6180, "text": "Both directions are again, bidirectional."}, {"time": 6185, "text": "I mean, I guess how do you retrieve the memory?"}, {"time": 6185, "text": "So this is again, hypothesis."}, {"time": 6185, "text": "We're making this up."}, {"time": 6191, "text": "So when you come to a new situation, your cortex is doing inference over in the new situation."}, {"time": 6201, "text": "And then of course, hippocampus is connected to different parts of the cortex and you have this deja vu situation, right?"}, {"time": 6207, "text": "Okay, I have seen this thing before."}, {"time": 6207, "text": "And then in the hippocampus, you can have an index of, okay, this is when it happened as a timeline."}, {"time": 6215, "text": "And then you can use the hippocampus to drive the similar timelines to say now I am, rather than being driven by my current input stimuli, I am going back in time and rewinding my experience from there, putting back into the cortex."}, {"time": 6238, "text": "And then putting it back into the cortex of course affects what you're going to see next in your current situation."}, {"time": 6243, "text": "So that's the whole thing, having a world model and then yeah, connecting to the perception."}, {"time": 6249, "text": "Yeah, it does seem to be that that's what's happening."}, {"time": 6249, "text": "On the neural network side, it's interesting to think of how we actually do that."}, {"time": 6256, "text": "To have a knowledge base."}, {"time": 6264, "text": "It is possible that you can put many of these structures into neural networks and we will find ways of combining properties of neural networks and graphical models."}, {"time": 6271, "text": "So, I mean, it's already started happening."}, {"time": 6279, "text": "Graph neural networks are kind of a merge between them."}, {"time": 6283, "text": "And there will be more of that thing."}, {"time": 6283, "text": "So, but to me it is, the direction is pretty clear, looking at biology and the history of evolutionary history of intelligence, it is pretty clear that, okay, what is needed is more structure in the models and modeling of the world and supporting dynamic inference."}, {"time": 6306, "text": "Well, let me ask you, there's a guy named Elon Musk, there's a company called Neuralink and there's a general field called brain computer interfaces."}, {"time": 6313, "text": "It's kind of a interface between your two loves."}, {"time": 6320, "text": "The brain and the intelligence."}, {"time": 6320, "text": "So there's like very direct applications of brain computer interfaces for people with different conditions, more in the short term."}, {"time": 6332, "text": "But there's also these sci fi futuristic kinds of ideas of AI systems being able to communicate in a high bandwidth way with the brain, bidirectional."}, {"time": 6345, "text": "What are your thoughts about Neuralink and BCI in general as a possibility?"}, {"time": 6345, "text": "So I think BCI is a cool research area."}, {"time": 6353, "text": "And in fact, when I got interested in brains initially, when I was enrolled at Stanford and when I got interested in brains, it was through a brain computer interface talk that Krishna Shenoy gave."}, {"time": 6367, "text": "That's when I even started thinking about the problem."}, {"time": 6374, "text": "So it is definitely a fascinating research area and the applications are enormous."}, {"time": 6374, "text": "So there is a science fiction scenario of brains directly communicating."}, {"time": 6381, "text": "Let's keep that aside for the time being."}, {"time": 6386, "text": "Even just the intermediate milestones that pursuing, which are very reasonable as far as I can see, being able to control an external limb using direct connections from the brain and being able to write things into the brain."}, {"time": 6400, "text": "So those are all good steps to take and they have enormous applications."}, {"time": 6409, "text": "People losing limbs being able to control prosthetics, quadriplegics being able to control something, and therapeutics."}, {"time": 6415, "text": "I also know about another company working in the space called Paradromics."}, {"time": 6421, "text": "They're based on a different electrode array, but trying to attack some of the same problems."}, {"time": 6429, "text": "So I think it's a very... Also surgery?"}, {"time": 6429, "text": "Surgically implanted electrodes."}, {"time": 6434, "text": "So yeah, I think of it as a very, very promising field, especially when it is helping people overcome some limitations."}, {"time": 6442, "text": "Now, at some point, of course, it will advance the level of being able to communicate."}, {"time": 6449, "text": "How hard is that problem do you think?"}, {"time": 6449, "text": "Let's say we magically solve what I think is a really hard problem of doing all of this safely."}, {"time": 6457, "text": "So being able to connect electrodes and not just thousands, but like millions to the brain."}, {"time": 6465, "text": "I think it's very, very hard because you also do not know what will happen to the brain with that in the sense of how does the brain adapt to something like that?"}, {"time": 6478, "text": "And as we were learning, the brain is quite, in terms of neuroplasticity, is pretty malleable."}, {"time": 6484, "text": "So it's going to adjust."}, {"time": 6484, "text": "So the machine learning side, the computer side is going to adjust, and then the brain is going to adjust."}, {"time": 6494, "text": "And then what soup does this land us into?"}, {"time": 6494, "text": "The kind of hallucinations you might get from this that might be pretty intense."}, {"time": 6500, "text": "Just connecting to all of Wikipedia."}, {"time": 6500, "text": "It's interesting whether we need to be able to figure out the basic protocol of the brain's communication schemes in order to get them to the machine and the brain to talk."}, {"time": 6514, "text": "Because another possibility is the brain actually just adjust to whatever the heck the computer is doing."}, {"time": 6521, "text": "That's the way I think that I find that to be a more promising way."}, {"time": 6525, "text": "It's basically saying, okay, attach electrodes to some part of the cortex."}, {"time": 6531, "text": "Maybe if it is done from birth, the brain will adapt."}, {"time": 6531, "text": "It says that that part is not damaged."}, {"time": 6538, "text": "It was not used for anything."}, {"time": 6538, "text": "These electrodes are attached there."}, {"time": 6542, "text": "And now you train that part of the brain to do this high bandwidth communication between something else."}, {"time": 6549, "text": "And if you do it like that, then it is brain adapting to... And of course, your external system is designed so that it is adaptable."}, {"time": 6555, "text": "Just like we designed computers or mouse, keyboard, all of them to be interacting with humans."}, {"time": 6561, "text": "So of course, that feedback system is designed to be human compatible, but now it is not trying to record from all of the brain."}, {"time": 6577, "text": "And now two systems trying to adapt to each other."}, {"time": 6577, "text": "It's the brain adapting into one way."}, {"time": 6584, "text": "The brain is connected to the internet."}, {"time": 6584, "text": "Just imagine just connecting it to Twitter and just taking that stream of information."}, {"time": 6591, "text": "But again, if we take a step back, I don't know what your intuition is."}, {"time": 6599, "text": "I feel like that is not as hard of a problem as the doing it safely."}, {"time": 6608, "text": "There's a huge barrier to surgery because the biological system, it's a mush of like weird stuff."}, {"time": 6619, "text": "So that the surgery part of it, biology part of it, the longterm repercussions part of it."}, {"time": 6626, "text": "I don't know what else will... We often find after a long time in biology that, okay, that idea was wrong."}, {"time": 6635, "text": "So people used to cut off the gland called the thymus or something."}, {"time": 6643, "text": "And then they found that, oh no, that actually causes cancer."}, {"time": 6650, "text": "And then there's a subtle like millions of variables involved."}, {"time": 6650, "text": "But this whole process, the nice thing, just like again with Elon, just like colonizing Mars, seems like a ridiculously difficult idea."}, {"time": 6662, "text": "But in the process of doing it, we might learn a lot about the biology of the neurobiology of the brain, the neuroscience side of things."}, {"time": 6668, "text": "It's like, if you want to learn something, do the most difficult version of it and see what you learn."}, {"time": 6673, "text": "The intermediate steps that they are taking sounded all very reasonable to me."}, {"time": 6679, "text": "Well, but like everything with Elon is the timeline seems insanely fast."}, {"time": 6685, "text": "So that's the only awful question."}, {"time": 6685, "text": "Well, we've been talking about cognition a little bit."}, {"time": 6694, "text": "So like reasoning, we haven't mentioned the other C word, which is consciousness."}, {"time": 6698, "text": "Do you ever think about that one?"}, {"time": 6703, "text": "Is that useful at all in this whole context of what it takes to create an intelligent reasoning being?"}, {"time": 6711, "text": "Or is that completely outside of your, like the engineering perspective of intelligence?"}, {"time": 6718, "text": "It is not outside the realm, but it doesn't on a day to day basis inform what we do, but it's more, so in many ways, the company name is connected to this idea of consciousness."}, {"time": 6732, "text": "What's the company name?"}, {"time": 6732, "text": "Vicarious."}, {"time": 6732, "text": "So Vicarious is the company name."}, {"time": 6732, "text": "And so what does Vicarious mean?"}, {"time": 6739, "text": "At the first level, it is about modeling the world and it is internalizing the external actions."}, {"time": 6749, "text": "So you interact with the world and learn a lot about the world."}, {"time": 6749, "text": "And now after having learned a lot about the world, you can run those things in your mind without actually having to act in the world."}, {"time": 6762, "text": "So you can run things vicariously just in your brain."}, {"time": 6762, "text": "And similarly, you can experience another person's thoughts by having a model of how that person works and running there, putting yourself in some other person's shoes."}, {"time": 6774, "text": "So that is being vicarious."}, {"time": 6781, "text": "Now it's the same modeling apparatus that you're using to model the external world or some other person's thoughts."}, {"time": 6786, "text": "You can turn it to yourself."}, {"time": 6786, "text": "If that same modeling thing is applied to your own modeling apparatus, then that is what gives rise to consciousness, I think."}, {"time": 6801, "text": "Well, that's more like self awareness."}, {"time": 6801, "text": "There's the hard problem of consciousness, which is when the model feels like something, when this whole process is like you really are in it."}, {"time": 6817, "text": "You feel like an entity in this world."}, {"time": 6817, "text": "Not just you know that you're an entity, but it feels like something to be that entity."}, {"time": 6823, "text": "And thereby, we attribute this."}, {"time": 6823, "text": "Then it starts to be where something that has consciousness can suffer."}, {"time": 6834, "text": "You start to have these kinds of things that we can reason about that is much heavier."}, {"time": 6839, "text": "It seems like there's much greater cost to your decisions."}, {"time": 6849, "text": "And mortality is tied up into that."}, {"time": 6849, "text": "The fact that these things end."}, {"time": 6849, "text": "First of all, I end at some point, and then other things end."}, {"time": 6858, "text": "That somehow seems to be, at least for us humans, a deep motivator."}, {"time": 6867, "text": "That idea of motivation in general, we talk about goals in AI, but goals aren't quite the same thing as our mortality."}, {"time": 6878, "text": "It feels like, first of all, humans don't have a goal, and they just kind of create goals at different levels."}, {"time": 6886, "text": "They make up goals because we're terrified by the mystery of the thing that gets us all."}, {"time": 6894, "text": "We make these goals up."}, {"time": 6894, "text": "We're like a goal generation machine, as opposed to a machine which optimizes the trajectory towards a singular goal."}, {"time": 6902, "text": "It feels like that's an important part of cognition, that whole mortality thing."}, {"time": 6910, "text": "Well, it is a part of human cognition, but there is no reason for that mortality to come to the equation for an artificial system, because we can copy the artificial system."}, {"time": 6930, "text": "The problem with humans is that I can't clone you."}, {"time": 6936, "text": "Even if I clone you as the hardware, your experience that was stored in your brain, your episodic memory, all those will not be captured in the new clone."}, {"time": 6945, "text": "But that's not the same with an AI system."}, {"time": 6952, "text": "But it's also possible that the thing that you mentioned with us humans is actually of fundamental importance for intelligence."}, {"time": 6962, "text": "The fact that you can copy an AI system means that that AI system is not yet an AGI."}, {"time": 6967, "text": "If you look at existence proof, if we reason based on existence proof, you could say that it doesn't feel like death is a fundamental property of an intelligent system."}, {"time": 6984, "text": "But we don't yet."}, {"time": 6984, "text": "Give me an example of an immortal intelligent being."}, {"time": 6993, "text": "We don't have those."}, {"time": 6993, "text": "It's very possible that that is a fundamental property of intelligence, is a thing that has a deadline for itself."}, {"time": 7002, "text": "Well, you can think of it like this."}, {"time": 7002, "text": "Suppose you invent a way to freeze people for a long time."}, {"time": 7009, "text": "It's not dying."}, {"time": 7009, "text": "So you can be frozen and woken up thousands of years from now."}, {"time": 7018, "text": "So it's no fear of death."}, {"time": 7018, "text": "Well, no, it's not about time."}, {"time": 7018, "text": "It's about the knowledge that it's temporary."}, {"time": 7028, "text": "And that aspect of it, the finiteness of it, I think creates a kind of urgency."}, {"time": 7037, "text": "For us, for humans."}, {"time": 7037, "text": "Yeah, for humans."}, {"time": 7037, "text": "And that is part of our drives."}, {"time": 7043, "text": "And that's why I'm not too worried about AI having motivations to kill all humans and those kinds of things."}, {"time": 7055, "text": "Just wait."}, {"time": 7055, "text": "So why do you need to do that?"}, {"time": 7055, "text": "I've never heard that before."}, {"time": 7063, "text": "Yeah, just murder seems like a lot of work."}, {"time": 7063, "text": "Let's just wait it out."}, {"time": 7072, "text": "They'll probably hurt themselves."}, {"time": 7072, "text": "Let me ask you, people often kind of wonder, world class researchers such as yourself, what kind of books, technical fiction, philosophical, had an impact on you and your life and maybe ones you could possibly recommend that others read?"}, {"time": 7090, "text": "Maybe if you have three books that pop into mind."}, {"time": 7097, "text": "So I definitely liked Judea Pearl's book, Probabilistic Reasoning and Intelligent Systems."}, {"time": 7103, "text": "It's a very deep technical book."}, {"time": 7103, "text": "But what I liked is that, so there are many places where you can learn about probabilistic graphical models from."}, {"time": 7116, "text": "But throughout this book, Judea Pearl kind of sprinkles his philosophical observations and he thinks about, connects us to how the brain thinks and attentions and resources, all those things."}, {"time": 7122, "text": "So that whole thing makes it more interesting to read."}, {"time": 7128, "text": "He emphasizes the importance of causality."}, {"time": 7134, "text": "So that was in his later book."}, {"time": 7134, "text": "So this was the first book, Probabilistic Reasoning and Intelligent Systems."}, {"time": 7138, "text": "He mentions causality, but he hadn't really sunk his teeth into causality."}, {"time": 7138, "text": "But he really sunk his teeth into, how do you actually formalize it?"}, {"time": 7145, "text": "And the second book, Causality, the one in 2000, that one is really hard."}, {"time": 7151, "text": "So I would recommend that."}, {"time": 7157, "text": "So that looks at the mathematical, his model of... Do calculus."}, {"time": 7163, "text": "Do calculus."}, {"time": 7163, "text": "It was pretty dense mathematically."}, {"time": 7165, "text": "The book of Y is definitely more enjoyable."}, {"time": 7169, "text": "So I would recommend Probabilistic Reasoning and Intelligent Systems."}, {"time": 7174, "text": "Another book I liked was one from Doug Hofstadter."}, {"time": 7174, "text": "This was a long time ago."}, {"time": 7174, "text": "He had a book, I think it was called The Mind's Eye."}, {"time": 7181, "text": "It was probably Hofstadter and Daniel Dennett together."}, {"time": 7189, "text": "And I actually was, I bought that book."}, {"time": 7189, "text": "It's on my show."}, {"time": 7189, "text": "I haven't read it yet, but I couldn't get an electronic version of it, which is annoying because you read everything on Kindle."}, {"time": 7200, "text": "So you had to actually purchase the physical."}, {"time": 7200, "text": "It's one of the only physical books I have because anyway, a lot of people recommended it highly."}, {"time": 7211, "text": "And the third one I would definitely recommend reading is, this is not a technical book."}, {"time": 7211, "text": "It is history."}, {"time": 7218, "text": "The name of the book, I think, is Bishop's Boys."}, {"time": 7218, "text": "It's about Wright brothers and their path and how it was..."}, {"time": 7225, "text": "There are multiple books on this topic and all of them are great."}, {"time": 7234, "text": "It's fascinating how flight was treated as an unsolvable problem."}, {"time": 7234, "text": "And also, what aspects did people emphasize?"}, {"time": 7246, "text": "People thought, oh, it is all about just powerful engines."}, {"time": 7251, "text": "You just need to have powerful lightweight engines."}, {"time": 7251, "text": "And so some people thought of it as, how far can we just throw the thing?"}, {"time": 7260, "text": "Just throw it."}, {"time": 7264, "text": "Like a catapult."}, {"time": 7265, "text": "So it's very fascinating."}, {"time": 7265, "text": "And even after they made the invention, people are not believing it."}, {"time": 7273, "text": "Ah, the social aspect of it."}, {"time": 7275, "text": "The social aspect."}, {"time": 7275, "text": "It's very fascinating."}, {"time": 7278, "text": "I mean, do you draw any parallels between birds fly?"}, {"time": 7278, "text": "So there's the natural approach to flight and then there's the engineered approach."}, {"time": 7288, "text": "Do you see the same kind of thing with the brain and our trying to engineer intelligence?"}, {"time": 7297, "text": "It's a good analogy to have."}, {"time": 7297, "text": "Of course, all analogies have their limits."}, {"time": 7303, "text": "So people in AI often use airplanes as an example of, hey, we didn't learn anything from birds."}, {"time": 7315, "text": "But the funny thing is that, and the saying is, airplanes don't flap wings."}, {"time": 7315, "text": "This is what they say."}, {"time": 7322, "text": "The funny thing and the ironic thing is that you don't need to flap to fly is something Wright brothers found by observing birds."}, {"time": 7329, "text": "So they have in their notebook, in some of these books, they show their notebook drawings."}, {"time": 7338, "text": "They make detailed notes about buzzards just soaring over thermals."}, {"time": 7346, "text": "And they basically say, look, flapping is not the important, propulsion is not the important problem to solve here."}, {"time": 7351, "text": "We want to solve control."}, {"time": 7351, "text": "And once you solve control, propulsion will fall into place."}, {"time": 7357, "text": "All of these are people, they realize this by observing birds."}, {"time": 7364, "text": "That's actually brilliant because people do use that analogy a lot."}, {"time": 7364, "text": "I'm going to have to remember that one."}, {"time": 7369, "text": "Do you have advice for people interested in artificial intelligence like young folks today?"}, {"time": 7374, "text": "I talk to undergraduate students all the time, interested in neuroscience, interested in understanding how the brain works."}, {"time": 7379, "text": "Is there advice you would give them about their career, maybe about their life in general?"}, {"time": 7389, "text": "I think every piece of advice should be taken with a pinch of salt, of course, because each person is different, their motivations are different."}, {"time": 7394, "text": "But I can definitely say if your goal is to understand the brain from the angle of wanting to build one, then being an experimental neuroscientist might not be the way to go about it."}, {"time": 7408, "text": "A better way to pursue it might be through computer science, electrical engineering, machine learning, and AI."}, {"time": 7416, "text": "And of course, you have to study the neuroscience, but that you can do on your own."}, {"time": 7422, "text": "If you're more attracted by finding something intriguing about, discovering something intriguing about the brain, then of course, it is better to be an experimentalist."}, {"time": 7433, "text": "So find that motivation, what are you intrigued by?"}, {"time": 7438, "text": "And of course, find your strengths too."}, {"time": 7438, "text": "Some people are very good experimentalists and they enjoy doing that."}, {"time": 7443, "text": "And it's interesting to see which department, if you're picking in terms of your education path, whether to go with like, at MIT, it's brain and computer, no, it'd be CS."}, {"time": 7458, "text": "Brain and cognitive sciences, yeah."}, {"time": 7458, "text": "Or the CS side of things."}, {"time": 7469, "text": "And actually the brain folks, the neuroscience folks are more and more now embracing of learning TensorFlow and PyTorch, right?"}, {"time": 7474, "text": "They see the power of trying to engineer ideas that they get from the brain into, and then explore how those could be used to create intelligent systems."}, {"time": 7492, "text": "So that might be the right department actually."}, {"time": 7492, "text": "So this was a question in one of the Redwood Neuroscience Institute workshops that Jeff Hawkins organized almost 10 years ago."}, {"time": 7506, "text": "This question was put to a panel, right?"}, {"time": 7506, "text": "What should be the undergrad major you should take if you want to understand the brain?"}, {"time": 7511, "text": "And the majority opinion in that one was electrical engineering."}, {"time": 7517, "text": "Because, I mean, I'm a double undergrad, so I got lucky in that way."}, {"time": 7525, "text": "But I think it does have some of the right ingredients because you learn about circuits."}, {"time": 7530, "text": "You learn about how you can construct circuits to approach, do functions."}, {"time": 7530, "text": "You learn about microprocessors."}, {"time": 7537, "text": "You learn information theory."}, {"time": 7537, "text": "You learn signal processing."}, {"time": 7537, "text": "You learn continuous math."}]}]