[{"title": "Pamela McCorduck: Machines Who Think and the Early Days of AI | Lex Fridman Podcast #34", "id": "i6rnzk8VU24", "quotes": [{"time": 283, "text": "He was, I think, an undergraduate then."}, {"time": 287, "text": "And of course, Joe Traub."}, {"time": 287, "text": "All of these are players, not at Dartmouth, but in that era."}, {"time": 297, "text": "CMU and so on."}, {"time": 297, "text": "So who are the characters, if you could paint a picture, that stand out to you from memory?"}, {"time": 302, "text": "Those people you've interviewed and maybe not, people that were just in the In the atmosphere."}, {"time": 309, "text": "In the atmosphere."}, {"time": 311, "text": "Of course, the four founding fathers were extraordinary guys."}, {"time": 311, "text": "They really were."}, {"time": 315, "text": "Who are the founding fathers?"}, {"time": 318, "text": "Alan Newell, Herbert Simon, Marvin Minsky, John McCarthy."}, {"time": 318, "text": "They were the four who were not only at the Dartmouth conference, but Newell and Simon arrived there with a working program called The Logic Theorist."}, {"time": 329, "text": "Everybody else had great ideas about how they might do it, but But they weren't going to do it yet."}, {"time": 341, "text": "And you mentioned Joe Traub, my husband."}, {"time": 341, "text": "I was immersed in AI before I met Joe because I had been Ed Feigenbaum's assistant at Stanford."}, {"time": 350, "text": "And before that, I had worked on a book edited by Feigenbaum and Julian Feldman called Computers and Thought."}, {"time": 364, "text": "It was the first textbook of readings of AI."}, {"time": 364, "text": "And they only did it because they were trying to teach AI to people at Berkeley."}, {"time": 370, "text": "And there was nothing, you'd have to send them to this journal and that journal."}, {"time": 375, "text": "This was not the internet where you could go look at an article."}, {"time": 375, "text": "So I was fascinated from the get go by AI."}, {"time": 382, "text": "I was an English major."}, {"time": 382, "text": "What did I know?"}, {"time": 382, "text": "And yet I was fascinated."}, {"time": 382, "text": "And that's why you saw that historical, that literary background, which I think is very much a part of the continuum of AI, that AI grew out of that same impulse."}, {"time": 398, "text": "That traditional, what was, what drew you to AI?"}, {"time": 407, "text": "How did you even think of it back then?"}, {"time": 407, "text": "What was the possibilities, the dreams?"}, {"time": 414, "text": "What was interesting to you?"}, {"time": 414, "text": "The idea of intelligence outside the human cranium, this was a phenomenal idea."}, {"time": 423, "text": "And even when I finished Machines Who Think, I didn't know if they were going to succeed."}, {"time": 428, "text": "In fact, the final chapter is very wishy washy, frankly."}, {"time": 435, "text": "Succeed, the field did."}, {"time": 435, "text": "So was there the idea that AI began with the wish to forge the gods?"}, {"time": 445, "text": "So the spiritual component that we crave to create this other thing greater than ourselves."}, {"time": 453, "text": "For those guys, I don't think so."}, {"time": 453, "text": "Newell and Simon were cognitive psychologists."}, {"time": 462, "text": "What they wanted was to simulate aspects of human intelligence, and they found they could do it on the computer."}, {"time": 469, "text": "Minsky just thought it was a really cool thing to do."}, {"time": 477, "text": "Likewise, McCarthy."}, {"time": 477, "text": "McCarthy had got the idea in 1949 when he was a Caltech student."}, {"time": 486, "text": "And he listened to somebody's lecture."}, {"time": 486, "text": "It's in my book."}, {"time": 486, "text": "I forget who it was."}, {"time": 486, "text": "And he thought, oh, that would be fun to do."}, {"time": 495, "text": "How do we do that?"}, {"time": 495, "text": "And he took a very mathematical approach."}, {"time": 501, "text": "Minsky was hybrid, and Newell and Simon were very much cognitive psychology."}, {"time": 501, "text": "How can we simulate various things about human cognition?"}, {"time": 509, "text": "What happened over the many years is, of course, our definition of intelligence expanded tremendously."}, {"time": 517, "text": "These days, biologists are comfortable talking about the intelligence of the cell, the intelligence of the brain, not just human brain, but the intelligence of any kind of brain."}, {"time": 529, "text": "Cephalopods, I mean, an octopus is really intelligent by any amount."}, {"time": 540, "text": "We wouldn't have thought of that in the 60s, even the 70s."}, {"time": 546, "text": "So all these things have worked in."}, {"time": 546, "text": "And I did hear one behavioral primatologist, Franz De Waal, say, AI taught us the questions to ask."}, {"time": 556, "text": "Yeah, this is what happens, right?"}, {"time": 556, "text": "When you try to build it, is when you start to actually ask questions."}, {"time": 566, "text": "It puts a mirror to ourselves."}, {"time": 566, "text": "So you were there in the middle of it."}, {"time": 572, "text": "It seems like not many people were asking the questions that you were, or just trying to look at this field the way you were."}, {"time": 578, "text": "I was so low."}, {"time": 578, "text": "When I went to get funding for this because I needed somebody to transcribe the interviews and I needed travel expenses, I went to everything you could think of, the NSF, the DARPA."}, {"time": 593, "text": "There was an Air Force place that doled out money."}, {"time": 607, "text": "And each of them said, well, that's a very interesting idea."}, {"time": 615, "text": "But we'll think about it."}, {"time": 615, "text": "And the National Science Foundation actually said to me in plain English, hey, you're only a writer."}, {"time": 623, "text": "You're not a historian of science."}, {"time": 623, "text": "And I said, yeah, that's true."}, {"time": 623, "text": "But the historians of science will be crawling all over this field."}, {"time": 630, "text": "I'm writing for the general audience, so I thought."}, {"time": 635, "text": "And they still wouldn't budge."}, {"time": 635, "text": "I finally got a private grant without knowing who it was from, from Ed Fredkin at MIT."}, {"time": 643, "text": "He was a wealthy man, and he liked what he called crackpot ideas."}, {"time": 651, "text": "And he considered this a crackpot idea, and he was willing to support it."}, {"time": 651, "text": "I am ever grateful, let me say that."}, {"time": 658, "text": "Some would say that a history of science approach to AI, or even just a history, or anything like the book that you've written, hasn't been written since."}, {"time": 666, "text": "Maybe I'm not familiar, but it's certainly not many."}, {"time": 673, "text": "If we think about bigger than just these couple of decades, few decades, what are the roots of AI?"}, {"time": 680, "text": "Oh, they go back so far."}, {"time": 680, "text": "Yes, of course, there's all the legendary stuff, the Golem and the early robots of the 20th century."}, {"time": 690, "text": "But they go back much further than that."}, {"time": 701, "text": "If you read Homer, Homer has robots in the Iliad."}, {"time": 701, "text": "And a classical scholar was pointing out to me just a few months ago, well, you said you just read the Odyssey."}, {"time": 709, "text": "The Odyssey is full of robots."}, {"time": 714, "text": "It is, I said?"}, {"time": 714, "text": "How do you think Odysseus's ship gets from one place to another?"}, {"time": 720, "text": "He doesn't have the crew people to do that, the crewmen."}, {"time": 720, "text": "Yeah, it's magic."}, {"time": 720, "text": "It's robots."}, {"time": 727, "text": "Oh, I thought, how interesting."}, {"time": 727, "text": "So we've had this notion of AI for a long time."}, {"time": 727, "text": "And then toward the end of the 19th century, the beginning of the 20th century, there were scientists who actually tried to make this happen some way or another, not successfully."}, {"time": 743, "text": "They didn't have the technology for it."}, {"time": 749, "text": "And of course, Babbage in the 1850s and 60s, he saw that what he was building was capable of intelligent behavior."}, {"time": 760, "text": "And when he ran out of funding, the British government finally said, that's enough."}, {"time": 767, "text": "He and Lady Lovelace decided, oh, well, why don't we play the ponies with this?"}, {"time": 767, "text": "He had other ideas for raising money too."}, {"time": 775, "text": "But if we actually reach back once again, I think people don't actually really know that robots do appear and ideas of robots."}, {"time": 782, "text": "You talk about the Hellenic and the Hebraic points of view."}, {"time": 789, "text": "Can you tell me about each?"}, {"time": 789, "text": "I defined it this way."}, {"time": 789, "text": "The Hellenic point of view is robots are great."}, {"time": 796, "text": "They are party help."}, {"time": 796, "text": "They help this guy Hephaestus, this god Hephaestus in his forge."}, {"time": 805, "text": "I presume he made them to help him and so on and so forth."}, {"time": 812, "text": "And they welcome the whole idea of robots."}, {"time": 812, "text": "The Hebraic view has to do with, I think it's the second commandment, thou shalt not make any graven image."}, {"time": 820, "text": "In other words, you better not start imitating humans because that's just forbidden."}, {"time": 827, "text": "It's the second commandment."}, {"time": 827, "text": "And a lot of the reaction to artificial intelligence has been a sense that this is somehow wicked, this is somehow blasphemous."}, {"time": 848, "text": "We shouldn't be going there."}, {"time": 848, "text": "Now, you can say, yeah, but there are going to be some downsides."}, {"time": 857, "text": "And I say, yes, there are, but blasphemy is not one of them."}, {"time": 861, "text": "You know, there is a kind of fear that feels to be almost primal."}, {"time": 861, "text": "Is there religious roots to that?"}, {"time": 869, "text": "Because so much of our society has religious roots."}, {"time": 869, "text": "And so there is a feeling of, like you said, blasphemy of creating the other, of creating something, you know, it doesn't have to be artificial intelligence."}, {"time": 883, "text": "It's creating life in general."}, {"time": 883, "text": "It's the Frankenstein idea."}, {"time": 888, "text": "There's the annotated Frankenstein on my coffee table."}, {"time": 888, "text": "It's a tremendous novel."}, {"time": 888, "text": "It really is just beautifully perceptive."}, {"time": 896, "text": "Yes, we do fear this and we have good reason to fear it, but because it can get out of hand."}, {"time": 903, "text": "Maybe you can speak to that fear, the psychology, if you've thought about it."}, {"time": 908, "text": "You know, there's a practical set of fears, concerns in the short term."}, {"time": 912, "text": "You can think if we actually think about artificial intelligence systems, you can think about bias of discrimination in algorithms."}, {"time": 917, "text": "You can think about their social networks have algorithms that recommend the content you see, thereby these algorithms control the behavior of the masses."}, {"time": 935, "text": "There's these concerns."}, {"time": 935, "text": "But to me, it feels like the fear that people have is deeper than that."}, {"time": 940, "text": "So have you thought about the psychology of it?"}, {"time": 946, "text": "I think in a superficial way I have."}, {"time": 946, "text": "There is this notion that if we produce a machine that can think, it will outthink us and therefore replace us."}, {"time": 961, "text": "I guess that's a primal fear of almost kind of a kind of mortality."}, {"time": 961, "text": "So around the time you said you worked at Stanford with Ed Feigenbaum."}, {"time": 971, "text": "So let's look at that one person."}, {"time": 971, "text": "Throughout his history, clearly a key person, one of the many in the history of AI."}, {"time": 981, "text": "How has he changed in general around him?"}, {"time": 991, "text": "How has Stanford changed in the last, how many years are we talking about here?"}, {"time": 996, "text": "Oh, since 65."}, {"time": 998, "text": "65."}, {"time": 998, "text": "So maybe it doesn't have to be about him."}, {"time": 998, "text": "It could be bigger."}, {"time": 998, "text": "But because he was a key person in expert systems, for example, how is that, how are these folks who you've interviewed in the 70s, 79 changed through the decades?"}, {"time": 1018, "text": "In Ed's case, I know him well."}, {"time": 1018, "text": "We are dear friends."}, {"time": 1018, "text": "We see each other every month or so."}, {"time": 1018, "text": "He told me that when Machines Who Think first came out, he really thought all the front matter was kind of bologna."}, {"time": 1037, "text": "And 10 years later, he said, no, I see what you're getting at."}, {"time": 1037, "text": "Yes, this is an impulse that has been a human impulse for thousands of years to create something outside the human cranium that has intelligence."}, {"time": 1054, "text": "I think it's very hard when you're down at the algorithmic level, and you're just trying to make something work, which is hard enough to step back and think of the big picture."}, {"time": 1073, "text": "It reminds me of when I was in Santa Fe, I knew a lot of archaeologists, which was a hobby of mine."}, {"time": 1079, "text": "And I would say, yeah, yeah, well, you can look at the shards and say, oh, this came from this tribe and this came from this trade route and so on."}, {"time": 1087, "text": "But what about the big picture?"}, {"time": 1094, "text": "And a very distinguished archaeologist said to me, they don't think that way."}, {"time": 1094, "text": "No, they're trying to match the shard to where it came from."}, {"time": 1101, "text": "Where did the remainder of this corn come from?"}, {"time": 1110, "text": "Was it grown here?"}, {"time": 1110, "text": "Was it grown elsewhere?"}, {"time": 1110, "text": "And I think this is part of any scientific field."}, {"time": 1117, "text": "You're so busy doing the hard work, and it is hard work, that you don't step back and say, oh, well, now let's talk about the general meaning of all this."}, {"time": 1133, "text": "So none of the even Minsky and McCarthy, they... Oh, those guys did."}, {"time": 1138, "text": "The founding fathers did."}, {"time": 1141, "text": "Early on or later?"}, {"time": 1143, "text": "Pretty early on."}, {"time": 1143, "text": "But in a different way from how I looked at it."}, {"time": 1143, "text": "The two cognitive psychologists, Newell and Simon, they wanted to imagine reforming cognitive psychology so that we would really, really understand the brain."}, {"time": 1160, "text": "Minsky was more speculative."}, {"time": 1160, "text": "And John McCarthy saw it as, I think I'm doing him right by this, he really saw it as a great boon for human beings to have this technology."}, {"time": 1180, "text": "And that was reason enough to do it."}, {"time": 1180, "text": "And he had wonderful, wonderful fables about how if you do the mathematics, you will see that these things are really good for human beings."}, {"time": 1196, "text": "And if you had a technological objection, he had an answer, a technological answer."}, {"time": 1203, "text": "But here's how we could get over that and then blah, blah, blah."}, {"time": 1203, "text": "And one of his favorite things was what he called the literary problem, which of course he presented to me several times."}, {"time": 1216, "text": "That is everything in literature, there are conventions in literature."}, {"time": 1216, "text": "One of the conventions is that you have a villain and a hero."}, {"time": 1223, "text": "And the hero in most literature is human, and the villain in most literature is a machine."}, {"time": 1236, "text": "And he said, that's just not the way it's going to be."}, {"time": 1241, "text": "But that's the way we're used to it."}, {"time": 1241, "text": "So when we tell stories about AI, it's always with this paradigm."}, {"time": 1247, "text": "I thought, yeah, he's right."}, {"time": 1247, "text": "Looking back, the classics RUR is certainly the machines trying to overthrow the humans."}, {"time": 1257, "text": "Frankenstein is different."}, {"time": 1257, "text": "Frankenstein is a creature."}, {"time": 1266, "text": "He never has a name."}, {"time": 1266, "text": "Frankenstein, of course, is the guy who created him, the human, Dr. Frankenstein."}, {"time": 1273, "text": "This creature wants to be loved, wants to be accepted."}, {"time": 1273, "text": "And it is only when Frankenstein turns his head, in fact, runs the other way."}, {"time": 1282, "text": "And the creature is without love, that he becomes the monster that he later becomes."}, {"time": 1298, "text": "So who's the villain in Frankenstein?"}, {"time": 1298, "text": "It's unclear, right?"}, {"time": 1303, "text": "Oh, it is unclear, yeah."}, {"time": 1305, "text": "It's really the people who drive him."}, {"time": 1305, "text": "By driving him away, they bring out the worst."}, {"time": 1314, "text": "They give him no human solace."}, {"time": 1314, "text": "And he is driven away, you're right."}, {"time": 1320, "text": "He becomes, at one point, the friend of a blind man."}, {"time": 1320, "text": "And he serves this blind man, and they become very friendly."}, {"time": 1328, "text": "But when the sighted people of the blind man's family come in, ah, you've got a monster here."}, {"time": 1334, "text": "So it's very didactic in its way."}, {"time": 1334, "text": "And what I didn't know is that Mary Shelley and Percy Shelley were great readers of the literature surrounding abolition in the United States, the abolition of slavery."}, {"time": 1351, "text": "And they picked that up wholesale."}, {"time": 1351, "text": "You are making monsters of these people because you won't give them the respect and love that they deserve."}, {"time": 1364, "text": "Do you have, if we get philosophical for a second, do you worry that once we create machines that are a little bit more intelligent, let's look at Roomba, the vacuums, the cleaner, that this darker part of human nature where we abuse the other, the somebody who's different, will come out?"}, {"time": 1389, "text": "I don't worry about it."}, {"time": 1389, "text": "I could imagine it happening."}, {"time": 1389, "text": "But I think that what AI has to offer the human race will be so attractive that people will be won over."}, {"time": 1405, "text": "So you have looked deep into these people, had deep conversations, and it's interesting to get a sense of stories of the way they were thinking and the way it was changed, the way your own thinking about AI has changed."}, {"time": 1422, "text": "So you mentioned McCarthy."}, {"time": 1422, "text": "What about the years at CMU, Carnegie Mellon, with Joe?"}, {"time": 1431, "text": "Joe was not in AI."}, {"time": 1431, "text": "He was in algorithmic complexity."}, {"time": 1443, "text": "Was there always a line between AI and computer science, for example?"}, {"time": 1447, "text": "Is AI its own place of outcasts?"}, {"time": 1447, "text": "Was that the feeling?"}, {"time": 1450, "text": "There was a kind of outcast period for AI."}, {"time": 1450, "text": "For instance, in 1974, the new field was hardly 10 years old."}, {"time": 1464, "text": "The new field of computer science was asked by the National Science Foundation, I believe, but it may have been the National Academies, I can't remember, to tell your fellow scientists where computer science is and what it means."}, {"time": 1484, "text": "And they wanted to leave out AI."}, {"time": 1484, "text": "And they only agreed to put it in because Don Knuth said, hey, this is important."}, {"time": 1493, "text": "You can't just leave that out."}, {"time": 1497, "text": "Don, dude?"}, {"time": 1498, "text": "Don Knuth, yes."}, {"time": 1499, "text": "I talked to him recently, too."}, {"time": 1499, "text": "Out of all the people."}, {"time": 1502, "text": "But you see, an AI person couldn't have made that argument."}, {"time": 1502, "text": "He wouldn't have been believed."}, {"time": 1508, "text": "But Knuth was believed."}, {"time": 1510, "text": "So Joe Traub worked on the real stuff."}, {"time": 1515, "text": "Joe was working on algorithmic complexity."}, {"time": 1515, "text": "But he would say in plain English again and again, the smartest people I know are in AI."}, {"time": 1525, "text": "Anyway, Joe loved these guys."}, {"time": 1525, "text": "What happened was that I guess it was as I started to write Machines Who Think, Herb Simon and I became very close friends."}, {"time": 1541, "text": "He would walk past our house on Northumberland Street every day after work."}, {"time": 1541, "text": "And I would just be putting my cover on my typewriter."}, {"time": 1547, "text": "And I would lean out the door and say, Herb, would you like a sherry?"}, {"time": 1552, "text": "And Herb almost always would like a sherry."}, {"time": 1552, "text": "So he'd stop in and we'd talk for an hour, two hours."}, {"time": 1559, "text": "My journal says we talked this afternoon for three hours."}, {"time": 1566, "text": "What was on his mind at the time in terms of on the AI side of things?"}, {"time": 1571, "text": "Oh, we didn't talk too much about AI."}, {"time": 1571, "text": "We talked about other things."}, {"time": 1575, "text": "We both love literature."}, {"time": 1575, "text": "And Herb had read Proust in the original French twice all the way through."}, {"time": 1584, "text": "I've read it in English in translation."}, {"time": 1584, "text": "So we talked about literature."}, {"time": 1590, "text": "We talked about languages."}, {"time": 1590, "text": "We talked about music because he loved music."}, {"time": 1590, "text": "We talked about art because he was actually enough of a painter that he had to give it up because he was afraid it was interfering with his research and so on."}, {"time": 1604, "text": "So no, it was really just chat, chat."}, {"time": 1611, "text": "But it was very warm."}, {"time": 1611, "text": "So one summer I said to Herb, my students have all the really interesting conversations."}, {"time": 1619, "text": "I was teaching at the University of Pittsburgh then in the English department."}, {"time": 1623, "text": "They get to talk about the meaning of life and that kind of thing."}, {"time": 1623, "text": "And what do I have?"}, {"time": 1629, "text": "I have university meetings where we talk about the photocopying budget and whether the course on romantic poetry should be one semester or two."}, {"time": 1637, "text": "So Herb laughed."}, {"time": 1637, "text": "He said, yes, I know what you mean."}, {"time": 1643, "text": "He said, but you could do something about that."}, {"time": 1643, "text": "Dot, that was his wife, Dot and I used to have a salon at the University of Chicago every Sunday night."}, {"time": 1650, "text": "And we would have essentially an open house and people knew."}, {"time": 1658, "text": "It wasn't for a small talk."}, {"time": 1658, "text": "It was really for some topic of depth."}, {"time": 1667, "text": "He said, but my advice would be that you choose the topic ahead of time."}, {"time": 1667, "text": "Fine, I said."}, {"time": 1674, "text": "So we exchanged mail over the summer."}, {"time": 1674, "text": "That was US Post in those days because you didn't have personal email."}, {"time": 1681, "text": "And I decided I would organize it and there would be eight of us, Alan Noland, his wife, Herb Simon and his wife Dorothea."}, {"time": 1692, "text": "There was a novelist in town, a man named Mark Harris."}, {"time": 1701, "text": "He had just arrived and his wife Josephine."}, {"time": 1701, "text": "Mark was most famous then for a novel called Bang the Drum Slowly, which was about baseball."}, {"time": 1709, "text": "And Joe and me, so eight people."}, {"time": 1716, "text": "And we met monthly and we just sank our teeth into really hard topics and it was great fun."}, {"time": 1725, "text": "TK How have your own views around artificial intelligence changed through the process of writing Machines Who Think and afterwards, the ripple effects?"}, {"time": 1737, "text": "RL I was a little skeptical that this whole thing would work out."}, {"time": 1737, "text": "It didn't matter."}, {"time": 1737, "text": "To me, it was so audacious."}, {"time": 1744, "text": "AI generally."}, {"time": 1744, "text": "And in some ways, it hasn't worked out the way I expected so far."}, {"time": 1756, "text": "That is to say, there's this wonderful lot of apps, thanks to deep learning and so on."}, {"time": 1766, "text": "But those are algorithmic."}, {"time": 1766, "text": "And in the part of symbolic processing, there's very little yet."}, {"time": 1779, "text": "And that's a field that lies waiting for industrious graduate students."}, {"time": 1785, "text": "TK Maybe you can tell me some figures that popped up in your life in the 80s with expert systems where there was the symbolic AI possibilities of what most people think of as AI, if you dream of the possibilities of AI, it's really expert systems."}, {"time": 1800, "text": "And those hit a few walls and there was challenges there."}, {"time": 1807, "text": "And I think, yes, they will reemerge again with some new breakthroughs and so on."}, {"time": 1812, "text": "But what did that feel like, both the possibility and the winter that followed the slowdown in research?"}, {"time": 1817, "text": "BG Ah, you know, this whole thing about AI winter is to me a crock."}, {"time": 1825, "text": "TK Snow winters."}, {"time": 1826, "text": "BG Because I look at the basic research that was being done in the 80s, which is supposed to be, my God, it was really important."}, {"time": 1834, "text": "It was laying down things that nobody had thought about before, but it was basic research."}, {"time": 1840, "text": "You couldn't monetize it."}, {"time": 1840, "text": "Hence the winter."}, {"time": 1844, "text": "TK That's the winter."}, {"time": 1844, "text": "BG You know, research, scientific research goes and fits and starts."}, {"time": 1849, "text": "It isn't this nice smooth, oh, this follows this follows this."}, {"time": 1854, "text": "No, it just doesn't work that way."}, {"time": 1859, "text": "TK The interesting thing, the way winters happen, it's never the fault of the researchers."}, {"time": 1865, "text": "It's the some source of hype over promising."}, {"time": 1865, "text": "Well, no, let me take that back."}, {"time": 1865, "text": "Sometimes it is the fault of the researchers."}, {"time": 1872, "text": "Sometimes certain researchers might over promise the possibilities."}, {"time": 1877, "text": "They themselves believe that we're just a few years away."}, {"time": 1877, "text": "Sort of just recently talked to Elon Musk and he believes he'll have an autonomous vehicle, will have autonomous vehicles in a year."}, {"time": 1888, "text": "And he believes it."}, {"time": 1888, "text": "BG A year?"}, {"time": 1890, "text": "TK A year."}, {"time": 1890, "text": "With mass deployment of a time."}, {"time": 1893, "text": "BG For the record, this is 2019 right now."}, {"time": 1893, "text": "So he's talking 2020."}, {"time": 1898, "text": "TK To do the impossible, you really have to believe it."}, {"time": 1898, "text": "And I think what's going to happen when you believe it, because there's a lot of really brilliant people around him, is some good stuff will come out of it."}, {"time": 1908, "text": "Some unexpected brilliant breakthroughs will come out of it when you really believe it, when you work that hard."}, {"time": 1913, "text": "BG I believe that."}, {"time": 1913, "text": "And I believe autonomous vehicles will come."}, {"time": 1918, "text": "I just don't believe it'll be in a year."}, {"time": 1922, "text": "TK But nevertheless, there's, autonomous vehicles is a good example."}, {"time": 1922, "text": "There's a feeling many companies have promised by 2021, by 2022, Ford, GM, basically every single automotive company has promised they'll have autonomous vehicles."}, {"time": 1936, "text": "So that kind of over promise is what leads to the winter."}, {"time": 1941, "text": "Because we'll come to those dates, there won't be autonomous vehicles."}, {"time": 1946, "text": "BG And there'll be a feeling, well, wait a minute, if we took your word at that time, that means we just spent billions of dollars, had made no money, and there's a counter response to where everybody gives up on it."}, {"time": 1959, "text": "Sort of intellectually, at every level, the hope just dies."}, {"time": 1966, "text": "And all that's left is a few basic researchers."}, {"time": 1966, "text": "So you're uncomfortable with some aspects of this idea."}, {"time": 1972, "text": "TK Well, it's the difference between science and commerce."}, {"time": 1978, "text": "BG So you think science goes on the way it does?"}, {"time": 1984, "text": "TK Oh, science can really be killed by not getting proper funding or timely funding."}, {"time": 1994, "text": "I think Great Britain was a perfect example of that."}, {"time": 1994, "text": "The Lighthill report in, I can't remember the year, essentially said, there's no use Great Britain putting any money into this, it's going nowhere."}, {"time": 2006, "text": "And this was all about social factions in Great Britain."}, {"time": 2017, "text": "Edinburgh hated Cambridge and Cambridge hated Manchester."}, {"time": 2017, "text": "Somebody else can write that story."}, {"time": 2024, "text": "But it really did have a hard effect on research there."}, {"time": 2024, "text": "Now, they've come roaring back with Deep Mind."}, {"time": 2034, "text": "But that's one guy and his visionaries around him."}, {"time": 2034, "text": "BG But just to push on that, it's kind of interesting."}, {"time": 2043, "text": "You have this dislike of the idea of an AI winter."}, {"time": 2048, "text": "Where's that coming from?"}, {"time": 2048, "text": "Where were you?"}, {"time": 2048, "text": "TK Oh, because I just don't think it's true."}, {"time": 2055, "text": "BG There was a particular period of time."}, {"time": 2055, "text": "It's a romantic notion, certainly."}, {"time": 2061, "text": "TK Yeah, well."}, {"time": 2061, "text": "No, I admire science, perhaps more than I admire commerce."}, {"time": 2061, "text": "Commerce is fine."}, {"time": 2061, "text": "Hey, you know, we all gotta live."}, {"time": 2073, "text": "But science has a much longer view than commerce and continues almost regardless."}, {"time": 2086, "text": "It can't continue totally regardless, but almost regardless of what's saleable and what's not, what's monetizable and what's not."}, {"time": 2096, "text": "BG So the winter is just something that happens on the commerce side, and the science marches."}, {"time": 2101, "text": "That's a beautifully optimistic and inspiring message."}, {"time": 2110, "text": "I think if we look at the key people that work in AI, that work in key scientists in most disciplines, they continue working out of the love for science."}, {"time": 2122, "text": "You can always scrape up some funding to stay alive, and they continue working diligently."}, {"time": 2131, "text": "But there certainly is a huge amount of funding now, and there's a concern on the AI side and deep learning."}, {"time": 2138, "text": "There's a concern that we might, with over promising, hit another slowdown in funding, which does affect the number of students, you know, that kind of thing."}, {"time": 2147, "text": "RG Yeah, it does."}, {"time": 2147, "text": "BG So the kind of ideas you had in Machines Who Think, did you continue that curiosity through the decades that followed?"}, {"time": 2156, "text": "RG Yes, I did."}, {"time": 2156, "text": "BG And what was your view, historical view of how AI community evolved, the conversations about it, the work?"}, {"time": 2163, "text": "Has it persisted the same way from its birth?"}, {"time": 2169, "text": "RG No, of course not."}, {"time": 2169, "text": "It's just as we were just talking, the symbolic AI really kind of dried up and it all became algorithmic."}, {"time": 2179, "text": "I remember a young AI student telling me what he was doing, and I had been away from the field long enough."}, {"time": 2187, "text": "I'd gotten involved with complexity at the Santa Fe Institute."}, {"time": 2193, "text": "I thought, algorithms, yeah, they're in the service of, but they're not the main event."}, {"time": 2201, "text": "No, they became the main event."}, {"time": 2201, "text": "That surprised me."}, {"time": 2201, "text": "And we all know the downside of this."}, {"time": 2201, "text": "We all know that if you're using an algorithm to make decisions based on a gazillion human decisions, baked into it are all the mistakes that humans make, the bigotries, the short sightedness, and so on and so on."}, {"time": 2225, "text": "BG So you mentioned Santa Fe Institute."}, {"time": 2225, "text": "So you've written the novel Edge of Chaos, but it's inspired by the ideas of complexity, a lot of which have been extensively explored at the Santa Fe Institute."}, {"time": 2240, "text": "It's another fascinating topic, just sort of emergent complexity from chaos."}, {"time": 2251, "text": "Nobody knows how it happens really, but it seems to where all the interesting stuff does happen."}, {"time": 2257, "text": "So how did first, not your novel, but just complexity in general and the work at Santa Fe, fit into the bigger puzzle of the history of AI?"}, {"time": 2264, "text": "Or maybe even your personal journey through that?"}, {"time": 2271, "text": "RG One of the last projects I did concerning AI in particular was looking at the work of Harold Cohen, the painter."}, {"time": 2277, "text": "And Harold was deeply involved with AI."}, {"time": 2286, "text": "He was a painter first."}, {"time": 2286, "text": "And what his project, ARIN, which was a lifelong project, did was reflect his own cognitive processes."}, {"time": 2297, "text": "Harold and I, even though I wrote a book about it, we had a lot of friction between us."}, {"time": 2310, "text": "And I went, I thought, this is it."}, {"time": 2310, "text": "The book died."}, {"time": 2319, "text": "It was published and fell into a ditch."}, {"time": 2319, "text": "This is it."}, {"time": 2319, "text": "I'm finished."}, {"time": 2319, "text": "It's time for me to do something different."}, {"time": 2327, "text": "By chance, this was a sabbatical year for my husband."}, {"time": 2327, "text": "And we spent two months at the Santa Fe Institute and two months at Caltech."}, {"time": 2335, "text": "And then the spring semester in Munich, Germany."}, {"time": 2343, "text": "Those two months at the Santa Fe Institute were so restorative for me."}, {"time": 2343, "text": "And I began to, the Institute was very small then."}, {"time": 2355, "text": "It was in some kind of office complex on old Santa Fe trail."}, {"time": 2362, "text": "Everybody kept their door open."}, {"time": 2362, "text": "So you could crack your head on a problem."}, {"time": 2362, "text": "And if you finally didn't get it, you could walk in to see Stuart Kaufman or any number of people and say, I don't get this."}, {"time": 2379, "text": "Can you explain?"}, {"time": 2379, "text": "And one of the people that I was talking to about complex adaptive systems was Murray Gelman."}, {"time": 2386, "text": "And I told Murray what Harold Cohen had done."}, {"time": 2386, "text": "And I said, you know, this sounds to me like a complex adaptive system."}, {"time": 2395, "text": "And he said, yeah, it is."}, {"time": 2395, "text": "Well, what do you know?"}, {"time": 2402, "text": "Harold Aaron had all these kids and cousins all over the world in science and in economics and so on and so forth."}, {"time": 2409, "text": "I was so relieved."}, {"time": 2409, "text": "I thought, okay, your instincts are okay."}, {"time": 2409, "text": "You're doing the right thing."}, {"time": 2416, "text": "I didn't have the vocabulary."}, {"time": 2416, "text": "And that was one of the things that the Santa Fe Institute gave me."}, {"time": 2421, "text": "If I could have rewritten that book, no, it had just come out."}, {"time": 2421, "text": "I couldn't rewrite it."}, {"time": 2426, "text": "I would have had a vocabulary to explain what Aaron was doing."}, {"time": 2426, "text": "So I got really interested in what was going on at the Institute."}, {"time": 2434, "text": "The people were, again, bright and funny and willing to explain anything to this amateur."}, {"time": 2444, "text": "George Cowan, who was then the head of the Institute, said he thought it might be a nice idea if I wrote a book about the Institute."}, {"time": 2451, "text": "And I thought about it and I had my eye on some other project, God knows what."}, {"time": 2458, "text": "And I said, I'm sorry, George."}, {"time": 2458, "text": "Yeah, I'd really love to do it, but just not going to work for me at this moment."}, {"time": 2465, "text": "He said, oh, too bad."}, {"time": 2465, "text": "I think it would make an interesting book."}, {"time": 2471, "text": "Well, he was right and I was wrong."}, {"time": 2471, "text": "I wish I'd done it."}, {"time": 2471, "text": "But that's interesting."}, {"time": 2477, "text": "I hadn't thought about that, that that was a road not taken that I wish I'd taken."}, {"time": 2482, "text": "Well, you know what?"}, {"time": 2482, "text": "Just on that point, it's quite brave for you as a writer, as sort of coming from a world of literature and the literary thinking and historical thinking."}, {"time": 2491, "text": "I mean, just from that world and bravely talking to quite, I assume, large egos in AI or in complexity."}, {"time": 2509, "text": "Yeah, in AI or in complexity and so on."}, {"time": 2509, "text": "How'd you do it?"}, {"time": 2509, "text": "I mean, I suppose they could be intimidated of you as well because it's two different worlds coming together."}, {"time": 2523, "text": "I never picked up that anybody was intimidated by me."}, {"time": 2526, "text": "But how were you brave enough?"}, {"time": 2526, "text": "Where did you find the guts to sort of... God, just dumb luck."}, {"time": 2528, "text": "I mean, this is an interesting rock to turn over."}, {"time": 2528, "text": "I'm going to write a book about it."}, {"time": 2534, "text": "And you know, people have enough patience with writers if they think they're going to end up in a book that they let you flail around and so on."}, {"time": 2544, "text": "Well, but they also look if the writer has, if there's a sparkle in their eye, if they get it."}, {"time": 2552, "text": "When were you at the Santa Fe Institute?"}, {"time": 2555, "text": "The time I'm talking about is 1990, 1991, 1992."}, {"time": 2555, "text": "But we then, because Joe was an external faculty member, were in Santa Fe every summer."}, {"time": 2566, "text": "We bought a house there and I didn't have that much to do with the Institute anymore."}, {"time": 2572, "text": "I was writing my novels."}, {"time": 2572, "text": "I was doing whatever I was doing."}, {"time": 2580, "text": "But I loved the Institute and I loved again, the audacity of the ideas."}, {"time": 2588, "text": "That really appeals to me."}, {"time": 2592, "text": "I think that there's this feeling, much like in great institutes of neuroscience, for example, that they're in it for the long game of understanding something fundamental about reality and nature."}, {"time": 2609, "text": "So if we start now to look a little bit more recently, how, you know, AI is really popular today."}, {"time": 2616, "text": "How is this world, you mentioned algorithmic, but in general, is the spirit of the people, the kind of conversations you hear through the grapevine and so on, is that different than the roots that you remember?"}, {"time": 2635, "text": "The same kind of excitement, the same kind of, this is really going to make a difference in the world."}, {"time": 2641, "text": "And it will."}, {"time": 2641, "text": "You know, a lot of folks, especially young, 20 years old or something, they think we've just found something special here."}, {"time": 2647, "text": "We're going to change the world tomorrow."}, {"time": 2654, "text": "On a time scale, do you have a sense of what, of the time scale at which breakthroughs of the time scale at which breakthroughs in AI happen?"}, {"time": 2664, "text": "I really don't."}, {"time": 2664, "text": "Because look at Deep Learning."}, {"time": 2672, "text": "That was, Jeffrey Hinton came up with the algorithm in 86."}, {"time": 2672, "text": "But it took all these years for the technology to be good enough to actually be applicable."}, {"time": 2684, "text": "So no, I can't predict that at all."}, {"time": 2696, "text": "I wouldn't even try."}, {"time": 2696, "text": "Well, let me ask you to, not to try to predict, but to speak to the, you know, I'm sure in the 60s, as it continues now, there's people that think, let's call it, we can call it this fun word, the singularity."}, {"time": 2709, "text": "When there's a phase shift, there's some profound feeling where we're all really surprised by what's able to be achieved."}, {"time": 2716, "text": "I'm sure those dreams are there."}, {"time": 2722, "text": "I remember reading quotes in the 60s and those continued."}, {"time": 2722, "text": "How have your own views, maybe if you look back, about the timeline of a singularity changed?"}, {"time": 2734, "text": "Well, I'm not a big fan of the singularity as Ray Kurzweil has presented it."}, {"time": 2746, "text": "How would you define the Ray Kurzweil?"}, {"time": 2746, "text": "How do you think of singularity in those?"}, {"time": 2753, "text": "If I understand Kurzweil's view, it's sort of, there's going to be this moment when machines are smarter than humans and, you know, game over."}, {"time": 2759, "text": "However, the game over is."}, {"time": 2759, "text": "I mean, do they put us on a reservation?"}, {"time": 2767, "text": "Do they, et cetera, et cetera."}, {"time": 2767, "text": "And first of all, machines are smarter than humans in some ways all over the place."}, {"time": 2775, "text": "And they have been since adding machines were invented."}, {"time": 2781, "text": "So it's not, it's not going to come like some great eatable crossroads, you know, where they meet each other and our offspring, Oedipus says, you're dead."}, {"time": 2789, "text": "It's just not going to happen."}, {"time": 2797, "text": "So it's already game over with calculators, right?"}, {"time": 2797, "text": "They're already out to do much better at basic arithmetic than us."}, {"time": 2804, "text": "But you know, there's a human like intelligence."}, {"time": 2804, "text": "And it's not the ones that destroy us, but you know, somebody that you can have as a, as a friend, you can have deep connections with that kind of passing the touring test and beyond those kinds of ideas."}, {"time": 2817, "text": "Have you dreamt of those?"}, {"time": 2824, "text": "Oh yes, yes, yes."}, {"time": 2824, "text": "Those possibilities."}, {"time": 2824, "text": "In a book I wrote with Ed Feigenbaum, a book I wrote with Ed Feigenbaum, there's a little story called the geriatric robot."}, {"time": 2837, "text": "And how I came up with the geriatric robot is a story in itself."}, {"time": 2837, "text": "But here's what the geriatric robot does."}, {"time": 2844, "text": "It doesn't just clean you up and feed you and wheel you out into the sun."}, {"time": 2849, "text": "It's great advantages."}, {"time": 2849, "text": "It listens."}, {"time": 2849, "text": "It says, tell me again about the great coup of 73."}, {"time": 2849, "text": "Tell me again about how awful or how wonderful your grandchildren are and so on and so forth."}, {"time": 2872, "text": "And it isn't hanging around to inherit your money."}, {"time": 2872, "text": "It isn't hanging around because it can't get any other job."}, {"time": 2879, "text": "This is his job."}, {"time": 2879, "text": "And so on and so forth."}, {"time": 2879, "text": "Well, I would love something like that."}, {"time": 2889, "text": "I mean, for me, that deeply excites me."}, {"time": 2889, "text": "So I think there's a lot of us."}, {"time": 2895, "text": "Lex, you gotta know, it was a joke."}, {"time": 2895, "text": "I dreamed it up because I needed to talk to college students and I needed to give them some idea of what AI might be."}, {"time": 2900, "text": "And they were rolling in the aisles as I elaborated and elaborated and elaborated."}, {"time": 2906, "text": "When it went into the book, they took my hide off in the New York Review of Books."}, {"time": 2916, "text": "This is just what we have thought about these people in AI."}, {"time": 2921, "text": "They're inhuman."}, {"time": 2921, "text": "Come on, get over it."}, {"time": 2921, "text": "Don't you think that's a good thing for the world that AI could potentially do?"}, {"time": 2927, "text": "And furthermore, I'm pushing 80 now."}, {"time": 2932, "text": "By the time I need help like that, I also want it to roll itself in a corner and shut the fuck up."}, {"time": 2942, "text": "Let me linger on that point."}, {"time": 2942, "text": "Do you really though?"}, {"time": 2949, "text": "Yeah, I do."}, {"time": 2949, "text": "Don't you want it to push back a little bit?"}, {"time": 2953, "text": "A little."}, {"time": 2953, "text": "But I have watched my friends go through the whole issue around having help in the house."}, {"time": 2960, "text": "And some of them have been very lucky and had fabulous help."}, {"time": 2960, "text": "And some of them have had people in the house who want to keep the television going on all day, who want to talk on their phones all day."}, {"time": 2974, "text": "Just roll yourself in the corner and shut the fuck up."}, {"time": 2974, "text": "Unfortunately, us humans, when we're assistants, we're still, even when we're assisting others, we care about ourselves more."}, {"time": 2987, "text": "And so you create more frustration."}, {"time": 2987, "text": "And a robot AI assistant can really optimize the experience for you."}, {"time": 2994, "text": "I was just speaking to the point, you actually bring up a very, very good point."}, {"time": 3001, "text": "But I was speaking to the fact that us humans are a little complicated, that we don't necessarily want a perfect servant."}, {"time": 3011, "text": "I don't, maybe you disagree with that, but there's a, I think there's a push and pull with humans."}, {"time": 3021, "text": "A little tension, a little mystery that, of course, that's really difficult for AI to get right."}, {"time": 3021, "text": "But I do sense, especially today with social media, that people are getting more and more lonely, even young folks, and sometimes especially young folks, that loneliness, there's a longing for connection and AI can help alleviate some of that loneliness."}, {"time": 3042, "text": "Some, just somebody who listens, like in person."}, {"time": 3050, "text": "So to speak."}, {"time": 3050, "text": "So to speak, yeah."}, {"time": 3050, "text": "Yeah, that to me is really exciting."}, {"time": 3063, "text": "That is really exciting."}, {"time": 3063, "text": "But so if we look at that, that level of intelligence, which is exceptionally difficult to achieve actually, as the singularity or whatever, that's the human level bar, that people have dreamt of that too."}, {"time": 3075, "text": "Turing dreamt of it."}, {"time": 3075, "text": "He had a date timeline."}, {"time": 3075, "text": "Do you have, how have your own timeline evolved on past?"}, {"time": 3087, "text": "I don't even think about it."}, {"time": 3088, "text": "You don't even think?"}, {"time": 3089, "text": "Just this field has been so full of surprises for me."}, {"time": 3098, "text": "You're just taking in and see the fun about the basic science."}, {"time": 3102, "text": "I just can't."}, {"time": 3102, "text": "Maybe that's because I've been around the field long enough to think, you know, don't go that way."}, {"time": 3108, "text": "Herb Simon was terrible about making these predictions of when this and that would happen."}, {"time": 3114, "text": "And he was a sensible guy."}, {"time": 3120, "text": "His quotes are often used, right?"}, {"time": 3123, "text": "As a legend, yeah."}, {"time": 3124, "text": "Do you have concerns about AI, the existential threats that many people like Elon Musk and Sam Harris and others are thinking about?"}, {"time": 3138, "text": "That takes up half a chapter in my book."}, {"time": 3138, "text": "I call it the male gaze."}, {"time": 3149, "text": "Well, you hear me out."}, {"time": 3149, "text": "The male gaze is actually a term from film criticism."}, {"time": 3156, "text": "And I'm blocking on the women who dreamed this up."}, {"time": 3156, "text": "But she pointed out how most movies were made from the male point of view, that women were objects, not subjects."}, {"time": 3164, "text": "They didn't have any agency and so on and so forth."}, {"time": 3173, "text": "So when Elon and his pals Hawking and so on came, AI is going to eat our lunch and our dinner and our midnight snack too, I thought, what?"}, {"time": 3188, "text": "And I said to Ed Feigenbaum, oh, this is the first guy."}, {"time": 3188, "text": "First, these guys have always been the smartest guy on the block."}, {"time": 3193, "text": "And here comes something that might be smarter."}, {"time": 3193, "text": "Oh, let's stamp it out before it takes over."}, {"time": 3198, "text": "And Ed laughed."}, {"time": 3198, "text": "He said, I didn't think about it that way."}, {"time": 3204, "text": "But I did."}, {"time": 3204, "text": "And it is the male gaze."}, {"time": 3204, "text": "Okay, suppose these things do have agency."}, {"time": 3214, "text": "Well, let's wait and see what happens."}, {"time": 3214, "text": "Can we imbue them with ethics?"}, {"time": 3214, "text": "Can we imbue them with a sense of empathy?"}, {"time": 3223, "text": "Or are they just going to be, I don't know, we've had centuries of guys like that."}, {"time": 3234, "text": "That's interesting that the ego, the male gaze is immediately threatened."}, {"time": 3234, "text": "And so you can't think in a patient, calm way of how the tech could evolve."}, {"time": 3245, "text": "Speaking of which, your 96 book, The Future of Women, I think at the time and now, certainly now, I mean, I'm sorry, maybe at the time, but I'm more cognizant of now, is extremely relevant."}, {"time": 3263, "text": "You and Nancy Ramsey talk about four possible futures of women in science and tech."}, {"time": 3270, "text": "So if we look at the decades before and after the book was released, can you tell a history, sorry, of women in science and tech and how it has evolved?"}, {"time": 3286, "text": "How have things changed?"}, {"time": 3286, "text": "Where do we stand?"}, {"time": 3286, "text": "They have not changed enough."}, {"time": 3294, "text": "The way that women are ground down in computing is simply unbelievable."}, {"time": 3294, "text": "But what are the four possible futures for women in tech from the book?"}, {"time": 3305, "text": "What you're really looking at are various aspects of the present."}, {"time": 3313, "text": "So for each of those, you could say, oh yeah, we do have backlash."}, {"time": 3313, "text": "Look at what's happening with abortion and so on and so forth."}, {"time": 3320, "text": "We have one step forward, one step back."}]}]