[{"title": "Sergey Nazarov: Chainlink, Smart Contracts, and Oracle Networks | Lex Fridman Podcast #181", "id": "TPXTmVdlyoc", "quotes": [{"time": 251, "text": "But that's limited by human cognitive capabilities."}, {"time": 254, "text": "It is, but I don't really have anything else, right?"}, {"time": 256, "text": "I think all of these papers that brought up these questions of assimilation, they were like in epistemology and metaphysics."}, {"time": 261, "text": "And what they were trying to do, I think, was they were trying to put people through a thought experiment where they would come out on the other end and say the reality of life is really worth something."}, {"time": 273, "text": "And I don't, you know, ignorance isn't bliss, which is that consistent statement in the matrix, right?"}, {"time": 278, "text": "Ignorance is bliss is that that's what one of the guys says when he's like, you know, doing something wrong and trying to get back into the matrix."}, {"time": 284, "text": "And the question is, is ignorance bliss?"}, {"time": 287, "text": "And it's like a different version of that."}, {"time": 289, "text": "I think from a perceptual point of view, if my perceptions aren't in any way different, so fidelity is very good, it doesn't matter."}, {"time": 300, "text": "So if I don't know something, it doesn't really exist."}, {"time": 304, "text": "And if it doesn't exist in my perception or my consciousness, then it doesn't exist, period, for me, at least."}, {"time": 311, "text": "And then whether it exists in some, you know, more metaphysical version of things, I personally never really got into the metaphysics stuff because I could never really, I couldn't understand what the point of it was, right?"}, {"time": 324, "text": "It's one of these things where I couldn't really get what the practical application of it was."}, {"time": 332, "text": "And this is from those realm of questions, right?"}, {"time": 334, "text": "Like if there was something about the world, but you didn't have a capacity to perceive it, would it matter to you?"}, {"time": 341, "text": "To me, it wouldn't matter."}, {"time": 343, "text": "Right, to me, by the way, the simulation thing is a really interesting engineering question, which is how difficult is it to engineer a virtual reality, a digital world that is sufficiently of high fidelity where you would want to live in it?"}, {"time": 359, "text": "I think that's a really testable and a fascinating engineering question."}, {"time": 363, "text": "So my intuition says like, it's not as difficult as we think."}, {"time": 366, "text": "It's not nearly as difficult as having to create a quantum mechanical simulation that's large enough to capture the full human experience."}, {"time": 374, "text": "Like it might be just as simple as just a really nice quake game, like with a nice engine, with just creating all the basic visual elements that trick our cognitive, our visual cortex into believing that we're actually in the physical environment."}, {"time": 391, "text": "And I think that if that's true, then that's quite a high fidelity digital world is actually achievable within a century."}, {"time": 402, "text": "And that changes things."}, {"time": 404, "text": "Yeah, yeah, maybe in our lifetime."}, {"time": 407, "text": "I'm really hoping for that."}, {"time": 407, "text": "I'm hoping somebody can copy my brainwaves onto a virtual machine and allow that consciousness to continue to exist."}, {"time": 415, "text": "Whether that's death or not, I don't know."}, {"time": 419, "text": "But I think it's actually gonna require some serious leaps."}, {"time": 423, "text": "Like even the VR headsets, right?"}, {"time": 425, "text": "They don't work if they go below 90 frame rates, right?"}, {"time": 429, "text": "People start getting freaked out."}, {"time": 431, "text": "So you have to go from one gaming screen of 60 frames per second to two screens of 90 frames per second."}, {"time": 439, "text": "And so people's hardware today can't even handle that."}, {"time": 442, "text": "And that's for these two little screens by your eyeballs."}, {"time": 446, "text": "What it's gonna take to completely trick my consciousness into not knowing the difference in terms of like all the sensory inputs."}, {"time": 456, "text": "I'm keeping my fingers crossed."}, {"time": 457, "text": "Whoever does that and is close to doing that, they should contact me."}, {"time": 462, "text": "I want to have my brainwaves turned into a virtual machine."}, {"time": 466, "text": "Would you in that context, if Morpheus came to you, would you take the blue pill or the red pill?"}, {"time": 473, "text": "Meaning, would you be happy just living in that world and not knowing that you're living inside that virtual world that's running a computer?"}, {"time": 483, "text": "Or would you want to know the truth of it?"}, {"time": 486, "text": "Well, actually I think that's a very different question, right?"}, {"time": 489, "text": "There's a actually moral ethical question there about whether you should allow a bunch of people to get manipulated and killed and slaved, because in the matrix they're all enslaved as like a AAA battery to turn a human being into the battery, right?"}, {"time": 505, "text": "So I think the moral and ethical question of that, fascinating enough, isn't actually different than the moral and ethical questions we face today in modern daily life."}, {"time": 516, "text": "But I probably have given the choice of just completely going along or going against it."}, {"time": 523, "text": "I would probably go against it if I had to make this kind of binary choice."}, {"time": 528, "text": "Because going along with it, I think at that scale of scary stuff happening to people is probably something really, really, really difficult."}, {"time": 540, "text": "But for your individual life, it's way more fun to go along with it."}, {"time": 543, "text": "So you're saying you value the opposing a system that includes the suffering of others versus just for yourself enjoying the ride."}, {"time": 555, "text": "I mean, if there is such a binary choice, why choose to oppose the system?"}, {"time": 561, "text": "I think it's the nature of kind of the ethical dilemma that you face in that situation."}, {"time": 566, "text": "There's kind of some, this is obviously not something that's happening now, right?"}, {"time": 569, "text": "We don't know this, right?"}, {"time": 571, "text": "No, we don't know this."}, {"time": 573, "text": "At the end of the day, at that scale of something like that happening, yeah, that scale of people being manipulated and harmed, then I think pretty much almost all people have an obligation to go against it."}, {"time": 589, "text": "Probably that's what that looks like in my opinion."}, {"time": 593, "text": "So you've talked about the concept of definitive truth."}, {"time": 598, "text": "And in general, what is the nature of truth in human civilization?"}, {"time": 601, "text": "And just talking about the digital age, the nature of truth in the digital age."}, {"time": 609, "text": "So the interesting thing about definitive truth is that it actually exists on this, at least in my mind on this spectrum between objective truth and just somebody made something up and nobody else agrees."}, {"time": 622, "text": "So what I think definitive truth is, is it's somewhere in the middle on that spectrum where if you and me define what truth is, right?"}, {"time": 661, "text": "I think the objective truth definition from kind of the philosophical world is really, really stringent and very, very hard to attain."}, {"time": 672, "text": "And that's not what this is."}, {"time": 674, "text": "And that's actually not what commerce or the ability for people to interact about contracts needs."}, {"time": 680, "text": "What I think the world of commerce needs is an upgrade from someone can unilaterally decide what the truth is to there can be a pre agreed set of conditions where we define what the truth is under those conditions."}, {"time": 730, "text": "In any case, much better than, I'm a bank or an insurance company, I'm gonna unilaterally decide what happens."}, {"time": 736, "text": "It's definitely an upgrade from that."}, {"time": 738, "text": "Do you think it's possible to define formally in this way, a definitive truth for many things in this world?"}, {"time": 744, "text": "Like you talked about weather, basically defining that if three sensors of weather agree, then that we're going to agree that that is a definitive, useful truth for us to operate under."}, {"time": 756, "text": "So how many things in this world can be formalized in this way, do you think?"}, {"time": 761, "text": "A huge amount."}, {"time": 763, "text": "So there's actually two things going on here."}, {"time": 768, "text": "One thing is the amount of data that already exists and the pieces of data coming off of markets, IOT, shipment of goods, any number of other things."}, {"time": 779, "text": "Like even your YouTube channel has a certain amount of likes or a certain amount of clicks or a certain amount of views and even that's quantifiable."}, {"time": 786, "text": "So even to a certain degree, what we do here today, you and me right now can be quantified as far as the amount of views, the amount of clicks, the amount of any number of other things."}, {"time": 794, "text": "Yeah, you, the viewer, have power of data in your hands by clicking like or dislike right now or the subscribe button or the unsubscribe button, which I encourage you to do."}, {"time": 804, "text": "Anyway, okay, so there's data flowing into all interactions in this world, there's data."}, {"time": 810, "text": "There's more and more data, right?"}, {"time": 811, "text": "More and more data."}, {"time": 813, "text": "That data is more and more accessible to everybody and that accessibility and the fact that there's more of it means we can form more definitive truth proofs."}, {"time": 822, "text": "We can form more and more proofs and as we form those proofs, well, we can provide them to these blockchains and smart contract systems that consume them and then they're tamper proof, right?"}, {"time": 832, "text": "So they can't be manipulated."}, {"time": 834, "text": "And so now we've combined a system that can prove things with a system that guarantees a certain outcomes and we have a better system of contracts, which is actually an unbelievably powerful tool that has never existed before."}, {"time": 848, "text": "Can we talk about the world of commerce and finance, decentralized finance?"}, {"time": 853, "text": "What is it, what's its promise from both the philosophical and technical perspective?"}, {"time": 860, "text": "If we just zoom in on that particular space of the digital world."}, {"time": 864, "text": "Sure, so the decentralized finance is the instantiation of a specific type of smart contract, right?"}, {"time": 871, "text": "Or what I call hybrid smart contracts, which are these contracts that combine the on chain code together with the off chain proofs that something happened."}, {"time": 880, "text": "They're called a hybrid because they basically use both of these systems, right?"}, {"time": 883, "text": "The blockchain and the proofs about what happened."}, {"time": 887, "text": "And what DeFi is, is one specific type of hybrid smart contract that is taking on the contractual agreements you traditionally find in the global financial system, right?"}, {"time": 901, "text": "And that's basically the world of lending, the world of yield generation for people giving me or giving whoever their money and somebody giving back them yield back to them, which is what bonds do and what treasuries do and what a lot of the global financial markets do, as well as the ability to gain exposure and protection from different types of events and risks."}, {"time": 923, "text": "That's a lot of what derivatives do, right?"}, {"time": 924, "text": "Derivatives allow us to say, hey, something's gonna happen."}, {"time": 927, "text": "And I'm either gonna protect myself by getting paid if it happens, or I'm going to benefit from it happening by basically saying it's gonna happen, putting money down on that, and that prediction will get me a return."}, {"time": 938, "text": "Now, that's a very large part of the global financial system, excluding all the stuff for global trade and letters of credit and all the stuff that facilitates international trade."}, {"time": 948, "text": "So excluding that at least for now."}, {"time": 950, "text": "So if we look at what decentralized finance does, it takes all of those agreements about generating yield, lending, and all of these types of things you find in global finance and the world of derivatives and a few other types of financial products."}, {"time": 964, "text": "And it basically puts them into a different format, right?"}, {"time": 967, "text": "So the format you have for centralized financial agreements is that you go to a bank, even if you're a hedge fund, even if you're like the richest people, you go to a bank, they make a product for you, and you hope that they honor the product that they made for you."}, {"time": 981, "text": "Or you do a deal with another hedge fund or whoever, some counterparty, and you hope that that deal is honored."}, {"time": 989, "text": "And then a number of very freaky things start to take place."}, {"time": 992, "text": "One of them is people don't have clarity about what the agreement is, right?"}, {"time": 998, "text": "So a lot of people don't know exactly what the agreement is between those parties because they can't actually see it."}, {"time": 1006, "text": "Sometimes agreements are kept very private or parts of them are kept private."}, {"time": 1010, "text": "And that keeps other counterparties, other people in the system from understanding what's going on."}, {"time": 1015, "text": "This is actually partly what happened with the mortgage crisis."}, {"time": 1018, "text": "The mortgage crisis in 2008 was basically, there were a lot of agreements, there were a lot of assets, but because the centralized financial system worked in such an opaque way, it was so unbelievably difficult to understand what was going on, right?"}, {"time": 1031, "text": "And so that lack of understanding for the global financial system basically led to a big boom, and then correspondingly, very, very big bust, which amazingly enough had a huge impact on everybody, even though they didn't participate in the boom part of the equation."}, {"time": 1045, "text": "In any case, what decentralized finance does is it takes these financial contracts that power the global financial system, it puts them in this new blockchain based format that basically at this point provides three very powerful things."}, {"time": 1059, "text": "The first thing that it provides is complete transparency over what's going on with your financial product."}, {"time": 1085, "text": "So you have complete transparency into what's going on in the financial protocol that you have your assets in, which is because blockchains and the infrastructure, all of these things are built on, force that transparency."}, {"time": 1099, "text": "Whereas the centralized financial system is very, very good at hiding it."}, {"time": 1103, "text": "It's very good at hiding it and packaging things in a glossy wrapper, creating a boom, then a bust."}, {"time": 1110, "text": "The centralized finance is built on infrastructure that forces transparency such that everyone can understand what the financial product does from day one."}, {"time": 1118, "text": "And in fact, escaping that property is practically impossible or if someone tries to escape it, it becomes immediately obvious and people don't use their financial product."}, {"time": 1126, "text": "So that's number one."}, {"time": 1128, "text": "Number two is control."}, {"time": 1130, "text": "So if you look at what happened with Robinhood, everybody thought the system worked a certain way, right?"}, {"time": 1135, "text": "Everybody thought I have a brokerage account, I can trade things under a certain set of market conditions."}, {"time": 1142, "text": "And then the market conditions changed within the band of what people thought they could do."}, {"time": 1148, "text": "And everybody was fascinated to find out that, oh my God, I thought my band of market conditions in which I can control my assets is X, but it is actually Y, is actually much, much smaller band."}, {"time": 1160, "text": "And the reason it is a much, much smaller group of market conditions is that the system doesn't work the way people think it works."}, {"time": 1168, "text": "The system was wrapped up in a nice glossy wrapper and given to them to get them to participate in the system because the system requires and needs their participation."}, {"time": 1175, "text": "But if you actually look at how the system works underneath, you will see that it does not work the way people think that it works."}, {"time": 1183, "text": "And this is actually another reason that DeFi is so powerful because DeFi actually, and these blockchain contracts, give people the version of the world they think they already have, which is why they don't beg for it, right?"}, {"time": 1196, "text": "So everybody thinks they're in a certain version of the world that works in this reliable way, transparent way, they're not."}, {"time": 1202, "text": "They don't realize it."}, {"time": 1204, "text": "And so they're confused when you tell them, I'm gonna make the world work this way because they think they're already in that world."}, {"time": 1209, "text": "But then things like Robinhood make it immediately, painfully clear that that's not how the world works so that the second real property of DeFi is control, which means that you control your assets, not a bank, not a broker, not a third party, you."}, {"time": 1223, "text": "You control your Bitcoins, you control your tokens in the finance protocol."}, {"time": 1227, "text": "If you don't like how something's going in that protocol, you can remove it, you can send it to another protocol, or you can use a feature of the protocol to do something it's supposed to do."}, {"time": 1236, "text": "Nobody can just say, oops, that feature, that isn't so good for my friends over here."}, {"time": 1241, "text": "That feature is actually, we're just gonna pause that feature in the critical moment when you need it to execute your strategy, which is why you took all the risks to begin with."}, {"time": 1252, "text": "And then the final reason, the final thing to know about DeFi is that DeFi is inherently global, and actually right now provides better yield globally."}, {"time": 1262, "text": "So if you go to a bank right now with the US dollar, you get 1% or less."}, {"time": 1267, "text": "If you go to DeFi with the US dollar, you get 7% or 8%."}, {"time": 1303, "text": "I think that's what DeFi is about in a practical sense."}, {"time": 1306, "text": "It is this clarity about your risk."}, {"time": 1308, "text": "It is control over your assets."}, {"time": 1311, "text": "And amazingly, at the same time as having those two unbelievably useful properties, it is actually superior yield, which just leads me to the very obvious conclusion that the only reason DeFi is more used is because more people don't know about it."}, {"time": 1328, "text": "And by virtue of this long kind of explanation here and elsewhere, more people will know about it."}, {"time": 1334, "text": "And it's just such an obviously superior solution that I haven't heard a single explanation as to why."}, {"time": 1340, "text": "No, no, don't earn 8% and take less risk and have more transparency with your assets."}, {"time": 1347, "text": "Earn 7% less, take more risk, and give people the ability to change the rules on you at their discretion, go do that."}, {"time": 1356, "text": "Who's gonna do that?"}, {"time": 1357, "text": "And in general, on the first two of transparency and control, first of all, I do think, maybe you can correct me, but from my perspective, they're deeply tied together in the sense that transparency gives control."}, {"time": 1370, "text": "Transparency creates accountability, and there's this kind of game being played, game theoretic game, where if I know, if you know I'm gonna discover your deviation, you're not gonna deviate."}, {"time": 1382, "text": "Yes, this could be a whole nother conversation, but just as a small aside, on the social network side of things, which I've been thinking deeply about in the past year or so, of how to do it right there, how to fix our social media."}, {"time": 1398, "text": "And I tend to believe that human beings, if they're given clear transparency about which data is being stored, how it's being used, where it's being moved about, just all a clear, simple transparency of how their data is being used, and them having the control at the very minimal level of being able to participate or to walk away, and walk away means delete everything you've ever known about me."}, {"time": 1428, "text": "That will create a much, much better world."}, {"time": 1431, "text": "That currently there's a complete lack of transparency on social media, how the data is being used for your own protection."}, {"time": 1437, "text": "I mean, there's a lot of parallels to the central bank situation, and there's not a control element of being able to walk away."}, {"time": 1444, "text": "Like being able to delete all your data, delete your account on Facebook is very difficult."}, {"time": 1449, "text": "It doesn't take a single click, which I think is what it should take."}, {"time": 1452, "text": "There should be a big red button that says, delete everything you've ever known about me, or like forget me."}, {"time": 1459, "text": "So I think that coupled together can create a very different kind of world and create an incentivization that will lead to like progress and innovation and just like a much better social network and a really good business for the future social networks."}, {"time": 1477, "text": "But so I tend to see like control as naturally being a sort of an outgrowth from the transparency."}, {"time": 1487, "text": "It should all start at the transparency, which is why the smart contract formulation is fascinating."}, {"time": 1494, "text": "Because like you're formalizing in a simple, clear way, any agreements that you're participating in."}, {"time": 1501, "text": "And as a side comment also, what's really inspiring to me is that I think there's a greater, I don't know if this is always the case, but it seems like from having talked to people on the psychological element, there's a hunger amongst people for transparency and for control."}, {"time": 1523, "text": "Like transparency, another word for that is authenticity."}, {"time": 1526, "text": "If you look at the kind of stuff that people hunger for now, they want to know the reality of who you are as an individual."}, {"time": 1533, "text": "So that means you can create businesses, you can create tools that are built on authenticity, a transparency."}, {"time": 1541, "text": "And then the same, I'm inspired by the intelligence of people, if you give them control, if you give them power, that they would make good choices."}, {"time": 1554, "text": "Of course, not everybody, but that means that decentralized power can create effective systems."}, {"time": 1561, "text": "So couple that, there's a hunger for transparency so we can move to a world where everyone's being just like real, conveying their genuine human nature."}, {"time": 1570, "text": "And people are sufficiently intelligent that if they're given power in a distributed mass scale sense, that we're going to build a better world through that, as opposed to centralized supervised control or only a small percent of the population know what the hell they're doing."}, {"time": 1587, "text": "Everybody else is clueless sheep."}, {"time": 1590, "text": "So those two coupled together is really to me inspiring."}, {"time": 1595, "text": "Just to really quickly comment on this stuff that you just said, which I think is super, super, super fascinating."}, {"time": 1600, "text": "I think that's all exactly right."}, {"time": 1602, "text": "I think everything that you said is right."}, {"time": 1628, "text": "So they get all the features, but the autonomous piece of code gives them the ability to have control while getting all the features, right?"}, {"time": 1637, "text": "So banks give you features, social media sites give you features, whatever other system that you use online gives you features, and then it takes your data and it takes control of your assets from you in return for those features, right?"}, {"time": 1652, "text": "I think the whole big difference here, partly in line with the definition of smart contracts and its evolution is that there's this, now there's this autonomous piece of code that's giving you all those features without requiring the ownership and lock in and control and unilateral kind of ownership of your data or your value or whatever it is that you're giving it, right?"}, {"time": 1718, "text": "And so this is just the recurring pattern of what I think all of this will do is it'll give people, it gives people a better deal, right?"}, {"time": 1726, "text": "It gives them features without ownership of data, without ownership of value, and that's really the difference."}, {"time": 1733, "text": "So I think this is a good place to talk about smart contracts then."}, {"time": 1736, "text": "Can you tell me the history of smart contracts and the basic sort of definitions of what is it?"}, {"time": 1742, "text": "Sure, so I think smart contracts as a definition has actually gone through some kind of changes or small evolution."}, {"time": 1750, "text": "Initially, I think it was actually a conception of a digital agreement that was tamper proof and could know things about the world, right?"}, {"time": 1757, "text": "So it could get proof and it could define that something happened and it could conclude an outcome and release payment or do something else."}, {"time": 1764, "text": "That's actually the definition of smart contracts that I began working in this industry with seven or eight years ago when I started making smart contracts."}, {"time": 1771, "text": "That is the conception that I had of a smart contract."}, {"time": 1774, "text": "Then what happened was that was really hard to do, right?"}, {"time": 1778, "text": "Building that type of tamper proof digital agreement that could also know things about the real world and release payments back to people about those events that were codified in this tamper proof format was actually a very tall order."}, {"time": 1791, "text": "Turns out it's consistent of three parts."}, {"time": 1793, "text": "It's consisting of the contract, the proof about what happened and the release of value."}, {"time": 1798, "text": "The way things have evolved so far is that the definition has now come to mean on chain code."}, {"time": 1805, "text": "So it's come to mean the codification of contractual agreement on a blockchain, right?"}, {"time": 1811, "text": "So there's some code somewhere on some blockchain that defines what the agreement is."}, {"time": 1817, "text": "Now that eliminates the part of the definition that's related to knowing things about the world and it partly eliminates the definition about payments and stuff like that."}, {"time": 1826, "text": "But basically it's on chain code, right?"}, {"time": 1830, "text": "We in our recent work on a second white paper have actually put out a different definition that we call hybrid smart contracts that actually tries to go back to the initial definition that I started with seven or eight years ago, which basically says that there's some proof somewhere that's proven to the contract and the contract can know that and the contract can gain proof."}, {"time": 1851, "text": "Then it can use that proof to settle the agreement that's codified on a blockchain."}, {"time": 1857, "text": "So you both need a mechanism to provide proof."}, {"time": 1860, "text": "You need a mechanism to codify the contract in a tamper proof way on something like a blockchain."}, {"time": 1865, "text": "And then as with all contracts, there's a presumption that there's some kind of release of value."}, {"time": 1869, "text": "So I think a smart contract in our industry right now means on chain code, which limits it to whatever can be done on chain only."}, {"time": 1879, "text": "And then in our internal definition for us and for us at Chainlink and for me, it's hybrid smart contracts, which is actually the original definition."}, {"time": 1888, "text": "It's the idea that a contract can both know what happened and automatically resolve to the proper outcome based on what happened."}, {"time": 1898, "text": "So you're referring to the Chainlink 2.0 white paper, which is a paper that I recommend people look."}, {"time": 1905, "text": "It's a very easy read and very well structured and very thorough."}, {"time": 1909, "text": "So I really enjoyed it."}, {"time": 1910, "text": "Very recently released, I guess."}, {"time": 1913, "text": "Can you dig in deeper?"}, {"time": 1913, "text": "What is a hybrid smart contract?"}, {"time": 1917, "text": "You mentioned sort of this idea of data or knowing about the world and on chain and off chain."}, {"time": 1925, "text": "So what are the different roles in this?"}, {"time": 1927, "text": "So hybrid, by the way, refers to the fact that it's on chain and off chain contracts."}, {"time": 1934, "text": "So maybe digging deeper of what the heck is it and what does it mean to know stuff about the world?"}, {"time": 1941, "text": "Like how do you actually achieve that?"}, {"time": 1946, "text": "So the on chain part is where the agreement itself is."}, {"time": 1950, "text": "That's the smart contract itself."}, {"time": 1952, "text": "And that's where you codify certain conditions, such as the conditions under which an interest payment is made or the conditions under which the contract pays out the full amount that it holds to someone based on a derivative outcome or something like that."}, {"time": 1967, "text": "Now, what the on chain code is very good at is creating transparency about what the core conditions of the contract are."}, {"time": 1973, "text": "It's very good at taking in money from other private keys that send it tokens and send it value to hold."}, {"time": 1980, "text": "And then it's also very good at returning money or returning value back to other addresses or other private keys."}, {"time": 1988, "text": "It can also be involved in governance."}, {"time": 1989, "text": "It can be involved in a few other private key signature based operations."}, {"time": 1994, "text": "But primarily the on chain part of a hybrid smart contract, from what I've seen so far, defines the agreement, takes in value and returns value based upon the conditions codified in the agreement on a blockchain."}, {"time": 2007, "text": "The second and equally important off chain part is where the term oracle and an oracle comes in or an oracle mechanism or a decentralized oracle network as we describe it in the paper."}, {"time": 2018, "text": "And this is another decentralized computational system that has a different goal, right?"}, {"time": 2025, "text": "So blockchains have the goal of packaging transactions into blocks and connecting them in a cryptographically unique way to create security and assurance about that chain of transactions."}, {"time": 2037, "text": "Oracles and decentralized oracle networks achieve consensus and they achieve decentralization about the topic of what happened, right?"}, {"time": 2049, "text": "So blockchains structure transactions."}, {"time": 2051, "text": "Some of those transactions might be the state changes in different pieces of on chain code."}, {"time": 2056, "text": "And then those on chain pieces of code require input."}, {"time": 2063, "text": "I think the thing that people get kind of a little bit thrown by is despite being called smart contracts, the on chain code on a blockchain cannot actually speak to any other system."}, {"time": 2075, "text": "So blockchains are valuable and useful as far as they're tamper proof and secure."}, {"time": 2080, "text": "And to be tamper proof and secure, they're made this kind of walled garden that is able to know and interact only with the highly reliable information that's within that system, which is basically tokens and private key signatures."}, {"time": 2096, "text": "All the other world's information is not available in a blockchain inherently."}, {"time": 2101, "text": "And a smart contract or a piece of on chain code can't just say, hey, I'm gonna go get some data from over here because the API they would get it from creates a whole bunch of security concerns for the blockchain itself and a whole bunch of consensus issues about how to agree on what that API said or what the truth of the world is, right?"}, {"time": 2119, "text": "Because it's not even agreeing on what one API said, it's more so creating a reliable form of decentralized computation that can give you a definitive proof of what happened and not just what one API said."}, {"time": 2131, "text": "So for example, some of our most widely used networks have well over 30 nodes and well over 10 data sources that are all providing information about the same type of data."}, {"time": 2140, "text": "And then there's consensus on that one piece of data, which is then written in and essentially given back into the on chain code to tell it what happened because you can't really make an agreement unless you know what happened, right?"}, {"time": 2154, "text": "If you and me were to make an agreement and set some contractual conditions, but our agreement could never know what happened, it would be completely useless."}, {"time": 2162, "text": "However, if you and me made an agreement and there was another system called an Oracle mechanism or decentralized Oracle network that proved what happened definitively and you and me pre agreed that whatever this mechanism says is what happened, then we can achieve an entirely new level of automation."}, {"time": 2178, "text": "We can suddenly say, there's this piece of on chain code that's highly reliable."}, {"time": 2183, "text": "We can give it millions, billions, eventually trillions of dollars in value."}, {"time": 2187, "text": "And it is controlled by this other system over here that's also highly reliable under this configurable set of definitive truth and decentralization conditions, which we all agree are sufficiently stringent to control that much value."}, {"time": 2201, "text": "And therefore the combination of this tamper proof on chain representation of a contract and this mutually agreed upon definition of a trigger or a proof system combined is a hybrid smart contract, which as you can see probably already does a lot more than just a contract on chain, right?"}, {"time": 2223, "text": "Can you talk about this consensus mechanism, which by the way is just fascinating."}, {"time": 2227, "text": "So there's the on chain consensus mechanism of proof of work and proof of stake."}, {"time": 2234, "text": "And then there is this Oracle network consensus mechanism of what is true."}, {"time": 2243, "text": "So how do you, can you compare the two?"}, {"time": 2246, "text": "Like how do you achieve that kind of consensus?"}, {"time": 2248, "text": "How do you achieve security in integrating data about the world in a way that's definitively true in a way that is usefully true, such that we can rely on it in making major agreements that as you said, involve billions of trillions of dollars."}, {"time": 2269, "text": "Right, so this is the challenging, this is the challenging question, right?"}, {"time": 2271, "text": "This is the challenging problem that Oracle networks, Oracles, we at Chainlink that we work on in order to create this definitive truth to trigger and create hyper automation in this more advanced form, more advanced form of hybrid smart contracts."}, {"time": 2289, "text": "The reality I think of this problem is that it is very specific to each use case."}, {"time": 2296, "text": "And it, and this is actually how we've architected our system is in a very flexible way."}, {"time": 2302, "text": "So for example, you need an ability for an Oracle network to grow in the amount of nodes that it has relative to the value it secures, right?"}, {"time": 2313, "text": "So if you have an Oracle network that secures a hundred thousand dollars in like a beta of a financial product, maybe it can be fine with only seven nodes and only two or three data sources, right?"}, {"time": 2324, "text": "Because the risk to that Oracle network is relatively low based on the value it secures."}, {"time": 2330, "text": "So the first question is actually how do you scale security relative to value secured by that Oracle network?"}, {"time": 2339, "text": "Because it wouldn't be very efficient to have a thousand nodes securing $100,000 worth of value."}, {"time": 2345, "text": "So one of the first questions is how do we properly scale and how do we compose ensembles of nodes in a decentralized way where we can know that, okay, we're going from seven nodes in a network to 15, to 31, to 57, to 105, to a thousand, right?"}, {"time": 2363, "text": "So that's one dimension of the problem."}, {"time": 2365, "text": "So you have to be scaling the number of nodes relative to the value that's derived from the truth integrated into those nodes."}, {"time": 2374, "text": "Well, that's not the only problem, right?"}, {"time": 2376, "text": "The other side of this is that you're trying to create a deterministic result, a deterministic output from a set of non deterministic disparate systems, data sources, or places that prove things."}, {"time": 2387, "text": "Can you also, just as an aside, what is an Oracle node?"}, {"time": 2391, "text": "What is the role of an Oracle node?"}, {"time": 2393, "text": "Sure, so an Oracle node essentially exists in both places, it exists in both worlds."}, {"time": 2400, "text": "It exists as an on chain contract that represents either an Oracle network or an Oracle node."}, {"time": 2407, "text": "So there's an on chain interface in the form of a contract that says, I exist to give you this list of inputs."}, {"time": 2415, "text": "You can request weather data from me, you can request price data from me, you can ask me to send a payment somewhere."}, {"time": 2420, "text": "So it's like an API, so it's a pointer to a API that provides truth about this world."}, {"time": 2428, "text": "It's an interface, so just like an API is an interface for Web 2.0 engineers, Oracle networks and the contracts that represent them or individual nodes are the interface of Web 3.0's use of services."}, {"time": 2445, "text": "And services includes all services, data, payment systems, messaging systems, whatever Web 2.0 or any kind of computing service that you can conceptualize, needs an interface on chain in the form of a contract that says, here are the services I can provide for you, here are the transactions you need to send me to get back this data or that computation or this result."}, {"time": 2471, "text": "And then what you actually see is that decentralized Oracle networks, because they're uniquely capable of generating their own computations in a decentralized way around the data that they have access to, you actually see decentralized Oracle networks generating a lot of these services."}, {"time": 2486, "text": "So for example, we have a randomness service, a verifiable randomness function service that basically provides randomness on chain and that randomness is then used in lotteries and various other contracts that need randomness."}, {"time": 2500, "text": "But that randomness, it's not a piece of data that comes from somewhere else."}, {"time": 2503, "text": "We don't go to another data source and get it."}, {"time": 2506, "text": "We generate it within an Oracle node that then provides it over into Oracle node or Oracle nodes that provide it into the contracts themselves."}, {"time": 2515, "text": "So why do you say Oracle nodes are non deterministic?"}, {"time": 2518, "text": "Well, they are as far as they come to consensus, but there's this kind of different problem here, right?"}, {"time": 2525, "text": "The blockchains are very focused on generating blocks of transactions within a smaller universe of transaction types, a certain block size and a certain set of conditions."}, {"time": 2536, "text": "And then they have a economic system that says, I will perpetually generate blocks of this size with these transaction types in this kind of limited set of transaction types, whether those are UTXO transactions or scripted solidity or whatever it is."}, {"time": 2552, "text": "Oracles and Oracle networks, we don't have a blockchain, for example."}, {"time": 2556, "text": "There is no chain link blockchain."}, {"time": 2558, "text": "Our goal is not to generate a certain set of very clearly predetermined transaction types into a set of transactions that are put into blocks and it will infinitely be done that way."}, {"time": 2570, "text": "Our goal is actually to create what we call a Meta layer, a decentralized Meta layer between the non deterministic, highly unreliable world and the highly hyper reliable world of blockchains so that the unreliable world can be passed through this decentralized Meta layer."}, {"time": 2590, "text": "And it can coexist with a reliable on chain world."}, {"time": 2593, "text": "Exactly, it can coexist and in some cases, the Meta layer might generate it."}, {"time": 2597, "text": "So the problem in giving you this straight answer is that there's just such a wide array of services."}, {"time": 2604, "text": "If you were to say, well, Sergey, how do we generate randomness from a data source?"}, {"time": 2608, "text": "Well, we don't use a data source to generate the randomness."}, {"time": 2611, "text": "That's the type of service that can be generated in an Oracle network itself."}, {"time": 2615, "text": "And so there'll be certain computations that Oracle networks themselves generate themselves to augment and improve blockchains."}, {"time": 2623, "text": "And it is actually the goal of Oracles to consistently do that."}, {"time": 2625, "text": "So if you were to think about the stack in a very generic high level, you would see blockchains or databases."}, {"time": 2632, "text": "They're basically the data structures that retain a lot of information in this transparent, highly reliable form."}, {"time": 2638, "text": "Smart contract code is the application logic."}, {"time": 2641, "text": "It is the logic under which all of this kind of activity occurs, storing data in the data structure in the blockchain as a database in a certain conceptualization of it."}, {"time": 2653, "text": "And then Oracles and Oracle networks are all the services that are used by the application code."}, {"time": 2660, "text": "So, you know, by analogy, let's take Uber."}, {"time": 2663, "text": "Uber initially, some core code goes and gets the GPS API from Google Maps about the user's location, sends a message to the user through Twilio, pays the driver through Stripe."}, {"time": 2674, "text": "If those services weren't available to the people who made Uber, they wouldn't have made Uber, right?"}, {"time": 2679, "text": "Because they would have written their core code on some database, and then they would have had to make a geolocation company, a telecom messaging company, and the global payments company."}, {"time": 2688, "text": "And they wouldn't have done that because it's too hard."}, {"time": 2690, "text": "And that's the weird scenario that a lot of people in our industry are in."}, {"time": 2694, "text": "And that's the problem that Oracles and Oracle networks fix is they provide these decentralized services to take this developer ecosystem, the blockchain and smart contract developer ecosystem from, hey, I can have a database and write some application logic about tokenization and voting and private key signing, all of which is super useful and is a critical foundation."}, {"time": 2717, "text": "But now, if you just layer on all the world's services, whether that's market data, weather data, randomness, suddenly people can build DeFi, fraud proof gaming, fraud proof global trade, fraud proof ad networks."}, {"time": 2730, "text": "And that's why this world of decentralized services and decentralized Oracle networks is particularly, in my opinion, important to our industry."}, {"time": 2739, "text": "And you talk about the currents of a decentralized world, decentralized world, DeFi, but decentralized services world is primarily just tokens."}, {"time": 2748, "text": "And it's basically just financial transactions."}, {"time": 2751, "text": "And the kind of thing, the reason why it's super exciting, the kind of thing you do with Chainlink and Oracle networks is that you can basically open up the whole world of services to this kind of decentralized smart contract world."}, {"time": 2767, "text": "I mean, you're talking about just orders of magnitude greater impact financially and just socially and philosophically."}, {"time": 2781, "text": "Are there interesting near term and long term applications that excite you?"}, {"time": 2786, "text": "Yeah, there's a lot that excites me."}, {"time": 2787, "text": "And that is how I think about it, that it's not just about we made a decentralized Oracle network."}, {"time": 2791, "text": "It's about we made a decentralized service or collection of services that's going from hundreds to thousands."}, {"time": 2797, "text": "And then people are able to build the hybrid smart contracts, which I think will redefine what our industry is about."}, {"time": 2803, "text": "Because for example, for the people that only learned about blockchains through the lens of NFTs, they understand blockchains through NFTs, not through speculative tokens or Bitcoins, right?"}, {"time": 2813, "text": "And I think that will continue."}, {"time": 2815, "text": "I think the use cases that excite me, they vary between the developed market, the developed world's economies and emerging markets."}, {"time": 2824, "text": "I think in the developed world, what you will see is that transparency, creating a new level of information for how markets work and the risk that is in markets and kind of the dynamics that put the global financial system at systemic financial risk like 2008."}, {"time": 2869, "text": "I think in the process of doing that and which is happening, I think right about now, you see a polishing of the technology such that it can be made available to emerging markets."}, {"time": 2879, "text": "And on a personal level, I feel that the emerging markets will benefit much more from this technology, just like the emerging markets benefit much more from the internet or from those $50 Android phones that people can have, because it's such a massive shift in how people's lives work, right?"}, {"time": 2897, "text": "I have always had access to books and a library, which has been fantastic and very important."}, {"time": 2903, "text": "But there are places in the world where people don't have libraries, but now they have the internet and a $50 Android phone and they can watch the same Stanford lecture that I watch."}, {"time": 2912, "text": "I mean, that's kind of mind blowing realistically, right?"}, {"time": 2915, "text": "They just went from zero to one in a very, very dramatic way."}, {"time": 2920, "text": "I think all of these smart contracts, and in my case, I think the one that I seem to keep coming back to is crop insurance, where partly because it doesn't have a tokenization component, partly because it's actually much more important than it might seem."}, {"time": 2935, "text": "What is crop insurance?"}, {"time": 2937, "text": "Right, so this is the nature of why it's sometimes hard to see the full value of what our industry does, because it solves all these kinds of backend problems that we don't have, right?"}, {"time": 2948, "text": "So crop insurance is if I own a farm and it doesn't rain, I get an insurance payout, so I don't need to close down my farm, because if it didn't rain, I don't have crops, right?"}, {"time": 2959, "text": "So people in the developed world can get crop insurance and there's all kinds of systems that basically pay them out, and then they can argue with the insurance company if they don't get paid out properly and whatever."}, {"time": 2971, "text": "And this allows people to smooth out risk."}, {"time": 2975, "text": "In fact, a lot of the global options markets were about this, right?"}, {"time": 2980, "text": "They were initially about people selling their produce or their crops ahead of time, so that if there was a risk of drought, they weren't impacted by it, right?"}, {"time": 2989, "text": "And that's where a lot of options trading and all this kind of stuff came from, even though it's now turned into this kind of global casino."}, {"time": 2997, "text": "But in the emerging market, there are literally people that, if they don't have rain for two seasons, they need to close down their farm and become a migrant worker of some kind."}, {"time": 3007, "text": "And now they have a $50 Android phone where they can read Wikipedia, but they're still decades away from an insurance company coming to their geography and offering them insurance because their local legal system simply doesn't allow that type of thing to exist."}, {"time": 3022, "text": "No insurance company is gonna go and create insurance entity and offer them insurance because the levels of fraud and the ability to resolve that fraud through courts would just not exist."}, {"time": 3031, "text": "So now these people have to wait for decades to have this very basic form of financial protection or something like a bank account even."}, {"time": 3039, "text": "And with this technology, they don't, right?"}, {"time": 3042, "text": "So with this technology, if I have a $50 Android phone and the smart contract has data from satellites or weather stations about the weather conditions in the geography that my farm is in, I can put value into the smart contract and the smart contract will automatically pay me out back, pay me back out at my Android phone."}, {"time": 3064, "text": "I just leapfrogged past my corrupt government not being able to provide a legal infrastructure to create insurance."}, {"time": 3072, "text": "I just leapfrogged past dealing with insurance companies that'll probably price gouge me and often not pay out."}, {"time": 3079, "text": "And I leapfrogged into the world of hyper reliable kind of guaranteed smart contract outcomes that are as good or in many cases better than what farmers in all parts of other parts of the world have."}, {"time": 3092, "text": "And this type of dynamic for the emerging markets of creating a way for people to control and manage risk in their economic life, I think extends way past insurance."}, {"time": 3101, "text": "It extends to them having bank accounts to combat local inflation."}, {"time": 3104, "text": "It extends to them being able to sell their goods on the free market of global trade without middlemen."}, {"time": 3110, "text": "It extends to all these things that we don't really care about, right?"}, {"time": 3113, "text": "Because we're not farmers, but are unbelievably impactful for people that don't have a bank account and their inflation rate in their country is double digits or their farm completely depends on rain or their livelihood completely depends on their ability to sell goods."}, {"time": 3130, "text": "And they can't sell those goods because there's a middleman who essentially controls all the trust relationships."}, {"time": 3136, "text": "But now we have the internet and smart contracts and that might not have to be the case in the next five or 10 years."}, {"time": 3142, "text": "Yeah, so that definitely has a quality of life impact on the particular farmer's life, but I suspect it has a huge like down the line ripple effect on the whole supply chain."}, {"time": 3203, "text": "So like, it's almost hard to imagine the possible ways it might transform the world."}, {"time": 3210, "text": "I wonder how much friction there is in the system, I guess, currently that smart contracts might remove."}, {"time": 3217, "text": "That's almost unknown."}, {"time": 3220, "text": "You can sort of hypothesize and stuff, but I wonder."}, {"time": 3224, "text": "I've seen enough bureaucracy in my life to know that smart contracts in many cases would remove bureaucracy."}, {"time": 3232, "text": "And I wonder how the world will be once you remove much of the bureaucracy."}, {"time": 3238, "text": "Coming from the Soviet Union, where I just have seen the life sucked out of the innovative spirit of human nature by bureaucracy."}, {"time": 3251, "text": "I wonder, the kind of amazing world that could be created once bureaucracy is removed."}, {"time": 3257, "text": "Yeah, I think it's fascinating how the world can evolve."}, {"time": 3262, "text": "I think this extends a lot further than people think into many, many different parts of the global economy."}, {"time": 3268, "text": "It might start with NFTs for art, or it might start with DeFi, right?"}, {"time": 3273, "text": "Or it might start with fraud proof ad networks next."}, {"time": 3276, "text": "We don't know what it's gonna go to next, but I think the implication of people being in a system of contracts that holds them accountable and guarantees contractual outcomes, regardless of a local legal system, is something that I think extends to the supply chain."}, {"time": 3293, "text": "You can prove that goods were sourced in an ethical way, and you can prove that in a way that can't be gamed."}, {"time": 3300, "text": "That'll change buying power and supplier power and how people produce goods that we all consume."}, {"time": 3306, "text": "And then on the political level, I personally think that in a number of decades, we could literally be in a place where politicians can commit to a certain set of smart contract kind of budget, definitional kind of results."}, {"time": 3322, "text": "For example, we discovered oil."}, {"time": 3324, "text": "I promise as a politician, I'm gonna take the oil and I'm gonna redistribute it to all of you."}, {"time": 3329, "text": "Well, that's wonderful."}, {"time": 3330, "text": "That's a great idea."}, {"time": 3331, "text": "Sounds very nice when you're running for office."}, {"time": 3334, "text": "Why don't we codify that in a smart contract?"}, {"time": 3336, "text": "And why don't we put those conditions very solidly on a blockchain?"}, {"time": 3340, "text": "And then once you've been elected, we'll just turn that one on and it'll distribute the money just like you said, and everything will be fine."}, {"time": 3350, "text": "I personally think that this new level of systems that allows trustworthy collaboration between everybody, between supply chain partners, ad network users, the financial system, insurance companies, and farmers, all of these are just interactions that require a trusted entity, or in this case, a trusted piece of code to orchestrate the interaction in the way that everyone agrees."}, {"time": 3377, "text": "Yeah, one of the things that makes the United States fascinating is the founding documents."}, {"time": 3383, "text": "And it's fascinating to think of us moving into the new in the 21st century to a digital version of that."}, {"time": 3390, "text": "So the constitution, a smart constitution, no offense to the paper constitution, and that would have transformative effects on politicians and governments, holding people accountable."}, {"time": 3405, "text": "Oh man, that's so exciting to think that we might enforce accountability through the smart contract process."}, {"time": 3420, "text": "Exactly, why can't that happen?"}, {"time": 3422, "text": "Anything that we could codify into a smart contract, and anything that we all agree is the way the world should work."}, {"time": 3429, "text": "And then anything that we can get proof about, right?"}, {"time": 3432, "text": "Anything that a system somewhere could tell us happened, those are the pieces of the puzzle, right?"}, {"time": 3439, "text": "We need a trusted piece of code, we need to have agreement that that's how the world should work, and we need a system that'll tell that trusted piece of code what happened."}, {"time": 3448, "text": "As long as we have those three things, we can theoretically codify any set of agreements about anything where those three properties take hold."}, {"time": 3459, "text": "I wonder if you could apply that to like military conflict and so on."}, {"time": 3463, "text": "Recently, Biden announced that we're going to pull off from Afghanistan after 20 years in the war."}, {"time": 3472, "text": "I wonder, there's a lot of debacles around war in Afghanistan and invasion of Iraq, all those kinds of things."}, {"time": 3480, "text": "I wonder if that was instead formulated as a smart contract."}, {"time": 3486, "text": "Like that might have actually huge impact on the way we do conflict."}, {"time": 3492, "text": "So you think of the smart contract as a kind of win win situation where you're doing like financial transactions or something like that."}, {"time": 3501, "text": "But you could see that also about military conflict or like whenever two nations are at tension with each other, different scales of conflict, that you can have conflict codified."}, {"time": 3516, "text": "And that would potentially resolve conflict much faster because there's honesty, transparency and control within that conflict, because there's conflict in this world."}, {"time": 3526, "text": "And I, again, very, very inspiring to think about the kind of effects it might have on the negative kinds of contracts, on the tense, painful kinds of contracts."}, {"time": 3539, "text": "I haven't thought about that as much."}, {"time": 3541, "text": "It's actually kind of scary, the stuff you're thinking through now with like the war contracts or something."}, {"time": 3546, "text": "That's not in the white paper."}, {"time": 3547, "text": "We don't have anything about war contracts or anything."}, {"time": 3549, "text": "Again, this is the Russian, we're both Russian, but I'm a little more Russian in the suffering side."}, {"time": 3555, "text": "Maybe I read way too much Dostoevsky and military kind of ideas."}, {"time": 3559, "text": "But anyway, holding politicians accountable in all forms, I think is really powerful."}, {"time": 3566, "text": "Is there something you could say as a small aside on how smart contracts actually work if we look at the code?"}, {"time": 3573, "text": "Is there some nice way to say technically what is a smart contract?"}, {"time": 3579, "text": "What does it mean to codify these agreements, the actual process for people who might not at all be familiar?"}, {"time": 3586, "text": "I think you just write it into code that operates in this kind of decentralized infrastructure."}, {"time": 3592, "text": "You usually write code that runs in a central server somewhere."}, {"time": 3596, "text": "Now you write code that runs across a lot of different machines in this decentralized way."}, {"time": 3601, "text": "And then after you write it, you need services."}, {"time": 3604, "text": "And that's where oracles come in, they provide all the services."}, {"time": 3607, "text": "So just like you would be writing code in web 2.0 land, running it on a server somewhere and using an API, here you'd be writing code, putting it on a decentralized infrastructure like a blockchain or a smart contract platform like Ethereum."}, {"time": 3620, "text": "And then you would be using various services in the form of oracles."}, {"time": 3623, "text": "So they'll just be called oracles or decentralized services instead of APIs."}, {"time": 3627, "text": "And you're basically composing the same type of architecture except it's hyper reliable."}, {"time": 3633, "text": "At the moment, it's a little bit less efficient because there's an early stage to our industry."}, {"time": 3639, "text": "But it provides this extreme level of reliability and transparency, which for certain use cases is an absolute critical component and is completely reinventing how they work."}, {"time": 3650, "text": "So I think people should look at what are the use cases where that trust dynamic can be so heavily improved."}, {"time": 3656, "text": "And that's probably the ones where this is maybe initially useful."}, {"time": 3659, "text": "But I mean, just to emphasize, I don't think people realize when you say code that we're talking about non obfuscated actual program."}, {"time": 3669, "text": "Like you can read it, you can understand it."}, {"time": 3671, "text": "And there's something about, maybe this is my computer science perspective of like software engineering perspective, but there's something about the formalism of programming languages, which enforces simplicity and clarity and transparency."}, {"time": 3688, "text": "And because it's seen to everybody, I mean, simplicity is enforced."}, {"time": 3694, "text": "There's something about natural language, like language as written in the constitution, for example, where there's so many interpretations."}, {"time": 3704, "text": "With the nice thing about programs, there's not going to be a huge number of books written about what was meant by this particular line because it's pretty clear."}, {"time": 3716, "text": "Like programming languages have a clarity to them that natural language does not, and they don't have ambiguity, which I think it's important to pause on because it's really powerful."}, {"time": 3728, "text": "It's really difficult to think about."}, {"time": 3729, "text": "I think we live in a world where all the philosophers and legal minds don't know how to program."}, {"time": 3735, "text": "So I think, not all, most don't."}, {"time": 3738, "text": "And so we don't often see the philosophical impact of this kind of idea that the agreements between humans can be written in a programming language."}, {"time": 3750, "text": "That's a really transformative idea."}, {"time": 3752, "text": "That, I mean, yeah, it's an idea that's not just technical."}, {"time": 3758, "text": "It's not just financial."}, {"time": 3759, "text": "It's philosophical."}, {"time": 3761, "text": "It's rethinking human nature from a digital perspective."}, {"time": 3766, "text": "Like what is human civilization?"}, {"time": 3768, "text": "It's interaction between humans."}, {"time": 3771, "text": "And rethinking that interaction as a digital interaction that is managed by programming languages, by programs, by code."}, {"time": 3783, "text": "That we'll look back at this time potentially as one where us little descendants of apes did not realize how important this moment in history is."}, {"time": 3796, "text": "Like human beings might be totally different a century from now because we codified the interaction between humans."}, {"time": 3805, "text": "That might have more of an impact than anything else we do today."}, {"time": 3810, "text": "You think about the impact of the internet, one of the cool things is digitization of data."}, {"time": 3815, "text": "But we have not yet integrated the tools, the mechanisms fully that use that data and interact with humans yet."}, {"time": 3823, "text": "And that's what smart contracts do."}, {"time": 3825, "text": "I wonder if you think about the role of artificial intelligence in all of this."}, {"time": 3830, "text": "Because your smart contracts are kind of agreements, maybe you disagree with this, but at least the way I'm thinking about it is agreements between humans or groups of humans."}, {"time": 3843, "text": "But it seems like because everything's operating in the digital space that you can integrate non humans into this."}, {"time": 3852, "text": "Or AI systems that help out humans, managed by humans."}, {"time": 3857, "text": "Like what do you think about a world of hybrid smart contracts, codifying agreements between hybrid intelligent being networks of humans and AI systems?"}, {"time": 3875, "text": "Yeah, I think that makes perfect sense."}, {"time": 3879, "text": "In terms of AI, I'm not an expert, right?"}, {"time": 3882, "text": "So it might be a bit simplistic or naive, my ideas in this field."}, {"time": 3888, "text": "I think everyone saw the Terminator movie, right?"}, {"time": 3891, "text": "Everybody kind of saw the Terminator movie in the 90s."}, {"time": 3895, "text": "And it was like, this is really scary."}, {"time": 3897, "text": "I personally think AI is amazing and makes perfect sense."}, {"time": 3902, "text": "I think it will evolve to a place where people have... Just to understand, I work in the world of trust issues, right?"}, {"time": 3909, "text": "I work in the world of how can technology solve trust and collaboration issues using encryption, using cryptographically guaranteed systems, using decentralized infrastructure, right?"}, {"time": 3920, "text": "So that's the world that I've been inhabiting for many, many years now, building smart contracts for seven or eight, doing stuff before that."}, {"time": 3927, "text": "It's kind of what I'm focused on."}, {"time": 3929, "text": "So I view AI through that same lens."}, {"time": 3932, "text": "And my brain naturally asks, well, what is the trust issue that people might have with AI?"}, {"time": 3937, "text": "And my natural kind of response is, well, let's say AI continues to be built and improve."}, {"time": 3944, "text": "At some point, I have no clue where we are on this now."}, {"time": 3948, "text": "I've seen different ideas that were very far from this."}, {"time": 3951, "text": "I've seen other ideas were very close to this."}, {"time": 3952, "text": "At a certain point, we'd arrive at a place with AI where we would be a little bit worried about just how much it could do, right?"}, {"time": 3959, "text": "We might be worried that AI could do things we don't want it to do, but we still want to give AI a level of control over our lives, right?"}, {"time": 3968, "text": "So in my world, that's a trust issue."}, {"time": 3971, "text": "And the way that that trust issue would be solved with blockchains is actually very straightforward."}, {"time": 3976, "text": "And I think in its simplicity, quite powerful."}, {"time": 3979, "text": "You could have an AI that has an ability to do and control key parts of your and our lives, right?"}, {"time": 3988, "text": "But then you could limit it with private keys and blockchains and create certain guardrails and firm kind of walls and limits to what the AI could never go past, assuming that encryption, right?"}, {"time": 4006, "text": "That encryption continues to work, right?"}, {"time": 4009, "text": "And assuming that if it's not that AI's specialization to break encryption, that it wouldn't be able to do that, right?"}, {"time": 4016, "text": "So if you have an AI that controls something very important, whatever it is, shipping or something in defense or something in the financial system, whatever it is, but you're sitting there and you're kind of worried, hey, this thing is unbelievable."}, {"time": 4031, "text": "It's coming up with things we wouldn't have thought of in a hundred years, but maybe it's a little too unbelievable."}, {"time": 4037, "text": "How do you limit it?"}, {"time": 4039, "text": "Well, if you bake in private keys and you bake in these kind of blockchain based limitations, you can create the conditions beyond which an AI could never act."}, {"time": 4051, "text": "And those could once again be codified in the very specific unambiguous terms in which you described, which once again, in my trust issue focused world, would solve the trust issue for users and make them comfortable with using the AI or ceding control to the AI, which I think in more advanced versions of AI will continue to be a concern, right?"}, {"time": 4077, "text": "So smart contracts actually provide a mechanism for human supervision of AI systems."}, {"time": 4081, "text": "With encryption, very encryption heavy."}, {"time": 4084, "text": "So it's not about like, is it smarter than us?"}, {"time": 4087, "text": "It's about will the encryption hold up?"}, {"time": 4090, "text": "So that's based on the assumption that encryption holds up."}, {"time": 4095, "text": "I think that's a safe assumption."}, {"time": 4096, "text": "We can get into that whole discussion, but from quantum computing, but cracking encryption is very difficult."}, {"time": 4102, "text": "That's a whole nother discussion."}, {"time": 4103, "text": "I think we're safe on the safe ground for quite a long time, assuming encryption holds."}, {"time": 4109, "text": "I, there's a space that is at the cutting edge of general intelligence research in the AI community, which is the space of program synthesis or AI generating programs."}, {"time": 4127, "text": "So that's different than what you're referring to is AI being able to generate smart contracts."}, {"time": 4134, "text": "And that to me is kind of fascinating to think of, especially two AI systems between each other, generating contracts, sort of almost creating a world where most of the contracts are between nonhuman beings."}, {"time": 4155, "text": "I think an AI system, as I think about it, and once again, this is not my field."}, {"time": 4159, "text": "This is something I might watch a YouTube video on or just see something interesting about at some point."}, {"time": 4165, "text": "I think if I were to just reason through it even now, I think the highly deterministic and guaranteed nature of smart contracts would probably be preferable to an AI because I'm guessing an AI would have a lot of problems with dealing with the human element of how contracts work today, right?"}, {"time": 4185, "text": "So an AI, for example, couldn't pick up the phone and call Dave at a bank to do a derivative and kind of discuss with Dave and have a call with him and kind of have a conversation and get him comfortable and tell him it's gonna be fine and kind of smooth out all the weird social cues that have to do with making certain derivatives."}, {"time": 4206, "text": "I'm assuming that that's a pretty complicated neural map AI kind of problem."}, {"time": 4215, "text": "Yeah, so if I think about it, the deterministic guaranteed nature of smart contracts probably would, and if, assuming they're accessible to AIs, could actually, interestingly enough, be the format that they prefer to codify their relationship with non AI systems and very possibly other AI systems, right, because it is very, I mean, it's pretty guaranteed, right?"}, {"time": 4244, "text": "All the other types of contracts that an AI could go out there and seek to do would require some language processing around the law."}, {"time": 4256, "text": "And I think, I don't know if this is a term, but probably not a smart AI or a good AI or whatever the term is for a high quality AI, would probably realize some of the limitations and the risks."}, {"time": 4269, "text": "Yeah, yeah, AI definitely dislikes ambiguity and would prefer the determinism, the deterministic nature of smart contracts."}, {"time": 4277, "text": "I do wonder about this particular problem and maybe you could speak to it of how smart contracts can take over certain industries in a sense or how certain industries can convert their sets of agreements into smart contracts, which is, you mentioned sort of talking to Dave from the bank, many of our laws, many of our agreements are currently through natural language, through words."}, {"time": 4306, "text": "And so there is a process of mapping that has to occur in order to convert the legal agreements, legal contracts of today to smart contracts that by the way, AI may be able to help with."}, {"time": 4321, "text": "But by way of question, how do you think we convert the legal contracts on which many industries currently function today or not even legal contracts, but ambiguous kind of agreements, maybe they're loose sometimes into more formal deterministic agreements that are represented by smart contracts?"}, {"time": 4345, "text": "So I think there's two, maybe two sides to this."}, {"time": 4350, "text": "I think the first one is actually not a huge problem where you have things like the is the master agreement for derivatives or you have these agreements that basically already reference a system somewhere, like for example, many legal agreements already accept eSignature."}, {"time": 4365, "text": "And so they're saying, hey, I'm gonna use this computing system over here around signatures and I'm gonna consider, and there's laws around that and there's clauses that say eSignature is good enough for this agreement."}, {"time": 4375, "text": "I actually don't think this is a big problem for the vast majority of legal agreements that use systems already."}, {"time": 4382, "text": "So what you'll do is you'll swap out one repository or one set of system of contract settlement."}, {"time": 4389, "text": "And you'll just say, hey, this blockchain system over here is my new system of contract settlement."}, {"time": 4393, "text": "Whatever it says is the state of the agreement instead of the centralized system over there."}, {"time": 4400, "text": "And so there's actually a huge amount of agreements that are already able to do that and I think we'll do that."}, {"time": 4406, "text": "I think there's another side to your question, which is the amount of agreements that are very ambiguous that can be turned into smart contracts."}, {"time": 4416, "text": "And I think the limitation there is twofold."}, {"time": 4419, "text": "First of all, like you said earlier, the highly reliable smart contract and the lack of opaqueness and the clarity of smart contracts is very high and very powerful and very clear and it's, in my opinion, gonna be much, much easier to take a smart contract and turn it into a set of natural language explanations and just say, hey, this is what this does, right?"}, {"time": 4467, "text": "Mapping smart contracts into natural language, I didn't even think about that."}, {"time": 4470, "text": "So that's, you're saying that's doable and natural and easy to do."}, {"time": 4475, "text": "Because there's so much clear, right?"}, {"time": 4477, "text": "There's that forced clarity that you talked about."}, {"time": 4480, "text": "I think the second aspect of this problem is the nuance around what contracts can be made unambiguous and I think that comes down to, often comes down to proving what happened, which is where Oracle networks and decentralized Oracle networks and Chainlink would come in and our experience there is quite extensive over the many years that we've worked on many different contract types."}, {"time": 4502, "text": "I think what it fundamentally comes down to is whether there is data."}, {"time": 4507, "text": "So we're not gonna be able to make a hybrid smart contract about whether somebody painted your house the right color blue."}, {"time": 4515, "text": "We're just not gonna be doing that because there's no data feed that tells us that your house was painted blue or that it was the right color of blue."}, {"time": 4522, "text": "You know, unless somebody sets up a drone with a color analysis tool and they generate that data."}, {"time": 4528, "text": "Which by the way, it could be possible, right?"}, {"time": 4529, "text": "They could, there could be, if there's enough demand then the service would be created that has drones flying around that's telling you about the colors of, you know, all this kind of stuff."}, {"time": 4538, "text": "So if there's actual demand that that would be created and because there'll be value to connect that data feed to the smart contracts and so on."}, {"time": 4546, "text": "I think you have it unbelievably right because there are already insurance companies that use drones to monitor construction sites from overhead and see how many people are wearing hard hats."}, {"time": 4557, "text": "And if the percentage of people wearing hard hats isn't sufficiently high, then, you know, the policy is voided."}, {"time": 4562, "text": "And so in that case, there is a data source and that data source can be put into a hybrid smart contract."}, {"time": 4568, "text": "So the limitation of hybrid smart contracts is, is there a data source or a set of data sources to create definitive truth, to settle the contract and eliminate ambiguity."}, {"time": 4578, "text": "And then as you said, I think as people realize that smart contracts are a format in which they can form agreement about things like that insurance product around, you know, how many people are wearing hard hats."}, {"time": 4591, "text": "If I'm the construction site owner, well, you know, I would really like a guarantee that your insurance policy is gonna pay me out if everyone is wearing hard hats."}, {"time": 4600, "text": "And in that case, there is demand for the data and people will generate the data."}, {"time": 4606, "text": "And I actually think the insurance industry is interestingly a precursor of this because they're so data driven."}, {"time": 4611, "text": "You already see insurance companies paying IoT companies to put data into their customer's infrastructure at the cost of the insurance company to generate the data that the insurance company uses to make a policy for the customer."}, {"time": 4625, "text": "So you basically already have people who really want to price data into their agreements when they're of sufficiently high value paying for their own customers to get data sensors into their infrastructure."}, {"time": 4640, "text": "And I think as smart contracts become more of a requested format or data driven contracts become more of a format, there will be a growing demand about proving what happened through data."}, {"time": 4653, "text": "So it'll be motivating totally new data feeds being created."}, {"time": 4656, "text": "By the way, the insurance industry broadly, the revolutions there, it would be huge."}, {"time": 4662, "text": "I've worked quite a bit with autonomous vehicles, semi autonomous and just vehicles in general."}, {"time": 4667, "text": "The insurance industry there, by the way, makes a huge amount of money, but is using very crappy data feeds, revolutionizing how like not by crappy, I mean very crude."}, {"time": 4681, "text": "Like literally the insurance is based on things like age, gender, like basic demographic information as opposed to really high resolution information about you as an individual, which you may or may not want to provide."}, {"time": 4698, "text": "So you can choose from an individual perspective to provide a data feed."}, {"time": 4701, "text": "And there like the power of insurance to enable the individual, to empower the individual could be huge because ultimately smart contracts motivate the use of data, the creation of new data feeds, but leveraging the whatever service it provides in truth, as opposed to some kind of very loose notion of who you are."}, {"time": 4732, "text": "So that I'm not, again, not sure how that would change things, but in terms of the fundamental experience of life, because I think we all rely on insurance, not just in business, but in life and grounding that insurance in more and more accurate representation of reality might just have transformative effects on society."}, {"time": 4755, "text": "Well, just to mention one quick thing that you said, where I noticed another trust issue, you said the user might not want to share their data."}, {"time": 4763, "text": "So what you could actually do, and what we've already worked on is, you can have a smart contract that holds the data and evaluates the data of the user without sharing it with the insurance companies."}, {"time": 4775, "text": "And the insurance company knows that the smart contract will evaluate it according to the policy."}, {"time": 4780, "text": "They don't need the data."}, {"time": 4781, "text": "And the user can provide the data knowing it'll never touch the insurance company because it's only provided to the smart contract."}, {"time": 4789, "text": "And suddenly you've solved another trust issue because the autonomous piece of code can evaluate information separately from the interests of both of the counterparties."}, {"time": 4800, "text": "And so this is the recurring theme."}, {"time": 4822, "text": "And once you have an autonomous piece of code that can also know what's going on, thanks to Oracle networks and that combination of the code and the Oracle network for the hybrid smart contract, the same pattern just recurs."}, {"time": 4836, "text": "It's really the same pattern."}, {"time": 4838, "text": "And this is why I keep saying trust issues."}, {"time": 4840, "text": "It's because I basically, almost every contractual trust issue that I see where there is a piece of data to prove and settle the trust issue in a way that works for both parties, there is no reason not to use an autonomous, highly reliable contract and piece of code."}, {"time": 4859, "text": "And I have to tell you, I've seen this in a lot of different industries."}, {"time": 4864, "text": "I've seen it insurance, ad networks, global finance, global trade, those are all multi trillion dollar industries."}, {"time": 4871, "text": "And then there are other smaller industries."}, {"time": 4874, "text": "Like even one of the first smart contracts we worked on many years ago was for search engine optimization firms where they would tell you, hey, I'm gonna raise your search engine ranking, give me the money."}, {"time": 4885, "text": "And people wouldn't wanna give them the money because they never knew if they were gonna do it."}, {"time": 4889, "text": "And then the search engine firm doesn't wanna do any work thinking they'll never get any money."}, {"time": 4893, "text": "So we just initially even came up with a system where you could put Bitcoin into a smart contract and it would be released based on whether the search rank of a website got to a certain level on Google for a certain keyword, right?"}, {"time": 4907, "text": "And so the trust problem was solved."}, {"time": 4909, "text": "But it's just the same story, right?"}, {"time": 4910, "text": "It's kind of like trust issues around AI, trust issues around financial products, trust issues around insurance, trust issues around social media, whatever it is."}, {"time": 4918, "text": "I think that's what people looking at this industry really need to understand."}, {"time": 4926, "text": "And once they do understand, they realize what this is all about."}, {"time": 4929, "text": "This is about redefining how everyone collaborates with everyone about everything where we can prove something through data."}, {"time": 4940, "text": "You've mentioned confidentiality and privacy that the parties don't need to necessarily know private data in this interaction."}, {"time": 4948, "text": "You talk about confidentiality in the white paper for Chainlink 2.0."}, {"time": 4953, "text": "Can you talk more about how to achieve confidentiality in this process?"}, {"time": 4959, "text": "Sure, sure, absolutely."}, {"time": 4963, "text": "So I think you once again need to think of the contract as existing in two parts, right?"}, {"time": 4967, "text": "You have the on chain code and then you have this off chain system called the centralized Oracle network."}, {"time": 4972, "text": "So the question is really what portion of the contract should live in what part of these two systems, right?"}, {"time": 4980, "text": "So if you wanna create transparency, you should put more information on chain because that's what blockchains are very good at."}, {"time": 4989, "text": "They're public, transparent, but they don't necessarily have privacy."}, {"time": 4995, "text": "Well, you can see how those two things are a little bit kind of completely diametrically opposed."}, {"time": 5001, "text": "So I do think and I do see blockchains working on on chain encrypted smart contracts."}, {"time": 5008, "text": "That's very inefficient."}, {"time": 5009, "text": "It has a lot of nuances around it."}, {"time": 5012, "text": "That I think will appear at some point."}, {"time": 5015, "text": "I think until it appears, you have an option of taking a part of the computation and putting it into the centralized Oracle network."}, {"time": 5024, "text": "We actually did an entire paper about this that we presented at Stanford in February of last year, something called Mixicles, which basically talks about how you can take an Oracle network and you can put a portion of the computation into the Oracle network, assuming that you're comfortable with that limited set of nodes knowing what the computation is."}, {"time": 5047, "text": "And you could actually provide additional confidentiality through special hardware called trusted execution environments that all those nodes are forced to run."}, {"time": 5055, "text": "So they won't even know what they're operating."}, {"time": 5057, "text": "And so at the end of the day, if you look at a hybrid smart contract as gaining functionality from its on chain code and gaining other functionality from its off chain decentralized Oracle network component, you can place the part of the computation that you would like to be private in the decentralized Oracle network, because you can control the set of nodes."}, {"time": 5080, "text": "You can control the committee of nodes and you can require that they run certain hardware to keep the information private, right?"}, {"time": 5088, "text": "So you could basically make a derivative that, or a binary option is the example used in the Mixicles paper where the payout happened on chain, but it was actually impossible to tell what the outcome of the contract was."}, {"time": 5102, "text": "So the outcome of the contract was computed in the centralized Oracle network."}, {"time": 5137, "text": "Determined a certain outcome that the relevant user would get paid and there was still a place to put value, right?"}, {"time": 5145, "text": "So there is this kind of fundamental tension between confidentiality, privacy, which is very important for many contracts, which is critical to many contracts and the public and transparent nature of blockchains, which I think eventually will be solved through encrypted on chain smart contracts."}, {"time": 5164, "text": "That'll take some time, I think that'll take years in my opinion."}, {"time": 5168, "text": "And before we arrive there, I think people will put the private portion into the centralized Oracle network."}, {"time": 5175, "text": "Once again, going back to what the decentralized Oracle networks do, they seek to provide these services, right?"}, {"time": 5181, "text": "So the ability to do a privacy preserving computation is perhaps a service without which a certain type of contract might never come into existence in the form of an on chain hybrid smart contract."}, {"time": 5194, "text": "And so this is once again, what we see the centralized Oracle networks and decentralized services doing is providing people these tools and building blocks to compose, like I'm great at making these derivatives contracts, but I can't make them unless I can retain the privacy of them."}, {"time": 5212, "text": "And our goal is to provide the infrastructure that gives you as a developer and as a creator of smart contracts, that capability."}, {"time": 5220, "text": "And what we've seen is that as we provide that capability, people create more, which is also really the story of the internet, right?"}, {"time": 5227, "text": "The story of the internet is it was really tough to do eCommerce while everything was an HTTP and credit cards were transmitted publicly."}, {"time": 5235, "text": "And so eCommerce was kind of tough because how am I gonna send my credit card over public on encrypted channels, right?"}, {"time": 5241, "text": "But the second HTTPS appears, eCommerce becomes a lot easier because I can put in my credit card number and it can be sent over an encrypted channel and it's not at risk."}, {"time": 5250, "text": "And so I can participate in eCommerce as long as I have a credit card."}, {"time": 5253, "text": "I think those types, and I'm sure that was unexpected, right, I'm sure at the time that was an unexpected outcome from that technology."}, {"time": 5262, "text": "And so I think this is why we sometimes have this focus on privacy because in our work with contracts and their transition into this hybrid smart contract form, we see a substantial amount of need for privacy as an inherent property of these contracts."}, {"time": 5279, "text": "And it'll take a while before that's possible to create the kind of technology innovation required to do that on chain."}, {"time": 5285, "text": "I know there's a few ideas that are being floating about, but so the currently distributed Oracle networks provide that feature, which is essential to many contracts."}, {"time": 5294, "text": "What brings to mind in this whole space, again, it might be outside of your expertise, but within the world which I'm passionate about, which is machine learning, and it seems like very naturally because current machine learning systems are very data hungry and much of the value mined by companies in the digital space are from data."}, {"time": 5320, "text": "They often want their data to maintain privacy."}, {"time": 5324, "text": "So you think about an autonomous vehicle space, Tesla is collecting a huge amount of data, Waymo is collecting a huge amount of data."}, {"time": 5333, "text": "It seems like it would be very beneficial to form contracts where one could use the data from the other in some kind of privacy preserving way, but also where all the uses of data are codified and you can exchange value cleanly, basically contracts over data, over machine learning systems use of different data."}, {"time": 5355, "text": "I don't know, do you talk to machine learning folks that use ideas of smart contracts or is that for outside of your interest?"}, {"time": 5363, "text": "Because it seems like exceptionally applicable set of, when we talk about different services that might be created and revolutionized by smart, especially hybrid smart contracts, I think machine learning systems comes to mind to me in all industries."}, {"time": 5382, "text": "I don't know if you've gotten a chance to interact with those folks, with those services."}, {"time": 5386, "text": "I think what you're talking about is more data marketplaces in the data marketplace side of things."}, {"time": 5392, "text": "Well, this is actually once again, very applicable because there's a trust issue."}, {"time": 5396, "text": "At the end of the day, let's say I'm trying to sell you some data."}, {"time": 5400, "text": "You don't know the quality of the data."}, {"time": 5403, "text": "So you don't know what you wanna pay for it."}, {"time": 5404, "text": "And I can't give you the data for you to determine the quality because I've given you the data, right?"}, {"time": 5410, "text": "We need an autonomous impartial agent."}, {"time": 5413, "text": "We need an impartial computational kind of agent and on chain smart contract with an Oracle network to assess my data to write, to basically take random cross section samples of the data, assess it for quality, assess it for signal from the algorithm you have, which you don't wanna share with me because you don't wanna know the algorithm you're working on, right?"}, {"time": 5437, "text": "You don't want me to know what you want the data for."}, {"time": 5440, "text": "So now the autonomous agent takes your algorithm, keeping it private from me and takes my data, keeping it private from you, assesses it on a random cross section sampling for quality of data, returns the scoring back to you, allows you to determine a price."}, {"time": 5457, "text": "And now both you and me know that we've arrived at a fair price for the quality of my data for what you wanna do with it."}, {"time": 5466, "text": "And that's once again, from what I've seen in the data marketplaces, which are full of people who want that data for these learning models, often for financial markets, often for other reasons, this is their fundamental problem, which amazingly enough, there's a trust issue that is getting solved."}, {"time": 5488, "text": "And I think you can see even on the face of it, once that trust issue is solved, those markets can work a lot better, right?"}, {"time": 5496, "text": "I don't need to know your algorithm."}, {"time": 5498, "text": "You don't need to know my data."}, {"time": 5499, "text": "We both know that the autonomous agent is not under either of our control and gave us a fair assessment and a fair price."}, {"time": 5507, "text": "And we're all very comfortable with that."}, {"time": 5510, "text": "I could even make conditions that your algorithm isn't analyzing the data for something I don't want you to analyze it for, or you could make conditions that the data has to have any number of properties."}, {"time": 5522, "text": "And once again, you haven't leaked any signal to me and I haven't leaked any data to you, which is once again, just another type of trust issue that all of this solve."}, {"time": 5532, "text": "So it's the same pattern."}, {"time": 5534, "text": "If you work in this industry long enough, or if you really look at these use cases long enough, you'll simply come to the question, and this is the useful question, what is the trust issue this is solving?"}, {"time": 5544, "text": "And then if you can get an answer to that question on a case by case basis, that's when you'll understand why blockchains are relevant."}, {"time": 5552, "text": "And then once you do that with enough use cases, it becomes a little bit mind blank."}, {"time": 5558, "text": "You've mentioned trust quite a bit."}, {"time": 5560, "text": "You also mentioned trust minimization in the Chainlink White Paper."}, {"time": 5568, "text": "Can we dig into trust a little bit more?"}, {"time": 5571, "text": "What is the nature of trust that you think about in these smart contracts?"}, {"time": 5576, "text": "What is trust minimization?"}, {"time": 5578, "text": "How do we accomplish, achieve trust minimization?"}, {"time": 5583, "text": "I think it's important maybe to have a conception of what the alternative is, right?"}, {"time": 5587, "text": "What is highly reliable trust minimized off chain and on chain computation and alternative to?"}, {"time": 5594, "text": "So this is just kind of how I see the world in these two camps."}, {"time": 5598, "text": "One camp is the traditional, what I call brand based or paper guarantee camp."}, {"time": 5605, "text": "And this is the world as pretty much most or all people know today."}, {"time": 5609, "text": "This is the world where there's a bank logo or an insurance company logo, or some kind of logo."}, {"time": 5614, "text": "There's a very big building with marble arches and columns, it's the biggest building in the town."}, {"time": 5619, "text": "It's bigger than the church."}, {"time": 5620, "text": "And everybody feels very good."}, {"time": 5622, "text": "Everybody's got such a nice logo."}, {"time": 5623, "text": "It's such a big building."}, {"time": 5625, "text": "Why don't I give them my money?"}, {"time": 5627, "text": "Why don't I interact with them on the basis of any kind of agreement?"}, {"time": 5632, "text": "And that is definitely better than that not being there."}, {"time": 5636, "text": "And that is definitely a huge improvement for how people conduct commerce."}, {"time": 5640, "text": "Letters of credit from branded entities are very important for global trade to take place in the early stages of global trade."}, {"time": 5649, "text": "So that's good, but it is fundamentally just a paper agreement with a legal framework behind it."}, {"time": 5656, "text": "And if the paper agreement you have would say Robinhood or somebody else suddenly has to change, well, it changes and you can't really do anything about it."}, {"time": 5666, "text": "You won't be able to change anything about what happened there."}, {"time": 5669, "text": "There's some long terms of service."}, {"time": 5671, "text": "There's some other agreements around all this stuff."}, {"time": 5674, "text": "At the end of the day, that's the brand based and paper guarantee world where it's all very vague and opaque and you're kind of hoping for the best because there's a nice logo."}, {"time": 5685, "text": "It's been around a hundred years."}, {"time": 5687, "text": "There's a lot of marble."}, {"time": 5688, "text": "Put a lot of marble."}, {"time": 5689, "text": "Big building, lots of marbles."}, {"time": 5690, "text": "This is why banks have such nice buildings, right?"}, {"time": 5693, "text": "It's not because they want to spend money on buildings."}, {"time": 5696, "text": "It's to create confidence in them as an entity in order for people to transact through them, right?"}, {"time": 5703, "text": "This is why all these kind of go to cities that had gold rushes, go to cities that needed banking as a service in certain time periods, they're the most beautiful buildings at least in the United States."}, {"time": 5715, "text": "So this is the brand based paper guarantee model for which up until now, there has never been an alternative, right?"}, {"time": 5722, "text": "So up until now, if you had a bad experience with a bank or insurance company or some logo somewhere, you would only have one option."}, {"time": 5730, "text": "Your option would be to go across the road and down the block to another building with another color of marble and another set of agreements that are fundamentally still paper brand agreements, right?"}, {"time": 5743, "text": "Now for the first time, you have mathematical agreements."}, {"time": 5747, "text": "You have mathematically guaranteed encryption secured, decentralized infrastructure powered agreements, right?"}, {"time": 5756, "text": "This is really the shift."}, {"time": 5759, "text": "This is really the comparison and the alternative through which people should view all of this in my opinion, because there's once again, this conception that everything is fine, everything works very well."}, {"time": 5771, "text": "Well, it does, it works fine and very well as long as nothing goes wrong."}, {"time": 5775, "text": "And then in the cases when things go wrong, which they pretty much invariably at some point do, then you find out that, well, you know, turns out they don't have to pay me or turns out I can't trade or turns out the ATMs can be locked up and only give me 66 euros per day, whether I'm a business or an individual, like what happened in Greece a few years ago, right?"}, {"time": 5795, "text": "And the reality is that once that becomes a strong enough kind of realization for people, I think they will all just migrate to mathematically guaranteed contracts because why wouldn't you?"}, {"time": 5809, "text": "So in the world of mathematically guaranteed contracts, kind of how do we, and cryptographically secured and decentralized infrastructure powered, how do we evolve into that world?"}, {"time": 5821, "text": "Well, at the end of the day, it comes down to consensus, right, it comes down to a collection of independent nodes, a collection of provably independent computing systems arriving at the same conclusion impartially."}, {"time": 5837, "text": "That conclusion might be the transaction is valid between address A and address B, address A has one Bitcoin, wants to send it to address B, now address B has one Bitcoin, right?"}, {"time": 5849, "text": "So that's one degree of validation."}, {"time": 5852, "text": "It has certain cryptographic primitives that are used, certain levels of cryptography, encryption, and other methods that basically provide clarity and those guarantees."}, {"time": 5862, "text": "But fundamentally, it's this level of consensus that multiple independent computing systems came to the same conclusion, verified that conclusion and created a sense of finality, created a final state that is globally considered to be the state of a transaction."}, {"time": 5880, "text": "And that is how it's achieved, right?"}, {"time": 5883, "text": "So it's achieved by users looking at these mathematical contract systems and saying, you know, if I have money in a bank, there's one single person who controls that money, that's the bank, they could choose to give me my money or choose not to give me my money."}, {"time": 5928, "text": "So, you know, that's one example."}, {"time": 5930, "text": "Another example is, hey, we have a hybrid smart contract for something like crop insurance."}, {"time": 5935, "text": "I, as the user, evaluate where this smart contract runs."}, {"time": 5939, "text": "Oh, wow, the smart contract runs on Ethereum."}, {"time": 5941, "text": "Great, thousands of nodes, lots of computational security, hash power, so on and so on."}, {"time": 5948, "text": "Then I look at, oh, well, what triggers the contract?"}, {"time": 5950, "text": "Oh, there's this Oracle network."}, {"time": 5952, "text": "Okay, it's composed of 25 nodes or 15 nodes, gets data from five different weather stations."}, {"time": 5958, "text": "You know, I'm comfortable with that."}, {"time": 5959, "text": "I have a certain level of comfort with that hybrid smart contract and its ability to provide me consensus about the transaction once the contract knows what's happened, and I'm comfortable with the consensus around the event that controls the contract, right?"}, {"time": 5976, "text": "Because once again, that event is what determines what happens with the contract."}, {"time": 5981, "text": "And if the contract is super well written, it doesn't matter if the event isn't reliable, right?"}, {"time": 5987, "text": "So now I've made this determination."}, {"time": 5988, "text": "I've gotten all this clear, transparent information about this system that combines the contract code with a decentralized Oracle network."}, {"time": 5997, "text": "And I've made my decision to participate in this decentralized insurance, kind of crop insurance policy."}, {"time": 6003, "text": "I've sent the Bitcoin or the stable coin or whatever I have on my Android phone."}, {"time": 6009, "text": "And then time goes by and let's say it doesn't rain, lo and behold, the smart contract returns the relevant amount from the policy back to me."}, {"time": 6019, "text": "I continue my life as a farmer."}, {"time": 6022, "text": "And by the way, the fact that that happened contributes reputation and contributes proof back to both the contract as something that can prove to other people that it has settled and the Oracle network as something that can prove that it has properly assessed reality or properly triggered a contract."}, {"time": 6041, "text": "And this is where there's one of many network effects where the more that smart contracts and Oracle networks are used, they themselves generate this immutable on chain data that proves their value and reliability."}, {"time": 6057, "text": "And improving more and more of that in more and more kind of use cases and more and more variants of the same contract, they arrive at a greater body of proof that they like, I am the decentralized crop, the decentralized insurance contract for crop insurance used by a million users."}, {"time": 6079, "text": "And my failure rate is non existent or really low."}, {"time": 6084, "text": "And here's my Oracle network."}, {"time": 6085, "text": "And by the way, it's also settled a million of these."}, {"time": 6088, "text": "And so it's not the logo, right?"}, {"time": 6091, "text": "It's not, hey, what a nice logo you have on top of a building above a train terminal or something."}, {"time": 6100, "text": "It's much more, hey, there's a million people, there's a million separate contracts that got settled correctly."}, {"time": 6106, "text": "I have all the proof that I could ever need about that."}, {"time": 6110, "text": "And it's not something that's very easy to gain, right?"}, {"time": 6113, "text": "Because real value was at stake, real value was moved around."}, {"time": 6117, "text": "And so I think once again, the transparency aspect comes in where you're able to prove that the cryptographically enforced contracts are better."}, {"time": 6129, "text": "That said, you can still integrate the traditional banks as long as you create a data feed on the amount of marble that's included."}, {"time": 6136, "text": "So if that's valuable to you in terms of reputation, you could still integrate the marble, the amount of marble that and the size of the logo."}, {"time": 6146, "text": "We could still keep the banks around."}, {"time": 6148, "text": "I think we will."}, {"time": 6149, "text": "I think what'll happen with the banks and all the insurance companies, by the way, is not that they'll all just die or something."}, {"time": 6154, "text": "I think it'll be just like the internet."}, {"time": 6156, "text": "There'll be some of them that adopt this and some of them that don't, and some of them that do it faster, some of them that do it slower."}, {"time": 6162, "text": "And that's an economic decision that they'll make."}, {"time": 6165, "text": "I think their whole question is, is this a foregone conclusion?"}, {"time": 6168, "text": "I mean, I think my answer is yes, this is definitely gonna be happening."}, {"time": 6172, "text": "I think they still have a question of, is this gonna change my industry?"}, {"time": 6178, "text": "But I'm seeing a definite shift in people's understanding."}, {"time": 6183, "text": "And I think that shift is gonna accelerate rapidly as one or two of them of their competitors throw their hat in the smart contract ring and say, well, I have smart contracts."}, {"time": 6194, "text": "I guarantee my outcomes to you."}, {"time": 6197, "text": "What do they do for you?"}, {"time": 6199, "text": "It's risky, just use mine."}, {"time": 6202, "text": "And the second some of them start losing business because of that, they're gonna move very quickly because that's what all of their compensation structures and all their goal planning structures are based around."}, {"time": 6212, "text": "They're based around what is losing us business or getting us business."}, {"time": 6216, "text": "Yeah, it's fascinating organizationally though, to think about banks, they're very old school and their ability to move quickly is questionable to me."}, {"time": 6226, "text": "I just look at basic online banking, like how good banks are creating a frictionless online experience."}, {"time": 6235, "text": "And I think they're not very good."}, {"time": 6238, "text": "And so that speaks to the kind of people who are in leadership positions at banks, the kind of people they hire, the kind of culture there is."}, {"time": 6247, "text": "So I do wonder if banks will from inside revolutionize themselves to include smart contracts or whether totally new competitors will have to emerge that basically create new kinds of banks."}, {"time": 6262, "text": "Whether, what is the company square?"}, {"time": 6266, "text": "I think it comes up out of nowhere really with Cash App and they have Bitcoin on Cash App, whether they will start incorporating smart contracts and they will revolutionize the whole banking industry or whether Bank of America will revolutionize themselves from within."}, {"time": 6286, "text": "I'm skeptical on Bank of America, but you never know."}, {"time": 6290, "text": "In general, I'm fascinated by how big organizations, whether it's Google or Microsoft or Bank of America, pivot hard in a world that's quickly changing."}, {"time": 6300, "text": "I think that takes bold leadership and a lot of firing and a lot of pain and a lot of meetings where the one asshole brings up the from first principles idea that, you know what, the ways we've been doing stuff in the past require, we need to throw that out and do stuff totally differently."}, {"time": 6320, "text": "I know a lot of those assholes in a lot of these different industries."}, {"time": 6325, "text": "First of all, I think they're getting listened to more and second of all, I think all of these places, as I look at it more and more, I think they have a fundamental line of business that they try to protect and then everybody's compensation and everybody's metrics and goals is focused around that line of business."}, {"time": 6343, "text": "So the second that things begin to impact that, then everybody will be in a senior meeting and that asshole will be quite listened to because he will have the only thoughtful explanation as to why this is happening."}, {"time": 6359, "text": "How things will evolve from there, I actually don't know because that hasn't been the case yet."}, {"time": 6365, "text": "But my thinking is that there will be people who don't wanna cannibalize certain parts of their business or don't wanna change certain parts of their business and then there will be people who say, look, I think this is how the world's gonna work."}, {"time": 6378, "text": "We're gonna make a very, very heavy kind of set of commitments to put resources towards this."}, {"time": 6387, "text": "I already see that with a few banks working on various blockchain based systems, but granted, they've been working on those for years."}, {"time": 6394, "text": "So I think all of this comes down to these kind of quarterly earnings calls where somebody asks them, hey, I saw that bank over there once the blockchain bond or a smart contract derivative platform."}, {"time": 6407, "text": "And I also saw that they made $10 billion in revenues or $10 billion in volume or whatever it is from that."}, {"time": 6415, "text": "What's your plan on the earnings call?"}, {"time": 6418, "text": "And I promise you by the next earnings call, there's a plan."}, {"time": 6422, "text": "And then the question on the next one is, well, when's the plan gonna happen?"}, {"time": 6424, "text": "And then by the next earnings call, it's a plan is happening."}, {"time": 6428, "text": "And that's what these people are sensitive to."}, {"time": 6431, "text": "That's what these organizations are structured around."}, {"time": 6433, "text": "It's not completely economically like disconnected, right?"}, {"time": 6437, "text": "They have this core business, they wanna protect it."}, {"time": 6440, "text": "I understand that idea, but I think that the problem with that is sometimes it requires this myopic focus, right?"}, {"time": 6451, "text": "And that's what all the innovation stuff is about."}, {"time": 6454, "text": "Every time somebody at a corporate entity is about innovation, they're trying to sidestep this."}, {"time": 6460, "text": "But once again, the incentives to maintain whatever the core businesses is so strong that the innovation people, even though they are there, I think they get a phone call and go like, what are we doing for this?"}, {"time": 6475, "text": "And the ones that actually did good work and got ready to do something for this have done their employer and their organization a very positive service."}, {"time": 6485, "text": "Whereas the ones that aren't ready, I mean, they'll make up something and maybe they're really smart and they'll get it together."}, {"time": 6492, "text": "Can we talk about tokens a little bit?"}, {"time": 6495, "text": "Generally speaking, there's been a meteoric rise of a bunch of different tokens."}, {"time": 6500, "text": "We could just talk about Bitcoin and Ethereum as examples."}, {"time": 6504, "text": "Bitcoin I think crossed $60,000 in value."}, {"time": 6507, "text": "What are your thoughts in general on this rise?"}, {"time": 6511, "text": "What's the future of Bitcoin?"}, {"time": 6512, "text": "What's the future of Ethereum?"}, {"time": 6514, "text": "There's the total value locked metric that I think generalizes the different kind of value of these tokens."}, {"time": 6526, "text": "What does the future value and impact of cryptocurrency look like if we look through the lens of these tokens?"}, {"time": 6536, "text": "I think valuing all these tokens and determining that isn't something I'm particularly great at."}, {"time": 6541, "text": "I haven't spent a lot of time on that."}, {"time": 6542, "text": "I've spent the vast majority of my time on building these systems and architecting them and getting them to fruition and getting them to a place where they operate properly on both the technical and the crypto economic and in every other sense."}, {"time": 6555, "text": "I think with Bitcoin, there is a certain conception of non governmental fiat money that Bitcoin is really the first creator of, right?"}, {"time": 6568, "text": "So there's this very powerful idea called fiat money."}, {"time": 6571, "text": "It's basically more or less a kind of 40 year experiment."}, {"time": 6576, "text": "I think on August 15th of this year is maybe I think given the 40th anniversary, government can say, hey, I have a currency and it's worth something and here it is."}, {"time": 6586, "text": "In terms of the way that governments have stopped that in the past is if anyone tries to make another fiat currency in their country, they immediately shut it down, right?"}, {"time": 6596, "text": "They immediately say, hey, this is really bad."}, {"time": 6598, "text": "You've done something really bad."}, {"time": 6600, "text": "It's time for you to stop."}, {"time": 6601, "text": "Don't do it anymore."}, {"time": 6603, "text": "And it stops, right?"}, {"time": 6604, "text": "That's been the history of non governmental fiat currency."}, {"time": 6607, "text": "Bitcoin is really due to its decentralized nature, the first and possibly in some cases, in many people's minds, it's still the only true non governmental fiat currency."}, {"time": 6620, "text": "Now, how powerful is non governmental fiat currency?"}, {"time": 6624, "text": "I have no idea, right?"}, {"time": 6626, "text": "This is why so it's really as powerful as the ideas that people ascribe to it are, right?"}, {"time": 6633, "text": "So let's say people start saying, like right now people are saying, hey, it's internet money."}, {"time": 6639, "text": "It's the money of the internet."}, {"time": 6642, "text": "What's that worth?"}, {"time": 6644, "text": "It's probably worth a lot."}, {"time": 6645, "text": "I have no idea what it's worth, but as an idea, as a concept to underpin the fiat money, the let there be aspect of fiat and of Bitcoin, you basically look at it and you say, yeah, internet money."}, {"time": 6660, "text": "Okay, that could be worth whatever, 60,000, 600,000, great question, right?"}, {"time": 6667, "text": "There are other versions of the world, right?"}, {"time": 6668, "text": "Where people say, there are countries that don't have a good fiat currency and I see a lot of people using Bitcoin."}, {"time": 6676, "text": "So Bitcoin isn't internet money, it's countries without a good currency money."}, {"time": 6684, "text": "So all the countries without a good currency now use Bitcoin and let there be, Bitcoin as this, right?"}, {"time": 6691, "text": "As this conception of Bitcoin."}, {"time": 6693, "text": "What's the value of that?"}, {"time": 6696, "text": "Probably huge amount of value."}, {"time": 6699, "text": "Then there's a further conception of Bitcoin as some digital gold."}, {"time": 6705, "text": "There's a scarcity dynamic."}, {"time": 6706, "text": "There's all these other kinds of dynamics."}, {"time": 6709, "text": "What is a portable version of digital gold with some kind of built in scarcity worth?"}, {"time": 6717, "text": "You know, kind of artificially created scarcity."}, {"time": 6725, "text": "I haven't done the analysis on that is the point, might be worth a lot."}, {"time": 6729, "text": "What is it all worth if all three of these things, you know, flow into the same fiat, kind of let there be Bitcoin as these three things conception of Bitcoin?"}, {"time": 6741, "text": "I don't know what that's worth."}, {"time": 6742, "text": "I also don't know what that's worth, but could be worth a huge amount."}, {"time": 6745, "text": "So I think it's not, I don't think it's, I personally don't think it's super important what I think it's worth or what many other people think it's worth."}, {"time": 6753, "text": "I don't think that's really that important."}, {"time": 6755, "text": "I think what's probably important is understanding what the societal conception of Bitcoin is and how does that societal conception evolve over time."}, {"time": 6769, "text": "And that interestingly enough, doesn't just depend on, you know, you or me or the people who made Bitcoin or anything else."}, {"time": 6778, "text": "It actually depends on current events."}, {"time": 6780, "text": "So for example, if people suddenly say, I'm more and more worried about fiat currency."}, {"time": 6785, "text": "I'm more and more worried that governmental fiat, even if it's the most reliable version of that is not as good as I thought it was."}, {"time": 6794, "text": "Maybe I should go on the PayPal app and maybe I should get some Bitcoin just in case."}, {"time": 6800, "text": "What's the world where Bitcoin is a certain percentage of everyone's ownership as a hedge against governmental fiat money not being so good?"}, {"time": 6812, "text": "Haven't done the analysis, but another example, right?"}, {"time": 6815, "text": "Here's this conception, that's the conception."}, {"time": 6818, "text": "So when I look at Bitcoin, what I see is a lot of these fascinating conceptions of what the fiat, let there be value of Bitcoin is."}, {"time": 6827, "text": "By the way, all of them could be true."}, {"time": 6830, "text": "Maybe some of them are true."}, {"time": 6831, "text": "Maybe some of them aren't true."}, {"time": 6833, "text": "And the fascinating thing is that I've seen this conception change, right?"}, {"time": 6836, "text": "So when I started in the Bitcoin space, the conception was micropayments."}, {"time": 6841, "text": "The cost of Bitcoin is low, we'll have micropayments."}, {"time": 6845, "text": "Micropayments are wonderful for machine to machine transactions, micropayments are wonderful."}, {"time": 6850, "text": "The emerging market, and that's fine, right?"}, {"time": 6853, "text": "And that was one conception of Bitcoin as let there be Bitcoin as micropayments platform, right?"}, {"time": 6859, "text": "But then the value rose and things changed."}, {"time": 6861, "text": "There wasn't enough expansion in certain ways."}, {"time": 6864, "text": "And now the conception has evolved into this other conception."}, {"time": 6868, "text": "But at the end of the day, I think governments have a very clear set of steps for directing the public's conception of their fiat, right?"}, {"time": 6880, "text": "They say our fiat is worth this for these reasons."}, {"time": 6884, "text": "Bitcoin doesn't have that."}, {"time": 6885, "text": "Bitcoin doesn't have an official Bitcoin spokesperson that goes out and says, the non governmental money called Bitcoin, the non governmental fiat money called Bitcoin has value on the basis of this, this, this and this."}, {"time": 6897, "text": "Here's our fiscal budget, here's our future plans."}, {"time": 6900, "text": "Our money will continue to be safe and secure and reliable."}, {"time": 6904, "text": "And so what that hole creates is a hole that we all fill, right?"}, {"time": 6909, "text": "We all basically come to some vague kind of group understanding that Bitcoin is worth this because it is tied to, let's say all non governmental fiat money comes into question, everybody doubts it, possibly due to inflation."}, {"time": 6932, "text": "And everybody says, you know, this is nice, but I'd like to keep 10, 20% of my wealth in non governmental fiat, just in case, you know, what are those numbers?"}, {"time": 6947, "text": "I mean, if that happens, you know, I'm guessing you can add a few zeros."}, {"time": 6952, "text": "I like how you say I haven't done the analysis as if I'm sure a lot of people have done quote unquote analysis, but it's not, it's still speculation."}, {"time": 6960, "text": "Nobody can predict the future, especially when so much of it has to do with a large number of people holding an idea in their mind as to the importance of a particular technology like Bitcoin."}, {"time": 6973, "text": "There's a lot of excitement by its possibilities, but the number of zeros you add is an open question and nobody can do a perfect analysis except whoever created this simulation."}, {"time": 6987, "text": "Let me ask you this question."}, {"time": 6990, "text": "Who is Satoshi Nakamoto?"}, {"time": 6993, "text": "There's quite a few people who suggest that person is you."}, {"time": 6999, "text": "So is it you?"}, {"time": 7005, "text": "Who do you think it could be?"}, {"time": 7007, "text": "I don't know who it is."}, {"time": 7008, "text": "I think if I had to guess, it's probably a group of people, some of which might not even be around anymore."}, {"time": 7015, "text": "You know, obviously I'm very grateful to, if this is a singular or a group of people for kicking off this entire industry and making this amazing change in the world that I have the privilege and luxury of being part of in some small way in the work that I do."}, {"time": 7029, "text": "I think also this kind of focus on who is Satoshi or who isn't Satoshi, shouldn't in my opinion matter so much because regardless of who it is, that in my opinion should have no substantial significant effect or bearing on the functioning or the value or the use or the security of the Bitcoin system, right?"}, {"time": 7053, "text": "So I think whoever it is, they're probably better off not making that public."}, {"time": 7058, "text": "And I think beyond that, whoever it turned out to be shouldn't matter because it has nothing to do with how the system is made useful or secure or anything else."}, {"time": 7070, "text": "And so I think that's the point of view that I have."}, {"time": 7074, "text": "Now, if you were Satoshi Nakamoto, would you tell me?"}, {"time": 7078, "text": "Because you said they shouldn't, whoever Satoshi is, you should keep that private."}, {"time": 7085, "text": "So would you tell it to me or no?"}, {"time": 7088, "text": "We're in some kind of weird like thought experiment here."}, {"time": 7092, "text": "If I was this guy, let me think about this, which I'm not, by the way, I am not this person."}, {"time": 7099, "text": "But if you were, would you say it?"}, {"time": 7101, "text": "I think probably not."}, {"time": 7109, "text": "I don't see the, I think that they would cause a lot of distraction and a lot of weird stuff."}, {"time": 7114, "text": "And so realistically, I don't think it would help anybody or even the person who discloses it, but just to be clear, I am not."}, {"time": 7122, "text": "And whoever it is, I think they haven't said anything because they don't want the attention and they don't want the distraction and they don't want all the problems from this."}, {"time": 7129, "text": "And that makes sense to me, conceptually."}, {"time": 7133, "text": "It's fascinating to think if they're still out there and part of the Bitcoin, the cryptocurrency community, and it is inspiring to think that if they're out there, that they're not revealing their identity because it would be a distraction."}, {"time": 7151, "text": "That's kind of inspiring that people are like that."}, {"time": 7153, "text": "Just like George Washington, a relinquishing power is inspiring because it's ultimately about the progress of the community and not some kind of ego driven attention scheme."}, {"time": 7165, "text": "Again, very inspiring."}, {"time": 7166, "text": "The humans at their best are inspiring."}, {"time": 7169, "text": "What do you think about the certainty that people in the Bitcoin Maximus community have about this particular piece of technology, Bitcoin?"}, {"time": 7178, "text": "Is there something interesting that you think that you might wanna say about this community or is it just is what it is?"}, {"time": 7188, "text": "I think at the end of the day, results speak for themselves and Bitcoin has had an amazing impact on our industry and has had an amazing impact on the world."}, {"time": 7199, "text": "And I think the result is still that Bitcoin is very widely adopted and driving the adoption of our industry in many ways."}, {"time": 7207, "text": "So I think it's very difficult for people to say that Bitcoin maximalists don't have something that they can latch onto and say, hey, there's something very real here."}, {"time": 7216, "text": "I think there's been decisions made by the Bitcoin community and the people who made the Bitcoin protocol to focus it on Bitcoin and to focus it on the kind of storing of the ledger of Bitcoin and the information about Bitcoin and the transaction of Bitcoin and to focus on securing that."}, {"time": 7234, "text": "And I understand why that decision was made to a certain degree, right?"}, {"time": 7238, "text": "It was about focus."}, {"time": 7239, "text": "It was about getting something worthwhile right without adding additional features and additional risk."}, {"time": 7246, "text": "And that decision is a decision that was made and has kind of the benefits of focus and the benefits of a certain amount of security and a certain amount of guarantees around Bitcoin and what that is and the value of that."}, {"time": 7264, "text": "And then it has certain limitations as a consequence of doing less or having the system hold data that isn't related to Bitcoin or not having the system hold contractual outcomes or smart contract code."}, {"time": 7279, "text": "So I think it's just kind of a decision, right?"}, {"time": 7281, "text": "And I understand why they're excited and I'm very excited."}, {"time": 7285, "text": "I started in this industry going to Bitcoin meetups and I met a lot of fantastic people, libertarian people that wanted to see the world work differently and shared a lot of my beliefs and a lot of my points of view."}, {"time": 7297, "text": "And so anyone who's been in the industry as long as I have has had to come from the Bitcoin ecosystem by virtue of kind of starting out that early."}, {"time": 7308, "text": "So I have an unbelievable amount of respect and admiration and gratitude for Bitcoin and that it exists and everything that it's done and that it birthed this industry."}, {"time": 7318, "text": "There's absolutely no doubt about that."}, {"time": 7321, "text": "At the same time, whatever design decisions people make are the design decisions they make, right?"}, {"time": 7327, "text": "And so if you've made a design decision that this ledger and this thing will be about Bitcoin, it won't be about colored coins, it won't be about op return at 80 bytes, it won't be about these other kind of nuances that you don't want this to be about, then that's fine."}, {"time": 7343, "text": "That's fine and that's a logical decision and it's called focus."}, {"time": 7348, "text": "And focus has a lot of value and a lot of great technology products have focused on something and done that."}, {"time": 7356, "text": "And then there's a lot of smart people around Bitcoin building kind of additional systems that anchor their security within Bitcoin."}, {"time": 7364, "text": "And I think that's an interesting approach that could bear fruit."}, {"time": 7368, "text": "I think it'll eventually require an interaction with a Bitcoin protocol in more advanced ways."}, {"time": 7374, "text": "And then there will be another question of, what is the design decision for Bitcoin?"}, {"time": 7378, "text": "Is it that Bitcoin will be just about the Bitcoin ledger?"}, {"time": 7382, "text": "Or does Bitcoin want to evolve into an anchor for all these other systems and maybe create additional data store, kind of more data on chain, on the Bitcoin blockchain related to that?"}, {"time": 7398, "text": "So I'm excited to see how that evolves, but until then kind of results speak for themselves and the results that Bitcoin has achieved for our industry and for itself as kind of the dominant cryptocurrency and the conception of our industry that people interact with first is obviously very important and something that I think really everybody in our industry is grateful for, right?"}, {"time": 7420, "text": "Because without Bitcoin, where would our industry be?"}, {"time": 7423, "text": "And that's obviously something that we can't forget."}, {"time": 7426, "text": "What are your thoughts about Ethereum in the chain link distributed Oracle network world?"}, {"time": 7435, "text": "Is it competition?"}, {"time": 7437, "text": "Is it collaboration?"}, {"time": 7439, "text": "Is it complimentary technology?"}, {"time": 7442, "text": "What do you think about Ethereum?"}, {"time": 7443, "text": "How much do you think about Ethereum?"}, {"time": 7445, "text": "What role does it have?"}, {"time": 7447, "text": "Yeah, I think about a lot."}, {"time": 7448, "text": "I think we're completely complimentary."}, {"time": 7451, "text": "So there's no competitive dynamics in my opinion."}, {"time": 7453, "text": "We are completely collaborative and complimentary with Ethereum and all other blockchains and all other layer twos that operate a contract, right?"}, {"time": 7462, "text": "So we do not seek to operate a smart contract."}, {"time": 7466, "text": "We seek to augment and enable smart contracts to go further in what they're able to do."}, {"time": 7472, "text": "In fact, Oracle networks have some value, but they don't have nearly as much value in what they do if there isn't a mission critical system like a smart contract that needs their data, right?"}, {"time": 7483, "text": "So we've made our own explicit design decisions in our own and created our own focus around guaranteeing that smart contracts can go further."}, {"time": 7493, "text": "We've already done that, right?"}, {"time": 7494, "text": "Decentralized finance, the rate at which we put data is to a degree the rate at which certain decentralized financial markets grow."}, {"time": 7501, "text": "And as we put more data, we see more financial products go live, gaming, we provide VRF."}, {"time": 7505, "text": "So we have this kind of focus and it's a very useful and valuable kind of, valuable for our industry focus."}, {"time": 7513, "text": "At the end of the day, I think that smart contract platforms like Ethereum made a different set of design decisions from Bitcoin and others."}, {"time": 7523, "text": "And they focused on creating the smart contract capability and they kind of wanted that functionality to exist."}, {"time": 7532, "text": "And I think since then, there's been a number of people that try to improve on that or try to make variants of that."}, {"time": 7537, "text": "From our point of view, we want to support smart contracts in all of their variations and in all of their use cases."}, {"time": 7546, "text": "So one of the things that I personally like about Chainlink is their ability or Chainlink's ability and the Chainlink network's ability to be useful to many different chains and across many different use cases."}, {"time": 7558, "text": "I'm personally a fan of Ethereum."}, {"time": 7560, "text": "Ethereum has done a huge amount for our industry as well."}, {"time": 7563, "text": "Ethereum took us from a world where it literally took months to make a new smart contract by being forced to code it into a protocol."}, {"time": 7570, "text": "You had to go to the protocol developers and you had to say, hey, I need a DEX or I need some kind of smart contract."}, {"time": 7577, "text": "Put it in the protocol itself."}, {"time": 7579, "text": "Put it in the actual blockchain mining and kind of block generation, transaction generation protocol."}, {"time": 7585, "text": "That would take months or sometimes even over a year."}, {"time": 7587, "text": "That was a horrible experience and obviously very few people wanted to participate in that and so very few people made smart contracts, which I was not a fan of, right?"}, {"time": 7595, "text": "And then Ethereum came along and really did a lot of innovative things and introduced this approach to scriptable smart contracts where you could script all of these different conditions."}, {"time": 7606, "text": "And I found that fascinating before Ethereum."}, {"time": 7609, "text": "I found that fascinating once Ethereum arrived, I found it fascinating after Ethereum launched and I still find it fascinating."}, {"time": 7615, "text": "And I'm also very grateful to Vitalik and the Ethereum community and all the core developers there for taking our industry a step further."}, {"time": 7623, "text": "So I think they absolutely deserve a huge amount of credit for taking our industry from it takes months to make a really small smart contract to it takes weeks to make a relatively secure, relatively advanced piece of on chain code that anybody can script and people can do audits on and that's an unbelievable leap forward for our industry and I'm genuinely grateful to them for that."}, {"time": 7649, "text": "I think the next step in line with our body of work is how does that scriptable on chain code become more advanced in its interaction with all of the systems and events in the real world, which is in my opinion, the final missing piece of the puzzle, right?"}, {"time": 7668, "text": "So my body of work, the body of work that I'm involved in would not be where it is right now without Bitcoin by any measure."}, {"time": 7674, "text": "It wouldn't even be where it is now without Ethereum and the growth in smart contract development that they've created."}, {"time": 7706, "text": "We are excited and I am excited and the Chainlink community is excited and basically there's a lot of, I mean, for lack of a better word, excitement in seeing our industry graduate to providing more use cases, more usable hybrid smart contracts, right?"}, {"time": 7726, "text": "Because once again, it's absolutely amazing that Bitcoin created non governmental fiat money."}, {"time": 7731, "text": "It's an unbelievable innovation and invented decentralized infrastructure and birthed our industry."}, {"time": 7737, "text": "It's an unbelievably great achievement, an amazing achievement that we now have scriptable smart contracts through something like Ethereum."}, {"time": 7744, "text": "Once again, monumental achievement in my opinion."}, {"time": 7748, "text": "Once again, we still need to look to the future."}, {"time": 7776, "text": "You mentioned results speak for themselves and how design decisions have consequences."}, {"time": 7783, "text": "The Chainlink community have come up with a lot of brilliant designs."}, {"time": 7788, "text": "So how do you think through the design choices that you're facing where you can't predict the future, but you're trying to create a better future?"}, {"time": 7798, "text": "Is there something low level introspective advice that you can give or describe as to how you think through those decisions or high level how you think about those decisions?"}, {"time": 7816, "text": "And I think that actually gets to the core of what the Chainlink network is supposed to achieve."}, {"time": 7822, "text": "We are supposed to achieve a maximally flexible system."}, {"time": 7827, "text": "So once again, this is the big difference between Chainlink and Oracle networks in general and blockchains in my opinion."}, {"time": 7833, "text": "Blockchains do not seek to be maximally flexible, right?"}, {"time": 7836, "text": "They say, here's my block size, here's the transaction types you can put in those blocks."}, {"time": 7843, "text": "Here's the contract language I have."}, {"time": 7846, "text": "Here's kind of my blockchain system, right?"}, {"time": 7849, "text": "Here's the fee structure for those blocks."}, {"time": 7851, "text": "They're gonna keep getting kind of composed, transactions are gonna get put into blocks, blocks will get connected and it'll continue, right?"}, {"time": 7858, "text": "And that's a very focused type of system."}, {"time": 7861, "text": "And that makes sense because it's focused on creating security for that category of on chain activity, which is once again, a critical, critical part of building a highly transparent system and something that Chainlink enables and doesn't compete with and just enables to do more."}, {"time": 7877, "text": "Oracle networks, conversely, have to interact with all the world's data and provide all the services that blockchains don't provide, right?"}, {"time": 7887, "text": "So there's kind of a spectrum."}, {"time": 7888, "text": "On one end of the spectrum, you have blockchains that are highly secure, highly reliable, highly tamper proof, highly transparent, but are not very feature rich."}, {"time": 7898, "text": "For example, they cannot talk to an API."}, {"time": 7901, "text": "Many of them can't generate randomness."}, {"time": 7902, "text": "They cannot do some kind of privacy preserving computation."}, {"time": 7906, "text": "So they're very secure."}, {"time": 7907, "text": "And there are these kind of data structures and smart contract platforms to hold on chain code that can define conditions, receive value, pay value back out under conditions and create transparency around all that, which makes perfect sense."}, {"time": 7923, "text": "And then there's oracles and oracle networks."}, {"time": 7926, "text": "That is all the world's data, right?"}, {"time": 7928, "text": "We're talking about taking all the world's data and making it consumable for all the world's use cases that have trust issues."}, {"time": 7936, "text": "So the amount of variability there is absolutely massive, right?"}, {"time": 7940, "text": "It's like the decentralized oracle network and the conditions that that decentralized oracle network needs to meet is gonna vary very widely from an insurance contract to a lending contract to an ad network contract to the data sales contract that we discussed to any number of other smart contracts."}, {"time": 7960, "text": "So really the ability of a decentralized oracle network to flexibly address all of those requirements is what's necessary."}, {"time": 7969, "text": "So flexibility is the goal, whereas with on chain like Bitcoin, flexibility is the enemy in the sense that you want security, you want the focus there."}, {"time": 7983, "text": "And in that kind of world, design decisions have huge consequences."}, {"time": 7988, "text": "And then if you look at the distributed oracle network side, you want to remove the restrictions of design choices."}, {"time": 7996, "text": "You want to provide maximal flexibility then."}, {"time": 7999, "text": "So it's a completely separate kind of a design framework."}, {"time": 8003, "text": "It's a slightly different problem, right?"}, {"time": 8005, "text": "Because we're not trying to define transaction types fitting into blocks on a certain timeline of those blocks being generated."}, {"time": 8012, "text": "We're trying to say, hey, there's this world of services or this world of data that's not very deterministic, but it's unbelievably useful to these smart contracts over here."}, {"time": 8020, "text": "And actually they need it to even exist."}, {"time": 8022, "text": "And we really want them to exist because once they exist, it's gonna completely redefine what our whole industry is known for, right?"}, {"time": 8028, "text": "And defined NFTs are not even the tip of the iceberg."}, {"time": 8031, "text": "They're like the snow coming off the top of the iceberg."}, {"time": 8034, "text": "And so our goal is to create a framework and an infrastructure and a software that allows people to compose decentralized oracle networks, right?"}, {"time": 8044, "text": "So initially you can compose a decentralized oracle network of seven nodes that goes to three data sources to trigger your contract worth a million dollars."}, {"time": 8054, "text": "And that's where you could start."}, {"time": 8055, "text": "And then let's say your smart contract, your DeFi smart contract goes to a billion dollars."}, {"time": 8059, "text": "Well, then you need to make some changes, right?"}, {"time": 8061, "text": "You need to go from seven nodes to 15 or maybe 31 nodes."}, {"time": 8065, "text": "And you need to go from three data sources to five or seven."}, {"time": 8069, "text": "And you maybe need to create some kind of what we call circuit breakers and some other checks."}, {"time": 8076, "text": "And you need to make sure that the decentralized oracle network comes to consensus around those checks."}, {"time": 8080, "text": "Because now the centralized oracle network isn't controlling a million dollars, it's controlling a billion dollars."}, {"time": 8085, "text": "And we have decentralized oracle networks that control well over a billion dollars, multiple billions of dollars."}, {"time": 8090, "text": "And we see them growing and getting more advanced data sources and more advanced features."}, {"time": 8095, "text": "And then if somebody else comes and says, well, I don't really wanna make a DeFi product, I wanna make crop insurance."}, {"time": 8100, "text": "And I have a completely different set of conditions."}, {"time": 8102, "text": "I want this method of consensus and I want data to be aggregated in this way, but not the way that you do for decentralized financial products."}, {"time": 8109, "text": "I mean, what are we supposed to tell them?"}, {"time": 8110, "text": "We're supposed to tell them, no, our decentralized oracle network can't let you do that."}, {"time": 8115, "text": "And you can go and wait another five years until somebody builds it for you."}, {"time": 8121, "text": "That's not what we wanna do, right?"}, {"time": 8123, "text": "What we wanna do is be able to say, absolutely, here's an example of how somebody else made a decentralized oracle network for weather insurance."}, {"time": 8134, "text": "Here's a template, change that template, evolve it to meet your needs."}, {"time": 8139, "text": "And then someone else comes and says, hey, I have some other use case in gaming, right?"}, {"time": 8144, "text": "I wanna make NFTs related to real world sports events, or I wanna do whatever I wanna do with some kind of sports related data."}, {"time": 8152, "text": "Wonderful, here's the framework, here are your risk dynamics, here's a collection of node operators, here's a set of preintegrated data sources, here's a reputation system to assess the quality of your ensemble of nodes, here's a way to scale that up as the value in your contract scales."}, {"time": 8173, "text": "Here's all the tools that you need to build this contract."}, {"time": 8177, "text": "And what we actually see now as there are multiple types of computations and data sources that are provided by different decentralized oracle networks, of which there are now hundreds, we now see that a single hybrid smart contract might use multiple decentralized oracle networks."}, {"time": 8194, "text": "So there might be a hybrid smart contract that uses a price data, decentralized oracle network, a proof of reserve oracle network, a randomness oracle network."}, {"time": 8203, "text": "And I think we're gonna continue to see this dynamic that more and more advanced contracts compose various decentralized oracle networks into more advanced use cases."}, {"time": 8215, "text": "And this is the dynamic that we're focused on enabling."}, {"time": 8221, "text": "And I think it's actually a very virtuous cycle for everybody because the more of these hybrid smart contracts we enable on Ethereum and other blockchains, the more our industry provides real world outcomes to the market."}, {"time": 8235, "text": "To the larger world, which is at the end of the day, what I think everybody in our industry wants."}, {"time": 8241, "text": "Everybody in our industry wants hybrid smart contracts to become the way that global finance works, global trade works, global insurance products work, because they will inherently need both a blockchain on which the contract itself lives and an oracle network that powers all of the other interactions, right?"}, {"time": 8261, "text": "As a developer, how would you recommend somebody listening to this, but also me, to get started with smart contracts and to get started with hybrid smart contracts?"}, {"time": 8277, "text": "Well, for hybrid smart contracts, I'm gonna have to do some kind of shameless promotion."}, {"time": 8281, "text": "Please, let me twist your arm."}, {"time": 8286, "text": "I think you can go to our YouTube."}, {"time": 8288, "text": "We have a number of developer tutorials."}, {"time": 8291, "text": "Chainlink YouTube?"}, {"time": 8292, "text": "Yeah, Chainlink."}, {"time": 8293, "text": "I think if you just search Chainlink on YouTube, you should find it."}, {"time": 8297, "text": "Beyond that, we recently had a hackathon where we had a huge amount of very kind of advanced hybrid smart contracts getting built."}, {"time": 8305, "text": "To elaborate on that, you had a hackathon."}, {"time": 8308, "text": "Is that something that people can follow along like a video or there's web page traces of what happened?"}, {"time": 8315, "text": "Or is there a future actual hackathons that people could literally participate in?"}, {"time": 8319, "text": "There's plenty of more hackathons coming up."}, {"time": 8321, "text": "We wanna enable as many developers in web3 and web2 to build hybrid smart contracts as a way to redefine our industry and kind of make all of these smart contracts come to life."}, {"time": 8332, "text": "There are definitely gonna be more hackathons."}, {"time": 8334, "text": "So people should go and preregister or register on a list to get involved in that."}, {"time": 8338, "text": "That's a great resource where we have a lot of speakers and a lot of educational tools."}, {"time": 8341, "text": "They happen over a course of weeks, not days."}, {"time": 8344, "text": "So there's a long time for people to work on these things at the speed that they find comfortable."}, {"time": 8350, "text": "One, is there a kind of hello world entry point for hybrid smart contracts?"}, {"time": 8357, "text": "And two, on the hackathon side, what kind of stuff do you see people building at first?"}, {"time": 8362, "text": "Just kind of getting their feet wet in terms of the kind of applications that could be enabled."}, {"time": 8368, "text": "I mean, there's unbelievable things that we see people building."}, {"time": 8372, "text": "I think how to get your feet wet, I think the hello world is probably DeFi because it's pretty straightforward."}, {"time": 8378, "text": "And there's a large amount of data sources that we already have putting data on chain on test net, which is the test environment in which people would build."}, {"time": 8385, "text": "So I think DeFi is probably to a certain degree the most exciting for certain people and pretty expansive in terms of the tutorials and the amount of contracts to see how people have already built it."}, {"time": 8397, "text": "I think beyond that, we see people building amazing things at these hackathons."}, {"time": 8401, "text": "In the previous hackathon, we saw somebody build a smart contract that allows someone to rent out their Tesla."}, {"time": 8409, "text": "So it allows the Tesla API to give someone else access and rent out someone's Tesla on the basis of a smart contract kind of coordinating payment, which was kind of amazing."}, {"time": 8422, "text": "The more recent hackathon, we saw something called Dbridge, which is a cross chain solution that uses Oracle networks to confirm data on different chains."}, {"time": 8430, "text": "So I think the things that people build will just become expansive and varied in ways that I can't even imagine."}, {"time": 8440, "text": "But I think this recent hackathon saw a huge, huge list of different kind of winners in different categories."}, {"time": 8448, "text": "And there's so many different categories."}, {"time": 8449, "text": "We even have a GovTech category and a whole bunch of things."}, {"time": 8453, "text": "If people wanna see what's possible, they can go look at the winners."}, {"time": 8455, "text": "I think that's probably a good idea."}, {"time": 8459, "text": "Yeah, that'll be on the side of the hackathon."}, {"time": 8461, "text": "There's a blog related to that, and we're gonna have more of these."}, {"time": 8465, "text": "And once again, our explicit goal is to take our industry into this world of hybrid smart contracts, which just benefits everybody."}, {"time": 8474, "text": "It makes more on chain activity."}, {"time": 8476, "text": "It helps provide real world value to the average person from all of this infrastructure period."}, {"time": 8483, "text": "And at the end of the day, I think that it just redefines what our industry is about through use cases, right?"}, {"time": 8489, "text": "Because if you only learn through our industry from the point of view of a single use case, like the NFT use case or some other use case, that's what our industry is about."}, {"time": 8499, "text": "And the more of these use cases that people can make available to the average person or to the FinTech world or to the insurance world or wherever, the faster our industry will not just be about Bitcoins or tokens, it will be about changing global finance, changing global insurance, changing global trade."}, {"time": 8518, "text": "And that's the change in the world that I and a lot of other people in this industry, I think, got into this for."}, {"time": 8524, "text": "Now it's funny, you've mentioned about, you've had a lot of kind words to say about Bitcoin and Ethereum as important technology that paved the way for the future."}, {"time": 8534, "text": "And you somehow did not mention one of the most profound pieces of technology, which is Dogecoin."}, {"time": 8540, "text": "What are your thoughts about this particular revolutionary technology?"}, {"time": 8546, "text": "And what are your thoughts about Dogecoin going to the moon, to Mars, and outside of the solar system?"}, {"time": 8552, "text": "I think Dogecoin is a very interesting kind of, probably closer to a social experiment than anything else."}, {"time": 8560, "text": "Isn't everything a social experiment?"}, {"time": 8562, "text": "Yeah, I guess that's fair to a degree."}, {"time": 8566, "text": "I think it's fascinating how that's evolved."}, {"time": 8569, "text": "I think the people that made it with certain goals in mind and then it's kind of taken on a life of its own."}, {"time": 8576, "text": "I don't fully understand exactly why it's taken on a life of its own at this point."}, {"time": 8581, "text": "I once again, I don't spend too much time thinking about different tokens and how they're evolving."}, {"time": 8587, "text": "I'm much more focused on the launching and..."}, {"time": 8590, "text": "The technology around trust and all those kinds of ideas."}, {"time": 8595, "text": "But I think one of the fascinating things about Dogecoin is how technology that leverages social dynamics, that technology's ability to utilize fun and memes to spread."}, {"time": 8610, "text": "I think it's really interesting."}, {"time": 8611, "text": "I don't think it should be discounted as a..."}, {"time": 8615, "text": "I think I tweeted today something about like the fundamental force field of fun."}, {"time": 8621, "text": "That fun has an effect on the space time."}, {"time": 8625, "text": "So general relativity describes how mass and energy can curve space time."}, {"time": 8630, "text": "And I was just giving an example that when life is fun, it seems short."}, {"time": 8636, "text": "When life is not fun, it seems very long."}, {"time": 8638, "text": "So fun has a very similar effect on space time, like in curved space time."}, {"time": 8642, "text": "In that same sense, there is a power to the meme."}, {"time": 8647, "text": "And I think Dogecoin illustrates that."}, {"time": 8649, "text": "I think Elon is an example of somebody that uses Dogecoin."}, {"time": 8652, "text": "I don't know his philosophy in particular on this aspect, but he does use Dogecoin."}, {"time": 8658, "text": "But he does use it effectively to excite the world in a fun way about the possibilities of future technologies like cryptocurrency."}, {"time": 8669, "text": "I think the Bitcoin world is very serious right now."}, {"time": 8673, "text": "We've spoken about Bitcoin maximalists."}, {"time": 8676, "text": "There is very little space for fun and joking in the Bitcoin world, but there's still a little bit of fun and humor left in the Dogecoin world."}, {"time": 8688, "text": "In that sense, I think it's exceptionally powerful to inspire, to excite, to be able to talk about stuff without the seriousness of financial impact that now certain cryptocurrencies have like Bitcoin."}, {"time": 8708, "text": "So I keep an eye on, I've previously mentioned that Dogecoin I think is a fascinating piece of technology because I do think cryptocurrency is much bigger than the technology that you focus on."}, {"time": 8723, "text": "There is also a social element that you also spoke to that's I think not quite yet understood and it's fascinating to watch, especially as it covalls with the different tools on the internet, the different social networks, social network mechanisms on the internet."}, {"time": 8742, "text": "So I'm a huge supporter of Dogecoin because I'm a huge supporter of fun."}, {"time": 8749, "text": "I'm fascinated to see how it'll work out."}, {"time": 8754, "text": "You think it'll go to the moon?"}, {"time": 8755, "text": "You think it'll be the first cryptocurrency to land on the moon?"}, {"time": 8759, "text": "I couldn't say."}, {"time": 8760, "text": "I haven't done the analysis as I've said before."}, {"time": 8764, "text": "I haven't done the analysis."}, {"time": 8765, "text": "Well, yeah, no matter what, I do hope we will get humans back on the moon and hopefully get humans on Mars soon."}, {"time": 8775, "text": "Dogecoin, Bitcoin or not."}, {"time": 8781, "text": "Let me ask you about books and movies."}, {"time": 8785, "text": "What books and movies in your life long ago when you were a baby Sergei or today had an impact on you?"}, {"time": 8796, "text": "Maybe you would recommend to others and maybe what ideas you took away from those books, movies, coloring books, children's books, blogs, whatever."}, {"time": 8809, "text": "Yeah, yeah, sure."}, {"time": 8811, "text": "So I think one of the things that had a very big impact on me were Plato's dialogues and particularly Protagoras and Gorgias as some of the two initial ones."}, {"time": 8822, "text": "I think what Plato's dialogues do very well is they give people a clear picture of what dialogue looks like and what the assessment of information probably should look like, right?"}, {"time": 8835, "text": "And how the dissection and analysis of an idea is very important and how it can actually be taken in either direction."}, {"time": 8842, "text": "But at the end of the day that the process of eliminating kind of this fuzzy thinking and arriving at whether it's an external dialogue or an internal dialogue about an accurate picture of reality is actually very important."}, {"time": 8858, "text": "And so I think I'm very lucky to have read the dialogues when I was in my early teenage years and it had a very large impact on me because it kind of showed me that nobody knows what they're talking about."}, {"time": 8871, "text": "I would play out dialogues in my mind and I would engage in certain dialogues with different people."}, {"time": 8878, "text": "And what the Platonic dialogue showed me was kind of how to tell when someone has no clue."}, {"time": 8886, "text": "And a lot of people are very good at kind of say they have a clue, right?"}, {"time": 8892, "text": "Saying like, here's how the world works."}, {"time": 8894, "text": "Here's what you should do with your life."}, {"time": 8895, "text": "Here's what you should do with your time."}, {"time": 8896, "text": "Here's what you should do with your money."}, {"time": 8898, "text": "Here's what you should do with your attention."}, {"time": 8899, "text": "Here's what you should do with all these things."}, {"time": 8902, "text": "And I think the ability to evaluate information generally is something that is surprisingly under taught."}, {"time": 8911, "text": "I don't actually understand why there isn't a course in like high schools or universities that's just like, here is how you evaluate information."}, {"time": 8919, "text": "Here's how you engage in external dialogue and internal dialogue to arrive at an accurate picture of reality rather than the picture of reality that other people want you to have for their benefit most often, right?"}, {"time": 8930, "text": "And at the end of the day, I think that put me down a path to really try and understand."}, {"time": 8937, "text": "Beyond that, I think biographies have had a very large impact on me."}, {"time": 8943, "text": "Plutarchs, Greek and Roman lives."}, {"time": 8945, "text": "After I read Plato, I started reading a bunch of stuff, Greek stuff."}, {"time": 8949, "text": "I was just like, these Greek guys, they really know how it is."}, {"time": 8952, "text": "They did this 2000 years ago and they still got it right."}, {"time": 8956, "text": "It's kind of this like a theory of time around them, the value of intellectual ideas, right?"}, {"time": 8961, "text": "If an intellectual idea has survived the test of time, it's much more valuable than the intellectual idea that I just came up with 10 minutes ago, I haven't told anybody and hasn't gone up against all of the kind of rebuttals."}, {"time": 8976, "text": "So what's your favorite, what would you say would be a most impactful biography that you've come across?"}, {"time": 8983, "text": "I don't think it was those Greek or Roman biographies because they were very far away."}, {"time": 8988, "text": "I think that probably one of the most impactful ones that I can remember recently is around Vanderbilt."}, {"time": 8999, "text": "And so Vanderbilt was this guy who basically, without that much of an education, he would invent or work with people to make these steamboats."}, {"time": 9010, "text": "And then he had a lot of acumen around creating certain monopolies, regardless of what was right or wasn't right."}, {"time": 9020, "text": "Right or wasn't right."}, {"time": 9022, "text": "And then fascinating enough, it all hinged on like a Supreme Court case that decided if monopolies were acceptable in the form of state created monopolies or not."}, {"time": 9032, "text": "And if it was deemed that state created monopolies were acceptable, he would have had a huge problem, this guy."}, {"time": 9039, "text": "But it was deemed that state created monopolies through these licenses for steamboat routes was not acceptable."}, {"time": 9047, "text": "And that did two interesting things that unseated some kind of old time landed gentry in the Americas in like the 1830s and 40s."}, {"time": 9057, "text": "And it basically made him right and he saw it before other people."}, {"time": 9063, "text": "So I think Vanderbilt was a very interesting personality, first of all, of all the biographies that I read is somebody who really took the situation in hand and kind of took action to achieve an outcome, which I think was an amazing result."}, {"time": 9083, "text": "The fascinating thing, by the way, is, or amazing way of looking at things."}, {"time": 9088, "text": "The fascinating thing, by the way, is that the ferries now in New York Harbor are all run as a public good."}, {"time": 9096, "text": "So the fascinating thing is that the guy, he focused on an industry and he worked on something that was so important that it ended up becoming a public good."}, {"time": 9104, "text": "And I think that that's an interesting conception of how to look at this industry."}, {"time": 9111, "text": "I think there's a lot of economics dynamics around this industry, but I think I might've said this somewhere else before, but really the success of someone in this industry is whether they're able to make a Linux or HTTP or an HTTPS like system that lives on for a very long time and is essentially a kind of public good."}, {"time": 9134, "text": "It's a success of an idea, even if that idea is originally sort of a capitalist idea above that's grounded in financial benefit."}, {"time": 9143, "text": "Success of it is if it becomes a public good."}, {"time": 9146, "text": "It is so universal."}, {"time": 9147, "text": "It is so fundamental to the quality of life that it's a public good."}, {"time": 9152, "text": "It is deemed to be so valuable that it should be a public good."}, {"time": 9158, "text": "I think that's a pretty, a pretty good definition of success that you work on a body of work and that body of work isn't just some commercial enterprise."}, {"time": 9167, "text": "It's a body of work that whatever commercial aspects or economic incentive aspects it might have, it eventually is so important that it becomes critical to how society functions."}, {"time": 9180, "text": "I'm personally quite lucky and grateful to be, in my opinion, working on something like that with an amazing team and an amazing community that seems to really very much care about this hybrid smart contract transparent world that a lot of people on our industry, realistically, I think this is why a lot of them signed up."}, {"time": 9203, "text": "This is why I came into our industry."}, {"time": 9205, "text": "It wasn't because Bitcoin, it was because Bitcoin was a picture of how the world could work in so many other ways."}, {"time": 9214, "text": "And that picture of how the world could work in so many other ways attracted me a very long time ago."}, {"time": 9222, "text": "And I think that all of this stuff will eventually become a public good."}, {"time": 9229, "text": "I think it will become so critical to how societies function internally and internationally that just like there are systems, like the Federal Reserve, like global payment systems, like all these types of things, I think eventually all of this technology will be baked into these societally critical systems."}, {"time": 9248, "text": "And if I, in our community and the people I work with and the body of work that we're working on can make some kind of contribution to that shift towards a fairer, economically fair, transparent society, from my point of view, it's a very worthwhile body of work."}, {"time": 9267, "text": "In terms of the show, you also mentioned the show, one of the shows that I really seem to like more and more for some reason is Star Trek, not the old Star Trek."}, {"time": 9277, "text": "I don't really get the old Star Trek."}, {"time": 9279, "text": "The special effects aren't good enough."}, {"time": 9281, "text": "Star Trek, like The Next Generation and Voyager and Deep Space Nine and all those."}, {"time": 9287, "text": "I think whenever I happen to watch a Star Trek show again, I have a very simple conception in my mind that I really didn't have whenever I saw it way back when."}, {"time": 9297, "text": "It's that I'm not a fan of Star Trek."}, {"time": 9300, "text": "It's that this is what the world looks like if technology takes us towards a utopia, right?"}, {"time": 9306, "text": "So I think there's this fascinating thing where technology can take us towards a utopia or towards a dystopia."}, {"time": 9313, "text": "And in my mind, those kind of three Star Trek shows are a picture of what human civilization looks like if everybody's technological ambitions successfully take us towards a utopia, right?"}, {"time": 9328, "text": "Because in the Star Trek universe, you're not seeking money or you're not seeking safety or you're not really seeking anything for yourself."}, {"time": 9338, "text": "Everybody within Maslow's hierarchy of needs has gotten so many things for themselves that their goal is learning and discovering and or helping."}, {"time": 9349, "text": "And I think there is this conception of human life once the baser needs are satisfied."}, {"time": 9356, "text": "And at the end of the day, I think that's what technology generally can elevate all of human civilization to, right?"}, {"time": 9364, "text": "It can elevate us to Star Trek world where if people want to invent, they can do that all day and nothing else."}, {"time": 9371, "text": "If people wanna explore the stars, they can explore the stars and they don't have to worry about economic scarcity or any number of these other conceptions."}, {"time": 9381, "text": "So I don't know what the most impactful on me shows have been but for some reason recently Star Trek in the newer variant, not the most new Star Trek shows."}, {"time": 9392, "text": "Those shows are a little strange."}, {"time": 9393, "text": "The kind of middle Star Trek universe where everybody is doing something with like a very important purpose and nobody's thinking about like, where's my paycheck or where's my whatever."}, {"time": 9406, "text": "They're all kind of like, we have to discover the formula to this to save the planet over there."}, {"time": 9412, "text": "And literally every episode you're discovering a formula to save a planet, right?"}, {"time": 9415, "text": "Of some kind or a universe or ecosystem or whatever."}, {"time": 9418, "text": "And you're looking at it, you're like, you know, this is like, this is a pretty good place to end up."}, {"time": 9423, "text": "This is where we might wanna end up."}, {"time": 9425, "text": "So it gives you hope."}, {"time": 9426, "text": "I mean, it's funny that we don't often think about the, I think it's very useful to think about positive visions of the future when we're trying to design technology."}, {"time": 9440, "text": "There's a lot of sort of in public discourse, a lot of people are thinking about kind of how everything goes wrong."}, {"time": 9449, "text": "It's important to think about that sometimes, but in moderation, I think, because there's not enough in my little corner of artificial intelligence world, people are very kind of fear monger centered."}, {"time": 9462, "text": "There's a lot of discussions about how everything goes wrong."}, {"time": 9466, "text": "Important to do, but it's also really important to talk about how things can go right, because we ultimately want to guide the design of the systems we create to make things right."}, {"time": 9478, "text": "And I think with hope and optimism, not naiveness, but optimism, you can actually create a better world."}, {"time": 9488, "text": "Like you have to think about a positive, a better world as you create, because then you can actually create it."}, {"time": 9496, "text": "Yeah, I'm one of the people that thinks that having an optimistic view of the world is better for design and creativity than having a pessimistic one."}, {"time": 9508, "text": "It's hard to design when you're in fear."}, {"time": 9513, "text": "Do you have advice for young people, speaking of being excited about and hopeful about the future world, do you have advice for young people today in computer science world, in software engineering world, in crypto world, but maybe in any world whatsoever for life, how to pick a career or how to live life in general?"}, {"time": 9538, "text": "I think the thing that young people should do is not any one specific thing for any one specific young person."}, {"time": 9547, "text": "I think what they should do is what they won't be able to do in the later stages of their life."}, {"time": 9554, "text": "And the way, in my opinion, from a framework point of view to think about that is that the amount of obligations and the amount of time that a person has seems to just diminish over time, right?"}, {"time": 9570, "text": "So the amount of free time they have, right?"}, {"time": 9572, "text": "So you start your job, you get a bunch of responsibilities, something with your partner or spouse, more responsibilities, kids, probably even more responsibilities, and soon enough, the time that you have to educate yourself, to travel, to experience the world however, create whatever creative endeavor you're interested in, slowly but surely disappears."}, {"time": 9595, "text": "I think this is something that young people don't fully realize."}, {"time": 9601, "text": "They assume that the world as it is now and the amount of free time that they have to travel, to educate themselves, to make new friends, to do all these things, will somehow maybe diminish by 10%."}, {"time": 9616, "text": "It won't diminish by 10%, it will diminish by 90%."}, {"time": 9620, "text": "And the 10% that you have, you'll be resting to get back to work and get things done."}, {"time": 9627, "text": "So what I think young people should do, and this is why it's very different for each of them, right?"}, {"time": 9632, "text": "I can't tell young people, hey, you should study philosophy, travel, and start your own enterprise to achieve something worthwhile in the world, right?"}, {"time": 9639, "text": "That might be something that's good for me with my values and my kind of worldview, but for other people might be something else."}, {"time": 9647, "text": "I think the way that they should conceptualize it is imagine if over the next 10, 12 years, the amount of choice that you had about what you could do was cut down by 90%."}, {"time": 9665, "text": "What would you, and this is copying from this kind of Jeff Bezos regret minimization framework."}, {"time": 9671, "text": "In that framework, it's like, what would I regret not doing at 80?"}, {"time": 9676, "text": "And that's kind of meant to create this longterm view and make these decisions now that'll get you to a longterm future that you can look back on and be proud of your life, right?"}, {"time": 9686, "text": "What I think young people should do is they should say to themselves, look, if I never get the chance to travel for as long as I live, assuming that after 25, after 27, after 29, that's the case, how will I feel about that?"}, {"time": 9703, "text": "If I never get to start a company after 25, after I get married, after I have kids, how will I feel about that?"}, {"time": 9710, "text": "And whatever they feel the worst about is what they should do."}, {"time": 9714, "text": "Whatever they feel like when they say to themselves, you know, if I don't travel now, I will never travel."}, {"time": 9721, "text": "And they feel horrible about that."}, {"time": 9722, "text": "They just have an overwhelming fear and disgust at themselves in that type of state at 25, 27, 29, that's what they should do."}, {"time": 9734, "text": "And they shouldn't listen to anybody else."}, {"time": 9739, "text": "Let me put it to you this way."}, {"time": 9740, "text": "If you're really smart, you're gonna make it anyway."}, {"time": 9744, "text": "There's a lot of people putting a lot of pressure on you because they're afraid whether you're gonna make it."}, {"time": 9751, "text": "If you're not really smart, you're screwed anyway."}, {"time": 9753, "text": "So at the end of the day."}, {"time": 9756, "text": "Either way, just relax with it and use your time well to do the things you would most regret not doing."}, {"time": 9764, "text": "I wouldn't say relax."}, {"time": 9766, "text": "I would say very much cherish the free time, the discretionary time that you have from the age of 18 to maybe 25."}, {"time": 9776, "text": "Because at 25, everyone's gonna start looking at each other and asking, what have I achieved?"}, {"time": 9782, "text": "Like my friends have achieved, I haven't achieved."}, {"time": 9784, "text": "And then by the time you get to 30, you're gonna look at each other again and go, well, my friends have a family or a company or a PhD or a whatever, what do I have?"}, {"time": 9794, "text": "And the pressure will just increase."}, {"time": 9796, "text": "And it'll increase so much that even if you want to go and do the fun thing, it will not be fun."}, {"time": 9802, "text": "Because the pressure of comparing yourself to your friends at 25 or your peers at 30 will be so great that it will no longer be normal for you to be in a hostel at 30, kind of like living it up."}, {"time": 9820, "text": "And this is why I also can't tell you specifically what it is."}, {"time": 9823, "text": "For me, it was getting an education in philosophy that was rigorous and in depth."}, {"time": 9827, "text": "It was traveling and it was starting an enterprise that I thought that was worthwhile, that I directed, that I could make into something great."}, {"time": 9834, "text": "That's what it was for me."}, {"time": 9835, "text": "For other people, it might be something with a band, it might be something with painting, it might be an education."}, {"time": 9842, "text": "You, by the way, also should not assume that your ability to get an education will improve."}, {"time": 9849, "text": "All of those responsibilities will take away your ability to get an education."}, {"time": 9855, "text": "So if you value having an education, if you value being a deeply educated, well rounded person with a wide array of knowledge on a wide array of topics, capitalism will force you to specialize."}, {"time": 9867, "text": "That's what it's good at, it's gonna take you, it's gonna fashion you into a very specific tool for a very, most people, into a very specific set of tasks."}, {"time": 9876, "text": "If you want to have an education in something, get it now."}, {"time": 9880, "text": "If you wanna travel somewhere, travel there now."}, {"time": 9883, "text": "If you wanna do some kind of creative endeavor that you doubt whether you'll have time for in the future, do it now."}, {"time": 9889, "text": "You won't have time for it in the future, you won't have time to read philosophy books all day, unfortunately, you won't have time to fly to Italy and kind of hang out with people."}, {"time": 9902, "text": "If you're serious about your life, you're gonna get more responsibilities, you're gonna get more stuff to do."}, {"time": 9907, "text": "And so my advice to you is do not piss away this rare, unique, discretionary time."}, {"time": 9914, "text": "And if your friends are, get new friends."}, {"time": 9918, "text": "Get smarter friends, get people who are using the limited time they have better."}, {"time": 9925, "text": "So it's just a quickly comment, it's brilliant."}, {"time": 9929, "text": "You know, to reframe high school and undergraduate college education, sometimes people wanna quickly get it over with."}, {"time": 9937, "text": "But one thing I remember thinking, and it's very true about high school, is one of the only times in your life you'll get a chance to truly get a broad education."}, {"time": 9951, "text": "You don't often think of it that way, but it's a chance to really enjoy learning things that are outside of the specialty that you'll eventually end up with."}, {"time": 9960, "text": "And that's how college education is."}, {"time": 9962, "text": "And on a more fun side, I played music, I did martial arts, and we offline mentioned played video games."}, {"time": 9970, "text": "I find it fascinating and brilliant what you said, which is the world will not give you a chance to truly enjoy many of these things and truly get value from many of those things once you get older."}, {"time": 9985, "text": "I find it exceptionally difficult to enjoy video games now."}, {"time": 9989, "text": "There's so much stuff to do, there's so much responsibility."}, {"time": 9992, "text": "And I, at the time when I played Elder Scrolls and Baldur's Gate and Diablo II, and at the time I thought maybe that was a waste of time."}, {"time": 10005, "text": "But now looking back, I realize, because I always thought, let me get the career first and then I'll have a chance to play video games."}, {"time": 10014, "text": "That's the way I was thinking."}, {"time": 10015, "text": "It was a waste of time because I should really progress on the career and then I'll have time to play video games."}, {"time": 10023, "text": "No, the reality is that was really fulfilling."}, {"time": 10026, "text": "Those are some of the happiest travel experiences of my life is me traveling to those virtual worlds and spending time in them."}, {"time": 10035, "text": "And it was really fulfilling and they stayed with me for the rest of my life."}, {"time": 10039, "text": "And I get to experience echoes of that when I play video games these days for an hour here, an hour there, like one hour a month or something like that."}, {"time": 10047, "text": "But even those experiences, as silly as they are, they seem like a waste of time at the time, enjoying them fully, unapologetically."}, {"time": 10057, "text": "And in a framework exactly as you said, would I regret being the kind of person who've never played those video games?"}, {"time": 10066, "text": "And I can, for myself, honestly say that yes."}, {"time": 10070, "text": "Look, when I'm on my death bed, I'm glad I built Baldur's Gate 2 and all those arena, Daggerfall, Morrowind and all the Elder Scrolls games."}, {"time": 10083, "text": "And yeah, the things that don't necessarily fit into this kind of storyline of what a career is supposed to be, travel and all those experiences that you mentioned."}, {"time": 10096, "text": "I think I'd just like to say one final quick thing on this."}, {"time": 10101, "text": "I think this extends to really hard things as well."}, {"time": 10104, "text": "It extends to the things you wanna do, but one of the best pieces of advice one of my mentors gave me early on in my career around this time is that it will actually become harder to start a company as you get older."}, {"time": 10118, "text": "Once again, because you have more responsibilities, you're responsible to your partner for some kind of income to create a life together."}, {"time": 10125, "text": "Once you have kids, you're responsible for an even greater income to create a life for kids."}, {"time": 10130, "text": "And startups do not generate income, right?"}, {"time": 10133, "text": "They take many, many years before anything happens."}, {"time": 10136, "text": "People are getting evicted, people are eating ramen noodles."}, {"time": 10139, "text": "That is a thing, that happens, that will happen."}, {"time": 10142, "text": "So I'm not saying that you should do the fun things or the enjoyable things."}, {"time": 10147, "text": "I'm saying the things that you would regret not doing, that you can uniquely do in the time span from 18 to 25."}, {"time": 10158, "text": "Which one of which is, if you plan to have a family and start a family when you're 25, you should start a company now."}, {"time": 10166, "text": "You should not wait until a bunch of people depend on you for income to eat, to start a company."}, {"time": 10172, "text": "The amount of pressure that will be on you at that point will be monumental."}, {"time": 10176, "text": "You should start a company when nobody depends on you and you can sleep on the floor eating ramen noodles and still have a great time and show up with a lot of enthusiasm and be excited."}, {"time": 10187, "text": "So I just mean whatever you want to really devote yourself to and really do, don't put it off."}, {"time": 10196, "text": "Don't go to consulting or banking or any other industry and say, I'm gonna do this for three years and I'll get experience."}, {"time": 10202, "text": "The only way you get experience is by doing something."}, {"time": 10204, "text": "You go, you do it, you fail, you do it again and again and again and again and again and then you have experience and then you can do it right."}, {"time": 10210, "text": "That's the only way experience happens."}, {"time": 10212, "text": "There is no other way short of mentorship."}, {"time": 10214, "text": "If you're lucky to get mentorship, 99% of people don't get mentorship."}, {"time": 10218, "text": "And even though we're talking about young people, I feel like you're speaking to me as somebody who spent the last two weeks sleeping on the floor because there's no mattress and somebody who is single and somebody who's thinking about doing a startup, I felt like you're speaking to me as a fellow young person."}, {"time": 10234, "text": "Let me ask you about this whole life of ours to zoom out on the big philosophical question, the ridiculous question."}, {"time": 10247, "text": "Do you think about this kind of stuff as you're creating all the technology, as you're thinking about this future?"}, {"time": 10254, "text": "You ever zoom out and think like, why?"}, {"time": 10257, "text": "Why are you surrogate striving?"}, {"time": 10259, "text": "Why are we the human species striving for the stars?"}, {"time": 10265, "text": "So I think it comes down to whether people wanna live in society."}, {"time": 10271, "text": "So if people decide to be part of society, they have a certain set of conditions that they decide to take part in, right?"}, {"time": 10283, "text": "So I think what this comes down to is a lot of really involved conversations."}, {"time": 10290, "text": "But if we assume people have free will and choice, if we just kind of make that blanket assumption, then the question starts to become, well, what choices do we make?"}, {"time": 10299, "text": "And how do we live with those choices?"}, {"time": 10301, "text": "And I think probably the most fundamental choice is whether we exist in a society or we choose to leave society."}, {"time": 10309, "text": "And there are people that do this."}, {"time": 10310, "text": "There are people that go live in the woods."}, {"time": 10312, "text": "There are people that immigrate to other societies and they make a choice, right?"}, {"time": 10316, "text": "And as they enter those other societies or they choose to leave society and go live in the woods, they adopt a certain set of values, right?"}, {"time": 10325, "text": "They adopt values that the society prescribes, they compromise their own values, they define their own values, and they create a set of values for themselves, right?"}, {"time": 10334, "text": "I think at the end of the day, if you're going to choose to live in society, in addition to all the minimums of not throwing garbage on the floor and doing nice things for people that need help and doing any number of things to just be a normal human being within society, you have to ask yourself, what am I doing as part of society, right?"}, {"time": 10359, "text": "You can always say, hey, I'm going to leave society."}, {"time": 10362, "text": "I'm going to live in the woods."}, {"time": 10363, "text": "I did that, right?"}, {"time": 10364, "text": "I went and I lived in the woods and I gave it a shot, realized a ton of stuff, huge amount of clarity from that."}, {"time": 10369, "text": "But when you decide to live in society, you take on, first of all, certain minimal agreements."}, {"time": 10377, "text": "You mold your values a little bit to that society."}, {"time": 10381, "text": "That's another choice that people inherently make."}, {"time": 10383, "text": "And then there's a question of, well, what am I doing here, right?"}, {"time": 10388, "text": "What am I doing in society, right?"}, {"time": 10391, "text": "So when people say the meaning of life, I don't know what the meaning of life is."}, {"time": 10394, "text": "It's the meaning of life in society."}, {"time": 10396, "text": "Right, what's the meaning of life for the choice that you've made within society, right?"}, {"time": 10400, "text": "Because that's maybe the first fundamental choice you made."}, {"time": 10403, "text": "You made a choice and you continue to make a choice to be part of society and a specific society, right?"}, {"time": 10410, "text": "So you've made this choice."}, {"time": 10412, "text": "You're part of a society."}, {"time": 10414, "text": "And now you kind of have a life and you have people around you."}, {"time": 10421, "text": "And then the question is, in my opinion, the question is, what is the body of work that you want to make, right?"}, {"time": 10430, "text": "I think, personally, that life is kind of so short."}, {"time": 10435, "text": "And the ability to get enough resources for yourself in at least the developed markets where we're lucky to be in is so relatively abundant that we, you and me, have the luxury, by your pursuit of a PhD, you've had this luxury, I've had this luxury through the work that I've been doing, to pursue something that makes society better."}, {"time": 10459, "text": "So this is kind of the question, I would say."}, {"time": 10465, "text": "The question is, am I going to live in society, yes or no?"}, {"time": 10468, "text": "Yes, OK."}, {"time": 10468, "text": "Most people choose yes."}, {"time": 10470, "text": "I understand why, to a degree."}, {"time": 10471, "text": "I understand why some people choose no."}, {"time": 10473, "text": "And then what is the but?"}, {"time": 10475, "text": "And I'm going to be in society."}, {"time": 10477, "text": "If you choose to be in society, you're just choosing to abide by the rules."}, {"time": 10480, "text": "You're choosing to just do the minimum, right?"}, {"time": 10482, "text": "That's what being part of society means."}, {"time": 10484, "text": "People that choose to be part of society but don't want to do this, it's very confusing."}, {"time": 10487, "text": "They should just leave."}, {"time": 10488, "text": "They should just go, look, I don't like this deal."}, {"time": 10491, "text": "I'm going to go somewhere else."}, {"time": 10492, "text": "I'm going to live in Tibet."}, {"time": 10495, "text": "I'm going to live wherever the rules are to my liking, right?"}, {"time": 10500, "text": "You've chosen to be in society."}, {"time": 10502, "text": "Next question, kind of final question, is what is the body of work that I'm going to be involved in?"}, {"time": 10507, "text": "Because in looking at that Jeff Bezos kind of regret minimization framework thing, I think that's what a lot of it really comes down to, is you kind of, the framework is at 80 years old, you look back over your life, what would you regret not doing?"}, {"time": 10519, "text": "What would you regret not pursuing?"}, {"time": 10523, "text": "I think there are a number of things on a personal level each person has, but I think, at least for me, and probably for many of the other people I know, there's a question of what is the body of work that I was involved in?"}, {"time": 10537, "text": "What did I do?"}, {"time": 10538, "text": "What happened, right?"}, {"time": 10540, "text": "What was I involved in?"}, {"time": 10542, "text": "And in my opinion, you should have a good answer to that."}, {"time": 10547, "text": "You mentioned the body of work in relation to whether it helped make a better world."}]}]