[{"title": "Anya Fernald: Regenerative Farming and the Art of Cooking Meat | Lex Fridman Podcast #203", "id": "ew8U43IXTfk", "quotes": [{"time": 310, "text": "We're extracting resources, calories, energy from the environment in various ways in order to preserve our bodies."}, {"time": 319, "text": "There's also so many feedback loops that I don't think we know the beginning of that our bodies are picking up on around nutrients, available nutrients, immune response."}, {"time": 329, "text": "Like there's deep levels of sensory evaluation that lead to health and alertness and wellness."}, {"time": 361, "text": "That said, the final product of cooking is, when done well, is really delicious."}, {"time": 368, "text": "And what we ate yesterday was really delicious."}, {"time": 370, "text": "So that aspect of it, bringing the ingredients together in a way that tastes delicious, do you see that as a science or art?"}, {"time": 379, "text": "That's the art of it."}, {"time": 381, "text": "I mean, the art is like creating temptation and indulgence and giving people pause, you know, like creating experience that's like so sensual."}, {"time": 389, "text": "And like, I love that about when I make something really simple and beautiful and delicious the way that, like there's that moment of silence at the table."}, {"time": 399, "text": "And that to me is the moment of art, like appreciation."}, {"time": 403, "text": "What about the buildup?"}, {"time": 404, "text": "I mean, we got to watch you make the stuff over a fire."}, {"time": 408, "text": "So the calmness of the air, I mean, that's an experience."}, {"time": 411, "text": "We don't often get to see that experience of the preparation."}, {"time": 414, "text": "It's the anticipation, like you said."}, {"time": 416, "text": "Maybe that's the most delicious part of a meal is the anticipation of it."}, {"time": 419, "text": "That's something that I'm glad you bring up because it's an element that with eating so many of our meals, like out of a bag and you know, the instance where you start to eat the meals when the delivery shows up and you might smell something when you open the bag, right?"}, {"time": 433, "text": "And no judgment on that."}, {"time": 434, "text": "That's something I do too, right?"}, {"time": 436, "text": "But that does take away a whole element of surprise and delight."}, {"time": 440, "text": "And also I think of your body's ability to prepare for it."}, {"time": 443, "text": "You know, you think about our most common memories of childhood for those of us who grew up in homes with parents who cooked is smell of things cooking."}, {"time": 451, "text": "And it's not the eating of it."}, {"time": 453, "text": "It's the smell of things cooking."}, {"time": 455, "text": "So why is that so memorable?"}, {"time": 457, "text": "It's an anticipatory piece of food."}, {"time": 460, "text": "That's what you remember about your experiences of food is the moment of like sweet anticipation of this great sensual experience."}, {"time": 466, "text": "It's gonna be really gratifying on these emotional and physical levels."}, {"time": 469, "text": "So I think we're also resonating on those memories because it's like, it's an experience of food where the sensuality of it is kind of extended."}, {"time": 478, "text": "So it's a long kind of arc of buildup and then you're eating it and it's amazing."}, {"time": 481, "text": "Then you're enjoying it and your body feels good."}, {"time": 483, "text": "So all those pieces together, it's a much more memorable experience than just grabbing the cookie out of a bag, right?"}, {"time": 488, "text": "So look at our own and just revisit in your mind like the memories of food, the most compelling ones."}, {"time": 495, "text": "It's the smell and then the experience and then sometimes how one felt, right?"}, {"time": 500, "text": "Yeah, and the people involved with the smell."}, {"time": 502, "text": "So like somehow it's all tied in together whether it's family or people close to you or even if it's just chefs."}, {"time": 508, "text": "There's something about the personality of the human involved in making the food that kind of sticks with you in the memory."}, {"time": 515, "text": "And for me, I recently did a 72 hour fast and there's a kind of sadness after you eat that it's over."}, {"time": 523, "text": "I think the most delicious part was the, I went to the grocery store and just actually walking around and looking at food with like everything looked delicious."}, {"time": 532, "text": "Even like the crappiest stuff looked delicious and I missed that."}, {"time": 535, "text": "I really enjoyed that anticipation and then I picked out the meal."}, {"time": 539, "text": "I went home and I cooked it and the whole thing took, I don't know, maybe two, three hours, like the whole process."}, {"time": 545, "text": "And that was the most delicious part and the first taste of course."}, {"time": 548, "text": "And then after it was over, there's a bit of a sadness because the part I remember is the buildup, the anticipation and then once you eat, it's over."}, {"time": 560, "text": "We kind of focus on the destination but it's the whole journey."}, {"time": 563, "text": "The whole like, even if you go to a restaurant, it's the conversations leading up to the meal and the first taste of the meal."}, {"time": 570, "text": "That's where the joy is."}, {"time": 572, "text": "And if you get to watch the making of that meal, that's incredible."}, {"time": 613, "text": "I don't know, yeah, that experience is magical."}, {"time": 615, "text": "It's, and of course, maybe it's the Russian thing but I'm almost like saddened when it's over."}, {"time": 620, "text": "I think fasting is gaining in popularity because we're having to relearn the importance of being hungry in anticipation and delight."}, {"time": 631, "text": "We have such a fear of hunger and that's really functional in evolution, right?"}, {"time": 637, "text": "But we have this deep fear of hunger and part of the great American experience has been that we don't have to be afraid of hunger at all because there's food everywhere and it's really cheap."}, {"time": 647, "text": "In all that abundance, we've lost this edge of hunger and we don't let ourselves get hungry."}, {"time": 654, "text": "And that's one thing that I learned in part of my journey as a cook and chef has been, you know, moving abroad was the first time when I lived out of the US, was the first time that I regularly experienced hunger because the time between meals was really long and that was just what everybody did."}, {"time": 672, "text": "And so I was hungry for two hours before lunch."}, {"time": 674, "text": "And that was the first time in my life that there hadn't just been readily available snacks."}, {"time": 679, "text": "So I wonder if the intermittent fasting and part of the popularity around it, I'm sure there's all these amazing metabolic things that are happening, but also people might also feel better because they're really anticipating and enjoying food."}, {"time": 692, "text": "And then if you look at the feelings of fullness, there's a really interesting thing that happens when you cook and your sense of fullness, which is if you cook and you're hungry, the experience of being around the food, smelling it, touching it, sampling it, you'll take your hunger down by 40%."}, {"time": 713, "text": "And this is my own observation."}, {"time": 715, "text": "But as, I mean, we've all had the experience of cooking Thanksgiving and the cook never kind of wants to eat that much Thanksgiving."}, {"time": 721, "text": "That's an extreme experience."}, {"time": 722, "text": "But when you really dive in and you're cooking for a few hours and you're smelling and smelling and smelling, it totally changes your threshold of satiety and fullness because of other sensory things that are happening."}, {"time": 735, "text": "And for those of us looking to maintain weight and something to consider in this is that cooking is also part of what your appetite, when you're hungry, what are you hungry for, right?"}, {"time": 747, "text": "So we tend to think about calories, but when you're hungry, you might also be hungrier for a wider range of things."}, {"time": 753, "text": "And it might be smells, it might be stopping."}, {"time": 756, "text": "There's other elements and that's something, I think as a cook, that it's powerful to explore and be with and observe how your hunger changes when you're cooking."}, {"time": 767, "text": "Well, let me ask the romantic question."}, {"time": 769, "text": "When did you first fall in love with cooking?"}, {"time": 773, "text": "Me falling in love with cooking was about solving a problem in my family."}, {"time": 778, "text": "And it had to do with my mom feeling very anxious about cooking and overwhelmed frequently when it came to meals."}, {"time": 789, "text": "And I'm naturally very good at juggling a lot of things."}, {"time": 793, "text": "And it was just something I could dive in and help and help my dad, who I'm very, very close to."}, {"time": 801, "text": "So it was a very functional role where I would see this kind of crescendo of anxiety around meal times as a kid and would be able to dive in and solve things."}, {"time": 813, "text": "And I also loved women who cooked."}, {"time": 817, "text": "Like my father's mother was a great cook."}, {"time": 819, "text": "She was, I remember her telling me as a kid, I was asking her about church and why she went to church."}, {"time": 825, "text": "And she's like, I mostly go to church because I get to cook for the potlucks."}, {"time": 830, "text": "And so there was an openness around that, but she just loved to cook for people and there was this real tenderness and expression of that love."}, {"time": 837, "text": "So seeing women in my life who had this real tenderness and love that they shared through food and then also being able in my own home to kind of pitch in and add value and help my mom and dad was really powerful for me."}, {"time": 854, "text": "Cause I felt like I had a superpower."}, {"time": 856, "text": "I felt like, oh man, I just made this stressful thing go away."}, {"time": 860, "text": "That was huge."}, {"time": 862, "text": "I don't know if you can comment on, especially for me growing up in Russia, it's probably true in a lot of cultures, maybe every culture."}, {"time": 870, "text": "That food, and especially like in a family, the mother that cooks is the source of love and like ties the family together."}, {"time": 878, "text": "It creates events where everyone comes together."}, {"time": 881, "text": "It's one of the only chances of togetherness."}, {"time": 885, "text": "The thing that bonds a family is like dinner or food, eating together."}, {"time": 893, "text": "It ties up with like dieting and so on."}, {"time": 895, "text": "When I was on stricter diets, especially competing and cutting weight and stuff, it felt like I was almost like losing opportunity to connect with friends and family."}, {"time": 905, "text": "It's almost like cultures, we cannot fully experience love and family without eating."}, {"time": 912, "text": "And on the flip side of that, eating enables us to experience love and family."}, {"time": 919, "text": "It's a tough one."}, {"time": 920, "text": "Cause there's lots of layers around kind of gender roles and families changing and things."}, {"time": 926, "text": "I'd say I agree around the alienation and I've done carnivore diet and I've tried some of these extreme protocols."}, {"time": 932, "text": "And I too, I suffered from loneliness."}, {"time": 935, "text": "It was like doing carnivore and not being able to eat what my kids ate and talk about it at the same time."}, {"time": 942, "text": "Those pieces are real."}, {"time": 944, "text": "And I wonder with all of these diets, if that structure is actually helping or just taking away from people's kind of sensual understanding."}, {"time": 954, "text": "But I think that there's some rigor around that that helps people discover what's good for them by eliminating and then growing towards more intuitive food is a good evolution from that base."}, {"time": 965, "text": "I love to cook for people."}, {"time": 968, "text": "I love to pay attention to their way of being and read what they'd like to eat."}, {"time": 975, "text": "And it's my purest way of love."}, {"time": 978, "text": "And that's for everybody in my life."}, {"time": 980, "text": "I actually love to cook for people I love."}, {"time": 983, "text": "I would struggle to be putting out food all the time."}, {"time": 987, "text": "It's like something for me, it's a real act of caretaking."}, {"time": 990, "text": "So I definitely have that in my makeup."}, {"time": 993, "text": "And I definitely notice in times of real stress, that's the piece that drops off."}, {"time": 1003, "text": "And it's like, if I'm unable to care for myself, I have a hard time cooking."}, {"time": 1006, "text": "So for me, it's very emotional."}, {"time": 1008, "text": "It's very connected to love."}, {"time": 1011, "text": "And individualistic."}, {"time": 1012, "text": "So like focused on the particular individual."}, {"time": 1015, "text": "It's almost like a journey of understanding what that person is excited about in the landscape of flavors."}, {"time": 1022, "text": "Like figuring that person out, what they like, what they love to eat."}, {"time": 1026, "text": "Yeah, I see cooking from, I mostly cook for myself."}, {"time": 1030, "text": "So I see that as almost, this is gonna be like the worst term, but like an act of self love."}, {"time": 1040, "text": "This is gonna be clipped out."}, {"time": 1041, "text": "But that like, it's almost an exploration of like what brings me joy."}, {"time": 1047, "text": "And it's surprising, because I usually don't share, because the things that bring me joy are the simplest ingredients."}, {"time": 1054, "text": "Like I'm one of those people, I don't know if you can psychoanalyze me, because you also like basic ingredients."}, {"time": 1060, "text": "I like a single ingredient to ingredients, because I feel like I can deeply appreciate the particular ingredient then."}, {"time": 1067, "text": "I get easily distracted."}, {"time": 1069, "text": "You know, people who are really good listening to music, they can hear a piece of music, and in their mind, extract the different layers, and enjoy different layers at a time."}, {"time": 1077, "text": "Like the bass, the drums, the different layering of the piano, the beats, and all that kind of stuff."}, {"time": 1082, "text": "That's what it means to truly enjoy music, to listen to a piece over and over."}, {"time": 1086, "text": "Like almost like as a scholar."}, {"time": 1088, "text": "In that same way for food, I just can't do more than like three, because then it's just, I have to give in to the chaos of it, I guess."}, {"time": 1095, "text": "But when it's just a basic ingredient, like just meat, or just a vegetable, like basic grilled without sauces, without any of that, that I've discovered is what brings me a lot of joy."}, {"time": 1107, "text": "But that's boring to a lot of people."}, {"time": 1110, "text": "So I usually have to be kind of private about that joy."}, {"time": 1113, "text": "So, but that's mine, so yeah, I figured that out."}, {"time": 1116, "text": "I guess as a chef, you have to figure that out about everybody that you care for."}, {"time": 1121, "text": "Well, also for you, you're very interested in things, and interested in things being done well and appreciating them."}, {"time": 1130, "text": "So the single ingredient also allows you to control for perfection in cooking that, which is probably really appealing to you."}, {"time": 1138, "text": "And I think sometimes I see people also in the beginning of their journey of culinary trying to do too many things."}, {"time": 1145, "text": "So there's another piece too, that you'll notice, if you recall last night, I grilled us a salad, and then I did all those pieces separately."}, {"time": 1153, "text": "And that's something in general to be really attentive of when you're building flavor, to make sure you pay attention to every piece separately."}, {"time": 1163, "text": "The idea that you can, okay, with a soup or something or a stew, there's workarounds, but like to make a great dish that's got four or five vegetables in it, cook them all separately to their optimal deliciousness and then combine them."}, {"time": 1176, "text": "So that's another way to approach that, is that you may also be able to look at the different ingredients separately and still have that sense of understanding of it."}, {"time": 1184, "text": "But there's too often that we're layering together like four or five things and then cooking them all at once and then surprise that it's not delicious."}, {"time": 1192, "text": "Cause you can't really optimize on multiple variables at the same time for peak awesomeness."}, {"time": 1198, "text": "And that's actually, the number one way you see this is roasting a whole chicken, which is a really difficult, it's the simplest dish, but it's very difficult because you have the breast meat, which is bigger chunks."}, {"time": 1208, "text": "They cook faster."}, {"time": 1209, "text": "You have the thighs and drums, which are smaller and they cook slower."}, {"time": 1214, "text": "To optimize that and pay attention to it and do it all right, you're actually solving for different outcomes."}, {"time": 1219, "text": "So there's one example, but oftentimes food is less delicious with multiple ingredients at the start because we're not able to pay attention to how each one needs to end up."}, {"time": 1229, "text": "So there's a way to parse that apart and achieve a better outcome."}, {"time": 1233, "text": "I don't know if you've seen Jiro Dreams of Sushi."}, {"time": 1236, "text": "It's a documentary about, yeah."}, {"time": 1239, "text": "So there's an obsession that that particular, first of all, set of humans, but also the particular cuisine that focused on the basics of the ingredients."}, {"time": 1253, "text": "What do you think of that kind of trying to achieve mastery through repeating the making of the same meal over and over and over for like decades?"}, {"time": 1262, "text": "Like, do you find beauty in that journey towards mastery or do you think it should be always an exploration to where you're always trying things, you're always kind of injecting new flavors, new experiences, all that kind of stuff?"}, {"time": 1277, "text": "I think you have to decide on a palette."}, {"time": 1279, "text": "You know, if we're talking about an art, it's equivalent to saying, am I a sculptor or a painter?"}, {"time": 1284, "text": "That, the sushi lexicon thing, that's a very, very narrow, small canvas that you're painting on."}, {"time": 1290, "text": "And that is a beautiful road, right?"}, {"time": 1292, "text": "There's a beauty and a perfection to that."}, {"time": 1294, "text": "It's like, I mean, there's many things culturally around that that you could extrapolate for specifically for Japan."}, {"time": 1300, "text": "But I encourage people on the journey in food to choose like kind of a language that they're working within."}, {"time": 1309, "text": "And if you wanna step out of that occasionally and have one or two dishes, but if you wanna get mastery with food, you probably aren't gonna be able to get more than say, 20 ingredients that you use regularly that you really understand."}, {"time": 1322, "text": "And so we often see, you know, I see the American pantry, it's got tons of sauces and tons of spices and tons of spice blends."}, {"time": 1330, "text": "And then really people only use just a couple of things."}, {"time": 1333, "text": "And the idea that you can sort of splash out and do Korean one night and then tacos the next night, you can absolutely, but to get in a regular cadence of specific ingredients, you're probably gonna get more mastery with that sooner."}, {"time": 1344, "text": "And I think as much as you can do to get an understanding of the basics around salt and acid and understand your palette, like for me, it's lemon and usually sherry vinegar, right?"}, {"time": 1354, "text": "So that's my acid palette."}, {"time": 1355, "text": "And my fat palates, you know, suet and butter, olive oil."}, {"time": 1359, "text": "So you can sort of choose your language, what you're painting with, but I wouldn't splash out and say, do I use sesame oil?"}, {"time": 1364, "text": "Yeah, every once in a while, but that's not part of my base palette, right?"}, {"time": 1368, "text": "Can you say again what your fat palette is?"}, {"time": 1370, "text": "It'd be butter, suet and olive oil."}, {"time": 1373, "text": "And olive oil, so not, why olive oil?"}, {"time": 1376, "text": "Is it your roots in Italy?"}, {"time": 1378, "text": "I like the flavor for finish because of the bitterness that it adds."}, {"time": 1382, "text": "So I like the bitter and acid contrast on meat and vegetables, which is mostly what I eat."}, {"time": 1387, "text": "And so I love that way that the bitterness and astringency complements and allows the flavors to come out."}, {"time": 1394, "text": "What do you think about coconut oil?"}, {"time": 1396, "text": "I recently discovered that there's a, I don't know, there's a sweetness or there's something to it that I really enjoy, maybe because it's new."}, {"time": 1407, "text": "It's good with heat."}, {"time": 1409, "text": "And I really love it for some reason."}, {"time": 1411, "text": "As a chef, do you ever try it?"}, {"time": 1414, "text": "I like it in coffee."}, {"time": 1415, "text": "I like it as a treat a little bit."}, {"time": 1417, "text": "I find the flavor a little bit challenging in foods."}, {"time": 1421, "text": "I also find that it's difficult on the quality of that ingredient."}, {"time": 1428, "text": "So I've found often that I buy a high quality coconut oil and there's rancidity in it."}, {"time": 1433, "text": "And I don't totally know why."}, {"time": 1434, "text": "I think it's just the cold chain and how that product's packaged."}, {"time": 1437, "text": "So I've had some issues with product quality in that."}, {"time": 1440, "text": "But for me, it's a little bit too much sweetness in my foods, but then again, I don't cook in like a Southeast Asian palette."}, {"time": 1447, "text": "I try to not have much sweetness in my foods in general."}, {"time": 1449, "text": "So I, just because of the palette that I like to cook with."}, {"time": 1452, "text": "So for me, coconut's got a little bit too much of those high notes and earthiness, which is a nice combination, but it's more like a treat."}, {"time": 1458, "text": "Yeah, it is almost like a treat."}, {"time": 1459, "text": "It has a flavor of its own that almost stands on its own."}, {"time": 1463, "text": "Like I could probably just eat coconut."}, {"time": 1467, "text": "That's probably the only oil I could enjoy by itself."}, {"time": 1469, "text": "It sounds weird to say, but it feels like fat is often a thing that enriches the flavor of something else."}, {"time": 1475, "text": "Coconut can almost stand on its own."}, {"time": 1477, "text": "You might also be responding to that."}, {"time": 1479, "text": "It's a complex flavor."}, {"time": 1480, "text": "So there's also, there's an analogous, you know, if you look at butter, for example, a lot of the butter that we eat in the US is just sweet cream butter."}, {"time": 1490, "text": "It's not cultured."}, {"time": 1491, "text": "If you explore like a cultured fermented butter, maybe a grass milk, grass fed and finished butter, you're gonna get a ton more complexity."}, {"time": 1500, "text": "And so you may also just be responding to having fats with more flavor, which is the journey in the US has been towards refined foods that are very neutral."}, {"time": 1512, "text": "And then you have to combine more of them to make things taste like things."}, {"time": 1517, "text": "And so if you're coming from a background of using mostly just generic butter or let's say canola oil to cook with, those are very neutral oils."}, {"time": 1525, "text": "So you can also take some of your favorite fats and look for versions of them that are more flavorful."}, {"time": 1530, "text": "I mean, I love olive oil as a treat in a spoon."}, {"time": 1534, "text": "Like a good California extra virgin olive oil."}, {"time": 1535, "text": "I'll just like have it as, I'll eat a piece of butter as a treat."}, {"time": 1538, "text": "That's like, or butter with salt on it."}, {"time": 1540, "text": "Like good fats can, all of them can be, if they're minimally processed and they're fabulous and it's so delicious, right?"}, {"time": 1547, "text": "But there are things that you have to like look for a version of them that's got that full palette of flavor."}, {"time": 1553, "text": "Well, for me also the flavors are inextricably tied to the memories I've had with those flavors."}, {"time": 1558, "text": "So for better or worse, back when I used to eat a lot of ice cream, I for some reason had a lot of pleasant experience with coconut ice cream."}, {"time": 1567, "text": "So that particular flavor just permeates throughout my life now."}, {"time": 1571, "text": "Like I'm stuck with it for better or worse as a flavor that brings up pleasant memories."}, {"time": 1577, "text": "And as I have a few such flavors, I have such relationship with all kinds of meat too."}, {"time": 1582, "text": "Like it's just so many pleasant memories and that's it."}, {"time": 1586, "text": "Like you're almost tasting the memories."}, {"time": 1588, "text": "And that there's no way to separate the flavor from the memories, I suppose."}, {"time": 1594, "text": "And that's a powerful thing."}, {"time": 1595, "text": "What's your favorite meal to cook?"}, {"time": 1599, "text": "I'll roast a couple of chickens and then I'll poach them, like I'll boil them and let it cool down."}, {"time": 1605, "text": "It's a complicated one."}, {"time": 1607, "text": "I'll let them cool down."}, {"time": 1608, "text": "I'll pull all the meat off, put the bones back into the pot and then cook that for like three or four hours and then add in like shiitake mushrooms and all the chicken meat."}, {"time": 1618, "text": "And I'll throw in a bottle of white wine into the stock as well, a bunch of thyme and garlic."}, {"time": 1624, "text": "And I love it because it's the way the house smells."}, {"time": 1629, "text": "It's very laborious."}, {"time": 1630, "text": "It's soothing for me to spend time picking apart meat and chopping things up."}, {"time": 1634, "text": "There's like a lot of manuality around it."}, {"time": 1637, "text": "So I'd say from a personal, like, I mean, I love grilling a steak and doing those things as well, but there's something about making a stock from scratch and the way it smells, the way I feel, the time it takes, the kind of checking in on it that I really, really love."}, {"time": 1651, "text": "There's many things I love to make that I don't even love to eat."}, {"time": 1655, "text": "I think you see this a lot in like baking and bakers, people who bake a ton and they love the process of it, even if they don't eat that many baked goods."}, {"time": 1662, "text": "So anything for me that's really like enjoyable is typically things like making cinnamon buns."}, {"time": 1667, "text": "I don't eat very many cinnamon buns, but I love making them because it takes all the sort of like futzing around and taking your time and watching it and the way it smells, the way the house smells."}, {"time": 1676, "text": "All of that stuff is like, it's like almost like a meditative exercise for me."}, {"time": 1681, "text": "Is there a science, is there an art to cooking meat well and the different kinds of meats?"}, {"time": 1685, "text": "Is there something you can convert it towards in to say ideas, how to bring out the best of it out of what particular meat, whatever steak we're talking about, whatever beef we're talking about?"}, {"time": 1700, "text": "Is there something that can be said?"}, {"time": 1701, "text": "The basic approach to cooking any type of meat beyond the artistry of it is pretty scientific."}, {"time": 1710, "text": "And it's what type of muscle is it in the animal and what's the surface area to volume ratio?"}, {"time": 1718, "text": "Okay, so let's look at those two questions."}, {"time": 1720, "text": "So the first piece is what's the type of muscle in the animal?"}, {"time": 1724, "text": "What's the functionality?"}, {"time": 1726, "text": "You don't necessarily need to know that to evaluate it, but you need to understand, is it a tender muscle that's not used very frequently in the animal?"}, {"time": 1733, "text": "Or is it a big load bearing muscle that gets a lot of action, like the cheek, right?"}, {"time": 1737, "text": "Or the shin or those pieces?"}, {"time": 1740, "text": "The muscles like those along the spinal cord that make up rib eyes and New York steaks and things, those aren't very exercised."}, {"time": 1748, "text": "They're right next to the spinal cord."}, {"time": 1750, "text": "Spinal cord's doing most of the work there."}, {"time": 1751, "text": "They're kind of like stabilizing muscles around this big functional piece of skeletal structure in the animal."}, {"time": 1759, "text": "Other muscles, like the ones around the diaphragm with the flat iron steaks and skirt steaks and things, those are really functional muscles that are doing a ton and moving."}, {"time": 1767, "text": "And if they're moving a lot, what happens?"}, {"time": 1770, "text": "Well, functionally, they've got lots of muscle sheaths because muscles that move frequently have to do a lot of like complex contraction."}, {"time": 1779, "text": "That's why there's, in the cheek, for example, there's tons of visible fiber of like collagenous connective tissue."}, {"time": 1787, "text": "That connective tissue is everything in how the meat cooks because connective tissue doesn't respond to high heat with becoming more tender."}, {"time": 1798, "text": "Muscles do, right?"}, {"time": 1799, "text": "They can get a sear on them."}, {"time": 1800, "text": "You can cut them and eat them."}, {"time": 1801, "text": "The collagenous tissue will glom up and get really tough."}, {"time": 1804, "text": "So you either have to liquefy it with really low, slow heat with moisture, right?"}, {"time": 1810, "text": "Or you have to barely cook it."}, {"time": 1812, "text": "And so that's the major piece."}, {"time": 1815, "text": "So that's the question of like, why wouldn't you just throw a brisket on the grill?"}, {"time": 1819, "text": "It's not about the fat."}, {"time": 1819, "text": "You can cut the fat out."}, {"time": 1820, "text": "The reason you're not gonna throw a brisket on the grill and cook it hot and fast is it's got too much collagenous connective tissue in it."}, {"time": 1825, "text": "Those are these giant muscles that have all this collagen and these fibers and tendons in them effectively."}, {"time": 1831, "text": "So you're never gonna be able to just cook that up hot and fast."}, {"time": 1835, "text": "So that's the first piece."}, {"time": 1836, "text": "It's like, where's this muscle in the architecture of the animal?"}, {"time": 1839, "text": "And then what does that mean for what's going on in the muscle?"}, {"time": 1843, "text": "And that's actually more important than fat content."}, {"time": 1846, "text": "We get really kind of, we pay a lot of attention to fat content in muscles."}, {"time": 1850, "text": "You can make a steak tender if it doesn't have a ton of fat in it."}, {"time": 1853, "text": "It actually has more to do if there's collagenous and connective tissue in it."}, {"time": 1858, "text": "I never even thought about that."}, {"time": 1859, "text": "I just, I thought it kind of universal."}, {"time": 1864, "text": "I mean, it adds to the texture of the meat, the chewiness of the meat."}, {"time": 1868, "text": "But you're saying it's also adds to how the meat is cooked."}, {"time": 1872, "text": "How heat, how it reacts to heat, how the entirety of the meat reacts to heat."}, {"time": 1877, "text": "And the fat is not as important to that as the collagen."}, {"time": 1880, "text": "The fat will make the flavor more delicious, right?"}, {"time": 1883, "text": "Like it'll add unctuousness and mouthfeel and things like that."}, {"time": 1886, "text": "But all the connective tissue in meat and in some of the cuts, like that we ate at a skirt steak last night, you could see a web of that collagen sheath on the outside."}, {"time": 1895, "text": "On a ribeye, that same collagen sheath is this big."}, {"time": 1897, "text": "There's only one."}, {"time": 1898, "text": "It goes around the outside, okay?"}, {"time": 1899, "text": "Cause it's just that muscle, there's one large muscle fiber."}, {"time": 1902, "text": "So that specific, it's a myelin sheath, right?"}, {"time": 1906, "text": "That material needs moisture and low and slow heat to become tender."}, {"time": 1911, "text": "The other side of that is that when it becomes tender, it liquefies and it adds all this beautiful gelatinous consistency."}, {"time": 1918, "text": "That's what bone broth is."}, {"time": 1919, "text": "That's why like a slow cooked pork shoulder is so delicious."}, {"time": 1923, "text": "It's not that it's full of all that fat."}, {"time": 1925, "text": "That fat's also great."}, {"time": 1926, "text": "But a lot of that mouthfeel comes from that really beautiful dissolved collagen."}, {"time": 1932, "text": "So when you're looking at like, how do I understand how I'm gonna cook a piece of meat?"}, {"time": 1935, "text": "That first fork in the road is, how is this gonna respond to heat?"}, {"time": 1940, "text": "And what's the appropriate cooking technique?"}, {"time": 1943, "text": "Then the second piece is that surface area to volume ratio."}, {"time": 1947, "text": "And that's important because the heat is gonna impact the meat through the surfaces of the meat that are in contact with the heat."}, {"time": 1954, "text": "So if I have a steak that's three inches thick, I'm gonna cook it extremely differently from a steak that's a half inch thick or three quarters of an inch thick."}, {"time": 1966, "text": "And that's the major, and that's the truth."}, {"time": 1968, "text": "If I have a piece of pork shoulder that's cut into cubes versus having a whole pork shoulder, that surface area to volume ratio, that's gonna totally change how I cook it."}, {"time": 1978, "text": "And same things like pot roast and a beef stew would be the same cut of meat, right?"}, {"time": 1983, "text": "But how I cook them is gonna change based on the surface area to volume."}, {"time": 1986, "text": "Because you've gotta let moisture and heat work its way into the center of the meat."}, {"time": 1991, "text": "And that's gonna be determined by the amount of surface of the meat that's in contact with whatever cooking liquid or heat you've got."}, {"time": 1997, "text": "Is there different sources of heat to play with?"}, {"time": 1999, "text": "Like a big flame versus a small, or maybe even like almost no flame, like over coals, all that kind of stuff."}, {"time": 2007, "text": "Is there some science to the source of heat in how it plays with the meat?"}, {"time": 2012, "text": "Well, there's indirect heat and direct heat."}, {"time": 2015, "text": "And that really is mostly about temperature in more than actual, I mean, smoke is important as well that can permeate, but really the smoke doesn't go into the center of most cuts that you barbecue."}, {"time": 2026, "text": "It'll come in like the smoke ring."}, {"time": 2028, "text": "It's a maximum like half an inch on the outside, maybe a little bit deeper on a really long, slow cook."}, {"time": 2034, "text": "So they, but the smoke, that does create a ton of flavor on the surface of the meat."}, {"time": 2039, "text": "But that's, so the indirect allows you to have smoke contacting it and then a very, very low and slow heat."}, {"time": 2046, "text": "And what that does is indirect heat will be low and slow enough that the center of the meat will get warm at the same time as the exterior of the meat."}, {"time": 2057, "text": "And it'll all cook equally and all get equally tender."}, {"time": 2062, "text": "If you go very hot and fast, you risk the interior of the meat not getting right."}, {"time": 2066, "text": "You kind of create a shell on the, on it."}, {"time": 2068, "text": "And you slow down the interior of the meat, which you actually want to do with something like a steak where you want to keep it rare on the inside."}, {"time": 2075, "text": "So it's really indirect versus direct."}, {"time": 2077, "text": "Then once you get into direct heat, right, look at in that category, there's wood, charcoal, gas, right, that's about it."}, {"time": 2084, "text": "And those are meaningfully different."}, {"time": 2087, "text": "They're meaningfully different."}, {"time": 2088, "text": "Charcoal and wood, that's more of, there's more poetry and wood."}, {"time": 2092, "text": "There's a little bit more flavor, not functionally very different, but gas versus charcoal wood is very different."}, {"time": 2099, "text": "And that's because of the actual scent of the, of the cook, right, the scent of the flavor."}, {"time": 2104, "text": "And then there's a, I think an evenness of heat distribution that comes off of charcoal that's different from gas, because no matter how awesome your gas grill is, you do have hotter and cooler spots."}, {"time": 2116, "text": "So gas grills are typically, you can kind of control for that if you just are going really hot and fast, which is why gas grills are fine if you're just like throwing that steak on, get a hard sear on it, those burgers put a crust on it."}, {"time": 2126, "text": "Gas is fabulous for that."}, {"time": 2128, "text": "When you're doing things that do better with a low and slow cook, like let's say a whole tenderloin or chicken thigh, that's going to be a little bit less elegant on gas than on charcoal versus wood."}, {"time": 2141, "text": "So when you have more, more kind of nuance in the low, slow cook over the natural fuels."}, {"time": 2146, "text": "Talking about like smoke and flame and charcoal versus gas, it also adds to the experience and the smell and the whole thing of the cooking, like versus just like the taste it creates."}, {"time": 2160, "text": "There's a certain experience too, like when there's a bit of smoke, maybe I don't know what the chemistry of it is, but I feel like with smoke, the smell is distributed more effectively."}, {"time": 2167, "text": "I don't know if that's true, but there's a smell and a visual aspect to the experience that's almost enriched with a bit of smoke or like an open flame."}, {"time": 2178, "text": "Like if you can see the flame, there's magic to that."}, {"time": 2181, "text": "And it goes to the experience piece that we were talking about before."}, {"time": 2184, "text": "We were talking exactly about that, like the nuance and the beauty of like that long, slow cook and your house smelling like something."}, {"time": 2191, "text": "Why do people freak out about barbecue?"}, {"time": 2195, "text": "Because you go in and it smells bomb."}, {"time": 2196, "text": "It smells so good."}, {"time": 2198, "text": "It smells like heaven, right?"}, {"time": 2199, "text": "It smells fatty and delicious and the smells everywhere and everyone's smelling the same smell."}, {"time": 2204, "text": "So there's like this collective experience."}, {"time": 2207, "text": "That's, I mean, I think that's why barbecue is so sticky for people."}, {"time": 2212, "text": "It's like so yummy and you get this huge like anticipatory thing about it."}, {"time": 2216, "text": "It's like, cause it smells incredible."}, {"time": 2218, "text": "What was that incredible grill that we used yesterday?"}, {"time": 2220, "text": "What is that about?"}, {"time": 2221, "text": "That's called a Sea Island Forge."}, {"time": 2223, "text": "It's a wood fire grill that's inspired by like a South American style of cooking."}, {"time": 2227, "text": "So it's like, it's big."}, {"time": 2228, "text": "It has also the things with the crank."}, {"time": 2231, "text": "It allows you to control the distance from the flame."}, {"time": 2234, "text": "It's really key with the wood fire."}, {"time": 2235, "text": "So when we evolved from cooking over wood to charcoal, right, when that became more popular, the reason that we did that is that allowed us to skip the whole part of making our own charcoal, right?"}, {"time": 2248, "text": "So when you're cooking over wood, all you're doing is making your own charcoal."}, {"time": 2252, "text": "You don't ever cook over wood with the red fire."}, {"time": 2254, "text": "Like we don't like throw a steak on when the flames are orange and leaping up because you're just gonna get, you know, carbons like char all over your meat."}, {"time": 2262, "text": "So you're, when you're cooking over wood, you first cook down the wood, you create the coal base, the natural coal base, and then you cook over that."}, {"time": 2269, "text": "So you saw yesterday, I built my fire, I let it burn down, added some fresh wood so I could reinforce my coals with new coals coming in."}, {"time": 2276, "text": "But then I was actually cooking over the embers."}, {"time": 2280, "text": "You shorten that cycle with charcoal, it's more efficient."}, {"time": 2284, "text": "But what you lose is that whole cycle of, you know, that really beautiful experience of smelling."}, {"time": 2290, "text": "Now, if you're cooking on a Traeger, you're gonna get awesome smoke smell."}, {"time": 2293, "text": "You know, like there's plenty of ways to do this."}, {"time": 2295, "text": "It doesn't always have to be wood fire."}, {"time": 2297, "text": "And I love all the different ways, right?"}, {"time": 2299, "text": "But I really like the experience of the campfire."}, {"time": 2303, "text": "And I love that kind of just like sitting by it, building it, having to take the time."}, {"time": 2306, "text": "I like building the fire, going inside, preparing all my meats, bringing them out, cooking them."}, {"time": 2311, "text": "That whole experience start to finish is really just like something that it's my favorite."}, {"time": 2316, "text": "It's my favorite way to spend time, you know?"}, {"time": 2318, "text": "So I think, and why is that?"}, {"time": 2320, "text": "Is the food that different than cooking it in a more conventional grill?"}, {"time": 2323, "text": "Probably not, you know, like in a pure experience."}, {"time": 2325, "text": "But I think the actual experience is super memorable because you are outside, you are still in your role."}, {"time": 2331, "text": "You're enjoying this, you know, you're just taking in, you're watching, you're anticipating."}, {"time": 2336, "text": "I love that whole experience."}, {"time": 2338, "text": "Does the origin of the meat itself make a difference?"}, {"time": 2343, "text": "So we're here at Belcampo Farms and we'll, maybe you could talk about what your vision, your dream is in terms of like food, in terms of where food comes from, where meat comes from, but food broadly, and how that affects the entirety of the culinary journey."}, {"time": 2365, "text": "On the question of where does it come from and does that matter, I'd say the way that meat is raised is massively important for flavor and for how it cooks."}, {"time": 2376, "text": "I think most cooks who try cooking grass fed versus corn fed, that's the first moment where they realize that, right?"}, {"time": 2385, "text": "Where corn fed meat cooks much more slowly, it's got bigger veins of fat that slow the heat transfer throughout the muscle of the animal, compared to grass fed, which is leaner, heat moves through it more quickly, those steaks will cook much, much faster."}, {"time": 2400, "text": "So there's very kind of technical reasons why, how meat is raised that we're aware of."}, {"time": 2407, "text": "And there's other things that I've noticed, like that slower growing poultry has a very, very different musculature and fiber to it than fast growing poultry, that's confinement animals."}, {"time": 2419, "text": "It's just, it has to do with the way that the muscles are built."}, {"time": 2422, "text": "They tend to be finer and thinner and more tender and a little bit more susceptible to heat."}, {"time": 2428, "text": "So the character of the meat's radically different."}, {"time": 2432, "text": "It's also much more flavorful when it's grown more naturally."}, {"time": 2435, "text": "And I think some of the reliance in the US on like sugary sauces and lots of salts and flavors and things like that's actually based on having the broadly available meat out there is pretty low on flavor."}, {"time": 2451, "text": "And so we're adding in a lot to compensate for that."}, {"time": 2454, "text": "So to your point of like enjoying things very simply and with like salt and nothing else, like the more flavorful that product is, I think the more people will find that enjoyable."}, {"time": 2466, "text": "Let's paint a vision."}, {"time": 2468, "text": "I mean, you're a visionary."}, {"time": 2469, "text": "You have a vision to have basically meat in every store that comes from a farm like Belcampo that's basically doing regenerative farming."}, {"time": 2482, "text": "How do we get there?"}, {"time": 2484, "text": "It's about a network of smaller producers working together with shared values."}, {"time": 2491, "text": "And it's true that there's a limit on regenerative farming in that it requires more human knowledge."}, {"time": 2499, "text": "So regenerative farming is more difficult to scale in a single operation."}, {"time": 2506, "text": "It'd be really challenging to have a regenerative farm that was like 200,000 acres because of the amount of manpower needed to pay attention."}, {"time": 2513, "text": "Can you first, and I apologize to interrupt, but can you say what is regenerative farming?"}, {"time": 2519, "text": "So if you're looking at scaling regenerative farming, it's a traditional system of agriculture."}, {"time": 2527, "text": "Regenerative farming is how we used to farm."}, {"time": 2530, "text": "We used to farm with an eye towards the longterm."}, {"time": 2535, "text": "You might be on the Friedman farm thinking about your heirs five generations from now farming that same land."}, {"time": 2542, "text": "Are you gonna leave that land nutritionally empty?"}, {"time": 2546, "text": "No, it's a longterm thinking."}, {"time": 2548, "text": "Also in traditional ag, you don't have inputs."}, {"time": 2552, "text": "That are very convenient."}, {"time": 2552, "text": "You can put some chicken manure on, but you can't spray or dump something that massively increases the growing potential of the land."}, {"time": 2565, "text": "That was not available until the past 60 years."}, {"time": 2569, "text": "So regenerative agriculture is an approach to farming where you're increasing soil fertility through your farming."}, {"time": 2578, "text": "You increase soil fertility by feeding the soil."}, {"time": 2582, "text": "You feed the soil through carbon."}, {"time": 2586, "text": "That's why regenerative farming is better for the environment."}, {"time": 2588, "text": "It sequesters carbon and puts carbon into the soil."}, {"time": 2592, "text": "Now it's interesting."}, {"time": 2594, "text": "Plants need carbon and put it into the soil when they're going through growth."}, {"time": 2601, "text": "So if you have a beautiful field of grass that's just waving in the wind, that's where you're gonna get the most of the carbon that's going into the soil."}, {"time": 2608, "text": "That's not sequestering as much carbon as plants that have been damaged and are regrowing."}, {"time": 2614, "text": "Plants that have been damaged and are regrowing are repairing and they're doing that by drawing down carbon as one of the nutrients that feeds them."}, {"time": 2623, "text": "To damage the plants effectively, that's what we're doing with regenerative grazing."}, {"time": 2629, "text": "So the cows or, you know, lambs or whatever out there, they're eating and taking the grass down and that then cause a regrowth cycle that sequesters carbon."}, {"time": 2642, "text": "There's a limit to it."}, {"time": 2642, "text": "There's an edge, because if those plants are so damaged that they can't regrow, then it turns into a dirt patch and that doesn't sequester any carbon."}, {"time": 2650, "text": "So it's a balance."}, {"time": 2651, "text": "How do you find that balance?"}, {"time": 2653, "text": "That has to do with like the frequency and the scale of the grazing essentially?"}, {"time": 2659, "text": "And so you have to find the right balance and that connects to both the grass."}, {"time": 2664, "text": "I mean, is the ultimately the focus here is on the life cycle of whatever is grazing, whether it's cows or lambs or so on?"}, {"time": 2672, "text": "That's why the scalability question."}, {"time": 2674, "text": "So all that stuff that I just talked about, like think about all the actions that that requires."}, {"time": 2679, "text": "Somebody's out there looking and paying attention and understanding how far the grass is, remembering what happened in that field last year."}, {"time": 2687, "text": "There's a huge human intelligence need and human kind of availability of attention."}, {"time": 2695, "text": "Now, industrial farming has done a great job at de skilling agriculture."}, {"time": 2703, "text": "Industrial farming has taken agriculture from being art science to being entry level employment."}, {"time": 2711, "text": "So that's the limiting factor on regen and that's why I think..."}, {"time": 2714, "text": "It's a human intelligence piece."}, {"time": 2716, "text": "I gotta ask, I don't know if you think about this kind of stuff."}, {"time": 2719, "text": "I mentioned to you offline that I spent a bit of time with some robots and Boston Dynamics."}, {"time": 2724, "text": "Do you think there's a way to use artificial intelligence to help?"}, {"time": 2727, "text": "So data collection, so automating some of the things that makes humans special, make some of that decision, some of that memory that's then utilized, converges to knowledge to make decisions about the crops and so on."}, {"time": 2739, "text": "Is there a way AI can help?"}, {"time": 2743, "text": "I mean, that would be incredible."}, {"time": 2745, "text": "That's one of the ingredients that could help with the regenerative farming."}, {"time": 2748, "text": "A number of discrete decision points that could completely be automated as well in order to supplement and work with somebody, like a farmer in managing it, about the performance on land."}, {"time": 2761, "text": "And a bit of that's being done right now with some aerial mapping, but that type of AI would be huge in this."}, {"time": 2767, "text": "I mean, there's estimates that if the damage and underutilized rangeland in the world was converted to regenerative agriculture somewhere between like 20 and 40% of the world's carbon could be sequestered."}, {"time": 2780, "text": "So there's a huge potential."}, {"time": 2782, "text": "The problem is cultural."}, {"time": 2786, "text": "We've like lost the generational thread of knowledge about how to do this."}, {"time": 2790, "text": "It's kind of been two generations that haven't farmed this way."}, {"time": 2794, "text": "Also the science around it is limited by the scale and longevity."}, {"time": 2800, "text": "So the data collection around regenerative farming is also limited by the fact it's kind of piecemeal."}, {"time": 2805, "text": "There's small operations that are doing it."}, {"time": 2808, "text": "They're learning and developing as they go, and they haven't been documenting it and doing it for too long."}, {"time": 2813, "text": "Is the ethical treatment of animals a part of regenerative farming?"}, {"time": 2818, "text": "So in the way you do things at Belcampo, that's a huge part."}, {"time": 2823, "text": "Is that necessarily part of the life cycle?"}, {"time": 2825, "text": "So like the things that you're trying to measure is like the way, like not damaging the land too much, make sure that the sort of the land is constantly healthy and is producing, and then the grazing process, and also the carbon piece, the fact that it's a carbon neutral or something like that."}, {"time": 2845, "text": "I mean, are all of those pieces of the regenerative farming or is this an extra part to your vision that you're thinking about?"}, {"time": 2852, "text": "It's all implicit and regenerative."}, {"time": 2854, "text": "I call it out separately because we are certified humane, which is another layer of welfare that has to do with density and a couple other things."}, {"time": 2861, "text": "But regenerative, I mean, think about it."}, {"time": 2864, "text": "If you're a cow and you're in a regenerative operation where the whole life cycle of the pasture means that you only eat the top six inches of the grass, and then when there's whatever, a couple inches left, then that field is left dormant."}, {"time": 2876, "text": "That's a better experience, right?"}, {"time": 2878, "text": "So just think about it kind of functionally that way."}, {"time": 2880, "text": "Well, grazing period is a better experience, right?"}, {"time": 2882, "text": "And that's not what's done in, I mean, that's the grass fed piece, right?"}, {"time": 2886, "text": "That's the other piece with certified organics, amazing."}, {"time": 2892, "text": "There's plenty of certifications that grass fed and finished is also great, but there are workarounds for those."}, {"time": 2899, "text": "You can have certified organic feedlots."}, {"time": 2901, "text": "You can have grass fed and finished, which is an animal fed a grass seed pellet."}, {"time": 2906, "text": "Those aren't things that we do here, right?"}, {"time": 2909, "text": "And regenerative captures that."}, {"time": 2910, "text": "Because if you're, it's like anything, you're isolating these very specific certifications, it doesn't have a holistic approach."}, {"time": 2917, "text": "Regenerative though, unfortunately, isn't certified yet."}, {"time": 2920, "text": "We've gotten USDA approval to use that word based on our carbon sequestration data, but it's not a regulated term."}, {"time": 2927, "text": "So that's kind of the mix right now is to figure out how to document it."}, {"time": 2931, "text": "And it's not totally clear what it means like for pigs and chickens, which are omnivores."}, {"time": 2936, "text": "It's very clear for ruminants, which are animals that have a rumen that eat grass."}, {"time": 2941, "text": "For omnivores, which is like what we are, they eat primarily grain in farming operations, and that's a little bit more complex."}, {"time": 2947, "text": "So it's kind of a moving landscape, but regenerative as a word is the better definition of the whole life cycle approach of letting animals and nature work together."}, {"time": 2958, "text": "Is it true that it's possible to have a farm that doesn't produce, sort of is carbon neutral?"}, {"time": 2965, "text": "We have been third party verified to be carbon impact negative."}, {"time": 2971, "text": "So Belcampo's 25,000 acres and the animals here, all of the carbon, including from our shipping on our mail order is all offset by the amount of grazing that's happening."}, {"time": 2983, "text": "Also that encompasses our partner farms."}, {"time": 2985, "text": "We buy a number of live animals in from other partner farms."}, {"time": 2989, "text": "That's their impacts also incorporated in that."}, {"time": 2991, "text": "I mean, first of all, that's incredible."}, {"time": 2992, "text": "And second of all, is that possible to scale?"}, {"time": 2995, "text": "I don't see why it isn't."}, {"time": 2997, "text": "I mean, it's complex to scale, but I mean, we're putting people on the moon and you have a robotic dog."}, {"time": 3005, "text": "But that's less about scale, that's more about innovation."}, {"time": 3009, "text": "So like in many ways what Belcampo has done is innovative at a small scale."}, {"time": 3014, "text": "The question is whether that innovation can be scaled."}, {"time": 3016, "text": "That's where I feel like we in the industry need more help."}, {"time": 3020, "text": "You know, the AI piece, the intelligence, the thinking about ways to do things differently is where we need more support."}, {"time": 3029, "text": "And I think it's been a, you know, a kind of a swing in the past couple of years where it's like meat's a mess, it's terrible."}, {"time": 3040, "text": "So let's ditch meat and opt for these hyper process, you know, plant based solutions."}, {"time": 3046, "text": "And I am saying there's a way to make meat a part of the solution."}, {"time": 3052, "text": "And it's gonna mean eating less of it."}, {"time": 3054, "text": "It's gonna mean paying more for it."}, {"time": 3056, "text": "It's gonna mean that the farming systems are more complicated."}, {"time": 3059, "text": "It's not the easiest path, but I think in the long term it's the better path."}, {"time": 3063, "text": "And it's also better for human health."}, {"time": 3065, "text": "Can you comment on the certified humane piece?"}, {"time": 3067, "text": "So how do you run a farm?"}, {"time": 3071, "text": "Like what does it mean to raise an animal from the beginning of its life to the end of its life in a way that's ethical, that's humane?"}, {"time": 3078, "text": "I think the first piece you need to just be comfortable with is that making an animal into meat, you know, is something that you're comfortable with."}, {"time": 3088, "text": "Cause I think that's the biggest question, right?"}, {"time": 3090, "text": "And so certified humane actually goes all the way through the death of the animal, how it's killed and handled at processing."}, {"time": 3097, "text": "So I put that out there just to say, well, this is all about producing an animal to die for meat."}, {"time": 3103, "text": "And that's not necessarily, that's something people struggle with with the word humane."}, {"time": 3108, "text": "Like I have space and empathy for that."}, {"time": 3109, "text": "It's a complicated decision."}, {"time": 3111, "text": "And when you have to be comfortable with at the outset to say, this is an animal that's gonna die to feed me."}, {"time": 3116, "text": "Yeah, so we should pause on that cause I actually just the two days ago read a paper that argued that, you know, the killing of an animal period cannot be humane."}, {"time": 3126, "text": "So it's impossible."}, {"time": 3127, "text": "And so, and that's an argument just like you're saying we could make, but if we now on the table kind of take as a starting point, the idea that it's possible to kill an animal for food in an ethical way, if we take that as a starting point."}, {"time": 3145, "text": "So we won't argue about that."}, {"time": 3147, "text": "It is worth arguing about it elsewhere."}, {"time": 3149, "text": "And it probably will."}, {"time": 3150, "text": "I will probably talk to a few vegan folks and we'll talk about the vegan diet."}, {"time": 3155, "text": "I'm fascinated by it as well."}, {"time": 3156, "text": "So I'm torn in the whole thing."}, {"time": 3157, "text": "But if we just take that as a starting point, what then is an ethical humane way to treat an animal?"}, {"time": 3165, "text": "I look at ethical humane animal treatment as the major phases of life."}, {"time": 3171, "text": "So conception, birth and mothering, diet, those are kind of the major touch points of life."}, {"time": 3181, "text": "So what we're looking at is evolutionary approach, which means is the animal eating what it evolved to eat primarily?"}, {"time": 3192, "text": "Is the animal primarily outdoors, which is how all animals evolved, given when the climate's appropriate for it."}, {"time": 3200, "text": "There's certain times when you can't have animals fully outdoors, like here on our ranch, we have had issues with cold weather and things."}, {"time": 3208, "text": "But so if you have appropriate weather conditions, does the animal outdoors?"}, {"time": 3213, "text": "Is the animal able to nurture and engage with its young?"}, {"time": 3217, "text": "Those are the kind of key touch points, but it's really the birth of it."}, {"time": 3220, "text": "Let me start this one from the scratch."}, {"time": 3223, "text": "Okay, so when I'm looking at, or when I consider what's humane, setting aside the death part, I look at the evolutionary diet, access to the outdoors, and ideally spending the majority of its life outdoors, low density, so animals spread out, and engagement with young, social interactions, and that's all kind of simplistic."}, {"time": 3248, "text": "Social interaction is a cool one."}, {"time": 3249, "text": "I mean, I also read an article that like, cows, for example, have social, like they have friends."}, {"time": 3258, "text": "I mean, that piece with the young, social interaction with young, social interaction with each other, that at a basic level, I'm sure that interaction is not as rich as humans, but that piece seems to be part of the humane picture."}, {"time": 3271, "text": "And you said also, just a quick comment, evolutionary diet, meaning the diet that they were evolved to have."}, {"time": 3280, "text": "And that's pretty simple."}, {"time": 3281, "text": "You can look at the physiology of the animal and figure that out."}, {"time": 3285, "text": "So ruminant species are lamb, goats, and beef, and they have five stomachs."}, {"time": 3290, "text": "They evolved eating really low calorie, high fiber foods."}, {"time": 3295, "text": "That's why they've got all the stomachs."}, {"time": 3296, "text": "They need a lot of processing."}, {"time": 3298, "text": "You or I were to eat grass, we die in a week, right?"}, {"time": 3300, "text": "Our physiology can't handle it."}, {"time": 3302, "text": "Cows were built and evolved to eat this very low calorie, very high fiber, very low density food."}, {"time": 3308, "text": "And they walk around slowly, they're moving constantly and they're eating it."}, {"time": 3313, "text": "When we put them on a corn fed diet, that's the opposite of their evolutionary diet and their systems really struggle with it."}, {"time": 3319, "text": "Now, pigs and chickens are different."}, {"time": 3322, "text": "Pigs and chickens are omnivores and pigs will happily eat chickens, for example."}, {"time": 3330, "text": "Our pigs on the farm will hunt and kill rattlesnakes and eat them."}, {"time": 3337, "text": "They enjoy all of it."}, {"time": 3339, "text": "They're omnivores."}, {"time": 3340, "text": "So that you often see, and I've seen people try to raise like a grass fed chicken and that doesn't exist."}, {"time": 3346, "text": "I mean, they need a higher, omnivores eat everything."}, {"time": 3350, "text": "They're what's called monogastric."}, {"time": 3351, "text": "They got one stomach and that one stomach needs higher density nutrients."}, {"time": 3356, "text": "So in the case of chicken, if you're to do, look back in American history and in the 1950s, it took, commercial chickens took like 54 weeks to come to full weight."}, {"time": 3367, "text": "Now it's two and a half weeks in confinement farming on our systems, it's like eight to 10 weeks typically."}, {"time": 3398, "text": "So you gotta give them some high density, high calorie food different from that."}, {"time": 3401, "text": "That's the evolutionary diet is a really key thing."}, {"time": 3404, "text": "That's the fundamental thing for health."}, {"time": 3406, "text": "And it's also interesting because the evolutionary diet ties to human health."}, {"time": 3411, "text": "I've looked at the nutritional analysis on all of our products and it's, the evolutionary diet is for the case of beef and lamb gets their omega three to six ratios, the same as wild game."}, {"time": 3426, "text": "So it's not like beef is really radically different from elk, a ruminant species, right?"}, {"time": 3431, "text": "If you feed beef an evolutionary diet, their nutritional profile is the same as wild meat."}, {"time": 3436, "text": "There's a wild ruminant."}, {"time": 3438, "text": "I got a chance to witness Neuralink, I don't know if you're familiar with that company, the brain computer interfaces."}, {"time": 3443, "text": "And they have, I got a chance to see in person just a bunch of pigs who had Neuralink chips implanted and taken out."}, {"time": 3451, "text": "Those pigs are so happy with life."}, {"time": 3454, "text": "I don't know, I've never seen a happier animal."}, {"time": 3456, "text": "I mean, cause they get to eat, cause you were mentioning sort of diets and stuff."}, {"time": 3462, "text": "Pigs seem to love a lot of stuff."}, {"time": 3465, "text": "They're easily made to be happy."}, {"time": 3501, "text": "Well, pigs are incredibly intelligent."}, {"time": 3502, "text": "So I'm not surprised that they're a subject matter for Neuralink."}, {"time": 3505, "text": "They're smarter than dogs and they're empathetic and emotional."}, {"time": 3509, "text": "And we'll go look at our pigs afterwards and see, but they're kind of like joyful and exuberant when they're in good health."}, {"time": 3517, "text": "And so that makes sense."}, {"time": 3521, "text": "I'm interested and open."}, {"time": 3523, "text": "I feel that the kind of bleeding edge agriculture movement that I'm on the edge of in some ways, we're a larger operator, but we as a movement have to get into the game."}, {"time": 3539, "text": "We have to move forward in a way that allows us to scale if we wanna be viable."}, {"time": 3543, "text": "So I think there has to be openness to how that can happen."}, {"time": 3546, "text": "And I also think there needs to be more thoughtful and noisy data about how regenerative ranching can sequester carbon."}, {"time": 3555, "text": "I mean, thousands of American ranches are selling carbon credits right now."}, {"time": 3560, "text": "The data is that valid."}, {"time": 3561, "text": "And they're not selling carbon credits from like grassland that just got a fence around it."}, {"time": 3566, "text": "They're selling carbon credits for verified data from animals assisting in carbon sequestration, right?"}, {"time": 3571, "text": "So there's got to be a way to get the tech community involved in ways to help regenerative agriculture scale."}, {"time": 3578, "text": "In different creative ways."}, {"time": 3579, "text": "And actually, that'd be interesting if like Neuralink somehow has, and especially because Elon Musk is involved and Kimball Musk has his whole effort and appreciation of regenerative agriculture that I wonder if Neuralink has a role to play, like exploring the neurobiology of the animal, if that somehow will create innovations that lead to improved scaling of regenerative agriculture."}, {"time": 3609, "text": "But you're saying you should be open to all those possibilities."}, {"time": 3611, "text": "I don't think, I don't know the landscape to know what."}, {"time": 3613, "text": "But my sense is that it's very hard."}, {"time": 3617, "text": "And our farming operation to scale, it's been incredibly complex and challenging."}, {"time": 3622, "text": "We now work with partner farms."}, {"time": 3624, "text": "I see their operations, they're incredibly complex."}, {"time": 3627, "text": "You know, it just seems like there's got to be a way to make some of these things simpler and easier to share information."}, {"time": 3633, "text": "I don't know what that answer is."}, {"time": 3636, "text": "You know what would be cool is if we can understand deeper ways to measure the happiness of an animal."}, {"time": 3642, "text": "Because then we can optimize, like certified humane could be literally an optimization problem."}, {"time": 3648, "text": "Just make sure, as opposed to kind of using our, projecting our own human values, actually measuring what the animal is happy doing."}, {"time": 3656, "text": "That could be, so understanding the pig brain might help us understand pig happiness and reframe what it means for a happy animal."}, {"time": 3664, "text": "And then maybe it's a lot easier to make a happy animal, to make the animal happy than we think."}, {"time": 3669, "text": "And it might have to do with a variety of delicious food in the case of the pig."}, {"time": 3673, "text": "Is there something you could say about grass fed meat?"}, {"time": 3676, "text": "Is it all, just out of my own sort of curiosity, whenever people say sort of grass fed meat is better for you, are all grass fed meat made the same?"}, {"time": 3684, "text": "Is there different like, it's like the word organic."}, {"time": 3689, "text": "Is there a lot of variety within that?"}, {"time": 3691, "text": "Like the way Belcampo does it, will the others do it?"}, {"time": 3694, "text": "Just more color if you could add to this whole word and what it means."}, {"time": 3699, "text": "Grass fed beef has been on grass its entire life."}, {"time": 3703, "text": "And you wanna look for the words 100% grass fed or grass fed and finished."}, {"time": 3707, "text": "Now, the challenge with feeding beef grass its whole life is that it gains weight more slowly."}, {"time": 3717, "text": "Although beef didn't evolve, eating corn and things, it can eat them."}, {"time": 3722, "text": "And in eating them, it gains weight more rapidly and has like a version of like an inflammatory response."}, {"time": 3730, "text": "If you actually look inside the rumen of the animal inside the stomach, it's like black and shiny inside compared to grass fed animals like greens, smells like compost."}, {"time": 3740, "text": "So the animals themselves, their whole physiology is damaged by that food, but they also gain weight really quickly and they put on a lot of fats."}, {"time": 3747, "text": "Like if you or me were to eat a bunch of processed food compared to eating a bunch of greens, it's the same impact, you're gonna blow up."}, {"time": 3754, "text": "So the problem for grass fed is getting the animals to gain weight."}, {"time": 3759, "text": "They're getting a ton of exercise, they're eating really clean, right?"}, {"time": 3763, "text": "And they're super chill."}, {"time": 3765, "text": "So that's different from the animals that are kept still eating really nutrient dense foods and under a ton of stress, which is a confinement animal."}, {"time": 3776, "text": "So are all grass fed meats created the same?"}, {"time": 3779, "text": "The diet, yeah, nutritional profile broadly, but the length of time that the animal lives is extremely important for the flavor of the meat."}, {"time": 3790, "text": "We're taking our beef to 24 to 26 months, conventional is around 18 months."}, {"time": 3796, "text": "So I'm always looking, and if you're evaluating grass fed animals, you wanna get animals that are typically allowed to live for longer because their flavor is gonna be better, there's gonna be a bit more fat and their omega ratios also vary very differently."}, {"time": 3812, "text": "And I've seen omega ratios, in our firm everywhere from one to three to one to one, ideal is one to one game is typically one to one or one to two omega three to sixes."}, {"time": 3822, "text": "But in operations where you don't have year round grass, it's more complicated, you know, you're feeding hay and you don't get that three to six ratio."}, {"time": 3828, "text": "Omega threes come from green grass, they're the fat in greens."}, {"time": 3833, "text": "And so they're scarce and costly, right?"}, {"time": 3836, "text": "So you can have grass fed and finished animals that don't have that perfect ratio because maybe they're in a climate or for whatever reasons, we've had to do it too, during the droughts do hay finishing, it's not optimal, it changes the ratio a bit."}, {"time": 3847, "text": "So there's a little bit of variance within it."}, {"time": 3850, "text": "I'd say though, the variance is a little bit higher the variance within grass fed is still small compared to the variance between conventional and grass fed, right?"}, {"time": 3861, "text": "So there's definitely things to look for within it, but the real difference is between those two."}, {"time": 3867, "text": "Also thing to notice is that it's not a verified word, okay?"}, {"time": 3873, "text": "So grass fed means animals that have been on grass at some point in their life."}, {"time": 3880, "text": "The way the cattle industry is in the US, there's segmentation."}, {"time": 3886, "text": "So there's cow calf operations, then those calves get sold to stocker operations which raised animals in their teens basically, and then those get sold to feed lots."}, {"time": 3896, "text": "And so those three phases, that first phase of the cow calf is always on grass."}, {"time": 3902, "text": "It's mother cows and mom cows are amazing."}, {"time": 3904, "text": "They can thrive on anything and still put all their nutrients into their baby and their babies will be healthy."}, {"time": 3909, "text": "So you never are putting mother cows on really premium pasture."}, {"time": 3912, "text": "So it's usually just kind of like okay pasture, dirty lot, if you ever see kind of like, scrubly lots with lots of cows and calves on, that's a cow calf operation."}, {"time": 3920, "text": "So there's also a loophole, unfortunately, where people use the term grass fed, and they're actually referring to animals that at some point in their life had grass, but that might be pretty far in the rear view mirror."}, {"time": 3931, "text": "So you need to look at that grass fed and finished or grass fed 100%."}, {"time": 3936, "text": "That ratio of omega three to sixes, it changes in like a week on grain."}, {"time": 3941, "text": "So it's radically different."}, {"time": 3942, "text": "Unfortunately, it's the same thing for you and me."}, {"time": 3943, "text": "You can eat clean for a month, you eat junk for three days, you're garbage, right?"}, {"time": 3948, "text": "It's not like you can just like coast on that, right?"}, {"time": 3950, "text": "We know what that's like."}, {"time": 3951, "text": "Same thing for animals, our physiology changes."}, {"time": 3952, "text": "Food's the number one way we interact with our environment."}, {"time": 3955, "text": "And our body changes really rapidly and dramatically."}, {"time": 3958, "text": "So we know Belcampo and just the way sort of this regenerative farming approach of Belcampo and the sort of high humane is good for the land, is good for the animal."}, {"time": 3969, "text": "Can you comment on ways it's good for the human that eats the meat?"}, {"time": 3974, "text": "Is this meat better for you?"}, {"time": 3976, "text": "Yes, and this is where they kind of focus on the joy and animals doing yoga and all this sort of like cynical stuff about this type of agriculture."}, {"time": 3987, "text": "So just like set that aside, it really is better for your health."}, {"time": 3992, "text": "It's got a better fat ratio, it's less inflammatory, it's got higher protein, it's just better product."}, {"time": 3999, "text": "In the case of beef, it's lower in fat and that fat has a better quality and it's higher in poultry and pork, it's also higher in protein."}, {"time": 4007, "text": "So all the nutritionals are better."}, {"time": 4009, "text": "It's got higher density of vitamins, it's got higher density of minerals."}, {"time": 4012, "text": "And none of this stuff is radically different than, it's not like the product is black and white, but every metric meaningfully is better in the right direction across the board."}, {"time": 4025, "text": "So why wouldn't you?"}, {"time": 4026, "text": "I hesitate to take anecdotal evidence as like final scientific conclusions, but it does seem I've eaten quite a bit of belcampo meat, for example, and it's just my body seems to respond, like it's less bothered by it."}, {"time": 4042, "text": "Meaning like less inflamed, I just feel better."}, {"time": 4045, "text": "Because I mostly eat a meat diet and it does seem to be a little bit of a difference what kind of meat I eat, where it comes from."}, {"time": 4054, "text": "I don't know if that's my own psychology also."}, {"time": 4057, "text": "I mean, there is an aspect to like, when you know that the meat came from a good place and all the ways we've defined good, you feel better about it."}, {"time": 4066, "text": "And that has an effect, like decreased stress."}, {"time": 4069, "text": "So I'm a huge believer in that, like outside of just nutrition, how you feel about the whole experience is a huge impact."}, {"time": 4075, "text": "But it does feel like the meat itself is actually just leading to less inflammation for me or like less, like the bloated feeling and all those negative effects that could come with meat versus like certain other ground beef that I eat, like store bought chicken breast or steak, all those kinds of things."}, {"time": 4096, "text": "My body's a little bit more, works a little bit harder to process that food, it feels like."}, {"time": 4101, "text": "I don't know if there's science to that, but sort of anecdotally, that seems to be the case."}, {"time": 4105, "text": "Omega sixes are a big part of that, for in the case of the beef."}, {"time": 4107, "text": "You eat a lot of beef, you love beef."}, {"time": 4109, "text": "And so in a conventional beef product, it's a one to 30 ratio of omega threes to sixes."}, {"time": 4116, "text": "And sometimes one to 20, one to 30, but that's the wrong direction."}, {"time": 4121, "text": "In our beef, it's as low as one to one."}, {"time": 4125, "text": "So that and the omega sixes are what's part of inflammation."}, {"time": 4130, "text": "Now, the magic in animals is that they're incredibly efficient processors."}, {"time": 4135, "text": "And in the same way that the body can process and take out tons of things that are toxic out of the environment, I mean, animals bodies can do that too."}, {"time": 4146, "text": "So the beauty of meat is that it can be pretty clean."}, {"time": 4149, "text": "Things like Roundup and stuff don't end up in the meat."}, {"time": 4152, "text": "When we have antibiotics in our meat, we're not worried about getting like tetracycline from the chicken breast."}, {"time": 4158, "text": "What we're worried about is the workers getting tetracycline, the chicken growing faster than it should, the meat being chewier and not as high quality."}, {"time": 4166, "text": "But the actual antibiotics don't, the animals great at filtering that, right?"}, {"time": 4170, "text": "They get that out."}, {"time": 4171, "text": "So you have to think about meat not as like contamination of like, oh, there's gonna be some of that garbage they used in the farming in my meat, but it's the more subtle things."}, {"time": 4181, "text": "It's the fat ratio, it's the protein density."}, {"time": 4183, "text": "And there's also just, I think in my experience, there's just more complex flavor and things that taste more complex."}, {"time": 4192, "text": "This is, science backs this up, they fill you up faster."}, {"time": 4196, "text": "So if you're looking to limit, to eat for fullness and, but not eat as many calories, more complex foods are the way to do that."}, {"time": 4206, "text": "And that hit, you hit your satiety, help you hit that satiety."}, {"time": 4210, "text": "So things like, I mean, all the key amino acids that help you feel full, mostly from meat, right?"}, {"time": 4216, "text": "So those are, that's part of it, like it, but all meats have those."}, {"time": 4219, "text": "Then there's other kind of micronutrients and things around that complex flavor that help you feel full faster."}, {"time": 4225, "text": "Forgive me for this question, but it is kind of an interesting one that people are curious about."}, {"time": 4230, "text": "What does it feel like to be a, or what does it take to be a woman CEO of a meat company?"}, {"time": 4238, "text": "I mean, you're no longer CEO of Belcampo, but you did, you ran, you cofounded Belcampo, you ran it for many, many years."}, {"time": 4245, "text": "Is there something that you could say in terms of challenges associated with that?"}, {"time": 4251, "text": "And how did you personally overcome it?"}, {"time": 4254, "text": "So to be a female running a meat and livestock operation, it felt very alone, a lot, you know, for a long time."}, {"time": 4264, "text": "I felt very, like everybody waiting for me to fail or watching and assuming that I was like, just good at marketing or whatever else."}, {"time": 4277, "text": "And so it's taken me a while to not internalize that."}, {"time": 4287, "text": "I think the only reason I'm here is we have our own supply chain in Slaughterhouse."}, {"time": 4294, "text": "And I think had I really been playing in the broader meat industry, it would have been a shorter journey."}, {"time": 4298, "text": "You know, it would have been very hard to make it even get to this phase."}, {"time": 4302, "text": "But I do, you know, I think the mission is my life's work."}, {"time": 4314, "text": "The mission of cleaner ingredients that tastes so amazing."}, {"time": 4319, "text": "You don't need to do too much to them."}, {"time": 4322, "text": "You know, I like creating food that's in support of good health."}, {"time": 4327, "text": "And then secondary to that, it's the environment, but I want healthy food to be a joy to eat, right?"}, {"time": 4333, "text": "And that's, you know, creating innovation in the space for this company has been about building a brand that people understand and is transparent and that people believe in in an industry that's broadly perceived of as pretty corrupt."}, {"time": 4350, "text": "So those are things I feel enormously proud of."}, {"time": 4353, "text": "So you focused on the mission and the pushback, all the mess of the industry."}, {"time": 4360, "text": "You try not to internalize it, trying not to let it affect you and focus on the mission."}, {"time": 4364, "text": "You know, and it's in the joy of it and the part where it's gotten fun for me has been returning to what I love about it."}, {"time": 4371, "text": "And I've only had the privilege of doing that pretty recently."}, {"time": 4375, "text": "So I think for me personally, you know, starting, I host these events on the farm called Meat Camps, where I cook and teach people to cook and, you know, taste and talk about flavor and all the like sensual aspects of it that are my fire."}, {"time": 4390, "text": "Like, thank goodness I did that stuff because otherwise it was just such a beating."}, {"time": 4394, "text": "You know, so there were parts of it where I got to feed my fire."}, {"time": 4397, "text": "And then now in the, you know, the past year, since resigning, I've been, I do all the recipe development."}, {"time": 4402, "text": "I shoot all the content."}, {"time": 4403, "text": "I, you know, taste product."}, {"time": 4405, "text": "I'm developing all of our new products."}, {"time": 4406, "text": "I launched our meatballs."}, {"time": 4407, "text": "I'm just about to launch our chicken meatballs, doing a high protein bone broth."}, {"time": 4411, "text": "Like those are, that's why I did this was to be able to build this great product that I could build on."}, {"time": 4417, "text": "So I'm kind of at that place now, but it's taken a lot longer."}, {"time": 4421, "text": "And I think, you know, looking at the landscape of what to do in food, this is definitely, we tackled the most complicated problem."}, {"time": 4432, "text": "That I can imagine, you know, I did it like in the most old fashioned way, right?"}, {"time": 4437, "text": "So it's been super complex."}, {"time": 4439, "text": "And then I also look at it and I'm like, yeah, and it's been messy and it's gonna continue to be hard, but I'm proud of having tackled the hard problems."}, {"time": 4447, "text": "So the hard problem here is not in the space of technologies."}, {"time": 4450, "text": "It's in the space of bringing something that we've done for a long, long time in our human history and scaling it in the face of all the other economic pressures."}, {"time": 4464, "text": "Like doing so successfully, also communicating to the rest of the world that this is a powerful solution."}, {"time": 4469, "text": "So inspiring the rest of the world that regenerative farming, like running a company in this kind of way that's humane for animals, good for the land, good for people, even if it costs, like if there's an increased cost to the meat, even if that, if you have a broader vision that means eating less meat overall, that that is like inspiring the world that this is a future we want."}, {"time": 4494, "text": "And just taking that on and getting that done."}, {"time": 4498, "text": "Got a chance to eat a little bit of cheese, which is a good opportunity to talk about your experience in Italy."}, {"time": 4506, "text": "You spent some time, or as south of Europe, I'm not sure if it was Italy."}, {"time": 4509, "text": "Yeah, I lived in Italy, but."}, {"time": 4511, "text": "And there's cheese involved, right?"}, {"time": 4514, "text": "Like what did you take away from that experience, both as a chef and as a human being?"}, {"time": 4521, "text": "I moved to Europe right after my early 20s and I worked as a cheese maker."}, {"time": 4527, "text": "And I lived in really small rural farms in the countryside."}, {"time": 4534, "text": "And I got up early and milked animals, made cheese."}, {"time": 4539, "text": "And I got to live in a traditional agricultural society and learn how they ate."}, {"time": 4548, "text": "So it shaped me as a cook because it was a chance to have incredible ingredients, learn how to cook very simple food."}, {"time": 4558, "text": "I had been immersed in thought that I wanted to be like a chefy chef, right?"}, {"time": 4562, "text": "Because I love food and I love cooking and I was just drawn to that world."}, {"time": 4566, "text": "But I don't like the experience of that sort of like fancy food experience is not what is exciting for me about it."}, {"time": 4575, "text": "So I loved working in that environment because I got to eat lunches and dinners and everything with the farm that I lived in."}, {"time": 4584, "text": "The farm that I lived on and just very traditional, simple way to eat."}, {"time": 4591, "text": "The other piece of it is I went to high school in the 90s, child of like the low fat generation, right?"}, {"time": 4597, "text": "And it was just really liberating and amazing to eat tons of super fatty foods and olive oil all over the place and bleak slabs of bread and salami and being this like vibrant health, like be leaner, you know, happy, no skin stuff, you know, stop getting split ends."}, {"time": 4617, "text": "Like I stopped having flaky nails, like just stuff that had bothered me my whole life, including like just moodiness."}, {"time": 4624, "text": "And that all just changed."}, {"time": 4625, "text": "And granted, I was also like living on a farm in Italy and getting up with the sunlight."}, {"time": 4630, "text": "And like there were lots of great aspects of my life as well that happened in that time."}, {"time": 4635, "text": "But I was just immersed in this diet that I realized like, man, this is so simple."}, {"time": 4640, "text": "And I also loved that I had like, you know, you'd have dinner and it was just like some ricotta cheese with some olive oil, some bread and like a bowl of fava beans."}, {"time": 4650, "text": "It's like, that's dinner."}, {"time": 4652, "text": "And it kind of broke down my assumptions too about like dinner always has to be this, you know, a protein and a vegetable and, you know, being more fluid and more seasonal was exciting for me."}, {"time": 4663, "text": "So I just learned kind of a lot about paying attention to food, simple preparation and the vibrancy of health that I personally experienced kind of made me double down on that."}, {"time": 4678, "text": "Our mutual friend, Andrew Huberman, mentioned something offline to me about something involving the mob."}, {"time": 4686, "text": "Is there something you could share or is this, or are people going to hurt if you share this?"}, {"time": 4691, "text": "It's far enough in the rear view mirror."}, {"time": 4693, "text": "I mean, I was hired by this group in Sicily on, and this is, you know, I was all of like 21 years old and to get a permit to work there, you have to show that you have a competency that nobody else in Italy has."}, {"time": 4710, "text": "And that competency for Anya Fernald at the time was cheese expert."}, {"time": 4713, "text": "So it was like, stupid American girl being like, going to the consulate."}, {"time": 4717, "text": "So I already knew that it was like, there was something wobbly about this organization, but I wanted to work for them."}, {"time": 4722, "text": "And my boss from that time did end up in federal prison for corruption many years later, embezzlement primarily."}, {"time": 4733, "text": "But, so I was definitely in an environment that was answering to multiple masters."}, {"time": 4741, "text": "It was, I couldn't have asked for a better way to kind of get with life and understand how things happen in the world though."}, {"time": 4749, "text": "You know, of learning as somebody who tends to be super direct and not very subtle, it was amazing to be in this world where like everybody communicates in multiple levels."}, {"time": 4762, "text": "Like we're going to lunch with my boss, with somebody we're gonna do a business deal with and by the, they ordered a glass of wine and with that order communicated like, disappointment."}, {"time": 4775, "text": "Because that, the father of the person who had made that wine had offended that other guys."}, {"time": 4779, "text": "I like that level of stuff, like nothing happened directly."}, {"time": 4782, "text": "I'm like, what are we talking about afterwards?"}, {"time": 4783, "text": "I'm like, what happened that lunch?"}, {"time": 4784, "text": "It's like, oh, I just, you know, I told him this by ordering that, whatever."}, {"time": 4787, "text": "You know, that kind of thing."}, {"time": 4788, "text": "So understand that there's different ways of communicating."}, {"time": 4792, "text": "But it was also, you know, it was interesting to see."}, {"time": 4796, "text": "And I think I, you know, it's kind of the struggle that I've lived again and again in my life."}, {"time": 4801, "text": "Fundamentally, what we were doing in that operation was there's a very traditional cheese called the Raguzano cheese in Southeastern Sicily where I lived, Ragusa."}, {"time": 4809, "text": "And it was about scaling that operation."}, {"time": 4812, "text": "So it was European Union money that my boss was also unfortunately using for other things."}, {"time": 4816, "text": "But fundamentally it was to take that, this type of very small scale cheese, get them exported, help them scale."}, {"time": 4822, "text": "And we did it."}, {"time": 4823, "text": "And it was really challenging."}, {"time": 4824, "text": "And I learned a lot about the safety issues and collaboration issues and creating groups of farmers for scale."}, {"time": 4831, "text": "So it's kind of been doing the same thing again and again."}, {"time": 4834, "text": "But Sicily, it, you know, it was also just the first place where I would regularly forage for food."}, {"time": 4845, "text": "You know, like there I'd go to friends houses and we'd like go out and pick nettles or go out and pick wild asparagus."}, {"time": 4852, "text": "So every season there were stuff that you'd be gathering."}, {"time": 4854, "text": "And that was just part of how you lived."}, {"time": 4855, "text": "And it was part of your health."}, {"time": 4857, "text": "So that was, I just learned a ton in that time about like simple eating and really that healthy food, the simpler it is, the better, right?"}, {"time": 4868, "text": "Like this sort of sense that healthy food isn't in a tiny package, granola bar, lots of labels, lots of powders."}, {"time": 4873, "text": "It's like the more simple, essential, closer to the land can actually lead to optimal health."}, {"time": 4877, "text": "You've learned to appreciate the simplicity of food, the beauty within the simplicity."}, {"time": 4882, "text": "I think it's because it was the first time that I had amazing food quality."}, {"time": 4889, "text": "Cause in the, where I grew up, there wasn't that food quality."}, {"time": 4892, "text": "Like I had some stuff from my garden and things that were great, but that's the kind of place where when artichokes in season, all of a sudden there's guys selling artichokes on their bicycles in the street and they're just fresh picked and you'd get that one thing or the torpedo onions or they like, so there's a seasonality and celebration of things in their peak moment."}, {"time": 4911, "text": "And you would just have that one thing."}, {"time": 4913, "text": "And that was the first time I'd ever eaten in that way."}, {"time": 4916, "text": "You were a judge several times on Iron Chef."}, {"time": 4920, "text": "How do you judge a good meal, like what your own, other people's, like what rating system is good?"}, {"time": 4929, "text": "I mean, I go on experience and think about how many of your like most memorable, fantastic meals are like three star Michelin meals."}, {"time": 4936, "text": "It's more about the experience, right?"}, {"time": 4937, "text": "It's more about that slow down, who are you with?"}, {"time": 4940, "text": "And some of our best meals are like the most simple things."}, {"time": 4943, "text": "So Iron Chef, those were fun experiences."}, {"time": 4948, "text": "It's a lot of sous vide though."}, {"time": 4949, "text": "It's a lot of sauces."}, {"time": 4951, "text": "It's a lot of powders."}, {"time": 4952, "text": "I mean, it's kind of like magic food."}, {"time": 4954, "text": "So that's not, I mean, it's incredible to watch it as science, but I don't know if those are my most memorable meals."}, {"time": 4961, "text": "So the experience is how you judge a good meal."}, {"time": 4964, "text": "For you personally, if you were a judge of the entirety of the human experience in terms of the culinary journey, that would be like the people you're eating with, the environment, like how you feel, the journey, the building up to that meal, the whole thing."}, {"time": 4979, "text": "You can't separate it out."}, {"time": 4980, "text": "When I was learning as an apprentice cheese maker in Greece, one of the best meals of my life is like a bowl of cold sheep milk yogurt with like a crust of cold fat on top."}, {"time": 4993, "text": "So like the way that these fatty, sheep milk can have double the percentage of fat than cow milk."}, {"time": 4998, "text": "So like there's the yogurt and then there's this crust of fat and then they pour the fresh honey over the top and you just eat like this bowl of probably top five meals of my life, right?"}, {"time": 5009, "text": "I mean, that's the simplicity, it's just the best thing."}, {"time": 5011, "text": "And it was the fact that it's in Terracotta and I'd had this amazing day and all of these things come together, but I still remember that feeling."}, {"time": 5018, "text": "And I think most of us have those like really great sensual memories of food and they're not about necessarily that one fancy over the top restaurant or something."}, {"time": 5029, "text": "It's really about the cold context of enjoyment."}, {"time": 5032, "text": "Maybe you can help me with something."}, {"time": 5034, "text": "So I think Offline said that we're both introverts a bit, but I certainly find joy in repetition."}, {"time": 5044, "text": "So I kind of hide away as an introvert and eat the same thing over and over and over again."}, {"time": 5049, "text": "But at the same time, I had this conversation with Tyler Cohen, who's an economist, but he's also a food critic."}, {"time": 5055, "text": "He writes these incredible posts about different foods."}, {"time": 5059, "text": "And we had this conversation about what his last meal would be."}, {"time": 5064, "text": "If he had to choose, like what is the best meal he's ever eaten that he would want to eat?"}, {"time": 5069, "text": "And he had a good answer about it."}, {"time": 5071, "text": "It had to do with experience, I think."}, {"time": 5073, "text": "For him, it was a particular Mexican restaurant and it had in Mexico because of the ingredients, because of the experience, because of the work it took to get there and all those kinds of things."}, {"time": 5082, "text": "But it also made me realize, like when I was going home after that conversation, that I couldn't answer that question myself, like what is the best meal I've ever eaten?"}, {"time": 5091, "text": "Because I really haven't experienced much."}, {"time": 5094, "text": "And so it almost was like a challenge to myself."}, {"time": 5098, "text": "Like I feel like I should journey out a little bit more in this life and try stuff."}, {"time": 5103, "text": "And to try to see like what is the best meal for me in the world?"}, {"time": 5109, "text": "You know, like both the experience and the taste, right?"}, {"time": 5113, "text": "So I was kind of wondering, first I'd love to ask you like what your last meal would be or what is the greatest meal you've ever eaten?"}, {"time": 5120, "text": "But also, and you're still very young, and so there's still more experiences to be had, right?"}, {"time": 5128, "text": "And for me, like how do you go about finding the best meal in the world?"}, {"time": 5134, "text": "Is there a device you could give essentially?"}, {"time": 5138, "text": "There's that sense of anticipation, right?"}, {"time": 5142, "text": "So if it's the best meal, I'd say for you, it would need to be on the heels of something where you'd pushed yourself with a fast or with an athletic event, right?"}, {"time": 5154, "text": "Or something like you would be coming into it with a sense of anticipation because of deprivation."}, {"time": 5159, "text": "You'd be hungry for it in a bigger sense of the word, like hungry for deep nutrition on your soul level as well as your belly."}, {"time": 5165, "text": "So I'd say that you'd have to think about it as a phase of things, like multiple things."}, {"time": 5169, "text": "And then I also think, you love meat, you love cheese."}, {"time": 5174, "text": "You have to have some things that come together, right?"}, {"time": 5176, "text": "Like there's gotta be some specific elements of just your favorite flavors in that."}, {"time": 5181, "text": "But there could be flavors yet to be discovered."}, {"time": 5183, "text": "That's a whole other thing because I just emotionally and physically feel good on meat, but that doesn't mean like maybe like a rice based dish, like sushi or something like that, or Indian cuisine where it's like sauces and the breads and whatever."}, {"time": 5200, "text": "I love that stuff too."}, {"time": 5202, "text": "So we're not talking about like a meal is an experience that could be like a one night stand, but with a piece of food, right?"}, {"time": 5212, "text": "It could be a totally different than what actually makes you feel good when you eat it every day."}, {"time": 5218, "text": "Completely, completely analogous."}, {"time": 5221, "text": "I mean, you also though, there's elements of comfort and love and those different pieces for you."}, {"time": 5225, "text": "But I think you gotta look at like, where would you go somewhere?"}, {"time": 5229, "text": "Like would you go to a place where you could hike in Japan and then end up in a little place where you eat something?"}, {"time": 5235, "text": "That's where I would think you were gonna have that magic moment."}, {"time": 5238, "text": "Maybe someplace you go to Mongolia and you're in a really extreme environment for three or four days, and then you come back and you're in a farm and you get something on the table that's a surprise and you're hungry."}, {"time": 5248, "text": "Like that's gonna be the moment where you're gonna explode in the instance of like the culinary level for Alexa levels up, right?"}, {"time": 5256, "text": "That's the journey for you."}, {"time": 5257, "text": "But it has to be, I think from understanding you, like a combination of that pushing yourself anticipation and something about the, exactly, and the environment."}, {"time": 5267, "text": "Well, I definitely, definitely, like some fasting is part of a great meal for me."}, {"time": 5273, "text": "So like 24 hours is like the minimum."}, {"time": 5276, "text": "You're more sensitive to the richness of any experience for me when I fast 24 hours."}, {"time": 5284, "text": "And so that's a requirement."}, {"time": 5286, "text": "For a good meal is 24 hour fast, I think."}, {"time": 5290, "text": "It's just like you're able to taste, I don't know, maybe it's psychological, but you're able to disassemble the various flavors in a meal as simple as like even a chicken breast."}, {"time": 5300, "text": "There's all kinds of flavors going on."}, {"time": 5302, "text": "Because like when you cook a chicken breast, there's like the outside, the inside."}, {"time": 5306, "text": "I mean, the volume of the meat tastes different as you eat like the different fibers."}, {"time": 5311, "text": "And you can like tell all those differences as you're eating when you're fasting, and you can appreciate that."}, {"time": 5317, "text": "And of course, you're right, part of the journey is important."}, {"time": 5320, "text": "It makes me think like whether restaurants is the right place to explore or what."}, {"time": 5325, "text": "I'm envisioning it on a farm for you."}, {"time": 5327, "text": "And I'm envisioning it in a place that's like really into ag and food."}, {"time": 5331, "text": "You know, like even a place like Romania."}, {"time": 5334, "text": "You know, like they have incredible farms, right?"}, {"time": 5336, "text": "Where it's not gonna get any like fancy restaurants there, but you're probably gonna have some amazing little cheeses and cured meats, and you might go to some, you know, have some experience and end up in a place with like four things on the plate and each of them blows your mind."}, {"time": 5349, "text": "You know, like, or Japan is another place like that."}, {"time": 5352, "text": "I think Vietnam, Laos, like, I mean, those are countries where there's like these incredible niche ingredients and this essentialism around food."}, {"time": 5359, "text": "Or maybe it's in Russia with Putin."}, {"time": 5361, "text": "That might be the best meal in the world."}, {"time": 5363, "text": "With him on the farm."}, {"time": 5364, "text": "Yeah, that'd be, it's hard to reproduce that."}, {"time": 5367, "text": "If that is in fact a good meal, it'd be, you know, it's hard to get them out to the farm, but maybe one time they'd be the best meal."}, {"time": 5375, "text": "For me, like it's the ingredients that I associate with like indulgence, like be fresh bread with like my favorite cultured butter on it, be food of my childhood."}, {"time": 5386, "text": "I grew up in Oregon."}, {"time": 5387, "text": "We always had salmon and I smoked salmon or salmon eggs, like really good salmon eggs."}, {"time": 5391, "text": "I love cheese."}, {"time": 5392, "text": "I love goat cheese."}, {"time": 5393, "text": "I love all kinds of cheese."}, {"time": 5394, "text": "There'd be cheese."}, {"time": 5395, "text": "I love meat, obviously."}, {"time": 5396, "text": "I'm imagining it's sort of like an abundance of like 10 things I love."}, {"time": 5400, "text": "It's not a dish."}, {"time": 5401, "text": "You know, it's like all the yummy things."}, {"time": 5402, "text": "All of your indulgences on the same plate, yeah."}, {"time": 5404, "text": "And there isn't like, for me, there's not like a big cake or something super like that."}, {"time": 5408, "text": "It's like really yummy things that I love, like really fresh, crusty, delicious bread that's warm and it's got a bunch of butter on it and I can put some salt on it and eat a big slab of that."}, {"time": 5417, "text": "That's just, that's where I'm at."}, {"time": 5420, "text": "And so meat to you is not like one of those indulgences?"}, {"time": 5425, "text": "There'd definitely be steak there too."}, {"time": 5426, "text": "I'm just imagining not like there isn't a specific dish."}, {"time": 5428, "text": "It's like eight or 10 things, right?"}, {"time": 5430, "text": "It's the fresh bread."}, {"time": 5431, "text": "It's something like fishy, yummy, probably be really good fresh berries too."}, {"time": 5436, "text": "There'd be a steak or a pork chop or something like meaty and delicious and savory."}, {"time": 5442, "text": "There'd be some cheese, just a bunch of different things that I love to eat that like all kind of check boxes for me is probably what would make me happiest."}, {"time": 5449, "text": "I'm afraid of variety."}, {"time": 5451, "text": "I like the focus when you can just, this is all you have, the scarcity of just this is the one ingredient and really appreciating it or maybe one thing, like one full complex flavor, whatever the heck that is."}, {"time": 5466, "text": "It's like the distraction, the serial dating nature of having a bunch of things on a plate is, yeah, for some reason that prevents me from fully enjoying any one of them."}, {"time": 5480, "text": "The more healthy way to do it is the variety."}, {"time": 5483, "text": "Your way is the healthier way to do it."}, {"time": 5485, "text": "Is alcohol involved?"}, {"time": 5487, "text": "I don't drink very much."}, {"time": 5489, "text": "I like red wine, but I just don't really, I love red wine with good food."}, {"time": 5497, "text": "I also cofounded a rum business that's an organic rum, so I love that product, but that's not, for me, it's like I'm more interested in the food, I'd say."}, {"time": 5509, "text": "Is there some connection between your chef life, cooking and music?"}, {"time": 5514, "text": "Does this music have a role in the experience?"}, {"time": 5517, "text": "I love artistic expression, and that's always had a role in my life in the same way I love to paint and draw and all the different things."}, {"time": 5525, "text": "I was a professional musician when I lived in Sicily, by definition, technicality, because I played in the municipal band."}, {"time": 5534, "text": "So I would march around the town with all the funerals."}, {"time": 5539, "text": "I get like 50 euro every time I'd march in a funeral playing my oboe, so it's given me, I like that because I like to, like you were talking about going to farms, like what I quested for was experience and connection, in places where I could learn things."}, {"time": 5552, "text": "That's been the through line of my learning journey."}, {"time": 5554, "text": "I've learned things and sought knowledge that I can't get in any conventional learning environment, and so what are the tools that let me do that?"}, {"time": 5562, "text": "It was like being adaptable and comfortable in different cultures, but also having common ground points that allow you to connect with people, so music's one of those things."}, {"time": 5572, "text": "So I love music, but I also, there's any number of enjoy of food, being able to pitch in and help in the kitchen, you know, like cards, like those are when you're dealing with getting into like farming communities and stuff, that stuff really helps, right?"}, {"time": 5586, "text": "So I basically have cultivated tools that let me drop into places where I can learn, and so those are all kind of a piece."}, {"time": 5594, "text": "Those are just tools to get in there."}, {"time": 5595, "text": "That said, we did listen to Justin Bieber earlier today."}, {"time": 5599, "text": "I need to get more into him."}, {"time": 5600, "text": "I need to understand the full complexity of the Biebs."}, {"time": 5603, "text": "You're trying to achieve what hunting stands for, but at a much larger scale, which is what kind of Belcampo stands for, but what are your thoughts on hunting as a source of meat?"}, {"time": 5612, "text": "It's amazing, 100% pro hunting."}, {"time": 5615, "text": "I think the reason that hunting flips the switch for so many people is because it's the first thing they've had clean meat in their lives."}, {"time": 5626, "text": "Okay, so I think that the hunter's journey, when people get so turned on by hunting, they're just like, oh my God, I'm never going back."}, {"time": 5725, "text": "I love that people are getting excited about game, because it's better for your health, it's got all the same characteristics as regenerative farmed meat, and it gets people turned on to simple, delicious food."}, {"time": 5741, "text": "You know, you shouldn't have to cover food with sauce that's got corn syrup and soy, a bunch of junk in it to make it palatable."}, {"time": 5751, "text": "If you gotta put sauce on your food, you need to look at your ingredients."}, {"time": 5754, "text": "You need to revisit what you're starting from, because if you have to put a bunch of things to mask flavor onto anything you're eating, you're trying to basically fool your palate into doing what's not best for your body."}, {"time": 5767, "text": "We're trying to tell our palates, like, just make it through this plate so you can get the calories in, and we're masking the fact that we don't actually find it very appetizing."}, {"time": 5775, "text": "So we're kind of teaching ourselves to overcome our instinct with food."}, {"time": 5781, "text": "We're saying, here's this kind of bland base substrate, not very interesting, I'm not like sparking to it."}, {"time": 5787, "text": "Awesome, put sugar and salt on it."}, {"time": 5789, "text": "This up the hyperprocess flavor profile."}, {"time": 5791, "text": "Great, done."}, {"time": 5792, "text": "And then you're sparked to it."}, {"time": 5794, "text": "That's a very short road, and that's, I think, a lot of the health problems we have now is because we're masking flavors and basically trying to get ourselves to move down this path of the same way we behave around all hyperprocess foods."}, {"time": 5806, "text": "And that gets us into a mess with our health."}, {"time": 5809, "text": "So if we can get things like game where people love the flavor out of the gate, but it's natural, simple, mentally processed, that's a win."}, {"time": 5816, "text": "Yeah, it reverses that hyperprocessing trend that we're on as a human species."}, {"time": 5823, "text": "And that's the promise of regenerative farming, that's the promise of hunting."}, {"time": 5828, "text": "Obviously, the former can be scaled, the hunting, I think, cannot be scaled, right?"}, {"time": 5834, "text": "But in many ways, the hunting inspires the world that this is the right way to eat."}, {"time": 5840, "text": "And that naturally leads to then the humane farming, regenerative farming idea, which is this idea that hunting represents."}, {"time": 5851, "text": "How do you scale that?"}, {"time": 5853, "text": "Well, if you look at, we're talking about people use this sort of marketing language of happy cows or that kind of thing."}, {"time": 5859, "text": "You're talking about the happiest animals, it's wild animals, right?"}, {"time": 5862, "text": "So if you wonder why these practices are good, talk to hunters."}, {"time": 5866, "text": "You're talking about animals that have lived in their evolutionary capacity, right?"}, {"time": 5870, "text": "Who have played their role in the ecosystem, who've lived their meaning of life, right?"}, {"time": 5874, "text": "And that's a very powerfully different kind of role than livestock production."}, {"time": 5880, "text": "So I think if we can make our livestock production as similar to wild as possible, then we're a lot of steps closer."}, {"time": 5887, "text": "So you said the animals are happiest in the wild and that's where they find meaning."}, {"time": 5892, "text": "What about us, the human animal?"}, {"time": 5894, "text": "What's the meaning for us, do you think?"}, {"time": 5897, "text": "You've monitored the life cycle of a lot of living beings."}, {"time": 5901, "text": "You ever look in the mirror and think like, why the hell are we humans here?"}, {"time": 5907, "text": "I mean, thriving, reducing suffering, creating goodness."}, {"time": 5912, "text": "I mean, those are the things I see in animals behavior."}, {"time": 5916, "text": "They're mostly interested in reducing suffering and nurturing, right?"}, {"time": 5922, "text": "Those are the things that I think evolutionarily."}, {"time": 5925, "text": "And we humans are just clever and we wanna be able to try to do that at a bigger and bigger scale."}, {"time": 5931, "text": "As much as possible, reduce the suffering in the world."}, {"time": 5935, "text": "And somehow that alleviates us of our own suffering."}, {"time": 5938, "text": "That's the Russian thing, life is suffering and somehow helping others alleviates it and come up with creative solutions to do that."}, {"time": 5951, "text": "It's almost consciousness is the thing that led to suffering, but it also led to the desire to alleviate the suffering."}, {"time": 5959, "text": "It's a feedback loop."}, {"time": 5963, "text": "Consciousness creates suffering and the desire to alleviate it."}, {"time": 5967, "text": "Is there yet a pretty nonlinear life?"}, {"time": 5970, "text": "Your parents were professors."}, {"time": 5972, "text": "You have done a lot of sort of incredible things that many would say kind of like, how the hell are you gonna get this done?"}, {"time": 5980, "text": "Is there advice you can give to young people today, like high school, college, about how to do, how to live a similarly nonlinear crazy life and accomplish, be as successful as you have been about whether it's just their career or life in general?"}, {"time": 5999, "text": "The greatest gifts I've been given have come from pursuing curiosity."}, {"time": 6010, "text": "Just trying to understand the thing you're curious about and allowing yourself to be curious about it and just going with it."}, {"time": 6016, "text": "And also pursuing things that are like deeply joyful for me."}, {"time": 6023, "text": "Not what society wants, but you just personally, just on your own, you're happy that you did it."}, {"time": 6027, "text": "And that's something that in the times when I strayed from that, my life has been harder."}, {"time": 6033, "text": "So it's fundamentally, what are we on earth to do?"}, {"time": 6037, "text": "To live and thrive."}, {"time": 6039, "text": "And so pursuing things that are curious and satisfying and interesting and joyful and allow me to grow."}, {"time": 6050, "text": "So I made a number of choices to do things that were more complicated and not considered cool at the time."}, {"time": 6062, "text": "Although now it's cool to work on farms."}, {"time": 6063, "text": "It wasn't when I started my career in animal agriculture."}, {"time": 6066, "text": "And it was like, but just deeply interesting to me."}, {"time": 6070, "text": "And I felt like there was just lots to learn."}, {"time": 6072, "text": "And so that's been the path for me is like going for something that's curious and hard and sticking with it and being open to it."}, {"time": 6080, "text": "And growing elements that give me joy through that."}, {"time": 6085, "text": "So I also, for people who are starting out in their careers and want to do something different too, it's like, get out of your comfort."}, {"time": 6093, "text": "Go to a place that you've got something to learn from and let it teach you that."}]}]