[{"title": "Richard Wrangham: Violence, Sex, and Fire in Human Evolution | Lex Fridman Podcast #229", "id": "YJF01_ztxwY", "quotes": [{"time": 406, "text": "But if in fact they do find a lone individual and they can sneak up to them, then they make a deliberate attack."}, {"time": 415, "text": "They're hunting, they're stalking and hunting, and then they impose terrible damage, which typically ends in a kill straight away, but it might end up with the victim so damaged that they'll crawl away and die a few days or hours later."}, {"time": 433, "text": "So that was a very dramatic discovery because it really made people realize for the first time that Conrad Lorentz had been wrong when in the 1960s, in his famous book, On Aggression, he said, warfare is restricted to humans."}, {"time": 450, "text": "Animals do not deliberately kill each other."}, {"time": 453, "text": "Well, now we know that actually there's a bunch of animals that deliberately kill each other, and they always do so under essentially the same circumstances, which is when they feel safe doing it."}, {"time": 464, "text": "So humans feel safe doing it when they got a weapon."}, {"time": 468, "text": "Animals feel safe when they have a coalition."}, {"time": 472, "text": "A coalition that has overwhelming power compared to the victim."}, {"time": 476, "text": "And so wolves will do that, and lions will do that, and hyenas will do that, and chimpanzees will do it, and humans do it too."}, {"time": 485, "text": "Can they pull themselves into something that looks more like a symmetric war as opposed to an asymmetric one?"}, {"time": 492, "text": "So accidentally engaging on the lone individual and then getting themselves into trouble?"}, {"time": 497, "text": "Or are they more aggressive in avoiding these kinds of battles?"}, {"time": 501, "text": "No, they're very, very keen to avoid those kinds of battles, but occasionally, they can make a mistake."}, {"time": 508, "text": "But so far, there have been no observations of anything like a battle in which both sides maintain themselves."}, {"time": 517, "text": "And I think you can very confidently say that overwhelmingly what happens is that if they discover that there's several individuals on the other side, then both sides retreat."}, {"time": 528, "text": "Nobody wants to get hurt."}, {"time": 530, "text": "What they want to do is to hurt others."}, {"time": 532, "text": "So you mentioned Jane Goodall."}, {"time": 534, "text": "You've worked with her."}, {"time": 536, "text": "What was it like working with her?"}, {"time": 538, "text": "What have you learned from her?"}, {"time": 541, "text": "Well, she's a wonderfully independent, courageous person who she famously began her studies not as a qualified person in terms of education, but qualified only by enthusiasm and a considerable experience, even in her early 20s, with nature."}, {"time": 564, "text": "So she's courageous in the sense of being able to take on challenges."}, {"time": 570, "text": "The thing that is very impressive about her is her total fidelity to the observations, very unwilling to extend beyond the observations, waiting until they mount up and you've really got a confident picture, and tremendous attention to individuals."}, {"time": 593, "text": "So that was an interesting problem from her point of view because when she got to know the chimpanzees of Gombe, this particular community of Kazakus, this particular community of Kazakela, about 60 individuals, so Gombe was in Tanzania on Lake Tanganyika."}, {"time": 614, "text": "She was there initially with her mother and then alone for two or three years of really intense observation and then slowly joined by other people."}, {"time": 663, "text": "Well now, whatever it is, 60 years later, the study of personalities is a very rich part of the study of animal behavior."}, {"time": 674, "text": "At any rate, the important point in terms of what was she like is that she stuck to her guns and she absolutely insisted that we have to show, describe in great detail the differences in personality among these individuals and then you can leave it to the evolutionary biologists to think about what it means."}, {"time": 692, "text": "So what is the process of observation like this like?"}, {"time": 697, "text": "Observing the personality but also observing in a way that's not projecting your beliefs about human nature or animal nature onto chimps, which is probably really tempting to project."}, {"time": 712, "text": "So your understanding of the way the human world works, projecting that onto the chimp world."}, {"time": 719, "text": "Yes, I mean, it's particularly difficult with chimps because chimps are so similar to humans in their behavior that it's very easy to make those projections, as you say."}, {"time": 730, "text": "The process involves making very clear definitions of what a behavior is."}, {"time": 738, "text": "Aggression can be defined in terms of a forceful hit, a bite, and so on, and writing down every time these things happen and then slowly totting up the numbers of times that they happen from individual A towards individuals B, C, D, and E, so that you build up a very concrete picture rather than interpreting at any point and stopping and saying, well, they seem to be rather aggressive."}, {"time": 768, "text": "So the sort of formal system is that you build up a pattern of the relationships based on a description of the different types of interactions, the aggressive and the friendly interactions, and all of these are defined in concrete."}, {"time": 787, "text": "And so from that, you extract a pattern of relationships."}, {"time": 792, "text": "And the relationships can be defined as relatively friendly, relatively aggressive, competitive, based on the frequency of these types of interactions."}, {"time": 807, "text": "And so one can talk in terms of individuals having a relationship which, on the scores of friendliness, is two standard deviations outside the mean."}, {"time": 819, "text": "I mean, you know, it's..."}, {"time": 820, "text": "In which direction, sorry, both directions?"}, {"time": 825, "text": "Well, I mean, that would be, obviously, the friendly ones would be the ones who have exceptionally high rates of spending time close to each other, of touching each other in a gentle way, of grooming each other, and, by the way, finding that those things are correlated with each other."}, {"time": 843, "text": "So it's possible to define a friendship with a capital F in a very systematic way, and to compare that between individuals, but also between communities of chimpanzees and between different species."}, {"time": 861, "text": "So that, you know, we can say that in some species, individuals have friends, and others, they don't at all."}, {"time": 866, "text": "What about just, because there's different personalities and because they're so fascinating, what about sort of falling in love or forming friendships with chimps, you know?"}, {"time": 877, "text": "Like really, you know, connecting with them as an observer?"}, {"time": 886, "text": "Because you're tracking these individuals that are full of life and intelligence for long periods of time."}, {"time": 893, "text": "Plus, as a human, especially in those days for Jane, she's alone, observing it."}, {"time": 900, "text": "It gets lonely as a human."}, {"time": 902, "text": "I mean, probably deeply lonely as a human being, observing these other intelligent species."}, {"time": 907, "text": "It's a very reasonable question, and of course, Jane, in those early years, I think she's willing now to talk about the fact that she regrets, to some extent, how close she became."}, {"time": 919, "text": "And the problem is not just from the humans."}, {"time": 923, "text": "The problem is from the chimpanzees as well, because they do things that are extremely affectionate, if you like."}, {"time": 932, "text": "You know, at one point, Jane offered a ripe fruit to a chimpanzee called David Greybeard."}, {"time": 942, "text": "David Greybeard took it and squeezed her hand, as if to say thank you."}, {"time": 948, "text": "And then I think he gave it back, if I remember rightly."}, {"time": 957, "text": "Oh, it's almost like thank you and returning the affection by giving the fruit."}, {"time": 963, "text": "If they did something like that."}, {"time": 964, "text": "Yeah, no, it was a gentle squeeze."}, {"time": 965, "text": "I mean, chimpanzees could squeeze you very hard, as occasionally has happened."}, {"time": 971, "text": "Some chimps are aggressive to people, and others are friendly."}, {"time": 976, "text": "And the ones that are friendly tend to be rather sympathetic characters, because they might be ones who are having problems in their own society."}, {"time": 986, "text": "You know, so Joe Mio in Gombe used to come and sit next to me quite often, and he was having a hard time making it in that society, which I can describe to you in terms of the number of aggressive interactions, if you want, you know, but just to be informed about it."}, {"time": 1003, "text": "So all of this is a temptation to be very firmly resisted."}, {"time": 1009, "text": "And in the community that I've been working with in Uganda for the last 30 years, we try extremely hard to impress on all of the research students who come with us, that it is absolutely vital that you do not fall into that temptation."}, {"time": 1022, "text": "Now, you know, we heard a story of one person who did reach out and touch one of our chimps."}, {"time": 1029, "text": "It's a very, very bad idea."}, {"time": 1032, "text": "Not because the chimp is going to do anything violent at the time, but because if they learn that humans are as weak physically as we are compared to them, then they can take advantage of us."}, {"time": 1048, "text": "And that's what happened in Gombe."}, {"time": 1050, "text": "So after Jane had done the very obvious thing when you're first engaged in this game of allowing the infants to approach her and then tickling them and playing with them, some of those infants had the personality of wanting to take advantage of that knowledge later."}, {"time": 1073, "text": "And so, you know, you had an individual, Frodo, who was violent on a regular basis towards humans when he was an adult, and he was quite dangerous."}, {"time": 1081, "text": "I mean, he could easily have killed someone."}, {"time": 1082, "text": "In fact, he did kill one person."}, {"time": 1085, "text": "He killed a baby that he took from a mother, a human baby, that he took off her hip when he met her on the path."}, {"time": 1095, "text": "So it's a reminder that we're dealing with a species that are rather humanlike in the range of emotions they have, in the capacities they have, and even in the strength they have, they are in many ways stronger than humans."}, {"time": 1113, "text": "So you've got to be careful."}, {"time": 1117, "text": "So in the full range of friendliness and violence, the capacity for these very human things."}, {"time": 1124, "text": "Yes, I mean, it's very obvious with violence, as we talked about, that they will kill."}, {"time": 1130, "text": "They will kill not just strangers."}, {"time": 1133, "text": "They can kill other adults within their own group."}, {"time": 1137, "text": "They can kill babies that are strangers."}, {"time": 1139, "text": "They can kill babies in their own group."}, {"time": 1141, "text": "So, you know, this is a long lived individual."}, {"time": 1144, "text": "Obviously, these killings can't have very often because otherwise they'd all be dead."}, {"time": 1149, "text": "And we're now finding that they can live to 50 or 60 years in the wild at relatively low population density because they're big animals eating a rather specialized kind of food, the ripe fruits."}, {"time": 1162, "text": "So it doesn't happen all the time."}, {"time": 1163, "text": "With friendliness, they are very strong to support each other."}, {"time": 1168, "text": "They very much depend on their close friendships, which they express through physical contact and particularly through grooming."}, {"time": 1181, "text": "So grooming occurs when one individual approaches another."}, {"time": 1185, "text": "I might present for grooming, a very common way of starting, turning their back or presenting an arm or something like that, and the other just riffles their fingers through the hair."}, {"time": 1197, "text": "And that's partly just soothing and it's partly looking for parasites, but mostly it's just soothing."}, {"time": 1206, "text": "And the point about this is it can go on for half an hour, it can go on for sometimes even an hour."}, {"time": 1215, "text": "So this is a major expression of interest in somebody else."}, {"time": 1221, "text": "When did your interest in this one particular aspect of Chim come to be, which is violence?"}, {"time": 1228, "text": "When did the study of violence in chimps become something you're deeply interested in?"}, {"time": 1235, "text": "Well, for my PhD in the early 1970s, I was in Gombe with Jane Goodall and was studying feeding behavior."}, {"time": 1246, "text": "But during that time, we were seeing, and I say we because there were half a dozen research students all in her camp, we were discovering that chimps had this capacity for violence."}, {"time": 1262, "text": "The first kill happened during that time, which was of an infant in a neighboring group."}, {"time": 1269, "text": "And we were starting to see these hunting expeditions."}, {"time": 1273, "text": "And this was the start of my interest because it was such chilling evidence of an extraordinary similarity between chimps and humans."}, {"time": 1283, "text": "Now, at that time, we didn't know very much about how chimpanzees and humans were related."}, {"time": 1293, "text": "Chimps, gorillas, bonobos are all three big black hairy things that live in the African forests and eat fruits and leaves when they can't find fruits and walk on their knuckles."}, {"time": 1307, "text": "And they all look rather similar to each other."}, {"time": 1309, "text": "So they seem as though they're very similar so they seem as though those three species, chimps and gorillas and bonobos, should all be each other's closest relatives and humans are something rather separate."}, {"time": 1321, "text": "And so any of them would be of interest to us."}, {"time": 1324, "text": "Subsequently, we learn that actually that's not true and that there's a special relationship between humans and chimpanzees."}, {"time": 1333, "text": "But at the time, even without knowing that, it was obvious that there was something very odd about chimpanzees because Jane had discovered they were making tools."}, {"time": 1345, "text": "She had seen that they were hunting meat."}, {"time": 1349, "text": "She had seen that they were sharing the meat among each other."}, {"time": 1353, "text": "She had seen that the societies were dominated politically by males, coalitions of males."}, {"time": 1358, "text": "All of these things, of course, resonate so closely with humans."}, {"time": 1363, "text": "And then it turns out that in contrast to conventional wisdom at the time, the chimpanzees were capable of hunting and killing members of neighboring groups."}, {"time": 1376, "text": "Well, at that point, the similarities between chimps and humans become less a matter of sort of sheer intellectual fascination than something that has a really deep meaning about our understanding of ourselves."}, {"time": 1394, "text": "I mean, until then, you can cheerfully think of humans as a species apart from the rest of nature because we are so peculiar."}, {"time": 1403, "text": "But when it turns out that, as it turns out, one of our two closest relatives has got these features that we share and that one of the features is something that is the most horrendous, as well as fascinating, aspect of human behavior, then how can you resist just trying to find out what's going on?"}, {"time": 1429, "text": "So I have to say this."}, {"time": 1430, "text": "I'm not sure if you're familiar with a man, but fans of this podcast are."}, {"time": 1435, "text": "So we're talking about chimps, we're talking about violence."}, {"time": 1439, "text": "My now friend, Mr. Joe Rogan, is a big fan of those things."}, {"time": 1443, "text": "I'm a big fan of these topics."}, {"time": 1445, "text": "I think a lot of people are fascinated by these topics."}, {"time": 1449, "text": "So as you're saying, why do we find the exploration of violence and the relations between chimps so interesting?"}, {"time": 1460, "text": "What can they teach us about ourselves?"}, {"time": 1466, "text": "Until we had this information about chimpanzees, it was possible to believe that the psychology behind warfare was totally the result of some kind of recent cultural innovation."}, {"time": 1489, "text": "It had nothing to do with our biology."}, {"time": 1492, "text": "Or if you like, that it's got something to do with sin and God and the devil and that sort of thing."}, {"time": 1499, "text": "But what the chimps tell us after we think carefully about it is that it seems undoubtedly the case that our evolutionary psychology has given us the same kind of attitude towards violence as has occurred in chimpanzees and in both species."}, {"time": 1527, "text": "It has evolved because of its evolutionary significance."}, {"time": 1532, "text": "In other words, because it's been helpful to the individuals who have practiced it."}, {"time": 1537, "text": "And now we know that, as I mentioned, other species do this as well."}, {"time": 1544, "text": "In fact, wolves, which this is a really kind of ironical observation, Conrad Lorentz, who I mentioned had been the person who thought that human aggression in the form of killing members of our own species was unique to our species, he was a great fan of wolves."}, {"time": 1565, "text": "He studied wolves."}, {"time": 1567, "text": "And in captivity, he noted that wolves are very unlikely to harm each other in spats among members of the same group."}, {"time": 1577, "text": "What happens is that one of them will roll over and present their neck, much as you see in a dog park nowadays, and the other might put their jaws on the neck but will not bite."}, {"time": 1587, "text": "Okay, so now it turns out that if you study wolves in the wild, then neighboring packs often go hunting for each other, they are in fierce competition, and as much as 50% of the mortality of wolves is due to being killed by other wolves, adult mortality."}, {"time": 1608, "text": "So it's a really serious business."}, {"time": 1610, "text": "The chimpanzees and humans fit into a larger pattern of understanding animals in which you don't have an instinct for violence, what you have is an instinct, if you like, to use violence adaptively."}, {"time": 1626, "text": "And if the right circumstances come up, it'll be adaptive, if the right circumstances don't come up, it won't be."}, {"time": 1633, "text": "So some chimpanzee communities are much more violent than others because of things like the frequency with which a large party of males is likely to meet a lone victim, and that's going to depend on the local ecology."}, {"time": 1651, "text": "But, you know, so the overall answer to the question of what do chimps teach us is that we have to take very seriously the notion that in humans, the tendency to make war is a consequence of a long term evolutionary adaptation and not just a military ideology or some sort of local patriarchal phenomenon."}, {"time": 1678, "text": "And of course, you know, a reading of history, a judicious reading of history fits that very easily because war is so commonplace."}, {"time": 1688, "text": "It's not an accident, so it's not a constraint."}, {"time": 1691, "text": "It's not an accident, so it's not a construction of human civilization."}, {"time": 1694, "text": "It's deeply within us, violence."}, {"time": 1697, "text": "So what's the difference between violence on the individual level versus group is, it seems like with chimps and with wolves, there's something about the dynamic of multiple chimps together that increase the chance of violence."}, {"time": 1716, "text": "Or is violence still fundamentally part of the individual?"}, {"time": 1721, "text": "Like would an individual be as violent as they might be as part of a group?"}, {"time": 1727, "text": "If we're talking about killing, then violence in the sense of killing is very much associated with a group."}, {"time": 1739, "text": "And the reason is that individuals don't benefit by getting into a fight in which they risk being hurt themselves."}, {"time": 1748, "text": "So it's only when you have overwhelming power that the temptation to try and kill another victim rises sufficiently for them to be motivated to do it."}, {"time": 1763, "text": "The average number of chimpanzee males that attack a single male in something like 50 observations that have accumulated in the last 50 years from various different study sites is eight, eight to one."}, {"time": 1781, "text": "Now, sometimes it can go as low as three to one, but that's getting risky."}, {"time": 1789, "text": "But if you have eight, you can see what can happen."}, {"time": 1791, "text": "I mean, basically you have one male on one foot, another male on another foot, another male on an arm, another male on another arm."}, {"time": 1799, "text": "Now you have an immobilized victim with four individuals capable of just doing the damage."}, {"time": 1806, "text": "And so they can then move in and tear out his thorax and tear off his testicles and twist an arm until it breaks and do this appalling damage with no weapons."}, {"time": 1818, "text": "What is the way in which they prefer to commit the violence?"}, {"time": 1823, "text": "Is there something to be said about the actual process of it?"}, {"time": 1827, "text": "Is there an artistry to it?"}, {"time": 1829, "text": "So if you look at human warfare, there's different parts in history prefer different kind of approaches to violence."}, {"time": 1837, "text": "It had more to do with tools, I think, on the human side."}, {"time": 1841, "text": "But just the nature of violence itself, sorry, the practice, the strategy of violence, is it basically the same?"}, {"time": 1849, "text": "You improvise, you immobilize the victim, and they just rip off different parts of their body kind of thing?"}, {"time": 1856, "text": "Yeah, you have to understand that these things are happening at high speed in thick vegetation, mostly, so that they have not been filmed carefully."}, {"time": 1868, "text": "We have a few little glimpses of them from one or two people like David Watts, who's got some great video, but we don't know enough to be able to say that."}, {"time": 1879, "text": "It's hard for me to imagine that there are styles that vary between communities, cultural styles, but it is possible."}, {"time": 1888, "text": "It is possible, and one thing that is striking is that the number of times that an individual victim has been killed immediately has been higher in Kibale forest in Uganda than in Gombe National Park in Tanzania."}, {"time": 1908, "text": "It's conceivable that's just chance."}, {"time": 1910, "text": "We don't have real numbers now, but what is this?"}, {"time": 1914, "text": "I can't remember the exact numbers, but 10 versus 15 or something."}, {"time": 1920, "text": "So maybe they damaged to the point of expecting a death in one place and they just finished it off in the other, but most likely that sort of difference will be due to differences in the numbers of attackers."}, {"time": 1936, "text": "You know, human beings are able to conceive of the philosophical notion of death, of mortality."}, {"time": 1943, "text": "Is there any of that for chimps when they're thinking about violence?"}, {"time": 1950, "text": "Is violence, like what is the nature of their conception of violence, do you think?"}, {"time": 1956, "text": "Do they realize they're taking another conscious being's life or is it some kind of like optimization over the use of resources or something like that?"}, {"time": 1968, "text": "I don't think it's, I can't think of any way to get an answer to the question of what they know about that."}, {"time": 1978, "text": "I think that the way to think about the motivation is rather like the motivation in sex."}, {"time": 1989, "text": "So when males are interested in having sex with a female, whether it's in chimpanzees or in humans, they don't think about the fact that what this is going to do is to lead to a baby, mostly."}, {"time": 2006, "text": "Mostly what they're thinking about is, I wanna get my end away."}, {"time": 2009, "text": "And I think that it's a similar kind of process with the chimps."}, {"time": 2015, "text": "What they are thinking about is, I wanna kill this individual."}, {"time": 2021, "text": "And it's hard to imagine that taking the other individual's perspective and thinking about what it means for them to die is gonna be an important part of that."}, {"time": 2031, "text": "In fact, there's reasons to think it should not be an important part of it because it might inhibit them and they don't want to be inhibited."}, {"time": 2037, "text": "The more efficient they are in doing this, the better."}, {"time": 2041, "text": "But I think it's interesting to think about this whole motivational question because it does produce this rather haunting thought that there has been selection in favor of enthusiasm about killing."}, {"time": 2056, "text": "And in our relatively gentle and deliberately moral society that we have today, it's very difficult for us to face the thought that in all of us, there might've been residue and more than that, sort of an active potential for that thought of really enjoying killing someone else."}, {"time": 2087, "text": "But I think one can sustain that thought fairly obviously by thinking of circumstances in which it would be true that the ordinary human male would be delighted to be part of a group that was killing someone."}, {"time": 2106, "text": "What you've got to do is to be in a position where you're regarding the victim as dangerous and thoroughly hostile."}, {"time": 2117, "text": "But the pure enjoyment of violence."}, {"time": 2121, "text": "There's, I don't know if you know this historian, Dan Carlin, he has a podcast."}, {"time": 2125, "text": "He has an episode, three, four hour episode that I recommend to others."}, {"time": 2133, "text": "It's quite haunting."}, {"time": 2134, "text": "But he takes us through an entire history."}, {"time": 2138, "text": "It's called painfotainment."}, {"time": 2140, "text": "The history of humans enjoying the murder of others in a large group."}, {"time": 2148, "text": "So like public executions were long part of human history."}, {"time": 2153, "text": "And there's something that for some reason, humans seem to have been drawn to just watching others die."}, {"time": 2163, "text": "And he ventures to say that that may still be part of us."}, {"time": 2166, "text": "For example, he said if it was possible to televise, to stream online for example, the execution and the murder of somebody or even the torture of somebody, that a very large fraction of the population on earth would not be able to look away."}, {"time": 2184, "text": "They'd be drawn to that somehow."}, {"time": 2186, "text": "As a very dark thought that we were drawn to that."}, {"time": 2191, "text": "So you think that's part of us in there somewhere."}, {"time": 2193, "text": "That selection that we evolved for the enjoyment of killing and the enjoyment of observing those in our tribe doing the killing."}, {"time": 2208, "text": "Yes, I mean, and that word you produced at the end is critical I think."}, {"time": 2212, "text": "Because it would be a little bit weird I think to imagine a lot of enjoyment about people in your own tribe being killed."}, {"time": 2224, "text": "I don't think we're interested in violence for violence's sake that much."}, {"time": 2229, "text": "It's when you get these social boundaries set up."}, {"time": 2235, "text": "And in today's world, happily, we kind of are already one world."}, {"time": 2243, "text": "You have to dehumanize someone to get to the point where they are really outside our recognition of a tribe at some level, which is the whole human species."}, {"time": 2257, "text": "But in ancient times, that would not have been true."}, {"time": 2261, "text": "Because in ancient times, there are lots of accounts of hunters and gatherers in which the appearance of a stranger would lead to an immediate response of shooting on sight."}, {"time": 2276, "text": "Because what was human was the people that were in your society."}, {"time": 2281, "text": "And the other things that actually looked like us and were human in that sense, were not regarded as human."}, {"time": 2289, "text": "So there was a kind of automatic dehumanization of everybody that didn't speak our language or hadn't already somehow become recognized as sufficiently like us to escape the dehumanization contact."}, {"time": 2307, "text": "And so hopefully the story of human history is that tribalism fades away, that our dehumanization, the natural desire to dehumanize or tendency to dehumanize groups that are not within this tribe, decreases over time."}, {"time": 2325, "text": "And so then the desire for violence decreases over time."}, {"time": 2329, "text": "Yeah, I mean, that's the optimistic perspective."}, {"time": 2332, "text": "And the great sort of concern, of course, is that small conflicts can build up into bigger conflicts and then dehumanization happens and then violence is released."}, {"time": 2344, "text": "As Hannah Arendt says, there currently is no known alternative to war as a means of settling really important conflicts."}, {"time": 2356, "text": "So if we look at the big picture, what role has violence or do you think violence has played in the evolution of Homo sapiens?"}, {"time": 2364, "text": "So we are quite an intelligent, quite a beautiful, particular little branch on the evolutionary tree."}, {"time": 2372, "text": "What part of that was played by our tendency to be violent?"}, {"time": 2381, "text": "Well, I think that violence was responsible for creating your Homo sapiens."}, {"time": 2389, "text": "And that raises the question of what Homo sapiens is."}, {"time": 2398, "text": "So nowadays people begin the concept of what Homo sapiens is by thinking about features that are very obviously different from all of the other species of Homo."}, {"time": 2415, "text": "And our large brain, our very rounded cranium, our relatively small face, these are characteristics which are developed in a relatively modern way by about 170,000 years ago."}, {"time": 2431, "text": "So that's one of the earliest skulls in Africa that really captures that."}, {"time": 2436, "text": "But it has been argued that that is an episode in a process that has been started substantially earlier."}, {"time": 2450, "text": "And there's no doubt that that's true."}, {"time": 2452, "text": "Homo sapiens is a species that has been changing pretty continuously throughout the length of time it's there."}, {"time": 2460, "text": "And it goes back to 300,000 years ago, 315 literally is the time, the best estimate of a date for a series of bones from Morocco that have been dated three or four years ago at that time and have been characterized as earliest Homo sapiens."}, {"time": 2481, "text": "Now at that point, they are only beginning the trend of sapionization."}, {"time": 2487, "text": "And that trend consists basically of gracilization of making our ancestors less robust, shorter faces, smaller teeth, smaller brow ridge, narrower face, thinner cranium, all these things that are associated with reduced violence."}, {"time": 2511, "text": "Okay, so that's saying what, that's Homo sapiens beginning."}, {"time": 2516, "text": "So it began sometime three to 400,000 years ago because by 315,000 years ago, you've already got something recognizable."}, {"time": 2523, "text": "So you're more on that side of things that those are this gradual process."}, {"time": 2526, "text": "It's not 150, 170,000 years ago."}, {"time": 2529, "text": "It started like 400,000 years ago and it's just."}, {"time": 2534, "text": "It started three to 400,000 years ago and if you look at 170, it's got even more like us."}, {"time": 2539, "text": "And then if you look at 100, it's got more like us again."}, {"time": 2543, "text": "And if you look at 50, it's more like us again."}, {"time": 2545, "text": "It's all the way, it's just getting more and more like the moderns."}, {"time": 2548, "text": "So the question is what happened between three and 400,000 years ago to produce Homo sapiens?"}, {"time": 2554, "text": "And I think we have a pretty good answer now."}, {"time": 2557, "text": "And the answer comes from violence."}, {"time": 2559, "text": "And the story begins by focusing on this question."}, {"time": 2563, "text": "Why is it that in the human species, we are unique among all primates in not having an alpha male in any group in the sense that what we don't have is an alpha male who personally beats up every other male?"}, {"time": 2620, "text": "That coalition."}, {"time": 2623, "text": "That's a really good picture of human society, yes."}, {"time": 2627, "text": "Okay, and that's the way all our societies work now."}, {"time": 2631, "text": "Because individuals try and be alpha and then they get taken out."}, {"time": 2635, "text": "Yeah, I mean, we don't usually think of ourselves as beta males, but yes, I suppose that's what democracy is."}, {"time": 2642, "text": "And that's the way we think of ourselves."}, {"time": 2644, "text": "I suppose that's what democracy is."}, {"time": 2649, "text": "Okay, so at some point alpha males get taken out."}, {"time": 2654, "text": "Well, what alpha males are are males who respond with high reactive violence to any challenge to their status."}, {"time": 2662, "text": "You see it all the time in primates."}, {"time": 2665, "text": "Some beta male thinks he's getting strong and maturing in wisdom and so on, and he refuses to kowtow to the alpha male."}, {"time": 2675, "text": "And the alpha male comes straight in and charges at him."}, {"time": 2679, "text": "Or maybe he'll just wait for a few minutes and then take an opportunity to attack him."}, {"time": 2688, "text": "All of these primates have got a high tendency for reactive aggression, and that enables the possibility of alpha males."}, {"time": 2697, "text": "We have this great reduction, as I talked about earlier."}, {"time": 2700, "text": "And the question is, when did that reduction happen?"}, {"time": 2704, "text": "Well, cut to the famous experiments by the Russian biologist Dmitry Belyaev, who tried domesticating wild animals."}, {"time": 2717, "text": "When you domesticate wild animals, what you're doing is reducing reactive aggression."}, {"time": 2724, "text": "You are selecting those individuals to breed who are most willing to be approached by a human or by another member of their own species and are least likely to erupt in reactive aggression."}, {"time": 2740, "text": "And you only have to do that for a few generations to discover that there are changes in the skull."}, {"time": 2747, "text": "And those changes consist of shorter face, smaller teeth, reduced maleness, the males become increasingly female like, and reduced brain size."}, {"time": 2761, "text": "Well, the changes that are characteristic of domesticated animals in general compared to wild animals are all found in Homo sapiens compared to our early ancestors."}, {"time": 2771, "text": "So it's a very strong signal that when we first see Homo sapiens, what we're seeing is that there's a lot of change in the shape of the animal."}, {"time": 2780, "text": "What we're seeing is evidence of a reduction in reactive aggression."}, {"time": 2786, "text": "And that suggests that what's happening with Homo sapiens is that that is the point at which there is selection against the alpha males."}, {"time": 2795, "text": "And therefore, the way in which the selection happened would have been the way it happens today."}, {"time": 2801, "text": "The beta males take them out."}, {"time": 2804, "text": "So I think that Homo sapiens is a species characterized by the suppression of reactive aggression as a kind of incidental consequence of the suppression of the alpha male."}, {"time": 2818, "text": "And the story of our species is the story of how the beta males took charge and have been responsible for the generation of a new kind of human."}, {"time": 2831, "text": "And incidentally, for imposing on the society a new set of values."}, {"time": 2843, "text": "Because when those beta males discovered that they could take out the previous alpha male and continue to do so, because in every generation there'll always be some male who says, maybe I'll become the alpha male."}, {"time": 2855, "text": "So they just keep chopping them down."}, {"time": 2858, "text": "In discovering that, they also obviously discovered that they could kill anybody in the group."}, {"time": 2864, "text": "Females, young males, anybody who didn't follow their values."}, {"time": 2871, "text": "And so this story is one in which the males of our species, and these would be the breeding males, have been able to impose their values on everybody else."}, {"time": 2885, "text": "And there is two kind of values."}, {"time": 2887, "text": "There's one kind of value is things that are good for the group."}, {"time": 2889, "text": "Like, thou shalt not murder."}, {"time": 2892, "text": "And the other kind of value is things that are good for the males."}, {"time": 2898, "text": "Such as, hey, guess what?"}, {"time": 2900, "text": "When good food comes in, males get it first."}, {"time": 2904, "text": "I mean, it's fascinating that that kind of set of ideals could outcompete the others."}, {"time": 2912, "text": "Do you have a sense of why, or maybe you can comment on Neanderthals and all the other early humans."}, {"time": 2918, "text": "Why did Homo sapiens come to succeed and flourish and all the other ones, all the other branches of evolution died out?"}, {"time": 2929, "text": "Or got murdered out."}, {"time": 2930, "text": "I mean, nowadays, when Homo sapiens meets Homo sapiens, and we don't know each other initially, then conflict breaks out and the more militarily able group wins."}, {"time": 2944, "text": "We've seen that everywhere throughout the age of exploration and throughout history."}, {"time": 2952, "text": "So I'm rather surprised."}, {"time": 2953, "text": "The conventional wisdom that you see nowadays in contemporary anthropology is very reluctant to point to success in warfare as the reason why sapiens wiped out Neanderthals within about 3000 years of the sapiens."}, {"time": 2973, "text": "Coming into Europe 43,000 years ago."}, {"time": 2977, "text": "And people are much more inclined to say, well, the Neanderthals were at low population density, so they just couldn't survive the demographic sort of sweep or the disease came in."}, {"time": 2992, "text": "And maybe those things might've been important, but far and away, the most obvious possibility is that sapiens were just, sapiens were just powerful."}, {"time": 3006, "text": "They had, everyone agrees they had larger groups."}, {"time": 3010, "text": "They had better weapons."}, {"time": 3012, "text": "They had projectile weapons, bows and arrows, to judge from the little microlith bits of flake, which the Neanderthals didn't."}, {"time": 3025, "text": "Nowadays, there's evidence of interbreeding, quite extensive interbreeding between sapiens and Neanderthals, as well as with some other groups."}, {"time": 3035, "text": "And sometimes people say, well, you know, so they loved each other."}, {"time": 3038, "text": "They made love, not war."}, {"time": 3040, "text": "I think they made love and war."}, {"time": 3042, "text": "And it wouldn't necessarily mean too loving."}, {"time": 3046, "text": "I mean, if you just follow through from typical ethnographies nowadays of when dominant groups meet subordinate groups, they didn't know each other, then you can imagine that Neanderthal females would essentially be captured and taken into sapiens groups."}, {"time": 3067, "text": "Maybe you can comment on this cautiously and eloquently."}, {"time": 3073, "text": "What's the role of sexual violence in human evolution?"}, {"time": 3078, "text": "Because you mentioned taking Neanderthal females."}, {"time": 3081, "text": "You've also mentioned that some of these rules are defined by the male side of the society."}, {"time": 3088, "text": "What's the role of sexual violence in this story?"}, {"time": 3093, "text": "I think you've got to distinguish between groups and within groups."}, {"time": 3097, "text": "And I think the world has been slowly waking up over the last several decades to the fact that sexual violence is routine in war."}, {"time": 3111, "text": "And that to me says that it's just another example of power corrupts because when frustrated, scared, elated soldiers come upon females in a group that has been essential dehumanization of, then they get carried away by opportunity."}, {"time": 3141, "text": "It is not always possible to argue that this is adaptive nowadays because you get lots and lots of stories of women being abused to the point of being killed."}, {"time": 3158, "text": "She'll be gang raped and then killed."}, {"time": 3161, "text": "There's lots of terrible cases of that reported from all sorts of different wars."}, {"time": 3169, "text": "But you can see that that could build on a pattern that would have been adaptive if happening under so much less extreme circumstances."}, {"time": 3182, "text": "The war is very extreme nowadays in the sense that you get battles in which people are sent by a military hierarchy into a war situation in which they do not feel what hunters and gatherers would typically have felt, which would have been that if we attack, we have an excellent chance of getting away with it."}, {"time": 3201, "text": "Nowadays, you're sent in across the Somme or whatever it is and there's a very high chance you will be killed."}, {"time": 3208, "text": "And that's totally unnatural and a novel evolutionary experience, I think."}, {"time": 3214, "text": "Then there's sexual coercion within groups."}, {"time": 3217, "text": "And so that takes various kinds of forms."}, {"time": 3222, "text": "But nowadays, of course, I think people recognize increasingly that the principle form of sexual intimidation and rape occurs within relationships."}, {"time": 3238, "text": "It's not stranger rape that is really statistically important."}, {"time": 3243, "text": "There's much more what happens behind the walls of a bedroom where people have been living for some time."}, {"time": 3254, "text": "And just two sort of thoughts and observations about this."}, {"time": 3260, "text": "One is that it may seem odd that males should think it a good idea, as it were, to impose themselves sexually on someone with whom they have a relationship."}, {"time": 3280, "text": "But what they're doing is intimidating someone in a relationship in which the relative power in the relationship has continuing significance for a long time."}, {"time": 3293, "text": "And that power probably goes well beyond just the sexual."}, {"time": 3298, "text": "It's to do with domestic relationships, it's to do with the man getting his own way all the way."}, {"time": 3305, "text": "It's power dynamics and the sexual aggression is one of the tools to regain power, gain power, gain more power and that kind of thing."}, {"time": 3316, "text": "And in that respect, it's worth noting that although this wasn't appreciated for some time, it's emerging that in a bunch of primates you have somewhat similar, somewhat parallel kinds of sexual intimidation where males will target particular females, even in a group in which the norm is for females to mate with multiple males."}, {"time": 3343, "text": "But each male will target a particular female and the more he is aggressive towards her, then the more she conforms to his wishes when he wants to mate."}, {"time": 3355, "text": "So a long term pattern of sexual intimidation."}, {"time": 3358, "text": "So there's that aspect."}, {"time": 3360, "text": "The other aspect I would just note is that males get away with a lot compared to females in any kind of intersexual conflict."}, {"time": 3376, "text": "So the punishment, here's one example of this, the punishment for a husband killing a wife has always been much less than the punishment for a wife killing a husband."}, {"time": 3389, "text": "And you see similar sorts of things in terms of the punishments for adultery and so on."}, {"time": 3398, "text": "I bring this up in the context of males sexually intimidating their partners, be it wives or whoever, because it's a reminder that it's basically a patriarchal world that we have come from."}, {"time": 3417, "text": "A patriarchal world in which male alliances tend to support males and take advantage of the fact that they have political power at the expense of females."}, {"time": 3429, "text": "And I would say that that all goes back to what happened three to 400,000 years ago when the beta males took charge and they started imposing their own norms on society as a whole and they've continued to do so."}, {"time": 3442, "text": "And we now look at ourselves and Jordan Peterson says, we are not a patriarchal society."}, {"time": 3448, "text": "Well, it's true that the laws try and make it even handed nowadays between males and females, but obviously we are patriarchal de facto because society still in many ways supports men better than it supports women in these sorts of conflicts."}, {"time": 3468, "text": "So beta male patriarchal."}, {"time": 3471, "text": "If we're looking at the evolutionary history."}, {"time": 3475, "text": "Okay, is there, maybe sticking on Jordan for a second, is there, so he's a psychologist, right?"}, {"time": 3484, "text": "And what part of the picture do you think he's missing in analyzing the human relations?"}, {"time": 3496, "text": "Like what does he need to understand about our origins in violence and the way that society has been constructed?"}, {"time": 3504, "text": "Or I don't want to go deep into his missing perspectives, but I just think that what he's doing in that particular example is focusing on the legalistic position."}, {"time": 3521, "text": "And that's great that you do not find formal patriarchy in the law, anything like to the extent that you could find it 100 years ago and so on."}, {"time": 3533, "text": "Women have got the vote now, hooray."}, {"time": 3536, "text": "But it took a long time for women to get the vote."}, {"time": 3538, "text": "And it remains the case that women suffer in various kinds of ways."}, {"time": 3548, "text": "I mean, a woman who has lots of sexual partners is treated much more rudely than a male who has lots of sexual partners."}, {"time": 3561, "text": "There are all sorts of informal ways in which it's rougher being a woman than it is a man."}, {"time": 3567, "text": "And if we look at the surface layer of the law, we may miss the deeper human nature, like the origins of our human nature that still operates no matter what the law says."}, {"time": 3582, "text": "Yeah, which is, you know, human nature is awkward because it includes some unpleasant features that when we sit back and reflect about them, we would like them to go away."}, {"time": 3597, "text": "But it remains the fact that men are hugely concerned to try and have sex with at least one woman, and you know, often lots of women."}, {"time": 3614, "text": "And so men are constantly putting pressure on women in ways that women find unpleasant."}, {"time": 3619, "text": "And if men sit back and reflect about it, they think, yeah, we shouldn't do this."}, {"time": 3622, "text": "But actually, it just goes on because of human nature."}, {"time": 3626, "text": "So maybe looking at particular humans in history, let's talk about Genghis Khan."}, {"time": 3632, "text": "So is this particular human who was one of the most famous examples of large scale violence, is he a deep representative of human nature or is he a rare exception?"}, {"time": 3647, "text": "Well, I think that it's easy to imagine that most men could have become Genghis Khan."}, {"time": 3659, "text": "It's possible that he had a particular streak of psychopathy."}, {"time": 3666, "text": "You know, it's striking that by the time you become immensely powerful, then your willingness to do terrible things for the interest of yourself and your group becomes very high."}, {"time": 3691, "text": "Stalin, Mao Zedong, these sorts of people have histories in which they do not show obvious psychopathy."}, {"time": 3699, "text": "But by the time they are big leaders, they are really psychopathic in the sense that they do not follow the ordinary morality of considering the harm that they are doing to their victims."}, {"time": 3718, "text": "What kind of experiment would we need to discover whether or not anybody could fall into this position?"}, {"time": 3724, "text": "I don't know, but Lord Acton's famous dictum was power corrupts and absolute power corrupts absolutely."}, {"time": 3734, "text": "And then the point that people often forget is the next sentence that he said, which is, great men are almost always bad men."}, {"time": 3742, "text": "And that is right."}, {"time": 3743, "text": "It is very difficult to find a great man in history who was not responsible for terrible things."}, {"time": 3750, "text": "I think there's some aspect of it that it's not just power."}, {"time": 3755, "text": "I think men who have been the most destructive in human history are not psychopathic completely."}, {"time": 3767, "text": "They have convinced themselves of an idea."}, {"time": 3769, "text": "It's like the idea is psychopathic."}, {"time": 3772, "text": "Stalin, for example, Hitler's a complicated one."}, {"time": 3775, "text": "I think he was legitimately insane."}, {"time": 3777, "text": "But I think Stalin has convinced himself that he's doing good."}, {"time": 3782, "text": "So the idea of communism is the thing that's psychopathic in his mind, like it bred, you construct the worldview in which the violence is justified, the cruelty is justified."}, {"time": 3794, "text": "So there, in that sense, first of all, you can construct experiments, unethical experiments that could test this, but in that sense, anybody else could have been in Stalin's position."}, {"time": 3810, "text": "It's the idea that could overtake the mind of a human being and in so doing justify cruel acts."}, {"time": 3818, "text": "And that seems to be, at least in part, unique to humans, is the ability to hold ideas in our minds and share those ideas and use those ideas to convince ourselves that proactive violence on a large scale is a good idea."}, {"time": 3837, "text": "So that, I don't know if you have a comment."}, {"time": 3838, "text": "I suppose so, I mean, but it seems to me what really motivated Stalin was not so much communism as the retention of power."}, {"time": 3852, "text": "So once he became leader and in the process of becoming leader, he was absolutely desperate to get rid of anybody who was a challenger."}, {"time": 3864, "text": "He was deeply suspicious, suspicious of anybody, even on his side, who might possibly be showing a glimmerings of willingness to challenge him."}, {"time": 3876, "text": "So when he apparently had Kirov murdered, Kirov was a great communist, Trotsky was a great communist, all his rivals, and I mean, when he went into the towns and murdered people by the tenths of thousands."}, {"time": 3895, "text": "They were all communists."}, {"time": 3896, "text": "A lot of them were explicit communists, that's right."}, {"time": 3900, "text": "But what he was worried about was that they were rivals to him."}, {"time": 3905, "text": "I suppose the thought is I am the best person to bring about a global sort of embrace of communism and others are not, and so we have to get rid of those others."}, {"time": 3918, "text": "Well, I suspect you're being very charitable here, but I mean, maybe you know enough about Stalin to really."}, {"time": 3925, "text": "Yes, well, so the point I'm making, I do quite a bit, is from my understanding and sense, of course, we can't know for sure, is he believed in communism."}, {"time": 3937, "text": "This wasn't purely a game of power."}, {"time": 3941, "text": "Now, he got drunk with power pretty quickly, but he really believed for, I believe his whole life, that communism is good for the world."}, {"time": 3953, "text": "And that, I don't know what role that belief plays with the more natural human desire for power."}, {"time": 3962, "text": "I don't know, but it just seems like."}, {"time": 3965, "text": "As we agreed, he's killing a lot of communists on his journey."}, {"time": 3969, "text": "On his journey."}, {"time": 3971, "text": "Hmm, but it's not, that calculus doesn't work that way."}, {"time": 3975, "text": "There's humans who are communists and then there's the idea of communism."}, {"time": 3980, "text": "So for him, in his delusional world view, killing a few people is worth the final result of bringing communism to the whole world."}, {"time": 3992, "text": "But it was more than that, again, because I mean, he really wanted power for the Soviet Union and so surely the reason that he orchestrated the export of wheat from Ukraine and in so doing was willing to lead to mass starvation was because he wanted to sell it on the market in order to be able to build up the power of the Soviet Union."}, {"time": 4021, "text": "Alternative view of communism might have been, well, let's just make sure everybody survives and make sure everybody has enough to eat and we'll all be mutually supportive in a communal network."}, {"time": 4033, "text": "But no, but he wanted the power for the country."}, {"time": 4036, "text": "Well, I guess exactly, so that it's not even communism, the set of ideas are like Marxism or something like that, it's the country."}, {"time": 4043, "text": "I guess what I'm saying is it's not purely power for the individual, it's power for a vision for this great nation, the Soviet Union."}, {"time": 4054, "text": "And it's similar with Hitler, the guy believed that this is a great nation, Germany, and it's a nation that's been wronged throughout history and needs to be righted."}, {"time": 4069, "text": "And there's some dance between the individual human and the tribe."}, {"time": 4075, "text": "Yes, absolutely, yes, and so just like chimpanzees, we are fiercely tribal and the tribalism resides particularly in male psychology and it's very scary because once you assemble a set of males who share a tribal identity, then they have power that they can exert with very little concern about what they're doing to damage other people."}, {"time": 4109, "text": "Do you think this, so Nietzschean will to power, we talked about the corrupting nature of power, do you think that's a manifestation of those early origins of violence?"}, {"time": 4122, "text": "What's the connection of this desire for power and our proclivity for violence?"}, {"time": 4130, "text": "You know, what we're talking about is tribal power, right?"}, {"time": 4134, "text": "Power on behalf of a group."}, {"time": 4137, "text": "And yeah, that seems to me to go right back to a deep evolutionary origin because you see essentially the same thing in a whole bunch of animals."}, {"time": 4150, "text": "That most of the sort of cognitively complex animals live in social groups in which they have tribal boundaries."}, {"time": 4162, "text": "And so what you see in chimpanzees is echoed in almost all of the primates."}, {"time": 4168, "text": "The difference between us and, you know, chimpanzees and humans on the one hand and other primates on the other is that we kill and they don't."}, {"time": 4179, "text": "And the reason they don't is because they never meet in the context where there are massive imbalances of power."}, {"time": 4186, "text": "So two groups of baboons, you know, there's 30 on this side and 50 on this side, fine."}, {"time": 4192, "text": "Nobody's gonna try and kill anybody else because the serious risks involved."}, {"time": 4199, "text": "But nevertheless, they are tribal."}, {"time": 4202, "text": "So, you know, they will have fairly intense intergroup interactions in which everybody knows who is on whose side."}, {"time": 4212, "text": "And the longterm consequences of winning those battles, nonlethal battles, is that the dominance get access to larger areas of land, more safety and so on, with chances are better record of reproductive success subsequently."}, {"time": 4240, "text": "Do you think this, from an evolutionary perspective, is a feature or a bug?"}, {"time": 4244, "text": "Our natural sort of tendency to form tribes?"}, {"time": 4250, "text": "So what's a bug?"}, {"time": 4251, "text": "Oh, sorry, this is a computer programming analogy, meaning like it would be more beneficial."}, {"time": 4263, "text": "Is it beneficial or detrimental to form tribes from an evolutionary perspective?"}, {"time": 4269, "text": "Yeah, yeah, but, but, but."}, {"time": 4272, "text": "What does a bug mean?"}, {"time": 4275, "text": "Well, yeah, like where's evolution going anyway?"}, {"time": 4277, "text": "It's beneficial from, you know, it's beneficial in the sense that it evolved by natural selection to benefit the individuals who did it."}, {"time": 4285, "text": "But if by bug you mean something that, from the point of view of the species, it would be great if you could just wipe this out because the species would somehow do better as a result."}, {"time": 4296, "text": "Then yes, but then, you know, males are a bug."}, {"time": 4301, "text": "Come on now, there's some nice things to males, speaking as a male."}, {"time": 4308, "text": "The fact that there are some nice things to males doesn't mean that they're not bugs."}, {"time": 4311, "text": "You know, maybe they're quite nice bugs, but it would be much better for the species as a whole not to have to have males who impose this violence on the species as a whole."}, {"time": 4323, "text": "As somebody who practiced controlled violence and doing a lot of martial arts, yeah, I'm not sure."}, {"time": 4330, "text": "It does seem kind of fun to have this kind of controlled violence, also sports."}, {"time": 4335, "text": "Also, I mean, the question of conflict in general, I guess that's the deeper question."}, {"time": 4340, "text": "Don't you think there's some value to conflict for the improvement of society, for progress?"}, {"time": 4347, "text": "That this tension between tribes, isn't this like a experiment, a continued experiment we conduct with each other to figure out what is a better world to build?"}, {"time": 4360, "text": "Like you need that conflict of good ideas and bad ideas to go to war with each other."}, {"time": 4367, "text": "It's like the United States with the 50 states and it's the laboratory of ideas."}, {"time": 4373, "text": "Don't you think that is, again, feature versus bug?"}, {"time": 4379, "text": "This kind of conflict, when it doesn't get out of hand, is actually ultimately progressive, productive for a better world."}, {"time": 4388, "text": "Well, what do you mean by conflict?"}, {"time": 4390, "text": "I mean, you can have conflict in the sense of people have different ideas about the solution to a problem."}, {"time": 4396, "text": "And so their ideas are in conflict."}, {"time": 4398, "text": "They can sit down on a log and chat about it and then decide, okay, you're right, or I'm wrong or whatever."}, {"time": 4409, "text": "But if by conflict, you mean a great idea to build a nuclear bomb and set that off, then no, I don't see why it's a good idea to have all this violence."}, {"time": 4420, "text": "Yeah, there's, I wonder, I mean, it's not a good idea, but I wonder if human history would evolve the way it did without the violence."}, {"time": 4435, "text": "Oh, I'm sure you're right."}, {"time": 4436, "text": "Probably humans would not have evolved in the sense that we have."}, {"time": 4440, "text": "But I would hope that the course of violence in evolution will continue in the way it has."}, {"time": 4448, "text": "So, there's all sorts of indications that the importance of violence has been reduced over time."}, {"time": 4458, "text": "And this is made famous in Steven Pinker's book, but others have written about it too, that the frequency of death from violence in every country you look at, has been declining, that's just great."}, {"time": 4476, "text": "And so, you know, the amazing thing about this is that even when you take the deaths due to the First World War and the Second World War, the 20th century appears to have been statistically, meaning rates of death per individual, the least violent in history."}, {"time": 4496, "text": "So, we haven't got very far down the course to nonviolence, but we've got a long way to go."}, {"time": 4502, "text": "But I don't see why we shouldn't just carry on doing it."}, {"time": 4505, "text": "I think it's ridiculous, frankly, excuse my frankness, to say that violence is a good thing."}, {"time": 4514, "text": "I think that it would be a wonderful concept if we could evolve somehow to a world 3,000 years from now, where violence is really regarded as simply appalling, and that they look back on our time and can't believe what we were doing."}, {"time": 4532, "text": "Yeah, but of course, violence takes a lot of different shapes."}, {"time": 4535, "text": "As we start to think deeper and deeper about living beings on Earth, for example, the violence we commit and the torture we commit to animals, and then perhaps down the line, as we talked offline about with robots, and that kind of thing."}, {"time": 4549, "text": "So there's just so many ways to commit violence to others."}, {"time": 4552, "text": "And some people now talk about violence in the space of ideas, which of course, to me at least, is a bit of a silly notion relative to use that same V word for the space of ideas versus actual physical violence."}, {"time": 4566, "text": "But it may be that a long time from now, we see that even violence in the space of ideas is quite a manifestation of that same kind of violence."}, {"time": 4576, "text": "And so it is interesting where this is headed."}, {"time": 4580, "text": "And I think you're absolutely right."}, {"time": 4583, "text": "A world, a nonviolent world, does seem like a better world."}, {"time": 4587, "text": "I wonder if the constraints on resources somehow make that world more and more difficult, especially as we run out of resources."}, {"time": 4596, "text": "Well, it's got to be very, very different from what we're doing nowadays."}, {"time": 4598, "text": "And it's unimaginably different."}, {"time": 4600, "text": "If we could imagine it, then maybe we could work towards it."}, {"time": 4603, "text": "At the moment, nobody knows how to work towards it."}, {"time": 4605, "text": "Well, that's kind of the stories of humans is we don't really know the future."}, {"time": 4608, "text": "We're trying to ad hoc kind of develop it as we go and sometimes get into trouble."}, {"time": 4615, "text": "That's the violence."}, {"time": 4617, "text": "But George Orwell's vision in 1984 was of two or three world powers each so powerful that nobody could destroy the other."}, {"time": 4631, "text": "But the notion of an evolutionarily stable relationship among heavily armed world powers just does not seem as though it's reasonable at all."}, {"time": 4647, "text": "That is to say, we've now got 170 or 190 nations in the world dominated by a few big ones, all with arms pointing at each other."}, {"time": 4662, "text": "And the notion that we could just carry on having peace talks and making sure that these arms don't get involved in some kind of massive conflagration seems incredibly optimistic."}, {"time": 4676, "text": "Some kind of major change has to happen whereby, and some people would like to see all the weapons go."}, {"time": 4684, "text": "That'd be great."}, {"time": 4685, "text": "I'm a member of that sort of group that tries to see that happen."}, {"time": 4690, "text": "It's going to be very difficult to see it happen."}, {"time": 4693, "text": "Another kind of concept is the nations themselves will dissolve and will become one government."}, {"time": 4701, "text": "That itself is a terrifying vision because the capacity for abuse by a single world power would be so problematic."}, {"time": 4710, "text": "And in addition, how do you get there without a war in the first place?"}, {"time": 4715, "text": "So at the moment, we have no reasonable kind of future in mind, but I'm sure it's there somewhere."}, {"time": 4721, "text": "It's just that we haven't yet to find it."}, {"time": 4723, "text": "And a lot of people like in the cryptocurrency space argue that you can create decentralized societies if you take away the power from states to define the monetary system."}, {"time": 4734, "text": "So they argue like if you make the monetary system such that it's disjoint from the control of any one individual, any one government, then that might be a way to form sort of ad hoc decentralized societies."}, {"time": 4748, "text": "They just pop up all over the place."}, {"time": 4750, "text": "That's a really interesting technological solution to how to remove the overreach of power from governments."}, {"time": 4760, "text": "And it may well be that the future will emerge out of some sort of quite surprising direction like that."}, {"time": 4768, "text": "Is it nevertheless surprising to you that we have not destroyed ourselves with nuclear weapons?"}, {"time": 4774, "text": "So the mutually assured destruction that we've had for many decades from somebody who studies violence, how does that make sense to you?"}, {"time": 4783, "text": "Well, I mean, I'm surprised only in the sense that accidental, the fact that we have not had an accident yet has been quite remarkable."}, {"time": 4794, "text": "Yeah, because all the accounts are that we've come very close to having very serious accidents where people on either side have misread intentions or apparent launches and so on."}, {"time": 4805, "text": "So yes, I think it is remarkable."}, {"time": 4808, "text": "There is a nasty generalization that can be made that the longer that powerful states go without having wars than the worst the war is afterwards."}, {"time": 4823, "text": "And you can sort of see that that kind of makes sense because basically what's happening with these tribal groups that the nations are at the moment is that after a big war like the Second World War, they establish new kinds of dominance relationships."}, {"time": 4841, "text": "And then during the periods of peace, what happens is that the de facto dominance relationships change because some nations become poorer, some become richer, some become more militarily powerful and so on."}, {"time": 4857, "text": "Generally, economy and military goes hand in hand."}, {"time": 4861, "text": "So right now, China emerged from the war as a relatively low status state and is now high status."}, {"time": 4869, "text": "So if this were chimpanzees, what would happen is that you would predict a conflict because you need to have a readjustment of the formal dominance relationships to recognize the new in practice dominance relationships recognized by the economy and the military."}, {"time": 4886, "text": "So the longer that you have of a period of peace following a war, then the more these tensions of unresolved changed dominance relationships build up."}, {"time": 4897, "text": "And the longer they take to occur, then the more challenging are gonna be the conflicts."}, {"time": 4906, "text": "That's a terrifying view because we've been out of conflict for quite a bit."}, {"time": 4910, "text": "Maybe it's building up."}, {"time": 4912, "text": "So it's a scary view."}, {"time": 4913, "text": "But on the other hand, things have changed hugely with the advent of nuclear weapons because at least that conforms to this psychology that is very clear in other animals, which is you don't want to get into a fight if you are going to get hurt."}, {"time": 4931, "text": "So that's the whole principle of MAD, Mutual Assured Destruction."}, {"time": 4935, "text": "And it's doubtless been why powerful nations like America and Russia have not used their nuclear weapons since 1945."}, {"time": 4945, "text": "So if we can overcome the problem of accidental launches, then maybe the fact of MAD does fit into human psychology in a way that means that we really will resolve our tensions without using them."}, {"time": 4961, "text": "But we haven't yet really faced that challenge."}, {"time": 4966, "text": "I mean, the Soviet Union collapsed because of the poor economy, but with China desperate to take back Taiwan and America shifting its focus on the Pacific, the potential for something going wrong is clearly very high."}, {"time": 4987, "text": "So what's the hopeful case that you can make for a long term surviving and thriving human civilization given all the dangers that we face?"}, {"time": 4997, "text": "Well, I can't really exactly make one."}, {"time": 4999, "text": "I would just say that, we're talking about the dangers, obviously the dangers are there."}, {"time": 5007, "text": "But what I would sort of think about is the notion that surprises come from all sorts of different directions."}, {"time": 5017, "text": "And I mean, you work in robotics and I can well imagine that you have a lot of experience and imagine that there will be advances in robotics that in some way I can't even conceive will somehow undermine the motivation for conflict."}, {"time": 5038, "text": "Something about by the time chips have been planted in human brains and we're all instantly sharing information in a way that we never did before, will this change the nature of human existence in such a way that these conflicts get resolved?"}, {"time": 5055, "text": "So remove the conflicts, but keep some of the magic, the beauty of what it means to be human."}, {"time": 5059, "text": "So like still be able to enjoy life, the richness of life, the full complexity of life."}, {"time": 5064, "text": "Cause you can remove conflict by giving everybody a pill and then they go to sleep, right?"}, {"time": 5070, "text": "You still want life to be amazing, exciting, interesting."}, {"time": 5077, "text": "And so that's where you have to find the balance."}, {"time": 5079, "text": "Well, it's, yes, I mean, it's all science fiction stuff."}, {"time": 5082, "text": "And so how it's gonna work out, totally unclear."}, {"time": 5091, "text": "I don't see any worry about the magic of life disappearing."}, {"time": 5095, "text": "I mean, first of all, you somehow get rid of males."}, {"time": 5097, "text": "I think you really need to get rid of males cause males are the source of a major problem, which is the lust for power and the resulting conflict."}, {"time": 5110, "text": "But you don't think the males are also source of beauty and creation?"}, {"time": 5115, "text": "No, I mean, I don't have anything against males as individuals and that sort of thing."}, {"time": 5120, "text": "And males have clearly done a lot."}, {"time": 5122, "text": "I mean, they've been incredibly exploratory and creative and what they've done in art and music has been wonderful and that sort of thing."}, {"time": 5132, "text": "On the other hand, I'm not sure there's anything particularly special."}, {"time": 5136, "text": "And I think that probably females could do the same thing just as well when given the chance."}, {"time": 5142, "text": "Yes, including the dark stuff."}, {"time": 5144, "text": "I mean, a partial part of me is not understanding the, so there is evolutionary distinction between men and women, but I tend to believe both men and women, if you look out into the future, can be destructive, can be evil, can be greedy, can be corrupted by power."}, {"time": 5162, "text": "So if you move males from the picture, which are historically connected to this evolution that we've been talking about, that women are gonna fill that role quite nicely."}, {"time": 5171, "text": "And then it'll be just the same kind of process."}, {"time": 5175, "text": "Not the same, but it'll be new and interesting."}, {"time": 5181, "text": "There's a sense that the will to power, craving power, committing violence is somehow coupled with all of the things that are beautiful about life."}, {"time": 5192, "text": "That if you remove conflict completely, if you remove all of the evil in the world, it seems like you're going to, you're not going to have a stable place for the beauty, for the goodness."}, {"time": 5209, "text": "Like there's always has to be a dragon to fight for the way."}, {"time": 5214, "text": "If you look at human history, now you can say, the reason I'm nervous about a sort of utopia where everything is great is every time you look through human history when utopia has been chased, you run into a lot of trouble or again, sneaks into this evil, this craving for power."}, {"time": 5233, "text": "Now you could say that's a male problem, but I just think it's a human problem."}, {"time": 5238, "text": "And it's not even a human problem, it's a chimp problem too."}, {"time": 5242, "text": "It's life on earth problem, intelligent life on earth problem."}, {"time": 5245, "text": "So like it's better to not necessarily get rid of the sources of the darker sides of human nature, but more create mechanisms that the kindness, the goodness as the goodness paradox, your book, that that is incentivized and encouraged, empowered."}, {"time": 5270, "text": "Well, look, I don't think it would be utopia if you got rid of the males."}, {"time": 5277, "text": "And certainly females are capable of conflict."}, {"time": 5281, "text": "I just think it's a gamble worth taking if you could actually do it."}, {"time": 5284, "text": "You can certainly find females in history who've done unpleasant things, but nevertheless, we have a very strong evolutionary theory which explains why males benefit more by having conflict and winning conflicts than females do."}, {"time": 5301, "text": "And so if we want to talk about reducing conflict, then it would reduce it to get rid of males."}, {"time": 5311, "text": "Now I understand this is a fantasy, and I think it's a fantasy that people would be able to talk about fairly soon because reproductive technology is getting to the point where it's quite likely that human females could breed without the use of males."}, {"time": 5330, "text": "And so there would be a sort of a potential dynamic if everybody just agreed not to have any male babies."}, {"time": 5341, "text": "It's a really interesting thought experiment."}, {"time": 5343, "text": "I will agree with you that if given two buttons, one is get rid of all women, and the other button is get rid of all men, realizing that I have a stake in this choice, you're probably getting rid of all men if I wanted to preserve earth and the richness of life on earth, I would probably get rid of all men."}, {"time": 5371, "text": "I don't think you have a stake in it."}, {"time": 5372, "text": "You know, I mean, you're saying that because you're a man."}, {"time": 5376, "text": "But I don't see why being a man should make you any more interested in having a male future for the world than a female future."}, {"time": 5383, "text": "You know, you've got just as many ancestors who were male as were female."}, {"time": 5388, "text": "Well, my problem is I'll have to die."}, {"time": 5391, "text": "Well, that's gonna happen anyway."}, {"time": 5393, "text": "I know, but like, I prefer to die tomorrow, not today."}, {"time": 5396, "text": "You know, I prefer to hit the snooze button on the whole mortality thing, but it's interesting."}, {"time": 5403, "text": "But this is not suggesting that males have to die in order to make room for females."}, {"time": 5406, "text": "It's just, you know, all you have to do is just say, don't let's have any more males born."}, {"time": 5414, "text": "Of course, you know, the difficulty is that because we're tribal, you know, some country somewhere would say, well, we're not gonna do that."}, {"time": 5422, "text": "And then guess what?"}, {"time": 5423, "text": "They'd take over, you know, because they're male."}, {"time": 5424, "text": "So that's why it's impossible to imagine actually happening."}, {"time": 5428, "text": "You know what, I'm gonna take that and actually think about it."}, {"time": 5432, "text": "I don't know, I'm uncomfortable."}, {"time": 5434, "text": "There's a certain kind of woke culture that I've been kind of uncomfortable with because it's not women necessarily."}, {"time": 5444, "text": "It's more just, there's a lot of bullying I see."}, {"time": 5447, "text": "There's a lack of empathy and a lack of kindness towards others that's created by that culture."}, {"time": 5453, "text": "So, but you're speaking about something else."}, {"time": 5455, "text": "You're speaking about reducing conflict in this world and looking at the basics of our human nature and its origins in the evolution of Homo sapiens and thinking about which kind of aspects of human nature if we get rid of them will make for a better world."}, {"time": 5478, "text": "It's an interesting thought experiment worth thinking about."}, {"time": 5480, "text": "But it is only a thought experiment."}, {"time": 5481, "text": "I mean, you know, it's got no practical meaning right now."}, {"time": 5484, "text": "And I take your point that, you know, males get a hard rap nowadays in some ways because the balance of social power is moving against, I mean, you know, quite rightly and in a strong sense, of course, against all the nasty things that males do."}, {"time": 5511, "text": "But what people sometimes fail to remember is that life is very hard for males who don't have the power, who don't have money, who don't have access to women."}, {"time": 5528, "text": "And, you know, I'm sympathetic to incels."}, {"time": 5535, "text": "I'm not sympathetic to them using violence to solve their problems."}, {"time": 5540, "text": "But I am very sympathetic to the fact that it's not easy simply to be told by well off, feminist, middle class people that you shouldn't behave like this or you shouldn't feel like this because you do."}, {"time": 5560, "text": "Yes, it's who you are."}, {"time": 5562, "text": "I mean, in general, just empathy and kindness, male or female, I believe will be the thing that builds a better world."}, {"time": 5574, "text": "And that's practiced in different ways from different backgrounds."}, {"time": 5578, "text": "But ultimately, you should listen to others and empathize with the experience of others and put more love out there in the world."}, {"time": 5586, "text": "Now, that hopefully is the way to reduce conflict, reduce violence, and reduce that whole psychological experience of being powerless in this world, powerless to become the best version of yourself."}, {"time": 5602, "text": "And that, you know."}, {"time": 5603, "text": "Well, no one's gonna disagree with all those fine sentiments, right?"}, {"time": 5607, "text": "But that, yes."}, {"time": 5609, "text": "But that's an actionable thing is actually practice empathy, right?"}, {"time": 5615, "text": "Like saying that somebody should be silenced or just like this group is bad and this group is good."}, {"time": 5623, "text": "I just feel like that's not empathy."}, {"time": 5625, "text": "Empathy is understanding the experience of others and like respecting it."}, {"time": 5632, "text": "Like, I mean, that's what a better world looks like."}, {"time": 5637, "text": "That's what the reduction of conflict looks like."}, {"time": 5639, "text": "It's like, as opposed to saying my tribe is right, your tribe is wrong."}, {"time": 5646, "text": "Forget the violence and nonviolence part."}, {"time": 5648, "text": "That's just that act of saying my tribe is right, that tribe is wrong."}, {"time": 5652, "text": "Removing that from the picture, that's the way to make a better world."}, {"time": 5655, "text": "Like that's the way to reduce the violence, I think."}, {"time": 5659, "text": "Not necessarily removing the people who are causing the violence."}, {"time": 5664, "text": "You have to get to the source of the problem."}, {"time": 5665, "text": "I don't mean the evolutionary source, but just the mindset that creates the violence is usually just the lack of empathy for others."}, {"time": 5677, "text": "Yeah, but you know, I mean, you can't just teach that because our evolutionary psychology puts us in particular directions."}, {"time": 5685, "text": "So you don't think, do you think it's possible to learn through practice to resist the basics of our evolutionary psychology, the basic forces?"}, {"time": 5698, "text": "Yeah, I mean, lots and lots of training."}, {"time": 5701, "text": "Lots and lots of education can do it."}, {"time": 5704, "text": "The famously most peaceful society that anthropologists have recorded involves tremendous amount of teaching, including some punishment."}, {"time": 5718, "text": "You know, it's a society in Thailand."}, {"time": 5721, "text": "You have to beat it out of children to make them nice."}, {"time": 5725, "text": "There's carrot and steak."}, {"time": 5727, "text": "You know, the point is that you do not find societies in which people are spontaneously showing the kinds of behaviors that we would all love them to show."}, {"time": 5745, "text": "What is your book titled, Goodness Paradox?"}, {"time": 5748, "text": "What are the main ideas in this book?"}, {"time": 5750, "text": "Well, the paradox is the fact that humans show extremes in relationship to both violence and nonviolence."}, {"time": 5760, "text": "And the violence is that we are one of these few animals in which we use coalitionary proactive violence to kill members of our own species."}, {"time": 5770, "text": "And we do it in large numbers, just like a few other species."}, {"time": 5774, "text": "And the nonviolence is we're particularly extreme in how repressed we are in terms of reactive violence."}, {"time": 5783, "text": "And I told you the story of how we get there."}, {"time": 5786, "text": "So what's so extraordinary about it is that most animals are either high on both or relatively low on both."}, {"time": 5795, "text": "So chimpanzees are high on proactive violence and reactive violence."}, {"time": 5800, "text": "Bonobos are less than chimpanzees on both of those, but still hundreds of times more reactively aggressive than humans are."}, {"time": 5810, "text": "What we've done is retain proactive violence being high and got reactive violence really being low."}, {"time": 5819, "text": "And so we have these wonderful societies in which we're all so incredibly nice to each other and tolerant and calm and can meet strangers and have no problem about leading to any kind of conflict at the same time as we are one of the worst killing machine species that's ever existed."}, {"time": 5841, "text": "So what's so extraordinary about this is that if you look at the political philosophers of the last few hundred years, you've got this fight famously between Thomas Hobbes and Jean Jacques Rousseau, or literally you've got the fight between their followers."}, {"time": 5858, "text": "So the followers of Hobbes say, well, Hobbes was right, because he says that we are naturally violent and you need a Leviathan, a sort of central government or a king to be able to suppress the violence."}, {"time": 5871, "text": "So we're naturally horrid and we can learn to be good."}, {"time": 5875, "text": "Whereas Jean Jacques Rousseau is interpreted as saying the opposite, that we are naturally good and it's only when culture intervenes and horrid ideologies come in that we become uncivilized."}, {"time": 5888, "text": "And so people have had this endless fight between are we naturally corrupt or are we naturally kind?"}, {"time": 5897, "text": "And that has gone on for years and it's only in the last two or three decades that anthropologists like Christopher Boehm and Bruce Naft have said, look, it's obvious what the answer is, we are both of these things."}, {"time": 5910, "text": "And what is so exciting now is I think we can understand why we are both."}, {"time": 5914, "text": "And the answer is we come from ancestors that were elevated on proactive aggression, that were hunters and killers, both of animals and of each other."}, {"time": 5927, "text": "And you've got to include that as almost certain from the past."}, {"time": 5932, "text": "And then now we've taken our reactive aggression and we've down regulated it and that's given us power."}, {"time": 5942, "text": "It's given us power because once you get rid of the alpha male, once the beta males take over and force selection in favor of a more tolerant, less reactively aggressive individual, the effect is that our cultures suddenly become capable of focusing on things other than conflict."}, {"time": 5964, "text": "And so we have social groups in which individuals, instead of constantly being on edge in the way that chimpanzees are with each other, are able to interact in ways that enable them to share looking at a tool together or share their food together or pass ideas from one to the other or support each other when they're ill or whatever the issue is."}, {"time": 5991, "text": "Cooperate in ways that make the group far more effective."}, {"time": 5996, "text": "So you asked earlier, what did I think about why sapiens were able to expand at the expense of Neanderthals so dramatically around 40,000 years ago?"}, {"time": 6006, "text": "And the answer is that whatever it was, it had something to do with the sapiens ability to cooperate."}, {"time": 6016, "text": "That was what gave them bigger groups."}, {"time": 6018, "text": "That's what enabled them to have a far more effective way of living."}, {"time": 6023, "text": "And I suspect it was to do with the weapons and military aspects."}, {"time": 6028, "text": "But even if it wasn't that, the greater cooperation that sapiens were showing would have been hugely important."}, {"time": 6036, "text": "So sapiens then had groups of, who knows exactly how big they were, but scores of people to judge from their remains."}, {"time": 6048, "text": "Whereas Neanderthals were living in widely separated, small groups of maybe as many as 15 or 20 people sometimes, where they saw others so rarely that they were inbreeding at high levels."}, {"time": 6063, "text": "Fathers having babies with their daughters."}, {"time": 6068, "text": "Very different world."}, {"time": 6070, "text": "And that's probably what our world was like before we got sapiens."}, {"time": 6073, "text": "Before we got sapiens."}, {"time": 6074, "text": "And it's fascinating that there was that kind of violence against, once you get rid of the alpha males, you have now the freedom to have kindness amongst the beta."}, {"time": 6089, "text": "The beta males."}, {"time": 6091, "text": "Not kindness, but collaboration, that's the better word."}, {"time": 6094, "text": "Yes, right, much more corruption."}, {"time": 6096, "text": "Not just among the males, among the beta males, but also among the gamma males and the females."}, {"time": 6102, "text": "Yeah, I don't know what a gamma male is, but I imagine there's a whole alphabet."}, {"time": 6107, "text": "Well, I don't know about a whole alphabet, but I think the big layers are the married men and the unmarried men."}, {"time": 6115, "text": "Because the married men had a problem with the unmarried men, right?"}, {"time": 6119, "text": "I mean, you see it in ethnographies of hunters and gatherers recently, where the unmarried men would be given rules, such as, I mean, a very extreme rule in Northern Australia was you cannot come to the camp for months."}, {"time": 6133, "text": "You have to go away and live somewhere out in the bush."}, {"time": 6137, "text": "Because we don't want you anywhere near our wives."}, {"time": 6140, "text": "And then another kind of rule is, if you are in the camp, you must be in the firelight all the time."}, {"time": 6147, "text": "Otherwise, we don't know what you're doing out in the dark."}, {"time": 6151, "text": "You really have to control them because the men who had lots of wives did not want those horrid bachelors sneaking around the place."}, {"time": 6162, "text": "You also wrote the book titled Catching Fire, How Cooking Made Us Human."}, {"time": 6167, "text": "What's the central idea in this book?"}, {"time": 6170, "text": "The subtitle How Cooking Made Us Human refers not to Homo sapiens, but to Homo erectus."}, {"time": 6176, "text": "So human there means the genus Homo."}, {"time": 6179, "text": "And Homo erectus is the first full member of the genus Homo in the sense that it looked like us, just with a sort of slightly more robust build and a smaller brain."}, {"time": 6195, "text": "And the central idea of Catching Fire is that it was the control of fire that was responsible for the emergence of Homo erectus and therefore the genus Homo, which happened two million years ago."}, {"time": 6213, "text": "And it was an evolution from a line of Australopithecines."}, {"time": 6222, "text": "And Australopithecines are the creatures from whom we evolved."}, {"time": 6229, "text": "They were present in Africa from something like six or seven million years ago, up to actually up to one million years ago."}, {"time": 6240, "text": "And then a branch led off to Homo around two million years ago."}, {"time": 6246, "text": "And the way to think of Australopithecines is that they were like chimpanzees standing upright."}, {"time": 6253, "text": "So they were erect bipedal walkers."}, {"time": 6257, "text": "They were like chimpanzees in the sense that they had brains about the size of a chimpanzee."}, {"time": 6264, "text": "They were literally about the body size of a chimpanzee, a little bit smaller actually."}, {"time": 6269, "text": "And they had big jaws because they were still eating raw food."}, {"time": 6276, "text": "They had big teeth and big jaws."}, {"time": 6279, "text": "And then around two million years ago, the line of Australopithecines, which ended with an intermediate species, a kind of missing link area, because it is not missing, called habilis, sometimes called Homo habilis, but more properly, in my view, called Australopithecus habilis."}, {"time": 6297, "text": "That gave rise to Homo erectus."}, {"time": 6300, "text": "And Homo erectus, here's how different it was."}, {"time": 6304, "text": "It had a smaller mouth, a smaller jaw, smaller teeth, and to judge from its ribs and pelvis, smaller gut."}, {"time": 6317, "text": "In addition, it had lost what Australopithecines all had, which was adaptations for climbing in the trees."}, {"time": 6324, "text": "And that meant that Homo erectus must have slept on the ground."}, {"time": 6328, "text": "And since it slept on the ground, it should have been able to defend itself somehow against predators."}, {"time": 6334, "text": "And I can't think of any way they could have done that unless they had fire."}, {"time": 6340, "text": "So there are two major clues to why it was with Homo erectus that our ancestors first acquired the control of fire."}, {"time": 6352, "text": "One is the fact that they were clearly not sleeping in trees in the way that chimpanzees and gorillas and bonobos and all the other primates do."}, {"time": 6362, "text": "And the other is that there was this striking reduction throughout the gut, reduction in size of the mouth and the chewing apparatus and in the gut itself."}, {"time": 6376, "text": "And that conforms to what we have today, that conforms to what we see nowadays about humans, which is that our guts are about two thirds of the size of what they would be if we ate raw food to judge by the great apes."}, {"time": 6395, "text": "So at some point in our evolution, we acquired the skill of cooking and skill of controlling fire."}, {"time": 6404, "text": "At no time between two million years ago and the present, do we see any changes in our anatomy that can, as it were, justify the enormous change that happens when you are an animal that learns to control fire."}, {"time": 6423, "text": "But at two million years ago, we have exactly what you'd expect, namely the guts becoming smaller because the food is becoming softer and much more easy to digest so you don't have to work so hard in the kitchen or so hard in your body to digest it."}, {"time": 6437, "text": "And as I say, a commitment to sleeping on the ground, which I think you'd be absolutely crazy to do nowadays on a moonless night in the middle of Serengeti unless you had fire."}, {"time": 6451, "text": "I've slept out quite a lot in various parts of Africa in the bush and you will not catch me just lying on the ground in an area with lots of predators unless I got a fire with me."}, {"time": 6464, "text": "I'm going to get eaten."}, {"time": 6466, "text": "You're gonna get terrified and you're gonna get eaten."}, {"time": 6469, "text": "Okay, so there's a million questions I wanna ask."}, {"time": 6471, "text": "So one, is it very naturally coupled, the discovery of controlled fire and cooking with fire?"}, {"time": 6479, "text": "Is that an obvious leap?"}, {"time": 6481, "text": "Well, here's what we know."}, {"time": 6483, "text": "We know that all the animals that we've tested like to eat their food cooked more than they like it raw."}, {"time": 6490, "text": "So this is true for all the great apes."}, {"time": 6493, "text": "We've tested them."}, {"time": 6495, "text": "That's fascinating, by the way."}, {"time": 6498, "text": "That's just like a property of food, I suppose."}, {"time": 6501, "text": "Yes, I think what it is is that animals are always looking for any kind of way to get food that is easier to digest."}, {"time": 6511, "text": "And there are various signals in the food such as the amount of sugar there, the amount of free amino acids because the amino acids can be tasted."}, {"time": 6520, "text": "And the physical qualities of the food be particularly important, how tough the food is."}, {"time": 6527, "text": "Always prefer softer food, provided it feels safe, tastes safe."}, {"time": 6533, "text": "And these kinds of sensory cues are all there in cooked food."}, {"time": 6541, "text": "It's soft, it doesn't have so many toxins."}, {"time": 6544, "text": "It's not so noxious to taste, easier to chew."}, {"time": 6548, "text": "So everyone loves it spontaneously."}, {"time": 6551, "text": "Your dogs and your cats prefer cooked food to raw food."}, {"time": 6554, "text": "Well, maybe you can say that's a consequence of domestication, but even, as I say, all of the great apes, you test naive ones and they prefer it cooked if they can."}, {"time": 6565, "text": "So then obvious, once you have fire, you're going to accidentally discover that food changes when you apply fire to it and then it's going to be the big, crazy new fad."}, {"time": 6577, "text": "You took the words out of my mouth."}, {"time": 6578, "text": "I mean, if they have fire at all and their food rolls into it, five minutes later it tastes better than it did before."}, {"time": 6586, "text": "How big of an invention from an engineering perspective do you think is the discovery of fire?"}, {"time": 6593, "text": "Do you think for homo erectus, homo sapiens, do you think it's the greatest invention ever?"}, {"time": 6602, "text": "Yeah, I think that the control of fire has been ultimately responsible for essentially how grandiose do I want to be here, the entire human story, going back to homo."}, {"time": 6621, "text": "It is what changed us from being a regular kind of animal."}, {"time": 6626, "text": "And perhaps the biggest way in which it is likely to have changed us is it reduced the difficulty of making a large brain."}, {"time": 6638, "text": "So the story here is that the constraints on brain size are energetic."}, {"time": 6647, "text": "You and I have brains that are something like 2.5% of our body weight."}, {"time": 6655, "text": "It consumes around 25% of all of our calories."}, {"time": 6663, "text": "So it's disproportionate."}, {"time": 6665, "text": "There are other expensive organs in our body as well, such as the heart."}, {"time": 6671, "text": "And what's different about the brain is that in addition to us being able to fuel it in a way that other animals can't, we also have reasons for wanting to have an even bigger brain, whereas we don't want an even bigger heart."}, {"time": 6689, "text": "So what those reasons are is unclear."}, {"time": 6691, "text": "But with regard to the costs of maintaining a brain, cooking makes it possible because it's supplying more calories and it is enormously reducing the amount of time that it takes to chew your food."}, {"time": 6708, "text": "So if you were a gorilla and you wanted to have a bigger brain, you might say, okay, well, let's just eat some more."}, {"time": 6716, "text": "But gorillas are eating for pretty much the entire day in the sense that they are eating for maybe seven or eight hours a day in some seasons."}, {"time": 6730, "text": "That's just chewing."}, {"time": 6731, "text": "And then they've got to sit around and digest their food because they can't just eat all the time."}, {"time": 6735, "text": "They've got to take a break while the food is digested in the stomach and then passed into the gut."}, {"time": 6743, "text": "So the stomach is already full."}, {"time": 6746, "text": "So basically gorillas are eating about the maximum rate already."}, {"time": 6751, "text": "So how does a gorilla get a bigger brain?"}, {"time": 6753, "text": "It doesn't, it's actually got a smaller brain relative to its body size than a chimpanzee does."}, {"time": 6759, "text": "And that's the basic problem for our ancestors."}, {"time": 6764, "text": "Then you come along and cook and all of a sudden you can get an increased amount of energy from your food."}, {"time": 6770, "text": "You are spending much less energy on digesting your food."}, {"time": 6776, "text": "You know, there are 25 bodily processes or more that are involved in digesting your food, making the acid that takes the proteins apart, maintaining the brush border where the molecules are taken across the gut wall and so on."}, {"time": 6795, "text": "That all costs."}, {"time": 6796, "text": "It costs you to digest your food."}, {"time": 6797, "text": "It costs less if you cook your food."}, {"time": 6799, "text": "So you get a net gain in the amount of energy and you are reducing the amount of time from in our case, our ancestors, probably around 50% of the day chewing to nowadays one hour a day chewing."}, {"time": 6816, "text": "So all of a sudden you've got hours a day in which to do other things and to use those brains that you've now enabled to grow."}, {"time": 6824, "text": "So with Homo erectus, you start the process of getting a bigger brain and famously, throughout the whole period of the evolution of the genus Homo, you have a steadily increasing size of brain until right at the end when it actually gets smaller, but that's a different story."}, {"time": 6842, "text": "Which end is this?"}, {"time": 6843, "text": "Which, are we talking about Homo sapiens?"}, {"time": 6846, "text": "Yeah, with Homo sapiens, you've got a smaller brain from, people haven't got it exactly down, but at least 30,000 years ago, it starts declining."}, {"time": 6857, "text": "And so the fascinating thing about that is that all domesticated animals have smaller brains than their wild ancestors."}, {"time": 6865, "text": "And I."}, {"time": 6870, "text": "The domestication is intricately connected to this brain size, you think?"}, {"time": 6874, "text": "And exactly, so I think what we're seeing in humans is that same manifestation."}, {"time": 6879, "text": "And then the fascinating question is why?"}, {"time": 6883, "text": "And the only point I would want to make about this is that there's no evidence that in the small brain domesticates, they're losing say an average about 15% of brain size."}, {"time": 6895, "text": "In the small brain domesticates compared to their wild ancestors, there's no indication of a loss of cognitive ability."}, {"time": 6903, "text": "So I think what's going on is that it's a younger brain."}, {"time": 6908, "text": "It's a more pedomorphic brain, looking like the juveniles of the ancestor."}, {"time": 6913, "text": "But just as our kids are very smart and can learn amazing things compared to adults, all they lack is wisdom and maturity, but in terms of sheer cognitive ability, they got it."}, {"time": 6925, "text": "And I think that's the same with domesticated animals compared to their wild ancestors, and probably therefore with Homo sapiens, say 30,000 years ago, compared to their ancestors."}, {"time": 6936, "text": "So we have smaller brains than Neanderthals."}, {"time": 6938, "text": "Size, Richard, isn't everything."}, {"time": 6945, "text": "What's the connection between fire, cooking, and the eating of meat?"}, {"time": 6950, "text": "Which came first, do you think?"}, {"time": 6953, "text": "Humans starting to enjoy the eating of meat or the invention of fire and the use of fire for cooking?"}, {"time": 6961, "text": "I think that fire increased the using of meat."}, {"time": 6964, "text": "But the fact that chimpanzees really like to hunt and kill meat, as do bonobos, certainly puts us in, so those two species have a common ancestor with us going six, seven million years ago, and it was from that common ancestor that you get the Australopithecine line."}, {"time": 6984, "text": "It's very likely therefore Australopithecines were eating meat when they could get it, which wouldn't be very often because they wouldn't be very good sprinters."}, {"time": 6991, "text": "But nevertheless, they would occasionally be able to get some meat, and I bet they loved it all the time, and basically all primates like meat if they can get it, almost all of them."}, {"time": 7001, "text": "But I think fire would have been very important for a couple of reasons."}, {"time": 7007, "text": "One is that once you eat your food cooked, then you're saving yourself time."}, {"time": 7015, "text": "By saving yourself time, you can free up the opportunity to go and hunt more."}, {"time": 7023, "text": "Because hunting is a high risk, high gain activity."}, {"time": 7027, "text": "There's every risk that you will get nothing on one particular afternoon that you go off looking for opportunities to kill."}, {"time": 7036, "text": "But it's high gain because when you do get something, you bring down a kudu, then you've got a serious amount of meat."}, {"time": 7046, "text": "What did males and females do with the time they were saving from not having to chew their food?"}, {"time": 7052, "text": "I think that in the case of males, it's very reasonable to think they spent a greatly increased amount of time hunting."}, {"time": 7059, "text": "So chimpanzees, they hunt maybe two or three times a month, and the average hunt length is 20 minutes."}, {"time": 7067, "text": "With humans, they're hunting maybe 20 times a month, and the average hunt length is six hours."}, {"time": 7077, "text": "So, and that's possible because the time was available, because they were cooking."}, {"time": 7081, "text": "Less chewing, more hunting."}, {"time": 7083, "text": "You got it."}, {"time": 7085, "text": "The other thing is that the meat is so much nicer."}, {"time": 7091, "text": "So when a chimpanzee kills a monkey, and I mean, they are so excited about killing a monkey."}, {"time": 7097, "text": "They're so excited about going into the hunt, and when they make the kill, then there's screams everywhere, and some don't like to seize it and capture it and take it away from the others, and eventually the strongest one has it, and the others sit around begging and trying to get some and tear it off, and so they all love it."}, {"time": 7140, "text": "I mean, they love it, but it takes them a lot of time to chew it."}, {"time": 7148, "text": "I mean, it's the same thing as for cooked food in general."}, {"time": 7151, "text": "So they are getting meat very slowly into their bodies, and there sometimes comes a time when they just say, I've had enough of this, I need real food, and they'll drop the meat and go off and eat fruit again because they can get fruit into their bodies so much faster than they can get meat."}, {"time": 7172, "text": "So once they're cooking, that problem is solved, and they can eat the meat much more readily."}, {"time": 7177, "text": "So I think that meat eating would become important for two reasons with cooking."}, {"time": 7182, "text": "So the key, not to oversimplify, but the key moments in human history are with Homo erectus, the discovery of fire and the use of fire for cooking, and then with Homo sapiens, the beta males killing off the alpha males so that the cooperation can exist, and cooperation leads to communication and language and ideas, the sharing of ideas, that kind of thing."}, {"time": 7210, "text": "Well, yes, the only thing I would modify on that is that you have to ask, how is it that the beta males were able to kill the alpha male?"}, {"time": 7221, "text": "And we now know that although chimpanzees do kill males within their own group sometimes, it's not a process of killing the alpha male."}, {"time": 7231, "text": "It's taking advantage of opportunity when some male gets into a bad position, but it's not a systematic ability to kill the alpha male."}, {"time": 7239, "text": "And you can see why, because they don't have language, and without language, it's very difficult to know how confident you can be of the support of others against a particular individual within your own group."}, {"time": 7253, "text": "When you're attacking someone from another group, that problem is solved."}, {"time": 7257, "text": "We all hate those guys, but the alpha male has got alliances within his group."}, {"time": 7266, "text": "Some of those allies might be willing to turn against him."}, {"time": 7271, "text": "Some of them might be harboring deep feelings of resentment, but how does anyone else know that?"}, {"time": 7277, "text": "So in other words, I think that you have to have some kind of language that is pretty good to solve the problems of gaining confidence that five of you say, or some number, can trust each other in this final attack."}, {"time": 7298, "text": "And even nowadays, it's difficult."}, {"time": 7302, "text": "I mean, you mentioned Stalin."}, {"time": 7304, "text": "It's like, why was everybody terrified?"}, {"time": 7308, "text": "Any dictator that takes control."}, {"time": 7310, "text": "Why is all of us as individuals terrified when you know there's millions of us?"}, {"time": 7317, "text": "And so like that, we lack the language, because our basic psychology of fear overtakes us."}, {"time": 7324, "text": "Like, who can we talk to?"}, {"time": 7326, "text": "Who can we talk to and not get killed ourselves?"}, {"time": 7328, "text": "Exactly, that's right."}, {"time": 7330, "text": "But do you have this intuition that some kind of language was developing along with this process of beta males taking over?"}, {"time": 7340, "text": "Yes, yes, I mean, once you have sufficient language to be able to have the beta males conspiring to kill the alpha male, then you have selection in favor of cooperation and tolerance, as we spoke about."}, {"time": 7353, "text": "And at that point, there will be increased ability to communicate and the language will get richer and better and better."}, {"time": 7361, "text": "So yes, absolutely, positive feedback loop once you get the situation started."}, {"time": 7368, "text": "Can you maybe comment on the full complexity and richness of the human mind through this process?"}, {"time": 7375, "text": "We've been casually saying cooking, fire, and beta males leading to cooperation."}, {"time": 7386, "text": "But how does the beauty of the human mind emerge from all of this?"}, {"time": 7390, "text": "Is there other further steps we need to understand?"}, {"time": 7393, "text": "Or is it as simple as this language emerging from taking over the alpha male and the cooperation?"}, {"time": 7401, "text": "Or am I also over romanticizing how amazing the human mind is?"}, {"time": 7405, "text": "Is it just like one small step in a long journey of evolution?"}, {"time": 7413, "text": "Well, if the beauty of the human mind is the ability of us all to be creative, to explore, that's one kind of beauty."}, {"time": 7429, "text": "Another kind of beauty is the empathy that we can show."}, {"time": 7436, "text": "And we think of that as beautiful because it is a kind of rare and special ability compared to the sort of ordinary selfishness that can commonly predominate."}, {"time": 7454, "text": "I suppose we have to think of different sources for those two types."}, {"time": 7462, "text": "I suppose a general answer is that there has been selection in favor of bigger brains, which probably in general has been associated with increasing cognitive ability."}, {"time": 7473, "text": "And as that has happened, the complexity of life has increased because people have more and more complex, highly differentiated strategies in response to each other's more complex, highly differentiated strategies."}, {"time": 7493, "text": "We get to a point where there is deception and self deception."}, {"time": 7497, "text": "There is a manipulation of ideas through stories that we invent and stories that we pass on."}, {"time": 7509, "text": "I guess all I'm wanting to say is that there is a world of the mind that evolves in response to these platforms that are put there."}, {"time": 7525, "text": "The platform of increasing brain size and therefore cognitive ability made possible by increased energy supply."}, {"time": 7534, "text": "The platform of cooperation and tolerance in a world in which there remains a lot of conflict and therefore a need to respond to the conflict and manipulate your allies appropriately."}, {"time": 7550, "text": "I don't see beauty as coming, either kind of beauty as coming sort of totally independently of these things."}, {"time": 7556, "text": "You know, I don't think there's a selection for staring into the sunset and creating poetry."}, {"time": 7563, "text": "You know, but I guess sexual selection, you know, males wanting to impress females in different ways will lead to them wanting to."}, {"time": 7573, "text": "Write poetry?"}, {"time": 7575, "text": "Well, yes, you know, show off."}, {"time": 7576, "text": "Yeah, in all the different ways."}, {"time": 7578, "text": "So all of these are natural consequences of just coming up with strategies of how to cooperate and how to achieve certain ends."}, {"time": 7587, "text": "So that's just like a natural."}, {"time": 7589, "text": "Yeah, I mean, we haven't spoken about sexual selection, but that is a really important part of it."}, {"time": 7594, "text": "You know, they try to out compete each other in, you know, normally without any physical conflict, just in order to be able to be chosen by mates of the opposite sex."}, {"time": 7606, "text": "And that is certainly a major source of creativity."}, {"time": 7613, "text": "So you've studied chimps."}, {"time": 7616, "text": "You also, all the other relatives, gorillas."}, {"time": 7619, "text": "What do you find beautiful and fascinating about chimps, about gorillas, about humans?"}, {"time": 7623, "text": "Maybe you can paint the whole picture of that evolutionary, that little local pocket of the evolutionary tree."}, {"time": 7630, "text": "How are we related?"}, {"time": 7632, "text": "What is the common ancestor?"}, {"time": 7634, "text": "What are the interesting differences?"}, {"time": 7635, "text": "I know I'm asking a million questions, but can you paint a map of what are chimps, gorillas, and humans, like how we're related, and what you find fascinating about each?"}, {"time": 7649, "text": "In Africa, straddling the equator, there is a strip of rainforest that relies on the combination of high temperatures and rainfall that you get around the equator."}, {"time": 7665, "text": "That rainforest goes into about 22 countries."}, {"time": 7671, "text": "And throughout those countries, you have chimpanzees, although they've gone extinct in two of them."}, {"time": 7678, "text": "In just a fraction of them, but it was five countries, you've got gorillas, where there are mountains."}, {"time": 7689, "text": "And in one country, on the left bank of the Great Congo River, you have bonobos."}, {"time": 7697, "text": "So in the African forest, you've got these three African apes, the only African apes, all of which are very similar in much of their way of life."}, {"time": 7710, "text": "They walk on their knuckles through the forest, looking for fruit trees, and eating herbs when they can't find fruits."}, {"time": 7721, "text": "Gorillas represent the oldest chain."}, {"time": 7726, "text": "So about 10 million years ago, maybe as recently as eight million years ago, the ancestor of gorillas broke off from the ancestor leading to chimps and bonobos and humans."}, {"time": 7738, "text": "So they've probably remained very similar now to what, very similar to what they were then."}, {"time": 7744, "text": "They were probably the largest apes, living in montane areas and spending more time eating just herbs, stems, not so vitally dependent on fruit."}, {"time": 7762, "text": "And living in, if it was like the present, groups up to about 50 stable groups, with one alpha male who was in charge."}, {"time": 7777, "text": "Gorillas are wonderfully slow and inquisitive compared to chimps and bonobos."}, {"time": 7786, "text": "And I had the privilege of spending a week or two with gorillas at Dian Fossey's camp before she was murdered."}, {"time": 7798, "text": "And I went out with two women, Kelly and Barb, to a particular group."}, {"time": 7807, "text": "And there was a young female in the group called Simba."}, {"time": 7812, "text": "And Simba approached us and stared at the two women."}, {"time": 7816, "text": "And then she came towards me and she very deliberately reached out her knuckles and touched me on the forehead."}, {"time": 7826, "text": "She was watched in doing this by a young male who was quite keen on her."}, {"time": 7834, "text": "And he was called Digit."}, {"time": 7835, "text": "And about five minutes later, Digit stood in front of us on the path."}, {"time": 7842, "text": "And Kelly was in front of me, and then there was Barb, and then there was me."}, {"time": 7848, "text": "And he came charging down the path and he sidestepped around Kelly, and he sidestepped around Barb, and me, he just knocked with his arm and sent me flying about five yards into the bushes."}, {"time": 7860, "text": "And I love the way that that was a very deliberate response."}, {"time": 7866, "text": "And I love the way that Simba had been so interested in me and held my eye."}, {"time": 7872, "text": "Chimps and bonobos never hold your eye, but gorillas really look as though they're trying to sort of figure out what are you thinking about?"}, {"time": 7879, "text": "That was a species that has, goes back for something like 10 million years."}, {"time": 7886, "text": "In that situation, was there a game being played?"}, {"time": 7891, "text": "Well, I mean, I felt that Digit was telling me, I don't want you messing with Simba."}, {"time": 7897, "text": "But was Simba using you?"}, {"time": 7901, "text": "Well, that's a fun idea."}, {"time": 7903, "text": "I don't see why she should be using me, but you mean to use me?"}, {"time": 7906, "text": "I see why she should be using me, but you mean testing how strongly Digit was prepared to intervene to?"}, {"time": 7914, "text": "Oh, that's come straight out of a sort of adolescent high school playbook."}, {"time": 7918, "text": "All right, well, that's all."}, {"time": 7919, "text": "No, no, no, there's nothing wrong with it for that."}, {"time": 7924, "text": "I never thought of that, and you never know."}, {"time": 7929, "text": "So, yeah, so, okay, so this is an ancient branch of the evolutionary tree, this gorilla that led to gorillas."}, {"time": 7937, "text": "Gorillas."}, {"time": 7939, "text": "So then the next thing that happened on the evolutionary tree was six or seven million years ago when you have the line between chimps and bonobos on the one hand and humans on the other splitting."}, {"time": 7954, "text": "And basically what happened is that at that point, a chimp like ancestor leaves the forest, gets isolated in an area outside the forest and adapts, and that becomes the Australopithecines and meanwhile, the chimpanzees and bonobo ancestor continues in the forest."}, {"time": 7973, "text": "And later what happens is that one branch of that crosses the Congo River and becomes the bonobos."}, {"time": 7981, "text": "That was only about two million years ago, maybe one million years ago."}, {"time": 7985, "text": "Now the chimps that remained in the forest throughout this time and occupied all the countries across from west to east Africa now, again, we assume that they're pretty similar to the ones that live nowadays, where there's some variation from west to east."}, {"time": 8001, "text": "And these are animals that live in social communities of between say 20 and 200."}, {"time": 8009, "text": "They have a lot of them in one group, but they never come together in a single unit."}, {"time": 8015, "text": "These are, they share an area, a community territory, and that area is defended by males and within it, females wander and bring up their young independently."}, {"time": 8026, "text": "And the females are very scared about the possibility that males will be mean to their infants."}, {"time": 8035, "text": "And in order to avoid them doing that, they do their best to mate with every single male in the group multiple times, as if to give a memory in that male of, yeah, yeah, I reminded you, so I'm not gonna be mean to your baby."}, {"time": 8051, "text": "So what's wonderful about chimps?"}, {"time": 8052, "text": "Well, you know, as we've spoken about them, they are creative and sort of amazingly humanlike, but I love the sort of, you know, the quiet moments."}, {"time": 8062, "text": "And here's one."}, {"time": 8065, "text": "I've got two chimps who are grooming each other on a day when they are utterly exhausted."}, {"time": 8073, "text": "They've walked 11 kilometers the day before, up and down hills."}, {"time": 8079, "text": "And on this particular day, all they do is they get to one tree and they eat from that tree."}, {"time": 8085, "text": "And other than that, they only walk about 100 yards and they go back to sleep in the nest in which they woke up."}, {"time": 8092, "text": "So they're utterly exhausted and they're just eating nonstop because they're trying to recover their energy."}, {"time": 8099, "text": "And this is Hugh and Charlie."}, {"time": 8102, "text": "And we think they were probably brothers."}, {"time": 8104, "text": "They've never actually got the genetic evidence to prove it."}, {"time": 8108, "text": "Well, I never remember now who it is, but let's say that they both come down from the tree and they're both carrying branches of the food."}, {"time": 8122, "text": "They're actually seeds from these branches."}, {"time": 8125, "text": "They're both engaged, even in the midday sun when they want to come down and unshade themselves for a bit on the ground, they're still eating."}, {"time": 8134, "text": "But then Charlie finishes his branch and he starts grooming Hugh."}, {"time": 8142, "text": "And Hugh continues eating from his branch."}, {"time": 8148, "text": "Charlie eventually gets bored of this after a few minutes and he reaches out and he lifts the branch from which Hugh is still taking seeds and puts it over his head and puts it behind his back as far as possible away from Hugh."}, {"time": 8168, "text": "Hugh doesn't do anything."}, {"time": 8170, "text": "He just finishes his mouthful and then he turns to Charlie and grooms him."}, {"time": 8175, "text": "So this very polite way of saying, will you groom me please has worked."}, {"time": 8179, "text": "Then Hugh grooms around Charlie's back and around to the right side and then down his arm to what point where he can reach the branch again."}, {"time": 8193, "text": "And then he picks up the branch and continues nonchalantly."}, {"time": 8198, "text": "So in other words, a very sort of simple little strategy but it just shows the courtesy with which they can treat each other."}, {"time": 8207, "text": "And the days I love with chimps are when you see that sort of thing or when you see mothers just lying in a sunlit patch in the forest with their babies bouncing on top of them, just having a wonderful peaceful time."}, {"time": 8221, "text": "And that's what most of their lives are like."}, {"time": 8226, "text": "So chimpanzees are the species that kind of unites the rest of the apes because a gorilla is in many ways just a big version of a chimpanzee."}, {"time": 8236, "text": "If you can sort of engineer a chimpanzee in your mind to be bigger, it basically turns into a gorilla."}, {"time": 8242, "text": "And then bonobos on the left bank of the Congo River are like a domesticated form of a chimpanzee but obviously humans didn't domesticate them."}, {"time": 8253, "text": "So they're self domesticated."}, {"time": 8255, "text": "They are less aggressive and they show all the marks of domestication that domestication animals do compared to wild animals in their bones."}, {"time": 8264, "text": "So they have reduced differences between males and females in which the males are more like females."}, {"time": 8269, "text": "They have smaller brains, they have shorter faces, smaller teeth and smaller bodies."}, {"time": 8275, "text": "All the things that domesticated animals show."}, {"time": 8277, "text": "And bonobos live in this environment in a strikingly peaceful way compared to the chimpanzees."}, {"time": 8285, "text": "There's no indication that they will have these aggressive kills and enough data now to show that there's a statistical difference in the frequency of which it would happen."}, {"time": 8296, "text": "And bonobos are famously erotic."}, {"time": 8301, "text": "The females have enlarged sexual parts which swell to particularly large size compared to the female chimpanzees."}, {"time": 8313, "text": "And the females have a lot of interactions with each other in which they excitedly rub their clitorises together and appear to have orgasms."}, {"time": 8325, "text": "And these occur in the context of some kind of social tension."}, {"time": 8332, "text": "And they sometimes happen before, they sometimes happen after the social tension, and they seem to be devices, these interactions, for ensuring that everyone's friends and reducing the chances that they're actually gonna get into a fight."}, {"time": 8345, "text": "So it's a kind of conflict resolution through sex or some kind of pleasurable sexual experience."}, {"time": 8353, "text": "Well, it's often characterized as make love, not war."}, {"time": 8355, "text": "Make love, not war."}, {"time": 8358, "text": "Okay, you mentioned to me offline that you have a deep love for nature."}, {"time": 8366, "text": "If we look at the world today, how can we ensure that the beautiful parts of nature remain a big part of our lives as human beings in the way we think about it, in the way we also keep it around, preserve it?"}, {"time": 8386, "text": "You know, we keep it part of our minds and part of our world."}, {"time": 8391, "text": "It's a very difficult question because every time there was a conflict between conservation of a natural habitat and allowing people to get that little bit of extra food for their babies, then naturally the tendency is for the humans to win."}, {"time": 8413, "text": "And so we have this steady erosion in the face of tremendous efforts to conserve nature."}, {"time": 8422, "text": "We have a continuing steady erosion of habitats and all the species, and the numbers are always in the wrong direction."}, {"time": 8431, "text": "Occasionally you get sort of wonderful little examples of something being saved, but the overall trend is clear."}, {"time": 8440, "text": "And it's very difficult to see how one can ever escape that because it's not human."}, {"time": 8446, "text": "Now that we are essentially a single tribe, to want to save an elephant if it means killing 20 humans."}, {"time": 8457, "text": "So I think the only way in which we can really conserve is if we put tremendous effort into conserving the very best representative areas of nature."}, {"time": 8475, "text": "Often this will be the national parks that already exist."}, {"time": 8478, "text": "And what we have to do is to make them so valuable that actually it is worth it in terms of human survival to be able to keep those sorts of places."}, {"time": 8489, "text": "And that's the attitude that my colleagues and I have taken in Uganda, where we want to keep the Kibale National Park alive, which has got the largest population chimpanzees in Uganda, and it's got elephants and wonderful birds and wonderful butterflies and wonderful plants and so on, and visitors, and lots and lots of visitors."}, {"time": 8511, "text": "It may be that we're going to have to have huge increases in the amount of charges that you pay for ecotourism."}, {"time": 8518, "text": "And you need to make sure that ecotourism is done right."}, {"time": 8522, "text": "In other places, you will keep nature there because it's useful for maintaining the climate, bringing rain."}, {"time": 8535, "text": "Maybe you can in some places convince people of the sheer sort of aesthetics of keeping nature that even over the long term, presidents whose job it is to look for the future of the country will be persuaded that you can do it for purely aesthetic reasons."}, {"time": 8559, "text": "But overall, what is required is for people in the rich countries to do much more investment than they have so far in maintaining both the natural places in their own countries and in the tropics."}, {"time": 8581, "text": "And if you look at Africa, I mean, the population trends are that Nigeria may become the most populous country in the world, I think, or within a century."}, {"time": 8596, "text": "The future of African habitats, you know, it's clear what's gonna happen in general."}, {"time": 8601, "text": "There's gonna be a huge conversion towards agricultural land."}, {"time": 8608, "text": "I heard Ed Wilson speak years ago about the prospect of the entire globe being turned into a single human feedlot."}, {"time": 8622, "text": "It's gonna take a lot to avoid that."}, {"time": 8624, "text": "He is out there calling for half the earth to be devoted to nature."}, {"time": 8633, "text": "It's incredibly ambitious and incredibly optimistic."}, {"time": 8636, "text": "But unless you have really exciting goals, probably nothing will be achieved."}, {"time": 8642, "text": "Yeah, I mean, there's something to me, like when I visit New York and I see Central Park and then somehow constructed a situation where you preserve this park in the middle of the park, probably some of the most expensive land in the world."}, {"time": 8657, "text": "The fact that that's possible gives me hope that you can do this kind of preservation at a global scale, perhaps for just the aesthetic reasons of just valuing the beauty and just respecting our origins of having come from the earth."}, {"time": 8675, "text": "We are so incredibly lucky to have chimpanzees, bonobos and gorillas as our close relatives still living on the earth."}, {"time": 8684, "text": "We're unlucky that we don't have Australopithecines and other species of homo, but we're still lucky to have those because they are incredibly closely related to us compared to what most animals have."}, {"time": 8694, "text": "There are many animals that don't have any close relatives to them on the earth."}, {"time": 8698, "text": "But not only are they relatively close, but they teach us so much about ourselves."}, {"time": 8704, "text": "The similarities between them and ourselves raise questions that we can then test about the extent to which our own behavioral propensities are derived from the same evolutionary stock as in those great apes."}, {"time": 8718, "text": "Well, how much is that worth?"}, {"time": 8721, "text": "I mean, we could spend billions going to the Mars to find evidence of bacteria there, and that's fascinating too."}, {"time": 8730, "text": "But we should be spending billions on this earth in order to make sure that we have, I don't know how to say it, substantial representative populations of these close relatives."}, {"time": 8745, "text": "Yeah, that we can meet."}, {"time": 8747, "text": "There's something like space tourism when you go out into space and you look back down on earth."}, {"time": 8753, "text": "That's to a lot of people, including myself, is worth a lot."}, {"time": 8758, "text": "But why is that worth a lot?"}, {"time": 8759, "text": "Is because it's humbling and beautiful in the same way that meeting our close evolutionary relatives is humbling and beautiful."}, {"time": 8773, "text": "Just to know that this is what we come from."}, {"time": 8777, "text": "This is who we are."}, {"time": 8779, "text": "Not just for the understanding or the science of it, but just something about just the beauty of witnessing this."}, {"time": 8786, "text": "And again, it's both humbling and empowering that this place is fragile and we're damn lucky to be here."}, {"time": 8796, "text": "Yes, and unfortunately, the problems are incredibly difficult to solve and there is no one solver."}, {"time": 8802, "text": "It has to happen from a network of potentially cooperating people."}, {"time": 8807, "text": "But I mean, you're so right about it being daunting to think about what it looks like from space."}, {"time": 8812, "text": "And I love the view that Herman Muller expressed of being able to go out from space."}, {"time": 8819, "text": "And he said the whole of life would look like a kind of rust on the planet."}, {"time": 8826, "text": "Yeah, so the aliens were to visit."}, {"time": 8828, "text": "I'm not sure they would notice the life."}, {"time": 8830, "text": "They would probably notice the trees or ocean."}, {"time": 8835, "text": "It's a kind of rust."}, {"time": 8837, "text": "But let me ask the big ridiculous philosophical question."}, {"time": 8841, "text": "What is the meaning of this rust?"}, {"time": 8843, "text": "What do you think is the meaning of life on Earth?"}, {"time": 8846, "text": "What is the meaning of our human intelligent life?"}, {"time": 8851, "text": "Well, I think it's very clear that we have an evolutionary story that is only getting challenged around the edges."}, {"time": 8861, "text": "We have a very clear understanding of the evolution of life."}, {"time": 8864, "text": "And the meaning is we are here as a consequence of materialistic processes that began, in our sense, with the establishment of the Earth four and a half billion years ago, whatever it was, and then water and oxygen and so on."}, {"time": 8889, "text": "And we are the astonishing consequence of the evolution of cells and multicellular organisms."}, {"time": 8898, "text": "The word random is the wrong word to use unless you understand what it means."}, {"time": 8904, "text": "You know, it didn't happen by chance, but a lot of random events had to happen to make this possible."}, {"time": 8912, "text": "And those random events, of course, are the production of appropriate mutations."}, {"time": 8917, "text": "But the meaning of life is there is no meaning."}, {"time": 8923, "text": "The really big mystery of life is why is there a universe?"}, {"time": 8929, "text": "And that same why propagates itself through the whole of it, through the whole process of it, for the emergence of planets, the emergence, first of all, of galaxies, of star systems."}, {"time": 8942, "text": "Of planets, of the proteins required to construct the single cell organisms and the single cell organism becoming complex organisms and some of the clever fish crawling out onto the land and the whole of it."}, {"time": 8960, "text": "And then there's fire, some clever guy or lady invented fire, and then now here we are."}, {"time": 8968, "text": "It just does seem, speaking as a human, kind of special that we're able to reflect on the whole thing or the whole..."}, {"time": 8976, "text": "Wonderful story."}, {"time": 8977, "text": "So much more interesting than the stories produced by religion."}, {"time": 8980, "text": "Yeah, it is beautiful, but it just seems special that us humans are able to write religions and construct stories and also do science."}, {"time": 8991, "text": "That seems kind of amazing."}, {"time": 8996, "text": "It seems like the universe is such that it creates beings like us that are able to investigate it."}, {"time": 9010, "text": "And that's why there's this longing for why."}, {"time": 9014, "text": "That's just such a beautiful little pocket of complexity created by the universe."}, {"time": 9021, "text": "It seems like there should be a why, but maybe there's just an infinite number of universes and this is the one that led to this particular set of humans."}, {"time": 9033, "text": "Even without an infinite number of universes, I bet there's an infinite number of intelligent beings."}, {"time": 9037, "text": "Throughout this universe."}, {"time": 9039, "text": "Yeah, now that we know how many planets have the right sort of conditions, which is what, I can't remember, a lot."}, {"time": 9046, "text": "It's some significant percentage of all planets."}, {"time": 9049, "text": "Then there are apparently billions of planets."}, {"time": 9054, "text": "Things happen so quickly on Earth."}, {"time": 9059, "text": "Once you've got water, then you've got life."}, {"time": 9062, "text": "It did not take long for life to evolve in the big scheme of things."}, {"time": 9069, "text": "And if you think, you look out there, say there's a nearly infinite number of intelligent civilizations, one dimension you can look at is the proclivity to violence they have."}, {"time": 9081, "text": "It's interesting to think what level of violence is useful for extending the life of a civilization."}, {"time": 9090, "text": "So we have a particular set of violence in our history."}, {"time": 9093, "text": "Maybe being too peaceful is a problem in the early days."}, {"time": 9097, "text": "Maybe being too violent, quite obviously, is a problem."}, {"time": 9101, "text": "So you look at viruses."}, {"time": 9102, "text": "What kind of viruses on Earth propagate and succeed?"}, {"time": 9106, "text": "If you're too deadly, that's a big problem."}, {"time": 9109, "text": "If you're not deadly enough, that's also a problem."}, {"time": 9112, "text": "So that is a fascinating exploration of..."}]}]