[{"title": "Joscha Bach: Nature of Reality, Dreams, and Consciousness | Lex Fridman Podcast #212", "id": "rIpUf-Vy2JA", "quotes": [{"time": 250, "text": "There is a large perceptual system combined with a motivational system that is actually providing the interface to everything and our own consciousness."}, {"time": 258, "text": "I think is the tool that directs the attention of that system, which means it singles out features and performs conditional operations for which it needs an index memory."}, {"time": 268, "text": "But this index memory is what we perceive as our stream of consciousness."}, {"time": 272, "text": "But the consciousness is not in charge."}, {"time": 274, "text": "That's an illusion."}, {"time": 275, "text": "So everything outside of that consciousness is the elephant."}, {"time": 281, "text": "So it's the physics of the universe, but it's also society that's outside of your..."}, {"time": 286, "text": "I would say the elephant is the agent."}, {"time": 288, "text": "So there is an environment to which the agent is stomping and you are influencing a little part of that agent."}, {"time": 295, "text": "So is the agent a single human being?"}, {"time": 298, "text": "Which object has agency?"}, {"time": 303, "text": "I think a way to think about an agent is that it's a controller with a set point generator."}, {"time": 310, "text": "The notion of a controller comes from cybernetics and control theory."}, {"time": 314, "text": "Control system consists out of a system that is regulating some value and the deviation of that value from a set point."}, {"time": 323, "text": "And it has a sensor that measures the system's deviation from that set point and an effector that can be parametrized by the controller."}, {"time": 332, "text": "So the controller tells the effector to do a certain thing."}, {"time": 335, "text": "And the goal is to reduce the distance between the set point and the current value of the system."}, {"time": 340, "text": "And there's an environment which disturbs the regulated system, which brings it away from that set point."}, {"time": 345, "text": "So simplest case is a thermostat."}, {"time": 347, "text": "The thermostat is really simple because it doesn't have a model."}, {"time": 350, "text": "The thermostat is only trying to minimize the set point deviation in the next moment."}, {"time": 355, "text": "And if you want to minimize the set point deviation over a longer time span, you need to integrate it."}, {"time": 360, "text": "You need to model what is going to happen."}, {"time": 363, "text": "So for instance, when you think about that your set point is to be comfortable in life, maybe you need to make yourself uncomfortable first, right?"}, {"time": 371, "text": "So you need to make a model of what's going to happen when."}, {"time": 374, "text": "And this is task of the controller is to use its sensors to measure the state of the environment and the system that is being regulated and figure out what to do."}, {"time": 384, "text": "And if the task is complex enough, the set points are complicated enough."}, {"time": 390, "text": "And if the controller has enough capacity and enough sensor feedback, then the task of the controller is to make a model of the entire universe that it's in, the conditions under which it exists and of itself."}, {"time": 402, "text": "And this is a very complex agent."}, {"time": 403, "text": "And we are in that category."}, {"time": 405, "text": "And an agent is not necessarily a thing in the universe."}, {"time": 409, "text": "It's a class of models that we use to interpret aspects of the universe."}, {"time": 414, "text": "And when we notice the environment around us, a lot of things only make sense at the level that should be entangled with them if we interpret them as control systems that make models of the world and try to minimize their own set points."}, {"time": 427, "text": "So the models are the agents."}, {"time": 430, "text": "The agent is a class of model."}, {"time": 432, "text": "And we notice that we are an agent ourselves."}, {"time": 434, "text": "We are the agent that is using our own control model to perform actions."}, {"time": 438, "text": "We notice we produce a change in the model and things in the world change."}, {"time": 443, "text": "And this is how we discover the idea that we have a body, that we are situated environment, and that we have a first person perspective."}, {"time": 451, "text": "Still don't understand what's the best way to think of which object has agency with respect to human beings."}, {"time": 459, "text": "Is it the body?"}, {"time": 461, "text": "Is it the brain?"}, {"time": 463, "text": "Is it the contents of the brain as agency?"}, {"time": 466, "text": "Like what's the actuators that you're referring to?"}, {"time": 469, "text": "What is the controller and where does it reside?"}, {"time": 472, "text": "Or is it these impossible things?"}, {"time": 474, "text": "Because I keep trying to ground it to space time, the three dimension of space and the one dimension of time."}, {"time": 481, "text": "What's the agent in that for humans?"}, {"time": 484, "text": "There is not just one."}, {"time": 486, "text": "It depends on the way in which you're looking at this thing in which you're framing it."}, {"time": 490, "text": "Imagine that you are, say Angela Merkel, and you are acting on behalf of Germany."}, {"time": 496, "text": "Then you could say that Germany is the agent."}, {"time": 499, "text": "And in the mind of Angela Merkel, she is Germany to some extent, because in the way in which she acts, the destiny of Germany changes."}, {"time": 508, "text": "There are things that she can change that basically affect the behavior of that nation state."}, {"time": 513, "text": "Okay, so it's hierarchies of, to go to another one of your tweets with I think you were playfully mocking Jeff Hawkins with saying his brain's all the way down."}, {"time": 525, "text": "So it's like, it's agents all the way down."}, {"time": 529, "text": "It's agents made up of agents, made up of agents."}, {"time": 531, "text": "Like if Angela Merkel's Germany and Germany's made up a bunch of people and the people are themselves agents in some kind of context."}, {"time": 541, "text": "And then people are made up of cells, each individual."}, {"time": 544, "text": "So is it agents all the way down?"}, {"time": 547, "text": "I suspect that has to be like this in a world where things are self organizing."}, {"time": 552, "text": "Most of the complexity that we are looking at, everything in life is about self organization."}, {"time": 558, "text": "So I think up from the level of life, you have agents."}, {"time": 564, "text": "And below life, you rarely have agents because sometimes you have control systems that emerge randomly in nature and try to achieve a set point, but they're not that interesting agents that make models."}, {"time": 576, "text": "And because to make an interesting model of the world, you typically need a system that is true and complete."}, {"time": 586, "text": "What's the line between life and non life?"}, {"time": 588, "text": "It's personal because you're a life form."}, {"time": 592, "text": "So what do you think in this emerging complexity, at which point does the things that are being living and have agency?"}, {"time": 600, "text": "Personally, I think that the simplest answer that is that life is cells because... Life is what?"}, {"time": 605, "text": "Cells."}, {"time": 607, "text": "So it's a particular kind of principle that we have discovered to exist in nature."}, {"time": 611, "text": "It's modular stuff that consists out of basically this DNA tape with a read write head on top of it, that is able to perform arbitrary computations and state transitions within the cell."}, {"time": 625, "text": "And it's combined with a membrane that insulates the cell from its environment."}, {"time": 630, "text": "And there are chemical reactions inside of the cell that are in disequilibrium."}, {"time": 636, "text": "And the cell is running in such a way that this disequilibrium doesn't disappear."}, {"time": 641, "text": "And the cell goes into an equilibrium state, it dies."}, {"time": 646, "text": "And it requires something like an neck entropy extractor to maintain this disequilibrium."}, {"time": 651, "text": "So it's able to harvest like entropy from its environment and keep itself running."}, {"time": 657, "text": "Yeah, so there's information and there's a wall to maintain this disequilibrium."}, {"time": 664, "text": "But isn't this very earth centric?"}, {"time": 666, "text": "Like what you're referring to as a..."}, {"time": 668, "text": "I'm not making a normative notion."}, {"time": 670, "text": "You could say that there are probably other things in the universe that are cell like and life like, and you could also call them life, but eventually it's just a willingness to find an agreement of how to use the terms."}, {"time": 683, "text": "I like cells because it's completely coextential with the way that we use the word even before we knew about cells."}, {"time": 690, "text": "So people were pointing at some stuff and saying, this is somehow animate."}, {"time": 694, "text": "And this is very different from the non animate stuff."}, {"time": 696, "text": "And what's the difference between the living and the dead stuff."}, {"time": 700, "text": "And it's mostly whether the cells are working or not."}, {"time": 702, "text": "And also this boundary of life, where we say that for instance, the virus is basically an information packet that is subverting the cell and not life by itself."}, {"time": 712, "text": "That makes sense to me."}, {"time": 714, "text": "And it's somewhat arbitrary."}, {"time": 715, "text": "You could of course say that systems that permanently maintain a disequilibrium and can self replicate are always life."}, {"time": 723, "text": "And maybe that's a useful definition too, but this is eventually just how you want to use the word."}, {"time": 730, "text": "Is it so useful for conversation, but is it somehow fundamental to the universe?"}, {"time": 737, "text": "Do you think there's a actual line to eventually be drawn between life and non life?"}, {"time": 741, "text": "Or is it all a kind of continuum?"}, {"time": 744, "text": "I don't think it's a continuum, but there's nothing magical that is happening."}, {"time": 748, "text": "Living systems are a certain type of machine."}, {"time": 751, "text": "What about non living systems?"}, {"time": 752, "text": "Is it also a machine?"}, {"time": 754, "text": "There are non living machines, but the question is at which point is a system able to perform arbitrary state transitions to make representations."}, {"time": 764, "text": "And living things can do this."}, {"time": 766, "text": "And of course we can also build non living things that can do this, but we don't know anything in nature that is not a cell and is not created by still alive that is able to do that."}, {"time": 778, "text": "Not only do we not know, I don't think we have the tools to see otherwise."}, {"time": 785, "text": "I always worry that we look at the world too narrowly."}, {"time": 791, "text": "Like there could be life of a very different kind right under our noses that we're just not seeing because we're not either limitations of our cognitive capacity, or we're just not open minded enough either with the tools of science or just the tools of our mind."}, {"time": 812, "text": "Yeah, that's possible."}, {"time": 813, "text": "I find this thought very fascinating."}, {"time": 815, "text": "And I suspect that many of us ask ourselves since childhood, what are the things that we are missing?"}, {"time": 820, "text": "What kind of systems and interconnections exist that are outside of our gaze?"}, {"time": 827, "text": "But we are looking for it and physics doesn't have much room at the moment for opening up something that would not violate the conservation of information as we know it."}, {"time": 843, "text": "Yeah, but I wonder about time scale and scale, spatial scale, whether we just need to open up our idea of what, like how life presents itself."}, {"time": 855, "text": "It could be operating in a much slower time scale, a much faster time scale."}, {"time": 860, "text": "And it's almost sad to think that there's all this life around us that we're not seeing because we're just not like thinking in terms of the right scale, both time and space."}, {"time": 874, "text": "What is your definition of life?"}, {"time": 876, "text": "What do you understand as life?"}, {"time": 880, "text": "Entities of sufficiently high complexity that are full of surprises."}, {"time": 886, "text": "I don't know, I don't have a free will."}, {"time": 893, "text": "So that just came out of my mouth."}, {"time": 895, "text": "I'm not sure that even makes sense."}, {"time": 897, "text": "There's certain characteristics."}, {"time": 899, "text": "So complexity seems to be a necessary property of life."}, {"time": 904, "text": "And I almost want to say it has ability to do something unexpected."}, {"time": 913, "text": "It seems to me that life is the main source of complexity on earth."}, {"time": 919, "text": "And complexity is basically a bridgehead that order builds into chaos by modeling, by processing information in such a way that you can perform reactions that would not be possible for dump systems."}, {"time": 933, "text": "And this means that you can harvest neck entropy that dump systems cannot harvest."}, {"time": 937, "text": "And this is what complexity is mostly about."}, {"time": 940, "text": "In some sense, the purpose of life is to create complexity."}, {"time": 946, "text": "Increasing."}, {"time": 946, "text": "I mean, there seems to be some kind of universal drive towards increasing pockets of complexity."}, {"time": 957, "text": "That seems to be like a fundamental, I don't know if it's a property of the universe or it's just a consequence of the way the universe works, but there seems to be this small pockets of emergent complexity that builds on top of each other and starts having like greater and greater complexity by having like a hierarchy of complexity."}, {"time": 977, "text": "Little organisms building up a little society that then operates almost as an individual organism itself."}, {"time": 984, "text": "And all of a sudden you have Germany and Merkel."}, {"time": 987, "text": "Well, that's not obvious to me."}, {"time": 988, "text": "Everything that goes up has to come down at some point."}, {"time": 992, "text": "So if you see this big exponential curve somewhere, it's usually the beginning of an S curve where something eventually reaches saturation."}, {"time": 1001, "text": "And the S curve is the beginning of some kind of bump that goes down again."}, {"time": 1005, "text": "And there is just this thing that when you are in sight of an evolution of life, you are on top of a puddle of negentropy that is being sucked dry by life."}, {"time": 1018, "text": "And during that happening, you see an increase in complexity because life forms are competing with each other to get more and more finer and finer corner of that negentropy extraction."}, {"time": 1031, "text": "I feel like that's a gradual beautiful process like that's almost follows a process akin to evolution."}, {"time": 1038, "text": "And the way it comes down is not the same way it came up."}, {"time": 1042, "text": "The way it comes down is usually harshly and quickly."}, {"time": 1047, "text": "So usually there's some kind of catastrophic event."}, {"time": 1050, "text": "The Roman Empire took a long time."}, {"time": 1052, "text": "But would that be, would you classify this as a decrease in complexity though?"}, {"time": 1060, "text": "I think that this size of the cities that could be fed has decreased dramatically."}, {"time": 1064, "text": "And you could see that the quality of the art decreased and it did so gradually."}, {"time": 1069, "text": "And maybe future generations, when they look at the history of the United States in the 21st century, will also talk about the gradual decline, not something that suddenly happens."}, {"time": 1085, "text": "Do you have a sense of where we are?"}, {"time": 1087, "text": "Are we on the exponential rise?"}, {"time": 1089, "text": "Are we at the peak?"}, {"time": 1091, "text": "Or are we at the downslope of the United States empire?"}, {"time": 1095, "text": "It's very hard to say from a single human perspective, but it seems to me that we are probably at the peak."}, {"time": 1105, "text": "I think that's probably the definition of like optimism and cynicism."}, {"time": 1109, "text": "So my nature of optimism is, I think we're on the rise."}, {"time": 1116, "text": "I think this is just all a matter of perspective."}, {"time": 1119, "text": "Nobody knows, but I do think that erring on the side of optimism, like you need a sufficient number, you need a minimum number of optimists in order to make that up thing actually work."}, {"time": 1130, "text": "And so I tend to be on the side of the optimists."}, {"time": 1133, "text": "I think that we are basically a species of grasshoppers that have turned into locusts."}, {"time": 1138, "text": "And when you are in that locust mode, you see an amazing rise of population numbers and of the complexity of the interactions between the individuals."}, {"time": 1148, "text": "But it's ultimately the question is, is it sustainable?"}, {"time": 1152, "text": "See, I think we're a bunch of lions and tigers that have become domesticated cats, to use a different metaphor."}, {"time": 1161, "text": "As I'm not exactly sure we're so destructive, we're just softer and nicer and lazier."}, {"time": 1167, "text": "But I think we have monkeys and not the cats."}, {"time": 1169, "text": "And if you look at the monkeys, they are very busy."}, {"time": 1173, "text": "The ones that have a lot of sex, those monkeys?"}, {"time": 1175, "text": "Not just the bonobos."}, {"time": 1177, "text": "I think that all the monkeys are basically a discontent species that always needs to meddle."}, {"time": 1182, "text": "Well, the gorillas seem to have a little bit more of a structure, but it's a different part of the tree."}, {"time": 1190, "text": "Okay, you mentioned the elephant and the monkey riding the elephant."}, {"time": 1195, "text": "And consciousness is the monkey."}, {"time": 1200, "text": "And there's some prodding that the monkey gets to do."}, {"time": 1203, "text": "And sometimes the elephant listens."}, {"time": 1206, "text": "I heard you got into some contentious, maybe you can correct me, but I heard you got into some contentious free will discussions."}, {"time": 1213, "text": "Is this with Sam Harris or something like that?"}, {"time": 1216, "text": "Not that I know of."}, {"time": 1218, "text": "Some people on Clubhouse told me you made a bunch of big debate points about free will."}, {"time": 1225, "text": "Well, let me just then ask you where, in terms of the monkey and the elephant, do you think we land in terms of the illusion of free will?"}, {"time": 1235, "text": "How much control does the monkey have?"}, {"time": 1238, "text": "We have to think about what the free will is in the first place."}, {"time": 1243, "text": "We are not the machine."}, {"time": 1244, "text": "We are not the thing that is making the decisions."}, {"time": 1246, "text": "We are a model of that decision making process."}, {"time": 1249, "text": "And there is a difference between making your own decisions and predicting your own decisions."}, {"time": 1256, "text": "And that difference is the first person perspective."}, {"time": 1259, "text": "And what basically makes decision making and the conditions of free will distinct from just automatically doing the best thing is that we often don't know what the best thing is."}, {"time": 1273, "text": "We make decisions under uncertainty."}, {"time": 1275, "text": "We make informed bets using a betting algorithm that we don't yet understand because we haven't reverse engineered our own minds sufficiently."}, {"time": 1282, "text": "We don't know the expected rewards."}, {"time": 1283, "text": "We don't know the mechanism by which we estimate the rewards and so on."}, {"time": 1287, "text": "But there is an algorithm."}, {"time": 1288, "text": "We observe ourselves performing where we see that we weight facts and factors and the future, and then some kind of possibility, some motive gets raised to an intention."}, {"time": 1301, "text": "And that's informed bet that the system is making."}, {"time": 1304, "text": "And that making of the informed bet, the representation of that is what we call free will."}, {"time": 1309, "text": "And it seems to be paradoxical because we think that the crucial thing is about it that it's somehow indeterministic."}, {"time": 1316, "text": "And yet if it was indeterministic, it would be random."}, {"time": 1320, "text": "And it cannot be random because if it was random, if just dice were being thrown in the universe, randomly forces you to do things, it would be meaningless."}, {"time": 1328, "text": "So the important part of the decisions is always the deterministic stuff."}, {"time": 1332, "text": "But it appears to be indeterministic to you because it's unpredictable."}, {"time": 1336, "text": "Because if it was predictable, you wouldn't experience it as a free will decision."}, {"time": 1341, "text": "You would experience it as just doing the necessary right thing."}, {"time": 1345, "text": "And you see this continuum between the free will and the execution of automatic behavior when you're observing other people."}, {"time": 1353, "text": "So for instance, when you are observing your own children, if you don't understand them, you will abuse this agent model where you have an agent with a set point generator."}, {"time": 1363, "text": "And the agent is doing the best it can to minimize the difference to the set point."}, {"time": 1367, "text": "And it might be confused and sometimes impulsive or whatever, but it's acting on its own free will."}, {"time": 1373, "text": "And when you understand what's happens in the mind of the child, you see that it's automatic."}, {"time": 1378, "text": "And you can outmodel the child, you can build things around the child that will lead the child to making exactly the decision that you are predicting."}, {"time": 1386, "text": "And under these circumstances, like when you are a stage musician or somebody who is dealing with people that you sell a car to, and you completely understand the psychology and the impulses and the space of thoughts that this individual can have at that moment."}, {"time": 1401, "text": "Under these circumstances, it makes no sense to attribute free will."}, {"time": 1406, "text": "Because it's no longer decision making under uncertainty."}, {"time": 1408, "text": "You are already certain."}, {"time": 1409, "text": "For them, there's uncertainty, but you already know what they're doing."}, {"time": 1413, "text": "But what about for you?"}, {"time": 1414, "text": "So is this akin to like systems like cellular automata where it's deterministic, but when you squint your eyes a little bit, it starts to look like there's agents making decisions at the higher sort of when you zoom out and look at the entities that are composed by the individual cells."}, {"time": 1438, "text": "Even though there's underlying simple rules that make the system evolve in deterministic ways, it looks like there's organisms making decisions."}, {"time": 1450, "text": "Is that where the illusion of free will emerges, that jump in scale?"}, {"time": 1456, "text": "It's a particular type of model, but this jump in scale is crucial."}, {"time": 1460, "text": "The jump in scale happens whenever you have too many parts to count and you cannot make a model at that level and you try to find some higher level regularity."}, {"time": 1468, "text": "And the higher level regularity is a pattern that you project into the world to make sense of it."}, {"time": 1474, "text": "And agency is one of these patterns, right?"}, {"time": 1476, "text": "You have all these cells that interact with each other and the cells in our body are set up in such a way that they benefit if their behavior is coherent, which means that they act as if they were serving a common goal."}, {"time": 1489, "text": "And that means that they will evolve regulation mechanisms that act as if they were serving a common goal."}, {"time": 1495, "text": "And now you can make sense of all these cells by projecting the common goal into them."}, {"time": 1499, "text": "Right, so for you then, free will is an illusion."}, {"time": 1503, "text": "No, it's a model and it's a construct."}, {"time": 1506, "text": "It's basically a model that the system is making of its own behavior."}, {"time": 1509, "text": "And it's the best model that it can come up with under the circumstances."}, {"time": 1512, "text": "And it can get replaced by a different model, which is automatic behavior, when you fully understand the mechanism under which you are acting."}, {"time": 1519, "text": "Yeah, but another word for model is what, story."}, {"time": 1523, "text": "So it's the story you're telling."}, {"time": 1525, "text": "I mean, do you actually have control?"}, {"time": 1527, "text": "Is there such a thing as a you and is there such a thing as you have in control?"}, {"time": 1533, "text": "So like, are you manifesting your evolution as an entity?"}, {"time": 1542, "text": "In some sense, the you is the model of the system that is in control."}, {"time": 1545, "text": "It's a story that the system tells itself about somebody who is in control."}, {"time": 1551, "text": "And the contents of that model are being used to inform the behavior of the system."}, {"time": 1557, "text": "So the system is completely mechanical and the system creates that story like a loom."}, {"time": 1563, "text": "And then it uses the contents of that story to inform its actions and writes the results of that actions into the story."}, {"time": 1571, "text": "So how's that not an illusion?"}, {"time": 1573, "text": "The story is written then, or rather we're not the writers of the story."}, {"time": 1581, "text": "Yes, but we always knew that."}, {"time": 1584, "text": "No, we don't know that."}, {"time": 1585, "text": "When did we know that?"}, {"time": 1586, "text": "I think that's mostly a confusion about concepts."}, {"time": 1589, "text": "The conceptual illusion in our culture comes from the idea that we live in physical reality and that we experience physical reality and that you have ideas about it."}, {"time": 1599, "text": "And then you have this dualist interpretation where you have two substances, res extensa, the world that you can touch and that is made of extended things and res cogitans, which is the world of ideas."}, {"time": 1611, "text": "And in fact, both of them are mental representations."}, {"time": 1614, "text": "One is the representations of the world as a game engine that your mind generates to make sense of the perceptual data."}, {"time": 1621, "text": "And the other one, yes, that's what we perceive as the physical world."}, {"time": 1624, "text": "But we already know that the physical world is nothing like that, right?"}, {"time": 1627, "text": "Quantum mechanics is very different from what you and me perceive as the world."}, {"time": 1631, "text": "The world that you and me perceive as a game engine."}, {"time": 1634, "text": "And there are no colors and sounds in the physical world."}, {"time": 1637, "text": "They only exist in the game engine generated by your brain."}, {"time": 1640, "text": "And then you have ideas that cannot be mapped onto extended regions, right?"}, {"time": 1644, "text": "So the objects that have a spatial extension in the game engine, res extensa, and the objects that don't have a physical extension in the game engine are ideas."}, {"time": 1654, "text": "And they both interact in our mind to produce models of the world."}, {"time": 1658, "text": "Yep, but, you know, when you play video games, I understand that what's actually happening is zeros and ones inside of a computer, inside of a CPU and a GPU, but you're still seeing like the rendering of that."}, {"time": 1678, "text": "And you're still making decisions, whether to shoot, to turn left or to turn right, if you're playing a shooter, or every time I started thinking about Skyrim and Elder Scrolls and walking around in beautiful nature and swinging a sword."}, {"time": 1690, "text": "But it feels like you're making decisions inside that video game."}, {"time": 1695, "text": "So even though you don't have direct access in terms of perception to the bits, to the zeros and ones, it still feels like you're making decisions and your decisions actually feels like they're being applied all the way down to the zeros and ones."}, {"time": 1712, "text": "So it feels like you have control, even though you don't have direct access to reality."}, {"time": 1716, "text": "So there is basically a special character in the video game that is being created by the video game engine."}, {"time": 1722, "text": "And this character is serving the aesthetics of the video game, and that is you."}, {"time": 1727, "text": "Yes, but I feel like I have control inside the video game."}, {"time": 1730, "text": "Like all those like 12 year olds that kick my ass on the internet."}, {"time": 1735, "text": "So when you play the video game, it doesn't really matter that there's zeros and ones, right?"}, {"time": 1739, "text": "You don't care about the bits of the past."}, {"time": 1741, "text": "You don't care about the nature of the CPU that it runs on."}, {"time": 1744, "text": "What you care about are the properties of the game that you're playing."}, {"time": 1747, "text": "And you hope that the CPU is good enough."}, {"time": 1750, "text": "And a similar thing happens when we interact with physics."}, {"time": 1753, "text": "The world that you and me are in is not the physical world."}, {"time": 1755, "text": "The world that you and me are in is a dream world."}, {"time": 1759, "text": "How close is it to the real world though?"}, {"time": 1763, "text": "We know that it's not very close, but we know that the dynamics of the dream world match the dynamics of the physical world to a certain degree of resolution."}, {"time": 1771, "text": "But the causal structure of the dream world is different."}, {"time": 1775, "text": "So you see for instance waves crashing on your feet, right?"}, {"time": 1778, "text": "But there are no waves in the ocean."}, {"time": 1779, "text": "There's only water molecules that have tangents between the molecules that are the result of electrons in the molecules interacting with each other."}, {"time": 1790, "text": "Aren't they like very consistent?"}, {"time": 1792, "text": "We're just seeing a very crude approximation."}, {"time": 1795, "text": "Isn't our dream world very consistent, like to the point of being mapped directly one to one to the actual physical world as opposed to us being completely tricked?"}, {"time": 1807, "text": "Is this is like where you have like Donald?"}, {"time": 1810, "text": "It's not an illusion."}, {"time": 1811, "text": "It's a form of data compression."}, {"time": 1813, "text": "It's an attempt to deal with the dynamics of too many parts to count at the level at which we are entangled with the best model that you can find."}, {"time": 1820, "text": "Yeah, so we can act in that dream world and our actions have impact in the real world, in the physical world to which we don't have access."}, {"time": 1828, "text": "Yes, but it's basically like accepting the fact that the software that we live in, the dream that we live in is generated by something outside of this world that you and me are in."}, {"time": 1838, "text": "So is the software deterministic and do we not have any control?"}, {"time": 1842, "text": "Do we have, so free will is having a conscious being."}, {"time": 1849, "text": "Free will is the monkey being able to steer the elephant."}, {"time": 1855, "text": "No, it's slightly different."}, {"time": 1858, "text": "Basically in the same way as you are modeling the water molecules in the ocean that engulf your feet when you are walking on the beach as waves and there are no waves, but only the atoms on more complicated stuff underneath the atoms and so on."}, {"time": 1871, "text": "And you know that, right?"}, {"time": 1874, "text": "You would accept, yes, there is a certain abstraction that happens here."}, {"time": 1877, "text": "It's a simplification of what happens and the simplification that is designed in such a way that your brain can deal with it, temporarily and spatially in terms of resources and tuned for the predictive value."}, {"time": 1888, "text": "So you can predict with some accuracy whether your feet are going to get wet or not."}, {"time": 1893, "text": "But it's a really good interface and approximation."}, {"time": 1897, "text": "It says E equals MC squared is a good, equations are good approximation for, they're much better approximation."}, {"time": 1905, "text": "So to me, waves is a really nice approximation of what's all the complexity that's happening underneath."}, {"time": 1911, "text": "Basically it's a machine learning model that is constantly tuned to minimize surprises."}, {"time": 1915, "text": "So it basically tries to predict as well as it can what you're going to perceive next."}, {"time": 1919, "text": "Are we talking about, which is the machine learning?"}, {"time": 1922, "text": "Our perception system or the dream world?"}, {"time": 1925, "text": "The machine world, dream world is the result of the machine learning process of the perceptual system."}, {"time": 1931, "text": "That's doing the compression."}, {"time": 1933, "text": "And the model of you as an agent is not a different type of model or it's a different type, but not different as in its model like nature from the model of the ocean, right?"}, {"time": 1945, "text": "Some things are oceans, some things are agents."}, {"time": 1948, "text": "And one of these agents is using your own control model, the output of your model, the things that you perceive yourself as doing."}, {"time": 1956, "text": "And that is you."}, {"time": 1958, "text": "What about the fact that when you're standing with the water on your feet and you're looking out into the vast open water of the ocean and then there's a beautiful sunset and the fact that it's beautiful and then maybe you have friends or a loved one with you and you feel love, what is that?"}, {"time": 1980, "text": "As the dream world or what is that?"}, {"time": 1982, "text": "Yes, it's all happening inside of the dream."}, {"time": 1986, "text": "But see, the word dream makes it seem like it's not real."}, {"time": 1991, "text": "No, of course it's not real."}, {"time": 1994, "text": "The physical universe is real, but the physical universe is incomprehensible and it doesn't have any feeling of realness."}, {"time": 2001, "text": "The feeling of realness that you experience gets attached to certain representations where your brain assesses, this is the best model of reality that I have."}, {"time": 2008, "text": "So the only thing that's real to you is the thing that's happening at the very base of reality."}, {"time": 2014, "text": "Yeah, for something to be real, it needs to be implemented."}, {"time": 2020, "text": "So the model that you have of reality is real in as far as it is a model."}, {"time": 2025, "text": "It's an appropriate description of the world to say that there are models that are being experienced, but the world that you experience is not necessarily implemented."}, {"time": 2036, "text": "There is a difference between a reality, a simulation and a simulacrum."}, {"time": 2042, "text": "The reality that we're talking about is something that fully emerges over a causally closed lowest layer."}, {"time": 2048, "text": "And the idea of physicalism is that we are in that layer, that basically our world emerges over that."}, {"time": 2053, "text": "Every alternative to physicalism is a simulation theory, which basically says that we are in some kind of simulation universe and the real world needs to be in a parent universe of that, where the actual causal structure is, right?"}, {"time": 2064, "text": "And when you look at the ocean and your own mind, you are looking at a simulation that explains what you're going to see next."}, {"time": 2071, "text": "So we are living in a simulation."}, {"time": 2072, "text": "Yes, but a simulation generated by our own brains."}, {"time": 2076, "text": "And this simulation is different from the physical reality because the causal structure that is being produced, what you are seeing is different from the causal structure of physics."}, {"time": 2084, "text": "But consistent."}, {"time": 2086, "text": "Hopefully, if not, then you are going to end up in some kind of institution where people will take care of you because your behavior will be inconsistent, right?"}, {"time": 2094, "text": "Your behavior needs to work in such a way that it's interacting with an accurately predictive model of reality."}, {"time": 2100, "text": "And if your brain is unable to make your model of reality predictive, you will need help."}, {"time": 2106, "text": "So what do you think about Donald Hoffman's argument that it doesn't have to be consistent, the dream world to what he calls like the interface to the actual physical reality, where there could be evolution?"}, {"time": 2120, "text": "I think he makes an evolutionary argument, which is like, it could be an evolutionary advantage to have the dream world drift away from physical reality."}, {"time": 2130, "text": "I think that only works if you have tenure."}, {"time": 2132, "text": "As long as you're still interacting with the ground tools, your model needs to be somewhat predictive."}, {"time": 2138, "text": "Well, in some sense, humans have achieved a kind of tenure in the animal kingdom."}, {"time": 2145, "text": "And at some point we became too big to fail, so we became postmodernist."}, {"time": 2151, "text": "It all makes sense now."}, {"time": 2152, "text": "We can just change the version of reality that we like."}, {"time": 2157, "text": "Yeah, but basically you can do magic."}, {"time": 2160, "text": "You can change your assessment of reality, but eventually reality is going to come bite you in the ass if it's not predictive."}, {"time": 2166, "text": "Do you have a sense of what is that base layer of physical reality?"}, {"time": 2172, "text": "You have like, so you have these attempts at the theories of everything, the very, very small of like strength theory, or what Stephen Wolfram talks about with the hyper grass."}, {"time": 2185, "text": "These are these tiny, tiny, tiny, tiny objects."}, {"time": 2188, "text": "And then there is more like quantum mechanics that's talking about objects that are much larger, but still very, very, very tiny."}, {"time": 2196, "text": "Do you have a sense of where the tiniest thing is that is like at the lowest level?"}, {"time": 2202, "text": "The turtle at the very bottom."}, {"time": 2204, "text": "Do you have a sense what that turtle is?"}, {"time": 2205, "text": "I don't think that you can talk about where it is because space is emerging over the activity of these things."}, {"time": 2211, "text": "So space, the coordinates only exist in relation to the things, other things."}, {"time": 2218, "text": "And so you could, in some sense, abstract it into locations that can hold information and trajectories that the information can take between the different locations."}, {"time": 2226, "text": "And this is how we construct our notion of space."}, {"time": 2230, "text": "And physicists usually have a notion of space that is continuous."}, {"time": 2235, "text": "And this is a point where I tend to agree with people like Stephen Wolfram who are very skeptical of the geometric notions."}, {"time": 2243, "text": "I think that geometry is the dynamics of too many parts to count."}, {"time": 2259, "text": "So there are no infinities."}, {"time": 2261, "text": "There are no infinities."}, {"time": 2262, "text": "Infinities fake."}, {"time": 2263, "text": "There is unboundedness, but if you have a language that talks about infinity, at some point, the language is going to contradict itself, which means it's no longer valid."}, {"time": 2271, "text": "In order to deal with infinities and mathematics, you have to postulate the existence initially."}, {"time": 2277, "text": "You cannot construct the infinities."}, {"time": 2279, "text": "And that's an issue, right?"}, {"time": 2280, "text": "You cannot build up an infinity from zero."}, {"time": 2282, "text": "But in practice, you never do this, right?"}, {"time": 2284, "text": "When you perform calculations, you only look at the dynamics of too many parts to count."}, {"time": 2289, "text": "And usually these numbers are not that large."}, {"time": 2293, "text": "They're not Googles or something."}, {"time": 2294, "text": "The infinities that we are dealing with in our universe are mathematically speaking, relatively small integers."}, {"time": 2303, "text": "And still what we're looking at is dynamics where a trillion things behave similar to a hundred trillion things or something that is very, very large because they're converging."}, {"time": 2319, "text": "And these convergent dynamics, these operators, this is what we deal with when we are doing the geometry."}, {"time": 2325, "text": "Geometry is stuff where we can pretend that it's continuous because if we subdivide the space sufficiently fine grained, these things approach a certain dynamic."}, {"time": 2336, "text": "And this approach dynamic, that is what we mean by it."}, {"time": 2339, "text": "But I don't think that infinity would work, so to speak, that you would know the last digit of pi and that you have a physical process that rests on knowing the last digit of pi."}, {"time": 2349, "text": "Yeah, that could be just a peculiar quirk of human cognition that we like discrete."}, {"time": 2355, "text": "Discrete makes sense to us."}, {"time": 2356, "text": "Infinity doesn't, so in terms of our intuitions."}, {"time": 2359, "text": "No, the issue is that everything that we think about needs to be expressed in some kind of mental language, not necessarily natural language, but some kind of mathematical language that your neurons can speak that refers to something in the world."}, {"time": 2374, "text": "And what we have discovered is that we cannot construct a notion of infinity without running into contradictions, which means that such a language is no longer valid."}, {"time": 2383, "text": "And I suspect this is what made Pythagoras so unhappy when somebody came up with the notion of irrational numbers before it was time, right?"}, {"time": 2390, "text": "There's this myth that he had this person killed when he blabbed out the secret that not everything can be expressed as a ratio between two numbers, but there are numbers between the ratios."}, {"time": 2399, "text": "The world was not ready for this."}, {"time": 2401, "text": "And I think he was right."}, {"time": 2402, "text": "That has confused mathematicians very seriously because these numbers are not values, they are functions."}, {"time": 2409, "text": "And so you can calculate these functions to a certain degree of approximation, but you cannot pretend that pi has actually a value."}, {"time": 2417, "text": "Pi is a function that would approach this value to some degree, but nothing in the world rests on knowing pi."}, {"time": 2426, "text": "How important is this distinction between discrete and continuous for you to get to the book?"}, {"time": 2432, "text": "Because there's a, I mean, in discussion of your favorite flavor of the theory of everything, there's a few on the table."}, {"time": 2441, "text": "So there's string theory, there's a particular, there's a little quantum gravity, which focused on one particular unification."}, {"time": 2453, "text": "There's just a bunch of favorite flavors of different people trying to propose a theory of everything."}, {"time": 2461, "text": "Eric Weinstein and a bunch of people throughout history."}, {"time": 2464, "text": "And then of course, Stephen Wolfram, who I think is one of the only people doing a discrete."}, {"time": 2470, "text": "No, no, there's a bunch of physicists who do this right now."}, {"time": 2473, "text": "And like Toffoli and Tomasello."}, {"time": 2477, "text": "And digital physics is something that is, I think, growing in popularity."}, {"time": 2484, "text": "But the main reason why this is interesting is because it's important sometimes to settle disagreements."}, {"time": 2494, "text": "I don't think that you need infinities at all, and you never needed them."}, {"time": 2498, "text": "You can always deal with very large numbers and you can deal with limits, right?"}, {"time": 2502, "text": "We are fine with doing that."}, {"time": 2503, "text": "You don't need any kind of infinity."}, {"time": 2505, "text": "You can build your computer algebra systems just as well without believing in infinity in the first place."}, {"time": 2510, "text": "So you're okay with limits?"}, {"time": 2511, "text": "Yeah, so basically a limit means that something is behaving pretty much the same if you make the number large."}, {"time": 2519, "text": "Right, because it's converging to a certain value."}, {"time": 2522, "text": "And at some point the difference becomes negligible and you can no longer measure it."}, {"time": 2526, "text": "And in this sense, you have things that if you have an ngon which has enough corners, then it's going to behave like a circle at some point, right?"}, {"time": 2535, "text": "And it's only going to be in some kind of esoteric thing that cannot exist in the physical universe that you would be talking about this perfect circle."}, {"time": 2543, "text": "And now it turns out that it also wouldn't work in mathematics because you cannot construct mathematics that has infinite resolution without running into contradictions."}, {"time": 2552, "text": "So that is itself not that important because we never did that, right?"}, {"time": 2556, "text": "It's just a thing that some people thought we could."}, {"time": 2559, "text": "And this leads to confusion."}, {"time": 2560, "text": "So for instance, Roger Penrose uses this as an argument to say that there are certain things that mathematicians can do dealing with infinities and by extension our mind can do that computers cannot do."}, {"time": 2575, "text": "Yeah, he talks about that the human mind can do certain mathematical things that the computer as defined by the universal Turing machine cannot."}, {"time": 2587, "text": "So that it has to do with infinity."}, {"time": 2588, "text": "Yes, it's one of the things."}, {"time": 2590, "text": "So he is basically pointing at the fact that there are things that are possible in the mathematical mind and in pure mathematics that are not possible in machines that can be constructed in the physical universe."}, {"time": 2607, "text": "And because he's an honest guy, he thinks this means that present physics cannot explain operations that happen in our mind."}, {"time": 2614, "text": "Do you think he's right?"}, {"time": 2615, "text": "And so let's leave his discussion of consciousness aside for the moment."}, {"time": 2620, "text": "Do you think he's right about just what he's basically referring to as intelligence?"}, {"time": 2626, "text": "So is the human mind fundamentally more capable as a thinking machine than a universal Turing machine?"}, {"time": 2635, "text": "But so he's suggesting that, right?"}, {"time": 2638, "text": "So our mind is actually less than a Turing machine."}, {"time": 2641, "text": "There can be no Turing machine because it's defined as having an infinite tape."}, {"time": 2645, "text": "And we always only have a finite tape."}, {"time": 2647, "text": "But he's saying it's better."}, {"time": 2648, "text": "Our minds can only perform finitely many operations."}, {"time": 2650, "text": "Yes, he thinks so."}, {"time": 2650, "text": "He's saying it can do the kind of computation that the Turing machine cannot."}, {"time": 2654, "text": "And that's because he thinks that our minds can do operations that have infinite resolution in some sense."}, {"time": 2661, "text": "And I don't think that's the case."}, {"time": 2663, "text": "Our minds are just able to discover these limit operators over too many parts to count."}, {"time": 2670, "text": "What about his idea that consciousness is more than a computation?"}, {"time": 2677, "text": "So it's more than something that a Turing machine can do."}, {"time": 2682, "text": "So again, saying that there's something special about our mind that cannot be replicated in a machine."}, {"time": 2689, "text": "The issue is that I don't even know how to construct a language to express this statement correctly."}, {"time": 2696, "text": "Well, the basic statement is there's a human experience that includes intelligence, that includes self awareness, that includes the hard problem of consciousness."}, {"time": 2712, "text": "And the question is, can that be fully simulated in the computer, in the mathematical model of the computer as we understand it today?"}, {"time": 2723, "text": "Roger Penrose says no."}, {"time": 2725, "text": "So the universe of Turing machine cannot simulate the universe."}, {"time": 2732, "text": "So the interesting question is, and you have to ask him this is, why not?"}, {"time": 2736, "text": "What is this specific thing that cannot be modeled?"}, {"time": 2739, "text": "And when I looked at his writings and I haven't read all of it, but when I read, for instance, the section that he writes in the introduction to a road to infinity, the thing that he specifically refers to is the way in which human minds deal with infinities."}, {"time": 2757, "text": "And that itself can, I think, easily be deconstructed."}, {"time": 2763, "text": "A lot of people feel that our experience cannot be explained in a mechanical way."}, {"time": 2768, "text": "And therefore it needs to be different."}, {"time": 2771, "text": "And I concur, our experience is not mechanical."}, {"time": 2774, "text": "Our experience is simulated."}, {"time": 2776, "text": "It exists only in a simulation."}, {"time": 2778, "text": "The only simulation can be conscious."}, {"time": 2779, "text": "Physical systems cannot be conscious because they're only mechanical."}, {"time": 2783, "text": "Cells cannot be conscious."}, {"time": 2785, "text": "Neurons cannot be conscious."}, {"time": 2786, "text": "Brains cannot be conscious."}, {"time": 2787, "text": "People cannot be conscious as far as if you understand them as physical systems."}, {"time": 2791, "text": "What can be conscious is the story of the system in the world where you write all these things into the story."}, {"time": 2799, "text": "You have experiences for the same reason that a character novel has experiences because it's written into the story."}, {"time": 2805, "text": "And now the system is acting on that story."}, {"time": 2808, "text": "And it's not a story that is written in a natural language."}, {"time": 2810, "text": "It's written in a perceptual language, in this multimedia language of the game engine."}, {"time": 2815, "text": "And in there, you write in what kind of experience you have and what this means for the behavior of the system, for your behavior tendencies, for your focus, for your attention, for your experience of valence and so on."}, {"time": 2826, "text": "And this is being used to inform the behavior of the system in the next step."}, {"time": 2830, "text": "And then the story updates with the reactions of the system and the changes in the world and so on."}, {"time": 2837, "text": "And you live inside of that model."}, {"time": 2839, "text": "You don't live inside of the physical reality."}, {"time": 2843, "text": "And I mean, just to linger on it, like you say, okay, it's in the perceptual language, the multimodal perceptual language."}, {"time": 2853, "text": "That's the experience."}, {"time": 2854, "text": "That's what consciousness is within that model, within that story."}, {"time": 2860, "text": "But do you have agency?"}, {"time": 2863, "text": "When you play a video game, you can turn left and you can turn right in that story."}, {"time": 2869, "text": "So in that dream world, how much control do you have?"}, {"time": 2874, "text": "Is there such a thing as you in that story?"}, {"time": 2877, "text": "Like, is it right to say the main character, you know, everybody's NPCs, and then there's the main character and you're controlling the main character?"}, {"time": 2887, "text": "Or is that an illusion?"}, {"time": 2888, "text": "Is there a main character that you're controlling?"}, {"time": 2890, "text": "I'm getting to the point of like the free will point."}, {"time": 2894, "text": "Imagine that you are building a robot that plays soccer."}, {"time": 2897, "text": "And you've been to MIT computer science, you basically know how to do that, right?"}, {"time": 2902, "text": "And so you would say the robot is an agent that solves a control problem, how to get the ball into the goal."}, {"time": 2909, "text": "And it needs to perceive the world and the world is disturbing him in trying to do this, right?"}, {"time": 2913, "text": "So he has to control many variables to make that happen and to project itself and the ball into the future and understand its position on the field relative to the ball and so on, and the position of its limbs or in the space around it and so on."}, {"time": 2926, "text": "So it needs to have an adequate model that abstracting reality in a useful way."}, {"time": 2931, "text": "And you could say that this robot does have agency over what it's doing in some sense."}, {"time": 2938, "text": "And the model is going to be a control model."}, {"time": 2941, "text": "And inside of that control model, you can possibly get to a point where this thing is sufficiently abstract to discover its own agency."}, {"time": 2949, "text": "Our current robots don't do that."}, {"time": 2950, "text": "They don't have a unified model of the universe, but there's not a reason why we shouldn't be getting there at some point in the not too distant future."}, {"time": 2958, "text": "And once that happens, you will notice that the robot tells a story about a robot playing soccer."}, {"time": 2965, "text": "So the robot will experience itself playing soccer in a simulation of the world that it uses to construct a model of the locations of its legs and limbs in space on the field with relationship to the ball."}, {"time": 2979, "text": "And it's not going to be at the level of the molecules."}, {"time": 2982, "text": "It will be an abstraction that is exactly at the level that is most suitable for past planning of the movements of the robot."}, {"time": 2989, "text": "It's going to be a high level abstraction, but a very useful one that is as predictive as we can make it."}, {"time": 2995, "text": "And in that side of that story, there is a model of the agency of that system."}, {"time": 2998, "text": "So this model can accurately predict that the contents of the model are going to be driving the behavior of the robot in the immediate future."}, {"time": 3008, "text": "But there's the hard problem of consciousness, which I would also, there's a subjective experience of free will as well that I'm not sure where the robot gets that, where that little leap is."}, {"time": 3022, "text": "Because for me right now, everything I imagine with that robot, as it gets more and more and more sophisticated, the agency comes from the programmer of the robot still, of what was programmed in."}, {"time": 3035, "text": "You could probably do an end to end learning system."}, {"time": 3038, "text": "You maybe need to give it a few priors."}, {"time": 3040, "text": "So you nudge the architecture in the right direction that it converges more quickly, but ultimately discovering the suitable hyperparameters of the architecture is also only a search process."}, {"time": 3050, "text": "And as the search process was evolution, that has informed our brain architecture so we can converge in a single lifetime on useful interaction with the world and the formation of a self model."}, {"time": 3060, "text": "The problem is if we define hyperparameters broadly, so it's not just the parameters that control this end to end learning system, but the entirety of the design of the robot."}, {"time": 3071, "text": "Like there's, you have to remove the human completely from the picture."}, {"time": 3075, "text": "And then in order to build the robot, you have to create an entire universe."}, {"time": 3080, "text": "Cause you have to go, you can't just shortcut evolution."}, {"time": 3082, "text": "You have to go from the very beginning in order for it to have, cause I feel like there's always a human pulling the strings and that makes it seem like the robot is cheating."}, {"time": 3093, "text": "It's getting a shortcut to consciousness."}, {"time": 3095, "text": "And you are looking at the current Boston Dynamics robots."}, {"time": 3098, "text": "It doesn't look as if there is somebody pulling the strings."}, {"time": 3100, "text": "It doesn't look like cheating anymore."}, {"time": 3102, "text": "Okay, so let's go there."}, {"time": 3103, "text": "Cause I got to talk to you about this."}, {"time": 3104, "text": "So obviously with the case of Boston Dynamics, as you may or may not know, it's always either hard coded or remote controlled."}, {"time": 3114, "text": "There's no intelligence."}, {"time": 3115, "text": "I don't know how the current generation of Boston Dynamics robots works, but what I've been told about the previous ones was that it's basically all cybernetic control, which means you still have feedback mechanisms and so on, but it's not deep learning for the most part as it's currently done."}, {"time": 3133, "text": "It's for the most part, just identifying a control hierarchy that is congruent to the limbs that exist and the parameters that need to be optimized for the movement of these limbs."}, {"time": 3142, "text": "And then there is a convergence progress."}, {"time": 3144, "text": "So it's basically just regression that you would need to control this."}, {"time": 3147, "text": "But again, I don't know whether that's true."}, {"time": 3149, "text": "That's just what I've been told about how they work."}, {"time": 3151, "text": "We have to separate several levels of discussion here."}, {"time": 3155, "text": "So the only thing they do is pretty sophisticated control with no machine learning in order to maintain balance or to right itself."}, {"time": 3165, "text": "It's a control problem in terms of using the actuators to when it's pushed or when it steps on a thing that's uneven, how to always maintain balance."}, {"time": 3175, "text": "And there's a tricky set of heuristics around that, but that's the only goal."}, {"time": 3180, "text": "Everything you see Boston Dynamics doing in terms of that to us humans is compelling, which is any kind of higher order movement, like turning, wiggling its butt, like jumping back on its two feet, dancing."}, {"time": 3198, "text": "Dancing is even worse because dancing is hard coded in."}, {"time": 3202, "text": "It's choreographed by humans."}, {"time": 3205, "text": "There's choreography software."}, {"time": 3207, "text": "So there is no, of all that high level movement, there's no anything that you can call, certainly can't call AI, but there's no even like basic heuristics."}, {"time": 3219, "text": "It's all hard coded in."}, {"time": 3221, "text": "And yet we humans immediately project agency onto them, which is fascinating."}, {"time": 3228, "text": "So the gap here doesn't necessarily have agency."}, {"time": 3233, "text": "What it has is cybernetic control."}, {"time": 3235, "text": "And the cybernetic control means you have a hierarchy of feedback loops that keep the behavior in certain boundaries so the robot doesn't fall over and it's able to perform the movements."}, {"time": 3244, "text": "And the choreography cannot really happen with motion capture because the robot would fall over because the physics of the robot, the weight distribution and so on is different from the weight distribution in the human body."}, {"time": 3255, "text": "So if you were using the directly motion captured movements of a human body to project it into this robot, it wouldn't work."}, {"time": 3262, "text": "You can do this with a computer animation."}, {"time": 3264, "text": "It will look a little bit off, but who cares?"}, {"time": 3266, "text": "But if you want to correct for the physics, you need to basically tell the robot where it should move its limbs."}, {"time": 3273, "text": "And then the control algorithm is going to approximate a solution that makes it possible within the physics of the robot."}, {"time": 3281, "text": "And you have to find the basic solution for making that happen."}, {"time": 3284, "text": "And there's probably going to be some regression necessary to get the control architecture to make these movements."}, {"time": 3291, "text": "But those two layers are separate."}, {"time": 3292, "text": "So the thing, the higher level instruction of how you should move and where you should move is a higher level."}, {"time": 3299, "text": "Yeah, so I expect that the control level of these robots at some level is dumb."}, {"time": 3303, "text": "This is just the physical control movement, the motor architecture."}, {"time": 3307, "text": "But it's a relatively smart motor architecture."}, {"time": 3310, "text": "It's just that there is no high level deliberation about what decisions to make necessarily, right?"}, {"time": 3314, "text": "But see, it doesn't feel like free will or consciousness."}, {"time": 3317, "text": "No, no, that was not where I was trying to get to."}, {"time": 3320, "text": "I think that in our own body, we have that too."}, {"time": 3324, "text": "So we have a certain thing that is basically just a cybernetic control architecture that is moving our limbs."}, {"time": 3331, "text": "And deep learning can help in discovering such an architecture if you don't have it in the first place."}, {"time": 3337, "text": "If you already know your hardware, you can maybe handcraft it."}, {"time": 3340, "text": "But if you don't know your hardware, you can search for such an architecture."}, {"time": 3343, "text": "And this work already existed in the 80s and 90s."}, {"time": 3346, "text": "People were starting to search for control architectures by motor babbling and so on, and just use reinforcement learning architectures to discover such a thing."}, {"time": 3355, "text": "And now imagine that you have the cybernetic control architecture already inside of you."}, {"time": 3361, "text": "And you extend this a little bit."}, {"time": 3363, "text": "So you are seeking out food, for instance, or rest or and so on."}, {"time": 3368, "text": "And you get to have a baby at some point."}, {"time": 3371, "text": "And now you add more and more control layers to this."}, {"time": 3375, "text": "And the system is reverse engineering its own control architecture and builds a high level model to synchronize the pursuit of very different conflicting goals."}, {"time": 3386, "text": "And this is how I think you get to purposes."}, {"time": 3388, "text": "Purposes are models of your goals."}, {"time": 3390, "text": "The goals may be intrinsic as the result of the different set point violations that you have, hunger and thirst for very different things, and rest and pain avoidance and so on."}, {"time": 3399, "text": "And you put all these things together and eventually you need to come up with a strategy to synchronize them all."}, {"time": 3406, "text": "And you don't need just to do this alone by yourself because we are state building organisms."}, {"time": 3411, "text": "We cannot function as isolation the way that homo sapiens is set up."}, {"time": 3415, "text": "So our own behavior only makes sense when you zoom out very far into a society or even into ecosystemic intelligence on the planet and our place in it."}, {"time": 3426, "text": "So the individual behavior only makes sense in these larger contexts."}, {"time": 3429, "text": "And we have a number of priors built into us."}, {"time": 3431, "text": "So we are behaving as if we were acting on these high level goals pretty much right from the start."}, {"time": 3437, "text": "And eventually in the course of our life, we can reverse engineer the goals that we're acting on, what actually are our higher level purposes."}, {"time": 3445, "text": "And the more we understand that, the more our behavior makes sense."}, {"time": 3448, "text": "But this is all at this point, complex stories within stories that are driving our behavior."}, {"time": 3454, "text": "Yeah, I just don't know how big of a leap it is to start create a system that's able to tell stories within stories."}, {"time": 3464, "text": "Like how big of a leap that is from where currently Boston Dynamics is or any robot that's operating in the physical space."}, {"time": 3473, "text": "And that leap might be big if it requires to solve the hard problem of consciousness, which is telling a hell of a good story."}, {"time": 3481, "text": "I suspect that consciousness itself is relatively simple."}, {"time": 3485, "text": "What's hard is perception and the interface between perception and reasoning."}, {"time": 3491, "text": "That's for instance, the idea of the consciousness prior that would be built into such a system by Yoshua Bengio."}, {"time": 3498, "text": "And what he describes, and I think that's accurate, is that our own model of the world can be described through something like an energy function."}, {"time": 3509, "text": "The energy function is modeling the contradictions that exist within the model at any given point."}, {"time": 3514, "text": "And you try to minimize these contradictions, the tangents in the model."}, {"time": 3518, "text": "And to do this, you need to sometimes test things."}, {"time": 3521, "text": "You need to conditionally disambiguate figure and ground."}, {"time": 3523, "text": "You need to distinguish whether this is true or that is true, and so on."}, {"time": 3527, "text": "Eventually you get to an interpretation, but you will need to manually depress a few points in your model to let it snap into a state that makes sense."}, {"time": 3535, "text": "And this function that tries to get the biggest dip in the energy function in your model, according to Yoshua Bengio, is related to consciousness."}, {"time": 3542, "text": "It's a low dimensional discrete function that tries to maximize this dip in the energy function."}, {"time": 3549, "text": "Yeah, I think I would need to dig into details because I think the way he uses the word consciousness is more akin to like self awareness, like modeling yourself within the world, as opposed to the subjective experience, the hard problem."}, {"time": 3563, "text": "No, it's not even the self is in the world."}, {"time": 3566, "text": "The self is the agent and you don't need to be aware of yourself in order to be conscious."}, {"time": 3571, "text": "The self is just a particular content that you can have, but you don't have to have."}, {"time": 3575, "text": "But you can be conscious in, for instance, a dream at night or during a meditation state where you don't have a self."}, {"time": 3583, "text": "Where you're just aware of the fact that you are aware."}, {"time": 3585, "text": "And what we mean by consciousness in the colloquial sense is largely this reflexive self awareness, that we become aware of the fact that you're paying attention, that we are the thing that pays attention."}, {"time": 3599, "text": "We are the thing that pays attention, right."}, {"time": 3602, "text": "I don't see where the awareness that we're aware, the hard problem doesn't feel like it's solved."}, {"time": 3610, "text": "I mean, it's called a hard problem for a reason, because it seems like there needs to be a major leap."}, {"time": 3619, "text": "Yeah, I think the major leap is to understand how it is possible that a machine can dream, that a physical system is able to create a representation that the physical system is acting on, and that is spun force and so on."}, {"time": 3633, "text": "But once you accept the fact that you are not in physics, but that you exist inside of the story, I think the mystery disappears."}, {"time": 3640, "text": "Everything is possible in the story."}, {"time": 3641, "text": "You exist inside the story."}, {"time": 3643, "text": "Okay, so the machine."}, {"time": 3644, "text": "Your consciousness is being written into the story."}, {"time": 3645, "text": "The fact that you experience things is written to the side of the story."}, {"time": 3648, "text": "You ask yourself, is this real what I'm seeing?"}, {"time": 3651, "text": "And your brain writes into the story, yes, it's real."}, {"time": 3653, "text": "So what about the perception of consciousness?"}, {"time": 3656, "text": "So to me, you look conscious."}, {"time": 3659, "text": "So the illusion of consciousness, the demonstration of consciousness."}, {"time": 3664, "text": "I ask for the legged robot."}, {"time": 3667, "text": "How do we make this legged robot conscious?"}, {"time": 3670, "text": "So there's two things, and maybe you can tell me if they're neighboring ideas."}, {"time": 3676, "text": "One is actually make it conscious, and the other is make it appear conscious to others."}, {"time": 3682, "text": "Are those related?"}, {"time": 3685, "text": "Let's ask it from the other direction."}, {"time": 3687, "text": "What would it take to make you not conscious?"}, {"time": 3691, "text": "So when you are thinking about how you perceive the world, can you decide to switch from looking at qualia to looking at representational states?"}, {"time": 3703, "text": "And it turns out you can."}, {"time": 3704, "text": "There is a particular way in which you can look at the world and recognize its machine nature, including your own."}, {"time": 3711, "text": "And in that state, you don't have that conscious experience in this way anymore."}, {"time": 3715, "text": "It becomes apparent as a representation."}, {"time": 3719, "text": "Everything becomes opaque."}, {"time": 3721, "text": "And I think this thing that you recognize, everything is a representation."}, {"time": 3725, "text": "This is typically what we mean with enlightenment states."}, {"time": 3729, "text": "And it can happen on the motivational level, but you can also do this on the experiential level, on the perceptual level."}, {"time": 3736, "text": "See, but then I can come back to a conscious state."}, {"time": 3740, "text": "Okay, I particularly, I'm referring to the social aspect that the demonstration of consciousness is a really nice thing at a party when you're trying to meet a new person."}, {"time": 3754, "text": "It's a nice thing to know that they're conscious and they can, I don't know how fundamental consciousness is in human interaction, but it seems like to be at least an important part."}, {"time": 3768, "text": "And I ask that in the same kind of way for robots."}, {"time": 3773, "text": "In order to create a rich, compelling human robot interaction, it feels like there needs to be elements of consciousness within that interaction."}, {"time": 3782, "text": "My cat is obviously conscious."}, {"time": 3784, "text": "And so my cat can do this party trick."}, {"time": 3787, "text": "She also knows that I am conscious, be able to have feedback about the fact that we are both acting on models of our own awareness."}, {"time": 3794, "text": "The question is how hard is it for the robot, artificially created robot to achieve cat level and party tricks?"}, {"time": 3804, "text": "Yes, so the issue for me is currently not so much on how to build a system that creates a story about a robot that lives in the world, but to make an adequate representation of the world."}, {"time": 3816, "text": "And the model that you and me have is a unified one."}, {"time": 3820, "text": "It's one where you basically make sense of everything that you can perceive."}, {"time": 3824, "text": "Every feature in the world that enters your perception can be relationally mapped to a unified model of everything."}, {"time": 3831, "text": "And we don't have an AI that is able to construct such a unified model yet."}, {"time": 3836, "text": "So you need that unified model to do the party trick?"}, {"time": 3838, "text": "Yes, I think that it doesn't make sense if this thing is conscious, but not in the same universe as you, because you could not relate to each other."}, {"time": 3846, "text": "So what's the process, would you say, of engineering consciousness in the machine?"}, {"time": 3852, "text": "Like what are the ideas here?"}, {"time": 3854, "text": "So you probably want to have some kind of perceptual system."}, {"time": 3859, "text": "This perceptual system is a processing agent that is able to track sensory data and predict the next frame in the sensory data from the previous frames of the sensory data and the current state of the system."}, {"time": 3871, "text": "So the current state of the system is, in perception, instrumental to predicting what happens next."}, {"time": 3877, "text": "And this means you build lots and lots of functions that take all the blips that you feel on your skin and that you see on your retina, or that you hear, and puts them into a set of relationships that allows you to predict what kind of sensory data, what kind of sensor of blips, vector of blips, you're going to perceive in the next frame."}, {"time": 3896, "text": "This is tuned and it's constantly tuned until it gets as accurate as it can."}, {"time": 3901, "text": "You build a very accurate prediction mechanism that is step one of the perception."}, {"time": 3908, "text": "So first you predict, then you perceive and see the error in your prediction."}, {"time": 3911, "text": "And you have to do two things to make that happen."}, {"time": 3913, "text": "One is you have to build a network of relationships that are constraints, that take all the variants in the world and put each of the variances into a variable that is connected with relationships to other variables."}, {"time": 3927, "text": "And these relationships are computable functions that constrain each other."}, {"time": 3931, "text": "So when you see a nose that points in a certain direction in space, you have a constraint that says there should be a face nearby that has the same direction."}, {"time": 3939, "text": "And if that is not the case, you have some kind of contradiction that you need to resolve because it's probably not a nose what you're looking at."}, {"time": 3944, "text": "It just looks like one."}, {"time": 3945, "text": "So you have to reinterpret the data until you get to a point where your model converges."}, {"time": 3952, "text": "And this process of making the sensory data fit into your model structure is what Piaget calls the assimilation."}, {"time": 3961, "text": "And accommodation is the change of the models where you change your model in such a way that you can assimilate everything."}, {"time": 3968, "text": "So you're talking about building a hell of an awesome perception system that's able to do prediction and perception and correct and keep improving."}, {"time": 3975, "text": "No, wait, that's..."}, {"time": 3977, "text": "Wait, there's more."}, {"time": 3978, "text": "Yes, there's more."}, {"time": 3979, "text": "So the first thing that we wanted to do is we want to minimize the contradictions in the model."}, {"time": 3984, "text": "And of course, it's very easy to make a model in which you minimize the contradictions just by allowing that it can be in many, many possible states, right?"}, {"time": 3991, "text": "So if you increase degrees of freedom, you will have fewer contradictions."}, {"time": 3995, "text": "But you also want to reduce the degrees of freedom because degrees of freedom mean uncertainty."}, {"time": 4000, "text": "You want your model to reduce uncertainty as much as possible, but reducing uncertainty is expensive."}, {"time": 4006, "text": "So you have to have a trade off between minimizing contradictions and reducing uncertainty."}, {"time": 4012, "text": "And you have only a finite amount of compute and experimental time and effort available to reduce uncertainty in the world."}, {"time": 4019, "text": "So you need to assign value to what you observe."}, {"time": 4022, "text": "So you need some kind of motivational system that is estimating what you should be looking at and what you should be thinking about it, how you should be applying your resources to model what that is, right?"}, {"time": 4032, "text": "So you need to have something like convergence links that tell you how to get from the present state of the model to the next one."}, {"time": 4039, "text": "You need to have these compatibility links that tell you which constraints exist and which constraint violations exist."}, {"time": 4045, "text": "And you need to have some kind of motivational system that tells you what to pay attention to."}, {"time": 4050, "text": "So now we have a second agent next to the perceptual agent."}, {"time": 4052, "text": "We have a motivational agent."}, {"time": 4054, "text": "This is a cybernetic system that is modeling what the system needs, what's important for the system, and that interacts with the perceptual system to maximize the expected reward."}, {"time": 4064, "text": "And you're saying the motivational system is some kind of like, what is it?"}, {"time": 4069, "text": "A high level narrative over some lower level."}, {"time": 4072, "text": "No, it's just your brainstem stuff, the limbic system stuff that tells you, okay, now you should get something to eat because I've just measured your blood sugar."}, {"time": 4079, "text": "So you mean like motivational system, like the lower level stuff, like hungry."}, {"time": 4083, "text": "Yes, there's basically physiological needs and some cognitive needs and some social needs and they all interact."}, {"time": 4088, "text": "And they're all implemented at different parts in your nervous system as the motivational system."}, {"time": 4092, "text": "But they're basically cybernetic feedback loops."}, {"time": 4094, "text": "It's not that complicated."}, {"time": 4096, "text": "It's just a lot of code."}, {"time": 4098, "text": "And so you now have a motivational agent that makes your robot go for the ball or that makes your worm go to eat food and so on."}, {"time": 4107, "text": "And you have the perceptual system that lets it predict the environment so it's able to solve that control problem to some degree."}, {"time": 4113, "text": "And now what we learned is that it's very hard to build a machine learning system that looks at all the data simultaneously to see what kind of relationships could exist between them."}, {"time": 4123, "text": "So you need to selectively model the world."}, {"time": 4125, "text": "You need to figure out where can I make the biggest difference if I would put the following things together."}, {"time": 4130, "text": "Sometimes you find a gradient for that."}, {"time": 4133, "text": "When you have a gradient, you don't need to remember where you came from."}, {"time": 4136, "text": "You just follow the gradient until it doesn't get any better."}, {"time": 4139, "text": "But if you have a world where the problems are discontinuous and the search spaces are discontinuous, you need to retain memory of what you explored."}, {"time": 4147, "text": "You need to construct a plan of what to explore next."}, {"time": 4150, "text": "And this thing means that you have next to this perceptual construction system and the motivational cybernetics, an agent that is paying attention to what it should select at any given moment to maximize reward."}, {"time": 4164, "text": "And this scanning system, this attention agent, is required for consciousness and consciousness is its control model."}, {"time": 4172, "text": "So it's the index memories that this thing retains when it manipulates the perceptual representations to maximize the value and minimize the conflicts and to increase coherence."}, {"time": 4184, "text": "So the purpose of consciousness is to create coherence in your perceptual representations, remove conflicts, predict the future, construct counterfactual representations so you can coordinate your actions and so on."}, {"time": 4197, "text": "And in order to do this, it needs to form memories."}, {"time": 4200, "text": "These memories are partial binding states of the working memory contents that are being revisited later on to backtrack, to undo certain states, to look for alternatives."}, {"time": 4210, "text": "And these index memories that you can recall, that is what you perceive as your stream of consciousness."}, {"time": 4215, "text": "And being able to recall these memories, this is what makes you conscious."}, {"time": 4219, "text": "If you could not remember what you paid attention to, you wouldn't be conscious."}, {"time": 4226, "text": "So consciousness is the index in the memory database."}, {"time": 4231, "text": "But let me sneak up to the questions of consciousness a little further."}, {"time": 4237, "text": "So we usually relate suffering to consciousness."}, {"time": 4242, "text": "So the capacity to suffer."}, {"time": 4246, "text": "I think to me, that's a really strong sign of consciousness is a thing that can suffer."}, {"time": 4252, "text": "How is that useful?"}, {"time": 4255, "text": "Suffering."}, {"time": 4257, "text": "And like in your model where you just described, which is indexing of memories and what is the coherence with the perception, with this predictive thing that's going on in the perception, how does suffering relate to any of that?"}, {"time": 4273, "text": "The higher level suffering that humans do."}, {"time": 4276, "text": "Basically pain is a reinforcement signal."}, {"time": 4280, "text": "Pain is a signal that one part of your brain sends to another part of your brain, or in an abstract sense, part of your mind sends to another part of the mind to regulate its behavior, to tell it the behavior that you're currently exhibiting should be improved."}, {"time": 4294, "text": "And this is the signal that I tell you to move away from what you're currently doing and push into a different direction."}, {"time": 4302, "text": "So pain gives you a part of you an impulse to do something differently."}, {"time": 4307, "text": "But sometimes this doesn't work because the training part of your brain is talking to the wrong region, or because it has the wrong model of the relationships in the world."}, {"time": 4317, "text": "Maybe you're mismodeling yourself or you're mismodeling the relationship of yourself to the world, or you're mismodeling the dynamics of the world."}, {"time": 4323, "text": "So you're trying to improve something that cannot be improved by generating more pain."}, {"time": 4327, "text": "But the system doesn't have any alternative."}, {"time": 4330, "text": "So it doesn't get better."}, {"time": 4332, "text": "What do you do if something doesn't get better and you want it to get better?"}, {"time": 4335, "text": "You increase the strengths of the signal."}, {"time": 4337, "text": "And then the signal becomes chronic when it becomes permanent without a change inside."}, {"time": 4342, "text": "This is what we call suffering."}, {"time": 4344, "text": "And the purpose of consciousness is to deal with contradictions, with things that cannot be resolved."}, {"time": 4350, "text": "The purpose of consciousness, I think is similar to a conductor in an orchestra."}, {"time": 4355, "text": "When everything works well, the orchestra doesn't need much of a conductor as long as it's coherent."}, {"time": 4360, "text": "But when there is a lack of coherence or something is consistently producing disharmony and mismatches, then the conductor becomes alert and interacts with it."}, {"time": 4368, "text": "So suffering attracts the activity of our consciousness."}, {"time": 4372, "text": "And the purpose of that is ideally that we bring new layers online, new layers of modeling that are able to create a model of the dysregulation so we can deal with it."}, {"time": 4384, "text": "And this means that we typically get higher level consciousness, so to speak, right?"}, {"time": 4388, "text": "We get some consciousness above our pay grade maybe if we have some suffering early in our life."}, {"time": 4393, "text": "Most of the interesting people had trauma early on in their childhood."}, {"time": 4397, "text": "And trauma means that you are suffering an injury for which the system is not prepared, which it cannot deal with, which it cannot insulate itself from."}, {"time": 4406, "text": "So something breaks."}, {"time": 4407, "text": "And this means that the behavior of the system is permanently disturbed in a way that some mismatch exists now in the regulation that just by following your impulses, by following the pain in the direction where it hurts, the situation doesn't improve but get worse."}, {"time": 4424, "text": "And so what needs to happen is that you grow up."}, {"time": 4427, "text": "And that's part that has grown up is able to deal with the part that is stuck in this earlier phase."}, {"time": 4433, "text": "Yeah, so at least to grow, so you're adding extra layers to your cognition."}, {"time": 4438, "text": "And let me ask you then, because I gotta stick on suffering, the ethics of the whole thing."}, {"time": 4445, "text": "So not our consciousness, but the consciousness of others."}, {"time": 4448, "text": "You've tweeted, one of my biggest fears is that insects could be conscious."}, {"time": 4456, "text": "The amount of suffering on earth would be unthinkable."}, {"time": 4460, "text": "So when we think of other conscious beings, is suffering a property of consciousness that we're most concerned about?"}, {"time": 4472, "text": "So I'm still thinking about robots, how to make sense of other nonhuman things that appear to have the depth of experience that humans have."}, {"time": 4490, "text": "And to me, that means consciousness and the darkest side of that, which is suffering, the capacity to suffer."}, {"time": 4500, "text": "And so I started thinking, how much responsibility do we have for those other conscious beings?"}, {"time": 4506, "text": "That's where the definition of consciousness becomes most urgent."}, {"time": 4513, "text": "Like having to come up with a definition of consciousness becomes most urgent, is who should we and should we not be torturing?"}, {"time": 4524, "text": "There's no general answer to this."}, {"time": 4526, "text": "Was Genghis Khan doing anything wrong?"}, {"time": 4529, "text": "It depends right on how you look at it."}, {"time": 4531, "text": "Well, he drew a line somewhere where this is us and that's them."}, {"time": 4538, "text": "It's the circle of empathy."}, {"time": 4540, "text": "It's like these, you don't have to use the word consciousness, but these are the things that matter to me if they suffer or not."}, {"time": 4550, "text": "And these are the things that don't matter to him."}, {"time": 4552, "text": "Yeah, but when one of his commanders failed him, he broke his spine and let him die in a horrible way."}, {"time": 4559, "text": "And so in some sense, I think he was indifferent to suffering or he was not different in the sense that he didn't see it as useful if he inflicted suffering, but he did not see it as something that had to be avoided."}, {"time": 4574, "text": "That was not the goal."}, {"time": 4575, "text": "The question was, how can I use suffering and the infliction of suffering to reach my goals from his perspective?"}, {"time": 4584, "text": "So like different societies throughout history put different value on the..."}, {"time": 4589, "text": "Different individuals, different psyches."}, {"time": 4591, "text": "But also even the objective of avoiding suffering, like some societies probably, I mean, this is where like religious belief really helps that afterlife, that it doesn't matter that you suffer or die, what matters is you suffer honorably, right?"}, {"time": 4609, "text": "So that you enter the afterlife as a hero."}, {"time": 4612, "text": "It seems to be superstitious to me, basically beliefs that assert things for which no evidence exists are incompatible with sound epistemology."}, {"time": 4622, "text": "And I don't think that religion has to be superstitious, otherwise it should be condemned in all cases."}, {"time": 4626, "text": "You're somebody who's saying we live in a dream world, we have zero evidence for anything."}, {"time": 4631, "text": "So... That's not the case."}, {"time": 4633, "text": "There are limits to what languages can be constructed."}, {"time": 4636, "text": "Mathematics brings solid evidence for its own structure."}, {"time": 4639, "text": "And once we have some idea of what languages exist and how a system can learn and what learning itself is in the first place."}, {"time": 4646, "text": "And so we can begin to realize that our intuitions that we are able to learn about the regularities of the world and minimize surprise and understand the nature of our own agency to some degree of abstraction."}, {"time": 4662, "text": "So it's a useful approximation."}, {"time": 4664, "text": "Just because we live in a dream world doesn't mean mathematics can't give us a consistent glimpse of physical, of objective reality."}, {"time": 4674, "text": "We can basically distinguish useful encodings from useless encodings."}, {"time": 4678, "text": "And when we apply our truth seeking to the world, we know we usually cannot find out whether a certain thing is true."}, {"time": 4687, "text": "What we typically do is we take the state vector of the universe separated into separate objects that interact with each other through interfaces."}, {"time": 4694, "text": "And this distinction that we are making is not completely arbitrary."}, {"time": 4697, "text": "It's done to optimize the compression that we can apply to our models of the universe."}, {"time": 4703, "text": "So we can predict what's happening with our limited resources."}, {"time": 4707, "text": "In this sense, it's not arbitrary."}, {"time": 4709, "text": "But the separation of the world into objects that are somehow discrete and interacting with each other is not the true reality, right?"}, {"time": 4716, "text": "The boundaries between the objects are projected into the world, not arbitrarily projected."}, {"time": 4721, "text": "But still, it's only an approximation of what's actually the case."}, {"time": 4726, "text": "And we sometimes notice that we run into contradictions when we try to understand high level things like economic aspects of the world and so on, or political aspects, or psychological aspects where we make simplifications."}, {"time": 4738, "text": "And the objects that we are using to separate the world are just one of many possible projections of what's going on."}, {"time": 4744, "text": "So it's not, in this postmodernist sense, completely arbitrary, and you're free to pick what you want or dismiss what you don't like because it's all stories."}, {"time": 4753, "text": "You have to show for every model of how well it predicts the world."}, {"time": 4757, "text": "So the confidence that you should have in the entities of your models should correspond to the evidence that you have."}, {"time": 4764, "text": "Can I ask you on a small tangent to talk about your favorite set of ideas and people, which is postmodernism."}, {"time": 4777, "text": "What is postmodernism?"}, {"time": 4779, "text": "How would you define it?"}, {"time": 4780, "text": "And why to you is it not a useful framework of thought?"}, {"time": 4788, "text": "Postmodernism is something that I'm really not an expert on."}, {"time": 4792, "text": "And postmodernism is a set of philosophical ideas that is difficult to lump together, that is characterized by some useful thinkers, some of them poststructuralists and so on."}, {"time": 4804, "text": "And I'm mostly not interested in it because I think that it's not leading me anywhere that I find particularly useful."}, {"time": 4811, "text": "It's mostly, I think, born out of the insight that the ontologies that we impose on the world are not literally true."}, {"time": 4818, "text": "And that we can often get to a different interpretation by the world by using a different ontology that is different separation of the world into interacting objects."}, {"time": 4826, "text": "But the idea that this makes the world a set of stories that are arbitrary, I think, is wrong."}, {"time": 4833, "text": "And the people that are engaging in this type of philosophy are working in an area that I largely don't find productive."}, {"time": 4840, "text": "There's nothing useful coming out of this."}, {"time": 4843, "text": "So this idea that truth is relative is not something that has, in some sense, informed physics or theory of relativity."}, {"time": 4849, "text": "And there is no feedback between those."}, {"time": 4851, "text": "There is no meaningful information of this type of philosophy on the sciences or on engineering or in politics."}, {"time": 4859, "text": "But there is a very strong information on ideology because it basically has become an ideology that is justifying itself by the notion that truth is a relative concept."}, {"time": 4873, "text": "And it's not being used in such a way that the philosophers or sociologists that take up these ideas say, oh, I should doubt my own ideas because maybe my separation of the world into objects is not completely valid."}, {"time": 4885, "text": "And I should maybe use a different one and be open to a pluralism of ideas."}, {"time": 4890, "text": "But it mostly exists to dismiss the ideas of other people."}, {"time": 4894, "text": "It becomes, yeah, it becomes a political weapon of sorts to achieve power."}, {"time": 4899, "text": "Basically, there's nothing wrong, I think, with developing a philosophy around this."}, {"time": 4906, "text": "But to develop a philosophy around this, to develop norms around the idea that truth is something that is completely negotiable, is incompatible with the scientific project."}, {"time": 4917, "text": "And I think if the academia has no defense against the ideological parts of the postmodernist movement, it's doomed."}, {"time": 4927, "text": "Right, you have to acknowledge the ideological part of any movement, actually, including postmodernism."}, {"time": 4935, "text": "Well, the question is what an ideology is."}, {"time": 4937, "text": "And to me, an ideology is basically a viral memeplex that is changing your mind in such a way that reality gets warped."}, {"time": 4945, "text": "It gets warped in such a way that you're being cut off from the rest of human thought space."}, {"time": 4949, "text": "And you cannot consider things outside of the range of ideas of your own ideology as possibly true."}, {"time": 4955, "text": "Right, so, I mean, there's certain properties to an ideology that make it harmful."}, {"time": 4959, "text": "One of them is that dogmatism of just certainty, dogged certainty in that you're right, you have the truth, and nobody else does."}, {"time": 4968, "text": "Yeah, but what is creating the certainty?"}, {"time": 4970, "text": "It's very interesting to look at the type of model that is being produced."}, {"time": 4974, "text": "Is it basically just a strong prior, and you tell people, oh, this idea that you consider to be very true, the evidence for this is actually just much weaker than you thought, and look, here are some studies."}, {"time": 4984, "text": "No, this is not how it works."}, {"time": 4986, "text": "It's usually normative, which means some thoughts are unthinkable because they would change your identity into something that is no longer acceptable."}, {"time": 4997, "text": "And this cuts you off from considering an alternative."}, {"time": 5000, "text": "And many de facto religions use this trick to lock people into a certain mode of thought, and this removes agency over your own thoughts."}, {"time": 5007, "text": "And it's very ugly to me."}, {"time": 5008, "text": "It's basically not just a process of domestication, but it's actually an intellectual castration that happens."}, {"time": 5016, "text": "It's an inability to think creatively and to bring forth new thoughts."}, {"time": 5020, "text": "I can ask you about substances, chemical substances that affect the video game, the dream world."}, {"time": 5033, "text": "So psychedelics that increasingly have been getting a lot of research done on them."}, {"time": 5038, "text": "So in general, psychedelics, psilocybin, MDMA, but also a really interesting one, the big one, which is DMT."}, {"time": 5046, "text": "What and where are the places that these substances take the mind that is operating in the dream world?"}, {"time": 5056, "text": "Do you have an interesting sense how this throws a wrinkle into the prediction model?"}, {"time": 5062, "text": "Is it just some weird little quirk or is there some fundamental expansion of the mind going on?"}, {"time": 5071, "text": "I suspect that a way to look at psychedelics is that they induce particular types of lucid dreaming states."}, {"time": 5078, "text": "So it's a state in which certain connections are being severed in your mind."}, {"time": 5083, "text": "They're no longer active."}, {"time": 5085, "text": "Your mind basically gets free to move in a certain direction because some inhibition, some particular inhibition doesn't work anymore."}, {"time": 5092, "text": "And as a result, you might stop having a self or you might stop perceiving the world as three dimensional."}, {"time": 5100, "text": "And you can explore that state."}, {"time": 5104, "text": "And I suppose that for every state that can be induced with psychedelics, there are people that are naturally in that state."}, {"time": 5110, "text": "So sometimes psychedelics to shift you through a range of possible mental states."}, {"time": 5115, "text": "And they can also shift you out of the range of permissible mental states that is where you can make predictive models of reality."}, {"time": 5122, "text": "And what I observe in people that use psychedelics a lot is that they tend to be overfitting."}, {"time": 5129, "text": "Overfitting means that you are using more bits for modeling the dynamics of a function than you should."}, {"time": 5138, "text": "And so you can fit your curve to extremely detailed things in the past, but this model is no longer predictive for the future."}, {"time": 5145, "text": "What is it about psychedelics that forces that?"}, {"time": 5149, "text": "I thought it would be the opposite."}, {"time": 5151, "text": "I thought that it's a good mechanism for generalization, for regularization."}, {"time": 5159, "text": "So it feels like psychedelics expansion of the mind, like taking you outside of, like forcing your model to be non predictive is a good thing."}, {"time": 5171, "text": "Meaning like, it's almost like, okay, what I would say psychedelics are akin to is traveling to a totally different environment."}, {"time": 5179, "text": "Like going, if you've never been to like India or something like that from the United States, very different set of people, different culture, different food, different roads and values and all those kinds of things."}, {"time": 5191, "text": "Yeah, so psychedelics can, for instance, teleport people into a universe that is hyperbolic, which means that if you imagine a room that you're in, you can turn around 360 degrees and you didn't go full circle."}, {"time": 5204, "text": "You need to go 720 degrees to go full circle."}, {"time": 5208, "text": "So the things that people learn in that state cannot be easily transferred in this universe that we are in."}, {"time": 5214, "text": "It could be that if they're able to abstract and understand what happened to them, that they understand that some part of their spatial cognition has been desynchronized and has found a different synchronization."}, {"time": 5225, "text": "And this different synchronization happens to be a hyperbolic one, right?"}, {"time": 5228, "text": "So you learn something interesting about your brain."}, {"time": 5230, "text": "It's difficult to understand what exactly happened, but we get a pretty good idea once we understand how the brain is representing geometry."}, {"time": 5237, "text": "Yeah, but doesn't it give you a fresh perspective on the physical reality?"}, {"time": 5246, "text": "Who's making that sound?"}, {"time": 5247, "text": "Is it inside my head or is it external?"}, {"time": 5250, "text": "Well, there is no sound outside of your mind, but it's making sense of phenomenon physics."}, {"time": 5259, "text": "Yeah, in the physical reality, there's sound waves traveling through air."}, {"time": 5267, "text": "That's our model of what happened."}, {"time": 5268, "text": "That's our model of what happened, right."}, {"time": 5273, "text": "Doesn't Psychedelics give you a fresh perspective on this physical reality?"}, {"time": 5279, "text": "Like, not this physical reality, but this more... What do you call the dream world that's mapped directly to..."}, {"time": 5289, "text": "The purpose of dreaming at night, I think, is data augmentation."}, {"time": 5294, "text": "So that's very different."}, {"time": 5296, "text": "That's very similar to Psychedelics."}, {"time": 5298, "text": "It's changed parameters about the things that you have learned."}, {"time": 5301, "text": "And, for instance, when you are young, you have seen things from certain perspectives, but not from others."}, {"time": 5307, "text": "So your brain is generating new perspectives of objects that you already know, which means you can learn to recognize them later from different perspectives."}, {"time": 5315, "text": "And I suspect that's the reason that many of us remember to have flying dreams as children, because it's just different perspectives of the world that you already know, and that it starts to generate these different perspective changes, and then it fluidly turns this into a flying dream to make sense of what's happening, right?"}, {"time": 5332, "text": "So you fill in the gaps, and suddenly you see yourself flying."}, {"time": 5335, "text": "And similar things can happen with semantic relationships."}, {"time": 5338, "text": "So it's not just spatial relationships, but it can also be the relationships between ideas that are being changed."}, {"time": 5345, "text": "And it seems that the mechanisms that make that happen during dreaming are interacting with these same receptors that are being stimulated by psychedelics."}, {"time": 5357, "text": "So I suspect that there is a thing that I haven't read really about."}, {"time": 5362, "text": "The way in which dreams are induced in the brain is not just that the activity of the brain gets tuned down because your eyes are closed and you no longer get enough data from your eyes, but there is a particular type of neurotransmitter that is saturating your brain during these phases, during the REM phases, and you produce controlled hallucinations."}, {"time": 5384, "text": "And psychedelics are linking into these mechanisms, I suspect."}, {"time": 5389, "text": "So isn't that another trickier form of data augmentation?"}, {"time": 5394, "text": "Yes, but it's also data augmentation that can happen outside of the specification that your brain is tuned to."}, {"time": 5400, "text": "So basically people are overclocking their brains and that produces states that are subjectively extremely interesting."}, {"time": 5409, "text": "Yeah, I just."}, {"time": 5410, "text": "But from the outside, very suspicious."}, {"time": 5412, "text": "So I think I'm over applying the metaphor of a neural network in my own mind, which I just think that doesn't lead to overfitting, right?"}, {"time": 5422, "text": "But you were just sort of anecdotally saying my experiences with people that have done psychedelics are that kind of quality."}, {"time": 5430, "text": "I think it typically happens."}, {"time": 5431, "text": "So if you look at people like Timothy Leary, and he has written beautiful manifestos about the effect of LSD on people."}, {"time": 5440, "text": "He genuinely believed, he writes in these manifestos, that in the future, science and art will only be done on psychedelics because it's so much more efficient and so much better."}, {"time": 5449, "text": "And he gave LSD to children in this community of a few thousand people that he had near San Francisco."}, {"time": 5455, "text": "And basically he was losing touch with reality."}, {"time": 5460, "text": "He did not understand the effects that the things that he was doing would have on the reception of psychedelics by society because he was unable to think critically about what happened."}, {"time": 5470, "text": "What happened was that he got in a euphoric state, that euphoric state happened because he was overfitting."}, {"time": 5476, "text": "He was taking this sense of euphoria and translating it into a model of actual success in the world, right?"}, {"time": 5483, "text": "He was feeling better."}, {"time": 5485, "text": "Limitations had disappeared, that he experienced to be existing, but he didn't get superpowers."}, {"time": 5490, "text": "I understand what you mean by overfitting now."}, {"time": 5493, "text": "There's a lot of interpretation to the term overfitting in this case, but I got you."}, {"time": 5498, "text": "So he was getting positive rewards from a lot of actions that he shouldn't have been doing."}, {"time": 5504, "text": "Yeah, but not just this."}, {"time": 5505, "text": "So if you take, for instance, John Lilly, who was studying dolphin languages and aliens and so on, a lot of people that use psychedelics became very loopy."}, {"time": 5515, "text": "And the typical thing that you notice when people are on psychedelics is that they are in a state where they feel that everything can be explained now."}, {"time": 5523, "text": "Everything is clear, everything is obvious."}, {"time": 5526, "text": "And sometimes they have indeed discovered a useful connection, but not always."}, {"time": 5532, "text": "Very often these connections are overinterpretations."}, {"time": 5535, "text": "I wonder, you know, there's a question of correlation versus causation."}, {"time": 5541, "text": "And also I wonder if it's the psychedelics or if it's more the social, like being the outsider and having a strong community of outside and having a leadership position in an outsider cult like community that could have a much stronger effect of overfitting than do psychedelics themselves, the actual substances, because it's a counterculture thing."}, {"time": 5563, "text": "So it could be that as opposed to the actual substance."}, {"time": 5566, "text": "If you're a boring person who wears a suit and tie and works at a bank and takes psychedelics, that could be a very different effect of psychedelics on your mind."}, {"time": 5577, "text": "I'm just sort of raising the point that the people you referenced are already weirdos."}, {"time": 5584, "text": "No, not necessarily."}, {"time": 5585, "text": "A lot of the people that tell me that they use psychedelics in a useful way started out as squares and were liberating themselves because they were stuck."}, {"time": 5596, "text": "They were basically stuck in local optimum of their own self model, of their relationship to the world."}, {"time": 5600, "text": "And suddenly they had data augmentation."}, {"time": 5603, "text": "They basically saw and experienced a space of possibilities."}, {"time": 5606, "text": "They experienced what it would be like to be another person."}, {"time": 5609, "text": "And they took important lessons from that experience back home."}, {"time": 5616, "text": "Yeah, I mean, I love the metaphor of data augmentation because that's been the primary driver of self supervised learning in the computer vision domain is data augmentation."}, {"time": 5630, "text": "So it's funny to think of data augmentation, like chemically induced data augmentation in the human mind."}, {"time": 5638, "text": "There's also a very interesting effect that I noticed."}, {"time": 5642, "text": "I know several people who are sphere to me that LSD has cured their migraines."}, {"time": 5649, "text": "So severe cluster headaches or migraines that didn't respond to standard medication that disappeared after a single dose."}, {"time": 5658, "text": "And I don't recommend anybody doing this, especially not in the US where it's illegal."}, {"time": 5663, "text": "And there are no studies on this for that reason."}, {"time": 5666, "text": "But it seems that anecdotally that it basically can reset the serotonergic system."}, {"time": 5673, "text": "So it's basically pushing them outside of their normal boundaries."}, {"time": 5678, "text": "And as a result, it needs to find a new equilibrium."}, {"time": 5681, "text": "And in some people that equilibrium is better, but it also follows that in other people it might be worse."}, {"time": 5686, "text": "So if you have a brain that is already teetering on the boundary to psychosis, it can be permanently pushed over that boundary."}, {"time": 5694, "text": "Well, that's why you have to do good science, which they're starting to do on all these different substances of how well it actually works for the different conditions like MDMA seems to help with PTSD, same with psilocybin."}, {"time": 5705, "text": "You need to do good science, meaning large studies of large N. Yeah, so based on the existing studies of MDMA, it seems that if you look at Rick Doblin's work and what he has published about this and talks about, MDMA seems to be a psychologically relatively safe drug."}, {"time": 5724, "text": "But it's physiologically not very safe."}, {"time": 5726, "text": "That is, there is neurotoxicity if you would use a too large dose."}, {"time": 5731, "text": "And if you combine this with alcohol, which a lot of kids do in party settings during raves and so on, it's very hepatotoxic."}, {"time": 5740, "text": "So basically you can kill your liver."}, {"time": 5742, "text": "And this means that it's probably something that is best and most productively used in a clinical setting by people who really know what they're doing."}, {"time": 5750, "text": "And I suspect that's also true for the other psychedelics that is while the other psychedelics are probably not as toxic as say alcohol, the effects on the psyche can be much more profound and lasting."}, {"time": 5763, "text": "Yeah, well, as far as I know psilocybin, so mushrooms, magic mushrooms, as far as I know in terms of the studies they're running, I think have no, like they're allowed to do what they're calling heroic doses."}, {"time": 5777, "text": "So that one does not have a toxicity."}, {"time": 5778, "text": "So they could do like huge doses in a clinical setting when they're doing study on psilocybin, which is kind of fun."}, {"time": 5785, "text": "Yeah, it seems that most of the psychedelics work in extremely small doses, which means that the effect on the rest of the body is relatively low."}, {"time": 5793, "text": "And MDMA is probably the exception."}, {"time": 5796, "text": "Maybe ketamine can be dangerous in larger doses because it can depress breathing and so on."}, {"time": 5801, "text": "But the LSD and psilocybin work in very, very small doses, at least the active part of them, of psilocybin LSD is only the active part."}, {"time": 5810, "text": "And the, but the effect that it can have on your mental wiring can be very dangerous, I think."}, {"time": 5817, "text": "Let's talk about AI a little bit."}, {"time": 5820, "text": "What are your thoughts about GPT3 and language models trained with self supervised learning?"}, {"time": 5829, "text": "It came out quite a bit ago, but I wanted to get your thoughts on it."}, {"time": 5834, "text": "In the nineties, I was in New Zealand and I had an amazing professor, Ian Witten, who realized I was bored in class and put me in his lab."}, {"time": 5845, "text": "And he gave me the task to discover grammatical structure in an unknown language."}, {"time": 5851, "text": "And the unknown language that I picked was English because it was the easiest one to find a corpus for construct one."}, {"time": 5857, "text": "And he gave me the largest computer at the whole university."}, {"time": 5861, "text": "It had two gigabytes of RAM, which was amazing."}, {"time": 5864, "text": "And I wrote everything in C with some in memory compression to do statistics over the language."}, {"time": 5869, "text": "And I first would create a dictionary of all the words, which basically tokenizes everything and compresses things so that I don't need to store the whole word, but just a code for every word."}, {"time": 5882, "text": "And then I was taking this all apart in sentences and I was trying to find all the relationships between all the words in the sentences and do statistics over them."}, {"time": 5892, "text": "And that proved to be impossible because the complexity is just too large."}, {"time": 5898, "text": "So if you want to discover the relationship between an article and a noun, and there are three adjectives in between, you cannot do ngram statistics and look at all the possibilities that can exist, at least not with the resources that we had back then."}, {"time": 5910, "text": "So I realized I need to make some statistics over what I need to make statistics over."}, {"time": 5915, "text": "So I wrote something that was pretty much a hack that did this for at least first order relationships."}, {"time": 5922, "text": "And I came up with some kind of mutual information graph that was indeed discovering something that looks exactly like the grammatical structure of the sentence, just by trying to encode the sentence in such a way that the words would be written in the optimal order inside of the model."}, {"time": 5938, "text": "And what I also found is that if we would be able to increase the resolution of that and not just use this model to reproduce grammatically correct sentences, we would also be able to correct stylistically correct sentences by just having more bits in these relationships."}, {"time": 5954, "text": "And if we wanted to have meaning, we would have to go much higher order."}, {"time": 5958, "text": "And I didn't know how to make higher order models back then without spending way more years in research on how to make the statistics over what we need to make statistics over."}, {"time": 5968, "text": "And this thing that we cannot look at the relationships between all the bits in your input is being solved in different domains in different ways."}, {"time": 5975, "text": "So in computer graphics, computer vision, standard methods for many years now is convolutional neural networks."}, {"time": 5983, "text": "Convolutional neural networks are hierarchies of filters that exploit the fact that neighboring pixels in images are usually semantically related and distance pixels in images are usually not semantically related."}, {"time": 5995, "text": "So you can just by grouping the pixels that are next to each other, hierarchically together reconstruct the shape of objects."}, {"time": 6002, "text": "And this is an important prior that we built into these models so they can converge quickly."}, {"time": 6008, "text": "But this doesn't work in language for the reason that adjacent words are often but not always related and distant words are sometimes related while the words in between are not."}, {"time": 6019, "text": "So how can you learn the topology of language?"}, {"time": 6022, "text": "And I think for this reason that this difficulty existed, the transformer was invented in natural language processing, not in vision."}, {"time": 6032, "text": "And what the transformer is doing, it's a hierarchy of layers where every layer learns what to pay attention to in the given context in the previous layer."}, {"time": 6043, "text": "So what to make the statistics over."}, {"time": 6046, "text": "And the context is significantly larger than the adjacent word."}, {"time": 6051, "text": "Yes, so the context that GPT3 has been using, the transformer itself is from 2017 and it wasn't using that large of a context."}, {"time": 6062, "text": "OpenAI has basically scaled up this idea as far as they could at the time."}, {"time": 6066, "text": "And the context is about 2048 symbols, tokens in the language."}, {"time": 6072, "text": "These symbols are not characters, but they take the words and project them into a vector space where words that are statistically co occurring a lot are neighbors already."}, {"time": 6083, "text": "So it's already a simplification of the problem a little bit."}, {"time": 6086, "text": "And so every word is basically a set of coordinates in a high dimensional space."}, {"time": 6091, "text": "And then they use some kind of trick to also encode the order of the words in a sentence or in the not just sentence, but 2048 tokens is about a couple of pages of text or two and a half pages of text."}, {"time": 6103, "text": "And so they managed to do pretty exhaustive statistics over the potential relationships between two pages of text, which is tremendous."}, {"time": 6111, "text": "I was just using a single sentence back then."}, {"time": 6115, "text": "And I was only looking for first order relationships."}, {"time": 6118, "text": "And they were really looking for much, much higher level relationships."}, {"time": 6150, "text": "So the results that GPT3 got, I think were amazing."}, {"time": 6154, "text": "By the way, I actually didn't check carefully."}, {"time": 6158, "text": "It's funny you just mentioned how you coupled semantics to the multiplication."}, {"time": 6162, "text": "Is it able to do some basic math on two digit numbers?"}, {"time": 6168, "text": "I thought there's a lot of failure cases."}, {"time": 6173, "text": "Yeah, it basically fails if you take larger digit numbers."}, {"time": 6176, "text": "So four digit numbers and so on makes carrying mistakes and so on."}, {"time": 6180, "text": "And if you take larger numbers, you don't get useful results at all."}, {"time": 6184, "text": "And this could be an issue of the training set where there are not many examples of successful long form addition and standard human written text."}, {"time": 6195, "text": "And humans aren't very good at doing three digit numbers either."}, {"time": 6199, "text": "Yeah, you're not writing a lot about it."}, {"time": 6202, "text": "And the other thing is that the loss function that is being used is only minimizing surprise."}, {"time": 6207, "text": "So it's predicting what comes next in the typical text."}, {"time": 6209, "text": "It's not trying to go for causal closure first as we do."}, {"time": 6215, "text": "But the fact that that kind of prediction works to generate text that's semantically rich and consistent is interesting."}, {"time": 6225, "text": "So yeah, so it's amazing that it's able to generate semantically consistent text."}, {"time": 6230, "text": "It's not consistent."}, {"time": 6231, "text": "So the problem is that it loses coherence at some point, but it's also, I think, not correct to say that GPT3 is unable to deal with semantics at all because you ask it to perform certain transformations in text and it performs these transformation in text."}, {"time": 6247, "text": "And the kind of additions that it's able to perform are transformations in text, right?"}, {"time": 6252, "text": "And there are proper semantics involved."}, {"time": 6255, "text": "You can also do more."}, {"time": 6256, "text": "There was a paper that was generating lots and lots of mathematically correct text and was feeding this into a transformer."}, {"time": 6266, "text": "And as a result, it was able to learn how to do differentiation integration in race that according to the authors, Mathematica could not."}, {"time": 6277, "text": "To which some of the people in Mathematica responded that they were not using Mathematica in the right way and so on."}, {"time": 6283, "text": "I have not really followed the resolution of this conflict."}, {"time": 6286, "text": "This part, as a small tangent, I really don't like in machine learning papers, which they often do anecdotal evidence."}, {"time": 6296, "text": "They'll find like one example in some kind of specific use of Mathematica and demonstrate, look, here's, they'll show successes and failures, but they won't have a very clear representation of how many cases this actually represents."}, {"time": 6309, "text": "Yes, but I think as a first paper, this is a pretty good start."}, {"time": 6312, "text": "And so the take home message, I think, is that the authors could get better results from this in their experiments than they could get from the vein, which they were using computer algebra systems, which means that was not nothing."}, {"time": 6329, "text": "And it's able to perform substantially better than GPT's V can based on a much larger amount of training data using the same underlying algorithm."}, {"time": 6338, "text": "Well, let me ask, again, so I'm using your tweets as if this is like Plato, right?"}, {"time": 6347, "text": "As if this is well thought out novels that you've written."}, {"time": 6351, "text": "You tweeted, GPT4 is listening to us now."}, {"time": 6358, "text": "This is one way of asking, what are the limitations of GPT3 when it scales?"}, {"time": 6364, "text": "So what do you think will be the capabilities of GPT4, GPT5, and so on?"}, {"time": 6370, "text": "What are the limits of this approach?"}, {"time": 6371, "text": "So obviously when we are writing things right now, everything that we are writing now is going to be training data for the next generation of machine learning models."}, {"time": 6380, "text": "So yes, of course, GPT4 is listening to us."}, {"time": 6383, "text": "And I think the tweet is already a little bit older and we now have Voodao and we have a number of other systems that basically are placeholders for GPT4."}, {"time": 6393, "text": "Don't know what open AIS plans are in this regard."}, {"time": 6395, "text": "I read that tweet in several ways."}, {"time": 6399, "text": "So one is obviously everything you put on the internet is used as training data."}, {"time": 6404, "text": "But in a second way I read it is in a, we talked about agency."}, {"time": 6411, "text": "I read it as almost like GPT4 is intelligent enough to be choosing to listen."}, {"time": 6418, "text": "So not only like did a programmer tell it to collect this data and use it for training, I almost saw the humorous angle, which is like it has achieved AGI kind of thing."}, {"time": 6429, "text": "Well, the thing is, could we be already be living in GPT5?"}, {"time": 6433, "text": "So GPT4 is listening and GPT5 actually constructing the entirety of the reality where we... Of course, in some sense, what everybody is trying to do right now in AI is to extend the transformer to be able to deal with video."}, {"time": 6448, "text": "And there are very promising extensions, right?"}, {"time": 6451, "text": "There's a work by Google that is called Perceiver and that is overcoming some of the limitations of the transformer by letting it learn the topology of the different modalities separately."}, {"time": 6464, "text": "And by training it to find better input features."}, {"time": 6470, "text": "So basically feature abstractions that are being used by this successor to GPT3 are chosen such a way that it's able to deal with video input."}, {"time": 6480, "text": "And there is more to be done."}, {"time": 6482, "text": "So one of the limitations of GPT3 is that it's amnesiac."}, {"time": 6487, "text": "So it forgets everything beyond the two pages that it currently reads also during generation, not just during learning."}, {"time": 6494, "text": "Do you think that's fixable within the space of deep learning?"}, {"time": 6498, "text": "Can you just make a bigger, bigger, bigger input?"}, {"time": 6501, "text": "No, I don't think that our own working memory is infinitely large."}, {"time": 6505, "text": "It's probably also just a few thousand bits."}, {"time": 6508, "text": "But what you can do is you can structure this working memory."}, {"time": 6511, "text": "So instead of just force feeding this thing, a certain thing that it has to focus on, and it's not allowed to focus on anything else as its network, you allow it to construct its own working memory as we do."}, {"time": 6524, "text": "When we are reading a book, it's not that we are focusing our attention in such a way that we can only remember the current page."}, {"time": 6532, "text": "We will also try to remember other pages and try to undo what we learned from them or modify what we learned from them."}, {"time": 6538, "text": "We might get up and take another book from the shelf."}, {"time": 6541, "text": "We might go out and ask somebody, we can edit our working memory in any way that is useful to put a context together that allows us to draw the right inferences and to learn the right things."}, {"time": 6553, "text": "So this ability to perform experiments on the world based on an attempt to become fully coherent and to achieve causal closure, to achieve a certain aesthetic of your modeling, that is something that eventually needs to be done."}, {"time": 6568, "text": "And at the moment we are skirting this in some sense by building systems that are larger and faster so they can use dramatically larger resources and human beings can do and much more training data to get to models that in some sense are already way superhuman and in other ways are laughingly incoherent."}, {"time": 6585, "text": "So do you think sort of making the systems like, what would you say, multi resolutional?"}, {"time": 6591, "text": "So like some of the language models are focused on two pages, some are focused on two books, some are focused on two years of reading, some are focused on a lifetime, so it's like stacks of GPT3s all the way down."}, {"time": 6611, "text": "You want to have gaps in between them."}, {"time": 6613, "text": "So it's not necessarily two years, there's no gaps."}, {"time": 6617, "text": "It's things out of two years or out of 20 years or 2,000 years or 2 billion years where you are just selecting those bits that are predicted to be the most useful ones to understand what you're currently doing."}, {"time": 6629, "text": "And this prediction itself requires a very complicated model and that's the actual model that you need to be making."}, {"time": 6634, "text": "It's not just that you are trying to understand the relationships between things, but what you need to make relationships, discover relationships over."}, {"time": 6642, "text": "I wonder what that thing looks like, what the architecture for the thing that's able to have that kind of model."}, {"time": 6650, "text": "I think it needs more degrees of freedom than the current models have."}, {"time": 6654, "text": "So it starts out with the fact that you possibly don't just want to have a feed forward model, but you want it to be fully recurrent."}, {"time": 6662, "text": "And to make it fully recurrent, you probably need to loop it back into itself and allow it to skip connections."}, {"time": 6668, "text": "Once you do this, when you're predicting the next frame and your internal next frame in every moment, and you are able to skip connection, it means that signals can travel from the output of the network into the middle of the network faster than the inputs do."}, {"time": 6685, "text": "Do you think it can still be differentiable?"}, {"time": 6688, "text": "Do you think it still can be a neural network?"}, {"time": 6690, "text": "Sometimes it can and sometimes it cannot."}, {"time": 6692, "text": "So it can still be a neural network, but not a fully differentiable one."}, {"time": 6697, "text": "And when you want to deal with non differentiable ones, you need to have an attention system that is discreet and two dimensional and can perform grammatical operations."}, {"time": 6706, "text": "You need to be able to perform program synthesis."}, {"time": 6709, "text": "You need to be able to backtrack in this operations that you perform on this thing."}, {"time": 6714, "text": "And this thing needs a model of what it's currently doing."}, {"time": 6716, "text": "And I think this is exactly the purpose of our own consciousness."}, {"time": 6721, "text": "Yeah, the program things are tricky on neural networks."}, {"time": 6725, "text": "So let me ask you, it's not quite program synthesis, but the application of these language models to generation, to program synthesis, but generation of programs."}, {"time": 6736, "text": "So if you look at GitHub OpenPilot, which is based on OpenAI's codecs, I don't know if you got a chance to look at it, but it's the system that's able to generate code once you prompt it with, what is it?"}, {"time": 6750, "text": "Like the header of a function with some comments."}, {"time": 6752, "text": "And it seems to do an incredibly good job or not a perfect job, which is very important, but an incredibly good job of generating functions."}, {"time": 6764, "text": "Are you, is this exciting or is this just a party trick, a demo?"}, {"time": 6768, "text": "Or is this revolutionary?"}, {"time": 6771, "text": "I haven't worked with it yet."}, {"time": 6772, "text": "So it's difficult for me to judge it, but I would not be surprised if it turns out to be a revolutionary."}, {"time": 6779, "text": "And that's because the majority of programming tasks that are being done in the industry right now are not creative."}, {"time": 6785, "text": "People are writing code that other people have written, or they're putting things together from code fragments that others have had."}, {"time": 6791, "text": "And a lot of the work that programmers do in practice is to figure out how to overcome the gaps in their current knowledge and the things that people have already done."}, {"time": 6800, "text": "How to copy and paste from Stack Overflow, that's right."}, {"time": 6804, "text": "And so of course we can automate that."}, {"time": 6806, "text": "Yeah, to make it much faster to copy and paste from Stack Overflow."}, {"time": 6810, "text": "Yes, but it's not just copying and pasting."}, {"time": 6812, "text": "It's also basically learning which parts you need to modify to make them fit together."}, {"time": 6818, "text": "Yeah, like literally sometimes as simple as just changing the variable names."}, {"time": 6823, "text": "So it fits into the rest of your code."}, {"time": 6825, "text": "Yes, but this requires that you understand the semantics of what you're doing to some degree."}, {"time": 6829, "text": "And you can automate some of those things."}, {"time": 6831, "text": "The thing that makes people nervous of course is that a little bit wrong in a program can have a dramatic effect on the actual final operation of that program."}, {"time": 6843, "text": "So that's one little error, which in the space of language doesn't really matter, but in the space of programs can matter a lot."}, {"time": 6851, "text": "Yes, but this is already what is happening when humans program code."}, {"time": 6855, "text": "Yeah, this is."}, {"time": 6856, "text": "So we have a technology to deal with this."}, {"time": 6860, "text": "Somehow it becomes scarier when you know that a program generated code that's running a nuclear power plant."}, {"time": 6867, "text": "It becomes scarier."}, {"time": 6869, "text": "You know, humans have errors too."}, {"time": 6872, "text": "But it's scarier when a program is doing it because why, why?"}, {"time": 6878, "text": "I mean, there's a fear that a program, like a program may not be as good as humans to know when stuff is important to not mess up."}, {"time": 6891, "text": "Like there's a misalignment of priorities of values that's potential."}, {"time": 6901, "text": "Maybe that's the source of the worry."}, {"time": 6903, "text": "I mean, okay, if I give you code generated by GitHub open pilot and code generated by a human and say here, use one of these, which how do you select today and in the next 10 years which code do you use?"}, {"time": 6921, "text": "Wouldn't you still be comfortable with the human?"}, {"time": 6925, "text": "At the moment when you go to Stanford to get an MRI, they will write a bill to the insurance over $20,000."}, {"time": 6934, "text": "And of this, maybe half of that gets paid by the insurance and a quarter gets paid by you."}, {"time": 6940, "text": "And the MRI cost them $600 to make maybe probably less."}, {"time": 6944, "text": "And what are the values of the person that writes the software and deploys this process?"}, {"time": 6951, "text": "It's very difficult for me to say whether I trust people."}, {"time": 6956, "text": "I think that what happens there is a mixture of proper Anglo Saxon Protestant values where somebody is trying to serve an abstract radar hole and organize crime."}, {"time": 6966, "text": "Well, that's a very harsh, I think that's a harsh view of humanity."}, {"time": 6975, "text": "There's a lot of bad people, whether incompetent or just malevolent in this world, yes."}, {"time": 6981, "text": "But it feels like the more malevolent, so the more damage you do to the world, the more resistance you have in your own human heart."}, {"time": 6994, "text": "Yeah, but don't explain with malevolence or stupidity what can be explained by just people acting on their incentives."}, {"time": 7001, "text": "Right, so what happens in Stanford is not that somebody is evil."}, {"time": 7005, "text": "It's just that they do what they're being paid for."}, {"time": 7008, "text": "No, it's not evil."}, {"time": 7010, "text": "That's, I tend to, no, I see that as malevolence."}, {"time": 7013, "text": "I see as I, even like being a good German, as I told you offline, is some, it's not absolute malevolence, but it's a small amount, it's cowardice."}, {"time": 7027, "text": "I mean, when you see there's something wrong with the world, it's either incompetence and you're not able to see it, or it's cowardice that you're not able to stand up, not necessarily in a big way, but in a small way."}, {"time": 7041, "text": "So I do think that is a bit of malevolence."}, {"time": 7045, "text": "I'm not sure the example you're describing is a good example of that."}, {"time": 7048, "text": "So the question is, what is it that you are aiming for?"}, {"time": 7051, "text": "And if you don't believe in the future, if you, for instance, think that the dollar is going to crash, why would you try to save dollars?"}, {"time": 7059, "text": "If you don't think that humanity will be around in a hundred years from now, because global warming will wipe out civilization, why would you need to act as if it were?"}, {"time": 7070, "text": "Right, so the question is, is there an overarching aesthetics that is projecting you and the world into the future, which I think is the basic idea of religion, that you understand the interactions that we have with each other as some kind of civilization level agent that is projecting itself into the future."}, {"time": 7087, "text": "If you don't have that shared purpose, what is there to be ethical for?"}, {"time": 7092, "text": "So I think when we talk about ethics and AI, we need to go beyond the insane bias discussions and so on, where people are just measuring the distance between a statistic to their preferred current world model."}, {"time": 7107, "text": "The optimism, wait, wait, wait, I was a little confused by the previous thing, just to clarify."}, {"time": 7112, "text": "There is a kind of underlying morality to having an optimism that human civilization will persist for longer than a hundred years."}, {"time": 7125, "text": "Like I think a lot of people believe that it's a good thing for us to keep living."}, {"time": 7134, "text": "And thriving."}, {"time": 7134, "text": "This morality itself is not an end to itself."}, {"time": 7136, "text": "It's instrumental to people living in a hundred years from now or 500 years from now."}, {"time": 7143, "text": "So it's only justifiable if you actually think that it will lead to people or increase the probability of people being around in that timeframe."}, {"time": 7152, "text": "And a lot of people don't actually believe that, at least not actively."}, {"time": 7156, "text": "But believe what exactly?"}, {"time": 7157, "text": "So I was..."}, {"time": 7159, "text": "Most people don't believe that they can afford to act on such a model."}, {"time": 7163, "text": "Basically what happens in the US is I think that the healthcare system is for a lot of people no longer sustainable, which means that if they need the help of the healthcare system, they're often not able to afford it."}, {"time": 7173, "text": "And when they cannot help it, they are often going bankrupt."}, {"time": 7177, "text": "I think the leading cause of personal bankruptcy in the US is the healthcare system."}, {"time": 7182, "text": "And that would not be necessary."}, {"time": 7184, "text": "It's not because people are consuming more and more medical services and are achieving a much, much longer life as a result."}, {"time": 7191, "text": "That's not actually the story that is happening because you can compare it to other countries."}, {"time": 7195, "text": "And life expectancy in the US is currently not increasing and it's not as high as in all the other industrialized countries."}, {"time": 7201, "text": "So some industrialized countries are doing better with a much cheaper healthcare system."}, {"time": 7206, "text": "And what you can see is for instance, administrative bloat."}, {"time": 7209, "text": "The healthcare system has maybe to some degree deliberately set up as a job placement program to allow people to continue living in middle class existence, despite not having useful use case in productivity."}, {"time": 7225, "text": "So they are being paid to push paper around."}, {"time": 7228, "text": "And the number of administrator in the healthcare system has been increasing much faster than the number of practitioners."}, {"time": 7235, "text": "And this is something that you have to pay for."}, {"time": 7237, "text": "And also the revenues that are being generated in the healthcare system are relatively large and somebody has to pay for them."}, {"time": 7243, "text": "And the result why they are so large is because market mechanisms are not working."}, {"time": 7248, "text": "The FDA is largely not protecting people from malpractice of healthcare providers."}, {"time": 7255, "text": "The FDA is protecting healthcare providers from competition."}, {"time": 7260, "text": "So this is a thing that has to do with values."}, {"time": 7263, "text": "And this is not because people are malicious on all levels."}, {"time": 7266, "text": "It's because they are not incentivized to act on a greater whole on this idea that you treat somebody who comes to you as a patient, like you would treat a family member."}, {"time": 7275, "text": "Yeah, but we're trying, I mean, you're highlighting a lot of the flaws of the different institutions, the systems we're operating under, but I think there's a continued throughout history mechanism design of trying to design incentives in such a way that these systems behave better and better and better."}, {"time": 7292, "text": "I mean, it's a very difficult thing to operate a society of hundreds of millions of people effectively with."}, {"time": 7299, "text": "Yes, so do we live in a society that is ever correcting?"}, {"time": 7302, "text": "Is this, do we observe that our models of what we are doing are predictive of the future and when they are not, we improve them."}, {"time": 7311, "text": "Are our laws adjudicated with clauses that you put into every law, what is meant to be achieved by that law and the law will be automatically repealed if it's not achieving that, right?"}, {"time": 7321, "text": "If you are optimizing your own laws, if you're writing your own source code, you probably make an estimate of what is this thing that's currently wrong in my life?"}, {"time": 7329, "text": "What is it that I should change about my own policies?"}, {"time": 7332, "text": "What is the expected outcome?"}, {"time": 7334, "text": "And if that outcome doesn't manifest, I will change the policy back, right?"}, {"time": 7338, "text": "Or I would change it to something different."}, {"time": 7340, "text": "Are we doing this on a societal level?"}, {"time": 7343, "text": "I think it's easy to sort of highlight the, I think we're doing it in the way that, like I operate my current life."}, {"time": 7350, "text": "I didn't sleep much last night."}, {"time": 7352, "text": "You would say that Lex, the way you need to operate your life is you need to always get sleep."}, {"time": 7357, "text": "The fact that you didn't sleep last night is totally the wrong way to operate in your life."}, {"time": 7363, "text": "Like you should have gotten all your shit done in time and gotten to sleep because sleep is very important for health and you're highlighting, look, this person is not sleeping."}, {"time": 7372, "text": "Look, the medical, the healthcare system is operating poor."}, {"time": 7376, "text": "But the point is we just, it seems like this is the way, especially in the capitalist society, we operate."}, {"time": 7382, "text": "We keep running into trouble and last minute, we try to get our way out through innovation and it seems to work."}, {"time": 7390, "text": "You have a lot of people that ultimately are trying to build a better world and get urgency about them when the problem becomes more and more imminent."}, {"time": 7402, "text": "And that's the way this operates."}, {"time": 7404, "text": "But if you look at the long arc of history, it seems like that operating on deadlines produces progress and builds better and better systems."}, {"time": 7416, "text": "You probably agree with me that the US should have engaged in mask production in January 2020 and that we should have shut down the airports early on and that we should have made it mandatory that the people that work in nursing homes are living on campus rather than living at home and then coming in and infecting people in the nursing homes that had no immune response to COVID."}, {"time": 7443, "text": "And that is something that was, I think, visible back then."}, {"time": 7448, "text": "The correct decisions haven't been made."}, {"time": 7450, "text": "We would have the same situation again."}, {"time": 7452, "text": "How do we know that these wrong decisions are not being made again?"}, {"time": 7455, "text": "Have the people that made the decisions to not protect the nursing homes been punished?"}, {"time": 7460, "text": "Have the people that made the wrong decisions with respect to testing that prevented the development of testing by startup companies and the importing of tests from countries that already had them, have these people been held responsible?"}, {"time": 7474, "text": "First of all, so what do you wanna put before the firing squad?"}, {"time": 7478, "text": "I think they are being held responsible."}, {"time": 7479, "text": "No, just make sure that this doesn't happen again."}, {"time": 7481, "text": "No, but it's not that, yes, they're being held responsible by many voices, by people being frustrated."}, {"time": 7488, "text": "There's new leaders being born now that we're going to see rise to the top in 10 years."}, {"time": 7494, "text": "This moves slower than, there's obviously a lot of older incompetence and bureaucracy and these systems move slowly."}, {"time": 7503, "text": "They move like science, one death at a time."}, {"time": 7506, "text": "So yes, I think the pain that's been felt in the previous year is reverberating throughout the world."}, {"time": 7515, "text": "Maybe I'm getting old, I suspect that every generation in the US after the war has lost the plot even more."}, {"time": 7521, "text": "I don't see this development."}, {"time": 7523, "text": "The war, World War II?"}, {"time": 7524, "text": "Yes, so basically there was a time when we were modernist and in this modernist time, the US felt actively threatened by the things that happened in the world."}, {"time": 7535, "text": "The US was worried about possibility of failure and this imminence of possible failure led to decisions."}, {"time": 7544, "text": "There was a time when the government would listen to physicists about how to do things and the physicists were actually concerned about what the government should be doing."}, {"time": 7553, "text": "So they would be writing letters to the government and so for instance, the decision for the Manhattan Project was something that was driven in a conversation between physicists and the government."}, {"time": 7564, "text": "I don't think such a discussion would take place today."}, {"time": 7566, "text": "I disagree, I think if the virus was much deadlier, we would see a very different response."}, {"time": 7572, "text": "I think the virus was not sufficiently deadly and instead because it wasn't very deadly, what happened is the current system started to politicize it."}, {"time": 7581, "text": "The mask, this is what I realized with masks early on, they were not, very quickly became not as a solution but they became a thing that politicians used to divide the country."}, {"time": 7593, "text": "So the same things happened with vaccines, same thing."}, {"time": 7596, "text": "So like nobody's really, people weren't talking about solutions to this problem because I don't think the problem was bad enough."}, {"time": 7603, "text": "When you talk about the war, I think our lives are too comfortable."}, {"time": 7608, "text": "I think in the developed world, things are too good and we have not faced severe dangers."}, {"time": 7614, "text": "When the danger, the severe dangers, existential threats are faced, that's when we step up on a small scale and a large scale."}, {"time": 7622, "text": "Now, I don't, that's sort of my argument here but I did think the virus is, I was hoping that it was actually sufficiently dangerous for us to step up because especially in the early days, it was unclear, it still is unclear because of mutations, how bad it might be, right?"}, {"time": 7645, "text": "And so I thought we would step up and even, so the masks point is a tricky one because to me, the manufacture of masks isn't even the problem."}, {"time": 7658, "text": "I'm still to this day and I was involved with a bunch of this work, have not seen good science done on whether masks work or not."}, {"time": 7666, "text": "Like there still has not been a large scale study."}, {"time": 7669, "text": "To me, that should be, there should be large scale studies and every possible solution, like aggressive in the same way that the vaccine development was aggressive."}, {"time": 7677, "text": "There should be masks, which tests, what kind of tests work really well, what kind of, like even the question of how the virus spreads."}, {"time": 7686, "text": "There should be aggressive studies on that to understand."}, {"time": 7689, "text": "I'm still, as far as I know, there's still a lot of uncertainty about that."}, {"time": 7694, "text": "Nobody wants to see this as an engineering problem that needs to be solved."}, {"time": 7698, "text": "It's that I was surprised about, but I wouldn't."}, {"time": 7701, "text": "So I find that our views are largely convergent but not completely."}, {"time": 7705, "text": "So I agree with the thing that because our society in some sense perceives itself as too big to fail."}, {"time": 7713, "text": "The virus did not alert people to the fact that we are facing possible failure that basically put us into the postmodernist mode."}, {"time": 7721, "text": "And I don't mean in a philosophical sense but in a societal sense."}, {"time": 7725, "text": "The difference between the postmodern society and the modern society is that the modernist society has to deal with the ground truth and the postmodernist society has to deal with appearances."}, {"time": 7735, "text": "Politics becomes a performance and the performance is done for an audience and the organized audience is the media."}, {"time": 7742, "text": "And the media evaluates itself via other media, right?"}, {"time": 7745, "text": "So you have an audience of critics that evaluate themselves."}, {"time": 7749, "text": "And I don't think it's so much the failure of the politicians because to get in power and to stay in power, you need to be able to deal with the published opinion."}, {"time": 7757, "text": "Well, I think it goes in cycles because what's going to happen is all of the small business owners, all the people who truly are suffering and will suffer more because the effects of the closure of the economy and the lack of solutions to the virus, they're going to apprise."}, {"time": 7776, "text": "And hopefully, I mean, this is where charismatic leaders can get the world in trouble but hopefully will elect great leaders that will break through this postmodernist idea of the media and the perception and the drama on Twitter and all that kind of stuff."}, {"time": 7797, "text": "But you know, this can go either way."}, {"time": 7800, "text": "When the Weimar Republic was unable to deal with the economic crisis that Germany was facing, there was an option to go back."}, {"time": 7810, "text": "But there were people which thought, let's get back to a constitutional monarchy and let's get this to work because democracy doesn't work."}, {"time": 7818, "text": "And eventually, there was no way back."}, {"time": 7821, "text": "People decided there was no way back."}, {"time": 7823, "text": "They needed to go forward."}, {"time": 7824, "text": "And the only options for going forward was to become Stalinist communist, basically an option to completely expropriate the factories and so on and nationalize them and to reorganize Germany in communist terms and ally itself with Stalin and fascism."}, {"time": 7844, "text": "And both options were obviously very bad."}, {"time": 7847, "text": "And the one that the Germans picked led to a catastrophe that devastated Europe."}, {"time": 7854, "text": "And I'm not sure if the US has an immune response against that."}, {"time": 7858, "text": "I think that the far right is currently very weak in the US, but this can easily change."}, {"time": 7865, "text": "Do you think from a historical perspective, Hitler could have been stopped from within Germany or from outside?"}, {"time": 7874, "text": "Or this, well, depends on who you wanna focus, whether you wanna focus on Stalin or Hitler, but it feels like Hitler was the one as a political movement that could have been stopped."}, {"time": 7885, "text": "I think that the point was that a lot of people wanted Hitler, so he got support from a lot of quarters."}, {"time": 7892, "text": "There was a number of industrialists who supported him because they thought that the democracy is obviously not working and unstable and you need a strong man."}, {"time": 7900, "text": "And he was willing to play that part."}, {"time": 7903, "text": "There were also people in the US who thought that Hitler would stop Stalin and would act as a bulwark against Bolshevism, which he probably would have done, right?"}, {"time": 7914, "text": "But at which cost?"}, {"time": 7916, "text": "And then many of the things that he was going to do, like the Holocaust, was something where people thought this is rhetoric, he's not actually going to do this."}, {"time": 7927, "text": "Especially many of the Jews themselves, which were humanists."}, {"time": 7930, "text": "And for them, this was outside of the scope that was thinkable."}, {"time": 7934, "text": "I mean, I wonder if Hitler is uniquely, I wanna carefully use this term, but uniquely evil."}, {"time": 7943, "text": "So if Hitler was never born, if somebody else would come in this place."}, {"time": 7949, "text": "So like, just thinking about the progress of history, how important are those singular figures that lead to mass destruction and cruelty?"}, {"time": 7960, "text": "Because my sense is Hitler was unique."}, {"time": 7967, "text": "It wasn't just about the environment and the context that gave him, like another person would not come in his place to do as destructive of the things that he did."}, {"time": 7978, "text": "There was a combination of charisma, of madness, of psychopathy, of just ego, all those things, which are very unlikely to come together in one person in the right time."}, {"time": 7992, "text": "It also depends on the context of the country that you're operating in."}, {"time": 7996, "text": "If you tell the Germans that they have a historical destiny in this romantic country, the effect is probably different than it is in other countries."}, {"time": 8007, "text": "But Stalin has killed a few more people than Hitler did."}, {"time": 8013, "text": "And if you look at the probability that you survived under Stalin, Hitler killed people if he thought they were not worth living, or if they were harmful to his racist project."}, {"time": 8029, "text": "He basically felt that the Jews would be too cosmopolitan and would not be willing to participate in the racist redefinition of society and the value of society, and there is no state in this way that he wanted to have it."}, {"time": 8043, "text": "So he saw them as harmful danger, especially since they played such an important role in the economy and culture of Germany."}, {"time": 8053, "text": "And so basically he had some radical but rational reason to murder them."}, {"time": 8060, "text": "And Stalin just killed everyone."}, {"time": 8063, "text": "Basically the Stalinist purges were such a random thing where he said that there's a certain possibility that this particular part of the population has a number of German collaborators or something, and we just kill them all, right?"}, {"time": 8078, "text": "Or if you look at what Mao did, the number of people that were killed in absolute numbers were much higher under Mao than they were under Stalin."}, {"time": 8087, "text": "So it's super hard to say."}, {"time": 8089, "text": "The other thing is that you look at Genghis Khan and so on, how many people he killed."}, {"time": 8096, "text": "When you see there are a number of things that happen in human history that actually really put a substantial dent in the existing population, or Napoleon."}, {"time": 8105, "text": "And it's very difficult to eventually measure it because what's happening is basically evolution on a human scale where one monkey figures out a way to become viral and is using this viral technology to change the patterns of society at the very, very large scale."}, {"time": 8126, "text": "And what we find so abhorrent about these changes is the complexity that is being destroyed by this."}, {"time": 8132, "text": "That's basically like a big fire that burns out a lot of the existing culture and structure that existed before."}, {"time": 8138, "text": "Yeah, and it all just starts with one monkey."}, {"time": 8142, "text": "One charismatic ape."}, {"time": 8144, "text": "And there's a bunch of them throughout history."}, {"time": 8146, "text": "Yeah, but it's in a given environment."}, {"time": 8147, "text": "It's basically similar to wildfires in California, right?"}, {"time": 8151, "text": "The temperature is rising."}, {"time": 8153, "text": "There is less rain falling."}, {"time": 8155, "text": "And then suddenly a single spark can have an effect that in other times would be contained."}, {"time": 8160, "text": "Okay, speaking of which, I love how we went to Hitler and Stalin from 20, 30 minutes ago, GPT3 generating, doing programs that this is."}, {"time": 8173, "text": "The argument was about morality of AI versus human."}, {"time": 8183, "text": "And specifically in the context of writing programs, specifically in the context of programs that can be destructive."}, {"time": 8189, "text": "So running nuclear power plants or autonomous weapons systems, for example."}, {"time": 8195, "text": "And I think your inclination was to say that it's not so obvious that AI would be less moral than humans or less effective at making a world that would make humans happy."}, {"time": 8208, "text": "So I'm not talking about self directed systems that are making their own goals at a global scale."}, {"time": 8217, "text": "If you just talk about the deployment of technological systems that are able to see order and patterns and use this as control models to act on the goals that we give them, then if we have the correct incentives to set the correct incentives for these systems, I'm quite optimistic."}, {"time": 8236, "text": "So humans versus AI, let me give you an example."}, {"time": 8240, "text": "Autonomous weapon system."}, {"time": 8243, "text": "Let's say there's a city somewhere in the Middle East that has a number of terrorists."}, {"time": 8250, "text": "And the question is, what's currently done with drone technologies, you have information about the location of a particular terrorist and you have a targeted attack, you have a bombing of that particular building."}, {"time": 8263, "text": "And that's all directed by humans at the high level strategy and also at the deployment of individual bombs and missiles like the actual, everything is done by human except the final targeting."}, {"time": 8276, "text": "And it's like spot, similar thing, like control the flight."}, {"time": 8281, "text": "Okay, what if you give AI control and saying, write a program that says, here's the best information I have available about the location of these five terrorists, here's the city, make sure all the bombing you do is constrained to the city, make sure it's precision based, but you take care of it."}, {"time": 8302, "text": "So you do one level of abstraction out and saying, take care of the terrorists in the city."}, {"time": 8309, "text": "Which are you more comfortable with, the humans or the JavaScript GPT3 generated code that's doing the deployment?"}, {"time": 8318, "text": "I mean, this is the kind of question I'm asking, is the kind of bugs that we see in human nature, are they better or worse than the kind of bugs we see in AI?"}, {"time": 8331, "text": "There are different bugs."}, {"time": 8361, "text": "And this is something that already happens with Excel."}, {"time": 8364, "text": "You don't need to have an AI system to do this."}, {"time": 8367, "text": "You have an automated process in place where humans decide using automated criteria whom to kill when and whom to target when, which already happens."}, {"time": 8378, "text": "And you have no way to get off the kill list once that happens, once you have been targeted according to some automatic criterion by people in a bureaucracy, that is the issue."}, {"time": 8388, "text": "The issue is not the AI, it's the automation."}, {"time": 8392, "text": "So there's something about, right, it's automation, but there's something about the, there's a certain level of abstraction where you give control to AI to do the automation."}, {"time": 8404, "text": "There's a scale that can be achieved that it feels like the scale of bug and scale mistake and scale of destruction that can be achieved of the kind that humans cannot achieve."}, {"time": 8416, "text": "So AI is much more able to destroy an entire country accidentally versus humans."}, {"time": 8422, "text": "It feels like the more civilians die as they react or suffer as the consequences of your decisions, the more weight there is on the human mind to make that decision."}, {"time": 8436, "text": "And so like, it becomes more and more unlikely to make that decision for humans."}, {"time": 8441, "text": "For AI, it feels like it's harder to encode that kind of weight."}, {"time": 8447, "text": "In a way, the AI that we're currently building is automating statistics, right?"}, {"time": 8451, "text": "Intelligence is the ability to make models so you can act on them, and AI is the tool to make better models."}, {"time": 8458, "text": "So in principle, if you're using AI wisely, you're able to prevent more harm."}, {"time": 8464, "text": "And I think that the main issue is not on the side of the AI, it's on the side of the human command hierarchy that is using technology irresponsibly."}, {"time": 8472, "text": "So the question is how hard is it to encode, to properly encode the right incentives into the AI?"}, {"time": 8479, "text": "So for instance, there's this idea of what happens if we let our airplanes being flown with AI systems and the neural network is a black box and so on."}, {"time": 8488, "text": "And it turns out our neural networks are actually not black boxes anymore."}, {"time": 8492, "text": "There are function approximators using linear algebra, and there are performing things that we can understand."}, {"time": 8500, "text": "But we can also, instead of letting the neural network fly the airplane, use the neural network to generate a provably correct program."}, {"time": 8507, "text": "There's a degree of accuracy of the proof that a human could not achieve."}, {"time": 8511, "text": "And so we can use our AI by combining different technologies to build systems that are much more reliable than the systems that a human being could create."}, {"time": 8520, "text": "And so in this sense, I would say that if you use an early stage of technology to save labor and don't employ competent people, but just to hack something together because you can, that is very dangerous."}, {"time": 8535, "text": "And if people are acting under these incentives that they get away with delivering shoddy work more cheaply using AI with less human oversight than before, that's very dangerous."}, {"time": 8545, "text": "The thing is though, AI is still going to be unreliable, perhaps less so than humans, but it'll be unreliable in novel ways."}, {"time": 8553, "text": "And... Yeah, but this is an empirical question."}, {"time": 8557, "text": "And it's something that we can figure out and work with."}, {"time": 8559, "text": "So the issue is, do we trust the systems, the social systems that we have in place and the social systems that we can build and maintain that they're able to use AI responsibly?"}, {"time": 8570, "text": "If they can, then AI is good news."}, {"time": 8572, "text": "If they cannot, then it's going to make the existing problems worse."}, {"time": 8577, "text": "Well, and also who creates the AI, who controls it, who makes money from it because it's ultimately humans."}, {"time": 8583, "text": "And then you start talking about how much you trust the humans."}, {"time": 8586, "text": "So the question is, what does who mean?"}, {"time": 8588, "text": "I don't think that we have identity per se."}, {"time": 8591, "text": "I think that the story of a human being is somewhat random."}, {"time": 8595, "text": "What happens is more or less that everybody is acting on their local incentives, what they perceive to be their incentives."}, {"time": 8601, "text": "And the question is, what are the incentives that the one that is pressing the button is operating under?"}, {"time": 8610, "text": "It's nice for those incentives to be transparent."}, {"time": 8612, "text": "So, for example, I'll give you an example."}, {"time": 8616, "text": "There seems to be a significant distrust of a tech, like entrepreneurs in the tech space or people that run, for example, social media companies like Mark Zuckerberg."}, {"time": 8629, "text": "There's not a complete transparency of incentives under which that particular human being operates."}, {"time": 8638, "text": "We can listen to the words he says or what the marketing team says for a company, but we don't know."}, {"time": 8644, "text": "And that becomes a problem when the algorithms and the systems created by him and other people in that company start having more and more impact on society."}, {"time": 8657, "text": "And that it starts, if the incentives were somehow the definition and the explainability of the incentives was decentralized such that nobody can manipulate it, no propaganda type manipulation of like how these systems actually operate could be done, then yes, I think AI could achieve much fairer, much more effective sort of like solutions to difficult ethical problems."}, {"time": 8693, "text": "But when there's like humans in the loop, manipulating the dissemination, the communication of how the system actually works, that feels like you can run into a lot of trouble."}, {"time": 8705, "text": "And that's why there's currently a lot of distrust for people at the heads of companies that have increasingly powerful AI systems."}, {"time": 8713, "text": "I suspect what happened traditionally in the US was that since our decision making is much more decentralized than in an authoritarian state, people are making decisions autonomously at many, many levels in a society."}, {"time": 8726, "text": "What happened that was we created coherence and cohesion in society by controlling what people thought and what information they had."}, {"time": 8735, "text": "The media synchronized public opinion and social media have disrupted this."}, {"time": 8740, "text": "It's not, I think so much Russian influence or something, it's everybody's influence."}, {"time": 8745, "text": "It's that a random person can come up with a conspiracy theory and disrupt what people think."}, {"time": 8752, "text": "And if that conspiracy theory is more compelling or more attractive than the standardized public conspiracy theory that we give people as a default, then it might get more traction, right?"}, {"time": 8763, "text": "You suddenly have the situation that a single individual somewhere on a farm in Texas has more listeners than CNN."}, {"time": 8771, "text": "Which particular farmer are you referring to in Texas?"}, {"time": 8777, "text": "Probably no."}, {"time": 8779, "text": "Yes, I had dinner with him a couple of times, okay."}, {"time": 8781, "text": "Right, it's an interesting situation because you cannot get to be an anchor in CNN if you don't go through a complicated gatekeeping process."}, {"time": 8790, "text": "And suddenly you have random people without that gatekeeping process, just optimizing for attention."}, {"time": 8796, "text": "Not necessarily with a lot of responsibility for the longterm effects of projecting these theories into the public."}, {"time": 8803, "text": "And now there is a push of making social media more like traditional media, which means that the opinion that is being projected in social media is more limited to an acceptable range."}, {"time": 8814, "text": "With the goal of getting society into safe waters and increase the stability and cohesion of society again, which I think is a laudable goal."}, {"time": 8823, "text": "But of course it also is an opportunity to seize the means of indoctrination."}, {"time": 8828, "text": "And the incentives that people are under when they do this are in such a way that the AI ethics that we would need becomes very often something like AI politics, which is basically partisan and ideological."}, {"time": 8843, "text": "And this means that whatever one side says, another side is going to be disagreeing with, right?"}, {"time": 8848, "text": "In the same way as when you turn masks or the vaccine into a political issue, if you say that it is politically virtuous to get vaccinated, it will mean that the people that don't like you will not want to get vaccinated, right?"}, {"time": 8861, "text": "And as soon as you have this partisan discourse, it's going to be very hard to make the right decisions because the incentives get to be the wrong ones."}, {"time": 8868, "text": "AI ethics needs to be super boring."}, {"time": 8871, "text": "It needs to be done by people who do statistics all the time and have extremely boring, long winded discussions that most people cannot follow because they are too complicated, but that are dead serious."}, {"time": 8882, "text": "These people need to be able to be better at statistics than the leading machine learning researchers."}, {"time": 8887, "text": "And at the moment, the AI ethics debate is the one where you don't have any barrier to entry, right?"}, {"time": 8894, "text": "Everybody who has a strong opinion and is able to signal that opinion in the right way can enter it."}, {"time": 8899, "text": "And to me, that is a very frustrating thing because the field is so crucially important to our future."}, {"time": 8907, "text": "It's so crucially important, but the only qualification you currently need is to be outraged by the injustice in the world."}, {"time": 8914, "text": "It's more complicated, right?"}, {"time": 8916, "text": "Everybody seems to be outraged."}, {"time": 8917, "text": "But let's just say that the incentives are not always the right ones."}, {"time": 8922, "text": "So basically, I suspect that a lot of people that enter this debate don't have a vision for what society should be looking like in a way that is nonviolent, where we preserve liberal democracy, where we make sure that we all get along and we are around in a few hundred years from now, preferably with a comfortable technological civilization around us."}, {"time": 8944, "text": "I generally have a very foggy view of that world, but I tend to try to follow, and I think society should in some degree follow the gradient of love, increasing the amount of love in the world."}, {"time": 8958, "text": "And whenever I see different policies or algorithms or ideas that are not doing so, obviously, that's the ones that kind of resist."}, {"time": 8967, "text": "So the thing that terrifies me about this notion is I think that German fascism was driven by love."}, {"time": 8975, "text": "It was just a very selective love."}, {"time": 8977, "text": "It was a love that basically... Now you're just manipulating."}, {"time": 8980, "text": "I mean, that's, you have to be very careful."}, {"time": 8985, "text": "You're talking to the wrong person in this way about love."}, {"time": 8990, "text": "So let's talk about what love is."}, {"time": 8992, "text": "And I think that love is the discovery of shared purpose."}, {"time": 8995, "text": "It's the recognition of the sacred in the other."}, {"time": 8999, "text": "And this enables non transactional interactions."}, {"time": 9002, "text": "But the size of the other that you include needs to be maximized."}, {"time": 9009, "text": "So it's basically appreciation, like deep appreciation of the world around you fully, including the people that are very different than you, people that disagree with you completely, including people, including living creatures outside of just people, including ideas."}, {"time": 9033, "text": "And it's like appreciation of the full mess of it."}, {"time": 9036, "text": "And also it has to do with like empathy, which is coupled with a lack of confidence and certainty of your own rightness."}, {"time": 9047, "text": "It's like a radical open mindedness to the way forward."}, {"time": 9051, "text": "I agree with every part of what you said."}, {"time": 9053, "text": "And now if you scale it up, what you recognize is that Lafist is in some sense, the service to next level agency, to the highest level agency that you can recognize."}, {"time": 9064, "text": "It could be for instance, life on earth or beyond that, where you could say intelligent complexity in the universe that you try to maximize in a certain way."}, {"time": 9074, "text": "But when you think it's true, it basically means a certain aesthetic."}, {"time": 9078, "text": "And there is not one possible aesthetic, there are many possible aesthetics."}, {"time": 9082, "text": "And once you project an aesthetic into the future, you can see that there are some which defect from it, which are in conflict with it, that are corrupt, that are evil."}, {"time": 9093, "text": "You and me would probably agree that Hitler was evil because the aesthetic of the world that he wanted is in conflict with the aesthetic of the world that you and me have in mind."}, {"time": 9104, "text": "And so they think that he destroyed, we want to keep them in the world."}, {"time": 9110, "text": "There's a kind of, there's kind of ways to deal, I mean, Hitler is an easier case, but perhaps he wasn't so easy in the 30s, right?"}, {"time": 9119, "text": "To understand who is Hitler and who is not."}, {"time": 9122, "text": "No, it was just there was no consensus that the aesthetics that he had in mind were unacceptable."}, {"time": 9127, "text": "Yeah, I mean, it's difficult, love is complicated because you can't just be so open minded that you let evil walk into the door, but you can't be so self assured that you can always identify evil perfectly because that's what leads to Nazi Germany."}, {"time": 9152, "text": "Having a certainty of what is and wasn't evil, like always drawing lines of good versus evil."}, {"time": 9158, "text": "There seems to be, there has to be a dance between like hard stances extending up against what is wrong."}, {"time": 9171, "text": "And at the same time, empathy and open mindedness of towards not knowing what is right and wrong and like a dance between those."}, {"time": 9181, "text": "I found that when I watched the Miyazaki movies that there is nobody who captures my spirituality as well as he does."}, {"time": 9187, "text": "It's very interesting and just vicious, right?"}, {"time": 9190, "text": "There is something going on in his movies that is very interesting."}, {"time": 9194, "text": "So for instance, Mononoke is discussing not only an answer to Disney's simplistic notion of Mowgli, the jungle boy was raised by wolves."}, {"time": 9204, "text": "And as soon as he sees people realizes that he's one of them and the way in which the moral life and nature is simplified and romanticized and turned into kitsch."}, {"time": 9216, "text": "It's disgusting in the Disney movie."}, {"time": 9217, "text": "And he answers to this, you see, he's replaced by Mononoke, this wolf girl who was raised by wolves and was fierce and dangerous and who cannot be socialized because she cannot be tamed."}, {"time": 9228, "text": "You cannot be part of human society."}, {"time": 9230, "text": "And you see human society, it's something that is very, very complicated."}, {"time": 9233, "text": "You see people extracting resources and destroying nature."}, {"time": 9237, "text": "But the purpose is not to be evil, but to be able to have a life that is free from, for instance, oppression and violence and to curb death and disease."}, {"time": 9250, "text": "And you basically see this conflict which cannot be resolved in a certain way."}, {"time": 9255, "text": "You see this moment when nature is turned into a garden and it loses most of what it actually is and humans no longer submitting to life and death and nature and to these questions, there is no easy answer."}, {"time": 9266, "text": "So it just turns it into something that is being observed as a journey that happens."}, {"time": 9271, "text": "And that happens with a certain degree of inevitability."}, {"time": 9274, "text": "And the nice thing about all his movies is there's a certain main character and it's the same in all movies."}, {"time": 9281, "text": "It's this little girl that is basically Heidi."}, {"time": 9285, "text": "And I suspect that happened because when he did field work for working on the Heidi movies back then, the Heidi animations, before he did his own movies, he traveled to Switzerland and South Eastern Europe and the Adriatic and so on and got an idea about a certain aesthetic and a certain way of life that informed his future thinking."}, {"time": 9308, "text": "And Heidi has a very interesting relationship to herself and to the world."}, {"time": 9313, "text": "There's nothing that she takes for herself."}, {"time": 9315, "text": "She's in a way fearless because she is committed to a service, to a greater whole."}, {"time": 9320, "text": "Basically, she is completely committed to serving God."}, {"time": 9324, "text": "And it's not an institutionalized God."}, {"time": 9326, "text": "It has nothing to do with the Roman Catholic Church or something like this."}, {"time": 9330, "text": "But in some sense, Heidi is an embodiment of the spirit of European Protestantism."}, {"time": 9335, "text": "It's this idea of a being that is completely perfect and pure."}, {"time": 9340, "text": "And it's not a feminist vision because she is not a girl boss or something like this."}, {"time": 9348, "text": "She is the justification for the men in the audience to protect her, to build a civilization around her that makes her possible."}, {"time": 9356, "text": "So she is not just the sacrifice of Jesus who is innocent and therefore nailed to the cross."}, {"time": 9362, "text": "She is not being sacrificed."}, {"time": 9364, "text": "She is being protected by everybody around her who recognizes that she is sacred."}, {"time": 9368, "text": "And there are enough around her to see that."}, {"time": 9372, "text": "So this is a very interesting perspective."}, {"time": 9374, "text": "There's a certain notion of innocence."}, {"time": 9376, "text": "And this notion of innocence is not universal."}, {"time": 9378, "text": "It's not in all cultures."}, {"time": 9380, "text": "Hitler wasn't innocent."}, {"time": 9381, "text": "His idea of Germany was not that there is an innocence that is being protected."}, {"time": 9386, "text": "There was a predator that was going to triumph."}, {"time": 9389, "text": "And it's also something that is not at the core of every religion."}, {"time": 9392, "text": "There are many religions which don't care about innocence."}, {"time": 9394, "text": "They might care about increasing the status of something."}, {"time": 9401, "text": "And that's a very interesting notion that is quite unique and not claiming it's the optimal one."}, {"time": 9407, "text": "It's just a particular kind of aesthetic which I think makes Miyazaki into the most relevant Protestant philosopher today."}, {"time": 9415, "text": "And you're saying in terms of all the ways that a society can operate perhaps the preservation of innocence might be one of the best."}, {"time": 9427, "text": "No, it's just my aesthetic."}, {"time": 9429, "text": "So it's a particular way in which I feel that I relate to the world that is natural to my own socialization."}, {"time": 9436, "text": "And maybe it's not an accident that I have cultural roots in Europe in a particular world."}, {"time": 9443, "text": "And so maybe it's a natural convergence point and it's not something that you will find in all other times in history."}, {"time": 9450, "text": "So I'd like to ask you about Solzhenitsyn and our individual role as ants in this very large society."}, {"time": 9459, "text": "So he says that some version of the line between good and evil runs to the heart of every man."}, {"time": 9464, "text": "Do you think all of us are capable of good and evil?"}, {"time": 9467, "text": "Like what's our role in this play in this game we're all playing?"}, {"time": 9475, "text": "Is all of us capable to play any role?"}, {"time": 9479, "text": "Like, is there an ultimate responsibility to you mentioned maintaining innocence or whatever the highest ideal for a society you want are all of us capable of living up to that?"}, {"time": 9491, "text": "And that's our responsibility or is there significant limitations to what we're able to do in terms of good and evil?"}, {"time": 9501, "text": "So there is a certain way if you are not terrible, if you are committed to some kind of civilizational agency, a next level agent that you are serving, some kind of transcendent principle."}, {"time": 9514, "text": "In the eyes of that transcendental principle, you are able to discern good from evil."}, {"time": 9518, "text": "Otherwise you cannot, otherwise you have just individual aesthetics."}, {"time": 9521, "text": "The cat that is torturing a mouse is not evil because the cat does not envision or no part of the world of the cat is envisioning a world where there is no violence and nobody is suffering."}, {"time": 9533, "text": "If you have an aesthetic where you want to protect innocence, then torturing somebody needlessly is evil, but only then."}, {"time": 9542, "text": "No, but within, I guess the question is within the aesthetic, like within your sense of what is good and evil, are we still, it seems like we're still able to commit evil."}, {"time": 9557, "text": "Yes, so basically if you are committing to this next level agent, you are not necessarily are this next level agent, right?"}, {"time": 9563, "text": "You are a part of it."}, {"time": 9564, "text": "You have a relationship to it, like the cell does to its organism, its hyperorganism."}, {"time": 9569, "text": "And it only exists to the degree that it's being implemented by you and others."}, {"time": 9574, "text": "And that means that you're not completely fully serving it."}, {"time": 9578, "text": "You have freedom in what you decide, whether you are acting on your impulses and local incentives and your farewell impulses, so to speak, or whether you're committing to it."}, {"time": 9587, "text": "And what you perceive then is a tension between what you would be doing with respect to the thing that you recognize as the sacred, if you do, and what you're actually doing."}, {"time": 9598, "text": "And this is the line between good and evil, right where you see, oh, I'm here acting on my local incentives or impulses, and here I'm acting on what I consider to be sacred."}, {"time": 9608, "text": "And there's a tension between those."}, {"time": 9609, "text": "And this is the line between good and evil that might run through your heart."}, {"time": 9614, "text": "And if you don't have that, if you don't have this relationship to a transcendental agent, you could call this relationship to the next level agent soul, right?"}, {"time": 9621, "text": "It's not a thing."}, {"time": 9622, "text": "It's not an immortal thing that is intrinsically valuable."}, {"time": 9625, "text": "It's a certain kind of relationship that you project to understand what's happening."}, {"time": 9629, "text": "Somebody is serving this transcendental sacredness or they're not."}, {"time": 9633, "text": "If you don't have a soul, you cannot be evil."}, {"time": 9635, "text": "You're just a complex natural phenomenon."}, {"time": 9639, "text": "So if you look at life, like starting today or starting tomorrow, when we leave here today, there's a bunch of trajectories that you can take through life, maybe countless."}, {"time": 9653, "text": "Do you think some of these trajectories, in your own conception of yourself, some of those trajectories are the ideal life, a life that if you were to be the hero of your life story, you would want to be?"}, {"time": 9670, "text": "Like, is there some Josh or Bhakti you're striving to be?"}, {"time": 9674, "text": "Like, this is the question I ask myself as an individual trying to make a better world in the best way that I could conceive of."}, {"time": 9682, "text": "What is my responsibility there?"}, {"time": 9684, "text": "And how much am I responsible for the failure to do so?"}, {"time": 9688, "text": "Because I'm lazy and incompetent too often."}, {"time": 9693, "text": "In my own perception."}, {"time": 9695, "text": "In my own worldview, I'm not very important."}, {"time": 9698, "text": "So it's, I don't have place for me as a hero in my own world."}, {"time": 9703, "text": "I'm trying to do the best that I can, which is often not very good."}, {"time": 9708, "text": "And so it's not important for me to have status or to be seen in a particular way."}, {"time": 9715, "text": "It's helpful if others can see me or a few people can see me that can be my friends."}, {"time": 9719, "text": "No, sorry, I want to clarify, the hero I didn't mean status or perception or like some kind of marketing thing, but more in private, in the quiet of your own mind."}, {"time": 9734, "text": "Is there the kind of man you want to be and would consider it a failure if you don't become that?"}, {"time": 9740, "text": "That's what I meant by hero."}, {"time": 9741, "text": "Yeah, not really."}, {"time": 9743, "text": "I don't perceive myself as having such an identity."}, {"time": 9746, "text": "And it's also sometimes frustrating, but it's basically a lack of having this notion of father that I need to be emulating."}, {"time": 9764, "text": "I mean, it's the leaf floating down the river."}, {"time": 9768, "text": "I worry that..."}, {"time": 9770, "text": "Sometimes it's more like being the river."}, {"time": 9779, "text": "I'm just a fat frog sitting on a leaf on a dirty, muddy lake."}, {"time": 9786, "text": "I wish I was waiting for a princess to kiss me."}, {"time": 9793, "text": "Or the other way, I forgot which way it goes."}, {"time": 9795, "text": "Somebody kisses somebody."}, {"time": 9797, "text": "I can ask you, I don't know if you know who Michael Malice is, but in terms of constructing since systems of incentives, it's interesting to ask."}, {"time": 9809, "text": "I don't think I've talked to you about this before."}, {"time": 9813, "text": "Malice espouses anarchism."}, {"time": 9815, "text": "So he sees all government as fundamentally getting in the way or even being destructive to collaborations between human beings thriving."}, {"time": 9830, "text": "What's the role of government in a society that thrives?"}, {"time": 9836, "text": "Is anarchism at all compelling to you as a system?"}, {"time": 9840, "text": "So like not just small government, but no government at all."}, {"time": 9845, "text": "Yeah, I don't see how this would work."}, {"time": 9849, "text": "The government is an agent that imposes an offset on your reward function, on your payout metrics."}, {"time": 9855, "text": "So your behavior becomes compatible with the common good."}, {"time": 9860, "text": "So the argument there is that you can have collectives like governing organizations, but not government, like where you're born in a particular set of land and therefore you must follow this rule or else."}, {"time": 9878, "text": "You're forced by what they call violence because there's an implied violence here."}, {"time": 9884, "text": "So the key aspect of government is it protects you from the rest of the world with an army and with police."}, {"time": 9896, "text": "So it has a monopoly on violence."}, {"time": 9900, "text": "It's the only one that's able to do violence."}, {"time": 9902, "text": "So there are many forms of government, not all governments do that."}, {"time": 9905, "text": "But we find that in successful countries, the government has a monopoly on violence."}, {"time": 9912, "text": "And that means that you cannot get ahead by starting your own army because the government will come down on you and destroy you if you try to do that."}, {"time": 9920, "text": "And in countries where you can build your own army and get away with it, some people will do it."}, {"time": 9925, "text": "And these countries is what we call failed countries in a way."}, {"time": 9930, "text": "And if you don't want to have violence, the point is not to appeal to the moral intentions of people because some people will use strategies if they get ahead with them that feel a particular kind of ecological niche."}, {"time": 9942, "text": "So you need to destroy that ecological niche."}, {"time": 9945, "text": "And if effective government has a monopoly on violence, it can create a world where nobody is able to use violence and get ahead."}, {"time": 9954, "text": "So you want to use that monopoly on violence, not to exert violence, but to make violence impossible, to raise the cost of violence."}, {"time": 9962, "text": "So people need to get ahead with nonviolent means."}, {"time": 9966, "text": "So the idea is that you might be able to achieve that in an anarchist state with companies."}, {"time": 9972, "text": "So with the forces of capitalism is create security companies where the one that's most ethically sound rises to the top."}, {"time": 9981, "text": "Basically, it would be a much better representative of the people because there is a less sort of stickiness to the big military force sticking around even though it's long overlived, outlived."}, {"time": 9996, "text": "So you have groups of militants that are hopefully efficiently organized because otherwise they're going to lose against the other groups of militants and they are coordinating themselves with the rest of society until they are having a monopoly on violence."}, {"time": 10011, "text": "How is that different from a government?"}, {"time": 10013, "text": "So it's basically converging to the same thing."}, {"time": 10016, "text": "So I was trying to argue with Malice, I feel like it always converges towards government at scale, but I think the idea is you can have a lot of collectives that are, you basically never let anything scale too big."}, {"time": 10031, "text": "So one of the problems with governments is it gets too big in terms of like the size of the group over which it has control."}, {"time": 10043, "text": "My sense is that would happen anyway."}, {"time": 10047, "text": "So a successful company like Amazon or Facebook, I mean, it starts forming a monopoly over the entire populations, not over just the hundreds of millions, but billions of people."}, {"time": 10059, "text": "So I don't know, but there is something about the abuses of power the government can have when it has a monopoly on violence, right?"}, {"time": 10069, "text": "And so that's a tension there, but..."}, {"time": 10073, "text": "So the question is how can you set the incentives for government correctly?"}, {"time": 10076, "text": "And this mostly applies at the highest levels of government and because we haven't found a way to set them correctly, we made the highest levels of government relatively weak."}, {"time": 10086, "text": "And this is, I think, part of the reason why we had difficulty to coordinate the pandemic response and China didn't have that much difficulty."}, {"time": 10094, "text": "And there is, of course, a much higher risk of the abuse of power that exists in China because the power is largely unchecked."}, {"time": 10102, "text": "And that's basically what happens in the next generation, for instance."}, {"time": 10106, "text": "Imagine that we would agree that the current government of China is largely correct and benevolent, and maybe we don't agree on this, but if we did, how can we make sure that this stays like this?"}, {"time": 10117, "text": "And if you don't have checks and balances, division of power, it's hard to achieve."}, {"time": 10122, "text": "You don't have a solution for that problem."}, {"time": 10125, "text": "But the abolishment of government basically would remove the control structure."}, {"time": 10129, "text": "From a cybernetic perspective, there is an optimal point in the system that the regulation should be happening, right?"}, {"time": 10136, "text": "That you can measure the current incentives and the regulator would be properly incentivized to make the right decisions and change the payout metrics of everything below it in such a way that the local prisoners dilemmas get resolved, right?"}, {"time": 10149, "text": "You cannot resolve the prisoners dilemma without some kind of eternal control that emulates an infinite game in a way."}, {"time": 10159, "text": "Yeah, I mean, there's a sense in which it seems like the reason government, the parts of government that don't work well currently is because there's not good mechanisms through which to interact, for the citizenry to interact with government is basically it hasn't caught up in terms of technology."}, {"time": 10181, "text": "And I think once you integrate some of the digital revolution of being able to have a lot of access to data, be able to vote on different ideas at a local level, at all levels, at the optimal level like you're saying that can resolve the prisoner dilemmas and to integrate AI to help you automate things that don't require the human ingenuity."}, {"time": 10207, "text": "I feel like that's where government could operate that well and can also break apart the inefficient bureaucracies if needed."}, {"time": 10215, "text": "There'll be a strong incentive to be efficient and successful."}, {"time": 10220, "text": "So out human history, we see an evolution and evolutionary competition of modes of government and of individual governments is in these modes."}, {"time": 10228, "text": "And every nation state in some sense is some kind of organism that has found different solutions for the problem of government."}, {"time": 10234, "text": "And you could look at all these different models and the different scales at which it exists as empirical attempts to validate the idea of how to build a better government."}, {"time": 10245, "text": "And I suspect that the idea of anarchism similar to the idea of communism is the result of being disenchanted with the ugliness of the real existing solutions and the attempt to get to an utopia."}, {"time": 10260, "text": "And I suspect that communism originally was not a utopia."}, {"time": 10264, "text": "I think that in the same way as original Christianity, it had a particular kind of vision."}, {"time": 10270, "text": "And this vision is a society, a mode of organization within the society in which humans can coexist at scale without coercion."}, {"time": 10280, "text": "In the same way as we do in a healthy family, right?"}, {"time": 10283, "text": "In a good family, you don't terrorize each other into compliance, but you understand what everybody needs and what everybody is able to contribute and what the intended future of the whole thing is."}, {"time": 10295, "text": "And everybody coordinates their behavior in the right way and informs each other about how to do this."}, {"time": 10300, "text": "And all the interactions that happen are instrumental to making that happen, right?"}, {"time": 10305, "text": "Could this happen at scale?"}, {"time": 10307, "text": "And I think this is the idea of communism."}, {"time": 10309, "text": "Communism is opposed to the idea that we need economic terror or other forms of terror to make that happen."}, {"time": 10315, "text": "But in practice, what happened is that the proto communist countries, the real existing socialism, replaced a part of the economic terror with moral terror, right?"}, {"time": 10325, "text": "So we were told to do the right thing for moral reasons."}, {"time": 10327, "text": "And of course it didn't really work and the economy eventually collapsed."}, {"time": 10331, "text": "And the moral terror had actual real cost, right?"}, {"time": 10334, "text": "People were in prison because they were morally noncompliant."}, {"time": 10337, "text": "And the other thing is that the idea of communism became a utopia."}, {"time": 10344, "text": "So it basically was projected into the afterlife."}, {"time": 10346, "text": "We were told in my childhood that communism was a hypothetical society to which we were in a permanent revolution that justified everything that was presently wrong with society morally."}, {"time": 10357, "text": "But it was something that our grandchildren probably would not ever see because it was too ideal and too far in the future to make it happen right now."}, {"time": 10364, "text": "And people were just not there yet morally."}, {"time": 10367, "text": "And the same thing happened with Christianity, right?"}, {"time": 10370, "text": "This notion of heaven was mythologized and projected into an afterlife."}, {"time": 10374, "text": "And I think this was just the idea of God's kingdom of this world in which we instantiate the next level transcendental agent in the perfect form."}, {"time": 10381, "text": "So everything goes smoothly and without violence and without conflict and without this human messiness on this economic messiness and the terror and coercion that existed in the present societies."}, {"time": 10393, "text": "And the idea of that the humans can exist at some point exist at scale in a harmonious way and noncoercively is untested, right?"}, {"time": 10401, "text": "A lot of people tested it but didn't get it to work so far."}, {"time": 10405, "text": "And the utopia is a world in where you get all the good things without any of the bad things."}, {"time": 10410, "text": "And you are, I think very susceptible to believe in utopias when you are very young and don't understand that everything has to happen in causal patterns, that there's always feedback loops that ultimately are closed."}, {"time": 10422, "text": "There's nothing that just happens because it's good or bad."}, {"time": 10425, "text": "Good or bad don't exist in isolation."}, {"time": 10427, "text": "They only exist with respect to larger systems."}, {"time": 10430, "text": "So can you intuit why utopias fail as systems?"}, {"time": 10437, "text": "So like having a utopia that's out there beyond the horizon is it because then, it's not only because it's impossible to achieve utopias but it's because what certain humans, certain small number of humans start to sort of greedily attain power and money and control and influence as they become, as they see the power in using this idea of a utopia for propaganda."}, {"time": 10475, "text": "It's a bit like saying, why is my garden not perfect?"}, {"time": 10477, "text": "It's because some evil weeds are overgrowing it and they always do, right?"}, {"time": 10481, "text": "But this is not how it works."}, {"time": 10483, "text": "A good garden is a system that is in balance and requires minimal interactions by the gardener."}, {"time": 10488, "text": "And so you need to create a system that is designed to self stabilize."}, {"time": 10494, "text": "And the design of social systems requires not just the implementation of the desired functionality, but the next level design, also in biological systems."}, {"time": 10501, "text": "You need to create a system that wants to converge to the intended function."}, {"time": 10506, "text": "And so instead of just creating an institution like the FDA that is performing a particular kind of role in society, you need to make sure that the FDA is actually driven by a system that wants to do this optimally, that is incentivized to do it optimally and then makes the performance that is actually enacted in every generation instrumental to that thing, that actual goal, right?"}, {"time": 10527, "text": "And that is much harder to design and to achieve."}, {"time": 10530, "text": "See if the design a system where, and listen communism also was quote unquote incentivized to be a feedback loop system that achieves that utopia."}, {"time": 10543, "text": "It's just, it wasn't working given human nature."}, {"time": 10545, "text": "The incentives were not correct given human nature."}, {"time": 10547, "text": "How do you incentivize people when they are getting coal off the ground to work as hard as possible?"}, {"time": 10553, "text": "Because it's a terrible job and it's very bad for your health."}, {"time": 10557, "text": "And right, how do you do this?"}, {"time": 10559, "text": "And you can give them prices and medals and status to some degree, right?"}, {"time": 10564, "text": "There's only so much status to give for that."}, {"time": 10566, "text": "And most people will not fall for this, right?"}, {"time": 10569, "text": "Or you can pay them and you probably have to pay them in an asymmetric way because if you pay everybody the same and you nationalize the coal mines, eventually people will figure out that they can game the system."}, {"time": 10581, "text": "Yes, so you're describing capitalism."}, {"time": 10585, "text": "So capitalism is the present solution to the system."}, {"time": 10588, "text": "And what we also noticed that I think that Marx was correct in saying that capitalism is prone to crisis, that capitalism is a system that in its dynamics is not convergent, but divergent."}, {"time": 10600, "text": "It's not a stable system."}, {"time": 10602, "text": "And that eventually it produces an enormous potential for productivity, but it also is systematically misallocating resources."}, {"time": 10612, "text": "So a lot of people cannot participate in the production and consumption anymore, right?"}, {"time": 10617, "text": "And this is what we observed."}, {"time": 10618, "text": "We observed that the middle class in the US is tiny."}, {"time": 10621, "text": "It's a lot of people think that they're middle class, but if you are still flying economy, you're not middle class, right?"}, {"time": 10631, "text": "Every class is a magnitude smaller than the previous class."}, {"time": 10634, "text": "And I think about classes is really like airline class."}, {"time": 10643, "text": "I like class."}, {"time": 10645, "text": "A lot of people are economy class, business class, and very few are first class and some are budget."}, {"time": 10650, "text": "I mean, some, I understand."}, {"time": 10652, "text": "I think there's, yeah, maybe some people, probably I would push back against that definition of the middle class."}, {"time": 10659, "text": "It does feel like the middle class is pretty large, but yes, there's a discrepancy in terms of wealth."}, {"time": 10665, "text": "So if you think about in terms of the productivity that our society could have, there is no reason for anybody to fly economy, right?"}, {"time": 10673, "text": "We would be able to let everybody travel in style."}, {"time": 10677, "text": "Well, but also some people like to be frugal even when they're billionaires, okay?"}, {"time": 10681, "text": "So like that, let's take that into account."}, {"time": 10684, "text": "I mean, we probably don't need to be a traveling lavish, but you also don't need to be tortured, right?"}, {"time": 10689, "text": "There is a difference between frugal and subjecting yourself to torture."}, {"time": 10694, "text": "Listen, I love economy."}, {"time": 10695, "text": "I don't understand why you're comparing a fly economy to torture."}, {"time": 10699, "text": "I don't, although the fight here, there's two crying babies next to me."}, {"time": 10704, "text": "So that, but that has nothing to do with economy."}, {"time": 10706, "text": "It has to do with crying babies."}, {"time": 10708, "text": "They're very cute though."}, {"time": 10709, "text": "So they kind of."}, {"time": 10710, "text": "Yeah, I have two kids and sometimes I have to go back to visit the grandparents."}, {"time": 10715, "text": "And that means going from the west coast to Germany and that's a long flight."}, {"time": 10722, "text": "Is it true that, so when you're a father, you grow immune to the crying and all that kind of stuff, like the, because like me just not having kids, it can be other people's kids can be quite annoying when they're crying and screaming and all that kind of stuff."}, {"time": 10737, "text": "When you have children and you are wired up in the default natural way, you're lucky in this regard, you fall in love with them."}, {"time": 10744, "text": "And this falling in love with them means that you basically start to see the world through their eyes and you understand that in a given situation, they cannot do anything but being expressing despair."}, {"time": 10757, "text": "And so it becomes more differentiated."}, {"time": 10759, "text": "I noticed that for instance, my son is typically acting on a pure experience of what things are like right now and he has to do this right now."}, {"time": 10770, "text": "And you have this small child that is, when he was a baby and so on, where he was just immediately expressing what he felt."}, {"time": 10777, "text": "And if you cannot regulate this from the outside, there's no point to be upset about it, right?"}, {"time": 10782, "text": "It's like dealing with weather or something like this."}, {"time": 10785, "text": "You all have to get through it and it's not easy for him either."}, {"time": 10788, "text": "But if you also have a daughter, maybe she is planning for that."}, {"time": 10793, "text": "Maybe she understands that she's sitting in the car behind you and she's screaming at the top of her lungs and you're almost doing an accident and you really don't know what to do."}, {"time": 10803, "text": "What should I have done to make you stop screaming?"}, {"time": 10806, "text": "You could have given me candy."}, {"time": 10810, "text": "I think that's like a cat versus dog discussion."}, {"time": 10813, "text": "Cause you said like a fundamental aspect of that is love that makes it all worth it."}, {"time": 10821, "text": "What, in this monkey riding an elephant in a dream world, what role does love play in the human condition?"}, {"time": 10831, "text": "I think that love is the facilitator of non transactional interaction."}, {"time": 10837, "text": "And you are observing your own purposes."}, {"time": 10840, "text": "Some of these purposes go beyond your ego."}, {"time": 10842, "text": "They go beyond the particular organism that you are and your local interests."}, {"time": 10846, "text": "That's what you mean by non transactional."}, {"time": 10848, "text": "Yes, so basically when you are acting in a transactional way, it means that you are respecting something in return for you from the one that you're interacting with."}, {"time": 10858, "text": "You are interacting with a random stranger, you buy something from them on eBay, you expect a fair value for the money that you sent them and vice versa."}, {"time": 10865, "text": "Because you don't know that person, you don't have any kind of relationship to them."}, {"time": 10869, "text": "But when you know this person a little bit better and you know the situation that they're in, you understand what they try to achieve in their life and you approve because you realize that they're in some sense serving the same human sacredness as you are."}, {"time": 10882, "text": "And they need to think that you have, maybe you give it to them as a present."}, {"time": 10886, "text": "But, I mean, the feeling itself of joy is a kind of benefit, is a kind of transaction, like..."}, {"time": 10894, "text": "Yes, but the joy is not the point."}, {"time": 10896, "text": "The joy is the signal that you get."}, {"time": 10898, "text": "It's the reinforcement signal that your brain sends to you because you are acting on the incentives of the agent that you're a part of."}, {"time": 10905, "text": "We are meant to be part of something larger."}, {"time": 10908, "text": "This is the way in which we out competed other hominins."}, {"time": 10914, "text": "Take that Neanderthals."}, {"time": 10917, "text": "And also other humans."}, {"time": 10919, "text": "There was a population bottleneck for human society that leads to an extreme lack of genetic diversity among humans."}, {"time": 10927, "text": "If you look at Bushmen in the Kalahari, that basically tribes that are not that far distant to each other have more genetic diversity than exists between Europeans and Chinese."}, {"time": 10939, "text": "And that's because basically the out of Africa population at some point had a bottleneck of just a few thousand individuals."}, {"time": 10947, "text": "And what probably happened is not that at any time the number of people shrank below a few hundred thousand."}, {"time": 10954, "text": "What probably happened is that there was a small group that had a decisive mutation that produced an advantage."}, {"time": 10960, "text": "And this group multiplied and killed everybody else."}, {"time": 10964, "text": "And we are descendants of that group."}, {"time": 10966, "text": "Yeah, I wonder what the peculiar characteristics of that group."}, {"time": 10973, "text": "I mean, we can never know."}, {"time": 10973, "text": "Me too, and a lot of people do."}, {"time": 10975, "text": "We can only just listen to the echoes in ours, like the ripples that are still within us."}, {"time": 10981, "text": "So I suspect what eventually made a big difference was the ability to organize at scale, to program each other."}, {"time": 10989, "text": "With ideas."}, {"time": 10991, "text": "That we became programmable, that we were willing to work in lockstep, that we went above the tribal level, that we no longer were groups of a few hundred individuals and acted on direct reputation systems transactionally, but that we basically evolved an adaptation to become state building."}, {"time": 11011, "text": "To form collectives outside of the direct collectives."}, {"time": 11015, "text": "Yes, and that's basically a part of us became committed to serving something outside of what we know."}, {"time": 11021, "text": "Yeah, then that's kind of what love is."}, {"time": 11024, "text": "And it's terrifying because it meant that we eradicated the others."}, {"time": 11028, "text": "Right, it's a force."}, {"time": 11029, "text": "It's an adaptive force that gets us ahead in evolution, which means we displace something else that doesn't have that."}, {"time": 11036, "text": "Oh, so we had to murder a lot of people that weren't about love."}, {"time": 11040, "text": "So love led to destruction."}, {"time": 11041, "text": "They didn't have the same strong love as we did."}, {"time": 11044, "text": "Right, that's why I mentioned this thing with fascism."}, {"time": 11047, "text": "When you see these speeches, do you want total war?"}, {"time": 11052, "text": "And everybody says, yes, right?"}, {"time": 11054, "text": "This is this big, oh my God, we are part of something that is more important than me that gives meaning to my existence."}, {"time": 11067, "text": "Do you have advice for young people today in high school, in college, that are thinking about what to do with their career, with their life, so that at the end of the whole thing, they can be proud of what they did?"}, {"time": 11083, "text": "Don't cheat."}, {"time": 11085, "text": "Have integrity, aim for integrity."}, {"time": 11088, "text": "So what does integrity look like when you're at the river or the leaf or the fat frog in a lake?"}, {"time": 11094, "text": "It basically means that you try to figure out what the thing is that is the most right."}, {"time": 11102, "text": "And this doesn't mean that you have to look for what other people tell you what's right, but you have to aim for moral autonomy."}, {"time": 11109, "text": "So things need to be right independently of what other people say."}, {"time": 11114, "text": "I always felt that when people told me to listen to what others say, like read the room, build your ideas of what's true based on the high status people of your in group, that does not protect me from fascism."}, {"time": 11129, "text": "The only way to protect yourself from fascism is to decide it's the world that is being built here, the world that I want to be in."}, {"time": 11137, "text": "And so in some sense, try to make your behavior sustainable, act in such a way that you would feel comfortable on all sides of the transaction."}, {"time": 11146, "text": "Realize that everybody is you in a different timeline, but is seeing things differently and has reasons to do so."}, {"time": 11153, "text": "Yeah, I've come to realize this recently, that there is an inner voice that tells you what's right and wrong."}, {"time": 11162, "text": "And speaking of reading the room, there's times what integrity looks like is there's times when a lot of people are doing something wrong."}, {"time": 11172, "text": "And what integrity looks like is not going on Twitter and tweeting about it, but not participating quietly, not doing."}, {"time": 11180, "text": "So it's not like signaling or not all this kind of stuff, but actually living your, what you think is right."}, {"time": 11188, "text": "Like living it, not signaling."}, {"time": 11188, "text": "There's also sometimes this expectation that others are like us."}, {"time": 11192, "text": "So imagine the possibility that some of the people around you are space aliens that only look human, right?"}, {"time": 11199, "text": "So they don't have the same prayers as you do."}, {"time": 11201, "text": "They don't have the same impulses that's what's right and wrong."}, {"time": 11205, "text": "There's a large diversity in these basic impulses that people can have in a given situation."}, {"time": 11211, "text": "And now realize that you are a space alien, right?"}, {"time": 11214, "text": "You are not actually human."}, {"time": 11215, "text": "You think that you are human, but you don't know what it means, like what it's like to be human."}, {"time": 11220, "text": "You just make it up as you go along like everybody else."}, {"time": 11224, "text": "And you have to figure that out, what it means that you are a full human being, what it means to be human in the world and how to connect with others on that."}, {"time": 11233, "text": "And there is also something, don't be afraid in the sense that if you do this, you're not good enough."}, {"time": 11240, "text": "Because if you are acting on these incentives of integrity, you become trustworthy."}, {"time": 11245, "text": "That's the way in which you can recognize each other."}, {"time": 11248, "text": "There is a particular place where you can meet."}, {"time": 11250, "text": "You can figure out what that place is, where you will give support to people because you realize that they act with integrity and they will also do that."}, {"time": 11260, "text": "So in some sense, you are safe if you do that."}, {"time": 11263, "text": "You're not always protected."}, {"time": 11264, "text": "There are people which will abuse you and that are bad actors in a way that it's hard to imagine before you meet them."}]}]