[{"title": "Pieter Abbeel: Deep Reinforcement Learning | Lex Fridman Podcast #10", "id": "l-mYLq6eZPY", "quotes": [{"time": 262, "text": "They don't really write a lot of detail, but even if it's hard coded underneath, which it might or might not be just the physical abilities of doing that parkour, that's a very impressive."}, {"time": 272, "text": "So have you met Spot Mini or any of those robots in person?"}, {"time": 276, "text": "Met Spot Mini last year in April at the Mars event that Jeff Bezos organizes."}, {"time": 282, "text": "They brought it out there and it was nicely following around Jeff."}, {"time": 287, "text": "When Jeff left the room, they had it follow him along, which is pretty impressive."}, {"time": 292, "text": "So I think there's some confidence to know that there's no learning going on in those robots."}, {"time": 298, "text": "The psychology of it, so while knowing that, while knowing there's not, if there's any learning going on, it's very limited."}, {"time": 304, "text": "I met Spot Mini earlier this year and knowing everything that's going on, having one on one interaction, so I got to spend some time alone and there's immediately a deep connection on the psychological level."}, {"time": 318, "text": "Even though you know the fundamentals, how it works, there's something magical."}, {"time": 323, "text": "So do you think about the psychology of interacting with robots in the physical world?"}, {"time": 329, "text": "Even you just showed me the PR2, the robot, and there was a little bit something like a face, had a little bit something like a face."}, {"time": 338, "text": "There's something that immediately draws you to it."}, {"time": 340, "text": "Do you think about that aspect of the robotics problem?"}, {"time": 345, "text": "Well, it's very hard with Brad here."}, {"time": 348, "text": "We'll give him a name, Berkeley Robot for the Elimination of Tedious Tasks."}, {"time": 352, "text": "It's very hard to not think of the robot as a person and it seems like everybody calls him a he for whatever reason, but that also makes it more a person than if it was a it, and it seems pretty natural to think of it that way."}, {"time": 367, "text": "This past weekend really struck me."}, {"time": 368, "text": "I've seen Pepper many times on videos, but then I was at an event organized by, this was by Fidelity, and they had scripted Pepper to help moderate some sessions, and they had scripted Pepper to have the personality of a child a little bit, and it was very hard to not think of it as its own person in some sense because it would just jump in the conversation, making it very interactive."}, {"time": 395, "text": "Moderate would be saying, Pepper would just jump in, hold on, how about me?"}, {"time": 400, "text": "Can I participate in this too?"}, {"time": 401, "text": "And you're just like, okay, this is like a person, and that was 100% scripted, and even then it was hard not to have that sense of somehow there is something there."}, {"time": 410, "text": "So as we have robots interact in this physical world, is that a signal that could be used in reinforcement learning?"}, {"time": 417, "text": "You've worked a little bit in this direction, but do you think that psychology can be somehow pulled in?"}, {"time": 424, "text": "Yes, that's a question I would say a lot of people ask, and I think part of why they ask it is they're thinking about how unique are we really still as people?"}, {"time": 436, "text": "Like after they see some results, they see a computer play Go, they see a computer do this, that, they're like, okay, but can it really have emotion?"}, {"time": 443, "text": "Can it really interact with us in that way?"}, {"time": 476, "text": "And why wouldn't it then naturally become more and more interactive and more and more maybe like a person or like a pet?"}, {"time": 483, "text": "I don't know what it would exactly be, but more and more have those features and acquire them automatically."}, {"time": 488, "text": "As long as you can formalize an objective of what it means to like something, what, how you exhibit, what's the ground truth?"}, {"time": 496, "text": "How do you get the reward from human?"}, {"time": 499, "text": "Because you have to somehow collect that information within you, human."}, {"time": 502, "text": "But you're saying if you can formulate as an objective, it can be learned."}, {"time": 507, "text": "There's no reason it couldn't emerge through learning, and maybe one way to formulate as an objective, you wouldn't have to necessarily score it explicitly, so standard rewards are numbers, and numbers are hard to come by."}, {"time": 518, "text": "This is a 1.5 or a 1.7 on some scale."}, {"time": 521, "text": "It's very hard to do for a person, but much easier is for a person to say, okay, what you did the last five minutes was much nicer than what you did the previous five minutes, and that now gives a comparison."}, {"time": 533, "text": "And in fact, there have been some results on that."}, {"time": 535, "text": "For example, Paul Christiano and collaborators at OpenAI had the Hopper, Mojoko Hopper, a one legged robot, going through backflips purely from feedback."}, {"time": 545, "text": "I like this better than that."}, {"time": 546, "text": "That's kind of equally good, and after a bunch of interactions, it figured out what it was the person was asking for, namely a backflip."}, {"time": 554, "text": "And so I think the same thing."}, {"time": 555, "text": "Oh, it wasn't trying to do a backflip."}, {"time": 558, "text": "It was just getting a comparison score from the person based on?"}, {"time": 563, "text": "Person having in mind, in their own mind, I wanted to do a backflip, but the robot didn't know what it was supposed to be doing."}, {"time": 570, "text": "It just knew that sometimes the person said, this is better, this is worse, and then the robot figured out what the person was actually after was a backflip."}, {"time": 578, "text": "And I'd imagine the same would be true for things like more interactive robots, that the robot would figure out over time, oh, this kind of thing apparently is appreciated more than this other kind of thing."}, {"time": 590, "text": "So when I first picked up Sutton's, Richard Sutton's reinforcement learning book, before sort of this deep learning, before the reemergence of neural networks as a powerful mechanism for machine learning, RL seemed to me like magic."}, {"time": 608, "text": "It was beautiful."}, {"time": 610, "text": "So that seemed like what intelligence is, RL reinforcement learning."}, {"time": 615, "text": "So how do you think we can possibly learn anything about the world when the reward for the actions is delayed, is so sparse?"}, {"time": 625, "text": "Like where is, why do you think RL works?"}, {"time": 630, "text": "Why do you think you can learn anything under such sparse rewards, whether it's regular reinforcement learning or deep reinforcement learning?"}, {"time": 638, "text": "What's your intuition?"}, {"time": 640, "text": "The counterpart of that is why is RL, why does it need so many samples, so many experiences to learn from?"}, {"time": 649, "text": "Because really what's happening is when you have a sparse reward, you do something maybe for like, I don't know, you take 100 actions and then you get a reward."}, {"time": 657, "text": "And maybe you get like a score of three."}, {"time": 659, "text": "And I'm like okay, three, not sure what that means."}, {"time": 663, "text": "You go again and now you get two."}, {"time": 665, "text": "And now you know that that sequence of 100 actions that you did the second time around somehow was worse than the sequence of 100 actions you did the first time around."}, {"time": 671, "text": "But that's tough to now know which one of those were better or worse."}, {"time": 675, "text": "Some might have been good and bad in either one."}, {"time": 677, "text": "And so that's why it needs so many experiences."}, {"time": 679, "text": "But once you have enough experiences, effectively RL is teasing that apart."}, {"time": 683, "text": "It's trying to say okay, what is consistently there when you get a higher reward and what's consistently there when you get a lower reward?"}, {"time": 690, "text": "And then kind of the magic of sometimes the policy gradient update is to say now let's update the neural network to make the actions that were kind of present when things are good more likely and make the actions that are present when things are not as good less likely."}, {"time": 705, "text": "So that is the counterpoint, but it seems like you would need to run it a lot more than you do."}, {"time": 710, "text": "Even though right now people could say that RL is very inefficient, but it seems to be way more efficient than one would imagine on paper."}, {"time": 718, "text": "That the simple updates to the policy, the policy gradient, that somehow you can learn, exactly you just said, what are the common actions that seem to produce some good results?"}, {"time": 729, "text": "That that somehow can learn anything."}, {"time": 732, "text": "It seems counterintuitive at least."}, {"time": 735, "text": "Is there some intuition behind it?"}, {"time": 736, "text": "Yeah, so I think there's a few ways to think about this."}, {"time": 741, "text": "The way I tend to think about it mostly originally, so when we started working on deep reinforcement learning here at Berkeley, which was maybe 2011, 12, 13, around that time, John Schulman was a PhD student initially kind of driving it forward here."}, {"time": 759, "text": "And the way we thought about it at the time was if you think about rectified linear units or kind of rectifier type neural networks, what do you get?"}, {"time": 771, "text": "You get something that's piecewise linear feedback control."}, {"time": 775, "text": "And if you look at the literature, linear feedback control is extremely successful, can solve many, many problems surprisingly well."}, {"time": 783, "text": "I remember, for example, when we did helicopter flight, if you're in a stationary flight regime, not a non stationary, but a stationary flight regime like hover, you can use linear feedback control to stabilize a helicopter, very complex dynamical system, but the controller is relatively simple."}, {"time": 798, "text": "And so I think that's a big part of it is that if you do feedback control, even though the system you control can be very, very complex, often relatively simple control architectures can already do a lot."}, {"time": 810, "text": "But then also just linear is not good enough."}, {"time": 812, "text": "And so one way you can think of these neural networks is that sometimes they tile the space, which people were already trying to do more by hand or with finite state machines, say this linear controller here, this linear controller here."}, {"time": 823, "text": "Neural network learns to tile the space and say linear controller here, another linear controller here, but it's more subtle than that."}, {"time": 830, "text": "And so it's benefiting from this linear control aspect, it's benefiting from the tiling, but it's somehow tiling it one dimension at a time."}, {"time": 837, "text": "Because if let's say you have a two layer network, if in that hidden layer, you make a transition from active to inactive or the other way around, that is essentially one axis, but not axis aligned, but one direction that you change."}, {"time": 852, "text": "And so you have this kind of very gradual tiling of the space where you have a lot of sharing between the linear controllers that tile the space."}, {"time": 859, "text": "And that was always my intuition as to why to expect that this might work pretty well."}, {"time": 864, "text": "It's essentially leveraging the fact that linear feedback control is so good, but of course not enough."}, {"time": 869, "text": "And this is a gradual tiling of the space with linear feedback controls that share a lot of expertise across them."}, {"time": 876, "text": "So that's really nice intuition, but do you think that scales to the more and more general problems of when you start going up the number of dimensions when you start going down in terms of how often you get a clean reward signal?"}, {"time": 895, "text": "Does that intuition carry forward to those crazier, weirder worlds that we think of as the real world?"}, {"time": 903, "text": "So I think where things get really tricky in the real world compared to the things we've looked at so far with great success in reinforcement learning is the time scales, which takes us to an extreme."}, {"time": 918, "text": "So when you think about the real world, I mean, I don't know, maybe some student decided to do a PhD here, right?"}, {"time": 926, "text": "Okay, that's a decision."}, {"time": 928, "text": "That's a very high level decision."}, {"time": 930, "text": "But if you think about their lives, I mean, any person's life, it's a sequence of muscle fiber contractions and relaxations, and that's how you interact with the world."}, {"time": 940, "text": "And that's a very high frequency control thing, but it's ultimately what you do and how you affect the world, until I guess we have brain readings and you can maybe do it slightly differently."}, {"time": 949, "text": "But typically that's how you affect the world."}, {"time": 952, "text": "And the decision of doing a PhD is so abstract relative to what you're actually doing in the world."}, {"time": 959, "text": "And I think that's where credit assignment becomes just completely beyond what any current RL algorithm can do."}, {"time": 966, "text": "And we need hierarchical reasoning at a level that is just not available at all yet."}, {"time": 972, "text": "Where do you think we can pick up hierarchical reasoning?"}, {"time": 974, "text": "By which mechanisms?"}, {"time": 976, "text": "Yeah, so maybe let me highlight what I think the limitations are of what already was done 20, 30 years ago."}, {"time": 986, "text": "In fact, you'll find reasoning systems that reason over relatively long horizons, but the problem is that they were not grounded in the real world."}, {"time": 994, "text": "So people would have to hand design some kind of logical, dynamical descriptions of the world and that didn't tie into perception."}, {"time": 1006, "text": "And so it didn't tie into real objects and so forth."}, {"time": 1009, "text": "And so that was a big gap."}, {"time": 1011, "text": "Now with deep learning, we start having the ability to really see with sensors, process that and understand what's in the world."}, {"time": 1021, "text": "And so it's a good time to try to bring these things together."}, {"time": 1024, "text": "I see a few ways of getting there."}, {"time": 1026, "text": "One way to get there would be to say deep learning can get bolted on somehow to some of these more traditional approaches."}, {"time": 1032, "text": "Now bolted on would probably mean you need to do some kind of end to end training where you say my deep learning processing somehow leads to a representation that in term uses some kind of traditional underlying dynamical systems that can be used for planning."}, {"time": 1049, "text": "And that's, for example, the direction Aviv Tamar and Thanard Kuretach here have been pushing with causal info again and of course other people too."}, {"time": 1056, "text": "That's one way."}, {"time": 1058, "text": "Can we somehow force it into the form factor that is amenable to reasoning?"}, {"time": 1063, "text": "Another direction we've been thinking about for a long time and didn't make any progress on was more information theoretic approaches."}, {"time": 1073, "text": "So the idea there was that what it means to take high level action is to take and choose a latent variable now that tells you a lot about what's gonna be the case in the future."}, {"time": 1085, "text": "Because that's what it means to take a high level action."}, {"time": 1089, "text": "I say okay, I decide I'm gonna navigate to the gas station because I need to get gas for my car."}, {"time": 1095, "text": "Well, that'll now take five minutes to get there."}, {"time": 1097, "text": "But the fact that I get there, I could already tell that from the high level action I took much earlier."}, {"time": 1104, "text": "That we had a very hard time getting success with."}, {"time": 1108, "text": "Not saying it's a dead end necessarily, but we had a lot of trouble getting that to work."}, {"time": 1113, "text": "And then we started revisiting the notion of what are we really trying to achieve?"}, {"time": 1117, "text": "What we're trying to achieve is not necessarily hierarchy per se, but you could think about what does hierarchy give us?"}, {"time": 1124, "text": "What we hope it would give us is better credit assignment."}, {"time": 1129, "text": "What is better credit assignment?"}, {"time": 1131, "text": "It's giving us, it gives us faster learning, right?"}, {"time": 1135, "text": "And so faster learning is ultimately maybe what we're after."}, {"time": 1139, "text": "And so that's where we ended up with the RL squared paper on learning to reinforcement learn, which at a time Rocky Dwan led."}, {"time": 1148, "text": "And that's exactly the meta learning approach where you say, okay, we don't know how to design hierarchy."}, {"time": 1154, "text": "We know what we want to get from it."}, {"time": 1155, "text": "Let's just enter and optimize for what we want to get from it and see if it might emerge."}, {"time": 1160, "text": "And we saw things emerge."}, {"time": 1161, "text": "The maze navigation had consistent motion down hallways, which is what you want."}, {"time": 1167, "text": "A hierarchical control should say, I want to go down this hallway."}, {"time": 1169, "text": "And then when there is an option to take a turn, I can decide whether to take a turn or not and repeat."}, {"time": 1173, "text": "Even had the notion of where have you been before or not to not revisit places you've been before."}, {"time": 1179, "text": "It still didn't scale yet to the real world kind of scenarios I think you had in mind, but it was some sign of life that maybe you can meta learn these hierarchical concepts."}, {"time": 1191, "text": "I mean, it seems like through these meta learning concepts, get at the, what I think is one of the hardest and most important problems of AI, which is transfer learning."}, {"time": 1204, "text": "So it's generalization."}, {"time": 1206, "text": "How far along this journey towards building general systems are we?"}, {"time": 1211, "text": "Being able to do transfer learning well."}, {"time": 1213, "text": "So there's some signs that you can generalize a little bit, but do you think we're on the right path or it's totally different breakthroughs are needed to be able to transfer knowledge between different learned models?"}, {"time": 1231, "text": "Yeah, I'm pretty torn on this in that I think there are some very impressive."}, {"time": 1235, "text": "Well, there's just some very impressive results already."}, {"time": 1240, "text": "I mean, I would say when, even with the initial kind of big breakthrough in 2012 with AlexNet, the initial thing is okay, great."}, {"time": 1252, "text": "This does better on ImageNet, hence image recognition."}, {"time": 1255, "text": "But then immediately thereafter, there was of course the notion that, wow, what was learned on ImageNet and you now wanna solve a new task, you can fine tune AlexNet for new tasks."}, {"time": 1269, "text": "And that was often found to be the even bigger deal that you learn something that was reusable, which was not often the case before."}, {"time": 1276, "text": "Usually machine learning, you learn something for one scenario and that was it."}, {"time": 1279, "text": "And that's really exciting."}, {"time": 1280, "text": "I mean, that's a huge application."}, {"time": 1282, "text": "That's probably the biggest success of transfer learning today in terms of scope and impact."}, {"time": 1287, "text": "That was a huge breakthrough."}, {"time": 1289, "text": "And then recently, I feel like similar kind of, by scaling things up, it seems like this has been expanded upon."}, {"time": 1296, "text": "Like people training even bigger networks, they might transfer even better."}, {"time": 1299, "text": "If you looked at, for example, some of the OpenAI results on language models and some of the recent Google results on language models, they're learned for just prediction and then they get reused for other tasks."}, {"time": 1314, "text": "And so I think there is something there where somehow if you train a big enough model on enough things, it seems to transfer some deep mind results that I thought were very impressive, the Unreal results, where it was learned to navigate mazes in ways where it wasn't just doing reinforcement learning, but it had other objectives it was optimizing for."}, {"time": 1334, "text": "So I think there's a lot of interesting results already."}, {"time": 1337, "text": "I think maybe where it's hard to wrap my head around this, to which extent or when do we call something generalization?"}, {"time": 1346, "text": "Or the levels of generalization in the real world, or the levels of generalization involved in these different tasks, right?"}, {"time": 1356, "text": "You draw this, by the way, just to frame things."}, {"time": 1359, "text": "I've heard you say somewhere, it's the difference between learning to master versus learning to generalize, that it's a nice line to think about."}, {"time": 1367, "text": "And I guess you're saying that it's a gray area of what learning to master and learning to generalize, where one starts."}, {"time": 1374, "text": "I think I might have heard this."}, {"time": 1376, "text": "I might have heard it somewhere else."}, {"time": 1377, "text": "And I think it might've been one of your interviews, maybe the one with Yoshua Benjamin, I'm not 100% sure."}, {"time": 1383, "text": "But I liked the example, I'm not sure who it was, but the example was essentially, if you use current deep learning techniques, what we're doing to predict, let's say, the relative motion of our planets, it would do pretty well."}, {"time": 1402, "text": "But then now if a massive new mass enters our solar system, it would probably not predict what will happen, right?"}, {"time": 1412, "text": "And that's a different kind of generalization."}, {"time": 1413, "text": "That's a generalization that relies on the ultimate simplest, simplest explanation that we have available today to explain the motion of planets, whereas just pattern recognition could predict our current solar system motion pretty well, no problem."}, {"time": 1427, "text": "And so I think that's an example of a kind of generalization that is a little different from what we've achieved so far."}, {"time": 1434, "text": "And it's not clear if just regularizing more and forcing it to come up with a simpler, simpler, simpler explanation and say, look, this is not simple."}, {"time": 1443, "text": "But that's what physics researchers do, right?"}, {"time": 1445, "text": "They say, can I make this even simpler?"}, {"time": 1448, "text": "How simple can I get this?"}, {"time": 1449, "text": "What's the simplest equation that can explain everything?"}, {"time": 1452, "text": "The master equation for the entire dynamics of the universe, we haven't really pushed that direction as hard in deep learning, I would say."}, {"time": 1460, "text": "Not sure if it should be pushed, but it seems a kind of generalization you get from that that you don't get in our current methods so far."}, {"time": 1467, "text": "So I just talked to Vladimir Vapnik, for example, who's a statistician of statistical learning, and he kind of dreams of creating the E equals MC squared for learning, right?"}, {"time": 1481, "text": "The general theory of learning."}, {"time": 1482, "text": "Do you think that's a fruitless pursuit in the near term, within the next several decades?"}, {"time": 1491, "text": "I think that's a really interesting pursuit in the following sense, in that there is a lot of evidence that the brain is pretty modular."}, {"time": 1503, "text": "And so I wouldn't maybe think of it as the theory, maybe the underlying theory, but more kind of the principle where there have been findings where people who are blind will use the part of the brain usually used for vision for other functions."}, {"time": 1521, "text": "And even after some kind of, if people get rewired in some way, they might be able to reuse parts of their brain for other functions."}, {"time": 1530, "text": "And so what that suggests is some kind of modularity."}, {"time": 1535, "text": "And I think it is a pretty natural thing to strive for to see, can we find that modularity?"}, {"time": 1541, "text": "Can we find this thing?"}, {"time": 1543, "text": "Of course, every part of the brain is not exactly the same."}, {"time": 1545, "text": "Not everything can be rewired arbitrarily."}, {"time": 1548, "text": "But if you think of things like the neocortex, which is a pretty big part of the brain, that seems fairly modular from what the findings so far."}, {"time": 1556, "text": "Can you design something equally modular?"}, {"time": 1559, "text": "And if you can just grow it, it becomes more capable probably."}, {"time": 1562, "text": "I think that would be the kind of interesting underlying principle to shoot for that is not unrealistic."}, {"time": 1569, "text": "Do you think you prefer math or empirical trial and error for the discovery of the essence of what it means to do something intelligent?"}, {"time": 1579, "text": "So reinforcement learning embodies both groups, right?"}, {"time": 1582, "text": "To prove that something converges, prove the bounds."}, {"time": 1586, "text": "And then at the same time, a lot of those successes are, well, let's try this and see if it works."}, {"time": 1591, "text": "So which do you gravitate towards?"}, {"time": 1593, "text": "How do you think of those two parts of your brain?"}, {"time": 1599, "text": "Maybe I would prefer we could make the progress with mathematics."}, {"time": 1605, "text": "And the reason maybe I would prefer that is because often if you have something you can mathematically formalize, you can leapfrog a lot of experimentation."}, {"time": 1615, "text": "And experimentation takes a long time to get through."}, {"time": 1618, "text": "And a lot of trial and error, kind of reinforcement learning, your research process, but you need to do a lot of trial and error before you get to a success."}, {"time": 1626, "text": "So if you can leapfrog that, to my mind, that's what the math is about."}, {"time": 1630, "text": "And hopefully once you do a bunch of experiments, you start seeing a pattern."}, {"time": 1634, "text": "You can do some derivations that leapfrog some experiments."}, {"time": 1638, "text": "But I agree with you."}, {"time": 1639, "text": "I mean, in practice, a lot of the progress has been such that we have not been able to find the math that allows you to leapfrog ahead."}, {"time": 1645, "text": "And we are kind of making gradual progress one step at a time, a new experiment here, a new experiment there that gives us new insights and gradually building up, but not getting to something yet where we're just, okay, here's an equation that now explains how, you know, that would be, have been two years of experimentation to get there, but this tells us what the result's going to be."}, {"time": 1665, "text": "Unfortunately, not so much yet."}, {"time": 1667, "text": "Not so much yet, but your hope is there."}, {"time": 1670, "text": "In trying to teach robots or systems to do everyday tasks or even in simulation, what do you think you're more excited about?"}, {"time": 1682, "text": "Imitation learning or self play?"}, {"time": 1684, "text": "So letting robots learn from humans or letting robots plan their own to try to figure out in their own way and eventually play, eventually interact with humans or solve whatever the problem is."}, {"time": 1700, "text": "What's the more exciting to you?"}, {"time": 1701, "text": "What's more promising you think as a research direction?"}, {"time": 1704, "text": "So when we look at self play, what's so beautiful about it is goes back to kind of the challenges in reinforcement learning."}, {"time": 1717, "text": "So the challenge of reinforcement learning is getting signal."}, {"time": 1720, "text": "And if you don't never succeed, you don't get any signal."}, {"time": 1723, "text": "In self play, you're on both sides."}, {"time": 1726, "text": "So one of you succeeds."}, {"time": 1728, "text": "And the beauty is also one of you fails."}, {"time": 1729, "text": "And so you see the contrast."}, {"time": 1731, "text": "You see the one version of me that did better than the other version."}, {"time": 1734, "text": "So every time you play yourself, you get signal."}, {"time": 1737, "text": "And so whenever you can turn something into self play, you're in a beautiful situation where you can naturally learn much more quickly than in most other reinforcement learning environments."}, {"time": 1747, "text": "So I think if somehow we can turn more reinforcement learning problems into self play formulations, that would go really, really far."}, {"time": 1757, "text": "So far, self play has been largely around games where there is natural opponents."}, {"time": 1762, "text": "But if we could do self play for other things, and let's say, I don't know, a robot learns to build a house."}, {"time": 1766, "text": "I mean, that's a pretty advanced thing to try to do for a robot, but maybe it tries to build a hut or something."}, {"time": 1771, "text": "If that can be done through self play, it would learn a lot more quickly if somebody can figure that out."}, {"time": 1776, "text": "And I think that would be something where it goes closer to kind of the mathematical leapfrogging where somebody figures out a formalism to say, okay, any RL problem by playing this and this idea, you can turn it into a self play problem where you get signal a lot more easily."}, {"time": 1790, "text": "Reality is, many problems we don't know how to turn into self play."}, {"time": 1793, "text": "And so either we need to provide detailed reward."}, {"time": 1796, "text": "That doesn't just reward for achieving a goal, but rewards for making progress, and that becomes time consuming."}, {"time": 1802, "text": "And once you're starting to do that, let's say you want a robot to do something, you need to give all this detailed reward."}, {"time": 1807, "text": "Well, why not just give a demonstration?"}, {"time": 1809, "text": "Because why not just show the robot?"}, {"time": 1811, "text": "And now the question is, how do you show the robot?"}, {"time": 1814, "text": "One way to show is to tally operate the robot, and then the robot really experiences things."}, {"time": 1819, "text": "And that's nice, because that's really high signal to noise ratio data, and we've done a lot of that."}, {"time": 1823, "text": "And you teach your robot skills in just 10 minutes, you can teach your robot a new basic skill, like okay, pick up the bottle, place it somewhere else."}, {"time": 1830, "text": "That's a skill, no matter where the bottle starts, maybe it always goes onto a target or something."}, {"time": 1834, "text": "That's fairly easy to teach your robot with tally up."}, {"time": 1838, "text": "Now, what's even more interesting if you can now teach your robot through third person learning, where the robot watches you do something and doesn't experience it, but just kind of watches you."}, {"time": 1848, "text": "It doesn't experience it, but just watches it and says, okay, well, if you're showing me that, that means I should be doing this."}, {"time": 1853, "text": "And I'm not gonna be using your hand, because I don't get to control your hand, but I'm gonna use my hand, I do that mapping."}, {"time": 1859, "text": "And so that's where I think one of the big breakthroughs has happened this year."}, {"time": 1863, "text": "This was led by Chelsea Finn here."}, {"time": 1866, "text": "It's almost like learning a machine translation for demonstrations, where you have a human demonstration, and the robot learns to translate it into what it means for the robot to do it."}, {"time": 1875, "text": "And that was a meta learning formulation, learn from one to get the other."}, {"time": 1880, "text": "And that, I think, opens up a lot of opportunities to learn a lot more quickly."}, {"time": 1884, "text": "So my focus is on autonomous vehicles."}, {"time": 1886, "text": "Do you think this approach of third person watching, the autonomous driving is amenable to this kind of approach?"}, {"time": 1893, "text": "So for autonomous driving, I would say third person is slightly easier."}, {"time": 1901, "text": "And the reason I'm gonna say it's slightly easier to do with third person is because the car dynamics are very well understood."}, {"time": 1911, "text": "Easier than first person, you mean?"}, {"time": 1913, "text": "Or easier than..."}, {"time": 1915, "text": "So I think the distinction between third person and first person is not a very important distinction for autonomous driving."}, {"time": 1921, "text": "They're very similar."}, {"time": 1923, "text": "Because the distinction is really about who turns the steering wheel."}, {"time": 1929, "text": "Or maybe, let me put it differently."}, {"time": 1932, "text": "How to get from a point where you are now to a point, let's say, a couple meters in front of you."}, {"time": 1937, "text": "And that's a problem that's very well understood."}, {"time": 1939, "text": "And that's the only distinction between third and first person there."}, {"time": 1941, "text": "Whereas with the robot manipulation, interaction forces are very complex."}, {"time": 1945, "text": "And it's still a very different thing."}, {"time": 1947, "text": "For autonomous driving, I think there is still the question, imitation versus RL."}, {"time": 1954, "text": "So imitation gives you a lot more signal."}, {"time": 1956, "text": "I think where imitation is lacking and needs some extra machinery is, it doesn't, in its normal format, doesn't think about goals or objectives."}, {"time": 1968, "text": "And of course, there are versions of imitation learning and versus reinforcement learning type imitation learning which also thinks about goals."}, {"time": 1974, "text": "I think then we're getting much closer."}, {"time": 1977, "text": "But I think it's very hard to think of a fully reactive car, generalizing well."}, {"time": 1984, "text": "If it really doesn't have a notion of objectives to generalize well to the kind of general that you would want."}, {"time": 1989, "text": "You'd want more than just that reactivity that you get from just behavioral cloning slash supervised learning."}, {"time": 1997, "text": "So a lot of the work, whether it's self play or even imitation learning, would benefit significantly from simulation, from effective simulation."}, {"time": 2006, "text": "And you're doing a lot of stuff in the physical world and in simulation."}, {"time": 2009, "text": "Do you have hope for greater and greater power of simulation being boundless eventually to where most of what we need to operate in the physical world could be simulated to a degree that's directly transferable to the physical world?"}, {"time": 2027, "text": "Or are we still very far away from that?"}, {"time": 2031, "text": "So I think we could even rephrase that question in some sense."}, {"time": 2040, "text": "And so the power of simulation, right?"}, {"time": 2044, "text": "As simulators get better and better, of course, becomes stronger and we can learn more in simulation."}, {"time": 2051, "text": "But there's also another version which is where you say the simulator doesn't even have to be that precise."}, {"time": 2055, "text": "As long as it's somewhat representative and instead of trying to get one simulator that is sufficiently precise to learn in and transfer really well to the real world, I'm gonna build many simulators."}, {"time": 2067, "text": "Ensemble of simulators?"}, {"time": 2068, "text": "Ensemble of simulators."}, {"time": 2069, "text": "Not any single one of them is sufficiently representative of the real world such that it would work if you train in there."}, {"time": 2077, "text": "But if you train in all of them, then there is something that's good in all of them."}, {"time": 2083, "text": "The real world will just be another one of them that's not identical to any one of them but just another one of them."}, {"time": 2090, "text": "Another sample from the distribution of simulators."}, {"time": 2094, "text": "We do live in a simulation, so this is just one other one."}, {"time": 2097, "text": "I'm not sure about that, but yeah."}, {"time": 2101, "text": "It's definitely a very advanced simulator if it is."}, {"time": 2103, "text": "Yeah, it's a pretty good one."}, {"time": 2105, "text": "I've talked to Stuart Russell."}, {"time": 2107, "text": "It's something you think about a little bit too."}, {"time": 2109, "text": "Of course, you're really trying to build these systems, but do you think about the future of AI?"}, {"time": 2113, "text": "A lot of people have concern about safety."}, {"time": 2116, "text": "How do you think about AI safety?"}, {"time": 2118, "text": "As you build robots that are operating in the physical world, what is, yeah, how do you approach this problem in an engineering kind of way, in a systematic way?"}, {"time": 2129, "text": "So when a robot is doing things, you kind of have a few notions of safety to worry about."}, {"time": 2136, "text": "One is that the robot is physically strong and of course could do a lot of damage."}, {"time": 2142, "text": "Same for cars, which we can think of as robots too in some way."}, {"time": 2146, "text": "And this could be completely unintentional."}, {"time": 2148, "text": "So it could be not the kind of longterm AI safety concerns that, okay, AI is smarter than us and now what do we do?"}, {"time": 2154, "text": "But it could be just very practical."}, {"time": 2155, "text": "Okay, this robot, if it makes a mistake, what are the results going to be?"}, {"time": 2160, "text": "Of course, simulation comes in a lot there to test in simulation."}, {"time": 2162, "text": "It's a difficult question."}, {"time": 2167, "text": "And I'm always wondering, like, I always wonder, let's say you look at, let's go back to driving because a lot of people know driving well, of course."}, {"time": 2175, "text": "What do we do to test somebody for driving, right?"}, {"time": 2178, "text": "Get a driver's license."}, {"time": 2178, "text": "What do they really do?"}, {"time": 2181, "text": "I mean, you fill out some tests and then you drive."}, {"time": 2186, "text": "And I mean, it's suburban California."}, {"time": 2189, "text": "That driving test is just you drive around the block, pull over, you do a stop sign successfully, and then you pull over again and you're pretty much done."}, {"time": 2200, "text": "And you're like, okay, if a self driving car did that, would you trust it that it can drive?"}, {"time": 2206, "text": "And I'd be like, no, that's not enough for me to trust it."}, {"time": 2208, "text": "But somehow for humans, we've figured out that somebody being able to do that is representative of them being able to do a lot of other things."}, {"time": 2217, "text": "And so I think somehow for humans, we figured out representative tests of what it means if you can do this, what you can really do."}, {"time": 2225, "text": "Of course, testing humans, humans don't wanna be tested at all times."}, {"time": 2229, "text": "Self driving cars or robots could be tested more often probably."}, {"time": 2231, "text": "You can have replicas that get tested that are known to be identical because they use the same neural net and so forth."}, {"time": 2237, "text": "But still, I feel like we don't have this kind of unit tests or proper tests for robots."}, {"time": 2244, "text": "And I think there's something very interesting to be thought about there, especially as you update things."}, {"time": 2248, "text": "Your software improves, you have a better self driving car suite, you update it."}]}]