[{"title": "Karl Friston: Neuroscience and the Free Energy Principle | Lex Fridman Podcast #99", "id": "NwzuibY5kUs", "quotes": [{"time": 431, "text": "Sort of I always thought it's just like a giant mess, interconnected mess where it's very difficult to figure anything out."}, {"time": 438, "text": "But in what sense do you see the brain as hierarchical?"}, {"time": 441, "text": "Well, I see it, it's not a magic soup."}, {"time": 444, "text": "Which of course is what I used to think before I studied medicine and the like."}, {"time": 454, "text": "So a lot of those terms imply each other."}, {"time": 458, "text": "So hierarchies, if you just think about the nature of a hierarchy, how would you actually build one?"}, {"time": 466, "text": "And what you would have to do is basically carefully remove the right connections that destroy the completely connected soups that you might have in mind."}, {"time": 476, "text": "So a hierarchy is in and of itself defined by a sparse and particular connectivity structure."}, {"time": 484, "text": "I'm not committing to any particular form of hierarchy."}, {"time": 488, "text": "But your sense is there is some."}, {"time": 490, "text": "Oh, absolutely, yeah."}, {"time": 491, "text": "In virtue of the fact that there is a sparsity of connectivity, not necessarily of a qualitative sort, but certainly of a quantitative sort."}, {"time": 500, "text": "So it is demonstrably so that the further apart two parts of the brain are, the less likely they are to be wired, to possess axonal processes, neuronal processes that directly communicate one message or messages from one part of that brain to the other part of the brain."}, {"time": 522, "text": "So we know there's a sparse connectivity."}, {"time": 525, "text": "And furthermore, on the basis of anatomical connectivity in traces studies, we know that that sparsity underwrites a hierarchical and very structured sort of connectivity that might be best understood like a little bit like an onion."}, {"time": 549, "text": "There is a concentric, sometimes referred to as centripetal by people like Marcel Masulam, hierarchical organization to the brain."}, {"time": 559, "text": "So you can think of the brain as in a rough sense, like an onion, and all the sensory information and all the afferent outgoing messages that supply commands to your muscles or to your secretory organs come from the surface."}, {"time": 577, "text": "So there's a massive exchange interface with the world out there on the surface."}, {"time": 583, "text": "And then underneath, there's a little layer that sits and looks at the exchange on the surface."}, {"time": 589, "text": "And then underneath that, there's a layer right the way down to the very center, to the deepest part of the onion."}, {"time": 595, "text": "That's what I mean by a hierarchical organization."}, {"time": 598, "text": "There's a discernible structure defined by the sparsity of connections that lends the architecture a hierarchical structure that tells one a lot about the kinds of representations and messages."}, {"time": 613, "text": "Coming back to your earlier question, is this about the representational capacity or is it about the anatomy?"}, {"time": 620, "text": "Well, one underwrites the other."}, {"time": 624, "text": "If one simply thinks of the brain as a message passing machine, a process that is in the service of doing something, then the circuitry and the connectivity that shape that message passing also dictate its function."}, {"time": 642, "text": "So you've done a lot of amazing work in a lot of directions."}, {"time": 646, "text": "So let's look at one aspect of that, of looking into the brain and trying to study this onion structure."}, {"time": 654, "text": "What can we learn about the brain by imaging it?"}, {"time": 657, "text": "Which is one way to sort of look at the anatomy of it."}, {"time": 660, "text": "Broadly speaking, what are the methods of imaging, but even bigger, what can we learn about it?"}, {"time": 667, "text": "Right, so well, most human neuroimaging that you might see in science journals that speaks to the way the brain works, measures brain activity over time."}, {"time": 684, "text": "So that's the first thing to say, that we're effectively looking at fluctuations in neuronal responses, usually in response to some sensory input or some instruction, some task."}, {"time": 700, "text": "Not necessarily, there's a lot of interest in just looking at the brain in terms of resting state, endogenous, or intrinsic activity."}, {"time": 708, "text": "But crucially, at every point, looking at these fluctuations, either induced or intrinsic in the neural activity, and understanding them at two levels."}, {"time": 719, "text": "So normally, people would recourse to two principles of brain organization that are complementary."}, {"time": 727, "text": "One, functional specialization or segregation."}, {"time": 731, "text": "It simply means that there are certain parts of the brain that may be specialized for certain kinds of processing."}, {"time": 739, "text": "For example, visual motion, our ability to recognize or to perceive movement in the visual world."}, {"time": 747, "text": "And furthermore, that specialized processing may be spatially or anatomically segregated, leading to functional segregation."}, {"time": 757, "text": "Which means that if I were to compare your brain activity during a period of viewing a static image, and then compare that to the responses of fluctuations in the brain when you were exposed to a moving image, say a flying bird, we'd expect to see restricted, segregated differences in activity."}, {"time": 781, "text": "And those are basically the hotspots that you see in the statistical parametric maps that test for the significance of the responses that are circumscribed."}, {"time": 791, "text": "So now, basically, we're talking about some people have perhaps unkindly called a neocartography."}, {"time": 799, "text": "This is a phrenology augmented by modern day neuroimaging, basically finding blobs or bumps on the brain that do this or do that, and trying to understand the cartography of that functional specialization."}, {"time": 815, "text": "So how much is there such, this is such a beautiful sort of ideal to strive for."}, {"time": 823, "text": "We humans, scientists, would like this, to hope that there's a beautiful structure to this where it's, like you said, there's segregated regions that are responsible for the different function."}, {"time": 834, "text": "How much hope is there to find such regions in terms of looking at the progress of studying the brain?"}, {"time": 840, "text": "Oh, I think enormous progress has been made in the past 20 or 30 years."}, {"time": 846, "text": "So this is beyond incremental."}, {"time": 848, "text": "At the advent of brain imaging, the very notion of functional segregation was just a hypothesis based upon a century, if not more, of careful neuropsychology, looking at people who had lost via insult or traumatic brain injury particular parts of the brain, and then saying, well, they can't do this or they can't do that."}, {"time": 872, "text": "For example, losing the visual cortex and not being able to see, or losing particular parts of the visual cortex or regions known as V5 or the middle temporal region, MT, and noticing that they selectively could not see moving things."}, {"time": 891, "text": "And so that created the hypothesis that perhaps visual movement processing was located in this functionally segregated area."}, {"time": 902, "text": "And you could then go and put invasive electrodes in animal models and say, yes, indeed, we can excite activity here."}, {"time": 910, "text": "We can form receptive fields that are sensitive to or defined in terms of visual motion."}, {"time": 916, "text": "But at no point could you exclude the possibility that everywhere else in the brain was also very interested in visual motion."}, {"time": 923, "text": "By the way, I apologize to interrupt, but a tiny little tangent."}, {"time": 926, "text": "You said animal models, just out of curiosity, from your perspective, how different is the human brain versus the other animals in terms of our ability to study the brain?"}, {"time": 938, "text": "Well, clearly, the further away you go from a human brain, the greater the differences, but not as remarkable as you might think."}, {"time": 948, "text": "So people will choose their level of approximation to the human brain, depending upon the kinds of questions that they want to answer."}, {"time": 957, "text": "So if you're talking about sort of canonical principles of microcircuitry, it might be perfectly okay to look at a mouse, indeed."}, {"time": 964, "text": "You could even look at flies, worms."}, {"time": 968, "text": "If, on the other hand, you wanted to look at the finer details of organization of visual cortex and V1, V2, these are designated patches of cortex that may do different things, indeed, do."}, {"time": 980, "text": "You'd probably want to use a primate that looked a little bit more like a human, because there are lots of ethical issues in terms of the use of nonhuman primates to answer questions about human anatomy."}, {"time": 997, "text": "But I think most people assume that most of the important principles are conserved in a continuous way, right from, well, yes, worms right through to you and me."}, {"time": 1013, "text": "So now returning to, so that was the early sort of ideas of studying the functional regions of the brain by if there's some damage to it, to try to infer that that part of the brain might be somewhat responsible for this type of function."}, {"time": 1029, "text": "So where does that lead us?"}, {"time": 1031, "text": "What are the next steps beyond that?"}, {"time": 1032, "text": "Right, well, I'll just actually just reverse a bit, come back to your sort of notion that the brain is a magic soup."}, {"time": 1039, "text": "That was actually a very prominent idea at one point, notions such as Lashley's law of mass action inherited from the observation that for certain animals, if you just took out spoonfuls of the brain, it didn't matter where you took these spoonfuls out, they always showed the same kinds of deficits."}, {"time": 1060, "text": "So it was very difficult to infer functional specialization purely on the basis of lesion deficit studies."}, {"time": 1069, "text": "But once we had the opportunity to look at the brain lighting up and it's literally it's sort of excitement, neuronal excitement when looking at this versus that, one was able to say, yes, indeed, these functionally specialized responses are very restricted and they're here or they're over there."}, {"time": 1088, "text": "If I do this, then this part of the brain lights up."}, {"time": 1091, "text": "And that became doable in the early 90s."}, {"time": 1096, "text": "In fact, shortly before with the advent of positron emission tomography."}, {"time": 1101, "text": "And then functional magnetic resonance imaging came along in the early 90s."}, {"time": 1106, "text": "And since that time, there has been an explosion of discovery, refinement, confirmation."}, {"time": 1116, "text": "There are people who believe that it's all in the anatomy."}, {"time": 1118, "text": "If you understand the anatomy, then you understand the function at some level."}, {"time": 1123, "text": "And many, many hypotheses were predicated on a deep understanding of the anatomy and the connectivity, but they were all confirmed and taken much further with neuroimaging."}, {"time": 1135, "text": "So that's what I meant by we've made an enormous amount of progress in this century indeed, and in relation to the previous century, by looking at these functionally selective responses."}, {"time": 1149, "text": "But that wasn't the whole story."}, {"time": 1151, "text": "So there's this sort of near phrenology, but finding bumps and hot spots in the brain that did this or that."}, {"time": 1157, "text": "The bigger question was, of course, the functional integration."}, {"time": 1162, "text": "How all of these regionally specific responses were orchestrated, how they were distributed, how did they relate to distributed processing and indeed representations in the brain."}, {"time": 1175, "text": "So then you turn to the more challenging issue of the integration, the connectivity."}, {"time": 1182, "text": "And then we come back to this beautiful, sparse, recurrent, hierarchical connectivity that seems characteristic of the brain and probably not many other organs."}, {"time": 1193, "text": "But nevertheless, we come back to this challenge of trying to figure out how everything is integrated."}, {"time": 1201, "text": "But what's your feeling?"}, {"time": 1202, "text": "What's the general consensus?"}, {"time": 1204, "text": "Have we moved away from the magic soup view of the brain?"}, {"time": 1207, "text": "So there is a deep structure to it."}, {"time": 1211, "text": "And then maybe a further question."}, {"time": 1214, "text": "You said some people believe that the structure is most of it, that you can really get at the core of the function by just deeply understanding the structure."}, {"time": 1222, "text": "Where do you sit on that, do you?"}, {"time": 1225, "text": "I think it's got some mileage to it, yes, yeah."}, {"time": 1228, "text": "So it's a worthy pursuit of going, of studying through imaging and all the different methods to actually study the structure."}, {"time": 1236, "text": "No, absolutely, yeah, yeah."}, {"time": 1238, "text": "Sorry, I'm just noting, you were accusing me of using lots of long words and then you introduced one there, which is deep, which is interesting."}, {"time": 1246, "text": "Because deep is the sort of millennial equivalent of hierarchical."}, {"time": 1251, "text": "So if you've put deep in front of anything, not only are you very millennial and very trending, but you're also implying a hierarchical architecture."}, {"time": 1261, "text": "So it is a depth, which is, for me, the beautiful thing."}, {"time": 1265, "text": "That's right, the word deep kind of, yeah, exactly, it implies hierarchy."}, {"time": 1270, "text": "I didn't even think about that."}, {"time": 1271, "text": "That indeed, the implicit meaning of the word deep is hierarchy."}, {"time": 1278, "text": "So deep inside the onion is the center of your soul."}, {"time": 1283, "text": "Maybe briefly, if you could paint a picture of the kind of methods of neuroimaging, maybe the history which you were a part of, from statistical parametric mapping."}, {"time": 1295, "text": "I mean, just what's out there that's interesting for people maybe outside the field to understand of what are the actual methodologies of looking inside the human brain?"}, {"time": 1305, "text": "Right, well, you can answer that question from two perspectives."}, {"time": 1308, "text": "Basically, it's the modality."}, {"time": 1309, "text": "What kind of signal are you measuring?"}, {"time": 1312, "text": "And they can range from, and let's limit ourselves to sort of imaging based noninvasive techniques."}, {"time": 1344, "text": "So looking at the anatomy noninvasively would be the first sort of neuroimaging that people might want to employ."}, {"time": 1352, "text": "Then you move on to the kinds of measurements that reflect dynamic function, and the most prevalent of those fall into two camps."}, {"time": 1362, "text": "You've got these metabolic, sometimes hemodynamic, blood related signals."}, {"time": 1368, "text": "So these metabolic and or hemodynamic signals are basically proxies for elevated activity and message passing and neuronal dynamics in particular parts of the brain."}, {"time": 1385, "text": "Characteristically though, the time constants of these hemodynamic or metabolic responses to neural activity are much longer than the neural activity itself."}, {"time": 1395, "text": "And this is referring, forgive me for the dumb questions, but this would be referring to blood, like the flow of blood."}, {"time": 1405, "text": "So there's a ton of, it seems like there's a ton of blood vessels in the brain."}, {"time": 1410, "text": "So what's the interaction between the flow of blood and the function of the neurons?"}, {"time": 1415, "text": "Is there an interplay there or?"}, {"time": 1417, "text": "Yup, yup, and that interplay accounts for several careers of world renowned scientists, yes, absolutely."}, {"time": 1427, "text": "So this is known as neurovascular coupling, is exactly what you said."}, {"time": 1430, "text": "It's how does the neural activity, the neuronal infrastructure, the actual message passing that we think underlies our capacity to perceive and act, how is that coupled to the vascular responses that supply the energy for that neural processing?"}, {"time": 1449, "text": "So there's a delicate web of large vessels, arteries and veins, that gets progressively finer and finer in detail until it perfuses at a microscopic level, the machinery where little neurons lie."}, {"time": 1463, "text": "So coming back to this sort of onion perspective, we were talking before using the onion as a metaphor for a deep hierarchical structure, but also I think it's just anatomically quite a useful metaphor."}, {"time": 1477, "text": "All the action, all the heavy lifting in terms of neural computation is done on the surface of the brain, and then the interior of the brain is constituted by fatty wires, essentially, axonal processes that are enshrouded by myelin sheaths."}, {"time": 1495, "text": "And these, when you dissect them, they look fatty and white, and so it's called white matter, as opposed to the actual neuro pill, which does the computation constituted largely by neurons, and that's known as gray matter."}, {"time": 1555, "text": "So one peculiar thing about cerebral metabolism, brain metabolism, is it really needs to be driven in the moment, which means you basically have to turn on the taps."}, {"time": 1564, "text": "So if there's lots of neural activity in one part of the brain, a little patch of a few millimeters, even less possibly, you really do have to water that piece of the garden now and quickly, and by quickly I mean within a couple of seconds."}, {"time": 1581, "text": "So that contains a lot of, hence the imaging could tell you a story of what's happening."}, {"time": 1588, "text": "Absolutely, but it is slightly compromised in terms of the resolution."}, {"time": 1593, "text": "So the deployment of these little microvessels that water the garden to enable the neural activity to play out, the spatial resolution is in order of a few millimeters, and crucially, the temporal resolution is the order of a few seconds."}, {"time": 1612, "text": "So you can't get right down and dirty into the actual spatial and temporal scale of neural activity in and of itself."}, {"time": 1619, "text": "To do that, you'd have to turn to the other big imaging modality, which is the recording of electromagnetic signals as they're generated in real time."}, {"time": 1627, "text": "So here, the temporal bandwidth, if you like, or the low limit on the temporal resolution is incredibly small, talking about milliseconds."}, {"time": 1637, "text": "And then you can get into the phasic fast responses that is in and of itself the neural activity, and start to see the succession or cascade of hierarchical recurrent message passing evoked by a particular stimulus."}, {"time": 1657, "text": "But the problem is you're looking at electromagnetic signals that have passed through an enormous amount of magic soup or spaghetti of collectivity, and through the scalp and the skull, and it's become spatially very diffuse."}, {"time": 1672, "text": "So it's very difficult to know where you are."}, {"time": 1674, "text": "So you've got this sort of catch 22."}, {"time": 1678, "text": "You can either use an imaging modality that tells you within millimeters which part of the brain is activated, but you don't know when, or you've got these electromagnetic EEG, MEG setups that tell you to within a few milliseconds when something has responded, but you're not aware."}, {"time": 1699, "text": "So you've got these two complementary measures, either indirect via the blood flow, or direct via the electromagnetic signals caused by neural activity."}, {"time": 1711, "text": "These are the two big imaging devices."}, {"time": 1713, "text": "And then the second level of responding to your question, what are the, from the outside, what are the big ways of using this technology?"}, {"time": 1724, "text": "So once you've chosen the kind of neural imaging that you want to use to answer your set questions, and sometimes it would have to be both, then you've got a whole raft of analyses, time series analyses usually, that you can bring to bear in order to answer your questions or address your hypothesis about those data."}, {"time": 1747, "text": "And interestingly, they both fall into the same two camps we were talking about before, this dialectic between specialization and integration, differentiation and integration."}, {"time": 1757, "text": "So it's the cartography, the blobology analyses."}, {"time": 1760, "text": "I apologize, I probably shouldn't interrupt so much, but just heard a fun word, the blah."}, {"time": 1769, "text": "It's a neologism, which means the study of blobs."}, {"time": 1773, "text": "So nothing bob."}, {"time": 1774, "text": "Are you being witty and humorous, or does the word blobology ever appear in a textbook somewhere?"}, {"time": 1780, "text": "It would appear in a popular book."}, {"time": 1783, "text": "It would not appear in a worthy specialist journal."}, {"time": 1787, "text": "Yeah, I thought so."}, {"time": 1788, "text": "It's the fond word for the study of literally little blobs on brain maps showing activations."}, {"time": 1796, "text": "So the kind of thing that you'd see in the newspapers on ABC or BBC reporting the latest finding from brain imaging."}, {"time": 1805, "text": "Interestingly though, the maths involved in that stream of analysis does actually call upon the mathematics of blobs."}, {"time": 1817, "text": "So seriously, they're actually called Euler characteristics and they have a lot of fancy names in mathematics."}, {"time": 1827, "text": "We'll talk about it, about your ideas in free energy principle."}, {"time": 1830, "text": "I mean, there's echoes of blobs there when you consider sort of entities, mathematically speaking."}, {"time": 1840, "text": "Well, circumscribed, well defined, you entities of, well, from the free energy point of view, entities of anything, but from the point of view of the analysis, the cartography of the brain, these are the entities that constitute the evidence for this functional segregation."}, {"time": 1861, "text": "You have segregated this function in this blob and it is not outside of the blob."}, {"time": 1866, "text": "And that's basically the, if you were a map maker of America and you did not know its structure, the first thing were you doing constituting or creating a map would be to identify the cities, for example, or the mountains or the rivers."}, {"time": 1882, "text": "All of these uniquely spatially localizable features, possibly topological features have to be placed somewhere because that requires a mathematics of identifying what does a city look like on a satellite image or what does a river look like or what does a mountain look like?"}, {"time": 1899, "text": "What would it, you know, what data features would evidence that particular top, you know, that particular thing that you wanted to put on the map?"}, {"time": 1910, "text": "And they normally are characterized in terms of literally these blobs or these sort of, another way of looking at this is that a certain statistical measure of the degree of activation crosses a threshold and in crossing that threshold in the spatially restricted part of the brain, it creates a blob."}, {"time": 1931, "text": "And that's basically what statistical parametric mapping does."}, {"time": 1934, "text": "It's basically mathematically finessed blobology."}, {"time": 1939, "text": "Okay, so those are the, you kind of described these two methodologies for, one is temporally noisy, one is spatially noisy and you kind of have to play and figure out what can be useful."}, {"time": 1951, "text": "It'd be great if you can sort of comment."}, {"time": 1953, "text": "I got a chance recently to spend a day at a company called Neuralink that uses brain computer interfaces and their dream is to, well, there's a bunch of sort of dreams, but one of them is to understand the brain by sort of, you know, getting in there past the so called sort of factory wall, getting in there and be able to listen, communicate both directions."}, {"time": 1977, "text": "What are your thoughts about this, the future of this kind of technology of brain computer interfaces to be able to now have a window or direct contact within the brain to be able to measure some of the signals, to be able to sense signals, to understand some of the functionality of the brain?"}, {"time": 1995, "text": "Ambivalent, my sense is ambivalent."}, {"time": 1997, "text": "So it's a mixture of good and bad and I acknowledge that freely."}, {"time": 2002, "text": "So the good bits, if you just look at the legacy of that kind of reciprocal but invasive your brain stimulation, I didn't paint a complete picture when I was talking about sort of the ways we understand the brain prior to neuroimaging."}, {"time": 2017, "text": "It wasn't just lesion deficit studies."}, {"time": 2019, "text": "Some of the early work, in fact, literally 100 years from where we're sitting at the institution of neurology, was done by stimulating the brain of say dogs and looking at how they responded with their muscles or with their salivation and imputing what that part of the brain must be doing."}, {"time": 2040, "text": "If I stimulate it and I vote this kind of response, then that tells me quite a lot about the functional specialization."}, {"time": 2049, "text": "So there's a long history of brain stimulation which continues to enjoy a lot of attention nowadays."}, {"time": 2056, "text": "Positive attention."}, {"time": 2057, "text": "Oh yes, absolutely."}, {"time": 2059, "text": "You know, deep brain stimulation for Parkinson's disease is now a standard treatment and also a wonderful vehicle to try and understand the neuronal dynamics underlying movement disorders like Parkinson's disease."}, {"time": 2073, "text": "Even interest in magnetic stimulation, stimulating the magnetic fields and will it work in people who are depressed, for example."}, {"time": 2083, "text": "Quite a crude level of understanding what you're doing, but there is historical evidence that these kinds of brute force interventions do change things."}, {"time": 2093, "text": "They, you know, it's a little bit like banging the TV when the valves aren't working properly, but it's still, it works."}, {"time": 2100, "text": "So, you know, there is a long history."}, {"time": 2104, "text": "Brain computer interfacing or BCI, I think is a beautiful example of that."}, {"time": 2111, "text": "It's sort of carved out its own niche and its own aspirations and there've been enormous advances within limits."}, {"time": 2120, "text": "Advances in terms of our ability to understand how the brain, the embodied brain, engages with the world."}, {"time": 2132, "text": "I'm thinking here of sensory substitution, the augmenting our sensory capacities by giving ourselves extra ways of sensing and sampling the world, ranging from sort of trying to replace lost visual signals through to giving people completely new signals."}, {"time": 2150, "text": "So, one of the, I think, most engaging examples of this is equipping people with a sense of magnetic fields."}, {"time": 2160, "text": "So you can actually give them magnetic sensors that enable them to feel, should we say, tactile pressure around their tummy, where they are in relation to the magnetic field of the Earth."}, {"time": 2173, "text": "And after a few weeks, they take it for granted."}, {"time": 2177, "text": "They integrate it, they embody this, simulate this new sensory information into the way that they literally feel their world, but now equipped with this sense of magnetic direction."}, {"time": 2189, "text": "So that tells you something about the brain's plastic potential to remodel and its plastic capacity to suddenly try to explain the sensory data at hand by augmenting the sensory sphere and the kinds of things that you can measure."}, {"time": 2211, "text": "Clearly, that's purely for entertainment and understanding the nature and the power of our brains."}, {"time": 2220, "text": "I would imagine that most BCI is pitched at solving clinical and human problems such as locked in syndrome, such as paraplegia, or replacing lost sensory capacities like blindness and deafness."}, {"time": 2238, "text": "So then we come to the negative part of my ambivalence, the other side of it."}, {"time": 2246, "text": "So I don't want to be deflationary because much of my deflationary comments is probably large out of ignorance than anything else."}, {"time": 2257, "text": "But generally speaking, the bandwidth and the bit rates that you get from brain computer interfaces as we currently know them, we're talking about bits per second."}, {"time": 2271, "text": "So that would be like me only being able to communicate with any world or with you using very, very, very slow Morse code."}, {"time": 2286, "text": "And it is not even within an order of magnitude near what we actually need for an inactive realization of what people aspire to when they think about sort of curing people with paraplegia or replacing sight despite heroic efforts."}, {"time": 2310, "text": "So one has to ask, is there a lower bound on the kinds of recurrent information exchange between a brain and some augmented or artificial interface?"}, {"time": 2326, "text": "And then we come back to, interestingly, what I was talking about before, which is if you're talking about function in terms of inference, and I presume we'll get to that later on in terms of the free energy principle, then at the moment, there may be fundamental reasons to assume that is the case."}, {"time": 2346, "text": "We're talking about ensemble activity."}, {"time": 2348, "text": "We're talking about basically, for example, let's paint the challenge facing brain computer interfacing in terms of controlling another system that is highly and deeply structured, very relevant to our lives, very nonlinear, that rests upon the kind of nonequilibrium steady states and dynamics that the brain does, the weather, all right?"}, {"time": 2379, "text": "So imagine you had some very aggressive satellites that could produce signals that could perturb some little parts of the weather system."}, {"time": 2393, "text": "And then what you're asking now is, can I meaningfully get into the weather and change it meaningfully and make the weather respond in a way that I want it to?"}, {"time": 2403, "text": "You're talking about chaos control on a scale which is almost unimaginable."}, {"time": 2454, "text": "It is much more like getting into the weather patterns or, come back to your magic soup, getting into the active matter and meaningfully relate that to the outside world."}, {"time": 2467, "text": "So I think there are enormous challenges there."}, {"time": 2469, "text": "So I think the example of the weather is a brilliant one."}, {"time": 2473, "text": "And I think you paint a really interesting picture and it wasn't as negative as I thought."}, {"time": 2477, "text": "It's essentially saying that it might be incredibly challenging, including the low bound of the bandwidth and so on."}, {"time": 2483, "text": "I kind of, so just to full disclosure, I come from the machine learning world."}, {"time": 2488, "text": "So my natural thought is the hardest part is the engineering challenge of controlling the weather, of getting those satellites up and running and so on."}, {"time": 2497, "text": "And once they are, then the rest is fundamentally the same approaches that allow you to win in the game of Go will allow you to potentially play in this soup, in this chaos."}, {"time": 2511, "text": "So I have a hope that sort of machine learning methods will help us play in this soup."}, {"time": 2518, "text": "But perhaps you're right that it is a biology and the brain is just an incredible system that may be almost impossible to get in."}, {"time": 2532, "text": "But for me, what seems impossible is the incredible mess of blood vessels that you also described without, we also value the brain."}, {"time": 2544, "text": "You can't make any mistakes, you can't damage things."}, {"time": 2547, "text": "So to me, that engineering challenge seems nearly impossible."}, {"time": 2551, "text": "One of the things I was really impressed by at Neuralink is just talking to brilliant neurosurgeons and the roboticists that made me realize that even though it seems impossible, if anyone can do it, it's some of these world class engineers that are trying to take it on."}, {"time": 2570, "text": "So I think the conclusion of our discussion here of this part is basically that the problem is really hard but hopefully not impossible."}, {"time": 2583, "text": "So if it's okay, let's start with the basics."}, {"time": 2587, "text": "So you've also formulated a fascinating principle, the free energy principle."}, {"time": 2593, "text": "Could we maybe start at the basics and what is the free energy principle?"}, {"time": 2599, "text": "Well, in fact, the free energy principle inherits a lot from the building of these data analytic approaches to these very high dimensional time series you get from the brain."}, {"time": 2615, "text": "So I think it's interesting to acknowledge that."}, {"time": 2617, "text": "And in particular, the analysis tools that try to address the other side, which is a functional integration, so the connectivity analyses."}, {"time": 2626, "text": "So on the one hand, but I should also acknowledge it inherits an awful lot from machine learning as well."}, {"time": 2635, "text": "So the free energy principle is just a formal statement that the existential imperatives for any system that manages to survive in a changing world can be cast as an inference problem in the sense that you can interpret the probability of existing as the evidence that you exist."}, {"time": 2665, "text": "And if you can write down that problem of existence as a statistical problem, then you can use all the maths that has been developed for inference to understand and characterize the ensemble dynamics that must be in play in the service of that inference."}, {"time": 2685, "text": "So technically, what that means is you can always interpret anything that exists in virtue of being separate from the environment in which it exists as trying to minimize variational free energy."}, {"time": 2703, "text": "And if you're from the machine learning community, you will know that as a negative evidence lower bound or a negative elbow, which is the same as saying you're trying to maximize or it will look as if all your dynamics are trying to maximize the complement of that which is the marginal likelihood or the evidence for your own existence."}, {"time": 2726, "text": "So that's basically the free energy principle."}, {"time": 2730, "text": "But to even take a sort of a small step backwards, you said the existential imperative."}, {"time": 2738, "text": "There's a lot of beautiful poetic words here, but to put it crudely, it's a fascinating idea of basically just of trying to describe if you're looking at a blob, how do you know this thing is alive?"}, {"time": 2754, "text": "What does it mean to be alive?"}, {"time": 2755, "text": "What does it mean to exist?"}, {"time": 2757, "text": "And so you can look at the brain, you can look at parts of the brain, or this is just a general principle that applies to almost any system."}, {"time": 2767, "text": "That's just a fascinating sort of philosophically at every level question and a methodology to try to answer that question."}, {"time": 2776, "text": "So that's a huge endeavor and it's nice that there's at least some, from some perspective, a clean answer."}, {"time": 2785, "text": "So maybe can you talk about that optimization view of it?"}, {"time": 2790, "text": "So what's trying to be minimized, maximized?"}, {"time": 2793, "text": "A system that's alive, what is it trying to minimize?"}, {"time": 2796, "text": "Right, you've made a big move there."}, {"time": 2800, "text": "First of all, it's good to make big moves."}, {"time": 2805, "text": "But you've assumed that the thing exists in a state that could be living or nonliving."}, {"time": 2814, "text": "So I may ask you, what licenses you to say that something exists?"}, {"time": 2820, "text": "That's why I use the word existential."}, {"time": 2822, "text": "It's beyond living, it's just existence."}, {"time": 2825, "text": "So if you drill down onto the definition of things that exist, then they have certain properties if you borrow the maths from nonequilibrium steady state physics that enable you to interpret their existence in terms of this optimization procedure."}, {"time": 2849, "text": "So it's good you introduced the word optimization."}, {"time": 2852, "text": "So what the free energy principle in its sort of most ambitious, but also most deflationary and simplest, says is that if something exists, then it must, by the mathematics of nonequilibrium steady state, exhibit properties that make it look as if it is optimizing a particular quantity."}, {"time": 2883, "text": "And it turns out that particular quantity happens to be exactly the same as the evidence lower bound in machine learning or Bayesian model evidence in Bayesian statistics."}, {"time": 2895, "text": "Or, and then I can list a whole other list of ways of understanding this key quantity, which is a bound on surprise or self information if you have information theory."}, {"time": 2911, "text": "There are a number of different perspectives on this quantity."}, {"time": 2914, "text": "It's just basically the log probability of being in a particular state."}, {"time": 2920, "text": "I'm telling this story as an honest, an attempt to answer your question."}, {"time": 2925, "text": "And I'm answering it as if I was pretending to be a physicist who was trying to understand the fundaments of nonequilibrium steady state."}, {"time": 2938, "text": "And I shouldn't really be doing that because the last time I was taught physics, I was in my 20s."}, {"time": 2943, "text": "What kind of systems, when you think about the free energy principle, what kind of systems are you imagining as a sort of more specific kind of case study?"}, {"time": 2951, "text": "Yeah, I'm imagining a range of systems, but at its simplest, a single celled organism that can be identified from its eco niche or its environment."}, {"time": 2967, "text": "So at its simplest, that's basically what I always imagined in my head."}, {"time": 2973, "text": "And you may ask, well, is there any, how on earth can you even elaborate questions about the existence of a single drop of oil, for example?"}, {"time": 2988, "text": "But there are deep questions there."}, {"time": 2989, "text": "Why doesn't the oil, why doesn't the thing, the interface between the drop of oil that contains an interior and the thing that is not the drop of oil, which is the solvent in which it is immersed, how does that interface persist over time?"}, {"time": 3007, "text": "Why doesn't the oil just dissolve into solvent?"}, {"time": 3010, "text": "So what special properties of the exchange between the surface of the oil drop and the external states in which it's immersed, if you're a physicist, say it would be the heat bath."}, {"time": 3024, "text": "You've got a physical system, an ensemble again, we're talking about density dynamics, ensemble dynamics, an ensemble of atoms or molecules immersed in the heat bath."}, {"time": 3035, "text": "But the question is, how did the heat bath get there?"}, {"time": 3038, "text": "And why does it not dissolve?"}, {"time": 3041, "text": "How is it maintaining itself?"}, {"time": 3043, "text": "What actions is it?"}, {"time": 3044, "text": "I mean, it's such a fascinating idea of a drop of oil and I guess it would dissolve in water, it wouldn't dissolve in water."}, {"time": 3052, "text": "Precisely, so why not?"}, {"time": 3053, "text": "So why not?"}, {"time": 3055, "text": "And how do you mathematically describe, I mean, it's such a beautiful idea."}, {"time": 3058, "text": "And also the idea of like, where does the thing, where does the drop of oil end and where does it begin?"}, {"time": 3067, "text": "Right, so I mean, you're asking deep questions, deep in a nonmillennial sense here."}, {"time": 3072, "text": "In a hierarchical sense."}, {"time": 3076, "text": "But what you can do, so this is the deflationary part of it."}, {"time": 3081, "text": "Can I just qualify my answer by saying that normally when I'm asked this question, I answer from the point of view of a psychologist, we talk about predictive processing and predictive coding and the brain as an inference machine, but you haven't asked me from that perspective, I'm answering from the point of view of a physicist."}, {"time": 3096, "text": "So the question is not so much why, but if it exists, what properties must it display?"}, {"time": 3104, "text": "So that's the deflationary part of the free energy principle."}, {"time": 3106, "text": "The free energy principle does not supply an answer as to why, it's saying if something exists, then it must display these properties."}, {"time": 3117, "text": "That's the sort of thing that's on offer."}, {"time": 3156, "text": "It is a necessary condition for existence that this must occur because the boundary basically defines the thing that's existing."}, {"time": 3166, "text": "So it is that self assembly aspect it's that you were hinting at in biology, sometimes known as autopoiesis in computational chemistry with self assembly."}, {"time": 3180, "text": "It's the, what does it look like?"}, {"time": 3183, "text": "Sorry, how would you describe things that configure themselves out of nothing?"}, {"time": 3188, "text": "The way they clearly demarcate themselves from the states or the soup in which they are immersed."}, {"time": 3198, "text": "So from the point of view of computational chemistry, for example, you would just understand that as a configuration of a macro molecule to minimize its free energy, its thermodynamic free energy."}, {"time": 3208, "text": "It's exactly the same principle that we've been talking about that thermodynamic free energy is just the negative elbow."}, {"time": 3215, "text": "It's the same mathematical construct."}, {"time": 3218, "text": "So the very emergence of existence, of structure, of form that can be distinguished from the environment or the thing that is not the thing necessitates the existence of an objective function that it looks as if it is minimizing."}, {"time": 3238, "text": "It's finding a free energy minima."}, {"time": 3240, "text": "And so just to clarify, I'm trying to wrap my head around."}, {"time": 3244, "text": "So the free energy principle says that if something exists, these are the properties it should display."}, {"time": 3252, "text": "So what that means is we can't just look, we can't just go into a soup and there's no mechanism."}, {"time": 3261, "text": "Free energy principle doesn't give us a mechanism to find the things that exist."}, {"time": 3265, "text": "Is that what's implying, is being implied that you can kind of use it to reason, to think about like, study a particular system and say, does this exhibit these qualities?"}, {"time": 3280, "text": "That's an excellent question."}, {"time": 3282, "text": "But to answer that, I'd have to return to your previous question about what's the difference between living and nonliving things."}, {"time": 3288, "text": "Yes, well, actually, sorry."}, {"time": 3291, "text": "So yeah, maybe we can go there."}, {"time": 3294, "text": "Maybe we can go there, you kind of drew a line and forgive me for the stupid questions, but you kind of drew a line between living and existing."}, {"time": 3302, "text": "Is there an interesting sort of distinction?"}, {"time": 3307, "text": "Yeah, I think there is."}, {"time": 3309, "text": "So things do exist, grains of sand, rocks on the moon, trees, you."}, {"time": 3319, "text": "So all of these things can be separated from the environment in which they are immersed."}, {"time": 3326, "text": "And therefore, they must at some level be optimizing their free energy, taking this sort of model evidence interpretation of this quantity that basically means they're self evidencing."}, {"time": 3339, "text": "Another nice little twist of phrase here is that you are your own existence proof, statistically speaking, which I don't think I said that, somebody did, but I love that phrase."}, {"time": 3353, "text": "You are your own existence proof."}, {"time": 3355, "text": "Yeah, so it's so existential, isn't it?"}, {"time": 3359, "text": "I'm gonna have to think about that for a few days."}, {"time": 3361, "text": "That's a beautiful line."}, {"time": 3366, "text": "So the step through to answer your question about what's it good for, we'll go along the following lines."}, {"time": 3375, "text": "First of all, you have to define what it means to exist, which now, as you've rightly pointed out, you have to define what probabilistic properties must the states of something possess so it knows where it finishes."}, {"time": 3390, "text": "And then you write that down in terms of statistical dependencies, again, sparsity."}, {"time": 3396, "text": "Again, it's not what's connected or what's correlated or what depends upon, it's what's not correlated and what doesn't depend upon something."}, {"time": 3405, "text": "Again, it comes down to the deep structures, not in this instance, hierarchical, but the structures that emerge from removing connectivity and dependency."}, {"time": 3416, "text": "And in this instance, basically being able to identify the surface of the oil drop from the water in which it is immersed."}, {"time": 3426, "text": "And when you do that, you start to realize, well, there are actually four kinds of states in any given universe that contains anything."}, {"time": 3435, "text": "The things that are internal to the surface, the things that are external to the surface and the surface in and of itself, which is why I use a metaphor, a little single celled organism that has an interior and exterior and then the surface of the cell."}, {"time": 3449, "text": "And that's mathematically a Markov blanket."}, {"time": 3452, "text": "Just to pause, I'm in awe of this concept that there's the stuff outside the surface, stuff inside the surface and the surface itself, the Markov blanket."}, {"time": 3460, "text": "It's just the most beautiful kind of notion about trying to explore what it means to exist mathematically."}, {"time": 3468, "text": "I apologize, it's just a beautiful idea."}, {"time": 3470, "text": "But it came out of California, so that's."}, {"time": 3473, "text": "I changed my mind."}, {"time": 3474, "text": "I take it all back."}, {"time": 3475, "text": "So anyway, so you were just talking about the surface, about the Markov blanket."}, {"time": 3481, "text": "So this surface or these blanket states that are the, because they are now defined in relation to these independencies and what different states internal blanket or external states can, which ones can influence each other and which cannot influence each other."}, {"time": 3507, "text": "You can now apply standard results that you would find in non equilibrium physics or steady state or thermodynamics or hydrodynamics, usually out of equilibrium solutions and apply them to this partition."}, {"time": 3523, "text": "And what it looks like is if all the normal gradient flows that you would associate with any non equilibrium system apply in such a way that part of the Markov blanket and the internal states seem to be hill climbing or doing a gradient descent on the same quantity."}, {"time": 3545, "text": "And that means that you can now describe the very existence of this oil drop."}, {"time": 3553, "text": "You can write down the existence of this oil drop in terms of flows, dynamics, equations of motion, where the blanket states or part of them, we call them active states and the internal states now seem to be and must be trying to look as if they're minimizing the same function, which is a low probability of occupying these states."}, {"time": 3579, "text": "Interesting thing is that what would they be called if you were trying to describe these things?"}, {"time": 3585, "text": "So what we're talking about are internal states, external states and blanket states."}, {"time": 3592, "text": "Now let's carve the blanket states into two sensory states and active states."}, {"time": 3597, "text": "Operationally, it has to be the case that in order for this carving up into different sets of states to exist, the active states, the Markov blanket cannot be influenced by the external states."}, {"time": 3609, "text": "And we already know that the internal states can't be influenced by the external states because the blanket separates them."}, {"time": 3616, "text": "Well, it means the active states, the internal states are now jointly not influenced by external states."}, {"time": 3623, "text": "They only have autonomous dynamics."}, {"time": 3626, "text": "So now you've got a picture of an oil drop that has autonomy, it has autonomous states, it has autonomous states in the sense that there must be some parts of the surface of the oil drop that are not influenced by the external states and all the interior."}, {"time": 3641, "text": "And together, those two states endow even a little oil drop with autonomous states that look as if they are optimizing their variational free energy or their negative elbow, their moral evidence."}, {"time": 3659, "text": "And that would be an interesting intellectual exercise."}, {"time": 3663, "text": "And you could say, you could even go into the realms of panpsychism, that everything that exists is implicitly making inferences on self evidencing."}, {"time": 3673, "text": "Now we make the next move, but what about living things?"}, {"time": 3677, "text": "I mean, so let me ask you, what's the difference between an oil drop and a little tadpole or a little lava or a plankton?"}, {"time": 3687, "text": "The picture was just painted of an oil drop."}, {"time": 3690, "text": "Just immediately in a matter of minutes took me into the world of panpsychism, where you've just convinced me, made me feel like an oil drop is a living, it's certainly an autonomous system, but almost a living system."}, {"time": 3704, "text": "So it has sensory capabilities and acting capabilities and it maintains something."}, {"time": 3710, "text": "So what is the difference between that and something that we traditionally think of as a living system?"}, {"time": 3719, "text": "That it could die or it can't, I mean, yeah, mortality, I'm not exactly sure."}, {"time": 3725, "text": "I'm not sure what the right answer there is because they can move, like movement seems like an essential element to being able to act in the environment, but the oil drop is doing that."}, {"time": 3738, "text": "The oil drop will be moved, but does it in and of itself move autonomously?"}, {"time": 3742, "text": "Well, the surface is performing actions that maintain its structure."}, {"time": 3749, "text": "Yeah, you're being too clever."}, {"time": 3750, "text": "I was, I had in mind a passive little oil drop that's sitting there at the bottom on the top of a glass of water."}, {"time": 3759, "text": "Sure, I guess."}, {"time": 3760, "text": "What I'm trying to say is you're absolutely right."}, {"time": 3762, "text": "You've nailed it."}, {"time": 3764, "text": "It's movement."}, {"time": 3765, "text": "So where does that movement come from?"}, {"time": 3767, "text": "If it comes from the inside, then you've got, I think, something that's living."}, {"time": 3773, "text": "What do you mean from the inside?"}, {"time": 3774, "text": "What I mean is that the internal states that can influence the active states, where the active states can influence, but they're not influenced by the external states, can cause movement."}, {"time": 3787, "text": "So there are two types of oil drops, if you like."}, {"time": 3790, "text": "There are oil drops where the internal states are so random that they average themselves away, and the thing cannot, on average, when you do the averaging, move."}, {"time": 3805, "text": "So a nice example of that would be the Sun."}, {"time": 3809, "text": "The Sun certainly has internal states."}, {"time": 3811, "text": "There's lots of intrinsic autonomous activity going on, but because it's not coordinated, because it doesn't have the deep, in the millennial sense, the hierarchical structure that the brain does, there is no overall mode or pattern or organization that expresses itself on the surface that allows it to actually swim."}, {"time": 3831, "text": "It can certainly have a very active surface, but en masse, at the scale of the actual surface of the Sun, the average position of that surface cannot, in itself, move, because the internal dynamics are more like a hot gas."}, {"time": 3846, "text": "They are literally like a hot gas, whereas your internal dynamics are much more structured and deeply structured, and now you can express on your active states with your muscles and your secretory organs, your autonomic nervous system and its effectors, you can actually move, and that's all you can do."}, {"time": 3866, "text": "And that's something which, if you haven't thought of it like this before, I think it's nice to just realize there is no other way that you can change the universe other than simply moving."}, {"time": 3879, "text": "Whether that moving is articulating with my voice box or walking around or squeezing juices out of my secretory organs, there's only one way you can change the universe."}, {"time": 3893, "text": "And the fact that you do so nonrandomly makes you alive."}, {"time": 3898, "text": "Yeah, so it's that nonrandomness."}, {"time": 3900, "text": "And that would be manifested, we realize, in terms of essentially swimming, essentially moving, changing one's shape, a morphogenesis that is dynamic and possibly adaptive."}, {"time": 3915, "text": "So that's what I was trying to get at between the difference between the oil drop and the little tadpole."}, {"time": 3921, "text": "The tadpole is moving around."}, {"time": 3923, "text": "Its active states are actually changing the external states."}, {"time": 3926, "text": "And there's now a cycle, an action perception cycle, if you like, a recurrent dynamic that's going on that depends upon this deeply structured autonomous behavior that rests upon internal dynamics that are not only modeling the data impressed upon their surface or the blanket states, but they are actively resampling those data by moving."}, {"time": 3958, "text": "They're moving towards chemical gradients and chemotaxis."}, {"time": 3963, "text": "So they've gone beyond just being good little models of the kind of world they live in."}, {"time": 3971, "text": "For example, an oil droplet could, in a panpsychic sense, be construed as a little being that has now perfectly inferred."}, {"time": 3980, "text": "It's a passive, nonliving oil drop living in a bowl of water."}, {"time": 3987, "text": "But to now equip that oil drop with the ability to go out and test that hypothesis about different states of beings."}, {"time": 3994, "text": "So it can actually push its surface over there, over there, and test for chemical gradients, or then you start to move to a much more lifelike form."}, {"time": 4002, "text": "This is all fun, theoretically interesting, but it actually is quite important in terms of reflecting what I have seen since the turn of the millennium, which is this move towards an inactive and embodied understanding of intelligence."}, {"time": 4020, "text": "And you say you're from machine learning."}, {"time": 4023, "text": "So what that means, the central importance of movement, I think has yet to really hit machine learning."}, {"time": 4034, "text": "It certainly has now diffused itself throughout robotics."}, {"time": 4040, "text": "And perhaps you could say certain problems in active vision where you actually have to move the camera to sample this and that."}, {"time": 4047, "text": "But machine learning of the data mining deep learning sort simply hasn't contended with this issue."}, {"time": 4054, "text": "What it's done, instead of dealing with the movement problem and the active sampling of data, it's just said, we don't need to worry about, we can see all the data because we've got big data."}, {"time": 4063, "text": "So we can ignore movement."}, {"time": 4065, "text": "So that for me is an important omission in current machine learning."}, {"time": 4072, "text": "The current machine learning is much more like the oil drop."}, {"time": 4075, "text": "But an oil drop that enjoys exposure to nearly all the data that it will ever need to be exposed to, as opposed to the tadpoles swimming out to find the right data."}, {"time": 4087, "text": "For example, it likes food."}, {"time": 4090, "text": "That's a good hypothesis."}, {"time": 4091, "text": "Let's test it out."}, {"time": 4092, "text": "Let's go and move and ingest food, for example, and see is that evidence that I'm the kind of thing that likes this kind of food."}, {"time": 4100, "text": "So the next natural question, and forgive this question, but if we think of sort of even artificial intelligence systems, which I just painted a beautiful picture of existence and life."}, {"time": 4112, "text": "So do you ascribe, do you find within this framework a possibility of defining consciousness or exploring the idea of consciousness?"}, {"time": 4127, "text": "Like what, you know, self awareness and expand it to consciousness?"}, {"time": 4136, "text": "How can we start to think about consciousness within this framework?"}, {"time": 4140, "text": "Well, yeah, I think it's possible to think about it, whether you'll get it."}, {"time": 4144, "text": "Get anywhere is another question."}, {"time": 4146, "text": "And again, I'm not sure that I'm licensed to answer that question."}, {"time": 4152, "text": "I think you'd have to speak to a qualified philosopher to get a definitive answer to that."}, {"time": 4157, "text": "But certainly, there's a lot of interest in using not just these ideas, but related ideas from information theory to try and tie down the maths and the calculus and the geometry of consciousness, either in terms of sort of a minimal consciousness, even less than a minimal selfhood."}, {"time": 4182, "text": "And what I'm talking about is the ability, effectively, to plan, to have agency."}, {"time": 4192, "text": "So you could argue that a virus does have a form of agency in virtue of the way that it selectively finds hosts and cells to live in and moves around."}, {"time": 4205, "text": "But you wouldn't endow it with the capacity to think about planning and moving in a purposeful way where it countenances the future."}, {"time": 4217, "text": "Whereas you might an ant."}, {"time": 4218, "text": "You might think an ant's not quite as unconscious as a virus."}, {"time": 4224, "text": "It certainly seems to have a purpose."}, {"time": 4226, "text": "It talks to its friends en route during its foraging."}, {"time": 4229, "text": "It has a different kind of autonomy, which is biotic, but beyond a virus."}, {"time": 4238, "text": "So there's something about, so there's some line that has to do with the complexity of planning that may contain an answer."}, {"time": 4248, "text": "I mean, it would be beautiful if we can find a line beyond which we could say a being is conscious."}, {"time": 4255, "text": "Yes, it will be."}, {"time": 4256, "text": "These are wonderful lines that we've drawn with existence, life, and consciousness."}, {"time": 4262, "text": "Yes, it will be very nice."}, {"time": 4265, "text": "One little wrinkle there, and this is something I've only learned in the past few months, is the philosophical notion of vagueness."}, {"time": 4272, "text": "So you're saying it would be wonderful to draw a line."}, {"time": 4274, "text": "I had always assumed that that line at some point would be drawn until about four months ago, and the philosopher taught me about vagueness."}, {"time": 4284, "text": "So I don't know if you've come across this, but it's a technical concept."}, {"time": 4288, "text": "And I think most revealingly illustrated with, at what point does a pile of sand become a pile?"}, {"time": 4297, "text": "Is it one grain, two grains, three grains, or four grains?"}, {"time": 4301, "text": "So at what point would you draw the line between being a pile of sand and a collection of grains of sand?"}, {"time": 4311, "text": "In the same way, is it right to ask, where would I draw the line between conscious and unconscious?"}, {"time": 4316, "text": "And it might be a vague concept."}, {"time": 4319, "text": "Having said that, I agree with you entirely."}, {"time": 4322, "text": "Systems that have the ability to plan."}, {"time": 4326, "text": "So just technically, what that means is your inferential self evidencing, by which I simply mean the thermodynamics and gradient flows that underwrite the preservation of your oil droplet like form, can be described as an optimization of log Bayesian model evidence, your elbow."}, {"time": 4356, "text": "That self evidencing must be evidence for a model of what's causing the sensory impressions on the sensory part of your surface or your Markov blanket."}, {"time": 4368, "text": "If that model is capable of planning, it must include a model of the future consequences of your active states or your action, just planning."}, {"time": 4376, "text": "So we're now in the game of planning as inference."}, {"time": 4379, "text": "Now notice what we've made, though."}, {"time": 4380, "text": "We've made quite a big move away from big data and machine learning, because again, it's the consequences of moving."}, {"time": 4388, "text": "It's the consequences of selecting those data or those data or looking over there."}, {"time": 4394, "text": "And that tells you immediately that even to be a contender for a conscious artifact or a strong AI or generalized, I don't know what that's called nowadays, then you've got to have movement in the game."}, {"time": 4409, "text": "And furthermore, you've got to have a generative model of the sort you might find in, say, a variational auto encoder that is thinking about the future conditioned upon different courses of action."}, {"time": 4421, "text": "Now that brings a number of things to the table, which now you start to think, well, those have got all the right ingredients to talk about consciousness."}, {"time": 4428, "text": "I've now got to select among a number of different courses of action into the future as part of planning."}, {"time": 4434, "text": "I've now got free will."}, {"time": 4436, "text": "The act of selecting this course of action or that policy or that policy or that action suddenly makes me into an inference machine, a self evidencing artifact that now looks as if it's selecting amongst different alternative ways forward, as I actively swim here or swim there or look over here, look over there."}, {"time": 4457, "text": "So I think you've now got to a situation if there is planning in the mix."}, {"time": 4462, "text": "You're now getting much closer to that line if that line were ever to exist."}, {"time": 4467, "text": "I don't think it gets you quite as far as self aware, though."}, {"time": 4472, "text": "And then you have to, I think, grapple with the question, how would formally write down a calculus or a maths of self awareness?"}, {"time": 4484, "text": "I don't think it's impossible to do."}, {"time": 4487, "text": "But I think there would be pressure on you to actually commit to a formal definition of what you mean by self awareness."}, {"time": 4495, "text": "I think most people that I know would probably say that a goldfish, a pet fish, was not self aware."}, {"time": 4507, "text": "They would probably argue about their favorite cat, but would be quite happy to say that their mom was self aware."}, {"time": 4515, "text": "I mean, but that might very well connect to some level of complexity with planning."}, {"time": 4520, "text": "It seems like self awareness is essential for complex planning."}, {"time": 4527, "text": "Do you want to take that further?"}, {"time": 4528, "text": "Because I think you're absolutely right."}, {"time": 4529, "text": "Again, the line is unclear, but it seems like integrating yourself into the world, into your planning, is essential for constructing complex plans."}, {"time": 4543, "text": "So mathematically describing that in the same elegant way as you have with the free energy principle might be difficult."}, {"time": 4553, "text": "I don't think that, well, perhaps we should just, can we just go back?"}, {"time": 4557, "text": "That's a very important answer you gave."}, {"time": 4558, "text": "And I think if I just unpacked it, you'd see the truisms that you've just exposed for us."}, {"time": 4566, "text": "But let me, sorry, I'm mindful that I didn't answer your question before."}, {"time": 4571, "text": "Well, what's the free energy principle good for?"}, {"time": 4573, "text": "Is it just a pretty theoretical exercise to explain nonequilibrium steady states?"}, {"time": 4577, "text": "Yes, it is."}, {"time": 4579, "text": "It does nothing more for you than that."}, {"time": 4581, "text": "It can be regarded, it's going to sound very arrogant, but it is of the sort of theory of natural selection, or a hypothesis of natural selection."}, {"time": 4592, "text": "Beautiful, undeniably true, but tells you absolutely nothing about why you have legs and eyes."}, {"time": 4602, "text": "It tells you nothing about the actual phenotype, and it wouldn't allow you to build something."}, {"time": 4608, "text": "So the free energy principle by itself is as vacuous as most tautological theories."}, {"time": 4614, "text": "And by tautological, of course, I'm talking to the theory of natural, the survival of the fittest."}, {"time": 4620, "text": "What's the fittest of those that survive?"}, {"time": 4621, "text": "Why do they cycle?"}, {"time": 4622, "text": "It's the fitter."}, {"time": 4623, "text": "It just goes around in circles."}, {"time": 4625, "text": "In a sense, the free energy principle has that same deflationary tautology under the hood."}, {"time": 4635, "text": "It's a characteristic of things that exist."}, {"time": 4637, "text": "Why do they exist?"}, {"time": 4638, "text": "Because they minimize their free energy."}, {"time": 4639, "text": "Why do they minimize their free energy?"}, {"time": 4641, "text": "Because they exist."}, {"time": 4642, "text": "And you just keep on going round and round and round."}, {"time": 4644, "text": "But the practical thing, which you don't get from natural selection, but you could say has now manifest in things like differential evolution or genetic algorithms and MCMC, for example, in machine learning."}, {"time": 4695, "text": "So you should be able to write down oil droplets."}, {"time": 4698, "text": "You should be able to create artifacts where you have supplied the objective function that supplies the gradients, that supplies the self organizing dynamics to non equilibrium steady state."}, {"time": 4710, "text": "So there is actually a practical application of the free energy principle when you can write down your required evidence in terms of, well, when you can write down the generative model that is the thing that has the evidence."}, {"time": 4724, "text": "The probability of these sensory data or this data, given that model, is effectively the thing that the elbow or the variational free energy bounds or approximates."}, {"time": 4737, "text": "That means that you can actually write down the model and the kind of thing that you want to engineer, the kind of AGI or artificial general intelligence that you want to manifest probabilistically, and then you engineer, a lot of hard work, but you would engineer a robot and a computer to perform a gradient descent on that objective function."}, {"time": 4763, "text": "So it does have a practical implication."}, {"time": 4766, "text": "Now, why am I wittering on about that?"}, {"time": 4767, "text": "It did seem relevant to, yes."}, {"time": 4768, "text": "So what kinds of, so the answer to, would it be easier or would it be hard?"}, {"time": 4774, "text": "Well, mathematically, it's easy."}, {"time": 4776, "text": "I've just told you all you need to do is write down your perfect artifact, probabilistically, in the form of a probabilistic generative model, a probability distribution over the causes and consequences of the world in which this thing is immersed."}, {"time": 4794, "text": "And then you just engineer a computer and a robot to perform a gradient descent on that objective function."}, {"time": 4802, "text": "But of course, the big problem is writing down the generative model."}, {"time": 4805, "text": "So that's where the heavy lifting comes in."}, {"time": 4808, "text": "So it's the form and the structure of that generative model which basically defines the artifact that you will create or, indeed, the kind of artifact that has self awareness."}, {"time": 4819, "text": "So that's where all the hard work comes, very much like natural selection doesn't tell you in the slightest why you have eyes."}, {"time": 4827, "text": "So you have to drill down on the actual phenotype, the actual generative model."}, {"time": 4831, "text": "So with that in mind, what did you tell me that tells me immediately the kinds of generative models I would have to write down in order to have self awareness?"}, {"time": 4843, "text": "What you said to me was I have to have a model that is effectively fit for purpose for this kind of world in which I operate."}, {"time": 4853, "text": "And if I now make the observation that this kind of world is effectively largely populated by other things like me, i.e."}, {"time": 4859, "text": "you, then it makes enormous sense that if I can develop a hypothesis that we are similar kinds of creatures, in fact, the same kind of creature, but I am me and you are you, then it becomes, again, mandated to have a sense of self."}, {"time": 4881, "text": "So if I live in a world that is constituted by things like me, basically a social world, a community, then it becomes necessary now for me to infer that it's me talking and not you talking."}, {"time": 4894, "text": "I wouldn't need that if I was on Mars by myself or if I was in the jungle as a feral child."}, {"time": 4900, "text": "If there was nothing like me around, there would be no need to have an inference at a hypothesis, oh yes, it is me that is experiencing or causing these sounds and it is not you."}, {"time": 4912, "text": "It's only when there's ambiguity in play induced by the fact that there are others in that world."}, {"time": 4918, "text": "So I think that the special thing about self aware artifacts is that they have learned to, or they have acquired, or at least are equipped with, possibly by evolution, generative models that allow for the fact there are lots of copies of things like them around, and therefore they have to work out it's you and not me."}, {"time": 4943, "text": "I've never thought of that."}, {"time": 4944, "text": "I never thought of that, that the purpose of the really usefulness of consciousness or self awareness in the context of planning existing in the world is so you can operate with other things like you, and like you could, it doesn't have to necessarily be human."}, {"time": 4960, "text": "It could be other kind of similar creatures."}, {"time": 4963, "text": "Absolutely, well, we view a lot of our attributes into our pets, don't we?"}, {"time": 4967, "text": "Or we try to make our robots humanoid."}, {"time": 4969, "text": "And I think there's a deep reason for that, that it's just much easier to read the world if you can make the simplifying assumption that basically you're me, and it's just your turn to talk."}, {"time": 4980, "text": "I mean, when we talk about planning, when you talk specifically about planning, the highest, if you like, manifestation or realization of that planning is what we're doing now."}, {"time": 4989, "text": "I mean, the human condition doesn't get any higher than this talking about the philosophy of existence and the conversation."}]}]