[{"title": "Travis Oliphant: NumPy, SciPy, Anaconda, Python & Scientific Programming | Lex Fridman Podcast #224", "id": "gFEE3w7F0ww", "quotes": [{"time": 252, "text": "And so I did great at timetables."}, {"time": 254, "text": "I said, oh, I'm good at math."}, {"time": 255, "text": "But I started to really like math, just the problem solving aspect."}, {"time": 260, "text": "And so computing was problem solving applied."}, {"time": 265, "text": "And so that's always kind of been the draw, kind of coupled with the mathematics."}, {"time": 270, "text": "Did you ever see the computer as like an extension of your mind, like something able to achieve?"}, {"time": 276, "text": "Not till later."}, {"time": 278, "text": "Yeah, not then."}, {"time": 279, "text": "It's just like a little set of puzzles that you can play with and you can play with math puzzles."}, {"time": 283, "text": "Yeah, it was too rudimentary early on."}, {"time": 286, "text": "Like it was sort of, yeah, it was a lot of work to actually take a thought you'd have and actually get it implemented."}, {"time": 293, "text": "And that's still work, but it's getting easier."}, {"time": 296, "text": "And so yeah, I would say that's definitely what's attracting me to Python is that that was more real, right?"}, {"time": 302, "text": "I could think in Python."}, {"time": 304, "text": "Speaking of foreign language, I only speak another language fluently besides English, which is Spanish."}, {"time": 309, "text": "And I remember the day when I would dream in Spanish and you start to think in that language."}, {"time": 313, "text": "And then you actually, I do definitely believe that language limits or expands your thinking."}, {"time": 319, "text": "There's some languages that actually lead you to certain thought processes."}, {"time": 323, "text": "Yeah, like, so I speak Russian fluently and that's certainly a language that leads you down certain thought processes."}, {"time": 333, "text": "Well, yeah, I mean, there's a history of the two world wars of millions of people starving to death or near to death throughout its history of suffering, of injustice, like this promise sold to the people and then the carpet or whatever is swept from under them."}, {"time": 353, "text": "And it's like broken promises."}, {"time": 354, "text": "And all of that pain and melancholy is in the language, the sad songs, the sad hopeful songs, the over romanticized, like, I love you, I hate you, the sort of the swings between all the various spectrums of emotion, so that's all within the language."}, {"time": 373, "text": "The way it's twisted, there's a strong culture of rhyming poetry, so like the bards, like the sync, there's a musicality to the language too."}, {"time": 384, "text": "Did Dostoevsky write in Russian?"}, {"time": 387, "text": "Yeah, so like Dostoevsky, Tostoy, all the, all the."}, {"time": 392, "text": "The ones that I know about, which are translated and I'm curious how the translations."}, {"time": 396, "text": "So Dostoevsky did not use the musicality of the language too much."}, {"time": 402, "text": "So it actually translates pretty well because it's so philosophically dense that the story does a lot of the work, but there's a bunch of things that are untranslatable."}, {"time": 411, "text": "Certainly the poetry is not translatable."}, {"time": 413, "text": "I actually have a few conversations coming up offline and also in this podcast with people who've translated Dostoevsky."}, {"time": 421, "text": "And that's for people who worked, who work in this field, know how difficult that is."}, {"time": 427, "text": "Sometimes you can spend months thinking about a single sentence, right?"}, {"time": 432, "text": "In context, like, cause there's just the magic captured by that sentence and how do you translate just in the right way?"}, {"time": 438, "text": "Because those words can be really powerful."}, {"time": 442, "text": "There's a famous line, beauty will save the world from Dostoevsky."}, {"time": 447, "text": "You know, there's so many ways to translate that."}, {"time": 449, "text": "And you're right, the language gives you the tools with which to tell the story, but it also leads your mind down certain trajectories and paths to where over time, as you think in that language, you become a different human being."}, {"time": 463, "text": "Yeah, that's a fascinating reality, I think."}, {"time": 465, "text": "I know people have explored that, but it's just rediscovered."}, {"time": 469, "text": "Well, we don't, we live in our own like little pockets."}, {"time": 472, "text": "Like this is the sad thing is I feel like unfortunately, given time and given getting older, I'll never know China, the Chinese world, because I don't truly know the language."}, {"time": 485, "text": "Same with Japanese, I don't truly know Japanese and Portuguese and Brazil, that whole South American continent."}, {"time": 492, "text": "Like, yeah, I'll go to Brazil and Argentina, but will I truly understand the people if I don't understand the language?"}, {"time": 498, "text": "It's sad because I wonder how much, how many geniuses were missing because so much of the scientific world, so much of the technical world is in English, and so much of it might be lost because it's just we don't have the common language."}, {"time": 516, "text": "I'm very much in that vein of there's a lot of genius out there that we miss, and it's sort of fortunate when it bubbles up into something that we can understand or process, there's a lot we miss."}, {"time": 530, "text": "So I tend to lean towards really loving democratization or things that empower people or very resistant sort of authoritarian structures."}, {"time": 540, "text": "Fundamentally for that reason, well, several reasons, but it just hurts us."}, {"time": 544, "text": "We're soft."}, {"time": 546, "text": "So speaking of languages that empower you, so Python was the first language for me that I really enjoyed thinking in, as you said."}, {"time": 556, "text": "Sounds like you shared my experience too."}, {"time": 558, "text": "So when did you first, do you remember when you first kind of connected with Python, maybe even fell in love with Python?"}, {"time": 564, "text": "It was a process."}, {"time": 565, "text": "It took about a year."}, {"time": 566, "text": "I first encountered Python in 1997."}, {"time": 569, "text": "I was a graduate student studying biomedical engineering at the Mayo Clinic."}, {"time": 572, "text": "And I had previously, I'd been involved in taking information from satellites."}, {"time": 579, "text": "I was an electrical engineering student used to taking information and trying to get something out of it, doing some data processing, getting information out of it."}, {"time": 586, "text": "And I'd done that in MATLAB."}, {"time": 587, "text": "I'd done that in Perl."}, {"time": 589, "text": "I'd done that in scripting on a VMS."}, {"time": 592, "text": "There's actually a VAX VMS system, they had their own little scripting tools around Fortran."}, {"time": 597, "text": "Done a lot of that."}, {"time": 598, "text": "And then as a graduate student, I was looking for something and encountered Python."}, {"time": 604, "text": "And because Python had an array, had two things that made me not filter it away."}, {"time": 609, "text": "Because I was filtering a bunch of stuff, as Yorick, I looked at Yorick, I looked at a few other languages that are out there at the time in 1997, but it had arrays."}, {"time": 617, "text": "There's a library called Numeric that had just been written in 95, like not very, not too much earlier."}, {"time": 623, "text": "By an MIT alum, Jim Huganen."}, {"time": 626, "text": "You know, and I went back and read the mailing list to see the history of how it grew."}, {"time": 630, "text": "And there was a very interesting, it's fascinating to do that actually, to see how this emergent cooperation, unstructured cooperation happens in the open source world that led to a lot of this collective programming, which is something maybe we might get into a little later, but what that looks like."}, {"time": 646, "text": "What gap did Numeric fill?"}, {"time": 648, "text": "Numeric filled the gap of having an array object."}, {"time": 650, "text": "There was no array object."}, {"time": 651, "text": "There was no array."}, {"time": 652, "text": "There was a one dimensional byte concept, but there was no n dimensional, two, three, four dimensional tensor they call it now."}, {"time": 660, "text": "I'm still in the category that a tensor is another thing and it's just an ndarray we should call it, but kind of lost that battle."}, {"time": 668, "text": "There's many battles in this world, some of which we win, some we lose."}, {"time": 673, "text": "So, but it had no math to it."}, {"time": 677, "text": "So Numeric had math and a basic way to think in arrays."}, {"time": 680, "text": "So I was looking for that, and it had complex numbers, a lot of programming languages."}, {"time": 686, "text": "And you can see it because, if you're just a computer scientist, you think, ah, complex numbers are just two floats."}, {"time": 692, "text": "So you can, people can build that on."}, {"time": 694, "text": "But in practice, a complex number as one of the significant algebras that helps connect a lot of physical and mathematical ideas, particularly FFT for an electrical engineer."}, {"time": 705, "text": "And it's a really important concept and not having it means you have to develop it several times and those times may not share an approach."}, {"time": 714, "text": "One of the common things in programming, one of the things programming enables is abstractions."}, {"time": 719, "text": "But when you have shared abstractions, it's even better."}, {"time": 721, "text": "It sort of gets to the level of language of actually we all think of this the same way, which is both powerful and dangerous, right?"}, {"time": 727, "text": "Because powerful in that we now can quickly make bigger and higher level things on top of those abstractions dangerous because it also limits us as to the things we maybe left behind in producing that abstraction, which is at the heart of programming today and actually building around the programming world."}, {"time": 744, "text": "I think it's a fascinating philosophical topic."}, {"time": 746, "text": "Yeah, they will continue for many years, I think."}, {"time": 748, "text": "They'll continue for many years."}, {"time": 749, "text": "As we build more and more and more abstractions."}, {"time": 751, "text": "Yes, I often think about, you know, we have a world that's built on these abstractions that were they the only ones possible?"}, {"time": 757, "text": "Certainly not, but they led to, you know, it's very hard to do it differently."}, {"time": 762, "text": "Like there's an inertia that's very hard to, you know, push out, push away from."}, {"time": 767, "text": "That has implications for things like, you know, the Julia language, which you have heard of, I'm sure."}, {"time": 772, "text": "And I've met the creators and I liked Julia."}, {"time": 775, "text": "It's a really cool language, but they struggled to kind of against the, just the tide of like this inertia of people using Python."}, {"time": 783, "text": "And, you know, there's strategies to approach that, but nonetheless, it's a phenomena."}, {"time": 787, "text": "And sometimes, so I love complex numbers and I love to raise, so I looked at Python."}, {"time": 792, "text": "And then I had the experience, I did some stuff in Python and I was just doing my PhD."}, {"time": 796, "text": "So I was out, my focus was on, I was actually doing a combination of MRI and ultrasound and looking at a phenomenon called elastography, which is you push waves into the body and observe those waves, like you can actually measure them."}, {"time": 810, "text": "And then you do mathematical inversion to see what the elasticity is."}, {"time": 815, "text": "And so that's the problem I was solving is how to do that with both ultrasound and MRI."}, {"time": 819, "text": "I needed some tool to do that with."}, {"time": 821, "text": "So I was starting to use Python in 97."}, {"time": 824, "text": "In 98, I went back, looked at what I'd written and realized I could still understand it, which is not the experience I'd had when doing Perl in 95, right?"}, {"time": 833, "text": "I'd done the same thing and then I looked back and I forgotten what I was even saying."}, {"time": 838, "text": "Now, you know, I'm not saying, so that may, hey, this may work, I like this."}, {"time": 842, "text": "This is something I can retain without becoming an expert per se."}, {"time": 847, "text": "And so that led me to go, I'm gonna push more into this."}, {"time": 850, "text": "And then that 98 was kind of when I started to fall in love with Python, I would say."}, {"time": 858, "text": "A few peculiar things about Python."}, {"time": 860, "text": "So maybe compare it to Perl, compare it to some of the other languages."}, {"time": 864, "text": "So there's no braces."}, {"time": 867, "text": "So space is used, indentation, I should say, is used as part of the language."}, {"time": 875, "text": "So did you, I mean, that's quite a leap."}, {"time": 879, "text": "Were you comfortable with that leap or were you just very open minded?"}, {"time": 883, "text": "I was open minded, so I was cognizant of the concern."}, {"time": 888, "text": "And it definitely has, it has specific challenges."}, {"time": 892, "text": "You know, cut and pasting."}, {"time": 893, "text": "For example, when you're cut and pasting code, and if your editors aren't supportive of that, if you're putting it into a terminal, and particularly in the past when terminals didn't necessarily have the intelligence to manage it now."}, {"time": 903, "text": "Now, I, Python, and Jupyter Notebooks handle that just fine, so there's really no problem."}, {"time": 906, "text": "But in the past, it created some challenges, formatting challenges, also mixed tabs and spaces."}, {"time": 912, "text": "If editors weren't, you weren't clear on what was happening, you would have these issues."}, {"time": 916, "text": "So there were really concrete reasons about it that I heard and understood."}, {"time": 920, "text": "I never really encountered a problem with it personally."}, {"time": 923, "text": "Like, it was occasional annoyances, but I really liked the fact that it didn't have all this extra characters, right?"}, {"time": 931, "text": "That these extra characters didn't show up in my visual field when I was just trying to process understanding a snippet of code."}, {"time": 938, "text": "Yeah, there's a cleanness to it."}, {"time": 939, "text": "But, I mean, the idea is supposed to be that Perl also has a cleanness to it because of the minimalism of how many characters it takes to express a certain thing."}, {"time": 948, "text": "So it's very compact."}, {"time": 949, "text": "But what you realize with that compactness comes, there's a culture that prizes compactness, and so the code gets more and more compact and less and less readable to a point where it's like, like, to be a good programmer in Perl, you write code that's basically unreadable."}, {"time": 967, "text": "There's a culture, like."}, {"time": 969, "text": "Correct, and you're proud of it."}, {"time": 970, "text": "Yeah, you're proud of it."}, {"time": 972, "text": "Right, exactly, and it's like, feels good."}, {"time": 974, "text": "And it's really selective."}, {"time": 976, "text": "It means you have to be an expert in Perl to understand it."}, {"time": 980, "text": "Whereas Python allowed you not to have to be an expert."}, {"time": 982, "text": "You didn't have to take all this brain energy."}, {"time": 984, "text": "You could leverage, what I say, you could leverage your English language center, which you're using all the time."}, {"time": 989, "text": "I've wondered about other languages, particularly non Latin based languages."}, {"time": 994, "text": "Latin based languages with the characters are at least similar."}, {"time": 997, "text": "I think people have an easier time, but I don't know what it's like to be a Japanese or a Chinese person trying to learn different syntax."}, {"time": 1006, "text": "Like, what would computer programming look like in that?"}, {"time": 1009, "text": "I haven't looked at that at all, but it certainly doesn't, you know, leveraging your Chinese language center, I'm not sure Python or any programming does that."}, {"time": 1017, "text": "But that was a big deal."}, {"time": 1018, "text": "The fact that it was accessible, I could be a scientist."}, {"time": 1020, "text": "What I really liked is many programming languages really demand a lot of you, and you can get a lot, you know, you do a lot if you learn it."}, {"time": 1027, "text": "But Python enables you to do a lot without demanding a lot of you."}, {"time": 1031, "text": "There's nuance to that statement, but it certainly was, it's more accessible."}, {"time": 1035, "text": "So more people could actually, as a scientist, as somebody who, or an engineer, who was trying to solve another problem besides point programming, I could still use this language and get things done and be happy about it."}, {"time": 1047, "text": "And I was also comfortable in C at that time."}, {"time": 1050, "text": "And MATLAB, you did a little bit of that."}, {"time": 1051, "text": "And MATLAB, I did a lot before that, exactly."}, {"time": 1053, "text": "So I was comfortable in, those three languages were really the tools I used during my studies and schooling."}, {"time": 1060, "text": "But to your point about language helping you think, one of the big things about MATLAB was it was, and APL before it, I don't know if you remember APL."}, {"time": 1068, "text": "APL is actually the predecessor of array based programming, which I think is really an underappreciated, if I talk to people who are just steeped in computer programming, computer science, like most of the people that Microsoft has hired in the past, for example, Microsoft as a company generally did not understand array based programming."}, {"time": 1085, "text": "Like culturally, they didn't understand it."}, {"time": 1086, "text": "So they kept missing the boat, kept missing the understanding of what this was."}, {"time": 1091, "text": "They've gotten better, but there's still a whole culture of folks that doesn't, programming, that's systems programming or web programming or lists and maps."}, {"time": 1100, "text": "And what about an n dimensional array?"}, {"time": 1102, "text": "Oh yeah, that's just an implementation detail."}, {"time": 1104, "text": "Well, you can think that, but then actually if you have that as a construct, you actually think differently."}, {"time": 1109, "text": "APL was the first language to understand that."}, {"time": 1111, "text": "And it was in the sixties, right?"}, {"time": 1113, "text": "The challenge of APL is APL had very dense, not only glyphs, like new characters, new glyphs, but they even had a new keyboard because to produce those glyphs, this is back in the early days in computing when the QWERTY keyboard maybe wasn't as established, like, well, we can have a new keyboard, no big deal."}, {"time": 1130, "text": "But it was a big deal and it didn't catch on."}, {"time": 1132, "text": "And the language APL, very much like Perl, as people would pride themselves on how much, could they write the game of life in 30 characters of APL."}, {"time": 1143, "text": "APL has characters that mean summation and they have adverbs, they would have adjectives and these things called adverbs, which are like methods, like reduction, reduction would be an adverb on an ad operator, right?"}, {"time": 1155, "text": "So, but doing, using these tools you could construct and then you start to think at that level, you think in n dimensions is something I like to say, and you start to think differently about data at that point."}, {"time": 1165, "text": "Now you're, it really helps."}, {"time": 1167, "text": "Yeah, I mean, outside of programming, if you really internalize linear algebra as a course, I mean, it's philosophically allows you to think of the world differently."}, {"time": 1177, "text": "It's almost like liberating, you don't have to, you don't have to think about the individual numbers in the n dimensional array."}, {"time": 1184, "text": "You could think of it as an object in itself and all of a sudden this world can open up."}, {"time": 1188, "text": "You're saying MATLAB and APL were like the early C, I don't know if many languages got that right ever."}, {"time": 1194, "text": "No, no, no they didn't."}, {"time": 1197, "text": "Even still, I would say."}, {"time": 1198, "text": "I mean, NumPy is an inheritor of the traditions that I would say APLJ was another version that was, what it did is not have the glyphs, just have short characters, but still a Latin keyboard could type them."}, {"time": 1211, "text": "And then numeric inherited from that in terms of let's add arrays plus broadcasting plus methods, reduction, even some of the language like rank is a concept that was in Python and is still in Python for the number of dimensions, right?"}, {"time": 1227, "text": "That's different than say the rank of a matrix which people think of as well."}, {"time": 1231, "text": "So it came from that tradition, but NumPy is a very pragmatic, practical tool."}, {"time": 1237, "text": "NumPy inherited from numeric and we can get to where NumPy came from which is the current array, at least current as of 2015, 2017."}, {"time": 1246, "text": "Now there's a ton of them over the past two or three years."}, {"time": 1249, "text": "We can get into that too."}, {"time": 1250, "text": "So if we just linger on the early days of what was your favorite feature of Python?"}, {"time": 1256, "text": "Do you remember like what?"}, {"time": 1258, "text": "So it's so interesting to linger on like the, what really makes you connect with a language?"}, {"time": 1266, "text": "I'm not sure it's obvious to introspect that."}, {"time": 1269, "text": "No, it isn't."}, {"time": 1270, "text": "And I've thought about that at some length."}, {"time": 1272, "text": "I think definitely the fact that I could read it later, that I could use it productively without becoming an expert."}, {"time": 1279, "text": "Other language I had to put more effort into."}, {"time": 1282, "text": "That's like an empirical observation."}, {"time": 1283, "text": "Like you're not analyzing any one aspect of the language."}, {"time": 1286, "text": "It just seems time after time when you look back, it's somehow readable."}, {"time": 1290, "text": "It's somehow readable."}, {"time": 1291, "text": "Then it was sort of, I could take executable English and translate it to Python more easily."}, {"time": 1296, "text": "Like I didn't have to go, there was no translation layer."}, {"time": 1299, "text": "As an engineer or as a scientist, I could think about what I wanted to do."}, {"time": 1303, "text": "And then the syntax wasn't that far behind it, right?"}, {"time": 1306, "text": "Now there are some warts there still."}, {"time": 1310, "text": "Like there's some areas where I'm like, ah, it'd be better if this were different or if this were different."}, {"time": 1314, "text": "Some of those things got added to the language too."}, {"time": 1316, "text": "I was really grateful for some of the early pioneers in the Python ecosystem back, because Python got written in 91."}, {"time": 1321, "text": "That's when the first version came out."}, {"time": 1323, "text": "But Guido was very open to users."}, {"time": 1326, "text": "And one of the sets of users were people like Jim Huganen and David Asher and Paul Dubois and Conrad Hinson."}, {"time": 1333, "text": "These were people that were on the main list."}, {"time": 1335, "text": "And they were just asking for things like, hey, we really should have complex numbers in this language."}, {"time": 1339, "text": "So let's, you know, there's a J, there's a one J, right?"}, {"time": 1342, "text": "And the fact that they went the engineering route of J is interesting."}, {"time": 1346, "text": "I don't think that's entirely favoring engineers."}, {"time": 1348, "text": "I think it's because I is so often used as the index of a for loop."}, {"time": 1352, "text": "So I think that's actually why."}, {"time": 1354, "text": "Probably, I mean, there's a pragmatic aspect."}, {"time": 1356, "text": "But the fact that complex numbers were there, I love that."}, {"time": 1359, "text": "The fact that I could write in the array constructs and that reduction was there, very simple to write summations and broadcasting was there."}, {"time": 1366, "text": "I could do addition of whole arrays."}, {"time": 1369, "text": "So that was cool."}, {"time": 1370, "text": "Those are some things I loved about it."}, {"time": 1372, "text": "I don't know what to start talking to you about because you've created so many incredible projects that basically changed the whole landscape of programming."}, {"time": 1380, "text": "But okay, let's start with, let's go chronologically with SciPy."}, {"time": 1386, "text": "You created SciPy over two decades ago now?"}, {"time": 1389, "text": "Yes, yes, I love to talk about SciPy."}, {"time": 1391, "text": "SciPy was really my baby."}, {"time": 1394, "text": "What was its goal?"}, {"time": 1395, "text": "What is its goal?"}, {"time": 1397, "text": "Yeah, fantastic."}, {"time": 1398, "text": "So SciPy was effectively, here I am using Python to do stuff that I previously used MATLAB to use."}, {"time": 1404, "text": "And I was using numeric, which is an array library that made a lot of it possible."}, {"time": 1408, "text": "But there's things that were missing."}, {"time": 1409, "text": "Like I didn't have an ordinary differential equation solver I could just call, right?"}, {"time": 1413, "text": "I didn't have integration."}, {"time": 1415, "text": "Hey, I wanted to integrate this function."}, {"time": 1417, "text": "Okay, well, I don't have just a function I can call to do that."}, {"time": 1420, "text": "These are things I remember being critical things that I was missing."}, {"time": 1423, "text": "Optimization."}, {"time": 1424, "text": "I just wanna pass a function to an optimizer and have it tell me what the optimal value is."}, {"time": 1430, "text": "Those are things I'm like, well, why don't we just write a library that adds these tools?"}, {"time": 1434, "text": "And I started to post on the mailing list and there'd previously been, people have discussed, I remember Conrad Henson saying, wouldn't it be great if we had this optimizer library or David Ashwood say this stuff."}, {"time": 1442, "text": "And I'm a ambitious, ambitious is the wrong word, an eager and probably more time than sense."}, {"time": 1451, "text": "I was a poor graduate student."}, {"time": 1453, "text": "My wife thinks I'm working on my PhD and I am, but part of the PhD that I loved was the fact that it's exploratory."}, {"time": 1459, "text": "You're not just taking orders, fulfilling a list of things to do, you're trying to figure out what to do."}, {"time": 1465, "text": "And so I thought, well, I'm running tools for my own use and a PhD, so I'll just start this project."}, {"time": 1472, "text": "And so in 99, 98 was when I first started to write libraries for Python."}, {"time": 1476, "text": "Definitely when I fell in love with Python 98, I thought, oh, well, there's just a few things missing."}, {"time": 1479, "text": "Like, oh, I need a reader to read DICOM files."}, {"time": 1482, "text": "I was in medical imaging and DICOM was a format that I want to be able to load that into Python."}, {"time": 1486, "text": "Okay, how do I write a reader for that?"}, {"time": 1488, "text": "So I wrote something called, it was an IO package, right?"}, {"time": 1491, "text": "And that was my very first extension module, which is C. So I wrote C code to extend Python so that in Python I could write things more easily."}, {"time": 1499, "text": "That combination kind of hooked me."}, {"time": 1502, "text": "It was the idea that I could, here's this powerful tool I can use as a scripting language and a high level language to think about, but that I can extend easily, easily in C, easily for me because I knew enough C. And then Guido had written a link."}, {"time": 1515, "text": "I mean, the only, the hard part of extending Python was something called the way memory management networks, and you have to do reference counting."}, {"time": 1521, "text": "And so there's a tracking of reference counting you have to do manually."}, {"time": 1525, "text": "And if you don't, you have memory leaks."}, {"time": 1527, "text": "And so that's hard."}, {"time": 1529, "text": "Plus then C, you know, it's just much more, you have to put more effort into it."}, {"time": 1532, "text": "It's not just, I have to now think about pointers and I have to think about stuff that is different."}, {"time": 1537, "text": "I have to kind of, you're like putting a new cartridge in your brain."}, {"time": 1540, "text": "Like, okay, I'm thinking about MRI."}, {"time": 1542, "text": "Now I'm thinking about programming."}, {"time": 1543, "text": "And there are distinct modules you end up having to think about."}, {"time": 1546, "text": "So it's harder."}, {"time": 1547, "text": "And when I was just in Python, I could just think about MRI and high level writing, but I could do that."}, {"time": 1552, "text": "And that kind of, I liked it."}, {"time": 1554, "text": "I found that to be enjoyable and fun."}, {"time": 1555, "text": "And so I ended up, oh, well, let me just add a bunch of stuff to Python to do integration."}, {"time": 1560, "text": "Well, and the cool thing is, is that the power of the internet, just looking around and I found, oh, there's this NetLive, which has hundreds of 4chan routines that people have written in the 60s and the 70s and the 80s in 4chan 77, fortunately, it wasn't 4chan 16."}, {"time": 1574, "text": "So it had been ported to 4chan 77."}, {"time": 1578, "text": "And 4chan 77 is actually a really great language."}, {"time": 1581, "text": "4chan 90 probably is my favorite 4chan because it's also, it's got complex numbers, got arrays and it's pretty high level."}, {"time": 1587, "text": "Now, the problem with it is you'd never want to write a program in 4chan 90 or 4chan 77, but it's totally fine to write a subroutine in, right?"}, {"time": 1594, "text": "And so, and then 4chan kind of got a little off course when they tried to compete with C++."}, {"time": 1599, "text": "But at the time, I just want libraries to do something like, oh, here's an ordinary differential equation."}, {"time": 1603, "text": "Here's integration."}, {"time": 1604, "text": "Here's runge cut integration."}, {"time": 1606, "text": "Already done."}, {"time": 1607, "text": "I don't have to think about that algorithm."}, {"time": 1608, "text": "I mean, you could, but it's nice to have somebody who's already done one and tested it."}, {"time": 1611, "text": "And so I sort of started this journey in 98, really."}, {"time": 1615, "text": "If you look back at the mailing list, there's sort of this productive era of me writing an extension module to connect runge cut integration to Python and making an ordinary differential equation solver."}, {"time": 1626, "text": "And then releasing that as a package."}, {"time": 1629, "text": "So we could call ODE pack, I think I called it then."}, {"time": 1631, "text": "Quad pack."}, {"time": 1632, "text": "And then I just made these packages."}, {"time": 1634, "text": "Eventually that became multipack because they're originally modular."}, {"time": 1637, "text": "You can install them separately."}, {"time": 1639, "text": "But a massive problem in Python was actually just getting your stuff installed."}, {"time": 1643, "text": "At the time, releasing software for me, like today it's people think, what does that mean?"}, {"time": 1647, "text": "Well, then it meant some poorly written webpage."}, {"time": 1650, "text": "I had some bad webpage up and I put a tarball, just a GZIP tarball of source code."}, {"time": 1655, "text": "That was the release."}, {"time": 1657, "text": "But okay, can we just stand that?"}, {"time": 1659, "text": "Because the community aspect of creating the package and sharing that, that's rare."}, {"time": 1667, "text": "That, to have, to both have the, at that time, so like the raw."}, {"time": 1671, "text": "Yeah, it was pretty early, yeah."}, {"time": 1672, "text": "Oh, well, not rare."}, {"time": 1674, "text": "Maybe you can correct me on this, but it seems like in the scientific community, so many people, you were basically solving the problems you needed to solve to process the particular application, the data that you need."}, {"time": 1688, "text": "And to also have the mind that I'm going to make this usable for others, that's."}, {"time": 1695, "text": "I would say I was inspired."}, {"time": 1696, "text": "I'd been inspired by Linux, been inspired by Linus and him making his code available."}, {"time": 1701, "text": "And I was starting to use Linux at the time."}, {"time": 1703, "text": "And I went, this is cool."}, {"time": 1704, "text": "So I'd kind of been previously primed that way."}, {"time": 1707, "text": "And generally I was into science because I liked the sharing notion."}, {"time": 1710, "text": "I liked the idea of, hey, let's, if collectively we build knowledge and share it, we can all be better off."}, {"time": 1715, "text": "Okay, so you want to energize by that idea."}, {"time": 1717, "text": "So I was energized by that idea already, right?"}, {"time": 1719, "text": "And I can't deny that I was."}, {"time": 1720, "text": "I'm sort of had this very, I liked that part of science, that part of sharing."}, {"time": 1725, "text": "And then all of a sudden, oh, wait, here's something."}, {"time": 1727, "text": "And here's something I could do."}, {"time": 1729, "text": "And then I slowly over years learned how to share better so that you could actually engage more people faster."}, {"time": 1735, "text": "One of the key things was actually giving people a binary they could install, right?"}, {"time": 1738, "text": "So that it wasn't just your source code, good luck."}, {"time": 1741, "text": "Compile this and then."}, {"time": 1742, "text": "It's compiled, ready to install, just, you know."}, {"time": 1745, "text": "So in fact, a lot of the journey from 98, even through 2012 when I started Anaconda was about that."}, {"time": 1750, "text": "Like it's why, you know, it's really the key as to why a scientist with dreams of doing MRI research ended up starting a software company that installs software."}, {"time": 1762, "text": "I work with a few folks now that don't program like on the creative side and the video side, the audio side."}, {"time": 1769, "text": "And because my whole life is running on scripts, I have to try to get them, I'm having all the task of teaching them how to do Python enough to run the scripts."}, {"time": 1779, "text": "And so I've been actually facing this, whether it's Anaconda or some with the task of how do I minimally explain basically to my mom how to write a Python script."}, {"time": 1788, "text": "And it's an interesting challenge."}, {"time": 1790, "text": "I have to, it's a to do item for me to figure out like, what is the minimal amount of information I have to teach?"}, {"time": 1796, "text": "What are the tools you use that one, you enjoy it, two, you're effective at it."}, {"time": 1800, "text": "And they're related, those are two related questions."}, {"time": 1802, "text": "And then the debugging, like the iterative process of running the script to figure out what the error is, maybe even for some people to do the fix yourself."}, {"time": 1811, "text": "So do you compile it?"}, {"time": 1812, "text": "Do you, like how do you distribute that code to them?"}, {"time": 1815, "text": "And it's interesting because I think it's exactly what you're talking about."}, {"time": 1820, "text": "If you increase the circle of empathy, the circle of people that are able to use your programs, you increase it, it's like effectiveness and it's power."}, {"time": 1832, "text": "And so you have to think, can I write scripts?"}, {"time": 1837, "text": "Can I write programs that can be used by medical engineers, by all kinds of people that don't know programming and actually maybe plant a seed, have them catch the bug of programming so that they start on a journey."}, {"time": 1850, "text": "That's a huge responsibility."}, {"time": 1851, "text": "And ultimately it has to do with the Amazon one click buy."}, {"time": 1855, "text": "Like how frictionless can you make the early steps?"}, {"time": 1858, "text": "Frictionless is actually really key."}, {"time": 1860, "text": "To go in any community is, any friction point, you're just gonna lose some people, right?"}, {"time": 1865, "text": "Now sometimes you may wanna intentionally do that."}, {"time": 1869, "text": "If you're early enough on, you need a lot of help."}, {"time": 1871, "text": "You need people who have the skills."}, {"time": 1873, "text": "You might actually, it's helpful."}, {"time": 1874, "text": "You don't necessarily have too many users as opposed to contributors if you're early on."}, {"time": 1880, "text": "Anyway, there's, SciFi started in 98, but it really emerged as this collection of modules that I was just putting on the net."}, {"time": 1887, "text": "People were downloading and I think I got 100 users, right?"}, {"time": 1891, "text": "By the end of that year."}, {"time": 1892, "text": "But the fact that I got 100 users and more than that, people started to email me with fixes."}, {"time": 1899, "text": "And that was actually intoxicating, right?"}, {"time": 1901, "text": "That was the, here I'm writing papers and I'm giving conferences and I get people to say hello, but yeah, good job."}, {"time": 1907, "text": "But mostly it was, you're viewed with, it's competitive, right?"}, {"time": 1911, "text": "You publish a paper and people are like, oh, it wasn't my paper."}, {"time": 1915, "text": "I was starting to see that sense of academic life where it was so much, I thought there was this cooperative effort, but it sounds like we're here just to one up each other."}, {"time": 1924, "text": "And it's not true across the board, but a lot of that's there."}, {"time": 1928, "text": "But here in this world, I was getting responses from people all over the world."}, {"time": 1933, "text": "I remember Pjaro Peterson in Estonia, right?"}, {"time": 1936, "text": "Was one of the first people."}, {"time": 1937, "text": "And he sent me back this make file, cause the first thing it is, yeah, your build thing stinks and here's a better make file."}, {"time": 1943, "text": "Now it was a complex make file."}, {"time": 1944, "text": "I don't think I never understood that make file actually, but it worked and it did a lot more."}, {"time": 1949, "text": "And so I said, thanks, this is cool."}, {"time": 1950, "text": "And that was my first kind of engagement with community development."}, {"time": 1955, "text": "But the process was, he sent me a patch file."}, {"time": 1957, "text": "I had to upload a new tar ball."}, {"time": 1959, "text": "And I just found, I really love that."}, {"time": 1961, "text": "And the style back then was here's a mailing list."}, {"time": 1963, "text": "It's very, it wasn't as, it's certainly weren't the tools that are available today."}, {"time": 1967, "text": "It was very early on, but I really started to, that's the whole year."}, {"time": 1970, "text": "I think I did about seven packages that year, right?"}, {"time": 1974, "text": "And then by the end of the year, I collected them into a thing called multipack."}, {"time": 1977, "text": "So in 99, there was this thing called multipack."}, {"time": 1979, "text": "And that's when a high school student, no, he was a high school student at the time, guy named Robert Kern, took that package and made a Windows installer, right?"}, {"time": 1989, "text": "And then of course, a massive increase of usage."}, {"time": 1992, "text": "So by the way, most of this development was under Linux."}, {"time": 1995, "text": "Yes, yes, it was on Linux."}, {"time": 1997, "text": "I was a Linux developer doing it on a Unix box."}, {"time": 2000, "text": "I mean, at the time I was actually getting into, I had a new hard drive, did some kernel programming to make the hard drive work."}, {"time": 2006, "text": "I mean, not programming, but modification to the kernel so I could actually get a hard drive working."}, {"time": 2011, "text": "I love that aspect of it."}, {"time": 2012, "text": "I was also in, at school, I was building a cluster."}, {"time": 2016, "text": "I took Mac computers and you put yellow dog Linux on them."}, {"time": 2020, "text": "At the Mayo Clinic, they were just, they had all these Macs that were older, they were just getting rid of."}, {"time": 2024, "text": "And so I kind of got permission to go grab them together."}, {"time": 2026, "text": "I put about 24 of them together in a cluster, in a cabinet, and put yellow dog Linux on them all."}, {"time": 2031, "text": "And I wrote a C++ program to do MRI simulation."}, {"time": 2036, "text": "That was what I was doing at the same time for my day job, so to speak."}, {"time": 2041, "text": "So I was loving the whole process."}, {"time": 2043, "text": "And the same time I was, oh, I need a ordinary differential equation."}, {"time": 2046, "text": "That's why ordinary differential equations were key was because that's the heart of a block equation for simulating MRI, is an ODE solver."}, {"time": 2052, "text": "And so that's, but I actually did that, it just happened at the same time."}, {"time": 2056, "text": "That's why it was kind of what you're working on and what you're interested in, they're coinciding."}, {"time": 2060, "text": "I was definitely scratching my own itch in terms of building stuff."}, {"time": 2064, "text": "And which helped in the sense that I was using it for me, so at least I had one user."}, {"time": 2068, "text": "I had one person who was like, well, no, this is better."}, {"time": 2070, "text": "I like this interface better."}, {"time": 2071, "text": "And I had the experience of MATLAB to guide some of what those APIs might look like."}, {"time": 2076, "text": "But you're just doing yourself, you're building all this stuff."}, {"time": 2079, "text": "But with the Windows installer, it was the first time I realized, oh yeah, the binary installer really helps people."}, {"time": 2083, "text": "And so that led to spending more time on that side of things."}, {"time": 2089, "text": "So around 2000, so I graduated my PhD in 2000, end of year, end of 2000."}, {"time": 2093, "text": "So 99 doing a lot of work there, 98 doing a lot of work there, 99 kind of spending more time on my PhD, helping people use the tools, thinking about what do I want to go from here."}, {"time": 2104, "text": "There was a company, there was a guy actually, Eric Jones and Travis Vought."}, {"time": 2107, "text": "They were two friends who founded a company called NTHOT."}, {"time": 2111, "text": "It's here in Austin, still here."}, {"time": 2113, "text": "And they, Eric contacted me at the time when I was a graduate student still."}, {"time": 2119, "text": "And he said, hey, why don't you come down?"}, {"time": 2120, "text": "We want to build a company."}, {"time": 2122, "text": "We're thinking of a scientific company and we want to take what you're doing and kind of add it to some stuff that he'd done."}, {"time": 2129, "text": "He'd written some tools."}, {"time": 2131, "text": "And then Piero Peterson had done F2Py."}, {"time": 2132, "text": "Let's come together and build, pull this all together and call it SciPy."}, {"time": 2136, "text": "So that's the origin of the SciPy brand."}, {"time": 2139, "text": "It came from multi pack and a whole bunch of modules I'd written, plus a few things from some other folks and then pulled together in a single installer."}, {"time": 2147, "text": "SciPy was really a distribution of Python masquerading as a library."}, {"time": 2151, "text": "How did you think about SciPy in context of Python, in context of Numeric, like what?"}, {"time": 2156, "text": "So we saw SciPy as a way to make an R&D environment for Python, like use Python, depended on Numeric."}, {"time": 2163, "text": "So Numeric was the array library we depended on."}, {"time": 2165, "text": "And then from there, extend it with a bunch of modules that allowed for, and at the time, the original vision of SciPy was to have plotting, was to have the REPL environment and kind of really a whole data environment that you could then install and get going with."}, {"time": 2181, "text": "And that was kind of the thinking."}, {"time": 2183, "text": "It didn't really evolve that way, right?"}, {"time": 2185, "text": "It sort of had a, for one, it's really hard to do massive scale projects with open source collectives."}, {"time": 2194, "text": "Actually, there's sort of an intrinsic cooperation limit as to which, too many cooks in the kitchen, you can do amazing infrastructure work."}, {"time": 2202, "text": "When it comes down to bringing it all together into a single deliverable, that actually requires a little more product management that is not, that doesn't really emerge from the same dynamic."}, {"time": 2213, "text": "So it struggled, struggled to get almost too many voices."}, {"time": 2217, "text": "It's hard to have everybody agree."}, {"time": 2219, "text": "Consensus doesn't really work at that scale."}, {"time": 2222, "text": "You end up with politics, with the same kind of things that's happened in large organizations trying to decide what to do together."}, {"time": 2229, "text": "So consensus building was challenging at scale as more people came in, right?"}, {"time": 2233, "text": "Early on, it's fine, because there's nobody there."}, {"time": 2235, "text": "So it works, but then as you get more successful and more people use it, all of a sudden, oh, there's this scale at which this doesn't work anymore and we have to come up with different approaches."}, {"time": 2243, "text": "So Sidepy came out officially in 2001, was the first release, most of the time."}, {"time": 2248, "text": "I remember the days of getting that release ready."}, {"time": 2251, "text": "It was a Windows installer and there were bugs on how the Windows compiler handled complex numbers and you were chasing segmentation faults."}, {"time": 2258, "text": "And it was, it's a lot of work."}, {"time": 2260, "text": "There was a lot of effort had nothing to do with my area of study."}, {"time": 2265, "text": "And at the same time, I had just gotten an offer."}, {"time": 2267, "text": "So he wondered if I wanted to come down and help him start that company with his friend."}, {"time": 2271, "text": "And at the time I was like, I was intrigued, but I was squaring a path, an academic path."}, {"time": 2276, "text": "And I had just got an offer to go and teach at my alma mater."}, {"time": 2279, "text": "So I took that tenure track position."}, {"time": 2282, "text": "And Sidepy, and kind of, then I started to work on Sidepy as a professor too."}, {"time": 2287, "text": "So that's, I left, I've got the Mayo Clinic, graduated, wrote my thesis using Sidepy, wrote, you know, there's images that were created."}, {"time": 2295, "text": "Now the plotting tool I used was something from Yorick actually."}, {"time": 2298, "text": "It was a plotting, a PLT kind of a plotting language that I used."}, {"time": 2302, "text": "Yorick is a programming language?"}, {"time": 2303, "text": "It was a programming language, had a plotting tool, Dyslin, it had integration to Dyslin."}, {"time": 2308, "text": "I ended up using Dyslin plus some of the plotting from Yorick linked to from Python."}, {"time": 2313, "text": "Anyway, it was, people don't plot that way now, but this is before, and Sidepy was trying to add plotting."}, {"time": 2321, "text": "It didn't have much success."}, {"time": 2322, "text": "Really the success of plotting came from John Hunter, who had a similar experience to my experience, my kind of maverick experience as a person just trying to get stuff done and kind of having more time than money maybe, right?"}, {"time": 2333, "text": "And John Hunter created what?"}, {"time": 2335, "text": "MapPlotLib."}, {"time": 2336, "text": "He's the creator of MapPlotLib."}, {"time": 2337, "text": "Yeah, so John Hunter was, you know, he wasn't a student at the time, but he was an, he was working in Quant field and he said, we need better plotting."}, {"time": 2343, "text": "So he just went out and said, cool, I'll make a new project and we'll call it MapPlotLib."}, {"time": 2346, "text": "And he released in 2001, about the same time that Sidepy came out and it was separate library, separate install, use numeric, Sidepy use numeric."}, {"time": 2355, "text": "And so Sidepy, you know, in 2001, we released Sidepy and then Endthought created a conference called Sidepy, which was brought people together to talk about the space."}, {"time": 2365, "text": "And that conference is still ongoing."}, {"time": 2366, "text": "It's one of the favorite conferences of a lot of people because it's, you know, it's changed over the years, but early on it was, you know, a collection of 50 people who care about, scientists mostly, you know, practicing scientists who want, who care about coding and doing it well and not using MATLAB."}, {"time": 2382, "text": "And I remember being driven by, you know, I liked MATLAB, but I didn't like the fact that, so I'm not opposed to proprietary software."}, {"time": 2388, "text": "I'm actually not an open source zealot."}, {"time": 2390, "text": "I love open source for the, what it brings, but I also see the role for proprietary software."}, {"time": 2394, "text": "But what I didn't like was the fact that I would develop code and publish it and then effectively telling somebody here to run my code, you have to have this proprietary software."}, {"time": 2402, "text": "Right, and there's also culture around MATLAB as much, because I've talked to a few folks in, MathWorks creates MATLAB?"}, {"time": 2410, "text": "I mean, there's just a culture, they try really hard, but it just, there's this corporate IBM style culture that's like, or whatever."}, {"time": 2418, "text": "I don't want to say negative things about IBM or whatever, but there's a... No, it's really that connection."}, {"time": 2423, "text": "It's something I'm in the middle of right now is the business of open source."}, {"time": 2427, "text": "And how do you connect the ethos of cooperative development with the necessity of creating profits, right?"}, {"time": 2434, "text": "And like right now today, I'm still in the middle of that."}, {"time": 2438, "text": "That's actually the early days of me exploring this question."}, {"time": 2442, "text": "Cause I was writing SciPy, I mean, as an aside, I also had, so I had three kids at the time."}, {"time": 2446, "text": "I have six kids now."}, {"time": 2447, "text": "I got married early, wanted a family."}, {"time": 2450, "text": "I had three kids and I remember reading, I read Richard Stallman's post and I was a fan of Stallman."}, {"time": 2455, "text": "I would read his work, I liked this collective ideas he would have."}, {"time": 2458, "text": "Certainly the ideas on IP law, I read a lot of his stuff."}, {"time": 2461, "text": "But then he said, okay, well, how do I make money with this?"}, {"time": 2465, "text": "How do I make a living?"}, {"time": 2466, "text": "How do I pay for my kids?"}, {"time": 2467, "text": "All this stuff was in my mind, young graduate student making no money, thinking I got to get a job."}, {"time": 2472, "text": "And he said, well, I think just be like me and don't have kids, right?"}, {"time": 2475, "text": "That's just, don't, don't."}, {"time": 2477, "text": "That's his take on it."}, {"time": 2478, "text": "That was what he said in that moment, right?"}, {"time": 2480, "text": "That's the thing I read and I went, okay, this is a train I can't get on."}, {"time": 2484, "text": "There has to be a way to preserve the culture of open source and still be able to make sufficient money to feed your kids."}, {"time": 2490, "text": "Yes, exactly, there's gotta be."}, {"time": 2491, "text": "Well, so that actually led me to a study of economics."}, {"time": 2494, "text": "Because at the time I was ignorant and I really was."}, {"time": 2496, "text": "I'm actually, I'm embarrassed for educational system that they could let me and I was valedictorian in my high school class and I did super well in college."}, {"time": 2503, "text": "And like academically I did great, right?"}, {"time": 2507, "text": "But the fact that I could do that and then be clueless about this key part of life, it led me to go, there's a problem."}, {"time": 2514, "text": "Like I should have learned this in fifth grade."}, {"time": 2516, "text": "I should have learned this in eighth grade."}, {"time": 2518, "text": "Like everybody should come out with a basic knowledge of economics."}, {"time": 2521, "text": "You're an interesting example because you've created tools that change the lives of probably millions of people and the fact that you don't understand at the time of the creation of those tools, the basics economics of how like to build up a giant system is the problem."}, {"time": 2535, "text": "Yeah, it's a problem."}, {"time": 2536, "text": "And so during my PhD at the same time, this is back in 98, 99 at the same time, I was in a library, I was reading books on capitalism, I was reading books on Marxism, I was reading books on what is this thing?"}, {"time": 2549, "text": "And I encountered, basically I encountered a set of writings from people that said they were the inheritors of Adam Smith."}, {"time": 2555, "text": "Read Adam Smith for the first time, right?"}, {"time": 2557, "text": "Which is the wealth of nations and kind of this notion of emergent societies and realized, oh, there's this whole world out here of people and the challenge of economics is also political."}, {"time": 2569, "text": "Like, cause economics, people, different parties running for office, they want their economic friends."}, {"time": 2578, "text": "They want their economists to back them up, right?"}, {"time": 2580, "text": "Or to be their magicians, like the magicians in Pharaoh's court, right?"}, {"time": 2584, "text": "The people that are kind of say, hey, this is, you should listen to me because I've got the expert who says this."}, {"time": 2589, "text": "And so it gets really muddled, right?"}, {"time": 2591, "text": "But I was looking at it from as a scientist going, what is this space?"}, {"time": 2594, "text": "What does this mean?"}, {"time": 2595, "text": "How does Paris get fed?"}, {"time": 2596, "text": "How does, what is money?"}, {"time": 2599, "text": "And I found a lot of writings that I really loved."}, {"time": 2601, "text": "I found some things that I really loved and I learned from that."}, {"time": 2603, "text": "It was writings from people like Von Missess."}, {"time": 2606, "text": "He wrote a paper in 1920 that still should be read more than it is."}, {"time": 2609, "text": "It was the economic calculation problem of the socialist commonwealth."}, {"time": 2614, "text": "It was basically in response to the Bolshevik revolution in 1917."}, {"time": 2617, "text": "And his basic argument was it's not gonna work to not have private property."}, {"time": 2621, "text": "You're not gonna be able to come up with prices."}, {"time": 2623, "text": "The bureaucrats aren't gonna be able to determine how to allocate resources without a price system."}, {"time": 2627, "text": "And a price system emerges from people making trades."}, {"time": 2631, "text": "And they can only make trades if they have authority over the thing they're trading."}, {"time": 2635, "text": "And that creates information flow that you just don't have if you try to top down it."}, {"time": 2642, "text": "And it's like, huh, that's a really good point."}, {"time": 2644, "text": "Yeah, the prices have a signal that's used."}, {"time": 2646, "text": "And it's important to have that signal when you're trying to build a community of productive people like you would in the software engineering space."}, {"time": 2653, "text": "Yeah, the prices are actually an important signaling mechanism."}, {"time": 2657, "text": "Right, and that money is just a bartering tool."}, {"time": 2660, "text": "Right, so this is the first time I've encountered any of this concept, right, and the fact that, oh, this is actually really critical."}, {"time": 2666, "text": "Like it's so critical to our prosperity and that we're dangerously not learning about this, not teaching our children about this."}, {"time": 2676, "text": "So you had the three kids, you had to make some hard decisions."}, {"time": 2678, "text": "I had to make some money, right, had to figure it out."}, {"time": 2679, "text": "But I didn't really care."}, {"time": 2680, "text": "I mean, I've never been driven by money, just need it."}, {"time": 2683, "text": "Yeah, right, need to eat."}, {"time": 2685, "text": "So how did that resolve itself in terms of site buy?"}, {"time": 2689, "text": "So I would say it didn't really resolve itself."}, {"time": 2691, "text": "It sort of started a journey that I'm continuing on."}, {"time": 2693, "text": "I'm still on, I would say."}, {"time": 2694, "text": "I don't think it resolved itself."}, {"time": 2695, "text": "But I will say I went in eyes wide open."}, {"time": 2699, "text": "Like I knew that there were problems with giving stuff away and creating the market externalities that the fact that, yeah, people might use it and I might not get paid for it and I'll have to figure something else out to get paid."}, {"time": 2713, "text": "Like at least I can say I'm not bitter that a lot of people have used stuff that I've written and I haven't necessarily benefited economically from it."}, {"time": 2720, "text": "I've heard other people be bitter about that when they write or they talk."}, {"time": 2723, "text": "Like, oh, I should've got more value out of this."}, {"time": 2724, "text": "And I'm also, I want to create systems that let people like me who might have these desires to do things, let them benefit."}, {"time": 2732, "text": "So it actually creates more of the same."}, {"time": 2734, "text": "Not to turn on your bitterness module, but there's some aspect, I wish there was mechanisms for me to reward whoever created side buy and non buy because it brought so much joy to my life."}, {"time": 2746, "text": "The tip dark notion was there."}, {"time": 2749, "text": "But there should be a very frictionless mechanism."}, {"time": 2751, "text": "There should be a frictionless mechanism."}, {"time": 2753, "text": "I would love to talk about some of the ideas I have because I actually came across, I think I've come up with some interesting notions that could work, but they'll require anything that will work takes time to emerge, right?"}, {"time": 2763, "text": "Like things don't just turn overnight."}, {"time": 2764, "text": "That's definitely one thing I've also understood and learned is any fixes, that's why it's kind of funny."}, {"time": 2770, "text": "We often give credit to, oh, this president gets elected and oh, look how great things have done."}, {"time": 2774, "text": "And I saw that when I had a transition in a condo when a new CEO came in, right?"}, {"time": 2779, "text": "And it's like the success that's happening, there's an inertia there."}, {"time": 2783, "text": "Yeah, and sometimes the decision you made like 10 years before is the reason why the success is the."}, {"time": 2789, "text": "So we're sort of just running around taking credit for stuff."}, {"time": 2792, "text": "The credit assignment has like a delay to it that makes the credit assignment basically wrong more than right."}, {"time": 2799, "text": "Wrong more than right, exactly."}, {"time": 2800, "text": "And so I'm like, oh, this is, you know, that's the stuff I would read a ton about, you know, early on."}, {"time": 2805, "text": "So I don't, I feel like I'm with you."}, {"time": 2807, "text": "Like I want the same thing."}, {"time": 2808, "text": "I want to be able to, and honestly, not for personally, I've been happy."}, {"time": 2811, "text": "I've been happy."}, {"time": 2812, "text": "I feel like I don't have any, I mean, we've been done reasonably okay, but I've had to pursue it."}, {"time": 2816, "text": "Like that's really what started my trajectory from academia is reading that stuff led me to say, oh, entrepreneurship matters."}, {"time": 2825, "text": "So I love software, but we need more entrepreneurs and I wanna understand that better."}, {"time": 2830, "text": "So once I kind of had that virus infect my brain, even though I was on a trajectory to go to a tenure track position at a university and I was there for six years, I was kind of already out the door when I started."}, {"time": 2846, "text": "And we can get into that, but."}, {"time": 2847, "text": "Well, can I just ask you a quick question on, is there some design principles that were in your mind around SciPy?"}, {"time": 2854, "text": "Like, is there some key ideas that were just like sticking to you that this is the fundamental ideas?"}, {"time": 2861, "text": "I would think it's basically accessibility to scientists, like give them, give scientists and engineers tools that they don't have to think a lot about programming."}, {"time": 2868, "text": "So give them really good building blocks, give them functions that they wanna call and sort of just the right length of spelling."}, {"time": 2875, "text": "There's one tradition in programming where it's like, make very, very long names, right?"}, {"time": 2881, "text": "And you can see it in some programming languages where the names get, take half the screen."}, {"time": 2886, "text": "And in the 4chan world, characters had to be six letters early on, right?"}, {"time": 2892, "text": "And that's way too much, too little."}, {"time": 2894, "text": "But I was like, I liked to have names that were informative but short."}, {"time": 2898, "text": "So even though Python, well this is a different conversation, but documentation is doing some work there."}, {"time": 2905, "text": "So when you look at great scientific libraries and functions, there's a richness of documentation that helps you get into the details."}, {"time": 2914, "text": "The first glance at a function gives you the intuition of all it needs to do by looking at the headers and so on."}, {"time": 2920, "text": "But to get the depths of all the complexities involved, all the options involved, documentation does some of the work."}, {"time": 2925, "text": "Documentation is essential, yeah."}, {"time": 2927, "text": "So that was actually a, so we thought about several things."}, {"time": 2930, "text": "One is we wanted plotting."}, {"time": 2931, "text": "We wanted interactive environment."}, {"time": 2933, "text": "We wanted good documentation."}, {"time": 2934, "text": "These are things we knew, we wanted."}, {"time": 2936, "text": "The reality is those took about 10 years to evolve, right?"}, {"time": 2940, "text": "Given the fact that we didn't have a big budget, it was all volunteer labor."}, {"time": 2943, "text": "It was sort of, when nthought got created and they started to try to find projects, people would pay for pieces and they were able to fund some of it."}, {"time": 2953, "text": "Not nearly enough to keep up with what was necessary."}, {"time": 2955, "text": "And no criticism, just simply the reality."}, {"time": 2958, "text": "I mean, it's hard to start a business and then do consulting and then also promote an open source project that's still fairly new."}, {"time": 2966, "text": "Cypo is fairly niche."}, {"time": 2967, "text": "We stayed connected all while I was a student, sorry, a professor."}, {"time": 2970, "text": "I went to BYU and started to teach."}, {"time": 2972, "text": "Electrical engineering, all the applied math courses."}, {"time": 2975, "text": "I loved teaching single processing, probability theory, electromagnetism."}, {"time": 2979, "text": "I was, if you look at writing my professor, which my kids loved to do, I wasn't, I got some bad reviews because people."}, {"time": 2986, "text": "What was the criticism?"}, {"time": 2988, "text": "I would speak too high of a level."}, {"time": 2990, "text": "Like I definitely had a calibration problem coming out of graduate work where I hate to be condescending to people."}, {"time": 2996, "text": "Like I really have a ton of respect for people fundamentally."}, {"time": 2999, "text": "Like my fundamental thing is I respect people."}, {"time": 3002, "text": "Sometimes that can lead to a, I was thinking they had more knowledge than they did."}, {"time": 3007, "text": "And so I would just speak at a very high level, assume they got it."}, {"time": 3011, "text": "But they need to rise to the standard that you set."}, {"time": 3014, "text": "I mean, that's one of the, some of the greatest teachers do that."}, {"time": 3018, "text": "And that was kind of what was inspiring me."}, {"time": 3019, "text": "But you also have to, I cannot say I was articulate with some of the greatest teachers, right?"}, {"time": 3026, "text": "I was, like one classic example, when I first taught at BYU, my very first class, it was overheads, transparencies, overheads."}, {"time": 3034, "text": "Before projectors were really that common, I taught transparencies."}, {"time": 3037, "text": "I'm writing my notes out."}, {"time": 3038, "text": "I go in, room's half dark."}, {"time": 3040, "text": "I just blaring through these transparencies."}, {"time": 3042, "text": "Here it is, here it is, here it is."}, {"time": 3044, "text": "And I did give a quiz after two weeks."}, {"time": 3048, "text": "Nothing I had taught had gotten anywhere."}, {"time": 3050, "text": "And I realized, okay, I'm not, this is not working."}, {"time": 3054, "text": "So I put away the transparencies and I turned around and just started using the chalkboard."}, {"time": 3058, "text": "And what it did is it slowed me down, right?"}, {"time": 3060, "text": "The chalkboard just slowed me down and gave people time to process and to think."}, {"time": 3064, "text": "And then that made me focus."}, {"time": 3066, "text": "My writing wasn't great on the chalkboard, but I really love that part of like the teaching."}, {"time": 3070, "text": "So that entered SciPy's world in terms of, we always understood that there's a didactic aspect of SciPy, kind of how do you take the knowledge and then produce it?"}, {"time": 3078, "text": "The challenge we had was the scope."}, {"time": 3081, "text": "Like ultimately SciPy was everything, right?"}, {"time": 3083, "text": "And so 2001, when it first came out, people were starting to use it."}, {"time": 3086, "text": "No, this is cool, this is a tool we actually use."}, {"time": 3089, "text": "At the same time, 2001 timeframe, there was a little bit of like the Hubble Space Telescope, the folks at Hubble that started to say, hey, Python, we're gonna use Python for processing images from Hubble."}, {"time": 3098, "text": "And so Perry Greenfield was a good friend in running that program."}, {"time": 3102, "text": "And he had called me before I left WIU and said, you know, we wanna do this, but numeric actually has some challenges in terms of, you know, it's not, the array doesn't have enough types."}, {"time": 3112, "text": "We need more operations."}, {"time": 3114, "text": "You know, broadcasting needs to be a little more settled."}, {"time": 3116, "text": "They wanted record arrays."}, {"time": 3117, "text": "They wanted, you know, record arrays are like a data frame, but a little bit different, but they wanted more structured data."}, {"time": 3123, "text": "So he had called me even early on then, and he said, you know, what, would you wanna work on something to make this work?"}, {"time": 3128, "text": "And I said, yeah, I'm interested, but I'm going here, and I, you know, we'll see if I have time."}, {"time": 3132, "text": "So in the meantime, while I was teaching and SciPy was emerging, and I had a student, I was constantly, while I was teaching, trying to figure a way to fund this stuff."}, {"time": 3138, "text": "So I had a graduate student, my only graduate student, a Chinese fellow, Liu Hongze is his name, great guy."}, {"time": 3146, "text": "He wrote a bunch of stuff for iterative linear algebra, like got into writing some of the iterative linear algebra tools that are currently there in SciPy, and they've gotten better since, but this is in 2005, kept working on SciPy, but Perry has started working on a replacement to numeric called NumArray."}, {"time": 3165, "text": "And in 2004, a package called ND Image, it was an image processing library that was written for NumArray, and it had in it a morphology tool."}, {"time": 3175, "text": "I don't know if you know what morphology is."}, {"time": 3176, "text": "It's open, dilations, closed, you know, there was sort of this, as a medical imaging student, I knew what it was, because it was used in segmentation a lot."}, {"time": 3184, "text": "And in fact, I'd wanted to do something like that in Python, in SciPy, but just had never gotten around to it."}, {"time": 3190, "text": "So when it came out, but it worked only on NumArray, and SciPy needed numeric, and so we effectively had the beginning of this split."}, {"time": 3200, "text": "And numeric and NumArray didn't share data, they were just two, so you could have a gigabyte of numeric, NumArray data, and gigabyte of numeric data, and they wouldn't share it."}, {"time": 3207, "text": "And so you had these, then you had these scientific libraries written on top."}, {"time": 3211, "text": "I got really bugged by that."}, {"time": 3212, "text": "I got really like, oh man, this is not good, we're not cooperating now, we're sort of redoing each other's work, and we're just this young community."}, {"time": 3220, "text": "So that's what led me, even though I knew it was risky, because my, you know, I was on a tenure track position, 2004 I got reviewed."}, {"time": 3228, "text": "They said, hey, things are going okay, you're doing well, paper's coming out, but you're kind of spending a lot of time doing this open source stuff, maybe do a little less of that, and a little more of the paper writing and grant writing, which was naive, but it was definitely the thinking."}, {"time": 3240, "text": "It still goes on."}, {"time": 3241, "text": "Still goes on."}, {"time": 3243, "text": "You're basically creating a thing which enables science in the 21st century."}, {"time": 3249, "text": "Maybe don't emphasize that so much in your free year tenure."}, {"time": 3253, "text": "It illustrates some of the challenges."}, {"time": 3255, "text": "It does, and it's, people mean well."}, {"time": 3259, "text": "Like, but we've gotten broken in a bunch of ways."}, {"time": 3262, "text": "Certain things, programming, understanding the role of software engineering, programming in society is a little bit lacking."}, {"time": 3268, "text": "Now, I was in electrical engineering position."}, {"time": 3270, "text": "That's even worse there."}, {"time": 3273, "text": "Yeah, it was very, they were very focused, and so, you know, good people, and I had a great time, I loved my time, I loved my teaching, I loved all the things I did there."}, {"time": 3280, "text": "The problem was, the split was happening in this community that I loved, right?"}, {"time": 3283, "text": "I saw people, and I went, oh my gosh, this is gonna be, this is not great, and so I happened, you know, fate, I had a class I had signed up for, it's a, I was trying to build an MRI system, so I had a kind of a radio, instead of a radio, a digital radio class, it was a digital MRI class."}, {"time": 3301, "text": "And I had people sign up, two people signed up, then they dropped, and so I had nobody in this class."}, {"time": 3306, "text": "So, and I didn't have any other courses to teach, and I thought, oh, I've got some time, and I'll just write, I'll just write a replace, a merger of Numerica Numeray."}, {"time": 3314, "text": "Like, I'll basically take the numeric code base at the features Numeray was adding, and then kind of come up with a single array library that everybody can use."}, {"time": 3322, "text": "So that's where NumPy came from, was my thinking, hey, I can do this, and who else is going to?"}, {"time": 3327, "text": "Because at that point, I'd been around the community long enough, and I'd written enough C code, I knew, I knew the structures, and I, in fact, my first contribution to numeric had been writing the CAPI documentation that went in the first documentation for NumPy, for numeric, sorry, this is Paul DuBois, David Asher, Conrad Hinson, and myself."}, {"time": 3345, "text": "I got credit because I wrote this chapter, which is all the CAPI of Numerica, all the C stuff."}, {"time": 3351, "text": "So I said, I'm probably the one to do it, and nobody else is gonna do this."}, {"time": 3354, "text": "So it was sort of, out of a sense of duty and passion, knowing that, eh, I don't think my academic, I don't think the department here is gonna appreciate this, but it's the right thing to do."}, {"time": 3366, "text": "It was like."}, {"time": 3366, "text": "Can we just link on that moment?"}, {"time": 3369, "text": "Because the importance of the way you thought and the action you took, I feel is understated and is rare and I would love to see so much more of it because what happens as the tools become more popular, there's a split that happens."}, {"time": 3387, "text": "And it's a truly heroic and impactful action to in those early, in that early split, to step up and it's like great leaders throughout history, like get, what is the brave heart, like get on a horse and rile the troops because I think that can have, make a big difference."}, {"time": 3406, "text": "We have TensorFlow versus PyTorch in the machine learning community."}, {"time": 3409, "text": "We have the same problem today."}, {"time": 3411, "text": "It's actually bigger."}, {"time": 3412, "text": "I wonder if it's possible in the early days to rally the troops."}, {"time": 3418, "text": "It is possible, especially in the early days."}, {"time": 3420, "text": "The longer it goes, the harder, right?"}, {"time": 3421, "text": "The more energy in the factions, the harder."}, {"time": 3423, "text": "But in the early days, it is possible and it's extremely helpful and there's a willingness there, but the challenge is there's just not a willingness to fund it."}, {"time": 3432, "text": "There's not a willingness to, you know, like I was literally walking into a field saying I'm going to do this and here I am, like, you know, I have five kids at home now."}, {"time": 3443, "text": "Pressure builds."}, {"time": 3444, "text": "Sometimes my wife hears these stories and she's like, you did what?"}, {"time": 3449, "text": "I thought we were going to, I thought you were actually on a path to make sure we had resources and money, but, but again, there's a, there's an aspect, I'm a very hopeful person."}, {"time": 3457, "text": "I'm an optimistic person by nature."}, {"time": 3461, "text": "I learned that about myself later on."}, {"time": 3463, "text": "And part of my, my religious beliefs actually lead to that."}, {"time": 3468, "text": "And it's why I hold them dear because it's actually how I feel about, that's what leads me to these attitudes, sort of this hopefulness and this sense of, yeah, it may not work out for me financially or maybe, but that's not the ultimate gain."}, {"time": 3480, "text": "Like that's a thing, but it's not, that's not the scorecard for me."}, {"time": 3485, "text": "And so I just wanted to be helpful and I knew, and partly because these SciPy conferences, because the maintenance conversations, I knew there was a lot of need for this, right?"}, {"time": 3493, "text": "And so I had this, it wasn't like I was alone in terms of no feedback."}, {"time": 3496, "text": "I had these people who knew, but it was crazy."}, {"time": 3499, "text": "Like people who at the time said, yeah, we didn't think you'd be able to do it."}, {"time": 3502, "text": "We thought it was crazy."}, {"time": 3503, "text": "And also instructive, like practically speaking, that you had a cool feature that you were chasing the morphology, like the."}, {"time": 3511, "text": "Like it's not just like."}, {"time": 3512, "text": "There's an end result."}, {"time": 3513, "text": "It's not some visionary thing."}, {"time": 3515, "text": "I'm going to unite the community."}, {"time": 3516, "text": "You were like."}, {"time": 3518, "text": "You were actually practically, this is what one person actually could do and actually build."}, {"time": 3523, "text": "Cause that is important."}, {"time": 3524, "text": "Cause you can get over your skis."}, {"time": 3527, "text": "You can definitely get over your skis."}, {"time": 3529, "text": "And I had, in fact, this almost got me over my skis, right?"}, {"time": 3532, "text": "I would say, well, in retrospect, I hate looking back."}, {"time": 3536, "text": "I can tell you all the flaws with NumPy, right?"}, {"time": 3538, "text": "When I go into it, there's lots of stuff that I'm like, oh man, that's embarrassing."}, {"time": 3541, "text": "That was wrong."}, {"time": 3542, "text": "I wish I had somebody stop me with a wet fish there."}, {"time": 3544, "text": "Like I needed, like what I'd wished I'd had was somebody with more experience and certainly library writing and array library."}, {"time": 3551, "text": "There's like, I wish I had me."}, {"time": 3552, "text": "I could go back in time and go do this, do that."}, {"time": 3554, "text": "There's a more important thing."}, {"time": 3555, "text": "Cause there's things we did that are still there that are problematic, that created challenges for later."}, {"time": 3560, "text": "And I didn't know it at the time."}, {"time": 3562, "text": "Didn't understand how important that was."}, {"time": 3564, "text": "And in many cases, didn't know what to do."}, {"time": 3566, "text": "Like there was pieces of the design of NumPy."}, {"time": 3569, "text": "I didn't know what to do until five years ago."}, {"time": 3571, "text": "Now I know what they should have been, Ben."}, {"time": 3572, "text": "But I didn't know at the time and nobody, and I couldn't get the help."}, {"time": 3575, "text": "Anyway, so I wrote it."}, {"time": 3576, "text": "It took about, it took four months to write the first version, then about 14 months to make it usable."}, {"time": 3583, "text": "But it was, it wasn't, it was that first four months of intense writing, coding, getting something out the door that worked that was, it was, it was definitely challenging."}, {"time": 3592, "text": "And then the big thing I did was create a new type object called D type."}, {"time": 3596, "text": "That was probably the contribution."}, {"time": 3598, "text": "And then the fact that I added broad, not just broadcasting, but advanced indexing so that you could do masked indexing and indirect indexing instead of just slicing."}, {"time": 3609, "text": "So for people who don't know, and maybe you can elaborate, NumPy, I guess the vision in the narrowest sense is to have this object that represents n dimensional arrays."}, {"time": 3623, "text": "And like at any level of abstraction you want, but basically it could be a black box that you can investigate in ways that you would naturally want to investigate such objects."}, {"time": 3634, "text": "So you could do math on it easily."}, {"time": 3635, "text": "Math on it easily, yeah."}, {"time": 3637, "text": "So it had an associated library of math operations and effectively SciPy became an even larger operate set of math operations."}, {"time": 3644, "text": "So the key for me was I was going to write NumPy and then move SciPy to depend on NumPy."}, {"time": 3650, "text": "In fact, early on, one of the initial proposals was that we would just write SciPy and it would have the numeric object inside of it."}, {"time": 3656, "text": "And it'd be SciPy.array or something."}, {"time": 3659, "text": "That turned out to be problematic because numeric already had a little mini library of linear algebra and some functions, and it had enough momentum, enough users that nobody wanted to, they wanted backward compatibility."}, {"time": 3672, "text": "One of the big challenges of NumPy was I had to be backward compatible with both numeric and NumArray in order to allow both of those communities to come together."}, {"time": 3679, "text": "There was a ton of work in creating that backward compatibility that also created echoes in today's object."}, {"time": 3685, "text": "Like some of the complexity in today's object is actually from that goal of backward compatibility to these other communities, which if you didn't have that, you'd do something different, which is instructive because a lot of things are there."}, {"time": 3697, "text": "You think, what is that there for?"}, {"time": 3698, "text": "It's like, well, it's a remnant."}, {"time": 3701, "text": "It's an artifact of its historical existence."}, {"time": 3705, "text": "By the way, I love the empathy and the lack of ego behind that because I feel, you see that in the split in the JavaScript framework, for example, the arbitrary branching."}, {"time": 3716, "text": "I think in order to unite people, you have to kind of put your ego aside and truly listen to others."}, {"time": 3723, "text": "What do you love about NumArray?"}, {"time": 3724, "text": "What do you love about Numeric?"}, {"time": 3726, "text": "Like actually get a sense, we were talking about languages earlier, sort of empathize to the culture, the people that love something about this particular API, some of the naming style or the actual usage patterns and truly understand them and so that you can create that same draw in the united thing."}, {"time": 3749, "text": "And you have to also have enough passion that you'll do it."}, {"time": 3752, "text": "It can't be just like a perfunctory, oh yes, I'll listen to you and then I'm not really that excited about it."}, {"time": 3758, "text": "So it really is an aspect, it's a philosophical, like there's a philia, there's a love of esteeming of others."}, {"time": 3764, "text": "It's actually at the heart of what, it's sort of a life philosophy for me, right?"}, {"time": 3769, "text": "That I'm constantly pursuing and that helped, absolutely helped."}, {"time": 3772, "text": "Makes me wonder in a philosophical, like looking at human civilization as one object, it makes me wonder how we can copy and paste Travis's in this book."}, {"time": 3780, "text": "Well, some aspects, maybe."}, {"time": 3783, "text": "Some aspects, right, right, exactly."}, {"time": 3785, "text": "Well, it's a good question."}, {"time": 3787, "text": "How do we teach this?"}, {"time": 3788, "text": "How do we encourage it?"}, {"time": 3789, "text": "How do we lift it?"}, {"time": 3790, "text": "Because so much of the software world, it's giant communities, right?"}, {"time": 3795, "text": "But it seems like so much is moved by, like little individuals."}, {"time": 3798, "text": "You talk about like Linus Torvalds."}, {"time": 3801, "text": "It's like, could you have not, could you have had Linux without him?"}, {"time": 3806, "text": "Yeah, Guido and Python."}, {"time": 3808, "text": "Guido and Python."}, {"time": 3809, "text": "Well, the iPy community particularly, it's like I said, we wanted to build this big thing, but ultimately we didn't."}, {"time": 3813, "text": "What happened is we had Mavericks and champions like John Hunter who created Matplotlib."}, {"time": 3817, "text": "We had Fernando Perez who created iPython."}, {"time": 3819, "text": "And so we sort of inspired each other, but then it kind of, there's sort of a culture of this selfless giving, the stewardship mentality, as opposed to ownership mentality, but stewardship and community focused, community focused, but intentional work."}, {"time": 3836, "text": "Like not waiting for everybody else to do the work, but you're doing it for the benefit of others and not worried about what you're gonna get."}, {"time": 3844, "text": "You're not worried about the credit."}, {"time": 3844, "text": "You're not worried about what you're gonna get."}, {"time": 3845, "text": "You're worried about, I later realized that I have to worry a little about credit, not because I want the credit, because I want people to understand what led to the results."}, {"time": 3853, "text": "Like, I don't, it's not about me."}, {"time": 3855, "text": "It's I want to understand this is what led to the result."}, {"time": 3857, "text": "So let's like, I think doing, and this is what had no impact on the result."}, {"time": 3861, "text": "Like let's promote, just like you said, I want to promote the attributes that help make us better off."}, {"time": 3866, "text": "How do we make more of West McKinney?"}, {"time": 3868, "text": "Like West McKinney was critical to the success of Python because of his creation of pandas, which is the roots of that were all the way back in numeric and num array and numpy, where numpy created an array of records."}, {"time": 3883, "text": "West started to use that almost like a data frame, except it's an array of records."}, {"time": 3887, "text": "And data frame, the challenge is, okay, if you want to augment it at another column, you have to insert, you have to do all this memory movement to insert a column."}, {"time": 3895, "text": "Whereas data frames became, oh, I'm going to have a loose collection of arrays."}, {"time": 3900, "text": "So it's a record of arrays that is a part of a data frame."}, {"time": 3903, "text": "And we thought about that back in the memory days, but West ended up doing the work to build it."}, {"time": 3908, "text": "And then also the operations that were relevant for data processing."}, {"time": 3912, "text": "What I noticed is just that each of these little things creates just another tick, another up."}, {"time": 3917, "text": "So numpy ultimately took a little while, about six months in, people started to join me, Francesc Altad, Robert Kern, Charles Harris."}, {"time": 3927, "text": "And these people are many of the unsung heroes, I would say."}, {"time": 3930, "text": "People who are, you know, they sometimes don't get the credit they deserve because they were critical both to support, like, you know, it's hard and you want, you need some support, people need support."}, {"time": 3940, "text": "And I needed just encouragement."}, {"time": 3941, "text": "And they were helping and encouraged by contributing."}, {"time": 3943, "text": "And once, the big thing for me was when John Hunter, he had previously done kind of a simple thing called numerics to kind of, you know, between numeric and numerae, he had a little high level tool that would just select each one for matplotlib."}, {"time": 3957, "text": "In 2006, he finally said, we're gonna just make numpy the dependency of matplotlib."}, {"time": 3963, "text": "As soon as he did that, and I remember specifically when he did that, I said, okay, we've done it."}, {"time": 3967, "text": "Like, that was when I knew we had to see success."}, {"time": 3971, "text": "Before then it was still unsure, but that kind of started a roller coaster."}, {"time": 3975, "text": "And then 2006 to 2009."}, {"time": 3977, "text": "And then I've been floored by what it's done."}, {"time": 3980, "text": "Like, I knew it would help."}, {"time": 3982, "text": "I had no idea how much it would help."}, {"time": 3986, "text": "And it has to do with, again, the language thing."}, {"time": 3988, "text": "It just, people started to think in terms of numpy."}, {"time": 3992, "text": "And that opened up a whole new way of thinking."}, {"time": 3996, "text": "And part of the story that you kind of mentioned, but maybe you can elaborate, is it seems like at some point in the story, Python took over science and data science."}, {"time": 4011, "text": "And bigger than that, the scientific community started to think like programmers or started to utilize the tools of computers to do, like at a scale that wasn't done with Fortran."}, {"time": 4026, "text": "Like at this gigantic scale, they started to open in their heart."}, {"time": 4030, "text": "And then Python was the thing."}, {"time": 4032, "text": "I mean, there's a few other competitors, I guess, but Python, I think, really, really took over."}, {"time": 4037, "text": "There's a lot of stories here that are kind of during this journey, because this is sort of the start of this journey in 2005, 2006."}, {"time": 4043, "text": "So my tenure committee, I applied for tenure in 2006, 2007."}, {"time": 4048, "text": "It came back, I split the department."}, {"time": 4049, "text": "I was very polarizing."}, {"time": 4051, "text": "I had some huge fans and then some people that said no way, right?"}, {"time": 4054, "text": "So it was very, I was a polarizing figure in the department."}, {"time": 4056, "text": "It went all the way up to the university president."}, {"time": 4059, "text": "Ultimately, my department chair had the sway and they didn't say no."}, {"time": 4063, "text": "They said, come back in two years and do it again."}, {"time": 4066, "text": "And I went, eh, at that point, I was like, I mean, I had this interest in entrepreneurship, this interest in not the academic circles, not the, like, how do we make industry work?"}, {"time": 4079, "text": "So I do have to give credit to that exploration of economics because that led me, oh, I had a lot of opinions."}, {"time": 4086, "text": "I was actually very libertarian at the time."}, {"time": 4089, "text": "And I still have some libertarian trends, but I'm more of a, I'm more of a collectivist libertarian."}, {"time": 4095, "text": "So you value broadly, philosophically freedom."}, {"time": 4098, "text": "I value broadly, philosophically freedom, but I also understand the power of communities, like the power of collective behavior."}, {"time": 4106, "text": "And so what's that balance, right?"}, {"time": 4109, "text": "So by the time I was just, I gotta go out and explore this entrepreneur world."}, {"time": 4113, "text": "So I left academia."}, {"time": 4114, "text": "I said, no thanks, called my friend, Eric, here, who had, his company was going."}, {"time": 4119, "text": "I said, hey, could I join you and start this trend?"}, {"time": 4123, "text": "And he, at that time they were using SciFi a lot."}, {"time": 4125, "text": "They were trying to get clients."}, {"time": 4127, "text": "And so I came down to Texas."}, {"time": 4128, "text": "And in Texas is where I sort of, it's my entrepreneur world, right?"}, {"time": 4133, "text": "I left academia and went to entrepreneur world in 2007."}, {"time": 4137, "text": "So I moved here in 2007, kind of took a leap, knew nothing really about business, knew nothing about a lot of stuff there."}, {"time": 4145, "text": "There's, you know, for a long time, I've kept some connections to a lot of academics because I still value it."}, {"time": 4150, "text": "I still love the scientific tradition."}, {"time": 4152, "text": "I still value the essence and the soul and the heart of what is possible."}, {"time": 4157, "text": "Don't like a lot of the administration and the kind of, we can go into detail about why and where and how this happens, what are some of the challenges."}, {"time": 4166, "text": "I don't know, but I'm with you."}, {"time": 4168, "text": "So I'm still affiliated with MIT."}, {"time": 4171, "text": "I still love MIT because there's magic there."}, {"time": 4175, "text": "There's people I talk to, like researchers, faculty, in those conversations and the whiteboard and just the conversation, that's magic there."}, {"time": 4186, "text": "All the other stuff, the administration, all that kind of stuff seems to, you don't wanna say too harshly criticize sort of bureaucracies, but there's a lag that seems to get in the way of the magic."}, {"time": 4200, "text": "And I'm still have a lot of hope that that can change because I don't often see that particular type of magic elsewhere in the industry."}, {"time": 4212, "text": "So like we need that and we need that flame going."}, {"time": 4215, "text": "And it's the same thing as exactly as you said, it has the same kind of elements like the open source community does."}, {"time": 4223, "text": "And, but then if you, like the reason I stepped away, the reason I'm here, just like you did in Austin is like, if I wanna build one robot, I'll stay at MIT."}, {"time": 4233, "text": "But if I wanna build millions and make money enough to where I can explore the magic of that, then you can't."}, {"time": 4241, "text": "And I think that dance is... That translational dance has been lost a bit, right?"}, {"time": 4247, "text": "And there's a lot of reasons for that."}, {"time": 4248, "text": "I'm not, I'm certainly not an expert on this stuff."}, {"time": 4250, "text": "I can opine like anybody else, but I realized that I wanted to explore entrepreneurship, which I, and really figure out, and it's been a driving passion for 20 years, 25 years."}, {"time": 4261, "text": "How do we connect capital markets and company?"}, {"time": 4266, "text": "Cause again, I fell in love with the notion of, oh, profit seeking on its own is not a bad thing."}, {"time": 4271, "text": "It's actually a coordination mechanism for allocating resources that, you know, in an emergent way, right?"}, {"time": 4278, "text": "That respects everybody's opinions, right?"}, {"time": 4280, "text": "So this is actually powerful."}, {"time": 4281, "text": "So I say all the time, when I make a company and we do something that makes profit, what we're saying is, hey, we're collecting of the world's resources and voluntarily people are asking us to do something that they like."}, {"time": 4293, "text": "And that's a huge deal."}, {"time": 4294, "text": "And so I really liked that energy."}, {"time": 4296, "text": "So that's what I came to do and to learn and to try to figure out."}, {"time": 4298, "text": "And that's what I've been kind of stumbling through since for the past 14 years."}, {"time": 4300, "text": "And that's 2007."}, {"time": 4302, "text": "2007, yeah."}, {"time": 4303, "text": "And so you were still working at NoPi."}, {"time": 4304, "text": "So NoPi was just emerging."}, {"time": 4306, "text": "Just emerging."}, {"time": 4307, "text": "One of the things I've done, it's worth mentioning because it emphasizes the exploratory nature of my thinking at the time."}, {"time": 4313, "text": "I said, well, I don't know how to fund this thing."}, {"time": 4315, "text": "I've got a graduate student I'm paying for and I've got no funding for him."}, {"time": 4317, "text": "And I had done some fundraising from the public to try to get public fundraisers in my lab."}, {"time": 4322, "text": "I didn't really wanna go out and just do the fundraising circuit the way it's traditionally done."}, {"time": 4326, "text": "So I wrote a book and I said, I'm gonna write a book and I'm gonna charge for it."}, {"time": 4331, "text": "It was called Guide to NoPi."}, {"time": 4332, "text": "And so ultimately NoPi became documentation driven development because I basically wrote the book and made sure the stuff worked or the book would work."}, {"time": 4339, "text": "So it really helped actually make NoPi become a thing."}, {"time": 4343, "text": "So writing that book, and it's not a page turner."}, {"time": 4348, "text": "Guide to NoPi is not a book you pick up and go, oh, this is great, over the fire."}, {"time": 4351, "text": "But it's where you could find the details, like how'd all this work."}, {"time": 4354, "text": "And a lot of people love that book."}, {"time": 4356, "text": "And so a lot of people ended up, so I said, look, I need to, so I'm gonna charge for it."}, {"time": 4361, "text": "And I got some flack for that."}, {"time": 4362, "text": "Not that much, just probably five angry messages, people yelling at me saying I was a bad guy for charging for this book."}, {"time": 4371, "text": "Was one of them Richard Stallman?"}, {"time": 4374, "text": "No, I haven't really had any interaction with him personally, like I said, but there were a few, but actually surprisingly not."}, {"time": 4381, "text": "There was actually a lot of people like, no, it's fine, you can charge for a book."}, {"time": 4385, "text": "We know that's a way you can try to make money around open source."}, {"time": 4387, "text": "So what I did, I did it in an interesting way."}, {"time": 4390, "text": "I said, well, kind of my ideas around IP law and stuff."}, {"time": 4394, "text": "I love the idea you can share something, you can spread it."}, {"time": 4396, "text": "Like once it's, the fact that you have a thing and copying is free, but the creation is not free."}, {"time": 4401, "text": "So how do you fund the creation and allow the copying?"}, {"time": 4405, "text": "And in software, it's a little more complicated than that because creation is actually a continuous thing."}, {"time": 4409, "text": "It's not like you build a widget and it's done."}, {"time": 4411, "text": "It's sort of a process of emerging and continuing to create."}, {"time": 4414, "text": "But I wrote the book and had this market determined price thing."}, {"time": 4417, "text": "I said, look, I need, I think I said 250,000."}, {"time": 4420, "text": "If I make 250,000 from this book, I'll make it free."}, {"time": 4424, "text": "So as soon as I get that much money, or I said five years, so there's a time limit."}, {"time": 4428, "text": "Like it's not forever."}, {"time": 4431, "text": "I released it on this."}, {"time": 4433, "text": "And it's actually interesting because one of the people who also thought that was interesting ended up being Chris White, who was the director of DARPA project that we got funding through at Anaconda."}, {"time": 4442, "text": "And the reason he even called us back is because he remembered my name from this book and he thought that was interesting."}, {"time": 4448, "text": "And so even though we hadn't gone to the demo days, we applied and the people said, yeah, nobody ever gets this without coming to the demo day first."}, {"time": 4455, "text": "This is the first time I've seen it."}, {"time": 4456, "text": "But it's because I knew, you know, Chris had done this and had this interaction."}, {"time": 4459, "text": "So it did have impact."}, {"time": 4461, "text": "I was actually really, really pleased by the result."}, {"time": 4463, "text": "I mean, I ended up in three years, I made 90,000."}, {"time": 4467, "text": "So sold 30,000 copies by myself."}, {"time": 4469, "text": "I just put it up on, you know, use PayPal and sold it."}, {"time": 4473, "text": "And that was my first taste of kind of, okay, this can work to some degree."}, {"time": 4477, "text": "And I, you know, all over the world, right?"}, {"time": 4480, "text": "From Germany to Japan to, it was actually, it did work."}, {"time": 4484, "text": "And so I appreciated the fact that PayPal existed and I had a way to get the money, the distribution was simple."}, {"time": 4491, "text": "This is pre Amazon book stuff."}, {"time": 4493, "text": "So it was just publishing a website."}, {"time": 4495, "text": "It was the popularity of SciPy emerging and getting company usage."}, {"time": 4498, "text": "I ended up not letting it go the five years and not trying to make the full amount because, you know, a year and a half later, I was at Enthought."}, {"time": 4505, "text": "I had left academia as an Enthought and I kind of had a full time job."}, {"time": 4507, "text": "And then actually what happened is the documentation people, there's a group that said, hey, we want to do documentation for SciPy as a collective."}, {"time": 4514, "text": "And they're essentially needing the stuff in the book, right?"}, {"time": 4518, "text": "And so they kind of ask, hey, could we just use the stuff in your book?"}, {"time": 4521, "text": "And at that point I said, yeah, I'll just open it up."}, {"time": 4524, "text": "So that's, but it has served its purpose."}, {"time": 4527, "text": "And the money that I made actually funded my grad student."}, {"time": 4531, "text": "Like it was actually, you know, I paid him 25,000 a year out of that money."}, {"time": 4535, "text": "So the funny thing is if you do a very similar kind of experiment now with NumPy or something like it, you could probably make a lot more."}, {"time": 4542, "text": "It's probably true."}, {"time": 4543, "text": "Because of the tooling and the community building."}, {"time": 4547, "text": "Like the, and social media, that there's just a virality to that kind of idea."}, {"time": 4552, "text": "There'd be things to do."}, {"time": 4553, "text": "I've thought about that."}, {"time": 4554, "text": "And really I thought about a couple of books or a couple of things that could be done there."}, {"time": 4557, "text": "And I just haven't, right?"}, {"time": 4558, "text": "Even, I tried to hire a ghostwriter this year too to see if that could help, but it didn't."}, {"time": 4564, "text": "But part of my problem is this, I've been so excited by a number of things that have stemmed from that."}, {"time": 4569, "text": "Like, so I came here, worked at Enthought for four years, graciously, Eric made me president."}, {"time": 4574, "text": "Then we started to work closely together."}, {"time": 4576, "text": "We actually helped him buy out his partner."}, {"time": 4579, "text": "It didn't end great."}, {"time": 4580, "text": "Like unfortunately Eric and I aren't real, aren't friends now."}, {"time": 4584, "text": "I still respect him."}, {"time": 4585, "text": "I have a lot, I wish we were, but he didn't like the fact that Peter and I started Anaconda, right?"}, {"time": 4591, "text": "That was not, I mean, so there's two sides to that story."}, {"time": 4596, "text": "So I'm not gonna go into it, right?"}, {"time": 4598, "text": "But you, as human beings and you wish you still could be friends."}, {"time": 4603, "text": "It saddens me."}, {"time": 4605, "text": "I mean, that's a story of great minds building great companies."}, {"time": 4611, "text": "Somehow it's sad that when there's that kind of."}, {"time": 4615, "text": "And I hold him in esteem."}, {"time": 4617, "text": "I'm grateful for him."}, {"time": 4618, "text": "I think Enthought still exists."}, {"time": 4620, "text": "They're doing great work helping scientists."}, {"time": 4622, "text": "They still run the SciPy conference."}, {"time": 4625, "text": "They have an R&D platform they're selling now that's a tool that you can go get today, right?"}, {"time": 4630, "text": "So Enthought has played a role in the SciPy in supporting the community around SciPy, I would say."}, {"time": 4638, "text": "They ended up not being able to, they ended up building a tool suite to write GUI applications."}, {"time": 4644, "text": "Like that's where they could actually make that the business could work."}, {"time": 4646, "text": "And so supporting SciPy and NumPy itself wasn't as possible."}, {"time": 4650, "text": "Like they didn't, they tried."}, {"time": 4651, "text": "I mean, it was not just because, it was just because of the business aspect."}, {"time": 4654, "text": "So, and I wanted to build a company that could do, that could get venture funding, right?"}, {"time": 4659, "text": "Better for worse."}, {"time": 4659, "text": "I mean, that's a longer story."}, {"time": 4661, "text": "We could talk a lot about that, but."}, {"time": 4662, "text": "And that's where Anaconda came to be."}, {"time": 4664, "text": "That's where Anaconda came to be."}, {"time": 4665, "text": "So let me ask you, it's a little bit for fun because you built this amazing thing."}, {"time": 4670, "text": "And so let's talk about like an old warrior looking over old battles."}, {"time": 4677, "text": "You've, you know, there's a sad letter in 2012 that you wrote to the NumPy mailing list announcing that you're leaving NumPy."}, {"time": 4686, "text": "And some of the things you've listed as some of the things you regret or not regret necessarily, but some things to think about."}, {"time": 4694, "text": "If you could go back and you could fix stuff about NumPy or both sort of in a personal level, but also like looking forward, what kind of things would you like to see changed?"}, {"time": 4705, "text": "So I think there's technical questions and social questions right there."}, {"time": 4709, "text": "First of all, you know, I wrote NumPy as a service and I spent a lot of time doing it."}, {"time": 4715, "text": "And then other people came help make it happen."}, {"time": 4716, "text": "NumPy succeeded because the work of a lot of people, right?"}, {"time": 4719, "text": "So it's important to understand that."}, {"time": 4722, "text": "I'm grateful for the opportunity, the role I had, I could play and grateful that things I did had an impact, but they only had the impact they had because the other people that came to the story."}, {"time": 4732, "text": "And so they were essential, but the way data types were handled, the way data types, we had array scalers, for example, that are really just a substitute for a type concept, right?"}, {"time": 4744, "text": "So we had array scalers or actual Python objects so that there's for every, for a 32 bit float or a 16 bit float or a 16 bit integer, Python doesn't have a natural, it's just one integer, there's one float."}, {"time": 4757, "text": "Well, what about these lower precision types, these larger precision types?"}, {"time": 4761, "text": "So we had them in NumPy so that you could have a collection of them, but then have an object in Python that was one of them."}, {"time": 4768, "text": "And there's questions about like in retrospect, I wouldn't have created those if it improved the type system."}, {"time": 4774, "text": "And like made the type system actually a Python type system as opposed to currently, it's a Python one level type system."}, {"time": 4781, "text": "I don't know if you know the difference between Python one, Python two, it's kind of technical, kind of depth, but Python two, one of its big things that Guido did, it was really brilliant."}, {"time": 4788, "text": "It was the actually Python one, all classes, new objects were one."}, {"time": 4795, "text": "If you as a user wrote a class, it was an instance of a single Python type called the class type, right?"}, {"time": 4802, "text": "In Python two, he used a meta typing hook to actually go, oh, we can extend this and have users write classes that are new types."}, {"time": 4810, "text": "So he was able to have your user classes be actual types and the Python type system got a lot more rich."}, {"time": 4816, "text": "I barely understood that at the time that NumPy was written."}, {"time": 4819, "text": "And so I essentially in NumPy created a type system that was Python one era."}, {"time": 4824, "text": "It was every D type is an instance of the same type as opposed to having new D types be really just Python types with additional metadata."}, {"time": 4834, "text": "What's the cost of that?"}, {"time": 4835, "text": "Is it efficiency, is it usability?"}, {"time": 4837, "text": "It's usability primarily."}, {"time": 4838, "text": "The cost isn't really efficiency."}, {"time": 4840, "text": "It's the fact that it's clumsy to create new types."}, {"time": 4845, "text": "And then one of the challenges, you wanna create new types."}, {"time": 4848, "text": "You wanna quaternion type or you wanna add a new posit type or you wanna, so it's hard."}, {"time": 4855, "text": "And now, if we had done that well, when Numba came on the scene where we could actually compile Python code, it would integrate with that type system much cleaner."}, {"time": 4865, "text": "And now all of a sudden you could do gradual typing more easily."}, {"time": 4868, "text": "You could actually have Python when you add Numba plus better typing, could actually be a, you'd smooth out a lot of rough edges."}, {"time": 4876, "text": "But there's already, there's like, but are you talking about from the perspective of developers within NumPy or users of NumPy?"}, {"time": 4883, "text": "Developers of new, not really users of NumPy so much."}, {"time": 4887, "text": "It's the development of NumPy."}, {"time": 4888, "text": "So you're thinking about like how to design NumPy so that it's contributors."}, {"time": 4893, "text": "Yeah, the contributors, it's easier."}, {"time": 4896, "text": "It's less work to make it better and to keep it maintained."}, {"time": 4899, "text": "And where that's impacted things, for example, is the GPU."}, {"time": 4903, "text": "Like all of a sudden GPUs start getting added and we don't have them in NumPy."}, {"time": 4908, "text": "Like NumPy should just work on GPUs."}, {"time": 4910, "text": "The fact that we'd have to download a whole other object called Kupy to have arrays on GPUs is just an artifact of history."}, {"time": 4917, "text": "Like there's no fundamental reason for it."}, {"time": 4919, "text": "Well, that's really interesting."}, {"time": 4920, "text": "If we could sort of go on that tangent briefly is you have PyTorch and other libraries like TensorFlow that basically tried to mimic NumPy."}, {"time": 4931, "text": "Like you've created a sort of platonic form of multi dimension."}, {"time": 4935, "text": "Basically, yeah."}, {"time": 4937, "text": "Well, and the problem was I didn't realize that."}, {"time": 4939, "text": "Platonic form has a lot of edges."}, {"time": 4941, "text": "They're like, well, we should cut those out before we present it."}, {"time": 4944, "text": "So I wonder if you can comment, is there like a difference between their implementations?"}, {"time": 4949, "text": "Do you wish that they were all using NumPy or like in this abstraction of GPU?"}, {"time": 4954, "text": "And sorry to interrupt that there's GPUs, ASICs."}, {"time": 4958, "text": "There might be other neuromorphic computing."}, {"time": 4960, "text": "There might be other kind of, or the aliens will come with a new kind of computer."}, {"time": 4963, "text": "Like an abstraction that NumPy should just operate nicely over the things that are more and more and smarter and smarter with this multi dimensional arrays."}, {"time": 4975, "text": "There's several comments there."}, {"time": 4976, "text": "We are working on something now called data dash APIs.org."}, {"time": 4980, "text": "Data dash API.org, you can go there today."}, {"time": 4982, "text": "And it's our answer."}, {"time": 4984, "text": "It's my answer."}, {"time": 4985, "text": "It's not just me."}, {"time": 4986, "text": "It's me and Rolf and Athen and Aaron and a lot of companies are helping us at Quansight Labs."}, {"time": 4993, "text": "It's not unifying all the arrays."}, {"time": 4994, "text": "It's creating an API that is unified."}, {"time": 4997, "text": "So we do care about this and we're trying to work through it."}, {"time": 5001, "text": "I actually had the chance to go and meet with the TensorFlow team and the PyTorch team and talk to them after exiting Anaconda."}, {"time": 5009, "text": "Just talking about, because the first year after leaving Anaconda in 2018, I became deeply aware of this and realized that, oh, this split in the array community that exists today makes what I was concerned about in 2005 pretty parochial."}, {"time": 5024, "text": "It's a lot worse, right?"}, {"time": 5025, "text": "Now there's a lot more people."}, {"time": 5027, "text": "So perhaps the industry can sustain more stacks, right?"}, {"time": 5031, "text": "There's a lot of money, but it makes it a lot less efficient."}, {"time": 5034, "text": "I mean, but I've also learned to appreciate, it's okay to have some competition."}, {"time": 5038, "text": "It's okay to have different implementations, but it's better if you can at least refactor some parts."}, {"time": 5043, "text": "I mean, you're gonna be more efficient if you can refactor parts."}, {"time": 5047, "text": "It's nice to have competition over things, over what is nice to have competition."}, {"time": 5051, "text": "They're innovative."}, {"time": 5052, "text": "Yeah, innovative."}, {"time": 5053, "text": "And then maybe on the infrastructure, whatever, however you define infrastructure, that maybe it's nice to have come together."}, {"time": 5061, "text": "Exactly, I agree."}, {"time": 5062, "text": "And I think, but it was interesting to hear the stories."}, {"time": 5064, "text": "I mean, TensorFlow came out of a C++ library, Jeff Dean wrote, I think, that was basically how they were doing inference, right?"}, {"time": 5073, "text": "And then they realized, oh, we could do this TensorFlow thing."}, {"time": 5076, "text": "That C++ library, then what was interesting to me was the fact that both Google and Facebook did not, it's not like they supported Python or NumPy initially."}, {"time": 5084, "text": "They just realized they had to."}, {"time": 5087, "text": "They came to this world and then all the users were like, hey, where's the NumPy interface?"}, {"time": 5090, "text": "Oh, and then they kind of came late to it and then they had these bolt ons."}, {"time": 5094, "text": "TensorFlow's bolt on, I don't mean to offend, but it was so bad."}, {"time": 5098, "text": "Yeah, it was bad."}, {"time": 5099, "text": "It's the first time that I'm usually, I mean, one of the challenges I have is I don't criticize enough in the sense that I don't give people input enough, you know, if."}, {"time": 5109, "text": "I think it's universally agreed upon that the bolt ons on TensorFlow were."}, {"time": 5113, "text": "But I went to, it was a talk given at Mallorca in Spain and a great guy came and gave a talk and I said, you should never show that API again at a PyData conference."}, {"time": 5123, "text": "Like that was, that's terrible."}, {"time": 5124, "text": "Like you're taking this beautiful system we've created and like you're corrupting all these poor Python people, forcing them to write code like that or thinking they should."}, {"time": 5132, "text": "Fortunately, you know, they adopted Keras as their, and Keras is better."}, {"time": 5136, "text": "And so Keras, TensorFlow is fine, is reasonable, but they bolted it on."}, {"time": 5142, "text": "Facebook did too."}, {"time": 5143, "text": "Like Facebook had their own C++ library for doing inference and they also had the same reaction, they had to do this."}, {"time": 5151, "text": "One big difference is Facebook, maybe because of the way it's situated in part of fair, part of the research library, TensorFlow is definitely used and, you know, they have to make, they couldn't just open it up and let the community, you know, change what that is."}, {"time": 5163, "text": "Cause I guess they were worried about disrupting their operations."}, {"time": 5166, "text": "Facebook's been much more open to having community input on the structure itself."}, {"time": 5172, "text": "Whereas Google and TensorFlow, they're really eager to have community users, people use it and build the infrastructure, but it's much more walled."}, {"time": 5178, "text": "Like it's harder to become a contributor to TensorFlow."}, {"time": 5181, "text": "And it's also, this is very difficult question to answer and don't mean to be throwing shade at anybody, but you have to wonder, it's the Microsoft question of when you have a tool like PyTorch or TensorFlow, how much are you tending to the hackers and how much are you tending to the big corporate clients?"}, {"time": 5200, "text": "So like the ones that, do you tend to the millions of people that are giving you almost no money, or do you tend to the few that are giving you a ton of money?"}, {"time": 5210, "text": "I tend to stand with the people."}, {"time": 5214, "text": "Cause I feel like if you nurture the hackers, you will make the right decisions in the longterm that will make the companies happy."}, {"time": 5222, "text": "I lean that way too."}, {"time": 5224, "text": "But then you have to find the right dance."}, {"time": 5225, "text": "But it's a balance."}, {"time": 5227, "text": "Cause you can lean to the hackers and run out of money."}, {"time": 5231, "text": "Which has been some of the challenge I've faced in the sense that, like I would look at some of the experiments, like NumPy, the fact that we have this split is a factor of I wasn't able to collect more money towards NumPy development."}, {"time": 5244, "text": "I mean, I didn't succeed in the early days of getting enough financial contribution to NumPy so that they could work on it."}, {"time": 5251, "text": "I couldn't work on it full time."}, {"time": 5252, "text": "I had to just catch an hour here, an hour there."}, {"time": 5255, "text": "And I basically not liked that."}, {"time": 5257, "text": "Like I've wanted to be able to do something about that for a long time and try to figure out how, well, there's lots of ways."}, {"time": 5262, "text": "I mean, possibly one could say, we had an offer from Microsoft at early days of Anaconda."}, {"time": 5268, "text": "2014, they offered to come buy us, right?"}, {"time": 5271, "text": "The problem was the right people at Microsoft didn't offer to buy us."}, {"time": 5273, "text": "And they were still, they were, it was really a, we were like a second, they had really bought, they just bought R, the R company called, it was not R studio, but it was another R company that was emergent."}, {"time": 5285, "text": "And it was kind of a, well, we should also get a Python play, but they were really doubling down on R. Right?"}, {"time": 5292, "text": "And so it was like, it was where you would go to die."}, {"time": 5294, "text": "So it's not, it wasn't, it was before Satya was there."}, {"time": 5297, "text": "Satya had just started."}, {"time": 5298, "text": "Just started."}, {"time": 5300, "text": "And the offer was coming from someone two levels down from him."}, {"time": 5303, "text": "Got you."}, {"time": 5304, "text": "And if it had come from Scott Guthrie, so I got a chance to meet Scott Guthrie, great guy, I like him."}, {"time": 5309, "text": "If an offer had come from him, probably would be at Microsoft right now."}, {"time": 5314, "text": "That would be really nice actually, especially given what Microsoft has since done for the open source community and all those things."}, {"time": 5320, "text": "Yes, I think they're doing well."}, {"time": 5321, "text": "I really like some of the stuff they've been doing."}, {"time": 5323, "text": "They're still working, and they've, you know, they've hired Guido now, and they've hired a lot of Python developers."}, {"time": 5327, "text": "Wait, Guido's not at Microsoft?"}, {"time": 5329, "text": "Yeah, he works at Microsoft."}, {"time": 5330, "text": "I need to."}, {"time": 5332, "text": "Which, he retired, then he came out of retirement, and he's working now."}, {"time": 5335, "text": "I was just talking to him, and he didn't mention this person."}, {"time": 5338, "text": "I should investigate this further."}, {"time": 5342, "text": "Because I know he loved Dropbox, but I wasn't sure what he was doing, who he was up to."}, {"time": 5345, "text": "Well, he was kind of saying he'd retire, but, and it's literally been five years since I last sat down and really talked to Guido."}, {"time": 5353, "text": "Guido's a technology expert, right?"}, {"time": 5356, "text": "He's a, so I came, I was excited because I'd finally figured out the type system for NumPy."}, {"time": 5360, "text": "I wanted to kind of talk about that with him, and I kind of overwhelmed him."}, {"time": 5363, "text": "Could you stay in that, just for a brief moment, because you're a fascinating person in the history of programming."}, {"time": 5369, "text": "He is a fascinating person."}, {"time": 5371, "text": "What have you learned from Guido about programming, about life?"}, {"time": 5378, "text": "A lot, actually."}, {"time": 5379, "text": "I've been a fan of Guido's."}, {"time": 5380, "text": "You know, we have a chance to talk."}, {"time": 5382, "text": "Some, I wouldn't say, you know, we talk all the time."}, {"time": 5385, "text": "He may, but we talk enough to, I respect his, in fact, when I first started NumPy, one of the first things I did was I had a, I asked Guido for a meeting with him and Paul Dubois in San Mateo."}, {"time": 5395, "text": "And I went and met him for lunch."}, {"time": 5396, "text": "And basically, to say, maybe we can actually, part of the strategy for NumPy was to get it into Python 3, and maybe be part of Python."}, {"time": 5404, "text": "And so we talked about that."}, {"time": 5405, "text": "That's a cool conversation."}, {"time": 5406, "text": "And about that approach, right?"}, {"time": 5406, "text": "I would have loved to be a flyer in the water."}, {"time": 5410, "text": "And over the years for Guido, I learned, so he was open."}, {"time": 5414, "text": "Like, he was willing to listen to people's ideas."}, {"time": 5419, "text": "And over the years, now generally, you know, I'm not saying universally that's been true, but generally that's been true."}, {"time": 5424, "text": "So he's willing to listen."}, {"time": 5425, "text": "He's willing to defer."}, {"time": 5427, "text": "Like on the scientific side, he would just kind of defer."}, {"time": 5429, "text": "He didn't really always understand what we were doing."}, {"time": 5431, "text": "And he'd defer."}, {"time": 5432, "text": "One place where he didn't enough was we missed a matrix multiply operator."}, {"time": 5437, "text": "Like that finally got added to Python, but about 10 years later than it should have."}, {"time": 5442, "text": "But the reason was because nobody, it takes a lot of effort."}, {"time": 5446, "text": "And I learned this while I was writing NumPy."}, {"time": 5448, "text": "I also wrote tools to Python."}, {"time": 5449, "text": "I began with Python Dev, and I added some pieces to Python."}, {"time": 5452, "text": "Like the memory view object."}, {"time": 5453, "text": "I wanted the structure of NumPy into Python."}, {"time": 5455, "text": "So we didn't get NumPy into Python, but we got the basic structure of it into Python."}, {"time": 5459, "text": "Like, so you could build on it."}, {"time": 5461, "text": "Nobody did for a while, but eventually database authors started to."}, {"time": 5464, "text": "And it's a lot better."}, {"time": 5466, "text": "And also Antoine Petrou and Stefan Krah actually fixed the memory view object."}, {"time": 5470, "text": "Cause I wrote the underlying infrastructure in C, but the Python exposure was terrible until they came in and fixed it."}, {"time": 5476, "text": "Partly because I was writing NumPy, and NumPy was the Python exposure."}, {"time": 5479, "text": "I didn't really care about if you didn't have NumPy installed."}, {"time": 5482, "text": "Anyway, Guido opened up ideas, technologically brilliant."}, {"time": 5487, "text": "Like really, I really got a lot of respect for him when I saw what he did with this type class merger thing."}, {"time": 5493, "text": "It was actually tricky, right?"}, {"time": 5495, "text": "And then willing to share, willing to share his ideas."}, {"time": 5498, "text": "So the other thing early on in 1998, I said, I wrote my first extension module."}, {"time": 5502, "text": "The reason I could is because he'd written this blog post on how to do reference counting, right?"}, {"time": 5507, "text": "And without it, I would have been lost, right?"}, {"time": 5510, "text": "But he was willing to at least try to write this post."}, {"time": 5513, "text": "And so he's been motivated early on with Python."}, {"time": 5516, "text": "There's a computer science for everybody."}, {"time": 5518, "text": "You kind of have this early on desire to, oh, maybe we should be pushing programming to more people."}, {"time": 5522, "text": "So he had this populist notion, I guess, or populist sense to learn that there's a certain skill, and I've seen it in other people too, of engaging with contributors sufficiently to, because when somebody engaged with you and wants to contribute to you, if you ignore them, they go away."}, {"time": 5538, "text": "So building that early contributor base requires real engagement with other people."}, {"time": 5543, "text": "And he would do that."}, {"time": 5544, "text": "Can you also comment on this tragic stepping down from his position as the benevolent dictator for life over the wars, you know?"}, {"time": 5555, "text": "The Walrus operator?"}, {"time": 5556, "text": "The Walrus operator was the last battle."}, {"time": 5559, "text": "I don't know if that's the cause of it, but there's this, for people who don't know, you can look up, there's the Walrus operator, which looks like a colon and equal sign."}, {"time": 5569, "text": "Yeah, colon, equal sign."}, {"time": 5570, "text": "And it actually does maybe the thing that an equal sign should be doing."}, {"time": 5577, "text": "Yeah, maybe, right, exactly."}, {"time": 5580, "text": "But it's just historically, equal sign means something else."}, {"time": 5583, "text": "It just means assignment."}, {"time": 5585, "text": "So he stepped down over this."}, {"time": 5587, "text": "What do you think about the pressure of leadership?"}, {"time": 5590, "text": "It's something that, you mentioned the letter I wrote in NumPy at the time."}, {"time": 5593, "text": "That was a hard time, actually."}, {"time": 5595, "text": "I mean, there's been really hard times."}, {"time": 5599, "text": "You get criticized, right?"}, {"time": 5600, "text": "And you get pushed, and you get, not everybody loves what you do."}, {"time": 5603, "text": "Like anytime you do anything that has impact at all, you're not universally loved, right?"}, {"time": 5608, "text": "You get some real critics."}, {"time": 5609, "text": "And that's an important energy, because it's impossible for you to do everything right."}, {"time": 5615, "text": "You need people to be pushing."}, {"time": 5617, "text": "But sometimes people can get mean, right?"}, {"time": 5619, "text": "People can, I prefer to give people the benefit of the doubt."}, {"time": 5623, "text": "I don't immediately assume they have bad intentions."}, {"time": 5625, "text": "And maybe for other, maybe that doesn't happen for everybody."}, {"time": 5629, "text": "For whatever reason, their past, their experiences with people, they sometimes have bad, so they immediately attribute to you bad intentions."}, {"time": 5634, "text": "So you're like, where did this come from?"}, {"time": 5636, "text": "I mean, I'm definitely open to criticism, but I think you're misinterpreting the whole point."}, {"time": 5640, "text": "Because I would get that, certainly when I started Anaconda."}, {"time": 5645, "text": "Sometimes I say to people, I care enough about entrepreneurship to make some open source people uncomfortable."}, {"time": 5652, "text": "And I care enough about open source to make investors uncomfortable."}, {"time": 5655, "text": "So I sort of, you create kind of doubters on both sides."}, {"time": 5659, "text": "So when you have, and this is just a plea to the listener and the public, I've noticed this too, that there's a tendency, and social media makes this worse, when you don't have perfect information about the situation, you tend to fill the gaps with the worst possible, or at least a bad story that fills those gaps."}, {"time": 5683, "text": "And I think it's good to live life, maybe not fully naively, but filling in the gaps with the good, with the best, with the positive, with the hopeful explanation of why you see this."}, {"time": 5697, "text": "So if you see somebody like you trying to make money on a book about an umpire, there's a million stories around that that are positive."}, {"time": 5704, "text": "And those are good to think about, to project positive intent on the people."}, {"time": 5710, "text": "Because for many reasons, usually because people are good and they do have good intent."}, {"time": 5715, "text": "And also when you project that positive intent, people will step up to that too."}, {"time": 5720, "text": "It's a great point."}, {"time": 5721, "text": "It has this kind of viral nature to it."}, {"time": 5724, "text": "And of course with Twitter, early on figured out, and Facebook is that they can make a lot of money and engagement from the negative."}, {"time": 5733, "text": "So there's this, we're fighting this mechanism."}, {"time": 5736, "text": "Which is challenging."}, {"time": 5737, "text": "It's just easier to be."}, {"time": 5738, "text": "To be negative."}, {"time": 5739, "text": "And then for some reason, something in our minds really enjoys sharing that and getting all excited about the negativity."}, {"time": 5746, "text": "We do, yeah."}, {"time": 5747, "text": "Some protective mechanism perhaps that we're gonna get eaten if we don't, yeah."}, {"time": 5752, "text": "For us to be effective as a group of people in a software engineering project, you have to project positive intent, I think."}, {"time": 5757, "text": "Totally agree."}, {"time": 5758, "text": "And I think that's very, and so that happens in this space."}, {"time": 5761, "text": "But Python has done a reasonable job in the past, but here is a situation where I think it started to get this pressure where it didn't."}, {"time": 5767, "text": "I really didn't, I didn't know enough about what happened."}, {"time": 5770, "text": "I've talked to several people about it."}, {"time": 5772, "text": "And I know most of the steering committee members today, one person nominated me for that role, but it's the wrong role for me right now, right?"}, {"time": 5780, "text": "I have a lot of respect for the Python developer space and the Python developers."}, {"time": 5785, "text": "I also understand the gap between computer science Python developers and array programming developers or science developers."}, {"time": 5791, "text": "And in fact, Python succeeds in the array space the more it has people in that boundary."}, {"time": 5796, "text": "And there's often very few."}, {"time": 5797, "text": "Like I was playing a role in that boundary and working like everything to try to keep up with even what Guido was saying, like I'm a C programmer, but not a computer scientist."}, {"time": 5809, "text": "Like I was an engineer and physicist and mathematician, and I didn't always understand what they were talking about and why they would have opinions the way they did."}, {"time": 5818, "text": "So, you know, you have to listen and try to understand."}, {"time": 5820, "text": "Then you also have to explain your point of view in a way they can understand."}, {"time": 5823, "text": "And that takes a lot of work."}, {"time": 5824, "text": "And that communication is always the challenge."}, {"time": 5827, "text": "And it's just what we're describing here about the negativity is just another form of that."}, {"time": 5831, "text": "Like how do we come together?"}, {"time": 5832, "text": "And it does appear we're wired anyway to at least have a, there's a part of us that will enemy, you know, friend, enemy."}, {"time": 5838, "text": "And we see, yeah, it's like, why are we wiring on the enemy front?"}, {"time": 5843, "text": "So why are we pushing that?"}, {"time": 5844, "text": "Why are we promoting that so deeply?"}, {"time": 5846, "text": "Assume friend until proven otherwise."}, {"time": 5850, "text": "So, cause you have such a fascinating mind in all of this."}, {"time": 5852, "text": "Let me just ask you these questions."}, {"time": 5854, "text": "So one interesting side on the Python history is the move from Python two to Python three."}, {"time": 5861, "text": "You mentioned move from Python one to Python two, but the move from Python two to Python three is a little bit interesting because it took a very long time."}, {"time": 5870, "text": "It broke, you know, quite a small way backward compatibility, but even that small way seemed to have been very painful for people."}, {"time": 5878, "text": "Is there lessons you draw?"}, {"time": 5880, "text": "Oh man, tons of lessons."}, {"time": 5881, "text": "From how long it took and how painful it seemed to be?"}, {"time": 5885, "text": "Yeah, tons of lessons."}, {"time": 5887, "text": "Well, I mentioned here earlier that NumPy was written in 2005."}, {"time": 5891, "text": "It was in 2005 that I actually went to Guido to talk about getting NumPy into Python three."}, {"time": 5897, "text": "Like my strategy was to, oh, we were moving to Python three."}, {"time": 5899, "text": "Let's have that be, and it seems funny in retrospect because like, wait, Python three, that was in 2020, right?"}, {"time": 5905, "text": "When we finally ended the support for Python two or at least 2017."}, {"time": 5909, "text": "The reason it took a long time, a lot of time, I think it was because one of the things is there wasn't much to like about Python three."}, {"time": 5916, "text": "3.0, 3.1, it really wasn't until 3.3."}, {"time": 5920, "text": "Like I consider Python 3.3 to be Python 3.0."}, {"time": 5923, "text": "But it wasn't until Python 3.3 that I felt there's enough stuff in it to make it worth anybody using it, right?"}, {"time": 5929, "text": "And then 3.4 started to be, oh yeah, I want that."}, {"time": 5932, "text": "And then 3.5 as the matrix multiply operator, and now it's like, okay, we gotta use that."}, {"time": 5936, "text": "Plus the libraries that started leveraging some of the features of Python three."}, {"time": 5940, "text": "So it really, the challenge was it was, but it also illustrated a truism that, you know, when you have inertia, when you have a group of people using something, it's really hard to move them away from it."}, {"time": 5951, "text": "You can't just change the world on them."}, {"time": 5953, "text": "And Python three, you know, made some, I think it fixed some things Guido had always hated."}, {"time": 5957, "text": "I don't think he didn't like the fact that print was a statement."}, {"time": 5959, "text": "He wanted to make it a function."}, {"time": 5960, "text": "But in some sense, that's a bit of gratuitous change to the language."}, {"time": 5964, "text": "And you could argue, and people have, but one of the challenges was there wasn't enough features and too many just changes without features."}, {"time": 5974, "text": "And so the empathy for the end user as to why they would switch wasn't there."}, {"time": 5980, "text": "I think also it illustrated just the funding realities."}, {"time": 5982, "text": "Like Python wasn't funded."}, {"time": 5985, "text": "Like it was also a project with a bunch of volunteer labor, right?"}, {"time": 5988, "text": "It had more people, so more volunteer labor, but it was still, it was fun in the sense that at least Guido had a job."}, {"time": 5993, "text": "And I've learned some of the behind the scenes on that now since talking to people who have lived through it and maybe not on air, we can talk about some of that."}, {"time": 6000, "text": "But it's interesting to see, but Guido had a job, but his full time job wasn't just work on Python."}, {"time": 6007, "text": "Like he had other things to do."}, {"time": 6008, "text": "Just wild."}, {"time": 6009, "text": "It is wild, isn't it?"}, {"time": 6010, "text": "It's wild how few people are funded."}, {"time": 6014, "text": "And how much impact they have."}, {"time": 6016, "text": "Maybe that's a feature not a bug, I don't know."}, {"time": 6017, "text": "Maybe, yes, exactly."}, {"time": 6019, "text": "At least early on, like it's sort of, I know, yeah."}, {"time": 6021, "text": "It's like Olympic athletes are often severely underfunded, but maybe that's what brings out the greatness."}, {"time": 6027, "text": "Perhaps, yes, correct."}, {"time": 6029, "text": "Maybe this is the essential part of it."}, {"time": 6031, "text": "Because I do think about that in terms of, I currently have an incubator for open source startups."}, {"time": 6036, "text": "Like what I'm trying to do right now is create the environment I wished had existed when I was leaving academia with NumPy and trying to figure out what to do."}, {"time": 6044, "text": "I'm trying to create those opportunities and environments."}, {"time": 6046, "text": "So, and that's what drives me still, is how do I make the world easier for the open source entrepreneur?"}, {"time": 6052, "text": "So let me stay, I mean, I could probably stay on NumPy for a long time, but this is fun question."}, {"time": 6060, "text": "So Andre Kapathy leads the Tesla Autopilot team, and he's also one of the most like legit programmers I know."}, {"time": 6070, "text": "It's like he builds stuff from scratch a lot, and that's how he builds intuition about how a problem works."}, {"time": 6076, "text": "He just builds it from scratch, and I always love that."}, {"time": 6078, "text": "And the primary language he uses is Python for the intuition building."}, {"time": 6083, "text": "But he posted something on Twitter saying that they got a significant improvement on some aspect of their like data loading, I think, by switching away from np.square root, so the NumPy's implementation of square root, to math.square root, and then somebody else commented that you can get even a much greater improvement by using the vanilla Python square root, which is like."}, {"time": 6115, "text": "And it's fascinating to me, I just wanted to."}, {"time": 6118, "text": "So that was some shade throwing at some."}, {"time": 6122, "text": "No, no, and yes, we're talking about."}, {"time": 6124, "text": "It's a good way to ask the trade off between usability and efficiency broadly in NumPy, but also on these specific weird quirks of like a single function."}, {"time": 6136, "text": "Yep, so on that point, if you use a NumPy math function on a scaler, it's gonna be slower than using a Python function on that scaler."}, {"time": 6147, "text": "But because the math object in NumPy is more complicated, because you can also call that math object on an array."}, {"time": 6156, "text": "And so effectively, it goes through a similar machine."}, {"time": 6159, "text": "There aren't enough of the, which you would do and you could do like checks and fast paths."}, {"time": 6165, "text": "So yeah, if you're basically doing a list, if you run over a list, in fact, for problems that are less than 1,000, even maybe 10,000 is probably the, if you're going more than 10,000, that's where you definitely need to be using arrays."}, {"time": 6179, "text": "But if you're less than that, and for reading, if you're doing a reading process and essentially it's not compute bound, it's IO bound."}, {"time": 6185, "text": "And so you're really taking lists of 1,000 at a time and doing work on it."}, {"time": 6189, "text": "Yeah, you could be faster just using Python, straight up Python."}, {"time": 6192, "text": "See, but also, and this is the side to the top, there's the fundamental questions when you look at the long arc of history, it's very possible that np.square root is much faster."}, {"time": 6206, "text": "So like in terms of like, don't worry about it, it's the evils of over optimization or whatever, all the different quotes around that, is sometimes obsessing about this particular little quark is not sufficient."}, {"time": 6221, "text": "For somebody like, if you're trying to optimize your path, I mean, I agree, premature optimization creates all kinds of challenges, right?"}, {"time": 6229, "text": "Because now, but you may have to do it."}, {"time": 6231, "text": "I believe the quote is, it's the root of all evil."}, {"time": 6233, "text": "It's the root of all evil, right?"}, {"time": 6235, "text": "Let's give Donald Knuth, I think, or is he more than somebody else?"}, {"time": 6239, "text": "Well, Doc Knuth is kind of like Mark Twain, people just attribute stuff to him, I don't know."}, {"time": 6242, "text": "And it's fine because he's brilliant."}, {"time": 6244, "text": "So, no, I was a LaTeX user myself, and so I have a lot of respect, and he did more than that, of course, but yeah, someone I really appreciate in the computer science space."}, {"time": 6255, "text": "Yeah, I don't, I think that's appropriate."}, {"time": 6257, "text": "There's a lot of little things like that, where people actually, if you understood it, you go, yeah, of course, that's the case."}, {"time": 6262, "text": "And the other part, the other part I didn't mention, and Numba was a thing we wrote early on, and I was really excited by Numba because it's something we wanted, it was a compiler for Python syntax, and I wanted it from the beginning of writing NumPy because of this function question, like taking, the power of arrays is really that you can write functions using all of it."}, {"time": 6285, "text": "It has implicit looping, right?"}, {"time": 6287, "text": "So you don't worry about, I write this n dimensional for loop with four loops, four, four statements."}, {"time": 6291, "text": "You just say, oh, big four dimensional array, I'm gonna do this operation, this plus, this minus, this reduction, and you get this, it's called vectorization in other areas, but you can basically think at a high level and get massive amounts of computation done with the added benefit of, oh, it can be paralyzed easily."}, {"time": 6308, "text": "It can be put in parallel."}, {"time": 6309, "text": "You don't have to think about that."}, {"time": 6310, "text": "In fact, it's worse to go decompose your, you write the for loops and then try to infer parallelism from for loops."}, {"time": 6316, "text": "That's actually a harder problem than to take the array problem and just automatically parallelize that problem."}, {"time": 6322, "text": "That's what, and so functions in NumPy are called universal functions, ufuncs."}, {"time": 6327, "text": "So square root is an example of a ufunk."}, {"time": 6329, "text": "There are others, sine, cosine, add, subtract."}, {"time": 6332, "text": "In fact, one of the first libraries to SciPy was something called Special where I added Bessel functions and all these special functions that come up in physics and I added them as ufuncs so they could work on arrays."}, {"time": 6343, "text": "So I understood ufuncs very, very well from day one inside of numeric."}, {"time": 6345, "text": "That was one of the things we tried to make better in NumPy was how do they work?"}, {"time": 6349, "text": "Can they do broadcasting?"}, {"time": 6350, "text": "What does broadcasting mean?"}, {"time": 6351, "text": "But one of the problems is, okay, what do I do with a Python scaler?"}, {"time": 6357, "text": "So what happens, the Python scaler gets broadcast to a zero dimensional array and then it goes through the whole same machinery as if it were a 10,000 dimensional array."}, {"time": 6365, "text": "And then it kind of unpacks the element and then does the addition."}, {"time": 6369, "text": "That's not to mention the function it calls in the case of square root is just the clib square root, right?"}, {"time": 6375, "text": "In some cases, like Python's power, there's some optimizations they're doing that could be faster than just calling this the clib square root."}, {"time": 6383, "text": "In the interpreter or in the?"}, {"time": 6385, "text": "No, in the C code, in the Python runtime."}, {"time": 6387, "text": "In the Python runtime, so they really optimize it and they have the freedom to do that because they don't have to worry about."}, {"time": 6392, "text": "It's just a scaler."}, {"time": 6394, "text": "Right, they don't have to worry about the fact that, oh, this could be an object with many pieces."}, {"time": 6399, "text": "The ufunc machine is also generic in sense that typecasting and broadcasting, broadcasting's idea of I'm gonna go, I have a zero dimensional array, I have a scaler with a four dimensional array and I add them."}, {"time": 6410, "text": "Oh, I have to kind of coerce the shape of this guy to make it work against the whole four dimensional array."}, {"time": 6416, "text": "So it's the idea of I can do a one dimensional array against a two dimensional array and have it make sense."}, {"time": 6422, "text": "Well, that's what NumPy does is it challenges you to reformulate, rethink your problem as a multi dimensional array problem versus move away from scalers completely."}, {"time": 6432, "text": "Right, exactly, exactly."}, {"time": 6434, "text": "In fact, that's where some of the edge cases boundaries are is that, well, they're still there and this is where array scalers are particular."}, {"time": 6441, "text": "So array scalers are particularly bad in the sense that they were written so that you could optimize the math on them, but that hasn't happened."}, {"time": 6449, "text": "And so their default is to coerce the array scaler to a zero dimensional array and then use the NumPy machinery."}, {"time": 6456, "text": "That's what, and you could specialize, but it doesn't happen all the time."}, {"time": 6459, "text": "So in fact, when we first wrote Numba, we do comparisons and say, look, it's 1000X speed up."}, {"time": 6465, "text": "We were lying a little bit in the sense that, well, first do the 40X slowdown of using the array scalers inside of a loop."}, {"time": 6472, "text": "Cause if you used to use Python scalers, you'd already be 10 times faster."}, {"time": 6476, "text": "But then we would get a hundred times faster over that using just compilation."}, {"time": 6480, "text": "But what we do is compile the loop from out of the interpreter to machine code."}, {"time": 6484, "text": "And then that's always been the power of Python is this extensibility so that you can, cause people say, oh, Python's so slow."}, {"time": 6489, "text": "Well, sure, if you do all your logic in the runtime of the Python interpreter, yeah."}, {"time": 6493, "text": "But the power is that you don't have to."}, {"time": 6495, "text": "You write all the logic, what you do in the high level is just high level logic."}, {"time": 6499, "text": "And the actual calls you're making could be on gigabyte arrays of data."}, {"time": 6504, "text": "And that's all done at compiled speeds."}, {"time": 6506, "text": "And the fact that integration is one can happen, but two is separable."}, {"time": 6512, "text": "That's one of the, the language like Julia says, we're going to be all in one."}, {"time": 6516, "text": "You can do all of it together."}, {"time": 6517, "text": "And then there's, the jury's out, is that possible?"}, {"time": 6519, "text": "I tend to think that you're going to, there's separate concerns there."}, {"time": 6523, "text": "You want to precompile."}, {"time": 6524, "text": "In fact, generally you will want to precompile your, some of your loops."}, {"time": 6528, "text": "Like SciPy is a compilation step."}, {"time": 6530, "text": "To install SciPy, it takes about two hours."}, {"time": 6533, "text": "If you have many machines, maybe you can get it down to one hour."}, {"time": 6535, "text": "But to compile those libraries takes about, takes a while."}, {"time": 6537, "text": "You don't want to do that at runtime."}, {"time": 6539, "text": "You don't want to do that all the time."}, {"time": 6540, "text": "You want to have this precompiled binary available that you're then just linking into."}, {"time": 6544, "text": "So there's real questions about the whole source code."}, {"time": 6549, "text": "Code is, running binary code is more than source code."}, {"time": 6551, "text": "It's creating object code, it's the linker, it's the loader, it's the how does that interpret it inside of virtual memory space."}, {"time": 6557, "text": "There's a lot of details there that actually I didn't understand for a long time until I read books on the topic."}, {"time": 6563, "text": "And it led to, the more you know, the better off you are and you can do more details, but sometimes it helps with abstractions too."}, {"time": 6571, "text": "Well, the problem, as we mentioned earlier with abstractions is you kind of sometimes assume that whoever implemented this thing had your case in mind and found the optimal solution."}, {"time": 6585, "text": "Or like you assume certain things."}, {"time": 6587, "text": "I mean, there's a lot of, Correct."}, {"time": 6589, "text": "One of the really powerful things to me early on, I mean, it sounds silly to say, but with Python, probably one of the reasons I fell in love with it is dictionaries."}, {"time": 6600, "text": "So obviously probably most languages have some mapping concept, but it felt like it was a first class citizen and it was just my brain was able to think in dictionaries."}, {"time": 6612, "text": "But then there's the thing that I guess I still use to this day is order dictionaries because that seems like a more natural way to construct dictionaries."}, {"time": 6622, "text": "And from a computer science perspective, the running time cost is not that significant, but there's a lot of things to understand about dictionaries that the abstraction kind of doesn't necessarily incentivize you to understand."}, {"time": 6637, "text": "Right, do you really understand the notion of a hash map and how the dictionary is implemented?"}, {"time": 6642, "text": "Dictionaries are a good example of an abstraction that's powerful."}, {"time": 6644, "text": "And I agree with you."}, {"time": 6646, "text": "I agree, I love dictionaries too."}, {"time": 6647, "text": "Took me a while to understand that once you do, you realize, oh, they're everywhere."}, {"time": 6650, "text": "And Python uses them everywhere too."}, {"time": 6652, "text": "Like it's actually constructed, one of the foundational things is dictionaries and it does everything with dictionaries."}, {"time": 6657, "text": "So it is, it's powerful."}, {"time": 6658, "text": "Order dictionaries came later, but it is very, very powerful."}, {"time": 6662, "text": "It took me a little while coming from just the array programming entirely to understand these other objects, like dictionaries and lists and tuples and binary trees."}, {"time": 6671, "text": "Like I said, I wasn't a computer scientist, I studied arrays first."}, {"time": 6675, "text": "And so I was very array centric."}, {"time": 6676, "text": "And you realize, oh, these others don't have purposes and value actually."}, {"time": 6682, "text": "There's a friendliness about, like one way to think about arrays is arrays are just like full of numbers, but to make them accessible to humans and make them less error prone to human users, sometimes you want to attach names, human interpretable names that are sticky to those arrays."}, {"time": 6704, "text": "So that's how you start to think about dictionaries is you start to convert numbers into something that's human interpretable."}, {"time": 6712, "text": "And that's actually the tension I've had with NumPy because I've built so much tooling around human interpretability and also protecting me from a year later not making the mistakes by being, I wanted to force myself to use English versus numbers."}, {"time": 6732, "text": "Yes, so there's a project called Labeled Arrays."}, {"time": 6735, "text": "Like very early it was recognized that, oh, we're indexing NumPy with just numbers, all the columns and particularly the dimensions."}, {"time": 6743, "text": "I mean, if you have an image, you don't necessarily need to label each column or row, but if you have a lot of images or you have another dimension, you'd at least like to label the dimension as this is X, this is Y, this is Z, or this is give us some human meaning or some domain specific meaning."}, {"time": 6756, "text": "That was one of the impetuses for Pandas actually was just, oh, we do need to label these things."}, {"time": 6763, "text": "And Label Array was an attempt to add that like a lighter weight version of that."}, {"time": 6767, "text": "And there's been, like, that's an example of something I think NumPy could add, could be added to NumPy, but one of the challenges again, how do you fund this?"}, {"time": 6775, "text": "Like I said, one of the tragedies I think is that, so I never had the chance to, I was never paid to work on NumPy, right?"}, {"time": 6782, "text": "So I've always just done it in my spare time, always taken from one thing, taken from another thing to do it."}, {"time": 6787, "text": "And at the time, I mean, today, it would be the wrong day and today, like paying me to work on NumPy now would not be a good use of effort, but we are finally at Quansight Labs, I'm actually paying people to work on NumPy and SciPy, which is I'm thrilled with, I'm excited by."}, {"time": 6802, "text": "I've wanted to do that."}, {"time": 6802, "text": "That's what I always wanted to do from day one."}, {"time": 6804, "text": "It just took me a while to figure out a mechanism to do that."}, {"time": 6807, "text": "Even like in the university setting, respecting that, like pushing students, young minds and young graduate students to contribute and then figuring out financial mechanisms that enable them to contribute and then sort of reward them for their innovative scientific journey, that would be nice."}, {"time": 6829, "text": "But then also just a better allocation of resources."}, {"time": 6833, "text": "It's 20 year anniversary since 9.11 and I was just looking, we spent over $6 trillion in the Middle East after 9.11 in the various efforts there."}, {"time": 6844, "text": "And sort of to put politics and all that aside, it's just, you think about the education system, all the other ways we could have possibly allocated that money."}, {"time": 6854, "text": "To me, to take it back, the amount of impact you would have by allocating a little bit of money to the programmers that build the tools that run the world is fascinating."}, {"time": 6872, "text": "I don't know, I think, again, there is some aspect to being broke as somewhat of a feature, not a bug, that you make sure that you're valued."}, {"time": 6882, "text": "But you can still manage that."}, {"time": 6883, "text": "Right, no, I know."}, {"time": 6885, "text": "But I don't think that's a big part."}, {"time": 6887, "text": "So it's like, I think you can have enough money and actually be wealthy while maintaining your values."}, {"time": 6893, "text": "Agreed, agreed."}, {"time": 6895, "text": "There's an old adage that nations that trade together don't go to war together."}, {"time": 6899, "text": "I've often thought about nations that code together."}, {"time": 6901, "text": "Yeah, code together."}, {"time": 6904, "text": "Because one of the things I love about open source is it's global, it's multinational."}, {"time": 6907, "text": "Like there aren't national boundaries."}, {"time": 6909, "text": "One of the challenges with business and open source is the fact that, well, business is national."}, {"time": 6912, "text": "Like businesses are entities that are recognized in legal jurisdictions, right?"}, {"time": 6916, "text": "And have laws that are respected in those jurisdictions and hiring, and yet the open source ecosystem is not, it's not there."}, {"time": 6923, "text": "Like currently, one of the problems we're solving is hiring people all over the world, right?"}, {"time": 6927, "text": "Because we, it's a global effort."}, {"time": 6929, "text": "And I've had the chance to work, and I've loved the chance."}, {"time": 6931, "text": "I've never been to like Iran, but I once had a conference where I was able to talk to people there, right?"}, {"time": 6938, "text": "And talk to folks in Pakistan."}, {"time": 6940, "text": "I've never been there, but we had a call where there were people there, like just scientists and normal people."}, {"time": 6947, "text": "And there's a certain amount of humanizing, right?"}, {"time": 6952, "text": "That gets away from the, like we often get the memes of society that bubble up and get discussed, but the memes are not even an accurate reflection of the reality of what people are."}, {"time": 6962, "text": "Well, if you look at the major power centers that are leading to something like cyber war in the next few decades, it's the United States, it's Russia, and China."}, {"time": 6973, "text": "And those three countries in particular have incredible developers."}, {"time": 6978, "text": "So if they work together, I think that's one way, the politicians can do their stupid bickering, but like there's a layer of infrastructure, of humanity."}, {"time": 6987, "text": "If they collaborate together, that I think can prevent major military conflict, which would, I think most likely happen at the cyber level versus the actual hot war level."}, {"time": 7000, "text": "You know, I think that's a good prediction."}, {"time": 7003, "text": "Nations that code together don't go to war together."}, {"time": 7006, "text": "Don't go to war together."}, {"time": 7007, "text": "That's a hope, right?"}, {"time": 7008, "text": "That's one of the philosophical hopes, but yeah."}, {"time": 7012, "text": "So you mentioned the project of Numba, which is fascinating."}, {"time": 7018, "text": "So from the early days, there was kind of a pushback on Python that it's not fast."}, {"time": 7024, "text": "You know, you see C plus, if you wanna write something that's fast, you use C plus plus."}, {"time": 7028, "text": "If you wanna write something that's usable and friendly, but slow, you use Python."}, {"time": 7033, "text": "And so what is Numba?"}, {"time": 7037, "text": "Great, yeah."}, {"time": 7038, "text": "Yes, that's what the argument."}, {"time": 7039, "text": "And the reality was people would write high level coding and use compiled code, but there's still user stories, use cases, where you want to write Python, but then have it still be fast."}, {"time": 7048, "text": "You still need to write a for loop."}, {"time": 7050, "text": "Like before Numba, it was always don't write a for loop."}, {"time": 7053, "text": "You know, write it in a vectorized way, you know, put it in an array."}, {"time": 7057, "text": "And often that can make a memory trade off."}, {"time": 7059, "text": "Like quite often you can do it, but then you make maybe use more memory because you have to build this array of data that you don't necessarily need all the time."}, {"time": 7066, "text": "So Numba was, it started from a desire to have kind of a vectorized that worked."}, {"time": 7072, "text": "A vectorized was a tool in NumPy, it was released."}, {"time": 7076, "text": "You give it a Python function and it gave you a universal function, a ufunc that would work on arrays."}, {"time": 7081, "text": "So you get the function that just worked on a scaler."}, {"time": 7083, "text": "Like you could make a, like the classic case was a simple function that an if then statement in it."}, {"time": 7088, "text": "So sine X over X function, sync function."}, {"time": 7092, "text": "If X equals zero, return one, otherwise do sine X over X."}, {"time": 7096, "text": "The challenge is you don't want that loop peg one in Python."}, {"time": 7098, "text": "So you want a compiled version of that, but the ufunc, the vectorized in NumPy would just give you a Python function."}, {"time": 7104, "text": "So it would take the array of numbers and at every call do a loop back into Python."}, {"time": 7109, "text": "So it was very slow."}, {"time": 7110, "text": "It gave you the appearance of a ufunc, but it was very slow."}, {"time": 7112, "text": "So I always wanted a vectorized that would take that Python scaler function and produce a ufunc working on binary native code."}, {"time": 7119, "text": "So in fact, I had somebody work on that with PyPy and see if PyPy could be used to produce a ufunc like that early on in 2009 or something like that, 2010."}, {"time": 7130, "text": "They didn't work that well."}, {"time": 7131, "text": "It was kind of pretty bulky."}, {"time": 7132, "text": "But in 2012, Peter and I had just started Anaconda."}, {"time": 7137, "text": "We had, I just, I'd learned to raise money."}, {"time": 7140, "text": "That's a different topic, but I'd learned to raise money from friends, family, and fools, as they say."}, {"time": 7149, "text": "Oh, that's a good line."}, {"time": 7151, "text": "But, so we were trying to do something."}, {"time": 7153, "text": "We were trying to change the world."}, {"time": 7154, "text": "Peter and I are super ambitious."}, {"time": 7155, "text": "We wanted to make array computing and we had ideas for really what's still, it's still the energy right now."}, {"time": 7160, "text": "How do you do at scale data science?"}, {"time": 7163, "text": "And we had a bunch of ideas there, but one of them, I had just talked to people about LLVM and I was like, there's a way to do this."}, {"time": 7170, "text": "I just, I went, I heard about my friend Dave Beasley at a compiler course."}, {"time": 7173, "text": "So I was looking at compilers like, and I realized, oh, this is what you do."}, {"time": 7177, "text": "And so I wrote a version of Numba that just basically mapped Python bytecode to LLVM."}, {"time": 7186, "text": "Right, so, and the first version is like, this works and it produces code that's fast."}, {"time": 7190, "text": "This is cool for, you know, obviously a reduced subset of Python."}, {"time": 7193, "text": "I didn't support all the Python language."}, {"time": 7195, "text": "There had been efforts to speed up Python in the past, but those efforts were, I would say, not from the array computing perspective, not from the perspective of wanting to produce a vectorized improvement."}, {"time": 7203, "text": "They were from the perspective of speeding up the runtime of Python, which is fundamentally hard because Python allows for some constructs that aren't, you can't speed up."}, {"time": 7212, "text": "Like it's this generic, you know, when it does this variable."}, {"time": 7215, "text": "So I, from the start, did not try to replicate Python's semantics entirely."}, {"time": 7220, "text": "I said, I'm gonna take a subset of the Python syntax and let people write syntax in Python, but it's kind of a new language really."}, {"time": 7227, "text": "So it's almost like four loops, like focusing on four loops."}, {"time": 7230, "text": "Four loops, scalar arithmetic, you know, typed, you know, really typed language, a typed subset."}, {"time": 7238, "text": "That was the key."}, {"time": 7239, "text": "So, but we wanted to add inference of types."}, {"time": 7241, "text": "So you didn't have to spell all the types out because when you call a function, so Python is typed, it's just dynamically typed."}, {"time": 7248, "text": "So you don't tell it what the types are, but when it runs, every time an object runs, there's a type for the variables."}, {"time": 7253, "text": "You know what it is."}, {"time": 7254, "text": "And so that was the design goals of Numba were to make it possible to write functions that could be compiled and have them used for NumPy arrays."}, {"time": 7263, "text": "Like they needed to support NumPy arrays."}, {"time": 7265, "text": "And so how does it work?"}, {"time": 7267, "text": "Do you add a comment within Python that tells it to do, like how do you help out the compiler?"}, {"time": 7271, "text": "Yeah, so there isn't much actually."}, {"time": 7275, "text": "You don't, it's kind of magical in the sense that it just looks at the type of the objects and then it's typed inference to determine any other variables it needs."}, {"time": 7283, "text": "And then it was also, because we had a use case that could work early."}, {"time": 7288, "text": "Like one of the challenges of any kind of new development is if you have something that to make it work, it was gonna take you a long time, it's really hard to get out off the ground."}, {"time": 7295, "text": "If you have a project where there's some incremental story, it can start working today and solve a problem, then you can start getting it out there, getting feedback."}, {"time": 7304, "text": "Because Numba today, now Numba is nine years old today, the first two, three versions were not great, right?"}, {"time": 7312, "text": "But they solved a problem and some people could try it and we could get some feedback on it."}, {"time": 7315, "text": "Not great in that it was very focused."}, {"time": 7317, "text": "Very fragile, the subset it would actually compile was small and so if you wrote Python code and said, so the way it worked is you write a function and you say at JIT, use decorators."}, {"time": 7329, "text": "So decorators, just these little constructs let you decorate code with an at and then a name."}, {"time": 7335, "text": "The at JIT would take your Python function and actually just compile it and replace the Python function with another function that interacts with this compiled function."}, {"time": 7344, "text": "And it would just do that and we went from Python bytecode then we went to AST."}, {"time": 7349, "text": "I mean, writing compilers actually, I learned a lot about why computer science is taught the way it is because compilers can be hard to write."}, {"time": 7356, "text": "They use tree structures, they use all the concepts of computer science that are needed."}, {"time": 7360, "text": "It's actually hard to, it's easy to write a compiler and then have it be spaghetti code."}, {"time": 7366, "text": "Like the passes become challenging and we ended up with three versions of Numba, right?"}, {"time": 7369, "text": "Numba got written three times."}, {"time": 7371, "text": "What programming language is Numba written in?"}, {"time": 7375, "text": "Python."}, {"time": 7376, "text": "Wait, okay."}, {"time": 7377, "text": "Yeah, Python."}, {"time": 7381, "text": "Yeah, so Python, but then the whole goal of Numba is to translate Python bytecode to LLVM."}, {"time": 7387, "text": "And so LLVM actually does the code generation."}, {"time": 7389, "text": "In fact, a lot of times they'd say, yeah, it's super easy to write a compiler if you're not writing the parser nor the code generator."}, {"time": 7396, "text": "So for people who don't know, LLVM is a compiler itself."}, {"time": 7399, "text": "So your compiler."}, {"time": 7400, "text": "Yeah, it's really badly named low level virtual machine, which that part of it is not used."}, {"time": 7404, "text": "It's really low level."}, {"time": 7405, "text": "Chris, he doesn't mean that."}, {"time": 7406, "text": "Yeah, love Chris."}, {"time": 7409, "text": "But the name makes you imply that the virtual machine is what it's all about."}, {"time": 7412, "text": "It's actually the IR and the library, the code generation."}, {"time": 7416, "text": "That's the real beauty of it."}, {"time": 7417, "text": "The fact that, what I love about LLVM was the fact that it was a plateau you could collaborate on."}, {"time": 7424, "text": "Instead of the internals of GCC or the internals of the Intel compiler, or like how do I extend that?"}, {"time": 7429, "text": "And it was a place we could collaborate."}, {"time": 7431, "text": "And we were early."}, {"time": 7432, "text": "I mean, people had started before."}, {"time": 7434, "text": "It's a slow compiler."}, {"time": 7435, "text": "Like it's not a fast compiler."}, {"time": 7436, "text": "So for some kind of JITs, like JITs are common in language because one, every browser has a JavaScript JIT."}, {"time": 7444, "text": "It does real time compilation of the JavaScript to machine code."}, {"time": 7449, "text": "For people who don't know, JIT is just in time compilation."}, {"time": 7452, "text": "Yeah, just in time compilation."}, {"time": 7453, "text": "They're actually really sophisticated."}, {"time": 7454, "text": "In fact, I got jealous of how much effort was put into the JavaScript JITs."}, {"time": 7458, "text": "Yes, well, it's kind of incredible what they've done."}, {"time": 7460, "text": "Yes, I completely agree."}, {"time": 7462, "text": "I'm very impressed."}, {"time": 7464, "text": "But you know, Numba was an effort to make that happen with Python."}, {"time": 7469, "text": "And so we used some of the money we raised from Anaconda to do it."}, {"time": 7472, "text": "And then we also applied for this DARPA grant and used some of that money to continue the development."}, {"time": 7476, "text": "And then we used proceeds from service projects we would do."}, {"time": 7480, "text": "We get consulting projects that we would then use some of the profits to invest in Numba."}, {"time": 7485, "text": "So we ended up with a team of two or three people working on Numba."}, {"time": 7488, "text": "It was a fits and starts, right?"}, {"time": 7490, "text": "And ultimately, the fact that we had a commercial version of it also we were writing."}, {"time": 7494, "text": "So part of the way I was trying to fund Numba, say, well, let's do the free Numba and then we'll have a commercial version of Numba called Numba Pro."}, {"time": 7500, "text": "And what Numba Pro did is it targeted GPUs."}, {"time": 7503, "text": "So we had the very first CUDA JIT and the very first at JIT compiler that in 2012 for 13, you could run not just a view func on CPU, but a view func on GPUs."}, {"time": 7515, "text": "And it would automatically paralyze it and get 1000X speed on it."}, {"time": 7518, "text": "And that's an interesting funding mechanism because large companies or larger companies care about speed in just this way."}, {"time": 7530, "text": "So it's exactly a really good way."}, {"time": 7533, "text": "Yeah, there's been a couple of things you know people will pay for."}, {"time": 7535, "text": "One, they'll pay for really good user interfaces, right?"}, {"time": 7537, "text": "And so I'm always looking for what are the things people will pay for that you could actually adapt to the open source infrastructure?"}, {"time": 7543, "text": "One is definitely user interfaces."}, {"time": 7545, "text": "The second is speed, like a better runtime, faster runtime."}, {"time": 7549, "text": "And then when you say people, you mean like a small number of people pay a lot of money, but then there's also this other mechanism that."}, {"time": 7555, "text": "A ton of people pay."}, {"time": 7558, "text": "First, I gotta, we mentioned Anaconda, we mentioned friends, family, and fools."}, {"time": 7564, "text": "So Anaconda is yet another."}, {"time": 7566, "text": "So there's a company, but there's also a project."}, {"time": 7569, "text": "That is exceptionally impactful in terms of, for many reasons, but one of which is bringing a lot more people into the community of folks who use Python."}, {"time": 7583, "text": "So what is Anaconda?"}, {"time": 7586, "text": "What is its goals?"}, {"time": 7588, "text": "Maybe what is Conda versus Anaconda?"}, {"time": 7591, "text": "Yeah, I'll tell you a little bit of the history of that."}, {"time": 7593, "text": "Cause Anaconda, we wanted to do, we wanted to scale Python."}, {"time": 7597, "text": "Cause we, you know, that was the goal."}, {"time": 7598, "text": "Peter and I had the goal of when we started Anaconda, we actually started as Continuum Analytics was the name of the company that started."}, {"time": 7604, "text": "It got renamed Anaconda in 2015."}, {"time": 7607, "text": "But we said, we want to scale analytics."}, {"time": 7609, "text": "NumPy is great, Pandas is emerging, but these need to run at scale with lots of machines."}, {"time": 7615, "text": "The other thing we wanted to do was make user interfaces that were web."}, {"time": 7619, "text": "We wanted to make sure the web did not pass by the Python community."}, {"time": 7622, "text": "That we had ways to translate your data science to the web."}, {"time": 7626, "text": "So those are the two kind of technical areas."}, {"time": 7627, "text": "We thought, oh, we'll build products in this space."}, {"time": 7629, "text": "And that was the idea."}, {"time": 7632, "text": "Very quickly in, but of course, the thing I knew how to do was to do consulting to make money and to make sure my family and friends and fools that had invested didn't lose their money."}, {"time": 7641, "text": "So it's a little different than if you take money from a venture fund."}, {"time": 7644, "text": "If you take money from a venture fund, the venture fund, they want you to go big or go home."}, {"time": 7647, "text": "And they're kind of like expecting nine out of 10 to fail or 99 out of 100 to fail."}, {"time": 7653, "text": "I was, I was owed a barbell strategy."}, {"time": 7655, "text": "I was like, I can't fail."}, {"time": 7657, "text": "I mean, I may not do super well, but I cannot lose their money."}, {"time": 7660, "text": "So I'm going to do something I know can return a profit, but I want to have exposure to an upside."}, {"time": 7666, "text": "So that's what happened at Anaconda."}, {"time": 7667, "text": "We didn't, there was lots of things we did not well in terms of that structure."}, {"time": 7671, "text": "And I've learned from since and how to do it better."}, {"time": 7673, "text": "But we've, we did a really good job of kind of attracting the interest around the area to get good people working and then get funnel some money on some interesting projects."}, {"time": 7683, "text": "Super excited about what came out of our energy there."}, {"time": 7685, "text": "Like a lot did."}, {"time": 7686, "text": "So what are some of the interesting projects?"}, {"time": 7688, "text": "So Dask, Numba, Bokeh, Conda."}, {"time": 7692, "text": "There was a data shader, Panel, Holoviz."}, {"time": 7696, "text": "These are all tools that are extremely relevant in terms of helping you build applications, build tools, build, you know, faster code."}, {"time": 7705, "text": "There's a couple I'm forgetting."}, {"time": 7705, "text": "Oh, JupyterLab, JupyterLab came out of this too."}, {"time": 7710, "text": "Okay, so Bokeh does plotting?"}, {"time": 7713, "text": "Bokeh does plotting."}, {"time": 7714, "text": "So Bokeh was one of the foundational things to say, I want to do plot in Python, but have the things show up in a web."}, {"time": 7719, "text": "Right, that's right."}, {"time": 7720, "text": "And plotting to me still, with all due respect to Matplotlib and Bokeh, it feels like still an unsolved problem, not a solved problem."}, {"time": 7730, "text": "It is, it's a big problem."}, {"time": 7732, "text": "Right, because you're, I mean, I don't know, it's visualization broadly, right?"}, {"time": 7738, "text": "I think we've got a pretty good API story around certain use cases of plotting."}, {"time": 7743, "text": "But there's a difference between static plots versus interactive plots versus I'm an end user, I just want to write a simple, for Pandas started the idea of here's a data frame on a dot plot, I'm just going to attach plot as a method to my object, which was a little bit controversial, right?"}, {"time": 7758, "text": "But works pretty well, actually, because there's a lot less you have to pass in, right?"}, {"time": 7763, "text": "You can just say, here's my object, you know what you are, you tell the visualization what to do."}, {"time": 7769, "text": "So that, and there's things like that that have not been super well developed entirely, but Bokeh was focused on interactive plotting."}, {"time": 7776, "text": "So you could, it's a short path between interactive plotting and application, dashboard application."}, {"time": 7782, "text": "And there's some incredible work that got done there, right?"}, {"time": 7784, "text": "And it was a hard project, because then you're basically doing JavaScript and Python."}, {"time": 7789, "text": "So we wanted to tackle some of these hard problems and try to just go after them."}, {"time": 7793, "text": "We got some DARPA funding to help, and it was super helpful, funny story there, we actually did two DARPA proposals, but one we were five minutes late for."}, {"time": 7800, "text": "And DARPA has a very strict cutoff window."}, {"time": 7803, "text": "And so I, we had two proposals, one for the Bokeh and one for actually Numba and the other work."}, {"time": 7809, "text": "Which one were you late for?"}, {"time": 7810, "text": "The Foundation on Numerical Work."}, {"time": 7812, "text": "So Bokeh got funded."}, {"time": 7814, "text": "Fortunately, Chris let us use some of the money to fund still some of the other foundational work, but it wasn't as, yeah, his hands were tired, he couldn't do anything about it."}, {"time": 7823, "text": "That was a whole interesting story."}, {"time": 7825, "text": "So one of the incredible projects that you worked on is Conda."}, {"time": 7830, "text": "So what is Conda?"}, {"time": 7830, "text": "So how that came about, yeah, Conda, it was early on, like I said, with SciPy."}, {"time": 7835, "text": "SciPy was a distribution mass generation library."}, {"time": 7837, "text": "And he said, he heard me talking about compiler issues and trying to get the stuff shipped and the fact that people can use your libraries if they have it."}, {"time": 7844, "text": "So for a long time, we'd understood the packaging problem in Python."}, {"time": 7847, "text": "And one of the first things he did at Conda Analytics became Anaconda was organize the Pi data ecosystem in conjunction with NumFocus."}, {"time": 7856, "text": "We actually started NumFocus with some other folks in the community the same year we started Anaconda."}, {"time": 7862, "text": "I said, we're gonna build a corporation, but we're also gonna reify the community aspect and build a nonprofit."}, {"time": 7868, "text": "So we did both of those."}, {"time": 7869, "text": "Can we pause real quick and can you say what is PyPy, the Python package index, like this whole story of packaging in Python?"}, {"time": 7879, "text": "Yeah, that's what I'm gonna get to actually."}, {"time": 7880, "text": "This is exactly the journey I'm on."}, {"time": 7882, "text": "It's to sort of explain packaging in Python."}, {"time": 7884, "text": "I think it's best expressed to the conversation I had with Guido at a conference, where I said, so packaging is kind of a problem."}, {"time": 7891, "text": "And Guido said, I don't ever care about packaging."}, {"time": 7894, "text": "I don't use it."}, {"time": 7894, "text": "I don't install new libraries."}, {"time": 7896, "text": "I'm like, I guess if you're the language creator and if you need something, you just put it in the distribution maybe you don't worry about packaging."}, {"time": 7902, "text": "But Guido has never really cared about packaging, right?"}, {"time": 7905, "text": "And never really cared about the problem of distribution."}, {"time": 7907, "text": "It's somebody else's problem."}, {"time": 7908, "text": "And that's a fair position to take, I think, as a language creator."}, {"time": 7911, "text": "In fact, there's a philosophical question about should you have different development packaging managers?"}, {"time": 7916, "text": "Should you have a package manager per language?"}, {"time": 7918, "text": "Is that really the right approach?"}, {"time": 7919, "text": "I think there are some answers of it is appropriate to have development tools."}, {"time": 7924, "text": "And there's an aspect of a development tool that is related to packaging."}, {"time": 7927, "text": "And every language should have some story there to help their developers create."}, {"time": 7932, "text": "So you should have language specific development tools."}, {"time": 7934, "text": "Development tools that relate to package managers."}, {"time": 7937, "text": "But then there's a very specific user story around package management that those language specific package managers have to interact with."}, {"time": 7943, "text": "And currently aren't doing a good job of that."}, {"time": 7945, "text": "That was one of the challenges that not seeing that difference, and it still exists in the difference today."}, {"time": 7951, "text": "Conda always was a user."}, {"time": 7954, "text": "I'm gonna use Python to do data science."}, {"time": 7956, "text": "I'm gonna use Python to do something."}, {"time": 7958, "text": "How do I get this installed?"}, {"time": 7959, "text": "It was always focused on that."}, {"time": 7961, "text": "So it didn't have a develop."}, {"time": 7963, "text": "Classic example is pip has a pip develop."}, {"time": 7965, "text": "It's like, I wanna install this into my current development environment today."}, {"time": 7970, "text": "Conda doesn't have that concept because it's not part of the story."}, {"time": 7972, "text": "For people who don't know, pip is a Python specific package manager."}, {"time": 7979, "text": "That's exceptionally popular."}, {"time": 7984, "text": "That's probably like the default thing you've learned."}, {"time": 7986, "text": "It's the default user."}, {"time": 7987, "text": "And so the story there emerged because what happened is in 2012, we had this meeting at the Googleplex and Guido was there to come talk about what we're gonna do, how we're gonna make things work better."}, {"time": 7997, "text": "And Wes McKinney, me, Peter, Peter has a great photo of me talking to Guido and he pretends we're talking about this story."}, {"time": 8003, "text": "Maybe we were, maybe we weren't."}, {"time": 8004, "text": "But we did at that meeting talk about it and asked Guido, we need to fix packaging in Python."}, {"time": 8009, "text": "People can't get the stuff."}, {"time": 8011, "text": "And he said, go fix it yourself."}, {"time": 8012, "text": "I don't think we're gonna do it."}, {"time": 8015, "text": "The origin story right there."}, {"time": 8016, "text": "All right, you said, okay, you said to do this ourselves."}, {"time": 8019, "text": "So at the same time, people did start to work on the packaging story in Python."}, {"time": 8024, "text": "It just took a little longer."}, {"time": 8025, "text": "So in 2012, kind of motivated by our training courses we were teaching, like very similar to what you just mentioned about your mother."}, {"time": 8032, "text": "Like it was motivated by the same purpose."}, {"time": 8034, "text": "Like how do we get this into people's hands?"}, {"time": 8036, "text": "It's this big, long process."}, {"time": 8037, "text": "It takes too expensive."}, {"time": 8038, "text": "It was actually hurting NumPy development because I would hear people were saying, don't make that change to NumPy because I just spent a week getting my Python environment."}, {"time": 8045, "text": "And if you change NumPy, I have to reinstall everything."}, {"time": 8049, "text": "And reinstalling is such a pain, don't do it."}, {"time": 8050, "text": "I'm like, wait, okay."}, {"time": 8052, "text": "So now we're not making changes to a library because of the installation problem that it'll cause for end users."}, {"time": 8057, "text": "Okay, there's a problem with installation."}, {"time": 8059, "text": "We gotta fix this."}, {"time": 8060, "text": "So we said, we're gonna make a distribution in Python."}, {"time": 8063, "text": "And we'd previously done that."}, {"time": 8064, "text": "I'd previously done that at mthought."}, {"time": 8066, "text": "I wanted to make one that would give away for free, that everyone could just get."}, {"time": 8069, "text": "Like that was critical that we could just get it."}, {"time": 8072, "text": "It wasn't tied to a product."}, {"time": 8073, "text": "It was just you could get it."}, {"time": 8075, "text": "And then we had constantly thought about, well, do we just leverage RPM?"}, {"time": 8079, "text": "But the challenge had always been, we want a package manager that works on Windows, Mac OS X, and Linux the same, right?"}, {"time": 8085, "text": "And it wasn't there."}, {"time": 8086, "text": "Like you don't have anything like that."}, {"time": 8087, "text": "You have... And for people who don't know, RPM is an operating system specific package manager."}, {"time": 8094, "text": "Correct, it's an operating specific."}, {"time": 8096, "text": "So do you create the design questions, do you create an umbrella package manager that works across operating systems?"}, {"time": 8103, "text": "Yes, that was the decision."}, {"time": 8105, "text": "And in neighboring design questions, do you also create a package manager that spans multiple programming languages?"}, {"time": 8112, "text": "That was the world we faced."}, {"time": 8114, "text": "And we decided to go multiple operating systems, multiple and programming language independent."}, {"time": 8119, "text": "Because even Python, and particularly what was important was SciPy has a bunch of Fortran in it, right?"}, {"time": 8124, "text": "And scikit learn has links to a bunch of C++."}, {"time": 8127, "text": "There's a lot of compiled code."}, {"time": 8129, "text": "And the Python package managers, especially early on, didn't even support that."}, {"time": 8134, "text": "So in 2000, so we released Anaconda, which was just a distribution of libraries, but we started to work on Conda in 2012."}, {"time": 8142, "text": "First version of Conda came out in early 2013, summer of 2013, and it was a package manager."}, {"time": 8147, "text": "So you could say, Conda install scikit learn."}, {"time": 8149, "text": "In fact, scikit learn was a fantastic project that emerged."}, {"time": 8154, "text": "It was the classic example of the scikits."}, {"time": 8157, "text": "I talked to you earlier about SciPy being too big to be a single library."}, {"time": 8161, "text": "Well, what the community had done is said, let's make scikits."}, {"time": 8164, "text": "And there's scikit image, there's scikit learn, there's a lot of scikits."}, {"time": 8167, "text": "And it was a fantastic move that the community did."}, {"time": 8170, "text": "I didn't do it."}, {"time": 8171, "text": "I was like, okay, that's a good idea."}, {"time": 8172, "text": "I didn't like the name."}, {"time": 8173, "text": "I didn't like the fact you typed scikit image."}, {"time": 8175, "text": "I was like, that's gotta be simpler."}, {"time": 8177, "text": "That's scikit learn, we gotta make that smaller."}, {"time": 8179, "text": "I don't like typing all this stuff from imports."}, {"time": 8181, "text": "So I was kind of a pressure that way, but I love the energy and love the fact that they went out and they did it, and DOS people, Jared Millman, and then of course, Gael, and there's people I'm not even naming."}, {"time": 8191, "text": "Scikit learn really emerged as a fantastic project."}, {"time": 8194, "text": "And the documentation around that is also incredible."}, {"time": 8196, "text": "And the documentation was incredible, exactly."}, {"time": 8197, "text": "I don't know who did that, but they did a great job."}, {"time": 8200, "text": "A lot of people in Inria, a lot of European contributors."}, {"time": 8205, "text": "There's some Andreas in the US."}, {"time": 8207, "text": "There's a lot of just people I just adore, I think are amazing people."}, {"time": 8211, "text": "Awesome use of SciPy, right?"}, {"time": 8212, "text": "I love the fact that they were using SciPy effectively to do something I love, which is machine learning, but couldn't install it."}, {"time": 8218, "text": "Because there's so many pieces involved."}, {"time": 8220, "text": "So many dependencies, right?"}, {"time": 8222, "text": "So our use case of Conda was Conda install scikit learn."}, {"time": 8226, "text": "Right, and it was the best way to install scikit learn in 2013 to really 2018, 17, 18, PIP finally caught up."}, {"time": 8234, "text": "I still think it's you should Conda install scikit learn for the PIP install scikit learn, but you can PIP install scikit learn."}, {"time": 8239, "text": "The issue is the package they created was wheels and PIP does not handle the multi vendor approach."}, {"time": 8244, "text": "They don't handle the fact you have C++ libraries you're depending on."}, {"time": 8247, "text": "They just stop at the Python boundary."}, {"time": 8249, "text": "And so what you have to do in the wheel world is you have to vendor."}, {"time": 8253, "text": "You have to take all of the binary and vendor it."}, {"time": 8255, "text": "Now, if your change happens in underlying dependency, you have to redo the whole wheel."}, {"time": 8260, "text": "So TensorFlow, as you know, you should not PIP install TensorFlow."}, {"time": 8264, "text": "It's a terrible idea."}, {"time": 8265, "text": "People do it because the popularity of PIP, many people think, oh, of course, that's how I install everything in Python."}, {"time": 8271, "text": "Yeah, this is one of the big challenges."}, {"time": 8273, "text": "You take a GitHub repository or just a basic blog post."}, {"time": 8277, "text": "The number of time PIP is mentioned over Conda is like 100 X to one."}, {"time": 8283, "text": "So it just has to do with the."}, {"time": 8284, "text": "And that was increasing."}, {"time": 8285, "text": "It wasn't true early because PIP didn't exist."}, {"time": 8287, "text": "Like Conda came first."}, {"time": 8288, "text": "So but that's the problem."}, {"time": 8290, "text": "Like Conda came first, but that's like the long tail of the internet documentation user generated."}, {"time": 8295, "text": "So that like you think, how do I install Google?"}, {"time": 8299, "text": "How do I install TensorFlow?"}, {"time": 8300, "text": "You're just not gonna see Conda in that first page."}, {"time": 8304, "text": "Not today, you would have in 2016, 2017."}, {"time": 8309, "text": "And it's sad because Conda solves a lot of usability issues."}, {"time": 8315, "text": "Like for especially super challenging thing."}, {"time": 8317, "text": "One of the big pain points for me was just on the computer vision side, OpenCV installation."}, {"time": 8323, "text": "Perfect example."}, {"time": 8325, "text": "I think Conda, I don't know if Conda solved that one."}, {"time": 8327, "text": "Conda has an OpenCV package."}, {"time": 8329, "text": "I certainly know PIP has not solved."}, {"time": 8333, "text": "I mean, there's complexities there because."}, {"time": 8337, "text": "I should probably know a good answer for this, but if you compile OpenCV with certain dependencies, you'll be able to do certain things."}, {"time": 8347, "text": "So there's this kind of flexibility of what you, like what options you compile with."}, {"time": 8353, "text": "And I don't think it's trivial to do that with Conda or."}, {"time": 8357, "text": "So Conda has a notion of variance of a package."}, {"time": 8360, "text": "You can actually have different compilation versions of a package."}, {"time": 8363, "text": "So not just the version is different, but oh, this is compiled with these optimizations on."}, {"time": 8366, "text": "So Conda does have an answer."}, {"time": 8368, "text": "Has those flavors."}, {"time": 8368, "text": "Has flavors, basically."}, {"time": 8370, "text": "Well, PIP, as far as I know, does not have flavors."}, {"time": 8373, "text": "PIP generally hasn't thought deeply about the binary dependency problem, right?"}, {"time": 8378, "text": "And that's why fundamentally it doesn't work for the SciPy ecosystem."}, {"time": 8383, "text": "It barely, you can sort of paper over it and duct tape and it kind of works until it doesn't and it falls apart entirely."}, {"time": 8389, "text": "So it's been a mixed bag."}, {"time": 8391, "text": "Like, and I've been having lots of conversations with people over the years because again, it's an area where if you understand some things, but not all the things, but they've done a great job of community appeal."}, {"time": 8402, "text": "This is an area where I think Anaconda as a company needed to do some things in order to make Conda more community centric, right?"}, {"time": 8410, "text": "And this is a, I talk about this all the time."}, {"time": 8413, "text": "There's a balance between you have every project starts with what I called company backed open source."}, {"time": 8418, "text": "Even if the company is yourself, it's just one person, just doing business as."}, {"time": 8423, "text": "But ultimately for products to succeed virally and become massive influencers, they have to create, they have to get community people on board."}, {"time": 8430, "text": "They have to get other people on board."}, {"time": 8432, "text": "So it has to become community driven."}, {"time": 8433, "text": "And a big part of that is engagement with those people."}, {"time": 8435, "text": "Empowering people, governance around it."}, {"time": 8438, "text": "And what happened with Conda in the early days, PIP emerged and we did do some good things."}, {"time": 8443, "text": "Conda Forge, Conda Forge community is sort of the community recipe creation community."}, {"time": 8449, "text": "But Conda itself, I still believe, and Peter is CEO of Anaconda, he's my co founder."}, {"time": 8455, "text": "I ran Anaconda until 2017, 2018."}, {"time": 8458, "text": "Is Peter still Anaconda?"}, {"time": 8459, "text": "Peter's still Anaconda, right?"}, {"time": 8460, "text": "And we're still great friends."}, {"time": 8461, "text": "We talk all the time."}, {"time": 8462, "text": "I love him to death."}, {"time": 8463, "text": "There's a long story there about like why and how and we can cover in some other podcast perhaps."}, {"time": 8469, "text": "It's sort of a more, maybe a more business focused one."}, {"time": 8471, "text": "But this is one area where I think Conda should be more community driven."}, {"time": 8477, "text": "Like he should be pushing more to get more community contributors to Conda and let the, Anaconda shouldn't be fighting this battle."}, {"time": 8487, "text": "It's actually, it's really a developers."}, {"time": 8488, "text": "Like you said, like help the developers and then they'll actually move us the right direction."}, {"time": 8492, "text": "Well, that was the problem I have is many of the cool kids I know don't use Conda."}, {"time": 8496, "text": "And that to me is confusing."}, {"time": 8498, "text": "It is confusing."}, {"time": 8499, "text": "It's really a matter of, Conda has some challenges."}, {"time": 8502, "text": "First of all, Conda still needs to be improved."}, {"time": 8504, "text": "There's lots of improvements to be made."}, {"time": 8505, "text": "And it's that aspect of wait, who's doing this?"}, {"time": 8507, "text": "And the fact that then the Pi PA really stepped up."}, {"time": 8510, "text": "Like they were not solving the problem at all."}, {"time": 8513, "text": "And now they kind of got to where they're solving it for the most part."}, {"time": 8516, "text": "And then effectively you could get, like Conda solved a problem that was there."}, {"time": 8520, "text": "And it still does."}, {"time": 8521, "text": "It's still, you know, there's still great things it can do."}, {"time": 8523, "text": "But, and we still use it all the time at one site and with other clients, but with, but you can kind of do similar things with PIP and Docker."}, {"time": 8533, "text": "So especially with the web development community, that part of it, again, is this is the, there's a lot of different kinds of developers in the Python ecosystem."}, {"time": 8540, "text": "And there's still a lack of some clear understanding."}, {"time": 8543, "text": "I go to the Python conference all the time and then there's only a few people in the Pi PA who get it."}, {"time": 8548, "text": "And then others who are just massively trumpeting the power of PIP, but just do not understand the problem."}, {"time": 8553, "text": "So one of the obvious things to me from a mom, from a non programmer perspective, is the across operating system usability."}, {"time": 8561, "text": "That's much more natural."}, {"time": 8562, "text": "So there's people that use Windows and just, it seems much easier to recommend Conda there, but then it, you should also recommend it across the board."}, {"time": 8571, "text": "So I'll definitely sort of."}, {"time": 8573, "text": "But what I recommend now is a hybrid."}, {"time": 8576, "text": "I mean, I have no problem."}, {"time": 8577, "text": "Is it possible to use?"}, {"time": 8577, "text": "Oh, it is."}, {"time": 8579, "text": "But like build the environment with PIP, with Conda, build an environment with Conda and then PIP install on top of that."}, {"time": 8585, "text": "Be careful about PIP installing OpenCV or TensorFlow or because if somebody's allowed that, it's gonna be most surely done in a way that can't be updated that easily."}, {"time": 8595, "text": "So install like the big packages, the infrastructure with Conda and then the weirdos."}, {"time": 8601, "text": "That like the weird like implementation for some."}, {"time": 8604, "text": "I had a, there's a cool library I used that based on your location and time of day and date tells you the exact position of the sun relative to the earth."}, {"time": 8618, "text": "And it's just like a simple library, but it's very precise."}, {"time": 8621, "text": "And I was like, all right."}, {"time": 8622, "text": "But that was, that was, and it's like PIP."}, {"time": 8625, "text": "Well, the thing they did really well is Python developers who wanna get their stuff published, you have to have a PIP recipe."}, {"time": 8633, "text": "I mean, even if it's, you know, the challenge is, and there's a key thing that needs to be added to PIP, just simply add to PIP the ability to defer to a system package manager."}, {"time": 8643, "text": "Like, cause it's, you know, recognize you're not gonna solve all the dependency problem."}, {"time": 8647, "text": "So let like give up and allow the system package to work."}, {"time": 8652, "text": "That way Anaconda is installed and it has PIP."}, {"time": 8655, "text": "It would default to Conda to install stuff, but Red Hat RPM would default to RPM to install some more things."}, {"time": 8660, "text": "Like that's the, that's a key, not difficult, but somewhat work, some work feature needs to be added."}, {"time": 8665, "text": "That's an example of something like, I've known we need to do it."}, {"time": 8668, "text": "I mean, it's where I wish I had more money."}, {"time": 8670, "text": "I wish I was more successful in the business side, trying to get there, but I wish my, you know, my family, friends and full community that I know."}, {"time": 8677, "text": "Was larger."}, {"time": 8678, "text": "Was larger and had more money."}, {"time": 8679, "text": "Cause I know tons of things to do effectively with more resources, but you know, I have not yet been successful at channel."}, {"time": 8688, "text": "Tons of, you know, some, you know, I'm happy with what we've done."}, {"time": 8691, "text": "We created again at Quansight, what we created to get Anaconda started."}, {"time": 8696, "text": "We created community to get Anaconda started."}, {"time": 8698, "text": "Done it again with Quansight."}, {"time": 8699, "text": "Super excited by that."}, {"time": 8700, "text": "But it took three years to do it."}, {"time": 8702, "text": "What is Quansight?"}, {"time": 8703, "text": "What is its mission?"}, {"time": 8704, "text": "We've talked a few times about different fascinating aspects of it, but let's like big picture, what is Quansight?"}, {"time": 8709, "text": "Big picture Quansight."}, {"time": 8710, "text": "Quansight is, its mission is to connect data to an open economy."}, {"time": 8714, "text": "So it's basically consulting of the pie data ecosystem, right?"}, {"time": 8718, "text": "It's a consulting company."}, {"time": 8719, "text": "And what I've said when I started it was we're trying to create products, people, and technology."}, {"time": 8724, "text": "So it's divided into two groups."}, {"time": 8726, "text": "And a third one as well."}, {"time": 8728, "text": "The two groups are a consulting services company that just helps people do data science and data engineering and data management better and more efficiently."}, {"time": 8735, "text": "Like full stack, like full thing."}, {"time": 8736, "text": "Full stack data science, full thing."}, {"time": 8738, "text": "We'll help you build a infrastructure."}, {"time": 8740, "text": "If you're using Jupiter, we need, we do staff augmentation, need more pro programmers, help you use Dask more effectively, help you use GPUs more effectively."}, {"time": 8746, "text": "Just basically a lot of people need help."}, {"time": 8748, "text": "So we do training as well to help people, you know, both immediate help and then get, learn from somebody."}, {"time": 8755, "text": "We've added a bunch of stuff too."}, {"time": 8757, "text": "We've kind of separated some of these other things into another company called Open Teams that we currently started."}, {"time": 8761, "text": "One of the things I loved about what we did at Anaconda was creating a community innovation team."}, {"time": 8765, "text": "And so I wanted to replicate that."}, {"time": 8766, "text": "This time we did a lot of innovation at Anaconda."}, {"time": 8769, "text": "I wanted to do innovation, but also contribute to the projects that existed, like create a place where maintainers, so the SciPy and NumPy and Numba and all these projects we already started can pay people to work on them and keep them going."}, {"time": 8782, "text": "So that's Labs."}, {"time": 8783, "text": "Quansight Labs is a separate organization."}, {"time": 8785, "text": "It's a nonprofit mission."}, {"time": 8788, "text": "The profits of Quansight help fund it."}, {"time": 8789, "text": "And in fact, every project that we have at Quansight, a portion of the money goes directly to Quansight Labs to help keep it funded."}, {"time": 8797, "text": "So we've gotten several mechanisms that we keep Quansight Labs funded."}, {"time": 8800, "text": "And currently, so I'm really excited about Labs because it's been a mission for a long time."}, {"time": 8803, "text": "What kind of projects are within Labs?"}, {"time": 8805, "text": "So Labs is working to make the software better, like make NumPy better, make SciPy better."}, {"time": 8809, "text": "It only works on open source."}, {"time": 8812, "text": "So if somebody wants to, so companies do, we have a thing called a community work order, we call it."}, {"time": 8817, "text": "If a company says, I wanna make Spyder better."}, {"time": 8821, "text": "You can pay for a month of a developer of Spyder or a developer of NumPy or a developer of SciPy."}, {"time": 8828, "text": "You can't tell them what you want them to do."}, {"time": 8829, "text": "You can give them your priorities and things you wish existed and they'll work on those priorities with the community to get what the community wants and what emerges of what the community wants."}, {"time": 8838, "text": "Is there some aspect on the consulting side that is helping, as we were talking about morphology and so on, is there specific application that are particularly like driving, sort of inspiring the need for updates to SciPy?"}, {"time": 8852, "text": "Correct, absolutely, absolutely."}, {"time": 8853, "text": "GPUs are absolutely one of them."}, {"time": 8854, "text": "And new hardware beyond GPUs."}, {"time": 8856, "text": "I mean, Tesla's Dojo chip, I'm hoping we'll have a chance to work on that perhaps."}, {"time": 8862, "text": "Things like that are definitely driving it."}, {"time": 8863, "text": "The other thing that's driving it is scalable, like speed and scale."}, {"time": 8867, "text": "How do I write NumPy code or NumPy Lite code if I want it to run across a cluster?"}, {"time": 8872, "text": "That's Dask or maybe it's Ray."}, {"time": 8874, "text": "I mean, there's sort of ways to do that now."}, {"time": 8876, "text": "Or there's Moden and there's, so Pandas code, NumPy code, SciPy code, Scikit learn code that I want to scale."}, {"time": 8883, "text": "So that's one big area."}, {"time": 8884, "text": "Have you gotten a chance to chat with Andre and Elon about particular, because like."}, {"time": 8889, "text": "No, I would love to, by the way."}, {"time": 8891, "text": "I have not, but I'd love to."}, {"time": 8892, "text": "I just saw their Tesla AI Days video."}, {"time": 8895, "text": "Super excited."}, {"time": 8896, "text": "That's one of the, you know, I love great engineering, software engineering teams and engineering teams in general."}, {"time": 8901, "text": "And they're doing a lot of incredible stuff with Python."}, {"time": 8903, "text": "They're like revolutionary."}, {"time": 8905, "text": "So many aspects of the machine learning pipeline."}, {"time": 8909, "text": "That's operating in the real world."}, {"time": 8910, "text": "And so much of that is Python."}, {"time": 8911, "text": "Like you said, the guy running, you know, Andre Kapathy, running Autopilot is tweeting about optimization of NumPy versus."}, {"time": 8921, "text": "I would love to talk to him."}, {"time": 8922, "text": "In fact, we have at Quonset, we've been fortunate enough to work with Facebook on PyTorch directly."}, {"time": 8927, "text": "So we have about 13 developers at Quonset."}, {"time": 8929, "text": "Some of them are in labs working directly on PyTorch."}, {"time": 8932, "text": "On PyTorch."}, {"time": 8933, "text": "On PyTorch, right."}, {"time": 8934, "text": "So I basically started Quonset."}, {"time": 8935, "text": "I went to both TensorFlow and PyTorch and said, hey, I want to help connect what you're doing to the broader SciPy ecosystem."}, {"time": 8941, "text": "Because I see what you're doing."}, {"time": 8943, "text": "We have this bigger mission that we want to make sure we don't, you know, lose energy here."}, {"time": 8946, "text": "So, and Facebook responded really positively and I didn't get the same reaction."}, {"time": 8952, "text": "Not yet, not yet."}, {"time": 8954, "text": "So I really love the folks at TensorFlow, too."}, {"time": 8957, "text": "They're fantastic."}, {"time": 8958, "text": "I think it's the, just how it integrates with their business."}, {"time": 8961, "text": "I mean, like I said, there's a lot of reasons."}, {"time": 8963, "text": "Just the timing, the integration with their business, what they're looking for."}, {"time": 8967, "text": "They're probably looking for more users."}, {"time": 8968, "text": "And I was looking to kind of cut up some development effort and they couldn't receive that as easily, I think."}, {"time": 8973, "text": "So I'm hoping, I'm really hopeful and love the people there."}, {"time": 8977, "text": "What's the idea behind OpenTeams?"}, {"time": 8979, "text": "So OpenTeams, I'm super excited about OpenTeams because it's one of the, I mentioned my idea for investing directly in open source."}, {"time": 8986, "text": "So that's a concept called fair OSS."}, {"time": 8988, "text": "But one of the things we, when we started Quansight, we knew we would do is we develop products and ideas and new companies might come out."}, {"time": 8995, "text": "At Anaconda, this was clear, right?"}, {"time": 8997, "text": "Anaconda, we did so much innovation that like five or six companies could have come out of that."}, {"time": 9002, "text": "And we just didn't structure it so they could."}, {"time": 9005, "text": "But in fact, they have, you look at Dask, there's two companies going out of Dask."}, {"time": 9008, "text": "You know, Bokeh could be a company."}, {"time": 9010, "text": "There's like lots of companies that could exist off the work we did there."}, {"time": 9013, "text": "And so I thought, oh, here's a recipe for an incubation, a concept that we could actually spawn new companies and new innovations."}, {"time": 9020, "text": "And then the idea has always been, well, money they earn should come back to fund the open source projects."}, {"time": 9026, "text": "So labs is, you know, I think there should be a lot of things like Quansight Labs."}, {"time": 9030, "text": "I think this concept is one that scales."}, {"time": 9032, "text": "You could have a lot of open source research labs."}, {"time": 9035, "text": "Along the way, so in 2018, when the bigger idea came, how to make open source investable, I said, oh, I need to write, I need to create a venture fund."}, {"time": 9041, "text": "So we created a venture fund called Quansight Initiate at the same time."}, {"time": 9044, "text": "It's an angel fund, really."}, {"time": 9045, "text": "It's, you know, we started to learn that process."}, {"time": 9047, "text": "How do we actually do this?"}, {"time": 9048, "text": "How do we get LPs?"}, {"time": 9049, "text": "How do we actually go in this direction and build a fund?"}, {"time": 9052, "text": "And I'm like, every venture fund should have an associated open source research lab, which is no reason."}, {"time": 9056, "text": "Like our venture fund, the carried interest, a portion of it goes to the lab."}, {"time": 9061, "text": "It directly will fund the lab."}, {"time": 9063, "text": "That's fascinating, brother."}, {"time": 9064, "text": "So you use the power of the organic formation of teams in the open source community, and then like naturally, that leads to a business that can make money."}, {"time": 9074, "text": "And then it always maintains and loops back to the open source."}, {"time": 9077, "text": "Loops back to open source, exactly."}, {"time": 9078, "text": "I mean, to me, it's a natural fit."}, {"time": 9079, "text": "There's something, there's absolutely a repeatable pattern there, and it's also beneficial because, oh, I have, I have natural connections to the open source if I have an open source research lab."}, {"time": 9089, "text": "Like, they'll always, they'll be out there talking to people, and so we've had a chance to talk to a lot of early stage companies."}, {"time": 9095, "text": "And we, and our fund focuses on the early stage."}, {"time": 9097, "text": "So Quansight has the services, the lab, the fund, right?"}, {"time": 9101, "text": "In that process, a lot of stuff started to happen."}, {"time": 9104, "text": "They're like, oh, you know, we started to do recruiting and support and training, and I was starting to build a bigger sales team and marketing team and people besides just developers."}, {"time": 9112, "text": "And one of the challenges with that is you end up with different cultural aspects."}, {"time": 9115, "text": "You know, developers, you know, there's a, in any company you go to, you kind of go look, is this a business led company, a developer led company?"}, {"time": 9123, "text": "Do they kind of coexist?"}, {"time": 9124, "text": "Are they, what's the interface between them?"}, {"time": 9126, "text": "There's always a bit of a tension there."}, {"time": 9127, "text": "Like we were talking about before."}, {"time": 9128, "text": "You know, what is the tension there?"}, {"time": 9130, "text": "With OpenTeams, I thought, wait a minute, we can actually just create, like this concept of Quansight plus labs, it's, well, it's specific to the Pi data ecosystem."}, {"time": 9138, "text": "The concept is general for all open source."}, {"time": 9140, "text": "So OpenTeams emerged as a, oh, we can create a business development company for many, many Quansights, like thousands of Quansights."}, {"time": 9148, "text": "And it can be a marketplace to connect, essentially be the enterprise software company of the future."}, {"time": 9154, "text": "If you look at what enterprise software wants from the customer side, and during this journey, I've had the chance to work and sell to lots of companies, Exxon and Shell and Davey Morgan Bank of America, like the Fortune 100, and talk to a lot of people in procurement and see what are they buying and why are they buying?"}, {"time": 9170, "text": "So, you know, I don't know everything, but I've learned a lot about, oh, what are they really looking for?"}, {"time": 9174, "text": "And they're looking for solutions."}, {"time": 9176, "text": "They're constantly given products from enterprise software."}, {"time": 9181, "text": "Here's open source, leave the enterprise software, now I buy it."}, {"time": 9183, "text": "And then they have to stitch it together into a solution."}, {"time": 9185, "text": "Open source is fantastic for gluing those solutions together."}, {"time": 9188, "text": "So, whereas they keep getting new platforms they're trying to buy, but most open source, what most enterprises want is tools that they can customize that are as inexpensive as they can."}, {"time": 9198, "text": "Yeah, and so you always want to maintain the connection to the open source because that's going to be the tools."}, {"time": 9202, "text": "Yes, so open teams is about solving enterprise software problems."}, {"time": 9206, "text": "Brilliant, brilliant idea, by the way."}, {"time": 9208, "text": "With a connect, but we do it honoring the topology."}, {"time": 9210, "text": "We don't hire all the people."}, {"time": 9212, "text": "We are a network connecting the sales energy and the procurement energy, and we work on the business side, get the deals closed, and then have a network of partners like Quonsight and others who we hand the deals to, to actually do the work."}, {"time": 9224, "text": "And then we have to maintain, I feel like we have to maintain some level of quality control so that the client can rely on open teams to ensure the delivery."}, {"time": 9232, "text": "It's not just, here's a lead, go figure that out."}, {"time": 9234, "text": "But no, we're going to make sure you get what you need."}, {"time": 9237, "text": "By the way, it's such a skill, and I don't know if I have the patience."}, {"time": 9240, "text": "I will have the patience to talk to the business people or more specific, I mean, there's all kinds of flavors of business people or like marketing people."}, {"time": 9251, "text": "There's a challenge."}, {"time": 9252, "text": "I hear what you're saying because I've had the same challenge."}, {"time": 9255, "text": "There's sometimes you think, okay, this is way overwrought."}, {"time": 9258, "text": "Yeah, but you have to become an adult and you have to, because the companies have needs."}, {"time": 9262, "text": "They have ways to make money and they also want to learn and grow, and it's your job to kind of educate them on the best way, like the value of open source, for example."}, {"time": 9271, "text": "Right, and I'm really grateful for all my experiences over the past 14 years, understanding that side of it and still learning for sure, but not just understanding from companies, but also dealing with marketing professionals and sales professionals and people that make a career out of that and understanding what they're thinking about and also understanding, well, let's make this better."}, {"time": 9286, "text": "We can really make a place."}, {"time": 9288, "text": "Open teams I see as the transmission layer between companies and open source communities producing enterprise software solutions."}, {"time": 9295, "text": "Eventually we want to, today we're taking on SaaS and MATLAB and tools that we know we can replace for folks."}, {"time": 9301, "text": "Really, anytime you have a software tool at an organization where you have to do a lot of customization to make it work for you."}, {"time": 9307, "text": "It's not you're just buying this thing off the shelf and it works."}, {"time": 9309, "text": "It's like, okay, you buy this system and then you customize it a lot, usually with expensive consultants to actually make it work for you."}, {"time": 9317, "text": "All of those should be replaced by open source foundations with the same customization."}, {"time": 9320, "text": "You're doing such important work, such important work in these giant organizations that do exactly that, taking some proprietary software and hiring a huge team of consultants that customize it and then that whole thing gets outdated quick."}, {"time": 9334, "text": "And so, I mean, that's brilliant."}, {"time": 9336, "text": "So the one solution to that is kind of what Tesla's doing a little bit of, which is basically build up a software engineering team."}, {"time": 9346, "text": "Like build a team from scratch."}, {"time": 9348, "text": "Build a team from scratch."}, {"time": 9349, "text": "And companies are doing it well, that's what they're doing right now."}, {"time": 9352, "text": "And you're creating a topology for some of that."}, {"time": 9355, "text": "You just don't have to do it."}, {"time": 9356, "text": "That's not the only answer, right?"}, {"time": 9357, "text": "And so other companies can access this, be more accessible."}, {"time": 9359, "text": "We literally say, open team is the future of enterprise software."}, {"time": 9363, "text": "We're still early."}, {"time": 9364, "text": "Like this idea just percolated over the past year as we've kind of grown Quansight and realized the extensibility of it."}, {"time": 9370, "text": "We just finished in our seed round to help get more sales people and then push the messaging correctly."}, {"time": 9377, "text": "And there's lots of tools we're building to make this easier."}, {"time": 9380, "text": "Like we wanna automate the processes."}, {"time": 9381, "text": "We feel like a lot of the power is the efficiency of the sales process."}, {"time": 9385, "text": "There's a lot of wasted energy in small teams and the sales energy to get into large companies and make a deal."}, {"time": 9392, "text": "There's a lot of money spent on that process."}, {"time": 9394, "text": "Creating the tools and processes for that sales."}, {"time": 9396, "text": "So make that super seamless."}, {"time": 9398, "text": "So a single company can go, oh, I've got my contract with open teams."}, {"time": 9401, "text": "We've got a subscription they can get."}, {"time": 9403, "text": "They can make that procurement seamless."}, {"time": 9405, "text": "And then the fact they have access to the entire open source ecosystem."}, {"time": 9408, "text": "And we have a part of our work that's embracing open source ecosystems and making sure we're doing things useful for them or serving them."}, {"time": 9416, "text": "And then companies making sure they're getting solutions they care about."}, {"time": 9419, "text": "And then figuring out which targets we have."}, {"time": 9422, "text": "We're not taking on all of open source, all of enterprise software yet."}, {"time": 9426, "text": "But we're step by step."}, {"time": 9427, "text": "Well this feels like the future."}, {"time": 9428, "text": "The idea and the vision is brilliant."}, {"time": 9430, "text": "Can I ask you, why do you think Microsoft bought GitHub and what do you think is the future of GitHub?"}, {"time": 9436, "text": "Great point."}, {"time": 9437, "text": "I thought it was a brilliant move."}, {"time": 9438, "text": "I think they did because Microsoft has always had a developer centric culture."}, {"time": 9442, "text": "Like they always have."}, {"time": 9443, "text": "Like one of the things Microsoft's always done well is understand that their power is the developers."}, {"time": 9447, "text": "It's been, Ballmer didn't necessarily make a good meme about how he approached that."}, {"time": 9452, "text": "But they're broadening that."}, {"time": 9454, "text": "I think that's why."}, {"time": 9455, "text": "Because they recognize GitHub is where developers are at."}, {"time": 9459, "text": "But do they have a vision like open teams type of situation, right?"}, {"time": 9461, "text": "I don't think so yet."}, {"time": 9463, "text": "Are they just basically throwing money at developers to show their support?"}, {"time": 9468, "text": "Without a topology like you put it."}, {"time": 9470, "text": "Like a way to leverage that."}, {"time": 9473, "text": "Like to give developers actual money."}, {"time": 9477, "text": "They're still, it's an enterprise software company."}, {"time": 9479, "text": "And they make a bunch of money."}, {"time": 9480, "text": "They make a bunch of games."}, {"time": 9481, "text": "They're a big company."}, {"time": 9482, "text": "They sell products."}, {"time": 9483, "text": "I think part of it is they know there's opportunity to make money from GitHub."}, {"time": 9488, "text": "There's definitely a business there."}, {"time": 9489, "text": "You know, to sell to developers."}, {"time": 9491, "text": "Or to sell to people using development."}, {"time": 9493, "text": "I think there's part of that."}, {"time": 9494, "text": "I think part of it is also there's, they had definitely wanted to recognize that you need to value open source to get great developers."}, {"time": 9501, "text": "Which is an important concept that was emerging over the past 10 years."}, {"time": 9505, "text": "That, you know, pay at Pi Data."}, {"time": 9508, "text": "We were able to convince J.P. Morgan to support Pi Data because of that fact."}, {"time": 9512, "text": "That was where the money for them putting a couple hundred thousand into supporting Pi Data for several conferences was they want developers."}, {"time": 9517, "text": "And they realized that developers want to participate in open source."}, {"time": 9520, "text": "So enterprise software folks don't always understand how their software gets used."}, {"time": 9524, "text": "Having spent a lot of time on the floors at J.P. Morgan, at InShell, at ExxonMobil, you see, oh, these companies have large development teams."}, {"time": 9532, "text": "And then they're kind of dealing with what's being delivered to them."}, {"time": 9536, "text": "So I really feel kind of a privilege that I had a chance to learn some of these people and see what they're doing."}, {"time": 9541, "text": "And even work alongside them, you know, as a consultant, using open source and trying to figure, how do we make this work inside of our large organization?"}, {"time": 9549, "text": "Some of it is actually, for a large organization, some of it is messaging to the world that you care about developers and you're the cool, you care."}, {"time": 9558, "text": "Like, for example, like if Ford, cause I talked to them, like car companies, right?"}, {"time": 9563, "text": "They want to attract, you know, you want to take on Tesla and autopilot."}, {"time": 9568, "text": "You want to take on, right?"}, {"time": 9569, "text": "And so what do you do there?"}, {"time": 9571, "text": "You show that you're cool."}, {"time": 9572, "text": "Like you try to show off that you care about developers and they have a lot of trouble doing that."}, {"time": 9579, "text": "And like one way, I think like Ford should have bought GitHub."}, {"time": 9582, "text": "They just to show off, like these old school companies and it's in a lot of different industries."}, {"time": 9589, "text": "There's probably different ways."}, {"time": 9591, "text": "It's probably an art show that you care to developers."}, {"time": 9594, "text": "And the developers, it's exactly what you, like, for example, just spit balling here, but like Ford or somebody like that could give a hundred million dollars to the development of NumPy."}, {"time": 9607, "text": "And like literally look at like the top most popular projects in Python and just say, we're just going to give money."}, {"time": 9617, "text": "Like that's going to immediately make you cool."}, {"time": 9620, "text": "They could actually, yeah."}, {"time": 9621, "text": "And in fact, they set up NumFocus to make it easy."}, {"time": 9624, "text": "But the challenge was, is also you have to have some business development."}, {"time": 9628, "text": "Like it's a bit of a seeding problem, right?"}, {"time": 9631, "text": "And you look at how, I've talked to the folks at Linux Foundation, know how they're doing it."}, {"time": 9634, "text": "I know how, and starting NumFocus, because we had two babies in 2012."}, {"time": 9639, "text": "One was Anaconda, one was NumFocus, right?"}, {"time": 9641, "text": "And they were both important efforts."}, {"time": 9642, "text": "They had distinct journeys and super grateful that both existed and still grateful both exist."}, {"time": 9648, "text": "But there's different energies in getting donations as there is getting, this is important to my business."}, {"time": 9655, "text": "Like I'm selling you something that this is a, I'm going to make money this way."}, {"time": 9660, "text": "Like if you can tie it, if you can tie the message to an ROI for the company, it becomes a brainer."}, {"time": 9664, "text": "That's more effective."}, {"time": 9665, "text": "It's much more effective, right?"}, {"time": 9666, "text": "So, and there are rational arguments to make."}, {"time": 9669, "text": "I've tried to have conversations with marketing, especially marketing departments."}, {"time": 9672, "text": "Like very early on, it was clear to me that, oh, you could just take a fraction of your marketing budget and just spend it on open source development."}, {"time": 9680, "text": "And you get better results from your marketing."}, {"time": 9683, "text": "Like, because."}, {"time": 9684, "text": "How did those, can I, sorry, I'm going to try not to go and rants here."}, {"time": 9687, "text": "What have you learned from the interaction with the marketing folks on that kind of, because you gave a great example of something that will obviously be much better investment in terms of marketing is supporting open source projects."}, {"time": 9700, "text": "The challenge is not dissimilar from the challenge you have in academia or the different colleges, right?"}, {"time": 9706, "text": "Knowledge gets very specific and very channeled, right?"}, {"time": 9710, "text": "And so people get, they get a lot of learning in the thing they know about."}, {"time": 9713, "text": "And it's hard then to bridge that and to get them to think differently enough to have a sense that you might have something to offer because it's different."}, {"time": 9723, "text": "It's like, well, how do I implement that?"}, {"time": 9724, "text": "How do I, what do I do with that?"}, {"time": 9725, "text": "Like, do I, which budget do I take from?"}, {"time": 9727, "text": "Do I slow down my spend on Google ads or my spend on Facebook ads?"}, {"time": 9731, "text": "Or do I not hire a content creator and say like, there's an operational aspect to that, that you have to be the CMO, right?"}, {"time": 9739, "text": "Or the CEO, you have to get the right level."}, {"time": 9741, "text": "So you'll have to hire at a high position level where they care about this and this."}, {"time": 9745, "text": "Right, or they won't know how, right?"}, {"time": 9747, "text": "And because you can also do it very clumsily, right?"}, {"time": 9750, "text": "And I've seen it, cause you can, you absolutely have to honor and recognize the people you're going to and the fact that if you just throw money at them, it could actually create more problems."}, {"time": 9759, "text": "Can I just say, this is not you saying, can I just, cause I just need, I need to say this."}, {"time": 9764, "text": "I've been very surprised how often marketing people are terrible at marketing."}, {"time": 9771, "text": "I feel like the best marketing is doing something novel and unique that anticipates the future."}, {"time": 9778, "text": "It feels like so much of the marketing practice is like what they took in school, or maybe they're studying for what was the best thing that was done in the past decade, and they're just repeating that over and over, as opposed to innovating, like taking the risk."}, {"time": 9793, "text": "To me, marketing."}, {"time": 9795, "text": "Is taking the big risk."}, {"time": 9797, "text": "And being the first one to risk."}, {"time": 9798, "text": "Yeah, there's an aspect of data observation from that risk, right?"}, {"time": 9802, "text": "That's, I think, shared what they're doing already."}, {"time": 9805, "text": "But it absolutely, it's about, I think it's content."}, {"time": 9807, "text": "Like there's this whole world on content marketing that you could almost say, well, yeah, it can get over, you can get inundated with stuff that's not relevant to you."}, {"time": 9816, "text": "Whereas what you're saying would be highly relevant and highly useful and highly beneficial."}, {"time": 9821, "text": "Yeah, but it's risk."}, {"time": 9822, "text": "I mean, that's why I sort of, there's a lot of innovative ways of doing that."}, {"time": 9826, "text": "Tesla's an example of people that basically don't do marketing."}, {"time": 9829, "text": "They do marketing in a very, like, let's say Elon hired a person who's just good at Twitter for running Tesla's Twitter account."}, {"time": 9837, "text": "No, right, right."}, {"time": 9839, "text": "I mean, that's exactly what you wanna be doing."}, {"time": 9840, "text": "You want it to be constantly innovating in the."}, {"time": 9843, "text": "Right, there's an aspect of telling."}, {"time": 9844, "text": "I mean, I've definitely seen people doing great work where you're not talking about it."}, {"time": 9848, "text": "Like, I would say that's actually a problem I have right now with Quonset Labs."}, {"time": 9851, "text": "Quonset Labs has been doing amazing work, really excited about it, but we have not been talking about it enough."}, {"time": 9855, "text": "We haven't been."}, {"time": 9856, "text": "And there's different ways to talk about it."}, {"time": 9857, "text": "There's different ways to, there's different channels to which to communicate."}, {"time": 9860, "text": "There's also, like, I'll just throw some shade at companies I love."}, {"time": 9867, "text": "So for example, iRobot, I just had a conversation with them."}, {"time": 9870, "text": "They make Roombas."}, {"time": 9872, "text": "And I think I love, they're incredible robots, but like every time they do like advertisement, not advertisement, but like marketing type stuff, it just looks so corporate."}, {"time": 9884, "text": "And to me, the incredible, maybe wrong in the case of iRobot, I don't know."}, {"time": 9890, "text": "But to me, when you're talking about engineering systems, it's really nice to show off the magic of the engineering and the software and all the geniuses behind this product and the tinkering and like the raw authenticity of what it takes to build that system versus the marketing people who want to have like pretty people, like standing there all pretty with the robots, like moving perfectly."}, {"time": 9914, "text": "So to me, there's some aspect, it's like speaking to the hackers, you have to throw some bones, some care towards the engineers, the developers, because there's some aspect, one, for the hiring, but two, there's an authenticity to that, authenticity to that kind of communication that's really inspiring to the end user as well."}, {"time": 9936, "text": "Like if they know that brilliant people, the best in the world are working at your company, they start to believe that that product that you're creating is really good."}, {"time": 9943, "text": "It's interesting, because your initial reaction would be, wait, there's different users here."}, {"time": 9946, "text": "Why would you do that to, you know, my wife bought a Roomba, and she loves developers, she loves me, but she doesn't care about that culture."}, {"time": 9956, "text": "So essentially what you said is actually the authenticity, because everyone has a friend, everyone knows people, there's word of mouth, I mean, if you."}, {"time": 9962, "text": "Word of mouth is so, so proper."}, {"time": 9964, "text": "Yeah, exactly, that's interesting."}, {"time": 9965, "text": "Because I think it's the lack of that realization, there's this halo effect that influences your general marketing, interesting."}, {"time": 9971, "text": "For some stupid reason, I do have a platform, and it seems that the reason I have a platform, many others like me, millions of others, is like the authenticity, and like we get excited naturally about stuff."}, {"time": 9983, "text": "And like, I don't want to get excited about that iRobot video, because it's boring, it's marketing, it's corporate, as opposed to, I wanted to do some fun, this is me, like a shout out to iRobot, is they're not letting me get into the robot."}, {"time": 9999, "text": "Yeah, well there's an aspect of, that could be benefiting from a culture of modularity, like add ons, and that could actually dramatically help."}, {"time": 10007, "text": "You've seen that over history, I mean, Apple is an example of a company like that, or the, like, I can see what your point is, is that you have something that needs to be, it needs to be adopted broadly, the concept needs to be adopted broadly."}, {"time": 10020, "text": "And if you want to go beyond this one device, you need to engage this community."}, {"time": 10024, "text": "Yeah, and connecting to the open source that you said."}, {"time": 10027, "text": "I gotta ask you, you're a programmer, one of the most impactful programmers ever."}, {"time": 10034, "text": "You've led many programmers, you lead many programmers."}, {"time": 10038, "text": "What are some, from a programmer perspective, what makes a good programmer?"}, {"time": 10043, "text": "What makes a productive programmer?"}, {"time": 10045, "text": "Is there a device you can give to be a great programmer in this world?"}, {"time": 10048, "text": "That's a great, great question."}, {"time": 10050, "text": "And there are times in my life I'd probably answer this even better than I hope maybe give an answer today."}, {"time": 10055, "text": "Because I thought about this numerous times, like right now I've spent on so much time recently hiring salespeople that, That your mind is a little bit on something else."}, {"time": 10063, "text": "On something else."}, {"time": 10064, "text": "But I reflected on the past, and also, you know, I have some really, the only way I can do this, is I have some really great programmers that I work with, who lead the teams that they lead."}, {"time": 10073, "text": "And my goal is to inspire them and hopefully help them, encourage them, and be, help them encourage with their teams."}, {"time": 10079, "text": "I would say there's a number of things, couple things."}, {"time": 10081, "text": "One is curiosity."}, {"time": 10083, "text": "Like you, I think a programmer without curiosity is mundane."}, {"time": 10089, "text": "Like you'll lose interest, you won't do your best work."}, {"time": 10092, "text": "So it's sort of, it's an affect."}, {"time": 10093, "text": "It's sort of, are you, you have some curiosity about things."}, {"time": 10096, "text": "I think two, don't try to do everything at once."}, {"time": 10099, "text": "Recognize that you're, you know, we're limited as humans."}, {"time": 10101, "text": "You're limited as a human."}, {"time": 10103, "text": "And each one of us are limited in different ways."}, {"time": 10104, "text": "You know, we all have our different strengths and skills."}, {"time": 10106, "text": "So it's adapting the art of programming to your skills."}, {"time": 10109, "text": "One of the things that always works, is to limit what you're trying to solve."}, {"time": 10113, "text": "Right, so, if you're part of a team, usually maybe somebody else has put the architecture together and they've gotten given a portion for you if you're young."}, {"time": 10121, "text": "If you're not part of a team, it's sort of breaking down the problem into smaller parts, is essential for you to make progress."}, {"time": 10128, "text": "It's very easy to take on a big project and try to do it all at once, and you get lost."}, {"time": 10132, "text": "And then you do it badly."}, {"time": 10133, "text": "And so thinking about, you know, very concretely what you're doing, defining the inputs and outputs, defining what you want to get done."}, {"time": 10143, "text": "Even just talking about that and like writing down before you write code, just what are you trying to accomplish?"}, {"time": 10149, "text": "I mean, very specific about it, really, really helps."}, {"time": 10152, "text": "I think using other people's work, right?"}, {"time": 10157, "text": "Don't be afraid that somehow you're, like you should do it all."}, {"time": 10161, "text": "Like, nobody does."}, {"time": 10163, "text": "Stand on the shoulders of giants."}, {"time": 10165, "text": "And copy and paste from Stack Overflow."}, {"time": 10166, "text": "Copy and paste from Stack Overflow."}, {"time": 10168, "text": "But don't just copy and paste, this is particularly relevant in the era of Codex and the auto generated code, which is essentially, I see as an indexing of Stack Overflow."}, {"time": 10177, "text": "Secondly, it's like."}, {"time": 10178, "text": "It's a search engine."}, {"time": 10179, "text": "It's a search engine over Stack Overflow, basically."}, {"time": 10181, "text": "So it's not, I mean, we've had this for a while."}, {"time": 10183, "text": "But really, you want to cut and paste, but not blindly."}, {"time": 10187, "text": "Like, absolutely I've cut and paste to understand, but then you understand."}, {"time": 10192, "text": "Oh, this is what this means."}, {"time": 10193, "text": "Oh, this is what it's doing."}, {"time": 10194, "text": "And understand as much as you can."}, {"time": 10196, "text": "So it's critical, that's where the curiosity comes in."}, {"time": 10199, "text": "If you're just blindly cutting and pasting, you're not gonna understand."}, {"time": 10202, "text": "So understand, and then be sensitive to hype cycles."}, {"time": 10208, "text": "Right, every few often there's always a, oh, test driven development is the answer."}, {"time": 10212, "text": "Oh, object oriented is the answer."}, {"time": 10213, "text": "Oh, there's always an answer."}, {"time": 10216, "text": "Agile is the answer."}, {"time": 10218, "text": "Be cautious of jumping onto a hype cycle."}, {"time": 10220, "text": "Like, likely there's signal."}, {"time": 10222, "text": "Like, there's a thing there that's actually valuable, you can learn from."}, {"time": 10225, "text": "But it's almost certainly not the answer to everything you need."}, {"time": 10228, "text": "What lessons do you draw from you having created NumPy and SciPy?"}, {"time": 10234, "text": "Like, in service of sort of answering the question of what it takes to be a great programmer and giving advice to people."}, {"time": 10240, "text": "How can you be the next person to create a SciPy?"}, {"time": 10242, "text": "Yeah, so one is listen."}, {"time": 10245, "text": "To?"}, {"time": 10247, "text": "To who?"}, {"time": 10248, "text": "To people that have a problem, right?"}, {"time": 10251, "text": "Which is everybody, right?"}, {"time": 10252, "text": "But listen, and listen to many."}, {"time": 10254, "text": "And then try to, and then do."}, {"time": 10257, "text": "Like, you're gonna have to do an experiment, you know?"}, {"time": 10259, "text": "Do, fall down, don't be afraid to fall down."}, {"time": 10261, "text": "Don't be afraid, the first thing you do is probably gonna suck, and that's okay, right?"}, {"time": 10267, "text": "It's honestly, I think iteration is the key to innovation."}, {"time": 10271, "text": "And it's almost that psychological hesitation we have to just iterate."}, {"time": 10278, "text": "Like, yeah, we know it's not great, but next time it'll be better."}, {"time": 10282, "text": "I mean, just keep learning and keep improving."}, {"time": 10285, "text": "So it's an attitude."}, {"time": 10287, "text": "And then it doesn't take intense concentration, right?"}, {"time": 10292, "text": "Good things don't happen just, it's not quite like TikTok or like Facebook, you know?"}, {"time": 10298, "text": "You can't scroll your way to good programming, right?"}, {"time": 10300, "text": "There are sincere hours of deep, don't be afraid of the deep problem."}, {"time": 10306, "text": "Like, often people will run away from something because, oh, I can't solve this."}, {"time": 10309, "text": "And you might be right, but give it an hour."}, {"time": 10311, "text": "Give it a couple of hours and see."}, {"time": 10313, "text": "And just five minutes, not gonna give you that."}, {"time": 10316, "text": "Was it lonely when you were building SciPy and NumPy?"}, {"time": 10320, "text": "Hugely, yeah, absolutely lonely, in the sense of you had to have an inner drive, and that inner drive for me always comes from, I have to see that this is right in some angle."}, {"time": 10331, "text": "I have to believe it, that this is the right approach, the right thing to do."}, {"time": 10334, "text": "With SciPy, it was like, oh yeah, the world needs libraries and Python."}, {"time": 10339, "text": "Clearly Python's popular enough with enough influential people to start, and it needs more libraries."}, {"time": 10344, "text": "So that is a good in and of itself."}, {"time": 10346, "text": "So I'm gonna go do that good."}, {"time": 10348, "text": "So find a good, find a thing that you know is good and just work on it."}, {"time": 10353, "text": "So that has to happen, and it is."}, {"time": 10354, "text": "And you kind of have to have enough realization of your mission to be okay with the naysayer or the fact that not everybody joins you at front."}, {"time": 10362, "text": "In fact, one thing I've talked to people a lot, I've seen a lot of projects come, and some fail."}, {"time": 10365, "text": "Not everything I've done has actually worked perfectly."}, {"time": 10367, "text": "I've tried a bunch of stuff that, okay, that didn't really work, or this isn't working, and why."}, {"time": 10371, "text": "But you see the patterns, and one of the key things is you can't even know for six months."}, {"time": 10379, "text": "I say 18 months right now."}, {"time": 10380, "text": "If you're starting a new project, you gotta give it a good 18 month run before you even know if the feedback's there."}, {"time": 10385, "text": "You're not gonna know in six months."}, {"time": 10387, "text": "You might have the perfect thing, but six months from now, it's still kind of still emerging."}, {"time": 10391, "text": "So give it time, because you're dealing with humans, and humans have an inertial energy that just doesn't change that quickly, so."}, {"time": 10398, "text": "Let me ask a silly question, but like you said, you're focused on the sales side of things currently, but back when you were actively programming, maybe in the 90s, you talked about IDEs."}, {"time": 10411, "text": "What's a setup that you have that brings you joy?"}, {"time": 10416, "text": "Keyboard, number of screens, Linux."}, {"time": 10419, "text": "I do still like to program some."}, {"time": 10420, "text": "It's not as much as I used to."}, {"time": 10422, "text": "I have two projects I'm super interested in, trying to find funding for them, trying to figure out teams for them, but I could talk about those."}, {"time": 10429, "text": "But what I, yeah, I'm an Emacs guy."}, {"time": 10431, "text": "Great, thank the superior editor, everybody."}, {"time": 10436, "text": "I've got, I don't often delete tweets, but one of the tweets I deleted when I said Emacs was better than Vim, and then the hate I got from it."}, {"time": 10445, "text": "I was like, I'm walking away from this."}, {"time": 10447, "text": "I do too, I don't push it."}, {"time": 10449, "text": "I mean, I'm not."}, {"time": 10450, "text": "I'm just joking, of course."}, {"time": 10451, "text": "Yeah, exactly, it's kind of like, but people do take the editor seriously, right?"}, {"time": 10454, "text": "I did it as a joke."}, {"time": 10455, "text": "That's your life."}, {"time": 10456, "text": "It is, but there's something beautiful to me about Emacs, but for people that love Vim, there's something beautiful to them about that."}, {"time": 10464, "text": "I mean, I do use Vim for quick editing."}, {"time": 10466, "text": "Like Command Line, if I said quick editing, I will still sometimes use it, but not much."}, {"time": 10470, "text": "Like it's simple, corrective signal editor character."}, {"time": 10472, "text": "So when you were developing SciPy, you were using Emacs?"}, {"time": 10474, "text": "Emacs, yeah."}, {"time": 10475, "text": "SciPy and NumPy are all written on Emacs on a Linux box."}, {"time": 10479, "text": "And CVS and then SVN, version control."}, {"time": 10483, "text": "Git came later."}, {"time": 10484, "text": "Like Git has, I love distributed branch stuff."}, {"time": 10488, "text": "I think Git is pretty complicated, but I love the concept."}, {"time": 10491, "text": "And also, of course, GitHub and then GitLab make Git definitely consumable, but that came later."}, {"time": 10499, "text": "Did you ever touch Lisp at all?"}, {"time": 10500, "text": "Like what were your emotional feelings about all the parentheses?"}, {"time": 10504, "text": "Yeah, so great question."}, {"time": 10505, "text": "So I find myself appreciating Lisp today much more than I did early."}, {"time": 10509, "text": "Because when I came to programming, I knew programming, but I was a domain expert, right?"}, {"time": 10513, "text": "And to me, the parentheses were in the way."}, {"time": 10515, "text": "It's like, wow, there's just all this, like it just gets in the way of my thinking about what I'm doing."}, {"time": 10520, "text": "So why would I have all these, right?"}, {"time": 10522, "text": "That was my initial reaction to it."}, {"time": 10524, "text": "And now as I appreciate kind of the structure that kind of naturally maps to a logical thinking about a program, I can appreciate them, right?"}, {"time": 10533, "text": "And why it's actually, you could create editors that make it not so problematic, right, honestly."}, {"time": 10540, "text": "So I actually have a much more appreciation of Lisp and things like Clojure and there's HyVee, which is a Python Lisp that compiles the Python bytecode."}, {"time": 10548, "text": "I think it's challenging."}, {"time": 10550, "text": "Like typically these languages are, I even saw the whole data science programming system in Lisp that somebody created, which is cool."}, {"time": 10558, "text": "But again, I think it's the lack of recognition of the fact that there exists what I call occasional programmers."}, {"time": 10564, "text": "People that are never gonna be programmers for a living."}, {"time": 10565, "text": "They don't want to have all this cuteness in their head."}, {"time": 10568, "text": "They want just, it's why basic, you know, Microsoft had the right idea with basic in terms of having that be the language of visual basic, the language of Excel and SQL Server."}, {"time": 10581, "text": "They should have converted that to Python 10 years ago."}, {"time": 10583, "text": "Like the world would be a better place if they had, but."}, {"time": 10587, "text": "There's also, there's a beauty and a magic to the history behind a language in Lisp."}, {"time": 10591, "text": "You know, some of the most interesting people in the history of computer science and artificial intelligence have used Lisp."}, {"time": 10597, "text": "So you feel."}, {"time": 10600, "text": "Well, especially that language, when you have a language, you can think in it."}, {"time": 10603, "text": "And it helps you think better."}, {"time": 10604, "text": "And it attracts a certain kinds of people that think in a certain kind of way."}, {"time": 10606, "text": "And then that's there."}, {"time": 10608, "text": "Okay, so what about like small laptop with a tiny keyboard, or is there like three screens?"}, {"time": 10615, "text": "You know, good question."}, {"time": 10615, "text": "I've never gotten into the big, many screens to be honest."}, {"time": 10618, "text": "I mean, and maybe it's because in my head, I kind of just, I just swap between windows."}, {"time": 10623, "text": "Like, partly because I guess I really can't process three screens at once anyway."}, {"time": 10629, "text": "Like, I just am looking at one and I just flip."}, {"time": 10632, "text": "You know, I flip an application open."}, {"time": 10634, "text": "So where it's really helpful is actually when I'm trying to do, you know, here's data and I want to input it from here."}, {"time": 10640, "text": "Like this is the only time I really need another screen."}, {"time": 10642, "text": "So now, because you're both a developer, lead developers, but then there's also these businesses and there's salespeople and you're working with large companies."}, {"time": 10650, "text": "Operations people, hiring people, yeah."}, {"time": 10653, "text": "Which operating system is your favorite at this point?"}, {"time": 10657, "text": "So Linux was the early days."}, {"time": 10658, "text": "So yeah, I love Linux as a server side."}, {"time": 10661, "text": "And it was early days I had my own Linux desktop."}, {"time": 10664, "text": "I've been on Mac laptops for 10 years now."}, {"time": 10667, "text": "Yeah, this is what leadership looks like."}, {"time": 10670, "text": "As you switch to Mac."}, {"time": 10673, "text": "Pretty much, I mean, just the fact that I had to do PowerPoints, I had to do presentations and you know, plug in, I just couldn't mess with plugging in laptops, it wouldn't project and yeah."}, {"time": 10684, "text": "So you mentioned also Quantset Labs and things like that."}, {"time": 10689, "text": "Can you give advice on how to hire great programmers and great people?"}, {"time": 10694, "text": "Yeah, I would say, produce an open source project, get people contributing to it and hire those people."}, {"time": 10701, "text": "Yeah, I mean, you're doing it sort of, you may be perhaps a little biased, but that's probably 100% really good advice."}, {"time": 10710, "text": "I find it hard to hire."}, {"time": 10711, "text": "I still find it hard to hire, like in terms of, I don't think that it's not hard to hire if I've worked with somebody for a couple of weeks, but an hour or two of interviews, I have no idea."}, {"time": 10723, "text": "So that instinct, that radar of knowing if you're good or not, that you've found that you're still not able to."}, {"time": 10730, "text": "It's really hard, I mean, the resume can help, but again, the resume is like a presentation of the things they want you to see, not the reality of, and there's also, you have to understand what you're hiring for."}, {"time": 10743, "text": "There are different stages and different kinds of skills."}, {"time": 10746, "text": "And so it isn't just, one of the things I talk a lot about internally at my company is just that the whole idea of measuring ourselves against a single axis is flawed because we're not, it's a multidimensional space and how do you order a multidimensional space?"}, {"time": 10762, "text": "There isn't one ordering."}, {"time": 10763, "text": "So this whole idea, you immediately get projected into a thing when you're talking about hiring or best or worst or better or not better."}, {"time": 10770, "text": "So what is the thing you're actually needing?"}, {"time": 10773, "text": "And you can hire for that."}, {"time": 10775, "text": "There is such a thing, generally, I really value people who have the affect, that care about open source."}, {"time": 10782, "text": "Like so in some cases, their affinity to open source is simply kind of a filter of an affect."}, {"time": 10789, "text": "However, I have found this interesting dichotomy between open source contributors and product creation."}, {"time": 10798, "text": "There's, I don't know if it's fully true, but there does seem to be the more experienced, the more affect somebody has an open source community, the less ability to actually produce product that they have."}, {"time": 10811, "text": "And the opposite is kind of true too."}, {"time": 10813, "text": "The more product focused are, I find a lot of people, I've talked to a lot of people who produce really great products and they have a, they're looking over the open source communities, kind of wanting to participate and play, but they've played here and they do a great job here and then they don't necessarily have some of the same."}, {"time": 10829, "text": "Now I don't think that's entirely necessary."}, {"time": 10832, "text": "I think part of it is cultural, how they've emerged."}, {"time": 10834, "text": "Because one of the things that open source communities often lack is great product management, like some product management energy."}, {"time": 10841, "text": "That's brilliant, but you want both of those energies in the same place together."}, {"time": 10844, "text": "Yes, you really do."}, {"time": 10845, "text": "And so a lot of it's creating these teams of people that have these needed skills and attributes that are hard."}, {"time": 10851, "text": "And so one of the big things I look for is somebody that fundamentally recognizes their need to learn."}, {"time": 10857, "text": "Like one of the values that we have in all of the things we do is learning."}, {"time": 10861, "text": "Like if somebody thinks they know it all, they're gonna struggle."}, {"time": 10866, "text": "And some of that is just, there's more basic things like humility, just being humble in the face of all the things you don't know."}, {"time": 10874, "text": "And that's step one of learning."}, {"time": 10875, "text": "That's step one of learning, right?"}, {"time": 10876, "text": "And I've spent a lot of time learning, right?"}, {"time": 10880, "text": "Other people spend a lot more time, but I've spent a lot of time learning."}, {"time": 10883, "text": "My whole goal was to get a PhD because I love school and I wanted to be a scientist."}, {"time": 10888, "text": "And then what I found is what's been written about elsewhere as well is the more I learned, the more I didn't know."}, {"time": 10893, "text": "The more I realized, man, I know about this, but this is such a tiny thing in the global scope of what I might wanna know about."}, {"time": 10901, "text": "So I need to be listening a whole lot better than I am just talking."}, {"time": 10907, "text": "That's changed a little bit actually."}]}]