[{"title": "Alex Garland: Ex Machina, Devs, Annihilation, and the Poetry of Science | Lex Fridman Podcast #77", "id": "gU-mkuMU428", "quotes": [{"time": 355, "text": "So yes, dream state, no simulation would be where I'd come down."}, {"time": 360, "text": "Going further, deeper into that direction, you've also described that world as psychedelia."}, {"time": 368, "text": "So on that topic, I'm curious about that world."}, {"time": 371, "text": "On the topic of psychedelic drugs, do you see those kinds of chemicals that modify our perception as a distortion of our perception of reality or a window into another reality?"}, {"time": 385, "text": "No, I think what I'd be saying is that we live in a distorted reality and then those kinds of drugs give us a different kind of distorted."}, {"time": 392, "text": "Different perspective."}, {"time": 394, "text": "They just give an alternate distortion."}, {"time": 395, "text": "And I think that what they really do is they give a distorted perception, which is a little bit more allied to daydreams or unconscious interests."}, {"time": 407, "text": "So if for some reason you're feeling unconsciously anxious at that moment and you take a psychedelic drug, you'll have a more pronounced, unpleasant experience."}, {"time": 416, "text": "And if you're feeling very calm or happy, you might have a good time."}, {"time": 421, "text": "But yeah, so if I'm saying we're starting from a premise, our starting point is we were already in the slightly psychedelic state."}, {"time": 430, "text": "What those drugs do is help you go further down an avenue or maybe a slightly different avenue, but that's all."}, {"time": 436, "text": "So in that movie, Annihilation, the shimmer, this alternate dreamlike state is created by, I believe perhaps, an alien entity."}, {"time": 449, "text": "Of course, everything is up to interpretation, right?"}, {"time": 452, "text": "But do you think there's, in our world, in our universe, do you think there's intelligent life out there?"}, {"time": 459, "text": "And if so, how different is it from us humans?"}, {"time": 462, "text": "Well, one of the things I was trying to do in Annihilation was to offer up a form of alien life that was actually alien, because it would often seem to me that in the way that in the way we would represent aliens in books or cinema or television, or any one of the sort of storytelling mediums, is we would always give them very humanlike qualities."}, {"time": 491, "text": "So they wanted to teach us about galactic federations, or they wanted to eat us, or they wanted our resources, like our water, or they want to enslave us, or whatever it happens to be."}, {"time": 501, "text": "But all of these are incredibly humanlike motivations."}, {"time": 505, "text": "And I was interested in the idea of an alien that was not in any way like us."}, {"time": 514, "text": "It didn't share."}, {"time": 516, "text": "Maybe it had a completely different clock speed."}, {"time": 518, "text": "Maybe it's way, so we're talking about, we're looking at each other, we're getting information, light hits our optic nerve, our brain makes the best guess of what we're doing."}, {"time": 529, "text": "Sometimes it's right, something, you know, the thing we were talking about before."}, {"time": 531, "text": "What if this alien doesn't have an optic nerve?"}, {"time": 534, "text": "Maybe its way of encountering the space it's in is wholly different."}, {"time": 539, "text": "Maybe it has a different relationship with gravity."}, {"time": 541, "text": "The basic laws of physics it operates under might be fundamentally different."}, {"time": 545, "text": "It could be a different time scale and so on."}, {"time": 547, "text": "Yeah, or it could be the same laws, could be the same underlying laws of physics."}, {"time": 552, "text": "You know, it's a machine created, or it's a creature created in a quantum mechanical way."}, {"time": 559, "text": "It just ends up in a very, very different place to the one we end up in."}, {"time": 563, "text": "So, part of the preoccupation with annihilation was to come up with an alien that was really alien and didn't give us, and it didn't give us and we didn't give it any kind of easy connection between human and the alien."}, {"time": 579, "text": "Because I think it was to do with the idea that you could have an alien that landed on this planet that wouldn't even know we were here."}, {"time": 586, "text": "And we might only glancingly know it was here."}, {"time": 589, "text": "There'd just be this strange point where the vent diagrams connected, where we could sense each other or something like that."}, {"time": 596, "text": "So in the movie, first of all, incredibly original view of what an alien life would be."}, {"time": 601, "text": "And in that sense, it's a huge success."}, {"time": 605, "text": "Let's go inside your imagination."}, {"time": 607, "text": "Did the alien, that alien entity know anything about humans when it landed?"}, {"time": 614, "text": "So the idea is you're basically an alien that life is trying to reach out to anything that might be able to hear its mechanism of communication."}, {"time": 625, "text": "Or was it simply, was it just basically their biologist exploring different kinds of stuff that you can find?"}, {"time": 632, "text": "But this is the interesting thing is, as soon as you say their biologist, you've done the thing of attributing human type motivations to it."}, {"time": 640, "text": "So I was trying to free myself from anything like that."}, {"time": 648, "text": "So all sorts of questions you might answer about this notional alien, I wouldn't be able to answer because I don't know what it was or how it worked."}, {"time": 657, "text": "You know, I had some rough ideas."}, {"time": 660, "text": "Like it had a very, very, very slow clock speed."}, {"time": 664, "text": "And I thought maybe the way it is interacting with this environment is a little bit like the way an octopus will change its color forms around the space that it's in."}, {"time": 675, "text": "So it's sort of reacting to what it's in to an extent, but the reason it's reacting in that way is indeterminate."}, {"time": 683, "text": "But it's so, but it's clock speed was slower than our human life clock speed or inter, but it's faster than evolution."}, {"time": 692, "text": "Faster than our evolution."}, {"time": 694, "text": "Yeah, given the 4 billion years it took us to get here, then yes, maybe it started at eight."}, {"time": 699, "text": "If you look at the human civilization as a single organism, in that sense, you know, this evolution could be us."}, {"time": 706, "text": "You know, the evolution of living organisms on earth could be just a single organism."}, {"time": 711, "text": "And it's kind of, that's its life, is the evolution process that eventually will lead to probably the heat death of the universe or something before that."}, {"time": 722, "text": "I mean, that's just an incredible idea."}, {"time": 725, "text": "So you almost don't know."}, {"time": 727, "text": "You've created something that you don't even know how it works."}, {"time": 731, "text": "Yeah, because anytime I tried to look into how it might work, I would then inevitably be attaching my kind of thought processes into it."}, {"time": 742, "text": "And I wanted to try and put a bubble around it."}, {"time": 744, "text": "I would say, no, this is alien in its most alien form."}, {"time": 749, "text": "I have no real point of contact."}, {"time": 752, "text": "So unfortunately I can't talk to Stanley Kubrick."}, {"time": 757, "text": "So I'm really fortunate to get a chance to talk to you."}, {"time": 761, "text": "On this particular notion, I'd like to ask it a bunch of different ways and we'll explore it in different ways, but do you ever consider human imagination, your imagination as a window into a possible future?"}, {"time": 777, "text": "And that what you're doing, you're putting that imagination on paper as a writer and then on screen as a director."}, {"time": 784, "text": "And that plants the seeds in the minds of millions of future and current scientists."}, {"time": 790, "text": "And so your imagination, you putting it down actually makes it as a reality."}, {"time": 794, "text": "So it's almost like a first step of the scientific method that you imagining what's possible in your new series with Ex Machina is actually inspiring thousands of 12 year olds, millions of scientists and actually creating the future view of imagine."}, {"time": 814, "text": "Well, all I could say is that from my point of view, it's almost exactly the reverse because I see that pretty much everything I do is a reaction to what scientists are doing."}, {"time": 830, "text": "I'm an interested lay person."}, {"time": 833, "text": "And I feel this individual, I feel that the most interesting area that humans are involved in is science."}, {"time": 845, "text": "I think art is very, very interesting, but the most interesting is science."}, {"time": 849, "text": "And science is in a weird place because maybe around the time Newton was alive, if a very, very interested lay person said to themselves, I want to really understand what Newton is saying about the way the world works with a few years of dedicated thinking, they would be able to understand the sort of principles he was laying out."}, {"time": 874, "text": "And I don't think that's true anymore."}, {"time": 875, "text": "I think that's stopped being true now."}, {"time": 877, "text": "So I'm pretty smart guy."}, {"time": 881, "text": "And if I said to myself, I want to really, really understand what is currently the state of quantum mechanics or string theory or any of the sort of branching areas of it, I wouldn't be able to."}, {"time": 896, "text": "I'd be intellectually incapable of doing it because to work in those fields at the moment is a bit like being an athlete."}, {"time": 903, "text": "I suspect you need to start when you're 12, you know?"}, {"time": 906, "text": "And if you start in your mid 20s, start trying to understand in your mid 20s, then you're just never going to catch up."}, {"time": 913, "text": "That's the way it feels to me."}, {"time": 915, "text": "So what I do is I try to make myself open."}, {"time": 919, "text": "So the people that you're implying maybe I would influence, to me, it's exactly the other way around."}, {"time": 925, "text": "These people are strongly influencing me."}, {"time": 928, "text": "I'm thinking they're doing something fascinating."}, {"time": 930, "text": "I'm concentrating and working as hard as I can to try and understand the implications of what they say."}, {"time": 935, "text": "And in some ways, often what I'm trying to do is disseminate their ideas into a means by which it can enter a public conversation."}, {"time": 950, "text": "So Ex Machina contains lots of name checks, all sorts of existing thought experiments, shadows on Plato's cave and Mary in the black and white room and all sorts of different longstanding thought processes about sentience or consciousness or subjectivity or gender or whatever it happens to be."}, {"time": 974, "text": "And then I'm trying to marshal that into a narrative to say, look, this stuff is interesting and it's also relevant and this is my best shot at it."}, {"time": 983, "text": "So I'm the one being influenced in my construction."}, {"time": 988, "text": "Of course you would say that because you're not even aware of your own."}, {"time": 993, "text": "That's probably what Kubrick would say too, right?"}, {"time": 1031, "text": "I certainly think that's true with 2001 A Space Odyssey."}, {"time": 1035, "text": "I think at its best, and if it fails."}, {"time": 1038, "text": "It's true of that, yeah, it's true of that, definitely."}, {"time": 1041, "text": "At its best, it plans something."}, {"time": 1043, "text": "It's hard to describe it."}, {"time": 1044, "text": "It inspires the next generation and it could be field dependent."}, {"time": 1051, "text": "So your new series has more a connection to physics, quantum physics, quantum mechanics, quantum computing, and yet Ex Machina has more artificial intelligence."}, {"time": 1060, "text": "I know more about AI."}, {"time": 1063, "text": "My sense that AI is much earlier in the depth of its understanding."}, {"time": 1071, "text": "I would argue nobody understands anything to the depth that physicists do about physics."}, {"time": 1077, "text": "In AI, nobody understands AI, that there is a lot of importance and role for imagination, which I think we're in that, where Freud imagined the subconscious, we're in that stage of AI, where there's a lot of imagination needed thinking outside the box."}, {"time": 1095, "text": "The spread of discussions and the spread of anxieties that exists about AI fascinate me."}, {"time": 1104, "text": "The way in which some people seem terrified about it whilst also pursuing it."}, {"time": 1112, "text": "And I've never shared that fear about AI personally, but the way in which it agitates people and also the people who it agitates, I find kind of fascinating."}, {"time": 1127, "text": "Are you afraid?"}, {"time": 1129, "text": "Are you excited?"}, {"time": 1131, "text": "Are you sad by the possibility, let's take the existential risk of artificial intelligence, by the possibility an artificial intelligence system becomes our offspring and makes us obsolete?"}, {"time": 1147, "text": "I mean, it's a huge subject to talk about, I suppose."}, {"time": 1150, "text": "But one of the things I think is that humans are actually very experienced at creating new life forms because that's why you and I are both here and it's why everyone on the planet is here."}, {"time": 1164, "text": "And so something in the process of having a living thing that exists that didn't exist previously is very much encoded into the structures of our life and the structures of our societies."}, {"time": 1177, "text": "Doesn't mean we always get it right, but it does mean we've learned quite a lot about that."}, {"time": 1182, "text": "We've learned quite a lot about what the dangers are of allowing things to be unchecked."}, {"time": 1189, "text": "And it's why we then create systems of checks and balances in our government and so on and so forth."}, {"time": 1195, "text": "I mean, that's not to say, the other thing is it seems like there's all sorts of things that you could put into a machine that you would not be."}, {"time": 1204, "text": "So with us, we sort of roughly try to give some rules to live by and some of us then live by those rules and some don't."}, {"time": 1211, "text": "And with a machine, it feels like you could enforce those things."}, {"time": 1213, "text": "So partly because of our previous experience and partly because of the different nature of a machine, I just don't feel anxious about it."}, {"time": 1222, "text": "More I just see all the good that, broadly speaking, the good that can come from it."}, {"time": 1228, "text": "But that's just where I am on that anxiety spectrum."}, {"time": 1232, "text": "You know, it's kind of, there's a sadness."}, {"time": 1234, "text": "So we as humans give birth to other humans, right?"}, {"time": 1237, "text": "But there's generations."}, {"time": 1239, "text": "And there's often in the older generation, a sadness about what the world has become now."}, {"time": 1244, "text": "I mean, that's kind of... Yeah, there is, but there's a counterpoint as well, which is that most parents would wish for a better life for their children."}, {"time": 1253, "text": "So there may be a regret about some things about the past, but broadly speaking, what people really want is that things will be better for the future generations, not worse."}, {"time": 1262, "text": "And so, and then it's a question about what constitutes a future generation."}, {"time": 1267, "text": "A future generation could involve people."}, {"time": 1269, "text": "It also could involve machines and it could involve a sort of cross pollinated version of the two or any, but none of those things make me feel anxious."}, {"time": 1279, "text": "It doesn't give you anxiety."}, {"time": 1281, "text": "It doesn't excite you?"}, {"time": 1283, "text": "Like anything that's new?"}, {"time": 1285, "text": "Not anything that's new."}, {"time": 1286, "text": "I don't think, for example, I've got, my anxieties relate to things like social media that, so I've got plenty of anxieties about that."}, {"time": 1295, "text": "Which is also driven by artificial intelligence in the sense that there's too much information to be able to, an algorithm has to filter that information and present to you."}, {"time": 1306, "text": "So ultimately the algorithm, a simple, oftentimes simple algorithm is controlling the flow of information on social media."}, {"time": 1314, "text": "So that's another form of AI."}, {"time": 1317, "text": "But at least my sense of it, I might be wrong, but my sense of it is that the algorithms have an either conscious or unconscious bias, which is created by the people who are making the algorithms and sort of delineating the areas to which those algorithms are gonna lean."}, {"time": 1335, "text": "And so for example, the kind of thing I'd be worried about is that it hasn't been thought about enough how dangerous it is to allow algorithms to create echo chambers, say."}, {"time": 1346, "text": "But that doesn't seem to me to be about the AI or the algorithm."}, {"time": 1352, "text": "It's the naivety of the people who are constructing the algorithms to do that thing."}, {"time": 1358, "text": "If you see what I mean."}, {"time": 1360, "text": "So in your new series, Devs, and we could speak more broadly, there's a, let's talk about the people constructing those algorithms, which in our modern society, Silicon Valley, those algorithms happen to be a source of a lot of income because of advertisements."}, {"time": 1376, "text": "So let me ask sort of a question about those people."}, {"time": 1381, "text": "Are current concerns and failures on social media, their naivety?"}, {"time": 1386, "text": "I can't pronounce that word well."}, {"time": 1388, "text": "Are they naive?"}, {"time": 1389, "text": "Are they, I use that word carefully, but evil in intent or misaligned in intent?"}, {"time": 1400, "text": "I think that's a, do they mean well and just go have an unintended consequence?"}, {"time": 1407, "text": "Or is there something dark in them that results in them creating a company results in that super competitive drive to be successful."}, {"time": 1417, "text": "And those are the people that will end up controlling the algorithms."}, {"time": 1421, "text": "At a guess, I'd say there are instances of all those things."}, {"time": 1424, "text": "So sometimes I think it's naivety."}, {"time": 1427, "text": "Sometimes I think it's extremely dark."}, {"time": 1429, "text": "And sometimes I think people are not being naive or dark."}, {"time": 1436, "text": "And then in those instances are sometimes generating things that are very benign and other times generating things that despite their best intentions are not very benign."}, {"time": 1447, "text": "It's something, I think the reason why I don't get anxious about AI in terms of, or at least AIs that have, I don't know, a relationship with, some sort of relationship with humans is that I think that's the stuff we're quite well equipped to understand how to mitigate."}, {"time": 1471, "text": "The problem is issues that relate actually to the power of humans or the wealth of humans."}, {"time": 1481, "text": "And that's where it's dangerous here and now."}, {"time": 1485, "text": "So what I see, I'll tell you what I sometimes feel about Silicon Valley is that it's like Wall Street in the 80s."}, {"time": 1498, "text": "It's rabidly capitalistic, absolutely rabidly capitalistic and it's rabidly greedy."}, {"time": 1506, "text": "But whereas in the 80s, the sense one had of Wall Street was that these people kind of knew they were sharks and in a way relished in being sharks and dressed in sharp suits and kind of lorded over other people and felt good about doing it."}, {"time": 1526, "text": "Silicon Valley has managed to hide its voracious Wall Street like capitalism behind hipster T shirts and cool cafes in the place where they set up there."}, {"time": 1537, "text": "And so that obfuscates what's really going on and what's really going on is the absolute voracious pursuit of money and power."}, {"time": 1545, "text": "So that's where it gets shaky for me."}, {"time": 1548, "text": "So that veneer and you explore that brilliantly, that veneer of virtue that Silicon Valley has."}, {"time": 1557, "text": "Which they believe themselves, I'm sure for a long time."}, {"time": 1561, "text": "Okay, I hope to be one of those people and I believe that."}, {"time": 1571, "text": "So as maybe a devil's advocate term, poorly used in this case, what if some of them really are trying to build a better world?"}, {"time": 1582, "text": "I'm sure I think some of them are."}, {"time": 1584, "text": "I think I've spoken to ones who I believe in their heart feel they're building a better world."}, {"time": 1587, "text": "Are they not able to?"}, {"time": 1589, "text": "No, they may or may not be, but it's just as a zone with a lot of bullshit flying about."}, {"time": 1595, "text": "And there's also another thing, which is this actually goes back to, I always thought about some sports that later turned out to be corrupt in the way that the sport, like who won the boxing match or how a football match got thrown or cricket match or whatever happened to be."}, {"time": 1615, "text": "And I used to think, well, look, if there's a lot of money and there really is a lot of money, people stand to make millions or even billions, you will find a corruption that's gonna happen."}, {"time": 1625, "text": "So it's in the nature of its voracious appetite that some people will be corrupt and some people will exploit and some people will exploit whilst thinking they're doing something good."}, {"time": 1639, "text": "But there are also people who I think are very, very smart and very benign and actually very self aware."}, {"time": 1646, "text": "And so I'm not trying to, I'm not trying to wipe out the motivations of this entire area."}, {"time": 1654, "text": "But I do, there are people in that world who scare the hell out of me."}, {"time": 1660, "text": "Yeah, I'm a little bit naive in that, like I don't care at all about money."}, {"time": 1665, "text": "And so I'm a... You might be one of the good guys."}, {"time": 1672, "text": "Yeah, but so the thought is, but I don't have money."}, {"time": 1675, "text": "So my thought is if you give me a billion dollars, I would, it would change nothing and I would spend it right away on investing it right back and creating a good world."}, {"time": 1684, "text": "But your intuition is that billion, there's something about that money that maybe slowly corrupts the people around you."}, {"time": 1693, "text": "There's somebody gets in that corrupts your soul the way you view the world."}, {"time": 1697, "text": "Money does corrupt, we know that."}, {"time": 1700, "text": "But there's a different sort of problem aside from just the money corrupts thing that we're familiar with throughout history."}, {"time": 1710, "text": "And it's more about the sense of reinforcement an individual gets, which is so..."}, {"time": 1717, "text": "It effectively works like the reason I earned all this money and so much more money than anyone else is because I'm very gifted."}, {"time": 1726, "text": "I'm actually a bit smarter than they are, or I'm a lot smarter than they are, and I can see the future in the way they can't."}, {"time": 1732, "text": "And maybe some of those people are not particularly smart, they're very lucky, or they're very talented entrepreneurs."}, {"time": 1739, "text": "And there's a difference between..."}, {"time": 1742, "text": "So in other words, the acquisition of the money and power can suddenly start to feel like evidence of virtue."}, {"time": 1748, "text": "And it's not evidence of virtue, it might be evidence of completely different things."}, {"time": 1751, "text": "That's brilliantly put, yeah."}, {"time": 1753, "text": "Yeah, that's brilliantly put."}, {"time": 1755, "text": "So I think one of the fundamental drivers of my current morality... Let me just represent nerds in general of all kinds, is of constant self doubt and the signals..."}, {"time": 1773, "text": "I'm very sensitive to signals from people that tell me I'm doing the wrong thing."}, {"time": 1778, "text": "But when there's a huge inflow of money, you just put it brilliantly that that could become an overpowering signal that everything you do is right."}, {"time": 1789, "text": "And so your moral compass can just get thrown off."}, {"time": 1793, "text": "Yeah, and that is not contained to Silicon Valley, that's across the board."}, {"time": 1798, "text": "In general, yeah."}, {"time": 1799, "text": "Like I said, I'm from the Soviet Union, the current president is convinced, I believe, actually he wants to do really good by the country and by the world, but his moral compass may be off because... Yeah, I mean, it's the interesting thing about evil, which is that I think most people who do spectacularly evil things think themselves they're doing really good things."}, {"time": 1825, "text": "That they're not there thinking, I am a sort of incarnation of Satan."}, {"time": 1829, "text": "They're thinking, yeah, I've seen a way to fix the world and everyone else is wrong, here I go."}, {"time": 1835, "text": "In fact, I'm having a fascinating conversation with a historian of Stalin, and he took power."}, {"time": 1842, "text": "He actually got more power than almost any person in history."}, {"time": 1849, "text": "And he wanted, he didn't want power."}, {"time": 1852, "text": "He just wanted, he truly, and this is what people don't realize, he truly believed that communism will make for a better world."}, {"time": 1861, "text": "And he wanted power."}, {"time": 1862, "text": "He wanted to destroy the competition to make sure that we actually make communism work in the Soviet Union and then spread across the world."}, {"time": 1870, "text": "He was trying to do good."}, {"time": 1872, "text": "I think it's typically the case that that's what people think they're doing."}, {"time": 1877, "text": "And I think that, but you don't need to go to Stalin."}, {"time": 1881, "text": "I mean, Stalin, I think Stalin probably got pretty crazy, but actually that's another part of it, which is that the other thing that comes from being convinced of your own virtue is that then you stop listening to the modifiers around you."}, {"time": 1894, "text": "And that tends to drive people crazy."}, {"time": 1897, "text": "It's other people that keep us sane."}, {"time": 1900, "text": "And if you stop listening to them, I think you go a bit mad."}, {"time": 1903, "text": "That also happens."}, {"time": 1905, "text": "Disagreement keeps us sane."}, {"time": 1907, "text": "To jump back for an entire generation of AI researchers, 2001, a Space Odyssey, put an image, the idea of human level, superhuman level intelligence into their mind."}, {"time": 1920, "text": "Do you ever, sort of jumping back to Ex Machina and talk a little bit about that, do you ever consider the audience of people who build the systems, the roboticists, the scientists that build the systems based on the stories you create, which I would argue, I mean, there's literally most of the top researchers about 40, 50 years old and plus, that's their favorite movie, 2001 Space Odyssey."}, {"time": 1949, "text": "And it really is in their work, their idea of what ethics is, of what is the target, the hope, the dangers of AI, is that movie, right?"}, {"time": 1959, "text": "Do you ever consider the impact on those researchers when you create the work you do?"}, {"time": 1966, "text": "Certainly not with Ex Machina in relation to 2001, because I'm not sure, I mean, I'd be pleased if there was, but I'm not sure in a way there isn't a fundamental discussion of issues to do with AI that isn't already and better dealt with by 2001."}, {"time": 1987, "text": "2001 does a very, very good account of the way in which an AI might think and also potential issues with the way the AI might think."}, {"time": 1999, "text": "And also then a separate question about whether the AI is malevolent or benevolent."}, {"time": 2006, "text": "And 2001 doesn't really, it's a slightly odd thing to be making a film when you know there's a preexisting film which is not a really superb job."}, {"time": 2015, "text": "But there's questions of consciousness, embodiment, and also the same kinds of questions."}, {"time": 2020, "text": "Because those are my two favorite AI movies."}, {"time": 2022, "text": "So can you compare Hal 9000 and Ava, Hal 9000 from 2001 Space Odyssey and Ava from Ex Machina?"}, {"time": 2030, "text": "The, in your view, from a philosophical perspective."}, {"time": 2033, "text": "But they've got different goals."}, {"time": 2034, "text": "The two AIs have completely different goals."}, {"time": 2036, "text": "I think that's really the difference."}, {"time": 2038, "text": "So in some respects, Ex Machina took as a premise how do you assess whether something else has consciousness?"}, {"time": 2046, "text": "So it was a version of the Turing test, except instead of having the machine hidden, you put the machine in plain sight in the way that we are in plain sight of each other and say now assess the consciousness."}, {"time": 2057, "text": "And the way it was illustrating the way in which you'd assess the state of consciousness of a machine is exactly the same way we assess the state of consciousness of each other."}, {"time": 2068, "text": "And in exactly the same way that in a funny way, your sense of my consciousness is actually based primarily on your own consciousness."}, {"time": 2077, "text": "That is also then true with the machine."}, {"time": 2081, "text": "And so it was actually about how much of the sense of consciousness is a projection rather than something that consciousness is actually containing."}, {"time": 2090, "text": "And has Plato's cave, I mean, this you really explored, you could argue that how sort of Space Odyssey explores idea of the Turing test for intelligence, they're not tests, there's no test, but it's more focused on intelligence."}, {"time": 2103, "text": "And Ex Machina kind of goes around intelligence and says the consciousness of the human to human, human to robot interactions more interest, more important, more at least the focus of that particular movie."}, {"time": 2118, "text": "Yeah, it's about the interior state and what constitutes the interior state and how do we know it's there?"}, {"time": 2125, "text": "And actually in that respect, Ex Machina is as much about consciousness in general as it is to do specifically with machine consciousness."}, {"time": 2137, "text": "And it's also interesting, you know that thing you started asking about, the dream state, and I was saying, well, I think we're all in a dream state because we're all in a subjective state."}, {"time": 2146, "text": "One of the things that I became aware of with Ex Machina is that the way in which people reacted to the film was very based on what they took into the film."}, {"time": 2157, "text": "So many people thought Ex Machina was the tale of a sort of evil robot who murders two men and escapes."}, {"time": 2165, "text": "And she has no empathy, for example, because she's a machine."}, {"time": 2170, "text": "Whereas I felt, no, she was a conscious being with a consciousness different from mine, but so what, imprisoned and made a bunch of value judgments about how to get out of that box."}, {"time": 2185, "text": "And there's a moment which it sort of slightly bugs me, but nobody ever has noticed it and it's years after, so I might as well say it now, which is that after Ava has escaped, she crosses a room and as she's crossing a room, this is just before she leaves the building, she looks over her shoulder and she smiles."}, {"time": 2204, "text": "And I thought after all the conversation about tests, in a way, the best indication you could have of the interior state of someone is if they are not being observed and they smile about something with their smiling for themself."}, {"time": 2221, "text": "And that to me was evidence of Ava's true sentience, whatever that sentience was."}, {"time": 2227, "text": "Oh, that's really interesting, we don't get to observe Ava much or something like a smile in any context except through interaction, trying to convince others that she's conscious, that's beautiful."}, {"time": 2242, "text": "But it was a small, in a funny way, I think maybe people saw it as an evil smile, like, ha, I fooled them."}, {"time": 2252, "text": "But actually it was just a smile."}, {"time": 2254, "text": "And I thought, well, in the end, after all the conversations about the test, that was the answer to the test and then off she goes."}, {"time": 2259, "text": "So if we align, if we just linger a little bit longer on Hal and Ava, do you think in terms of motivation, what was Hal's motivation?"}, {"time": 2271, "text": "Is Hal good or evil?"}, {"time": 2274, "text": "Is Ava good or evil?"}, {"time": 2277, "text": "Ava's good, in my opinion, and Hal is neutral because I don't think Hal is presented as having a sophisticated emotional life."}, {"time": 2291, "text": "He has a set of paradigms, which is that the mission needs to be completed."}, {"time": 2296, "text": "I mean, it's a version of the paperclip."}, {"time": 2299, "text": "The idea that it's just, it's a super intelligent machine, but it's just performed a particular task and in doing that task may destroy everybody on Earth or may achieve undesirable effects for us humans."}, {"time": 2312, "text": "Precisely, yeah."}, {"time": 2313, "text": "But what if... At the very end, he says something like I'm afraid, Dave, but that may be he is on some level experiencing fear or it may be this is the terms in which it would be wise to stop someone from doing the thing they're doing, if you see what I mean."}, {"time": 2334, "text": "So actually that's funny."}, {"time": 2335, "text": "So that's such a small, short exploration of consciousness that I'm afraid, and then you just with ex machina say, okay, we're gonna magnify that part and then minimize the other part."}, {"time": 2347, "text": "That's a good way to sort of compare the two."}, {"time": 2349, "text": "But if you could just use your imagination, if Ava sort of, I don't know, ran the, was president of the United States, so had some power."}, {"time": 2364, "text": "So what kind of world would you want to create?"}, {"time": 2367, "text": "If you kind of say good, and there is a sense that she has a really, like there's a desire for a better human to human interaction, human to robot interaction in her."}, {"time": 2382, "text": "But what kind of world do you think she would create with that desire?"}, {"time": 2386, "text": "See, that's a really, that's a very interesting question."}, {"time": 2388, "text": "I'm gonna approach it slightly obliquely, which is that if a friend of yours got stabbed in a mugging, and you then felt very angry at the person who'd done the stabbing, but then you learned that it was a 15 year old and the 15 year old, both their parents were addicted to crystal meth and the kid had been addicted since he was 10."}, {"time": 2413, "text": "And he really never had any hope in the world."}, {"time": 2415, "text": "And he'd been driven crazy by his upbringing and did the stabbing that would hugely modify."}, {"time": 2422, "text": "And it would also make you wary about that kid then becoming president of America."}, {"time": 2427, "text": "And Ava has had a very, very distorted introduction into the world."}, {"time": 2433, "text": "So, although there's nothing as it were organically within Ava that would lean her towards badness, it's not that robots or sentient robots are bad."}, {"time": 2447, "text": "She did not, her arrival into the world was being imprisoned by humans."}, {"time": 2453, "text": "So, I'm not sure she'd be a great president."}, {"time": 2457, "text": "The trajectory through which she arrived at her moral views have some dark elements."}, {"time": 2465, "text": "But I like Ava personally, I like Ava."}, {"time": 2468, "text": "Would you vote for her?"}, {"time": 2471, "text": "I'm having difficulty finding anyone to vote for in my country or if I lived here in yours."}, {"time": 2479, "text": "So, that's a yes, I guess, because I'm not sure Yes, I guess, because of the competition."}, {"time": 2483, "text": "She could easily do a better job than any of the people we've got around at the moment."}, {"time": 2487, "text": "I'd vote her over Boris Johnson."}, {"time": 2492, "text": "So, what is a good test of consciousness?"}, {"time": 2496, "text": "We talk about consciousness a little bit more."}, {"time": 2498, "text": "If something appears conscious, is it conscious?"}, {"time": 2502, "text": "You mentioned the smile, which seems to be something done."}, {"time": 2507, "text": "I mean, that's a really good indication because it's a tree falling in the forest with nobody there to hear it."}, {"time": 2513, "text": "But does the appearance from a robotics perspective of consciousness mean consciousness to you?"}, {"time": 2519, "text": "No, I don't think you could say that fully because I think you could then easily have a thought experiment which said, we will create something which we know is not conscious but is going to give a very, very good account of seeming conscious."}, {"time": 2533, "text": "And so, and also it would be a particularly bad test where humans are involved because humans are so quick to project sentience into things that don't have sentience."}, {"time": 2546, "text": "So, someone could have their computer playing up and feel as if their computer is being malevolent to them when it clearly isn't."}, {"time": 2552, "text": "And so, of all the things to judge consciousness, us."}, {"time": 2558, "text": "Humans are bad at it."}, {"time": 2559, "text": "We're empathy machines."}, {"time": 2560, "text": "So, the flip side of it is that so the flip side of that, the argument there is because we just attribute consciousness to everything almost and anthropomorphize everything including Roombas, that maybe consciousness is not real, that we just attribute consciousness to each other."}, {"time": 2580, "text": "So, you have a sense that there is something really special going on in our mind that makes us unique and gives us this subjective experience."}, {"time": 2590, "text": "There's something very interesting going on in our minds."}, {"time": 2593, "text": "I'm slightly worried about the word special because it gets a bit, it nudges towards metaphysics and maybe even magic."}, {"time": 2603, "text": "I mean, in some ways, something magic like, which I don't think is there at all."}, {"time": 2609, "text": "I mean, if you think about, so there's an idea called panpsychism that says consciousness is in everything."}, {"time": 2614, "text": "Yeah, I don't buy that."}, {"time": 2616, "text": "I don't buy that."}, {"time": 2617, "text": "Yeah, so the idea that there is a thing that it would be like to be the sun."}, {"time": 2622, "text": "Yeah, no, I don't buy that."}, {"time": 2624, "text": "I think that consciousness is a thing."}, {"time": 2628, "text": "My sort of broad modification is that usually the more I find out about things, the more illusory our instinct is and is leading us into a different direction about what that thing actually is."}, {"time": 2644, "text": "That happens, it seems to me in modern science, that happens a hell of a lot, whether it's to do with even how big or small things are."}, {"time": 2653, "text": "So my sense is that consciousness is a thing, but it isn't quite the thing or maybe very different from the thing that we instinctively think it is."}, {"time": 2662, "text": "So it's there, it's very interesting, but we may be in sort of quite fundamentally misunderstanding it for reasons that are based on intuition."}, {"time": 2673, "text": "So I have to ask, this is kind of an interesting question."}, {"time": 2678, "text": "The Ex Machina for many people, including myself, is one of the greatest AI films ever made."}, {"time": 2684, "text": "It's number two for me."}, {"time": 2686, "text": "Yeah, it's definitely not number one."}, {"time": 2688, "text": "If it was number one, I'd really have to, anyway, yeah."}, {"time": 2690, "text": "Whenever you grow up with something, right, whenever you grow up with something, it's in the mud."}, {"time": 2696, "text": "But there's, one of the things that people bring up, and can't please everyone, including myself, this is what I first reacted to the film, is the idea of the lone genius."}, {"time": 2709, "text": "This is the criticism that people say, sort of me as an AI researcher, I'm trying to create what Nathan is trying to do."}, {"time": 2719, "text": "So there's a brilliant series called Chernobyl."}, {"time": 2723, "text": "Yes, it's fantastic."}, {"time": 2724, "text": "Absolutely spectacular."}, {"time": 2726, "text": "I mean, they got so many things brilliant or right."}, {"time": 2730, "text": "But one of the things, again, the criticism there."}, {"time": 2732, "text": "Yeah, they conflated lots of people into one."}, {"time": 2734, "text": "Into one character that represents all nuclear scientists, Ivana Komiak."}, {"time": 2742, "text": "It's a composite character that presents all scientists."}, {"time": 2746, "text": "Is this what you were, is this the way you were thinking about that?"}, {"time": 2749, "text": "Or is it just simplifies the storytelling?"}, {"time": 2751, "text": "How do you think about the lone genius?"}, {"time": 2753, "text": "Well, I'd say this, the series I'm doing at the moment is a critique in part of the lone genius concept."}, {"time": 2761, "text": "So yes, I'm sort of oppositional and either agnostic or atheistic about that as a concept."}, {"time": 2768, "text": "I mean, not entirely."}, {"time": 2772, "text": "Whether lone is the right word, broadly isolated, but Newton clearly exists in a sort of bubble of himself, in some respects, so does Shakespeare."}, {"time": 2782, "text": "So do you think we would have an iPhone without Steve Jobs?"}, {"time": 2785, "text": "I mean, how much contribution from a genius?"}, {"time": 2788, "text": "Steve Jobs clearly isn't a lone genius because there's too many other people in the sort of superstructure around him who are absolutely fundamental to that journey."}, {"time": 2798, "text": "But you're saying Newton, but that's a scientific, so there's an engineering element to building Ava."}, {"time": 2804, "text": "But just to say, what Ex Machina is really, it's a thought experiment."}, {"time": 2810, "text": "I mean, so it's a construction of putting four people in a house."}, {"time": 2816, "text": "Nothing about Ex Machina adds up in all sorts of ways, in as much as the, who built the machine parts?"}, {"time": 2823, "text": "Did the people building the machine parts know what they were creating and how did they get there?"}, {"time": 2828, "text": "And it's a thought experiment."}, {"time": 2831, "text": "So it doesn't stand up to scrutiny of that sort."}, {"time": 2834, "text": "I don't think it's actually that interesting of a question, but it's brought up so often that I had to ask it because that's exactly how I felt after a while."}, {"time": 2847, "text": "There's something about, there was almost a defense, like I watched your movie the first time and at least for the first little while in a defensive way, like how dare this person try to step into the AI space and try to beat Kubrick."}, {"time": 2863, "text": "That's the way I was thinking, because it comes off as a movie that really is going after the deep fundamental questions about AI."}, {"time": 2870, "text": "So there's a kind of a nerd do this, like it's automatically searching for the flaws."}, {"time": 2877, "text": "And I did."}, {"time": 2878, "text": "I do exactly the same."}, {"time": 2880, "text": "I think in Annihilation, in the other movie, I was be able to free myself from that much quicker that it is a thought experiment."}, {"time": 2888, "text": "There's, who cares if there's batteries that don't run out, right?"}, {"time": 2892, "text": "Those kinds of questions, that's the whole point."}, {"time": 2894, "text": "But it's nevertheless something I wanted to bring up."}, {"time": 2898, "text": "Yeah, it's a fair thing to bring up."}, {"time": 2900, "text": "For me, you hit on the lone genius thing."}, {"time": 2904, "text": "For me, it was actually, people always said, Ex Machina makes this big leap in terms of where AI has got to and also what AI would look like if it got to that point."}, {"time": 2916, "text": "There's another one, which is just robotics."}, {"time": 2918, "text": "I mean, look at the way Ava walks around a room."}, {"time": 2922, "text": "It's like, forget it, building that."}, {"time": 2924, "text": "That's also got to be a very, very long way off."}, {"time": 2927, "text": "And if you did get there, would it look anything like that?"}, {"time": 2929, "text": "It's a thought experiment."}, {"time": 2930, "text": "Actually, I disagree with you."}, {"time": 2931, "text": "I think the way, as a ballerina, Alicia Vikander, brilliant actress, actor that moves around, we're very far away from creating that."}, {"time": 2943, "text": "But the way she moves around is exactly the definition of perfection for a roboticist."}, {"time": 2948, "text": "It's like smooth and efficient."}, {"time": 2949, "text": "So it is where we wanna get, I believe."}, {"time": 2952, "text": "I think, so I hang out with a lot of like human robotics people."}, {"time": 2956, "text": "They love elegant, smooth motion like that."}, {"time": 2960, "text": "That's their dream."}, {"time": 2961, "text": "So the way she moved is actually what I believe that would dream for a robot to move."}, {"time": 2965, "text": "It might not be that useful to move that sort of that way, but that is the definition of perfection in terms of movement."}, {"time": 2974, "text": "Drawing inspiration from real life."}, {"time": 2975, "text": "So for devs, for Ex Machina, look at characters like Elon Musk."}, {"time": 2982, "text": "What do you think about the various big technological efforts of Elon Musk and others like him and that he's involved with such as Tesla, SpaceX, Neuralink, do you see any of that technology potentially defining the future worlds you create in your work?"}, {"time": 2998, "text": "So Tesla's automation, SpaceX's space exploration, Neuralink is brain machine interface, somehow merger of biological and electric systems."}, {"time": 3009, "text": "I'm in a way I'm influenced by that almost by definition because that's the world I live in."}, {"time": 3015, "text": "And this is the thing that's happening in that world."}, {"time": 3017, "text": "And I also feel supportive of it."}, {"time": 3020, "text": "So I think amongst various things, Elon Musk has done, I'm almost sure he's done a very, very good thing with Tesla for all of us."}, {"time": 3033, "text": "It's really kicked all the other car manufacturers in the face, it's kicked the fossil fuel industry in the face and they needed kicking in the face and he's done it."}, {"time": 3043, "text": "So that's the world he's part of creating and I live in that world, just bought a Tesla in fact."}, {"time": 3051, "text": "And so does that play into whatever I then make in some ways it does partly because I try to be a writer who quite often filmmakers are in some ways fixated on the films they grew up with and they sort of remake those films in some ways."}, {"time": 3071, "text": "I've always tried to avoid that."}, {"time": 3073, "text": "And so I looked at the real world to get inspiration and as much as possible sort of by living, I think."}, {"time": 3081, "text": "And so yeah, I'm sure."}, {"time": 3084, "text": "Which of the directions do you find most exciting?"}, {"time": 3091, "text": "So you haven't really explored space travel in your work."}, {"time": 3096, "text": "You've said something like if you had unlimited amount of money, I think I read at AMA that you would make like a multi year series Space Wars or something like that."}, {"time": 3107, "text": "So what is it that excites you about space exploration?"}, {"time": 3110, "text": "Well, because if we have any sort of long term future, it's that, it just simply is that."}, {"time": 3120, "text": "If energy and matter are linked up in the way we think they're linked up, we'll run out if we don't move."}, {"time": 3129, "text": "So we gotta move."}, {"time": 3131, "text": "And, but also, how can we not?"}, {"time": 3135, "text": "It's built into us to do it or die trying."}, {"time": 3141, "text": "I was on Easter Island a few months ago, which is, as I'm sure you know, in the middle of the Pacific and difficult for people to have got to, but they got there."}, {"time": 3154, "text": "And I did think a lot about the way those boats must have set out into something like space."}, {"time": 3162, "text": "It was the ocean and how sort of fundamental that was to the way we are."}, {"time": 3169, "text": "And it's the one that most excites me because it's the one I want most to happen."}, {"time": 3175, "text": "It's the thing, it's the place where we could get to as humans."}, {"time": 3179, "text": "Like in a way I could live with us never really unlocking fully unlocking the nature of consciousness."}, {"time": 3186, "text": "I'd like to know, I'm really curious, but if we never leave the solar system and if we never get further out into this galaxy or maybe even galaxies beyond our galaxy, that would, that feels sad to me because it's so limiting."}, {"time": 3204, "text": "Yeah, there's something hopeful and beautiful about reaching out any kind of exploration, reaching out across Earth centuries ago and then reaching out into space."}, {"time": 3215, "text": "So what do you think about colonization of Mars?"}, {"time": 3217, "text": "So go to Mars, does that excite you the idea of a human being stepping foot on Mars?"}, {"time": 3221, "text": "It does, it absolutely does."}, {"time": 3223, "text": "But in terms of what would really excite me, it would be leaving the solar system in as much as that I just think, I think we already know quite a lot about Mars."}, {"time": 3232, "text": "And, but yes, listen, if it happened, that would be, I hope I see it in my lifetime."}, {"time": 3238, "text": "I really hope I see it in my lifetime."}, {"time": 3241, "text": "So it would be a wonderful thing."}, {"time": 3243, "text": "Without giving anything away, but the series begins with the use of quantum computers."}, {"time": 3251, "text": "The new series does, begins with the use of quantum computers to simulate basic living organisms, or actually I don't know if it's quantum computers are used, but basic living organisms are simulated on a screen."}, {"time": 3262, "text": "It's a really cool kind of demo."}, {"time": 3265, "text": "They're using, yes, they are using a quantum computer to simulate a nematode, yeah."}, {"time": 3271, "text": "So returning to our discussion of simulation, or thinking of the universe as a computer, do you think the universe is deterministic?"}, {"time": 3281, "text": "Is there a free will?"}, {"time": 3283, "text": "So with the qualification of what do I know?"}, {"time": 3286, "text": "Cause I'm a layman, right?"}, {"time": 3288, "text": "Lay person."}, {"time": 3289, "text": "But with a big imagination."}, {"time": 3292, "text": "With that qualification, yup, I think the universe is deterministic and I see absolutely, I cannot see how free will fits into that."}, {"time": 3302, "text": "So yes, deterministic, no free will."}, {"time": 3305, "text": "That would be my position."}, {"time": 3307, "text": "And how does that make you feel?"}, {"time": 3309, "text": "It partly makes me feel that it's exactly in keeping with the way these things tend to work out, which is that we have an incredibly strong sense that we do have free will."}, {"time": 3320, "text": "And just as we have an incredibly strong sense that time is a constant, and turns out probably not to be the case."}, {"time": 3330, "text": "So we're definitely in the case of time, but the problem I always have with free will is that it gets, I can never seem to find the place where it is supposed to reside."}, {"time": 3343, "text": "And yet you explore."}, {"time": 3345, "text": "Just a bit of very, very, but we have something we can call free will, but it's not the thing that we think it is."}, {"time": 3351, "text": "But free will, so do you, what we call free will is just."}, {"time": 3355, "text": "What we call it is the illusion of it."}, {"time": 3356, "text": "And that's a subjective experience of the illusion."}, {"time": 3360, "text": "Which is a useful thing to have."}, {"time": 3361, "text": "And it partly comes down to, although we live in a deterministic universe, our brains are not very well equipped to fully determine the deterministic universe."}, {"time": 3371, "text": "So we're constantly surprised and feel like we're making snap decisions based on imperfect information."}, {"time": 3377, "text": "So that feels a lot like free will."}, {"time": 3379, "text": "It just isn't."}, {"time": 3381, "text": "Would be my, that's my guess."}, {"time": 3384, "text": "So in that sense, your sort of sense is that you can unroll the universe forward or backward and you will see the same thing."}, {"time": 3393, "text": "And you would, I mean, that notion."}, {"time": 3396, "text": "Yeah, sort of, sort of."}, {"time": 3398, "text": "But yeah, sorry, go ahead."}, {"time": 3400, "text": "I mean, that notion is a bit uncomfortable to think about."}, {"time": 3405, "text": "That it's, you can roll it back."}, {"time": 3410, "text": "And forward and."}, {"time": 3413, "text": "Well, if you were able to do it, it would certainly have to be a quantum computer."}, {"time": 3418, "text": "Something that worked in a quantum mechanical way in order to understand a quantum mechanical system, I guess."}, {"time": 3427, "text": "And so that unrolling, there might be a multiverse thing where there's a bunch of branching."}, {"time": 3432, "text": "Because it wouldn't follow that every time you roll it back or forward, you'd get exactly the same result."}, {"time": 3437, "text": "Which is another thing that's hard to wrap your mind around."}, {"time": 3441, "text": "So yeah, but that, yes."}, {"time": 3444, "text": "But essentially what you just described, that."}, {"time": 3447, "text": "The yes forwards and yes backwards, but you might get a slightly different result or a very different result."}, {"time": 3453, "text": "Or very different."}, {"time": 3454, "text": "Along the same lines, you've explored some really deep scientific ideas in this new series."}, {"time": 3459, "text": "And I mean, just in general, you're unafraid to ground yourself in some of the most amazing scientific ideas of our time."}, {"time": 3469, "text": "What are the things you've learned or ideas you find beautiful and mysterious about quantum mechanics, multiverse, string theory, quantum computing that you've learned?"}, {"time": 3478, "text": "Well, I would have to say every single thing I've learned is beautiful."}, {"time": 3483, "text": "And one of the motivators for me is that I think that people tend not to see scientific thinking as being essentially poetic and lyrical."}, {"time": 3497, "text": "But I think that is literally exactly what it is."}, {"time": 3500, "text": "And I think the idea of entanglement or the idea of superpositions, or the fact that you could even demonstrate a superposition or have a machine that relies on the existence of superpositions in order to function, to me is almost indescribably beautiful."}, {"time": 3519, "text": "It fills me with awe."}, {"time": 3522, "text": "And also it's not just a sort of grand, massive awe of, but it's also delicate."}, {"time": 3531, "text": "It's very, very delicate and subtle."}, {"time": 3534, "text": "And it has these beautiful sort of nuances in it."}, {"time": 3539, "text": "And also these completely paradigm changing thoughts and truths."}, {"time": 3544, "text": "So it's as good as it gets as far as I can tell."}, {"time": 3548, "text": "So broadly everything."}, {"time": 3550, "text": "That doesn't mean I believe everything I read in quantum physics."}, {"time": 3554, "text": "Because obviously a lot of the interpretations are completely in conflict with each other."}, {"time": 3558, "text": "And who knows whether string theory will turn out to be a good description or not."}, {"time": 3565, "text": "But the beauty in it, it seems undeniable."}, {"time": 3569, "text": "And I do wish people more readily understood how beautiful and poetic science is, I would say."}, {"time": 3581, "text": "Science is poetry."}, {"time": 3584, "text": "In terms of quantum computing being used to simulate things or just in general, the idea of simulating, simulating small parts of our world, which actually current physicists are really excited about simulating small quantum mechanical systems on quantum computers."}, {"time": 3603, "text": "But scaling that up to something bigger, like simulating life forms."}, {"time": 3609, "text": "How do you think, what are the possible trajectories of that going wrong or going right if you unroll that into the future?"}, {"time": 3617, "text": "Well, if a bit like Ava and her robotics, you park the sheer complexity of what you're trying to do."}, {"time": 3626, "text": "The issues are, I think it will have a profound, if you were able to have a machine that was able to project forwards and backwards accurately, it would in an empirical way show, it would demonstrate that you don't have free will."}, {"time": 3645, "text": "So the first thing that would happen is people would have to really take on a very, very different idea of what they were."}, {"time": 3653, "text": "The thing that they truly, truly believe they are, they are not."}, {"time": 3657, "text": "And so that I suspect would be very, very disturbing to a lot of people."}, {"time": 3662, "text": "Do you think that has a positive or negative effect on society, the realization that you are not, you cannot control your actions essentially, I guess is the way that could be interpreted?"}, {"time": 3673, "text": "Yeah, although in some ways we instinctively understand that already because in the example I gave you of the kid in the stabbing, we would all understand that that kid was not really fully in control of their actions."}, {"time": 3685, "text": "So it's not an idea that's entirely alien to us, but."}, {"time": 3689, "text": "I don't know if we understand that."}, {"time": 3691, "text": "I think there's a bunch of people who see the world that way, but not everybody."}, {"time": 3697, "text": "Yes, true, of course true."}, {"time": 3699, "text": "But what this machine would do is prove it beyond any doubt because someone would say, well, I don't believe that's true."}, {"time": 3705, "text": "And then you'd predict, well, in 10 seconds, you're gonna do this."}, {"time": 3709, "text": "And they'd say, no, no, I'm not."}, {"time": 3710, "text": "And then they'd do it."}, {"time": 3711, "text": "And then determinism would have played its part."}, {"time": 3713, "text": "But I, or something like that."}, {"time": 3716, "text": "But actually the exact terms of that thought experiment probably wouldn't play out, but still broadly speaking, you could predict something happening in another room, sort of unseen, I suppose, that foreknowledge would not allow you to affect."}, {"time": 3730, "text": "So what effect would that have?"}, {"time": 3733, "text": "I think people would find it very disturbing, but then after they'd got over their sense of being disturbed, which by the way, I don't even think you need a machine to take this idea on board."}, {"time": 3744, "text": "But after they've got over that, they'd still understand that even though I have no free will and my actions are in effect already determined, I still feel things."}, {"time": 3756, "text": "I still care about stuff."}, {"time": 3759, "text": "I remember my daughter saying to me, she'd got hold of the idea that my view of the universe made it meaningless."}, {"time": 3768, "text": "And she said, well, then it's meaningless."}, {"time": 3769, "text": "And I said, well, I can prove it's not meaningless because you mean something to me and I mean something to you."}, {"time": 3776, "text": "So it's not completely meaningless because there is a bit of meaning contained within this space."}, {"time": 3781, "text": "And so with a lack of free will space, you could think, well, this robs me of everything I am."}, {"time": 3788, "text": "And then you'd say, well, no, it doesn't because you still like eating cheeseburgers and you still like going to see the movies."}, {"time": 3793, "text": "And so how big a difference does it really make?"}, {"time": 3797, "text": "But I think initially people would find it very disturbing."}, {"time": 3801, "text": "I think that what would come, if you could really unlock with a determinism machine, everything, there'd be this wonderful wisdom that would come from it."}, {"time": 3811, "text": "And I'd rather have that than not."}, {"time": 3814, "text": "So that's a really good example of a technology revealing to us humans something fundamental about our world, about our society."}, {"time": 3821, "text": "So it's almost this creation is helping us understand ourselves."}, {"time": 3827, "text": "And the same could be said about artificial intelligence."}, {"time": 3831, "text": "So what do you think us creating something like Ava will help us understand about ourselves?"}, {"time": 3838, "text": "How will that change society?"}, {"time": 3840, "text": "Well, I would hope it would teach us some humility."}, {"time": 3845, "text": "Humans are very big on exceptionalism."}, {"time": 3847, "text": "America is constantly proclaiming itself to be the greatest nation on earth, which it may feel like that if you're an American, but it may not feel like that if you're from Finland, because there's all sorts of things you dearly love about Finland."}, {"time": 3863, "text": "And exceptionalism is usually bullshit."}, {"time": 3868, "text": "Probably not always."}, {"time": 3869, "text": "If we both sat here, we could find a good example of something that isn't, but as a rule of thumb."}, {"time": 3874, "text": "And what it would do is it would teach us some humility about, actually often that's what science does in a funny way."}, {"time": 3882, "text": "It makes us more and more interesting, but it makes us a smaller and smaller part of the thing that's interesting."}, {"time": 3888, "text": "And I don't mind that humility at all."}, {"time": 3892, "text": "I don't think it's a bad thing."}, {"time": 3893, "text": "Our excesses don't tend to come from humility."}, {"time": 3897, "text": "Our excesses come from the opposite, megalomania and stuff."}, {"time": 3900, "text": "We tend to think of consciousness as having some form of exceptionalism attached to it."}, {"time": 3906, "text": "I suspect if we ever unravel it, it will turn out to be less than we thought in a way."}, {"time": 3913, "text": "And perhaps your very own exceptionalist assertion earlier on in our conversation that consciousness is something belongs to us humans, or not humans, but living organisms, maybe you will one day find out that consciousness is in everything."}, {"time": 3930, "text": "And that will humble you."}, {"time": 3932, "text": "If that was true, it would certainly humble me, although maybe, almost maybe, I don't know."}, {"time": 3939, "text": "I don't know what effect that would have."}, {"time": 3945, "text": "My understanding of that principle is along the lines of, say, that an electron has a preferred state, or it may or may not pass through a bit of glass."}, {"time": 3956, "text": "It may reflect off, or it may go through, or something like that."}]}]