[{"title": "Grant Sanderson: 3Blue1Brown and the Beauty of Mathematics | Lex Fridman Podcast #64", "id": "U_lKUK2MCsg", "quotes": [{"time": 278, "text": "You can think about it in terms of the problem it solves, a certain very simple differential equation, which often yields way more insight than trying to twist the idea of repeated multiplication, like take its arm and put it behind its back and throw it on the desk and be like, you will apply to complex numbers, right?"}, {"time": 293, "text": "That's not, I don't think that's pedagogically helpful."}, {"time": 297, "text": "So the repeated multiplication is actually missing the main point, the power of e to the x. I mean, what it addresses is things where the rate at which something changes depends on its own value, but more specifically, it depends on it linearly."}, {"time": 312, "text": "So for example, if you have like a population that's growing and the rate at which it grows depends on how many members of the population are already there, it looks like this nice exponential curve."}, {"time": 321, "text": "It makes sense to talk about repeated multiplication because you say, how much is there after one year, two years, three years, you're multiplying by something."}, {"time": 327, "text": "The relationship can be a little bit different sometimes where let's say you've got a ball on a string, like a game of tetherball going around a rope, right?"}, {"time": 337, "text": "And you say, its velocity is always perpendicular to its position."}, {"time": 342, "text": "That's another way of describing its rate of change is being related to where it is, but it's a different operation."}, {"time": 348, "text": "You're not scaling it, it's a rotation."}, {"time": 349, "text": "It's this 90 degree rotation."}, {"time": 351, "text": "That's what the whole idea of like complex exponentiation is trying to capture, but it's obfuscated in the notation when what it's actually saying, like if you really parse something like e to the pi i, what it's saying is choose an origin, always move perpendicular to the vector from that origin to you, okay?"}, {"time": 369, "text": "Then when you walk pi times that radius, you'll be halfway around."}, {"time": 374, "text": "Like that's what it's saying."}, {"time": 375, "text": "It's kind of the, you turn 90 degrees and you walk, you'll be going in a circle."}, {"time": 379, "text": "That's the phenomenon that it's describing, but trying to twist the idea of repeatedly multiplying a constant into that."}, {"time": 409, "text": "And you're talking about the most beautiful equation in mathematics, but it's still pretty mysterious, isn't it?"}, {"time": 415, "text": "Like you're making it seem like it's a notational."}, {"time": 418, "text": "It's not mysterious."}, {"time": 419, "text": "I think the notation makes it mysterious."}, {"time": 421, "text": "I don't think it's, I think the fact that it represents, it's pretty, it's not like the most beautiful thing in the world, but it's quite pretty."}, {"time": 427, "text": "The idea that if you take the linear operation of a 90 degree rotation, and then you do this general exponentiation thing to it, that what you get are all the other kinds of rotation, which is basically to say, if your velocity vector is perpendicular to your position vector, you walk in a circle, that's pretty."}, {"time": 446, "text": "It's not the most beautiful thing in the world, but it's quite pretty."}, {"time": 448, "text": "The beauty of it, I think comes from perhaps the awkwardness of the notation somehow still nevertheless coming together nicely, because you have like several disciplines coming together in a single equation."}, {"time": 461, "text": "In a sense, like historically speaking."}, {"time": 464, "text": "You've got, so like the number E is significant."}, {"time": 465, "text": "Like it shows up in probability all the time."}, {"time": 467, "text": "It like shows up in calculus all the time."}, {"time": 469, "text": "It is significant."}, {"time": 470, "text": "You're seeing it sort of mated with pi, this geometric constant and I, like the imaginary number and such."}, {"time": 475, "text": "I think what's really happening there is the way that E shows up is when you have things like exponential growth and decay, right?"}, {"time": 483, "text": "It's when this relation that something's rate of change has to itself is a simple scaling, right?"}, {"time": 490, "text": "A similar law also describes circular motion."}, {"time": 494, "text": "Because we have bad notation, we use the residue of how it shows up in the context of self reinforcing growth, like a population growing or compound interest."}, {"time": 503, "text": "The constant associated with that is awkwardly placed into the context of how rotation comes about, because they both come from pretty similar equations."}, {"time": 512, "text": "And so what we see is the E and the pi juxtaposed a little bit closer than they would be with a purely natural representation, I would think."}, {"time": 521, "text": "Here's how I would describe the relation between the two."}, {"time": 523, "text": "You've got a very important function we might call exp."}, {"time": 525, "text": "That's like the exponential function."}, {"time": 527, "text": "When you plug in one, you get this nice constant called E that shows up in like probability and calculus."}, {"time": 533, "text": "If you try to move in the imaginary direction, it's periodic and the period is tau."}, {"time": 538, "text": "So those are these two constants associated with the same central function, but for kind of unrelated reasons, right?"}, {"time": 544, "text": "And not unrelated, but like orthogonal reasons."}, {"time": 547, "text": "One of them is what happens when you're moving in the real direction."}, {"time": 549, "text": "One's what happens when you move in the imaginary direction."}, {"time": 552, "text": "And like, yeah, those are related."}, {"time": 554, "text": "They're not as related as the famous equation seems to think it is."}, {"time": 558, "text": "It's sort of putting all of the children in one bed and they'd kind of like to sleep in separate beds if they had the choice, but you see them all there and there is a family resemblance, but it's not that close."}, {"time": 568, "text": "So actually thinking of it as a function is the better idea."}, {"time": 574, "text": "And that's a notational idea."}, {"time": 576, "text": "And yeah, and like, here's the thing."}, {"time": 579, "text": "The constant E sort of stands as this numerical representative of calculus, right?"}, {"time": 584, "text": "Calculus is the like study of change."}, {"time": 587, "text": "So at the very least there's a little cognitive dissonance using a constant to represent the science of change."}, {"time": 593, "text": "I never thought of it that way."}, {"time": 596, "text": "It makes sense why the notation came about that way."}, {"time": 600, "text": "Because this is the first way that we saw it in the context of things like population growth or compound interest."}, {"time": 604, "text": "It is nicer to think about as repeated multiplication."}, {"time": 607, "text": "That's definitely nicer."}, {"time": 608, "text": "But it's more that that's the first application of what turned out to be a much more general function that maybe the intelligent life your initial question asked about would have come to recognize as being much more significant than the single use case, which lends itself to repeated multiplication notation."}, {"time": 624, "text": "But let me jump back for a second to aliens and the nature of our universe."}, {"time": 631, "text": "Do you think math is discovered or invented?"}, {"time": 635, "text": "So we're talking about the different kind of mathematics that could be developed by the alien species."}, {"time": 640, "text": "The implied question is, yeah, is math discovered or invented?"}, {"time": 646, "text": "Is fundamentally everybody going to discover the same principles of mathematics?"}, {"time": 653, "text": "So the way I think about it, and everyone thinks about it differently, but here's my take."}, {"time": 656, "text": "I think there's a cycle at play where you discover things about the universe that tell you what math will be useful."}, {"time": 663, "text": "And that math itself is invented in a sense, but of all the possible maths that you could have invented, it's discoveries about the world that tell you which ones are."}, {"time": 674, "text": "So like a good example here is the Pythagorean theorem."}, {"time": 677, "text": "When you look at this, do you think of that as a definition or do you think of that as a discovery?"}, {"time": 681, "text": "From the historical perspective, right, it's a discovery because they were, but that's probably because they were using physical object to build their intuition."}, {"time": 692, "text": "And from that intuition came the mathematics."}, {"time": 725, "text": "No, no, no, no, higher dimensions can be highly, highly applicable."}, {"time": 728, "text": "I think this is a common misinterpretation that if you're asking questions about like a five dimensional manifold, that the only way that that's connected to the physical world is if the physical world is itself a five dimensional manifold or includes them."}, {"time": 742, "text": "Well, wait, wait, wait a minute, wait a minute."}, {"time": 745, "text": "You're telling me you can imagine a five dimensional manifold?"}, {"time": 751, "text": "No, no, that's not what I said."}, {"time": 753, "text": "I would make the claim that it is useful to a three dimensional physical universe, despite itself not being three dimensional."}, {"time": 759, "text": "So it's useful meaning to even understand a three dimensional world, it'd be useful to have five dimensional manifolds."}, {"time": 764, "text": "Yes, absolutely, because of state spaces."}, {"time": 767, "text": "But you're saying there in some deep way for us humans, it does always come back to that three dimensional world for the usefulness that the dimensional world and therefore it starts with a discovery, but then we invent the mathematics that helps us make sense of the discovery in a sense."}, {"time": 786, "text": "Yes, I mean, just to jump off of the Pythagorean theorem example, it feels like a discovery."}, {"time": 791, "text": "You've got these beautiful geometric proofs where you've got squares and you're modifying the areas, it feels like a discovery."}, {"time": 796, "text": "If you look at how we formalize the idea of 2D space as being R2, right, all pairs of real numbers, and how we define a metric on it and define distance, you're like, hang on a second, we've defined a distance so that the Pythagorean theorem is true, so that suddenly it doesn't feel that great."}, {"time": 812, "text": "But I think what's going on is the thing that informed us what metric to put on R2, to put on our abstract representation of 2D space, came from physical observations."}, {"time": 823, "text": "And the thing is, there's other metrics you could have put on it."}, {"time": 825, "text": "We could have consistent math with other notions of distance, it's just that those pieces of math wouldn't be applicable to the physical world that we study because they're not the ones where the Pythagorean theorem holds."}, {"time": 836, "text": "So we have a discovery, a genuine bonafide discovery that informed the invention, the invention of an abstract representation of 2D space that we call R2 and things like that."}, {"time": 846, "text": "And then from there, you just study R2 as an abstract thing that brings about more ideas and inventions and mysteries which themselves might yield discoveries."}, {"time": 854, "text": "Those discoveries might give you insight as to what else would be useful to invent and it kind of feeds on itself that way."}, {"time": 860, "text": "That's how I think about it."}, {"time": 862, "text": "So it's not an either or."}, {"time": 864, "text": "It's not that math is one of these or it's one of the others."}, {"time": 866, "text": "At different times, it's playing a different role."}, {"time": 869, "text": "So then let me ask the Richard Feynman question then, along that thread, is what do you think is the difference between physics and math?"}, {"time": 880, "text": "There's a giant overlap."}, {"time": 883, "text": "There's a kind of intuition that physicists have about the world that's perhaps outside of mathematics."}, {"time": 889, "text": "It's this mysterious art that they seem to possess, we humans generally possess."}, {"time": 894, "text": "And then there's the beautiful rigor of mathematics that allows you to, I mean, just like as we were saying, invent frameworks of understanding our physical world."}, {"time": 907, "text": "So what do you think is the difference there and how big is it?"}, {"time": 911, "text": "Well, I think of math as being the study of abstractions over patterns and pure patterns in logic."}, {"time": 916, "text": "And then physics is obviously grounded in a desire to understand the world that we live in."}, {"time": 922, "text": "I think you're gonna get very different answers when you talk to different mathematicians because there's a wide diversity in types of mathematicians."}, {"time": 927, "text": "There are some who are motivated very much by pure puzzles."}, {"time": 930, "text": "They might be turned on by things like combinatorics."}, {"time": 933, "text": "And they just love the idea of building up a set of problem solving tools applying to pure patterns."}, {"time": 940, "text": "There are some who are very physically motivated, who try to invent new math or discover math in veins that they know will have applications to physics or sometimes computer science."}, {"time": 951, "text": "And that's what drives them."}, {"time": 953, "text": "Like chaos theory is a good example of something that's pure math, that's purely mathematical."}, {"time": 957, "text": "A lot of the statements being made, but it's heavily motivated by specific applications to largely physics."}, {"time": 964, "text": "And then you have a type of mathematician who just loves abstraction."}, {"time": 968, "text": "They just love pulling it to the more and more abstract things, the things that feel powerful."}, {"time": 972, "text": "These are the ones that initially invented like topology and then later on get really into category theory and go on about like infinite categories and whatnot."}, {"time": 980, "text": "These are the ones that love to have a system that can describe truths about as many things as possible."}, {"time": 988, "text": "People from those three different veins of motivation into math are gonna give you very different answers about what the relation at play here is."}, {"time": 994, "text": "Cause someone like Vladimir Arnold, who has written a lot of great books, many about like differential equations and such, he would say, math is a branch of physics."}, {"time": 1005, "text": "That's how he would think about it."}, {"time": 1007, "text": "And of course he was studying like differential equations related things because that is the motivator behind the study of PDEs and things like that."}, {"time": 1014, "text": "But you'll have others who, like especially the category theorists who aren't really thinking about physics necessarily."}, {"time": 1021, "text": "It's all about abstraction and the power of generality."}, {"time": 1024, "text": "And it's more of a happy coincidence that that ends up being useful for understanding the world we live in."}, {"time": 1030, "text": "And then you can get into like, why is that the case?"}, {"time": 1032, "text": "It's sort of surprising that that which is about pure puzzles and abstraction also happens to describe the very fundamentals of quarks and everything else."}, {"time": 1044, "text": "So why do you think the fundamentals of quarks and the nature of reality is so compressible into clean, beautiful equations that are for the most part simple, relatively speaking, a lot simpler than they could be?"}, {"time": 1061, "text": "So you have, we mentioned somebody like Stephen Wolfram who thinks that sort of there's incredibly simple rules underlying our reality, but it can create arbitrary complexity."}, {"time": 1074, "text": "But there is simple equations."}, {"time": 1076, "text": "What, I'm asking a million questions that nobody knows the answer to, but."}, {"time": 1081, "text": "I have no idea, why is it simple?"}, {"time": 1085, "text": "It could be the case that there's like a filter iteration at play."}, {"time": 1088, "text": "The only things that physicists find interesting are the ones that are simple enough they could describe it mathematically."}, {"time": 1093, "text": "But as soon as it's a sufficiently complex system, like, oh, that's outside the realm of physics, that's biology or whatever have you."}, {"time": 1099, "text": "And of course, that's true."}, {"time": 1101, "text": "Maybe there's something where it's like, of course there will always be something that is simple when you wash away the like non important parts of whatever it is that you're studying."}, {"time": 1113, "text": "Just from like an information theory standpoint, there might be some like, you get to the lowest information component of it."}, {"time": 1119, "text": "But I don't know, maybe I'm just having a really hard time conceiving of what it would even mean for the fundamental laws to be like intrinsically complicated, like some set of equations that you can't decouple from each other."}, {"time": 1132, "text": "Well, no, it could be that sort of we take for granted that the laws of physics, for example, are for the most part the same everywhere or something like that, right?"}, {"time": 1145, "text": "As opposed to the sort of an alternative could be that the rules under which the world operates is different everywhere."}, {"time": 1157, "text": "It's like a deeply distributed system where just everything is just chaos, not in a strict definition of chaos, but meaning like just it's impossible for equations to capture, for to explicitly model the world as cleanly as the physical does."}, {"time": 1176, "text": "I mean, we almost take it for granted that we can describe, we can have an equation for gravity, for action at a distance."}, {"time": 1182, "text": "We can have equations for some of these basic ways the planet's moving."}, {"time": 1186, "text": "Just the low level at the atomic scale, how the materials operate, at the high scale, how black holes operate."}, {"time": 1196, "text": "But it doesn't, it seems like it could be, there's infinite other possibilities where none of it could be compressible into such equations."}, {"time": 1205, "text": "So it just seems beautiful."}, {"time": 1206, "text": "It's also weird, probably to the point you're making, that it's very pleasant that this is true for our minds."}, {"time": 1215, "text": "So it might be that our minds are biased to just be looking at the parts of the universe that are compressible."}, {"time": 1221, "text": "And then we can publish papers on and have nice E equals empty squared equations."}, {"time": 1226, "text": "Right, well, I wonder would such a world with uncompressible laws allow for the kind of beings that can think about the kind of questions that you're asking?"}, {"time": 1238, "text": "Right, like an anthropic principle coming into play in some weird way here?"}, {"time": 1242, "text": "I don't know, like I don't know what I'm talking about at all."}, {"time": 1244, "text": "Maybe the universe is actually not so compressible, but the way our brain, the way our brain evolved we're only able to perceive the compressible parts."}, {"time": 1255, "text": "I mean, we are, so this is the sort of Chomsky argument."}, {"time": 1258, "text": "We are just descendants of apes over like really limited biological systems."}, {"time": 1263, "text": "So it totally makes sense that we're really limited little computers, calculators, that are able to perceive certain kinds of things and the actual world is much more complicated."}, {"time": 1273, "text": "Well, but we can do pretty awesome things, right?"}, {"time": 1276, "text": "Like we can fly spaceships and we have to have some connection of reality to be able to take our potentially oversimplified models of the world, but then actually twist the world to our will based on it."}, {"time": 1289, "text": "So we have certain reality checks that like physics isn't too far a field simply based on what we can do."}, {"time": 1295, "text": "Yeah, the fact that we can fly is pretty good."}, {"time": 1297, "text": "It's great, yeah, like it's a proof of concept that the laws we're working with are working well."}, {"time": 1304, "text": "So I mentioned to the internet that I'm talking to you and so the internet gave some questions."}, {"time": 1310, "text": "So I apologize for these, but do you think we're living in a simulation that the universe is a computer or the universe is a computation running on a computer?"}, {"time": 1321, "text": "It's conceivable."}, {"time": 1322, "text": "What I don't buy is, you know, you'll have the argument that, well, let's say that it was the case that you can have simulations."}, {"time": 1329, "text": "Then the simulated world would itself eventually get to a point where it's running simulations."}, {"time": 1335, "text": "And then the second layer down would create a third layer down and on and on and on."}, {"time": 1339, "text": "So probabilistically, you just throw a dart at one of those layers, we're probably in one of the simulated layers."}, {"time": 1344, "text": "I think if there's some sort of limitations on like the information processing of whatever the physical world is, like it quickly becomes the case that you have a limit to the layers that could exist there because like the resources necessary to simulate a universe like ours clearly is a lot just in terms of the number of bits at play."}, {"time": 1363, "text": "And so then you can ask, well, what's more plausible?"}, {"time": 1366, "text": "That there's an unbounded capacity of information processing in whatever the like highest up level universe is, or that there's some bound to that capacity, which then limits like the number of levels available."}, {"time": 1378, "text": "How do you play some kind of probability distribution on like what the information capacity is?"}, {"time": 1383, "text": "But I don't, like people almost assume a certain uniform probability over all of those meta layers that could conceivably exist when it's a little bit like a Pascal's wager on like you're not giving a low enough prior to the mere existence of that infinite set of layers."}, {"time": 1401, "text": "But it's also very difficult to contextualize the amount."}, {"time": 1405, "text": "So the amount of information processing power required to simulate like our universe seems like amazingly huge."}, {"time": 1414, "text": "But you can always raise two to the power of that."}, {"time": 1416, "text": "Yeah, like numbers get big."}, {"time": 1420, "text": "And we're easily humbled by basically everything around us."}, {"time": 1457, "text": "We basically know nothing about the world around us, relatively speaking."}, {"time": 1463, "text": "And so when I think about the simulation hypothesis, I think it's just fun to think about it."}, {"time": 1469, "text": "But it's also, I think there is a thought experiment kind of interesting to think of the power of computation, whether the limits of a Turing machine, sort of the limits of our current computers, when you start to think about artificial intelligence, how far can we get with computers?"}, {"time": 1486, "text": "And that's kind of where the simulation hypothesis used with me as a thought experiment is the universe just a computer?"}, {"time": 1496, "text": "Is it just a computation?"}, {"time": 1498, "text": "Is all of this just a computation?"}, {"time": 1500, "text": "And sort of the same kind of tools we apply to analyzing algorithms, can that be applied?"}, {"time": 1505, "text": "If we scale further and further and further, will the arbitrary power of those systems start to create some interesting aspects that we see in our universe?"}, {"time": 1513, "text": "Or is something fundamentally different needs to be created?"}, {"time": 1517, "text": "Well, it's interesting that in our universe, it's not arbitrarily large, the power, that you can place limits on, for example, how many bits of information can be stored per unit area."}, {"time": 1527, "text": "Right, like all of the physical laws, you've got general relativity and quantum coming together to give you a certain limit on how many bits you can store within a given range before it collapses into a black hole."}, {"time": 1573, "text": "Obviously, it's just as conceivable that they do and that there are many, but I guess what I'm channeling is the surprise that I felt upon learning that fact, that there are, that information is physical in this way."}, {"time": 1586, "text": "There's a finiteness to it."}, {"time": 1587, "text": "Okay, let me just even go off on that."}, {"time": 1589, "text": "From a mathematics perspective and a psychology perspective, how do you mix, are you psychologically comfortable with the concept of infinity?"}, {"time": 1601, "text": "Are you okay with it?"}, {"time": 1602, "text": "I'm pretty okay, yeah."}, {"time": 1603, "text": "Are you okay?"}, {"time": 1604, "text": "No, not really, it doesn't make any sense to me."}, {"time": 1607, "text": "I don't know, like how many words, how many possible words do you think could exist that are just like strings of letters?"}, {"time": 1615, "text": "So that's a sort of mathematical statement as beautiful and we use infinity in basically everything we do, everything we do in science, math, and engineering, yes."}, {"time": 1626, "text": "But you said exist, the question is, you said letters or words?"}, {"time": 1633, "text": "I said words."}, {"time": 1633, "text": "Words."}, {"time": 1636, "text": "To bring words into existence to me, you have to start like saying them or like writing them or like listing them."}, {"time": 1642, "text": "That's an instantiation."}, {"time": 1643, "text": "Okay, how many abstract words exist?"}, {"time": 1645, "text": "Well, the idea of an abstract."}, {"time": 1648, "text": "The idea of abstract notions and ideas."}, {"time": 1651, "text": "I think we should be clear on terminology."}, {"time": 1653, "text": "I mean, you think about intelligence a lot, like artificial intelligence."}, {"time": 1657, "text": "Would you not say that what it's doing is a kind of abstraction?"}, {"time": 1660, "text": "That like abstraction is key to conceptualizing the universe?"}, {"time": 1665, "text": "You get this raw sensory data."}, {"time": 1667, "text": "I need something that every time you move your face a little bit and they're not pixels, but like analog of pixels on my retina changed entirely, that I can still have some coherent notion of this is Lex, I'm talking to Lex, right?"}, {"time": 1679, "text": "What that requires is you have a disparate set of possible images hitting me that are unified in a notion of Lex, right?"}, {"time": 1687, "text": "That's a kind of abstraction."}, {"time": 1688, "text": "It's a thing that could apply to a lot of different images that I see and it represents it in a much more compressed way and one that's like much more resilient to that."}, {"time": 1697, "text": "I think in the same way, if I'm talking about infinity as an abstraction, I don't mean nonphysical woo woo, like ineffable or something."}, {"time": 1706, "text": "What I mean is it's something that can apply to a multiplicity of situations that share a certain common attribute in the same way that the images of like your face on my retina share enough common attributes that I can put the single notion to it."}, {"time": 1717, "text": "Like in that way, infinity is an abstraction and it's very powerful and it's only through such abstractions that we can actually understand like the world and logic and things."}, {"time": 1727, "text": "And in the case of infinity, the way I think about it, the key entity is the property of always being able to add one more."}, {"time": 1734, "text": "Like no matter how many words you can list, you just throw an A at the end of one and you have another conceivable word."}, {"time": 1739, "text": "You don't have to think of all the words at once."}, {"time": 1741, "text": "It's that property, the oh, I could always add one more that gives it this nature of infiniteness in the same way that there's certain like properties of your face that give it the Lexness, right?"}, {"time": 1753, "text": "So like infinity should be no more worrying than the I can always add one more sentiment."}, {"time": 1759, "text": "That's a really elegant, much more elegant way than I could put it."}, {"time": 1763, "text": "So thank you for doing that as yet another abstraction."}, {"time": 1766, "text": "And yes, indeed, that's what our brain does."}, {"time": 1769, "text": "That's what intelligent systems do."}, {"time": 1770, "text": "That's what programming does."}, {"time": 1771, "text": "That's what science does is build abstraction on top of each other."}, {"time": 1775, "text": "And yet there is at a certain point abstractions that go into the quote woo, right?"}, {"time": 1782, "text": "Sort of, and because we're now, it's like we built this stack of, you know, the only thing that's true is the stuff that's on the ground."}, {"time": 1794, "text": "Everything else is useful for interpreting this."}, {"time": 1797, "text": "And at a certain point you might start floating into ideas that are surreal and difficult and take us into areas that are disconnected from reality in a way that we could never get back."}, {"time": 1811, "text": "What if instead of calling these abstract, how different would it be in your mind if we called them general?"}, {"time": 1815, "text": "And the phenomenon that you're describing is overgeneralization."}, {"time": 1819, "text": "When you try to have a concept or an idea that's so general as to apply to nothing in particular in a useful way, does that map to what you're thinking of when you think of?"}, {"time": 1828, "text": "First of all, I'm playing little just for the fun of it."}, {"time": 1831, "text": "Devil's advocate."}, {"time": 1832, "text": "And I think our cognition, our mind is unable to visualize."}, {"time": 1839, "text": "So you do some incredible work with visualization and video."}, {"time": 1842, "text": "I think infinity is very difficult to visualize for our mind."}, {"time": 1848, "text": "We can delude ourselves into thinking we can visualize it, but we can't."}, {"time": 1854, "text": "I don't, I mean, I don't, I would venture to say it's very difficult."}, {"time": 1857, "text": "And so there's some concepts of mathematics, like maybe multiple dimensions, we could sort of talk about that are impossible for us to truly intuit, like, and it just feels dangerous to me to use these as part of our toolbox of abstractions."}, {"time": 1876, "text": "On behalf of your listeners, I almost fear we're getting too philosophical."}, {"time": 1882, "text": "I think to that point for any particular idea like this, there's multiple angles of attack."}, {"time": 1888, "text": "I think the, when we do visualize infinity, what we're actually doing, you know, you write dot, dot, dot, right?"}, {"time": 1894, "text": "One, two, three, four, dot, dot, dot, right?"}, {"time": 1897, "text": "Those are symbols on the page that are insinuating a certain infinity."}, {"time": 1902, "text": "What you're capturing with a little bit of design there is the I can always add one more property, right?"}, {"time": 1909, "text": "I think I'm just as uncomfortable with you are if you try to concretize it so much that you have a bag of infinitely many things that I actually think of, no, not one, two, three, four, dot, dot, dot, one, two, three, four, five, six, seven, eight."}, {"time": 1923, "text": "I try to get them all in my head and you realize, oh, you know, your brain would literally collapse into a black hole, all of that."}, {"time": 1930, "text": "And I honestly feel this with a lot of math that I try to read where I don't think of myself as like particularly good at math in some ways."}, {"time": 1939, "text": "Like I get very confused often when I am going through some of these texts."}, {"time": 1943, "text": "And often what I'm feeling in my head is like, this is just so damn abstract."}, {"time": 1947, "text": "I just can't wrap my head around it."}, {"time": 1949, "text": "I just want to put something concrete to it that makes me understand."}, {"time": 1952, "text": "And I think a lot of the motivation for the channel is channeling that sentiment of, yeah, a lot of the things that you're trying to read out there, it's just so hard to connect to anything that you spend an hour banging your head against a couple of pages and you come out not really knowing anything more other than some definitions maybe and a certain sense of self defeat, right?"}, {"time": 1975, "text": "One of the reasons I focus so much on visualizations is that I'm a big believer in, I'm sorry, I'm just really hampering on this idea of abstraction, being clear about your layers of abstraction, right?"}, {"time": 1987, "text": "It's always tempting to start an explanation from the top to the bottom, okay?"}, {"time": 1991, "text": "You give the definition of a new theorem."}, {"time": 1994, "text": "You're like, this is the definition of a vector space."}, {"time": 1996, "text": "For example, that's how we'll start a course."}, {"time": 1998, "text": "These are the properties of a vector space."}, {"time": 2000, "text": "First from these properties, we will derive what we need in order to do the math of linear algebra or whatever it might be."}, {"time": 2006, "text": "I don't think that's how understanding works at all."}, {"time": 2028, "text": "It's as concrete as you could possibly get and it has to be if you're putting it in a visual, right?"}, {"time": 2033, "text": "It's an actual arrow."}, {"time": 2033, "text": "It's an actual vector."}, {"time": 2036, "text": "You're not talking about like a quote unquote vector that could apply to any possible thing."}, {"time": 2041, "text": "You have to choose one if you're illustrating it."}, {"time": 2043, "text": "And I think this is the power of being in a medium like video or if you're writing a textbook and you force yourself to put a lot of images is with every image, you're making a choice."}, {"time": 2053, "text": "With each choice, you're showing a concrete example."}, {"time": 2056, "text": "With each concrete example, you're aiding someone's path to understanding."}, {"time": 2059, "text": "I'm sorry to interrupt you, but you just made me realize that that's exactly right."}, {"time": 2064, "text": "So the visualizations you're creating while you're sometimes talking about abstractions, the actual visualization is an explicit low level example."}, {"time": 2075, "text": "So there's an actual, like in the code, you have to say what the vector is, what's the direction of the arrow, what's the magnitude of the, yeah."}, {"time": 2084, "text": "So that's, you're going, the visualization itself is actually going to the bottom of that."}, {"time": 2090, "text": "And I think that's very important."}, {"time": 2092, "text": "I also think about this a lot in writing scripts where even before you get to the visuals, the first instinct is to, I don't know why, I just always do, I say the abstract thing, I say the general definition, the powerful thing, and then I fill it in with examples later."}, {"time": 2107, "text": "Always, it will be more compelling and easier to understand when you flip that."}, {"time": 2110, "text": "And instead, you let someone's brain do the pattern recognition."}, {"time": 2116, "text": "You just show them a bunch of examples."}, {"time": 2118, "text": "The brain is gonna feel a certain similarity between them."}, {"time": 2121, "text": "Then by the time you bring in the definition, or by the time you bring in the formula, it's articulating a thing that's already in the brain that was built off of looking at a bunch of examples with a certain kind of similarity."}, {"time": 2132, "text": "And what the formula does is articulate what that kind of similarity is, rather than being a high cognitive load set of symbols that needs to be populated with examples later on, assuming someone's still with you."}, {"time": 2148, "text": "What is the most beautiful or awe inspiring idea you've come across in mathematics?"}, {"time": 2153, "text": "I don't know, man."}, {"time": 2155, "text": "Maybe it's an idea you've explored in your videos, maybe not."}, {"time": 2158, "text": "What just gave you pause?"}, {"time": 2161, "text": "What's the most beautiful idea?"}, {"time": 2163, "text": "Small or big."}, {"time": 2164, "text": "So I think often, the things that are most beautiful are the ones that you have a little bit of understanding of, but certainly not an entire understanding."}, {"time": 2174, "text": "It's a little bit of that mystery that is what makes it beautiful."}, {"time": 2177, "text": "What was the moment of the discovery for you personally, almost just that leap of aha moment?"}, {"time": 2183, "text": "So something that really caught my eye, I remember when I was little, there were these, I think the series was called like wooden books or something, these tiny little books that would have just a very short description of something on the left and then a picture on the right."}, {"time": 2196, "text": "I don't know who they're meant for, but maybe it's like loosely children or something like that."}, {"time": 2200, "text": "But it can't just be children, because of some of the things I was describing."}, {"time": 2203, "text": "On the last page of one of them, somewhere tiny in there was this little formula that on the left hand had a sum over all of the natural numbers."}, {"time": 2211, "text": "It's like one over one to the S plus one over two to the S plus one over three to the S on and on to the infinity."}, {"time": 2217, "text": "Then on the other side had a product over all of the primes and it was a certain thing had to do with all the primes."}, {"time": 2223, "text": "And like any good young math enthusiast, I'd probably been indoctrinated with how chaotic and confusing the primes are, which they are."}, {"time": 2230, "text": "And seeing this equation where on one side you have something that's as understandable as you could possibly get, the counting numbers."}, {"time": 2238, "text": "And on the other side is all the prime numbers."}, {"time": 2240, "text": "It was like this, whoa, they're related like this?"}, {"time": 2243, "text": "There's a simple description that includes all the primes getting wrapped together like this."}, {"time": 2248, "text": "This is like the Euler product for the Zeta function, as I like later found out."}, {"time": 2253, "text": "The equation itself essentially encodes the fundamental theorem of arithmetic that every number can be expressed as a unique set of primes."}, {"time": 2262, "text": "To me still there's, I mean, I certainly don't understand this equation or this function all that well."}, {"time": 2267, "text": "The more I learn about it, the prettier it is."}, {"time": 2270, "text": "The idea that you can, this is sort of what gets you representations of primes, not in terms of primes themselves, but in terms of another set of numbers."}, {"time": 2279, "text": "They're like the non trivial zeros of the Zeta function."}, {"time": 2281, "text": "And again, I'm very kind of in over my head in a lot of ways as I like try to get to understand it."}, {"time": 2286, "text": "But the more I do, it always leaves enough mystery that it remains very beautiful to me."}, {"time": 2291, "text": "So whenever there's a little bit of mystery just outside of the understanding that, and by the way, the process of learning more about it, how does that come about?"}, {"time": 2300, "text": "Just your own thought or are you reading?"}, {"time": 2303, "text": "Reading, yeah."}, {"time": 2304, "text": "Or is the process of visualization itself revealing more to you?"}, {"time": 2308, "text": "Visuals help."}, {"time": 2309, "text": "I mean, in one time when I was just trying to understand like analytic continuation and playing around with visualizing complex functions, this is what led to a video about this function."}, {"time": 2319, "text": "It's titled something like Visualizing the Riemann Zeta Function."}, {"time": 2322, "text": "It's one that came about because I was programming and tried to see what a certain thing looked like."}, {"time": 2327, "text": "And then I looked at it and I'm like, whoa, that's elucidating."}, {"time": 2330, "text": "And then I decided to make a video about it."}, {"time": 2333, "text": "But I mean, you try to get your hands on as much reading as you can."}, {"time": 2338, "text": "You know, in this case, I think if anyone wants to start to understand it, if they have like a math background like they studied some in college or something like that, like the Princeton Companion to Math has a really good article on analytic number theory."}, {"time": 2353, "text": "And that itself has a whole bunch of references and you know, anything has more references and it gives you this like tree to start piling through."}, {"time": 2360, "text": "And like, you know, you try to understand, I try to understand things visually as I go."}, {"time": 2364, "text": "That's not always possible, but it's very helpful when it does."}, {"time": 2368, "text": "You recognize when there's common themes, like in this case, Cousins of the Fourier Transform that come into play and you realize, oh, it's probably pretty important to have deep intuitions of the Fourier Transform, even if it's not explicitly mentioned in like these texts."}, {"time": 2382, "text": "And you try to get a sense of what the common players are."}, {"time": 2385, "text": "But I'll emphasize again, like, I feel very in over my head when I try to understand the exact relation between like the zeros of the Riemann Zeta function and how they relate to the distribution of primes."}, {"time": 2396, "text": "I definitely understand it better than I did a year ago."}, {"time": 2399, "text": "I definitely understand it on 100th as well as the experts on the matter do, I assume."}, {"time": 2404, "text": "But the slow path towards getting there is, it's fun, it's charming, and like to your question, very beautiful."}, {"time": 2412, "text": "And the beauty is in the, what, in the journey versus the destination?"}, {"time": 2417, "text": "Well, it's that each thing doesn't feel arbitrary."}, {"time": 2419, "text": "I think that's a big part, is that you have these unpredictable, no, yeah, these very unpredictable patterns or these intricate properties of like a certain function."}, {"time": 2430, "text": "But at the same time, it doesn't feel like humans ever made an arbitrary choice in studying this particular thing."}, {"time": 2435, "text": "So, you know, it feels like you're speaking to patterns themselves or nature itself."}, {"time": 2441, "text": "That's a big part of it."}, {"time": 2443, "text": "I think things that are too arbitrary, it's just hard for those to feel beautiful because this is sort of what the word contrived is meant to apply to, right?"}, {"time": 2453, "text": "And when they're not arbitrary means it could be, you can have a clean abstraction and intuition that allows you to comprehend it."}, {"time": 2464, "text": "Well, to one of your first questions, it makes you feel like if you came across another intelligent civilization, that they'd be studying the same thing."}, {"time": 2472, "text": "Maybe with different notation."}, {"time": 2473, "text": "Certainly, yeah, but yeah."}, {"time": 2475, "text": "Like that's what, I think you talked to that other civilization, they're probably also studying the zeros of the Riemann Zeta function or like some variant thereof that is like a clearly equivalent cousin or something like that."}, {"time": 2488, "text": "But that's probably on their docket."}, {"time": 2492, "text": "Whenever somebody does a lot of something amazing, I'm gonna ask the question that you've already been asked a lot and that you'll get more and more asked in your life."}, {"time": 2503, "text": "But what was your favorite video to create?"}, {"time": 2506, "text": "Oh, favorite to create."}, {"time": 2509, "text": "One of my favorites is, the title is Who Cares About Topology?"}, {"time": 2514, "text": "You want me to pull it up or no?"}, {"time": 2515, "text": "If you want, sure, yeah."}, {"time": 2517, "text": "It is about, well, it starts by describing an unsolved problem that's still unsolved in math called the inscribed square problem."}, {"time": 2525, "text": "You draw any loop and then you ask, are there four points on that loop that make a square?"}, {"time": 2529, "text": "Totally useless, right?"}, {"time": 2530, "text": "This is not answering any physical questions."}, {"time": 2532, "text": "It's mostly interesting that we can't answer that question."}, {"time": 2534, "text": "And it seems like such a natural thing to ask."}, {"time": 2538, "text": "Now, if you weaken it a little bit and you ask, can you always find a rectangle?"}, {"time": 2542, "text": "You choose four points on this curve, can you find a rectangle?"}, {"time": 2545, "text": "That's hard, but it's doable."}, {"time": 2547, "text": "And the path to it involves things like looking at a torus, this surface with a single hole in it, like a donut, or looking at a mobius strip."}, {"time": 2557, "text": "In ways that feel so much less contrived to when I first, as like a little kid, learned about these surfaces and shapes, like a mobius strip and a torus."}, {"time": 2565, "text": "Like what you learn is, oh, this mobius strip, you take a piece of paper, put a twist, glue it together, and now you have a shape with one edge and just one side."}, {"time": 2573, "text": "And as a student, you should think, who cares, right?"}, {"time": 2578, "text": "Like, how does that help me solve any problems?"}, {"time": 2580, "text": "I thought math was about problem solving."}, {"time": 2582, "text": "So what I liked about the piece of math that this was describing that was in this paper by a mathematician named Vaughn was that it arises very naturally."}, {"time": 2592, "text": "It's clear what it represents."}, {"time": 2594, "text": "It's doing something."}, {"time": 2595, "text": "It's not just playing with construction paper."}, {"time": 2597, "text": "And the way that it solves the problem is really beautiful."}, {"time": 2601, "text": "So kind of putting all of that down and concretizing it, right?"}, {"time": 2605, "text": "Like I was talking about how when you have to put visuals to it, it demands that what's on screen is a very specific example of what you're describing."}, {"time": 2613, "text": "The construction here is very abstract in nature."}, {"time": 2615, "text": "You describe this very abstract kind of surface in 3D space."}, {"time": 2619, "text": "So then when I was finding myself, in this case, I wasn't programming, I was using a grapher that's like built into OSX for the 3D stuff to draw that surface, you realize, oh man, the topology argument is very non constructive."}, {"time": 2632, "text": "I have to make a lot of, you have to do a lot of extra work in order to make the surface show up."}, {"time": 2637, "text": "But then once you see it, it's quite pretty and it's very satisfying to see a specific instance of it."}, {"time": 2642, "text": "And you also feel like, ah, I've actually added something on top of what the original paper was doing that it shows something that's completely correct."}, {"time": 2649, "text": "That's a very beautiful argument, but you don't see what it looks like."}, {"time": 2652, "text": "And I found something satisfying in seeing what it looked like that could only ever have come about from the forcing function of getting some kind of image on the screen to describe the thing I was talking about."}, {"time": 2662, "text": "So you almost weren't able to anticipate what it's gonna look like."}, {"time": 2665, "text": "I had no idea."}, {"time": 2667, "text": "And it was wonderful, right?"}, {"time": 2668, "text": "It was totally, it looks like a Sydney Opera House or some sort of Frank Gehry design."}, {"time": 2672, "text": "And it was, you knew it was gonna be something and you can say various things about it."}, {"time": 2676, "text": "Like, oh, it touches the curve itself."}, {"time": 2679, "text": "It has a boundary that's this curve on the 2D plane."}, {"time": 2682, "text": "It all sits above the plane."}, {"time": 2683, "text": "But before you actually draw it, it's very unclear what the thing will look like."}, {"time": 2688, "text": "And to see it, it's very, it's just pleasing, right?"}, {"time": 2690, "text": "So that was fun to make, very fun to share."}, {"time": 2693, "text": "I hope that it has elucidated for some people out there where these constructs of topology come from, that it's not arbitrary play with construction paper."}, {"time": 2704, "text": "So let's, I think this is a good sort of example to talk a little bit about your process."}, {"time": 2709, "text": "You have a list of ideas."}, {"time": 2712, "text": "So that's sort of the curse of having an active and brilliant mind is I'm sure you have a list that's growing faster than you can utilize."}, {"time": 2722, "text": "Now I'm ahead, absolutely."}, {"time": 2724, "text": "But there's some sorting procedure depending on mood and interest and so on."}, {"time": 2729, "text": "But okay, so you pick an idea and then you have to try to write a narrative arc that sort of, how do I elucidate?"}, {"time": 2738, "text": "How do I make this idea beautiful and clear and explain it?"}, {"time": 2742, "text": "And then there's a set of visualizations that will be attached to it."}, {"time": 2746, "text": "Sort of, you've talked about some of this before, but sort of writing the story, attaching the visualizations."}, {"time": 2752, "text": "Can you talk through interesting, painful, beautiful parts of that process?"}, {"time": 2758, "text": "Well, the most painful is if you've chosen a topic that you do want to do, but then it's hard to think of, I guess how to structure the script."}, {"time": 2767, "text": "This is sort of where I have been on one for like the last two or three months."}, {"time": 2772, "text": "And I think that ultimately the right resolution is just like set it aside and instead do some other things where the script comes more naturally."}, {"time": 2778, "text": "Because you sort of don't want to overwork a narrative."}, {"time": 2783, "text": "The more you've thought about it, the less you can empathize with the student who doesn't yet understand the thing you're trying to teach."}, {"time": 2788, "text": "Who is the judger in your head?"}, {"time": 2791, "text": "Sort of the person, the creature, the essence that's saying this sucks or this is good."}, {"time": 2798, "text": "And you mentioned kind of the student you're thinking about."}, {"time": 2803, "text": "Can you, who is that?"}, {"time": 2805, "text": "That says, the perfectionist that says this thing sucks."}, {"time": 2809, "text": "You need to work on that for another two, three months."}, {"time": 2814, "text": "I think it's my past self."}, {"time": 2816, "text": "I think that's the entity that I'm most trying to empathize with is like you take who I was, because that's kind of the only person I know."}, {"time": 2822, "text": "Like you don't really know anyone other than versions of yourself."}, {"time": 2825, "text": "So I start with the version of myself that I know who doesn't yet understand the thing, right?"}, {"time": 2830, "text": "And then I just try to view it with fresh eyes, a particular visual or a particular script."}, {"time": 2837, "text": "Like, is this motivating?"}, {"time": 2838, "text": "Does this make sense?"}, {"time": 2840, "text": "Which has its downsides, because sometimes I find myself speaking to motivations that only myself would be interested in."}, {"time": 2848, "text": "I don't know, like I did this project on quaternions where what I really wanted was to understand what are they doing in four dimensions?"}, {"time": 2854, "text": "Can we see what they're doing in four dimensions, right?"}, {"time": 2857, "text": "And I came up with a way of thinking about it that really answered the question in my head that made me very satisfied and being able to think about concretely with a 3D visual, what are they doing to a 4D sphere?"}, {"time": 2868, "text": "And so I'm like, great, this is exactly what my past self would have wanted, right?"}, {"time": 2871, "text": "And I make a thing on it."}, {"time": 2872, "text": "And I'm sure it's what some other people wanted too."}, {"time": 2875, "text": "But in hindsight, I think most people who wanna learn about quaternions are like robotics engineers or graphics programmers who want to understand how they're used to describe 3D rotations."}, {"time": 2886, "text": "And like their use case was actually a little bit different than my past self."}, {"time": 2889, "text": "And in that way, like, I wouldn't actually recommend that video to people who are coming at it from that angle of wanting to know, hey, I'm a robotics programmer."}, {"time": 2897, "text": "Like, how do these quaternion things work to describe position in 3D space?"}, {"time": 2902, "text": "I would say other great resources for that."}, {"time": 2905, "text": "If you ever find yourself wanting to say like, but hang on, in what sense are they acting in four dimensions?"}, {"time": 2910, "text": "Then come back."}, {"time": 2911, "text": "But until then, that's a little different."}, {"time": 2914, "text": "Yeah, it's interesting because you have incredible videos on neural networks, for example."}, {"time": 2919, "text": "And from my sort of perspective, because I've probably, I mean, I looked at the, is sort of my field and I've also looked at the basic introduction of neural networks like a million times from different perspectives."}, {"time": 2932, "text": "And it made me realize that there's a lot of ways to present it."}, {"time": 2935, "text": "So you were sort of, you did an incredible job."}, {"time": 2938, "text": "I mean, sort of the, but you could also do it differently and also incredible."}, {"time": 2944, "text": "Like to create a beautiful presentation of a basic concept requires sort of creativity, requires genius and so on, but you can take it from a bunch of different perspectives."}, {"time": 2958, "text": "And that video on neural networks made me realize that."}, {"time": 2961, "text": "And just as you're saying, you kind of have a certain mindset, a certain view, but from a, if you take a different view from a physics perspective, from a neuroscience perspective, talking about neural networks or from a robotics perspective, or from, let's see, from a pure learning, statistics perspective."}, {"time": 2983, "text": "So you can create totally different videos."}, {"time": 2986, "text": "And you've done that with a few actually concepts where you've have taken different cuts, like at the Euler equation, right?"}, {"time": 2994, "text": "You've taken different views of that."}, {"time": 2996, "text": "I think I've made three videos on it and I definitely will make at least one more."}, {"time": 3004, "text": "So you don't think it's the most beautiful equation in mathematics?"}, {"time": 3008, "text": "Like I said, as we represent it, it's one of the most hideous."}, {"time": 3011, "text": "It involves a lot of the most hideous aspects of our notation."}, {"time": 3014, "text": "I talked about E, the fact that we use pi instead of tau, the fact that we call imaginary numbers imaginary, and then, hence, I actually wonder if we use the I because of imaginary."}, {"time": 3024, "text": "I don't know if that's historically accurate, but at least a lot of people, they read the I and they think imaginary."}, {"time": 3030, "text": "Like all three of those facts, it's like those are things that have added more confusion than they needed to, and we're wrapping them up in one equation."}, {"time": 3035, "text": "Like boy, that's just very hideous, right?"}, {"time": 3039, "text": "The idea is that it does tie together when you wash away the notation."}, {"time": 3042, "text": "Like it's okay, it's pretty, it's nice, but it's not like mind blowing greatest thing in the universe, which is maybe what I was thinking of when I said, like once you understand something, it doesn't have the same beauty."}, {"time": 3055, "text": "Like I feel like I understand Euler's formula, and I feel like I understand it enough to sort of see the version that just woke up that hasn't really gotten itself dressed in the morning that's a little bit groggy, and there's bags under its eyes."}, {"time": 3070, "text": "So you're past the dating stage, you're no longer dating, right?"}, {"time": 3075, "text": "I'm still dating the Zeta function, and like she's beautiful and right, and like we have fun, and it's that high dopamine part, but like maybe at some point we'll settle into the more mundane nature of the relationship where I like see her for who she truly is, and she'll still be beautiful in her own way, but it won't have the same romantic pizzazz, right?"}, {"time": 3093, "text": "Well, that's the nice thing about mathematics."}, {"time": 3095, "text": "I think as long as you don't live forever, there'll always be enough mystery and fun with some of the equations."}, {"time": 3102, "text": "Even if you do, the rate at which questions comes up is much faster than the rate at which answers come up, so."}, {"time": 3108, "text": "If you could live forever, would you?"}, {"time": 3112, "text": "So you think, you don't think mortality is the thing that makes life meaningful?"}, {"time": 3115, "text": "Would your life be four times as meaningful if you died at 25?"}, {"time": 3120, "text": "So this goes to infinity."}, {"time": 3122, "text": "I think you and I, that's really interesting."}, {"time": 3124, "text": "So what I said is infinite, not four times longer."}, {"time": 3129, "text": "I said infinite."}, {"time": 3130, "text": "So the actual existence of the finiteness, the existence of the end, no matter the length, is the thing that may sort of, from my comprehension of psychology, it's such a deeply human, it's such a fundamental part of the human condition, the fact that there is, that we're mortal, that the fact that things end, it seems to be a crucial part of what gives them meaning."}, {"time": 3157, "text": "I don't think, at least for me, it's a very small percentage of my time that mortality is salient, that I'm aware of the end of my life."}, {"time": 3167, "text": "What do you mean by me?"}, {"time": 3170, "text": "I'm trolling."}, {"time": 3171, "text": "Is it the ego, is it the id, or is it the superego?"}, {"time": 3175, "text": "The reflective self, the Wernicke's area that puts all this stuff into words."}, {"time": 3179, "text": "Yeah, a small percentage of your mind that is actually aware of the true motivations that drive you."}, {"time": 3186, "text": "But my point is that most of my life, I'm not thinking about death, but I still feel very motivated to make things and to interact with people, experience love or things like that."}, {"time": 3195, "text": "I'm very motivated, and it's strange that that motivation comes while death is not in my mind at all."}, {"time": 3201, "text": "And this might just be because I'm young enough that it's not salient."}, {"time": 3204, "text": "Or it's in your subconscious, or that you've constructed an illusion that allows you to escape the fact of your mortality by enjoying the moment, sort of the existential approach to life."}, {"time": 3216, "text": "Gun to my head, I don't think that's it."}, {"time": 3218, "text": "Yeah, another sort of way to say gun to the head is sort of the deep psychological introspection of what drives us."}, {"time": 3224, "text": "I mean, that's, in some ways to me, I mean, when I look at math, when I look at science, is a kind of an escape from reality in a sense that it's so beautiful."}, {"time": 3234, "text": "It's such a beautiful journey of discovery that it allows you to actually, it sort of allows you to achieve a kind of immortality of explore ideas and sort of connect yourself to the thing that is seemingly infinite, like the universe, right?"}, {"time": 3253, "text": "That allows you to escape the limited nature of our little, of our bodies, of our existence."}, {"time": 3264, "text": "What else would give this podcast meaning?"}, {"time": 3266, "text": "If not the fact that it will end."}, {"time": 3268, "text": "This place closes in 40 minutes."}, {"time": 3270, "text": "And it's so much more meaningful for it."}, {"time": 3273, "text": "How much more I love this room because we'll be kicked out."}, {"time": 3278, "text": "So I understand just because you're trolling me doesn't mean I'm wrong."}, {"time": 3286, "text": "But I take your point."}, {"time": 3287, "text": "I take your point."}, {"time": 3289, "text": "Boy, that would be a good Twitter bio."}, {"time": 3292, "text": "Just because you're trolling me doesn't mean I'm wrong."}, {"time": 3294, "text": "Yeah, and sort of difference in backgrounds."}, {"time": 3298, "text": "I'm a bit Russian, so we're a bit melancholic and seem to maybe assign a little too much value to suffering and mortality and things like that."}, {"time": 3307, "text": "Makes for a better novel, I think."}, {"time": 3309, "text": "Oh yeah, you need some sort of existential threat to drive a plot."}, {"time": 3316, "text": "So when do you know when the video is done when you're working on it?"}, {"time": 3320, "text": "That's pretty easy actually, because I'll write the script."}, {"time": 3324, "text": "I want there to be some kind of aha moment in there."}, {"time": 3327, "text": "And then hopefully the script can revolve around some kind of aha moment."}, {"time": 3330, "text": "And then from there, you're putting visuals to each sentence that exists, and then you narrate it, you edit it all together."}, {"time": 3336, "text": "So given that there's a script, the end becomes quite clear."}, {"time": 3340, "text": "And as I animate it, I often change certainly the specific words, but sometimes the structure itself."}, {"time": 3349, "text": "But it's a very deterministic process at that point."}, {"time": 3353, "text": "It makes it much easier to predict when something will be done."}, {"time": 3355, "text": "How do you know when a script is done?"}, {"time": 3357, "text": "It's like, for problem solving videos, that's quite simple."}, {"time": 3360, "text": "It's once you feel like someone who didn't understand the solution now could."}, {"time": 3363, "text": "For things like neural networks, that was a lot harder because like you said, there's so many angles at which you could attack it."}, {"time": 3369, "text": "And there, it's just at some point you feel like this asks a meaningful question and it answers that question, right?"}, {"time": 3378, "text": "What is the best way to learn math for people who might be at the beginning of that journey?"}, {"time": 3382, "text": "I think that's a question that a lot of folks kind of ask and think about."}, {"time": 3386, "text": "And it doesn't, even for folks who are not really at the beginning of their journey, like there might be actually deep in their career, some type they've taken college or taken calculus and so on, but still wanna sort of explore math."}, {"time": 3399, "text": "What would be your advice instead of education at all ages?"}, {"time": 3402, "text": "Your temptation will be to spend more time like watching lectures or reading."}, {"time": 3408, "text": "Try to force yourself to do more problems than you naturally would."}, {"time": 3412, "text": "That's a big one."}, {"time": 3413, "text": "Like the focus time that you're spending should be on like solving specific problems and seek entities that have well curated lists of problems."}, {"time": 3422, "text": "So go into like a textbook almost and the problems in the back of a textbook kind of thing, back of a chapter."}, {"time": 3428, "text": "So if you can take a little look through those questions at the end of the chapter before you read the chapter, a lot of them won't make sense."}, {"time": 3433, "text": "Some of them might, and those are the best ones to think about."}, {"time": 3436, "text": "A lot of them won't, but just take a quick look and then read a little bit of the chapter and then maybe take a look again and things like that."}, {"time": 3442, "text": "And don't consider yourself done with the chapter until you've actually worked through a couple exercises."}, {"time": 3449, "text": "And this is so hypocritical, right?"}, {"time": 3451, "text": "Cause I like put out videos that pretty much never have associated exercises."}, {"time": 3455, "text": "I just view myself as a different part of the ecosystem, which means I'm kind of admitting that you're not really learning, or at least this is only a partial part of the learning process if you're watching these videos."}, {"time": 3468, "text": "I think if someone's at the very beginning, like I do think Khan Academy does a good job."}, {"time": 3472, "text": "They have a pretty large set of questions you can work through."}, {"time": 3475, "text": "Just the very basics, sort of just picking up, getting comfortable with the very basic linear algebra, calculus or so on, Khan Academy."}, {"time": 3484, "text": "Programming is actually I think a great, like learn to program and like let the way that math is motivated from that angle push you through."}, {"time": 3491, "text": "I know a lot of people who didn't like math got into programming in some way and that's what turned them on to math."}, {"time": 3497, "text": "Maybe I'm biased cause like I live in the Bay area, so I'm more likely to run into someone who has that phenotype."}, {"time": 3503, "text": "But I am willing to speculate that that is a more generalizable path."}, {"time": 3508, "text": "So you yourself kind of in creating the videos are using programming to illuminate a concept, but for yourself as well."}, {"time": 3515, "text": "So would you recommend somebody try to make a, sort of almost like try to make videos?"}]}]