[{"title": "Jeremy Howard: fast.ai Deep Learning Courses and Research | Lex Fridman Podcast #35", "id": "J6XcP4JOHmk", "quotes": [{"time": 276, "text": "So what's the connection between Excel and Access?"}, {"time": 280, "text": "So very close."}, {"time": 282, "text": "So Access kind of was the relational database equivalent, if you like."}, {"time": 287, "text": "So people still do a lot of that stuff that should be in Access in Excel as they know it."}, {"time": 293, "text": "Excel's great as well."}, {"time": 294, "text": "So, but it's just not as rich a programming model as VBA combined with a relational database."}, {"time": 304, "text": "And so I've always loved relational databases, but today programming on top of relational database is just a lot more of a headache."}, {"time": 313, "text": "You know, you generally either need to kind of, you know, you need something that connects, that runs some kind of database server unless you use SQLite, which has its own issues."}, {"time": 325, "text": "Then you kind of often, if you want to get a nice programming model, you'll need to like create an, add an ORM on top."}, {"time": 330, "text": "And then, I don't know, there's all these pieces to tie together and it's just a lot more awkward than it should be."}, {"time": 337, "text": "There are people that are trying to make it easier."}, {"time": 339, "text": "So in particular, I think of F sharp, you know, Don Syme, who, him and his team have done a great job of making something like a database appear in the type system."}, {"time": 351, "text": "So you actually get like tab completion for fields and tables and stuff like that."}, {"time": 357, "text": "Anyway, so that was kind of, anyway, so like that whole VBA office thing, I guess, was a starting point, which I still miss."}, {"time": 364, "text": "And I got into standard Visual Basic, which... That's interesting, just to pause on that for a second."}, {"time": 369, "text": "It's interesting that you're connecting programming languages to the ease of management of data."}, {"time": 378, "text": "So in your use of programming languages, you always had a love and a connection with data."}, {"time": 384, "text": "I've always been interested in doing useful things for myself and for others, which generally means getting some data and doing something with it and putting it out there again."}, {"time": 394, "text": "So that's been my interest throughout."}, {"time": 398, "text": "So I also did a lot of stuff with AppleScript back in the early days."}, {"time": 403, "text": "So it's kind of nice being able to get the computer and computers to talk to each other and to do things for you."}, {"time": 412, "text": "And then I think that one, the programming language I most loved then would have been Delphi, which was Object Pascal, created by Anders Heilsberg, who previously did Turbo Pascal and then went on to create.NET and then went on to create TypeScript."}, {"time": 431, "text": "Delphi was amazing because it was like a compiled, fast language that was as easy to use as Visual Basic."}, {"time": 440, "text": "Delphi, what is it similar to in more modern languages?"}, {"time": 447, "text": "Visual Basic."}, {"time": 449, "text": "Yeah, but a compiled, fast version."}, {"time": 452, "text": "So I'm not sure there's anything quite like it anymore."}, {"time": 457, "text": "If you took like C Sharp or Java and got rid of the virtual machine and replaced it with something, you could compile a small type binary."}, {"time": 466, "text": "I feel like it's where Swift could get to with the new Swift UI and the cross platform development going on."}, {"time": 476, "text": "Like that's one of my dreams is that we'll hopefully get back to where Delphi was."}, {"time": 482, "text": "There is actually a free Pascal project nowadays called Lazarus, which is also attempting to kind of recreate Delphi."}, {"time": 493, "text": "So they're making good progress."}, {"time": 496, "text": "So, okay, Delphi, that's one of your favorite programming languages."}, {"time": 500, "text": "Well, it's programming environments."}, {"time": 502, "text": "Again, I'd say Pascal's not a nice language."}, {"time": 506, "text": "If you wanted to know specifically about what languages I like, I would definitely pick J as being an amazingly wonderful language."}, {"time": 515, "text": "What's J?"}, {"time": 517, "text": "J, are you aware of APL?"}, {"time": 519, "text": "I am not, except from doing a little research on the work you've done."}, {"time": 524, "text": "Okay, so not at all surprising you're not familiar with it because it's not well known, but it's actually one of the main families of programming languages going back to the late 50s, early 60s."}, {"time": 537, "text": "So there was a couple of major directions."}, {"time": 541, "text": "One was the kind of Lambda Calculus Alonzo Church direction, which I guess kind of lisp and scheme and whatever, which has a history going back to the early days of computing."}, {"time": 553, "text": "The second was the kind of imperative slash OO, algo similar going on to C, C++ and so forth."}, {"time": 563, "text": "There was a third, which are called array oriented languages, which started with a paper by a guy called Ken Iverson, which was actually a math theory paper, not a programming paper."}, {"time": 577, "text": "It was called Notation as a Tool for Thought."}, {"time": 581, "text": "And it was the development of a new way, a new type of math notation."}, {"time": 585, "text": "And the idea is that this math notation was much more flexible, expressive, and also well defined than traditional math notation, which is none of those things."}, {"time": 596, "text": "Math notation is awful."}, {"time": 599, "text": "And so he actually turned that into a programming language and cause this was the early 50s or the sorry, late 50s, all the names were available."}, {"time": 606, "text": "So he called his language a programming language or APL."}, {"time": 610, "text": "APL."}, {"time": 611, "text": "So APL is a implementation of notation as a tool for thought by which he means math notation."}, {"time": 618, "text": "And Ken and his son went on to do many things, but eventually they actually produced a new language that was built on top of all the learnings of APL."}, {"time": 628, "text": "And that was called J."}, {"time": 630, "text": "And J is the most expressive, composable language of beautifully designed language I've ever seen."}, {"time": 642, "text": "Does it have object oriented components?"}, {"time": 644, "text": "Does it have that kind of thing?"}, {"time": 645, "text": "Not really, it's an array oriented language."}, {"time": 647, "text": "It's the third path."}, {"time": 651, "text": "Are you saying array?"}, {"time": 652, "text": "Array oriented, yeah."}, {"time": 653, "text": "What does it mean to be array oriented?"}, {"time": 655, "text": "So array oriented means that you generally don't use any loops, but the whole thing is done with kind of a extreme version of broadcasting, if you're familiar with that NumPy slash Python concept."}, {"time": 669, "text": "So you do a lot with one line of code."}, {"time": 674, "text": "It looks a lot like math notation, highly compact."}, {"time": 679, "text": "And the idea is that you can kind of, because you can do so much with one line of code, a single screen of code is very unlikely to, you very rarely need more than that to express your program."}, {"time": 691, "text": "And so you can kind of keep it all in your head and you can kind of clearly communicate it."}, {"time": 696, "text": "It's interesting that APL created two main branches, K and J. J is this kind of like open source, niche community of crazy enthusiasts like me."}, {"time": 709, "text": "And then the other path, K, was fascinating."}, {"time": 712, "text": "It's an astonishingly expensive programming language, which many of the world's most ludicrously rich hedge funds use."}, {"time": 722, "text": "So the entire K machine is so small it sits inside level three cache on your CPU."}, {"time": 729, "text": "And it easily wins every benchmark I've ever seen in terms of data processing speed."}, {"time": 736, "text": "But you don't come across it very much because it's like $100,000 per CPU to run it."}, {"time": 742, "text": "It's like this path of programming languages is just so much, I don't know, so much more powerful in every way than the ones that almost anybody uses every day."}, {"time": 753, "text": "So it's all about computation."}, {"time": 757, "text": "It's really focused on computation."}, {"time": 758, "text": "It's pretty heavily focused on computation."}, {"time": 760, "text": "I mean, so much of programming is data processing by definition."}, {"time": 765, "text": "So there's a lot of things you can do with it."}, {"time": 768, "text": "But yeah, there's not much work being done on making like user interface toolkits or whatever."}, {"time": 777, "text": "I mean, there's some, but they're not great."}, {"time": 779, "text": "At the same time, you've done a lot of stuff with Perl and Python."}, {"time": 783, "text": "So where does that fit into the picture of J and K and APL?"}, {"time": 788, "text": "Well, it's just much more pragmatic."}, {"time": 791, "text": "Like in the end, you kind of have to end up where the libraries are, you know?"}, {"time": 797, "text": "Like, cause to me, my focus is on productivity."}, {"time": 801, "text": "I just want to get stuff done and solve problems."}, {"time": 803, "text": "So Perl was great."}, {"time": 807, "text": "I created an email company called FastMail and Perl was great cause back in the late nineties, early two thousands, it just had a lot of stuff it could do."}, {"time": 818, "text": "I still had to write my own monitoring system and my own web framework, my own whatever, cause like none of that stuff existed."}, {"time": 825, "text": "But it was a super flexible language to do that in."}, {"time": 830, "text": "And you used Perl for FastMail, you used it as a backend?"}, {"time": 834, "text": "Like so everything was written in Perl?"}, {"time": 835, "text": "Yeah, yeah, everything, everything was Perl."}, {"time": 838, "text": "Why do you think Perl hasn't succeeded or hasn't dominated the market where Python really takes over a lot of the tasks?"}, {"time": 847, "text": "Well, I mean, Perl did dominate."}, {"time": 849, "text": "It was everything, everywhere, but then the guy that ran Perl, Larry Wohl, kind of just didn't put the time in anymore."}, {"time": 862, "text": "And no project can be successful if there isn't, you know, particularly one that started with a strong leader that loses that strong leadership."}, {"time": 875, "text": "So then Python has kind of replaced it."}, {"time": 877, "text": "You know, Python is a lot less elegant language in nearly every way, but it has the data science libraries and a lot of them are pretty great."}, {"time": 891, "text": "So I kind of use it cause it's the best we have, but it's definitely not good enough."}, {"time": 901, "text": "But what do you think the future of programming looks like?"}, {"time": 904, "text": "What do you hope the future of programming looks like if we zoom in on the computational fields, on data science, on machine learning?"}, {"time": 911, "text": "I hope Swift is successful because the goal of Swift, the way Chris Latner describes it, is to be infinitely hackable."}, {"time": 922, "text": "And that's what I want."}, {"time": 923, "text": "I want something where me and the people I do research with and my students can look at and change everything from top to bottom."}, {"time": 932, "text": "There's nothing mysterious and magical and inaccessible."}, {"time": 936, "text": "Unfortunately with Python, it's the opposite of that because Python is so slow."}, {"time": 940, "text": "It's extremely unhackable."}, {"time": 942, "text": "You get to a point where it's like, okay, from here on down at C. So your debugger doesn't work in the same way."}, {"time": 947, "text": "Your profiler doesn't work in the same way."}, {"time": 948, "text": "Your build system doesn't work in the same way."}, {"time": 950, "text": "It's really not very hackable at all."}, {"time": 953, "text": "What's the part you like to be hackable?"}, {"time": 955, "text": "Is it for the objective of optimizing training of neural networks, inference of neural networks?"}, {"time": 962, "text": "Is it performance of the system or is there some non performance related, just?"}, {"time": 969, "text": "I mean, in the end, I want to be productive as a practitioner."}, {"time": 973, "text": "So that means that, so like at the moment, our understanding of deep learning is incredibly primitive."}, {"time": 980, "text": "There's very little we understand."}, {"time": 981, "text": "Most things don't work very well, even though it works better than anything else out there."}, {"time": 986, "text": "There's so many opportunities to make it better."}, {"time": 988, "text": "So you look at any domain area, like, I don't know, speech recognition with deep learning or natural language processing classification with deep learning or whatever."}, {"time": 999, "text": "Every time I look at an area with deep learning, I always see like, oh, it's terrible."}, {"time": 1004, "text": "There's lots and lots of obviously stupid ways to do things that need to be fixed."}, {"time": 1010, "text": "So then I want to be able to jump in there and quickly experiment and make them better."}, {"time": 1014, "text": "You think the programming language has a role in that?"}, {"time": 1019, "text": "Huge role, yeah."}, {"time": 1020, "text": "So currently, Python has a big gap in terms of our ability to innovate, particularly around recurrent neural networks and natural language processing."}, {"time": 1034, "text": "Because it's so slow, the actual loop where we actually loop through words, we have to do that whole thing in CUDA C. So we actually can't innovate with the kernel, the heart of that most important algorithm."}, {"time": 1051, "text": "And it's just a huge problem."}, {"time": 1053, "text": "And this happens all over the place."}, {"time": 1056, "text": "So we hit research limitations."}, {"time": 1060, "text": "Another example, convolutional neural networks, which are actually the most popular architecture for lots of things, maybe most things in deep learning."}, {"time": 1068, "text": "We almost certainly should be using sparse convolutional neural networks, but only like two people are, because to do it, you have to rewrite all of that CUDA C level stuff."}, {"time": 1079, "text": "And yeah, just researchers and practitioners don't."}, {"time": 1084, "text": "So there's just big gaps in what people actually research on, what people actually implement because of the programming language problem."}, {"time": 1093, "text": "So you think it's just too difficult to write in CUDA C that a higher level programming language like Swift should enable the easier, fooling around creative stuff with RNNs or with sparse convolutional neural networks?"}, {"time": 1115, "text": "Who's at fault?"}, {"time": 1117, "text": "Who's at charge of making it easy for a researcher to play around?"}, {"time": 1122, "text": "I mean, no one's at fault, just nobody's got around to it yet, or it's just, it's hard, right?"}, {"time": 1126, "text": "And I mean, part of the fault is that we ignored that whole APL kind of direction."}, {"time": 1133, "text": "Nearly everybody did for 60 years, 50 years."}, {"time": 1137, "text": "But recently people have been starting to reinvent pieces of that and kind of create some interesting new directions in the compiler technology."}, {"time": 1147, "text": "So the place where that's particularly happening right now is something called MLIR, which is something that, again, Chris Latina, the Swift guy, is leading."}, {"time": 1158, "text": "And yeah, because it's actually not gonna be Swift on its own that solves this problem, because the problem is that currently writing a acceptably fast, you know, GPU program is too complicated regardless of what language you use."}, {"time": 1176, "text": "And that's just because if you have to deal with the fact that I've got, you know, 10,000 threads and I have to synchronize between them all and I have to put my thing into grid blocks and think about warps and all this stuff, it's just so much boilerplate that to do that well, you have to be a specialist at that and it's gonna be a year's work to, you know, optimize that algorithm in that way."}, {"time": 1199, "text": "But with things like tensor comprehensions and TILE and MLIR and TVM, there's all these various projects which are all about saying, let's let people create like domain specific languages for tensor computations."}, {"time": 1216, "text": "These are the kinds of things we do generally on the GPU for deep learning and then have a compiler which can optimize that tensor computation."}, {"time": 1228, "text": "A lot of this work is actually sitting on top of a project called Halide, which is a mind blowing project where they came up with such a domain specific language."}, {"time": 1238, "text": "In fact, two, one domain specific language for expressing this is what my tensor computation is and another domain specific language for expressing this is the kind of the way I want you to structure the compilation of that and like do it block by block and do these bits in parallel."}, {"time": 1254, "text": "And they were able to show how you can compress the amount of code by 10X compared to optimized GPU code and get the same performance."}, {"time": 1265, "text": "So that's like, so these other things are kind of sitting on top of that kind of research and MLIR is pulling a lot of those best practices together."}, {"time": 1275, "text": "And now we're starting to see work done on making all of that directly accessible through Swift so that I could use Swift to kind of write those domain specific languages and hopefully we'll get then Swift CUDA kernels written in a very expressive and concise way that looks a bit like J and APL and then Swift layers on top of that and then a Swift UI on top of that."}, {"time": 1298, "text": "And it'll be so nice if we can get to that point."}, {"time": 1302, "text": "Now does it all eventually boil down to CUDA and NVIDIA GPUs?"}, {"time": 1308, "text": "Unfortunately at the moment it does, but one of the nice things about MLIR if AMD ever gets their act together which they probably won't is that they or others could write MLIR backends for other GPUs or rather tensor computation devices of which today there are increasing number like Graph Core or Vertex AI or whatever."}, {"time": 1338, "text": "So yeah, being able to target lots of backends would be another benefit of this and the market really needs competition because at the moment NVIDIA is massively overcharging for their kind of enterprise class cards because there is no serious competition because nobody else is doing the software properly."}, {"time": 1359, "text": "In the cloud there is some competition, right?"}, {"time": 1361, "text": "But... Not really, other than TPUs perhaps, but TPUs are almost unprogrammable at the moment."}, {"time": 1368, "text": "So TPUs have the same problem that you can't?"}, {"time": 1371, "text": "It's even worse."}, {"time": 1372, "text": "So TPUs, Google actually made an explicit decision to make them almost entirely unprogrammable because they felt that there was too much IP in there and if they gave people direct access to program them, people would learn their secrets."}, {"time": 1384, "text": "So you can't actually directly program the memory in a TPU."}, {"time": 1391, "text": "You can't even directly create code that runs on and that you look at on the machine that has the TPU, it all goes through a virtual machine."}, {"time": 1399, "text": "So all you can really do is this kind of cookie cutter thing of like plug in high level stuff together, which is just super tedious and annoying and totally unnecessary."}, {"time": 1412, "text": "So what was the, tell me if you could, the origin story of fast AI."}, {"time": 1418, "text": "What is the motivation, its mission, its dream?"}, {"time": 1423, "text": "So I guess the founding story is heavily tied to my previous startup, which is a company called Analytic, which was the first company to focus on deep learning for medicine and I created that because I saw that was a huge opportunity to, there's about a 10X shortage of the number of doctors in the world, in the developing world that we need."}, {"time": 1448, "text": "I expected it would take about 300 years to train enough doctors to meet that gap."}, {"time": 1453, "text": "But I guess that maybe if we used deep learning for some of the analytics, we could maybe make it so you don't need as highly trained doctors."}, {"time": 1465, "text": "For diagnosis."}, {"time": 1466, "text": "For diagnosis and treatment planning."}, {"time": 1467, "text": "Where's the biggest benefit just before we get to fast AI, where's the biggest benefit of AI and medicine that you see today?"}, {"time": 1476, "text": "And maybe next time."}, {"time": 1477, "text": "Not much happening today in terms of like stuff that's actually out there, it's very early."}, {"time": 1525, "text": "So for example, in Africa, outside of South Africa, there's only five pediatric radiologists for the entire continent."}, {"time": 1532, "text": "So most countries don't have any."}, {"time": 1534, "text": "So if your kid is sick and they need something diagnosed through medical imaging, the person, even if you're able to get medical imaging done, the person that looks at it will be a nurse at best."}, {"time": 1546, "text": "But actually in India, for example, and China, almost no x rays are read by anybody, by any trained professional because they don't have enough."}, {"time": 1557, "text": "So if instead we had a algorithm that could take the most likely high risk 5% and say triage, basically say, okay, someone needs to look at this, it would massively change the kind of way that what's possible with medicine in the developing world."}, {"time": 1578, "text": "And remember, they have, increasingly they have money."}, {"time": 1581, "text": "They're the developing world, they're not the poor world, they're the developing world."}, {"time": 1584, "text": "So they have the money."}, {"time": 1585, "text": "So they're building the hospitals, they're getting the diagnostic equipment, but there's no way for a very long time will they be able to have the expertise."}, {"time": 1597, "text": "Shortage of expertise, okay."}, {"time": 1598, "text": "And that's where the deep learning systems can step in and magnify the expertise they do have."}, {"time": 1606, "text": "So you do see, just to linger a little bit longer, the interaction, do you still see the human experts still at the core of these systems?"}, {"time": 1618, "text": "Is there something in medicine that could be automated almost completely?"}, {"time": 1621, "text": "I don't see the point of even thinking about that because we have such a shortage of people."}, {"time": 1626, "text": "Why would we want to find a way not to use them?"}, {"time": 1629, "text": "We have people, so the idea of like, even from an economic point of view, if you can make them 10X more productive, getting rid of the person, doesn't impact your unit economics at all."}, {"time": 1641, "text": "And it totally ignores the fact that there are things people do better than machines."}, {"time": 1646, "text": "So it's just to me, that's not a useful way of framing the problem."}, {"time": 1652, "text": "I guess, just to clarify, I guess I meant there may be some problems where you can avoid even going to the expert ever, sort of maybe preventative care or some basic stuff, allowing food, allowing the expert to focus on the things that are really that, you know."}, {"time": 1669, "text": "Well, that's what the triage would do, right?"}, {"time": 1670, "text": "So the triage would say, okay, there's 99% sure there's nothing here."}, {"time": 1678, "text": "So that can be done on device and they can just say, okay, go home."}, {"time": 1683, "text": "So the experts are being used to look at the stuff which has some chance it's worth looking at, which most things it's not, it's fine."}, {"time": 1694, "text": "Why do you think that is?"}, {"time": 1695, "text": "You know, it's fine."}, {"time": 1696, "text": "Why do you think we haven't quite made progress on that yet in terms of the scale of how much AI is applied in the medical field?"}, {"time": 1707, "text": "Oh, there's a lot of reasons."}, {"time": 1708, "text": "I mean, one is it's pretty new."}, {"time": 1709, "text": "I only started in Liddick in like 2014."}, {"time": 1712, "text": "And before that, it's hard to express to what degree the medical world was not aware of the opportunities here."}, {"time": 1720, "text": "So I went to RSNA, which is the world's largest radiology conference."}, {"time": 1726, "text": "And I told everybody I could, you know, like I'm doing this thing with deep learning, please come and check it out."}, {"time": 1733, "text": "And no one had any idea what I was talking about and no one had any interest in it."}, {"time": 1739, "text": "So like we've come from absolute zero, which is hard."}, {"time": 1745, "text": "And then the whole regulatory framework, education system, everything is just set up to think of doctoring in a very different way."}, {"time": 1754, "text": "So today there is a small number of people who are deep learning practitioners and doctors at the same time."}, {"time": 1763, "text": "And we're starting to see the first ones come out of their PhD programs."}, {"time": 1766, "text": "So Zach Kahane over in Boston, Cambridge has a number of students now who are data science experts, deep learning experts, and actual medical doctors."}, {"time": 1783, "text": "Quite a few doctors have completed our fast AI course now and are publishing papers and creating journal reading groups in the American Council of Radiology."}, {"time": 1795, "text": "And like, it's just starting to happen, but it's gonna be a long time coming."}, {"time": 1799, "text": "It's gonna happen, but it's gonna be a long process."}, {"time": 1802, "text": "The regulators have to learn how to regulate this."}, {"time": 1804, "text": "They have to build guidelines."}, {"time": 1808, "text": "And then the lawyers at hospitals have to develop a new way of understanding that sometimes it makes sense for data to be looked at in raw form in large quantities in order to create well changing results."}, {"time": 1827, "text": "Yeah, so the regulation around data, all that, it sounds probably the hardest problem, but sounds reminiscent of autonomous vehicles as well."}, {"time": 1836, "text": "Many of the same regulatory challenges, many of the same data challenges."}, {"time": 1840, "text": "Yeah, I mean, funnily enough, the problem is less the regulation and more the interpretation of that regulation by lawyers in hospitals."}, {"time": 1848, "text": "So HIPAA is actually, was designed to pay, and HIPAA does not stand for privacy."}, {"time": 1856, "text": "It stands for portability."}, {"time": 1857, "text": "It's actually meant to be a way that data can be used."}, {"time": 1861, "text": "And it was created with lots of gray areas because the idea is that would be more practical and it would help people to use this legislation to actually share data in a more thoughtful way."}, {"time": 1873, "text": "Unfortunately, it's done the opposite because when a lawyer sees a gray area, they say, oh, if we don't know, we won't get sued, then we can't do it."}, {"time": 1882, "text": "So HIPAA is not exactly the problem."}, {"time": 1886, "text": "The problem is more that there's, hospital lawyers are not incented to make bold decisions about data portability."}, {"time": 1896, "text": "Or even to embrace technology that saves lives."}, {"time": 1900, "text": "They more want to not get in trouble for embracing that technology."}, {"time": 1904, "text": "It also saves lives in a very abstract way, which is like, oh, we've been able to release these 100,000 anonymized records."}, {"time": 1912, "text": "I can't point to the specific person whose life that saved."}, {"time": 1915, "text": "I can say like, oh, we ended up with this paper which found this result, which diagnosed a thousand more people than we would have otherwise, but it's like, which ones were helped?"}, {"time": 1925, "text": "It's very abstract."}, {"time": 1927, "text": "And on the counter side of that, you may be able to point to a life that was taken because of something that was."}, {"time": 1934, "text": "Yeah, or a person whose privacy was violated."}, {"time": 1938, "text": "It's like, oh, this specific person was deidentified."}, {"time": 1944, "text": "So, identified."}, {"time": 1945, "text": "Just a fascinating topic."}, {"time": 1947, "text": "We're jumping around."}, {"time": 1948, "text": "We'll get back to fast AI, but on the question of privacy, data is the fuel for so much innovation in deep learning."}, {"time": 1958, "text": "What's your sense on privacy?"}, {"time": 1959, "text": "Whether we're talking about Twitter, Facebook, YouTube, just the technologies like in the medical field that rely on people's data in order to create impact."}, {"time": 1973, "text": "How do we get that right, respecting people's privacy and yet creating technology that is learning from data?"}, {"time": 1983, "text": "One of my areas of focus is on doing more with less data."}, {"time": 1988, "text": "More with less data, which, so most vendors, unfortunately, are strongly incented to find ways to require more data and more computation."}, {"time": 2000, "text": "So, Google and IBM being the most obvious."}, {"time": 2004, "text": "IBM."}, {"time": 2005, "text": "Yeah, so Watson."}, {"time": 2007, "text": "So, Google and IBM both strongly push the idea that you have to be, that they have more data and more computation and more intelligent people than anybody else."}, {"time": 2017, "text": "And so you have to trust them to do things because nobody else can do it."}, {"time": 2022, "text": "And Google's very upfront about this, like Jeff Dean has gone out there and given talks and said, our goal is to require a thousand times more computation, but less people."}, {"time": 2035, "text": "Our goal is to use the people that you have better and the data you have better and the computation you have better."}, {"time": 2043, "text": "So, one of the things that we've discovered is, or at least highlighted, is that you very, very, very often don't need much data at all."}, {"time": 2053, "text": "And so the data you already have in your organization will be enough to get state of the art results."}, {"time": 2059, "text": "So, like my starting point would be to kind of say around privacy is a lot of people are looking for ways to share data and aggregate data, but I think often that's unnecessary."}, {"time": 2069, "text": "They assume that they need more data than they do because they're not familiar with the basics of transfer learning, which is this critical technique for needing orders of magnitude less data."}, {"time": 2082, "text": "Is your sense, one reason you might wanna collect data from everyone is like in the recommender system context, where your individual, Jeremy Howard's individual data is the most useful for providing a product that's impactful for you."}, {"time": 2099, "text": "So, for giving you advertisements, for recommending to you movies, for doing medical diagnosis, is your sense we can build with a small amount of data, general models that will have a huge impact for most people that we don't need to have data from each individual?"}, {"time": 2119, "text": "On the whole, I'd say yes."}, {"time": 2120, "text": "I mean, there are things like, you know, recommender systems have this cold start problem where, you know, Jeremy is a new customer, we haven't seen him before, so we can't recommend him things based on what else he's bought and liked with us."}, {"time": 2136, "text": "And there's various workarounds to that."}, {"time": 2138, "text": "Like in a lot of music programs, we'll start out by saying, which of these artists do you like?"}, {"time": 2144, "text": "Which of these albums do you like?"}, {"time": 2146, "text": "Which of these songs do you like?"}, {"time": 2149, "text": "Netflix used to do that, nowadays they tend not to."}, {"time": 2153, "text": "People kind of don't like that because they think, oh, we don't wanna bother the user."}, {"time": 2157, "text": "So, you could work around that by having some kind of data sharing where you get my marketing record from Axiom or whatever, and try to guess from that."}, {"time": 2166, "text": "To me, the benefit to me and to society of saving me five minutes on answering some questions versus the negative externalities of the privacy issue doesn't add up."}, {"time": 2184, "text": "So, I think like a lot of the time, the places where people are invading our privacy in order to provide convenience is really about just trying to make them more money and they move these negative externalities to places that they don't have to pay for them."}, {"time": 2204, "text": "So, when you actually see regulations appear that actually cause the companies that create these negative externalities to have to pay for it themselves, they say, well, we can't do it anymore."}, {"time": 2216, "text": "So, the cost is actually too high."}, {"time": 2218, "text": "But for something like medicine, yeah, I mean, the hospital has my medical imaging, my pathology studies, my medical records, and also I own my medical data."}, {"time": 2231, "text": "So, you can, so I help a startup called Doc.ai."}, {"time": 2236, "text": "One of the things Doc.ai does is that it has an app."}, {"time": 2239, "text": "You can connect to, you know, Sutter Health and LabCorp and Walgreens and download your medical data to your phone and then upload it again at your discretion to share it as you wish."}, {"time": 2255, "text": "So, with that kind of approach, we can share our medical information with the people we want to."}, {"time": 2264, "text": "Yeah, so control."}, {"time": 2265, "text": "I mean, really being able to control who you share it with and so on."}, {"time": 2269, "text": "So, that has a beautiful, interesting tangent to return back to the origin story of Fast.ai."}, {"time": 2279, "text": "Right, so before I started Fast.ai, I spent a year researching where are the biggest opportunities for deep learning?"}, {"time": 2290, "text": "Because I knew from my time at Kaggle in particular that deep learning had kind of hit this threshold point where it was rapidly becoming the state of the art approach in every area that looked at it."}, {"time": 2301, "text": "And I'd been working with neural nets for over 20 years."}, {"time": 2305, "text": "I knew that from a theoretical point of view, once it hit that point, it would do that in kind of just about every domain."}, {"time": 2311, "text": "And so I kind of spent a year researching what are the domains that's gonna have the biggest low hanging fruit in the shortest time period."}, {"time": 2319, "text": "I picked medicine, but there were so many I could have picked."}, {"time": 2323, "text": "And so there was a kind of level of frustration for me of like, okay, I'm really glad we've opened up the medical deep learning world."}, {"time": 2331, "text": "And today it's huge, as you know, but we can't do, I can't do everything."}, {"time": 2338, "text": "I don't even know, like in medicine, it took me a really long time to even get a sense of like what kind of problems do medical practitioners solve?"}, {"time": 2345, "text": "What kind of data do they have?"}, {"time": 2346, "text": "Who has that data?"}, {"time": 2348, "text": "So I kind of felt like I need to approach this differently if I wanna maximize the positive impact of deep learning."}, {"time": 2356, "text": "Rather than me picking an area and trying to become good at it and building something, I should let people who are already domain experts in those areas and who already have the data do it themselves."}, {"time": 2369, "text": "So that was the reason for Fast.ai is to basically try and figure out how to get deep learning into the hands of people who could benefit from it and help them to do so in as quick and easy and effective a way as possible."}, {"time": 2387, "text": "Got it, so sort of empower the domain experts."}, {"time": 2390, "text": "Yeah, and like partly it's because like, unlike most people in this field, my background is very applied and industrial."}, {"time": 2399, "text": "Like my first job was at McKinsey & Company."}, {"time": 2402, "text": "I spent 10 years in management consulting."}, {"time": 2404, "text": "I spend a lot of time with domain experts."}, {"time": 2410, "text": "So I kind of respect them and appreciate them."}, {"time": 2412, "text": "And I know that's where the value generation in society is."}, {"time": 2416, "text": "And so I also know how most of them can't code and most of them don't have the time to invest three years in a graduate degree or whatever."}, {"time": 2429, "text": "So I was like, how do I upskill those domain experts?"}, {"time": 2433, "text": "I think that would be a super powerful thing, the biggest societal impact I could have."}, {"time": 2440, "text": "So yeah, that was the thinking."}, {"time": 2441, "text": "So much of Fast.ai students and researchers and the things you teach are pragmatically minded, practically minded, figuring out ways how to solve real problems and fast."}, {"time": 2455, "text": "So from your experience, what's the difference between theory and practice of deep learning?"}, {"time": 2463, "text": "Well, most of the research in the deep learning world is a total waste of time."}, {"time": 2469, "text": "Right, that's what I was getting at."}, {"time": 2472, "text": "It's a problem in science in general."}, {"time": 2476, "text": "Scientists need to be published, which means they need to work on things that their peers are extremely familiar with and can recognize in advance in that area."}, {"time": 2486, "text": "So that means that they all need to work on the same thing."}, {"time": 2490, "text": "And so it really, and the thing they work on, there's nothing to encourage them to work on things that are practically useful."}, {"time": 2498, "text": "So you get just a whole lot of research, which is minor advances and stuff that's been very highly studied and has no significant practical impact."}, {"time": 2509, "text": "Whereas the things that really make a difference, like I mentioned transfer learning, like if we can do better at transfer learning, then it's this like world changing thing where suddenly like lots more people can do world class work with less resources and less data."}, {"time": 2526, "text": "But almost nobody works on that."}, {"time": 2528, "text": "Or another example, active learning, which is the study of like, how do we get more out of the human beings in the loop?"}, {"time": 2535, "text": "That's my favorite topic."}, {"time": 2537, "text": "Yeah, so active learning is great, but it's almost nobody working on it because it's just not a trendy thing right now."}, {"time": 2543, "text": "You know what somebody, sorry to interrupt, you're saying that nobody is publishing on active learning, but there's people inside companies, anybody who actually has to solve a problem, they're going to innovate on active learning."}, {"time": 2559, "text": "Yeah, everybody kind of reinvents active learning when they actually have to work in practice because they start labeling things and they think, gosh, this is taking a long time and it's very expensive."}, {"time": 2569, "text": "And then they start thinking, well, why am I labeling everything?"}, {"time": 2572, "text": "I'm only, the machine's only making mistakes on those two classes."}, {"time": 2576, "text": "They're the hard ones."}, {"time": 2576, "text": "Maybe I'll just start labeling those two classes."}, {"time": 2578, "text": "And then you start thinking, well, why did I do that manually?"}, {"time": 2581, "text": "Why can't I just get the system to tell me which things are going to be hardest?"}, {"time": 2585, "text": "It's an obvious thing to do, but yeah, it's just like transfer learning."}, {"time": 2591, "text": "It's understudied and the academic world just has no reason to care about practical results."}, {"time": 2597, "text": "The funny thing is, like I've only really ever written one paper."}, {"time": 2599, "text": "I hate writing papers."}, {"time": 2601, "text": "And I didn't even write it."}, {"time": 2602, "text": "It was my colleague, Sebastian Ruder, who actually wrote it."}, {"time": 2605, "text": "I just did the research for it, but it was basically introducing transfer learning, successful transfer learning to NLP for the first time."}, {"time": 2614, "text": "The algorithm is called ULM fit."}, {"time": 2616, "text": "And it actually, I actually wrote it for the course, for the Fast AI course."}, {"time": 2623, "text": "I wanted to teach people NLP and I thought, I only want to teach people practical stuff."}, {"time": 2627, "text": "And I think the only practical stuff is transfer learning."}, {"time": 2630, "text": "And I couldn't find any examples of transfer learning in NLP."}, {"time": 2633, "text": "So I just did it."}, {"time": 2634, "text": "And I was shocked to find that as soon as I did it, which, you know, the basic prototype took a couple of days, smashed the state of the art on one of the most important data sets in a field that I knew nothing about."}, {"time": 2646, "text": "And I just thought, well, this is ridiculous."}, {"time": 2650, "text": "And so I spoke to Sebastian about it and he kindly offered to write it up, the results."}, {"time": 2657, "text": "And so it ended up being published in ACL, which is the top computational linguistics conference."}, {"time": 2665, "text": "So like people do actually care once you do it, but I guess it's difficult for maybe like junior researchers or like, I don't care whether I get citations or papers or whatever."}, {"time": 2677, "text": "There's nothing in my life that makes that important, which is why I've never actually bothered to write a paper myself."}, {"time": 2683, "text": "But for people who do, I guess they have to pick the kind of safe option, which is like, yeah, make a slight improvement on something that everybody's already working on."}, {"time": 2694, "text": "Yeah, nobody does anything interesting or succeeds in life with the safe option."}, {"time": 2701, "text": "Although, I mean, the nice thing is, nowadays everybody is now working on NLP transfer learning because since that time we've had GPT and GPT2 and BERT, and, you know, it's like, it's, so yeah, once you show that something's possible, everybody jumps in, I guess, so."}, {"time": 2717, "text": "I hope to be a part of, and I hope to see more innovation and active learning in the same way."}, {"time": 2722, "text": "I think transfer learning and active learning are fascinating, public, open work."}, {"time": 2727, "text": "I actually helped start a startup called Platform AI, which is really all about active learning."}, {"time": 2731, "text": "And yeah, it's been interesting trying to kind of see what research is out there and make the most of it."}, {"time": 2737, "text": "And there's basically none."}, {"time": 2739, "text": "So we've had to do all our own research."}, {"time": 2741, "text": "Once again, and just as you described."}, {"time": 2744, "text": "Can you tell the story of the Stanford competition, Dawn Bench, and FastAI's achievement on it?"}, {"time": 2751, "text": "Sure, so something which I really enjoy is that I basically teach two courses a year, the Practical Deep Learning for Coders, which is kind of the introductory course, and then Cutting Edge Deep Learning for Coders, which is the kind of research level course."}, {"time": 2768, "text": "And while I teach those courses, I basically have a big office at the University of San Francisco, big enough for like 30 people."}, {"time": 2779, "text": "And I invite anybody, any student who wants to come and hang out with me while I build the course."}, {"time": 2785, "text": "And so generally it's full."}, {"time": 2786, "text": "And so we have 20 or 30 people in a big office with nothing to do but study deep learning."}, {"time": 2793, "text": "So it was during one of these times that somebody in the group said, oh, there's a thing called Dawn Bench that looks interesting."}, {"time": 2801, "text": "And I was like, what the hell is that?"}, {"time": 2802, "text": "And they set out some competition to see how quickly you can train a model."}, {"time": 2806, "text": "Seems kind of, not exactly relevant to what we're doing, but it sounds like the kind of thing which you might be interested in."}, {"time": 2812, "text": "And I checked it out and I was like, oh crap, there's only 10 days till it's over."}, {"time": 2815, "text": "It's too late."}, {"time": 2818, "text": "And we're kind of busy trying to teach this course."}, {"time": 2820, "text": "But we're like, oh, it would make an interesting case study for the course."}, {"time": 2826, "text": "It's like, it's all the stuff we're already doing."}, {"time": 2828, "text": "Why don't we just put together our current best practices and ideas?"}, {"time": 2832, "text": "So me and I guess about four students just decided to give it a go."}, {"time": 2837, "text": "And we focused on this small one called Cifar 10, which is little 32 by 32 pixel images."}, {"time": 2844, "text": "Can you say what Dawn Bench is?"}, {"time": 2846, "text": "Yeah, so it's a competition to train a model as fast as possible."}, {"time": 2849, "text": "It was run by Stanford."}, {"time": 2850, "text": "And it's cheap as possible too."}, {"time": 2852, "text": "That's also another one for as cheap as possible."}, {"time": 2854, "text": "And there was a couple of categories, ImageNet and Cifar 10."}, {"time": 2858, "text": "So ImageNet is this big 1.3 million image thing that took a couple of days to train."}, {"time": 2865, "text": "Remember a friend of mine, Pete Warden, who's now at Google."}, {"time": 2871, "text": "I remember he told me how he trained ImageNet a few years ago when he basically like had this little granny flat out the back that he turned into his ImageNet training center."}, {"time": 2881, "text": "And he figured, you know, after like a year of work, he figured out how to train it in like 10 days or something."}, {"time": 2887, "text": "It's like, that was a big job."}, {"time": 2888, "text": "Whereas Cifar 10, at that time, you could train in a few hours."}, {"time": 2892, "text": "You know, it's much smaller and easier."}, {"time": 2894, "text": "So we thought we'd try Cifar 10."}, {"time": 2898, "text": "And yeah, I've really never done that before."}, {"time": 2903, "text": "Like I'd never really, like things like using more than one GPU at a time was something I tried to avoid."}, {"time": 2909, "text": "Cause to me, it's like very against the whole idea of accessibility is should better do things with one GPU."}, {"time": 2915, "text": "I mean, have you asked in the past before, after having accomplished something, how do I do this faster, much faster?"}, {"time": 2922, "text": "Oh, always, but it's always, for me, it's always how do I make it much faster on a single GPU that a normal person could afford in their day to day life."}, {"time": 2930, "text": "It's not how could I do it faster by, you know, having a huge data center."}, {"time": 2935, "text": "Cause to me, it's all about like, as many people should better use something as possible without fussing around with infrastructure."}, {"time": 2944, "text": "So anyways, in this case it's like, well, we can use eight GPUs just by renting a AWS machine."}, {"time": 2950, "text": "So we thought we'd try that."}, {"time": 2951, "text": "And yeah, basically using the stuff we were already doing, we were able to get, you know, the speed, you know, within a few days we had the speed down to, I don't know, a very small number of minutes."}, {"time": 2966, "text": "I can't remember exactly how many minutes it was, but it might've been like 10 minutes or something."}, {"time": 2971, "text": "And so, yeah, we found ourselves at the top of the leaderboard easily for both time and money, which really shocked me cause the other people competing in this were like Google and Intel and stuff who I like know a lot more about this stuff than I think we do."}, {"time": 2985, "text": "So then we were emboldened."}, {"time": 2986, "text": "We thought let's try the ImageNet one too."}, {"time": 2990, "text": "I mean, it seemed way out of our league, but our goal was to get under 12 hours."}, {"time": 2995, "text": "And we did, which was really exciting."}, {"time": 2999, "text": "But we didn't put anything up on the leaderboard, but we were down to like 10 hours."}, {"time": 3003, "text": "But then Google put in like five hours or something and we're just like, oh, we're so screwed."}, {"time": 3013, "text": "But we kind of thought, we'll keep trying."}, {"time": 3016, "text": "You know, if Google can do it in five, I mean, Google did on five hours on something on like a TPU pod or something, like a lot of hardware."}, {"time": 3023, "text": "But we kind of like had a bunch of ideas to try."}, {"time": 3026, "text": "Like a really simple thing was why are we using these big images?"}, {"time": 3030, "text": "They're like 224 or 256 by 256 pixels."}, {"time": 3035, "text": "You know, why don't we try smaller ones?"}, {"time": 3037, "text": "And just to elaborate, there's a constraint on the accuracy that your trained model is supposed to achieve, right?"}, {"time": 3043, "text": "Yeah, you gotta achieve 93%, I think it was, for ImageNet, exactly."}, {"time": 3049, "text": "Which is very tough, so you have to."}, {"time": 3051, "text": "Yeah, 93%, like they picked a good threshold."}, {"time": 3054, "text": "It was a little bit higher than what the most commonly used ResNet 50 model could achieve at that time."}, {"time": 3063, "text": "So yeah, so it's quite a difficult problem to solve."}, {"time": 3068, "text": "But yeah, we realized if we actually just use 64 by 64 images, it trained a pretty good model."}, {"time": 3076, "text": "And then we could take that same model and just give it a couple of epochs to learn 224 by 224 images."}, {"time": 3081, "text": "And it was basically already trained."}, {"time": 3084, "text": "It makes a lot of sense."}, {"time": 3085, "text": "Like if you teach somebody, like here's what a dog looks like and you show them low res versions, and then you say, here's a really clear picture of a dog, they already know what a dog looks like."}, {"time": 3095, "text": "So that like just, we jumped to the front and we ended up winning parts of that competition."}, {"time": 3103, "text": "We actually ended up doing a distributed version over multiple machines a couple of months later and ended up at the top of the leaderboard."}, {"time": 3111, "text": "We had 18 minutes."}, {"time": 3113, "text": "ImageNet."}, {"time": 3113, "text": "Yeah, and it was, and people have just kept on blasting through again and again since then, so."}, {"time": 3120, "text": "So what's your view on multi GPU or multiple machine training in general as a way to speed code up?"}, {"time": 3129, "text": "I think it's largely a waste of time."}, {"time": 3131, "text": "Both of them."}, {"time": 3133, "text": "Both multi GPU on a single machine and."}, {"time": 3135, "text": "Yeah, particularly multi machines, cause it's just clunky."}, {"time": 3141, "text": "Multi GPUs is less clunky than it used to be, but to me anything that slows down your iteration speed is a waste of time."}, {"time": 3151, "text": "So you could maybe do your very last, you know, perfecting of the model on multi GPUs if you need to, but."}, {"time": 3160, "text": "So for example, I think doing stuff on ImageNet is generally a waste of time."}, {"time": 3166, "text": "Why test things on 1.3 million images?"}, {"time": 3168, "text": "Most of us don't use 1.3 million images."}, {"time": 3171, "text": "And we've also done research that shows that doing things on a smaller subset of images gives you the same relative answers anyway."}, {"time": 3179, "text": "So from a research point of view, why waste that time?"}, {"time": 3182, "text": "So actually I released a couple of new data sets recently."}, {"time": 3186, "text": "One is called ImageNet, the French ImageNet, which is a small subset of ImageNet, which is designed to be easy to classify."}, {"time": 3195, "text": "What's, how do you spell ImageNet?"}, {"time": 3197, "text": "It's got an extra T and E at the end, cause it's very French."}, {"time": 3200, "text": "And then another one called ImageWolf, which is a subset of ImageNet that only contains dog breeds."}, {"time": 3209, "text": "And that's a hard one, right?"}, {"time": 3211, "text": "That's a hard one."}, {"time": 3211, "text": "And I've discovered that if you just look at these two subsets, you can train things on a single GPU in 10 minutes."}, {"time": 3219, "text": "And the results you get are directly transferable to ImageNet nearly all the time."}, {"time": 3224, "text": "And so now I'm starting to see some researchers start to use these much smaller data sets."}, {"time": 3228, "text": "I so deeply love the way you think, because I think you might've written a blog post saying that sort of going these big data sets is encouraging people to not think creatively."}, {"time": 3244, "text": "So you're too, it sort of constrains you to train on large resources."}, {"time": 3249, "text": "And because you have these resources, you think more research will be better."}, {"time": 3253, "text": "And then you start, so like somehow you kill the creativity."}, {"time": 3257, "text": "Yeah, and even worse than that, Lex, I keep hearing from people who say, I decided not to get into deep learning because I don't believe it's accessible to people outside of Google to do useful work."}, {"time": 3268, "text": "So like I see a lot of people make an explicit decision to not learn this incredibly valuable tool because they've drunk the Google Koolaid, which is that only Google's big enough and smart enough to do it."}, {"time": 3282, "text": "And I just find that so disappointing and it's so wrong."}, {"time": 3285, "text": "And I think all of the major breakthroughs in AI in the next 20 years will be doable on a single GPU."}, {"time": 3293, "text": "Like I would say, my sense is all the big sort of."}, {"time": 3297, "text": "Well, let's put it this way."}, {"time": 3298, "text": "None of the big breakthroughs of the last 20 years have required multiple GPUs."}, {"time": 3301, "text": "So like batch norm, ReLU, Dropout."}, {"time": 3305, "text": "To demonstrate that there's something to them."}, {"time": 3308, "text": "Every one of them, none of them has required multiple GPUs."}, {"time": 3311, "text": "GANs, the original GANs didn't require multiple GPUs."}, {"time": 3315, "text": "Well, and we've actually recently shown that you don't even need GANs."}, {"time": 3319, "text": "So we've developed GAN level outcomes without needing GANs."}, {"time": 3324, "text": "And we can now do it with, again, by using transfer learning, we can do it in a couple of hours on a single GPU."}, {"time": 3330, "text": "You're just using a generator model without the adversarial part?"}, {"time": 3332, "text": "Yeah, so we've found loss functions that work super well without the adversarial part."}, {"time": 3338, "text": "And then one of our students, a guy called Jason Antich, has created a system called dealtify, which uses this technique to colorize old black and white movies."}, {"time": 3348, "text": "You can do it on a single GPU, colorize a whole movie in a couple of hours."}, {"time": 3352, "text": "And one of the things that Jason and I did together was we figured out how to add a little bit of GAN at the very end, which it turns out for colorization makes it just a bit brighter and nicer."}, {"time": 3365, "text": "And then Jason did masses of experiments to figure out exactly how much to do, but it's still all done on his home machine on a single GPU in his lounge room."}, {"time": 3375, "text": "And if you think about colorizing Hollywood movies, that sounds like something a huge studio would have to do, but he has the world's best results on this."}, {"time": 3385, "text": "There's this problem of microphones."}, {"time": 3387, "text": "We're just talking to microphones now."}, {"time": 3389, "text": "It's such a pain in the ass to have these microphones to get good quality audio."}, {"time": 3394, "text": "And I tried to see if it's possible to plop down a bunch of cheap sensors and reconstruct higher quality audio from multiple sources."}, {"time": 3401, "text": "Because right now I haven't seen the work from, okay, we can say even expensive mics automatically combining audio from multiple sources to improve the combined audio."}, {"time": 3412, "text": "People haven't done that."}, {"time": 3413, "text": "And that feels like a learning problem."}, {"time": 3415, "text": "So hopefully somebody can."}, {"time": 3416, "text": "Well, I mean, it's evidently doable and it should have been done by now."}, {"time": 3421, "text": "I felt the same way about computational photography four years ago."}, {"time": 3425, "text": "Why are we investing in big lenses when three cheap lenses plus actually a little bit of intentional movement, so like take a few frames, gives you enough information to get excellent subpixel resolution, which particularly with deep learning, you would know exactly what you meant to be looking at."}, {"time": 3445, "text": "We can totally do the same thing with audio."}, {"time": 3448, "text": "I think it's madness that it hasn't been done yet."}, {"time": 3450, "text": "Is there progress on the photography company?"}, {"time": 3453, "text": "Yeah, photography is basically standard now."}, {"time": 3456, "text": "So the Google Pixel Night Light, I don't know if you've ever tried it, but it's astonishing."}, {"time": 3463, "text": "You take a picture in almost pitch black and you get back a very high quality image."}, {"time": 3469, "text": "And it's not because of the lens."}, {"time": 3471, "text": "Same stuff with like adding the bokeh to the background blurring, it's done computationally."}, {"time": 3477, "text": "This is the pixel right here."}, {"time": 3478, "text": "Yeah, basically everybody now is doing most of the fanciest stuff on their phones with computational photography and also increasingly people are putting more than one lens on the back of the camera."}, {"time": 3491, "text": "So the same will happen for audio for sure."}, {"time": 3494, "text": "And there's applications in the audio side."}, {"time": 3496, "text": "If you look at an Alexa type device, most people I've seen, especially I worked at Google before, when you look at noise background removal, you don't think of multiple sources of audio."}, {"time": 3509, "text": "You don't play with that as much as I would hope people would."}, {"time": 3511, "text": "But I mean, you can still do it even with one."}, {"time": 3513, "text": "Like again, not much work's been done in this area."}, {"time": 3516, "text": "So we're actually gonna be releasing an audio library soon, which hopefully will encourage development of this because it's so underused."}, {"time": 3523, "text": "The basic approach we used for our super resolution and which Jason uses for dealtify of generating high quality images, the exact same approach would work for audio."}, {"time": 3533, "text": "No one's done it yet, but it would be a couple of months work."}, {"time": 3537, "text": "Okay, also learning rate in terms of Dawn Bench."}, {"time": 3541, "text": "There's some magic on learning rate that you played around with that's kind of interesting."}, {"time": 3545, "text": "Yeah, so this is all work that came from a guy called Leslie Smith."}, {"time": 3549, "text": "Leslie's a researcher who, like us, cares a lot about just the practicalities of training neural networks quickly and accurately, which I think is what everybody should care about, but almost nobody does."}, {"time": 3564, "text": "And he discovered something very interesting, which he calls super convergence, which is there are certain networks that with certain settings of high parameters could suddenly be trained 10 times faster by using a 10 times higher learning rate."}, {"time": 3579, "text": "Now, no one published that paper because it's not an area of kind of active research in the academic world."}, {"time": 3590, "text": "No academics recognize that this is important."}, {"time": 3592, "text": "And also deep learning in academia is not considered a experimental science."}, {"time": 3599, "text": "So unlike in physics where you could say like, I just saw a subatomic particle do something which the theory doesn't explain, you could publish that without an explanation."}, {"time": 3610, "text": "And then in the next 60 years, people can try to work out how to explain it."}, {"time": 3614, "text": "We don't allow this in the deep learning world."}, {"time": 3616, "text": "So it's literally impossible for Leslie to publish a paper that says, I've just seen something amazing happen."}, {"time": 3623, "text": "This thing trained 10 times faster than it should have."}, {"time": 3625, "text": "I don't know why."}, {"time": 3627, "text": "And so the reviewers were like, well, you can't publish that because you don't know why."}, {"time": 3631, "text": "That's important to pause on because there's so many discoveries that would need to start like that."}, {"time": 3636, "text": "Every other scientific field I know of works that way."}, {"time": 3639, "text": "I don't know why ours is uniquely disinterested in publishing unexplained experimental results, but there it is."}, {"time": 3648, "text": "So it wasn't published."}, {"time": 3651, "text": "Having said that, I read a lot more unpublished papers than published papers because that's where you find the interesting insights."}, {"time": 3660, "text": "So I absolutely read this paper."}, {"time": 3662, "text": "And I was just like, this is astonishingly mind blowing and weird and awesome."}, {"time": 3669, "text": "And like, why isn't everybody only talking about this?"}, {"time": 3672, "text": "Because like, if you can train these things 10 times faster, they also generalize better because you're doing less epochs, which means you look at the data less, you get better accuracy."}, {"time": 3682, "text": "So I've been kind of studying that ever since."}, {"time": 3684, "text": "And eventually Leslie kind of figured out a lot of how to get this done."}, {"time": 3690, "text": "And we added minor tweaks."}, {"time": 3692, "text": "And a big part of the trick is starting at a very low learning rate, very gradually increasing it."}, {"time": 3697, "text": "So as you're training your model, you would take very small steps at the start and you gradually make them bigger and bigger until eventually you're taking much bigger steps than anybody thought was possible."}, {"time": 3709, "text": "There's a few other little tricks to make it work, but basically we can reliably get super convergence."}, {"time": 3715, "text": "And so for the Dawn Bench thing, we were using just much higher learning rates than people expected to work."}, {"time": 3722, "text": "What do you think the future of, I mean, it makes so much sense for that to be a critical hyperparameter learning rate that you vary."}, {"time": 3728, "text": "What do you think the future of learning rate magic looks like?"}, {"time": 3733, "text": "Well, there's been a lot of great work in the last 12 months in this area."}, {"time": 3737, "text": "And people are increasingly realizing that optimize, like we just have no idea really how optimizers work."}, {"time": 3743, "text": "And the combination of weight decay, which is how we regularize optimizers, and the learning rate, and then other things like the epsilon we use in the Adam optimizer, they all work together in weird ways."}, {"time": 3756, "text": "And different parts of the model, this is another thing we've done a lot of work on is research into how different parts of the model should be trained at different rates in different ways."}, {"time": 3766, "text": "So we do something we call discriminative learning rates, which is really important, particularly for transfer learning."}, {"time": 3773, "text": "So really, I think in the last 12 months, a lot of people have realized that all this stuff is important."}, {"time": 3777, "text": "There's been a lot of great work coming out and we're starting to see algorithms appear, which have very, very few dials, if any, that you have to touch."}, {"time": 3787, "text": "So I think what's gonna happen is the idea of a learning rate, well, it almost already has disappeared in the latest research."}, {"time": 3794, "text": "And instead, it's just like we know enough about how to interpret the gradients and the change of gradients we see to know how to set every parameter in an optimal way."}, {"time": 3806, "text": "So you see the future of deep learning where really, where's the input of a human expert needed?"}, {"time": 3814, "text": "Well, hopefully the input of a human expert will be almost entirely unneeded from the deep learning point of view."}, {"time": 3820, "text": "So again, like Google's approach to this is to try and use thousands of times more compute to run lots and lots of models at the same time and hope that one of them is good."}, {"time": 3831, "text": "AutoML kind of thing?"}, {"time": 3831, "text": "Yeah, AutoML kind of stuff, which I think is insane."}, {"time": 3836, "text": "When you better understand the mechanics of how models learn, you don't have to try a thousand different models to find which one happens to work the best."}, {"time": 3871, "text": "Yeah, the data side."}, {"time": 3872, "text": "How often do you work with data these days in terms of the cleaning, looking at it?"}, {"time": 3877, "text": "Like Darwin looked at different species while traveling about."}, {"time": 3882, "text": "Do you look at data?"}, {"time": 3885, "text": "Have you in your roots in Kaggle?"}, {"time": 3888, "text": "Always, yeah."}, {"time": 3888, "text": "Look at data."}, {"time": 3889, "text": "Yeah, I mean, it's a key part of our course."}, {"time": 3891, "text": "It's like before we train a model in the course, we see how to look at the data."}, {"time": 3895, "text": "And then the first thing we do after we train our first model, which we fine tune an ImageNet model for five minutes."}, {"time": 3900, "text": "And then the thing we immediately do after that is we learn how to analyze the results of the model by looking at examples of misclassified images and looking at a classification matrix, and then doing research on Google to learn about the kinds of things that it's misclassifying."}, {"time": 3918, "text": "So to me, one of the really cool things about machine learning models in general is that when you interpret them, they tell you about things like what are the most important features, which groups are you misclassifying, and they help you become a domain expert more quickly because you can focus your time on the bits that the model is telling you is important."}, {"time": 3938, "text": "So it lets you deal with things like data leakage, for example, if it says, oh, the main feature I'm looking at is customer ID."}, {"time": 3945, "text": "And you're like, oh, customer ID should be predictive."}, {"time": 3947, "text": "And then you can talk to the people that manage customer IDs and they'll tell you like, oh yes, as soon as a customer's application is accepted, we add a one on the end of their customer ID or something."}, {"time": 3961, "text": "So yeah, looking at data, particularly from the lens of which parts of the data the model says is important is super important."}, {"time": 3969, "text": "Yeah, and using the model to almost debug the data to learn more about the data."}, {"time": 3976, "text": "What are the different cloud options for training your own networks?"}, {"time": 3980, "text": "Last question related to DawnBench."}, {"time": 3981, "text": "Well, it's part of a lot of the work you do, but from a perspective of performance, I think you've written this in a blog post."}, {"time": 3989, "text": "There's AWS, there's TPU from Google."}, {"time": 3993, "text": "What the future holds?"}, {"time": 3994, "text": "What would you recommend now in terms of training?"}, {"time": 3997, "text": "So from a hardware point of view, Google's TPUs and the best Nvidia GPUs are similar."}, {"time": 4005, "text": "I mean, maybe the TPUs are like 30% faster, but they're also much harder to program."}, {"time": 4009, "text": "There isn't a clear leader in terms of hardware right now, although much more importantly, the Nvidia GPUs are much more programmable."}, {"time": 4019, "text": "They've got much more written for all of them."}, {"time": 4020, "text": "So like that's the clear leader for me and where I would spend my time as a researcher and practitioner."}, {"time": 4028, "text": "But then in terms of the platform, I mean, we're super lucky now with stuff like Google GCP, Google Cloud, and AWS that you can access a GPU pretty quickly and easily."}, {"time": 4045, "text": "But I mean, for AWS, it's still too hard."}, {"time": 4048, "text": "Like you have to find an AMI and get the instance running and then install the software you want and blah, blah, blah."}, {"time": 4057, "text": "GCP is currently the best way to get started on a full server environment because they have a fantastic fast AI in PyTorch ready to go instance, which has all the courses preinstalled."}, {"time": 4071, "text": "It has Jupyter Notebook pre running."}, {"time": 4073, "text": "Jupyter Notebook is this wonderful interactive computing system, which everybody basically should be using for any kind of data driven research."}, {"time": 4082, "text": "But then even better than that, there are platforms like Salamander, which we own and Paperspace, where literally you click a single button and it pops up a Jupyter Notebook straight away without any kind of installation or anything."}, {"time": 4102, "text": "And all the course notebooks are all preinstalled."}, {"time": 4105, "text": "So like for me, this is one of the things we spent a lot of time kind of curating and working on."}, {"time": 4114, "text": "Because when we first started our courses, the biggest problem was people dropped out of lesson one because they couldn't get an AWS instance running."}, {"time": 4122, "text": "So things are so much better now."}, {"time": 4124, "text": "And like we actually have, if you go to course.fast.ai, the first thing it says is here's how to get started with your GPU."}, {"time": 4130, "text": "And there's like, you just click on the link and you click start and you're going."}, {"time": 4135, "text": "You'll go GCP."}, {"time": 4136, "text": "I have to confess, I've never used the Google GCP."}, {"time": 4138, "text": "Yeah, GCP gives you $300 of compute for free, which is really nice."}, {"time": 4143, "text": "But as I say, Salamander and Paperspace are even easier still."}, {"time": 4150, "text": "So from the perspective of deep learning frameworks, you work with fast.ai, if you go to this framework, and PyTorch and TensorFlow."}, {"time": 4161, "text": "What are the strengths of each platform in your perspective?"}, {"time": 4165, "text": "So in terms of what we've done our research on and taught in our course, we started with Theano and Keras, and then we switched to TensorFlow and Keras, and then we switched to PyTorch, and then we switched to PyTorch and fast.ai."}, {"time": 4182, "text": "And that kind of reflects a growth and development of the ecosystem of deep learning libraries."}, {"time": 4192, "text": "Theano and TensorFlow were great, but were much harder to teach and to do research and development on because they define what's called a computational graph upfront, a static graph, where you basically have to say, here are all the things that I'm gonna eventually do in my model, and then later on you say, okay, do those things with this data."}, {"time": 4215, "text": "And you can't like debug them, you can't do them step by step, you can't program them interactively in a Jupyter notebook and so forth."}, {"time": 4222, "text": "PyTorch was not the first, but PyTorch was certainly the strongest entrant to come along and say, let's not do it that way, let's just use normal Python."}, {"time": 4231, "text": "And everything you know about in Python is just gonna work, and we'll figure out how to make that run on the GPU as and when necessary."}, {"time": 4240, "text": "That turned out to be a huge leap in terms of what we could do with our research and what we could do with our teaching."}, {"time": 4249, "text": "Because it wasn't limiting."}, {"time": 4251, "text": "Yeah, I mean, it was critical for us for something like DawnBench to be able to rapidly try things."}, {"time": 4255, "text": "It's just so much harder to be a researcher and practitioner when you have to do everything upfront and you can't inspect it."}, {"time": 4263, "text": "Problem with PyTorch is it's not at all accessible to newcomers because you have to like write your own training loop and manage the gradients and all this stuff."}, {"time": 4275, "text": "And it's also like not great for researchers because you're spending your time dealing with all this boilerplate and overhead rather than thinking about your algorithm."}, {"time": 4283, "text": "So we ended up writing this very multi layered API that at the top level, you can train a state of the art neural network in three lines of code."}, {"time": 4293, "text": "And which kind of talks to an API, which talks to an API, which talks to an API, which like you can dive into at any level and get progressively closer to the machine kind of levels of control."}, {"time": 4305, "text": "And this is the fast AI library."}, {"time": 4307, "text": "That's been critical for us and for our students and for lots of people that have won deep learning competitions with it and written academic papers with it."}, {"time": 4318, "text": "It's made a big difference."}, {"time": 4320, "text": "We're still limited though by Python."}, {"time": 4323, "text": "And particularly this problem with things like recurrent neural nets say where you just can't change things unless you accept it going so slowly that it's impractical."}, {"time": 4335, "text": "So in the latest incarnation of the course and with some of the research we're now starting to do, we're starting to do stuff, some stuff in Swift."}, {"time": 4344, "text": "I think we're three years away from that being super practical, but I'm in no hurry."}, {"time": 4351, "text": "I'm very happy to invest the time to get there."}, {"time": 4355, "text": "But with that, we actually already have a nascent version of the fast AI library for vision running on Swift and TensorFlow."}, {"time": 4364, "text": "Cause a Python for TensorFlow is not gonna cut it."}, {"time": 4368, "text": "It's just a disaster."}, {"time": 4369, "text": "What they did was they tried to replicate the bits that people were saying they like about PyTorch, this kind of interactive computation, but they didn't actually change their foundational runtime components."}, {"time": 4383, "text": "So they kind of added this like syntax sugar they call TF Eager, TensorFlow Eager, which makes it look a lot like PyTorch, but it's 10 times slower than PyTorch to actually do a step."}, {"time": 4396, "text": "So because they didn't invest the time in like retooling the foundations, cause their code base is so horribly complex."}, {"time": 4404, "text": "Yeah, I think it's probably very difficult to do that kind of retooling."}, {"time": 4406, "text": "Yeah, well, particularly the way TensorFlow was written, it was written by a lot of people very quickly in a very disorganized way."}, {"time": 4413, "text": "So like when you actually look in the code, as I do often, I'm always just like, Oh God, what were they thinking?"}, {"time": 4418, "text": "It's just, it's pretty awful."}, {"time": 4421, "text": "So I'm really extremely negative about the potential future for Python for TensorFlow."}, {"time": 4430, "text": "But Swift for TensorFlow can be a different beast altogether."}, {"time": 4433, "text": "It can be like, it can basically be a layer on top of MLIR that takes advantage of, you know, all the great compiler stuff that Swift builds on with LLVM and yeah, I think it will be absolutely fantastic."}, {"time": 4450, "text": "Well, you're inspiring me to try."}, {"time": 4451, "text": "I haven't truly felt the pain of TensorFlow 2.0 Python."}, {"time": 4457, "text": "It's fine by me, but of... Yeah, I mean, it does the job if you're using like predefined things that somebody has already written."}, {"time": 4467, "text": "But if you actually compare, you know, like I've had to do, cause I've been having to do a lot of stuff with TensorFlow recently, you actually compare like, okay, I want to write something from scratch and you're like, I just keep finding it's like, Oh, it's running 10 times slower than PyTorch."}, {"time": 4481, "text": "So is the biggest cost, let's throw running time out the window."}, {"time": 4487, "text": "How long it takes you to program?"}, {"time": 4489, "text": "That's not too different now, thanks to TensorFlow Eager, that's not too different."}, {"time": 4494, "text": "But because so many things take so long to run, you wouldn't run it at 10 times slower."}, {"time": 4500, "text": "Like you just go like, Oh, this is taking too long."}, {"time": 4503, "text": "And also there's a lot of things which are just less programmable, like tf.data, which is the way data processing works in TensorFlow is just this big mess."}, {"time": 4511, "text": "It's incredibly inefficient."}, {"time": 4513, "text": "And they kind of had to write it that way because of the TPU problems I described earlier."}, {"time": 4519, "text": "So I just, you know, I just feel like they've got this huge technical debt, which they're not going to solve without starting from scratch."}, {"time": 4527, "text": "So here's an interesting question then, if there's a new student starting today, what would you recommend they use?"}, {"time": 4537, "text": "Well, I mean, we obviously recommend Fastai and PyTorch because we teach new students and that's what we teach with."}, {"time": 4543, "text": "So we would very strongly recommend that because it will let you get on top of the concepts much more quickly."}, {"time": 4551, "text": "So then you'll become an actual, and you'll also learn the actual state of the art techniques, you know, so you actually get world class results."}, {"time": 4559, "text": "Honestly, it doesn't much matter what library you learn because switching from the trainer to MXNet to TensorFlow to PyTorch is gonna be a couple of days work as long as you understand the foundation as well."}, {"time": 4575, "text": "But you think will Swift creep in there as a thing that people start using?"}, {"time": 4582, "text": "Not for a few years, particularly because like Swift has no data science community, libraries, schooling."}, {"time": 4593, "text": "And the Swift community has a total lack of appreciation and understanding of numeric computing."}, {"time": 4600, "text": "So like they keep on making stupid decisions, you know, for years, they've just done dumb things around performance and prioritization."}, {"time": 4610, "text": "That's clearly changing now because the developer of Swift, Chris Latner, is working at Google on Swift for TensorFlow."}, {"time": 4620, "text": "So like that's a priority."}, {"time": 4624, "text": "It'll be interesting to see what happens with Apple because like Apple hasn't shown any sign of caring about numeric programming in Swift."}, {"time": 4633, "text": "So I mean, hopefully they'll get off their ass and start appreciating this because currently all of their low level libraries are not written in Swift."}, {"time": 4645, "text": "They're not particularly Swifty at all, stuff like CoreML, they're really pretty rubbish."}, {"time": 4650, "text": "So yeah, so there's a long way to go."}, {"time": 4653, "text": "But at least one nice thing is that Swift for TensorFlow can actually directly use Python code and Python libraries in a literally the entire lesson one notebook of fast AI runs in Swift right now in Python mode."}, {"time": 4668, "text": "So that's a nice intermediate thing."}, {"time": 4671, "text": "How long does it take?"}, {"time": 4673, "text": "If you look at the two fast AI courses, how long does it take to get from point zero to completing both courses?"}, {"time": 4683, "text": "It varies a lot."}, {"time": 4685, "text": "Somewhere between two months and two years generally."}, {"time": 4693, "text": "So for two months, how many hours a day on average?"}, {"time": 4696, "text": "So like somebody who is a very competent coder can do 70 hours per course and pick up 70."}, {"time": 4707, "text": "70, seven zero, that's it, okay."}, {"time": 4741, "text": "So part of it's just like doing a lot more writing."}, {"time": 4744, "text": "What do you find is the bottleneck for people usually except getting started and setting stuff up?"}, {"time": 4751, "text": "I would say coding."}, {"time": 4753, "text": "Yeah, I would say the best, the people who are strong coders pick it up the best."}, {"time": 4758, "text": "Although another bottleneck is people who have a lot of experience of classic statistics can really struggle because the intuition is so the opposite of what they're used to."}, {"time": 4770, "text": "They're very used to like trying to reduce the number of parameters in their model and looking at individual coefficients and stuff like that."}, {"time": 4779, "text": "So I find people who have a lot of coding background and know nothing about statistics are generally gonna be the best off."}, {"time": 4788, "text": "So you taught several courses on deep learning and as Feynman says, best way to understand something is to teach it."}, {"time": 4795, "text": "What have you learned about deep learning from teaching it?"}, {"time": 4800, "text": "That's a key reason for me to teach the courses."}, {"time": 4803, "text": "I mean, obviously it's gonna be necessary to achieve our goal of getting domain experts to be familiar with deep learning, but it was also necessary for me to achieve my goal of being really familiar with deep learning."}, {"time": 4818, "text": "I mean, to see so many domain experts from so many different backgrounds, it's definitely, I wouldn't say taught me, but convinced me something that I liked to believe was true, which was anyone can do it."}, {"time": 4834, "text": "So there's a lot of kind of snobbishness out there about only certain people can learn to code."}, {"time": 4840, "text": "Only certain people are gonna be smart enough like do AI, that's definitely bullshit."}, {"time": 4845, "text": "I've seen so many people from so many different backgrounds get state of the art results in their domain areas now."}, {"time": 4853, "text": "It's definitely taught me that the key differentiator between people that succeed and people that fail is tenacity."}, {"time": 4860, "text": "That seems to be basically the only thing that matters."}, {"time": 4865, "text": "A lot of people give up."}, {"time": 4866, "text": "But of the ones who don't give up, pretty much everybody succeeds."}, {"time": 4872, "text": "Even if at first I'm just kind of like thinking like, wow, they really aren't quite getting it yet, are they?"}, {"time": 4878, "text": "But eventually people get it and they succeed."}, {"time": 4882, "text": "So I think that's been, I think they're both things I liked to believe was true, but I don't feel like I really had strong evidence for them to be true, but now I can say I've seen it again and again."}, {"time": 4892, "text": "I've seen it again and again."}, {"time": 4892, "text": "So what advice do you have for someone who wants to get started in deep learning?"}, {"time": 4902, "text": "Train lots of models."}, {"time": 4904, "text": "That's how you learn it."}, {"time": 4907, "text": "So I think, it's not just me, I think our course is very good, but also lots of people independently have said it's very good."}, {"time": 4915, "text": "It recently won the COGx award for AI courses as being the best in the world."}, {"time": 4919, "text": "So I'd say come to our course, course.fast.ai."}, {"time": 4922, "text": "And the thing I keep on hopping on in my lessons is train models, print out the inputs to the models, print out to the outputs to the models, like study, change the inputs a bit, look at how the outputs vary, just run lots of experiments to get an intuitive understanding of what's going on."}, {"time": 4945, "text": "To get hooked, do you think, you mentioned training, do you think just running the models inference, like if we talk about getting started?"}, {"time": 4955, "text": "No, you've got to fine tune the models."}, {"time": 4957, "text": "So that's the critical thing, because at that point you now have a model that's in your domain area."}, {"time": 4963, "text": "So there's no point running somebody else's model because it's not your model."}, {"time": 4968, "text": "So it only takes five minutes to fine tune a model for the data you care about."}, {"time": 4972, "text": "And in lesson two of the course, we teach you how to create your own data set from scratch by scripting Google image search."}, {"time": 4978, "text": "So, and we show you how to actually create a web application running online."}, {"time": 4982, "text": "So I create one in the course that differentiates between a teddy bear, a grizzly bear and a brown bear."}, {"time": 4988, "text": "And it does it with basically 100% accuracy, took me about four minutes to scrape the images from Google search in the script."}, {"time": 4995, "text": "There's a little graphical widgets we have in the notebook that help you clean up the data set."}, {"time": 5001, "text": "There's other widgets that help you study the results to see where the errors are happening."}, {"time": 5006, "text": "And so now we've got over a thousand replies in our share your work here thread of students saying, here's the thing I built."}, {"time": 5014, "text": "And so there's people who like, and a lot of them are state of the art."}, {"time": 5017, "text": "Like somebody said, oh, I tried looking at Devangari characters and I couldn't believe it."}, {"time": 5021, "text": "The thing that came out was more accurate than the best academic paper after lesson one."}, {"time": 5026, "text": "And then there's others which are just more kind of fun, like somebody who's doing Trinidad and Tobago hummingbirds."}, {"time": 5033, "text": "She said that's kind of their national bird and she's got something that can now classify Trinidad and Tobago hummingbirds."}, {"time": 5038, "text": "So yeah, train models, fine tune models with your data set and then study their inputs and outputs."}, {"time": 5045, "text": "How much is Fast.ai courses?"}, {"time": 5047, "text": "Free."}, {"time": 5048, "text": "Everything we do is free."}, {"time": 5050, "text": "We have no revenue sources of any kind."}, {"time": 5052, "text": "It's just a service to the community."}, {"time": 5055, "text": "You're a saint."}, {"time": 5056, "text": "Okay, once a person understands the basics, trains a bunch of models, if we look at the scale of years, what advice do you have for someone wanting to eventually become an expert?"}, {"time": 5071, "text": "But specifically train lots of models in your domain area."}, {"time": 5075, "text": "So an expert what, right?"}, {"time": 5077, "text": "We don't need more expert, like create slightly evolutionary research in areas that everybody's studying."}, {"time": 5086, "text": "We need experts at using deep learning to diagnose malaria."}, {"time": 5092, "text": "Or we need experts at using deep learning to analyze language to study media bias."}, {"time": 5101, "text": "So we need experts in analyzing fisheries to identify problem areas in the ocean."}, {"time": 5111, "text": "That's what we need."}, {"time": 5113, "text": "So become the expert in your passion area."}, {"time": 5117, "text": "And this is a tool which you can use for just about anything and you'll be able to do that thing better than other people, particularly by combining it with your passion and domain expertise."}, {"time": 5127, "text": "So that's really interesting."}, {"time": 5128, "text": "Even if you do wanna innovate on transfer learning or active learning, your thought is, I mean, it's one I certainly share, is you also need to find a domain or data set that you actually really care for."}, {"time": 5142, "text": "If you're not working on a real problem that you understand, how do you know if you're doing it any good?"}, {"time": 5148, "text": "How do you know if your results are good?"}, {"time": 5149, "text": "How do you know if you're getting bad results?"}, {"time": 5150, "text": "Why are you getting bad results?"}, {"time": 5152, "text": "Is it a problem with the data?"}, {"time": 5154, "text": "Like, how do you know you're doing anything useful?"}, {"time": 5157, "text": "Yeah, to me, the only really interesting research is, not the only, but the vast majority of interesting research is like, try and solve an actual problem and solve it really well."}, {"time": 5166, "text": "So both understanding sufficient tools on the deep learning side and becoming a domain expert in a particular domain are really things within reach for anybody."}, {"time": 5178, "text": "Yeah, I mean, to me, I would compare it to like studying self driving cars, having never looked at a car or been in a car or turned a car on, which is like the way it is for a lot of people, they'll study some academic data set where they literally have no idea about that."}, {"time": 5196, "text": "By the way, I'm not sure how familiar with autonomous vehicles, but that is literally, you describe a large percentage of robotics folks working in self driving cars is they actually haven't considered driving."}, {"time": 5208, "text": "They haven't actually looked at what driving looks like."}, {"time": 5210, "text": "They haven't driven."}, {"time": 5211, "text": "And it's a problem because you know, when you've actually driven, you know, like these are the things that happened to me when I was driving."}, {"time": 5217, "text": "There's nothing that beats the real world examples of just experiencing them."}, {"time": 5222, "text": "You've created many successful startups."}, {"time": 5224, "text": "What does it take to create a successful startup?"}, {"time": 5228, "text": "Same thing as becoming a successful deep learning practitioner, which is not giving up."}, {"time": 5235, "text": "So you can run out of money or run out of time or run out of something, you know, but if you keep costs super low and try and save up some money beforehand so you can afford to have some time, then just sticking with it is one important thing."}, {"time": 5258, "text": "Doing something you understand and care about is important."}, {"time": 5262, "text": "By something, I don't mean, the biggest problem I see with deep learning people is they do a PhD in deep learning and then they try and commercialize their PhD."}, {"time": 5272, "text": "It is a waste of time because that doesn't solve an actual problem."}, {"time": 5275, "text": "You picked your PhD topic because it was an interesting kind of engineering or math or research exercise."}, {"time": 5307, "text": "And then I think just, yeah, being, just be pragmatic and try and stay away from venture capital money as long as possible, preferably forever."}, {"time": 5319, "text": "So yeah, on that point, do you venture capital?"}, {"time": 5323, "text": "So did you, were you able to successfully run startups with self funded for quite a while?"}, {"time": 5328, "text": "Yeah, so my first two were self funded and that was the right way to do it."}, {"time": 5332, "text": "Is that scary?"}, {"time": 5334, "text": "No, VC startups are much more scary because you have these people on your back who do this all the time and who have done it for years telling you grow, grow, grow, grow."}, {"time": 5345, "text": "And they don't care if you fail."}, {"time": 5347, "text": "They only care if you don't grow fast enough."}, {"time": 5349, "text": "So that's scary."}, {"time": 5350, "text": "Whereas doing the ones myself, well, with partners who were friends was nice because like we just went along at a pace that made sense and we were able to build it to something which was big enough that we never had to work again but was not big enough that any VC would think it was impressive."}, {"time": 5371, "text": "And that was enough for us to be excited, you know?"}, {"time": 5375, "text": "So I thought that's a much better way to do things than most people."}, {"time": 5380, "text": "In generally speaking, not for yourself but how do you make money during that process?"}, {"time": 5384, "text": "Do you cut into savings?"}, {"time": 5387, "text": "So yeah, so for, so I started Fast Mail and Optimal Decisions at the same time in 1999 with two different friends."}, {"time": 5394, "text": "And for Fast Mail, I guess I spent $70 a month on the server."}, {"time": 5404, "text": "And when the server ran out of space I put a payments button on the front page and said, if you want more than 10 mega space you have to pay $10 a year."}, {"time": 5416, "text": "So run low, like keep your costs down."}, {"time": 5418, "text": "Yeah, so I kept my costs down."}, {"time": 5419, "text": "And once, you know, once I needed to spend more money I asked people to spend the money for me."}, {"time": 5425, "text": "And that, that was that."}, {"time": 5428, "text": "Basically from then on, we were making money and I was profitable from then."}, {"time": 5435, "text": "For Optimal Decisions, it was a bit harder because we were trying to sell something that was more like a $1 million sale."}, {"time": 5442, "text": "But what we did was we would sell scoping projects."}, {"time": 5446, "text": "So kind of like prototypy projects but rather than doing it for free we would sell them 50 to $100,000."}, {"time": 5454, "text": "So again, we were covering our costs and also making the client feel like we were doing something valuable."}, {"time": 5460, "text": "So in both cases, we were profitable from six months in."}, {"time": 5466, "text": "Ah, nevertheless, it's scary."}, {"time": 5468, "text": "I mean, yeah, sure."}, {"time": 5470, "text": "I mean, it's, it's scary before you jump in and I just, I guess I was comparing it to the scarediness of VC."}, {"time": 5478, "text": "I felt like with VC stuff, it was more scary."}, {"time": 5480, "text": "Kind of much more in somebody else's hands, will they fund you or not?"}, {"time": 5486, "text": "And what do they think of what you're doing?"}, {"time": 5487, "text": "I also found it very difficult with VCs, back startups to actually do the thing which I thought was important for the company rather than doing the thing which I thought would make the VC happy."}, {"time": 5498, "text": "And VCs always tell you not to do the thing that makes them happy."}, {"time": 5502, "text": "But then if you don't do the thing that makes them happy they get sad, so."}, {"time": 5506, "text": "And do you think optimizing for the, whatever they call it, the exit is a good thing to optimize for?"}, {"time": 5513, "text": "I mean, it can be, but not at the VC level because the VC exit needs to be, you know, a thousand X."}, {"time": 5519, "text": "So where else the lifestyle exit, if you can sell something for $10 million, then you've made it, right?"}, {"time": 5526, "text": "So I don't, it depends."}, {"time": 5529, "text": "If you want to build something that's gonna, you're kind of happy to do forever, then fine."}, {"time": 5533, "text": "If you want to build something you want to sell in three years time, that's fine too."}, {"time": 5538, "text": "I mean, they're both perfectly good outcomes."}, {"time": 5541, "text": "So you're learning Swift now, in a way."}, {"time": 5544, "text": "I mean, you've already."}, {"time": 5545, "text": "I'm trying to."}, {"time": 5546, "text": "And I read that you use, at least in some cases, space repetition as a mechanism for learning new things."}, {"time": 5554, "text": "I use Anki quite a lot myself."}, {"time": 5558, "text": "I actually never talk to anybody about it."}, {"time": 5561, "text": "Don't know how many people do it, but it works incredibly well for me."}, {"time": 5566, "text": "Can you talk to your experience?"}, {"time": 5567, "text": "Like how did you, what do you?"}, {"time": 5571, "text": "First of all, okay, let's back it up."}, {"time": 5573, "text": "What is space repetition?"}, {"time": 5575, "text": "So space repetition is an idea created by a psychologist named Ebbinghaus."}, {"time": 5584, "text": "I don't know, must be a couple of hundred years ago or something, 150 years ago."}, {"time": 5588, "text": "He did something which sounds pretty damn tedious."}, {"time": 5590, "text": "He wrote down random sequences of letters on cards and tested how well he would remember those random sequences a day later, a week later, whatever."}, {"time": 5603, "text": "He discovered that there was this kind of a curve where his probability of remembering one of them would be dramatically smaller the next day and then a little bit smaller the next day and a little bit smaller the next day."}, {"time": 5613, "text": "What he discovered is that if he revised those cards after a day, the probabilities would decrease at a smaller rate."}, {"time": 5622, "text": "And then if you revise them again a week later, they would decrease at a smaller rate again."}, {"time": 5627, "text": "And so he basically figured out a roughly optimal equation for when you should revise something you wanna remember."}, {"time": 5636, "text": "So space repetition learning is using this simple algorithm, just something like revise something after a day and then three days and then a week and then three weeks and so forth."}, {"time": 5647, "text": "And so if you use a program like Anki, as you know, it will just do that for you."}, {"time": 5652, "text": "And it will say, did you remember this?"}, {"time": 5654, "text": "And if you say no, it will reschedule it back to appear again like 10 times faster than it otherwise would have."}, {"time": 5663, "text": "It's a kind of a way of being guaranteed to learn something because by definition, if you're not learning it, it will be rescheduled to be revised more quickly."}, {"time": 5673, "text": "Unfortunately though, it's also like, it doesn't let you fool yourself."}, {"time": 5677, "text": "If you're not learning something, you know like your revisions will just get more and more."}, {"time": 5684, "text": "So you have to find ways to learn things productively and effectively like treat your brain well."}, {"time": 5690, "text": "So using like mnemonics and stories and context and stuff like that."}, {"time": 5697, "text": "So yeah, it's a super great technique."}, {"time": 5699, "text": "It's like learning how to learn is something which everybody should learn before they actually learn anything."}, {"time": 5705, "text": "But almost nobody does."}, {"time": 5707, "text": "So what have you, so it certainly works well for learning new languages for, I mean, for learning like small projects almost."}, {"time": 5716, "text": "But do you, you know, I started using it for, I forget who wrote a blog post about this inspired me."}, {"time": 5722, "text": "It might've been you, I'm not sure."}, {"time": 5726, "text": "I started when I read papers, I'll concepts and ideas, I'll put them."}, {"time": 5731, "text": "Was it Michael Nielsen?"}, {"time": 5732, "text": "It was Michael Nielsen."}, {"time": 5733, "text": "So Michael started doing this recently and has been writing about it."}, {"time": 5741, "text": "So the kind of today's Ebbinghaus is a guy called Peter Wozniak who developed a system called SuperMemo."}, {"time": 5747, "text": "And he's been basically trying to become like the world's greatest Renaissance man over the last few decades."}, {"time": 5755, "text": "He's basically lived his life with space repetition learning for everything."}, {"time": 5763, "text": "I, and sort of like, Michael's only very recently got into this, but he started really getting excited about doing it for a lot of different things."}, {"time": 5771, "text": "For me personally, I actually don't use it for anything except Chinese."}, {"time": 5776, "text": "And the reason for that is that Chinese is specifically a thing I made a conscious decision that I want to continue to remember, even if I don't get much of a chance to exercise it, cause like I'm not often in China, so I don't."}, {"time": 5793, "text": "Or else something like programming languages or papers."}, {"time": 5798, "text": "I have a very different approach, which is I try not to learn anything from them, but instead I try to identify the important concepts and like actually ingest them."}, {"time": 5808, "text": "So like really understand that concept deeply and study it carefully."}, {"time": 5814, "text": "I will decide if it really is important, if it is like incorporated into our library, you know, incorporated into how I do things or decide it's not worth it, say."}, {"time": 5827, "text": "So I find, I find I then remember the things that I care about because I'm using it all the time."}, {"time": 5835, "text": "So I've, for the last 25 years, I've committed to spending at least half of every day learning or practicing something new, which is all my colleagues have always hated because it always looks like I'm not working on what I'm meant to be working on, but it always means I do everything faster because I've been practicing a lot of stuff."}, {"time": 5856, "text": "So I kind of give myself a lot of opportunity to practice new things."}, {"time": 5861, "text": "And so I find now I don't, yeah, I don't often kind of find myself wishing I could remember something because if it's something that's useful, then I've been using it a lot."}, {"time": 5873, "text": "It's easy enough to look it up on Google, but speaking Chinese, you can't look it up on Google."}, {"time": 5879, "text": "Do you have advice for people learning new things?"}, {"time": 5881, "text": "So if you, what have you learned as a process as a, I mean, it all starts with just making the hours and the day available."}, {"time": 5888, "text": "Yeah, you got to stick with it, which is again, the number one thing that 99% of people don't do."}, {"time": 5893, "text": "So the people I started learning Chinese with, none of them were still doing it 12 months later."}, {"time": 5898, "text": "I'm still doing it 10 years later."}, {"time": 5900, "text": "I tried to stay in touch with them, but they just, no one did it."}, {"time": 5904, "text": "For something like Chinese, like study how human learning works."}, {"time": 5908, "text": "So every one of my Chinese flashcards is associated with a story."}, {"time": 5913, "text": "And that story is specifically designed to be memorable."}, {"time": 5916, "text": "And we find things memorable, which are like funny or disgusting or sexy or related to people that we know or care about."}, {"time": 5924, "text": "So I try to make sure all of the stories that are in my head have those characteristics."}, {"time": 5931, "text": "Yeah, so you have to, you know, you won't remember things well if they don't have some context."}, {"time": 5936, "text": "And yeah, you won't remember them well if you don't regularly practice them, whether it be just part of your day to day life or the Chinese and me flashcards."}, {"time": 5946, "text": "I mean, the other thing is, I'll let yourself fail sometimes."}, {"time": 5949, "text": "So like I've had various medical problems over the last few years."}, {"time": 5953, "text": "And basically my flashcards just stopped for about three years."}]}]