[{"title": "Jordan Peterson: Life, Death, Power, Fame, and Meaning | Lex Fridman Podcast #313", "id": "sY8aFSY2zv4", "quotes": [{"time": 247, "text": "It's a tree like structure, it's a branching structure, it's a hierarchical structure."}, {"time": 252, "text": "It's a self similar structure, it's a fractal structure."}, {"time": 255, "text": "And it's the tree of life, and it's the tree of the knowledge of good and evil."}, {"time": 259, "text": "And the fire in it is the transformation that's always occurring within every structure."}, {"time": 265, "text": "And the fact that the fire doesn't consume the bush in that representation is an indication of the balance of transformation with structure."}, {"time": 274, "text": "And that balance is presented as God, and what attracts Moses to it in some sense is the beauty."}, {"time": 282, "text": "Now it's the novelty and all that, but like a painting is like a burning bush, that's a good way of thinking about it, a great painting."}, {"time": 288, "text": "It's too much for people often."}, {"time": 291, "text": "My house was, and will soon be again, completely covered with paintings inside."}, {"time": 298, "text": "And it was hard on people to come in there because, well, my mother, for example, say, well, why would you wanna live in a museum?"}, {"time": 307, "text": "And I'd think, well, I would rather live in a museum than anywhere else in some real sense, but beauty is daunting, it scares people."}, {"time": 315, "text": "They're terrified of buying art, for example, because their taste is on display, and they should be terrified because generally people have terrible taste."}, {"time": 322, "text": "Now, that doesn't mean they shouldn't foster it and develop it, but, and you know, when you put your taste on display, it really exposes you."}, {"time": 330, "text": "Even to yourself as you walk past it every day."}, {"time": 334, "text": "This is who I am."}, {"time": 336, "text": "Yeah, well, and look how mundane that is, and look how trite it is, and look at how cliched it is, and look at how sterile or too ordered it is, or too chaotic."}, {"time": 345, "text": "Or how quickly you start to take it for granted because you've seen it so many times."}, {"time": 348, "text": "Well, if it's a real piece of art, that doesn't happen."}, {"time": 351, "text": "You notice the little details."}, {"time": 353, "text": "The whole is greater than the sum of the parts."}, {"time": 355, "text": "I mean, there are images, religious images in particular, so we could call them deep images, that people have been unpacking for 4,000 years and still haven't, I'll give you an example."}, {"time": 369, "text": "This is a terrible example."}, {"time": 372, "text": "So, I did a lecture series on Genesis, and I got a lot of it unpacked, but by no means all of it."}, {"time": 381, "text": "When God kicks Adam and Eve out of the Garden of Eden, he puts cherubim with flaming swords at the gate to stop human beings from reentering paradise."}, {"time": 391, "text": "I thought, what the hell does that mean, cherubim, and why do they have flaming swords?"}, {"time": 395, "text": "I don't get that."}, {"time": 395, "text": "What is that exactly?"}, {"time": 398, "text": "And then I found out from Matthew Pagel, who wrote a great book on symbolism in Genesis, that cherubim are the supporting monsters of God."}, {"time": 408, "text": "It's a very complicated idea, and that they are partly a representation of that which is difficult to fit into conceptual systems."}, {"time": 417, "text": "They've also got an angelic or demonic aspect."}, {"time": 420, "text": "Take your pick."}, {"time": 422, "text": "Why do they have flaming swords?"}, {"time": 424, "text": "Well, a sword is a symbol of judgment and the separation of the wheat from the chaff."}, {"time": 433, "text": "You use a sword to cut away, to cut away, and to carve."}, {"time": 438, "text": "And a flaming sword is not only that which carves, it's that which burns."}, {"time": 443, "text": "And what does it carve away and burn?"}, {"time": 445, "text": "Well, you want to get into paradise?"}, {"time": 448, "text": "It carves away everything about you that isn't perfect."}, {"time": 454, "text": "Okay, well, here's part of what it means."}, {"time": 455, "text": "This is a terrible thing."}, {"time": 457, "text": "So you could say that the entire Christian narrative is embedded in that image."}, {"time": 465, "text": "Well, let's say that flaming swords are a symbol of death."}, {"time": 468, "text": "That seems pretty obvious."}, {"time": 470, "text": "Let's say further that they're a symbol of apocalypse and hell."}, {"time": 476, "text": "That doesn't seem completely unreasonable."}, {"time": 479, "text": "So here's an idea."}, {"time": 482, "text": "Not only do you have to face death, you have to face death and hell before you can get to paradise."}, {"time": 489, "text": "Hellish judgment and all that's embedded in that image."}, {"time": 493, "text": "And a piece of art with an image like that has all that information in it."}, {"time": 498, "text": "And it shines forth in some fundamental sense."}, {"time": 502, "text": "It reaches into the back tendrils of your mind at levels you can't even comprehend and grips you."}, {"time": 509, "text": "I mean, that's why people go to museums and gaze at paintings they don't understand."}, {"time": 513, "text": "And that's why they'll pay what's the most expensive objects in the world."}, {"time": 517, "text": "If it's not carbon fiber racing yachts, it's definitely classic paintings."}, {"time": 522, "text": "It's high level technological implements or it's classic art."}, {"time": 527, "text": "Well, why are those things so expensive?"}, {"time": 528, "text": "Why do we build temples to house the images?"}, {"time": 531, "text": "Even secular people go to museums."}, {"time": 534, "text": "I'm secular."}, {"time": 535, "text": "Well, are you in a museum?"}, {"time": 537, "text": "Are you looking at art?"}, {"time": 539, "text": "Well, what makes you think you're secular then?"}, {"time": 543, "text": "It's arguable that the thing many, many centuries from now that will remain of all of human civilization will be our art."}, {"time": 551, "text": "Not even the words."}, {"time": 552, "text": "Well, a book has remained a very long time, right?"}, {"time": 556, "text": "The biblical writings have."}, {"time": 557, "text": "Not that long."}, {"time": 558, "text": "A few millennia."}, {"time": 561, "text": "But that's in the full arc of living organisms, perhaps will not be."}, {"time": 565, "text": "Well, we have images that are, we have artistic images that are at least 50,000 years old, right, that have survived."}, {"time": 572, "text": "And some of those are, they're already profound in their symbolism."}, {"time": 576, "text": "By we, do you mean humans?"}, {"time": 578, "text": "Yeah, we found them."}, {"time": 579, "text": "And they've lasted, they've lasted that long."}, {"time": 584, "text": "And so, and then think about Europe."}, {"time": 588, "text": "Secular people all over the world make pilgrimages to Europe."}, {"time": 593, "text": "Because of the beauty."}, {"time": 595, "text": "Obviously, I mean, that's self evident."}, {"time": 598, "text": "And it's partly because there are things in Europe that are so beautiful."}, {"time": 602, "text": "They take your breath away, right?"}, {"time": 603, "text": "They make your hair stand on end."}, {"time": 604, "text": "They fill you with a sense of awe."}, {"time": 607, "text": "And we need to see those things."}, {"time": 610, "text": "It's not optional."}, {"time": 611, "text": "We need to see those things."}, {"time": 613, "text": "The cathedrals."}, {"time": 613, "text": "I was in a cathedral in Vienna, and it was terribly beautiful."}, {"time": 617, "text": "Terribly beautiful."}, {"time": 618, "text": "Well, it was terribly beautiful."}, {"time": 620, "text": "Is beauty painful for you?"}, {"time": 621, "text": "Is that the highest form of beauty?"}, {"time": 624, "text": "It really challenges you?"}, {"time": 627, "text": "I got a good analysis of the statue of David."}, {"time": 629, "text": "Michelangelo says, you could be far more than you are."}, {"time": 633, "text": "That's what that statue says."}, {"time": 635, "text": "And this cathedral, we went down into the under structure of it."}, {"time": 641, "text": "And there were three floors of bones from the plague."}, {"time": 646, "text": "And there they all are."}, {"time": 647, "text": "And then that cathedral is on top of it."}, {"time": 650, "text": "It's no joke to go visit a place like that."}, {"time": 653, "text": "No, it rattles you to the core."}, {"time": 656, "text": "And our religious systems have become propositionally dubious."}, {"time": 663, "text": "But there's no arguing with the architecture, although modern architects like to, with their sterility and their giant middle fingers erected everywhere."}, {"time": 672, "text": "But beauty is a terrible pointer to God."}, {"time": 676, "text": "And a secular person will say, well, I don't believe in God."}, {"time": 679, "text": "It's like, have it your way."}, {"time": 683, "text": "You cannot move forward into the unforeseen horizon of the future except on faith."}, {"time": 689, "text": "And you might say, well, I have no faith."}, {"time": 691, "text": "It's like, well, good luck with the future then."}, {"time": 693, "text": "Because what are you then, nihilistic and hopeless and anxiety ridden?"}, {"time": 698, "text": "And if not, well, something's guiding you forward."}, {"time": 700, "text": "It's faith in something or multiple things, which just makes you a polytheist, which I wouldn't recommend."}, {"time": 708, "text": "Well, let me ask you one short lived biological meat bag to another."}, {"time": 714, "text": "Who is God then?"}, {"time": 718, "text": "Let's try to sneak up to this question if it's at all possible."}, {"time": 721, "text": "Is it possible to even talk about this?"}, {"time": 724, "text": "Well, it better be."}, {"time": 725, "text": "Because otherwise, there's no communicating about it."}, {"time": 728, "text": "It has to be something that can be brought down to Earth."}, {"time": 732, "text": "Well, we might be too dumb to bring it down."}, {"time": 734, "text": "It's not just ignorant."}, {"time": 736, "text": "It's also sinful because there's not knowing."}, {"time": 740, "text": "And then there's wanting to know or refusing to know."}, {"time": 744, "text": "And so you might say, well, could you extract God from a description of the objective world?"}, {"time": 750, "text": "Is God just the ultimate unity of the natural reality?"}, {"time": 756, "text": "And I would say, well, in a sense, there's some truth in that, but not exactly."}, {"time": 761, "text": "Because God in the highest sense is the spirit that you must emulate in order to thrive."}, {"time": 769, "text": "How's that for a biological definition?"}, {"time": 771, "text": "Spirit is a pattern, the spirit that you must emulate in order to thrive."}, {"time": 776, "text": "So it's a kind of, in one sense, when we say the human spirit, it's that."}, {"time": 782, "text": "It's an animating principle."}, {"time": 784, "text": "Yeah, it's a meta."}, {"time": 785, "text": "It's a pattern."}, {"time": 786, "text": "And you might say, well, what's the pattern?"}, {"time": 788, "text": "Well, I can tell you that to some degree."}, {"time": 791, "text": "Imagine that like your grip by beauty, you're gripped by admiration."}, {"time": 797, "text": "And you can just notice this."}, {"time": 799, "text": "This isn't propositional."}, {"time": 800, "text": "You have to notice it."}, {"time": 801, "text": "It's like, oh, turns out I admire that person."}, {"time": 808, "text": "Well, it means I would like to be like him or her."}, {"time": 811, "text": "That's what admiration means."}, {"time": 812, "text": "It means there's something about the way they are that compels imitation, another instinct, or inspires respect or awe even."}, {"time": 824, "text": "What is that that grips you?"}, {"time": 829, "text": "Well, let's say, OK, fine."}, {"time": 831, "text": "But it grips you."}, {"time": 832, "text": "And you want to be like that."}, {"time": 833, "text": "Kids hero worship, for example."}, {"time": 835, "text": "So do adults, for that matter, unless they become entirely cynical."}, {"time": 838, "text": "I worship quite a few heroes."}, {"time": 840, "text": "Well, there you go."}, {"time": 841, "text": "Yes, well, there you go."}, {"time": 843, "text": "And there's no, that worship, that celebration and proclivity to imitate is worship."}, {"time": 848, "text": "That's what worship means most fundamentally."}, {"time": 851, "text": "Now, imagine you took the set of all admirable people and you extracted out AI learning."}, {"time": 858, "text": "You extracted out the central features of what constitutes admirable."}, {"time": 863, "text": "And then you did that repeatedly until you purified it to what was most admirable."}, {"time": 869, "text": "That's as good as you're going to get in terms of a representation of God."}, {"time": 875, "text": "And you might say, well, I don't believe in that."}, {"time": 877, "text": "It's like, well, what do you mean?"}, {"time": 880, "text": "It's not a set of propositional facts."}, {"time": 883, "text": "It's not a scientific theory about the structure of the objective world."}, {"time": 887, "text": "And then I could say something about that, too, because I've been thinking about this a lot, especially since talking to Richard Dawkins."}, {"time": 893, "text": "It's like, OK, the postmodernist types, going back way before Derrida and Foucault, maybe back to Nietzsche, who I admire greatly, by the way."}, {"time": 904, "text": "He says, God is dead."}, {"time": 907, "text": "But Nietzsche said, God is dead, and we have killed him, and we'll not find enough water to wash away all the blood."}, {"time": 912, "text": "So that was Nietzsche."}, {"time": 915, "text": "He's got away with words."}, {"time": 916, "text": "He certainly does."}, {"time": 917, "text": "And so then you think, OK, well, we killed the transcendent."}, {"time": 922, "text": "Well, what does that mean for science?"}, {"time": 924, "text": "Well, it frees it up, because all that nonsense about a deity is just the idiot superstition that stops the scientific process from moving forward."}, {"time": 935, "text": "That's basically the new atheist claim, something like that."}, {"time": 938, "text": "It's like, wait a second."}, {"time": 940, "text": "Do you believe in the transcendent if you're a scientist?"}, {"time": 944, "text": "And the answer is, well, not only do you believe in it, you believe in it more than anything else."}, {"time": 949, "text": "Because if you're a scientist, you believe in what objects to your theory more than you believe in your theory."}, {"time": 958, "text": "Now, we've got to think that through very carefully."}, {"time": 960, "text": "So your theory describes the world."}, {"time": 961, "text": "And as far as you're concerned, your description of the world is the world."}, {"time": 967, "text": "But because you're a scientist, you think, well, even though that's my description of the world and that's what I believe, there's something beyond what I believe."}, {"time": 977, "text": "And that's the object."}, {"time": 978, "text": "And so I'm going to throw my theory against the object and see where it'll break."}, {"time": 981, "text": "And then I'm going to use the evidence of the break as a source of new information to revitalize my theory."}, {"time": 988, "text": "So as a scientist, you have to posit the existence of the ontological transcendent before you can move forward at all."}, {"time": 996, "text": "But more, you have to posit that contact with the ontological transcendent, annoying though it is because it upsets your apple cart, is exactly what will, in fact, set you free."}, {"time": 1009, "text": "So then you accept the proposition that there is a transcendent reality and that contact with that transcendent reality is redemptive in the most fundamental sense."}, {"time": 1020, "text": "Because if it wasn't, well, why would you bother making contact with it?"}, {"time": 1023, "text": "Is it going to make everything worse or better?"}, {"time": 1026, "text": "Why does the contact with the transcendent set you free as a scientist?"}, {"time": 1031, "text": "Because you assume that, you assume, I mean, freedom in the most fundamental sense."}, {"time": 1035, "text": "It's like, well, freedom from want, freedom from disease, freedom from ignorance, right?"}, {"time": 1041, "text": "That it informs you."}, {"time": 1042, "text": "So it's the lie of science."}, {"time": 1044, "text": "It is definitely that."}, {"time": 1047, "text": "Yeah, it's the direction, let's say, the directionality of science."}, {"time": 1051, "text": "That's a narrative direction, not a scientific direction."}, {"time": 1054, "text": "And then the question is, what is the narrative?"}, {"time": 1056, "text": "Well, it posits a transcendent reality."}, {"time": 1058, "text": "It posits that the transcendent reality is corrective."}, {"time": 1061, "text": "It posits that our knowledge structures should be regarded with humility."}, {"time": 1066, "text": "It posits that you should bow down in the face of the transcendent evidence."}, {"time": 1071, "text": "And you have to take a vow."}, {"time": 1073, "text": "You know this as a scientist."}, {"time": 1074, "text": "You have to take a vow to follow that path if you're going to be a real scientist."}, {"time": 1077, "text": "Like, the truth, no matter what, and that means you posit the truth as a redemptive force."}, {"time": 1085, "text": "Well, what does redemptive mean?"}, {"time": 1086, "text": "Well, why bother with science?"}, {"time": 1087, "text": "Well, so people don't starve."}, {"time": 1089, "text": "So people can move about more effectively."}, {"time": 1091, "text": "So life can be more abundant, right?"}, {"time": 1092, "text": "So it's all ensconced within an underlying ethic."}, {"time": 1096, "text": "So the reason I was saying that while we were talking about belief in God, it's like, this is a very complicated topic, right?"}, {"time": 1103, "text": "Do you believe in a transcendent reality?"}, {"time": 1105, "text": "See, OK, now let's say you buy the argument I just made on the natural front."}, {"time": 1110, "text": "You say, yeah, yeah, that's just nature."}, {"time": 1113, "text": "That's not God."}, {"time": 1115, "text": "And then I'd say, well, what makes you think you know what nature is?"}, {"time": 1119, "text": "Like, see, the problem with that argument is that it already presumes a materialist, a reductionist, materialist, objective view of what constitutes nature."}, {"time": 1130, "text": "But if you're a scientist, you're going to think, well, in the final analysis, I don't know what nature is."}, {"time": 1134, "text": "I certainly don't know its origin or destination point."}, {"time": 1138, "text": "I don't know its teleology."}, {"time": 1140, "text": "I'm really ignorant about nature."}, {"time": 1142, "text": "And so when I say it's nothing but nature, I shouldn't mean it's nothing but what I understand nature to be."}, {"time": 1150, "text": "So I could say, will we have a fully reductionist account of cognitive processes?"}, {"time": 1156, "text": "And the answer to that is yes."}, {"time": 1157, "text": "But by the time we do that, our understanding of matter will have transformed so much that what we think of as reductionists now won't look anything like what we think of reductionism now."}, {"time": 1167, "text": "Matter isn't dead dust."}, {"time": 1172, "text": "I have no idea what it is."}, {"time": 1174, "text": "Matter is what matters."}, {"time": 1175, "text": "There is a definition."}, {"time": 1177, "text": "That's a very weird definition."}, {"time": 1179, "text": "But the notion that we have, you know, that if you're a reductionist, a materialist reductionist, that you can reduce the complexity of what is to your assumptions about the nature of matter, that's not a scientific proposition."}, {"time": 1193, "text": "Your specific limited human assumptions of this century, of this week, that so in some sense, without God in this complicated big definition we're talking about, there's no humility."}, {"time": 1210, "text": "Or it's less likely to be, or rather science can err in taking a trajectory away from humility."}, {"time": 1221, "text": "Without something much more powerful than an individual human."}, {"time": 1226, "text": "Yeah, well then and we know, you know, the Frankenstein story comes out of that instantly."}, {"time": 1230, "text": "And that's a good story for the current times."}, {"time": 1233, "text": "It's like you're playing around with making new life."}, {"time": 1238, "text": "You bloody well better make sure you have your arrows pointed up."}, {"time": 1243, "text": "And it's interesting because you said science has an ethic to it."}, {"time": 1249, "text": "I think it's embedded in an ethic."}, {"time": 1251, "text": "Well, there's a, you know, science is a big word."}, {"time": 1255, "text": "And it includes a lot of disciplines that have different traditions."}, {"time": 1258, "text": "So biology, chemistry, genetics, physics, those are very different communities."}, {"time": 1266, "text": "And I think biology, especially when you get closer and closer to medicine and to the human body, does have a very serious, first of all, has a history with Nazi Germany of being abused and all those kinds of things."}, {"time": 1278, "text": "But it has a history of taking this stuff seriously."}, {"time": 1281, "text": "What doesn't have a history of taking this stuff seriously is robotics and artificial intelligence, which is really interesting."}, {"time": 1287, "text": "Because you don't, you know, you called me a scientist."}, {"time": 1292, "text": "And I would like to wear that label proudly, but often people don't think of computer science as a science."}, {"time": 1298, "text": "But nevertheless, it will be, I think, the science of one of the major scientific fields of the 21st century."}, {"time": 1306, "text": "And you should take that very seriously."}, {"time": 1308, "text": "Oftentimes when people build robots or AI systems, they think of them as toys to tinker with."}, {"time": 1317, "text": "Oh, isn't this cool?"}, {"time": 1319, "text": "And I feel this too."}, {"time": 1320, "text": "Isn't this cool?"}, {"time": 1321, "text": "It is cool."}, {"time": 1322, "text": "But, you know, at a certain moment you might, isn't this nuclear explosion cool?"}, {"time": 1330, "text": "Or birth control pill cool."}, {"time": 1332, "text": "It's like, or transistor cool."}, {"time": 1335, "text": "Well, the other thing too, and this is a weird problem in some sense, the robotics engineer types, they're thing people, right?"}, {"time": 1343, "text": "I mean, the big classes of interest are interest in things versus interest in people."}, {"time": 1348, "text": "Some of my best friends are thing people."}, {"time": 1351, "text": "And thing people are very, very clear, logical thinkers."}, {"time": 1356, "text": "And they're very outcome oriented and practical."}, {"time": 1361, "text": "Now, and that's all good."}, {"time": 1363, "text": "That makes the machinery and keeps it functioning."}, {"time": 1365, "text": "But there's a human side of the equation."}, {"time": 1369, "text": "And you get the extreme thing people, and you think, yeah, well, what about the human here?"}, {"time": 1375, "text": "And when we're talking about, we've been talking about the necessity of having a technological enterprise embedded in an ethic."}, {"time": 1383, "text": "And you can ignore that, like most of the time, right?"}, {"time": 1386, "text": "You can ignore the overall ethic in some sense when you're toying around with your toys."}, {"time": 1391, "text": "But when you're building an artificial intelligence, it's like, well, that's not a toy."}, {"time": 1399, "text": "That might be."}, {"time": 1400, "text": "Toy becomes the monster very quickly."}, {"time": 1403, "text": "And this is a whole new kind of monster."}, {"time": 1406, "text": "And maybe it's already here."}, {"time": 1413, "text": "Yes, and you notice how many of those things you can no longer turn off."}, {"time": 1418, "text": "And what is it with you engineers and your inability to put off switches on things now?"}, {"time": 1424, "text": "It's like, I have to hold this for five seconds for it to shut off."}, {"time": 1428, "text": "Or I can't figure it."}, {"time": 1428, "text": "I just want to shut it off."}, {"time": 1430, "text": "Click, off."}, {"time": 1431, "text": "Well, what is it with you humans that don't put off switches on other humans?"}, {"time": 1436, "text": "Because there's a magic to the thing that you notice."}, {"time": 1439, "text": "And it hurts for both you and perhaps one day the thing itself to turn it off."}, {"time": 1445, "text": "And so you have to be very careful as an engineer adding off switches to things."}, {"time": 1451, "text": "I think it's a feature, not a bug, the off switch."}, {"time": 1454, "text": "The off switch gives a deadline to us humans, to systems of existence."}, {"time": 1459, "text": "It makes you, you know, death is the thing that really brings clarity to life."}, {"time": 1465, "text": "And I do think."}, {"time": 1467, "text": "Hence the flaming swords."}, {"time": 1468, "text": "The flaming sword."}, {"time": 1469, "text": "I do like your view of the flame, the bush, and perhaps the sword as a thing of transformation."}, {"time": 1476, "text": "It's also a transformation that kind of consumes the thing in the process."}, {"time": 1481, "text": "Well, it depends on how much of the thing is chaff."}, {"time": 1484, "text": "You know, this is why you can't touch the Ark of the Covenant, for example."}, {"time": 1488, "text": "And this is why people can have very bad psychedelic trips."}, {"time": 1492, "text": "It's like if you're 95% dead wood and you get too close to the flame, the 5% that's left might not be able to make it."}, {"time": 1503, "text": "So you think it's all chaff."}, {"time": 1504, "text": "But I think there is some aspect of destruction that is the old Bukowski line of do what you love and let it kill you."}, {"time": 1513, "text": "Don't you think that destruction is part of?"}, {"time": 1520, "text": "It's like invite in the judgment."}, {"time": 1523, "text": "Invite in the judgment because maybe you can die a little bit instead of dying completely."}, {"time": 1527, "text": "I think it's Alfred North Whitehead."}, {"time": 1530, "text": "We can let our ideas die instead of us."}, {"time": 1533, "text": "We can have these partial personalities that we can burn off."}, {"time": 1537, "text": "And we can let them go before they become tyrannical pharaohs and we lose everything."}, {"time": 1543, "text": "And so, yeah, there's this optimal bite of death."}, {"time": 1546, "text": "And who knows what it would mean to optimize that?"}, {"time": 1549, "text": "Like what if it was possible that if you died enough all the time that you could continue to live?"}, {"time": 1556, "text": "And the thing is we already know that biologically because if you don't die properly all the time, well, it's cancerous outgrowths and it's a very fine balance between productivity on the biological front and the culling of that, right?"}, {"time": 1574, "text": "Life is a real balance between growth and death."}, {"time": 1577, "text": "And so what would happen if you got that balance right?"}, {"time": 1580, "text": "Well, we kind of know, right?"}, {"time": 1581, "text": "Because if you live your life properly, so to speak, and you're humble enough to let your stupidity die before it takes you out, you will live longer."}, {"time": 1592, "text": "That's just a fact."}, {"time": 1594, "text": "Well, but then what's the ultimate extension of that?"}, {"time": 1597, "text": "And the answer is we don't know."}, {"time": 1600, "text": "Well, let me ask you a difficult question because."}, {"time": 1602, "text": "As opposed to the easy ones that you've been asking so far."}, {"time": 1605, "text": "Well, Dostoevsky is always just a warm up."}, {"time": 1610, "text": "So if death every single day is the way to progress through life, you have become quite famous."}, {"time": 1618, "text": "Death and hell."}, {"time": 1621, "text": "Because you don't want to forget the hell part."}, {"time": 1624, "text": "Do you worry that your fame traps you into the person that you were before?"}, {"time": 1632, "text": "Yeah, well, Elvis became an Elvis impersonator by the time he died."}, {"time": 1636, "text": "Yeah, do you fear that you have become a Jordan Peterson impersonator?"}, {"time": 1640, "text": "Do you fear of, in some part, becoming the famous suit wearing brilliant Jordan Peterson, the certainty in the pursuit of truth, always right?"}, {"time": 1654, "text": "I think I worry about it more than anything else."}, {"time": 1658, "text": "I hope I do."}, {"time": 1659, "text": "I better."}, {"time": 1659, "text": "Has fame, to some degree, when you look at yourself in the mirror, in the quiet of your mind, has it corrupted you?"}, {"time": 1667, "text": "No doubt, in some regard."}, {"time": 1670, "text": "I mean, it's a very difficult thing to avoid because things change around you."}, {"time": 1677, "text": "People are much more likely to do what you ask, for example."}, {"time": 1681, "text": "And so that's a danger because one of the things that keeps you dying properly is that people push back against you optimally."}, {"time": 1688, "text": "This is why so many celebrities spiral out of control, especially the tyrannical types that, say, run countries."}, {"time": 1695, "text": "Everyone around them stops saying, yeah, you're deviating a little bit there."}, {"time": 1700, "text": "They laugh at all their jokes."}, {"time": 1701, "text": "They open all their doors."}, {"time": 1702, "text": "They always want something from them."}, {"time": 1705, "text": "The red carpet's always rolled out."}, {"time": 1707, "text": "It's like, well, you think, wouldn't that be lovely?"}, {"time": 1709, "text": "It's, well, not if the red carpet is rolled out to you while you're on your way to perdition."}, {"time": 1716, "text": "That's not a good deal."}, {"time": 1717, "text": "You just get there more efficiently."}, {"time": 1720, "text": "And so one of the things that I've tried to learn to manage is to have people around me all the time who are critics, who are saying, yeah, I could have done that better."}, {"time": 1730, "text": "And you're a little too harsh there."}, {"time": 1732, "text": "And you're alienating people unnecessarily there."}, {"time": 1735, "text": "And you should have done some more background work there."}, {"time": 1738, "text": "And I think the responsibility attendant upon that increases as your influence increases."}, {"time": 1744, "text": "And as your influence increases, then that becomes a lot of responsibility."}, {"time": 1752, "text": "So and then maybe have an off day."}, {"time": 1754, "text": "And well, here's an example."}, {"time": 1757, "text": "I've been writing some columns lately about things that perturb me, like the forthcoming famine, for example."}, {"time": 1765, "text": "And it's hard to take those problems on."}, {"time": 1770, "text": "It's difficult to take those problems on in a serious manner, and it's frightening."}, {"time": 1775, "text": "And it would be easier just to go up to the cottage with my wife and go out on the lake and watch the sunset."}, {"time": 1780, "text": "And so I'm tempted to draw on anger as a motivating energy to help me overcome the resistance to doing this."}, {"time": 1792, "text": "But then that makes me more harsh and judgmental in my tone when I'm reading such things, for example, on YouTube than might be optimal."}, {"time": 1800, "text": "Now, I've had debates with people about that because I have friends who say, no, if you're calling out the environmentalists, globalists who are harassing the Dutch farmers, then a little anger is just the ticket."}, {"time": 1815, "text": "But then others say, well, you don't want to be too harsh because you alienate people who would otherwise listen to you."}, {"time": 1822, "text": "It's like, that's a hard balance to get right."}, {"time": 1824, "text": "But also maybe anger hardens your mind to where you don't notice the subtle quiet beauty of the world, the quiet love that's always there that permeates everything."}, {"time": 1836, "text": "Sometimes you can become deeply cynical about the world if it's the Nietzsche thing."}, {"time": 1841, "text": "Battle not with monsters lest ye become a monster."}, {"time": 1845, "text": "And if you gaze into the abyss, the abyss gazes also into you."}, {"time": 1850, "text": "But I would say, bring it on."}, {"time": 1856, "text": "Right, because I also say knowing that he's absolutely right."}, {"time": 1859, "text": "But if you gaze into the abyss long enough, you see the light, not the darkness."}, {"time": 1866, "text": "Are you sure about that?"}, {"time": 1868, "text": "I'm betting my life on it."}, {"time": 1870, "text": "Yeah, that's a heck of a bet."}, {"time": 1872, "text": "Because it might distort your mind to where all you see."}, {"time": 1877, "text": "Is abyss."}, {"time": 1878, "text": "Is abyss, is the evil in this world."}, {"time": 1881, "text": "Well, then I would say you haven't looked long enough."}, {"time": 1884, "text": "You know, that's back to the."}, {"time": 1885, "text": "You just eliminated."}, {"time": 1886, "text": "The swords, the flaming swords."}, {"time": 1888, "text": "It's like, so I said the whole story of Christ was prefigured in that image."}, {"time": 1893, "text": "It's like the story of Christ psychologically is radical acceptance of the worst possible tragedy."}, {"time": 1900, "text": "That's what it means, that's what the crucifix means."}, {"time": 1902, "text": "Psychologically, it's like gaze upon that which you are most afraid of."}, {"time": 1906, "text": "But that story doesn't end there."}, {"time": 1908, "text": "Because in the story, Christ goes through death into hell."}, {"time": 1913, "text": "So death isn't enough."}, {"time": 1915, "text": "The abyss, the abyss of innocent death is not sufficient to produce redemption."}, {"time": 1920, "text": "It has to be a voluntary journey to hell."}, {"time": 1923, "text": "And maybe that's true for everyone."}, {"time": 1926, "text": "And that's like, there is no more terrifying idea than that, by definition."}, {"time": 1930, "text": "And so then, well, do you gaze upon that?"}, {"time": 1933, "text": "Well, who knows?"}, {"time": 1938, "text": "How often do you gaze upon death, your own?"}, {"time": 1942, "text": "How often do you remember, remind yourself that this ride ends?"}, {"time": 1947, "text": "Personally?"}, {"time": 1948, "text": "Personally."}, {"time": 1950, "text": "Because you, as a deep thinker and a philosopher, it's easy to start philosophizing and forgetting that you're, you might die today."}, {"time": 1960, "text": "The angel of death sits on every word."}, {"time": 1965, "text": "How often do you actually consciously?"}, {"time": 1969, "text": "Notice the angel?"}, {"time": 1973, "text": "I think it's one of the things that made me peculiar."}, {"time": 1977, "text": "When I was in graduate school, you know, I thought about, I was, I had the thought of death in my mind all the time."}, {"time": 1985, "text": "And I noticed that many of the people that I was with, these were people I admired, fine."}, {"time": 1989, "text": "That wasn't part of their character, but it was definitely part of mine."}, {"time": 1993, "text": "I'd wake up every morning, this happened for years, think, time's short, get at it."}, {"time": 1999, "text": "Time's short, get at it."}, {"time": 2001, "text": "There's things to do."}, {"time": 2003, "text": "And so that was always, it's still there."}, {"time": 2005, "text": "And it's still there with, I would say, and it's unbearable in some sense."}, {"time": 2011, "text": "Like what's your relationship?"}, {"time": 2013, "text": "You know, I was ready to die a year ago and not casually."}, {"time": 2020, "text": "I had people I loved, you know."}, {"time": 2027, "text": "So no, I'm not very worried about me, but I'm very worried about making a mistake."}, {"time": 2033, "text": "I heard Elon Musk talk about that a couple of months ago."}, {"time": 2035, "text": "It was really a striking moment."}, {"time": 2037, "text": "Someone asked him about death and he said just offhand and then went on with the conversation."}, {"time": 2042, "text": "He said, I'd be a relief."}, {"time": 2043, "text": "And then he went on with the conversation."}, {"time": 2046, "text": "And I thought, well, you know, he's got a lot of weight on his shoulders."}, {"time": 2051, "text": "I'm sure that part of him thinks I'd be easier just if this wasn't here at all."}, {"time": 2058, "text": "Now he said it offhand, but it was a telling moment in my estimation."}, {"time": 2061, "text": "So for him, that's a why live question."}, {"time": 2066, "text": "The exhaustion of life, if you call it life is suffering, but the hardship."}, {"time": 2072, "text": "I'm more afraid of hell than death."}, {"time": 2076, "text": "You're afraid of the thing that follows?"}, {"time": 2080, "text": "I don't know if it follows or if it's always here."}, {"time": 2084, "text": "And I think we're gonna find out."}, {"time": 2087, "text": "What's the connection between death and hell?"}, {"time": 2095, "text": "Is there something that needs to be done before you arrive?"}, {"time": 2098, "text": "You're more likely to die terribly if you live in a manner that brings you to hell."}, {"time": 2103, "text": "That's one connection."}, {"time": 2104, "text": "And terribly is a very deep kind of concept."}, {"time": 2113, "text": "And that's the definition, by the way."}, {"time": 2116, "text": "What do you make of Elon Musk?"}, {"time": 2117, "text": "You've spoken about him a bit."}, {"time": 2119, "text": "You met him."}, {"time": 2120, "text": "I'm struck with admiration."}, {"time": 2122, "text": "That's what I make of him."}, {"time": 2123, "text": "And I always think of that as a primary."}, {"time": 2126, "text": "Well, it's like, do you find this comedian funny?"}, {"time": 2129, "text": "It's like, well, I laugh at him."}, {"time": 2132, "text": "It's not propositional again."}, {"time": 2134, "text": "And so I would, there are things I would like to ask Mr. Musk about."}, {"time": 2141, "text": "The Mars venture."}, {"time": 2142, "text": "I don't know what he's up to there."}, {"time": 2144, "text": "It strikes me as absurd in the most fundamental sense because I think, well, it'd be easier just to build an outpost in the Antarctica or in the desert."}, {"time": 2152, "text": "Well, how much of the human endeavor is absurd?"}, {"time": 2154, "text": "Well, that's what it needs to say."}, {"time": 2156, "text": "Great men are seldom credited with their stupidity."}, {"time": 2159, "text": "Who the hell knows what Musk is up to?"}, {"time": 2161, "text": "I mean, obviously he's building rockets."}, {"time": 2163, "text": "Now he's motivated because he wants to build a platform for life on Mars."}, {"time": 2168, "text": "Is that a good idea?"}, {"time": 2171, "text": "Who am I to say?"}, {"time": 2173, "text": "He's building the rockets, man."}, {"time": 2174, "text": "But I'd like to ask him about it."}, {"time": 2176, "text": "I would like to see that conversation."}, {"time": 2179, "text": "I do think that having talked to him quite a bit offline, I think these, several of his ideas like Mars, like humans becoming a multi planetary species could be one of the things that human civilization looks back at as, duh, I can't believe he is one of the few people that was really pushing this idea because it's the obvious thing for society, for life to survive."}, {"time": 2208, "text": "Yeah, well, it isn't obvious to me that I'm in any position to evaluate Elon Musk."}, {"time": 2212, "text": "Like I would like to talk to him and find out what he's up to and why, but I mean, he's an impossible person."}, {"time": 2218, "text": "What he's done is impossible, all of it."}, {"time": 2221, "text": "It's like he built an electric car that works."}, {"time": 2223, "text": "Now, does it work completely and will it replace gas cars or should it?"}, {"time": 2227, "text": "I don't know, but if we're gonna build electric cars, he seems to be the best at that by a lot."}, {"time": 2234, "text": "And he more or less did that, people carp about him, but he more or less did that by himself."}, {"time": 2238, "text": "I know he's very good at distributing responsibility and all of that, but he's the spearhead."}, {"time": 2243, "text": "And then that was pretty hard."}, {"time": 2245, "text": "And then he built a rocket at like one 10th the price of NASA rockets."}, {"time": 2250, "text": "And then he shot his car out into space."}, {"time": 2253, "text": "That's pretty hard."}, {"time": 2254, "text": "And then he's building this boring company, more or less as a, what would you call it?"}, {"time": 2261, "text": "It's sort of, it's this whimsical joke in some sense, but it's not a joke."}, {"time": 2267, "text": "And Neuralink delving into the depths of the mind."}, {"time": 2271, "text": "And Starlink."}, {"time": 2272, "text": "It's like, go Elon, as far as I'm concerned."}, {"time": 2275, "text": "And then he puts his finger on things so oddly."}, {"time": 2278, "text": "The problem is underpopulation."}, {"time": 2281, "text": "It's like, I think so too."}, {"time": 2282, "text": "I think it's a terrible problem that we're, the West for example, is no longer at replacement with regard to birth rate."}, {"time": 2290, "text": "It means we've abandoned the Virgin and the child in a most fundamental sense."}, {"time": 2294, "text": "It's a bloody catastrophe."}, {"time": 2296, "text": "And Musk, he sees it clear as can be."}, {"time": 2299, "text": "It's like, wow, and where everyone else is running around going, oh, there's too many people."}, {"time": 2304, "text": "It's like, nope, got that."}, {"time": 2306, "text": "Not only, see, I've learned that there are falsehoods and lies and there are antitruths."}, {"time": 2313, "text": "And an antitruth is something that's so preposterous that you couldn't make a claim that's more opposite to the truth."}, {"time": 2322, "text": "And the claim that there are too many people on the planet is an antitruth."}, {"time": 2326, "text": "So, you know, people say, well, you have to accept limits to growth and et cetera."}, {"time": 2332, "text": "It's like, I have to accept the limits that you're going to impose on me because you're frightened of the future."}, {"time": 2340, "text": "That's your theory, isn't it?"}, {"time": 2344, "text": "Well, it's an idea."}, {"time": 2345, "text": "It could be a right idea."}, {"time": 2347, "text": "It could be a wrong idea."}, {"time": 2348, "text": "I don't think antitruth."}, {"time": 2351, "text": "Here, I'll tell you why it's the wrong idea, I think."}, {"time": 2353, "text": "So imagine that there's an emergency, dragon."}, {"time": 2357, "text": "There's a dragon."}, {"time": 2359, "text": "Someone comes and says, there's a dragon."}, {"time": 2361, "text": "I'm the guy to deal with it."}, {"time": 2363, "text": "That's what the environmentalists say, the radical types who push limits to growth."}, {"time": 2368, "text": "Then I look at them and I think, okay, is that dragon real or not?"}, {"time": 2375, "text": "Well, is the..."}, {"time": 2376, "text": "I ask that question of myself every time when I spend time alone."}, {"time": 2379, "text": "Is the apocalypse looming on the environmental front?"}, {"time": 2382, "text": "Yes or no?"}, {"time": 2382, "text": "I'll just leave that aside for the time being."}, {"time": 2385, "text": "I think you can make a case both ways for a bunch of different reasons."}, {"time": 2389, "text": "And it's not a trivial concern."}, {"time": 2391, "text": "And we've overfished the oceans terribly."}, {"time": 2394, "text": "And there are environmental issues that are looming large."}, {"time": 2398, "text": "Whether climate change is the cardinal one or not is a whole different question, but we won't get into that."}, {"time": 2403, "text": "That's not the issue."}, {"time": 2404, "text": "You're clamoring about a dragon."}, {"time": 2408, "text": "Why should I listen to you?"}, {"time": 2410, "text": "Well, let's see how you're reacting to the dragon."}, {"time": 2413, "text": "First of all, you're scared stiff and in a state of panic."}, {"time": 2417, "text": "That might indicate you're not the man for the job."}, {"time": 2420, "text": "Second, you're willing to use compulsion to harness other people to fight the dragon for you."}, {"time": 2427, "text": "So now not only are you terrified, you're a terrified tyrant."}, {"time": 2432, "text": "So then I would say, well, then you're not the Moses that we need to lead us out of this particular exodus."}, {"time": 2438, "text": "And maybe that's a neurological explanation."}, {"time": 2441, "text": "It's like, if you're so afraid of what you're facing that you're terrified into paralysis and nihilism and that you're willing to use tyrannical compulsion to get your way, you are not the right leader for the time."}, {"time": 2454, "text": "So then I like someone like Bjorn Lomborg or Matt Ridley or Marion Toopy."}, {"time": 2459, "text": "And they say, well, look, we've got our environmental problems."}, {"time": 2463, "text": "And maybe you could make a case that there's a Malthusian element in some situations, but fundamentally the track record of the human race is that we learn very fast and faster all the time to do more with less, and we've got this."}, {"time": 2483, "text": "And I think, yes, to that idea."}, {"time": 2487, "text": "And I think about it in a fundamental way."}, {"time": 2492, "text": "It's like, I trust Lomborg, I trust Toopy, trust Matt Ridley."}, {"time": 2498, "text": "They've thought about these things deeply."}, {"time": 2500, "text": "They're not just saying, oh, the environment doesn't matter, whatever the environment is."}, {"time": 2505, "text": "You know, the environment, I don't even know what that is."}, {"time": 2507, "text": "That's everything, the environment."}, {"time": 2509, "text": "I'm concerned about the environment."}, {"time": 2511, "text": "It's like, which is, how is that different than saying I'm worried about everything?"}, {"time": 2517, "text": "How are those statements different semantically?"}, {"time": 2520, "text": "Well, yeah, the environment, it could be, I'm worried about human society."}, {"time": 2524, "text": "A lot of these complex systems are difficult to talk about because there's so much involved for sure."}, {"time": 2530, "text": "And then these models, because people have gone after me because I don't buy the climate models."}, {"time": 2535, "text": "Well, I think about the climate models as extended into the economic models because the climate model is, well, there's gonna be a certain degree of heating, let's say by 2100."}, {"time": 2547, "text": "It's like, okay, some of that might be human generated."}, {"time": 2550, "text": "Some of it's a consequence of warming after the ice age."}, {"time": 2553, "text": "This has happened before, but fair enough."}, {"time": 2556, "text": "Let's take your presumption."}, {"time": 2558, "text": "Although there are multiple presumptions and any error in your model multiplies as time extends, but have it your way."}, {"time": 2566, "text": "Okay, now we're gonna extend the climate model, so to speak, into the economic model."}, {"time": 2570, "text": "So I just did an analysis of a paper by Deloitte, third biggest company in the US, 300,000 employees, major league consultants."}, {"time": 2581, "text": "They just produced a report in May."}, {"time": 2583, "text": "I wrote an article for it in the Telegraph, which I'm gonna release this week on my YouTube channel."}, {"time": 2588, "text": "Said, well, if we get the climate problem under control economically, because that's where the models are now being generated on the economic front."}, {"time": 2598, "text": "So now we have to model the environment, that's climate, and we have to model the economy, and then we have to model their joint interaction, and then we have to predict 100 years into the future, and then we have to put a dollar value on that, and then we have to claim that we can do that, which we can't, and then this is our conclusion."}, {"time": 2620, "text": "We're going to go through a difficult period of privation, because if we don't accept limits to growth, there's gonna be a catastrophe, 50 years in the future or thereabouts."}, {"time": 2629, "text": "And so to avert that catastrophe, we are going to make people poorer now."}, {"time": 2635, "text": "How much poorer?"}, {"time": 2636, "text": "Well, not a lot compared to how much richer they're going to be, but definitely, and they say this in their own models, definitely poorer, definitely poorer than they would be if we just left them the hell alone."}, {"time": 2649, "text": "And so then I think, okay, poorer, eh?"}, {"time": 2655, "text": "Well, let's look at it biologically."}, {"time": 2657, "text": "Got a hierarchy, right, of stability and security."}, {"time": 2662, "text": "That's a hierarchy or one type."}, {"time": 2665, "text": "You stress a hierarchy like that, a social hierarchy."}, {"time": 2667, "text": "So there's birds in an environment, and an avian flu comes in, and then you look at the birds in the social hierarchy, and the low ranking birds have the worst nests."}, {"time": 2678, "text": "So they're most exposed to wind and rain and sun and farthest from food supplies and most exposed to predators."}, {"time": 2684, "text": "And so those birds are stressed, which is what happens to you at the bottom of a hierarchy."}, {"time": 2687, "text": "You're more stressed because your life is more uncertain."}, {"time": 2691, "text": "You're more stressed."}, {"time": 2691, "text": "Your immunological function is compromised because of that."}, {"time": 2695, "text": "You're sacrificing the future for the present."}, {"time": 2698, "text": "An avian flu comes in, and the birds die from the bottom up."}, {"time": 2701, "text": "That happens in every epidemic."}, {"time": 2703, "text": "You die from the bottom up."}, {"time": 2706, "text": "Okay, so they say when the aristocracy catches a cold, the working class dies of pneumonia."}, {"time": 2713, "text": "All right, so now we're gonna make people poorer."}, {"time": 2716, "text": "Okay, who?"}, {"time": 2718, "text": "Well, we know who we make poor when we make people poorer."}, {"time": 2722, "text": "We make those who are barely hanging on poorer."}, {"time": 2728, "text": "It means they die."}, {"time": 2730, "text": "And so what the Deloitte consultants are basically saying is, well, you know, it's kind of unfortunate, but according to our models, a lot of poor people are gonna have to die so that a lot more poor people don't die in the future."}, {"time": 2747, "text": "It's like, okay, hold on a sec."}, {"time": 2749, "text": "Which of those two things am I supposed to regard with certainty?"}, {"time": 2752, "text": "The hypothetical poor people that you're gonna hypothetically save 100 years from now, or the actual poor people that you are actually going to kill in the next 10 years?"}, {"time": 2765, "text": "Well, I'm gonna cast my lot with the actual poor people that you're actually going to kill."}, {"time": 2771, "text": "And so, and then I think further, it's like, well, okay, the Deloitte consultants, have you actually modeled the world?"}, {"time": 2778, "text": "Or is this a big advertising shtick designed to attract your corporate clients with demonstration that you're so intelligent that you can actually model the entire ecosystem of the world, including the economic system, and predict it 100 years forward?"}, {"time": 2792, "text": "And isn't there a bit of a moral hazard in making a claim like that?"}, {"time": 2796, "text": "Just like just a trifle, especially when..."}, {"time": 2799, "text": "So I talked to Bjorn Lomborg and Michael Yon last week."}, {"time": 2802, "text": "I accepted the UN estimates of starvation this coming year."}, {"time": 2807, "text": "150 million people will suffer food insecurity."}, {"time": 2811, "text": "Food insecurity."}, {"time": 2813, "text": "Yeah, food insecurity, that's the bloody buzzword."}, {"time": 2817, "text": "Famine."}, {"time": 2818, "text": "Well, Michael Yon thought 1.2 billion, and then that it'll spiral because he said, what happens in a famine is that the governments go nuts, crazy, the governments destabilize, and then they appropriate the food from the farmers."}, {"time": 2836, "text": "Then the farmers don't have any money."}, {"time": 2838, "text": "Then they can't grow crops."}, {"time": 2840, "text": "And I think, yeah, that's exactly what they do."}, {"time": 2842, "text": "That's exactly what would happen."}, {"time": 2844, "text": "And so Yon told me 1.2 billion, and then Bjorn Lomborg said the same thing."}, {"time": 2850, "text": "I didn't even ask him."}, {"time": 2851, "text": "He just made it as an offhand comment."}, {"time": 2855, "text": "So... Let me ask you about the famine of the 30s."}, {"time": 2861, "text": "Do you think..."}, {"time": 2862, "text": "In the Ukraine?"}, {"time": 2863, "text": "In the Ukraine."}, {"time": 2865, "text": "Fun, fun, fun."}, {"time": 2865, "text": "Similar, a lot of the things you mentioned in the last few sentences kind of echo to that part of human history."}, {"time": 2873, "text": "The hole in the door."}, {"time": 2875, "text": "Do you... No one knows about."}, {"time": 2878, "text": "Well, now I've just spent four weeks in Ukraine."}, {"time": 2882, "text": "There's different parts of the world that still, even if they don't know, they know."}, {"time": 2888, "text": "They feel."}, {"time": 2889, "text": "They feel history runs in the blood."}, {"time": 2892, "text": "The Dutch knew, in some sense."}, {"time": 2894, "text": "They had a famine at the end of World War II."}, {"time": 2896, "text": "And part of the reason the Dutch farmers are so unbelievably efficient and productive is that the Dutch swore at the end of World War II that that was not going to happen again."}, {"time": 2906, "text": "And then they had to scrape land out of the ocean because Holland, that's quite a country."}, {"time": 2911, "text": "It shouldn't even exist."}, {"time": 2912, "text": "The fact that it's the world's number two exporter."}, {"time": 2916, "text": "It's the world's number two exporter of agricultural products, Holland."}, {"time": 2919, "text": "It's like, I don't think it's as big as Massachusetts."}, {"time": 2923, "text": "It's this little tiny place."}, {"time": 2926, "text": "And they want to put, here's the plan."}, {"time": 2929, "text": "Let's put 30% of the farmers out of business."}, {"time": 2932, "text": "While the broader ecosystem of agricultural production in Holland is 6% of their GDP."}, {"time": 2938, "text": "Now these centralizing politicians think, tell me if I'm stupid about this."}, {"time": 2943, "text": "Take an industry, you knock it back by fiat by 30%."}, {"time": 2952, "text": "Now it runs on like a 3% profit margin."}, {"time": 2955, "text": "Now you're going to kill 30% of it."}, {"time": 2958, "text": "How are you not going to bring the whole thing down?"}, {"time": 2960, "text": "The whole farming ecosystem down?"}, {"time": 2962, "text": "How are you not going to impoverish the transport systems?"}, {"time": 2967, "text": "How are you not going to demolish the grocery stores?"}, {"time": 2970, "text": "You can't take something like that and pare it back by fiat by 30% and not kill it."}, {"time": 2977, "text": "I can't see how you can do that."}, {"time": 2979, "text": "I mean, look what we did with the COVID lockdowns."}, {"time": 2981, "text": "We broke the supply chains."}, {"time": 2983, "text": "We tried buying something lately."}, {"time": 2986, "text": "You can't, and wait, and aren't the Chinese threatening Taiwan at the moment?"}, {"time": 2990, "text": "What are we going to do without chips?"}, {"time": 2993, "text": "So I don't know what these people are thinking."}, {"time": 2996, "text": "And then I think, okay, what are they thinking?"}, {"time": 2998, "text": "Well, the Deloitte people are thinking, aren't we smart and shouldn't we be hired by our corporate employers?"}, {"time": 3002, "text": "It's like, okay, too bad about the poor."}, {"time": 3006, "text": "What are the environmentalists thinking?"}, {"time": 3009, "text": "We love the planet."}, {"time": 3011, "text": "It's like, do you?"}, {"time": 3012, "text": "We love the poor."}, {"time": 3014, "text": "Okay, let's pit the planet against the poor."}, {"time": 3018, "text": "Okay, you don't love the poor that much."}, {"time": 3021, "text": "Do you love the planet or do you hate capitalism?"}, {"time": 3024, "text": "Let's pit those two things against each other."}, {"time": 3027, "text": "Oh, well, it turns out we actually hate capitalism."}, {"time": 3029, "text": "How can we tell?"}, {"time": 3031, "text": "Because you're willing to break it."}, {"time": 3033, "text": "And you know what's going to happen."}, {"time": 3034, "text": "So what's going to happen in Sri Lanka with these 20 million people who now have nothing to eat?"}, {"time": 3039, "text": "Are they going to eat all the animals?"}, {"time": 3040, "text": "Are they going to burn all the firewood?"}, {"time": 3042, "text": "They're stockpiling firewood in Germany."}, {"time": 3045, "text": "It's like, so is your environmental globalist utopia going to kill the poor and destroy the planet?"}, {"time": 3051, "text": "And that's okay, because we'll wipe out capitalism."}, {"time": 3055, "text": "Yeah, the dragon and the fear of the dragon drives ideologies, some of which can build a better world, some of which can destroy that world."}, {"time": 3063, "text": "Now, what do you think of that theory about trustworthiness?"}, {"time": 3067, "text": "If the dragon that you're facing turns you into a terrified tyrant, you're not the man for the job."}, {"time": 3074, "text": "Is that a good theory?"}, {"time": 3075, "text": "It's an interesting theory."}, {"time": 3076, "text": "Let me use that theory to challenge, because what does terror look like?"}, {"time": 3080, "text": "Let me table the turns, turn the tables on you."}, {"time": 3087, "text": "You are terrified, afraid, concerned about the dragon of something we can call communism, Marxism."}, {"time": 3103, "text": "Am I terrified of it?"}, {"time": 3105, "text": "Well, okay, okay."}, {"time": 3106, "text": "I'm not terrified enough to be a tyrant."}, {"time": 3107, "text": "Your theories had two components."}, {"time": 3109, "text": "I'm not paralyzed."}, {"time": 3111, "text": "Had a dragon."}, {"time": 3112, "text": "Yeah, I'm not paralyzed, and I don't wanna be a tyrant."}, {"time": 3115, "text": "The tyrant part, I think, is missing with you."}, {"time": 3119, "text": "But you are very concerned."}, {"time": 3120, "text": "The intensity of your feeling does not give much space, actually, at least in your public persona, for sitting quietly with the dragon and sipping on a couple of beers and thinking about this thing."}, {"time": 3136, "text": "The intensity of your anger, concern about certain things you're seeing in society, is that going to drive you off the path that ultimately takes us to a better world?"}, {"time": 3150, "text": "I mean, I'm trying to get that right."}, {"time": 3153, "text": "So we've kind of come to a cultural conclusion about the Nazis."}, {"time": 3158, "text": "Do you get to be angry about the Nazis?"}, {"time": 3160, "text": "Seems the answer to that is yes."}, {"time": 3162, "text": "Well, actually, let me push back here."}, {"time": 3167, "text": "I also don't trust people who are angry about the Nazis."}, {"time": 3171, "text": "I mean the actual Nazis."}, {"time": 3173, "text": "Well, as you know, there's a lot of people in the world that use actual Nazis to mean a lot of things."}, {"time": 3185, "text": "One of them is very important to me."}, {"time": 3187, "text": "Me, for example."}, {"time": 3189, "text": "He's a Nazi, or magical super Nazi, as it turns out."}, {"time": 3193, "text": "I think they actually sort of steel man all their perspectives."}, {"time": 3196, "text": "I think a lot of people that call you a Nazi mean it."}, {"time": 3203, "text": "I'm aware of that."}, {"time": 3204, "text": "There's an important thing there though, because I went to the front in Ukraine, and a lot of the people that lost their home or they're kind of, that got to interact a lot with the Russian soldiers, the Ukrainian people that interact with the Russian soldiers, they reported that the Russian soldiers really believe they're saving the people of Ukraine in these local villages from the Nazis."}, {"time": 3235, "text": "I understand, yeah."}, {"time": 3236, "text": "So to them, it's not just that the Ukrainian government has or Ukraine has some Nazis, it's like it has been, the idea is that the Nazis have taken over Ukraine and we need to free them."}, {"time": 3249, "text": "This is the belief."}, {"time": 3251, "text": "So this, again, Nazi is still a dragon that lives."}, {"time": 3256, "text": "And it's used by people because it's safe to sit next to that dragon and spread any kind of ideology you want."}, {"time": 3262, "text": "So I just wanted to kind of say that we have agreed on this particular dragon, but I still don't trust anybody who uses that one."}, {"time": 3274, "text": "Yeah, but we have issues with boundaries, right?"}, {"time": 3276, "text": "No, no, it's, so this is a very complicated problem, right?"}, {"time": 3280, "text": "So Rene Girard believed that it was a human proclivity to demonize a scapegoat and then drive it out of the village."}, {"time": 3288, "text": "And I've thought about that a lot."}, {"time": 3290, "text": "We need a place to put Satan."}, {"time": 3293, "text": "Seriously, this is a serious issue."}, {"time": 3295, "text": "Should he be inside the village or outside?"}, {"time": 3298, "text": "Well, maybe he should be inside you, right?"}, {"time": 3302, "text": "That's the fundamental essence of the Christian doctrine."}, {"time": 3305, "text": "It's like, Satan is best fought on the battleground of your soul."}, {"time": 3312, "text": "And that's, that's right."}, {"time": 3317, "text": "Can you actually put words to the kind of dragon that you're fighting?"}, {"time": 3320, "text": "Is it communism?"}, {"time": 3322, "text": "It's the spirit of Cain."}, {"time": 3326, "text": "Can you elaborate what the spirit of Cain is?"}, {"time": 3330, "text": "So after Adam and Eve are thrown out of paradise for becoming self conscious, or when they become self conscious, they're destined to work."}, {"time": 3342, "text": "And the reason for that, as far as I can tell, is that to become self conscious is to become aware of the future."}, {"time": 3349, "text": "It's to become aware of death."}, {"time": 3351, "text": "That certainly happens in the Adam and Eve story, to have the scales fall from your eyes."}, {"time": 3356, "text": "And then the consequence of that is that you now have to labor to prevent the catastrophes of the future."}, {"time": 3364, "text": "Work is sacrifice."}, {"time": 3366, "text": "Sacrifice of the present to the future."}, {"time": 3368, "text": "It's delay of gratification, it's maturity."}, {"time": 3372, "text": "It's sacrifice to something as well, and in the spirit of something."}, {"time": 3377, "text": "Okay, so now Adam and Eve have two children, Cain and Abel."}, {"time": 3382, "text": "So those are the first two people in history."}, {"time": 3385, "text": "Because the Garden of Eden doesn't count."}, {"time": 3388, "text": "And they're the first two people who are born rather than created."}, {"time": 3391, "text": "So they're the first two people."}, {"time": 3392, "text": "And that's a hell of a story, because it's a story of fratricidal murder that degenerates into genocide, flood, and tyranny."}, {"time": 3400, "text": "So that's fun for the opening salvo of the story, let's say."}, {"time": 3405, "text": "And Abel and Cain both make sacrifices."}, {"time": 3408, "text": "And for some reason, Abel's sacrifice is please God."}, {"time": 3412, "text": "It's not exactly clear why."}, {"time": 3414, "text": "And Cain's don't."}, {"time": 3416, "text": "Now, there's an implication in the text that it's because Cain's sacrifices are true, are second rate."}, {"time": 3425, "text": "God says that Abel brings the finest to the sacrificial altar."}, {"time": 3429, "text": "He doesn't say that about Cain."}, {"time": 3431, "text": "So you could imagine that Cain is sacrificing away, but he's holding something in reserve."}, {"time": 3436, "text": "He's not all in, he's not bringing his best to the table."}, {"time": 3439, "text": "He's not offering his best to God."}, {"time": 3442, "text": "And so Abel thrives like mad."}, {"time": 3445, "text": "And everyone loves him."}, {"time": 3446, "text": "And he gets exactly what he needs and wants, exactly when he needs and wants it."}, {"time": 3450, "text": "He's favored of God."}, {"time": 3452, "text": "And Cain is bearing this terrible burden forward and working, and his sacrifices are rejected."}, {"time": 3460, "text": "So he gets resentful, really resentful."}, {"time": 3465, "text": "Enough resentful enough to call God out and say something like, this is quite the creation you've got going here."}, {"time": 3475, "text": "I'm breaking myself in half and nothing good's coming my way."}, {"time": 3480, "text": "What the hell's up with that?"}, {"time": 3481, "text": "And then there's Abel, the sun shining on him every day."}, {"time": 3487, "text": "But this is God that Cain's talking to."}, {"time": 3490, "text": "And so God says what Cain least wants to hear, which is what God usually says to people."}, {"time": 3497, "text": "He says, look to your own devices."}, {"time": 3501, "text": "You're not making the sacrifices you should."}, {"time": 3504, "text": "And you know it."}, {"time": 3505, "text": "And then he says something even worse."}, {"time": 3507, "text": "He says, sin crouches at your door like a sexually aroused predatory animal."}, {"time": 3515, "text": "And you've invited it in to have your way, to have its way with you."}, {"time": 3521, "text": "And so he basically says, you have allowed your resentment to preoccupy yourself."}, {"time": 3527, "text": "And now you're brooding upon it and generating something creative, new and awful, possessed by the spirit of resentment."}, {"time": 3536, "text": "And that's why you're in the miserable state you're in."}, {"time": 3539, "text": "So then Cain leaves, his countenance falls, as you might expect, and Cain leaves."}, {"time": 3544, "text": "And he's so incensed by this because God has said, look, your problems are of your own making."}, {"time": 3551, "text": "And not only that, you invited them in."}, {"time": 3553, "text": "And not only that, you engaged in this creatively."}, {"time": 3556, "text": "And not only that, you're blaming it on me."}, {"time": 3558, "text": "And not only that, that's making you jealous of Abel, who's your actual idol and goal."}, {"time": 3563, "text": "And Cain, instead of changing, kills Abel, right?"}, {"time": 3569, "text": "And then Cain's descendants are the first people who make weapons of war."}, {"time": 3575, "text": "And so that's, okay, you wanna know what I think?"}, {"time": 3579, "text": "That's the eternal story of mankind."}, {"time": 3582, "text": "And it's playing out right now, except at a thousand times the rate."}, {"time": 3587, "text": "Can I present to you a difficult truth?"}, {"time": 3592, "text": "Perhaps not a truth, but a thought I have, that it is not always easy to know which among us are the Cain."}, {"time": 3603, "text": "And resentment, it is possible to imagine you as the person who has a resentment towards a particular worldview that you really worry about."}, {"time": 3619, "text": "Yeah, well, I talked to a good friend of mine last week about that publicly, we'll release it."}, {"time": 3625, "text": "So I said, well, do I have a particular animus against the left, let's say?"}, {"time": 3630, "text": "It's like, well, probably."}, {"time": 3633, "text": "Well, first of all, I'm a university professor."}, {"time": 3638, "text": "It's not like the universities are threatened by the right."}, {"time": 3641, "text": "They're threatened by the left, 100%."}, {"time": 3645, "text": "And they're not just threatened a little bit, they're threatened a lot."}, {"time": 3648, "text": "And that threat made it impossible for me to continue in my profession the way I was."}, {"time": 3653, "text": "And it cost me my clinical practice too."}, {"time": 3655, "text": "And that's not over yet because I have 10 lawsuits against me out right now from the College of Psychologists because they've allowed anyone to complain about me anywhere in the world for any reason, and have the choice to follow that up with an investigation, which is a punishment in and of itself, and are doing so."}, {"time": 3675, "text": "And then I've been tortured nearly to death multiple times by bad actors on the left."}, {"time": 3681, "text": "Now I've had my fair share of radical right wingers being unhappy with what I've said, but personally, that's been the left the whole time."}, {"time": 3692, "text": "Not only me, but my family, put my family at risk in a big way and constantly, like not once or twice, because many people get canceled once or twice."}, {"time": 3703, "text": "But I've been canceled like 40 times."}, {"time": 3706, "text": "And I know like 200 people now who've been canceled."}, {"time": 3709, "text": "And I can tell you without doubt, that it is one of the worst experiences of their life."}, {"time": 3716, "text": "And that's if it only happens once."}, {"time": 3718, "text": "And so, and then I also know that the communists killed 100 million people in the 20th century, that the intellectuals excused them for it nonstop and still haven't quit, that almost no one knows about it, and that the specter of resentful Marxism is back in full force."}, {"time": 3739, "text": "And so do I have a bit of an animus against that?"}, {"time": 3742, "text": "Does it go too far?"}, {"time": 3747, "text": "I'm trying to figure that out."}, {"time": 3748, "text": "The story you just told, it seems nearly impossible for you, an intellectual powerhouse, not to have a tremendous amount of resentment."}, {"time": 3759, "text": "And this is the, so let me challenge you."}, {"time": 3761, "text": "Yeah, go right ahead, man."}, {"time": 3762, "text": "Let me challenge you."}, {"time": 3763, "text": "Can you steal, man, the case that the prime minister of this country, Trudeau, wants the best for this country and actually might do good things for this country as an intellectual challenge?"}, {"time": 3782, "text": "He seems to get along well with his wife."}, {"time": 3784, "text": "He has some kids."}, {"time": 3787, "text": "There's no sexual scandals."}, {"time": 3788, "text": "And he's in a position where that could easily be the case."}, {"time": 3791, "text": "He seems to have done some good things on the oceanic management front."}, {"time": 3795, "text": "He's put a fair bit of Canada's oceans into marine protected areas, and that might be his most fundamental legacy, if it's real."}, {"time": 3803, "text": "I've been trying to get information about the actual reality of the protection, and I haven't been able to do that."}, {"time": 3809, "text": "But that's a good thing."}, {"time": 3810, "text": "So sorry, the family thing is, there's some aspect of."}, {"time": 3812, "text": "It speaks to his character."}, {"time": 3813, "text": "This is a character."}, {"time": 3814, "text": "There is some aspect to him that makes him a good man in that sense."}, {"time": 3819, "text": "There's the evidence there."}, {"time": 3821, "text": "He's not a Jeffrey Epstein profligate on the sexual front, so that's something."}, {"time": 3825, "text": "And his wife, they seem to have a real marriage, and he has kids, so good for him."}, {"time": 3831, "text": "That's a good start, by the way, for a leader."}, {"time": 3835, "text": "To be a good man."}, {"time": 3835, "text": "Well, then I also thought, okay, well, after the Liberals had brought in a Harvard intellectual who was a Canadian to be their last leader, he didn't work out, and then they're flailing about for a leader, and the Liberals in Canada are pretty good at maintaining power and leadership, and have been the dominant governing party in Canada for a long time."}, {"time": 3858, "text": "And so they went to Justin and said, well, you know, it's you or a Conservative, and you can imagine that's not a positive specter for someone who's on the left, or even a Liberal, especially, and Trudeau's quite a bit on the left."}, {"time": 3875, "text": "And they said, we need you to run."}, {"time": 3877, "text": "And then I thought, okay, well, the answer to that should have been no, because Trudeau, Justin, has no training for this, no experience."}, {"time": 3886, "text": "He's not, he's a part time drama teacher, fundamentally."}, {"time": 3890, "text": "He hadn't run a business."}, {"time": 3891, "text": "He just didn't know enough to be Prime Minister."}, {"time": 3894, "text": "But then I'm trying to put myself in his position, eh?"}, {"time": 3896, "text": "So it's like, okay, I don't know enough, but I'm young, and we don't want the Conservatives, and they had had a run, a 10 year run, so maybe it was time for a new government."}, {"time": 3905, "text": "I could, maybe I could grow into this man."}, {"time": 3908, "text": "Maybe I could surround myself with good people, and I could learn humbly, and I could become the person I'm now pretending to be, which we all have to do as we move forward, right?"}, {"time": 3920, "text": "And so then I thought, okay, I think you made a mistake there, because you ran only on your father's name, and you didn't have the background, but let's give the devil his due, and say that's no problem."}, {"time": 3933, "text": "Okay, so now what do you do?"}, {"time": 3935, "text": "Well, you get elected, and your first act is to make the cabinet 50% women, despite the fact that only 25% of the elected members are female."}, {"time": 3947, "text": "It's like, okay, you just have your talent pool."}, {"time": 3950, "text": "That was a really bad move for your first move."}, {"time": 3955, "text": "Do you think, where does that move come from?"}, {"time": 3958, "text": "Deep somewhere in the heart?"}, {"time": 3960, "text": "Or is it trying to listen to the social forces of the moment, and try to ride those ways towards maybe greater and greater popularity?"}, {"time": 3972, "text": "By after thinking it through."}, {"time": 3974, "text": "It's like, no, you just have your talent pool for cabinet positions."}, {"time": 3978, "text": "That's what you did."}, {"time": 3979, "text": "There's enough cabinet positions."}, {"time": 3982, "text": "You know, you could argue that each of them met threshold."}, {"time": 3984, "text": "It's like, there's a big difference between threshold and excellent."}, {"time": 3987, "text": "So you don't think that came from a place of compassion?"}, {"time": 3991, "text": "I don't care if it did."}, {"time": 3991, "text": "I don't regard compassion as a virtue."}, {"time": 3994, "text": "Compassion is a reflex, not a virtue."}, {"time": 3996, "text": "You don't think?"}, {"time": 3997, "text": "Judicious compassion is a virtue."}, {"time": 3999, "text": "Wait, wait a minute, wait a minute."}, {"time": 4000, "text": "Compassion can come deep from the human heart and the human mind, I think."}, {"time": 4006, "text": "Are we talking about the same kind of compassion?"}, {"time": 4009, "text": "Trying to understand the suffering in the world."}, {"time": 4010, "text": "Treating adults like infants is not virtuous."}, {"time": 4013, "text": "Well, compassion isn't treating adults like infants."}, {"time": 4018, "text": "I mean, those are just terms."}, {"time": 4021, "text": "Whatever the term is, maybe love is maybe the better word."}, {"time": 4023, "text": "Edible compassion is."}, {"time": 4025, "text": "I mean, I suppose I'm speaking to love."}, {"time": 4028, "text": "You don't think those ideas came from concern?"}, {"time": 4031, "text": "Love is a blend of compassion and encouragement and truth."}, {"time": 4038, "text": "Love is complicated, man."}, {"time": 4040, "text": "Yeah, it has a lot of good things in it, yes."}, {"time": 4042, "text": "If I love you, is it compassion or encouragement you want from me?"}, {"time": 4046, "text": "Yeah, the dance."}, {"time": 4047, "text": "Love is definitely a dance of two humans, ultimately, that leads to the growth of both, yes."}, {"time": 4053, "text": "The growth element is crucial."}, {"time": 4055, "text": "Because the growth element, to foster the growth element, that requires judgment."}, {"time": 4061, "text": "Compassion and judgment, well, even, and have been conceptualized this way forever, two hands of God, mercy and justice."}, {"time": 4068, "text": "They have to operate in tandem, right?"}, {"time": 4070, "text": "And mercy is flawed as you are, you're acceptable."}, {"time": 4078, "text": "It's like, well, do you want that?"}, {"time": 4079, "text": "Do you want your flaws to be acceptable?"}, {"time": 4082, "text": "And the answer to that is no."}, {"time": 4083, "text": "It's like, well, that's where the judgment comes in."}, {"time": 4085, "text": "It's like, but you could be better."}, {"time": 4087, "text": "You could be more than you are."}, {"time": 4089, "text": "And that's the maternal and the paternal in some fundamental sense."}, {"time": 4092, "text": "And there has to be a active exchange of information between those two poles."}, {"time": 4100, "text": "So even if Trudeau was motivated by compassion, and it's like, yeah, just how loving are you, first of all?"}, {"time": 4107, "text": "No, it was a really bad decision."}, {"time": 4109, "text": "And then he's expressed contempt for monetary policy."}, {"time": 4112, "text": "I'm not interested in monetary policy."}, {"time": 4114, "text": "It's like, okay, but you're a prime minister."}, {"time": 4120, "text": "And he's expressed admiration for the Chinese Communist Party, because they can be very efficient in their pursuit of environmental goals."}, {"time": 4128, "text": "It's like, oh yeah, efficiency, eh?"}, {"time": 4132, "text": "The efficiency of the tyranny in the service of your terror."}, {"time": 4137, "text": "And so, and I've watched him repeatedly and I've listened to him a lot."}, {"time": 4140, "text": "And I've tried to do that clinically and with some degree of dispassion."}, {"time": 4145, "text": "And that's hard too, because his father, Pierre, devastated the West in 1982 with the national energy policy."}, {"time": 4155, "text": "And Trudeau is doing exactly the same thing again."}, {"time": 4158, "text": "And so as a westerner as well, I have an inbuilt animus and one that's well deserved, because central Canada, especially the glittery literati elite types in the Ottawa, Montreal, Toronto triangle have exploited the West and expressed contempt for the West far too much for far too long."}, {"time": 4182, "text": "And that's accelerating at the moment, for example, with Trudeau's recent attack on the Canadian farmers."}, {"time": 4188, "text": "He's an enemy of the oil and gas industry."}, {"time": 4192, "text": "It's an utter and absolute bloody catastrophe."}, {"time": 4194, "text": "And look what's happened in Europe, at least in partial consequence."}, {"time": 4198, "text": "And he's no friend to the farmers."}, {"time": 4201, "text": "So I've tried to steel man him."}, {"time": 4204, "text": "I try to put myself in the position of the people that I'm criticizing."}, {"time": 4208, "text": "I think he's a narcissist."}, {"time": 4211, "text": "Do you think there's a degree to which power changed him?"}, {"time": 4214, "text": "If you're not suited for the position, if you're not the man for the position, you can be absolutely 100% sure that the power will corrupt you."}, {"time": 4224, "text": "I mean, at the least, if you don't have the chops for the job, you have to devalue the job to the point where you can feel comfortable inhabiting it."}, {"time": 4235, "text": "So yes, I think that it's corrupted him."}, {"time": 4237, "text": "And I mean, look at him doubling down."}, {"time": 4239, "text": "We wear masks in flights into Canada."}, {"time": 4243, "text": "We have to fill out an arrive can bureaucratic form on our phones because a passport isn't good enough."}, {"time": 4249, "text": "We can't get a passport."}, {"time": 4251, "text": "What if you're 85 and you don't know how to use a smartphone?"}, {"time": 4254, "text": "Oh, well, too bad for you."}, {"time": 4258, "text": "It's like, yes, it's corrupted him."}, {"time": 4261, "text": "Would you talk to him?"}, {"time": 4264, "text": "If you were to sit down and talk with him and he wanted to talk, would you and what kind of things would you talk about, perhaps on your podcast?"}, {"time": 4274, "text": "I don't think I've ever said no to talking to anyone."}, {"time": 4278, "text": "So, which is, you know."}, {"time": 4280, "text": "Would you, would that be a first or would you make that conversation?"}, {"time": 4284, "text": "Do you believe in the power of those kinds of contexts?"}, {"time": 4287, "text": "No, if he was willing to talk to me, I'd talk because I'd like to ask him."}, {"time": 4291, "text": "I have lots of things I'd like to ask him about."}, {"time": 4293, "text": "I mean, I've had political types in Canada on my podcast and tried to ask them questions."}, {"time": 4299, "text": "So, I'd like to know."}, {"time": 4301, "text": "You know, maybe I've got a big part of him wrong."}, {"time": 4304, "text": "And I probably do, but my observation has been that every chance he had to retreat from his pharaonic position, let's say, he doubled down."}, {"time": 4315, "text": "And these, our parliament is not running for the next year."}, {"time": 4321, "text": "It's still zoom in."}, {"time": 4323, "text": "It's still COVID lockdown parliament."}, {"time": 4326, "text": "For the next year, it's already been fatally compromised, perhaps, by the lockdowns for the last couple of years."}, {"time": 4336, "text": "And this is parliament we're talking about."}, {"time": 4339, "text": "Yeah, there's a kind of paralysis, fear driven paralysis that also, in part, some of the most brilliant people I know are lost in this paralysis."}, {"time": 4350, "text": "I don't think people have signed a word to it, but it's almost like a fear of this unknown thing that lurks in the shadows."}, {"time": 4356, "text": "And that, unfortunately, that fear is leveraged by people that, you know, who are in academic circles, who are in faculty or students, and so on, or more in administration."}, {"time": 4370, "text": "And they start to use that fear, which makes me quite uncomfortable."}, {"time": 4375, "text": "It does lend people in the positions of power who are not good at handling that power to become slowly, day by day, a little bit more corrupt."}, {"time": 4387, "text": "I was really trying to figure out, you know, the last two weeks, thinking this through."}, {"time": 4390, "text": "It's like, how do you know?"}, {"time": 4393, "text": "Let's say someone asked me a question in the YouTube comments, said, why can I trust your advice on the environmental front?"}, {"time": 4402, "text": "And I thought, that's a really good question."}, {"time": 4405, "text": "Okay, let's see if we can figure out the principles by which the advice would be trustworthy."}, {"time": 4411, "text": "Okay, how do you know it's not trustworthy?"}, {"time": 4414, "text": "Well, one potential response to that would be the claims are not in accordance with the facts, but, you know, facts are tricky things and it depends on where you look for them."}, {"time": 4426, "text": "So that's a tough one to get right because, for example, Lomberg's fundamental critics argue about his facts, not just his interpretation of them."}, {"time": 4436, "text": "So that can't be an unerring guide."}, {"time": 4437, "text": "And so I thought, well, the facts exactly doesn't work because when it's about everything, there's too many facts."}, {"time": 4445, "text": "So then how do you determine if someone's a trustworthy guide in the face of the apocalyptic unknown?"}, {"time": 4451, "text": "Because that's really the question."}, {"time": 4453, "text": "And the answer is they're not terrified tyrants."}, {"time": 4460, "text": "Now, maybe that's wrong."}, {"time": 4461, "text": "If someone has a better answer."}, {"time": 4462, "text": "How do you know if they're a terrified tyrant?"}, {"time": 4464, "text": "Because they are willing to use compulsion on other people."}, {"time": 4467, "text": "When they could use goodwill."}, {"time": 4469, "text": "Like the farmers in Canada objected."}, {"time": 4472, "text": "They said, look, we have every economic reason to use as little fertilizer as we can."}, {"time": 4479, "text": "Cause it's expensive."}, {"time": 4480, "text": "We have satellite maps of where we put the fertilizer."}, {"time": 4484, "text": "We have cut our fertilizer use so substantially in the last 40 years, you can't believe it."}, {"time": 4490, "text": "And we grow way more food."}, {"time": 4492, "text": "We're already breaking ourselves in half."}, {"time": 4494, "text": "And if you know farmers, especially the ones who still survive, you think those people don't know what they're doing."}, {"time": 4500, "text": "It's like, yeah, they're pretty damn sophisticated man."}, {"time": 4504, "text": "Like way more sophisticated than our prime minister."}, {"time": 4508, "text": "And now you tell them, no, it's a 30% reduction."}, {"time": 4511, "text": "And we don't care how much food you're growing."}, {"time": 4513, "text": "So it's not a reduction that's dependent on amount of food produced per unit of fertilizer used, which would be at least you could imagine it."}, {"time": 4524, "text": "So, okay, so you're producing this much food and you use this much fertilizer."}, {"time": 4528, "text": "So you're hyper efficient."}, {"time": 4530, "text": "Maybe we take the 10% of farmers who are the least efficient in that metric."}, {"time": 4535, "text": "And we say to them, you have to get as efficient as the average farmer."}, {"time": 4539, "text": "And then they say, well, look, you know, our situation's different."}, {"time": 4542, "text": "We're in a more Northern climb, the soil's weaker."}, {"time": 4546, "text": "You know, you obviously have to bargain with that, but at least you reward them for their productivity."}, {"time": 4552, "text": "Well, it's like, well, Holland isn't gonna have beef."}, {"time": 4555, "text": "Well, where are they gonna get it?"}, {"time": 4556, "text": "Well, you don't need it."}, {"time": 4558, "text": "It's like, oh, I see."}, {"time": 4558, "text": "You get to tell me what I can eat now, do you?"}, {"time": 4563, "text": "And Holland is gonna import food from where that's more efficient on the fertilizer front."}, {"time": 4571, "text": "There's no one more efficient than Holland."}, {"time": 4573, "text": "And same with Canada."}, {"time": 4575, "text": "And like, isn't this gonna make food prices more expensive?"}, {"time": 4579, "text": "And doesn't that mean that hungry people die?"}, {"time": 4583, "text": "Cause that is what it means."}, {"time": 4585, "text": "Ultimately, poor people pay the price of these kinds of policies."}, {"time": 4589, "text": "Not known, not ultimately."}, {"time": 4596, "text": "That's a crucial distinction because they say, well, ultimately the poor will benefit."}, {"time": 4600, "text": "Yeah, except the dead ones."}, {"time": 4603, "text": "Today, right."}, {"time": 4605, "text": "It seems like the story of war to, is a time when the poor people suffer from the decision made by the powerful, the rich, the political elite."}, {"time": 4620, "text": "Let me ask you about the war in Ukraine."}, {"time": 4624, "text": "I got into plenty of trouble about that too."}, {"time": 4627, "text": "You're, you're just a man in a suit talking on microphones and writing brilliant articles."}, {"time": 4636, "text": "There's also people dying, fighting."}, {"time": 4640, "text": "It's their land, it's their country, it's their history."}, {"time": 4643, "text": "This is true for both Russia and Ukraine."}, {"time": 4646, "text": "It's people trying to ask, they have many dragons and they're asking themselves a question, who are we?"}, {"time": 4655, "text": "What is the future of this nation?"}, {"time": 4657, "text": "We thought we are a great nation."}, {"time": 4661, "text": "And I think both countries say this."}, {"time": 4664, "text": "And they say, well, how do we become the great nation we thought we are?"}, {"time": 4670, "text": "And so what, first of all, you got in trouble."}, {"time": 4675, "text": "What's the dynamics of the trouble?"}, {"time": 4678, "text": "And is there something you regret saying?"}, {"time": 4681, "text": "No, no, I thought about it a lot."}, {"time": 4683, "text": "I laid out four reasons for the war."}, {"time": 4686, "text": "And then I was criticized in the Atlantic for the argument was reduced to one reason, which was a caricature of the reason."}, {"time": 4695, "text": "I gave a variety of reasons why the war happened."}, {"time": 4698, "text": "Mismanagement on the part of the West in relationship to Russia and foreign policy over the last, since the wall fell."}, {"time": 4706, "text": "It's understandable because it's extremely complex."}, {"time": 4710, "text": "Hyper reliance on Russia as a cardinal source of energy provision for Europe in the wake of idiot environmental globalist utopianism."}, {"time": 4721, "text": "The expansionist tendencies of Russia that are analogous in some sense to the Soviet Union empire building."}, {"time": 4731, "text": "And then the last one, which is the one I got in trouble for, which is Putin's belief or willingness to manipulate his people into believing that Russia is a salvific force in the face of idiot Western wokeism."}, {"time": 4746, "text": "And that's the one I got in trouble for."}, {"time": 4748, "text": "It's like, while you're justifying Putin, it's like, it's not only the Russians that think the West has lost its mind."}, {"time": 4757, "text": "The Eastern Europeans think so too."}, {"time": 4759, "text": "And do I know that?"}, {"time": 4760, "text": "It's like, well, I went to 15 Eastern European countries this spring."}, {"time": 4766, "text": "And I talked to 300 political and cultural leaders."}, {"time": 4769, "text": "And you might say, well, they were all conservatives."}, {"time": 4772, "text": "It's like, actually, no, they weren't."}, {"time": 4775, "text": "Most of them were conservatives."}, {"time": 4777, "text": "Because it turns out that they're more willing to talk to me."}, {"time": 4779, "text": "But a good chunk of them were liberals by any stretch of the imagination."}, {"time": 4786, "text": "And a fair number of them were canceled progressives."}, {"time": 4789, "text": "Well, because you're very concerned about the culture wars that perhaps are a signal of a possible bad future for this country and for this part of the world, that reason stands out."}, {"time": 4806, "text": "And do you, sort of looking back at four reasons, think it deserves to have a place in one of the four?"}, {"time": 4817, "text": "Because it is, you know."}, {"time": 4820, "text": "Well, the four was bifurcated."}, {"time": 4822, "text": "Because I said, look, Putin might believe this."}, {"time": 4824, "text": "And I actually think he does."}, {"time": 4825, "text": "Because I read a bunch of Putin speeches."}, {"time": 4827, "text": "And I have been reading them for 15 years."}, {"time": 4829, "text": "And my sense of people generally, and this was true of Hitler, it's like, what did Hitler believe?"}, {"time": 4835, "text": "Well, did you read what he wrote?"}, {"time": 4837, "text": "He just did what he said he was going to do."}, {"time": 4840, "text": "And you might think, well, some people are so tricky, they have a whole body of elaborated speech that's completely separate from their personality."}, {"time": 4849, "text": "And their personality is pursuing a different agenda."}, {"time": 4852, "text": "And this whole body of speech is nothing but affront."}, {"time": 4857, "text": "It's like, good luck finding someone that sophisticated."}, {"time": 4860, "text": "First of all, if you say things long enough, you're going to believe them."}, {"time": 4862, "text": "That's a really interesting and fascinating and important point."}, {"time": 4865, "text": "Even if you start out as a lie, as a propaganda, I think Hitler is an example of somebody that I think really quickly you start to believe the propaganda."}, {"time": 4876, "text": "Well, you've thought a lot about AI systems."}, {"time": 4879, "text": "It's like, don't you become what you practice?"}, {"time": 4882, "text": "And the answer to that is, well, absolutely."}, {"time": 4884, "text": "We even know the neurology."}, {"time": 4886, "text": "It's like when you first formulate a concept, huge swaths of your cortex are lit up, so to speak."}, {"time": 4892, "text": "But as you practice that, first of all, the right hemisphere stops participating."}, {"time": 4896, "text": "And then the left participates less and less until you build specialized machinery for exactly that conceptual frame."}, {"time": 4905, "text": "And then you start to see it, not just think it."}, {"time": 4909, "text": "And so if you're telling the same lies over and over, who do you think you're fooling?"}, {"time": 4913, "text": "Think, well, I can withstand my own lies, not if they're effective lies."}, {"time": 4918, "text": "And if they're effective enough to fool millions of people, and then they reflect them back to you, what makes you think you're going to be able to withstand that?"}, {"time": 4928, "text": "You aren't."}, {"time": 4928, "text": "And so I do think Putin believes, to the degree that he believes anything, I do believe that he thinks of himself as a bulwark for Christendom against the degeneration of the West."}, {"time": 4943, "text": "And that's that third way that Dugin and Putin have been talking about, the philosopher Alexander Dugin and Putin for 15 years."}, {"time": 4951, "text": "Now, what that is is very amorphous."}, {"time": 4954, "text": "Solzhenitsyn thought the Russians would have to return to the incremental development of Orthodox Christianity to escape from the communist trap."}, {"time": 4964, "text": "And to some degree, that's happened in Russia because there's been a return to Orthodox Christianity."}, {"time": 4969, "text": "Now, you could say, yeah, but the Orthodox church has just been coopted by the state."}, {"time": 4973, "text": "And I would say there's some evidence for that."}, {"time": 4975, "text": "I've heard, for example, that the Metropolitan owns, now I don't know if this is true, owns $5 billion worth of personal property."}, {"time": 4986, "text": "And I would say there's a bit of a moral hazard in that."}, {"time": 4989, "text": "And it's possible that the Orthodox church has been coopted."}, {"time": 4992, "text": "But there has been somewhat of an Orthodox revival in Russia."}, {"time": 4996, "text": "And I don't think that's all bad."}, {"time": 4998, "text": "Now, even if Putin doesn't believe any of this, if he's just a psychopathic manipulator, and unfortunately, I don't think that's true."}, {"time": 5009, "text": "I've read his speeches."}, {"time": 5010, "text": "It doesn't look like it to me."}, {"time": 5012, "text": "And he is by no means the worst Russian leader of the last 100 years."}, {"time": 5017, "text": "Well, there's quite a selection there."}, {"time": 5019, "text": "There certainly is."}, {"time": 5021, "text": "And I say that knowing that."}, {"time": 5025, "text": "Even if he doesn't believe it, he's convinced his people that it's true."}, {"time": 5031, "text": "And so we're stuck with the claim in either case."}, {"time": 5037, "text": "And that's the point I was trying to make in the article."}, {"time": 5039, "text": "Sometimes I'm troubled by people that explain things."}, {"time": 5045, "text": "And a lot of people have reached out to me, experts, telling me how I should feel, what I should think about Ukraine."}, {"time": 5054, "text": "Oh, you naive Lex, you're so naive."}, {"time": 5058, "text": "Here's how it really is."}, {"time": 5060, "text": "But then I get to see people that lost their home."}, {"time": 5064, "text": "I get to see people on the Russian side who believe they're, I genuinely think that there's some degree to which they have love in their heart."}, {"time": 5073, "text": "They see themselves as heroes saving a land from Nazis."}, {"time": 5078, "text": "How else would you motivate young men to go fight?"}, {"time": 5081, "text": "It's just, it's these humans destroying not only their homes, but creating generational hate, destroying the possibility of love towards each other."}, {"time": 5092, "text": "They're basically creating hate."}, {"time": 5094, "text": "What I've heard a lot of is on February 24 of this year, hate was born at a scale that region has not seen."}, {"time": 5104, "text": "Hate towards not Vladimir Putin, hate towards not the soldiers in Russia, but hate towards all Russians."}, {"time": 5112, "text": "Hate that will last generations."}, {"time": 5115, "text": "And then you can see just the pain there."}, {"time": 5123, "text": "And then when all these experts talk about agriculture, and energy, and geopolitics, and yeah, maybe like what you say with fighting the ideologies of the woke and so on, I just feel like it's missing something deep, that war is not fought about any of those things."}, {"time": 5152, "text": "War is started, and war is averted based on human beings, based on humanity."}, {"time": 5158, "text": "Here's another ugly thought, since we haven't had enough so far."}, {"time": 5165, "text": "We locked everything down for COVID."}, {"time": 5168, "text": "How much face to face communication was there between the West and Vladimir Putin?"}, {"time": 5172, "text": "How about none?"}, {"time": 5174, "text": "How about that was the wrong amount, especially given that Europe was completely dependent on Putin for its energy supplies?"}, {"time": 5181, "text": "Well, not completely, but you know what I mean."}, {"time": 5183, "text": "Materially and significantly."}, {"time": 5186, "text": "Maybe he had to go talk to him once every six months."}, {"time": 5188, "text": "Maybe he's in a bit of a bubble."}, {"time": 5191, "text": "And not just an information bubble, how all these experts tell me about."}, {"time": 5196, "text": "Yeah, no, a human bubble."}, {"time": 5199, "text": "Look, one of the things I've really learned, there's a real emphasis on hospitality in the Old Testament."}, {"time": 5205, "text": "I just brought all these scholars together to talk about Exodus."}, {"time": 5208, "text": "Hey, I have this security team with me, and they're tough military guys."}, {"time": 5213, "text": "But they're on board for this mission, let's say."}, {"time": 5217, "text": "And so they went out of their way to be hospitable to my academic guests."}, {"time": 5221, "text": "They laid out nice platters of meat and cheese and crackers."}, {"time": 5224, "text": "They spent all day preparing this house I had rented so that we could have a hospitable time with these scholars."}, {"time": 5229, "text": "Most of whom I didn't know well, but who said they would come and spend eight days talking about this book with me."}, {"time": 5235, "text": "We rented some jet skis."}, {"time": 5236, "text": "We had a nice house."}, {"time": 5238, "text": "We had fun."}, {"time": 5239, "text": "And we got to know each other."}, {"time": 5241, "text": "And we got to trust each other because we could see that we could have some fun and that we could let our hair down a bit."}, {"time": 5246, "text": "We didn't have to be on guard."}, {"time": 5247, "text": "And that made the talks way deeper."}, {"time": 5250, "text": "And then we found out we couldn't get through Exodus in eight days."}, {"time": 5254, "text": "And so I had proposed very early on that we're gonna double the length."}, {"time": 5258, "text": "And so I pulled eight people out of their lives for eight days."}, {"time": 5262, "text": "That's not an easy thing to do."}, {"time": 5264, "text": "It's also quite expensive."}, {"time": 5266, "text": "And the Daily Wire Plus people picked all that up."}, {"time": 5269, "text": "And they said, right."}, {"time": 5270, "text": "They said, yes, right away."}, {"time": 5271, "text": "So we'd love to do this again."}, {"time": 5274, "text": "Well, partly because it was intellectually, it was unbelievably engaging."}, {"time": 5279, "text": "It'll take me like a year to digest it if I can ever digest it."}, {"time": 5284, "text": "But they had a really good time."}, {"time": 5288, "text": "And so when they were offered that combination of intellectual challenge, let's say in hospitality, it was a no brainer."}, {"time": 5295, "text": "They just said, every one of them said, if I can do it in any way, I will definitely be there."}, {"time": 5300, "text": "And this, I went to Washington a bunch of times and the culture of hospitality has broken down in Washington."}, {"time": 5308, "text": "40% of congressmen sleep in their offices."}, {"time": 5311, "text": "They don't have apartments."}, {"time": 5313, "text": "Their family isn't there with them."}, {"time": 5315, "text": "They don't have social occasions with their fellow Democrats or Republicans, much less across the table."}, {"time": 5323, "text": "And so, and I tried to have some meetings in Washington that were bilateral a couple of times, get young Republican congressmen and Democrats together to talk."}, {"time": 5332, "text": "And as soon as they talk, they think, oh, it was so interesting."}, {"time": 5335, "text": "Cause one of the lunches was about 15 people, half Democrats and half Republicans."}, {"time": 5341, "text": "And all I'd asked them to do was just spend three minutes talking about why you decided to become a congressman, which is not a job I would take, by the way."}, {"time": 5349, "text": "You spend 25 hours a week fundraising on the telephone."}, {"time": 5352, "text": "Your family isn't there with you."}, {"time": 5354, "text": "You have to run for reelection every two years."}, {"time": 5357, "text": "You're beholden to the party apparatus, right?"}, {"time": 5360, "text": "You're vilified constantly."}, {"time": 5362, "text": "This is not, you know, people think, well, this is a job for the privileged."}, {"time": 5366, "text": "It's like, yeah, you go and run for Congress and find out how much fun it is and put your family on the line and then have to beg for your job every two years while your enemies, the worst of your enemies and the worst of your friends are viciously hen pecking you."}, {"time": 5381, "text": "And so anyways, we had them all sit around the table and said, okay, just say why you ran for Congress."}, {"time": 5387, "text": "It was so cool, especially for a Canadian, cause you Americans, you're so bloody theatrical."}, {"time": 5391, "text": "It's such something to watch."}, {"time": 5394, "text": "It was like, Mr. Smith goes to Washington for every one of them."}, {"time": 5396, "text": "It's like, well, this country has given us so much, where our families have been so, we've benefited so much from our time here."}, {"time": 5405, "text": "We think this is a wonderful country."}, {"time": 5406, "text": "We really felt that we should give back."}, {"time": 5409, "text": "And the next one would talk."}, {"time": 5410, "text": "And it was like exactly the same story."}, {"time": 5412, "text": "And then it didn't matter if they were Republican or Democrat, you couldn't tell the difference."}, {"time": 5415, "text": "No one could."}, {"time": 5416, "text": "And was it genuine?"}, {"time": 5417, "text": "It's like, well, are you genuine?"}, {"time": 5420, "text": "You think these people are worse than you?"}, {"time": 5423, "text": "First of all, they're not."}, {"time": 5425, "text": "Second of all, they're probably better."}, {"time": 5427, "text": "All things considered, it's not that easy to become a Congressman."}, {"time": 5431, "text": "And I'm sure there's some bad apples in the bunch, but by and large, you walk away from your meetings with these people and you think, pretty impressive."}, {"time": 5442, "text": "They really are giving a part of themselves in the name of service."}, {"time": 5445, "text": "Maybe over time, they become cynical and become jaded and worn down by the whole system."}, {"time": 5452, "text": "But I think a lot of it."}, {"time": 5454, "text": "Could you imagine that?"}, {"time": 5455, "text": "Is healed, I think."}, {"time": 5458, "text": "And I don't think I'm, well, I'm in part naive, but not fully, that a lot of it is healed through the power of conversation, just basic social interaction."}, {"time": 5468, "text": "I do think that the effects of this pandemic."}, {"time": 5471, "text": "Especially by listening."}, {"time": 5473, "text": "Listen, just sitting there."}, {"time": 5475, "text": "And it doesn't have to be talking about the actual issue."}, {"time": 5477, "text": "It's actually humor and all those kinds of things about personal struggles, all those kinds of things that remind you that you're all just humans."}, {"time": 5489, "text": "Well, the great leaders that I've met, and I've met some now, they go listen to their constituents."}, {"time": 5496, "text": "It's not a policy discussion."}, {"time": 5497, "text": "It's not an ideology discussion."}, {"time": 5498, "text": "They go say, okay, what's your life like?"}, {"time": 5502, "text": "And what are your problems?"}, {"time": 5503, "text": "And tell me about them."}, {"time": 5505, "text": "And then they listen and then they're struck by them."}, {"time": 5507, "text": "And then they gather up all that misery and they bring it to the congressional office or to the parliament."}, {"time": 5513, "text": "And they think, here's what the people are crying out for."}, {"time": 5517, "text": "And the good leaders, that's a leader."}, {"time": 5520, "text": "Leader listens."}, {"time": 5522, "text": "So I talked to Jimmy Carr about comedy."}, {"time": 5526, "text": "And he's sold out stages worldwide on a tour, being funny."}, {"time": 5534, "text": "He said, comedy is the most standup comedy, which is what I do in some real sense."}, {"time": 5540, "text": "It's a thing I do that it's most akin to what I'm doing on my book tours, I would say."}, {"time": 5545, "text": "It's the closest analog."}, {"time": 5547, "text": "He said, it's the most dialogical enterprise."}, {"time": 5549, "text": "And I thought, well, why, what do you mean?"}, {"time": 5552, "text": "Cause see, it's just the monologue."}, {"time": 5554, "text": "And it's a prepared monologue."}, {"time": 5556, "text": "I mean, you have to interact dynamically with the audience while you're telling your jokes and you gotta get the timing right, but you have a body of jokes."}, {"time": 5564, "text": "He said, well, here's how you prepare the jokes."}, {"time": 5567, "text": "And I've been told this by other comedians."}, {"time": 5569, "text": "You go to 50 clubs before you go on your tour and you got some new material and you think it's funny."}, {"time": 5575, "text": "And you go into a club and you lay out your new material and people laugh at some of it."}, {"time": 5581, "text": "And you pay attention to what they laugh at and what they don't laugh at."}, {"time": 5586, "text": "So you subject yourself to the judgment of the crowd and you get rid of everything that isn't funny."}, {"time": 5591, "text": "And if you do that enough, even if you're not that funny, the crowd will tell you what's funny."}, {"time": 5597, "text": "So you can imagine, imagine you do 50 shows and each is an hour long and you collect two minutes of humor from each show."}, {"time": 5604, "text": "So you throw away 90, you throw away two hours, more than 98% of it, collect two minutes per show."}, {"time": 5612, "text": "So you're not very funny at all."}, {"time": 5614, "text": "You're like funny 2% of the time."}, {"time": 5615, "text": "You aggregate that, man, you're a scream."}, {"time": 5618, "text": "So that's what a leader does is, that is what a leader does is goes out and he aggregates the misery, you know, and the hopes."}, {"time": 5626, "text": "And then I do think that's revivify to someone who would otherwise be cynical and jaded because then the person can say to themselves, despite the inadequacies of the system and my inadequacies, I'm gathering up the misery and the hope and I'm bringing it forward where it can be redressed."}, {"time": 5646, "text": "Giving it a voice."}, {"time": 5647, "text": "Yeah, that's right, giving it a voice."}, {"time": 5649, "text": "Can you actually take me through a day because this is fascinating, through your comedy tour."}, {"time": 5654, "text": "What does a day in the life of Jordan Peterson look like?"}, {"time": 5660, "text": "Which is this very interesting day."}, {"time": 5662, "text": "Let's look at the day when you have to speak."}, {"time": 5665, "text": "Preparing your mind, thinking of what you're going to talk about, preparing yourself physically and mentally to interact with the crowd through the actual speaking, how do you adjust what you're thinking through and how do you come down from that?"}, {"time": 5681, "text": "So you can start all again as a limited biological system."}, {"time": 5687, "text": "Well, I'm usually up by seven and ready to go by 7.30 or eight."}, {"time": 5696, "text": "Coffee?"}, {"time": 5697, "text": "No, steak and water."}, {"time": 5700, "text": "How many times a day steak?"}, {"time": 5702, "text": "All, that's all I eat."}, {"time": 5703, "text": "How many times?"}, {"time": 5705, "text": "Three or four, depending on the day."}, {"time": 5707, "text": "Steak and water."}, {"time": 5708, "text": "Steak and sparkling water."}, {"time": 5709, "text": "Yeah, so monastic asceticism, man."}, {"time": 5712, "text": "Well, I did the proper, I usually just once a day, I did the proper Jordan Peterson last night and just ate two steaks."}, {"time": 5719, "text": "And how was that?"}, {"time": 5720, "text": "It was wonderful."}, {"time": 5722, "text": "Yeah, well, if you have to only eat one thing, you know, could be worse."}, {"time": 5727, "text": "So anyways, I'm ready to go at eight because we're generally moving."}, {"time": 5731, "text": "What does moving mean?"}, {"time": 5732, "text": "Flying."}, {"time": 5732, "text": "You're constantly."}, {"time": 5733, "text": "Flying somewhere."}, {"time": 5736, "text": "And we usually use private flights now because the commercial airlines aren't reliable enough and you cannot not make a venue, right?"}, {"time": 5744, "text": "So that's rule number one on a tour."}, {"time": 5747, "text": "You make the show."}, {"time": 5750, "text": "So everything, and then number rule number two is anybody who causes any trouble on the tour is gone because there is zero room for error."}, {"time": 5759, "text": "Now, no, there's zero room for unnecessary, unaddressed error."}, {"time": 5765, "text": "So there's gonna be errors."}, {"time": 5766, "text": "The guys I have around me now, if they make a mistake, they fix it right away."}, {"time": 5772, "text": "So, and that's great."}, {"time": 5773, "text": "There's a lot of people relying on you to be there."}, {"time": 5775, "text": "So you have to be there."}, {"time": 5776, "text": "Yeah, like 4,000 people typically."}, {"time": 5779, "text": "So then I'm on the plane and I usually write or often because there's no internet on the plane and that's a good use of time."}, {"time": 5792, "text": "So I'm writing a new book."}, {"time": 5793, "text": "So I write on the plane."}, {"time": 5794, "text": "Typing or handwriting?"}, {"time": 5796, "text": "Typing, yeah, typing."}, {"time": 5798, "text": "And then we land and we go to, it's usually early afternoon by then we go to a hotel."}, {"time": 5807, "text": "It's usually a nice hotel."}, {"time": 5808, "text": "It's not corporate."}, {"time": 5809, "text": "I don't really like corporate hotels."}, {"time": 5811, "text": "My secretary and one of my logistics guys has got quite good at picking kind of adventurous hotels, boutique hotels are usually in the old parts of the city, especially in Europe, somewhere interesting."}, {"time": 5823, "text": "And so we go there and then lunch usually."}, {"time": 5828, "text": "And sometimes that's an air fryer and a steak in the hotel room."}, {"time": 5832, "text": "And I leave a trail of air fryers behind me all across the world."}, {"time": 5835, "text": "And then Tammy and I usually go out and have a walk or something and take a look at the city."}, {"time": 5842, "text": "And then I have a rest for like an hour and a half or an hour, half an hour."}, {"time": 5846, "text": "Like a nap?"}, {"time": 5847, "text": "Yeah, nap."}, {"time": 5847, "text": "I have to sleep for 20 minutes."}, {"time": 5849, "text": "And that's about all I can sleep, but I need to do that in the late afternoon."}, {"time": 5851, "text": "That refreshes your mind."}, {"time": 5852, "text": "Yeah, that gives me, that wakes me up again for the evening."}, {"time": 5856, "text": "And then Tam has to sleep longer."}, {"time": 5858, "text": "She's still recovering from her illness."}, {"time": 5860, "text": "And so she has to sleep longer in the afternoon and that's absolutely necessary for both of us or things start to get frayed."}, {"time": 5866, "text": "And so then we go to the venue and then I usually sit for an hour."}, {"time": 5874, "text": "If I'm gonna lecture, I've been doing a lot of Q and A's and that's a little easier."}, {"time": 5877, "text": "But if I'm gonna lecture, I have to sit for an hour."}, {"time": 5881, "text": "And then I think, okay, what question am I trying to investigate?"}, {"time": 5887, "text": "I have to have that, that's the point."}, {"time": 5889, "text": "What mystery am I trying to unravel?"}, {"time": 5893, "text": "It's usually associated with one of the rules in my book because technically it's a book tour, but each of those rules is an investigation into an ethic."}, {"time": 5901, "text": "And each of them points to a deeper sort of mystery in some sense."}, {"time": 5905, "text": "And there's no end to the amount that can be explored."}, {"time": 5908, "text": "And so I have the question, my question might be something like put your house in perfect order before you criticize the world."}, {"time": 5918, "text": "Okay, what does that mean exactly?"}, {"time": 5920, "text": "What does house mean?"}, {"time": 5922, "text": "What does put mean, that active verb?"}, {"time": 5926, "text": "What is perfect in order mean?"}, {"time": 5928, "text": "Why before you criticize the world?"}, {"time": 5931, "text": "What does it mean to criticize?"}, {"time": 5932, "text": "What does it mean to criticize the world?"}, {"time": 5934, "text": "How can you do that properly or improperly?"}, {"time": 5936, "text": "So I start to think about how to decompose the question."}, {"time": 5939, "text": "And you start to think which of these decompositions are important to really dig into?"}, {"time": 5943, "text": "Yeah, well, then they'll strike me."}, {"time": 5945, "text": "It's like, okay, there's something there that I've been maybe noodling around on that I would like to investigate further."}, {"time": 5951, "text": "Then I think, okay, how can I approach this problem?"}, {"time": 5953, "text": "I think, well, I have this story that I know, I have this story and I have this story, but I haven't juxtaposed them before."}, {"time": 5959, "text": "And there's gonna be some interesting interaction in the juxtaposition."}, {"time": 5963, "text": "So I have the question and I kind of have a framework of interpretation."}, {"time": 5967, "text": "And then I have some potential narrative places I can go."}, {"time": 5971, "text": "And then I think, okay, I can go juggle that and see what happens."}, {"time": 5975, "text": "And so then what I wanna do is concentrate on that process while attending to the audience to make sure that the words are landing and then see if I can delve into it deeply enough so that a narrative emerges spontaneously with an ending."}, {"time": 5990, "text": "Now, I'm sure you've experienced this in podcasts, right?"}, {"time": 5993, "text": "Maybe I'm wrong, but my experience has been if I fall into the conversation and we know about the timeframe, there'll be a natural narrative arc."}, {"time": 6003, "text": "And then, so you'll kind of know when the midpoint is and you'll kind of see when you're reaching a conclusion."}, {"time": 6008, "text": "And then if you really pay attention, you can see that's a good place to stop."}, {"time": 6012, "text": "And it's kind of, you come to a point and you have to be alert and patient to see that."}, {"time": 6020, "text": "And you have to be willing to be satisfied with where you've got to."}, {"time": 6024, "text": "But if you do that, and then it's like a comedian making the punchline work."}, {"time": 6028, "text": "It's like, I've got all these balls in the air and they're going somewhere and this is how they come together."}, {"time": 6036, "text": "And people love that, right?"}, {"time": 6037, "text": "They say, oh, this and this and this and this and this."}, {"time": 6040, "text": "Whack, together."}, {"time": 6042, "text": "And that's an insight."}, {"time": 6043, "text": "And it is very much like a punchline."}, {"time": 6045, "text": "Well, that's interesting because your mind actually, so I'm a fan of your podcast too."}, {"time": 6049, "text": "And you are always driving towards that."}, {"time": 6053, "text": "I would say for me in a podcast conversation, there's often a kind of Alice in Wonderland type of exploration."}, {"time": 6062, "text": "Down the rabbit hole, man."}, {"time": 6063, "text": "And then you just, a new thing pops up, the more absurd, the wilder, the better."}, {"time": 6068, "text": "Conversations with Elon are like this."}, {"time": 6070, "text": "It's like, actually the more you drive towards an arc, the more uncomfortable you start to get in a fun, absurd conversation because, oh, I'm now one of the normies."}, {"time": 6082, "text": "No, I don't want that."}, {"time": 6083, "text": "I wanna be, I want the rabbit."}, {"time": 6085, "text": "I want the crazy because it makes it more fun."}, {"time": 6089, "text": "But somehow throughout it, there is wisdom that you try to grasp at such that there is a thread."}, {"time": 6097, "text": "Well, that's the thing, man."}, {"time": 6098, "text": "You're following the thread, eh?"}, {"time": 6100, "text": "Yeah, the thread's the, well, that's right."}, {"time": 6102, "text": "That's what we're trying to do, that thread."}, {"time": 6105, "text": "That thread is the proper balance between structure and spontaneity."}, {"time": 6109, "text": "And it manifests itself as the instinct of meaning."}, {"time": 6112, "text": "And that's the logos in the dialogos."}, {"time": 6114, "text": "And it really is the logos."}, {"time": 6115, "text": "And God only knows what that means."}, {"time": 6118, "text": "You know, I mean, the biblical claim is that logos is the fundamental principle of reality."}, {"time": 6125, "text": "I actually think that's true because I think that that meaning that guides you, well, here's a way of thinking about it."}, {"time": 6131, "text": "I've been writing about this recently."}, {"time": 6134, "text": "What's real matter?"}, {"time": 6137, "text": "It's like, okay, that's one answer."}, {"time": 6139, "text": "What's real?"}, {"time": 6140, "text": "What matters is real."}, {"time": 6142, "text": "Because that's how you act."}, {"time": 6144, "text": "Okay, so that's different than matter."}, {"time": 6146, "text": "It's like, okay, what's the most real of what matters?"}, {"time": 6151, "text": "How about pain?"}, {"time": 6153, "text": "Why is it the most real?"}, {"time": 6155, "text": "Try arguing it away."}, {"time": 6160, "text": "So pain is the fundamental reality."}, {"time": 6164, "text": "Well, that's rough."}, {"time": 6166, "text": "Doesn't that lead to nihilism and hopelessness?"}, {"time": 6170, "text": "Yeah, doesn't it lead to a philosophy that's antithetical towards being the most fundamental reality is pain?"}, {"time": 6179, "text": "Is there anything more fundamental than pain?"}, {"time": 6188, "text": "If you're in pain, love and truth, that's what you got."}, {"time": 6197, "text": "And you know, if they're more powerful than pain, maybe they're the most real things."}, {"time": 6211, "text": "When you think about reality, what is real?"}, {"time": 6213, "text": "That is the most real thing."}, {"time": 6216, "text": "Well, it's a tough one, right?"}, {"time": 6217, "text": "Because you have to, because if you're a scientist, a materialist, think, well, the matter is the most real."}, {"time": 6224, "text": "It's like, well, you don't know what the matter is."}, {"time": 6228, "text": "And so, and then when push comes to shove, and it will, you'll find out what's most real."}, {"time": 6234, "text": "I feel like this is missing, the physical reality is missing some of the things."}, {"time": 6243, "text": "So of course pain has a biological component and all those kinds of things, but it's missing something deep about the human condition that at least the modern science is not able to describe, but it is reaching towards that."}, {"time": 6258, "text": "And it's the reason, one way to describe it as you're describing is the reason it's reaching it is because underneath of science is this assumption that there's a deep."}, {"time": 6270, "text": "Logos."}, {"time": 6271, "text": "Thing to this whole thing we're trying to do."}, {"time": 6274, "text": "Well, you know, there's two traditions, right?"}, {"time": 6276, "text": "In some sense, there's two logos traditions."}, {"time": 6279, "text": "There's the Greek rational enlightenment tradition."}, {"time": 6284, "text": "That's a logos tradition."}, {"time": 6285, "text": "And it insists that there's a logos in nature and that science is the way to approach it."}, {"time": 6290, "text": "And then there's a Judeo Christian logos, which is more embodied and more spiritual."}, {"time": 6295, "text": "And I would say the West is actually an attempt to unite those two."}, {"time": 6299, "text": "And it's the proper attempt to unite those two because they need to be united."}, {"time": 6304, "text": "And I see the union coming in your terms."}, {"time": 6307, "text": "You know, I talked to friends to wall, for example about the animating principle of chimpanzee sovereignty."}, {"time": 6313, "text": "And that's pretty close biologically."}, {"time": 6316, "text": "Cause that's the claim even from the biologists often the most dominant chimp has the best reproductive success."}, {"time": 6323, "text": "It's like, oh yeah, dominant."}, {"time": 6326, "text": "Hey, you mean using compulsion?"}, {"time": 6328, "text": "Okay, let's look."}, {"time": 6329, "text": "Are the chimps who use compulsion the most successful?"}, {"time": 6334, "text": "And the answer is sporadically and rarely."}, {"time": 6339, "text": "And for short, well, that's sporadically for short periods of time."}, {"time": 6344, "text": "Because they meet an unpleasant end."}, {"time": 6347, "text": "The subordinates over whom they exercise arbitrary control wait for a weak moment and then tear them into shreds, right?"}, {"time": 6356, "text": "Every dictators terror and for good reason."}, {"time": 6360, "text": "And the wall has showed that the alpha chimps, the males who do have preferential mating access often are often and reliably the best peacemakers and the most reciprocal."}, {"time": 6374, "text": "And so even among chimps, the principle of sovereignty is something like iterative, iterated reciprocity."}, {"time": 6383, "text": "And that's a way better principle than power."}, {"time": 6386, "text": "And it's something like I've been thinking what's the antithesis of the spirit of power."}, {"time": 6391, "text": "I think it's the spirit of play."}, {"time": 6395, "text": "And I don't know what you think about that, but when you have a good podcast conversation, you already described it in some sense as play."}, {"time": 6401, "text": "It's like, there's a structure, right?"}, {"time": 6403, "text": "Cause it's an ordered conversation, but you want there to be play in the system."}, {"time": 6408, "text": "And if you get that right, then it's really engaging."}, {"time": 6411, "text": "And then it seems to have its own narrative arc."}, {"time": 6414, "text": "I'm not trying to impose that even though that's another thing I don't do."}, {"time": 6418, "text": "I didn't come to this conversation at all thinking, here's what I want out of a conversation with Lex Friedman, like instrumentally."}, {"time": 6426, "text": "I thought, I'll go talk to Lex."}, {"time": 6430, "text": "I like his podcasts."}, {"time": 6433, "text": "He's doing something right."}, {"time": 6435, "text": "He asks interesting questions."}, {"time": 6437, "text": "I'll go have a conversation with him."}, {"time": 6439, "text": "Where's it gonna go?"}, {"time": 6442, "text": "Wherever it goes."}, {"time": 6444, "text": "Embracing the spirit of play."}, {"time": 6446, "text": "So what you have this, when you're lecturing, you're going in front of the crowd, you thought of a question, you get on the stage."}, {"time": 6456, "text": "First of all, are you nervous at all?"}, {"time": 6459, "text": "I'm very nervous when I'm sitting down, thinking through the structure initially, which is why my wife and I have been doing Q and As and that's easier on me."}, {"time": 6470, "text": "It's the way comedians are nervous."}, {"time": 6474, "text": "Like Joe Rogan just did his special this weekend."}, {"time": 6479, "text": "And so he now has to sit nervously like a comedian does, which is like, I have no material now."}, {"time": 6487, "text": "I have to start from scratch."}, {"time": 6488, "text": "When I was doing the lectures constantly instead of the Q and As, basically what I was doing was writing a whole book chapter every night."}, {"time": 6497, "text": "And now that's a bit of an exaggeration because I would return to themes that I had developed, but it's not really an exaggeration because I didn't ever just go over wrote material ever."}, {"time": 6510, "text": "So it's very demanding and that part's nerve wracking because I sit down, it's an hour before the show and I think, can I do this?"}, {"time": 6521, "text": "And the answer is, well, you did it a thousand times, but that's not this time."}, {"time": 6526, "text": "It's like, can I come up with a question?"}, {"time": 6529, "text": "Can I think through the structure?"}, {"time": 6531, "text": "Can I pull off the spontaneous narrative?"}, {"time": 6536, "text": "Can I pull it together?"}, {"time": 6540, "text": "And so then I get it together in my mind, I think, and that's hard."}, {"time": 6543, "text": "It takes effort and it's nerve wracking."}, {"time": 6547, "text": "But then there's the moment you go out on stage and you think, well, I know I had it, but can I do it?"}, {"time": 6553, "text": "No notes."}, {"time": 6555, "text": "And then the question is, well, you're gonna find out while you do it."}, {"time": 6558, "text": "And so then I go out on stage and I don't talk to the audience, I talk to one person at a time."}, {"time": 6567, "text": "And you can talk to one person, cause you know how to do that."}, {"time": 6570, "text": "So I talk to a person and not too long cause I don't wanna make them too nervous and then someone else and someone else."}, {"time": 6575, "text": "And then I'm in contact with the audience and then I can tell if the words are landing and I listen, it's like, are they rustling around?"}, {"time": 6584, "text": "Are they dead quiet?"}, {"time": 6586, "text": "Cause you want dead quiet."}, {"time": 6587, "text": "You're, oh, I see."}, {"time": 6589, "text": "That's what focus sounds like."}, {"time": 6592, "text": "You're in it together then."}, {"time": 6594, "text": "Well, and I also, here's a good rule if you're learning to speak publicly, I never say a word till everyone is 100% quiet."}, {"time": 6604, "text": "And that's, it's a great way to start a talk because you're setting the frame, and if the frame is we'll all talk while you're talking, the message is, well, you can talk."}, {"time": 6614, "text": "This is a place where everybody can talk."}, {"time": 6616, "text": "It's like, no, it's not."}, {"time": 6617, "text": "This is a place where people paid to hear me talk."}, {"time": 6621, "text": "So I'm not gonna talk till everyone's listening."}, {"time": 6624, "text": "And so then you get that stillness and then you just wait cause that stillness turns into an expectation."}, {"time": 6630, "text": "And then it comes, turns into a kind of nervous expectations like what the hell is he doing?"}, {"time": 6635, "text": "It's not manipulative."}, {"time": 6637, "text": "It's a sense of timing."}, {"time": 6638, "text": "It's like just when that's right, you think, okay, now it's time to start."}, {"time": 6642, "text": "Well, the interesting thing about that nervous expectation is from an audience perspective, we're in it together."}, {"time": 6650, "text": "I mean, there is into that silence, there's a togetherness to it."}, {"time": 6653, "text": "Of course, it's the union of everyone's attention."}, {"time": 6656, "text": "Yeah, and that's a great thing."}, {"time": 6658, "text": "I mean, you love that at a concert when everyone, it's not silence then, but when everyone's attention is unified and everyone's moving in unison, it's like we're all worshiping the same thing, right?"}, {"time": 6669, "text": "And that would be the point of the conversation, the point of the lecture."}, {"time": 6673, "text": "And the worship is the direction of attention towards it."}, {"time": 6676, "text": "And it's union, it's communion because everyone's doing it at the same time."}, {"time": 6680, "text": "And so, I mean, there's not much difference between a lecture theater and a church in that regard, right?"}, {"time": 6685, "text": "It's the same fundamental layout and structure."}, {"time": 6688, "text": "And they're very integrally associated with one another."}, {"time": 6690, "text": "One really grew out of the other, the lecture theater grew out of the church."}, {"time": 6694, "text": "So it's perfectly reasonable to be thinking about it in those terms."}, {"time": 6698, "text": "And so, and then, okay, so after the lecture, we play a piece of music that is a piece of music that I've been producing with some musicians for a couple of books I'm gonna release in the fall."}, {"time": 6711, "text": "Terrible books, ABC of childhood tragedy, they're called dark, dark books, dark and comical books, terrible books, heartbreaking illustrations."}, {"time": 6726, "text": "We've set them to music."}, {"time": 6727, "text": "And so we play a piece from that."}, {"time": 6729, "text": "And then afterwards, I usually meet about 150 people to have photographs."}, {"time": 6734, "text": "And so each of those is a little."}, {"time": 6737, "text": "Is there a little sparkle of human connection?"}, {"time": 6740, "text": "A lot, a lot, it's very intense."}, {"time": 6744, "text": "10 seconds with every person you think, how can 10 seconds be intense?"}, {"time": 6748, "text": "It's like, pay enough attention."}, {"time": 6751, "text": "It gets intense real quick."}, {"time": 6753, "text": "Does it break your heart to say goodbye so many times?"}, {"time": 6756, "text": "It's like being in a wedding lineup, at a wedding that you wanna be at."}, {"time": 6761, "text": "And everybody's dressed up."}, {"time": 6762, "text": "And that's so weird, because I bought these expensive suits when I went on tour and it broke my heart because I spent so much money on them."}, {"time": 6768, "text": "I thought, God, that's completely unconscionable."}, {"time": 6771, "text": "I thought, no way, man, I'm in this 100%."}, {"time": 6775, "text": "And so I'm gonna dress with respect."}, {"time": 6778, "text": "And like 60% of the audience comes in two or three piece suits."}, {"time": 6785, "text": "They're all dressed up."}, {"time": 6787, "text": "Then there's this line to greet me and they're all happy to see me."}, {"time": 6791, "text": "That's not so hard to take."}, {"time": 6793, "text": "You know, although it is in a sense, right?"}, {"time": 6795, "text": "Because normal interactions are pretty shallow."}, {"time": 6799, "text": "And you think, I don't want shallow interactions."}, {"time": 6801, "text": "It's like, yes, you do most of the time."}, {"time": 6802, "text": "Yeah, it's intense."}, {"time": 6804, "text": "It's very intense."}, {"time": 6805, "text": "And I don't know if you have."}, {"time": 6806, "text": "But you've had a taste of this, no doubt, because people recognize you."}, {"time": 6809, "text": "Yeah, but I also have, when a person recognizes me and they come with the love and they're often brilliant people, one of the thoughts I have to deal with, one of the dragons in my own mind is, you know, thinking that I don't deserve that kind of attention."}, {"time": 6826, "text": "Well, you probably don't."}, {"time": 6829, "text": "But maybe you could."}, {"time": 6830, "text": "So it's a burden in that I have to step up to be the kind of person that deserves that, not deserves that, but in part deserves that kind of attention."}, {"time": 6839, "text": "And that's like, holy shit."}, {"time": 6841, "text": "It's crucially important too, because if someone comes up to you in an airport and they know who you are and they're brave enough to admire you or who you are attempting to be and you make a mistake, they will never forget it."}, {"time": 6856, "text": "So it's a high stakes enterprise."}, {"time": 6859, "text": "And the flip side of that, especially with young people, a few words you can say can change the direction of their life."}, {"time": 6866, "text": "One way or another."}, {"time": 6868, "text": "And so I really have to watch this too in airports because I do not like airports."}, {"time": 6871, "text": "I do not like the creeping totalitarianism in airports."}, {"time": 6874, "text": "They've always bothered me."}, {"time": 6876, "text": "They really bother me."}, {"time": 6878, "text": "And I'm an unpleasant travel companion for my wife sometimes because of that."}, {"time": 6882, "text": "Although I think we've worked that out."}, {"time": 6883, "text": "Thank God, cause we're doing a lot of traveling."}, {"time": 6886, "text": "But most of the security guards and the border personnel, all those people, they know me."}, {"time": 6892, "text": "And as a general rule, they're positively predisposed to me."}, {"time": 6895, "text": "And so if I'm peevish or irritable, then well, that's not good."}, {"time": 6902, "text": "And so that's a tight rope to walk to because I do not like that creeping totalitarianism."}, {"time": 6907, "text": "But by the same token, if you're just one of the crowd, just, sometimes it's good just to be one of the crowd and then you're a little irritable and people can just brush that off."}, {"time": 6919, "text": "But if you're someone they have dared to open their heart to, cause that's what admiration is, and then you betray that, then that's a real, they'll never forget it."}, {"time": 6934, "text": "And then they'll tell everyone too."}, {"time": 6936, "text": "So it takes a lot of alertness."}, {"time": 6939, "text": "And so Tammy and our life has got complicated because in Toronto, for example, we can't really just go for a walk."}, {"time": 6946, "text": "It's always a high drama production cause always people come up and they have some heart rending story to tell."}, {"time": 6955, "text": "And I'm not being cynical about that."}, {"time": 6958, "text": "It's a hard thing to bear because people don't do that."}, {"time": 6962, "text": "They don't just open themselves up to you like that and share the tragedy of their life."}, {"time": 6969, "text": "But that's an everyday occurrence."}, {"time": 6971, "text": "And so when we go up to our cottage, which is out of the city, it's a relief, because as wonderful as that is, like it's a weird, I have a weird life because everywhere I go, it's very weird."}, {"time": 6985, "text": "It's like I'm surrounded by old friends because I walk down the street in any city now virtually and people say, hello, Dr. Peterson, so nice to see you."}, {"time": 6994, "text": "Or they say better things than that."}, {"time": 6996, "text": "Very rarely bad things."}, {"time": 6998, "text": "One experience in 5,000, maybe very rare, although you don't forget those either, but it's very strange."}, {"time": 7008, "text": "And there's an intimacy, they know you well."}, {"time": 7010, "text": "And because they leap into, they avoid the small talk often."}, {"time": 7017, "text": "They leap into familiarity."}, {"time": 7018, "text": "It really is like it's an old friend and it feels like that."}, {"time": 7021, "text": "For me personally, the experiences, the goodbye hurts because there's a sense where you're never gonna see that friend again."}, {"time": 7032, "text": "Yeah, that's a strange thing, eh?"}, {"time": 7034, "text": "So to me, a lot of it just feels like goodbyes."}, {"time": 7043, "text": "And I mean, that's, I suppose, in some sense, part of the pain of opening yourself up to people because they also, Tammy has been struck particularly."}, {"time": 7053, "text": "She said, I really never knew what men were like."}, {"time": 7055, "text": "I said, well, what do you mean?"}, {"time": 7056, "text": "She said, I cannot believe how polite the men are when they come and talk to you because it's always the same."}, {"time": 7063, "text": "The pattern's very similar."}, {"time": 7065, "text": "The person comes up, they're mostly men, not always, but mostly."}, {"time": 7069, "text": "And they're tentative and they're very polite, very, very polite."}, {"time": 7073, "text": "And they say, I hope I'm not bothering you."}, {"time": 7075, "text": "Do you mind, you know, do you mind that I say that they're not bothering me?"}, {"time": 7080, "text": "And I'm doing everything I can to not be the guy who's bothered by that."}, {"time": 7084, "text": "It's like, who do you think you are?"}, {"time": 7087, "text": "You're the guy that what is famous and now is above that?"}, {"time": 7093, "text": "You don't wanna be that guy."}, {"time": 7095, "text": "So you wanna be grateful all the time when people open up like that."}, {"time": 7100, "text": "And so you gotta be alert and on point to do that properly, like right away."}, {"time": 7105, "text": "Because for you, it's five seconds or 10 seconds or 20 seconds, whatever it is."}, {"time": 7110, "text": "But for them, they've opened up."}, {"time": 7113, "text": "And so you can really nail them if you're foolish."}, {"time": 7117, "text": "After the 150 people, how do you come down from that?"}, {"time": 7120, "text": "How do you find yourself again?"}, {"time": 7124, "text": "Well, that was when I got caught in Twitter traps, cause I'm so burnt out by then from the talk and the audience interactions and the whole day."}, {"time": 7136, "text": "Cause it's a new city, it's a new hotel, it's a new 5,000 people, it's a new book chapter, it's a whole new horizon of ideas."}, {"time": 7144, "text": "And it's off to another city the next day."}, {"time": 7146, "text": "I'm so burnt out by then that I'm not as good at controlling my impulses as I might be."}, {"time": 7153, "text": "And Twitter was a real catastrophe for that cause it would hook me and then I couldn't, like I used to, when I was working on my book a lot, I used to call Tammy and say, look, you have to come and get me, I can't stop."}, {"time": 7165, "text": "I can't stop, I got tired and then I kind of, cause it's part of a kind of hypomanic focus."}, {"time": 7171, "text": "I couldn't quit, it's like, oh no, I'm still writing."}, {"time": 7174, "text": "I need to get away from this, but I couldn't stop."}, {"time": 7177, "text": "And so it's better to read something, a book."}, {"time": 7184, "text": "Fiction, nonfiction."}, {"time": 7186, "text": "Fiction, Stephen King."}, {"time": 7188, "text": "I was reading a lot of Stephen King when I was on tour last time, that was good."}, {"time": 7192, "text": "I like Stephen King a lot."}, {"time": 7193, "text": "It's a great narrative."}, {"time": 7194, "text": "Great, and great characterization, you know?"}, {"time": 7197, "text": "So, and there's a familiarity about Stephen King's writing too that it's, he writes about people you know."}, {"time": 7205, "text": "And so I really found that a relief."}, {"time": 7208, "text": "And so that was useful."}, {"time": 7210, "text": "And that in order to tolerate this, let's say, or to be able to sustain it, well, let's take a lot of negotiation on the part of Tammy and I, because she's dragged into this and, you know, her life is part of this, whatever this is."}, {"time": 7225, "text": "And she's had to find her way and has, for example, now she has a different hotel room than me when we travel."}, {"time": 7232, "text": "And she found that she didn't want to be on the tour this spring, and I was ill again for part of it."}, {"time": 7237, "text": "And that made it complicated, but she went away back home and she came back and she said, and she was nervous about, she said, I think I need my own room."}, {"time": 7245, "text": "And part of me was not happy with that."}, {"time": 7247, "text": "It's like, what do you mean you need your, like, are we not married anymore?"}, {"time": 7250, "text": "It's like, you need your own room?"}, {"time": 7252, "text": "And she said, well, you know, I can't, she has to do exercises because she was really sick and she has to keep herself in shape."}, {"time": 7259, "text": "And she has to have some time to do that."}, {"time": 7262, "text": "She does a lot of prayer and meditation and she needs the time."}, {"time": 7264, "text": "And she has her own podcast, which is going quite well."}, {"time": 7266, "text": "And she needs the time and I trust her."}, {"time": 7269, "text": "And she said, well, I need this in order to continue."}, {"time": 7272, "text": "And I thought, well, okay, if you need this in order to continue, yes."}, {"time": 7279, "text": "Because she went away and didn't say, well, I don't want to be on the tour."}, {"time": 7283, "text": "She went away and prayed, let's say, how can I continue to do this?"}, {"time": 7288, "text": "And that was the answer."}, {"time": 7290, "text": "And so she has her own hotel room."}, {"time": 7292, "text": "And that was a really good decision on her part."}, {"time": 7296, "text": "And she's very good and getting better all the time at figuring out what has to happen for her to make this sustainable."}, {"time": 7305, "text": "And all that's been is a plus because I don't want to travel without her."}, {"time": 7311, "text": "And I don't want her life to be miserable."}, {"time": 7313, "text": "And I want her to be fully on board."}, {"time": 7315, "text": "And so she has to be properly selfish."}, {"time": 7318, "text": "Like everyone does in a relationship."}, {"time": 7320, "text": "And you have to, not just that, this is a weird thing that you're doing."}, {"time": 7325, "text": "And you have to, both you and her have to figure out how to manage this very intense intellectual, social journey."}, {"time": 7333, "text": "Well, there's another element to it too that I didn't tell you about."}, {"time": 7336, "text": "So that was a typical day, but it's missing a big component because usually we also have a dinner with like 30 cultural representatives, I suppose, 10 to 30 from each country."}, {"time": 7348, "text": "Cause I have a network of people who have networks who are setting me up with key decision makers in each country."}, {"time": 7357, "text": "And so then we have like an hour and a half of that."}, {"time": 7359, "text": "Now, sometimes that's on a day when I don't have a talk, but sometimes the talks are back to back."}, {"time": 7364, "text": "And so she also has to manage that and to be gracious."}, {"time": 7369, "text": "And then people are showing us exciting things and tours in the cities and which is all, like it's a surf fight of wonderful."}, {"time": 7377, "text": "But it's still, yeah, you have to be there for it."}, {"time": 7380, "text": "You have to be present for it mentally."}, {"time": 7382, "text": "As a curious mind, as an intellectual mind."}, {"time": 7384, "text": "How do you get to sleep?"}, {"time": 7387, "text": "Fortunately, that is almost never a problem."}, {"time": 7391, "text": "Even when I was unbelievably ill for about three years."}, {"time": 7397, "text": "I thought about that a lot too, you know, that I didn't do a really good job of explaining that while I was ill because it appeared in some sense that the reason I was ill was because I was taking benzodiazepines, but that isn't why I was ill. And then I took them and very low dose."}, {"time": 7413, "text": "And I took that for a long time and it helped whatever was wrong with me."}, {"time": 7417, "text": "And it looks like it was an allergy or maybe multiple allergies."}, {"time": 7422, "text": "And then that stopped working."}, {"time": 7425, "text": "And so I took a little bit more for about a month and that made it way worse."}, {"time": 7428, "text": "And so then I cut back a lot and then, then things really got out of hand."}, {"time": 7435, "text": "So there was a deeper thing in the Benzo."}, {"time": 7438, "text": "What can you put words to?"}, {"time": 7440, "text": "Well, I had a lot of immune, well, my daughter, as everyone knows, has a very reactive immune system."}, {"time": 7446, "text": "And Tammy has three immunological conditions, each of them quite serious."}, {"time": 7451, "text": "And I had psoriasis and peripheral uveitis, which is an autoimmune condition and alopecia areata and chronic gum disease, all of which appeared to be allergy related."}, {"time": 7462, "text": "And so Michaela seems to have got all of that."}, {"time": 7465, "text": "And so that, and that I think was at the bottom of, cause I also had this proclivity to depression that was part of my family history."}, {"time": 7472, "text": "But I think that was all immunological as far as I can tell."}, {"time": 7475, "text": "So one of the things that's happened to me, I always noticed I really couldn't breathe."}, {"time": 7480, "text": "Like I could breathe about one fifth as much as I sometimes could."}, {"time": 7486, "text": "And so I was always short of breath."}, {"time": 7488, "text": "And it looks like what that was perhaps was I was always on the border of an anaphylactic reaction, which is not pleasant."}, {"time": 7498, "text": "And that's hypersympathetic activation, no parasympathetic activation."}, {"time": 7503, "text": "I couldn't relax at all."}, {"time": 7505, "text": "That's an immunological response."}, {"time": 7507, "text": "Allergic response, yeah."}, {"time": 7509, "text": "So anyways, that was what seemed, now this, I don't like to talk about this much cause it's so bloody radical and I don't like to propagate it, but this diet seems to have stopped all of that."}, {"time": 7519, "text": "I don't have psoriasis, all of the patches have gone."}, {"time": 7522, "text": "My gum disease, which is incurable, I had multiple surgeries to deal with it, is completely gone, took three years."}, {"time": 7530, "text": "My right eye, which was quite cloudy, it's cleared up completely."}, {"time": 7535, "text": "What else has changed?"}, {"time": 7536, "text": "Well, I lost 50 pounds and like instantly kept it off."}, {"time": 7541, "text": "I should mention that I too am not a deep investigator of nutritional science."}, {"time": 7547, "text": "I have my skepticism towards the degree to which it is currently as a science."}, {"time": 7551, "text": "Cause like a lot of complex systems is full of mystery and full of profiteers, the people that profit of different kinds of diets."}, {"time": 7560, "text": "But I should say for me personally, it does seem that I feel by far the best when I eat only meat."}, {"time": 7567, "text": "And I discovered that a long time ago."}, {"time": 7570, "text": "First of all."}, {"time": 7570, "text": "How did you discover it?"}, {"time": 7572, "text": "So by, the discovery went like this."}, {"time": 7575, "text": "I started listening to ultra marathon runners about 15 years ago."}, {"time": 7580, "text": "And they started talking about fat adapted running."}, {"time": 7587, "text": "So I first discovered that I don't have to run super fast to enjoy running."}, {"time": 7592, "text": "And in fact, I really enjoy running at a slower pace."}, {"time": 7596, "text": "So that was like step one."}, {"time": 7597, "text": "It's like, oh, okay."}, {"time": 7598, "text": "If I maintain something called the math rule, which is the pretty low heart rate."}, {"time": 7605, "text": "If I maintain that you can actually get pretty fast while maintaining a pretty slow average speed in general."}, {"time": 7610, "text": "Anyway, they fuel themselves on low carb diets."}, {"time": 7615, "text": "So I got into that."}, {"time": 7617, "text": "On top of that, I also, they also fast often."}, {"time": 7620, "text": "So I discovered how incredible my mind feels when fasted."}, {"time": 7625, "text": "You know, people call it intermittent fasting, but."}, {"time": 7628, "text": "Well, that's an optimization of death because you're, when you fast, your body, logically and obviously, if you think about it biologically is, well, what is your body scavenge first?"}, {"time": 7640, "text": "Well, damaged tissue."}, {"time": 7644, "text": "So the, and I know the literature on fasting to some degree, and it's very compelling literature."}, {"time": 7650, "text": "If you starve dogs down, I think it's 20% below rats too, below their optimal body weight, they live 30% longer."}, {"time": 7658, "text": "That's a lot, 30%, like it's like 30%, yeah, 30%."}, {"time": 7663, "text": "Well, there is aspect to a lot of these things that make me nervous because I always feel like there's no free lunch that I'm gonna pay for it somehow."}, {"time": 7671, "text": "But there's a focus that I am able to attain when I fast, especially when I eat once a day."}, {"time": 7677, "text": "My mind is almost like nervously focused."}, {"time": 7681, "text": "It's almost like an anxiety, but a positive one or one that I can channel into just like an excitement."}, {"time": 7687, "text": "You know, I wonder how much of that's associated with, well, imagine that that signifies lack of food, which not that hard to imagine."}, {"time": 7696, "text": "Well, maybe you should be a lot more alert in that situation, right?"}, {"time": 7699, "text": "Biologically speaking, because you're in hunting mode, let's say, you know, not desperate, but in hunting mode."}, {"time": 7706, "text": "And God only knows maybe human beings should be in hunting mode all the time."}, {"time": 7711, "text": "Often, but we don't know that."}, {"time": 7712, "text": "So I wonder if it has a stress on the system that long term causes the system to get sick."}, {"time": 7719, "text": "It doesn't look like it."}, {"time": 7721, "text": "It seems in the case of fasting, not."}, {"time": 7723, "text": "And then on top of that, I discovered that the thing I enjoy, I just don't enjoy eating fat as much."}, {"time": 7732, "text": "So I love eating meat when you talk about low carb diet."}, {"time": 7735, "text": "So I just discovered through that process, if somewhat fatty meat, but just meat, I just feel a lot of the things that make me feel weird about food, like a little groggy or like full or just whatever, the aspects of food that I don't enjoy, they're not there with meat."}, {"time": 7755, "text": "And I'm still able to enjoy company."}, {"time": 7758, "text": "And when I eat once a day and eat meat, I said, at least in Texas, you could still have all the merriment of, you have dinner with friends."}, {"time": 7768, "text": "Now, I don't do the, you have a very serious thing that there's health benefits that you are very serious about."}, {"time": 7779, "text": "For me, I can still drink whiskey."}, {"time": 7781, "text": "I'll still do the things that add a little bit of spice into the thing."}, {"time": 7787, "text": "Now, when you completely remove the spice, it does become more difficult."}, {"time": 7792, "text": "Yeah, it's more difficult socially."}, {"time": 7793, "text": "And Tammy seems to only be able to eat lamb, although she might be able to eat non aged beef."}, {"time": 7798, "text": "And that makes traveling complicated too, right?"}, {"time": 7802, "text": "Because, well, for obvious reasons, it's like, really, that's all you can eat?"}, {"time": 7808, "text": "Yeah, well, celeries."}, {"time": 7809, "text": "And maybe that's a form of craziness, but."}, {"time": 7812, "text": "If we can return to actually the thing you were talking about, when you were thinking about a question before the lecture."}, {"time": 7818, "text": "Let me ask you about thinking in general."}, {"time": 7822, "text": "This is something maybe that you and Jim Keller think a lot about is thinking how to think."}, {"time": 7829, "text": "How do you think through an idea?"}, {"time": 7832, "text": "Well, first of all, I think, okay, that's a really good question."}, {"time": 7838, "text": "We tried to work that out with this essay app that my son and I have developed, because if you're gonna write, the first question is, well, what should I write about?"}, {"time": 7845, "text": "What's the name of the app?"}, {"time": 7846, "text": "Essay.app."}, {"time": 7848, "text": "And, well, the first question is, well, what bugs you?"}, {"time": 7853, "text": "What's bugging you?"}, {"time": 7854, "text": "This is such a cool thing."}, {"time": 7856, "text": "It's like, where is my destiny?"}, {"time": 7859, "text": "Well, what bothers you?"}, {"time": 7860, "text": "Well, that's where your destiny is."}, {"time": 7862, "text": "Your destiny is to be found in what bothers you."}, {"time": 7864, "text": "Why did those things bother you?"}, {"time": 7867, "text": "There's a lot of things you could be bothered by."}, {"time": 7869, "text": "Like a million things, man."}, {"time": 7871, "text": "But some things grip you."}, {"time": 7873, "text": "They bug you."}, {"time": 7874, "text": "And they might make you resentful and bitter, because they bug you so much."}, {"time": 7877, "text": "Like, they're your things, man."}, {"time": 7880, "text": "They've got you."}, {"time": 7881, "text": "So then I look for a question that I would like the answer to, that I don't, and I would really like the answer to it, so I don't assume I already have the answer, because I would actually really like to have the answer."}, {"time": 7895, "text": "So if I could get a better answer, great."}, {"time": 7899, "text": "And so that's the first thing."}, {"time": 7900, "text": "And that's like a prayer."}, {"time": 7901, "text": "It's like, okay, here's a mystery."}, {"time": 7905, "text": "I would like to delve into it further."}, {"time": 7909, "text": "Well, so that's humility."}, {"time": 7911, "text": "It's like, here's a mystery, which means I don't know."}, {"time": 7914, "text": "I would like to delve into it further, which means I don't know enough already."}, {"time": 7918, "text": "And then comes the revelation."}, {"time": 7921, "text": "It's like, well, what's a revelation?"}, {"time": 7924, "text": "Well, if you ask yourself a question, it's a real question."}, {"time": 7928, "text": "Do you get an answer or not?"}, {"time": 7930, "text": "And the answer is, well, yeah, thoughts start to appear in your head."}, {"time": 7934, "text": "So... From somewhere."}, {"time": 7935, "text": "That's right, from somewhere."}, {"time": 7936, "text": "Where do they come from?"}, {"time": 7939, "text": "Depends on what you're aiming at."}, {"time": 7941, "text": "Depends on the question."}, {"time": 7943, "text": "No, no, it does to some degree."}, {"time": 7946, "text": "It depends on your intent."}, {"time": 7949, "text": "So imagine that your intent is to make things better."}, {"time": 7953, "text": "Then maybe they come from the place that's designed to make things better."}, {"time": 7957, "text": "Maybe your intent is to make things worse."}, {"time": 7959, "text": "Then they come from hell."}, {"time": 7962, "text": "And you think, not really."}, {"time": 7963, "text": "It's like, you're so sure about that, are you?"}, {"time": 7965, "text": "Is your intent conscious?"}, {"time": 7967, "text": "Like, are you able to introspect with the intent?"}, {"time": 7969, "text": "Conscious and habitual, right?"}, {"time": 7971, "text": "Because as you practise something consciously, it becomes habitual."}, {"time": 7975, "text": "But it's conscious."}, {"time": 7976, "text": "It's like when I sit down before I do a lecture, I think, okay, what's the goal here?"}, {"time": 7981, "text": "To do the best job I can."}, {"time": 7984, "text": "To what end?"}, {"time": 7985, "text": "Well, people are coming here not for political issues."}, {"time": 7988, "text": "They're coming here because they're trying to make their lives better."}, {"time": 7991, "text": "Okay, so what are we doing?"}, {"time": 7993, "text": "We're conducting a joint investigation into the nature of that which makes life better."}, {"time": 7997, "text": "Okay, what's my role?"}, {"time": 7998, "text": "To do as good a job about that as possible."}, {"time": 8001, "text": "What state of mind do I have to be in?"}, {"time": 8003, "text": "Am I annoyed about the theatre?"}, {"time": 8005, "text": "Or am I clued in and thrilled that 4,000 people have showed up at substantial expense and trouble to come and listen to me talk?"}, {"time": 8015, "text": "And if I'm not in that state of mind, I think, well, maybe I need something to eat or maybe I need to talk to someone because ingratitude is no place to start."}, {"time": 8024, "text": "It's like, I should be thrilled to be there, obviously."}, {"time": 8028, "text": "And so that orientation has to be there."}, {"time": 8030, "text": "And then I, is it conscious?"}, {"time": 8031, "text": "All this is conscious."}, {"time": 8032, "text": "What am I serving?"}, {"time": 8033, "text": "The highest good I can conceptualize."}, {"time": 8036, "text": "I have some sense, but I don't know it in the final analysis, which is why the investigation is being conducted."}, {"time": 8042, "text": "Who's doing it?"}, {"time": 8043, "text": "Me, whoever I'm communing with, and the audience."}, {"time": 8047, "text": "And so I try to get myself and I chase everybody away for that, it's like I have to do that by myself."}, {"time": 8053, "text": "Are you writing stuff down?"}, {"time": 8054, "text": "Yes, at that point, I just make point notes."}, {"time": 8059, "text": "And it's usually about maybe 30 notes."}, {"time": 8061, "text": "But then I, on stage, I never refer to them."}, {"time": 8064, "text": "And I often don't even use the structure that I laid out."}, {"time": 8067, "text": "Kind of an interesting thing."}, {"time": 8069, "text": "From where do powerful phrases come from?"}, {"time": 8071, "text": "Do you have a, do you try to encapsulate an idea into a sentence or two?"}, {"time": 8078, "text": "Well, when I talk, and I've practiced this since, consciously, since 1985, I try to feel and see if the words are stepping stones or foundation stones, right?"}, {"time": 8093, "text": "It's like, is this solid?"}, {"time": 8095, "text": "Is this word solid?"}, {"time": 8096, "text": "Is this phrase solid?"}, {"time": 8097, "text": "Is this sentence solid?"}, {"time": 8099, "text": "It's a real sense of fundamental foundation under each word."}, {"time": 8105, "text": "And I suppose people ask me if I pray."}, {"time": 8108, "text": "And I would say, I pray before every word."}, {"time": 8114, "text": "Well, when you're asking questions, like you're very clear headed and present in your ability to ask questions and inquire."}, {"time": 8127, "text": "So first of all, I'm worried that my mind easily gets trapped when I step on a word and I know it's unstable."}, {"time": 8142, "text": "You kind of realize that you don't really know the definitions of many words you use."}, {"time": 8147, "text": "And that can be debilitating."}, {"time": 8152, "text": "So I kind of try to be more carefree about the words I use."}, {"time": 8157, "text": "Because otherwise you get trapped."}, {"time": 8159, "text": "You don't want to be obsessional."}, {"time": 8160, "text": "Like literally, my mind halfway through the sentence will think, well, what does the word sentence mean?"}, {"time": 8169, "text": "Well, you know, neurologically."}, {"time": 8170, "text": "And then everything else just explodes."}, {"time": 8172, "text": "Your big picture idea explodes and you lost yourself in the minutiae."}, {"time": 8177, "text": "Well, neurologically, there's a production center and an editing center."}, {"time": 8183, "text": "And those can be separately affected by strokes."}, {"time": 8187, "text": "And so often when people are writing or talking, they try to activate both at the same time."}, {"time": 8193, "text": "And that's, so people will try to write an essay and get every sentence right in the first draft."}, {"time": 8197, "text": "That's a big mistake."}, {"time": 8198, "text": "And so then you might say, well, how can you be careful with your words, but carefree?"}, {"time": 8202, "text": "And the answer is orient yourself properly, right?"}, {"time": 8206, "text": "While in the conversation we're having, you have an orientation structure."}, {"time": 8210, "text": "You want to be prepared."}, {"time": 8212, "text": "You want to be attentive."}, {"time": 8213, "text": "Then you want to have an interesting conversation."}, {"time": 8216, "text": "And you want to have the kind of interesting conversation that other people want to listen to."}, {"time": 8221, "text": "That will be good for them in some manner."}, {"time": 8224, "text": "Okay, so that's pretty good frame."}, {"time": 8226, "text": "And then you kind of scour your heart and you think, is that really what you want?"}, {"time": 8230, "text": "Are you after fame or after notoriety?"}, {"time": 8232, "text": "Are you after money?"}, {"time": 8234, "text": "I'm not saying any of those things are necessarily bad, but they're not optimal, especially if you're not willing to admit them, right?"}, {"time": 8242, "text": "And so they can contaminate you."}, {"time": 8244, "text": "So you want to be decontaminated."}, {"time": 8246, "text": "So you have the right trip, let's say."}, {"time": 8249, "text": "And so you have to put yourself, that's a meditative practice."}, {"time": 8253, "text": "You have to put yourself in the right receptive position with the right goal in mind."}, {"time": 8258, "text": "Then you can, and I think you can get better and better at this, then you can trust what's going to happen."}, {"time": 8267, "text": "You know, so for example, before I came here, I mean, I presume you have a reason for doing the podcast with me."}, {"time": 8275, "text": "What's the reason?"}, {"time": 8279, "text": "I mean, we wanted to talk for a long time."}, {"time": 8283, "text": "So the reason has evolved."}, {"time": 8287, "text": "One of the reasons is I've listened to you for quite a long time."}, {"time": 8293, "text": "So you've become a one way friend and I have many one way friends."}, {"time": 8297, "text": "Some of my best friends don't even know I exist."}, {"time": 8301, "text": "So I'm a big fan of podcasts and audio books."}, {"time": 8304, "text": "Actually, most of my friends are dead."}, {"time": 8308, "text": "The writers."}, {"time": 8308, "text": "The definition of a reader."}, {"time": 8312, "text": "It's a lot of dead, great dead friends."}, {"time": 8314, "text": "So I wanted to meet this one way friend, I suppose, and have a conversation."}, {"time": 8319, "text": "And then there's this kind of puzzle that I've been longing to solve."}, {"time": 8324, "text": "The same reason I went to Ukraine of asking this question of myself, who am I?"}, {"time": 8330, "text": "And what was this part of the world?"}, {"time": 8332, "text": "What is this thing that happened in the 20th century?"}, {"time": 8336, "text": "That I lost so much of my family there and I feel so much of my family is defined by that place."}, {"time": 8343, "text": "Now that place includes the Soviet Union and it includes Russia and Ukraine."}, {"time": 8349, "text": "It includes Nazi Germany, includes these big powerful leaders and huge millions of people that were lost in the beauty, the power of the dream, but were also the torture that was forced onto them through different governmental institutions."}, {"time": 8372, "text": "And you are somebody that seemed from some angle to also be drawn to try to understand what was that."}, {"time": 8381, "text": "And not in some sort of historical sense, but in a deeply psychological human sense."}, {"time": 8387, "text": "What is that, will it repeat again?"}, {"time": 8389, "text": "In what way is it repeating again?"}, {"time": 8391, "text": "And how can we stop it?"}, {"time": 8394, "text": "That's the crucial issue."}, {"time": 8395, "text": "I felt I wanted to, from a very different backgrounds, pull at the thread of that curiosity."}, {"time": 8404, "text": "You know, I'm an engineer, you're a psychologist, both lost in that curiosity and both wear suits."}, {"time": 8412, "text": "And a talk with various levels of eloquence about sort of the shadows that these, that history casts on us."}, {"time": 8428, "text": "And so that was one."}, {"time": 8430, "text": "And also the psychology, I wanted to be a psychiatrist for a long time."}, {"time": 8433, "text": "I was fascinated by the human mind until I discovered artificial intelligence, the fact that I could program and make a robot move."}, {"time": 8444, "text": "And until I discovered that magic, I thought I wanted to understand the human mind by being psychiatrist, by talking to people, by to talk therapy, psychotherapy."}, {"time": 8455, "text": "So now you've got the best of both worlds because you get to talk to people and you get build robots."}, {"time": 8459, "text": "Yeah, I mean, but the dream ultimately is the robot."}, {"time": 8463, "text": "That I felt like by building the thing, can you start to try to understand it."}, {"time": 8469, "text": "I mean, we all have different skills and proclivities."}, {"time": 8472, "text": "So like my particular one is, has to do with, I learned by building."}, {"time": 8482, "text": "I think through a thing by building it."}, {"time": 8485, "text": "And programming is a wonderful thing because it allows you to like build a little toy example."}, {"time": 8490, "text": "So in the same way you can do a little thought experiment, programming allows you to create a thought experiment in action, it can move, it can live, it can, and then you can ask questions of it."}, {"time": 8500, "text": "So all of those, because of my interest in Freud and Young, you're also in different ways, have delved deeply into humanity, the human psyche through the perspective of those psychologists."}, {"time": 8520, "text": "So for all those reasons, I thought our paths were crossed."}, {"time": 8524, "text": "Yeah, so that's quite a frame for a discussion, right?"}, {"time": 8527, "text": "You had all sorts of reasons, and then you think, well, are you just letting the conversation go where it will?"}, {"time": 8533, "text": "It's like, well, not exactly."}, {"time": 8535, "text": "You spent all this time, it's not like this came about by accident, this conversation, you spent all this time framing it."}, {"time": 8542, "text": "And so all of that provides the implicit substructure for the play in the conversation."}, {"time": 8548, "text": "And if you have that implicit, here's another way, this is very much worth knowing is, if you get the implicit structure of perception right, everything becomes a game."}, {"time": 8560, "text": "And not only that, a game you wanna play, and maybe in the final analysis, a game you'd wanna play forever."}, {"time": 8567, "text": "So that's obviously a distant beckoning ideal, but we know only games need rules, or there's no play."}, {"time": 8578, "text": "Is there advice you can give, now that we know the frame, to give to me, Lex, about how to do this podcast better, how to think about this world, how to be a good engineer, how to be a good human being, from what you know about me."}, {"time": 8605, "text": "Take your preoccupation with suffering seriously."}, {"time": 8608, "text": "It's a serious business, right?"}, {"time": 8612, "text": "And that's part of that, to circle back to the beginning, let's say, that's that willingness to gaze into the abyss, which is obviously what you were doing when you went to Ukraine."}, {"time": 8622, "text": "It's like, it's gazing into the abyss that makes you better."}, {"time": 8627, "text": "The thing is, and this is maybe where Nietzsche's ideas, not as differentiated as it became, sometimes your gaze can be forcefully directed towards the abyss, and then you're traumatized."}, {"time": 8641, "text": "If it's involuntary and accidental, it can kill you."}, {"time": 8645, "text": "The more it's voluntary, the more transformative it is."}, {"time": 8651, "text": "And that's part of that idea about facing death and hell."}, {"time": 8654, "text": "It's like, can you tolerate death and hell?"}, {"time": 8658, "text": "And the answer is, this terrible answer is, yes, to the degree that you're willing to do it voluntarily."}, {"time": 8667, "text": "And then you might ask, well, why should I have to subject myself to death and hell?"}, {"time": 8673, "text": "I'm innocent."}, {"time": 8675, "text": "And then the answer to that is, even the innocent must be voluntarily sacrificed to the highest good."}, {"time": 8684, "text": "Even the innocent must be voluntarily sacrificed to the highest good."}, {"time": 8694, "text": "That's such an interesting distinction."}, {"time": 8698, "text": "Voluntary suffering."}, {"time": 8699, "text": "Voluntary, yeah, yeah."}, {"time": 8701, "text": "Well, that's why the central Christian doctrine is, pick up your cross and follow me."}, {"time": 8708, "text": "And I'm speaking, not in religious terms saying that, I'm just speaking as a psychologist."}, {"time": 8713, "text": "It's like one of the things we've learned in the last 100 years is voluntary exposure to that which freezes and terrifies you in measured proportions is curative."}, {"time": 8726, "text": "So a form of, at least in part, involuntary suffering is depression."}, {"time": 8734, "text": "Do you have advice for people on how to find a way out?"}, {"time": 8740, "text": "You're a man who has suffered in this way."}, {"time": 8743, "text": "Perhaps continue to suffer in this way."}, {"time": 8746, "text": "How do you find a way out?"}, {"time": 8751, "text": "The first thing I do as a clinician, if someone comes to me and says they're depressed is ask myself a question."}, {"time": 8758, "text": "Well, what does this person mean by that?"}, {"time": 8760, "text": "So I have to find out like, because maybe they're not depressed, maybe they're hyper anxious, or maybe they're obsessional."}, {"time": 8766, "text": "Like there's various forms of powerful negative emotion."}, {"time": 8770, "text": "So they need to be differentiated."}, {"time": 8772, "text": "But then the next question you have to ask is, well, are you depressed?"}, {"time": 8776, "text": "Or do you have a terrible life?"}, {"time": 8779, "text": "Or is it some combination of the two?"}, {"time": 8781, "text": "So if you're depressed, as far as I can tell, you don't have a terrible life."}, {"time": 8789, "text": "You have friends, you have family, you have an intimate relationship, you have a job or a career, you're about as educated as you should be given your intelligence, use your time outside of work wisely, you're not beholden to alcohol or other temptations."}, {"time": 8804, "text": "You're engaged in the community in some fundamental sense, and all that's working."}, {"time": 8809, "text": "Now, if you have all that and you're feeling really awful, you're either ill or you're depressed."}, {"time": 8814, "text": "And so then sometimes there's a biochemical route to that treatment of that."}, {"time": 8819, "text": "My experience has been as a clinician is if you're depressed, but you have a life and you take an antidepressant, it will probably help you a lot."}, {"time": 8827, "text": "Now, maybe you're not depressed."}, {"time": 8829, "text": "Exactly, you just have a terrible life."}, {"time": 8835, "text": "You have no relationship, your family's a mess, you've got no friends, you've got no plan, you've got no job."}, {"time": 8843, "text": "You use your time outside of work not only badly but destructively."}, {"time": 8847, "text": "You have a drug or alcohol habit or some other vice, pornography addiction."}, {"time": 8853, "text": "You're completely unengaged in the surrounding community."}, {"time": 8856, "text": "You have no scaffolding whatsoever to support you in your current mode of being or you move forward."}, {"time": 8863, "text": "And then as a therapist, well, you do two things."}, {"time": 8867, "text": "Well, if it's depression per se, well, like I said, there's sometimes a biochemical route, a nutritional route, there's ways that can be addressed."}, {"time": 8875, "text": "It's probably physiological if you're, at least in part, if you're depressed, but you have an okay life."}, {"time": 8880, "text": "Sometimes it's conceptual."}, {"time": 8883, "text": "You can turn to dreams sometimes to help people."}, {"time": 8885, "text": "Cause dreams contain the seeds of the potential future."}, {"time": 8889, "text": "And if your person is a real good dreamer and you can analyze dreams, that can be really helpful."}, {"time": 8893, "text": "But that seems to be only true for more creative people."}, {"time": 8896, "text": "And for the people who just have a terrible life, it's like, okay, you have a terrible life."}, {"time": 8902, "text": "Well, let's pick a front."}, {"time": 8906, "text": "How about you need a friend?"}, {"time": 8909, "text": "Like one sort of friend."}, {"time": 8912, "text": "Do you know how to shake hands and introduce yourself?"}, {"time": 8916, "text": "I'll have the person show me."}, {"time": 8918, "text": "So let's do it for a sec."}, {"time": 8920, "text": "So it's like this, hi, I'm Jordan, right?"}, {"time": 8925, "text": "And people don't know how to do that."}, {"time": 8926, "text": "And then they can't even get the ball rolling."}, {"time": 8929, "text": "For the listener, Jordan just gave me a firm handshake."}, {"time": 8931, "text": "Yeah, as opposed to a dead fish, you know?"}, {"time": 8934, "text": "And there's these elementary social skills that hypothetically, if you were well cared for, you learned when you were like three and sometimes people have, I had lots of clients to whom no one ever paid any attention."}, {"time": 8949, "text": "And they needed like 10,000 hours of attention."}, {"time": 8952, "text": "And some of that was just listening because they had 10,000 hours of conversations they never had with anyone."}, {"time": 8959, "text": "And they were all tangled up in their head."}, {"time": 8961, "text": "And they had to just, one client in particular, I worked with this person for 15 years."}, {"time": 8968, "text": "And what she wanted from me was for me just to shut the hell up for 50 minutes."}, {"time": 8976, "text": "It was very hard for me."}, {"time": 8978, "text": "And to just tell me what had happened to her."}, {"time": 8982, "text": "And then what happened at the end of the conversation, then I could discuss a bit with her."}, {"time": 8988, "text": "And then as we progressed through the years, the amount of time that we spent in discussion increased in proportion in the sessions until by the time we stopped seeing each other, when my clinical practice collapsed, we were talking about 80% of the time."}, {"time": 9006, "text": "But she literally, she'd never been attended to properly ever."}, {"time": 9009, "text": "And so she was an uncarved block in the Taoist sense, right?"}, {"time": 9013, "text": "She hadn't been subjected to those flaming swords that separated the wheat from the chaff."}, {"time": 9019, "text": "And so you can do that in therapy."}, {"time": 9022, "text": "If you're listening and you're depressed, I would say if you can't find a therapist, and that's getting harder and harder because it's actually become illegal to be a therapist now because you have to agree with your clients, which is a terrible thing to do with them."}, {"time": 9037, "text": "Just like it's terrible just to arbitrarily oppose them."}, {"time": 9040, "text": "You could do the self authoring program online because it helps you write an autobiography."}, {"time": 9046, "text": "And so if you have memories that are more than 18 months old that bother you when you think them up, part of you is locked inside that."}, {"time": 9054, "text": "An undeveloped part of you is still trapped in that."}, {"time": 9059, "text": "That's a metaphorical way of thinking about, that's why it still has emotional significance."}, {"time": 9064, "text": "So you can write about your past experiences, but I would say wait for at least 18 months if something bad has happened to you."}, {"time": 9070, "text": "Because otherwise you just hurt yourself again by encountering it."}, {"time": 9074, "text": "You can bring yourself up to date with an autobiography."}, {"time": 9076, "text": "There's an analysis of faults and virtues, that's the present authoring."}, {"time": 9080, "text": "And then there's a guided writing exercise that helps you make a future plan."}, {"time": 9085, "text": "That's young men who do that could go to college, young men who do that, 90 minutes, just the future authoring, 90 minutes, they're 50% less likely to drop out."}, {"time": 9098, "text": "So sometimes depression is this heavy cloud that makes it hard to even make a single step towards it."}, {"time": 9106, "text": "Or you said isolate, make a friend."}, {"time": 9108, "text": "Oh man, sometimes the first step is extremely difficult."}, {"time": 9112, "text": "Oh my God, sometimes it's way worse than that."}, {"time": 9114, "text": "Like I had clients who were so depressed they literally couldn't get out of bed."}, {"time": 9119, "text": "So what's their first step?"}, {"time": 9121, "text": "It's like, can you sit up once today?"}, {"time": 9127, "text": "Can you prop yourself up on your elbows once today?"}, {"time": 9130, "text": "Like you just, you scale back the dragon till you find one that's conquerable that moves you forward."}, {"time": 9138, "text": "There's a rubric for life."}, {"time": 9139, "text": "Scale back the dragons till you find one conquerable and it'll give you a little bit of goal."}, {"time": 9145, "text": "Commensurate with the struggle."}, {"time": 9147, "text": "But the plus side of that, cause that's, you think that God, that's depressing."}, {"time": 9151, "text": "You mean I have to start by sitting up?"}, {"time": 9155, "text": "Well you do if you can't sit up."}, {"time": 9157, "text": "But the plus side of that is it's the Pareto distribution issue is that aggregates exponentially increase and failures do too by the way."}, {"time": 9167, "text": "But aggregates exponentially increase."}, {"time": 9170, "text": "So once you start the ball rolling it can get zipping along pretty good."}, {"time": 9173, "text": "This person that I talked about was incapable of sitting with me in a cafe when we first met just talking even though I was her therapist."}, {"time": 9184, "text": "But by the end she was doing standup comedy."}, {"time": 9188, "text": "So, you know, it took years, but still most people won't do standup comedy."}, {"time": 9194, "text": "That's quite the bloody achievement."}, {"time": 9195, "text": "She would read her poetry on stage too."}, {"time": 9200, "text": "So for someone who was petrified into paralysis by social anxiety and who had to start very small, it was a hell of an accomplishment."}, {"time": 9211, "text": "Yeah, it all starts with one step."}, {"time": 9213, "text": "Do you have advice for young people in high school?"}, {"time": 9218, "text": "You've given, a lot of people look up to you for advice, for strength, for strength to search for themselves, to find themselves."}, {"time": 9227, "text": "Take on some responsibility."}, {"time": 9230, "text": "Do something for other people."}, {"time": 9233, "text": "You're doing something for yourself while you're doing that even if you don't know it, for sure."}, {"time": 9237, "text": "Cause you're a community across time."}, {"time": 9240, "text": "Find something to serve."}, {"time": 9242, "text": "Somebody to help."}, {"time": 9243, "text": "Someone to help, a job to, find a job, do your best with the customers."}, {"time": 9248, "text": "Don't be above your job."}, {"time": 9250, "text": "You're gonna get an entry level job when you're a kid or what else would you want?"}, {"time": 9254, "text": "You wanna be the boss?"}, {"time": 9256, "text": "You don't know anything."}, {"time": 9257, "text": "You could be the boss of your job."}, {"time": 9260, "text": "You know, if you're working in a grocery store or you're working in a convenience store, assuming you're not working for terrified tyrants, you can be nice to the customers."}, {"time": 9268, "text": "You can develop your social skills."}, {"time": 9270, "text": "You can learn how to handle boss employee relationship."}, {"time": 9274, "text": "You can be there 15 minutes early and leave 15 minutes late."}, {"time": 9277, "text": "Like you can learn in an entry level job, man."}, {"time": 9280, "text": "And I'll tell you, if you take an entry level job and you learn and it's a reasonably decent place, you will not be in an entry level job for long because everyone who's competent is desperate for competent people."}, {"time": 9292, "text": "And if you go and show yourself as competent, there'll be a trial period."}, {"time": 9295, "text": "But if you go show yourself as competent, all sorts of doors you didn't even know were there will start opening like mad."}, {"time": 9301, "text": "So you strive for competence, for craftsmanship."}, {"time": 9304, "text": "Yeah, yeah, yeah, for discipline, you know, I mean, I said in one of the chapters, my books is focused on putting your house in order."}, {"time": 9314, "text": "It's like, well, how do you start?"}, {"time": 9318, "text": "You know, it actually took me quite a long time in my life before I made my bed regularly in the morning."}, {"time": 9323, "text": "Most of my life was pretty good order, but that was one thing I didn't have in order."}, {"time": 9327, "text": "My clothes in my closet as well, all that's in order."}, {"time": 9331, "text": "Not all of it, I'm cleaning out some drawers right now, but look around and see what bugs you in your room."}, {"time": 9337, "text": "Just look."}, {"time": 9339, "text": "It's like, okay, I'm in my room."}, {"time": 9340, "text": "Do I like this room?"}, {"time": 9341, "text": "No, it bugs me."}, {"time": 9344, "text": "Well, the paint's peeling there and it's dusty there and the carpet's dirty and that corner's kind of ugly and the light there isn't very good."}, {"time": 9352, "text": "And my clothes closet's a mess, so I don't even like to open it."}, {"time": 9356, "text": "Okay, that's a lot of problems."}, {"time": 9359, "text": "That sucks."}, {"time": 9360, "text": "That's a lot of opportunity."}, {"time": 9362, "text": "Pick something and fix it."}, {"time": 9364, "text": "Something that bugs you."}, {"time": 9365, "text": "Yeah, but not too much."}, {"time": 9367, "text": "So the rule is pick something you know would make, pick a problem, pick a solution to it that you know would help, that you could do, that you would do."}, {"time": 9380, "text": "So you have to negotiate with yourself."}, {"time": 9382, "text": "It's like, well, I won't clean up this room."}, {"time": 9384, "text": "I've been in here for 10 years and I've never cleaned it up."}, {"time": 9387, "text": "It's like, well, obviously that's too big a dragon for you."}, {"time": 9389, "text": "Would you clean one drawer?"}, {"time": 9392, "text": "Find out."}, {"time": 9394, "text": "And so imagine now you wanna be happy when you open that drawer and you think, well, that's stupid."}, {"time": 9397, "text": "It's like, is it?"}, {"time": 9400, "text": "Maybe it's your sock drawer, which I cleaned up in my room the other day."}, {"time": 9403, "text": "By the way, you're gonna open that every morning."}, {"time": 9407, "text": "That's like 30 seconds of your life every day."}, {"time": 9410, "text": "Okay, so that's three minutes a week."}, {"time": 9414, "text": "That's 12 minutes a month."}, {"time": 9417, "text": "That's two hours a year."}, {"time": 9419, "text": "So maybe your life is made out of, you've got 16 hours a day."}, {"time": 9423, "text": "Five, 12 in an hour, 12 in an hour, 144 in 12 hours."}, {"time": 9429, "text": "Yeah, let's say 200, 205 minute chunks."}, {"time": 9432, "text": "Ladies and gentlemen, Jordan Peterson did just some math how many five minute chunks there are in a day."}, {"time": 9437, "text": "And I'm pretty sure it's pretty accurate."}, {"time": 9439, "text": "It's approximately right."}, {"time": 9440, "text": "So you got 205 minute chunks and they repeat."}, {"time": 9444, "text": "A lot of them repeat."}, {"time": 9446, "text": "So if you get every one of those right, they're trivial, right, who cares what my sock drawer looks like."}, {"time": 9450, "text": "It's like, fair enough, man, but that's your life."}, {"time": 9453, "text": "The things you repeat every day, the mundane things."}, {"time": 9456, "text": "Think I could get all those mundane things right."}, {"time": 9459, "text": "That's the game rules."}, {"time": 9460, "text": "It's like now all the mundane is in place."}, {"time": 9463, "text": "Now you can play because all the mundane is in place."}, {"time": 9465, "text": "And this is actually true."}, {"time": 9467, "text": "So with children, imagine you want your children to play."}, {"time": 9471, "text": "Well, play is very fragile neurologically."}, {"time": 9473, "text": "Any competing motivation or emotion will suppress play."}, {"time": 9477, "text": "So everything has to be in order."}, {"time": 9480, "text": "Everything has to be a walled garden before the children will play."}, {"time": 9484, "text": "That's a good way of thinking about it."}, {"time": 9485, "text": "So you put everything in order and you think, oh my God, now I'm tyrannized by this order."}, {"time": 9489, "text": "It's like, no, you aren't, not if it's voluntary."}, {"time": 9492, "text": "And then the order is the precondition for the freedom."}, {"time": 9495, "text": "And so then all of a sudden you get all these things in order."}, {"time": 9497, "text": "It's like, oh, look at this."}, {"time": 9499, "text": "I've got some room to play here."}, {"time": 9501, "text": "And then maybe you're not depressed."}, {"time": 9504, "text": "Now it's often not that simple."}, {"time": 9506, "text": "You know, it's not that simple."}, {"time": 9508, "text": "Try putting your room in order, perfect order."}, {"time": 9511, "text": "I mean, it's a really powerful way to think about those five minute chunks."}, {"time": 9514, "text": "Just get one of them right in a day."}, {"time": 9516, "text": "Yeah, well, if you do that for 200 days, your life is in order."}, {"time": 9521, "text": "You know, I thought I did that with my clients a lot."}, {"time": 9523, "text": "So a lot of them would come home from work, the guys, and their wives would meet them at the door and it'd be a fight right away."}, {"time": 9529, "text": "You know, and it's a clash there because he comes home and he's tired and hungry."}, {"time": 9533, "text": "He's worked all day and he's hoping that, you know, he gets welcomed when he comes back to the home, but then the wife is at home and she's been with the kids all day and she's tired and hungry and she's hoping that when he comes home, he'll show her some appreciation for what's happened today."}, {"time": 9545, "text": "And then they clash and then they both have problems to discuss because they've had their troubles during the day."}, {"time": 9550, "text": "And so then every time they get together, they're not like it's a bit of a fight for 20 minutes and then the whole evening is screwed."}, {"time": 9558, "text": "And so then you think, okay, here's the deal."}, {"time": 9563, "text": "It's knock and the door will open."}, {"time": 9564, "text": "Okay, you get to pick what happens when you come home, but you have to figure out what it is."}, {"time": 9570, "text": "So now this is the deal."}, {"time": 9571, "text": "You treat yourself properly."}, {"time": 9573, "text": "You imagine coming home and it goes the way you want and need it to go."}, {"time": 9578, "text": "Okay, what does that look like?"}, {"time": 9581, "text": "You get to have it, but you have to know what it is."}, {"time": 9585, "text": "And you think, okay, I want to come home."}, {"time": 9588, "text": "I want to be happy about coming home."}, {"time": 9589, "text": "I come home, I open the door."}, {"time": 9593, "text": "I say, hello, honey, I'm home."}, {"time": 9596, "text": "My wife says, hi, it's so nice to hear your voice."}, {"time": 9598, "text": "She comes up, she says, hi, dear."}, {"time": 9602, "text": "She gives you a hug."}, {"time": 9603, "text": "She says, how was your day?"}, {"time": 9605, "text": "And you say, well, we'll sit and talk about that."}, {"time": 9607, "text": "How was your day?"}, {"time": 9608, "text": "Well, we'll sit and talk about that."}, {"time": 9610, "text": "Do you need something to eat?"}, {"time": 9612, "text": "Probably, let's go sit and talk about our day."}, {"time": 9616, "text": "It's like, that sounds pretty good."}, {"time": 9618, "text": "Okay, that sounds pretty good."}, {"time": 9619, "text": "Might not be perfect, but sounds a hell of a lot better than what we're doing now."}, {"time": 9623, "text": "So how about we go talk to, we'll go talk to your wife and say, okay, this is what's happening when I come home."}, {"time": 9631, "text": "I would like it to be better."}, {"time": 9632, "text": "What would you like to have happened if you could have what you wanted?"}, {"time": 9637, "text": "And so she sits down and she thinks, okay, if he comes home, what do I want to have happen?"}, {"time": 9641, "text": "And then now you got two visions and you say, well, what would you like?"}, {"time": 9645, "text": "And you listen and she says, what would you like?"}, {"time": 9648, "text": "And you tell her, and then you think, okay, now how can we bring these visions together?"}, {"time": 9653, "text": "So not only do we both get what we want, but because we've brought them together, we even get more than we want."}, {"time": 9658, "text": "Well, who wouldn't agree to that unless they were aiming down."}, {"time": 9661, "text": "And that's so exciting."}, {"time": 9662, "text": "It's not a compromise."}, {"time": 9664, "text": "It's a union of ideals that even makes a better ideal."}, {"time": 9668, "text": "And then you get to come home."}, {"time": 9669, "text": "And then there's another rule that goes along with that, which is, please, dear, have the grace to allow me to do this stupidly and badly while I learn at least 20 times."}, {"time": 9683, "text": "And I'll give you the same leeway, and then we'll practice stupidly for 20 times and we'll talk about it."}, {"time": 9690, "text": "And then maybe we'll get it right for the next 10,000 times, right?"}, {"time": 9695, "text": "And you can do that with your whole life."}, {"time": 9697, "text": "And you can do that with your kids and you can do that with your family."}, {"time": 9700, "text": "Like it's not easy, but you can do it."}, {"time": 9702, "text": "It's a lot easier than the alternative."}, {"time": 9704, "text": "Let me ask for some dating advice from Jordan Peterson."}, {"time": 9707, "text": "How do you find on that topic the love of your life?"}, {"time": 9714, "text": "I was asked that multiple times on my tour, three times in a row, in fact, because we ask people to use this Slido gadget."}, {"time": 9723, "text": "That's a popular question?"}, {"time": 9725, "text": "To vary."}, {"time": 9726, "text": "It always came up to the top."}, {"time": 9727, "text": "And I got asked that three times in a row and I didn't have a good answer."}, {"time": 9731, "text": "And then I thought, why don't I have a good answer?"}, {"time": 9736, "text": "I thought, oh, I know why."}, {"time": 9737, "text": "Cause that's a stupid question."}, {"time": 9745, "text": "Because it's putting the cart before the horse."}, {"time": 9747, "text": "Here's the right question."}, {"time": 9751, "text": "How do I make myself into the perfect date?"}, {"time": 9754, "text": "You answer that question and you will not have any problem answering the previous question."}, {"time": 9759, "text": "It's like, what do I want in a partner?"}, {"time": 9764, "text": "If I offered everything I could to a partner who would I be?"}, {"time": 9767, "text": "You work on that."}, {"time": 9769, "text": "Just ask."}, {"time": 9770, "text": "Just ask yourself, okay."}, {"time": 9772, "text": "I have to be the person that women would want."}, {"time": 9779, "text": "Okay, what do they want?"}, {"time": 9782, "text": "Clean."}, {"time": 9783, "text": "That's not a bad start."}, {"time": 9787, "text": "Reasonably good physical shape."}, {"time": 9791, "text": "So healthy, productive, generous, honest, willing to delay gratification."}, {"time": 9801, "text": "So you dance with a woman."}, {"time": 9802, "text": "It's like, what's she doing?"}, {"time": 9803, "text": "What are you two doing?"}, {"time": 9804, "text": "Well, it's a pattern."}, {"time": 9806, "text": "There's patterns happening around you."}, {"time": 9808, "text": "That's the music, patterns, patterns of being."}, {"time": 9810, "text": "That's the music."}, {"time": 9811, "text": "Now, can you align yourself with the patterns of being gracefully?"}, {"time": 9815, "text": "That's what she's checking out."}, {"time": 9817, "text": "And then can you do that with her?"}, {"time": 9821, "text": "And then can you do that in a playful and attentive manner and keep your bloody hands to yourself for at least a minute?"}, {"time": 9829, "text": "And so can you dance in a playful manner?"}, {"time": 9832, "text": "It's like, you can go through this in your imagination and you know, you'll know, you know."}, {"time": 9838, "text": "And then you think, well, how far am I from those things?"}, {"time": 9840, "text": "And the answer is usually, man, it's pretty horrible abyss separating you from that ideal."}, {"time": 9846, "text": "But the harder you work on offering other people what they need and want, the more people will line up to play with you."}, {"time": 9856, "text": "And so it's the wrong question."}, {"time": 9858, "text": "It's like, how can I be the best partner possible?"}, {"time": 9861, "text": "And then you think, well, if I do that, people will just take advantage of me."}, {"time": 9865, "text": "And that's the non naive objection, right?"}, {"time": 9868, "text": "Because the naive person is saying, well, I'll be good and everyone will treat me right."}, {"time": 9871, "text": "It's like the cynic says, no, I'll be good and someone will take me out."}, {"time": 9878, "text": "And then you think, well, what do you do about that objection?"}, {"time": 9882, "text": "And the answer is, well, you factor that in."}, {"time": 9885, "text": "And that's why you're supposed to be, what is it?"}, {"time": 9888, "text": "As soft as a dove and as wise as a serpent."}, {"time": 9891, "text": "It's like, I know you're full of snakes."}, {"time": 9894, "text": "I know it."}, {"time": 9895, "text": "Maybe I know it more than you do, but we'll play anyways."}, {"time": 9900, "text": "And that's the risk anyway."}, {"time": 9902, "text": "That's right, voluntarily, right?"}, {"time": 9904, "text": "It's like, and what's so cool about that is that even though the person you're dealing with is full of snakes, if you offer your hand in trust and it's real, you will evoke the best in them."}, {"time": 9916, "text": "And that's true even, I've dealt with people who are pretty damn criminal and pretty psychopathic and sometimes dangerously so."}, {"time": 9928, "text": "And you tread very lightly when you're dealing with someone like that, especially if they're intoxicated."}, {"time": 9933, "text": "And even then your best bet is that alert trust."}, {"time": 9942, "text": "It's the only, it's the fact that the only thing I know that I had one client who was a paranoid, he was paranoid psychopath."}, {"time": 9951, "text": "That's a bad combination."}, {"time": 9952, "text": "He was a bad guy, man."}, {"time": 9954, "text": "He had like four restraining orders on him and restraining orders don't work on the sort of people that you put restraining orders on."}, {"time": 9962, "text": "And he used to be harassed now and then by a bureaucrat in a bank with delusions of power."}, {"time": 9970, "text": "And he would say to them, he used to kind of act this out to me when I was talking to him."}, {"time": 9974, "text": "He'd say, I'm going to be your worst nightmare."}, {"time": 9980, "text": "And he meant it and he would do it."}, {"time": 9983, "text": "He had this obsessional psychopathic vengeance that was just like right there, paranoid to the hilt and paranoid people are hyper acute."}, {"time": 9994, "text": "So they're watching you for any sign of deceit or manipulation and they're really good at it."}, {"time": 10001, "text": "Cause like they're 100%, that's what paranoia is."}, {"time": 10004, "text": "It's 100% focus on that."}, {"time": 10007, "text": "And even under those circumstances, if you step carefully enough, you can, maybe you can avoid the ax."}, {"time": 10017, "text": "That's a good thing to know if you ever meet someone truly dangerous."}, {"time": 10022, "text": "I believe in that, that being fragile, nevertheless, taking that leap of trust towards another person, even when they're dangerous, especially when they're dangerous."}, {"time": 10032, "text": "If you care, if there's something there in those hills you want to find, then that's probably the only way you're going to find is taking that risk."}, {"time": 10043, "text": "I have to ask you about Gulag Archipelago by Solzhenitsyn."}, {"time": 10048, "text": "Let's speak to this very point."}, {"time": 10050, "text": "There's so many layers to this book."}, {"time": 10051, "text": "We could talk about it forever."}, {"time": 10053, "text": "I'm sure in many ways we are talking about it forever."}, {"time": 10058, "text": "But there is sort of one of the themes captured in the few ways that was described to the book is that line between good and evil that runs through every human being."}, {"time": 10068, "text": "As he writes, the line dividing good and evil cuts through the heart of every human being."}, {"time": 10075, "text": "During the life of any heart, this line keeps changing place."}, {"time": 10079, "text": "Sometimes it is squeezed one way to exuberant evil, and sometimes it shifts to allow enough space for good to flourish."}, {"time": 10087, "text": "One and the same human being is, at various ages, under various circumstances, a totally different human being."}, {"time": 10095, "text": "At times he's close to being a devil, at times the sainthood."}, {"time": 10100, "text": "But his name doesn't change, and to that name we ascribe the whole lot, good and evil."}, {"time": 10106, "text": "What do you think about this line?"}, {"time": 10107, "text": "What do you think about this thing where we talked about if you give somebody a chance, you actually bring out the best in them?"}, {"time": 10113, "text": "What do you think about this other aspect that throughout time that line shifts inside each person and you get to define that shift?"}, {"time": 10125, "text": "Are we all capable of evil?"}, {"time": 10128, "text": "Well, you know, the cosmic drama, that's Satan versus Christ."}, {"time": 10133, "text": "It's like, well, who's that about?"}, {"time": 10135, "text": "If it's not about you?"}, {"time": 10139, "text": "I'm speaking just as a psychologist or as a literary critic."}, {"time": 10143, "text": "Those are characters, at least they're that."}, {"time": 10146, "text": "Well, are they human characters?"}, {"time": 10148, "text": "Well, obviously."}, {"time": 10150, "text": "Well, are they archetypal human characters?"}, {"time": 10154, "text": "What does that mean cosmically and ontologically?"}, {"time": 10159, "text": "Like, is the world a story?"}, {"time": 10163, "text": "But the way stories are often told is the characters embody a stable."}, {"time": 10167, "text": "Those are unsophisticated, not great literature though."}, {"time": 10170, "text": "It's very rare in great literature."}, {"time": 10172, "text": "What you have in great literature generally is the internal drama, right?"}, {"time": 10175, "text": "And as the literature becomes more pop, I would say, the characters are more unitary."}, {"time": 10182, "text": "So there's a real bad guy and he's all bad and there's a real good guy and he's all good."}, {"time": 10187, "text": "And that's not as interesting."}, {"time": 10189, "text": "It's not as sophisticated."}, {"time": 10191, "text": "When you reach Dostoevskian heights in literary representation or Shakespearean heights, you can identify with the villain."}, {"time": 10201, "text": "And that's when literature really reaches its pinnacle in some sense."}, {"time": 10206, "text": "And also the characters change throughout."}, {"time": 10208, "text": "They shift throughout."}, {"time": 10209, "text": "They're unpredictable throughout."}, {"time": 10211, "text": "Taking the speaking of Russian more seriously recently."}, {"time": 10214, "text": "And I've gotten to talk to translators of Dostoevsk and Tolstoy and Cherkov and those kinds of folks."}, {"time": 10222, "text": "And you get the, one of the mistakes that translators made with Dostoevsky for the longest time is they would, quote unquote, fix the chaotic mess that is Dostoevsky because there was a sense like he was too rushed in his writing."}, {"time": 10239, "text": "It seemed like there was tangents that had nothing to do with anything."}, {"time": 10243, "text": "The characters were unpredictable and not inconsistent."}, {"time": 10246, "text": "There's parts of phrases that seem to be incomplete, that kind of stuff."}, {"time": 10250, "text": "And what they realize that is, that's not, that's actually crafted that way."}, {"time": 10255, "text": "It's not, it's like editing James Joyce, like Finnegan's Wake or something because it doesn't make any sense."}, {"time": 10261, "text": "They realize that that is the magic of it."}, {"time": 10263, "text": "That captures the humanity of these characters, that they are unpredictable."}, {"time": 10267, "text": "They change throughout time."}, {"time": 10268, "text": "There's a bunch of contradictions."}, {"time": 10271, "text": "On which point I gotta ask, is there a case to be made that Brothers Karamazov is the greatest book I've ever written?"}, {"time": 10277, "text": "Yeah, there is a case to be made for that."}, {"time": 10280, "text": "I don't know, is it better than Crime and Punishment?"}, {"time": 10284, "text": "Why do you, I'm not arguing with it."}, {"time": 10288, "text": "Well, every book is a person."}, {"time": 10290, "text": "Some of my best friends are inside that book."}, {"time": 10292, "text": "Yeah, it's an amazing book."}, {"time": 10294, "text": "I mean, there's no doubt about it."}, {"time": 10295, "text": "I think it's, some books are defined by your personal relationship with them."}, {"time": 10301, "text": "That one was definitive, and I almost graduated to that one because for the longest time, The Idiot was my favorite book of all, because I identified with the ideas represented by Prince Mishkin."}, {"time": 10315, "text": "I also identified."}, {"time": 10316, "text": "Ah, that's interesting."}, {"time": 10318, "text": "To Prince Mishkin as a human being."}, {"time": 10320, "text": "The holy fool."}, {"time": 10321, "text": "The fool, yeah, because the world kind of, my whole life still kind of sees me, saw me in my perception."}, {"time": 10328, "text": "My narrow perception is kind of the fool."}, {"time": 10332, "text": "And I, different from the interpretation that a lot of people take of this book, I see him as a kind of hero to be."}, {"time": 10343, "text": "To be a naive, quote unquote, fool, but really just a naive optimist, and naive in the best possible way."}, {"time": 10353, "text": "That's childlike?"}, {"time": 10354, "text": "Yeah, childlike is a better."}, {"time": 10356, "text": "So naive is usually seen as."}, {"time": 10358, "text": "That's childish, naive."}, {"time": 10359, "text": "Yeah, but childlike."}, {"time": 10362, "text": "That's why no one enters the kingdom of heaven unless they become like a child."}, {"time": 10368, "text": "That's Prince Mishkin."}, {"time": 10369, "text": "Dostoevsky knew that."}, {"time": 10370, "text": "So that's why he liked The Idiot."}, {"time": 10373, "text": "See, I think I like Crime and Punishment because while you identified with Mishkin, I think I identified more with Raskolnikov because I was tempted by a Luciferian intellect, you know, in a manner very similar to the manner he was tempted."}, {"time": 10387, "text": "But I mean, I think you can make a case that the Brothers Karamazov is Dostoevsky's crowning achievement."}, {"time": 10395, "text": "And that's something, man."}, {"time": 10396, "text": "He ruined literature for me."}, {"time": 10400, "text": "Because everything else just felt insipid afterwards."}, {"time": 10405, "text": "I found some books that in my experience hit that pinnacle."}, {"time": 10411, "text": "The Master and Margarita."}, {"time": 10414, "text": "That's a deadly book."}, {"time": 10415, "text": "I've read that I think four times, and I still, there's still, it's unbelievably deep."}, {"time": 10421, "text": "There's a Nikos Kazantzakis, a Greek writer."}, {"time": 10424, "text": "Some of his books are, his writing is amazing as well."}, {"time": 10428, "text": "Did you ever connect with the literary, like existentialist Camus or people like Hermann Hesse or even Kafka?"}, {"time": 10439, "text": "Did you ever connect with those?"}, {"time": 10440, "text": "To the same degree?"}, {"time": 10441, "text": "Yeah, to the same."}, {"time": 10442, "text": "Enough to be an influence."}, {"time": 10443, "text": "You know, you have to be deaf in some fundamental sense not to encounters a great dead friend and fail to learn."}, {"time": 10452, "text": "No, and I mean, I tried to separate the wheat from the chaff when I read."}, {"time": 10456, "text": "You know, and I read all the great clinicians, all of them, perhaps not."}, {"time": 10461, "text": "Those who are foremost in the pantheon."}, {"time": 10464, "text": "And I tried to pull out what I could, and that was a lot."}, {"time": 10466, "text": "I learned a lot from Freud."}, {"time": 10468, "text": "I learned a lot from Rogers."}, {"time": 10470, "text": "And I learned a lot from, well, from Dostoevsky and Nietzsche."}, {"time": 10472, "text": "I'm gonna do a course on Dostoevsky and Nietzsche for this Peterson Academy."}, {"time": 10476, "text": "This is coming up in January."}, {"time": 10478, "text": "Oh, that'll be them together."}, {"time": 10480, "text": "I'm really looking forward to it."}, {"time": 10480, "text": "You're weaving, I mean."}, {"time": 10483, "text": "I hadn't thought about doing them together."}, {"time": 10486, "text": "That's a good idea."}, {"time": 10487, "text": "That'd be a good idea."}, {"time": 10488, "text": "Well, there's an interesting."}, {"time": 10490, "text": "I'm gonna steal that idea."}, {"time": 10492, "text": "You often weave them together really masterfully because there is religious in the broad sense of that word, themes throughout the writing."}, {"time": 10502, "text": "Throughout the writing of both."}, {"time": 10503, "text": "Yeah, well, there's uncanny parallelisms in their writing and their lives."}, {"time": 10507, "text": "So, and Dostoevsky's deeper than Nietzsche, but that's because he was a writer of fiction."}, {"time": 10515, "text": "Nietzsche is almost a character in a Dostoevsky book."}, {"time": 10518, "text": "He is definitely that."}, {"time": 10519, "text": "He is definitely that, yes."}, {"time": 10522, "text": "And apparently Nietzsche knew more about Dostoevsky than people had thought."}, {"time": 10525, "text": "There's been some recent scholarship on that grounds."}, {"time": 10527, "text": "Dostoevsky didn't know anything about Nietzsche as far as I know."}, {"time": 10530, "text": "I could be wrong about that."}, {"time": 10532, "text": "But the thing that Dostoevsky had over Nietzsche is Nietzsche had to make things propositional in some real sense, cause he was a philosopher."}, {"time": 10539, "text": "And it's hard to propositionalize things that are outside your ken, but you can characterize them."}, {"time": 10546, "text": "And so in the Brothers Karamazov, Ivan is a more developed character than Eleosha."}, {"time": 10554, "text": "In the explicit sense, he can make better arguments."}, {"time": 10558, "text": "But Eleosha wins, like Mishkin, because he's the better man."}, {"time": 10562, "text": "And Dostoevsky can show that in the actions."}, {"time": 10566, "text": "He can't render it entirely propositional, but that's probably because what's good can't be rendered entirely propositional."}, {"time": 10572, "text": "And so Dostoevsky had that edge over Nietzsche."}, {"time": 10574, "text": "He said, well, Ivan is this brilliant rationalist, atheist, materialist, and puts forward an argument on that front that's still unparalleled as far as I'm concerned."}, {"time": 10585, "text": "And overwhelms Eleosha, who cannot respond but Eleosha's still the better man."}, {"time": 10590, "text": "So, which is very interesting, you know, that."}, {"time": 10593, "text": "You know, the funny thing about those two characters is you, Jordan Peterson, seem to be somebody that at least in part embodies both."}, {"time": 10602, "text": "Because you are one of the intellectuals of our time, rigorous in thought, but also are able to have that kind of, what would you describe?"}, {"time": 10612, "text": "If you remove the religiosity of Eleosha, there's a, what's a good word?"}, {"time": 10619, "text": "Love towards the world."}, {"time": 10620, "text": "Spirit of encouragement."}, {"time": 10625, "text": "Yeah, well, it's, you know, one of the things I did learn, perhaps, from looking into the abyss to the degree that I have had to, or was willing to, was that at some level you have to make a fundamental statement of faith."}, {"time": 10640, "text": "When God creates the world, after each day, He says, He saw that it was good."}, {"time": 10646, "text": "You think, well, is it good?"}, {"time": 10648, "text": "It's like, well, there's a tough question."}, {"time": 10649, "text": "I mean, you know, do you want to bring a child into a world such as this, which is a fundamental question of whether or not it's good."}, {"time": 10658, "text": "It's an act of faith to declare that it's good because the evidence is ambivalent."}, {"time": 10664, "text": "And so then you think, okay, well, am I gonna act as if it's good?"}, {"time": 10669, "text": "And what would happen if I did?"}, {"time": 10671, "text": "And maybe the answer to that is, I think this is the answer."}, {"time": 10682, "text": "The more you act out the proposition that it's good, the better it gets."}, {"time": 10689, "text": "And so that's it."}, {"time": 10690, "text": "Dostoevsky said, this is something else."}, {"time": 10693, "text": "Every man is not only responsible for everything he does, but for everything everyone else does."}, {"time": 10698, "text": "It's like, what is that profound, or are you just insane?"}, {"time": 10703, "text": "Then you think, is what you receive back proportionate to what you deliver?"}, {"time": 10710, "text": "And the answer to that might be yes."}, {"time": 10712, "text": "That's a terrifying idea, man."}, {"time": 10714, "text": "And it's certainly, you can see that it's true in some sense because people certainly respond to you in kind with how you treat them."}, {"time": 10723, "text": "That's certainly the case."}, {"time": 10724, "text": "I mean, it's terrifying and it's exciting."}, {"time": 10729, "text": "But that's an adventure, isn't it?"}, {"time": 10731, "text": "You, yeah, you create the world by the way you live it."}, {"time": 10739, "text": "The world you experience is defined by the way you live that world."}, {"time": 10745, "text": "And then taken as a collective, we create the world together in that way."}, {"time": 10751, "text": "What's the meaning of life, Jordan Peterson?"}, {"time": 10753, "text": "You've, we've defined it many, many times throughout this conversation."}, {"time": 10756, "text": "It's the adventure along the route, man."}, {"time": 10760, "text": "And I would say, where's that adventure to be found?"}, {"time": 10764, "text": "In faith?"}, {"time": 10766, "text": "What's the faith?"}, {"time": 10767, "text": "The highest value is love and truth is its handmaiden."}, {"time": 10773, "text": "That's a statement of faith, right?"}, {"time": 10774, "text": "Because you can't tell."}, {"time": 10777, "text": "You have to act it out to see if it's true."}, {"time": 10781, "text": "If it's true."}, {"time": 10783, "text": "And so you can't even find out without, and that's so peculiar."}, {"time": 10787, "text": "You have to make the commitment a priori."}, {"time": 10790, "text": "It's like a marriage."}, {"time": 10793, "text": "It's like, well, is this the person for me?"}, {"time": 10796, "text": "Oh, that's the wrong question."}, {"time": 10799, "text": "How do I find out if this is the person for me?"}, {"time": 10802, "text": "By binding myself to them."}, {"time": 10807, "text": "Well, maybe the same thing is true of life, right?"}, {"time": 10809, "text": "You bind yourself to it."}, {"time": 10810, "text": "And the tighter you bind yourself to it, the more you find out what it is."}, {"time": 10814, "text": "And that's like a radical embrace."}, {"time": 10817, "text": "And it's a really radical embrace."}]}]