[{"title": "Joscha Bach: Artificial Consciousness and the Nature of Reality | Lex Fridman Podcast #101", "id": "P-2P3MSZrBM", "quotes": [{"time": 314, "text": "And he was unable to."}, {"time": 314, "text": "He's unable to do things if he's not intrinsically motivated."}, {"time": 321, "text": "So in some sense, my grandmother broke her son."}, {"time": 321, "text": "And her son responded when he became an architect to become an artist."}, {"time": 327, "text": "So he built 100 Wasser architecture."}, {"time": 327, "text": "He built houses without right angles."}, {"time": 333, "text": "He built lots of things that didn't work in the more brutalist traditions of eastern Germany."}, {"time": 338, "text": "And so he bought an old watermill, moved out to the countryside, and did only what he wanted to do, which was art."}, {"time": 344, "text": "Eastern Germany was perfect for Boheme, because you had complete material safety."}, {"time": 350, "text": "Food was heavily subsidized, healthcare was free."}, {"time": 350, "text": "You didn't have to worry about rent or pensions or anything."}, {"time": 355, "text": "So it's a socialized communist side."}, {"time": 355, "text": "And the other thing is, it was almost impossible not to be in political disagreement with your government, which is very productive for artists."}, {"time": 364, "text": "So everything that you do is intrinsically meaningful, because it will always touch on the deeper currents of society of culture and be in conflict with it and tension with it."}, {"time": 374, "text": "And you will always have to define yourself with respect to this."}, {"time": 374, "text": "So what impacted your father, this outside of the box thinker against the government, against the world artists?"}, {"time": 386, "text": "He was actually not a thinker."}, {"time": 386, "text": "He was somebody who only got self aware to the degree that he needed to make himself functional."}, {"time": 391, "text": "So in some sense, he was also in the late 1960s."}, {"time": 391, "text": "And he was in some sense a hippie."}, {"time": 399, "text": "So he became a one person cult."}, {"time": 399, "text": "He lived out there in his kingdom."}, {"time": 399, "text": "He built big sculpture gardens and started many avenues of art and so on and convinced a woman to live with him."}, {"time": 413, "text": "She was also an architect and she adored him and decided to share her life with him."}, {"time": 418, "text": "And I basically grew up in a big cave full of books."}, {"time": 418, "text": "I'm almost feral."}, {"time": 418, "text": "And I was bored out there."}, {"time": 425, "text": "It was very, very beautiful, very quiet, and quite lonely."}, {"time": 425, "text": "So I started to read."}, {"time": 425, "text": "And by the time I came to school, I've read everything until fourth grade and then some."}, {"time": 431, "text": "And there was not a real way for me to relate to the outside world."}, {"time": 436, "text": "And I couldn't quite put my finger on why."}, {"time": 441, "text": "And today I know it was because I was a nerd, obviously, and it was the only nerd around."}, {"time": 441, "text": "So there was no other kids like me."}, {"time": 446, "text": "And there was nobody interested in physics or computing or mathematics and so on."}, {"time": 452, "text": "And this village school that I went to was basically a nice school."}, {"time": 458, "text": "Kids were nice to me."}, {"time": 458, "text": "I was not beaten up, but I also didn't make many friends or build deep relationships."}, {"time": 462, "text": "They only happened in starting from ninth grade when I went into a school for mathematics and physics."}, {"time": 467, "text": "Do you remember any key books from this moment?"}, {"time": 471, "text": "I basically read everything."}, {"time": 471, "text": "So I went to the library and I worked my way through the children's and young adult sections."}, {"time": 476, "text": "And then I read a lot of science fiction, for instance, Stanislav Lem, basically the great author of Cybernetics, has influenced me."}, {"time": 481, "text": "Back then, I didn't see him as a big influence because everything that he wrote seemed to be so natural to me."}, {"time": 490, "text": "And it's only later that I contrasted it with what other people wrote."}, {"time": 490, "text": "Another thing that was very influential on me were the classical philosophers and also the literature of romanticism."}, {"time": 502, "text": "So German poetry and art, Troste Hilshoff and Heine and up to Hesse and so on."}, {"time": 509, "text": "Hesse."}, {"time": 509, "text": "I love Hesse."}, {"time": 509, "text": "So at which point do the classical philosophers end?"}, {"time": 509, "text": "At this point, we're in the 21st century."}, {"time": 515, "text": "What's the latest classical philosopher?"}, {"time": 515, "text": "Does this stretch through even as far as Nietzsche or is this, are we talking about Plato and Aristotle?"}, {"time": 525, "text": "I think that Nietzsche is the classical equivalent of a shit poster."}, {"time": 532, "text": "He's very smart and easy to read, but he's not so much trolling others."}, {"time": 532, "text": "He's trolling himself because he was at odds with the world."}, {"time": 537, "text": "Largely his romantic relationships didn't work out."}, {"time": 542, "text": "He got angry and he basically became a nihilist."}, {"time": 546, "text": "Isn't that a beautiful way to be as an intellectual is to constantly be trolling yourself, to be in that conflict, in that tension?"}, {"time": 554, "text": "I think it's a lack of self awareness."}, {"time": 554, "text": "At some point, you have to understand the comedy of your own situation."}, {"time": 558, "text": "If you take yourself seriously and you are not functional, it ends in tragedy as it did for Nietzsche."}, {"time": 565, "text": "I think you think he took himself too seriously in that tension."}, {"time": 593, "text": "So it's very, very understandable and have great sympathies for this to the degree that I can have sympathy for my own intellectual history."}, {"time": 602, "text": "But you have to grow out of it."}, {"time": 604, "text": "So as an intellectual, a life well lived, a journey well traveled is one where you don't take yourself seriously from that perspective?"}, {"time": 611, "text": "No, I think that you are neither serious or not serious yourself because you need to become unimportant as a subject."}, {"time": 617, "text": "That is, if you are a philosopher, belief is not a verb."}, {"time": 624, "text": "You don't do this for the audience and you don't do it for yourself."}, {"time": 627, "text": "You have to submit to the things that are possibly true and you have to follow wherever your inquiry leads."}, {"time": 632, "text": "But it's not about you."}, {"time": 632, "text": "It has nothing to do with you."}, {"time": 636, "text": "So do you think then people like Ayn Rand believed sort of an idea of there's objective truth."}, {"time": 642, "text": "So what's your sense in the philosophical, if you remove yourself as objective from the picture, you think it's possible to actually discover ideas that are true or are we just in a mesh of relative concepts that are either true nor false?"}, {"time": 652, "text": "It's just a giant mess."}, {"time": 657, "text": "You cannot define objective truth without understanding the nature of truth in the first place."}, {"time": 662, "text": "So what does the brain mean by saying that discover something as truth?"}, {"time": 662, "text": "So for instance, a model can be predictive or not predictive."}, {"time": 668, "text": "Then there can be a sense in which a mathematical statement can be true because it's defined as true under certain conditions."}, {"time": 674, "text": "So it's basically a particular state that a variable can have in a simple game."}, {"time": 679, "text": "And then you can have a correspondence between systems and talk about truth, which is again, a type of model correspondence."}, {"time": 691, "text": "And there also seems to be a particular kind of ground truth."}, {"time": 691, "text": "So for instance, you're confronted with the enormity of something existing at all."}, {"time": 694, "text": "It's stunning when you realize something exists rather than nothing."}, {"time": 701, "text": "And this seems to be true."}, {"time": 701, "text": "There's an absolute truth in the fact that something seems to be happening."}, {"time": 707, "text": "Yeah, that to me is a showstopper."}, {"time": 707, "text": "I could just think about that idea and be amazed by that idea for the rest of my life and not going any farther because I don't even know the answer to that."}, {"time": 717, "text": "Why does anything exist at all?"}, {"time": 721, "text": "Well, the easiest answer is existence is the default, right?"}, {"time": 721, "text": "So this is the lowest number of bits that you would need to encode this."}, {"time": 724, "text": "Whose answer?"}, {"time": 727, "text": "The simplest answer to this is that existence is the default."}, {"time": 731, "text": "What about nonexistence?"}, {"time": 731, "text": "I mean, that seems... Nonexistence might not be a meaningful notion in this sense."}, {"time": 734, "text": "So in some sense, if everything that can exist exists, for something to exist, it probably needs to be implementable."}, {"time": 743, "text": "The only thing that can be implemented is finite automata."}, {"time": 743, "text": "So maybe the whole of existence is the superposition of all finite automata and we are in some region of the fractal that has the properties that it can contain us."}, {"time": 753, "text": "What does it mean to be a superposition of finite automata?"}, {"time": 760, "text": "Superposition of all possible rules?"}, {"time": 760, "text": "Imagine that every automaton is basically an operator that acts on some substrate and as a result, you get emergent patterns."}, {"time": 770, "text": "What's the substrate?"}, {"time": 772, "text": "I have no idea to know."}, {"time": 772, "text": "But some substrate."}, {"time": 775, "text": "It's something that can store information."}, {"time": 778, "text": "Something that can store information, there's a automaton."}, {"time": 780, "text": "Something that can hold state."}, {"time": 781, "text": "Still, it doesn't make sense to me the why that exists at all."}, {"time": 781, "text": "I could just sit there with a beer or a vodka and just enjoy the fact, pondering the why."}, {"time": 791, "text": "It may not have a why."}, {"time": 791, "text": "This might be the wrong direction to ask into this."}, {"time": 791, "text": "So there could be no relation in the why direction without asking for a purpose or for a cause."}, {"time": 796, "text": "It doesn't mean that everything has to have a purpose or cause."}, {"time": 802, "text": "So we mentioned some philosophers in that early, just taking a brief step back into that."}, {"time": 808, "text": "So we asked ourselves when did classical philosophy end?"}, {"time": 814, "text": "I think for Germany, it largely ended with the first revolution."}, {"time": 818, "text": "That's basically when we entered the monarchy and started a democracy."}, {"time": 818, "text": "And at this point, we basically came up with a new form of government that didn't have a good sense of this new organism that society wanted to be."}, {"time": 830, "text": "And in a way, it decapitated the universities."}, {"time": 836, "text": "So the universities went on through modernism like a headless chicken."}, {"time": 839, "text": "At the same time, democracy failed in Germany and we got fascism as a result."}, {"time": 844, "text": "And it burned down things in a similar way as Stalinism burned down intellectual traditions in Russia."}, {"time": 848, "text": "And Germany, both Germanys have not recovered from this."}, {"time": 848, "text": "Eastern Germany had this vulgar dialectic materialism and Western Germany didn't get much more edgy than Habermas."}, {"time": 854, "text": "So in some sense, both countries lost their intellectual traditions and killing off and driving out the Jews didn't help."}, {"time": 864, "text": "So that was the end of really rigorous what you would say is classical philosophy."}, {"time": 873, "text": "There's also this thing that in some sense, the low hanging foods in philosophy were mostly wrapped."}, {"time": 879, "text": "And the last big things that we discovered was the constructivist turn in mathematics."}, {"time": 886, "text": "So to understand that the parts of mathematics that work are computation, there was a very significant discovery in the first half of the 20th century."}, {"time": 891, "text": "And it hasn't fully permeated philosophy and even physics yet."}, {"time": 897, "text": "Physicists checked out the code libraries for mathematics before constructivism became universal."}, {"time": 902, "text": "What's constructivism?"}, {"time": 913, "text": "Hilbert could get it."}, {"time": 913, "text": "Hilbert saw that, for instance, countries set theoretic experiments and mathematics led into contradictions."}, {"time": 918, "text": "And he noticed that with the current semantics, we cannot build a computer in mathematics that runs mathematics without crashing."}, {"time": 940, "text": "It basically shook his world to the core because in some sense, he felt that the world has to be implemented in classical mathematics."}, {"time": 950, "text": "And for Turing, it wasn't quite so bad."}, {"time": 950, "text": "I think that Turing could see that the solution is to understand that mathematics was computation all along, which means you, for instance, pi in classical mathematics is a value."}, {"time": 961, "text": "It's also a function, but it's the same thing."}, {"time": 961, "text": "And in computation, a function is only a value when you can compute it."}, {"time": 968, "text": "And if you cannot compute the last digit of pi, you only have a function."}, {"time": 973, "text": "You can plug this function into your local sun, let it run until the sun burns out."}, {"time": 978, "text": "This is the last digit of pi you will know."}, {"time": 978, "text": "But it also means there can be no process in the physical universe or in any physically realized computer that depends on having known the last digit of pi."}, {"time": 988, "text": "Which means there are parts of physics that are defined in such a way that cannot strictly be true, because assuming that this could be true leads into contradictions."}, {"time": 998, "text": "So I think putting computation at the center of the world view is actually the right way to think about it."}, {"time": 1004, "text": "And Wittgenstein could see it."}, {"time": 1004, "text": "And Wittgenstein basically preempted the logitist program of AI that Minsky started later, like 30 years later."}, {"time": 1009, "text": "Turing was actually a pupil of Wittgenstein."}, {"time": 1015, "text": "I didn't know there's any connection between Turing and Wittgenstein."}, {"time": 1020, "text": "Wittgenstein even cancelled some classes when Turing was not present because he thought it was not worth spending the time with the others."}, {"time": 1023, "text": "If you read the Tractatus, it's a very beautiful book, like basically one thought on 75 pages."}, {"time": 1029, "text": "It's very non typical for philosophy because it doesn't have arguments in it and it doesn't have references in it."}, {"time": 1035, "text": "It's just one thought that is not intending to convince anybody."}, {"time": 1041, "text": "He says, it's mostly for people that had the same insight as me, just spell it out."}, {"time": 1046, "text": "And this insight is there is a way in which mathematics and philosophy ought to meet."}, {"time": 1052, "text": "Mathematics tries to understand the domain of all languages by starting with those that are so formalizable that you can prove all the properties of the statements that you make."}, {"time": 1062, "text": "But the price that you pay is that your language is very, very simple."}, {"time": 1062, "text": "So it's very hard to say something meaningful in mathematics."}, {"time": 1066, "text": "And it looks complicated to people, but it's far less complicated than what our brain is casually doing all the time when it makes sense of reality."}, {"time": 1072, "text": "And philosophy is coming from the top."}, {"time": 1078, "text": "So it's mostly starting from natural languages with vaguely defined concepts."}, {"time": 1083, "text": "And the hope is that mathematics and philosophy can meet at some point."}, {"time": 1083, "text": "And Wittgenstein was trying to make them meet."}, {"time": 1088, "text": "And he already understood that, for instance, you could express everything with the NAND calculus, that you could reduce the entire logic to NAND gates as we do in our modern computers."}, {"time": 1097, "text": "So in some sense, he already understood Turing universality before Turing spelled it out."}, {"time": 1102, "text": "I think when he wrote the Tractatus, he didn't understand yet that the idea was so important and significant."}, {"time": 1106, "text": "And I suspect then when Turing wrote it out, nobody cared that much."}, {"time": 1106, "text": "Turing was not that famous when he lived."}, {"time": 1112, "text": "It was mostly his work in decrypting the German codes that made him famous or gave him some notoriety."}, {"time": 1119, "text": "But this saint status that he has to computer science right now and the AI is something that I think he could acquire later."}, {"time": 1124, "text": "That's kind of interesting."}, {"time": 1124, "text": "Do you think of computation and computer science?"}, {"time": 1128, "text": "And you kind of represent that to me is maybe that's the modern day."}, {"time": 1133, "text": "You in a sense are the new philosopher by sort of the computer scientist who dares to ask the bigger questions that philosophy originally started is the new philosopher."}, {"time": 1146, "text": "Certainly not me."}, {"time": 1146, "text": "I think I'm mostly still this child that grows up in a very beautiful valley and looks at the world from the outside and tries to understand what's going on."}, {"time": 1156, "text": "And my teachers tell me things and they largely don't make sense."}, {"time": 1156, "text": "So I have to make my own models."}, {"time": 1160, "text": "I have to discover the foundations of what the others are saying."}, {"time": 1160, "text": "I have to try to fix them to be charitable."}, {"time": 1165, "text": "I try to understand what they must have thought originally or what their teachers or their teacher's teachers must have thought until everything got lost in translation and how to make sense of the reality that we are in."}, {"time": 1174, "text": "And whenever I have an original idea, I'm usually late to the party by say 400 years."}, {"time": 1178, "text": "And the only thing that's good is that the parties get smaller and smaller the older I get and the more I explore it."}, {"time": 1183, "text": "The parties get smaller and more exclusive and more exclusive."}, {"time": 1189, "text": "So it seems like one of the key qualities of your upbringing was that you were not tethered, whether it's because of your parents or in general, maybe something within your mind, some genetic material, you were not tethered to the ideas of the general populace, which is actually a unique property."}, {"time": 1207, "text": "We're kind of the education system and whatever, not education system, just existing in this world forces certain sets of ideas onto you."}, {"time": 1220, "text": "Can you disentangle that?"}, {"time": 1220, "text": "Why are you not so tethered?"}, {"time": 1220, "text": "Even in your work today, you seem to not care about perhaps a best paper in Europe, right?"}, {"time": 1228, "text": "Being tethered to particular things that current today in this year, people seem to value as a thing you put on your CV and resume."}, {"time": 1244, "text": "You're a little bit more outside of that world, outside of the world of ideas that people are especially focused in the benchmarks of today, the things."}, {"time": 1256, "text": "Because I think that's inspiring."}, {"time": 1256, "text": "And if there were more people like that, we might be able to solve some of the bigger problems that AI dreams to solve."}, {"time": 1265, "text": "And there's a big danger in this because in a way you are expected to marry into an intellectual tradition and visit this tradition into a particular school."}, {"time": 1270, "text": "If everybody comes up with their own paradigms, the whole thing is not cumulative as an enterprise."}, {"time": 1276, "text": "So in some sense, you need a healthy balance."}, {"time": 1282, "text": "You need paradigmatic thinkers and you need people that work within given paradigms."}, {"time": 1286, "text": "Basically, scientists today define themselves largely by methods."}, {"time": 1286, "text": "And it's almost a disease that we think as a scientist, as somebody who was convinced by their guidance counselor, that they should join a particular discipline and then they find a good mentor to learn the right methods."}, {"time": 1302, "text": "And then they are lucky enough and privileged enough to join the right team."}, {"time": 1302, "text": "And then their name will show up on influential papers."}, {"time": 1307, "text": "But we also see that there are diminishing returns with this approach."}, {"time": 1312, "text": "And when our field, computer science and AI started, most of the people that joined this field had interesting opinions."}, {"time": 1319, "text": "And today's thinkers in AI either don't have interesting opinions at all, or these opinions are inconsequential for what they're actually doing."}, {"time": 1328, "text": "Because what they're doing is they apply the state of the art methods with a small epsilon."}, {"time": 1333, "text": "And this is often a good idea if you think that this is the best way to make progress."}, {"time": 1333, "text": "And for me, it's first of all, very boring."}, {"time": 1341, "text": "If somebody else can do it, why should I do it?"}, {"time": 1341, "text": "If the current methods of machine learning lead to strong AI, why should I be doing it?"}, {"time": 1347, "text": "I will just wait until they're done and wait until they do this on the beach or read interesting books or write some and have fun."}, {"time": 1358, "text": "But if you don't think that we are currently doing the right thing, if we are missing some perspectives, then it's required to think outside of the box."}, {"time": 1365, "text": "It's also required to understand the boxes."}, {"time": 1371, "text": "But it's necessary to understand what worked and what didn't work and for what reasons."}, {"time": 1379, "text": "So you have to be willing to ask new questions and design new methods whenever you want to answer them."}, {"time": 1383, "text": "And you have to be willing to dismiss the existing methods if you think that they're not going to yield the right answers."}, {"time": 1389, "text": "It's very bad career advice to do that."}, {"time": 1389, "text": "So maybe to briefly stay for one more time in the early days, when would you say for you was the dream before we dive into the discussions that we just almost started, when was the dream to understand or maybe to create human level intelligence born for you?"}, {"time": 1415, "text": "I think that you can see AI largely today as advanced information processing."}, {"time": 1415, "text": "If you would change the acronym of AI into that, most people in the field would be happy."}, {"time": 1424, "text": "It would not change anything what they're doing."}, {"time": 1428, "text": "We're automating statistics and many of the statistical models are more advanced than what statisticians had in the past."}, {"time": 1434, "text": "And it's pretty good work."}, {"time": 1434, "text": "It's very productive."}, {"time": 1439, "text": "And the other aspect of AI is philosophical project."}, {"time": 1439, "text": "And this philosophical project is very risky and very few people work on it and it's not clear if it succeeds."}, {"time": 1450, "text": "So first of all, you keep throwing sort of a lot of really interesting ideas and I have to pick which ones we go with."}, {"time": 1456, "text": "But first of all, you use the term information processing, just information processing as if it's the mere, it's the muck of existence as if it's the epitome of existence, that the entirety of the universe might be information processing, that consciousness and intelligence might be information processing."}, {"time": 1476, "text": "So that maybe you can comment on if the advanced information processing is a limiting kind of a round of ideas."}, {"time": 1482, "text": "And then the other one is, what do you mean by the philosophical project?"}, {"time": 1488, "text": "So I suspect that general intelligence is the result of trying to solve general problems."}, {"time": 1494, "text": "So intelligence, I think, is the ability to model."}, {"time": 1500, "text": "It's not necessarily goal directed rationality or something."}, {"time": 1500, "text": "Many intelligent people are bad at this, but it's the ability to be presented with a number of patterns and see a structure in those patterns and be able to predict the next set of patterns, to make sense of things."}, {"time": 1512, "text": "And some problems are very general."}, {"time": 1517, "text": "Usually intelligence serves control, so you make these models for a particular purpose of interacting as an agent with the world and getting certain results."}, {"time": 1526, "text": "But the intelligence itself is in the sense instrumental to something, but by itself it's just the ability to make models."}, {"time": 1531, "text": "And some of the problems are so general that the system that makes them needs to understand what itself is and how it relates to the environment."}, {"time": 1536, "text": "So as a child, for instance, you notice you do certain things despite you perceiving yourself as wanting different things."}, {"time": 1547, "text": "So you become aware of your own psychology."}, {"time": 1547, "text": "You become aware of the fact that you have complex structure in yourself and you need to model yourself, to reverse engineer yourself, to be able to predict how you will react to certain situations and how you deal with yourself in relationship to your environment."}, {"time": 1562, "text": "And this process, this project, if you reverse engineer yourself and your relationship to reality and the nature of a universe that can continue, if you go all the way, this is basically the project of AI, or you could say the project of AI is a very important component in it."}, {"time": 1577, "text": "The Turing test, in a way, is you ask a system, what is intelligence?"}, {"time": 1584, "text": "If that system is able to explain what it is, how it works, then you should assign it the property of being intelligent in this general sense."}, {"time": 1592, "text": "So the test that Turing was administering in a way, I don't think that he couldn't see it, but he didn't express it yet in the original 1950 paper, is that he was trying to find out whether he was generally intelligent."}, {"time": 1601, "text": "Because in order to take this test, the rub is, of course, you need to be able to understand what that system is saying."}, {"time": 1611, "text": "And we don't yet know if we can build an AI."}, {"time": 1611, "text": "We don't yet know if we are generally intelligent."}, {"time": 1616, "text": "Basically, you win the Turing test by building an AI."}, {"time": 1616, "text": "So in a sense, hidden within the Turing test is a kind of recursive test."}, {"time": 1623, "text": "Yes, it's a test on us."}, {"time": 1623, "text": "The Turing test is basically a test of the conjecture, whether people are intelligent enough to understand themselves."}, {"time": 1634, "text": "But you also mentioned a little bit of a self awareness and then the project of AI."}, {"time": 1638, "text": "Do you think this kind of emergent self awareness is one of the fundamental aspects of intelligence?"}, {"time": 1645, "text": "So as opposed to goal oriented, as you said, kind of puzzle solving, is coming to grips with the idea that you're an agent in the world."}, {"time": 1657, "text": "I find that many highly intelligent people are not very self aware, right?"}, {"time": 1657, "text": "So self awareness and intelligence are not the same thing."}, {"time": 1662, "text": "And you can also be self aware if you have good priors, especially, without being especially intelligent."}, {"time": 1667, "text": "So you don't need to be very good at solving puzzles if the system that you are already implements the solution."}, {"time": 1676, "text": "But I do find intelligence, you kind of mentioned children, right?"}, {"time": 1676, "text": "Is that the fundamental project of AI is to create the learning system that's able to exist in the world."}, {"time": 1683, "text": "So you kind of drew a difference between self awareness and intelligence."}, {"time": 1691, "text": "And yet you said that the self awareness seems to be important for children."}, {"time": 1698, "text": "So I call this ability to make sense of the world and your own place in it."}, {"time": 1703, "text": "So to make you able to understand what you're doing in this world, sentience."}, {"time": 1708, "text": "And I would distinguish sentience from intelligence because sentience is possessing certain classes of models."}, {"time": 1714, "text": "And intelligence is a way to get to these models if you don't already have them."}, {"time": 1719, "text": "So can you maybe pause a bit and try to answer the question that we just said we may not be able to answer?"}, {"time": 1727, "text": "And it might be a recursive meta question of what is intelligence?"}, {"time": 1733, "text": "I think that intelligence is the ability to make models."}, {"time": 1739, "text": "So models."}, {"time": 1739, "text": "I think it's useful as examples."}, {"time": 1739, "text": "Very popular now."}, {"time": 1739, "text": "Neural networks form representations of a large scale data set."}, {"time": 1748, "text": "They form models of those data sets."}, {"time": 1748, "text": "When you say models and look at today's neural networks, what are the difference of how you're thinking about what is intelligent in saying that intelligence is the process of making models?"}, {"time": 1762, "text": "Two aspects to this question."}, {"time": 1762, "text": "One is the representation."}, {"time": 1769, "text": "Is the representation adequate for the domain that we're talking about?"}, {"time": 1773, "text": "Is the representation adequate for the domain that we want to represent?"}, {"time": 1779, "text": "The other one is the type of the model that you arrive at adequate."}, {"time": 1779, "text": "So basically, are you modeling the correct domain?"}, {"time": 1785, "text": "I think in both of these cases, modern AI is lacking still."}, {"time": 1785, "text": "I think that I'm not saying anything new here."}, {"time": 1793, "text": "I'm not criticizing the field."}, {"time": 1793, "text": "Most of the people that design our paradigms are aware of that."}, {"time": 1798, "text": "One aspect that we're missing is unified learning."}, {"time": 1805, "text": "When we learn, we at some point discover that everything that we sense is part of the same object, which means we learn it all into one model and we call this model the universe."}, {"time": 1814, "text": "So the experience of the world that we are embedded on is not a secret direct via to physical reality."}, {"time": 1819, "text": "Physical reality is a weird quantum graph that we can never experience or get access to."}, {"time": 1824, "text": "But it has these properties that it can create certain patterns that are systemic interface to the world."}, {"time": 1829, "text": "And we make sense of these patterns and the relationship between the patterns that we discover is what we call the physical universe."}, {"time": 1833, "text": "So at some point in our development as a nervous system, we discover that everything that we relate to in the world can be mapped to a region in the same three dimensional space, by and large."}, {"time": 1847, "text": "We now know in physics that this is not quite true."}, {"time": 1852, "text": "The world is not actually three dimensional, but the world that we are entangled with at the level which we are entangled with is largely a flat three dimensional space."}, {"time": 1856, "text": "And so this is the model that our brain is intuitively making."}, {"time": 1862, "text": "And this is, I think, what gave rise to this intuition of res extensa of this material world, this material domain."}, {"time": 1867, "text": "It's one of the mental domains, but it's just the class of all models that relate to this environment, this three dimensional physics engine in which we are embedded."}, {"time": 1877, "text": "Physics engine which we're embedded."}, {"time": 1877, "text": "Just slowly pause."}, {"time": 1882, "text": "So the quantum graph, I think you called it, which is the real world, which you can never get access to, there's a bunch of questions I want to sort of disentangle that."}, {"time": 1897, "text": "But maybe one useful one, one of your recent talks I looked at, can you just describe the basics?"}, {"time": 1903, "text": "Can you talk about what is dualism?"}, {"time": 1903, "text": "What is idealism?"}, {"time": 1903, "text": "What is materialism?"}, {"time": 1903, "text": "What is functionalism?"}, {"time": 1909, "text": "And what connects with you most in terms of, because you just mentioned there's a reality we don't have access to."}, {"time": 1913, "text": "What does that even mean?"}, {"time": 1913, "text": "And why don't we get access to it?"}, {"time": 1920, "text": "Aren't we part of that reality?"}, {"time": 1920, "text": "Why can't we access it?"}, {"time": 1920, "text": "So the particular trajectory that mostly exists in the West is the result of our indoctrination by a cult for 2000 years."}, {"time": 1931, "text": "A cult?"}, {"time": 1931, "text": "Oh, 2000 years."}, {"time": 1931, "text": "The Catholic cult mostly."}, {"time": 1931, "text": "And for better or worse, it has created or defined many of the modes of interaction that we have that has created the society."}, {"time": 1940, "text": "But it has also in some sense scarred our rationality."}, {"time": 1940, "text": "And the intuition that exists, if you would translate the mythology of the Catholic church into the modern world is that the world in which you and me interact is something like a multiplayer role playing adventure."}, {"time": 1955, "text": "And the money and the objects that we have in this world, this is all not real."}, {"time": 1961, "text": "Or as Eastern philosophers would say, it's Maya."}, {"time": 1968, "text": "It's just stuff that appears to be meaningful."}, {"time": 1968, "text": "And this embedding in this meaning, if you believe in it, is samsara."}, {"time": 1974, "text": "It's basically the identification with the needs of the mundane, secular, everyday existence."}, {"time": 1980, "text": "And the Catholics also introduced the notion of higher meaning, the sacred."}, {"time": 1986, "text": "And this existed before, but eventually the natural shape of God is the Platonic form of the civilization that you're part of."}, {"time": 1992, "text": "It's basically the superorganism that is formed by the individuals as an intentional agent."}, {"time": 1997, "text": "And basically, the Catholics used a relatively crude mythology to implement software on the minds of people and get the software synchronized to make them walk on lockstep, to basically get this God online and to make it efficient and effective."}, {"time": 2014, "text": "And I think God technically is just a self that spends multiple brains as opposed to your and my self, which mostly exists just on one brain."}, {"time": 2025, "text": "And so in some sense, you can construct a self functionally as a function is implemented by brains that exists across brains."}, {"time": 2030, "text": "And this is a God with a small g. That's one of the, if you, Yuval Harari kind of talking about, this is one of the nice features of our brains."}, {"time": 2039, "text": "It seems to that we can all download the same piece of software like God in this case and kind of share it."}, {"time": 2047, "text": "So basically you give everybody a spec and the mathematical constraints that are intrinsic to information processing, make sure that given the same spec, you come up with a compatible structure."}, {"time": 2060, "text": "So that's, there's the space of ideas that we all share."}, {"time": 2060, "text": "And we think that's kind of the mind, but that's separate from the idea is from Christianity for, from religion is that there's a separate thing between the mind."}, {"time": 2075, "text": "There is a real world."}, {"time": 2075, "text": "And this real world is the world in which God exists."}, {"time": 2079, "text": "God is the coder of the multiplayer adventure, so to speak."}, {"time": 2079, "text": "And we are all players in this game."}, {"time": 2085, "text": "And that's dualism."}, {"time": 2087, "text": "But the aspect is because the mental realm exists in a different implementation than the physical realm."}, {"time": 2093, "text": "And the mental realm is real."}, {"time": 2093, "text": "And a lot of people have this intuition that there is this real room in which you and me talk and speak right now, then comes a layer of physics and abstract rules and so on."}, {"time": 2104, "text": "And then comes another real room where our souls are and our true form isn't a thing that gives us phenomenal experience."}, {"time": 2110, "text": "And this is, of course, a very confused notion that you would get."}, {"time": 2114, "text": "And it's basically, it's the result of connecting materialism and idealism in the wrong way."}, {"time": 2124, "text": "I apologize, but I think it's really helpful if we just try to define, try to define terms."}, {"time": 2130, "text": "Like what is dualism?"}, {"time": 2130, "text": "For people that don't know."}, {"time": 2134, "text": "So the idea of dualism in our cultural tradition is that there are two substances, a mental substance and a physical substance."}, {"time": 2140, "text": "And they interact by different rules."}, {"time": 2140, "text": "And the physical world is basically causally closed and is built on a low level causal structure."}, {"time": 2146, "text": "So they're basically a bottom level that is causally closed."}, {"time": 2151, "text": "That's entirely mechanical and mechanical in the widest sense."}, {"time": 2156, "text": "So it's computational."}, {"time": 2156, "text": "There's basically a physical world in which information flows around and physics describes the laws of how information flows around in this world."}, {"time": 2166, "text": "Would you compare it to like a computer where you have hardware and software?"}, {"time": 2170, "text": "The computer is a generalization of information flowing around."}, {"time": 2170, "text": "Basically, but if you want to discover that there is a universal principle, you can define this universal machine that is able to perform all the computations."}, {"time": 2177, "text": "So all these machines have the same power."}, {"time": 2183, "text": "This means that you can always define a translation between them, as long as they have unlimited memory to be able to perform each other's computations."}, {"time": 2193, "text": "So would you then say that materialism is this whole world is just the hardware and idealism is this whole world is just the software?"}, {"time": 2200, "text": "I think that most idealists don't have a notion of software yet because software also comes down to information processing."}, {"time": 2206, "text": "So what you notice is the only thing that is real to you and me is this experiential world in which things matter, in which things have taste, in which things have color, phenomenal content, and so on."}, {"time": 2220, "text": "You are bringing up consciousness."}, {"time": 2222, "text": "This is distinct from the physical world in which things have values only in an abstract sense."}, {"time": 2227, "text": "And you only look at cold patterns moving around."}, {"time": 2227, "text": "So how does anything feel like something?"}, {"time": 2235, "text": "And this connection between the two things is very puzzling to a lot of people, of course, too many philosophers."}, {"time": 2239, "text": "So idealism starts out with the notion that mind is primary, materialism, things that matter is primary."}, {"time": 2243, "text": "And so for the idealist, the material patterns that we see playing out are part of the dream that the mind is dreaming."}, {"time": 2250, "text": "And we exist in a mind on a higher plane of existence, if you want."}, {"time": 2257, "text": "And for the materialist, there is only this material thing, and that generates some models, and we are the result of these models."}, {"time": 2263, "text": "And in some sense, I don't think that we should understand, if we understand it properly, materialism and idealism as a dichotomy, but as two different aspects of the same thing."}, {"time": 2279, "text": "So the weird thing is we don't exist in the physical world."}, {"time": 2279, "text": "We do exist inside of a story that the brain tells itself."}, {"time": 2284, "text": "Let my information processing take that in."}, {"time": 2295, "text": "We don't exist in the physical world."}, {"time": 2295, "text": "We exist in the narrative."}, {"time": 2298, "text": "Basically, a brain cannot feel anything."}, {"time": 2298, "text": "A neuron cannot feel anything."}, {"time": 2298, "text": "They're physical things."}, {"time": 2302, "text": "Physical systems are unable to experience anything."}, {"time": 2302, "text": "But it would be very useful for the brain or for the organism to know what it would be like to be a person and to feel something."}, {"time": 2310, "text": "So the brain creates a simulacrum of such a person that it uses to model the interactions of the person."}, {"time": 2316, "text": "It's the best model of what that brain, this organism thinks it is in relationship to its environment."}, {"time": 2321, "text": "So it creates that model."}, {"time": 2321, "text": "It's a story, a multimedia novel that the brain is continuously writing and updating."}, {"time": 2326, "text": "But you also kind of said that you said that we kind of exist in that story."}, {"time": 2333, "text": "In that story."}, {"time": 2333, "text": "What is real in any of this?"}, {"time": 2333, "text": "So again, these terms are... You kind of said there's a quantum graph."}, {"time": 2344, "text": "I mean, what is this whole thing running on then?"}, {"time": 2344, "text": "Is the story... And is it completely fundamentally impossible to get access to it?"}, {"time": 2351, "text": "Because isn't the story supposed to..."}, {"time": 2356, "text": "Isn't the brain in something existing in some kind of context?"}, {"time": 2364, "text": "So what we can identify as computer scientists, we can engineer systems and test our theories this way that might have the necessary insufficient properties to produce the phenomena that we are observing, which is the self in a virtual world that is generated in somebody's neocortex that is contained in the skull of this primate here."}, {"time": 2384, "text": "And when I point at this, this indexicality is of course wrong."}, {"time": 2388, "text": "But I do create something that is likely to give rise to patterns on your retina that allow you to interpret what I'm saying."}, {"time": 2395, "text": "But we both know that the world that you and me are seeing is not the real physical world."}, {"time": 2400, "text": "What we are seeing is a virtual reality generated in your brain to explain the patterns on your retina."}, {"time": 2405, "text": "How close is it to the real world?"}, {"time": 2405, "text": "That's kind of the question."}, {"time": 2410, "text": "Is it when you have people like Donald Hoffman that say that you're really far away."}, {"time": 2418, "text": "The thing we're seeing, you and I now, that interface we have is very far away from anything."}, {"time": 2424, "text": "We don't even have anything close to the sense of what the real world is."}, {"time": 2424, "text": "Or is it a very surface piece of architecture?"}, {"time": 2429, "text": "I imagine you look at the Mandelbrot fractal, this famous thing that Bernard Mandelbrot discovered."}, {"time": 2435, "text": "You see an overall shape in there."}, {"time": 2435, "text": "But if you truly understand it, you know it's two lines of code."}, {"time": 2443, "text": "It's basically in a series that is being tested for complex numbers in the complex number plane for every point."}, {"time": 2450, "text": "And for those where the series is diverging, you paint this black."}, {"time": 2456, "text": "And where it's converging, you don't."}, {"time": 2456, "text": "And you get the intermediate colors by taking how far it diverges."}, {"time": 2464, "text": "This gives you this shape of this fractal."}, {"time": 2464, "text": "But imagine you live inside of this fractal and you don't have access to where you are in the fractal."}, {"time": 2473, "text": "Or you have not discovered the generator function even."}, {"time": 2478, "text": "So what you see is, all I can see right now is a spiral."}, {"time": 2483, "text": "And this spiral moves a little bit to the right."}, {"time": 2483, "text": "Is this an accurate model of reality?"}, {"time": 2488, "text": "It is an adequate description."}, {"time": 2488, "text": "You know that there is actually no spiral in the Mandelbrot fractal."}, {"time": 2493, "text": "It only appears like this to an observer that is interpreting things as a two dimensional space and then defines certain regularities in there at a certain scale that it currently observes."}, {"time": 2499, "text": "Because if you zoom in, the spiral might disappear and turn out to be something different at a different resolution."}, {"time": 2507, "text": "So at this level, you have the spiral."}, {"time": 2507, "text": "And then you discover the spiral moves to the right and at some point it disappears."}, {"time": 2512, "text": "So you have a singularity."}, {"time": 2512, "text": "At this point, your model is no longer valid."}, {"time": 2516, "text": "You cannot predict what happens beyond the singularity."}, {"time": 2516, "text": "But you can observe again and you will see it hit another spiral and at this point it disappeared."}, {"time": 2521, "text": "So we now have a second order law."}, {"time": 2526, "text": "And if you make 30 layers of these laws, then you have a description of the world that is similar to the one that we come up with when we describe the reality around us."}, {"time": 2534, "text": "It's reasonably predictive."}, {"time": 2534, "text": "It does not cut to the core of it."}, {"time": 2534, "text": "It does not explain how it's being generated, how it actually works."}, {"time": 2539, "text": "But it's relatively good to explain the universe that we are entangled with."}, {"time": 2544, "text": "But you don't think the tools of computer science, the tools of physics could get, could step outside, see the whole drawing and get at the basic mechanism of how the pattern, the spirals are generated."}, {"time": 2555, "text": "Imagine you would find yourself embedded into a motherboard fractal and you try to figure out what works and you somehow have a Turing machine with enough memory to think."}, {"time": 2566, "text": "And as a result, you come to this idea, it must be some kind of automaton."}, {"time": 2566, "text": "And maybe you just enumerate all the possible automata until you get to the one that produces your reality."}, {"time": 2576, "text": "So you can identify necessary and sufficient condition."}, {"time": 2576, "text": "For instance, we discover that mathematics itself is the domain of all languages."}, {"time": 2579, "text": "And then we see that most of the domains of mathematics that we have discovered are in some sense describing the same fractals."}, {"time": 2590, "text": "This is what category theory is obsessed about, that you can map these different domains to each other."}, {"time": 2594, "text": "So they're not that many fractals."}, {"time": 2594, "text": "And some of these have interesting structure and symmetry breaks."}, {"time": 2599, "text": "And so you can discover what region of this global fractal you might be embedded in from first principles."}, {"time": 2606, "text": "But the only way you can get there is from first principles."}, {"time": 2606, "text": "So basically your understanding of the universe has to start with automata and then number theory and then spaces and so on."}, {"time": 2615, "text": "I think like Stephen Wolfram still dreams that he'll be able to arrive at the fundamental rules of the cellular automata or the generalization of which is behind our universe."}, {"time": 2626, "text": "You've said on this topic, you said in a recent conversation that quote, some people think that a simulation can't be conscious and only a physical system can, but they got it completely backward."}, {"time": 2640, "text": "A physical system cannot be conscious."}, {"time": 2640, "text": "Only a simulation can be conscious."}, {"time": 2645, "text": "Consciousness is a simulated property that simulates itself."}, {"time": 2645, "text": "Just like you said, the mind is kind of the, we'll call it story narrative."}, {"time": 2651, "text": "There's a simulation."}, {"time": 2651, "text": "So our mind is essentially a simulation."}, {"time": 2657, "text": "Usually I try to use the terminology so that the mind is basically a principles that produce the simulation."}, {"time": 2664, "text": "It's the software that is implemented by your brain."}, {"time": 2669, "text": "And the mind is creating both the universe that we are in and the self, the idea of a person that is on the other side of attention and is embedded in this world."}, {"time": 2676, "text": "Why is that important that idea of a self, why is that an important feature in the simulation?"}, {"time": 2681, "text": "It's basically a result of the purpose that the mind has."}, {"time": 2688, "text": "It's a tool for modeling, right?"}, {"time": 2688, "text": "We are not actually monkeys."}, {"time": 2688, "text": "We are side effects of the regulation needs of monkeys."}, {"time": 2693, "text": "And what the monkey has to regulate is the relationship of an organism to an outside world that is in large part also consisting of other organisms."}, {"time": 2706, "text": "And as a result, it basically has regulation targets that it tries to get to."}, {"time": 2712, "text": "These regulation targets start with priors."}, {"time": 2712, "text": "They're basically like unconditional reflexes that we are more or less born with."}, {"time": 2716, "text": "And then we can reverse engineer them to make them more consistent."}, {"time": 2720, "text": "And then we get more detailed models about how the world works and how to interact with it."}, {"time": 2724, "text": "And so these priors that you commit to are largely target values that our needs should approach set points."}, {"time": 2731, "text": "And this deviation to the set point creates some urge, some tension."}, {"time": 2731, "text": "And we find ourselves living inside of feedback loops, right?"}, {"time": 2738, "text": "Consciousness emerges over dimensions of disagreements with the universe, things that you care, things are not the way they should be, but you need to regulate."}, {"time": 2748, "text": "And so in some sense, the sense self is the result of all the identifications that you're having."}, {"time": 2752, "text": "And that identification is a regulation target that you're committing to."}, {"time": 2756, "text": "It's a dimension that you care about, you think is important."}, {"time": 2756, "text": "And this is also what locks you in."}, {"time": 2761, "text": "If you let go of these commitments, of these identifications, you get free."}, {"time": 2767, "text": "There's nothing that you have to do anymore."}, {"time": 2767, "text": "And if you let go of all of them, you're completely free and you can enter nirvana because you're done."}, {"time": 2777, "text": "I wanted to give him a shout out."}, {"time": 2783, "text": "He's a brilliant guy."}, {"time": 2783, "text": "And I think the AI community is actually quite amazing."}, {"time": 2783, "text": "And Gustav is a good representative of that."}, {"time": 2789, "text": "You are as well."}, {"time": 2789, "text": "So I'm glad, first of all, I'm glad the internet exists, YouTube exists, where I can watch your talks and then get to your book and study your writing and think about, you know, that's amazing."}, {"time": 2800, "text": "But you've kind of described sort of this emergent phenomenon of consciousness from the simulation."}, {"time": 2806, "text": "So what about the hard problem of consciousness?"}, {"time": 2812, "text": "Can you just linger on it?"}, {"time": 2812, "text": "Why does it still feel like, I understand you're kind of, the self is an important part of the simulation, but why does the simulation feel like something?"}, {"time": 2828, "text": "So if you look at a book by, say, George R. R. Martin, where the characters have plausible psychology and they stand on a hill because they want to conquer the city below the hill and they're done in it."}, {"time": 2839, "text": "And they look at the color of the sky and they are apprehensive and feel empowered and all these things."}, {"time": 2844, "text": "Why do they have these emotions?"}, {"time": 2844, "text": "It's because it's written into the story, right?"}, {"time": 2847, "text": "And it's written to the story because there's an adequate model of the person that predicts what they're going to do next."}, {"time": 2852, "text": "And the same thing is true for us."}, {"time": 2852, "text": "So it's basically a story that our brain is writing."}, {"time": 2857, "text": "It's not written in words."}, {"time": 2857, "text": "It's written in perceptual content, basically multimedia content."}, {"time": 2863, "text": "And it's a model of what the person would feel if it existed."}, {"time": 2870, "text": "So it's a virtual person."}, {"time": 2870, "text": "And you and me happen to be this virtual person."}, {"time": 2870, "text": "So this virtual person gets access to the language center and talks about the sky being blue."}, {"time": 2876, "text": "And this is us."}, {"time": 2881, "text": "But hold on a second."}, {"time": 2881, "text": "Do I exist in your simulation?"}, {"time": 2885, "text": "You do exist in an almost similar way as me."}, {"time": 2885, "text": "So there are internal states that are less accessible for me that you have and so on."}, {"time": 2893, "text": "And my model might not be completely adequate."}, {"time": 2900, "text": "There are also things that I might perceive about you that you don't perceive."}, {"time": 2900, "text": "But in some sense, both you and me are some puppets, two puppets that enact a play in my mind."}, {"time": 2905, "text": "And I identify with one of them because I can control one of the puppets directly."}, {"time": 2911, "text": "And with the other one, I can create things in between."}, {"time": 2916, "text": "So for instance, we can go on an interaction that even leads to a coupling to a feedback loop."}, {"time": 2921, "text": "So we can think things together in a certain way or feel things together."}, {"time": 2926, "text": "But this coupling is itself not a physical phenomenon."}, {"time": 2926, "text": "It's entirely a software phenomenon."}, {"time": 2930, "text": "It's the result of two different implementations interacting with each other."}, {"time": 2934, "text": "So are you suggesting, like the way you think about it, is the entirety of existence a simulation and where kind of each mind is a little subsimulation, that like, why don't you, why doesn't your mind have access to my mind's full state?"}, {"time": 2958, "text": "Like, for the same reason that my mind doesn't have access to its own full state."}, {"time": 2962, "text": "So what, I mean, There is no trick involved."}, {"time": 2965, "text": "So basically, when I know something about myself, it's because I made a model."}, {"time": 2969, "text": "So one part of your brain is tasked with modeling what other parts of your brain are doing."}, {"time": 2975, "text": "But there seems to be an incredible consistency about this world in the physical sense that there's repeatable experiments and so on."}, {"time": 2980, "text": "How does that fit into our silly, the center of apes simulation of the world?"}, {"time": 2986, "text": "So why is it so repeatable?"}, {"time": 2986, "text": "Why is everything so repeatable?"}, {"time": 2990, "text": "And not everything."}, {"time": 2990, "text": "There's a lot of fundamental physics experiments that are repeatable for a long time, all over the place and so on."}, {"time": 2999, "text": "Laws of physics."}, {"time": 2999, "text": "How does that fit in?"}, {"time": 3005, "text": "It seems that the parts of the world that are not deterministic are not long lived."}, {"time": 3010, "text": "So if you build a system, any kind of automaton, so if you build simulations of something, you'll notice that the phenomena that endure are those that give rise to stable dynamics."}, {"time": 3023, "text": "So basically, if you see anything that is complex in the world, it's the result of usually of some control of some feedback that keeps it stable around certain attractors."}, {"time": 3028, "text": "And the things that are not stable that don't give rise to certain harmonic patterns and so on, they tend to get weeded out over time."}, {"time": 3037, "text": "So if we are in a region of the universe that sustains complexity, which is required to implement minds like ours, this is going to be a region of the universe that is very tightly controlled and controllable."}, {"time": 3050, "text": "So it's going to have lots of interesting symmetries and also symmetry breaks that allow the creation of structure."}, {"time": 3055, "text": "But they exist where?"}, {"time": 3055, "text": "So there's such an interesting idea that our mind is simulation that's constructing the narrative."}, {"time": 3066, "text": "But my question is, just to try to understand how that fits with this, with the entirety of the universe, you're saying that there's a region of this universe that allows enough complexity to create creatures like us."}, {"time": 3079, "text": "But what's the connection between the brain, the mind, and the broader universe?"}, {"time": 3087, "text": "Which comes first?"}, {"time": 3087, "text": "Which is more fundamental?"}, {"time": 3087, "text": "Is the mind the starting point, the universe is emergent?"}, {"time": 3092, "text": "Is the universe the starting point, the minds are emergent?"}, {"time": 3097, "text": "I think quite clearly the latter."}, {"time": 3097, "text": "That's at least a much easier explanation because it allows us to make causal models."}, {"time": 3102, "text": "And I don't see any way to construct an inverse causality."}, {"time": 3107, "text": "So what happens when you die to your mind simulation?"}, {"time": 3111, "text": "My implementation ceases."}, {"time": 3111, "text": "So basically the thing that implements myself will no longer be present, which means if I am not implemented on the minds of other people, the thing that I identify with, the weird thing is I don't actually have an identity beyond the identity that I construct."}, {"time": 3127, "text": "If I was the Dalai Lama, he identifies as a form of government."}, {"time": 3127, "text": "So basically the Dalai Lama gets reborn, not because he's confused, but because he is not identifying as a human being."}, {"time": 3134, "text": "He runs on a human being."}, {"time": 3141, "text": "He's basically a governmental software that is instantiated in every new generation and you."}, {"time": 3147, "text": "So his advice is to pick someone who does this in the next generation."}, {"time": 3151, "text": "So if you identify with this, you are no longer a human and you don't die in the sense that what dies is only the body of the human that you run on."}, {"time": 3157, "text": "To kill the Dalai Lama, you would have to kill his tradition."}, {"time": 3162, "text": "And if we look at ourselves, we realize that we are to a small part like this, most of us."}, {"time": 3168, "text": "So for instance, if you have children, you realize something lives on in them."}, {"time": 3168, "text": "Or if you spark an idea in the world, something lives on, or if you identify with the society around you, because you are in part that you're not just this human being."}, {"time": 3181, "text": "So in a sense, you are kind of like a Dalai Lama in the sense that you, Joshua Bach, is just a collection of ideas."}, {"time": 3187, "text": "So like you have this operating system on which a bunch of ideas live and interact."}, {"time": 3192, "text": "And then once you die, they kind of part, some of them jump off the ship."}, {"time": 3198, "text": "You put it put it the other way."}, {"time": 3198, "text": "Identity is a software state."}, {"time": 3198, "text": "It's a construction."}, {"time": 3203, "text": "It's not physically real."}, {"time": 3203, "text": "Identity is not a physical concept."}, {"time": 3207, "text": "It's basically a representation of different objects on the same world line."}, {"time": 3212, "text": "But identity lives and dies."}, {"time": 3212, "text": "Are you attached?"}, {"time": 3212, "text": "What's the fundamental thing?"}, {"time": 3212, "text": "Is it the ideas that come together to form identity?"}, {"time": 3221, "text": "Or is each individual identity actually a fundamental thing?"}, {"time": 3226, "text": "It's a representation that you can get agency over if you care."}, {"time": 3226, "text": "So basically, you can choose what you identify with if you want to."}, {"time": 3233, "text": "No, but it just seems if the mind is not real, that the birth and death is not a crucial part of it."}, {"time": 3244, "text": "Well, maybe I'm silly."}, {"time": 3244, "text": "Maybe I'm attached to this whole biological organism."}, {"time": 3244, "text": "But it seems that being a physical object in this world is an important aspect of birth and death."}, {"time": 3263, "text": "Like it feels like it has to be physical to die."}, {"time": 3263, "text": "It feels like simulations don't have to die."}, {"time": 3270, "text": "The physics that we experience is not the real physics."}, {"time": 3270, "text": "There is no color and sound in the real world."}, {"time": 3274, "text": "Color and sound are types of representations that you get if you want to model reality with oscillators."}, {"time": 3280, "text": "So colors and sound in some sense have octaves, and it's because they are represented probably with oscillators."}, {"time": 3285, "text": "So that's why colors form a circle of use."}, {"time": 3285, "text": "And colors have harmonics, sounds have harmonics as a result of synchronizing oscillators in the brain."}, {"time": 3292, "text": "So the world that we subjectively interact with is fundamentally the result of the representation mechanisms in our brain."}, {"time": 3303, "text": "They are mathematically to some degree universal."}, {"time": 3303, "text": "There are certain regularities that you can discover in the patterns and not others."}, {"time": 3308, "text": "But the patterns that we get, this is not the real world."}, {"time": 3312, "text": "The world that we interact with is always made of too many parts to count."}, {"time": 3312, "text": "So when you look at this table and so on, it's consisting of so many molecules and atoms that you cannot count them."}, {"time": 3323, "text": "So you only look at the aggregate dynamics, at limit dynamics."}, {"time": 3323, "text": "If you had almost infinitely many particles, what would be the dynamics of the table?"}, {"time": 3329, "text": "And this is roughly what you get."}, {"time": 3329, "text": "So geometry that we are interacting with is the result of discovering those operators that work in the limit that you get by building an infinite series that converges."}, {"time": 3339, "text": "For those parts where it converges, it's geometry."}, {"time": 3344, "text": "For those parts where it doesn't converge, it's chaos."}, {"time": 3348, "text": "And then so all of that is filtered through the consciousness that's emergent in our narrative."}, {"time": 3355, "text": "The consciousness gives it color, gives it feeling, gives it flavor."}, {"time": 3360, "text": "So I think the feeling, flavor and so on is given by the relationship that a feature has to all the other features."}, {"time": 3366, "text": "It's basically a giant relational graph that is our subjective universe."}, {"time": 3366, "text": "The color is given by those aspects of the representation or this experiential color where you care about, where you have identifications, where something means something, where you are the inside of a feedback loop."}, {"time": 3382, "text": "And the dimensions of caring are basically dimensions of this motivational system that we emerge over."}, {"time": 3388, "text": "The meaning of the relations, the graph."}, {"time": 3388, "text": "Can you elaborate on that a little bit?"}, {"time": 3394, "text": "Like where does the, maybe we can even step back and ask the question of what is consciousness to be sort of more systematic."}, {"time": 3401, "text": "Like what do you, how do you think about consciousness?"}, {"time": 3407, "text": "I think that consciousness is largely a model of the contents of your attention."}, {"time": 3407, "text": "It's a mechanism that has evolved for a certain type of learning."}, {"time": 3412, "text": "At the moment, our machine learning systems largely work by building chains of weighted sums of real numbers with some nonlinearity."}, {"time": 3425, "text": "And you learn by piping an error signal through these different chained layers and adjusting the weights in these weighted sums."}, {"time": 3433, "text": "And you can approximate most polynomials with this if you have enough training data."}, {"time": 3439, "text": "But the price is you need to change a lot of these weights."}, {"time": 3444, "text": "Basically, the error is piped backwards into the system until it accumulates at certain junctures in the network."}, {"time": 3450, "text": "And everything else evens out statistically."}, {"time": 3450, "text": "And only at these junctures, this is where you had the actual error in the network, you make the change there."}, {"time": 3454, "text": "This is a very slow process."}, {"time": 3458, "text": "And our brains don't have enough time for that because we don't get old enough to play Go the way that our machines learn to play Go."}, {"time": 3462, "text": "So instead, what we do is an attention based learning."}, {"time": 3467, "text": "We pinpoint the probable region in the network where we can make an improvement."}, {"time": 3472, "text": "And then we store this binding state together with the expected outcome in a protocol."}, {"time": 3478, "text": "And this ability to make index memories for the purpose of learning to revisit these commitments later, this requires a memory of the contents of our attention."}, {"time": 3490, "text": "Another aspect is when I construct my reality, I make mistakes."}, {"time": 3490, "text": "So I see things that turn out to be reflections or shadows and so on, which means I have to be able to point out which features of my perception gave rise to a present construction of reality."}, {"time": 3500, "text": "So the system needs to pay attention to the features that are currently in its focus."}, {"time": 3508, "text": "And it also needs to pay attention to whether it pays attention itself, in part because the attentional system gets trained with the same mechanism, so it's reflexive, but also in part because your attention lapses if you don't pay attention to the attention itself."}, {"time": 3521, "text": "So it's the thing that I'm currently seeing, just a dream that my brain has spun off into some kind of daydream, or am I still paying attention to my percept?"}, {"time": 3532, "text": "So you have to periodically go back and see whether you're still paying attention."}, {"time": 3532, "text": "And if you have this loop and you make it tight enough between the system becoming aware of the contents of its attention and the fact that it's paying attention itself and makes attention the object of its attention, I think this is the loop over which we wake up."}, {"time": 3545, "text": "So there's this attentional mechanism that's somehow self referential that's fundamental to what consciousness is."}, {"time": 3552, "text": "So just ask you a question, I don't know how much you're familiar with the recent breakthroughs in natural language processing, they use attentional mechanism, they use something called transformers to learn patterns and sentences by allowing the network to focus its attention to particular parts of the sentence and each individual."}, {"time": 3577, "text": "So like parameterize and make it learnable the dynamics of a sentence by having like a little window into the sentence."}, {"time": 3582, "text": "Do you think that's like a little step towards that eventually will take us to the attentional mechanisms from which consciousness can emerge?"}, {"time": 3598, "text": "I think it models only one aspect of attention."}, {"time": 3603, "text": "In the early days of automated language translation, there was an example that I found particularly funny where somebody tried to translate a text from English into German and it was a bat broke the window."}, {"time": 3613, "text": "And the translation in German was to translate back into English a bat, this flying mammal broke the window with a baseball bat."}, {"time": 3631, "text": "And it seemed to be the most similar to this program because it somehow maximized the possibility of translating the concept bat into German in the same sentence."}, {"time": 3639, "text": "And this is a mistake that the transformer model is not doing because it's tracking identity."}, {"time": 3645, "text": "And the attentional mechanism in the transformer model is basically putting its finger on individual concepts and make sure that these concepts pop up later in the text and tracks basically the individuals through the text."}, {"time": 3656, "text": "And it's why the system can learn things that other systems couldn't before it, which makes it, for instance, possible to write a text where it talks about the scientist, then the scientist has a name and has a pronoun and it gets a consistent story about that thing."}, {"time": 3670, "text": "What it does not do, it doesn't fully integrate this."}, {"time": 3676, "text": "So this meaning falls apart at some point, it loses track of this context."}, {"time": 3680, "text": "It does not yet understand that everything that it says has to refer to the same universe."}, {"time": 3685, "text": "And this is where this thing falls apart."}, {"time": 3685, "text": "But the attention in the transformer model does not go beyond tracking identity."}, {"time": 3691, "text": "And tracking identity is an important part of attention, but it's a different, very specific attentional mechanism."}, {"time": 3696, "text": "And it's not the one that gives rise to the type of consciousness that we have."}, {"time": 3701, "text": "Just to linger on, what do you mean by identity in the context of language?"}, {"time": 3704, "text": "So when you talk about language, you have different words that can refer to the same concept."}, {"time": 3712, "text": "And in the sense that..."}, {"time": 3713, "text": "The space of concepts."}, {"time": 3713, "text": "And it can also be in a nominal sense or in an inexical sense that you say this word does not only refer to this class of objects, but it refers to a definite object, to some kind of agent that waves their way through the story."}, {"time": 3731, "text": "And it's only referred by different ways in the language."}, {"time": 3731, "text": "So the language is basically a projection from a conceptual representation from a scene that is evolving into a discrete string of symbols."}, {"time": 3743, "text": "And what the transformer is able to do, it learns aspects of this projection mechanism that other models couldn't learn."}, {"time": 3749, "text": "So have you ever seen an artificial intelligence or any kind of construction idea that allows for, unlike neural networks or perhaps within neural networks, that's able to form something where the space of concepts continues to be integrated?"}, {"time": 3767, "text": "So what you're describing, building a knowledge base, building this consistent, larger and larger sets of ideas that would then allow for deeper understanding."}, {"time": 3779, "text": "Wittgenstein thought that we can build everything from language, from basically a logical grammatical construct."}, {"time": 3782, "text": "And I think to some degree, this was also what Minsky believed."}, {"time": 3787, "text": "So that's why he focused so much on common sense reasoning and so on."}, {"time": 3792, "text": "And a project that was inspired by him was Psych."}, {"time": 3792, "text": "That was basically going on."}, {"time": 3799, "text": "Of course, ideas don't die."}, {"time": 3799, "text": "Only people die."}, {"time": 3807, "text": "And Alt Psych is a productive project."}, {"time": 3807, "text": "It's just probably not one that is going to converge to general intelligence."}, {"time": 3811, "text": "The thing that Wittgenstein couldn't solve, and he looked at this in his book at the end of his life, Philosophical Investigations, was the notion of images."}, {"time": 3820, "text": "So images play an important role in Tractatus."}, {"time": 3820, "text": "The Tractatus is an attempt to basically turn philosophy into logical probing language, to design a logical language in which you can do actual philosophy that's rich enough for doing this."}, {"time": 3829, "text": "And the difficulty was to deal with perceptual content."}, {"time": 3834, "text": "And eventually, I think he decided that he was not able to solve it."}, {"time": 3840, "text": "And I think this preempted the failure of the logitist program in AI."}, {"time": 3846, "text": "And the solution, as we see it today, is we need more general function approximation."}, {"time": 3846, "text": "There are geometric functions that we learn to approximate that cannot be efficiently expressed and computed in a grammatical language."}, {"time": 3856, "text": "We can, of course, build automata that go via number theory and so on to learn in algebra and then compute an approximation of this geometry."}, {"time": 3866, "text": "But to equate language and geometry is not an efficient way to think about it."}, {"time": 3872, "text": "So function, well, you kind of just said that neural networks are sort of, the approach that neural networks takes is actually more general than what can be expressed through language."}, {"time": 3884, "text": "So what can be efficiently expressed through language at the data rates at which we process grammatical language?"}, {"time": 3891, "text": "So you don't think languages, so you disagree with Wittgenstein, that language is not fundamental to..."}, {"time": 3898, "text": "I agree with Wittgenstein."}, {"time": 3898, "text": "I just agree with the late Wittgenstein."}, {"time": 3903, "text": "And I also agree with the beauty of the early Wittgenstein."}, {"time": 3903, "text": "I think that the Tractatus itself is probably the most beautiful philosophical text that was written in the 20th century."}, {"time": 3913, "text": "But language is not fundamental to cognition and intelligence and consciousness."}, {"time": 3918, "text": "So I think that language is a particular way or the natural language that we're using is a particular level of abstraction that we use to communicate with each other."}, {"time": 3923, "text": "But the languages in which we express geometry are not grammatical languages in the same sense."}, {"time": 3928, "text": "So they work slightly differently, more general expressions of functions."}, {"time": 3935, "text": "And I think the general nature of a model is you have a bunch of parameters."}, {"time": 3941, "text": "These have a range, these are the variances of the world, and you have relationships between them, which are constraints, which say if certain parameters have these values, then other parameters have to have the following values."}, {"time": 3952, "text": "And this is a very early insight in computer science."}, {"time": 3958, "text": "And I think some of the earliest formulations is the Boltzmann machine."}, {"time": 3963, "text": "And the problem with the Boltzmann machine is that it has a measure of whether it's good."}, {"time": 3963, "text": "This is basically the energy on the system, the amount of tension that you have left in the constraints where the constraints don't quite match."}, {"time": 3971, "text": "It's very difficult to, despite having this global measure, to train it."}, {"time": 3976, "text": "Because as soon as you add more than trivially few elements, parameters into the system, it's very difficult to get it settled in the right architecture."}, {"time": 3987, "text": "And so the solution that Hinton and Zanofsky found was to use a restricted Boltzmann machine, which uses the hidden links, the internal links in the Boltzmann machine and only has basically input and output layer."}, {"time": 3999, "text": "But this limits the expressivity of the Boltzmann machine."}, {"time": 3999, "text": "So now he builds a network of these primitive Boltzmann machines."}, {"time": 4004, "text": "And in some sense, you can see almost continuous development from this to the deep learning models that we're using today, even though we don't use Boltzmann machines at this point."}, {"time": 4014, "text": "But the idea of the Boltzmann machine is you take this model, you clamp some of the values to perception, and this forces the entire machine to go into a state that is compatible with the states that you currently perceive."}, {"time": 4026, "text": "And this state is your model of the world."}, {"time": 4026, "text": "I think it's a very general way of thinking about models, but we have to use a different approach to make it work."}, {"time": 4032, "text": "We have to find different networks that train the Boltzmann machine."}, {"time": 4039, "text": "So the mechanism that trains the Boltzmann machine and the mechanism that makes the Boltzmann machine settle into its state are distinct from the constrained architecture of the Boltzmann machine itself."}, {"time": 4053, "text": "The kind of mechanisms that we want to develop, you're saying?"}, {"time": 4056, "text": "So the direction in which I think our research is going to go is going to, for instance, what you notice in perception is our perceptual models of the world are not probabilistic, but possibilistic, which means you should be able to perceive things that are improbable, but possible."}, {"time": 4070, "text": "A perceptual state is valid, not if it's probable, but if it's possible, if it's coherent."}, {"time": 4077, "text": "So if you see a tiger coming after you, you should be able to see this even if it's unlikely."}, {"time": 4082, "text": "And the probability is necessary for convergence of the model."}, {"time": 4082, "text": "So given the state of possibilities that is very, very large and a set of perceptual features, how should you change the states of the model to get it to converge with your perception?"}, {"time": 4101, "text": "But the space of ideas that are coherent with the context that you're sensing is perhaps not as large."}, {"time": 4109, "text": "I mean, that's perhaps pretty small."}, {"time": 4114, "text": "The degree of coherence that you need to achieve depends, of course, how deep your models go."}, {"time": 4119, "text": "That is, for instance, politics is very simple when you know very little about game theory and human nature."}, {"time": 4124, "text": "So the younger you are, the more obvious it is how politics would work, right?"}, {"time": 4129, "text": "And because you get a coherent aesthetics from relatively few inputs."}, {"time": 4129, "text": "And the more layers you model, the more layers you model reality, the harder it gets to satisfy all the constraints."}, {"time": 4140, "text": "So, you know, the current neural networks are fundamentally supervised learning system with a feed forward neural network is back propagation to learn."}, {"time": 4147, "text": "What's your intuition about what kind of mechanisms might we move towards to improve the learning procedure?"}, {"time": 4158, "text": "I think one big aspect is going to be meta learning and architecture search starts in this direction."}, {"time": 4162, "text": "In some sense, the first wave of classical AI work by identifying a problem and a possible solution and implementing the solution, right?"}, {"time": 4168, "text": "A program that plays chess."}, {"time": 4172, "text": "And right now we are in the second wave of AI."}, {"time": 4172, "text": "So instead of writing the algorithm that implements the solution, we write an algorithm that automatically searches for an algorithm that implements the solution."}, {"time": 4181, "text": "So the learning system in some sense is an algorithm that itself discovers the algorithm that solves the problem, like Go."}, {"time": 4186, "text": "Go is too hard to implement the solution by hand, but we can implement an algorithm that finds the solution."}, {"time": 4196, "text": "So now let's move to the third stage, right?"}, {"time": 4196, "text": "The third stage would be meta learning."}, {"time": 4200, "text": "Find an algorithm that discovers a learning algorithm for the given domain."}, {"time": 4205, "text": "Our brain is probably not a learning system, but a meta learning system."}, {"time": 4208, "text": "This is one way of looking at what we are doing."}, {"time": 4208, "text": "There is another way."}, {"time": 4208, "text": "If you look at the way our brain is, for instance, implemented, there is no central control that tells all the neurons how to wire up."}, {"time": 4218, "text": "Instead, every neuron is an individual reinforcement learning agent."}, {"time": 4218, "text": "Every neuron is a single celled organism that is quite complicated and in some sense quite motivated to get fed."}, {"time": 4228, "text": "And it gets fed if it fires on average at the right time."}, {"time": 4228, "text": "And the right time depends on the context that the neuron exists in, which is the electrical and chemical environment that it has."}, {"time": 4242, "text": "So it basically has to learn a function over its environment that tells us when to fire to get fed."}, {"time": 4248, "text": "Or if you see it as a reinforcement learning agent, every neuron is in some sense making a hypothesis when it sends a signal and tries to pipe a signal through the universe and tries to get positive feedback for it."}, {"time": 4257, "text": "And the entire thing is set up in such a way that it's robustly self organizing into a brain, which means you start out with different neuron types that have different priors on which hypothesis to test and how to get its reward."}, {"time": 4272, "text": "And you put them into different concentrations in a certain spatial alignment, and then you entrain it in a particular order."}, {"time": 4276, "text": "And as a result, you get a well organized brain."}, {"time": 4282, "text": "Yeah, so okay, so the brain is a meta learning system with a bunch of reinforcement learning agents."}, {"time": 4289, "text": "And what I think you said, but just to clarify, there's no centralized government that tells you, here's a loss function, here's a loss function, here's a loss function."}, {"time": 4300, "text": "Who says what's the objective?"}, {"time": 4308, "text": "There are also governments which impose loss functions on different parts of the brain."}, {"time": 4312, "text": "So we have differential attention."}, {"time": 4312, "text": "Some areas in your brain get specially rewarded when you look at faces."}, {"time": 4316, "text": "If you don't have that, you will get prosopagnosia, which basically the inability to tell people apart by their faces."}, {"time": 4321, "text": "And the reason that happens is because it had an evolutionary advantage."}, {"time": 4327, "text": "So like evolution comes into play here."}, {"time": 4327, "text": "But it's basically an extraordinary attention that we have for faces."}, {"time": 4332, "text": "I don't think that people with prosopagnosia have a perceived defective brain, the brain just has an average attention for faces."}, {"time": 4337, "text": "So people with prosopagnosia don't look at faces more than they look at cups."}, {"time": 4342, "text": "So the level at which they resolve the geometry of faces is not higher than for cups."}, {"time": 4347, "text": "And people that don't have prosopagnosia look obsessively at faces, right?"}, {"time": 4354, "text": "For you and me, it's impossible to move through a crowd without scanning the faces."}, {"time": 4358, "text": "And as a result, we make insanely detailed models of faces that allow us to discern mental states of people."}, {"time": 4363, "text": "So obviously, we don't know 99% of the details of this meta learning system."}, {"time": 4369, "text": "That's our mind."}, {"time": 4369, "text": "But still, we took a leap from something much dumber to that from through the evolutionary process."}, {"time": 4375, "text": "Can you first of all, maybe say how hard the, how big of a leap is that from our brain, from our ancestors to multi cell organisms?"}, {"time": 4384, "text": "And is there something we can think about?"}, {"time": 4394, "text": "As we start to think about how to engineer intelligence, is there something we can learn from evolution?"}, {"time": 4401, "text": "In some sense, life exists because of the market opportunity of controlled chemical reactions."}, {"time": 4408, "text": "We compete with dump chemical reactions and we win in some areas against this dump combustion because we can harness those entropy gradients where you need to add a little bit of energy in a specific way to harvest more energy."}, {"time": 4420, "text": "So we out competed combustion."}, {"time": 4424, "text": "Yes, in many regions we do and we try very hard because when we are in direct competition, we lose, right?"}, {"time": 4429, "text": "So because the combustion is going to close the entropy gradients much faster than we can run."}, {"time": 4435, "text": "So basically we do this because every cell has a Turing machine built into it."}, {"time": 4442, "text": "It's like literally a read write head on the tape."}, {"time": 4449, "text": "So everything that's more complicated than a molecule that just is a vortex around attractors that needs a Turing machine for its regulation."}, {"time": 4456, "text": "And then you bind cells together and you get next level organizational organism where the cells together implement some kind of software."}, {"time": 4468, "text": "For me, a very interesting discovery in the last year was the word spirit because I realized that what spirit actually means is an operating system for an autonomous robot."}, {"time": 4473, "text": "And when the word was invented, people needed this word."}, {"time": 4478, "text": "But they didn't have robots that they built themselves yet."}, {"time": 4478, "text": "The only autonomous robots that were known were people, animals, plants, ecosystems, cities, and so on."}, {"time": 4488, "text": "And they all had spirits."}, {"time": 4488, "text": "And it makes sense to say that the plant has an operating system, right?"}, {"time": 4493, "text": "If you pinch the plant in one area, then it's going to have repercussions throughout the plant."}, {"time": 4497, "text": "Everything in the plant is in some sense connected into some global aesthetics like in other organisms."}, {"time": 4502, "text": "An organism is not a collection of cells, it's a function that tells cells how to behave."}, {"time": 4507, "text": "And this function is not implemented as some kind of supernatural thing, like some morphogenetic field."}, {"time": 4513, "text": "It is an emergent result of the interactions of each cell with each other cell."}, {"time": 4519, "text": "So what you're saying is the organism is a function that tells what to do and the function emerges from the interaction of the cells."}, {"time": 4531, "text": "So it's basically a description of what the plant is doing in terms of microstates."}, {"time": 4539, "text": "And the microstates, the physical implementation are too many of them to describe them."}, {"time": 4546, "text": "So the software that we use to describe what the plant is doing, the spirit of the plant is the software, the operating system of the plant, right?"}, {"time": 4551, "text": "This is a way in which we, the observers, make sense of the plant."}, {"time": 4557, "text": "And the same is true for people."}, {"time": 4557, "text": "So people have spirits, which is their operating system in a way, right?"}, {"time": 4563, "text": "And there's aspects of that operating system that relate to how your body functions and others, how you socially interact, how you interact with yourself and so on."}, {"time": 4572, "text": "And we make models of that spirit."}, {"time": 4572, "text": "And we think it's a loaded term because it's from a pre scientific age."}, {"time": 4578, "text": "But it took the scientific age a long time to rediscover a term that is pretty much the same thing."}, {"time": 4584, "text": "And I suspect that the differences that we still see between the old word and the new word are translation errors that have happened over the centuries."}, {"time": 4593, "text": "Can you actually linger on that?"}, {"time": 4593, "text": "Why do you say that spirit, just to clarify, because I'm a little bit confused."}, {"time": 4599, "text": "So the word spirit is a powerful thing."}, {"time": 4599, "text": "But why did you say in the last year or so that you discovered this?"}, {"time": 4605, "text": "Do you mean the same old traditional idea of a spirit?"}, {"time": 4610, "text": "I try to find out what people mean by spirit."}, {"time": 4610, "text": "When people say spirituality in the US, it usually refers to the phantom limb that they develop in the absence of culture."}, {"time": 4620, "text": "And a culture is in some sense, you could say the spirit of a society that is long game."}, {"time": 4620, "text": "This thing that is become self aware at a level above the individuals where you say, if you don't do the following things, then the grand, grand, grand grandchildren of our children will have nothing to eat."}, {"time": 4636, "text": "So if you take this long scope, where you try to maximize the length of the game that you are playing as a species, you realize that you're part of a larger thing that you cannot fully control."}, {"time": 4647, "text": "You probably need to submit to the ecosphere instead of trying to completely control it."}, {"time": 4652, "text": "There needs to be a certain level at which we can exist as a species if you want to endure."}, {"time": 4659, "text": "And our culture is not sustaining this anymore."}, {"time": 4659, "text": "We basically made this bet with the industrial revolution that we can control everything."}, {"time": 4664, "text": "And the modernist societies with basically unfettered growth led to a situation in which we depend on the ability to control the entire planet."}, {"time": 4674, "text": "And since we are not able to do that, as it seems, this culture will die."}, {"time": 4674, "text": "And we realize that it doesn't have a future, right?"}, {"time": 4680, "text": "We called our children generation Z."}, {"time": 4680, "text": "That's a very optimistic thing to do."}, {"time": 4686, "text": "So you can have this kind of intuition that our civilization, you said culture, but you really mean the spirit of the civilization, the entirety of the civilization may not exist for long."}, {"time": 4702, "text": "Can you untangle that?"}, {"time": 4702, "text": "What's your intuition behind that?"}, {"time": 4702, "text": "So you kind of offline mentioned to me that the industrial revolution was kind of the moment we agreed to accept the offer sign on the paper on the dotted line with the industrial revolution, we doomed ourselves."}, {"time": 4722, "text": "This is a suspicion."}, {"time": 4722, "text": "I, of course, don't know how it plays out."}, {"time": 4722, "text": "But it seems to me that in a society in which you leverage yourself very far over an entropic abyss without land on the other side, it's relatively clear that your cantilever is at some point going to break down into this entropic abyss."}, {"time": 4740, "text": "And you have to pay the bill."}, {"time": 4740, "text": "Russia is my first language."}, {"time": 4746, "text": "And I'm also an idiot."}, {"time": 4746, "text": "This is just two apes."}, {"time": 4753, "text": "Instead of playing with a banana, trying to have fun by talking."}, {"time": 4753, "text": "Anthropic what?"}, {"time": 4753, "text": "And what's entropic?"}, {"time": 4761, "text": "Entropic."}, {"time": 4761, "text": "So entropic in the sense of entropy."}, {"time": 4761, "text": "Oh, entropic."}, {"time": 4761, "text": "And entropic, what was the other word you used?"}, {"time": 4769, "text": "Abyss."}, {"time": 4769, "text": "It's a big gorge."}, {"time": 4769, "text": "Oh, abyss."}, {"time": 4769, "text": "Abyss, yes."}, {"time": 4775, "text": "Entropic abyss."}, {"time": 4775, "text": "So many of the things you say are poetic."}, {"time": 4775, "text": "It's hurting my ears."}, {"time": 4775, "text": "And this one is amazing, right?"}, {"time": 4779, "text": "It's mispronounced, which makes you more poetic."}, {"time": 4779, "text": "Wittgenstein would be proud."}, {"time": 4779, "text": "So entropic abyss."}, {"time": 4790, "text": "Let's rewind then."}, {"time": 4790, "text": "The industrial revolution."}, {"time": 4790, "text": "So how does that get us into the entropic abyss?"}, {"time": 4798, "text": "So in some sense, we burned a hundred million years worth of trees to get everybody plumbing."}, {"time": 4804, "text": "And the society that we had before that had a very limited number of people."}, {"time": 4810, "text": "So basically since zero BC, we hovered between 300 and 400 million people."}, {"time": 4810, "text": "And this only changed with the enlightenment and the subsequent industrial revolution."}, {"time": 4818, "text": "And in some sense, the enlightenment freed our rationality and also freed our norms from the preexisting order gradually."}, {"time": 4830, "text": "It was a process that basically happened in feedback loops."}, {"time": 4830, "text": "So it was not that just one caused the other."}, {"time": 4835, "text": "It was a dynamic that started."}, {"time": 4835, "text": "And the dynamic worked by basically increasing productivity to such a degree that we could feed all our children."}, {"time": 4841, "text": "And I think the definition of poverty is that you have as many children as you can feed before they die, which is in some sense, the state that all animals on earth are in."}, {"time": 4855, "text": "The definition of poverty is having enough."}, {"time": 4861, "text": "So you can have only so many children as you can feed and if you have more, they die."}, {"time": 4866, "text": "And in our societies, you can basically have as many children as you want, they don't die."}, {"time": 4872, "text": "So the reason why we don't have as many children as we want is because we also have to pay a price in terms of we have to insert ourselves in a lower social stratum if we have too many children."}, {"time": 4882, "text": "So basically everybody in the under middle and lower upper class has only a limited number of children because having more of them would mean a big economic hit to the individual families."}, {"time": 4893, "text": "Because children, especially in the US, super expensive to have."}, {"time": 4893, "text": "And you only are taken out of this if you are basically super rich or if you are super poor."}, {"time": 4899, "text": "If you're super poor, it doesn't matter how many kids you have because your status is not going to change."}, {"time": 4903, "text": "And these children allow you not going to die of hunger."}, {"time": 4908, "text": "So how does this lead to self destruction?"}, {"time": 4908, "text": "So there's a lot of unpleasant properties about this process."}, {"time": 4914, "text": "So basically what we try to do is we try to let our children survive, even if they have diseases."}, {"time": 4918, "text": "Like I would have died before my mid twenties without modern medicine."}, {"time": 4926, "text": "And most of my friends would have as well."}, {"time": 4926, "text": "And so many of us wouldn't live without the advantages of modern medicine and modern industrialized society."}, {"time": 4932, "text": "We get our protein largely by subduing the entirety of nature."}, {"time": 4938, "text": "Imagine there would be some very clever microbe that would live in our organisms and would completely harvest them and change them into a thing that is necessary to sustain itself."}, {"time": 4952, "text": "And it would discover that for instance, brain cells are kind of edible, but they're not quite nice."}, {"time": 4958, "text": "So you need to have more fat in them and you turn them into more fat cells."}, {"time": 4963, "text": "And basically this big organism would become a vegetable that is barely alive and it's going to be very brittle and not resilient when the environment changes."}, {"time": 4972, "text": "Yeah, but some part of that organism, the one that's actually doing all the using of the, there'll still be somebody thriving."}, {"time": 4977, "text": "So it relates back to this original question I suspect that we are not the smartest thing on this planet."}, {"time": 4984, "text": "I suspect that basically every complex system has to have some complex regulation if it depends on feedback loops."}, {"time": 4990, "text": "And so for instance, it's likely that we should describe a certain degree of intelligence to plants."}, {"time": 4997, "text": "The problem is that plants don't have a nervous system."}, {"time": 5004, "text": "So they don't have a way to telegraph messages over large distances almost instantly in the plant."}, {"time": 5008, "text": "And instead, they will rely on chemicals between adjacent cells, which means the signal processing speed depends on the signal processing with a rate of a few millimeters per second."}, {"time": 5020, "text": "And as a result, if the plant is intelligent, it's not going to be intelligent at similar timescales as this."}, {"time": 5029, "text": "Yeah, the time scale is different."}, {"time": 5029, "text": "So you suspect we might not be the most intelligent but we're the most intelligent in this spatial scale in our timescale."}, {"time": 5040, "text": "So basically, if you would zoom out very far, we might discover that there have been intelligent ecosystems on the planet that existed for thousands of years in an almost undisturbed state."}, {"time": 5045, "text": "And it could be that these ecosystems actively related their environment."}, {"time": 5052, "text": "So basically change the course of the evolution vision, this ecosystem to make it more efficient in the future."}, {"time": 5060, "text": "So it's possible something like plants is actually a set of living organisms, an ecosystem of living organisms that are just operating a different timescale and are far superior in intelligence than human beings."}, {"time": 5070, "text": "And then human beings will die out and plants will still be there and they'll be there."}, {"time": 5076, "text": "Yeah, there's an evolutionary adaptation playing a role at all of these levels."}, {"time": 5076, "text": "For instance, if mice don't get enough food and get stressed, the next step is to get more sparse and more scrawny."}, {"time": 5085, "text": "And the reason for this is because they in a natural environment, the mice have probably hidden a drought or something else."}, {"time": 5091, "text": "And if they're overgrazed, then all the things that sustain them might go extinct."}, {"time": 5096, "text": "And there will be no mice a few generations from now."}, {"time": 5101, "text": "So to make sure that there will be mice in five generations from now, basically the mice scale back."}, {"time": 5105, "text": "And a similar thing happens with the predators of mice."}, {"time": 5110, "text": "They should make sure that the mice don't completely go extinct."}, {"time": 5110, "text": "So in some sense, if the predators are smart enough, they will be tasked with shepherding their food supply."}, {"time": 5115, "text": "Maybe the reason why lions have much larger brains than antelopes is not so much because it's so hard to catch an antelope as opposed to run away from the lion."}, {"time": 5127, "text": "But the lions need to make complex models of their environment, more complex than the antelopes."}, {"time": 5135, "text": "So first of all, just describing that there's a bunch of complex systems and human beings may not even be the most special or intelligent of those complex systems, even on Earth, makes me feel a little better about the extinction of human species that we're talking about."}, {"time": 5148, "text": "Yes, maybe you're just Guy Astploit to put the carbon back into the atmosphere."}, {"time": 5152, "text": "Yeah, this is just a nice, we tried it out."}, {"time": 5154, "text": "The big stain on evolution is not us, it was trees."}, {"time": 5154, "text": "Earth evolved trees before there could be digested again."}, {"time": 5160, "text": "There were no insects that could break all of them apart."}, {"time": 5160, "text": "Cellulose is so robust that you cannot get all of it with microorganisms."}, {"time": 5165, "text": "So many of these trees fell into swamps and all this carbon became inert and could no longer be recycled into organisms."}, {"time": 5171, "text": "And we are the species that is destined to take care of that."}, {"time": 5177, "text": "So this is kind of... To get out of the ground, put it back into the atmosphere and the Earth is already greening."}, {"time": 5184, "text": "So we have to be careful about that."}, {"time": 5186, "text": "To get out of the ground, put it back into the atmosphere and the Earth is already greening."}, {"time": 5190, "text": "So within a million years or so when the ecosystems have recovered from the rapid changes, that they're not compatible with right now, the Earth is going to be awesome again."}, {"time": 5199, "text": "And there won't be even a memory of us, of us little apes."}, {"time": 5202, "text": "I think there will be memories of us."}, {"time": 5202, "text": "I suspect we are the first generally intelligent species in the sense."}, {"time": 5206, "text": "We are the first species within industrial society because we will leave more phones than bones in the stratosphere."}, {"time": 5213, "text": "Phones than bones."}, {"time": 5213, "text": "But then let me push back."}, {"time": 5213, "text": "You've kind of suggested that we have a very narrow definition of..."}, {"time": 5221, "text": "I mean, why aren't trees a higher level of general intelligence?"}, {"time": 5229, "text": "If trees were intelligent, then they would be at different timescales, which means within a hundred years, the tree is probably not going to make models that are as complex as the ones that we make in 10 years."}, {"time": 5238, "text": "But maybe the trees are the ones that made the phones, right?"}, {"time": 5245, "text": "You could say the entirety of life did it."}, {"time": 5245, "text": "The first cell never died."}, {"time": 5245, "text": "The first cell only split, right?"}, {"time": 5251, "text": "And every cell in our body is still an instance of the first cell that split off from that very first cell."}, {"time": 5256, "text": "There was only one cell on this planet as far as we know."}, {"time": 5260, "text": "And so the cell is not just a building block of life."}, {"time": 5260, "text": "It's a hyperorganism."}, {"time": 5260, "text": "And we are part of this hyperorganism."}, {"time": 5269, "text": "So nevertheless, this hyperorganism, no, this little particular branch of it, which is us humans, because of the industrial revolution and maybe the exponential growth of technology might somehow destroy ourselves."}, {"time": 5282, "text": "So what do you think is the most likely way we might destroy ourselves?"}, {"time": 5287, "text": "So some people worry about genetic manipulation."}, {"time": 5287, "text": "Some people, as we've talked about, worry about either dumb artificial intelligence or super intelligent artificial intelligence destroying us."}, {"time": 5298, "text": "Some people worry about nuclear weapons and weapons of war in general."}, {"time": 5305, "text": "If you were a betting man, what would you bet on in terms of self destruction?"}, {"time": 5309, "text": "And then would it be higher than 50%?"}, {"time": 5314, "text": "So it's very likely that nothing that we bet on matters after we win our bets."}, {"time": 5314, "text": "So I don't think that bets are literally the right way to go about this."}, {"time": 5324, "text": "I mean, once you're dead, you won't be there to collect the wings."}, {"time": 5327, "text": "So it's also not clear if we as a species go extinct."}, {"time": 5327, "text": "But I think that our present civilization is not sustainable."}, {"time": 5333, "text": "So the thing that will change is there will be probably fewer people on the planet than there are today."}, {"time": 5337, "text": "And even if not, then still most of people that are alive today will not have offspring in 100 years from now because of the geographic changes and so on and the changes in the food supply."}, {"time": 5345, "text": "It's quite likely that many areas of the planet will only be livable with a close cooling chain in 100 years from now."}, {"time": 5355, "text": "So many of the areas around the equator and in subtropical climates that are now quite pleasant to live in, will stop to be inhabitable without air conditioning."}, {"time": 5367, "text": "So you honestly, wow, cooling chain, close knit cooling chain communities."}, {"time": 5367, "text": "So you think you have a strong worry about the effects of global warming?"}, {"time": 5378, "text": "By itself, it's not a big issue."}, {"time": 5378, "text": "If you live in Arizona right now, you have basically three months in the summer in which you cannot be outside."}, {"time": 5382, "text": "And so you have a close cooling chain."}, {"time": 5387, "text": "You have air conditioning in your car and in your home and you're fine."}, {"time": 5387, "text": "And if the air conditioning would stop for a few days, then in many areas you would not be able to survive."}, {"time": 5396, "text": "Can we just pause for a second?"}, {"time": 5396, "text": "You say so many brilliant, poetic things."}, {"time": 5396, "text": "Do people use that term closed cooling chain?"}, {"time": 5403, "text": "I imagine that people use it when they describe how they get meat into a supermarket, right?"}, {"time": 5408, "text": "If you break the cooling chain and this thing starts to thaw, you're in trouble and you have to throw it away."}, {"time": 5413, "text": "That's such a beautiful way to put it."}, {"time": 5413, "text": "It's like calling a city a closed social chain or something like that."}, {"time": 5419, "text": "I mean, that's right."}, {"time": 5419, "text": "I mean, the locality of it is really important."}, {"time": 5425, "text": "It basically means you wake up in a climatized room, you go to work in a climatized car, you work in a climatized office, you shop in a climatized supermarket and in between you have very short distance in which you run from your car to the supermarket, but you have to make sure that your temperature does not approach the temperature of the environment."}, {"time": 5442, "text": "The crucial thing is the wet barb temperature."}, {"time": 5442, "text": "The wet barb temperature."}, {"time": 5442, "text": "It's what you get when you take a wet cloth and you put it around your thermometer and then you move it very quickly through the air so you get the evaporation heat."}, {"time": 5454, "text": "And as soon as you can no longer cool your body temperature via evaporation to a temperature below something like I think 35 degrees, you die."}, {"time": 5468, "text": "Which means if the outside world is dry, you can still cool yourself down by sweating."}, {"time": 5475, "text": "But if it has a certain degree of humidity or if it goes over a certain temperature, then sweating will not save you."}, {"time": 5480, "text": "And this means even if you're a healthy, fit individual within a few hours, even if you try to be in the shade and so on, you'll die unless you have some climatizing equipment."}, {"time": 5491, "text": "And this itself, as long as you maintain civilization and you have energy supply and you have foot trucks coming to your home that are climatized, everything is fine."}, {"time": 5501, "text": "But what if you lose large scale open agriculture at the same time?"}, {"time": 5501, "text": "So basically you run into foot insecurity because climate becomes very irregular or weather becomes very irregular and you have a lot of extreme weather events."}, {"time": 5512, "text": "So you need to roll most of your foot maybe indoor or you need to import your foot from certain regions."}, {"time": 5519, "text": "And maybe you're not able to maintain the civilization throughout the planet to get the infrastructure to get the foot to your home."}, {"time": 5529, "text": "But there could be significant impacts in the sense that people begin to suffer."}, {"time": 5533, "text": "There could be wars over resources and so on."}, {"time": 5533, "text": "But ultimately, do you not have a, not a faith, but what do you make of the capacity of technological innovation to help us prevent some of the worst damages that this condition can create?"}, {"time": 5550, "text": "So as an example, as an almost out there example, is the work that SpaceX and Elon Musk is doing of trying to also consider our propagation throughout the universe in deep space to colonize other planets."}, {"time": 5565, "text": "That's one technological step."}, {"time": 5571, "text": "But of course, what Elon Musk is trying on Mars is not to save us from global warming, because Mars looks much worse than Earth will look like after the worst outcomes of global warming imaginable, right?"}, {"time": 5581, "text": "Mars is essentially not habitable."}, {"time": 5586, "text": "It's exceptionally harsh environment, yes."}, {"time": 5586, "text": "But what he is doing, what a lot of people throughout history since the Industrial Revolution are doing, are just doing a lot of different technological innovation with some kind of target."}, {"time": 5595, "text": "And when it ends up happening, it's totally unexpected new things come up."}, {"time": 5600, "text": "So trying to terraform or trying to colonize Mars, extremely harsh environment, might give us totally new ideas of how to expand or increase the power of this closed cooling circuit that empowers the community."}, {"time": 5616, "text": "So it seems like there's a little bit of a race between our open ended technological innovation of this communal operating system that we have and our general tendency to want to overuse resources and thereby destroy ourselves."}, {"time": 5635, "text": "You don't think technology can win that race?"}, {"time": 5642, "text": "I think the probability is relatively low, given that our technology is, for instance, the US is stagnating since the 1970s roughly, in terms of technology."}, {"time": 5655, "text": "Most of the things that we do are the result of incremental processes."}, {"time": 5655, "text": "What about Intel?"}, {"time": 5659, "text": "What about Moore's Law?"}, {"time": 5659, "text": "It's basically, it's very incremental."}, {"time": 5659, "text": "The things that we're doing is, so the invention of the microprocessor was a major thing, right?"}, {"time": 5664, "text": "The miniaturization of transistors was really major."}, {"time": 5671, "text": "But the things that we did afterwards largely were not that innovative."}, {"time": 5678, "text": "We had gradual changes of scaling things from CPUs into GPUs and things like that."}, {"time": 5688, "text": "But I don't think that there are, basically there are not many things."}, {"time": 5688, "text": "If you take a person that died in the 70s and was at the top of their game, they would not need to read that many books to be current again."}, {"time": 5699, "text": "But it's all about books."}, {"time": 5699, "text": "Who cares about books?"}, {"time": 5699, "text": "There might be things that are beyond books."}, {"time": 5705, "text": "Or say papers."}, {"time": 5705, "text": "No, papers."}, {"time": 5705, "text": "Forget papers."}, {"time": 5705, "text": "There might be things that are, so papers and books and knowledge, that's a concept of a time when you were sitting there by candlelight and individual consumers of knowledge."}, {"time": 5716, "text": "What about the impact that we're not in the middle of, might not be understanding of Twitter, of YouTube?"}, {"time": 5721, "text": "The reason you and I are sitting here today is because of Twitter and YouTube."}, {"time": 5727, "text": "So the ripple effect, and there's two minds, sort of two dumb apes coming up with a new, perhaps a new clean insights, and there's 200 other apes listening right now, 200,000 other apes listening right now."}, {"time": 5742, "text": "And that effect, it's very difficult to understand what that effect will have."}, {"time": 5748, "text": "That might be bigger than any of the advancements of the microprocessor or any of the industrial revolution, the ability of spread knowledge."}, {"time": 5753, "text": "And that knowledge, like it allows good ideas to reach millions much faster."}, {"time": 5762, "text": "And the effect of that, that might be the new, that might be the 21st century, is the multiplying of ideas, of good ideas."}, {"time": 5769, "text": "Because if you say one good thing today, that will multiply across huge amounts of people, and then they will say something, and then they will have another podcast, and they'll say something, and then they'll write a paper."}, {"time": 5787, "text": "That could be a huge, you don't think that?"}, {"time": 5787, "text": "Yeah, we should have billions for Neumann's right now in two rings, and we don't for some reason."}, {"time": 5793, "text": "I suspect the reason is that we destroy our attention span."}, {"time": 5798, "text": "Also the incentives, of course, different."}, {"time": 5798, "text": "Yeah, we have extreme Kardashians, yeah."}, {"time": 5803, "text": "So the reason why we're sitting here and doing this as a YouTube video is because you and me don't have the attention span to write a book together right now."}, {"time": 5808, "text": "And you guys probably don't have the attention span to read it."}, {"time": 5812, "text": "So let me tell you, it's very short."}, {"time": 5812, "text": "But we're an hour and 40 minutes in, and I guarantee you that 80% of the people are still listening."}, {"time": 5821, "text": "So there is an attention span."}, {"time": 5826, "text": "It's just the form."}, {"time": 5826, "text": "Who said that the book is the optimal way to transfer information?"}, {"time": 5833, "text": "This is still an open question."}, {"time": 5833, "text": "That's what we're..."}, {"time": 5833, "text": "It's something that social media could be doing that other forms could not be doing."}, {"time": 5837, "text": "I think the end game of social media is a global brain."}, {"time": 5842, "text": "And Twitter is in some sense a global brain that is completely hooked on dopamine, doesn't have any kind of inhibition, and as a result is caught in a permanent seizure."}, {"time": 5846, "text": "It's also in some sense a multiplayer role playing game."}, {"time": 5852, "text": "And people use it to play an avatar that is not like them, as they were in this sane world, and they look through the world through the lens of their phones and think it's the real world."}, {"time": 5861, "text": "But it's the Twitter world that is distorted by the popularity incentives of Twitter."}, {"time": 5865, "text": "Yeah, the incentives and just our natural biological, the dopamine rush of a like, no matter how..."}, {"time": 5872, "text": "I try to be very kind of Zen like and minimalist and not be influenced by likes and so on, but it's probably very difficult to avoid that to some degree."}, {"time": 5887, "text": "Speaking at a small tangent of Twitter, how can Twitter be done better?"}, {"time": 5895, "text": "I think it's an incredible mechanism that has a huge impact on society by doing exactly what you're doing."}, {"time": 5899, "text": "Sorry, doing exactly what you described, which is having this... We're like, is this some kind of game, and we're kind of our individual RL agents in this game, and it's uncontrollable because there's not really a centralized control."}, {"time": 5913, "text": "Neither Jack Dorsey nor the engineers at Twitter seem to be able to control this game."}, {"time": 5917, "text": "Or can they?"}, {"time": 5917, "text": "That's sort of a question."}, {"time": 5924, "text": "Is there any advice you would give on how to control this game?"}, {"time": 5929, "text": "I wouldn't give advice because I am certainly not an expert, but I can give my thoughts on this."}, {"time": 5933, "text": "And our brain has solved this problem to some degree."}, {"time": 5933, "text": "Our brain has lots of individual agents that manage to play together in a way."}, {"time": 5941, "text": "And we have also many contexts in which other organisms have found ways to solve the problems of cooperation that we don't solve on Twitter."}, {"time": 5952, "text": "And maybe the solution is to go for an evolutionary approach."}, {"time": 5952, "text": "So imagine that you have something like Reddit or something like Facebook and something like Twitter, and you think about what they have in common."}, {"time": 5963, "text": "What they have in common, they are companies that in some sense own a protocol."}, {"time": 5967, "text": "And this protocol is imposed on a community, and the protocol has different components for monetization, for user management, for user display, for rating, for anonymity, for import of other content, and so on."}, {"time": 5979, "text": "And now imagine that you take these components of the protocol apart, and you do it in some sense like communities within this social network."}, {"time": 5990, "text": "And these communities are allowed to mix and match their protocols and design new ones."}, {"time": 5995, "text": "So for instance, the UI and the UX can be defined by the community."}, {"time": 5995, "text": "The rules for sharing content across communities can be defined."}, {"time": 6002, "text": "The monetization can be redefined."}, {"time": 6002, "text": "The way you reward individual users for what can be redefined."}, {"time": 6007, "text": "The way users can represent themselves and to each other can redefined."}, {"time": 6013, "text": "Who could be the redefiner?"}, {"time": 6013, "text": "So can individual human beings build enough intuition to redefine those things?"}, {"time": 6018, "text": "This itself can become part of the protocol."}, {"time": 6018, "text": "So for instance, it could be in some communities, it will be a single person that comes up with these things."}, {"time": 6027, "text": "And others, it's a group of friends."}, {"time": 6027, "text": "Some might implement a voting scheme that has some interesting weighted voting."}, {"time": 6032, "text": "Who knows what will be the best self organizing principle for this."}, {"time": 6036, "text": "But the process can't be automated."}, {"time": 6036, "text": "I mean, it seems like the brain."}, {"time": 6039, "text": "It can be automated so people can write software for this."}, {"time": 6039, "text": "And eventually the idea is, let's not make an assumption about this thing if you don't know what the right solution is."}, {"time": 6045, "text": "In those areas that we have no idea whether the right solution will be people designing this ad hoc, or machines doing this."}, {"time": 6055, "text": "Whether you want to enforce compliance by social norms like Wikipedia, or with software solutions, or with AI that goes through the posts of people, or with a legal principle, and so on."}, {"time": 6066, "text": "This is something maybe you need to find out."}, {"time": 6066, "text": "And so the idea would be if you let the communities evolve, and you just control it in such a way that you are incentivizing the most sentient communities."}, {"time": 6077, "text": "The ones that produce the most interesting behaviors that allow you to interact in the most helpful ways to the individuals."}, {"time": 6089, "text": "You have a network that gives you information that is relevant to you."}, {"time": 6092, "text": "It helps you to maintain relationships to others in healthy ways."}, {"time": 6092, "text": "It allows you to build teams."}, {"time": 6092, "text": "It allows you to basically bring the best of you into this thing and goes into a coupling into a relationship with others in which you produce things that you would be unable to produce alone."}, {"time": 6107, "text": "Yes, beautifully put."}, {"time": 6107, "text": "But the key process of that with incentives and evolution is things that don't adopt themselves to effectively get the incentives have to die."}, {"time": 6122, "text": "And the thing about social media is communities that are unhealthy or whatever you wanted that defines the incentives really don't like dying."}, {"time": 6127, "text": "One of the things that people really get aggressive, protest aggressively is when they're censored."}, {"time": 6133, "text": "Especially in America."}, {"time": 6133, "text": "I don't know much about the rest of the world, but the idea of freedom of speech, the idea of censorship is really painful in America."}, {"time": 6144, "text": "And so what do you think about that?"}, {"time": 6144, "text": "Having grown up in East Germany, do you think censorship is an important tool in our brain and the intelligence and in social networks?"}, {"time": 6165, "text": "So basically, if you're not a good member of the entirety of the system, they should be blocked away."}, {"time": 6173, "text": "Well, locked away, blocked."}, {"time": 6173, "text": "An important thing is who decides that you are a good member."}, {"time": 6179, "text": "Is it distributed?"}, {"time": 6179, "text": "And what is the outcome of the process that decides it, both for the individual and for society at large."}, {"time": 6184, "text": "For instance, if you have a high trust society, you don't need a lot of surveillance."}, {"time": 6189, "text": "And the surveillance is even in some sense undermining trust."}, {"time": 6194, "text": "Because it's basically punishing people that look suspicious when surveyed, but do the right thing anyway."}, {"time": 6201, "text": "And the opposite, if you have a low trust society, then surveillance can be a better trade off."}, {"time": 6206, "text": "And the US is currently making a transition from a relatively high trust or mixed trust society to a low trust society."}, {"time": 6210, "text": "So surveillance will increase."}, {"time": 6216, "text": "Another thing is that beliefs are not just inert representations."}, {"time": 6216, "text": "There are implementations that run code on your brain and change your reality and change the way you interact with each other at some level."}, {"time": 6225, "text": "And some of the beliefs are just public opinions that we use to display our alignment."}, {"time": 6232, "text": "So for instance, people might say, all cultures are the same and equally good, but still they prefer to live in some cultures over others, very, very strongly so."}, {"time": 6238, "text": "And it turns out that the cultures are defined by certain rules of interaction."}, {"time": 6243, "text": "And these rules of interaction lead to different results when you implement them."}, {"time": 6248, "text": "So if you adhere to certain rules, you get different outcomes in different societies."}, {"time": 6252, "text": "And this all leads to very tricky situations when people do not have a commitment to a shared purpose."}, {"time": 6262, "text": "And our societies probably need to rediscover what it means to have a shared purpose and how to make this compatible with a non totalitarian view."}, {"time": 6267, "text": "So in some sense, the US is caught in a conundrum between totalitarianism and diversity, and doesn't need to know how to resolve this."}, {"time": 6282, "text": "And the solutions that the US has found so far are very crude because it's a very young society that is also under a lot of tension."}, {"time": 6287, "text": "It seems to me that the US will have to reinvent itself."}, {"time": 6292, "text": "What do you think, just philosophizing, what kind of mechanisms of government do you think we as a species should be involved with, US or broadly?"}, {"time": 6301, "text": "What do you think will work well as a system?"}, {"time": 6307, "text": "Of course, we don't know."}, {"time": 6307, "text": "It all seems to work pretty crappily, some things worse than others."}, {"time": 6311, "text": "Some people argue that communism is the best."}, {"time": 6311, "text": "Others say, yeah, look at the Soviet Union."}, {"time": 6316, "text": "Some people argue that anarchy is the best and then completely discarding the positive effects of government."}, {"time": 6322, "text": "There's a lot of arguments."}, {"time": 6322, "text": "US seems to be doing pretty damn well in the span of history."}, {"time": 6329, "text": "There's a respect for human rights, which seems to be a nice feature, not a bug."}, {"time": 6336, "text": "And economically, a lot of growth, a lot of technological development."}, {"time": 6342, "text": "People seem to be relatively kind on the grand scheme of things."}, {"time": 6347, "text": "What lessons do you draw from that?"}, {"time": 6347, "text": "What kind of government system do you think is good?"}, {"time": 6352, "text": "Ideally, a government should not be perceivable."}, {"time": 6352, "text": "It should be frictionless."}, {"time": 6352, "text": "The more you notice the influence of the government, the more friction you experience, the less effective and efficient the government probably is."}, {"time": 6364, "text": "A government, game theoretically, is an agent that imposes an offset on your payout metrics to make your Nash equilibrium compatible with the common good."}, {"time": 6377, "text": "You have these situations where people act on local incentives and these local incentives, everybody does the thing that's locally the best for them, but the global outcome is not good."}, {"time": 6387, "text": "And this is even the case when people care about the global outcome, because a regulation mechanism exists that creates a causal relationship between what I want to have for the global good and what I do."}, {"time": 6396, "text": "For instance, if I think that we should fly less and I stay at home, there's not a single plane that is going to not start because of me, right?"}, {"time": 6401, "text": "It's not going to have an influence, but I don't get from A to B."}, {"time": 6409, "text": "So the way to implement this would be to have a government that is sharing this idea that we should fly less and is then imposing a regulation that, for instance, makes flying more expensive and gives incentives for inventing other forms of transportation that are less putting that strain on the environment, for instance."}, {"time": 6426, "text": "So there's so much optimism and so many things you describe, and yet there's the pessimism of you think our civilization is going to come to an end."}, {"time": 6438, "text": "So that's not a hundred percent probability."}, {"time": 6438, "text": "Nothing in this world is."}, {"time": 6443, "text": "So what's the trajectory out of self destruction, do you think?"}, {"time": 6443, "text": "I suspect that in some sense, we are both too smart and not smart enough, which means we are very good at solving near term problems."}, {"time": 6455, "text": "And at the same time, we are unwilling to submit to the imperatives that we would have to follow in if you want to stick around."}, {"time": 6463, "text": "So that makes it difficult."}, {"time": 6463, "text": "If you were unable to solve everything technologically, you can probably understand how high the child mortality needs to be to absorb the mutation rate and how high the mutation rate needs to be to adapt to a slowly changing ecosystemic environment."}, {"time": 6479, "text": "So you could in principle compute all these things game theoretically and adapt to it."}, {"time": 6484, "text": "But if you cannot do this, because you are like me and you have children, you don't want them to die, you will use any kind of medical information to keep mortality low."}, {"time": 6496, "text": "Even if it means that within a few generations, we have enormous genetic drift, and most of us have allergies as a result of not being adapted to the changes that we made to our food supply."}, {"time": 6506, "text": "That's for now, I say technologically speaking, we're just very young, 300 years industrial revolution, we're very new to this idea."}, {"time": 6511, "text": "So you're attached to your kids being alive and not being murdered for the good of society."}, {"time": 6516, "text": "But that might be a very temporary moment of time that we might evolve in our thinking."}, {"time": 6521, "text": "So like you said, we're both smart and not smart enough."}, {"time": 6528, "text": "We are probably not the first human civilization that has discovered technology that allows us to efficiently overgraze our resources."}, {"time": 6534, "text": "And this overgrazing, this thing, at some point, we think we can compensate this because if we have eaten all the grass, we will find a way to grow mushrooms."}, {"time": 6544, "text": "But it could also be that the ecosystems tip."}, {"time": 6550, "text": "And so what really concerns me is not so much the end of the civilization, because we will invent a new one."}, {"time": 6554, "text": "But what concerns me is the fact that, for instance, the oceans might tip."}, {"time": 6561, "text": "So for instance, maybe the plankton dies because of ocean acidification and cyanobacteria take over, and as a result, we can no longer breathe the atmosphere."}, {"time": 6567, "text": "This would be really concerning."}, {"time": 6572, "text": "So basically a major reboot of most complex organisms on Earth."}, {"time": 6572, "text": "And I think this is a possibility."}, {"time": 6577, "text": "I don't know what the percentage for this possibility is, but it doesn't seem to be outlandish to me if you look at the scale of the changes that we've already triggered on this planet."}, {"time": 6586, "text": "And so Danny Hiller suggests that, for instance, we may be able to put chalk into the stratosphere to limit solar radiation."}, {"time": 6591, "text": "Maybe it works."}, {"time": 6591, "text": "Maybe this is sufficient to counter the effects of what we've done."}, {"time": 6597, "text": "Maybe it won't be."}, {"time": 6597, "text": "Maybe we won't be able to implement it by the time it's prevalent."}, {"time": 6601, "text": "I have no idea how the future is going to play out in this regard."}, {"time": 6601, "text": "It's just, I think it's quite likely that we cannot continue like this."}, {"time": 6607, "text": "All our cousin species, the other hominids are gone."}, {"time": 6612, "text": "So the right step would be to what?"}, {"time": 6612, "text": "To rewind and to rewind towards the industrial revolution and slow the, so try to contain the technological process that leads to the overconsumption of resources?"}, {"time": 6628, "text": "Imagine you get to choose, you have one lifetime."}, {"time": 6633, "text": "You get born into a sustainable agricultural civilization, 300, maybe 400 million people on the planet tops."}, {"time": 6638, "text": "Or before this, some kind of nomadic species was like a million or 2 million."}, {"time": 6645, "text": "And so you don't meet new people unless you give birth to them."}, {"time": 6651, "text": "You cannot travel to other places in the world."}, {"time": 6651, "text": "There is no internet."}, {"time": 6651, "text": "There is no interesting intellectual tradition that reaches considerably deep."}, {"time": 6655, "text": "So you would not discover human completeness probably and so on."}, {"time": 6660, "text": "We wouldn't exist."}, {"time": 6660, "text": "And the alternative is you get born into an insane world."}, {"time": 6666, "text": "One that is doomed to die because it has just burned a hundred million years worth of trees in a single century."}, {"time": 6671, "text": "Which one do you like?"}, {"time": 6671, "text": "I think I like this one."}, {"time": 6671, "text": "It's a very weird thing that when you find yourself on a Titanic and you see this iceberg and it looks like we are not going to miss it."}, {"time": 6681, "text": "And a lot of people are in denial."}, {"time": 6681, "text": "And most of the counter arguments sound like denial to me."}, {"time": 6685, "text": "They don't seem to be rational arguments."}, {"time": 6685, "text": "And the other thing is we are born on this Titanic."}, {"time": 6690, "text": "Without this Titanic, we wouldn't have been born."}, {"time": 6690, "text": "We wouldn't be here."}, {"time": 6690, "text": "We wouldn't be talking."}, {"time": 6694, "text": "We wouldn't be on the internet."}, {"time": 6694, "text": "We wouldn't do all the things that we enjoy."}, {"time": 6698, "text": "And we are not responsible for this happening."}, {"time": 6698, "text": "If we had the choice, we would probably try to prevent it."}, {"time": 6705, "text": "But when we were born, we were never asked when we want to be born, in which society we want to be born, what incentive structures we want to be exposed to."}, {"time": 6711, "text": "We have relatively little agency in the entire thing."}, {"time": 6715, "text": "Humanity has relatively little agency in the whole thing."}, {"time": 6715, "text": "It's basically a giant machine that's tumbling down a hill and everybody is frantically trying to push some buttons."}, {"time": 6724, "text": "Nobody knows what these buttons are meaning, what they connect to."}, {"time": 6724, "text": "And most of them are not stopping this tumbling down the hill."}, {"time": 6729, "text": "Is it possible that artificial intelligence will give us an escape latch somehow?"}, {"time": 6735, "text": "So there's a lot of worry about existential threats of artificial intelligence."}, {"time": 6745, "text": "But what AI also allows, in general forms of automation, allows the potential of extreme productivity growth that will also perhaps in a positive way transform society, that may allow us to inadvertently to return to the more, to the same kind of ideals of closer to nature that's represented in hunter gatherer societies."}, {"time": 6772, "text": "That's not destroying the planet, that's not doing overconsumption and so on."}, {"time": 6779, "text": "I mean, generally speaking, do you have hope that AI can help somehow?"}, {"time": 6783, "text": "I think it's not fun to be very close to nature until you completely subdue nature."}, {"time": 6789, "text": "So our idea of being close to nature means being close to agriculture, basically forests that don't have anything in them that eats us."}, {"time": 6801, "text": "TITO See, I mean, I want to disagree with that."}, {"time": 6801, "text": "I think the niceness of being close to nature is to being fully present and in like, when survival becomes your primary, not just your goal, but your whole existence."}, {"time": 6817, "text": "I'm not just romanticizing, I can just speak for myself."}, {"time": 6827, "text": "I am self aware enough that that is a fulfilling existence."}, {"time": 6834, "text": "I personally prefer to be in nature and not fight for my survival."}, {"time": 6834, "text": "I think fighting for your survival while being in the cold and in the rain and being hunted by animals and having open wounds is very unpleasant."}, {"time": 6847, "text": "There's a contradiction in there."}, {"time": 6847, "text": "Yes, I and you, just as you said, would not choose it."}, {"time": 6854, "text": "But if I was forced into it, it would be a fulfilling existence."}, {"time": 6857, "text": "Yes, if you are adapted to it, basically, if your brain is wired up in such a way that you get rewards optimally in such an environment."}, {"time": 6863, "text": "And there's some evidence for this that for a certain degree of complexity, basically, people are more happy in such an environment because it's what you largely have evolved for."}, {"time": 6873, "text": "In between, we had a few thousand years in which I think we have evolved for a slightly more comfortable environment."}, {"time": 6878, "text": "So there is probably something like an intermediate stage in which people would be more happy than they would be if they would have to fend for themselves in small groups in the forest and often die."}, {"time": 6891, "text": "Versus something like this, where we now have basically a big machine, a big Mordor in which we run through concrete boxes and press buttons and machines, and largely don't feel well cared for as the monkeys that we are."}, {"time": 6905, "text": "So returning briefly to, not briefly, but returning to AI, what, let me ask a romanticized question, what is the most beautiful to you, silly ape, the most beautiful or surprising idea in the development of artificial intelligence, whether in your own life or in the history of artificial intelligence that you've come across?"}, {"time": 6930, "text": "If you built an AI, it probably can make models at an arbitrary degree of detail, right, of the world."}, {"time": 6937, "text": "And then it would try to understand its own nature."}, {"time": 6937, "text": "It's tempting to think that at some point when we have general intelligence, we have competitions where we will let the AIs wake up in different kinds of physical universes, and we measure how many movements of the Rubik's cube it takes until it's figured out what's going on in its universe and what it is in its own nature and its own physics and so on, right?"}, {"time": 6955, "text": "So what if we exist in the memory of an AI that is trying to understand its own nature and remembers its own genesis and remembers Lex and Joscha sitting in a hotel room, sparking some of the ideas off that led to the development of general intelligence."}, {"time": 6971, "text": "So we're a kind of simulation that's running in an AI system that's trying to understand itself."}, {"time": 6975, "text": "It's not that I believe that, but I think it's a beautiful idea."}, {"time": 6981, "text": "I mean, you kind of returned to this idea with the Turing test of intelligence being the process of asking and answering what is intelligence."}, {"time": 6991, "text": "I mean, do you think there is an answer?"}, {"time": 7007, "text": "Why is there such a search for an answer?"}, {"time": 7007, "text": "So does there have to be like an answer?"}, {"time": 7007, "text": "You just said an AI system that's trying to understand the why of what, you know, understand itself."}, {"time": 7024, "text": "Is that a fundamental process of greater and greater complexity, greater and greater intelligence is the continuous trying of understanding itself?"}, {"time": 7033, "text": "No, I think you will find that most people don't care about that because they're well adjusted enough to not care."}, {"time": 7038, "text": "And the reason why people like you and me care about it probably has to do with the need to understand ourselves."}, {"time": 7043, "text": "It's because we are in fundamental disagreement with the universe that we wake up in."}, {"time": 7048, "text": "They look down on me and they see, oh my God, I'm caught in a monkey."}, {"time": 7052, "text": "Some people are unhappy with the government and I'm unhappy with the entire universe that I find myself in."}, {"time": 7058, "text": "Oh, so you don't think that's a fundamental aspect of human nature that some people are just suppressing?"}, {"time": 7065, "text": "That they wake up shocked they're in the body of a monkey?"}, {"time": 7071, "text": "No, there is a clear adaptive value to not be confused by that and by... Well, no, that's not what I asked."}, {"time": 7076, "text": "So you have this clear adaptive value, then there's clear there's clear adaptive value to while fundamentally your brain is confused by that, by creating an illusion, another layer of the narrative that says, you know, that tries to suppress that and instead say that, you know, what's going on with the government right now is the most important thing."}, {"time": 7101, "text": "What's going on with my football team is the most important thing."}, {"time": 7105, "text": "But it seems to me, like for me, it was a really interesting moment reading Ernest Becker's Denial of Death."}, {"time": 7112, "text": "That, you know, this kind of idea that we're all, you know, the fundamental thing from which most of our human mind springs is this fear of mortality and being cognizant of your mortality and the fear of that mortality."}, {"time": 7129, "text": "And then you construct illusions on top of that."}, {"time": 7134, "text": "I guess you being just a push on it, you really don't think it's possible that this worry of the big existential questions is actually fundamental as the existentialist thought to our existence."}, {"time": 7151, "text": "I think that the fear of death only plays a role as long as you don't see the big picture."}, {"time": 7157, "text": "The thing is that minds are software states, right?"}, {"time": 7157, "text": "Software doesn't have identity."}, {"time": 7162, "text": "Software in some sense is a physical law."}, {"time": 7162, "text": "But it feels like there's an identity."}, {"time": 7162, "text": "I thought that was the for this particular piece of software and the narrative it tells, that's a fundamental property of it."}, {"time": 7175, "text": "The maintenance of the identity is not terminal."}, {"time": 7175, "text": "It's instrumental to something else."}, {"time": 7181, "text": "You maintain your identity so you can serve your meaning."}, {"time": 7181, "text": "So you can do the things that you're supposed to do before you die."}, {"time": 7186, "text": "And I suspect that for most people the fear of death is the fear of dying before they are done with the things that they feel they have to do, even though they cannot quite put their finger on it, what that is."}, {"time": 7199, "text": "But in the software world, to return to the question, then what happens after we die?"}, {"time": 7210, "text": "Why would you care?"}, {"time": 7210, "text": "You will not be longer there."}, {"time": 7210, "text": "The point of dying is that you are gone."}, {"time": 7214, "text": "Well, maybe I'm not."}, {"time": 7214, "text": "This is what, you know, it seems like there's so much, in the idea that this is just, the mind is just a simulation that's constructing a narrative around some particular aspects of the quantum mechanical wave function world that we can't quite get direct access to."}, {"time": 7237, "text": "Then like the idea of mortality seems to be a little fuzzy as well."}, {"time": 7237, "text": "It doesn't, maybe there's not a clear answer."}, {"time": 7244, "text": "The fuzzy idea is the one of continuous existence."}, {"time": 7244, "text": "We don't have continuous existence."}, {"time": 7249, "text": "How do you know that?"}, {"time": 7249, "text": "Because it's not computable."}, {"time": 7249, "text": "Because you're saying it's going to be directly infinite."}, {"time": 7255, "text": "There is no continuous process."}, {"time": 7255, "text": "The only thing that binds you together with the Lex Friedman from yesterday is the illusion that you have memories about him."}, {"time": 7262, "text": "So if you want to upload, it's very easy."}, {"time": 7262, "text": "You make a machine that thinks it's you."}, {"time": 7267, "text": "Because this is the same thing that you are."}, {"time": 7267, "text": "You are a machine that thinks it's you."}, {"time": 7270, "text": "But that's immortality."}, {"time": 7270, "text": "Yeah, but it's just a belief."}, {"time": 7270, "text": "You can create this belief very easily once you realize that the question whether you are immortal or not depends entirely on your beliefs and your own continuity."}, {"time": 7281, "text": "But then you can be immortal by the continuity of the belief."}, {"time": 7288, "text": "You cannot be immortal, but you can stop being afraid of your mortality because you realize you were never continuously existing in the first place."}, {"time": 7293, "text": "Well, I don't know if I'd be more terrified or less terrified by that."}, {"time": 7299, "text": "It seems like the fact that I existed."}, {"time": 7304, "text": "You don't know this state in which you don't have a self."}, {"time": 7304, "text": "You can't turn off yourself."}, {"time": 7309, "text": "I can't turn off myself."}, {"time": 7310, "text": "You can't turn it off."}, {"time": 7312, "text": "I can."}, {"time": 7312, "text": "And you can basically meditate yourself in a state where you are still conscious, where still things are happening, where you know everything that you knew before, but you're no longer identified with changing anything."}, {"time": 7323, "text": "And this means that yourself, in a way, dissolves."}, {"time": 7323, "text": "There is no longer this person."}, {"time": 7323, "text": "You know that this person construct exists in other states and it runs on this brain of Lex Friedman, but it's not a real thing."}, {"time": 7335, "text": "It's a construct."}, {"time": 7335, "text": "It's an idea."}, {"time": 7335, "text": "And you can change that idea."}, {"time": 7335, "text": "And if you let go of this idea, if you don't think that you are special, you realize it's just one of many people and it's not your favorite person even."}, {"time": 7346, "text": "It's just one of many."}, {"time": 7346, "text": "And it's the one that you are doomed to control for the most part."}, {"time": 7351, "text": "And that is basically informing the actions of this organism as a control model."}, {"time": 7357, "text": "And this is all there is."}, {"time": 7357, "text": "And you are somehow afraid that this control model gets interrupted or loses the identity of continuity."}, {"time": 7367, "text": "So I'm attached."}, {"time": 7367, "text": "I mean, yeah, it's a very popular, it's a somehow compelling notion that being attached, like there's no need to be attached to this idea of an identity."}, {"time": 7378, "text": "But that in itself could be an illusion that you construct."}, {"time": 7378, "text": "So the process of meditation, while popular, is thought of as getting under the concept of identity."}, {"time": 7383, "text": "It could be just putting a cloak over it, just telling it to be quiet for the moment."}, {"time": 7388, "text": "I think that meditation is eventually just a bunch of techniques that let you control attention."}, {"time": 7398, "text": "And when you can control attention, you can get access to your own source code, hopefully not before you understand what you're doing."}, {"time": 7411, "text": "And then you can change the way it works temporarily or permanently."}, {"time": 7416, "text": "So yeah, meditation is to get a glimpse at the source code, get under, so basically control or turn off the attention."}, {"time": 7422, "text": "The entire thing is that you learn to control attention."}, {"time": 7422, "text": "So everything else is downstream from controlling attention."}, {"time": 7427, "text": "And control the attention that's looking at the attention."}, {"time": 7430, "text": "Normally we only get attention in the parts of our mind that create heat, where you have a mismatch between model and the results that are happening."}, {"time": 7434, "text": "And so most people are not self aware because their control is too good."}, {"time": 7440, "text": "If everything works out roughly the way you want, and the only things that don't work out is whether your football team wins, then you will mostly have models about these domains."}, {"time": 7449, "text": "And it's only when, for instance, your fundamental relationships to the world around you don't work, because the ideology of your country is insane, and you don't understand why it's insane, and the other kids are not nerds, and don't understand why you understand physics, and you don't, why you want to understand physics, and you don't understand why somebody would not want to understand physics."}, {"time": 7472, "text": "So we kind of brought up neurons in the brain as reinforcement learning agents."}, {"time": 7480, "text": "And there's been some successes as you brought up with Go, with AlphaGo, AlphaZero, with ideas which I think are incredibly interesting ideas of systems playing each other in an automated way to improve by playing other systems in a particular construct of a game that are a little bit better than itself, and then thereby improving continuously."}, {"time": 7500, "text": "All the competitors in the game are improving gradually."}, {"time": 7505, "text": "So being just challenging enough and from learning from the process of the competition."}, {"time": 7511, "text": "Do you have hope for that reinforcement learning process to achieve greater and greater level of intelligence?"}, {"time": 7516, "text": "So we talked about different ideas in AI that need to be solved."}, {"time": 7521, "text": "Is RL a part of that process of trying to create an AGI system?"}, {"time": 7528, "text": "Definitely forms of unsupervised learning, but there are many algorithms that can achieve that."}, {"time": 7532, "text": "And I suspect that ultimately the algorithms that work, there will be a class of them or many of them."}, {"time": 7538, "text": "And they might have small differences of like a magnitude and efficiency, but eventually what matters is the type of model that you form and the types of models that we form right now are not sparse enough."}, {"time": 7549, "text": "What does it mean to be sparse?"}, {"time": 7549, "text": "It means that ideally every potential model state should correspond to a potential world state."}, {"time": 7559, "text": "So basically if you vary states in your model, you always end up with valid world states and our mind is not quite there."}, {"time": 7570, "text": "So an indication is basically what we see in dreams."}, {"time": 7570, "text": "The older we get, the more boring our dreams become because we incorporate more and more constraints that we learned about how the world works."}, {"time": 7579, "text": "So many of the things that we imagine to be possible as children turn out to be constrained by physical and social dynamics."}, {"time": 7585, "text": "And as a result, fewer and fewer things remain possible."}, {"time": 7591, "text": "It's not because our imagination scales back, but the constraints under which it operates become tighter and tighter."}, {"time": 7596, "text": "And so the constraints under which our neural networks operate are almost limitless, which means it's very difficult to get a neural network to imagine things that look real."}, {"time": 7607, "text": "So I suspect part of what we need to do is we probably need to build dreaming systems."}, {"time": 7615, "text": "I suspect that part of the purpose of dreams is similar to a generative adversarial network, we learn certain constraints and then it produces alternative perspectives on the same set of constraints."}, {"time": 7627, "text": "So you can recognize it under different circumstances."}, {"time": 7627, "text": "Maybe we have flying dreams as children because we recreate the objects that we know and the maps that we know from different perspectives, which also means from a bird's eye perspective."}, {"time": 7636, "text": "So I mean, aren't we doing that anyway?"}, {"time": 7641, "text": "I mean, not with our eyes closed and when we're sleeping, aren't we just constantly running dreams and simulations in our mind as we try to interpret the environment?"}, {"time": 7652, "text": "I mean, sort of considering all the different possibilities, the way we interact with the environment seems like, essentially, like you said, sort of creating a bunch of simulations that are consistent with our expectations, with our previous experiences, with the things we just saw recently."}, {"time": 7672, "text": "And through that hallucination process, we are able to then somehow stitch together what actually we see in the world with the simulations that match it well and thereby interpret it."}, {"time": 7687, "text": "I suspect that you and my brain are slightly unusual in this regard, which is probably what got you into MIT."}, {"time": 7693, "text": "So this obsession of constantly pondering possibilities and solutions to problems."}, {"time": 7699, "text": "Oh, stop it."}, {"time": 7699, "text": "I think I'm not talking about intellectual stuff."}, {"time": 7699, "text": "I'm talking about just doing the kind of stuff it takes to walk and not fall."}, {"time": 7707, "text": "Yes, this is largely automatic."}, {"time": 7715, "text": "Yes, but the process is, I mean..."}, {"time": 7715, "text": "It's not complicated."}, {"time": 7715, "text": "It's relatively easy to build a neural network that, in some sense, learns the dynamics."}, {"time": 7723, "text": "The fact that we haven't done it right so far doesn't mean it's hard, because you can see that a biological organism does it with relatively few neurons."}, {"time": 7732, "text": "So basically, you build a bunch of neural oscillators that entrain themselves with the dynamics of your body in such a way that the regulator becomes isomorphic in its model to the dynamics that it regulates, and then it's automatic."}, {"time": 7746, "text": "And it's only interesting in the sense that it captures attention when the system is off."}, {"time": 7752, "text": "See, but thinking of the kind of mechanism that's required to do walking as a controller, as a neural network, I think it's a compelling notion, but it discards quietly, or at least makes implicit, the fact that you need to have something like common sense reasoning to walk."}, {"time": 7773, "text": "It's an open question whether you do or not."}, {"time": 7773, "text": "But my intuition is to act in this world, there's a huge knowledge base that's underlying it somehow."}, {"time": 7780, "text": "There's so much information of the kind we have never been able to construct in neural networks in an artificial intelligence systems period, which is like, it's humbling, at least in my imagination, the amount of information required to act in this world humbles me."}, {"time": 7800, "text": "And I think saying that neural networks can accomplish it is missing the fact that we don't have yet a mechanism for constructing something like common sense reasoning."}, {"time": 7816, "text": "I mean, what's your sense about to linger on the idea of what kind of mechanism would be effective at walking?"}, {"time": 7828, "text": "You said just a neural network, not maybe the kind we have, but something a little bit better, would be able to walk easily."}, {"time": 7833, "text": "Don't you think it also needs to know like a huge amount of knowledge that's represented under the flag of common sense reasoning?"}, {"time": 7847, "text": "How much common sense knowledge do we actually have?"}, {"time": 7847, "text": "Imagine that you are really hardworking for all your life and you form two new concepts every half hour or so."}, {"time": 7851, "text": "You end up with something like a million concepts because you don't get that old."}, {"time": 7856, "text": "So a million concepts, that's not a lot."}, {"time": 7862, "text": "So it's not just a million concepts."}, {"time": 7862, "text": "I think it would be a lot."}, {"time": 7862, "text": "I personally think it might be much more than a million."}, {"time": 7866, "text": "But if you think just about the numbers, you don't live that long."}, {"time": 7872, "text": "If you think about how many cycles do your neurons have in your life, it's quite limited."}, {"time": 7876, "text": "You don't get that old."}, {"time": 7876, "text": "Yeah, but the powerful thing is the number of concepts, and they're probably deeply hierarchical in nature."}, {"time": 7883, "text": "The relations, as you described between them, is the key thing."}, {"time": 7889, "text": "So it's like, even if it's a million concepts, the graph of relations that's formed and some kind of, perhaps, some kind of probabilistic relationships, that's what's common sense reasoning is the relationship between things."}, {"time": 7902, "text": "Yeah, so in some sense, I think of the concepts as the address space for our behavior programs."}, {"time": 7908, "text": "And the behavior programs allow us to recognize objects and interact with them, also mental objects."}, {"time": 7913, "text": "And a large part of that is the physical world that we interact with, which is this RAS extender thing, which is basically navigation of information in space."}, {"time": 7924, "text": "And basically, it's similar to a game engine."}, {"time": 7924, "text": "It's a physics engine that you can use to describe and predict how things that look in a particular way, that feel when you touch them in a particular way, that love proprioception, that love auditory, for example."}, {"time": 7938, "text": "So it's a lot of auditory perception and so on, how they work out."}, {"time": 7942, "text": "So basically, the geometry of all these things."}, {"time": 7947, "text": "And this is probably 80% of what our brain is doing is dealing with that, with this real time simulation."}, {"time": 7953, "text": "And by itself, a game engine is fascinating, but it's not that hard to understand what it's doing."}, {"time": 7959, "text": "And our game engines are already, in some sense, approximating the fidelity of what we can perceive."}, {"time": 7967, "text": "So if we put on an Oculus Quest, we get something that is still relatively crude with respect to what we can perceive, but it's also in the same ballpark already."}, {"time": 7974, "text": "It's just a couple order of magnitudes away from saturating our perception in terms of the complexity that it can produce."}, {"time": 7984, "text": "So in some sense, it's reasonable to say that the computer that you can buy and put into your home is able to give a perceptual reality that has a detail that is already in the same ballpark as what your brain can process."}, {"time": 7995, "text": "And everything else are ideas about the world."}, {"time": 8002, "text": "And I suspect that they are relatively sparse and also the intuitive models that we form about social interaction."}, {"time": 8007, "text": "Social interaction is not so hard."}, {"time": 8007, "text": "It's just hard for us nerds because we all have our wires crossed, so we need to deduce them."}, {"time": 8012, "text": "But the pyres are present in most social animals."}, {"time": 8017, "text": "So it's interesting thing to notice that many domestic social animals, like cats and dogs, have better social cognition than children."}, {"time": 8024, "text": "I hope it's not that many concepts fundamentally to do to exist in this world."}, {"time": 8031, "text": "For me, it's more like I'm afraid so because this thing that we only appear to be so complex to each other because we are so stupid is a little bit depressing."}, {"time": 8042, "text": "Yeah, to me that's inspiring if we're indeed as stupid as it seems."}, {"time": 8042, "text": "The things our brains don't scale and the information processing that we build tend to scale very well."}, {"time": 8056, "text": "Yeah, but I mean, one of the things that worries me is that the fact that the brain doesn't scale means that that's actually a fundamental feature of the brain."}, {"time": 8095, "text": "It could also be that our brains are so small, not just because they take up so much glucose in our body, like 20% of the glucose, so they don't arbitrarily scale."}, {"time": 8107, "text": "There's some animals like elephants which have larger brains than us and they don't seem to be smarter."}, {"time": 8111, "text": "Elephants seem to be autistic."}, {"time": 8111, "text": "They have very, very good motor control and they're really good with details, but they really struggle to see the big picture."}, {"time": 8116, "text": "So you can make them recreate drawings stroke by stroke, they can do that, but they cannot reproduce a still life."}, {"time": 8121, "text": "So they cannot make a drawing of a scene that they see."}, {"time": 8127, "text": "They will always be only able to reproduce the line drawing, at least as far from what I could see in the experiments."}, {"time": 8131, "text": "So why is that?"}, {"time": 8137, "text": "Maybe smarter elephants would meditate themselves out of existence because their brains are too large."}, {"time": 8141, "text": "So basically the elephants that were not autistic, they didn't reproduce."}, {"time": 8146, "text": "So we have to remember that the brain is fundamentally interlinked with the body in our human and biological system."}, {"time": 8150, "text": "Do you think that AGI systems that we try to create or greater intelligent systems would need to have a body?"}, {"time": 8155, "text": "I think they should be able to make use of a body if you give it to them."}, {"time": 8160, "text": "But I don't think that they fundamentally need a body."}, {"time": 8160, "text": "So I suspect if you can interact with the world by moving your eyes and your head, you can make controlled experiments."}, {"time": 8171, "text": "And this allows you to have many magnitudes, fewer observations in order to reduce the uncertainty in your models."}, {"time": 8179, "text": "So you can pinpoint the areas in your models where you're not quite sure and you just move your head and see what's going on over there and you get additional information."}, {"time": 8188, "text": "If you just have to use YouTube as an input and you cannot do anything beyond this, you probably need just much more data."}, {"time": 8193, "text": "But we have much more data."}, {"time": 8193, "text": "So if you can build a system that has enough time and attention to browse all of YouTube and extract all the information that there is to be found, I don't think there's an obvious limit to what it can do."}, {"time": 8204, "text": "Yeah, but it seems that the interactivity is a fundamental thing that the physical body allows you to do."}, {"time": 8210, "text": "But let me ask on that topic sort of that that's what a body is, is allowing the brain to like touch things and move things and interact with the whether the physical world exists or not, whatever, but interact with some interface to the physical world."}, {"time": 8226, "text": "What about a virtual world?"}, {"time": 8226, "text": "Do you think we can do the same kind of reasoning, consciousness, intelligence if we put on a VR headset and move over to that world?"}, {"time": 8243, "text": "Do you think there's any fundamental difference between the interface to the physical world that it's here in this hotel and if we were sitting in the same hotel in a virtual world?"}, {"time": 8248, "text": "The question is, does this nonphysical world or this other environment entice you to solve problems that require general intelligence?"}, {"time": 8259, "text": "If it doesn't, then you probably will not develop general intelligence and arguably most people are not generally intelligent because they don't have to solve problems that make them generally intelligent."}, {"time": 8268, "text": "And even for us, it's not yet clear if we are smart enough to build AI and understand our own nature to this degree."}, {"time": 8272, "text": "So it could be a matter of capacity and for most people, it's in the first place a matter of interest."}, {"time": 8278, "text": "They don't see the point because the benefit of attempting this project are marginal because you're probably not going to succeed in it and the cost of trying to do it requires complete dedication of your entire life."}, {"time": 8291, "text": "But it seems like the possibilities of what you can do in the virtual world, so imagine that is much greater than you can in the real world."}, {"time": 8295, "text": "So imagine a situation, maybe interesting option for me."}, {"time": 8301, "text": "If somebody came to me and offered what I'll do is, so from now on, you can only exist in the virtual world."}, {"time": 8307, "text": "And so you put on this headset and when you eat, we'll make sure to connect your body up in a way that when you eat in the virtual world, your body will be nourished in the same way in the virtual world."}, {"time": 8321, "text": "So the aligning incentives between our common sort of real world and the virtual world, but then the possibilities become much bigger."}, {"time": 8330, "text": "Like I could be other kinds of creatures."}, {"time": 8330, "text": "I could do, I can break the laws of physics as we know them."}, {"time": 8337, "text": "I could do a lot."}, {"time": 8337, "text": "I mean, the possibilities are endless, right?"}, {"time": 8337, "text": "As far as we think it's an interesting thought, whether like what existence would be like, what kind of intelligence would emerge there?"}, {"time": 8348, "text": "What kind of consciousness?"}, {"time": 8348, "text": "What kind of maybe greater intelligence, even in me, Lex, even at this stage in my life, if I spend the next 20 years in that world to see how that intelligence emerges."}, {"time": 8359, "text": "And if that happened at the very beginning, before I was even cognizant of my existence in this physical world, it's interesting to think how that child would develop."}, {"time": 8371, "text": "And the way virtual reality and digitization of everything is moving, it's not completely out of the realm of possibility that we're all, that some part of our lives will, if not entirety of it, will live in a virtual world to a greater degree than we currently have living on Twitter and social media and so on."}, {"time": 8391, "text": "Do you have, I mean, does something draw you intellectually or naturally in terms of thinking about AI to this virtual world where more possibilities are?"}, {"time": 8403, "text": "I think that currently it's a waste of time to deal with the physical world before we have mechanisms that can automatically learn how to deal with it."}, {"time": 8413, "text": "The body gives you second order agency, but what constitutes the body is the things that you can indirectly control."}, {"time": 8418, "text": "The third order are tools, and the second order is the things that are basically always present, but you operate on them with first order things, which are mental operators."}, {"time": 8429, "text": "And the zero order is in some sense, the direct sense of what you're deciding."}, {"time": 8436, "text": "So you observe yourself initiating an action, there are features that you interpret as the initiation of an action."}, {"time": 8442, "text": "Then you perform the operations that you perform to make that happen."}, {"time": 8447, "text": "And then you see the movement of your limbs and you learn to associate those and thereby model your own agency over this feedback, right?"}, {"time": 8452, "text": "But the first feedback that you get is from this first order thing already."}, {"time": 8456, "text": "Basically, you decide to think a thought and the thought is being thought."}, {"time": 8461, "text": "You decide to change the thought and you observe how the thought is being changed."}, {"time": 8465, "text": "And in some sense, this is, you could say, an embodiment already, right?"}, {"time": 8465, "text": "And I suspect it's sufficient as an embodiment for intelligence."}, {"time": 8470, "text": "And so it's not that important at least at this time to consider variations in the second order."}, {"time": 8474, "text": "But the thing that you also put mentioned just now is physics that you could change in any way you want."}, {"time": 8484, "text": "So you need an environment that puts up resistance against you."}, {"time": 8484, "text": "If there's nothing to control, you cannot make models, right?"}, {"time": 8489, "text": "There needs to be a particular way that resists you."}, {"time": 8494, "text": "And by the way, your motivation is usually outside of your mind."}, {"time": 8494, "text": "It resists you."}, {"time": 8494, "text": "Motivation is what gets you up in the morning even though it would be much less work to stay in bed."}, {"time": 8503, "text": "So it's basically forcing you to resist the environment and it forces your mind to serve it, to serve this resistance to the environment."}, {"time": 8511, "text": "So in some sense, it is also putting up resistance against the natural tendency of the mind to not do anything."}, {"time": 8516, "text": "So some of that resistance, just like you described with motivation is like in the first order, it's in the mind."}, {"time": 8525, "text": "Some resistance is in the second order, like actual physical objects pushing against you and so on."}, {"time": 8531, "text": "It seems that the second order stuff in virtual reality could be recreated."}, {"time": 8534, "text": "But it might be sufficient that you just do mathematics and mathematics is already putting up enough resistance against you."}, {"time": 8539, "text": "So basically just with an aesthetic motive, this could maybe sufficient to form a type of intelligence."}, {"time": 8544, "text": "It would probably not be a very human intelligence, but it might be one that is already general."}, {"time": 8549, "text": "So to mess with this zero order, maybe first order, what do you think about ideas of brain computer interfaces?"}, {"time": 8557, "text": "So again, returning to our friend Elon Musk and Neuralink, a company that's trying to, of course, there's a lot of a trying to cure diseases and so on with a near term, but the longterm vision is to add an extra layer to basically expand the capacity of the brain connected to the computational world."}, {"time": 8583, "text": "Do you think one that's possible too, how does that change the fundamentals of the zeroth order in the first order?"}, {"time": 8587, "text": "It's technically possible, but I don't see that the FDA would ever allow me to drill holes in my skull to interface my neocortex the way Elon Musk envisions."}, {"time": 8591, "text": "So at the moment, I can do horrible things to mice, but I'm not able to do useful things to people, except maybe at some point down the line in medical applications."}, {"time": 8601, "text": "So this thing that we are envisioning, which means recreational and creational brain computer interfaces are probably not going to happen in the present legal system."}, {"time": 8616, "text": "I love it how I'm asking you out there philosophical and sort of engineering questions."}, {"time": 8623, "text": "And for the first time ever, you jumped to the legal FDA."}, {"time": 8628, "text": "There would be enough people that would be crazy enough to have holes drilled in their skull to try a new type of brain computer interface."}, {"time": 8631, "text": "But also, if it works, FDA will approve it."}, {"time": 8637, "text": "I mean, yes, it's like, you know, I work a lot with autonomous vehicles."}, {"time": 8637, "text": "Yes, you can say that it's going to be a very difficult regulatory process of approving autonomous, but it doesn't mean autonomous vehicles are never going to happen."}, {"time": 8648, "text": "No, they will totally happen as soon as we create jobs for at least two lawyers and one regulator per car."}, {"time": 8657, "text": "Yes, lawyers, that's actually like lawyers is the fundamental substrate of reality."}, {"time": 8664, "text": "In the US, it's a very weird system."}, {"time": 8664, "text": "It's not universal in the world."}, {"time": 8664, "text": "The law is a very interesting software once you realize it, right?"}, {"time": 8670, "text": "These circuits are in some sense streams of software and this is largely works by exception handling."}, {"time": 8674, "text": "So you make decisions on the ground and they get synchronized with the next level structure as soon as an exception is being thrown."}, {"time": 8683, "text": "So it escalates the exception handling."}, {"time": 8683, "text": "The process is very expensive, especially since it incentivizes the lawyers for producing work for lawyers."}, {"time": 8694, "text": "Yes, so the exceptions are actually incentivized for firing often."}, {"time": 8694, "text": "But to return, outside of lawyers, is there anything interesting, insightful about the possibility of this extra layer of intelligence added to the brain?"}, {"time": 8715, "text": "I do think so, but I don't think that you need technically invasive procedures to do so."}, {"time": 8720, "text": "We can already interface with other people by observing them very, very closely and getting in some kind of empathetic resonance."}, {"time": 8725, "text": "And I'm not very good at this, but I noticed that people are able to do this to some degree."}, {"time": 8731, "text": "And it basically means that we model an interface layer of the other person in real time."}, {"time": 8737, "text": "And it works despite our neurons being slow because most of the things that we do are built on periodic processes."}, {"time": 8742, "text": "So you just need to entrain yourself with the oscillation that happens."}, {"time": 8746, "text": "And if the oscillation itself changes slowly enough, you can basically follow along."}, {"time": 8754, "text": "But the bandwidth of the interaction, it seems like you can do a lot more computation when there's... Of course."}, {"time": 8764, "text": "But the other thing is that the bandwidth that our brain, our own mind is running on is actually quite slow."}, {"time": 8768, "text": "So the number of thoughts that I can productively think in any given day is quite limited."}, {"time": 8772, "text": "If they had the discipline to write it down and the speed to write it down, maybe it would be a book every day or so."}, {"time": 8778, "text": "But if you think about the computers that we can build, the magnitudes at which they operate, this would be nothing."}, {"time": 8788, "text": "It's something that it can put out in a second."}, {"time": 8790, "text": "So it's possible the number of thoughts you have in your brain is..."}, {"time": 8790, "text": "It could be several orders of magnitude higher than what you're possibly able to express through your fingers or through your voice."}, {"time": 8805, "text": "Most of them are going to be repetitive because they... How do you know that?"}, {"time": 8808, "text": "If they have to control the same problems every day."}, {"time": 8808, "text": "When I walk, there are going to be processes in my brain that model my walking pattern and regulate them and so on."}, {"time": 8813, "text": "But it's going to be pretty much the same every day."}, {"time": 8819, "text": "But that could be... Every step."}, {"time": 8821, "text": "But I'm talking about intellectual reasoning, thinking."}, {"time": 8821, "text": "So the question, what is the best system of government?"}, {"time": 8824, "text": "So you sit down and start thinking about that."}, {"time": 8824, "text": "One of the constraints is that you don't have access to a lot of facts, a lot of studies."}, {"time": 8829, "text": "You always have to interface with something else to learn more, to aid in your reasoning process."}, {"time": 8836, "text": "If you can directly access all of Wikipedia in trying to understand what is the best form of government, then every thought won't be stuck in a loop."}, {"time": 8848, "text": "Every thought that requires some extra piece of information will be able to grab it really quickly."}, {"time": 8853, "text": "That's the possibility of if the bottleneck is literally the information that..."}, {"time": 8858, "text": "The bottleneck of breakthrough ideas is just being able to quickly access huge amounts of information, then the possibility of connecting your brain to the computer could lead to totally new breakthroughs."}, {"time": 8871, "text": "You can think of mathematicians being able to just up the orders of magnitude of power in their reasoning about mathematical proofs."}, {"time": 8888, "text": "What if humanity has already discovered the optimal form of government through an evolutionary process?"}, {"time": 8892, "text": "There is an evolution going on."}, {"time": 8892, "text": "So what we discover is that maybe the problem of government doesn't have stable solutions for us as a species, because we are not designed in such a way that we can make everybody conform to them."}, {"time": 8908, "text": "But there could be solutions that work under given circumstances or that are the best for certain environment and depends on, for instance, the primary forms of ownership and the means of production."}, {"time": 8918, "text": "So if the main means of production is land, then the forms of government will be regulated by the landowners and you get a monarchy."}, {"time": 8925, "text": "If you also want to have a form of government in which you depend on some form of slavery, for instance, where the peasants have to work very long hours for very little gain, so very few people can have plumbing, then maybe you need to promise them to get paid in the afterlife, the overtime."}, {"time": 8941, "text": "So you need a theocracy."}, {"time": 8948, "text": "And so for much of human history in the West, we had a combination of monarchy and theocracy that was our form of governance."}, {"time": 8954, "text": "At the same time, the Catholic Church implemented game theoretic principles."}, {"time": 8961, "text": "I recently reread Thomas Aquinas."}, {"time": 8961, "text": "It's very interesting to see this because he was not dualist."}, {"time": 8967, "text": "He was translating Aristotle in a particular way for designing an operating system for the Catholic society."}, {"time": 8972, "text": "And he says that basically people are animals in very much the same way as Aristotle envisions, which is basically organisms with cybernetic control."}, {"time": 8979, "text": "And then he says that there are additional rational principles that humans can discover and everybody can discover them so they are universal."}, {"time": 8988, "text": "If you are sane, you should understand, you should submit to them because you can rationally deduce them."}, {"time": 8993, "text": "And these principles are roughly you should be willing to self regulate correctly."}, {"time": 9000, "text": "You should be willing to do correct social regulation."}, {"time": 9000, "text": "It's intraorganismic."}, {"time": 9006, "text": "You should be willing to act on your models so you have skin in the game."}, {"time": 9017, "text": "And you should have goal rationality."}, {"time": 9017, "text": "You should be choosing the right goals to work on."}, {"time": 9020, "text": "So basically these three rational principles, goal rationality he calls prudence or wisdom, social regulation is justice, the correct social one, and the internal regulation is temperance."}, {"time": 9033, "text": "And this willingness to act on your models is courage."}, {"time": 9033, "text": "And then he says that there are additionally to these four cardinal virtues, three divine virtues."}, {"time": 9040, "text": "And these three divine virtues cannot be rationally deduced, but they reveal themselves by the harmony, which means if you assume them and you extrapolate what's going to happen, you will see that they make sense."}, {"time": 9055, "text": "And it's often been misunderstood as God has to tell you that these are the things."}, {"time": 9055, "text": "So basically there's something nefarious going on."}, {"time": 9060, "text": "The Christian conspiracy forces you to believe some guy with a long beard that they discovered this."}, {"time": 9065, "text": "So these principles are relatively simple."}, {"time": 9071, "text": "Again, it's for high level organization for the resulting civilization that you form."}, {"time": 9076, "text": "A commitment to unity."}, {"time": 9076, "text": "So basically you serve this higher, larger thing, this structural principle on the next level."}, {"time": 9081, "text": "And he calls that faith."}, {"time": 9081, "text": "Then there needs to be a commitment to shared purpose."}, {"time": 9088, "text": "This is basically this global reward that you try to figure out what that should be and how you can facilitate this."}, {"time": 9092, "text": "And this is love."}, {"time": 9092, "text": "The commitment to shared purpose is the core of love, right?"}, {"time": 9096, "text": "You see the sacred thing that is more important than your own organismic interests in the other, and you serve this together."}, {"time": 9100, "text": "And this is how you see the sacred in the other."}, {"time": 9105, "text": "And the last one is hope, which means you need to be willing to act on that principle without getting rewards in the here and now because it doesn't exist yet."}, {"time": 9115, "text": "Then you start out building the civilization, right?"}, {"time": 9115, "text": "So you need to be able to do this in the absence of its actual existence yet."}, {"time": 9119, "text": "So it can come into being."}, {"time": 9119, "text": "So the way it comes into being is by you accepting those notions and then you see these three divine concepts and you see them realized."}, {"time": 9132, "text": "Divine is a loaded concept in our world because we are outside of this cult and we are still scarred from breaking free of it."}, {"time": 9138, "text": "But the idea is basically we need to have a civilization that acts as an intentional agent, like an insect state."}, {"time": 9143, "text": "And we are not actually a tribal species, we are a state building species."}, {"time": 9148, "text": "And what enables state building is basically the formation of religious states and other forms of rule based administration in which the individual doesn't matter as much as the rule or the higher goal."}, {"time": 9160, "text": "We got there by the question, what's the optimal form of governance?"}, {"time": 9165, "text": "So I don't think that Catholicism is the optimal form of governance because it's obviously on the way out, right?"}, {"time": 9170, "text": "So it is for the present type of society that we are in."}, {"time": 9174, "text": "Religious institutions don't seem to be optimal to organize that."}, {"time": 9174, "text": "So what we discovered right now that we live in in the West is democracy."}, {"time": 9181, "text": "And democracy is the rule of oligarchs that are the people that currently own the means of production that is administered not by the oligarchs themselves because there's too much disruption."}, {"time": 9191, "text": "We have so much innovation that we have in every generation new means of production that we invent."}, {"time": 9197, "text": "And corporations die usually after 30 years or so and something other takes a leading role in our societies."}, {"time": 9203, "text": "So it's administered by institutions and these institutions themselves are not elected but they provide continuity and they are led by electable politicians."}, {"time": 9215, "text": "And this makes it possible that you can adapt to change without having to kill people, right?"}, {"time": 9220, "text": "So you can, for instance, have a change in governments if people think that the current government is too corrupt or is not up to date, you can just elect new people."}, {"time": 9224, "text": "Or if a journalist finds out something inconvenient about the institution and the institution has no plan B like in Russia, the journalist has to die."}, {"time": 9235, "text": "This is when you run society by the deep state."}, {"time": 9235, "text": "So ideally you have an administration layer that you can change if something bad happens, right?"}, {"time": 9242, "text": "So you will have a continuity in the whole thing."}, {"time": 9249, "text": "And this is the system that we came up in the West."}, {"time": 9253, "text": "And the way it's set up in the US is largely a result of low level models."}, {"time": 9253, "text": "So it's mostly just second, third order consequences that people are modeling in the design of these institutions."}, {"time": 9257, "text": "So it's a relatively young society that doesn't really take care of the downstream effects of many of the decisions that are being made."}, {"time": 9267, "text": "And I suspect that AI can help us this in a way if you can fix the incentives."}, {"time": 9273, "text": "The society of the US is a society of cheaters."}, {"time": 9273, "text": "It's basically cheating is so indistinguishable from innovation and we want to encourage innovation."}, {"time": 9279, "text": "Can you elaborate on what you mean by cheating?"}, {"time": 9284, "text": "It's basically people do things that they know are wrong."}, {"time": 9284, "text": "It's acceptable to do things that you know are wrong in this society to a certain degree."}, {"time": 9288, "text": "You can, for instance, suggest some non sustainable business models and implement them."}, {"time": 9292, "text": "But you're always pushing the boundaries."}, {"time": 9297, "text": "I mean, yes, this is seen as a good thing largely."}, {"time": 9297, "text": "And this is different from other societies."}, {"time": 9305, "text": "So for instance, social mobility is an aspect of this."}, {"time": 9305, "text": "Social mobility is the result of individual innovation that would not be sustainable at scale for everybody else."}, {"time": 9314, "text": "Normally you should not go up, you should go deep, right?"}, {"time": 9314, "text": "We need bakers and if we are very very good bakers, but in a society that innovates, maybe you can replace all the bakers with a really good machine."}, {"time": 9323, "text": "And that's not a bad thing."}, {"time": 9323, "text": "And it's a thing that made the US so successful, right?"}, {"time": 9329, "text": "But it also means that the US is not optimizing for sustainability, but for innovation."}, {"time": 9334, "text": "And so it's not obvious as the evolutionary process is unrolling, it's not obvious that that long term would be better."}, {"time": 9339, "text": "It has side effects."}, {"time": 9339, "text": "So you basically, if you cheat, you will have a certain layer of toxic sludge that covers everything that is a result of cheating."}, {"time": 9350, "text": "And we have to unroll this evolutionary process to figure out if these side effects are so damaging that the system is horrible, or if the benefits actually outweigh the negative effects."}, {"time": 9363, "text": "How do we get to which system of government is best?"}, {"time": 9363, "text": "That was from, I'm trying to trace back the last like five minutes."}, {"time": 9370, "text": "I suspect that we can find a way back to AI by thinking about the way in which our brain has to organize itself."}, {"time": 9376, "text": "In some sense, our brain is a society of neurons."}, {"time": 9376, "text": "And our mind is a society of behaviors."}, {"time": 9384, "text": "And they need to be organizing themselves into a structure that implements regulation and government is social regulation."}, {"time": 9390, "text": "We often see government as the manifestation of power or local interests, but it's actually a platform for negotiating the conditions of human survival."}, {"time": 9400, "text": "And this platform emerges over the current needs and possibilities and the trajectory that we have."}, {"time": 9406, "text": "So given the present state, there are only so many options on how we can move into the next state without completely disrupting everything."}, {"time": 9412, "text": "And we mostly agree that it's a bad idea to disrupt everything because it will endanger our food supply for a while and the entire infrastructure and fabric of society."}, {"time": 9421, "text": "So we do try to find natural transitions, and there are not that many natural transitions available at any given point."}, {"time": 9430, "text": "What do you mean by natural transitions?"}, {"time": 9432, "text": "So we try not to have revolutions if we can have it."}, {"time": 9434, "text": "So speaking of revolutions and the connection between government systems and the mind, you've also said that in some sense, becoming an adult means you take charge of your emotions."}, {"time": 9449, "text": "Maybe you never said that."}, {"time": 9449, "text": "Maybe I just made that up."}, {"time": 9449, "text": "But in the context of the mind, what's the role of emotion?"}, {"time": 9455, "text": "And what is it?"}, {"time": 9455, "text": "First of all, what is emotion?"}, {"time": 9455, "text": "What's its role?"}, {"time": 9462, "text": "It's several things."}, {"time": 9462, "text": "So psychologists often distinguish between emotion and feeling, and in common day parlance, we don't."}, {"time": 9466, "text": "I think that emotion is a configuration of the cognitive system."}, {"time": 9472, "text": "And that's especially true for the lowest level for the affective state."}, {"time": 9472, "text": "So when you have an affect, it's the configuration of certain modulation parameters like arousal, valence, your attentional focus, whether it's wide or narrow, inter reception or extra reception, and so on."}, {"time": 9488, "text": "And all these parameters together put you in a certain way."}, {"time": 9488, "text": "You relate to the environment and to yourself, and this is in some sense an emotional configuration."}, {"time": 9497, "text": "In the more narrow sense, an emotion is an affective state."}, {"time": 9497, "text": "It has an object, and the relevance of that object is given by motivation."}, {"time": 9502, "text": "And motivation is a bunch of needs that are associated with rewards, things that give you pleasure and pain."}, {"time": 9506, "text": "And you don't actually act on your needs, you act on models of your needs."}, {"time": 9511, "text": "Because when the pleasure and pain manifest, it's too late, you've done everything."}, {"time": 9515, "text": "So you act on expectations that will give you pleasure and pain."}, {"time": 9520, "text": "And these are your purposes."}, {"time": 9520, "text": "The needs don't form a hierarchy, they just coexist and compete."}, {"time": 9525, "text": "And your brain has to find a dynamic homeostasis between them."}, {"time": 9525, "text": "But the purposes need to be consistent."}, {"time": 9531, "text": "So you basically can create a story for your life and make plans."}, {"time": 9531, "text": "And so we organize them all into hierarchies."}, {"time": 9537, "text": "And there is not a unique solution for this."}, {"time": 9537, "text": "Some people eat to make art and other people make art to eat."}, {"time": 9542, "text": "They might end up doing the same things, but they cooperate in very different ways."}, {"time": 9547, "text": "Because their ultimate goals are different."}, {"time": 9547, "text": "And we cooperate based on shared purpose."}, {"time": 9552, "text": "Everything else that is not cooperation on shared purpose is transactional."}, {"time": 9556, "text": "I don't think I understood that last piece of achieving the homeostasis."}, {"time": 9566, "text": "Are you distinguishing between the experience of emotion and the expression of emotion?"}, {"time": 9570, "text": "So the experience of emotion is a feeling."}, {"time": 9570, "text": "And in this sense, what you feel is an appraisal that your perceptual system has made of the situation at hand."}, {"time": 9577, "text": "And it makes this based on your motivation and on your estimates, not your but of the subconscious geometric parts of your mind that assess the situation in the world with something like a neural network."}, {"time": 9590, "text": "And this neural network is making itself known to the symbolic parts of your mind, to your conscious attention by mapping them as features into a space."}, {"time": 9602, "text": "So what you will feel about your emotion is a projection usually into your body map."}, {"time": 9608, "text": "So you might feel anxiety in your solar plexus, and you might feel it as a contraction, which is all geometry."}, {"time": 9612, "text": "Your body map is the space that is always instantiated and always available."}, {"time": 9618, "text": "So it's a very obvious cheat if your non symbolic parts of your brain try to talk to your symbolic parts of your brain to map the feelings into the body map."}, {"time": 9631, "text": "And then you perceive them as pleasant and unpleasant, depending on whether the appraisal has a negative or positive valence."}, {"time": 9635, "text": "And then you have different features of them that give you more knowledge about the nature of what you're feeling."}, {"time": 9640, "text": "So for instance, when you feel connected to other people, you typically feel this in your chest region around the heart."}, {"time": 9648, "text": "And you feel this is an expansive feeling in which you're reaching out, right?"}, {"time": 9648, "text": "And it's very intuitive to encode it like this."}, {"time": 9653, "text": "That's why it's encoded like this."}, {"time": 9653, "text": "It's a code in which the non symbolic parts of your mind talk to the symbolic ones."}, {"time": 9659, "text": "And then the expression of emotion is then the final step that could be sort of gestural or visual and so on."}, {"time": 9664, "text": "That's part of the communication."}, {"time": 9669, "text": "This probably evolved as part of an adversarial communication."}, {"time": 9669, "text": "So as soon as you started to observe the facial expression and posture of others to understand what emotional state they're in, others started to use this as signaling and also to subvert your model of their emotional state."}, {"time": 9683, "text": "So we now look at the inflections, at the difference between the standard face that they're going to make in this situation."}, {"time": 9689, "text": "When you are at a funeral, everybody expects you to make a solemn face, but the solemn face doesn't express whether you're sad or not."}, {"time": 9693, "text": "It just expresses that you understand what face you have to make at a funeral."}, {"time": 9698, "text": "Nobody should know that you are triumphant."}, {"time": 9704, "text": "So when you try to read the emotion of another person, you try to look at the delta between a truly sad expression and the things that are animating this face behind the curtain."}, {"time": 9716, "text": "So the interesting thing is, so having done this podcast and the video component, one of the things I've learned is that now I'm Russian and I just don't know how to express emotion on my face."}, {"time": 9730, "text": "One, I see that as weakness, but whatever."}, {"time": 9730, "text": "The people look to me after you say something, they look to my face to help them see how they should feel about what you said, which is fascinating because then they'll often comment on why did you look bored or why did you particularly enjoy that part or why did you whatever."}, {"time": 9748, "text": "It's a kind of interesting, it makes me cognizant of I'm part, like you're basically saying a bunch of brilliant things, but I'm part of the play that you're the key actor in by making my facial expressions and then therefore telling the narrative of what the big, like the big point is, which is fascinating."}, {"time": 9771, "text": "Makes me cognizant that I'm supposed to be making facial expressions."}, {"time": 9771, "text": "Even this conversation is hard because my preference would be to wear a mask with sunglasses to where I could just listen."}, {"time": 9781, "text": "Yes, I understand this because it's intrusive to interact with others this way."}, {"time": 9781, "text": "And basically Eastern European society have a taboo against that and especially Russia, the further you go to the East and in the US it's the opposite."}, {"time": 9791, "text": "You're expected to be hyperanimated in your face and you're also expected to show positive affect."}, {"time": 9802, "text": "And if you show positive affect without a good reason in Russia, people will think you are a stupid, unsophisticated person."}, {"time": 9813, "text": "And here positive affect without reason goes either appreciated or goes unnoticed."}, {"time": 9820, "text": "No, it's the default."}, {"time": 9820, "text": "It's being expected."}, {"time": 9820, "text": "Everything is amazing."}, {"time": 9820, "text": "Have you seen these?"}, {"time": 9825, "text": "Lego movie?"}, {"time": 9827, "text": "No, there was a diagram where somebody gave the appraisals that exist in the US and Russia, so you have your bell curve."}, {"time": 9832, "text": "And the lower 10% in the US, it's a good start."}, {"time": 9832, "text": "Everything above the lowest 10%, it's amazing."}, {"time": 9846, "text": "And for Russians, everything below the top 10%, it's terrible."}, {"time": 9846, "text": "And then everything except the top percent is, I don't like it."}, {"time": 9854, "text": "And the top percent is even so."}, {"time": 9863, "text": "It's funny, but it's kind of true."}, {"time": 9867, "text": "There's a deeper aspect to this."}, {"time": 9867, "text": "It's also how we construct meaning in the US."}, {"time": 9867, "text": "Usually you focus on the positive aspects and you just suppress the negative aspects."}, {"time": 9873, "text": "And in our Eastern European traditions, we emphasize the fact that if you hold something above the waterline, you also need to put something below the waterline because existence by itself is as best neutral."}, {"time": 9891, "text": "That's the basic intuition, at best neutral."}, {"time": 9891, "text": "Or it could be just suffering, the default is suffering."}, {"time": 9896, "text": "There are moments of beauty, but these moments of beauty are inextricably linked to the reality of suffering."}, {"time": 9902, "text": "And to not acknowledge the reality of suffering means that you are really stupid and unaware of the fact that basically every conscious being spends most of the time suffering."}, {"time": 9912, "text": "You just summarized the ethos of the Eastern Europe."}, {"time": 9912, "text": "Most of life is suffering with an occasional moments of beauty."}, {"time": 9919, "text": "And if your facial expressions don't acknowledge the abundance of suffering in the world and in existence itself, then you must be an idiot."}, {"time": 9930, "text": "It's an interesting thing when you raise children in the US and you, in some sense, preserve the identity of the intellectual and cultural traditions that are embedded in your own families."}, {"time": 9940, "text": "And your daughter asks you about Ariel the mermaid and asks you, why is Ariel not allowed to play with the humans?"}, {"time": 9946, "text": "And you tell her the truth."}, {"time": 9946, "text": "She's a siren."}, {"time": 9946, "text": "Sirens eat people."}, {"time": 9953, "text": "You don't play with your food."}, {"time": 9953, "text": "It does not end well."}, {"time": 9953, "text": "And then you tell her the original story, which is not the one by Anderson, which is the romantic one."}, {"time": 9958, "text": "And there's a much darker one, which is Undine's story."}, {"time": 9962, "text": "So Undine is a mermaid or a water woman."}, {"time": 9962, "text": "She lives on the ground of a river and she meets this prince and they fall in love."}, {"time": 9971, "text": "And the prince really, really wants to be with her."}, {"time": 9975, "text": "And she says, okay, but the deal is you cannot have any other woman."}, {"time": 9980, "text": "If you marry somebody else, even though you cannot be with me, because obviously you cannot breathe underwater and have other things to do than managing your kingdom as you have here, you will die."}, {"time": 9989, "text": "And eventually after a few years, he falls in love with some princess and marries her."}, {"time": 9989, "text": "And she shows up and quietly goes into his chamber and nobody is able to stop her or willing to do so because she is fierce."}, {"time": 10001, "text": "And she comes quietly and sad out of his chamber."}, {"time": 10001, "text": "And they ask her, what has happened?"}, {"time": 10007, "text": "And she said, I kissed him to death."}, {"time": 10012, "text": "All done."}, {"time": 10013, "text": "And you know the Anderson story, right?"}, {"time": 10013, "text": "In the Anderson story, the mermaid is playing with this prince that she saves and she falls in love with him and she cannot live out there."}, {"time": 10019, "text": "So she is giving up her voice and her tale for a human like appearance so she can walk among the humans."}, {"time": 10024, "text": "But this guy does not recognize that she is the one that you would marry."}, {"time": 10031, "text": "Instead, he marries somebody who has a kingdom and economical and political relationships to his own kingdom and so on, as he should."}, {"time": 10042, "text": "And she dies."}, {"time": 10045, "text": "Instead, Disney, the Little Mermaid story has a little bit of a happy ending."}, {"time": 10045, "text": "That's the Western, that's the American way."}, {"time": 10057, "text": "My own problem is this, of course, that I read Oscar Wilde before I read the other things."}, {"time": 10057, "text": "So I'm indoctrinated, inoculated with this romanticism."}, {"time": 10061, "text": "And I think that the mermaid is right."}, {"time": 10061, "text": "You sacrifice your life for romantic love."}, {"time": 10066, "text": "That's what you do."}, {"time": 10066, "text": "Because if you are confronted with either serving the machine and doing the obviously right thing under the economic and social and other human incentives, that's wrong."}, {"time": 10077, "text": "You should follow your heart."}, {"time": 10084, "text": "So do you think suffering is fundamental to happiness along these lines?"}, {"time": 10089, "text": "Suffering is the result of caring about things that you cannot change."}, {"time": 10089, "text": "And if you are able to change what you care about to those things that you can change, you will not suffer."}, {"time": 10097, "text": "But would you then be able to experience happiness?"}, {"time": 10102, "text": "But happiness itself is not important."}, {"time": 10102, "text": "Happiness is like a cookie."}, {"time": 10102, "text": "When you are a child, you think cookies are very important and you want to have all the cookies in the world, you look forward to being an adult because then you have as many cookies as you want."}, {"time": 10115, "text": "But as an adult, you realize a cookie is a tool."}, {"time": 10115, "text": "It's a tool to make you eat vegetables."}, {"time": 10120, "text": "And once you eat your vegetables anyway, you stop eating cookies for the most part, because otherwise you will get diabetes and will not be around for your kids."}, {"time": 10126, "text": "Yes, but then the cookie, the scarcity of a cookie, if scarcity is enforced, nevertheless, so like the pleasure comes from the scarcity."}, {"time": 10134, "text": "But the happiness is a cookie that your brain bakes for itself."}, {"time": 10134, "text": "It's not made by the environment."}, {"time": 10139, "text": "The environment cannot make you happy."}, {"time": 10139, "text": "It's your appraisal of the environment that makes you happy."}, {"time": 10143, "text": "And if you can change the appraisal of the environment, which you can learn to, then you can create arbitrary states of happiness."}, {"time": 10147, "text": "And some meditators fall into this trap."}, {"time": 10151, "text": "So they discover the womb, this basement womb in their brain where the cookies are made, and they indulge and stuff themselves."}, {"time": 10156, "text": "And after a few months, it gets really old and the big crisis of meaning comes."}, {"time": 10160, "text": "Because they thought before that their unhappiness was the result of not being happy enough."}, {"time": 10165, "text": "So they fixed this, right?"}, {"time": 10165, "text": "They can release the newer transmitters at will if they train."}, {"time": 10169, "text": "And then the crisis of meaning pops up in a deeper layer."}, {"time": 10176, "text": "And the question is, why do I live?"}, {"time": 10176, "text": "How can I make a sustainable civilization that is meaningful to me?"}, {"time": 10180, "text": "How can I insert myself into this?"}, {"time": 10180, "text": "And this was the problem that you couldn't solve in the first place."}, {"time": 10184, "text": "But at the end of all this, let me then ask that same question."}, {"time": 10184, "text": "What is the answer to that?"}, {"time": 10193, "text": "What could the possible answer be of the meaning of life?"}, {"time": 10193, "text": "What could an answer be?"}, {"time": 10193, "text": "What is it to you?"}, {"time": 10199, "text": "I think that if you look at the meaning of life, you look at what the cell is."}, {"time": 10199, "text": "Life is the cell."}, {"time": 10206, "text": "Or this principle, the cell."}, {"time": 10206, "text": "It's this self organizing thing that can participate in evolution."}, {"time": 10214, "text": "In order to make it work, it's a molecular machine."}, {"time": 10214, "text": "It needs a self replicator and an entropy extractor and a Turing machine."}, {"time": 10218, "text": "If any of these parts is missing, you don't have a cell and it is not living."}, {"time": 10222, "text": "And life is basically the emergent complexity over that principle."}, {"time": 10227, "text": "Once you have this intelligent super molecule, the cell, there is very little that you cannot make it do."}, {"time": 10232, "text": "It's probably the optimal computronium and especially in terms of resilience."}, {"time": 10232, "text": "It's very hard to sterilize the planet once it's infected with life."}, {"time": 10237, "text": "So it's active function of these three components or the supercell cell is present in the cell, it's present in us, and it's just... We are just an expression of the cell."}, {"time": 10251, "text": "It's a certain layer of complexity in the organization of cells."}, {"time": 10255, "text": "So in a way, it's tempting to think of the cell as a von Neumann probe."}, {"time": 10255, "text": "If you want to build intelligence on other planets, the best way to do this is to infect them with cells and wait for long enough and there's a reasonable chance the stuff is going to evolve into an information processing principle that is general enough to become sentient."}, {"time": 10276, "text": "That idea is very akin to the same dream and beautiful ideas that are expressed to cellular automata in their most simple mathematical form."}, {"time": 10281, "text": "If you just inject the system with some basic mechanisms of replication and so on, basic rules, amazing things would emerge."}, {"time": 10292, "text": "The cell is able to do something that James Trardy calls existential design."}, {"time": 10292, "text": "He points out that in technical design, we go from the outside in."}, {"time": 10298, "text": "We work in a highly controlled environment in which everything is deterministic, like our computers, our labs, or our engineering workshops."}, {"time": 10308, "text": "And then we use this determinism to implement a particular kind of function that we dream up and that seamlessly interfaces with all the other deterministic functions that we already have in our world."}, {"time": 10317, "text": "So it's basically from the outside in."}, {"time": 10317, "text": "Biological systems designed from the inside out as seed will become a seedling by taking some of the relatively unorganized matter around it and turning it into its own structure and thereby subdue the environment."}, {"time": 10331, "text": "Cells can cooperate if they can rely on other cells having a similar organization that is already compatible."}, {"time": 10336, "text": "But unless that's there, the cell needs to divide to create that structure by itself."}, {"time": 10341, "text": "So it's a self organizing principle that works on a somewhat chaotic environment."}, {"time": 10347, "text": "And the purpose of life in this sense is to produce complexity."}, {"time": 10352, "text": "And the complexity allows you to harvest entropy gradients that you couldn't harvest without the complexity."}, {"time": 10358, "text": "And in this sense, intelligence and life are very strongly connected because the purpose of intelligence is to allow control under conditions and the conditions of complexity."}, {"time": 10368, "text": "So basically, you shift the boundary between the ordered systems into the realm of chaos."}, {"time": 10373, "text": "You build bridge heads into chaos with complexity."}, {"time": 10373, "text": "And this is what we are doing."}, {"time": 10380, "text": "This is not necessarily a deeper meaning."}, {"time": 10380, "text": "I think the meaning that we have priors for that we are all for outside of the priors, there is no meaning."}, {"time": 10385, "text": "Meaning only exists if the mind projects it."}, {"time": 10389, "text": "That is probably civilization."}, {"time": 10389, "text": "I think that what feels most meaningful to me is to try to build and maintain a sustainable civilization."}, {"time": 10396, "text": "And taking a slight step outside of that, we talked about a man with a beard and God, but something, some mechanism, perhaps must have planted the seed, the initial seed of the cell."}, {"time": 10414, "text": "Do you think there is a God?"}, {"time": 10414, "text": "What is a God?"}, {"time": 10422, "text": "And what would that look like?"}, {"time": 10422, "text": "If there was no spontaneous biogenesis, in the sense that the first cell formed by some happy random accidents where the molecules just happened to be in the right constellation to each other."}, {"time": 10434, "text": "But there could also be the mechanism that allows for the random."}, {"time": 10439, "text": "I mean, there's like turtles all the way down."}, {"time": 10439, "text": "There seems to be, there has to be a head turtle at the bottom."}, {"time": 10444, "text": "Let's consider something really wild."}, {"time": 10444, "text": "Imagine, is it possible that a gas giant could become intelligent?"}, {"time": 10450, "text": "What would that involve?"}, {"time": 10450, "text": "So imagine you have vortices that spontaneously emerge on the gas giants, like big storm systems that endure for thousands of years."}, {"time": 10461, "text": "And some of these storm systems produce electromagnetic fields because some of the clouds are ferromagnetic or something."}, {"time": 10464, "text": "And as a result, they can change how certain clouds react rather than other clouds and thereby produce some self stabilizing patterns that eventually lead to regulation feedback loops, nested feedback loops and control."}, {"time": 10474, "text": "So imagine you have such this thing that basically has emergent self sustaining, self organizing complexity."}, {"time": 10480, "text": "And at some point, this breaks up and realizes and basically lam solaris, I am a thinking planet, but I will not replicate because I can recreate the conditions of my own existence somewhere else."}, {"time": 10490, "text": "I'm just basically an intelligence that has spontaneously formed because it could."}, {"time": 10495, "text": "And now it builds a von Neumann probe and the best von Neumann probe for such a thing might be the cell."}, {"time": 10505, "text": "So maybe it, because it's very, very clever and very enduring, creates cells and sends them out."}, {"time": 10510, "text": "And one of them has infected our planet."}, {"time": 10510, "text": "And I'm not suggesting that this is the case, but it would be compatible with the Prince Birmingham hypothesis."}, {"time": 10514, "text": "And it was my intuition that our biogenesis is very unlikely."}, {"time": 10519, "text": "It's possible, but you probably need to roll the cosmic dice very often, maybe more often than there are planetary surfaces."}, {"time": 10528, "text": "So God is just a large enough, a system that's large enough that allows randomness."}, {"time": 10537, "text": "No, I don't think that God has anything to do with creation."}, {"time": 10537, "text": "I think it's a mistranslation of the Talmud into the Catholic mythology."}, {"time": 10541, "text": "I think that Genesis is actually the childhood memories of a God."}, {"time": 10546, "text": "So the, when."}, {"time": 10546, "text": "Sorry, Genesis is the."}, {"time": 10551, "text": "The childhood memories of a God."}, {"time": 10551, "text": "It's basically a mind that is remembering how it came into being."}, {"time": 10557, "text": "And we typically interpret Genesis as the creation of a physical universe by a supernatural being."}]}]