[{"title": "Mark Zuckerberg: Meta, Facebook, Instagram, and the Metaverse | Lex Fridman Podcast #267", "id": "5zOHSysMmH0", "quotes": [{"time": 331, "text": "And now, dear friends, here's Mark Zuckerberg."}, {"time": 340, "text": "Can you circle all the traffic lights, please?"}, {"time": 353, "text": "You actually did it."}, {"time": 354, "text": "That is very impressive performance."}, {"time": 356, "text": "Okay, now we can initiate the interview procedure."}, {"time": 360, "text": "Is it possible that this conversation is happening inside a metaverse created by you, by Meta many years from now, and we're doing a memory replay experience?"}, {"time": 370, "text": "I don't know the answer to that."}, {"time": 371, "text": "Then I'd be some computer construct and not the person who created that Meta company."}, {"time": 378, "text": "But that would truly be Meta."}, {"time": 381, "text": "Right, so this could be somebody else using the Mark Zuckerberg avatar who can do the Mark and the Lex conversation replay from four decades ago when Meta, it was first sort of."}, {"time": 393, "text": "I mean, it's not gonna be four decades before we have photorealistic avatars like this."}, {"time": 398, "text": "So I think we're much closer to that."}, {"time": 400, "text": "Well, that's something you talk about is how passionate you are about the idea of the avatar representing who you are in the metaverse."}, {"time": 406, "text": "So I do these podcasts in person."}, {"time": 411, "text": "You know, I'm a stickler for that, because there's a magic to the in person conversation."}, {"time": 415, "text": "How long do you think it'll be before you can have the same kind of magic in the metaverse, the same kind of intimacy in the chemistry, whatever the heck is there when we're talking in person?"}, {"time": 427, "text": "How long before we have it in the metaverse?"}, {"time": 430, "text": "Well, I think this is like the key question, right?"}, {"time": 432, "text": "Because the thing that's different about virtual and hopefully augmented reality compared to all other forms of digital platforms before is this feeling of presence, right?"}, {"time": 444, "text": "The feeling that you're right, that you're in an experience and that you're there with other people or in another place."}, {"time": 449, "text": "And that's just different from all of the other screens that we have today, right?"}, {"time": 453, "text": "Phones, TVs, all the stuff."}, {"time": 456, "text": "They're trying to, in some cases, deliver experiences that feel high fidelity, but at no point do you actually feel like you're in it, right?"}, {"time": 466, "text": "At some level, your content is trying to sort of convince you that this is a realistic thing that's happening, but all of the kind of subtle signals are telling you, no, you're looking at a screen."}, {"time": 476, "text": "So the question about how you develop these systems is like, what are all of the things that make the physical world all the different cues?"}, {"time": 484, "text": "So I think on visual presence and spatial audio, we're making reasonable progress."}, {"time": 495, "text": "Spatial audio makes a huge deal."}, {"time": 496, "text": "I don't know if you've tried this experience, workrooms that we launched where you have meetings."}, {"time": 501, "text": "And I basically made a rule for all of the top, you know, management folks at the company that they need to be doing standing meetings in workrooms already, right?"}, {"time": 511, "text": "I feel like we got to dog food this, you know, this is how people are gonna work in the future."}, {"time": 515, "text": "So we have to adopt this now."}, {"time": 518, "text": "And there were already a lot of things that I think feel significantly better than like typical Zoom meetings, even though the avatars are a lot lower fidelity."}, {"time": 528, "text": "You know, the idea that you have spatial audio, you're around a table in VR with people."}, {"time": 533, "text": "If someone's talking from over there, it sounds like it's talking from over there."}, {"time": 536, "text": "You can see, you know, the arm gestures and stuff feel more natural."}, {"time": 541, "text": "You can have side conversations, which is something that you can't really do in Zoom."}, {"time": 544, "text": "I mean, I guess you can text someone over, like out of band, but if you're actually sitting around a table with people, you know, you can lean over and whisper to the person next to you and like have a conversation that you can't, you know, that you can't really do with in just video communication."}, {"time": 563, "text": "So I think it's interesting in what ways some of these things already feel more real than a lot of the technology that we have, even when the visual fidelity isn't quite there, but I think it'll get there over the next few years."}, {"time": 577, "text": "Now, I mean, you were asking about comparing that to the true physical world, not Zoom or something like that."}, {"time": 582, "text": "And there, I mean, I think you have feelings of like temperature, you know, olfactory, obviously touch, right, we're working on haptic gloves, you know, the sense that you wanna be able to, you know, put your hands down and feel some pressure from the table."}, {"time": 599, "text": "You know, all of these things I think are gonna be really critical to be able to keep up this illusion that you're in a world and that you're fully present in this world."}, {"time": 608, "text": "But I don't know, I think we're gonna have a lot of these building blocks within, you know, the next 10 years or so."}, {"time": 614, "text": "And even before that, I think it's amazing how much you're just gonna be able to build with software that sort of masks some of these things."}, {"time": 621, "text": "I realize I'm going long, but I was told we have a few hours here."}, {"time": 625, "text": "So it's a... We're here for five to six hours."}, {"time": 627, "text": "Yeah, so I mean, it's, look, I mean, that's on the shorter end of the congressional testimonies I've done."}, {"time": 632, "text": "But it's, but, you know, one of the things that we found with hand presence, right?"}, {"time": 639, "text": "So the earliest VR, you just have the headset and then, and that was cool, you could look around, you feel like you're in a place, but you don't feel like you're really able to interact with it until you have hands."}, {"time": 648, "text": "And then there was this big question where once you got hands, what's the right way to represent them?"}, {"time": 653, "text": "And initially, all of our assumptions was, okay, when I look down and see my hands in the physical world, I see an arm and it's gonna be super weird if you see, you know, just your hand."}, {"time": 666, "text": "But it turned out to not be the case because there's this issue with your arms, which is like, what's your elbow angle?"}, {"time": 671, "text": "And if the elbow angle that we're kind of interpolating based on where your hand is and where your headset is actually isn't accurate, it creates this very uncomfortable feeling where it's like, oh, like my arm is actually out like this, but it's like showing it in here."}, {"time": 685, "text": "And that actually broke the feeling of presence a lot more."}, {"time": 689, "text": "Whereas it turns out that if you just show the hands and you don't show the arms, it actually is fine for people."}, {"time": 696, "text": "So I think that there's a bunch of these interesting psychological cues where it'll be more about getting the right details right."}, {"time": 704, "text": "And I think a lot of that will be possible even over a few year period or a five year period."}, {"time": 709, "text": "And we won't need like every single thing to be solved to deliver this like full sense of presence."}, {"time": 714, "text": "Yeah, it's a fascinating psychology question of what is the essence that makes in person conversation special?"}, {"time": 724, "text": "It's like emojis are able to convey emotion really well, even though they're obviously not photorealistic."}, {"time": 730, "text": "And so in that same way, Jessica, you're saying, just showing the hands is able to create a comfortable expression with your hands."}, {"time": 738, "text": "So I wonder what that is."}, {"time": 739, "text": "People in the world wars used to write letters and you can fall in love with just writing letters."}, {"time": 744, "text": "You don't need to see each other in person."}, {"time": 746, "text": "You can convey emotion."}, {"time": 747, "text": "You can be depth of experience with just words."}, {"time": 752, "text": "So that's, I think, a fascinating place to explore psychology of like, how do you find that intimacy?"}, {"time": 759, "text": "Yeah, and the way that I come to all of this stuff is, I basically studied psychology and computer science."}, {"time": 765, "text": "So all of the work that I do is sort of at the intersection of those things."}, {"time": 769, "text": "I think most of the other big tech companies are building technology for you to interact with."}, {"time": 775, "text": "What I care about is building technology to help people interact with each other."}, {"time": 778, "text": "So I think it's a somewhat different approach than most of the other tech entrepreneurs and big companies come at this from."}, {"time": 784, "text": "And a lot of the lessons in terms of how I think about designing products come from some just basic elements of psychology, right?"}, {"time": 795, "text": "In terms of our brains, you can compare it to the brains of other animals."}, {"time": 802, "text": "We're very wired to specific things, facial expressions."}, {"time": 805, "text": "I mean, we're very visual, right?"}, {"time": 808, "text": "So compared to other animals, I mean, that's clearly the main sense that most people have."}, {"time": 812, "text": "But there's a whole part of your brain that's just kind of focused on reading facial cues."}, {"time": 818, "text": "So when we're designing the next version of Quest or the VR headset, a big focus for us is face tracking and basically eye tracking so you can make eye contact, which again, isn't really something that you can do over a video conference."}, {"time": 831, "text": "It's sort of amazing how far video conferencing has gotten without the ability to make eye contact, right?"}, {"time": 838, "text": "It's sort of a bizarre thing if you think about it."}, {"time": 840, "text": "You're looking at someone's face, sometimes for an hour when you're in a meeting and you looking at their eyes to them doesn't look like you're looking at their eyes."}, {"time": 851, "text": "You're always looking past each other, I guess."}, {"time": 855, "text": "You're not sending that signal."}, {"time": 856, "text": "Well, you're trying to."}, {"time": 857, "text": "Right, you're trying to."}, {"time": 858, "text": "A lot of times, or at least I find myself, I'm trying to look into the other person's eyes."}, {"time": 861, "text": "But they don't feel like you're looking to their eyes."}, {"time": 863, "text": "So then the question is, all right, am I supposed to look at the camera so that way you can have a sensation that I'm looking at you?"}, {"time": 868, "text": "I think that that's an interesting question."}, {"time": 870, "text": "And then with VR today, even without eye tracking and knowing what your eyes are actually looking at, you can fake it reasonably well, right?"}, {"time": 879, "text": "So you can look at where the head pose is."}, {"time": 882, "text": "And if it looks like I'm kind of looking in your general direction, then you can sort of assume that maybe there's some eye contact intended and you can do it in a way where it's like, okay, maybe it's not a fixated stare, but it's somewhat natural."}, {"time": 896, "text": "But once you have actual eye tracking, you can do it for real."}, {"time": 900, "text": "And I think that that's really important stuff."}, {"time": 902, "text": "So when I think about Meta's contribution to this field, I have to say it's not clear to me that any of the other companies that are focused on the Metaverse or on virtual and augmented reality are gonna prioritize putting these features in the hardware because like everything, they're trade offs, right?"}, {"time": 918, "text": "I mean, it adds some weight to the device."}, {"time": 921, "text": "Maybe it adds some thickness."}, {"time": 922, "text": "You could totally see another company taking the approach of let's just make the lightest and thinnest thing possible."}, {"time": 927, "text": "But I want us to design the most human thing possible that creates the richest sense of presence and cause so much of human emotion and expression comes from these like micro movements."}, {"time": 939, "text": "If I like move my eyebrow millimeter, you will notice and that like means something."}, {"time": 944, "text": "So the fact that we're losing these signals and a lot of communication I think is a loss."}, {"time": 949, "text": "So it's not like, okay, there's one feature and you add this, then it all of a sudden is gonna feel like we have real presence."}, {"time": 955, "text": "You can sort of look at how the human brain works and how we express and kind of read emotions and you can just build a roadmap of that, of just what are the most important things to try to unlock over a five to 10 year period and just try to make the experience more and more human and social."}, {"time": 972, "text": "When do you think would be a moment, like a singularity moment for the Metaverse where there's a lot of ways to ask this question, but people will have many or most of their meaningful experiences in the Metaverse versus the real world."}, {"time": 991, "text": "And actually it's interesting to think about the fact that a lot of people are having the most important moments of their life happen in the digital sphere, especially not during COVID, like even falling in love or meeting friends or getting excited about stuff that is happening on the 2D digital plane."}, {"time": 1009, "text": "When do you think the Metaverse will provide those experiences for a large number, like a majority of the population?"}, {"time": 1014, "text": "Yeah, I think it's a really good question."}, {"time": 1017, "text": "There was someone, I read this piece that framed this as a lot of people think that the Metaverse is about a place, but one definition of this is it's about a time when basically immersive digital worlds become the primary way that we live our lives and spend our time."}, {"time": 1038, "text": "I think that that's a reasonable construct."}, {"time": 1040, "text": "And from that perspective, I think you also just wanna look at this as a continuation because it's not like, okay, we are building digital worlds, but we don't have that today."}, {"time": 1049, "text": "I think you and I probably already live a very large part of our life in digital worlds."}, {"time": 1054, "text": "They're just not 3D immersive virtual reality, but I do a lot of meetings over video or I spend a lot of time writing things over email or WhatsApp or whatever."}, {"time": 1064, "text": "So what is it gonna take to get there for kind of the immersive presence version of this, which I think is what you're asking."}, {"time": 1071, "text": "And for that, I think that there's just a bunch of different use cases."}, {"time": 1075, "text": "And I think when you're building technology, I think a lot of it is just you're managing this duality where on the one hand, you wanna build these elegant things that can scale and have billions of people use them and get value from them."}, {"time": 1093, "text": "And then on the other hand, you're fighting this kind of ground game where there are just a lot of different use cases and people do different things and you wanna be able to unlock them."}, {"time": 1102, "text": "So the first ones that we basically went after were gaming with Quest and social experiences."}, {"time": 1110, "text": "And it goes back to when we started working on virtual reality."}, {"time": 1113, "text": "My theory at the time was basically people thought about it as gaming, but if you look at all computing platforms up to that point, gaming is a huge part, it was a huge part of PCs, it was a huge part of mobile, but it was also very decentralized."}, {"time": 1131, "text": "There wasn't, for the most part, one or two gaming companies."}, {"time": 1135, "text": "There were a lot of gaming companies and gaming is somewhat hits based."}, {"time": 1138, "text": "I mean, we're getting some games that have more longevity, but in general, there were a lot of different games out there."}, {"time": 1146, "text": "But on PC and on mobile, the companies that focused on communication and social interaction, there tended to be a smaller number of those and that ended up being just as important of a thing as all of the games that you did combined."}, {"time": 1161, "text": "I think productivity is another area."}, {"time": 1163, "text": "That's obviously something that we've historically been less focused on, but I think it's gonna be really important for us."}, {"time": 1167, "text": "With workroom, do you mean productivity in the collaborative aspect?"}, {"time": 1170, "text": "Yeah, I think that there's a workroom's aspect of this, like a meeting aspect, and then I think that there's like a Word, Excel, productivity, either you're working or coding or knowledge work as opposed to just meetings."}, {"time": 1186, "text": "So you can kind of go through all these different use cases."}, {"time": 1189, "text": "Gaming, I think we're well on our way."}, {"time": 1191, "text": "Social, I think we're just the kind of preeminent company that focuses on this."}, {"time": 1197, "text": "And I think that that's already on Quest becoming the, if you look at the list of what are the top apps, social apps are already number one, two, three."}, {"time": 1206, "text": "So that's kind of becoming a critical thing, but I don't know."}, {"time": 1210, "text": "I would imagine for someone like you, it'll be until we get a lot of the work things dialed in."}, {"time": 1217, "text": "When this is just like much more adopted and clearly better than Zoom for VC, when if you're doing your coding or your writing or whatever it is in VR, which it's not that far off to imagine that because pretty soon you're just gonna be able to have a screen that's bigger than, it'll be your ideal setup and you can bring it with you and put it on anywhere and have your kind of ideal workstation."}, {"time": 1239, "text": "So I think that there are a few things to work out on that, but I don't think that that's more than five years off."}, {"time": 1246, "text": "And then you'll get a bunch of other things that like aren't even possible or you don't even think about using a phone or PC for today, like fitness, right?"}, {"time": 1254, "text": "So, I mean, I know you're, we were talking before about how you're into running and like I'm really into a lot of things around fitness as well, different things in different places."}, {"time": 1264, "text": "I got really into hydrofoiling recently and surfing and I used to fence competitively."}, {"time": 1272, "text": "I like run."}, {"time": 1273, "text": "So, and you were saying that you were thinking about trying different martial arts and I tried to trick you and convince you into doing Brazilian Jiu Jitsu."}, {"time": 1279, "text": "Or you actually mentioned that that was one you're curious about and I don't know."}, {"time": 1283, "text": "Is that a trick?"}, {"time": 1286, "text": "We're in the metaverse now."}, {"time": 1287, "text": "Yeah, no, I took that seriously."}, {"time": 1289, "text": "I thought that that was a real suggestion."}, {"time": 1294, "text": "That would be an amazing chance if we ever step on the mat together and just like roll around."}, {"time": 1299, "text": "I'll show you some moves."}, {"time": 1300, "text": "Well, give me a year to train and then we can do it."}, {"time": 1303, "text": "You know, you've seen Rocky IV where the Russian faces off the American."}, {"time": 1306, "text": "I'm the Russian in this picture."}, {"time": 1307, "text": "And then you're the Rocky, the underdog that gets to win in the end."}, {"time": 1311, "text": "The idea of me as Rocky and like fighting is..."}, {"time": 1316, "text": "If he dies, he dies."}, {"time": 1318, "text": "Sorry, I just had to."}, {"time": 1322, "text": "But I mean, a lot of aspects of fitness."}, {"time": 1325, "text": "You know, I don't know if you've tried supernatural on Quest or..."}, {"time": 1330, "text": "So first of all, can I just comment on the fact every time I played around with Quest 2, I just, I get giddy every time I step into virtual reality."}, {"time": 1338, "text": "So you mentioned productivity and all those kinds of things."}, {"time": 1340, "text": "That's definitely something I'm excited about, but really I just love the possibilities of stepping into that world."}, {"time": 1348, "text": "Maybe it's the introvert in me, but it just feels like the most convenient way to travel into worlds, into worlds that are similar to the real world or totally different."}, {"time": 1361, "text": "It's like Alice in Wonderland."}, {"time": 1362, "text": "Just try out crazy stuff."}, {"time": 1364, "text": "The possibilities are endless."}, {"time": 1365, "text": "And I just, I personally am just love, get excited for stepping in those virtual worlds."}, {"time": 1373, "text": "So I'm a huge fan."}, {"time": 1375, "text": "In terms of the productivity as a programmer, I spend most of my day programming."}, {"time": 1380, "text": "That's really interesting also, but then you have to develop the right IDEs."}, {"time": 1384, "text": "You have to develop, like there has to be a threshold where a large amount of the programming community moves there, but the collaborative aspects that are possible in terms of meetings, in terms of when two coders are working together, I mean, the possibilities there are super, super exciting."}, {"time": 1401, "text": "I think that in building this, we sort of need to balance."}, {"time": 1407, "text": "There are gonna be some new things that you just couldn't do before."}, {"time": 1409, "text": "And those are gonna be the amazing experiences."}, {"time": 1411, "text": "So teleporting to any place, right?"}, {"time": 1413, "text": "Whether it's a real place or something that people made."}, {"time": 1418, "text": "And I mean, some of the experiences around how we can build stuff in new ways, where a lot of the stuff that, when I'm coding stuff, it's like, all right, you code it and then you build it and then you see it afterwards."}, {"time": 1428, "text": "But increasingly it's gonna be possible to, you're in a world and you're building the world as you are in it and kind of manipulating it."}, {"time": 1435, "text": "One of the things that we showed at our Inside the Lab for recent artificial intelligence progress is this Builder Bot program, where now you can just talk to it and say, hey, okay, I'm in this world, like put some trees over there and it'll do that."}, {"time": 1450, "text": "And like, all right, put some bottles of water on our picnic blanket and it'll do that and you're in the world."}, {"time": 1457, "text": "And I think there are gonna be new paradigms for coding."}, {"time": 1459, "text": "So yeah, there are gonna be some things that I think are just pretty amazing, especially the first few times that you do them, but that you're like, whoa, like I've never had an experience like this."}, {"time": 1470, "text": "But most of your life, I would imagine, is not doing things that are amazing for the first time."}, {"time": 1478, "text": "A lot of this in terms of, I mean, just answering your question from before around, what is it gonna take before you're spending most of your time in this?"}, {"time": 1485, "text": "Well, first of all, let me just say it as an aside, the goal isn't to have people spend a lot more time in computing."}, {"time": 1491, "text": "It's to make it so that."}, {"time": 1491, "text": "I'm asking for myself."}, {"time": 1492, "text": "Yeah, it's to make it."}, {"time": 1492, "text": "When will I spend all my time in?"}, {"time": 1494, "text": "Yeah, it's to make computing more natural."}, {"time": 1497, "text": "But I think you will spend most of your computing time in this when it does the things that you use computing for somewhat better."}, {"time": 1507, "text": "So maybe having your perfect workstation is a 5% improvement on your coding productivity."}, {"time": 1515, "text": "Maybe it's not like a completely new thing."}, {"time": 1519, "text": "But I mean, look, if I could increase the productivity of every engineer at Meta by 5%, we'd buy those devices for everyone."}, {"time": 1527, "text": "And I imagine a lot of other companies would too."}, {"time": 1530, "text": "And that's how you start getting to the scale that I think makes this rival some of the bigger computing platforms that exist today."}, {"time": 1537, "text": "Let me ask you about identity."}, {"time": 1538, "text": "We talked about the avatar."}, {"time": 1540, "text": "How do you see identity in the Metaverse?"}, {"time": 1542, "text": "Should the avatar be tied to your identity or can I be anything in the Metaverse?"}, {"time": 1549, "text": "Like, can I be whatever the heck I want?"}, {"time": 1552, "text": "Can I even be a troll?"}, {"time": 1553, "text": "So there's exciting freeing possibilities and there's the darker possibilities too."}, {"time": 1560, "text": "Yeah, I mean, I think that there's gonna be a range, right?"}, {"time": 1563, "text": "So we're working on, for expression and avatars, on one end of the spectrum are kind of expressive and cartoonish avatars."}, {"time": 1574, "text": "And then on the other end of the spectrum are photorealistic avatars."}, {"time": 1578, "text": "And I just think the reality is that there are gonna be different use cases for different things."}, {"time": 1583, "text": "And I guess there's another axis."}, {"time": 1585, "text": "So if you're going from photorealistic to expressive, there's also like representing you directly versus like some fantasy identity."}, {"time": 1593, "text": "And I think that there are gonna be things on all ends of that spectrum too, right?"}, {"time": 1597, "text": "So you'll want photo, like in some experience, you might wanna be like a photorealistic dragon, right?"}, {"time": 1604, "text": "Or if I'm playing Onward, or just this military simulator game, I think getting to be more photorealistic as a soldier in that could enhance the experience."}, {"time": 1617, "text": "There are times when I'm hanging out with friends where I want them to know it's me."}, {"time": 1622, "text": "So a kind of cartoonish or expressive version of me is good."}, {"time": 1626, "text": "But there are also experiences like, VRChat does this well today, where a lot of the experience is kind of dressing up and wearing a fantastical avatar that's almost like a meme or is humorous."}, {"time": 1639, "text": "So you come into an experience and it's almost like you have like a built in icebreaker because like you see people and you're just like, all right, I'm cracking up at what you're wearing because that's funny."}, {"time": 1650, "text": "And it's just like, where'd you get that?"}, {"time": 1651, "text": "Or, oh, you made that?"}, {"time": 1652, "text": "That's, it's awesome."}, {"time": 1655, "text": "Whereas, okay, if you're going into a work meeting, maybe a photorealistic version of your real self is gonna be the most appropriate thing for that."}, {"time": 1663, "text": "So I think the reality is there aren't going to be, it's not just gonna be one thing."}, {"time": 1670, "text": "You know, my own sense of kind of how you wanna express identity online has sort of evolved over time."}, {"time": 1676, "text": "And that, you know, early days in Facebook, I thought, okay, people are gonna have one identity."}, {"time": 1680, "text": "And now I think that's clearly not gonna be the case."}, {"time": 1682, "text": "I think you're gonna have all these different things and there's utility in being able to do different things."}, {"time": 1687, "text": "So some of the technical challenges that I'm really interested in around it are how do you build the software to allow people to seamlessly go between them?"}, {"time": 1697, "text": "So say, so you could view them as just completely discrete points on a spectrum, but let's talk about the metaverse economy for a second."}, {"time": 1708, "text": "Let's say I buy a digital shirt for my photorealistic avatar, which by the way, I think at the time where we're spending a lot of time in the metaverse doing a lot of our work meetings in the metaverse and et cetera, I would imagine that the economy around virtual clothing as an example is going to be quite as big."}, {"time": 1724, "text": "Why wouldn't I spend almost as much money in investing in my appearance or expression for my photorealistic avatar for meetings as I would for whatever I'm gonna wear in my video chat."}, {"time": 1735, "text": "But the question is, okay, so you, let's say you buy some shirt for your photorealistic avatar."}, {"time": 1739, "text": "Wouldn't it be cool if there was a way to basically translate that into a more expressive thing for your kind of cartoonish or expressive avatar?"}, {"time": 1751, "text": "And there are multiple ways to do that."}, {"time": 1752, "text": "You can view them as two discrete points and okay, maybe if a designer sells one thing, then it actually comes in a pack and there's two and you can use either one on that, but I actually think this stuff might exist more as a spectrum in the future."}, {"time": 1766, "text": "And that's what I do think the direction on some of the AI advances that is happening to be able to, especially stuff around like style transfer, being able to take a piece of art or express something and say, okay, paint me this photo in the style of Gauguin or whoever it is that you're interested in."}, {"time": 1789, "text": "Take this shirt and put it in the style of what I've designed for my expressive avatar."}, {"time": 1795, "text": "I think that's gonna be pretty compelling."}, {"time": 1796, "text": "And so the fashion, you might be buying like a generator, like a closet that generates a style."}, {"time": 1803, "text": "And then like with the GANs, you'll be able to infinitely generate outfits thereby making it, so the reason I wear the same thing all the time is I don't like choice."}, {"time": 1812, "text": "You've talked about the same thing, but now you don't even have to choose."}, {"time": 1816, "text": "Your closet generates your outfit for you every time."}, {"time": 1819, "text": "So you have to live with the outfit it generates."}, {"time": 1823, "text": "I mean, you could do that, although, no, I think that that's, I think some people will, but I think like, I think there's going to be a huge aspect of just people doing creative commerce here."}, {"time": 1835, "text": "So I think that there is going to be a big market around people designing digital clothing."}, {"time": 1841, "text": "But the question is, if you're designing digital clothing, do you need to design, if you're the designer, do you need to make it for each kind of specific discrete point along a spectrum, or are you just designing it for kind of a photo realistic case or an expressive case, or can you design one and have it translate across these things?"}, {"time": 1857, "text": "If I buy a style from a designer who I care about, and now I'm a dragon, is there a way to morph that so it goes on the dragon in a way that makes sense?"}, {"time": 1867, "text": "And that I think is an interesting AI problem because you're probably not going to make it so that designers have to go design for all those things."}, {"time": 1874, "text": "But the more useful the digital content is that you buy in a lot of uses, in a lot of use cases, the more that economy will just explode."}, {"time": 1883, "text": "And that's a lot of what all of the, we were joking about NFTs before, but I think a lot of the promise here is that if the digital goods that you buy are not just tied to one platform or one use case, they end up being more valuable, which means that people are more willing and more likely to invest in them, and that just spurs the whole economy."}, {"time": 1904, "text": "But the question is, that's a fascinating positive aspect, but the potential negative aspect is that you can have people concealing their identity in order to troll or even not people, bots."}, {"time": 1917, "text": "So how do you know in the metaverse that you're talking to a real human or an AI or a well intentioned human?"}, {"time": 1923, "text": "Is that something you think about, something you're concerned about?"}, {"time": 1926, "text": "Well, let's break that down into a few different cases."}, {"time": 1930, "text": "I mean, because knowing that you're talking to someone who has good intentions is something that I think is not even solved in pretty much anywhere."}, {"time": 1937, "text": "But I mean, if you're talking to someone who's a dragon, I think it's pretty clear that they're not representing themselves as a person."}, {"time": 1943, "text": "I think probably the most pernicious thing that you want to solve for is, I think probably one of the scariest ones is how do you make sure that someone isn't impersonating you?"}, {"time": 1955, "text": "So, okay, you're in a future version of this conversation, and we have photorealistic avatars, and we're doing this in work rooms or whatever the future version of that is, and someone walks in who looks like me."}, {"time": 1968, "text": "How do you know that that's me?"}, {"time": 1970, "text": "And one of the things that we're thinking about is it's still a pretty big AI project to be able to generate photorealistic avatars that basically can like, they work like these codecs of you, right?"}, {"time": 1983, "text": "So you kind of have a map from your headset and whatever sensors of what your body's actually doing, and it takes the model and it kind of displays it in VR."}, {"time": 1991, "text": "But there's a question, which is, should there be some sort of biometric security so that when I put on my VR headset or I'm going to go use that avatar, I need to first prove that I am that?"}, {"time": 2004, "text": "And I think you probably are gonna want something like that."}, {"time": 2006, "text": "So as we're developing these technologies, we're also thinking about the security for things like that because people aren't gonna wanna be impersonated."}, {"time": 2017, "text": "That's a huge security issue."}, {"time": 2021, "text": "Then you just get the question of people hiding behind fake accounts to do malicious things, which is not gonna be unique to the metaverse, although certainly in a environment where it's more immersive and you have more of a sense of presence, it could be more painful."}, {"time": 2041, "text": "But this is obviously something that we've just dealt with for years in social media and the internet more broadly."}, {"time": 2048, "text": "And there, I think there have been a bunch of tactics that I think we've just evolved to, we've built up these different AI systems to basically get a sense of, is this account behaving in the way that a person would?"}, {"time": 2066, "text": "And it turns out, so in all of the work that we've done around, we call it community integrity and it's basically like policing harmful content and trying to figure out where to draw the line."}, {"time": 2078, "text": "And there are all these like really hard and philosophical questions around like, where do you draw the line on some of this stuff?"}, {"time": 2082, "text": "And the thing that I've kind of found the most effective is as much as possible trying to figure out who are the inauthentic accounts or where are the accounts that are behaving in an overall harmful way at the account level, rather than trying to get into like policing what they're saying, right?"}, {"time": 2101, "text": "Which I think the metaverse is gonna be even harder because the metaverse I think will have more properties of, it's almost more like a phone call, right?"}, {"time": 2109, "text": "Or it's not like I post a piece of content and is that piece of content good or bad?"}, {"time": 2114, "text": "So I think more of this stuff will have to be done at the level of the account."}, {"time": 2119, "text": "But this is the area where, between the kind of counter intelligence teams that we built up inside the company and like years of building just different AI systems to basically detect what is a real account and what isn't."}, {"time": 2136, "text": "I'm not saying we're perfect, but like this is an area where I just think we are like years ahead of basically anyone else in the industry in terms of having built those capabilities."}, {"time": 2148, "text": "And I think that that just is gonna be incredibly important for this next wave of things."}, {"time": 2151, "text": "And like you said, on a technical level, on a philosophical level, it's an incredibly difficult problem to solve."}, {"time": 2159, "text": "By the way, I would probably like to open source my avatar so there could be like millions of Lexis walking around just like an army."}, {"time": 2167, "text": "Like Agent Smith?"}, {"time": 2168, "text": "Agent Smith, yeah, exactly."}, {"time": 2170, "text": "So the Unity ML folks built a copy of me and they sent it to me."}, {"time": 2178, "text": "So there's a person running around and I've just been doing reinforcement learning on it."}, {"time": 2182, "text": "I was gonna release it because just to have sort of like thousands of Lexis doing reinforcement."}, {"time": 2191, "text": "So they fall over naturally, they have to learn how to like walk around and stuff."}, {"time": 2194, "text": "So I love that idea, this tension between biometric security, you want to have one identity, but then certain avatars, you might have to have many."}, {"time": 2203, "text": "I don't know which is better security, sort of flooding the world with Lexis and thereby achieving security or really being protective of your identity."}, {"time": 2211, "text": "I have to ask you a security question actually."}, {"time": 2213, "text": "Well, how does flooding the world with Lexis help me know in our conversation that I'm talking to the real Lex?"}, {"time": 2219, "text": "I completely destroy the trust in all my relationships then, right?"}, {"time": 2223, "text": "If I flood, cause then it's, yeah, that."}, {"time": 2227, "text": "I think that one's not gonna work that well for you."}, {"time": 2229, "text": "It's not gonna work that well for the original copy."}, {"time": 2231, "text": "It probably fits some things."}, {"time": 2233, "text": "Like if you're a public figure and you're trying to have a bunch of, if you're trying to show up in a bunch of different places in the future, you'll be able to do that in the metaverse."}, {"time": 2243, "text": "So that kind of replication I think will be useful."}, {"time": 2246, "text": "But I do think that you're gonna want a notion of like, I am talking to the real one."}, {"time": 2252, "text": "Yeah, especially if the fake ones start outperforming you and all your private relationships and then you're left behind."}, {"time": 2258, "text": "I mean, that's a serious concern I have with clones."}, {"time": 2261, "text": "Again, the things I think about."}, {"time": 2263, "text": "Okay, so I recently got, I use QNAP NAS storage."}, {"time": 2268, "text": "So just storage for video and stuff."}, {"time": 2270, "text": "And I recently got hacked."}, {"time": 2271, "text": "This is the first time for me with ransomware."}, {"time": 2273, "text": "It's not me personally, it's all QNAP devices."}, {"time": 2278, "text": "So the question that people have is about security in general."}, {"time": 2283, "text": "Because I was doing a lot of the right things in terms of security and nevertheless, ransomware basically disabled my device."}, {"time": 2292, "text": "What are the different steps you could take to protect people's data on the security front?"}, {"time": 2296, "text": "I think that there's different solutions for, and strategies where it makes sense to have stuff kind of put behind a fortress, right?"}, {"time": 2305, "text": "So the centralized model versus the decentralizing."}, {"time": 2310, "text": "Then I think both have strengths and weaknesses."}, {"time": 2312, "text": "So I think anyone who says, okay, just decentralize everything, that'll make it more secure."}, {"time": 2316, "text": "I think that that's tough because, I mean, the advantage of something like encryption is that we run the largest encrypted service in the world with WhatsApp."}, {"time": 2327, "text": "And we're one of the first to roll out a multi platform encryption service."}, {"time": 2332, "text": "And that's something that I think was a big advance for the industry."}, {"time": 2337, "text": "And one of the promises that we can basically make because of that, our company doesn't see when you're sending an encrypted message and to an encrypted message, what the content is of what you're sharing."}, {"time": 2347, "text": "So that way, if someone hacks Meta servers, they're not gonna be able to access the WhatsApp message that you're sending to your friend."}, {"time": 2356, "text": "And that I think matters a lot to people because obviously if someone is able to compromise a company's servers and that company has hundreds of millions or billions of people, then that ends up being a very big deal."}, {"time": 2367, "text": "The flip side of that is, okay, all the content is on your phone."}, {"time": 2372, "text": "Are you following security best practices on your phone?"}, {"time": 2375, "text": "If you lose your phone, all your content is gone."}, {"time": 2379, "text": "Maybe you go back up your content from WhatsApp or some other service in an iCloud or something, but then you're just at Apple's whims about, are they gonna go turn over the data to some government or are they gonna get hacked?"}, {"time": 2393, "text": "So a lot of the time it is useful to have data in a centralized place too because then you can train systems that can just do much better personalization."}, {"time": 2404, "text": "I think that in a lot of cases, centralized systems can offer, especially if you're a serious company, you're running the state of the art stuff and you have red teams attacking your own stuff and you're putting out bounty programs and trying to attract some of the best hackers in the world to go break into your stuff all the time."}, {"time": 2450, "text": "So I think you want to adopt that approach as a company and just constantly be hardening yourself."}, {"time": 2456, "text": "Trying to stay one step ahead of the attackers."}, {"time": 2461, "text": "It's an inherently adversarial space."}, {"time": 2463, "text": "I think it's an interesting security is interesting because of the different kind of threats that we've managed over the last five years, there are ones where basically the adversaries keep on getting better and better."}, {"time": 2476, "text": "So trying to kind of interfere with security is certainly one area of this."}, {"time": 2483, "text": "If you have nation states that are trying to interfere in elections or something, they're kind of evolving their tactics."}, {"time": 2489, "text": "Whereas on the other hand, I don't want to be too simplistic about it, but if someone is saying something hateful, people usually aren't getting smarter and smarter about how they say hateful things."}, {"time": 2500, "text": "So maybe there's some element of that, but it's a very small dynamic compared to how advanced attackers and some of these other places get over time."}, {"time": 2509, "text": "I believe most people are good, so they actually get better over time and not being less hateful because they realize it's not fun being hateful."}, {"time": 2520, "text": "That's at least the belief I have."}, {"time": 2521, "text": "But first, bathroom break."}, {"time": 2524, "text": "Sure, okay."}, {"time": 2526, "text": "So we'll come back to AI, but let me ask some difficult questions now."}, {"time": 2531, "text": "Social Dilemma is a popular documentary that raised concerns about the effects of social media on society."}, {"time": 2537, "text": "You responded with a point by point rebuttal titled, What the Social Dilemma Gets Wrong."}, {"time": 2543, "text": "People should read that."}, {"time": 2544, "text": "I would say the key point they make is because social media is funded by ads, algorithms want to maximize attention and engagement and an effective way to do so is to get people angry at each other, increase division and so on."}, {"time": 2560, "text": "Can you steel man their criticisms and arguments that they make in the documentary as a way to understand the concern and as a way to respond to it?"}, {"time": 2573, "text": "Well, yeah, I think that's a good conversation to have."}, {"time": 2576, "text": "I don't happen to agree with the conclusions and I think that they make a few assumptions that are just very big jumps that I don't think are reasonable to make."}, {"time": 2588, "text": "But I understand overall why people would be concerned that our business model and ads in general, we do make more money as people use the service more in general, right?"}, {"time": 2603, "text": "So as a kind of basic assumption, okay, do we have an incentive for people to build a service that people use more?"}, {"time": 2611, "text": "Yes, on a lot of levels."}, {"time": 2612, "text": "I mean, we think what we're doing is good."}, {"time": 2614, "text": "So we think that if people are finding it useful, they'll use it more."}, {"time": 2618, "text": "Or if you just look at it as this sort of, if the only thing we cared about is money, which is not for anyone who knows me, but okay, we're a company."}, {"time": 2627, "text": "So let's say you just kind of simplified it down to that, then would we want people to use the services more?"}, {"time": 2633, "text": "Yes, and then you get to the second question, which is does kind of getting people agitated make them more likely to use the services more?"}, {"time": 2647, "text": "And I think from looking at other media in the world, especially TV, and there's the old news adage, if it bleeds, it leads."}, {"time": 2658, "text": "Like I think that this is, there are a bunch of reasons why someone might think that that kind of provocative content would be the most engaging."}, {"time": 2672, "text": "Now, what I've always found is two things."}, {"time": 2675, "text": "One is that what grabs someone's attention in the near term is not necessarily something that they're going to appreciate having seen or going to be the best over the long term."}, {"time": 2685, "text": "So I think what a lot of people get wrong is that I'm not building this company to make the most money or get people to spend the most time on this in the next quarter or the next year."}, {"time": 2695, "text": "I've been doing this for 17 years at this point, and I'm still relatively young, and I have a lot more that I wanna do over the coming decades."}, {"time": 2703, "text": "So I think that it's too simplistic to say, hey, this might increase time in the near term, therefore, it's what you're gonna do."}, {"time": 2713, "text": "Because I actually think a deeper look at kind of what my incentives are, the incentives of a company that are focused on the long term, is to basically do what people are gonna find valuable over time, not what is gonna draw people's attention today."}, {"time": 2726, "text": "The other thing that I'd say is that, I think a lot of times people look at this from the perspective of media or kind of information or civic discourse, but one other way of looking at this is just that, okay, I'm a product designer, right?"}, {"time": 2742, "text": "Our company, we build products, and a big part of building a product is not just the function and utility of what you're delivering, but the feeling of how it feels, right?"}, {"time": 2752, "text": "And we spend a lot of time talking about virtual reality and how the kind of key aspect of that experience is the feeling of presence, which it's a visceral thing."}, {"time": 2761, "text": "It's not just about the utility that you're delivering, it's about like the sensation."}, {"time": 2765, "text": "And similarly, I care a lot about how people feel when they use our products, and I don't want to build products that make people angry."}, {"time": 2775, "text": "I mean, that's like not, I think, what we're here on this earth to do, is to build something that people spend a bunch of time doing and it just kind of makes them angrier at other people."}, {"time": 2784, "text": "I mean, I think that that's not good."}, {"time": 2786, "text": "That's not what I think would be sort of a good use of our time or a good contribution to the world."}, {"time": 2793, "text": "So, okay, it's like people, they tell us on a per content basis, does this thing, do I like it?"}, {"time": 2800, "text": "Do I love it?"}, {"time": 2800, "text": "Does it make me angry?"}, {"time": 2801, "text": "Does it make me sad?"}, {"time": 2802, "text": "And based on that, we choose to basically show content that makes people angry less, because of course, if you're designing a product and you want people to be able to connect and feel good over a long period of time, then that's naturally what you're gonna do."}, {"time": 2822, "text": "So, I don't know, I think overall, I understand at a high level, if you're not thinking too deeply about it, why that argument might be appealing."}, {"time": 2836, "text": "But I just think if you actually look at what our real incentives are, not just like if we were trying to optimize for the next week, but like as people working on this, like why are we here?"}, {"time": 2850, "text": "And I think it's pretty clear that that's not actually how you would wanna design the system."}, {"time": 2855, "text": "I guess one other thing that I'd say is that, while we're focused on the ads business model, I do think it's important to note that a lot of these issues are not unique to ads."}, {"time": 2865, "text": "I mean, so take like a subscription news business model, for example, I think that has just as many potential pitfalls."}, {"time": 2873, "text": "Maybe if someone's paying for a subscription, you don't get paid per piece of content that they look at, but say for example, I think like a bunch of the partisanship that we see could potentially be made worse by you have these kind of partisan news organizations that basically sell subscriptions and they're only gonna get people on one side to basically subscribe to them."}, {"time": 2899, "text": "So their incentive is not to print content or produce content that's kind of centrist or down the line either."}, {"time": 2907, "text": "I bet that what a lot of them find is that if they produce stuff that's kind of more polarizing or more partisan, then that is what gets the more subscribers."}, {"time": 2916, "text": "So I think that this stuff is all, there's no perfect business model."}, {"time": 2921, "text": "Everything has pitfalls."}, {"time": 2924, "text": "The thing that I think is great about advertising is it makes it so the consumer service is free, which if you believe that everyone should have a voice and everyone should be able to connect, then that's a great thing, as opposed to building a luxury service that not everyone can afford."}, {"time": 2937, "text": "But look, every business model, you have to be careful about how you're implementing what you're doing."}, {"time": 2942, "text": "You responded to a few things there."}, {"time": 2944, "text": "You spoke to the fact that there is a narrative of malevolence, like you're leaning into them, making people angry just because it makes more money in the short term, that kind of thing."}, {"time": 2956, "text": "So you responded to that."}, {"time": 2957, "text": "But there's also kind of reality of human nature."}, {"time": 2962, "text": "Just like you spoke about, there's fights, arguments we get in and we don't like ourselves afterwards, but we got into them anyway."}, {"time": 2970, "text": "So our longterm growth is, I believe for most of us, has to do with learning, challenging yourself, improving, being kind to each other, finding a community of people that you connect with on a real human level, all that kind of stuff."}, {"time": 2990, "text": "But it does seem when you look at social media that a lot of fights break out, a lot of arguments break out, a lot of viral content ends up being sort of outrage in one direction or the other."}, {"time": 3004, "text": "And so it's easy from that to infer the narrative that social media companies are letting this outrage become viral."}, {"time": 3013, "text": "And so they're increasing the division in the world."}, {"time": 3016, "text": "I mean, perhaps you can comment on that or further, how can you be, how can you push back on this narrative?"}, {"time": 3025, "text": "How can you be transparent about this battle?"}, {"time": 3028, "text": "Because I think it's not just motivation or financials, it's a technical problem too, which is how do you improve longterm wellbeing of human beings?"}, {"time": 3043, "text": "I think that going through some of the design decisions would be a good conversation."}, {"time": 3049, "text": "But first, I actually think, I think you acknowledged that, that narrative is somewhat anecdotal."}, {"time": 3056, "text": "And I think it's worth grounding this conversation in the actual research that has been done on this, which by and large finds that social media is not a large driver of polarization, right?"}, {"time": 3070, "text": "And, I mean, there's been a number of economists and social scientists and folks who have studied this."}, {"time": 3078, "text": "In a lot of polarization, it varies around the world."}, {"time": 3081, "text": "If social media is basically in every country, Facebook's in pretty much every country except for China and maybe North Korea."}, {"time": 3087, "text": "And you see different trends in different places where in a lot of countries polarization is declining, in some it's flat, in the US it's risen sharply."}, {"time": 3101, "text": "So the question is, what are the unique phenomenon in the different places?"}, {"time": 3105, "text": "And I think for the people who are trying to say, hey, social media is the thing that's doing this."}, {"time": 3110, "text": "I think that that clearly doesn't hold up because social media is a phenomenon that is pretty much equivalent in all of these different countries."}, {"time": 3117, "text": "And you have researchers like this economist at Stanford, Matthew Genskow, who has just written at length about this."}, {"time": 3125, "text": "And it's a bunch of books by political scientists, Ezra Klein and folks, why we're polarized, basically goes through this decades long analysis in the US."}, {"time": 3137, "text": "Before I was born, basically talking about some of the forces in kind of partisan politics and Fox News and different things that predate the internet in a lot of ways that I think are likely larger contributors."}, {"time": 3150, "text": "So to the contrary on this, not only is it pretty clear that social media is not a major contributor, but most of the academic studies that I've seen actually show that social media use is correlated with lower polarization."}, {"time": 3165, "text": "And Genskow, the same person who just did the study that I cited about longitudinal polarization across different countries, also did a study that basically showed that if you looked after the 2016 election in the US, the voters who were the most polarized were actually the ones who were not on the internet."}, {"time": 3187, "text": "So, and there have been recent other studies, I think in Europe and around the world, basically showing that as people stop using social media, they tend to get more polarized."}, {"time": 3199, "text": "Then there's a deeper analysis around, okay, well, polarization actually isn't even one thing."}, {"time": 3204, "text": "Cause you know, having different opinions on something isn't, I don't think that that's by itself bad."}, {"time": 3208, "text": "What people who study this say is most problematic is what they call affective polarization, which is basically are you, do you have negative feelings towards people of another group?"}, {"time": 3221, "text": "And the way that a lot of scholars study this is they basically ask a group, would you let your kids marry someone of group X?"}, {"time": 3230, "text": "Whatever the groups are that you're worried that someone might have negative feelings towards."}, {"time": 3235, "text": "And in general, use of social media has corresponded to decreases in that kind of affective polarization."}, {"time": 3241, "text": "So I just wanna, I think we should talk through the design decisions and how we handle the kind of specific pieces of content, but overall, I think it's just worth grounding that discussion in the research that's existed that I think overwhelmingly shows that the mainstream narrative around this is just not right."}, {"time": 3261, "text": "But the narrative does take hold and it's compelling to a lot of people."}, {"time": 3267, "text": "There's another question I'd like to ask you on this."}, {"time": 3271, "text": "I was looking at various polls and saw that you're one of the most disliked tech leaders today, 54% unfavorable rating."}, {"time": 3281, "text": "Elon Musk is 23%."}, {"time": 3283, "text": "It's basically everybody has a very high unfavorable rating that are tech leaders."}, {"time": 3288, "text": "Maybe you can help me understand that."}, {"time": 3290, "text": "Why do you think so many people dislike you?"}, {"time": 3294, "text": "Some even hate you."}, {"time": 3296, "text": "And how do you regain their trust and support?"}, {"time": 3299, "text": "Given everything you just said, why are you losing the battle in explaining to people what actual impact social media has on society?"}, {"time": 3312, "text": "Well, I'm curious if that's a US survey or world."}, {"time": 3316, "text": "It is US, yeah."}, {"time": 3317, "text": "So I think that there's a few dynamics."}, {"time": 3319, "text": "One is that our brand has been somewhat uniquely challenged in the US compared to other places."}, {"time": 3329, "text": "It's not that there are."}, {"time": 3329, "text": "I mean, other countries, we have issues too, but I think in the US, there was this dynamic where if you look at like the next sentiment of kind of coverage or attitude towards us, before 2016, I think that there were probably very few months, if any, where it was negative."}, {"time": 3347, "text": "And since 2016, I think that there probably been very few months, if any, then it's been positive."}, {"time": 3353, "text": "But I think it's a specific thing."}, {"time": 3355, "text": "And this is very different from other places."}, {"time": 3356, "text": "So I think in a lot of other countries in the world, the sentiment towards meta and our services is extremely positive."}, {"time": 3364, "text": "In the US, we have more challenges."}, {"time": 3366, "text": "And I think compared to other companies, you can look at certain industries, I think if you look at it from like a partisan perspective, not from like a political perspective, but just kind of culturally, it's like there are people who are probably more left of center and there are people who are more right of center, and there's kind of blue America and red America."}, {"time": 3385, "text": "There are certain industries that I think maybe one half of the country has a more positive view towards than another."}, {"time": 3424, "text": "The net effect of that is that we're kind of constantly making decisions that piss off people in both camps."}, {"time": 3463, "text": "They're just like, ah, you didn't mess that one up."}, {"time": 3466, "text": "But their opinion doesn't tend to go up by that much."}, {"time": 3468, "text": "Whereas the people who kind of are on the other side of it are like, God, how could you mess that up?"}, {"time": 3475, "text": "How could you possibly think that that piece of content is okay and should be up and should not be censored?"}, {"time": 3480, "text": "Or, and so I think the, whereas if you leave it up and, you know, it's, or if you take it down, the people who thought it should be taken down or, you know, it's like, all right, fine, great."}, {"time": 3492, "text": "You didn't mess that one up."}, {"time": 3494, "text": "So our internal assessment of, and the kind of analytics on our brand are basically anytime one of these big controversial things comes up in society, our brand goes down with half of the country."}, {"time": 3506, "text": "And then like, if you, and then if you just kind of extrapolate that out, it's just been very challenging for us to try to navigate what is a polarizing country in a principled way, where we're not trying to kind of hew to one side or the other, we're trying to do what we think is the right thing."}, {"time": 3521, "text": "But that's what I think is the right thing for us to do though."}, {"time": 3524, "text": "So, I mean, that's what we'll try to keep doing."}, {"time": 3527, "text": "Just as a human being, how does it feel though, when you're giving so much of your day to day life to try to heal division, to try to do good in the world, as we've talked about, that so many people in the US, the place you call home have a negative view of you as a leader, as a human being and the company you love?"}, {"time": 3554, "text": "Well, I mean, it's not great, but I mean, look, if I wanted people to think positively about me as a person, I don't know, I'm not sure if you go build a company."}, {"time": 3567, "text": "I mean, it's like."}, {"time": 3568, "text": "Or a social media company."}, {"time": 3570, "text": "It seems exceptionally difficult to do with a social media company."}, {"time": 3572, "text": "Yeah, so, I mean, I don't know, there is a dynamic where a lot of the other people running these companies, internet companies, have sort of stepped back and they just do things that are sort of, I don't know, less controversial."}, {"time": 3589, "text": "And some of it may be that they just get tired over time."}, {"time": 3592, "text": "But, you know, it's, so I don't know."}, {"time": 3595, "text": "I think that, you know, running a company is hard, building something at scale is hard."}, {"time": 3599, "text": "You only really do it for a long period of time if you really care about what you're doing."}, {"time": 3604, "text": "And yeah, so, I mean, it's not great, but like, but look, I think that at some level, whether 25% of people dislike you or 75% of people dislike you, your experience as a public figure is gonna be that there's a lot of people who dislike you, right?"}, {"time": 3623, "text": "So, I actually am not sure how different it is."}, {"time": 3628, "text": "You know, certainly, you know, the country's gotten more polarized and we in particular have gotten, you know, more controversial over the last five or years or so."}, {"time": 3639, "text": "But, I don't know, I kind of think like as a public figure and leader of one of these enterprises."}, {"time": 3648, "text": "Comes with the job."}, {"time": 3649, "text": "Yeah, part of what you do is like, and look, the answer can't just be ignore it, right?"}, {"time": 3654, "text": "Because like a huge part of the job is like you need to be getting feedback and internalizing feedback on how you can do better."}, {"time": 3660, "text": "But I think increasingly what you need to do is be able to figure out, you know, who are the kind of good faith critics who are criticizing you because they're trying to help you do a better job rather than tear you down."}, {"time": 3696, "text": "So I think that that's just kind of a dance that people have to do."}, {"time": 3700, "text": "But I mean, I, you know, so you kind of develop more of a feel for like, who actually is trying to accomplish the same types of things in the world and who has different ideas about how to do that and how can I learn from those people?"}, {"time": 3712, "text": "And like, yeah, we get stuff wrong."}, {"time": 3714, "text": "And when the people whose opinions I respect call me out on getting stuff wrong, that hurts and makes me wanna do better."}, {"time": 3722, "text": "But I think at this point, I'm pretty tuned to just, all right, if someone, if I know they're, they're kind of like operating in bad faith and they're not really trying to help, then, you know, I don't know, it's not, it's, it doesn't, you know, I think over time, it just doesn't bother you that much."}, {"time": 3735, "text": "But you are surrounded by people that believe in the mission that love you."}, {"time": 3741, "text": "Are there friends or colleagues in your inner circle you trust that call you out on your bullshit whenever your thinking may be misguided as it is for leaders at times?"}, {"time": 3750, "text": "I think we have a famously open company culture where we sort of encourage that kind of dissent internally, which is, you know, why there's so much material internally that can leak out with people sort of disagreeing is because that's sort of the culture."}, {"time": 3767, "text": "You know, our management team, I think it's a lot of people, you know, there are some newer folks who come in, there are some folks who've kind of been there for a while, but there's a very high level of trust."}, {"time": 3776, "text": "And I would say it is a relatively confrontational group of people."}, {"time": 3781, "text": "And my friends and family, I think, will push me on this."}, {"time": 3784, "text": "But look, it's not just, but I think you need some diversity, right?"}, {"time": 3789, "text": "It can't just be, you know, people who are your friends and family."}, {"time": 3824, "text": "But, you know, I think fundamentally we're trying to get to the same place in terms of, you know, helping people connect more, helping the whole world function better, not just, you know, one place or another."}, {"time": 3837, "text": "And I don't know, I mean, those are the people whose opinions really matter to me."}, {"time": 3842, "text": "And I just, it's, you know, that's how I learn on a day to day basis."}, {"time": 3845, "text": "People are constantly sending me comments on stuff or links to things they found interesting."}, {"time": 3850, "text": "And I don't know, it's kind of constantly evolving this model of the world and kind of what we should be aspiring to be."}, {"time": 3856, "text": "You've talked about, you have a famously open culture which comes with the criticism and the painful experiences."}, {"time": 3867, "text": "So let me ask you another difficult question."}, {"time": 3870, "text": "Frances Haugen, the Facebook whistleblower, leaked the internal Instagram research into teenagers and wellbeing."}, {"time": 3878, "text": "Her claim is that Instagram is choosing profit over wellbeing of teenage girls."}, {"time": 3883, "text": "So Instagram is quote, toxic for them."}, {"time": 3886, "text": "Your response titled, what our research really says about teen wellbeing and Instagram says, no, Instagram research shows that 11 of 12 wellbeing issues, teenage girls who said they struggle with those difficult issues also said that Instagram made them better rather than worse."}, {"time": 3907, "text": "Again, can you steal man and defend the point and Frances Haugen's characterization of the study and then help me understand the positive and negative effects of Instagram and Facebook on young people?"}, {"time": 3920, "text": "So there are certainly questions around teen mental health that are really important."}, {"time": 3926, "text": "It's hard to, as a parent, it's like hard to imagine any set of questions that are sort of more important."}, {"time": 3932, "text": "I mean, I guess maybe other aspects of physical health or wellbeing are probably come to that level, but like, these are really important questions, right?"}, {"time": 3940, "text": "Which is why we dedicate teams to studying them."}, {"time": 3945, "text": "I don't think the internet or social media are unique in having these questions."}, {"time": 3950, "text": "I mean, I think people and there've been sort of magazines with promoting certain body types for women and kids for decades, but we really care about this stuff."}, {"time": 3961, "text": "So we wanted to study it."}, {"time": 3962, "text": "And of course, we didn't expect that everything was gonna be positive all the time."}, {"time": 3967, "text": "So, I mean, the reason why you study this stuff is to try to improve and get better."}, {"time": 3970, "text": "So, I mean, look, the place where I disagree with the characterization first, I thought some of the reporting and coverage of it just took the whole thing out of proportion and that it focused on, as you said, I think there were like 20 metrics in there and on 18 or 19, the effect of using Instagram was neutral or positive on the teen's wellbeing."}, {"time": 3990, "text": "And there was one area where I think it showed that we needed to improve and we took some steps to try to do that after doing the research."}, {"time": 3998, "text": "But I think having the coverage just focus on that one without focusing on the, I mean, I think an accurate characterization would have been that kids using Instagram or not kids, teens is generally positive for their mental health."}, {"time": 4013, "text": "But of course, that was not the narrative that came out."}, {"time": 4015, "text": "So I think it's hard to, that's not a kind of logical thing to straw man, but I sort of disagree or steel man, but I sort of disagree with that overall characterization."}, {"time": 4024, "text": "I think anyone sort of looking at this objectively would, but then, I mean, there is this sort of intent critique that I think you were getting at before, which says, it assumes some sort of malevolence, right?"}, {"time": 4039, "text": "It's like, which it's really hard for me to really wrap my head around this because as far as I know, it's not clear that any of the other tech companies are doing this kind of research."}, {"time": 4053, "text": "So why the narrative should form that we did research because we were studying an issue because we wanted to understand it to improve and took steps after that to try to improve it, that your interpretation of that would be that we did the research and tried to sweep it under the rug."}, {"time": 4069, "text": "It just, it sort of is like, I don't know, it's beyond credibility to me that like that's the accurate description of the actions that we've taken compared to the others in the industry."}, {"time": 4081, "text": "So I don't know, that's kind of, that's my view on it."}, {"time": 4085, "text": "These are really important issues and there's a lot of stuff that I think we're gonna be working on related to teen mental health for a long time, including trying to understand this better."}, {"time": 4094, "text": "And I would encourage everyone else in the industry to do this too."}, {"time": 4098, "text": "Yeah, I would love there to be open conversations and a lot of great research being released internally and then also externally."}, {"time": 4107, "text": "It doesn't make me feel good to see press obviously get way more clicks when they say negative things about social media."}, {"time": 4119, "text": "Objectively speaking, I can just tell that there's hunger to say negative things about social media."}, {"time": 4126, "text": "And I don't understand how that's supposed to lead to an open conversation about the positives and the negatives, the concerns about social media, especially when you're doing that kind of research."}, {"time": 4139, "text": "I mean, I don't know what to do with that, but let me ask you as a father, there's a weight heavy on you that people get bullied on social networks."}, {"time": 4150, "text": "So people get bullied in their private life."}, {"time": 4153, "text": "But now because so much of our life is in the digital world, the bullying moves from the physical world to the digital world."}, {"time": 4161, "text": "So you're now creating a platform on which bullying happens."}, {"time": 4166, "text": "And some of that bullying can lead to damage to mental health."}, {"time": 4171, "text": "And some of that bullying can lead to depression, even suicide."}, {"time": 4177, "text": "There's a weight heavy on you that people have committed suicide or will commit suicide based on the bullying that happens on social media."}, {"time": 4188, "text": "Yeah, I mean, there's a set of harms that we basically track and build systems to fight against."}, {"time": 4195, "text": "And bullying and self harm are, these are some of the biggest things that we are most focused on."}, {"time": 4210, "text": "For bullying, like you say, it's gonna be, while this predates the internet, then it's probably impossible to get rid of all of it."}, {"time": 4222, "text": "You wanna give people tools to fight it and you wanna fight it yourself."}, {"time": 4227, "text": "And you also wanna make sure that people have the tools to get help when they need it."}, {"time": 4230, "text": "So I think this isn't like a question of, can you get rid of all bullying?"}, {"time": 4234, "text": "I mean, it's like, all right, I mean, I have two daughters and they fight and push each other around and stuff too."}, {"time": 4243, "text": "And the question is just, how do you handle that situation?"}, {"time": 4247, "text": "And there's a handful of things that I think you can do."}, {"time": 4251, "text": "We talked a little bit before around some of the AI tools that you can build to identify when something harmful is happening."}, {"time": 4259, "text": "It's actually, it's very hard in bullying because a lot of bullying is very context specific."}, {"time": 4262, "text": "It's not like you're trying to fit a formula of like, if like looking at the different harms, someone promoting a terrorist group is like, probably one of the simpler things to generally find because things promoting that group are gonna look at a certain way or feel a certain way."}, {"time": 4279, "text": "Bullying could just be, you know, someone making some subtle comment about someone's appearance that's idiosyncratic to them."}, {"time": 4286, "text": "And it could look at just like humor."}, {"time": 4288, "text": "So humor to one person can be destructive to another human being, yeah."}, {"time": 4292, "text": "So with bullying, I think there are certain things that you can find through AI systems, but I think it is increasingly important to just give people more agency themselves."}, {"time": 4304, "text": "So we've done things like making it so people can turn off comments or take a break from hearing from a specific person without having to signal at all that they're gonna stop following them or kind of make some stand that, okay, I'm not friends with you anymore."}, {"time": 4319, "text": "I'm not following you."}, {"time": 4320, "text": "I just like, I just don't wanna hear about this, but I also don't wanna signal at all publicly that or to them that there's been an issue."}, {"time": 4330, "text": "And then you get to some of the more extreme cases like you're talking about where someone is thinking about self harm or suicide."}, {"time": 4339, "text": "And there we've found that that is a place where AI can identify a lot as well as people flagging things."}, {"time": 4348, "text": "If people are expressing something that is potentially they're thinking of hurting themselves, those are cues that you can build systems and hundreds of languages around the world to be able to identify that."}, {"time": 4393, "text": "We're rolling that out in more places around the world."}, {"time": 4395, "text": "And I think the team that worked on that just did awesome stuff."}, {"time": 4399, "text": "So I think that that's a long way of saying, yeah, I mean, this is a heavy topic and you want to attack it in a bunch of different ways and also kind of understand that some of nature is for people to do this to each other, which is unfortunate, but you can give people tools and build things that help."}, {"time": 4420, "text": "It's still one hell of a burden though."}, {"time": 4423, "text": "A platform that allows people to fall in love with each other is also by nature going to be a platform that allows people to hurt each other."}, {"time": 4432, "text": "And when you're managing such a platform, it's difficult."}, {"time": 4437, "text": "And I think you spoke to it, but the psychology of that, of being a leader in that space, of creating technology that's playing in this space, like you mentioned, psychology is really damn difficult."}, {"time": 4450, "text": "And I mean, the burden of that is just great."}, {"time": 4453, "text": "I just wanted to hear you speak to that point."}, {"time": 4458, "text": "I have to ask about the thing you've brought up a few times, which is making controversial decisions."}, {"time": 4466, "text": "Let's talk about free speech and censorship."}, {"time": 4469, "text": "So there are two groups of people pressuring Meta on this."}, {"time": 4473, "text": "One group is upset that Facebook, the social network, allows misinformation in quotes to be spread on the platform."}, {"time": 4481, "text": "The other group are concerned that Facebook censors speech by calling it misinformation."}, {"time": 4486, "text": "So you're getting it from both sides."}, {"time": 4488, "text": "You, in 2019, October at Georgetown University, eloquently defended the importance of free speech, but then COVID came and the 2020 election came."}, {"time": 4504, "text": "Do you worry that outside pressures from advertisers, politicians, the public, have forced Meta to damage the ideal of free speech that you spoke highly of?"}, {"time": 4514, "text": "Just to say some obvious things upfront, I don't think pressure from advertisers or politicians directly in any way affects how we think about this."}, {"time": 4522, "text": "I think these are just hard topics."}, {"time": 4525, "text": "So let me just take you through our evolution from kind of the beginning of the company to where we are now."}, {"time": 4530, "text": "You don't build a company like this unless you believe that people expressing themselves is a good thing, right?"}, {"time": 4535, "text": "So that's sort of the foundational thing."}, {"time": 4538, "text": "You can kind of think about our company as a formula where we think giving people voice and helping people connect creates opportunity, right?"}, {"time": 4547, "text": "So those are the two things that we're always focused on are sort of helping people connect."}, {"time": 4550, "text": "We talked about that a lot, but also giving people voice and ability to express themselves."}, {"time": 4555, "text": "Then by the way, most of the time when people express themselves, that's not like politically controversial content."}, {"time": 4560, "text": "It's like expressing something about their identity that's more related to the avatar conversation we had earlier in terms of expressing some facet, but that's what's important to people on a day to day basis."}, {"time": 4571, "text": "And sometimes when people feel strongly enough about something, it kind of becomes a political topic."}, {"time": 4576, "text": "That's sort of always been a thing that we've focused on."}, {"time": 4579, "text": "There's always been the question of safety in this, which if you're building a community, I think you have to focus on safety."}, {"time": 4586, "text": "We've had these community standards from early on, and there are about 20 different kinds of harm that we track and try to fight actively."}, {"time": 4594, "text": "We've talked about some of them already."}, {"time": 4596, "text": "So it includes things like bullying and harassment."}, {"time": 4600, "text": "It includes things like terrorism or promoting terrorism, inciting violence, intellectual property theft."}, {"time": 4609, "text": "And in general, I think call it about 18 out of 20 of those."}, {"time": 4613, "text": "There's not really a particularly polarized definition of that."}, {"time": 4619, "text": "I think you're not really gonna find many people in the country or in the world who are trying to say we should be fighting terrorist content less."}, {"time": 4629, "text": "I think the content where there are a couple of areas where I think that this has gotten more controversial recently, which I'll talk about."}, {"time": 4636, "text": "And you're right, the misinformation is basically is up there."}, {"time": 4640, "text": "And I think sometimes the definition of hate speech is up there too."}, {"time": 4642, "text": "But I think in general, most of the content that I think we're working on for safety is not actually, people don't kind of have these questions."}, {"time": 4652, "text": "So it's sort of this subset."}, {"time": 4655, "text": "But if you go back to the beginning of the company, this was sort of pre deep learning days."}, {"time": 4662, "text": "And therefore, it was me and my roommate Dustin join me."}, {"time": 4667, "text": "And if someone posted something bad, it was the AI technology did not exist yet to be able to go basically look at all the content."}, {"time": 4682, "text": "And we were a small enough outfit that no one would expect that we could review it all."}, {"time": 4688, "text": "Even if someone reported it to us, we basically did our best, right?"}, {"time": 4691, "text": "It's like someone would report it and we try to look at stuff and deal with stuff."}, {"time": 4696, "text": "And for call it the first seven or eight years of the company, we weren't that big of a company."}, {"time": 4706, "text": "For a lot of that period, we weren't even really profitable."}, {"time": 4708, "text": "The AI didn't really exist to be able to do the kind of moderation that we do today."}, {"time": 4712, "text": "And then at some point in kind of the middle of the last decade, that started to flip."}, {"time": 4718, "text": "And we got to the point where we were sort of a larger and more profitable company."}, {"time": 4725, "text": "And the AI was starting to come online to be able to proactively detect some of the simpler forms of this."}, {"time": 4732, "text": "So things like pornography, you could train an image classifier to identify what a nipple was, or you can fight against terrorist content."}, {"time": 4741, "text": "You still could."}, {"time": 4742, "text": "There's actually papers on this, it's great."}, {"time": 4743, "text": "Oh, of course there are."}, {"time": 4744, "text": "Technical papers."}, {"time": 4746, "text": "Those are relatively easier things to train AI to do than for example, understand the nuances of what is inciting violence in a hundred languages around the world and not have the false positives of like, okay, are you posting about this thing that might be inciting violence because you're actually trying to denounce it?"}, {"time": 4766, "text": "In which case we probably shouldn't take that down."}, {"time": 4768, "text": "Where if you're trying to denounce something that's inciting violence in some kind of dialect in a corner of India, as opposed to, okay, actually you're posting this thing because you're trying to incite violence."}, {"time": 4779, "text": "Okay, building an AI that can basically get to that level of nuance and all the languages that we serve is something that I think is only really becoming possible now, not towards the middle of the last decade."}, {"time": 4791, "text": "But there's been this evolution, and I think what happened, people sort of woke up after 2016 and a lot of people are like, okay, the country is a lot more polarized and there's a lot more stuff here than we realized."}, {"time": 4808, "text": "Why weren't these internet companies on top of this?"}, {"time": 4811, "text": "And I think at that point it was reasonable feedback that some of this technology had started becoming possible."}, {"time": 4822, "text": "And at that point, I really did feel like we needed to make a substantially larger investment."}, {"time": 4827, "text": "We'd already worked on this stuff a lot, on AI and on these integrity problems, but that we should basically invest, have a thousand or more engineers basically work on building these AI systems to be able to go and proactively identify the stuff across all these different areas."}, {"time": 4843, "text": "Okay, so we went and did that."}, {"time": 4845, "text": "Now we've built the tools to be able to do that."}, {"time": 4848, "text": "And now I think it's actually a much more complicated set of philosophical rather than technical questions, which is the exact policies, which are okay."}, {"time": 4856, "text": "Now, the way that we basically hold ourselves accountable is we issue these transparency reports every quarter and the metric that we track is for each of these 20 types of harmful content."}, {"time": 4870, "text": "How much of that content are we taking down before someone even has to report it to us?"}, {"time": 4874, "text": "So how effective is our AI at doing this?"}, {"time": 4877, "text": "But that basically creates this big question, which is okay, now we need to really be careful about how proactive we set the AI and where the exact policy lines are around what we're taking down."}, {"time": 4890, "text": "It's certainly at a point now where I felt like at the beginning of that journey of building those AI systems, there was a lot of push."}, {"time": 4903, "text": "There's saying, okay, you've got to do more."}, {"time": 4904, "text": "There's clearly a lot more bad content that people aren't reporting or that you're not getting to and you need to get more effective at that."}, {"time": 4911, "text": "And I was pretty sympathetic to that."}, {"time": 4912, "text": "But then I think at some point along the way, there started to be almost equal issues on both sides of, okay, actually you're kind of taking down too much stuff, right?"}, {"time": 4922, "text": "Or some of the stuff is borderline and it wasn't really bothering anyone and they didn't report it."}, {"time": 4929, "text": "So is that really an issue that you need to take down?"}, {"time": 4933, "text": "Whereas we still have the critique on the other side too where a lot of people think we're not doing enough."}, {"time": 4938, "text": "So it's become, as we built the technical capacity, I think it becomes more philosophically interesting almost where you wanna be on the line."}, {"time": 4947, "text": "And I just think you don't want one person making those decisions."}, {"time": 4952, "text": "So we've also tried to innovate in terms of building out this independent oversight board, which has people who are dedicated to free expression but from around the world who people can appeal cases to."}, {"time": 4963, "text": "So a lot of the most controversial cases basically go to them and they make the final binding decision on how we should handle that."}, {"time": 4969, "text": "And then of course, their decisions, we then try to figure out what the principles are behind those and encode them into the algorithms."}, {"time": 4975, "text": "And how are those people chosen, which, you know, you're outsourcing a difficult decision."}, {"time": 4980, "text": "Yeah, the initial people, we chose a handful of chairs for the group and we basically chose the people for a commitment to free expression and like a broad understanding of human rights and the trade offs around free expression."}, {"time": 5001, "text": "So they fundamentally people who are gonna lean towards free expression."}, {"time": 5004, "text": "Towards freedom of speech."}, {"time": 5006, "text": "Okay, so there's also this idea of fact checkers."}, {"time": 5008, "text": "So jumping around to the misinformation questions, especially during COVID, which is an exceptionally speaking of polarization."}, {"time": 5016, "text": "Can I speak to the COVID thing?"}, {"time": 5018, "text": "I mean, I think one of the hardest set of questions around free expression, because you asked about Georgetown has my stance fundamentally changed?"}, {"time": 5023, "text": "And the answer to that is no, my stance has not changed."}, {"time": 5028, "text": "It is fundamentally the same as when I was talking at Georgetown from a philosophical perspective."}, {"time": 5036, "text": "The challenge with free speech is that everyone agrees that there is a line where if you're actually about to do physical harm to people that there should be restrictions."}, {"time": 5050, "text": "So, I mean, there's the famous Supreme Court historical example of like, you can't yell fire in a crowded theater."}, {"time": 5058, "text": "The thing that everyone disagrees on is what is the definition of real harm?"}, {"time": 5062, "text": "Where I think some people think, okay, this should only be a very literal, I mean, take it back to the bullying conversation we were just having, where is it just harm if the person is about to hurt themselves because they've been bullied so hard?"}, {"time": 5076, "text": "Or is it actually harm like as they're being bullied?"}, {"time": 5079, "text": "And kind of at what point in the spectrum is that?"}, {"time": 5082, "text": "And that's the part that there's not agreement on."}, {"time": 5084, "text": "But I think what people agree on pretty broadly is that when there is an acute threat that it does make sense from a societal perspective to tolerate less speech."}, {"time": 5097, "text": "That could be potentially harmful in that acute situation."}, {"time": 5099, "text": "So I think where COVID got very difficult is, I don't think anyone expected this to be going on for years."}, {"time": 5106, "text": "But if you'd kind of asked now a priori, would a global pandemic where a lot of people are dying and catching this, is that an emergency that where you'd kind of consider it that it's problematic to basically yell fire in a crowded theater?"}, {"time": 5126, "text": "I think that that probably passes that test."}, {"time": 5129, "text": "So I think that it's a very tricky situation, but I think the fundamental commitment to free expression is there."}, {"time": 5138, "text": "And that's what I believe."}, {"time": 5139, "text": "And again, I don't think you start this company unless you care about people being able to express themselves as much as possible."}, {"time": 5144, "text": "But I think that that's the question, is how do you define what the harm is and how acute that is?"}, {"time": 5152, "text": "And what are the institutions that define that harm?"}, {"time": 5155, "text": "A lot of the criticism is that the CDC, the WHO, the institutions we've come to trust as a civilization to give the line of what is and isn't harm in terms of health policy have failed in many ways, in small ways and in big ways, depending on who you ask."}, {"time": 5174, "text": "And then the perspective of meta and Facebook is like, well, where the hell do I get the information of what is and isn't misinformation?"}, {"time": 5182, "text": "So it's a really difficult place to be in, but it's great to hear that you're leaning towards freedom of speech on this aspect."}, {"time": 5190, "text": "And again, I think this actually calls to the fact that we need to reform institutions that help keep an open mind of what is and isn't misinformation."}, {"time": 5199, "text": "And misinformation has been used to bully on the internet."}, {"time": 5204, "text": "I mean, I just have, I'm friends with Joe Rogan and he is called as a, I remember hanging out with him in Vegas and somebody yelled, stop spreading misinformation."}, {"time": 5214, "text": "I mean, and there's a lot of people that follow him that believe he's not spreading misinformation."}, {"time": 5219, "text": "Like you can't just not acknowledge the fact that there's a large number of people that have a different definition of misinformation."}, {"time": 5228, "text": "And that's such a tough place to be."}, {"time": 5230, "text": "Like who do you listen to?"}, {"time": 5231, "text": "Do you listen to quote unquote experts who gets, as a person who has a PhD, I gotta say, I mean, I'm not sure I know what defines an expert, especially in a new, in a totally new pandemic or a new catastrophic event, especially when politics is involved and especially when the news are, the media involved that can propagate sort of outrageous narratives and thereby make a lot of money."}, {"time": 5260, "text": "Like what the hell?"}, {"time": 5261, "text": "Where's the source of truth?"}, {"time": 5263, "text": "And then everybody turns to Facebook."}, {"time": 5265, "text": "It's like, please tell me what the source of truth is."}, {"time": 5269, "text": "Well, I mean, well, how would you handle this if you were in my position?"}, {"time": 5272, "text": "Is very, very, very, very difficult."}, {"time": 5275, "text": "I would say, I would more speak about how difficult the choices are and be transparent about like, what the hell do you do with this?"}, {"time": 5285, "text": "Like here, you got exactly, ask the exact question you just asked me, but to the broader public, like, okay, yeah, you guys tell me what to do."}, {"time": 5292, "text": "So like crowdsource it."}, {"time": 5294, "text": "And then the other aspect is when you spoke really eloquently about the fact that there's this going back and forth and now there's a feeling like you're censoring a little bit too much."}, {"time": 5306, "text": "So I would lean, I would try to be ahead of that feeling."}, {"time": 5310, "text": "I would now lean towards freedom of speech and say, we're not the ones that are going to define misinformation."}, {"time": 5316, "text": "Let it be a public debate, let the idea stand."}, {"time": 5320, "text": "And I actually place, this idea of misinformation, I place the responsibility on the poor communication skills of scientists."}, {"time": 5330, "text": "They should be in the battlefield of ideas and everybody who is spreading information against the vaccine, they should not be censored."}, {"time": 5340, "text": "They should be talked with and you should show the data, you should have open discussion as opposed to rolling your eyes and saying, I'm the expert, I know what I'm talking about."}, {"time": 5349, "text": "No, you need to convince people, it's a battle of ideas."}, {"time": 5353, "text": "So that's the whole point of freedom of speech."}, {"time": 5355, "text": "It's the way to defeat bad ideas is with good ideas, with speech."}, {"time": 5360, "text": "So like the responsibility here falls on the poor communication skills of scientists."}, {"time": 5366, "text": "Thanks to social media, scientists are not communicators."}, {"time": 5372, "text": "They have the power to communicate."}, {"time": 5374, "text": "Some of the best stuff I've seen about COVID from doctors is on social media."}, {"time": 5378, "text": "It's a way to learn to respond really quickly, to go faster than the peer review process."}, {"time": 5383, "text": "And so they just need to get way better at that communication."}, {"time": 5386, "text": "And also by better, I don't mean just convincing, I also mean speak with humility, don't talk down to people, all those kinds of things."}, {"time": 5394, "text": "And as a platform, I would say, I would step back a little bit."}, {"time": 5399, "text": "Not all the way, of course, because there's a lot of stuff that can cause real harm as we've talked about, but you lean more towards freedom of speech because then people from a brand perspective wouldn't be blaming you for the other ills of society, which there are many."}, {"time": 5414, "text": "The institutions have flaws, the political divide, obviously politicians have flaws, that's news."}, {"time": 5423, "text": "The media has flaws that they're all trying to work with."}, {"time": 5428, "text": "And because of the central place of Facebook in the world, all of those flaws somehow kind of propagate to Facebook."}, {"time": 5434, "text": "And you're sitting there as Plato, the philosopher, have to answer to some of the most difficult questions asking, being asked of human civilization."}, {"time": 5443, "text": "So I don't know, maybe this is an American answer though, to lean towards freedom of speech."}, {"time": 5448, "text": "I don't know if that applies globally."}, {"time": 5451, "text": "So yeah, I don't know."}, {"time": 5452, "text": "But transparency and saying, I think as a technologist, one of the things I sense about Facebook and meta when people talk about this company is they don't necessarily understand fully how difficult the problem is."}, {"time": 5466, "text": "You talked about AI has to catch a bunch of harmful stuff really quickly."}, {"time": 5471, "text": "Just the sea of data you have to deal with."}, {"time": 5474, "text": "It's a really difficult problem."}, {"time": 5476, "text": "So like any of the critics, if you just hand them the helm for a week, let's see how well you can do."}, {"time": 5485, "text": "Like that, to me, that's definitely something that would wake people up to how difficult this problem is if there's more transparency of saying how difficult this problem is."}, {"time": 5495, "text": "Let me ask you about, on the AI front, just because you mentioned language and my ineloquence."}, {"time": 5501, "text": "Translation is something I wanted to ask you about."}, {"time": 5504, "text": "And first, just to give a shout out to the supercomputer."}, {"time": 5507, "text": "You've recently announced the AI research supercluster, RSC."}, {"time": 5511, "text": "Obviously, I'm somebody who loves the GPUs."}, {"time": 5514, "text": "It currently has 6,000 GPUs."}, {"time": 5517, "text": "NVIDIA DGX A100 is the systems that have in total 6,000 GPUs."}, {"time": 5524, "text": "And it will eventually, maybe this year, maybe soon, will have 16,000 GPUs."}, {"time": 5530, "text": "So it can do a bunch of different kinds of machine learning applications."}, {"time": 5535, "text": "There's a cool thing on the distributed storage aspect and all that kind of stuff."}, {"time": 5539, "text": "So one of the applications that I think is super exciting is translation, real time translation."}, {"time": 5546, "text": "I mentioned to you that having a conversation, I speak Russian fluently, I speak English somewhat fluently, and having a conversation with Vladimir Putin, say, as a use case."}, {"time": 5556, "text": "Me, as a user, coming to you as a use case."}, {"time": 5558, "text": "We both speak each other's language."}, {"time": 5562, "text": "I speak Russian, he speaks English."}, {"time": 5565, "text": "How can we have that communication go well with the help of AI?"}, {"time": 5569, "text": "I think it's such a beautiful and a powerful application of AI to connect the world, that bridge the gap, not necessarily between me and Putin, but people that don't have that shared language."}, {"time": 5581, "text": "Can you just speak about your vision with translation?"}, {"time": 5584, "text": "Because I think that's a really exciting application."}, {"time": 5586, "text": "If you're trying to help people connect all around the world, a lot of content is produced in one language and people in all these other places are interested in it."}, {"time": 5594, "text": "So being able to translate that just unlocks a lot of value on a day to day basis."}, {"time": 5600, "text": "I mean, so the kind of AI around translation is interesting because it's gone through a bunch of iterations."}, {"time": 5607, "text": "But the basic state of the art is that you don't wanna go through different kind of intermediate symbolic representations of language or something like that."}, {"time": 5622, "text": "You basically wanna be able to map the concepts and basically go directly from one language to another."}, {"time": 5629, "text": "And you just can train bigger and bigger models in order to be able to do that."}, {"time": 5634, "text": "And that's where the research supercluster comes in is basically a lot of the trend in machine learning is just you're building bigger and bigger models and you just need a lot of computation to train them."}, {"time": 5645, "text": "So it's not that like the translation would run on the supercomputer, the training of the model, which could have billions or trillions of examples of just basically that."}, {"time": 5659, "text": "You're training models on this supercluster in days or weeks that might take a much longer period of time on a smaller cluster."}, {"time": 5668, "text": "So it just wouldn't be practical for most teams to do."}, {"time": 5670, "text": "But the translation work, we're basically getting from being able to go between about a hundred languages seamlessly today to being able to go to about 300 languages in the near term."}, {"time": 5686, "text": "So from any language to any other language."}, {"time": 5689, "text": "And part of the issue when you get closer to more languages is some of these get to be pretty, not very popular languages, right?"}, {"time": 5701, "text": "Where there isn't that much content in them."}, {"time": 5704, "text": "So you end up having less data and you need to kind of use a model that you've built up around other examples."}, {"time": 5712, "text": "And this is one of the big questions around AI is like how generalizable can things be?"}, {"time": 5716, "text": "And that I think is one of the things that's just kind of exciting here from a technical perspective."}, {"time": 5721, "text": "But capturing, we talked about this with the metaverse, capturing the magic of human to human interaction."}, {"time": 5726, "text": "So me and Putin, okay."}, {"time": 5729, "text": "Again, this is therapy session."}, {"time": 5730, "text": "I mean, it's a tough example because you actually both speak Russian and English."}, {"time": 5733, "text": "No, but that's."}, {"time": 5734, "text": "But in the future."}, {"time": 5735, "text": "I see it as a touring test of a kind because we would both like to have an AI that improves because I don't speak Russian that well."}, {"time": 5742, "text": "He doesn't speak English that well."}, {"time": 5745, "text": "It would be nice to outperform our abilities and it sets a really nice bar because I think AI can really help in translation for people that don't speak the language at all, but to actually capture the magic of the chemistry, the translation, which would make the metaverse super immersive."}, {"time": 5764, "text": "I mean, that's exciting."}, {"time": 5765, "text": "You remove the barrier of language, period."}, {"time": 5768, "text": "Yeah, so when people think about translation, I think a lot of that is they're thinking about text to text, but speech to speech, I think is a whole nother thing."}, {"time": 5777, "text": "And I mean, one of the big lessons on that, which I was referring to before is I think early models, it's like, all right, they take speech, they translate it to text, translate the text to another language and then kind of output that as speech in that language."}, {"time": 5789, "text": "And you don't wanna do that."}, {"time": 5790, "text": "You just wanna be able to go directly from speech in one language to speech in another language and build up the models to do that."}, {"time": 5796, "text": "And I mean, I think one of the, there have been, when you look at the progress in machine learning, there have been big advances in the techniques, some of the advances in self supervised learning, which I know you talked to Jan about and he's like one of the leading thinkers in this area."}, {"time": 5815, "text": "I just think that that stuff is really exciting, but then you couple that with the ability to just throw larger and larger amounts of compute at training these models."}, {"time": 5824, "text": "And you can just do a lot of things that were harder to do before."}, {"time": 5829, "text": "But we're asking more of our systems too, right?"}, {"time": 5832, "text": "So if you think about the applications that we're gonna need for the metaverse, or think about it, okay, so let's talk about AR here for a second."}, {"time": 5841, "text": "You're gonna have these glasses, they're gonna look hopefully like a normal ish looking pair of glasses, but they're gonna be able to put holograms in the world and intermix virtual and physical objects in your scene."}, {"time": 5855, "text": "And one of the things that's gonna be unique about this compared to every other computing device that you've had before, is that this is gonna be the first computing device that has all the same signals about what's going on around you that you have."}, {"time": 5869, "text": "Right, so your phone, you can have it take a photo or a video, but I mean, these glasses are gonna, whenever you activate them, they're gonna be able to see what you see from your perspective, they're gonna be able to hear what you hear because the microphones and all that are gonna be right around where your ears are."}, {"time": 5885, "text": "So you're gonna want an AI assistant, that's a new kind of AI assistant that can basically help you process the world from this first person perspective or from the perspective that you have."}, {"time": 5898, "text": "And the utility of that is gonna be huge, but the kinds of AI models that we're gonna need are going to be just, I don't know, there's a lot that we're gonna need to basically make advances in."}, {"time": 5911, "text": "But I mean, but that's why I think these concepts of the metaverse and the advances in AI are so fundamentally interlinked that I mean, they're kind of enabling each other."}, {"time": 5922, "text": "Yeah, like the world builder is a really cool idea."}, {"time": 5925, "text": "Like you can be like a Bob Ross, like I'm gonna put a little tree right here."}, {"time": 5929, "text": "I need a little tree, it's missing a little tree."}, {"time": 5931, "text": "And then, but at scale, like enriching your experience in all kinds of ways."}, {"time": 5935, "text": "You mentioned the assistant too, that's really interesting how you can have AI assistants helping you out on different levels of sort of intimacy of communication."}, {"time": 5944, "text": "It could be just like scheduling or it could be like almost like therapy."}, {"time": 5948, "text": "Clearly I need some."}, {"time": 5949, "text": "So let me ask you, you're one of the most successful people ever."}, {"time": 5954, "text": "You've built an incredible company that has a lot of impact."}, {"time": 5963, "text": "How to live a life they can be proud of?"}, {"time": 5965, "text": "How to build something that can have a big positive impact on the world?"}, {"time": 5971, "text": "Well, let's break that down."}, {"time": 5977, "text": "Cause I think you proud of, have a big positive impact."}, {"time": 5981, "text": "Well, you're actually listening."}, {"time": 5982, "text": "And how to live your life are actually three different things that I think, I mean, they could line up, but, and also like what age of people are you talking to?"}, {"time": 5992, "text": "Cause I mean, I can like."}, {"time": 5993, "text": "High school and college."}, {"time": 5994, "text": "So you don't really know what you're doing, but your dream big."}, {"time": 5998, "text": "And you really have a chance to do something unprecedented."}, {"time": 6004, "text": "So I guess just to."}, {"time": 6005, "text": "Also for people my age."}, {"time": 6006, "text": "Okay, so let's maybe start with the kind of most philosophical and abstract version of this."}, {"time": 6012, "text": "Every night when I put my daughters to bed, we go through this thing and like, they call it the good night things."}, {"time": 6021, "text": "Cause we're basically what we talk about at night."}, {"time": 6025, "text": "And I just, I go through them."}, {"time": 6029, "text": "Sounds like a good show."}, {"time": 6031, "text": "The good night things."}, {"time": 6033, "text": "Priscilla's always asking, she's like, can I get good night things?"}, {"time": 6036, "text": "You go to bed too early."}, {"time": 6037, "text": "But it's, but I basically go through with Max and Augie, what are the things that are most important in life?"}, {"time": 6049, "text": "That I just, it's like, what do I want them to remember and just have like really ingrained in them as they grow up?"}, {"time": 6053, "text": "And it's health, right?"}, {"time": 6056, "text": "Making sure that you take care of yourself and keep yourself in good shape, loving friends and family, right?"}, {"time": 6062, "text": "Because having the relationships, the family and making time for friends, I think is perhaps one of the most important things."}, {"time": 6073, "text": "And then the third is maybe a little more amorphous, but it is something that you're excited about for the future."}, {"time": 6079, "text": "And when I'm talking to a four year old, often I'll ask her what she's excited about for tomorrow or the week ahead."}, {"time": 6085, "text": "But I think for most people, it's really hard."}, {"time": 6089, "text": "I mean, the world is a heavy place."}, {"time": 6091, "text": "And I think like the way that we navigate it is that we have things that we're looking forward to."}, {"time": 6097, "text": "So whether it is building AR glasses for the future or being able to celebrate my 10 year wedding anniversary with my wife that's coming up, it's like, I think people, you know, you have things that you're looking forward to."}, {"time": 6111, "text": "Or for the girls, it's often I want to see mom in the morning, right?"}, {"time": 6114, "text": "It's just, but it's like that's a really critical thing."}, {"time": 6117, "text": "And then the last thing is I ask them every day, what did you do today to help someone?"}, {"time": 6124, "text": "Because I just think that that's a really critical thing is like, it's easy to kind of get caught up in yourself and kind of stuff that's really far down the road, but like, did you do something just concrete today to help someone?"}, {"time": 6138, "text": "And, you know, it can just be as simple as, okay, yeah, I helped set the table for lunch, right?"}, {"time": 6143, "text": "Or, you know, this other kid in our school was having a hard time with something and I like helped explain it to him."}, {"time": 6149, "text": "But in that those are, that's sort of like, if you were to boil down my overall life philosophy into what I try to impart to my kids, those are the things that I think are really important."}, {"time": 6163, "text": "So, okay, so let's say college."}, {"time": 6164, "text": "So if you're a graduate in college, probably more practical advice, I'm always very focused on people."}, {"time": 6173, "text": "And I think the most important decision you're probably gonna make if you're in college is who you surround yourself with, because you become like the people you surround yourself with."}, {"time": 6184, "text": "And I sort of have this hiring heuristic at Metta, which is that I will only hire someone to work for me if I could see myself working for them."}, {"time": 6197, "text": "Not necessarily that I want them to run the company because I like my job, but in an alternate universe, if it was their company and I was looking to go work somewhere, would I be happy to work for them?"}, {"time": 6207, "text": "And I think that that's a helpful heuristic to help balance, you know, when you're building something like this, there's a lot of pressure to, you know, you wanna build out your team, because there's a lot of stuff that you need to get done."}, {"time": 6219, "text": "And everyone always says, don't compromise on quality, but there's this question of, okay, well, how do you know that someone is good enough?"}, {"time": 6224, "text": "And I think my answer is, I would want someone to be on my team if I would work for them."}, {"time": 6230, "text": "But I think it's actually a pretty similar answer to like, if you were choosing friends or a partner or something like that."}, {"time": 6239, "text": "So when you're kind of in college, trying to figure out what your circle is gonna be, trying to figure out, you know, you're evaluating data, your circle is gonna be trying to figure out, you know, you're evaluating different job opportunities."}, {"time": 6273, "text": "But I don't know, I think probably people are too, in general, objective focused, and maybe not focused enough on the connections and the people who they're basically building relationships with."}, {"time": 6287, "text": "I don't know what it says about me, but my place in Austin now has seven legged robots."}, {"time": 6293, "text": "So I'm surrounded myself by robots, which is probably something I should look into."}, {"time": 6299, "text": "What kind of world would you like to see your daughters grow up in, even after you're gone?"}, {"time": 6309, "text": "Well, I think one of the promises of all the stuff that is getting built now is that it can be a world where more people can just live out their imagination."}, {"time": 6321, "text": "One of my favorite quotes, I think it was attributed to Picasso, it's that all children are artists, and the challenge is how do you remain one when you grow up?"}, {"time": 6329, "text": "And if you have kids, this is pretty clear, I mean, they just have wonderful imaginations."}, {"time": 6336, "text": "And part of what I think is gonna be great about the creator economy and the metaverse and all this stuff is this notion around that a lot more people in the future are gonna get to work doing creative stuff than what I think today we would just consider traditional labor or service."}, {"time": 6353, "text": "And I think that that's awesome."}, {"time": 6356, "text": "And that's a lot of what people are here to do is collaborate together, work together, think of things that you wanna build and go do it."}, {"time": 6366, "text": "And I don't know, one of the things that I just think is striking, so I teach my daughters some basic coding with Scratch."}, {"time": 6373, "text": "I mean, they're still obviously really young, but I think of coding as building, where it's like when I'm coding, I'm building something that I want to exist."}, {"time": 6382, "text": "But my youngest daughter, she's very musical and pretty artistic and she thinks about coding as art."}, {"time": 6392, "text": "She calls it code art, not the code, but the output of what she is making."}, {"time": 6397, "text": "It's like, she's just very interesting visually in what she can kind of output and how it can move around."}, {"time": 6402, "text": "And do we need to fix that?"}, {"time": 6407, "text": "Do we have to clap, Alexa?"}, {"time": 6409, "text": "Yeah, so I was just talking about Augie and her code art, but I mean, to me, this is like a beautiful thing, right?"}, {"time": 6416, "text": "The notion that like for me, coding was this functional thing and I enjoyed it."}, {"time": 6421, "text": "And it like helped build something utilitarian, but that for the next generation of people, it will be even more an expression of their kind of imagination and artistic sense for what they want to exist."}, {"time": 6435, "text": "So I don't know if that happens, if we can help bring about this world where a lot more people can, that that's like their existence going forward is being able to basically create and live out all these different kinds of art."}, {"time": 6452, "text": "I just think that that's like a beautiful and wonderful thing and will be very freeing for humanity to spend more of our time on the things that matter to us."}, {"time": 6460, "text": "Yeah, allow more and more people to express their art in the full meaning of that word."}, {"time": 6465, "text": "That's a beautiful vision."}, {"time": 6466, "text": "We mentioned that you are mortal."}, {"time": 6476, "text": "And are you afraid of it?"}, {"time": 6481, "text": "You didn't sign up for this on a podcast, did you?"}, {"time": 6483, "text": "No, I mean, it's an interesting question."}, {"time": 6487, "text": "I mean, I'm definitely aware of it."}, {"time": 6488, "text": "I do a fair amount of like extreme sport type stuff."}, {"time": 6493, "text": "So like, so I'm definitely aware of it."}, {"time": 6499, "text": "And you're flirting with it a bit."}, {"time": 6502, "text": "I train hard."}, {"time": 6503, "text": "I mean, so it's like, if I'm gonna go out in like a 15 foot wave."}, {"time": 6507, "text": "Go out big."}, {"time": 6508, "text": "Well, then it's like, all right, I'll make sure we have the right safety gear and like make sure that I'm like used to that spot and all that stuff."}, {"time": 6515, "text": "But like, but you know, I mean, you."}, {"time": 6517, "text": "The risk is still there."}, {"time": 6518, "text": "You take some head blows along the way."}, {"time": 6520, "text": "Yes, but definitely aware of it."}, {"time": 6525, "text": "Definitely would like to stay safe."}, {"time": 6528, "text": "I have a lot of stuff that I want to build and want to."}, {"time": 6532, "text": "Does it freak you out that it's finite though?"}, {"time": 6535, "text": "That there's a deadline when it's all over and that there'll be a time when your daughters are around and you're gone?"}, {"time": 6543, "text": "That doesn't freak me out."}, {"time": 6549, "text": "Constraints are helpful."}, {"time": 6557, "text": "Yeah, the finiteness makes ice cream taste more delicious somehow."}, {"time": 6561, "text": "The fact that it's gonna be over."}, {"time": 6563, "text": "There's something about that with the metaverse too."}, {"time": 6565, "text": "You want, we talked about this identity earlier, like having just one, like NFTs."}, {"time": 6570, "text": "There's something powerful about the constraint of finiteness or uniqueness."}, {"time": 6576, "text": "That this moment is singular in history."}, {"time": 6579, "text": "But I mean, a lot of, as you go through different waves of technology, I think a lot of what is interesting is what becomes in practice infinite or kind of there can be many, many of a thing and then what ends up still being constrained."}, {"time": 6593, "text": "So the metaverse should hopefully allow a very large number or maybe in practice, hopefully close to an infinite amount of expression and worlds, but we'll still only have a finite amount of time."}, {"time": 6612, "text": "I think living longer I think is good."}, {"time": 6618, "text": "And obviously all of my, our philanthropic work is, it's not focused on longevity, but it is focused on trying to achieve what I think is a possible goal in this century, which is to be able to cure, prevent or manage all diseases."}, {"time": 6633, "text": "So I certainly think people kind of getting sick and dying is a bad thing because, and I'm dedicating almost all of my capital towards advancing research in that area to push on that, which I mean, we could do a whole, another one of these podcasts about that because that's a fascinating topic."}, {"time": 6649, "text": "I mean, this is with your wife Priscilla Chan, you formed the Chan Zuckerberg Initiative, gave away 99% or pledged to give away 99% of Facebook non meta shares."}, {"time": 6659, "text": "I mean, like you said, we could talk forever about all the exciting things you're working on there, including the sort of moonshot of eradicating disease by the mid century marker."}, {"time": 6673, "text": "I don't actually know if you're gonna ever eradicate it, but I think you can get to a point where you can either cure things that happened, right?"}, {"time": 6680, "text": "So people get diseases, but you can cure them."}, {"time": 6682, "text": "Prevent is probably closest to eradication or just be able to manage as sort of like ongoing things that are not gonna ruin your life."}, {"time": 6693, "text": "And I think that that's possible."}, {"time": 6694, "text": "I think saying that there's gonna be no disease at all probably is not possible within the next several decades."}, {"time": 6701, "text": "Basic thing is increase the quality of life and maybe keep the finiteness because it makes everything taste more delicious."}, {"time": 6710, "text": "Maybe that's just being a romantic 20th century human."}, {"time": 6714, "text": "Maybe, but I mean, but it was an intentional decision to not focus on our philanthropy on like explicitly on longevity or living forever."}, {"time": 6726, "text": "If at the moment of your death, and by the way, I like that the lights went out when we started talking about death."}, {"time": 6733, "text": "You get to meet God."}, {"time": 6734, "text": "It does make it a lot more dramatic."}, {"time": 6737, "text": "I should get closer to the mic."}, {"time": 6739, "text": "At the moment of your death, you get to meet God and you get to ask one question."}, {"time": 6746, "text": "What question would you like to ask?"}, {"time": 6749, "text": "Or maybe a whole conversation."}, {"time": 6752, "text": "It's more dramatic when it's just one question."}, {"time": 6757, "text": "Well, if it's only one question and I died, I would just wanna know that Priscilla and my family, like if they were gonna be okay."}, {"time": 6770, "text": "That might depend on the circumstances of my death."}, {"time": 6774, "text": "But I think that in most circumstances that I can think of, that's probably the main thing that I would care about."}, {"time": 6781, "text": "Yeah, I think God will hear that question and be like, all right, fine, you get in."}, {"time": 6784, "text": "That's the right question to ask."}, {"time": 6788, "text": "The humility and selfishness."}, {"time": 6789, "text": "All right, you're in."}, {"time": 6790, "text": "I mean, but well, maybe."}, {"time": 6794, "text": "They're gonna be fine."}, {"time": 6795, "text": "Don't worry, you're in."}, {"time": 6796, "text": "Okay, but I mean, one of the things that I think I struggle with at least is on the one hand, that's probably the thing that's closest to me and maybe the most common human experience."}, {"time": 6809, "text": "But I don't know, one of the things that I just struggle with in terms of running this large enterprise is like, should the thing that I care more about be that responsibility?"}, {"time": 6824, "text": "And I think it's shifted over time."}, {"time": 6829, "text": "I mean, like before I really had a family that was like the only thing I cared about."}, {"time": 6833, "text": "And at this point, I mean, I care deeply about it, but yeah, I think that that's not as obvious of a question."}, {"time": 6846, "text": "Yeah, we humans are weird."}]}]