[{"title": "Vijay Kumar: Flying Robots | Lex Fridman Podcast #37", "id": "HYsLTNXMl1Q", "quotes": [{"time": 347, "text": "And I've often said this, drones to me is a pejorative word."}, {"time": 351, "text": "It signifies something that's dumb, that's pre programmed, that does one little thing and robots are anything but drones."}, {"time": 358, "text": "So I actually don't like that word, but that's what everybody uses."}, {"time": 362, "text": "You could call it unpiloted."}, {"time": 364, "text": "Unpiloted."}, {"time": 365, "text": "But even unpiloted could be radio controlled, could be remotely controlled in many different ways."}, {"time": 371, "text": "And I think the right word is, thinking about it as an aerial robot."}, {"time": 375, "text": "You also say agile, autonomous, aerial robot, right?"}, {"time": 379, "text": "Yeah, so agility is an attribute, but they don't have to be."}, {"time": 383, "text": "So what biological system, because you've also drawn a lot of inspiration with those."}, {"time": 387, "text": "I've seen bees and ants that you've talked about."}, {"time": 390, "text": "What living creatures have you found to be most inspiring as an engineer, instructive in your work in robotics?"}, {"time": 398, "text": "To me, so ants are really quite incredible creatures, right?"}, {"time": 403, "text": "So you, I mean, the individuals arguably are very simple in how they're built and yet they're incredibly resilient as a population."}, {"time": 413, "text": "And as individuals, they're incredibly robust."}, {"time": 416, "text": "So, if you take an ant, it's six legs, you remove one leg, it still works just fine."}, {"time": 424, "text": "And it moves along."}, {"time": 425, "text": "And I don't know that he even realizes it's lost a leg."}, {"time": 429, "text": "So that's the robustness at the individual ant level."}, {"time": 433, "text": "But then you look about this instinct for self preservation of the colonies and they adapt in so many amazing ways."}, {"time": 440, "text": "You know, transcending gaps by just chaining themselves together when you have a flood, being able to recruit other teammates to carry big morsels of food, and then going out in different directions looking for food, and then being able to demonstrate consensus, even though they don't communicate directly with each other the way we communicate with each other."}, {"time": 469, "text": "In some sense, they also know how to do democracy, probably better than what we do."}, {"time": 473, "text": "Yeah, somehow it's even democracy is emergent."}, {"time": 477, "text": "It seems like all of the phenomena that we see is all emergent."}, {"time": 480, "text": "It seems like there's no centralized communicator."}, {"time": 483, "text": "There is, so I think a lot is made about that word, emergent, and it means lots of things to different people."}, {"time": 489, "text": "But you're absolutely right."}, {"time": 490, "text": "I think as an engineer, you think about what element, elemental behaviors were primitives you could synthesize so that the whole looks incredibly powerful, incredibly synergistic, the whole definitely being greater than some of the parts, and ants are living proof of that."}, {"time": 512, "text": "So when you see these beautiful swarms where there's biological systems of robots, do you sometimes think of them as a single individual living intelligent organism?"}, {"time": 524, "text": "So it's the same as thinking of our human beings are human civilization as one organism, or do you still, as an engineer, think about the individual components and all the engineering that went into the individual components?"}, {"time": 537, "text": "Well, that's very interesting."}, {"time": 538, "text": "So again, philosophically as engineers, what we wanna do is to go beyond the individual components, the individual units, and think about it as a unit, as a cohesive unit, without worrying about the individual components."}, {"time": 555, "text": "If you start obsessing about the individual building blocks and what they do, you inevitably will find it hard to scale up."}, {"time": 567, "text": "Just mathematically, just think about individual things you wanna model, and if you want to have 10 of those, then you essentially are taking Cartesian products of 10 things, and that makes it really complicated."}, {"time": 579, "text": "Then to do any kind of synthesis or design in that high dimension space is really hard."}, {"time": 584, "text": "So the right way to do this is to think about the individuals in a clever way so that at the higher level, when you look at lots and lots of them, abstractly, you can think of them in some low dimensional space."}, {"time": 597, "text": "So what does that involve?"}, {"time": 598, "text": "For the individual, do you have to try to make the way they see the world as local as possible?"}, {"time": 605, "text": "And the other thing, do you just have to make them robust to collisions?"}, {"time": 609, "text": "Like you said with the ants, if something fails, the whole swarm doesn't fail."}, {"time": 615, "text": "Right, I think as engineers, we do this."}, {"time": 617, "text": "I mean, you think about, we build planes, or we build iPhones, and we know that by taking individual components, well engineered components with well specified interfaces that behave in a predictable way, you can build complex systems."}, {"time": 634, "text": "So that's ingrained, I would claim, in most engineers thinking, and it's true for computer scientists as well."}, {"time": 641, "text": "I think what's different here is that you want the individuals to be robust in some sense, as we do in these other settings, but you also want some degree of resiliency for the population."}, {"time": 656, "text": "And so you really want them to be able to reestablish communication with their neighbors."}, {"time": 663, "text": "You want them to rethink their strategy for group behavior."}, {"time": 668, "text": "You want them to reorganize."}, {"time": 672, "text": "And that's where I think a lot of the challenges lie."}, {"time": 675, "text": "So just at a high level, what does it take for a bunch of, what should we call them, flying robots, to create a formation?"}, {"time": 686, "text": "Just for people who are not familiar with robotics in general, how much information is needed?"}, {"time": 692, "text": "How do you even make it happen without a centralized controller?"}, {"time": 699, "text": "So, I mean, there are a couple of different ways of looking at this."}, {"time": 703, "text": "If you are a purist, you think of it as a way of recreating what nature does."}, {"time": 713, "text": "So nature forms groups for several reasons, but mostly it's because of this instinct that organisms have of preserving their colonies, their population, which means what?"}, {"time": 729, "text": "You need shelter, you need food, you need to procreate, and that's basically it."}, {"time": 734, "text": "So the kinds of interactions you see are all organic."}, {"time": 738, "text": "They're all local."}, {"time": 740, "text": "And the only information that they share, and mostly it's indirectly, is to, again, preserve the herd or the flock, or the swarm, and either by looking for new sources of food or looking for new shelters, right?"}, {"time": 761, "text": "As engineers, when we build swarms, we have a mission."}, {"time": 766, "text": "And when you think of a mission, and it involves mobility, most often it's described in some kind of a global coordinate system."}, {"time": 776, "text": "As a human, as an operator, as a commander, or as a collaborator, I have my coordinate system, and I want the robots to be consistent with that."}, {"time": 787, "text": "So I might think of it slightly differently."}, {"time": 791, "text": "I might want the robots to recognize that coordinate system, which means not only do they have to think locally in terms of who their immediate neighbors are, but they have to be cognizant of what the global environment is."}, {"time": 804, "text": "They have to be cognizant of what the global environment looks like."}, {"time": 808, "text": "So if I say, surround this building and protect this from intruders, well, they're immediately in a building centered coordinate system, and I have to tell them where the building is."}, {"time": 818, "text": "And they're globally collaborating on the map of that building."}, {"time": 821, "text": "They're maintaining some kind of global, not just in the frame of the building, but there's information that's ultimately being built up explicitly as opposed to kind of implicitly, like nature might."}, {"time": 835, "text": "So in some sense, nature is very, very sophisticated, but the tasks that nature solves or needs to solve are very different from the kind of engineered tasks, artificial tasks that we are forced to address."}, {"time": 849, "text": "And again, there's nothing preventing us from solving these other problems, but ultimately it's about impact."}, {"time": 856, "text": "You want these swarms to do something useful."}, {"time": 859, "text": "And so you're kind of driven into this very unnatural, if you will."}, {"time": 865, "text": "Unnatural, meaning not like how nature does, setting."}, {"time": 869, "text": "And it's probably a little bit more expensive to do it the way nature does, because nature is less sensitive to the loss of the individual."}, {"time": 879, "text": "And cost wise in robotics, I think you're more sensitive to losing individuals."}, {"time": 885, "text": "I think that's true, although if you look at the price to performance ratio of robotic components, it's coming down dramatically, right?"}, {"time": 894, "text": "It continues to come down."}, {"time": 896, "text": "So I think we're asymptotically approaching the point where we would get, yeah, the cost of individuals would really become insignificant."}, {"time": 905, "text": "So let's step back at a high level view, the impossible question of what kind of, as an overview, what kind of autonomous flying vehicles are there in general?"}, {"time": 916, "text": "I think the ones that receive a lot of notoriety are obviously the military vehicles."}, {"time": 922, "text": "Military vehicles are controlled by a base station, but have a lot of human supervision."}, {"time": 929, "text": "But they have limited autonomy, which is the ability to go from point A to point B."}, {"time": 934, "text": "And even the more sophisticated now, sophisticated vehicles can do autonomous takeoff and landing."}, {"time": 941, "text": "And those usually have wings and they're heavy."}, {"time": 944, "text": "Usually they're wings, but then there's nothing preventing us from doing this for helicopters as well."}, {"time": 949, "text": "There are many military organizations that have autonomous helicopters in the same vein."}, {"time": 956, "text": "And by the way, you look at autopilots and airplanes and it's actually very similar."}, {"time": 962, "text": "In fact, one interesting question we can ask is, if you look at all the air safety violations, all the crashes that occurred, would they have happened if the plane were truly autonomous?"}, {"time": 978, "text": "And I think you'll find that in many of the cases, because of pilot error, we made silly decisions."}, {"time": 984, "text": "And so in some sense, even in air traffic, commercial air traffic, there's a lot of applications, although we only see autonomy being enabled at very high altitudes when the plane is an autopilot."}, {"time": 998, "text": "The plane is an autopilot."}, {"time": 1001, "text": "There's still a role for the human and that kind of autonomy is, you're kind of implying, I don't know what the right word is, but it's a little dumber than it could be."}, {"time": 1013, "text": "Right, so in the lab, of course, we can afford to be a lot more aggressive."}, {"time": 1019, "text": "And the question we try to ask is, can we make robots that will be able to make decisions without any kind of external infrastructure?"}, {"time": 1034, "text": "So the most common piece of infrastructure that airplanes use today is GPS."}, {"time": 1040, "text": "GPS is also the most brittle form of information."}, {"time": 1046, "text": "If you have driven in a city, try to use GPS navigation, in tall buildings, you immediately lose GPS."}, {"time": 1052, "text": "And so that's not a very sophisticated way of building autonomy."}, {"time": 1057, "text": "I think the second piece of infrastructure they rely on is communications."}, {"time": 1061, "text": "Again, it's very easy to jam communications."}, {"time": 1067, "text": "In fact, if you use wifi, you know that wifi signals drop out, cell signals drop out."}, {"time": 1073, "text": "So to rely on something like that is not good."}, {"time": 1078, "text": "The third form of infrastructure we use, and I hate to call it infrastructure, but it is that, in the sense of robots, is people."}, {"time": 1086, "text": "So you could rely on somebody to pilot you."}, {"time": 1089, "text": "And so the question you wanna ask is, if there are no pilots, there's no communications with any base station, if there's no knowledge of position, and if there's no a priori map, a priori knowledge of what the environment looks like, a priori model of what might happen in the future, can robots navigate?"}, {"time": 1109, "text": "So that is true autonomy."}, {"time": 1111, "text": "So that's true autonomy, and we're talking about, you mentioned like military application of drones."}, {"time": 1116, "text": "Okay, so what else is there?"}, {"time": 1118, "text": "You talk about agile, autonomous flying robots, aerial robots, so that's a different kind of, it's not winged, it's not big, at least it's small."}, {"time": 1128, "text": "So I use the word agility mostly, or at least we're motivated to do agile robots, mostly because robots can operate and should be operating in constrained environments."}, {"time": 1142, "text": "And if you want to operate the way a global hawk operates, I mean, the kinds of conditions in which you operate are very, very restrictive."}, {"time": 1151, "text": "If you wanna go inside a building, for example, for search and rescue, or to locate an active shooter, or you wanna navigate under the canopy in an orchard to look at health of plants, or to look for, to count fruits, to measure the tree trunks."}, {"time": 1171, "text": "These are things we do, by the way."}, {"time": 1173, "text": "There's some cool agriculture stuff you've shown in the past, it's really awesome."}, {"time": 1177, "text": "So in those kinds of settings, you do need that agility."}, {"time": 1180, "text": "Agility does not necessarily mean you break records for the 100 meters dash."}, {"time": 1185, "text": "What it really means is you see the unexpected and you're able to maneuver in a safe way, and in a way that gets you the most information about the thing you're trying to do."}, {"time": 1197, "text": "By the way, you may be the only person who, in a TED Talk, has used a math equation, which is amazing, people should go see one of your TED Talks."}, {"time": 1207, "text": "Actually, it's very interesting, because the TED curator, Chris Anderson, told me, you can't show math."}, {"time": 1215, "text": "And I thought about it, but that's who I am."}, {"time": 1218, "text": "I mean, that's our work."}, {"time": 1220, "text": "And so I felt compelled to give the audience a taste for at least some math."}, {"time": 1227, "text": "So on that point, simply, what does it take to make a thing with four motors fly, a quadcopter, one of these little flying robots?"}, {"time": 1241, "text": "How hard is it to make it fly?"}, {"time": 1243, "text": "How do you coordinate the four motors?"}, {"time": 1246, "text": "How do you convert those motors into actual movement?"}, {"time": 1252, "text": "So this is an interesting question."}, {"time": 1254, "text": "We've been trying to do this since 2000."}, {"time": 1258, "text": "It is a commentary on the sensors that were available back then, the computers that were available back then."}, {"time": 1265, "text": "And a number of things happened between 2000 and 2007."}, {"time": 1271, "text": "One is the advances in computing, which is, so we all know about Moore's Law, but I think 2007 was a tipping point, the year of the iPhone, the year of the cloud."}, {"time": 1282, "text": "Lots of things happened in 2007."}, {"time": 1285, "text": "But going back even further, inertial measurement units as a sensor really matured."}, {"time": 1291, "text": "Again, lots of reasons for that."}, {"time": 1293, "text": "Certainly, there's a lot of federal funding, particularly DARPA in the US, but they didn't anticipate this boom in IMUs."}, {"time": 1302, "text": "But if you look, subsequently what happened is that every car manufacturer had to put an airbag in, which meant you had to have an accelerometer on board."}, {"time": 1312, "text": "And so that drove down the price to performance ratio."}, {"time": 1315, "text": "Wow, I should know this."}, {"time": 1317, "text": "That's very interesting, the connection there."}, {"time": 1319, "text": "And that's why research is very, it's very hard to predict the outcomes."}, {"time": 1324, "text": "And again, the federal government spent a ton of money on things that they thought were useful for resonators, but it ended up enabling these small UAVs, which is great, because I could have never raised that much money and sold this project, hey, we want to build these small UAVs."}, {"time": 1342, "text": "Can you actually fund the development of low cost IMUs?"}, {"time": 1345, "text": "So why do you need an IMU on an IMU?"}, {"time": 1347, "text": "So I'll come back to that."}, {"time": 1351, "text": "So in 2007, 2008, we were able to build these."}, {"time": 1353, "text": "And then the question you're asking was a good one."}, {"time": 1355, "text": "How do you coordinate the motors to develop this?"}, {"time": 1360, "text": "But over the last 10 years, everything is commoditized."}, {"time": 1363, "text": "A high school kid today can pick up a Raspberry Pi kit and build this."}, {"time": 1370, "text": "All the low levels functionality is all automated."}, {"time": 1374, "text": "But basically at some level, you have to drive the motors at the right RPMs, the right velocity, in order to generate the right amount of thrust, in order to position it and orient it in a way that you need to in order to fly."}, {"time": 1393, "text": "The feedback that you get is from onboard sensors, and the IMU is an important part of it."}, {"time": 1398, "text": "The IMU tells you what the acceleration is, as well as what the angular velocity is."}, {"time": 1406, "text": "And those are important pieces of information."}, {"time": 1410, "text": "In addition to that, you need some kind of local position or velocity information."}, {"time": 1417, "text": "For example, when we walk, we implicitly have this information because we kind of know what our stride length is."}, {"time": 1426, "text": "We also are looking at images fly past our retina, if you will, and so we can estimate velocity."}, {"time": 1434, "text": "We also have accelerometers in our head, and we're able to integrate all these pieces of information to determine where we are as we walk."}, {"time": 1442, "text": "And so robots have to do something very similar."}, {"time": 1444, "text": "You need an IMU, you need some kind of a camera or other sensor that's measuring velocity, and then you need some kind of a global reference frame if you really want to think about doing something in a world coordinate system."}, {"time": 1461, "text": "And so how do you estimate your position with respect to that global reference frame?"}, {"time": 1465, "text": "That's important as well."}, {"time": 1466, "text": "So coordinating the RPMs of the four motors is what allows you to, first of all, fly and hover, and then you can change the orientation and the velocity and so on."}, {"time": 1478, "text": "So it's a bunch of degrees of freedom that you're complaining about."}, {"time": 1481, "text": "There's six degrees of freedom, but you only have four inputs, the four motors."}, {"time": 1484, "text": "And it turns out to be a remarkably versatile configuration."}, {"time": 1490, "text": "You think at first, well, I only have four motors, how do I go sideways?"}, {"time": 1495, "text": "But it's not too hard to say, well, if I tilt myself, I can go sideways, and then you have four motors pointing up, how do I rotate in place about a vertical axis?"}, {"time": 1505, "text": "Well, you rotate them at different speeds and that generates reaction moments and that allows you to turn."}, {"time": 1511, "text": "So it's actually a pretty, it's an optimal configuration from an engineer standpoint."}, {"time": 1518, "text": "It's very simple, very cleverly done, and very versatile."}, {"time": 1523, "text": "So if you could step back to a time, so I've always known flying robots as, to me, it was natural that a quadcopter should fly."}, {"time": 1535, "text": "But when you first started working with it, how surprised are you that you can make, do so much with the four motors?"}, {"time": 1545, "text": "How surprising is it that you can make this thing fly, first of all, that you can make it hover, that you can add control to it?"}, {"time": 1552, "text": "Firstly, this is not, the four motor configuration is not ours."}, {"time": 1556, "text": "You can, it has at least a hundred year history."}, {"time": 1560, "text": "And various people, various people try to get quadrotors to fly without much success."}, {"time": 1568, "text": "As I said, we've been working on this since 2000."}, {"time": 1570, "text": "Our first designs were, well, this is way too complicated."}, {"time": 1574, "text": "Why not we try to get an omnidirectional flying robot?"}, {"time": 1578, "text": "So our early designs, we had eight rotors."}, {"time": 1581, "text": "And so these eight rotors were arranged uniformly on a sphere, if you will."}, {"time": 1588, "text": "So you can imagine a symmetric configuration."}, {"time": 1590, "text": "And so you should be able to fly anywhere."}, {"time": 1593, "text": "But the real challenge we had is the strength to weight ratio is not enough."}, {"time": 1597, "text": "And of course, we didn't have the sensors and so on."}, {"time": 1600, "text": "So everybody knew, or at least the people who worked with rotorcrafts knew, four rotors will get it done."}, {"time": 1607, "text": "So that was not our idea."}, {"time": 1609, "text": "But it took a while before we could actually do the onboard sensing and the computation that was needed for the kinds of agile maneuvering that we wanted to do in our little aerial robots."}, {"time": 1623, "text": "And that only happened between 2007 and 2009 in our lab."}, {"time": 1627, "text": "Yeah, and you have to send the signal maybe a hundred times a second."}, {"time": 1632, "text": "So the compute there, everything has to come down in price."}, {"time": 1635, "text": "And what are the steps of getting from point A to point B?"}, {"time": 1641, "text": "So we just talked about like local control."}, {"time": 1645, "text": "But if all the kind of cool dancing in the air that I've seen you show, how do you make it happen?"}, {"time": 1654, "text": "How do you make a trajectory?"}, {"time": 1657, "text": "First of all, okay, figure out a trajectory."}, {"time": 1660, "text": "So plan a trajectory."}, {"time": 1661, "text": "And then how do you make that trajectory happen?"}, {"time": 1664, "text": "Yeah, I think planning is a very fundamental problem in robotics."}, {"time": 1668, "text": "I think 10 years ago it was an esoteric thing, but today with self driving cars, everybody can understand this basic idea that a car sees a whole bunch of things and it has to keep a lane or maybe make a right turn or switch lanes."}, {"time": 1681, "text": "It has to plan a trajectory."}, {"time": 1682, "text": "It has to be safe."}, {"time": 1683, "text": "It has to be efficient."}, {"time": 1684, "text": "So everybody's familiar with that."}, {"time": 1686, "text": "That's kind of the first step that you have to think about when you say autonomy."}, {"time": 1694, "text": "And so for us, it's about finding smooth motions, motions that are safe."}, {"time": 1701, "text": "So we think about these two things."}, {"time": 1702, "text": "One is optimality, one is safety."}, {"time": 1704, "text": "Clearly you cannot compromise safety."}, {"time": 1708, "text": "So you're looking for safe, optimal motions."}, {"time": 1711, "text": "The other thing you have to think about is can you actually compute a reasonable trajectory in a small amount of time?"}, {"time": 1720, "text": "Cause you have a time budget."}, {"time": 1722, "text": "So the optimal becomes suboptimal, but in our lab we focus on synthesizing smooth trajectory that satisfy all the constraints."}, {"time": 1733, "text": "In other words, don't violate any safety constraints and is as efficient as possible."}, {"time": 1742, "text": "And when I say efficient, it could mean I want to get from point A to point B as quickly as possible, or I want to get to it as gracefully as possible, or I want to consume as little energy as possible."}, {"time": 1755, "text": "But always staying within the safety constraints."}, {"time": 1758, "text": "But yes, always finding a safe trajectory."}, {"time": 1762, "text": "So there's a lot of excitement and progress in the field of machine learning and reinforcement learning and the neural network variant of that with deep reinforcement learning."}, {"time": 1773, "text": "Do you see a role of machine learning in, so a lot of the success of flying robots did not rely on machine learning, except for maybe a little bit of the perception on the computer vision side."}, {"time": 1786, "text": "On the control side and the planning, do you see there's a role in the future for machine learning?"}, {"time": 1791, "text": "So let me disagree a little bit with you."}, {"time": 1793, "text": "I think we never perhaps called out in my work, called out learning, but even this very simple idea of being able to fly through a constrained space."}, {"time": 1802, "text": "The first time you try it, you'll invariably, you might get it wrong if the task is challenging."}, {"time": 1808, "text": "And the reason is to get it perfectly right, you have to model everything in the environment."}, {"time": 1815, "text": "And flying is notoriously hard to model."}, {"time": 1819, "text": "There are aerodynamic effects that we constantly discover."}, {"time": 1826, "text": "Even just before I was talking to you, I was talking to a student about how blades flap when they fly."}, {"time": 1835, "text": "And that ends up changing how a rotorcraft is accelerated in the angular direction."}, {"time": 1843, "text": "Does he use like micro flaps or something?"}, {"time": 1846, "text": "It's not micro flaps."}, {"time": 1847, "text": "So we assume that each blade is rigid, but actually it flaps a little bit."}, {"time": 1851, "text": "It bends."}, {"time": 1852, "text": "Interesting, yeah."}, {"time": 1853, "text": "And so the models rely on the fact, on the assumption that they're not rigid."}, {"time": 1858, "text": "On the assumption that they're actually rigid, but that's not true."}, {"time": 1862, "text": "If you're flying really quickly, these effects become significant."}, {"time": 1866, "text": "If you're flying close to the ground, you get pushed off by the ground, right?"}, {"time": 1872, "text": "Something which every pilot knows when he tries to land or she tries to land, this is called a ground effect."}, {"time": 1878, "text": "Something very few pilots think about is what happens when you go close to a ceiling or you get sucked into a ceiling."}, {"time": 1885, "text": "There are very few aircrafts that fly close to any kind of ceiling."}, {"time": 1889, "text": "Likewise, when you go close to a wall, there are these wall effects."}, {"time": 1895, "text": "And if you've gone on a train and you pass another train that's traveling in the opposite direction, you feel the buffeting."}, {"time": 1902, "text": "And so these kinds of microclimates affect our UAV significantly."}, {"time": 1907, "text": "So if you want... And they're impossible to model, essentially."}, {"time": 1910, "text": "I wouldn't say they're impossible to model, but the level of sophistication you would need in the model and the software would be tremendous."}, {"time": 1920, "text": "Plus, to get everything right would be awfully tedious."}, {"time": 1922, "text": "So the way we do this is over time, we figure out how to adapt to these conditions."}, {"time": 1930, "text": "So early on, we use the form of learning that we call iterative learning."}, {"time": 1935, "text": "So this idea, if you want to perform a task, there are a few things that you need to change and iterate over a few parameters that over time you can figure out."}, {"time": 1949, "text": "So I could call it policy gradient reinforcement learning, but actually it was just iterative learning."}, {"time": 1954, "text": "Iterative learning."}, {"time": 1956, "text": "And so this was there way back."}, {"time": 1957, "text": "I think what's interesting is, if you look at autonomous vehicles today, learning occurs, could occur in two pieces."}, {"time": 1965, "text": "One is perception, understanding the world."}, {"time": 1967, "text": "Second is action, taking actions."}, {"time": 1970, "text": "Everything that I've seen that is successful is on the perception side of things."}, {"time": 1974, "text": "So in computer vision, we've made amazing strides in the last 10 years."}, {"time": 1977, "text": "So recognizing objects, actually detecting objects, classifying them and tagging them in some sense, annotating them."}, {"time": 1987, "text": "This is all done through machine learning."}, {"time": 1989, "text": "On the action side, on the other hand, I don't know of any examples where there are fielded systems where we actually learn the right behavior."}, {"time": 2000, "text": "Outside of single demonstration is successful."}, {"time": 2002, "text": "In the laboratory, this is the holy grail."}, {"time": 2004, "text": "Can you do end to end learning?"}, {"time": 2006, "text": "Can you go from pixels to motor currents?"}, {"time": 2010, "text": "This is really, really hard."}, {"time": 2012, "text": "And I think if you go forward, the right way to think about these things is data driven approaches, learning based approaches, in concert with model based approaches, which is the traditional way of doing things."}, {"time": 2027, "text": "So I think there's a piece, there's a role for each of these methodologies."}, {"time": 2031, "text": "So what do you think, just jumping out on topic since you mentioned autonomous vehicles, what do you think are the limits on the perception side?"}, {"time": 2038, "text": "So I've talked to Elon Musk and there on the perception side, they're using primarily computer vision to perceive the environment."}, {"time": 2048, "text": "In your work with, because you work with the real world a lot and the physical world, what are the limits of computer vision?"}, {"time": 2055, "text": "Do you think we can solve autonomous vehicles on the perception side, focusing on vision alone and machine learning?"}, {"time": 2064, "text": "So, we also have a spinoff company, Exxon Technologies that works underground in mines."}, {"time": 2071, "text": "So you go into mines, they're dark, they're dirty."}, {"time": 2076, "text": "You fly in a dirty area, there's stuff you kick up from by the propellers, the downwash kicks up dust."}, {"time": 2082, "text": "I challenge you to get a computer vision algorithm to work there."}, {"time": 2086, "text": "So we use LIDARs in that setting."}, {"time": 2091, "text": "Indoors and even outdoors when we fly through fields, I think there's a lot of potential for just solving the problem using computer vision alone."}, {"time": 2101, "text": "But I think the bigger question is, can you actually solve or can you actually identify all the corner cases using a single sensing modality and using learning alone?"}, {"time": 2113, "text": "So what's your intuition there?"}, {"time": 2115, "text": "So look, if you have a corner case and your algorithm doesn't work, your instinct is to go get data about the corner case and patch it up, learn how to deal with that corner case."}, {"time": 2127, "text": "But at some point, this is gonna saturate, this approach is not viable."}, {"time": 2134, "text": "So today, computer vision algorithms can detect 90% of the objects or can detect objects 90% of the time, classify them 90% of the time."}, {"time": 2143, "text": "Cats on the internet probably can do 95%, I don't know."}, {"time": 2147, "text": "But to get from 90% to 99%, you need a lot more data."}, {"time": 2152, "text": "And then I tell you, well, that's not enough because I have a safety critical application, I wanna go from 99% to 99.9%."}, {"time": 2160, "text": "That's even more data."}, {"time": 2161, "text": "So I think if you look at wanting accuracy on the X axis and look at the amount of data on the Y axis, I believe that curve is an exponential curve."}, {"time": 2176, "text": "Wow, okay, it's even hard if it's linear."}, {"time": 2179, "text": "It's hard if it's linear, totally, but I think it's exponential."}, {"time": 2182, "text": "And the other thing you have to think about is that this process is a very, very power hungry process to run data farms or servers."}, {"time": 2192, "text": "Power, do you mean literally power?"}, {"time": 2194, "text": "Literally power, literally power."}, {"time": 2196, "text": "So in 2014, five years ago, and I don't have more recent data, 2% of US electricity consumption was from data farms."}, {"time": 2208, "text": "So we think about this as an information science and information processing problem."}, {"time": 2214, "text": "Actually, it is an energy processing problem."}, {"time": 2217, "text": "And so unless we figured out better ways of doing this, I don't think this is viable."}, {"time": 2222, "text": "So talking about driving, which is a safety critical application and some aspect of flight is safety critical, maybe philosophical question, maybe an engineering one, what problem do you think is harder to solve, autonomous driving or autonomous flight?"}, {"time": 2238, "text": "That's a really interesting question."}, {"time": 2239, "text": "I think autonomous flight has several advantages that autonomous driving doesn't have."}, {"time": 2249, "text": "So look, if I want to go from point A to point B, I have a very, very safe trajectory."}, {"time": 2254, "text": "Go vertically up to a maximum altitude, fly horizontally to just about the destination, and then come down vertically."}, {"time": 2262, "text": "This is preprogrammed."}, {"time": 2265, "text": "The equivalent of that is very hard to find in the self driving car world because you're on the ground, you're in a two dimensional surface, and the trajectories on the two dimensional surface are more likely to encounter obstacles."}, {"time": 2280, "text": "I mean this in an intuitive sense, but mathematically true."}, {"time": 2283, "text": "That's mathematically as well, that's true."}, {"time": 2286, "text": "There's other option on the 2G space of platooning, or because there's so many obstacles, you can connect with those obstacles and all these kind of options."}, {"time": 2294, "text": "Sure, but those exist in the three dimensional space as well."}, {"time": 2296, "text": "So they do."}, {"time": 2297, "text": "So the question also implies how difficult are obstacles in the three dimensional space in flight?"}, {"time": 2303, "text": "So that's the downside."}, {"time": 2305, "text": "I think in three dimensional space, you're modeling three dimensional world, not just because you want to avoid it, but you want to reason about it, and you want to work in the three dimensional environment, and that's significantly harder."}, {"time": 2317, "text": "So that's one disadvantage."}, {"time": 2318, "text": "I think the second disadvantage is of course, anytime you fly, you have to put up with the peculiarities of aerodynamics and their complicated environments."}, {"time": 2328, "text": "How do you negotiate that?"}, {"time": 2329, "text": "So that's always a problem."}, {"time": 2331, "text": "Do you see a time in the future where there is, you mentioned there's agriculture applications."}, {"time": 2338, "text": "So there's a lot of applications of flying robots, but do you see a time in the future where there's tens of thousands, or maybe hundreds of thousands of delivery drones that fill the sky, delivery flying robots?"}, {"time": 2352, "text": "I think there's a lot of potential for the last mile delivery."}, {"time": 2355, "text": "And so in crowded cities, I don't know, if you go to a place like Hong Kong, just crossing the river can take half an hour, and while a drone can just do it in five minutes at most."}, {"time": 2369, "text": "I think you look at delivery of supplies to remote villages."}, {"time": 2375, "text": "I work with a nonprofit called Weave Robotics."}, {"time": 2378, "text": "So they work in the Peruvian Amazon, where the only highways that are available are the only highways or rivers."}, {"time": 2387, "text": "And to get from point A to point B may take five hours, while with a drone, you can get there in 30 minutes."}, {"time": 2396, "text": "So just delivering drugs, retrieving samples for testing vaccines, I think there's huge potential here."}, {"time": 2407, "text": "So I think the challenges are not technological, but the challenge is economical."}, {"time": 2412, "text": "The one thing I'll tell you that nobody thinks about is the fact that we've not made huge strides in battery technology."}, {"time": 2420, "text": "Yes, it's true, batteries are becoming less expensive because we have these mega factories that are coming up, but they're all based on lithium based technologies."}, {"time": 2428, "text": "And if you look at the energy density and the power density, those are two fundamentally limiting numbers."}, {"time": 2438, "text": "So power density is important because for a UAV to take off vertically into the air, which most drones do, they don't have a runway, you consume roughly 200 watts per kilo at the small size."}, {"time": 2451, "text": "That's a lot, right?"}, {"time": 2453, "text": "In contrast, the human brain consumes less than 80 watts, the whole of the human brain."}, {"time": 2459, "text": "So just imagine just lifting yourself into the air is like two or three light bulbs, which makes no sense to me."}, {"time": 2467, "text": "Yeah, so you're going to have to at scale solve the energy problem then, charging the batteries, storing the energy and so on."}, {"time": 2478, "text": "And then the storage is the second problem, but storage limits the range."}, {"time": 2482, "text": "But you have to remember that you have to burn a lot of it per given time."}, {"time": 2491, "text": "So the burning is another problem."}, {"time": 2492, "text": "Which is a power question."}, {"time": 2494, "text": "Yes, and do you think just your intuition, there are breakthroughs in batteries on the horizon?"}, {"time": 2504, "text": "How hard is that problem?"}, {"time": 2506, "text": "Look, there are a lot of companies that are promising flying cars that are autonomous and that are clean."}, {"time": 2519, "text": "I think they're over promising."}, {"time": 2521, "text": "The autonomy piece is doable."}, {"time": 2524, "text": "The clean piece, I don't think so."}, {"time": 2528, "text": "There's another company that I work with called JetOptra."}, {"time": 2531, "text": "They make small jet engines."}, {"time": 2535, "text": "And they can get up to 50 miles an hour very easily and lift 50 kilos."}, {"time": 2539, "text": "But they're jet engines, they're efficient, they're a little louder than electric vehicles, but they can build flying cars."}, {"time": 2548, "text": "So your sense is that there's a lot of pieces that have come together."}, {"time": 2553, "text": "So on this crazy question, if you look at companies like Kitty Hawk, working on electric, so the clean, talking to Sebastian Thrun, right?"}, {"time": 2565, "text": "It's a crazy dream, you know?"}, {"time": 2568, "text": "But you work with flight a lot."}, {"time": 2572, "text": "You've mentioned before that manned flights or carrying a human body is very difficult to do."}, {"time": 2581, "text": "So how crazy is flying cars?"}, {"time": 2584, "text": "Do you think there'll be a day when we have vertical takeoff and landing vehicles that are sufficiently affordable that we're going to see a huge amount of them?"}, {"time": 2597, "text": "And they would look like something like we dream of when we think about flying cars."}, {"time": 2601, "text": "Yeah, like the Jetsons."}, {"time": 2602, "text": "The Jetsons, yeah."}, {"time": 2603, "text": "So look, there are a lot of smart people working on this and you never say something is not possible when you have people like Sebastian Thrun working on it."}, {"time": 2612, "text": "So I totally think it's viable."}, {"time": 2615, "text": "I question, again, the electric piece."}, {"time": 2618, "text": "The electric piece, yeah."}, {"time": 2619, "text": "And again, for short distances, you can do it."}, {"time": 2621, "text": "And there's no reason to suggest that these all just have to be rotorcrafts."}, {"time": 2625, "text": "You take off vertically, but then you morph into a forward flight."}, {"time": 2629, "text": "I think there are a lot of interesting designs."}, {"time": 2631, "text": "The question to me is, are these economically viable?"}, {"time": 2636, "text": "And if you agree to do this with fossil fuels, it instantly immediately becomes viable."}, {"time": 2641, "text": "That's a real challenge."}, {"time": 2643, "text": "Do you think it's possible for robots and humans to collaborate successfully on tasks?"}, {"time": 2648, "text": "So a lot of robotics folks that I talk to and work with, I mean, humans just add a giant mess to the picture."}, {"time": 2658, "text": "So it's best to remove them from consideration when solving specific tasks."}, {"time": 2662, "text": "It's very difficult to model."}, {"time": 2663, "text": "There's just a source of uncertainty."}, {"time": 2666, "text": "In your work with these agile flying robots, do you think there's a role for collaboration with humans?"}, {"time": 2675, "text": "Or is it best to model tasks in a way that doesn't have a human in the picture?"}, {"time": 2683, "text": "Well, I don't think we should ever think about robots without human in the picture."}, {"time": 2688, "text": "Ultimately, robots are there because we want them to solve problems for humans."}, {"time": 2694, "text": "But there's no general solution to this problem."}, {"time": 2698, "text": "I think if you look at human interaction and how humans interact with robots, you know, we think of these in sort of three different ways."}, {"time": 2705, "text": "One is the human commanding the robot."}, {"time": 2708, "text": "The second is the human collaborating with the robot."}, {"time": 2712, "text": "So for example, we work on how a robot can actually pick up things with a human and carry things."}, {"time": 2718, "text": "That's like true collaboration."}, {"time": 2720, "text": "And third, we think about humans as bystanders, self driving cars, what's the human's role and how do self driving cars acknowledge the presence of humans?"}, {"time": 2732, "text": "So I think all of these things are different scenarios."}, {"time": 2735, "text": "It depends on what kind of humans, what kind of task."}, {"time": 2739, "text": "And I think it's very difficult to say that there's a general theory that we all have for this."}, {"time": 2745, "text": "But at the same time, it's also silly to say that we should think about robots independent of humans."}, {"time": 2752, "text": "So to me, human robot interaction is almost a mandatory aspect of everything we do."}, {"time": 2759, "text": "Yes, but to which degree, so your thoughts, if we jump to autonomous vehicles, for example, there's a big debate between what's called level two and level four."}, {"time": 2770, "text": "So semi autonomous and autonomous vehicles."}, {"time": 2773, "text": "And so the Tesla approach currently at least has a lot of collaboration between human and machine."}, {"time": 2778, "text": "So the human is supposed to actively supervise the operation of the robot."}, {"time": 2783, "text": "Part of the safety definition of how safe a robot is in that case is how effective is the human in monitoring it."}, {"time": 2792, "text": "Do you think that's ultimately not a good approach in sort of having a human in the picture, not as a bystander or part of the infrastructure, but really as part of what's required to make the system safe?"}, {"time": 2811, "text": "This is harder than it sounds."}, {"time": 2813, "text": "I think, you know, if you, I mean, I'm sure you've driven before in highways and so on."}, {"time": 2821, "text": "It's really very hard to have to relinquish control to a machine and then take over when needed."}, {"time": 2830, "text": "So I think Tesla's approach is interesting because it allows you to periodically establish some kind of contact with the car."}, {"time": 2838, "text": "Toyota, on the other hand, is thinking about shared autonomy or collaborative autonomy as a paradigm."}, {"time": 2844, "text": "If I may argue, these are very, very simple ways of human robot collaboration, because the task is pretty boring."}, {"time": 2851, "text": "You sit in a vehicle, you go from point A to point B. I think the more interesting thing to me is, for example, search and rescue."}, {"time": 2858, "text": "I've got a human first responder, robot first responders."}, {"time": 2863, "text": "I gotta do something."}, {"time": 2866, "text": "I have to do it in two minutes."}, {"time": 2867, "text": "The building is burning."}, {"time": 2869, "text": "There's been an explosion."}, {"time": 2870, "text": "It's collapsed."}, {"time": 2871, "text": "How do I do it?"}, {"time": 2872, "text": "I think to me, those are the interesting things where it's very, very unstructured."}, {"time": 2877, "text": "And what's the role of the human?"}, {"time": 2878, "text": "What's the role of the robot?"}, {"time": 2880, "text": "Clearly, there's lots of interesting challenges and there's a field."}, {"time": 2883, "text": "I think we're gonna make a lot of progress in this area."}, {"time": 2885, "text": "Yeah, it's an exciting form of collaboration."}, {"time": 2888, "text": "In autonomous driving, the main enemy is just boredom of the human."}, {"time": 2893, "text": "As opposed to in rescue operations, it's literally life and death."}, {"time": 2898, "text": "And the collaboration enables the effective completion of the mission."}, {"time": 2903, "text": "So it's exciting."}, {"time": 2904, "text": "In some sense, we're also doing this."}, {"time": 2907, "text": "You think about the human driving a car and almost invariably, the human's trying to estimate the state of the car, they estimate the state of the environment and so on."}, {"time": 2917, "text": "But what if the car were to estimate the state of the human?"}, {"time": 2920, "text": "So for example, I'm sure you have a smartphone and the smartphone tries to figure out what you're doing and send you reminders and oftentimes telling you to drive to a certain place, although you have no intention of going there because it thinks that that's where you should be because of some Gmail calendar entry or something like that."}, {"time": 2938, "text": "And it's trying to constantly figure out who you are, what you're doing."}, {"time": 2942, "text": "If a car were to do that, maybe that would make the driver safer because the car is trying to figure out is the driver paying attention, looking at his or her eyes, looking at circadian movements."}, {"time": 2954, "text": "So I think the potential is there, but from the reverse side, it's not robot modeling, but it's human modeling."}, {"time": 2961, "text": "It's more on the human, right."}, {"time": 2962, "text": "And I think the robots can do a very good job of modeling humans if you really think about the framework that you have a human sitting in a cockpit, surrounded by sensors, all staring at him, in addition to be staring outside, but also staring at him."}, {"time": 2979, "text": "I think there's a real synergy there."}, {"time": 2980, "text": "Yeah, I love that problem because it's the new 21st century form of psychology, actually AI enabled psychology."}, {"time": 2988, "text": "A lot of people have sci fi inspired fears of walking robots like those from Boston Dynamics."}, {"time": 2994, "text": "If you just look at shows on Netflix and so on, or flying robots like those you work with, how would you, how do you think about those fears?"}, {"time": 3003, "text": "How would you alleviate those fears?"}, {"time": 3005, "text": "Do you have inklings, echoes of those same concerns?"}, {"time": 3009, "text": "You know, anytime we develop a technology meaning to have positive impact in the world, there's always the worry that, you know, somebody could subvert those technologies and use it in an adversarial setting."}, {"time": 3023, "text": "And robotics is no exception, right?"}, {"time": 3025, "text": "So I think it's very easy to weaponize robots."}, {"time": 3029, "text": "I think we talk about swarms."}, {"time": 3031, "text": "One thing I worry a lot about is, so, you know, for us to get swarms to work and do something reliably, it's really hard."}, {"time": 3038, "text": "But suppose I have this challenge of trying to destroy something, and I have a swarm of robots, where only one out of the swarm needs to get to its destination."}, {"time": 3048, "text": "So that suddenly becomes a lot more doable."}, {"time": 3052, "text": "And so I worry about, you know, this general idea of using autonomy with lots and lots of agents."}, {"time": 3060, "text": "I mean, having said that, look, a lot of this technology is not very mature."}, {"time": 3063, "text": "My favorite saying is that if somebody had to develop this technology, wouldn't you rather the good guys do it?"}, {"time": 3072, "text": "So the good guys have a good understanding of the technology, so they can figure out how this technology is being used in a bad way, or could be used in a bad way and try to defend against it."}, {"time": 3081, "text": "So we think a lot about that."}, {"time": 3082, "text": "So we have, we're doing research on how to defend against swarms, for example."}, {"time": 3089, "text": "There's in fact a report by the National Academies on counter UAS technologies."}, {"time": 3096, "text": "This is a real threat, but we're also thinking about how to defend against this and knowing how swarms work."}, {"time": 3102, "text": "Knowing how autonomy works is, I think, very important."}, {"time": 3107, "text": "So it's not just politicians?"}, {"time": 3109, "text": "Do you think engineers have a role in this discussion?"}, {"time": 3112, "text": "I think the days where politicians can be agnostic to technology are gone."}, {"time": 3119, "text": "I think every politician needs to be literate in technology."}, {"time": 3125, "text": "And I often say technology is the new liberal art."}, {"time": 3129, "text": "Understanding how technology will change your life, I think is important."}, {"time": 3134, "text": "And every human being needs to understand that."}, {"time": 3138, "text": "And maybe we can elect some engineers to office as well on the other side."}, {"time": 3142, "text": "What are the biggest open problems in robotics?"}, {"time": 3144, "text": "And you said we're in the early days in some sense."}, {"time": 3147, "text": "What are the problems we would like to solve in robotics?"}, {"time": 3151, "text": "I think there are lots of problems, right?"}, {"time": 3152, "text": "But I would phrase it in the following way."}]}]