[{"title": "Stephen Wolfram: Complexity and the Fabric of Reality | Lex Fridman Podcast #234", "id": "4-SGpEInX_c", "quotes": [{"time": 305, "text": "Now, needless to say, in the way that science actually works, the results that I got had a lot of unexpected things which I thought were really interesting, but the really strongest results, which was already right there in the printouts I made, I didn't really understand for a couple more years."}, {"time": 325, "text": "So it was not, you know, the compressed version of the story is you run the experiment and you immediately see what's going on, but I wasn't smart enough to do that, so to speak."}, {"time": 331, "text": "But the big thing is, even with very simple rules of that type, sort of the minimal, tiniest program, sort of the one line program or something, it's possible to get very complicated behavior."}, {"time": 343, "text": "My favorite example is this thing called Rule 30, which is a particular cellular automaton rule."}, {"time": 354, "text": "You just started off from one black cell and it makes this really complicated pattern."}, {"time": 354, "text": "And so that for me was sort of a critical discovery that then kind of said, playing back onto, you know, how does nature make complexity, I sort of realized that might be how it does it."}, {"time": 372, "text": "That might be kind of the secret that it's using is that in this kind of computational universe of possible programs, it's actually pretty easy to get programs where even though the program is simple, the behavior when you run the program is not simple at all."}, {"time": 384, "text": "And so for me, that was the kind of the story of kind of how that was sort of the indication that one had got an idea of what the sort of secret that nature uses to make complexity and how complexity can be made in other places."}, {"time": 398, "text": "Now, if you say, what is complexity?"}, {"time": 398, "text": "You know, complexity is it's not easy to tell what's going on."}, {"time": 406, "text": "That's the informal version of what is complexity, but there is something going on, but there's a rule to know what, right?"}, {"time": 412, "text": "Well, no, the rules can generate just randomness, right?"}, {"time": 417, "text": "Well, that's not obvious."}, {"time": 417, "text": "In other words, it's not obvious at all."}, {"time": 424, "text": "And it wasn't what I expected."}, {"time": 424, "text": "It's not what people's intuition had been and has been for, you know, for a long time."}, {"time": 429, "text": "That is one might think you have a rule."}, {"time": 435, "text": "You can tell there's a rule behind it."}, {"time": 435, "text": "I mean, it's just like, you know, the early, you know, robots in science fiction movies, right?"}, {"time": 440, "text": "You can tell it's a robot cause it does simple things, right?"}, {"time": 447, "text": "It turns out that isn't actually the right story, but it's not obvious that isn't the right story because people assume simple rules, simple behavior."}, {"time": 451, "text": "And that the sort of the key discovery about the computational universe is that isn't true."}, {"time": 457, "text": "And that discovery goes very deep and relates to all kinds of things that I've spent years and years studying."}, {"time": 463, "text": "But, you know, that in the end, the sort of the, the what is complexity is, well, you can't easily tell what it's going to do."}, {"time": 474, "text": "You could just run the rule and see what happens, but you can't just say, oh, you know, show me the rule."}, {"time": 480, "text": "And now I know what's going to happen."}, {"time": 480, "text": "And, you know, the key phenomenon around that is this thing I call computational irreducibility."}, {"time": 484, "text": "This fact that in something like rule 30, you might say, well, what's it going to do after a million steps?"}, {"time": 491, "text": "Well, you can run it for a million steps and just do what it does to find out, but you can't compress that."}, {"time": 496, "text": "You can't reduce that and say, I'm going to be able to jump ahead and say, this is what it's going to do after a million steps, but I don't have to go through anything like that computational effort."}, {"time": 509, "text": "By the way, has anybody succeeded at that?"}, {"time": 509, "text": "Do you have to challenge a competition for predicting the middle column of rule 30?"}, {"time": 514, "text": "Anybody?"}, {"time": 517, "text": "MG. A number of people have sent things in and sort of people are picking away at it, but it's hard."}, {"time": 521, "text": "I mean, I've been actually even proving that the center column of rule 30 doesn't repeat."}, {"time": 530, "text": "That's something I think might be doable."}, {"time": 534, "text": "Mathematically proving."}, {"time": 535, "text": "And so that's analogous to a similar kind of thing as like the digits of pi, which are also generated in this very deterministic way."}, {"time": 540, "text": "And so a question is how random are the digits of pi?"}, {"time": 546, "text": "For example, first of all, do the digits of pi ever repeat?"}, {"time": 546, "text": "We know they don't, because it was proved in the 1800s that pi is not a rational number."}, {"time": 551, "text": "So that means only rational numbers have digit sequences that repeat."}, {"time": 557, "text": "So we know the digits of pi don't repeat."}, {"time": 561, "text": "So now the question is, does 0, 1, 2, 3 or whatever, do all the digits base 10 or base 2 or however you work it out, do they all occur with equal frequency?"}, {"time": 567, "text": "That's far away from what can be understood mathematically at this point."}, {"time": 573, "text": "But I'm even looking for step one, which is prove that the center column doesn't repeat and then prove other things about it, like equidistribution of equal numbers of zeros and ones."}, {"time": 586, "text": "And those are things which I kind of set up this little prize thing because I thought those were not too out of range."}, {"time": 592, "text": "Those are things which are within a modest amount of time, it's conceivable that those could be done."}, {"time": 599, "text": "They're not far away from what current mathematics might allow."}, {"time": 606, "text": "They'll require a bunch of cleverness and hopefully some interesting new ideas that will be useful other places."}, {"time": 616, "text": "But you started in 1980 with this idea before I think you realized this idea of programs."}, {"time": 623, "text": "You thought that there might be some kind of a thermodynamic randomness and then complexity comes from a clever filter that you kind of like, I don't know, spaghetti or something."}, {"time": 629, "text": "You filter the randomness and outcomes complexity, which is an interesting intuition."}, {"time": 637, "text": "How do we know that's not actually what's happening?"}, {"time": 643, "text": "So just because you were then able to develop, look, you don't need this like incredible randomness."}, {"time": 650, "text": "You can just have very simple, predictable initial conditions and predictable rules."}, {"time": 656, "text": "And then from that emerged complexity, still there might be some systems where it's filtering randomness on the inputs."}, {"time": 662, "text": "Well, the point is when you have quotes randomness in the input, that means there's all kinds of information in the input."}, {"time": 671, "text": "And in a sense, what you get out will be maybe just something close to what you put in."}, {"time": 675, "text": "Like people are very in dynamical systems theory, sort of big area mathematics that developed from the early 1900s and really got big in the 1980s."}, {"time": 685, "text": "An example of what people study there a lot and it's popular version is chaos theory."}, {"time": 691, "text": "An example of what people study a lot is the shift map, which is basically taking 2x mod one to the fractional part of 2x, which is basically just taking digits in binary and shifting them to the left."}, {"time": 704, "text": "So at every step, you get to see if you say, how big is this number that I got out?"}, {"time": 709, "text": "Well, the most important digit in that number is whatever ended up at the left hand end."}, {"time": 714, "text": "But now if you start off from an arbitrary random number, which is quotes randomly chosen, so all its digits are random, then when you run that sort of chaos theory shift map, all that you get out is just whatever you put in."}, {"time": 726, "text": "You just get to see what you..."}, {"time": 732, "text": "It's not obvious that you would excavate all of those digits."}, {"time": 732, "text": "And if you're, for example, making a theory, I don't know, fluid mechanics, for example, if there was that phenomenon in fluid mechanics, then the equations of fluid mechanics can't be right."}, {"time": 742, "text": "Because what that would be saying is the equations that it matters to the fluid, what happens in the fluid at the level of the millionth digit of the initial conditions, which is far below the point at which you're hitting sizes of molecules and things like that."}, {"time": 760, "text": "So it's kind of almost explaining if that phenomenon is an important thing, it's kind of telling you that fluid dynamics, which describes fluids as continuous media and so on, isn't really right."}, {"time": 774, "text": "But so this idea that..."}, {"time": 774, "text": "It's a tricky thing because as soon as you put randomness in, you have to know how much of what's coming out is what you put in versus how much is actually something that's being generated."}, {"time": 787, "text": "And what's really nice about these systems where you just have very simple initial conditions and where you get random stuff out or seemingly random stuff out is you don't have that issue."}, {"time": 797, "text": "You don't have to argue about, was there something complicated put in?"}, {"time": 801, "text": "Because it's plainly obvious there wasn't."}, {"time": 801, "text": "Now, as a practical matter in doing experiments, the big thing is if the thing you see is complex and reproducible, then it didn't come from just filtering some, quotes, randomness from the outside world."}, {"time": 814, "text": "It has to be something that is intrinsically made because it wouldn't otherwise be..."}, {"time": 819, "text": "It could be the case that you set things up and it's always the same each time and you say, well, it's kind of the same, but it's not random each time because it's kind of the definition of it being random is it was kind of picked at random each time, so to speak."}, {"time": 837, "text": "So is it possible to for sure know that our universe does not at the fundamental level have randomness?"}, {"time": 843, "text": "Is it possible to conclusively say there's no randomness at the bottom?"}, {"time": 850, "text": "Well, it's an interesting question."}, {"time": 850, "text": "I mean, you know, science, natural science is an inductive business, right?"}, {"time": 856, "text": "You observe a bunch of things and you say, can we fit these together?"}, {"time": 861, "text": "What is our hypothesis for what's going on?"}, {"time": 861, "text": "The thing that I think I can say fairly definitively is at this point, we understand enough about fundamental physics that if there was sort of an extra dice being thrown, it's something that doesn't need to be there."}, {"time": 874, "text": "We can get what we see without that."}, {"time": 881, "text": "Now, could you add that in as an extra little featureoid without breaking the universe?"}, {"time": 889, "text": "Probably, but in fact, almost certainly yes."}, {"time": 889, "text": "But is it necessary for understanding the universe?"}, {"time": 896, "text": "And I think actually from a more fundamental point of view, I think I might be able to argue."}, {"time": 903, "text": "So one of the things that I've been interested in and been pretty surprised that I've had anything sentient to say about is the question of why does the universe exist?"}, {"time": 907, "text": "I didn't think that was a question that I would, you know, I thought that was a far out there metaphysical kind of thing."}, {"time": 918, "text": "Even the philosophers have stayed away from that question for the most part."}, {"time": 923, "text": "It's such a kind of difficult to address question."}, {"time": 923, "text": "But I actually think to my great surprise that from our physics project and so on, that it is possible to actually address that question and explain why the universe exists."}, {"time": 936, "text": "And I kind of have a suspicion."}, {"time": 936, "text": "I've not thought it through."}, {"time": 940, "text": "I kind of have a suspicion that that explanation will eventually show you that in no meaningful sense can there be randomness underneath the universe."}, {"time": 946, "text": "That is that if there is, it's something that is necessarily irrelevant to our perception of the universe."}, {"time": 952, "text": "That is that it could be there, but doesn't matter because in a sense, we've already, you know, whatever it would do, whatever extra thing it would add is not relevant to our perception of what's going on."}, {"time": 969, "text": "So why does the universe exist?"}, {"time": 969, "text": "How does the relevance of randomness connect to the big why question of the universe?"}, {"time": 977, "text": "So, OK, so I mean, why does the universe exist?"}, {"time": 977, "text": "Well, let's see."}, {"time": 983, "text": "And is this the only universe we got?"}, {"time": 983, "text": "It's the only one that about that I'm pretty sure."}, {"time": 988, "text": "So now maybe which one which of these topics is better to enter first?"}, {"time": 988, "text": "Why does the universe exist and why you think it's the only one that exists?"}, {"time": 995, "text": "Well, I think they're very closely related."}, {"time": 995, "text": "OK. OK."}, {"time": 1001, "text": "So, I mean, the first thing, let's see, I mean, this why does the universe exist question is built on top of all these things that we've been figuring out about fundamental physics, because if you want to know why the universe exists, you kind of have to know what the universe is made of."}, {"time": 1015, "text": "And I think the well, let me let me describe a little bit about the why does the universe exist question."}, {"time": 1022, "text": "So the main issue is let's say you have a model for the universe and you say I've got this this program or something and you run it and you make the universe."}, {"time": 1032, "text": "Now you say, well, how do you actually why is that program actually running?"}, {"time": 1037, "text": "And people say you've got this program that makes the universe."}, {"time": 1037, "text": "What computer is it running on?"}, {"time": 1041, "text": "What what does it mean?"}, {"time": 1041, "text": "What actualizes something?"}, {"time": 1041, "text": "You know, two plus two equals four."}, {"time": 1047, "text": "But that's different from saying this to a pile of two rocks, another pile of two rocks, and so many moves them together and makes four, so to speak."}, {"time": 1051, "text": "And so what is it that kind of turns it from being just this formal thing to being something that is actualized?"}, {"time": 1057, "text": "OK, so there we have to start thinking about, well, well, what do we actually know about what's going on in the universe?"}, {"time": 1067, "text": "Well, we are observers of this universe."}, {"time": 1067, "text": "But confusingly enough, we're part of this universe."}, {"time": 1073, "text": "So in a sense, we what what what if we say what do we what do we know about what's going on in the universe?"}, {"time": 1079, "text": "Well, what we know is what sort of our consciousness records about what's going on in the universe."}, {"time": 1084, "text": "And consciousness is part of the fabric of the universe."}, {"time": 1084, "text": "So we're in it."}, {"time": 1089, "text": "Yes, we're in it."}, {"time": 1089, "text": "And maybe I should maybe I should start off by saying something about the consciousness story, because that's some."}, {"time": 1095, "text": "Maybe we should begin even before that at the very base layer of the Wolfram physics project."}, {"time": 1103, "text": "Maybe you can give a broad overview once again really quick about this hypergraph model."}, {"time": 1109, "text": "And also, what is it a year and a half ago since you've brought this project to the world?"}, {"time": 1116, "text": "What is the status update where what are all the beautiful ideas you have come across?"}, {"time": 1122, "text": "What are the interesting things you can mention?"}, {"time": 1122, "text": "It's I mean, it's a it's a frigging Cambrian explosion."}, {"time": 1128, "text": "I mean, it's it's crazy."}, {"time": 1128, "text": "I mean, there are all these things which I've kind of wondered about for years."}, {"time": 1133, "text": "And suddenly, there's actually a way to think about them."}, {"time": 1138, "text": "And I really did not see."}, {"time": 1138, "text": "I mean, the real strength of what's happened, I absolutely did not see coming."}, {"time": 1144, "text": "And the real strength of it is we've got this model for physics, but it turns out it's a foundational kind of model."}, {"time": 1149, "text": "That's a different kind of computation like model that I'm kind of calling the sort of multi computational model."}, {"time": 1153, "text": "And that that kind of model is applicable not only to physics, but also to lots of other kinds of things."}, {"time": 1160, "text": "And one reason that's extremely powerful is because physics has been very successful."}, {"time": 1166, "text": "So we know a lot based on what we figured out in physics."}, {"time": 1171, "text": "And if we know that the same model governs physics and governs, I don't know, economics, linguistics, immunology, whatever, we know that the same kind of model governs those things."}, {"time": 1182, "text": "We can start using things that we've successfully discovered in physics and applying those intuitions in all these other areas."}, {"time": 1187, "text": "And that's that's pretty exciting and very and very surprising to me."}, {"time": 1192, "text": "And in fact, it's kind of like in the original story of sort of you go and you explain why is there complexity in the natural world, then you realize, well, there's all this complexity, there's all this computational irreducibility."}, {"time": 1203, "text": "You know, there's a lot we can't know about what's going to happen."}, {"time": 1208, "text": "It's kind of kind of very confusing thing for people who say, you know, science has nailed everything down."}, {"time": 1212, "text": "We're going to, you know, based on science, we can know everything."}, {"time": 1216, "text": "Well, actually, there's this computational irreducibility thing right in the middle of that, thrown up by science, so to speak."}, {"time": 1220, "text": "And then the question is, well, given computational irreducibility, how can we actually figure out anything about what happens in the world?"}, {"time": 1229, "text": "Why aren't we why are we able to predict anything?"}, {"time": 1229, "text": "Why are we able to operate in the world?"}, {"time": 1233, "text": "And the answer is that we sort of live in these slices of computational reusability that exist in this kind of ocean of computational irreducibility."}, {"time": 1239, "text": "And it turns out that seems that it's a very fundamental feature of the kind of model that seems to operate in physics, and perhaps in a lot of these other areas, that there are these particular slices of computational reusability that are relevant to us."}, {"time": 1255, "text": "And those are the things that both allow us to operate in the world, and not just have everything be completely unpredictable."}, {"time": 1262, "text": "But there are also things that potentially give us what amount to sort of physics like laws in all these other areas."}, {"time": 1272, "text": "So that's, that's been sort of an exciting thing."}, {"time": 1272, "text": "But, but I would say that in general, for our project, it's been going spectacularly well."}, {"time": 1277, "text": "I mean, you know, I, it's very, honestly, it wasn't something I expected to happen in my lifetime."}, {"time": 1283, "text": "I mean, it's, you know, it's something where, where it's, it's an in fact, one of the things about it, some of the things that we've discovered, are things where I was pretty sure that wasn't how things worked."}, {"time": 1294, "text": "And turns out I'm wrong."}, {"time": 1294, "text": "And, you know, in a major area in metamathematics, I've been realizing that I something I've long believed we can talk about it later that that that just just really isn't right."}, {"time": 1305, "text": "But But I think that the the thing that so so what's happened with the physics project?"}, {"time": 1313, "text": "I mean, you know, it's a can explain a little bit about how the how the model works."}, {"time": 1319, "text": "But basically, we can maybe ask you the following question."}, {"time": 1322, "text": "So it's easy through words describe how cellular automata works, you've you've explained this."}, {"time": 1328, "text": "And it's the fundamental mechanism by which you in your book, and you kind of science explored the idea of complexity and how to do science in this world of island reducible islands and irreducible general irreducibility."}, {"time": 1341, "text": "Okay, so how does the model of hypergraphs differ from cellular automata?"}, {"time": 1350, "text": "And how does the idea of multi computation differ?"}, {"time": 1355, "text": "Like, maybe that's a way to describe it."}, {"time": 1355, "text": "We're we're, you know, right."}, {"time": 1355, "text": "This is a, you know, my life is like all of our lives, something of a story of computational irreducibility."}, {"time": 1367, "text": "And, you know, it's been going for a few years now."}, {"time": 1367, "text": "So it's always a challenge to kind of find these appropriate pockets of reducibility."}, {"time": 1372, "text": "But let me see what I can do."}, {"time": 1372, "text": "So, so I mean, first of all, let's let's talk about physics, first of all."}, {"time": 1377, "text": "And, you know, a key observation, that one of the starting point of our physics project is things about what is space?"}, {"time": 1383, "text": "What is the universe made of?"}, {"time": 1389, "text": "And, you know, ever since Euclid, people just sort of say space is just this thing where you can put things at any position you want."}, {"time": 1395, "text": "And they're just points."}, {"time": 1395, "text": "And they're just geometrical things that you can just arbitrarily put at different different coordinate positions."}, {"time": 1405, "text": "So the first thing in our physics project is the idea that space is made of something, just like just like water is made of molecules, space is made of kind of atoms of space."}, {"time": 1410, "text": "And the only thing we can say about these atoms of space is they have some identity."}, {"time": 1416, "text": "There's a there's a there is it's this atom as opposed to this atom."}, {"time": 1420, "text": "And, you know, you could give them a few a computer person, you give them UUIDs or something."}, {"time": 1425, "text": "And that's all there is to say about them, so to speak."}, {"time": 1425, "text": "And then all we know about these atoms of space is how they relate to each other."}, {"time": 1434, "text": "So we say, these three atoms of space are associated with each other in some relation."}, {"time": 1442, "text": "So you can think about that as you know, what atom of space is friends with what other atom of space, you can build this essentially friend network of the atoms of space."}, {"time": 1453, "text": "And the sort of starting point of our physics project is that's what our universe is, it's a giant friend network of the atoms of space."}, {"time": 1458, "text": "And so how can that possibly represent our universe?"}, {"time": 1464, "text": "Well, it's like in something like water, you know, their molecules bouncing around, but on a large scale that, you know, that produces fluid flow, and we have fluid vortices, and we have all of these phenomena that are sort of the emergent phenomena from that underlying kind of collection of molecules bouncing around."}, {"time": 1482, "text": "And by the way, it's important that that collection of molecules bouncing around have this phenomenon of computational irreducibility, that's actually what leads to the second law of thermodynamics among other things."}, {"time": 1495, "text": "And that leads to the sort of randomness of the underlying behavior, which is what gives you something which on a large scale seems like it's a smooth continuous type of thing."}, {"time": 1500, "text": "And so okay, so first thing is space is made of something, it's made of all these atoms of space connected together in this network."}, {"time": 1513, "text": "And then everything that we experience is sort of features of that structure of space."}, {"time": 1520, "text": "So, you know, when we have an electron or something or a photon, it's some kind of tangle in the structure of space, much like kind of a vortex in a fluid would be just this thing that is, you know, it can actually, the vortex can move around, it can involve different molecules in the fluid, but the vortex still stays there."}, {"time": 1538, "text": "And if you zoom out enough, the vortex looks like an atom itself, like a basic element."}, {"time": 1542, "text": "So there's the levels of abstraction."}, {"time": 1542, "text": "If you squint and kind of blur things out, it looks like at every level of abstraction, you can define what is a basic individual entity."}, {"time": 1555, "text": "But, you know, in this model, there's a bottom level, you know, there's an elementary length, maybe 10 to the minus 100 meters, let's say, which is really small, you know, proton is 10 to the minus 15 meters, the smallest we've ever been able to sort of see with a particle accelerator is around 10 to the minus 21 meters."}, {"time": 1572, "text": "So, you know, if we don't know precisely what the correct scale is, but it's perhaps over the order of 10 to the minus 100 meters, so it's pretty small."}, {"time": 1581, "text": "But that's the end, that's what things are made of."}, {"time": 1586, "text": "What's your intuition where the 10 to the minus 100 comes from?"}, {"time": 1586, "text": "What's your intuition about this scale?"}, {"time": 1593, "text": "Well, okay, so there's a calculation, which I consider to be somewhat rickety, okay, which has to do with comparing, so there are various fundamental constants, there's a speed of light, the speed of light, once you know the elementary time, the speed of light tells you the conversion from the elementary time to the elementary length."}, {"time": 1612, "text": "Then there's the question of how do you convert to the elementary energy?"}, {"time": 1612, "text": "And how do you convert to between other things?"}, {"time": 1616, "text": "And the various constants we know, we know the speed of light, we know the gravitational constant, we know Planck's constant and quantum mechanics, those are the three important ones."}, {"time": 1625, "text": "And we actually know some other things, we know things like the size of the universe, the Hubble constant, things like that."}, {"time": 1629, "text": "And essentially, this calculation of the elementary length comes from looking at the combination of those."}, {"time": 1641, "text": "Okay, so the most obvious thing, people have assumed that quantum gravity happens at this thing, the Planck scale, 10 to the minus 34 meters, which is the combination of Planck's constant and the gravitational constant, the speed of light, that gives you that kind of length."}, {"time": 1657, "text": "Turns out in our model, there is an additional parameter, which is essentially the number of simultaneous threads of execution of the universe, which is essentially the number of sort of independent quantum processes that are going on."}, {"time": 1667, "text": "And that number, let's see if I remember that number, that number is 10 to the 170, I think, and so it's a big number."}, {"time": 1672, "text": "But that number then connects, sort of modifies what you might think from all these Planck units to give you the things we're giving."}, {"time": 1687, "text": "And there's been sort of a mystery actually in the more technical physics thing, that the Planck mass, the Planck energy, Planck energy is actually surprisingly big."}, {"time": 1692, "text": "The Planck length is tiny, 10 to the minus 34 meters, you know, Planck time, 10 to the minus 43 meters, I think, seconds, I think."}, {"time": 1704, "text": "But the Planck energy is like the energy of a lightning strike, okay, which is pretty weird."}, {"time": 1712, "text": "In our models, the actual elementary energy is that divided by the number of sort of simultaneous quantum threads, and it ends up being really small too."}, {"time": 1718, "text": "And that sort of explains that mystery that's been around for a while about how Planck units work."}, {"time": 1723, "text": "But whether that precise estimate is right, we don't know yet."}, {"time": 1730, "text": "I mean, that's one of the things that's sort of been a thing we've been pretty interested in is how do you see through, you know, how do you make a gravitational microscope that can kind of see through to the atoms of space?"}, {"time": 1740, "text": "You know, how do you get in fluid flow, for example, if you go to hypersonic flow or something, you know, you've got a Mach 20, you know, space plane or something, it really matters that there are individual molecules hitting the space plane, not a continuous fluid."}, {"time": 1755, "text": "The question is, what is the analog of hypersonic flow for things about the structure of spacetime?"}, {"time": 1797, "text": "And there may be some effect in, for example, gravitational waves produced by rapidly rotating black hole that in which one could actually see some phenomenon where one can say, yes, these don't come out the way one would expect based on having a continuous structure of spacetime, that is something where you can kind of see through to the discrete structure."}, {"time": 1819, "text": "We don't know that yet."}, {"time": 1819, "text": "So can you maybe elaborate a little bit deeper how a microscope that can see the 10 to the minus 100, how rotating black holes and presumably the detailed accurate detection of gravitational waves from such black holes can reveal the discreteness of space?"}, {"time": 1842, "text": "Okay, first thing is, what is a black hole?"}, {"time": 1842, "text": "Actually, we need to go a little bit further in the story of what spacetime is, because I explained a little bit about what space is, but I didn't talk about what time is."}, {"time": 1850, "text": "And that's sort of important in understanding spacetime, so to speak."}, {"time": 1855, "text": "And your sense is both space and time in the story are discrete."}, {"time": 1859, "text": "But it's a complicated story."}, {"time": 1859, "text": "And needless to say."}, {"time": 1865, "text": "Well, it's simple at the bottom."}, {"time": 1865, "text": "It's very simple at the bottom."}, {"time": 1865, "text": "In the end, it's simple but deeply abstract."}, {"time": 1871, "text": "And something that is simple in conception, but kind of wrapping one's head around what's going on is pretty hard."}, {"time": 1878, "text": "So first of all, we have this."}, {"time": 1884, "text": "So I've described these kind of atoms of space and their connections."}, {"time": 1889, "text": "You can think about these things as a hypergraph."}, {"time": 1889, "text": "A graph is just you connect nodes to nodes, but a hypergraph you can have not just individual friends to friends, but you can have these triplets of friends or whatever else."}, {"time": 1900, "text": "And so we're just saying that's just the relations between atoms of space are the hyperedges of the hypergraph."}, {"time": 1907, "text": "And so we got some big collection of these atoms of space, maybe 10 to the 400 or something in our universe."}, {"time": 1912, "text": "And that's the structure of space."}, {"time": 1919, "text": "And every feature of what we experience in the world is a feature of that hypergraph, that spatial hypergraph."}, {"time": 1927, "text": "So then the question is, well, what does that spatial hypergraph do?"}, {"time": 1932, "text": "Well, the idea is that there are rules that update that spatial hypergraph."}, {"time": 1932, "text": "And in a cellular automaton, you've just got this line of cells and you just say at every step, at every time step, you've got fixed time steps, fixed array of cells."}, {"time": 1943, "text": "At every step, every cell gets updated according to a certain rule."}, {"time": 1949, "text": "And that's the way it works."}, {"time": 1949, "text": "Now in this hypergraph, it's sort of vaguely the same kind of thing."}, {"time": 1956, "text": "We say every time you see a little piece of hypergraph that looks like this, update it to one that looks like this."}, {"time": 1960, "text": "So just keep rewriting this hypergraph."}, {"time": 1960, "text": "Every time you see something that looks like that, anywhere in the universe, it gets rewritten."}, {"time": 1967, "text": "Now, one thing that's tricky about that, which we'll come to, is this multi computational idea, which has to do with you're not saying in some kind of lockstep way, do this one, then this one, then this one."}, {"time": 1982, "text": "It's just whenever you see one you can do, you can go ahead and do it."}, {"time": 1982, "text": "And that leads one not to have a single thread of time in the universe."}, {"time": 1987, "text": "Because if you knew which one to do, you just say, okay, we do this one, then we do this one, then we do this one."}, {"time": 1993, "text": "But if you say, just do whichever one you feel like, you end up with these multiple threads of time, these kind of multiple histories of the universe, depending on which order you happen to do the things you could do in."}, {"time": 2006, "text": "So it's fundamentally asynchronous and parallel."}, {"time": 2010, "text": "Which is very uncomfortable for the human brain that seeks for things to be sequential."}, {"time": 2015, "text": "And synchronous."}, {"time": 2016, "text": "Well, I think that this is part of the story of consciousness, is I think the key aspect of consciousness that is important for sort of parsing the universe, is this point that we have a single thread of experience."}, {"time": 2028, "text": "We have a memory of what happened in the past."}, {"time": 2033, "text": "We can say something, predict something about the future, but there's a single thread of experience."}, {"time": 2037, "text": "And it's not obvious it should work that way."}, {"time": 2037, "text": "I mean, we've got 100 billion neurons in our brains and they're all firing at all kinds of different ways."}, {"time": 2044, "text": "But yet, our experience is that there is the single thread of time that goes along."}, {"time": 2044, "text": "And I think that one of the things I've kind of realized with a lot more clarity in the last year is the fact that the fact that we conclude that the universe has the laws it has is a consequence of the fact that we have consciousness the way we have consciousness."}, {"time": 2064, "text": "And so, just to go on with kind of the basic setup, so we've got this spatial hypergraph, it's got all these atoms of space, they're getting these little clumps of atoms of space, they're getting turned into other clumps of atoms of space, and that's happening everywhere in the universe all the time."}, {"time": 2081, "text": "And so, one thing that's a little bit weird is there's nothing permanent in the universe."}, {"time": 2085, "text": "The universe is getting rewritten everywhere all the time."}, {"time": 2089, "text": "And if it wasn't getting rewritten, space wouldn't be knitted together."}, {"time": 2093, "text": "That is, space would just fall apart."}, {"time": 2093, "text": "There wouldn't be any way in which we could say this part of space is next to this part of space."}, {"time": 2098, "text": "One of the things that people were confused about back in antiquity, the ancient Greek philosophers and so on, is how does motion work?"}, {"time": 2104, "text": "How can it be the case that you can take a thing that we can walk around and it's still us when we walked a foot forward, so to speak?"}, {"time": 2116, "text": "And in a sense, with our models, that's again a question because it's a different set of atoms of space."}, {"time": 2123, "text": "When I move my hand, it's moving into a different set of atoms of space."}, {"time": 2129, "text": "It's having to be recreated."}, {"time": 2129, "text": "The thing itself is not there."}, {"time": 2129, "text": "It's being continuously recreated all the time."}, {"time": 2135, "text": "Now, it's a little bit like waves in an ocean, vortices in a fluid, which again, the actual molecules that exist in those are not what define the identity of the thing."}, {"time": 2146, "text": "But this idea that there can be pure motion, that it is even possible for an object to just move around in the universe and not change, it's not self evident that such a thing should be possible."}, {"time": 2160, "text": "And that is part of our perception of the universe is that we parse those aspects of the universe where things like pure motion are possible."}, {"time": 2166, "text": "Now, pure motion, even in general relativity, the theory of gravity, pure motion is a little bit of a complicated thing."}, {"time": 2176, "text": "I mean, if you imagine your average teacup or something approaching a black hole, it is deformed and distorted by the structure of space time."}, {"time": 2181, "text": "And to say, is it really pure motion?"}, {"time": 2187, "text": "Is it that same teacup that's the same shape?"}, {"time": 2187, "text": "Well, it's a bit of a complicated story."}, {"time": 2187, "text": "And this is a more extreme version of that."}, {"time": 2192, "text": "So anyway, the thing that's happening is we've got space, we've got this notion of time."}, {"time": 2198, "text": "So time is this kind of this rewriting of the hypergraph."}, {"time": 2198, "text": "And one of the things that's important about that time is this sort of computational irreducible process."}, {"time": 2210, "text": "There's something, you know, time is not something where it's kind of the mathematical view of time tends to be time is just to coordinate."}, {"time": 2216, "text": "We can, you know, slide a slider, turn a knob, and we'll change the time that we've got in this equation."}, {"time": 2221, "text": "But in this picture of time, that's not how it works at all."}, {"time": 2226, "text": "Time is this inexorable, irreducible kind of set of computations that go on, that go from where we are now to the future."}, {"time": 2232, "text": "And one of the things that is, again, something one sort of has to break out of is your average trained physicist like me says, you know, space and time are the same kind of thing."}, {"time": 2245, "text": "They're related by, you know, the Poincare group and Lorentz transformations and relativity and all these kinds of things."}, {"time": 2254, "text": "And, you know, space and time, you know, there are all these kind of sort of folk stories you can tell about why space and time are the same kind of thing."}, {"time": 2258, "text": "In this model, they're fundamentally not the same kind of thing."}, {"time": 2263, "text": "Space is this kind of sort of connections between these atoms of space."}, {"time": 2269, "text": "Time is this computational process."}, {"time": 2269, "text": "So the thing that the first sort of surprising thing is, well, it turns out you get relativity anyway."}, {"time": 2275, "text": "And the reason that happens, there are a few bits and pieces here which one has to understand."}, {"time": 2280, "text": "But the fundamental point is if you are an observer embedded in the system that are part of this whole story of things getting updated in this way and that, there's sort of a limit to what you can tell about what's going on."}, {"time": 2292, "text": "And really, in the end, the only thing you can tell is what are the causal relationships between events."}, {"time": 2298, "text": "So an event in this sort of an elementary event is a little piece of hypergraph got rewritten."}, {"time": 2304, "text": "And that means a few hyper edges of the hypergraph were consumed by the event and you produce some other hyper edges."}, {"time": 2316, "text": "And that's an elementary event."}, {"time": 2316, "text": "And so then the question is what we can tell is kind of what the network of causal relationships between elementary events is."}, {"time": 2323, "text": "That's the ultimate thing, the causal graph of the universe."}, {"time": 2328, "text": "And it turns out that, well, there's this property of causal invariance that is true of a bunch of these models and I think is inevitably true for a variety of reasons that makes it be the case that it doesn't matter kind of if you are sort of saying, well, I've got this hypergraph and I can rewrite this piece here and this piece here and I do them all in different orders."}, {"time": 2352, "text": "When you construct the causal graph for each of those orders that you choose to do things in, you'll end up with the same causal graph."}, {"time": 2357, "text": "And so that's essentially why, well, that's in the end why relativity works."}, {"time": 2364, "text": "It's why our perception of space and time is as having this kind of connection that relativity says they should have."}, {"time": 2371, "text": "And that's kind of how that works."}, {"time": 2377, "text": "I think I'm missing a little piece."}, {"time": 2377, "text": "If we can go there again, you said the fact that the observer is embedded in this hypergraph, what's missing?"}, {"time": 2382, "text": "What is the observer not able to state about this universe of space and time?"}, {"time": 2390, "text": "If you look from the outside, you can say, oh, I see this particular place was updated and then this one was updated and I'm seeing which order things were updated in."}, {"time": 2405, "text": "But the observer embedded in the universe doesn't know which order things were updated in because until they've been updated, they have no idea what else happened."}, {"time": 2414, "text": "So the only thing they know is the set of causal relationships."}, {"time": 2414, "text": "Let me give an extreme example."}, {"time": 2420, "text": "Let's imagine that the universe is a Turing machine."}, {"time": 2420, "text": "Turing machines have just this one update head which does something and otherwise the Turing machine just does nothing."}, {"time": 2430, "text": "And the Turing machine works by having this head move around and do its updating just where the head happens to be."}, {"time": 2435, "text": "The question is, could the universe be a Turing machine?"}, {"time": 2435, "text": "Could the universe just have a single updating head that's just zipping around all over the place?"}, {"time": 2440, "text": "You say, that's crazy because I'm talking to you, you seem to be updating, I'm updating, et cetera."}, {"time": 2449, "text": "But the thing is, there's no way to know that because if there was just this head moving around, it's like, okay, it updates me, but you're completely frozen at that point."}, {"time": 2458, "text": "Until the head has come over and updated you, you have no idea what happened to me."}, {"time": 2462, "text": "And so if you sort of unravel that argument, you realize the only thing we actually can tell is what the network of causal relationships between the things that happened were."}, {"time": 2467, "text": "We don't get to know from some sort of outside, sort of God's eye view of the thing."}, {"time": 2473, "text": "We don't get to know what sort of from the outside, what happened."}, {"time": 2479, "text": "We only get to know sort of what the set of relationships between the things that happened actually were."}, {"time": 2488, "text": "But if I somehow record like a trace of this, I guess it would be called multi computation."}, {"time": 2496, "text": "Can't I then look back in the causal tree?"}, {"time": 2500, "text": "Where do you record the trace?"}, {"time": 2502, "text": "Some, you place throughout the universe, like throughout like a log that records in my own pocket of, in this hypergraph."}, {"time": 2510, "text": "Can't I, like realizing that I'm getting an outdated picture, can't I record?"}, {"time": 2518, "text": "See, the problem is, and this is where things start getting very entangled in terms of what one understands."}, {"time": 2523, "text": "The problem is that any such recording device is itself part of the universe."}, {"time": 2530, "text": "So you don't get to say, you never get to say, let's go outside the universe and go do this."}, {"time": 2536, "text": "And that's why, I mean, lots of the features of this model and the way things work end up being a result of that."}, {"time": 2543, "text": "So, but what, I guess from on a human level, what is the cost you're paying?"}, {"time": 2543, "text": "What are you missing from not getting an updated picture all the time?"}, {"time": 2550, "text": "I got, I understand what you're saying."}, {"time": 2555, "text": "But like what, like, how does consciousness emerge from that?"}, {"time": 2555, "text": "Like how, like, what are the limitations of that observer?"}, {"time": 2561, "text": "I understand you're getting a delayed picture."}, {"time": 2565, "text": "Well, there's, there's a, okay."}, {"time": 2565, "text": "So there's, there's a bunch of limitations of the observer, I think."}, {"time": 2570, "text": "Maybe just explain something about quantum mechanics, because that maybe is a, is an extreme version of some of these issues, which helps to kind of motivate why one should sort of think things through a little bit more carefully."}, {"time": 2579, "text": "So one feature of the, of this, okay."}, {"time": 2585, "text": "So in standard physics, like high school physics, you learn, you know, the equations of motion for a ball and the, the, you know, it says you throw the ball this angle, this velocity, things will move in this way."}, {"time": 2596, "text": "And there's a definite answer, right?"}, {"time": 2596, "text": "The story, the key story of quantum mechanics is there aren't definite answers to where does the ball go?"}, {"time": 2601, "text": "There's kind of this whole sort of bundle of possible paths."}, {"time": 2605, "text": "And all we say we know from quantum mechanics is certain probabilities for where the ball will end up."}, {"time": 2612, "text": "So that's kind of the, the core idea of quantum mechanics."}, {"time": 2616, "text": "So in our models, you, quantum mechanics is not some kind of plugin add on type thing."}, {"time": 2622, "text": "You absolutely cannot get away from quantum mechanics because as you think about updating this hypergraph, there isn't just one sequence of things, one definite sequence of things that can happen."}, {"time": 2631, "text": "There are all these different possible update sequences that can occur."}, {"time": 2635, "text": "You could do this, you know, piece of the hypergraph now, and then this one later and et cetera, et cetera, et cetera."}, {"time": 2639, "text": "All those different paths of history correspond to these quantum, quantum paths and quantum mechanics, these different possible quantum histories."}, {"time": 2650, "text": "And one of the things that's kind of surprising about it is they, they branch, you know, there can be a certain state of the universe and it could do this or it could do that, but they can also merge."}, {"time": 2660, "text": "There can be two states of the universe, which their next state, the next state they produce is the same for both of them."}, {"time": 2665, "text": "And that process of branching and merging is kind of critical."}, {"time": 2670, "text": "And the idea that there can be merging is critical and somewhat non trivial for these hypergraphs because there's a whole graph isomorphism story and there's a whole very elaborate set of mathematics."}, {"time": 2679, "text": "Among other things."}, {"time": 2679, "text": "But so then what happens is that what one's seeing, okay, so we've got this thing, it's branching, it's merging, et cetera, et cetera, et cetera."}, {"time": 2693, "text": "So now the question is how do we perceive that?"}, {"time": 2693, "text": "Why don't we notice that the universe is branching and merging?"}, {"time": 2701, "text": "Why is it the case that we just think a definite set of things happen?"}, {"time": 2706, "text": "Well, the answer is we are embedded in that universe and our brains are branching and merging too."}, {"time": 2711, "text": "And so what quantum mechanics becomes a story of is how does a branching brain perceive a branching universe?"}, {"time": 2716, "text": "And the key thing is as soon as you say, I think definite things happen in the universe, that means you are essentially conflating lots of different parts of history."}, {"time": 2728, "text": "You're saying, actually, as far as I'm concerned, because I'm convinced that definite things happen in the universe, all these parts of history must be equivalent."}, {"time": 2738, "text": "Now, it's not obvious that that would be a consistent thing to do."}, {"time": 2738, "text": "It might be, you say, all these parts of history are equivalent, but by golly, moments later, that would be a completely inconsistent point of view."}, {"time": 2747, "text": "Everything would have gone to hell in different ways."}, {"time": 2751, "text": "The fact that that doesn't happen is, well, that's a consequence of this causal invariance thing."}, {"time": 2756, "text": "And the fact that that does happen a little bit is what causes little quantum effects."}, {"time": 2761, "text": "And if that didn't happen at all, there wouldn't be anything that sort of is like quantum mechanics."}, {"time": 2768, "text": "Quantum mechanics is kind of like in this bundle of paths."}, {"time": 2768, "text": "It's a little bit like what happens in statistical mechanics and fluid mechanics, whatever, that most of the time, you just see this continuous fluid."}, {"time": 2780, "text": "You just see the world just progressing in this kind of way that's like this continuous fluid."}, {"time": 2785, "text": "But every so often, if you look at the exact right experiment, you can start seeing, well, actually, it's made of these molecules where they might go that way, or they might go this way, and that's kind of quantum effects."}, {"time": 2793, "text": "And so, this kind of idea of where we're sort of embedded in the universe, this branching brain is perceiving this branching universe, and that ends up being sort of a story of quantum mechanics."}, {"time": 2805, "text": "That's part of the whole picture of what's going on."}, {"time": 2811, "text": "But I think, I mean, to come back to sort of what is the story of consciousness."}, {"time": 2816, "text": "So, in the universe, we've got whatever it is, 10 to the 400 atoms of space, they're all doing these complicated things."}, {"time": 2823, "text": "It's all a big, complicated, irreducible computation."}, {"time": 2828, "text": "The question is, what do we perceive from all of that?"}, {"time": 2828, "text": "And the answer is that we are parsing the universe in a particular way."}, {"time": 2835, "text": "Let me again go back to the gas molecules analogy."}, {"time": 2835, "text": "In the gas in this room, there are molecules bouncing around all kinds of complicated patterns, but we don't care."}, {"time": 2848, "text": "All we notice is there's, you know, the gas laws are satisfied."}, {"time": 2848, "text": "Maybe there's some fluid dynamics."}, {"time": 2854, "text": "These are kind of features of that assembly of molecules that we notice, and then lots of details we don't notice."}, {"time": 2860, "text": "When you say we, do you mean the tools of physics, or do you mean literally the human brain and its perception system?"}, {"time": 2864, "text": "So, the human brain is where it starts, but we've built a bunch of instruments to do a bit better than the human brain, but they still have many of the same kinds of ideas, you know, their cameras and their pressure sensors and these kinds of things."}, {"time": 2878, "text": "They're not, you know, at this point, we don't know how to make fundamentally qualitatively different sensory devices."}, {"time": 2884, "text": "So, it's always just an extension of the consciousness experience."}, {"time": 2889, "text": "Or our sensory experience."}, {"time": 2889, "text": "Sensory experience, but sensory experience is somehow intricately tied to consciousness."}, {"time": 2894, "text": "Well, so one question is, when we are looking at all these molecules in the gas, and there might be 10 to the 20th molecules in some little box or something, it's like, what do we notice about those molecules?"}, {"time": 2904, "text": "So, one thing that we can say is, we don't notice that much."}, {"time": 2910, "text": "We are, you know, we are computationally bounded observers."}, {"time": 2916, "text": "We can't go in and say, okay, I'm the 10 to the 20th molecules, and I know that I can sort of decrypt their motions, and I can figure out this and that."}, {"time": 2923, "text": "It's like, I'm just going to say, what's the average density of molecules?"}, {"time": 2927, "text": "And so, one key feature of us is that we are computationally bounded."}, {"time": 2932, "text": "And that when you are looking at a universe which is full of computation and doing huge amounts of computation, but we are computationally bounded, there's only certain things about that universe that we're going to be sensitive to."}, {"time": 2943, "text": "We're not going to be, you know, figuring out what all the atoms of space are doing, because we're just computationally bounded observers, and we are only sampling these small set of features."}, {"time": 2953, "text": "So, I think the two defining features of consciousness that, and I, you know, I would say that the sort of the preamble to this is, for years, you know, as I've talked about sort of computation and fundamental features of physics and science, people ask me, so what about consciousness?"}, {"time": 2970, "text": "And I, for years, I've said, I have nothing to say about consciousness."}, {"time": 2976, "text": "And, you know, I've kind of told this story, you know, you talk about intelligence, you talk about life."}, {"time": 2980, "text": "These are both features where you say, what's the abstract definition of life?"}, {"time": 2985, "text": "We don't really know the abstract definition."}, {"time": 2989, "text": "We know the one for life on Earth, it's got RNA, it's got cell membranes, it's got all this kind of stuff."}, {"time": 2993, "text": "Similarly for intelligence, we know the human definition of intelligence, but what is intelligence abstractly?"}, {"time": 2998, "text": "And so, what I've long believed is that sort of the abstract definition of intelligence is just computational sophistication."}, {"time": 3009, "text": "That is, that as soon as you can be computationally sophisticated, that's kind of the abstract version, the generalized version of intelligence."}, {"time": 3014, "text": "So, then the question is, what about consciousness?"}, {"time": 3020, "text": "And what I sort of realized is that consciousness is actually a step down from intelligence."}, {"time": 3020, "text": "That is, that you might think, oh, you know, consciousness is the top of the pie, but it's the top of the pile."}, {"time": 3032, "text": "But actually, I don't think it is."}, {"time": 3032, "text": "I think that there's this notion of kind of computational sophistication, which is the generalized intelligence."}, {"time": 3037, "text": "But consciousness has two limitations, I think."}, {"time": 3042, "text": "One of them is computational boundedness."}, {"time": 3042, "text": "That is, that we're only perceiving a sort of computationally bounded view of the universe."}, {"time": 3047, "text": "And the other is this idea of a single thread of time."}, {"time": 3053, "text": "That is, that we, and in fact, we know neurophysiologically our brains go to some trouble to give us this one thread of attention, so to speak."}, {"time": 3059, "text": "And it isn't the case that in all the neurons in our brains that, at least in our conscious, the correspondence of language, in our conscious experience, we just have the single thread of attention, single thread of perception."}, {"time": 3077, "text": "And maybe there's something unconscious that's bubbling around that's the kind of almost the quantum version of what's happening in our brain, so to speak."}, {"time": 3083, "text": "We've got the classical flow of what we are mostly thinking about, so to speak."}, {"time": 3088, "text": "But there's this kind of bubbling around of other paths that is all those other neurons that didn't make it to be part of our sort of conscious stream of experience."}, {"time": 3098, "text": "So in that sense, intelligence as computational sophistication is much broader than the computational constraints which consciousness operates under, and also the sequential, like the sequential thing, like the notion of time."}, {"time": 3114, "text": "But then the follow up question is like, okay, starting to get a sense of what is intelligence, and how does that connect to our human brain?"}, {"time": 3125, "text": "Because you're saying intelligence is almost like a fabric, like what we like plug into it or something, like our consciousness plugs into it."}, {"time": 3138, "text": "Yeah, I mean, the intelligence, I think the core, I mean, you know, intelligence at some level is just a word, but we are asking, you know, what is the notion of intelligence as we generalize it beyond the bounds of humans, beyond the bounds of even the AIs that we humans have built and so on?"}, {"time": 3153, "text": "You know, what is intelligence?"}, {"time": 3153, "text": "You know, is the weather, you know, people say the weather has a mind of its own."}, {"time": 3159, "text": "You know, can the weather be intelligent?"}, {"time": 3163, "text": "What does agency have to do with intelligence here?"}, {"time": 3163, "text": "So is intelligence just like your conception of computation, just intelligence is the capacity to perform computation and the sea of?"}, {"time": 3174, "text": "I mean, I think that's right."}, {"time": 3174, "text": "And I think that, you know, this question of, is it for a purpose?"}, {"time": 3179, "text": "Okay, that quickly degenerates into a horrible philosophical mess."}, {"time": 3187, "text": "Because, you know, whenever you say, did the weather do that for a purpose?"}, {"time": 3192, "text": "Well, yes, it did."}, {"time": 3192, "text": "It was trying to move a bunch of hot air from the equator to the poles or something."}, {"time": 3197, "text": "That's its purpose."}, {"time": 3197, "text": "Because I seem to be equally as dumb today as I was yesterday."}, {"time": 3203, "text": "So there's some persistence, like a consistency over time that the intelligence I plugged into."}, {"time": 3210, "text": "So like, what's, it seems like there's a hard constraint between the amount of computation I can perform in my consciousness."}, {"time": 3217, "text": "Like they seem to be really closely connected somehow."}, {"time": 3222, "text": "Well, I think the point is that the thing that gives you kind of the ability to have kind of conscious intelligence, you can have kind of this, okay, so one thing is we don't know intelligences other than the ones that are very much like us."}, {"time": 3237, "text": "And the ones that are very much like us, I think have this feature of single thread of time, bounded, you know, computationally bounded."}, {"time": 3247, "text": "But you also need computational sophistication."}, {"time": 3247, "text": "Having a single thread of time and being computationally bounded, you could just be a clock going tick tock."}, {"time": 3254, "text": "That would satisfy those conditions."}, {"time": 3259, "text": "But the fact that we have this sort of irreducible computational ability, that's an important feature."}, {"time": 3267, "text": "That's sort of the bedrock on which we can construct the things we construct."}, {"time": 3274, "text": "Now, the fact that we have this experience of the world that has the single thread of time and computational boundedness, the thing that I sort of realized is it's that that causes us to deduce from this irreducible mess of what's going on in the physical world, the laws of physics that we think exist."}, {"time": 3293, "text": "So in other words, if we say, why do we believe that there is, you know, continuous space, let's say, why do we believe that gravity works the way it does?"}, {"time": 3306, "text": "Well, in principle, we could be kind of parsing details of the universe that were, you know, that OK, the analogy is, again, with the statistical mechanics and molecules in a box, we could be sensitive to every little detail of the swirling around of those molecules."}, {"time": 3322, "text": "And we could say what really matters is the, you know, the wiggle effect that is, you know, that is something that we humans just never noticed because it's some weird thing that happens when there are 15 collisions of air molecules and this happens and that happens."}, {"time": 3337, "text": "We just see the pure motion of a ball moving about."}, {"time": 3342, "text": "Why do we see that?"}, {"time": 3342, "text": "And the point is that that what seems to be the case is that the things that if we say, given this sort of hypergraph that's updating and all the details about all the sort of atoms of space and what they do, and we say, how do we slice that to what we can be sensitive to?"}, {"time": 3360, "text": "What seems to be the case is that as soon as we assume, you know, computational boundedness, single thread of time, that leads us to general relativity."}, {"time": 3372, "text": "In other words, we can't avoid that."}, {"time": 3372, "text": "That's the way that we will parse the universe."}, {"time": 3377, "text": "Given those constraints, we parse the universe according to those particular in such a way that we say the aggregate reducible sort of pocket of computational reducibility that we slice out of this kind of whole computational irreducible ocean of behavior is just this one that corresponds to general relativity."}, {"time": 3398, "text": "Yeah, but we don't perceive general relativity."}, {"time": 3398, "text": "Well, we do if we do fancy experiments."}, {"time": 3404, "text": "So you're saying so perceive really does mean the full."}, {"time": 3404, "text": "We drop something."}, {"time": 3404, "text": "That's a great example of general relativity in action."}, {"time": 3409, "text": "No, but like what's the difference in that and Newtonian mechanics?"}, {"time": 3414, "text": "I mean, oh, it doesn't."}, {"time": 3414, "text": "This is when I say general relativity, that's the uber theory, so to speak."}, {"time": 3420, "text": "I mean, Newtonian gravity is just the approximation that we can make, you know, on the earth and things like that."}, {"time": 3425, "text": "So this is, you know, the phenomenon of gravity is one that is a consequence of, you know, we would perceive something very different from gravity."}, {"time": 3437, "text": "So so the way to understand that is when we think about OK, so we make up reference frames with which we parse what's happening in space and time."}, {"time": 3446, "text": "So in other words, one of the one of the things that we do is we say as time progresses everywhere in space is something happens at a particular time and then we go to the next time and we say this is what space is like at the next time is what space is like at the next time."}, {"time": 3464, "text": "That's it's the reason we are used to doing that is because, you know, when we look around, we might see, you know, ten hundred meters away."}, {"time": 3477, "text": "The time it takes light to travel that distance is really short compared to the time it takes our brains to know what happened."}, {"time": 3482, "text": "So as far as our brains are concerned, we are parsing the universe in this."}, {"time": 3488, "text": "There is a moment in time, it's all of space."}, {"time": 3488, "text": "There's a moment in time, it's all of space."}, {"time": 3492, "text": "If we were the size of planets or something, we would have a different perception because the speed of light would be much more important to us."}, {"time": 3497, "text": "We wouldn't have this perception that things happen progressively in time everywhere in space."}, {"time": 3502, "text": "And so that's an important kind of constraint."}, {"time": 3508, "text": "And the reason that we kind of parse the universe in the way that causes us to say gravity works the way it does is because we're doing things like deciding that we can say the universe exists, space has a definite structure."}, {"time": 3519, "text": "There is a moment in time, space has this definite structure."}, {"time": 3525, "text": "We move to the next moment in time, space has another structure."}, {"time": 3525, "text": "That kind of setup is what lets us kind of deduce kind of what parse the universe in such a way that we say gravity works the way it does."}, {"time": 3538, "text": "So that kind of reference frame is that the illusion of that is that you're saying that's somehow useful for consciousness."}, {"time": 3545, "text": "That's what consciousness does."}, {"time": 3545, "text": "Because in a sense, what consciousness is doing is it's insisting that the universe is kind of sequentialized."}, {"time": 3561, "text": "And it is not allowing the possibility that, oh, there are these multiple threads of time and they're all flowing differently."}, {"time": 3565, "text": "It's like saying, no, everything is happening in this one thread of experience that we have."}, {"time": 3571, "text": "And that illusion of that one thread of experience cannot happen at the planetary scale."}, {"time": 3576, "text": "Are you saying typical human, are you saying we are at a human level is special here for consciousness?"}, {"time": 3581, "text": "Well, for our kind of consciousness, if we existed at a scale close to the elementary length, for example, then our perception of the universe will be absurdly different."}, {"time": 3593, "text": "But this makes consciousness seem like a weird side effect to this particular scale."}, {"time": 3598, "text": "And so who cares?"}, {"time": 3598, "text": "I mean, consciousness is not that special."}, {"time": 3605, "text": "Look, I think that a very interesting question is, which I've certainly thought a little bit about, is what can you imagine?"}, {"time": 3610, "text": "What is a sort of factoring of something?"}, {"time": 3610, "text": "What are some other possible ways you could exist, so to speak?"}, {"time": 3616, "text": "And if you were a photon, if you were some kind of thing that was kind of, you know, intelligence represented in terms of photons, you know, for example, the photons we receive in the cosmic microwave background, those photons, as far as they're concerned, the universe just started."}, {"time": 3635, "text": "They were emitted, you know, 100,000 years after the beginning of the universe, they've been traveling at the speed of light, time stayed still for them, and then they just arrived and we just detected them."}, {"time": 3643, "text": "So for them, the universe just started."}, {"time": 3649, "text": "And that's a different perception of, you know, that has implications for a very different perception of time."}, {"time": 3653, "text": "They don't have that single thread that seems to be really important for being able to tell a heck of a good story."}, {"time": 3661, "text": "So we humans, we can tell a story."}, {"time": 3661, "text": "We can tell a story."}, {"time": 3661, "text": "What other kind of stories can you tell?"}, {"time": 3667, "text": "So photon is a really boring story."}, {"time": 3667, "text": "I mean, so that's a, I don't know if they're a boring story, but I think it's, you know, I've been wondering about this and I've been asking, you know, friends of mine who are science fiction writers and things, have you written stuff about this?"}, {"time": 3680, "text": "And I've got one example, a great collection of books from my friend Rudy Rooker, which I have to say, they're books that are very informed by a bunch of science that I've done."}, {"time": 3688, "text": "And the thing that I really loved about them is, you know, in the first chapter of the book, the Earth is consumed by these things called nants, which are nano, nanobot type things."}, {"time": 3701, "text": "So, you know, so the Earth is gone in the first, but then it comes back."}, {"time": 3707, "text": "But then, yeah, right."}, {"time": 3707, "text": "That was only a micro spoiler."}, {"time": 3713, "text": "It's only chapter one."}, {"time": 3713, "text": "But the thing that is not a real spoiler alert because it's such a complicated concept, but in the end, the Earth is saved by this thing called the principle of computational equivalence, which is a kind of a core scientific idea of mine."}, {"time": 3732, "text": "And I was just like, like thrilled."}, {"time": 3732, "text": "I don't read fiction books very often."}, {"time": 3732, "text": "And I was just thrilled."}, {"time": 3737, "text": "I get to the end of this and it's like, oh, my gosh, you know, everything is saved by this sort of deep scientific principle."}, {"time": 3742, "text": "Can you maybe elaborate how the principle of computational equivalence can save a planet?"}, {"time": 3747, "text": "That would, that would be a terrible spoiler."}, {"time": 3747, "text": "That would be a spoiler."}, {"time": 3756, "text": "But no, but let me say what the principle of computational equivalence is."}, {"time": 3756, "text": "So the question is, you are, you have a system, you have some rule, you can think of its behavior as corresponding to a computation."}, {"time": 3768, "text": "The question is, how sophisticated is that computation?"}, {"time": 3768, "text": "The statement of the principle of computational equivalence is, as soon as it's not obviously simple, it will be as sophisticated as anything."}, {"time": 3780, "text": "And so that has the implication that, you know, rule 30, you know, our brains, other things in physics, they're all ultimately equivalent in the computations they can do."}, {"time": 3792, "text": "And that's what leads to this computational irreducibility idea because the reason we don't get to jump ahead, you know, and out think rule 30 is because we're just computationally equivalent to rule 30."}, {"time": 3802, "text": "So we're kind of just both just running computations that are the same sort of raw, the same level of computation, so to speak."}, {"time": 3808, "text": "So that's kind of the idea there."}, {"time": 3808, "text": "And the question, I mean, it's like the, you know, in the science fiction version would be, okay, somebody says, we just need more servers, get us more servers."}, {"time": 3821, "text": "The way to get even more servers is turn the whole planet into a bunch of microservers."}, {"time": 3826, "text": "And that's where it starts."}, {"time": 3826, "text": "And so the question of, you know, computational equivalence, principle of computational equivalence is, well, actually, you don't need to build those custom servers."}, {"time": 3837, "text": "Actually, you can just use natural computation to compute things, so to speak."}, {"time": 3846, "text": "You can use nature to compute."}, {"time": 3846, "text": "You don't need to have done all that engineering."}, {"time": 3851, "text": "I mean, it kind of feels a little disappointing that you say, we're going to build all these servers."}, {"time": 3856, "text": "We're going to do all these things."}, {"time": 3856, "text": "We're going to make, you know, maybe we're going to have human consciousness uploaded into, you know, some elaborate digital environment."}, {"time": 3865, "text": "And then you look at that thing and you say, it's got electrons moving around, just like in a rock."}, {"time": 3869, "text": "And then you say, well, what's the difference?"}, {"time": 3869, "text": "And the principle of computational equivalence says there isn't, at some level, a fundamental, you know, you can't say, mathematically, there's a fundamental difference between the rock that is the future of human consciousness and the rock that's just a rock."}, {"time": 3885, "text": "Now, what I've sort of realized with this kind of consciousness thing is there is an aspect of this that seems to be more special."}, {"time": 3891, "text": "And for example, something I haven't really teased apart properly is when it comes to something like the weather and the weather having a mind of its own or whatever, or your average, you know, pulsar magnetosphere acting like a sort of intelligent thing, how does that relate to, you know, how is that entity related to the kind of consciousness that we have?"}, {"time": 3913, "text": "And sort of, what would the world look like, you know, to the weather?"}, {"time": 3921, "text": "If we think about the weather as a mind, what will it perceive?"}, {"time": 3926, "text": "What will its laws of physics be?"}, {"time": 3931, "text": "Because it's very parallel."}, {"time": 3933, "text": "It's very parallel, among other things."}, {"time": 3933, "text": "And it's not obvious."}, {"time": 3933, "text": "I mean, this is a really kind of mindbending thing because we've got to try and imagine a parsing of the universe different from the one we have."}, {"time": 3946, "text": "And by the way, when we think about extraterrestrial intelligence and so on, I think that's kind of the key thing is, you know, we've always assumed, I've always assumed, okay, the extraterrestrials, at least they have the same physics."}, {"time": 3957, "text": "We all live in the same universe."}, {"time": 3961, "text": "They've got the same physics."}, {"time": 3961, "text": "But actually, that's not really right because the extraterrestrials could have a completely different way of parsing the universe."}, {"time": 3967, "text": "So it's as if, you know, there could be for all we know, right here in this room, you know, in the details of the motion of these gas molecules, there could be an amazing intelligence that we were like, but we have no way of, we're not parsing the universe in the same way."}, {"time": 3984, "text": "If only we could parse the universe in the right way, you know, immediately this amazing thing that's going on and this, you know, huge culture that's developed and all that kind of thing would be obvious to us, but it's not because we have our particular way of parsing the universe."}, {"time": 3998, "text": "Would that thing also have an agency?"}, {"time": 3998, "text": "I don't know the right word to use, but something like consciousness, but a different kind of consciousness?"}, {"time": 4007, "text": "I think it's a question of just what you mean by the word, because I think that the, you know, this notion of consciousness and the, okay, so some people think of consciousness as sort of a key aspect of it is that we feel that there's sort of a feeling of that we exist in some way, that we have this intrinsic feeling about ourselves."}, {"time": 4023, "text": "You know, I suspect that any of these things would also have an intrinsic feeling about themselves."}, {"time": 4031, "text": "I've been sort of trying to think recently about constructing an experiment about what if you were just a piece of a cellular automaton, let's say, you know, what would your feeling about yourself actually be?"}, {"time": 4045, "text": "And, you know, can we put ourselves in the shoes, in the cells of the cellular automaton, so to speak?"}, {"time": 4050, "text": "Can we get ourselves close enough to that, that we could have a sense of what the world would be like if you were operating in that way?"}, {"time": 4056, "text": "And it's a little difficult because, you know, you have to not only think about what are you perceiving, but also what's actually going on in your brain."}, {"time": 4066, "text": "And our brains do what they actually do."}, {"time": 4066, "text": "And they don't, it's, you know, I think there might be some experiments that are possible with neural nets and so on, where you can have something where you can at least see in detail what's happening inside the system."}, {"time": 4082, "text": "And one of my projects to think about is, is there a way of kind of getting a sense kind of from inside the system about what its view of the world is and how it, you know, can we make a bridge?"}, {"time": 4096, "text": "See, the main issue is this."}, {"time": 4096, "text": "It's a sort of philosophically difficult thing because it's like we do what we do."}, {"time": 4103, "text": "We understand ourselves, at least to some extent."}, {"time": 4109, "text": "We humans understand ourselves."}, {"time": 4110, "text": "But yet, okay, so what are we trying to do, for example, when we are trying to make a model of physics?"}, {"time": 4115, "text": "What are we actually trying to do?"}, {"time": 4115, "text": "Because, you know, you say, well, can we work out what the universe does?"}, {"time": 4120, "text": "Well, of course we can."}, {"time": 4120, "text": "We just watch the universe."}, {"time": 4120, "text": "The universe does what it does."}, {"time": 4124, "text": "But what we're trying to do when we make a model of physics is we're trying to get to the point where we can tell a story to ourselves that we understand that is also a representation of what the universe does."}, {"time": 4134, "text": "So it's this kind of, you know, can we make a bridge between what we humans can understand in our minds and what the universe does?"}, {"time": 4139, "text": "And in a sense, you know, a large part of my kind of life efforts have been devoted to making computational language, which kind of is a bridge between what is possible in the computational universe and what we humans can conceptualize and think about."}, {"time": 4156, "text": "In a sense, when I built Wolfram Language and our whole sort of computational language story, it's all about how do you take sort of raw computation and this ocean of computational possibility and how do we sort of represent pieces of it in a way that we humans can understand and that map onto things that we care about doing."}, {"time": 4179, "text": "And in a sense, when you add physics, you're adding this other piece where we can, you know, mediated by computer, can we get physics to the point where we humans can understand something about what's happening in it?"}, {"time": 4190, "text": "And when we talk about an alien intelligence, it's kind of the same story."}, {"time": 4195, "text": "It's like, is there a way of mapping what's happening there onto something that we humans can understand?"}, {"time": 4200, "text": "And, you know, physics in some sense is like our exhibit one of the story of alien intelligence."}, {"time": 4208, "text": "It's an alien intelligence in some sense."}, {"time": 4208, "text": "And what we're doing in making a model of physics is mapping that onto something that we understand."}, {"time": 4215, "text": "And I think, you know, a lot of these other things that I've recently been kind of studying, whether it's molecular biology, other kinds of things, which we can talk about a bit, those are other cases where we're in a sense trying to, again, make that bridge between what we humans understand and sort of the natural language of that sort of alien intelligence in some sense."}, {"time": 4239, "text": "When you're talking about, just to backtrack a little bit about cellular automata, being able to, what's it like to be a cellular automata in the way that's equivalent to what is it like to be a conscious human being?"}, {"time": 4258, "text": "How do you approach that?"}, {"time": 4258, "text": "So is it looking at some subset of the cellular automata, asking questions of that subset, like how the world is perceived, how you as that subset, like for that local pocket of computation, what are you able to say about the broader cellular time?"}, {"time": 4273, "text": "And that somehow then can give you a sense of how to step outside of that cellular time."}, {"time": 4281, "text": "Right, but the tricky part is that that little subset, what it's doing is it has a view of itself."}, {"time": 4285, "text": "And the question is, how do you get inside it?"}, {"time": 4293, "text": "It's like when we, with humans, it's like we can't get inside each other's consciousness."}, {"time": 4300, "text": "That doesn't really even make sense."}, {"time": 4300, "text": "It's like there is an experience that somebody is having, but you can perceive things from the outside, but sort of getting inside it, it doesn't quite make sense."}, {"time": 4340, "text": "I have a much better chance to understand what's going on than when I'm just trying to reason about things in a very abstract way."}, {"time": 4344, "text": "Yeah, but there may be a way to map the program to your conscious experience."}, {"time": 4352, "text": "So for example, when you play a video game, you do a first person shooter, you walk around inside this entity."}, {"time": 4357, "text": "It's a very different thing than watching this entity."}, {"time": 4357, "text": "So connect more and more, connect this full conscious experience to the subset of the cellular automata."}, {"time": 4371, "text": "Yeah, it's something like that."}, {"time": 4371, "text": "But the difference in the first person shooter thing is there's still your brain and your memory is still remembering."}, {"time": 4375, "text": "You still have..."}, {"time": 4375, "text": "It's hard to..."}, {"time": 4375, "text": "I mean, again, what one's going to get, one is not going to actually be able to be the cellular automaton."}, {"time": 4388, "text": "One's going to be able to watch what the cellular automaton does."}, {"time": 4388, "text": "But this is the frustrating thing that I'm trying to understand how to think about being it, so to speak."}, {"time": 4398, "text": "So like in virtual reality, there's a concept of immersion, like with anything, with video games, with books, there's a concept of immersion."}, {"time": 4401, "text": "It feels like over time, if the virtual reality experience is well done, and maybe in the future it'll be extremely well done, the immersion leads you to feel like... You mentioned memories."}, {"time": 4413, "text": "You forget that you even ever existed outside that experience."}, {"time": 4420, "text": "It's so immersive."}, {"time": 4420, "text": "I mean, you could argue sort of mathematically that you can never truly become immersed, but maybe you can."}, {"time": 4426, "text": "I mean, why can't you merge with the cellular automata?"}, {"time": 4432, "text": "I mean, aren't you just part of the same fabric?"}, {"time": 4432, "text": "Why can't you just like... Well, that's a good question."}, {"time": 4438, "text": "I mean, so let's imagine the following scenario."}, {"time": 4438, "text": "Let's imagine... Can you return?"}, {"time": 4442, "text": "But then can you return back?"}, {"time": 4442, "text": "Well, yeah, right."}, {"time": 4442, "text": "I mean, it's like, let's imagine you've uploaded, your brain is scanned, you've got every synapse mapped out, you upload everything about you, the brain simulator, you upload the brain simulator, and the brain simulator is basically some glorified cellular automaton."}, {"time": 4458, "text": "And then you say, well, now we've got an answer to what does it feel like to be a cellular automaton?"}, {"time": 4468, "text": "It feels just like it felt to be ordinary you, because they're both computational systems, and they're both operating in the same way."}, {"time": 4474, "text": "But I think there's somehow more to it, because in that sense, when you're just making a brain simulator, we're just saying there's another version of our consciousness."}, {"time": 4486, "text": "The question that we're asking is, if we tease away from our consciousness and get to something that is different, how do we make a bridge to understanding what's going on there?"}, {"time": 4495, "text": "And there's a way of thinking about this."}, {"time": 4495, "text": "Okay, so this is coming on to questions about the existence of the universe and so on."}, {"time": 4500, "text": "But one of the things is there's this notion that we have of ruleal space."}, {"time": 4505, "text": "So we have this idea of this physical space, which is something you can move around in that's associated with the extent of the spatial hypergraph."}, {"time": 4517, "text": "Then there's what we call branchial space, the space of quantum branches."}, {"time": 4522, "text": "So in this thing we call the multiway graph of all of this branching histories, there's this idea of a kind of space where instead of moving around in physical space, you're moving from history to history, so to speak, from one possible history to another possible history."}, {"time": 4536, "text": "And that's kind of a different kind of space that is the space in which quantum mechanics plays out."}, {"time": 4542, "text": "Quantum mechanics, for example, I think we're slowly understanding things like destructive interference in quantum mechanics, that what's happening is branchial space is associated with phase in quantum mechanics."}, {"time": 4553, "text": "And what's happening is the two photons that are supposed to be interfering and destructively interfering are winding up at different ends of branchial space."}, {"time": 4562, "text": "And so us as these poor observers that have branching brains that are trying to conflate together these different threads of history and say, we've really got a consistent story that we're telling here."}, {"time": 4573, "text": "We're really knitting together these threads of history."}, {"time": 4577, "text": "By the time the two photons wound up at opposite ends of branchial space, we just can't knit them together to tell a consistent story."}, {"time": 4582, "text": "So for us, that's sort of the analog of destructive interference."}, {"time": 4586, "text": "And then there's rule space too, which is the space of rules."}, {"time": 4590, "text": "Well, that's another level up."}, {"time": 4590, "text": "So there's the question."}, {"time": 4597, "text": "Actually, I do want to mention one thing because it's something I've realized in recent times and I think it's really, really kind of cool, which is about time dilation and relativity."}, {"time": 4606, "text": "And it kind of helps to understand it's something that kind of helps in understanding what's going on."}, {"time": 4611, "text": "So according to relativity, if you have a clock, it's ticking at a certain rate, you send it in a spacecraft that's going at some significant fraction of the speed of light, to you as an observer at rest, that clock that's in the spacecraft will seem to be ticking much more slowly."}, {"time": 4629, "text": "And so in other words, it's kind of like the twin who goes off to Alpha Centauri and goes very fast will age much less than the twin who's on Earth that is just hanging out where they're hanging out."}, {"time": 4642, "text": "Okay, why does that happen?"}, {"time": 4642, "text": "Okay, so it has to do with what motion is."}, {"time": 4648, "text": "So in our models of physics, what is motion?"}, {"time": 4648, "text": "Well, when you move from somewhere to somewhere, you're having to sort of recreate yourself at a different place in space."}, {"time": 4660, "text": "When you exist at a particular place and you just evolve with time, again, you're updating yourself, you're following these rules to update what happens."}, {"time": 4690, "text": "And so time dilation ends up being, it's really cool, actually, that this is explainable in a way that isn't just imagine the mathematics of relativity."}, {"time": 4696, "text": "But time dilation is a story of the fact that as you kind of are recreating yourself as you move, you are using up some of your computation."}, {"time": 4707, "text": "And so you don't have as much computation left over to actually work out what happens progressively with time."}, {"time": 4713, "text": "So that means that time is running more slowly for you because it is, you're using up your computation, your clock can't tick as quickly, because every tick of the clock is using up some computation, but you already use that computation up on moving at, you know, half the speed of light or something."}, {"time": 4730, "text": "And so that's why time dilation happens."}, {"time": 4735, "text": "And so you can start, so it's kind of interesting that one can sort of get an intuition about something like that, because it has seemed like just a mathematical fact about the mathematics of special relativity and so on."}, {"time": 4745, "text": "Well, for me, it's a little bit confusing what the you in that picture is, because you're using up computation."}, {"time": 4750, "text": "Okay, so we're simply saying the entity is updating itself according to the way that the universe updates itself."}, {"time": 4759, "text": "And the question is, you know, those updates, let's imagine the you as a clock."}, {"time": 4766, "text": "And the clock is, you know, there's all these little updates, the hypergraph and a sequence of updates cause the pendulum to swing back the other way, and then swing back, swinging back and forth."}, {"time": 4777, "text": "And all of those updates are contributing to the motion of, you know, the pendulum going back and forth or the little oscillator moving, whatever it is."}, {"time": 4788, "text": "But then the alternative is that sort of situation one, where the thing is at rest, situation two, where it's kind of moving, what's happening is it is having to recreate itself at every moment, the thing is going to have to do the computations to be able to sort of recreate itself at a different position in space."}, {"time": 4807, "text": "And that's kind of the intuition behind, so it's either going to spend its computation recreating itself at a different position in space, or it's going to spend its computation doing the sort of doing the updating of the, you know, of the ticking of the clock, so to speak."}, {"time": 4824, "text": "So the more updating is doing, the less the ticking of the clock update is doing."}, {"time": 4830, "text": "The more it's having to update because of motion, the less it can update the clock."}, {"time": 4835, "text": "Obviously, there's a sort of mathematical version of it that relates to how it actually works in relativity, but that's kind of, to me, that was sort of exciting to me that it's possible to have a really mechanically explainable story there."}, {"time": 4873, "text": "But the thing about this physical space and physical space, the main sort of big theory is general relativity, the theory of gravity, and that tells you how things move in physical space."}, {"time": 4886, "text": "In branchial space, the big theory is the Feynman path integral, which it turns out tells you essentially how things move in quantum in the space of quantum phases."}, {"time": 4898, "text": "So it's kind of like motion in branchial space."}, {"time": 4898, "text": "And it's kind of a fun thing to start thinking about all these things that we know in physical space, like event horizons and black holes and so on."}, {"time": 4911, "text": "What are the analogous things in branchial space?"}, {"time": 4911, "text": "For example, the speed of light, what's the analog of the speed of light in branchial space?"}, {"time": 4915, "text": "It's the maximum speed of quantum entanglement."}, {"time": 4919, "text": "So the speed of light is a flash bulb goes off here."}, {"time": 4919, "text": "What's the maximum rate at which the effect of that flash bulb is detectable moving away in space?"}, {"time": 4926, "text": "So similarly, in branchial space, something happens."}, {"time": 4933, "text": "And the question is, how far in this branchial space, in the space of quantum states, how far away can that get within a certain period of time?"}, {"time": 4943, "text": "And so there's this notion of a maximum entanglement speed."}, {"time": 4943, "text": "And that might be observable."}, {"time": 4948, "text": "That's the thing we've been sort of poking at, is might there be a way to observe it, even in some atomic physics kind of situation?"}, {"time": 4952, "text": "Because one of the things that's weird in quantum mechanics is when we study quantum mechanics, we mostly study it in terms of small numbers of particles."}, {"time": 4964, "text": "This electron does this, this thing on an ion trap does that and so on."}, {"time": 4969, "text": "But when we deal with large numbers of particles, kind of all bets are off."}, {"time": 4969, "text": "It's kind of too complicated to deal with quantum mechanics."}, {"time": 5005, "text": "And it's like, but wait a minute, in quantum mechanics, nothing ends up in a definite place."}, {"time": 5009, "text": "There's always just some wave function for this to happen."}, {"time": 5012, "text": "How can it be the case that we can draw these reasonable, it just ended up in this place?"}, {"time": 5017, "text": "And you have to kind of say, well, the environment of the molecule effectively made a bunch of measurements on the molecule to keep it kind of classical."}, {"time": 5026, "text": "And that's a story that has to do with this whole thing about measurements have to do with this idea of, can we conclude that something definite happened?"}, {"time": 5032, "text": "Because in quantum mechanics, the intrinsic quantum mechanics, the mathematics of quantum mechanics is all about, they're just these amplitudes for different things to happen."}, {"time": 5042, "text": "Then there's this thing of, and then we make a measurement and we conclude that something definite happened."}, {"time": 5046, "text": "And that has to do with this thing, I think, about sort of moving about knitting together these different threads of history and saying, this is now something where we can definitively say something definite happened."}, {"time": 5060, "text": "In the traditional theory of quantum mechanics, it's just like, after you've done all this amplitude computation, then this big hammer comes down and you do a measurement and it's all over."}, {"time": 5070, "text": "And that's been very confusing."}, {"time": 5070, "text": "For example, in quantum computing, it's been a very confusing thing because when you say, in quantum computing, the basic idea is you're going to use all these separate threads of computation, so to speak, to do all the different parts of, try these different factors for an integer or something like this."}, {"time": 5084, "text": "And it looks like you can do a lot because you've got all these different threads going on."}, {"time": 5088, "text": "But then you have to say, well, at the end of it, you've got all these threads and every thread came up with a definite answer, but we got to conflate those together to figure out a definite thing that we humans can take away from it, a definite, so the computer actually produced this output."}, {"time": 5106, "text": "So having this branchial space and this hypergraph model of physics, do you think it's possible to then make predictions that are definite about many body quantum mechanical systems?"}, {"time": 5121, "text": "I think it's likely, yes."}, {"time": 5121, "text": "Every one of these things, when you go from the underlying theory, which is complicated enough and it's, I mean, the theory at some level is beautifully simple, but as soon as you start actually trying to, it's this whole question about how do you bridge it to things that we humans can talk about, it gets really complicated."}, {"time": 5137, "text": "And this thing about actually getting it to a definite prediction about definite thing you can say about chemistry or something like this, that's just a lot of work."}, {"time": 5150, "text": "There's a thing called the quantum Zeno effect."}, {"time": 5154, "text": "So the idea is quantum stuff happens, but then if you make a measurement, you're kind of freezing time in quantum mechanics."}, {"time": 5161, "text": "So it looks like there's a possibility that with sort of the relationship between the quantum Zeno effect and the way that many body quantum mechanics works and so on, maybe just conceivably, it may be possible to actually figure out a way to measure the maximum entanglement speed."}, {"time": 5178, "text": "And the reason we can potentially do that is because the systems we deal with in terms of atoms and things, they're pretty big."}, {"time": 5183, "text": "A mole of atoms is a lot of atoms, but it's something where to get, when we're dealing with how can you see 10 to the minus 100, so to speak?"}, {"time": 5197, "text": "Well, by the time you've got 10 to the 30th atoms, you're within a little bit closer striking distance of that."}, {"time": 5205, "text": "It's not like, oh, we've just got two atoms and we're trying to see down to 10 to the minus 100 meters or whatever."}, {"time": 5211, "text": "So I don't know how it will work, but this is a potential direction."}, {"time": 5216, "text": "And if you can tell, by the way, if we could measure the maximum entanglement speed, we would know the elementary length."}, {"time": 5222, "text": "These are all related."}, {"time": 5227, "text": "So if we get that one number, we just need one number."}, {"time": 5227, "text": "If we can get that one number, the theory has no parameters anymore."}, {"time": 5233, "text": "And there are other places, well, there's another hope for doing that is in cosmology."}, {"time": 5240, "text": "In this model, one of the features is the universe is not fixed dimensional."}, {"time": 5245, "text": "We think we live in three dimensional space, but this hypergraph doesn't have any particular dimension."}, {"time": 5249, "text": "It can emerge as something which on an approximation, it's as if you say, what's the volume of a sphere in the hypergraph where a sphere is defined as how many nodes do you get to when you go a distance R away from a given point?"}, {"time": 5261, "text": "And you can say, well, if I get to about R cubed nodes, when I go a distance R away in the hypergraph, then I'm living roughly in three dimensional space."}, {"time": 5272, "text": "But you might also get to R to the point 2.92 for some value of R. As R increases, that might be the sort of fit to what happens."}, {"time": 5282, "text": "And so one of the things we suspect is that the very early universe was essentially infinite dimensional, and that as the universe expanded, it became lower dimensional."}, {"time": 5293, "text": "And so one of the things that is another little sort of point where we think there might be a way to actually measure some things is dimension fluctuations in the early universe."}, {"time": 5304, "text": "That is, is there leftover dimension fluctuation of at the time of the cosmic microwave background, 100,000 years or something after the beginning of the universe?"}, {"time": 5310, "text": "Is it still the case that there were pieces of the universe that didn't have dimension three, that had dimension 3.01 or something?"}, {"time": 5319, "text": "And can we tell that?"}, {"time": 5319, "text": "Is that possible to observe fluctuations in dimensions?"}, {"time": 5327, "text": "So the question, which should be an elementary exercise in electrodynamics, except it isn't, is understanding what happens to a photon when it propagates through 3.01 dimensional space."}, {"time": 5339, "text": "So for example, the inverse square law is a consequence of the surface area of a sphere is proportional to R squared."}, {"time": 5345, "text": "But if you're not in three dimensional space, the surface area of sphere is not proportional to R squared."}, {"time": 5353, "text": "It's R to the whatever 2.01 or something."}, {"time": 5359, "text": "And so that means that I think when you kind of try and do optics, you know, a common principle in optics is Huygens principle, which basically says that every piece of a wave front of light is a source of new spherical waves."}, {"time": 5372, "text": "And those spherical waves, if they're different dimensional spherical waves, will have other characteristics."}, {"time": 5380, "text": "And so there will be bizarre optical phenomena which we haven't figured out yet."}, {"time": 5386, "text": "So you're looking for some weird photon trajectories that designate that it's 3.01 dimensional space?"}, {"time": 5393, "text": "That would be an example of, I mean, you know, there are only a certain number of things we can measure about photons."}, {"time": 5405, "text": "You know, we can measure their polarization, we can measure their frequency, we can measure their direction, those kinds of things."}, {"time": 5409, "text": "And, you know, how that all works out."}, {"time": 5415, "text": "And, you know, in the current models of physics, you know, it's been hard to explain how the universe manages to be as uniform as it is."}, {"time": 5421, "text": "And that's led to this inflation idea that, to the great annoyance of my then collaborator, we figured out in like 1979, we had this realization that you could get something like this."}, {"time": 5432, "text": "But it seemed implausible that that's the way the universe worked."}, {"time": 5436, "text": "So we put it in a footnote."}, {"time": 5436, "text": "But in any case, I've never really completely believed it."}, {"time": 5443, "text": "But that's an idea for how to sort of puff out the universe faster than the speed of light, early moments of the universe."}, {"time": 5448, "text": "That's the sort of the inflation idea and that you can somehow explain how the universe manages to be as uniform as it is."}, {"time": 5454, "text": "In our model, this turns out to be much more natural because the universe just starts very connected."}, {"time": 5461, "text": "The hypergraph is not such that the ball that you grow starting from a single point has volume R cubed, it might have volume R to the 500 or R to the infinity."}, {"time": 5472, "text": "And so that means that you sort of naturally get this much higher degree of connectivity and uniformity in the universe."}, {"time": 5479, "text": "And then the question is, this is sort of the mathematical physics challenge, is in the standard theory of the universe, there's the Friedman Robertson Walker universe, which is the kind of standard model where the universe is isotropic and homogeneous."}, {"time": 5493, "text": "And you can then work out the equations of general relativity, and you can figure out how the universe expands."}, {"time": 5498, "text": "We would like to do the same kind of thing, including dimension change."}, {"time": 5502, "text": "This is just difficult mathematical physics."}, {"time": 5502, "text": "I mean, the reason it's difficult is the sort of fundamental reason it's difficult."}, {"time": 5507, "text": "When people invented calculus 300 years ago, calculus was a story of understanding change and change as a function of a variable."}, {"time": 5518, "text": "So people study univariate calculus, they study multivariate calculus, it's one variable, it's two variables, three variables."}, {"time": 5523, "text": "But whoever studied, you know, 2.5 variable calculus, turns out nobody."}, {"time": 5528, "text": "Turns out that what we need to have to understand these fractional dimensional spaces, which don't work like well, they're spaces where the effective dimension is not an integer."}, {"time": 5543, "text": "So you can't apply the tools of calculus naturally and easily to fractional dimensions?"}, {"time": 5550, "text": "So somebody has to figure out how to do that."}, {"time": 5550, "text": "Yeah, we're trying to figure this out."}, {"time": 5554, "text": "I mean, it's very connected to very frontier issues in mathematics."}, {"time": 5564, "text": "We're dealing with a scale that's so, so much smaller than our human scale."}, {"time": 5564, "text": "Is it possible to make predictions versus explanations?"}, {"time": 5571, "text": "Do you have a hope that with this hypergraph model, you'd be able to make predictions that then could be validated with a physics experiment, predictions that couldn't have been done or weren't done otherwise?"}, {"time": 5584, "text": "I mean, you know, I think which, in which domain do you think?"}, {"time": 5588, "text": "Okay, so they're going to be cosmology ones to do with dimension fluctuations in the universe."}, {"time": 5592, "text": "That's a very bizarre effect."}, {"time": 5592, "text": "Nobody, you know, dimension fluctuations is just something nobody ever looked for that."}, {"time": 5596, "text": "If anybody sees dimension fluctuation, that's a huge flag that something like our model is going on."}, {"time": 5600, "text": "And how one detects that, you know, that's a problem of kind of, you know, that's a problem of traditional physics in a sense of what's the best way to actually figure that out."}, {"time": 5612, "text": "And for example, that's one, there are all kinds of things one could imagine."}, {"time": 5617, "text": "I mean, there are things that in black hole mergers, it's possible that there will be effects of maximum entanglement speed in large black hole mergers."}, {"time": 5630, "text": "That's another possible thing."}, {"time": 5630, "text": "And all of that is detected through like what?"}, {"time": 5630, "text": "Do you have a hope for LIGO type of situation?"}, {"time": 5635, "text": "Like that's gravitational waves?"}, {"time": 5635, "text": "Or alternatively, I mean, I think it's, you know, look, figuring out experiments is like figuring out technology inventions."}, {"time": 5647, "text": "That is, you know, you've got a set of raw materials, you've got an underlying model, and now you've got to be very clever to figure out, you know, what is that thing I can measure that just somehow, you know, leverages into the right place."}, {"time": 5656, "text": "And we've spent less effort on that than I would have liked."}, {"time": 5663, "text": "Because one of the reasons is that I think that the physicists who've been working on our models, with now lots of physicists actually, it's very, very nice."}, {"time": 5670, "text": "It's kind of, it's one of these cases where I'm almost, I'm really kind of pleasantly surprised that the sort of absorption of the things we've done has been quite rapid and quite sort of, you know, very positive."}, {"time": 5687, "text": "So it's a Cambrian explosion of physicists too, not just ideas."}, {"time": 5714, "text": "And these fields have a bunch of good mathematical physicists in them who've been working for decades in these particular areas."}, {"time": 5724, "text": "And the question is, but they've been building these mathematical structures."}, {"time": 5730, "text": "And the mathematical structures are interesting, but they don't typically sit on anything."}, {"time": 5734, "text": "They're just mathematical structures."}, {"time": 5734, "text": "And I think what's happened is our models provide kind of a machine code that lives underneath those models."}, {"time": 5739, "text": "So a typical example, this is due to Jonathan Gorod, who's one of the key people who's been working on our project."}, {"time": 5746, "text": "This is in, okay, so I'll give you an example just to give a sense of how these things connect."}, {"time": 5752, "text": "This is in causal set theory."}, {"time": 5756, "text": "So the idea of causal set theory is there are, in spacetime, we imagine that there's space and time."}, {"time": 5763, "text": "It's a three plus one dimensional, you know, setup."}, {"time": 5763, "text": "We imagine that there are just events that happen at different times and places in space and time."}, {"time": 5769, "text": "And the idea of causal set theory is the only thing you say about the universe is there are a bunch of events that happen sort of randomly at different places in space and time."}, {"time": 5780, "text": "And then the whole sort of theory of physics has to be to do with this graph of causal relationships between these randomly thrown down events."}, {"time": 5792, "text": "So they've always been confused by the fact that to get even Lorentz invariants, even relativistic invariants, you need a very special way to throw down those events."}, {"time": 5802, "text": "And they've had no natural way to understand how that would happen."}, {"time": 5802, "text": "So what Jonathan figured out is that, in fact, from our models, instead of just generating events at random, our models necessarily generate events in some pattern in spacetime effectively that then leads to Lorentz invariants and relativistic invariants and all those kinds of things."}, {"time": 5822, "text": "So it's a place where all the mathematics that's been done on, well, we just have a random collection of events."}, {"time": 5830, "text": "Now what consequences does that have in terms of causal set theory and so on?"}, {"time": 5830, "text": "That can all be kind of wheeled in now that we have some different underlying foundational idea for what the particular distribution of events is as opposed to just what we throw down random events."}, {"time": 5846, "text": "And so that's a typical sort of example of what we're seeing in all these different areas of kind of how you can take really interesting things that have been done in mathematical physics and connect them."}, {"time": 5856, "text": "And it's really kind of beautiful because the abstract models we have just seem to plug into all these different very interesting, very elegant abstract ideas."}, {"time": 5868, "text": "But we're now giving sort of a reason for that to be the way, a reason for one to care."}, {"time": 5868, "text": "I mean, it's like saying you can think about computation abstractly."}, {"time": 5874, "text": "You can think about, I don't know, combinators or something as abstract computational things."}, {"time": 5881, "text": "And you can sort of do all kinds of study of them."}, {"time": 5886, "text": "But it's like, why do we care?"}, {"time": 5886, "text": "Well, okay, Turing machines are a good start because you can kind of see they're sort of mechanically doing things."}, {"time": 5891, "text": "But when we actually start thinking about computers, computing things, we have a really good reason to care."}, {"time": 5894, "text": "And this is sort of what we're providing, I think, is a reason to care about a lot of these areas of mathematical physics."}, {"time": 5904, "text": "So that's been very nice."}, {"time": 5904, "text": "So I'm not sure we've ever got to the question of why does the universe exist at all?"}, {"time": 5910, "text": "No, no, let's talk about that."}, {"time": 5910, "text": "So it's not the simplest question in the world."}, {"time": 5916, "text": "So it takes a few steps to get to it."}, {"time": 5916, "text": "And it's nevertheless even surprising that you can even begin to answer this question, as you were saying."}, {"time": 5926, "text": "I'm very surprised."}, {"time": 5926, "text": "So the next thing to perhaps understand is this idea of ruleal space."}, {"time": 5935, "text": "So we've got kind of physical space."}, {"time": 5935, "text": "We've got branchial space, the space of possible quantum histories."}, {"time": 5940, "text": "And now we've got another level of kind of abstraction, which is ruleal space."}, {"time": 5940, "text": "And here's where that comes from."}, {"time": 5945, "text": "So you say, okay, you say we've got this model for the universe."}, {"time": 5952, "text": "We've got a particular rule."}, {"time": 5952, "text": "And we run this rule and we get the universe."}, {"time": 5959, "text": "Why that rule?"}, {"time": 5959, "text": "Why not another rule?"}, {"time": 5959, "text": "And so that confused me for a long time."}, {"time": 5959, "text": "And I realized, well, actually, what if the thing could be using all possible rules?"}, {"time": 5965, "text": "What if at every step, in addition to saying apply a particular rule at all places in this hypergraph, one could say, just take all possible rules and apply all possible rules at all possible places in this hypergraph."}, {"time": 5981, "text": "And then you make this ruleal multiway graph, which both is all possible histories for a particular rule and all possible rules."}, {"time": 5988, "text": "So the next thing you'd say is, how can you get anything reasonable out of it?"}, {"time": 5993, "text": "How can anything real come out of the set of all possible rules applied in all possible ways?"}, {"time": 5998, "text": "This is a subtle thing, which I haven't fully untangled."}, {"time": 6005, "text": "There is this object, which is the result of running all possible rules in all possible ways."}, {"time": 6011, "text": "And you might say, if you're running all possible rules, why can't everything possible happen?"}, {"time": 6015, "text": "Well, the answer is because when you, there's sort of this entanglement that occurs."}, {"time": 6021, "text": "So let's say that you have a lot of different possible initial conditions, a lot of different possible states."}, {"time": 6027, "text": "Then you're applying these different rules."}, {"time": 6027, "text": "Well, some of those rules can end up with the same state."}, {"time": 6032, "text": "So it isn't the case that you can just get from anywhere to anywhere."}, {"time": 6037, "text": "There's this whole entangled structure of what can lead to what, and there's a definite structure that's produced."}, {"time": 6042, "text": "I think I'm going to call that definite structure the rulead, the limit of kind of all possible rules being applied in all possible ways."}, {"time": 6048, "text": "And you're saying that structure is finite, so that somehow connects to maybe a similar kind of thing as like causal invariance."}, {"time": 6059, "text": "Well, it happens that the rulead necessarily has causal invariance."}, {"time": 6059, "text": "That's a feature of, that's just a mathematical consequence of essentially using all possible rules plus universal computation gives you the fact that from any diverging paths, the paths will always converge."}, {"time": 6074, "text": "But does that necessarily infer that the rulead is finite?"}, {"time": 6081, "text": "In the end, it's not necessarily finite."}, {"time": 6081, "text": "I mean, just like the history of the universe may not be finite."}, {"time": 6088, "text": "The history of the universe, time may keep going forever."}, {"time": 6088, "text": "You can keep running the computations of the rulead and you'll keep spewing out more and more and more structure."}, {"time": 6092, "text": "It's like time doesn't have to end."}, {"time": 6097, "text": "But the issue is there are three limits that happen in this rulead object."}, {"time": 6105, "text": "One is how long you run the computation for."}, {"time": 6105, "text": "Another is how many different rules you're applying."}, {"time": 6111, "text": "And another is how many different states you start from."}, {"time": 6111, "text": "And the mixture of those three limits."}, {"time": 6116, "text": "I mean, this is just mathematically a horrendous object."}, {"time": 6116, "text": "And what's interesting about this object is the one thing that does seem to be the case about this object is it connects with ideas in higher category theory."}, {"time": 6127, "text": "And in particular, it connects to some of the 20th century's most abstract mathematics done by this chap Grothendieck."}, {"time": 6132, "text": "Grothendieck had a thing called the infinity groupoid, which is closely related to this rulead object."}, {"time": 6138, "text": "Although the details of the relationship, you know, I don't fully understand yet."}, {"time": 6144, "text": "But I think that what's interesting is this thing that is sort of this very limiting object."}, {"time": 6151, "text": "So, okay, so a way to think about this that, again, will take us into another direction, which is the equivalence between physics and mathematics."}, {"time": 6162, "text": "The way that, well, let's see, maybe this is just to give a sense of this kind of groupoid and things like that."}, {"time": 6170, "text": "You can think about, in mathematics, you can think you have certain axioms, they're kind of like atoms, and you, well, actually, let's say, let's talk about mathematics for a second."}, {"time": 6181, "text": "What is it made of, so to speak?"}, {"time": 6181, "text": "Mathematics, there's a bunch of statements, like, for addition, x plus y is equal to y plus x, that's a statement in mathematics."}, {"time": 6193, "text": "Another statement would be, you know, x squared minus one is equal to x plus one, x minus one."}, {"time": 6198, "text": "There are an infinite number of these possible statements of mathematics."}, {"time": 6201, "text": "Well, it's not, I mean, it's not just, I guess, a statement, but with x plus y, it's a rule that you can, I mean, you think of it as a rule."}, {"time": 6209, "text": "It is a rule."}, {"time": 6209, "text": "It's also just a thing that is true in mathematics."}, {"time": 6215, "text": "The statement of truth, okay."}, {"time": 6217, "text": "And what you can imagine is, you imagine just laying out this giant kind of ocean of all statements."}, {"time": 6224, "text": "Well, actually, you first start, okay, this is where this was segueing into a different thing."}, {"time": 6229, "text": "Let me not go in this direction for a second."}, {"time": 6232, "text": "Let's not go to metamathematics just yet."}, {"time": 6234, "text": "Yeah, we'll maybe get to metamathematics, but it's, so let me not, let me explain the groupoid and things later."}, {"time": 6240, "text": "But, so let's come back to the universe, always a good place to be in, so to speak."}, {"time": 6247, "text": "Yeah, so what does the universe have to do with the rule add, the rule of L space, and how that's possibly connected to why the thing exists at all, and why there's just one of them?"}, {"time": 6258, "text": "So here's the point."}, {"time": 6258, "text": "So the thing that had confused me for a long time was, let's say we get the rule for the universe."}, {"time": 6264, "text": "We hold it in our hand."}, {"time": 6264, "text": "We say, this is our universe."}, {"time": 6268, "text": "Then the immediate question is, well, why isn't it another one?"}, {"time": 6268, "text": "And that's kind of the sort of the lesson of Copernicus is, we're not very special."}, {"time": 6273, "text": "So how come we got universe number 312 and not universe quadrillion, quadrillion, quadrillion?"}, {"time": 6279, "text": "And I think the resolution of that is the realization that the universe is running all possible rules."}, {"time": 6292, "text": "So then you say, well, how on earth do we perceive the universe to be running according to a particular rule?"}, {"time": 6298, "text": "How do we perceive definite things happening in the universe?"}, {"time": 6302, "text": "Well, it's the same story."}, {"time": 6302, "text": "It's the observer, there is a reference frame that we are picking in this ruleal space, and that that is what determines our perception of the universe."}, {"time": 6314, "text": "With our particular sensory information and so on, we are parsing the universe in this particular way."}, {"time": 6318, "text": "So here's the way to think about it."}, {"time": 6318, "text": "In physical space, we live in a particular place in the universe."}, {"time": 6324, "text": "And we could live on Alpha Centauri, but we don't."}, {"time": 6329, "text": "We live here."}, {"time": 6329, "text": "And similarly, in ruleal space, we could live in many different places in ruleal space, but we happen to live here."}, {"time": 6336, "text": "And what does it mean to live here?"}, {"time": 6336, "text": "It means we have certain sensory input."}, {"time": 6341, "text": "We have certain ways to parse the universe."}, {"time": 6341, "text": "Those are our interpretation of the universe."}, {"time": 6347, "text": "What would it mean to travel in ruleal space?"}, {"time": 6347, "text": "What it basically means is that we are successively interpreting the universe in different ways."}, {"time": 6356, "text": "So in other words, to be at a different point in ruleal space is to have a different, in a sense, a different interpretation of what's going on in the universe."}, {"time": 6361, "text": "And we can imagine even things like an analog of the speed of light as the maximum speed of translation in ruleal space and so on."}, {"time": 6370, "text": "So wait, what's the interpretation?"}, {"time": 6370, "text": "So ruleal space and we, I'm confused by the we and the interpretation and the universe."}, {"time": 6378, "text": "I thought moving about in ruleal space changes the way the universe is."}, {"time": 6383, "text": "The way we would perceive it."}, {"time": 6383, "text": "So it ultimately has to do with the perception."}, {"time": 6393, "text": "So it doesn't real, ruleal space is not somehow changing, like branching into another universe or something like that."}, {"time": 6401, "text": "No, I mean, the point is that the whole point of this is the rule yard is sort of the encapsulated version of everything that is the universe running according to all possible rules."}, {"time": 6414, "text": "We think of our universe, the observable universe, as a thing."}, {"time": 6420, "text": "So we're a little bit loose with the word universe then, because wouldn't the rule yard potentially encapsulate a very large number, like combinatorially large, maybe infinite set of what we human physicists think of as universes?"}, {"time": 6434, "text": "That's an interesting, interesting parsing of the word universe, right?"}, {"time": 6440, "text": "Because what we're saying is, just as we're at a particular place in physical space, we're at a particular place in ruleal space, at that particular place in ruleal space, our experience of the universe is this."}, {"time": 6450, "text": "Just as if we lived at the center of the galaxy, our universe, our experience of the universe will be different from the one it is, given where we actually live."}, {"time": 6459, "text": "And so what we're saying is, you might say, I mean, in a sense, this rule yard is sort of a super universe, so to speak."}, {"time": 6467, "text": "But it's all entangled together."}, {"time": 6467, "text": "It's not like you can separate out."}, {"time": 6472, "text": "You can say, let me, it's like when we take a reference, okay, it's like our experience of the universe is based on where we are in the universe."}, {"time": 6478, "text": "We could imagine moving to somewhere else in the universe, but it's still the same universe."}, {"time": 6485, "text": "So there's not like universes existing in parallel?"}, {"time": 6490, "text": "Because, and the whole point is that if we were able to change our interpretation of what's going on, we could perceive a different reference frame in this rule yard."}, {"time": 6504, "text": "Yeah, but that's not, that's just, yeah, that's the same rule yard."}, {"time": 6504, "text": "That's the same universe."}, {"time": 6511, "text": "You're just moving about."}, {"time": 6511, "text": "These are just coordinates in the universe."}, {"time": 6514, "text": "So the reason that's interesting is, imagine the extraterrestrial intelligence, so the alien intelligence, we should say."}, {"time": 6519, "text": "The alien intelligence might live on Alpha Centauri, but it might also live at a different place in real space."}, {"time": 6528, "text": "It can live right here on Earth."}, {"time": 6528, "text": "It just has a different reference frame that includes a very different perception of the universe."}, {"time": 6532, "text": "And then because that real space is very large, I mean, Do we get to communicate with them?"}, {"time": 6544, "text": "Yeah, but it's also, well, one thing is how different the perception of the universe could be."}, {"time": 6553, "text": "I think it could be bizarrely, unimaginably completely different."}, {"time": 6553, "text": "And I mean, one thing to realize is, even in kind of things I don't understand well, you know, I know about the kind of Western tradition of understanding, you know, science and all that kind of thing."}, {"time": 6565, "text": "And, you know, you talk to people who say, well, I, you know, I'm really into some, you know, Eastern tradition of this, that and the other."}, {"time": 6576, "text": "And it's really obvious to me how things work."}, {"time": 6576, "text": "I don't understand it at all."}, {"time": 6581, "text": "But, you know, it is not obvious, I think, with this kind of realization that there's these very different ways to interpret what's going on in the universe."}, {"time": 6587, "text": "That kind of gives me at least, it doesn't help me to understand that different interpretation."}, {"time": 6592, "text": "But it gives me at least more respect for the possibility that there will be other interpretations."}, {"time": 6599, "text": "Yeah, it humbles you to the possibility that like, what is it, reincarnation or all these like eternal recurrence with Nietzsche, like just these ideas?"}, {"time": 6612, "text": "Well, you know, the thing that I realized about a bunch of those things is that, you know, I've been sort of doing my little survey of the history of philosophy, just trying to understand, you know, what can I actually say now about some of these things?"}, {"time": 6620, "text": "And you realize that some of these concepts like the immortal soul concept, which, you know, I remember when I was a kid, and, you know, it was kind of a lots of religion bashing type stuff of people saying, you know, well, we know about physics, tell us how much does a soul weigh?"}, {"time": 6635, "text": "And people are like, well, how can it be a thing if it doesn't weigh anything?"}, {"time": 6641, "text": "Well, now we understand, you know, there is this notion of what's in brains that isn't the matter of brains, and it's something computational."}, {"time": 6650, "text": "And there is a sense and in fact, it is correct, that it is in some sense, immortal, because this pattern of computation is something abstract that is not specific to the particular material of a brain."}, {"time": 6661, "text": "Now, we don't know how to extract it, you know, in our traditional scientific approach."}, {"time": 6667, "text": "But it's still something where it isn't a crazy thing to say there is something doesn't weigh anything."}, {"time": 6673, "text": "That's a kind of a silly question."}, {"time": 6673, "text": "How much does it weigh?"}, {"time": 6673, "text": "Well, actually, maybe it isn't such a silly question in our model of physics, because the actual computational activity has has a consequence for gravity and things, but that's a very subtle."}, {"time": 6687, "text": "You can talk about mass and energy and so on."}, {"time": 6687, "text": "That could be a, what would you call it, a solitron."}, {"time": 6696, "text": "A particle that somehow contains soulness."}, {"time": 6699, "text": "Well, that's what, by the way, that's what Leibniz said."}, {"time": 6699, "text": "And, you know, one thing I've never understood this, you know, Leibniz had this idea of monads and monadology, and he had this idea that what exists in the universe is this big collection of monads."}, {"time": 6713, "text": "And that they that the only thing that one knows about the monads is sort of how they relate to each other."}, {"time": 6717, "text": "It sounds awfully like hypergraphs, right?"}, {"time": 6717, "text": "But Leibniz had really lost me at the following thing."}, {"time": 6722, "text": "He said, each of these monads has a soul, and each of them has a consciousness."}, {"time": 6729, "text": "And it's like, okay, I'm out of here."}, {"time": 6729, "text": "I don't understand this at all."}, {"time": 6732, "text": "But I realized recently that in his day, the concept that a thing could do something could spontaneously do something."}, {"time": 6739, "text": "That was his only way of describing that."}, {"time": 6743, "text": "And so what I would now say is, well, there's this abstract rule that runs."}, {"time": 6743, "text": "To Leibniz, that would have been, you know, in 1690 or whatever, that would have been kind of, well, it has a soul, it has a consciousness."}, {"time": 6753, "text": "And so, you know, in a sense, it's like one of these, there's no new idea under the sun, so to speak."}, {"time": 6758, "text": "That's a sort of a version of the same kinds of ideas, but couched in terms that are sort of bizarrely different from the ones that we would use today."}, {"time": 6768, "text": "Would you be able to maybe play devil's advocate on your conception of consciousness that, like the two characteristics of it that is constrained, and there's a single thread of time?"}, {"time": 6779, "text": "Is it possible that Leibniz was onto something that the basic atom, the discrete atom of space has a consciousness?"}, {"time": 6787, "text": "Is that, so these are just words, right?"}, {"time": 6787, "text": "But like, what is there?"}, {"time": 6794, "text": "Is there some sense where consciousness is much more fundamental than you're making it seem?"}, {"time": 6800, "text": "I mean, you know, I think... Can you construct a world in which it is much more fundamental?"}, {"time": 6807, "text": "I think that, okay, so the question would be, is there a way to think about kind of, if we sort of parse the universe down at the level of atoms of space or something, could we say, well, so that's really a question of a different point of view, a different place in real space."}, {"time": 6822, "text": "We're asking the question, could there be a civilization that exists?"}, {"time": 6827, "text": "Could there be sort of conscious entities that exist at the level of atoms of space?"}, {"time": 6834, "text": "And what would that be like?"}, {"time": 6834, "text": "And I think that comes back to this question of, what's it like to be a cellular automaton type thing?"}, {"time": 6838, "text": "I mean, I'm not yet there."}, {"time": 6845, "text": "I mean, I think that this is a... And I know I don't even know yet quite how to think about this in the sense that I was considering, you know, I never write fiction, but I haven't written it since I was like 10 years old."}, {"time": 6857, "text": "And my fiction, I made one attempt, which I sent to some science fiction writer friends of mine, and they told me it was terrible."}, {"time": 6862, "text": "So, but..."}, {"time": 6865, "text": "This is a long time ago?"}, {"time": 6866, "text": "No, this is recently."}, {"time": 6867, "text": "Recently."}, {"time": 6867, "text": "They said it was terrible."}, {"time": 6867, "text": "That'd be interesting to see you write a short story based on what sounds like it's already inspiring short stories or stories by science fiction writers."}, {"time": 6878, "text": "But I think the interesting thing for me is, you know, what is it like to be a whatever?"}, {"time": 6885, "text": "How do you describe that?"}, {"time": 6885, "text": "I mean, that's not a thing that you describe in mathematics, the what is it like to be such and such."}, {"time": 6891, "text": "Well, see, to me, when you say what is it like to be something, it presumes that you're talking about a singular entity."}, {"time": 6895, "text": "So, like, there's some kind of feeling of the entity, the stuff that's inside of it and the stuff that's outside of it."}, {"time": 6912, "text": "And then that's when consciousness starts making sense."}, {"time": 6912, "text": "But then it seems like that could be generalizable."}, {"time": 6920, "text": "If you take some subset of a cellular automata, you could start talking about what does that subset feel."}, {"time": 6926, "text": "But then you can, I think you could just take arbitrary numbers of subsets."}, {"time": 6934, "text": "Like, to me, like, you and I individually are consciousnesses, but you could also say the two of us together is a singular consciousness."}, {"time": 6945, "text": "I'm not so sure about that."}, {"time": 6945, "text": "I think that the single thread of time thing may be pretty important."}, {"time": 6949, "text": "And that as soon as you start saying, there are two different threads of time, there are two different experiences, and then we have to say, how do they relate?"}, {"time": 6959, "text": "How are they sort of entangled with each other?"}, {"time": 6959, "text": "I mean, that may be a different story of a thing that isn't much like, you know, what do the ants, you know, what's it like to be an ant, you know, where there's a sort of more collective view of the world, so to speak?"}, {"time": 6972, "text": "I think that, I mean, this is, you know, I don't really have a good, I mean, you know, my best thought is, you know, can we turn it into a human story?"}, {"time": 6980, "text": "It's like the question of, you know, when we try and understand physics, can we turn that into something which is sort of a human understandable narrative?"}, {"time": 6990, "text": "And now what's it like to be a such and such?"}, {"time": 6990, "text": "You know, maybe the only medium in which we can describe that is something like fiction, where it's kind of like you're telling, you know, the life story in that setting."}, {"time": 7001, "text": "But I'm, this is beyond what I've yet understood how to do."}, {"time": 7008, "text": "Yeah, but it does seem so, like with human consciousness, you know, we're made up of cells and like, there's a bunch of systems that are networked that work together that at this, at the human level, feel like a singular consciousness when you take, and so maybe like an ant colony is just too low level."}, {"time": 7027, "text": "Sorry, an ant is too low level."}, {"time": 7027, "text": "Maybe you have to look at the ant colony."}, {"time": 7034, "text": "There's some level at which it's a conscious being."}, {"time": 7034, "text": "And then if you go to the planetary scale, then maybe that's going too far."}, {"time": 7040, "text": "So there's a nice sweet spot for consciousness."}, {"time": 7046, "text": "No, I agree."}, {"time": 7046, "text": "I think the difficulty is that, you know, okay, so in sort of people who talk about consciousness, one of the terrible things I've realized, because I've now interacted with some of this community, so to speak, some interesting people who do that kind of thinking."}, {"time": 7064, "text": "But, you know, one of the things I was saying to one of the leading people in that area, I was saying, you know, that, you know, it must be kind of frustrating because it's kind of like a poetry story."}, {"time": 7075, "text": "That is many people are writing poems, but few people are reading them."}, {"time": 7075, "text": "So there are always these different, you know, everybody has their own theory of consciousness, and they are very non inter sort of inter discussable."}, {"time": 7084, "text": "And by the way, I mean, you know, my own approach to sort of the question of consciousness, as far as I'm concerned, I'm an applied consciousness operative, so to speak, because I don't really, in a sense, the thing I'm trying to get out of it is how does it help me to understand what's a possible theory of physics?"}, {"time": 7101, "text": "And how does it help me to say, how do I go from this incoherent collection of things happening in the universe to our definite perception and definite laws and so on, and sort of an applied version of consciousness?"}, {"time": 7114, "text": "And I think the reason it sort of segues to a different kind of topic, but the reason that one of the things I'm particularly interested in is kind of what's the analog of consciousness in systems very different from brains?"}, {"time": 7128, "text": "And so why is that matter?"}, {"time": 7128, "text": "Well, you know, this whole description of this kind of, you know what, we haven't talked about why the universe exists."}, {"time": 7134, "text": "So let's get to why the universe exists."}, {"time": 7140, "text": "And then we can talk about perhaps a little bit about what these models of physics kind of show you about other kinds of things like molecular computing and so on."}, {"time": 7153, "text": "Why does the universe exist?"}, {"time": 7153, "text": "Okay, so we finally sort of more or less set the stage, we've got this idea of this rule yard of this object that is made from following all possible rules, the fact that it's sort of not just this incoherent mess, it's got all this entangled structure in it, and so on."}, {"time": 7167, "text": "Okay, so what is this rule yard?"}, {"time": 7167, "text": "Well, it is the working out of all possible formal systems."}, {"time": 7175, "text": "So the sort of the question of why does the universe exist?"}, {"time": 7175, "text": "Its core question, which we kind of started with is, you've got two plus two equals four, you've got some other abstract result, but that's not actualized."}, {"time": 7186, "text": "It's just an abstract thing."}, {"time": 7192, "text": "And when we say we've got a model for the universe, okay, it's this rule, you run it, and it'll make the universe, but it's like, but where's it actually running?"}, {"time": 7196, "text": "What is it actually doing?"}, {"time": 7203, "text": "Is it actual, or is it merely a formal description of something?"}, {"time": 7203, "text": "So the thing to realize with this, the thing about the rule yard is it's an inevitable, it is the entangled running of all possible rules."}, {"time": 7219, "text": "So you don't get to say, it's not like you're saying, which rule yard are you picking?"}, {"time": 7225, "text": "Because it's all possible formal rules."}, {"time": 7225, "text": "It's not like it's just, well, actually, it's only footnote."}, {"time": 7232, "text": "The only footnote, it's an important footnote, is it's all possible computational rules, not hyper computational rules."}, {"time": 7237, "text": "That is, it's running all the rules that would be accessible to a Turing machine, but it is not running all the rules that will be accessible to a thing that can solve problems in finite time that would take a Turing machine infinite time to solve."}, {"time": 7256, "text": "So you can, even Alan Turing knew this, that you could make oracles for Turing machines, where you say a Turing machine can't solve the whole thing problem for Turing machines."}, {"time": 7261, "text": "It can't know what will happen in any Turing machine after an infinite time, in any finite time, but you could invent a box, just make a black box."}, {"time": 7270, "text": "You say, I'm going to sell you an oracle that will just tell you, you know, press this button."}, {"time": 7275, "text": "It'll tell you what the Turing machine will do after an infinite time."}, {"time": 7279, "text": "You can imagine such a box."}, {"time": 7279, "text": "You can't necessarily build one in the physical universe, but you can imagine such a box."}, {"time": 7283, "text": "And so we could say, well, in addition to, so in this Rulliad, we're imagining that there is a computational, that at the end, it's running rules that are computational."}, {"time": 7296, "text": "It doesn't have a bunch of oracle black boxes in it."}, {"time": 7296, "text": "You say, well, why not?"}, {"time": 7302, "text": "Well, it turns out if there are oracle black boxes, the Rulliad that is, you can make a sort of super Rulliad that contains those oracle black boxes, but it has a cosmological event horizon relative to the first one."}, {"time": 7313, "text": "They can't communicate."}, {"time": 7317, "text": "In other words, you can end up with, what ends up happening is it's like in the physical universe, in this causal graph that represents the causal relationships of different things, you can have an event horizon where the causal graph is disconnected, where the effect here, an event happening here does not affect an event happening here because there's a disconnection in the causal graph."}, {"time": 7340, "text": "And that's what happens in an event horizon."}, {"time": 7340, "text": "And so what will happen between this kind of the ordinary Rulliad and the hyper Rulliad is there is an event horizon and we, in our Rulliad, will just never know that they're just separate things."}, {"time": 7354, "text": "They're not connected."}, {"time": 7362, "text": "And maybe I'm not understanding, but just because we can't observe it, why does that mean it doesn't exist?"}, {"time": 7369, "text": "So it might exist, but it's not clear what it..."}, {"time": 7369, "text": "So what, so to speak, whether it exists."}, {"time": 7369, "text": "What we're trying to understand is why does our universe exist?"}, {"time": 7377, "text": "We're not trying to ask the question what... Let me say another thing."}, {"time": 7381, "text": "Let me make a meta comment, which is that I have not thought through this hyper Rulliad business properly."}, {"time": 7390, "text": "So I can't..."}, {"time": 7390, "text": "The hyper Rulliad is referring to a Rulliad in which hyper computation is possible."}, {"time": 7403, "text": "So the footnote to the footnote is we're not sure why this is important."}, {"time": 7413, "text": "So let's ignore that."}, {"time": 7413, "text": "It's already abstract enough."}, {"time": 7419, "text": "So the one question is we have to say, if we're saying, why does the universe exist?"}, {"time": 7426, "text": "One question is why is it this universe and not another universe?"}, {"time": 7426, "text": "So the important point about this Rulliad idea is that in the Rulliad are all possible formal systems."}, {"time": 7432, "text": "So there's no choice being made."}, {"time": 7439, "text": "There's no like, oh, we pick this particular universe and not that one."}, {"time": 7445, "text": "The second thing is that we have to ask the question."}, {"time": 7445, "text": "So you say, why does two plus two equals four exist?"}, {"time": 7452, "text": "That is a thing that necessarily is that way just on the basis of the meaning of the terms, two and plus and equals and so on."}, {"time": 7460, "text": "So the thing is that this Rulliad object is in a sense a necessary object."}, {"time": 7467, "text": "It is just the thing that is the consequence of working out the consequence of the formal definition of things."}, {"time": 7474, "text": "It is not a thing where you're saying, and this is picked as the particular thing."}, {"time": 7480, "text": "This is just something which necessarily is that thing because of the definition of what it means to have computation."}, {"time": 7487, "text": "So the Rulliad, it's a formal system."}, {"time": 7494, "text": "But does it exist?"}, {"time": 7494, "text": "Ah, well, where are we in this whole thing?"}, {"time": 7502, "text": "We are part of this Rulliad."}, {"time": 7502, "text": "So there is no sense to say, does two plus two equals four exist?"}, {"time": 7510, "text": "Well, in some sense, it necessarily exists."}, {"time": 7510, "text": "It's a necessary object."}, {"time": 7510, "text": "It's not a thing that way you can ask."}, {"time": 7519, "text": "Usually in philosophy, there's a sort of distinction made between necessary truths, contingent truths, analytic propositions, synthetic propositions that are a variety of different versions of this."}, {"time": 7532, "text": "They're things which are necessarily true just based on the definition of terms."}, {"time": 7537, "text": "And there are things which happen to be true in our universe."}, {"time": 7542, "text": "But we don't exist in Rullial space."}, {"time": 7542, "text": "That's one of the coordinates that define our existence."}, {"time": 7551, "text": "So yes, yes."}, {"time": 7551, "text": "But this Rulliad is the set of all possible Rullial coordinates."}, {"time": 7558, "text": "So what we're saying is it contains that."}, {"time": 7558, "text": "So what we're saying is we exist as, okay, so our perception of what's going on is we're at a particular place in this Rulliad, and we are concluding certain things about how the universe works based on that."}, {"time": 7573, "text": "But the question is, do we understand, you know, is there something where we say, okay, so why does it work that way?"}, {"time": 7579, "text": "Well, the answer is, I think it has to work that way, because this Rulliad is a necessary object in the sense that it is a purely formal object, just like 2 plus 2 equals 4."}, {"time": 7595, "text": "It's not an object that was made of something."}, {"time": 7595, "text": "It's an object that is just an expression of the necessary collection of formal relations that exist."}, {"time": 7606, "text": "And so then the issue is, can we, in our experience of that, is it, you know, can we have tables and chairs, so to speak, in that just by virtue of our experience of that necessary thing?"}, {"time": 7620, "text": "And, you know, what people have generally thought, and I don't know of a lot of discussion of this, why does the universe exist question?"}, {"time": 7626, "text": "It's been a very, you know, I've been surprised actually at how little, I mean, I think it's one of these things that's really kind of far out there."}, {"time": 7632, "text": "But the thing that is, you know, the surprise here is that all possible formal rules, when you run them together, and that's the critical thing, when you run them together, they produce this kind of entangled structure that has a definite structure."}, {"time": 7650, "text": "It's not just, you know, a random arbitrary thing, it's a thing with definite structure."}, {"time": 7657, "text": "And that structure is the thing when we are embedded in that structure, when anything, you know, an entity embedded in that structure perceives something, which is then we can interpret as physics and things like this."}, {"time": 7668, "text": "So in other words, we don't have to ask the question, the why does it exist?"}, {"time": 7674, "text": "It necessarily exists."}, {"time": 7680, "text": "I'm missing this part."}, {"time": 7680, "text": "Why does it necessarily exist?"}, {"time": 7683, "text": "So like, you need to have it if you want to formalize the relation between entities, but why do you need to have relations?"}, {"time": 7695, "text": "So let's say you say, well..."}, {"time": 7702, "text": "It's like, why does math have to exist?"}, {"time": 7704, "text": "Fair question."}, {"time": 7704, "text": "Okay, fair question."}, {"time": 7704, "text": "I think the thing to think about is the existence of mathematics is something where given a definition of terms, what follows from that definition inevitably follows."}, {"time": 7720, "text": "So now you can say, why define any terms?"}, {"time": 7727, "text": "But in a sense, the, well, that's okay."}, {"time": 7727, "text": "So the definition of terms, I mean, I think the way to think about this, let me see."}, {"time": 7738, "text": "So like concrete terms."}, {"time": 7741, "text": "Well, they're not very concrete."}, {"time": 7741, "text": "I mean, they're just things like, you know, logical or."}, {"time": 7749, "text": "Right, but that's a thing."}, {"time": 7753, "text": "Well, yes, okay."}, {"time": 7753, "text": "But the point is that it is not a thing of a, you know, people imagine there is, I don't know, the, you know, an elephant or something or the, you know, elephants are presumably not necessary objects."}, {"time": 7768, "text": "They happen to exist as a result of kind of biological evolution and whatever else."}, {"time": 7774, "text": "But the thing is that in some sense that there is, it is a different kind of thing to say, does plus exist?"}, {"time": 7783, "text": "It's not like an elephant."}, {"time": 7788, "text": "So a plus seems more fundamental, more basic than an elephant."}, {"time": 7788, "text": "But you can imagine a world without plus or anything like it."}, {"time": 7796, "text": "Like, why do formal things that are discrete, that can be used to reason have to exist?"}, {"time": 7808, "text": "So then the question is, but the whole point is computation."}, {"time": 7814, "text": "We can certainly imagine computation."}, {"time": 7814, "text": "That is, we can certainly say there is a formal system that we can construct abstractly in our minds that is computation."}, {"time": 7821, "text": "And that's the, you know, we can imagine it."}, {"time": 7830, "text": "Now the question is, is it that formal system, once we exist as observers embedded in that formal system, that's enough to have something which is like our universe."}, {"time": 7839, "text": "And so then what you're kind of asking is perhaps is why, I mean, the point is we definitely can imagine it."}, {"time": 7853, "text": "There's nothing that says that we're not saying that it's sort of inevitable that that is a thing that we can imagine."}, {"time": 7862, "text": "We don't have to ask, does it exist?"}, {"time": 7862, "text": "We're just, it is definitely something we can imagine."}, {"time": 7867, "text": "Now that's, then we have this thing that is a formally constructible thing that we can imagine."}, {"time": 7875, "text": "And now we have to ask the question, what, you know, given that formally constructible thing, what is, what consequences does that, if we were to perceive that formally, if we were embedded in that formally constructible thing, what would we perceive about the world?"}, {"time": 7893, "text": "And we would say, we perceive that the world exists because we are seeing all of this mechanism of all these things happening."}, {"time": 7900, "text": "And, but that's something that is just a feature of, it's something where we are... See, another way of asking this that I'm trying to get at, I understand why it feels like this ruley ad is necessary, but maybe it's just me being human, but it feels like then you should be able to, not us, but somehow step outside of the ruley ad."}, {"time": 7924, "text": "Like what's outside the ruley ad?"}, {"time": 7931, "text": "Well, the ruley ad is all formal systems."}, {"time": 7931, "text": "So there's nothing because..."}, {"time": 7931, "text": "But that's what a human would say."}, {"time": 7937, "text": "I know that's what a human would say, because we're used to the idea that there are, there's, but the whole point is that by the time it's all possible formal systems, it's, it's like, it is all things you can imagine, but... All computations you can imagine, but like we don't... Well, so the issue is, can we encode?"}, {"time": 7956, "text": "So that's a fair question."}, {"time": 7956, "text": "Is it possible to encode all, I mean, once we, is there something that isn't what we can represent formally?"}, {"time": 8010, "text": "You can make a world that deals with all possible rules, and then merely by virtue of living in a particular place in that world, so to speak, we have the perception we have of what the world is like."}, {"time": 8073, "text": "Having written quite a few articles yourself, you're now missing some of the pieces."}, {"time": 8079, "text": "That's the limitation of being human."}, {"time": 8080, "text": "One of the consequences of this, why the universe exists thing, is that you're missing something, and this kind of concept of rule adds and, you know, places in there representing our perception of the universe and so on."}, {"time": 8093, "text": "One of the weird consequences is, if the universe exists, mathematics must also exist."}, {"time": 8099, "text": "And that's a weird thing, because mathematics, people have been very confused, including me, have been very confused about the question of kind of what, what is the definition of mathematics?"}, {"time": 8114, "text": "What is, what kind of a thing is mathematics?"}, {"time": 8114, "text": "Is mathematics something where we just write down axioms like Euclid did for geometry, and we just build the structure, and we could have written down different axioms, and we'd have a different structure?"}, {"time": 8125, "text": "Or is it something that has a more fundamental sort of truth to it?"}, {"time": 8128, "text": "And I have to say, this is one of these cases where I've long believed that mathematics has a great deal of arbitrariness to it, that there are particular axioms that kind of got written down by the Babylonians, and, you know, that's what we've ended up with the mathematics that we have."}, {"time": 8143, "text": "And I have to say, actually, my wife has been telling me for 25 years, she was a mathematician, she's been telling me, you're wrong about the foundations of mathematics."}, {"time": 8151, "text": "And, you know, I'm like, no, no, no, I know what I'm talking about."}, {"time": 8157, "text": "And finally, she's much more right than I've been."}, {"time": 8157, "text": "So it's one of the..."}, {"time": 8164, "text": "So, I mean, her sense and your sense, are we just, so this is to the question of metamathematics, just kind of on a trajectory through ruleal space, except in mathematics, through a trajectory of a certain kind of..."}, {"time": 8178, "text": "I think that's partly the idea."}, {"time": 8178, "text": "So I think that the notion is this."}, {"time": 8178, "text": "So 100 years ago, a little bit more than 100 years ago, people have been doing mathematics for ages, but then in the late 1800s, people decided to try and formalize mathematics and say, you know, it is mathematics is, you know, we're going to break it down, we're going to make it like logic, make it out of sort of fundamental primitives."}, {"time": 8198, "text": "And that was people like Frager and Piano and Hilbert and so on."}, {"time": 8203, "text": "And they kind of got this idea of let's do kind of Euclid, but even better, let's just make everything just in terms of this sort of symbolic axioms, and then build up mathematics from that."}, {"time": 8214, "text": "And that, you know, they thought at the time, as soon as they get these symbolic axioms, that they made the same mistake, the kind of computational irreducibility mistake."}, {"time": 8225, "text": "They thought as soon as we've written down the axioms, then we'll just have a machine, kind of a super mathematical, so to speak, that can just grind out all true theorems of mathematics."}, {"time": 8241, "text": "It's that even though you know those underlying rules, you can't deduce all the consequences in any finite way."}, {"time": 8246, "text": "But now the question is, okay, so they broke mathematics down into these axioms, and they say now you build up from that."}, {"time": 8254, "text": "So what I'm increasingly coming to realize is that's similar to saying let's take a gas and break it down into molecules."}, {"time": 8260, "text": "There's gas laws that are the large scale structure and so on that we humans are familiar with, and then there's the underlying molecular dynamics."}, {"time": 8272, "text": "And I think that the axiomatic level of mathematics, which we can access with automated theorem proving and proof assistance and these kinds of things, that's the molecular dynamics of mathematics."}, {"time": 8282, "text": "And occasionally we see through to that molecular dynamics."}, {"time": 8287, "text": "We see undecidability, we see other things like this."}, {"time": 8298, "text": "There are proofs of arbitrary length, infinite length proofs that you might need."}, {"time": 8303, "text": "But in practical mathematics, mathematicians don't typically run into this."}, {"time": 8308, "text": "They just happily go along doing their mathematics."}, {"time": 8308, "text": "And I think what's actually happening is that what they're doing is they're looking at this."}, {"time": 8312, "text": "They are essentially observers in metamathematical space, and they are picking a reference frame in metamathematical space, and they are computationally bounded observers in metamathematical space, which is causing them to deduce that the laws of metamathematics and the laws of mathematics, like the laws of fluid mechanics, are much more understandable than this underlying molecular dynamics."}, {"time": 8370, "text": "That's the kind of causal network of mathematics, of what can prove what and so on."}, {"time": 8375, "text": "And you can say at any moment in the history of a mathematician, of a single mathematical consciousness, you are in a single kind of slice of this kind of metamathematical space."}, {"time": 8389, "text": "You know a certain set of mathematical statements."}, {"time": 8394, "text": "You can then deduce with proofs, you can deduce other ones, and so on."}, {"time": 8394, "text": "You're kind of gradually moving through metamathematical space."}, {"time": 8424, "text": "And so what's happening is that if you look at one of these formalized mathematics systems, something like Pythagoras's theorem, it'll take, oh, I don't know, what is it, maybe 10,000 individual little steps to prove Pythagoras's theorem."}, {"time": 8437, "text": "And one of the bizarre things that's sort of an empirical fact that I'm trying to understand a little bit better, if you look at different formalized mathematics systems, they actually have different axioms underneath that they can all prove Pythagoras's theorem."}, {"time": 8454, "text": "And so in other words, it's a little bit like what happens with gases."}, {"time": 8459, "text": "We can have air molecules, we can have water molecules, but they still have fluid dynamics."}, {"time": 8463, "text": "Both of them have fluid dynamics."}, {"time": 8463, "text": "And so similarly, at the level that mathematicians care about mathematics, it's way above the molecular dynamics, so to speak."}, {"time": 8474, "text": "And there are all kinds of weird things."}, {"time": 8474, "text": "Like, for example, one thing I was realizing recently is that the quantum theory of mathematics, that's a very bizarre idea."}, {"time": 8478, "text": "But basically, when you prove what is a proof is you've got one statement in mathematics, you go through other statements, you eventually get to a statement you're trying to prove, for example, that's a path in metamathematical space."}, {"time": 8492, "text": "And that's a single path, a single proof is a single path."}, {"time": 8498, "text": "But you can imagine there are other proofs of the same result."}, {"time": 8498, "text": "There are a bundle of proofs."}, {"time": 8504, "text": "There's this whole set of possible proofs."}, {"time": 8504, "text": "Yeah, you could think of it as branching, similar to the quantum mechanics model that you were talking about."}, {"time": 8508, "text": "And then there's some invariance that you can formalize in the same way that you can for the quantum mechanical."}, {"time": 8516, "text": "So the question is, in proof space, as you start thinking about multiple proofs, are there analogs of, for example, destructive interference of multiple proofs?"}, {"time": 8521, "text": "So here's a bizarre idea that's just a couple of days old, so not yet fully formed."}, {"time": 8525, "text": "But as you try and do that, when you have two different proofs, it's like two photons going in different directions, you have two proofs, which at an intermediate stage are incompatible."}, {"time": 8536, "text": "And that's kind of like destructive interference."}, {"time": 8540, "text": "Is it possible for this to instruct the engineering of automated proof systems?"}, {"time": 8546, "text": "I mean, as a practical matter, I mean, you know, this whole question, in fact, Jonathan Gorod has a nice heuristic for automated theorem provers that's based on our physics project that is looking for essentially using kind of using energy in our models."}, {"time": 8564, "text": "Energy is kind of level of activity in this hypergraph."}, {"time": 8564, "text": "And so it's sort of a heuristic for automated theorem proving about how do you pick which path to go down that is based on essentially physics."}, {"time": 8577, "text": "And I mean, the thing that gets interesting about this is the way that one can sort of have the interplay between, like, for example, a black hole."}, {"time": 8583, "text": "What is a black hole in metamathematics?"}, {"time": 8587, "text": "So the answer is, what is black hole in physics?"}, {"time": 8587, "text": "A black hole in physics is where in the simplest form of black hole time ends."}, {"time": 8592, "text": "That is all, you know, everything is crunched down to the space time singularity, and everything just ends up at that singularity."}, {"time": 8599, "text": "So in our models, and that's a little hard to understand in general relativity with continuous mathematics, and what does singularity look like?"}, {"time": 8609, "text": "In our models, it's something very pragmatic."}, {"time": 8609, "text": "It's just, you're applying these rules, time is moving forward."}, {"time": 8613, "text": "And then there comes a moment where the rules, no rules apply."}, {"time": 8617, "text": "So time stops."}, {"time": 8617, "text": "It's kind of like the universe dies, that, you know, that nothing happens in the universe anymore."}, {"time": 8623, "text": "Well, in mathematics, that's a decidable theory."}, {"time": 8629, "text": "That's a theory."}, {"time": 8629, "text": "So theories which have undecidability, which are things like arithmetic, set theory, all the serious models, theories in mathematics, they all have the feature that there are proofs of arbitrarily long length."}, {"time": 8638, "text": "In something like Boolean algebra, which is a decidable theory, there are, you know, any question in Boolean algebra, you can just go crunch, crunch, crunch, and in a known number of steps, you can answer it."}, {"time": 8647, "text": "You know, satisfiability, you know, might be hard, but it's still a bounded number of steps to answer any satisfiability problem."}, {"time": 8657, "text": "And so that's the notion of a black hole in physics where time stops."}, {"time": 8657, "text": "That's analogous to in mathematics where there aren't infinite length proofs, where when in physics, you know, you can wander around the universe forever if you don't run into a black hole."}, {"time": 8672, "text": "If you run into a black hole and time stops, you're done."}, {"time": 8676, "text": "And it's the same thing in mathematics between decidable theories and undecidable theories."}, {"time": 8681, "text": "That's an example."}, {"time": 8681, "text": "And I think where sort of the attempt to understand, so another question is kind of what is the general activity of metamathematics?"}, {"time": 8694, "text": "What is the bulk theory of metamathematics?"}, {"time": 8694, "text": "So in the literature of mathematics, there are about three million theorems that people have published."}, {"time": 8699, "text": "And those represent, it's kind of on this, it's like on the earth, we would be, you know, we've put cities in particular places on the earth, but yet there is ultimately, you know, we know the earth is roughly spherical, and there's an underlying space."}, {"time": 8715, "text": "And we could just talk about, you know, the world of space in terms of where our cities happen to be, but there's actually an underlying space."}, {"time": 8720, "text": "And so the question is, what's that for metamathematics?"}, {"time": 8724, "text": "And as we kind of explore what is, for example, for mathematics, which is always likes taking sort of abstract limits."}, {"time": 8729, "text": "So an obvious abstract limit for mathematics to take is the limit of the future of mathematics."}, {"time": 8734, "text": "That is, what will be, you know, the ultimate structure of mathematics."}, {"time": 8740, "text": "And one of the things that's an empirical observation about mathematics that's quite interesting is that a lot of theories in one area of mathematics, algebraic geometry or something, might have, they play into another area of mathematics."}, {"time": 8754, "text": "That same kind of fundamental construct seemed to occur in very different areas of mathematics."}, {"time": 8760, "text": "And that's structurally captured a bit with category theory and things like that."}, {"time": 8764, "text": "But I think that there's probably an understanding of this metamathematical space that will explain why different areas of mathematics ultimately sort of map into the same thing."}, {"time": 8775, "text": "And I mean, you know, my little challenge to myself is what's time dilation in metamathematics?"}, {"time": 8781, "text": "In other words, as you basically, as you move around in this mathematical space of possible statements, you know, how does that moving around?"}, {"time": 8787, "text": "It's basically what's happening is that as you move around in the space of mathematical statements, it's like you're changing from algebra to geometry to whatever else."}, {"time": 8796, "text": "And you're trying to prove the same theorem."}, {"time": 8802, "text": "But as you try, if you keep on moving to these different places, it's slower to prove that theorem because you keep on having to translate what you're doing back to where you started from."}, {"time": 8810, "text": "And that's kind of the beginnings of the analog of time dilation in metamathematics."}, {"time": 8814, "text": "Plus, there's probably fractional dimensions in this space as well."}, {"time": 8818, "text": "Oh, this space is a very messy space."}, {"time": 8818, "text": "This space is much messier than physical space."}, {"time": 8818, "text": "I mean, even in the models of physics, physical space is very tame compared to branchial space and ruleal space."}, {"time": 8829, "text": "I mean, the mathematical structure, you know, branchial space is probably more like Hilbert space, but it's a rather complicated Hilbert space."}, {"time": 8834, "text": "And ruleal space is more like this weird infinity groupoid story of Grothendieck."}, {"time": 8840, "text": "And, you know, I can explain that a little bit because in metamathematical space, a path in metamathematical space is a path between two statements is a way to get by proofs, is a way to find a proof that goes from one statement to another."}, {"time": 8859, "text": "And so one of the things you can do, you can think about is between statements, you've got proofs and they are paths between statements."}, {"time": 8865, "text": "Okay, so now you can go to the next level and you can ask, what about a mapping from one proof to another?"}, {"time": 8870, "text": "And so that's in category theory, that's kind of a higher category, the notion of higher categories where you're mapping not just between objects, but you're mapping between the mappings between objects and so on."}, {"time": 8887, "text": "And so you can keep doing that."}, {"time": 8887, "text": "You keep saying higher order proofs."}, {"time": 8887, "text": "I want mappings between proofs between proofs and so on."}, {"time": 8892, "text": "And that limiting structure, oh, by the way, one thing that's very interesting is imagine in proof space, you've got these two proofs."}, {"time": 8897, "text": "And the question is, what is the topology of proof space?"}, {"time": 8902, "text": "In other words, if you take these two paths, can you continuously deform them into each other?"}, {"time": 8906, "text": "Or is there some big hole in the middle that prevents you from continuously deforming them one into the other?"}, {"time": 8911, "text": "It's kind of like, you know, when you think about some, I don't know, some puzzle, for example, you're moving pieces around on some puzzle, and you can think about the space of possible states of the puzzle."}, {"time": 8924, "text": "And you can make this graph that shows from one state of the puzzle to another state of the puzzle and so on."}, {"time": 8927, "text": "And sometimes you can easily get from one state to any other state, but sometimes there'll be a hole in that space."}, {"time": 8932, "text": "And there'll be, you know, you always have to go around the circuitous route to get from here to there."}, {"time": 8936, "text": "There won't be any direct way."}, {"time": 8941, "text": "That's kind of a question of whether there's sort of an obstruction in the space."}, {"time": 8941, "text": "And so the question is in proof space, what is the, what are, you know, what does it mean if there's an obstruction in proof space?"}, {"time": 8954, "text": "Yeah, I don't even know what an obstruction means in proof space because for it to be an obstruction, it should be reachable some other way from some other place, right?"}, {"time": 8959, "text": "So this is like an unreachable part of the graph."}, {"time": 8965, "text": "No, it's not just an unreachable part."}, {"time": 8965, "text": "It's a part where there are paths that go one way, there are paths that go the other way."}, {"time": 8970, "text": "And this question of homotopy in mathematics is this question, can you continuously deform, you know, from one path to another path or do you have to go in a jump, so to speak?"}, {"time": 8979, "text": "So it's like if you're going around a sphere, for example, if you're going around, I don't know, a cylinder or something, you can wind around one way and you can, there's no paths where you can easily deform one path into another because it's just sort of sitting on the same side of the cylinder."}, {"time": 8995, "text": "But when you've got something that winds all the way around a cylinder, you can't continuously deform that down to a point because it's, it's stuck wrapped around."}, {"time": 9003, "text": "My intuition about proof spaces, you should be able to deform it."}, {"time": 9007, "text": "I mean that because then otherwise it doesn't even make sense because if the topology matters of the way you move about the space that I don't even know what that means."}, {"time": 9017, "text": "Well, what it would mean is that you would have one way of doing a proof of something over here in algebra and another way of doing a proof of something over here in geometry."}, {"time": 9022, "text": "And there would not be an intermediate way to map between those proofs."}, {"time": 9027, "text": "How would that be possible if they started the same place and ended the same place?"}, {"time": 9032, "text": "Well, it's the same thing as, you know, we've got points on a, you know, if we've got paths on a cylinder."}, {"time": 9040, "text": "Now I understand how it works in physical space, but it just doesn't, it feels like proof space shouldn't have that."}, {"time": 9044, "text": "I mean, I'm not sure."}, {"time": 9047, "text": "We'll know very soon because we get to do some experiments."}, {"time": 9047, "text": "This is the great thing about this stuff is that in fact, you know, in the next few days, I hope to do a bunch of experiments on this."}, {"time": 9056, "text": "So you're playing like proofs in this kind of space."}, {"time": 9061, "text": "I mean, so, you know, this is toy, you know, theories and, you know, we've got good."}, {"time": 9067, "text": "So this kind of segues to perhaps another thing, which is this whole idea of multi computation."}, {"time": 9073, "text": "So this is another kind of bigger idea that, so, okay, this has to do with how do you make models of things?"}, {"time": 9081, "text": "And it's going to, so I've sort of claimed that there've been sort of four epochs in the history of making models of things."}, {"time": 9088, "text": "And this multi computation thing is the fourth, is a new epoch."}, {"time": 9095, "text": "What are the first three?"}, {"time": 9095, "text": "The first one is back in antiquity, ancient Greek times."}, {"time": 9101, "text": "People were like, what's the universe made of?"}, {"time": 9101, "text": "Oh, it's made of, you know, everything is water, Thales, you know, or everything is made of atoms."}, {"time": 9106, "text": "It's sort of, what are things made of?"}, {"time": 9112, "text": "Or the, you know, there are these crystal spheres that represent where the planets are and so on."}, {"time": 9118, "text": "It's like a structural idea of how the universe is constructed."}, {"time": 9118, "text": "There's no real notion of dynamics."}, {"time": 9123, "text": "It's just, what is the universe?"}, {"time": 9123, "text": "How is the universe made?"}, {"time": 9123, "text": "Then we get to the 1600s and we get to the sort of revolution of mathematics being introduced into physics."}, {"time": 9128, "text": "And then we have this kind of idea of you write down some equation."}, {"time": 9134, "text": "The, what happens in the universe is the solving of that equation."}, {"time": 9141, "text": "Time enters, but it's usually just a parameter."}, {"time": 9141, "text": "We just can, you know, sort of slide it back and forth and say, here's where it is."}, {"time": 9146, "text": "Then we come to this kind of computational idea that I kind of started really pushing in the early 1980s as a result, you know, the things that we were talking about before about complexity, that was my motivation."}, {"time": 9159, "text": "But the bigger story was the story of kind of computational models of things."}, {"time": 9163, "text": "And the big difference there from the mathematical models is, in mathematical models, there's an equation, you solve it, you kind of slide time to the place where you want it."}, {"time": 9172, "text": "In computational models, you give the rule and then you just say, go run the rule."}, {"time": 9178, "text": "And time is not something you get to slide."}, {"time": 9184, "text": "Time is something where it just, you run the rule, time goes in steps."}, {"time": 9184, "text": "And that's how you work out how the system behaves."}, {"time": 9191, "text": "You don't, time is not just a parameter."}, {"time": 9191, "text": "Time is something that is about the running of these rules."}, {"time": 9196, "text": "And so there's this computational irreducibility."}, {"time": 9196, "text": "You can't jump ahead in time."}, {"time": 9201, "text": "But there's still, important thing is there's still one thread of time."}, {"time": 9201, "text": "It's still the case, you know, the cellular automaton state, then it has the next state and the next state and so on."}, {"time": 9211, "text": "The thing that is kind of, we've sort of tipped off by quantum mechanics in a sense, although it actually feeds back even into relativity and things like that, that there's these multiple threads of time."}, {"time": 9221, "text": "And so in this multi computation paradigm, the kind of idea is, instead of there being the single thread of time, there are these kind of distributed asynchronous threads of time that are happening."}, {"time": 9232, "text": "And the thing that's sort of different there is if you want to know what happened, if you say what happened in the system, in the case of the computational paradigm, you just say, well, after a thousand steps, we got this result, right?"}, {"time": 9242, "text": "But in the multi computational paradigm, after a thousand steps, not even clear what a thousand steps means, because you've got all these different threads of time, but there is no state."}, {"time": 9253, "text": "There's all these different possible, you know, there's all these different paths."}, {"time": 9257, "text": "And so the only way you can know what happened is to have some kind of observer who is saying, here's how to parse the results of what was going on."}, {"time": 9267, "text": "But that observer is embedded and they don't have a complete picture."}, {"time": 9271, "text": "So in the case of physics, that's right."}, {"time": 9271, "text": "And then in the, but that's, but so the idea is that in this multi computation setup, that it's this idea of these multiple threads of time and models that are based on that."}, {"time": 9282, "text": "And this is similar to what people think about in non deterministic computation."}, {"time": 9287, "text": "So you have a Turing machine."}, {"time": 9287, "text": "Usually it has a definite state."}, {"time": 9287, "text": "It follows another state, follows another state."}, {"time": 9292, "text": "But typically what people have done when they thought about these kinds of things is they've said, well, there are all these possible paths, and non deterministic Turing machine can follow all these possible paths, but we just want one of them."}, {"time": 9304, "text": "We just want the one that's the winner that factors the number or whatever else."}, {"time": 9304, "text": "And similarly, it's the same story in logic programming and so on, but we say, we've got this goal, find us a path to that goal."}, {"time": 9313, "text": "I just want one path, then I'm happy."}, {"time": 9313, "text": "Or theorem proving, same story."}, {"time": 9318, "text": "I just want one proof and then I'm happy."}, {"time": 9318, "text": "What's happening in multi computation in physics is we actually care about many paths."}, {"time": 9323, "text": "And well, there is a case, for example, probabilistic programming is a version of multi computation in which you're looking at all the paths."}, {"time": 9329, "text": "You're just asking for probabilities of things."}, {"time": 9333, "text": "But in a sense in physics, we're taking different kinds of samplings."}, {"time": 9339, "text": "For example, in quantum mechanics, we're taking a different kind of sampling of all these multiple paths."}, {"time": 9343, "text": "But the thing that is notable is that when you're an observer embedded in this thing, et cetera, et cetera, et cetera, with various other sort of footnotes and so on, it is inevitable that the thing that you parse out of the system looks like general relativity and quantum mechanics."}, {"time": 9362, "text": "In other words, that just by the very structure of this multi computational setup, it inevitably is the case that you have certain emergent laws."}, {"time": 9367, "text": "Now, why is this perhaps not surprising?"}, {"time": 9376, "text": "In thermodynamics and statistical mechanics, there are sort of inevitable emergent laws of sort of gas dynamics that are independent of the details of the molecular dynamics, sort of the same kind of thing."}, {"time": 9388, "text": "But I think what happens is what's a sort of a funny thing that I just been understanding very recently is when when I kind of introduced this whole sort of computational paradigm complexity ish thing back in the 80s, it was kind of like a big downer because it's like there's a lot of stuff you can't say about what systems will do."}, {"time": 9408, "text": "And then what I realized is and then you might say, now we've got multi computation, it's even worse."}, {"time": 9412, "text": "You know, it isn't just one thread of time that we can't explain."}, {"time": 9412, "text": "It's all these threads of time."}, {"time": 9416, "text": "It can't explain anything."}, {"time": 9416, "text": "But the following thing happens because there is all this irreducibility and any detailed thing you might want to answer, it's very hard to answer."}, {"time": 9423, "text": "But when you have an observer who has certain characteristics like computational boundedness, sequentiality of time and so on, that observer only samples certain aspects of this incredible complexity going on in this multi computational system."}, {"time": 9439, "text": "And that observer is sensitive only to to some underlying core structure of this multi computational system."}, {"time": 9445, "text": "There is all this irreducible computation going on, all these details."}, {"time": 9450, "text": "But to that kind of observer, what's important is only the core structure of multi computation, which means that observer observes comparatively simple laws."}, {"time": 9461, "text": "And I think it is inevitable that that observer observes laws which are mathematically structured like general relativity and quantum mechanics, which, by the way, are the same law in our in our model of physics."}, {"time": 9476, "text": "So that's an explanation why there are simple laws that explain a lot for this observer."}, {"time": 9481, "text": "But what the place where this gets really interesting is there are all these fields of science where people have kind of gotten stuck, where they say we'd really love to have a physics like theory of economics."}, {"time": 9492, "text": "We'd really love to have a physics like law and linguistics."}, {"time": 9496, "text": "You got to talk about molecular biology here."}, {"time": 9496, "text": "OK, so where where where does multi computation come in for biology?"}, {"time": 9502, "text": "Economics is super interesting, too, but biology."}, {"time": 9502, "text": "OK, let's talk about that."}, {"time": 9507, "text": "So let's talk about chemistry for a second."}, {"time": 9507, "text": "OK, so I mean, I have to say, you know, this is it's such a weird business for me because, you know, there are these kind of paradigmatic ideas and then the actual applications."}, {"time": 9515, "text": "And it's like I've always said, I know nothing about chemistry."}, {"time": 9519, "text": "I learned all the chemistry I know, you know, the night before some exam when I was 14 years old."}, {"time": 9523, "text": "But I've actually learned a bunch more chemistry."}, {"time": 9527, "text": "And in Wolfram language these days, we have really pretty nice symbolic representation of chemistry."}, {"time": 9531, "text": "And in understanding the design of that, I've actually, I think, learned a certain amount of chemistry."}, {"time": 9535, "text": "So if you quizzed me on sort of basic high school chemistry, I would probably totally fail."}, {"time": 9539, "text": "But but but OK, so what is chemistry?"}, {"time": 9539, "text": "I mean, chemistry is sort of a story of, you know, chemical reactions are like you've got this particular chemical that's represented as some graph of, you know, these are these are this configuration of molecules with these bonds and so on."}, {"time": 9555, "text": "And a chemical reaction happens."}, {"time": 9555, "text": "You've got these sort of two graphs."}, {"time": 9560, "text": "They interact in some way."}, {"time": 9560, "text": "You've got another graph or multiple other graphs out."}, {"time": 9564, "text": "So that's kind of the sort of the the abstract view of what's happening in chemistry."}, {"time": 9570, "text": "And so when you do a chemical synthesis, for example, you are given certain sort of these are possible reactions that can happen."}, {"time": 9576, "text": "And you're asked, can you piece together this sequence of such reactions, a sequence of such sort of axiomatic reactions usually called name reactions in chemistry?"}, {"time": 9585, "text": "Can you piece together a sequence of these reactions so that you get out at the end this great molecule you were trying to synthesize?"}, {"time": 9590, "text": "And so that's a story very much like theorem proving."}, {"time": 9595, "text": "And people have done actually they start in the 1960s looking at kind of the theorem proving approach to that, although it didn't really it didn't it didn't was sort of done too early, I think."}, {"time": 9604, "text": "But anyway, so that's kind of the view is that that chemistry, chemical reactions are the story of of all these different sort of paths of possible things that go on."}, {"time": 9615, "text": "OK, let's let's go to an even lower level."}, {"time": 9615, "text": "Let's say instead of asking about which species of molecules we're talking about, let's look at individual molecules and let's say we're looking at individual molecules and they are having chemical reactions and we're building up this big graph of all these reactions that are happening."}, {"time": 9631, "text": "OK, so so then we've got this big graph."}, {"time": 9636, "text": "And by the way, that big graph is incredibly similar to this hypergraph rewriting things."}, {"time": 9642, "text": "In fact, in the underlying theory of multi computation there, these things we call token event graphs, which are basically you've broken your state into tokens."}, {"time": 9646, "text": "Like in the case of a hypergraph, you've broken it into hyper edges and each event is just consuming some number of tokens and producing some number of tokens."}, {"time": 9658, "text": "But then you have to there's a lot of work to be done on update rules in terms of what they actually are for chemistry."}, {"time": 9662, "text": "Yeah, what they offer are observed chemistry."}, {"time": 9668, "text": "And we've been working on that actually because we have this beautiful system and Wolfram language for representing chemistry symbolically."}, {"time": 9672, "text": "So we actually have you know, this is this is an ongoing thing to actually figure out what they are for some practical cases."}, {"time": 9681, "text": "Does that require human injection or can it be automatically discovered these update rules?"}, {"time": 9687, "text": "Well, if we can do chemistry better, we could probably discover them automatically."}, {"time": 9690, "text": "But I think in, in reality, right now, it's like there are these particular reactions."}, {"time": 9695, "text": "And really, to understand what's going on, we're probably going to pick a particular subtype of chemistry."}, {"time": 9699, "text": "And just because because let me explain where this is going to the place that his his where this is going."}, {"time": 9705, "text": "So got this whole network of all these molecules, having all these reactions and so on."}, {"time": 9710, "text": "And this is some whole multi computational story because each each sort of chemical reaction event is its own separate event."}, {"time": 9716, "text": "We're saying they will happen asynchronously."}, {"time": 9722, "text": "We're not describing in what order they happen."}, {"time": 9722, "text": "You know, maybe that order is governed by some quantum mechanics thing doesn't really matter."}, {"time": 9727, "text": "We're just saying they happen in some order."}, {"time": 9731, "text": "And then we ask, what is the what what's the you know, how do we think about the system?"}, {"time": 9736, "text": "Well, this thing is some kind of big multi computational system."}, {"time": 9736, "text": "The question is what is the chemical observer?"}, {"time": 9741, "text": "And one possible chemical observer is all you care about is did you make that particular drug molecule?"}, {"time": 9747, "text": "You're just asking, you know, the for the one path."}, {"time": 9747, "text": "Another thing you might care about is I want to know the concentration of each species."}, {"time": 9751, "text": "I want to know, you know, at every stage, I'm going to solve the differential equations that represent the concentrations."}, {"time": 9760, "text": "And I want to know what those all are."}, {"time": 9760, "text": "Because when and it's kind of like you're going below and statistical mechanics, there's kind of all these molecules bouncing around."}, {"time": 9771, "text": "And you might say, we're just going to ignore we're just going to look at the aggregate densities of certain kinds of molecules."}, {"time": 9777, "text": "But you can look at a lower level, you can look at this whole graph of possible interactions."}, {"time": 9782, "text": "And so the kind of the idea would be what, you know, is the only chemical observer, one who just cares about overall concentrations?"}, {"time": 9788, "text": "Or can there be a chemical observer who cares about this network of what happened?"}, {"time": 9794, "text": "And so that the question then is, so let me give an analogy."}, {"time": 9800, "text": "So this is where I think this is potentially very relevant to molecular biology and molecular computing."}, {"time": 9805, "text": "When we think about a computation, usually, we say it's input, it's output, we, you know, or chemistry, we say there's this input, we're going to make this molecule as the output."}, {"time": 9816, "text": "But what if what we actually encode, what if our computation, what thing we care about is some part of this dynamic network?"}, {"time": 9822, "text": "What if it isn't just the input and the output that we care about?"}, {"time": 9828, "text": "What if there's some dynamics of the network that we care about?"}, {"time": 9828, "text": "Now, imagine you're a chemical observer, what is a chemical observer?"}, {"time": 9832, "text": "Well, in molecular biology, there are all kinds of weird sorts of observers, there are membranes that exist, that have, you know, different kinds of molecules that can bind to them, things like this, it's not obvious that the from a human scale, we just measure the concentration of something is the relevant story."}, {"time": 9853, "text": "We can imagine that, for example, when we look at this whole network of possible reactions, we can imagine, you know, at a physical level, we can imagine, well, what was the actual momentum direction of that of that molecule?"}, {"time": 9862, "text": "What was it which we don't pay any attention to when we're just talking about chemical concentrations?"}, {"time": 9866, "text": "What was the orientation of that molecule, these kinds of things?"}, {"time": 9871, "text": "And so here's the place where I'm, I have a little suspicion, okay?"}, {"time": 9871, "text": "So one of the questions in biology is what matters in biology?"}, {"time": 9876, "text": "And that is, you know, we have all these chemical reactions, we have all these, all these molecular processes going on in, you know, in biological systems, what matters?"}, {"time": 9886, "text": "And, you know, one of the things is to be able to tell what matters, well, so a big story of the what matters question was what happened in genetics in 1953, when DNA, when it was figured out how DNA worked."}, {"time": 9897, "text": "Because before that time, you know, genetics have been all these different effects and complicated things."}, {"time": 9903, "text": "And then it was realized, ah, there's something new, a molecule can store information, which wasn't obvious before that time, a single molecule can store information."}, {"time": 9912, "text": "So there's a place where there can be something important that's happening in molecular biology, and it's just in the sequence that's storing information in a molecule."}, {"time": 9921, "text": "So the possibility now is imagine this dynamic network, this, you know, causal graphs and multiway causal graphs and so on, that represent all of these different reactions between molecules."}, {"time": 9933, "text": "What if there is some aspect of that, that is storing information that's relevant for molecular biology?"}, {"time": 9939, "text": "And the dynamic aspect of that."}, {"time": 9939, "text": "So that it's similar to how the structure of a DNA molecule stores information, it could be the dynamics of the system somehow stores information."}, {"time": 9950, "text": "And this kind of process might allow you to give predictions of what that would be."}, {"time": 9956, "text": "Well, yes, but also imagine that you're trying to do, for example, imagine you're trying to do molecular computation."}, {"time": 9963, "text": "You might think the way we're going to do molecular computation is we're just going to run the thing."}, {"time": 9968, "text": "We're going to see what came out."}, {"time": 9968, "text": "We're going to see what molecule came out."}, {"time": 9971, "text": "This is saying that's not the only thing you can do."}, {"time": 9971, "text": "There is a different kind of chemical observer that you can imagine constructing, which is somehow sensitive to this dynamic network."}, {"time": 9982, "text": "Exactly how that works, how we make that measurement, I don't know, but a few ideas, but that's what's important, so to speak."}, {"time": 9987, "text": "And that means, and by the way, you can do the same thing even for Turing machines."}, {"time": 9993, "text": "You can say, if you have a multiway Turing machine, you can say, how do you compute with a multiway Turing machine?"}, {"time": 9999, "text": "You can't say, well, we've got this input and this output because the thing has all these threads of time and it's got lots of outputs."}, {"time": 10003, "text": "And so then you say, well, what does it even mean to be a universal multiway Turing machine?"}, {"time": 10008, "text": "I don't fully know the answer to that."}, {"time": 10013, "text": "It would freak Turing out for sure, because then the dynamics of the trajectory of the computation matters."}, {"time": 10019, "text": "I mean, but the thing is that that, so this is again, a story of what's the observer, so to speak."}, {"time": 10025, "text": "In chemistry, what's the observer there?"}, {"time": 10030, "text": "Now to give an example of where that might matter, a very sort of present day example is in immunology, where we have whatever it is, 10 billion different kinds of antibodies that are all these different shapes and so on."}, {"time": 10043, "text": "We have a trillion different kinds of T cell receptors that we produce."}, {"time": 10049, "text": "And the traditional theory of immunology is this clonal selection theory where we are constantly producing, randomly producing all these different antibodies."}, {"time": 10062, "text": "And as soon as one of them binds to an antigen, then that one gets amplified and we produce more of that antibody and so on."}, {"time": 10066, "text": "Back in the 1960s, an immunologist called Nils Joerner, who was the guy who invented monoclonal antibodies, various other things, kind of had this network theory of the immune system where it would be like, well, we produce antibodies, but then we produce antibodies to the antibodies, anti antibodies, and we produce anti anti antibodies."}, {"time": 10084, "text": "And we get this whole dynamic network of interactions between different immune system cells."}, {"time": 10089, "text": "And that was kind of a qualitative theory at that time."}, {"time": 10096, "text": "And I've been a little disappointed because I've been studying immunology a bit recently."}, {"time": 10101, "text": "And I knew something about this like 35 years ago or something."}, {"time": 10101, "text": "And I knew, you know, I'd read a bunch of the books and I talked to a bunch of the people and so on."}, {"time": 10109, "text": "And it was like an emerging theoretical immunology world."}, {"time": 10109, "text": "And then I look at the books now, and they're very thick because they've got, you know, there's just a ton known about immunology and, you know, all these different pathways, all these different details and so on."}, {"time": 10123, "text": "But the theoretical sections seem to have shrunk."}, {"time": 10123, "text": "And so it's so the question is, what, you know, for example, immune memory, where is the where does the immune memory reside?"}, {"time": 10131, "text": "Is it actually some cells sitting in our bone marrow that is, you know, living for the whole of our lives that's going to spring into action as soon as we're shown the same antigen?"}, {"time": 10139, "text": "Or is it something different from that?"}, {"time": 10145, "text": "Is it something more dynamic?"}, {"time": 10145, "text": "Is it something more like some network of interactions between these different kinds of immune system cells and so on?"}, {"time": 10149, "text": "And it's known that there are plenty of interactions between T cells and, you know, there's plenty of dynamics."}, {"time": 10154, "text": "But what the consequence of that dynamics is, is not clear."}, {"time": 10159, "text": "And to have a qualitative theory for that doesn't seem to exist."}, {"time": 10165, "text": "In fact, I was just been trying to study this."}, {"time": 10165, "text": "So I'm quite incomplete in my study of these things."}, {"time": 10170, "text": "But I was a little bit taken aback because I've been looking at these things and it's like, and then they get to the end where they have the most advanced theory that they've got."}, {"time": 10177, "text": "And it turns out it's a cellular automaton theory."}, {"time": 10177, "text": "It's like, okay, well, at least I understand that theory."}, {"time": 10183, "text": "But but, you know, I think that the possibility is that in that this is a place where if you want to know, you know, explain roughly how the immune system works, it ends up being this sort of dynamic network."}, {"time": 10196, "text": "And then the the, you know, the immune consciousness, so to speak, the observer ends up being something that, you know, in the end, it's kind of like, does the human get sick or whatever?"}, {"time": 10206, "text": "But it's a it's something which is a complicated story that relates to this whole sort of dynamic network and so on."}, {"time": 10212, "text": "And I think that's another place where this kind of notion of where I think multi computation has the possibility."}, {"time": 10216, "text": "See, one of the things, okay, you can end up with something where yes, there is a general relativity in there."}, {"time": 10223, "text": "But it turns up, but it may turn out that the observer who sees general relativity in the immune system is an observer that's irrelevant to what we care about about the immune system."}, {"time": 10233, "text": "I mean, it could be yes, there is some effect where, you know, there's some, you know, time dilation of T cells interacting with whatever."}, {"time": 10243, "text": "But it's like, that's an effect that's just irrelevant."}, {"time": 10243, "text": "And the thing we actually care about is things about, you know, what happens when you have a vaccine that goes into some place in shapespace?"}, {"time": 10252, "text": "And, you know, how does that affect other places in shapespace?"}, {"time": 10252, "text": "And how does that spread?"}, {"time": 10257, "text": "You know, what's the what's the analog of the speed of light in shapespace, for example, that's an that's an important issue."}, {"time": 10261, "text": "If you have one of these dynamic theories, it's like, you know, you you're poking to shapespace by having, you know, let's say, a vaccine or something that has a particular configuration in shapespace."}, {"time": 10270, "text": "How, how quickly as this dynamic network spreads out, how quickly do you get sort of other antibodies in different places in shapespace, things like that?"}, {"time": 10282, "text": "When you say shapespace, you mean the shape of the molecules?"}, {"time": 10282, "text": "And then, so this is like, could be deeply connected to the protein and multi protein folding, all of that kind of stuff."}, {"time": 10292, "text": "To be able to say something interesting about the the dance of proteins that Right, exactly."}, {"time": 10296, "text": "then actually has an impact on helping develop drugs, for example, or has an impact on virology, immunology, helping."}, {"time": 10306, "text": "Well, I think the big thing is, you know, when we think about molecular biology, the you know, what, what is the qualitative way to think about it?"}, {"time": 10314, "text": "You know, in other words, is it chemical reaction networks?"}, {"time": 10318, "text": "Is it, you know, genetics, you know, DNA, big, you know, big news, it's kind of there's a digital aspect to the whole thing."}, {"time": 10325, "text": "You know, what is the qualitative way to think about how things work in biology?"}, {"time": 10330, "text": "You know, when we think about, I don't know, some phenomenon like aging or something, which is a big, complicated phenomenon, which just seems to have all these different tentacles."}, {"time": 10338, "text": "Is it really the case that that can be thought about in some, you know, without DNA, when people were describing, you know, genetic phenomena, there were, you know, dominant recessive, this, that and the other got very, very complicated."}, {"time": 10349, "text": "And then people realize, oh, it's just, you know, and what is a gene and so on and so on and so on."}, {"time": 10353, "text": "Then people realize it's just base pairs."}, {"time": 10358, "text": "And there's this digital representation."}, {"time": 10358, "text": "And so the question is, what is the overarching representation that we can now start to think about using a molecular biology?"}, {"time": 10367, "text": "I don't know how this will work out."}, {"time": 10367, "text": "And this is again, one of these things where, and the place where that gets important is, you know, maybe molecular biology is doing molecular computing by using some dynamic process that is something where it is very happily saying, oh, I just got a result."}, {"time": 10383, "text": "It's in the dynamic structure of this network."}, {"time": 10383, "text": "Now I'm going to go and do some other thing based on that result, for example."}, {"time": 10387, "text": "But we're like, oh, I don't know what's going on."}, {"time": 10387, "text": "You know, it's just, we just measured the levels of these chemicals and we couldn't conclude anything."}, {"time": 10397, "text": "But it just, we're looking at the wrong thing."}, {"time": 10397, "text": "And so that's the, that's kind of the potential there."}, {"time": 10402, "text": "And it's, I mean, these things are, I don't know, it's for me, it's like, I've not really, that was not a view."}, {"time": 10410, "text": "I mean, I've thought about molecular computing for ages and ages and ages."}, {"time": 10414, "text": "And I've always imagined that the big story is kind of the original promise of nanotechnology of like, can we make a molecular scale constructor that will just build a molecule in any shape?"}, {"time": 10425, "text": "I don't think I'm now increasingly concluding that's not the big point."}, {"time": 10425, "text": "The big point is something more dynamic."}, {"time": 10430, "text": "That will be an interesting endpoint for any of these things."}, {"time": 10430, "text": "But that's perhaps not the thing, you know, because the one example we have in molecular computing that's really working is us biological organisms."}, {"time": 10440, "text": "And, you know, maybe the thing that's important there is not this, you know, what chemicals do you make, so to speak, but more this kind of dynamic process."}, {"time": 10450, "text": "The dynamic process."}, {"time": 10450, "text": "And then you can have a good model like the hypergraph to then explore what, like simulate again, make predictions."}, {"time": 10455, "text": "And if they, I think just have a way to reason about biology."}, {"time": 10462, "text": "I mean, it's hard, you know, but first of all, biology doesn't have theories like physics."}, {"time": 10468, "text": "You know, physics is a much more successful sort of global theory kind of area."}, {"time": 10474, "text": "You know, biology, what are the global theories of biology?"}, {"time": 10474, "text": "Pretty much Darwinian evolution."}, {"time": 10474, "text": "That's the only global theory of biology."}, {"time": 10479, "text": "You know, are there any other theories just say, well, the kidneys work this way, this thing works this way and so on."}, {"time": 10483, "text": "There isn't, I suppose, another global theory is digital information in DNA."}, {"time": 10487, "text": "That's another sort of global fact about biology."}, {"time": 10492, "text": "But the difficult thing to do is to match something you have a model of in the hypergraph to the actual, like how do you discover the theory?"}, {"time": 10500, "text": "How do you discover the theory?"}, {"time": 10500, "text": "Okay, you have something that looks nice and makes sense, but like you have to match it to validation."}, {"time": 10510, "text": "And that's tricky because you're walking around in the dark."}, {"time": 10515, "text": "Not entirely."}, {"time": 10515, "text": "I mean, so, you know, for example, in what we've been trying to think about is take actual chemical reactions."}, {"time": 10520, "text": "So, you know, one of my goals is can I compute the primes with molecules?"}, {"time": 10526, "text": "If I can do that, then I kind of, maybe I can compute things."}, {"time": 10526, "text": "And, you know, there's this nice automated lab, these guys, these Emerald Cloud Lab people have built with Wolfram language and so on."}, {"time": 10537, "text": "That's an actual physical lab and you send it a piece of Wolfram language code and it goes and, you know, actually does physical experiments."}, {"time": 10542, "text": "And so one of my goals, because I'm not a test tube kind of guy, I'm more of a software kind of person, is can I make something where, you know, in this automated lab, we can actually get it so that there's some gel that we made and, you know, the positions of the stripes are the primes."}, {"time": 10562, "text": "I mean, that would be an example of where, and that would be with a particular, you know, framework for actually doing the molecular computing, you know, with particular kinds of molecules."}, {"time": 10573, "text": "And there's a lot of kind of ambient technological mess, so to speak, associated with, oh, is it carbon?"}, {"time": 10578, "text": "Is it this?"}, {"time": 10578, "text": "You know, is it important that there's a bromine atom here, et cetera, et cetera, et cetera."}, {"time": 10582, "text": "This is all chemistry that I don't know much about."}, {"time": 10586, "text": "And, you know, that's a sort of, you know, unfortunately that's down at the level, you know, I would like to be at the software level, not at the level of the transistors, so to speak."}, {"time": 10596, "text": "But in chemistry, you know, there's a certain amount we have to do, I think, at the level of transistors before we get up to being able to do it."}, {"time": 10600, "text": "Although, you know, the automated labs certainly help in setting that up."}, {"time": 10605, "text": "I talked to a guy named Charles Hoskinson."}, {"time": 10612, "text": "He mentioned that he's collaborating with you."}, {"time": 10612, "text": "He sends me papers on speaking of automated theorem proving a lot."}, {"time": 10618, "text": "He's exceptionally well read on that area as well."}, {"time": 10624, "text": "So what's the nature of your collaboration with him?"}, {"time": 10624, "text": "He's the creator of Cardano."}, {"time": 10628, "text": "What's the nature of the collaboration between Cardano and the whole space of blockchain and Wolfram, Wolfram Alpha, Wolfram blockchain, all that kind of stuff?"}, {"time": 10633, "text": "Well, OK, we're segueing to a slightly different world."}, {"time": 10640, "text": "But so although not completely unconnected."}, {"time": 10640, "text": "The whole thing is somehow connected."}, {"time": 10646, "text": "I mean, you know, the strange thing in my life is I've sort of alternated between doing basic science and doing technology about five times in my life so far."}, {"time": 10656, "text": "And the thing that's just crazy about it is, you know, every time I do one of these alternations, I think there's not going to be a way back to the other thing."}, {"time": 10662, "text": "And like I thought for this physics project, I thought, you know, we're doing fundamental theory of physics."}, {"time": 10666, "text": "Maybe it'll have an application in 200 years."}, {"time": 10670, "text": "But now I've realized actually this multi computation idea is is applicable here now."}, {"time": 10677, "text": "It's and in fact, it's also giving us this way."}, {"time": 10677, "text": "I'll just mention one other thing and then talk about blockchain."}, {"time": 10683, "text": "The the question of actually that relates to several different things."}, {"time": 10691, "text": "But but one of the things about about OK, so our Wolfram language, which is our attempt to kind of represent everything in the world computationally."}, {"time": 10698, "text": "And it's the thing I kind of started building 40 years ago in the form of actual Wolfram language 35 years ago."}, {"time": 10703, "text": "It's kind of this idea of can we can we express things about the world in computational terms?"}, {"time": 10709, "text": "And, you know, we've come a long way in being able to do that."}, {"time": 10717, "text": "Wolfram Alpha is kind of the consumer version of that where you're just using natural language as input."}, {"time": 10722, "text": "The and it turns it into our symbolic language."}, {"time": 10726, "text": "And that's, you know, the symbolic language Wolfram language is what people use and have been using for the last 33 years."}, {"time": 10731, "text": "Actually, Mathematica, which is its first instantiation, will be one third of a century old in in October."}, {"time": 10736, "text": "And that it's it's kind of interesting."}, {"time": 10745, "text": "What do you mean one third of a century?"}, {"time": 10745, "text": "I mean, 33 or 30?"}, {"time": 10745, "text": "What are we?"}, {"time": 10745, "text": "33 and a third."}, {"time": 10749, "text": "So I've never heard of anyone celebrating that anniversary, but I like it."}, {"time": 10757, "text": "A third of a century, though, it's it's kind of get many, many slices of a century that are interesting."}, {"time": 10762, "text": "But but, you know, I think that the the thing that's really striking about that is that means, you know, including the whole sort of technology stack I built around that's about 40 years old."}, {"time": 10770, "text": "And that means it's a significant fraction of the total age of the computer industry."}, {"time": 10774, "text": "And it's I mean, I think it's cool that we can still run, you know, Mathematica version one programs today and so on."}, {"time": 10779, "text": "And we've sort of maintained compatibility."}, {"time": 10784, "text": "And we've been just building this big tower all those years of just more and more and more computational capabilities."}, {"time": 10789, "text": "We just made this this picture of kind of the different kind of threads of of of computational content, of, you know, mathematical content and and, you know, all sorts of things with, you know, data and graphs and whatever else."}, {"time": 10805, "text": "And what you see in this picture is about the first 10 years."}, {"time": 10805, "text": "It's kind of like it's just a few threads."}, {"time": 10810, "text": "And then then about maybe 15, 20 years ago, it kind of explodes in this whole collection, different threads of all these different capabilities that are now part of open language and representing different things in the world."}, {"time": 10820, "text": "But the thing that was super lucky in some sense is it's all based on one idea."}, {"time": 10825, "text": "It's all based on the idea of symbolic expressions and transformation rules for symbolic expressions, which was kind of what I originally put into this SMP system back in 1979 that was a predecessor of the whole open language stack."}, {"time": 10842, "text": "So that idea was an idea that I got from sort of trying to understand mathematical logic and so on."}, {"time": 10848, "text": "It was my attempt to kind of make a general human comprehensible model of computation of just everything is a symbolic expression."}, {"time": 10854, "text": "And all you do is transform symbolic expressions."}, {"time": 10860, "text": "And, you know, in in retrospect, I was very lucky that I understood as little as I understood then, because had I understood more, I would have been completely freaked out about all the different ways that that kind of model can can fail."}, {"time": 10871, "text": "Because what do you do when you have a symbolic expression, you make transformations for symbolic expressions?"}, {"time": 10877, "text": "Well, for example, one question is, there may be many transformations that could be made in a very multi computational kind of way."}, {"time": 10886, "text": "But what we're doing is picking, we're using the first transformation that applies."}, {"time": 10890, "text": "And we keep doing that until we reach a fixed point."}, {"time": 10890, "text": "And that's the result."}, {"time": 10890, "text": "And that's kind of a very, it's kind of a way of sort of sliding around the edge of multi computation."}, {"time": 10902, "text": "And back when I was working on SMP and things, I actually thought about these questions about about how, you know, how, what determines the this kind of evaluation path."}, {"time": 10906, "text": "So for example, you know, you work out Fibonacci, you know, Fibonacci is a recursive thing, f of n is f of n minus one plus f of n minus two, and you get this whole tree of recursion, right?"}, {"time": 10917, "text": "And there's the question of how do you evaluate that tree of recursion?"}, {"time": 10922, "text": "Do you do it sort of depth first, where you go all the way down one side?"}, {"time": 10926, "text": "Do you do it breadth first, where you're kind of collecting the terms together, where you know that, you know, f of eight plus f of seven, f of seven, plus f of six, you can collect the f of sevens, and so on."}, {"time": 10934, "text": "These are, you know, I didn't realize that at the time, it's kind of funny, I was working on on gauge field theories back in 1979."}, {"time": 10945, "text": "And I was also working on the evaluation model in SMP."}, {"time": 10945, "text": "And they're the same problem."}, {"time": 10945, "text": "But it took me 40 more years to realize that."}, {"time": 10951, "text": "And this question about how you do this sort of evaluation front, that's a question of reference frames."}, {"time": 10957, "text": "It's a question of kind of the story of I mean, that that's, that is basically this question of, in what order is the universe evaluated?"}, {"time": 10968, "text": "And that's, and so what you realize is, there's this whole sort of world of different kinds of computation that you can do, sort of multi computationally."}, {"time": 10972, "text": "And that's a, that's an interesting thing."}, {"time": 10977, "text": "It has a lot of implications for distributed computing, and so on."}, {"time": 10977, "text": "It also has a potential implication for blockchain, which we haven't fully worked out, which is, and this is not what we're doing with Cardano, but but this is a different thing."}, {"time": 10986, "text": "The this is something where one of the questions is, when you have, in a sense, blockchain is a deeply sequentialized story of time."}, {"time": 10999, "text": "Because in blockchain, there's just one copy of the ledger."}, {"time": 10999, "text": "And you're saying, this is what happened, you know, time has progressed in this way."}, {"time": 11006, "text": "And there are little things around the edges, as you try and reach consensus and so on."}, {"time": 11009, "text": "And, and, you know, actually, we just recently, we've had this little conference we organized about the theory of distributed consensus, because I realized that a bunch of interesting things that some of our science can tell one about that."}, {"time": 11024, "text": "But that's a different let's let's not go down that that part."}, {"time": 11024, "text": "Yeah, but distributed consensus that still has a sequential there's like, there's still sequentiality."}, {"time": 11031, "text": "So don't tell me you're thinking through like how to apply multi computation to blockchain."}, {"time": 11037, "text": "And so so that becomes a story of, you know, instead of transactions all having to settle in one ledger, it's like a story of all these different ledgers."}, {"time": 11044, "text": "And they all have to have some ultimate consistency, which is what causal invariance would give one, but it can take a while."}, {"time": 11055, "text": "And the it can take a while is kind of like quantum mechanics."}, {"time": 11055, "text": "So it's kind of what's happening is there these different paths of history that correspond to, you know, in one path of history, you got paid this amount in another path of history, you got paid this amount."}, {"time": 11065, "text": "In the end, the universe will always become consistent."}, {"time": 11069, "text": "Now, now the way it will it works is, okay, it's a little bit more complicated than that."}, {"time": 11076, "text": "What happens is, the way space is knitted together in our theory of physics is through all these events."}, {"time": 11080, "text": "And the the idea is that the way that economic space is knitted together is between is there these autonomous events that essentially knit together economic space."}, {"time": 11092, "text": "So there are all these threads of transactions that are happening."}, {"time": 11097, "text": "And the question is, can they be made consistent?"}, {"time": 11097, "text": "Are there is there something forcing them to be sort of a consistent fabric of economic reality?"}, {"time": 11101, "text": "And sort of what this has led me to is trying to realize how does economics fundamentally work?"}, {"time": 11108, "text": "And, you know, what is economics?"}, {"time": 11108, "text": "And, you know, what what are the atoms of economics, so to speak?"}, {"time": 11114, "text": "And so what I've kind of realized is that, that sort of the perhaps I don't even know if this is right yet, there's sort of events in economics, the transactions, there are states of agents that are kind of the atoms of economics."}, {"time": 11125, "text": "And then transactions are kind of agents transact in some transact in some way, and that's an event."}, {"time": 11132, "text": "And then the question is, how do you knit together sort of economic space from that?"}, {"time": 11138, "text": "What is there in economic space?"}, {"time": 11143, "text": "Well, all these transactions, there's a whole complicated collection of possible transactions."}, {"time": 11148, "text": "But one thing that's true about economics is we tend to have the notion of a definite value for things."}, {"time": 11152, "text": "We could imagine that, you know, you buy a cookie from somebody, and they want to get a movie ticket."}, {"time": 11162, "text": "And there is some way that AI bots could make some path from the cookie to the movie ticket by all these different intermediate transactions."}, {"time": 11169, "text": "But in fact, we have an approximation to that, which is we say they each have a dollar value."}, {"time": 11176, "text": "And we have this kind of numeraire concept of there's just a way of kind of taking this whole complicated space of transactions and parsing it in something which is a kind of a simplified thing that is kind of like our parsing of physical space."}, {"time": 11194, "text": "And so my guess is that the yet again, I mean, it's crazy that all these things are so connected."}, {"time": 11201, "text": "This is another multi computation story."}, {"time": 11201, "text": "Another story of where what's happening is that the economic consciousness, the economic observer is not going to deal with all of those are different microscopic transactions."}, {"time": 11214, "text": "They're just going to parse the whole thing by saying, there's this value, it's a number."}, {"time": 11217, "text": "And that's their understanding of their summary of this economic network."}, {"time": 11223, "text": "And there will be all kinds of things like there are all kinds of arbitrage opportunities, which are kind of like the quantum effects in this whole thing."}, {"time": 11227, "text": "And that's in places where there's sort of different paths that can be followed and so on."}, {"time": 11234, "text": "So the question is, can one make a sort of global theory of economics?"}, {"time": 11241, "text": "And then my test case is again, what is time dilation in economics?"}, {"time": 11247, "text": "And I know if you imagine a very agricultural economics where people are growing lettuces and fields and things like this, and you ask questions about, well, if you're transporting lettuces to different places, what is the value of the lettuces after you have to transport them versus if you're just sitting in one place and selling them, you can kind of get a little bit of an analogy there."}, {"time": 11267, "text": "But I think there's a better and more complete analogy."}, {"time": 11271, "text": "And that's the question of, is there a theory like general relativity that is a global theory of economics?"}, {"time": 11276, "text": "And is it about something we care about?"}, {"time": 11276, "text": "It could be that there is a global theory, but it's about a feature of economic reality that isn't important to us."}, {"time": 11285, "text": "Now, another part of the story is, can one use those ideas to make essentially a distributed blockchain, a distributed generalization of blockchain, kind of the quantum analog of money, so to speak, where you have, for example, you can have uncertainty relations where you're saying, you know, well, if I insist on knowing my bank account right now, there'll be some uncertainty."}, {"time": 11307, "text": "If I'm prepared to wait a while, then it'll be much more certain."}, {"time": 11307, "text": "And so there's, you know, is there a way of using and so we've made a bunch of prototypes of this, which I'm not yet happy with."}, {"time": 11319, "text": "But what I realized is, to really understand these prototypes, I actually have to have a foundational theory of economics."}, {"time": 11323, "text": "And so that's kind of a, you know, it may be that we could deploy one of these prototypes as a practical system."}, {"time": 11328, "text": "But I think it's really going to be much better if we actually have an understanding of how this plugs into kind of the economics."}, {"time": 11336, "text": "And that means like a fundamental theory of transactions between entities."}, {"time": 11340, "text": "That's what you mean by economics."}, {"time": 11343, "text": "But I mean, you know, how there emerge sort of laws of economics, I don't even know."}, {"time": 11348, "text": "And I've been asking friends of mine who are economists and things, what is economics?"}, {"time": 11352, "text": "You know, is it an axiomatic theory?"}, {"time": 11352, "text": "Is it a theory that is kind of a qualitative description theory?"}, {"time": 11357, "text": "Is it, you know, what kind of a theory is it?"}, {"time": 11357, "text": "Is it a theory, you know, what kind of thinking?"}, {"time": 11362, "text": "It's like in biology, in evolutionary biology, for example, there's a certain pattern of thinking that goes on in evolutionary biology where if you're a, you know, a good evolutionary biologist, somebody says, that creature has a weird horn."}, {"time": 11376, "text": "And they'll say, well, that's because this and this and this and the selection of this kind and that kind."}, {"time": 11381, "text": "And that's the story."}, {"time": 11381, "text": "And it's not a mathematical story."}, {"time": 11381, "text": "It's a story of a different type of thinking about these things."}, {"time": 11386, "text": "By the way, evolutionary biology is yet another place where it looks like this multi computational idea can be applied."}, {"time": 11392, "text": "And that's where maybe speciation is related to things like event horizons."}, {"time": 11398, "text": "And there's a whole other kind of world of that."}, {"time": 11403, "text": "But it seems like this kind of model can be applicable to so many aspects, like the different levels of understanding of our reality."}, {"time": 11409, "text": "So it could be the biology, the chemistry, at the physics level, the economics."}, {"time": 11415, "text": "And you could potentially, the thing is, it's like, okay, sure, at all these levels, it might rhyme."}, {"time": 11424, "text": "It might make sense as a model."}, {"time": 11424, "text": "The question is, can you make useful predictions as one of these levels?"}, {"time": 11428, "text": "And that's really a question of, you know, it's a weird situation because the situation where the model probably has definite consequences."}, {"time": 11440, "text": "The question is, are they consequences we care about?"}, {"time": 11440, "text": "And that's some, you know, and so in the case of, in the economic case, the, where, so, you know, one thing is this idea of using kind of physics like notions to construct a kind of distributed analog of blockchain."}, {"time": 11462, "text": "The much more pragmatic thing is a different direction."}, {"time": 11467, "text": "And it has to do with this computational language that we built to describe the world that knows about, you know, different kinds of cookies and knows about different cities and knows about how to compute all these kinds of things."}, {"time": 11475, "text": "One of the things that is of interest is if you want to run the world, you need, you know, with contracts and laws and rules and so on, there are rules at a human level and there are kind of things like, and so this gets one into the idea of computational contracts."}, {"time": 11493, "text": "You know, right now when we write a contract, it's a piece of legalese."}, {"time": 11498, "text": "It's, you know, it's just written in English and it's not something that's automatically analyzable, executable, whatever else."}, {"time": 11503, "text": "It's just English."}, {"time": 11503, "text": "You know, back in Gottfried Leibniz, back in, you know, 1680 or whatever was like, I'm going to, you know, figure out how to use logic to decide legal cases and so on."}, {"time": 11517, "text": "And he had kind of this idea of let's make a computational language for the human law."}, {"time": 11522, "text": "Forget about modeling nature, forgot about natural laws."}, {"time": 11522, "text": "What about human law?"}, {"time": 11529, "text": "Can we make kind of a computational representation of that?"}, {"time": 11529, "text": "Well, I think finally we're close to being able to do that."}, {"time": 11534, "text": "And one of the projects that I hope to get to as soon as there's a little bit of slowing down of some of this Cambrian explosion that's happening is a project I've been meaning to really do for a long time, which is what I'm calling a symbolic discourse language."}, {"time": 11549, "text": "It's just finishing the job of being able to represent everything like the conversation we're having in computational terms."}, {"time": 11554, "text": "And one of the use cases for that is computational contracts."}, {"time": 11560, "text": "Another use case is something like the constitution that says what the AIs, what we want the AIs to do."}, {"time": 11565, "text": "So, but this is useful."}, {"time": 11565, "text": "So you're saying, so these are like, you're saying computational contracts, but smart contracts."}, {"time": 11570, "text": "This is what's in the domain of cryptocurrency is known as smart contracts."}, {"time": 11575, "text": "And so the language you've developed, this symbolic or seek to further develop symbolic discourse language enables you to write a contract and write a contract that richly represents some aspect of the world."}, {"time": 11590, "text": "So, I mean, smart contracts tend to be right now mostly about things happening on the blockchain."}, {"time": 11596, "text": "And sometimes they have oracles."}, {"time": 11596, "text": "And in fact, our Wolfman Alpha API is the main thing people use to get information about the real world, so to speak, within smart contracts."}, {"time": 11606, "text": "So Wolfram Alpha, as it stands, is a really good oracle for whoever wants to use it."}, {"time": 11611, "text": "That's perhaps where the relationship with Cardano is."}, {"time": 11614, "text": "Yeah, well, that's how we started getting involved with blockchains."}, {"time": 11614, "text": "As we realized, people were using Wolfram Alpha as the oracle for smart contracts, so to speak."}, {"time": 11617, "text": "And so that got us interested in blockchains in general."}, {"time": 11623, "text": "And what was ended up happening is Wolfram Language is, with its symbolic representation of things, is really very good at representing things like blockchains."}, {"time": 11633, "text": "And so I think we now have, and we don't really know all the comparisons, but we now have a really nice environment within Wolfram Language for dealing with the sort of, for representing what happens in blockchains, for analyzing what happens in blockchains."}, {"time": 11648, "text": "We have a whole effort in blockchain analytics."}, {"time": 11648, "text": "And we've sort of published some samples of how that works."}, {"time": 11655, "text": "But it's because our technology stack, Wolfram Language and Mathematica, are very widely used in the quant finance world."}, {"time": 11660, "text": "There's a sort of immediate coevolution there of the quant finance kind of thing and blockchain analytics."}, {"time": 11669, "text": "So it's kind of the representation of blockchain in computational language."}, {"time": 11675, "text": "Then ultimately, it's kind of like, how do you run the world with code?"}, {"time": 11680, "text": "That is, how do you write sort of all these things which are right now, regulations and laws and contracts and things in computational language?"}, {"time": 11685, "text": "And kind of the ultimate vision is that sort of something happens in the world, and then there's this giant domino effect of all these computational contracts that trigger based on the thing that happened."}, {"time": 11695, "text": "And there's a whole story to that."}, {"time": 11700, "text": "And of course, I like to always pay attention to the latest things that are going on."}, {"time": 11706, "text": "And I really, I kind of like blockchain because it's another rethinking of kind of computation."}, {"time": 11711, "text": "It's kind of like cloud computing was a little bit of that, of sort of persistent kind of computational resources and so on."}, {"time": 11716, "text": "And this multi computation is a big rethinking of kind of what it means to compute."}, {"time": 11723, "text": "Blockchain is another bit of rethinking of what it means to compute."}, {"time": 11728, "text": "The idea that you lodge kind of these autonomous lumps of computation out there in the blockchain world."}, {"time": 11733, "text": "And one of the things that just sort of for fun, so to speak, is we've been doing a bit of stuff with NFTs, and we just did some NFTs on Cardano, and we'll be doing some more."}, {"time": 11744, "text": "And we did some cellular automaton NFTs on Cardano, which people seem to like quite a bit."}, {"time": 11748, "text": "And one of the things I've realized about NFTs is that there's kind of this notion, and we're really working on this, I like recording stuff."}, {"time": 11761, "text": "You know, one of the things that's come out of kind of my science, I suppose, is this history matters type story of, you know, it's not just the current state, it's the history that matters."}, {"time": 11771, "text": "And I've kind of, I don't think this is actually realizing, maybe it's not coincidental that I'm sort of the human who's recorded more about themselves than anybody else."}, {"time": 11777, "text": "And then I end up with these science results that say history matters, which was not those things."}, {"time": 11780, "text": "I didn't think those were connected, but they're at least correlated, yes."}, {"time": 11786, "text": "So, you know, this question about sort of recording what has happened and having sort of a permanent record of things, one of the things that's kind of interesting there is, you know, you put up a website and it's got a bunch of stuff on it, but you know, you have to keep paying the hosting fees or the thing's going to go away."}, {"time": 11803, "text": "But one of the things about blockchain is quite interesting is if you put something on a blockchain and you pay, you know, your commission to get that thing, you know, put on, you know, mine, put on the blockchain, then in a sense, everybody who comes after you is, you know, they are motivated to keep your thing alive because that's what keeps the consistency of the blockchain."}, {"time": 11824, "text": "So in a sense with sort of the NFT world, it's kind of like if you want to have something permanent, well, at least for the life of the blockchain, but even if the blockchain goes out of circulation, so to speak, there's going to be enough value in that whole collection of transactions that people are going to archive the thing."}, {"time": 11838, "text": "But that means that, you know, pay once and you're kind of, you're lodged in the blockchain forever."}, {"time": 11843, "text": "And so we've been kind of playing around with sort of a hobby thing of mine of thinking about sort of the NFTs and how you and sort of the consumer idea of kind of the it's the it's the anti, you know, it's the opposite of the Snapchat view of the world."}, {"time": 11861, "text": "There's a permanence to it that's heavily incentivized and thereby you can have a permanence of history."}, {"time": 11866, "text": "And that's that's that's kind of the now, you know, so that's so that's one of the things we've been doing with Cardano."}, {"time": 11874, "text": "And it's kind of fun."}, {"time": 11879, "text": "I think that I mean, this whole question about, you know, you mentioned automated theorem proving and blockchains and so on."}, {"time": 11883, "text": "And as I've thought about this kind of physics inspired distributed blockchain, obviously, there, the sort of the proof that it works, that there are no double spends, there's no whatever else, that proof becomes a very formal kind of almost a matter of physics, so to speak."}, {"time": 11900, "text": "And, you know, it's been it's been an interesting thing for the for the practical blockchains to do kind of actual automated theorem proving."}, {"time": 11905, "text": "And I don't think anybody's really managed it in an interesting case yet."}, {"time": 11910, "text": "It's a thing that people, you know, aspire to."}, {"time": 11914, "text": "But I think it's a challenging thing because basically, the point is one of the one of the things about proving correctness of something as well."}, {"time": 11919, "text": "You know, people say I've got this program and I'm going to prove it's correct."}, {"time": 11924, "text": "It's like, what does that mean?"}, {"time": 11924, "text": "You have to say what correct means."}, {"time": 11927, "text": "I mean, it's it's kind of like then you have to have another language."}, {"time": 11931, "text": "And people are very confused back in past decades of, you know, oh, we're going to prove the correctness by representing the program in another language, which we also don't know whether it's correct."}, {"time": 11940, "text": "And, you know, often by correctness, we just mean it can't crash or it can't scribble on memory."}, {"time": 11946, "text": "But but the thing is that there's this complicated trade off, because as soon as there's as soon as you're really using computation, you have computational irreducibility, you have undecidability."}, {"time": 11955, "text": "If you want to use computation seriously, you have to kind of let go of the idea that you're going to be able to box it in and say, we're going to have just this happen and not anything else."}, {"time": 11966, "text": "I mean, this is a this is an old fact."}, {"time": 11980, "text": "You can have all these wild, weird things that are obey the piano axioms, but aren't integers."}, {"time": 11986, "text": "And there's this kind of infinite hierarchy of additional axioms you would have to add."}, {"time": 11990, "text": "And it's kind of the same thing."}, {"time": 11990, "text": "You don't get to, you know, if you want to say, I want to know what happens, you're boxing yourself in and there's a limit to what can happen, so to speak."}, {"time": 12000, "text": "So it's a complicated trade off."}, {"time": 12000, "text": "And it's a big trade off for AI, so to speak."}, {"time": 12005, "text": "It's kind of like, do you want to let computation actually do what it can do?"}, {"time": 12009, "text": "Or do you want to say, no, it's very, very boxed in to the point where we can understand every step."}, {"time": 12014, "text": "And that's kind of a thing that becomes difficult to do."}, {"time": 12014, "text": "But that's, I mean, in general, I would say one of the things that's kind of complicated in my sort of life and the whole sort of story of computational language and all this technology and science and so on."}, {"time": 12032, "text": "I mean, I kind of in the flow of one's life, it's sort of interesting to see how these things play out because I've kind of concluded that I'm in the business of making kind of artifacts from the future, which means, you know, there are things that I've done, I don't know, this physics project, I don't know whether anybody would have gotten to it for 50 years."}, {"time": 12048, "text": "You know, the fact that Mathematica is a third of a century old, and I know that a bunch of the core ideas are not well absorbed."}, {"time": 12058, "text": "I mean, that is people finally got this idea that I thought was a triviality of notebooks, that was 25 years."}, {"time": 12062, "text": "And, you know, some of these core ideas about symbolic computation and so on are not absorbed."}, {"time": 12068, "text": "I mean, people use them every day in Wolfram language and, you know, do all kinds of cool things with them."}, {"time": 12075, "text": "But if you say, what is the fundamental intellectual point here?"}, {"time": 12079, "text": "It's not well absorbed."}, {"time": 12079, "text": "And it's something where you kind of realize that you're sort of building things."}, {"time": 12085, "text": "And I kind of made this thing about, you know, we're building artifacts from the future, so to speak."}, {"time": 12090, "text": "And I mentioned that we have a conference coming up actually in a couple of weeks, our annual technology conference, where we talk about all the things we're doing."}, {"time": 12101, "text": "And, you know, so I was talking about it last year, about, you know, we're making artifacts from the future."}, {"time": 12106, "text": "And I was kind of like, I had some version of that, that was kind of a dark and frustrated thing of like, you know, I'm building things which nobody's going to care about until long after I'm dead, so to speak."}, {"time": 12114, "text": "But then I realized, you know, people were sort of telling me afterwards, you know, that's exactly how, you know, we're using Wolfram language in some particular setting and, you know, some computational X field or some organization or whatever."}, {"time": 12130, "text": "And it's like, people are saying, oh, you know, what did you manage to do?"}, {"time": 12130, "text": "You know, well, we know that in principle, it will be possible to do that."}, {"time": 12135, "text": "But we didn't know that was possible now."}, {"time": 12138, "text": "And it's kind of like, that's sort of the business we're in."}, {"time": 12164, "text": "Where does complexity come from?"}, {"time": 12164, "text": "Well, I think we kind of nailed that."}, {"time": 12164, "text": "The answer is in the computational universe, even simple programs make it."}, {"time": 12170, "text": "And that's kind of the secret that nature has that allows you to make it."}, {"time": 12174, "text": "So that's that part."}, {"time": 12174, "text": "But the bigger picture there was this idea of this kind of computational paradigm, the idea that you could go beyond mathematical equations, which have been sort of the primary modeling medium for 300 years."}, {"time": 12186, "text": "And so it was like, look, it is inexorably the case that people will use programs rather than just equations."}, {"time": 12193, "text": "And, you know, I was saying that in the 1980s and people were, you know, I published my big book, New Kind of Science, that'll be 20 years ago next year."}, {"time": 12202, "text": "So in 2002, and people were saying, oh, no, this can't possibly be true."}, {"time": 12208, "text": "You know, we know for 300 years we've been doing all this stuff."}, {"time": 12212, "text": "To be fair, I now realize I'm a little bit more analysis of what people actually said in pretty much every field other than physics."}, {"time": 12218, "text": "People said, oh, these are new models."}, {"time": 12224, "text": "That's pretty interesting."}, {"time": 12224, "text": "In physics, people were like, we've got our physics models."}, {"time": 12224, "text": "We're very happy with them."}, {"time": 12228, "text": "Yeah, in physics, there's more resistance because of the attachment and the power of the equations."}, {"time": 12233, "text": "The idea that programs might be the right way to approach this field."}, {"time": 12239, "text": "Was there some resistance?"}, {"time": 12239, "text": "And like you're saying, it takes time."}, {"time": 12239, "text": "For somebody who likes the idea of time dilation and all these applications, I thought you would understand this."}, {"time": 12249, "text": "But, you know, and computational irreducibility."}, {"time": 12249, "text": "But I mean, it is really interesting that just 20 years, a span of 20 years, it's gone from, you know, pitchforks and horror to, yeah, we get it."}, {"time": 12260, "text": "And, you know, it's helped that we've, you know, in our current effort in fundamental physics, we've gotten a lot further and we've managed to put a lot of puzzle pieces together that make sense."}, {"time": 12273, "text": "But the thing that I've been thinking about recently is this field of complexity."}, {"time": 12277, "text": "So I've kind of was a sort of a field builder."}, {"time": 12283, "text": "Back in the 1980s, I was kind of like, okay, you know, can we, you know, I'd understood this point that there was this sort of fundamental phenomenon of complexity that showed up in lots of places."}, {"time": 12294, "text": "And I was like, this is an interesting sort of field of science."}, {"time": 12294, "text": "And I was recently was reminded, I was at this, the very first sort of get together of what became the Santa Fe Institute."}, {"time": 12301, "text": "And I was like, in fact, there's even an audio recording of me sort of saying, people have been talking about, oh, what should this, you know, outfit do?"}, {"time": 12311, "text": "And I was saying, well, there is this thing that I've been thinking about."}, {"time": 12316, "text": "It's this kind of idea of complexity."}, {"time": 12316, "text": "And it's kind of like, and that's what that ended up."}, {"time": 12321, "text": "And you planted the seed of complexity at Santa Fe."}, {"time": 12325, "text": "But I mean, so that, but what's happened then is this idea of complexity and, you know, and I started the first research center at University of Illinois for doing that in the first journal, complex systems and so on."}, {"time": 12335, "text": "And it's kind of an interesting thing in my life, at least that it's kind of like you plant the seed, you have this idea."}, {"time": 12342, "text": "It's a kind of a science idea."}, {"time": 12347, "text": "You have this idea of sort of focusing on the phenomenon of complexity."}, {"time": 12347, "text": "The deeper idea was this computational paradigm."}, {"time": 12352, "text": "But the nominal idea is this kind of idea of complexity."}, {"time": 12352, "text": "Then you roll time forward 30 years or whatever, 35 years, whatever it is."}, {"time": 12358, "text": "And you say, what happened?"}, {"time": 12365, "text": "Well now there are a thousand complexity institutes around the world."}, {"time": 12365, "text": "I think more or less, we've been trying to count them."}, {"time": 12370, "text": "And, you know, there are 40 complexity journals, I think."}, {"time": 12376, "text": "And so it's kind of like what actually happened in this field, right?"}, {"time": 12376, "text": "And I look at a lot of what happened and I'm like, you know, I have to admit to some eye rolling, so to speak, because it's kind of like, like, what is, what's actually going on?"}, {"time": 12388, "text": "Well, what people definitely got was this idea of computational models."}, {"time": 12393, "text": "And then they got, but they thought one of the, one of the kind of cognitive mistakes, I think is they say, we've got a computational model and it, and we're looking at a system that's complex and our computational model gives complexity."}, {"time": 12409, "text": "By golly, that must mean it's right."}, {"time": 12409, "text": "And unfortunately, because complexity is a generic phenomenon and computational irreducibility is a generic phenomenon that actually tells you nothing."}, {"time": 12421, "text": "And so then the question is, well, what can you do?"}, {"time": 12421, "text": "You know, there's a lot of things that have been sort of done under this banner of complexity."}, {"time": 12426, "text": "And I think it's been very successful in providing sort of an interdisciplinary way of connecting different fields together."}, {"time": 12430, "text": "Which is powerful in itself."}, {"time": 12435, "text": "I mean, that's a very useful."}, {"time": 12435, "text": "Biology and economics and physics."}, {"time": 12435, "text": "It's a good organizing principle, but in the end, a lot of that is around this sort of computational paradigm, computational modeling."}, {"time": 12443, "text": "That's the raw material that powers that kind of, that kind of correspondence, I think."}, {"time": 12448, "text": "But the question is sort of, what is the, you know, I was just thinking recently, you know, we've been, I mean, the other we've been, we've been for years, people have told me you should start some Wolfram Institute that does basic science."}, {"time": 12458, "text": "You know, all I have is a company that, that builds software and we, you know, we have a little piece that does basic science as kind of a hobby."}, {"time": 12467, "text": "People are saying you should start this Wolfram Institute thing."}, {"time": 12472, "text": "And I've been, you know, cause I've known about lots of institutes and I've seen kind of their flow of money and, and kind of, you know, what happens in different situations and so on."}, {"time": 12476, "text": "So I've been kind of reluctant, but, but I've, I've, I have realized that, you know, what we've done with our company over the last 35 years, you know, we built a very good machine for doing R and D and, you know, innovating and creating things."}, {"time": 12490, "text": "And I just applied that machine to the physics project."}, {"time": 12496, "text": "That's how we did the physics project in a fairly short amount of time with a, you know, a efficient machine with, you know, various people involved and so on."}, {"time": 12500, "text": "And so, you know, it, it works for basic science and it's like, we can do more of this."}, {"time": 12505, "text": "And so now."}, {"time": 12511, "text": "In biology and chemistry, so it's, it's become an institute."}, {"time": 12514, "text": "Well, it needs to become an institute."}, {"time": 12516, "text": "An official institute."}, {"time": 12517, "text": "But the, the thing that, so I was thinking about, okay, so what do we do with complexity?"}, {"time": 12521, "text": "You know, what, what, there are all these people who've, you know, what, what should happen to that field?"}, {"time": 12526, "text": "And what I realized is there's kind of this area of foundations of complexity."}, {"time": 12530, "text": "That's about these questions about simple programs, what they do that's far away from a bunch of the detailed applications that people, it's not far away."}, {"time": 12536, "text": "It's, it's the, it's the under, you know, the, the bedrock underneath those applications."}, {"time": 12540, "text": "And so I realized recently, this is my recent kind of little innovation of a sort, a post that I'll do very soon about kind of, you know, the foundations of complexity."}, {"time": 12552, "text": "What really are they?"}, {"time": 12552, "text": "I think there are really two ideas, two conceptual ideas that I hadn't really enunciated, I think before."}, {"time": 12566, "text": "One is what I call meta modeling."}, {"time": 12566, "text": "The other is ruleology."}, {"time": 12566, "text": "So what is meta modeling?"}, {"time": 12566, "text": "So meta modeling is you've got this complicated model and it's a model of, you know, hedgehogs interacting with this, interacting with that."}, {"time": 12576, "text": "And the question is what's really underneath that?"}, {"time": 12580, "text": "You know, is it a Turing machine?"}, {"time": 12580, "text": "Is it a cellular automaton?"}, {"time": 12580, "text": "You know, what is the underlying stuff underneath that model?"}, {"time": 12585, "text": "And so there's this kind of meta science question of given these models, what is the core model?"}, {"time": 12591, "text": "And I realized, I mean, to me, that's sort of an obvious question, but then I realized I've been doing language design for 40 years and language design is exactly that question."}, {"time": 12600, "text": "You know, underneath all of this detailed stuff people do, what are the underlying primitives?"}, {"time": 12605, "text": "And that's a question people haven't tended to ask about models."}, {"time": 12610, "text": "They say, well, we've got this nice model for this and that and the other, what's really underneath it?"}, {"time": 12613, "text": "And what, you know, because once you have the thing that's underneath it, well, for example, this multi computation idea is an ultimate meta modeling idea because it's saying underneath all these fields is one kind of paradigmatic structure."}, {"time": 12629, "text": "And, you know, you can imagine the same kind of thing in much more sort of much sort of shallower levels in different kinds of modeling."}, {"time": 12636, "text": "So the first activity is this kind of meta modeling, the kind of the models about models, so to speak."}, {"time": 12641, "text": "You know, what is the, what's, you know, drilling down into models?"}, {"time": 12647, "text": "The other thing is this thing that I think we're going to call ruleology, which is kind of the, okay, you've got these simple rules."}, {"time": 12653, "text": "You've got cellular automata, you've got turing machines, you've got substitution systems, you've got register machines, you've got all these different things."}, {"time": 12661, "text": "What do they actually do in the wild?"}, {"time": 12661, "text": "And this is an area that I've spent a lot of time, you know, working on."}, {"time": 12666, "text": "It's a lot of stuff in my new kind of science book is about this."}, {"time": 12670, "text": "You know, this new book I wrote about combinators is full of stuff like this."}, {"time": 12676, "text": "And this journal Complex Systems has lots of papers about these kinds of things."}, {"time": 12681, "text": "But there isn't really a home for people who do ruleology or what I'm now... As you call the basic science of rules."}, {"time": 12689, "text": "So it's like, you've got some, what is it?"}, {"time": 12689, "text": "Is it mathematics?"}, {"time": 12689, "text": "No, it isn't really like mathematics."}, {"time": 12695, "text": "In fact, from my now understanding of metamathematics, I understand that it's the molecular dynamics level."}, {"time": 12698, "text": "It's not the level that mathematicians have traditionally cared about."}, {"time": 12703, "text": "It's not computer science because computer science is about writing programs that do things, you know, that were for a purpose, not programs in the wild, so to speak."}, {"time": 12713, "text": "It's not physics."}, {"time": 12713, "text": "It doesn't have anything to do with, you know, maybe underneath some physics, but it's not physics as such."}, {"time": 12717, "text": "So it just hasn't had a home."}, {"time": 12717, "text": "And if you look at, you know, but what's great about it is it's a surviving field, so to speak."}, {"time": 12722, "text": "It's something where, you know, one of the things I find sort of inspiring about mathematics, for example, is you look at mathematics that was done, you know, in ancient Greece, ancient, you know, Babylon, Egypt, and so on."}, {"time": 12738, "text": "It's still here today."}, {"time": 12738, "text": "You know, you find an icosahedron that somebody made in ancient Egypt."}, {"time": 12743, "text": "You look at it."}, {"time": 12743, "text": "Oh, that's a very modern thing."}, {"time": 12743, "text": "It's an icosahedron."}, {"time": 12743, "text": "You know, it's a timeless kind of activity."}, {"time": 12748, "text": "And this idea of studying simple rules and what they do, it's a timeless activity."}, {"time": 12754, "text": "And I can see that over the last 40 years or so as, you know, even with cellular automata, it's kind of like, you know, you can sort of catalog what are the different cellular automata used for and, you know, like the simplest rules like one, you might even know this one, Rule 184."}, {"time": 12770, "text": "Rule 184 is a minimal model for road traffic flow."}, {"time": 12770, "text": "And, you know, it's also a minimal model for various other things."}, {"time": 12776, "text": "But it's kind of fun that you can literally say, you know, Rule 90 is a minimal model for this and this and this."}, {"time": 12781, "text": "Rule 4 is a minimal model for this."}]}]