[{"title": "Ben Askren: Wrestling and MMA | Lex Fridman Podcast #242", "id": "tApj7Q37P2k", "quotes": [{"time": 233, "text": "So you obviously are thinking, hey, this is actually in the balance, it's competitive."}, {"time": 237, "text": "And I feel like Tyron thought maybe he was winning and didn't have the urgency necessary."}, {"time": 242, "text": "And so I think there's a chance he turns it up a lot."}, {"time": 247, "text": "Man, I would wanna watch him again before I, so okay, I have this problem with my personality."}, {"time": 252, "text": "Here's my personality, Lex."}, {"time": 254, "text": "I have an issue with not being able to give really exact answers."}, {"time": 257, "text": "So I hate giving you an answer that like, I don't feel like is 100% calculated."}, {"time": 262, "text": "So I would like to see them go once more because I would like to see, hey, can Tyron, because if Tyron can turn up the pace and Jake can't handle it, then I think it's an eight, one or nine, two, right?"}, {"time": 272, "text": "If it goes the exact same way and maybe Tyron was a close split decision, I'm saying, oh, it's probably gonna be close every single time."}, {"time": 278, "text": "We're probably gonna get a five to five type of thing."}, {"time": 281, "text": "So it's like, I feel like out of one match, it's not totally indicative of what the future is gonna look like."}, {"time": 287, "text": "I feel like Tyron would get a knockout and then you would still be in the same place, like not knowing what to predict."}, {"time": 296, "text": "Okay, so your fight with Jake Paul, looking back, you had a little bit of time now."}, {"time": 303, "text": "How would you analyze that fight?"}, {"time": 306, "text": "Well, I mean, the fight specifically, I got cracked with an overhand right, so I mean, it kind of sucks."}, {"time": 312, "text": "I would say, and this is where everyone's like, I really don't care and everyone's like, why would you do that?"}, {"time": 320, "text": "It turns your reputation."}, {"time": 321, "text": "It's like, well, I wanted to do it."}, {"time": 323, "text": "I had an enjoyable time training and in the buildup."}, {"time": 326, "text": "Obviously, I wasn't skillful enough to get the win, but even despite the fact that I know what's gonna happen, if someone asked me to do it again, I probably would have done it again."}, {"time": 336, "text": "And so the way I was thinking about when I was deciding whether to do it or not, because I got the offer, it's like, okay, is this money, it can change my life."}, {"time": 345, "text": "Yeah, it could, right?"}, {"time": 346, "text": "It's not gonna double my net worth, but it's gonna add significantly and make my life easier."}, {"time": 350, "text": "Number two is like, when I was in high school, we used to do boxing matches for free, just because we thought it was fun."}, {"time": 355, "text": "When we didn't have something going on Friday night, me and my buddies would get together and we had some boxing goes on, basically, and we'd punch each other in the head."}, {"time": 361, "text": "So it's like, for something I think is enjoyable, and now they're gonna pay me a whole bunch of money, yeah, sure, I'll do it."}, {"time": 367, "text": "Would you, do you think if you got the rematch, if you did the rematch, would you, what are the odds you win?"}, {"time": 373, "text": "Okay, let's see."}, {"time": 374, "text": "I'm probably not very good."}, {"time": 375, "text": "I think he's pretty good, actually, and I'm not very good."}, {"time": 377, "text": "Now it's probably at a low point for me, because, so when I started training for that, I was like 215 pounds, which is the heaviest I've ever been."}, {"time": 384, "text": "I came off my hip surgery."}, {"time": 385, "text": "I literally, when I said, yes, I'll do it, I had literally started working out the week before for the first time in my, since the surgery, because I wasn't able to do anything."}, {"time": 397, "text": "So could I perform better?"}, {"time": 399, "text": "Yeah, but now after watching him box Tyron, like if you ask me, Ben, can you beat Tyron?"}, {"time": 404, "text": "Probably not, but I don't think I can beat Tyron."}, {"time": 408, "text": "In boxing."}, {"time": 409, "text": "In boxing, correct, in boxing, yeah."}, {"time": 410, "text": "So my chances of beating him, you know, and watching that card, it's like, damn, like, it'd kind of be fun to box someone who I know sucks, who I know can beat, that's what would be fun, you know?"}, {"time": 420, "text": "Because like, the training, the preparation was fun, but then obviously, I got my butt kicked, that sucked."}, {"time": 427, "text": "You know, can I swear on this podcast?"}, {"time": 429, "text": "Oh, I was gonna drop an F bomb, I wasn't quite sure, sorry."}, {"time": 431, "text": "I think that sucked, is a swear."}, {"time": 434, "text": "You could drop all of the F bombs you want."}, {"time": 436, "text": "So, preparation wise, do you think you were more prepared for that fight, or the Jordan Burrows exhibition?"}, {"time": 447, "text": "I mean, like, how did you approach it mentally, you know?"}, {"time": 451, "text": "Well, the Burrows thing, I obviously, it's okay."}, {"time": 453, "text": "So when I retired the first time in 2017, Burrows was the only current, like, we'll say really elite level wrestler that I'd never trained with."}, {"time": 462, "text": "I was really good friends with in Nebraska, head of the coaching team, still am."}, {"time": 465, "text": "And I said, hey, I just want, I'm gonna pay my own way."}, {"time": 467, "text": "I want to come down and train with Jordan, because I want to see what it feels like."}, {"time": 470, "text": "You know, I want to get in there and mix it up."}, {"time": 471, "text": "I've mixed it up with David Taylor and Kyle Dake."}, {"time": 474, "text": "I mean, there's just something about wrestling that I love."}, {"time": 477, "text": "And so I flew myself down there in January of 2018, and I spent four days training with Jordan."}, {"time": 482, "text": "It was a really good time."}, {"time": 483, "text": "It gave me some great insight into how he thinks, and you know, what a great champion he is."}, {"time": 489, "text": "What was it like training with him?"}, {"time": 490, "text": "Like what, can you give some insights?"}, {"time": 493, "text": "Like what the, like how hard is the live training?"}, {"time": 498, "text": "Is it more drilling?"}, {"time": 499, "text": "Is it technical?"}, {"time": 500, "text": "Like how does, his, it seems like his style is very different than yours."}, {"time": 505, "text": "So how does that match up in the room in terms of like what you learn from each other, that kind of thing?"}, {"time": 510, "text": "We only went full live for one, I think it was like 12 or 15 minutes ago where it was just go, wrestle."}, {"time": 515, "text": "We did a bunch of simulated live, but obviously he had, so I was a senior in college and he was a freshman in Nebraska."}, {"time": 523, "text": "And so we, our teams had dueled each other."}, {"time": 525, "text": "He was obviously a lot smaller at that point in time, but he had followed my career."}, {"time": 530, "text": "And so when I went in there, it was like, hey, I know you're really good at this position."}, {"time": 534, "text": "What about this position?"}, {"time": 536, "text": "How exactly does it work?"}, {"time": 537, "text": "And then let's wrestle there, you know?"}, {"time": 540, "text": "And then, hey, what about this position?"}, {"time": 541, "text": "And so we would spend 30 to 40 minutes talking about that position."}, {"time": 547, "text": "On the ground or?"}, {"time": 548, "text": "It was like, one was a chest wrap, one was a headlock, one was, I don't remember, it's called the, we call it the lightning dump, but it's a."}, {"time": 555, "text": "The lightning dump?"}, {"time": 556, "text": "Yeah, my buddy's name was Lightning Luke Smith in high school and he was the first person I saw do it."}, {"time": 561, "text": "So usually when I see someone do something, then I name that move after them."}, {"time": 567, "text": "Great name."}, {"time": 568, "text": "It's a good name."}, {"time": 569, "text": "Yeah, but so what I said with that is like, he was still trying to be the best in the world."}, {"time": 573, "text": "I was just trying to go work out with Jordan Burrows because I enjoy wrestling."}, {"time": 578, "text": "Is like someone who at that point, when he has five world titles at that, four or five at that point, a lot."}, {"time": 584, "text": "And so he said, my high school kids is like, hey, this is a guy who's the best in the world, who's bringing someone in and saying, well, how do I do this?"}, {"time": 593, "text": "And so the level of inquisitiveness he has is really impressive."}, {"time": 599, "text": "And then it's obvious why he got to the level he did because he's figuring out all these little situations."}, {"time": 604, "text": "And that's honestly one of the biggest things I think wrestlers, a lot of wrestlers fail to do as they get older."}, {"time": 609, "text": "Even when they get to early college age, they say, this is my style."}, {"time": 612, "text": "This is what I do."}, {"time": 614, "text": "I'm gonna lift and work out hard and I'm not gonna add anything to my game."}, {"time": 619, "text": "Whereas you've seen many progressions in Jordan Burrows game."}, {"time": 622, "text": "He just made his 10th world team."}, {"time": 624, "text": "And if you have a really keen eye, you've been able to watch him change."}, {"time": 630, "text": "I've been watching him since 2007."}, {"time": 632, "text": "He's changed so much."}, {"time": 634, "text": "And obviously still maintained a world class level almost the entire time."}, {"time": 638, "text": "When you say change, like what changed?"}, {"time": 640, "text": "Because he's got that double leg."}, {"time": 642, "text": "Yeah, but there's no double leg anymore."}, {"time": 645, "text": "He like his double leg for the first time against Alex Deering, he hadn't hit it in years."}, {"time": 648, "text": "Yeah, so that's like when people think about Jordan Burrows, they think about the double leg because in his early years, fire, he had a great double leg, right?"}, {"time": 655, "text": "And even so in those years, I would say the biggest thing with Jordan Burrows double leg wasn't his level of explosiveness, it was his level of persistence."}, {"time": 665, "text": "He would shoot and shoot and shoot and shoot."}, {"time": 668, "text": "And it would last time to be from fun, creative angles and on the screen, all of a sudden he's on you."}, {"time": 673, "text": "And he was just super persistent with it."}, {"time": 675, "text": "And I think that was probably the key."}, {"time": 677, "text": "And then you saw, when he came out to the won the first world championship in 2011, it was kind of that type of mentality."}, {"time": 684, "text": "And then shortly after then, obviously everyone was starting to lower their stance getting lower and he developed a really good like Mantis go behind series where he would go one way the other way."}, {"time": 692, "text": "Then he started developing really good like low single ankle pick type thing, you know?"}, {"time": 696, "text": "And then his hand fighting got really tremendous, like 15, 16, 17, his hand fighting was really good."}, {"time": 703, "text": "And now I just commented at the 21 trials, like a few of the defensive sequences he got into, it was like, holy shit, like just not from an athletic standpoint, from a technical standpoint, the things he were doing was just tremendous."}, {"time": 713, "text": "So I've seen him as someone like who's continued to reinvent themselves over the course of the last 10, 12 years."}, {"time": 720, "text": "Especially as a junior and senior in college, you're exceptionally dominant."}, {"time": 726, "text": "If you were to face him at the peak, both of your peaks of NCAA wrestling, could you beat him?"}, {"time": 733, "text": "And if you can beat him, well, of course you can beat him."}, {"time": 738, "text": "How do you solve the Jordan Boroughs problem?"}, {"time": 740, "text": "Well, so from a folk style wrestling standpoint, Folk style, yes."}, {"time": 743, "text": "Folk style."}, {"time": 744, "text": "So, you know, he had some competitive matches his junior and senior year."}, {"time": 748, "text": "He had a two, one win over, or maybe it's three, two over Michael Chandler, who was my teammate who's fighting in the UFC now."}, {"time": 753, "text": "He had a two and win over Tyler Caldwell."}, {"time": 756, "text": "So I think you can glean some insight into that."}, {"time": 759, "text": "You know, he got ridden, he got so mad about this up on a podcast."}, {"time": 762, "text": "So during Corona, we had to make up all kinds of bullshit to talk about."}, {"time": 765, "text": "And we were doing like the last 10 years best 165s."}, {"time": 769, "text": "And I said, Kyle Dake would ride him for over a minute."}, {"time": 772, "text": "He got so mad he wanted to come on the podcast the next day."}, {"time": 774, "text": "So hopefully he doesn't listen to this and be like, fuck you, man, you know?"}, {"time": 778, "text": "But, you know."}, {"time": 779, "text": "This is during Corona."}, {"time": 780, "text": "Corona, last year."}, {"time": 781, "text": "He got mad."}, {"time": 782, "text": "We were talking about, we were."}, {"time": 783, "text": "Before the trials."}, {"time": 784, "text": "Yeah, correct, yeah."}, {"time": 785, "text": "So, you know, Michael Chandler rode him for two minutes plus and that was his junior year, not his senior year."}, {"time": 791, "text": "Sure, right?"}, {"time": 791, "text": "But it's close."}, {"time": 794, "text": "So I think there's some things there."}, {"time": 795, "text": "I think the interesting thing would be if I would have stuck around, right?"}, {"time": 799, "text": "So I chose to go into mixed martial arts after 2008, I would have been 74 and he would have been 74."}, {"time": 803, "text": "So we would have had to wrestle."}, {"time": 804, "text": "And then I think that the freestyle Jordan Burroughs puzzle is a lot more difficult to solve than the folk style Jordan Burroughs puzzle."}, {"time": 811, "text": "And I think, I don't think he would, I think he would acknowledge that he's much better at freestyle than he was at folk style."}, {"time": 817, "text": "You know, although he was very good, he's better."}, {"time": 819, "text": "This is like raw speed explosiveness."}, {"time": 822, "text": "Present a problem to you."}, {"time": 824, "text": "Well, so he was never, I mean, he didn't really excel on the mat in kind of either style."}, {"time": 829, "text": "In freestyle, he has got some good lace transitions, but in folk style, like his whole, like in his entire college career, I think he has like 10 pins, which is almost nothing, you know, so he was gaining no value off the top position."}, {"time": 843, "text": "He was good enough on most people to get off bottom without it being an issue, but it wasn't like, oh my gosh, this is an area where we really have to be careful, there's a lot of things here."}, {"time": 851, "text": "You know, it's just, he wasn't gaining value there."}, {"time": 853, "text": "Whereas in freestyle, he, I don't wanna say never, but the amount of times he gets turned is incredibly rare, very, very rare, and he does have like lace transitions, so he gets a lot of points there."}, {"time": 864, "text": "So, and obviously freestyle is, it can be geared way more in the neutral position, right?"}, {"time": 870, "text": "Where we're only doing takedowns, so yeah."}, {"time": 872, "text": "Were you surprised that he lost to Dake in the trials, to Kyle Dake?"}, {"time": 878, "text": "Oh, Kyle's so, so, he's so good, right?"}, {"time": 881, "text": "I mean, I think, I think his performance at the Olympics was, his loss then was shocking to, I mean, we understand it happened to Kyle Dake, you know?"}, {"time": 890, "text": "He's been a guy who's competed with Jordan Burrows forever, and obviously he was on the losing side for a while, and now he's on the winning side."}, {"time": 898, "text": "But I think a lot of people thought it was a coin flip, and I think actually Kyle Dake made it feel like it's not a coin flip."}, {"time": 905, "text": "Now, to me, it feels like Kyle Dake isn't gonna win that match significantly more times than he isn't, is what it feels like."}, {"time": 911, "text": "Yeah, I forgot which trials it was."}, {"time": 914, "text": "Was it four years ago, where Kyle Dake threw him?"}, {"time": 919, "text": "Like he, he, you saw inklings of like, oh wow, there might be eventually a changing of the guard."}, {"time": 927, "text": "Yeah, so at 13, Kyle came out and he had the one throw, but then he lost one of the matches decisively, and then he was hurt in 14, and in 16, Kyle Dake actually went up to 86 kilograms, so actually in 16, at the trials we had, so Jake Herbert was number one seed, he was a former, as Guy Russell, I was a former world silver medalist."}, {"time": 950, "text": "So you had David Taylor, who had not made a team yet, who is now a world champion, Olympic champion."}, {"time": 954, "text": "You had Kyle Dake in the bracket, who was a two time world champion now, and you had Jaden Cox in the bracket, who had not made any teams yet, but is now, what, a four time world medalist, two time world champion."}, {"time": 964, "text": "So, and then obviously Jaden came out on top of that, won his first Olympic medal, Olympic bronze medal."}, {"time": 970, "text": "So Kyle didn't wrestle Jordan in 16, and Kyle's contention the whole time, and they argued about this, so I actually did a little bit of backstabbing."}, {"time": 981, "text": "Well, it's not backstabbing."}, {"time": 982, "text": "And both of them, or just one of them?"}, {"time": 983, "text": "I didn't tell any of them."}, {"time": 984, "text": "Okay, so Jordan got mad."}, {"time": 986, "text": "We talked about this fake match during Corona, right?"}, {"time": 988, "text": "We had to make up something to talk about."}, {"time": 991, "text": "There's obviously no matches."}, {"time": 992, "text": "So we talked about this fake match, and."}, {"time": 994, "text": "Do you stand behind that statement, by the way?"}, {"time": 996, "text": "Listen, here's what I said."}, {"time": 997, "text": "Kyle Dake's a four time NCAA champion."}, {"time": 999, "text": "Yes, I said, you gotta pick a winner."}, {"time": 1002, "text": "I said, Kyle Dake wins two, one on a minute and six ride time, which I mean, we're talking as close as it gets, as close as it gets for Kyle Dake, who's a four time NCAA champion."}, {"time": 1012, "text": "I'm sorry, we're talking."}, {"time": 1014, "text": "Over Jordan Burrows."}, {"time": 1016, "text": "In a Folkestown match."}, {"time": 1018, "text": "The hypothetical."}, {"time": 1019, "text": "Back in college or now?"}, {"time": 1019, "text": "Completely hypothetical."}, {"time": 1020, "text": "Now or in college?"}, {"time": 1022, "text": "Both of them at their peaks at 165 pounds."}, {"time": 1024, "text": "So completely hypothetical."}, {"time": 1026, "text": "And so Jordan called in, he was all pissed at me for picking Kyle Dake."}, {"time": 1031, "text": "He wants to come on the next day and argue his point."}, {"time": 1034, "text": "So I said, F that, that's dumb."}, {"time": 1036, "text": "Oh, we had to pick a winner."}, {"time": 1037, "text": "We had to do something hypothetical."}, {"time": 1039, "text": "So then I called Kyle Dake, and I said, Kyle, Jordan's gonna come on and argue his case in the morning."}, {"time": 1043, "text": "If he's gonna do that, why don't you come in and argue your case?"}, {"time": 1046, "text": "So no one else knew Kyle was coming on the podcast."}, {"time": 1049, "text": "So they both show up, and they went at it."}, {"time": 1052, "text": "But one of the contentions Kyle had for years, and there's still this rule, if you win a world level medal, the following year, you sit out until the very end of the American trials."}, {"time": 1064, "text": "And they do a best two or three."}, {"time": 1066, "text": "So every time previously that Kyle had wrestled Jordan, he had to come through a tournament on Saturday."}, {"time": 1072, "text": "Okay, probably three matches."}, {"time": 1074, "text": "And then on Sunday, he would wrestle Jordan in the best two out of three, right?"}, {"time": 1078, "text": "So his contention was, I'm only wrestling Jordan at a disadvantage because I have to compete on Saturday and then competing on, which it's a fair argument."}, {"time": 1085, "text": "But I also see USA Wrestling's point."}, {"time": 1088, "text": "It's like, if someone wins a world medal, we are gonna reward them because we want that person on the team again."}, {"time": 1093, "text": "It's crazy though that Kyle Dake had to wrestle, because he's not wrestling bums in that division."}, {"time": 1099, "text": "Not bums, yeah."}, {"time": 1100, "text": "And yeah, I don't know."}, {"time": 1102, "text": "I don't know how wrestlers do it."}, {"time": 1103, "text": "Because you have to go to war like three matches and then face Jordan Burrows."}, {"time": 1110, "text": "Yeah, especially a few of those years with Dakehead, the name Andrew Howe."}, {"time": 1114, "text": "But it was a really competitive matches."}, {"time": 1116, "text": "David Taylor had really competitive matches with him."}, {"time": 1118, "text": "Isaiah Martinez even got in there, Deeringer."}, {"time": 1120, "text": "So he had some really competitive matches before he ever got to Jordan Burrows."}, {"time": 1124, "text": "So I never answered your initial question was, how did I feel?"}, {"time": 1128, "text": "So the Jordan Burrows match, I was not in wrestling shape at all, meaning wrestling's heavily dependent, especially in neutral positions, heavily dependent on timing and other things."}, {"time": 1136, "text": "I was wrestling very, very minimally because I started fighting again."}, {"time": 1140, "text": "So like my athletic shape was great, but it was mainly for fighting, I wasn't wrestling."}, {"time": 1146, "text": "So I think they were actually trying to do Burrows, Dake at the Beat the Streets."}, {"time": 1152, "text": "It's the biggest fundraiser in wrestling every single year."}, {"time": 1154, "text": "In New York?"}, {"time": 1155, "text": "In New York City."}, {"time": 1156, "text": "They usually raise like a million dollars."}, {"time": 1158, "text": "They started all these programs in New York City to get, which I really wonder what they're doing with the money now because they probably can't have the kids wrestling because New York's crazy."}, {"time": 1166, "text": "I think New York figures out a way what to do with the money."}, {"time": 1168, "text": "Hence Michael Malice complaining that they're corrupt and all that."}, {"time": 1172, "text": "But it goes to the Beat the Streets organization who then starts the clubs in New York."}, {"time": 1175, "text": "So I don't know what to do with the money."}, {"time": 1176, "text": "Anyway, so I was called like, I don't know, two weeks before the event and said, hey, someone was supposed to wrestle Jordan Burrows."}, {"time": 1184, "text": "It fell out."}, {"time": 1186, "text": "Would you wrestle him?"}, {"time": 1188, "text": "I said, yeah, sure."}, {"time": 1189, "text": "And it's like, well, they said, I trained with them for four days the year before."}, {"time": 1195, "text": "I had a pretty good idea how the match was going to go."}, {"time": 1197, "text": "It wasn't going to go so well for me, but it's like, okay, you're missing a main event."}, {"time": 1201, "text": "I can bring, because of where I'm at right now in my life, I can bring a lot of attention to wrestling."}, {"time": 1205, "text": "I can help you guys raise a bunch of money for Beat the Streets."}, {"time": 1208, "text": "My goal is I think I thought I could get one take down or turn on him was kind of my goal for the match."}, {"time": 1213, "text": "I didn't get there."}, {"time": 1215, "text": "He went kind of hard."}, {"time": 1216, "text": "He went hard?"}, {"time": 1217, "text": "Yeah, that asshole didn't give me a point."}, {"time": 1218, "text": "Yeah, that."}, {"time": 1220, "text": "I said, this is bullshit, Jordan."}, {"time": 1221, "text": "I told him during the match, like, this is bullshit."}, {"time": 1223, "text": "You're fucking going too hard right now."}, {"time": 1225, "text": "I'm not a wrestler."}, {"time": 1226, "text": "I'm not a wrestler anymore."}, {"time": 1227, "text": "I'm a fighter."}, {"time": 1227, "text": "I'm coming in here."}, {"time": 1228, "text": "So yeah, so I had a really good idea."}, {"time": 1230, "text": "I mean, we wrestled together."}, {"time": 1231, "text": "I think he'll probably get mad because I think in the live go, we did like the 12 or 15 minutes."}, {"time": 1236, "text": "I think I actually scored a take down in that, I believe."}, {"time": 1239, "text": "Maybe, or maybe it was a turn."}, {"time": 1240, "text": "He'll probably say, no, I didn't, but whatever."}, {"time": 1243, "text": "Yeah, so I knew what was going to happen."}, {"time": 1245, "text": "I knew what the outcome was going to be."}, {"time": 1247, "text": "I knew I could probably, I was hoping I could stay competitive and maybe, you know, lose like 10, two or something."}, {"time": 1253, "text": "Well, let's walk back."}, {"time": 1254, "text": "Cause I think I originally brought it up in terms of how prepared were you against Jake Paul versus Jordan Burrows."}, {"time": 1263, "text": "So did you prepare for Jake, cardio wise?"}, {"time": 1267, "text": "Yeah, I worked hard."}, {"time": 1269, "text": "But it was, I told you, I started training for my, I mean, once I had my hip surgery, they said, you know, for the first six weeks, you can't even walk."}, {"time": 1279, "text": "And it was hard for me to listen to them cause by week four and a half, five, I was feeling pretty good."}, {"time": 1284, "text": "I want to get rid of my crutches."}, {"time": 1285, "text": "But I'm like, you know what?"}, {"time": 1286, "text": "This is for the rest of my life."}, {"time": 1288, "text": "And if you get the, so if you get the real hip replacement, there's no wrestling, there's no nothing, right?"}, {"time": 1293, "text": "So that's the next step."}, {"time": 1295, "text": "I'm going to take this serious."}, {"time": 1295, "text": "So I do my crutches for six weeks."}, {"time": 1297, "text": "The next six weeks, it's still like really low weight bearing."}, {"time": 1301, "text": "Can't necessarily do anything, you know?"}, {"time": 1303, "text": "So then I get done with the three months, which is like January and I'm like, okay, I should start working out."}, {"time": 1309, "text": "So I started riding a bike a little bit and then, okay, I'm now I'm fat."}, {"time": 1312, "text": "I'm fucking fat."}, {"time": 1313, "text": "I'm going to get in better shape cause I haven't been able to do anything."}, {"time": 1315, "text": "So I'm actually start working out."}, {"time": 1316, "text": "And, and then that happened, right?"}, {"time": 1319, "text": "So I'm like, okay, well now I got three months and it gives me a good reason to get back in shape."}, {"time": 1323, "text": "And, you know, I knew I wasn't going to be a full time boxer."}, {"time": 1328, "text": "So it's like, how do I put a boxing camp together?"}, {"time": 1331, "text": "So I found, you know, I had my old teammate, Mike Rhodes."}, {"time": 1334, "text": "He came up and kind of lived with me ish kind of thing for three months."}, {"time": 1339, "text": "I found a couple of his guy canine out of Michigan."}, {"time": 1343, "text": "He came over three weeks."}, {"time": 1345, "text": "I went to Freddie Roach for a week."}, {"time": 1346, "text": "So I kind of like, you know, try to get as many good as ideas as I could."}, {"time": 1351, "text": "And my thought was like, okay, well if this dude sucks, I can just be tough and, you know, block a few punches, get him tired and then beat him up."}, {"time": 1358, "text": "If he's good, that's probably not much of my do about in the next three months."}, {"time": 1361, "text": "Cause I'm, I was never good at boxing in the first place."}, {"time": 1364, "text": "All of my standup in mixed martial arts was predicated on how do I get through the two or three punches that are gonna come at me in the time I need to get a hold of them."}, {"time": 1372, "text": "You know, it's all, you only have to make two or three of them miss."}, {"time": 1375, "text": "And then boom, you're on top of them, at least for me."}, {"time": 1377, "text": "That was all my striking was predicated on."}, {"time": 1379, "text": "It wasn't about, hey, I'm gonna do damage on the feet in order to make something else happen."}, {"time": 1382, "text": "It was like, how do I clear this barrier, get a hold of you."}, {"time": 1386, "text": "And if you, I actually did the math one time."}, {"time": 1388, "text": "I think I got a takedown."}, {"time": 1390, "text": "If you include the knockout round against Masvidal, I got a takedown in every round except two."}, {"time": 1396, "text": "So it was like, it was like 53 out of 55 rounds in MMA, I got a takedown."}, {"time": 1400, "text": "Somewhere, somewhere in there."}, {"time": 1401, "text": "Okay, so you're hunting the takedown once you, once."}, {"time": 1404, "text": "Right away."}, {"time": 1405, "text": "Once you get your hands on them, you get the takedown."}, {"time": 1410, "text": "But the incredible thing about you, I just recently talked, spent a couple of days with Jimmy Pedro."}, {"time": 1417, "text": "And he talked about his guys and just champions in general hating to lose more than they love winning."}, {"time": 1426, "text": "And the way you talked about losing, you lost very few times in your career, like later you were dominating both wrestling and MMA."}, {"time": 1436, "text": "But the way you took these losses against people that are, I don't know, below elite level."}, {"time": 1443, "text": "It's fair."}, {"time": 1443, "text": "I was gonna get pissy, but it's completely fair."}, {"time": 1447, "text": "I thought he was a bum too."}, {"time": 1449, "text": "No, that's not what I meant."}, {"time": 1450, "text": "I was in trouble."}, {"time": 1451, "text": "It's okay, no, it's good."}, {"time": 1452, "text": "No, no, no, but like what, can you explain the psychology behind that?"}, {"time": 1457, "text": "Like what, is there a system behind this?"}, {"time": 1461, "text": "Is there a philosophy behind this?"}, {"time": 1462, "text": "Well, I wasn't very good in the beginning."}, {"time": 1466, "text": "I think that's where it all starts from."}, {"time": 1467, "text": "So I didn't start getting good until the age of like 13."}, {"time": 1471, "text": "I started at five."}, {"time": 1472, "text": "I probably started competing more at age 10, 11."}, {"time": 1475, "text": "Didn't really get good until 13."}, {"time": 1477, "text": "It's still at 13."}, {"time": 1478, "text": "I'm starting to get great."}, {"time": 1480, "text": "I'm getting better, right?"}, {"time": 1481, "text": "I'm pretty good."}, {"time": 1482, "text": "So I actually have, I have written this book on sports psych, but I got someone to write it for me kind of thing."}, {"time": 1489, "text": "Cause I've had this philosophy for years that there has to be this balance between two things, right?"}, {"time": 1494, "text": "So on the one hand, in this category, on the one hand you have hating to lose."}, {"time": 1499, "text": "A great champion has to hate to lose, like you said, right?"}, {"time": 1502, "text": "But on this other hand, you have to have someone who seeks out challenges, right?"}, {"time": 1507, "text": "Cause if you don't have that, you're never gonna reach your full potential either."}, {"time": 1510, "text": "And so you have to balance these two balls at the same time, right?"}, {"time": 1514, "text": "And so like for me, I always, and this is maybe cause I wasn't good, but I was always like, let me go find the best people to wrestle all the time."}, {"time": 1521, "text": "Let me go find, I would like literally, like seventh, eighth grade when I was starting to get better, it was like, and there's no internet."}, {"time": 1528, "text": "Well, there's no one was using the internet."}, {"time": 1530, "text": "It was like a wrestling magazine."}, {"time": 1531, "text": "And like, hey dad, there's a tournament here."}, {"time": 1532, "text": "I think that, are the kids gonna be there?"}, {"time": 1534, "text": "Can you take me two hours across the state today, please?"}, {"time": 1537, "text": "You would wrestle like in competition against them."}, {"time": 1540, "text": "In competition."}, {"time": 1541, "text": "Yeah, yeah, in competition."}, {"time": 1542, "text": "Hey, I heard there's this tournament."}, {"time": 1543, "text": "Here's the magazine, this is this tournament."}, {"time": 1545, "text": "Hey dad, will you take me over there tomorrow?"}, {"time": 1547, "text": "You weren't trying to win."}, {"time": 1548, "text": "You were trying to get the experience."}, {"time": 1550, "text": "I was trying to wrestle the best guys."}, {"time": 1551, "text": "Maybe I win, maybe I lose."}, {"time": 1552, "text": "There's no, when you do a competition, there's no guarantee of a winner or a loss."}, {"time": 1557, "text": "You're just doing competition, right?"}, {"time": 1558, "text": "So I wanted to go, I wanted to challenge myself against the best guys of which I thought maybe I could come out on top, right?"}, {"time": 1565, "text": "So like eighth grade year, I won way way, I probably lost a handful of times in the state of Wisconsin."}, {"time": 1571, "text": "It was probably really, really minimal the amount of times I lost, you know?"}, {"time": 1573, "text": "But it was just about getting the challenge."}, {"time": 1575, "text": "And it's like, some kids, and not kids in my club, because I'll push them very hard on this, are scared of challenging themselves."}, {"time": 1582, "text": "They like being the big fish in the small pond."}, {"time": 1585, "text": "They're not willing to go say, I want to go get that guy, and I want to get that guy, and I want to get that guy."}, {"time": 1590, "text": "And so that's like, so I think that's part of it for me is like, I always just loved to challenge."}, {"time": 1594, "text": "I enjoyed competing thoroughly, right?"}, {"time": 1596, "text": "And I understood from a young age, because it wasn't a good, losing is a part of it."}, {"time": 1600, "text": "You're not always going to win."}, {"time": 1601, "text": "And that was kind of it."}, {"time": 1603, "text": "It's like, hey, sometimes, you know, and for my MMA career, I never planned it to go that way, but yeah, I didn't lose for nine years."}, {"time": 1611, "text": "And like, that's pretty rare."}, {"time": 1612, "text": "I didn't plan for that to happen."}, {"time": 1614, "text": "That was just what happened, you know?"}, {"time": 1615, "text": "Okay, but you also didn't lose like the second part of your college career."}, {"time": 1620, "text": "My 87, I lost, I won my last 87 matches."}, {"time": 1624, "text": "So that didn't come along with the hatred of losing?"}, {"time": 1629, "text": "I don't like losing, I still don't like it."}, {"time": 1631, "text": "But you seem to, okay, but you don't, you don't seem, you seem to kind of shrug it off a little bit."}, {"time": 1638, "text": "Okay, so like with, specifically with these two instances that you bring up."}, {"time": 1641, "text": "With the Masvidal, it feels definitely, so, okay."}, {"time": 1645, "text": "All right, let's."}, {"time": 1646, "text": "Let's go, let's go deep, let's go deep."}, {"time": 1648, "text": "So the Masvidal one, it feels different, because I had."}, {"time": 1650, "text": "So, wait, wait, wait, wait, wait."}, {"time": 1651, "text": "Let's, for people who don't know."}, {"time": 1654, "text": "Masvidal loss was your first loss."}, {"time": 1656, "text": "First loss."}, {"time": 1657, "text": "In MMA."}, {"time": 1659, "text": "I mean, it was a dramatic loss."}, {"time": 1661, "text": "Very dramatic."}, {"time": 1662, "text": "And there was this kind of buildup as you were potentially one of the greats of all time coming into this fight."}, {"time": 1670, "text": "And so, this pressure, all of that."}, {"time": 1673, "text": "So the, no, I mean, I was thoroughly enjoying it."}, {"time": 1676, "text": "I didn't feel the pressure."}, {"time": 1678, "text": "So the Masvidal fight is, he got one fucking move on me."}, {"time": 1683, "text": "It's not like he beat me."}, {"time": 1684, "text": "And if we do that again, I think I win."}, {"time": 1686, "text": "At that point in my life, for sure, I think I win way, way, way more times than I lose."}, {"time": 1692, "text": "He knew that too."}, {"time": 1693, "text": "That's why he didn't want to sound the bout agreement."}, {"time": 1695, "text": "That's why I had to taunt him and why he got so mad, because I had to continue to taunt him in order to get him to sign, right?"}, {"time": 1701, "text": "So that one hurt because, as people don't know, my MMA career, I'll just go through it fast."}, {"time": 1704, "text": "I did three fights in like smaller leagues."}, {"time": 1707, "text": "I got signed by Bellator."}, {"time": 1708, "text": "I was undefeated for three and a half years."}, {"time": 1710, "text": "I was nine and oh."}, {"time": 1711, "text": "When I got done with that in 2012, 2013, I, at that point in my head, I was just going to transition to the UFC because that's where you go."}, {"time": 1722, "text": "I was ranked like sixth in the world."}, {"time": 1724, "text": "I hadn't really had a competitive match at the end of the Bellator thing."}, {"time": 1728, "text": "And Dana White, for a reason still unknown to me, we still haven't had this conversation."}, {"time": 1732, "text": "I wish I could ask him, I should ask him sometime, chose to refuse me any entry into the UFC."}, {"time": 1738, "text": "He just said, I went to his office and he literally said, we're not interested."}, {"time": 1743, "text": "We're not going to make you an offer."}, {"time": 1745, "text": "Did you, did you mention something too about him, about the UFC?"}, {"time": 1749, "text": "That was a year before that."}, {"time": 1750, "text": "That was a year before."}, {"time": 1751, "text": "And that might play a role in it, I think."}, {"time": 1753, "text": "So yes, what happened the year before that was I called him a liar, which, but listen, I'm writing this one because he said you can't test for drugs because I'm all natural, which you can tell by my physique."}, {"time": 1766, "text": "And I was always put off by the fact that so many people cheated."}, {"time": 1770, "text": "And I was very vocal about that."}, {"time": 1772, "text": "And so he had made some statement like, oh, well, there's no way you could test."}, {"time": 1776, "text": "I said, bullshit."}, {"time": 1776, "text": "You, very specifically, I said USADA does it for all other sports worldwide, you can do it."}, {"time": 1782, "text": "And then it was funny because I hired USADA a couple of years later."}, {"time": 1785, "text": "So I think he took some offense to that, but that was like a year and almost a year and a half, I think, somewhere, years later."}, {"time": 1792, "text": "It's not like he holds a grudge or anything."}, {"time": 1793, "text": "Yeah, so I literally go to Vegas."}, {"time": 1801, "text": "You can read about it other places."}, {"time": 1802, "text": "So I got released from a belt."}, {"time": 1803, "text": "It's not like this is a negotiation."}, {"time": 1804, "text": "I got released from my belt or contract."}, {"time": 1806, "text": "I said, I'm out of here."}, {"time": 1807, "text": "I'm going to go to the UFC."}, {"time": 1809, "text": "I go to Vegas, and then I was told, hey, there's no offer for you."}, {"time": 1814, "text": "Tough shit, you know?"}, {"time": 1815, "text": "So then I ended up signing with one championship."}, {"time": 1819, "text": "I spent, what, three and a half years there."}, {"time": 1821, "text": "I won the belt in my second fight and retained the title the entire time."}, {"time": 1825, "text": "And then I just, I think."}, {"time": 1826, "text": "Again, dominating people."}, {"time": 1827, "text": "Yeah, I didn't have a competitive fight."}, {"time": 1829, "text": "And so I retired 18 and 0."}, {"time": 1832, "text": "Never, never, and for someone who loves a challenge, never getting to really challenge myself was incredibly frustrating."}, {"time": 1837, "text": "And I left the door open."}, {"time": 1839, "text": "I said, if I ever get the chance to prove I'm the best in the world, I'd love to come back."}, {"time": 1842, "text": "So somehow, a year later, I get traded."}, {"time": 1845, "text": "Trades have never happened, and this is the one and only trade ever."}, {"time": 1849, "text": "I've been retired for a year."}, {"time": 1850, "text": "I got traded."}, {"time": 1851, "text": "I get to come back."}, {"time": 1852, "text": "I fight Robbie Lawler, the first fight."}, {"time": 1855, "text": "And then essentially, they're saying, okay, if you fight, if you beat George, you're gonna get the title shot against Marty."}, {"time": 1861, "text": "And it's like, this is what I've been working for the entire, I've been trying to prove I was the best fighter in the world for the last 10 years, and I've not been afforded this opportunity."}, {"time": 1872, "text": "So when I lost to George, that was hard, because it was something that I had waited for for a really, really long time."}, {"time": 1880, "text": "It was something that I thought I could compete for, but I never got the opportunity to do, so that one was hard."}, {"time": 1885, "text": "At the same time, from just the competitive logistically, it's like, he got me with one move."}, {"time": 1889, "text": "It wasn't like he beat my ass for 15 minutes, and I got beat a bunch of different ways."}, {"time": 1893, "text": "So that was like, fuck, if I get it again, I could have done it, but they're not gonna let me have it again."}, {"time": 1898, "text": "It's not like wrestling where you could go the next year or the next week or whatever."}, {"time": 1902, "text": "You lose at Big Ten, you go to nationals two weeks later."}, {"time": 1905, "text": "Does that loss change you in any way, your psychology?"}, {"time": 1910, "text": "It's the first loss."}, {"time": 1911, "text": "I mean, had I had a longer MMA career post that, there definitely would have been a lot of time spent getting better at the entry point to the takedown, right?"}, {"time": 1921, "text": "Which I already spent time there, and I hate making excuses, but yeah, the hip, the hinging of my hip, what I couldn't do, was preventing me from doing some things, and it's why, if you look at the fight, I'm bent over as I go for the double leg."}, {"time": 1936, "text": "So what happened for people who don't know, you went in for a double leg, and he went."}, {"time": 1939, "text": "Flying knee."}, {"time": 1940, "text": "He did a flying knee, and it caught you well."}, {"time": 1942, "text": "Specifically the way he did that knee was kind of different than the way anyone had thrown flying knees before."}, {"time": 1948, "text": "Most people go more just from a stand straight vertical, whereas he took a few like running steps and went more, you know, the trajectory of the angle was different."}, {"time": 1957, "text": "So I think that's kind of probably why it caught, you know, I think a lot of things in combat, well, probably everything, but I focus specifically on combat, happen subconsciously."}, {"time": 1965, "text": "Like our brain is reading what's coming at us, and lots of times it's stuff we've seen before so we can judge how to move correctly."}, {"time": 1973, "text": "And you misread because it's something you haven't seen before."}, {"time": 1975, "text": "Had not seen him come at that specific angle, yeah."}, {"time": 1978, "text": "So that loss was really hard."}, {"time": 1979, "text": "With the Burroughs one, I told you, I knew I was gonna lose."}, {"time": 1983, "text": "So it was like, whatever, you know?"}, {"time": 1985, "text": "I'm taking this because I want to put the sport of wrestling out there in a big way."}, {"time": 1989, "text": "I wanna help them raise a lot of money."}, {"time": 1990, "text": "We sold at Madison Square Garden, Hulu Theater, and we raised a whole bunch of money."}, {"time": 1994, "text": "So my goals were accomplished."}, {"time": 1996, "text": "Jake Paul fight, I took it because they paid me a whole bunch of money, and I thought it was gonna be fun."}, {"time": 2000, "text": "Did I have any illusion I was a great boxer?"}, {"time": 2001, "text": "No illusions whatsoever."}, {"time": 2003, "text": "Would I have preferred to win?"}, {"time": 2005, "text": "Absolutely, but like I told everyone, whether I win or lose on Saturday night, I'm gonna be back coaching wrestling on Monday, because that's what I enjoy doing, and I was back coaching wrestling on Monday."}, {"time": 2014, "text": "And once I'm out, these middle school kids give me a little bit of shit about it."}, {"time": 2018, "text": "But where were you in terms of your shape and how you felt in the Mazodal fight?"}, {"time": 2024, "text": "Would you say you're on the, I mean, it's a difficult question to ask of a world class athlete, but like, were you past peak?"}, {"time": 2034, "text": "Oh yeah, I don't know why guys like to lie about that."}, {"time": 2038, "text": "I mean, the peak for me was really evidently in my late 20s, and maybe they are all fueled by extra supplements, I don't know."}, {"time": 2047, "text": "But for me, that was evident."}, {"time": 2049, "text": "But you get this, so you get this crosshair where if you're smart, like I mentioned John Burrows was, you're still gaining wisdom, you're gaining strategy, you're gaining a lot of things, right?"}, {"time": 2059, "text": "And so while your physicality may go down, your overall skill level still may be rising, especially in MMA because people usually start later because they're gaining wisdom, strategy, all of the, maybe more tools in their toolbox, right?"}, {"time": 2072, "text": "They're getting all these things."}, {"time": 2072, "text": "So their actual competitive peak, despite their athletic peak going down, might still be a few years past that, right?"}, {"time": 2079, "text": "Because these things are crossing."}, {"time": 2081, "text": "No, so I felt I was great."}, {"time": 2083, "text": "Obviously the hip was an issue."}, {"time": 2086, "text": "It's funny because I knew I had a lot of pain here, and I knew it was because of this."}, {"time": 2093, "text": "And it was like, okay, whenever I'm done, I'll just get it taken care of, whatever."}, {"time": 2096, "text": "But every time I train, I have pain kind of like all up my back, and the day after the surgery, I woke up and there was no pain on the right side of my, the surgery was on the left side."}, {"time": 2106, "text": "There was no pain on the right side of my back."}, {"time": 2107, "text": "I'm like, that's fucking weird."}, {"time": 2108, "text": "Like every morning I wake up, there's a lot of pain there, you know?"}, {"time": 2112, "text": "I'm like, okay, well I'm on pain pills."}, {"time": 2114, "text": "Maybe it'll come back tomorrow."}, {"time": 2116, "text": "And that's because I'd never been back since my hip surgery."}, {"time": 2119, "text": "So it was weird, because it was like this, I thought this was affecting this, but it was affecting all the way across my whole back."}, {"time": 2126, "text": "So if I get to get a new hip, honestly, if I, I don't know if this is gonna change the competitive outcome whatsoever."}, {"time": 2133, "text": "If I had known how good the hip replacement was gonna be, I would have done it the second I retired from one championship in November of 2017."}, {"time": 2141, "text": "I would have had my hip surgery scheduled for December 1."}, {"time": 2144, "text": "Just from a lifestyle standpoint, I could only sleep in one position."}, {"time": 2148, "text": "There was a lot of things I couldn't do."}, {"time": 2149, "text": "I was in a lot of pain."}, {"time": 2151, "text": "So I would have done that a lot earlier."}, {"time": 2152, "text": "But no, from an athletic point, I was ready."}, {"time": 2155, "text": "This shit goes wrong sometimes."}, {"time": 2158, "text": "I don't know how to ask this, but you know, Joe Rogan, me, had a sense about you similar to like Fedor, that you are potentially one of the greatest ever."}, {"time": 2172, "text": "Does it hurt that you're not in the discussion now of being in the top 10 of all time?"}, {"time": 2179, "text": "I didn't prove it."}, {"time": 2180, "text": "I don't deserve it."}, {"time": 2181, "text": "Biera, I mean."}, {"time": 2183, "text": "But I didn't prove it."}, {"time": 2184, "text": "I mean, and so it's like, had I somehow gotten to convince Dana White, we go and convince him in 2013 to make me an offer, and I didn't even need a good offer."}, {"time": 2195, "text": "I just needed any offer."}, {"time": 2196, "text": "Had I gotten the offer then, maybe the outcome's different, right?"}, {"time": 2199, "text": "But given, I would never expect anyone to think of me that way."}, {"time": 2204, "text": "I know what I was, and I'm good with that."}, {"time": 2207, "text": "And yeah, other people never got to see that."}, {"time": 2209, "text": "Do you think, well, you can't know fully, right?"}, {"time": 2211, "text": "Do you think if you went to the UFC at that time instead of one championship?"}, {"time": 2216, "text": "I think I would have had a lot of success."}, {"time": 2219, "text": "Yeah, I mean, there's obviously certain guys, there's a lot of guys I've trained with that I had a lot of really good results against."}, {"time": 2225, "text": "And obviously, Tyron was a champion for a long time there."}, {"time": 2232, "text": "So I was around, Tyron was a champion, Anthony was a champion at lightweight."}, {"time": 2235, "text": "I was, you know, same gym as him, and we had a lot of people coming through."}, {"time": 2239, "text": "Yeah, I."}, {"time": 2240, "text": "Would you face Tyron?"}, {"time": 2241, "text": "Would I have fought him?"}, {"time": 2243, "text": "I mean, so he was still the champion when I came into the UFC and we said, no, we're not gonna fight."}, {"time": 2250, "text": "Hey, so he can't change history, right?"}, {"time": 2252, "text": "So once something happens, you gotta accept for what it is."}, {"time": 2255, "text": "And move forward and obviously hope you can continue to keep accomplishing great things, which for me, obviously my athletic career is over."}, {"time": 2262, "text": "So now it's gonna be through my wrestling academies and you know, who knows what else I get into."}, {"time": 2268, "text": "You might do exhibition matches and all that kind of stuff, right?"}, {"time": 2272, "text": "Says who?"}, {"time": 2273, "text": "Wrestling and stuff, no?"}, {"time": 2276, "text": "So here's my thing with the wrestling matches is like, just for fun, if you said, hey Ben, just for fun."}, {"time": 2282, "text": "Would you love to go wrestle someone?"}, {"time": 2283, "text": "Yeah, I would, I would, right?"}, {"time": 2285, "text": "I love wrestling, I get in there."}, {"time": 2287, "text": "I love, you know, I love like, so one of my guys has gotten to be pretty good."}, {"time": 2291, "text": "He's in college, he got in Keegan O'Toole."}, {"time": 2292, "text": "He just won a junior world title this year."}, {"time": 2296, "text": "And so when I'm doing private lessons, I have such think about the development of the athletes."}, {"time": 2301, "text": "Sometimes I can wrestle hard, but most of the time it's like, I'm just gonna help them with whatever they need help with."}, {"time": 2305, "text": "And it's still wrestling and it's fun, but it's helping them."}, {"time": 2308, "text": "You know, for like, Keegan comes back this summer and he's training for the junior world title."}, {"time": 2311, "text": "So to be able to just shake hands sometimes and say like, I'm gonna try to kick your ass."}, {"time": 2315, "text": "Should you try to kick my ass?"}, {"time": 2316, "text": "You know, like just to go, like."}, {"time": 2317, "text": "Yeah, it's a good feeling."}, {"time": 2318, "text": "It's so much fun."}, {"time": 2319, "text": "And I don't get to do that very much."}, {"time": 2320, "text": "So if you said, Ben, would you love to do some matches?"}, {"time": 2322, "text": "And the answer is yeah."}, {"time": 2324, "text": "The problem, unfortunately for me, and maybe you could talk me off a ledge here, is like, because of where I've gotten to in my career, if I choose to do a wrestling match, it's gonna, people are gonna be really excited about it."}, {"time": 2333, "text": "It's gonna blow up and it's just like, I just want to wrestle just to wrestle."}, {"time": 2337, "text": "I'd rather just like go in a room where no one can watch and just wrestle."}, {"time": 2341, "text": "Well, you could also wrestle."}, {"time": 2343, "text": "So there's different kinds of wrestling."}, {"time": 2345, "text": "There's wrestling where there's an event and like, you know, there's a buildup and then an announcement."}, {"time": 2351, "text": "And you can also do like a Khabib style, like in the room, there's cameras and you're kind of going, it's like the."}, {"time": 2358, "text": "Wait, Khabib does that?"}, {"time": 2360, "text": "No, in."}, {"time": 2361, "text": "Marcelo does that."}, {"time": 2362, "text": "He whooped my ass a few times."}, {"time": 2364, "text": "I mean, I've seen Khabib in some videos."}, {"time": 2366, "text": "It's not like set up, it's just people going hard and then it's more fun."}, {"time": 2371, "text": "You know, and it's also more like presenting the beauty of the sport, you know?"}, {"time": 2379, "text": "And like, and there's no winning or losing really in that context."}, {"time": 2383, "text": "Like you're just, you're always joking around a little bit, even when you're going super hard."}, {"time": 2387, "text": "So I feel like, especially in the modern day with the internet, that's a compelling way to do."}, {"time": 2392, "text": "So I've thought about, this is the one thing I've thought about doing."}, {"time": 2395, "text": "Cause I told you about my buddy was the content thing."}, {"time": 2398, "text": "It's called Rockfin."}, {"time": 2400, "text": "Thought about doing, you know, the old really famous Gracie challenge."}, {"time": 2403, "text": "Okay, so I've thought about doing the aspirin challenge."}, {"time": 2405, "text": "You wanna hear my rule set?"}, {"time": 2406, "text": "I'm not sure I'm gonna do this."}, {"time": 2407, "text": "People are gonna show up to your, like in Wisconsin."}, {"time": 2410, "text": "I have to select you."}, {"time": 2411, "text": "I'll start with a thousand bucks, right?"}, {"time": 2414, "text": "Okay, 30 minutes."}, {"time": 2414, "text": "You pin me or I pin you."}, {"time": 2417, "text": "No points, no nothing."}, {"time": 2418, "text": "We just wrestle."}, {"time": 2419, "text": "Camera, that's it, right?"}, {"time": 2420, "text": "It's camera in the room."}, {"time": 2421, "text": "Maybe there's a referee cause we don't want there to be contention over the pin."}, {"time": 2425, "text": "Just one pin."}, {"time": 2426, "text": "30 minutes, 30 minutes, okay?"}, {"time": 2428, "text": "If I pin you, you don't get shit, you go home, right?"}, {"time": 2431, "text": "Every person I pin, it goes up by a thousand dollars."}, {"time": 2433, "text": "Two thousand, three thousand, four thousand, five thousand and so on."}, {"time": 2436, "text": "If you make it the distance and I don't pin you and you don't pin me, I'll pay for your travel and give you 500 bucks, right?"}, {"time": 2442, "text": "Just a consolation prize for showing up."}, {"time": 2444, "text": "If you pin me, you get whatever the jackpot is."}, {"time": 2447, "text": "Wait, who's adding to the jackpot?"}, {"time": 2450, "text": "I am, it's my money."}, {"time": 2452, "text": "My money."}, {"time": 2453, "text": "But then what's the incentive to keep winning for you?"}, {"time": 2455, "text": "Cause the jackpot."}, {"time": 2456, "text": "Well, cause obviously I would put the content somewhere where people would watch it, right?"}, {"time": 2459, "text": "Oh, so you're gonna make money."}, {"time": 2460, "text": "Yeah, so you'd make money that way."}, {"time": 2461, "text": "But it's not exponentially growing, right?"}, {"time": 2462, "text": "It's just going up by like."}, {"time": 2464, "text": "Yeah, I really think there's probably only a couple people that could pin me."}, {"time": 2466, "text": "So I would either just not choose those people or wait till I get a really large audience and people get really excited and in that case, I'm making a lot of money."}, {"time": 2475, "text": "What do you think, how many matches would go with you, like Khaldech shows up?"}, {"time": 2479, "text": "I don't think he could pin me."}, {"time": 2481, "text": "I mean like, so Jordan Burrows could beat me, but he can't pin me."}, {"time": 2485, "text": "He was never a pinner."}, {"time": 2487, "text": "He ain't gonna pin me."}, {"time": 2488, "text": "There's only a few people who have the skill level to do so, right?"}, {"time": 2491, "text": "It takes a lot."}, {"time": 2492, "text": "Cause that was, so pinning was one of my specialties."}, {"time": 2493, "text": "I had the fourth most of all time and I won the pinning award the last two years."}, {"time": 2498, "text": "So you think you can be done on points and just pin them?"}, {"time": 2501, "text": "This is actually one of the issues I have with Jiu Jitsu and the point system and the Eddie Bravo thing."}, {"time": 2506, "text": "I actually think Eddie Bravo thing is kind of, people get so mad at me."}, {"time": 2509, "text": "Sorry, Jiu Jitsu."}, {"time": 2511, "text": "And you want me to tell you why it's bullshit?"}, {"time": 2513, "text": "So like, if Jordan Burrows whoops my ass and the score is 16 to two, but he can't pin me."}, {"time": 2518, "text": "Then I get to go to overtime and get a cradle on him."}, {"time": 2520, "text": "I'm probably going to pin him."}, {"time": 2522, "text": "So I'm better than Jordan Burrows."}, {"time": 2524, "text": "Nah, that ain't right."}, {"time": 2525, "text": "He just whooped my ass."}, {"time": 2528, "text": "Like if we can go the whole, cause they do submission only."}, {"time": 2531, "text": "So if Jordan Burrows beats me up for, what is it, eight minutes, 10 minutes?"}, {"time": 2536, "text": "What's the length of an Eddie Bravo match?"}, {"time": 2539, "text": "Something like that, yeah, yeah."}, {"time": 2541, "text": "So we go 10, me and Jordan Burrows go 10 minutes."}, {"time": 2542, "text": "He's gonna outscore me significantly."}, {"time": 2544, "text": "He will not pin me, I promise you that."}, {"time": 2547, "text": "So now we go to the overtime."}, {"time": 2549, "text": "Strong words, but yeah."}, {"time": 2550, "text": "He won't, Jordan Burrows is not gonna, he's gonna beat me."}, {"time": 2552, "text": "I will give you that."}, {"time": 2553, "text": "Kyle Dake won't pin you either."}, {"time": 2556, "text": "Okay, they will both beat me on points very badly."}, {"time": 2558, "text": "Now David Taylor, he might pin me cause he's a very good pinner also."}, {"time": 2562, "text": "They'll beat me very badly, they will not pin me."}, {"time": 2565, "text": "But now we get to the overtime and we get to pick like, right, so in Eddie Bravo you get a rear naked choke or an armbar."}, {"time": 2571, "text": "Okay, give me a cradle, I'll probably pin him."}, {"time": 2573, "text": "Okay, a good cradle."}, {"time": 2574, "text": "You can say cradle or maybe give them, then they're probably not gonna pin me, right?"}, {"time": 2578, "text": "Maybe, maybe there's a chance, but probably not."}, {"time": 2580, "text": "Cause that's just not their specialty."}, {"time": 2581, "text": "So for people who don't know, the Eddie Bravo thing is when it goes into overtime, you get a dominance position on a person and you get to, yeah, basically put them in a cradle."}, {"time": 2592, "text": "This is the wrestling equivalent."}, {"time": 2593, "text": "But you take their back or mount."}, {"time": 2594, "text": "Maybe an armbar, yeah, like a wrestling armbar."}, {"time": 2597, "text": "So, and I don't think that's very fair."}, {"time": 2598, "text": "Cause if someone whoops your ass, they whoops your ass."}, {"time": 2600, "text": "And then, you know, and so I think the reason why Jiu Jitsu people accept that rule set is that I don't think, I think they know this, but would admit it."}, {"time": 2607, "text": "I don't think their point scoring system adequately rewards what people value."}, {"time": 2613, "text": "So like in wrestling, we value takedowns cause it gets us closer to the pin."}, {"time": 2618, "text": "And the most valuable scoring is a near fall, near to the pin, because that's the ultimate goal to sport."}, {"time": 2624, "text": "Whereas in Jiu Jitsu, for example, like if I were to get a takedown, so like if I went to Gordon Ryan and he just didn't pull guard I would probably get the takedown."}, {"time": 2634, "text": "Now, if somehow he didn't submit me, which he probably would, right?"}, {"time": 2637, "text": "But say he got, got close to like 12 submissions, but somehow I slipped out of all of them."}, {"time": 2641, "text": "Now I went to zero, like that's ridiculous."}, {"time": 2643, "text": "Like he should very clearly win cause he almost submitted, you know what I'm saying?"}, {"time": 2646, "text": "Like there, and I, and I realized the difficulty."}, {"time": 2649, "text": "I realized the difficulty in rewarding near submissions, but that is the most valuable thing is getting close to finishing the match."}, {"time": 2657, "text": "And in most competitions, they don't actually reward that."}, {"time": 2660, "text": "But okay, so this, this isn't about the sport."}, {"time": 2662, "text": "This is about the Ben Askren challenge that we're talking about."}, {"time": 2666, "text": "What, why 30 minutes?"}, {"time": 2668, "text": "Why not unlimited time?"}, {"time": 2671, "text": "Why, why go until whenever?"}, {"time": 2673, "text": "Cause then it's just a cardio thing."}, {"time": 2674, "text": "Cause at some point then someone would just have to fall over dead, right?"}, {"time": 2679, "text": "There's no more skill level involved."}, {"time": 2680, "text": "It's just who can stand up the longest."}, {"time": 2682, "text": "You honestly don't think 30 minutes is a cardio thing too."}, {"time": 2687, "text": "How do you think that's actually going to look?"}, {"time": 2689, "text": "How are they going against you for 30 minutes?"}, {"time": 2692, "text": "So it's going to be kind of boring for the most part."}, {"time": 2696, "text": "What position are you going to be stuck in?"}, {"time": 2697, "text": "Because you, well, you can't, but you can't, you just can't have a gigantic amount of action for 30 minutes."}, {"time": 2702, "text": "So I relate to this because some of my kids, when I'm teaching them wrestling, they're like, well, but I can't do that for seven minutes."}, {"time": 2710, "text": "And I'm like, well, you know, like say, say if I had you do hang cleans at a relatively heavy weight, as hard as you could, you're not going to last seven minutes."}, {"time": 2718, "text": "You're going to, your pace will slow down, right?"}, {"time": 2720, "text": "So my thing is like, well, your pace doesn't have to step here because in wrestling, you're competing against someone."}, {"time": 2724, "text": "So if you're here at a hundred and you go to 80, but they go to 70, that's great."}, {"time": 2729, "text": "And then you go to 60, but they go to 40, this is even better, right?"}, {"time": 2732, "text": "Because the gap is growing."}, {"time": 2734, "text": "So we don't necessarily, if we get tired, that's fine."}, {"time": 2736, "text": "If they get more tired, that's better."}, {"time": 2738, "text": "So I think most people would know that."}, {"time": 2740, "text": "So they would kind of slow it down."}, {"time": 2745, "text": "But yeah, I think at 30, I mean, I've wrestled 30 minute goes, I've wrestled hour long goes."}, {"time": 2751, "text": "You're not going to get so tired, you're going to fall over in that time period."}, {"time": 2754, "text": "But at some point, if it's unlimited, someone will get so tired or dehydrated that they're just going to freaking fall over."}, {"time": 2761, "text": "But you think, what about making it exciting and dynamic?"}, {"time": 2766, "text": "You think the other person is always going to be going for the pin and thereby make it dynamic."}, {"time": 2771, "text": "Well, if they're working that hard, then they might exhaust themselves, right?"}, {"time": 2775, "text": "And obviously then if you're being that dynamic, then you're adding risk to yourself too, because you are doing that."}, {"time": 2782, "text": "Well, I love this."}, {"time": 2783, "text": "This is a great idea."}, {"time": 2784, "text": "Well, I figured I'd rack up like 20 pins against bums, or not as great people in the beginning."}, {"time": 2790, "text": "And then I would start bringing in better people because they would be enticed by $20,000, the possibility to win."}, {"time": 2796, "text": "And not much fanfare, just a camera and just local."}, {"time": 2800, "text": "That's it, in my wrestling room."}, {"time": 2801, "text": "Yeah, yeah, like the Gracie Challenge."}, {"time": 2804, "text": "And so then maybe you have like, you know, for most people, you have someone edit like the 90 seconds of the most fun things that happen."}, {"time": 2812, "text": "And then you can watch the entire 30 minutes if you want to."}, {"time": 2816, "text": "I mean, I think most people, if they're not really, really elite, I'm probably going to pin them."}, {"time": 2821, "text": "If they're not really elite."}, {"time": 2826, "text": "That's something I've been thinking about."}, {"time": 2827, "text": "This has been like fun for me to think about."}, {"time": 2831, "text": "And obviously it plays in my skill sets because my cardio is good and my pinning is good also."}, {"time": 2837, "text": "So, like you said, you weren't very good in your early days until 13, 14."}, {"time": 2843, "text": "What was the switch?"}, {"time": 2844, "text": "You started to dominate people in your college career."}, {"time": 2848, "text": "You dominated."}, {"time": 2850, "text": "And obviously you stopped losing at some point."}, {"time": 2854, "text": "So, well, I would say, so even when I didn't lose in collegiate competition, I would go in the summers and try to make the world team."}, {"time": 2860, "text": "So, I would lose some, not a lot, right?"}, {"time": 2862, "text": "Minimally."}, {"time": 2865, "text": "So, when I'm five, I start playing all sports."}, {"time": 2867, "text": "Like I know you moved to America at what age?"}, {"time": 2873, "text": "So, at least I don't know what it was for you, but in America at my age, you usually play like a sport every season, right?"}, {"time": 2880, "text": "So, that's what I did in the beginning."}, {"time": 2882, "text": "I had minimal success in wrestling."}, {"time": 2884, "text": "I was kind of chunky."}, {"time": 2886, "text": "And then in fifth grade, I don't know."}, {"time": 2889, "text": "And I can't tell you, I wanted to be better."}, {"time": 2891, "text": "And I told my parents, and this is funny, because now I look at other 11 year olds and very few of them are this mature."}, {"time": 2895, "text": "And I actually think emotional maturity is kind of one of the key indicators of how longterm successful someone's gonna be."}, {"time": 2901, "text": "And at age 11, I said, I don't wanna play baseball."}, {"time": 2903, "text": "I like baseball, but I don't wanna play baseball because I wanna wrestle more because I wanna get better at wrestling."}, {"time": 2906, "text": "So, at age 11, I quit baseball so I could wrestle in a club for March, April, and May."}, {"time": 2910, "text": "Because that was all that existed at that point in time."}, {"time": 2913, "text": "You couldn't wrestle in June, July, or any of those other months."}, {"time": 2917, "text": "What was that desire to get better?"}, {"time": 2919, "text": "So, it's not about winning."}, {"time": 2920, "text": "I don't know where it came from."}, {"time": 2921, "text": "I just wanted to get better."}, {"time": 2923, "text": "I wanna get better."}, {"time": 2924, "text": "I wanna be good at this."}, {"time": 2924, "text": "I wanna be really good at this."}, {"time": 2925, "text": "So, when you're looking at kids now as a coach, you're looking for that."}, {"time": 2929, "text": "Somebody who says, you know what, I kinda suck."}, {"time": 2931, "text": "And I wanna try to also inspire that."}, {"time": 2934, "text": "I mean, honestly, I think as a coach, that's probably my biggest job is to get a kid and get them to believe I can do this."}, {"time": 2943, "text": "Because if I can do this, well, I can do that."}, {"time": 2947, "text": "I can do that too, right?"}, {"time": 2948, "text": "And there's so many kids who, unfortunately, have shitty parents or bad teachers that tell them, you suck, you can't be anything, right?"}, {"time": 2956, "text": "So, I think my biggest goal as a coach is to get someone to believe they can do it."}, {"time": 2960, "text": "So, actually, some of the ones that believe they can do it, they're the most fun, but they're not the ones who need it the most, right?"}, {"time": 2965, "text": "The ones who think they can are the ones that need me the most."}, {"time": 2968, "text": "Because they need someone to, let's go."}, {"time": 2971, "text": "So, I don't know what inspired me."}, {"time": 2974, "text": "At age 11, fifth grade, I quit."}, {"time": 2977, "text": "So, then I started having more success where I'm like, say, placing at the state tournament."}, {"time": 2984, "text": "So, you're right."}, {"time": 2986, "text": "So, sixth grade, I placed at the state, the local youth state tournament, you know?"}, {"time": 2989, "text": "So, I'm having more success."}, {"time": 2991, "text": "Seventh grade was the first year I won the youth state tournament."}, {"time": 2995, "text": "So, I'm getting better."}, {"time": 2996, "text": "Eighth grade, I actually feel like I got pretty good, but when I went to the national tournaments, I was still having really minimal success."}, {"time": 3002, "text": "My freshman year, I decided to quit football."}, {"time": 3004, "text": "Same reason."}, {"time": 3005, "text": "It's like, well, I need to put more time into this."}, {"time": 3006, "text": "My parents, my dad luckily got a mat in my basement."}, {"time": 3010, "text": "So, we have a year round club, and our impetus was that we didn't have this opportunity to go to a club year round."}, {"time": 3016, "text": "So, we had a mat in my basement."}, {"time": 3018, "text": "I had to go find, hey, you wanna come wrestle?"}, {"time": 3021, "text": "Yeah, to find partners for myself."}, {"time": 3022, "text": "What'd you do?"}, {"time": 3023, "text": "Did you drill?"}, {"time": 3024, "text": "Did you live wrestle?"}, {"time": 3025, "text": "What'd you do in that basement?"}, {"time": 3026, "text": "So, actually, I think, you'll enjoy this."}, {"time": 3028, "text": "I think the start of my scrambling was kind of based around that."}, {"time": 3034, "text": "So, I got kind of, I think it's probably my freshman sophomore."}, {"time": 3037, "text": "I'm kind of, the years are a little fuzzy, right?"}, {"time": 3041, "text": "But probably my freshman, sophomore, junior year, I found two kids who were really consistent who would come out, like you would come out on, he would come out on Tuesday, and this dude would come out on a Wednesday, right?"}, {"time": 3051, "text": "And they would come every week, and they were really consistent partners for me to have in the summer."}, {"time": 3056, "text": "But they weren't nearly as good as me."}, {"time": 3057, "text": "They were way worse."}, {"time": 3058, "text": "So, it's like, okay, how do I, how do I make this kind of like fun and compelling for them to come back?"}, {"time": 3065, "text": "Because if I just whoop their ass, they're not gonna come back, you know?"}, {"time": 3068, "text": "So, it was like, I would let them get as close as they could, and I thought they could do a takedown before not getting it, and then try to like escape or get out."}, {"time": 3076, "text": "So, obviously, if I let them get really close, sometimes they get it, you know?"}, {"time": 3079, "text": "So, they're enjoying it."}, {"time": 3081, "text": "I don't know if they ever knew I was doing this, right?"}, {"time": 3085, "text": "And that was kind of like the start, because I had to figure my way out of bad positions, because I had to try to make it entertaining for them, where they still got something out of it, and they wanted to come back the next week."}, {"time": 3094, "text": "And I also got something out of it."}, {"time": 3096, "text": "Yeah, I love this, yeah."}, {"time": 3097, "text": "Because that relationship is so important, with that, like, that, I've had a few drilling partners, training partners that were really important to my life, and I always wonder why it's difficult, why it's so difficult to find them."}, {"time": 3113, "text": "Like I, if anyone's listening to this, I'm looking for a judo person in the Austin area, actually."}, {"time": 3118, "text": "Getting the reps with people is hard."}, {"time": 3121, "text": "Even in jiu jitsu, that, it's just like, people want to do the fun stuff."}, {"time": 3126, "text": "They don't want to really put in the work, and it takes a certain kind of personality."}, {"time": 3130, "text": "And then you also have to make it fun for the other person, just like you said."}, {"time": 3134, "text": "If there's a skill mismatch, but also if you have an interest mismatch, in terms of the amount of drilling you want to do, all that kind of stuff, you have to figure out ways to make it fun."}, {"time": 3145, "text": "So you did."}, {"time": 3146, "text": "So, yeah, I think I did that, and no one told me."}, {"time": 3149, "text": "As I get some, I get frustrated, because now we have, just in my academy, we probably have 50, 60 high school kids only that are year round."}, {"time": 3157, "text": "They're year round."}, {"time": 3158, "text": "Maybe they're not consistent in the summer or whatever, but they're there."}, {"time": 3160, "text": "So when they don't have a great partner, they start whining, and it's like, you little bitches, like, you know."}, {"time": 3165, "text": "Some days they get really mad about it, because it's like, I had no partners."}, {"time": 3168, "text": "I had to find freaking two partners to come twice a week."}, {"time": 3170, "text": "You guys, there's still 22 people in the room."}, {"time": 3173, "text": "I'm sorry there's not the perfect partner for you, but like, go work out with that dude."}, {"time": 3179, "text": "So what was the switch, the change?"}, {"time": 3180, "text": "Was it gradual, or?"}, {"time": 3181, "text": "Gradual."}, {"time": 3183, "text": "Yeah, so I was in ninth grade."}, {"time": 3184, "text": "I quit football, because I wanted to get really serious."}, {"time": 3187, "text": "What position in football were you in?"}, {"time": 3188, "text": "I was actually a nose tackle."}, {"time": 3190, "text": "But at that point, so, okay, so I was also, the other thing I kind of left out here, I was really fat growing up."}, {"time": 3195, "text": "In sixth grade, I also decided, okay, I'm really fat, and if I want to be a competitive wrestler, I shouldn't be fat, because weight matters."}, {"time": 3201, "text": "I went from 130 pounds to 100 pounds in sixth grade."}, {"time": 3206, "text": "So by the time I was a freshman, I was 119."}, {"time": 3208, "text": "So I still wasn't as heavy as I was in sixth grade."}, {"time": 3210, "text": "So I was pretty small, too, but I was also slow, unfortunately."}, {"time": 3213, "text": "So they put me a nose tackle."}, {"time": 3215, "text": "I liked the competitiveness, so I was decent at it."}, {"time": 3219, "text": "So that's where you wrestled, 119?"}, {"time": 3221, "text": "My freshman year, yeah."}, {"time": 3223, "text": "So yeah, so then I started having a lot of success state wise, but not nationally."}, {"time": 3228, "text": "It's my national success, didn't come to my junior year in high school."}, {"time": 3232, "text": "But yeah, I was grinding and getting better the whole time."}, {"time": 3235, "text": "And then senior year, I started having a lot of success nationally, and I got recruited."}, {"time": 3239, "text": "But then even when my freshman year of college, this is where I loved competing, I would go every weekend."}, {"time": 3244, "text": "Because I knew, if you take the emotions out of competition, all it is is seeing your failures, acknowledging them, and then figuring out what you need to work on."}, {"time": 3254, "text": "If we take all the emotion out of it, that's what it is."}, {"time": 3256, "text": "So I wrestled 50 matches as a redshirt freshman, which is incredibly rare."}, {"time": 3260, "text": "I had 10 losses."}, {"time": 3261, "text": "So it's not, and like to not so great guys, you know?"}, {"time": 3264, "text": "So like my skill level still at that point was not that great."}, {"time": 3268, "text": "And then the next year I came out and I made it into the finals."}, {"time": 3270, "text": "So my, I made a gigantic jump in that redshirt year to the real freshman year."}, {"time": 3275, "text": "So a few questions."}, {"time": 3277, "text": "Where did the funk style of wrestling, the creative stuff get developed, at which stage?"}, {"time": 3284, "text": "So I think like looking retroactively, there was no intention to start when I was in high school with those kids, but I think that's kind of like, well, what was happening, right?"}, {"time": 3294, "text": "So what I would really say is, I had one influential coach my redshirt year of college named Mike Ironman, great guy."}, {"time": 3301, "text": "But then the second thing was, it was just out of necessity."}, {"time": 3304, "text": "I had this burning desire to be the best."}, {"time": 3306, "text": "And when I was getting my ass kicked every day in the room, cause we had, you know, Tyron was there, we had All American 157, we had All American 184."}, {"time": 3313, "text": "So I wasn't having a ton of success."}, {"time": 3315, "text": "And very quickly I realized from like a more traditional athletic perspective, strength and speed, I couldn't keep up with anyone."}, {"time": 3323, "text": "I was way worse."}, {"time": 3325, "text": "So it's like, okay, fuck, how do I, how do I do this?"}, {"time": 3327, "text": "You know, I want to do this."}, {"time": 3328, "text": "How do I do this?"}, {"time": 3329, "text": "There's gotta be a way, you know?"}, {"time": 3331, "text": "So Mike Ironman showed me a couple of things, but then it was just like this creative expansion for the next, you know, say three to five years."}, {"time": 3339, "text": "And then even now it's like, I don't know, there's something, and maybe you feel this way about judo, or there's something that's like fun about the way the body moves and works and exploring something new and thinking about, hey, wrestling's been happening at a relatively high level for we'll say 80 to 90 years in America."}, {"time": 3359, "text": "And there's still new things being developed."}, {"time": 3361, "text": "And so when you see something new, you're like, oh damn, like, that's great."}, {"time": 3363, "text": "Or like Jason Knowles may have to win Dixie."}, {"time": 3365, "text": "I'm like, how did I not think of that shit?"}, {"time": 3367, "text": "Like, why did I think of that?"}, {"time": 3368, "text": "So easy, I should have thought of that, you know?"}, {"time": 3371, "text": "So there's this like obsession with the sport of wrestling and positions where I actually think sometimes, thank God we didn't have smartphones because I may have been distracted by my smartphone."}, {"time": 3383, "text": "Maybe I wouldn't have been because I was so obsessed, but maybe, but you know, some days I had, couldn't finish the single leg on a specific person or maybe they were finishing on me and it was like, go home and I was just fucking obsessed about that one position."}, {"time": 3395, "text": "Like, okay, what am I missing here?"}, {"time": 3398, "text": "And not just accepting like that whatever the coach says is the answer, but like, what am I missing?"}, {"time": 3403, "text": "What ways can my body move that no one's told me it can move yet?"}, {"time": 3408, "text": "Where can my arms go, right?"}, {"time": 3410, "text": "Where can I do all these things?"}, {"time": 3411, "text": "And so I would just obsess about these things."}, {"time": 3413, "text": "And then, you know, sometimes you come in the next day and you say, oh, well maybe this, you know, and maybe it works, maybe it doesn't, maybe it works twice and it doesn't work the next time."}, {"time": 3421, "text": "And so you kind of like have this creative process and it's like, you know, there's a lot of things that are on the cutting room floor that never made it to the light because you thought they'd be good and they failed and they sucked."}, {"time": 3430, "text": "And then, you know, to the point where, like my senior year, I got to this point where the people, then they were just figures."}, {"time": 3438, "text": "Figures would wrestle in my head about positions I was thinking about."}, {"time": 3441, "text": "I wouldn't tell them what to do."}, {"time": 3442, "text": "They would just, they'd just go in my head."}, {"time": 3444, "text": "And then like, oh fuck, wait, that's it."}, {"time": 3447, "text": "That's it, like that just happened."}, {"time": 3449, "text": "That's the move and then I'd go try to practice and sure enough, boom, that's the move."}, {"time": 3452, "text": "That's exactly what you have Alpha Zero playing, learning chess."}, {"time": 3455, "text": "You have, it's called Self Plays."}, {"time": 3458, "text": "You have, did the figures have like a clear?"}, {"time": 3463, "text": "No faces, they were just like."}, {"time": 3465, "text": "Did they have a human form or is it just like stick figures essentially?"}, {"time": 3468, "text": "Yeah, it was not like humans."}, {"time": 3470, "text": "It was more like stick figures."}, {"time": 3471, "text": "They weren't stick figures exactly like they were."}, {"time": 3475, "text": "They had some volume?"}, {"time": 3476, "text": "Yeah, it was like a gray person and they had, you know, three dimensions essentially so I had to see how the things moved and yeah."}, {"time": 3485, "text": "I mean, this is exactly what OpenAI and DeepMind at Google are, I don't know if you've seen, but there's something called reinforcement learning in artificial intelligence where you have like, they've done it for like sumo wrestling."}, {"time": 3499, "text": "You have like, you have these two stick figures that don't even know how to get up at first and they figure out how to stand on their two feet and then they figure out how to push the other person off of the pedestal."}, {"time": 3513, "text": "Wait, so, but what about like when you look at the Boston Dynamics, sometimes they have trouble with like jumping and balancing and the other stuff."}, {"time": 3521, "text": "So are they doing that same program or no?"}, {"time": 3524, "text": "This, everything Boston Dynamics is doing is hard coded so it's not learning the, all of the sophisticated movements and strategies like high level strategies and movement, that's all something that Boston Dynamics does not do and if it does it, like the parkour stuff, that's all hard coded in."}, {"time": 3546, "text": "People like project and think like these robots have like discovered like how to move in sophisticated ways they haven't."}, {"time": 3554, "text": "Well, that's what, when you and John were talking about the grappling robot."}, {"time": 3560, "text": "I mean, the one thing I was obsessing about in my head is that with the chess, right?"}, {"time": 3566, "text": "If a chess piece moves, right?"}, {"time": 3568, "text": "The horse can move like an L, right?"}, {"time": 3571, "text": "It can only move like an L. It doesn't matter if it moves at two meters per second or seven meters per second."}, {"time": 3576, "text": "It can only move there, right?"}, {"time": 3578, "text": "Whereas like a single leg, I can shoot a single leg with many different velocities."}, {"time": 3583, "text": "I can shoot at different angles."}, {"time": 3585, "text": "I can shoot with different amounts of force, right?"}, {"time": 3588, "text": "I can shoot with my head up versus my head, I mean, right?"}, {"time": 3591, "text": "All these things are gonna matter."}, {"time": 3592, "text": "We're talking about a human being defending the single leg."}, {"time": 3595, "text": "All of those things are gonna matter and that's where human beings who wrestle are calculating those things subconsciously."}, {"time": 3601, "text": "They're obviously not consciously calculating in their head, oh, the force is coming at me at this, so I need to do that, right?"}, {"time": 3607, "text": "They're just doing it because."}, {"time": 3609, "text": "But see, the thing is, so you would absolutely, if you're doing a robot that you're wrestling, you're going to have to constrain the speed at which it moves and the power that it's able to deliver."}, {"time": 3619, "text": "So that presumably, that'll be the limitation."}, {"time": 3622, "text": "So then it'll be just the same exactly as a human."}, {"time": 3624, "text": "But then, so if we go human, max force, we're Jordan Burrows double, max force, right?"}, {"time": 3630, "text": "That's the highest, that's the highest we get and then we go down from there."}, {"time": 3634, "text": "Even within that, it's like sometimes, I can shoot a single leg with a maximum force of, I don't know, we'll just say 20 is the number, right?"}, {"time": 3643, "text": "I don't know, I'll shoot it at 20 because I feel sometimes I shoot it at 15, sometimes I shoot it at 12, right?"}, {"time": 3648, "text": "Because you feel something in your opponent that makes you do it differently."}, {"time": 3652, "text": "So they would have to learn how, and then all of these different things and sometimes maybe I clamp a little harder."}, {"time": 3657, "text": "So the robot would have to learn all of these different incoming inputs to the system and then create this reaction."}, {"time": 3664, "text": "Oh no, no, no, 100%."}, {"time": 3666, "text": "So this would be all continuous."}, {"time": 3668, "text": "So unlike chess, it would not be, it's just chess is discrete, there's, it's."}, {"time": 3671, "text": "One and then."}, {"time": 3672, "text": "You move, it's a very specific set of moves."}, {"time": 3676, "text": "Now here you would, those are all variables you control and they're continuous variables."}, {"time": 3680, "text": "So the speed, the force, there's actuators, so there's all these joints, right?"}, {"time": 3685, "text": "But you can move."}, {"time": 3686, "text": "I mean, it's just an optimization problem."}, {"time": 3688, "text": "It's kind of, and it's fascinating."}, {"time": 3690, "text": "So I've been fascinated thinking about it since you guys talked about it."}, {"time": 3693, "text": "It was a long time ago, I listened to it probably three to four weeks ago and I've kind of been like obsessing about it ever since."}, {"time": 3699, "text": "Yeah, it just changes when, so unlike boxing, for example, or striking, once you grab a hold of somebody, it changes, you're now one body, right?"}, {"time": 3712, "text": "So it's very complicated."}, {"time": 3752, "text": "I think that's the really interesting thing about humans is we're able to do all of this calculation."}, {"time": 3758, "text": "Subconsciously."}, {"time": 3758, "text": "Yeah, subconsciously."}, {"time": 3798, "text": "Yeah, I think that's all easy to take advantage of for a robot, it's just there's so many things."}, {"time": 3804, "text": "The big problem is ethically, I don't know how many people are willing to train with a robot because you're gonna get hurt."}, {"time": 3813, "text": "Well, couldn't you make a robot train as a robot or no?"}, {"time": 3816, "text": "Yes, but then it's expensive."}, {"time": 3818, "text": "So, because they're gonna get."}, {"time": 3820, "text": "Put the padding on that thing."}, {"time": 3822, "text": "I know, but then it's not, you know, it's, then you're not capturing the full."}, {"time": 3831, "text": "Why can't you put like some rubber coating on them, you know, something for that effect?"}, {"time": 3834, "text": "You could, I mean, you could, you could."}, {"time": 3838, "text": "I mean, you're talking about robots that are, these are humanoid robots, so we're talking about $500,000 million robots."}, {"time": 3847, "text": "So, you would have to be motivated to spend a lot of money because you have to have them wrestle for like a lot."}, {"time": 3859, "text": "To get better."}, {"time": 3860, "text": "Yeah, to get better."}, {"time": 3861, "text": "And then, the open question is how long does it take to get good enough to be a human?"}, {"time": 3872, "text": "I don't think we understand, I don't know, I don't think you understand how hard wrestling is."}, {"time": 3878, "text": "Like, is it a really hard problem?"}, {"time": 3879, "text": "Like, what's harder, chess or wrestling?"}, {"time": 3881, "text": "Wrestling, by far."}, {"time": 3883, "text": "That's, yeah, that's the sense I have."}, {"time": 3885, "text": "So, because there's an infinite amount of moves, right?"}, {"time": 3888, "text": "And possibilities, so once I shoot the same leg, now you have X amount of choices."}, {"time": 3892, "text": "Once you make your choice, now I have a choice, X amount of choices."}, {"time": 3896, "text": "Now you have X amount of choices on the defense, and we can just keep going back and forth, right?"}, {"time": 3899, "text": "And this number becomes."}, {"time": 3901, "text": "Yeah, but the same happens with chess."}, {"time": 3902, "text": "Correct, but then in wrestling, you have to make these movements very instantaneously, right, because if I shoot a single leg, I'm not gonna wait and say, what's your defense?"}, {"time": 3911, "text": "Right, you have to be instantaneously."}, {"time": 3912, "text": "And then, also, again, based on the force and the vectors and the angles, you have to calculate that and adjust."}, {"time": 3919, "text": "So really, you know, if you're saying, well, I can shoot a single leg, it's not like moving the chess, it's not one move, right?"}, {"time": 3924, "text": "If you want to talk about different forces and stuff, it could be hundreds or thousands of different moves based on how hard I shoot it, the angle, the direction, all of those things."}, {"time": 3932, "text": "Yeah, but wait a minute."}, {"time": 3933, "text": "So, robots can do this kind of stuff really fast."}, {"time": 3937, "text": "People probably know the physiology of this, but the reaction speed for a human is maybe 100 milliseconds, something like that, I don't know, from sensation to, like, from the signal traveling up to your brain and down, I don't know what that number is, but robots certainly could do it way faster."}, {"time": 3956, "text": "You would actually have to, like, constrain the speed."}, {"time": 3960, "text": "Well, so the robots are already killing the chess people, right, so, yeah, theoretically, they could eventually beat wrestlers, but you asked what was harder, wrestling or chess."}, {"time": 3968, "text": "Yeah, and I think wrestling is, because of the time component in it and the physicality of, you know, is it this force or that force, you know?"}, {"time": 3978, "text": "Because if I'm gonna say we're in a seatbelt side by side, right, a wrestling seatbelt, not in Jiu Jitsu, based on the pressure you're giving me, I might do a bunch of different things, right?"}, {"time": 3987, "text": "And so, like, to an untrained eye, they might both look like the same thing from you."}, {"time": 3992, "text": "To a trained feel, it's like, well, in one case, it's really evident I should go this way, in another case, it's really evident I should go that way."}, {"time": 3999, "text": "So the other thing to consider, just like with chess, the AI systems, so human versus human play a certain way together."}, {"time": 4009, "text": "They actually haven't considered a really large number of strategies that AI systems discover."}, {"time": 4014, "text": "So one possibility with a robot, they'll discover certain ties and certain takedowns."}, {"time": 4020, "text": "That, like, will dominate no matter what the human does."}, {"time": 4023, "text": "You think that, so you think there's that, so this, I mean, this is what I'm talking about with the wrestling, so fun is there's, even after 80, 90 years, there's this continuous evolution."}, {"time": 4031, "text": "So you think."}, {"time": 4032, "text": "There'll be some, like, low single type thing, like John Smith type of situation."}, {"time": 4035, "text": "Well, like a down block go behind is something that has really, I would say really in the last fiveish years has really been evolved."}, {"time": 4041, "text": "What's a go behind?"}, {"time": 4042, "text": "Down block go behind, so when you shoot, well, they just, head inside or head outside matters, but there's one for both."}, {"time": 4048, "text": "You shoot at me, essentially, I take my leg, boom."}, {"time": 4051, "text": "And then, so that was kind of in existence when I was in college, right?"}, {"time": 4054, "text": "You down block them and you stop, but usually you hit on this side of their head, right?"}, {"time": 4058, "text": "And now, immediately, you shoot and I attack that shoulder and then I start hitting a go behind on you, right?"}, {"time": 4063, "text": "And so, like, that in its current incarnation, it absolutely wasn't around when I was in college."}, {"time": 4069, "text": "I would say it probably became popular five to seven years ago."}, {"time": 4073, "text": "So yeah, there's these big things that are happening."}, {"time": 4076, "text": "Now I really wanna roll back because I wanna be ahead of the game."}, {"time": 4078, "text": "I wanna know what I'm missing."}, {"time": 4080, "text": "I mean, one interesting thing you have with Alpha Zero that plays chess is it sacrifices pieces much more than humans do."}, {"time": 4089, "text": "So it'll give you a piece."}, {"time": 4091, "text": "And not only does it give you a piece, it will wait a bunch of moves before it makes you pay."}, {"time": 4099, "text": "Because it knows that that's better for the long term."}, {"time": 4101, "text": "So like humans rarely sacrifice without getting the piece back, like two or three moves after."}, {"time": 4108, "text": "Alpha Zero can wait like five moves."}, {"time": 4111, "text": "So basically you'll have, potentially with wrestling, you might have a robot that like puts itself in bad positions, but in a certain kind of way then that will actually turn out."}, {"time": 4122, "text": "Lures the opponent in to trap."}, {"time": 4125, "text": "That's what my style is based on."}, {"time": 4127, "text": "You basically narrow, one thing to do is you narrow the set of choices."}, {"time": 4132, "text": "You put yourself in a bad position, but it narrows the set of choices."}, {"time": 4135, "text": "For them, because they're not used to it."}, {"time": 4136, "text": "Yeah, they're not used to it."}, {"time": 4138, "text": "And then you drag them into your, yeah."}, {"time": 4142, "text": "So, but there's also, the problem is there's mechanical issues."}, {"time": 4146, "text": "Like it's actually just difficult to build robots that are able to sense, because we have sensation throughout our body, yeah."}, {"time": 4154, "text": "It's just difficult to build that kind of robot."}, {"time": 4156, "text": "It's expensive."}, {"time": 4156, "text": "You start talking about multimillion dollars, and then people start asking you questions."}, {"time": 4161, "text": "Why did you invest all of this money?"}, {"time": 4163, "text": "They wanna see what moves they do, duh, hello."}, {"time": 4166, "text": "It could be a better investment."}, {"time": 4169, "text": "So I mentioned John Smith."}, {"time": 4172, "text": "He is, if people don't know, one of the great wrestlers, wrestling coaches ever."}, {"time": 4176, "text": "He's also creative like you."}, {"time": 4177, "text": "He spoke really highly of you."}, {"time": 4180, "text": "Did you guys ever work together?"}, {"time": 4183, "text": "So you know what, when I was a senior, and I had the people wrestling in my head, I was lucky enough to be doing, I was pretty much a graduate, so I did an independent study with the sports psychology."}, {"time": 4193, "text": "I was potentially going to go to grad school for sports psychology."}, {"time": 4196, "text": "Well, I actually did nine credits, and then I just decided I didn't want to do it anymore."}, {"time": 4200, "text": "I continued learning on my own."}, {"time": 4202, "text": "But I had an independent study with the guy who's the head of USA Track and Field Sports Psych."}, {"time": 4207, "text": "So here was the class was, I got to go sit down and talk with him for an hour, and he was like fascinated by me."}, {"time": 4213, "text": "So he didn't let me do homework."}, {"time": 4214, "text": "It was like the greatest three credits ever."}, {"time": 4216, "text": "We just talked."}, {"time": 4217, "text": "I learned so much."}, {"time": 4220, "text": "But so I started, so one time it came up, I had these robot, or people wrestling in my head, and he said, well, who else do you think, but John Smith happened."}, {"time": 4227, "text": "So I went and got John Smith's number, and I called him and said, hey, you ever had these people wrestling in your head?"}, {"time": 4232, "text": "And he said, yeah, but as soon as I stopped coaching, they went away."}, {"time": 4235, "text": "Same thing happened to me."}, {"time": 4236, "text": "As soon as I started coaching, they went away."}, {"time": 4238, "text": "So if I really force myself now, and I'm like, I see something in practice, and it's really higher level, because high school wrestling, I don't want to, maybe I feel bad, but it's a little bit lower level, right?"}, {"time": 4248, "text": "So if Keegan, for example, who won the tournament, if he's struggling with a problem or asks me a question, and I can force myself to see the bodies moving and think about it again, kind of like I was in early age, but it won't just flow there anymore."}, {"time": 4262, "text": "So he said it went away, and for me, it went away also."}, {"time": 4266, "text": "By the way, if we can pause on the bodies in your head, how are they generating new ideas?"}, {"time": 4276, "text": "Are they just kind of?"}, {"time": 4279, "text": "You tell me."}, {"time": 4280, "text": "So it's just, they're just scrambling in your head?"}, {"time": 4284, "text": "It would be specifically based on a problem I was struggling with, or a specific position, you know?"}, {"time": 4290, "text": "It goes in for a single, and then go from there."}, {"time": 4292, "text": "Yeah, so I'm sitting in geography class, and I don't have to work that hard, because it's easy, right?"}, {"time": 4298, "text": "And yeah, I'm just sitting there acting like I'm looking at the board, and these guys are wrestling, and I'm watching them wrestle, and yeah, sometimes they come up with a really good solution."}, {"time": 4307, "text": "Is there somebody you look up to style wise?"}, {"time": 4312, "text": "Like Gable, John Smith, all these legend status people."}, {"time": 4317, "text": "Probably Gable, or it's a Gable."}, {"time": 4319, "text": "John Smith, but after the fact."}, {"time": 4321, "text": "So the problem with wrestling in my era was you couldn't watch it."}, {"time": 4324, "text": "There was no access, right?"}, {"time": 4326, "text": "It wasn't really available."}, {"time": 4327, "text": "Even if you want to say, go find a bunch of John Smith, man, they're kind of hard to find, right?"}, {"time": 4331, "text": "There's a couple of them on YouTube, but I've obviously seen all of those, but in my era, there really wasn't any of it."}, {"time": 4338, "text": "So it was hard to be a fan of something, and that's why wrestling has, the fans are going like this, because now you can flip on the Flow app, and you can watch something that's happening in Europe, right?"}, {"time": 4349, "text": "We can do this easily, so we can be a fan of people."}, {"time": 4352, "text": "So now I'm more a fan of wrestling than I was then, because there just was no access."}, {"time": 4357, "text": "So now I can watch someone I like, and say, oh shit, that guy's wrestling."}, {"time": 4361, "text": "Oh, boom, I flip my phone on, I watch them wrestle."}, {"time": 4363, "text": "That type of thing."}, {"time": 4364, "text": "You know, and a quick rant."}, {"time": 4367, "text": "It's really frustrating that you can't watch the Olympics."}, {"time": 4370, "text": "Oh my god, it's so frustrating."}, {"time": 4372, "text": "I've been, I think I'm gonna go to war on this point."}, {"time": 4375, "text": "Go to NBC's headquarters, I'll go with you."}, {"time": 4377, "text": "You got a soldier here."}, {"time": 4379, "text": "I was talking to Jimmy, Jimmy Pedro, he was surprised by this, too."}, {"time": 4384, "text": "Most matches, you can't see, even, you talk about like a comeback, Gable Steelers, and you can't see the full match."}, {"time": 4393, "text": "You get like a crappy highlight."}, {"time": 4395, "text": "So the two biggest things, and really the three, the NCAA championships on ESPN, the Olympic trials are on NBC, and the Olympics are on NBC."}, {"time": 4405, "text": "And these companies are so big, they don't have a department dedicated to selling the rights to that footage, right?"}, {"time": 4411, "text": "So the rights to wrestling footage, which no one really cares all that much about, except a niche, are the exact same as track and field, or basketball in the Olympics."}, {"time": 4420, "text": "So yes, all of this stuff is completely inaccessible to us."}, {"time": 4424, "text": "The NCAAs, the Olympic trials, and the Olympics, you can't go watch old film on it, it sucks."}, {"time": 4430, "text": "Yeah, old, the current film."}, {"time": 4432, "text": "So you can't even watch the Gable match?"}, {"time": 4434, "text": "The Gable Steelers, no."}, {"time": 4435, "text": "They did a, you know, they do something that annoys the fuck out of me."}, {"time": 4439, "text": "Okay, they do like a three or two minute highlight."}, {"time": 4445, "text": "So it's like they capture the most important thing, but it's all about the buildup."}, {"time": 4452, "text": "It's like that very beginning when you step on the mat, and the nerves, and you walk out, and like that, I mean, I don't know, you miss, then when the triumph happens, or the heartbreak happens, it has that much more power."}, {"time": 4468, "text": "Yeah, if you want to go to war with NBC or ESPN, I'm happy to join that."}, {"time": 4472, "text": "I think I'm fortunate it's the IOC."}, {"time": 4474, "text": "Well, I mean, is the IOC on that?"}, {"time": 4477, "text": "IOC is selling, for the Olympics, is the one that's making."}, {"time": 4481, "text": "Well, so NBC broadcasts, so they obviously have the live rights."}, {"time": 4485, "text": "You would think they would have recorded, if they, I mean, they're the ones recording it, you would think they keep the rights when you think."}, {"time": 4490, "text": "No, no, no, they're getting a license of it."}, {"time": 4493, "text": "They're getting exclusive like license, but like the, you know, for example, I've had this, I talked to Travis Stevens, the Judo player, and there's a really sort of famous match, just a heartbreak in his career from 2012 Olympics, where he goes against a German, Oli Bischoff, whatever."}, {"time": 4514, "text": "It's a 20 minute match to go to war, and that's not available anywhere, but it's uploaded on YouTube and set to private."}, {"time": 4522, "text": "The reason I know this is on the IOC channel."}, {"time": 4526, "text": "So they've uploaded all of these matches."}, {"time": 4528, "text": "They have it and put it up."}, {"time": 4529, "text": "So actually, so my Olympic match, the one I won, got put public, and so I don't know if it was private, it got put up on YouTube."}, {"time": 4539, "text": "I was allergic to it the week of my Jake Paul fight."}, {"time": 4542, "text": "It was so dumb."}, {"time": 4542, "text": "I'm like, why, this is 13 years later, this is bullshit."}, {"time": 4546, "text": "Like this should have been up."}, {"time": 4547, "text": "So, I mean, okay, so what about Olympic trials footage?"}, {"time": 4551, "text": "That has to be the USOC then or NBC?"}, {"time": 4555, "text": "So I know like, okay, so I know Flow, right?"}, {"time": 4557, "text": "Cause I worked with them."}, {"time": 4558, "text": "I know if Flow buys your event or whatever, right?"}, {"time": 4561, "text": "They buy the rights, generally in the contract, they'll have rights to both live stream it and then use that footage at any point moving forward."}, {"time": 4569, "text": "So those matches live on Flow's website."}, {"time": 4572, "text": "That's why I would be surprised if NBC didn't have something similar."}, {"time": 4576, "text": "Flow does a pretty good job of providing like a place where you can watch all these matches."}, {"time": 4582, "text": "NBC does not."}, {"time": 4583, "text": "Does not, yeah."}, {"time": 4583, "text": "And also there's an argument with Flow as well, but certainly with Olympics."}, {"time": 4588, "text": "There's a difference between what Flow does and what the Olympics represent."}, {"time": 4593, "text": "Like it feels like the Olympics, which is what the charter says, should be as accessible as possible."}, {"time": 4602, "text": "Like you should really lower the barrier for entry for the Olympics."}, {"time": 4605, "text": "You know that's what the charter says, but those people in the IOC, these are the worst people ever."}, {"time": 4610, "text": "They're very bad."}, {"time": 4611, "text": "Well, they're not bad."}, {"time": 4612, "text": "They just lost touch of the dream they once had when they joined the IOC."}, {"time": 4616, "text": "Well, I would argue all the way back that these are rich fat cats who, like I get so mad about the NCAA, which finally now got rid of this bullshit term amateurism."}, {"time": 4627, "text": "It's like, well, there's some holy grail where you can't make money to be an amateur athlete, but the people who own the IOC or the people who own the institutions, college institutions are making boatloads of money off of you, that's crap."}, {"time": 4639, "text": "So you competed, like you said, at the 2008 Olympics."}, {"time": 4644, "text": "Did you believe you can win gold?"}, {"time": 4647, "text": "So your mental game was on point."}, {"time": 4650, "text": "Yeah, I was ready."}, {"time": 4653, "text": "This wasn't good enough."}, {"time": 4654, "text": "That was what I said."}, {"time": 4656, "text": "Yeah, I mean, so at that point in time, it was my first year of international competition."}, {"time": 4661, "text": "So when I came out in 2007, it was my first time making 74 kilograms, which is pretty small for me."}, {"time": 4667, "text": "I had some failures, but then quickly I turned that around and I was having success in America."}, {"time": 4673, "text": "I was beating everyone."}, {"time": 4674, "text": "I don't wanna say easy, but yeah, I was doing really well."}, {"time": 4680, "text": "I went international one time, and there was one match I got cheated on."}, {"time": 4685, "text": "The Russians, they're cheaters."}, {"time": 4687, "text": "Excuse you, Ukraine, not Russia."}, {"time": 4690, "text": "I lost one real match where I actually lost, and it was to Denis Sarguch, who would go on to win three world titles, but he was behind the T of that year, and it was competitive."}, {"time": 4700, "text": "So I knew, okay, I'm going with the best guys in the world."}, {"time": 4703, "text": "I beat a bunch of other guys who were good and had passed decent results."}, {"time": 4709, "text": "So I knew I was right there."}, {"time": 4711, "text": "Unfortunately, I ran into this guy, Ivan Fundora, and I had someone do scouting reports for him, actually my high school coach, who now coaches for our academy, John Messimerich, and Fundora was the worst stylistic matchup."}, {"time": 4723, "text": "I got him, and I lost him second round."}, {"time": 4726, "text": "So I wasn't good enough."}, {"time": 4729, "text": "Had I decided to keep wrestling, I probably would have gotten better, but at that point, I just wasn't in the cards."}, {"time": 4733, "text": "So in your division was, like you said, it's the T of, if I said it's the T of, that guy's special."}, {"time": 4741, "text": "He's very special."}, {"time": 4742, "text": "So that would be my other guy that you asked earlier who I enjoyed watching, and that was a guy I, again, it was kind of after the fact because it was hard to access footage, but he was a lot of fun to watch."}, {"time": 4752, "text": "What do you think made him great?"}, {"time": 4755, "text": "A lot of people talk about him as potentially one of the greatest ever."}, {"time": 4761, "text": "I mean, so he won six and three, six Worlds, three Olympics, nine total, which there's only one or two people above that."}, {"time": 4770, "text": "So again, it was hard to watch any live footage of him, but from what I've seen, his feel is different."}, {"time": 4775, "text": "He was just ahead of his time, and the feel and the touch he had for certain moves and different things, because obviously physically he's kind of unimposing."}, {"time": 4783, "text": "He's taller than skinnier, which it can work in wrestling, but it is by less represented."}, {"time": 4790, "text": "So yeah, he was special, so good."}, {"time": 4794, "text": "Do you take any inspiration from, let's talk about Dagestan in general."}, {"time": 4800, "text": "What do you think makes those wrestlers great?"}, {"time": 4804, "text": "Have you read the book, The Talent Code?"}, {"time": 4807, "text": "And that kind of talks about these talent hotspots all around the world."}, {"time": 4809, "text": "So now obviously with our wrestling academies, we try to take some lessons from that and apply it."}, {"time": 4815, "text": "I got to assume, they didn't cover Dagestan in that book specifically, but I got to assume a lot of the same principles that are in that book apply to Dagestan in wrestling."}, {"time": 4826, "text": "They did South Korea and women's golf."}, {"time": 4829, "text": "They did Curacao in baseball."}, {"time": 4831, "text": "They picked a lot of these other places that were really elite."}, {"time": 4833, "text": "I think it was maybe Moscow in women's tennis also."}, {"time": 4837, "text": "So I think all of these things that make any group great organization is probably the same things that's happening there."}, {"time": 4845, "text": "Well, the hardship, I mean, is there something specific about wrestling that can create so many great champions?"}, {"time": 4854, "text": "From that area?"}, {"time": 4855, "text": "So obviously they all love the big deal."}, {"time": 4858, "text": "Wrestling specifically is a big deal there."}, {"time": 4861, "text": "They do Sambo also, obviously."}, {"time": 4863, "text": "So that's part of it is a lot of the kids are doing it."}, {"time": 4865, "text": "They obviously are rough tumble, tough life."}, {"time": 4868, "text": "Getting a lot of fights."}, {"time": 4869, "text": "And then I think that also that a lot of them, it is a way out right there."}, {"time": 4874, "text": "The elite level athletes in that part of the world, from my understanding, are really well compensated compared to what the average person makes and they're treated really well."}, {"time": 4882, "text": "So people see it as a way out."}, {"time": 4883, "text": "Whereas like, and then honestly, if America is getting better, but in 2008, the reason I went to MMA was because I didn't want to be poor my whole life."}, {"time": 4893, "text": "It sucked."}, {"time": 4894, "text": "It's like, well, I don't want to make $20,000 for the next 48 years."}, {"time": 4897, "text": "So I'm going to go do something else."}, {"time": 4899, "text": "If I could have made, even I didn't need to be rich, right?"}, {"time": 4901, "text": "If I could have made $100,000 or $70,000 wrestling, I probably would have kept wrestling."}, {"time": 4906, "text": "So I think there's factors and obviously now they have a really like, a bunch of really good people in one area."}, {"time": 4912, "text": "So there's probably, and it's been going on for a long time."}, {"time": 4915, "text": "So there's probably been a bunch of like adults and coaches that are coming back and helping that progress."}, {"time": 4919, "text": "So yeah, a lot of those things that happen."}, {"time": 4921, "text": "So I'm definitely going to travel there to talk to them because I can speak Russian."}, {"time": 4925, "text": "It makes it very, makes me uniquely qualified to."}, {"time": 4933, "text": "My brother can speak a little bit of Russian."}, {"time": 4935, "text": "Your brother can?"}, {"time": 4936, "text": "Okay, like a little bit like he swears and."}, {"time": 4940, "text": "Like he would, oh man, don't, don't make me oversell."}, {"time": 4943, "text": "I think he would be able to have a conversation with you."}, {"time": 4947, "text": "Probably not like you."}, {"time": 4948, "text": "What's the, what's the reason he knows Russian?"}, {"time": 4951, "text": "I don't know why he got obsessed with languages."}, {"time": 4953, "text": "And so his college degree is actually, what are they called?"}, {"time": 4957, "text": "Interdis, where you have three minors."}, {"time": 4958, "text": "So he had a minor in Russian, a minor in Spanish and maybe Japanese, I'm messing up."}, {"time": 4966, "text": "It's definitely, it's Russian and Spanish for sure."}, {"time": 4968, "text": "I don't know what the third one is."}, {"time": 4969, "text": "No, but yeah, Dagestan, it's really fascinating."}, {"time": 4972, "text": "But the emphasis on technique, the lighter drilling, like they don't really go super hard."}, {"time": 4979, "text": "Yeah, and I only spent a couple, so I was there, I was in Vladikavkaz in 2008."}, {"time": 4983, "text": "That was where the World Cup was."}, {"time": 4984, "text": "We had to train there for like two days afterwards."}, {"time": 4986, "text": "So I didn't get to dig deep, dig deep into what was going on or anything."}, {"time": 4994, "text": "But yeah, I mean, I think sparring is very beneficial for wrestling, not like sparring MMA is we fight, right?"}, {"time": 5004, "text": "Sparring in wrestling is, so I always just describe it to be really simple."}, {"time": 5009, "text": "If we're drilling, it's relatively 0% resistance."}, {"time": 5011, "text": "If we're going as hard as we can, that's 100%."}, {"time": 5013, "text": "There's all this gray area in the middle that's sparring, right?"}, {"time": 5017, "text": "So if you have a good relationship, like college me and my brother, we could just go and we know where each other's at."}, {"time": 5025, "text": "We don't even have to talk about it, right?"}, {"time": 5026, "text": "But like in my wrestling club, I'll say, okay, hey, I want you guys to go 50% in this position."}, {"time": 5031, "text": "Or I want the high crotch guy, I want him to shoot and this is for him, so I want him to go 70."}, {"time": 5036, "text": "And the defensive guy, I want you to go 40."}, {"time": 5038, "text": "So you're not supposed to be trying to win here."}, {"time": 5039, "text": "You're gonna go a little later."}, {"time": 5040, "text": "I want you to give him some looks, you know?"}, {"time": 5043, "text": "So I think it has really taken hold in America."}, {"time": 5045, "text": "I think it's really beneficial for success."}, {"time": 5046, "text": "And I think that's, I mean, America's doing better than we've ever done historically."}, {"time": 5051, "text": "Well, that 70 and 40, that's like an art form to find that right place, because the really good people I've trained with, they go much closer to 100% speed wise, but without forcing things the way you would when you're going."}, {"time": 5068, "text": "It's some weird combination of things that, like if you truly earn a technique, then you're given that technique."}, {"time": 5076, "text": "But if you don't, you don't."}, {"time": 5079, "text": "And then it becomes much less injury prone."}, {"time": 5082, "text": "It becomes somehow more fun, more dynamic."}, {"time": 5084, "text": "You don't get stuck in positions."}, {"time": 5086, "text": "It's just a lot of movement."}, {"time": 5088, "text": "Yeah, the one thing, so you and John talked about, like different ways to learn and get better."}, {"time": 5094, "text": "And so I think John obviously innovated within the sport of jiu jitsu."}, {"time": 5098, "text": "And so for us, and maybe there's a differentiator for us."}, {"time": 5103, "text": "I think about it like."}, {"time": 5105, "text": "You have this academy and you sent me this plan."}, {"time": 5107, "text": "They have like a really well thought through plan for how to develop a good wrestler."}, {"time": 5112, "text": "So I think it's, for me there's four categories, right?"}, {"time": 5116, "text": "There's the teaching, which is like, you don't know shit."}, {"time": 5120, "text": "You're coming in and I'm showing you the move and you're literally going out there and you're trying."}, {"time": 5124, "text": "To me, that's not even drilling."}, {"time": 5126, "text": "That's like teaching, like you're trying to learn something."}, {"time": 5129, "text": "So obviously in someone's earlier periods, they're spending a lot of time in that phase because they literally don't even know how to move their bodies the right way."}, {"time": 5138, "text": "Once you learn the skill, then there's the drilling because you absolutely have to get those reps to become really proficient in that movement and then the sparring and then the live, right?"}, {"time": 5148, "text": "And so like, I think obviously by the time you get to the kind of, I don't wanna say end point, right?"}, {"time": 5153, "text": "But further on, the time you spend teaching is so, I don't wanna say, I'm sorry, in the learning teaching phase is not insignificant, but it's so much smaller because to someone who's really good, who I've coached for 10 years, I don't have to give this big long drawn out explanation."}, {"time": 5168, "text": "I just have to say, hey, move your hand a little differently or just do this, right?"}, {"time": 5173, "text": "We don't have to spend any time there."}, {"time": 5174, "text": "So I think that's like something that consumes for the younger kids, say five through 12 or 13, we're consuming a massive amount of time there on that teaching learning phase."}, {"time": 5184, "text": "And then as we get older, that time wanes a lot."}, {"time": 5188, "text": "But that makes total sense, right?"}, {"time": 5191, "text": "It's funny because when you look at like jiu jitsu schools, they spend a lot of time in the teaching learning and then the live, like there's not enough drilling."}, {"time": 5200, "text": "I like how you draw a distinction there because it feels like you're always starting from scratch."}, {"time": 5205, "text": "Like people have like very crappy short term memory."}, {"time": 5208, "text": "Like they're not, like the way teaching is done is you show a technique from scratch and it seems disjoint."}, {"time": 5217, "text": "It is for sure, especially if you have a class that's been with you for a while, you don't have to start from scratch."}, {"time": 5221, "text": "You can say, hey, let's focus on this one little thing here or let's, after we do this, let's do that, and you kind of put, start putting it all together."}, {"time": 5229, "text": "And then with jiu jitsu, the thing that I really struggled with was a couple of things."}, {"time": 5234, "text": "It was, and this is not speaking for all the jiu jitians, my personal experience through the sport."}, {"time": 5239, "text": "And I actually found my, so when I unretired, I found someone really great that I loved and I really wish it was Mark Lehman."}, {"time": 5245, "text": "I don't know if you know him at all."}, {"time": 5246, "text": "I wish I would have found him earlier because he was just tremendous."}, {"time": 5251, "text": "But number one, there's no drilling."}, {"time": 5252, "text": "So it's like, in wrestling, I can boil down to, I can probably name you the best six moves, right?"}, {"time": 5260, "text": "So we need, as younger people, single leg, right?"}, {"time": 5263, "text": "Single leg's gonna be the most proficient takedown."}, {"time": 5265, "text": "It always has been, I don't know, probably always will be, unless they figure out something different."}, {"time": 5271, "text": "The robot."}, {"time": 5272, "text": "The robot figures out something different."}, {"time": 5273, "text": "We're gonna shoot a lot of single legs."}, {"time": 5275, "text": "Because everyone's gonna do that, right?"}, {"time": 5278, "text": "So just like, say, an armbar or some type of sweep, right?"}, {"time": 5282, "text": "Why can't we go get 50 reps there?"}, {"time": 5283, "text": "Hey, by the time I've been in your jiu jitsu school for two years, I better know a fucking armbar."}, {"time": 5288, "text": "I better know it."}, {"time": 5289, "text": "So don't spend 10 minutes teaching me."}, {"time": 5291, "text": "Just tell me to go hit 50 reps. And then if, when I'm hitting my reps, if there's something I'm doing wrong, then just say, hey, Ben, move your leg a little bit that way or raise your hips up a little more, right?"}, {"time": 5301, "text": "Like, correct as you're drilling so you're getting all these reps at it so you're becoming more proficient."}, {"time": 5306, "text": "And then the other thing I really struggled with was, to your point during live, so many times it's just this five minute go, go, go."}, {"time": 5313, "text": "And that's not the most efficient way to learn because when you have two people, especially when they're focused on winning, and you say go, they're gonna go to wherever they do best."}, {"time": 5321, "text": "Well, if I'm trying to make you good at something, I don't want you doing what you do best all the time."}, {"time": 5325, "text": "I need you doing some other things, right?"}, {"time": 5327, "text": "If you have a great single leg but you can't shoot to the other side of the body, we need to work on that, right?"}, {"time": 5332, "text": "You need to start shooting the other side."}, {"time": 5334, "text": "There's some sense that you, it's not like you should be told what to work on but you should be told to work on the thing that you wanna work on."}, {"time": 5342, "text": "Meaning, I don't know, maybe you can comment on this, but everybody develops a different game as you get better and better."}, {"time": 5348, "text": "There's a set of things you need to be working on."}, {"time": 5351, "text": "So I actually have, like when I, especially when I'm training very seriously, I'll have a specific technique that I have in mind and I have a sheet of paper on the side where I literally, my head keep counting off how many times I put myself in that position and pulled off the technique."}, {"time": 5370, "text": "And that's all I care about in like training."}, {"time": 5372, "text": "So I'll just, whatever it is, if it's a guillotine, it's a guillotine, arm drag, arm drag, but I wanna make sure I don't, I love numbers, so I'll say like, I'll make sure I get 50 arm drags and I'm not getting off the mat until I do."}, {"time": 5389, "text": "And that, you know, if it takes."}, {"time": 5390, "text": "Any thrilling or live contest?"}, {"time": 5393, "text": "So in this, in the thing I'm describing right now is the live contest."}, {"time": 5396, "text": "But drilling, obviously, drilling."}, {"time": 5399, "text": "So I feel like I can't find a drilling part, like it's so hard to find drilling partners, even."}, {"time": 5405, "text": "It's annoying to me that this is boring."}, {"time": 5407, "text": "And there's nothing more annoying to me than the look of boredom on another person's face when we're drilling."}, {"time": 5413, "text": "It's like, don't you."}, {"time": 5414, "text": "Do you really think drilling's that beneficial to you?"}, {"time": 5415, "text": "Cause you said it's a job."}, {"time": 5418, "text": "And he thinks I'm an idiot, but yes."}, {"time": 5420, "text": "Why am I, am I an idiot?"}, {"time": 5421, "text": "Or why is this drilling beneficial?"}, {"time": 5423, "text": "Well, let's go with two trick questions."}, {"time": 5426, "text": "Why is it so beneficial?"}, {"time": 5428, "text": "I think for me, it's, there's a meditative aspect to it where the more you drill, the more you start noticing the details."}, {"time": 5440, "text": "Let me push back a little bit here."}, {"time": 5443, "text": "I'm not going to push back all the way."}, {"time": 5444, "text": "Cause every time, if I was wrestling, I'll warm up my head, crotch, shin, leg, whatever, right?"}, {"time": 5449, "text": "But even, so say like at a high level when I'm really wrestling, say 10 years ago, even during that drill portion, if we talk about the resistance of our opponent from zero to 100, it's very likely that my partner at that point, and this is people I'm really comfortable with, they're probably at least going 20 or 30, right?"}, {"time": 5467, "text": "They're probably giving me a certain look with the sprawl or, you know, I got to get through their hands."}, {"time": 5471, "text": "If I don't set it up right, they might put their arm down, right?"}, {"time": 5474, "text": "So it's like, we are drilling cause we're wrestling at a really low resistance level, but there's a little bit of sparring."}, {"time": 5481, "text": "The 20%, the 20, yeah, yeah."}, {"time": 5482, "text": "Yeah, so that's not really drilling."}, {"time": 5484, "text": "Cause I think it's drilling."}, {"time": 5485, "text": "I think literally you're shooting and I'm just going boom, I'm like, show me your dummy, boom, boom, boom, boom type of thing."}, {"time": 5491, "text": "No, but it's very hard to be a dummy that doesn't do 20%, so you're going to do 20%."}, {"time": 5495, "text": "Yeah, that's so, so yes, that's 20%."}, {"time": 5498, "text": "So that's like sparring a little bit then."}, {"time": 5500, "text": "No, but they're not really resisting."}, {"time": 5501, "text": "They're just giving you the right frame."}, {"time": 5503, "text": "They're giving you the right like movement and they're being an intelligent dummy, essentially."}, {"time": 5509, "text": "I mean, but also like the really important component of this is you pick the techniques for which is beneficial."}, {"time": 5516, "text": "If the technique is, has dynamic elements to it, you don't want to be doing that with, I'm saying like there's certain moves and I like those moves and I select the game base in those moves."}, {"time": 5528, "text": "So are you drilling to get better or are you drilling just to work out?"}, {"time": 5532, "text": "No, to get better."}, {"time": 5533, "text": "That's what I'm trying to tell you."}, {"time": 5534, "text": "I believe you can become like exceptionally good very fast by drilling."}, {"time": 5539, "text": "But how?"}, {"time": 5542, "text": "First of all, let me ask you an empirical question."}, {"time": 5544, "text": "Let me, have you actually drilled 10,000 times a particular move?"}, {"time": 5551, "text": "You haven't drilled millions."}, {"time": 5552, "text": "Hundreds of thousands, hundreds of thousands likely."}, {"time": 5554, "text": "I think you're just saying numbers."}, {"time": 5556, "text": "I don't think you know what 100,000."}, {"time": 5557, "text": "The numbers are freaking astronomical."}, {"time": 5559, "text": "It's way more than 10,000."}, {"time": 5559, "text": "I don't think you know what 100,000 feels like."}, {"time": 5561, "text": "Dude, there was a 10 year period where I wrestled every single day."}, {"time": 5564, "text": "That's 3,000 days, so you're telling me 10,000, that's only three of them a day."}, {"time": 5568, "text": "I do way more than that."}, {"time": 5570, "text": "Three of them."}, {"time": 5571, "text": "Probably 30 of them a day."}, {"time": 5572, "text": "That's 100,000."}, {"time": 5574, "text": "Yeah, hundreds of thousands."}, {"time": 5576, "text": "I doubt you did 30 a day for a particular technique."}, {"time": 5577, "text": "I did, for sure, 100%."}, {"time": 5582, "text": "Because some days I might do 100, right?"}, {"time": 5584, "text": "So 30 of 30 is not very many."}, {"time": 5585, "text": "Especially if we count all reps, if we're counting drilling and live."}, {"time": 5589, "text": "So like our college coaches would make us just drill a lot and I just hated it."}, {"time": 5592, "text": "So I would rebel and just kind of give a little spar."}, {"time": 5595, "text": "You shoot a high crotch, we'll start."}, {"time": 5597, "text": "Coach wants to drill a high crotch."}, {"time": 5598, "text": "Okay, we'll start."}, {"time": 5598, "text": "You shoot the high crotch, that's great."}, {"time": 5600, "text": "Then I'm gonna sit the corner or I'm gonna give you my hip or I'm gonna try something."}, {"time": 5604, "text": "So then you have to react."}, {"time": 5605, "text": "And I would argue that all skill level past the beginner stuff is some necessity of that, right?"}, {"time": 5614, "text": "I'm gonna do this, then what are you gonna do?"}, {"time": 5616, "text": "It's back and forth."}, {"time": 5617, "text": "I shoot a single leg, what are you gonna do?"}, {"time": 5618, "text": "I shoot a high crotch, what are you gonna do?"}, {"time": 5619, "text": "And you have to start unconsciously programming these things in your head."}, {"time": 5623, "text": "Because if you're too conscious to think about it, it's gonna be too slow to actually hit it at math."}, {"time": 5625, "text": "But the drilling is the unconscious programming."}, {"time": 5628, "text": "But the simple movement, the first simple movement, the first simple movement, that single leg or the high crotch or arm drag, whatever."}, {"time": 5635, "text": "Like I feel like the amount you're gonna get better at it is so minuscule compared to the amount you're gonna gain at doing other things around it."}, {"time": 5645, "text": "No, but that's the key word, you feel."}, {"time": 5649, "text": "That's your opinion."}, {"time": 5649, "text": "If we did a study on it, then I would be proven correct."}, {"time": 5653, "text": "No, perhaps."}, {"time": 5655, "text": "So first of all, your brain, as an exceptionally creative combat athlete, it's clear that you don't like the boredom of drilling."}, {"time": 5664, "text": "Like it's obvious that you have like, you're such a creative energy that you're just not going to be somebody who's going to enjoy that."}, {"time": 5672, "text": "So enjoyment is probably having an active mind is really important."}, {"time": 5676, "text": "So the question is, do you have the kind of makeup that has an active mind during a drilling on a dummy?"}, {"time": 5684, "text": "And I have that mind."}, {"time": 5687, "text": "Like I can."}, {"time": 5687, "text": "But do you really think, okay, so if you're, let's pick a technique."}, {"time": 5691, "text": "What technique do you want to drill on?"}, {"time": 5693, "text": "Are we doing jiu jitsu or wrestling?"}, {"time": 5696, "text": "It's hard to describe with words, but certain guard passes."}, {"time": 5700, "text": "Let me think, just guard pass."}, {"time": 5703, "text": "Okay, so you have a guard pass and you get it to be, I'd say nine and a half out of 10, right, just from a technical standpoint."}, {"time": 5709, "text": "Don't you think you need some resistance to feel?"}, {"time": 5712, "text": "Because essentially all benefit after that is going to be, what are they going to try to do to me?"}, {"time": 5718, "text": "And if they shift that way, do I need to sink here or move there?"}, {"time": 5721, "text": "So it's like, I actually think we're agreeing, but maybe terminology wise."}, {"time": 5727, "text": "Well, the split is the important thing."}, {"time": 5728, "text": "Like how much of each?"}, {"time": 5730, "text": "So I think it is spar."}, {"time": 5732, "text": "Like I think it's a very light touch spar is what you're talking about, which is in my opinion, really isn't drilling."}, {"time": 5738, "text": "And it's because drilling past the basic proficiency, I don't think brings much value."}, {"time": 5743, "text": "But that's what I'm trying to tell you is I think it does."}, {"time": 5745, "text": "I think doing that same movement, I think you begin to learn more over time."}, {"time": 5754, "text": "Like you're saying like once you get the basic proficiency, then there's a diminishing returns."}, {"time": 5762, "text": "I think everything has diminishing returns when you're learning a technique."}, {"time": 5766, "text": "But with something as complex as wrestling or grappling, if you can have way more gains over here, why focus on going from a 9.7 to a 9.8?"}, {"time": 5776, "text": "If this other area, if you're spending so much time here that this other area is left unexplored, you can make gigantic gains over there."}, {"time": 5783, "text": "No, but you're gonna lose."}, {"time": 5785, "text": "I think a lot depends on your style."}, {"time": 5788, "text": "I think a lot is determined by how good you are at one thing."}, {"time": 5793, "text": "And so if you wanna become a master of a particular thing and then make your whole game where it's all pulled into that system, then I don't know."}, {"time": 5801, "text": "I think one is too small of a number."}, {"time": 5802, "text": "Yeah, it's small."}, {"time": 5804, "text": "I feel like you can't be easily this, like I've."}, {"time": 5807, "text": "Yeah, you wanna funnel, you wanna create funnels."}, {"time": 5810, "text": "Funnels."}, {"time": 5810, "text": "Funnels, right?"}, {"time": 5811, "text": "Where everything goes into a few positions."}, {"time": 5812, "text": "And then it's all field."}, {"time": 5813, "text": "Where I feel you win 100%."}, {"time": 5815, "text": "But I feel you can get like drilling on a dummy 80% of the time and 20% of the time live rolling with people worse than you."}, {"time": 5828, "text": "Like a little bit worse than you."}, {"time": 5830, "text": "Or a lot worse than you."}, {"time": 5831, "text": "Yeah, so I think, I definitely think."}, {"time": 5833, "text": "So my buildup would be teach."}, {"time": 5837, "text": "So we're talking a complex technique, right?"}, {"time": 5839, "text": "So by the time we're talking about, we'll say a late high school kid who's pretty proficient, he's probably done the drilling part."}, {"time": 5846, "text": "So then now it's like, okay, if I wanna get something new to you, I'll probably tell you, you'll probably be able to do the basic premise within five to 10 minutes if they're good, right?"}, {"time": 5855, "text": "Do this, okay, they do it."}, {"time": 5856, "text": "Then it's like, okay, so now here from here, what we're gonna do, we're gonna go light sparring."}, {"time": 5860, "text": "So I know you have success."}, {"time": 5862, "text": "Cause I need you to complete the task in order to get better at it."}, {"time": 5864, "text": "That's something a lot of people in wrestling mess up, is they just wanna go with the toughest person."}, {"time": 5867, "text": "But if you go with the toughest person, you're not gonna actually execute on any skills."}, {"time": 5871, "text": "You're gonna get a workout and I need you to execute cause I need you to get good at this."}, {"time": 5875, "text": "In order to get good at it, you have to get all the way through the technique."}, {"time": 5877, "text": "Why do you need them to complete?"}, {"time": 5878, "text": "Just so they gain confidence in the technique or they go through all this stuff?"}, {"time": 5881, "text": "They have to feel all the way through."}, {"time": 5883, "text": "Like if I said, learn a high crotch when you're drilling but stop halfway every time."}, {"time": 5888, "text": "But you're not actually gonna be able to do it cause you're gonna stop, you're not gonna feel."}, {"time": 5892, "text": "So, you know, try it on someone, spar lightly, get it."}, {"time": 5896, "text": "Do it on someone who's not as good as you, get it."}, {"time": 5898, "text": "Then kind of work your way up the ladder so you can get it on someone your own skill level or maybe better than you, right, in a live competition."}, {"time": 5904, "text": "So it's like, I don't know, I feel like that basic drilling, so a kid like Keegan who I've brought up a few times, I feel like if there's something new, I could literally tell him, this is what I want you to do and he's such a great feeler, he could go drill it proficiently within probably a minute or two."}, {"time": 5920, "text": "But then to hit it on someone high level, that's gonna take quite a while longer."}, {"time": 5924, "text": "And that's a mix of drilling and sparring on people a little bit worse than you."}, {"time": 5929, "text": "Yeah, and then equal and then better, yeah."}, {"time": 5933, "text": "Yeah, because there's this, with grappling, there's such like a feel component to the pressure, the movement, all these things."}, {"time": 5940, "text": "And there's still, like I said, there's so many things you can throw at someone out of one position, not just moves, but moves at a different level of force or whatever."}, {"time": 5950, "text": "Are you and these kids developing like a big picture strategy of like, what are the main setups and take downs and just like a whole system?"}, {"time": 5961, "text": "So I kind of sent you our technique book, right, how we kind of go at approach it."}, {"time": 5966, "text": "So I think in wrestling, you're going to need, you're gonna need a handful of things just off the word go, right?"}, {"time": 5974, "text": "You're going to, so I think on our feet, I need to be able to take this out of the body."}, {"time": 5978, "text": "I need to be able to take that out of the body."}, {"time": 5980, "text": "I need to be able to bring you underneath me."}, {"time": 5982, "text": "I need to be able to go around you, right?"}, {"time": 5984, "text": "Now we can accomplish those different ways, but we should have all of those weapons if we wanna be really good some way, right?"}, {"time": 5991, "text": "So if I neglect one of those, so if I neglect the ability to say, pull you down, right?"}, {"time": 5994, "text": "Front lock you."}, {"time": 5996, "text": "Now, if I have a good shot and you're smart, you're just gonna lower your stance."}, {"time": 5999, "text": "So my shot is not gonna be as successful and I have the inability to pull you down, right?"}, {"time": 6003, "text": "So I kind of need all of those so I can, as they get better, I can point those things out."}, {"time": 6009, "text": "On bottom, my folks at bottom, there's certain things like you have to be good at leg right defense, right?"}, {"time": 6015, "text": "You have to, I mean, at a high level or you're just gonna, when you get it in, you're just getting stuck there."}, {"time": 6020, "text": "Not gonna be able to escape."}, {"time": 6022, "text": "But besides that, yeah, there's a multitude of things that you can choose from and I'm gonna, depending on your body style and what you're good and bad at, I'm gonna probably develop something a little different."}, {"time": 6032, "text": "I might give you, hey, you do the quad pod, you'd be better at the knee slide, whatever."}, {"time": 6038, "text": "Yeah, top, kind of same thing."}, {"time": 6040, "text": "I have to ask you about Khabib."}, {"time": 6042, "text": "So I remember a while ago Rogan said that that's the perfect fight for Khabib, you are."}, {"time": 6050, "text": "So let me ask two questions."}, {"time": 6052, "text": "The first, do you think you can beat him in an MMA match when you're at your peak?"}, {"time": 6056, "text": "Yeah, I don't like, yeah, I mean, it's one of those people where people will get really mad at me if I say yes, but yeah, I mean, I think."}, {"time": 6062, "text": "But how would you do it?"}, {"time": 6063, "text": "How would you solve that puzzle?"}, {"time": 6065, "text": "Yeah, I mean, we would grapple and I think I would be better than him."}, {"time": 6070, "text": "But you know, sometimes I feel weird saying this, people are like, yeah, right, you're full of shit."}, {"time": 6074, "text": "And, but that's no one out grappled him, right?"}, {"time": 6078, "text": "I mean, nobody did."}, {"time": 6078, "text": "And maybe I'm wrong on this, but if we look at the best possible candidates, I'm definitely one of them."}, {"time": 6085, "text": "And then obviously I have a small size advantage too."}, {"time": 6088, "text": "So in a wrestling match, so we can just reduce that MMA match to a wrestling match."}, {"time": 6093, "text": "What do you think is the right strategy on him?"}, {"time": 6095, "text": "Like, do you understand his style, his wrestling style, the pressure he applies?"}, {"time": 6101, "text": "Do you understand how the hell he makes it happen?"}, {"time": 6104, "text": "Yeah, I mean, he never, unfortunately, fought any real, who I would say, really, really high level wrestlers."}, {"time": 6110, "text": "I was actually really disappointed how bad Justin Gaethje's wrestling was, because Justin Gaethje had some solid success, but his wrestling was really bad in that fight."}, {"time": 6118, "text": "Gaethje had success in the NCAA?"}, {"time": 6120, "text": "Yeah, I think he was seventh place, maybe, or somewhere."}, {"time": 6123, "text": "He was definitely all American."}, {"time": 6125, "text": "It was lower though."}, {"time": 6129, "text": "So yeah, I would like to see how he dealt with someone who was like, who I think, oh man, this guy's a really high level wrestler."}, {"time": 6134, "text": "Because we saw, and this is early in his career, but Gleason Tebow did give him some issues earlier in his career."}, {"time": 6141, "text": "So I would like to see him in that situation and see how he does."}, {"time": 6143, "text": "I would love to, I just love wrestling and grappling."}, {"time": 6146, "text": "Yeah, I'd love this."}, {"time": 6147, "text": "Someone said, hey, Ben, Khabib wants to roll with you."}, {"time": 6150, "text": "Okay, I'm there tomorrow."}, {"time": 6152, "text": "It sounds like a blast."}, {"time": 6154, "text": "He's probably competitive as hell."}, {"time": 6156, "text": "You're still competitive?"}, {"time": 6157, "text": "I know when to be and when not to be."}, {"time": 6160, "text": "Say if I'm going to high school kids, or I'm not going to be competitive because then I'm just being a dick."}, {"time": 6165, "text": "How would you take him down?"}, {"time": 6169, "text": "What are we talking about, real wrestling?"}, {"time": 6169, "text": "Like wrestling, wrestling?"}, {"time": 6170, "text": "Wrestling, wrestling."}, {"time": 6171, "text": "I would probably try to take single legs and stuff."}, {"time": 6173, "text": "Single legs?"}, {"time": 6175, "text": "I haven't, okay."}, {"time": 6177, "text": "None, none."}, {"time": 6178, "text": "No, honestly, I don't have the slightest clue."}, {"time": 6181, "text": "I'd have to feel, I'd feel him out."}, {"time": 6183, "text": "But single legs is my best take on it."}, {"time": 6183, "text": "People talk about his wrestling being really good."}, {"time": 6186, "text": "People that train with him."}, {"time": 6187, "text": "So, okay, so I grilled someone, I will not say who, on the Ed Ruth thing, because Ed Ruth is very elite at folk style wrestling."}, {"time": 6195, "text": "He never became that great at fighting, unfortunately."}, {"time": 6197, "text": "Wait, Ed Ruth wrestled Khabib?"}, {"time": 6199, "text": "They were on the same team for a while, yeah."}, {"time": 6201, "text": "And there was rumors that Khabib beat him up."}, {"time": 6203, "text": "And I said, I sure can't believe that."}, {"time": 6207, "text": "And I've heard that that was, if they were just straight wrestling, Ed would get slightly the better of it."}, {"time": 6213, "text": "Well, Ed Ruth is like one of the greats."}, {"time": 6215, "text": "He's great."}, {"time": 6217, "text": "So that was what I heard."}, {"time": 6219, "text": "But in an MMA setting, because of all the tools that Khabib would get him."}, {"time": 6227, "text": "But I agree."}, {"time": 6228, "text": "I agree with Rogan on this one."}, {"time": 6229, "text": "That would have been good to see."}, {"time": 6230, "text": "Yeah, I'm fine."}, {"time": 6231, "text": "So yeah, if Khabib wants to work out, I'd love it."}, {"time": 6234, "text": "I love wrestling and grappling."}, {"time": 6236, "text": "I don't do much Jiu Jitsu because I just don't have time for it anymore."}, {"time": 6238, "text": "I'm at the Wrestling Academy like every single day."}, {"time": 6241, "text": "But yeah, I loved Jiu Jitsu while I did it."}, {"time": 6243, "text": "And if I didn't have Wrestling Academies, I probably would still be doing Jiu Jitsu."}, {"time": 6246, "text": "Yeah, you do well in Jiu Jitsu as well."}, {"time": 6249, "text": "But let me ask you a ridiculous question."}, {"time": 6252, "text": "Who's the greatest of all time, freestyle or folk style?"}, {"time": 6255, "text": "Oh, wrestling."}, {"time": 6255, "text": "Wrestling."}, {"time": 6257, "text": "Well, I will say my knowledge past like the year 2000 is really not that great."}, {"time": 6265, "text": "Because you can't be."}, {"time": 6266, "text": "Sorry, after 2000?"}, {"time": 6267, "text": "No, no, before."}, {"time": 6268, "text": "Because you can't find any film or anything, you know?"}, {"time": 6270, "text": "And so you hear of all these."}, {"time": 6271, "text": "So you need evidence?"}, {"time": 6272, "text": "You need direct evidence?"}, {"time": 6273, "text": "I want to be able to watch them and see them and feel the times and feel their opponents and all those things to really like, I hate giving bad answers, you know?"}, {"time": 6280, "text": "So there's just not enough footage of any of those people."}, {"time": 6284, "text": "You know, we go back to someone like Alexander Medved."}, {"time": 6287, "text": "Like, you can't find footage."}, {"time": 6288, "text": "You can't find anything on him, you know?"}, {"time": 6290, "text": "It's like, who is the wrestler?"}, {"time": 6293, "text": "So post 2000, I think, and obviously just freestyle."}, {"time": 6300, "text": "Americans, Russians?"}, {"time": 6301, "text": "Oh, it's just that T.F."}, {"time": 6301, "text": "has probably the best argument post 2000."}, {"time": 6304, "text": "Yeah, the Russian tank, that guy is, yeah."}, {"time": 6308, "text": "So who's better, Snyder or Sajilov?"}, {"time": 6311, "text": "So Sajilov just won at the Olympics."}, {"time": 6312, "text": "Now, I understand this."}, {"time": 6313, "text": "I don't understand how that works, but it's pretty close, right?"}, {"time": 6317, "text": "Not that match, but in general, the matchup."}, {"time": 6319, "text": "So, well, so Kyle won the first one in 17."}, {"time": 6322, "text": "Sajilov pinned him the following year."}, {"time": 6324, "text": "But then Kyle lost and took bronze in 19."}, {"time": 6328, "text": "And then just lost."}, {"time": 6330, "text": "I don't want to say fairly decisively, but it was six to three and it was a late take down."}, {"time": 6335, "text": "He kind of gave it up and maybe if it was really competitive, maybe he wouldn't have."}, {"time": 6340, "text": "They're gonna wrestle again in like two weeks here."}, {"time": 6343, "text": "So that, you know, yeah, I mean, you have to say Sajilov at this point."}, {"time": 6347, "text": "There's nothing else to say unless Kyle proves us otherwise."}, {"time": 6350, "text": "Yeah, not enough people talk about Sajilov."}, {"time": 6353, "text": "Okay, well, you think that guy should go to MMA?"}, {"time": 6357, "text": "You think Kyle should go to MMA?"}, {"time": 6359, "text": "Some of these guys."}, {"time": 6359, "text": "Yeah, they're making enough money in wrestling where they don't really feel the need to."}, {"time": 6363, "text": "It's terrifying though."}, {"time": 6364, "text": "It's a heavyweight, Sajilov would probably, it's like Khabib, but heavyweight."}, {"time": 6369, "text": "Well, I don't know if you remember, do you remember Bilal Makov?"}, {"time": 6372, "text": "So Bilal Makov actually was the Russian representative in both styles in 2016, Greco and freestyle."}, {"time": 6378, "text": "And he was, to my knowledge, the only person the UFC has ever signed that was zero and zero, in modern era, signed that was zero and zero."}, {"time": 6385, "text": "And then he actually never ended up fighting."}, {"time": 6388, "text": "But weird, right?"}, {"time": 6389, "text": "No motivation."}, {"time": 6391, "text": "I don't know what the story is."}, {"time": 6392, "text": "Cause sometimes out of Russia, I mean, maybe you have better sources than I do."}, {"time": 6395, "text": "Sometimes it feels like dudes just disappear."}, {"time": 6397, "text": "Like they're a world champ or a little big champ and then all of a sudden you're like, wait, where'd he go?"}, {"time": 6402, "text": "You talked shit about Russia earlier in the conversation."}, {"time": 6405, "text": "Oh, what'd I say?"}, {"time": 6406, "text": "I forgot, but I think."}, {"time": 6408, "text": "Steroids."}, {"time": 6409, "text": "I think somebody's gonna show up to your door."}, {"time": 6410, "text": "I'm worried."}, {"time": 6411, "text": "I honestly, I've said enough bad things where I would be a kind of looking over my shoulder if I wanted to do something."}, {"time": 6417, "text": "I, for one, love the Russians."}, {"time": 6421, "text": "What about Icarus?"}, {"time": 6424, "text": "It's fake news."}, {"time": 6427, "text": "It's propaganda?"}, {"time": 6429, "text": "I don't know what it is anymore."}, {"time": 6432, "text": "You know, it's troublesome, man."}, {"time": 6433, "text": "I hate cheating in all of its forms."}, {"time": 6436, "text": "Any other like recaps from the Olympics of 2020 Tokyo that stood out to you?"}, {"time": 6441, "text": "Gable Stephenson?"}, {"time": 6441, "text": "Like anything like that?"}, {"time": 6442, "text": "Gable's great."}, {"time": 6444, "text": "No, I think America's coming to the point where we're gonna compete with Russia every single year in wrestling, which obviously, you know, long, long time ago, many, many years ago we were great."}, {"time": 6456, "text": "And then kind of after that Soviet Union period, I think there was a lot of poverty in that area."}, {"time": 6461, "text": "And that kind of led the wrestling team going down a little bit."}, {"time": 6464, "text": "And then obviously a lot of those regions, the way they found oil and gas in the Caspian Sea, I believe."}, {"time": 6471, "text": "And they've been really kind of on the upswing for the last 20 years."}, {"time": 6474, "text": "And now America really, since 2012, has been on the upswing in wrestling."}, {"time": 6479, "text": "And we're kind of really competing with them."}, {"time": 6482, "text": "And they're not sending a couple of their best guys."}, {"time": 6484, "text": "So for those who don't know, the Olympics moved back a year."}, {"time": 6488, "text": "So they are hosting the 2021 World Championships, despite the fact that we just had the Olympics two months ago."}, {"time": 6493, "text": "So it's happening next week in Oslo, Norway."}, {"time": 6495, "text": "So like Russia's not sending their number one at 57 and their number one at 65."}, {"time": 6499, "text": "So it's like, America's probably gonna win, I think."}, {"time": 6503, "text": "I don't wanna guarantee anything, but there's a really good chance of it."}, {"time": 6506, "text": "Is Dave Taylor, all of those guys, competing?"}, {"time": 6508, "text": "America gave any of the Olympians that medaled the opportunity to not even have to wrestle off."}, {"time": 6513, "text": "They just got to keep the spot since it was two months later if they medaled."}, {"time": 6516, "text": "So the only one who's not is Gable."}, {"time": 6518, "text": "Gable's moving on."}, {"time": 6520, "text": "We have a pretty good guy behind him."}, {"time": 6521, "text": "Nick Wisniewski is a world medalist."}, {"time": 6524, "text": "But then he's, so Burrell's filled in the 79 spot."}, {"time": 6527, "text": "Jayden Cox filled in the 92 spot, who's a world champion also."}, {"time": 6530, "text": "So we have a pretty good squad."}, {"time": 6532, "text": "A hell of a team."}, {"time": 6532, "text": "Pretty good squad, yeah."}, {"time": 6534, "text": "Pretty good squad."}, {"time": 6534, "text": "Pretty happy."}, {"time": 6536, "text": "So given your run in Bellator in one championship, that was like one of the most dominant runs in MMA."}, {"time": 6543, "text": "What would you say was like key to your dominance in that long undefeated streak?"}, {"time": 6548, "text": "Huh, probably consistency would be one."}, {"time": 6552, "text": "The fact that I just, I lived and trained the same way no matter where my life was, whereas a lot of fighters, once they start making money for the first time, they have all these obligations and they travel and they really enjoy making money."}, {"time": 6564, "text": "And that's kind of why some of them fall off."}, {"time": 6567, "text": "So you had like the same process, like the same camp."}, {"time": 6569, "text": "Yeah, I stayed at my house."}, {"time": 6571, "text": "I didn't vacation, yeah, everything."}, {"time": 6573, "text": "Just, you know, and so that was a big part of it."}, {"time": 6577, "text": "Obviously the style thing is like, no one could, there was only a few people who could stop my style."}, {"time": 6584, "text": "And I think I continue to get better as a mixed martial artist."}, {"time": 6588, "text": "And I wasn't as innovative in mixed martial arts, but there was a handful of things that I innovated, you know, specifically in the top position where I spent a lot of time where it was just like, there was just, once I got on top of you, it was like in a spider web and there was just kind of no way out."}, {"time": 6605, "text": "You know, you never felt the certain things I was doing."}, {"time": 6608, "text": "And so people just, they gave up eventually."}, {"time": 6611, "text": "How's the level of wrestling in MMA would you say?"}, {"time": 6614, "text": "So I saw somewhere like champions, the most popular martial art for current UFC champions are all wrestling."}, {"time": 6624, "text": "So we just lost a bunch of the belts."}, {"time": 6627, "text": "Wrestling is a sport, right?"}, {"time": 6629, "text": "But yeah, at one point we had, I think it was eight of nine maybe or something to that effect."}, {"time": 6634, "text": "And I think it's not just wrestling, not just the actual martial art of wrestling that contributes to our success in mixed martial arts, but other things like the way we're systemized."}, {"time": 6646, "text": "So most kids who have all this have went through the high school program and the college program and they know how to show up on time and they know how to work hard."}, {"time": 6653, "text": "So when they go to ATT or AKA or wherever, they know how to show up on time and they know how to work hard and that's gonna get you a really long way."}, {"time": 6660, "text": "Just those two things, right?"}, {"time": 6661, "text": "Not even the techniques, it's just the discipline."}, {"time": 6663, "text": "Those things."}, {"time": 6664, "text": "Then I think you throw on top of that the fact that most of us have competed 1500 to 2000 times, probably by the time we get to 20 something, like that's a huge advantage too."}, {"time": 6673, "text": "Most of these other people from other disciplines maybe have competed 100, if that, right?"}, {"time": 6678, "text": "So we have this competitive process down really, really, really, really well."}, {"time": 6683, "text": "Plus the weight cut."}, {"time": 6684, "text": "The weight cut."}, {"time": 6684, "text": "There's all these things that factor into it."}, {"time": 6687, "text": "I think the fact that we're really open minded, I think if you would, I don't wanna pick on jiu jitsu again, but how many jiu jitsu guys have became highly proficient in wrestling versus how many wrestling guys have became highly proficient in jiu jitsu?"}, {"time": 6699, "text": "I think that number swings one way and not that much the other way, you know?"}, {"time": 6704, "text": "So we're open to adapting and learning and for some reason, like jiu jitsu people, how many of them have got high level wrestling?"}, {"time": 6714, "text": "Or even mediocre wrestling, the number's really small."}, {"time": 6717, "text": "They refuse to, it's really frustrating."}, {"time": 6720, "text": "Why won't they do this?"}, {"time": 6721, "text": "This is obviously a part of it."}, {"time": 6723, "text": "I don't wanna pick on specific guys, but there's certain guys in the history of MMA where you're like, listen, man."}, {"time": 6728, "text": "I mean, Damian Maia, who was my last fight, is a great example of somebody who actually did get proficient in wrestling, right?"}, {"time": 6735, "text": "But there's some of these jiu jitsu guys who's like, if you just got on top, you would submit him."}, {"time": 6738, "text": "Why can't you learn a freaking takedown?"}, {"time": 6740, "text": "Like, holy moly, just learn how to take someone down."}, {"time": 6743, "text": "Once you get them down, they will not get up and you win the fight."}, {"time": 6746, "text": "Like, it's so easy, you know?"}, {"time": 6748, "text": "But they refuse."}, {"time": 6749, "text": "How complicated is that journey?"}, {"time": 6750, "text": "So like Donaher that you mentioned, Craig Jones, they're big on wrestling as part of jiu jitsu now."}, {"time": 6756, "text": "Like wrestling, not just on the feet, but wrestling from the bottom coming up and all that kind of stuff."}, {"time": 6762, "text": "So how difficult is that whole skill set, would you say, for a jiu jitsu person to learn?"}, {"time": 6768, "text": "Not that hard."}, {"time": 6769, "text": "If they really put their mind to it."}, {"time": 6770, "text": "Cause they already like, when you grapple, and this is any grappling art, like there's a certain part of it that you kind of get and it can, it might not be the exact same thing, but you understand how your body moves and how to feel certain pressures and you can adapt yourself pretty quickly, you know?"}, {"time": 6784, "text": "So I don't think, I think there's a certain level of stubbornness where they didn't want to, certain people didn't want to do it for whatever reason."}, {"time": 6792, "text": "I think a lot of times in MMA, it's the I'm so macho, I can stand and bang thing, you know, where they want to show how macho they are."}, {"time": 6801, "text": "But yeah, that was a frustrating one that they, there's a lot of wrestlers who became highly proficient in jiu jitsu and really adapted and it doesn't go the other way."}, {"time": 6809, "text": "And then I guess the other thing there too is they can both steal from each other, right?"}, {"time": 6815, "text": "As any martial art can steal from another."}, {"time": 6818, "text": "And like, I feel like jiu jitsu didn't do enough stealing from wrestling."}, {"time": 6822, "text": "Like they should have looked at all the wrestling possible and said, well, why don't we steal that and that and that?"}, {"time": 6827, "text": "You know, and like, hey, let's take that over."}, {"time": 6828, "text": "And maybe we'd make a little tweak because it's different, but there's something we can definitely use there."}, {"time": 6833, "text": "So like in wrestling, for example, you know there's a one arm guillotine in jiu jitsu, right?"}, {"time": 6839, "text": "Okay, so there's a move called, well, it's got a hundred, I mean, it's like the oldest move in wrestling because it's what they did, the cows, where they go around the chin and they throw them on the back, how do we call that one?"}, {"time": 6848, "text": "Okay, sorry, did you just ask me what I call that one?"}, {"time": 6852, "text": "Would you take a cow and grab it by the neck, throw it to the side?"}, {"time": 6855, "text": "No, but in wrestling, in wrestling."}, {"time": 6858, "text": "Okay, we call it that."}, {"time": 6859, "text": "Are you putting it under?"}, {"time": 6860, "text": "Yeah, so you can grab their chin and then you go under their arm and then throw them on their back."}, {"time": 6863, "text": "Oh, okay, gotcha, yeah."}, {"time": 6864, "text": "Yeah, so we call that the honey badger, but it's got different names, wherever you go, it's got different names."}, {"time": 6870, "text": "So I would always, I would say like pre Jiu Jitsu, I was average at it, like I could do it, but against good people, you'd never get it for, because they would get the back of their head up and they were too strong where you couldn't collapse them by going over their neck, right?"}, {"time": 6885, "text": "Because the forces weren't right."}, {"time": 6886, "text": "So then in Jiu Jitsu, you learn the one arm gi team where you grab their chin and this is more of running along the side of their head and then you go here and you choke them, right?"}, {"time": 6895, "text": "Much more efficient way to move their head because the fulcrum is way down here and their head can move into that, right?"}, {"time": 6902, "text": "So once I learned that in Jiu Jitsu, I'm like, wait, I can do this in wrestling."}, {"time": 6907, "text": "So now once I learn how to grab their chin the right way and I do the honey badger, no one ever gets out."}, {"time": 6912, "text": "I just had to steal that Jiu Jitsu, put it in wrestling and boom, there we go."}, {"time": 6916, "text": "But very few people steal any direction, that takes creativity."}, {"time": 6920, "text": "And open mindedness."}, {"time": 6921, "text": "It's so easy because it's already done, you just gotta steal it."}, {"time": 6923, "text": "I mean, same with Judo, if you're a gi Jiu Jitsu person, there's so much stuff in Judo that's ripe for the stealing because Judo is much more emphasizes explosive moves on the transition, which is something Jiu Jitsu does not do."}, {"time": 6942, "text": "Because you have some."}, {"time": 6943, "text": "You mean from the take down to."}, {"time": 6944, "text": "From the take down, but also just in general, just in the transition, the concept of transition, the Jiu Jitsu is very much about we're in this position, then we're in this position, then we're in this position."}, {"time": 6956, "text": "The Judo is much more in when there's chaos of any kind."}, {"time": 6962, "text": "That's when you need to strike."}, {"time": 6964, "text": "And to learn that, I mean, that's why people like Travis Stevens and Judoka, when they go to Jiu Jitsu, they can dominate."}, {"time": 6970, "text": "But Jiu Jitsu people should steal that."}, {"time": 6973, "text": "They're too stubborn."}, {"time": 6974, "text": "Yeah, but so is every, wrestlers are stubborn too."}, {"time": 6977, "text": "No way, there would never be any stubborn wrestlers."}, {"time": 6981, "text": "Well, I mean, I was surprised, all these coaches, John Smith, Dan Gabel, they don't really have interest in MMA or Jiu Jitsu and so on."}, {"time": 6991, "text": "But you would think somebody like a John Smith would like put on a white belt and roll around."}, {"time": 6996, "text": "Yeah, I think he's just too focused on, you know."}, {"time": 6999, "text": "Well, he's a coach."}, {"time": 7000, "text": "Well, he's a coach and what he's doing."}, {"time": 7001, "text": "Yeah, I mean, yeah, I think if you take him when he's younger, he would have a lot of fun."}, {"time": 7006, "text": "We actually have a really good wrestler making his MMA debut tomorrow."}, {"time": 7008, "text": "I don't know if you, Bo Nickel, I'm sure you've heard of him, very high level."}, {"time": 7011, "text": "I think he's gonna have a lot of success."}, {"time": 7014, "text": "I mean, some people might say that like Jiu Jitsu makes you a little comfortable being in your back and for a wrestler, that could be like really bad."}, {"time": 7023, "text": "I hate that take."}, {"time": 7025, "text": "Yeah, but that's the Dan Gabel take."}, {"time": 7027, "text": "It's so stupid, it's so stupid."}, {"time": 7029, "text": "For God's sakes, we know the fucking rules."}, {"time": 7032, "text": "Just, in wrestling, you don't go to your back."}, {"time": 7033, "text": "In Jiu Jitsu, you can, it's like, whatever."}, {"time": 7037, "text": "But like, so Jiu Jitsu, for example, so I coached, when I was at Rufus, I coached the wrestling for a long, I don't know, three, four, five years."}, {"time": 7045, "text": "So I've been taking a Jiu Jitsu guy and teaching them a wrestling technique where you needed to use your feet."}, {"time": 7053, "text": "To teach a Jiu Jitsu guy, so easy, so simple, because they already understand the concept, butterfly guard, et cetera, et cetera, et cetera, right?"}, {"time": 7059, "text": "To take a wrestler who's never done any of it and teach him how to use his feet, oh my God, it's such a beast, it's so hard, because that's not a weapon they're thinking about using."}, {"time": 7069, "text": "So it's like, we understand the rules."}, {"time": 7071, "text": "It's like freestyle folks are wrestling."}, {"time": 7072, "text": "Freestyle, if I'm on the mat, I can lock my hands."}, {"time": 7075, "text": "You don't see people locking their hands all the time in folk style just because they did freestyle."}, {"time": 7078, "text": "It's like, they get it."}, {"time": 7079, "text": "There's a rule, they understand it."}, {"time": 7080, "text": "So the notion that somehow you come from on your back."}, {"time": 7084, "text": "But pinning, that's like a, it has a special meaning."}, {"time": 7088, "text": "Yeah, but I actually think, so Jiu Jitsu, you don't actually wanna be flat, flat very often, right?"}, {"time": 7096, "text": "You don't wanna be."}, {"time": 7097, "text": "I always wondered this, because I did a couple of catch wrestling tournaments, and I did, I would put myself in butterfly guard, and I wasn't going against good people, so which is why I was doing all these things."}, {"time": 7110, "text": "But I wondered if you could create a system of wrestling where you're butterfly guard."}, {"time": 7117, "text": "So I think that there's a few places where I use it."}, {"time": 7120, "text": "But so specifically the Elevator Series, which my main series up bottom, it is, it's not butterfly guard."}, {"time": 7125, "text": "It's a butterfly guard grip with your foot."}, {"time": 7127, "text": "So I boom, I go here, I catch your leg with my foot, boom, and I elevate you over, right?"}, {"time": 7133, "text": "And then also sometimes, I think Keegan does this too from watching me, but if I get double leg, sometimes if I'm accepting, so freestyle, obviously you're gonna give him points, you're gonna focus on accepting that you've already got me, and as I go down, I'm just gonna butterfly guard you up, and then I'm gonna try to flip my hip back to the mat, and end up in a wizard position."}, {"time": 7153, "text": "I've used that quite a few times, where it's kind of like a bailout mechanism that gets me back to maybe not a great position, but obviously much better than being taken down."}, {"time": 7164, "text": "Let me ask you quickly about crypto, because you're also, you have a show."}, {"time": 7170, "text": "You have a lot of interest in cryptocurrency."}, {"time": 7173, "text": "Why are you interested in cryptocurrency?"}, {"time": 7176, "text": "Is it just a financial investment, or is there a philosophy that attracts you to it?"}, {"time": 7180, "text": "So I, my friend told me about it in 2017."}, {"time": 7184, "text": "I was actually, I went to, I was, my friend met me in Shanghai."}, {"time": 7187, "text": "I fought in one championship, and he told me, and the second he told me, I'm like, oh, I'm so in, because I had read Ron Paul and the Fed."}, {"time": 7196, "text": "I had read, I kind of had an understanding how the Fed is unfair, and so when he told me about crypto, this decentralized system that no one has control over, it just made sense, and so we've had the podcast, to say Michael Saylor on it, and I love the way he says it."}, {"time": 7211, "text": "It's like, who do you trust more with your money?"}, {"time": 7213, "text": "Do you trust the politicians, or do you trust engineers?"}, {"time": 7216, "text": "I think that's an easy choice."}, {"time": 7218, "text": "I don't even think, I don't even think I have to think about that."}, {"time": 7220, "text": "I don't trust politicians, no matter what country they come from, China, America, wherever, I don't trust them."}, {"time": 7226, "text": "So what about in 2017, what was it, Bitcoin?"}, {"time": 7233, "text": "Are you, what do you find, which ones do you find interesting?"}, {"time": 7238, "text": "There's all kinds of ideas, there's the more sort of primal mechanism of proof of work and Bitcoin, and then there's smart contracts, ideas, and there's all kinds of innovations across the different points."}, {"time": 7253, "text": "So I can't say I'm in super deep where I understand the technical components of a lot of them."}, {"time": 7257, "text": "I understand what Bitcoin can do for people, and so that's probably the one I've focused the most on."}, {"time": 7263, "text": "And I actually, I think I was talking about, I was trying to convince Michael to talk about Bitcoin because he hates it also, what he did last night."}, {"time": 7269, "text": "And I think most of the main problems Bitcoin solves, people in America are so American centric, they don't understand it."}, {"time": 7276, "text": "So like high levels of inflation, that hasn't happened in, it's starting to happen, it hasn't happened in America in a long time, right?"}, {"time": 7281, "text": "But someone in Venezuela is like, oh, I get that, you know, or remittance payments, right?"}, {"time": 7287, "text": "Remittance payments to, you see it."}, {"time": 7290, "text": "So I saw this in, when I was spending all the time in Singapore, Singapore is obviously a really wealthy country, and so you'd have Indonesian workers or Filipino, and they would all go on Sundays, they would go to these places to ship stuff back to their families and through Western Union, Western Union gouges the shit out of these people."}, {"time": 7306, "text": "I mean, they're taking eight, 10, 12% of whatever they're sending, then it takes five days and the person's gonna go pick it up, whereas Bitcoin, I could send you Bitcoin person to person, right?"}, {"time": 7316, "text": "So like American people don't understand that."}, {"time": 7319, "text": "American people don't really understand the unbanked, right?"}, {"time": 7321, "text": "A decent portion of the world is unbanked, they don't have access to it."}, {"time": 7324, "text": "And a much, much, much smaller portion of the world doesn't have access to internet."}, {"time": 7328, "text": "So if I can put a mobile wallet on your phone, and we can send money person to person."}, {"time": 7333, "text": "So there's a whole bunch of those problems where Americans don't really think about that are really obvious that this solves."}, {"time": 7340, "text": "So I think that's a key one, obviously the fact that the value goes up is really outstanding also, but if you look at it, I got in in 2017, so I got to watch it go up."}, {"time": 7351, "text": "I didn't sell shit at the top, really stupid."}, {"time": 7354, "text": "And then the majority of my time was spent through the bear market."}, {"time": 7357, "text": "And so I had to love it for the principles that it provided, not the fact that I actually lost money in the beginning and now I'm way up, but yeah."}, {"time": 7365, "text": "So I think that."}, {"time": 7366, "text": "And you're just holding."}, {"time": 7367, "text": "Just holding."}, {"time": 7368, "text": "I think at the top of this bull market, I'll probably sell a very small portion, just to."}, {"time": 7373, "text": "So you mean like right now there's a bull market?"}, {"time": 7376, "text": "Yeah, most people think say in the next three to six months we'll be at the top of the market."}, {"time": 7380, "text": "And so probably when that happens, I'll probably sell a little bit."}, {"time": 7384, "text": "You gotta hodl it, Ben."}, {"time": 7386, "text": "You gotta hodl."}, {"time": 7387, "text": "So here's what I am."}, {"time": 7388, "text": "So one of my podcast cohosts, he's like super rich, like super rich."}, {"time": 7393, "text": "So he has lost touch with the every man."}, {"time": 7396, "text": "So here's my argument to him, it's really simple."}, {"time": 7399, "text": "And listen, I'm doing well for myself in life, but if say someone buys a Bitcoin, right?"}, {"time": 7404, "text": "One Bitcoin at $5,000, which it was last year."}, {"time": 7407, "text": "And this Bitcoin goes from $5,000 to $200,000, which is right around what a lot of people think the peak is going to be."}, {"time": 7415, "text": "They bought one Bitcoin."}, {"time": 7416, "text": "And they're living in a $200,000 house."}, {"time": 7419, "text": "So to take half of that, right?"}, {"time": 7422, "text": "You started with $5,000 of the Bitcoin, to sell half a Bitcoin for $100,000 and pay off your house, your remaining house payment, that's life changing to someone."}, {"time": 7432, "text": "And so you still have a Bitcoin, so if Bitcoin goes to a million, you're still gonna have half a million, and you're gonna feel really, really rich with that half a million dollars because you bought it for effing $2,500, you know?"}, {"time": 7442, "text": "So yeah, so I would encourage anyone who's not uber rich to, if you have huge profits, take a little bit of them because it could change your life."}, {"time": 7451, "text": "And if you hold it and it goes down, you're going to feel the pain of that."}, {"time": 7456, "text": "Like sometimes if you're more constrained financially, it's much more psychologically difficult to ride the ups and downs."}, {"time": 7462, "text": "Yeah, it is for sure."}, {"time": 7463, "text": "So they have these really fascinating things in Bitcoin."}, {"time": 7466, "text": "Actually, one of the main guys on our podcast, it's called Onchain Metrics."}, {"time": 7471, "text": "So all wallet transactions are visible, you know?"}, {"time": 7474, "text": "And so they have all these fun categories."}, {"time": 7477, "text": "So I think you said you don't like numbers, but."}, {"time": 7479, "text": "I like numbers."}, {"time": 7480, "text": "Oh, you love numbers."}, {"time": 7481, "text": "So I love numbers also."}, {"time": 7482, "text": "So they have all these different categories."}, {"time": 7484, "text": "Like you can see how long a wallet has held a Bitcoin, or how many Bitcoins are in a certain wallet."}, {"time": 7491, "text": "And so what they've seen during the downturn, so April it kind of peaked and went down, is that the whales are still buying."}, {"time": 7498, "text": "So whales, people of a thousand or more are still buying."}, {"time": 7501, "text": "They've said the main group of sellers is the ones who held it from zero to three months."}, {"time": 7506, "text": "So like they don't have money."}, {"time": 7507, "text": "They bought it because they thought it was going up."}, {"time": 7509, "text": "And I was like, oh shit, I got to sell it, right?"}, {"time": 7511, "text": "Whereas anyone who's held it for a long time is generally still holding on to it."}, {"time": 7516, "text": "That's a good indicator, right, for the whole space."}, {"time": 7520, "text": "Well, let me ask you for some advice."}, {"time": 7521, "text": "You've been through one heck of a career, one heck of a life."}, {"time": 7528, "text": "Well, in wrestling, I think wrestling's really a microcosm of what your life's going to be."}, {"time": 7533, "text": "And that's why one of the things I stress to kids is like, if we can go through this now and figure, I have a couple of kids who are struggling with certain things right now."}, {"time": 7540, "text": "If you can figure it out this now in wrestling, it's going to be a lot better to figure it out now and get over this mental hump than when you're 32 and you have two kids, right, and your job's not going well."}, {"time": 7550, "text": "It's going to be a lot worse."}, {"time": 7551, "text": "It's going to be a lot more painful then."}, {"time": 7552, "text": "Let's fucking figure it out now."}, {"time": 7554, "text": "So a lot of these things, a lot of these lessons we can learn from wrestling, whether it's persistence or perseverance or work ethic, or, you know what I said, wrestlers show up on time and they work hard, right?"}, {"time": 7563, "text": "These things, if we can learn these things at an early age, those are general, those characteristics will generally carry on throughout our life."}, {"time": 7570, "text": "And those are the things that are going to make us really successful."}, {"time": 7572, "text": "So, you know, I would say find a great coach, someone who's going to spend a lot of time and put a lot of time into you and make sure they have a lot of wisdom and steal all the wisdom that you can from them."}, {"time": 7582, "text": "And then if you can be successful at one thing, generally whatever that recipe was that took you to be successful at that, apply it to everything else, right?"}, {"time": 7591, "text": "Apply it to the rest of your life."}, {"time": 7592, "text": "Apply it to getting a wife that you enjoy."}, {"time": 7596, "text": "Apply it to living in a place you want to live, doing a job you want to do, right?"}, {"time": 7600, "text": "There's so many possibilities and you just have to be bold enough to go take those chances."}, {"time": 7605, "text": "It's interesting because early on in life is when you have much more time."}, {"time": 7609, "text": "People don't realize it's time to learn the lessons."}, {"time": 7613, "text": "Like somehow later in life, you get busier, responsibilities and all that kind of stuff."}, {"time": 7618, "text": "Like high school is a magical time."}, {"time": 7620, "text": "You're in college."}, {"time": 7621, "text": "You're in college, yeah, for sure."}, {"time": 7621, "text": "Yeah, there's so much time to learn."}, {"time": 7625, "text": "Well, you don't even have kids yet."}, {"time": 7627, "text": "Yeah, I don't have kids, but that still fills up."}, {"time": 7629, "text": "Well, no, I'm purpose."}, {"time": 7630, "text": "And I did something that many people don't seem to be able to do."}, {"time": 7633, "text": "I walked away from a lot of responsibilities."}, {"time": 7637, "text": "By saying goodbye."}, {"time": 7639, "text": "But meetings, everybody around me at MIT was like meetings fill the day."}, {"time": 7645, "text": "And then you have more projects and you do a great job and you become successful."}, {"time": 7650, "text": "And then the more meetings fill the day and more responsibilities as opposed to like, wait a minute, do I want to be involved in all these things?"}, {"time": 7658, "text": "And instead, do I want to find one or two things to really focus on?"}, {"time": 7663, "text": "And that's what I choose."}, {"time": 7666, "text": "But that becomes harder and harder and harder as you get older."}, {"time": 7670, "text": "No, I mean, I'm sure, and also the more success you have, you become sought after other places too."}, {"time": 7676, "text": "I'm sure that's happening with you."}, {"time": 7677, "text": "And it's hard to keep saying no, no, no."}, {"time": 7680, "text": "Saying no is hard."}, {"time": 7683, "text": "You're known for roasting people with a single boom roasted line."}, {"time": 7688, "text": "So any ideas, maybe you want to mention malice, but any ideas come to mind when you look at me?"}, {"time": 7694, "text": "Man, you know what?"}, {"time": 7697, "text": "If I was going to boom roast someone, I would want to kind of like research their career and dissect them and figure out their biggest negatives."}, {"time": 7703, "text": "Get to the core."}, {"time": 7704, "text": "And I didn't have that notion with you."}, {"time": 7705, "text": "I figured, you know, I got a general sense of, okay, he's really successful, he's super sharp."}, {"time": 7710, "text": "He's really interested in some really interesting things."}, {"time": 7712, "text": "I bet we'll have a great conversation, but I had no intention to roast you."}, {"time": 7717, "text": "What about malice?"}, {"time": 7718, "text": "You had dinner with him last night."}, {"time": 7719, "text": "Hmm, for him."}, {"time": 7724, "text": "How'd you get to know him, by the way?"}, {"time": 7726, "text": "Just Twitter."}, {"time": 7727, "text": "Where's the most magical place in the world, right?"}, {"time": 7729, "text": "I always tell people it's the greatest source of information if you know how to use it."}, {"time": 7734, "text": "He's insane on Twitter, actually."}, {"time": 7736, "text": "He's quite a lot."}, {"time": 7737, "text": "So I had to unfollow him on Twitter, because he was too much."}, {"time": 7739, "text": "It was too intense?"}, {"time": 7740, "text": "No, it was too much, it fills up."}, {"time": 7741, "text": "Like, I want to be able to consume the content."}, {"time": 7743, "text": "So if I want to see something he says, I can go to his page, right?"}, {"time": 7746, "text": "But it's just too much for my timeline."}, {"time": 7748, "text": "I want to be able to consume who I follow."}, {"time": 7750, "text": "So I try to not follow a lot of people, because I want to be able to consume them."}, {"time": 7753, "text": "And he was too much."}, {"time": 7756, "text": "He fights the trolls, which, I don't know why you'd ever fight the trolls."}, {"time": 7760, "text": "There's just too many of them."}, {"time": 7761, "text": "Well, he's a troll himself."}, {"time": 7762, "text": "He's like the big troll fighting the little trolls."}, {"time": 7765, "text": "He's the king troll."}, {"time": 7767, "text": "There's a million of them."}, {"time": 7767, "text": "So even if you kill 100,000, there's still not 100,000 left."}, {"time": 7771, "text": "You just gotta ignore them."}, {"time": 7773, "text": "It's like the Nightwalker or whatever."}, {"time": 7776, "text": "Well, I'll take it, because you had nothing, you couldn't rose GSP out of respect, too."}, {"time": 7781, "text": "So I'm just going to take that as a sign of respect."}, {"time": 7783, "text": "What do you say bad about GSP?"}, {"time": 7785, "text": "Now I try to rose his hair."}, {"time": 7786, "text": "Like, why are you trying to grow hair now after all these years?"}, {"time": 7789, "text": "He looked good, bald."}, {"time": 7790, "text": "Everyone loved him with his head shaved."}, {"time": 7793, "text": "Now it looks kind of strange."}, {"time": 7793, "text": "Like, why you got hair now?"}, {"time": 7795, "text": "Well, it was one of the more surreal moments of my life."}, {"time": 7797, "text": "So he was here and he wore a black suit and tie."}, {"time": 7803, "text": "Yeah, we did the podcast with him, just mirror image of me."}, {"time": 7806, "text": "And then we also did, I haven't released it yet, but just the video together."}, {"time": 7809, "text": "And I was doing a martial arts stuff in a suit and tie."}, {"time": 7813, "text": "That was quite, that was quite, that's like, like certain moments in your life are just like, I can't believe I was part of that."}, {"time": 7822, "text": "Yeah, with GSP, so yeah, I don't think I have anything to rose him about."}, {"time": 7828, "text": "I mean, maybe the Matt Serra thing would be the one that you could get him with, you know?"}, {"time": 7832, "text": "I would be really fascinated, like really dig deep from a sports psychology standpoint, because he always talks about how much fear he had when he was competing."}, {"time": 7840, "text": "And I find that to be interesting because obviously, so it's almost like, to me, it's almost like, was he successful despite that?"}, {"time": 7848, "text": "Not because of that, right?"}, {"time": 7850, "text": "And because anxiety usually leads to really negative performance for the majority of people."}, {"time": 7855, "text": "And what was it about him that the anxiety wasn't super negative?"}, {"time": 7860, "text": "Like, it's very interesting."}, {"time": 7862, "text": "I wonder that too."}, {"time": 7863, "text": "So I have, I wondered that about him, but I have a huge amount of anxiety interacting, especially with people, just about everything, yeah."}, {"time": 7870, "text": "I wonder if that's helpful or not."}, {"time": 7873, "text": "It feels like it's very helpful."}, {"time": 7875, "text": "Well, I think, so okay, I think in two different ways."}, {"time": 7877, "text": "So I think probably your everyday life, okay, is different than like in a performance or a competition."}, {"time": 7885, "text": "You have to be like super in the moment of what you're doing."}, {"time": 7888, "text": "So anything that's pulling you away, like, oh my gosh, you know, for high school kids, right, that coach."}, {"time": 7893, "text": "Oh my gosh, that girl's in the stands, and if I get beat, then, and they're actively thinking about this other thing when this is going on."}, {"time": 7901, "text": "And I need 100% of your focus right here."}, {"time": 7904, "text": "He's never, I don't think he has anxiety in the ring."}, {"time": 7907, "text": "I think, like, I have the same thing."}]}]