[{"title": "Max Tegmark: Life 3.0 | Lex Fridman Podcast #1", "id": "Gi8LUnhP5yU", "quotes": [{"time": 333, "text": "I think it's much more prudent to say, let's be really grateful for this amazing opportunity we've had and make the best of it just in case it is down to us."}, {"time": 344, "text": "So from a physics perspective, do you think intelligent life, so it's unique from a sort of statistical view of the size of the universe, but from the basic matter of the universe, how difficult is it for intelligent life to come about?"}, {"time": 359, "text": "The kind of advanced tech building life is implied in your statement that it's really difficult to create something like a human species."}, {"time": 367, "text": "Well, I think what we know is that going from no life to having life that can do a level of tech, there's some sort of two going beyond that than actually settling our whole universe with life."}, {"time": 382, "text": "There's some major roadblock there, which is some great filter as it's sometimes called, which is tough to get through."}, {"time": 393, "text": "It's either that roadblock is either behind us or in front of us."}, {"time": 398, "text": "I'm hoping very much that it's behind us."}, {"time": 401, "text": "I'm super excited every time we get a new report from NASA saying they failed to find any life on Mars."}, {"time": 408, "text": "I'm like, yes, awesome."}, {"time": 410, "text": "Because that suggests that the hard part, maybe it was getting the first ribosome or some very low level kind of stepping stone so that we're home free."}, {"time": 420, "text": "Because if that's true, then the future is really only limited by our own imagination."}, {"time": 425, "text": "It would be much suckier if it turns out that this level of life is kind of a dime a dozen, but maybe there's some other problem."}, {"time": 432, "text": "Like as soon as a civilization gets advanced technology, within a hundred years, they get into some stupid fight with themselves and poof."}, {"time": 440, "text": "That would be a bummer."}, {"time": 441, "text": "Yeah, so you've explored the mysteries of the universe, the cosmological universe, the one that's sitting between us today."}, {"time": 451, "text": "I think you've also begun to explore the other universe, which is sort of the mystery, the mysterious universe of the mind of intelligence, of intelligent life."}, {"time": 462, "text": "So is there a common thread between your interest or the way you think about space and intelligence?"}, {"time": 468, "text": "Oh yeah, when I was a teenager, I was already very fascinated by the biggest questions."}, {"time": 477, "text": "And I felt that the two biggest mysteries of all in science were our universe out there and our universe in here."}, {"time": 485, "text": "So it's quite natural after having spent a quarter of a century on my career, thinking a lot about this one, that I'm now indulging in the luxury of doing research on this one."}, {"time": 495, "text": "It's just so cool."}, {"time": 497, "text": "I feel the time is ripe now for you trans greatly deepening our understanding of this."}, {"time": 505, "text": "Just start exploring this one."}, {"time": 506, "text": "Yeah, because I think a lot of people view intelligence as something mysterious that can only exist in biological organisms like us, and therefore dismiss all talk about artificial general intelligence as science fiction."}, {"time": 521, "text": "But from my perspective as a physicist, I am a blob of quarks and electrons moving around in a certain pattern and processing information in certain ways."}, {"time": 530, "text": "And this is also a blob of quarks and electrons."}, {"time": 533, "text": "I'm not smarter than the water bottle because I'm made of different kinds of quarks."}, {"time": 537, "text": "I'm made of up quarks and down quarks, exact same kind as this."}, {"time": 541, "text": "There's no secret sauce, I think, in me."}, {"time": 545, "text": "It's all about the pattern of the information processing."}, {"time": 548, "text": "And this means that there's no law of physics saying that we can't create technology, which can help us by being incredibly intelligent and help us crack mysteries that we couldn't."}, {"time": 561, "text": "In other words, I think we've really only seen the tip of the intelligence iceberg so far."}, {"time": 566, "text": "Yeah, so the perceptronium."}, {"time": 571, "text": "So you coined this amazing term."}, {"time": 573, "text": "It's a hypothetical state of matter, sort of thinking from a physics perspective, what is the kind of matter that can help, as you're saying, subjective experience emerge, consciousness emerge."}, {"time": 584, "text": "So how do you think about consciousness from this physics perspective?"}, {"time": 589, "text": "Very good question."}, {"time": 590, "text": "So again, I think many people have underestimated our ability to make progress on this by convincing themselves it's hopeless because somehow we're missing some ingredient that we need."}, {"time": 605, "text": "There's some new consciousness particle or whatever."}, {"time": 609, "text": "I happen to think that we're not missing anything and that it's not the interesting thing about consciousness that gives us this amazing subjective experience of colors and sounds and emotions."}, {"time": 623, "text": "It's rather something at the higher level about the patterns of information processing."}, {"time": 628, "text": "And that's why I like to think about this idea of perceptronium."}, {"time": 634, "text": "What does it mean for an arbitrary physical system to be conscious in terms of what its particles are doing or its information is doing?"}, {"time": 643, "text": "I don't think, I hate carbon chauvinism, this attitude you have to be made of carbon atoms to be smart or conscious."}, {"time": 650, "text": "There's something about the information processing that this kind of matter performs."}, {"time": 655, "text": "Yeah, and you can see I have my favorite equations here describing various fundamental aspects of the world."}, {"time": 660, "text": "I feel that I think one day, maybe someone who's watching this will come up with the equations that information processing has to satisfy to be conscious."}, {"time": 668, "text": "I'm quite convinced there is big discovery to be made there because let's face it, we know that so many things are made up of information."}, {"time": 678, "text": "We know that some information processing is conscious because we are conscious."}, {"time": 685, "text": "But we also know that a lot of information processing is not conscious."}, {"time": 688, "text": "Like most of the information processing happening in your brain right now is not conscious."}, {"time": 692, "text": "There are like 10 megabytes per second coming in even just through your visual system."}, {"time": 698, "text": "You're not conscious about your heartbeat regulation or most things."}, {"time": 702, "text": "Even if I just ask you to like read what it says here, you look at it and then, oh, now you know what it said."}, {"time": 708, "text": "But you're not aware of how the computation actually happened."}, {"time": 711, "text": "Your consciousness is like the CEO that got an email at the end with the final answer."}, {"time": 716, "text": "So what is it that makes a difference?"}, {"time": 721, "text": "I think that's both a great science mystery."}, {"time": 725, "text": "We're actually studying it a little bit in my lab here at MIT, but I also think it's just a really urgent question to answer."}, {"time": 732, "text": "For starters, I mean, if you're an emergency room doctor and you have an unresponsive patient coming in, wouldn't it be great if in addition to having a CT scanner, you had a consciousness scanner that could figure out whether this person is actually having locked in syndrome or is actually comatose."}, {"time": 753, "text": "And in the future, imagine if we build robots or the machine that we can have really good conversations with, which I think is very likely to happen."}, {"time": 764, "text": "Wouldn't you want to know if your home helper robot is actually experiencing anything or just like a zombie, I mean, would you prefer it?"}, {"time": 773, "text": "What would you prefer?"}, {"time": 774, "text": "Would you prefer that it's actually unconscious so that you don't have to feel guilty about switching it off or giving boring chores or what would you prefer?"}, {"time": 782, "text": "Well, certainly we would prefer, I would prefer the appearance of consciousness."}, {"time": 788, "text": "But the question is whether the appearance of consciousness is different than consciousness itself."}, {"time": 795, "text": "And sort of to ask that as a question, do you think we need to understand what consciousness is, solve the hard problem of consciousness in order to build something like an AGI system?"}, {"time": 808, "text": "No, I don't think that."}, {"time": 810, "text": "And I think we will probably be able to build things even if we don't answer that question."}, {"time": 816, "text": "But if we want to make sure that what happens is a good thing, we better solve it first."}, {"time": 820, "text": "So it's a wonderful controversy you're raising there where you have basically three points of view about the hard problem."}, {"time": 828, "text": "So there are two different points of view."}, {"time": 832, "text": "They both conclude that the hard problem of consciousness is BS."}, {"time": 836, "text": "On one hand, you have some people like Daniel Dennett who say that consciousness is just BS because consciousness is the same thing as intelligence."}, {"time": 845, "text": "There's no difference."}, {"time": 846, "text": "So anything which acts conscious is conscious, just like we are."}, {"time": 853, "text": "And then there are also a lot of people, including many top AI researchers I know, who say, oh, consciousness is just bullshit because, of course, machines can never be conscious."}, {"time": 862, "text": "They're always going to be zombies."}, {"time": 864, "text": "You never have to feel guilty about how you treat them."}, {"time": 867, "text": "And then there's a third group of people, including Giulio Tononi, for example, and Krzysztof Koch and a number of others."}, {"time": 877, "text": "I would put myself also in this middle camp who say that actually some information processing is conscious and some is not."}, {"time": 884, "text": "So let's find the equation which can be used to determine which it is."}, {"time": 889, "text": "And I think we've just been a little bit lazy, kind of running away from this problem for a long time."}, {"time": 894, "text": "It's been almost taboo to even mention the C word in a lot of circles because, but we should stop making excuses."}, {"time": 903, "text": "This is a science question and there are ways we can even test any theory that makes predictions for this."}, {"time": 911, "text": "And coming back to this helper robot, I mean, so you said you'd want your helper robot to certainly act conscious and treat you, like have conversations with you and stuff."}, {"time": 920, "text": "I think so."}, {"time": 921, "text": "But wouldn't you, would you feel, would you feel a little bit creeped out if you realized that it was just a glossed up tape recorder, you know, that was just zombie and was a faking emotion?"}, {"time": 931, "text": "Would you prefer that it actually had an experience or would you prefer that it's actually not experiencing anything so you feel, you don't have to feel guilty about what you do to it?"}, {"time": 942, "text": "It's such a difficult question because, you know, it's like when you're in a relationship and you say, well, I love you."}, {"time": 948, "text": "And the other person said, I love you back."}, {"time": 949, "text": "It's like asking, well, do they really love you back or are they just saying they love you back?"}, {"time": 955, "text": "Don't you really want them to actually love you?"}, {"time": 958, "text": "It's hard to, it's hard to really know the difference between everything seeming like there's consciousness present, there's intelligence present, there's affection, passion, love, and it actually being there."}, {"time": 976, "text": "I'm not sure, do you have?"}, {"time": 977, "text": "But like, can I ask you a question about this?"}, {"time": 979, "text": "Like to make it a bit more pointed."}, {"time": 980, "text": "So Mass General Hospital is right across the river, right?"}, {"time": 983, "text": "Suppose you're going in for a medical procedure and they're like, you know, for anesthesia, what we're going to do is we're going to give you muscle relaxants so you won't be able to move and you're going to feel excruciating pain during the whole surgery, but you won't be able to do anything about it."}, {"time": 997, "text": "But then we're going to give you this drug that erases your memory of it."}, {"time": 1001, "text": "Would you be cool about that?"}, {"time": 1004, "text": "What's the difference that you're conscious about it or not if there's no behavioral change, right?"}, {"time": 1011, "text": "Right, that's a really, that's a really clear way to put it."}, {"time": 1014, "text": "That's, yeah, it feels like in that sense, experiencing it is a valuable quality."}, {"time": 1021, "text": "So actually being able to have subjective experiences, at least in that case, is valuable."}, {"time": 1029, "text": "And I think we humans have a little bit of a bad track record also of making these self serving arguments that other entities aren't conscious."}, {"time": 1038, "text": "You know, people often say, oh, these animals can't feel pain."}, {"time": 1041, "text": "It's okay to boil lobsters because we ask them if it hurt and they didn't say anything."}, {"time": 1045, "text": "And now there was just a paper out saying, lobsters do feel pain when you boil them and they're banning it in Switzerland."}, {"time": 1051, "text": "And we did this with slaves too often and said, oh, they don't mind."}, {"time": 1056, "text": "They don't maybe aren't conscious or women don't have souls or whatever."}, {"time": 1061, "text": "So I'm a little bit nervous when I hear people just take as an axiom that machines can't have experience ever."}, {"time": 1068, "text": "I think this is just a really fascinating science question is what it is."}, {"time": 1072, "text": "Let's research it and try to figure out what it is that makes the difference between unconscious intelligent behavior and conscious intelligent behavior."}, {"time": 1081, "text": "So in terms of, so if you think of a Boston Dynamics human or robot being sort of with a broom being pushed around, it starts pushing on a consciousness question."}, {"time": 1093, "text": "So let me ask, do you think an AGI system like a few neuroscientists believe needs to have a physical embodiment?"}, {"time": 1102, "text": "Needs to have a body or something like a body?"}, {"time": 1105, "text": "No, I don't think so."}, {"time": 1108, "text": "You mean to have a conscious experience?"}, {"time": 1110, "text": "To have consciousness."}, {"time": 1113, "text": "I do think it helps a lot to have a physical embodiment to learn the kind of things about the world that are important to us humans, for sure."}, {"time": 1122, "text": "But I don't think the physical embodiment is necessary after you've learned it to just have the experience."}, {"time": 1128, "text": "Think about when you're dreaming, right?"}, {"time": 1131, "text": "Your eyes are closed."}, {"time": 1132, "text": "You're not getting any sensory input."}, {"time": 1134, "text": "You're not behaving or moving in any way but there's still an experience there, right?"}, {"time": 1139, "text": "And so clearly the experience that you have when you see something cool in your dreams isn't coming from your eyes."}, {"time": 1144, "text": "It's just the information processing itself in your brain which is that experience, right?"}, {"time": 1150, "text": "But if I put it another way, I'll say because it comes from neuroscience is the reason you want to have a body and a physical something like a physical, you know, a physical system is because you want to be able to preserve something."}, {"time": 1167, "text": "In order to have a self, you could argue, would you need to have some kind of embodiment of self to want to preserve?"}, {"time": 1178, "text": "Well, now we're getting a little bit anthropomorphic into anthropomorphizing things."}, {"time": 1185, "text": "Maybe talking about self preservation instincts."}, {"time": 1187, "text": "I mean, we are evolved organisms, right?"}, {"time": 1190, "text": "So Darwinian evolution endowed us and other evolved organism with a self preservation instinct because those that didn't have those self preservation genes got cleaned out of the gene pool, right?"}, {"time": 1202, "text": "But if you build an artificial general intelligence the mind space that you can design is much, much larger than just a specific subset of minds that can evolve."}, {"time": 1214, "text": "So an AGI mind doesn't necessarily have to have any self preservation instinct."}, {"time": 1219, "text": "It also doesn't necessarily have to be so individualistic as us."}, {"time": 1224, "text": "Like, imagine if you could just, first of all, or we are also very afraid of death."}, {"time": 1227, "text": "You know, I suppose you could back yourself up every five minutes and then your airplane is about to crash."}, {"time": 1232, "text": "You're like, shucks, I'm gonna lose the last five minutes of experiences since my last cloud backup, dang."}, {"time": 1239, "text": "You know, it's not as big a deal."}, {"time": 1241, "text": "Or if we could just copy experiences between our minds easily like we, which we could easily do if we were silicon based, right?"}, {"time": 1250, "text": "Then maybe we would feel a little bit more like a hive mind actually, that maybe it's the, so I don't think we should take for granted at all that AGI will have to have any of those sort of competitive as alpha male instincts."}, {"time": 1267, "text": "On the other hand, you know, this is really interesting because I think some people go too far and say, of course we don't have to have any concerns either that advanced AI will have those instincts because we can build anything we want."}, {"time": 1282, "text": "That there's a very nice set of arguments going back to Steve Omohundro and Nick Bostrom and others just pointing out that when we build machines, we normally build them with some kind of goal, you know, win this chess game, drive this car safely or whatever."}, {"time": 1298, "text": "And as soon as you put in a goal into machine, especially if it's kind of open ended goal and the machine is very intelligent, it'll break that down into a bunch of sub goals."}, {"time": 1308, "text": "And one of those goals will almost always be self preservation because if it breaks or dies in the process, it's not gonna accomplish the goal, right?"}, {"time": 1316, "text": "Like suppose you just build a little, you have a little robot and you tell it to go down the store market here and get you some food, make you cook an Italian dinner, you know, and then someone mugs it and tries to break it on the way."}, {"time": 1329, "text": "That robot has an incentive to not get destroyed and defend itself or run away, because otherwise it's gonna fail in cooking your dinner."}, {"time": 1337, "text": "It's not afraid of death, but it really wants to complete the dinner cooking goal."}, {"time": 1342, "text": "So it will have a self preservation instinct."}, {"time": 1345, "text": "Continue being a functional agent somehow."}, {"time": 1347, "text": "And similarly, if you give any kind of more ambitious goal to an AGI, it's very likely they wanna acquire more resources so it can do that better."}, {"time": 1359, "text": "And it's exactly from those sort of sub goals that we might not have intended that some of the concerns about AGI safety come."}, {"time": 1367, "text": "You give it some goal that seems completely harmless."}, {"time": 1370, "text": "And then before you realize it, it's also trying to do these other things which you didn't want it to do."}, {"time": 1376, "text": "And it's maybe smarter than us."}, {"time": 1379, "text": "So it's fascinating."}, {"time": 1381, "text": "And let me pause just because I am in a very kind of human centric way, see fear of death as a valuable motivator."}, {"time": 1391, "text": "So you don't think, you think that's an artifact of evolution, so that's the kind of mind space evolution created that we're sort of almost obsessed about self preservation, some kind of genetic flow."}, {"time": 1404, "text": "You don't think that's necessary to be afraid of death."}, {"time": 1409, "text": "So not just a kind of sub goal of self preservation just so you can keep doing the thing, but more fundamentally sort of have the finite thing like this ends for you at some point."}, {"time": 1424, "text": "Do I think it's necessary for what precisely?"}, {"time": 1427, "text": "For intelligence, but also for consciousness."}, {"time": 1430, "text": "So for those, for both, do you think really like a finite death and the fear of it is important?"}, {"time": 1439, "text": "So before I can answer, before we can agree on whether it's necessary for intelligence or for consciousness, we should be clear on how we define those two words."}, {"time": 1449, "text": "Cause a lot of really smart people define them in very different ways."}, {"time": 1453, "text": "I was on this panel with AI experts and they couldn't agree on how to define intelligence even."}, {"time": 1460, "text": "So I define intelligence simply as the ability to accomplish complex goals."}, {"time": 1465, "text": "I like your broad definition, because again I don't want to be a carbon chauvinist."}, {"time": 1470, "text": "And in that case, no, certainly it doesn't require fear of death."}, {"time": 1476, "text": "I would say alpha go, alpha zero is quite intelligent."}, {"time": 1480, "text": "I don't think alpha zero has any fear of being turned off because it doesn't understand the concept of it even."}, {"time": 1486, "text": "And similarly consciousness."}, {"time": 1488, "text": "I mean, you could certainly imagine very simple kind of experience."}, {"time": 1493, "text": "If certain plants have any kind of experience I don't think they're very afraid of dying or there's nothing they can do about it anyway much."}, {"time": 1500, "text": "So there wasn't that much value in, but more seriously I think if you ask, not just about being conscious but maybe having what you would, we might call an exciting life where you feel passion and really appreciate the things."}, {"time": 1521, "text": "Maybe there somehow, maybe there perhaps it does help having a backdrop that, Hey, it's finite."}, {"time": 1527, "text": "No, let's make the most of this, let's live to the fullest."}, {"time": 1531, "text": "So if you knew you were going to live forever do you think you would change your?"}, {"time": 1537, "text": "Yeah, I mean, in some perspective it would be an incredibly boring life living forever."}, {"time": 1543, "text": "So in the sort of loose subjective terms that you said of something exciting and something in this that other humans would understand, I think is, yeah it seems that the finiteness of it is important."}, {"time": 1557, "text": "Well, the good news I have for you then is based on what we understand about cosmology everything is in our universe is probably ultimately probably finite, although."}, {"time": 1567, "text": "Big crunch or big, what's the, the infinite expansion."}, {"time": 1571, "text": "Yeah, we could have a big chill or a big crunch or a big rip or that's the big snap or death bubbles."}, {"time": 1578, "text": "All of them are more than a billion years away."}, {"time": 1580, "text": "So we should, we certainly have vastly more time than our ancestors thought, but there is still it's still pretty hard to squeeze in an infinite number of compute cycles, even though there are some loopholes that just might be possible."}, {"time": 1597, "text": "But I think, you know, some people like to say that you should live as if you're about to you're going to die in five years or so."}, {"time": 1606, "text": "And that's sort of optimal."}, {"time": 1607, "text": "Maybe it's a good assumption."}, {"time": 1610, "text": "We should build our civilization as if it's all finite to be on the safe side."}, {"time": 1616, "text": "So you mentioned defining intelligence as the ability to solve complex goals."}, {"time": 1622, "text": "Where would you draw a line or how would you try to define human level intelligence and superhuman level intelligence?"}, {"time": 1630, "text": "Where is consciousness part of that definition?"}, {"time": 1633, "text": "No, consciousness does not come into this definition."}, {"time": 1636, "text": "So, so I think of intelligence as it's a spectrum but there are very many different kinds of goals you can have."}, {"time": 1642, "text": "You can have a goal to be a good chess player a good goal player, a good car driver, a good investor good poet, et cetera."}, {"time": 1651, "text": "So intelligence that by its very nature isn't something you can measure by this one number or some overall goodness."}, {"time": 1658, "text": "There are some people who are more better at this."}, {"time": 1660, "text": "Some people are better than that."}, {"time": 1662, "text": "Right now we have machines that are much better than us at some very narrow tasks like multiplying large numbers fast, memorizing large databases, playing chess playing go and soon driving cars."}, {"time": 1677, "text": "But there's still no machine that can match a human child in general intelligence but artificial general intelligence, AGI the name of your course, of course that is by its very definition, the quest to build a machine that can do everything as well as we can."}, {"time": 1697, "text": "So the old Holy grail of AI from back to its inception in the sixties, if that ever happens, of course I think it's going to be the biggest transition in the history of life on earth but it doesn't necessarily have to wait the big impact until machines are better than us at knitting that the really big change doesn't come exactly at the moment they're better than us at everything."}, {"time": 1721, "text": "The really big change comes first there are big changes when they start becoming better at us at doing most of the jobs that we do because that takes away much of the demand for human labor."}, {"time": 1733, "text": "And then the really whopping change comes when they become better than us at AI research, right?"}, {"time": 1741, "text": "Because right now the timescale of AI research is limited by the human research and development cycle of years typically, you know how long does it take from one release of some software or iPhone or whatever to the next?"}, {"time": 1755, "text": "But once Google can replace 40,000 engineers by 40,000 equivalent pieces of software or whatever but then there's no reason that has to be years it can be in principle much faster and the timescale of future progress in AI and all of science and technology will be driven by machines, not humans."}, {"time": 1780, "text": "So it's this simple point which gives right this incredibly fun controversy about whether there can be intelligence explosion so called singularity as Werner Vinge called it."}, {"time": 1794, "text": "Now the idea is articulated by I.J."}, {"time": 1794, "text": "Good is obviously way back fifties but you can see Alan Turing and others thought about it even earlier."}, {"time": 1806, "text": "So you asked me what exactly would I define human level intelligence, yeah."}, {"time": 1812, "text": "So the glib answer is to say something which is better than us at all cognitive tasks with a better than any human at all cognitive tasks but the really interesting bar I think goes a little bit lower than that actually."}, {"time": 1825, "text": "It's when they can, when they're better than us at AI programming and general learning so that they can if they want to get better than us at anything by just studying."}, {"time": 1837, "text": "So they're better is a key word and better is towards this kind of spectrum of the complexity of goals it's able to accomplish."}, {"time": 1845, "text": "So another way to, and that's certainly a very clear definition of human love."}, {"time": 1853, "text": "So there's, it's almost like a sea that's rising you can do more and more and more things it's a geographic that you show it's really nice way to put it."}, {"time": 1859, "text": "So there's some peaks that and there's an ocean level elevating and you solve more and more problems but just kind of to take a pause and we took a bunch of questions and a lot of social networks and a bunch of people asked a sort of a slightly different direction on creativity and things that perhaps aren't a peak."}, {"time": 1883, "text": "Human beings are flawed and perhaps better means having contradiction being flawed in some way."}, {"time": 1890, "text": "So let me sort of start easy, first of all."}, {"time": 1894, "text": "So you have a lot of cool equations."}, {"time": 1896, "text": "Let me ask, what's your favorite equation, first of all?"}, {"time": 1899, "text": "I know they're all like your children, but like which one is that?"}, {"time": 1903, "text": "This is the shirt in your equation."}, {"time": 1905, "text": "It's the master key of quantum mechanics of the micro world."}, {"time": 1909, "text": "So this equation will protect everything to do with atoms, molecules and all the way up."}, {"time": 1918, "text": "Yeah, so, okay."}, {"time": 1919, "text": "So quantum mechanics is certainly a beautiful mysterious formulation of our world."}, {"time": 1925, "text": "So I'd like to sort of ask you, just as an example it perhaps doesn't have the same beauty as physics does but in mathematics abstract, the Andrew Wiles who proved the Fermat's last theorem."}, {"time": 1939, "text": "So he just saw this recently and it kind of caught my eye a little bit."}, {"time": 1944, "text": "This is 358 years after it was conjectured."}, {"time": 1947, "text": "So this is very simple formulation."}, {"time": 1949, "text": "Everybody tried to prove it, everybody failed."}, {"time": 1952, "text": "And so here's this guy comes along and eventually proves it and then fails to prove it and then proves it again in 94."}, {"time": 1961, "text": "And he said like the moment when everything connected into place in an interview said it was so indescribably beautiful."}, {"time": 1967, "text": "That moment when you finally realize the connecting piece of two conjectures."}, {"time": 1972, "text": "He said, it was so indescribably beautiful."}, {"time": 1975, "text": "It was so simple and so elegant."}, {"time": 1977, "text": "I couldn't understand how I'd missed it."}, {"time": 1978, "text": "And I just stared at it in disbelief for 20 minutes."}, {"time": 1982, "text": "Then during the day, I walked around the department and I keep coming back to my desk looking to see if it was still there."}, {"time": 1989, "text": "It was still there."}, {"time": 1990, "text": "I couldn't contain myself."}, {"time": 1991, "text": "I was so excited."}, {"time": 1992, "text": "It was the most important moment on my working life."}, {"time": 1995, "text": "Nothing I ever do again will mean as much."}, {"time": 1998, "text": "So that particular moment."}, {"time": 2000, "text": "And it kind of made me think of what would it take?"}, {"time": 2004, "text": "And I think we have all been there at small levels."}, {"time": 2009, "text": "Maybe let me ask, have you had a moment like that in your life where you just had an idea?"}, {"time": 2014, "text": "It's like, wow, yes."}, {"time": 2020, "text": "I wouldn't mention myself in the same breath as Andrew Wiles, but I've certainly had a number of aha moments when I realized something very cool about physics, which has completely made my head explode."}, {"time": 2036, "text": "In fact, some of my favorite discoveries I made later, I later realized that they had been discovered earlier by someone who sometimes got quite famous for it."}, {"time": 2043, "text": "So it's too late for me to even publish it, but that doesn't diminish in any way."}, {"time": 2047, "text": "The emotional experience you have when you realize it, like, wow."}, {"time": 2051, "text": "Yeah, so what would it take in that moment, that wow, that was yours in that moment?"}, {"time": 2057, "text": "So what do you think it takes for an intelligence system, an AGI system, an AI system to have a moment like that?"}, {"time": 2065, "text": "That's a tricky question because there are actually two parts to it, right?"}, {"time": 2069, "text": "One of them is, can it accomplish that proof?"}, {"time": 2073, "text": "Can it prove that you can never write A to the N plus B to the N equals three to that equal Z to the N for all integers, et cetera, et cetera, when N is bigger than two?"}, {"time": 2088, "text": "That's simply a question about intelligence."}, {"time": 2091, "text": "Can you build machines that are that intelligent?"}, {"time": 2094, "text": "And I think by the time we get a machine that can independently come up with that level of proofs, probably quite close to AGI."}, {"time": 2103, "text": "The second question is a question about consciousness."}, {"time": 2107, "text": "When will we, how likely is it that such a machine will actually have any experience at all, as opposed to just being like a zombie?"}, {"time": 2116, "text": "And would we expect it to have some sort of emotional response to this or anything at all akin to human emotion where when it accomplishes its machine goal, it views it as somehow something very positive and sublime and deeply meaningful?"}, {"time": 2139, "text": "I would certainly hope that if in the future we do create machines that are our peers or even our descendants, that I would certainly hope that they do have this sublime appreciation of life."}, {"time": 2155, "text": "In a way, my absolutely worst nightmare would be that at some point in the future, the distant future, maybe our cosmos is teeming with all this post biological life doing all the seemingly cool stuff."}, {"time": 2172, "text": "And maybe the last humans, by the time our species eventually fizzles out, will be like, well, that's OK because we're so proud of our descendants here."}, {"time": 2183, "text": "And look what all the, my worst nightmare is that we haven't solved the consciousness problem."}, {"time": 2190, "text": "And we haven't realized that these are all the zombies."}, {"time": 2192, "text": "They're not aware of anything any more than a tape recorder has any kind of experience."}, {"time": 2197, "text": "So the whole thing has just become a play for empty benches."}, {"time": 2201, "text": "That would be the ultimate zombie apocalypse."}, {"time": 2204, "text": "So I would much rather, in that case, that we have these beings which can really appreciate how amazing it is."}, {"time": 2217, "text": "And in that picture, what would be the role of creativity?"}, {"time": 2221, "text": "A few people ask about creativity."}, {"time": 2224, "text": "When you think about intelligence, certainly the story you told at the beginning of your book involved creating movies and so on, making money."}, {"time": 2235, "text": "You can make a lot of money in our modern world with music and movies."}, {"time": 2238, "text": "So if you are an intelligent system, you may want to get good at that."}, {"time": 2242, "text": "But that's not necessarily what I mean by creativity."}, {"time": 2246, "text": "Is it important on that complex goals where the sea is rising for there to be something creative?"}, {"time": 2253, "text": "Or am I being very human centric and thinking creativity somehow special relative to intelligence?"}, {"time": 2261, "text": "My hunch is that we should think of creativity simply as an aspect of intelligence."}, {"time": 2270, "text": "And we have to be very careful with human vanity."}, {"time": 2277, "text": "We have this tendency to very often want to say, as soon as machines can do something, we try to diminish it and say, oh, but that's not real intelligence."}, {"time": 2285, "text": "Isn't it creative or this or that?"}, {"time": 2288, "text": "The other thing, if we ask ourselves to write down a definition of what we actually mean by being creative, what we mean by Andrew Wiles, what he did there, for example, don't we often mean that someone takes a very unexpected leap?"}, {"time": 2306, "text": "It's not like taking 573 and multiplying it by 224 by just a step of straightforward cookbook like rules, right?"}, {"time": 2316, "text": "You can maybe make a connection between two things that people had never thought was connected or something like that."}, {"time": 2324, "text": "I think this is an aspect of intelligence."}, {"time": 2327, "text": "And this is actually one of the most important aspects of it."}, {"time": 2333, "text": "Maybe the reason we humans tend to be better at it than traditional computers is because it's something that comes more naturally if you're a neural network than if you're a traditional logic gate based computer machine."}, {"time": 2345, "text": "We physically have all these connections."}, {"time": 2348, "text": "And you activate here, activate here, activate here."}, {"time": 2353, "text": "Bing."}, {"time": 2356, "text": "My hunch is that if we ever build a machine where you could just give it the task, hey, you say, hey, I just realized I want to travel around the world instead this month."}, {"time": 2372, "text": "Can you teach my AGI course for me?"}, {"time": 2374, "text": "And it's like, OK, I'll do it."}, {"time": 2375, "text": "And it does everything that you would have done and improvises and stuff."}, {"time": 2379, "text": "That would, in my mind, involve a lot of creativity."}, {"time": 2383, "text": "Yeah, so it's actually a beautiful way to put it."}, {"time": 2385, "text": "I think we do try to grasp at the definition of intelligence is everything we don't understand how to build."}, {"time": 2396, "text": "So we as humans try to find things that we have and machines don't have."}, {"time": 2401, "text": "And maybe creativity is just one of the things, one of the words we use to describe that."}, {"time": 2405, "text": "That's a really interesting way to put it."}, {"time": 2407, "text": "I don't think we need to be that defensive."}, {"time": 2409, "text": "I don't think anything good comes out of saying, well, we're somehow special, you know?"}, {"time": 2418, "text": "Contrary wise, there are many examples in history of where trying to pretend that we're somehow superior to all other intelligent beings has led to pretty bad results, right?"}, {"time": 2435, "text": "Nazi Germany, they said that they were somehow superior to other people."}, {"time": 2440, "text": "Today, we still do a lot of cruelty to animals by saying that we're so superior somehow, and they can't feel pain."}, {"time": 2446, "text": "Slavery was justified by the same kind of just really weak arguments."}, {"time": 2452, "text": "And I don't think if we actually go ahead and build artificial general intelligence, it can do things better than us, I don't think we should try to found our self worth on some sort of bogus claims of superiority in terms of our intelligence."}, {"time": 2472, "text": "I think we should instead find our calling and the meaning of life from the experiences that we have."}, {"time": 2483, "text": "I can have very meaningful experiences even if there are other people who are smarter than me."}, {"time": 2492, "text": "When I go to a faculty meeting here, and we talk about something, and then I certainly realize, oh, boy, he has an old prize, he has an old prize, he has an old prize, I don't have one."}, {"time": 2500, "text": "Does that make me enjoy life any less or enjoy talking to those people less?"}, {"time": 2507, "text": "Of course not."}, {"time": 2509, "text": "And the contrary, I feel very honored and privileged to get to interact with other very intelligent beings that are better than me at a lot of stuff."}, {"time": 2520, "text": "So I don't think there's any reason why we can't have the same approach with intelligent machines."}, {"time": 2526, "text": "That's a really interesting."}, {"time": 2527, "text": "So people don't often think about that."}, {"time": 2528, "text": "They think about when there's going, if there's machines that are more intelligent, you naturally think that that's not going to be a beneficial type of intelligence."}, {"time": 2539, "text": "You don't realize it could be like peers with Nobel prizes that would be just fun to talk with, and they might be clever about certain topics, and you can have fun having a few drinks with them."}, {"time": 2552, "text": "Well, also, another example we can all relate to of why it doesn't have to be a terrible thing to be in the presence of people who are even smarter than us all around is when you and I were both two years old, I mean, our parents were much more intelligent than us, right?"}, {"time": 2569, "text": "Worked out OK, because their goals were aligned with our goals."}, {"time": 2573, "text": "And that, I think, is really the number one key issue we have to solve if we value align the value alignment problem, exactly."}, {"time": 2583, "text": "Because people who see too many Hollywood movies with lousy science fiction plot lines, they worry about the wrong thing, right?"}, {"time": 2592, "text": "They worry about some machine suddenly turning evil."}, {"time": 2596, "text": "It's not malice that is the concern."}, {"time": 2601, "text": "It's competence."}, {"time": 2602, "text": "By definition, intelligent makes you very competent."}, {"time": 2607, "text": "If you have a more intelligent goal playing, computer playing is a less intelligent one."}, {"time": 2613, "text": "And when we define intelligence as the ability to accomplish goal winning, it's going to be the more intelligent one that wins."}, {"time": 2620, "text": "And if you have a human and then you have an AGI that's more intelligent in all ways and they have different goals, guess who's going to get their way, right?"}, {"time": 2630, "text": "So I was just reading about this particular rhinoceros species that was driven extinct just a few years ago."}, {"time": 2639, "text": "Ellen Bummer is looking at this cute picture of a mommy rhinoceros with its child."}, {"time": 2645, "text": "And why did we humans drive it to extinction?"}, {"time": 2649, "text": "It wasn't because we were evil rhino haters as a whole."}, {"time": 2652, "text": "It was just because our goals weren't aligned with those of the rhinoceros."}, {"time": 2656, "text": "And it didn't work out so well for the rhinoceros because we were more intelligent, right?"}, {"time": 2659, "text": "So I think it's just so important that if we ever do build AGI, before we unleash anything, we have to make sure that it learns to understand our goals, that it adopts our goals, and that it retains those goals."}, {"time": 2677, "text": "So the cool, interesting problem there is us as human beings trying to formulate our values."}, {"time": 2687, "text": "So you could think of the United States Constitution as a way that people sat down, at the time a bunch of white men, which is a good example, I should say."}, {"time": 2699, "text": "They formulated the goals for this country."}, {"time": 2701, "text": "And a lot of people agree that those goals actually held up pretty well."}, {"time": 2705, "text": "That's an interesting formulation of values and failed miserably in other ways."}, {"time": 2709, "text": "So for the value alignment problem and the solution to it, we have to be able to put on paper or in a program human values."}, {"time": 2720, "text": "How difficult do you think that is?"}, {"time": 2724, "text": "But it's so important."}, {"time": 2725, "text": "We really have to give it our best."}, {"time": 2728, "text": "And it's difficult for two separate reasons."}, {"time": 2730, "text": "There's the technical value alignment problem of figuring out just how to make machines understand our goals, adopt them, and retain them."}, {"time": 2740, "text": "And then there's the separate part of it, the philosophical part."}, {"time": 2744, "text": "Whose values anyway?"}, {"time": 2745, "text": "And since it's not like we have any great consensus on this planet on values, what mechanism should we create then to aggregate and decide, OK, what's a good compromise?"}, {"time": 2756, "text": "That second discussion can't just be left to tech nerds like myself."}, {"time": 2761, "text": "And if we refuse to talk about it and then AGI gets built, who's going to be actually making the decision about whose values?"}, {"time": 2768, "text": "It's going to be a bunch of dudes in some tech company."}, {"time": 2772, "text": "And are they necessarily so representative of all of humankind that we want to just entrust it to them?"}, {"time": 2779, "text": "Are they even uniquely qualified to speak to future human happiness just because they're good at programming AI?"}, {"time": 2786, "text": "I'd much rather have this be a really inclusive conversation."}, {"time": 2790, "text": "But do you think it's possible?"}, {"time": 2792, "text": "So you create a beautiful vision that includes the diversity, cultural diversity, and various perspectives on discussing rights, freedoms, human dignity."}, {"time": 2803, "text": "But how hard is it to come to that consensus?"}, {"time": 2806, "text": "Do you think it's certainly a really important thing that we should all try to do?"}, {"time": 2811, "text": "But do you think it's feasible?"}, {"time": 2814, "text": "I think there's no better way to guarantee failure than to refuse to talk about it or refuse to try."}, {"time": 2822, "text": "And I also think it's a really bad strategy to say, OK, let's first have a discussion for a long time."}, {"time": 2828, "text": "And then once we reach complete consensus, then we'll try to load it into some machine."}, {"time": 2833, "text": "No, we shouldn't let perfect be the enemy of good."}, {"time": 2836, "text": "Instead, we should start with the kindergarten ethics that pretty much everybody agrees on and put that into machines now."}, {"time": 2844, "text": "We're not doing that even."}, {"time": 2845, "text": "Look at anyone who builds this passenger aircraft, wants it to never under any circumstances fly into a building or a mountain."}, {"time": 2855, "text": "Yet the September 11 hijackers were able to do that."}, {"time": 2858, "text": "And even more embarrassingly, Andreas Lubitz, this depressed Germanwings pilot, when he flew his passenger jet into the Alps killing over 100 people, he just told the autopilot to do it."}, {"time": 2870, "text": "He told the freaking computer to change the altitude to 100 meters."}, {"time": 2875, "text": "And even though it had the GPS maps, everything, the computer was like, OK."}, {"time": 2880, "text": "So we should take those very basic values, where the problem is not that we don't agree."}, {"time": 2888, "text": "The problem is just we've been too lazy to try to put it into our machines and make sure that from now on, airplanes will just, which all have computers in them, but will just refuse to do something like that."}, {"time": 2899, "text": "Go into safe mode, maybe lock the cockpit door, go over to the nearest airport."}, {"time": 2904, "text": "And there's so much other technology in our world as well now, where it's really becoming quite timely to put in some sort of very basic values like this."}, {"time": 2914, "text": "Even in cars, we've had enough vehicle terrorism attacks by now, where people have driven trucks and vans into pedestrians, that it's not at all a crazy idea to just have that hardwired into the car."}, {"time": 2928, "text": "Because yeah, there are a lot of, there's always going to be people who for some reason want to harm others, but most of those people don't have the technical expertise to figure out how to work around something like that."}, {"time": 2938, "text": "So if the car just won't do it, it helps."}, {"time": 2941, "text": "So let's start there."}, {"time": 2942, "text": "So there's a lot of, that's a great point."}, {"time": 2944, "text": "So not chasing perfect."}, {"time": 2946, "text": "There's a lot of things that most of the world agrees on."}, {"time": 2950, "text": "Yeah, let's start there."}, {"time": 2951, "text": "Let's start there."}, {"time": 2952, "text": "And then once we start there, we'll also get into the habit of having these kind of conversations about, okay, what else should we put in here and have these discussions?"}, {"time": 2961, "text": "This should be a gradual process then."}, {"time": 2963, "text": "Great, so, but that also means describing these things and describing it to a machine."}, {"time": 2971, "text": "So one thing, we had a few conversations with Stephen Wolfram."}, {"time": 2975, "text": "I'm not sure if you're familiar with Stephen."}, {"time": 2977, "text": "Oh yeah, I know him quite well."}, {"time": 2978, "text": "So he is, he works with a bunch of things, but cellular automata, these simple computable things, these computation systems."}, {"time": 2987, "text": "And he kind of mentioned that, we probably have already within these systems already something that's AGI, meaning like we just don't know it because we can't talk to it."}, {"time": 3000, "text": "So if you give me this chance to try to at least form a question out of this is, I think it's an interesting idea to think that we can have intelligent systems, but we don't know how to describe something to them and they can't communicate with us."}, {"time": 3017, "text": "I know you're doing a little bit of work in explainable AI, trying to get AI to explain itself."}, {"time": 3022, "text": "So what are your thoughts of natural language processing or some kind of other communication?"}, {"time": 3027, "text": "How does the AI explain something to us?"}, {"time": 3030, "text": "How do we explain something to it, to machines?"}, {"time": 3033, "text": "Or you think of it differently?"}, {"time": 3035, "text": "So there are two separate parts to your question there."}, {"time": 3039, "text": "One of them has to do with communication, which is super interesting, I'll get to that in a sec."}, {"time": 3044, "text": "The other is whether we already have AGI but we just haven't noticed it there."}, {"time": 3051, "text": "There I beg to differ."}, {"time": 3054, "text": "I don't think there's anything in any cellular automaton or anything or the internet itself or whatever that has artificial general intelligence and that it can really do exactly everything we humans can do better."}, {"time": 3067, "text": "I think the day that happens, when that happens, we will very soon notice, we'll probably notice even before because in a very, very big way."}, {"time": 3077, "text": "But for the second part, though."}, {"time": 3078, "text": "Wait, can I ask, sorry."}, {"time": 3080, "text": "So, because you have this beautiful way to formulating consciousness as information processing, and you can think of intelligence as information processing, and you can think of the entire universe as these particles and these systems roaming around that have this information processing power."}, {"time": 3101, "text": "You don't think there is something with the power to process information in the way that we human beings do that's out there that needs to be sort of connected to."}, {"time": 3115, "text": "It seems a little bit philosophical, perhaps, but there's something compelling to the idea that the power is already there, which the focus should be more on being able to communicate with it."}, {"time": 3127, "text": "Well, I agree that in a certain sense, the hardware processing power is already out there because our universe itself can think of it as being a computer already, right?"}, {"time": 3141, "text": "It's constantly computing what water waves, how it devolved the water waves in the River Charles and how to move the air molecules around."}, {"time": 3148, "text": "Seth Lloyd has pointed out, my colleague here, that you can even in a very rigorous way think of our entire universe as being a quantum computer."}, {"time": 3155, "text": "It's pretty clear that our universe supports this amazing processing power because you can even, within this physics computer that we live in, right?"}, {"time": 3164, "text": "We can even build actual laptops and stuff, so clearly the power is there."}, {"time": 3169, "text": "It's just that most of the compute power that nature has, it's, in my opinion, kind of wasting on boring stuff like simulating yet another ocean wave somewhere where no one is even looking, right?"}, {"time": 3178, "text": "So in a sense, what life does, what we are doing when we build computers is we're rechanneling all this compute that nature is doing anyway into doing things that are more interesting than just yet another ocean wave, and let's do something cool here."}, {"time": 3194, "text": "So the raw hardware power is there, for sure, but then even just computing what's going to happen for the next five seconds in this water bottle, takes a ridiculous amount of compute if you do it on a human computer."}, {"time": 3207, "text": "This water bottle just did it."}, {"time": 3209, "text": "But that does not mean that this water bottle has AGI because AGI means it should also be able to, like I've written my book, done this interview."}, {"time": 3220, "text": "And I don't think it's just communication problems."}, {"time": 3222, "text": "I don't really think it can do it."}, {"time": 3226, "text": "Although Buddhists say when they watch the water and that there is some beauty, that there's some depth and beauty in nature that they can communicate with."}, {"time": 3234, "text": "Communication is also very important though because I mean, look, part of my job is being a teacher."}, {"time": 3241, "text": "And I know some very intelligent professors even who just have a bit of hard time communicating."}, {"time": 3249, "text": "They come up with all these brilliant ideas, but to communicate with somebody else, you have to also be able to simulate their own mind."}, {"time": 3256, "text": "Yes, empathy."}, {"time": 3258, "text": "Build well enough and understand model of their mind that you can say things that they will understand."}, {"time": 3264, "text": "And that's quite difficult."}, {"time": 3266, "text": "And that's why today it's so frustrating if you have a computer that makes some cancer diagnosis and you ask it, well, why are you saying I should have this surgery?"}, {"time": 3276, "text": "And if it can only reply, I was trained on five terabytes of data and this is my diagnosis, boop, boop, beep, beep."}, {"time": 3285, "text": "It doesn't really instill a lot of confidence, right?"}, {"time": 3289, "text": "So I think we have a lot of work to do on communication there."}, {"time": 3294, "text": "So what kind of, I think you're doing a little bit of work in explainable AI."}, {"time": 3299, "text": "What do you think are the most promising avenues?"}, {"time": 3301, "text": "Is it mostly about sort of the Alexa problem of natural language processing of being able to actually use human interpretable methods of communication?"}, {"time": 3313, "text": "So being able to talk to a system and it talk back to you, or is there some more fundamental problems to be solved?"}, {"time": 3318, "text": "I think it's all of the above."}, {"time": 3321, "text": "The natural language processing is obviously important, but there are also more nerdy fundamental problems."}, {"time": 3327, "text": "Like if you take, you play chess?"}, {"time": 3331, "text": "Of course, I'm Russian."}, {"time": 3333, "text": "I have to."}, {"time": 3333, "text": "You speak Russian?"}, {"time": 3334, "text": "Yes, I speak Russian."}, {"time": 3335, "text": "Excellent, I didn't know."}, {"time": 3338, "text": "When did you learn Russian?"}, {"time": 3339, "text": "I speak very bad Russian, I'm only an autodidact, but I bought a book, Teach Yourself Russian, read a lot, but it was very difficult."}, {"time": 3348, "text": "That's why I speak so bad."}, {"time": 3349, "text": "How many languages do you know?"}, {"time": 3351, "text": "Wow, that's really impressive."}, {"time": 3353, "text": "I don't know, my wife has some calculation, but my point was, if you play chess, have you looked at the AlphaZero games?"}, {"time": 3361, "text": "The actual games, no."}, {"time": 3362, "text": "Check it out, some of them are just mind blowing, really beautiful."}, {"time": 3367, "text": "And if you ask, how did it do that?"}, {"time": 3373, "text": "You go talk to Demis Hassabis, I know others from DeepMind, all they'll ultimately be able to give you is big tables of numbers, matrices, that define the neural network."}, {"time": 3385, "text": "And you can stare at these tables of numbers till your face turn blue, and you're not gonna understand much about why it made that move."}, {"time": 3394, "text": "And even if you have natural language processing that can tell you in human language about, oh, five, seven, points, two, eight, still not gonna really help."}, {"time": 3403, "text": "So I think there's a whole spectrum of fun challenges that are involved in taking a computation that does intelligent things and transforming it into something equally good, equally intelligent, but that's more understandable."}, {"time": 3421, "text": "And I think that's really valuable because I think as we put machines in charge of ever more infrastructure in our world, the power grid, the trading on the stock market, weapon systems and so on, it's absolutely crucial that we can trust these AIs to do all we want."}, {"time": 3439, "text": "And trust really comes from understanding in a very fundamental way."}, {"time": 3444, "text": "And that's why I'm working on this, because I think the more, if we're gonna have some hope of ensuring that machines have adopted our goals and that they're gonna retain them, that kind of trust, I think, needs to be based on things you can actually understand, preferably even improve theorems on."}, {"time": 3464, "text": "Even with a self driving car, right?"}, {"time": 3467, "text": "If someone just tells you it's been trained on tons of data and it never crashed, it's less reassuring than if someone actually has a proof."}, {"time": 3474, "text": "Maybe it's a computer verified proof, but still it says that under no circumstances is this car just gonna swerve into oncoming traffic."}, {"time": 3482, "text": "And that kind of information helps to build trust and helps build the alignment of goals, at least awareness that your goals, your values are aligned."}, {"time": 3492, "text": "And I think even in the very short term, if you look at how, you know, today, right?"}, {"time": 3496, "text": "This absolutely pathetic state of cybersecurity that we have, where is it?"}, {"time": 3501, "text": "Three billion Yahoo accounts we can't pack, almost every American's credit card and so on."}, {"time": 3512, "text": "Why is this happening?"}, {"time": 3514, "text": "It's ultimately happening because we have software that nobody fully understood how it worked."}, {"time": 3521, "text": "That's why the bugs hadn't been found, right?"}, {"time": 3524, "text": "And I think AI can be used very effectively for offense, for hacking, but it can also be used for defense."}, {"time": 3532, "text": "Hopefully automating verifiability and creating systems that are built in different ways so you can actually prove things about them."}, {"time": 3542, "text": "And it's important."}, {"time": 3545, "text": "So speaking of software that nobody understands how it works, of course, a bunch of people ask about your paper, about your thoughts of why does deep and cheap learning work so well?"}, {"time": 3554, "text": "That's the paper."}, {"time": 3555, "text": "But what are your thoughts on deep learning?"}, {"time": 3558, "text": "These kind of simplified models of our own brains have been able to do some successful perception work, pattern recognition work, and now with AlphaZero and so on, do some clever things."}, {"time": 3570, "text": "What are your thoughts about the promise limitations of this piece?"}, {"time": 3575, "text": "Great, I think there are a number of very important insights, very important lessons we can always draw from these kinds of successes."}, {"time": 3587, "text": "One of them is when you look at the human brain, you see it's very complicated, 10th of 11 neurons, and there are all these different kinds of neurons and yada, yada, and there's been this long debate about whether the fact that we have dozens of different kinds is actually necessary for intelligence."}, {"time": 3601, "text": "We can now, I think, quite convincingly answer that question of no, it's enough to have just one kind."}, {"time": 3607, "text": "If you look under the hood of AlphaZero, there's only one kind of neuron and it's ridiculously simple mathematical thing."}, {"time": 3615, "text": "So it's just like in physics, it's not, if you have a gas with waves in it, it's not the detailed nature of the molecule that matter, it's the collective behavior somehow."}, {"time": 3626, "text": "Similarly, it's this higher level structure of the network that matters, not that you have 20 kinds of neurons."}, {"time": 3634, "text": "I think our brain is such a complicated mess because it wasn't evolved just to be intelligent, it was involved to also be self assembling and self repairing, right?"}, {"time": 3648, "text": "And evolutionarily attainable."}, {"time": 3651, "text": "And so on and so on."}, {"time": 3653, "text": "So I think it's pretty, my hunch is that we're going to understand how to build AGI before we fully understand how our brains work, just like we understood how to build flying machines long before we were able to build a mechanical bird."}, {"time": 3667, "text": "Yeah, that's right."}, {"time": 3668, "text": "You've given the example exactly of mechanical birds and airplanes and airplanes do a pretty good job of flying without really mimicking bird flight."}, {"time": 3678, "text": "And even now after 100 years later, did you see the Ted talk with this German mechanical bird?"}, {"time": 3683, "text": "I heard you mention it."}, {"time": 3685, "text": "Check it out, it's amazing."}, {"time": 3686, "text": "But even after that, right, we still don't fly in mechanical birds because it turned out the way we came up with was simpler and it's better for our purposes."}, {"time": 3693, "text": "And I think it might be the same there."}, {"time": 3695, "text": "That's one lesson."}, {"time": 3697, "text": "And another lesson, it's more what our paper was about."}, {"time": 3702, "text": "First, as a physicist thought it was fascinating how there's a very close mathematical relationship actually between our artificial neural networks and a lot of things that we've studied for in physics go by nerdy names like the renormalization group equation and Hamiltonians and yada, yada, yada."}, {"time": 3719, "text": "And when you look a little more closely at this, you have, at first I was like, well, there's something crazy here that doesn't make sense."}, {"time": 3733, "text": "Because we know that if you even want to build a super simple neural network to tell apart cat pictures and dog pictures, right, that you can do that very, very well now."}, {"time": 3745, "text": "But if you think about it a little bit, you convince yourself it must be impossible because if I have one megapixel, even if each pixel is just black or white, there's two to the power of 1 million possible images, which is way more than there are atoms in our universe, right, so in order to, and then for each one of those, I have to assign a number, which is the probability that it's a dog."}, {"time": 3767, "text": "So an arbitrary function of images is a list of more numbers than there are atoms in our universe."}, {"time": 3774, "text": "So clearly I can't store that under the hood of my GPU or my computer, yet somehow it works."}, {"time": 3780, "text": "So what does that mean?"}, {"time": 3781, "text": "Well, it means that out of all of the problems that you could try to solve with a neural network, almost all of them are impossible to solve with a reasonably sized one."}, {"time": 3795, "text": "But then what we showed in our paper was that the fraction, the kind of problems, the fraction of all the problems that you could possibly pose, that we actually care about given the laws of physics is also an infinite testimony, tiny little part."}, {"time": 3812, "text": "And amazingly, they're basically the same part."}, {"time": 3815, "text": "Yeah, it's almost like our world was created for, I mean, they kind of come together."}, {"time": 3819, "text": "Yeah, well, you could say maybe where the world was created for us, but I have a more modest interpretation, which is that the world was created for us, but I have a more modest interpretation, which is that instead evolution endowed us with neural networks precisely for that reason."}, {"time": 3833, "text": "Because this particular architecture, as opposed to the one in your laptop, is very, very well adapted to solving the kind of problems that nature kept presenting our ancestors with."}, {"time": 3845, "text": "So it makes sense that why do we have a brain in the first place?"}, {"time": 3849, "text": "It's to be able to make predictions about the future and so on."}, {"time": 3852, "text": "So if we had a sucky system, which could never solve it, we wouldn't have a world."}, {"time": 3858, "text": "So this is, I think, a very beautiful fact."}, {"time": 3864, "text": "We also realize that there's been earlier work on why deeper networks are good, but we were able to show an additional cool fact there, which is that even incredibly simple problems, like suppose I give you a thousand numbers and ask you to multiply them together, and you can write a few lines of code, boom, done, trivial."}, {"time": 3886, "text": "If you just try to do that with a neural network that has only one single hidden layer in it, you can do it, but you're going to need two to the power of a thousand neurons to multiply a thousand numbers, which is, again, more neurons than there are atoms in our universe."}, {"time": 3905, "text": "But if you allow yourself to make it a deep network with many layers, you only need 4,000 neurons."}, {"time": 3913, "text": "It's perfectly feasible."}, {"time": 3916, "text": "That's really interesting."}, {"time": 3918, "text": "So on another architecture type, I mean, you mentioned Schrodinger's equation, and what are your thoughts about quantum computing and the role of this kind of computational unit in creating an intelligence system?"}, {"time": 3934, "text": "In some Hollywood movies that I will not mention by name because I don't want to spoil them."}, {"time": 3941, "text": "The way they get AGI is building a quantum computer."}, {"time": 3945, "text": "Because the word quantum sounds cool and so on."}, {"time": 3950, "text": "First of all, I think we don't need quantum computers to build AGI."}, {"time": 3954, "text": "I suspect your brain is not a quantum computer in any profound sense."}, {"time": 3961, "text": "So you don't even wrote a paper about that a lot many years ago."}, {"time": 3964, "text": "I calculated the so called decoherence time, how long it takes until the quantum computerness of what your neurons are doing gets erased by just random noise from the environment."}, {"time": 3977, "text": "And it's about 10 to the minus 21 seconds."}, {"time": 3981, "text": "So as cool as it would be to have a quantum computer in my head, I don't think that fast."}, {"time": 3987, "text": "On the other hand, there are very cool things you could do with quantum computers."}, {"time": 3995, "text": "Or I think we'll be able to do soon when we get bigger ones."}, {"time": 3999, "text": "That might actually help machine learning do even better than the brain."}, {"time": 4003, "text": "So for example, one, this is just a moonshot, but learning is very much same thing as search."}, {"time": 4021, "text": "If you're trying to train a neural network to get really learned to do something really well, you have some loss function, you have a bunch of knobs you can turn, represented by a bunch of numbers, and you're trying to tweak them so that it becomes as good as possible at this thing."}, {"time": 4035, "text": "So if you think of a landscape with some valley, where each dimension of the landscape corresponds to some number you can change, you're trying to find the minimum."}, {"time": 4045, "text": "And it's well known that if you have a very high dimensional landscape, complicated things, it's super hard to find the minimum."}, {"time": 4051, "text": "Quantum mechanics is amazingly good at this."}, {"time": 4055, "text": "Like if I want to know what's the lowest energy state this water can possibly have, incredibly hard to compute, but nature will happily figure this out for you if you just cool it down, make it very, very cold."}, {"time": 4069, "text": "If you put a ball somewhere, it'll roll down to its minimum."}, {"time": 4072, "text": "And this happens metaphorically at the energy landscape too."}, {"time": 4076, "text": "And quantum mechanics even uses some clever tricks, which today's machine learning systems don't."}, {"time": 4082, "text": "Like if you're trying to find the minimum and you get stuck in the little local minimum here, in quantum mechanics you can actually tunnel through the barrier and get unstuck again."}, {"time": 4094, "text": "Yeah, so it may be, for example, that we'll one day use quantum computers that help train neural networks better."}, {"time": 4103, "text": "Okay, so as a component of kind of the learning process, for example."}, {"time": 4109, "text": "Let me ask sort of wrapping up here a little bit, let me return to the questions of our human nature and love, as I mentioned."}, {"time": 4120, "text": "So do you think, you mentioned sort of a helper robot, but you could think of also personal robots."}, {"time": 4128, "text": "Do you think the way we human beings fall in love and get connected to each other is possible to achieve in an AI system and human level AI intelligence system?"}, {"time": 4140, "text": "Do you think we would ever see that kind of connection?"}, {"time": 4143, "text": "Or, you know, in all this discussion about solving complex goals, is this kind of human social connection, do you think that's one of the goals on the peaks and valleys with the raising sea levels that we'll be able to achieve?"}, {"time": 4157, "text": "Or do you think that's something that's ultimately, or at least in the short term, relative to the other goals is not achievable?"}, {"time": 4163, "text": "I think it's all possible."}, {"time": 4165, "text": "And I mean, in recent, there's a very wide range of guesses, as you know, among AI researchers, when we're going to get AGI."}, {"time": 4175, "text": "Some people, you know, like our friend Rodney Brooks says it's going to be hundreds of years at least."}, {"time": 4181, "text": "And then there are many others who think it's going to happen much sooner."}, {"time": 4184, "text": "And recent polls, maybe half or so of AI researchers think we're going to get AGI within decades."}, {"time": 4190, "text": "So if that happens, of course, then I think these things are all possible."}, {"time": 4195, "text": "But in terms of whether it will happen, I think we shouldn't spend so much time asking what do we think will happen in the future?"}, {"time": 4203, "text": "As if we are just some sort of pathetic, your passive bystanders, you know, waiting for the future to happen to us."}, {"time": 4209, "text": "Hey, we're the ones creating this future, right?"}, {"time": 4211, "text": "So we should be proactive about it and ask ourselves what sort of future we would like to have happen."}, {"time": 4218, "text": "We're going to make it like that."}, {"time": 4219, "text": "Well, what I prefer is just some sort of incredibly boring, zombie like future where there's all these mechanical things happening and there's no passion, no emotion, no experience, maybe even."}, {"time": 4229, "text": "No, I would of course, much rather prefer it if all the things that we find that we value the most about humanity are our subjective experience, passion, inspiration, love, you know."}, {"time": 4243, "text": "If we can create a future where those things do happen, where those things do exist, you know, I think ultimately it's not our universe giving meaning to us, it's us giving meaning to our universe."}, {"time": 4257, "text": "And if we build more advanced intelligence, let's make sure we build it in such a way that meaning is part of it."}, {"time": 4269, "text": "A lot of people that seriously study this problem and think of it from different angles have trouble in the majority of cases, if they think through that happen, are the ones that are not beneficial to humanity."}, {"time": 4282, "text": "And so, yeah, so what are your thoughts?"}, {"time": 4285, "text": "What's should people, you know, I really don't like people to be terrified."}, {"time": 4293, "text": "What's a way for people to think about it in a way we can solve it and we can make it better?"}, {"time": 4299, "text": "No, I don't think panicking is going to help in any way."}, {"time": 4302, "text": "It's not going to increase chances of things going well either."}, {"time": 4305, "text": "Even if you are in a situation where there is a real threat, does it help if everybody just freaks out?"}, {"time": 4311, "text": "No, of course, of course not."}, {"time": 4313, "text": "I think, yeah, there are of course ways in which things can go horribly wrong."}, {"time": 4319, "text": "First of all, it's important when we think about this thing, about the problems and risks, to also remember how huge the upsides can be if we get it right, right?"}, {"time": 4328, "text": "Everything we love about society and civilization is a product of intelligence."}, {"time": 4333, "text": "So if we can amplify our intelligence with machine intelligence and not anymore lose our loved one to what we're told is an incurable disease and things like this, of course, we should aspire to that."}, {"time": 4344, "text": "So that can be a motivator, I think, reminding ourselves that the reason we try to solve problems is not just because we're trying to avoid gloom, but because we're trying to do something great."}, {"time": 4355, "text": "But then in terms of the risks, I think the really important question is to ask, what can we do today that will actually help make the outcome good, right?"}, {"time": 4367, "text": "And dismissing the risk is not one of them."}, {"time": 4371, "text": "I find it quite funny often when I'm in discussion panels about these things, how the people who work for companies, always be like, oh, nothing to worry about, nothing to worry about, nothing to worry about."}, {"time": 4384, "text": "And it's only academics sometimes express concerns."}, {"time": 4389, "text": "That's not surprising at all if you think about it."}, {"time": 4392, "text": "Upton Sinclair quipped, right, that it's hard to make a man believe in something when his income depends on not believing in it."}, {"time": 4400, "text": "And frankly, we know a lot of these people in companies that they're just as concerned as anyone else."}, {"time": 4406, "text": "But if you're the CEO of a company, that's not something you want to go on record saying when you have silly journalists who are gonna put a picture of a Terminator robot when they quote you."}, {"time": 4415, "text": "So the issues are real."}, {"time": 4419, "text": "And the way I think about what the issue is, is basically the real choice we have is, first of all, are we gonna just dismiss the risks and say, well, let's just go ahead and build machines that can do everything we can do better and cheaper."}, {"time": 4437, "text": "Let's just make ourselves obsolete as fast as possible."}, {"time": 4440, "text": "What could possibly go wrong?"}, {"time": 4441, "text": "That's one attitude."}, {"time": 4443, "text": "The opposite attitude, I think, is to say, here's this incredible potential, let's think about what kind of future we're really, really excited about."}, {"time": 4454, "text": "What are the shared goals that we can really aspire towards?"}, {"time": 4458, "text": "And then let's think really hard about how we can actually get there."}, {"time": 4462, "text": "So start with, don't start thinking about the risks, start thinking about the goals."}, {"time": 4466, "text": "And then when you do that, then you can think about the obstacles you want to avoid."}, {"time": 4470, "text": "I often get students coming in right here into my office for career advice."}, {"time": 4474, "text": "I always ask them this very question, where do you want to be in the future?"}, {"time": 4477, "text": "If all she can say is, oh, maybe I'll have cancer, maybe I'll get run over by a truck."}, {"time": 4482, "text": "Yeah, focus on the obstacles instead of the goals."}, {"time": 4484, "text": "She's just going to end up a hypochondriac paranoid."}, {"time": 4487, "text": "Whereas if she comes in and fire in her eyes and is like, I want to be there."}, {"time": 4491, "text": "And then we can talk about the obstacles and see how we can circumvent them."}, {"time": 4495, "text": "That's, I think, a much, much healthier attitude."}, {"time": 4498, "text": "And I feel it's very challenging to come up with a vision for the future, which we are unequivocally excited about."}, {"time": 4508, "text": "I'm not just talking now in the vague terms, like, yeah, let's cure cancer, fine."}, {"time": 4512, "text": "I'm talking about what kind of society do we want to create?"}, {"time": 4515, "text": "What do we want it to mean to be human in the age of AI, in the age of AGI?"}, {"time": 4522, "text": "So if we can have this conversation, broad, inclusive conversation, and gradually start converging towards some, some future that with some direction, at least, that we want to steer towards, right, then we'll be much more motivated to constructively take on the obstacles."}, {"time": 4539, "text": "And I think if I had, if I had to, if I try to wrap this up in a more succinct way, I think we can all agree already now that we should aspire to build AGI that doesn't overpower us, but that empowers us."}, {"time": 4565, "text": "And think of the many various ways that can do that, whether that's from my side of the world of autonomous vehicles."}, {"time": 4572, "text": "I'm personally actually from the camp that believes this human level intelligence is required to achieve something like vehicles that would actually be something we would enjoy using and being part of."}, {"time": 4585, "text": "So that's one example, and certainly there's a lot of other types of robots and medicine and so on."}]}]