[{"title": "Jeremi Suri: History of American Power | Lex Fridman Podcast #180", "id": "USnqkUAr_3w", "quotes": [{"time": 269, "text": "But he kept trying, he kept working, and what American society offered him, and what he wanted American society to offer everyone else was the opportunity to keep trying to fail and then get up and try again."}, {"time": 280, "text": "What do you think was the nature of that ambition?"}, {"time": 282, "text": "Was there a hunger for power?"}, {"time": 284, "text": "I think Lincoln had a hunger for success."}, {"time": 286, "text": "I think he had a hunger to get out of the poor station he was in."}, {"time": 292, "text": "He had a hunger to be someone who had control over his life."}, {"time": 296, "text": "Freedom for him did not mean the right to do anything you wanna do, but it meant the right to be secure from being dependent upon someone else."}, {"time": 305, "text": "So independence, he writes in his letters when he's very young that he hated being dependent on his father."}, {"time": 311, "text": "He grew up without a mother."}, {"time": 313, "text": "His father was a struggling farmer, and he would write in his letters that his father treated him like a slave on the farm."}, {"time": 319, "text": "Some think his hatred of slavery came from that experience."}, {"time": 322, "text": "He didn't ever wanna have to work for someone again."}, {"time": 325, "text": "He wanted to be free and independent, and he wanted, again, every American, this is the kind of Jeffersonian dream, to be the owner of themself and the owner of their future."}, {"time": 334, "text": "You know, that's a really nice definition of freedom."}, {"time": 336, "text": "We often think kind of this very abstract notion of being able to do anything you want, but really, it's ultimately breaking yourself free from the constraints, like the very tight dependence on whether it's the institutions or on your family or the expectations or the community or whatever, being able to be, to realize yourself within the constraints of your own abilities."}, {"time": 363, "text": "It's still not true freedom, because true freedom is probably sort of almost like designing a video game character, something like that."}, {"time": 371, "text": "I agree, I think that's exactly right."}, {"time": 373, "text": "I think freedom is not that I can have any outcome I want."}, {"time": 379, "text": "I can't control outcomes."}, {"time": 380, "text": "The most powerful, freest person in the world cannot control outcomes, but it means at least I get to make choices."}, {"time": 385, "text": "Someone else doesn't make those choices for me."}, {"time": 389, "text": "Is there something to be said about Lincoln on the political game front of it, which is he's accomplished some of them?"}, {"time": 398, "text": "I don't know, but it seems like there was some tricky politics going on."}, {"time": 402, "text": "We tend to not think of it in those terms because of the dark aspects of slavery."}, {"time": 408, "text": "We tend to think about it in sort of ethical and human terms, but in their time, it was probably as much a game of politics, not just these broad questions of human nature, right?"}, {"time": 422, "text": "It was a game."}, {"time": 423, "text": "So is there something to be said about being a skillful player in the game of politics that you take from Lincoln?"}, {"time": 428, "text": "Absolutely, and Lincoln never read Karl von Clausewitz, the great 19th century German thinker on strategy and politics, but he embodied the same wisdom, which is that everything is politics."}, {"time": 438, "text": "If you want to get anything done, and this includes even relationships, there's a politics to it."}, {"time": 445, "text": "It means that you have to persuade, coerce, encourage people to do things they wouldn't otherwise do."}, {"time": 452, "text": "And Lincoln was a master at that."}, {"time": 454, "text": "He was a master at that for two reasons."}, {"time": 456, "text": "He had learned through his hard life to read people, to anticipate them, to spend a lot of time listening."}, {"time": 461, "text": "One thing I often tell people is the best leaders are the listeners, not the talkers."}, {"time": 467, "text": "And then second, Lincoln was very thoughtful and planned every move out."}, {"time": 472, "text": "He was thinking three or four moves, maybe five moves down the chessboard, while others were move number one or two."}, {"time": 479, "text": "That's fascinating to think about him just listening, just studying."}, {"time": 483, "text": "They look at great fighters in this way, like the first few rounds of boxing and mixed martial arts, you're studying the movement of your opponent in order to sort of define the holes."}, {"time": 496, "text": "That's a really interesting frame to think about it."}, {"time": 498, "text": "Is there, in terms of relationships, where do you think as president or as a politician is the most impact to be had?"}, {"time": 510, "text": "I've been reading a lot about Hitler recently, and one of the things that I'm more and more starting to wonder, what the hell did he do alone in a room with one on one with people?"}, {"time": 522, "text": "Because it seems like that's where he was exceptionally effective."}, {"time": 526, "text": "When I think about certain leaders, I'm not sure Stalin was this way, I apologize."}, {"time": 533, "text": "Been very obsessed with this period of human history."}, {"time": 537, "text": "It just seems like certain leaders are extremely effective one on one."}, {"time": 541, "text": "A lot of people think of Hitler in Lincoln as a speech maker, as a great charismatic speech maker, but it seems like to me that some of these guys were really effective inside a room."}, {"time": 555, "text": "What's more important?"}, {"time": 557, "text": "Your effectiveness to make a hell of a good speech, sort of being in a room with many people, or is it all boiled down to one on one?"}, {"time": 568, "text": "Well, I think in a sense, it's both."}, {"time": 571, "text": "One needs to do both, and most politicians, most leaders are better at one or the other."}, {"time": 575, "text": "It's the rare leader who can do both."}, {"time": 577, "text": "I will say that if you are going to be a figure who's a president or the leader of a complex organization, not a startup, but a complex organization where you have many different constituencies and many different interests, you have to do the one on one really well, because a lot of what's going to happen is you're going to be meeting with people who represent different groups, right?"}, {"time": 598, "text": "The leader of the labor unions, the leader of your investing board, et cetera, and you have to be able to persuade them, and it's the intangibles that often matter most."}, {"time": 607, "text": "Lincoln's skill, and it's the same that FDR had, is the ability to tell a story."}, {"time": 613, "text": "I think Hitler was a little different, but what I've read of Stalin is he was a storyteller too."}, {"time": 617, "text": "One on one storyteller?"}, {"time": 618, "text": "Yeah, that's my understanding is that he, and what Lincoln did, I don't want to compare Lincoln to Stalin, but what Lincoln did is he was not confrontational."}, {"time": 630, "text": "He was happy to have an argument if an argument were to be had, but actually what he would try to do is move you through telling a story that got you to think about your position in a different way, to basically disarm you."}, {"time": 643, "text": "And Franklin Roosevelt did the same thing."}, {"time": 644, "text": "Ronald Reagan did the same thing."}, {"time": 646, "text": "Storytelling is a very important skill."}, {"time": 649, "text": "It's almost heartbreaking that we don't get to have, or maybe you can correct me if I'm wrong on this, but it feels like we don't have a lot of information how all of these folks were in private, one on one conversations."}, {"time": 662, "text": "Even if we get stories about it, it's like, again, sorry to bring up Hitler, but people have talked about his piercing gaze when they're one on one."}, {"time": 676, "text": "There's a feeling like he's just looking through you."}, {"time": 679, "text": "I wonder, it makes me wonder, was Lincoln somebody who was a little bit more passive, like who's more, the ego doesn't shine."}, {"time": 687, "text": "It's not like an overwhelming thing, or is it more like, again, don't want to bring up controversial figures, but Donald Trump, where it's more menacing, right?"}, {"time": 697, "text": "There's a more like physically menacing thing, where it's almost like a bullying kind of dynamic."}, {"time": 703, "text": "So I wonder, I wish we knew."}, {"time": 707, "text": "Because from a psychological perspective, I wonder if there's a thread that connects most great leaders."}, {"time": 715, "text": "So I think the best writer on this is Max Weber, right?"}, {"time": 718, "text": "And he talks about the power of charisma, that the term charisma comes from Weber, right?"}, {"time": 722, "text": "And Weber's use of it actually to talk about profits."}, {"time": 725, "text": "And I think he has a point, right?"}, {"time": 727, "text": "Leaders who are effective in the way you describe are leaders who feel prophetic, or Weber says they have a kind of magic about them."}, {"time": 735, "text": "And I think that can come from different sources."}, {"time": 737, "text": "I think that can come from the way someone carries themselves."}, {"time": 741, "text": "It can come from the way they use words."}, {"time": 744, "text": "So maybe there are different kinds of magic that someone develops."}, {"time": 747, "text": "But I think there are two things that seem to be absolutely necessary."}, {"time": 751, "text": "First is you have to be someone who sizes up the person on the other side of the table."}, {"time": 755, "text": "You cannot be the person who just comes in and reads your brief."}, {"time": 758, "text": "And then second, I think it's interactive."}, {"time": 762, "text": "And there is a quickness of thought."}, {"time": 764, "text": "So you brought up Donald Trump."}, {"time": 765, "text": "I don't think Donald Trump is a deep thinker at all, but he's quick."}, {"time": 769, "text": "And I think that quickness is part of, it's different from delivering a lecture where it's the depth of your thought."}, {"time": 775, "text": "Can you for 45 minutes analyze something?"}, {"time": 777, "text": "Many people can't do that, but they still might be very effective if they're able to quickly react, size up the person on the other side of the table and react in a way that moves that person in the way they wanna move them."}, {"time": 789, "text": "Yeah, and there's also just coupled with the quickness as a kind of instinct about human nature."}, {"time": 797, "text": "Sort of asking the question, what does this person worry about?"}, {"time": 802, "text": "What are the biggest problems?"}, {"time": 804, "text": "Somebody, what is this, Stephen Schwartzman, I think, said to me, he's this businessman."}, {"time": 809, "text": "I think he said like, what I've always tried to do is try to figure out, like ask enough questions to figure out what is the biggest problem in this person's life."}, {"time": 820, "text": "Try to get a sense of what is the biggest problem in their life, because that's actually what they care about most."}, {"time": 825, "text": "And most people don't care enough to find out."}, {"time": 828, "text": "And so he kind of wants to sneak up on that and find that, and then use that to then build closeness in order to then probably, he doesn't put it in those words, but to manipulate the person into whatever, to do whatever the heck they want."}, {"time": 844, "text": "And I think part of it is that, and part of the effect that Donald Trump has is how quick he's able to figure that out."}, {"time": 854, "text": "You've written a book about how the role and power of the presidency has changed."}, {"time": 859, "text": "So how has it changed since Lincoln's time, the evolution of the presidency as a concept, which seems like a fascinating lens through which to look at American history."}, {"time": 873, "text": "As a president, we seem to only be talking about the presidents, maybe a general here and there, but it's mostly the story of America is often told through presidents."}, {"time": 886, "text": "And one of the points I've tried to make in my writing about this and various other activities is we use this word president as if it's something timeless, but the office has changed incredibly."}, {"time": 898, "text": "Just from Lincoln's time to the present, which is 150 years, he wouldn't recognize the office today."}, {"time": 905, "text": "And George Washington would not have recognized it in Lincoln, just as I think a CEO today would be unrecognizable to a Rockefeller or a Carnegie of 150 years ago."}, {"time": 916, "text": "So what are some of the ways in which the office has changed?"}, {"time": 918, "text": "I'll just point to three, there are a lot."}, {"time": 921, "text": "One, presidents now can communicate with the public directly."}, {"time": 925, "text": "I mean, we've reached the point now where a president can have direct, almost one on one communication."}, {"time": 930, "text": "President can use Twitter if he so chooses to circumvent all media."}, {"time": 935, "text": "That was unthinkable."}, {"time": 936, "text": "Lincoln, in order to get his message across, often wrote letters to newspapers."}, {"time": 940, "text": "And waited for the newspaper for Horace Greeley in the New York Tribune to publish his letter."}, {"time": 944, "text": "That's how he communicated with the public."}, {"time": 946, "text": "There weren't even many speaking opportunities."}, {"time": 948, "text": "So that's a big change, right?"}, {"time": 949, "text": "We feel the president in our life much more."}, {"time": 952, "text": "That's why we talk about him much more."}, {"time": 955, "text": "That also creates more of a burden."}, {"time": 956, "text": "This is the second point."}, {"time": 957, "text": "Presidents are under a microscope."}, {"time": 960, "text": "You have to be very careful what you do and what you say."}, {"time": 962, "text": "And you're judged by a lot of the elements of your behavior that are not policy relevant."}, {"time": 967, "text": "In fact, the things we judge most and make most of our decisions on about individuals are often that."}, {"time": 973, "text": "And then third, the power the president has."}, {"time": 977, "text": "It's inhuman, actually."}, {"time": 979, "text": "And this is one of my critiques of how the office has changed."}, {"time": 981, "text": "This one person has power on a scale that's I think dangerous in a democracy."}, {"time": 987, "text": "And certainly something the founders 220 years ago would have had trouble conceiving."}, {"time": 994, "text": "Presidents now have the ability to deliver force across the world to literally assassinate people with a remarkable accuracy."}, {"time": 1001, "text": "And that's an enormous power that presidents have."}, {"time": 1004, "text": "So your sense, this is not to get conspiratorial, but do you think a president currently has the power to initiate the assassination of somebody, of a political enemy or a terrorist leader or that kind of thing to frame that person in a way where assassination is something that he alone or she alone could decide to do?"}, {"time": 1032, "text": "I think it happens all the time and it's not to be conspiratorial."}, {"time": 1034, "text": "This is how we fought terrorism by targeting individuals."}, {"time": 1039, "text": "Now you might say these were not elected leaders of state, but these were individuals with a large following."}, {"time": 1043, "text": "I mean, the killing of Osama Bin Laden was an assassination operation."}, {"time": 1048, "text": "And we've taken out very successfully many leaders of terrorist organizations and we do it every day."}, {"time": 1055, "text": "You're saying that back in Lincoln's time or George Washington's time, there was more of a balance of power?"}, {"time": 1060, "text": "Like a president could not initiate this kind of assassination?"}, {"time": 1063, "text": "Correct, I think presidents did not have the same kind of military or economic power."}, {"time": 1069, "text": "We could talk about how a president can influence a market by saying something about where money is gonna go or singling out a company or critiquing a company in one way or another."}, {"time": 1081, "text": "They didn't have that kind of power."}, {"time": 1082, "text": "Now, much of the power that a Lincoln or a Washington had was the power to mobilize people to then make their own decisions."}, {"time": 1089, "text": "At the start of the Civil War, Lincoln doesn't even have the power to bring people into the army."}, {"time": 1093, "text": "He has to go to the governors and ask the governors to provide soldiers."}, {"time": 1098, "text": "So the governor of Wisconsin, the governor of Massachusetts."}, {"time": 1100, "text": "Could you imagine that today?"}, {"time": 1102, "text": "So, but yeah, so they use speeches and words to mobilize versus direct action in closed door environments, initiating wars, for example."}, {"time": 1117, "text": "It's difficult to think about, if we look at Barack Obama, for example, if you're listening to this and you're on the left or the right, please do not make this political."}, {"time": 1129, "text": "In fact, if you're a political person and you're getting angry at the mention of the word Obama or Donald Trump, please turn off this podcast that I've just described."}, {"time": 1137, "text": "We're not gonna get very far."}, {"time": 1139, "text": "I hope we maintain a political discussion about even the modern presidents that view through the lens of history."}, {"time": 1147, "text": "I think there's a lot to be learned about the office and about human nature."}, {"time": 1153, "text": "Some people criticize Barack Obama for sort of expanding the military industrial complex, engaging in more and more wars, as opposed to sort of the initial rhetoric was such that we would pull back from sort of be more skeptical in our decisions to wage wars."}, {"time": 1173, "text": "So from the lens of the power of the presidency, as the modern presidency, the fact that we continued the war in Afghanistan and different engagements in military conflicts, do you think Barack Obama could have stopped that?"}, {"time": 1192, "text": "Do you put the responsibility on that expansion on him because of the implied power that the presidency has?"}, {"time": 1199, "text": "Or is this power just sits there and if a president chooses to take it, they do, and if they don't, they don't?"}, {"time": 1206, "text": "Almost like you don't want to take on the responsibility because of the burden of that responsibility."}, {"time": 1212, "text": "So a lot of my research is about this exact question, not just with Obama."}, {"time": 1217, "text": "And my conclusion, and I think the research is pretty clear on this, is that structure has a lot more effect on us than we like to admit, which is to say that the circumstances, the institutions around us drive our behavior more than we like to think."}, {"time": 1230, "text": "So Barack Obama, I'm quite certain, came into the office of the presidency committed to actually reducing the use of military force overseas and reducing presidential war making power."}, {"time": 1240, "text": "As a trained lawyer, he had a moral position on this actually, and he tried."}, {"time": 1245, "text": "And he did withdraw American forces from Iraq and was of course criticized by many people for doing that."}, {"time": 1250, "text": "But at the same time, he had some real problems in the world to deal with, terrorism being one of them."}, {"time": 1255, "text": "And the tools he has are very much biased towards the use of military force."}, {"time": 1261, "text": "It's much harder as president to go and get Vladimir Putin and Xi Jinping to agree with you."}, {"time": 1266, "text": "It's much easier to send these wonderful toys we have and these incredible soldiers we have over there."}, {"time": 1272, "text": "And when you have Congress, which is always against you, it's also easier to use the military because you send them there."}, {"time": 1278, "text": "And even if members of Congress from your own party or the other are angry at you, they'll still fund the soldiers."}, {"time": 1284, "text": "No member of Congress wants to vote to starve our soldiers overseas."}, {"time": 1287, "text": "So they'll stop your budget, they'll even threaten not to pay the debt, but they'll still fund your soldiers."}, {"time": 1293, "text": "And so you are pushed by the circumstances you're in to do this, and it's very hard to resist."}, {"time": 1299, "text": "So that's, I think the criticism of Obama, the fair one would be that he didn't resist the pressures that were there, but he did not make those pressures."}, {"time": 1307, "text": "So is there something about putting the responsibility on the president to form the structure around him locally such that he can make the policy that matches the rhetoric?"}, {"time": 1321, "text": "So what I'm talking to is hiring."}, {"time": 1325, "text": "So basically just everybody you work with, you have power as a president to fire and hire or to basically schedule meetings in such a way that can control your decision making."}, {"time": 1339, "text": "So I imagine it's very difficult to get out of Afghanistan or Iraq when most of your scheduled meetings are with generals or something like that."}, {"time": 1351, "text": "But if you reorganize the schedule and you reorganize who you have like late night talks with, you potentially have a huge ripple effect on the policy."}, {"time": 1362, "text": "I think who has access to the president is absolutely crucial."}, {"time": 1365, "text": "And presidents have to be more strategic about that."}, {"time": 1368, "text": "They tend to be reacting to crises because every day has a crisis."}, {"time": 1372, "text": "And if you're reacting to a crisis, you're not controlling access because the crisis is driving you."}, {"time": 1376, "text": "So that's one element of it."}, {"time": 1377, "text": "But I also think, and this is the moment we're in right now, presidents have to invest in reforming the system, the system of decision making."}, {"time": 1385, "text": "Should we have a national security council that looks the way it does?"}, {"time": 1389, "text": "Should our military be structured the way it is?"}, {"time": 1391, "text": "The founding fathers wanted a military that was divided."}, {"time": 1394, "text": "They did not want a unified department of defense."}, {"time": 1397, "text": "That was only created after World War II."}, {"time": 1399, "text": "Should we have as large a military as we have?"}, {"time": 1400, "text": "Should we be in as many places?"}, {"time": 1403, "text": "There are some fundamental structural reforms we have to undertake."}, {"time": 1406, "text": "And part of that is who you appoint, but part of that is also how you change the institutions."}, {"time": 1410, "text": "The genius of the American system is that it's a dynamic system."}, {"time": 1414, "text": "It can be adjusted."}, {"time": 1415, "text": "It has been adjusted over time."}, {"time": 1417, "text": "That's the heroic story."}, {"time": 1419, "text": "The frustrating story is it often takes us a long time to make those adjustments until we go into such bad circumstances that we have no choice."}, {"time": 1428, "text": "So in the battle of power of the office of the president versus the United States military, the department of defense, do you have a sense that the president has more power ultimately?"}, {"time": 1441, "text": "So to decrease the size of the department of defense, to withdraw from any wars, or increase the amount of wars, is the president, you're kind of implying the president has a lot of power here in this scale."}, {"time": 1456, "text": "Yes, the president has a lot of power and we are fortunate and it was just proven in the last few years that our military, uniquely among many countries with large militaries, is very deferential to the president and very restricted in its ability to challenge the president."}, {"time": 1471, "text": "So that's a strength of our system."}, {"time": 1473, "text": "But the way you reform the military is not with individual decisions."}, {"time": 1477, "text": "It's by having a strategic plan that reexamines what role it plays."}, {"time": 1483, "text": "So it's not just about whether we're in Afghanistan or not."}, {"time": 1485, "text": "The question we have to ask is, when we look at our toolbox of what we can do in our foreign policy, are there other tools we should build up and therefore some tools in the military we should reduce?"}, {"time": 1498, "text": "That's the broader strategic question."}, {"time": 1500, "text": "Let me ask you the most absurd question of all that you did not sign up for, but I've been hanging out with a guy named Joe Rogan recently, so it's very important for me and him to figure this out."}, {"time": 1513, "text": "If a president, because you said, you implied the president's very powerful, if a president shows up and the US government is in fact in possession of aliens, alien spacecraft, do you think the president will be told?"}, {"time": 1528, "text": "A more responsible adult historian question version of that is, is there some things that the machine of government keeps secret from the president?"}, {"time": 1540, "text": "Or is the president ultimately at the very center?"}, {"time": 1542, "text": "So if you map out the set of information and power, you have CIA, you have all these organizations that do the machinery of government, not just the passing of bills, but gaining information, homeland security, actually engaging in wars, all those kinds of things."}, {"time": 1566, "text": "How central is the president?"}, {"time": 1569, "text": "Would the president know some of the shady things that are going on?"}, {"time": 1574, "text": "Aliens or some kind of cybersecurity stuff against Russia and China, all those kinds of things, is the president really made aware?"}, {"time": 1583, "text": "And if so, how nervous does that make you?"}, {"time": 1586, "text": "So presidents like leaders of any complex organizations don't know everything that goes on."}, {"time": 1592, "text": "They have to ask the right questions."}, {"time": 1594, "text": "This is Machiavelli."}, {"time": 1595, "text": "Most important thing a leader has to do is ask the right questions."}, {"time": 1600, "text": "You don't have to know the answers."}, {"time": 1601, "text": "That's why you hire smart people, but you have to ask the right questions."}, {"time": 1605, "text": "So if the president asks the US government, those who are responsible for the aliens or responsible for the cyber warfare against Russia, they will answer honestly, they will have to, but they will not volunteer that information in all cases."}, {"time": 1620, "text": "So the best way a president can operate is to have people around him or her who are not the traditional policymakers, this is where I think academic experts are important, suggesting questions to ask to therefore try to get the information."}, {"time": 1634, "text": "It makes me nervous because I think human nature is such that the academics, the experts, everybody is almost afraid to ask the questions for which the answers might be burdensome."}, {"time": 1653, "text": "And so that's right."}, {"time": 1654, "text": "And you can get into a lot of trouble not asking, it's the old elephant in the room."}, {"time": 1662, "text": "This is exactly right."}, {"time": 1664, "text": "And too often mediocre leaders and those who try to protect them try to shield themselves."}, {"time": 1669, "text": "They don't want to know certain things."}, {"time": 1671, "text": "So this is part of what happened with the use of torture by the United States, which is a war crime during the war on terror."}, {"time": 1679, "text": "President Bush at times intentionally did not ask and people around him prevented him from asking or discouraged him from asking questions he should have asked to know about what was going on."}, {"time": 1689, "text": "And that's how we ended up where we did."}, {"time": 1692, "text": "You could say the same thing about Reagan and Iran Contra."}, {"time": 1695, "text": "I wonder what it takes to be the kind of leader that steps in and asks some difficult questions."}, {"time": 1701, "text": "So aliens is one, UFO spacecraft, right?"}, {"time": 1705, "text": "Another one, yeah, torture is another one."}, {"time": 1708, "text": "The CIA, how much information is being collected about Americans?"}, {"time": 1712, "text": "I can see as a president being very uncomfortable asking that question."}, {"time": 1717, "text": "Because if the answer is a lot of information is being collected by Americans, then you have to be the guy who lives with that information."}, {"time": 1726, "text": "For the rest of your life, you have to walk around."}, {"time": 1730, "text": "You're probably not going to reform that system."}, {"time": 1734, "text": "You probably have to be very picky about which things you reform."}, {"time": 1737, "text": "You don't have much time."}, {"time": 1738, "text": "It takes a lot of sort of effort to restructure things."}, {"time": 1741, "text": "But you nevertheless would have to be basically lying to yourself, to others around you about the unethical things."}, {"time": 1753, "text": "Depends of course what your ethical system is."}, {"time": 1757, "text": "I wonder what it takes to ask those hard questions."}, {"time": 1760, "text": "I wonder if how few of us can be great leaders like that."}, {"time": 1765, "text": "And I wonder if our political system, the electoral system is such that makes it likely that such leaders will come to power."}, {"time": 1774, "text": "It's hard and you can't ask all the right questions and there is a legal hazard if you know things at certain times."}, {"time": 1780, "text": "But I think you can, back to your point on hiring, you can hire people who will do that in their domains."}, {"time": 1785, "text": "And then you have to trust that when they think it's something that's a question you need to ask, they'll pass that on to you."}, {"time": 1791, "text": "This is why it's not a good idea to have loyalists because loyalists will shield you from things."}, {"time": 1797, "text": "It's a good idea to have people of integrity who you can rely on and who you think will ask those right questions and then pass that down through their organization."}, {"time": 1806, "text": "What's inspiring to you, what's insightful to you about several of the presidencies throughout the recent decades?"}, {"time": 1814, "text": "Is there somebody that stands out to you that's interesting and sort of in your study of how the office has changed?"}, {"time": 1821, "text": "Well, Bill Clinton is one of the most fascinating figures."}, {"time": 1825, "text": "Why can't I, I apologize."}, {"time": 1826, "text": "Bill Clinton just puts a smile on my face every time somebody mentions him at this point."}, {"time": 1831, "text": "I guess it's charisma, I suppose."}, {"time": 1833, "text": "Well, and he's a unique individual, but he fascinates me because he's a figure of such enormous talent and enormous appetite and such little self control and such extremes."}, {"time": 1850, "text": "And I think it's not just that he tells us something about the presidency, he tells us something about our society."}, {"time": 1856, "text": "American society, this is not new to our time, is filled with enormous reservoirs of talent and creativity."}, {"time": 1862, "text": "And those have a bright and a dark side."}, {"time": 1865, "text": "And you see both with Bill Clinton."}, {"time": 1866, "text": "In some ways, he's the mirror of the best and worst of our society."}, {"time": 1870, "text": "And maybe that's really what presidents are in the end."}, {"time": 1873, "text": "They're mirrors of our world that we get the government we deserve, we get the leaders we deserve."}, {"time": 1878, "text": "I wish we embraced that a little bit more."}, {"time": 1880, "text": "A lot of people criticize Donald Trump for certain human qualities that he has."}, {"time": 1884, "text": "A lot of people criticize Bill Clinton for certain human qualities."}, {"time": 1888, "text": "I wish we kind of embraced the chaos of that."}, {"time": 1892, "text": "Because he does, you're right, in some sense represent, I mean, he doesn't represent the greatest ideal of America, but the flawed aspect of human nature is what he represents."}, {"time": 1903, "text": "And that's the beautiful thing about America, the diversity of this land with the mix of it, the corruption within capitalism, the beauty of capitalism, the innovation, all those kinds of things, the people that start from nothing and create everything, the Elon Musk's of the world and the Bill Gates and so on."}, {"time": 1924, "text": "But also the people, Bernie Mados and all, as the Me Too movement has showed the multitude of creeps that apparently permeate the entirety of our system."}, {"time": 1935, "text": "So I don't know, there is something, there is some sense in which we put our president on a pedestal, which actually creates a fake human being."}, {"time": 1950, "text": "Like the standard we hold them to is forcing the fake politicians to come to power versus the authentic one, which is in some sense, the promise of Donald Trump is like, it's a definitive statement of authenticity."}, {"time": 1966, "text": "It's like, this is the opposite of the fake politician."}, {"time": 1970, "text": "It's whatever else you wanna say about him is there's the chaos that's unlike anything else that came before."}, {"time": 1977, "text": "One thing, and this is a particular maybe preference and quirk of mine, but I really admire, maybe I'm romanticizing the past again, but I romanticize the presidents that were students of history."}, {"time": 1989, "text": "They were almost like king philosophers, that made speeches that reverberated through decades after."}, {"time": 2006, "text": "Using the words of those presidents, whether written by them or not, we tell the story of America."}, {"time": 2013, "text": "And I don't know, even Obama has been an exceptionally good, as far as I know, I apologize if I'm incorrect on this, but from everything I've seen, he was a very deep scholar of history."}, {"time": 2025, "text": "And I really admire that."}, {"time": 2028, "text": "Is that through the history of the office of the presidency, is that just your own preference or is that supposed to come with the job?"}, {"time": 2038, "text": "Are you supposed to be a student of history?"}, {"time": 2040, "text": "I think, I mean, I'm obviously biased as a historian, but I do think it comes with the job."}, {"time": 2043, "text": "Every president I've studied had a serious interest in history."}, {"time": 2049, "text": "Now, how they pursued that interest would vary."}, {"time": 2053, "text": "Obama was more bookish, more academic."}, {"time": 2056, "text": "So was George W. Bush in strange ways."}, {"time": 2058, "text": "George H. W. Bush was less so, but George H. W. Bush loved to talk to people."}, {"time": 2062, "text": "So he would talk to historians, right?"}, {"time": 2064, "text": "Ronald Reagan loved movies and movies were an insight into history for him."}, {"time": 2070, "text": "He likes to watch movies about another time."}, {"time": 2072, "text": "It wasn't always the best of history, but he was interested in what is a fundamental historical question."}, {"time": 2078, "text": "How has our society developed?"}, {"time": 2080, "text": "How has it grown and changed over time?"}, {"time": 2083, "text": "And how has that change affected who we are today?"}, {"time": 2086, "text": "That's the historical question."}, {"time": 2088, "text": "It's really interesting to me."}, {"time": 2090, "text": "I do a lot of work with business leaders and others too."}, {"time": 2093, "text": "You reach a certain point in any career and you become a historian because you realize that the formulas and the technical knowledge that you've gained got you to where you are."}, {"time": 2104, "text": "But now your decisions are about human nature."}, {"time": 2107, "text": "Your decisions are about social change and they can't be answered technically."}, {"time": 2112, "text": "They can only be answered by studying human beings."}, {"time": 2115, "text": "And what is history?"}, {"time": 2115, "text": "It's studying the laboratory of human behavior."}, {"time": 2119, "text": "To sort of play devil's advocate, I kind of, especially in the engineering scientific domains, I often see history holding us back."}, {"time": 2130, "text": "Sort of the way things were done in the past are not necessarily going to hold the key to what will progress us into the future."}, {"time": 2143, "text": "Of course, with history in studying human nature, it does seem like humans are just the same."}, {"time": 2149, "text": "She has like the same problems over and over."}, {"time": 2151, "text": "So in that sense, it feels like history has all the lessons, whether we're talking about wars, whether we're talking about corruption, whether we're talking about economics."}, {"time": 2162, "text": "I think there's a difference between history and antiquarianism."}, {"time": 2166, "text": "So antiquarianism, which some people call history, is the desire to go back to the past or stay stuck in the past."}, {"time": 2173, "text": "So antiquarianism is the desire to have the desk that Abraham Lincoln sat at."}, {"time": 2177, "text": "Wouldn't it be cool to sit at his desk?"}, {"time": 2179, "text": "I'd love to have that desk."}, {"time": 2180, "text": "If I had a few extra million dollars, I'd acquire it."}, {"time": 2182, "text": "So in a way, that's antiquarianism."}, {"time": 2185, "text": "That's trying to capture and hold on to the past."}, {"time": 2188, "text": "The past is a talisman for antiquarians."}, {"time": 2192, "text": "What history is, is the study of change over time."}, {"time": 2195, "text": "That's the real definition of historical study and historical thinking."}, {"time": 2199, "text": "And so what we're studying is change."}, {"time": 2202, "text": "And so a historian should never say, we have to do things the way we've done them in the past."}, {"time": 2207, "text": "The historian should say, we can't do them the way we did them in the past."}, {"time": 2211, "text": "We can't step in the same river twice."}, {"time": 2213, "text": "Every podcast of yours is different from the last one."}, {"time": 2216, "text": "You plan it out and then it goes in its own direction."}, {"time": 2220, "text": "And what are we studying then in history?"}, {"time": 2222, "text": "We're studying the patterns of change and we're recognizing we're part of a pattern."}, {"time": 2228, "text": "So what I would say to the historian who's trying to hold the engineer back, I'd say, no, don't tell that engineer not to do this."}, {"time": 2234, "text": "Tell them to understand how this fits into the relationship with other engineering products and other activities from the past that still affect us today."}, {"time": 2243, "text": "For example, any product you produce is gonna be used by human beings who have prejudices."}, {"time": 2248, "text": "It's gonna go into an unequal society."}, {"time": 2250, "text": "Don't assume it's gonna go into an equal society."}, {"time": 2252, "text": "Don't assume that when you create a social media site that people are going to use it fairly and put only truthful things on it."}, {"time": 2258, "text": "We shouldn't be surprised."}, {"time": 2259, "text": "That's where human nature comes in."}, {"time": 2262, "text": "But it's not trying to hold onto the past."}, {"time": 2263, "text": "It's trying to use the knowledge from the past to better inform the changes today."}, {"time": 2268, "text": "I have to ask you about George Washington."}, {"time": 2270, "text": "Maybe you have some insights."}, {"time": 2272, "text": "It seems like he's such a fascinating figure in the context of the study of power."}, {"time": 2279, "text": "Because I kind of intuitively have come to internalize the belief that power corrupts and absolute power corrupts absolutely."}, {"time": 2291, "text": "And sort of like basically in thinking that we cannot trust any one individual."}, {"time": 2298, "text": "I can't trust myself with power."}, {"time": 2300, "text": "Nobody can trust anybody with power."}, {"time": 2302, "text": "We have to create institutions and structures that prevent us from ever being able to amass absolute power."}, {"time": 2309, "text": "And yet, here's a guy, George Washington, who seems to, you can correct me if I'm wrong, but he seems to give away, relinquish power."}, {"time": 2317, "text": "It feels like George Washington did it almost like the purest of ways, which is believes in this country, but he just believes he's not the person to carry it forward."}, {"time": 2335, "text": "What kind of human does it take to give away that power?"}, {"time": 2338, "text": "Is there some hopeful message we can carry through to the future to elect leaders like that or to find friends to hang out with who are like that?"}, {"time": 2351, "text": "So it's actually the most important thing about George Washington."}, {"time": 2354, "text": "It's the right thing to bring up."}, {"time": 2356, "text": "What the historian Gary Wills wrote years ago, I'm gonna quote him, was that Washington recognized that sometimes you get more power by giving it up than by trying to hold on to every last piece of it."}, {"time": 2370, "text": "Washington gives up power at the end of the revolution."}, {"time": 2372, "text": "He's successfully carried through the revolutionary war aims."}, {"time": 2375, "text": "He's commander of the revolutionary forces and he gives up his command."}, {"time": 2380, "text": "And then of course he's president and after two terms, he gives up his command."}, {"time": 2383, "text": "What is he doing?"}, {"time": 2384, "text": "He's an ambitious person, but he's recognizing that the most important currency he has for power is his respected status as a disinterested statesman."}, {"time": 2396, "text": "That's really what his power is."}, {"time": 2398, "text": "And how does he further that power?"}, {"time": 2400, "text": "By showing that he doesn't crave power."}, {"time": 2404, "text": "So he was self aware."}, {"time": 2405, "text": "Very self aware of this and very sophisticated in understanding this."}, {"time": 2410, "text": "And I think there are many other leaders who recognize that."}, {"time": 2414, "text": "You can look to, in some ways, the story of many of our presidents who even before there is a two term limit in the constitution, leave after two terms."}, {"time": 2426, "text": "They do that because they recognize that their power is the power of being a statesman, not of being a president."}, {"time": 2434, "text": "I still wonder what kind of man it takes, what kind of human being it takes to do that."}, {"time": 2439, "text": "Because I've been studying Vladimir Putin quite a bit."}, {"time": 2444, "text": "And he's still, I believe he still has popular support that that's not fully manipulated."}, {"time": 2454, "text": "Because I know a lot of people in Russia and actually almost the entirety of my family in Russia are big supporters of Putin."}, {"time": 2461, "text": "And everybody I talk to sort of, that's not just like on social media."}, {"time": 2466, "text": "Like the people that live in Russia seem to support him."}, {"time": 2470, "text": "It feels like this will be in a George Washington way."}, {"time": 2476, "text": "Now will be the time that Putin, just like Yeltsin, could relinquish power."}, {"time": 2482, "text": "And thereby, in the eyes of Russians, become, in like the long arc of history, be viewed as a great leader."}, {"time": 2491, "text": "You look at the economic growth of Russia, you look at the rescue from the collapse of the Soviet Union and Russia finding its footing, and then relinquishing power in a way that perhaps, if Russia succeeds, forms a truly democratic state."}, {"time": 2508, "text": "This would be how Putin can become one of the great leaders in Russian history, at least in the context of the 21st century."}, {"time": 2515, "text": "I think there are two reasons why this is really hard for Putin and for others."}, {"time": 2521, "text": "One is the trappings of power are very seductive, as you said before, they're corrupting."}, {"time": 2527, "text": "This is a real problem, right?"}, {"time": 2529, "text": "If it's in the business context, you don't wanna give up that private jet."}, {"time": 2533, "text": "If it's in Putin's context, it's billions of dollars every year that he's able to take for himself or give to his friends."}, {"time": 2539, "text": "It's not that he'll be poor if he leaves, he'll still be rich, and he has billions of dollars stored away, but he won't be able to get the new billions."}, {"time": 2546, "text": "And so that's part of it, the trappings of power are a big deal."}, {"time": 2550, "text": "And then second, in Putin's case in particular, he has to be worried about what happens next."}, {"time": 2554, "text": "Will he be tried?"}, {"time": 2555, "text": "Will someone try to come and arrest him?"}, {"time": 2558, "text": "Will someone try to come and assassinate him?"}, {"time": 2561, "text": "Washington recognized that leaving early limited the corruption and limited the enemies that you made."}, {"time": 2568, "text": "And so it was a strategic choice."}, {"time": 2570, "text": "Putin is at this point bringing power too long."}, {"time": 2573, "text": "And this comes back to your core insight."}, {"time": 2575, "text": "It's a cliche, but it's true, power corrupts."}, {"time": 2577, "text": "No one should have power for too long."}, {"time": 2579, "text": "This was one of the best insights the founders of the United States had, that power was to be held for a short time as a fiduciary responsibility, not as something you owned, right?"}, {"time": 2588, "text": "This is the problem with monarchy, with aristocracy, that you own power, right?"}, {"time": 2592, "text": "We don't own power, we're holding it in trust."}, {"time": 2597, "text": "Yeah, there's some probably like very specific psychological study of how many years it takes for you to forget that you can't own power."}, {"time": 2609, "text": "That could be a much more rigorous discussion about the length of terms that are appropriate, but really there's an amount, like Stalin had power for 30 years, like Putin is pushing those that many years already."}, {"time": 2624, "text": "There's a certain point where you forget the person you were before you took the power."}, {"time": 2629, "text": "You forget to be humble in the face of this responsibility and then there's no going back."}, {"time": 2635, "text": "And that's how dictators are born."}, {"time": 2637, "text": "That's how the evil like authoritarians become evil or let's not use the word evil, but counterproductive, destructive to the ideal that they initially probably came to office with."}, {"time": 2655, "text": "One of the core historical insights is people should move jobs."}, {"time": 2659, "text": "And this applies for CEOs probably."}, {"time": 2662, "text": "They can go become CEO somewhere else, but don't stay CEO one place too long."}, {"time": 2666, "text": "It's a problem with startups, right?"}, {"time": 2667, "text": "The founder, you can have a brilliant founder and that founder doesn't want to let go."}, {"time": 2672, "text": "Right, it's the same issue."}, {"time": 2673, "text": "At the same time, I mean, this is where Elon Musk and a few others like Larry Page and Sergey Brin that stayed for quite a long time and they actually were the beacon."}, {"time": 2685, "text": "They, on their shoulders, carried the dream of the company where everybody else doubted."}, {"time": 2691, "text": "But that seems to be the exception versus the rule."}, {"time": 2694, "text": "Well, and even Sergey, for example, has stepped back."}, {"time": 2697, "text": "He plays less of a day to day role and is not running Google in the way he did."}, {"time": 2701, "text": "But the interesting thing is he stepped back in a quite tragic way from what I've seen, which is, I think Google's mission, initial mission of making the world's information accessible to everybody is one of the most beautiful missions of any company in the history of the world."}, {"time": 2718, "text": "I think it's what Google has done with the search engine and other efforts that are similar, like scanning a lot of books, it's just incredible."}, {"time": 2729, "text": "It's similar to Wikipedia."}, {"time": 2732, "text": "But what he said was that it's not the same company anymore."}, {"time": 2738, "text": "And I know maybe I'm reading too much into it because it's more maybe practically saying just the size of the company is much larger, the kind of leadership that's required."}, {"time": 2747, "text": "But at the same time, they changed the model from don't be evil to it's becoming corporatized and all those kinds of things and it's sad."}, {"time": 2756, "text": "There also are cycles, right?"}, {"time": 2759, "text": "History is about cycles, right?"}, {"time": 2761, "text": "There are cycles to life, there are cycles to organizations."}, {"time": 2765, "text": "I mean, it's sad Steve Jobs leaving Apple by passing away, sad."}, {"time": 2771, "text": "You know, what the future of SpaceX and Tesla looks like without Elon Musk is quite sad."}, {"time": 2776, "text": "It's very possible that those companies become something very different."}, {"time": 2780, "text": "They become something much more like corporate and stale, yeah."}, {"time": 2788, "text": "So maybe most of the progress is made through cycles."}, {"time": 2791, "text": "Maybe a new Elon Musk comes along and all those kinds of things."}, {"time": 2795, "text": "But it does seem that the American system of government has built into it the cycling that makes it effective and it makes it last very long."}, {"time": 2807, "text": "It lasts a very long time, right?"}, {"time": 2810, "text": "It continues to excel and lead the world."}, {"time": 2815, "text": "And let's hope it continues to."}, {"time": 2816, "text": "No, I mean, we're into a third century and democracies on this scale rarely last that long."}, {"time": 2823, "text": "So that's a point of pride, but it also means we need to be attentive to keep our house in order because it's not inevitable that this experiment continues."}, {"time": 2834, "text": "Now it's important to meditate on that actually."}, {"time": 2837, "text": "You've mentioned that FDR, Franklin D. Roosevelt is one of the great leaders in American history."}, {"time": 2845, "text": "Franklin Roosevelt had the power of empathy."}, {"time": 2849, "text": "No leader that I've ever studied or been around or spent any time reading about was able to connect with people who were so different from himself as Franklin Roosevelt."}, {"time": 2859, "text": "He came from the most elite family."}, {"time": 2860, "text": "He never had to work for a paycheck in his life."}, {"time": 2863, "text": "When he was president, he was still collecting an allowance from his mom."}, {"time": 2866, "text": "I mean, you couldn't be more elite than Franklin Roosevelt, but he authentically connected."}, {"time": 2872, "text": "This was not propaganda."}, {"time": 2874, "text": "He was able to feel the pain and understand the lives of some of the most destitute Americans in other parts of the country."}, {"time": 2882, "text": "So through one of the hardest economic periods of American history, he was able to feel the pain."}, {"time": 2888, "text": "He was able to, the number of immigrants I read oral histories from or who have written themselves, Saul Bellow is one example, the great novelist who talk about how as immigrants to the US, Saul Bellow was a Russian Jewish immigrant."}, {"time": 2899, "text": "He said, growing up in Chicago, politicians were all trying to steal from us."}, {"time": 2902, "text": "I didn't think any of them cared until I heard FDR."}, {"time": 2905, "text": "And I knew he spoke to me."}, {"time": 2907, "text": "And I think part of it was FDR really tried to understand people."}, {"time": 2912, "text": "That's the first thing, he was humble enough to try to do that."}, {"time": 2914, "text": "But second, he had a talent for that."}, {"time": 2916, "text": "And it's hard to know exactly what it was, but he had a talent for putting himself, imagining himself in someone else's shoes."}, {"time": 2923, "text": "What stands out to you as important?"}, {"time": 2928, "text": "I mean, so he was, he went through the great depression."}, {"time": 2931, "text": "The, so the new deal, which some people criticize, some people see, I mean, it's funny to look at some of these policies and their long ripple effects."}, {"time": 2943, "text": "But at the time, it's some of the most innovative policies in the history of America."}, {"time": 2949, "text": "You could say they're ultimately not good for America, but they're nevertheless hold within them very rich and important lessons."}, {"time": 2957, "text": "But the new deal, obviously World War II, that entire process, is there something that stands out to you as a particularly great moment that made FDR?"}, {"time": 2970, "text": "Yes, I think what FDR does from his first 100 days in office forward, and this begins with his fireside chats, is he helps Americans to see that they're all in it together."}, {"time": 2983, "text": "And that's by creating hope and creating a sense of common suffering and common mission."}, {"time": 2989, "text": "It's not offering simple solutions."}, {"time": 2991, "text": "One of the lessons from FDR is, if you wanna bring people together, don't offer a simple solution."}, {"time": 2996, "text": "Because as soon as I offer a simple solution, I have people for it and against it."}, {"time": 3000, "text": "Don't do that."}, {"time": 3000, "text": "Explain the problem, frame the problem, and then give people a mission."}, {"time": 3005, "text": "So Roosevelt's first radio address in March of 1933, the banking system is collapsing."}, {"time": 3012, "text": "And we can't imagine it, right?"}, {"time": 3013, "text": "Banks were closing and you couldn't get your money out."}, {"time": 3016, "text": "Your life savings would be lost, right?"}, {"time": 3017, "text": "We can't imagine that happening in our world today."}, {"time": 3020, "text": "He comes on the radio, he takes five minutes to explain how banking works."}, {"time": 3024, "text": "Most people didn't understand how banking worked, right?"}, {"time": 3026, "text": "They don't actually hold your money in a vault."}, {"time": 3028, "text": "They lend it out to someone else."}, {"time": 3030, "text": "And then he explains why if you go and take your money out of the bank and put it in your mattress, you're making it worse for yourself."}, {"time": 3036, "text": "He explains this."}, {"time": 3038, "text": "And then he says, I don't have a solution, but here's what I'm gonna do."}, {"time": 3042, "text": "I'm gonna send in government officers to examine the banks and show you the books on the banks."}, {"time": 3048, "text": "And I want you to help me by going and putting your money back in the bank."}, {"time": 3052, "text": "We're all gonna do this together."}, {"time": 3054, "text": "No simple solution, no ideological statement, but a sense of common mission."}, {"time": 3058, "text": "Let's go out and do this together."}, {"time": 3060, "text": "When you read as I have so many of these oral histories and memoirs for people who lived through that period, many of them disagreed with some of his policies."}, {"time": 3068, "text": "Many of them thought he was too close to Jews and they didn't like the fact he had a woman in his cabinet and all that, but they felt he cared."}, {"time": 3075, "text": "And they felt they were part of some common mission."}, {"time": 3078, "text": "And when they talk about their experience fighting in World War II, whether in Europe or Asia, it was that that prepared them."}, {"time": 3084, "text": "They knew what it meant to be an American when they were over there."}, {"time": 3087, "text": "So that to me is a model of leadership."}, {"time": 3090, "text": "And I think that's as possible today as it's ever been."}, {"time": 3093, "text": "So you think it's possible, like I was going to ask this, again, it may be a very shallow view, but it feels like this country is more divided than it has been in recent history."}, {"time": 3108, "text": "Perhaps the social media and all those kinds of things are merely revealing the division as opposed to creating the division."}, {"time": 3116, "text": "But is it possible to have a leader that unites in the same way that FDR did without, well, we're living through a pandemic."}, {"time": 3126, "text": "This is already, so like, I was going to say without suffering, but this is economic suffering."}, {"time": 3132, "text": "A huge number of people have lost their job."}, {"time": 3134, "text": "So is it possible to have, is there one a hunger?"}, {"time": 3138, "text": "Is there a possibility to have an FDR style leader who unites?"}, {"time": 3142, "text": "Yes, I think that is what President Biden is trying."}, {"time": 3145, "text": "I'm not saying he'll succeed, but I think that's what he's trying to do."}, {"time": 3149, "text": "The way you do this is you do not allow yourself to be captured by your opponents in Congress or somewhere else."}, {"time": 3156, "text": "FDR had a lot of opponents in Congress."}, {"time": 3158, "text": "He had a lot of opponents in politics, governors and others who didn't like him."}, {"time": 3161, "text": "Herbert Hoover was still around and still accusing FDR of being a conspiratist and all these other things."}, {"time": 3168, "text": "So you don't allow yourself to be captured by the leaders of the other side."}, {"time": 3173, "text": "You go over their heads to the people."}, {"time": 3175, "text": "And so today, the way to do this is to explain to people and empathize with the suffering and dislocation and difficulties they're dealing with and show that you're trying to help them."}, {"time": 3185, "text": "Not an easy solution, not a simple statement, but here are some things we can all do together."}, {"time": 3191, "text": "That's why I think infrastructure makes a lot of sense."}, {"time": 3193, "text": "It's what FDR invested into, right?"}, {"time": 3195, "text": "FDR built Hoover Dam."}, {"time": 3197, "text": "Hoover Dam turned the lights on for young Lyndon Johnson who grew up outside of Austin, right?"}, {"time": 3202, "text": "FDR was the one who invested in road construction that was then continued by Dwight Eisenhower, by a Republican with the interstate highway system, right?"}, {"time": 3211, "text": "FDR invested through the WPA in building thousands of schools in our country, planting trees."}, {"time": 3217, "text": "That's the kind of work that can bring people together."}, {"time": 3220, "text": "You don't have to be a Democrat or a Republican to say, you know what, we'd be a lot better off in my community if we had better infrastructure today."}, {"time": 3227, "text": "I wanna be a part of that."}, {"time": 3228, "text": "Oh, well, maybe I can get a job doing that."}, {"time": 3229, "text": "Maybe my company can benefit from that."}, {"time": 3232, "text": "You bring people together and that way it becomes a common mission, even if we have different ideological positions."}, {"time": 3241, "text": "When I first heard Joe Biden, many years ago, I think he ran for president against Obama."}, {"time": 3250, "text": "Before I heard him speak, I really liked him."}, {"time": 3253, "text": "But once I heard him speak, I started liking him less and less."}, {"time": 3257, "text": "And it speaks to something interesting, where it's hard to put into words why you connect with people."}, {"time": 3264, "text": "The empathy that you mentioned in FDR, you have these bad, pardon the French, motherfuckers like Teddy Roosevelt that connect with you."}, {"time": 3273, "text": "There's something just powerful."}, {"time": 3275, "text": "And with Joe Biden, I wanna really like him."}, {"time": 3279, "text": "And there's something not quite there where it feels like he doesn't quite know my pain, even though he, on paper, is exactly, he knows the pain of the people and there's something not connecting."}, {"time": 3292, "text": "And it's hard to explain."}, {"time": 3293, "text": "It's hard to put into words."}, {"time": 3295, "text": "And it makes me not, as an engineer and scientist, it makes me not feel good about presidencies because it makes me feel like it's more art than science."}, {"time": 3308, "text": "It is an art."}, {"time": 3309, "text": "And I think it's exactly an art for the reasons you laid out, it's aesthetic."}, {"time": 3313, "text": "It's about feeling, it's about emotion, all the things that we can't engineer."}, {"time": 3316, "text": "We've tried for centuries to engineer emotion."}, {"time": 3318, "text": "We're never gonna do it."}, {"time": 3319, "text": "Don't try it."}, {"time": 3320, "text": "I'm a parent of teenagers."}, {"time": 3321, "text": "Don't even try to explain emotion."}, {"time": 3324, "text": "But you hit on the key point and the key challenge for Biden."}, {"time": 3327, "text": "He's gotta find the right words."}, {"time": 3328, "text": "It's not finding the words to bullshit people."}, {"time": 3332, "text": "It's finding the words to help express."}, {"time": 3334, "text": "We've all felt empowered and felt good."}, {"time": 3336, "text": "When someone uses words that put into words what we're feeling, that's what he needs."}, {"time": 3341, "text": "That's the job of a leader."}, {"time": 3342, "text": "And there's certain words, I haven't heard many politicians use those words, but there's certain words that make you forget that you're for immigration or against immigration."}, {"time": 3354, "text": "Make you forget whether you're for wars and against wars."}, {"time": 3357, "text": "Make you forget about the bickering and somehow inspire you, elevate you to believe in the greatness that this country could be."}, {"time": 3368, "text": "In that same way, the reason I moved to Austin, it's funny to say, I just heard words from people, from friends, where they're excited by the possibility of the future here."}, {"time": 3381, "text": "I wasn't thinking like, what's the right thing to do?"}, {"time": 3384, "text": "What's the strategic, cause I wanna launch a business."}, {"time": 3388, "text": "There's a lot of arguments for San Francisco or maybe staying in Boston in my case, but there's this excitement that was beyond reason."}, {"time": 3397, "text": "That was emotional."}, {"time": 3398, "text": "And that's what it seems like."}, {"time": 3400, "text": "That's what builds, that's what great leaders do, but that's what builds countries."}, {"time": 3405, "text": "That's what builds great businesses."}, {"time": 3408, "text": "And it's what people say about Austin, for example, all the time."}, {"time": 3411, "text": "A talented people who come here like yourself."}, {"time": 3414, "text": "And here's the interesting thing."}, {"time": 3415, "text": "No one person creates that."}, {"time": 3416, "text": "The words emerge."}, {"time": 3418, "text": "And part of what FDR understood, you've got to find the words out there and use them."}, {"time": 3423, "text": "You don't have to be the creator of them."}, {"time": 3425, "text": "Just as the great painter doesn't invent the painting, they're taking things from others."}, {"time": 3430, "text": "As a small aside, is there something you could say about FDR and Hitler?"}, {"time": 3439, "text": "I constantly tried to think, can this person, can this moment in history have been circumvented, prevented?"}, {"time": 3449, "text": "Can Hitler have been stopped?"}, {"time": 3451, "text": "Can some of the atrocities from my own family that my grandparents had to live through the starvation in the Soviet Union, so the thing that people don't often talk about is the atrocities committed by Stalin and his own people."}, {"time": 3466, "text": "It feels like here's this great leader, FDR, that had the chance to have an impact on the world that he already probably had a great positive impact, but had a chance to stop maybe World War II or stop some of the evils."}, {"time": 3492, "text": "When you look at how weak Hitler was from much of the 30s relative to militarily, relative to everything else, how many people could have done a lot to stop him?"}, {"time": 3503, "text": "And FDR in particular didn't."}, {"time": 3506, "text": "He tried to play, not pacify, but basically do diplomacy and let Germany do Germany, let Europe do Europe, and focus on America."}, {"time": 3520, "text": "Is there something you would, would you hold his feet to the fire on this?"}, {"time": 3524, "text": "Or is it very difficult from the perspective of FDR to have known what was coming?"}, {"time": 3530, "text": "I think FDR had a sense of what was coming, not quite the enormity of what Hitler was doing and not quite the enormity of what the Holocaust became."}, {"time": 3537, "text": "I also lost relatives in the Holocaust."}, {"time": 3541, "text": "And part of that was beyond the imagination of human beings."}, {"time": 3544, "text": "But it's clear in his papers that as early as 1934, people he respected, who he knew well, told him that Hitler was very dangerous."}, {"time": 3552, "text": "They also thought Hitler was crazy, that he was a lunatic."}, {"time": 3555, "text": "Hamilton Fish Armstrong, who was a friend of Roosevelt's, who was actually the Council on Foreign Relations in New York, had a meeting with Hitler in 1934."}, {"time": 3562, "text": "I remember reading the account of this."}, {"time": 3564, "text": "And he basically said to FDR, this man is gonna cause a war."}, {"time": 3567, "text": "He's gonna cause a lot of damage."}, {"time": 3568, "text": "Again, they didn't know quite the scale."}, {"time": 3570, "text": "So they saw this coming."}, {"time": 3572, "text": "They saw this coming."}, {"time": 3573, "text": "FDR had two problems."}, {"time": 3574, "text": "First, he had an American public that was deeply isolationist."}, {"time": 3578, "text": "The opposite of the problem in a sense that we were talking about before."}, {"time": 3581, "text": "If we're an over militarized society, now we were a deeply isolationist society in the 1930s."}, {"time": 3587, "text": "The depression reinforced that."}, {"time": 3589, "text": "FDR actually had to break the law in the late 30s to support the allies."}, {"time": 3593, "text": "So it was very hard to move the country in that direction, especially when he had this program at home, the New Deal, that he didn't wanna jeopardize by alienating an isolationist public."}, {"time": 3603, "text": "That was the reality."}, {"time": 3604, "text": "We talked about political manipulation."}, {"time": 3606, "text": "He had to be conscious of that."}, {"time": 3607, "text": "He had to know his audience."}, {"time": 3609, "text": "And second, there were no allies willing to invest in this either."}, {"time": 3614, "text": "The British were as committed to appeasement, as you know."}, {"time": 3618, "text": "You're obviously very knowledgeable about this."}, {"time": 3619, "text": "The French were as well."}, {"time": 3621, "text": "It was very hard."}, {"time": 3622, "text": "The Russian government, the Soviet government was cooperating to remilitarize Germany."}, {"time": 3626, "text": "So there weren't a lot of allies out there either."}, {"time": 3630, "text": "I think if there's a criticism to be made of FDR, it's that once we're in the war, he didn't do enough to stop, in particular, the killing of Jews."}, {"time": 3641, "text": "And there are a number of historians, myself included, who have written about this, and it's an endless debate."}, {"time": 3645, "text": "What should he have done?"}, {"time": 3647, "text": "There's no doubt by 1944, the United States had air superiority and could have bombed the rail lines to Auschwitz and other camps, and that would have saved as many as a million Jews."}, {"time": 3656, "text": "That's a lot of people who could have been saved."}, {"time": 3658, "text": "Why didn't FDR insist on that?"}, {"time": 3661, "text": "In part, because he wanted to use every resource possible to win the war."}, {"time": 3665, "text": "He did not want to be accused of fighting the war for Jews."}, {"time": 3668, "text": "But I think it's also fair to say that he probably cared less about Jews and East Europeans than he did about others, those of his own Dutch ancestry and from Western Europe."}, {"time": 3678, "text": "And so, even their race comes in, is also the explanation for the internment of Japanese in the United States, which is a horrible war crime committed by this heroic president."}, {"time": 3686, "text": "120,000 Japanese American citizens lost their freedom unnecessarily."}, {"time": 3691, "text": "So, he had his limitations."}, {"time": 3693, "text": "And I think he could have done more during the war to save many more lives."}, {"time": 3698, "text": "And I wish he had."}, {"time": 3699, "text": "And there's something to be said about empathy that you spoke that FDR had empathy."}, {"time": 3705, "text": "But us, for example, now there's many people who describe the atrocities happening in China."}, {"time": 3711, "text": "And there's a bunch of places across the world where there's atrocities happening now."}, {"time": 3715, "text": "And we care."}, {"time": 3717, "text": "We do not uniformly apply how much we care for the suffering of others."}, {"time": 3725, "text": "Depending on the group."}, {"time": 3727, "text": "And in some sense, the role of the president is to rise above that natural human inclination to protect, to do the us versus them, to protect the inner circle and empathize with the suffering of those that are not like you."}, {"time": 3749, "text": "Speaking of war, you wrote a book on Henry Kissinger."}, {"time": 3753, "text": "It's not a great transition, but it made sense in my head."}, {"time": 3759, "text": "Who was Henry Kissinger as a man and as a historical figure?"}, {"time": 3763, "text": "So Henry Kissinger to me is one of the most fascinating figures in history, because he comes to the United States as a German Jewish immigrant at age 15, speaking no English."}, {"time": 3773, "text": "And within a few years, he's a major figure influencing US foreign policy at the height of US power."}, {"time": 3780, "text": "But while he's doing that, he's never elected to office and he's constantly reviled by people, including people who are anti Semitic because he's Jewish, but at the same time also his exoticism makes him more attractive to people."}, {"time": 3795, "text": "So someone like Nelson Rockefeller wants Kissinger around."}, {"time": 3798, "text": "He's one of Kissinger's first patrons because he wants a really smart Jew."}, {"time": 3802, "text": "And Kissinger is gonna be that smart Jew I call Kissinger a policy Jew."}, {"time": 3805, "text": "There were these court Jews in the 16th and 17th and 18th centuries in Europe."}, {"time": 3808, "text": "Every king wanted the Jew to manage his banking."}, {"time": 3811, "text": "And in a sense in the United States in the second half of the 20th century, many presidents want a Jew to manage their international affairs."}, {"time": 3818, "text": "And what does that really mean?"}, {"time": 3819, "text": "It's not just about being Jewish, it's the internationalism, it's the cosmopolitanism."}, {"time": 3824, "text": "And that's one of the things I was fascinated with with Kissinger."}, {"time": 3827, "text": "Someone like Kissinger is unthinkable as a powerful figure in the United States 30 or 40 years earlier, because the United States is run by WASD."}, {"time": 3834, "text": "It's run by white elites who come from a certain background."}, {"time": 3838, "text": "Kissinger represents a moment when American society opens up not to everyone, but opens up to these cosmopolitan figures who have language skills, historical knowledge, networks that can be used for the US government when after World War II, we have to rebuild Europe, when we have to negotiate with the Soviet Union, when we need the kinds of knowledge we didn't have before."}, {"time": 3882, "text": "And so Kissinger is a representative of that phenomenon."}, {"time": 3886, "text": "I became interested in him because I think he's a bellwether."}, {"time": 3888, "text": "He shows how power has changed in the United States."}, {"time": 3892, "text": "So he enters this whole world of politics, what, post World War II in the 50s?"}, {"time": 3900, "text": "Yes, so he actually, in the 40s even, it's an extraordinary story."}, {"time": 3905, "text": "He comes to the United States in 1938, just before Kristallnacht, his family leaves."}, {"time": 3909, "text": "He actually grew up right outside of Nuremberg."}, {"time": 3911, "text": "They leave right before Kristallnacht in fall of 38, come to New York."}, {"time": 3917, "text": "He originally works in a brush factory, cleaning brushes, goes to a public high school."}, {"time": 3923, "text": "And in 1942, just after Pearl Harbor, he joins the military."}, {"time": 3927, "text": "And he's very quickly in the military, first of all, given citizenship, which he didn't have before."}, {"time": 3934, "text": "He's sent for the first time outside of a kosher home."}, {"time": 3936, "text": "He had been in a kosher home his entire life."}, {"time": 3938, "text": "He's sent to South Carolina to eat ham for Uncle Sam."}, {"time": 3942, "text": "And then he is, and this is extraordinary, at the age of 20, barely speaking English, he is sent back to Germany with the US Army in an elite counterintelligence role, why?"}, {"time": 3955, "text": "Because they need German speakers."}, {"time": 3957, "text": "He came when he was 15, so he actually understands the society."}, {"time": 3960, "text": "They need people who have that cultural knowledge."}, {"time": 3962, "text": "And because he's Jewish, they can trust that he'll be anti Nazi."}, {"time": 3967, "text": "And there's a whole group of these figures."}, {"time": 3970, "text": "He's one of many."}, {"time": 3971, "text": "And so he's in an elite circle."}, {"time": 3973, "text": "He's discriminated against in New York."}, {"time": 3975, "text": "When he goes to Harvard after that, he can only live in a Jewish only dorm."}, {"time": 3979, "text": "But at the same time, he's in an elite policy role in counterintelligence."}, {"time": 3982, "text": "He forms a network there that stays with him the rest of his career."}, {"time": 3987, "text": "There's a gentleman named Fritz Kramer, who becomes a sponsor of his in the emerging Pentagon Defense Department world."}, {"time": 3994, "text": "And as early as the early 1950s, he sent them to Korea to comment on affairs in Korea."}, {"time": 4000, "text": "He becomes both an intellectual recognized for his connections, but also someone who policymakers wanna talk about."}, {"time": 4006, "text": "His book on nuclear weapons, when it's written, is given to President Eisenhower to read because they say this is someone writing interesting things."}, {"time": 4014, "text": "You should read what he says."}, {"time": 4016, "text": "There's a certain aspect to him that's kind of like Forrest Gump."}, {"time": 4019, "text": "He seems to continuously be the right person at the right time in the right place."}, {"time": 4024, "text": "Somehow finding him in this."}, {"time": 4025, "text": "I don't wanna, you know, you can only get lucky so many times because he continues to get lucky in terms of being at the right place in history for many decades, until today."}, {"time": 4039, "text": "Yeah, well, he has a knack for that."}, {"time": 4041, "text": "I spent a lot of time talking with him."}, {"time": 4044, "text": "And what comes through very quickly is that he has an eye for power."}, {"time": 4050, "text": "It's, I think, unhealthy."}, {"time": 4051, "text": "He's obsessed with power."}, {"time": 4053, "text": "Can you explain like an observer of power or does he want power himself?"}, {"time": 4059, "text": "Yes, both of those things."}, {"time": 4061, "text": "Both of those."}, {"time": 4061, "text": "And I think I explained this in the book."}, {"time": 4063, "text": "He doesn't agree with what I'm gonna say now, but I think I'm right and I think he's right."}, {"time": 4067, "text": "It's very hard to analyze yourself, right?"}, {"time": 4070, "text": "I think he develops an obsession with gaining power because he sees what happens when you have no power."}, {"time": 4077, "text": "He experiences the trauma."}, {"time": 4080, "text": "His father is a very respected Gymnasium Lehrer in Germany."}, {"time": 4084, "text": "Even though he's Jewish, he's actually the teacher of German classics to the German kids."}, {"time": 4092, "text": "And he's forced to flee and he becomes nothing."}, {"time": 4095, "text": "His father never really makes a way for himself in the United States."}, {"time": 4098, "text": "He becomes a postal delivery person, which is nothing wrong with that, but for someone who's a respected teacher in Germany, and Gymnasium Lehrer are like professors there, right?"}, {"time": 4107, "text": "To then be in this position."}, {"time": 4109, "text": "His mother has to open a catering business when they come to New York."}, {"time": 4113, "text": "It's a typical immigrant story, but he sees the trauma."}, {"time": 4115, "text": "His grandparents are killed by the Nazis."}, {"time": 4118, "text": "So he sees the trauma and he realizes how perilous it is to be without power."}, {"time": 4123, "text": "And you're saying he does not want to acknowledge the effect of that?"}, {"time": 4130, "text": "I mean, most of us, if we've had trauma, it's believable that it's traumatic because you don't talk about it."}, {"time": 4135, "text": "I have a friend who interviews combat veterans and he says, as soon as someone freely wants to tell me about their combat trauma, I suspect that they're not telling me the truth."}, {"time": 4145, "text": "If it's traumatic, it's hard to talk about."}, {"time": 4148, "text": "Yeah, sometimes I wonder how much from my own life, everything that I've ever done is just the result of the complicated relationship with my father."}, {"time": 4161, "text": "I tend to, I had a really difficult time."}, {"time": 4163, "text": "I did a podcast conversation with him."}, {"time": 4165, "text": "I saw it actually."}, {"time": 4168, "text": "It was, I was thinking I could never do that with my father."}, {"time": 4171, "text": "But I remember as I was doing it, and for months after I regretted doing it, I just kept regretting it."}, {"time": 4179, "text": "And the fact that I was regretting it spoke to the fact that I'm running away from some truths that are back there somewhere."}, {"time": 4187, "text": "And that's perhaps what Kissinger is as well."}, {"time": 4190, "text": "But is there, I mean, he's done, he's been a part of so many interesting moments of American history, of world history, from the Cold War, Vietnam War, until today."}, {"time": 4203, "text": "What stands out to you as a particularly important moment in his career that made who he is?"}, {"time": 4213, "text": "Well, I think what made his career in many ways was his experience in the 1950s, building a network, a network of people across the world who were rising leaders from unique positions."}, {"time": 4230, "text": "He ran what he called the International Seminar at Harvard, which was actually a summer school class that no one at Harvard cared about."}, {"time": 4239, "text": "But he invited all of these rising intellectuals and thinkers from around the world."}, {"time": 4246, "text": "And he built a network there that he used forevermore."}, {"time": 4250, "text": "So that's what really, I think, boosts him."}, {"time": 4253, "text": "The most important moments in terms of making his reputation and making his career are two sets of activities."}, {"time": 4259, "text": "One is the opening to China."}, {"time": 4262, "text": "And his ability to, first of all, take control of US policy without the authority to do that and direct US policy, and then build a relationship with Mao Zedong and Zhou Enlai that was unthinkable just four or five years earlier."}, {"time": 4276, "text": "Of course, President Nixon is a big part of that as well, but Kissinger is the mover and shaker on that."}, {"time": 4280, "text": "And it's a lot of manipulation, but it's also a vision."}, {"time": 4283, "text": "Now, this is in the moment of American history where there's a very powerful anti communism."}, {"time": 4290, "text": "So communism is seen as much more even though than today as the enemy."}, {"time": 4296, "text": "And China in particular, they were one of our key enemies in Vietnam."}, {"time": 4300, "text": "And in Korea, American forces were fighting Chinese forces directly."}, {"time": 4304, "text": "Chinese forces come over the border."}, {"time": 4306, "text": "Thousands of Americans die at the hand of Chinese forces."}, {"time": 4309, "text": "So for the long time, the United States had no relationship with communist China."}, {"time": 4312, "text": "He opens that relationship."}, {"time": 4314, "text": "And at the same time, he also creates a whole new dynamic in the Middle East."}, {"time": 4319, "text": "After the 1973 war, the so called Yom Kippur War, he steps in and becomes the leading negotiator between the Israelis, the Egyptians, and other major actors in the region."}, {"time": 4329, "text": "And it makes the United States the most powerful actor in the Middle East, the Soviet Union far less powerful, which is great for the United States in the 70s and 80s."}, {"time": 4337, "text": "It gets us though into the problems we of course have thereafter."}, {"time": 4341, "text": "So that speaks to the very pragmatic approach that he's taken the realistic approach versus the idealistic approach termed realpolitik."}, {"time": 4354, "text": "What is this thing?"}, {"time": 4355, "text": "What is this approach to world politics?"}, {"time": 4358, "text": "So realpolitik for Kissinger is really focusing on the power centers in the world and trying as best you can to manipulate those power centers to serve the interests of your own country."}, {"time": 4372, "text": "And so that's why he's a multilateralist."}, {"time": 4374, "text": "He's not a unilateralist."}, {"time": 4375, "text": "He believes the United States should put itself at the center of negotiations between other powerful countries."}, {"time": 4382, "text": "But that's also why he pays very little attention to countries that are less powerful."}, {"time": 4385, "text": "And this is why he's often criticized by human rights activists."}, {"time": 4389, "text": "For him, parts of Africa and Latin America, which you and I would consider important places are unimportant because they don't have power."}, {"time": 4396, "text": "They can't project their power."}, {"time": 4397, "text": "They don't produce a lot of economic wealth."}, {"time": 4400, "text": "And so they matter less."}, {"time": 4401, "text": "Realpolitik views the world in a hierarchy of power."}, {"time": 4406, "text": "How does realpolitik realize itself in the world?"}, {"time": 4412, "text": "What does that really mean?"}, {"time": 4414, "text": "Like how do you push forward the interest of your own country?"}, {"time": 4417, "text": "You said there's power centers, but it is a big bold move to negotiate to work with a communist nation, with your enemies that are powerful."}, {"time": 4430, "text": "What is the sort of, if you can further elaborate the philosophy behind it."}, {"time": 4435, "text": "Sure, so there are two key elements that then end up producing all kinds of tactics."}, {"time": 4439, "text": "But the two strategic elements of Kissinger's way of thinking about realpolitik, which are classical ways, going back to Thucydides and the Greeks, are to say, first of all, you figure out who your allies are and you build webs of connection so that your allies help you to acquire what you want to acquire."}, {"time": 4458, "text": "This is why, according to Herodotus, the Greeks beat the Persians."}, {"time": 4461, "text": "The Persians are bigger, but the Greeks, the Spartans, the Athenians, others are able to work together and leverage their resources."}, {"time": 4467, "text": "So it's about leveraging your resources."}, {"time": 4468, "text": "For Kissinger, this makes Western Europe crucially important."}, {"time": 4472, "text": "It makes Japan crucially important."}, {"time": 4475, "text": "It makes Israel and Egypt crucially important in building these webs."}, {"time": 4479, "text": "You build your surrogates, you build your brother states."}, {"time": 4483, "text": "In other parts of the world, you build tight connections and you work together to control the resources that you want."}, {"time": 4489, "text": "The second element of the strategy is not to go to war with your adversary, but to do all you can to limit the power of your adversary."}, {"time": 4497, "text": "Some of that is containment, preventing the Soviet Union from expanding."}, {"time": 4501, "text": "That was the key element of American Cold War policy."}, {"time": 4504, "text": "But sometimes it's actually negotiation."}, {"time": 4507, "text": "That's what detente was about for Kissinger."}, {"time": 4509, "text": "He spends a lot of time, more time than any other American foreign policymaker, negotiating with Soviet leaders as well as Chinese leaders."}, {"time": 4515, "text": "What does he want to do?"}, {"time": 4516, "text": "He wants to limit the nuclear arms race."}, {"time": 4518, "text": "The United States is ahead."}, {"time": 4520, "text": "We don't want the Soviet Union to get ahead of us."}, {"time": 4522, "text": "We negotiate to limit their abilities, right?"}, {"time": 4526, "text": "We play to our strengths."}, {"time": 4528, "text": "So it's a combination of keeping your adversary down and building tight webs."}, {"time": 4533, "text": "Within that context, military force is used, but you're not using war for the sake of war."}, {"time": 4539, "text": "You're using warfare to further your access to the resources, economic, political, geographic that you want."}, {"time": 4546, "text": "To build relationships and then the second thing, to limit the powers of those you're against."}, {"time": 4551, "text": "So is there any sort of insights into how he preferred to build relationships?"}, {"time": 4559, "text": "Are we talking about like, again, it's the one on one."}, {"time": 4563, "text": "Is it through policy or is it through like, phone conversations?"}, {"time": 4566, "text": "Is there any cool kind of insights that you could speak to?"}, {"time": 4569, "text": "Yeah, Kissinger is the ultimate kiss up."}, {"time": 4574, "text": "He is, some used to make fun of him."}, {"time": 4576, "text": "In fact, even the filmmaker from Dr. Strangelove, whose name I'm forgetting, Stanley Kubrick, called him kiss up at that time, right?"}, {"time": 4587, "text": "He had a wonderful way of figuring out what it is you wanted, back to that discussion we had before and trying to show how he could give you more of what you wanted as a leader."}, {"time": 4596, "text": "It was very personalistic, very personalistic."}, {"time": 4600, "text": "And he spends a lot of time, for example, kissing up to Leonid Brezhnev, kissing up to Mao."}, {"time": 4606, "text": "He tells Mao, you're the greatest leader in the history of the 20th century."}, {"time": 4609, "text": "People will look back on you as the great leader."}, {"time": 4612, "text": "Some of this sounds like BS, but it's serious, right?"}, {"time": 4615, "text": "He's feeding the egos of those around him."}, {"time": 4618, "text": "Second, he is willing to get things done for you."}, {"time": 4622, "text": "He's effective."}, {"time": 4623, "text": "You want him around you because of his efficacy."}, {"time": 4625, "text": "So Richard Nixon is always suspicious that Henry Kissinger is getting more of the limelight."}, {"time": 4629, "text": "He hates that Kissinger gets the Nobel Peace Prize and he doesn't, but he needs him."}, {"time": 4633, "text": "Because Kissinger's the guy who gets things done."}, {"time": 4636, "text": "So he performs."}, {"time": 4637, "text": "He builds a relationship in almost, I say this in the book, in almost a gangster way."}, {"time": 4641, "text": "He didn't like that he criticized that part of the book."}, {"time": 4643, "text": "But again, I still think the evidence is there."}, {"time": 4646, "text": "You need something to be done, boss, I'll do it."}, {"time": 4649, "text": "And don't forget that I'm doing this for you."}, {"time": 4652, "text": "And you get mutual dependency in a Hegelian way, right?"}, {"time": 4655, "text": "And so he builds this personal dependency through ego and through performance."}, {"time": 4662, "text": "And then he's so skillful at making decisions for people who are more powerful because he's never elected to office."}, {"time": 4669, "text": "He always needs powerful people to let him do things."}, {"time": 4673, "text": "But he convinces you it's your decision when it's really his."}, {"time": 4675, "text": "To read his memos are beautiful."}, {"time": 4677, "text": "He's actually very skilled at writing things in a way that looks like he's giving you options as president, but in fact, there's only one option there."}, {"time": 4685, "text": "Is he, speaking to the gangster, to the loyalty, is he ever, like the sense I got from Nixon is he would, Nixon would backstab you if he needed to."}, {"time": 4699, "text": "One of the things that I admire about gangsters is they don't backstab those in their circle, like loyalty above all else."}, {"time": 4710, "text": "I mean, at least that's the sense I've gotten from the stories of the past, at least."}, {"time": 4716, "text": "Is, where would you put Kissinger on that?"}, {"time": 4718, "text": "Is he loyalty above all else?"}, {"time": 4721, "text": "Or is it, or a human, it's like the Steve Jobs thing, is like, as long as you're useful, you're useful, but then once, the moment you're no longer useful is when you're knocked off the chessboard."}, {"time": 4735, "text": "It's the latter with him."}, {"time": 4736, "text": "He's backstabbing quite a lot."}, {"time": 4739, "text": "And he's self serving."}, {"time": 4740, "text": "But he also makes himself so useful that even though Nixon knows he's doing that, Nixon still needs him."}, {"time": 4749, "text": "By the way, on that point, so having spoken with Kissinger, what's your relationship like with him as somebody who is in an objective way writing his story?"}, {"time": 4761, "text": "It was very difficult because he's very good at manipulating people."}, {"time": 4765, "text": "And we had about 12 or 13 interviews, usually informal over lunch."}, {"time": 4772, "text": "And this was many years ago."}, {"time": 4774, "text": "This is probably now more than 10 years ago."}, {"time": 4777, "text": "Did you find yourself being like sweet talked, like to where you like go back home later and look in the mirror and it's like, wait, what just happened?"}, {"time": 4786, "text": "He can be enormously charming and enormously obnoxious at the same time."}, {"time": 4791, "text": "So I would have these very mixed emotions because he gives no ground."}, {"time": 4794, "text": "He's unwilling to, and I think this is a weakness, he's unwilling to admit mistake."}, {"time": 4803, "text": "Others make mistakes, but he doesn't."}, {"time": 4805, "text": "And he certainly won't take on any of the big criticisms that are pushed."}, {"time": 4809, "text": "I understand why."}, {"time": 4809, "text": "I mean, when you've worked as hard for what he has as he has, you're defensive about it."}, {"time": 4813, "text": "But he is very defensive and he's very fragile about it."}, {"time": 4815, "text": "He does not like criticisms at all."}, {"time": 4817, "text": "He used to, he hasn't done this in a while, but he used to call me up and yell at me on the phone, quite literally, when I would be quoted in the New York Times or somewhere saying something that sounded critical of him."}, {"time": 4828, "text": "So for instance, there was one instance a number of years ago, where a reporter came across some documents where Kissinger said negative things about Jews in Russia."}, {"time": 4837, "text": "Typical things that a German Jew would say about East European Jews."}, {"time": 4841, "text": "And the New York Times asked me, is this accurate?"}, {"time": 4844, "text": "And I said, yeah, the documents are accurate."}, {"time": 4846, "text": "I've seen them, they're accurate."}, {"time": 4847, "text": "He was so angry about that."}, {"time": 4849, "text": "So there's the fragility, but there's also the enormous charm and the enormous intelligence."}, {"time": 4853, "text": "The real challenge with him though, is he's very good at making his case."}, {"time": 4856, "text": "He'll convince you."}, {"time": 4858, "text": "And as a scholar, as an observer, you don't wanna hear a lawyer's case."}, {"time": 4863, "text": "You wanna actually interrogate the evidence and get to the truth."}, {"time": 4867, "text": "And so that was a real challenge with him."}, {"time": 4869, "text": "So speaking of his approach of realpolitik, if we just zoom out and look at a human history, human civilization, what do you think works best in the way we progress forward?"}, {"time": 4885, "text": "A realistic approach, do whatever it takes, control the centers of power, to play a game for the greater interests of the good guys, quote unquote."}, {"time": 4896, "text": "Or lead by sort of idealism, which is like truly act in the best version of the ideas you represent, as opposed to kind of present one view and then do whatever it takes behind the scenes."}, {"time": 4915, "text": "Obviously you need some of both, but I lean more to the idealistic side and more so actually, believe it or not, as I get into my 40s, as I do more historical work."}, {"time": 4924, "text": "Why do I say that?"}, {"time": 4925, "text": "Because I think, and this is one of my criticisms of Kissinger, who I also have a lot of respect for, the realpolitik becomes self defeating because you're constantly running to keep power, but you forget why."}, {"time": 4937, "text": "And you often then use power, and I think Kissinger falls into this in some of his worst moments, not all of his moments, where the power is actually being used to undermine the things you care about."}, {"time": 4945, "text": "It's sort of the example of being a parent and you're doing all these things to take your kid to violin, basketball, all these things, and you realize you're actually killing your kid and making your kid very unhappy."}, {"time": 4955, "text": "And the whole reason you were doing it was to improve the person's life."}, {"time": 4959, "text": "And so you have to remember why it is, what Hans Morgenthau calls this is your purpose."}, {"time": 4963, "text": "Your purpose has to drive you."}, {"time": 4965, "text": "Now your purpose doesn't have to be airy, fiery idealism."}, {"time": 4969, "text": "So I believe deeply in democracy is an ideal."}, {"time": 4972, "text": "I don't think it's gonna ever look like Athenian democracy, but that should drive our policy."}, {"time": 4980, "text": "But we still have to be realistic and recognize we're not gonna build that democracy in Afghanistan tomorrow."}, {"time": 4986, "text": "I mean, does it ultimately just boil down again to the corrupting nature of power that nobody can hold power for very long before you start acting in the interest of power as opposed to in the interest of your ideals?"}, {"time": 5003, "text": "It's impossible to be like somebody like Kissinger who is essentially in power for many, many decades and still remember what are the initial ideals that you strove to achieve."}, {"time": 5022, "text": "Yes, I think that's exactly right."}, {"time": 5024, "text": "There's a moment in the book I quote about him, comes from one of our interviews."}, {"time": 5029, "text": "I asked him, what were the guiding ideals for your policies?"}, {"time": 5034, "text": "And he said, I'm not prepared to share that."}, {"time": 5037, "text": "And I don't think it's because he doesn't know what he thinks he was trying to do."}, {"time": 5040, "text": "He realizes his use of power departed quite a lot from."}, {"time": 5044, "text": "So it would sound, if he made them explicit, it would sound hypocritical."}, {"time": 5052, "text": "Well, on that, let me ask about war."}, {"time": 5055, "text": "America often presents itself to its own people, but just the leaders, when they look in the mirror, I get a sense that we think of ourselves as the good guys."}, {"time": 5069, "text": "And especially this begins sometimes to look hypocritical when you're waging war."}, {"time": 5078, "text": "Is there a good way to know when you've lost all sense of what it is to be good?"}, {"time": 5088, "text": "Another way to ask that, is there in military policy in conducting war, is there a good way to know what is a just war and what is a war crime?"}, {"time": 5099, "text": "I mean, in some circles, Kissinger is accused of contributing, being a war criminal."}, {"time": 5107, "text": "Yes, and I argue in the book, he's not a war criminal, but that doesn't mean that he didn't misuse military power."}, {"time": 5115, "text": "I think a just war, a just war, as Michael Walzer and others write about it, a just war is a war where both the purpose is just, and you are using the means to get to that purpose that kill as few people as necessary."}, {"time": 5133, "text": "That doesn't mean they won't be killing, but as few as necessary."}, {"time": 5136, "text": "Proportionality, right?"}, {"time": 5137, "text": "Your means should be proportional to your ends."}, {"time": 5140, "text": "And that's often lost sight of, because the drive to get to the end often self justifies means that go well beyond that."}, {"time": 5150, "text": "And so that's how we get into torture in the war on terror."}, {"time": 5155, "text": "Is there some kind of lesson for the future that you can take away from that?"}, {"time": 5160, "text": "Yes, I think the first set of lessons that I've shared as a historian with military decision makers is, first of all, always remember why you're there, what your purpose is, and always ask yourself if the means you're using are actually proportional."}, {"time": 5173, "text": "Ask that question."}, {"time": 5175, "text": "Just because you have these means that you can use, just because you have these tools, doesn't mean they're the right tools to use."}, {"time": 5182, "text": "And here's the question that follows from that."}, {"time": 5185, "text": "And it's a hard question to ask, because the answer is one we often don't like to hear."}, {"time": 5189, "text": "Are the things I'm doing in war actually doing more harm or more good to the reason I went into war?"}, {"time": 5196, "text": "We came to a point in the war on terror where what we were doing was actually creating more terrorists."}, {"time": 5202, "text": "And that's when you have to stop."}, {"time": 5206, "text": "Well, some of that is in the data, but some of it, there's a leap of faith."}, {"time": 5209, "text": "So from a parenting perspective, let me speak as a person with no kids and a single guy, let me be the expert in the room on parenting."}, {"time": 5218, "text": "Now, it does seem that it's a very difficult thing to do, even though you know that your kid was making a mistake, to let them make a mistake, to give them the freedom to make the mistake."}, {"time": 5235, "text": "I don't know what to do, but I mean, that's a very kind of lighthearted way of phrasing the following, which is when you look at some of the places in the world, like Afghanistan, which is not doing well."}, {"time": 5252, "text": "To move out knowing that there's going to be a lot of suffering, economic suffering, injustices, terrorist organizations growing, that's committing crimes on its own people and potentially committing crimes against allies, violence against allies, violence against the United States."}, {"time": 5272, "text": "So how do you know what to do in that case?"}, {"time": 5278, "text": "Well, again, it's an art, not a science, which is what makes it hard for an engineer to think about."}, {"time": 5284, "text": "This is what makes it endlessly fascinating for me."}, {"time": 5287, "text": "And I think the real intellectual work is at the level of the art, right?"}, {"time": 5290, "text": "And I think probably engineering at its highest level becomes an art as well, right?"}, {"time": 5294, "text": "So policymaking, you never know."}, {"time": 5297, "text": "But I will say this, I'll say you have to ask yourself and look in the mirror and say, is all the effort I'm putting in actually making this better?"}, {"time": 5305, "text": "And in Afghanistan, you look at the 20 years and two plus trillion dollars that the US has put in."}, {"time": 5312, "text": "And the fact that, as you said correctly, it's not doing well right now after 20 years of that investment."}, {"time": 5318, "text": "I might like a company that I invest in, but after 20 years of my throwing money in that company, it's time to get out."}, {"time": 5326, "text": "Well, in some sense, getting out now, that's kind of obvious."}, {"time": 5331, "text": "I'm more interested in how we figure out in the future how to get out earlier than, I mean, at this point, we stayed too long and it's obvious, the data, the investment, nothing is working."}, {"time": 5344, "text": "The very little data points to us staying there."}, {"time": 5347, "text": "I'm more interested in being in a relation, let me take it back to a safer place again, being in a relationship and getting out of that relationship while things are still good, but you have a sense that it's not going to end up in a good place."}, {"time": 5360, "text": "That's the difficult thing."}, {"time": 5362, "text": "You have to ask yourself, whether it's a relationship or you're talking about policymaking in a place like Afghanistan, are the things I'm doing showing me evidence, real evidence that they're making things better or making things worse?"}, {"time": 5375, "text": "That's a hard question to answer."}, {"time": 5377, "text": "You have to be very honest."}, {"time": 5378, "text": "And in a policymaking context, we have to actually do the same thing we do in a relationship context."}, {"time": 5383, "text": "What do we do in a relationship context?"}, {"time": 5384, "text": "We ask other friends who are observing."}, {"time": 5386, "text": "We ask for other observers."}, {"time": 5388, "text": "This is actually just a scientific method element actually that we can't, the Heisenberg principle, I can't see it because I'm too close to it."}, {"time": 5394, "text": "I'm changing it by my looking at it."}, {"time": 5397, "text": "I need others to tell me in a policymaking context, this is why you need to hear from other people, not just the generals, because here's the thing about the generals."}, {"time": 5405, "text": "They generally are patriotic, hardworking people, but they're too close."}, {"time": 5411, "text": "They're not lying."}, {"time": 5412, "text": "They're too close."}, {"time": 5413, "text": "I just think they can do better."}, {"time": 5417, "text": "How do you think about the Cold War now from the beginning to end, and maybe also with an eye towards the current potential cyber conflict, cyber war with China and with Russia, if we look sort of other kind of Cold Wars potentially emerging in the 21st century, when you look back at the Cold War of the 20th century, how do you see it and what lessons do we draw from it?"}, {"time": 5446, "text": "It's a wonderful question because I teach this to undergraduates and it's really interesting to see how undergraduates now, almost all of whom were born after 9 11."}, {"time": 5457, "text": "So the Cold War is ancient history to them."}, {"time": 5459, "text": "In fact, the Cold War to them is as far removed as the 1950s were to me."}, {"time": 5467, "text": "I mean, it's unbelievable."}, {"time": 5470, "text": "It's almost like World War II for my generation and Cold War for them."}, {"time": 5474, "text": "It's so far removed."}, {"time": 5475, "text": "The collapse of the Soviet Union doesn't mean anything to them."}, {"time": 5480, "text": "So how do you describe the Cold War to them?"}, {"time": 5483, "text": "How do you describe the Soviet Union to them?"}, {"time": 5485, "text": "First of all, I have to explain to them why people were so fearful of communism."}, {"time": 5490, "text": "Anti communism is very hard for them to understand."}, {"time": 5493, "text": "The fact that in the 1950s, Americans believed that communists were going to infiltrate our society and many other societies."}, {"time": 5501, "text": "And that after Fidel Castro comes to power in 1959, that we're going to see communist regimes all across Latin America, that fear of communism married to nuclear power."}, {"time": 5513, "text": "And then even the fear that maybe economically they would outpace us because they would create this sort of army of Khrushchevian builders of things and what does Khrushchev said, right?"}, {"time": 5524, "text": "Say we're gonna catch Britain in five years and then the United States after that, right?"}, {"time": 5528, "text": "So to explain that sense of fear to them that they don't have of those others, that's really important."}, {"time": 5535, "text": "The Cold War was fundamentally about the United States defending a capitalist world order against a serious challenger from communism."}, {"time": 5544, "text": "An alternative way of organizing everything, private property, economic activity, enterprise, life, everything, organized in a totally different way."}, {"time": 5554, "text": "It was a struggle between two systems."}, {"time": 5556, "text": "So your sense is, and sorry to interrupt, but your sense is that the conflict of the Cold War was between two ideologies and not just two big countries with nuclear weapons."}, {"time": 5568, "text": "I think it was about two different ways of life or two different promoted ways of life."}, {"time": 5572, "text": "The Soviet Union never actually lived communism."}, {"time": 5576, "text": "But I think my reading of Stalin is he really tried to go there."}, {"time": 5580, "text": "Khrushchev really believed Gorbachev thought he was going to reform the Soviet Union so you would go back to a kind of Bukhar and Lenin communism, right?"}, {"time": 5588, "text": "So I do think that mattered."}, {"time": 5590, "text": "I do think that mattered enormously."}, {"time": 5591, "text": "And for the United States point of view, the view was that communism and fascism were these totalitarian threats to liberal democracy and capitalism, which went hand in hand."}, {"time": 5602, "text": "So I do think that's what the struggle was about."}, {"time": 5604, "text": "And in a certain way, liberal capitalism proved to be the more enduring system and the United States played a key role in that."}, {"time": 5610, "text": "That's the reality of the Cold War."}, {"time": 5613, "text": "But I think it means different things now to my students and others."}, {"time": 5618, "text": "They focus very much on the expansion of American power and the challenges of managing."}, {"time": 5627, "text": "They're looking at it from the perspective of not will we survive, but did we waste our resources on some elements of it?"}, {"time": 5634, "text": "It doesn't mean they were against what America did, but there is a question of the resources that went into the Cold War and the opportunity costs."}, {"time": 5642, "text": "And you see this when you look at the sort of healthcare systems that other countries build and you compare them to the United States, race issues also."}, {"time": 5650, "text": "So they look at the costs, which I think often happens after a project is done, you look back at that."}, {"time": 5656, "text": "Second, I think they're also more inclined to see the world as less bipolar, to see the role of China as more complicated."}, {"time": 5666, "text": "Post colonial or anti colonial movements, independent states in Africa and Latin America, that gets more attention."}, {"time": 5674, "text": "So one of the criticisms now is because you forget the lessons of 20th century history and the atrocities committed under communism, that you may be a little bit more willing to accept some of those ideologies into our United States society."}, {"time": 5694, "text": "That this kind of, that forgetting that capitalistic forces are part of the reason why we have what we have today."}, {"time": 5705, "text": "There's a fear amongst some now that we would have, what would allow basically communism to take hold in America."}, {"time": 5717, "text": "I mean, Jordan and others speak to this kind of idea."}, {"time": 5720, "text": "I tend to not be so fearful of it."}, {"time": 5723, "text": "I think it's on the surface, it's not deep within."}, {"time": 5727, "text": "I do see the world as very complicated as there needing to be a role of having support for each other on certain political levels, economic levels, and then also supporting entrepreneurs."}, {"time": 5740, "text": "It's like that the kind of enforcing of outcomes that is fundamental to the communist system is not something we're actually close to."}, {"time": 5750, "text": "And some of that is just fear mongering for likes on Twitter kind of thing."}, {"time": 5756, "text": "If I could come in on that, because I agree with you 100%."}, {"time": 5758, "text": "I've spent a lot of time writing and looking at this and talking to people about this."}, {"time": 5762, "text": "There's no communism in the United States."}, {"time": 5764, "text": "There never has been, and there certainly isn't now."}, {"time": 5767, "text": "And I'll say this both from an academic point of view, but also from just spending a lot of time observing young people in the United States."}, {"time": 5773, "text": "Even those on the farthest left, take whoever you think is the farthest left, they don't even understand what communism is."}, {"time": 5778, "text": "They're not communist in any sense."}, {"time": 5780, "text": "Americans are raised in a vernacular and environment of private property ownership."}, {"time": 5784, "text": "And as you know better than anyone, if you believe in private property, you don't believe in communism."}, {"time": 5788, "text": "So the sort of Bernie Sanders kind of socialist elements, that's very different, right?"}, {"time": 5796, "text": "And I would say some of that, not all of that, some of that does hearken back to actually what won in the Cold War."}, {"time": 5802, "text": "There were many social democratic elements of what the United States did that led to our winning the Cold War."}, {"time": 5808, "text": "For example, the New Deal was investing government money in propping up business, in propping up labor unions."}, {"time": 5817, "text": "And during the Cold War, we spent more money than we had ever spent in our history on infrastructure, on schools, on providing social support, social security, our national pension system being one of them."}, {"time": 5831, "text": "So you could argue actually that social democracy is very compatible with capitalism."}, {"time": 5837, "text": "And I think that's the debate we're having today, how much social democracy."}, {"time": 5840, "text": "I'll also say that the capitalism we've experienced the last 20 years is different from the capitalism of the Cold War."}, {"time": 5846, "text": "During the Cold War, there was the presumption in the United States that you had to pay taxes to support our Cold War activities, that it was okay to make money, but the more money you made, the more taxes you had to pay."}, {"time": 5863, "text": "We had the highest marginal tax rates in our history during the Cold War."}, {"time": 5867, "text": "Now, the aversion to taxes, and of course, no one ever likes paying taxes, but the notion that we can do things on deficit spending, that's a post Cold War phenomenon."}, {"time": 5878, "text": "That's not a Cold War phenomenon."}, {"time": 5879, "text": "So, so much of the capitalism that we're talking about today is not the capitalism of the Cold War."}, {"time": 5883, "text": "And maybe, again, we can learn that and see how we can reform capitalism today and get rid of this false worry about communism in the United States."}, {"time": 5894, "text": "Yeah, you know what?"}, {"time": 5895, "text": "You make me actually realize something important."}, {"time": 5897, "text": "What we have to remember is the words we use on the surface about different policies, what you think is right and wrong, is actually different than the core thing that is in your blood, the core ideas that are there."}, {"time": 5913, "text": "I do see the United States as this, there's this fire that burns of individual freedoms, of property rights, these basic foundational ideas that everybody just kind of takes for granted."}, {"time": 5930, "text": "And I think if you hold on to them, if you're like raised in them, talking about ideas of social security, of universal basic income, of reallocation of resources is a fundamentally different kind of discussion than you had in the Soviet Union."}, {"time": 5950, "text": "I think the value of the individual is so core to the American system that you basically cannot possibly do the kind of atrocities that you saw in the Soviet Union."}, {"time": 5965, "text": "But, of course, you never know, the slippery slope has a way of changing things."}, {"time": 5970, "text": "But I do believe the things you're born with is just so core to this country."}, {"time": 5974, "text": "It's part of the, I don't know what your thoughts are."}, {"time": 6011, "text": "But there's something about this discussion that proclaims the value of my freedom as an individual."}, {"time": 6024, "text": "I'm not being eloquent in it, but there's very few debates where whenever people are saying, should you have what level of gun control, all those kinds of things, what I hear is it's a fight for how much freedom, even if it's stupid freedom, should the individual have."}, {"time": 6044, "text": "I think that's what's articulated quite often."}, {"time": 6046, "text": "I think combining your two points, which are great points, I think there is something about American individualism which is deeply ingrained in our culture and our society."}, {"time": 6056, "text": "And it means that the kinds of bad things that happen are different, usually not as bad."}, {"time": 6061, "text": "But our individualism often covers up for vigilante activity and individual violence toward people that you wouldn't have in a more collective culture."}, {"time": 6071, "text": "So in the Soviet Union, it was at a much worse scale and it was done by government organizations."}, {"time": 6077, "text": "In the United States, it's individuals, the history of lynching in our country, for example."}, {"time": 6082, "text": "Sometimes it's individual police officers, sometimes it's others."}, {"time": 6084, "text": "Again, the vast majority of police officers are good people and don't do harm to people, but there are these examples and they are able to fester in our society because of our individualism."}, {"time": 6094, "text": "Now, gun ownership is about personal freedom, I think, for a lot of people."}, {"time": 6099, "text": "And there's no doubt that in our history, included in the Second Amendment, which can be interpreted in different ways, is the presumption that people should have the right to defend themselves, which is what I think you're getting at here."}, {"time": 6111, "text": "That you should not be completely dependent for your defense on an entity that might not be there for you."}, {"time": 6116, "text": "You should be able to defend yourself."}, {"time": 6119, "text": "And guns symbolize that."}, {"time": 6121, "text": "I think that's a fair point."}, {"time": 6123, "text": "But I think it's also a fair point to say that as with everything, defining what self defense is, is really important."}, {"time": 6130, "text": "So does self defense mean I can have a bazooka?"}, {"time": 6133, "text": "Does it mean I can have weapons that are designed for a military battlefield to mass kill people?"}, {"time": 6139, "text": "That seems to me to be very different from saying I should have a handgun or some small arm to defend myself."}, {"time": 6146, "text": "That distinction alone would make a huge difference."}, {"time": 6148, "text": "Most of the mass shootings, at least, which are a smaller proportion of the larger gun deaths in the United States, which are larger than any other society, but at least the mass shootings are usually perpetrated by people who have not self defense weapons, but mass killing, mass killing weapons."}, {"time": 6163, "text": "And I think there's an important distinction there."}, {"time": 6165, "text": "The Constitution talks about a right to bear arms for a well regulated militia."}, {"time": 6169, "text": "When the framers talked about arms, that did not mean the ability to kill as many people as you wanna kill."}, {"time": 6175, "text": "It meant the ability to defend yourself."}, {"time": 6176, "text": "So let's have that conversation."}, {"time": 6177, "text": "I think it would be useful as a society."}, {"time": 6179, "text": "Stop talking about guns or no guns."}, {"time": 6182, "text": "What is it that we as citizens need to feel we can defend ourselves?"}, {"time": 6186, "text": "Yeah, I mean, guns have this complicated issue that it can cause harm to others."}, {"time": 6191, "text": "I tend to see sort of maybe like legalization of drugs."}, {"time": 6196, "text": "I tend to believe that we should have the freedom to do stupid things."}, {"time": 6200, "text": "Yeah, so long as we're not harming lots of other people."}, {"time": 6203, "text": "Yes, and then guns, of course, have the property that they can be used."}, {"time": 6206, "text": "It's not just a bazooka I would argue is pretty stupid to own for your own self defense, but it has the very negative side effect of being potentially used to harm other people."}, {"time": 6218, "text": "And you have to consider that kind of stuff."}, {"time": 6222, "text": "By the way, as a side note to the listeners, there's been a bunch of people saying that Lex is way too libertarian for my taste."}, {"time": 6230, "text": "No, I actually am just struggling with ideas and sometimes put on different hats in these conversations."}, {"time": 6237, "text": "I think through different ideas, whether they're left, right or libertarian."}, {"time": 6242, "text": "That's true for gun control."}, {"time": 6243, "text": "That's true for immigration."}, {"time": 6244, "text": "That's true for all of that."}, {"time": 6245, "text": "I think we should have discussions in the space of ideas versus in the space of bins we put each other in labels and we put each other in."}, {"time": 6253, "text": "I agree 100%."}, {"time": 6255, "text": "And also change our minds all the time."}, {"time": 6258, "text": "Try out, say stupid stuff with the best of intention, trying our best to think through it."}, {"time": 6265, "text": "And then after saying it, think about it for a few days and then change your mind and grow in this way."}, {"time": 6272, "text": "Let me ask a ridiculous question."}, {"time": 6275, "text": "When you zoom out, when human civilization has destroyed itself and alien graduate students are studying it like three, four, five centuries from now, what do you think we'll remember about this period in history?"}, {"time": 6290, "text": "The 20th century, the 21st century, this time."}, {"time": 6295, "text": "We had a couple of wars."}, {"time": 6297, "text": "We had a charismatic black president in the United States."}, {"time": 6302, "text": "We had a couple of pandemics."}, {"time": 6306, "text": "What do you think will actually stand out in history?"}, {"time": 6311, "text": "No doubt the rapid technological innovation of the last 20 to 30 years."}, {"time": 6318, "text": "How we created a whole virtual universe we didn't have before."}, {"time": 6323, "text": "And of course that's gonna go in directions you and I can't imagine 50 years from now."}, {"time": 6327, "text": "But this will be seen as that origin moment that when we went from playing below the rim to playing above the rim, right?"}, {"time": 6333, "text": "To be all in person to having a whole virtual world."}, {"time": 6337, "text": "And in a strange way, the pandemic was a provocation to move even further in that direction."}, {"time": 6343, "text": "And we're never going back, right?"}, {"time": 6344, "text": "We're gonna restore some of the things we were doing before the pandemic, but we're never gonna go back to that world we were in before where every meeting you had to fly to that place to be in the room with the people."}, {"time": 6354, "text": "So this whole virtual world and the virtual personas and the avatars and all of that, I think that's going to be a big part of how people remember our time."}, {"time": 6363, "text": "Also the sort of biotechnology element of it, which the vaccines are part of."}, {"time": 6370, "text": "It's amazing how quickly, this is the great triumph, how quickly we've produced and distributed these vaccines."}, {"time": 6375, "text": "And of course there are problems with who's taking them, but the reality is, I mean, this is light speed compared to what it would have been like, not just in 1918, in 1980."}, {"time": 6386, "text": "Yeah, one of the, I'm sorry if I'm interrupting, but one of the disappointing things about this particular time is because vaccines, like a lot of things got politicized, used as little pawns in the game of politics, that we don't get the chance to step back fully at least and celebrate the brilliance of the human species."}, {"time": 6411, "text": "Yes, there are scientists who use their authority improperly, that have an ego, that when they're within institutions, are dishonest with the public because they don't trust the intelligence of the public, they are not authentic and transparent, all the same things you could say about humans in any positions of power, anywhere."}, {"time": 6435, "text": "Okay, that doesn't mean science isn't incredible and the vaccines, I mean, I don't often talk about it because it's so political and it's heartbreaking to, it's heartbreaking how all the good stuff is getting politicized."}, {"time": 6452, "text": "Yeah, that's right, and it shouldn't be, and it'll seem less political."}, {"time": 6456, "text": "Eating the long arc of history."}, {"time": 6457, "text": "Yep, it'll be seen as an outstanding accomplishment."}, {"time": 6462, "text": "And as a step toward whatever, maybe they're doing vaccines or something that replaces the vaccine in 10 seconds, at that point, right?"}, {"time": 6469, "text": "It'll be seen as a step."}, {"time": 6470, "text": "Those will be some of the positives."}, {"time": 6472, "text": "I think one of the negatives they will point to will be our inability, at least at this moment, to manage our environment better, how we're destroying our living space and not doing enough even though we have the capabilities to do more to preserve or at least allow a sustainable living space."}, {"time": 6489, "text": "I'm confident because I'm an optimist that we will get through this and we will be better at sustaining our environment in future decades."}, {"time": 6496, "text": "And so in terms of environmental policy, they'll see this moment as a dark age or the beginnings of a better age, maybe as a renaissance."}, {"time": 6506, "text": "Or maybe as the last time most people lived on Earth when a couple of centuries afterwards we were all dissipated throughout the solar system and the galaxy."}, {"time": 6518, "text": "If the local resident, hometown resident, Mr. Elon Musk has anything to do with it."}, {"time": 6525, "text": "I do tend to think you're absolutely right."}, {"time": 6529, "text": "With all this political bickering, we shouldn't forget that what this age will be remembered by is the incredible levels of innovation."}, {"time": 6537, "text": "I do think the biotech stuff worries me more than anything because it feels like there's a lot of weapons that could be yet to be developed in that space."}, {"time": 6546, "text": "But I tend to believe that, I'm excited by two avenues."}, {"time": 6551, "text": "One is artificial intelligence."}, {"time": 6556, "text": "The kind of systems we'll create in this digital space that you mentioned we're moving to."}, {"time": 6561, "text": "And then the other, of course, this could be the product of the Cold War, but I'm super excited by space exploration."}, {"time": 6567, "text": "There's a magic to humans being."}, {"time": 6570, "text": "And we're getting back to it."}, {"time": 6571, "text": "I mean, we were enthralled with it in the 50s and 60s when it was a Cold War competition."}, {"time": 6575, "text": "And then after the 70s, we sort of gave up on it."}, {"time": 6578, "text": "And thanks to Elon Musk and others, we're coming back to this issue."}, {"time": 6581, "text": "And I think there's so much to be gained from the power of exploration."}, {"time": 6587, "text": "Is there books or movies in your life, long ago or recently, that had a big impact on you?"}, {"time": 6593, "text": "Is there something you would?"}, {"time": 6596, "text": "My favorite novel, I always tell people this, I love reading novels."}, {"time": 6599, "text": "I'm a historian."}, {"time": 6601, "text": "And I think the historian and the novelist are actually, and the technology innovator are all actually one and the same."}, {"time": 6607, "text": "They're all storytellers."}, {"time": 6608, "text": "And we're all in the imagination space."}, {"time": 6611, "text": "And I'm trying to imagine the world of the past to inform us in the present for the future."}, {"time": 6616, "text": "So one of my favorite novels that I read, actually when I was in graduate school, is Thomas Mann's Buddenbrooks."}, {"time": 6631, "text": "Many things we've talked about in the last couple of hours."}, {"time": 6634, "text": "Cycles of life, challenges of adjusting to the world around you."}, {"time": 6639, "text": "And it's just a very moving reflection on the limits of human agency and how we all have to understand the circumstances we're in and adjust to them."}, {"time": 6649, "text": "And there's triumph and tragedy in that."}, {"time": 6651, "text": "It's a wonderful novel."}, {"time": 6652, "text": "It used to be a kind of canonical work."}, {"time": 6654, "text": "It's sort of fallen out now."}, {"time": 6655, "text": "It's a big, big novel, but I'm very moved by that."}, {"time": 6659, "text": "I'm very moved by Tall Stories, War and Peace."}, {"time": 6661, "text": "I assign that every year to my students."}, {"time": 6663, "text": "That's a big, big book."}, {"time": 6664, "text": "But what Tall Story challenges is he challenges the notion that a Napoleon can rule the world."}, {"time": 6671, "text": "And we're all little Napoleons, right?"}, {"time": 6672, "text": "We're all sort of thinking that we're gonna do that."}, {"time": 6675, "text": "And he reminds us how much is contingency, circumstance."}, {"time": 6678, "text": "It doesn't mean we don't have some control."}, {"time": 6681, "text": "You've spoke to me a little bit of Russian."}, {"time": 6684, "text": "So your appreciation of Tall Story, but also your ability to speak a bit of Russian."}, {"time": 6688, "text": "Where's that from?"}, {"time": 6690, "text": "So I speak, in addition to English, I speak reasonably well, depending on how much vodka I've had."}, {"time": 6696, "text": "Russian, I speak French and German."}, {"time": 6699, "text": "I learned those for research purposes."}, {"time": 6702, "text": "I learned French actually when I was in high school, Russian when I was in college, German when I was in graduate school."}, {"time": 6707, "text": "Now I do have family on my mother's side that's of Russian Jewish extraction, but they were Yiddish speakers by the time I met them."}, {"time": 6715, "text": "By the time they had gone through Germany and come to the United States, or really gone through Poland and come to the United States, they were Yiddish speakers."}, {"time": 6720, "text": "So there's no one really in my family who speaks Russian, but I do feel a connection there, at least a long range personal connection."}, {"time": 6727, "text": "Is there something to be said about the language and your ability to imagine history?"}, {"time": 6732, "text": "Sort of when you study these different countries, your ability to imagine what it was like to be a part of that culture, part of that time?"}, {"time": 6744, "text": "Yes, language is crucial to understanding a culture."}, {"time": 6747, "text": "And even if you learn the languages I have, learning Russian and German and French, it's still not the same as also being a native speaker either, as you know."}, {"time": 6756, "text": "But I think language tells you a lot about mannerism, about assumptions."}, {"time": 6761, "text": "The very fact that English doesn't have a formal U, but Russian has a formal U, right?"}, {"time": 6768, "text": "V versus T, right?"}, {"time": 6769, "text": "German has a formal U, Z versus D, right?"}, {"time": 6773, "text": "So the fact that English doesn't have a formal U tells you something about Americans, right?"}, {"time": 6779, "text": "And that's just one example."}, {"time": 6781, "text": "The fact that Germans have such a wider vocabulary for certain scientific concepts than we have in English tells you something about the culture, right?"}, {"time": 6792, "text": "Language is an artifact of the culture."}, {"time": 6794, "text": "The culture makes the language."}, {"time": 6796, "text": "It's fascinating to explore."}, {"time": 6797, "text": "I mean, even just exactly what you just said, V, T, which is, there's a fascinating transition."}, {"time": 6806, "text": "So I guess in English we just have U."}, {"time": 6808, "text": "There's a fascinating transition that persists to this day is of formalism and politeness, where it's an initial kind of dance of interaction that's different methods of signaling respect, I guess."}, {"time": 6826, "text": "We don't, and language provides that, and then in the English language, there's fewer tools to show that kind of respect, which has potentially positive or negative effects on, it flattens the society where like a teenager could talk to an older person and show like a deference."}, {"time": 6844, "text": "I mean, but at the same time, I mean, it creates a certain kind of dynamic, a certain kind of society."}, {"time": 6850, "text": "And it's funny to think of just like those few words can have like a ripple effect through the whole culture."}, {"time": 6856, "text": "And we don't have a history in the United States of aristocracy."}, {"time": 6860, "text": "These elements of language reflect aristocracy."}, {"time": 6863, "text": "The serf would never refer to the master, even if the master is younger, it's always Voi, right?"}, {"time": 6869, "text": "In Turgenev, it's always Voi, right?"}, {"time": 6870, "text": "I mean, and so it's, yeah, so it tells you something about the history."}, {"time": 6874, "text": "That's why to your question, which was a great question, it's so crucial to try to penetrate the language."}, {"time": 6880, "text": "I'll also say something else, and this is a problem for many Americans who haven't learned a foreign language."}, {"time": 6884, "text": "We're very bad at teaching foreign languages."}, {"time": 6886, "text": "If you've never taught yourself a foreign language, you have closed yourself off to certain kinds of empathy because you have basically trained your brain to only look at the world one way."}, {"time": 6897, "text": "The very act of learning another language, I think tells your brain that words and concepts don't translate one to one."}, {"time": 6906, "text": "This is the first thing you realize, right?"}, {"time": 6907, "text": "We can say, you know, these two words mean this thing, you know, these two words mean the same thing from two languages, they never mean exactly the same thing."}, {"time": 6915, "text": "Dosvidanya is really not goodbye, right?"}, {"time": 6919, "text": "And there's something, you know, right now there's people talking about idea of lived experience."}, {"time": 6924, "text": "One of the ways to force yourself into this idea of lived experience is by learning another language, to understand that you can perceive the world in a totally different way, even though you're perceiving the same thing."}, {"time": 6935, "text": "And of course, the way to first learn Russian for those looking for tutorial lessons for me is just like as you said, we start by drinking lots of vodka."}, {"time": 6945, "text": "It's very difficult to do otherwise."}, {"time": 6948, "text": "Is there advice you have for young people about career, about life, in making their way in the world?"}, {"time": 6956, "text": "Yes, two things I believe that I say to a lot of talented young people."}, {"time": 6962, "text": "First, I don't think you can predict what is gonna be well renumerated 20 years from now."}, {"time": 6968, "text": "Don't pick a profession because you think, even though your parents might tell you or something, do this and you'll make money."}, {"time": 6974, "text": "You know, this is the scene in The Graduate where a guy tells Dustin Hoffman, go into plastics, money in plastics."}, {"time": 6981, "text": "So many of my students now have parents who are telling them, bright students, you know, go to the business school."}, {"time": 6986, "text": "That's what's gonna set you up to make money."}, {"time": 6989, "text": "If you're passionate about business, yes."}, {"time": 6991, "text": "But don't begin by thinking you know what's gonna be hot 20 years from now."}, {"time": 6995, "text": "You don't know what's gonna be hot from 20 years ago, 20 years from now."}, {"time": 6998, "text": "What should you do?"}, {"time": 6999, "text": "This is advice number one."}, {"time": 7000, "text": "Find what you're passionate about."}, {"time": 7003, "text": "Because if you're passionate about it, you will do good work in that area if you're talented and usually passion and talent overlap."}, {"time": 7010, "text": "And you'll find a way to get people to pay you for it."}, {"time": 7012, "text": "I mean, you do it really well, people will wanna pay."}, {"time": 7014, "text": "That's where capitalism works."}, {"time": 7016, "text": "People will find it valuable, right?"}, {"time": 7017, "text": "Whether it's violin playing, right?"}, {"time": 7020, "text": "Or engineering or poetry, you will find, you might not become a billionaire."}, {"time": 7023, "text": "That involves other things."}, {"time": 7025, "text": "But you'll find a way to get people to pay you for it."}, {"time": 7027, "text": "And then the second thing is it's really important at the very beginning of your career, even before you're in your job, right?"}, {"time": 7036, "text": "To start building your networks."}, {"time": 7038, "text": "But networks are not just people you're on Facebook with or Twitter with, I mean, that's fine."}, {"time": 7044, "text": "It's actually forming relationships."}, {"time": 7046, "text": "And some of that can be mediated in the digital world, but I mean real relationships."}, {"time": 7050, "text": "I like podcasts because I think they actually open up that space."}, {"time": 7053, "text": "I know a lot of people can listen to a podcast and find someone else who's listened to that podcast and have a conversation about a topic."}, {"time": 7060, "text": "It opens up that space."}, {"time": 7062, "text": "Build those relationships, not with people who you think will be powerful, but people you think are interesting because they'll do interesting things."}, {"time": 7070, "text": "And every successful person I know at some level had a key moment where they got where they are because of someone they knew for some other reason who had that connection."}, {"time": 7081, "text": "So use and spread your networks and make them as diverse as possible."}, {"time": 7085, "text": "Find people who are of a different party, have different interests, but are interesting to you."}, {"time": 7091, "text": "That's brilliant advice."}, {"time": 7092, "text": "And some of that on the passion side, I do find that as somebody who has a lot of passions, I find the second part to that is committing."}, {"time": 7107, "text": "Yes, that's true too."}, {"time": 7108, "text": "Which sucks because life is finite."}, {"time": 7112, "text": "And when you commit, you say, well, I'm never going to be good."}, {"time": 7117, "text": "Like when you choose one of the two passions, one of the two things you're interested in, you're basically saying, I'm letting go."}, {"time": 7125, "text": "I'm saying goodbye to."}, {"time": 7129, "text": "Which is actually what does goodbye means, not goodbye, but letting go."}, {"time": 7132, "text": "I think that's exactly right."}, {"time": 7133, "text": "I think you do have to make choices."}, {"time": 7135, "text": "You do have to set priorities."}, {"time": 7136, "text": "I often laugh at students who tell me they want to have like three majors."}, {"time": 7140, "text": "If you have three majors, you have no major, right?"}, {"time": 7142, "text": "I mean, so I do think you have to make choices."}, {"time": 7144, "text": "I also think it's important that whatever you do, even if it's a small thing, you always do the best you can."}, {"time": 7153, "text": "You always do excellent work."}, {"time": 7155, "text": "My kids are tired of hearing me say this at home, but I believe everything you do should be about excellence."}, {"time": 7161, "text": "The best you can do."}, {"time": 7162, "text": "If I'm going to wash the dishes, I'm going to be the best person washing the dishes."}, {"time": 7166, "text": "If I'm going to write a book review, I'm going to write the best possible book review I can."}, {"time": 7170, "text": "Because you develop a culture about yourself, which is about excellence."}, {"time": 7175, "text": "Yeah, I was telling you offline about all the kind of stuff, Google Fiber and cable installation, all that stuff."}, {"time": 7181, "text": "I've been always a believer, washing dishes."}, {"time": 7185, "text": "People don't often believe me when I say this."}, {"time": 7187, "text": "I don't care what I do."}, {"time": 7190, "text": "I am with David Foster Wallace."}, {"time": 7192, "text": "I'm unborable."}, {"time": 7193, "text": "There's so much joy for me."}, {"time": 7195, "text": "I think for everyone, but okay, let me just speak for me, to be discovered in getting really good at anything."}, {"time": 7202, "text": "In fact, getting good at stuff that most people believe is boring or menial labor or impossible to be interesting, that's even more joyful to find the joy within that and the excellence."}, {"time": 7217, "text": "It's the Jiro dreams of sushi, making the same fricking sushi over and over and becoming a master that can be truly joyful."}, {"time": 7225, "text": "There's a sense of pride and on the pragmatic level, you never know when someone will spot that."}, {"time": 7231, "text": "And intelligent people who perform at the level of high excellence look for others."}, {"time": 7236, "text": "Who do you say?"}, {"time": 7237, "text": "And it radiates some kind of signal."}, {"time": 7240, "text": "It's weird what you attract to yourself when you just focus on mastery and pursuing excellence in something."}, {"time": 7248, "text": "Like this is the cool thing about it."}, {"time": 7251, "text": "That's the joy I've really truly experienced."}, {"time": 7253, "text": "I didn't have to do much work."}, {"time": 7255, "text": "It's just cool people kind of, I find myself in groups of cool people, like really people who are excited about life, who are passionate about life."}, {"time": 7262, "text": "There's a fire in their eyes."}, {"time": 7264, "text": "That's at the end of the day just makes life fun."}, {"time": 7269, "text": "And then also money wise, at least in this society, we're fortunate to where if you do that kind of thing, money will find a way."}, {"time": 7276, "text": "Like I have the great, I say this that I don't care about money."}, {"time": 7281, "text": "I have to think about what that means because some people criticize that idea."}, {"time": 7285, "text": "It's like, yeah, it must be nice to say that."}, {"time": 7288, "text": "Cause I have for much, many periods of my life had very little money, but I think we live in a society where not caring about money, but just focusing on your passions."}, {"time": 7298, "text": "If you're truly pursuing excellence, whatever that is, money will find you."}, {"time": 7302, "text": "That's I guess the ideal of the capitalist system."}, {"time": 7304, "text": "And I think that the entrepreneurs I've studied and had the chance to get to know, and I'm sure you'd agree with this, they do what they do cause they're passionate about the product."}, {"time": 7313, "text": "They're not just in it to make money."}, {"time": 7315, "text": "In fact, that's when they get into trouble when they're just trying to make money."}, {"time": 7320, "text": "You said your grandmother, Emily, had a big impact on your life."}, {"time": 7324, "text": "She lived to 102."}, {"time": 7328, "text": "What are some lessons she taught you?"}, {"time": 7331, "text": "Emily, who was the child of immigrants from Russia and Poland, who never went to college, her proudest day I think was when I went to college."}, {"time": 7341, "text": "She treated everyone with respect and tried to get to know everyone."}, {"time": 7348, "text": "She knew every bus driver in the town."}, {"time": 7351, "text": "She'd remember their birthdays."}, {"time": 7353, "text": "And one of the things she taught me is no matter how high you fly, the lowest person close to the ground matters to you."}, {"time": 7361, "text": "And you treat them the same way you treat the billionaire at the top of the podium."}, {"time": 7367, "text": "And she did that."}, {"time": 7368, "text": "She didn't just say that."}, {"time": 7369, "text": "Some people say that and don't do it."}, {"time": 7370, "text": "She really did that."}, {"time": 7372, "text": "And I always remember that it comes up in my mind at least once a week because we're all busy doing a lot of things and you either see or you even feel in yourself the desire to just, for the reasons of speed, to be short or not polite with someone who can't do anything to harm you right now."}, {"time": 7393, "text": "And I remember her saying to me, no, you don't, you treat everyone with respect."}, {"time": 7398, "text": "You treat the person you're on the phone with, customer service."}, {"time": 7402, "text": "You treat that person if you're talking to Jeff Bezos or you're talking to Elon Musk."}, {"time": 7407, "text": "And I think making that a culture of who you are is so important."}, {"time": 7411, "text": "And people notice that."}, {"time": 7412, "text": "That's the other thing."}, {"time": 7413, "text": "And they notice when it's authentic."}, {"time": 7414, "text": "Everyone's nice to the person at the bottom of the totem pole when you want to get ahead in the line for your driver's license."}, {"time": 7420, "text": "But are you nice to them when you don't need that?"}, {"time": 7422, "text": "They notice that."}, {"time": 7423, "text": "And even when nobody's watching, that has a weird effect on you that's going to have a ripple effect and people know."}, {"time": 7431, "text": "That's the cool thing about the internet."}]}]