[{"title": "Sara Seager: Search for Planets and Life Outside Our Solar System | Lex Fridman Podcast #116", "id": "-jA2ABHBc6Y", "quotes": [{"time": 332, "text": "When did you first fall in love with the stars?"}, {"time": 334, "text": "I think I've always loved the stars."}, {"time": 337, "text": "One of my first memory is of the moon."}, {"time": 339, "text": "I remember watching the moon and I was in the car with my dad who my parents were divorced and he was driving me and my siblings to his house for the weekend and the moon was just following me."}, {"time": 349, "text": "Just had no idea why that was."}, {"time": 351, "text": "So like looking up at the sky and there's this glowing thing, how do you make sense of the moon at that age?"}, {"time": 357, "text": "Like age five."}, {"time": 358, "text": "There's just no way you can."}, {"time": 359, "text": "I think it's one of the great things about being a kid is just that curiosity that all kids have."}, {"time": 364, "text": "You know, I was thinking because there's these almost out there ideas of that our earth is flat, floating about on the internet."}, {"time": 374, "text": "And it made me think, you know, when did I first realize that the earth is like this ball that's flying through empty space?"}, {"time": 385, "text": "I mean, it's terrifying."}, {"time": 388, "text": "I don't know how to make sense of it."}, {"time": 391, "text": "It's hard because we live in our frame of reference here on this planet."}, {"time": 394, "text": "It's nearly impossible."}, {"time": 395, "text": "None of us are lucky to go to see the curvature of earth."}, {"time": 398, "text": "I mean, do you remember when you realized, understood like the physics, like the layout of the solar system?"}, {"time": 405, "text": "Was it like, did you first have to take physics to really, like high school physics to really take that in?"}, {"time": 412, "text": "I think it's hard to say."}, {"time": 413, "text": "I had this book when I was a child."}, {"time": 415, "text": "It was in French."}, {"time": 416, "text": "I grew up in Canada, where French is supposedly taught to all of us English speaking Canadians."}, {"time": 421, "text": "And it was this book in French was about the solar system, and I just love flipping through it."}, {"time": 426, "text": "It's hard to say how much, you know, you or I understand when we're kids, but it was really great book."}, {"time": 431, "text": "What about the stars?"}, {"time": 432, "text": "When did you first learn about the stars?"}, {"time": 434, "text": "Like I do have this very incredible distinctive memory."}, {"time": 437, "text": "And again, it had to do with my dad."}, {"time": 439, "text": "He took us camping."}, {"time": 440, "text": "Now, my dad was from the UK, and he was the type who you'd find wearing a tie on weekends."}, {"time": 446, "text": "So camping was not in his sphere, his comfort zone."}, {"time": 449, "text": "We had a babysitter."}, {"time": 451, "text": "Every summer we had a babysitter, and one summer we had Tom."}, {"time": 454, "text": "He was barely older than we were."}, {"time": 456, "text": "He was 14."}, {"time": 457, "text": "My brother was 12."}, {"time": 458, "text": "I would have been 11 or 10 maybe."}, {"time": 460, "text": "And we went camping because Tom said camping is the thing."}, {"time": 462, "text": "We should try it."}, {"time": 463, "text": "And I just remember I didn't aim to see the stars, but I walked out of my tent in the middle of the night, and I looked up, and wow, so many stars."}, {"time": 475, "text": "The dark night sky and all those stars just screaming at me."}, {"time": 479, "text": "I just couldn't believe that."}, {"time": 480, "text": "Honestly, my first thought was, this is so incredible, mind blowing."}, {"time": 484, "text": "Why wouldn't anyone have told me this existed?"}, {"time": 487, "text": "Can anyone else see this?"}, {"time": 488, "text": "Have you had an experience like that with anything?"}, {"time": 493, "text": "I've had that."}, {"time": 494, "text": "I mean, I don't know if maybe you can tell me if it's the same."}, {"time": 497, "text": "I've had that with robots."}, {"time": 500, "text": "There's a few robots I've met where I just fell in love with this."}, {"time": 503, "text": "Is anyone else seeing this?"}, {"time": 505, "text": "Is anyone else seeing that here in a robot is our ability to engineer some intelligent beings, intelligent beings that we could love, that could love us, that we can interact with in some rich ways that we haven't yet discovered?"}, {"time": 524, "text": "Almost like when you get a puppy, instead of a dog, and there's this immediate bond and love, and on top of that, ability to engineer it, I had to just pause and hold myself."}, {"time": 538, "text": "I imagine, I don't have kids, I imagine there's a magic to that as well, where it's a totally new experience."}, {"time": 544, "text": "It's like, what?"}, {"time": 545, "text": "Well, yeah, the stars though, unlike kids or the puppy, it's only a good thing."}, {"time": 553, "text": "So you felt, you weren't terrified?"}, {"time": 555, "text": "Like to me, when I look at the stars, it's almost paralyzingly scary how little we know about the universe, how alone we are."}, {"time": 566, "text": "I mean, somehow it feels alone."}, {"time": 568, "text": "I'm not sure if it's just a matter of perspective, but it feels like, wow, there's billions of them out there and we know nothing about them."}, {"time": 579, "text": "And then also immediately to me, somehow mortality comes into it."}, {"time": 582, "text": "I mean, how did that make you feel at that time?"}, {"time": 585, "text": "I think as a child without articulating it, I felt that same way."}, {"time": 588, "text": "Just like, wow, this is terrifying."}, {"time": 590, "text": "What's out there?"}, {"time": 591, "text": "Like, what is this?"}, {"time": 592, "text": "What does it mean about us here?"}, {"time": 595, "text": "You're a scientist, an exo world class scientist, planetary scientist, astronomer."}, {"time": 602, "text": "Now I'm a bit of an idiot who likes to ask silly questions."}, {"time": 606, "text": "So some questions are a little bit in the realm of speculation, almost philosophical because we know so little and one of the awesome things about your work is you've actually put data and real science behind some of the biggest questions that we're all curious about."}, {"time": 621, "text": "But nevertheless, many of the questions might be a little bit speculative."}, {"time": 625, "text": "So on that topic, just in your sense, do you think we're alone in the universe, human beings?"}, {"time": 634, "text": "Do you think there's life out there?"}, {"time": 636, "text": "Well, Lex, the funny thing is, is that as a scientist, I so don't even want to answer that."}, {"time": 641, "text": "I will answer it though, but I just love to say, yeah, we naturally resist that because we want numbers and hard facts and not speculation."}, {"time": 649, "text": "But I do love that question."}, {"time": 651, "text": "It's a great question and it's one we all wonder about, but I have to give you the scientist answer first, which is we'll have the capability to answer that question soon, even starting soon."}, {"time": 662, "text": "How do you define soon?"}, {"time": 663, "text": "How do I define soon?"}, {"time": 665, "text": "So much happened in the last hundred years."}, {"time": 668, "text": "And there's a difference, right, if it's 10 years or 20 years or a hundred years."}, {"time": 671, "text": "Yeah, there's a difference in that."}, {"time": 674, "text": "Well, soon could be a decade or two decades."}, {"time": 678, "text": "Journalists usually don't like that or the people want like tomorrow, they want the news."}, {"time": 683, "text": "But what it's going to take is telescopes, space telescopes, or very sophisticated ground or space telescopes to let us study the atmospheres of other planets far away and to look what's in the atmospheres and to look for water, which is needed for life as we know it, to look for gases that don't belong that we might attribute to life."}, {"time": 702, "text": "So we have to do some really nitty gritty astronomy."}, {"time": 705, "text": "So the promising way to answer this question scientifically is to look for hints of life."}, {"time": 711, "text": "That's where like many of your ideas come in of what kind of hints might we actually see about this life."}, {"time": 718, "text": "That's exactly what we need to do."}, {"time": 719, "text": "And I like the word you chose, hint, because it's going to be a hint."}, {"time": 722, "text": "It's not going to be a 100% yay, we found it."}, {"time": 725, "text": "And then it will take future generations to do more careful work to hopefully even find a way to send a probe to these distant exoplanets and to really figure this out for us."}, {"time": 737, "text": "I mean, we'll talk about the details."}, {"time": 739, "text": "Those are fun, but like the back to the speculation, the zoomed out big picture is, yes, I believe absolutely there is life out there somewhere."}, {"time": 750, "text": "Because the vastness of the universe is incredible."}, {"time": 753, "text": "It's so breathtaking."}, {"time": 755, "text": "When we look at the night sky, if you can go to that dark sky, you can see many, many hundred or even if you have good eyesight and you're somewhere very dark, you could see thousands of stars."}, {"time": 764, "text": "But in our galaxy, we have hundreds of billions of stars and our universe has hundreds of billions of galaxies."}, {"time": 773, "text": "So think about all those stars out there."}, {"time": 777, "text": "And even if planets are rare, even if life is rare, just because the number of stars is so huge, things have to come together somewhere, someplace in our universe."}, {"time": 787, "text": "So amazing to think that somebody might be looking up on another planet in a distant galaxy."}, {"time": 795, "text": "I have to interrupt your reverie and get back to, in our lifetime at least, the short term."}, {"time": 802, "text": "We only have the nearest stars to look at."}, {"time": 804, "text": "It's true that there are so many stars, so many hosts for planets that might have life."}, {"time": 809, "text": "But in the practical question of will we find it, it has to be a star quite close to Earth, like a few light years, tens of light years, maybe hundreds of light years."}, {"time": 820, "text": "And by the way, you've introduced me to a tool of Eyes on Exoplanets, I think that NASA has put together."}, {"time": 827, "text": "Eyes on Exoplanets."}, {"time": 828, "text": "It's a great software."}, {"time": 829, "text": "You can download it."}, {"time": 830, "text": "It's so cool."}, {"time": 831, "text": "But anyway, can you give a sense of who our neighbors are?"}, {"time": 836, "text": "You said hundreds of light years."}, {"time": 840, "text": "How many stars are close by?"}, {"time": 844, "text": "What's our neighborhood like?"}, {"time": 845, "text": "Are we talking about five, 10 stars that we might actually have a chance to zoom in on?"}, {"time": 852, "text": "I'm talking about maybe a dozen or two dozen stars."}, {"time": 856, "text": "And those with planets that look suitable for us to follow up in detail."}, {"time": 862, "text": "For life."}, {"time": 864, "text": "But one thing that's really exciting in this field is that the very nearest star to Earth called Proxima Centauri, it's part of the Alpha Centauri star system."}, {"time": 874, "text": "Cool name, by the way."}, {"time": 875, "text": "Yeah, Proxima."}, {"time": 876, "text": "Whoever names them."}, {"time": 877, "text": "Nearby."}, {"time": 878, "text": "Okay, but it sounds cooler than Proxima."}, {"time": 880, "text": "Proxima Centauri appears to have a planet around it."}, {"time": 884, "text": "It's about an Earth mass planet in the so called habitable zone or the Goldilocks zone of the host star."}, {"time": 890, "text": "So think about how incredible that is."}, {"time": 892, "text": "Like out of all the stars out there, even the very nearest star has planets and has a planet of huge interest to us."}, {"time": 900, "text": "So can we talk about that planet?"}, {"time": 904, "text": "What does it mean to be maybe possibly habitable?"}, {"time": 912, "text": "How does size come into play?"}, {"time": 914, "text": "How does you know what we know about gases and what kind of things are necessary for life?"}, {"time": 922, "text": "You know, what are the factors that you make you think that it's habitable?"}, {"time": 926, "text": "And by the way, I mean, maybe one way to talk about that is people know about the Drake equation, which is a very high level, almost framework to think about what is the probability that, correct me if I'm wrong, that there's life out there and intelligent life, I think."}, {"time": 947, "text": "But then you have a equation named after you now, which I think nicely focuses in on the more achievable and interesting part of that question, which is on whether there is habitable planets out there or how many, I guess."}, {"time": 965, "text": "So the funny thing is, was one time I met Frank Drake and I asked if he minded if I took his equation and kind of revamped it for this new field of exoplanet astronomy."}, {"time": 977, "text": "He was totally cool with it."}, {"time": 978, "text": "He's totally cool."}, {"time": 979, "text": "He got total approval."}, {"time": 980, "text": "Well, maybe."}, {"time": 982, "text": "So sorry."}, {"time": 983, "text": "I'm not sure if he'd actually read the stuff about my equation, but he was cool with it."}, {"time": 986, "text": "He was cool."}, {"time": 989, "text": "So I just said like 15 different things, but maybe can you tell from your perspective, what is the Drake equation and what is, sorry, the Seager equation?"}, {"time": 998, "text": "Well, the Drake equation, as you said, it's a framework."}, {"time": 1001, "text": "It's a description of the number of civilizations out there of intelligent beings that are able to communicate with us by radio waves."}, {"time": 1013, "text": "So if you think of the movie Contact, you've seen Contact, right?"}, {"time": 1018, "text": "We're listening in, actually."}, {"time": 1019, "text": "It's an active field of research, listening to other stars at radio wavelengths, hoping that some intelligent civilizations are sending us a message."}, {"time": 1027, "text": "And the Drake equation came like at the start of that whole field to put the factors down on paper to sort of illustrate what is involved to kind of estimating."}, {"time": 1038, "text": "And there's no real estimate or prediction of how many civilizations are out there, but it's a way to frame the question and show you each term that's involved."}, {"time": 1045, "text": "So I took the Drake equation and I called it a revised Drake equation and I recast it for the search for planets by more traditional astronomy means."}, {"time": 1057, "text": "We're looking at stars, looking for planets, looking for rocky planets, looking for planets that are the right temperature for life, looking for planets that might have life that outputs gases that we might detect in the future."}, {"time": 1072, "text": "It's the same spirit of the Drake equation."}, {"time": 1073, "text": "It's not going to give us any magic numbers."}, {"time": 1075, "text": "So I'm going to say, hey, here's exactly what's out there."}, {"time": 1078, "text": "It's meant to kind of guide, guide of where we're going."}, {"time": 1081, "text": "So the Drake equation did, I mean the initial equation proposed actual numbers for those variables, right?"}, {"time": 1088, "text": "The equation proposed numbers and you can still plug your own numbers in."}, {"time": 1092, "text": "And there's this really cute website that lets you for both the Drake and my revised equation plug in some numbers and see what you got."}, {"time": 1101, "text": "So what are, I mean, what are the variables, but maybe also what are like the critical variables?"}, {"time": 1106, "text": "So in my equation, I set out to what are the numbers of inhabited planets that show signs of life by way of gases in the atmosphere that can be attributed to life."}, {"time": 1117, "text": "I could just walk through the terms as far as I'm aware."}, {"time": 1119, "text": "So the first thing I say is what are the number of stars available?"}, {"time": 1123, "text": "And it's not that those trillions and trillions of stars everywhere."}, {"time": 1127, "text": "It's what are available to like a specific search."}, {"time": 1131, "text": "And so for example, the MIT led NASA mission TESS is surveying the sky, looking for all kinds of planets, but it can also, it also has stars."}, {"time": 1141, "text": "It has about 30,000 red dwarf stars."}, {"time": 1144, "text": "So we just take a number of stars that a given survey can access."}, {"time": 1148, "text": "So that's what the number of stars is."}, {"time": 1151, "text": "Then I wanted to know what kind of stars are quiet."}, {"time": 1156, "text": "I called it fraction of those stars that is quiet."}, {"time": 1159, "text": "In the case of TESS, the way it's looking for planets is planets that transit the star."}, {"time": 1163, "text": "They go in front of the star as seen from the telescope, but it turns out that some stars are very active, they're variable and they brighten and dim with time and that interferes with our observation."}, {"time": 1173, "text": "I apologize to interrupt."}, {"time": 1175, "text": "So it's a transiting planet."}, {"time": 1177, "text": "So you're really looking for a black blob, essentially that blocks the light."}, {"time": 1182, "text": "We're looking for a black blob that blocks the light and then trying to say something about the size of the planet from the frequency of that black blobs appearance and the size of that black blob, that kind of thing."}, {"time": 1194, "text": "But let's just say that out of all the stars there are accessible to whatever telescope, some of them are just bad for whatever reason."}, {"time": 1200, "text": "You're not going to be able to find planets around them."}, {"time": 1202, "text": "So I need to know the fraction of those that are, that are good."}, {"time": 1205, "text": "So again, we have the number of stars, the fraction of them that we can actually find planets around."}, {"time": 1210, "text": "And by the way, is our sun one such, is our sun quiet?"}, {"time": 1216, "text": "Our sun is quiet."}, {"time": 1218, "text": "So I have actually two terms."}, {"time": 1220, "text": "One describes how quiet they are and one is if we can find a planet around that star."}, {"time": 1225, "text": "These transiting planets, for example, not all planets transit because the planet would have to be orbiting that star in this kind of plane as viewed from you."}, {"time": 1236, "text": "But if a star is, for example, orbiting in the plane of the sky, it will never transit."}, {"time": 1240, "text": "It will never go in front of the star."}, {"time": 1243, "text": "So in that case, we have to have a fraction that takes into account of that kind of geometric factor."}, {"time": 1248, "text": "And hopefully, I mean, you can assume that it's uniformly distributed, hopefully."}, {"time": 1252, "text": "Yes, we can assume and there's evidence that it's uniformly distributed, yes."}, {"time": 1256, "text": "So then the next, so all of these factors so far, number of stars accessible to whatever telescope you're thinking about, how many stars are quiet, fraction of stars that are quiet, fraction that are observable, in this case for the geometric factor, those are all things we can measure."}, {"time": 1271, "text": "And there's one more term in the secret equation we can measure."}, {"time": 1274, "text": "I call it fraction of planets in the habitable zone."}, {"time": 1278, "text": "Because believe it or not, we have a handle on that for a certain set of stars."}, {"time": 1283, "text": "We know from our, the Kepler Space Telescope that operated for a number of years, we have estimates for how many planets are in the so called habitable zone of the host star for a certain type of star."}, {"time": 1293, "text": "So all those we have measurable."}, {"time": 1294, "text": "And then like the Drake equation itself, there are some terms we can not measure."}, {"time": 1299, "text": "And those ones, I call them FL, fraction of all those planets that have life on them."}, {"time": 1306, "text": "Because we don't know what that is."}, {"time": 1307, "text": "And FS, I called for spectroscopy, the fraction that have, we can use our telescope and instrument tools to look for light."}, {"time": 1318, "text": "The FS was the ones that, the planets that have life that actually gives off a gas, a useful gas that might accumulate in the atmosphere, so we could eventually observe it."}, {"time": 1330, "text": "How do the FL and FS interplay?"}, {"time": 1332, "text": "So these are separate terms?"}, {"time": 1334, "text": "Separate terms."}, {"time": 1335, "text": "And so?"}, {"time": 1336, "text": "So for example, you could imagine, so for example, you could imagine life, like us humans, we breathe out carbon dioxide."}, {"time": 1346, "text": "And our planet Earth, we already have a lot of carbon dioxide on it."}, {"time": 1349, "text": "Well, we have hundreds of parts per million, but it has a really strong signal."}, {"time": 1353, "text": "So us humans breathing out carbon dioxide, it's not helpful for any intelligent beings that are looking back at Earth, because there's already a lot of, there's already enough carbon dioxide, we're not adding to it."}, {"time": 1363, "text": "So if there is life on a planet, and it's outputting a boring gas that's not helpful for us to uniquely identify as being made by life versus just being there anyway, then it's not helpful."}, {"time": 1375, "text": "So I separated those two terms out."}, {"time": 1377, "text": "Soon I think we'll have evidence that planets that can support life at least are common."}, {"time": 1384, "text": "So okay, this is such an awesome topic, I have a million questions."}, {"time": 1391, "text": "What okay, I know this is a little bit of speculation, but what's your sense about that, I think FS, which is like, that life would produce interesting gases that would be able to detect, like, is there, one, is there scientific evidence and, and second, is there some intuition around life producing gases with detectable hints in terms of chemistry?"}, {"time": 1416, "text": "So interestingly enough, that entire question relates to, I'm going to say almost my life's work, the work I'm doing now and the work I'm doing for the next 20 years, and I wish I could give you a concrete number, like 1%, like on the worst days, it's 1%, let's say in my mind."}, {"time": 1432, "text": "You know, in the best days, it's like 80%."}, {"time": 1434, "text": "And I could actually go into a lot of detail here, but I'll just give you the simplest things."}, {"time": 1439, "text": "So first of all, we make an assumption that like us, and our life here on Earth, life uses chemistry."}, {"time": 1447, "text": "So we use chemistry because we eat food, we breathe air, and we have metabolism that to break down food to get energy to store energy, and then ultimately to use it."}, {"time": 1458, "text": "And all life here has some kind of byproduct in doing all that, some kind of waste product that goes into the atmosphere."}, {"time": 1464, "text": "So I like to think that life everywhere uses chemistry."}, {"time": 1468, "text": "Some people have imagined, like, let's imagine like a windmill, like mechanical energy, just getting energy and using it without storing it."}, {"time": 1477, "text": "And if there was life like that, it might not need to output a gas."}, {"time": 1480, "text": "So we make this basic assumption of chemistry, that's the first thing."}, {"time": 1484, "text": "The second more complicated thing that I and my team work on is what happens to the gas once it is produced by life, it goes into the atmosphere."}, {"time": 1491, "text": "And a lot of gas is just destroyed immediately, actually, by ultraviolet radiation or by oxygen."}, {"time": 1499, "text": "Oxygen is incredibly destructive to a lot of gases."}, {"time": 1503, "text": "So the gas can be produced by life, but it could be just completely destroyed by its environment."}, {"time": 1508, "text": "I guess we should pause on that, that you mentioned your life's work."}, {"time": 1513, "text": "This is just the beautiful idea that it's kind of paralyzing when you look out there and you wonder, is there a life out there?"}, {"time": 1522, "text": "It's the first paralyzing, actually, before I encountered your work, I feel like an idiot."}, {"time": 1527, "text": "But you know, it feels like there's no tool to answer that question."}, {"time": 1532, "text": "And then what you kind of provided is this cool idea that it might be possible to answer that by looking at the gases."}, {"time": 1541, "text": "I mean, that's a really interesting, that's a beautiful idea."}, {"time": 1545, "text": "And yeah, so we could just pause on like, that's a powerful tool, I think, to build the intuition around, because I was totally clueless about it."}, {"time": 1557, "text": "And that was kind of exciting."}, {"time": 1559, "text": "I mean, I'm sure there's folks probably early on in your life who were very skeptical about this notion."}, {"time": 1566, "text": "Well, maybe I'm not sure, but generally you would want to be skeptical, it's like, well, all these kinds of other things could generate gases, you know, all those kinds of things."}, {"time": 1577, "text": "Oh, that's so true."}, {"time": 1578, "text": "And that's a big part of this growing field is how to make sure that this gas isn't produced by another effect."}, {"time": 1584, "text": "But I do want to, you know, again, pausing on that and going back a bit."}, {"time": 1589, "text": "It's incredible to think, but like, at least almost 100 years ago, there's a record of someone talking about the idea of a gas being an indicator of life elsewhere."}, {"time": 1598, "text": "That idea was floating about somewhere."}, {"time": 1600, "text": "Yes, it was totally floating about."}, {"time": 1602, "text": "And it comes down to oxygen, which on our planet fills our atmosphere to 20% by volume."}, {"time": 1608, "text": "And you know, we rely on oxygen to breathe."}, {"time": 1610, "text": "You know, when you hear about the people in Mount Everest running out of air, they're really running out of oxygen, well, they're running out of oxygen because the air is getting thinner as they climb up the mountain."}, {"time": 1621, "text": "But without plants and bacteria, there's bacteria that also photosynthesizes and produces oxygen as a waste product."}, {"time": 1629, "text": "Without those, we would have virtually no oxygen."}, {"time": 1633, "text": "Our atmosphere would be devoid of oxygen."}, {"time": 1635, "text": "So yeah, if you were to analyze Earth, is oxygen the strong indicator here?"}, {"time": 1641, "text": "Oxygen is a huge indicator."}, {"time": 1642, "text": "And that's what we're hoping, that there is an intelligent civilization not too far from here around a planet orbiting a nearby star with the kind of telescopes we're trying to build."}, {"time": 1652, "text": "And they're looking back at our sun and they've seen our Earth and they see oxygen."}, {"time": 1656, "text": "And they probably won't be like 100.0% sure that there's life making it."}, {"time": 1661, "text": "But if they go through all the possible scenarios, they'll be left with a pretty strong hint that there's life here."}, {"time": 1667, "text": "Okay, but how do you detect that type of gases that are on the planet from a distance?"}, {"time": 1675, "text": "And that's going back to that, that's what people were skeptical about."}, {"time": 1680, "text": "When I first started working on exoplanets a long time ago, people didn't believe we would ever, ever, ever study an exoplanet atmosphere of any kind."}, {"time": 1689, "text": "And now dozens of them are studied."}, {"time": 1691, "text": "There's a whole field of people, hundreds of people working on exoplanet atmospheres actually."}, {"time": 1696, "text": "But first there was a point where people didn't even know there was exoplanets, right?"}, {"time": 1700, "text": "When was the first exoplanet detected?"}, {"time": 1703, "text": "The first exoplanet around a sun like star anyway was detected in the mid 1990s."}, {"time": 1707, "text": "That was a big deal."}, {"time": 1709, "text": "Kind of vaguely remember that."}, {"time": 1710, "text": "Well, at the time it was a big deal, but it was also incredibly controversial."}, {"time": 1714, "text": "Because in exoplanets, we only had one example of a planetary system, our own solar system."}, {"time": 1721, "text": "And in our solar system, Jupiter, our big massive planet, is really far from our star."}, {"time": 1728, "text": "And this first exoplanet around a sun like star was incredibly close to its star, so close that people just couldn't believe it was a planet actually."}, {"time": 1736, "text": "So maybe zoom out, what the heck is an exoplanet?"}, {"time": 1740, "text": "An exoplanet is our name, like is the name that we call a planet orbiting a star other than our sun."}, {"time": 1748, "text": "Extrasolar, I guess is another."}, {"time": 1749, "text": "You can call it extrasolar."}, {"time": 1751, "text": "Exoplanet is simpler."}, {"time": 1752, "text": "But I think it's worth pausing to remember that each one of those stars out there in our night sky is a sun."}, {"time": 1758, "text": "And you know, our sun has planets, Mercury, Venus, Earth, Mars, etc."}, {"time": 1763, "text": "And so for a long time, people have wondered, do those other stars or other suns have planets?"}, {"time": 1769, "text": "And they do."}, {"time": 1770, "text": "And it appears that nearly every star has a planet, has a planet we call exoplanet."}, {"time": 1774, "text": "And there are thousands of known exoplanets already."}, {"time": 1777, "text": "So there's already, yeah, like, there's so many things about space that it's hard to put into one's brain, because it starts filling it with awe."}, {"time": 1787, "text": "So yeah, if you visualize the fact that the stars that we see in the sky aren't just stars, they're like, they're suns."}, {"time": 1797, "text": "And they very likely, as you're saying, would have planets around them."}, {"time": 1803, "text": "There's all these planets roaming about in this like, dimly lit darkness, with potentially life."}, {"time": 1812, "text": "I mean, it's just mind blowing."}, {"time": 1814, "text": "But maybe can you give a brief, like, history of discovering all the exoplanets?"}, {"time": 1823, "text": "So there's no exoplanets in the 90s."}, {"time": 1826, "text": "And then there's a lot of exoplanets now."}, {"time": 1828, "text": "So how did that come about?"}, {"time": 1829, "text": "So many planets."}, {"time": 1831, "text": "How did it come about?"}, {"time": 1832, "text": "Well, maybe another way to ask is, what is the methodology that was used to discover them?"}, {"time": 1838, "text": "I can say that."}, {"time": 1839, "text": "But I'd like to just say something else first where, so exoplanets, you know, the line between what is considered completely crazy."}, {"time": 1847, "text": "And what is considered mainstream research, legit, is constantly shifting."}, {"time": 1853, "text": "So before, when I started on exoplanets, it was still sketchy."}, {"time": 1856, "text": "Like, it wasn't considered a career, a thing, a place where you should be investing."}, {"time": 1861, "text": "And right now, now, today, it's so many people are working in this field, a good, I don't know, at least 1000, probably more."}, {"time": 1868, "text": "I don't know if that sounds like a lot to you, but it's a lot."}, {"time": 1870, "text": "No, it's a legitimate field of inquiry."}, {"time": 1874, "text": "Legitimate field of inquiry."}, {"time": 1875, "text": "And what's helped us is everything that's helped everyone else."}, {"time": 1878, "text": "It's software, it's computers, it's hardware."}, {"time": 1881, "text": "It's like our phones."}, {"time": 1882, "text": "You have a fantastic detector in there."}, {"time": 1883, "text": "Like, they didn't always have that."}, {"time": 1885, "text": "I don't know if you remember the so called olden days."}, {"time": 1888, "text": "We didn't have digital cameras."}, {"time": 1889, "text": "We had film."}, {"time": 1890, "text": "You take a film camera, you send the film away, and eventually it comes back, and then you see your pictures."}, {"time": 1894, "text": "And they could all be horrible."}, {"time": 1896, "text": "So yeah, I mean, digital."}, {"time": 1897, "text": "It just changed everything."}, {"time": 1898, "text": "Data changed everything."}, {"time": 1899, "text": "Yeah, and so one thing that really helped exoplanets were detectors that were very sensitive."}, {"time": 1905, "text": "Because when we're looking for the transiting planets, what we're doing is we're monitoring a star's brightness as a function of time."}, {"time": 1913, "text": "It's like click, taking a picture of the stars every few seconds or minutes."}, {"time": 1918, "text": "And we're measuring the brightness of a star, like every frame."}, {"time": 1922, "text": "And we're looking for a drop in brightness that's characteristic of a planet going in front of the star, and then finishing its so called transit."}, {"time": 1931, "text": "And to make that measurement, we have to have precise detectors."}, {"time": 1935, "text": "And the detectors that are making the measurement, can you do it from Earth?"}, {"time": 1942, "text": "Are they floating about in space, like what kind of telescope?"}, {"time": 1945, "text": "So on the ground, people are using telescopes, small telescopes that are almost just like a glorified telephoto lens."}, {"time": 1952, "text": "And they're looking at big swaths of the sky."}, {"time": 1955, "text": "And from the ground, people can find giant planets like the size of Jupiter."}, {"time": 1958, "text": "So it's about 10 to 12 times the size of Earth."}, {"time": 1961, "text": "We can find big planets, because we can reach about 1% precision."}, {"time": 1966, "text": "So not sure how technical you want to get."}, {"time": 1968, "text": "Well, how many pixels are we talking about?"}, {"time": 1973, "text": "You mentioned phones, there's a bunch of megapixels, I think."}, {"time": 1976, "text": "So for exoplanets, you want to think about it as like a pixel or less than a pixel, we're not getting any information."}, {"time": 1983, "text": "But to be more technical, our telescope spreads the light out over many pixels, but we're not getting information."}, {"time": 1989, "text": "We're not tiling the planet with pixels."}, {"time": 1992, "text": "It's just like a point of light, or in most cases, we don't even see the planet itself, just the planet's effect on the star."}, {"time": 1997, "text": "But another thing that really helped was computers, because transiting planets are actually quite rare."}, {"time": 2003, "text": "I mean, they don't all go in front of their star."}, {"time": 2005, "text": "And so to find transiting planets, we look at a big part of the sky at once, or we look at tens of thousands or hundreds of thousands, or even in some cases, millions of stars at one time."}, {"time": 2015, "text": "And so you're not going to do this by hand, going through a million stars, counting up the brightness."}, {"time": 2020, "text": "So we have computer software and computer code that does the job for us and counts the brightness and looks for a signal that could be due to a transiting planet."}, {"time": 2031, "text": "And I just finished a job called Deputy Science Director for the MIT led NASA mission test."}, {"time": 2039, "text": "And it was my purview to make sure that we got the planet candidates, the transiting light curves, out to the community so people could follow them up and figure out if they're actual planets or false positives."}, {"time": 2053, "text": "So publish the data so that people could just, all the data scientists out there could crunch and see if they can discover something."}, {"time": 2061, "text": "They can discover something."}, {"time": 2062, "text": "And in fact, the NASA policy for this mission is that all the data becomes public as soon as possible."}, {"time": 2068, "text": "It's not as easy as it sounds, though, to download the data and look for planets."}, {"time": 2073, "text": "But there is a group called PlanetHunters.org, and they take the data and they actually crowdsource it out to people to look for planets."}, {"time": 2081, "text": "And they often find signals that our computers and our team missed."}, {"time": 2084, "text": "So we mentioned exoplanets."}, {"time": 2086, "text": "What about Earth like, or I don't know what the right distinction is, is it habitable or is it Earth like planets, but what are those different categories and how can we tell the difference and detect each?"}, {"time": 2098, "text": "So we're not at Earth like planets yet."}, {"time": 2101, "text": "All the planets we're finding are so different from what we have in our solar system."}, {"time": 2106, "text": "They're just easier planets to find, but like..."}, {"time": 2109, "text": "For example, there could be a Jupiter sized planet where an Earth should be."}, {"time": 2114, "text": "We find planets that are the same size as Earth, but are orbiting way closer to their star than Mercury is to our sun."}, {"time": 2124, "text": "They're so close that, because close to a star means they also orbit faster."}, {"time": 2129, "text": "And some of these hot super Earths we call them, their year, their time to go around their star is less than a day."}, {"time": 2136, "text": "And they're heated so much by their star, they're heated so much by the star."}, {"time": 2140, "text": "We think the surface is hot enough to melt rock."}, {"time": 2142, "text": "So instead of running out by the bay or the river, you'll have like liquid lava."}, {"time": 2147, "text": "There'll be liquid lava lakes on these planets, we think."}, {"time": 2151, "text": "And life can't survive."}, {"time": 2153, "text": "Way too hot."}, {"time": 2154, "text": "The molecules needed for life just wouldn't be able to survive those temperatures."}, {"time": 2159, "text": "We have some other planets."}, {"time": 2160, "text": "One of the most mysterious things out there, factoid, if you will, is that the most common type of planet we know about so far is a planet that's in between Earth and Neptune size."}, {"time": 2172, "text": "It's two to three times the size of Earth."}, {"time": 2175, "text": "And we have no solar system counterpart of that planet."}, {"time": 2179, "text": "That is like going outside to the forest and finding some kind of creature or animal that just no one has ever seen before and then discovering that is the most common thing out there."}, {"time": 2189, "text": "And so we're not even sure what they are."}, {"time": 2190, "text": "We have a lot of thoughts as to the different types of planet it could be, but people don't really know."}, {"time": 2195, "text": "I mean, what are your thoughts about what it could be?"}, {"time": 2197, "text": "Well, one thought, and this is more when we want to be rather than might be, is that these so called mini Neptunes, we call them, that they are water worlds, that they could be scaled up versions of Jupiter's icy moons, such that they are planets that are made of more than half of water by mass."}, {"time": 2217, "text": "And what's the connection between water and life and the possibility of seeing that from a gas perspective?"}, {"time": 2223, "text": "Okay, so all life on Earth needs liquid water."}, {"time": 2227, "text": "And so there's been this idea in astronomy or astrobiology for a long time called follow the water, find water, that will give you a chance of finding life, but we could still zoom out and the community consensus is that we need some kind of liquid for life to originate and to survive because molecules have to react."}, {"time": 2248, "text": "You don't have a way that molecules can interact with each other."}, {"time": 2251, "text": "You can't really make anything."}, {"time": 2252, "text": "And so when we think of all the liquids out there, water is the most abundant liquid in terms of planetary materials."}, {"time": 2259, "text": "There really aren't that many liquids."}, {"time": 2260, "text": "Like I mentioned, liquid rock, way too hot for life."}, {"time": 2264, "text": "We have some really cold liquids, like almost gasoline, like ethane and methane lakes that have been found on one of Saturn's moons, Titan."}, {"time": 2272, "text": "That's so cold though."}, {"time": 2273, "text": "And for exoplanets, we can't study really cold planets because they're just simply too dark and too cold."}, {"time": 2280, "text": "So we usually are just left with looking for planets with liquid water."}, {"time": 2285, "text": "And to your point, remember as we talked about how planets are less than a pixel in that way to say, so we can't see oceans on planet."}, {"time": 2295, "text": "We're not going to see continents and oceans, not yet anyway, but we can see gases in the atmosphere."}, {"time": 2300, "text": "And if it's a small rocky planet, and this is going into some more detail, if we see a small rocky planet with water vapor in the atmosphere, we're pretty sure that means there has to be a liquid water reservoir because it's not intuitive in any way, but water is broken up by ultraviolet radiation from the star or from the sun."}, {"time": 2322, "text": "And on most planets when water is broken up into H and O, the H, the hydrogen will escape to space."}, {"time": 2328, "text": "Because just like when you think of a child letting go of a helium filled balloon, it floats upwards and hydrogen is a light gas and will leave from the planet."}, {"time": 2338, "text": "So ultimately if you have water, unless there's an ocean, like a way to keep replenishing water vapor in the atmosphere, that water vapor should be destroyed by ultraviolet radiation."}, {"time": 2348, "text": "Got it, so there's a, okay, so there's a need for liquid, I mean, I guess it was water."}, {"time": 2356, "text": "Is water essential or are the liquids, I mean, the chemistry here is probably super complicated."}, {"time": 2361, "text": "It does, but you know, there's not an infinite number of liquids."}, {"time": 2364, "text": "There's maybe like five liquids that can exist inside or on the surface of a planet."}, {"time": 2368, "text": "And water is the one that exists for the largest range of temperatures and pressures."}, {"time": 2372, "text": "And it's also the easiest type of planet for us to find and study is one with water vapor rather than a cold planet that has ethane and methane lakes."}, {"time": 2381, "text": "What's your personal, in terms of solar systems and planets that you're most hopeful about in terms of our closest neighbors that you kind of have a sense that there might be somebody living over there, whether it's bacteria or somebody that looks like us."}, {"time": 2402, "text": "I'm hopeful that every star nearby has a planet."}, {"time": 2406, "text": "That has some life."}, {"time": 2407, "text": "Because it almost has to for us to make progress."}, {"time": 2409, "text": "We have to have that dream condition."}, {"time": 2412, "text": "So the dream condition is like life is just super abundant out there."}, {"time": 2416, "text": "Yeah, the dream, yes, the dream condition is that life is super abundant and it's based on the thought that if there is a planet with water and continents, that it also has the ingredients for life and that the kind of base kernel thought is that if the ingredients for life is there, life will form."}, {"time": 2437, "text": "Life will form."}, {"time": 2438, "text": "That's what we're holding on to."}, {"time": 2439, "text": "With a relatively high probability."}, {"time": 2441, "text": "Yes, that's it."}, {"time": 2443, "text": "Okay, let's go into land of speculation."}, {"time": 2446, "text": "What about intelligent life?"}, {"time": 2449, "text": "Us humans consider ourselves intelligent, surprisingly or unsurprisingly."}, {"time": 2456, "text": "Do you think about from your perspective of looking at planets from a gas composition perspective and in general of how we might see intelligent life and your intuition about whether that life is even out there?"}, {"time": 2472, "text": "I think the life is out there somewhere."}, {"time": 2474, "text": "The huge numbers of stars and planets."}, {"time": 2477, "text": "I like to think that life had a chance to evolve to be intelligent."}, {"time": 2481, "text": "I'm not convinced the life is anywhere near here, only because if it's hard for intelligent life to evolve, then it will be far away by definition."}, {"time": 2489, "text": "Well, the sad thing is maybe from the artificial intelligence perspective is it makes me sad there might be intelligent life out there that we're just not like the pathways of evolution can go in all these different directions where we might not be able to communicate with it or even know that or even detect its intelligence or even comprehend its intelligence."}, {"time": 2512, "text": "I'm convinced cats are more intelligent than humans that we're just not able to comprehend the measures, the proper measures of their intelligence."}, {"time": 2524, "text": "My dog is so funny."}, {"time": 2526, "text": "He's a golden doodle."}, {"time": 2527, "text": "His name's Leo."}, {"time": 2528, "text": "We joke that he's either a really dumb dog and sorry, he's not here to defend himself, but he's either really dumb or he's a super genius just pretending to be dumb."}, {"time": 2537, "text": "And it's possible he's a multidimensional projection of alien life here monitoring one of the top scientists in the world trying to find aliens just to make sure that humans don't get out of hand."}, {"time": 2555, "text": "Oh, I'm definitely going to go in and ask him about that when I get home."}, {"time": 2559, "text": "She's onto something."}, {"time": 2561, "text": "What might we look for in terms of signs of intelligent life?"}, {"time": 2566, "text": "From your toolkit, do you think there are things that we might be able to use or maybe in the next couple of decades discover that would be different than life that's like bacteria, that's primitive life?"}, {"time": 2583, "text": "I still love SETI, Search for Extraterrestrial Intelligence."}, {"time": 2586, "text": "I like to hope that if there is a civilization out there, they're trying to send us a message."}, {"time": 2590, "text": "I think, like, think about it, I don't know."}, {"time": 2593, "text": "What are your thoughts?"}, {"time": 2594, "text": "Like, if you think about our Earth, there's no structure we've built that intelligent civilizations could see from far away."}, {"time": 2600, "text": "There's literally nothing, not even the Great Wall of China."}, {"time": 2603, "text": "And so to think, like, why would this other civilization build a giant structure that we could see?"}, {"time": 2608, "text": "Yeah, so with SETI, the idea is that we're both trying to hear signals and send signals, right?"}, {"time": 2614, "text": "Well, we haven't sent one."}, {"time": 2615, "text": "They call that METI, messaging."}, {"time": 2617, "text": "And there's a big kind of fear over METI, because do you want to tell them you're here?"}, {"time": 2622, "text": "It's kind of this, like, let's wait till they call us."}, {"time": 2626, "text": "It's like a dating game, you have to, like, how many days do I wait before I call, kind of thing."}, {"time": 2633, "text": "But the funny thing is, if no one's sending us a message, if everybody's only listening, how do you make progress?"}, {"time": 2640, "text": "And, I mean, but there's also, there's the Voyager spacecraft that we have these little pixels of robots flying out all over the place."}, {"time": 2649, "text": "Some of them, like the Voyager, reach out really far."}, {"time": 2653, "text": "And they have some stuff on them."}, {"time": 2655, "text": "Okay, I just... We do, we have the Voyager, but they're not really going anywhere in particular."}, {"time": 2659, "text": "And they're moving very, very slowly on a cosmic scale."}, {"time": 2662, "text": "And me saying they're far is kind of silly."}, {"time": 2665, "text": "It's all relative in astronomy."}, {"time": 2666, "text": "It's all relative."}, {"time": 2669, "text": "I just..."}, {"time": 2670, "text": "So from the, if you look at Earth from an alien perspective, from visually and from gas composition, I wonder if it's possible to determine the degree of maybe productive energy use."}, {"time": 2685, "text": "I wonder if it's possible to tell, like, how busy these Earthlings are."}, {"time": 2691, "text": "Well, let's zoom out again and think about oxygen."}, {"time": 2695, "text": "So when cyanobacteria arose like billions of years ago and figured out how to harness the energy of the sun for photosynthesis, they reengineered the entire atmosphere."}, {"time": 2705, "text": "20% of the atmosphere has oxygen now."}, {"time": 2709, "text": "Like that is a huge scale."}, {"time": 2711, "text": "You know, they almost poisoned everything else by making this, what was apparently very poisonous to everything that was alive."}, {"time": 2717, "text": "But imagine..."}, {"time": 2718, "text": "So are we doing anything at that scale?"}, {"time": 2719, "text": "Like, are we changing anything at like 20% of the Earth with a giant structure or 20% of this or 20% of that?"}, {"time": 2724, "text": "Like we aren't actually."}, {"time": 2728, "text": "That's humbling to think that we're not actually having that much of an impact."}, {"time": 2733, "text": "But we are because in a way we're destroying our entire planet."}, {"time": 2735, "text": "But it's humbling to think that from far away, people probably can't even tell."}, {"time": 2740, "text": "But from the perspective of the planet, when we say we're destroying, you know, global warming, all that kind of stuff, what we really mean is we're destroying it for a bunch of different species, including humans."}, {"time": 2754, "text": "But like, I think the Earth will be okay."}, {"time": 2755, "text": "Oh, the Earth will be, the Earth will remain, whatever happens to us, the Earth will still be here."}, {"time": 2761, "text": "And it'll still be difficult to detect any difference."}, {"time": 2763, "text": "Like it's sad to think that if humans destroy ourselves, except potentially with nuclear war, it'd be hard to tell that anything even happened."}, {"time": 2773, "text": "It's hard to tell from far away that anything happened."}, {"time": 2775, "text": "What about, what are your thoughts now?"}, {"time": 2777, "text": "This is really getting into speculation land."}, {"time": 2781, "text": "You've mentioned exoplanets were in the realm of, you know, this is beautiful edge between science and science fiction."}, {"time": 2791, "text": "That some of us, a rare few are brave enough to walk, I think in academia, you were brave enough to do that."}, {"time": 2799, "text": "I think in some sense, artificial intelligence sometimes walks that line a little bit."}, {"time": 2807, "text": "There is so much excitement about extraterrestrial life and aliens in this world."}, {"time": 2812, "text": "I mean, I don't know what, how to comprehend that excitement, but to me, it's great to see people curious because to me, extraterrestrial life and aliens is at the core, a scientific question."}, {"time": 2828, "text": "And it's almost looks like people are excited about science."}, {"time": 2831, "text": "They're excited by discovery, discovery, right?"}, {"time": 2836, "text": "And then the possibility that there's alien life that visited earth or is here on earth now is, is a excitement about discovery in your lifetime, essentially."}, {"time": 2849, "text": "I mean, what do you make, what do you make of that?"}, {"time": 2853, "text": "There's recent events where DARPA or DOD released footage of these unmanned aerial phenomena."}, {"time": 2864, "text": "They're calling them now UAP."}, {"time": 2866, "text": "They got everybody like super excited."}, {"time": 2868, "text": "Like maybe there is like what, what, what's, what's here on earth."}, {"time": 2872, "text": "Do you follow the, this world of people who are thinking about aliens that are already here or have visited?"}, {"time": 2880, "text": "I don't really follow it."}, {"time": 2881, "text": "They follow me."}, {"time": 2882, "text": "Because in this field, if you're a scientist of any kind, you get, people contact us, me."}, {"time": 2891, "text": "There's a lot of them about, Hey, I have stuff you should see, Hey, the aliens are already here."}, {"time": 2896, "text": "I need to tell you about it."}, {"time": 2897, "text": "And I know there are people out there who really believe there's a psychology to it."}, {"time": 2902, "text": "There's a psychology to it and it's fascinating, but okay."}, {"time": 2905, "text": "So it's similar to artificial intelligence, but I still, but like you, I'm still enamored with the point that it is out there and that people believe so strongly."}, {"time": 2912, "text": "And that's so many people out there believe, believe."}, {"time": 2917, "text": "And I don't know, I I'm not as allergic to it as some scientists are because ultimately if aliens showed up or do show up or have showed up you know, these are going to be very difficult to study scientific phenomena."}, {"time": 2935, "text": "Like in, in fact, like going back to cats and dogs, like I just, I think we should be more open minded about developing new tools and looking for intelligent life on earth that we haven't yet found."}, {"time": 2950, "text": "Or even understanding the nature of our own intelligence because it kind of is an alien life form, the thing that's living, you know, in our skull."}, {"time": 2959, "text": "It's so true."}, {"time": 2960, "text": "And we don't understand consciousness."}, {"time": 2963, "text": "We don't understand how biology is hard, you know, unpacking it and working it all out."}, {"time": 2968, "text": "It's a stretch."}, {"time": 2969, "text": "And they say too that our thinking mind is like the tip of a pyramid and that everything else is happening under the hood and, but what is happening?"}, {"time": 2977, "text": "But the thing with, so the typical scientist response to, you know, are there aliens here is that we need to see major evidence, not like a sketchy picture of something."}, {"time": 2990, "text": "We need some cold hard evidence and we just don't have that."}, {"time": 2995, "text": "But from my perspective, I admire people that dream and I think that's beautiful."}, {"time": 3000, "text": "The thing I don't like, there's two sides of the, of the folks that probably listened to this, this podcast is, oh, those that dream, I think is beautiful, that, that wander what's out there, what's here on earth."}, {"time": 3014, "text": "And then the other ones who are very conspiratorial and thinking that stuff is being hidden and it becomes about institutions."}, {"time": 3023, "text": "I have a funny thing to talk about that."}, {"time": 3024, "text": "So one of my colleagues had a really good answer to that and it's not me saying this, so I can say this, but he said, look, he works with NASA, not at NASA."}, {"time": 3032, "text": "He works with government, not in the government."}, {"time": 3035, "text": "It's kind of mean, but he'd say, trust me, they couldn't hide it if they tried."}, {"time": 3037, "text": "Do you know what I'm saying?"}, {"time": 3039, "text": "Like, we're not smart enough or good enough."}, {"time": 3042, "text": "Not we or not me or not you, but whoever to cover it up."}, {"time": 3045, "text": "It just, it's sort of a myth."}, {"time": 3048, "text": "It makes it sad because the people at NASA, the people at MIT, the people in academia, the people in these institutions and yes, even in government are often trying, they're like just curious descendants of apes."}, {"time": 3066, "text": "They're just, they, they want to do good."}, {"time": 3068, "text": "They want to discover stuff."}, {"time": 3069, "text": "They're not trying to hide stuff."}, {"time": 3071, "text": "In fact, most of them would, in terms of leaks, would love to discover this and release this kind of stuff."}, {"time": 3079, "text": "There's a, did you ever watch the show called The X Files?"}, {"time": 3084, "text": "Scully and Mulder."}, {"time": 3086, "text": "And what I love actually, I used to put it up during my talks, my public talks."}, {"time": 3089, "text": "There's a picture of a UFO or what looks like UFO and it says, I want to believe."}, {"time": 3095, "text": "So that's, that's where I think a lot of us are coming from."}, {"time": 3098, "text": "I want to believe."}, {"time": 3100, "text": "And it's so great."}, {"time": 3101, "text": "And one time I put that up and this very, very nice couple approached me really nervous afterwards and they said, Hey, can we take you out for lunch sometime?"}, {"time": 3109, "text": "And I said, sure."}, {"time": 3110, "text": "And they were like the nicest people."}, {"time": 3112, "text": "And just one of many who has an alien, alien abduction story and the woman, um, could never have kids."}, {"time": 3120, "text": "They were older, but they didn't have kids, which for them was a real source of regret."}, {"time": 3122, "text": "But it was because the aliens who had abducted her had made it so that she couldn't have kids."}, {"time": 3127, "text": "And she had apparently something implanted behind her ear, which was somehow unimplanted later."}, {"time": 3133, "text": "And they're just so sincere and they're such a lovely couple and they just wanted to share their story."}, {"time": 3139, "text": "That's a, that's a real, whatever that is, that's the real thing."}, {"time": 3143, "text": "The mystery of the human mind is more powerful than any alien or, I mean, it's as interesting I think as the universe."}, {"time": 3152, "text": "And I think they're somehow intricately linked, maybe getting a sense of numbers."}, {"time": 3158, "text": "How many stars are there in, um, maybe, I don't know what the radius that's reasonable to think about."}, {"time": 3167, "text": "I don't know if the observable universe is like way too big to think about, but in terms of when we think about how many habitable planets there are, what are the numbers we're working with in your sense?"}, {"time": 3178, "text": "What are the scale?"}, {"time": 3179, "text": "Honestly, the numbers are probably like billions of trillions of stars."}, {"time": 3184, "text": "You know, in the UK, I think, I don't know if we do that here, but they will call a billion trillion where you put like one billion followed by a trillion."}, {"time": 3191, "text": "It's kind of weird, but here, I don't even know how to say the number 10 to the 20."}, {"time": 3194, "text": "Like if you know what that is, that's one followed by 20 zeros."}, {"time": 3197, "text": "That's a big number."}, {"time": 3198, "text": "We don't have a name for that number."}, {"time": 3200, "text": "There's so many per star."}, {"time": 3202, "text": "I think we kind of mentioned this."}, {"time": 3203, "text": "Is there a good sense, there's probably argument about this, but per star, how many planets are there?"}, {"time": 3211, "text": "We don't have that number yet per se, you know, we're not really there, but some people think that there's many planets per star."}, {"time": 3218, "text": "There's this analogy of filling the coffee cup, like, you know, you don't usually just pour one drop, you fill it."}, {"time": 3225, "text": "And that planetary systems, we see stars being born that have a disc of gas and dust and that ultimately forms planets."}, {"time": 3233, "text": "So the idea, this kind of concept is that planets, so many planets form too many."}, {"time": 3238, "text": "And eventually some get kicked out and you're left with like a full planetary system, a dynamically full system."}, {"time": 3244, "text": "And so there have to be a lot because so many form and a bunch survive."}, {"time": 3248, "text": "I mean, that makes perfect intuitive sense, right?"}, {"time": 3251, "text": "Like why wouldn't that happen?"}, {"time": 3253, "text": "Well, there's other thoughts too, though."}, {"time": 3256, "text": "These big planets that are really close to the star, we think they formed far away from the star where there's enough material to form and they migrated inwards."}, {"time": 3265, "text": "And some of these planets migrating inwards due to interaction with other planets or with the disc itself, they may have cleared it out."}, {"time": 3272, "text": "And kicked other planets out of the system."}, {"time": 3274, "text": "So there's a lot of ideas floating around."}, {"time": 3276, "text": "We're not entirely sure."}, {"time": 3279, "text": "And what about Earth like planets?"}, {"time": 3281, "text": "That's another level of uncertainty."}, {"time": 3283, "text": "It's a level of uncertainty."}, {"time": 3284, "text": "If we think of an Earth like planet being an Earth around a sun in the same orbit, an Earth like planet being an Earth sized planet in an Earth like orbit about a sun like star, we're not there yet."}, {"time": 3296, "text": "You know, we're not able to detect enough of those to give you a hard number."}, {"time": 3300, "text": "Some people have extrapolated."}, {"time": 3303, "text": "And they will say as many as one in five stars like our sun could be hosting a true Earth like planet."}, {"time": 3310, "text": "On the topic of space exploration, there's been a lot of exciting developments with NASA, with SpaceX, with other companies successfully getting rockets into space with humans and getting them to land back, especially with SpaceX."}, {"time": 3327, "text": "What are your thoughts about Elon Musk and SpaceX, Crew Dragon, while working with NASA to launch astronauts?"}, {"time": 3335, "text": "What's your sense about these exciting new developments?"}, {"time": 3339, "text": "Well, SpaceX and other so called commercial companies are only good news for my field, because they're lowering the cost of getting to space by having reusable rockets."}, {"time": 3350, "text": "It's just been it's incredible."}, {"time": 3352, "text": "And we need cheaper access to space."}, {"time": 3353, "text": "So from a very practical viewpoint, it's all good."}, {"time": 3356, "text": "Without getting people, there's this dream that we have to go to Mars, boots on Mars."}, {"time": 3361, "text": "Boots on Mars."}, {"time": 3364, "text": "You mentioned probes."}, {"time": 3366, "text": "What's the value of humans?"}, {"time": 3368, "text": "Is that interesting to you from both scientific and a human perspective?"}, {"time": 3373, "text": "Human mostly."}, {"time": 3374, "text": "I think it's such in our desire to explore because part of what it means to be human."}, {"time": 3379, "text": "So wanting to go to another planet and be able to live there for some time."}, {"time": 3383, "text": "It's just just what it means to be human."}, {"time": 3386, "text": "You know, oftentimes in science and engineering, big, huge discoveries are made when we didn't intend to."}, {"time": 3393, "text": "So often this kind of pure exploratory type of research or this pure exploration research, it can lead to something really important like the laser, we couldn't really live without that now."}, {"time": 3402, "text": "At the grocery, you scan your foods, there's surgery that involves lasers, GPS, we all use our GPS."}, {"time": 3407, "text": "We don't have GPS because someone thought, hey, it'd be great to have a navigation system."}, {"time": 3413, "text": "And so I do support, I do, I just, but I really think it comes primarily just from the desire to explore."}, {"time": 3419, "text": "Do you think something, there's a lot of criticism and a lot of excitement about Mars."}, {"time": 3426, "text": "Do you think there's value in trying to go to put humans on Mars, first of all, and second of all, colonize Mars?"}, {"time": 3435, "text": "Do you think there's something interesting that might come from there?"}, {"time": 3438, "text": "I'm convinced there will be something interesting."}, {"time": 3440, "text": "I just don't know what it is yet, but I don't think, I don't think having some commercial value or value in the metric of something useful is really what's motivating us."}, {"time": 3449, "text": "So really, you see, exploration is a long term investment into something awesome that eventually will be commercial value."}, {"time": 3455, "text": "I do actually."}, {"time": 3458, "text": "So what about visiting, okay, I apologize, but Amy, there's an exciting longing to visit Earth like planets elsewhere."}, {"time": 3471, "text": "So what's the closest Earth like planet you think is worth visiting and how hard is it?"}, {"time": 3479, "text": "Wow, it is very hard."}, {"time": 3481, "text": "I mean, our nearest, call it Earth mass planet, it's orbiting a star very different from our own sun, an M Dwarf star, a small red star, Proxima Centauri."}, {"time": 3490, "text": "It's over four light years away and we can't travel at the speed of light."}, {"time": 3495, "text": "We can't even travel, I mean, it would take tens of thousands of years to get there with conventional methods."}, {"time": 3499, "text": "So, you know, the movies like multigenerational, yeah, this movie Passenger, have you seen that movie?"}, {"time": 3504, "text": "Passenger."}, {"time": 3506, "text": "It's about a big spaceship that is traveling to another planet and everyone's hibernating."}, {"time": 3510, "text": "I won't give you the spoiler alert because one person wakes up and then it's kind of a problem."}, {"time": 3515, "text": "But yeah, the multigenerational ships, I mean, when you think about where we're headed as a species, maybe we don't send people, maybe we end up sending raw biological materials and instructions to print out humans, it sounds kind of farfetched, but already we're printing like liver cells in the lab and beating heart cells, we're starting to reconstruct body parts."}, {"time": 3542, "text": "I mean, the thing is, it is so hard to get to another planet that this thought of printing humans or printing life forms actually could be easier."}, {"time": 3549, "text": "Yeah, that's somehow so sad to think, to think of the idea that we would launch a successful spaceship that has multigenerational, like non human life and it's going to reach other intelligent life and by the time they figure out where it came from, human civilization will be extinct."}, {"time": 3572, "text": "Yeah, that is really, I mean, that's, so that's one, there's a, there's a tempting thing to think about."}, {"time": 3577, "text": "What are the possible trajectories?"}, {"time": 3578, "text": "So, you know, Elon keeps talking about multi planetary, us becoming multi planetary species."}, {"time": 3587, "text": "I mean, sure, Mars is a part of that, but like the dream is to really expand outside the solar system."}, {"time": 3597, "text": "And it's, it's not clear, just like, as you said, like what the actual scientific engineering steps that are required to take, it seems like so daunting, so daunting."}, {"time": 3608, "text": "So like this, the smart thing seems to be to do the most achievable near daunting task, even if there doesn't seem to be a commercial application, which I think is colonizing Mars."}, {"time": 3621, "text": "But like from your perspective, is there some Manhattan project style, huge project in space that we might want to take on and you've had roles."}, {"time": 3634, "text": "You had scientists hat roles and then you also had roles in terms of being on like committees and stuff, determining where funding goes and so on."}, {"time": 3642, "text": "So like, is there a huge like multi trillion, we've been throwing the T word around recently a lot, but these huge projects that we might want to take on?"}, {"time": 3652, "text": "Well, first of all, we want to find the planets like earth first, like just even finding those earth like planets is a billion dollar endeavor, billions of dollars endeavor."}, {"time": 3661, "text": "And that's so hard because an earth is so small, so less massive, and so faint compared to our sun."}, {"time": 3668, "text": "It's the proverbial needle in a haystack, but worse."}, {"time": 3670, "text": "And we need very sophisticated space based telescopes to be able to find these planets and to look, look at them and see which ones have water and which ones have signs of life on them."}, {"time": 3680, "text": "Yeah, the, the star shade project that you're part of, star shade, star shade, yeah, this is probably the most badass thing I've ever seen."}, {"time": 3687, "text": "You know what's interesting?"}, {"time": 3688, "text": "Can you describe what it is?"}, {"time": 3689, "text": "So what's amazing about star shade is it was first conceived of in the 1960s."}, {"time": 3694, "text": "Imagine that and revisited every decade until now when we think we can actually build it and star shade is a giant specially shaped screen."}, {"time": 3702, "text": "It is about, there's different versions of it, but think about 30 meters in diameter."}, {"time": 3707, "text": "So you're blocking out the sun."}, {"time": 3709, "text": "You're effectively blocking out the star so that you can see the planet directly and star shade would have a spacecraft attached to it and it would fly in space far away from Earth's gravity and it would have to formation fly with a space telescope."}, {"time": 3723, "text": "So the idea is that star shade blocks out the starlight in a very careful way and it has to block that starlight out so that the planet that is 10 billion times fainter than the star, that only the planet light goes to the telescope."}, {"time": 3739, "text": "So in formation, meaning the telescope flies in, you gave a presentation on this, but like it, it would fly like in, um, this is extremely high precision endeavor."}, {"time": 3751, "text": "We had this analogy like asking a friend to hold up a dime five miles away perfectly."}, {"time": 3757, "text": "Like at the perfect line of sight with you."}, {"time": 3760, "text": "And the shape of it is pretty cool."}, {"time": 3761, "text": "I mean, uh, I don't know exactly what the physics of that, like what the optics are that require that shape."}, {"time": 3767, "text": "I can tell you, it turns out that if you block out a star, imagine blocking out a star with a circle circularly or a square shaped screen, you wouldn't actually be blocking it because the star acts like a wave."}, {"time": 3778, "text": "The starlight can act like a wave and it would actually bend around the edges of the screen."}, {"time": 3783, "text": "And so instead of blocking out the light, you're expecting to see nothing."}, {"time": 3786, "text": "You would see ripples and the analogy that I love to give, it's like throwing a pebble in a pond."}, {"time": 3792, "text": "You know, you get those ripples, you get these concentric ripples and they go out and light would do something quite similar."}, {"time": 3798, "text": "You'd actually see ripples of light and those ripples of light, they're actually way brighter than the planet we'd be looking for."}, {"time": 3806, "text": "So they would introduce this noise that's a noise."}, {"time": 3809, "text": "And so the star shade, it's like a mathematical solution to the problem of diffraction it's called."}, {"time": 3815, "text": "And this is what the first person who thought about star shape in the 1960s worked out the mathematical shape or one salute, one family of solutions."}, {"time": 3823, "text": "And the idea is that when the star shade, this very special shape, like a giant flower with petals, when it blocks out the light, the light bends around the edges, but interacts with itself in a way to give you a very, very dark image."}, {"time": 3837, "text": "It would be like throwing a pebble in a pond and instead of getting ripples, the pond would be perfectly smooth, like incredibly smooth to one part in 10 billion."}, {"time": 3846, "text": "And all the waves would be on the outer edges, far away from where you drop that pebble."}, {"time": 3851, "text": "And so this camera would be able to get some signal from the planet then."}, {"time": 3859, "text": "Yes, and it would be hard because the planet is so faint."}, {"time": 3862, "text": "But with the star out of the way, the glare of that bright, bright, bright star, with that out of the way, then it becomes a much more manageable task."}, {"time": 3870, "text": "So how do we get that thing out there?"}, {"time": 3872, "text": "We're working with unlimited money."}, {"time": 3874, "text": "Okay, we're working with unlimited money."}, {"time": 3875, "text": "We have some more engineering problems to solve, but not too many more."}, {"time": 3879, "text": "We've been burning down our so called tall pole list."}, {"time": 3883, "text": "What kind of list?"}, {"time": 3884, "text": "We call it technology tall pole."}, {"time": 3887, "text": "It's the phrase where you have to figure out what are your hardest problems and then break those down to solve."}, {"time": 3893, "text": "So the star shade, one of the really hard problems was how to formation fly at tens of thousands of kilometers."}, {"time": 3899, "text": "It's like, wow, that is insane."}, {"time": 3902, "text": "And the team broke that down actually into a sensing problem because of the star shade."}, {"time": 3906, "text": "How do you see the star shade precisely enough to control it?"}, {"time": 3910, "text": "Because if you're shining a flashlight, you know the beam spreads out."}, {"time": 3913, "text": "So the star shade has a beacon, an LED or a laser, it's going to spread out so much by the time it gets to the telescope."}, {"time": 3919, "text": "The problem wasn't how do you tell the star shade how to move around fast enough to stay in a straight line."}, {"time": 3924, "text": "The problem was how are you able to sense it well enough?"}, {"time": 3927, "text": "So problems like that were broken down and money that came from NASA to solve problems is put towards solving it."}, {"time": 3934, "text": "So we've got through most of the hard problems right now."}, {"time": 3937, "text": "Another one was that star shade, even though it's looking at a star, light from our own sun could hit the edges of the star shade and bounce off into the telescope, believe it or not."}, {"time": 3948, "text": "And that would actually ruin it because we're trying to see this tiny, tiny signal."}, {"time": 3952, "text": "So then the question is how do you make a razor thin edge?"}, {"time": 3955, "text": "Those pedal edges would have to be like a razor."}, {"time": 3958, "text": "What materials can you use?"}, {"time": 3959, "text": "So there's a series of problems like that."}, {"time": 3962, "text": "So there's a materials problem in there?"}, {"time": 3963, "text": "Some of them."}, {"time": 3966, "text": "And there's one."}, {"time": 3967, "text": "So we almost finished solving all those problems and then it's just a matter of building one and testing it in a full scale size facility and then building the telescope."}, {"time": 3978, "text": "It's just a matter of time to build everything and get it, get it up for launch."}, {"time": 3982, "text": "So this is an engineering close engineering project."}, {"time": 3986, "text": "It's a real engineering project."}, {"time": 3988, "text": "I actually can tell you about two other projects that are not mine."}, {"time": 3992, "text": "I like to call, call star shade mine because it was my project that I helped make it mainstream without line is constantly shifting."}, {"time": 4000, "text": "When I started, when I got this leadership role on star shade, I remember telling people about it and it was definitely not on the mainstream okay line."}, {"time": 4007, "text": "It was on the giggle factor side of the line and people would just laugh like that's dead."}, {"time": 4012, "text": "Like you can never formation fly or they'd say, why are you working on that?"}, {"time": 4015, "text": "That's just so not, it's not so awesome."}, {"time": 4018, "text": "There's a, there's a few things you've done in your life and that's when I first saw star shade, I was like, what, really?"}, {"time": 4024, "text": "And then like it sinks in."}, {"time": 4027, "text": "I mean, it's the same thing I felt with like Elon Musk or certain people who do crazy stuff and like, and then, and they get, they actually make it work."}, {"time": 4035, "text": "I mean, if you get star shade information flying to like together, I mean, how awesome is that if you actually make that happen, even like from a robot, I'm sorry, from the robotics perspective, even if it doesn't give us good data, that's just like a cool thing to get out there."}, {"time": 4053, "text": "I mean, it's really exciting."}, {"time": 4054, "text": "Really cool."}, {"time": 4055, "text": "So there's two other topics that aren't mine, but I still love them."}, {"time": 4059, "text": "One of them, let's just talk about it briefly because it's not a probe, but it's the idea to send a telescope very far away to 500 times the earth sun distance."}, {"time": 4067, "text": "And this is way farther than the Voyager spacecrafts are right now."}, {"time": 4071, "text": "And to use our sun as a gravitational lens, to use our sun to magnify something that's behind it."}, {"time": 4079, "text": "It's got to sink in for a minute."}, {"time": 4081, "text": "But I mean, I don't know what the physics of that is, like how to use the sun."}, {"time": 4085, "text": "In astronomy, and Einstein thought about this initially, we can use a massive objects, bend space."}, {"time": 4092, "text": "And so light that should be traveling like straight, it actually travels around the warped space."}, {"time": 4098, "text": "And somehow you figure out a way to use that for magnification."}, {"time": 4103, "text": "You have a way to use that for magnification."}, {"time": 4106, "text": "There are galaxies that are lensed, so called gravitational lens by intervening galaxy clusters actually."}, {"time": 4114, "text": "And there are microlensing events where stars get magnified as an unseen gravitational lens star passes in between us and that very distant star."}, {"time": 4123, "text": "It's actually a real tool in astronomy."}, {"time": 4125, "text": "Yeah, using gravitational lensing to magnify because it bends more rays towards you than normally you'd normally see."}, {"time": 4132, "text": "And again, we're trying to get more higher resolution images that are basically boiled down to light."}, {"time": 4139, "text": "Well, it boils down to light."}, {"time": 4141, "text": "And then you can maybe get more information about."}, {"time": 4144, "text": "Well, in this case, you would ask me, let's say, if this thing could get built, it would take like something like they like to say 25 years to get from here to there, 25 years and then it could send some information back to us."}, {"time": 4158, "text": "And then you'd say, so Sarah, how many pixels?"}, {"time": 4160, "text": "And I wouldn't say one or less than one."}, {"time": 4161, "text": "I'd say, you know, it could be like 10 by 10 pixels, it could be 100 pixels, which would be awesome."}, {"time": 4167, "text": "I mean, that's still crazy that we can get a lot of information from that."}, {"time": 4170, "text": "Crazy, right."}, {"time": 4171, "text": "And it's crazy for a lot of other reasons, because again, you have to line up the sun and your target."}, {"time": 4175, "text": "You'd only have one telescope per target, because every star is behind the sun in a different way."}, {"time": 4182, "text": "So it's a lot of complicated things."}, {"time": 4183, "text": "What about the second?"}, {"time": 4184, "text": "The second one, it's called star shot."}, {"time": 4188, "text": "You know, star shot means like big dreams and it's an initiative by the Breakthrough Foundation."}, {"time": 4195, "text": "And star shot is the concept to send thousands of little tiny spacecraft, which they now call star chip."}, {"time": 4203, "text": "So instead of star ship, it's star chip."}, {"time": 4206, "text": "And there's a little chip and the star chip, so like sending like thousands of little turtles being born, they're not all going to make it."}, {"time": 4215, "text": "The idea is to send lots of them, and each of these star chips, once they're launched into, I guess, low Earth orbit, they will deploy a solar sail that's a few meters in diameter."}, {"time": 4227, "text": "And the idea is that on Earth, we would have a bank of, this one is still a bit on the other side of the line, but we'd have a bank of telescopes with lasers that would be like a gigawatt power and these lasers would momentarily shine upwards and accelerate, they'd hit these sails."}, {"time": 4249, "text": "They'd be like a power source for the sail and would accelerate the sails to travel at about a 20th the speed of light."}, {"time": 4257, "text": "Is that as crazy as it sounds?"}, {"time": 4259, "text": "Well, like any good engineering project, it has to be broken down into the crazy parts."}, {"time": 4265, "text": "And the Breakthrough Initiative, like to their huge credit, is sponsoring, you know, getting over these, actually, they've listed initially, they listed 19 challenges, so it's broken down to concrete things."}, {"time": 4277, "text": "Like one of them is, well, you have to buy the land and make sure the airspace is okay with you sending up that much power overhead."}, {"time": 4284, "text": "Another one is you have to have material on the sail where the lasers won't just vaporize it."}, {"time": 4290, "text": "So there's a lot of issues, but anyway, these sails would be accelerated to 20th the speed of light and their journey to the nearest star would no longer be tens of thousands of years, but could be 20 years, okay, 20, so it's not as bad as tens of thousands."}, {"time": 4305, "text": "And these thousands or whatever, however many make it, they'll go by the nearest star system and snap some images and radio the information back to Earth because they're traveling so fast they can't slow down, but they'll zoom by, take some photos, send it back."}, {"time": 4321, "text": "Hi, Rez."}, {"time": 4322, "text": "See, just what I want you to pause on for a second is that just by making that a real concept and the money given won't make it happen, but what it's done is it's planted the seed and it's shifted that line from what is crazy to what is a real project."}, {"time": 4335, "text": "It's shifted it just ever so slightly enough, I think, to plant the seed that we have to find a way to somehow find a way to get there."}, {"time": 4343, "text": "That is, again, to stay on that, that is so powerful."}, {"time": 4346, "text": "Make a big, crazy idea and break it down into smaller, crazy ideas, order it in a list, and knock it out one at a time."}, {"time": 4358, "text": "I don't know, I've never heard anything more inspiring from an engineering perspective because that's how you solve the impossible things."}, {"time": 4366, "text": "So you open your new book discussing Rogue Planet, PSO, J318, I never said this out loud, PSO 1.522, so a Rogue Planet, which is just this poetic, beautiful vision of a planet that, as you write, lurches across the galaxy like a rudderless ship wrapped in perpetual darkness, its surface swept by constant storms, its black skies raining molten iron."}, {"time": 4398, "text": "Just like the vision of that, the scary, the darkness, just how not pleasant it is for human life, just the intensity of that metaphor, I don't know."}, {"time": 4412, "text": "And the reason you use that is to paint in a feeling of loneliness, I think, and despair."}, {"time": 4423, "text": "And why, maybe on the planet side, why does it feel, maybe it's just me, why does it feel so profoundly lonely on that kind of planet?"}, {"time": 4437, "text": "Like what..."}, {"time": 4439, "text": "I think it's because we all want to be a part of something, a part of a family, or a part of a community, or a part of something."}, {"time": 4450, "text": "And so, our solar system, and by the way, I only, it's sort of like when you treat yourself to like eating an entire tub of ice cream, like I sometimes treat myself to imagine things like this and not just be so cut and dried."}, {"time": 4465, "text": "But when you imagine that, this planet's not part, because I don't want to give emotions to a planet per se, but the planet's not part of anything."}, {"time": 4471, "text": "It's somehow, it's just all on its own, just kind of out there without that warm energy from its sun, it's just all alone out there."}, {"time": 4480, "text": "To me, it was this little discovery that I actually feel pretty good being part of this solar system."}, {"time": 4487, "text": "It felt like we have a sun, we have like a little family, and it felt like it sucked for the rogue planet to just floating about, not floating, flying rudderless."}, {"time": 4499, "text": "By the way, how many rogue planets are there in your sense?"}, {"time": 4504, "text": "We don't know totally."}, {"time": 4505, "text": "I mean, there's some rogue planets that are just born on their own."}, {"time": 4508, "text": "I know that sounds really weird to be, how can you be born an orphan?"}, {"time": 4511, "text": "But they just are, because most planets are born out of a disc of gas and dust around a star."}, {"time": 4518, "text": "But some of these small planets are like totally failed stars."}, {"time": 4521, "text": "They're so failed, they're just small planets on their own."}, {"time": 4524, "text": "But we think that there's probably, honestly, there's another path to a rogue planet."}, {"time": 4529, "text": "That's one that's been kicked out of its star system by other planets, like a game of billiard balls."}, {"time": 4534, "text": "It just gets kicked out."}, {"time": 4535, "text": "We actually think there's probably as many rogue planets as stars."}, {"time": 4539, "text": "No flying out there, fundamentally alone."}, {"time": 4544, "text": "So the book is a memoir, is about your life, and it weaves both your fascination with planets outside the solar system and the path of your life, and you lost your husband, which is a kind of central part of the book that created a feeling of the rogue planet."}, {"time": 4575, "text": "By the way, what's the name of the book?"}, {"time": 4577, "text": "The name of the book is The Smallest Lights in the Universe."}, {"time": 4581, "text": "What's up with the title?"}, {"time": 4582, "text": "What's the meaning?"}, {"time": 4583, "text": "The title has a double meaning."}, {"time": 4585, "text": "On the face of it, it's the search for other Earths."}, {"time": 4587, "text": "Earths are so dim compared to the big, bright, massive star beside them."}, {"time": 4592, "text": "Searching for the Earths is like searching for the smallest lights in the universe."}, {"time": 4598, "text": "It has this other meaning, too."}, {"time": 4602, "text": "I really hope that you or the other people listening never get to the place where you've fallen off the cliff into this horrible place of huge despair."}, {"time": 4616, "text": "And once in a while, you get a glimmer of a better life, of some kind of hope."}, {"time": 4621, "text": "And those are also the smallest lights in the universe."}, {"time": 4623, "text": "Well, maybe we can tell the full story before we talk about the glimmer of hope."}, {"time": 4631, "text": "What did it feel like to first find out that your husband, Mike, was sick?"}, {"time": 4637, "text": "It was incredibly frustrating."}, {"time": 4639, "text": "Like, lots of us have had some kind of problem that the doctors completely ignore."}, {"time": 4645, "text": "Just that they kept blowing him off."}, {"time": 4648, "text": "Are they paid to just say it's nothing?"}, {"time": 4650, "text": "I mean, it's just insane."}, {"time": 4652, "text": "I was just so angry."}, {"time": 4654, "text": "And we finally got to a point where he was really sick."}, {"time": 4657, "text": "He was like in bed, not able to move, basically."}, {"time": 4661, "text": "And it turned out all the things they ignored and not done any tests, he had like a 100% blockage in his intestine."}, {"time": 4668, "text": "Like 100%."}, {"time": 4669, "text": "Like nothing could get out, nothing could get in."}, {"time": 4673, "text": "And it was pretty, pretty shocking to even hear then that it could be nothing."}, {"time": 4678, "text": "What was the progression of it in the context of the maybe the medical system, the doctors?"}, {"time": 4683, "text": "I mean, what did it feel like?"}, {"time": 4685, "text": "Did you feel like a human being?"}, {"time": 4688, "text": "I felt like a child."}, {"time": 4691, "text": "Like the doctors were trying to water down the real diagnosis or treat us like we couldn't know the truth or they didn't know."}, {"time": 4701, "text": "You know, I felt mixed like, it's not a good situation if you think the doctor either has no idea what he or she is doing, or if the doctors purposely, let's just say lying to you to sugarcoat it."}, {"time": 4710, "text": "Like, I didn't know which one of it was, but I knew it was one of those."}, {"time": 4714, "text": "What were the things he was suffering from?"}, {"time": 4717, "text": "Well, initially, he just had a random stomach ache."}, {"time": 4719, "text": "I hate to say that out loud because I know a lot of people will have a random stomach ache."}, {"time": 4724, "text": "But so he just had a bad stomach ache and then, hmm, this is weird."}, {"time": 4727, "text": "A few days later, another bad stomach ache, kind of gets worse."}, {"time": 4730, "text": "Might go away for a few weeks, might come back."}, {"time": 4732, "text": "And at the time, all I knew was my dad had had that same thing."}, {"time": 4736, "text": "Not the same identical system, but he had these really weird pains and he ended up having the worst diagnosis."}, {"time": 4743, "text": "One of the worst diagnoses you can get from a random stomach ache is pancreatic cancer because the time, the pancreas, like you can't feel anything, so by the time you feel pain, it's too late."}, {"time": 4753, "text": "It's spread already."}, {"time": 4754, "text": "So I was just like, beside myself, I'm like, this is like, wow, this guy, he's got a random stomach ache."}, {"time": 4760, "text": "All I know is another man I loved had a random stomach ache and it didn't end well."}, {"time": 4764, "text": "How did you deal with it emotionally, psychologically, intellectually, as a scientist?"}, {"time": 4770, "text": "What was that like, that whole, because it's not immediate."}, {"time": 4774, "text": "It's a long journey."}, {"time": 4775, "text": "It's a long journey and you don't know where the diagnosis is going."}, {"time": 4778, "text": "So anyone who's suffered from a major illness, there's like always branches in the road."}, {"time": 4784, "text": "So he had this intestinal blockage."}, {"time": 4787, "text": "I can't imagine someone in their 40s having that and that be normal."}, {"time": 4790, "text": "But the doctor is like, it could be nothing, could just cut it out."}, {"time": 4794, "text": "You don't need most of your intestine, it's a repeating pattern."}, {"time": 4796, "text": "Just cut that out, it could be fine."}, {"time": 4797, "text": "But it ended up not being fine and he was diagnosed as being terminally ill. Well, it really changed my life in a huge way."}, {"time": 4804, "text": "First of all, I remember immediately one summer, the summer when this happened, I started asking everyone I knew."}, {"time": 4810, "text": "I would ask you, I don't know if it's smart of my job to put you on the spot, I'd say, you have one year to live or two or three, what will you do differently about your life now?"}, {"time": 4820, "text": "Lex, you have one year to live, what would you do?"}, {"time": 4826, "text": "I mean, it's hard."}, {"time": 4827, "text": "I don't know if you want to answer that."}, {"time": 4829, "text": "I think about it a lot."}, {"time": 4830, "text": "I mean, that's a really good thing to meditate on."}, {"time": 4833, "text": "We can talk about maybe why you bring that up, if it is or not a heavy question."}, {"time": 4841, "text": "But I get, I think about mortality a lot and for me, it feels like a really good way to focus in on is what you're doing today, the people you have around you, the family you have, does it bring you joy?"}, {"time": 4864, "text": "Does it bring you fulfillment?"}, {"time": 4867, "text": "And basically, for me, long ago, try to be ready to die any day."}, {"time": 4879, "text": "So like today, I kind of woke up, look, if I was nervous about talking to you, I really admire your work and the book is very good and it's super exciting topic."}, {"time": 4893, "text": "But then, you know, there's this also feeling like, if this is the last conversation I have in my life, you know, if I die today, will this be, will this be the right, like am I glad today happened and it is, and I am glad today happened."}, {"time": 4908, "text": "So that's the way."}, {"time": 4909, "text": "And that's so unique."}, {"time": 4910, "text": "I never got that answer from a single person."}, {"time": 4914, "text": "The busyness of life, there's goals, there's dreams, there's like planning, plans."}, {"time": 4920, "text": "Very few people make it happen."}, {"time": 4922, "text": "That's what I learned."}, {"time": 4924, "text": "And so a lot of these people."}, {"time": 4925, "text": "Oh, like you run out of time."}, {"time": 4927, "text": "It's not so much you run out of time, but I'd come back later and be like, okay, why don't you do that?"}, {"time": 4930, "text": "And if that's what you would do, if you're going to die a year from now, why don't you, why don't you make it real?"}, {"time": 4936, "text": "Simple things."}, {"time": 4937, "text": "Spend more time with family."}, {"time": 4939, "text": "Like why, why don't you do that?"}, {"time": 4940, "text": "And that's what I had an answer, it turns out, unless you usually, unless you have, you really do have a pressing end of life, people don't do their bucket lists or try to change their career."}, {"time": 4950, "text": "And some people can't."}, {"time": 4951, "text": "So we can't, like for a lot of people, they can't do anything about it."}, {"time": 4953, "text": "And that's, that's fine."}, {"time": 4954, "text": "But the ones who can take action for some reason, never do."}, {"time": 4958, "text": "And that was one of the ways that Mike's death or at the time his impending death really, really affected me."}, {"time": 4965, "text": "Cause you know, for these sick people, what I learned, he had a bucket list and he was able to do some of the bucket lists."}, {"time": 4970, "text": "It was awesome."}, {"time": 4971, "text": "But he got sick pretty quickly."}, {"time": 4974, "text": "So if you do only have a year to live, it's ironic cause you can't do, you can't do the things you wanted to do because you get too sick too fast."}, {"time": 4981, "text": "What were the bucket list things for you that you realized like, what am I doing with my life?"}, {"time": 4986, "text": "That was the major concept of him."}, {"time": 4988, "text": "After he died, I didn't know."}, {"time": 4989, "text": "Like I, I was just lost because when something that profound happens, all the things I was doing, most of the things I was doing were just meaningless."}, {"time": 5000, "text": "It was so tough to, to find an answer for that."}, {"time": 5003, "text": "And that's when I settled on, I'm going to devote the rest of my life to trying to find another earth and to find out, to find that we're not alone."}, {"time": 5017, "text": "What is that longing for connection with others?"}, {"time": 5022, "text": "What's that about?"}, {"time": 5024, "text": "Why is that so full of meaning?"}, {"time": 5026, "text": "I mean, I think it's how we're hardwired."}, {"time": 5028, "text": "Like one of my friends some time ago, actually when my dad died, he never heard someone say this before, but he's like, Sarah, you know, why are we evolved to take death so harshly?"}, {"time": 5041, "text": "Like what kind of society would we be if we just didn't care people died?"}, {"time": 5045, "text": "That would be a very different type of world."}, {"time": 5047, "text": "How would we as a species have got to where we are?"}, {"time": 5051, "text": "So I think that is tied hand in hand with why do we, why do we seek connection?"}, {"time": 5056, "text": "It's just that what we were talking about before, that subconsciousness that we don't understand."}, {"time": 5062, "text": "A couple, you know, the other side, the flip side of the coin of connection and love is a fear of loss."}, {"time": 5071, "text": "It's like that was, again, I don't know, that's what makes you appreciate the moment is that the thing ends."}, {"time": 5078, "text": "It's definitely a hard one."}, {"time": 5080, "text": "The thing ends, but, and it's hard to not, you wouldn't want to limit."}, {"time": 5085, "text": "Like it's like my dog who I love so much, I'll start to cry."}, {"time": 5089, "text": "Like I can't think about the end."}, {"time": 5090, "text": "I know he'll age much faster than I will."}, {"time": 5092, "text": "And someday it will end."}, {"time": 5094, "text": "But it's too sad to think of, but should I not have got a dog?"}, {"time": 5098, "text": "Should I have not brought this sort of joy into my life because I know it won't be forever."}, {"time": 5102, "text": "It's well, there's a, there's a philosopher and his Becker who wrote a book, Denial of Death and just, and warm with the cores."}, {"time": 5111, "text": "And there's another book talks about terror management theory, Sheldon Solomon."}, {"time": 5116, "text": "I just talked to him a few weeks ago."}, {"time": 5118, "text": "It's a brilliant philosopher, psychologist that their theory, whatever you make of it is that the fear of death is at the core of everything, everything we do."}, {"time": 5132, "text": "So like you're that you think you don't think about the mortality of your dog, but you do."}, {"time": 5140, "text": "And that's what makes the experience rich."}, {"time": 5142, "text": "Like there's this kind of like in the shadows lurks the, the knowledge that this won't last forever."}, {"time": 5151, "text": "And that makes every moment just special in some kind of a weird way that the moments are special for us humans."}, {"time": 5161, "text": "I mean, sorry to use romantic terms like love, but what do you make, what did you learn about love from, from losing it, from losing your husband?"}, {"time": 5178, "text": "Well I learned to love the things I have more."}, {"time": 5181, "text": "I learned to love the people that I have more and to not let the little things bother me as much."}, {"time": 5190, "text": "What about the rediscovery or like the discovery of the little lights in the darkness?"}, {"time": 5201, "text": "So you, the book, I think you've brilliantly described the dark parts of your journey."}, {"time": 5212, "text": "But maybe can you talk about how you were able to rediscover the lights?"}, {"time": 5220, "text": "They came in many ways."}, {"time": 5222, "text": "And the way like to think about it is like grief is an ocean, you know, with tiny islands of the little, like, like the little lights."}, {"time": 5230, "text": "And eventually that ocean gets smaller and smaller and the islands like become continents with lakes."}, {"time": 5237, "text": "So initially it'd be like the children laughing one day or my colleagues at work who rallied around me and would take me away from my darkness to work on a project."}, {"time": 5248, "text": "Later on it turned out to be a group of women my age, all widows, all with children in my town."}, {"time": 5255, "text": "And it would be, even though it was a bit morose getting together, still very joyful at the same time."}, {"time": 5262, "text": "What was the journey of rediscovering love like for you?"}, {"time": 5267, "text": "So refinding, I mean, is there some, by way of advice or insight about how to, how to rediscover the beauty of life?"}, {"time": 5281, "text": "It's a hard one."}, {"time": 5282, "text": "I think you just have to stay open to being positive and just to get out there."}, {"time": 5289, "text": "Do you still think, do you still think about your own mortality?"}, {"time": 5293, "text": "So you mentioned that that was a thing that you meditate on as a question when it was right there in front of you."}, {"time": 5302, "text": "But do you still think about it?"}, {"time": 5303, "text": "I think I will after talking to you."}, {"time": 5306, "text": "But no, it's not really something I think about."}, {"time": 5308, "text": "I mean, I do think about the search for another earth and will, will I get there?"}, {"time": 5313, "text": "Will I be able to conclude my search and is there one?"}, {"time": 5318, "text": "Like as time goes by, you know, that window to solve that problem gets smaller."}, {"time": 5325, "text": "What would bring you, again, I apologize if this makes concrete the fact that life is finite, but what, what would bring you joy if we discovered while you're still here?"}, {"time": 5338, "text": "What would bring me joy?"}, {"time": 5339, "text": "Finding another earth, an earth like planet around a sun like star, knowing that there's at least one or more out there, being able to see water, that it has signs of water and being able to see some gases that don't belong."}, {"time": 5352, "text": "So I know that the search will continue after I'm gone enough to fuel the next generation."}, {"time": 5358, "text": "So just like opening the door and there's like this glimmer of hope."}, {"time": 5364, "text": "What do you think it will take to realize that?"}, {"time": 5365, "text": "I mean, we've talked about all these interesting projects, star shade, especially, but is there something that you're particularly kind of hopeful about in the next 10, 20 years that might give us that, that exact glimmer of hope that there's earth like planets out there?"}, {"time": 5383, "text": "I have to, I stand behind star shade in all cases, so, but there is this other kind of field that I, that everyone is involved in because star shade is hard."}, {"time": 5393, "text": "Earths are hard, but there are, there's another category of planet star type that's easier."}, {"time": 5398, "text": "And these are planets orbiting small red dwarf stars."}, {"time": 5402, "text": "They're not earth like at all."}, {"time": 5404, "text": "Think like earth cousin instead of earth twin, but there's a chance that we might establish that some of those have water and signs of life on them."}, {"time": 5411, "text": "It's nearer term than star shade and we're all working hard on that too."}, {"time": 5415, "text": "Let me ask by way of recommendations, I think a lot of people are curious about this kind of stuff."}, {"time": 5421, "text": "What three books, technical or fiction or philosophical or anything really had an impact on your life and, and or you would recommend besides of course your book."}, {"time": 5435, "text": "There's one book I wish everyone could read."}, {"time": 5438, "text": "I'm not sure if you've read it."}, {"time": 5439, "text": "It's actually a children's book, like a young adult book."}, {"time": 5442, "text": "It's called the giver."}, {"time": 5444, "text": "And it is the book that kids in school read now."}, {"time": 5448, "text": "And I only, sorry, that's not, that's wow."}, {"time": 5452, "text": "Sorry, that, that caught me off guard."}, {"time": 5457, "text": "So when I first came to this country, I didn't speak much."}, {"time": 5459, "text": "It's really what made me, it had a profound impact on my life and a really important moment because they give it to kids."}, {"time": 5467, "text": "Like I think middle school, I think, or maybe elementary, something like that."}, {"time": 5470, "text": "I'm so surprised you've even heard of this book."}, {"time": 5473, "text": "So they give it, but like it's the value of giving the right book to a person at the right time."}, {"time": 5479, "text": "I was, I was, cause it's very accessible."}, {"time": 5482, "text": "Do we want to share what the story is without spoiling it?"}, {"time": 5485, "text": "Oh yeah, you can without spoiling, right?"}, {"time": 5488, "text": "It follows this boy in this very utopic society."}, {"time": 5492, "text": "That's like perfect."}, {"time": 5493, "text": "It's been all clean cut and made perfect actually."}, {"time": 5495, "text": "And as he kind of comes of age, he starts realizing something's wrong with his world."}, {"time": 5501, "text": "And so it's part of that question."}, {"time": 5502, "text": "Are we going to evolve as, I mean, this isn't what's there, but it made me wonder, you know, are we evolving to a better place?"}, {"time": 5507, "text": "Is there a day when we can eliminate, you know, poverty and hunger and crime and sickness in this book, they pretty much have in a society that the boys in and sort of follows him."}, {"time": 5518, "text": "And he becomes a chosen one to be like a receiver."}, {"time": 5521, "text": "The givers, the old wise man who retains some of the harshness of the outside world so that he can advise the people as a sort of boy comes of age and is chosen for the special role."}, {"time": 5532, "text": "He finds the world isn't what he expects."}, {"time": 5533, "text": "And I don't know about you, but it was so profound for me because it jolts you out of reality."}, {"time": 5538, "text": "It's like, Oh my God, what am I doing here?"}, {"time": 5539, "text": "I'm just going with the flow with my society."}, {"time": 5542, "text": "How do I think outside the box and the confines of my society, which surely carries negative things with it that we don't realize today."}, {"time": 5548, "text": "Yeah, and also in the flip side of that is if you do take a step outside the box on occasion, what's the psychological burden of that?"}, {"time": 5559, "text": "Like is that, is that a step you want to take?"}, {"time": 5562, "text": "Is that the journey you want to take?"}, {"time": 5564, "text": "What is that life like?"}, {"time": 5566, "text": "I felt like from the book, you have to take it."}, {"time": 5568, "text": "I found from the book, I never thought like now that you're saying it, I see what you're saying."}, {"time": 5573, "text": "The burden is huge, but I always felt like the answer is yes, you absolutely want to know what's outside."}, {"time": 5577, "text": "But you can't do that if you're very, it's hard to be objective about your own reality."}, {"time": 5582, "text": "I mean, it's a very human instinct, but, uh, it also, the book kind of shows that, uh, it has an effect on you and this, it's a really interesting question about our society and taking a step out."}, {"time": 5596, "text": "It's by, uh, Lois Lowry, I think is how you pronounce it."}, {"time": 5600, "text": "I really do hope everyone created it and it is a young adult book, but it's still, it's incredibly, I'm really glad I only read it cause my kids got it for school."}, {"time": 5607, "text": "I just thought, okay, well, why don't I just see what this is about?"}, {"time": 5609, "text": "And I just, wow."}, {"time": 5613, "text": "I think it's also the value of education."}, {"time": 5615, "text": "I think I'm surprised you mentioned, I've never really mentioned to anybody."}, {"time": 5618, "text": "I'm sure a lot of people had the similar experience like me and maybe it's a generational thing though, because like the book came out, I think in the nineties."}, {"time": 5626, "text": "So if you're older than like me, that book didn't exist when we were in middle school."}, {"time": 5630, "text": "So I just do think a lot of people won't have heard of it, but it's an interesting question of like those books."}, {"time": 5638, "text": "I mean, I'm reminded often, I suppose the same is true with other subjects, but books are special at the early age, like middle school, maybe early high school, those can change like the direction of your life."}, {"time": 5651, "text": "And also certainly teachers, they can change completely the direction of your life."}, {"time": 5657, "text": "There's so many stories about teachers of mathematics, teachers of physics, of any kind of subjects basically changing the direction of a human's life."}, {"time": 5667, "text": "That's like not to get on the whole, almost like a political thing, but you know, we, we undervalue teachers."}, {"time": 5678, "text": "It's a special, it's a special position that they hold."}, {"time": 5682, "text": "That's so true."}, {"time": 5684, "text": "Well, I do have two other books or two other things."}, {"time": 5686, "text": "One is something I came across just a few days ago, actually."}, {"time": 5690, "text": "It's actually a film called Picture a Scientist."}, {"time": 5694, "text": "And when you picture a scientist, you probably don't picture the women and women of color in this film."}, {"time": 5701, "text": "And it is a way to get outside your box."}, {"time": 5703, "text": "I really think everyone interested in science, even just peripherally should watch this because it is shocking and sobering at the same time."}, {"time": 5712, "text": "And it talks about how, well, I think one of the messages across is, you know, we really are like, I don't know if we're hardwired to just like people like ourselves, but we're excluding a lot of people and therefore a lot of great ideas by not being able to think outside of how we're all stereotyping each other."}, {"time": 5730, "text": "So it's, it's, it's hard to kind of convey that and you can just say, oh yeah, I want to be more diverse."}, {"time": 5735, "text": "I want to be more open, but it's a nearly impossible problem to solve and the movie really helps open people's eyes to it."}, {"time": 5742, "text": "This book I put third because unlike The Giver, people may not want to read it."}, {"time": 5746, "text": "It's not as relevant."}, {"time": 5747, "text": "But when I was in my early twenties, I went to this big, this like 800 people large conference run by the Wilderness Canoe Association in my hometown of Toronto."}, {"time": 5760, "text": "And there was a family friend there who I met and he said, read this book, it'll change your life."}, {"time": 5766, "text": "And it actually changed my life."}, {"time": 5768, "text": "And it was a book called Sleeping Island by an author, PG Downs, who just coincidentally lived in this area, lived in the Boston area and he was a teacher, I think at a private school and every summer he would go to Canada with a canoe often by himself."}, {"time": 5783, "text": "And he wrote this book maybe in the forties or fifties about a trip he took in the late 1930s."}, {"time": 5788, "text": "And it was, I was just shocked that even at that time, although that was a long time ago, there were large parts of Canada that were untouched by white people."}, {"time": 5797, "text": "And he went up there and interacted like with the natives."}, {"time": 5800, "text": "He called the book and had a subtitle that was called, there's something like Journey in the Barren Lands."}, {"time": 5807, "text": "And when you go up North in Canada, you pass the tree line, just like on a mountain, if you hike up a mountain, you get so far North there aren't any trees."}, {"time": 5813, "text": "And he wrote eloquently about the land and about being out there."}, {"time": 5816, "text": "There weren't even any maps of the region, like in that time."}, {"time": 5820, "text": "And I just thought to myself, wow, like that you could just take the summer off and explore by canoe and go and see what's out there."}, {"time": 5827, "text": "And it led to me just doing that, that very thing."}, {"time": 5830, "text": "Of course it's different now, but going out to where the road ends and putting the canoe in the water and just, well, we had to have a plan."}, {"time": 5836, "text": "We didn't just explore, but go down this river, rivers with rapids and travel over lakes and portages and just really live."}, {"time": 5845, "text": "So just really explore, screw it."}]}]