[{"title": "Christopher Capozzola: World War I, Ideology, Propaganda, and Politics | Lex Fridman Podcast #320", "id": "SK4kMPmgKW0", "quotes": [{"time": 350, "text": "So the leader of the Austro Hungarian Empire, Franz Joseph I, his nephews, Archduke Franz Ferdinand, he was assassinated."}, {"time": 358, "text": "And so that didn't have to lead to a war."}, {"time": 358, "text": "And then the leader of the German Empire, Kaiser Wilhelm II, pressured, sort of started talking trash and boiling the water that ultimately resulted in the explosion, plus all the other players."}, {"time": 390, "text": "So what can you describe the dynamics of how that unrolled?"}, {"time": 390, "text": "Well, US, what's the role of US?"}, {"time": 390, "text": "What's the role of France?"}, {"time": 396, "text": "What's the role of Great Britain, Germany, and Austro Hungarian Empire?"}, {"time": 431, "text": "And so it escalates."}, {"time": 431, "text": "And once that escalation is combined with the call up of military troops, then none of those powers wants to be sort of the last one to kind of get ready for conflict."}, {"time": 444, "text": "So even throughout it, they think they are getting ready in a defensive maneuver."}, {"time": 450, "text": "And if they think if there is conflict, well, it might be a skirmish, it might be, you know, sort of a standoff."}, {"time": 458, "text": "It could be solved with diplomacy later, because diplomacy is failing now."}, {"time": 463, "text": "That turns out not to be the case."}, {"time": 463, "text": "Diplomacy fails, it's not a skirmish, it becomes a massive war."}, {"time": 471, "text": "And the Americans are watching all of this from the sidelines."}, {"time": 475, "text": "They have very little influence over what happens that summer."}, {"time": 479, "text": "How does it go from a skirmish between a few nations to a global war?"}, {"time": 479, "text": "Is there a place where there's a phase transition?"}, {"time": 486, "text": "Yeah, I think the phase transition is in over the course of the fall of 1914."}, {"time": 492, "text": "When the Germans make an initial sort of bold move into France, in many ways, they're fighting the last war, the Franco Prussian War of 1870."}, {"time": 500, "text": "And they really do sort of, you know, kind of want to have a quick sort of lightning strike in some ways against France to kind of bring the war to a speedy conclusion."}, {"time": 515, "text": "France turns out to be able to fight back more effectively than the Germans expected."}, {"time": 522, "text": "And then the battle lines sort of harden."}, {"time": 522, "text": "And then behind that, the French and the Germans, as well as the British on the side of the French, start digging in, literally, and digging trenches."}, {"time": 540, "text": "Trenches that at first are three feet deep to avoid shelling from artillery, then become six feet, 10 feet deep, two miles wide, that include telegraph wires, that include whole hospitals in the back."}, {"time": 554, "text": "And then at that point, the front is locked in place."}, {"time": 554, "text": "And the only way to break that is sort of basically dialing the war up to 11, right?"}, {"time": 561, "text": "Sort of massive numbers of troops, massive efforts, none of which work, right?"}, {"time": 567, "text": "And so the war is stuck in this."}, {"time": 567, "text": "But that's the phase transition right there."}, {"time": 574, "text": "What were the machines of war in that case?"}, {"time": 574, "text": "You mentioned trenches."}, {"time": 574, "text": "What were the guns used?"}, {"time": 582, "text": "What was the size of guns?"}, {"time": 582, "text": "What did Germany start accumulating that led up to this war?"}, {"time": 590, "text": "One of the things that we see immediately is the industrial revolution of the previous 30 or 40 years brought to bear on warfare, right?"}, {"time": 597, "text": "And so you see sort of machine guns."}, {"time": 605, "text": "You see artillery."}, {"time": 605, "text": "These are the key weapons of war on both sides, right?"}, {"time": 605, "text": "The vast majority of battlefield casualties are from artillery shelling from one side to another, not sort of rifle or even sort of machine gun kind of attacks."}, {"time": 621, "text": "In some ways, the weapons of war are human beings, right?"}, {"time": 629, "text": "Tens of thousands of them horde over the top in these sort of waves to kind of try to break through the enemy lines."}, {"time": 636, "text": "And it would work for a little while."}, {"time": 636, "text": "But holding the territory that had been gained often proved to be even more demanding than gaining it."}, {"time": 642, "text": "And so often, each side would retreat back into the trenches and wait for another day."}, {"time": 650, "text": "And how did Russia, how did Britain, how did France get pulled into the war?"}, {"time": 658, "text": "I suppose the France one is the easy one."}, {"time": 658, "text": "But what is the order of events here?"}, {"time": 665, "text": "How it becomes a global war?"}, {"time": 665, "text": "So Britain, France, and Russia are at this time and they're an alliance."}, {"time": 672, "text": "And so the conflicts in the summer of 1914 that lead sort of to the declarations of war happened sort of one after another in late August of 1914."}, {"time": 680, "text": "And all three powers essentially come in at the same time because they have promised to do so through a series of alliances conducted secretly in the years before 1914 that committed them to defend one another."}, {"time": 702, "text": "Germany, Austria, Hungary, and the Ottoman Empire have their own sort of set of secret agreements that also commit them to defend one another."}, {"time": 708, "text": "And what this does is it sort of brings them all into conflict at the exact same moment."}, {"time": 714, "text": "They're also, for many of these countries, bringing not just their national armies, but also their empires into the conflict."}, {"time": 720, "text": "So Britain and France, of course, have enormous sort of global empires."}, {"time": 726, "text": "They begin mobilizing soldiers as well as raw materials."}, {"time": 733, "text": "Germany has less of an overseas empire."}, {"time": 733, "text": "Russia and the Ottoman Empire, of course, have their own sort of hinterland within the empire."}, {"time": 739, "text": "And very soon, all of the warring powers are bringing the entire world into the conflict."}, {"time": 746, "text": "Did they have a sense of how deadly the war is?"}, {"time": 746, "text": "I mean, this is another scale of death and destruction."}, {"time": 753, "text": "At the beginning, no, but very quickly, the scale of the devastation of these sort of massive over the top attacks on the trenches is apparent to the military officers and it very quickly becomes apparent even at home."}, {"time": 767, "text": "You know, there is, of course, censorship of the battlefield and specific details don't reach people."}, {"time": 773, "text": "But for civilians and in any of the warring powers, they know fairly soon how destructive the war is."}, {"time": 780, "text": "And to me, that's always been a real sort of puzzle, right?"}, {"time": 786, "text": "That by the time the United States comes to decide whether to join the war in 1917, they know exactly what they're getting into, right?"}, {"time": 793, "text": "They're not backing into the war in the ways that the European powers did."}, {"time": 799, "text": "You know, they've seen the devastation, they've seen photographs, they've seen injured soldiers, and they make that choice anyway."}, {"time": 810, "text": "When you say they, do you mean the leaders of the people?"}, {"time": 810, "text": "Did the death and destruction reach the minds of the American people by that time?"}, {"time": 822, "text": "AOB Yes, absolutely."}, {"time": 822, "text": "We don't in 1917 have the mass media that we have now, but there are images in newspapers, there are newsreels that play at the movie theaters, and of course, some of it is sanitized."}, {"time": 837, "text": "But that combined with press accounts, often really quite descriptive press accounts, gory accounts, reached anyone who cared to read them."}, {"time": 844, "text": "Certainly, plenty of people didn't follow the news, felt it was far away."}, {"time": 851, "text": "But most Americans who cared about the news knew how devastating this war was."}, {"time": 856, "text": "LR Yeah, there's something that happens that I recently visited Ukraine for a few weeks."}, {"time": 864, "text": "There's something that happens with the human mind as you get away from the actual front where the bullets are flying, like literally one kilometer away."}, {"time": 872, "text": "You start to not feel the war."}, {"time": 878, "text": "AOB You'll hear an explosion, you'll see an explosion, you start to get assimilated to it, or you start to get used to it."}, {"time": 884, "text": "And then when you get as far away from currently what is Kiev, you know the war's going on, everybody around you is fighting in that war, but it's still somehow distant."}, {"time": 897, "text": "And I think with the United States, with the ocean between, even if you have the stories everywhere, it still is somehow distant, like the way a movie is."}, {"time": 904, "text": "Like a movie or a video game, it's somewhere else, even if your loved ones are going, or you are going to fight."}, {"time": 917, "text": "LR Yeah, that is absolutely the case."}, {"time": 917, "text": "And in some ways, that's true even for the home fronts in Europe, except for the areas where, in Belgium and France, where the war is right there in your backyard."}, {"time": 929, "text": "For other people, yeah, there's a distance."}, {"time": 929, "text": "And soldiers, of course, feel this very strongly."}, {"time": 935, "text": "European soldiers, when they're able to go home on leave, often deeply resent what they see as the luxury that civilians are living in during the war."}, {"time": 948, "text": "LR So how did US enter the war?"}, {"time": 948, "text": "Who was the president?"}, {"time": 948, "text": "What was the dynamics involved?"}, {"time": 948, "text": "And could it have stayed out?"}, {"time": 959, "text": "LR To answer your last question first, yes."}, {"time": 959, "text": "That the United States could have stayed out of the First World War as a military power."}, {"time": 966, "text": "The United States could not have ignored the war completely."}, {"time": 974, "text": "It shaped everything."}, {"time": 974, "text": "It shaped trade."}, {"time": 974, "text": "It shaped goods and services, agriculture, whether there was a crop coming, whether there were immigrants coming across the Atlantic to work in American factories."}, {"time": 987, "text": "So the US can't ignore the war."}, {"time": 987, "text": "But the US makes a choice in 1917 to enter the war by declaring war on Germany and Austria."}, {"time": 994, "text": "And in that sense, this is a war of choice, but it's kicked off by a series of events."}, {"time": 1004, "text": "So President Woodrow Wilson has been president through this entire period of time."}, {"time": 1010, "text": "He has just run in the 1916 presidential election on a campaign to keep the United States out of war."}, {"time": 1018, "text": "But then in early 1917, the Germans in some ways sort of twist the Americans arms."}, {"time": 1026, "text": "The Germans sort of high command comes to understand that they're stuck."}, {"time": 1032, "text": "They're stuck in this trench warfare."}, {"time": 1032, "text": "They need a big breakthrough."}, {"time": 1032, "text": "Their one big chance is to sort of break the blockade to push through that the British have imposed on them, to break through against France."}, {"time": 1046, "text": "And so they do."}, {"time": 1046, "text": "And along with this, they start sinking ships on the Atlantic, including American ships."}, {"time": 1055, "text": "The Germans know full well this will draw the United States into war."}, {"time": 1060, "text": "But the Germans look at the United States at this moment, a relatively small army, a relatively small Navy, a country that at least on paper is deeply divided about whether to join the war."}, {"time": 1073, "text": "And so they say, let's do it."}, {"time": 1073, "text": "They're not going to get any American soldiers there in time."}, {"time": 1081, "text": "It was a gamble, but I think probably their best chance."}, {"time": 1081, "text": "They took that gamble."}, {"time": 1081, "text": "They lost."}, {"time": 1090, "text": "In part, because French resistance was strong in part because Americans mobilized much faster and in much greater numbers than the Germans thought they would."}, {"time": 1095, "text": "So the American people were divided."}, {"time": 1099, "text": "The American people were absolutely divided about whether to enter this war."}, {"time": 1104, "text": "From 1914 to 1917, there is a searing debate across the political spectrum."}, {"time": 1104, "text": "It doesn't break down easily on party lines about whether it was in the US interest to do this, whether American troops should be sent abroad, whether Americans would end up just being cannon fodder for the European empires."}, {"time": 1125, "text": "Eventually, as American ships are sunk, first in the Lusitania in 1915, then in much greater numbers in 1917, the tide starts to turn and Americans feel that our response is necessary."}, {"time": 1141, "text": "And the actual declaration of war in Congress is pretty lopsided, but it's not unanimous by any means."}, {"time": 1147, "text": "Lopsided towards entering the war."}, {"time": 1147, "text": "Well, that's really interesting because there's echoes of that in later wars where Congress seems to... Nobody wants to be the guy that says no to war for some reason."}, {"time": 1164, "text": "Once you sense that in terms of, sorry, in terms of politicians, because then you appear weak, but I wonder if that was always the case."}, {"time": 1171, "text": "So you make the case that World War I is largely responsible for defining what it means to be an American citizen."}, {"time": 1185, "text": "So in which way does it define the American citizen?"}, {"time": 1185, "text": "When you think about citizenship, what it means is two things."}, {"time": 1193, "text": "First of all, what are your rights and obligations?"}, {"time": 1193, "text": "What is the legal citizenship that you have as a citizen of the United States or any other state?"}, {"time": 1205, "text": "And the second is a more amorphous definition of what does it mean to belong, to be part of America, to feel American, to love it or hate it or be willing to die for it."}, {"time": 1211, "text": "And both of those things really are crystal clear in terms of their importance during the war."}, {"time": 1218, "text": "So both of those things are on the table."}, {"time": 1225, "text": "Being a citizen who is a citizen who isn't matters."}, {"time": 1225, "text": "So people who had never carried passports or anything before suddenly have to."}, {"time": 1232, "text": "But also what it means to be an American, to feel like it, to be part of this project is also being defined and enforced during World War I."}, {"time": 1245, "text": "So project is a funny way to put a global war."}, {"time": 1245, "text": "So can you tell the story, perhaps that's a good example of it, of the James Montgomery Flagg's 1916 poster that reads, I want you."}, {"time": 1262, "text": "A lot of people know this poster."}, {"time": 1262, "text": "I think in its original form, its memeified form, I don't know."}, {"time": 1269, "text": "But we know this poster and we don't know where it came from."}, {"time": 1269, "text": "Or most Americans, I think, me included, didn't know where it came from."}, {"time": 1274, "text": "And it actually comes from 1916."}, {"time": 1279, "text": "Does this poster represent the birth of something new in America, which is a commodification or, I don't know, that propaganda machine that says what it means to be an American is somebody that fights for their country?"}, {"time": 1300, "text": "So the image, it's in fact, I think one of the most recognizable images, not only in the United States, but in the entire world."}, {"time": 1306, "text": "And you can bring it almost anywhere on Earth in 2022, and people will know what it refers to."}, {"time": 1313, "text": "And so this is an image that circulated first as a magazine cover, later as a recruitment poster, where the figure is Uncle Sam, sort of pointing at the viewer with his finger, sort of pointing and saying, I want you."}, {"time": 1326, "text": "And the I want you is a recruitment tool to join the US Army."}, {"time": 1331, "text": "And this image really kind of starts as a kind of, like I said, a magazine cover in 1916 by the artist James Montgomery Flagg."}, {"time": 1340, "text": "It initially appears under the heading, What are you doing for preparedness?"}, {"time": 1347, "text": "Meaning to prepare in case war comes to the United States."}, {"time": 1352, "text": "And at that point in 1916, we're still neutral."}, {"time": 1352, "text": "In 1917, it's turned into a US Army recruiting poster."}, {"time": 1360, "text": "And then it reappears in World War Two, reappears generations after, like you said, it's now gets remixed, memefied, it's all over the place."}, {"time": 1367, "text": "I think for me, it's a turning point, it's a sort of window into American culture at a crucial moment in our history, where the federal government is now embarking on a war overseas that's going to make enormous demands on its citizens."}, {"time": 1387, "text": "And at the same time, where sort of technologies of mass production and mass media, and what we would probably call propaganda, are being sort of mobilized for the for the first time in this new kind of way."}, {"time": 1402, "text": "Well, in some sense, is it fair to say that the Empire is born?"}, {"time": 1408, "text": "The expanding Empire is born from the Noam Chomsky perspective kind of empire that seeks to have military influence elsewhere in the world?"}, {"time": 1421, "text": "Yes, but I think as historians, we need to be at least as interested in what happens to the people who are getting pointed to by Uncle Sam, right, rather than just the one, you know, whether he's pointing at us."}, {"time": 1432, "text": "And, you know, so, so yes, he's asking us to do that."}, {"time": 1432, "text": "But how do we respond?"}, {"time": 1438, "text": "And the people responded."}, {"time": 1438, "text": "So the people are ultimately the the machines of history, the mechanisms of history."}, {"time": 1445, "text": "It's not Uncle Sam."}, {"time": 1445, "text": "Uncle Sam can only do so much if the people aren't willing to step up."}, {"time": 1450, "text": "They and, you know, the American people responded for sure, but they didn't build what Uncle Sam asked them to do in that poster, right?"}, {"time": 1454, "text": "And I think that's, you know, kind of a crucial aspect that, you know, there never would have been sort of global U.S. power without the response that begins in World War One."}, {"time": 1470, "text": "What was the Selective Service Act of 1917?"}, {"time": 1474, "text": "So one of the very first things that Uncle Sam wants you to do, right, is to register for selective service for the draft, right?"}, {"time": 1478, "text": "And the law is passed very soon after the U.S. enters the war."}, {"time": 1484, "text": "It's sort of, you know, demanding that all men first between 21 and 30, then between 18 and 45, register for the draft, and they'll be selected by a government agency, by a volunteer organization."}, {"time": 1498, "text": "It's a requirement to sign up."}, {"time": 1498, "text": "It is a legal requirement to register."}, {"time": 1498, "text": "Of course, not everyone who registers is selected, but over the course of the war, 24 million men register, almost 4 million serve in some fashion."}, {"time": 1513, "text": "What was the response?"}, {"time": 1513, "text": "What was the feeling amongst the American people to have to sign up to the Selective Service Act?"}, {"time": 1518, "text": "Have to register."}, {"time": 1522, "text": "This is a bigger turning point than we might think, right?"}, {"time": 1522, "text": "In some ways, this is a tougher demand of the American public than entering the war."}, {"time": 1528, "text": "It's one thing to declare war on Germany, right?"}, {"time": 1533, "text": "It's another thing to go down to your local post office and fill out the forms that allow your own government to send you there to fight."}, {"time": 1539, "text": "And this is especially important at a time when the federal government doesn't really have any other way to find you unless you actually go and register yourself, right?"}, {"time": 1552, "text": "And so, you know, ordinary people are participating in the building of this war machine, but at least a half a million of them don't, right?"}, {"time": 1558, "text": "And simply never fill out the forms, move from one town to another."}, {"time": 1567, "text": "But you said 20 million did?"}, {"time": 1567, "text": "20 something?"}, {"time": 1569, "text": "About 24 million register, at least 500,000."}, {"time": 1573, "text": "Is it surprising to you that that many registered?"}, {"time": 1573, "text": "Since the country was divided?"}, {"time": 1578, "text": "And that's what I, you know, sort of tried to dig in to figure out how did you get 24 million people to register for the draft?"}, {"time": 1583, "text": "And it's certainly not coming from the top down, right?"}, {"time": 1583, "text": "You know, there may be a hundred sort of agents in what's now called the FBI."}, {"time": 1589, "text": "You know, it's certainly not being enforced from Washington."}, {"time": 1595, "text": "It's being enforced in, you know, through the eyes of everyday neighbors, you know, through community surveillance, all kinds of ways."}, {"time": 1605, "text": "Oh, so there was like a pressure."}, {"time": 1608, "text": "There's a lot of pressure."}, {"time": 1609, "text": "So there was not a significant like antiwar movement as you would see maybe later with Vietnam and things like this?"}, {"time": 1619, "text": "There was a significant movement before 1917, but it becomes very hard to keep up an organized antiwar movement after that, particularly when the government starts shutting down protests."}, {"time": 1631, "text": "So as the Selective Service Act of 1917 runs up against some of the freedoms, some of the rights that are defined in our founding documents, what was that clash like?"}, {"time": 1640, "text": "What was sacrificed?"}, {"time": 1640, "text": "What freedoms and rights were sacrificed in this process?"}, {"time": 1653, "text": "I mean, I think on some level, the fundamental right is liberty, right?"}, {"time": 1653, "text": "That conscription sort of demands, you know, sacrifice on the behalf of some notionally for the protection of all."}, {"time": 1668, "text": "So even if you're against the war, you're forced to fight."}, {"time": 1672, "text": "You know, and there were small provisions for conscientious objectors, solely those who had religious objections to all war, right?"}, {"time": 1679, "text": "Not political objections to this war."}, {"time": 1679, "text": "And so, you know, several thousand were able to take those provisions."}, {"time": 1685, "text": "But even then, they faced social sanction, they faced ridicule, some of them faced intimidation."}, {"time": 1691, "text": "So those liberty interests, both individual freedom, religious freedom, you know, those are some of the first things to go."}, {"time": 1704, "text": "So what about freedom of speech?"}, {"time": 1704, "text": "What's the silencing of the press, of the voices of the different people that were object?"}, {"time": 1714, "text": "And so very soon after the Selective Service Act is passed, then you get the Espionage Act, which of course is back in the news in 2022."}, {"time": 1723, "text": "What's the Espionage Act?"}, {"time": 1725, "text": "The Espionage Act is a sort of omnibus bill."}, {"time": 1725, "text": "It contains about 10 or different provisions, very few of which have to do with espionage."}, {"time": 1729, "text": "But one key provision basically makes it illegal to say or do anything that would interfere with military recruitment, right?"}, {"time": 1735, "text": "And that provision is used to shut down radical publications, to shut down German language publications."}, {"time": 1748, "text": "And, you know, this really has a chilling impact on speech during the war."}, {"time": 1754, "text": "Could you put into words what it means to be an American citizen that is in part sparked by World War I?"}, {"time": 1760, "text": "Somebody that should be willing to sacrifice certain freedoms to fight for their country?"}, {"time": 1770, "text": "Somebody that's willing to fight to spread freedom elsewhere in the world, spread the American ideals?"}, {"time": 1779, "text": "Does that begin to tell the story what it means to be an American?"}, {"time": 1789, "text": "I think what we see is a change, right?"}, {"time": 1789, "text": "So citizenship during World War I now includes the obligation to defend the country, right, to serve, and to, if asked, to die for it, right?"}, {"time": 1803, "text": "And we certainly see that."}, {"time": 1803, "text": "And I think we see the close linkage of military service and US citizenship coming out of this time period."}, {"time": 1811, "text": "But, you know, when you start making lots of demands on people to fulfill obligations, in turn, they're going to start demanding rights."}, {"time": 1822, "text": "And we start to see, not necessarily during the war but after, more demands for free speech protections, more demands for equality, for marginalized groups."}, {"time": 1828, "text": "And so, you know, obligations and rights are sort of developing in a dynamic relationship."}, {"time": 1838, "text": "Oh, it's almost like an overreach of power sparked a sense like, oh crap, we can't trust centralized power to abuse, like to drag us into a war."}, {"time": 1845, "text": "We need to be able to."}, {"time": 1845, "text": "So there's the birth of that tension between the government and the people."}, {"time": 1855, "text": "It's a rebirth of it."}, {"time": 1855, "text": "You know, of course, that tension is always there."}, {"time": 1855, "text": "But in its modern form, I think it comes from this reintensification of it."}, {"time": 1861, "text": "So what about, you said that World War I gave birth to the surveillance state in the US."}, {"time": 1870, "text": "Yeah, so the Espionage Act, you know, sort of empowers federal organizations to watch other Americans."}, {"time": 1878, "text": "They are particularly interested in anyone who is obstructing the draft, anyone who is trying to kind of organize labor or strikes or radical movements, and anyone who might have sympathy for Germany, which basically means, you know, all German Americans come under surveillance."}, {"time": 1898, "text": "Initially, you know, this is very small scale."}, {"time": 1898, "text": "But soon, every government agency gets involved from the Treasury Department Secret Service to the Post Office, which is sort of breeding mail, to the Justice Department, which mobilizes 200,000 volunteers."}, {"time": 1910, "text": "You know, it's a really significant enterprise."}, {"time": 1916, "text": "Much of it goes away after the war."}, {"time": 1916, "text": "But of all the things that go away, this core of the surveillance state is the thing that persists most fully."}, {"time": 1928, "text": "Is this also a place where government, the size of government starts to grow in these different organizations, or maybe creates a momentum for growth of government?"}, {"time": 1939, "text": "Oh, it's exponential growth, right?"}, {"time": 1939, "text": "That, you know, that over the course of the war, by almost any metric you use, right, the size of the federal budget, the number of federal employees, the number of soldiers in the standing army, all of those things skyrocket during the war."}, {"time": 1955, "text": "They go down after the war, but they never go down to what they were before."}, {"time": 1961, "text": "And probably gave a momentum for growth."}, {"time": 1965, "text": "Did World War I give birth to the military industrial complex in the United States?"}, {"time": 1965, "text": "So, war profiteering, expanding of the war machine in order to financially benefit a lot of parties involved?"}, {"time": 1984, "text": "So, I guess I would maybe break that into two parts, right?"}, {"time": 1984, "text": "That, on the one hand, yes, there is war profiteering."}, {"time": 1991, "text": "There are investigations of it."}, {"time": 1991, "text": "In the years after the war, there's a widespread concern that the profit motive had played too much of a part in the war, and that's definitely the case."}, {"time": 2006, "text": "But I think when you try to think of this term military industrial complex, it's best to think of it as, at what point does the one side lock in the other, right?"}, {"time": 2019, "text": "That military choices are shaped by industry objectives and vice versa."}, {"time": 2019, "text": "And I don't think that that was fully locked into place during World War I. I think that's really a Cold War phenomenon, when the United States is on this intense kind of footing for two generations in a row."}, {"time": 2038, "text": "So, industrial is really important there, there is companies."}, {"time": 2038, "text": "So, before then, weapons of war were created, were funded directly by the government."}, {"time": 2043, "text": "Who was manufacturing the weapons of war?"}, {"time": 2052, "text": "They were generally manufactured by private industry."}, {"time": 2052, "text": "There were, of course, arsenals, sort of 19th century iterations where the government would produce its own weapons, partly to make sure that they got what they wanted."}, {"time": 2063, "text": "But most of the weapons of war for all of the European powers, and the United States, are produced by private industry."}, {"time": 2073, "text": "So, why do you say that the military industrial complex didn't start then?"}, {"time": 2073, "text": "What was the important thing that happened in the Cold War?"}, {"time": 2081, "text": "I think one way to think about it is that the Cold War is a point at which it switches from being a dial to a ratchet, right?"}, {"time": 2088, "text": "So, during World War I, the relationship between the military and industry dials up fast and high, and stays that way, and it dials back down."}, {"time": 2101, "text": "Whereas during the Cold War, sort of the relationship between the two often looks more like a ratchet."}, {"time": 2108, "text": "Yeah, it becomes unstoppable."}, {"time": 2110, "text": "It goes up again."}, {"time": 2112, "text": "In the way that you start, I think, the way the military industrial complex is often discussed as a system that is unstoppable, like it expands."}, {"time": 2117, "text": "If you take a very cynical view, it creates war so that it can make money."}, {"time": 2129, "text": "It doesn't just find places where it can help through military conflict."}, {"time": 2139, "text": "It creates tensions that directly or indirectly lead to military conflict that it can then fuel and make money from."}, {"time": 2153, "text": "That is certainly one of the concerns of both people who are critical of the First World War, and then also of Dwight Eisenhower, right, when he's president and sort of in his farewell address, where he sort of introduces the term military industrial complex."}, {"time": 2165, "text": "And some of it is about the profit motive, but some of it is a fear that Eisenhower had that no one had an interest in stopping this, right, and that no one had a voice in stopping it, and that the ordinary American could really do nothing to dial things down."}, {"time": 2191, "text": "Is it strange to you that we don't often hear that kind of speech today, with Eisenhower speaking about the military industrial complex?"}, {"time": 2199, "text": "For example, we'll have people criticizing the spending on war efforts, but they're not discussing the machinery of the military industrial complex, like the basic way that human nature works, that we get ourselves trapped in this thing."}, {"time": 2222, "text": "They're saying, like, there's better things to spend money on, versus describing a very seemingly natural process of when you build weapons of war that's going to lead to more war."}, {"time": 2235, "text": "Like, it pulls you in somehow."}, {"time": 2239, "text": "Yeah, I would say throughout the Cold War, and even after the end of it, there has not been a sustained conversation in the United States about our defense establishment, right, what we really need, and what serves our interest, and to what extent sort of other things like blanket forces, profit motives, belong in that conversation."}, {"time": 2283, "text": "This would have been just talked about constantly in the years between about 1930 and 1936, as people were starting to worry that storm clouds were gathering in Europe again."}, {"time": 2298, "text": "Yeah, but it always seems like those folks get pushed to the fringes."}, {"time": 2298, "text": "You're made an activist versus a thinking leader."}, {"time": 2312, "text": "Those discussions are often marginalized, framed as conspiracy theory, etc."}, {"time": 2312, "text": "I think it's important to realize that in the generation after World War I, this was a serious civic conversation."}, {"time": 2327, "text": "It led to investigations of defense finance."}, {"time": 2327, "text": "It led to experiments in Britain and France in public finance of war material."}, {"time": 2335, "text": "I think those conversations need to be reconvened now in the 21st century."}, {"time": 2344, "text": "Is there any parallels between World War I and the war in Ukraine?"}, {"time": 2344, "text": "The reason I bring it up is because you mentioned there was a hunger for war, a capacity for war that was already established, and the different parties were just boiling the tensions."}, {"time": 2363, "text": "So there's a case made that America had a role to play, NATO had a role to play in the current war in Ukraine."}, {"time": 2376, "text": "Is there some truth to that when you think about it in the context of World War I?"}, {"time": 2384, "text": "Or is it purely about the specific parties involved, which is Russia and Ukraine?"}, {"time": 2391, "text": "I think it's very easy to draw parallels between World War I and the war in Ukraine, but I don't think they really work."}, {"time": 2402, "text": "The First World War in some ways is generated by a fundamental conflict in the European system of empires, in the global system of empires."}, {"time": 2414, "text": "In many ways, if there's a parallel, the war in Ukraine is the parallel to some of the conflicts in the Mediterranean and the Balkans in 1911 to 1913, that then later there was a much greater conflict."}, {"time": 2440, "text": "So I think if there's any lessons to be learned for how not to let World War III look like World War I, it would be to make sure that systems aren't locked into place that escalate wars out of people's expectations."}, {"time": 2458, "text": "That's I suppose what I was implying, that this is the early stages of World War III."}, {"time": 2458, "text": "That in the same way that several wolves are licking their chops or whatever the expression is, they're creating tension, they're creating military conflict with a kind of unstoppable imperative for a global war."}, {"time": 2477, "text": "Many people that are looking at this are really worried about that."}, {"time": 2489, "text": "Now the forcing function to stop this war is that there's several nuclear powers involved, which has at least for now worked to stop full on global war."}, {"time": 2502, "text": "But I'm not sure that's going to be the case."}, {"time": 2502, "text": "In fact, what is one of the surprising things to me in Ukraine is that still in the 21st century, we can go to something that involves nuclear powers, not directly yet, but awfully close to directly, go to a hot war."}, {"time": 2525, "text": "And so do you worry about that, that there's a kind of descent into a World War I type of scenario?"}, {"time": 2536, "text": "Yes, I mean, that keeps me up at night, and I think it should keep the citizens of both the United States and Russia up at night."}, {"time": 2542, "text": "And I think, again, it gets back to what I was saying, that in the summer of 1914, even then, things that looked like a march toward war could have been different."}, {"time": 2560, "text": "And so I think it's important for leaders of both countries and of all of the related countries, of Ukraine, of the various NATO powers, to really imagine off ramps and to imagine alternatives and to make them possible."}, {"time": 2576, "text": "Whether it's through diplomacy, whether it's through other formats, I think that that's the only way to prevent sort of greater escalation."}, {"time": 2594, "text": "What's the difference between World War I and the Civil War?"}, {"time": 2594, "text": "In terms of how they defined what it means to be an American, but also the American citizen's relationship with the war, what the leaders were doing, is there interesting differences and similarities?"}, {"time": 2614, "text": "Besides the fact that everybody seems to have forgot about World War I in the United States and everyone still remembers Civil War."}, {"time": 2620, "text": "And the American Civil War defines American identity in some ways, along with the Revolution and the Second World War, more so than any other conflict."}, {"time": 2630, "text": "And it's a fundamentally different war."}, {"time": 2637, "text": "It's won because it is a civil war, because of secession, because of the Confederacy."}, {"time": 2646, "text": "This is a conflict happening on the territory of the United States between Americans."}, {"time": 2652, "text": "And so the dynamics are really quite different."}, {"time": 2652, "text": "So the leaders particularly Lincoln have a different relationship to the home front, to civilians, than they say Wilson or Roosevelt have in World War I and II."}, {"time": 2670, "text": "Also the way you would tell the story of the Civil War, perhaps similar to the way we tell the story of World War II, there's like a reason to actually fight the war."}, {"time": 2674, "text": "The way we tell the story is we're fighting for this idea that all men are created equal, that the war is over slavery in part."}, {"time": 2685, "text": "Perhaps that's a drastic oversimplification of what the war was actually about in the moment, like how do you get pulled into an actual war versus a hot discussion."}, {"time": 2698, "text": "And the same with World War II, people kind of framed the narrative that it was against evil, Hitler being evil."}, {"time": 2707, "text": "I think the key part of that is probably the Holocaust, is how you can formulate Hitler's being evil."}, {"time": 2715, "text": "If there's no Holocaust, perhaps there's a case to be made that we wouldn't see World War II as such a quote unquote good war, that there's an atrocity that had to happen to make it really, to be able to tell a clear narrative of why we get into this war."}, {"time": 2735, "text": "Perhaps such a narrative doesn't exist for World War I, and so that doesn't stay in the American mind."}, {"time": 2740, "text": "We try to sweep it under the rug, given though overall 16 million people died."}, {"time": 2746, "text": "So to you the difference is in the fact that you're fighting for ideas and fighting on the homeland."}, {"time": 2754, "text": "But in terms of people's participation, you know, fighting for your country, was there similarities there?"}, {"time": 2770, "text": "I mean, I think, I mean the Civil War in both the North and the South, troops are raised overwhelmingly through volunteer recruitment."}, {"time": 2777, "text": "There is a draft in both the North and the South, but it's not significant."}, {"time": 2784, "text": "Only 8% of Confederate soldiers came in through conscription."}, {"time": 2795, "text": "And so in fact, the mobilization for volunteers often organized locally around individual communities or states, creates sort of multiple identities and levels of loyalty, where people both in the North and the South have loyalty both to their state regiments, to their sort of community militias and as well to the country."}, {"time": 2815, "text": "They are fighting over the country, right?"}, {"time": 2821, "text": "Over the United States."}, {"time": 2821, "text": "And so the Union and the Confederacy have conflicting and ultimately irreconcilable visions of that."}, {"time": 2827, "text": "But that sort of nationalism that comes out of the Union after the victory in the war is a kind of crucial force shaping America ever since."}, {"time": 2841, "text": "So what was the neutrality period?"}, {"time": 2841, "text": "Why did US stay out of the war for so long?"}, {"time": 2841, "text": "What was going on in that interesting, like, what made Woodrow Wilson change his mind?"}, {"time": 2846, "text": "What was the interesting dynamic there?"}, {"time": 2858, "text": "I always say that the United States entered the war in April of 1917, but Americans entered it right away, right?"}, {"time": 2865, "text": "They entered it."}, {"time": 2865, "text": "Some of them actually went and volunteered and fought almost exclusively on the side of Britain and France."}, {"time": 2870, "text": "At least 50,000 joined the Canadian army or the British army and served."}, {"time": 2879, "text": "Millions volunteer."}, {"time": 2879, "text": "They sent humanitarian aid."}, {"time": 2879, "text": "I think in many ways, modern war creates modern humanitarianism, and we can see that in the neutrality period."}, {"time": 2893, "text": "And even if they wanted the United States to stay out of the war, a lot of Americans get involved in it by thinking about it, caring about it, arguing about it."}, {"time": 2898, "text": "And at the same time, they're worried that British propaganda is shaping their news system."}, {"time": 2905, "text": "They are worried that German espionage is undermining them."}, {"time": 2912, "text": "They're worried that both Britain and Germany are trying to interfere in American elections and American news cycles."}, {"time": 2917, "text": "And at the same time, a revolution is breaking out in Mexico."}, {"time": 2923, "text": "So there are sort of concerns about what's happening in the Western Hemisphere as well as what's happening in Europe."}, {"time": 2934, "text": "So World War I was supposed to be the war to end all wars, and it didn't."}, {"time": 2934, "text": "How did World War I pave the way to World War II?"}, {"time": 2942, "text": "Every nation probably has their own story in this trajectory towards World War II."}, {"time": 2949, "text": "How did Europe allow World War II to happen?"}, {"time": 2949, "text": "How did the Soviet Union, Russia allow World War II to happen, and how did America allow World War II to happen?"}, {"time": 2962, "text": "And Japan?"}, {"time": 2964, "text": "The answer is different for each country, right?"}, {"time": 2964, "text": "That in some ways in Germany, the culture of defeat and the experience of defeat at the end of World War I leads to a culture of resentment, recrimination, finger pointing blame that makes German politics very ugly."}, {"time": 2985, "text": "As one person puts it, brutalizes German politics."}, {"time": 2990, "text": "It places resentment at the core of the populace and its politics."}, {"time": 2996, "text": "And so in some ways, that lays the groundwork for the kind of politics of resentment and hate that comes from the Nazis."}, {"time": 3002, "text": "For the United States, in some ways, the failure to win the peace sets up the possibility for the next war, that the United States, through Wilson, is sort of crafting a new international order in order that this will be the war to end all wars."}, {"time": 3023, "text": "But because the United States failed to join the League of Nations, you see the United States really sort of on the hook for another generation."}, {"time": 3034, "text": "In Asia, the story is more complicated, right?"}, {"time": 3034, "text": "And I think it's worth bearing that in mind that World War II is a two front war."}, {"time": 3038, "text": "It starts in Asia for its own reasons."}, {"time": 3038, "text": "World War I is transformative for Japan, right?"}, {"time": 3045, "text": "It is a time of massive economic expansion."}, {"time": 3045, "text": "A lot of that sort of economic wealth is poured into sort of greater industrialization and militarization."}, {"time": 3058, "text": "And so when the military wing in Japanese politics takes over in the 1930s, they're in some ways flexing muscles that come out of the First World War."}, {"time": 3069, "text": "Can you talk about the end of World War I, the Treaty of Versailles?"}, {"time": 3069, "text": "What's interesting about that dynamics there, of the parties involved, of how it could have been done differently to avoid the resentment?"}, {"time": 3084, "text": "Or again, is it inevitable?"}, {"time": 3090, "text": "So the war ends and very soon, even before the war is over, the United States in particular is trying to shape the peace, right?"}, {"time": 3098, "text": "And the United States is the central actor at the Paris Peace Conference in 1919."}, {"time": 3103, "text": "Woodrow Wilson is there, he's presiding, and he knows that he calls the shots."}, {"time": 3111, "text": "So he was respected."}, {"time": 3112, "text": "He was respected, but resentfully in some ways by the European powers, Britain and France and Italy to a lesser extent, who felt that they had sacrificed more."}, {"time": 3119, "text": "They had two goals, right?"}, {"time": 3126, "text": "They wanted to shape the imperial system in order to make sure that their kind of fundamental economic structures wouldn't change."}, {"time": 3133, "text": "And they also wanted to sort of weaken Germany as much as possible, right?"}, {"time": 3139, "text": "So that Germany couldn't rise again."}, {"time": 3143, "text": "What this leads to is a peace treaty that maintains some of the fundamental conflicts of the imperial system and makes, bankrupts Germany, starves Germany, and kind of feeds this politics of resentment that make it impossible for Germany to kind of participate in a European order."}, {"time": 3166, "text": "So people like historian Neil Ferguson, for example, make the case that if Britain stayed out of World War I, we would have avoided this whole mess and we would potentially even avoid World War II, this kind of counterfactual history."}, {"time": 3178, "text": "Do you think it's possible to make the case for that?"}, {"time": 3186, "text": "That there was a moment, especially in that case, staying out of the war for Britain, that the escalation to a global war could have been avoided and one that ultimately ends in a deep global resentment."}, {"time": 3197, "text": "So where Germany is resentful not just of France or particular nations, but is resentful of the entire, I don't know how you define it, the West or something like this, the entire global world."}, {"time": 3216, "text": "I wish it were that easy."}, {"time": 3216, "text": "And I think it's useful to think in counterfactuals."}, {"time": 3216, "text": "What if?"}, {"time": 3229, "text": "And if you believe, as historians do, in causation, if that one thing causes another, then you also have to believe in counterfactuals, right?"}, {"time": 3237, "text": "That if something hadn't happened, then maybe that would have worked differently."}, {"time": 3241, "text": "But I think all the things that led to World War I are multi causal and nuanced."}, {"time": 3249, "text": "And this is what historians do."}, {"time": 3249, "text": "We make things more complicated."}, {"time": 3256, "text": "And so there was no one thing that could have turned the tide of history."}, {"time": 3256, "text": "Oh, if only Hitler had gotten into art school or if only Fidel Castro had gotten into the major leagues."}, {"time": 3274, "text": "Those are interesting thought experiments, but few events in history I think are that contingent."}, {"time": 3279, "text": "Well, Hitler is an example of somebody who is a charismatic leader that seems to have a really disproportionate amount of influence on the tide of history."}, {"time": 3285, "text": "So if you look at Stalin, you could imagine that many other people could have stepped into that role."}, {"time": 3303, "text": "And the same goes for many of the other presidents through, or even Mao."}, {"time": 3303, "text": "It seems that there's a singular nature to Hitler, that you could play the counterfactual, that if there was no Hitler, you may have not had World War II."}, {"time": 3315, "text": "He better than many leaders in history was able to channel the resentment of the populace into a very aggressive expansion of the military and I would say skillful deceit of the entire world in terms of his plans and was able to effectively start the war."}, {"time": 3336, "text": "So is it possible that, I mean, could Hitler have been stopped?"}, {"time": 3344, "text": "Could we have avoided if he just got into art school?"}, {"time": 3344, "text": "Or again, do you feel like there's a current of events that was unstoppable?"}, {"time": 3355, "text": "I mean, part of what you're talking about is Hitler the individual as a sort of charismatic leader who's able to mobilize the nation."}, {"time": 3361, "text": "And part of it is Hitlerism, his own sort of individual ability to play, for example, play off his subordinates against one another to set up a system of that nature that in some ways escalates violence, including the violence that leads to the Holocaust."}, {"time": 3381, "text": "And some of it is also Hitlerism as a leader cult."}, {"time": 3388, "text": "And we see this in many other sort of things where a political movement surrounds one particular individual who may or may not be replaceable."}, {"time": 3395, "text": "So yes, the World War II we got would have been completely different if a different sort of faction had risen to power in Germany."}, {"time": 3411, "text": "But Europe, you know, Depression era Europe was so unstable and democracies collapsed throughout Western Europe over the course of the 1930s, you know, whether they had charismatic totalitarian leaders or not."}, {"time": 3424, "text": "Have you actually read one book I just recently finished?"}, {"time": 3424, "text": "I'd love to get your opinion from a historian perspective."}, {"time": 3431, "text": "There's a book called Blitzed Drugs in the Third Reich by Norman Mohler."}, {"time": 3436, "text": "It makes a case that drugs played a very large role, meth essentially, played a very large role in World War II."}, {"time": 3445, "text": "There's a lot of criticism of this book, saying that it's kind of to what you're saying, it takes this one little variable and makes it like this explains everything."}, {"time": 3458, "text": "So everything about Hitler, everything about the blitzkrieg, everything about the military, the way the strategy, the decisions could be explained through drugs, or at least implies that kind of thing."}, {"time": 3470, "text": "And the interesting thing about this book because Hitler and Nazi Germany is one of the most sort of written about periods of human history."}, {"time": 3482, "text": "And this was not drugs were almost entirely not written about in this context."}, {"time": 3482, "text": "So here come along this semi historian because I don't think he's even a historian."}, {"time": 3487, "text": "He's a lot of his work is fiction."}, {"time": 3493, "text": "Hopefully I'm saying that correctly."}, {"time": 3493, "text": "So he tells a really that's one of the criticisms he tells a very compelling story that drugs were at the center of this period and also of the man of Hitler."}, {"time": 3507, "text": "What are your sort of feelings and thoughts about if you've gotten a chance to read this book, but I'm sure there's books like it that tell an interesting perspective singular perspective on a war."}, {"time": 3519, "text": "Yeah, I mean, I have read it and I also had this sort of eye opening experience that a lot of historians did and they're like, why didn't, why didn't we think about this?"}, {"time": 3531, "text": "And I think whether he's, the author Oller is sort of not a trained academic historian, but the joy of history is like, you don't have to be one to write good history."}, {"time": 3543, "text": "And I don't think anyone sort of criticizes him for, for that."}, {"time": 3548, "text": "Um, I like the book as a, as a window into the third Reich."}, {"time": 3548, "text": "You know, of course drugs don't explain all of it, but it helps us see, um, you know, uh, it see helps us see the people who supported Hitler, um, uh, the ways in which, um, you know, uh, it was that mind altering and performance altering drugs were used to kind of keep soldiers on the battlefield."}, {"time": 3574, "text": "Um, the ways in which, um, you know, I think that we take, we don't fully understand the extent to which the third Reich is held together with like duct tape, um, from, um, you know, from a pretty early phase by like 1940 or 41 even, you know, it's all smoke and mirrors."}, {"time": 3593, "text": "And I think that wartime propaganda, both Germans trying to say, you know, we're winning everything and America trying to mobilize, uh, and the other allies, you know, to mobilize against Germany, uh, described a more formidable enemy than it really was by 1941 and 42."}, {"time": 3612, "text": "I mean, I could see both cases."}, {"time": 3612, "text": "Uh, one is that duct tape doesn't make the man, but also as an engineer, I'm a huge fan of duct tape because it does seem to solve a lot of problems."}, {"time": 3624, "text": "And, uh, I do worry that this perspective that the book presents about drugs is somehow to the mind really compelling because it's almost like the mind, or at least my mind searches for an answer."}, {"time": 3639, "text": "How could this have happened?"}, {"time": 3639, "text": "And it's nice to have a clean explanation and drugs is one popular one."}, {"time": 3644, "text": "When people talk about steroids and sports, the moment you introduced the topic of steroids, somehow the mind wants to explain all success in the context was because this person was on steroids, Lance Armstrong."}, {"time": 3656, "text": "Well, it's, it like, it's a very sticky idea."}, {"time": 3664, "text": "Certain ideas, certain explanations are very sticky."}, {"time": 3669, "text": "And I think that's really dangerous because then you lose the full context."}, {"time": 3669, "text": "And also in the case of drugs, it removes the responsibility from the person, both for the military genius and the evil."}, {"time": 3680, "text": "And I think you, I mean, it's a very dangerous thing to do because something about the mind, maybe it's just mind that's sticky to this."}, {"time": 3687, "text": "Well, drugs explain it."}, {"time": 3687, "text": "If the drugs didn't happen, uh, then it would be very different."}, {"time": 3691, "text": "It worries me how compelling it is of an explanation, you know?"}, {"time": 3697, "text": "So that's why it's maybe better to think of it as a window into the third, right?"}, {"time": 3702, "text": "Is that an explanation of it?"}, {"time": 3702, "text": "But it's also a nice exploration of Hitler, the man."}, {"time": 3707, "text": "For some reason, discussing his habits, especially later in the war, um, his practices with drugs gives you a window into the person."}, {"time": 3712, "text": "It reminds you that there's a human, this is a human being, like a human being that gets emotional in the morning, gets thoughtful in the morning, hopeful, sad, depressed, angry, like a story of emotions of the human being."}, {"time": 3734, "text": "Somehow we construct, um, which is a pretty dangerous thing to do, construct an evil monster out of Hitler when in reality he's a human being like all of us."}, {"time": 3746, "text": "I think the lesson there is the soldier needs to lesson, which is all of us to some degree are capable of evil."}, {"time": 3750, "text": "Um, or maybe if you want to make it less powerful a statement, many of our leaders are capable of evil."}, {"time": 3758, "text": "That this Hitler is not truly singular in history."}, {"time": 3765, "text": "That, uh, yeah, when the resentment of the populace matches the right charismatic leader, it's, it's easy to make the kind of, not easy, but it's possible to frequently make the kind of, uh, initiation of military conflict that happened in World War, World War II."}, {"time": 3784, "text": "By the way, because you said not a trained historian, one of the, one of the most compelling and I don't know, entertaining and fascinating exploration of World War I comes from Dan Carlin."}, {"time": 3797, "text": "I don't know if you've gotten a chance to listen to his sort of podcast form telling of the blueprint for Armageddon, which is the telling of World War I."}, {"time": 3804, "text": "What do you think about Dan Carlin, you yourself as a historian who has studied, who has written about World War I?"}, {"time": 3814, "text": "Do you, do you enjoy that kind of telling of history?"}, {"time": 3814, "text": "And I think, um, again, you know, uh, you don't need a PhD in history to, to be a historian."}, {"time": 3826, "text": "Um, does every historian agree with that?"}, {"time": 3826, "text": "Uh, he gets quite a bit of criticism from historians."}, {"time": 3830, "text": "Uh, you know, I mean, we, you know, we like to argue with each other and nitpick with each other, but, um, but the one thing I have no patience for is when we like pull rank on each other."}, {"time": 3838, "text": "Um, you know, I think, um, we depend on, uh, you know, if you're, you know, a historian in a university with degrees and research materials, you know, you depend on the work of people in some local community, like recording oral histories, saving documents."}, {"time": 3855, "text": "And history is a, it's a social science, but it's also a storytelling art."}, {"time": 3861, "text": "Um, and you know, uh, history books are the ones you find on the shelves and bookstores that people read for, for fun."}, {"time": 3866, "text": "And, and then, and you can appreciate both the, the knowledge production, um, as well as the storytelling."}, {"time": 3872, "text": "Um, and when you get a good oral storyteller like Dan Carlin, um, there's a reason that thousands and hundreds of thousands of people tune in."}, {"time": 3882, "text": "But he definitely suffers from anxiety about getting things correct."}, {"time": 3882, "text": "And it's very, it's very difficult."}, {"time": 3888, "text": "Well, our first job is to get the facts, uh, the facts correct and then, and then to tell the story off of those."}, {"time": 3892, "text": "But the, the facts are so fuzzy."}, {"time": 3898, "text": "So it's a, I mean, you have the, probably my favorite telling of World War II is William Shire's Rise and Fall of the Third Reich."}, {"time": 3905, "text": "And, uh, or at least not telling of Nazi Germany."}, {"time": 3912, "text": "And that goes to primary sources a lot, which is like, I suppose that's the honest way to do it."}, {"time": 3920, "text": "But it's tough."}, {"time": 3920, "text": "It's really tough to write that way, to really go to primary sources always."}, {"time": 3926, "text": "And I think the, one of the things that Dan tries to do, which is also really tough to do, perhaps easier in, in oral history is, uh, try to make you feel what it was like to be there."}, {"time": 3941, "text": "Which, uh, I think he does by trying to tell the story of like individual soldiers and, um, do you find that telling like individual citizens?"}, {"time": 3948, "text": "Do you find that kind of telling of history compelling?"}, {"time": 3958, "text": "I mean, I think we need, uh, historical imagination."}, {"time": 3958, "text": "Um, and I think historical imagination teaches something very valuable, which is humility, um, to realize that there are other people, um, who've lived on this planet and they organized their lives differently and, you know, they made it through just fine too."}, {"time": 3980, "text": "Um, and, um, you know, I think that, that, that kind of, of, of meeting other people from the past can be actually a very useful skill for meeting people unlike you in the present."}, {"time": 3998, "text": "Unlike you, but also like you."}, {"time": 3998, "text": "I think both are, uh, both are humbling."}, {"time": 3998, "text": "One realizing that they did live in a different space and time, but two realizing that if you, if you were placed in that space and time, you might have done all the same things, whether it's the brave, good thing or the evil thing."}, {"time": 4017, "text": "Um, and you get a, also a sense of, um, uh, of possibility."}, {"time": 4017, "text": "You know, there's this famous line, right?"}, {"time": 4024, "text": "That, um, you know, those who do not learn history are condemned to repeat it."}, {"time": 4027, "text": "Um, but I think the other half is true, uh, as well, which is those who do not learn history don't get the chance to repeat it, right?"}, {"time": 4032, "text": "Um, you know, that we're not the first people on this planet to face, you know, any certain kinds of problems."}, {"time": 4041, "text": "Um, you know, other people have, have lived through worlds like this one before."}, {"time": 4046, "text": "It's like when you fall in love as a teenager for the first time, there's, and then there's a breakup."}, {"time": 4049, "text": "You think it, it's the greatest tragedy, tragedy that has ever happened in the world."}, {"time": 4056, "text": "You're the first person."}, {"time": 4056, "text": "Even though, like, Romeo and Juliet and so on had, had this issue, you're the first person that truly feels the catastrophic heartbreak of that experience."}, {"time": 4069, "text": "It's good to be reminded that no, the human condition is what it is."}, {"time": 4069, "text": "We have lived through it at the individual and the societal scale."}, {"time": 4079, "text": "Let me ask you about nationalism, which I think is at the core of I want you poster."}, {"time": 4087, "text": "Is nationalism destructive or empowering to a nation?"}, {"time": 4087, "text": "And we can use different words like patriotism, which is in many ways synonymous to nationalism, but in recent history, perhaps because of the Nazis has, has, um, slowly parted ways that somehow nationalism is when patriotism, patriotism gone bad or something like this."}, {"time": 4110, "text": "Yeah, they're, they're different, right?"}, {"time": 4110, "text": "Um, patriotism, um, you know, patriotism is in some ways best thought of as an emotion, right?"}, {"time": 4116, "text": "Uh, and a feeling of, of love of country, right?"}, {"time": 4121, "text": "Um, you know, uh, literally, um, uh, and in some ways that's a necessary condition to participate in nationalism."}, {"time": 4127, "text": "Um, you know, whether to me, I think nationalism is crucial, um, in a world organized around nation states."}, {"time": 4136, "text": "Um, and you have to sort of believe that you are engaged in a common project together, right?"}, {"time": 4144, "text": "Um, and so, you know, in the contemporary United States, um, you know, uh, in some ways that that question is actually on the table in ways that it hasn't been in the past, but you know, you have to believe that you're engaged in a common project, that you have something in common with the person with whom you share this nation."}, {"time": 4164, "text": "Um, and, um, and that you would sacrifice for them, whether it's by paying taxes for them or, um, you know, we're going to war to defend them."}, {"time": 4169, "text": "Um, that's a vision of, you know, what we might call civic nationalism."}, {"time": 4174, "text": "Um, uh, that's, that's the good version."}, {"time": 4179, "text": "The question is whether you could have that, um, without having, um, exclusionary nationalism, you know, hating the other, right?"}, {"time": 4186, "text": "Fearing the other saying, uh, yeah, you're part of this nation, uh, against all others."}, {"time": 4191, "text": "Um, and I think there's a long tradition in America of a very inclusive, uh, nationalism, um, that is open, uh, inclusive, um, and, you know, new people to this shared project."}, {"time": 4206, "text": "Um, that's something to be defended."}, {"time": 4214, "text": "Exclusionary nationalism is based on, you know, um, uh, uh, ethnic hatreds and others that we see throughout the world."}, {"time": 4219, "text": "Um, those are things to be afraid of."}, {"time": 4224, "text": "But there is a kind of narrative in the United States that a nationalism that includes the big umbrella of democratic nations, nations that strive for freedom and everybody else is against, is against freedom and against human nature."}, {"time": 4236, "text": "And it just so happens that it's half and half split across the world."}, {"time": 4241, "text": "So that's imperialism that feels like it beats the drum of war."}, {"time": 4251, "text": "And I, I mean, I don't want to paint too rosy a picture and certainly, you know, the United States, um, as a nation has often found it easier to define ourselves against something than to clarify exactly what we're for."}, {"time": 4266, "text": "The Cold War, China today."}, {"time": 4266, "text": "That's not only United States."}, {"time": 4266, "text": "I suppose that's, that's human nature."}, {"time": 4276, "text": "It's, we need a competitor."}, {"time": 4276, "text": "It's almost like maybe the success of human civilization requires figuring out how to construct competitors that don't result in global war."}, {"time": 4292, "text": "Or figuring out how to turn enemies into rivals and competitors."}, {"time": 4292, "text": "There's a real difference."}, {"time": 4301, "text": "You know, you can, you, you know, you compete with competitors."}, {"time": 4301, "text": "You, you fight with enemies."}, {"time": 4307, "text": "With competitors is a respect, maybe even a love underlying the competition."}, {"time": 4315, "text": "What lessons, what are the biggest lessons you take away from World War I?"}, {"time": 4315, "text": "Maybe we talked about several, but you know, you look back at the 20th century."}, {"time": 4322, "text": "What, as a historian, what do you learn about human nature, about human civilization, about history from looking at this war?"}, {"time": 4339, "text": "I think the, the lesson I would want everyone to take from the story of the First World War is that human life is not cheap."}, {"time": 4349, "text": "That all of the warring powers thought that just by throwing more men and more material at the front, they would solve their political problems with military force."}, {"time": 4368, "text": "And at the end of the day in 1918, one side did win that, but it didn't actually solve any of those political problems."}, {"time": 4379, "text": "And in the end, the regular people paid the price with their lives."}, {"time": 4386, "text": "And people who, people who had been told that their lives were cheap remembered that, right?"}, {"time": 4392, "text": "And it sort of, you know, reshapes mass politics for the rest of the 20th century, both in Europe and around the world."}, {"time": 4401, "text": "The, yeah, the cost of a death of a single soldier is not just, or a single civilian is not just the cost of that single life."}, {"time": 4409, "text": "It's the resentment, that the anger, the hate that reverberates throughout."}, {"time": 4415, "text": "One of the things I saw in Ukraine is the birth of, at scale of generational hate, not towards administrations or leaders, but towards entire peoples."}, {"time": 4422, "text": "And that hate, I mean, overnight that hate is created and it takes perhaps decades for that hate to dissipate."}, {"time": 4438, "text": "It takes decades and it takes, it takes collective effort to build institutions that divert that hate into other places."}, {"time": 4450, "text": "One of the biggest things I thought was not part of the calculus in when the United States invaded Afghanistan and Iraq is the creation of hate."}, {"time": 4456, "text": "When you drop a bomb, even if it hits military targets, even if it kills soldiers, which in that case it didn't, there's a very large amount of civilians."}, {"time": 4474, "text": "What does that do to the, yeah, like, how many years, minutes, hours, months, and years of hate do you create with a single bomb you drop?"}, {"time": 4485, "text": "And I calculate that like literally in the Pentagon have a chart, how many people will hate us?"}, {"time": 4490, "text": "How many people does it take, do some science here, how many people does it take, when you have a million people that hate you, how many of them will become terrorists?"}, {"time": 4501, "text": "How many of them will do something to the nation you love and care about, which is the United States, will do something that will be very costly?"}, {"time": 4515, "text": "I feel like there was not a plot in a chart."}, {"time": 4515, "text": "It was more about short term effects."}, {"time": 4524, "text": "Yes, it's again, it's the idea of using military force to solve political problems."}, {"time": 4524, "text": "And I think there's a squandering of goodwill that people have around the world toward the United States."}, {"time": 4537, "text": "That's a respect for its economy, for its consumer products, and so forth."}, {"time": 4537, "text": "And I think that's been lost, a lot of that."}, {"time": 4546, "text": "Do you think leaders can stop war?"}, {"time": 4546, "text": "I have perhaps a romantic notion, perhaps because I do these podcasts in person and so on, that leaders that get in a room together and can talk, they can stop war."}, {"time": 4555, "text": "I mean, that's the power of a leader, especially one in an authoritarian regime that they can, through camaraderie, alleviate some of the emotions associated with ego."}, {"time": 4576, "text": "Yes, leaders can stop war if they get into the room when they understand from the masses in their countries that war is something that they want stopped."}, {"time": 4591, "text": "So the people ultimately have a really big say."}, {"time": 4594, "text": "They do, that it was mass movements by people in the United States for the nuclear freeze, even Russia pushing for openness that brought, for example, Ronald Reagan and Mikhail Gorbachev to Reykjavik to sort of debate and eventually sort of put caps on nuclear weapons."}, {"time": 4608, "text": "Those two people made choices in the room that made that possible, but they were both being pushed and knew they were being pushed by their people."}, {"time": 4627, "text": "Boy, that's a tough one."}, {"time": 4627, "text": "It puts a lot of responsibility on the German people, for example."}, {"time": 4635, "text": "In both wars, we fans of history tend to conceive of history as a meeting of leaders."}, {"time": 4635, "text": "We think of Chamberlain, we think of Churchill and the importance of them in the Second World War."}, {"time": 4647, "text": "We think about Hitler and Stalin and think that if certain conversations happen, the war could have been avoided."}, {"time": 4652, "text": "You tell the story of how many times Hitler and Nazi Germany's military might was not sufficient, they could have been easily stopped."}, {"time": 4659, "text": "And the pacifists, the people who believed Hitler or foolish enough to believe Hitler didn't act properly."}, {"time": 4673, "text": "And if the leaders just woke up to that idea, in fact, Churchill is a kind of representation of that."}, {"time": 4681, "text": "But in your conception here, it's possible that Churchill was also a representation of the British people, even though seemingly unpopular."}, {"time": 4686, "text": "That gave birth to somebody like Churchill, who said, we'll never surrender, right?"}, {"time": 4696, "text": "She'll fight in the beaches."}, {"time": 4702, "text": "And I think World War II Britain is a good example of that."}, {"time": 4702, "text": "It is clearly a dynamic leader who has his pulse on what the people want and demand and are willing to do."}, {"time": 4710, "text": "And you know, it's a dynamic art of leading that and shaping those wants at the same time as knowing that you're bound by them."}, {"time": 4727, "text": "Well then if we conceive of history in this way, let me ask you about our presidents."}, {"time": 4733, "text": "You are taking on the impossibly difficult task of teaching a course in a couple of years here or in one year called the history of American presidential elections."}, {"time": 4740, "text": "So if the people are in part responsible for leaders, how can we explain what is going on in America that we have the leaders that we do today?"}, {"time": 4757, "text": "So if we think about the elections of the past several cycles, I guess let me ask, are we a divided nation?"}, {"time": 4762, "text": "Are we more of a divided nation than we were in the past?"}, {"time": 4771, "text": "What do you understand about the American citizen at the beginning of this century from the leaders we have elected?"}, {"time": 4781, "text": "Yes, obviously we are a divided country in our rhetoric, in our day to day politics."}, {"time": 4794, "text": "But we are nowhere near as divided as we have been in other periods in our history, right?"}, {"time": 4801, "text": "The most obvious, of course, being in the American Civil War, 150 years ago."}, {"time": 4801, "text": "And the distinction is not just that we haven't come to blows, but that we are fundamentally one society, one economy, and sort of deeply integrated as a nation, both domestically and on the world stage in ways that look nothing like the United States in 1861."}, {"time": 4826, "text": "Will political rhetoric continue to be extreme?"}, {"time": 4836, "text": "But we're not as divided as people think we are."}, {"time": 4847, "text": "Well, then if you actually look throughout human history, does it always get, so outside of the people, do the elections get as contentious as they've recently been?"}, {"time": 4855, "text": "So there's a kind of perception has been very close and there's a lot of accusations, a lot of tensions."}, {"time": 4862, "text": "It's very heated."}, {"time": 4868, "text": "It's almost fueling the machine of division."}, {"time": 4868, "text": "Has that often been the case?"}, {"time": 4874, "text": "It hasn't, it hasn't."}, {"time": 4874, "text": "I mean, I do think right now is different."}, {"time": 4874, "text": "And there it's worth distinguishing, are there deep social or economic divisions, which I don't actually think that there are, versus partisanship in particular, sort of the rivalry between the two parties."}, {"time": 4891, "text": "And it's very clear that we are in an era of what political scientists call hyper partisanship, right?"}, {"time": 4897, "text": "And that the two parties have taken sort of fundamentally different positions and moved further apart from one another."}, {"time": 4903, "text": "And that is what I think people talk about when they say our country is divided."}, {"time": 4912, "text": "So the country may not be divided even if our politics are highly partisan."}, {"time": 4917, "text": "That is a divergence from other time periods in our history."}, {"time": 4925, "text": "So I wonder if this kind of political partisanship is actually an illusion of division."}, {"time": 4925, "text": "I sometimes feel like we mostly all agree on some basic fundamentals and the things that people allegedly disagree on are really blown out of proportion."}, {"time": 4945, "text": "And there's like a media machine and the politicians really want you to pick a blue side and a red side."}, {"time": 4951, "text": "And because of that, somehow I mean, families break up over Thanksgiving dinner about who they voted for."}, {"time": 4958, "text": "There's a really strong pressure to be the red or blue."}, {"time": 4962, "text": "And I wonder if that's a feature or a bug."}, {"time": 4962, "text": "Whether this is just part of the mechanism of democracy that we want to, even if there's not a real thing to be divided over, we need to construct it such that you can always have attention of ideas in order to make progress, to figure out how to progress as a nation."}, {"time": 4988, "text": "I think we're figuring that out in real time."}, {"time": 4988, "text": "On the one hand, it's easy to say that it's a feature of a political system that has two parties."}, {"time": 4993, "text": "And the United States is in some ways unique in not being a parliamentary democracy."}, {"time": 5001, "text": "And so in some ways, you would think that would be the feature that is causing partisanship and to reach these heights."}, {"time": 5008, "text": "That said, we can even see in parliamentary systems all around the world that the same kinds of rhetorics of irreconcilable division, a kind of politics of emotion are proliferating around the world."}, {"time": 5033, "text": "Some of that, as you say, I think is not as real as it appears on television, on social media and other formats."}, {"time": 5041, "text": "I don't know that other countries that are experiencing political conflict, I'm not sure that they're deeply divided either."}, {"time": 5052, "text": "So I've had the fortune of being intellectually active through the George Bush versus Al Gore election, then the Obama and it's just every election since."}, {"time": 5063, "text": "And it seems like a large percentage of those elections, there's been a claim that the elections were rigged, that there is some conspiracy, corruption, malevolence on the other side."}, {"time": 5076, "text": "I distinctly remember when Donald Trump won in 2016, a lot of people I know said that election was rigged and there's different explanations, including Russian influence."}, {"time": 5092, "text": "And then in 2020, I was just running in Austin along the river and somebody said like, oh, huge fan of the podcast."}, {"time": 5099, "text": "And they said like, what do you think of it?"}, {"time": 5107, "text": "This is just not right."}, {"time": 5107, "text": "What's happening in this country that the 2020 election was obviously rigged from their perspective in electing Joe Biden versus Donald Trump."}, {"time": 5121, "text": "Do you think there's a case to be made for and against each claim in the full context of history of our elections being rigged?"}, {"time": 5134, "text": "I think the American election system is fundamentally sound and reliable."}, {"time": 5134, "text": "And I think that the evidence is clear for that regardless of which election you're looking at."}, {"time": 5149, "text": "In some ways, whether you look at a presidential election or even a local county election for dog catcher or something, that the amount of time and resources and precision that go into voter registration, vote counting, certification processes are crucial to democratic institutions."}, {"time": 5182, "text": "I think when someone says rigged, regardless of which side of the political spectrum they're coming from, they're looking for an answer."}, {"time": 5189, "text": "They're looking for that one answer for what is in fact a complex system."}, {"time": 5199, "text": "So on the left, when they say rigged, they may be pointing to a wide range of ways in which they think that the system is tilted through gerrymandering, misrepresentation through the electoral college."}, {"time": 5221, "text": "On the right, when people say rigged, they may be concerned about voter security, about ways in which the mainstream media may control messages."}, {"time": 5237, "text": "And in both cases, the feeling is it's articulated as my vote didn't get counted right."}, {"time": 5249, "text": "But the deeper concern is my vote doesn't count."}, {"time": 5249, "text": "My voice isn't being heard."}, {"time": 5249, "text": "So no, I don't think the elections are rigged."}, {"time": 5263, "text": "So let me sort of push back, right?"}, {"time": 5263, "text": "There's a comfort to the story that they're not rigged."}, {"time": 5270, "text": "And a lot of us like to live in comfort."}, {"time": 5270, "text": "So people who articulate conspiracy theories say, sure, it's nice to be comfortable, but here's the reality."}, {"time": 5275, "text": "And the thing they articulate is there's incentives in close elections, which we seem to have nonstop close elections."}, {"time": 5287, "text": "There's so many financial interests."}, {"time": 5287, "text": "There's so many powerful people."}, {"time": 5287, "text": "Surely you can construct not just with the media and all the ways you describe both on the left and the right, the elections could be rigged, but literally actually in a fully illegal way manipulate the results of votes."}, {"time": 5308, "text": "Surely there's incentive to do that."}, {"time": 5308, "text": "And I don't think that's a totally ridiculous argument because it's like, all right, well, I mean, it actually lands to the question, which is a hard question for me to ask as an optimist of how many malevolent people out there and how many malevolent people are required to rig an election."}, {"time": 5332, "text": "So how many, what is the face transition for a system to become from like a corruption light to high level of corruption such that you could do things like rig elections, which is what happens quite a lot in many nations in the world even today."}, {"time": 5360, "text": "So yes, there is interference in elections and there has been in American history."}, {"time": 5360, "text": "And we can go all the way back into the 18th century."}, {"time": 5364, "text": "You don't have to go back to Texas in the 1960s, LBJ to find examples of direct interference in the outcome of elections."}, {"time": 5371, "text": "And there are incentives to do that."}, {"time": 5379, "text": "Those incentives will only feel more existential as hyper partisanship makes people think that the outcome of the elections are a matter of black and white or life and death."}, {"time": 5396, "text": "And you will see people organizing every way they can to shape elections."}, {"time": 5407, "text": "We saw this in the 1850s when settlers, pro and anti slavery, flooded into Kansas to try to determine the outcome of an election."}, {"time": 5415, "text": "We see this in the reconstruction period, right?"}, {"time": 5422, "text": "When the Ku Klux Klan shows up to block the doors for black voters in the South."}, {"time": 5422, "text": "This history is not new, it's there."}, {"time": 5430, "text": "I think the reason why I think that the system is sound is not..."}, {"time": 5439, "text": "When I say I believe that the election system is fundamentally sound, I'm not trying to be reassuring or encourage complacency, right?"}, {"time": 5449, "text": "I'm saying this is something that we need to do and to work on."}, {"time": 5458, "text": "So the current electoral mechanisms are sufficiently robust."}, {"time": 5458, "text": "Even if there is corruption, even if there is rigging, the force that self corrects and ensures that nobody gets out of line is much stronger than the other incentives, which are the corrupting incentives."}, {"time": 5473, "text": "And that's the thing I talked about visiting Ukraine, talking about corruption, where a lot of people talk about corruption as being a symptom."}, {"time": 5485, "text": "If the system allows, creates these incentives for there to be corruption, humans will always go for corruption."}, {"time": 5494, "text": "That's just, you have to assume that."}, {"time": 5498, "text": "The power of the United States is that it constructs systems that prevent you from being corrupt at scale."}, {"time": 5504, "text": "At least, I mean, it depends what you believe of most of us."}, {"time": 5507, "text": "If you believe in this country, you have to... You believe in the self correcting mechanisms of corruption, that even if that desire is in the human heart, the system resists it, prevents it."}, {"time": 5521, "text": "That's your current belief."}, {"time": 5527, "text": "Yes, as of today."}, {"time": 5527, "text": "But I do think that that will require oversight by institutions, ideally ones that are insulated as much as possible from partisan politics, which is very difficult right now."}, {"time": 5544, "text": "And it will require the demands of the American people that they want these elections to be fair and secure."}, {"time": 5552, "text": "And that means being willing to lose them, regardless of which party you're in favor of."}, {"time": 5563, "text": "So what do you think about the power of the media to create partisanship?"}, {"time": 5563, "text": "I'm really worried that there's a huge incentive, speaking of incentives, to divide the country."}, {"time": 5569, "text": "The media and the politicians, I'm not sure where it originates, but it feels like it's the media."}, {"time": 5580, "text": "Maybe it's a very cynical perspective on journalism, but it seems like if we're angry and divided as evenly as possible, you're going to maximize the number of clicks."}, {"time": 5586, "text": "So it's almost like the media wants to elect people that are going to be the most divisive, maximizing."}, {"time": 5591, "text": "And the worry I have is they are not beyond either feeding or, if you want to be very cynical, manufacturing narratives that lead that division, like the narrative of an election being rigged."}, {"time": 5614, "text": "Because if you convinced half the populace that the election was completely rigged, that's a really good way to get a lot of clicks."}, {"time": 5619, "text": "And the very cynical view is I don't know if the media machine will stop the destruction of our democracy in service of getting more clicks."}, {"time": 5637, "text": "It may destroy our entire democracy just to get more clicks, just because the fire as the thing burns down will get clicks."}, {"time": 5644, "text": "Am I putting too much blame on the media here?"}, {"time": 5653, "text": "The machine of it?"}, {"time": 5654, "text": "You're diagnosing the incentive structure, you're depicting that with 100% accuracy."}, {"time": 5662, "text": "But I think history teaches that you might be giving the media too much sort of causal power, that the American people are smarter than the media that they consume."}, {"time": 5668, "text": "Even today, we know that."}, {"time": 5679, "text": "Even people who consume just Fox or just MSNBC know what they're consuming."}, {"time": 5690, "text": "So I don't think that media will be the solution."}, {"time": 5690, "text": "And I certainly don't think that returning to a media structure of the mid 20th century with three news channels that all tell us one story, that's no golden age that we're trying to get back to, for sure."}, {"time": 5711, "text": "Well, there is a novel thing in human history, which is Twitter and social media and so on."}, {"time": 5718, "text": "So we're trying to find our footing as a nation to figure out how to think about politics, how to maintain our basic freedoms, our sense of democracy, of our interaction with government and so on, on this new medium of social media."}, {"time": 5734, "text": "Do you think Twitter, how do you think Twitter changed things?"}, {"time": 5742, "text": "Do you think Twitter is good for democracy?"}, {"time": 5742, "text": "Do you think it has changed what it means to be an American citizen?"}, {"time": 5749, "text": "Or is it just the same old media mechanism?"}, {"time": 5756, "text": "It has not changed what it means to be an American citizen."}, {"time": 5756, "text": "It may have changed the day to day sound of being and the experience of it."}, {"time": 5765, "text": "It got noisier, it got louder and it got more decentered."}, {"time": 5774, "text": "I think Twitter, it's paradoxical."}, {"time": 5774, "text": "On the one hand, it is a fundamentally democratic platform."}, {"time": 5783, "text": "And in some ways, it democratizes institutions that had gatekeepers and authority figures for a very long time."}, {"time": 5793, "text": "But on the other hand, it's not a democratic institution at all."}, {"time": 5797, "text": "It's a for profit corporation."}, {"time": 5797, "text": "And it operates under those principles."}, {"time": 5797, "text": "And so that said, it's an institution of American and global life that the people of the United States have the authority to regulate or reshape as they see fit, both that and other major media players."}, {"time": 5823, "text": "So one of the most dramatic decisions that illustrate both sides of what you're saying is when Twitter decided to ban, I think permanently, the President of the United States, Donald Trump off of Twitter."}, {"time": 5834, "text": "Can you make the case that that was a good idea and make the case that that was a bad idea?"}, {"time": 5841, "text": "Can you see both perspectives on this?"}, {"time": 5845, "text": "Yes, I think, I mean, the simple fact of the matter is, you know, Twitter is a platform, it has rules of service."}, {"time": 5851, "text": "Twitter concluded that President Trump had violated the terms of service and blocked him, right?"}, {"time": 5858, "text": "And if you have rules, you have to enforce them."}, {"time": 5864, "text": "Did it have, you know, did it have consequences?"}, {"time": 5864, "text": "It had direct and predictable consequences, you know, that of creating a sense among millions of Americans that Twitter had taken a side in politics or confirming their belief that it had done so."}, {"time": 5884, "text": "Will it have unintended consequences?"}, {"time": 5892, "text": "You know, this is where the historian can come in and say, yes, there's always unintended consequences."}, {"time": 5897, "text": "And we don't know, you know, sort of what it would mean for political figures to be excluded from various media platforms under sort of under these notions, right, that they had violated terms of service, etc."}, {"time": 5914, "text": "So, you know, so I guess we'll see, I guess."}, {"time": 5921, "text": "Well, to me, so I'm generally against censorship."}, {"time": 5921, "text": "But to take Twitter's perspective, it's unclear to me, in terms of unintended consequences, whether censoring a human being from being part of your platform is going to decrease or increase the amount of hate in the world."}, {"time": 5945, "text": "So there's a strong case to be made that banning somebody like Donald Trump increases the amount of resentment among people, and that's a very large number of people that support him, or even love him, or even see him as a great president, one of the greatest this country has had."}, {"time": 5963, "text": "And so if you completely suppress his voice, you're going to intensify the support that he has, from just the regular support for another human being who ran for president, to somebody that becomes an almost heroic figure for that set of people."}, {"time": 5976, "text": "Now, the flipside is removing a person from a platform like Donald Trump might lessen the megaphone of that particular person, might actually level the democratic notion that everybody has a voice."}, {"time": 5999, "text": "So basically, removing the loud extremes is helpful for giving the center, the calm, the thoughtful voices more power."}, {"time": 6008, "text": "And so in that sense, that teaches a lesson that don't be crazy in any one direction."}, {"time": 6014, "text": "Don't go full, don't go Lenin, don't go Hitler, don't, don't, like you have to stay in the middle."}, {"time": 6023, "text": "There's divisions in the middle, there's discussions in the middle, but stay in the middle."}, {"time": 6027, "text": "That's sort of the steel man the case for, for censoring."}, {"time": 6034, "text": "But I, boy, is censorship a slippery slope."}, {"time": 6034, "text": "And also boys Twitter becoming a thing that's more than just a company."}, {"time": 6044, "text": "It seems like it's a medium of communication that we use for, for information, for, for knowledge, for wisdom even, you know, during the period of COVID, we use that to gain an understanding of what the hell's going on."}, {"time": 6059, "text": "What should we do?"}, {"time": 6059, "text": "What's the state of the art science?"}, {"time": 6063, "text": "Science fundamentally transformed during the time of COVID because you have no time for the full review cycle that science usually goes through."}, {"time": 6068, "text": "And some of the best sources of information for me, from the conspiracy theory to the best doctors was Twitter."}, {"time": 6079, "text": "The data, the stats, all that kind of stuff."}, {"time": 6079, "text": "And that feels like, like more than a com more than a company."}, {"time": 6085, "text": "And then Twitter and YouTube and different places took a really strong stance on COVID, which is the lazy stance in my opinion, which is we're going to listen to whatever CDC or the institutions have said."}, {"time": 6096, "text": "But the reality is you're an institution of your own now."}, {"time": 6103, "text": "You're kind of the press."}, {"time": 6103, "text": "You're like, there's a, there's a, it's, it's a really difficult position."}, {"time": 6111, "text": "It's a really, really difficult position to take."}, {"time": 6111, "text": "But I wish they've stepped up and take on the full responsibility and the pain of fighting for the freedom of speech."}, {"time": 6122, "text": "Yes, they need, they need to do that."}, {"time": 6122, "text": "But you know, I'm struck by some of the things that you said, ways in which, you know, Twitter has the power to shape the conversation."}, {"time": 6134, "text": "And I don't think in a democratic society, democratic policies should cede that power to, to for profit companies."}, {"time": 6150, "text": "Do you agree that it's possible that Twitter has that power currently?"}, {"time": 6150, "text": "Do you sense that it has the power?"}, {"time": 6158, "text": "Is that my sense is Twitter has the power to start wars, like tweets have the power to start wars to, to, yeah, to, to change the direction of elections?"}, {"time": 6170, "text": "Maybe in the sense in the ways in which, you know, a wave has the power to wash away sand, right?"}, {"time": 6176, "text": "You know, it's, it's the, it's still the medium, right?"}, {"time": 6176, "text": "It's not, it's not in itself an actor."}, {"time": 6182, "text": "It's how actors use the platform, which requires us to scrutinize the structure of the platform and access to it."}, {"time": 6187, "text": "Unfortunately, it's not, maybe it's similar to the wave."}, {"time": 6191, "text": "It's not just a medium."}, {"time": 6191, "text": "It's a, it's a medium plus, it's a medium that enables virality that benefits from virality of engagement."}, {"time": 6200, "text": "And that means singular voices can, can have a disproportionate impact, like not even voices, singular ideas, dramatic ideas can have a disproportionate impact."}, {"time": 6216, "text": "And so that actually threatens, it's almost like I don't know what the equivalent is in nature, but it's a, it's a wave that can grow exponentially because of the intensity of the, the initial intensity of the wave."}, {"time": 6228, "text": "I don't know how to describe this as a dynamical system, but it feels like, it feels like there, there is a responsibility there not to accelerate, not to accelerate voices just because they get a lot of engagement."}, {"time": 6245, "text": "You have to have a proportional representation of that voice."}, {"time": 6245, "text": "But you're saying that a strong democracy should be robust to that."}, {"time": 6253, "text": "A strong democracy can and should, and will be."}, {"time": 6253, "text": "I mean, I think the other thing a historian will tell you about Twitter is that this too shall pass, right?"}, {"time": 6264, "text": "But, but I do think, you know, the structures of, of the, of the platform of the algorithm of, of this and other major players are, are eligible for scrutiny by, by democratic institutions."}, {"time": 6279, "text": "So in preparing to teach the course, the history of American presidential elections leading up to the 2024 elections."}, {"time": 6285, "text": "So one of the lessons of history is this too shall pass."}, {"time": 6292, "text": "So don't make everything about, this is, this is going to either save or destroy our nation."}, {"time": 6297, "text": "That seems to be like the message of every single election."}, {"time": 6297, "text": "As I'm doing Trump hands."}, {"time": 6303, "text": "Do you think Donald Trump, what do you think about the 2024 election?"}, {"time": 6308, "text": "Do you think Donald Trump runs?"}, {"time": 6308, "text": "Do you think the, the tension will grow?"}, {"time": 6308, "text": "Or was that a singular moment?"}, {"time": 6318, "text": "Do you think you'll be like AOC versus Trump or whoever, whatever the most maximum drama maximizing thing?"}, {"time": 6325, "text": "Or will things stabilize?"}, {"time": 6330, "text": "I think I can, I can, you know, historians don't like to predict the future, but I can predict this one that it will not be a calm and, and, and stabilized election."}, {"time": 6334, "text": "I think as of, you know, the time that we're talking in 2022, we don't, there are too many you know, sort of open questions, particularly about whether Joe Biden will run for reelection."}, {"time": 6350, "text": "He says he will, but you know, but the jury I think is out on that."}, {"time": 6350, "text": "You know, I, I can't predict whether Donald Trump will run for, for election or not."}, {"time": 6358, "text": "I think you know, we do know that, that, that president Trump doesn't like to, to start things he can't win."}, {"time": 6365, "text": "And if the polling data suggests that he's not a credible candidate, he might be reluctant to enter the race and might might find more appealing, the kind of sideline kind of King maker role that he's been crafting since he left the White House."}, {"time": 6386, "text": "You know, I think there are plenty of people who are you know, dreaming that there's some sort of centrist candidate you know, you know whether it's a conservative Democrat or a liberal Republican who will you know, save us from, from, from all of this either within the party or in a third party run."}, {"time": 6410, "text": "I don't think that's likely."}, {"time": 6413, "text": "Why aren't we getting them?"}, {"time": 6413, "text": "Why don't you think it's likely?"}, {"time": 6413, "text": "What's the explanation?"}, {"time": 6416, "text": "This seems to be a general hunger for a person like this."}, {"time": 6419, "text": "You would, but the system sorts it out, right?"}, {"time": 6419, "text": "You know, that the, the, that the primary systems and the party you know, party candidate selection systems you know, will favor sort of more, you know, more partisan views, right?"}, {"time": 6429, "text": "More conservative Republicans, more liberal Democrats as the kind of center candidates."}, {"time": 6438, "text": "It seems like the system prefers mediocre executor, mediocre leaders, mediocre partisan leaders."}, {"time": 6446, "text": "If I had to take a cynical look, but maybe I'm romanticizing the leaders of the past and maybe I'm just remembering the great leaders of the past."}, {"time": 6451, "text": "And yeah, I can assure you there's plenty of mediocre partisans in the 19th century."}, {"time": 6461, "text": "In the 20th."}, {"time": 6461, "text": "Well, let me ask you about platforming."}, {"time": 6461, "text": "Do you think Donald, it's the Twitter question, but I was torn about whether to talk to Donald Trump on this podcast."}, {"time": 6472, "text": "As a historian, what would you advise?"}, {"time": 6481, "text": "I think, I mean, you know, this is a, this is a difficult question, right?"}, {"time": 6481, "text": "For, for historians who want, you know, sort of want to make sure that they know sort of what Americans are thinking and talking about, you know, for centuries later."}, {"time": 6495, "text": "So one of the things that, you know, at least my understanding is that when President Trump was banned from Twitter, his account was also deleted."}, {"time": 6507, "text": "And that is one of the most valuable sources that historians will use to understand that the era and parts of it were sort of, you know, archived and reconstructed."}, {"time": 6520, "text": "But, you know, but in that sense, I think that that is also a real loss to the historical record."}, {"time": 6525, "text": "I mean, I think that your podcast shows you'll, you'll talk to, you'll talk to anyone."}, {"time": 6531, "text": "I'm here, right?"}, {"time": 6531, "text": "So, you know, I'm not in the business of saying, you know, don't, don't, don't talk, don't talk."}, {"time": 6541, "text": "That's one of the difficult things when I think about Hitler."}, {"time": 6541, "text": "I think Hitler, Stalin, I don't know if World War I quite has the same intensity of controversial leaders."}, {"time": 6546, "text": "But one of the sad things from a historian perspective is how few interviews Hitler has given or Stalin has given."}, {"time": 6561, "text": "And that's such a difficult thing because it's obvious that talking to Donald Trump, that talking to Xi Jinping, talking to Putin is really valuable from a historical perspective to understand."}, {"time": 6575, "text": "But then you think about the momentary impact of such a conversation and you think, well, depending on how the conversation goes, you could steer or a flame."}, {"time": 6586, "text": "Feed the flame of war or conflict or, um, abuses of power and things like this."}, {"time": 6599, "text": "And that's, I think the tension between the journalist and the historian, because when a journalist interview dictators, for example, one of the things that strikes me is they're often very critical of the dictator."}, {"time": 6611, "text": "They're, they're, they're like, um, they're basically attacking them in front of their face as opposed to trying to understand."}, {"time": 6626, "text": "Because what I perceive they're doing is they're signaling to the other journalists that they're on the right side of history kind of thing."}, {"time": 6632, "text": "Um, but that's not very productive."}, {"time": 6637, "text": "That's also why the dictators and leaders often don't do those interviews."}, {"time": 6637, "text": "It's not productive to understanding who the human being is."}, {"time": 6642, "text": "To understand, you have to empathize."}, {"time": 6647, "text": "Because few people, I think few leaders do something from a place of malevolence."}, {"time": 6647, "text": "I think they really do think they're doing good."}, {"time": 6654, "text": "And not even for themselves, not even for selfish reasons."}, {"time": 6659, "text": "I think they're doing great for the, they're doing the right thing for their country or for whoever the group they're leading."}, {"time": 6666, "text": "And to understand that you have to, and, and by the way, a large percent of the country often supports them."}, {"time": 6670, "text": "I bet if you poll legitimately poll people in North Korea, they will believe that their leader is doing the right thing for their country."}, {"time": 6683, "text": "Um, and so to understand that you have to empathize."}, {"time": 6683, "text": "So that's the tension of the journalist, I think, and the historian, cause obviously the historian doesn't, doesn't care."}, {"time": 6694, "text": "They really want to, they care obviously deeply, but they, they know that history requires deep understanding of the human being in the full context."}, {"time": 6699, "text": "Uh, yeah, it's a tough decision to make."}, {"time": 6707, "text": "Well, I think it's, uh, both for journalists and historians, um, the challenge is not to be too close to your subject, right?"}, {"time": 6712, "text": "Um, and you know, not to be, um, overly influenced and used by them, right?"}, {"time": 6719, "text": "You know, when you're talking to a living subject, which historians do, you know, um, to, um, you know, it's, it's a matter of making sure that you triangulate their story with, with the rest of the record, right?"}, {"time": 6731, "text": "Um, uh, and that may paint a different picture of, of the person then, um, and will prevent you as a journalist or a historian from kind of, you know, just telling someone else's story."}, {"time": 6743, "text": "And so, and historians also have the benefit of going back, you know, 30, 40 years and finding all the other stories and figuring out, you know, uh, playing two truths and a lie, you know, which parts are, you know, which parts are accurate, which are, which are not."}, {"time": 6760, "text": "And journalists do that work in a day to day basis, but historians, um, you know, we get a little more time to think about what we're doing."}, {"time": 6770, "text": "Well, I, I personally also think it's deeply disrespectful to the populace, to people, to um, censor and ignore a person that's supported by a very large number of people."}, {"time": 6777, "text": "Like that you owe, I personally feel like you owe the citizens of this country a deep, uh, empathy and understanding of the leaders they support, even if you disagree with what they say."}, {"time": 6796, "text": "I mean, that's the, the, to me, I'm much more worried about the resentment of the censorship, um, that it's to having a good conversation with Donald Trump is, is ultimately valuable."}, {"time": 6814, "text": "Uh, because he, I think, uh, especially in this case, I agree with you that Donald Trump is not a singular person."}, {"time": 6821, "text": "He is a, he represents a set of feelings that a large number of people have and whatever those feelings are, you can try to figure out by talking to people, but also talking to the, the, the, the man and then seeing the interplay there, what does this really represent in this period in history, in this slice of the world?"}, {"time": 6837, "text": "Um, yeah, ultimately understanding, I think leads to, uh, compassion and love and unity, which is how this whole thing progresses."}, {"time": 6851, "text": "The tension between the different sides is useful to, um, have a good conversation, but ultimately coming up with the right answer and progressing towards that answer is, is how you make progress."}, {"time": 6861, "text": "Do you think a pure democracy can work?"}, {"time": 6861, "text": "So we have this representative of democracy with these contentious elections and so on."}, {"time": 6868, "text": "When we start a civilization on Mars, which becomes more and more realistic technologically, we can have a more direct access to be able to vote on issues and vote for ideas."}, {"time": 6881, "text": "Do you think it can work?"}, {"time": 6887, "text": "I don't think we have to go to Mars, uh, to do it."}, {"time": 6887, "text": "Um, uh, I think, um, the answer is not, you know, to flip a switch and turn on something called pure democracy."}, {"time": 6900, "text": "Um, uh, when people are not ready for it, when their, uh, incentive structures are not sort of structured for it, but you can, um, you know, experiment with more democratic forms of governance one after another, right?"}, {"time": 6912, "text": "Whether it's, um, you know, sort of experimenting with, um, technology to find new ways of sort of, of getting, uh, greater rates of participation in democracy."}, {"time": 6925, "text": "Um, I think that we see some experiments in, um, sort of more complicated systems of voting, um, that in fact might actually be more reflective of people's choices than simply picking one candidate, right?"}, {"time": 6938, "text": "Sort of ranked choice voting or, uh, runoffs, other kinds of things."}, {"time": 6943, "text": "Um, you know, I think that we can think more, uh, creatively about something like participatory budgeting, right?"}, {"time": 6949, "text": "In which, um, you know, uh, we put all this money into the government."}, {"time": 6953, "text": "Um, and then, um, you know, we, we, um, you know, should, as a, as a people, there are more democratic ways of, of sort of, of how we spend it."}, {"time": 6958, "text": "Um, and I think the most urgent in some level is a more, uh, democratic form of foreign policymaking, right?"}, {"time": 6966, "text": "That foreign policymaking, decision making, um, uh, about the military, about foreign policy, um, is, is very ways insulated from, from popular participation, um, in, in modern American history."}, {"time": 6978, "text": "Um, and I think, you know, there, uh, technology is not the, the going to solve this."}, {"time": 6984, "text": "Um, you know, it's a combination of technology and, and human creativity, but I think, um, you know, I think we can start heading that direction."}, {"time": 6995, "text": "Whether we get there before we get to Mars, I don't, I don't know."}, {"time": 6998, "text": "What interesting lessons and thoughts, if you look at the fundamentals of the history of American elections, do you hope to reveal when you try to teach the class?"}, {"time": 7003, "text": "And, um, how would those fundamentals be met by the, by the students that received that wisdom?"}, {"time": 7020, "text": "So what do you think about this dance?"}, {"time": 7020, "text": "It's such an interesting idea."}, {"time": 7020, "text": "And I hope you do go through with this kind of idea is look at the history while the next one is happening."}, {"time": 7031, "text": "I think, you know, it's worth remembering, right?"}, {"time": 7031, "text": "That the students who are typical American student who's in college right now, right?"}, {"time": 7040, "text": "Has lived their entire life after, uh, the election of 2000 and Bush V Gore, right?"}, {"time": 7047, "text": "Um, and after nine 11 probably."}, {"time": 7047, "text": "And yeah, absolutely."}, {"time": 7054, "text": "After all of, after all of these things."}, {"time": 7054, "text": "And, and, um, so on the one hand they take partisanship and contentious elections for granted."}, {"time": 7061, "text": "Um, they don't, I think share, um, you know, sort of some vision that things were, you know, things used to be different, right?"}, {"time": 7075, "text": "They don't remember a world that had like lots of moderate Democrats and liberal Republicans and, um, you know, sort of running around in it."}, {"time": 7080, "text": "Um, but, um, you know, so in some ways it's a way of, of looking back into the past to find other ways of, of, of organizing our politics."}, {"time": 7092, "text": "Uh, it's also a way of, of reassuring students that we have been through contentious and even, um, sort of violent elections before in our history."}, {"time": 7100, "text": "Um, and you know, that people have defended the right to vote, right?"}, {"time": 7106, "text": "People have risked their lives to vote."}, {"time": 7106, "text": "Um, uh, you know, I think they will, they will understand that, that as well."}, {"time": 7116, "text": "And maybe knowledge of history here can help deescalate the emotions you might feel about one candidate or another."}, {"time": 7124, "text": "And I, from a place of calmness, you can more easily arrive at wisdom."}, {"time": 7132, "text": "Uh, that, that's my hope."}, {"time": 7137, "text": "Just as a brief aside, you, brief aside, but nevertheless, uh, you wrote the book Bound by War that describes a century of war in the Pacific."}, {"time": 7142, "text": "So looking at this slice of geography and power, uh, so most crucially through the partnership between the United States and the Philippines, can you tell us some aspect of the story that is often perhaps not considered when you start to look more at the geopolitics of Europe and Soviet Union and the United States?"}, {"time": 7171, "text": "What, how did the, the war in, in the Pacific define the 20th century?"}, {"time": 7177, "text": "Yeah, I came to this book Bound by War, um, from a sense that, um, that our stories were too lopsided, um, toward, toward Europe, right?"}, {"time": 7184, "text": "That American history, when viewed from the Pacific, um, specifically in the 20th century, um, helps us understand American power, um, in some new ways, right?"}, {"time": 7197, "text": "Uh, not only American, uh, projection of power into Asia, right?"}, {"time": 7204, "text": "But also the ways in which American power affected, uh, people in Asia, right?"}, {"time": 7204, "text": "Um, either as, uh, you know, in places like the Philippines where the United States, uh, had a colony for almost 50 years or Asian Americans, people who had migrated over their descendants in the United States."}, {"time": 7220, "text": "And those linkages, uh, between the United States and Asia, uh, particularly, uh, the U S Philippine connection, I think were something that needed to be traced across the 20th century."}, {"time": 7230, "text": "Cause it's a way kind of a new way of seeing American power, you know, from, from a different angle, uh, you see it in, in that way."}, {"time": 7239, "text": "There's some aspect that define America from, from when you take the perspective of the Pacific, what, what military conflict and, and the asymmetry of power there, right?"}, {"time": 7250, "text": "So I start in, uh, in 1898, um, you know, with the U S invasion of the Philippines, um, uh, it's a conquest and annexation."}, {"time": 7256, "text": "Uh, and I think in many ways, this is a defining conflict of the 20th century."}, {"time": 7262, "text": "That's often completely overlooked or described, uh, I think incorrectly as merely a war with Spain, right?"}, {"time": 7267, "text": "That the war in the Philippines, um, is our, uh, our first extended overseas conflict, our first conflict, um, in what would come to be called the developing world or third world."}, {"time": 7278, "text": "Uh, it's a form of, of counter insurgency."}, {"time": 7283, "text": "Um, you know, this is the U S army sort of learning lessons that are then repeated again in the second world war in Korea, Vietnam, and, and even after 9 11."}, {"time": 7293, "text": "Is the Philippines our friends or enemies in this history?"}, {"time": 7296, "text": "Well, that's the interesting part, right?"}, {"time": 7296, "text": "Is that, uh, the book focuses in particular on Filipinos, uh, who fight with the Americans who fought, you know, sort of in the U S army and Navy, um, over the course of the 20th century."}, {"time": 7305, "text": "And they are in a fundamentally ironic position, right?"}, {"time": 7310, "text": "They are, they are from the Philippines and they're fighting for the United States, um, which is the colonial power, uh, occupying their country."}, {"time": 7314, "text": "Um, and I think that, that irony persists, right?"}, {"time": 7320, "text": "Um, so if you look at sort of polling data where they ask people all around the world, you know, you know, do you think positively or negatively about the United States?"}, {"time": 7329, "text": "Um, that the highest, uh, responses are from the Philippines, right?"}, {"time": 7336, "text": "Filipinos view the United States more favorably than people from any other country in the world, including America, right?"}, {"time": 7341, "text": "That, that they're more think more favorably of Americans than Americans do."}, {"time": 7346, "text": "Um, and so, you know, sort of unpacking that irony is, is part of what I'm trying to get at in the book."}, {"time": 7352, "text": "What was the people power revolution and what lessons can we learn from it?"}, {"time": 7352, "text": "You kind of assign an important, um, a large value to it in terms of what we can learn for the, uh, the American project."}, {"time": 7367, "text": "So in 1986, um, the, the president of the Philippines, Ferdinand Marcos is overthrown by a popular revolution known as people power, um, uh, in the wake of a contested and probably, uh, almost certainly rigged election, um, that, that sort of, uh, you know, kind of confirms his, his, his rule."}, {"time": 7385, "text": "Um, when that is over, overturned through sort of mass movements in the Philippines, it's also, uh, sort of confirmed in many ways by the, the reluctance of the United States to intervene, to prop up a cold war ally."}, {"time": 7397, "text": "Ferdinand Marcos had supported American policy throughout, um, his administration."}, {"time": 7403, "text": "Um, the Reagan administration, Ronald Reagan's president at the time, basically chooses not to support him."}, {"time": 7408, "text": "That's a personally wrenching decision for, for Reagan himself."}, {"time": 7413, "text": "Um, but it, it he's being shaped in many ways by the emerging voices of neoconservative political, uh, foreign policy voices."}, {"time": 7419, "text": "Um, in particular, uh, Paul Wolfowitz and the state department and others who see sort of movements for democracy and democratization that then kind of, uh, take fire in the late 20th century in Latin America, um, in South Korea, in Eastern Europe, um, and, you know, all around the world until it hits the wall in, in Tiananmen Square in June, 1989."}, {"time": 7447, "text": "Well, what's that wall?"}, {"time": 7447, "text": "Uh, what's, what's the wall, what's the, what, what do you mean by it hits the wall?"}, {"time": 7453, "text": "So there are, you know, the, there are global movements for pot for democratization, um, for, for, uh, opening up, um, you know, throughout the world, um, starting in the 1980s."}, {"time": 7462, "text": "Um, and, you know, obviously they continue, um, in Eastern Europe with the fall of the Berlin wall in 1989."}, {"time": 7467, "text": "Um, you know, I say it hits the wall in, in, in China, um, in, with the protests in Tiananmen Square and that are, that are blocked, um, and that are crushed."}, {"time": 7478, "text": "And I think represent, uh, a real sort of turning point, um, in the history of, of democratic institutions, uh, on a global scale in the late 20th century."}, {"time": 7490, "text": "So there's some places where the fight for freedom will work and some places not."}, {"time": 7490, "text": "And that's the kind of lesson from the 20th to take forward to the 21st century."}, {"time": 7504, "text": "Uh, no, I think the lesson is, is maybe one that, that, you know, we talked about earlier that there's this dynamic dance between, um, between leaders, whether, uh, totalitarian leaders or leaders of democratic movements and the people that they're leading."}, {"time": 7515, "text": "Um, and some, you know, sometimes it works and sometimes, sometimes it doesn't."}, {"time": 7524, "text": "Let me ask a big, ridiculous question because we talked about, uh, sort of presidential elections."}, {"time": 7529, "text": "Um, now this is objectively, definitively, you have to answer one person."}, {"time": 7529, "text": "Who is the greatest president in American history?"}, {"time": 7536, "text": "Oh, that's easy."}, {"time": 7539, "text": "Abraham Lincoln."}, {"time": 7541, "text": "Is that easy?"}, {"time": 7541, "text": "Not George Washington?"}, {"time": 7543, "text": "Um, you know, Washington had his, uh, had the statesman qualities."}, {"time": 7543, "text": "He understood his power as, as, uh, as the first president."}, {"time": 7553, "text": "Also relinquished power."}, {"time": 7554, "text": "He was willing to relinquish power."}, {"time": 7581, "text": "Um, and you know, I mean, he, uh, gets the United States through the civil war."}, {"time": 7587, "text": "So you gotta give him some credit for that."}, {"time": 7592, "text": "And he's pretty good at making speeches."}, {"time": 7594, "text": "Uh, it, you know, obviously it helps that he's, uh, uh, a remarkable speaker, um, and able to convey those kinds of visions."}, {"time": 7599, "text": "Um, but, um, you know, but he, but he is first and foremost a politician, um, and probably the best one we have."}, {"time": 7609, "text": "Both at getting elected and at ruling."}, {"time": 7612, "text": "In some ways better, better at the doing than at the getting elected, right?"}, {"time": 7612, "text": "Um, you know, that he, uh, you know, the election of 1860 is a, it's just a hot mess."}, {"time": 7617, "text": "Um, you know, that that could have worked out, um, many different ways."}, {"time": 7623, "text": "And even the election of 1864, um, you know, when we have a presidential election in the middle of a civil war, um, it was not a foregone conclusion that Lincoln would be reelected."}, {"time": 7633, "text": "Um, so, you know, both times he's sort of, um, you know, he's not a, a master campaigner, um, by, by any means, but he, he was a master politician as a, as a governor."}, {"time": 7649, "text": "Do we have leaders like that today?"}, {"time": 7649, "text": "Is, is that, so one perspective is like, well, leaders aren't, ain't what they used to be."}, {"time": 7655, "text": "And then another perspective is, well, we always romanticize stuff that happens in the past."}, {"time": 7660, "text": "We forget the flaws and remember the great moments."}, {"time": 7666, "text": "Uh, both of those things are true, right?"}, {"time": 7666, "text": "Um, on the one hand, um, you know, we, we don't, uh, we are not surrounded by people of, of Lincoln's caliber, um, right now."}, {"time": 7678, "text": "That feels like the case."}, {"time": 7679, "text": "Um, and I think that, I think we can say that with some certainty, but, um, you know, I, I always like to point to president Harry Truman who left office with, you know, some truly abysmal, uh, uh, presidential ratings, um, was dismissed as a, throughout his presidency as a, you know, as a, as unqualified as not knowing what he was doing, et cetera."}, {"time": 7699, "text": "And it's then, you know, turns out, um, uh, with hindsight, we know that he was better at the job than anyone understood better at getting elected, right?"}, {"time": 7710, "text": "You remember that sign, do he defeats Truman, right?"}, {"time": 7714, "text": "He showed them, right?"}, {"time": 7714, "text": "Uh, and better, better at holding power and better at sort of, um, you know, kind of building the kind of institutions that long after he was gone, um, demonstrated that he, he, he won the long game."}, {"time": 7731, "text": "And some of that is the victors do write the story."}, {"time": 7731, "text": "And, um, I asked myself very much, how will history remember Volodymyr Zelensky?"}, {"time": 7739, "text": "And how will history remember Putin?"}, {"time": 7745, "text": "That too is not obvious."}, {"time": 7745, "text": "Um, because it depends on how the role, the geopolitics, the, how the nations, how the history of these nations unravel, unfold rather."}, {"time": 7757, "text": "So it's very interesting to think about."}, {"time": 7764, "text": "And the same is true for Donald Trump, Joe Biden, Obama, uh, George Bush, uh, Bill Clinton, and so on."}, {"time": 7772, "text": "I think it's a probably unanswerable question of which of the presidents will be remembered as a great president from this time."}, {"time": 7781, "text": "You can make all kinds of cases for all kinds of people and they do, but it's unclear."}, {"time": 7786, "text": "It's fascinating to think about when the robots finally take over, uh, what, which of the humans they will appreciate the most."}, {"time": 7796, "text": "Uh, let me ask for advice."}, {"time": 7796, "text": "Do you have, um, advice for, for young folks as they, uh, uh, cause you mentioned the, the, the folks you're teaching, they don't even, they don't know what it's like to have waited on the internet for the, for the thing to load up for every single webpage is suffering."}, {"time": 7815, "text": "They don't know what it's like to not have the internet and have a dial phone that goes, and then the joy of getting angry at somebody and hanging up with a physical phone."}, {"time": 7828, "text": "They don't, they don't know any of that."}, {"time": 7828, "text": "Uh, so for those young folks that look at the contention election, contentious elections, they look at our contentious world, our divided world."}, {"time": 7836, "text": "What advice would you give them of how to have a career they can be proud of?"}]}]