[{"title": "Niels Jorgensen: New York Firefighters and the Heroes of 9/11 | Lex Fridman Podcast #220", "id": "hZenJc1fa70", "quotes": [{"time": 308, "text": "It's just interesting how you phrase it."}, {"time": 311, "text": "So how did you hear that a plane hit something?"}, {"time": 316, "text": "I'm a big news radio guy, news guy, bit of a buff."}, {"time": 320, "text": "I've been that way since I was a kid and I had the news radio on the local New York radio station."}, {"time": 326, "text": "And as I was driving the truck, I heard, you know, an emergency report."}, {"time": 333, "text": "This just in, aircraft has just struck the World Trade Center."}, {"time": 337, "text": "And where Quinlan's is located, it's on the north rim of Staten Island, which is right on New York Harbor."}, {"time": 343, "text": "And you could see Statue of Liberty, you know, a mile or two away in your distance."}, {"time": 348, "text": "And then past that is the towers."}, {"time": 351, "text": "So I just literally stopped the truck and looked out and I saw the smoke."}, {"time": 356, "text": "So there was smoke?"}, {"time": 357, "text": "Oh, it was dark, black smoke."}, {"time": 358, "text": "It was just, yeah, I mean, it was burning fully at that point."}, {"time": 363, "text": "Did you have fear of what the hell happened?"}, {"time": 366, "text": "Or is it?"}, {"time": 366, "text": "I was initially scared for anybody involved."}, {"time": 370, "text": "I realized, I said, there's gonna be lots of fatalities, obviously, depending on the size of the aircraft."}, {"time": 375, "text": "And, you know, the business day there had started probably at 8, 8.30."}, {"time": 381, "text": "So those buildings should have been packed at that moment."}, {"time": 384, "text": "So that was a thought that crossed my mind."}, {"time": 387, "text": "But from our being responder perspective, if you're off duty, normally you do not go to a scene that they don't want you to because of accountability and safety."}, {"time": 400, "text": "The on duty platoon will handle it."}, {"time": 402, "text": "And if it's something very horrific, then they will have something called a recall, which is any police firefighter or EMS personnel is obligated to go to their command immediately, check in with, you know, their command to get their gear and stand by and await orders for deployment or to remain in that command for routine duties."}, {"time": 427, "text": "How often throughout history have there been recalls?"}, {"time": 429, "text": "I believe the one prior to that was like in the 1968 riots, possibly, and then maybe in the 70s, there was another blackout and riots."}, {"time": 439, "text": "And I remember my dad talking about it."}, {"time": 441, "text": "And he actually always said, just remember if something bad's going down, don't just rush in, you will wait the recall."}, {"time": 449, "text": "Or at the very least, if there isn't a recall, you get to your firehouse."}, {"time": 454, "text": "And because if you show up somewhere, there's a good chance that no one knows you're there."}, {"time": 459, "text": "And now you, in your well intended movements, you get lost or trapped or no one's looking for you."}, {"time": 468, "text": "So that's the whole thing with, you know, checking in."}, {"time": 471, "text": "And now you're with a squad or, you know, group of guys and everyone knows, you know, hey, there's Nels, there's Lex."}, {"time": 478, "text": "Okay, they're on, you know, this team."}, {"time": 481, "text": "So I said, all right, they're not gonna need us."}, {"time": 485, "text": "It's probably gonna be a fifth alarm."}, {"time": 487, "text": "And you know, there'll be 250 firefighters there."}, {"time": 490, "text": "They'll handle it."}, {"time": 491, "text": "It's gonna be a bad day for those guys, but you know, our guys take on some heavy stuff and they'll be fine."}, {"time": 498, "text": "A few minutes later, the second plane hit and I knew immediately, I'm like, okay, we're under attack."}, {"time": 505, "text": "So I just flew the truck back in."}, {"time": 507, "text": "I told my boss, I have to go."}, {"time": 510, "text": "He understood, he knew something was way wrong and I just was flying."}, {"time": 515, "text": "At the time, I actually had a yellow Volkswagen Beetle, kind of a goofy car to be driving, but I loved it."}, {"time": 521, "text": "So for people who are just listening, you're kind of a big guy."}, {"time": 523, "text": "Well, yeah, I definitely need to lose about 50 pounds."}, {"time": 527, "text": "No, I don't mean in that way, your frame, big hands."}, {"time": 530, "text": "As my beloved friend, Bobby Adams would say to me, I was driving around in a clown wagon and he also says, I have a waving hairdo, waving bye bye."}, {"time": 539, "text": "So thanks, Bobby."}, {"time": 541, "text": "But yeah, he's a great friend."}, {"time": 543, "text": "Yeah, so I took the Volkswagen and I flew in and I was heading over to Verrazano Bridge and hit the Brooklyn Queens Expressway."}, {"time": 551, "text": "And my phone rang and my wife normally doesn't curse or raise a voice and she was yelling at me."}, {"time": 557, "text": "And she said, don't go in there, go to your firehouse."}, {"time": 560, "text": "Well, first she asked, well, she knew I was on the way, but she just wanted to know where."}, {"time": 564, "text": "And I said, I'm on the curve, which is 65th Street on the Brooklyn Queens Expressway called Dead Man's Curve."}, {"time": 571, "text": "We actually used to do a lot of car wrecks up there."}, {"time": 575, "text": "And I was hitting that curve pretty fast."}, {"time": 577, "text": "And then right around the curve is the exit to the firehouse."}, {"time": 580, "text": "And I had to decide, well, am I driving right in to the battery tunnel to the city or am I going to the firehouse?"}, {"time": 587, "text": "And then I said, but I have no gear."}, {"time": 591, "text": "I'm gonna be ineffective."}, {"time": 592, "text": "How do I show up with no gear, no protection, you know?"}, {"time": 595, "text": "So she said, do what your dad would follow the recall, go to the firehouse."}, {"time": 600, "text": "And I hung up the phone, said, I love you, gotta go."}, {"time": 604, "text": "And I did, I went to the firehouse and I'm glad I listened to her."}, {"time": 607, "text": "I had my father ringing in my ears."}, {"time": 609, "text": "My dad, beautiful guy, he's 82."}, {"time": 613, "text": "He did 34 years in the New York City Fire Department."}, {"time": 616, "text": "He came down on end stage, non and he's 38 back in, going on 39, 1978."}, {"time": 626, "text": "And this guy, he's my hero."}, {"time": 631, "text": "He was gonna die, they sent him home."}, {"time": 634, "text": "They said, there's really not much we can do."}, {"time": 637, "text": "Go get your affairs in order."}, {"time": 638, "text": "And he says, but doc, I have three young kids."}, {"time": 641, "text": "And she called him a couple hours later."}, {"time": 645, "text": "She said, I got in touch with Sloan Kettering and they have a new drug."}, {"time": 676, "text": "So I'll take you to the hospital."}, {"time": 739, "text": "And maybe on Saturday he'd start coming around a little bit, drink down a little bit of tea and on Sunday morning he'd put his robe on and he'd go down, mom would make him black coffee and toast and he'd sit up, watch the news, watch a game and then Monday morning he'd go back to work."}, {"time": 759, "text": "He did that for four years."}, {"time": 761, "text": "And he's 82 and he's still here."}, {"time": 765, "text": "You said that your dad's a man of a few words but when he talks, they're profound."}, {"time": 770, "text": "So what words were ringing in your ear when you were driving?"}, {"time": 774, "text": "I just always remember him saying, kid, they give the recall, you go to the firehouse, you don't go where you think you should, you go to the firehouse, you follow your orders."}, {"time": 785, "text": "So do the smart thing, do your job."}, {"time": 787, "text": "And every time we'd hang up the phone, it's fireman talk, he'd say, I love you, keep low."}, {"time": 794, "text": "My dad couldn't tell me he loved me until I told him when I first got on a fire upon when I was 22 and my dad grew up in a tough household."}, {"time": 802, "text": "My granddad was a good man, but a tormented man."}, {"time": 805, "text": "He was sent away from home at 12 years old."}, {"time": 810, "text": "He was from Denmark and I'm named after him, Grandpa Nils."}, {"time": 814, "text": "And I think his demons took up a large part of his life."}, {"time": 819, "text": "His anger, whatever it was, his fear."}, {"time": 822, "text": "We got the sense that maybe when he was a child, he was an apprentice baker, living with strangers, working for them."}, {"time": 829, "text": "And we think maybe he was abused and that's why he took it out on my dad and my grandma and my aunts."}, {"time": 835, "text": "But they made it up to each other at the end of my granddad's life."}, {"time": 841, "text": "My granddad turned out to be the best grandfather ever."}, {"time": 844, "text": "I think he tried to heal and heal everyone by his change of behavior."}, {"time": 848, "text": "So he's proof that you can change, you can improve if you work on it."}, {"time": 854, "text": "But I know I'm going off track here, but."}, {"time": 856, "text": "But you were man enough in your, you say in your 20s to tell your dad."}, {"time": 859, "text": "To my dad, yeah."}, {"time": 860, "text": "And my dad, I got on a job."}, {"time": 863, "text": "He said, how'd it go, kid?"}, {"time": 865, "text": "That was the tour, we called it Tour of Duty."}, {"time": 867, "text": "I said, oh, dad, it was great, it was great, I love it."}, {"time": 870, "text": "And he goes, well, just remember, you keep low, you always keep low."}, {"time": 874, "text": "And keep low means you stay down below the flames, if a room flashes over and it's burning, if you stay up high, you're gonna get burned badly."}, {"time": 882, "text": "But if you get down on your belly and you crawl, you'll get out."}, {"time": 887, "text": "So he'd always say that when he'd hang up the phone."}, {"time": 889, "text": "And I said, well, I love you, pop."}, {"time": 891, "text": "And he says, well, thanks, kid."}, {"time": 893, "text": "I said, well, you can say it too."}, {"time": 897, "text": "Oh, nice, you pressured him."}, {"time": 898, "text": "And he did, and he said it."}, {"time": 899, "text": "And now every time we talk, he says it."}, {"time": 901, "text": "So, you know, they talk about masculinity and whatnot."}, {"time": 906, "text": "And my dad is one of those tough, tough guys with a soft edge."}, {"time": 910, "text": "And that's how he brought me up, you know, to be a protector."}, {"time": 915, "text": "I hate bullies."}, {"time": 916, "text": "I was bullied really badly as a kid, and I really hated it."}, {"time": 921, "text": "And now I find myself sometimes throwing myself into situations to protect people that are being, you know, violated and hurt."}, {"time": 930, "text": "And I just can't walk away from it."}, {"time": 932, "text": "But that's my dad."}, {"time": 933, "text": "My dad was that, you know, just a great guy."}, {"time": 936, "text": "But anyway, yeah."}, {"time": 937, "text": "You still listen to, therefore, see, you probably went to rush right to the towers, but you went."}, {"time": 943, "text": "Yeah, so anyway, I got, I did, I listened to him."}, {"time": 946, "text": "I listened to my wife."}, {"time": 947, "text": "I went to the firehouse, and it was really strange."}, {"time": 949, "text": "It was eerie because the computer dispatch system was still beeping, which meant it sent a dispatch, and the truck received it."}, {"time": 958, "text": "Ladder 114, my truck company received it, and they left, they were gone."}, {"time": 963, "text": "So it was this beautiful old building built in the 1880s with a spiral staircase, just a narrow old brick garage, and it was empty."}, {"time": 973, "text": "And I just heard the computer chirping."}, {"time": 975, "text": "And I looked down on a ticket, and it said, Ladder 114, respond, the Vessian West World Trade Center aircraft into building."}, {"time": 983, "text": "And I said, oh, God, I just hope they're not on a death ride because this now was two towers, and they were burning."}, {"time": 991, "text": "They were free burning, and I knew this was really, really bad."}, {"time": 995, "text": "And I got on the phone, and I called command right away."}, {"time": 998, "text": "I called the 40th Battalion, and Chief's aide just said, look, get 12 guys."}, {"time": 1004, "text": "Sign them in to the journal."}, {"time": 1005, "text": "There's a journal of daily events."}, {"time": 1008, "text": "Everything that takes place in the firehouse 24 seven has to be logged."}, {"time": 1013, "text": "And I logged myself as coming in, reporting for duty."}, {"time": 1017, "text": "And as the guys came in, I logged them in."}, {"time": 1020, "text": "And then one of our lieutenants took command."}, {"time": 1023, "text": "We grabbed up a bunch of gear, and they basically told us, get 12 guys, get a city bus, and get down to the battery tunnel they said would probably be closed."}, {"time": 1035, "text": "There was threats it was going to be blown up to get to the Brooklyn Bridge."}, {"time": 1040, "text": "And so we did."}, {"time": 1042, "text": "We got a city bus."}, {"time": 1043, "text": "We flagged it down, and the bus driver said, I'm sorry."}, {"time": 1046, "text": "I can't give you the bus."}, {"time": 1047, "text": "I will drive you."}, {"time": 1048, "text": "And he took us, and we stopped at Engine 201, which is just about a quarter mile down the road from us."}, {"time": 1055, "text": "That's our affiliated engine company, and my childhood best friend here, Johnny Schardt, he was assigned there, and he was on shift."}, {"time": 1066, "text": "And then they went through the tunnel."}, {"time": 1071, "text": "And we picked up those guys, the off duty guys from 201, and then we kept going down Fourth Avenue, and we picked up 239's crew."}, {"time": 1080, "text": "And then we hightailed it down the bridge, and there was a lot of traffic."}, {"time": 1084, "text": "There was a lot of people fleeing, coming over the bridge in waves, so it affected the inbound."}, {"time": 1091, "text": "What was the mood like among the crew?"}, {"time": 1094, "text": "It was somber, because just prior to getting on the bus, the first tower went down."}, {"time": 1100, "text": "So we figured that I heard 114, my lieutenant, Dennis Oberg, heard him on the radio."}, {"time": 1108, "text": "And he said, 114, Manhattan, we're on your frequency."}, {"time": 1114, "text": "What do you need us?"}, {"time": 1115, "text": "And they said, Tally Ho, which is our nickname."}, {"time": 1118, "text": "Tally Ho, respond to the Vessian West to the command post and receive your orders."}, {"time": 1124, "text": "And I heard Dennis say, Tally Ho, 10 4."}, {"time": 1127, "text": "And Dennis, a little while after that, they were proceeding to go into, I believe it was, I get this mixed up, and I'm sorry."}, {"time": 1138, "text": "I should know this by the back of my hand, but sometimes it's just such a haze."}, {"time": 1142, "text": "But the second tower hit was the first one to go down."}, {"time": 1146, "text": "And they were heading over to go in it."}, {"time": 1148, "text": "And all of a sudden, he looked up, and he saw what he thought to be disintegration."}, {"time": 1152, "text": "And he turned the guys around."}, {"time": 1154, "text": "He said, run."}, {"time": 1155, "text": "Just run."}, {"time": 1155, "text": "Don't look back."}, {"time": 1156, "text": "Don't look up."}, {"time": 1158, "text": "They sprinted as fast as they could."}, {"time": 1160, "text": "And they dove under a fire truck."}, {"time": 1163, "text": "And the guys that were sprinting behind him 40 feet away were underneath a pile that was 10 stories deep."}, {"time": 1169, "text": "They were killed."}, {"time": 1171, "text": "And just further into that pile was his rookie son, Dennis's rookie son, who was working in Ladder 105, which was my first command under the department."}, {"time": 1182, "text": "I worked for it, proudly served for three years."}, {"time": 1185, "text": "And just aside them was my childhood best friend, John Chard, and his crew from 201."}, {"time": 1193, "text": "And they were all killed."}, {"time": 1199, "text": "And a strange irony to that is that Dennis's son, Dennis Jr., was working underneath, under the wing of a senior man, as we say."}, {"time": 1210, "text": "A senior man is a guy with a lot of experience."}, {"time": 1213, "text": "And he'll watch over you, make sure you don't veer off, like I veer off a lot in talking."}, {"time": 1219, "text": "And you don't veer off, and you get yourself hurt."}, {"time": 1224, "text": "In the morning of 1993 bombing, Henry Miller was my senior man."}, {"time": 1235, "text": "And I was the young guy under his wing."}, {"time": 1238, "text": "And he protected me."}, {"time": 1241, "text": "And toward the end of the day, he looked around."}, {"time": 1243, "text": "He said, kid, it's a bad day."}, {"time": 1246, "text": "He said, they didn't do it right."}, {"time": 1248, "text": "They blew it up in the middle."}, {"time": 1251, "text": "If they did it in a corner, they would have dropped this building half a mile down at Canal Street."}, {"time": 1257, "text": "But don't kid yourself."}, {"time": 1258, "text": "They'll be back, and they'll do it."}, {"time": 1259, "text": "And they'll do it right next time."}, {"time": 1262, "text": "And it's so strange and so prophetic, because he was there with them."}, {"time": 1266, "text": "He died with Dennis."}, {"time": 1267, "text": "He knew it."}, {"time": 1269, "text": "And like 1994, we had a training manual with a picture of the towers with a target."}, {"time": 1274, "text": "And this is not a matter of if, but a matter of when, be prepared."}, {"time": 1282, "text": "And it's haunting."}, {"time": 1282, "text": "It was like people knew, right?"}, {"time": 1285, "text": "And we didn't stop it."}, {"time": 1287, "text": "And so we got off the bus, but just prior to that, coming over the bridge of the second tower, it's gone now."}, {"time": 1296, "text": "And we're just destroyed, because we're like, our guys are there."}, {"time": 1299, "text": "They're all in there."}, {"time": 1299, "text": "Now we're feeling like cowards, because we got there late."}, {"time": 1303, "text": "And initially, we're thinking there's 500 guys that are gone, because there was a tent alarm assignment, which means 50, 60 fire trucks, five to six guys per, you know, you're looking at."}, {"time": 1320, "text": "At least there was even more tent alarm, plus multiple alarms on top of it."}, {"time": 1324, "text": "There was a dispatch, basically equivalent of five to 600 firefighters."}, {"time": 1330, "text": "We figured, oh, they're all in there, all gone."}, {"time": 1332, "text": "All the police officers, Port Authority police, NYPD police, court officers just up the street from the courts, transit cops from the train tunnels."}, {"time": 1343, "text": "Like, just, you know, we knew everybody was going there, and now they're gone."}, {"time": 1348, "text": "So what you saw, what were we looking at?"}, {"time": 1351, "text": "What did it look like?"}, {"time": 1352, "text": "So you saw rubble, and then you knew that many, that 105 and 201, many of those guys are in the, they're dead."}, {"time": 1361, "text": "Yeah, and we thought 114 was in there, too."}, {"time": 1363, "text": "We didn't realize at that point."}, {"time": 1364, "text": "We didn't even realize that they had gotten under that truck."}, {"time": 1367, "text": "We thought they were all gone."}, {"time": 1368, "text": "But yeah, it looked like, it looked like a movie scene with just end of the earth destruction."}, {"time": 1376, "text": "It's just massive piles of intertwined steel, what was left of the steel."}, {"time": 1382, "text": "And you know, there was no cement."}, {"time": 1385, "text": "It was all just dust."}, {"time": 1386, "text": "And it was just a burning pile of dust and concrete and plastic."}, {"time": 1393, "text": "And it was just, everything was just pulverized."}, {"time": 1395, "text": "And it was truly hard to mentally compute that."}, {"time": 1400, "text": "Like, it was like, what?"}, {"time": 1402, "text": "And then there was just fighter jets, a couple of fighter jets just circling."}, {"time": 1406, "text": "And you just heard them flying by over your head."}, {"time": 1411, "text": "I mean, you'd literally see the guy banking a turn around a Brooklyn bridge and just coming back."}, {"time": 1415, "text": "And I'm like, holy shoot, we're under attack?"}, {"time": 1418, "text": "And we couldn't really get concrete intel as to what exactly we knew planes."}, {"time": 1423, "text": "But then we kept hearing there was multiple devices."}, {"time": 1427, "text": "There was devices in a battery tunnel."}, {"time": 1429, "text": "And there was devices on a George Washington bridge and in the subways."}, {"time": 1432, "text": "And it was just chaos."}, {"time": 1434, "text": "It was, I mean, we kept it together, obviously, because that's kind of, we try."}, {"time": 1438, "text": "That's what we do."}, {"time": 1439, "text": "But the just constant barrage of different reports, it was like, holy shoot."}, {"time": 1446, "text": "And then as we were being deployed, it was a little frustrating."}, {"time": 1449, "text": "But they were trying to take command and send us in groups now because they realized we have to start searching this."}, {"time": 1455, "text": "You could hear the alarms on the Scott Air Mask, the packs we wear to go into the building."}, {"time": 1462, "text": "It has a motion alarm."}, {"time": 1463, "text": "And if you stop moving for 30 seconds, it just sounds like this whining, just screaming bell."}, {"time": 1469, "text": "And it just keeps going and going."}, {"time": 1472, "text": "And you could hear multiple units of those going off."}, {"time": 1475, "text": "And you're like, wait a minute."}, {"time": 1477, "text": "There's guys with those."}, {"time": 1478, "text": "Where are they?"}, {"time": 1480, "text": "And it's emanating from underneath the pile."}, {"time": 1482, "text": "And it was just surreal and truly like a war zone."}, {"time": 1491, "text": "I mean, I was a soldier in the reserves."}, {"time": 1493, "text": "And I never saw combat."}, {"time": 1495, "text": "And I would never claim that I did."}, {"time": 1496, "text": "But we trained."}, {"time": 1498, "text": "We trained for a lot of situations."}, {"time": 1500, "text": "And we trained in real life atmospheres and whatnot."}, {"time": 1503, "text": "And this was just beyond that by leaps and bounds."}, {"time": 1506, "text": "It was bizarre."}, {"time": 1508, "text": "Did you see the towers collapse?"}, {"time": 1510, "text": "As we were coming over the bridge, the first one, as we were deploying from the firehouse, we had a television on."}, {"time": 1516, "text": "And I saw it go down."}, {"time": 1521, "text": "And we were so involved in getting gear together and getting teams set up and, OK, you're going to be with these two guys."}, {"time": 1529, "text": "And I just yelled, there's the guys."}, {"time": 1531, "text": "And they're looking at me."}, {"time": 1532, "text": "I dropped to my knees."}, {"time": 1533, "text": "And I started praying."}, {"time": 1534, "text": "They're like, what the hell's wrong?"}, {"time": 1536, "text": "I said, I couldn't even say."}, {"time": 1537, "text": "I was like, 114, they're in there."}, {"time": 1541, "text": "I said, the tower's gone."}, {"time": 1543, "text": "And all you saw on the TV was just this pile of dust."}, {"time": 1546, "text": "And I guess because they didn't see it going down, they probably thought I truly lost it."}, {"time": 1551, "text": "And then the realization came."}, {"time": 1555, "text": "It was like, wow, the tower's down."}, {"time": 1557, "text": "So now it was like, wow, this is really on."}, {"time": 1560, "text": "So we just took off and got that boss."}, {"time": 1562, "text": "And so if you thought many of the guys on 114 were dead, if you thought that, did you think you were going to die?"}, {"time": 1574, "text": "I mean, if you're rushing towards the rubble?"}, {"time": 1579, "text": "As crazy as it sounds, I never thought that the other tower would go down."}, {"time": 1583, "text": "I said, OK, maybe some freak chance that one went down."}, {"time": 1587, "text": "But no, the other one's not going to go."}, {"time": 1589, "text": "They're built so strong."}, {"time": 1590, "text": "I was in those towers so many times."}, {"time": 1592, "text": "I mean, I ate dinner up in the top floor restaurant windows on the world."}, {"time": 1595, "text": "And I'm saying, nah, there's no way."}, {"time": 1598, "text": "Like, how the hell did this one happen?"}, {"time": 1601, "text": "But I was having a hard time mentally processing that the building was gone."}, {"time": 1606, "text": "And believe me, if you don't have fear in this industry and police, fire, military, then you're kidding yourself or you're a danger to everyone."}, {"time": 1617, "text": "I don't care who it is, as tough as they are, this and that."}, {"time": 1620, "text": "Everybody has a certain level of fear with doing this."}, {"time": 1623, "text": "And I don't care how long you do it, there's always that chance of something going bad."}, {"time": 1628, "text": "And everyone who does it has that certain amount of fear."}, {"time": 1632, "text": "But at that point, it was such a feeling of disbelief that fear wasn't even kicking in."}, {"time": 1638, "text": "It was just like, what the hell just happened?"}, {"time": 1640, "text": "And I honestly think it was almost like a shock."}, {"time": 1644, "text": "And it just stayed that whole day."}, {"time": 1647, "text": "So the building is, before it collapses, is burning."}, {"time": 1650, "text": "It's just burning."}, {"time": 1651, "text": "I mean, upper floors, up in the 78th, up to the 80s."}, {"time": 1655, "text": "And then the way that the cut was from the plane, it wasn't just straight across."}, {"time": 1660, "text": "It was from the 78th, then on up to maybe the 86th."}, {"time": 1663, "text": "And then the jet fuel had come down and was burning down."}, {"time": 1669, "text": "And there was people on the ground who were doused with jet fuel that was already burning."}, {"time": 1676, "text": "And they were lit on fire on the ground."}, {"time": 1679, "text": "It was just insane how vast the destruction path was."}, {"time": 1684, "text": "As a firefighter, what are you supposed to do with that scale of fire?"}, {"time": 1691, "text": "I think the first bosses in, the first chiefs, were just going to do their best to get, as we get hose lines, what our whole theory is, or our tactics is, to get water at the fire, at the base of the fire, and get the truck company, which is the ladder company."}, {"time": 1710, "text": "They're the guys who break the doors down, put ladders up, this and that, to get them to where the life is most expected and get them out of there."}, {"time": 1718, "text": "So I think the chiefs tactics at that point was, let me get multiple engine companies."}, {"time": 1722, "text": "Let me get four, five, six hose lines fighting this fire, this massive fire."}, {"time": 1727, "text": "And let me get 15, 20 truck companies up there just yoking people out of there."}, {"time": 1732, "text": "Yeah, but you got to go up the stair."}, {"time": 1734, "text": "Everything's not working."}, {"time": 1735, "text": "Yeah, guys had to walk up 80, 80, 90, 100 flights of stairs."}, {"time": 1740, "text": "And there's audio of officers and firefighters speaking to each other on the radio channels."}, {"time": 1748, "text": "And unfortunately, at that point in time, we had very, very bad communication system."}, {"time": 1752, "text": "We'd been fighting for years to get radios that work properly."}, {"time": 1755, "text": "We couldn't because it was a lot of money."}, {"time": 1758, "text": "We fought for years to get the full bunker firefighting suits, which is the pants and the coat."}, {"time": 1763, "text": "We used to have just coats and these roll up rubber boots and guys were burning to death and we had to fight."}, {"time": 1769, "text": "And unfortunately we lost three guys in one vicious, vicious fire in 1994."}, {"time": 1775, "text": "And then they finally said, enough's enough."}, {"time": 1778, "text": "Give these guys the gear."}, {"time": 1780, "text": "So it's a strange phenomenon in the first responder world and in the military world."}, {"time": 1787, "text": "It's really one of the most important things that takes place in society."}, {"time": 1791, "text": "The most pertinent organizations."}, {"time": 1794, "text": "And we can't get the funding we need."}, {"time": 1797, "text": "They'll throw money at every nonsensical thing."}, {"time": 1800, "text": "But when it comes to gear, equipment, protective equipment, trucks, this couldn't get it."}, {"time": 1808, "text": "Just all the ways you could take care of people."}, {"time": 1810, "text": "I saw since 9 11, the wars in the Middle East have cost America over six trillion dollars."}, {"time": 1817, "text": "And the amount of that money that was spent on the soldiers, in this case the first responders, is minimal."}, {"time": 1825, "text": "Compared to it, yeah."}, {"time": 1826, "text": "Almost nothing."}, {"time": 1827, "text": "They, Lex, they closed down."}, {"time": 1830, "text": "I believe it's either seven or eight."}, {"time": 1833, "text": "In May of 2002, they closed down nine firehouses in New York City for budget reasons."}, {"time": 1842, "text": "We hadn't even finished cleaning up the World Trade Center site and they slashed the budget."}, {"time": 1848, "text": "And still to this day, have not reopened those firehouses."}, {"time": 1852, "text": "There's a million more people now living in New York City than there were in 2001."}, {"time": 1857, "text": "And the fire protection is way less than it was."}, {"time": 1860, "text": "And it's a sin."}, {"time": 1862, "text": "It's really a sin."}, {"time": 1867, "text": "So there's this famous photograph of a falling man."}, {"time": 1873, "text": "So many people had to decide when they're above the fire, in the fire, whether to jump out of the building or to burn to death."}, {"time": 1881, "text": "What do you make of that decision?"}, {"time": 1883, "text": "What do you make of that situation?"}, {"time": 1885, "text": "Those people who jumped, those were acts of sheer desperation."}, {"time": 1891, "text": "I've been in fires and just minor burns, but minor in situation."}, {"time": 1897, "text": "But I've been trapped, caught somewhat."}, {"time": 1899, "text": "Ended up in a burn center for nothing serious at all."}, {"time": 1903, "text": "But for those brief seconds, half a minute was, thank God, if I didn't have my fire gear on, I would have been burned to a very, very horrible level."}, {"time": 1914, "text": "Those people were burning alive."}, {"time": 1918, "text": "And they had the choice of either to stay there and burn alive or to launch themselves."}, {"time": 1925, "text": "And some of them, I don't fault them, but they had a few folks, they won't show it anymore because they say, I don't know why it offends some people, but they had a couple folks that took umbrellas and they took garbage bags because they thought that it would slow down their acceleration rate to the ground and maybe, just maybe they wouldn't be killed."}, {"time": 1947, "text": "And that's, to me, a true sense of desperation for humanity to say, I'm going to die either way, but let me take my chance."}, {"time": 1956, "text": "And I don't know the exact number of those folks who did that, but our first member of the fire department killed firefighter Daniel Serf, aged 216, was struck by a jumper."}, {"time": 1969, "text": "And one of my dear friends was ordered to help take him and they knew he was passed away because he was hit by a flying missile."}, {"time": 1980, "text": "I mean, 120 miles an hour, a body lands on you."}, {"time": 1983, "text": "Those two bodies are now crushed."}, {"time": 1986, "text": "And they were ordered to take that firefighter and bring him across the street to Engine 10, Ladder 10."}, {"time": 1991, "text": "It was literally a firehouse, less than 100 yards from the facade of the Trade Center, from the Trade Center complex."}, {"time": 1999, "text": "They were literally right there."}, {"time": 2002, "text": "And there was plane parts that went into that firehouse, landed into the front doors onto the roof, but the building itself was not destroyed."}, {"time": 2010, "text": "So it was used as a mini command center for quite a while."}, {"time": 2015, "text": "So my friend was ordered to take Daniel's body in respect and bring it over to this firehouse and give it some semblance of dignity and lay it out on one of the bunk rooms, the bunks we have in the bunkhouse, and just cover it with a sheet and put a sign, please firefighter killed, do not disturb, and then we'll get to him later because obviously this operation is gonna go on for days."}, {"time": 2041, "text": "And my friend, who's such a great, wonderful guy, is so still to this day, filled with guilt because if they weren't taking his body out with the respect and dignity that they did, it took a while because it's a tough situation."}, {"time": 2057, "text": "His ladder company was coming over the bridge."}, {"time": 2060, "text": "There's a famous picture of Ladder 118."}, {"time": 2063, "text": "You see this tractor trailer fire truck."}, {"time": 2066, "text": "It's the one when the guy in the back also drives."}, {"time": 2069, "text": "And it's a zoomed out shot, and you see the Brooklyn Bridge, and you see only the fire truck in the middle, and you see the two burning towers in the distance."}, {"time": 2078, "text": "Well, his engine company was just ahead of them on the bridge, and the only reason that engine company lived is their initial duty assignment was to take that firefighter and bring his body over."}, {"time": 2089, "text": "It's like the military."}, {"time": 2090, "text": "We don't leave anyone behind."}, {"time": 2091, "text": "These are our guys."}, {"time": 2093, "text": "As some guys say, it's all about the guy right next to you, and nothing else really matters."}, {"time": 2098, "text": "When that guy right next to you goes down, it stops."}, {"time": 2101, "text": "You get that guy to safety, or if he's dead, you get him out."}, {"time": 2105, "text": "So in that time frame, that saved his life."}, {"time": 2110, "text": "But that's a heavy burden to carry now for the rest of your life, because you say, if I wasn't helping my dead friend, I'm dead."}, {"time": 2118, "text": "What did it look like at Ground Zero?"}, {"time": 2121, "text": "What did it feel like?"}, {"time": 2122, "text": "What did it smell like?"}, {"time": 2124, "text": "What, you said there was a sense that it was almost like a war zone, but can you paint a picture of how much dust is in the air?"}, {"time": 2133, "text": "How hot is it?"}, {"time": 2135, "text": "How many people are there?"}, {"time": 2137, "text": "And again, how did it feel like?"}, {"time": 2140, "text": "It was just, it was a scene of controlled chaos, controlled because there was a semblance of command, and we were just trying to do our jobs."}, {"time": 2151, "text": "But it was such a frantic pace because we're now digging frantically, knowing that there's life underneath this pile."}, {"time": 2158, "text": "And this is throughout the afternoon of that day, the evening."}, {"time": 2161, "text": "Yeah, I mean, this was nonstop, just nonstop, really, for days."}, {"time": 2166, "text": "But for my particular crew, we literally kept going."}, {"time": 2170, "text": "We initially were dispatched over towards number seven, had just gone down, and we were searching the post office that was there."}, {"time": 2177, "text": "There was reports of people trapped."}, {"time": 2180, "text": "And we painstakingly searched every single inch of that building to make sure no one was left in there."}, {"time": 2185, "text": "And then we were deployed to the pile, and the pile is sort of ambiguous because it was just such a vast, vast pile."}, {"time": 2192, "text": "I mean, it went for city blocks."}, {"time": 2195, "text": "And we were assisting in the retrieval of two Port Authority police officers."}, {"time": 2202, "text": "We're lucky enough to survive, but they were trapped."}, {"time": 2205, "text": "They were deep down into a crevasse, and they had to be physically dug out and extricated."}, {"time": 2210, "text": "So there was a couple hundred, few hundred guys involved in that process of bringing in equipment, jaws of life, airbags to lift steel, to cut pieces of steel."}, {"time": 2220, "text": "It was just a huge operation."}, {"time": 2223, "text": "And we were back toward the logistics end of it, shuttling in gear and bringing in stretchers, bringing in oxygen, whatever was needed."}, {"time": 2231, "text": "And you were trying to climb over this jagged pile of debris."}, {"time": 2236, "text": "It wasn't like you just walked 100 feet on a street with something."}, {"time": 2240, "text": "You were trying to climb over this I beam and then down into this hole and then back up that hole."}, {"time": 2245, "text": "I mean, just to run one piece of equipment took a half an hour to get 100 feet, 200 feet."}, {"time": 2252, "text": "You know, mind you, some of these pieces of equipment are 100 pounds, you know, generator for hearse tools, this massive motor on a frame."}, {"time": 2259, "text": "Unstable ground."}, {"time": 2261, "text": "Unstable ground, just horrible conditions."}, {"time": 2264, "text": "Fires were still burning aside you, beneath you."}, {"time": 2267, "text": "And at one point, I kind of veered off to the side and I was with this other fireman from my father's old ladder company, 172."}, {"time": 2275, "text": "And it was strange because we were quite a bit down, like 70 feet down into this ravine of debris."}, {"time": 2284, "text": "And he says, brother, what do you hear?"}, {"time": 2286, "text": "And at the time it was like dust, it was like sand just falling down a pile and it was hissing from gas pipes and water pipes."}, {"time": 2295, "text": "And I said, I hear the gas lines, I hear the sand, I hear the concrete."}, {"time": 2300, "text": "He goes, no, no, what else do you hear?"}, {"time": 2303, "text": "And just the side of us was a lady's pocketbook and a high heel shoe and someone's sneaker with nobody with it."}, {"time": 2313, "text": "And I said, I don't know, I don't hear anything."}, {"time": 2317, "text": "He says, me neither."}, {"time": 2317, "text": "He goes, no one's coming out of here."}, {"time": 2321, "text": "And I said, no, no, no, there's gotta be someone coming out of here."}, {"time": 2324, "text": "I mean, there's just thousands of people in here and they're coming out."}, {"time": 2327, "text": "He says, brother, we would hear them calling for help, they're gone."}, {"time": 2332, "text": "And I still at that point thought there was a chance."}, {"time": 2335, "text": "And after about the fourth day, they just said, this is a recovery now."}, {"time": 2342, "text": "There's no more life, there's no more chance."}, {"time": 2345, "text": "And then that first night we went full tilt till my crew, my specific crew of 12, 15 guys."}, {"time": 2351, "text": "And four in the morning, we just couldn't breathe anymore."}, {"time": 2354, "text": "We couldn't see, we were caked just with, it was like if you took flour and just kept dousing yourself."}, {"time": 2360, "text": "And the Lieutenant just said, look, guys, we're gonna go back, we're gonna get some medical aid and then we'll come back in a few hours."}, {"time": 2367, "text": "And we took a city bus back through the battery tunnel and unbeknownst to us that morning, this off duty firefighter, Steven Siller from Squad Company One, he raced down there with his pickup and he couldn't go any further because the traffic was stopped up because they had a report of a bomb."}, {"time": 2391, "text": "So everything was held up and he grabbed his fire gear and he put it on, stuff weighs about 60 pounds."}, {"time": 2399, "text": "And he ran through the tunnel."}, {"time": 2402, "text": "Two and a half miles, got to the end of the tunnel, fire truck was coming in from the other way."}, {"time": 2408, "text": "He hopped on the back, got him up to West Street, jumped off, tried to look for his company, where they were and he was never seen again."}, {"time": 2419, "text": "He just ran through the tunnel."}, {"time": 2421, "text": "Ran through the tunnel and he got there to help his team, right?"}, {"time": 2426, "text": "It's all about the team, it's all about the guy right next to you."}, {"time": 2428, "text": "And he's the Tunnel to Towers Foundation, Steven."}, {"time": 2431, "text": "His brother Frank decided in his name in perpetuity, he's got a fund that now builds a home for every Gold Star family, for every seriously battle wounded warrior, for every seriously wounded first responder or killed in a line of duty first responder."}, {"time": 2449, "text": "If they had a home, they'll pay the mortgage."}, {"time": 2452, "text": "If they didn't have a home, they give them a home."}, {"time": 2456, "text": "And especially if it's a severely battle wounded, they give them a smart home because these poor guys come home with no limbs."}, {"time": 2463, "text": "And so the beauty of Steven and his selfless act was that he's now helped thousands and thousands of people."}, {"time": 2472, "text": "I mean, the Tunnel to Towers is incredible."}, {"time": 2474, "text": "That's part of our mission is to bring awareness to these great people at Tunnel to Towers, what they do."}, {"time": 2479, "text": "They've raised $250 million to help protect the protectors, to rescue the rescuers in a what's become, unfortunately, a somewhat ungrateful society."}, {"time": 2493, "text": "But they will not forget these great guys."}, {"time": 2497, "text": "So you tell Steven's story."}, {"time": 2499, "text": "He's one of the 20 people that you talk about in the new Iron Labs 20 for 20 podcast series."}, {"time": 2506, "text": "If you can just linger on his story a little longer, what does that tell you about the human spirit?"}, {"time": 2514, "text": "That this guy, the Tunnel couldn't drive through, so he just puts on that heavy pack and runs."}, {"time": 2524, "text": "That shows the depth of a man's soul."}, {"time": 2528, "text": "He didn't have to do that."}, {"time": 2530, "text": "He could have turned around and went home to his family, and nobody would have shamed him."}, {"time": 2536, "text": "But he's one of those beautiful, brave people that take a job that really doesn't pay a lot of money."}, {"time": 2545, "text": "And you become a cop or a firefighter or a nurse or an EMT or a medic or a soldier or a Marine or airman, sailor."}, {"time": 2556, "text": "When you take these jobs, you don't do it for fanfare."}, {"time": 2561, "text": "You definitely don't do it for money."}, {"time": 2563, "text": "I mean, those 13 brave souls we lost a week or two ago in Afghanistan, they're brand new soldiers and Marines."}, {"time": 2571, "text": "They make $22,000 an hour, but they don't work 40 hours a week."}, {"time": 2576, "text": "They work 80, they work 90 hours a week."}, {"time": 2578, "text": "So they make it about six bucks an hour."}, {"time": 2582, "text": "They sign off."}, {"time": 2583, "text": "And firefighters and cops and medics and EMTs, nurses, emergency room doctors, they don't really make a lot of money."}, {"time": 2592, "text": "I mean, they're starting salary right now for a New York cop."}, {"time": 2594, "text": "I was a New York cop for two years first."}, {"time": 2597, "text": "I made 12.25 an hour back in 1989 to get shot at during the crack wars."}, {"time": 2604, "text": "If you made $11 an hour with a family of four, you were entitled to welfare back then."}, {"time": 2613, "text": "So I was just above the welfare level, risking my life."}, {"time": 2618, "text": "And these are the guys that are getting ripped up now."}, {"time": 2622, "text": "And look, I won't get into any politics, but like that says something about someone's soul that they're willing to take a job like that and get now, get zero respect."}, {"time": 2633, "text": "So a guy like Steven, what that shows is the depth of that man's soul and courage and determination."}, {"time": 2640, "text": "It's hard to be selfless in this world anymore, but I still know a lot of selfless people that just put on equipment every day, bulletproof vests, fire bunker gear, stethoscopes, you know, flak jackets, military helmets, and they go in and they do it smiling."}, {"time": 2659, "text": "That young Marine that passed last week, she was photographed and quoted as saying, I have my dream job, but she was holding a little Afghani baby."}, {"time": 2670, "text": "And she was dead a few days later."}, {"time": 2673, "text": "She was so thrilled to be making $7 an hour helping people, right?"}, {"time": 2676, "text": "Isn't that huge?"}, {"time": 2677, "text": "Like that to me says, that's a true sign of character right there."}, {"time": 2682, "text": "And it's important for our society to elevate those people as heroes."}, {"time": 2686, "text": "Let me ask you about firefighting."}, {"time": 2690, "text": "What do you think it means to be a great firefighter and a great man, a great human being in a situation like you were in in 9 11?"}, {"time": 2703, "text": "You know, that's kind of a broad term."}, {"time": 2706, "text": "Like some, you know, you can go to different firehouses and they might have a different definition of what they consider a great firefighter."}, {"time": 2712, "text": "But I think in the industry as a whole, if you're willing to put everyone else before you, especially your team, you know, as we say, there ain't no I in team, right?"}, {"time": 2724, "text": "It's T E A M and there's no I in there."}, {"time": 2726, "text": "It's all about those guys and girls next to you."}, {"time": 2730, "text": "If you can do that, that makes you pretty great."}, {"time": 2734, "text": "You put everything else second and you just run in and you run in with that team for strangers."}, {"time": 2740, "text": "You know, I've had the honor of, I spent almost 25 years of my adult life serving humanity, my country, my former city."}, {"time": 2752, "text": "And the people I worked with were giants."}, {"time": 2755, "text": "And I don't mean that in height, I mean, but I mean that in spirit and in soul."}, {"time": 2760, "text": "I saw some of the most heroic, selfless acts."}, {"time": 2764, "text": "And then I saw some of the behind the scenes that were so impressive."}, {"time": 2768, "text": "You know, we'd go to the movies, so impressive, you know, we'd go to a fire around Christmas and the family would lose everything."}, {"time": 2776, "text": "And even when I was a cop, same thing, you'd come back either to the police precinct or the firehouse or the EMS station."}, {"time": 2783, "text": "And someone would put together a collection and say, hey guys, hey Lex, 50 bucks a man, you know, the Smith's down the street, just lost everything, we're gonna go get some presents for the kids and some turkeys."}, {"time": 2793, "text": "And not one of those guys questioned that."}, {"time": 2796, "text": "And they were making 12.25 an hour and they still came up with 50 bucks for that family."}, {"time": 2802, "text": "But see, that's the stuff the press won't show you, right?"}, {"time": 2805, "text": "They don't wanna show that humanity, that soft edge."}, {"time": 2809, "text": "See, when you're a warrior, you need to have this rough shield, this rough exterior."}, {"time": 2814, "text": "Cause if you don't, you die."}, {"time": 2816, "text": "But a true great firefighter or responder or a cop or military personnel, they have that rough exterior with that soft underbelly, that heart, right?"}, {"time": 2831, "text": "And that's, to me, the true great ones."}, {"time": 2834, "text": "Some of them, they just have a hard time doing that."}, {"time": 2837, "text": "There's no shame in showing your soft side."}, {"time": 2840, "text": "Well, you got your dad to say I love you back."}, {"time": 2843, "text": "No, that was huge, man."}, {"time": 2845, "text": "That took me 22 years, Lex."}, {"time": 2848, "text": "So you were a firefighter for 21, I was 22 years."}, {"time": 2851, "text": "Why did you become a firefighter?"}, {"time": 2853, "text": "Oh, my dad, I mean, I was five years old and I went to his firehouse and there was these, at the time, they looked like giants to me with mustaches and the trucks smelled like smoke and the gear smelled like smoke and the tires and the diesel fuel and that one was like, this is what I'm gonna do."}, {"time": 2873, "text": "And then they bring you in the kitchen and they stuff you with ice cream and cake and everything."}, {"time": 2878, "text": "And then I go home to my mom, shaking with a sugar cone and she's mad at my dad, but yeah, it was just, oh, I was like, I gotta do this."}, {"time": 2886, "text": "It was like, they were like a baseball team in a garage with a truck and these big tools and big coats and helmets and they were just laughing and having fun and I'm like, yeah, man, I'm doing this."}, {"time": 2897, "text": "And I knew, I was obsessed with it."}, {"time": 2899, "text": "I mean, I was so pissed that the fireman's test came out when I was 14 and I couldn't take it, you had to be 18."}, {"time": 2906, "text": "And it was done, the test was graded and whatever."}, {"time": 2909, "text": "So my dad, now there's a copy circulating because it's old now."}, {"time": 2914, "text": "And he goes, yeah, yeah, this is what you're in for."}, {"time": 2917, "text": "And I took it and I did it like it was real and I got a 99 and I was so pissed."}, {"time": 2922, "text": "I said, I wanna get hired."}, {"time": 2923, "text": "He goes, you can't, you're 14."}, {"time": 2925, "text": "But I just wanted to do it so bad and I just wanted to help people."}, {"time": 2930, "text": "I just wanted to be like my dad, he'd come home smiling as tired as he was and he fought fires in the 60s and 70s when the city was burning and he's still as exhausted as he was, he'd still be smiling."}, {"time": 2945, "text": "I wanted to smile at work and I used to, I got paid to laugh and joke."}, {"time": 2950, "text": "I got paid to cry sometimes."}, {"time": 2953, "text": "But man, we laughed a lot."}, {"time": 2954, "text": "We really, it was, the chop breaking is just, it's just unending and it's great."}, {"time": 2959, "text": "If you don't mind, can you tell me, you were really kind enough to give me one of these shirts with 114."}, {"time": 2967, "text": "Can you tell me the story of 114 and Tally Ho?"}, {"time": 2971, "text": "I wear proudly, I served eight years in that command and I didn't finish my career there."}, {"time": 2976, "text": "I passed the lieutenant's test and once you do, you have to leave."}, {"time": 2981, "text": "The story behind Tally Ho is back in World War II, there was this gentleman named Bad Jack Carroll and Jack was an airborne ranger and my father in law was also on the department and he knew Jack."}, {"time": 2994, "text": "And Jack came home, Jack jumped Normandy and stormed up through the Battle of the Bulls in Bastogne and he came back, greatest generation as they all did and they got jobs and they went right to work and they were treated better back then, vets, right?"}, {"time": 3014, "text": "And he got on the New York City Fire Department and he got assigned a ladder 114 and they first got radios back then and when Jack, he would drive the truck, you're up there with the officer, either the lieutenant or captain, so if the boss is off the truck, you operate the radio for them as the driver."}, {"time": 3033, "text": "So when they called him and they'd say, you know, ladder 114 responding to 52nd Street, 3rd Avenue, Structure Fire, you're supposed to get back and say, ladder 114, 10 four, but he refused to do that."}, {"time": 3044, "text": "He'd say, ladder 114, Tally Ho, because that's what they'd yell when they'd jump out the plane."}, {"time": 3050, "text": "So all these years later, it stuck and it's a little bit of a bragging right, but out of 350 engine and truck companies in the whole New York City Fire Department, we're pretty much the only one that's called by their nickname on the radio, not their number."}, {"time": 3092, "text": "So yeah, that's the proud history."}, {"time": 3095, "text": "And you said that if I wear this around New York, am I getting a little bit of?"}, {"time": 3098, "text": "You might get a guy from the Bronx, go, hey, Tally Ho, screw you, you know?"}, {"time": 3101, "text": "But I mean, it's all that good rivalry, you know?"}, {"time": 3104, "text": "We like to, you know, we like to kid each other back and forth, you know, guys from Manhattan, we'll say, yeah, you guys are in Brooklyn, yeah, short buildings, tall stories."}, {"time": 3114, "text": "And they're like, yeah, you guys are in Manhattan, tall buildings, no stories, you know?"}, {"time": 3119, "text": "Like it's just all that jocular ball break and it's good stuff, you know?"}, {"time": 3124, "text": "Let me ask, I guess, a difficult question."}, {"time": 3128, "text": "If you just step back on the events of 9 11, on the side of the people that flew into the towers, what do you take away from that day about the nature, about human nature, about good and evil?"}, {"time": 3143, "text": "How did that change your view of the world?"}, {"time": 3149, "text": "I witnessed evil firsthand."}, {"time": 3152, "text": "I remember later on, well into that night when we were trying to help get those police officers out, I remember looking up at the building, Century 21, the store runs along the east side of the towers and it was still there and the debris had come down right almost to the edge."}, {"time": 3170, "text": "Century 21 is this old storied department store in New York City and the sign was there and it was still lit up, like some of the neon was broken but I think some of it was actually still lit up and I just looked around and I was like, this is a war zone, like we're at war."}, {"time": 3188, "text": "And we knew we were attacked, we heard the fighter planes and back then it wasn't the extensive communication network and we had cell phones but they were the old school flip phones and there was no news on them and so plus we didn't have signal down there anyway."}, {"time": 3204, "text": "I couldn't reach my family for like 12, 13 hours and my dad had deployed down to the ferry terminal to retrieve bodies."}, {"time": 3213, "text": "He was retired but he still went and they deployed him to go be basically the morgue transport guys."}, {"time": 3221, "text": "They expected to be sending hundreds and thousands of bodies across on the ferry and they set up these tractor trailers as a mobile morgue and that never happened because there were no bodies to take, they were all buried."}, {"time": 3238, "text": "So I saw evil firsthand, I don't know how someone can inflict such revenge or a vengeful act in the name of anything, in the name of a religion, in the name of a cause, in the name, like what the hell?"}, {"time": 3254, "text": "Were you ever able to make sense of that, why men are able to commit such acts of terror in the days and the years after?"}, {"time": 3262, "text": "No, Lex, I haven't."}, {"time": 3266, "text": "My mom's from Ireland and I still have a lot of family there and my great uncles, one of them was dragged out and shot."}, {"time": 3275, "text": "He lived but just based on a rumor that he was in the IRA and I wasn't happy to see what happened to my mom's people because they were victimized and brutalized by England at that time."}, {"time": 3290, "text": "But blowing up bombs and killing innocents in the name of that, it doesn't make it right."}, {"time": 3300, "text": "I couldn't justify something like that."}, {"time": 3302, "text": "I can see, I was a cop, I was a soldier and you never wanna take life and those jobs but sometimes you have to."}, {"time": 3315, "text": "But you don't do it with a vengeance, you don't do it with a thirst, you do it because it's necessary for survival."}, {"time": 3322, "text": "When you do it out of a bloodlust, out of a thirst, out of a cause, that's evil, there's something wrong with you, I have no, I respect life to the highest level."}, {"time": 3333, "text": "I mean, I'm very, life is sacred to me, it's precious, it's beyond, it's not a commodity, it's a gift."}, {"time": 3342, "text": "But to take life just so randomly, so there's something way wrong with that person and maybe I'm a conflicted soul but I would have no problem seeing someone like that put to death because they do not deserve life."}, {"time": 3359, "text": "There's many children around me and many children around this world that are being taught to hate someone who's different than them just because the person who's allegedly teaching them says so."}, {"time": 3374, "text": "Well, that starts with just having a basic respect and appreciation of other human beings and that starts with empathy."}, {"time": 3384, "text": "And one of the reasons I love this country, while joking that I'm Russian, maybe you could say the same as you being Irish, you're actually truly an American and that's why I consider myself very much an American."}, {"time": 3397, "text": "And one of the reasons I love this country is it serves as a beacon."}, {"time": 3402, "text": "I still believe it serves as a beacon of hope and that empathy and love for the rest of the world that hate is not gonna get you far, that love will get you a lot farther."}, {"time": 3415, "text": "And I still think sometimes it's easy to see the press, mainstream media, you could see social networks."}, {"time": 3425, "text": "Because you can make so much money on division, sometimes because it makes so much money, it's easy to think like we're really divided."}, {"time": 3434, "text": "I honestly don't think we are."}, {"time": 3436, "text": "That's just like the very surface level thing we see on Twitter and so on."}, {"time": 3440, "text": "It's that you're 100% right."}, {"time": 3443, "text": "There's people out there that are maximizing off this whole division, right?"}, {"time": 3447, "text": "They want us divided, they want people angry because it sells."}, {"time": 3452, "text": "A lot of these people that are in charge of certain organizations, well, they all seem to have nice cars and nice houses and nice vacations and they're constantly trying to convince everybody that we hate each other."}, {"time": 3467, "text": "To me, I'll use a fireman analogy, right?"}, {"time": 3469, "text": "It's like a little campfire."}, {"time": 3471, "text": "And if you just let the embers flutter, they'll go out."}, {"time": 3475, "text": "But if you take a little cup of gasoline with those embers, boom, it'll blow right up in your face."}, {"time": 3481, "text": "And that's what a lot of these politicians and a lot of these media folks are doing because there's something in it for them."}, {"time": 3488, "text": "And I think it's possible to defeat them with great leaders, with great spokespeople, with great human beings having a voice."}, {"time": 3497, "text": "One of the powerful things with the internet is more and more people have a voice."}, {"time": 3501, "text": "And I ultimately believe, certainly in America, but in the world, the good people outnumber the assholes."}, {"time": 3511, "text": "And there's days when I think the assholes are overrunning us, but you know what?"}, {"time": 3518, "text": "I think what the downfall of the world is is ego and arrogance and people that think they're better than that other guy."}, {"time": 3527, "text": "My parents raised me to be this way."}, {"time": 3529, "text": "My mom is such a sweet, gentle soul."}, {"time": 3532, "text": "She's an immigrant."}, {"time": 3532, "text": "She came here at 16 years old."}, {"time": 3535, "text": "She helps everybody but herself, right?"}, {"time": 3537, "text": "She's just one of those people."}, {"time": 3539, "text": "She's got Parkinson's."}, {"time": 3541, "text": "You'd never know it."}, {"time": 3542, "text": "And she's still flying around her condo complex helping everybody because that's what she does."}, {"time": 3548, "text": "She loves to help people."}, {"time": 3550, "text": "But she's been in their shoes."}, {"time": 3552, "text": "She's been poor."}, {"time": 3554, "text": "Her husband was sick."}, {"time": 3555, "text": "She's had all sorts of suffering and loss in her life."}, {"time": 3559, "text": "My granddad died when my mom was 10 and she was one of 10 children that survived out of 14."}, {"time": 3567, "text": "She knows hard times, but she so appreciates the good times and the goodness of this country."}, {"time": 3575, "text": "You know, the fire department and the police department, military, it taught me a lot about empathy and trying to really feel for someone and put yourself in their situation."}, {"time": 3588, "text": "I remember years back, I was a much younger fireman."}, {"time": 3590, "text": "I was probably five years on the job."}, {"time": 3593, "text": "And I was sent down to the next firehouse over to fill in."}, {"time": 3598, "text": "You know, we would get sent around randomly when they needed an extra guy."}, {"time": 3603, "text": "And someone came banging on the firehouse door and in the tenement apartment next door, they said there was an older woman that was unconscious."}, {"time": 3612, "text": "So we dispatched ourselves and we ran over with a medical kit and it was an elderly woman laying there on the bed."}, {"time": 3620, "text": "And she was obviously not breathing."}, {"time": 3623, "text": "She was obviously in cardiac arrest and an older gentleman that was holding her hand, just inconsolably crying."}, {"time": 3631, "text": "And it turned out it was her husband and they were married for 65 years."}, {"time": 3637, "text": "And normally we would just respectfully ask the family members to just step aside and let us do our work."}, {"time": 3645, "text": "And I realized that he wouldn't leave her side."}, {"time": 3647, "text": "So I kind of gave the crew a wink and they were doing CPR on what they had to."}, {"time": 3653, "text": "And I just let him keep holding her hand."}, {"time": 3657, "text": "And I said, sir, if you, you know, could you just come over just a little bit so we can work?"}, {"time": 3662, "text": "And I held his hand as he held hers."}, {"time": 3666, "text": "And I said, sir, I said, do you have faith?"}, {"time": 3670, "text": "And I said, would you like to pray with me for your wife?"}, {"time": 3674, "text": "And he said, I would like to."}, {"time": 3677, "text": "So we said the Lord's prayer and you know, I just asked God to protect her and bless her."}, {"time": 3683, "text": "And I think he realized that she didn't have a chance, but we still gave her that chance."}, {"time": 3690, "text": "And we, you know, got her in the ambulance and maybe it was wrong to try to make it look like we could save her, but you know, you can't really not try."}, {"time": 3701, "text": "But the one beautiful moment was he thanked me and he was almost okay with it at that point."}, {"time": 3709, "text": "Like he wasn't as upset."}, {"time": 3711, "text": "He wasn't as distraught because I tried to just humanize that situation of what we were trying to do."}, {"time": 3716, "text": "We were trying to do our best, but we also tried to be compassionate to his sadness."}, {"time": 3721, "text": "And it just, I walked away just feeling so good, even though it was a tragic situation."}, {"time": 3727, "text": "And she did pass that, you know, he came by to, you know, thank us days later and just heartbreaking."}, {"time": 3735, "text": "But you know, there's just, it's just happens many, many times throughout the country every day."}, {"time": 3741, "text": "People get that opportunity as a responder to be that last bridge to the family and the loved one."}, {"time": 3747, "text": "And you only get that opportunity once sometimes and you really have to, to me, it's like your moment to shine."}, {"time": 3754, "text": "You know, you could just be very, very dismissive and very rude, or you could be compassionate and just show, hey, I have a mom, I have a grandma, I have, you know, and just in your mind, pretend that that's who you're working on and that's who you're with."}, {"time": 3767, "text": "So that moment of compassion, that moment of empathy, even if his brief can be the thing that saves the person from suffering, make the difference between suffering and overcoming in the face of tragedy."}, {"time": 3781, "text": "Yes, like I felt that even though obviously his loss was still huge, it just made it a little more bearable and, you know, tried to just take his grief down to a lower level and it made me feel, just feel really good about doing it."}, {"time": 3797, "text": "That's a powerful way to see the job of a first responder."}, {"time": 3799, "text": "Of course, you have to deal with certain aspects of the tragedy, but it's to provide somebody with that moment of compassion."}, {"time": 3806, "text": "Yeah, and you know, I made it a little habit because sometimes with faith, it's a little bit of a tricky subject."}, {"time": 3812, "text": "So every time I had someone who died, which unfortunately was many, many times, I would just touch their hand and just say a little quick prayer and just say, look, you know, I hope you're moving on to a better place."}, {"time": 3824, "text": "I hope if you did have faith that it's strong as you depart and if you didn't have faith, I hope maybe at your last moment that you found some and you just found some closure."}, {"time": 3835, "text": "So that was just my little ritual, I think."}, {"time": 3838, "text": "I just, you know, I felt it was important that that person, even though they were a stranger, just had someone there just sort of hoping for the best for them in their last moments."}, {"time": 3850, "text": "You mentioned cancer."}, {"time": 3852, "text": "You had a rare leukemia due to all the work that you did at Ground Zero."}, {"time": 3862, "text": "Can you maybe talk to the experience of just breathing through those days and what that was like, being unable to breathe, being overwhelmed by all of the dust in the air?"}, {"time": 3877, "text": "Yes, the first day especially, we didn't have equipment."}, {"time": 3883, "text": "We didn't have breathing apparatus and then we were handed little 69 cent hardware store dust mask, you know, it was a little thin paint mask that would just get sweated up and sticking to your face within 30 seconds."}, {"time": 3897, "text": "So you would just, they were useless."}, {"time": 3900, "text": "And what you wound up feeling like was that you swallowed a box of razor blades because there was glass and there was cement and it was just so caustic."}, {"time": 3936, "text": "And I just remember the one guy going out, we're all dead."}, {"time": 3939, "text": "And I said, no, no, we made it, we made it."}, {"time": 3941, "text": "He goes, no, you don't get it, kid."}, {"time": 3942, "text": "He said, we just breathed in poison after poison for hours and then that went into days and then went into months."}, {"time": 3950, "text": "He says, we're all dead, man, this is gonna take us all."}, {"time": 3954, "text": "And I thought he was crazy and then now years later, like starting in 03 or 04, guys just started coming down with these really rare and advanced cancers and then it just stopped being a coincidence with the number of guys and they were young, one of the first guys, John McNamara, he was 33 or 34 and he came down colon cancer and it took him quickly in 2000, he was in 2005."}, {"time": 3983, "text": "And I kind of said to friends and family, I said, I feel like I'm running through a minefield and I wonder when I'm gonna step on my mind because everybody's gonna get sick."}, {"time": 3995, "text": "And I wasn't feeling well from 2008 on, I couldn't put my finger on it, but I just wasn't right."}, {"time": 4078, "text": "And I said, what is it?"}, {"time": 4080, "text": "He said, I need a little while to figure it out, he goes, but you probably have one of a few different types of leukemia, he said, I'll drill into your hip, take your marrow and find out."}, {"time": 4093, "text": "And he said, but in the meantime, we'll get the swelling on the spleen down, I guess some sort of rapid medicines and whatnot because my spleen is about to rupture."}, {"time": 4102, "text": "I had no blood platelets left which is your clotter so I basically would have bled to death and I found out from my team of doctors that I had about 48 hours to live and that really set me off, I was infuriated because I was telling them for a long time that I was sick."}, {"time": 4121, "text": "The doctors failed you, the few doctors in the beginning failed you."}, {"time": 4124, "text": "I felt very betrayed and other guys had died and I had it out with that one doctor, I basically told her she was fired from my case and she's pretty politically in charge person and I didn't care, I jeopardized my job for it because it was my life and I got the sense that it didn't really matter to her."}, {"time": 4147, "text": "She didn't have any empathy, as you say."}, {"time": 4149, "text": "It was exact, so why for her, why for a few others, was there not a special care, a special compassion for, first of all, all humans, but human beings in your position, especially a firefighter, a first responder?"}, {"time": 4166, "text": "You know, Alex, I think what it is in the department, their title is just to get us back to duty as quickly as possible when we are either injured or sick because what happens then is your replacement is now in overtime so you're out being paid on medical leave but then they need to replace your spot and then that costs more money."}, {"time": 4187, "text": "So I think it just behooves them to get as many personnel back and especially during the summertime, they look at it like, oh, maybe you want a few extra days off to go to the beach and this one doctor, he tipped his hand back as if I was drinking an alcohol beverage, he says, hey, busy summer?"}, {"time": 4207, "text": "Because I asked him to look at my spleen which was sticking out of my abdomen like a football and I said, excuse me, sir, I said, how dare you assume that I'm abusing alcohol because alcohol abuse sometimes will present itself as the spleen is engorged and having an issue."}, {"time": 4226, "text": "So he automatically just assumed that that was my situation, wouldn't even give me an exam and I was horrified."}, {"time": 4232, "text": "I was so angry, I mean, I wanted to punch this guy out and I literally was screaming at him and an executive officer came in to diffuse it and sent me to another doctor and when I showed her my paperwork, she was horrified."}, {"time": 4244, "text": "She was like, what did he say?"}, {"time": 4247, "text": "And she said, oh, okay, go to your regular doctor tomorrow who was one of the department doctors and it was just an indifference."}, {"time": 4255, "text": "It was like, I don't know, I was shocked at the lack of compassion but you know what, that being said, I'm past it, life moves on."}, {"time": 4266, "text": "The team of doctors, I ended up with a Methodist and my subsequent oncologist, Dr. Peter Menzel, world class, just incredible human being."}, {"time": 4276, "text": "My Dr. Pete is just, I love him."}, {"time": 4278, "text": "I just, I love him like a friend, like a big brother, like a father, like my primary oncology care nurse, Mike Nunez, was just an incredible human being and he knew I was frightened because I had to get two and a half years of chemo compressed into seven days or I was dead."}, {"time": 4297, "text": "And these massive bags of chemo that never stopped and they burned, the minute they went into your body, you felt like you were burning to death from the inside out."}, {"time": 4309, "text": "And Mike, when Mike came in to hook me up, he said, look, I have to wear a hazmat suit."}, {"time": 4314, "text": "This stuff is so caustic that if it drips, it'll burn whenever it touches."}, {"time": 4319, "text": "And I was like, but Mike, you're gonna put that in my body."}, {"time": 4322, "text": "How the hell is it not gonna kill me?"}, {"time": 4324, "text": "He says, no, no, this is exactly what it's supposed to do."}, {"time": 4328, "text": "So when he prepped the IV tube to get it flowing, it spilled onto the tube and the tube started to smoke and burn."}, {"time": 4335, "text": "And I said, no effing way, Mike, you're not putting that in me."}, {"time": 4339, "text": "No way, no way."}, {"time": 4340, "text": "And he goes, listen, let me get another one."}, {"time": 4342, "text": "Let me start it over."}, {"time": 4343, "text": "And here he is wearing a hazmat suit, looking at me and I'm going, this is insane."}, {"time": 4347, "text": "And he goes, he looked at me, he took my hand and he says, Nels, if you don't take it, you're dead."}, {"time": 4354, "text": "He says, you got those three kids."}, {"time": 4355, "text": "I'm sorry, I have no other option."}, {"time": 4358, "text": "And I said, all right, Mike, okay."}, {"time": 4361, "text": "And he hooked me up."}, {"time": 4362, "text": "And you know what, it was like, you know, if you do drink alcohol and you have like a shot or want, you know, strong type spirit and you start feeling that burn."}, {"time": 4373, "text": "Well, the minute he hit me in the vein, it just started going up my arm, burning and then up my shoulder, across my neck, into my head, across the rest of my body, within a minute down to my feet."}, {"time": 4386, "text": "And I was writhing in pain for seven days and I was praying to die."}, {"time": 4392, "text": "I was the seventh rescuer in six months to come down with the rarest leukemia there is."}, {"time": 4397, "text": "There's only 500 cases in all of North America a year."}, {"time": 4400, "text": "And seven of us came down in six months."}, {"time": 4402, "text": "Two guys died during treatment."}, {"time": 4404, "text": "Seven responders, police, fire."}, {"time": 4407, "text": "Two guys died in the first couple of days of the treatment because it's so vicious, your liver, your heart, your kidneys, something will fail."}, {"time": 4415, "text": "And I was praying and I was praying, but I wanted to die."}, {"time": 4417, "text": "I was in so much pain."}, {"time": 4419, "text": "And I wouldn't take a painkiller because I know people with some issues and I just didn't want to go there."}, {"time": 4425, "text": "And finally on the last day I gave in, I said, please, I can't do this anymore."}, {"time": 4430, "text": "I was literally like jumping out of my skin and they gave me something."}, {"time": 4435, "text": "But it had burned out my mind, it burned out my body."}, {"time": 4438, "text": "I couldn't hear, I could barely see, it was vicious."}, {"time": 4441, "text": "But it worked."}, {"time": 4443, "text": "And my nurses especially, they just, they were so dedicated and devoted."}, {"time": 4448, "text": "And I was not an easy patient because I was in a lot of pain."}, {"time": 4451, "text": "It was bad and it was, drove my friends, my family crazy."}, {"time": 4456, "text": "It was just, it wasn't good."}, {"time": 4458, "text": "But on that first night I had a quick vision of all these people that I loved that were dead, that died."}, {"time": 4466, "text": "A lot of them in a trade center and I saw Johnny, I saw friends I grew up with."}, {"time": 4472, "text": "The last one was my mother in law who had passed six months before and she died of, she was in a coma, she had a stroke."}, {"time": 4479, "text": "She had a horrible, horrible last six months of life and it wasn't fair because she was so religious."}, {"time": 4485, "text": "She went to church every day, devout Catholic woman."}, {"time": 4489, "text": "And all of a sudden I see her and she's smiling and we used to talk a lot, it's the Irish thing, like the gab, the gift of gab."}, {"time": 4496, "text": "And she used to call me her boyfriend because we'd sit and talk for hours and talk about books and about movies and about food."}, {"time": 4503, "text": "I loved her, she was my friend."}, {"time": 4506, "text": "And she'd say, you know, my boyfriend's here."}, {"time": 4508, "text": "And all of a sudden she's smiling and she goes, hi, my boyfriend."}, {"time": 4511, "text": "And I says, Nan, Nan, what are you doing?"}, {"time": 4513, "text": "She goes, he's not ready, he doesn't want you."}, {"time": 4516, "text": "You gotta go back, you got things to do."}, {"time": 4519, "text": "And I'm like, no, Nan, Nan, it hurts so much."}, {"time": 4521, "text": "Please, please take me and she left."}, {"time": 4523, "text": "She goes, no, no, not yet, I'll see you."}, {"time": 4526, "text": "And she just faded away."}, {"time": 4528, "text": "And one of my doctors on my team, she had a problem with religion."}, {"time": 4535, "text": "And that's okay, I understand that."}, {"time": 4538, "text": "I'm not a preacher, I have a faith, but I don't preach it, I don't push it."}, {"time": 4541, "text": "I just live and let live."}, {"time": 4544, "text": "So she sent in this shrink to see me."}, {"time": 4547, "text": "And I was messed up from the chemo, but I knew what I was seeing, I knew what I was saying."}, {"time": 4553, "text": "And he was a Jewish gentleman."}, {"time": 4556, "text": "He was a rabbi also in a synagogue."}, {"time": 4559, "text": "And I actually had responded in that district and he knew 114 would run into Borough Park."}, {"time": 4564, "text": "Oh yeah, I see Tyler, oh, they come down the street."}, {"time": 4568, "text": "And he asked me to tell him the story and I did."}, {"time": 4571, "text": "And he started laughing and he scared me now."}, {"time": 4574, "text": "I says, Doc, am I really crazy?"}, {"time": 4575, "text": "He said, no, no."}, {"time": 4577, "text": "He said, I believe you, my friend."}, {"time": 4579, "text": "He said, we share the same God."}, {"time": 4583, "text": "He goes, we work in the same corporation, but in different departments."}, {"time": 4587, "text": "And he says, you did see your mother in law."}, {"time": 4590, "text": "He says, your faith is that strong."}, {"time": 4592, "text": "He said, I've had many patients express the same sentiments."}, {"time": 4595, "text": "He said, so I want you to listen to her and fight and be strong."}, {"time": 4600, "text": "And he said, so what else do you want to talk about?"}, {"time": 4602, "text": "I said, well, I don't know, Doc, am I that messed up?"}, {"time": 4604, "text": "He goes, no, no."}, {"time": 4605, "text": "He goes, they're paying me for an hour."}, {"time": 4606, "text": "It only took 20 minutes."}, {"time": 4608, "text": "So we watched the Yankee game together and that's less."}, {"time": 4611, "text": "But it was just, again, it showed the human condition."}, {"time": 4613, "text": "Here's these two men of two totally different faiths."}, {"time": 4617, "text": "And yet we shared that bond of faith."}, {"time": 4620, "text": "And he had empathy and he had sympathy."}, {"time": 4623, "text": "And he saw me in many other patients."}, {"time": 4628, "text": "So he just didn't assume."}, {"time": 4630, "text": "And he gave me a fair shake and I will always be grateful to him for that."}, {"time": 4635, "text": "Through any of this, the pain you had to go through with the leukemia, but also the days of 9 11 and after, did your faith get challenged?"}, {"time": 4646, "text": "You know, Lex, it was strange."}, {"time": 4648, "text": "It was times I was so angry."}, {"time": 4650, "text": "You know, there's that range of emotions, the anger, the denial, the depression, the this, the that."}, {"time": 4656, "text": "And this is the weirdest thing."}, {"time": 4657, "text": "It was mostly, I knew my career was over and they retired me out of the job."}, {"time": 4663, "text": "That, I got sick in August and that October, they told me I was out."}, {"time": 4668, "text": "And by the time I was processed and, you know, used up my leaves and whatever you want to say it was, I was officially retired in January of 02 and it was less than six months."}, {"time": 4681, "text": "And I'm there walking my dog one day, my rescued Greyhound who I miss."}, {"time": 4685, "text": "She was such a soul."}, {"time": 4686, "text": "God, she lived to be almost 13, Katie."}, {"time": 4689, "text": "And we were walking in the snow and I got the call."}, {"time": 4692, "text": "I was retired and I looked at her and I'm like, Katie, what am I going to do?"}, {"time": 4695, "text": "She just looked up and said, we're going to go on a lot more walks, you know?"}, {"time": 4698, "text": "And I was so sad and I was so sad and I was so angry because I lost my priesthood."}, {"time": 4704, "text": "I loved helping people."}, {"time": 4705, "text": "I really, like I would have done it for free."}, {"time": 4708, "text": "I would never tell Mayor Bloomberg that, right?"}, {"time": 4710, "text": "He's all about the buck, right?"}, {"time": 4712, "text": "But like, you know, honestly, I would have been a New York City fireman."}, {"time": 4715, "text": "I would have paid them to do it, you know?"}, {"time": 4717, "text": "And I wasn't allowed anymore."}, {"time": 4721, "text": "You have over 20 years and you have cancer."}, {"time": 4723, "text": "You know, back when my dad got sick, they'd let you hang around for 10, 12 years in an office, but not now."}, {"time": 4729, "text": "Now it's all about the bottom line."}, {"time": 4733, "text": "But I was more depressed about losing a job than almost losing my life."}, {"time": 4737, "text": "Like, as crazy as that sounds, you know?"}, {"time": 4739, "text": "And it just..."}, {"time": 4740, "text": "It was more than a job."}, {"time": 4741, "text": "I mean, it's a way of life."}, {"time": 4744, "text": "Oh, man, yeah."}, {"time": 4745, "text": "It also is your family, your father, your carrying torture, your father's... Oh, my friend."}, {"time": 4751, "text": "I love my friends."}, {"time": 4752, "text": "I love, we worked 24 hour shifts together."}, {"time": 4754, "text": "You cook, you clean, you break each other's jobs relentlessly."}, {"time": 4758, "text": "I mean, I love those guys so much."}, {"time": 4760, "text": "I mean, I hope that my kids and anyone that I know and care about, I hope they can experience the bond of that brotherhood that I experienced in my life."}, {"time": 4772, "text": "It was so... God, I would give anything to have it back."}, {"time": 4776, "text": "Just, yeah."}, {"time": 4777, "text": "Can I ask you about New York?"}, {"time": 4779, "text": "So unfortunately, I've never lived in New York."}, {"time": 4782, "text": "I visit."}, {"time": 4783, "text": "I've always wanted to live there for a bit."}, {"time": 4784, "text": "Obviously, it's a very different experience to have really lived in New York for many, many years."}, {"time": 4790, "text": "But there's a few friends of mine that are from..."}, {"time": 4794, "text": "They got similar accent as yours."}, {"time": 4797, "text": "That are a little bit saddened."}, {"time": 4800, "text": "Perhaps it's temporary, but perhaps not."}, {"time": 4803, "text": "They don't seem to think so of what New York has become, especially with COVID."}, {"time": 4808, "text": "It's losing some of the spirit of New York."}, {"time": 4812, "text": "Do you have that sense?"}, {"time": 4813, "text": "Do you have a hope for the city that has been so defining to what is America?"}, {"time": 4821, "text": "My heart's broken."}, {"time": 4822, "text": "I had moved to New Jersey many years ago, but I still have a close attachment to New York."}, {"time": 4827, "text": "My parents are still there, many, many family members."}, {"time": 4832, "text": "And I've since now moved to Tennessee."}, {"time": 4834, "text": "I needed to go somewhere quiet."}, {"time": 4836, "text": "I wanted to heal my fractured soul."}, {"time": 4838, "text": "And I'm in the middle of a beautiful farming rural area in middle Tennessee."}, {"time": 4845, "text": "And so they probably called me a sellout back in New York for leaving, but it's not the same city and it's sad."}, {"time": 4854, "text": "I'll refrain from the politics and the finger pointing, but it's a mess compared to what it was."}, {"time": 4861, "text": "And I did Broadway theater security for many years, and I started to see it slide like with stuff that was happening, like public urination and defecation and just like tourists don't wanna see that, right?"}, {"time": 4878, "text": "And I had an unfortunate incident two years ago."}, {"time": 4884, "text": "I was jumped by four teenagers coming off the subway and they were pissed off because I was wearing an American flag hat."}, {"time": 4891, "text": "And I don't know, I'm not really sure why, but it left me, I got out of it, okay."}, {"time": 4900, "text": "But I was taken back."}, {"time": 4903, "text": "They were literally videoing it and the kid was just throwing shadow punches at my face wanting to beat me up."}, {"time": 4908, "text": "And I finally looked him in the eyes and I was like, oh boy, I'm a little too old for this."}, {"time": 4912, "text": "Body's a little broken down for chemo."}, {"time": 4914, "text": "And I finally just said, all right, all right."}, {"time": 4916, "text": "I just had enough, I wanted to go home."}, {"time": 4919, "text": "Just worked a 17 hour shift as a stage hand."}, {"time": 4922, "text": "And I was so taken back, I was so insulted."}, {"time": 4924, "text": "I'm saying, I spent my life protecting this city and now I'm getting attacked like for nothing."}, {"time": 4930, "text": "And I just, I gave up and maybe I should have given it a little more time, but it's, I don't know, it's turned into an angry place."}, {"time": 4939, "text": "It's turned into, I think there's a lot of people that aren't getting the resources they need in a sense."}, {"time": 4946, "text": "There's a lot of mental illness."}, {"time": 4947, "text": "There's a lot of homelessness."}, {"time": 4949, "text": "There's a lot of violent people just roaming around the streets and it's not good."}, {"time": 4953, "text": "It's not safe."}, {"time": 4955, "text": "And tourists are not gonna come back."}, {"time": 4958, "text": "Even just leading up to the COVID, I had some tourists saying to me, I won't be back."}, {"time": 4963, "text": "And now I can only imagine that it's just gotten exponentially worse, but I hope there's a chance it'll swing back."}, {"time": 4969, "text": "Cause it is, it's the gateway to the world."}, {"time": 4970, "text": "I mean, my grandfather came from Denmark."}, {"time": 4975, "text": "He landed in Ellis Island in the twenties."}, {"time": 4979, "text": "American success story, 25 bucks in his pocket, didn't speak the language, had a sponsor family in Bay Ridge, Brooklyn."}, {"time": 4986, "text": "And he made it, you know, he ended up dying owning a bakery at one point and then an apartment building."}, {"time": 4993, "text": "And he did pretty well for himself for an immigrant who was poor."}, {"time": 4996, "text": "And my mom, my Irish mother landed in the same neighborhood, Bay Ridge, Brooklyn, 16 years old."}, {"time": 5004, "text": "Worked as a cashier 50, 60 hours a week in the supermarket and finished school at night."}, {"time": 5009, "text": "Married my father, the fireman, and, you know, lived the American dream."}, {"time": 5016, "text": "And it was all, it was all from New York."}, {"time": 5017, "text": "And my father's mom was from Irish immigrants and they all landed in Ellis Island."}, {"time": 5023, "text": "Well, my mom didn't cause it was closed at that point, but it's, there's people breaking down the doors to come to this country, right?"}, {"time": 5031, "text": "There's no one breaking down the doors to leave."}, {"time": 5035, "text": "And this is, this is a problem I have with people that aren't grateful for being here."}, {"time": 5038, "text": "And this, again, it's not political, just straight down the middle fastball."}, {"time": 5043, "text": "If you don't like it here, I'll show you the door."}, {"time": 5046, "text": "I'll get you the plane ticket."}, {"time": 5048, "text": "I mean, would you want to live back in Russia compared to here?"}, {"time": 5051, "text": "Would you, you might because of family ties, but I mean, if you had no ties to Russia or would you want to go to China right now and possibly end up in a labor camp or, right?"}, {"time": 5061, "text": "There's people busting down the doors to get to this place."}, {"time": 5064, "text": "It's not perfect."}, {"time": 5065, "text": "It's got its flaws, it's got its blemishes, you know, but it's a damn great place."}, {"time": 5072, "text": "It's the best country in the world."}, {"time": 5074, "text": "Yeah, and some of it, so first of all, I have hope for New York."}, {"time": 5077, "text": "I think that culture is very difficult to kill."}, {"time": 5080, "text": "I think it will persevere."}, {"time": 5082, "text": "And I think ultimately the same story with New York as with the rest of the United States, it has to do with leaders."}, {"time": 5089, "text": "And I'm always hopeful that great leaders will emerge."}, {"time": 5094, "text": "And the kind of leadership we see now and the kind of conversations we have now, I think it has to do with the prosperity and comfort."}, {"time": 5104, "text": "And in the face of hardship, I think great leaders will emerge."}, {"time": 5107, "text": "And yeah, I just think ultimately in the long arc of history."}, {"time": 5113, "text": "Well, leaders shouldn't become rich."}, {"time": 5115, "text": "They shouldn't become rich in the process, right?"}, {"time": 5117, "text": "You shouldn't go into political office as an alleged lunchbox kind of guy and then come out eating at the best steakhouse in the world."}, {"time": 5126, "text": "I mean, that's the problem with politics, right?"}, {"time": 5130, "text": "My Irish grandmother, God rest her, used to say, oh, those politicians, they're all like dirty diapers."}, {"time": 5135, "text": "They're full of shit and they stink."}, {"time": 5138, "text": "I don't give a crap what party they're in."}, {"time": 5140, "text": "Yeah, greed and power."}, {"time": 5141, "text": "We had to beg these guys, beg them for federal legislation to cover our medical bills, right?"}, {"time": 5147, "text": "There's a gentleman, John Field from the Feel Good Foundation."}, {"time": 5151, "text": "This guy is a lion of a man, a general, but with a soft, big, great heart."}, {"time": 5157, "text": "And John is a former construction worker who came to the 9.11 site the day after."}, {"time": 5165, "text": "He was one of those guys cutting the steel with torches and craning it out of the air."}, {"time": 5169, "text": "One of those hard hats that just, that never got the credit and the praise that we did as responders."}, {"time": 5178, "text": "And I don't mean that as a knock to responders, right?"}, {"time": 5181, "text": "I mean, we lost 37 Port Authority police officers, 23 NYPD officers, about a dozen emergency medical technicians and paramedics, three court officers from New York State courts and two federal agents, and I hope, and 343 New York City firefighters."}, {"time": 5201, "text": "We lost a ton of responders."}, {"time": 5203, "text": "But the recovery workers, thankfully weren't killed in that process, but there's hundreds of them now who are dead from illnesses because they came down to recover our people and the civilians and the poor lost souls that were killed at work that day."}, {"time": 5221, "text": "And John literally almost lost his foot in a construction accident at the site."}, {"time": 5227, "text": "An 8,000 pound I beam tore off half of his foot, ended up with massive sepsis, six months in the hospital, hundreds of thousand dollars in medical bills, and then no one wanted to pay him."}, {"time": 5241, "text": "So here's a guy, he's gonna lose his house, lose his life, lose everything."}, {"time": 5245, "text": "And now the never forget, it started quick, right?"}, {"time": 5250, "text": "And he went on a mission, formed his Feel Good Foundation."}, {"time": 5255, "text": "His last name is Feel, F E A L, Feel Good Foundation."}, {"time": 5258, "text": "And this man literally went to Washington, DC with his army, as he called it."}, {"time": 5265, "text": "And I was honored and blessed to be with him a couple, only a couple times."}, {"time": 5268, "text": "I wish I had dedicated some more time to it."}, {"time": 5273, "text": "And what it was with John is he set out on a mission to get, and initially what he did is he got funding to take care of responders who were in that limbo, who couldn't get their medical bills paid, who couldn't make their mortgages, who couldn't make their car payments, who couldn't make their childcare payments."}, {"time": 5289, "text": "And John just took it upon his own to get donations and take care of you while you were suffering, right?"}, {"time": 5294, "text": "I got a call when I got out of hospital."}, {"time": 5296, "text": "You okay?"}, {"time": 5297, "text": "You need anything?"}, {"time": 5298, "text": "I said, who is this?"}, {"time": 5299, "text": "It's John Feel."}, {"time": 5300, "text": "I said, aren't you that constructor?"}, {"time": 5302, "text": "Yeah, you need anything?"}, {"time": 5303, "text": "I'm pretty good right now."}, {"time": 5305, "text": "I said, I appreciate it."}, {"time": 5306, "text": "Phone ring again a few weeks later."}, {"time": 5307, "text": "Hey, John Feel, you need anything?"}, {"time": 5309, "text": "I'm like, this guy's incredible."}, {"time": 5311, "text": "But there's people who needed stuff and he was getting it done."}, {"time": 5315, "text": "And he, with his army, had to chase these politicians through the halls of Congress to get funding to cover the medical bills."}, {"time": 5324, "text": "I was getting sued for $125,000 for my month stay in the cancer ward."}, {"time": 5329, "text": "And I couldn't believe it."}, {"time": 5332, "text": "I said, well, wait a minute, I have insurance."}, {"time": 5333, "text": "They're like, oh, no, no, this is terrorism related."}, {"time": 5336, "text": "We don't cover that."}, {"time": 5337, "text": "So usually then workers comp will cover your on duty injury or illness."}, {"time": 5341, "text": "Oh, no, no, no, leukemia is not covered under that."}, {"time": 5345, "text": "So then the ping pong game starts and I'm literally have people showing up, taking pictures of my kids in front of the house."}, {"time": 5353, "text": "And I went and grabbed the guy one day by the collar."}, {"time": 5355, "text": "So who the hell are you?"}, {"time": 5356, "text": "Sir, I'm a private investigator."}, {"time": 5358, "text": "We're putting a lien on this property due to a nonpayment of a bill."}, {"time": 5361, "text": "I said, okay, I understand."}, {"time": 5363, "text": "Do your job."}, {"time": 5364, "text": "Let me bring my kids inside."}, {"time": 5365, "text": "Take all the pictures you want."}, {"time": 5367, "text": "Don't step on my front lawn."}, {"time": 5369, "text": "And I went in the house."}, {"time": 5372, "text": "I closed my room, my door, my door, my room, and I cried."}, {"time": 5376, "text": "I said, I can't believe this."}, {"time": 5378, "text": "I spent my entire adult life trying to help people, give of myself, and I can't even get my medical bill paid."}, {"time": 5385, "text": "Well, John Field got my medical bill paid."}, {"time": 5388, "text": "He finally got these politicians with his team, firefighter Ray Pfeiffer, who has since died, fought with terminal cancer for nine years in a wheelchair."}, {"time": 5400, "text": "Literally at the end, came out of hospice to go finalize getting us this coverage."}, {"time": 5406, "text": "Detective Luis Alvarez, who testified days before he died in front of Congress, and a bunch of other guys that were really, really sick, and we had to shame these people into signing on."}, {"time": 5419, "text": "And luckily we had John Stewart come on and literally just hound these guys and shame them and embarrass them."}, {"time": 5428, "text": "And what it all stemmed from was in 2006, the first death that was determined to be linked to 9 11, there was others, but the first one that was officially linked was a New York City police detective who initially, the city said he died of advanced lung disease."}, {"time": 5444, "text": "His lungs were protruding out of his body."}, {"time": 5447, "text": "And he was on painkillers and it was so bad at the end that the doctor said, just grind them up, snort them, drink it, whatever you need to do to get instant relief."}, {"time": 5456, "text": "So when they found the talcum from the pill lining in his lungs, they said, oh no, this is opiate abuse."}, {"time": 5462, "text": "He didn't die of lung disease."}, {"time": 5464, "text": "So they said, and the mayor was quoted as saying, he is not a hero."}, {"time": 5468, "text": "Well, shame on you, Mr. Mayor."}, {"time": 5470, "text": "He was a hero."}, {"time": 5472, "text": "And his father, who was a retired police chief, married up with the Feel Good Foundation and John Stewart and Ray Pfeiffer, Detective Alvarez."}, {"time": 5483, "text": "And they got us all covered."}, {"time": 5485, "text": "But it took so long."}, {"time": 5486, "text": "Like it was so heartbreaking."}, {"time": 5488, "text": "These people who were lining up three deep politicians, three deep to catch a picture with a responder so they can tweet, hashtag never forget and hashtag look at me and hey, how am I doing?"}, {"time": 5500, "text": "All that bull crap."}, {"time": 5501, "text": "They were nowhere to be freaking found."}, {"time": 5503, "text": "I literally witnessed them hiding in cloak rooms, running down hallways away from us, those freaking cowards."}, {"time": 5511, "text": "That's cowardice."}, {"time": 5512, "text": "Can I just linger on the John Stewart thing, the comedian, actor, John Stewart, his testimony before Congress over the benefits for 9 11 first responders."}, {"time": 5522, "text": "I mean, there's a lot of important human beings in the story, but he has a big voice."}, {"time": 5528, "text": "And he spoke from the heart."}, {"time": 5530, "text": "What do you make of that testimony?"}, {"time": 5532, "text": "Oh, it was heartfelt."}, {"time": 5533, "text": "I mean, he spoke."}, {"time": 5536, "text": "Look, I mean, John was a polarizing guy, right?"}, {"time": 5540, "text": "There's certain things like over the years, he was cutting edge and I might not have agreed with all of his, you know, some stuff, some not, right?"}, {"time": 5548, "text": "You know, like we all, but I tell you, I found him as funny."}, {"time": 5551, "text": "I enjoyed his humor."}, {"time": 5553, "text": "I would love the two of you to have a conversation."}, {"time": 5555, "text": "No, but again, I love a guy where you can have, you can have a difference in opinions."}, {"time": 5559, "text": "That's the beautiful thing about the firehouse kitchen."}, {"time": 5561, "text": "I mean, it could get raucous and now, I don't know, it's a little different situation, but I mean, back in the day, some funny stuff."}, {"time": 5568, "text": "But yeah, John, John literally just took his talents."}, {"time": 5572, "text": "You would think he was speaking from the heart of a fireman or a cop or a soldier or a Marine, you know, someone who was there."}, {"time": 5580, "text": "But I think he especially got to know Ray so well and Ray had this stack of mask cards from, you know, the funeral cards they give out."}, {"time": 5591, "text": "It looks like, you know, a larger business card that's laminated."}, {"time": 5595, "text": "And Ray had a stack of them he would carry around."}, {"time": 5598, "text": "I think it was close to a hundred cards and John saw it and he said, what's that?"}, {"time": 5603, "text": "He says, these are my cards."}, {"time": 5605, "text": "He said, for what?"}, {"time": 5606, "text": "He says, for my brother's funerals."}, {"time": 5608, "text": "He was like, oh my God, you've been to that many funerals?"}, {"time": 5612, "text": "He goes, yeah, this is just the ones I made."}, {"time": 5615, "text": "Like, you know, and John, I think was just stunned."}, {"time": 5621, "text": "And John actually had that stack of cards after Ray passed and like said, look, look at these."}, {"time": 5628, "text": "There's gonna be more of these cards."}, {"time": 5630, "text": "We have one guy a week or girl, one responder or a recovery worker or someone who actually resided down there."}, {"time": 5638, "text": "There's more than one a week dying."}, {"time": 5640, "text": "It's one a day dying on average."}, {"time": 5644, "text": "And on average, two people are diagnosed with a 9 11 cancer or disease."}, {"time": 5649, "text": "Right now, the worst part is there's autoimmune diseases flying off the graph and they're not covered under the legislation."}, {"time": 5657, "text": "By the grace of God, my cancer is covered."}, {"time": 5659, "text": "If my cancer comes back, I mean, I'm in remission."}, {"time": 5662, "text": "It's technically incurable, but I've been blessed I'm staying ahead of this stuff going on 10 years."}, {"time": 5668, "text": "But if it comes back with a vengeance tomorrow and takes me, at least my wife will get my pension and be able to live her life without fear."}, {"time": 5676, "text": "But my friends who are suffering from these advanced autoimmunes, their wives get nothing."}, {"time": 5681, "text": "Their pension dies with them."}, {"time": 5683, "text": "And we're hoping that John and his army can shame these politicians once again to have the kindness and decency to cover these autoimmunes."}, {"time": 5695, "text": "You know, they're throwing a lot of money around at a lot of things lately."}, {"time": 5699, "text": "And this is one that they won't."}, {"time": 5703, "text": "And these are lives in the balance who really need it."}, {"time": 5705, "text": "And John had this strong line."}, {"time": 5708, "text": "They did their jobs, do yours, talking to the politicians."}, {"time": 5713, "text": "And it's a strong wake up call that it's not about the Twitter or the social media or all that kind of stuff."}, {"time": 5723, "text": "You have a job to do and you have to, it's that compassion implemented in the form of money of helping people that were there for you when you needed help."}, {"time": 5735, "text": "Well, we had a guy, I mean, I might get audited out of this one, I hope not, but we had a Congressman from out West, I won't say where, but he prided himself on saying he was a retired cop, a busy cop, 22 years."}, {"time": 5749, "text": "He said no on the legislation."}, {"time": 5752, "text": "I witnessed a cop who was dying get out of his wheelchair and said, hey brother, I got a half a million dollars in medical bills and I'm a short timer."}, {"time": 5762, "text": "I got a few months to live."}, {"time": 5763, "text": "Who the F is gonna pay him?"}, {"time": 5766, "text": "Do the right thing."}, {"time": 5767, "text": "You say you're a cop, you show me you're a cop and you sign that paper."}, {"time": 5771, "text": "And the guy started tearing up the Congressman and he signed it, but he had to be freaking shamed."}, {"time": 5776, "text": "And you know what he said?"}, {"time": 5777, "text": "Well, this doesn't really confront me."}, {"time": 5778, "text": "This is pork as far as my district is concerned."}, {"time": 5781, "text": "He goes, oh yeah, do you know there's 10 guys from your district who came across the country to help us that are also dying?"}, {"time": 5787, "text": "He had no idea."}, {"time": 5790, "text": "And that's the sad part about Alex."}, {"time": 5793, "text": "It's a failure in leadership."}, {"time": 5797, "text": "I think some people would vote for Mickey Mouse just because if he ran."}, {"time": 5800, "text": "I mean, I have no offense against Mickey Mouse."}, {"time": 5802, "text": "I like him, he's a good guy, right?"}, {"time": 5803, "text": "I mean, but like, I mean."}, {"time": 5805, "text": "Allegedly, supposedly."}, {"time": 5807, "text": "But seriously, I look at some of the leaderships sometimes and go, we're in trouble."}, {"time": 5814, "text": "And also you lose, I think the way government is structured is people who are senators or people who are in Congress, they start playing a game between each other and they lose track of the connection to the people, to the basic humanity."}, {"time": 5832, "text": "So you forget, even when you think of yourself as a cop, you forget what are like the cops and the other people servicing the community actually experiencing all the troubles they're going through and how they can actually be helped because you lose touch to that because you're not actually living, you're not talking to them, you're not living among them."}, {"time": 5851, "text": "And I mean, that's a natural part of the system, but I think that's why character and great leadership is important is you say you leave the game of Congress and you go back to the people."}, {"time": 5863, "text": "I mean, that's what the country, it's like the George Washington ideal is you're not playing a game of power."}, {"time": 5871, "text": "You're ultimately see yourself as somebody who's servicing this country's service in the community and that requires talking to the people in their time of hardship."}, {"time": 5879, "text": "Well, you have some people serving in congressional districts don't even live in that district."}, {"time": 5885, "text": "I mean, so how are they gonna empathize?"}, {"time": 5886, "text": "They're not even driving through there on a daily basis."}, {"time": 5889, "text": "And again, when anything becomes lucrative from a financial standpoint, it blurs people's vision."}, {"time": 5900, "text": "You have to take the potential of becoming rich out of politics."}, {"time": 5906, "text": "Politics is public service."}, {"time": 5908, "text": "Police and fire and EMS are public service, but cops and firemen and medics don't walk out of their career with gazillion dollar contracts with this company and that company on that board of directors and this board of directors."}, {"time": 5926, "text": "They walk out with a pension and that's it."}, {"time": 5929, "text": "And you have to wonder the intentions of people getting into politics."}, {"time": 5932, "text": "Are they truly going into to help the human condition or are they trying to help their own damn condition with their wallet and their pocketbook?"}, {"time": 5941, "text": "And I try to lean toward the latter lately with what I'm seeing out there."}, {"time": 5945, "text": "Well, some of them are the good ones and that's our job as a society is to elevate the good ones."}, {"time": 5950, "text": "That's it and that has to do with the ideals that we elevate."}, {"time": 5955, "text": "There are a number of conspiracy theories around the events of 9 11."}, {"time": 5962, "text": "Do any of these hold true to you or do they just frustrate you, even anger you?"}, {"time": 5970, "text": "I've been asked this by a few different people in my life."}, {"time": 5976, "text": "This is my take on it, right?"}, {"time": 5978, "text": "You're a man of science and a man of education."}, {"time": 5981, "text": "So you..."}, {"time": 5983, "text": "Allegedly, but yes, but you're a very, very intelligent man."}, {"time": 5987, "text": "And what I believe took place is this."}, {"time": 5992, "text": "Structural steel will fail at a sustained temperature of 1500 degrees Fahrenheit."}, {"time": 6001, "text": "And I don't know exactly how long that would have to be sustained, but that's the temp, right?"}, {"time": 6007, "text": "Diesel fuel, kerosene fuel, kerosene based jet fuel, which was the ignition there burns at 2200 degrees Fahrenheit."}, {"time": 6019, "text": "So that continued burning of that diesel, that jet fuel, but kerosene based, it's all kind of similar exceeded the temperature needed for that steel in the structural members of the trade center to fail."}, {"time": 6036, "text": "In my heart of hearts, I would hate to ever think that somebody affiliated with our government with some sort of agenda would perpetrate that crime and that tragic just destruction of humanity and property for some other form of gain."}, {"time": 6059, "text": "Those planes rammed into those buildings at 450 miles an hour."}, {"time": 6063, "text": "They were loaded with thousands and thousands of gallons of jet fuel."}, {"time": 6066, "text": "Number seven trade center had the backup for the emergency management system for the city."}, {"time": 6075, "text": "And it was an emergency generator in that complex which had a 25,000 gallon tank of diesel fuel to continually run for weeks to keep the 911 system, the backup system going in the case of a catastrophic event."}, {"time": 6092, "text": "Well, that tank in seven heated up from the fire that was already going on from the aircraft debris coming into the building."}, {"time": 6101, "text": "So once that diesel became ignited in seven, now you had enough temperature to fail that steel in that building."}, {"time": 6111, "text": "So I would like to truly believe what I've learned from the minimal fire science knowledge I have from my career, that it was just a matter of, it burned too long, it burned too hot and it failed."}, {"time": 6126, "text": "I mean, if you look at the way it came down, it came down as it was designed to in the God forbid event that it was to collapse."}, {"time": 6134, "text": "It came down pancaking upon itself."}, {"time": 6137, "text": "If it had failed horizontally and just sprayed out side to side, those buildings would have dropped for a quarter, half a mile up to Canal Street."}, {"time": 6149, "text": "But you know, Lex, I can't."}, {"time": 6150, "text": "The fire and the destruction that could have resulted."}, {"time": 6152, "text": "Yeah, oh my gosh, it could have been so much worse."}, {"time": 6155, "text": "I mean, you would have taken out every building from that point all the way up."}, {"time": 6161, "text": "But in my heart, I'd like to just believe that it was just a fire that burned too long and too hot."}, {"time": 6166, "text": "These planes cause structural damage upon impact in both buildings and it was just a matter of time."}, {"time": 6173, "text": "And then you think about it, you add all the plastics, all the carpeting, all of the stuff that was burning on those floors."}, {"time": 6180, "text": "You add that to that fire load."}, {"time": 6183, "text": "I think it just had enough to collapse it."}, {"time": 6185, "text": "And you were in building seven for part of that day."}, {"time": 6189, "text": "I was just after it came down as well."}, {"time": 6192, "text": "We were aside it and we weren't in it or next to it when it actually did come down."}, {"time": 6197, "text": "But moments after we were there."}, {"time": 6200, "text": "And again, I would like to believe that it just, it was just that that fuel was going and it just took its physics, took its course and it failed."}, {"time": 6214, "text": "So physics and science aside, it's hard."}, {"time": 6218, "text": "It's both I would like to believe and it's hard to imagine that anybody would be so evil as to orchestrate parts of this from within the United States government."}, {"time": 6227, "text": "That's very difficult for me to imagine."}, {"time": 6230, "text": "You know what though, Lex, there's people and I won't elaborate, I won't get into it."}, {"time": 6235, "text": "Any controversial subjects or what have you."}, {"time": 6240, "text": "There's some people that don't have any problem at all perpetrating any level of evil."}, {"time": 6245, "text": "People like you and I who have hearts and we have depth of soul."}, {"time": 6249, "text": "We couldn't imagine it, but there's other people wouldn't even be a second thought."}, {"time": 6253, "text": "I mean, I've seen some horrific incidents in my career that I go home shaking my head at night going, human beings are just, they're not wired right."}, {"time": 6263, "text": "You know, I mean, I look at animals, I love animals, I love dogs especially, right."}, {"time": 6268, "text": "And I see this dog park when I train to fly airplanes now and something I wanted to do."}, {"time": 6275, "text": "And there's a dog park across from the airport and there's 60 dogs and there's bones flying up in the air and chew toys and sticks and they're running around having the time of their life, right."}, {"time": 6286, "text": "And they're all getting along and they're not hurting each other."}, {"time": 6288, "text": "They're not violating each other."}, {"time": 6290, "text": "They're not canceling each other."}, {"time": 6293, "text": "And I'm going, we really need to learn from these dogs."}, {"time": 6296, "text": "Like, right."}, {"time": 6297, "text": "And like, I just, yeah."}, {"time": 6299, "text": "I mean, sometimes it sounds crazy, but I think they're a better species than people."}, {"time": 6304, "text": "Unless they're rabid, they don't hurt on purpose."}, {"time": 6307, "text": "They don't, you know, they don't cut you off in traffic and throw you the middle finger."}, {"time": 6310, "text": "And you know, they just don't do these acts of humanity that sometimes are so vicious."}, {"time": 6318, "text": "Why do you think these conspiracy theories of which there's a lot take hold?"}, {"time": 6324, "text": "Why do you think so many people believe some version of different conspiracy theories around 9 11?"}, {"time": 6331, "text": "Well, you know, like many things in life, it leaves me a little conflicted."}, {"time": 6335, "text": "I have to say this, I am at the point now, I don't know who to believe anymore."}, {"time": 6340, "text": "So I could see that lending a hand to someone who's already a doubter going, oh yeah, look, exactly, that's what they're doing, right."}, {"time": 6349, "text": "I mean, you know, look at this whole virus."}, {"time": 6352, "text": "Like, who do you believe?"}, {"time": 6354, "text": "Like, where'd it come from?"}, {"time": 6356, "text": "You know, like, and you know, if you plant that seed, it's like that little campfire we were talking about earlier, right?"}, {"time": 6364, "text": "You just toss a little gas into those embers."}, {"time": 6366, "text": "You got a fire now."}, {"time": 6368, "text": "I also think there's a lot of people with a hell of a lot of extra time on their hands, right?"}, {"time": 6372, "text": "And they're really bored."}, {"time": 6374, "text": "And the two are combined."}, {"time": 6375, "text": "Alex, yeah, man, you know, like, look, I was a three job Charlie, right?"}, {"time": 6379, "text": "You know, one guy used to say to me, anything but home."}, {"time": 6381, "text": "I go, no, I got deadlines, responsibilities."}, {"time": 6384, "text": "You know, like, that's what it comes down to is like, I mean, look, we all have our hobbies and things we like and, you know, little nuances."}, {"time": 6394, "text": "And that's what makes us special."}, {"time": 6396, "text": "We're unique."}, {"time": 6397, "text": "Every person is a unique being."}, {"time": 6400, "text": "But I also think some people just, they want to cling to something."}, {"time": 6406, "text": "Like, we all want to feel accepted and belong to something."}, {"time": 6408, "text": "So all of a sudden you group up with these people and you all believe this fervently."}, {"time": 6413, "text": "Like, yeah, yeah, yeah, you know, they did it."}, {"time": 6415, "text": "They took it down."}, {"time": 6417, "text": "And now you start going, yeah."}, {"time": 6419, "text": "And I think what happens is when you're in company of people and you start telling each other the same thing often, you freaking believe it."}, {"time": 6426, "text": "I mean, if you keep telling me I got a gray head of hair, I'm going to go, you know what?"}, {"time": 6430, "text": "But no, I don't."}, {"time": 6431, "text": "I mean, right?"}, {"time": 6432, "text": "I got that waving bye bye do."}, {"time": 6433, "text": "But like, but you know, I think when you start hearing something often, you start believing it."}, {"time": 6438, "text": "But I'm not going to, I'm not going to doubt their intelligence."}, {"time": 6441, "text": "I'm not going to doubt their intentions, but I just don't see it as being plausible."}, {"time": 6445, "text": "I just, I, it would be too, too big of an operation to successfully happen."}, {"time": 6453, "text": "I, you know, I mean, look, there's other things that, you know, I won't say it on the interview there, but like I have my doubts with certain things, you know, that, that."}, {"time": 6465, "text": "I mean, conspiracy theories take hold for a reason."}, {"time": 6469, "text": "Cause some of them are true."}, {"time": 6472, "text": "The hard thing is just to know which ones is the problem."}, {"time": 6475, "text": "When you don't have facts, right?"}, {"time": 6477, "text": "Or you don't know who to trust."}, {"time": 6478, "text": "Sometimes when you don't have facts, when you don't have figures and you don't have science, it's hard to take someone's word on it."}, {"time": 6485, "text": "You know, I had a conversation with someone a while back, right?"}, {"time": 6488, "text": "And the guy's like, just, just dedicated atheist."}, {"time": 6493, "text": "And he thinks I'm an idiot for believing in God."}, {"time": 6496, "text": "And he's like, yo, you're one of those jerks who believes in creation."}, {"time": 6499, "text": "And I said, well, I do."}, {"time": 6500, "text": "Well, what about the big bang theory?"}, {"time": 6503, "text": "He's going on his diatribe about the science and the gases and the chemistry."}, {"time": 6506, "text": "And I'm going, dude, I barely got through high school chemistry, slow down."}, {"time": 6510, "text": "And he went on a tangent and all of a sudden I stopped."}, {"time": 6513, "text": "I went, who, who created the gas and the molecules and the stuff you're talking about and the collisions?"}, {"time": 6521, "text": "And he was furious and stoned off."}, {"time": 6524, "text": "And I got him."}, {"time": 6525, "text": "And again, I had no facts."}, {"time": 6527, "text": "I had no figure."}, {"time": 6528, "text": "He didn't either, but I stumped him."}, {"time": 6531, "text": "But sometimes when you can't show something, people need to see something tangible."}, {"time": 6536, "text": "They need to see it in their hand to believe it."}, {"time": 6539, "text": "And that's the real hard thing about faith."}, {"time": 6542, "text": "I see it in action."}, {"time": 6544, "text": "People restore my faith."}, {"time": 6546, "text": "And then I say to myself, well, there can't be that many dummies in this world if there's so many billions of us believing in this higher power, this higher, right?"}, {"time": 6553, "text": "I mean, and you said, you said earlier, like you believe most people are good and I do too."}, {"time": 6560, "text": "The bad outshine the good because the bad get the press."}, {"time": 6565, "text": "If it bleeds, it leads."}, {"time": 6566, "text": "That's just, you know, like, think about it."}, {"time": 6568, "text": "How many more damn zombie apocalypse movies can we make?"}, {"time": 6573, "text": "I didn't even know there was that many zombies."}, {"time": 6575, "text": "And it just seems like every other show is just guys like, you know, bashing each other's heads in with bats with nails in it."}, {"time": 6580, "text": "And it's like, after a while, it's like, all right, gosh, you gotta get a new boogeyman here."}, {"time": 6584, "text": "You know, right?"}, {"time": 6585, "text": "Like, but seriously, like."}, {"time": 6587, "text": "But meanwhile, human civilization is getting better and better."}, {"time": 6590, "text": "We're just like making Hollywood movies."}, {"time": 6592, "text": "They just."}, {"time": 6593, "text": "No, we're getting better and better, but we're treating each other worse and worse."}, {"time": 6595, "text": "You would think with all this technology and all the knowledge and all the, it's like, what the hell is going on sometimes?"}, {"time": 6601, "text": "Like, I really want to see the good."}, {"time": 6604, "text": "And I think maybe, maybe the level of bad that we're seeing was always existent."}, {"time": 6608, "text": "It's just now everything is instantaneous news and flashes and tweets and this and this."}, {"time": 6613, "text": "Like, like, you know."}, {"time": 6615, "text": "Well, with the technology we have, it's also come to the light."}, {"time": 6618, "text": "So you get to see all these fights."}, {"time": 6620, "text": "It almost, I think that's step one of dealing with the problem is revealing it in its full beautiful light."}, {"time": 6628, "text": "How much of a bickering species we are."}, {"time": 6629, "text": "50 years ago, a guy like me who loves to talk, how the hell would I have gotten an opportunity to have someone listen to me and have, right?"}, {"time": 6638, "text": "But like, but you didn't have that arena."}, {"time": 6641, "text": "You didn't have all these things."}, {"time": 6642, "text": "My grandfather, Nels, God rest him, he died in 1979."}, {"time": 6645, "text": "I mean, that dude didn't even want to have a checking account."}, {"time": 6648, "text": "He would walk to each store, each, the phone company, the gas company, this company, and pay the bill in person."}, {"time": 6654, "text": "He didn't trust the bank."}, {"time": 6657, "text": "And it was like, now, ATMs, this, that, he would be overwhelmed."}, {"time": 6661, "text": "He'd be just like, I mean, I love my dad, but to watch him on his iPad is comical, right?"}, {"time": 6667, "text": "He calls my niece's boyfriend, who's a tech guy, Matt, Matt, if you listen, he's the greatest."}, {"time": 6672, "text": "He'll have this poor guy on the phone for like hours."}, {"time": 6674, "text": "Like the second you'll walk in to see my father, my kids, hey, do me a favor, you fucking straighten out this pad."}, {"time": 6680, "text": "And it's comical because I'm looking at my dad and I'm going, he was born when Hitler started World War II."}, {"time": 6689, "text": "And I'm going, he's seen all of that."}, {"time": 6690, "text": "Oh, my wife's grandmother was born in 1900 in Czechoslovakia and she died in 1998."}, {"time": 6695, "text": "I'm going, holy, the stuff she saw in the span of her life, just, it's just incredible."}, {"time": 6702, "text": "But what troubles me sometimes is with all of these advances and all these devices, this is what I say to my kids, look up from the phone and look up, right?"}, {"time": 6714, "text": "Because we don't talk anymore."}, {"time": 6716, "text": "I saw a girl literally, and I shouldn't say girl, guy, whatever, I saw a person literally just about walking to an open manhole cover texting."}, {"time": 6727, "text": "And I'm going, that's scary because your awareness is gone."}, {"time": 6731, "text": "And it's, I've been at restaurants, groups of people and they're texting, they're texting each other just sitting on the other side of the table."}, {"time": 6740, "text": "I'm like, put the freaking thing down and have a conversation."}, {"time": 6743, "text": "And that's the thing, we've lost the art of conversation."}, {"time": 6746, "text": "You know, like, my wife runs, she has this running joke."}, {"time": 6750, "text": "She goes, there's a lot going on up there."}, {"time": 6751, "text": "And I'm like, yeah, because I really, I'm inquisitive."}, {"time": 6754, "text": "I'm excited about life."}, {"time": 6755, "text": "I love to meet people."}, {"time": 6756, "text": "I love to learn."}, {"time": 6757, "text": "I love, and the only way you can do that is to have a conversation."}, {"time": 6760, "text": "The hilarious thing about this, so you're obviously very charismatic."}, {"time": 6763, "text": "You got great stories."}, {"time": 6764, "text": "You're a great human being."}, {"time": 6766, "text": "And you're talking to a guy who spent most of his life behind a computer hiding from people."}, {"time": 6770, "text": "No, no, and I don't."}, {"time": 6770, "text": "But we're like trying to bridge this."}, {"time": 6772, "text": "Right, but I don't mean that as a rip, but you, I would never know that."}, {"time": 6775, "text": "I would never know that because you're very engaging."}, {"time": 6777, "text": "You're very, like, I would not know, like you don't have any impediments to your social skills, your personal, and that's, and again, I don't mean it as a knock to you and these young people."}, {"time": 6788, "text": "Well, no, but this is me trying to look up from a smartphone is having these conversations, talking to people."}, {"time": 6795, "text": "I mean, some of it could be, it's always hard to know."}, {"time": 6798, "text": "Some of it could be just you and I being old school, because you grew up before the internet."}, {"time": 6805, "text": "Maybe there is joy and deep human connection to be discovered inside the smartphone."}, {"time": 6809, "text": "We don't, it doesn't seem that way, because the smartphone's so new, maybe we just haven't figured out those things, because there's a globalizing aspect."}, {"time": 6819, "text": "There's a opportunity for you to connect with people from across the world in ways that."}, {"time": 6824, "text": "I have cousins in Ireland and England."}, {"time": 6827, "text": "I get a FaceTime or a WhatsApp and it's like, holy crap, they're, you know, three, 4,000 miles away and I'm having a conversation now."}, {"time": 6834, "text": "I used to send my grandma in Ireland a letter."}, {"time": 6838, "text": "I adored her."}, {"time": 6838, "text": "She passed when I was 10."}, {"time": 6841, "text": "And, no, I'm sorry, I was 11."}, {"time": 6843, "text": "And I sent her a letter, airmailed, and I'd wait and I'd wait, and about two weeks later, this airmail letter would come back and she'd call me Master Nils William Jorgensen."}, {"time": 6856, "text": "I would be so excited, open that bad letter."}, {"time": 6858, "text": "Handwritten, just like."}, {"time": 6858, "text": "Yeah, and like, and then I'd write her another one and I just couldn't wait for letters from granny."}, {"time": 6865, "text": "And now it's like, you know, that's kind of faded away."}, {"time": 6870, "text": "Yeah, I still write letters, by the way, handwritten."}, {"time": 6873, "text": "The way this all came about was I wrote a letter to someone to say thank you for cancer research."}, {"time": 6882, "text": "I'm blessed to be alive."}, {"time": 6884, "text": "My cancer, right?"}, {"time": 6885, "text": "That's a good starting point for any story."}, {"time": 6887, "text": "And my cancer was one that if I got it 15 years prior to 19, excuse me, 2011, I was a dead man, right?"}, {"time": 6895, "text": "15, 20 years before there was no drug to treat."}, {"time": 6898, "text": "I was gone, going home to see him."}, {"time": 6901, "text": "So there's this wonderful gentleman that donated hundreds of millions of dollars to cancer research, Mr. David Koch."}, {"time": 6909, "text": "He's since, God rest his soul, passed away."}, {"time": 6912, "text": "And he's a controversial guy, big time business titan."}, {"time": 6915, "text": "And, you know, there was, the press was just brutalizing him one day over something to do with his politics."}, {"time": 6922, "text": "Now, I'm a union guy, proudly served in unions, still in a union, you know?"}, {"time": 6927, "text": "And he was not, you know, most business guys don't like unions, right?"}, {"time": 6932, "text": "But, you know, most guys like me don't like working for $3 an hour, so we like our unions, right?"}, {"time": 6938, "text": "And I reached out across the table, so to speak, and I sent him a handwritten letter to thank him, to say, we may not agree on everything, but I can't thank you enough."}, {"time": 6947, "text": "There's just this regular dude out there who is now living his life, watching his kids grow."}, {"time": 6952, "text": "Thanks to generous people like you who believe enough in cancer research, you've saved my life."}, {"time": 6957, "text": "Maybe, I can't say his exact dollars, but people like him."}, {"time": 6961, "text": "And he reached back out and his secretary said, oh, he'd like to talk to you on the phone."}, {"time": 6965, "text": "I go, well, he's kind of a busy guy, he wants to talk to me, he's a billionaire."}, {"time": 6968, "text": "And he got on the phone, he was like the greatest guy in the world."}, {"time": 6971, "text": "Invited me up to Sloan Kettering to dedicate a new cancer wing."}, {"time": 6974, "text": "It was like I was hanging out with my dad."}, {"time": 6977, "text": "And the sweetest man, just so kind, so empathy, because he was a cancer survivor."}, {"time": 6983, "text": "But now he's got the means to help people who've suffered his fate to a better place."}, {"time": 6992, "text": "And he was so real and it was so beautiful just to get to know, say, hey, you know what?"}, {"time": 6997, "text": "This guy is a big time guy, but yeah, he's just a regular human like you and I. I'm a guy who went to night college and I went to the army and I'm a blue collar kind of dude."}, {"time": 7007, "text": "And here's this guy who went to MIT, like you, and he's a wildly successful billionaire, a genius."}, {"time": 7013, "text": "But yet he can sit down and mix it up with me and know that I was truly grateful."}, {"time": 7019, "text": "And that to me was just like one of the coolest little relationships I've ever had."}, {"time": 7025, "text": "It wasn't like we were hanging out, having barbecues together, but like, you know, it was just, I was so touched by his decency."}, {"time": 7031, "text": "Well, the basics of the, like cancer reveals, you know, it's like fundamental to the human experience."}, {"time": 7038, "text": "It's trauma, it's tragedy."}, {"time": 7040, "text": "It's like money, who gives a shit about money?"}, {"time": 7042, "text": "Education, all of that is like weird new inventions."}, {"time": 7047, "text": "You know, life is short."}, {"time": 7049, "text": "You suffer with the various diseases."}, {"time": 7051, "text": "And that is a reminder that life is short and a reminder of the basic human connection."}, {"time": 7056, "text": "And that's why you can bridge that gap."}, {"time": 7059, "text": "All sparked by a handwritten letter, which just makes for a hell of a story."}, {"time": 7062, "text": "And you know what, Lex?"}, {"time": 7063, "text": "This is the commonality between us."}, {"time": 7065, "text": "A guy with three jobs to a billionaire."}, {"time": 7068, "text": "We both had that sense of a sledgehammer to the chest."}, {"time": 7071, "text": "Boom, you have cancer and you can't breathe for like 30 seconds."}, {"time": 7078, "text": "And then when your heart's just about to kick off and you take a breath and you go, I'm sorry, what'd you say, doc?"}, {"time": 7084, "text": "You have cancer."}, {"time": 7086, "text": "And it don't matter what kind."}, {"time": 7088, "text": "One of my best buddies, Bobby's going through right now, a prostate, and I got way too many of my buddies with cancer, right?"}, {"time": 7095, "text": "My buddy, Hugh, who became a vet since his first cancer, he was a fireman, he's now a veterinarian, right?"}, {"time": 7100, "text": "He diagnosed me actually over the phone, by the way."}, {"time": 7104, "text": "When they couldn't figure out what was wrong with me."}, {"time": 7105, "text": "Well, Dr. Hugh, he nailed it to the T. And we talk."}, {"time": 7112, "text": "And the same thing that the dozen of my close friends that have cancer, the same thing we say is the fear."}, {"time": 7119, "text": "So Mr. Koch and I, we shared that same sledgehammer to the chest and that same fear."}, {"time": 7126, "text": "And it didn't matter how much money he had and how much I didn't."}, {"time": 7129, "text": "And you know, it's just like the morning of the trade center."}, {"time": 7132, "text": "There was big time brokers who went to their demise, right?"}, {"time": 7137, "text": "Working in these firms, God rest them."}, {"time": 7139, "text": "And there was dishwashers, excuse me, dishwashers up on the windows on the world restaurant on the 107th floor, making five bucks an hour."}, {"time": 7148, "text": "And they died together, it didn't matter."}, {"time": 7150, "text": "It didn't matter if you had an armored car loaded with bills, you were done that day."}, {"time": 7155, "text": "And that's, I think where people need to humanize each other."}, {"time": 7159, "text": "Just because you drive around in a nice car and you got your own jet and you got this and you got that, don't mean nothing."}, {"time": 7166, "text": "When you're going, when you're in that vulnerable spot, you could have more money than the US reserves."}, {"time": 7174, "text": "Federal reserve, or you could have a welfare check."}, {"time": 7178, "text": "You're going."}, {"time": 7180, "text": "I learned that in a cancer ward."}, {"time": 7181, "text": "I had people in my ward that died on me."}, {"time": 7185, "text": "I was going around as a little bit of an ambassador because I was trying to, I was putting on a fake, I was putting on a fake like I got this, I got this."}, {"time": 7194, "text": "But when I got past that seven days of torture and the days leading up to it, I'd go around and try to comfort the other cancer patients."}, {"time": 7205, "text": "I had this one older African American gentleman, he couldn't talk because he had such advanced throat cancer."}, {"time": 7210, "text": "He was my roommate for a little while, but then he got worse so they had to put him by himself."}, {"time": 7216, "text": "And you couldn't understand what he was saying because his throat was just so radiated from the radiation."}, {"time": 7222, "text": "But if you put your ear down to him, you could make out what he was saying."}, {"time": 7228, "text": "And I'm not faulting the nurses for maybe not wanting to do that, right?"}, {"time": 7231, "text": "They're busy, they got a ton going on, they can't spend, you know."}, {"time": 7236, "text": "So if he was in need, I'd put my ear down and I'd find out and I'd go get it for him."}, {"time": 7242, "text": "So when they moved me down the hall, they asked me to come down with my IV tower."}, {"time": 7250, "text": "He needed me."}, {"time": 7252, "text": "And I knew it was bad because he just, his look was gone."}, {"time": 7257, "text": "And I said, sir, what do you need?"}, {"time": 7261, "text": "And he whispered, call my sister, I'm going."}, {"time": 7266, "text": "He had only one survivor in his whole life."}, {"time": 7269, "text": "And she was in North Carolina and he wanted her to know she couldn't get up, she was elderly."}, {"time": 7274, "text": "And I got the nurse and I got on the phone and I called his sister and I said, ma'm, I explained who I was."}, {"time": 7283, "text": "And I said, he can't really talk."}, {"time": 7286, "text": "He can't really verbalize too well right now, but he wants to say he loves you."}, {"time": 7298, "text": "And I put the phone down and he told her he loved her and he said, I'm going home."}, {"time": 7306, "text": "And that was it."}, {"time": 7307, "text": "And I hung the phone up and I said, ma'm, I'm so sorry."}, {"time": 7310, "text": "I said, you know, they'll notify you."}, {"time": 7313, "text": "And I stayed with him for a while holding his hand and then, you know, they wanted him to rest."}, {"time": 7317, "text": "And then I left and then I got the tap an hour later and they said, I'm sorry, he's gone."}, {"time": 7325, "text": "And then there was another girl and she was a young girl from one of the areas I work, young African American girl where I used to respond and I didn't know her, but I knew her neighborhood."}, {"time": 7335, "text": "And she had what I had, but they weren't sure which one."}, {"time": 7340, "text": "You know, leukemias, they're an elusive beast."}, {"time": 7342, "text": "There's 49 of them, right?"}, {"time": 7344, "text": "And each one of them is like, they got their own little nuances, own specific treatments."}, {"time": 7350, "text": "So if they don't know what you have, they don't know what to do for you."}, {"time": 7354, "text": "And she refused to let him drill into her hip to take the marrow because it's vicious."}, {"time": 7357, "text": "It hurts so much."}, {"time": 7358, "text": "It's like someone born into your hip with a wood drill and it's no joke."}, {"time": 7365, "text": "And they asked me to try to convince her to let them do that or she was gonna die."}, {"time": 7372, "text": "Cause if they couldn't figure it out, it was advancing quickly."}, {"time": 7374, "text": "She was, so I talked to her and she said, I can't, I can't, I'm too scared."}, {"time": 7382, "text": "I said, but are you more scared to die?"}, {"time": 7383, "text": "And she said, I am."}, {"time": 7384, "text": "I said, okay, I'll stay with you."}, {"time": 7387, "text": "I'll hold your hand."}, {"time": 7388, "text": "You squeeze it as hard as you want."}, {"time": 7390, "text": "I said, if you want, they'll give you like a towel or something to bite on, whatever."}, {"time": 7394, "text": "I said, but you get that pain out, but you need to do this so you can get saved."}, {"time": 7399, "text": "And she said, okay."}, {"time": 7402, "text": "And they came in and they, this huge thick needle, they just bore it into you."}, {"time": 7407, "text": "And she's screaming for her life and she's squeezing my fingers so hard and so hard."}, {"time": 7412, "text": "And I said, that's okay, hon."}, {"time": 7413, "text": "You keep going, you keep going."}, {"time": 7414, "text": "We got it."}, {"time": 7415, "text": "It's just 10 more seconds, 10 more seconds."}, {"time": 7418, "text": "They got it."}, {"time": 7419, "text": "They figured out her treatment and they got her onto her road to recovery."}, {"time": 7424, "text": "And then I spent a long time asking God, why do I have cancer?"}, {"time": 7435, "text": "Then I stopped and I went, wait a minute."}, {"time": 7437, "text": "I didn't die that day with my friends."}, {"time": 7442, "text": "Shame on me for asking them why I have cancer."}, {"time": 7444, "text": "I had 10 years after 9 11 with such great ears."}, {"time": 7448, "text": "And I got to watch my little girl being born when John never got to see his son."}, {"time": 7456, "text": "So it was all gravy after that."}, {"time": 7460, "text": "And I said, but now I know why I have my cancer because I can empathize with people who have it."}, {"time": 7467, "text": "And I can try to be their voice when they can't talk, be their shield to try to take that pain because I can understand, I can walk their walk."}, {"time": 7481, "text": "And now I thank God for my cancer because it's made me a better human being."}, {"time": 7485, "text": "It's made me, I'm not gonna lie, it brought a lot of anger for a while and my family suffered it, but I really tried to go past that and heal and part of living out in the country."}, {"time": 7497, "text": "It's very, very healing for the mind and the soul."}, {"time": 7500, "text": "But I now thank God for the cancer because it humbled me."}, {"time": 7506, "text": "I didn't really need humbling."}, {"time": 7507, "text": "I wasn't an arrogant puffed up type of person at all, but maybe I was running away at myself a little bit and working on a TV show, I'm fine, man."}, {"time": 7517, "text": "30 at the time, well, I was 42, I got sick."}, {"time": 7520, "text": "Life was cruising, man, it was great."}, {"time": 7523, "text": "And then all of a sudden it was like a blow out on the highway in the middle of the night and you were just veering off towards the guardrail."}, {"time": 7530, "text": "Yeah, you remembered, you're reminded that you're mortal and that's ultimately a connection to all the rest of us."}, {"time": 7539, "text": "Oh yeah, it's a good thing though, because that's the problem, I think."}, {"time": 7542, "text": "There's a lot of people running around and thinking they're immortal, right?"}, {"time": 7546, "text": "You know, when you look at it, Lex, right?"}, {"time": 7547, "text": "You look at the heartache in a lot of segments of people and anytime like someone that's got fame and wealth and success and they die tragically, a lot of times it's from a substance abuse or just some horrible death."}, {"time": 7565, "text": "And I used to say to myself, how the hell would someone with that much money and that much fame and this freaking mansion and I love cars, my son and I are just big car heads, you know, I'm like, you know, this guy's got a collection of cars and he overdosed because he was sad."}, {"time": 7583, "text": "And I'm going, how the frig are you sad?"}, {"time": 7585, "text": "But then I stop and I go, okay, because maybe he doesn't have any idea who loves him."}, {"time": 7591, "text": "He's got a lot of people clinging onto him because of his success."}, {"time": 7595, "text": "And he just, he can't fill that void, you know?"}, {"time": 7600, "text": "And then they fill the void with something destructive."}, {"time": 7602, "text": "And I'm not bashing people that have substance abuse problems or alcohol problems, I don't mean it that way."}, {"time": 7609, "text": "But what I mean is it's just sad that their level of despair is so high, on the surface, they look like they just got everything going on."}, {"time": 7619, "text": "It's all great, right?"}, {"time": 7620, "text": "They're still human, still got to deal with the same."}, {"time": 7622, "text": "Yeah, exactly, because they want love, right?"}, {"time": 7625, "text": "They want love and they can't really find it."}, {"time": 7631, "text": "Well, first of all, that's true for all of us."}, {"time": 7632, "text": "I think we're deeply lonely and looking for love and when we find it, that's what friendship is."}, {"time": 7637, "text": "And then that's true for whether you're super rich or super poor, it's all the same journey."}, {"time": 7643, "text": "My dad said all the time, kid, you're gonna end up working with hundreds of guys and you'll love a lot of them but he says when it's all said and done and you're all like me and if you've still got two or three of them that you talk to and you'll love."}, {"time": 7656, "text": "And I tell you what, I mean, I have thanked the Lord more than two or three of them and I have my six, I call it my six, it's the six guys that are gonna carry my coffin when I'm gone, right?"}, {"time": 7667, "text": "Because I know this cancer's gonna come back, I know it."}, {"time": 7670, "text": "Like we get multiples, right?"}, {"time": 7671, "text": "My friend Yvette just got his second."}, {"time": 7674, "text": "My friend Mike's had five of them."}, {"time": 7676, "text": "My other Mike has two of them, yeah."}, {"time": 7678, "text": "But I wasn't ready to accept it in 2011."}, {"time": 7683, "text": "There was so much more to do and it was so much, I was so scared, I'm like wow, who's gonna take care of my kids and who, you know, they were little."}, {"time": 7691, "text": "Nine, 11 and 14, right?"}, {"time": 7693, "text": "It's like what the hell, I have two girls and a boy in between and they're beautiful kids."}, {"time": 7697, "text": "They're such good, good children, adults now."}, {"time": 7700, "text": "I mean, but you know, my wife's a drill sergeant, she's tough, she don't mess, you know, she's this big."}, {"time": 7706, "text": "So you're the softy in the family, I'm just kidding."}, {"time": 7708, "text": "Well, you know, it's funny because my son said to me, my son's 21 now, he's a good kid, you know."}, {"time": 7715, "text": "And he says to me, back when he was like 12, he goes, dad, I don't want you to be offended but I'm really scared of mom, I'm not really that scared of you."}, {"time": 7724, "text": "And you know, like I cracked up because it's true, she's gotta stand on like a milk crate to reach him because you know, she's tiny and he's tall, but it's true, but you know, but she was hard but fair, but loved, that's, see, this is the thing, you take any child anywhere from any background, if you love them, you nurture them, you teach them and you guide them, you have a successful adult."}, {"time": 7749, "text": "And see, that's the problem in our society, it's not judgmental, I'm not judging anyone, but we need to try harder as parents as siblings, as friends, but especially when we're blessed with a child, it's like, you gotta put that child first, it's like being a military personal responder, it's not about you anymore, now it's the team."}, {"time": 7775, "text": "So that little child is now the team and you know, your wife or your significant other, you know, like it's not about you anymore."}, {"time": 7811, "text": "And I look back and I go, wow, I wish I didn't work so much and I wish, but then I say, no, but it was okay, my wife stayed home, good lessons, good, you know, just like."}, {"time": 7822, "text": "But ultimately, like you said, it's love."}, {"time": 7824, "text": "It is, it's the common, love is the most important ingredient on this earth and that's the problem what's going on right now, like take politics out of it, right?"}, {"time": 7837, "text": "Take polarizing each other against each other, take all that crap out of it and just airdrop a bunch of love, right?"}, {"time": 7845, "text": "Like when I worked on Rescuing Me, right?"}, {"time": 7849, "text": "I love those people so much, they were such great, we had such a great crew and they worked so hard."}, {"time": 7853, "text": "You're a celebrity."}, {"time": 7854, "text": "No, no, no, not at all."}, {"time": 7855, "text": "If I was, it didn't really work out so good."}, {"time": 7858, "text": "I went on to be in the stagehand, no, I'm not pretty, but they don't want old guys waving bye bye hairdos, but it was funny, the crew, we became really tight, we had like, shoot, like 80, 90 people on a set, right?"}, {"time": 7874, "text": "And you know, the first few episodes, everybody's trying to feel each other out because you know, you work with different crews, different people and this is going back, starting in 2004, so it was a different time and I love to hug people because to me, a hug is a true expression of love and caring."}, {"time": 7895, "text": "You may not know a person a long time, but you say, I care about you with a hug."}, {"time": 7898, "text": "Can I add just a tiny tangent?"}, {"time": 7901, "text": "This was in the midst of COVID when I was in Boston and it was, you know, masks, like triple masks, nobody."}, {"time": 7909, "text": "And when I went to see Joe here when he was trying to convince me to move to Austin, Joe Rogan, and then the first time I see him, he's like, ah, you motherfucking big ass hug."}, {"time": 7919, "text": "And it felt so good."}, {"time": 7920, "text": "But people probably looked horrified."}, {"time": 7922, "text": "They're hugging."}, {"time": 7922, "text": "It was just him."}, {"time": 7924, "text": "Oh, okay, I know what I'm saying, but if you do it in public now, it's like you committed."}, {"time": 7927, "text": "But that expression, because I was so, you forget how powerful that is."}, {"time": 7934, "text": "Oh, I got some of my buddies."}, {"time": 7935, "text": "I give them a huge hug and a big sloppy kiss on their cheek and I, cause I love them."}, {"time": 7941, "text": "They, these are my brothers, you know?"}, {"time": 7943, "text": "But on this set, I swear to God, it got to the point and I'm not trying to whatever, but there was people that would come up to me for the daily hug."}, {"time": 7951, "text": "And I said, what are you doing?"}, {"time": 7953, "text": "And they said, come on, bring it in."}, {"time": 7955, "text": "And I give them the hug and they said, you don't understand."}, {"time": 7957, "text": "It just makes me feel so good."}, {"time": 7959, "text": "It makes me feel like you give a crap about me."}, {"time": 7961, "text": "I said, I really do."}, {"time": 7962, "text": "I said, but it touched my heart that people were seeking me out to get that hug to start the day."}, {"time": 7968, "text": "And I remember there was a guy in Manhattan, he was selling hugs for like 50 cents and I think he got arrested, right?"}, {"time": 7973, "text": "It was just before COVID."}, {"time": 7974, "text": "But like, I wouldn't sell them if, but now."}, {"time": 7976, "text": "You've given them away for free."}, {"time": 7977, "text": "Well, now I got leukemia."}, {"time": 7978, "text": "I'd be kind of concerned to get into COVID."}, {"time": 7980, "text": "I mean, but like, I really think we need that."}, {"time": 7983, "text": "We need hugging booths, like in each city or each town."}, {"time": 7986, "text": "Like, because there's so many people that just want to know someone gives a shit about them."}, {"time": 7992, "text": "It's like, like, you know, that's what I love about small little towns like where I am now in Tennessee."}, {"time": 7999, "text": "And I'm not knocking New York."}, {"time": 8000, "text": "I'm not knocking big towns, but I guess it's easier to do in a smaller area because it's just not this mass of humanity."}, {"time": 8006, "text": "But they'll stop and check on you."}, {"time": 8009, "text": "Like you're out in the road and you know, like I'm cutting and cleaning or whatever."}, {"time": 8012, "text": "Occasionally I'll roll a lawnmower or a tractor into a ditch cause I'm not a farmer, too good."}, {"time": 8017, "text": "But it's easier to drive a fire truck in New York."}, {"time": 8020, "text": "But they literally, oh, I was worried."}, {"time": 8022, "text": "I haven't seen you."}, {"time": 8023, "text": "And I'm like, no, no, I'm okay."}, {"time": 8025, "text": "But they literally like check on you."}, {"time": 8026, "text": "They're worried about you."}, {"time": 8027, "text": "And I'm going, these people hardly know me, but yet they're so caring."}, {"time": 8034, "text": "Like this is what I love about my life."}, {"time": 8037, "text": "I spent a lot of time as, especially as a young boy and a lot of time in Ireland at my grandma's farm."}, {"time": 8044, "text": "And my mom comes from this tiny, tiny little village."}, {"time": 8048, "text": "She's out in the middle of nowhere."}, {"time": 8049, "text": "And the childhood home she grew up in still, my aunt and uncle live in it still."}, {"time": 8055, "text": "I just love it there so much."}, {"time": 8056, "text": "Cause everyone waves."}, {"time": 8057, "text": "Tennessee's similar."}, {"time": 8059, "text": "They wave, driving by and you're like, who the hell's that?"}, {"time": 8061, "text": "I just wave, you know."}, {"time": 8063, "text": "But my cousin will point it out."}, {"time": 8064, "text": "Actually third cousin, second removed by, you know, Johnny."}, {"time": 8067, "text": "Like, holy shoot, I'm related to everyone here, right?"}, {"time": 8069, "text": "But like everyone stops to say hello and how are you?"}, {"time": 8074, "text": "And I have a problem doing that because my wife goes, people think you're crazy."}, {"time": 8077, "text": "Why are you talking to everybody?"}, {"time": 8078, "text": "I said, like, I'll literally stop someone and say, how's your day going?"}, {"time": 8083, "text": "Like, I mean, I'll randomly on the sidewalk."}, {"time": 8085, "text": "Then it looks a little nuts."}, {"time": 8085, "text": "But like, if I'm buying a cup of coffee."}, {"time": 8088, "text": "Oh, that happens here in Austin all the time."}, {"time": 8090, "text": "That's why I love it here on the sidewalk randomly."}, {"time": 8093, "text": "Yeah, no, it's just so nice."}, {"time": 8094, "text": "They'll say hi to me."}, {"time": 8095, "text": "I thought they recognized me or something."}, {"time": 8097, "text": "I don't give a shit who you are."}, {"time": 8098, "text": "They're just being nice."}, {"time": 8099, "text": "I was on the road coming back, driving from my family up north down to Tennessee last week."}, {"time": 8108, "text": "I stopped in a bathroom and it was closed."}, {"time": 8113, "text": "The girl was cleaning it, whatever."}, {"time": 8115, "text": "She's working so hard, whatever."}, {"time": 8116, "text": "And she goes, sir, she goes, if you go down the hall, there's a family restroom."}, {"time": 8119, "text": "Feel free to use it."}, {"time": 8120, "text": "You know, she didn't have to do that."}, {"time": 8122, "text": "And I went down and I'm old."}, {"time": 8124, "text": "You need a bathroom, you need a bathroom, right?"}, {"time": 8127, "text": "And I walked back out and I said, ma'm, I said, I want to thank you for being here today."}, {"time": 8132, "text": "I says, the bathroom was immaculate."}, {"time": 8133, "text": "It was, it was like my army bathroom in the barracks."}, {"time": 8137, "text": "It was spotless, right?"}, {"time": 8139, "text": "And I gave her $10."}, {"time": 8141, "text": "I said, I'd really like you to buy lunch with me today."}, {"time": 8143, "text": "I said, you really didn't have to do me that favor."}, {"time": 8145, "text": "And she goes, no, sir."}, {"time": 8146, "text": "I said, no, no."}, {"time": 8147, "text": "I said, I want."}, {"time": 8148, "text": "And it was like I gave her a million bucks."}, {"time": 8150, "text": "And I say to my wife now, I've been praying to be a billionaire."}, {"time": 8154, "text": "She goes, that's a sin."}, {"time": 8155, "text": "I said, no, no, you don't understand, right?"}, {"time": 8157, "text": "She goes, oh, you're Mr., you know, Mr. God."}, {"time": 8160, "text": "I said, no, no, no."}, {"time": 8160, "text": "I said, you're getting it wrong."}, {"time": 8161, "text": "I said, I'm praying to be like a multi gazillionaire because I want to give it all away."}, {"time": 8167, "text": "We used to have a sign in ladder 114 until some other rival truck company stole it, right?"}, {"time": 8171, "text": "Cause that's what we do."}, {"time": 8172, "text": "You know, they get sent to cover your district when you're at a fire and now your stuff's missing."}, {"time": 8177, "text": "And the old timers had a sign that says, I am content."}, {"time": 8180, "text": "Because if you got to ladder 114, that was considered such a great place, such a great assignment, such great guys."}, {"time": 8188, "text": "You had to be vetted to get there."}, {"time": 8190, "text": "You couldn't just randomly go."}, {"time": 8191, "text": "And it was a little exclusionary, but they wanted good guys."}, {"time": 8196, "text": "And I said to myself, that's who I am in life right now."}, {"time": 8198, "text": "I am content, but I'm restless because I want to really do a lot more good."}, {"time": 8204, "text": "It's like this podcast."}, {"time": 8206, "text": "I want to make sure that it's not forgotten."}, {"time": 8210, "text": "And I want to make sure that these charities that are really, really helping people get recognized."}, {"time": 8215, "text": "But I'd like to take it a step further, right?"}, {"time": 8217, "text": "A friend of mine runs this foundation for young folks suffering mental illness and in crisis."}, {"time": 8226, "text": "It's for someone that we love dearly."}, {"time": 8228, "text": "And he's on a mission now to get therapy dogs for really, really mentally wounded warriors, right?"}, {"time": 8238, "text": "A lot of these young soldiers are having a really hard time."}, {"time": 8243, "text": "And now they could be out a while."}, {"time": 8245, "text": "They may have come back in country two, three years ago."}, {"time": 8248, "text": "Now it's just starting to set in."}, {"time": 8251, "text": "And there's a waiting list for thousands of therapy dogs."}, {"time": 8254, "text": "And he said that they can't get enough of them quick enough."}, {"time": 8259, "text": "But he said, when you see the response, the way these veterans just light up when they get these dogs, it just changes their life radically, immediately."}, {"time": 8270, "text": "And I said, that's it."}, {"time": 8271, "text": "God, I don't know how I'm going to do it, but I want to be a gazillionaire."}, {"time": 8277, "text": "And I don't want any picture, photo ops, this, that."}, {"time": 8280, "text": "I just want to go, there's a dog, there's a dog, there's a dog, there's a dog."}, {"time": 8283, "text": "And then I want to build veterans land for these vets who just need a nice clean place to live."}, {"time": 8290, "text": "So why don't we take these old army bases and Marine bases and Navy bases that have been shut down."}, {"time": 8295, "text": "They're just sitting there rotting away."}, {"time": 8297, "text": "I was in the army in Alabama."}, {"time": 8299, "text": "My old Fort McClellan is three quarters vacant."}, {"time": 8304, "text": "They just did a documentary on it."}, {"time": 8305, "text": "It just looks like zombie land going back to zombies."}, {"time": 8307, "text": "So why don't we take that and renovate it and say to vets who are struggling, hey guys, you're going to live here."}, {"time": 8315, "text": "And they take the old army, the places where they had all the supplies, there's massive buildings where you could just retrofit it and make light manufacturing within two weeks."}, {"time": 8328, "text": "Give these guys jobs."}, {"time": 8329, "text": "There they live, there they work."}, {"time": 8331, "text": "They'll take care of it."}, {"time": 8332, "text": "Military guys, they teach you how to take care of stuff."}, {"time": 8335, "text": "How the hell in this country should any vet come back home and be homeless?"}, {"time": 8340, "text": "Because now they have to dedicate their lives for six, seven, 10, 12 years, five, six deployments making $7.50 an hour."}, {"time": 8349, "text": "And then they spend seven years or they get a whopping $16 an hour."}, {"time": 8353, "text": "They walk out making 35 grand."}, {"time": 8356, "text": "And now no one gives them a job."}, {"time": 8358, "text": "No one gives them a chance."}, {"time": 8360, "text": "So very quickly they end up homeless by no fault of their own."}, {"time": 8365, "text": "And I don't know how that's even possible."}, {"time": 8368, "text": "The people in this country who've given the very most and they're struggling, they're hurting."}, {"time": 8375, "text": "That's not fair."}, {"time": 8376, "text": "And my whole thing is if I can have this dream of succeeding, so to speak, I want to try to change it."}, {"time": 8385, "text": "So that's why I'm praying to be a billionaire."}, {"time": 8388, "text": "My Irish mother probably wouldn't agree either because you're not supposed to, right?"}, {"time": 8393, "text": "Well, I'm the same with you."}, {"time": 8396, "text": "The more money you have, the more you're able to help."}, {"time": 8399, "text": "Yeah, you can put smiles on people's faces."}, {"time": 8402, "text": "I have to ask you, the US invaded Afghanistan in October, 2001 in response to terror attacks."}, {"time": 8411, "text": "Now 20 years later, we still had a presence and abruptly withdrew all troops."}, {"time": 8417, "text": "What do you think about this war across the world that was sparked by this tragedy?"}, {"time": 8423, "text": "Whenever you do something quickly without thinking it out, thinking it through and planning, it doesn't succeed."}, {"time": 8431, "text": "I understand that we needed to exit."}, {"time": 8434, "text": "I mean, how long were you gonna stay over there?"}, {"time": 8436, "text": "And we've lost over 7,000 of our young souls over there."}, {"time": 8443, "text": "For sometimes people, I don't know if they're grateful for it or not, right?"}, {"time": 8448, "text": "So there's the other element, and sorry to interrupt."}, {"time": 8451, "text": "One is the financial of $6 trillion and that money is not just money, it's education, it's everything, it's money that could have gone towards, first of all, the first responders, but all the servicemen and women of all kinds throughout this country."}, {"time": 8470, "text": "And then there's the other side, which is the over 800,000 people who died in direct result of this conflict."}, {"time": 8478, "text": "So not just the American side of the troops, but just people who died, those humans."}, {"time": 8484, "text": "And those humans, many of them civilians, that's spreading hate, especially if you have leaders on the other side who frame the death of those civilians in certain ways that just spreads hate throughout the world."}, {"time": 8501, "text": "And so you think about this kind of 20 year saga and think, what are the ways that money could be spent better and what was the way that we could have spread more love in the world versus hate?"}, {"time": 8516, "text": "And you wonder, but then the other side, what is it?"}, {"time": 8521, "text": "I'm not sure who says this line, but it's something like we sleep at night because there's a rough men out there ready to fight for you."}, {"time": 8535, "text": "There is some sense in which we have to make sure that there's strength coupled with the love, right?"}, {"time": 8541, "text": "Otherwise evil men will do evil onto the world."}, {"time": 8547, "text": "So it's a very difficult decision, but then you look at the final picture and it's like, what have we gotten for this $6 trillion?"}, {"time": 8555, "text": "What have we gotten for this 20 years?"}, {"time": 8557, "text": "The thousands of American soldiers who died, the hundreds of thousands of civilians who have died."}, {"time": 8569, "text": "You know, it's a troubling subject for me."}, {"time": 8573, "text": "I'm a patriot, I love this country."}, {"time": 8575, "text": "I love it with my soul."}, {"time": 8578, "text": "And I was just about to head over to the first Iraqi war and we went out for desert warfare training and then it ended."}, {"time": 8586, "text": "I was at that time a combat medic assigned to an armored cav unit."}, {"time": 8589, "text": "So basically tanks driving around an armored personnel carrier and when it gets hit, then you tend to that guy, try to save his life."}, {"time": 8598, "text": "I didn't wanna go."}, {"time": 8599, "text": "I may sound like a coward, I did not wanna go to war."}, {"time": 8603, "text": "I would have went willingly if I was sent to defend my country, I took my oath."}, {"time": 8610, "text": "I didn't join the military to kill, but if necessary, I would."}, {"time": 8616, "text": "I'll use the analogy of cancer."}, {"time": 8618, "text": "If you have a cancer and you're aware of its presence and you don't annihilate those cells and take them out quickly, it's gonna spread and it's gonna kill you."}, {"time": 8631, "text": "Those evil bastards that flew those airplanes, one of those airplanes had a little three year old child in it from Ireland where my mom's hometown."}, {"time": 8641, "text": "A friend of mine who since died of a heart attack from 9 11 toxins, he found her shoe with human remains in it."}, {"time": 8648, "text": "And he thought someone was messing with us because we didn't know there was any kids in the building."}, {"time": 8652, "text": "He says, boss, there's a baby shoe and it looks like there's something in it, but there's no kids in the trade center."}, {"time": 8658, "text": "I went, the plane, it's a little girl shoe."}, {"time": 8661, "text": "I can never get that shoe out of my mind."}, {"time": 8666, "text": "The evil bastards who perpetrated that needed to have missiles strike and rain down upon them and annihilate them like a cancer that they are."}, {"time": 8675, "text": "What just fascinates me is they'll show videos of these guys flying around and pick up trucks with 50 cows on the back."}, {"time": 8681, "text": "It's like, well, wait a minute."}, {"time": 8683, "text": "If a camera crew can get this footage, you think all these freaking drones and planes and radar assisted systems can't just go whist, whist, whist, goodnight, you're gone."}, {"time": 8696, "text": "So kill the cancer, kill the cells, get rid of it, get rid of it quickly and go into remission."}, {"time": 8703, "text": "Like an undeniable show of force that sends a message that gets rid of most of the obvious centers of terrorism."}, {"time": 8743, "text": "But then presenting that to Jaco who was in Iraq, he did not see as brothers in arms, which is his basic statement is there's evil people and some people don't deserve the compassion."}, {"time": 8763, "text": "You give them a few chances, they don't take the chances they have to go because they're spreading evil onto the world."}, {"time": 8769, "text": "And so it's not, we're not, all of us deserve a chance."}, {"time": 8774, "text": "Oh no, absolutely, but the difference though, and believe me, I, Jaco, I am from a way, way minor league compared to him, right?"}, {"time": 8782, "text": "I mean, this man was right there in the firing line, but I can understand his analogy because when you think about it, right, those young conscripts back in Germany and Russia and all the countries where they were being drafted, even our guys were being drafted and thrown into this."}, {"time": 8797, "text": "They were gallantly and bravely defending their country."}, {"time": 8803, "text": "Now, I'm sure the young Germans felt, well, hey, Hitler must be right, right?"}, {"time": 8809, "text": "And young Russians felt, hey, Stalin must be right."}, {"time": 8811, "text": "And the young Americans figured, hey, President Roosevelt must be right."}, {"time": 8817, "text": "So they were romantically in a sense defending the honor of their country, of their motherland."}, {"time": 8824, "text": "The difference between those, so they did have that commonality."}, {"time": 8828, "text": "If you and I were firing across each other from France to Germany or, you know, from Germany to Russia or whatever, we're just these two kids who got thrown into this."}, {"time": 8837, "text": "We didn't freaking ask for this, right?"}, {"time": 8839, "text": "But the difference with Jaco's enemy is no one was attacking their country over there, right?"}, {"time": 8846, "text": "No one was taking their country over."}, {"time": 8848, "text": "Maybe in their mind, they didn't want people trying to build their government, this and that."}, {"time": 8853, "text": "I don't know, I don't know enough about the history there to really elaborate."}, {"time": 8858, "text": "We didn't attack them."}, {"time": 8861, "text": "And if a soldier attacks a soldier, that's an understood concept amongst warriors."}, {"time": 8867, "text": "But when a soldier attacks a civilian, now you're after a different beast, and you've written that beast off, if that makes any sense."}, {"time": 8874, "text": "Yeah, and the enemy, I mean, as Jaco explains, the enemy in Iraq and just certain parts of the Middle East is essentially terrorists who don't value the lives of the civilians of their own country."}, {"time": 8892, "text": "And so it becomes like this weird guerrilla warfare slash game of violence that ultimately allows them to gain more power within their country, but they don't care if they're playing with civilian lives as pawns."}, {"time": 8906, "text": "If you have a child who dies that's a civilian in their country, that could be seen as a positive for them because they can use that to leverage for more and more power within that country."}, {"time": 8920, "text": "So when you're fighting an enemy like that, that's a vicious, that's an evil enemy."}, {"time": 8927, "text": "It's like snakes are beautiful, but if you go pet a rattler, you're getting bit and you're getting dead, right?"}, {"time": 8932, "text": "And that's with terrorists, you've got to cut the head of the snake off."}, {"time": 8935, "text": "And I feel, no, don't commit our guys to be there anymore."}, {"time": 8939, "text": "But what we need to do is go with tech warfare."}, {"time": 8941, "text": "If we have intel from drones or planes or whatever it is that so and so and so and so and so and so are driving down in that pickup or whatever, take it out and do it again tomorrow and tomorrow and tomorrow."}, {"time": 8952, "text": "And maybe they'll get the message after a while, oh shit, these guys aren't messing around."}, {"time": 8957, "text": "Instead of throwing wave after wave of our brave warriors, brave SEALs, brave special ops guys, and God bless them for what they do, I couldn't do it."}, {"time": 8967, "text": "I could not have done it."}, {"time": 8969, "text": "But they have to be now sitting home going, what the hell?"}, {"time": 8976, "text": "My friends, my body, myself, like they must feel so betrayed because they passionately went over there to cure a cancer, the cancer of terrorism."}, {"time": 8988, "text": "And now the cancer is back."}, {"time": 8990, "text": "And I hate to say it, but I think the cancer might start running wild."}, {"time": 8994, "text": "We need to change our tactics up."}, {"time": 8995, "text": "This is just my opinion."}, {"time": 8997, "text": "I can't see committing all of our guys to a continuous eternal war."}, {"time": 9004, "text": "But I think what we need to do is hit surgically and hit hard at that cancer that is over there."}, {"time": 9011, "text": "We are never gonna rebuild that region."}, {"time": 9014, "text": "It's just, it's thousands of years of traditions that you're not going to change."}, {"time": 9018, "text": "It's just some people are unchangeable because they don't want to."}, {"time": 9023, "text": "And we have so many social problems here in our country, I think that we need to fix first."}, {"time": 9031, "text": "I heard this spoken in the past by many people."}, {"time": 9033, "text": "It's like the garden theory."}, {"time": 9035, "text": "You have your garden with a fence around it."}, {"time": 9037, "text": "You tend to your garden."}, {"time": 9039, "text": "There may be weeds on the outside of the fence, but as long as they're not inside your garden, your garden will prosper."}, {"time": 9045, "text": "And I know some people don't agree to that America first and the whole take care of our own, but it's like, how are we gonna take in more people now?"}, {"time": 9056, "text": "And I have a human feeling for them, but it's almost like the lifeboat theory."}, {"time": 9063, "text": "How many people can we take into the lifeboat before the lifeboat itself sinks as the ship is going down?"}, {"time": 9070, "text": "So if we can't take care of our own homeless vets and our own homeless people, and it's just gonna become worse."}, {"time": 9080, "text": "And it doesn't make any sense."}, {"time": 9081, "text": "It's just like, we need to just take a timeout and I think switch our tactics a little bit."}, {"time": 9089, "text": "And invest into helping people here at home."}, {"time": 9095, "text": "There's very few as obvious of cases as the first responders in 9 11."}, {"time": 9102, "text": "That one of the things that I really wanna kind of talk about at least a little bit, we've already talked about the amazing project that you're doing the 20 for 20 podcast that you host."}, {"time": 9116, "text": "We mentioned one story, Steven Siller, is there other stories or maybe you can speak out at a high level, what are you hoping to tell?"}, {"time": 9124, "text": "And all these different stories that are weaved about that connect the tragedies and the triumphs, the heroism of that day and the days and the years that followed."}, {"time": 9139, "text": "You know, Lex, it seems like the common few themes, the common threads are being selfless, helping out others even though they might be a stranger, in acts of kindness, acts of love, and it seems to all be weaved together with faith."}, {"time": 9157, "text": "They all seem to have some sort of faith."}, {"time": 9159, "text": "I mean, we have one gentleman, Mark Hanna, and he's a Coptic Egyptian priest, and he's an immigrant to the United States."}, {"time": 9169, "text": "He was a port authority building engineer."}, {"time": 9171, "text": "And with his crew who subsequently passed away, the crew did, he was effectively rescuing dozens of people on the upper floors, and his boss ordered him to assist an elderly gentleman who was 89 down 78 flights of stairs to get him out."}, {"time": 9189, "text": "And in stopping on the 21st floor, he figured they would just wait there for medics."}, {"time": 9194, "text": "He came across Captain Patty Brown of Ladder Company 3, who told him, no, sir, you need to evacuate."}, {"time": 9201, "text": "And Captain Brown picked his brain a little bit about the structure because he figured, found out he was an engineer."}, {"time": 9207, "text": "And Captain Patty Brown continued on to effect rescues, and he and his crew were killed."}, {"time": 9212, "text": "But father, he's now, Mark was able to effectively evacuate this gentleman."}, {"time": 9218, "text": "They were the two known last survivors to come out of the tower."}, {"time": 9222, "text": "He now has dedicated his life to becoming a Coptic priest in St. Mary's Church in East Brunswick, New Jersey."}, {"time": 9229, "text": "He did this for a total stranger."}, {"time": 9231, "text": "And he said he was inspired by his bosses who died and his friends."}, {"time": 9238, "text": "One of his best friends was an Italian man."}, {"time": 9239, "text": "The other man was a retired Navy SEAL, Hispanic man."}, {"time": 9243, "text": "And they were part of this melting pot."}, {"time": 9245, "text": "And no one looked at each other that day, what color, what race, what belief are you?"}, {"time": 9249, "text": "They just said, hey, you're a human in need, let's go."}, {"time": 9252, "text": "And we have the story about John Field on his mission to help the responders."}, {"time": 9259, "text": "We have a young lady, Mariah, whose birth father was on flight 93."}, {"time": 9264, "text": "She had not even met him."}, {"time": 9266, "text": "And she had this premonition that somebody in her family was killed that day."}, {"time": 9269, "text": "And her adopted mom said, no, everyone's fine."}, {"time": 9273, "text": "Three years later, when she was legally able to find out who her dad was, she found out that her dad, Tom, was actually on that plane as part of the Let's Roll team."}, {"time": 9283, "text": "And we have a gentleman, Robert Burke, who's an actor, sweetheart of a man."}, {"time": 9289, "text": "He's a gentleman and he's a very, very popular actor in Hollywood."}, {"time": 9293, "text": "He was on Rescue Me, Blue Bloods, Gossip Girls."}, {"time": 9296, "text": "And Bobby, my friend, as I call him, is a volunteer fireman now."}, {"time": 9301, "text": "This man doesn't need to get out of bed at two oclock in the morning and help people with a stroke or a burning garage or a burning house, but he does because he wants to."}, {"time": 9309, "text": "Because his best friend was Captain Patty Brown."}, {"time": 9312, "text": "And his other best friend was Father Michael Judge, who was our chaplain, who was killed, literally blessing the victims at the site, had just given last rites to the firefighter I mentioned earlier, Danny, who was killed."}, {"time": 9324, "text": "And Father Judge was in the lobby of the building, giving a blessing, praying to God to please stop this."}, {"time": 9330, "text": "And he was struck by debris and he was killed."}, {"time": 9333, "text": "And Bobby goes on to elaborate about Father Judge's story."}, {"time": 9337, "text": "Father Judge used to walk the streets of New York City, helping AIDS patients just with whatever they needed."}, {"time": 9342, "text": "And he was a Franciscan friar."}, {"time": 9345, "text": "They wear sandals and a robe."}, {"time": 9346, "text": "They just live very humble lives."}, {"time": 9350, "text": "And it's just a common denominator is loving each other and helping each other, regardless of you know the person or not."}, {"time": 9360, "text": "And really, when you think about it, that's how America was made."}, {"time": 9363, "text": "We fought for independence."}, {"time": 9366, "text": "Stranger fought next to stranger and fought tyranny because they wanted freedom."}, {"time": 9373, "text": "They wanted to be able to live, love, pray and prosper."}, {"time": 9380, "text": "And they fought and died alongside of strangers."}, {"time": 9382, "text": "And it's sort of symbolic of what happened that day."}, {"time": 9385, "text": "And then strangers from around this great country just flocked in by the thousands to help."}, {"time": 9391, "text": "They didn't know who was in that pile, but they didn't care."}, {"time": 9394, "text": "That was another American."}, {"time": 9396, "text": "And what I ultimately am trying to do involved in this beautiful project is spread the message of doing the right thing."}, {"time": 9406, "text": "Look at these examples."}, {"time": 9408, "text": "These brave people who didn't have to, especially the civilians, they weren't paid to run back in there and help person after person."}, {"time": 9416, "text": "And they had no obligation."}, {"time": 9419, "text": "They could have just said, hey man, I'm out of here and just bolted."}, {"time": 9425, "text": "So we're just trying to say to people, let's bring back that unity and that feeling of 912."}, {"time": 9431, "text": "As strange as 912 of a day it was, it was so sad because it was the first dawn of the sun where we realized this wasn't a dream."}, {"time": 9441, "text": "This was real and it's not going away."}, {"time": 9444, "text": "But the beauty of it was there was thousands of people lined up along the West Side Highway with signs and American flags."}, {"time": 9452, "text": "And they were from every country and every race and every creed."}, {"time": 9456, "text": "And it didn't matter who they were, but they all shared one bond, love."}, {"time": 9462, "text": "And they were hugging and crying and thanking rescuers."}, {"time": 9467, "text": "And it brought the morale so high for a group of people that was so beaten down the day before."}, {"time": 9475, "text": "It just started lifting the morale and making us realize, you know what?"}, {"time": 9479, "text": "People really do give a crap."}, {"time": 9481, "text": "They really do love each other."}, {"time": 9484, "text": "And now I'm gonna be honest with you, I've been doubting that a little bit lately."}, {"time": 9488, "text": "I still have these examples of it."}, {"time": 9489, "text": "You know, that lady who helped me last night with the phone and just, you know, I know there's these shining little examples, but sometimes I think, I don't know, are we running out of them?"}, {"time": 9500, "text": "Well, I gotta give you some advice."}, {"time": 9502, "text": "So there's two words that were repeated often in the days and the years after 911, which is never forget."}, {"time": 9510, "text": "So might I remind you to never forget about 912."}, {"time": 9516, "text": "I mean, those words, you talked about that, you know, there's people, what is it, college freshmen, maybe."}, {"time": 9523, "text": "They weren't even born."}, {"time": 9525, "text": "And there's people in the 20s that were too young to remember or to understand the events of that day."}, {"time": 9531, "text": "But I think what that day, as you're describing, means, it's not about a terrorist attack."}, {"time": 9535, "text": "It's about the unity that followed."}, {"time": 9538, "text": "It was tremendous, Lex."}, {"time": 9539, "text": "I never felt so proud."}, {"time": 9541, "text": "I was always proud of this country."}, {"time": 9543, "text": "You know, I remember my grandpa Nels used to walk by, I'd see a flag, I'd hear the Star Spangled Banner and he'd tear up and I'd say, Grant, why are you crying?"}, {"time": 9550, "text": "He said, I'm not crying, it's the tears of joy."}, {"time": 9552, "text": "I love this country so much."}, {"time": 9555, "text": "And I just remember like feeling that way."}, {"time": 9557, "text": "I felt that way 910."}, {"time": 9559, "text": "I felt that way on 911, but then on 912, I was just so proud of just the people, the way they stepped up."}, {"time": 9567, "text": "And I just want to try to see if that can happen again."}, {"time": 9569, "text": "And I hope it's not necessary for us to have another tragedy to bring that about."}, {"time": 9574, "text": "Let's do that without the tragedy."}, {"time": 9577, "text": "Let's just stop and say, hey, you know what?"}, {"time": 9580, "text": "Let me listen to what this guy has to say."}, {"time": 9583, "text": "And maybe he's, he probably won't convince me, but maybe I'll go, well, you know, I never thought of it that way."}, {"time": 9589, "text": "Stop the finger pointing, the bickering, the tantrums, the fighting."}, {"time": 9594, "text": "It's just not necessary."}, {"time": 9595, "text": "It gets you nowhere, right?"}, {"time": 9596, "text": "It's like, you know, I was two years old and I'd stomp around because I wanted a cookie or a piece of candy."}, {"time": 9601, "text": "I still didn't get it, right?"}, {"time": 9603, "text": "You know, turned blue in the face and whatever, got a little swat in the rear end, but it didn't get the candy."}, {"time": 9607, "text": "And that's what we got going on right now."}, {"time": 9609, "text": "Everybody's just stomping around, being a baby."}, {"time": 9612, "text": "Stop, just stop."}, {"time": 9613, "text": "We're really lucky."}, {"time": 9614, "text": "Look, the country's not perfect, right?"}, {"time": 9617, "text": "You know, but it's damn good."}, {"time": 9619, "text": "It gives us all these opportunities, you know?"}, {"time": 9622, "text": "Like I said, no one's rushing out the gates to get out of here."}, {"time": 9625, "text": "They're freaking, I got a cousin of mine."}, {"time": 9627, "text": "I love him dearly."}, {"time": 9628, "text": "My cousin Tony in Ireland."}, {"time": 9630, "text": "And he said, he's just a little older than me."}, {"time": 9632, "text": "He's in his fifties."}, {"time": 9633, "text": "He said, man, I should have done it."}, {"time": 9635, "text": "I should have went to America."}, {"time": 9637, "text": "My dad said, go to America."}, {"time": 9638, "text": "I went to England and he went back to Ireland."}, {"time": 9641, "text": "And you know, but he's happy in Ireland."}, {"time": 9643, "text": "It's his home."}, {"time": 9644, "text": "But he said, wow, what a place of opportunity."}, {"time": 9647, "text": "And I said, it's never too late."}, {"time": 9648, "text": "He goes, yeah, but you know what?"}, {"time": 9649, "text": "You get tied down."}, {"time": 9652, "text": "I thank God my mom came here at 16."}, {"time": 9655, "text": "I thank God my grandpa got on that ship."}]}]