[{"title": "Martin Rees: Black Holes, Alien Life, Dark Matter, and the Big Bang | Lex Fridman Podcast #305", "id": "50r-5ULcWgY", "quotes": [{"time": 323, "text": "What do you think we'll understand first?"}, {"time": 323, "text": "How the universe works or how the human body works deeply, like from a fundamental deep level?"}, {"time": 330, "text": "Well, I think, perhaps we can come back to it later, that there are only limited prospects of ever being able to understand with unaided human brains the most fundamental theories linking together all the forces of nature."}, {"time": 344, "text": "I think that may be a limitation of the human brains."}, {"time": 351, "text": "But I also think that we can, perhaps aided by computer simulations, understand a bit more of the complexity of nature."}, {"time": 358, "text": "But even understanding a simple organism from the atom up is very, very difficult."}, {"time": 366, "text": "And I think extreme reductionists have a very misleading perception."}, {"time": 375, "text": "They tend to think that, in a sense, we are all solutions to Schrodinger's equation, etc."}, {"time": 380, "text": "But that isn't the way we'll ever understand anything."}, {"time": 380, "text": "It may be true that we are reductionists in the sense that we believe that that's the case."}, {"time": 388, "text": "We don't believe in any special life force in living things."}, {"time": 394, "text": "But nonetheless, no one thinks that we can understand a living thing by solving Schrodinger's equation."}, {"time": 400, "text": "To take an example which isn't as complicated, lots of people study the flow of fluids like water, why waves break, why flows go turbulent, things like that."}, {"time": 412, "text": "This is a serious branch of applied mathematics and engineering."}, {"time": 412, "text": "And in doing this, you have concepts of viscosity, turbulence, and things like that."}, {"time": 419, "text": "Now, you can understand quite a lot about how water behaves and how waves break in terms of those concepts."}, {"time": 426, "text": "But the fact that any breaking wave is a solution of Schrodinger's equation for 10 to the 30 particles, even if you could solve that, which you clearly can't, would not give you any insight."}, {"time": 446, "text": "So the important thing is that every science has its own irreducible concepts in which you get the best explanation."}, {"time": 452, "text": "So it may be in chemistry, it's things like valence."}, {"time": 458, "text": "In biology, there are concepts in cell biology."}, {"time": 458, "text": "And in ecology, there are concepts like imprinting, etc."}, {"time": 467, "text": "And in psychology, there are other concepts."}, {"time": 467, "text": "So in a sense, the sciences are like a tall building where you have basic physics, most fundamental, then the rest of physics, then chemistry, then cell biology, etc., all the way up to the, I guess, economist in the penthouse and all that."}, {"time": 488, "text": "And we have that."}, {"time": 488, "text": "And that's true in a sense."}, {"time": 488, "text": "But it's not true that it's like a building in that it's made unstable by an unstable base."}, {"time": 495, "text": "Because if you're a chemist, biologist, or an economist, you're facing challenging problems."}, {"time": 507, "text": "But they're not made any worse by uncertainty about subnuclear physics."}, {"time": 513, "text": "TK And at every level, just because you understand the rules of the game, or have some understanding of the rules of the game, doesn't TK mean you know what kind of beautiful things that game creates."}, {"time": 526, "text": "TK Right."}, {"time": 526, "text": "So if you're interested in birds and how they fly, then things like imprinting the baby on the mother and all that, and things like that, are what you need to understand."}, {"time": 542, "text": "You couldn't even in principle solve this fairly good equation, how an albatross wanders for thousands of miles in the Southern Ocean and comes back and then coughs up food for its young."}, {"time": 552, "text": "That's something we can understand, in a sense, and predict the behavior."}, {"time": 556, "text": "But it's not because we can solve it on the atomic scale."}, {"time": 561, "text": "TK You mentioned that there might be some fundamental limitation to the human brain that limits our ability to understand some aspect of how the universe works."}, {"time": 572, "text": "That's sad, actually."}, {"time": 572, "text": "To the degree it's true, it's sad."}, {"time": 572, "text": "So what do you mean by that?"}, {"time": 579, "text": "TK I would simply say that just as a monkey can't understand quantum theory or even Newtonian physics, there's no particular reason why the human brain should have evolved to be well matched to understanding the deepest aspects of reality."}, {"time": 592, "text": "And I suspect that there may be aspects that we are not even aware of and couldn't really fully comprehend."}, {"time": 603, "text": "But as an intermediate step towards that, one thing which I think is a very interesting possibility is the extent to which AI can help us."}, {"time": 607, "text": "I mean, I think if you take the example of so called theories of everything, one of which is string theory."}, {"time": 618, "text": "String theory involves very complicated geometry and structures in 10 dimensions."}, {"time": 624, "text": "And it's certainly, in my view on the cards, that the physics of 10 dimensions, very complicated geometry, may be too hard for a human being to work through, but could be worked through by an AI with the advantage of the huge processing power, which enables them to learn world championship chess within a few hours just by watching games."}, {"time": 655, "text": "So there's every reason to expect that these machines could help us to solve these problems."}, {"time": 662, "text": "And of course, if that's the way we came to understand whether string theory was right, it should be in a sense frustrating because you wouldn't get the sort of aha insight, which is the greatest satisfaction from doing science."}, {"time": 673, "text": "But on the other hand, if a machine churns away at 10 dimensional geometry, figuring out all the possible origamis wound up in extra dimensions, if it comes out at the end, spews out the correct mass of the electron, the fact that there are three kinds of neutrinos, something like that, you would know that there was some truth in the theory."}, {"time": 696, "text": "And so we may have a theory which we come to trust because it does predict things that we can observe and check, but we may never really understand the full workings of it to the extent that we do more or less understand how most phenomena can be explained in a fundamental way."}, {"time": 717, "text": "Of course, in the case of quantum theory, many people would say, understand if there's still some mystery, if you don't quite understand why it works."}, {"time": 724, "text": "But there could be deeper mysteries when we get to these unified theories, where there's a big gap between what a computer can print out for us at the end and what we can actually grasp and think through in our heads."}, {"time": 736, "text": "Yeah, it's interesting that the idea that there could be things a computer could tell us that is true."}, {"time": 741, "text": "And maybe it can even help us understand why it's true a little bit, but ultimately it's still a long journey to really deeply understand the whys of it."}, {"time": 754, "text": "Yes, and that's the limitation of our brain."}, {"time": 754, "text": "We can try to sneak up to it in different ways, given the limitations of our brain."}, {"time": 760, "text": "I've gotten a chance to spend the day at DeepMind, talk to Demis Hassabis."}, {"time": 765, "text": "His big dream is to apply AI to the questions of science, certainly to the questions of physics."}, {"time": 772, "text": "Have you gotten a chance to interact with him?"}, {"time": 775, "text": "Well, I know him quite well."}, {"time": 775, "text": "He's one of my heroes, certainly."}, {"time": 779, "text": "I'm sure he would say the same."}, {"time": 782, "text": "And I remember the first time I met him, he said that he was like me, he wants to understand the universe, but he thought the best thing to do was to try and develop AI."}, {"time": 787, "text": "And then with the help of AI, he'd stand more chance of understanding the universe."}, {"time": 792, "text": "And I think he's right about that."}, {"time": 798, "text": "And of course, although we're familiar with the way his computers play go and chess, he's already made contributions to science through understanding protein folding better than the best human chemists."}, {"time": 813, "text": "And so already he's on the path to showing ways in which computers have the power to learn and do things by having ability to analyze enormous samples in a short time to do better than humans."}, {"time": 825, "text": "And so I think he would resonate for what I just said, that it may be that in these other fundamental questions, the computers will play a crucial role."}, {"time": 838, "text": "And they're also doing a quantum mechanical simulation of electrons."}, {"time": 838, "text": "They're doing control of high temperature plasmas, fusion reactors."}, {"time": 847, "text": "Yes, that's a new thing, which is very interesting."}, {"time": 847, "text": "They can suppress the instabilities in these tokamaks better than any other way."}, {"time": 854, "text": "And it's just the march of progress by AIs in science is making big strides."}, {"time": 854, "text": "Do you think an AI system will win a Nobel Prize in the century?"}, {"time": 871, "text": "And does that make you sad?"}, {"time": 873, "text": "If I can digress and put in a plug for my next book, it has a chapter saying, why Nobel Prizes do more harm than good."}, {"time": 878, "text": "So on a quite separate subject, I think the Nobel Prizes do a great deal of damage to the perception of the way science is done."}, {"time": 889, "text": "Of course, if you ask who or what deserves the credit for any scientific discovery, it may be often someone who has an idea, a team of people who work a big experiment, etc."}, {"time": 899, "text": "And of course, it's the quality of the equipment, which is crucial."}, {"time": 899, "text": "And certainly in the subjects I do in astronomy, the huge advances we've had come not from us being more intelligent than Aristotle was, but through us having far, far better data from powerful telescopes on the ground and in space."}, {"time": 922, "text": "And also, incidentally, we've benefited hugely in astronomy from computer simulations."}, {"time": 929, "text": "Because if you are a subatomic physicist, then of course, you crash together the particles in the big accelerator like the one at CERN and see what happens."}, {"time": 936, "text": "But I can't crash together two galaxies or two stars and see what happens."}, {"time": 943, "text": "But in the virtual world of a computer, one can do simulations like that."}, {"time": 948, "text": "And the power of computers is such that these simulations can yield phenomena and insights which we wouldn't have guessed beforehand."}, {"time": 956, "text": "And the way we can feel we're making progress and trying to understand some of these phenomena, why galaxies have the size and shape they do and all that, is because we can do simulations and tweaking different initial conditions and seeing which gives the best fit to what we actually observe."}, {"time": 982, "text": "And so that's a way in which we've made progress in using computers."}, {"time": 982, "text": "And incidentally, we also now need to analyze data because one thinks of astronomy as being traditionally rather data poor subjects."}, {"time": 994, "text": "But the European satellite called Gaia has just put online the speeds and colors and properties of nearly two billion stars in the Milky Way, which we can do fantastic analyses of."}, {"time": 1010, "text": "And that, of course, could not be done at all without just the number crunching capacity of computers."}, {"time": 1014, "text": "And the new methods of machine learning actually love raw data, the kind that astronomy provides, organized, structured, raw data."}, {"time": 1021, "text": "Well, indeed, because the reason they really have a benefit over us is that they can learn and think so much faster."}, {"time": 1026, "text": "That's how they can learn to play chess and go."}, {"time": 1032, "text": "That's how they can learn to diagnose lung cancer better than a radiologist because they can look at 100,000 scans in a few days, whereas no human radiologist sees that many a lifetime."}, {"time": 1046, "text": "Well, there's still magic to the human intelligence, to the intuition, to the common sense reasoning."}, {"time": 1053, "text": "Well, we hope so."}, {"time": 1053, "text": "What is the new book that you mentioned?"}, {"time": 1060, "text": "The book I mentioned is called If Science is to Save Us."}, {"time": 1060, "text": "It's coming out in September."}, {"time": 1064, "text": "And it's on the big challenges of science, climate, dealing with biosafety and dealing with cyber safety."}, {"time": 1076, "text": "And also, it's got chapters on the way science is organized, universities and academies, et cetera, and the ethics of science and education."}, {"time": 1083, "text": "And the limits, yes."}, {"time": 1092, "text": "Well, let me actually just stroll around the beautiful and the strange of the universe."}, {"time": 1098, "text": "Over 20 years ago, you hypothesized that we would solve the mystery of dark matter by now."}, {"time": 1105, "text": "So unfortunately, we didn't quite yet."}, {"time": 1105, "text": "First, what is dark matter and why has it been so tough to figure out?"}, {"time": 1114, "text": "Well, I mean, we learned that galaxies and other large scale structures, which are moving around but preventive of flying apart by gravity, would be flying apart if they only contain the stuff we see, if everything in them is shining."}, {"time": 1130, "text": "And to understand how galaxies formed and why they do remain confined the same size, one has to infer that there's about five times as much stuff producing gravitational forces than the total amount of stuff in the gas and stars that we see."}, {"time": 1152, "text": "And that stuff is called dark matter."}, {"time": 1152, "text": "That's the leading name, it's not dark, it's just transparent, et cetera."}, {"time": 1158, "text": "And the most likely interpretation is that it's a swarm of microscopic particles which have no electric charge."}, {"time": 1166, "text": "And the very small cross sections were hitting each other and hitting anything else."}, {"time": 1174, "text": "So they swarm around and we can detect their collective effects."}, {"time": 1179, "text": "And when we do computer simulations of how galaxies form and evolve and how they emerge from the Big Bang, then we get a nice consistent picture if we put in five times as much mass in the form of these mysterious dark particles."}, {"time": 1193, "text": "And for instance, it works better if we think they're not interacting particles than if you think they're a gas which would have shockwaves and things."}, {"time": 1205, "text": "So we know something about the properties of these, but we don't know what they are."}, {"time": 1209, "text": "And the disappointment compared to my guess 20 years ago is that particles answering this description have not yet been found."}, {"time": 1217, "text": "It was thought that the big accelerator, the Large Hadron Collider at CERN, which is the world's biggest, might have found a new class of particles which would have been the obvious candidates."}, {"time": 1230, "text": "And it hasn't."}, {"time": 1230, "text": "And some people say, well, dark matter can't be there, etc."}, {"time": 1230, "text": "But what I would argue is that there's a huge amount of parameter space that hasn't been explored."}, {"time": 1238, "text": "There are other kinds of particles called axions which behave slightly differently, which are good candidates."}, {"time": 1244, "text": "And there's a factor of 10 powers of 10 between the heaviest particles that could be created by the Large Hadron Collider and the heaviest particles which on theoretical grounds could exist without turning into black holes."}, {"time": 1264, "text": "So there's a huge amount of possible particles which could be out there as remnants of the Big Bang, but which we wouldn't be able to detect so easily."}, {"time": 1269, "text": "So the fact that we've got new constraints on what the dark matter could be doesn't diminish my belief that it's there in the form of particles because we've only explored a small fraction of parameter space."}, {"time": 1287, "text": "So there's this search, you're literally, upon an unintended, are searching in the dark here in this giant parameter space of possible particles."}, {"time": 1296, "text": "You're searching for, I mean, there could be all kinds of particles."}, {"time": 1301, "text": "There could be, and there's some which may be very, very hard to detect."}, {"time": 1306, "text": "But I think we can hope for some new theoretical ideas because one point which perhaps we'd like to discuss more is about the very early stages of the Big Bang."}, {"time": 1318, "text": "And the situation now is that we have an outline picture for how the universe has evolved from the time when it was expanding in just a nanosecond up to the present."}, {"time": 1326, "text": "And we could do that because after nanosecond, the physics of the material is in the same range that we can test in the lab."}, {"time": 1340, "text": "After a nanosecond, the particles move around like those in the Large Hadron Collider."}, {"time": 1347, "text": "If you wait for one second, they're rather like in the centers of the hottest stars."}, {"time": 1347, "text": "And nuclear reactions produce hydrogen, helium, et cetera, which fit the data."}, {"time": 1354, "text": "So we can with confidence extrapolate back to when the universe was a nanosecond old."}, {"time": 1358, "text": "Indeed, I think we can do it with as much confidence as anything a geologist tells you about the early history of the Earth."}, {"time": 1367, "text": "And that's huge progress in the last 50 years."}, {"time": 1367, "text": "But any progress puts in sharper focus new mysteries."}, {"time": 1376, "text": "And of course, the new mysteries in this context are, why is the universe expanding the way it is?"}, {"time": 1382, "text": "Why does it contain this mixture of atoms and dark matter and radiation?"}, {"time": 1382, "text": "And why does it have the properties which allow galaxies to form, being fairly smooth but not completely smooth?"}, {"time": 1395, "text": "And the answer to those questions, I generally believe, to lie in a much, much earlier stage of the universe, when conditions were much more extreme, and therefore far beyond the stage where we have the foothold in experiments."}, {"time": 1407, "text": "Very theoretical."}, {"time": 1407, "text": "And so we don't have a convincing theory."}, {"time": 1413, "text": "We just have ideas."}, {"time": 1413, "text": "Until we have something like string theory or some other clues to the ultra early universe, that's going to remain speculative."}, {"time": 1418, "text": "So there's a big gap."}, {"time": 1424, "text": "And to say how big the gap is, if we take the observable universe out of a bit more than 10 billion light years, then when the universe was a nanosecond old, that would have been squeezed down to the size of our solar system, or compressed into that volume."}, {"time": 1437, "text": "But the times we're talking about when the key properties of the universe were first imprinted were times when that entire universe was squeezed down to the size of a tennis ball, or baseball if you prefer, and it emerged from something microscopic."}, {"time": 1458, "text": "So it's a huge extrapolation."}, {"time": 1458, "text": "And it's not surprising that, since it's so far from our experimental range of detectability, we are still groping for ideas."}, {"time": 1470, "text": "TG But you think first theory will reach into that place, and then experiment will perhaps one day catch up, maybe simulation."}, {"time": 1478, "text": "JG Well, I think in a sense it's a combination."}, {"time": 1478, "text": "I think what we hope for is that there'll be a theory which applies to the early universe, which also has consequences which we can test in our present day universe, like discovering why neutrinos exist or things like that."}, {"time": 1500, "text": "And that's the thing which, as I mentioned, we may perhaps need a bit of AI to help us to calculate."}, {"time": 1505, "text": "But I think the hope would be that we will have a theory which applies under the very, very extreme early stages of the universe, but which gains credibility and gains confidence, because it also manages to account for otherwise unexplained features of the low energy world, what people call the standard model of particle physics, where there are lots of undetermined numbers."}, {"time": 1529, "text": "So it may help with that."}, {"time": 1529, "text": "TG So we're dancing between physics and philosophy a little bit, but what do you think happened before the Big Bang?"}, {"time": 1542, "text": "So this feels like something that's out of the reach of science."}, {"time": 1542, "text": "JG It's out of the reach of present science, because science develops and as the front is advanced, then new problems come into focus that couldn't even have been postulated before."}, {"time": 1555, "text": "I mean, if I think of my own career, when I was a student, the evidence for the Big Bang was pretty weak, whereas now it's extremely strong."}, {"time": 1567, "text": "But we are now thinking about the reason why the universe is the way it is and all that."}, {"time": 1574, "text": "So I would put all these things we've just mentioned in the category of speculative science."}, {"time": 1581, "text": "And I don't see a bifurcation between that and philosophy."}, {"time": 1581, "text": "But of course, to answer your question, if we do want to understand the very early universe, then we've got to realize that it may involve even more counterintuitive concepts than quantum theory does, because it's a condition even further away from everyday world than quantum theory is."}, {"time": 1600, "text": "And remember, our lives, our brains evolved and haven't changed much since our ancestors roamed the African savanna and looked at the everyday world."}, {"time": 1615, "text": "And it's rather amazing that we've been able to make some sense of the quantum micro world and of the cosmos."}, {"time": 1620, "text": "But there may be some things which are beyond us."}, {"time": 1620, "text": "And certainly, as you implied, there are things that we don't yet understand at all."}, {"time": 1626, "text": "And of course, one concept we might have to jettison is the idea of three dimensions of space and time just ticking away."}, {"time": 1638, "text": "There are lots of ideas."}, {"time": 1638, "text": "I mean, I think Stephen Hawking had an idea."}, {"time": 1638, "text": "They're talking about what happened before the Big Bang."}, {"time": 1646, "text": "It's like asking what happens if you go north from the North Pole."}, {"time": 1650, "text": "It somehow closes off."}, {"time": 1650, "text": "That's just one idea."}, {"time": 1650, "text": "I don't like that idea, but that's a possible one."}, {"time": 1657, "text": "And so we just don't know what happened at the very beginning of the Big Bang, were there many Big Bangs rather than one, etc."}, {"time": 1665, "text": "And those are issues which we may be able to get some foothold on from some new theory."}, {"time": 1673, "text": "But even then, we won't be able to directly test the theories."}, {"time": 1684, "text": "But I think it's a heresy to think you have to be able to test every prediction of a theory."}, {"time": 1690, "text": "We take seriously what Einstein's theory says about the inside of black holes, even though we can't observe them, because that theory has been vindicated in many other places in cosmology and black holes, gravitational waves, and all those things."}, {"time": 1708, "text": "Likewise, if we had a theory which explains some things about the early history of our Big Bang and the present universe, then we would take seriously the inference if it predicted many Big Bangs, not one, even though we can't predict the other ones."}, {"time": 1723, "text": "So the example is we can take seriously a prediction if it's the consequence of a theory that we believe on other grounds."}, {"time": 1734, "text": "We don't need to be able to detect another Big Bang in order to take it seriously."}, {"time": 1740, "text": "It may not be a proof, but it's a good indication that this is the direction where the truth lies."}, {"time": 1748, "text": "Yeah, if the theory is getting confidence in other ways."}, {"time": 1748, "text": "Where do you sense?"}, {"time": 1754, "text": "Do you think there's other universes besides our own?"}, {"time": 1754, "text": "There are sort of well defined theories which make assumptions about the physics at the relevant time, and this time, incidentally, is 10 to the power minus 36 seconds or earlier than that, so this tiny sliver of time."}, {"time": 1774, "text": "There are some theories, a famous one due to Andrei Linde, the Russian cosmologist now at Stanford, called eternal inflation, which did predict an eternal production of new Big Bangs, as it were, and that's based on specific assumptions about the physics."}, {"time": 1788, "text": "But those assumptions, of course, are just hypotheses which aren't vindicated."}, {"time": 1794, "text": "But there are other theories which only predict one Big Bang."}, {"time": 1799, "text": "So I think we should be open minded and not dogmatic about these options until we do understand the relevant physics."}, {"time": 1806, "text": "But there are these different scenarios of very different ideas about this."}, {"time": 1812, "text": "But I think all of them have the feature that physical reality is a lot more extensive than what we can see through our telescope."}, {"time": 1819, "text": "I think even most conservative astronomers would say that because we can see out with our telescopes to a sort of horizon, which is about, depending on how you measure it, maybe 15 billion light years away or something like that."}, {"time": 1838, "text": "But that horizon of observations is no more physical reality than the horizon around you if you're in the ocean and looking out at your horizon."}, {"time": 1845, "text": "There's no reason to think that the ocean ends just beyond your horizon."}, {"time": 1853, "text": "And likewise, there's no reason to think that the aftermath of our Big Bang ends just at the boundary of what we can see."}, {"time": 1859, "text": "Indeed, there are quite strong arguments that it probably goes on about 100 times further."}, {"time": 1870, "text": "It may even go on so much further that all combinatorials are replicated."}, {"time": 1870, "text": "And there's another set of people like us sitting in a room like this."}, {"time": 1877, "text": "That's not logically impossible."}, {"time": 1887, "text": "But I think many people would accept that it does go on and contain probably a million times as much stuff as what we can see within a horizon."}, {"time": 1895, "text": "The reason for that, incidentally, is that if we look as far as we can in one direction and in the opposite direction, then the conditions don't differ by more than one part in 100,000."}, {"time": 1904, "text": "So that means that if we're part of some finite structure, the gradient across the part we can see is very small."}, {"time": 1910, "text": "And so that suggests that it probably does go on a lot further."}, {"time": 1916, "text": "And the best estimates say it must go on at least 20 times further."}, {"time": 1927, "text": "Just the spans of it all, the wide, everything that lies beyond the horizon."}, {"time": 1935, "text": "That example doesn't even hold for Earth, so it goes way, way farther."}, {"time": 1935, "text": "And on top of that, just to take your metaphor further on the ocean, while we're on top of this ocean, not only can we not see beyond the horizon, we also don't know much about the depth of the ocean, nor the actual mechanism of observation that's in our head."}, {"time": 1984, "text": "It's humbling, depending where your ego is, it's humbling."}, {"time": 1993, "text": "But for most of us, I don't think it makes much of a difference."}, {"time": 1997, "text": "Well, there's a more general question, of course, about whether the human race as such is something which is very special, or if on the other hand, it's just one of many such species elsewhere in the universe, or indeed existing at different times in our universe."}, {"time": 2034, "text": "And it just feels wrong to think of Earth as somehow special."}, {"time": 2034, "text": "It sure as heck doesn't look that special."}, {"time": 2044, "text": "The more we learn, the less special it seems."}, {"time": 2056, "text": "We don't understand, although we know there were any evolution of simple life to complex life, we don't understand what caused the transition between complex chemistry and the first replicating, metabolizing entity we call alive."}, {"time": 2075, "text": "That's a mystery, and serious physicists and chemists are now thinking about it, but we don't know."}, {"time": 2082, "text": "So we therefore can't say, was it a rare fluke which would not have happened anywhere else, or was it something which involves a process that would have happened in any other planet where conditions were like they were on the young Earth?"}, {"time": 2097, "text": "So we can't say that now."}, {"time": 2097, "text": "I think many of us would indeed bet that probably some kind of life exists elsewhere."}, {"time": 2104, "text": "But even if you accept that, then there are many contingencies going from simple life to present day life."}, {"time": 2118, "text": "Some biologists like Stephen Jay Gould thought that if you reround evolution, you'd end up with something quite different, and maybe not with an intelligent species."}, {"time": 2124, "text": "So the contingencies in evolution may militate against the emergence of intelligence, even if life gets started in lots of places."}, {"time": 2135, "text": "So I think these are still completely open questions, and that's why it's such an exciting time now that we are starting to be able to address these."}, {"time": 2145, "text": "I mentioned the fact that the origin of life is a question that we may be able to understand, and serious people are working on it."}, {"time": 2152, "text": "It used to be put in a sort of too difficult box."}, {"time": 2152, "text": "Everyone knew it was important, but they didn't know how to tackle it or what experiments to do."}, {"time": 2160, "text": "But it's not like that now."}, {"time": 2160, "text": "That's partly because of clever experiments, but I think most importantly because we are aware that we can look for life in other places, other places in our solar system, and of course, on the exoplanets around other stars."}, {"time": 2173, "text": "And within 10 or 20 years, I think two things could happen, which would be really, really important."}, {"time": 2180, "text": "We might, with the next big telescope, be able to image some of the Earth like planets around other stars."}, {"time": 2192, "text": "Image, like get a picture?"}, {"time": 2196, "text": "MR. Well, actually, caveat that, it'd take 50 years to get a resolved image, but try to detect the light."}, {"time": 2201, "text": "Because now, of course, these exoplanets are detected by their effects on the parent star."}, {"time": 2207, "text": "They either cause their parent star to dim slightly when they transit across in front of it, and so we see the dips, or their gravitational pull makes the star wobble a bit."}, {"time": 2218, "text": "So most of the 5,000 plus planets that have been found around other stars, they've been found indirectly by their effect in one of those two ways on the parent star."}, {"time": 2229, "text": "You can still do a pretty good job estimating size, all those kinds of things."}, {"time": 2233, "text": "MR."}, {"time": 2233, "text": "The size and the mass, you can estimate."}, {"time": 2233, "text": "But detecting the actual light from one of these exoplanets hasn't really been done yet, except for one or two very bright, big planets."}, {"time": 2247, "text": "So maybe like James Webb Telescope."}, {"time": 2249, "text": "MR. Well, James Webb may do this, but even better will be the European ground based telescope called Unimaginatively Extremely Large Telescope, which has a 39 meter diameter mirror."}, {"time": 2256, "text": "39 meters, a mosaic of eight hundred sheets of glass, and that will collect enough light from one of these exoplanets around a nearby star to be able to separate out its light from that of the star, which is millions of times brighter, and get the spectrum of the planet and see if it's got oxygen or chlorophyll and things in it."}, {"time": 2283, "text": "So that will come."}, {"time": 2283, "text": "James Webb may make some steps there."}, {"time": 2291, "text": "But I think we can look forward to learning quite a bit in the next 20 years, because I like to say, supposing that aliens were looking at the solar system."}, {"time": 2298, "text": "Then they'd see the sun as an ordinary star."}, {"time": 2304, "text": "They'd see the Earth as, in Carl Sagan's nice phrase, a pale blue dot lying very close in the sky to its star, our sun, and much, much, much fainter."}, {"time": 2311, "text": "But if they could observe that dot, they could learn quite a bit."}, {"time": 2318, "text": "They could perhaps get the spectrum of the light and find the atmosphere."}, {"time": 2324, "text": "They'd find the shade of blue was slightly different, depending on whether the Pacific Ocean or the land mass of Asia was facing them, so they could infer the length of the day and the ocean and continents, and maybe something about the seasons and the climate."}, {"time": 2340, "text": "That's the kind of calculation and inference we might be able to draw within the next 10 or 20 years about other exoplanets."}, {"time": 2348, "text": "Evidence of some sort of biosphere on one of them would, of course, be crucial, and it would rule out the still logical possibility that life is unique."}, {"time": 2362, "text": "But there's another way in which this may happen in the next 20 years."}, {"time": 2362, "text": "People think there could be something swimming under the ice of Europa and Enceladus, and probes are being sent to maybe not quite go under the ice but detect the spray coming out to see if there's evidence for organics in that."}, {"time": 2379, "text": "And if we found any evidence for an origin of life that had happened in either of those places, that would immediately be important."}, {"time": 2387, "text": "Because if life has originated twice independently in one planetary system, the solar system, that would tell us straight away it wasn't a rare accident and must have happened billions of times in the galaxy."}, {"time": 2399, "text": "At the moment, we can't rule out it being unique."}, {"time": 2405, "text": "And incidentally, if we found life on Mars, then that would still be ambiguous because people have realized that this early life could have got from Mars to Earth or vice versa on meteorites."}, {"time": 2418, "text": "So if you found life on Mars, then some skeptics could still say if it's a single origin."}, {"time": 2424, "text": "But I think that's far enough away statistically."}, {"time": 2424, "text": "So that's why that would be especially..."}, {"time": 2431, "text": "It's always the skeptics that ruin a good party."}, {"time": 2431, "text": "But we need them, of course."}, {"time": 2431, "text": "We need them at the party."}, {"time": 2438, "text": "We need some skeptics at the party."}, {"time": 2438, "text": "But boy, would that be so exciting to find life on one of the moons."}, {"time": 2444, "text": "Because it means that life is everywhere."}, {"time": 2444, "text": "That'll just be any kind of vegetation or life."}, {"time": 2452, "text": "The question of the aliens of science fiction is a different matter."}, {"time": 2458, "text": "Intelligent aliens."}, {"time": 2458, "text": "Yeah, but if you have a good indication that there's life elsewhere in the solar system, that means life is everywhere."}, {"time": 2465, "text": "I don't know if that's terrifying or what that is."}, {"time": 2475, "text": "Because if life is everywhere, why is intelligent life not everywhere?"}, {"time": 2475, "text": "You've talked about that most likely alien civilizations, if they are out there, they would likely be far ahead of us."}, {"time": 2489, "text": "The ones that would actually communicate with us."}, {"time": 2489, "text": "And that, again, one of those things is both exciting and terrifying."}, {"time": 2498, "text": "You've mentioned that they're likely not to be of biological nature."}, {"time": 2504, "text": "MR. Well, I think that's important."}, {"time": 2504, "text": "Of course, again, it's speculation."}, {"time": 2504, "text": "But in speculating about intelligent life, and I take the search seriously."}, {"time": 2511, "text": "In fact, I chair the committee that the Russian American investor Yuri Milner supports looking for intelligent life."}, {"time": 2519, "text": "He's putting $10 million a year into better equipment and getting time on telescopes to do this."}, {"time": 2525, "text": "And so I think it's worthwhile, even though I don't hold my breath for success."}, {"time": 2531, "text": "It's very exciting."}, {"time": 2531, "text": "But that does lead me to wonder what might be detected."}, {"time": 2538, "text": "And I think, well, we don't know."}, {"time": 2538, "text": "We've got to be open minded about anything."}, {"time": 2544, "text": "We have no idea what it could be."}, {"time": 2544, "text": "And so any anomalous objects, or even some strange shiny objects in the solar system, or anything we've got to keep our eyes open for."}, {"time": 2554, "text": "But I think if we ask about a planet like the Earth, where evolution had taken more of the same track, then, as you say, it wouldn't be synchronized."}, {"time": 2564, "text": "If it had lagged behind, then, of course, it would not have got to advanced life."}, {"time": 2571, "text": "But it may have had a head start."}, {"time": 2571, "text": "It may have formed on a planet around an older star."}, {"time": 2577, "text": "But then let's ask what we would see."}, {"time": 2577, "text": "It's taken nearly four billion years from the first life to us."}, {"time": 2584, "text": "And we now got this technological civilization which could make itself detectable to any aliens out there."}, {"time": 2591, "text": "But I think most people would say that this civilization of flesh and blood creatures in a collective civilization may not last more than a few hundred years more."}, {"time": 2609, "text": "I think that some people would say it will kill itself off."}, {"time": 2609, "text": "But I'm more optimistic."}, {"time": 2618, "text": "And I would say that what we're going to have in future is no longer the slow Darwinian selection."}, {"time": 2627, "text": "But we're going to have what I call secular intelligent design, which will be humans designing their progeny to be better adapted to where they are."}, {"time": 2642, "text": "And if they go to Mars or somewhere, they're badly adapted and they want to adapt a lot."}, {"time": 2649, "text": "And so they will adapt."}, {"time": 2649, "text": "But there may be some limits to what could be done with flesh and blood."}, {"time": 2655, "text": "And so they may become largely electronic, download their brains and be electronic entities."}, {"time": 2663, "text": "And if they're electronic, then what's important is that they're near immortal."}, {"time": 2670, "text": "And also, they won't necessarily want to be on a planet with an atmosphere or gravity."}, {"time": 2670, "text": "They may go off into the blue yonder."}, {"time": 2676, "text": "And if they're near immortal, they won't be daunted by interstellar travel taking a long time."}, {"time": 2681, "text": "And so if we looked at what would happen on the Earth in the next millions of years, then there may be these electronic entities, which have been sent out and are now far away from the Earth, but still sort of burping away in some fashion to be detected."}, {"time": 2704, "text": "And so this therefore leads me to think that if there was another planet which had evolved like the Earth and was ahead of us, it wouldn't be synchronized, so we wouldn't see a flesh and blood civilization, but we would see these electronic progeny, as it were."}, {"time": 2719, "text": "And then this raises another question, because there's the famous argument against there being lots of aliens out there, which is that they would come and invade us and eat us or something like that."}, {"time": 2739, "text": "That's a common idea, which Fermi is attributed to have been the first to say."}, {"time": 2746, "text": "And I think there's an escape clause to that, because these entities would be evolved by second intelligent design, designed by their predecessors and then designed by us."}, {"time": 2759, "text": "Whereas Darwinian selection requires two things."}, {"time": 2759, "text": "It requires aggression and intelligence."}, {"time": 2759, "text": "This future intelligent design may favor intelligence, because that's what they were designed for, but it may not favor aggression."}, {"time": 2776, "text": "And so these future entities, they may be sitting deep thoughts, they're thinking deep thoughts, and not being at all expansionist."}, {"time": 2783, "text": "So they could be out there."}, {"time": 2792, "text": "And we can't refute their existence in the way the Fermi paradox is supposed to refute their existence, because these would not be aggressive or expansionist."}, {"time": 2801, "text": "Well, maybe evolution requires competition, not aggression."}, {"time": 2801, "text": "And I wonder if competition can take forms that are non expansionary."}, {"time": 2806, "text": "So you can still have fun competing in the space of ideas, which maybe primarily..."}, {"time": 2816, "text": "The Darwin philosophers, perhaps, yeah."}, {"time": 2819, "text": "In a way, right."}, {"time": 2819, "text": "It's an intellectual exercise versus a sort of violent exercise."}, {"time": 2827, "text": "So what does this civilization on Mars look like?"}, {"time": 2827, "text": "So do you think we would more and more maybe start with some genetic modification and then move to basically cyborgs, increasing integration of electronic systems, computational systems into our bodies and brains?"}, {"time": 2845, "text": "This is a theme of my other new book out this year, which is called The End of Astronauts."}, {"time": 2851, "text": "The End of Astronauts."}, {"time": 2853, "text": "It's co written with my old friend and colleague from Berkeley, Don Goldsmith."}, {"time": 2853, "text": "And it's really about the role of human spaceflight versus sort of robotic spaceflight."}, {"time": 2860, "text": "And just to summarize what it says, it argues that the practical case for sending humans into space is getting weaker all the time as robots get better and more capable."}, {"time": 2876, "text": "Robots 50 years ago couldn't do anything very much, but now they could assemble big structures on space or in space or on the moon, and they could probably do exploration."}, {"time": 2888, "text": "But present ones on Mars can't actually do the geology, but future AI will be able to do the geology and already they can dig on Mars."}, {"time": 2904, "text": "And so if you want to do exploration of Mars, and of course, even more of Enceladus or Europa where you could never send humans, we depend on robots."}, {"time": 2911, "text": "And they're far, far cheaper because to send a human to Mars requires feeding them for 200 days on the journey there and bringing them back."}, {"time": 2923, "text": "And neither of those are necessary for robots."}, {"time": 2928, "text": "So the practical case for humans is getting very, very weak."}, {"time": 2928, "text": "And if humans go, it's only as an adventure, really."}, {"time": 2934, "text": "And so the line in our book is that human spaceflight should not be pursued by NASA or public funding agencies because it has no practical purpose, but also because it's especially expensive if they do it because they would have to be risk averse in launching civilians into space."}, {"time": 2959, "text": "I can illustrate that by noting that the shuttle was launched 135 times and it had two spectacular failures, which each killed the seven people in the crew."}, {"time": 2975, "text": "And it had been mistakenly presented as safe for civilians."}, {"time": 2975, "text": "And there was a woman schoolteacher killed in one of them."}, {"time": 2982, "text": "It was a big national trauma and they tried to make it safer still."}, {"time": 2986, "text": "But if you launch into space, just the kind of people prepared to accept that sort of risk, and of course, test pilots and people who go hang gliding and go to the South Pole, et cetera, are prepared to accept a 2% risk at least for a big challenge, then of course, you do it more cheaply."}, {"time": 3006, "text": "And that's why I think human spaceflight should be left to the billionaires and their sponsors because then the taxpayers aren't paying and they can launch simply those people who are prepared to accept high risks."}, {"time": 3022, "text": "Space adventure, not space tourism."}, {"time": 3022, "text": "And we should cheer them on."}, {"time": 3031, "text": "And as regards where they would go, then low Earth orbit, as I suspect, can be done quite cheaply in the future."}, {"time": 3040, "text": "But going to Mars, which is very, very expensive and dangerous for humans."}, {"time": 3046, "text": "The only people who would go would be these adventurers, maybe on one way trip, like some of the early polar explorers and Magellan and people like that."}, {"time": 3055, "text": "And we would cheer them on."}, {"time": 3060, "text": "And I expect and I've ever hoped that by the end of a century, there will be a small community of such people on Mars living very uncomfortably, far less comfortably than at the South Pole or the bottom of the ocean or the top of Everest."}, {"time": 3076, "text": "But they will be there and they won't have a return ticket, but they'll be there."}, {"time": 3081, "text": "Incidentally, I think it's a dangerous illusion to think, as Elon Musk has said, that we can have mass emigration from the Earth to Mars to escape the Earth's problems."}, {"time": 3098, "text": "It's a dangerous illusion because it's far easier to deal with climate change on Earth than to terraform Mars to make it probably habitable to humans."}, {"time": 3111, "text": "And so there's no planet B for ordinary risk averse people."}, {"time": 3111, "text": "But for these crazy adventurers, then you can imagine that they would be trying to live on Mars as great pioneers."}, {"time": 3123, "text": "And by the end of a century, then there will be huge advances compared to the present in two things."}, {"time": 3129, "text": "First, in understanding genetics, so as to genetically redesign one's offspring."}, {"time": 3129, "text": "And secondly, to use cyborg techniques to implant something in our brain or indeed think about downloading, et cetera."}, {"time": 3143, "text": "And those techniques will, one hopes, be heavily regulated on Earth on prudentials and ethical grounds."}, {"time": 3150, "text": "And of course, we are pretty well adapted to the Earth, so we don't have the incentive to do these things in the way they were there."}, {"time": 3156, "text": "So our argument is that it'll be those crazy pioneers on Mars using all these scientific advances, which will be controlled here, away from the regulators, they will transition into a new post human species."}, {"time": 3178, "text": "And so if they do that, and if they transition into something which is electronic, eventually, because there may be some limits to the capacity of flesh and blood brains anyways, then those electronic entities may not want to stay on a planet like Mars, they may want to go away."}, {"time": 3196, "text": "And so they'll be the precursors of the future evolution of life and intelligence coming from the Earth."}, {"time": 3204, "text": "And of course, there's one point which perhaps astronomers are more aware of than most people."}, {"time": 3209, "text": "Most people are aware that we are the outcome of 4 billion years of evolution."}, {"time": 3216, "text": "Most of them nonetheless, probably think that we humans are somehow the culmination, the top of the tree."}, {"time": 3222, "text": "But yes, no astronomers can believe that because astronomers know that the Earth is four and a half billion years old."}, {"time": 3229, "text": "The sun has been shiny for that length of time."}, {"time": 3236, "text": "But the sun has got 6 billion years more to go before it flares up and engulfs the inner planet."}, {"time": 3241, "text": "So the sun is less than halfway through its life."}, {"time": 3241, "text": "And the expanding universe goes on far longer still, maybe forever."}, {"time": 3248, "text": "And I like to quote Woody Allen, who said, eternity is very long, especially towards the end."}, {"time": 3253, "text": "So we shouldn't think of ourselves as maybe even the halfway stage in the emergence of cosmic complexity."}, {"time": 3259, "text": "And so these entities who are postcursors, they will go beyond the solar system."}, {"time": 3267, "text": "And of course, even if there's nothing else out there already, then they could populate the rest of the galaxy."}, {"time": 3272, "text": "And maybe eventually meet the others who are out there expanding as well."}, {"time": 3280, "text": "Expanding, populating with expanded capacity for life and intelligence, all those kinds of things."}, {"time": 3288, "text": "Well, they might."}, {"time": 3288, "text": "But again, all better off."}, {"time": 3295, "text": "We can't conceive what they'd be like."}, {"time": 3295, "text": "They won't be green men and women with eyes on stalks."}, {"time": 3303, "text": "Maybe something quite different."}, {"time": 3303, "text": "But there is an interesting question, actually, which comes up when I've sometimes spoken to audiences about this topic, but the question of consciousness and self awareness."}, {"time": 3312, "text": "Because going back to philosophical questions, whether an electronic robot would be a zombie, or would it be conscious and self aware?"}, {"time": 3327, "text": "And I think there's no way of answering this empirically."}, {"time": 3327, "text": "And some people think that consciousness and self awareness is an emergent property in any sufficiently complicated networks that they would be."}, {"time": 3339, "text": "Others say, well, maybe it's something special to the flesh and blood that we're made of."}, {"time": 3344, "text": "And in a sense, this may not matter to the way things behave because they could be zombies and still behave as though they were intelligent."}, {"time": 3352, "text": "But I remember after one of my talks, someone came up and said, wouldn't it be sad if these future entities, which were the main intelligent in the universe, had no self awareness?"}, {"time": 3366, "text": "So there was nothing which could appreciate the wonder and mystery of the universe and the beauty of the universe in the way that we do."}, {"time": 3377, "text": "And so it does perhaps affect one's perspective of whether you welcome or deplore this possible future scenario, depending on whether you think the future post human entities are conscious and have an aesthetic sense or whether they're just zombies."}, {"time": 3396, "text": "And of course, you have to be humble to realize that self awareness may not be the highest form of being, that humans have a very strong ego and a very strong sense of identity, like personal identity connected to this particular brain."}, {"time": 3414, "text": "It's not so obvious to me that that is somehow the highest achievement of a life form, that maybe this kind of... Do you think something collective would be?"}, {"time": 3430, "text": "It's possible that, well, I think from an alien perspective, when you look at Earth, it's not so obvious to me that individual humans are the atoms of intelligence."}, {"time": 3437, "text": "It could be the entire organism together, the collective intelligence."}, {"time": 3444, "text": "And so we humans think of ourselves as individuals, we dress up, we wear ties and suits, and we'll give each other prizes."}, {"time": 3453, "text": "But in reality, the intelligence, the things we create that are beautiful emerges from our interaction with each other."}, {"time": 3459, "text": "And that may be where the intelligence is, ideas jumping from one person to another over generations."}, {"time": 3467, "text": "Yes, but we have experiences where we can appreciate beauty and wonder and all that."}, {"time": 3474, "text": "And a zombie may not have those experiences."}, {"time": 3479, "text": "Yeah, or it may have a very different, a very black and white, harsh description of a philosophical zombie that could be just a very different way to experience."}, {"time": 3493, "text": "And, you know, in terms of the explorers that colonize Mars, I mean, there's several things I want to mention."}, {"time": 3498, "text": "One, it's just at a high level."}, {"time": 3498, "text": "To me, that's one of the most inspiring things humans can do, is reach out into the unknown."}, {"time": 3505, "text": "That's in the space of ideas, in the space of science, but also the explorers."}, {"time": 3514, "text": "Yes, no, I agree with that."}, {"time": 3515, "text": "And that inspires people here on Earth more."}, {"time": 3515, "text": "I mean, it did in their, you know, when going to the moon or going out to space in the 20th century, that inspired me."}, {"time": 3526, "text": "I think that also could be used to inspire a generation of new scientists in the 21st century by reaching out towards Mars."}, {"time": 3534, "text": "So in that sense, I think what Elon Musk and others are doing is actually quite inspiring."}, {"time": 3540, "text": "It's not, it's not a recreational thing."}, {"time": 3540, "text": "It's actually has a deep humanitarian purpose of really inspiring the world."}, {"time": 3547, "text": "And then, you know, I think, you know, I don't think Elon says we want to escape Earth's problems."}, {"time": 3552, "text": "It's more that we should allocate some small percentage of resources to have a backup plan."}, {"time": 3562, "text": "And because you yourself have spoken about and written about all the ways we clever humans destroy ourselves."}, {"time": 3575, "text": "You could go on."}, {"time": 3576, "text": "And I'm not sure, it does seem when you look at the long arc of human history, it seems almost obvious that we need to become a multi planetary species over a period."}, {"time": 3585, "text": "If we are to survive many centuries, it seems that as we get clever and clever with the ways we can destroy ourselves, Earth is going to become less and less safe."}, {"time": 3599, "text": "So in that sense, this is one of the things, you know, people talk about climate change and that we need to respond to climate change."}, {"time": 3608, "text": "And that's a long term investment we need to make, but it's not really long term."}, {"time": 3613, "text": "It's a span of decades."}, {"time": 3619, "text": "I think what Elon is doing is a really long term investment."}, {"time": 3622, "text": "We should be working on multi planetary colonization now if we were to have it ready five centuries from now."}, {"time": 3629, "text": "And so taking those early steps."}, {"time": 3629, "text": "And then also there's something happens when you go into the unknown and do this really difficult thing."}, {"time": 3635, "text": "You discover something very new."}, {"time": 3642, "text": "You discover something about robotics."}, {"time": 3642, "text": "You discover something about materials engineering or nutrition or neuroscience or human relations or political systems that actually work well with humans."}, {"time": 3653, "text": "You discover all those things."}, {"time": 3653, "text": "And so it's a worthy effort to go out there and try to become cyborgs."}, {"time": 3659, "text": "Yeah, no, I agree with that."}, {"time": 3659, "text": "I think the only different point I'd make is that this is going to be very, very, very, very, very, very, very, very, very, very, very, very expensive if it's done in a risk averse way."}, {"time": 3677, "text": "And that's why I think we should be grateful to the billionaires if they're going to sort of foster these opportunities for thrill seeking risk takers who we can all admire."}, {"time": 3693, "text": "By the way, I should push back on the billionaires because there's sometimes a negative connotation to the word billionaire."}, {"time": 3698, "text": "It's not a billionaire."}, {"time": 3701, "text": "It's a company versus government because governments are billionaires and trillionaires."}, {"time": 3706, "text": "It's not the wealth."}, {"time": 3706, "text": "It's the capitalist imperative, which I think deserves a lot more praise than people are giving it."}, {"time": 3718, "text": "I'm troubled by the sort of criticism like it's billionaires playing with toys for their own pleasure."}, {"time": 3724, "text": "I think what some of these companies like SpaceX and Blue Origin are doing is some of the most inspiring engineering and even scientific work ever done in human history."}, {"time": 3739, "text": "I think the people who've made the greatest wealth are people who've really been mega benefactors."}, {"time": 3746, "text": "I mean, I think, you know."}, {"time": 3751, "text": "Some of them, some of them."}, {"time": 3751, "text": "Yeah, yes, some of them."}, {"time": 3751, "text": "But those who've founded Google and all that and even Amazon, they're beneficiaries."}, {"time": 3757, "text": "They're in a quite different category, in my view, from those who just shuffle around money or crypto coins and things like that."}, {"time": 3772, "text": "Now you're really talking trash."}, {"time": 3774, "text": "But I think if they use their money in these ways, that's fine."}, {"time": 3774, "text": "But I think it's true that far more money is owned by us collectively as taxpayers."}, {"time": 3782, "text": "But I think the fact is that in a democracy, there'd be big resistance to exposing human beings to very high risks if in a sense we share responsibility for it."}, {"time": 3796, "text": "And that's the reason I think it would be done much more cheaply by these private funders."}, {"time": 3804, "text": "That's an interesting hypothesis, but I have to push back."}, {"time": 3804, "text": "I don't know if it's obvious why NASA spends so much money and takes such a long time to develop the things it was doing."}, {"time": 3818, "text": "So before Elon Musk came along, because I would love to live in a world where government actually uses taxpayer money to get some of the best engineers and scientists in the world and actually work across governments, Russia, China, United States, European Union together to do some of these big projects."}, {"time": 3835, "text": "It's strange that Elon is able to do this much cheaper, much faster."}, {"time": 3840, "text": "It could have to do with risk aversion, you're right."}, {"time": 3846, "text": "But I think it's that he had all the whole assembly within this one building as it were, rather than depending on a supply chain."}, {"time": 3855, "text": "But I think it's also that he had a Silicon Valley culture and had younger people, whereas the big aerospace companies, Boeing and Lockheed Martin, they had people who were left over from the Apollo program in some cases."}, {"time": 3868, "text": "And so they weren't quite so lively."}, {"time": 3873, "text": "And indeed, quite apart from the controversial issues of the future of human spaceflight, in terms of the next generation of big rockets, then the one that Musk is going to launch for the first time this year, the huge one, is going to be far, far cheaper than the one that NASA has been working on at the same time."}, {"time": 3895, "text": "And that's because it will have a reusable first stage."}, {"time": 3901, "text": "And it's going to be great."}, {"time": 3901, "text": "It can launch over 100 tons into Earth orbit."}, {"time": 3901, "text": "And incidentally, that's going to make it feasible to do things that I used to think were crazy, like having solar energy from space."}, {"time": 3914, "text": "That's no longer so crazy if you can do that."}, {"time": 3914, "text": "And also, for science, because its nose cone could contain within it something as big as the entire unfurled James Webb telescope mirror."}, {"time": 3931, "text": "And therefore, you can have a big telescope much more cheaply if you can launch it all in one piece."}, {"time": 3937, "text": "And so it's going to be hugely beneficial to science and to any practical use of space to have these cheaper rockets that are far more completely reusable than anyways NASA had."}, {"time": 3949, "text": "So I think Musk's done a tremendous service to space exploration and the whole space technology through these rockets, certainly."}, {"time": 3956, "text": "Plus, it's some big sexy rocket."}, {"time": 3963, "text": "It's just great engineering."}, {"time": 3963, "text": "It's like looking at a beautiful big bridge that humans are capable."}, {"time": 3968, "text": "Us descendants of apes are capable to do something so majestic."}, {"time": 3972, "text": "And also the way they land coming down on this bar."}, {"time": 3976, "text": "It's both controls engineering."}, {"time": 3976, "text": "It's increasing sort of intelligence in these rockets, but also great propulsion engineering materials, entrepreneurship."}, {"time": 3984, "text": "And it just inspires so many people."}, {"time": 3991, "text": "No, I'm entirely with you on that."}, {"time": 3991, "text": "So would it be exciting to you to see a human being step foot on Mars in your lifetime?"}, {"time": 3998, "text": "Yes, I think it's unlikely in my lifetime since I'm so ancient."}, {"time": 4003, "text": "But I think this century, it's going to happen."}, {"time": 4003, "text": "And I think that will indeed be exciting."}, {"time": 4010, "text": "And I hope there will be a small community by the end of a century."}, {"time": 4015, "text": "But as I say, I think they may go with one way tickets or accepting the risk of no return."}, {"time": 4023, "text": "And so they've got to be people like that."}, {"time": 4023, "text": "And I still think it's going to be hard to persuade the public to send people when you say straight out that they may never come back."}, {"time": 4030, "text": "But of course, the Apollo astronauts, they took a high risk."}, {"time": 4038, "text": "And in fact, in my previous book, I quote the speech that has been written for Nixon to be read out if Neil Armstrong got stuck on the moon."}, {"time": 4051, "text": "And it was written by one of his advisors and very eloquent speech about how they have come to a noble end, et cetera."}, {"time": 4062, "text": "But of course, there was a genuine risk at that time."}, {"time": 4062, "text": "But that may have been accepted."}, {"time": 4071, "text": "But clearly, the crashes of the shuttle were not acceptable to the American public, even when they were told that this was only a 2% risk given how often they launched it."}, {"time": 4085, "text": "And so that's what leads me to think that it's got to be left to the kind of people who are prepared to take these risks."}, {"time": 4093, "text": "And I think of American Avengers, there was a guy called Steve Fossett who was an aviator who did all kinds of crazy things."}, {"time": 4099, "text": "And then a guy who fell supersonically with a parachute from very high altitude."}, {"time": 4105, "text": "All these people, we all share them on."}, {"time": 4112, "text": "They extend the bounds of humanity."}, {"time": 4112, "text": "But I don't think the public will be so happy to fund them."}, {"time": 4119, "text": "I mean, I disagree with that."}, {"time": 4119, "text": "I think if we change the narrative, we should change the story."}, {"time": 4125, "text": "I think there's a lot of people... Because the public is happy to fund folks in other domains that take bold, giant risks."}, {"time": 4133, "text": "First of all, military, for example."}, {"time": 4137, "text": "Oh, in the military, obviously, yes."}, {"time": 4139, "text": "I think this is, in the name of science, especially if it's sold correctly, I sure as hell would go up there with a risk..."}, {"time": 4145, "text": "I would take a 40% chance risk of death for something that's..."}, {"time": 4152, "text": "I would."}, {"time": 4152, "text": "I might want to be even older than I am now."}, {"time": 4152, "text": "But then I would go."}, {"time": 4157, "text": "I guess what I'm trying to communicate is there's a lot of people on Earth."}, {"time": 4157, "text": "That's the nice feature and I'm sure there's going to be a significant percentage or some percentage of people that are..."}, {"time": 4167, "text": "They take on the risk for the adventure."}, {"time": 4167, "text": "So, and I particularly love that that risk of adventure when taking on inspires people and just the ripple effect it has across the generation, especially among the young minds, is perhaps immeasurable."}, {"time": 4180, "text": "But you're thinking that sending humans should be something we do less and less, sending humans to space."}, {"time": 4190, "text": "That it should be primarily an effort."}, {"time": 4196, "text": "The work of space exploration should be done primarily by robots."}, {"time": 4203, "text": "Well, I think it can be done much more cheaply, obviously, on Mars."}, {"time": 4203, "text": "And no one's thinking of sending humans to Enceladus or Europa, the outer planets."}, {"time": 4209, "text": "And the point is we will have much better robots."}, {"time": 4218, "text": "Because let's take an example."}, {"time": 4218, "text": "You've seen the pictures of the moons of Saturn and the picture of Pluto and the comet taken by probes and Cassini spent 13 years going around Saturn and its moons after seven year voyage."}, {"time": 4237, "text": "And those are all based on 1990s technology."}, {"time": 4237, "text": "And if you think of how smartphones have advanced in the 20 years since then, just think how much better one could do instrumenting some very small, sophisticated probe."}, {"time": 4247, "text": "You could send dozens of them to explore the outer planets."}, {"time": 4254, "text": "And that's the way to do that."}, {"time": 4254, "text": "Because no one thinks you could send humans that far."}, {"time": 4258, "text": "But I would apply the same argument to Mars."}, {"time": 4258, "text": "And if you want to assemble big structures like, for instance, radio astronomers would like to have a big radio telescope on the far side of the moon so it's away from the Earth's background artificial radio waves."}, {"time": 4272, "text": "And that could be done by assembling using robots without people."}, {"time": 4280, "text": "So on the moon and on Mars, I think everything that's useful can be done by machines much more cheaper than by humans."}, {"time": 4295, "text": "Do you know the movie 2001 A Space Odyssey?"}, {"time": 4299, "text": "You must be too young to have seen that when it came out, obviously."}, {"time": 4304, "text": "I remember seeing it when it came out."}, {"time": 4306, "text": "You saw it when it came out."}, {"time": 4308, "text": "Yeah, yeah, 50 years ago."}, {"time": 4310, "text": "60, when was it?"}, {"time": 4310, "text": "60, in the 60s."}, {"time": 4314, "text": "Still a classic."}, {"time": 4318, "text": "It's still probably, for me, the greatest AI movie ever made."}, {"time": 4323, "text": "Yes, yes, I agree."}, {"time": 4324, "text": "One of the great space movies ever made."}, {"time": 4326, "text": "Well, let me ask you a philosophical question."}, {"time": 4326, "text": "Since we're talking about robots exploring space, do you think HAL 9000 is good or bad?"}, {"time": 4332, "text": "So for people who haven't watched, this computer system makes a decision to basically prioritize the mission that the ship is on over the humans that are part of the mission."}, {"time": 4358, "text": "If you ask me, probably in that context, it was probably good."}, {"time": 4358, "text": "But I think you're raising what is, of course, very much an active issue in everyday life about the extent to which we should entrust any important decision to a machine."}, {"time": 4370, "text": "And there again, I'm very worried, because I think if you are recommended for an operation or not given parole from prison or even denied credit by your bank, you feel you should be entitled to an explanation."}, {"time": 4386, "text": "It's not enough to be told that the machine has a more reliable record on the whole than humans have of making these decisions."}, {"time": 4400, "text": "You think you should be given reasons you could understand."}, {"time": 4400, "text": "And that's why I think the present societal trend to take away the humans and leave us in the hands of decisions that we can't contest is a very dangerous one."}, {"time": 4417, "text": "I think we've got to be very careful of the extent to which AI, which can handle lots of information, actually makes the decision without oversight."}, {"time": 4424, "text": "And I think we can use them as a supplement."}, {"time": 4430, "text": "But to take the case of radiology and cancer, I mean, it's true that the radiologist hasn't seen as many x rays of cancer lungs as the machine."}, {"time": 4437, "text": "So the machine could certainly help, but you want the human to make the final decision."}, {"time": 4448, "text": "And I think that's true in most of these instances."}, {"time": 4452, "text": "But if we turn a bit to the short term concerns with robotics, I think the big worry, of course, is the effect it has on people's self respect and their labor market."}, {"time": 4467, "text": "And I think my solution would be that we should arrange to tax more heavily the big international conglomerates, which use the robots and use that tax to fund decently paid, dignified posts of the kind where being a human being is important."}, {"time": 4494, "text": "Above all, carers for old people, teachers assistants for young, gardens in public parks, and things like that."}, {"time": 4499, "text": "And if the people who are now working in mind numbing jobs in Amazon warehouses, or in telephone call centers, are automated, but those same people are given jobs where being a human is an asset, then that's a plus plus situation."}, {"time": 4515, "text": "And so that's the way I think that we should benefit from these technologies, take over the mind numbing jobs, and use machines to make them more efficient, but enable the people so displaced to do jobs where we do want a human being."}, {"time": 4540, "text": "I mean, most people when they're old, they're rich people if they have the choice."}, {"time": 4546, "text": "They want human carers and all that, don't they?"}, {"time": 4546, "text": "They may want robots to help with some things, empty the bed pans and things like that, but they want real people."}, {"time": 4551, "text": "And certainly in this country, I think even worse in America, the care of old people is completely inadequate."}, {"time": 4566, "text": "And it needs just more human beings to help them cope with everyday life and look after them when they're sick."}, {"time": 4571, "text": "And so that seems to be the way in which the money raised in tax from these big companies should be deployed."}, {"time": 4579, "text": "So that's in the short term, but if you actually just look, the fact is where we are today to longterm future in a hundred years, it does seem that there is some significant chance that the human species is coming to an end in its pure biological form."}, {"time": 4599, "text": "There's going to be greater and greater integration through genetic modification and cyborg type of creatures."}, {"time": 4603, "text": "And so you have to think, all right, well, we're going to have to get from here to there and that process is going to be painful."}, {"time": 4616, "text": "And there's so many different trajectories that take us from one place to another."}, {"time": 4622, "text": "It does seem that we need to deeply respect humanness and humanity, basic human rights, human welfare, like happiness and all that kind of stuff."}, {"time": 4634, "text": "And that's why I think we ought to try and slow down the application of these human enhancement techniques and cyborg techniques for humans for just that reason."}, {"time": 4640, "text": "I mean, that's why I want to lead into the people on Mars, let them do it, but for just that reason."}, {"time": 4652, "text": "But there are people too."}, {"time": 4652, "text": "People on Mars are people too."}, {"time": 4652, "text": "I tend to, you know."}, {"time": 4657, "text": "But they are very poorly adapted to where they are."}, {"time": 4657, "text": "That's why they need this modification, whereas we're adapted to the Earth quite well."}, {"time": 4662, "text": "So we don't need these modifications."}, {"time": 4662, "text": "We're happy to be humans living in the environment where our ancestors lived."}, {"time": 4669, "text": "So we don't have the same motive."}, {"time": 4675, "text": "So I think there's a difference."}, {"time": 4675, "text": "But I agree, we don't want drastic changes probably in our lifestyle."}, {"time": 4681, "text": "And that indeed is a worry because some things are changing so fast."}, {"time": 4686, "text": "But I think I'd like to inject a note of caution."}, {"time": 4686, "text": "If you think of the way progress in one technology goes, it goes in a sort of spurt."}, {"time": 4693, "text": "It goes up very fast and then it levels off."}, {"time": 4693, "text": "Let me give you two examples."}, {"time": 4702, "text": "One we've had already, a human space flight."}, {"time": 4702, "text": "At the time of the Apollo program, which was only 12 years after Sputnik 1, I was alive then."}, {"time": 4708, "text": "And I thought it would only be 10 or 20 years further before there were footprints on Mars."}, {"time": 4715, "text": "But as we know, for reasons we could all understand, that still remains the high point of human space exploration."}, {"time": 4721, "text": "That's because it was funded for reasons of superpower rivalry at huge public expense."}, {"time": 4730, "text": "But let me give you another case, civil aviation."}, {"time": 4737, "text": "If you think of the change between 1919, when that was Alcock and Brown's first transatlantic fight, to 1979, the first flight of the jumbo jet."}, {"time": 4745, "text": "It was a big change."}, {"time": 4745, "text": "But it's more than 50 years since 1969."}, {"time": 4752, "text": "And we still have jumbo jets more or less the same."}, {"time": 4752, "text": "So that's an example of something which developed fast."}, {"time": 4757, "text": "And to take another analogy, we've had huge developments in mobile phones."}, {"time": 4764, "text": "But I suspect the iPhone 24 may not be too different from the iPhone 13."}, {"time": 4772, "text": "They develop, but then they saturate, and then maybe some new innovation takes over in stimulating economic growth."}, {"time": 4779, "text": "Yeah, so it's that we have to be cautious about being too optimistic, and we have to be cautious about being too cynical."}, {"time": 4787, "text": "I think that is the optimistic is begging the question."}, {"time": 4792, "text": "I mean, do we want this rapid change?"}, {"time": 4796, "text": "So first of all, there's some degree to which technological advancement is something, is a force that can't be stopped."}, {"time": 4801, "text": "And so the question is about directing it versus stopping it or slowing it."}, {"time": 4807, "text": "Well, it can be sort of sloped or slow."}, {"time": 4807, "text": "We'll take human spaceflight."}, {"time": 4807, "text": "There could have been footprints on Mars if America had gone on spending 4% of the federal budget on the project after Apollo."}, {"time": 4819, "text": "There were very good reasons, and we could have had supersonic flight, but Concorde came and went during the 50 years."}, {"time": 4829, "text": "But the reason it didn't progress is not because we realize it's not good for human society."}, {"time": 4837, "text": "The reason it didn't progress is because it couldn't make, sort of from a capitalist perspective, it couldn't make, there was no short term or long term way for it to make money."}, {"time": 4847, "text": "So for me, it isn't, but that's the same as saying it's not good for society."}, {"time": 4854, "text": "I don't think everything that makes money is good for society and everything that doesn't make money is bad for society, right?"}, {"time": 4859, "text": "That's a difficult thing we're always contending with."}, {"time": 4866, "text": "That's a difficult thing we're always contending with when we look at social networks."}, {"time": 4866, "text": "It's not obvious, even though they make a tremendous amount of money, that they're good for society, especially how they're currently implemented with advertisement and engagement maximization."}, {"time": 4884, "text": "So that's the constant struggle."}, {"time": 4886, "text": "But I would have thought that supersonic flight was something that would benefit only a tiny elite at a huge expense and environmental damage."}, {"time": 4898, "text": "That was obviously something which we're very glad not to have, in my opinion."}, {"time": 4906, "text": "Yeah, but perhaps there was a way to do it where it could benefit the general populace."}, {"time": 4911, "text": "If you were to think about airplanes, wouldn't you think that in the early days, airplanes would have been seen as something that can surely only benefit 1% at most of the population, as opposed to a much larger percentage?"}, {"time": 4923, "text": "There's another aspect of capitalist system that's able to drive down costs once you get the thing kind of going."}, {"time": 4929, "text": "So we get together maybe with taxpayer money and get the thing going at first."}, {"time": 4935, "text": "And once it gets going, companies step up and drive down the cost and actually make it so that blue collar folks can actually start using the stuff."}, {"time": 4946, "text": "Yeah, sometimes that does happen."}, {"time": 4949, "text": "So that's, again, the double edged sword of human civilization, that some technology hurts us, some benefits us, and we don't know ahead of time."}, {"time": 4957, "text": "We can just do our best."}, {"time": 4961, "text": "There's a gap between what could be done and what we collectively decide to do."}, {"time": 4969, "text": "And it could push forward some developments faster than we do."}, {"time": 4975, "text": "Let me ask you, in your book on the future prospects for humanity, you imagine a time machine that allows you to send a tweet length message to scientists in the past, like to Newton."}, {"time": 4985, "text": "What tweet would you send?"}, {"time": 4992, "text": "What message would you send to Newton about what we know today?"}, {"time": 4995, "text": "Well, I think he'd love to know that there were planets around other stars."}, {"time": 4995, "text": "He'd like to know that everything was made of atoms."}, {"time": 5002, "text": "He'd like to know that if he looked a bit more carefully through his prisms and looked at light, not just from the sun, but from some flames, he might get the idea that different substances emitted light of different colors, and he might have been twigged to discover some things that had to wait 200 or 300 years."}, {"time": 5024, "text": "Could have given him those clues, I think."}, {"time": 5031, "text": "It's fascinating to think, to look back at how little he understood, people at that time understood about our world."}, {"time": 5044, "text": "And certainly about the cosmos."}, {"time": 5047, "text": "About the cosmos, yes."}, {"time": 5048, "text": "Well, if you think about astronomy, then until about 1850, astronomy was a matter of the positions of how the stars and the planets moved around."}, {"time": 5059, "text": "Of course, that goes back a long way, but Newton understood why the planets moved around in ellipses."}, {"time": 5065, "text": "But he didn't understand why the solar system was all in a plane, what we call the ecliptic, and he didn't understand it."}, {"time": 5079, "text": "No one did until the mid 19th century what the stars are made of."}, {"time": 5079, "text": "I mean, they were thought to be made of some fifth essence, not earth, air, fire, and water like everything else, and it was only after 1850 when people did use prisms more precisely to get spectra that they realized that the sun was made of the same stuff as the earth, and indeed the stars were."}, {"time": 5096, "text": "It wasn't until 1930 that people knew about nuclear energy and knew what kept the sun shining for so long."}, {"time": 5112, "text": "So it was quite late that some of these key ideas came in, which would have completely transformed Newton's views, and of course, the entire scale of the galaxy and the rest of the universe."}, {"time": 5125, "text": "Just imagine what he would have thought about the Big Bang, or even just general relativity, just gravity, just him and Einstein talking for a couple weeks."}, {"time": 5130, "text": "Would he be able to make sense of space time and the curvature of space time?"}, {"time": 5139, "text": "Well, I think given a quick course, I mean, he was sort of, if one looks back, he was really a unique intellect in a way, you know, and he said that he thought better than everyone else by thinking on things continually, and thinking very deep thoughts, and so he was an utterly remarkable intellect, obviously."}, {"time": 5166, "text": "But of course, scientists aren't all like that."}, {"time": 5166, "text": "I think one thing that's interesting to me, having spent a life among scientists, is what a variety of mindsets and mental styles they have."}, {"time": 5176, "text": "And just to contrast Newton and Darwin, Darwin said, and he's probably correct, that he thought he just had as much common sense and reasoning power as the average lawyer."}, {"time": 5190, "text": "And that's probably true because his ability was to sort of collect data and think through things deeply."}, {"time": 5198, "text": "That's a quite different kind of thinking from what was involved in Newton or someone doing abstract mathematics."}, {"time": 5210, "text": "I think in the 20th century, the coolest, well, there's the theory, but from an astronomy perspective, black holes is one of the most fascinating entities to have been, through theory and through experiment, to have emerged from."}, {"time": 5228, "text": "Obviously, I agree."}, {"time": 5228, "text": "It's an amazing story."}, {"time": 5233, "text": "Well, of course, what's interesting is Einstein's reaction because, as you know, we now accept this is one of the most remarkable predictions of Einstein's theory."}, {"time": 5242, "text": "He never took it seriously, even believed it, although it was a consequence of a solution of his equations, which someone discovered just a year after his theory, Schwarzschild."}, {"time": 5254, "text": "But he never took it seriously, and others did."}, {"time": 5260, "text": "But then, of course, well, this is something that I've been involved in actually finding evidence for black holes, and that's come in the last 50 years."}, {"time": 5267, "text": "So now, there's pretty compelling evidence that they exist as the remnants of stars or big ones in the center of galaxies."}, {"time": 5278, "text": "And we understand what's going on."}, {"time": 5278, "text": "We have ideas, vaguely on how they form."}, {"time": 5287, "text": "And, of course, gravitational waves have been detected, and that's an amazing piece of technology."}, {"time": 5294, "text": "Ligo is one of the most incredible engineering efforts of all time."}, {"time": 5298, "text": "That's an example where the engineers deserve most of the credit because the precision is, as I said, it's like measuring the thickness of a hair at the distance of Alpha Centauri."}, {"time": 5310, "text": "Tens to minus 21."}, {"time": 5311, "text": "So maybe, actually, if we step back, what are black holes?"}, {"time": 5311, "text": "What do we humans understand about black holes and what's still unknown?"}, {"time": 5320, "text": "Einstein's theory, extended by people like Roger Penrose, tells us that black holes are, in a sense, rather simple things, basically, because they are solutions of Einstein's equations."}, {"time": 5334, "text": "And the thing that was shown in the 1960s by Roger Penrose in particular, and by a few other people, was that a black hole, when it forms and settles down, is defined just by two quantities, its mass and its spin."}, {"time": 5349, "text": "So they're actually very standardized objects."}, {"time": 5349, "text": "It's amazing that objects as standardized as that can be so big and can lurk in the rest of the solar system."}, {"time": 5360, "text": "And so that's the situation for a ready formed black hole."}, {"time": 5360, "text": "But the way they form, obviously, is very messy and complicated."}, {"time": 5367, "text": "And one of the things that I've worked on a lot is what the phenomena are, which are best attributed to black holes, and what may lead to them, and all that."}, {"time": 5383, "text": "Which, can you explain to that?"}, {"time": 5383, "text": "So what are the different phenomena that lead to a black hole?"}, {"time": 5389, "text": "Well, I think one thing that only became understood, really, in the 1950s, I suppose, and beyond was how stars evolve differently depending on how heavy they are."}, {"time": 5405, "text": "The sun burns hydrogen to helium, and then when it's run out of that, it contracts to be a white dwarf."}, {"time": 5411, "text": "And we know how long that will take."}, {"time": 5411, "text": "It'll take about 10 billion years altogether for its lifetime."}, {"time": 5416, "text": "But big stars burn up their fuel more quickly, and more interestingly, because when they've turned hydrogen to helium, they then get even hotter, so they can fuse helium into carbon and go up the periodic table."}, {"time": 5427, "text": "And then they eventually explode when they have an energy crisis, and they blow out that process material, which, as a digression, is crucially important because all the atoms inside our bodies were synthesized inside a star, a star that lived and died more than five billion years ago before our solar system formed."}, {"time": 5450, "text": "And so we each have inside us atoms made in thousands of different stars all over the Milky Way, and that's an amazing idea."}, {"time": 5455, "text": "My predecessor, Fred Hoyle, in 1946 was the first person to suggest that idea, and that's been borne out."}, {"time": 5460, "text": "That's a wonderful idea."}, {"time": 5465, "text": "So that's how massive stars explode."}, {"time": 5465, "text": "And they leave behind something which is very exotic of two kinds."}, {"time": 5475, "text": "One possibility is a neutron star, and these were first discovered in 1967, 68."}, {"time": 5481, "text": "These are stars a bit heavier than the sun, which are compressed to an amazing density, so the whole mass of more than the sun's mass is in something about 10 miles across."}, {"time": 5494, "text": "So they're extraordinarily dense, they're exotic physics, and they've been studied in immense detail."}, {"time": 5506, "text": "And they've been real laboratories because the good thing about astronomy, apart from exploring what's out there, is to use the fact that the cosmos has provided us with a lab with far more extreme conditions than we could ever simulate."}, {"time": 5517, "text": "And so we learn lots of basic physics from looking at these objects, and that's been true of neutron stars."}, {"time": 5521, "text": "But for black holes, that's even more true because the bigger stars, when they collapse, they leave something behind in the center which is too big to be a stable white 2 or 4 neutron star and becomes a black hole."}, {"time": 5539, "text": "And we know that there are lots of black holes weighing about 10 or up to 50 times as much as the sun, which are the remnants of stars."}, {"time": 5545, "text": "They were detected first 50 years ago, when a black hole was orbiting around another star and grabbing material from the other star which swirled into it and gave us X rays."}, {"time": 5560, "text": "So the X rays astronomers found these objects orbiting around an ordinary star and emitting X ray radiation very intensely, varying on a very short time scale."}, {"time": 5568, "text": "So something very small and dense was giving that radiation."}, {"time": 5576, "text": "That was the first evidence for black holes."}, {"time": 5580, "text": "But then the other thing that happened was realizing that there was a different class of monster black holes in the centers of galaxies."}, {"time": 5585, "text": "And these are responsible for what's called quasars, which is when something in the center of a galaxy is grabbing some fuel and outshines all the hundred billion stars or so in the rest of the galaxy."}, {"time": 5599, "text": "A giant beam of light."}, {"time": 5599, "text": "And in many cases, it's a beam of... That's got to be the most epic thing the universe produces is quasars."}, {"time": 5615, "text": "Well, it's a debate about what's the most epic, but quasars maybe or maybe gamma ray bursts or something, but they are remarkable and they were a mystery for a long time."}, {"time": 5620, "text": "And they're one of the things I worked on in my younger days."}, {"time": 5625, "text": "So even though they're so bright, they're still a mystery and you can only see them."}, {"time": 5630, "text": "I think they're less of a mystery now."}, {"time": 5634, "text": "I think we do understand basically what's going on."}, {"time": 5634, "text": "How were quasars discovered?"}, {"time": 5640, "text": "Well, they were discovered when astronomers found things that looked like stars and that they were small enough to be a point like and not resolved by a telescope, but outshone an entire galaxy."}, {"time": 5653, "text": "That's suspicious."}, {"time": 5655, "text": "But then they realized that what they were, they were objects which you now know are black holes and black holes were capturing gas and that gas was getting very hot, but it was producing far more energy than all the stars added together."}, {"time": 5673, "text": "And it was the energy of the black hole that was lighting up all the gas in the galaxy."}, {"time": 5683, "text": "So you've got a spectrum of it there."}, {"time": 5683, "text": "So this was something which was realized from the 1970s onwards."}, {"time": 5690, "text": "And as you say, the other thing we've learned is that they often do produce these jets squirting out, which could be detected in all wave bands."}, {"time": 5696, "text": "So there's now a standard picture."}, {"time": 5705, "text": "So there's a giant black hole generating jets of light at the center of most galaxies."}, {"time": 5711, "text": "Do we know, do we have a sense if every galaxy has one of these big boys, big black holes?"}, {"time": 5718, "text": "Most galaxies have big black holes."}, {"time": 5718, "text": "They vary in size."}, {"time": 5718, "text": "The one in our galactic center."}, {"time": 5723, "text": "Do we know much about ours?"}, {"time": 5725, "text": "We know it weighs about as much as 4 million suns, which is less than some, it's several billion other galaxies."}, {"time": 5734, "text": "But we know this one in our galactic center isn't very bright or conspicuous."}, {"time": 5740, "text": "And that's because not much is falling into it at the moment."}, {"time": 5746, "text": "If a black hole is isolated, then of course it doesn't radiate."}, {"time": 5746, "text": "All that radiates is gas swirling into it, which is very hot or has magnetic fields."}, {"time": 5757, "text": "It's only radiating the thing it's murdering or consuming, however you put it."}, {"time": 5761, "text": "And so it's thought that our galaxy may have been bright at some time in the past, but now that's when the black hole formed or grew."}, {"time": 5767, "text": "But now it's not capturing very much gas."}, {"time": 5776, "text": "And so it's rather faint and detected indirectly and by fairly weak radio emission."}, {"time": 5784, "text": "And so I think the answer to your question is that we suspect that most galaxies have a black hole in them."}, {"time": 5791, "text": "So that means at some stage in their lives, or maybe one or more stages, they went through a phase of being like a quasar where that black hole captured gas and became very, very bright."}, {"time": 5801, "text": "But for the rest of their lives, the black holes are fairly quiescent because there's not much gas falling into them."}, {"time": 5813, "text": "And so this universe of ours is sprinkled with a bunch of galaxies and giant black holes with very large number of stars orbiting these black holes and then planets orbiting."}, {"time": 5828, "text": "Likely, it seems like planets orbiting almost every one of those stars and just this beautiful universe of ours."}, {"time": 5837, "text": "Well, what happens when galaxies collide, when these two big black holes collide?"}, {"time": 5844, "text": "Well, what would happen is that... Well, and I should say that this is going to happen near us one day, but not for 4 billion years because the Andromeda galaxy, which is the biggest galaxy near to us, which is about nearly 3 million light years away, which is a big disk galaxy with a black hole in its hub, rather like our Milky Way."}, {"time": 5864, "text": "And that's falling towards us because they're both in a common gravitational potential well."}, {"time": 5873, "text": "And that will collide with our galaxy in about 4 billion years."}, {"time": 5879, "text": "But maybe it'll be less a collision and more of a dance because it'll be like a swirling situation."}, {"time": 5885, "text": "But eventually, there'll be a merger."}, {"time": 5885, "text": "They'll go through each other and then merge."}, {"time": 5890, "text": "In fact, there are nice movies to be made of this, computer simulations, and it'll go through."}, {"time": 5896, "text": "And then there's a black hole in the center of Andromeda and our galaxy."}, {"time": 5906, "text": "And the black holes will settle towards the center."}, {"time": 5906, "text": "Then they will orbit around each other very fast, and then they will eventually merge."}, {"time": 5914, "text": "And that'll produce a big burst of gravitational waves, a very big burst."}, {"time": 5919, "text": "That an alien civilization with a LIGO like detector will be able to detect."}, {"time": 5925, "text": "Well, in fact, we can detect these with their lower frequencies than the ways that will be detected by LIGO."}, {"time": 5930, "text": "So there's a spatial interferometer which can detect these."}, {"time": 5937, "text": "It's about one cycle per hour rather than about 100 cycles per second."}, {"time": 5944, "text": "It's the ones that detect it."}, {"time": 5944, "text": "But that will happen."}, {"time": 5944, "text": "But thinking back to what will happen in 4 billion years to any of our descendants, they'll be okay because the two disk galaxies will merge."}, {"time": 5959, "text": "It'll end up as a sort of amorphous elliptical galaxy."}, {"time": 5959, "text": "But the stars won't be much closer together than they are now."}, {"time": 5966, "text": "It'll still be just twice as many stars in a structure almost as big."}, {"time": 5972, "text": "And so the chance of another star colliding with our sun would still be very small."}, {"time": 5981, "text": "Because there's actually a lot of space between stars and planets."}, {"time": 5985, "text": "Yes, the chance of a star getting close enough to affect our solar system's orbit is small."}, {"time": 5989, "text": "And it won't change that very much."}, {"time": 5989, "text": "So you could be reassured."}, {"time": 5993, "text": "A heck of a starry sky though."}, {"time": 5997, "text": "Well, it won't make much difference even to that actually."}, {"time": 5997, "text": "It'll just be... Wouldn't that look kind of beautiful when you're swirling?"}, {"time": 6001, "text": "Oh, because it's swirling so slowly."}, {"time": 6005, "text": "Yeah, but they're far away."}, {"time": 6005, "text": "So it'll be twice as many stars in the sky."}, {"time": 6010, "text": "Yeah, but the pattern changes in interesting ways."}, {"time": 6012, "text": "Yeah, the pattern will change a bit."}, {"time": 6012, "text": "And there won't be the Milky Way because the Milky Way across the sky is because we are looking in the disk of our galaxy."}, {"time": 6017, "text": "And you lose that."}, {"time": 6022, "text": "And because the disk will be so disrupted."}, {"time": 6022, "text": "And it'll be a more sort of spherical distribution."}, {"time": 6028, "text": "And of course, many galaxies are like that."}, {"time": 6028, "text": "And that's probably because they have been through mergers of this kind."}, {"time": 6033, "text": "If we survive four billion years, we would likely be able to survive beyond that."}, {"time": 6039, "text": "What's the other thing on the horizon for humans in terms of the sun burning out, all those kinds of interesting cosmological threats to our civilization?"}, {"time": 6051, "text": "Well, I think on the cosmological time scale, because it won't be humans, because even if evolution is no faster than Darwinian, and I would argue it will be faster than Darwinian in the future, then we're thinking about six billion years before the sun dies."}, {"time": 6063, "text": "So any entities watching the death of the sun, if they're still around, they'll be as different from much as we are from slime mold or something."}, {"time": 6074, "text": "And far more different still if they become electronic."}, {"time": 6080, "text": "So on that time scale, we just can't predict anything."}, {"time": 6080, "text": "But I think going back to the human time scale, then we've talked about whether there'll be people on Mars by the end of a century."}, {"time": 6092, "text": "And even in these long perspectives, then indeed, this century is very special, because it may see the transition between purely flesh and blood entities to those which are sort of cyborgs."}, {"time": 6105, "text": "And that'll be an important transition in the future."}, {"time": 6111, "text": "But of course, the other importance, and this has been the theme of a couple of my older books, is that this is the first century when one species, namely our species, has the future of the planet in its hands."}, {"time": 6122, "text": "And that's because of two types of concerns."}, {"time": 6122, "text": "One is that there are more of us where more of us are living in the past, and the other is that there are more of us who are living in the future."}, {"time": 6136, "text": "So those are two concerns."}, {"time": 6136, "text": "One is that there are more of us where more demanding of energy and resources, and therefore we are for the first time changing the whole planet through climate change, loss of biodiversity, and all those issues."}, {"time": 6150, "text": "This has never happened in the past, because there haven't been enough humans."}, {"time": 6157, "text": "So this is an effect that's now, and rightly so, because we've got to ensure that we leave a heritage that isn't eroded or damaged to future generations."}, {"time": 6171, "text": "And so that's one class of threats."}, {"time": 6175, "text": "But there's another thing that worries me, perhaps more than many people seem to worry, and that's the threat of misuse of technology."}, {"time": 6182, "text": "And so this is particularly because technologies empower even small groups of malevolent people, or indeed even careless people, to create some effect which could cascade globally."}, {"time": 6201, "text": "And to take an example, a dangerous pathogen or pandemic, I mean, my worst nightmare is that there could be some small group that can engineer a virus to make it more variant or more transmissible than a natural virus."}, {"time": 6222, "text": "This is a gain of function experiments which were done on the flu virus 10 years ago and can be done for others."}, {"time": 6231, "text": "And of course, we now know from COVID 19 that our world is so interconnected that a disaster in one part of the world can't be confined to that part and will spread globally."}, {"time": 6242, "text": "So it's possible for a few dissidents with expertise in biotech could create a global catastrophe of that kind."}, {"time": 6254, "text": "And also, I think we need to worry about very large scale disruption by cyber attacks and in fact, I quote in one of my books, a 2012 report from the American Pentagon about the possibility of a state level cyber attack on the electricity grid in Eastern United States, which is it could happen."}, {"time": 6278, "text": "And it says at the end of this chapter that this would merit a nuclear response."}, {"time": 6278, "text": "This is a pretty scary possibility."}, {"time": 6285, "text": "And that was 10 years ago."}, {"time": 6285, "text": "And I think now what would have needed a state actor then could be done perhaps by a small group empowered by AI."}, {"time": 6291, "text": "And so there's obviously been an arms race between the cyber criminals and the cyber security people."}, {"time": 6297, "text": "Not clear which side is winning."}, {"time": 6306, "text": "But the main point is that as we become more dependent on more integrated systems, then we get more vulnerable."}, {"time": 6311, "text": "And so we have the knowledge, then the misuse of that knowledge becomes more and more of a threat."}, {"time": 6321, "text": "And I'd say bio and cyber are the two biggest concerns."}, {"time": 6328, "text": "And if we depend too much on AI and complex systems, then just breakdowns, it may be that they break down."}, {"time": 6337, "text": "And even if it's an innocent breakdown, then it may be pretty hard to mend it."}, {"time": 6343, "text": "And just think how much worse the pandemic would have been if we'd lost the internet in the middle of it."}, {"time": 6348, "text": "We'd be dependent more than ever for communication and everything else on the internet and Zooms and all that."}, {"time": 6355, "text": "And if that had broken down, that would have made things far worse."}, {"time": 6355, "text": "And those are the kinds of threats that we, I think, need to be more energized and politicians need to be more energized to minimize."}, {"time": 6367, "text": "And one of the things I've been doing in the last year through being a member of our part of our parliament is I have to instigate a committee to think more on better preparedness for extreme technological risks and things like that."}, {"time": 6380, "text": "So they're a big concern in my mind that we've got to make sure that we can benefit from these advances but safely because the stakes are getting higher and the benefits are getting great, as we know, huge benefits from computers, but also huge downsides as well."}, {"time": 6402, "text": "And one of the things this war in Ukraine has shown, one of the most terrifying things outside of the humanitarian crisis, is that at least for me, I realized that the human capacity to initiate nuclear war is greater than I thought."}, {"time": 6431, "text": "I thought the lessons of the past have been learned."}, {"time": 6431, "text": "It seems that we hang on the brink of nuclear war with this conflict like every single day with just one mistake or bad actor or the actual leaders of the particular nations launching a nuclear strike and all hell breaks loose."}, {"time": 6448, "text": "So then add into that picture, cyber attacks and so on, that can lead to confusion and chaos."}, {"time": 6455, "text": "And then out of that confusion, calculations are made such that a nuclear weapon is launched and then you're talking about, I mean, it directs probably 60, 70% of humans on Earth are dead instantly."}, {"time": 6485, "text": "And then the rest, I mean, it's basically 99% of the human population is wiped out in the period of five years."}, {"time": 6494, "text": "Well, it may not be that bad, but it will be a devastation for civilization, of course."}, {"time": 6498, "text": "And of course, you were quite right that this could happen very quickly because of information coming in and there's hardly enough time for human collected and careful thought."}, {"time": 6514, "text": "And there have been recorded cases of false alarms."}, {"time": 6514, "text": "There's several where there have been suspected attacks from the other side."}, {"time": 6521, "text": "And fortunately, they've been really false alarm soon enough, but this could happen."}, {"time": 6528, "text": "And there's a new class of threats actually, which in our center in Cambridge, people are thinking about, which is that the commander control system of the nuclear weapons and the submarine fleet and all that is now more automated and could be subject to cyber attacks."}, {"time": 6548, "text": "And that's a new threat which didn't exist 30 years ago."}, {"time": 6548, "text": "And so I think indeed, we're in a sort of scary world, I think."}, {"time": 6556, "text": "And it's because things happen faster and human beings aren't in such direct and immediate control because so much is delegated to machines."}, {"time": 6566, "text": "And also because the world is so much more interconnected, then some local event can cascade globally in a way it never could in the past and much faster."}, {"time": 6584, "text": "Yeah, it's a double edged sword because the interconnectedness brings a higher quality of life across a lot of metrics."}, {"time": 6596, "text": "Yeah, it can do."}, {"time": 6596, "text": "But of course, there again, I mean, if you think of supply chains where we get stuff from around the world, then one lesson we've learned is that there's a trade off between resilience and efficiency and it's resilient to have an inventory in stock and to depend on local supplies, whereas they're more efficient to have long supply chains."}, {"time": 6616, "text": "But the risk there is that a break in one link in one chain can screw up car production."}, {"time": 6624, "text": "This has already happened in the pandemic."}, {"time": 6630, "text": "So there's a trade off."}, {"time": 6630, "text": "I mean, for instance, the other thing we learned was that it may be efficient to have 95% of your hospital intensive care beds occupied all the time, which has been the UK situation, whereas to do what the Germans do and always keep 20% of them free for an emergency is really a sensible precaution."}, {"time": 6647, "text": "And so I think we've probably learned a lot of lessons from COVID 19."}, {"time": 6653, "text": "And they would include rebalancing the trade off between resilience and efficiency."}, {"time": 6664, "text": "Boy, the fact that COVID 19, a pandemic that could have been a lot, a lot worse, brought the world to its knees anyway."}, {"time": 6675, "text": "It could be far worse in terms of its fatality rate or something like that, of course."}, {"time": 6680, "text": "So the fact that that, I mean, it revealed so many flaws in our human institutions."}, {"time": 6686, "text": "And I think I'm rather pessimistic because I do worry about the baractol, a small group who can produce catastrophe."}, {"time": 6698, "text": "And if you imagine someone with access to the kind of equipment that's available in university labs or industrial labs, and they could create some dangerous pathogen, then even one such person is too many."}, {"time": 6712, "text": "And how can we stop that?"}, {"time": 6712, "text": "Because it's true that you can have regulations."}, {"time": 6720, "text": "I mean, academies are having meetings, et cetera, about how to regulate these new biological experiments, et cetera, make them safe."}, {"time": 6727, "text": "But even if you have all these regulations, then enforcing regulations is pretty hopeless."}, {"time": 6733, "text": "We can't enforce the tax laws globally."}, {"time": 6733, "text": "We can't enforce the drug laws globally."}, {"time": 6740, "text": "And so similarly, we can't readily enforce the laws against people doing these dangerous experiments, even if all the governments say they should be prohibited."}, {"time": 6753, "text": "And so my line on this is that all nations are going to face a big trade off between three things we value, freedom, security, and privacy."}, {"time": 6760, "text": "And I think different nations will make that choice differently."}, {"time": 6772, "text": "The Chinese would give up privacy and have certainly more security, if not more liberty."}, {"time": 6779, "text": "But I think in our countries, I think we're going to have to give up more privacy in the same way."}, {"time": 6788, "text": "But there's also something about human nature here, where I personally believe that all humans are capable of good and evil."}, {"time": 6801, "text": "And there's some aspect to which we can fight this by encouraging people, incentivizing people towards the better angels of their nature."}, {"time": 6812, "text": "So in order for a small group of people to create, to engineer deadly pathogens, you have to have people that, for whatever trajectory took them in life, wanting to do that kind of thing."}, {"time": 6827, "text": "And if we can aggressively work on a world that sort of sees the beauty in everybody and encourages the flourishing of everybody in terms of mental health, in terms of meaning, in terms of all those kinds of things, that's one way to fight the development of weapons that can lead to atrocities."}, {"time": 6854, "text": "RL Yes, and I completely agree with that and to reduce the reason why people feel embittered."}, {"time": 6859, "text": "But of course, we've got a long way to go to do that."}, {"time": 6859, "text": "Because if you look at the present world, nearly everyone in Africa has reason to feel embittered because their economic development is lagging behind most of the rest of the world."}, {"time": 6874, "text": "And the prospects of getting out of the poverty trap is rather bleak, especially as the population grows."}, {"time": 6879, "text": "Because for instance, they can't develop like the Eastern Tigers by cheap manufacturing, because robots have taken that over."}, {"time": 6890, "text": "So they naturally feel embittered by the inequality."}, {"time": 6890, "text": "And of course, what we need to have is some sort of mega version of the Marshall Plan that helped Europe in the post World War II era to enable Africa to develop."}, {"time": 6906, "text": "That would be not just an altruistic thing for Europe to do, but in our interest because otherwise, those in Africa will feel massively disaffected."}, {"time": 6920, "text": "And indeed, it's a manifestation of the excessive inequalities, the fact that the 2000 richest people in the world have enough money to double the income of the bottom billion."}, {"time": 6930, "text": "And that's an indictment of the ethics of the world."}, {"time": 6930, "text": "And this is where my friend Stephen Pinker and I have had some contact."}, {"time": 6939, "text": "We wrote joint articles on bio threats and all that."}, {"time": 6939, "text": "But he writes these books, being very optimistic about quoting figures about how life expectancy has gone up, infant mortality has gone down, literacy has gone up, and all those things."}, {"time": 6954, "text": "And he's quite right about that."}, {"time": 6958, "text": "And so he says the world's getting better."}, {"time": 6958, "text": "Do you disagree with your friends, Stephen Pinker?"}, {"time": 6964, "text": "Well, I mean, I agree with those facts."}, {"time": 6964, "text": "But I think he misses out part of the picture."}, {"time": 6971, "text": "Because there's a new class of threats, which hang over us now, which didn't hang over us in the past."}, {"time": 6979, "text": "And I would also question whether we have collectively improved our ethics at all."}, {"time": 6984, "text": "Because let's think back to the Middle Ages."}, {"time": 6984, "text": "It's true that, as Pinker says, the average person was in a more miserable state than they are today, on average."}, {"time": 6990, "text": "For all the reasons he quantifies, that's fine."}, {"time": 6997, "text": "But in the Middle Ages, there wasn't very much that could have been done to improve people's lot in life because of lack of knowledge and lack of science, etc."}, {"time": 7011, "text": "So the gap between the way the world was, which was pretty miserable, and the way the world could have been, which wasn't all that much better, was fairly narrow."}, {"time": 7017, "text": "Whereas now, the gap between the way the world is and the way the world could be is far, far wider."}, {"time": 7023, "text": "And therefore, I think we are ethically more at fault in allowing this gap to get wider than it was in medieval times."}, {"time": 7038, "text": "And so I would very much question and dispute the idea that we are ethically in advance of our predecessors collectively."}, {"time": 7046, "text": "That's a lot of interesting hypotheses in there."}, {"time": 7046, "text": "It's a fascinating question of how much is the size of that gap between the way the world is and the way the world could be is a reflection of our ethics."}, {"time": 7059, "text": "Or maybe sometimes it's just a reflection of a very large number of people."}, {"time": 7064, "text": "Maybe it's a technical challenge too."}, {"time": 7064, "text": "It's not just... Well, of our political systems."}, {"time": 7071, "text": "And we're trying to figure this thing out."}, {"time": 7071, "text": "There's 20th century, tried this thing that sounded really good on paper of collective, the communism type of things."}, {"time": 7078, "text": "And it's like, turned out at least the way that was done there, that leads to atrocities and the suffering and the murder of tens of millions of people."}, {"time": 7090, "text": "Okay, so that didn't work."}, {"time": 7090, "text": "Let's try democracy."}, {"time": 7096, "text": "And that seems to have a lot of flaws, but it seems to be the best thing we got so far."}, {"time": 7100, "text": "So we're trying to figure this out as our technologies become more and more powerful, have the capacity to do a lot of good to the world, but also unfortunately have the capacity to destroy the entirety of the human civilization."}, {"time": 7110, "text": "And I think it's social media generally, which makes it harder to get a sort of moderate consensus because in the old days when people got their news filtered through responsible journalists in this country, the BBC and the main newspapers, et cetera, they would muffle the crazy extremes."}, {"time": 7129, "text": "Whereas now, of course, they're on the internet."}, {"time": 7136, "text": "And if you click on them, you get something still more extreme."}, {"time": 7140, "text": "And so I think we are seeing a sort of dangerous polarization, which I think is going to make all countries harder to govern."}, {"time": 7146, "text": "And that's something which I'm pessimistic about."}, {"time": 7149, "text": "RL So to push back, it is true that brilliant people like you highlighting the limitations of social media is making them realize the stakes and the failings of social media companies, but at the same time, they're revealing the division."}, {"time": 7162, "text": "It's not like they're creating it, they're revealing it in part."}, {"time": 7166, "text": "And so that puts a lot of, that puts the responsibility into the hands of social media and the opportunity in the hands of social media to alleviate some of that division."}, {"time": 7178, "text": "So it could in the long arc of human history result."}, {"time": 7178, "text": "So bringing some of those divisions and the anger and the hatred to the surface so that we can talk about it."}, {"time": 7192, "text": "And as opposed to disproportionately promoting it, actually just surfacing it so we can get over it."}, {"time": 7197, "text": "Well, you're assuming that the fat cats are more public spirited than the politicians."}, {"time": 7202, "text": "And I'm not sure about that."}, {"time": 7203, "text": "RL I think there's a lot of money to be made in being publicly spirited."}, {"time": 7203, "text": "I think there's a lot of money to be made in increasing the amount of love in the world, despite the sort of public perception that all the social media companies heads are interested in doing is making money."}, {"time": 7223, "text": "I think that may be true, but I just personally believe people being happy is a hell of a good business model."}, {"time": 7231, "text": "And so making as many people happy, helping them flourish in a long term way, that's a good way to make money."}, {"time": 7242, "text": "RL Well, I think on the other hand, guilt and shame are good motives to make you behave better in the future."}, {"time": 7247, "text": "That's my experience."}, {"time": 7249, "text": "RL From maybe in the political perspective, certainly it's the case."}, {"time": 7249, "text": "But it does make sense now that we can destroy ourselves with nuclear weapons, with engineered pandemics and so on, that the aliens would show up."}, {"time": 7262, "text": "If I had a leadership position, maybe as a scientist or otherwise in an alien civilization, and I would come upon Earth, I would try to watch from a distance, do not interfere."}, {"time": 7282, "text": "And I would start interfering when these life forms start becoming quite, have the capacity to be destructive."}, {"time": 7291, "text": "And so, I mean, it is an interesting question when people talk about UFO sightings and all those kinds of things that at least... RL These are benign aliens you're thinking of."}, {"time": 7305, "text": "RL Benign, yes."}, {"time": 7305, "text": "I mean, they benign, almost curious, almost, partially, as with all curiosity, partially selfish to try to observe, is there something interesting about this particular evolutionary system?"}, {"time": 7320, "text": "Because I'm sure even to aliens, Earth is a curiosity."}, {"time": 7326, "text": "Well, it's in its very special stage."}, {"time": 7329, "text": "RL It's very special."}, {"time": 7329, "text": "Perhaps it's very short."}, {"time": 7332, "text": "RL This century is very special among the 45 million centuries the Earth experienced already."}, {"time": 7337, "text": "So it is a very special time where they should be specially interested."}, {"time": 7337, "text": "But I think going back to the politics, the other problem is getting people who have short term concerns to care about the long term."}, {"time": 7351, "text": "By the long term, I now mean just looking 30 years or so ahead."}, {"time": 7351, "text": "I know people who've been scientific advisors to governments and things, and they may make these points, but of course, they don't have much traction because as we know very well, any politician has an urgent agenda of very worrying things to deal with."}, {"time": 7368, "text": "And so they aren't going to prioritize these issues, which are longer term and less immediate, and don't just concern their constituents, they concern distant parts of the world."}, {"time": 7381, "text": "And so I think what we have to do is to enlist charismatic individuals to convert the public, because if the politicians know the public care about something, climate change as an example, then they will make decisions which take cognizance of that."}, {"time": 7405, "text": "And I think for that to happen, then we do need some public individuals who are respected by everyone, and to have a high profile."}, {"time": 7422, "text": "And in the climate context, I would say that I've mentioned four very disparate people who've had such a big effect in the last few years."}, {"time": 7428, "text": "One is Pope Francis, the other is David Attenborough, the other is Bill Gates, and the other is Greta Thornberg."}, {"time": 7434, "text": "And those four people have certainly had a big shift in public opinion, and even changed the rhetoric of business, although how deep that is, I don't know."}, {"time": 7447, "text": "But politicians can't let these issues drop down off the agenda if there's a public clamor, and it needs people like that to keep the public clamor going."}, {"time": 7463, "text": "To push back a little bit, so those four are very interesting, and I have deep respect for them."}, {"time": 7467, "text": "They have, except David Attenborough, David Attenborough is really, I mean, everybody loves him."}, {"time": 7473, "text": "I can't say anything."}, {"time": 7473, "text": "But Bill Gates and Greta, that also has created a lot of division."}, {"time": 7480, "text": "And this is a big problem, so it's not just charismatic."}, {"time": 7480, "text": "I put that responsibility actually on the scientific community and the politicians."}, {"time": 7486, "text": "So we need the charismatic leaders, and they're rare."}, {"time": 7498, "text": "When you look at human history, those are the ones that make a difference."}, {"time": 7503, "text": "Those are the ones that, not deride, they inspire the populace to think long term."}, {"time": 7503, "text": "The JFK will go to the moon in this decade, not because it's easy, but because it is hard."}, {"time": 7520, "text": "There's no discussion about short term political gains or any of that kind of stuff in the vision of going to the moon, or going to Mars, or taking on gigantic projects, or taking on world hunger, or taking on climate change, or the education system, all those things that require long term significant investment."}, {"time": 7542, "text": "That requires..."}, {"time": 7547, "text": "But it's hard to find those people."}, {"time": 7547, "text": "And incidentally, I think another problem, which is a downside of social media, is that of younger people I know, the number who would contemplate a political career has gone down because of the pressures on them and their family from social media."}, {"time": 7567, "text": "It's a hell of a job now."}, {"time": 7567, "text": "And so I think we are all losers because the quality of people who choose that path is really dropping."}, {"time": 7574, "text": "And as we see by the quality of those who are in these compositions."}, {"time": 7585, "text": "That said, I think the silver lining there is the quality of the competition actually is inspiring because it shows to you that there's a dire need of leaders, which I think would be inspiring to young people to step into the fold."}, {"time": 7599, "text": "I mean, great leaders are not afraid of a little bit of fire on social media."}, {"time": 7603, "text": "So if you have a 20 year old kid now, 25 year old kid is seeing how the world has responded to the pandemic, seeing the geopolitical division over the war in Ukraine, seeing the brewing war between the West and China."}, {"time": 7617, "text": "We need great leaders and there's a hunger for them and the time will come when they step up."}, {"time": 7631, "text": "But also to add to your list of four, he doesn't get enough credit."}, {"time": 7631, "text": "I've been defending him in this conversation, Elon Musk, in terms of the fight in climate change."}, {"time": 7636, "text": "But he also has led to a lot of division, but we need more David Edinburgh."}, {"time": 7647, "text": "I mean, I'm a fan."}, {"time": 7647, "text": "I mean, I've heard him described as a 21st century Brunel for his innovation and that's true."}, {"time": 7653, "text": "But whether he's an ethical inspiration, I don't know."}, {"time": 7661, "text": "Yeah, he has a lot of fun on Twitter."}, {"time": 7661, "text": "Well, let me ask you to put on your wise sage hat."}, {"time": 7670, "text": "What advice would you give to young people today?"}, {"time": 7670, "text": "Maybe they're teenagers in high school, maybe early college."}, {"time": 7676, "text": "What advice would you give to a career or have a life they can be proud of?"}, {"time": 7685, "text": "Well, I'd be very diffident, really, about offering any wisdom."}, {"time": 7685, "text": "But I think they should realise that the choices they make at that time are important."}, {"time": 7694, "text": "And from the experience I've had with many friends, many people don't realise that opportunities open until it's too late."}]}]