[{"title": "Cristiano Amon: Qualcomm CEO | Lex Fridman Podcast #280", "id": "KMgPxVnKLSk", "quotes": [{"time": 253, "text": "So there's road networks, there's all kinds of networks."}, {"time": 256, "text": "There's lights that keep popping up, cities springing up, like from an alien perspective, you're observing."}, {"time": 262, "text": "Well, what I'm gonna tell you is you have this contrast of incredible development of technology, but then you see some of the things that are happening right now, which is probably you would not expect them to happen on the 21st century, just what happened in Ukraine."}, {"time": 276, "text": "So I think that will be a more puzzling question for the aliens, I would imagine."}, {"time": 282, "text": "The new technology is kind of impressive."}, {"time": 284, "text": "Actually, that might not be so puzzling because that's just human nature revealing itself as it has throughout human history."}, {"time": 292, "text": "Let's talk about wireless communication."}, {"time": 294, "text": "So Qualcomm was instrumental in developing 5G."}, {"time": 298, "text": "Now you were with Qualcomm since the early days, the good old 90s with the 2G, but what is 5G, including sub six gigahertz 5G and millimeter wave 5G?"}, {"time": 310, "text": "And maybe the most important question is how will it change the world in the coming years?"}, {"time": 315, "text": "When we set ourselves to develop 5G, and we look at this, every generation of technology had a problem to be solved, right?"}, {"time": 324, "text": "So you mentioned 2G, 2G challenge, the challenge of CDMA was can we give every person on earth a cell phone?"}, {"time": 330, "text": "That was, can you get to a technology that you can basically allow everyone to have a mobile phone?"}, {"time": 337, "text": "3G was about the ability to connect that to the internet."}, {"time": 341, "text": "I think 4G was broadband and with 4G was about have the ability for you to have a computer in the palm of your hand."}, {"time": 348, "text": "We'll just talk about that."}, {"time": 349, "text": "5G, the challenge was a little bit different."}, {"time": 352, "text": "It's how do we build a technology for a society that is gonna be 100% connected to the cloud?"}, {"time": 357, "text": "How do we provide a technology that is going to be the last mile connectivity for everything?"}, {"time": 364, "text": "So 5G has basically been designed, eliminate all issues with data congestion, whether you are in stadium, we talk about soccer, you were in a stadium and everyone should be ability to have access to broadband."}, {"time": 379, "text": "So deal with congestion."}, {"time": 380, "text": "Deal with the fact that not only people, but billions of things need to be connected."}, {"time": 385, "text": "Create a technology that for the first time in wireless, you could deliver mission critical services."}, {"time": 392, "text": "Wireless used to up to 4G is its best effort."}, {"time": 397, "text": "In 5G, it can guarantee that you are connected with the cloud."}, {"time": 401, "text": "And then the last point of that is provide this fabric that will allow us as a society to look at things that are not connected and say, that's the exception."}, {"time": 413, "text": "That's why we made a comparison in the early days of 5G that that's gonna be like electricity."}, {"time": 418, "text": "Right now, you don't have a discussion about what is the use cases for electricity."}, {"time": 423, "text": "You don't talk about that anymore."}, {"time": 424, "text": "You just assume it's there."}, {"time": 425, "text": "And that's how we think about everything connected to the cloud."}, {"time": 429, "text": "That's what 5G is and that's the role of 5G."}, {"time": 433, "text": "So first of all, everything connected to the cloud is interesting because the space of everything is constantly increasing."}, {"time": 440, "text": "I don't think the refrigerator over there, it looks kind of smart, but I don't think it's connected yet to the cloud."}, {"time": 447, "text": "So this includes internet of things."}, {"time": 449, "text": "What is the full space of everything?"}, {"time": 451, "text": "The full space of everything is, it's maybe going back to where you start defining Qualcomm."}, {"time": 458, "text": "Qualcomm is about communications and advanced computers for low power devices."}, {"time": 463, "text": "And can we make everything smart?"}, {"time": 466, "text": "It can range from the robot you have right now on the floor to your refrigerator, to a camera, to machines in manufacturing, to retail, et cetera."}, {"time": 483, "text": "I can give you some examples."}, {"time": 485, "text": "When we think of something as simple as going to the grocery shop, we see technology now with something, the stuff we've been working with companies like Walmart."}, {"time": 497, "text": "Electronic shelf labels."}, {"time": 499, "text": "The ability for you to have smart cameras, they can look at shelves and the camera is smart enough to say some product needs to be replenished."}, {"time": 507, "text": "Ability to see what's trashed."}, {"time": 508, "text": "So it's about really providing processor connectivity, artificial intelligence to everything."}, {"time": 515, "text": "And I think that's one of the largest addressable markets we have for technology because you can't really define everything."}, {"time": 524, "text": "It's a nice market because it keeps growing potentially exponentially in speed."}, {"time": 529, "text": "What about coverage?"}, {"time": 531, "text": "So how are we doing on the everything part?"}, {"time": 533, "text": "So there is, like I mentioned, sub six gigahertz 5G and there's a millimeter wave 5G."}, {"time": 540, "text": "So not all 5G is made the same."}, {"time": 542, "text": "So there's a speed, there's a bandwidth thing."}, {"time": 545, "text": "And then there's coverage."}, {"time": 546, "text": "How many people get to enjoy today and how does the progress in the next five, 10, 20, 30, 50 years you think looks like in terms of coverage?"}, {"time": 555, "text": "Great topic of conversation."}, {"time": 559, "text": "When I meet with regulators across the globe, I tell them resistance is futile."}, {"time": 566, "text": "Allocate every spectrum to wireless."}, {"time": 569, "text": "Every spectrum needs to be allocated to wireless."}, {"time": 571, "text": "The reality is when we start moving from CDMA to OFDMA, we knew that this industry has done a lot to get more bits per Hertz."}, {"time": 584, "text": "But the reality is the massive amount of improvements that is required in capacity and in speed, you need more spectrum."}, {"time": 595, "text": "There's not so much we can rely on more bits per Hertz."}, {"time": 600, "text": "You just need more spectrum."}, {"time": 601, "text": "And if you look, for example, what carriers since the 2G era, they participate in different license and auctions and every spectrum they accumulated from 2G or 3G or 4G, all of that, you may be able to get one or two channels max of sub six, which is a channel is about 100 megahertz or 200 megahertz, and that's it."}, {"time": 626, "text": "So we need more spectrum."}, {"time": 628, "text": "So 5G has been designed to work across every spectrum from the low frequency bands, that's what we call the sub six, but you needed more, you needed to go to the millimeter wave."}, {"time": 640, "text": "So that's why 5G is a technology that you can deploy from 450 megahertz as an example, or 600 or 700, all the way to in the 42 gigahertz."}, {"time": 654, "text": "And that's where millimeter wave comes into the picture."}, {"time": 657, "text": "Now, let's now connect this to your question about coverage of 5G."}, {"time": 663, "text": "The easiest thing to do is to deploy 5G in the new spectrum you can get, which is in the sub six, you see bands being auctioned across the globe into 3.5 gigahertz."}, {"time": 677, "text": "There's nothing special about the band, it's just the only one that was available because everything else has been useful for 4G."}, {"time": 682, "text": "And you can deploy on that, go into existing cell towers and just put a new equipment without having to build new towers."}, {"time": 689, "text": "But when we go to technologies such as millimeter wave, then you have to build more dense networks."}, {"time": 695, "text": "You need to build more stations because a deployment in that case look like a wifi deployment, it's almost like wifi access points."}, {"time": 702, "text": "When you need to build more stations, you need permits, you need to build fiber, so it takes more time to densify."}, {"time": 710, "text": "So what you see happening is coverage has been built fast with sub six across the globe, but now the United States also have the sub six."}, {"time": 719, "text": "So that gets you to coverage very fast."}, {"time": 722, "text": "But millimeter wave, it's moving."}, {"time": 725, "text": "And if I will say, for example, Verizon, United States has had a leadership in building millimeter wave, it takes time."}, {"time": 733, "text": "I'll say cities like Chicago, Manhattan starting to get coverage."}, {"time": 738, "text": "It will be a process over a number of years as you build those different access points type networks, but it's inevitable."}, {"time": 748, "text": "There's not enough spectrum."}, {"time": 750, "text": "So every 5G operators just a matter of time will have millimeter wave as well."}, {"time": 755, "text": "Resistance is futile."}, {"time": 756, "text": "Okay, so for millimeter wave, we need density of access points."}, {"time": 762, "text": "And what's the biggest resistance for Qualcomm for human civilization?"}, {"time": 769, "text": "Is it politicians, regulators, federal regulators?"}, {"time": 774, "text": "Is it individual humans?"}, {"time": 777, "text": "Is it not enough money from the consumer perspective?"}, {"time": 780, "text": "Like who is the biggest pain in the butt?"}, {"time": 783, "text": "From a Qualcomm standpoint, but answering the question about what it takes to build all this technology."}, {"time": 789, "text": "I think regulators across the board understood the importance of 5G."}, {"time": 793, "text": "I have not met a regulator that said, it's really important to be late on 5G."}, {"time": 798, "text": "I don't think anybody wants to be late on 5G."}, {"time": 800, "text": "And as a result, we've seen enormous amount of progress in getting spectrum allocated to 5G."}, {"time": 806, "text": "I think the real issue is the time that it takes to build infrastructure."}, {"time": 811, "text": "You know, investment in 5G infrastructure, special millimeter wave is like building roads and ports."}, {"time": 817, "text": "It's critical infrastructure."}, {"time": 818, "text": "And those things take time."}, {"time": 820, "text": "Like one of the number one obstacle you're gonna hear from operators is site permit."}, {"time": 825, "text": "You know, sometimes they have to negotiate municipality by municipality about permits to get new cell sites."}, {"time": 831, "text": "But you know, the networks will be densified and you're gonna need all of that capacity for the promise of the fully immersive augmented reality that will replace phones and everything being connected 100% of the time."}, {"time": 845, "text": "This would not be a conversation with the CEO if I did not ask questions that make you nervous."}, {"time": 852, "text": "Some people raise concerns about there not being enough studies about the effects of 5G on the human body."}, {"time": 859, "text": "Is 5G safe?"}, {"time": 861, "text": "Look, I have a very simple answer to this question."}, {"time": 866, "text": "As we build new capabilities, such as 5G, power is going down, especially when you think about reducing the number of base stations, the network's becoming more dense."}, {"time": 880, "text": "So as you do that, the power becomes lower."}, {"time": 885, "text": "If your phone radiated from the phone and from the tower, as you get closer to the tower, you don't need that much power to reach the tower."}, {"time": 893, "text": "So as we move from 4G to 5G, I think we see a reduction in the amount of power is required to close the radio link."}, {"time": 902, "text": "Now, also you have a number of organizations, the FCC, for example, has rigorous programs, which they do a lot of tests to validate, you know, the safety of those devices."}, {"time": 916, "text": "And I think we have, has been a model for other countries to also to adopt the same things."}, {"time": 924, "text": "Cellular has been around for a number of decades now."}, {"time": 927, "text": "I think smartphone is our most beloved device today."}, {"time": 932, "text": "And I would argue how it's difficult to answer those questions, but I'll argue that the data to date have we seen in 3G and 4G, you know, has shown that a lot of the initial concerns were not valid."}, {"time": 955, "text": "We look at 5G, even though it's new, it's just less power."}, {"time": 958, "text": "So we look at it from a physics standpoint."}, {"time": 961, "text": "So from a physics, from a biology perspective, there's a lot of evidence, there's studies that show that it's not dangerous, that it is in fact safe."}, {"time": 973, "text": "However, the concern that people have is when you scale technology exponentially, how will that change human civilization?"}, {"time": 980, "text": "I mean, that doesn't apply to 5G, that applies to every technology."}, {"time": 983, "text": "How, you said smartphone is the most beloved device, but love sometimes hurts."}, {"time": 989, "text": "That's the impact on society we don't know."}, {"time": 993, "text": "And there's a little bit of fear, there's both excitement and fear."}, {"time": 996, "text": "It's a great topic of conversation actually."}, {"time": 999, "text": "So let me give you my perspective on this."}, {"time": 1001, "text": "And you started to see some things actually happening right now."}, {"time": 1003, "text": "So let me step back and let's talk about the fact that we are in a fully interconnected society."}, {"time": 1011, "text": "That when you look of the situation today, we talk about smartphones, largest development platform, so much now of our life, we are connected to the smartphone."}, {"time": 1028, "text": "And we are all connected and we're connected."}, {"time": 1031, "text": "And then we're building digital twins of everything, right?"}, {"time": 1035, "text": "So when you look at that picture, when you look at the picture of this connected society, you started to have the following thoughts, which I think are very healthy, which means in the same way that in the physical world, you're entitled to some rights, you have obligations, and there's a lot of things that protect your integrity."}, {"time": 1058, "text": "I think as a rule, we're gonna see the society evolving."}, {"time": 1063, "text": "So those things extend to your digital being of people and things."}, {"time": 1069, "text": "And I think it's just natural."}, {"time": 1070, "text": "It's just natural."}, {"time": 1072, "text": "It's just a natural path."}, {"time": 1074, "text": "And you started to see things like that."}, {"time": 1075, "text": "For example, the Europeans has done a lot in this area."}, {"time": 1080, "text": "I'll say the Europeans probably ahead in the United States thinking about privacy laws, digital privacy laws."}, {"time": 1086, "text": "Most recently, the DMA, the Digital Markets Act, which I think is a great thing."}, {"time": 1091, "text": "I think we believe there's incredible thought into enable ability to regulate the digital markets so that there's innovation and competitions and not a single company can control all the data and then decide how things are gonna be work on the digital realm."}, {"time": 1109, "text": "And even if we think about the potential things like the metaverse, as we're connecting physical and digital spaces."}, {"time": 1115, "text": "So I think it's a natural evolution."}, {"time": 1117, "text": "Of course, regulation and laws always follow technology."}, {"time": 1123, "text": "But the fact that we're moving to an interconnected society, there's no going back."}, {"time": 1129, "text": "We are a fully interconnected society."}, {"time": 1132, "text": "But there is opportunity to think about how the digital twin should, people and government should think about it so that we get the best of a technology without any downside."}, {"time": 1145, "text": "Yeah, so when you say digital twin, that's one of the other things you're excited about, which is the metaverse, or basically building worlds in the digital space."}, {"time": 1153, "text": "And you have to start to think about all the basic human rights that transfer from our physical meat vehicles out to the digital copies of ourselves, representations of ourselves."}, {"time": 1164, "text": "It's really important to think about."}, {"time": 1165, "text": "The thing you mentioned about regulators that has been, this is me speaking frustrating, is like you said, they follow technology."}, {"time": 1172, "text": "So sometimes they don't get the technology at all."}, {"time": 1176, "text": "So they're very clumsy in writing laws that censor that technology in interesting ways."}, {"time": 1183, "text": "They mean good, but they can do a lot of unintended damage."}, {"time": 1187, "text": "Now, both, it's a dance."}, {"time": 1189, "text": "It's a beautiful dance, but I just wish governments were better dance partners."}, {"time": 1194, "text": "I just see what they're kind of writing now about regulating social media and platforms like YouTube, and it's just really, really clumsy."}, {"time": 1202, "text": "They don't understand how machine learning works."}, {"time": 1204, "text": "I recommend their systems work."}, {"time": 1206, "text": "And I just wish they kind of caught up a little more because it's really important to be great at regulation, but also it's important to let companies flourish and embrace this new wave of technology."}, {"time": 1217, "text": "That weird dance, I am more and more learning looking at public policy, how much positive government can do and how much clumsy negative it can do, unintentionally, just out of sheer incompetence or lack of curiosity about tech."}, {"time": 1234, "text": "That's my rant about regulators."}, {"time": 1236, "text": "I think it's a valid point."}, {"time": 1239, "text": "As I said before, I think the Europeans probably have a very good framework, but the way I'll think about it, we depend on having the ability to innovate."}, {"time": 1250, "text": "We depend on the free markets."}, {"time": 1251, "text": "We depend on the ability to create technology that will be disruptive."}, {"time": 1259, "text": "But at the same time, I think the tech companies probably should spend time helping governments understand, helping understand ahead of time so that they can be better prepared."}, {"time": 1269, "text": "Let's talk about one of my favorite topics, Snapdragon."}, {"time": 1274, "text": "So Snapdragon is a system on a chip."}, {"time": 1277, "text": "This processor has probably powered billions of smartphones over its pretty long history now, a decade and a half maybe."}, {"time": 1286, "text": "So it's constantly iterating."}, {"time": 1287, "text": "There's constantly just like a turmoil of beautiful innovations happening."}, {"time": 1290, "text": "So last year it was Snapdragon 888 was the main one with the five nanometer, and this year it's Snapdragon 8Gen1."}, {"time": 1300, "text": "It's a new naming scheme."}, {"time": 1301, "text": "Okay, what's the sexiest, most beautiful idea or concept to you about Snapdragon?"}, {"time": 1307, "text": "Start there."}, {"time": 1307, "text": "The way I would describe it, and I think the reason we have been successful with it, is to really understand how to build a platform, a single chip, like a single chip, that will have every single capability if you wanna make this smartphone in the palm of your hand, something that has all of your computing needs."}, {"time": 1333, "text": "And it was the ability to get, from an engineering standpoint, ability to get into a single chip of not only all possible connectivity technology, from cellular to wifi to Bluetooth to every single constellation of satellites for position location."}, {"time": 1351, "text": "But at the same time, a very power efficient single thread and multi threaded CPU."}, {"time": 1359, "text": "A GPU for all of your graphic demands, gaming, fastest growing segment for gaming, is mobile gaming."}, {"time": 1370, "text": "An artificial intelligence processor, which we call the neuro processor unit."}, {"time": 1375, "text": "And then a video engine, and a multimedia engine for every single application, audio, everything."}, {"time": 1383, "text": "So it's a single chip that has every single computing technology you need in the phone."}, {"time": 1390, "text": "And what's exciting about it is what we already knew."}, {"time": 1394, "text": "For example, when you think about camera or computer vision, you see that the advancements in the technology now happens in the smartphone first versus additional camera."}, {"time": 1406, "text": "So the beauty about the Snapdragon is we always have this thing within Qualcomm."}, {"time": 1413, "text": "The phone, it's small."}, {"time": 1415, "text": "You have to be able to hold it."}, {"time": 1417, "text": "You're gonna touch your face so you cannot be hot."}, {"time": 1420, "text": "You have to manage thermals."}, {"time": 1423, "text": "You expect to have a full day of battery life."}, {"time": 1427, "text": "But then you want it to not be sending data into 10 or 100 megabits."}, {"time": 1433, "text": "You want gigabits."}, {"time": 1435, "text": "You want it to be able to have eight core processors."}, {"time": 1438, "text": "You want to have a GPU with ray tracing."}, {"time": 1441, "text": "You want to have all of the things that you can only get into sometimes a desktop PC."}, {"time": 1448, "text": "And to do all of that in your phone and be able to be in the leadership position generation after generation is an incredible thing."}, {"time": 1457, "text": "And we're very proud of that at Qualcomm."}, {"time": 1458, "text": "Yeah, so you have to do the WiFi, 5G, all of the... And you have to be good to everyone of those technologies."}, {"time": 1464, "text": "And pack it all in."}, {"time": 1466, "text": "And there's also pressure to make the thing faster and faster and faster."}, {"time": 1470, "text": "And then there's more and more applications you're supposed to be effortlessly using."}, {"time": 1474, "text": "And then you mentioned the NPU, GPU, CPU."}, {"time": 1477, "text": "They have to also dance together somehow."}, {"time": 1480, "text": "They have to communicate well, share memory or not, depending on what the application is."}, {"time": 1484, "text": "And your battery has to last all day."}, {"time": 1489, "text": "From a company like Qualcomm, we have to be good in each and every one of those technologies."}, {"time": 1493, "text": "We can't just say, oh, we're a CPU company or a GPU company or we're AI company."}, {"time": 1497, "text": "We have to do everything."}, {"time": 1499, "text": "What does it take to design a great processor?"}, {"time": 1502, "text": "So design this system on a chip that you mentioned."}, {"time": 1506, "text": "Is there some insight you can provide in this chaos of engineers, designers, leaders, the people that think about how much this is all gonna cost, the whole mess of it?"}, {"time": 1519, "text": "I'm, of course, very partial about it."}, {"time": 1521, "text": "I've been in this company for probably more than 26 years."}, {"time": 1525, "text": "But I will argue that there are a couple things that are ingredients for success."}, {"time": 1531, "text": "So we talk about the fact that they have all those different technologies."}, {"time": 1534, "text": "They evolve at their own pace."}, {"time": 1536, "text": "And you have to be good in each one of them."}, {"time": 1538, "text": "And you need to then to make them working together."}, {"time": 1541, "text": "So you need to have an engineering organization that's with an incredible collaboration culture because everybody has to be working."}, {"time": 1552, "text": "The train's gonna leave the station."}, {"time": 1554, "text": "Every cart needs to be there when it leaves the station."}, {"time": 1557, "text": "It needs to leave on time, especially in the phone business."}, {"time": 1560, "text": "You can't change Christmas."}, {"time": 1562, "text": "You cannot change Black Friday."}, {"time": 1564, "text": "You cannot change all of the selling seasons."}, {"time": 1566, "text": "So the phones are gonna launch on time."}, {"time": 1568, "text": "And every technology needs to be there."}, {"time": 1570, "text": "The engineer needs to work as one."}, {"time": 1572, "text": "And we do have that at Qualcomm."}, {"time": 1574, "text": "The other thing, you have to have incredible discipline because those are very complex systems."}, {"time": 1582, "text": "So in one way, you have to design with quality because in many cases, we're gonna be ramping production."}, {"time": 1592, "text": "And even before we have the silicon back and you have to rely on our simulation models and you have to rely on the fact that you design for commercial applications."}, {"time": 1605, "text": "That takes a while to build."}, {"time": 1608, "text": "And it's probably been the history of a semiconductor business at Qualcomm."}, {"time": 1614, "text": "So you mean like the framework of how many people can use simulation software and all that kind of stuff to build the thing with a hard deadline that you might not even get back from like manufacturer before."}, {"time": 1626, "text": "You're not allowed to have any mistakes."}, {"time": 1628, "text": "No wonder our name is quality communications."}, {"time": 1631, "text": "Oh, I never even thought about the qual part."}, {"time": 1633, "text": "Quality."}, {"time": 1634, "text": "So quality and there's a bar that's high and you're not allowed to mess up."}, {"time": 1639, "text": "I mean, to me as an engineer, that's exciting."}, {"time": 1641, "text": "Hard deadlines, no room for mistakes."}, {"time": 1646, "text": "Super stressful, but I love it."}, {"time": 1647, "text": "So there's a couple of other small companies called Google and Apple."}, {"time": 1656, "text": "So Google is now using its own chip for the Pixel 6."}, {"time": 1659, "text": "Apple using its own."}, {"time": 1661, "text": "How does Qualcomm out compete Google and Apple?"}, {"time": 1665, "text": "How does it beat them?"}, {"time": 1666, "text": "We don't have to out compete Google."}, {"time": 1668, "text": "Actually, if you look at our mobile strategy today, and then one thing I was very clear when I became CEO, I think there's a lot of confusion in the market."}, {"time": 1675, "text": "Our mobile strategy is very clear."}, {"time": 1678, "text": "We are focused of making Snapdragon synonymous with premium Android experience."}, {"time": 1684, "text": "That's what Snapdragon is."}, {"time": 1686, "text": "Android, the phone of the people."}, {"time": 1690, "text": "I just have a love for Android."}, {"time": 1692, "text": "I'm constantly talking trash to iPhone people."}, {"time": 1694, "text": "Premium Android experiences."}, {"time": 1696, "text": "So we do produce Snapdragon in multiple tier for every price point, but every year, you mentioned the HN1, and every year we'll provide the flagship product."}, {"time": 1709, "text": "And then the other series that is trying to get the best of every possible technology at that time."}, {"time": 1716, "text": "And it's really focused on enabling the Android ecosystem."}, {"time": 1721, "text": "So I'll give an example."}, {"time": 1722, "text": "So you asked me the question, how to compete with Google."}, {"time": 1725, "text": "It's not about competing with Google."}, {"time": 1726, "text": "We're the number one enabler of the Google Android ecosystem."}, {"time": 1731, "text": "And the largest, the number one customer there is actually Samsung."}, {"time": 1738, "text": "And if you look what happened to Samsung, Samsung, I always said, since I began my relationship with them, that cause they always had their own chip."}, {"time": 1750, "text": "They always had their own chip."}, {"time": 1752, "text": "And if you'll just look at what happened right now with the Galaxy S22 that just launched, they used to balance their business about 50% Qualcomm."}, {"time": 1761, "text": "They will get the most advanced markets like the United States and China and Japan and Korea, they will assign to Qualcomm."}, {"time": 1768, "text": "And then they'll have their own chip for the markets that they would be like more emerging markets, open markets, markets that they have a control on the channel because they sell a lot of appliances and other things."}, {"time": 1779, "text": "If you look what happened right now, GS22, 75% is Qualcomm."}, {"time": 1786, "text": "And then the next large OEMs and Android ecosystem are the Chinese ones."}, {"time": 1792, "text": "Companies like Xiaomi, one of the fastest growing."}, {"time": 1796, "text": "It was number one in Europe at some point last year, then followed by Oppo and OnePlus and Vivo."}, {"time": 1803, "text": "So those are some of the largest Qualcomm customers."}, {"time": 1806, "text": "And they actually drive the Android ecosystem."}, {"time": 1812, "text": "And that's our mobile strategy and fully aligned with Google and it's working."}, {"time": 1818, "text": "And not to get into a lot of the investor conversation, but we're also happy we became a beneficiary of the shifts that we saw in the marketplace."}, {"time": 1831, "text": "As Huawei became a smaller OEM as a result of the sanctions, we saw the rise of a lot of the other OEMs from China, especially for China domestic market, Xiaomi, Oppo, Vivo."}, {"time": 1846, "text": "They moved to the premium category and they're all doing that with Qualcomm."}, {"time": 1849, "text": "So we're actually very fortunate and happy with the position we are in mobile business."}, {"time": 1855, "text": "We do have an Apple relationship."}, {"time": 1857, "text": "We provide modem technology to Apple."}, {"time": 1862, "text": "It's a multi year relationship."}, {"time": 1863, "text": "Apple has been very public that they are investing to develop their own modem."}, {"time": 1869, "text": "But the Qualcomm strategy has been clear."}, {"time": 1872, "text": "We're really focused on Snapdragon."}, {"time": 1876, "text": "Our mobile strategy is not defined by providing a cellular modem to Apple."}, {"time": 1880, "text": "Our mobile strategy is this that we just talked about it."}, {"time": 1883, "text": "It's about the unique thing of Snapdragon that has every single technology integrated into a single SOC."}, {"time": 1889, "text": "And provides a premium experience."}, {"time": 1892, "text": "And that's what we're doing and focusing on the Android ecosystem."}, {"time": 1897, "text": "I don't know if I can ask you this kind of question."}, {"time": 1899, "text": "It's like picking your children or something like this."}, {"time": 1902, "text": "But what smartphone with a Snapdragon?"}, {"time": 1905, "text": "You mentioned Samsung Galaxy S22, OnePlus."}, {"time": 1909, "text": "Those are phones I personally really enjoy."}, {"time": 1912, "text": "What phone do you currently use?"}, {"time": 1914, "text": "Or do you have multiple phones?"}, {"time": 1915, "text": "I do have multiple phones but I do use Galaxy S22."}, {"time": 1919, "text": "That's your favorite one?"}, {"time": 1921, "text": "All right, well you heard it here first folks."}, {"time": 1923, "text": "Okay, so excellent."}, {"time": 1924, "text": "Can Qualcomm also, let's take a brief step away from mobile."}, {"time": 1929, "text": "And take on Intel and Apple and other such companies in the laptop and desktop space."}, {"time": 1935, "text": "So the nature of what a computer is seems to be changing."}, {"time": 1938, "text": "It's like smartphones like merging."}, {"time": 1941, "text": "It's all being a smartphone just with the biggest screen or something like this."}, {"time": 1944, "text": "So what does the future of that look like?"}, {"time": 1946, "text": "Before I answer that question, let me just step back a little bit."}, {"time": 1950, "text": "Because, and I'm sure we can talk more about those things."}, {"time": 1953, "text": "But the reality is Qualcomm is changing a lot."}, {"time": 1957, "text": "And we use, I know we spend a lot of time talking about 5G and smartphone and Snapdragon."}, {"time": 1962, "text": "And I think that has been what had defined Qualcomm for many years."}, {"time": 1966, "text": "But the reality is, even consistent with that 5G conversation, which is a technology to connect everything, Qualcomm is also changing."}, {"time": 1976, "text": "Our technology that was in many cases designed for phones."}, {"time": 1980, "text": "And we said at the beginning, connectivity and processing."}, {"time": 1985, "text": "It's going to virtually every industry."}, {"time": 1987, "text": "And as a result, Qualcomm is really changing with it and expanding to a number of different addressable markets."}, {"time": 1995, "text": "Some of those markets is the PC, as you talk about it."}, {"time": 2001, "text": "The conversions of mobile and PC."}, {"time": 2004, "text": "And the reason I'm excited about this, because you see a lot of things happening that bring this right front and center when you think about the future technology."}, {"time": 2013, "text": "So what we learn with the pandemic is that the number one use case of personal computers is communications."}, {"time": 2025, "text": "It is interesting when you think about that."}, {"time": 2026, "text": "That's the number one use case on a PC today is communications."}, {"time": 2030, "text": "It's actually funny because in the cellular industry, actually I'll say, let me step back."}, {"time": 2035, "text": "In the telecom industry, we've been chasing this killer application of video telephony for decades."}, {"time": 2043, "text": "I remember back then in the wire line, even before the internet and IP, ISDN, you remember those AT&T desk phones with a little screen and they said, you can do video telephony."}, {"time": 2057, "text": "We don't watch that in Back to the Future 2."}, {"time": 2061, "text": "Then when we started developing 3G, people said, what's the application for having data to a cell phone?"}, {"time": 2066, "text": "All video telephony."}, {"time": 2067, "text": "Then we started doing 4G."}, {"time": 2070, "text": "And in the beginning, people said, well, why do you need all of this broadband?"}, {"time": 2075, "text": "But it took a pandemic to make video telephony the killer application."}, {"time": 2080, "text": "And that's now the number one use case on a PC."}, {"time": 2084, "text": "So now think about that for a second."}, {"time": 2087, "text": "Personal computers now, they're technologies that people when they were gonna buy a PC, they didn't care much about it."}, {"time": 2091, "text": "Now they do, camera."}, {"time": 2093, "text": "Camera, how good is the camera?"}, {"time": 2095, "text": "The audio, is that connected?"}, {"time": 2097, "text": "How good is the connectivity?"}, {"time": 2098, "text": "Do you have the latest and greatest wifi and cellular?"}, {"time": 2101, "text": "What's the battery life?"}, {"time": 2103, "text": "Because you're gonna be working from anywhere."}, {"time": 2104, "text": "Sometimes you know that, sometimes you're not."}, {"time": 2107, "text": "So all those things, what's the portability like?"}, {"time": 2109, "text": "So those things started to change how we should think about the PC."}, {"time": 2113, "text": "But I won't stop there."}, {"time": 2115, "text": "Let me talk about another trend."}, {"time": 2117, "text": "So, and all come as a result of what we saw the pandemic."}, {"time": 2121, "text": "Let's say that you are, you're an engineer, you do computer aided design."}, {"time": 2125, "text": "You have an advanced desktop computer or workstation in your office."}, {"time": 2133, "text": "But you wanna work from home someday."}, {"time": 2135, "text": "So you're not gonna move that to your home."}, {"time": 2138, "text": "You're gonna have to rely on that."}, {"time": 2140, "text": "You're gonna run that on the cloud."}, {"time": 2141, "text": "And you're gonna run it on the cloud."}, {"time": 2143, "text": "You need high bandwidth because you almost wanted the cloud to be the same as your computer for that use case."}, {"time": 2150, "text": "That's the 5G on demand computing use case."}, {"time": 2153, "text": "The use 5G is almost a link between two computers."}, {"time": 2157, "text": "But then, you know, CIOs are saying, well, my workforce is going home for certain days."}, {"time": 2162, "text": "I want all the data to be in the cloud."}, {"time": 2164, "text": "You look at, for example, Microsoft OneDrive or the ability to collaborate, you need the bandwidth."}, {"time": 2170, "text": "So when you put all of those things together, you start thinking about what is the next generation PC?"}, {"time": 2177, "text": "And that's the opportunity for Qualcomm."}, {"time": 2179, "text": "I'll just give an example."}, {"time": 2181, "text": "Back in Mobile World Congress recently, Lenovo, they have a line of enterprise laptops called the ThinkPad."}, {"time": 2192, "text": "I'm sure you're familiar with it."}, {"time": 2194, "text": "So they announced the ThinkPad based on Snapdragon."}, {"time": 2198, "text": "With 5G on, 28 hours of battery life."}, {"time": 2202, "text": "So that's next generation."}, {"time": 2205, "text": "It's just a nice screen with extremely high, nice screen and keyboard, and extremely high connectivity to maybe an even more, like a more powerful machine in the cloud."}, {"time": 2215, "text": "Something more, the data, connecting to the data, connecting to compute, all that kind of stuff."}, {"time": 2219, "text": "You have the camera capabilities, and let me go one step more."}, {"time": 2223, "text": "Microsoft talking about some of the other features they're doing now using, on Windows 11, using Snapdragon."}, {"time": 2230, "text": "Remember, we talk about it, Snapdragon has an AI processor inside there."}, {"time": 2235, "text": "So one of the cool features Microsoft's talking about it is you can be on a Teams call, and you can make sure your eyes are looking at the camera 100% of the time."}, {"time": 2245, "text": "Well, that's an interesting, so they can be talking about that."}, {"time": 2248, "text": "And you do that with AI."}, {"time": 2249, "text": "Yes, that's really tricky to pull off."}, {"time": 2252, "text": "For example, the reason I'm a huge stickler for doing these in person, these conversations in person, it's really tough to get right."}, {"time": 2258, "text": "But it's a worthy challenge."}, {"time": 2259, "text": "So that's where the metaverse hopes to, so like, I just, because you said the importance of this telephony of humans connecting, teleporting themselves, getting that right is really difficult."}, {"time": 2269, "text": "There's a lot of people hate Zoom meetings, but that doesn't mean you can't improve that experience and get rid of the hate."}, {"time": 2277, "text": "A lot of people hate talking to their car too, because the voice, the natural language processing is terrible, but when it's not, it's a beautiful thing."}, {"time": 2284, "text": "So getting that right is."}, {"time": 2286, "text": "This is an opportunity, this is an opportunity."}, {"time": 2288, "text": "Think about it, it starts with the PC, making the PC giving you a better experience for teams, but then it goes right back into this trend of connecting physical and digital spaces."}, {"time": 2300, "text": "And all the work we're doing with the metaverse and virtual reality and metareality in the future is why not call somebody or connect with somebody with a hologram, it's possible."}, {"time": 2310, "text": "And also to mention some increasing amount of intelligence in our cars."}, {"time": 2316, "text": "So semi autonomous, autonomous cars, and the interactivity between human and car, which for me, things are really exciting."}, {"time": 2324, "text": "Let me ask you a big question."}, {"time": 2326, "text": "So when aliens again now on the other side, right, and humans destroy themselves through nuclear war centuries from now."}, {"time": 2334, "text": "But in case, you know, let's just hypothetical thought experiment."}, {"time": 2337, "text": "And they write a history of humanity in the 21st century."}, {"time": 2341, "text": "What would they remember Qualcomm in the 21st century as a company?"}, {"time": 2346, "text": "Would it be a car company?"}, {"time": 2348, "text": "Like think of all the crazy pivots that might happen in the next like 50 years."}, {"time": 2353, "text": "Because you're thinking, you said Qualcomm enables all of these things with 5G and there'll be probably other Gs, it keeps increasing."}, {"time": 2360, "text": "So basically connectivity and computation and everything becomes connected and everything is capable of computation."}, {"time": 2367, "text": "Might you become a robotics and car company?"}, {"time": 2370, "text": "I will argue we're already an automotive company today."}, {"time": 2376, "text": "But let me tell you what I would like Qualcomm to be, remember and recognize for."}, {"time": 2383, "text": "I think everyone that knows Qualcomm immediately, you know, connect us, pun intended, to connectivity and wireless."}, {"time": 2392, "text": "But the reality is we're being actually the company providing intelligence and processing to everything on the edge, everything outside the data center that we're doing."}, {"time": 2402, "text": "Those billions of devices that are gonna be connected."}, {"time": 2405, "text": "And that's kind of explained when we talk about the connected intelligent edge, the beyond phones, cars, species, and all of those."}, {"time": 2413, "text": "And the broader IOTs, we talk about everything will be connected and intelligent."}, {"time": 2418, "text": "And that's what we want Qualcomm to be recognized for."}, {"time": 2420, "text": "So by the way, for people who are not familiar, there's some technical jargon."}, {"time": 2425, "text": "People use the word edge, like edge computing."}, {"time": 2428, "text": "It's, by the way, that's probably changing what that even means."}, {"time": 2431, "text": "But it's basically everything that's not a giant thing that's making a lot of noise in a building somewhere."}, {"time": 2436, "text": "So it's mobile devices and the mobile devices of all kinds, well, a refrigerator's not mobile, but it would be edge."}, {"time": 2443, "text": "So it's like what's a sandwich, that kind of discussion."}, {"time": 2448, "text": "But basically edge computing is the edge of that expanding space that you mentioned that Qualcomm is trying to connect and enable with computation."}, {"time": 2460, "text": "Here's a simple way to describe what the edge is and edge computing is."}, {"time": 2465, "text": "I think as we think about the evolution of the data center, you need to bring the computational closer to where the device is."}, {"time": 2474, "text": "Also, when you put the computation together with the connectivity at the same time, you're gonna see a lot of advancement of artificial intelligence happening closer or at the device."}, {"time": 2486, "text": "Look, it's a very, I have a simple way to describe it."}, {"time": 2489, "text": "Remember in the beginning of this conversation, we talk about in the 4G era, broadband and mobile computing evolved side by side."}, {"time": 2498, "text": "If you're gonna have broadband, you might as well have a computer in the palm of your hand."}, {"time": 2501, "text": "So we needed to invest in those two technologies."}, {"time": 2505, "text": "In 5G, AI develops side by side."}, {"time": 2509, "text": "You're connected to the cloud 100% of the time."}, {"time": 2512, "text": "You have a high bandwidth and you have now a smart and intelligent thing that can make decision in real time, provide context information to the cloud to make the models more accurate and as well compare and contrast to the cloud."}, {"time": 2525, "text": "So there's gonna be an exponential development of AI happening with all the edge devices, the devices that are outside the data center and computation is gonna go alongside that."}, {"time": 2536, "text": "And a great example of that is the car."}, {"time": 2539, "text": "The car, we haven't talked much about the car, but Qualcomm is now, you could argue was as much as an automotive company as wireless company, working 26 global brands."}, {"time": 2552, "text": "And it's easy to see, if you look at our mobile heritage and we talk about form factors, thermal, battery life, you're not gonna put a server in a trunk of a car, but you need as much computational capabilities."}, {"time": 2566, "text": "And that's we see Qualcomm providing, as the car become a connected computer on wheels, we provide the computational and all the sensors for you to do assisted driving for the new digital cockpit experience connecting the car to the cloud and it's all of that's happening at the edge."}, {"time": 2583, "text": "Does Qualcomm want to be the brain of a lot of autonomous vehicles in the future of different, you said brands, like Mercedes, BMW, I don't know, whatever, just whatever car."}, {"time": 2593, "text": "Cars have the sexy thing they do and then it defines their brand and so on."}, {"time": 2598, "text": "And then there's the brain that doesn't need to have branding supposedly."}, {"time": 2602, "text": "So does Qualcomm see that or will I be able to buy a Qualcomm car?"}, {"time": 2606, "text": "Like literally it'll be Qualcomm."}, {"time": 2607, "text": "No, you're not gonna be able to buy a Qualcomm car, but we are ready on our way to become the brains of the car."}, {"time": 2615, "text": "The way you should think about Qualcomm automotive strategy is the car companies realize they need to become technology companies."}, {"time": 2624, "text": "You just look, for example, of the market cap of some of the new electrical commerce and compare them with the legacy car companies."}, {"time": 2636, "text": "I heard of, one of them lives in Austin."}, {"time": 2640, "text": "Let's say Rivian, right?"}, {"time": 2642, "text": "Rivian."}, {"time": 2643, "text": "Oh, that one too, yes."}, {"time": 2643, "text": "You know, the car companies are not going away."}, {"time": 2645, "text": "It's actually a mistake not to bet in the car companies."}, {"time": 2649, "text": "The car companies need a technology partner."}, {"time": 2652, "text": "They will provide the digital chassis for them."}, {"time": 2658, "text": "So if you look at Qualcomm, we talk about a Snapdragon digital chassis."}, {"time": 2662, "text": "So we want to be the preferred technology partner of the car companies, and I think it's working."}, {"time": 2670, "text": "Strategy is working right now."}, {"time": 2672, "text": "So basically helping the car companies accelerate into becoming technology companies."}, {"time": 2677, "text": "Connecting the car to the cloud, redesign the interior of the digital cockpit experience, and provide the computation and sensor capabilities for autonomy and assisted driving."}, {"time": 2688, "text": "On the topic of robots, when millions or billions of robots roam the earth in the future among us humans, and I am for one concerned in a small percentage, but largely I'm excited about that future, will Qualcomm be the thing that powers their brain?"}, {"time": 2708, "text": "We have in our IoT business, which has been one of the fastest growing business for us, a number of robotics engagement."}, {"time": 2716, "text": "So I'll give you some example."}, {"time": 2718, "text": "If you look of the Amazon Astro, you familiar with that?"}, {"time": 2724, "text": "There's two Snapdragon in there."}, {"time": 2728, "text": "There is?"}, {"time": 2729, "text": "This is really exciting."}, {"time": 2730, "text": "They're supposed to ship it to me."}, {"time": 2732, "text": "Okay, but anyway, that's really cool."}, {"time": 2733, "text": "I didn't know it was Snapdragon."}, {"time": 2735, "text": "Yeah, we're working with robotics in industrial."}, {"time": 2739, "text": "Of course, drones."}, {"time": 2741, "text": "We're getting more and more traction for robotics."}, {"time": 2745, "text": "Industrial robotics, too, you said?"}, {"time": 2747, "text": "Industrial, especially when you think about what's gonna happen with the factory of the future, the industrial side of the future, the warehouse of the future, when you bring 5G, for example, to it, and you have a number of different use cases, and then you see a lot of robotics application."}, {"time": 2769, "text": "And of course, drones."}, {"time": 2771, "text": "And the most famous, I will consider that a robot, the most famous robot in the world right now, it's powered by Snapdragon, which is the Mars Ingenuity helicopter."}, {"time": 2784, "text": "The whole helicopter, the cameras and everything, it's powered by Snapdragon."}, {"time": 2788, "text": "And talking about exciting thing for an engineer, the same Snapdragon that goes to a phone, and it can go to a Galaxy phone, for example, Samsung, the same, not a special one, went all the way to Mars."}, {"time": 2802, "text": "Is exploring other planets, looking for alien life, and maybe gets to meet them."}, {"time": 2806, "text": "Wouldn't that be interesting, if a Snapdragon is the thing that first sees an alien?"}, {"time": 2809, "text": "It's like, what the hell?"}, {"time": 2810, "text": "We did not program this in the computer vision."}, {"time": 2812, "text": "I once used the example to go back to the conversation we had about quality."}, {"time": 2817, "text": "As an engineer, you need to make sure it works."}, {"time": 2819, "text": "Can you imagine if it gets over there on Mars and it doesn't work?"}, {"time": 2822, "text": "Listen, this is very stressful."}, {"time": 2824, "text": "What NASA, what SpaceX, what all those companies are doing is extremely stressful."}, {"time": 2828, "text": "The room for mistakes is tiny."}, {"time": 2830, "text": "But that's super exciting for an engineer, once again."}, {"time": 2834, "text": "There's been a global semiconductor chip shortage."}, {"time": 2837, "text": "So from your perspective, just it'd be interesting to get your expert analysis of the situation."}, {"time": 2843, "text": "What do you think are the main reasons and how has Qualcomm been affected and how can it help?"}, {"time": 2848, "text": "In this, in the future, things like it."}, {"time": 2851, "text": "Okay, that's a big topic of conversation."}, {"time": 2856, "text": "And we only have five minutes."}, {"time": 2858, "text": "So I'll try to be as objective as I can."}, {"time": 2861, "text": "So first, let's talk about what caused it."}, {"time": 2863, "text": "And you hear a lot of different things."}, {"time": 2866, "text": "I will try to put it within the right context."}, {"time": 2868, "text": "The first thing that caused it, really, is the acceleration of digital transformation of pretty much everything in every industry."}, {"time": 2879, "text": "Every industry has been digitally transformed."}, {"time": 2881, "text": "And as such, the amount of semiconductors that are required is much larger."}, {"time": 2887, "text": "Just to give you a practical example, if you think about the automotive as an example, the cars that are, there's cars that are launched, a new model launching today."}, {"time": 2897, "text": "The new model launching today most likely has 10X the amount of chips of the prior model."}, {"time": 2903, "text": "And the model that people are working on that's coming in next, probably 10X that one."}, {"time": 2908, "text": "So you see the amount of silicon and then billions of things become smart."}, {"time": 2912, "text": "More and more data goes to the cloud."}, {"time": 2914, "text": "The data center grows."}, {"time": 2915, "text": "So the floor for semiconductor consumptions went up by a lot."}, {"time": 2920, "text": "Then you have things that aggravated this."}, {"time": 2923, "text": "The pandemic aggravated this."}, {"time": 2925, "text": "There is a couple of trends from the pandemic."}, {"time": 2927, "text": "The enterprise transformation of the home."}, {"time": 2930, "text": "The home became an enterprise."}, {"time": 2931, "text": "Massive amounts of upgrades on broadband and IoT."}, {"time": 2937, "text": "The office has changed to the way we work now, including the ability to support collaboration tools and video."}, {"time": 2946, "text": "Then you have the higher demand for products during the pandemic because people wanted to be connected."}, {"time": 2957, "text": "People bought new phones and new tablets and new computers, new gaming."}, {"time": 2962, "text": "So all of those things came on top of that as the aggravated issue, but they're not the main issue."}, {"time": 2968, "text": "The main issue is it's actually a long term growth of digital."}, {"time": 2975, "text": "So what I'm hearing you say is the pandemic was not the cause, it was an aggravation."}, {"time": 2980, "text": "It was an aggravation."}, {"time": 2981, "text": "So is there a way we can support as a human civilization in terms of manufacture, in terms of supply, the kind of growth that you're talking about in devices and so on?"}, {"time": 2995, "text": "Is there high level ideas you can say of what that's required there?"}, {"time": 2999, "text": "Yes, and I think that's the second part of the answer."}, {"time": 3002, "text": "So what's happening now?"}, {"time": 3003, "text": "How are we gonna get out of this?"}, {"time": 3005, "text": "So we see a lot of capacity investments put into place by the industry."}, {"time": 3012, "text": "We had invested a lot with our suppliers."}, {"time": 3015, "text": "A lot of the suppliers had made plans about increasing the capacity."}, {"time": 3022, "text": "The industry is planning to double its total semiconductor manufacturing capacity within the next five years, an example."}, {"time": 3030, "text": "So that's already happening."}, {"time": 3031, "text": "And then you see things which are actually good."}, {"time": 3035, "text": "The initiative such as the United States CHIPS Act and now the European CHIPS Act."}, {"time": 3040, "text": "The United States CHIPS Act's about $52 billion."}, {"time": 3043, "text": "The European's about 43."}, {"time": 3045, "text": "Their goal combined is to get at least 50% of the consumption with manufacturing installed within the US and European geographies."}, {"time": 3057, "text": "And that's also very good."}, {"time": 3058, "text": "That's yet another incentive for more manufacturing capacity to be built and to be built with a geographic distributed way, which that's how you plan supply chain."}, {"time": 3069, "text": "So those I think are good things."}, {"time": 3072, "text": "So if anything we learn through the crisis is that semiconductor is important."}, {"time": 3079, "text": "Semiconductor companies are important and we need to invest in semiconductors."}, {"time": 3083, "text": "We're turning to the grilling of the CEO with the hard questions."}, {"time": 3088, "text": "This is almost from my own education of the space."}, {"time": 3090, "text": "You mentioned regulators."}, {"time": 3092, "text": "Qualcomm paid out and received payment of billions of dollars in settlement and fines."}, {"time": 3098, "text": "There seems to be a lot of huge lawsuits in this space."}, {"time": 3102, "text": "Does this get in the way of innovation or does it promote it?"}, {"time": 3106, "text": "I will rephrase it by saying there used to be a lot of lawsuits in this space."}, {"time": 3111, "text": "In addition of what we do in semiconductors, our processors and our modems, the Snapdragon platform, we also have a licensing business, which has been a part of the company since the beginning."}, {"time": 3128, "text": "As the largest inventors of the essential technology in 2G, CDMA, 3G, 4G and 5G, and Qualcomm contribute that to the standards."}, {"time": 3141, "text": "So we always had this model that rather than invent the technology and be the only one producing the products, we license so everyone can produce it."}, {"time": 3151, "text": "And as such, we receive intellectual property for the standard essential patents."}, {"time": 3160, "text": "As part of our past dispute with Apple, that's behind us now."}, {"time": 3166, "text": "Your friends now."}, {"time": 3167, "text": "They're my customers."}, {"time": 3169, "text": "And as part of that, I think the licensing model got tested, I think, in every geography."}, {"time": 3178, "text": "And we succeeded in every single geography to validate the pro competitiveness of this model."}, {"time": 3186, "text": "I think the fair, reasonable, non discriminatory aspect of this model."}, {"time": 3192, "text": "And I would argue that besides being the most successful licensing business to date in the industry, probably the one that's been battle tested and is most stable because there's not a single jurisdiction that we have not had to validate that model."}, {"time": 3209, "text": "So it's part of our past and what it creates is probably create a lot of stability in our licensing business."}, {"time": 3215, "text": "But having said that, the growth of the company is in the semiconductor space."}, {"time": 3220, "text": "And the semiconductor, so licensing is, you come up with a pretty good idea, you have a bunch of smart people coming up with cool ideas, and then once you come up with that idea, you sell that idea to others, they get to use it."}, {"time": 3232, "text": "That's essentially what a license."}, {"time": 3233, "text": "The license revenue we have is for the, what we call the SCP, standard essential patents, that are part of the 2G, 3G, 4G, and 5G standards."}, {"time": 3247, "text": "So if you want to build anything with 5G, you need to get a license from Qualcomm because it uses Qualcomm essential technology as part of the standard."}, {"time": 3257, "text": "And a slightly different model, or a lot different model with the semiconductor is you design, you inject a bunch of fascinating ideas, how to build the Snapdragon, and then there's, because it's a fabulous company, you have somebody build the chip and then goes into a phone with the branding and all that kind of stuff."}, {"time": 3276, "text": "And that has less kind of players involved, it's not a license."}, {"time": 3280, "text": "We sell the product."}, {"time": 3282, "text": "We don't license semiconductor technology, we build products and we sell products."}, {"time": 3289, "text": "This is your first year as a CEO."}, {"time": 3291, "text": "Not one year yet."}, {"time": 3296, "text": "Let's hope it'll be in June, it'll be one year."}, {"time": 3300, "text": "This is a company that's involved with a lot of fascinating technologies and it's touching the lives of billions of people."}, {"time": 3309, "text": "A lot of complicated stuff."}, {"time": 3311, "text": "Like I said, licensing technologies."}, {"time": 3313, "text": "You have to collaborate with manufacturers."}, {"time": 3317, "text": "You have to then work with, however many you said, car companies and all these clients and so on."}, {"time": 3323, "text": "And you have to, with tech companies, Apple and so on."}, {"time": 3330, "text": "What lessons have you learned about leadership and maybe about yourself as a human being from this first, almost a year, soon to be a year as a CEO of this incredible, this complex, this large company?"}, {"time": 3343, "text": "That's a loaded question."}, {"time": 3344, "text": "Let me answer in reverse order."}, {"time": 3347, "text": "First thing that I learned, and I think it's probably common across CEOs, especially in our industry, is it will be great if I had more time."}, {"time": 3359, "text": "I think there's, especially because we grow in so many areas and there's so many things to learn, so many relationships to build, time to spend with a number of different technologies."}, {"time": 3371, "text": "But it kind of reflects really the size of the opportunity that exists for Qualcomm."}, {"time": 3376, "text": "Qualcomm, it is really growing in a number of different directions all at the same time."}, {"time": 3382, "text": "And so it did got busier."}, {"time": 3385, "text": "And part of this is because I'm spending a lot of time understanding the new industries we're going in and building relationships."}, {"time": 3395, "text": "Second thing, which is a lot to do with how I think about things and a little bit of my personality."}, {"time": 3401, "text": "At the end of the day, business partnerships are really done by people."}, {"time": 3406, "text": "And I think the importance of having trusted relationships for the long term is extremely important."}, {"time": 3414, "text": "And I've been dedicated to do that as CEO."}, {"time": 3417, "text": "We're not a company that plays for the short term."}, {"time": 3421, "text": "And when we build new partnerships, we expect that to be for decades."}, {"time": 3425, "text": "And so I spend time doing that and think that's important for Qualcomm."}, {"time": 3431, "text": "The other part of your question is, we do have a lot of opportunities in all different areas."}, {"time": 3438, "text": "What we like, and I've been fortunate enough to become CEO at a time, that a lot of the trends are pointing to our technology."}, {"time": 3447, "text": "We talk about some of them."}, {"time": 3448, "text": "We talk about merger of physical and digital spaces."}, {"time": 3451, "text": "We talk about the transformation of the automobile."}, {"time": 3453, "text": "We talk about the merge of computing and mobile, the enterprise transformation of the home."}, {"time": 3460, "text": "There are many of those trends."}, {"time": 3462, "text": "And those trends create opportunities for Qualcomm to be providing technology first."}, {"time": 3470, "text": "And as such, we're in a hurry."}, {"time": 3473, "text": "So I'm in a little bit of a hurry because I think the opportunity is incredible for technology, but having fun and enjoying the job."}, {"time": 3482, "text": "Is there a burden because of so much of what you said is partnerships and almost like friendships, connections with other human beings?"}, {"time": 3492, "text": "Me as an introvert that has a lot of social anxiety, that seems extremely stressful."}, {"time": 3497, "text": "So is there that burden on your shoulders?"}, {"time": 3499, "text": "You have to wake up every day and talk to friends you've had for many years."}, {"time": 3505, "text": "It can be, and then convince them and make partnerships with them, talk with them, describe to them the future, sell them an idea, and then yourself grow because you don't know what the heck the future is gonna be like."}, {"time": 3518, "text": "And you have to project both confidence and humility, all those kinds of things."}, {"time": 3522, "text": "Is that exhausting?"}, {"time": 3525, "text": "It is exhausting, but it's something I do like to do."}, {"time": 3528, "text": "And it's not only with partners, really."}, {"time": 3530, "text": "It's also internally to your employees, I think, to get alignment on the vision and faith in the vision and execute."}, {"time": 3537, "text": "And at the end of the day, we're very fortunate."}, {"time": 3539, "text": "We have a lot of smart people."}, {"time": 3540, "text": "So people, if they're aligned with the vision, they know what to do."}, {"time": 3543, "text": "And then, of course, as CEO, you have to convince your investors that that's the right idea as well."}, {"time": 3549, "text": "If you can put on your wise sage hat, do you have a device for young people in high school and college?"}, {"time": 3558, "text": "You yourself started from the humble beginnings in Brazil, maybe a bit of a wild, risky decision to go to Japan, and now are the head of one of the biggest, most successful, most impactful companies in the world."}, {"time": 3574, "text": "Given that story, can you give advice to young people today that they can have a career or just a life they can be proud of?"}, {"time": 3583, "text": "I think the first thing, and of course, all of those answers are gonna relate to my own experience, right?"}, {"time": 3592, "text": "The first thing is it always worked for me to have a plan, even if the plan is just what I'm gonna do in the next two years, but what do I want to do?"}, {"time": 3604, "text": "Where do I wanna go?"}, {"time": 3605, "text": "And I think it's important for people, especially young people, is to really have a dream and go pursue it."}, {"time": 3615, "text": "I mean, have a dream does not go back to bed to sleep."}, {"time": 3617, "text": "It's really what do you want to accomplish and then what it's gonna take to do that."}, {"time": 3622, "text": "And then believe in yourself."}, {"time": 3624, "text": "Like I said, I joined Qualcomm as an engineer and I didn't have any plans when I joined to be CEO, but I do want, as an engineer, what I wanted to do, where I wanna contribute, what I wanted to work on, and then keep evolving from that point in time."}, {"time": 3643, "text": "The other thing is, this is an advice, it's more of like career advice that I got early in my career was extremely helpful for me and I will give that advice to everyone that is interested."}, {"time": 3658, "text": "Spend time understanding what are the things you're good at and what are the things you're not."}, {"time": 3664, "text": "Like what is the real border between your area of competence and your area of incompetence?"}, {"time": 3670, "text": "And once you see that, once you see that you know exactly what you have to work on and you can say, that's where I wanna go next, this is the gap, I need to do it."}, {"time": 3681, "text": "And it's faster when you can identify yourself before other people can tell you."}, {"time": 3687, "text": "Then it leads to automatically the next step."}, {"time": 3691, "text": "Surround yourself, the people that are very good at the things that you're not."}, {"time": 3695, "text": "So you have to be radically honest about the things that you're not good at, but given what you're passionate about, you need to get good at, or you would like to get good at, and surround yourself by those people."}, {"time": 3707, "text": "How often did the plans you make actually work out?"}, {"time": 3710, "text": "So you said it's important to make plans."}, {"time": 3712, "text": "You didn't say anything about it's important to execute on those plans."}, {"time": 3716, "text": "More than 50% success rate."}, {"time": 3718, "text": "Try to keep it above 50."}, {"time": 3721, "text": "What was the whole, why did you end up in Japan?"}, {"time": 3725, "text": "I've been fortunate enough to work in cellular and wireless my entire career."}, {"time": 3730, "text": "So I always liked communications."}, {"time": 3733, "text": "When I entered engineering school, my dad was electrical engineer, but he worked with the utility company."}, {"time": 3739, "text": "He wanted me to graduate in traditional electrical engineering, like energy generation, distribution."}, {"time": 3747, "text": "But I like electronics communication, so I ended up doing both."}, {"time": 3751, "text": "And I always liked communication."}, {"time": 3755, "text": "I was fascinated by wireless communication."}, {"time": 3757, "text": "So my first job at a college, I started working for a Japanese company down in Brazil, was NEC, and within about a year in, they transferred me to Tokyo."}, {"time": 3766, "text": "They asked me to go to their headquarters, and it was the first time I left Brazil."}, {"time": 3771, "text": "A little bit different from Brazil."}, {"time": 3773, "text": "Culturally."}, {"time": 3774, "text": "It is in the other side of the planet."}, {"time": 3778, "text": "And that's how I started."}, {"time": 3780, "text": "You said your father's an electrical engineer."}, {"time": 3783, "text": "Do you think what you're doing now makes your father proud?"}, {"time": 3787, "text": "I think he's very proud."}, {"time": 3788, "text": "I think especially, you know, he tells me that I'm still the same person that never changed."}, {"time": 3797, "text": "Does he give you advice?"}, {"time": 3799, "text": "Does he criticize what you're doing?"}, {"time": 3800, "text": "Tell you how to improve?"}, {"time": 3802, "text": "My mom and dad still give me advice today."}, {"time": 3804, "text": "I'm very fortunate for that."}, {"time": 3805, "text": "But he's proud."}, {"time": 3809, "text": "I'm also proud because there are very few Brazilians that have achieved a position as CEO of a company the size of Qualcomm."}, {"time": 3819, "text": "And I do know that also I carry a burden, especially for the Latino community, to be an inspiration for them and make sure I set a good example."}, {"time": 3831, "text": "So not just your mom and dad, but the culture, the people that were originally your home."}, {"time": 3841, "text": "Do you, you know, life is finite."}, {"time": 3847, "text": "Look, I'm a devout Christian, and so I'm a big believer that there's, this is just a transition."}, {"time": 3858, "text": "But don't spend a lot of time thinking about that."}, {"time": 3862, "text": "I am somebody good, better, and different that try as much as possible to leave the present, and that's what I do."}, {"time": 3871, "text": "And try to make the present better on this place here on Earth."}, {"time": 3876, "text": "And that some of these technologies, some of these ideas are kind of a different kind of immortality as well, because they propagate through time and have impact on people in the best possible way."}, {"time": 3887, "text": "So technology can be scary, technology can be destructive, but it seems like in the end it can do a lot of good."}, {"time": 3896, "text": "More good, there's more good than bad."}, {"time": 3901, "text": "I asked you about aliens observing us."}]}]