[{"title": "Richard Karp: Algorithms and Computational Complexity | Lex Fridman Podcast #111", "id": "KllCrlfLuzs", "quotes": [{"time": 383, "text": "It was much more fun than the earlier mathematics courses which were mostly about arithmetic operations and manipulating them."}, {"time": 392, "text": "Was there something about geometry itself, the slightly visual component of it?"}, {"time": 398, "text": "Oh, yes, absolutely, although I lacked three dimensional vision."}, {"time": 404, "text": "I wasn't very good at three dimensional vision."}, {"time": 407, "text": "You mean being able to visualize three dimensional objects?"}, {"time": 409, "text": "Three dimensional objects or surfaces, hyperplanes and so on."}, {"time": 417, "text": "So there I didn't have an intuition."}, {"time": 421, "text": "But for example, the fact that the sum of the angles of a triangle is 180 degrees is proved convincingly."}, {"time": 436, "text": "And it comes as a surprise that that can be done."}, {"time": 441, "text": "Why is that surprising?"}, {"time": 443, "text": "Well, it is a surprising idea, I suppose."}, {"time": 450, "text": "Why is that proved difficult?"}, {"time": 452, "text": "It's not, that's the point."}, {"time": 454, "text": "It's so easy and yet it's so convincing."}, {"time": 457, "text": "Do you remember what is the proof that it adds up to 180?"}, {"time": 462, "text": "You start at a corner and draw a line parallel to the opposite side."}, {"time": 476, "text": "And that line sort of trisects the angle between the other two sides."}, {"time": 485, "text": "And you get a half plane which has to add up to 180 degrees."}, {"time": 490, "text": "It has to add up to 180 degrees and it consists in the angles by the equality of alternate angles."}, {"time": 504, "text": "You get a correspondence between the angles created along the side of the triangle and the three angles of the triangle."}, {"time": 514, "text": "Has geometry had an impact on when you look into the future of your work with combinatorial algorithms?"}, {"time": 521, "text": "Has it had some kind of impact in terms of, yeah, being able, the puzzles, the visual aspects that were first so compelling to you?"}, {"time": 531, "text": "Not Euclidean geometry particularly."}, {"time": 534, "text": "I think I use tools like linear programming and integer programming a lot."}, {"time": 543, "text": "But those require high dimensional visualization and so I tend to go by the algebraic properties."}, {"time": 553, "text": "Right, you go by the linear algebra and not by the visualization."}, {"time": 559, "text": "Well, the interpretation in terms of, for example, finding the highest point on a polyhedron as in linear programming is motivating."}, {"time": 572, "text": "But again, I don't have the high dimensional intuition that would particularly inform me so I sort of lean on the algebra."}, {"time": 584, "text": "So to linger on that point, what kind of visualization do you do when you're trying to think about, we'll get to combinatorial algorithms, but just algorithms in general."}, {"time": 598, "text": "What's inside your mind when you're thinking about designing algorithms?"}, {"time": 602, "text": "Or even just tackling any mathematical problem?"}, {"time": 609, "text": "Well, I think that usually an algorithm involves a repetition of some inner loop and so I can sort of visualize the distance from the desired solution as iteratively reducing until you finally hit the exact solution."}, {"time": 633, "text": "And try to take steps that get you closer to the."}, {"time": 635, "text": "Try to take steps that get closer and having the certainty of converging."}, {"time": 641, "text": "So it's basically the mechanics of the algorithm is often very simple, but especially when you're trying something out on the computer."}, {"time": 653, "text": "So for example, I did some work on the traveling salesman problem and I could see there was a particular function that had to be minimized and it was fascinating to see the successive approaches to the minimum, to the optimum."}, {"time": 671, "text": "You mean, so first of all, traveling salesman problem is where you have to visit every city without ever, the only ones."}, {"time": 682, "text": "Find the shortest path through a set of cities."}, {"time": 685, "text": "Yeah, which is sort of a canonical standard, a really nice problem that's really hard."}, {"time": 690, "text": "Right, exactly, yes."}, {"time": 692, "text": "So can you say again what was nice about being able to think about the objective function there and maximizing it or minimizing it?"}, {"time": 701, "text": "Well, just that as the algorithm proceeded, you were making progress, continual progress, and eventually getting to the optimum point."}, {"time": 714, "text": "So there's two parts, maybe."}, {"time": 717, "text": "Maybe you can correct me."}, {"time": 718, "text": "First is like getting an intuition about what the solution would look like and or even maybe coming up with a solution and two is proving that this thing is actually going to be pretty good."}, {"time": 730, "text": "What part is harder for you?"}, {"time": 733, "text": "Where's the magic happen?"}, {"time": 734, "text": "Is it in the first sets of intuitions or is it in the messy details of actually showing that it is going to get to the exact solution and it's gonna run at a certain complexity?"}, {"time": 752, "text": "Well, the magic is just the fact that the gap from the optimum decreases monotonically and you can see it happening and various metrics of what's going on are improving all along until finally you hit the optimum."}, {"time": 773, "text": "Perhaps later we'll talk about the assignment problem and I can illustrate."}, {"time": 778, "text": "It illustrates a little better."}, {"time": 780, "text": "Now zooming out again, as you write, Don Knuth has called attention to a breed of people who derive great aesthetic pleasure from contemplating the structure of computational processes."}, {"time": 793, "text": "So Don calls these folks geeks and you write that you remember the moment you realized you were such a person, you were shown the Hungarian algorithm to solve the assignment problem."}, {"time": 805, "text": "So perhaps you can explain what the assignment problem is and what the Hungarian algorithm is."}, {"time": 813, "text": "So in the assignment problem, you have n boys and n girls and you are given the desirability of, or the cost of matching the ith boy with the jth girl for all i and j."}, {"time": 832, "text": "You're given a matrix of numbers and you want to find the one to one matching of the boys with the girls such that the sum of the associated costs will be minimized."}, {"time": 848, "text": "So the best way to match the boys with the girls or men with jobs or any two sets."}, {"time": 856, "text": "Any possible matching is possible or?"}, {"time": 861, "text": "Yeah, all one to one correspondences are permissible."}, {"time": 866, "text": "If there is a connection that is not allowed, then you can think of it as having an infinite cost."}, {"time": 872, "text": "I see, yeah."}, {"time": 874, "text": "So what you do is to depend on the observation that the identity of the optimal assignment or as we call it, the optimal permutation is not changed if you subtract a constant from any row or column of the matrix."}, {"time": 901, "text": "You can see that the comparison between the different assignments is not changed by that."}, {"time": 906, "text": "Because if you decrease a particular row, all the elements of a row by some constant, all solutions decrease by an amount equal to that constant."}, {"time": 921, "text": "So the idea of the algorithm is to start with a matrix of non negative numbers and keep subtracting from rows or from columns."}, {"time": 934, "text": "Subtracting from rows or entire columns in such a way that you subtract the same constant from all the elements of that row or column while maintaining the property that all the elements are non negative."}, {"time": 958, "text": "Simple."}, {"time": 959, "text": "Yeah, and so what you have to do is find small moves which will decrease the total cost while subtracting constants from rows or columns."}, {"time": 977, "text": "And there's a particular way of doing that by computing the kind of shortest path through the elements in the matrix."}, {"time": 984, "text": "And you just keep going in this way until you finally get a full permutation of zeros while the matrix is non negative and then you know that that has to be the cheapest."}, {"time": 998, "text": "Is that as simple as it sounds?"}, {"time": 1002, "text": "So the shortest path of the matrix part."}, {"time": 1005, "text": "Yeah, the simplicity lies in how you find, I oversimplified slightly what you, you will end up subtracting a constant from some rows or columns and adding the same constant back to other rows and columns."}, {"time": 1024, "text": "So as not to reduce any of the zero elements, you leave them unchanged."}, {"time": 1031, "text": "But each individual step modifies several rows and columns by the same amount but overall decreases the cost."}, {"time": 1046, "text": "So there's something about that elegance that made you go aha, this is a beautiful, like it's amazing that something like this, something so simple can solve a problem like this."}, {"time": 1058, "text": "Yeah, it's really cool."}, {"time": 1059, "text": "If I had mechanical ability, I would probably like to do woodworking or other activities where you sort of shape something into something beautiful and orderly and there's something about the orderly systematic nature of that iterative algorithm that is pleasing to me."}, {"time": 1085, "text": "So what do you think about this idea of geeks as Don Knuth calls them?"}, {"time": 1091, "text": "What do you think, is it something specific to a mindset that allows you to discover the elegance in computational processes or is this all of us, can all of us discover this beauty?"}, {"time": 1105, "text": "Were you born this way?"}, {"time": 1109, "text": "I always like to play with numbers."}, {"time": 1110, "text": "I used to amuse myself by multiplying by multiplying four digit decimal numbers in my head and putting myself to sleep by starting with one and doubling the number as long as I could go and testing my memory, my ability to retain the information."}, {"time": 1132, "text": "And I also read somewhere that you wrote that you enjoyed showing off to your friends by I believe multiplying four digit numbers."}, {"time": 1145, "text": "Four digit numbers."}, {"time": 1147, "text": "Yeah, I had a summer job at a beach resort outside of Boston and the other employee, I was the barker at a skee ball game."}, {"time": 1161, "text": "I used to sit at a microphone saying come one, come all, come in and play skee ball, five cents to play, a nickel to win and so on."}, {"time": 1171, "text": "That's what a barker, I wasn't sure if I should know but barker, that's, so you're the charming, outgoing person that's getting people to come in."}, {"time": 1181, "text": "Yeah, well I wasn't particularly charming but I could be very repetitious and loud."}, {"time": 1187, "text": "And the other employees were sort of juvenile delinquents who had no academic bent but somehow I found that I could impress them by performing this mental arithmetic."}, {"time": 1206, "text": "Yeah, there's something to that."}, {"time": 1210, "text": "Some of the most popular videos on the internet is there's a YouTube channel called Numberphile that shows off different mathematical ideas."}, {"time": 1221, "text": "There's still something really profoundly interesting to people about math, the beauty of it."}, {"time": 1227, "text": "Something, even if they don't understand the basic concept even being discussed, there's something compelling to it."}, {"time": 1237, "text": "Any lessons you drew from your early teen years when you were showing off to your friends with the numbers?"}, {"time": 1245, "text": "Like what is it that attracts us to the beauty of mathematics do you think?"}, {"time": 1251, "text": "The general population, not just the computer scientists and mathematicians."}, {"time": 1256, "text": "I think that you can do amazing things."}, {"time": 1259, "text": "You can test whether large numbers are prime."}, {"time": 1264, "text": "You can solve little puzzles about cannibals and missionaries."}, {"time": 1273, "text": "And that's a kind of achievement, it's puzzle solving."}, {"time": 1279, "text": "And at a higher level, the fact that you can do this reasoning that you can prove in an absolutely ironclad way that some of the angles of a triangle is 180 degrees."}, {"time": 1292, "text": "Yeah, it's a nice escape from the messiness of the real world where nothing can be proved."}, {"time": 1298, "text": "So, and we'll talk about it, but sometimes the ability to map the real world into such problems where you can't prove it is a powerful step."}, {"time": 1307, "text": "It's amazing that we can do it."}, {"time": 1308, "text": "Of course, another attribute of geeks is they're not necessarily endowed with emotional intelligence, so they can live in a world of abstractions without having to master the complexities of dealing with people."}, {"time": 1326, "text": "So just to link on the historical note, as a PhD student in 1955, you joined the computational lab at Harvard where Howard Aiken had built the Mark I and the Mark IV computers."}, {"time": 1339, "text": "Just to take a step back into that history, what were those computers like?"}, {"time": 1346, "text": "The Mark IV filled a large room, much bigger than this large office that we were talking in now."}, {"time": 1356, "text": "And you could walk around inside it."}, {"time": 1359, "text": "There were rows of relays."}, {"time": 1363, "text": "You could just walk around the interior and the machine would sometimes fail because of bugs, which literally meant flying creatures landing on the switches."}, {"time": 1379, "text": "So I never used that machine for any practical purpose."}, {"time": 1386, "text": "The lab eventually acquired one of the earlier commercial computers."}, {"time": 1394, "text": "And this was already in the 60s?"}, {"time": 1396, "text": "No, in the mid 50s, or late 50s."}, {"time": 1399, "text": "There was already commercial computers in the... Yeah, we had a Univac, a Univac with 2,000 words of storage."}, {"time": 1407, "text": "And so you had to work hard to allocate the memory properly to also the excess time from one word to another depended on the number of the particular words."}, {"time": 1421, "text": "And so there was an art to sort of arranging the storage allocation to make fetching data rapid."}, {"time": 1431, "text": "Were you attracted to this actual physical world implementation of mathematics?"}, {"time": 1438, "text": "So it's a mathematical machine that's actually doing the math physically?"}, {"time": 1443, "text": "No, not at all."}, {"time": 1444, "text": "I think I was attracted to the underlying algorithms."}, {"time": 1449, "text": "But did you draw any inspiration?"}, {"time": 1452, "text": "So could you have imagined, like what did you imagine was the future of these giant computers?"}, {"time": 1460, "text": "Could you have imagined that 60 years later we'd have billions of these computers all over the world?"}, {"time": 1465, "text": "I couldn't imagine that, but there was a sense in the laboratory that this was the wave of the future."}, {"time": 1476, "text": "In fact, my mother influenced me."}, {"time": 1478, "text": "She told me that data processing was gonna be really big and I should get into it."}, {"time": 1483, "text": "You're a smart woman."}, {"time": 1487, "text": "Yeah, she was a smart woman."}, {"time": 1489, "text": "And there was just a feeling that this was going to change the world, but I didn't think of it in terms of personal computing."}, {"time": 1497, "text": "I had no anticipation that we would be walking around with computers in our pockets or anything like that."}, {"time": 1506, "text": "Did you see computers as tools, as mathematical mechanisms to analyze sort of the theoretical computer science, or as the AI folks, which is an entire other community of dreamers, as something that could one day have human level intelligence?"}, {"time": 1526, "text": "Well, AI wasn't very much on my radar."}, {"time": 1529, "text": "I did read Turing's paper about the..."}, {"time": 1533, "text": "The Turing Test, Computing and Intelligence."}, {"time": 1538, "text": "Yeah, the Turing test."}, {"time": 1540, "text": "What'd you think about that paper?"}, {"time": 1541, "text": "Was that just like science fiction?"}, {"time": 1545, "text": "I thought that it wasn't a very good test because it was too subjective."}, {"time": 1550, "text": "So I didn't feel that the Turing test was really the right way to calibrate how intelligent an algorithm could be."}, {"time": 1561, "text": "But to linger on that, do you think it's, because you've come up with some incredible tests later on, tests on algorithms, right, that are like strong, reliable, robust across a bunch of different classes of algorithms, but returning to this emotional mess that is intelligence, do you think it's possible to come up with a test that's as ironclad as some of the computational complexity work?"}, {"time": 1591, "text": "Well, I think the greater question is whether it's possible to achieve human level intelligence."}, {"time": 1598, "text": "Right, so first of all, let me, at the philosophical level, do you think it's possible to create algorithms that reason and would seem to us to have the same kind of intelligence as human beings?"}, {"time": 1676, "text": "I don't think there's any computer program which surpasses a six month old child in terms of comprehension of the world."}, {"time": 1690, "text": "Do you think this complexity of human intelligence, all the cognitive abilities we have, all the emotion, do you think that could be reduced one day or just fundamentally can it be reduced to a set of algorithms or an algorithm?"}, {"time": 1707, "text": "So can a Turing machine achieve human level intelligence?"}, {"time": 1713, "text": "I am doubtful about that."}, {"time": 1715, "text": "I guess the argument in favor of it is that the human brain seems to achieve what we call intelligence cognitive abilities of different kinds."}, {"time": 1731, "text": "And if you buy the premise that the human brain is just an enormous interconnected set of switches, so to speak, then in principle, you should be able to diagnose what that interconnection structure is like, characterize the individual switches, and build a simulation outside."}, {"time": 1754, "text": "But while that may be true in principle, that cannot be the way we're eventually gonna tackle this problem."}, {"time": 1765, "text": "That does not seem like a feasible way to go about it."}, {"time": 1769, "text": "So there is, however, an existence proof that if you believe that the brain is just a network of neurons operating by rules, I guess you could say that that's an existence proof of the capabilities of a mechanism, but it would be almost impossible to acquire the information unless we got enough insight into the operation of the brain."}, {"time": 1802, "text": "But there's so much mystery there."}, {"time": 1804, "text": "Do you think, what do you make of consciousness, for example, as an example of something we completely have no clue about?"}, {"time": 1813, "text": "The fact that we have this subjective experience."}, {"time": 1815, "text": "Is it possible that this network of, this circuit of switches is able to create something like consciousness?"}, {"time": 1824, "text": "To know its own identity."}, {"time": 1826, "text": "Yeah, to know the algorithm, to know itself."}, {"time": 1830, "text": "To know itself."}, {"time": 1832, "text": "I think if you try to define that rigorously, you'd have a lot of trouble."}, {"time": 1836, "text": "Yeah, that seems to be."}, {"time": 1839, "text": "So I know that there are many who believe that general intelligence can be achieved, and there are even some who feel certain that the singularity will come and we will be surpassed by the machines which will then learn more and more about themselves and reduce humans to an inferior breed."}, {"time": 1868, "text": "I am doubtful that this will ever be achieved."}, {"time": 1872, "text": "Just for the fun of it, could you linger on why, what's your intuition, why you're doubtful?"}, {"time": 1879, "text": "So there are quite a few people that are extremely worried about this existential threat of artificial intelligence, of us being left behind by this super intelligent new species."}, {"time": 1892, "text": "What's your intuition why that's not quite likely?"}, {"time": 1897, "text": "Just because none of the achievements in speech or robotics or natural language processing or creation of flexible computer assistants or any of that comes anywhere near close to that level of cognition."}, {"time": 1920, "text": "What do you think about ideas of sort of, if we look at Moore's Law and exponential improvement to allow us, that would surprise us?"}, {"time": 1929, "text": "Sort of our intuition fall apart with exponential improvement because, I mean, we're not able to kind of, we kind of think in linear improvement."}, {"time": 1938, "text": "We're not able to imagine a world that goes from the Mark I computer to an iPhone X. Yeah."}, {"time": 1947, "text": "So do you think we could be really surprised by the exponential growth?"}, {"time": 1953, "text": "Or on the flip side, is it possible that also intelligence is actually way, way, way, way harder, even with exponential improvement to be able to crack?"}, {"time": 1967, "text": "I don't think any constant factor improvement could change things."}, {"time": 1973, "text": "I mean, given our current comprehension of what cognition requires, it seems to me that multiplying the speed of the switches by a factor of a thousand or a million will not be useful until we really understand the organizational principle behind the network of switches."}, {"time": 2003, "text": "Well, let's jump into the network of switches and talk about combinatorial algorithms if we could."}, {"time": 2009, "text": "Let's step back with the very basics."}, {"time": 2011, "text": "What are combinatorial algorithms?"}, {"time": 2013, "text": "And what are some major examples of problems they aim to solve?"}, {"time": 2018, "text": "A combinatorial algorithm is one which deals with a system of discrete objects that can occupy various states or take on various values from a discrete set of values and need to be arranged or selected in such a way as to achieve some, to minimize some cost function."}, {"time": 2053, "text": "Or to prove the existence of some combinatorial configuration."}, {"time": 2059, "text": "So an example would be coloring the vertices of a graph."}, {"time": 2065, "text": "What's a graph?"}, {"time": 2068, "text": "So it's fun to ask one of the greatest computer scientists of all time the most basic questions in the beginning of most books."}, {"time": 2079, "text": "But for people who might not know, but in general how you think about it, what is a graph?"}, {"time": 2084, "text": "A graph, that's simple."}, {"time": 2087, "text": "It's a set of points, certain pairs of which are joined by lines called edges."}, {"time": 2095, "text": "And they sort of represent the, in different applications represent the interconnections between discrete objects."}, {"time": 2105, "text": "So they could be the interactions, interconnections between switches in a digital circuit or interconnections indicating the communication patterns of a human community."}, {"time": 2119, "text": "And they could be directed or undirected and then as you've mentioned before, might have costs."}, {"time": 2125, "text": "Right, they can be directed or undirected."}, {"time": 2127, "text": "They can be, you can think of them as, if you think, if a graph were representing a communication network, then the edge could be undirected meaning that information could flow along it in both directions or it could be directed with only one way communication."}, {"time": 2146, "text": "A road system is another example of a graph with weights on the edges."}, {"time": 2152, "text": "And then a lot of problems of optimizing the efficiency of such networks or learning about the performance of such networks are the object of combinatorial algorithms."}, {"time": 2171, "text": "So it could be scheduling classes at a school where the vertices, the nodes of the network are the individual classes and the edges indicate the constraints which say that certain classes cannot take place at the same time or certain teachers are available only for certain classes, et cetera."}, {"time": 2196, "text": "Or I talked earlier about the assignment problem of matching the boys with the girls where you have there a graph with an edge from each boy to each girl with a weight indicating the cost."}, {"time": 2213, "text": "Or in logical design of computers, you might want to find a set of so called gates, switches that perform logical functions which can be interconnected to each other and perform logical functions which can be interconnected to realize some function."}, {"time": 2235, "text": "So you might ask how many gates do you need in order for a circuit to give a yes output if at least a given number of its inputs are ones and no if fewer are present."}, {"time": 2262, "text": "My favorite's probably all the work with network flow."}, {"time": 2266, "text": "So anytime you have, I don't know why it's so compelling but there's something just beautiful about it."}, {"time": 2272, "text": "It seems like there's so many applications and communication networks and traffic flow that you can map into these and then you could think of pipes and water going through pipes and you could optimize it in different ways."}, {"time": 2287, "text": "There's something always visually and intellectually compelling to me about it."}, {"time": 2292, "text": "And of course you've done work there."}, {"time": 2295, "text": "Yeah, so there the edges represent channels along which some commodity can flow."}, {"time": 2304, "text": "It might be gas, it might be water, it might be information."}, {"time": 2309, "text": "Maybe supply chain as well like products being."}, {"time": 2313, "text": "Products flowing from one operation to another."}, {"time": 2317, "text": "And the edges have a capacity which is the rate at which the commodity can flow."}, {"time": 2323, "text": "And a central problem is to determine given a network of these channels."}, {"time": 2331, "text": "In this case the edges are communication channels."}, {"time": 2336, "text": "The challenge is to find the maximum rate at which the information can flow along these channels to get from a source to a destination."}, {"time": 2349, "text": "And that's a fundamental combinatorial problem that I've worked on jointly with the scientist Jack Edmonds."}, {"time": 2359, "text": "I think we're the first to give a formal proof that this maximum flow problem through a network can be solved in polynomial time."}, {"time": 2370, "text": "Which I remember the first time I learned that."}, {"time": 2373, "text": "Just learning that in maybe even grad school."}, {"time": 2379, "text": "I don't think it was even undergrad."}, {"time": 2381, "text": "No, algorithm, yeah."}, {"time": 2383, "text": "Do network flows get taught in basic algorithms courses?"}, {"time": 2390, "text": "Yes, probably."}, {"time": 2391, "text": "Okay, so yeah, I remember being very surprised that max flow is a polynomial time algorithm."}, {"time": 2396, "text": "That there's a nice fast algorithm that solves max flow."}, {"time": 2399, "text": "So there is an algorithm named after you in Edmonds."}, {"time": 2406, "text": "The Edmond Carp algorithm for max flow."}, {"time": 2408, "text": "So what was it like tackling that problem and trying to arrive at a polynomial time solution?"}, {"time": 2415, "text": "And maybe you can describe the algorithm."}, {"time": 2417, "text": "Maybe you can describe what's the running time complexity that you showed."}, {"time": 2420, "text": "Yeah, well, first of all, what is a polynomial time algorithm?"}, {"time": 2425, "text": "Perhaps we could discuss that."}, {"time": 2428, "text": "So yeah, let's actually just even, yeah."}, {"time": 2431, "text": "What is algorithmic complexity?"}, {"time": 2434, "text": "What are the major classes of algorithm complexity?"}, {"time": 2438, "text": "So in a problem like the assignment problem or scheduling schools or any of these applications, you have a set of input data which might, for example, be a set of vertices connected by edges with you're given for each edge the capacity of the edge."}, {"time": 2467, "text": "And you have algorithms which are, think of them as computer programs with operations such as addition, subtraction, multiplication, division, comparison of numbers, and so on."}, {"time": 2482, "text": "And you're trying to construct an algorithm based on those operations, which will determine in a minimum number of computational steps the answer to the problem."}, {"time": 2498, "text": "In this case, the computational step is one of those operations."}, {"time": 2503, "text": "And the answer to the problem is let's say the configuration of the network that carries the maximum amount of flow."}, {"time": 2514, "text": "And an algorithm is said to run in polynomial time if as a function of the size of the input, the number of vertices, the number of edges, and so on, the number of basic computational steps grows only as some fixed power of that size."}, {"time": 2535, "text": "A linear algorithm would execute a number of steps linearly proportional to the size."}, {"time": 2544, "text": "Quadratic algorithm would be steps proportional to the square of the size, and so on."}, {"time": 2550, "text": "And algorithms whose running time is bounded by some fixed power of the size are called polynomial algorithms."}, {"time": 2560, "text": "And that's supposed to be relatively fast class of algorithms."}, {"time": 2565, "text": "Theoreticians take that to be the definition of an algorithm being efficient."}, {"time": 2574, "text": "And we're interested in which problems can be solved by such efficient algorithms."}, {"time": 2582, "text": "One can argue whether that's the right definition of efficient because you could have an algorithm whose running time is the 10,000th power of the size of the input, and that wouldn't be really efficient."}, {"time": 2595, "text": "And in practice, it's oftentimes reducing from an N squared algorithm to an N log N or a linear time is practically the jump that you wanna make to allow a real world system to solve a problem."}, {"time": 2611, "text": "Yeah, that's also true because especially as we get very large networks, the size can be in the millions, and then anything above N log N where N is the size would be too much for a practical solution."}, {"time": 2629, "text": "Okay, so that's polynomial time algorithms."}, {"time": 2632, "text": "What other classes of algorithms are there?"}, {"time": 2636, "text": "What's, so that usually they designate polynomials of the letter P. Yeah."}, {"time": 2643, "text": "There's also NP, NP complete and NP hard."}, {"time": 2647, "text": "So can you try to disentangle those by trying to define them simply?"}, {"time": 2654, "text": "Right, so a polynomial time algorithm is one whose running time is bounded by a polynomial in the size of the input."}, {"time": 2664, "text": "Then the class of such algorithms is called P. In the worst case, by the way, we should say, right?"}, {"time": 2672, "text": "So for every case of the problem."}, {"time": 2673, "text": "Yes, that's right, and that's very important that in this theory, when we measure the complexity of an algorithm, we really measure the number of steps, the growth of the number of steps in the worst case."}, {"time": 2688, "text": "So you may have an algorithm that runs very rapidly in most cases, but if there's any case where it gets into a very long computation, that would increase the computational complexity by this measure."}, {"time": 2705, "text": "And that's a very important issue because there are, as we may discuss later, there are some very important algorithms which don't have a good standing from the point of view of their worst case performance and yet are very effective."}, {"time": 2720, "text": "So theoreticians are interested in P, the class of problem solvable in polynomial time."}, {"time": 2727, "text": "Then there's NP, which is the class of problems which may be hard to solve, but when confronted with a solution, you can check it in polynomial time."}, {"time": 2746, "text": "Let me give you an example there."}, {"time": 2749, "text": "So if we look at the assignment problem, so you have N boys, you have N girls, the number of numbers that you need to write down to specify the problem instance is N squared."}, {"time": 2763, "text": "And the question is how many steps are needed to solve it?"}, {"time": 2771, "text": "And Jack Edmonds and I were the first to show that it could be done in time and cubed."}, {"time": 2780, "text": "Earlier algorithms required N to the fourth."}, {"time": 2783, "text": "So as a polynomial function of the size of the input, this is a fast algorithm."}, {"time": 2790, "text": "Now to illustrate the class NP, the question is how long would it take to verify that a solution is optimal?"}, {"time": 2802, "text": "So for example, if the input was a graph, we might want to find the largest clique in the graph or a clique is a set of vertices such that any vertex, each vertex in the set is adjacent to each of the others."}, {"time": 2823, "text": "So the clique is a complete subgraph."}, {"time": 2828, "text": "Yeah, so if it's a Facebook social network, everybody's friends with everybody else, close clique."}, {"time": 2835, "text": "No, that would be what's called a complete graph."}, {"time": 2837, "text": "It would be."}, {"time": 2838, "text": "No, I mean within that clique."}, {"time": 2840, "text": "Within that clique, yeah."}, {"time": 2841, "text": "Yeah, they're all friends."}, {"time": 2845, "text": "So a complete graph is when?"}, {"time": 2847, "text": "Everybody is friendly."}, {"time": 2848, "text": "As everybody is friends with everybody, yeah."}, {"time": 2851, "text": "So the problem might be to determine whether in a given graph there exists a clique of a certain size."}, {"time": 2863, "text": "Now that turns out to be a very hard problem, but if somebody hands you a clique and asks you to check whether it is, hands you a set of vertices and asks you to check whether it's a clique, you could do that simply by exhaustively looking at all of the edges between the vertices and the clique and verifying that they're all there."}, {"time": 2888, "text": "And that's a polynomial time algorithm."}, {"time": 2890, "text": "That's a polynomial."}, {"time": 2891, "text": "So the problem of finding the clique appears to be extremely hard, but the problem of verifying a clique to see if it reaches a target number of vertices is easy to verify."}, {"time": 2911, "text": "So finding the clique is hard, checking it is easy."}, {"time": 2915, "text": "Problems of that nature are called nondeterministic polynomial time algorithms, and that's the class NP."}, {"time": 2925, "text": "And what about NP complete and NP hard?"}, {"time": 2928, "text": "Okay, let's talk about problems where you're getting a yes or no answer rather than a numerical value."}, {"time": 2935, "text": "So either there is a perfect matching of the boys with the girls or there isn't."}, {"time": 2944, "text": "It's clear that every problem in P is also in NP."}, {"time": 2950, "text": "If you can solve the problem exactly, then you can certainly verify the solution."}, {"time": 2957, "text": "On the other hand, there are problems in the class NP."}, {"time": 2963, "text": "This is the class of problems that are easy to check, although they may be hard to solve."}, {"time": 2969, "text": "It's not at all clear that problems in NP lie in P. So for example, if we're looking at scheduling classes at a school, the fact that you can verify when handed a schedule for the school, whether it meets all the requirements, that doesn't mean that you can find the schedule rapidly."}, {"time": 2991, "text": "So intuitively, NP, nondeterministic polynomial checking rather than finding, is going to be harder than, is going to include, is easier."}, {"time": 3006, "text": "Checking is easier, and therefore the class of problems that can be checked appears to be much larger than the class of problems that can be solved."}, {"time": 3014, "text": "And then you keep adding appears to, and sort of these additional words that designate that we don't know for sure yet."}, {"time": 3025, "text": "So the theoretical question, which is considered to be the most central problem in theoretical computer science, or at least computational complexity theory, combinatorial algorithm theory, the question is whether P is equal to NP."}, {"time": 3043, "text": "If P were equal to NP, it would be amazing."}, {"time": 3046, "text": "It would mean that every problem where a solution can be rapidly checked can actually be solved in polynomial time."}, {"time": 3060, "text": "We don't really believe that's true."}, {"time": 3063, "text": "If you're scheduling classes at a school, we expect that if somebody hands you a satisfying schedule, you can verify that it works."}, {"time": 3075, "text": "That doesn't mean that you should be able to find such a schedule."}, {"time": 3078, "text": "So intuitively, NP encompasses a lot more problems than P. So can we take a small tangent and break apart that intuition?"}, {"time": 3090, "text": "So do you, first of all, think that the biggest sort of open problem in computer science, maybe mathematics, is whether P equals NP?"}, {"time": 3100, "text": "Do you think P equals NP, or do you think P is not equal to NP?"}, {"time": 3106, "text": "If you had to bet all your money on it."}, {"time": 3108, "text": "I would bet that P is unequal to NP, simply because there are problems that have been around for centuries and have been studied intensively in mathematics, and even more so in the last 50 years since the P versus NP was stated."}, {"time": 3125, "text": "And no polynomial time algorithms have been found for these easy to check problems."}, {"time": 3133, "text": "So one example is a problem that goes back to the mathematician Gauss, who was interested in factoring large numbers."}, {"time": 3144, "text": "So we know what a number is prime if it cannot be written as the product of two or more numbers unequal to one."}, {"time": 3156, "text": "So if we can factor a number like 91, it's seven times 13."}, {"time": 3163, "text": "But if I give you 20 digit or 30 digit numbers, you're probably gonna be at a loss to have any idea whether they can be factored."}, {"time": 3176, "text": "So the problem of factoring very large numbers does not appear to have an efficient solution."}, {"time": 3186, "text": "But once you have found the factors, expressed the number as a product of two smaller numbers, you can quickly verify that they are factors of the number."}, {"time": 3199, "text": "And your intuition is a lot of people finding, a lot of brilliant people have tried to find algorithms for this one particular problem."}, {"time": 3206, "text": "There's many others like it that are really well studied and it would be great to find an efficient algorithm for."}, {"time": 3213, "text": "Right, and in fact, we have some results that I was instrumental in obtaining following up on work by the mathematician Stephen Cook to show that within the class NP of easy to check problems, easy to check problems, there's a huge number that are equivalent in the sense that either all of them or none of them lie in P. And this happens only if P is equal to NP."}, {"time": 3246, "text": "So if P is unequal to NP, we would also know that virtually all the standard combinatorial problems, virtually all the standard combinatorial problems, if P is unequal to NP, none of them can be solved in polynomial time."}, {"time": 3265, "text": "Can you explain how that's possible to tie together so many problems in a nice bunch that if one is proven to be efficient, then all are?"}, {"time": 3276, "text": "The first and most important stage of progress was a result by Stephen Cook who showed that a certain problem called the satisfiability problem of propositional logic is as hard as any problem in the class P. So the propositional logic problem is expressed in terms of expressions involving the logical operations and, or, and not operating on variables that can be either true or false."}, {"time": 3319, "text": "So an instance of the problem would be some formula involving and, or, and not."}, {"time": 3328, "text": "And the question would be whether there is an assignment of truth values to the variables in the problem that would make the formula true."}, {"time": 3337, "text": "So for example, if I take the formula A or B and A or not B and not A or B and not A or not B and take the conjunction of all four of those so called expressions, you can determine that no assignment of truth values to the variables A and B will allow that conjunction of what are called clauses to be true."}, {"time": 3369, "text": "So that's an example of a formula in propositional logic involving expressions based on the operations and, or, and not."}, {"time": 3383, "text": "That's an example of a problem which is not satisfiable."}, {"time": 3387, "text": "There is no solution that satisfies all of those constraints."}, {"time": 3391, "text": "I mean that's like one of the cleanest and fundamental problems in computer science."}, {"time": 3395, "text": "It's like a nice statement of a really hard problem."}, {"time": 3397, "text": "It's a nice statement of a really hard problem and what Cook showed is that every problem in NP can be reexpressed as an instance of the satisfiability problem."}, {"time": 3416, "text": "So to do that, he used the observation that a very simple abstract machine called the Turing machine can be used to describe any algorithm."}, {"time": 3434, "text": "An algorithm for any realistic computer can be translated into an equivalent algorithm on one of these Turing machines which are extremely simple."}, {"time": 3447, "text": "So a Turing machine, there's a tape and you can Yeah, you have data on a tape and you have basic instructions, a finite list of instructions which say, if you're reading a particular symbol on the tape and you're in a particular state, then you can move to a different state and change the state of the number or the element that you were looking at, the cell of the tape that you were looking at."}, {"time": 3475, "text": "And that was like a metaphor and a mathematical construct that Turing put together to represent all possible computation."}, {"time": 3482, "text": "All possible computation."}, {"time": 3483, "text": "Now, one of these so called Turing machines is too simple to be useful in practice, but for theoretical purposes, we can depend on the fact that an algorithm for any computer can be translated into one that would run on a Turing machine."}, {"time": 3501, "text": "And then using that fact, he could sort of describe any possible non deterministic polynomial time algorithm."}, {"time": 3515, "text": "Any algorithm for a problem in NP could be expressed as a sequence of moves of the Turing machine described in terms of reading a symbol on the tape while you're in a given state and moving to a new state and leaving behind a new symbol."}, {"time": 3540, "text": "And given that fact that any non deterministic polynomial time algorithm can be described by a list of such instructions, you could translate the problem into the language of the satisfiability problem."}, {"time": 3559, "text": "Is that amazing to you, by the way, if you take yourself back when you were first thinking about the space of problems?"}, {"time": 3564, "text": "How amazing is that?"}, {"time": 3566, "text": "It's astonishing."}, {"time": 3567, "text": "When you look at Cook's proof, it's not too difficult to sort of figure out why this is so, but the implications are staggering."}, {"time": 3580, "text": "It tells us that this, of all the problems in NP, all the problems where solutions are easy to check, they can all be rewritten in terms of the satisfiability problem."}, {"time": 3599, "text": "Yeah, it's adding so much more weight to the P equals NP question because all it takes is to show that one algorithm in this class."}, {"time": 3611, "text": "So the P versus NP can be re expressed as simply asking whether the satisfiability problem of propositional logic is solvable in polynomial time."}, {"time": 3623, "text": "But there's more."}, {"time": 3628, "text": "I encountered Cook's paper when he published it in a conference in 1971."}, {"time": 3634, "text": "Yeah, so when I saw Cook's paper and saw this reduction of each of the problems in NP by a uniform method to the satisfiability problem of propositional logic, that meant that the satisfiability problem was a universal combinatorial problem."}, {"time": 3659, "text": "And it occurred to me through experience I had had in trying to solve other combinatorial problems that there were many other problems which seemed to have that universal structure."}, {"time": 3676, "text": "And so I began looking for reductions from the satisfiability to other problems."}, {"time": 3686, "text": "And one of the other problems would be the so called integer programming problem of determining whether there's a solution to a set of linear inequalities involving integer variables."}, {"time": 3708, "text": "Just like linear programming, but there's a constraint that the variables must remain integers."}, {"time": 3713, "text": "In fact, must be the zero or one could only take on those values."}, {"time": 3718, "text": "And that makes the problem much harder."}, {"time": 3720, "text": "Yes, that makes the problem much harder."}, {"time": 3723, "text": "And it was not difficult to show that the satisfiability problem can be restated as an integer programming problem."}, {"time": 3733, "text": "So can you pause on that?"}, {"time": 3735, "text": "Was that one of the first mappings that you tried to do?"}, {"time": 3739, "text": "And how hard is that mapping?"}, {"time": 3740, "text": "You said it wasn't hard to show, but that's a big leap."}, {"time": 3747, "text": "It is a big leap, yeah."}, {"time": 3749, "text": "Well, let me give you another example."}, {"time": 3752, "text": "Another problem in NP is whether a graph contains a clique of a given size."}, {"time": 3762, "text": "And now the question is, can we reduce the propositional logic problem to the problem of whether there's a clique of a certain size?"}, {"time": 3778, "text": "Well, if you look at the propositional logic problem, it can be expressed as a number of clauses, each of which is a, of the form A or B or C, where A is either one of the variables in the problem or the negation of one of the variables."}, {"time": 3802, "text": "And an instance of the propositional logic problem can be rewritten using operations of Boolean logic, can be rewritten as the conjunction of a set of clauses, the AND of a set of ORs, where each clause is a disjunction, an OR of variables or negated variables."}, {"time": 3833, "text": "So the question in the satisfiability problem is whether those clauses can be simultaneously satisfied."}, {"time": 3847, "text": "Now, to satisfy all those clauses, you have to find one of the terms in each clause, which is going to be true in your truth assignment, but you can't make the same variable both true and false."}, {"time": 3864, "text": "So if you have the variable A in one clause and you want to satisfy that clause by making A true, you can't also make the complement of A true in some other clause."}, {"time": 3879, "text": "And so the goal is to make every single clause true if it's possible to satisfy this, and the way you make it true is at least... One term in the clause must be true."}, {"time": 3893, "text": "So now we, to convert this problem to something called the independent set problem, where you're just sort of asking for a set of vertices in a graph such that no two of them are adjacent, sort of the opposite of the clique problem."}, {"time": 3914, "text": "So we've seen that we can now express that as finding a set of terms, one in each clause, without picking both the variable and the negation of that variable, because if the variable is assigned the truth value, the negated variable has to have the opposite truth value."}, {"time": 3989, "text": "And so you get a graph where you have all of these occurrences of variables, you have edges, which mean that you're not allowed to choose both ends of the edge, either because they're in the same clause or they're negations of one another."}, {"time": 4006, "text": "All right, and that's a, first of all, sort of to zoom out, that's a really powerful idea that you can take a graph and connect it to a logic equation somehow, and do that mapping for all possible formulations of a particular problem on a graph."}, {"time": 4027, "text": "I mean, that still is hard for me to believe."}, {"time": 4032, "text": "Yeah, it's hard for me to believe."}, {"time": 4034, "text": "It's hard for me to believe that that's possible."}, {"time": 4037, "text": "That they're, like, what do you make of that, that there's such a union of, there's such a friendship among all these problems across that somehow are akin to combinatorial algorithms, that they're all somehow related?"}, {"time": 4055, "text": "I know it can be proven, but what do you make of it, that that's true?"}, {"time": 4061, "text": "Well, that they just have the same expressive power."}, {"time": 4066, "text": "You can take any one of them and translate it into the terms of the other."}, {"time": 4073, "text": "The fact that they have the same expressive power also somehow means that they can be translatable."}, {"time": 4079, "text": "Right, and what I did in the 1971 paper was to take 21 fundamental problems, the commonly occurring problems of packing, covering, matching, and so forth, lying in the class NP, and show that the satisfiability problem can be reexpressed as any of those, that any of those have the same expressive power."}, {"time": 4110, "text": "And that was like throwing down the gauntlet of saying there's probably many more problems like this."}, {"time": 4116, "text": "Saying that, look, that they're all the same."}, {"time": 4119, "text": "They're all the same, but not exactly."}, {"time": 4123, "text": "They're all the same in terms of whether they are rich enough to express any of the others."}, {"time": 4133, "text": "But that doesn't mean that they have the same computational complexity."}, {"time": 4137, "text": "But what we can say is that either all of these problems or none of them are solvable in polynomial time."}, {"time": 4145, "text": "Yeah, so what is NP completeness and NP hard as classes?"}, {"time": 4151, "text": "Oh, that's just a small technicality."}, {"time": 4154, "text": "So when we're talking about decision problems, that means that the answer is just yes or no."}, {"time": 4161, "text": "There is a clique of size 15 or there's not a clique of size 15."}, {"time": 4166, "text": "On the other hand, an optimization problem would be asking find the largest clique."}, {"time": 4173, "text": "The answer would not be yes or no."}, {"time": 4175, "text": "It would be 15."}, {"time": 4179, "text": "So when you're asking for the, when you're putting a valuation on the different solutions and you're asking for the one with the highest valuation, that's an optimization problem."}, {"time": 4191, "text": "And there's a very close affinity between the two kinds of problems."}, {"time": 4195, "text": "But the counterpart of being the hardest decision problem, the hardest yes, no problem, the counterpart of that is to minimize or maximize an objective function."}, {"time": 4213, "text": "And so a problem that's hardest in the class when viewed in terms of optimization, those are called NP hard rather than NP complete."}, {"time": 4224, "text": "And NP complete is for decision problems."}, {"time": 4228, "text": "So if somebody shows that P equals NP, what do you think that proof will look like if you were to put on yourself, if it's possible to show that as a proof or to demonstrate an algorithm?"}, {"time": 4249, "text": "All I can say is that it will involve concepts that we do not now have and approaches that we don't have."}, {"time": 4256, "text": "Do you think those concepts are out there in terms of inside complexity theory, inside of computational analysis of algorithms?"}, {"time": 4264, "text": "Do you think there's concepts that are totally outside of the box that we haven't considered yet?"}, {"time": 4269, "text": "I think that if there is a proof that P is equal to NP or that P is unequal to NP, it'll depend on concepts that are now outside the box."}, {"time": 4282, "text": "Now, if that's shown either way, P equals NP or P not, well, actually P equals NP, what impact, you kind of mentioned a little bit, but can you linger on it?"}, {"time": 4294, "text": "What kind of impact would it have on theoretical computer science and perhaps software based systems in general?"}, {"time": 4302, "text": "Well, I think it would have enormous impact on the world in either way case."}, {"time": 4309, "text": "If P is unequal to NP, which is what we expect, then we know that for the great majority of the combinatorial problems that come up, since they're known to be NP complete, we're not going to be able to solve them by efficient algorithms."}, {"time": 4327, "text": "However, there's a little bit of hope in that it may be that we can solve most instances."}, {"time": 4336, "text": "All we know is that if a problem is not NP, then it can't be solved efficiently on all instances."}, {"time": 4342, "text": "But basically, if we find that P is unequal to NP, it will mean that we can't expect always to get the optimal solutions to these problems."}, {"time": 4358, "text": "And we have to depend on heuristics that perhaps work most of the time or give us good approximate solutions, but not."}, {"time": 4367, "text": "So we would turn our eye towards the heuristics with a little bit more acceptance and comfort on our hearts."}, {"time": 4377, "text": "Okay, so let me ask a romanticized question."}, {"time": 4382, "text": "What to you is one of the most or the most beautiful combinatorial algorithm in your own life or just in general in the field that you've ever come across or have developed yourself?"}, {"time": 4394, "text": "Oh, I like the stable matching problem or the stable marriage problem very much."}, {"time": 4402, "text": "What's the stable matching problem?"}, {"time": 4406, "text": "Imagine that you want to marry off N boys with N girls."}, {"time": 4417, "text": "And each boy has an ordered list of his preferences among the girls."}, {"time": 4422, "text": "His first choice, his second choice, through her, Nth choice."}, {"time": 4427, "text": "And each girl also has an ordering of the boys, his first choice, second choice, and so on."}, {"time": 4438, "text": "And we'll say that a matching, a one to one matching of the boys with the girls is stable if there are no two couples in the matching such that the boy in the first couple prefers the girl in the second couple to her mate and she prefers the boy to her current mate."}, {"time": 4467, "text": "In other words, if the matching is stable if there is no pair who want to run away with each other leaving their partners behind."}, {"time": 4478, "text": "Gosh, yeah."}, {"time": 4484, "text": "Actually, this is relevant to matching residents with hospitals and some other real life problems, although not quite in the form that I described."}, {"time": 4496, "text": "So it turns out that there is, for any set of preferences, a stable matching exists."}, {"time": 4506, "text": "And moreover, it can be computed by a simple algorithm in which each boy starts making proposals to girls."}, {"time": 4521, "text": "And if the girl receives the proposal, she accepts it tentatively, but she can drop it later if she gets a better proposal from her point of view."}, {"time": 4536, "text": "And the boys start going down their lists proposing to their first, second, third choices until stopping when a proposal is accepted."}, {"time": 4550, "text": "But the girls meanwhile are watching the proposals that are coming into them."}, {"time": 4555, "text": "And the girl will drop her current partner if she gets a better proposal."}, {"time": 4563, "text": "And the boys never go back through the list?"}, {"time": 4566, "text": "They never go back, yeah."}, {"time": 4567, "text": "So once they've been denied."}, {"time": 4571, "text": "They don't try again."}, {"time": 4572, "text": "They don't try again because the girls are always improving their status as they receive better and better proposals."}, {"time": 4582, "text": "The boys are going down their lists starting with their top preferences."}, {"time": 4588, "text": "And one can prove that the process will come to an end where everybody will get matched with somebody and you won't have any pair that want to abscond from each other."}, {"time": 4610, "text": "Do you find the proof or the algorithm itself beautiful?"}, {"time": 4614, "text": "Or is it the fact that with the simplicity of just the two marching, I mean the simplicity of the underlying rule of the algorithm, is that the beautiful part?"}, {"time": 4624, "text": "Both I would say."}, {"time": 4627, "text": "And you also have the observation that you might ask who is better off, the boys who are doing the proposing or the girls who are reacting to proposals."}, {"time": 4637, "text": "And it turns out that it's the boys who are doing the best."}, {"time": 4642, "text": "That is, each boy is doing at least as well as he could do in any other staple matching."}, {"time": 4650, "text": "So there's a sort of lesson for the boys that you should go out and be proactive and make those proposals."}, {"time": 4658, "text": "Go for broke."}, {"time": 4661, "text": "I don't know if this is directly mappable philosophically to our society, but certainly seems like a compelling notion."}, {"time": 4668, "text": "And like you said, there's probably a lot of actual real world problems that this could be mapped to."}, {"time": 4674, "text": "Yeah, well you get complications."}, {"time": 4678, "text": "For example, what happens when a husband and wife want to be assigned to the same hospital?"}, {"time": 4683, "text": "So you have to take those constraints into account."}, {"time": 4690, "text": "And then the problem becomes NP hard."}, {"time": 4695, "text": "Why is it a problem for the husband and wife to be assigned to the same hospital?"}, {"time": 4700, "text": "No, it's desirable."}, {"time": 4702, "text": "Or at least go to the same city."}, {"time": 4704, "text": "So you can't, if you're assigning residents to hospitals."}, {"time": 4709, "text": "And then you have some preferences for the husband and the wife or for the hospitals."}, {"time": 4714, "text": "The residents have their own preferences."}, {"time": 4719, "text": "Residents both male and female have their own preferences."}, {"time": 4724, "text": "The hospitals have their preferences."}, {"time": 4727, "text": "But if resident A, the boy, is going to Philadelphia, then you'd like his wife also to be assigned to a hospital in Philadelphia."}, {"time": 4744, "text": "Which step makes it a NP hard problem that you mentioned?"}, {"time": 4748, "text": "The fact that you have this additional constraint."}, {"time": 4751, "text": "That it's not just the preferences of individuals, but the fact that the two partners to a marriage have to be assigned to the same place."}, {"time": 4762, "text": "I'm being a little dense."}, {"time": 4769, "text": "The perfect matching, no, not the perfect, stable matching is what you referred to."}, {"time": 4773, "text": "That's when two partners are trying to."}, {"time": 4776, "text": "Okay, what's confusing you is that in the first interpretation of the problem, I had boys matching with girls."}, {"time": 4784, "text": "In the second interpretation, you have humans matching with institutions."}, {"time": 4789, "text": "With institutions."}, {"time": 4791, "text": "I, and there's a coupling between within the, gotcha, within the humans."}, {"time": 4796, "text": "Any added little constraint will make it an NP hard problem."}, {"time": 4805, "text": "By the way, the algorithm you mentioned wasn't one of yours or no?"}, {"time": 4807, "text": "No, no, that was due to Gale and Shapley and my friend David Gale passed away before he could get part of a Nobel Prize, but his partner Shapley shared in a Nobel Prize with somebody else for."}, {"time": 4824, "text": "Economics?"}, {"time": 4825, "text": "For economics."}, {"time": 4828, "text": "For ideas stemming from the stable matching idea."}, {"time": 4832, "text": "So you've also have developed yourself some elegant, beautiful algorithms."}, {"time": 4838, "text": "Again, picking your children, so the Robin Karp algorithm for string searching, pattern matching, Edmund Karp algorithm for max flows we mentioned, Hopcroft Karp algorithm for finding maximum cardinality matchings in bipartite graphs."}, {"time": 4852, "text": "Is there ones that stand out to you, ones you're most proud of or just whether it's beauty, elegance, or just being the right discovery development in your life that you're especially proud of?"}, {"time": 4870, "text": "I like the Rabin Karp algorithm because it illustrates the power of randomization."}, {"time": 4877, "text": "So the problem there is to decide whether a given long string of symbols is to decide whether a given long string of symbols from some alphabet contains a given word, whether a particular word occurs within some very much longer word."}, {"time": 4905, "text": "And so the idea of the algorithm is to associate with the word that we're looking for, a fingerprint, some number, or some combinatorial object that describes that word, and then to look for an occurrence of that same fingerprint as you slide along the longer word."}, {"time": 4938, "text": "And what we do is we associate with each word a number."}, {"time": 4943, "text": "So first of all, we think of the letters that occur in a word as the digits of, let's say, decimal or whatever base here, whatever number of different symbols there are."}, {"time": 4960, "text": "That's the base of the numbers, yeah."}, {"time": 4962, "text": "Right, so every word can then be thought of as a number with the letters being the digits of that number."}, {"time": 4970, "text": "And then we pick a random prime number in a certain range, and we take that word viewed as a number, and take the remainder on dividing that number by the prime."}, {"time": 4989, "text": "So coming up with a nice hash function."}, {"time": 4991, "text": "It's a kind of hash function."}, {"time": 4993, "text": "Yeah, it gives you a little shortcut for that particular word."}, {"time": 5002, "text": "Yeah, so that's the..."}, {"time": 5006, "text": "It's very different than other algorithms of its kind that we're trying to do search, string matching."}, {"time": 5015, "text": "Yeah, which usually are combinatorial and don't involve the idea of taking a random fingerprint."}, {"time": 5023, "text": "And doing the fingerprinting has two advantages."}, {"time": 5028, "text": "One is that as we slide along the long word, digit by digit, we keep a window of a certain size, the size of the word we're looking for, and we compute the fingerprint of every stretch of that length."}, {"time": 5047, "text": "And it turns out that just a couple of arithmetic operations will take you from the fingerprint of one part to what you get when you slide over by one position."}, {"time": 5059, "text": "So the computation of all the fingerprints is simple."}, {"time": 5066, "text": "And secondly, it's unlikely if the prime is chosen randomly from a certain range that you will get two of the segments in question having the same fingerprint."}, {"time": 5081, "text": "And so there's a small probability of error which can be checked after the fact, and also the ease of doing the computation because you're working with these fingerprints which are remainder's modulo some big prime."}, {"time": 5095, "text": "So that's the magical thing about randomized algorithms is that if you add a little bit of randomness, it somehow allows you to take a pretty naive approach, a simple looking approach, and allow it to run extremely well."}, {"time": 5110, "text": "So can you maybe take a step back and say what is a randomized algorithm, this category of algorithms?"}, {"time": 5118, "text": "Well, it's just the ability to draw a random number from such, from some range or to associate a random number with some object or to draw that random from some set."}, {"time": 5135, "text": "So another example is very simple if we're conducting a presidential election and we would like to pick the winner."}, {"time": 5152, "text": "In principle, we could draw a random sample of all of the voters in the country."}, {"time": 5159, "text": "And if it was of substantial size, say a few thousand, then the most popular candidate in that group would be very likely to be the correct choice that would come out of counting all the millions of votes."}, {"time": 5175, "text": "And of course we can't do this because first of all, everybody has to feel that his or her vote counted."}, {"time": 5181, "text": "And secondly, we can't really do a purely random sample from that population."}, {"time": 5188, "text": "And I guess thirdly, there could be a tie in which case we wouldn't have a significant difference between two candidates."}, {"time": 5196, "text": "But those things aside, if you didn't have all that messiness of human beings, you could prove that that kind of random picking would come up again."}, {"time": 5203, "text": "You just said random picking would solve the problem with a very low probability of error."}, {"time": 5211, "text": "Another example is testing whether a number is prime."}, {"time": 5215, "text": "So if I wanna test whether 17 is prime, I could pick any number between one and 17, raise it to the 16th power modulo 17, and you should get back the original number."}, {"time": 5235, "text": "That's a famous formula due to Fermat about, it's called Fermat's Little Theorem, that if you take any number a in the range zero through n minus one, and raise it to the n minus 1th power modulo n, you'll get back the number a if a is prime."}, {"time": 5263, "text": "So if you don't get back the number a, that's a proof that a number is not prime."}, {"time": 5268, "text": "And you can show that suitably defined the probability that you will get a value unequaled, you will get a violation of Fermat's result is very high."}, {"time": 5294, "text": "And so this gives you a way of rapidly proving that a number is not prime."}, {"time": 5301, "text": "It's a little more complicated than that because there are certain values of n where something a little more elaborate has to be done, but that's the basic idea."}, {"time": 5312, "text": "Taking an identity that holds for primes, and therefore, if it ever fails on any instance for a non prime, you know that the number is not prime."}, {"time": 5323, "text": "It's a quick choice, a fast choice, fast proof that a number is not prime."}, {"time": 5328, "text": "Can you maybe elaborate a little bit more what's your intuition why randomness works so well and results in such simple algorithms?"}, {"time": 5337, "text": "Well, the example of conducting an election where you could take, in theory, you could take a sample and depend on the validity of the sample to really represent the whole is just the basic fact of statistics, which gives a lot of opportunities."}, {"time": 5357, "text": "And I actually exploited that sort of random sampling idea in designing an algorithm for counting the number of solutions that satisfy a particular formula and propositional logic."}, {"time": 5377, "text": "A particular, so some version of the satisfiability problem?"}, {"time": 5384, "text": "A version of the satisfiability problem."}, {"time": 5387, "text": "Is there some interesting insight that you wanna elaborate on, like what some aspect of that algorithm that might be useful to describe?"}, {"time": 5397, "text": "So you have a collection of formulas and you want to count the number of solutions that satisfy at least one of the formulas."}, {"time": 5420, "text": "And you can count the number of solutions that satisfy any particular one of the formulas, but you have to account for the fact that that solution might be counted many times if it solves more than one of the formulas."}, {"time": 5440, "text": "And so what you do is you sample from the formulas according to the number of solutions that satisfy each individual one."}, {"time": 5453, "text": "In that way, you draw a random solution, but then you correct by looking at the number of formulas that satisfy that random solution and don't double count."}, {"time": 5468, "text": "So you can think of it this way."}, {"time": 5471, "text": "So you have a matrix of zeros and ones and you wanna know how many columns of that matrix contain at least one one."}, {"time": 5482, "text": "And you can count in each row how many ones there are."}, {"time": 5486, "text": "So what you can do is draw from the rows according to the number of ones."}, {"time": 5491, "text": "If a row has more ones, it gets drawn more frequently."}, {"time": 5495, "text": "But then if you draw from that row, you have to go up the column and looking at where that same one is repeated in different rows and only count it as a success or a hit if it's the earliest row that contains the one."}, {"time": 5514, "text": "And that gives you a robust statistical estimate of the total number of columns that contain at least one of the ones."}, {"time": 5524, "text": "So that is an example of the same principle that was used in studying random sampling."}, {"time": 5533, "text": "Another viewpoint is that if you have a phenomenon that occurs almost all the time, then if you sample one of the occasions where it occurs, you're most likely to, and you're looking for an occurrence, a random occurrence is likely to work."}, {"time": 5554, "text": "So that comes up in solving identities, solving algebraic identities."}, {"time": 5562, "text": "You get two formulas that may look very different."}, {"time": 5566, "text": "You wanna know if they're really identical."}, {"time": 5569, "text": "What you can do is just pick a random value and evaluate the formulas at that value and see if they agree."}, {"time": 5578, "text": "And you depend on the fact that if the formulas are distinct, then they're gonna disagree a lot."}, {"time": 5586, "text": "And so therefore, a random choice will exhibit the disagreement."}, {"time": 5592, "text": "If there are many ways for the two to disagree and you only need to find one disagreement, then random choice is likely to yield it."}, {"time": 5602, "text": "And in general, so we've just talked about randomized algorithms, but we can look at the probabilistic analysis of algorithms."}, {"time": 5609, "text": "And that gives us an opportunity to step back and as you said, everything we've been talking about is worst case analysis."}, {"time": 5618, "text": "Could you maybe comment on the usefulness and the power of worst case analysis versus best case analysis, average case, probabilistic?"}, {"time": 5631, "text": "How do we think about the future of theoretical computer science, computer science in the kind of analysis we do of algorithms?"}, {"time": 5639, "text": "Does worst case analysis still have a place, an important place?"}, {"time": 5642, "text": "Or do we want to try to move forward towards kind of average case analysis?"}, {"time": 5647, "text": "And what are the challenges there?"}, {"time": 5649, "text": "So if worst case analysis shows that an algorithm is always good, that's fine."}, {"time": 5657, "text": "If worst case analysis is used to show that the problem, that the solution is not always good, then you have to step back and do something else to ask how often will you get a good solution?"}, {"time": 5676, "text": "Just to pause on that for a second, that's so beautifully put because I think we tend to judge algorithms."}, {"time": 5683, "text": "We throw them in the trash the moment their worst case is shown to be bad."}, {"time": 5688, "text": "Right, and that's unfortunate."}, {"time": 5690, "text": "I think a good example is going back to the satisfiability problem."}, {"time": 5700, "text": "There are very powerful programs called SAT solvers which in practice fairly reliably solve instances with many millions of variables that arise in digital design or in proving programs correct in other applications."}, {"time": 5720, "text": "And so in many application areas, even though satisfiability as we've already discussed is NP complete, the SAT solvers will work so well that the people in that discipline tend to think of satisfiability as an easy problem."}, {"time": 5740, "text": "So in other words, just for some reason that we don't entirely understand, the instances that people formulate in designing digital circuits or other applications are such that satisfiability is not hard to check and even searching for a satisfying solution can be done efficiently in practice."}, {"time": 5771, "text": "And there are many examples."}, {"time": 5773, "text": "For example, we talked about the traveling salesman problem."}, {"time": 5778, "text": "So just to refresh our memories, the problem is you've got a set of cities, you have pairwise distances between cities and you want to find a tour through all the cities that minimizes the total cost of all the edges traversed, all the trips between cities."}, {"time": 5798, "text": "The problem is NP hard, but people using integer programming codes together with some other mathematical tricks can solve geometric instances of the problem where the cities are, let's say points in the plane and get optimal solutions to problems with tens of thousands of cities."}, {"time": 5825, "text": "Actually, it'll take a few computer months to solve a problem of that size, but for problems of size a thousand or two, it'll rapidly get optimal solutions, provably optimal solutions, even though again, we know that it's unlikely that the traveling salesman problem can be solved in polynomial time."}, {"time": 5848, "text": "Are there methodologies like rigorous systematic methodologies for, you said in practice."}, {"time": 5858, "text": "In practice, this algorithm's pretty good."}, {"time": 5860, "text": "Are there systematic ways of saying in practice, this algorithm's pretty good?"}, {"time": 5863, "text": "So in other words, average case analysis."}, {"time": 5866, "text": "Or you've also mentioned that average case kind of requires you to understand what the typical case is, typical instances, and that might be really difficult."}, {"time": 5875, "text": "That's very difficult."}, {"time": 5876, "text": "So after I did my original work on showing all these problems through NP complete, I looked around for a way to shed some positive light on combinatorial algorithms."}, {"time": 5893, "text": "And what I tried to do was to study problems, behavior on the average or with high probability."}, {"time": 5904, "text": "But I had to make some assumptions about what's the probability space?"}, {"time": 5909, "text": "What's the sample space?"}, {"time": 5910, "text": "What do we mean by typical problems?"}, {"time": 5913, "text": "That's very hard to say."}, {"time": 5915, "text": "So I took the easy way out and made some very simplistic assumptions."}, {"time": 5920, "text": "So I assumed, for example, that if we were generating a graph with a certain number of vertices and edges, then we would generate the graph by simply choosing one edge at a time at random until we got the right number of edges."}, {"time": 5936, "text": "That's a particular model of random graphs that has been studied mathematically a lot."}, {"time": 5942, "text": "And within that model, I could prove all kinds of wonderful things, I and others who also worked on this."}, {"time": 5950, "text": "So we could show that we know exactly how many edges there have to be in order for there be a so called Hamiltonian circuit."}, {"time": 5964, "text": "That's a cycle that visits each vertex exactly once."}, {"time": 5971, "text": "We know that if the number of edges is a little bit more than n log n, where n is the number of vertices, then such a cycle is very likely to exist."}, {"time": 5984, "text": "And we can give a heuristic that will find it with high probability."}, {"time": 5988, "text": "And the community in which I was working got a lot of results along these lines."}, {"time": 5998, "text": "But the field tended to be rather lukewarm about accepting these results as meaningful because we were making such a simplistic assumption about the kinds of graphs that we would be dealing with."}, {"time": 6013, "text": "So we could show all kinds of wonderful things, it was a great playground, I enjoyed doing it."}, {"time": 6018, "text": "But after a while, I concluded that it didn't have a lot of bite in terms of the practical application."}, {"time": 6031, "text": "Oh the, okay, so there's too much into the world of toy problems."}, {"time": 6036, "text": "That can, okay."}, {"time": 6036, "text": "But all right, is there a way to find nice representative real world impactful instances of a problem on which demonstrate that an algorithm is good?"}, {"time": 6048, "text": "So this is kind of like the machine learning world, that's kind of what they at his best tries to do is find a data set from like the real world and show the performance, all the conferences are all focused on beating the performance of on that real world data set."}, {"time": 6067, "text": "Is there an equivalent in complexity analysis?"}, {"time": 6071, "text": "Not really, Don Knuth started to collect examples of graphs coming from various places."}, {"time": 6081, "text": "So he would have a whole zoo of different graphs that he could choose from and he could study the performance of algorithms on different types of graphs."}, {"time": 6091, "text": "But there it's really important and compelling to be able to define a class of graphs."}, {"time": 6101, "text": "The actual act of defining a class of graphs that you're interested in, it seems to be a non trivial step if we're talking about instances that we should care about in the real world."}, {"time": 6111, "text": "Yeah, there's nothing available there that would be analogous to the training set for supervised learning where you sort of assume that the world has given you a bunch of examples to work with."}, {"time": 6130, "text": "We don't really have that for problems, for combinatorial problems on graphs and networks."}, {"time": 6138, "text": "You know, there's been a huge growth, a big growth of data sets available."}, {"time": 6143, "text": "Do you think some aspect of theoretical computer science might be contradicting my own question while saying it, but will there be some aspect, an empirical aspect of theoretical computer science which will allow the fact that these data sets are huge, we'll start using them for analysis."}, {"time": 6164, "text": "Sort of, you know, if you want to say something about a graph algorithm, you might take a social network like Facebook and looking at subgraphs of that and prove something about the Facebook graph and be respected, and at the same time, be respected in the theoretical computer science community."}, {"time": 6183, "text": "That hasn't been achieved yet, I'm afraid."}, {"time": 6186, "text": "Is that P equals NP, is that impossible?"}, {"time": 6190, "text": "Is it impossible to publish a successful paper in the theoretical computer science community that shows some performance on a real world data set?"}, {"time": 6202, "text": "Or is that really just those are two different worlds?"}, {"time": 6205, "text": "They haven't really come together."}, {"time": 6207, "text": "I would say that there is a field of experimental algorithmics where people, sometimes they're given some family of examples."}, {"time": 6219, "text": "Sometimes they just generate them at random and they report on performance, but there's no convincing evidence that the sample is representative of anything at all."}, {"time": 6237, "text": "So let me ask, in terms of breakthroughs and open problems, what are the most compelling open problems to you and what possible breakthroughs do you see in the near term in terms of theoretical computer science?"}, {"time": 6253, "text": "Well, there are all kinds of relationships among complexity classes that can be studied, just to mention one thing, I wrote a paper with Richard Lipton in 1979, where we asked the following question."}, {"time": 6316, "text": "And that would, in other words, briefly, what you would say in that case is that the problem has small circuits, polynomial size circuits."}, {"time": 6328, "text": "Now, we know that if P is equal to NP, then, in fact, these problems will have small circuits, but what about the converse?"}, {"time": 6337, "text": "Could a problem have small circuits, meaning that an algorithm tailored to any particular size could work well, and yet not be a polynomial time algorithm?"}, {"time": 6348, "text": "That is, you couldn't write it as a single, uniform algorithm, good for all sizes."}, {"time": 6352, "text": "Just to clarify, small circuits for a problem of particular size, by small circuits for a problem of particular size, or even further constraint, small circuit for a particular... No, for all the inputs of that size."}, {"time": 6370, "text": "Is that a trivial problem for a particular instance?"}, {"time": 6373, "text": "So, coming up, an automated way of coming up with a circuit."}, {"time": 6377, "text": "I guess that's just an answer."}, {"time": 6379, "text": "That would be hard, yeah."}, {"time": 6382, "text": "But there's the existential question."}, {"time": 6385, "text": "Everybody talks nowadays about existential questions."}, {"time": 6389, "text": "Existential challenges."}, {"time": 6395, "text": "You could ask the question, does the Hamiltonian circuit problem have a small circuit for every size, for each size, a different small circuit?"}, {"time": 6411, "text": "In other words, could you tailor solutions depending on the size, and get polynomial size?"}, {"time": 6420, "text": "Even if P is not equal to NP."}, {"time": 6426, "text": "That would be fascinating if that's true."}, {"time": 6428, "text": "Yeah, what we proved is that if that were possible, then something strange would happen in complexity theory."}, {"time": 6438, "text": "Some high level class which I could briefly describe, something strange would happen."}, {"time": 6448, "text": "So, I'll take a stab at describing what I mean."}, {"time": 6451, "text": "Sure, let's go there."}, {"time": 6453, "text": "So, we have to define this hierarchy in which the first level of the hierarchy is P, and the second level is NP."}, {"time": 6464, "text": "And what is NP?"}, {"time": 6465, "text": "NP involves statements of the form there exists a something such that something holds."}, {"time": 6473, "text": "So, for example, there exists the coloring such that a graph can be colored with only that number of colors."}, {"time": 6486, "text": "Or there exists a Hamiltonian circuit."}, {"time": 6489, "text": "There's a statement about this graph."}, {"time": 6490, "text": "Yeah, so the NP deals with statements of that kind, that there exists a solution."}, {"time": 6506, "text": "Now, you could imagine a more complicated expression which says for all x there exists a y such that some proposition holds involving both x and y."}, {"time": 6527, "text": "So, that would say, for example, in game theory, for all strategies for the first player, there exists a strategy for the second player such that the first player wins."}, {"time": 6539, "text": "That would be at the second level of the hierarchy."}, {"time": 6543, "text": "The third level would be there exists an A such that for all B there exists a C, that something holds."}, {"time": 6549, "text": "And you could imagine going higher and higher in the hierarchy."}, {"time": 6552, "text": "And you'd expect that the complexity classes that correspond to those different cases would get bigger and bigger."}, {"time": 6567, "text": "What do you mean by bigger and bigger?"}, {"time": 6569, "text": "They'd get harder and harder to solve."}, {"time": 6570, "text": "Harder and harder, right."}, {"time": 6572, "text": "Harder and harder to solve."}, {"time": 6575, "text": "And what Lipton and I showed was that if NP had small circuits, then this hierarchy would collapse down to the second level."}, {"time": 6586, "text": "In other words, you wouldn't get any more mileage by complicating your expressions with three quantifiers or four quantifiers or any number."}, {"time": 6595, "text": "I'm not sure what to make of that exactly."}, {"time": 6597, "text": "Well, I think it would be evidence that NP doesn't have small circuits because something so bizarre would happen."}, {"time": 6607, "text": "But again, it's only evidence, not proof."}, {"time": 6609, "text": "Well, yeah, that's not even evidence because you're saying P is not equal to NP because something bizarre has to happen."}, {"time": 6619, "text": "I mean, that's proof by the lack of bizarreness in our science."}, {"time": 6626, "text": "But it seems like just the very notion of P equals NP would be bizarre."}, {"time": 6633, "text": "So any way you arrive at, there's no way."}, {"time": 6636, "text": "You have to fight the dragon at some point."}, {"time": 6639, "text": "Well, anyway, for whatever it's worth, that's what we proved."}, {"time": 6645, "text": "So that's a potential space of interesting problems."}, {"time": 6650, "text": "Let me ask you about this other world that of machine learning, of deep learning."}, {"time": 6657, "text": "What's your thoughts on the history and the current progress of machine learning field that's often progressed sort of separately as a space of ideas and space of people than the theoretical computer science or just even computer science world?"}, {"time": 6672, "text": "Yeah, it's really very different from the theoretical computer science world because the results about it, algorithmic performance tend to be empirical."}, {"time": 6685, "text": "It's more akin to the world of SAT solvers where we observe that for formulas arising in practice, the solver does well."}, {"time": 6695, "text": "So it's of that type."}, {"time": 6698, "text": "We're moving into the empirical evaluation of algorithms."}, {"time": 6705, "text": "Now, it's clear that there've been huge successes in image processing, robotics, natural language processing, a little less so, but across the spectrum of game playing is another one."}, {"time": 6720, "text": "There've been great successes and one of those effects is that it's not too hard to become a millionaire if you can get a reputation in machine learning and there'll be all kinds of companies that will be willing to offer you the moon because they think that if they have AI at their disposal, then they can solve all kinds of problems."}, {"time": 6745, "text": "But there are limitations."}, {"time": 6750, "text": "One is that the solutions that you get to supervise learning problems through convolutional neural networks seem to perform amazingly well even for inputs that are outside the training set."}, {"time": 6783, "text": "But we don't have any theoretical understanding of why that's true."}, {"time": 6789, "text": "Secondly, the solutions, the networks that you get are very hard to understand and so very little insight comes out."}, {"time": 6799, "text": "So yeah, yeah, they may seem to work on your training set and you may be able to discover whether your photos occur in a different sample of inputs or not, but we don't really know what's going on."}, {"time": 6817, "text": "We don't know the features that distinguish the photographs or the objects are not easy to characterize."}, {"time": 6829, "text": "Well, it's interesting because you mentioned coming up with a small circuit to solve a particular size problem."}, {"time": 6836, "text": "It seems that neural networks are kind of small circuits."}, {"time": 6839, "text": "In a way, yeah."}, {"time": 6841, "text": "But they're not programs."}, {"time": 6842, "text": "Sort of like the things you've designed are algorithms, programs, algorithms."}, {"time": 6848, "text": "Neural networks aren't able to develop algorithms to solve a problem."}, {"time": 6854, "text": "Well, they are algorithms."}, {"time": 6856, "text": "It's just that they're..."}, {"time": 6858, "text": "But sort of, yeah, it could be a semantic question, but there's not a algorithmic style manipulation of the input."}, {"time": 6873, "text": "Perhaps you could argue there is."}, {"time": 6877, "text": "It feels a lot more like a function of the input."}, {"time": 6880, "text": "Yeah, it's a function."}, {"time": 6881, "text": "It's a computable function."}, {"time": 6883, "text": "Once you have the network, you can simulate it on a given input and figure out the output."}, {"time": 6891, "text": "But if you're trying to recognize images, then you don't know what features of the image are really being determinant of what the circuit is doing."}, {"time": 6909, "text": "The circuit is sort of very intricate and it's not clear that the simple characteristics that you're looking for, the edges of the objects or whatever they may be, they're not emerging from the structure of the circuit."}, {"time": 6929, "text": "Well, it's not clear to us humans, but it's clear to the circuit."}, {"time": 6934, "text": "I mean, it's not clear to sort of the elephant how the human brain works, but it's clear to us humans, we can explain to each other our reasoning and that's why the cognitive science and psychology field exists."}, {"time": 6952, "text": "Maybe the whole thing of being explainable to humans is a little bit overrated."}, {"time": 6957, "text": "Oh, maybe, yeah."}, {"time": 6959, "text": "I guess you can say the same thing about our brain that when we perform acts of cognition, we have no idea how we do it really."}, {"time": 6968, "text": "We do though, I mean, at least for the visual system, the auditory system and so on, we do get some understanding of the principles that they operate under, but for many deeper cognitive tasks, we don't have that."}, {"time": 6986, "text": "Let me ask, you've also been doing work on bioinformatics."}, {"time": 6993, "text": "Does it amaze you that the fundamental building blocks?"}, {"time": 6996, "text": "So if we take a step back and look at us humans, the building blocks used by evolution to build us intelligent human beings is all contained there in our DNA."}, {"time": 7008, "text": "It's amazing and what's really amazing is that we are beginning to learn how to edit DNA, which is very, very, very fascinating."}, {"time": 7025, "text": "This ability to take a sequence, find it in the genome and do something to it."}, {"time": 7038, "text": "I mean, that's really taking our biological systems towards the world of algorithms."}, {"time": 7044, "text": "Yeah, but it raises a lot of questions."}, {"time": 7050, "text": "You have to distinguish between doing it on an individual or doing it on somebody's germline, which means that all of their descendants will be affected."}, {"time": 7060, "text": "So that's like an ethical."}, {"time": 7062, "text": "Yeah, so it raises very severe ethical questions."}, {"time": 7070, "text": "And even doing it on individuals, there's a lot of hubris involved that you can assume that knocking out a particular gene is gonna be beneficial because you don't know what the side effects are going to be."}, {"time": 7088, "text": "So we have this wonderful new world of gene editing, which is very, very impressive and it could be used in agriculture, it could be used in medicine in various ways."}, {"time": 7112, "text": "But very serious ethical problems arise."}, {"time": 7117, "text": "What are to you the most interesting places where algorithms, sort of the ethical side is an exceptionally challenging thing that I think we're going to have to tackle with all of genetic engineering."}, {"time": 7131, "text": "But on the algorithmic side, there's a lot of benefit that's possible."}, {"time": 7135, "text": "So is there areas where you see exciting possibilities for algorithms to help model, optimize, study biological systems?"}, {"time": 7146, "text": "Yeah, I mean, we can certainly analyze genomic data to figure out which genes are operative in the cell and under what conditions and which proteins affect one another, which proteins physically interact."}, {"time": 7167, "text": "We can sequence proteins and modify them."}, {"time": 7172, "text": "Is there some aspect of that that's a computer science problem or is that still fundamentally a biology problem?"}, {"time": 7179, "text": "Well, it's a big data, it's a statistical big data problem for sure."}, {"time": 7237, "text": "You dedicate your 1985 Turing Award lecture to the memory of your father."}, {"time": 7242, "text": "What's your fondest memory of your dad?"}, {"time": 7253, "text": "Seeing him standing in front of a class at the blackboard, drawing perfect circles by hand and showing his ability to attract the interest of the motley collection of eighth grade students that he was teaching."}, {"time": 7279, "text": "When did you get a chance to see him draw the perfect circles?"}, {"time": 7284, "text": "On rare occasions, I would get a chance to sneak into his classroom and observe him."}, {"time": 7293, "text": "And I think he was at his best in the classroom."}, {"time": 7296, "text": "I think he really came to life and had fun, not only teaching, but engaging in chit chat with the students and ingratiating himself with the students."}, {"time": 7313, "text": "And what I inherited from that is the great desire to be a teacher."}, {"time": 7321, "text": "I retired recently and a lot of my former students came, students with whom I had done research or who had read my papers or who had been in my classes."}]}]