[{"title": "David Silver: AlphaGo, AlphaZero, and Deep Reinforcement Learning | Lex Fridman Podcast #86", "id": "uPUEq8d73JI", "quotes": [{"time": 283, "text": "How did you think about computers back then?"}, {"time": 286, "text": "Like the magical aspect of it, that you can write a program and there's this thing that you just gave birth to that's able to create sort of visual elements and live in its own."}, {"time": 297, "text": "Or did you not think of it in those romantic notions?"}, {"time": 299, "text": "Was it more like, oh, that's cool."}, {"time": 302, "text": "I can solve some puzzles."}, {"time": 305, "text": "It was always more than solving puzzles."}, {"time": 306, "text": "It was something where, you know, there was this limitless possibilities."}, {"time": 313, "text": "Once you have a computer in front of you, you can do anything with it."}, {"time": 316, "text": "I used to play with Lego with the same feeling."}, {"time": 318, "text": "You can make anything you want out of Lego, but even more so with a computer, you know, you're not constrained by the amount of kit you've got."}, {"time": 324, "text": "And so I was fascinated by it and started pulling out the user guide and the advanced user guide and then learning."}, {"time": 330, "text": "So I started in basic and then later 6502."}, {"time": 334, "text": "My father also became interested in this machine and gave up his career to go back to school and study for a master's degree in artificial intelligence, funnily enough, at Essex University when I was seven."}, {"time": 348, "text": "So I was exposed to those things at an early age."}, {"time": 352, "text": "He showed me how to program in prologue and do things like querying your family tree."}, {"time": 357, "text": "And those are some of my earliest memories of trying to figure things out on a computer."}, {"time": 364, "text": "Those are the early steps in computer science programming, but when did you first fall in love with artificial intelligence or with the ideas, the dreams of AI?"}, {"time": 374, "text": "I think it was really when I went to study at university."}, {"time": 379, "text": "So I was an undergrad at Cambridge and studying computer science."}, {"time": 383, "text": "And I really started to question, you know, what really are the goals?"}, {"time": 389, "text": "What's the goal?"}, {"time": 390, "text": "Where do we want to go with computer science?"}, {"time": 392, "text": "And it seemed to me that the only step of major significance to take was to try and recreate something akin to human intelligence."}, {"time": 404, "text": "If we could do that, that would be a major leap forward."}, {"time": 407, "text": "And that idea, I certainly wasn't the first to have it, but it, you know, nestled within me somewhere and became like a bug."}, {"time": 415, "text": "You know, I really wanted to crack that problem."}, {"time": 418, "text": "So you thought it was, like you had a notion that this is something that human beings can do, that it is possible to create an intelligent machine."}, {"time": 427, "text": "Well, I mean, unless you believe in something metaphysical, then what are our brains doing?"}, {"time": 433, "text": "Well, at some level they're information processing systems, which are able to take whatever information is in there, transform it through some form of program and produce some kind of output, which enables that human being to do all the amazing things that they can do in this incredible world."}, {"time": 451, "text": "So then do you remember the first time you've written a program that, because you also had an interest in games."}, {"time": 460, "text": "Do you remember the first time you were in a program that beat you in a game?"}, {"time": 465, "text": "That more beat you at anything?"}, {"time": 467, "text": "Sort of achieved super David Silver level performance?"}, {"time": 474, "text": "So I used to work in the games industry."}, {"time": 476, "text": "So for five years I programmed games for my first job."}, {"time": 481, "text": "So it was an amazing opportunity to get involved in a startup company."}, {"time": 485, "text": "And so I was involved in building AI at that time."}, {"time": 492, "text": "And so for sure there was a sense of building handcrafted, what people used to call AI in the games industry, which I think is not really what we might think of as AI in its fullest sense, but something which is able to take actions and in a way which makes things interesting and challenging for the human player."}, {"time": 515, "text": "And at that time I was able to build these handcrafted agents, which in certain limited cases could do things which were able to do better than me, but mostly in these kind of Twitch like scenarios where they were able to do things faster or because they had some pattern which was able to exploit repeatedly."}, {"time": 535, "text": "I think if we're talking about real AI, the first experience for me came after that when I realized that this path I was on wasn't taking me towards, it wasn't dealing with that bug which I still had inside me to really understand intelligence and try and solve it."}, {"time": 554, "text": "That everything people were doing in games was short term fixes rather than long term vision."}, {"time": 559, "text": "And so I went back to study for my PhD, which was funny enough trying to apply reinforcement learning to the game of Go."}, {"time": 567, "text": "And I built my first Go program using reinforcement learning, a system which would by trial and error play against itself and was able to learn which patterns were actually helpful to predict whether it was gonna win or lose the game and then choose the moves that led to the combination of patterns that would mean that you're more likely to win."}, {"time": 587, "text": "And that system, that system beat me."}, {"time": 590, "text": "And how did that make you feel?"}, {"time": 593, "text": "Made me feel good."}, {"time": 594, "text": "I mean, was there sort of the, yeah, it's a mix of a sort of excitement and was there a tinge of sort of like, almost like a fearful awe?"}, {"time": 604, "text": "You know, it's like in space, 2001 Space Odyssey kind of realizing that you've created something that, you know, that's achieved human level intelligence in this one particular little task."}, {"time": 621, "text": "And in that case, I suppose neural networks weren't involved."}, {"time": 624, "text": "There were no neural networks in those days."}, {"time": 626, "text": "This was pre deep learning revolution."}, {"time": 630, "text": "But it was a principled self learning system based on a lot of the principles which people are still using in deep reinforcement learning."}, {"time": 640, "text": "How did I feel?"}, {"time": 641, "text": "I think I found it immensely satisfying that a system which was able to learn from first principles for itself was able to reach the point that it was understanding this domain better than I could and able to outwit me."}, {"time": 660, "text": "I don't think it was a sense of awe."}, {"time": 661, "text": "It was a sense that satisfaction, that something I felt should work had worked."}, {"time": 668, "text": "So to me, AlphaGo, and I don't know how else to put it, but to me, AlphaGo and AlphaGo Zero, mastering the game of Go is again, to me, the most profound and inspiring moment in the history of artificial intelligence."}, {"time": 683, "text": "So you're one of the key people behind this achievement and I'm Russian."}, {"time": 687, "text": "So I really felt the first sort of seminal achievement when Deep Blue beat Garry Kasparov in 1987."}, {"time": 694, "text": "So as far as I know, the AI community at that point largely saw the game of Go as unbeatable in AI using the sort of the state of the art brute force methods, search methods."}, {"time": 708, "text": "Even if you consider, at least the way I saw it, even if you consider arbitrary exponential scaling of compute, Go would still not be solvable, hence why it was thought to be impossible."}, {"time": 721, "text": "So given that the game of Go was impossible to master, what was the dream for you?"}, {"time": 729, "text": "You just mentioned your PhD thesis of building the system that plays Go."}, {"time": 734, "text": "What was the dream for you that you could actually build a computer program that achieves world class, not necessarily beats the world champion, but achieves that kind of level of playing Go?"}, {"time": 744, "text": "First of all, thank you, that's very kind words."}, {"time": 747, "text": "And funnily enough, I just came from a panel where I was actually in a conversation with Garry Kasparov and Murray Campbell, who was the author of Deep Blue."}, {"time": 758, "text": "And it was their first meeting together since the match."}, {"time": 763, "text": "So that just occurred yesterday."}, {"time": 764, "text": "So I'm literally fresh from that experience."}, {"time": 767, "text": "So these are amazing moments when they happen, but where did it all start?"}, {"time": 772, "text": "Well, for me, it started when I became fascinated in the game of Go."}, {"time": 776, "text": "So Go for me, I've grown up playing games."}, {"time": 779, "text": "I've always had a fascination in board games."}, {"time": 781, "text": "I played chess as a kid, I played Scrabble as a kid."}, {"time": 786, "text": "When I was at university, I discovered the game of Go."}, {"time": 788, "text": "And to me, it just blew all of those other games out of the water."}, {"time": 792, "text": "It was just so deep and profound in its complexity with endless levels to it."}, {"time": 797, "text": "What I discovered was that I could devote endless hours to this game."}, {"time": 805, "text": "And I knew in my heart of hearts that no matter how many hours I would devote to it, I would never become a grandmaster, or there was another path."}, {"time": 815, "text": "And the other path was to try and understand how you could get some other intelligence to play this game better than I would be able to."}, {"time": 823, "text": "And so even in those days, I had this idea that, what if, what if it was possible to build a program that could crack this?"}, {"time": 831, "text": "And as I started to explore the domain, I discovered that this was really the domain where people felt deeply that if progress could be made in Go, it would really mean a giant leap forward for AI."}, {"time": 846, "text": "It was the challenge where all other approaches had failed."}, {"time": 850, "text": "This is coming out of the era you mentioned, which was in some sense, the golden era for the classical methods of AI, like heuristic search."}, {"time": 859, "text": "In the 90s, they all fell one after another, not just chess with deep blue, but checkers, backgammon, Othello."}, {"time": 868, "text": "There were numerous cases where systems built on top of heuristic search methods with these high performance systems had been able to defeat the human world champion in each of those domains."}, {"time": 881, "text": "And yet in that same time period, there was a million dollar prize available for the game of Go, for the first system to be a human professional player."}, {"time": 892, "text": "And at the end of that time period, in year 2000 when the prize expired, the strongest Go program in the world was defeated by a nine year old child when that nine year old child was giving nine free moves to the computer at the start of the game to try and even things up."}, {"time": 909, "text": "And computer Go expert beat that same strongest program with 29 handicapped stones, 29 free moves."}, {"time": 918, "text": "So that's what the state of affairs was when I became interested in this problem in around 2003 when I started working on computer Go."}, {"time": 929, "text": "There was nothing, there was very, very little in the way of progress towards meaningful performance, again, anything approaching human level."}, {"time": 939, "text": "And so people, it wasn't through lack of effort, people had tried many, many things."}, {"time": 944, "text": "And so there was a strong sense that something different would be required for Go than had been needed for all of these other domains where AI had been successful."}, {"time": 954, "text": "And maybe the single clearest example is that Go, unlike those other domains, had this kind of intuitive property that a Go player would look at a position and say, hey, here's this mess of black and white stones."}, {"time": 969, "text": "But from this mess, oh, I can predict that this part of the board has become my territory, this part of the board has become your territory, and I've got this overall sense that I'm gonna win and that this is about the right move to play."}, {"time": 982, "text": "And that intuitive sense of judgment, of being able to evaluate what's going on in a position, it was pivotal to humans being able to play this game and something that people had no idea how to put into computers."}, {"time": 995, "text": "So this question of how to evaluate a position, how to come up with these intuitive judgments was the key reason why Go was so hard in addition to its enormous search space, and the reason why methods which had succeeded so well elsewhere failed in Go."}, {"time": 1013, "text": "And so people really felt deep down that in order to crack Go we would need to get something akin to human intuition."}, {"time": 1020, "text": "And if we got something akin to human intuition, we'd be able to solve many, many more problems in AI."}, {"time": 1026, "text": "So for me, that was the moment where it's like, okay, this is not just about playing the game of Go, this is about something profound."}, {"time": 1033, "text": "And it was back to that bug which had been itching me all those years."}, {"time": 1037, "text": "This is the opportunity to do something meaningful and transformative, and I guess a dream was born."}, {"time": 1045, "text": "So almost this realization that you need to find, formulate Go as a kind of a prediction problem versus a search problem was the intuition."}, {"time": 1054, "text": "I mean, maybe that's the wrong crude term, but to give it the ability to kind of intuit things about positional structure of the board."}, {"time": 1067, "text": "Now, okay, but what about the learning part of it?"}, {"time": 1071, "text": "Did you have a sense that you have to, that learning has to be part of the system?"}, {"time": 1077, "text": "Again, something that hasn't really as far as I think, except with TD Gammon in the 90s with RL a little bit, hasn't been part of those state of the art game playing systems."}, {"time": 1088, "text": "So I strongly felt that learning would be necessary."}, {"time": 1092, "text": "And that's why my PhD topic back then was trying to apply reinforcement learning to the game of Go and not just learning of any type, but I felt that the only way to really have a system to progress beyond human levels of performance wouldn't just be to mimic how humans do it, but to understand for themselves."}, {"time": 1113, "text": "And how else can a machine hope to understand what's going on except through learning?"}, {"time": 1119, "text": "If you're not learning, what else are you doing?"}, {"time": 1120, "text": "Well, you're putting all the knowledge into the system."}, {"time": 1122, "text": "And that just feels like something which decades of AI have told us is maybe not a dead end, but certainly has a ceiling to the capabilities."}, {"time": 1133, "text": "It's known as the knowledge acquisition bottleneck, that the more you try to put into something, the more brittle the system becomes."}, {"time": 1140, "text": "And so you just have to have learning."}, {"time": 1142, "text": "You have to have learning."}, {"time": 1143, "text": "That's the only way you're going to be able to get a system which has sufficient knowledge in it, millions and millions of pieces of knowledge, billions, trillions of a form that it can actually apply for itself and understand how those billions and trillions of pieces of knowledge can be leveraged in a way which will actually lead it towards its goal without conflict or other issues."}, {"time": 1167, "text": "Yeah, I mean, if I put myself back in that time, I just wouldn't think like that."}, {"time": 1173, "text": "Without a good demonstration of RL, I would think more in the symbolic AI, like not learning, but sort of a simulation of knowledge base, like a growing knowledge base, but it would still be sort of pattern based, like basically have little rules that you kind of assemble together into a large knowledge base."}, {"time": 1196, "text": "Well, in a sense, that was the state of the art back then."}, {"time": 1249, "text": "And although not all of the pieces were handcrafted, the overall effect was nevertheless still brittle, and it was hard to make all these pieces work well together."}, {"time": 1260, "text": "And so really, what I was pressing for and the main innovation of the approach I took was to go back to first principles and say, well, let's back off that and try and find a principled approach where the system can learn for itself, just from the outcome, like learn for itself."}, {"time": 1279, "text": "If you try something, did that help or did it not help?"}, {"time": 1282, "text": "And only through that procedure can you arrive at knowledge, which is verified."}, {"time": 1287, "text": "The system has to verify it for itself, not relying on any other third party to say this is right or this is wrong."}, {"time": 1293, "text": "And so that principle was already very important in those days, but unfortunately, we were missing some important pieces back then."}, {"time": 1303, "text": "So before we dive into maybe discussing the beauty of reinforcement learning, let's take a step back, we kind of skipped it a bit, but the rules of the game of Go, what the elements of it perhaps contrasting to chess that sort of you really enjoyed as a human being, and also that make it really difficult as a AI machine learning problem."}, {"time": 1333, "text": "So the game of Go has remarkably simple rules."}, {"time": 1336, "text": "In fact, so simple that people have speculated that if we were to meet alien life at some point, that we wouldn't be able to communicate with them, but we would be able to play Go with them."}, {"time": 1346, "text": "Probably have discovered the same rule set."}, {"time": 1348, "text": "So the game is played on a 19 by 19 grid, and you play on the intersections of the grid and the players take turns."}, {"time": 1355, "text": "And the aim of the game is very simple."}, {"time": 1357, "text": "It's to surround as much territory as you can, as many of these intersections with your stones and to surround more than your opponent does."}, {"time": 1366, "text": "And the only nuance to the game is that if you fully surround your opponent's piece, then you get to capture it and remove it from the board and it counts as your own territory."}, {"time": 1374, "text": "Now from those very simple rules, immense complexity arises."}, {"time": 1378, "text": "There's kind of profound strategies in how to surround territory, how to kind of trade off between making solid territory yourself now compared to building up influence that will help you acquire territory later in the game, how to connect groups together, how to keep your own groups alive, which patterns of stones are most useful compared to others."}, {"time": 1401, "text": "There's just immense knowledge."}, {"time": 1403, "text": "And human Go players have played this game for, it was discovered thousands of years ago, and human Go players have built up this immense knowledge base over the years."}, {"time": 1413, "text": "It's studied very deeply and played by something like 50 million players across the world, mostly in China, Japan, and Korea, where it's an important part of the culture, so much so that it's considered one of the four ancient arts that was required by Chinese scholars."}, {"time": 1429, "text": "So there's a deep history there."}, {"time": 1431, "text": "But there's interesting qualities."}, {"time": 1433, "text": "So if I sort of compare to chess, chess is in the same way as it is in Chinese culture for Go, and chess in Russia is also considered one of the sacred arts."}, {"time": 1443, "text": "So if we contrast sort of Go with chess, there's interesting qualities about Go."}, {"time": 1449, "text": "Maybe you can correct me if I'm wrong, but the evaluation of a particular static board is not as reliable."}, {"time": 1458, "text": "Like you can't, in chess you can kind of assign points to the different units, and it's kind of a pretty good measure of who's winning, who's losing."}, {"time": 1467, "text": "It's not so clear."}, {"time": 1469, "text": "Yeah, so in the game of Go, you find yourself in a situation where both players have played the same number of stones."}, {"time": 1476, "text": "Actually, captures at a strong level of play happen very rarely, which means that at any moment in the game, you've got the same number of white stones and black stones."}, {"time": 1483, "text": "And the only thing which differentiates how well you're doing is this intuitive sense of where are the territories ultimately going to form on this board?"}, {"time": 1492, "text": "And if you look at the complexity of a real Go position, it's mind boggling that kind of question of what will happen in 300 moves from now when you see just a scattering of 20 white and black stones intermingled."}, {"time": 1507, "text": "And so that challenge is the reason why position evaluation is so hard in Go compared to other games."}, {"time": 1517, "text": "In addition to that, it has an enormous search space."}, {"time": 1519, "text": "So there's around 10 to the 170 positions in the game of Go."}, {"time": 1524, "text": "That's an astronomical number."}, {"time": 1526, "text": "And that search space is so great that traditional heuristic search methods that were so successful in things like Deep Blue and chess programs just kind of fall over in Go."}, {"time": 1536, "text": "So at which point did reinforcement learning enter your life, your research life, your way of thinking?"}, {"time": 1543, "text": "We just talked about learning, but reinforcement learning is a very particular kind of learning."}, {"time": 1549, "text": "One that's both philosophically sort of profound, but also one that's pretty difficult to get to work as if we look back in the early days."}, {"time": 1558, "text": "So when did that enter your life and how did that work progress?"}, {"time": 1562, "text": "So I had just finished working in the games industry at this startup company."}, {"time": 1567, "text": "And I took a year out to discover for myself exactly which path I wanted to take."}, {"time": 1574, "text": "I knew I wanted to study intelligence, but I wasn't sure what that meant at that stage."}, {"time": 1579, "text": "I really didn't feel I had the tools to decide on exactly which path I wanted to follow."}, {"time": 1584, "text": "So during that year, I read a lot."}, {"time": 1587, "text": "And one of the things I read was Saturn and Barto, the sort of seminal textbook on an introduction to reinforcement learning."}, {"time": 1595, "text": "And when I read that textbook, I just had this resonating feeling that this is what I understood intelligence to be."}, {"time": 1607, "text": "And this was the path that I felt would be necessary to go down to make progress in AI."}, {"time": 1615, "text": "So I got in touch with Rich Saturn and asked him if he would be interested in supervising me on a PhD thesis in computer go."}, {"time": 1627, "text": "And he basically said that if he's still alive, he'd be happy to."}, {"time": 1635, "text": "But unfortunately, he'd been struggling with very serious cancer for some years."}, {"time": 1641, "text": "And he really wasn't confident at that stage that he'd even be around to see the end event."}, {"time": 1646, "text": "But fortunately, that part of the story worked out very happily."}, {"time": 1649, "text": "And I found myself out there in Alberta."}, {"time": 1652, "text": "They've got a great games group out there with a history of fantastic work in board games as well, as Rich Saturn, the father of RL."}, {"time": 1660, "text": "So it was the natural place for me to go in some sense to study this question."}, {"time": 1665, "text": "And the more I looked into it, the more strongly I felt that this wasn't just the path to progress in computer go."}, {"time": 1676, "text": "But really, this was the thing I'd been looking for."}, {"time": 1679, "text": "This was really an opportunity to frame what intelligence means."}, {"time": 1688, "text": "Like what are the goals of AI in a clear, single clear problem definition, such that if we're able to solve that clear single problem definition, in some sense, we've cracked the problem of AI."}, {"time": 1701, "text": "So to you, reinforcement learning ideas, at least sort of echoes of it, would be at the core of intelligence."}, {"time": 1709, "text": "It is at the core of intelligence."}, {"time": 1711, "text": "And if we ever create a human level intelligence system, it would be at the core of that kind of system."}, {"time": 1717, "text": "Let me say it this way, that I think it's helpful to separate out the problem from the solution."}, {"time": 1752, "text": "And so in that sense, I feel that it gives us a path, maybe not the only path, but a path towards AI."}, {"time": 1760, "text": "And so do I think that any system in the future that's solved AI would have to have RL within it?"}, {"time": 1769, "text": "Well, I think if you ask that, you're asking about the solution methods."}, {"time": 1773, "text": "I would say that if we have such a thing, it would be a solution to the RL problem."}, {"time": 1777, "text": "Now, what particular methods have been used to get there?"}, {"time": 1781, "text": "Well, we should keep an open mind about the best approaches to actually solve any problem."}, {"time": 1785, "text": "And the things we have right now for reinforcement learning, maybe I believe they've got a lot of legs, but maybe we're missing some things."}, {"time": 1794, "text": "Maybe there's gonna be better ideas."}, {"time": 1796, "text": "I think we should keep, let's remain modest and we're at the early days of this field and there are many amazing discoveries ahead of us."}, {"time": 1804, "text": "For sure, the specifics, especially of the different kinds of RL approaches currently, there could be other things that fall into the very large umbrella of RL."}, {"time": 1813, "text": "But if it's okay, can we take a step back and kind of ask the basic question of what is to you reinforcement learning?"}, {"time": 1822, "text": "So reinforcement learning is the study and the science and the problem of intelligence in the form of an agent that interacts with an environment."}, {"time": 1835, "text": "So the problem you're trying to solve is represented by some environment, like the world in which that agent is situated."}, {"time": 1840, "text": "And the goal of RL is clear that the agent gets to take actions."}, {"time": 1845, "text": "Those actions have some effect on the environment and the environment gives back an observation to the agent saying, this is what you see or sense."}, {"time": 1852, "text": "And one special thing which it gives back is called the reward signal, how well it's doing in the environment."}, {"time": 1858, "text": "And the reinforcement learning problem is to simply take actions over time so as to maximize that reward signal."}, {"time": 1867, "text": "So a couple of basic questions."}, {"time": 1871, "text": "What types of RL approaches are there?"}, {"time": 1873, "text": "So I don't know if there's a nice brief inwards way to paint the picture of sort of value based, model based, policy based reinforcement learning."}, {"time": 1885, "text": "Yeah, so now if we think about, okay, so there's this ambitious problem definition of RL."}, {"time": 1891, "text": "It's really, it's truly ambitious."}, {"time": 1893, "text": "It's trying to capture and encircle all of the things in which an agent interacts with an environment and say, well, how can we formalize and understand what it means to crack that?"}, {"time": 1901, "text": "Now let's think about the solution method."}, {"time": 1903, "text": "Well, how do you solve a really hard problem like that?"}, {"time": 1906, "text": "Well, one approach you can take is to decompose that very hard problem into pieces that work together to solve that hard problem."}, {"time": 1915, "text": "And so you can kind of look at the decomposition that's inside the agent's head, if you like, and ask, well, what form does that decomposition take?"}, {"time": 1923, "text": "And some of the most common pieces that people use when they're kind of putting the solution method together, some of the most common pieces that people use are whether or not that solution has a value function."}, {"time": 1934, "text": "That means, is it trying to predict, explicitly trying to predict how much reward it will get in the future?"}, {"time": 1940, "text": "Does it have a representation of a policy?"}, {"time": 1942, "text": "That means something which is deciding how to pick actions."}, {"time": 1945, "text": "Is that decision making process explicitly represented?"}, {"time": 1948, "text": "And is there a model in the system?"}, {"time": 1951, "text": "Is there something which is explicitly trying to predict what will happen in the environment?"}, {"time": 1956, "text": "And so those three pieces are, to me, some of the most common building blocks."}, {"time": 1962, "text": "And I understand the different choices in RL as choices of whether or not to use those building blocks when you're trying to decompose the solution."}, {"time": 1972, "text": "Should I have a value function represented?"}, {"time": 1974, "text": "Should I have a policy represented?"}, {"time": 1976, "text": "Should I have a model represented?"}, {"time": 1978, "text": "And there are combinations of those pieces and, of course, other things that you could add into the picture as well."}, {"time": 1983, "text": "But those three fundamental choices give rise to some of the branches of RL with which we're very familiar."}, {"time": 1988, "text": "And so those, as you mentioned, there is a choice of what's specified or modeled explicitly."}, {"time": 1997, "text": "And the idea is that all of these are somehow implicitly learned within the system."}, {"time": 2003, "text": "So it's almost a choice of how you approach a problem."}, {"time": 2008, "text": "Do you see those as fundamental differences or are these almost like small specifics, like the details of how you solve a problem but they're not fundamentally different from each other?"}, {"time": 2020, "text": "I think the fundamental idea is maybe at the higher level."}, {"time": 2025, "text": "The fundamental idea is the first step of the decomposition is really to say, well, how are we really gonna solve any kind of problem where you're trying to figure out how to take actions and just from this stream of observations, you've got some agent situated in its sensory motor stream and getting all these observations in, getting to take these actions, and what should it do?"}, {"time": 2046, "text": "How can you even broach that problem?"}, {"time": 2047, "text": "You know, maybe the complexity of the world is so great that you can't even imagine how to build a system that would understand how to deal with that."}, {"time": 2055, "text": "And so the first step of this decomposition is to say, well, you have to learn."}, {"time": 2059, "text": "The system has to learn for itself."}, {"time": 2062, "text": "And so note that the reinforcement learning problem doesn't actually stipulate that you have to learn."}, {"time": 2067, "text": "Like you could maximize your rewards without learning."}, {"time": 2069, "text": "It would just, wouldn't do a very good job of it."}, {"time": 2072, "text": "So learning is required because it's the only way to achieve good performance in any sufficiently large and complex environment."}, {"time": 2080, "text": "So that's the first step."}, {"time": 2082, "text": "And so that step gives commonality to all of the other pieces, because now you might ask, well, what should you be learning?"}, {"time": 2088, "text": "What does learning even mean?"}, {"time": 2089, "text": "You know, in this sense, you know, learning might mean, well, you're trying to update the parameters of some system, which is then the thing that actually picks the actions."}, {"time": 2100, "text": "And those parameters could be representing anything."}, {"time": 2103, "text": "They could be parameterizing a value function or a model or a policy."}, {"time": 2108, "text": "And so in that sense, there's a lot of commonality in that whatever is being represented there is the thing which is being learned, and it's being learned with the ultimate goal of maximizing rewards."}, {"time": 2117, "text": "But the way in which you decompose the problem is really what gives the semantics to the whole system."}, {"time": 2123, "text": "Like, are you trying to learn something to predict well, like a value function or a model?"}, {"time": 2128, "text": "Are you learning something to perform well, like a policy?"}, {"time": 2131, "text": "And the form of that objective is kind of giving the semantics to the system."}, {"time": 2136, "text": "And so it really is, at the next level down, a fundamental choice, and we have to make those fundamental choices as system designers or enable our algorithms to be able to learn how to make those choices for themselves."}, {"time": 2149, "text": "So then the next step you mentioned, the very first thing you have to deal with is, can you even take in this huge stream of observations and do anything with it?"}, {"time": 2161, "text": "So the natural next basic question is, what is deep reinforcement learning?"}, {"time": 2168, "text": "And what is this idea of using neural networks to deal with this huge incoming stream?"}, {"time": 2174, "text": "So amongst all the approaches for reinforcement learning, deep reinforcement learning is one family of solution methods that tries to utilize powerful representations that are offered by neural networks to represent any of these different components of the solution, of the agent, like whether it's the value function or the model or the policy."}, {"time": 2201, "text": "The idea of deep learning is to say, well, here's a powerful toolkit that's so powerful that it's universal in the sense that it can represent any function and it can learn any function."}, {"time": 2212, "text": "And so if we can leverage that universality, that means that whatever we need to represent for our policy or for our value function or for a model, deep learning can do it."}, {"time": 2265, "text": "Nevertheless, the fact that neural networks are able to learn incredibly complex representations that allow you to do the policy, the model or the value function is, at least to my mind, exceptionally beautiful and surprising."}, {"time": 2282, "text": "Like, was it surprising to you?"}, {"time": 2287, "text": "Can you still believe it works as well as it does?"}, {"time": 2290, "text": "Do you have good intuition about why it works at all and works as well as it does?"}, {"time": 2298, "text": "I think, let me take two parts to that question."}, {"time": 2302, "text": "I think it's not surprising to me that the idea of reinforcement learning works because in some sense, I think it's the, I feel it's the only thing which can ultimately."}, {"time": 2316, "text": "And so I feel we have to address it and there must be success as possible because we have examples of intelligence."}, {"time": 2324, "text": "And it must at some level be able to, possible to acquire experience and use that experience to do better in a way which is meaningful to environments of the complexity that humans can deal with."}, {"time": 2337, "text": "It must be."}, {"time": 2338, "text": "Am I surprised that our current systems can do as well as they can do?"}, {"time": 2377, "text": "And yet the big surprise is that learning continues and these what appear to be local optima turn out not to be because in high dimensions when we make really big neural nets, there's always a way out and there's a way to go even lower and then you're still not in a local optima because there's some other pathway that will take you out and take you lower still."}, {"time": 2399, "text": "And so no matter where you are, learning can proceed and do better and better and better without bound."}, {"time": 2406, "text": "And so that is a surprising and beautiful property of neural nets which I find elegant and beautiful and somewhat shocking that it turns out to be the case."}, {"time": 2420, "text": "As you said, which I really like to our low dimensional intuitions, that's surprising."}, {"time": 2427, "text": "Yeah, we're very tuned to working within a three dimensional environment."}, {"time": 2433, "text": "And so to start to visualize what a billion dimensional neural network surface that you're trying to optimize over, what that even looks like is very hard for us."}, {"time": 2445, "text": "And so I think that really, if you try to account for the, essentially the AI winter where people gave up on neural networks, I think it's really down to that lack of ability to generalize from low dimensions to high dimensions because back then we were in the low dimensional case."}, {"time": 2465, "text": "People could only build neural nets with 50 nodes in them or something."}, {"time": 2471, "text": "And to imagine that it might be possible to build a billion dimensional neural net and it might have a completely different, qualitatively different property was very hard to anticipate."}, {"time": 2481, "text": "And I think even now we're starting to build the theory to support that."}, {"time": 2486, "text": "And it's incomplete at the moment, but all of the theory seems to be pointing in the direction that indeed this is an approach which truly is universal both in its representational capacity, which was known, but also in its learning ability, which is surprising."}, {"time": 2500, "text": "And it makes one wonder what else we're missing due to our low dimensional intuitions that will seem obvious once it's discovered."}, {"time": 2511, "text": "I often wonder, when we one day do have AIs which are superhuman in their abilities to understand the world, what will they think of the algorithms that we developed back now?"}, {"time": 2528, "text": "Will it be looking back at these days and thinking that, will we look back and feel that these algorithms were naive first steps or will they still be the fundamental ideas which are used even in 100,000, 10,000 years?"}, {"time": 2546, "text": "It's hard to know."}, {"time": 2547, "text": "They'll watch back to this conversation and with a smile, maybe a little bit of a laugh."}, {"time": 2554, "text": "I mean, my sense is, I think just like when we used to think that the sun revolved around the earth, they'll see our systems of today, reinforcement learning as too complicated, that the answer was simple all along."}, {"time": 2574, "text": "There's something, just like you said in the game of Go, I mean, I love the systems of like cellular automata, that there's simple rules from which incredible complexity emerges, so it feels like there might be some really simple approaches, just like Rich Sutton says, right?"}, {"time": 2592, "text": "These simple methods with compute over time seem to prove to be the most effective."}, {"time": 2600, "text": "I 100% agree."}, {"time": 2601, "text": "I think that if we try to anticipate what will generalize well into the future, I think it's likely to be the case that it's the simple, clear ideas which will have the longest legs and which will carry us furthest into the future."}, {"time": 2619, "text": "Nevertheless, we're in a situation where we need to make things work today, and sometimes that requires putting together more complex systems where we don't have the full answers yet as to what those minimal ingredients might be."}, {"time": 2631, "text": "So speaking of which, if we could take a step back to Go, what was MoGo and what was the key idea behind the system?"}, {"time": 2690, "text": "So for example, if you're in the game of Go, the intuition is that you take a position and you get the system to kind of play random moves against itself all the way to the end of the game and you see who wins."}, {"time": 2701, "text": "And if black ends up winning more of those random games than white, well, you say, hey, this is a position that favors white."}, {"time": 2707, "text": "And if white ends up winning more of those random games than black, then it favors white."}, {"time": 2744, "text": "And this idea, when you think about it, and this idea was very powerful and suddenly led to huge leaps forward in the strength of computer Go playing programs."}, {"time": 2755, "text": "And among those, the strongest of the Go playing programs in those days was a program called MoGo, which was the first program to actually reach human master level on small boards, nine by nine boards."}, {"time": 2767, "text": "And so this was a program by someone called Sylvain Gelli, who's a good colleague of mine, but I worked with him a little bit in those days, part of my PhD thesis."}, {"time": 2778, "text": "And MoGo was a first step towards the latest successes we saw in computer Go, but it was still missing a key ingredient."}, {"time": 2788, "text": "MoGo was evaluating purely by random rollouts against itself."}, {"time": 2793, "text": "And in a way, it's truly remarkable that random play should give you anything at all."}, {"time": 2799, "text": "Why in this perfectly deterministic game that's very precise and involves these very exact sequences, why is it that randomization is helpful?"}, {"time": 2812, "text": "And so the intuition is that randomization captures something about the nature of the search tree, from a position that you're understanding the nature of the search tree from that node onwards by using randomization."}, {"time": 2826, "text": "And this was a very powerful idea."}, {"time": 2829, "text": "And I've seen this in other spaces, talked to Richard Karp and so on, randomized algorithms somehow magically are able to do exceptionally well and simplifying the problem somehow."}, {"time": 2843, "text": "Makes you wonder about the fundamental nature of randomness in our universe."}, {"time": 2847, "text": "It seems to be a useful thing."}, {"time": 2849, "text": "But so from that moment, can you maybe tell the origin story and the journey of AlphaGo?"}, {"time": 2856, "text": "Yeah, so programs based on Monte Carlo tree search were a first revolution in the sense that they led to suddenly programs that could play the game to any reasonable level, but they plateaued."}, {"time": 2870, "text": "It seemed that no matter how much effort people put into these techniques, they couldn't exceed the level of amateur Dan level Go players."}, {"time": 2878, "text": "So strong players, but not anywhere near the level of professionals, nevermind the world champion."}, {"time": 2884, "text": "And so that brings us to the birth of AlphaGo, which happened in the context of a startup company known as DeepMind."}, {"time": 2894, "text": "I heard of them."}, {"time": 2895, "text": "Where a project was born."}, {"time": 2899, "text": "And the project was really a scientific investigation where myself and Adger Huang and an intern, Chris Madison, were exploring a scientific question."}, {"time": 2913, "text": "And that scientific question was really, is there another fundamentally different approach to this key question of Go, the key challenge of how can you build that intuition and how can you just have a system that could look at a position and understand what move to play or how well you're doing in that position, who's gonna win?"}, {"time": 2934, "text": "And so the deep learning revolution had just begun."}, {"time": 2939, "text": "That systems like ImageNet had suddenly been won by deep learning techniques back in 2012."}, {"time": 2946, "text": "And following that, it was natural to ask, well, if deep learning is able to scale up so effectively with images to understand them enough to classify them, well, why not go?"}, {"time": 2957, "text": "Why not take the black and white stones of the Go board and build a system which can understand for itself what that means in terms of what move to pick or who's gonna win the game, black or white?"}, {"time": 2971, "text": "And so that was our scientific question which we were probing and trying to understand."}, {"time": 2975, "text": "And as we started to look at it, we discovered that we could build a system."}, {"time": 2980, "text": "So in fact, our very first paper on AlphaGo was actually a pure deep learning system which was trying to answer this question."}, {"time": 2989, "text": "And we showed that actually a pure deep learning system with no search at all was actually able to reach human band level, master level at the full game of Go, 19 by 19 boards."}, {"time": 3001, "text": "And so without any search at all, suddenly we had systems which were playing at the level of the best Monte Carlo tree search systems, the ones with randomized rollouts."}, {"time": 3011, "text": "So first of all, sorry to interrupt, but that's kind of a groundbreaking notion."}, {"time": 3016, "text": "That's like basically a definitive step away from a couple of decades of essentially search dominating AI."}, {"time": 3026, "text": "So how did that make you feel?"}, {"time": 3028, "text": "Was it surprising from a scientific perspective in general, how to make you feel?"}, {"time": 3033, "text": "I found this to be profoundly surprising."}, {"time": 3037, "text": "In fact, it was so surprising that we had a bet back then."}, {"time": 3041, "text": "And like many good projects, bets are quite motivating."}, {"time": 3044, "text": "And the bet was whether it was possible for a system based purely on deep learning, with no search at all to beat a down level human player."}, {"time": 3055, "text": "And so we had someone who joined our team who was a down level player."}, {"time": 3061, "text": "He came in and we had this first match against him and..."}, {"time": 3066, "text": "Which side of the bed were you on, by the way?"}, {"time": 3069, "text": "The losing or the winning side?"}, {"time": 3071, "text": "I tend to be an optimist with the power of deep learning and reinforcement learning."}, {"time": 3078, "text": "So the system won, and we were able to beat this human down level player."}, {"time": 3084, "text": "And for me, that was the moment where it was like, okay, something special is afoot here."}, {"time": 3089, "text": "We have a system which without search is able to already just look at this position and understand things as well as a strong human player."}, {"time": 3099, "text": "And from that point onwards, I really felt that reaching the top levels of human play, professional level, world champion level, I felt it was actually an inevitability."}, {"time": 3116, "text": "And if it was an inevitable outcome, I was rather keen that it would be us that achieved it."}, {"time": 3123, "text": "So we scaled up."}, {"time": 3125, "text": "This was something where, so I had lots of conversations back then with Demis Sassabis, the head of DeepMind, who was extremely excited."}, {"time": 3136, "text": "And we made the decision to scale up the project, brought more people on board."}, {"time": 3143, "text": "And so AlphaGo became something where we had a clear goal, which was to try and crack this outstanding challenge of AI to see if we could beat the world's best players."}, {"time": 3157, "text": "And this led within the space of not so many months to playing against the European champion Fan Hui in a match which became memorable in history as the first time a Go program had ever beaten a professional player."}, {"time": 3173, "text": "And at that time we had to make a judgment as to when and whether we should go and challenge the world champion."}, {"time": 3181, "text": "And this was a difficult decision to make."}, {"time": 3184, "text": "Again, we were basing our predictions on our own progress and had to estimate based on the rapidity of our own progress when we thought we would exceed the level of the human world champion."}, {"time": 3197, "text": "And we tried to make an estimate and set up a match and that became the AlphaGo versus Lee Sedol match in 2016."}, {"time": 3207, "text": "And we should say, spoiler alert, that AlphaGo was able to defeat Lee Sedol."}, {"time": 3214, "text": "So maybe we could take even a broader view."}, {"time": 3219, "text": "AlphaGo involves both learning from expert games and as far as I remember, a self play component to where it learns by playing against itself."}, {"time": 3234, "text": "But in your sense, what was the role of learning from expert games there?"}, {"time": 3239, "text": "And in terms of your self evaluation, whether you can take on the world champion, what was the thing that you're trying to do more of?"}, {"time": 3246, "text": "Sort of train more on expert games or was there's now another, I'm asking so many poorly phrased questions, but did you have a hope or dream that self play would be the key component at that moment yet?"}, {"time": 3264, "text": "So in the early days of AlphaGo, we used human data to explore the science of what deep learning can achieve."}, {"time": 3271, "text": "And so when we had our first paper that showed that it was possible to predict the winner of the game, that it was possible to suggest moves, that was done using human data."}, {"time": 3281, "text": "A solely human data."}, {"time": 3282, "text": "Yeah, and so the reason that we did it that way was at that time we were exploring separately the deep learning aspect from the reinforcement learning aspect."}, {"time": 3291, "text": "That was the part which was new and unknown to me at that time was how far could that be stretched?"}, {"time": 3298, "text": "Once we had that, it then became natural to try and use that same representation and see if we could learn for ourselves using that same representation."}, {"time": 3306, "text": "And so right from the beginning, actually our goal had been to build a system using self play."}, {"time": 3314, "text": "And to us, the human data right from the beginning was an expedient step to help us for pragmatic reasons to go faster towards the goals of the project than we might be able to starting solely from self play."}, {"time": 3327, "text": "And so in those days, we were very aware that we were choosing to use human data and that might not be the longterm holy grail of AI, but that it was something which was extremely useful to us."}, {"time": 3340, "text": "It helped us to understand the system."}, {"time": 3342, "text": "It helped us to build deep learning representations which were clear and simple and easy to use."}, {"time": 3348, "text": "And so really I would say it served a purpose not just as part of the algorithm, but something which I continue to use in our research today, which is trying to break down a very hard challenge into pieces which are easier to understand for us as researchers and develop."}, {"time": 3364, "text": "So if you use a component based on human data, it can help you to understand the system such that then you can build the more principled version later that does it for itself."}, {"time": 3375, "text": "So as I said, the AlphaGo victory, and I don't think I'm being sort of romanticizing this notion."}, {"time": 3383, "text": "I think it's one of the greatest moments in the history of AI."}, {"time": 3386, "text": "So were you cognizant of this magnitude of the accomplishment at the time?"}, {"time": 3392, "text": "I mean, are you cognizant of it even now?"}, {"time": 3395, "text": "Because to me, I feel like it's something that would, we mentioned what the AGI systems of the future will look back."}, {"time": 3402, "text": "I think they'll look back at the AlphaGo victory as like, holy crap, they figured it out."}, {"time": 3409, "text": "This is where it started."}, {"time": 3411, "text": "Well, thank you again."}, {"time": 3412, "text": "I mean, it's funny because I guess I've been working on, I've been working on ComputerGo for a long time."}, {"time": 3418, "text": "So I'd been working at the time of the AlphaGo match on ComputerGo for more than a decade."}, {"time": 3423, "text": "And throughout that decade, I'd had this dream of what would it be like to, what would it be like really to actually be able to build a system that could play against the world champion."}, {"time": 3434, "text": "And I imagined that that would be an interesting moment that maybe some people might care about that and that this might be a nice achievement."}, {"time": 3444, "text": "But I think when I arrived in Seoul and discovered the legions of journalists that were following us around and the 100 million people that were watching the match online live, I realized that I'd been off in my estimation of how significant this moment was by several orders of magnitude."}, {"time": 3463, "text": "And so there was definitely an adjustment process to realize that this was something which the world really cared about and which was a watershed moment."}, {"time": 3477, "text": "And I think there was that moment of realization."}, {"time": 3481, "text": "But it's also a little bit scary because if you go into something thinking it's gonna be maybe of interest and then discover that 100 million people are watching, it suddenly makes you worry about whether some of the decisions you'd made were really the best ones or the wisest, or were going to lead to the best outcome."}, {"time": 3498, "text": "And we knew for sure that there were still imperfections in AlphaGo, which were gonna be exposed to the whole world watching."}, {"time": 3504, "text": "And so, yeah, it was I think a great experience and I feel privileged to have been part of it, privileged to have led that amazing team."}, {"time": 3515, "text": "I feel privileged to have been in a moment of history like you say, but also lucky that in a sense I was insulated from the knowledge of, I think it would have been harder to focus on the research if the full kind of reality of what was gonna come to pass had been known to me and the team."}, {"time": 3535, "text": "I think it was, we were in our bubble and we were working on research and we were trying to answer the scientific questions and then bam, the public sees it."}, {"time": 3544, "text": "And I think it was better that way in retrospect."}, {"time": 3547, "text": "Were you confident that, I guess, what were the chances that you could get the win?"}, {"time": 3553, "text": "So just like you said, I'm a little bit more familiar with another accomplishment that we may not even get a chance to talk to."}, {"time": 3562, "text": "I talked to Oriel Venialis about Alpha Star which is another incredible accomplishment, but here with Alpha Star and beating the StarCraft, there was already a track record with AlphaGo."}, {"time": 3574, "text": "This is the really first time you get to see reinforcement learning face the best human in the world."}, {"time": 3581, "text": "So what was your confidence like, what was the odds?"}, {"time": 3585, "text": "Well, we actually."}, {"time": 3585, "text": "Was there a bet?"}, {"time": 3587, "text": "Funnily enough, there was."}, {"time": 3589, "text": "So just before the match, we weren't betting on anything concrete, but we all held out a hand."}, {"time": 3596, "text": "Everyone in the team held out a hand at the beginning of the match."}, {"time": 3599, "text": "And the number of fingers that they had out on their hand was supposed to represent how many games they thought we would win against Lee Sedol."}, {"time": 3606, "text": "And there was an amazing spread in the team's predictions."}, {"time": 3610, "text": "But I have to say, I predicted four, one."}, {"time": 3615, "text": "And the reason was based purely on data."}, {"time": 3618, "text": "So I'm a scientist first and foremost."}, {"time": 3620, "text": "And one of the things which we had established was that AlphaGo in around one in five games would develop something which we called a delusion, which was a kind of in a hole in its knowledge where it wasn't able to fully understand everything about the position."}, {"time": 3636, "text": "And that hole in its knowledge would persist for tens of moves throughout the game."}, {"time": 3641, "text": "And we knew two things."}, {"time": 3642, "text": "We knew that if there were no delusions, that AlphaGo seemed to be playing at a level that was far beyond any human capabilities."}, {"time": 3649, "text": "But we also knew that if there were delusions, the opposite was true."}, {"time": 3653, "text": "And in fact, that's what came to pass."}, {"time": 3658, "text": "We saw all of those outcomes."}, {"time": 3660, "text": "And Lee Sedol in one of the games played a really beautiful sequence that AlphaGo just hadn't predicted."}, {"time": 3668, "text": "And after that, it led it into this situation where it was unable to really understand the position fully and found itself in one of these delusions."}, {"time": 3677, "text": "So indeed, yeah, 4.1 was the outcome."}, {"time": 3680, "text": "So yeah, and can you maybe speak to it a little bit more?"}, {"time": 3683, "text": "What were the five games?"}, {"time": 3686, "text": "Is there interesting things that come to memory in terms of the play of the human or the machine?"}, {"time": 3693, "text": "So I remember all of these games vividly, of course."}, {"time": 3697, "text": "Moments like these don't come too often in the lifetime of a scientist."}, {"time": 3702, "text": "And the first game was magical because it was the first time that a computer program had defeated a world champion in this grand challenge of Go."}, {"time": 3717, "text": "And there was a moment where AlphaGo invaded Lee Sedol's territory towards the end of the game."}, {"time": 3727, "text": "And that's quite an audacious thing to do."}, {"time": 3729, "text": "It's like saying, hey, you thought this was going to be your territory in the game, but I'm going to stick a stone right in the middle of it and prove to you that I can break it up."}, {"time": 3737, "text": "And Lee Sedol's face just dropped."}, {"time": 3740, "text": "He wasn't expecting a computer to do something that audacious."}, {"time": 3746, "text": "The second game became famous for a move known as move 37."}, {"time": 3750, "text": "This was a move that was played by AlphaGo that broke all of the conventions of Go, that the Go players were so shocked by this."}, {"time": 3760, "text": "They thought that maybe the operator had made a mistake."}, {"time": 3765, "text": "They thought that there was something crazy going on."}, {"time": 3768, "text": "And it just broke every rule that Go players are taught from a very young age."}, {"time": 3772, "text": "They're just taught this kind of move called a shoulder hit."}, {"time": 3775, "text": "You can only play it on the third line or the fourth line, and AlphaGo played it on the fifth line."}, {"time": 3780, "text": "And it turned out to be a brilliant move and made this beautiful pattern in the middle of the board that ended up winning the game."}, {"time": 3788, "text": "And so this really was a clear instance where we could say computers exhibited creativity, that this was really a move that was something humans hadn't known about, hadn't anticipated."}, {"time": 3802, "text": "And computers discovered this idea."}, {"time": 3804, "text": "They were the ones to say, actually, here's a new idea, something new, not in the domains of human knowledge of the game."}, {"time": 3813, "text": "And now the humans think this is a reasonable thing to do."}, {"time": 3818, "text": "And it's part of Go knowledge now."}, {"time": 3821, "text": "The third game, something special happens when you play against a human world champion, which, again, I hadn't anticipated before going there, which is these players are amazing."}, {"time": 3833, "text": "Lee Sedol was a true champion, 18 time world champion, and had this amazing ability to probe AlphaGo for weaknesses of any kind."}, {"time": 3843, "text": "And in the third game, he was losing, and we felt we were sailing comfortably to victory."}, {"time": 3849, "text": "But he managed to, from nothing, stir up this fight and build what's called a double co, these kind of repetitive positions."}, {"time": 3860, "text": "And he knew that historically, no computer Go program had ever been able to deal correctly with double co positions."}, {"time": 3866, "text": "And he managed to summon one out of nothing."}, {"time": 3869, "text": "And so for us, this was a real challenge."}, {"time": 3873, "text": "Would AlphaGo be able to deal with this, or would it just kind of crumble in the face of this situation?"}, {"time": 3878, "text": "And fortunately, it dealt with it perfectly."}, {"time": 3881, "text": "The fourth game was amazing in that Lee Sedol appeared to be losing this game."}, {"time": 3888, "text": "AlphaGo thought it was winning."}, {"time": 3889, "text": "And then Lee Sedol did something, which I think only a true world champion can do, which is he found a brilliant sequence in the middle of the game, a brilliant sequence that led him to really just transform the position."}, {"time": 3905, "text": "He kind of found just a piece of genius, really."}, {"time": 3910, "text": "And after that, AlphaGo, its evaluation just tumbled."}, {"time": 3915, "text": "It thought it was winning this game."}, {"time": 3917, "text": "And all of a sudden, it tumbled and said, oh, now I've got no chance."}, {"time": 3921, "text": "And it started to behave rather oddly at that point."}, {"time": 3924, "text": "In the final game, for some reason, we as a team were convinced, having seen AlphaGo in the previous game, suffer from delusions."}, {"time": 3931, "text": "We as a team were convinced that it was suffering from another delusion."}, {"time": 3935, "text": "We were convinced that it was misevaluating the position and that something was going terribly wrong."}, {"time": 3941, "text": "And it was only in the last few moves of the game that we realized that actually, although it had been predicting it was going to win all the way through, it really was."}, {"time": 3951, "text": "And so somehow, it just taught us yet again that you have to have faith in your systems."}, {"time": 3956, "text": "When they exceed your own level of ability and your own judgment, you have to trust in them to know better than you, the designer, once you've bestowed in them the ability to judge better than you can, then trust the system to do so."}, {"time": 3973, "text": "So just like in the case of Deep Blue beating Gary Kasparov, so Gary was, I think, the first time he's ever lost, actually, to anybody."}, {"time": 3984, "text": "And I mean, there's a similar situation with Lee Sedol."}, {"time": 3987, "text": "It's a tragic loss for humans, but a beautiful one, I think, that's kind of, from the tragedy, sort of emerges over time, emerges a kind of inspiring story."}, {"time": 4007, "text": "But Lee Sedol recently announced his retirement."}, {"time": 4012, "text": "I don't know if we can look too deeply into it, but he did say that even if I become number one, there's an entity that cannot be defeated."}, {"time": 4022, "text": "So what do you think about these words?"}, {"time": 4025, "text": "What do you think about his retirement from the game ago?"}, {"time": 4028, "text": "Well, let me take you back, first of all, to the first part of your comment about Gary Kasparov, because actually, at the panel yesterday, he specifically said that when he first lost to Deep Blue, he viewed it as a failure."}, {"time": 4042, "text": "He viewed that this had been a failure of his."}, {"time": 4044, "text": "But later on in his career, he said he'd come to realize that actually, it was a success."}, {"time": 4050, "text": "It was a success for everyone, because this marked transformational moment for AI."}, {"time": 4057, "text": "And so even for Gary Kasparov, he came to realize that that moment was pivotal and actually meant something much more than his personal loss in that moment."}, {"time": 4069, "text": "Lee Sedol, I think, was much more cognizant of that, even at the time."}, {"time": 4074, "text": "And so in his closing remarks to the match, he really felt very strongly that what had happened in the AlphaGo match was not only meaningful for AI, but for humans as well."}, {"time": 4086, "text": "And he felt as a Go player that it had opened his horizons and meant that he could start exploring new things."}, {"time": 4092, "text": "It brought his joy back for the game of Go, because it had broken all of the conventions and barriers and meant that suddenly, anything was possible again."}, {"time": 4103, "text": "So I was sad to hear that he'd retired, but he's been a great world champion over many, many years."}, {"time": 4111, "text": "And I think he'll be remembered for that ever more."}, {"time": 4116, "text": "He'll be remembered as the last person to beat AlphaGo."}, {"time": 4119, "text": "I mean, after that, we increased the power of the system."}, {"time": 4123, "text": "And the next version of AlphaGo beats the other strong human player 60 games to nil."}, {"time": 4132, "text": "So what a great moment for him and something to be remembered for."}, {"time": 4138, "text": "It's interesting that you spent time at AAAI on a panel with Garry Kasparov."}, {"time": 4145, "text": "What, I mean, it's almost, I'm just curious to learn the conversations you've had with Garry, because he's also now, he's written a book about artificial intelligence."}, {"time": 4157, "text": "He's thinking about AI."}, {"time": 4158, "text": "He has kind of a view of it."}, {"time": 4161, "text": "And he talks about AlphaGo a lot."}, {"time": 4166, "text": "Arguably, I'm not just being Russian, but I think Garry is the greatest chess player of all time, probably one of the greatest game players of all time."}, {"time": 4176, "text": "And you sort of at the center of creating a system that beats one of the greatest players of all time."}, {"time": 4185, "text": "So what is that conversation like?"}, {"time": 4186, "text": "Is there anything, any interesting digs, any bets, any funny things, any profound things?"}, {"time": 4193, "text": "So Garry Kasparov has an incredible respect for what we did with AlphaGo."}, {"time": 4201, "text": "And it's an amazing tribute coming from him of all people that he really appreciates and respects what we've done."}, {"time": 4211, "text": "And I think he feels that the progress which has happened in computer chess, which later after AlphaGo, we built the AlphaZero system, which defeated the world's strongest chess programs."}, {"time": 4226, "text": "And to Garry Kasparov, that moment in computer chess was more profound than Deep Blue."}, {"time": 4232, "text": "And the reason he believes it mattered more was because it was done with learning and a system which was able to discover for itself new principles, new ideas, which were able to play the game in a way which he hadn't always known about or anyone."}, {"time": 4250, "text": "And in fact, one of the things I discovered at this panel was that the current world champion, Magnus Carlsen, apparently recently commented on his improvement in performance."}, {"time": 4261, "text": "And he attributed it to AlphaZero, that he's been studying the games of AlphaZero."}, {"time": 4265, "text": "And he's changed his style to play more like AlphaZero."}, {"time": 4268, "text": "And it's led to him actually increasing his rating to a new peak."}, {"time": 4275, "text": "Yeah, I guess to me, just like to Garry, the inspiring thing is that, and just like you said, with reinforcement learning, reinforcement learning and deep learning, machine learning feels like what intelligence is."}, {"time": 4289, "text": "And you could attribute it to a bitter viewpoint from Garry's perspective, from us humans perspective, saying that pure search that IBM Deep Blue was doing is not really intelligence, but somehow it didn't feel like it."}, {"time": 4307, "text": "And so that's the magical."}, {"time": 4309, "text": "I'm not sure what it is about learning that feels like intelligence, but it does."}, {"time": 4314, "text": "So I think we should not demean the achievements of what was done in previous eras of AI."}, {"time": 4320, "text": "I think that Deep Blue was an amazing achievement in itself."}, {"time": 4324, "text": "And that heuristic search of the kind that was used by Deep Blue had some powerful ideas that were in there, but it also missed some things."}, {"time": 4333, "text": "So the fact that the evaluation function, the way that the chess position was understood, was created by humans and not by the machine is a limitation, which means that there's a ceiling on how well it can do."}, {"time": 4348, "text": "But maybe more importantly, it means that the same idea cannot be applied in other domains where we don't have access to the human grandmasters and that ability to encode exactly their knowledge into an evaluation function."}, {"time": 4363, "text": "And the reality is that the story of AI is that most domains turn out to be of the second type where knowledge is messy, it's hard to extract from experts, or it isn't even available."}, {"time": 4373, "text": "And so we need to solve problems in a different way."}, {"time": 4379, "text": "And I think AlphaGo is a step towards solving things in a way which puts learning as a first class citizen and says systems need to understand for themselves how to understand the world, how to judge the value of any action that they might take within that world and any state they might find themselves in."}, {"time": 4402, "text": "And in order to do that, we make progress towards AI."}, {"time": 4409, "text": "Yeah, so one of the nice things about taking a learning approach to the game of Go or game playing is that the things you learn, the things you figure out, are actually going to be applicable to other problems that are real world problems."}, {"time": 4424, "text": "That's ultimately, I mean, there's two really interesting things about AlphaGo."}, {"time": 4429, "text": "One is the science of it, just the science of learning, the science of intelligence."}, {"time": 4434, "text": "And then the other is while you're actually learning to figuring out how to build systems that would be potentially applicable in other applications, medical, autonomous vehicles, robotics, I mean, it's just open the door to all kinds of applications."}, {"time": 4450, "text": "So the next incredible step, really the profound step is probably AlphaGo Zero."}, {"time": 4458, "text": "I mean, it's arguable."}, {"time": 4460, "text": "I kind of see them all as the same place."}, {"time": 4462, "text": "But really, and perhaps you were already thinking that AlphaGo Zero is the natural."}, {"time": 4466, "text": "It was always going to be the next step."}, {"time": 4469, "text": "But it's removing the reliance on human expert games for pre training, as you mentioned."}, {"time": 4475, "text": "So how big of an intellectual leap was this that self play could achieve superhuman level performance in its own?"}, {"time": 4485, "text": "And maybe could you also say, what is self play?"}, {"time": 4488, "text": "Kind of mention it a few times."}, {"time": 4491, "text": "So let me start with self play."}, {"time": 4495, "text": "So the idea of self play is something which is really about systems learning for themselves, but in the situation where there's more than one agent."}, {"time": 4505, "text": "And so if you're in a game, and the game is played between two players, then self play is really about understanding that game just by playing games against yourself rather than against any actual real opponent."}, {"time": 4519, "text": "And so it's a way to kind of discover strategies without having to actually need to go out and play against any particular human player, for example."}, {"time": 4536, "text": "The main idea of Alpha Zero was really to try and step back from any of the knowledge that we put into the system and ask the question, is it possible to come up with a single elegant principle by which a system can learn for itself all of the knowledge which it requires to play a game such as Go?"}, {"time": 4560, "text": "Importantly, by taking knowledge out, you not only make the system less brittle in the sense that perhaps the knowledge you were putting in was just getting in the way and maybe stopping the system learning for itself, but also you make it more general."}, {"time": 4577, "text": "The more knowledge you put in, the harder it is for a system to actually be placed, taken out of the system in which it's kind of been designed, and placed in some other system that maybe would need a completely different knowledge base to understand and perform well."}, {"time": 4592, "text": "And so the real goal here is to strip out all of the knowledge that we put in to the point that we can just plug it into something totally different."}, {"time": 4601, "text": "And that, to me, is really the promise of AI is that we can have systems such as that which, no matter what the goal is, no matter what goal we set to the system, we can come up with an algorithm which can be placed into that world, into that environment, and can succeed in achieving that goal."}, {"time": 4621, "text": "And then that, to me, is almost the essence of intelligence if we can achieve that."}, {"time": 4627, "text": "And so AlphaZero is a step towards that."}, {"time": 4631, "text": "And it's a step that was taken in the context of two player perfect information games like Go and chess."}, {"time": 4638, "text": "We also applied it to Japanese chess."}, {"time": 4641, "text": "So just to clarify, the first step was AlphaGo Zero."}, {"time": 4645, "text": "The first step was to try and take all of the knowledge out of AlphaGo in such a way that it could play in a fully self discovered way, purely from self play."}, {"time": 4659, "text": "And to me, the motivation for that was always that we could then plug it into other domains."}, {"time": 4664, "text": "But we saved that until later."}, {"time": 4668, "text": "Well, in fact, I mean, just for fun, I could tell you exactly the moment where the idea for AlphaZero occurred to me."}, {"time": 4677, "text": "Because I think there's maybe a lesson there for researchers who are too deeply embedded in their research and working 24 sevens to try and come up with the next idea, which is it actually occurred to me on honeymoon."}, {"time": 4693, "text": "And I was at my most fully relaxed state, really enjoying myself, and just bing, the algorithm for AlphaZero just appeared in its full form."}, {"time": 4709, "text": "And this was actually before we played against Lisa Dahl."}, {"time": 4713, "text": "But we just didn't."}, {"time": 4715, "text": "I think we were so busy trying to make sure we could beat the world champion that it was only later that we had the opportunity to step back and start examining that sort of deeper scientific question of whether this could really work."}, {"time": 4732, "text": "So nevertheless, so self play is probably one of the most profound ideas that represents, to me at least, artificial intelligence."}, {"time": 4745, "text": "But the fact that you could use that kind of mechanism to, again, beat world class players, that's very surprising."}, {"time": 4754, "text": "So to me, it feels like you have to train in a large number of expert games."}, {"time": 4761, "text": "So was it surprising to you?"}, {"time": 4762, "text": "What was the intuition?"}, {"time": 4763, "text": "Can you sort of think, not necessarily at that time, even now, what's your intuition?"}, {"time": 4767, "text": "Why this thing works so well?"}, {"time": 4770, "text": "Why it's able to learn from scratch?"}, {"time": 4771, "text": "Well, let me first say why we tried it."}, {"time": 4774, "text": "So we tried it both because I feel that it was the deeper scientific question to be asking to make progress towards AI, and also because, in general, in my research, I don't like to do research on questions for which we already know the likely outcome."}, {"time": 4791, "text": "I don't see much value in running an experiment where you're 95% confident that you will succeed."}, {"time": 4797, "text": "And so we could have tried maybe to take AlphaGo and do something which we knew for sure it would succeed on."}, {"time": 4805, "text": "But much more interesting to me was to try it on the things which we weren't sure about."}, {"time": 4809, "text": "And one of the big questions on our minds back then was, could you really do this with self play alone?"}, {"time": 4816, "text": "How far could that go?"}, {"time": 4817, "text": "Would it be as strong?"}, {"time": 4819, "text": "And honestly, we weren't sure."}, {"time": 4822, "text": "It was 50, 50, I think."}, {"time": 4825, "text": "If you'd asked me, I wasn't confident that it could reach the same level as these systems, but it felt like the right question to ask."}, {"time": 4833, "text": "And even if it had not achieved the same level, I felt that that was an important direction to be studying."}, {"time": 4842, "text": "And so then, lo and behold, it actually ended up outperforming the previous version of AlphaGo and indeed was able to beat it by 100 games to zero."}, {"time": 4855, "text": "So what's the intuition as to why?"}, {"time": 4859, "text": "I think the intuition to me is clear, that whenever you have errors in a system, as we did in AlphaGo, AlphaGo suffered from these delusions."}, {"time": 4871, "text": "Occasionally, it would misunderstand what was going on in a position and miss evaluate it."}, {"time": 4875, "text": "How can you remove all of these errors?"}, {"time": 4879, "text": "Errors arise from many sources."}, {"time": 4881, "text": "For us, they were arising both starting from the human data, but also from the nature of the search and the nature of the algorithm itself."}, {"time": 4889, "text": "But the only way to address them in any complex system is to give the system the ability to correct its own errors."}, {"time": 4897, "text": "It must be able to correct them."}, {"time": 4899, "text": "It must be able to learn for itself when it's doing something wrong and correct for it."}, {"time": 4904, "text": "And so it seemed to me that the way to correct delusions was indeed to have more iterations of reinforcement learning, that no matter where you start, you should be able to correct those errors until it gets to play that out and understand, oh, well, I thought that I was going to win in this situation, but then I ended up losing."}, {"time": 4923, "text": "That suggests that I was miss evaluating something."}, {"time": 4925, "text": "There's a hole in my knowledge, and now the system can correct for itself and understand how to do better."}, {"time": 4931, "text": "Now, if you take that same idea and trace it back all the way to the beginning, it should be able to take you from no knowledge, from completely random starting point, all the way to the highest levels of knowledge that you can achieve in a domain."}, {"time": 4947, "text": "And the principle is the same, that if you bestow a system with the ability to correct its own errors, then it can take you from random to something slightly better than random because it sees the stupid things that the random is doing, and it can correct them."}, {"time": 4961, "text": "And then it can take you from that slightly better system and understand, well, what's that doing wrong?"}, {"time": 4965, "text": "And it takes you on to the next level and the next level."}, {"time": 4969, "text": "And this progress can go on indefinitely."}, {"time": 4972, "text": "And indeed, what would have happened if we'd carried on training AlphaGo Zero for longer?"}, {"time": 4979, "text": "We saw no sign of it slowing down its improvements, or at least it was certainly carrying on to improve."}, {"time": 4986, "text": "And presumably, if you had the computational resources, this could lead to better and better systems that discover more and more."}, {"time": 4995, "text": "So your intuition is fundamentally there's not a ceiling to this process."}, {"time": 5001, "text": "One of the surprising things, just like you said, is the process of patching errors."}, {"time": 5007, "text": "It intuitively makes sense that this is, that reinforcement learning should be part of that process."}, {"time": 5013, "text": "But what is surprising is in the process of patching your own lack of knowledge, you don't open up other patches."}, {"time": 5021, "text": "You keep sort of, like there's a monotonic decrease of your weaknesses."}, {"time": 5028, "text": "Well, let me back this up."}, {"time": 5030, "text": "I think science always should make falsifiable hypotheses."}, {"time": 5033, "text": "So let me back up this claim with a falsifiable hypothesis, which is that if someone was to, in the future, take Alpha Zero as an algorithm and run it on with greater computational resources that we had available today, then I would predict that they would be able to beat the previous system 100 games to zero."}, {"time": 5055, "text": "And that if they were then to do the same thing a couple of years later, that that would beat that previous system 100 games to zero, and that that process would continue indefinitely throughout at least my human lifetime."}, {"time": 5067, "text": "Presumably the game of Go would set the ceiling."}, {"time": 5071, "text": "The game of Go would set the ceiling, but the game of Go has 10 to the 170 states in it."}, {"time": 5075, "text": "So the ceiling is unreachable by any computational device that can be built out of the 10 to the 80 atoms in the universe."}, {"time": 5086, "text": "You asked a really good question, which is, do you not open up other errors when you correct your previous ones?"}, {"time": 5093, "text": "And the answer is yes, you do."}, {"time": 5131, "text": "And that is the best way that I can play knowing that you're playing perfectly against me."}, {"time": 5138, "text": "And so for those cases, we know that even if you do open up some new error, that in some sense you've made progress."}, {"time": 5146, "text": "You're progressing towards the best that can be done."}, {"time": 5150, "text": "So AlphaGo was initially trained on expert games with some self play."}, {"time": 5156, "text": "AlphaGo Zero removed the need to be trained on expert games."}, {"time": 5160, "text": "And then another incredible step for me, because I just love chess, is to generalize that further to be in AlphaZero to be able to play the game of Go, beating AlphaGo Zero and AlphaGo, and then also being able to play the game of chess and others."}, {"time": 5179, "text": "So what was that step like?"}, {"time": 5180, "text": "What's the interesting aspects there that required to make that happen?"}, {"time": 5186, "text": "I think the remarkable observation, which we saw with AlphaZero, was that actually without modifying the algorithm at all, it was able to play and crack some of AI's greatest previous challenges."}, {"time": 5201, "text": "In particular, we dropped it into the game of chess."}, {"time": 5204, "text": "And unlike the previous systems like Deep Blue, which had been worked on for years and years, and we were able to beat the world's strongest computer chess program convincingly using a system that was fully discovered from scratch with its own principles."}, {"time": 5224, "text": "And in fact, one of the nice things that we found was that in fact, we also achieved the same result in Japanese chess, a variant of chess where you get to capture pieces and then place them back down on your own side as an extra piece."}, {"time": 5238, "text": "So a much more complicated variant of chess."}, {"time": 5241, "text": "And we also beat the world's strongest programs and reached superhuman performance in that game too."}, {"time": 5248, "text": "And it was the very first time that we'd ever run the system on that particular game, was the version that we published in the paper on AlphaZero."}, {"time": 5258, "text": "It just worked out of the box, literally, no touching it."}, {"time": 5261, "text": "We didn't have to do anything."}, {"time": 5262, "text": "And there it was, superhuman performance, no tweaking, no twiddling."}, {"time": 5267, "text": "And so I think there's something beautiful about that principle that you can take an algorithm and without twiddling anything, it just works."}, {"time": 5277, "text": "Now, to go beyond AlphaZero, what's required?"}, {"time": 5282, "text": "AlphaZero is just a step."}, {"time": 5285, "text": "And there's a long way to go beyond that to really crack the deep problems of AI."}, {"time": 5290, "text": "But one of the important steps is to acknowledge that the world is a really messy place."}, {"time": 5296, "text": "It's this rich, complex, beautiful, but messy environment that we live in."}, {"time": 5301, "text": "And no one gives us the rules."}, {"time": 5303, "text": "Like no one knows the rules of the world."}, {"time": 5306, "text": "At least maybe we understand that it operates according to Newtonian or quantum mechanics at the micro level or according to relativity at the macro level."}, {"time": 5315, "text": "But that's not a model that's useful for us as people to operate in it."}, {"time": 5320, "text": "Somehow the agent needs to understand the world for itself in a way where no one tells it the rules of the game."}, {"time": 5326, "text": "And yet it can still figure out what to do in that world, deal with this stream of observations coming in, rich sensory input coming in, actions going out in a way that allows it to reason in the way that AlphaGo or AlphaZero can reason in the way that these go and chess playing programs can reason."}, {"time": 5344, "text": "But in a way that allows it to take actions in that messy world to achieve its goals."}, {"time": 5351, "text": "And so this led us to the most recent step in the story of AlphaGo, which was a system called MuZero."}, {"time": 5359, "text": "And MuZero is a system which learns for itself even when the rules are not given to it."}, {"time": 5365, "text": "It actually can be dropped into a system with messy perceptual inputs."}, {"time": 5369, "text": "We actually tried it in some Atari games, the canonical domains of Atari that have been used for reinforcement learning."}, {"time": 5378, "text": "And this system learned to build a model of these Atari games that was sufficiently rich and useful enough for it to be able to plan successfully."}, {"time": 5391, "text": "And in fact, that system not only went on to beat the state of the art in Atari, but the same system without modification was able to reach the same level of superhuman performance in go, chess, and shogi that we'd seen in AlphaZero, showing that even without the rules, the system can learn for itself just by trial and error, just by playing this game of go."}, {"time": 5413, "text": "And no one tells you what the rules are, but you just get to the end and someone says win or loss."}, {"time": 5419, "text": "You play this game of chess and someone says win or loss, or you play a game of breakout in Atari and someone just tells you your score at the end."}, {"time": 5428, "text": "And the system for itself figures out essentially the rules of the system, the dynamics of the world, how the world works."}, {"time": 5435, "text": "And not in any explicit way, but just implicitly, enough understanding for it to be able to plan in that system in order to achieve its goals."}, {"time": 5445, "text": "And that's the fundamental process that you have to go through when you're facing in any uncertain kind of environment that you would in the real world, is figuring out the sort of the rules, the basic rules of the game."}, {"time": 5457, "text": "So that allows it to be applicable to basically any domain that could be digitized in the way that it needs to in order to be consumable, sort of in order for the reinforcement learning framework to be able to sense the environment, to be able to act in the environment and so on."}, {"time": 5475, "text": "The full reinforcement learning problem needs to deal with worlds that are unknown and complex and the agent needs to learn for itself how to deal with that."}, {"time": 5484, "text": "And so MuZero is a further step in that direction."}, {"time": 5489, "text": "One of the things that inspired the general public and just in conversations I have like with my parents or something with my mom that just loves what was done is kind of at least the notion that there was some display of creativity, some new strategies, new behaviors that were created."}, {"time": 5505, "text": "That again has echoes of intelligence."}, {"time": 5508, "text": "So is there something that stands out?"}, {"time": 5510, "text": "Do you see it the same way that there's creativity and there's some behaviors, patterns that you saw that AlphaZero was able to display that are truly creative?"}, {"time": 5521, "text": "So let me start by saying that I think we should ask what creativity really means."}, {"time": 5528, "text": "So to me, creativity means discovering something which wasn't known before, something unexpected, something outside of our norms."}, {"time": 5539, "text": "And so in that sense, the process of reinforcement learning or the self play approach that was used by AlphaZero is the essence of creativity."}, {"time": 5551, "text": "It's really saying at every stage, you're playing according to your current norms and you try something and if it works out, you say, hey, here's something great, I'm gonna start using that."}, {"time": 5564, "text": "And then that process, it's like a micro discovery that happens millions and millions of times over the course of the algorithm's life where it just discovers some new idea, oh, this pattern, this pattern's working really well for me, I'm gonna start using that."}, {"time": 5578, "text": "And now, oh, here's this other thing I can do, I can start to connect these stones together in this way or I can start to sacrifice stones or give up on pieces or play shoulder hits on the fifth line or whatever it is."}, {"time": 5592, "text": "The system's discovering things like this for itself continually, repeatedly, all the time."}, {"time": 5596, "text": "And so it should come as no surprise to us then when if you leave these systems going, that they discover things that are not known to humans, that to the human norms are considered creative."}, {"time": 5610, "text": "And we've seen this several times."}, {"time": 5612, "text": "In fact, in AlphaGo Zero, we saw this beautiful timeline of discovery where what we saw was that there are these opening patterns that humans play called joseki, these are like the patterns that humans learn to play in the corners and they've been developed and refined over literally thousands of years in the game of Go."}, {"time": 5633, "text": "And what we saw was in the course of the training, AlphaGo Zero, over the course of the 40 days that we trained this system, it starts to discover exactly these patterns that human players play."}, {"time": 5646, "text": "And over time, we found that all of the joseki that humans played were discovered by the system through this process of self play and this sort of essential notion of creativity."}, {"time": 5659, "text": "But what was really interesting was that over time, it then starts to discard some of these in favor of its own joseki that humans didn't know about."}, {"time": 5668, "text": "And it starts to say, oh, well, you thought that the Knights move pincer joseki was a great idea, but here's something different you can do there which makes some new variation that humans didn't know about."}, {"time": 5680, "text": "And actually now the human Go players study the joseki that AlphaGo played and they become the new norms that are used in today's top level Go competitions."}, {"time": 5691, "text": "That never gets old."}, {"time": 5692, "text": "Even just the first to me, maybe just makes me feel good as a human being that a self play mechanism that knows nothing about us humans discovers patterns that we humans do."}, {"time": 5704, "text": "That's just like an affirmation that we're doing okay as humans."}, {"time": 5709, "text": "We've, in this domain and other domains, we figured out it's like the Churchill quote about democracy."}, {"time": 5715, "text": "It's the, you know, it sucks, but it's the best one we've tried."}, {"time": 5720, "text": "So in general, taking a step outside of Go and you've like a million accomplishment that I have no time to talk about with AlphaStar and so on and the current work."}, {"time": 5732, "text": "But in general, this self play mechanism that you've inspired the world with by beating the world champion Go player."}, {"time": 5740, "text": "Do you see that as, do you see it being applied in other domains?"}, {"time": 5747, "text": "Do you have sort of dreams and hopes that it's applied in both the simulated environments and the constrained environments of games?"}, {"time": 5756, "text": "Constrained, I mean, AlphaStar really demonstrates that you can remove a lot of the constraints, but nevertheless, it's in a digital simulated environment."}, {"time": 5764, "text": "Do you have a hope, a dream that it starts being applied in the robotics environment?"}, {"time": 5769, "text": "And maybe even in domains that are safety critical and so on and have, you know, have a real impact in the real world, like autonomous vehicles, for example, which seems like a very far out dream at this point."}, {"time": 5781, "text": "So I absolutely do hope and imagine that we will get to the point where ideas just like these are used in all kinds of different domains."}, {"time": 5791, "text": "In fact, one of the most satisfying things as a researcher is when you start to see other people use your algorithms in unexpected ways."}, {"time": 5799, "text": "So in the last couple of years, there have been, you know, a couple of nature papers where different teams, unbeknownst to us, took AlphaZero and applied exactly those same algorithms and ideas to real world problems of huge meaning to society."}, {"time": 5817, "text": "So one of them was the problem of chemical synthesis, and they were able to beat the state of the art in finding pathways of how to actually synthesize chemicals, retrochemical synthesis."}, {"time": 5831, "text": "And the second paper actually just came out a couple of weeks ago in Nature, showed that in quantum computation, you know, one of the big questions is how to understand the nature of the function in quantum computation and a system based on AlphaZero beat the state of the art by quite some distance there again."}, {"time": 5852, "text": "So these are just examples."}, {"time": 5854, "text": "And I think, you know, the lesson, which we've seen elsewhere in machine learning time and time again, is that if you make something general, it will be used in all kinds of ways."}, {"time": 5864, "text": "You know, you provide a really powerful tool to society, and those tools can be used in amazing ways."}, {"time": 5871, "text": "And so I think we're just at the beginning, and for sure, I hope that we see all kinds of outcomes."}, {"time": 5878, "text": "So the other side of the question of reinforcement learning framework is, you know, you usually want to specify a reward function and an objective function."}, {"time": 5922, "text": "So I think, you know, when we think about intelligence, it's really important to be clear about the problem of intelligence."}, {"time": 5928, "text": "And I think it's clearest to understand that problem in terms of some ultimate goal that we want the system to try and solve for."}, {"time": 5935, "text": "And after all, if we don't understand the ultimate purpose of the system, do we really even have a clearly defined problem that we're solving at all?"}, {"time": 5944, "text": "Now, within that, as with your example for humans, the system may choose to create its own motivations and subgoals that help the system to achieve its ultimate goal."}, {"time": 5959, "text": "And that may indeed be a hugely important mechanism to achieve those ultimate goals, but there is still some ultimate goal I think the system needs to be measurable and evaluated against."}, {"time": 5969, "text": "And even for humans, I mean, humans, we're incredibly flexible."}, {"time": 5972, "text": "We feel that we can, you know, any goal that we're given, we feel we can master to some degree."}, {"time": 5980, "text": "But if we think of those goals, really, you know, like the goal of being able to pick up an object or the goal of being able to communicate or influence people to do things in a particular way or whatever those goals are, really, they're subgoals, really, that we set ourselves."}, {"time": 5998, "text": "You know, we choose to pick up the object."}, {"time": 6000, "text": "We choose to communicate."}, {"time": 6002, "text": "We choose to influence someone else."}, {"time": 6005, "text": "And we choose those because we think it will lead us to something later on."}, {"time": 6010, "text": "We think that's helpful to us to achieve some ultimate goal."}, {"time": 6015, "text": "Now, I don't want to speculate whether or not humans as a system necessarily have a singular overall goal of survival or whatever it is."}, {"time": 6023, "text": "But I think the principle for understanding and implementing intelligence is, has to be, that if we're trying to understand intelligence or implement our own, there has to be a well defined problem."}, {"time": 6033, "text": "Otherwise, if it's not, I think it's like an admission of defeat, that for there to be hope for understanding or implementing intelligence, we have to know what we're doing."}, {"time": 6044, "text": "We have to know what we're asking the system to do."}, {"time": 6046, "text": "Otherwise, if you don't have a clearly defined purpose, you're not going to get a clearly defined answer."}]}]