[{"title": "Ann Druyan: Cosmos, Carl Sagan, Voyager, and the Beauty of Science | Lex Fridman Podcast #78", "id": "7jFdxd1qX2g", "quotes": [{"time": 450, "text": "What is loving someone, a person, let's say deeply is not idealizing them, not putting some kind of subjective projection on them, but knowing them as they are."}, {"time": 468, "text": "And so for me, for me, the only aperture to that knowing about nature, the universe is science because it has that error correcting mechanism that most of the stuff that we do doesn't have."}, {"time": 481, "text": "You know, you could say the Bill of Rights is kind of an error correcting mechanism, which is one of the things I really appreciate about the society in which I live to the extent that it's upheld and we keep faith with it and the same with science."}, {"time": 497, "text": "It's like we will give you the highest rewards we have for proving us wrong about something."}, {"time": 505, "text": "It's genius."}, {"time": 507, "text": "That's why, that's why in only 400 years since Galileo's first look through a telescope, we could get from this really dim, vague, this vague apprehension of another world to sending our eyes and our senses there or even to going beyond."}, {"time": 532, "text": "So it is, it is, it delivers the goods like nothing else, you know, it really, it delivers the goods because it's always, it's always self aware of its fallibility."}, {"time": 546, "text": "So on that topic, I'd like to ask your opinion and a feeling I have that I'm not sure what to do with, which is the, the skeptical aspect of science."}, {"time": 558, "text": "So the modern skeptics community and just in general, certain scientists, many scientists, maybe most scientists that apply the scientific method are kind of rigorous in that application."}, {"time": 570, "text": "And they, it feels like sometimes miss out some of the ideas outside the reaches, just slightly outside of the reach of science."}, {"time": 577, "text": "And they don't dare to sort of dream or think of revolutionary ideas that others will call crazy in this particular moment."}, {"time": 585, "text": "So how do you think about the skeptical aspect of science that is really good at sort of keeping us in check, keeping us humble, but, but at the same time, sort of the kind of dreams that you and Carl Sagan have inspired in the world, it kind of shuts it down sometimes a little bit."}, {"time": 603, "text": "I mean, I think it's up to the individual, but for me, you know, I was so ridiculously fortunate in that I, my tutorial in science, because I'm not a scientist and I wasn't trained in science, was 20 years of days and nights with Carl Sagan."}, {"time": 620, "text": "And the wonder, I think the reason Carl remains so beloved, well, I think there are many reasons, but at the root of it is the fact that his skepticism was never at the cost of his wonder and his wonder was never at the cost of his skepticism."}, {"time": 638, "text": "So he couldn't fool himself into believing something he wanted to believe because it made him feel good at the other."}, {"time": 645, "text": "But on the other hand, he recognized that what science, what nature is, it's really, it's good enough, you know, it's way better than our fantasies."}, {"time": 657, "text": "And so if you, if you're that kind of person who loves happiness, loves life and your eyes are wide open and you read everything you can get your hands on and you spend years studying what is known so far about the universe, then you have that capacity, a really infinite capacity to be alive, but all, and also at the same time to be very rigorous about what you're willing to believe."}, {"time": 688, "text": "For Carl, I don't think he ever felt that his skepticism cost him anything because again, it comes back to love."}, {"time": 697, "text": "He wanted to know what Nietzsche really was like, not to inflict his, you know, preconceived notions on what he wanted it to be."}, {"time": 706, "text": "So you can't go wrong because it doesn't, you know, I mean, you know, I think the pale blue dot is the, is a perfect example of this, of his massive achievement is to say, okay, or the Voyager record is another example is here we have this mission, our first reconnaissance of the outer solar system."}, {"time": 729, "text": "Well, how can we make it a mission in which we absolutely squeeze every drop of consciousness and understanding from it?"}, {"time": 741, "text": "We don't have to be scientists and then be human beings."}, {"time": 745, "text": "I think that's the tragedy of Western civilization is that it's, you know, when it's one of its greatest gifts has been science and yet at the same time, it believing that we are the children of a disappointed father, a tyrant who puts us in a maximum security prison and calls it paradise, who looks at us, who watches us every moment and hates us for being our human selves, you know?"}, {"time": 780, "text": "And then most of all, what is our great sin?"}, {"time": 783, "text": "It's partaking of the tree of knowledge, which is our greatest gift as humans."}, {"time": 789, "text": "This pattern recognition, this ability to see things and then synthesize them and jump to conclusions about them and test those conclusions."}, {"time": 801, "text": "So I think the reason that in literature, in movies, the scientist is a figure of alienation, a figure, you know, oh, you see these biopics about scientists and yeah, he might've been great, but you know, he was missing in ship."}, {"time": 821, "text": "You know, he was a lousy husband."}, {"time": 824, "text": "He lacked, you know, the kind of spiritual understanding that maybe, you know, his wife had and it's always in the end and they come around, but to me, that's a false dichotomy that we are, you know, to the extent that we are aware of our surroundings and understand them, which is what science makes it possible for us to do, we're even more alive."}, {"time": 850, "text": "So you mentioned a million awesome things there, let's even just, can you tell me about the Voyager one and two spacecraft and the interstellar message project and that whole just fascinating world leading up to."}, {"time": 864, "text": "One of my favorite subjects, I love talking about it."}, {"time": 867, "text": "I'll never get over it."}, {"time": 869, "text": "I'll never be able to really wrap my head around the reality of it, the truth of it."}, {"time": 875, "text": "What is it first of all?"}, {"time": 876, "text": "What's the Voyager spacecraft?"}, {"time": 877, "text": "Okay, so Voyagers one and two were our first reconnaissance mission of what was then considered the outer solar system and it was a gift of gravity."}, {"time": 889, "text": "The idea that swinging around these worlds gives you a gravitational assist, which ultimately will send you out of the solar system to wander the Milky Way galaxy for one to five billion years."}, {"time": 908, "text": "So Voyager gave us our first close up look of Jupiter, Saturn, Uranus, Neptune."}, {"time": 919, "text": "It discovered new moons."}, {"time": 921, "text": "It discovered volcanoes on Io."}, {"time": 928, "text": "Its achievements are astonishing."}, {"time": 931, "text": "And remember, this is technology from the early to mid 1970s."}, {"time": 937, "text": "And it's still active."}, {"time": 939, "text": "We talked to Voyager a few days ago."}, {"time": 942, "text": "We talked to it, in fact, a year ago, I think it was."}, {"time": 946, "text": "We needed to slightly change the attitude of the spacecraft."}, {"time": 950, "text": "And so we fired up its thrusters for the first time since 1987."}, {"time": 955, "text": "Did they work?"}, {"time": 957, "text": "Instantly."}, {"time": 958, "text": "It was as if you had left your car in the garage in 1987."}, {"time": 964, "text": "And you put the key in the ignition because you use keys then in the ignition and it turned over the first time you stepped on the gas."}, {"time": 972, "text": "And so that's the genius of the engineering of Voyager."}, {"time": 977, "text": "And Carl was one of the key participants in imagining what its mission would be because it was a gift actually of the fact that every 175 years, plus or minus, there is an alignment of the worlds."}, {"time": 996, "text": "And so you could send two spacecraft to these other worlds and photograph them and use your mass spectrometer and all the other devices on Voyager to really explore these worlds."}, {"time": 1014, "text": "And it's the farthest spacecraft, it's the farthest human creation away from us today."}, {"time": 1055, "text": "And both Voyagers were the first spacecraft that we had that could tell us when that happened."}, {"time": 1061, "text": "So it's a consummate, I think it's the greatest scientific achievement of the 20th century."}, {"time": 1070, "text": "And engineering in some sense."}, {"time": 1071, "text": "Engineering, I mean really, you know, Voyager is doing this on less energy than you have in your toaster, something like 11 Watts."}, {"time": 1084, "text": "So okay, but because of this gravitational assist, both Voyagers were destined, as I say, to, first of all, they were supposed to function for a dozen years and now it's 42 years since launch and we're still talking to them."}, {"time": 1100, "text": "So that's amazing."}, {"time": 1102, "text": "But prior to launch, almost a year, eight, nine months prior to launch, it was decided that since Frank Drake and Carl Sagan and Linda Solzman Sagan had created something called the Pioneer 10 Plaque for the Pioneer spacecraft that preceded Voyager, which was kind of like a license plate for the planet Earth, you know, man and a woman, hands up, you know, very, very basic, but very effective."}, {"time": 1135, "text": "And it captured the imagination of people all over the world."}, {"time": 1139, "text": "And so NASA turned to Frank and to Carl and said, we'd like you to do a message for Voyager because if it's going to be circumnavigating the Milky Way galaxy for one to five billion years, you know, it's like 20 trips around the galaxy."}, {"time": 1160, "text": "And there's a very small chance that a space faring civilization would be able to flag one of them down."}, {"time": 1169, "text": "And so on board, you see this exquisite golden disc with scientific hieroglyphics explaining our address and various basic scientific concepts that we believe that would be common to any space faring civilization."}, {"time": 1191, "text": "And then beneath this exquisite golden disc is the Voyager record, the golden record."}, {"time": 1200, "text": "And it contains something like 118 photographs, images of life on Earth, as well as 27 pieces of music from all around the world."}, {"time": 1219, "text": "Many people describe it as the invention of world music."}, {"time": 1222, "text": "World music was not a concept that existed before the Voyager record."}, {"time": 1227, "text": "And we were determined to take our music, not just from the dominant technical cultures, but from all of the rich cultural heritage of the Earth."}, {"time": 1239, "text": "And there's a sound essay, which is a kind of using a microphone as a camera to tell the story of the Earth, beginning with its geological sounds and moving into biology and then into technology."}, {"time": 1260, "text": "And I think what you were getting at is that at the end of this sound essay, I had asked Carl if it were, in the making of the record, it was my honor to be the creative director of the project, if it was possible to, if I had meditated for an hour while I was hooked up so that every single signal that was coming from my brain, my body, was recorded and then converted into sound for the record."}, {"time": 1299, "text": "Was it possible that these putative extraterrestrials of the distant future, of perhaps a billion years from now, would be able to reconstitute this message and to understand it?"}, {"time": 1311, "text": "And he just, big smile, you know, and just said, well, hey, a billion years is a long time."}, {"time": 1317, "text": "It's a long time."}, {"time": 1318, "text": "Go do it."}, {"time": 1319, "text": "And so I did this."}, {"time": 1321, "text": "And what were you thinking about in the meditation?"}, {"time": 1323, "text": "Like what, I mean, it's such an interesting idea of recording as you think about things."}, {"time": 1329, "text": "What were you thinking about?"}, {"time": 1330, "text": "So I was blindfolded and couldn't hear anything."}, {"time": 1337, "text": "And I had made a mental itinerary of exactly where I wanted to go."}, {"time": 1343, "text": "I was truly humbled by the idea that these thoughts could conceivably touch the distant future."}, {"time": 1355, "text": "So in 1977, there are some 60,000 nuclear weapons on the planet."}, {"time": 1361, "text": "The Soviet Union and the United States are engaged in a, you know, to the death competition."}, {"time": 1371, "text": "And so I began by trying to tell the history of the planet in, you know, to my limited ability what I understood about the story of the early existence of the planet, about the origin of life, about the evolution of life, about the history of humans, about our current at that time predicament, about the fact that one in five of us was starving or unable to get potable water."}, {"time": 1409, "text": "And so I sort of gave a kind of, you know, as general a picture as I possibly could of our predicament."}, {"time": 1419, "text": "And I also was very newly within days of the moment when Carl and I fell in love with each other."}, {"time": 1431, "text": "We had fallen in love with each other long before because we'd known each other for years, but it was the first time that we had expressed our feelings for each other."}, {"time": 1439, "text": "Acknowledged it, the existence of this love."}, {"time": 1441, "text": "Yes, because we were both involved with other people and it was a completely outside his morality and mine to even broach the subject."}, {"time": 1453, "text": "But it was only days after that it happened."}, {"time": 1457, "text": "And for me, it was a eureka moment."}, {"time": 1460, "text": "It was in the context of finding that piece of Chinese music that was worthy to represent one of the oldest musical traditions on earth when those of us who worked on the Voyager record were completely ignorant about Chinese music."}, {"time": 1478, "text": "And so that had been a constant challenge for me, talking to professors of Chinese music, listening to musicologists everywhere and all through the project, desperately trying to find this one piece."}, {"time": 1494, "text": "Found the piece, lived on the Upper West Side, found the piece, a professor at Columbia University gave it to me."}, {"time": 1504, "text": "And of all the people I talked to, everyone had said, that's hopeless."}, {"time": 1508, "text": "You can't do that."}, {"time": 1509, "text": "There can't be one piece of Chinese music."}, {"time": 1512, "text": "But he was completely, no problem, I've got it."}, {"time": 1517, "text": "And so he told me the story of the piece, which only made it an even greater candidate for the record."}, {"time": 1527, "text": "And I listened to it, called Carl Sagan, who was in Tucson, Arizona addressing the American Society of Newspaper Editors."}, {"time": 1540, "text": "And I left him a message, hotel message center."}, {"time": 1545, "text": "And he called me back an hour later."}, {"time": 1551, "text": "And I heard this beautiful voice say, I get back to my hotel room, and I find this message that Annie called."}, {"time": 1560, "text": "And I asked myself, why didn't you leave me this message 10 years ago?"}, {"time": 1565, "text": "My heart was beating out of my chest."}, {"time": 1569, "text": "I, it was for me a kind of eureka moment, a scientific breakthrough, a truth, a great truth had suddenly been revealed."}, {"time": 1584, "text": "And of course, I was awkward and didn't really know what to say."}, {"time": 1587, "text": "And so I blurted something out like, oh, I've been meaning to talk to you about that, Carl, which wasn't really true."}, {"time": 1593, "text": "I never would have talked to him about it."}, {"time": 1594, "text": "We had been alone countless times."}, {"time": 1596, "text": "We humans are so awkward in these moments and these amazing moments."}, {"time": 1601, "text": "And I just said, for keeps."}, {"time": 1605, "text": "And he thought for a very brief, like a second and said, you mean get married?"}, {"time": 1611, "text": "And I said, yeah."}, {"time": 1612, "text": "And he said, yeah."}, {"time": 1615, "text": "And we put down the phone."}, {"time": 1620, "text": "And I literally was jumping around my apartment like a lunatic, because it was so obvious, you know, it was something like, of course."}, {"time": 1632, "text": "And then the phone rang again."}, {"time": 1634, "text": "And I thought, damn, no, he's going to say, I don't know what I was saying."}, {"time": 1639, "text": "I am married."}, {"time": 1640, "text": "I have a kid."}, {"time": 1641, "text": "I'm not going to do this, you know?"}, {"time": 1643, "text": "But he was like, I just want to make sure that that really happened."}, {"time": 1648, "text": "And he said, we're getting married."}, {"time": 1650, "text": "And I said, yeah, we're getting married."}, {"time": 1652, "text": "Now this was June 1st, 1977."}, {"time": 1656, "text": "The records had not been affixed to the spacecraft yet."}, {"time": 1662, "text": "And there had been a lot of controversy about what we were doing."}, {"time": 1667, "text": "I should say that among the 118 pictures was an image of a man and a woman, frontally, completely naked."}, {"time": 1680, "text": "And there was, I believe, a congressman on the floor that said, NASA to send smut to the stars, you know?"}, {"time": 1689, "text": "And so NASA really, they got very upset and they said, you can't send a picture."}, {"time": 1694, "text": "And we had done it so that it was so brilliant."}, {"time": 1696, "text": "It was like this lovely couple, completely naked."}, {"time": 1700, "text": "And then the next image was a kind of overlay schematic to show the fetus inside this woman that was developing."}, {"time": 1710, "text": "And then that went off into, you know, additional imagery of human reproduction."}, {"time": 1716, "text": "And it really hit me that how much we hate ourselves, that we couldn't bear to be seen as we are."}, {"time": 1726, "text": "So in some sense that congressman also represents our society."}, {"time": 1733, "text": "Perhaps his opposition should have been included as well."}, {"time": 1736, "text": "Well, that was one of the most vigorous debates during the making of the record with the, you know, the five, six people that we collaborated with was, do we show, do we only put our best foot forward?"}, {"time": 1749, "text": "Or do we show Hiroshima, Auschwitz, the Congo, what we have done?"}, {"time": 1757, "text": "What do you think represents humanity?"}, {"time": 1760, "text": "If you kind of, if you think about it, do our darker moments, are they essential for humanity?"}, {"time": 1767, "text": "All the wars we've been through, all the tortures and the suffering and the cruelty."}, {"time": 1772, "text": "Is that essential for happiness, for beauty, for creation, generally speaking?"}, {"time": 1777, "text": "Well, certainly not essential for happiness or beauty, that's for sure."}, {"time": 1825, "text": "It's like, if like a great work of art that's a forgery, people can be fooled immediately, but 10 or 15 years, 20 years later, they start to look at it and, you know, they begin to realize the lens, our lens of our present is coloring everything that we see."}, {"time": 1845, "text": "So you know, I think it didn't matter that we didn't show our atrocities."}, {"time": 1852, "text": "They would fill in the blanks."}, {"time": 1855, "text": "So let me sort of ask, you've mentioned how unlikely it is that you and Carl did two souls like yours would meet in this vast world."}, {"time": 1866, "text": "What are your views on how and why incredibly unlikely things like these nevertheless do happen?"}, {"time": 1873, "text": "It's purely to me, chance."}, {"time": 1875, "text": "It's totally random."}, {"time": 1877, "text": "It's a just, I mean, but, and the fact is, is that some people are, and it's happening every day right now."}, {"time": 1886, "text": "Some people are the random casualties of chance and that, and I don't just mean the people who are being, you know, destroyed in childhood, in wartime, I'm also, or the people who starved to death because of famine, but also the people who, you know, who are not living to the fullest, all of these things."}, {"time": 1913, "text": "And I think there's a, my parents met on the subway in rush hour."}, {"time": 1917, "text": "And so I'm only here with you because of the most random possible situation."}, {"time": 1923, "text": "And so I've had this, a sense of this, even before I knew Carl, I always felt this way that I only existed because of the generosity of the rush hour, no, of just all of the things, all of the skeins of causality."}, {"time": 1941, "text": "It's interesting because, you know, the rush hour is a source of stress for a lot of people, but clearly in its moments, it can also be a source of something beautiful."}, {"time": 1953, "text": "Of strangers meeting and so on."}, {"time": 1955, "text": "So everything, everything is, has a possibility of doing something beautiful."}, {"time": 1963, "text": "So let me ask sort of a quick tangent on the Voyager, this, this beautiful romantic notion that Voyager One is sort of our farthest human reach into space."}, {"time": 1975, "text": "If you think of what, I don't know if you've seen, but what Elon Musk did with putting the Roadster, letting it fly out into space, there's a sort of humor to it."}, {"time": 1987, "text": "I think that's also kind of interesting, but maybe you can comment on that."}, {"time": 1992, "text": "But in general, if now that we are developing what we were venturing out into space again in a more serious way, what kind of stuff that represent since Voyager was launched, should we send out as a followup?"}, {"time": 2008, "text": "Is there things that you think that's developed in the next, in the 40 years after that we should update the spacefaring aliens?"}, {"time": 2018, "text": "Well, of course now we could send the worldwide, we could send everything that's on the worldwide web."}, {"time": 2025, "text": "We could send, I mean, you know, that was a time when we're talking about photograph records and transistor radios and, you know, so we tried to be, to take advantage of the existing technology to the fullest extent, you know, the computer that was hooked up to me from my brainwaves and my heart sounds while I was meditating was, you know, the size of a gigantic room."}, {"time": 2051, "text": "And I'm sure it's not that, it didn't have the power of a phone, as the phone has now."}, {"time": 2057, "text": "So you know, now we could just, I think we could let it all hang out and just like send, you know, every week."}, {"time": 2063, "text": "I mean, that's the wonder, like I would send, you know, Wikipedia or something and not be a gatekeeper, but show who we are."}, {"time": 2074, "text": "You were also, it's interesting because one of the problems of the internet of having so much information is it's actually the curation, the human curation is still the powerful, beautiful thing."}, {"time": 2089, "text": "So what you did with the record is actually, is exactly the right process."}, {"time": 2094, "text": "It's kind of boiling down a massive amount of possibilities of what you could send into something that represents, you know, the better angels of our nature or represents our humanity."}, {"time": 2105, "text": "So if you think about, you know, what would you send from the internet as opposed to sending all of Wikipedia, for example, all human knowledge, is there something just new that we've developed, you think, or fundamentally we're still the same kind of human species?"}, {"time": 2124, "text": "I think fundamentally we're the same, but we have advanced to an astonishing degree in our capacity for data retrieval and for transmission."}, {"time": 2137, "text": "And so, you know, I would send YouTube, I would send, you know, really like think of all the, you know, I still feel so lucky that there's any great musical artist of the last hundred years who I revere, I can just find them and watch them and listen to them."}, {"time": 2160, "text": "And you know, that's fantastic."}, {"time": 2162, "text": "I also love how democratic it is that we each become curators and that we each decide those things."}, {"time": 2170, "text": "Now, I may not agree with, you know, the choices that everyone makes, but of course not because that's not the point."}, {"time": 2179, "text": "The point is, is that we are, you know, we have discovered largely through the internet that we are an intercommunicating organism and that can only be good."}, {"time": 2193, "text": "So you could also send now, Cosmos."}, {"time": 2196, "text": "Yes, I'd love to."}, {"time": 2198, "text": "I would be proud to."}, {"time": 2200, "text": "I mean, you've spoken about a very specific voice that Cosmos had in that it reveals the magic of science."}, {"time": 2210, "text": "I think you said shamanic journey of it and not the details of the latest breakthroughs or so on."}, {"time": 2217, "text": "Just revealing the magic."}, {"time": 2218, "text": "Can you try to describe what this voice of Cosmos is with the follow up and the new Cosmos that you're working on now?"}, {"time": 2229, "text": "Yes, well, the dream of Cosmos is really like Einstein's quote, you know, it's the idea of the awesome power of science to be in absolutely everyone's hands."}, {"time": 2245, "text": "You know, it belongs to all of us."}, {"time": 2247, "text": "It's not the preserve of a priesthood."}, {"time": 2251, "text": "It's just the community of science is becoming more diverse and being less exclusive than it was guilty of in the not so recent past."}, {"time": 2261, "text": "The discoveries of science, our understanding of the Cosmos that we live in has really grown by leaps and bounds and probably we've learned more in the last hundred years about it."}, {"time": 2278, "text": "You know, the tempo of discovery has picked up so rapidly."}, {"time": 2284, "text": "And so the idea of Cosmos from the 1970s when Carl and I and Steven Soder, another astronomer, first imagined it was that interweaving not only of the scientific concepts and revelations and using, you know, cinematic VFX to take the viewer on this transporting, uplifting journey but also the stories of the searchers."}, {"time": 2316, "text": "Because the more I have learned about, you know, the process of science through my life with Carl and sense, the more I am really persuaded that it's that adherence to the facts and to that adherence to that little approximation, that little bit of reality that we've been able to get our hands around is something that we desperately need and it doesn't matter if you are a scientist."}, {"time": 2351, "text": "In fact, the people, it matters even more if you're not."}, {"time": 2394, "text": "The idea that we could do this and, you know, in season two of Cosmos, the Space Time Odyssey, we were in 181 countries in the space of two weeks."}, {"time": 2406, "text": "It was the largest rollout in television history, which is really amazing for a, there is no science based programming."}, {"time": 2415, "text": "By the way, just to clarify, the series was rolled out, so it was shown in not that many countries."}, {"time": 2421, "text": "You said we were in."}, {"time": 2422, "text": "Well, our show was in 180 countries."}, {"time": 2425, "text": "Yeah, the show, which is incredible."}, {"time": 2427, "text": "I mean, the hundreds of millions, whatever that number is, the people that watched it, it's just, it's crazy."}, {"time": 2433, "text": "It's so crazy that, for instance, my son had a cerebral hemorrhage a year ago and the doctor who saved his life in a very dangerous situation."}, {"time": 2450, "text": "When he realized that, you know, that Sam and I were who we were, he said, that's why I'm here."}, {"time": 2460, "text": "You know, he said, if you come of age in a poor country like Colombia and Carl Sagan calls you to science when you're a child, then, then, you know, you go to medicine because that's the only avenue open to you, but that's why I'm here."}, {"time": 2477, "text": "And I've heard that story and I hear that story, I think every week."}, {"time": 2486, "text": "I mean, the number of scientists, I mean, a lot of it is quiet, right?"}, {"time": 2491, "text": "But the number of scientists Cosmos has created is just countless."}, {"time": 2496, "text": "I mean, it probably touched a lot of, I don't know, probably it could be a crazy number of the 90% of scientists or something that have been."}, {"time": 2503, "text": "I would love to do that census because I, because that's the greatest gratification, because that's the dream of science."}, {"time": 2512, "text": "That's the whole idea is that if it belongs to all of us and not just a tiny few, then we have some chance of determining how it's used."}, {"time": 2523, "text": "And if it's only in the hands of people whose only, whose only interests are the balance sheet or hegemony over other nations or things like that, then it'll probably end up being a gun aimed at our heads."}, {"time": 2542, "text": "But if it's distributed in the widest possible way, a capability that we now have because of our technology, then the chance is that it will be used with wisdom."}, {"time": 2558, "text": "That's the dream of it."}, {"time": 2559, "text": "So that's why we did the first Cosmos."}, {"time": 2562, "text": "We wanted to take not just, as I say, the scientific information, but also tell the stories of these searchers."}, {"time": 2573, "text": "Because for us, and for me, carrying on this series in the second and third seasons, the primary interest was that we wouldn't tell a story unless it was a kind of a threefer."}, {"time": 2589, "text": "It was not just a way to understand a new scientific idea, but it was also a way to understand what, if it matters what's true, how the world can change for us and how we can be protected."}, {"time": 2607, "text": "And if it doesn't matter what's true, then we're in grave danger because we have the capability to not only destroy ourselves and our civilization, but to take so many species with us."}, {"time": 2622, "text": "And I'd like to talk to you about that particular, sort of the dangers of ourselves in a little bit, but sort of to linger on Cosmos."}, {"time": 2631, "text": "Maybe for the first, the 1980 and the 2014 follow up, what's a, or one of the, or several memorable moments from the creation of either of those seasons?"}, {"time": 2680, "text": "And so I think both of those things, sorry to interrupt, both of those things are given what Cosmos represents, the legacy of it and the legacy of Carl Sagan is essential control, especially in the modern world."}, {"time": 2694, "text": "It's wonderful that you sought control, that you did not really push it."}, {"time": 2698, "text": "And I kept saying no."}, {"time": 2699, "text": "And my partners, I'm sure, you know, they would look at me like I was nuts, you know, and they probably must have entertained the idea that maybe I didn't really want to do it, you know, because I was afraid or something, but I kept saying no."}, {"time": 2712, "text": "And it wasn't until I met Seth MacFarlane and he took me to Fox and to Peter Rice and said, you know, I'll pay for half the pilot if I have to, you know, and Peter Rice was like, put your money away."}, {"time": 2727, "text": "And in every time since, in the 10 years since, at every turn, when we needed Seth to intervene on our behalf, he stood up and he did it."}, {"time": 2743, "text": "And so that was like, in a way, that is the watershed for me of everything that followed since."}, {"time": 2752, "text": "And I was so lucky because, you know, Steve Soder and I written the original Cosmos with Carl and collaborated on the treatment for season two."}, {"time": 2764, "text": "And then Brennan Braga came into our project at the perfect moment and has proven to be just the, really, I have been so lucky my whole life."}, {"time": 2777, "text": "I've collaborated, I've been lucky with the people, my collaborators have been extraordinary."}, {"time": 2783, "text": "And so that was a critical thing."}, {"time": 2786, "text": "But also to have, you know, for instance, our astonishing VFX supervisor who comes from the movies, who heads the global association of VFX people, Jeff Okun."}, {"time": 2799, "text": "And then, you know, I could rattle off 10 more names, I'd be happy to do that."}, {"time": 2806, "text": "And it was that collaboration."}, {"time": 2809, "text": "So the people were essential to the creation of..."}, {"time": 2813, "text": "I mean, when it came down, I have to say that when it came down to the vision of what the series would be, that was me sitting in my home, looking out the window and, you know, really imagining like what I wanted to do."}, {"time": 2826, "text": "Can you pause on that for a second?"}, {"time": 2827, "text": "Like what's that process?"}, {"time": 2828, "text": "Because it, you know, Cosmos is also, it's grounded in science, of course, but it's also incredibly imaginative and the words used are carefully crafted."}, {"time": 2840, "text": "So what's..."}, {"time": 2841, "text": "If you can talk about the process of that, the big picture, imaginative thinking, and sort of the rigorous crafting of words that like basically turns into something like poetry."}, {"time": 2855, "text": "Thank you so much."}, {"time": 2857, "text": "For me, these are rare occasions for human self esteem."}, {"time": 2864, "text": "The scientists that we bring to life in Cosmos are people, in my view, who have everything we need to see us through this current crisis."}, {"time": 2880, "text": "They're, very often they come, they're poor, they're female, they're outsiders who are not expected to have gifts that are so prodigious, but they persevere."}, {"time": 2899, "text": "And so you have someone like Michael Faraday, who comes from a family, dysfunctional family of like 14 people and, you know, it never goes to, university never learns the math."}, {"time": 2913, "text": "But, you know, is the, you know, there's Einstein years later looking up at the picture of Faraday to inspire him."}, {"time": 2924, "text": "So it's, you know, if we had people with that kind of humility and unselfishness who didn't want to patent everything, as, you know, Michael Faraday created the wealth of the 20th century with his various inventions."}, {"time": 2945, "text": "And yet he never took out a single patent at a time when people were patenting everything because that was not what he was about."}, {"time": 2953, "text": "And to me, that's a kind of almost a saintliness that says that, you know, here's a man who finds in his life, this tremendous gratification from searching."}, {"time": 2968, "text": "And it's just so impressive to me."}, {"time": 2970, "text": "And there are so many other people in Cosmos, especially the new season of Cosmos, which is called Possible Worlds."}, {"time": 2976, "text": "Possible, beautiful title."}, {"time": 2977, "text": "Possible Worlds, well, I stole it from an author and a scientist from the 1940s."}, {"time": 2984, "text": "But it, for me, encapsulates not just, you know, the exoplanets that we've begun to discover, not just, you know, the worlds that we might visit, but also the world that this could be, a hopeful vision of the future."}, {"time": 3003, "text": "You asked me what is common to all three seasons of Cosmos or what is that voice?"}, {"time": 3008, "text": "It's a voice of hope."}, {"time": 3010, "text": "It's a voice that says there is a future which we bring to life in, I think, a fairly dazzling fashion that we can still have, you know?"}, {"time": 3021, "text": "And in sitting down to imagine what this season would be, the new season would be, I'm sitting where I live in Ithaca, beautiful, just gorgeous place, trees everywhere, waterfalls, I'm sitting there thinking, well, you know, you can't, how do you, how do you awaken people?"}, {"time": 3041, "text": "I mean, you can't yell at them and say we're all going to die, you know?"}, {"time": 3045, "text": "It doesn't help."}, {"time": 3049, "text": "But I think if you give them a vision of the future that's not pie in the sky, but something, ways in which science can be redemptive, can actually remediate our future."}, {"time": 3066, "text": "We have those capabilities right now, as well as the capabilities to do things in the Cosmos that we could be doing right now, but we're not doing them."}, {"time": 3079, "text": "Not because we don't know how to, how, you know, with the engineering or the material sciences or the physics, we know all we need to know, but we're a little bit paralyzed in some sense."}, {"time": 3093, "text": "And you know, we're like, I always think we're like the toddler, you know, like we, we left our mother's legs, you know, and scurried out to the moon."}, {"time": 3103, "text": "And we had a moment of, wow, we can do this."}, {"time": 3106, "text": "And then we realized, and somehow we had a failure of nerve and we went scurrying back to our mother and, you know, did things that really weren't going to get us out there, like the space shuttle, things like that, because it was a kind of failure of nerve."}, {"time": 3122, "text": "So Cosmos is about overcoming those fears."}, {"time": 3127, "text": "We're now as a civilization, ready to be a teenager venturing out into college."}, {"time": 3132, "text": "We're returning back."}, {"time": 3135, "text": "And that's one of my theories about our current situation is that this is our adolescence."}, {"time": 3145, "text": "And I was a total mess as an adolescent."}, {"time": 3148, "text": "I was reckless, irresponsible, totally."}, {"time": 3151, "text": "I didn't, I was inconsiderate."}, {"time": 3154, "text": "I, the reality of other people's feelings and the future didn't exist for me."}, {"time": 3161, "text": "So why should a technologically adolescent civilization be any different?"}, {"time": 3166, "text": "But you know, the vast majority of people I know made it through that period and went on to be more wise."}, {"time": 3179, "text": "And that's what my hope is for our civilization."}, {"time": 3182, "text": "On a sort of a darker and more difficult subject in terms of, so you just talked about the Cosmos being an inspiration for science and for us growing out of our messy adolescence, but nevertheless, there is threats in this world."}, {"time": 3202, "text": "So do you worry about existential threats?"}, {"time": 3205, "text": "Like you mentioned nuclear weapons, do you worry about nuclear war?"}, {"time": 3211, "text": "And if you could also maybe comment, I don't know how much you've thought about it, but there's folks like Elon Musk who are worried about the existential threats of artificial intelligence."}, {"time": 3221, "text": "Sort of our robotic computer creations sort of resulting in us humans losing control."}, {"time": 3229, "text": "So can you speak to the things that worry you in terms of existential concerns?"}, {"time": 3234, "text": "All of the above."}, {"time": 3235, "text": "You don't have to be silly, you know, like not to think and not to look at, for instance, our rapidly burgeoning capability in artificial intelligence."}, {"time": 3249, "text": "And to see how sick so much of the planet is not to be concerned."}, {"time": 3256, "text": "And sick is an evil potentially."}, {"time": 3258, "text": "Well, how much cruelty and brutality is happening at this very moment?"}, {"time": 3265, "text": "And I would put climate change higher up on that list, because I believe that there are unforeseen discoveries that we are making right now, for instance, all that methane that's coming out of the ocean floor that was sequestered because of the permafrost, which is now melting."}, {"time": 3289, "text": "You know, I think there are other effects besides our greed and short term thinking that we are triggering now with all the greenhouse gases we're putting into the atmosphere."}, {"time": 3302, "text": "And that worries me day and night."}, {"time": 3304, "text": "I think about it every single, every moment, really, because I really think that's how we have to be."}, {"time": 3311, "text": "We have to begin to really focus on how grave the challenge is to our civilization and to the other species that are."}, {"time": 3326, "text": "It's a mass, this is a mass extinction event that we're living through."}, {"time": 3331, "text": "And we're seeing it."}, {"time": 3332, "text": "We're seeing news of it every day."}, {"time": 3335, "text": "So what do you think about another touchy subject, but what do you think about the politicization of science on topics like global warming and bionic stem cell research and other topics like it?"}, {"time": 3349, "text": "What do you mean by the politicization of global warming?"}, {"time": 3353, "text": "Meaning that if you say, I think what you just said, which is a global warming is a serious concern, it's human caused and maybe some detrimental effects."}, {"time": 3365, "text": "Certainly there's a large percent of the population of the United States that would, as opposed to listening to that statement, would immediately think, oh, that's just a liberal talking point."}, {"time": 3380, "text": "That's what I mean by politicization."}, {"time": 3381, "text": "I think that's not so true anymore."}, {"time": 3382, "text": "I don't think our problem is a population that's skeptical about climate change because I think that the extreme weather and fire events that we are experiencing with such frequency is really gotten to people."}, {"time": 3400, "text": "I think that there are people in leadership positions who choose to ignore it and to pretend it's not there, but ultimately I think they will be rejected."}, {"time": 3415, "text": "The question is, will it be fast enough?"}, {"time": 3455, "text": "You ask me, what is the message of cosmos?"}, {"time": 3460, "text": "It's that we have to think in longer terms."}, {"time": 3466, "text": "I think of the Soviet Union and the United States in the Cold War and they're ready to kill each other over these two different views of the distribution of resources."}, {"time": 3477, "text": "But neither of them has a form of human social organization that thinks in terms of a hundred years, let alone a thousand years, which are the time scales that science speaks in."}, {"time": 3491, "text": "And that's part of the problem is that we have to get a grip on reality and where we're headed and I'm not fatalistic at all, but I do feel like, and in setting out to do this series each season, we were talking about climate change in the original cosmos in episode four and warning about inadvertent climate modification in 1980."}, {"time": 3526, "text": "And of course, Carl did his PhD thesis on the greenhouse effect on Venus and he was painfully cognizant of what a runaway greenhouse effect would do to our planet."}, {"time": 3538, "text": "And not only that, but the climatic history of the planet, which we go into in great detail in the series."}, {"time": 3543, "text": "So yeah, I mean, how are we going to get a grip on this if not through some kind of understanding of science?"}, {"time": 3552, "text": "Can I just say one more thing about science is that its powers of prophecy are astonishing."}, {"time": 3562, "text": "You launch a spacecraft in 1977 and you know where each and every planet in the solar system is going to be and every moon and you rendezvous with that flawlessly and you exceed the design specifications of the greatest dreams of the engineers."}, {"time": 3584, "text": "And then you go on to explore the Milky Way galaxy and you do it, I mean, you know, the climate scientists, some of the people whose stories we tell in cosmos, their predictions were, and they were working with very early computer modeling capabilities, they have proven to be so robust, nuclear winter, all of these things."}, {"time": 3612, "text": "This is a prophetic power and yet how crazy that, you know, it's like the Romans with their lead cooking pots and their lead pipes or the Aztecs ripping out their own people's hearts."}, {"time": 3627, "text": "This is us."}, {"time": 3628, "text": "We know better and yet we are acting as if it's business as usual."}, {"time": 3667, "text": "Oh, they all inspire me."}, {"time": 3669, "text": "Every one of those inspire me, but I have to say that to me at the origin of, as I've gotten older, to me, the origin of life has become less interesting because I feel, well, not because it's more, I think I understand, I have a better grasp of how it might've happened."}, {"time": 3691, "text": "Do you think it was a huge leap?"}, {"time": 3726, "text": "And the origin of consciousness is to me also not so amazing if you think of it as going back to these one celled organisms of a billion years ago who had to know, well, if I go higher up, I'll get too much sun and if I go lower down, I'll be protected from UV rays, things like that."}, {"time": 3751, "text": "They had to know that or you, I eat, me, I don't."}, {"time": 3754, "text": "I mean, even that, I can see if you know that, then knowing what we know now, it's just, it's not so hard to fathom."}, {"time": 3763, "text": "It seems like, I've never believed there was a duality between our minds and our bodies and I think that even consciousness, all those interesting things seem to me, except one of the things... A byproduct of geophysics."}, {"time": 3779, "text": "Yeah, all of chemistry, yes, geochemistry, geophysics, absolutely."}, {"time": 3787, "text": "It makes perfect sense to me and it doesn't make it any less wondrous."}, {"time": 3792, "text": "It doesn't rob it at all of the wonder of it."}, {"time": 3799, "text": "And so, yeah, I think that's amazing."}, {"time": 3801, "text": "I think we tell the story of someone you have never heard of, I guarantee, and I think you're very knowledgeable on the subject, who was more responsible for our ability to venture out to other worlds than anyone else and who was completely forgotten."}, {"time": 3820, "text": "And so, those are the kinds of stories I like best for Cosmos because... Can you tell me who?"}]}]